{"paperId": "6c2780f5f2152bc1fc514dcd816f5350d6e5d1e8", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "A Two-level Spatial In-Memory Index", "abstract": "Very large volumes of spatial data increasingly become available and demand effective management. While there has been decades of research on spatial data management, few works consider the current state of commodity hardware, having relatively large memory and the ability of parallel multi-core processing. In this work, we re-consider the design of spatial indexing under this new reality. Specifically, we propose a main-memory indexing approach for objects with spatial extent, which is based on a classic regular space partitioning into disjoint tiles. The novelty of our index is that the contents of each tile are further partitioned into four classes. This second-level partitioning not only reduces the number of comparisons required to compute the results, but also avoids the generation and elimination of duplicate results, which is an inherent problem of spatial indexes based on disjoint space partitioning. The spatial partitions defined by our indexing scheme are totally independent, facilitating effortless parallel evaluation, as no synchronization or communication between the partitions is necessary. We show how our index can be used to efficiently process spatial range queries and drastically reduce the cost of the refinement step of the queries. In addition, we study the efficient processing of numerous range queries in batch and in parallel. Extensive experiments on real datasets confirm the efficiency of our approaches.", "venue": "arXiv.org", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-05-18", "journal": {"name": "ArXiv", "volume": "abs/2005.08600"}, "authors": [{"authorId": "2667053", "name": "Dimitrios Tsitsigkos"}, {"authorId": "48864126", "name": "Konstantinos Lampropoulos"}, {"authorId": "2850971", "name": "Panagiotis Bouros"}, {"authorId": "1718168", "name": "N. Mamoulis"}, {"authorId": "2454554", "name": "Manolis Terrovitis"}], "citations": [{"paperId": "44d2cfdc0aef124663545b1a312db246e3de4b76", "title": "Enhancing In-Memory Spatial Indexing with Learned Search"}, {"paperId": "25017b33fc8259d7a3bfa40ff010a29dbbfeac1d", "title": "Growth of relational model: Interdependence and complementary to big data"}, {"paperId": "a425bb902ad8217efd5c6efc957364a31890eb93", "title": "How Good Are Modern Spatial Libraries?"}, {"paperId": "22481f4a3ce9ae3bfe59f2ee07ca61c875bd18ff", "title": "The Case for Learned Spatial Indexes"}]}
