{"paperId": "6c28065851f020535030663ac839c1e3b5dde391", "publicationVenue": {"id": "c3e5f1c8-9ba7-47e5-acde-53063a69d483", "name": "Future Internet", "type": "journal", "issn": "1999-5903", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-156830", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-156830", "https://www.mdpi.com/journal/futureinternet"]}, "title": "Network Function Virtualization and Service Function Chaining Frameworks: A Comprehensive Review of Requirements, Objectives, Implementations, and Open Research Challenges", "abstract": "Network slicing has become a fundamental property for next-generation networks, especially because an inherent part of 5G standardisation is the ability for service providers to migrate some or all of their network services to a virtual network infrastructure, thereby reducing both capital and operational costs. With network function virtualisation (NFV), network functions (NFs) such as firewalls, traffic load balancers, content filters, and intrusion detection systems (IDS) are either instantiated on virtual machines (VMs) or lightweight containers, often chained together to create a service function chain (SFC). In this work, we review the state-of-the-art NFV and SFC implementation frameworks and present a taxonomy of the current proposals. Our taxonomy comprises three major categories based on the primary objectives of each of the surveyed frameworks: (1) resource allocation and service orchestration, (2) performance tuning, and (3) resilience and fault recovery. We also identify some key open research challenges that require further exploration by the research community to achieve scalable, resilient, and high-performance NFV/SFC deployments in next-generation networks.", "venue": "Future Internet", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-02-15", "journal": {"name": "Future Internet", "pages": "59", "volume": "14"}, "authors": [{"authorId": "122304580", "name": "H. U. Adoga"}, {"authorId": "2449975", "name": "D. Pezaros"}], "citations": [{"paperId": "dd69f811e8055eb7c1371a4075eb32ca2aab19d1", "title": "Optimizing high availability multi-controller placement in SDN/NFV 5G networks: a survey"}, {"paperId": "332a637e6c0668ba98311360b567fad5ed66b052", "title": "Service Function Chain Deployment Using Deep Q Learning and Tidal Mechanism"}, {"paperId": "24e71307d8780b24c8f0b5e115e65bdb0699d4e4", "title": "Detection and Mitigation of Security Threats Using Virtualized Network Functions in Software-Defined Networks"}, {"paperId": "0356ecf82505fc3982a865e99f57efc79bf34146", "title": "Towards Latency-aware vNF Placement on Heterogeneous Hosts at the Network Edge"}, {"paperId": "93f2b4b847fbb3044badba5fe31ba459d4209bf2", "title": "A Dynamic IIoT Framework Based on the Publish–Subscribe Paradigm"}, {"paperId": "b28aa91a15b81efb24737fc4189f731c5d49c2d0", "title": "Q-Delegation: VNF Load Balancing Through Reinforcement Learning-Based Packet Delegation"}, {"paperId": "3dbff6ab7fef25580d05b31853f344e60d4f37d1", "title": "HADES: An NFV solution for energy-efficient placement and resource allocation in heterogeneous infrastructures"}, {"paperId": "398c8c793e1bf94b78fbc0dc0c5918f5029ea3f2", "title": "Service Function Chaining to Support Ultra-Low Latency Communication in NFV"}, {"paperId": "e973d0f77ae1a139af46a8d190500e098c06118f", "title": "Ensuring resilience: Integrating IT disaster recovery planning and business continuity for sustainable information technology operations"}, {"paperId": "cd01790d3e116682c24a8bf34300eb0e2c4ad3eb", "title": "Dynamic and Mobility-Aware VNF Placement in 5G-Edge Computing Environments"}, {"paperId": "ddfb6061394b2b8a45d3cc17f015415adfc45cab", "title": "Load Balancing of Virtual Network Functions through Packet Delegation"}, {"paperId": "007f189ba93cb0ad1d4dcca582eda86190e11712", "title": "Machine Learning-Based Anomaly Detection in NFV: A Comprehensive Survey"}, {"paperId": "8db09efb3b86637854fbd212cf58e771df141d32", "title": "Uniform Resource Clustering for Service Function Chaining in NFV-based Cloud Environment"}, {"paperId": "f6c1cda3cf328b71dadab562ff9ceeabdefdaba6", "title": "A Vision For Hierarchical Federated Learning in Dynamic Service Chaining"}, {"paperId": "ba28364bdc750d29ea4cb22481346c51907d0cb6", "title": "SFC security survey: Addressing security challenges and threats in Service Function Chaining"}, {"paperId": "63fd2b83ba497961ea7be9463dc214688ebc04ad", "title": "A novel reliable low-latency service function chaining to enable URLLC in NFV"}, {"paperId": "386fbf2374503b4e26caa8b1470c9c8b4825c668", "title": "Secure Service Function Chaining in the Context of Zero Trust Security"}, {"paperId": "8eb81a06ad31e594cad7f041aae60f7af540fb5b", "title": "On the Performance Benefits of Heterogeneous Virtual Network Function Execution Frameworks"}, {"paperId": "ed059553ccef4311d710294ea950af42c346d8e4", "title": "Exploring Quantum Sensing Potential for Systems Applications"}, {"paperId": "fca0cdc5a25900749b097351f28bc29acfabe5e6", "title": "Advancements and Challenges in Energy-efficient 6G Mobile Communication Network"}, {"paperId": "5aa5994d8cc7f2e59ac3127810165580c2f6611a", "title": "Impact of NFV resources distribution on inter-subnetwork latency"}, {"paperId": "ad21e4720fc2ca93047b1fb5bc58304f7ac42f81", "title": "FL_GIoT: Federated Learning Enabled Edge-Based Green Internet of Things System: A Comprehensive Survey"}, {"paperId": "b74e4b17528f71544aa0477106d43a99b4b9c4a4", "title": "Improving Orchestration Service Using gRPC API and P4-Enabled SDN Switch in Cloud Computing Platform: An OpenStack Case"}]}
