{"paperId": "6c2e99f33f9d75a7fe009634bfb8f2a18778c54c", "publicationVenue": {"id": "d5b215f3-f737-45b2-875b-df309ce14c43", "name": "Scientific Programming", "type": "journal", "alternate_names": ["Sci Program"], "issn": "1058-9244", "url": "https://www.hindawi.com/journals/sp/", "alternate_urls": ["https://www.iospress.nl/html/10589244.php", "https://www.wiley.com/legacy/compbooks/compjournals/sciprog.html", "http://content.iospress.com/journals/scientific-programming"]}, "title": "A Review on the Application of Knowledge Graph Technology in the Medical Field", "abstract": "With the continuous development of Internet technology, knowledge graph construction has received increasing attention. Extracting useful medical knowledge from massive data is the key to analyzing big medical data. The knowledge graph is a semantic network that reveals relationships between entities. Medicine is one of the widely used fields of knowledge graphs, and the construction of a medical knowledge graph is also a research hotspot in artificial intelligence. Knowledge graph technology has broad application prospects in the field. First, this study comprehensively analyzes the structure and construction technology of the medical knowledge graph according to the characteristics of big data in the medical field, such as strong professionalism and complex structure. Second, this study summarizes the key technologies and research progress of the four modules of the medical knowledge graph: knowledge representation, knowledge extraction, knowledge fusion, and knowledge reasoning. Finally, with the major challenges and key problems of the current medical knowledge graph construction technology, its development prospects are prospects.", "venue": "Scientific Programming", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-07-20", "journal": {"name": "Scientific Programming"}, "authors": [{"authorId": "46319344", "name": "Jia Qu"}], "citations": [{"paperId": "e7f8c5c481ecef5caebc4fa37859958fec0803dc", "title": "Chinese Named Entity Recognition in Football Based on ALBERT-BiLSTM Model"}, {"paperId": "86a7e5b3f6970a2cb6e4e1cd88dc3e399099c3d8", "title": "Research on named entity recognition of Traditional Chinese Medicine chest discomfort cases incorporating domain vocabulary features"}, {"paperId": "e31b41740b41a2aecf576668abb0cf5dd601afdd", "title": "Diagnosis and Treatment Knowledge Graph Modeling Application Based on Chinese Medical Records"}, {"paperId": "8bf0d91ab2fa87cd32240893b103b98514db2382", "title": "Civil Aviation Travel Question and Answer Method Using Knowledge Graphs and Deep Learning"}, {"paperId": "453d77c447561be30ecc2ec1a52549ba12e9c3db", "title": "Knowledge Graph: A Survey"}, {"paperId": "618f9c581f6003a79eff5ca2410e3be70bf4abd1", "title": "Towards electronic health record-based medical knowledge graph construction, completion, and applications: A literature study"}]}
