{"paperId": "6c364dd9951488f63aac0932cb5ecb74dae800b8", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Does Platform Migration Compromise Content Moderation? Evidence from r/The_Donald and r/Incels", "abstract": "When toxic online communities on mainstream platforms face moderation measures, such as bans, they may migrate to other platforms with laxer policies or set up their own dedicated website. Previous work suggests that, within mainstream platforms, community-level moderation is effective in mitigating the harm caused by the moderated communities. It is, however, unclear whether these results also hold when considering the broader Web ecosystem. Do toxic communities continue to grow in terms of user base and activity on their new platforms? Do their members become more toxic and ideologically radicalized? In this paper, we report the results of a large-scale observational study of how problematic online communities progress following community-level moderation measures. We analyze data from r/The_Donald} and r/Incels, two communities that were banned from Reddit and subsequently migrated to their own standalone websites. Our results suggest that, in both cases, moderation measures significantly decreased posting activity on the new platform, reducing the number of posts, active users, and newcomers. In spite of that, users in one of the studied communities (r/The_Donald) showed increases in signals associated with toxicity and radicalization, which justifies concerns that the reduction in activity may come at the expense of a more toxic and radical community. Overall, our results paint a nuanced portrait of the consequences of community-level moderation and can inform their design and deployment.", "venue": "arXiv.org", "year": 2020, "fieldsOfStudy": ["Political Science", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-10-20", "journal": {"name": "ArXiv", "volume": "abs/2010.10397"}, "authors": [{"authorId": "2164356774", "name": "Manoel Horta Ribeiro"}, {"authorId": "3362498", "name": "Shagun Jhaver"}, {"authorId": "3447293", "name": "Savvas Zannettou"}, {"authorId": "144728530", "name": "Jeremy Blackburn"}, {"authorId": "2064581974", "name": "Emiliano De Cristofaro"}, {"authorId": "2350947", "name": "G. Stringhini"}, {"authorId": "2257264380", "name": "Robert West"}], "citations": [{"paperId": "f1269db14771485d06e64940a05c5d95e4eb36ce", "title": "Impact of Stricter Content Moderation on Parler's Users' Discourse"}, {"paperId": "26c154ac98b220fc1e4530c3f12fe46c80b585f3", "title": "Mainstreaming the Blackpill: Understanding the Incel Community on TikTok"}, {"paperId": "55f12284ee4e8996e35a9723fee279640c1d2a20", "title": "Understanding the Behaviors of Toxic Accounts on Reddit"}, {"paperId": "f7e56541f959e1b18582853ba1ee1aad42e641a9", "title": "Community Resilience: Quantifying the Disruptive Effects of Sudden Spikes in Activity within Online Communities"}, {"paperId": "1e86bcbff853054d4c020a9ba9676e813308f037", "title": "Understanding and Detecting Hateful Content using Contrastive Learning"}, {"paperId": "adfa97019b73ab1de60deedc13f851b763930b1f", "title": "Are Proactive Interventions for Reddit Communities Feasible?"}, {"paperId": "e2ee0a300b570366b9d7d64e1ec86acf5c33fceb", "title": "Exploring content moderation in the decentralised web: the pleroma case"}, {"paperId": "9c9a8a2ede08414e191bea6c22e40615a23a9fd1", "title": "WMDecompose: A Framework for Leveraging the Interpretable Properties of Word Mover’s Distance in Sociocultural Analysis"}, {"paperId": "359f162c3e941a40161e5ec7e06dbc1c1c664719", "title": "Twitter flagged Donald Trump’s tweets with election misinformation: They continued to spread both on and off the platform"}, {"paperId": "5e5d687360658b50d04bf2538a1e1be4783fd33e", "title": "Understanding the Effect of Deplatforming on Social Networks"}, {"paperId": "1421c6ee0fe4a6b98e19a293d2ac3df86e95a653", "title": "On the Strategyproofness of the Geometric Median"}, {"paperId": "1b0f3a6da334b898ddb070657c980349d31be4e2", "title": "On the Globalization of the QAnon Conspiracy Theory Through Telegram"}, {"paperId": "1c59391911b314acff6a563e32620628754ce17b", "title": "Examining Online Indicators of Extremism in Violent Right-Wing Extremist Forums"}, {"paperId": "1f584764bfe104245a8439b5607390811e89e8cb", "title": "\"I Won the Election!\": An Empirical Analysis of Soft Moderation Interventions on Twitter"}, {"paperId": "ec45606af38450b1a88d365b4cee3379b19fcb8a", "title": "A Large Open Dataset from the Parler Social Network"}, {"paperId": "aa1efdf1aa530bb78e2134fbf293bbefe7eed577", "title": "An Early Look at the Parler Online Social Network"}, {"paperId": "4c7c471a124ba8e16ca8d1aeae66dffa52167c11", "title": "Do Platform Migrations Compromise Content Moderation? Evidence from r/The_Donald and r/Incels"}, {"paperId": "e6f08d161a2b8d367de11d9882a55cd998c5456c", "title": "Cross­Platform Reactions to the Post­January 6 Deplatforming"}]}
