{"paperId": "6c397130d38b281d3c5d47371195ce3d460bc6d1", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "An Advanced Strategy for Addressing Heterogeneity in SDN-IoT Networks for Ensuring QoS", "abstract": "The internet of things (IoT) is a complex system that includes multiple technologies and services. However, its heterogeneity can result in quality-of-service (QoS) issues, which may lead to security challenges. Software-defined network (SDN) provides unique solutions to handle heterogeneity issues in large-scale IoT networks. Combining SDN with IoT networks has great potential for addressing extreme heterogeneity issues in IoT networks. Numerous researchers are investigating various techniques to resolve heterogeneity issues in IoT networks by integrating SDN. Our study focuses on the SDN-IoT domain to improve QoS by addressing heterogeneity. Heterogeneity in SDN-IoT networks can increase the response time of controllers. We propose a framework that can alleviate heterogeneity while maintaining QoS in SDN-IoT networks. The framework converts m heterogeneous controllers into n homogeneous groups based on their response time. First, we examine the impact of the controller’s bandwidth and find that the system throughput decreases when the controller’s bandwidth is lowered. Next, we implement a simple strategy that considers both the bandwidth and service time when selecting the peer controller. Our results show some improvement in the framework, indicating its potential to alleviate heterogeneity while maintaining QoS and other metrics.", "venue": "Applied Sciences", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-07-04", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "2221853566", "name": "Abuzar Zafar"}, {"authorId": "34952910", "name": "Fahad Samad"}, {"authorId": "10067603", "name": "Hassan Jamil Syed"}, {"authorId": "2185539258", "name": "Ashraf Osman Ibrahim"}, {"authorId": "3435258", "name": "Manar Alohaly"}, {"authorId": "9247361", "name": "Muna Elsadig"}], "citations": [{"paperId": "3ebdd33c50e68cf937f62c860f0124502a2f404a", "title": "Software Defined Networking-based Multiuser System Models"}]}
