{"paperId": "6c3a30c27f14851eb062bf43969856d8e6e900b8", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Global Optimization of Data Pipelines in Heterogeneous Cloud Environments", "abstract": "Modern production data processing and machine learning pipelines on the cloud are critical components for many cloud-based companies. These pipelines are typically composed of complex workflows represented by directed acyclic graphs (DAGs). Cloud environments are attractive to these workflows due to the wide range of choice with heterogeneous instances and prices that can provide the flexibility for different cost-performance needs. However, this flexibility also leads to the complexity of selecting the right resource configuration (e.g., instance type, resource demands) for each task in the DAG, while simultaneously scheduling the tasks with the selected resources to reach the optimal end-to-end performance and cost. These two decisions are often codependent resulting in an NP-hard scheduling optimization bottleneck. Existing solutions only focus solely on either problem and ignore the co-effect on the end-to-end optimum. We propose AGORA, a scheduler that considers both task-level resource allocation and execution for DAG workflows as a whole in heterogeneous cloud environments. AGORA first (1) studies the characteristics of the tasks from prior runs and gives predictions on resource configurations, and (2) automatically finds the best configuration with its corresponding schedules for the entire workflow with a cost-performance objective. We evaluate AGORA in a heterogeneous Amazon Web Services (AWS) cloud environment with multi-tenant workflows served by Airflow and demonstrate a performance improvement up to 45% and cost reduction up to 77% compared to state-of-the-art schedulers. In addition, we apply AGORA to a real-world production trace from Alibaba and show cost reduction of 65% and DAG completion time reduction of 57%.", "venue": "arXiv.org", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-02-11", "journal": {"name": "ArXiv", "volume": "abs/2202.05711"}, "authors": [{"authorId": "2062311951", "name": "Eric Lin"}, {"authorId": "46265704", "name": "Luna Xu"}, {"authorId": "50401133", "name": "S. Bramhavar"}, {"authorId": "2519920", "name": "M. M. D. Oca"}, {"authorId": "2154417150", "name": "Sean Gorsky"}, {"authorId": "2018978905", "name": "Lin Yi"}, {"authorId": "2154417179", "name": "Arianna Groetsema"}, {"authorId": "2154418674", "name": "Jeffrey Chou"}], "citations": []}
