{"paperId": "6c46d7e44626c9634903ddc624df8a344f0277c4", "publicationVenue": {"id": "8de18c35-6785-4e54-99f2-21ee961302c6", "name": "Conference of the European Chapter of the Association for Computational Linguistics", "type": "conference", "alternate_names": ["Conf Eur Chapter Assoc Comput Linguistics", "EACL"], "url": "https://www.aclweb.org/anthology/venues/eacl/"}, "title": "Socratic Question Generation: A Novel Dataset, Models, and Evaluation", "abstract": "Socratic questioning is a form of reflective inquiry often employed in education to encourage critical thinking in students, and to elicit awareness of beliefs and perspectives in a subject during therapeutic counseling. Specific types of Socratic questions are employed for enabling reasoning and alternate views against the context of individual personal opinions on a topic. Socratic contexts are different from traditional question generation contexts where “answer-seeking” questions are generated against a given formal passage on a topic, narrative stories or conversations.We present SocratiQ, the first large dataset of 110K (question, context) pairs for enabling studies on Socratic Question Generation (SoQG). We provide an in-depth study on the various types of Socratic questions and present models for generating Socratic questions against a given context through prompt tuning. Our automated and human evaluation results demonstrate that our SoQG models can produce realistic, type-sensitive, human-like Socratic questions enabling potential applications in counseling and coaching.", "venue": "Conference of the European Chapter of the Association for Computational Linguistics", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": null, "journal": {"pages": "147-165"}, "authors": [{"authorId": "2215618416", "name": "Beng Heng Ang"}, {"authorId": "3091719", "name": "Sujatha Das Gollapalli"}, {"authorId": "1794527", "name": "See-Kiong Ng"}], "citations": [{"paperId": "1b715867e5933971e5157d1c927a0e59ee9d6bc1", "title": "Socratic Reasoning Improves Positive Text Rewriting"}, {"paperId": "5ee871537ae51e7e2e93d2a70fff5d100649a655", "title": "Mathematical Language Models: A Survey"}, {"paperId": "5f200e0d0e1c369c8f18c8846047b6acdae16f57", "title": "Transformer based Answer-Aware Bengali Question Generation"}, {"paperId": "6c5c532ed437631a59db8be4d1206ca16b7845e7", "title": "Teach Me How to Improve My Argumentation Skills: A Survey on Feedback in Argumentation"}, {"paperId": "ba81651472c6270b611ff62f030bde02ea9e1fc1", "title": "Teach Me How to Argue: A Survey on NLP Feedback Systems in Argumentation"}]}
