{"paperId": "6c4826e7022a07d5fb41fbaed2a825919797ce92", "publicationVenue": {"id": "0aed7a40-85f3-4c66-9e1b-c1556c57001b", "name": "PLoS ONE", "type": "journal", "alternate_names": ["Plo ONE", "PLOS ONE", "PLO ONE"], "issn": "1932-6203", "url": "https://journals.plos.org/plosone/", "alternate_urls": ["http://www.plosone.org/"]}, "title": "“Help! I need some music!”: Analysing music discourse & depression on Reddit", "abstract": "Individuals choose varying music listening strategies to fulfill particular mood-regulation goals. However, ineffective musical choices and a lack of cognizance of the effects thereof can be detrimental to their well-being and may lead to adverse outcomes like anxiety or depression. In our study, we use the social media platform Reddit to perform a large-scale analysis to unearth the several music-mediated mood-regulation goals that individuals opt for in the context of depression. A mixed-methods approach involving natural language processing techniques followed by qualitative analysis was performed on all music-related posts to identify the various music-listening strategies and group them into healthy and unhealthy associations. Analysis of the music content (acoustic features and lyrical themes) accompanying healthy and unhealthy associations showed significant differences. Individuals resorting to unhealthy strategies gravitate towards low-valence tracks. Moreover, lyrical themes associated with unhealthy strategies incorporated tracks with low optimism, high blame, and high self-reference. Our findings demonstrate that being mindful of the objectives of using music, the subsequent effects thereof, and aligning both for well-being outcomes is imperative for comprehensive understanding of the effectiveness of music.", "venue": "PLoS ONE", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-07-20", "journal": {"name": "PLOS ONE", "volume": "18"}, "authors": [{"authorId": "2151962450", "name": "Bhavyajeet Singh"}, {"authorId": "2130599693", "name": "Kunal Vaswani"}, {"authorId": "2126903727", "name": "Sreeharsha Paruchuri"}, {"authorId": "6732966", "name": "Suvi Saarikallio"}, {"authorId": "1734731", "name": "P. Kumaraguru"}, {"authorId": "2771508", "name": "Vinoo Alluri"}], "citations": []}
