{"paperId": "6c48d7060f113e0fb201f4575d2f84f781c89dfe", "publicationVenue": {"id": "042aa85f-6dca-421f-809b-e0ea76c1e58b", "name": "IEEE Reviews in Biomedical Engineering", "type": "journal", "alternate_names": ["IEEE reviews in biomedical engineering", "IEEE Rev Biomed Eng", "IEEE rev biomed eng"], "issn": "1941-1189", "alternate_issns": ["1937-3333"], "url": "https://rbme.embs.org/", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=4664312"]}, "title": "Chronic Diseases and Health Monitoring Big Data: A Survey", "abstract": "With the advancement of technology in data science and network technology, the world has stepped into the Era of Big Data, and the medical field is rich in data suitable for analysis. Thus, in recent years, there has been much research in medical big data, mainly targeting data collection, data analysis, and visualization. However, very few works provide a full survey of the medical big data on chronic diseases and health monitoring. This review investigates recent research efforts and conducts a comprehensive overview of the work on medical big data, especially as related to chronic diseases and health monitoring. It focuses on the full cycles of the big data processing, which includes medical big data preprocessing, big data tools and algorithms, big data visualization, and security issues in big data. It also attempts to combine common big data technologies with special medical needs by analyzing in detail existing works of medical big data. To the best of our knowledge, this is the first survey that targets chronic diseases and health monitoring big data technologies.", "venue": "IEEE Reviews in Biomedical Engineering", "year": 2018, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2018-04-24", "journal": {"name": "IEEE Reviews in Biomedical Engineering", "pages": "275-288", "volume": "11"}, "authors": [{"authorId": "1681744", "name": "Rongheng Lin"}, {"authorId": "30462860", "name": "Zezhou Ye"}, {"authorId": "2144220723", "name": "Hao Wang"}, {"authorId": "153258675", "name": "Budan Wu"}], "citations": [{"paperId": "9628b57013809dd8a1801ebeca43e5d0a4886890", "title": "Toward the Internet of Medical Things: Architecture, trends and challenges."}, {"paperId": "13a3329043c3a41583bce218052eb9901b4f7d9c", "title": "DIGITAL TRANSFORMATION CHALLENGES OF EMERGING HOSPITALS IN DIGITAL DISRUPTION"}, {"paperId": "39dc1037e1dc6c36caebfd75d361ea2ca6ae4f8a", "title": "Data Visualization of Big Data for Predictive and Descriptive Analytics for Stroke, COVID-19, and Diabetes"}, {"paperId": "10516f0846df695b319eea9a9438c9cf37043089", "title": "A Structured Approach Towards Big Data Identification"}, {"paperId": "baeabbd0b0cf14de63782b4093dd8f63763f6e8c", "title": "A Survey on Big Data Technologies and Their Applications to the Metaverse: Past, Current and Future"}, {"paperId": "5046756910a68bd74a592f2a17c9fb7f3e8091dd", "title": "Effects of DNA methylation and gene expression on rats with protein malnutrition in early life"}, {"paperId": "e60ea1577983f365dc5cbd44b8d90e74d9aca220", "title": "Selection of Prospective Workers Using Profile Matching Algorithm on Crowdsourcing Platform"}, {"paperId": "f4a3d1333d0f9c195bf58591258123c80ef220e2", "title": "Overview of Interactive Visualization Methods"}, {"paperId": "0e7f403232fbc2c7f182a82780f1bce0eaea8be7", "title": "MobEdge: Mobile blockchain‐based privacy‐edge scheme for healthcare Internet of Things‐based ecosystems"}, {"paperId": "f4160b2c49271022a3cd34d9e3164ca26b7b8368", "title": "MMSS: A storytelling simulation software to mitigate misinformation on social media"}, {"paperId": "c47e3dc0afa57c423c84c6fd51497b81d5fd0260", "title": "A visualization algorithm for medical big data based on deep learning"}, {"paperId": "38ee44db18b0e01b4567afb54703f55b26f13a81", "title": "Big Data-Enabled Solutions Framework to Overcoming the Barriers to Circular Economy Initiatives in Healthcare Sector"}, {"paperId": "136172ac510d2825b3c2ec48e47f6fb3335ff81c", "title": "Prediction of Prognosis in Emergency Trauma Patients with Optimal Limit Gradient Based on Grid Search Optimal Parameters"}, {"paperId": "68ca594a195c3f2a68eddff7751d08e76993c8b8", "title": "Big Data Application in Health Care: A Study"}, {"paperId": "577279c2eb216f6a5f47440a872c299d0b2c05ec", "title": "Human Muscle Measurement and Big Data Health Based on Wireless Sensors"}, {"paperId": "8b43cf4b25b7a421c94daf6ea8a85858434b45e3", "title": "Trends and Challenges of Wearable Multimodal Technologies for Stroke Risk Prediction"}, {"paperId": "43e077a785f15d7bed377e87905f97900e719362", "title": "Diseases identification with big data concept – The older people community"}, {"paperId": "9f114b8f5e9750e805fa75bc2bb9bbf569192b0d", "title": "Humane Visual AI: Telling the Stories Behind a Medical Condition"}, {"paperId": "77f86b5334e7d91ccb08dab6366e270d44e7bda3", "title": "Weakly-Supervised Network for Detection of COVID-19 in Chest CT Scans"}, {"paperId": "f61bbc0d8803ab77e7f88c8cf994e40c8d1e57f5", "title": "Endüstri 4.0’ın Sağlık Sektörüne Etkisinde Demografik Özelliklerin Düzenleyici Rolü: Teknoloji Kabul Modeli İle Bir Uygulama"}, {"paperId": "80acc5fd37a81a1a7f170e4eb34ba0ba80266033", "title": "EdgeMediChain: A Hybrid Edge Blockchain-Based Framework for Health Data Exchange"}, {"paperId": "e118118a603d280e804a2dcd4d8b39ed007fd8ef", "title": "Development of a Model for Predicting Treatment of Cardiovascular Diseases Based on Machine Learning Methods"}, {"paperId": "573a144ace4f4a97c2b7accdec4f97db0ce2ed2b", "title": "An Empirical Study on Some Image Enhancement Techniques towards Identification of Chronical Diseases"}, {"paperId": "3b016d0541726c9d0425b37f9022180f2f704229", "title": "Visual Analytic Tools and Techniques in Population Health and Health Services Research: Scoping Review"}, {"paperId": "8dfdccad58caaed09d2732111f5a968957d5dce5", "title": "How Big Data in Health 4.0 Helps Prevent the Spread of Tuberculosis"}, {"paperId": "358157d030b8b8b0ff759db7f346e1d1ad16f3ac", "title": "Information and communication technology for increasing healthy ageing in people with non-communicable diseases: identifying challenges and further areas for development"}, {"paperId": "173b840f7b170a9d57fabb01c5428d743ba114f5", "title": "Future of Big Data and Deep Learning for Wireless Body Area Networks"}, {"paperId": "1978d35210ad6868bede9aec7f502b9aae8a8b7b", "title": "Health Big Data Analytics: A Technology Survey"}, {"paperId": "730de7bcca4148547dd1b6b78ec0e22b8bfd5ca9", "title": "Towards Self-Adaptive Systems with Hierarchical Decentralised Control"}, {"paperId": "4324b21917964bae5f5d40e5fef053105df71bfb", "title": "Introduction to the Special Section: Convergence of Automation Technology, Biomedical Engineering, and Health Informatics Toward the Healthcare 4.0"}, {"paperId": "ce2172857452fb7c54dadcf04a3c6ba86d713ce3", "title": "Significance Of Big Data Frameworks And Speculative Approaches In Healthcare Systems"}, {"paperId": "e1eaeeb0312ed8ab0417358fb3ec45b7a2604d03", "title": "Semi-supervised Network for Detection of COVID-19 in Chest CT Scans"}, {"paperId": "8c296cfc192434f4b5e5372783869f272d5ab903", "title": "A Survey on Diverse Chronic Disease Prediction Models and Implementation Techniques"}, {"paperId": "ecd1c89377a929fc0a354b5068beea234f914341", "title": "ON BIOINFORMATICSv BIOTECHNOLOGY, AND BIOMEDICAL ENGINEERING (BioMIC) - BIOINFORMATICS AND BIOMEDICAL ENGINEERING"}, {"paperId": "4c07268ebcdee7546a39ece0168f0a6e5cb62a1f", "title": "Clustering and visualization of a high-dimensional diabetes dataset"}]}
