{"paperId": "6c4a43b93f3ce694cfd5ad8863fa3e9263602061", "publicationVenue": {"id": "c1a3f23d-e3de-40a3-8d2d-187b921b61c8", "name": "IEEE International Conference on Software Quality, Reliability and Security Companion", "type": "conference", "alternate_names": ["QRS-C", "IEEE Int Conf Softw Qual Reliab Secur Companion"]}, "title": "Design Method of Banquet Intelligent Side Dishes System Based on Data Mining and Correlation Analysis", "abstract": "With the rapid development of e-commerce and the huge progress of data mining technology, recommendation services are more and more welcomed by the general public. In order to facilitate consumers to find a product suitable for them from a large amount of product information, a r ecommendation system has come into being to save users' treasure hunting time and improve user experience. Based on the above background, the purpose of this article is to study the design method of banquet intelligent side dish system based on the analysis of correlation degree. This paper uses Apriori algorithm and improved algorithm to compare and analyze the same instance, and proves that the algorithm has advantages in mining efficiency, and applies the algorithm to the personalized banquet intelligent side dish system. After analyzing the attributes of the dishes that the user pays attention to, the user's eating preferences in the process of eating can be tapped, so that the intelligent side dishes can be recommended in combination with TCM constitution. Design appropriate data model and communication protocol for this system, complete the coding work of server and client programs, and customize the source code of the operating system running on the client tablet to meet the needs of users.", "venue": "IEEE International Conference on Software Quality, Reliability and Security Companion", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-12-01", "journal": {"name": "2020 IEEE 20th International Conference on Software Quality, Reliability and Security Companion (QRS-C)", "pages": "434-437"}, "authors": [{"authorId": "2041307708", "name": "Xing Oiao"}, {"authorId": "2116783605", "name": "Jie Luo"}], "citations": [{"paperId": "30df111cb36c1d612fd94ee43cce75be29ce5fdd", "title": "Recommendation System of Food Package Using Apriori and FP-Growth Data Mining Methods"}]}
