{"paperId": "6c4e9fef6f71f9cb54ab802a2302201565cd0ed5", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Traffic Incident Detection Based on Dynamic Graph Embedding in Vehicular Edge Computing", "abstract": "With a large of time series dataset from the Internet of Things in Ambient Intelligence-enabled smart environments, many supervised learning-based anomaly detection methods have been investigated but ignored the correlation among the time series. To address this issue, we present a new idea for anomaly detection based on dynamic graph embedding, in which the dynamic graph comprises the multiple time series and their correlation in each time interval. We propose an entropy for measuring a graph’s information injunction with a correlation matrix to define similarity between graphs. A dynamic graph embedding model based on the graph similarity is proposed to cluster the graphs for anomaly detection. We implement the proposed model in vehicular edge computing for traffic incident detection. The experiments are carried out using traffic data produced by the Simulation of Urban Mobility framework. The experimental findings reveal that the proposed method achieves better results than the baselines by 14.5% and 18.1% on average with respect to F1-score and accuracy, respectively.", "venue": "Applied Sciences", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-06-24", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "2108549539", "name": "Gen Li"}, {"authorId": "2116109251", "name": "Tri-Hai Nguyen"}, {"authorId": "145888300", "name": "Jason J. Jung"}], "citations": [{"paperId": "fa6ea3eefff17644cda07bf6220582ea3df0455c", "title": "Decentralised Traffic Incident Detection via Network Lasso"}, {"paperId": "73f3a6bbf29b3d97da979872491cc82fe58c70ad", "title": "Graph embedding-based Anomaly localization for HVAC system"}, {"paperId": "9e9526def2caaa73d66d48eaa9b0c9651c0aeec8", "title": "Applications of Deep Learning and Deep Reinforcement Learning in 6G Networks"}, {"paperId": "5a9e06edd441c56dd1d29048a209782b82e46877", "title": "A survey on artificial intelligence techniques for security event correlation: models, challenges, and opportunities"}, {"paperId": "9f4b2a0a035cf3862b5ca77b8c8bbec888b1dafc", "title": "Multi-agent DRL-based Task Offloading in Hierarchical HAP-LAP Networks"}, {"paperId": "6a83eed2d2fc821f9dabad649988ae6a7430de2a", "title": "A Survey on Deep Reinforcement Learning-driven Task Offloading in Aerial Access Networks"}, {"paperId": "07e3499457c062c2a6a21a9fb569040338d9b499", "title": "Deep Reinforcement Learning-based Partial Task Offloading in High Altitude Platform-aided Vehicular Networks"}, {"paperId": "f5de3869b92b10ce7d57c5084082aa421acda407", "title": "Deep learning for anomaly detection in multivariate time series: Approaches, applications, and challenges"}, {"paperId": "7bcbb541e7243fc8d6bfd7e9150d2cf1adf6826a", "title": "ACO-based traffic routing method with automated negotiation for connected vehicles"}, {"paperId": "073752ea98ef8d7358982ff633e83eed7cbc4ded", "title": "Multivariate Time Series Deep Spatiotemporal Forecasting with Graph Neural Network"}, {"paperId": "a046f52e8057958acb6cf179638b8d24535ee506", "title": "FL-MGVN: Federated learning for anomaly detection using mixed gaussian variational self-encoding network"}]}
