{"paperId": "6c505a7c37fb9c907fa48b2bcd23494646b76105", "publicationVenue": null, "title": "Handling Big Data using Data-Aware HDFS and Evolutionary Clustering Technique", "abstract": ": The increasing usage of digitally enabled frames and the Internet of Things has resulted in a wealth of knowledge and a diversity of structures. The environment or document frameworks presented by Hadoop are utilised in most enormous data arrangements (HDFS). In any case, the reflectors showed weaknesses in such frameworks in the maintenance of current data. While some research has resolved these concerns for explicit diagram data variants, existing data are based on reasonable data. Studies show that productivity concerns lead to significant scope problems, such as increased space in server farms and waste in assets (such as the use of force), leading to ecological problems (such as more fuel byproduct) [1]. We propose a Hadoop Eco-Focus module that is information-rich. Also, we propose a genetic algorithm encoding strategy that uses circulating encoding. Our architecture enables Hadoop to manage data distribution and organization, as well as conduct group analysis on subsets of data. Even when improvement time and use of assets are involved, we can manage a wide range of data types. We have tested our assumptions on a number of LUBM datasets.", "venue": "", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "2287686720", "name": "M. SwomyashreeK"}, {"authorId": "2287593765", "name": "Student"}], "citations": [{"paperId": "48a45ecd22387d6395d137ab99711d696c7922fe", "title": "Intelligent risk management system for enhancing performance of stock market applications"}, {"paperId": "88099f2d0a1f66aa6bfdb9a8f968a08bdb01664f", "title": "A Survey on Distributed Evolutionary Computation"}, {"paperId": "2996f72c980b214335d2005336dc46c40f6e2917", "title": "TS-REPLICA: A novel replica placement algorithm based on the entropy weight TOPSIS method in spark for multimedia data analysis"}, {"paperId": "daa2171619a5a00d478798f400dcece231b1706e", "title": "A comprehensive study and review of tuning the performance on database scalability in big data analytics"}, {"paperId": "109dd131da32a6c2624b90a8ae7186b822062179", "title": "Entropy and sigmoid based K-means clustering and AGWO for effective big data handling"}, {"paperId": "99e6c944928324074e5ef5a2688f7c8638088cef", "title": "Bio-inspired computation for big data fusion, storage, processing, learning and visualization: state of the art and future directions"}, {"paperId": "370b713e2520c2c93d46901f2eabd1bb79ef018d", "title": "A New Adaptive Hybrid Mutation Black Widow Clustering Based Data Partitioning for Big Data Analysis"}, {"paperId": "4735bae074a5bd6aee4eb0d3f59e68d2ab56fc21", "title": "A Cost-Aware Management Framework for Placement of Data-Intensive Applications on Federated Cloud"}, {"paperId": "68ca594a195c3f2a68eddff7751d08e76993c8b8", "title": "Big Data Application in Health Care: A Study"}, {"paperId": "1cc8363a6ec7f61cafd381865a5a55ac016f5c8c", "title": "Bhattacharyya coefficient target feature matching based weighted emphasis adaptive boosting classification for predictive analytics with big data"}, {"paperId": "7e4b151c928d02c29e4ad4ec6752f5a7ed0ae1ac", "title": "Remote Procedure Call Optimization of Big Data Systems Based on Data Awareness"}, {"paperId": "e59868e11972cbd1294a9551c18ca8916b37f9c0", "title": "MapReduce framework based big data clustering using fractional integrated sparse fuzzy C means algorithm"}, {"paperId": "ae43f5e3f8742059f40c53550f4210d879c6c808", "title": "Configuring differential evolution adaptively via path search in a directed acyclic graph for data clustering"}, {"paperId": "caf50e2947c2900d1300b74513e09ddd962af6aa", "title": "2019 Index IEEE Transactions on Big Data Vol. 5"}, {"paperId": "b5f39e7bd6228076101e7ba0f70dad513073c138", "title": "Phenotype Algorithm based Big Data Analytics for Cancer Diagnose"}, {"paperId": "7f33f56cb4c1e9a04b7e67cdf2c7f353f9c9582e", "title": "Spark Clustering Computing Platform Based Parallel Particle Swarm Optimizers for Computationally Expensive Global Optimization"}, {"paperId": "6e700eae802044ec30288e64f8a8abbe1cb3700c", "title": "A Parallel-Batch Multi-Objective Job Scheduling Algorithm in Edge Computing"}, {"paperId": "3215fecab99d394799414e661fb6d3b05064c6ee", "title": "A Classification Approach Based on Evolutionary Clustering and Its Application for Ransomware Detection"}, {"paperId": "ecf46e819b9989b47155cdfa506da84294079db3", "title": "New Data Placement Strategy in the HADOOP Framework"}, {"paperId": "bce6b6f97b7144a667e31b85725bac4d4510f2c4", "title": "Blockchain-Based Wireless Sensor Networks for Malicious Node Detection: A Survey"}, {"paperId": "d5a4a50016c38561d91e156d7468cd4cdd730113", "title": "A Novel Configuration Tuning Method Based on Feature Selection for Hadoop MapReduce"}, {"paperId": "d5ea3e80bd694ab4aacc88dec92b42e11942d184", "title": "A Data-Aware Remote Procedure Call Method for Big Data Systems"}, {"paperId": "d9347d02a6642030b4d30db956103a9cae02078c", "title": "Real-Time Context-Aware Microservice Architecture for Predictive Analytics and Smart Decision-Making"}, {"paperId": "c43b9879ed1786e099dbdb128cb28cd69ae3a20c", "title": "Query Time Optimization Using Hungarian Algorithm"}]}
