{"paperId": "6c619aa81df5335437bef3db194a8c0debeeb30d", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Federated Learning on Transcriptomic Data: Model Quality and Performance Trade-Offs", "abstract": "Machine learning on large-scale genomic or transcriptomic data is important for many novel health applications. For example, precision medicine tailors medical treatments to patients on the basis of individual biomarkers, cellular and molecular states, etc. However, the data required is sensitive, voluminous, heterogeneous, and typically distributed across locations where dedicated machine learning hardware is not available. Due to privacy and regulatory reasons, it is also problematic to aggregate all data at a trusted third party.Federated learning is a promising solution to this dilemma, because it enables decentralized, collaborative machine learning without exchanging raw data. In this paper, we perform comparative experiments with the federated learning frameworks TensorFlow Federated and Flower. Our test case is the training of disease prognosis and cell type classification models. We train the models with distributed transcriptomic data, considering both data heterogeneity and architectural heterogeneity. We measure model quality, robustness against privacy-enhancing noise, computational performance and resource overhead. Each of the federated learning frameworks has different strengths. However, our experiments confirm that both frameworks can readily build models on transcriptomic data, without transferring personal raw data to a third party with abundant computational resources.", "venue": "arXiv.org", "year": 2024, "fieldsOfStudy": ["Computer Science", "Biology"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-02-22", "journal": {"name": "ArXiv", "volume": "abs/2402.14527"}, "authors": [{"authorId": "2219273387", "name": "Anika Hannemann"}, {"authorId": "2284982468", "name": "Jan Ewald"}, {"authorId": "2284991299", "name": "Leo Seeger"}, {"authorId": "2284350088", "name": "Erik Buchmann"}], "citations": []}
