{"paperId": "6caf13914de27968133bc327fdb72a30ee9e2a25", "publicationVenue": {"id": "77143cc6-3014-4df5-ad1e-0b5a06c068bb", "name": "International Symposium on Design and Implementation of Symbolic Computation Systems", "type": "conference", "alternate_names": ["DISCS", "Int Symp Des Implement Symb Comput Syst"]}, "title": "Supporting online analytics with user-defined estimation and early termination in a MapReduce-like framework", "abstract": "Online analytics based on runtime approximation has been widely adopted for meeting time and/or resource constraints. Though MapReduce has been gaining its popularity in both scientific and commercial sectors, there are several obstacles in implementing online analytics in a MapReduce implementation.\n In this paper, we present a MapReduce-like framework for online analytics. Our system can process the input incrementally, provide fast estimates, and terminate the execution as soon as a user-defined termination state is reached. We have extended the MapReduce API by allowing the user to customize both the estimation method and termination condition. We also have shown both the functionality and efficiency of our system through three approximate applications. A comparison with a batch processing implementation shows a speedup of at least an order of magnitude.", "venue": "International Symposium on Design and Implementation of Symbolic Computation Systems", "year": 2015, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2015-11-15", "journal": {"pages": "8:1-8:8"}, "authors": [{"authorId": "46393411", "name": "Yi Wang"}, {"authorId": "2064666", "name": "Linchuan Chen"}, {"authorId": "145340303", "name": "G. Agrawal"}], "citations": [{"paperId": "1df6130b23958b353825dd90dc0fc9500981cec0", "title": "A Session-Based Approach to Fast-But-Approximate Interactive Data Cube Exploration"}, {"paperId": "dda199bcb834114bcf1a7a58be5bb6e46a93888b", "title": "Interactive Data Exploration of Distributed Raw Files: A Systematic Mapping Study"}, {"paperId": "8ea25ee85914a997aa66caabe81a64b995c9713d", "title": "Master Thesis"}, {"paperId": "ce7f61db0baf10371bee8f2ab06da5262a1ef0f8", "title": "Data Management and Data Processing Support on Array-Based Scientific Data"}]}
