{"paperId": "6cd1ec7dbe5dbd638cfb7d0aa59fba14884d3cfd", "publicationVenue": {"id": "96710c95-a12e-4ed5-902f-bd4503396533", "name": "International Conferences on Smart Internet of Things", "type": "conference", "alternate_names": ["SmartIoT", "Int Conf Smart Internet Thing"]}, "title": "On Threat Analysis of IoT-Based Systems: A Survey", "abstract": "In this paper, we provide a survey on threat analysis of systems based on Internet of Things (IoT), and how the blockchain technology can help mitigate the threats. Although the topic of IoT security (and previously the security of wireless sensor networks) has been reviewed extensively, we believe that the topic deserves a more in-depth examination towards a more systematic threat analysis, which is not only necessary to better understand the threats against IoT-based systems, but also paves the way to effectively improve the security of IoT-based systems by integrating with the blockchain technology. The major research contributions of this paper include a new taxonomy of the threats against IoT-based systems, identify what threats can be effectively mitigated by integrating IoT with with blockchain technology, the challenges faced by the blockchain-enabled IoT-based systems, and the likely approaches to overcoming these challenges.", "venue": "International Conferences on Smart Internet of Things", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference", "Review"], "publicationDate": "2020-08-01", "journal": {"name": "2020 IEEE International Conference on Smart Internet of Things (SmartIoT)", "pages": "205-212"}, "authors": [{"authorId": "144101028", "name": "Wenbing Zhao"}, {"authorId": "47569322", "name": "Shunkun Yang"}, {"authorId": "144118283", "name": "Xiong Luo"}], "citations": [{"paperId": "274839ca1df854c19e5c4a547717a0801c531208", "title": "Improving Reliability for Detecting Anomalies in the MQTT Network by Applying Correlation Analysis for Feature Selection Using Machine Learning Techniques"}, {"paperId": "6f1b8c45c5db6bfff66454f1c921663cae3d34f4", "title": "The Professionalization of the Hacker Industry"}, {"paperId": "17cbe0b8b92e1c3b3f609092e72f8619baca100d", "title": "Dos and Don’ts in Blockchain Research and Development"}, {"paperId": "7e4880a4e54609963be91367158ccdd290033afb", "title": "Internet-of-Things Security and Vulnerabilities: Case Study"}, {"paperId": "e5ef3536f12bc441d1f3c5c85590d6d3b5123d3d", "title": "Design and Implementation of a Blockchain-Enabled Secure Sensing Data Processing and Logging System"}, {"paperId": "755607e65510565e62f4092500216a7efbcf8bce", "title": "Smart home security: challenges, issues and solutions at different IoT layers"}, {"paperId": "eac16e7aa5b43cd3eb2ca9b0fe1ac9f699759a16", "title": "Blockchain-Enabled Cyber–Physical Systems: A Review"}, {"paperId": "878d393c3da6a85519082416584d671b1135d110", "title": "A Blockchain-Facilitated Secure Sensing Data Processing and Logging System"}, {"paperId": "41b2812227a0332a03de5c058b69517b22d9d562", "title": "Blockchain Applications"}]}
