{"paperId": "6cfe3f77f08f1e7679e00085a67b29413d99f0c2", "publicationVenue": null, "title": "Efficient Geospatial Analytics on Time Series Big Data", "abstract": "In smart city advanced analytical scenarios, tremendous amounts of georeferenced big time series data arrive continuously to time series databases, requiring the shared analytics on both geospatial and time dimensions. Mostly, the focus has been given to optimizing the storage and processing of each workload alone, either geospatial or time dimensions. To close this gap, in this paper, we have designed a pyramid-like indexing scheme that we term as geoTSI (short for geo time series index) which twists two dimensionality reduction geospatial encoding methods (geohash and S2) sequentially with a time series index to efficiently enable such mixed workload scenarios. This method enables geospatial and time indexes to collaborate synergistically in an aim to reduce the time required for accessing the disk and retrieving the time series data that comprises the answer for the mixed workload query. We show how our indexing scheme can be efficiently exploited to run a hybrid geospatial proximity query on time series data. Also, we evaluate our index on real-world georeferenced time series data, where we obtain, on average, a significant 34 % reduction in the query running time by applying our method against the baseline.", "venue": "ICC 2022 - IEEE International Conference on Communications", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-05-16", "journal": {"name": "ICC 2022 - IEEE International Conference on Communications", "pages": "3002-3008"}, "authors": [{"authorId": "1833407969", "name": "Isam Mashhour Al Jawarneh"}, {"authorId": "1740127", "name": "P. Bellavista"}, {"authorId": "144765161", "name": "Antonio Corradi"}, {"authorId": "1748978", "name": "L. Foschini"}, {"authorId": "1713456", "name": "R. Montanari"}], "citations": [{"paperId": "34208ab137ad1b29effa0bef760b93a47e42bd2e", "title": "Polygon Simplification for the Efficient Approximate Analytics of Georeferenced Big Data"}]}
