{"paperId": "6d07a53f872e8631eda3e911978931ddfa59929d", "publicationVenue": {"id": "e1623161-079f-4133-ae30-fcff56ce92cf", "name": "International Conference on Computing: Theory and Applications", "type": "conference", "alternate_names": ["Int Conf Comput Theory Appl", "ICCTA"]}, "title": "Exploration of Machine Learning Classification Models Used for Behavioral Biometrics Authentication", "abstract": "Mobile devices have been manufactured and enhanced at growing rates in the past decades. While this growth has significantly evolved the capability of these devices, their security has been falling behind. This contrast in development between capability and security of mobile devices is a significant problem with the sensitive information of the public at risk. Continuing the previous work in this field, this study identifies key Machine Learning algorithms currently being used for behavioral biometric mobile authentication schemes and aims to provide a comprehensive review of these algorithms when used with touch dynamics and phone movement. Throughout this paper the benefits, limitations, and recommendations for future work will be discussed.", "venue": "International Conference on Computing: Theory and Applications", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Review"], "publicationDate": "2022-04-19", "journal": {"name": "Proceedings of the 2022 8th International Conference on Computer Technology Applications"}, "authors": [{"authorId": "2162960970", "name": "Sara Kokal"}, {"authorId": "2132910527", "name": "Laura Pryor"}, {"authorId": "51288952", "name": "Rushit Dave"}], "citations": [{"paperId": "61ee3fdd334ffbe54e162bb0bc20cba550c5a249", "title": "Walking to Authenticate: Identifying Robust Behavioral Biometrics from Step Count Data"}, {"paperId": "ebfabb3d0a6a98812adb8c739d8d0035ad15c189", "title": "User Authentication and Identification on Smart Glasses with Motion Sensors"}, {"paperId": "7780a86b9a3f9099e2fdc909f6f9ecdec2860789", "title": "Behavioral Biometrics for Continuous Authentication on Mobile Devices: Anomaly Detection through Keystroke Dynamics with Machine Learning"}, {"paperId": "979ef536d928f80e5ba2c2e4fc2a6aec0e6b4926", "title": "Deep Learning and Machine Learning, Better Together Than Apart: A Review on Biometrics Mobile Authentication"}, {"paperId": "6fee8174351e1c7338704a0635c721f638c61639", "title": "Analysis of Gait Motion Sensor Mobile Authentication with Machine Learning"}]}
