{"paperId": "6d0fe53cc9bd1df6302085a234dc6e9a21392b14", "publicationVenue": {"id": "228761ec-c40a-479b-8309-9dcbe9851bcd", "name": "IEEE Internet of Things Journal", "type": "journal", "alternate_names": ["IEEE Internet Thing J"], "issn": "2327-4662", "url": "https://www.ieee.org/membership-catalog/productdetail/showProductDetailPage.html?product=PER288-ELE", "alternate_urls": ["https://ieeexplore.ieee.org/servlet/opac?punumber=6488907", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6488907", "http://ieee-iotj.org/#"]}, "title": "Joint Offloading Decision and Resource Allocation for Vehicular Fog-Edge Computing Networks: A Contract-Stackelberg Approach", "abstract": "With the popularity of mobile devices and development of computationally intensive applications, researchers are focusing on offloading computation to the mobile-edge computing (MEC) server due to its high computational efficiency and low communication delay. As the computing resources of an MEC server are limited, vehicles in the urban area who have abundant idle resources should be fully utilized. However, offloading computing tasks to vehicles faces many challenging issues. In this article, we introduce a vehicular fog-edge computing paradigm and formulate it as a multistage Stackelberg game to deal with these issues. Specifically, vehicles are not obligated to share resources, and let alone disclose their private information (e.g., stay time and the amount of resources). Therefore, in the first stage, we design a contract-based incentive mechanism to motivate vehicles to contribute their idle resources. Next, due to the complicated interactions among vehicles, roadside unit (RSU), MEC server, and mobile device users, it is challenging to coordinate the resources of all parties and design a transaction mechanism to make all entities benefit. In the second and third stages, based on the Stackelberg game, we develop pricing strategies that maximize the utilities of all parties. The analytical forms of optimal strategies for each stage are given. Simulation results demonstrate the effectiveness of our proposed incentive mechanism, reveal the trends of energy consumption and offloading decisions of users with various parameters, and present the performance comparison between our framework and existing MEC offloading paradigm in vehicular networks.", "venue": "IEEE Internet of Things Journal", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-02-26", "journal": {"name": "IEEE Internet of Things Journal", "pages": "15969-15982", "volume": "9"}, "authors": [{"authorId": "2110426788", "name": "Yuwei Li"}, {"authorId": "47677211", "name": "Bo Yang"}, {"authorId": "2119797606", "name": "Hao Wu"}, {"authorId": "1800212", "name": "Qiaoni Han"}, {"authorId": "2109062697", "name": "Cailian Chen"}, {"authorId": "2066614902", "name": "Xinping Guan"}], "citations": [{"paperId": "0975b2db4aed81e5362360d0e626eb9b8174ff47", "title": "Dissatisfaction Feedback and Stackelberg Game-Based Task Offloading Mechanism for Parked Vehicle Edge Computing"}, {"paperId": "220058a8fbcdf268c79071dea108c58fc67b4c2c", "title": "Joint resource allocation and security redundancy for autonomous driving based on deep reinforcement learning algorithm"}, {"paperId": "788bf875cb510b704a92afc7fc998b0c32c3aeb7", "title": "Collaboration of Heterogeneous Edge Computing Paradigms: How to Fill the Gap Between Theory and Practice"}, {"paperId": "d574af780c495d472b6d95386c0395c0460f4803", "title": "A truthful double auction framework for security-driven and deadline-aware task offloading in fog-cloud environment"}, {"paperId": "4fa092563d5b133dc0c5c23c8df9c03d33de2aab", "title": "Task Class Partitioning for Mobile Computation Offloading"}, {"paperId": "b8d4b2ce64906af62476ab6a260138b27a3337e0", "title": "Large-Scale Cooperative Task Offloading and Resource Allocation in Heterogeneous MEC Systems via Multiagent Reinforcement Learning"}, {"paperId": "199b3dc47aeb2a133f906f784cddcac9fae7b53c", "title": "A Location-Privacy-Aware Taxi-Hailing System: Adaptive Differential Privacy-Based Dynamic Incentive Method"}, {"paperId": "41050886b7edfe115b4be0cc18a198b5b20f887a", "title": "Game Theoretic Resource Allocation for Information Freshness in Mobile Edge Computing"}, {"paperId": "0a9290e39ea93801cfe80a7ed89d315df5dff1ba", "title": "Task Migration and Resource Allocation Scheme in IoV With Roadside Unit"}, {"paperId": "9ca50cfd3556f6a9bb981677908ee696194a8f8c", "title": "Efficient Anchor Point Deployment for Low Latency Connectivity in MEC-Assisted C-V2X Scenarios"}, {"paperId": "44e529af8ea40a76df45b4e58bb8c9ffbebada19", "title": "A Comprehensive Survey Exploring the Multifaceted Interplay between Mobile Edge Computing and Vehicular Networks"}, {"paperId": "3f92e809724b0d26b534e298e60e09d527d42430", "title": "An offloading method in new energy recharging based on GT-DQN"}, {"paperId": "47b2da181e266f321e6d15e5b351f10520e7d0c4", "title": "Dynamic Contract-Based Resource Sharing Incentive Method for Vehicular Edge Computing-Assisted IoT Networks"}, {"paperId": "7d9d495aef61039d3d908195bb1d3f6eda2cdb16", "title": "Computation Offloading Method Using Stochastic Games for Software-Defined-Network-Based Multiagent Mobile Edge Computing"}, {"paperId": "a511b9a451e8e2ec45f5274cd2ab27d38ca3e8bc", "title": "Reinforcement learning based tasks offloading in vehicular edge computing networks"}, {"paperId": "6ebc7f6170ffb05aa9a96577398d2104aba908f2", "title": "NOMA-Enabled Delay Minimization for Marine Multi-access Edge Computing Networks: A Contract Incentive Scheme"}, {"paperId": "fddbdf1ce886fe6d770035b21c82e8b26cd0eed7", "title": "ReLIEF: A Reinforcement-Learning-Based Real-Time Task Assignment Strategy in Emerging Fault-Tolerant Fog Computing"}, {"paperId": "541fd99af6d8f1bd3c337a80299832eb591ac413", "title": "Computation Offloading and Resource Allocation Based on Game Theory in Symmetric MEC-Enabled Vehicular Networks"}, {"paperId": "ce45ed27b6f717fc28d765f1398e219ec1576fd0", "title": "Incentive-Driven Fog-Edge Computation Offloading and Resource Allocation for 5G-NR V2X-Based Vehicular Networks"}, {"paperId": "7aef40ad375bdf0efd0399f003afe2fd95f9f114", "title": "Incentive-driven and SAC-based Resource Allocation and Offloading Strategy in Vehicular Edge Computing Networks"}, {"paperId": "46caf191da92fbff96b95be32897686e1e53b081", "title": "Divergent Selection Task Offloading Strategy for Connected Vehicles Based on Incentive Mechanism"}, {"paperId": "cb11fef5b0f0e5ffb776a5c1e10000f45a2e4aa3", "title": "Contract-Optimization Approach (COA): A New Approach for Optimizing Service Caching, Computation Offloading, and Resource Allocation in Mobile Edge Computing Network"}, {"paperId": "eae3e05124c65915b02e977ccce4de7954ca17f9", "title": "Joint Task Offloading, Resource Sharing and Computation Incentive for Edge Computing Networks"}, {"paperId": "0ea11cc1a4b63c0c20c27217f589c1b15f192f16", "title": "An online auction mechanism for double time-varying constraints in vehicular edge computing"}, {"paperId": "07f2cffde188e7acc4c698aca8098fec832d1598", "title": "LAWOW: Lightweight Android Workload Offloading Based on WebAssembly in Heterogeneous Edge Computing"}, {"paperId": "c399d3b44ecf6c8aa7b4568e2d567847af2f0f01", "title": "Toward Secure and Trustworthy Vehicular Fog Computing: A Survey"}, {"paperId": "8d88f0fb9b54d7b05d2421c5b487970f1518d742", "title": "Resilient Disaster Relief in Industrial IoT: UAV Trajectory Design and Resource Allocation in 6G Non-Terrestrial Networks"}, {"paperId": "6b3269eb30913005bbdff9a9f4c7d47e34edfd31", "title": "Joint Crowdsensing and Offloading Algorithms for Edge-Assisted Internet of Intelligent Vehicles"}, {"paperId": "5c7cb367dd78654ea640085fa09587ad6fcb2c5e", "title": "Multi-Leader Single-Follower Stackelberg Game Task Offloading and Resource Allocation Based on Selection Optimization in Internet of Vehicles"}, {"paperId": "3c0bbd7cefa0c8d628a7cab08eb7735dae73c521", "title": "A Survey of State-of-the-Art on Edge Computing: theoretical Models, Technologies, Directions, and Development Paths"}]}
