{"paperId": "6d122357d5d94f88a65f6d8bf83a95ec4869a12d", "publicationVenue": {"id": "77dacf9a-9295-4cce-a62e-eadd399ae7a9", "name": "Scientific Journal of Astana IT University", "type": "journal", "alternate_names": ["Sci J Astana IT Univ"], "issn": "2707-9031", "url": "https://sj.astanait.edu.kz/"}, "title": "DEVELOPMENT OF A QUESTION ANSWERING CHATBOT FOR BLOCKCHAIN DOMAIN", "abstract": "Large Language Models (LLMs), such as ChatGPT, have transformed the field of natural language processing with their capacity for language comprehension and generation of human-like, fluent responses for many downstream tasks. Despite their impressive capabilities, they often fall short in domain-specific and knowledge-intensive domains due to a lack of access to relevant data. Moreover, most state-of-art LLMs lack transparency as they are often accessible only through APIs. Furthermore, their application in critical real-world scenarios is hindered by their proclivity to produce hallucinated information and inability to leverage external knowledge sources. To address these limitations, we propose an innovative system that enhances LLMs by integrating them with an external knowledge management module. The system allows LLMs to utilize data stored in vector databases, providing them with relevant information for their responses. Additionally, it enables them to retrieve information from the Internet, further broadening their knowledge base. The research approach circumvents the need to retrain LLMs, which can be a resource-intensive process. Instead, it focuses on making more efficient use of existing models. Preliminary results indicate that the system holds promise for improving the performance of LLMs in domain-specific and knowledge-intensive tasks. By equipping LLMs with real-time access to external data, it is possible to harness their language generation capabilities more effectively, without the need to continually strive for larger models.", "venue": "Scientific Journal of Astana IT University", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-30", "journal": {"name": "Scientific Journal of Astana IT University"}, "authors": [{"authorId": "2235726192", "name": "Aigerim Mansurova"}, {"authorId": "2044883113", "name": "A. Nugumanova"}, {"authorId": "2265205753", "name": "Zhansaya Makhambetova"}], "citations": [{"paperId": "751c3659116b9c13bbe05a309778cdcef3ad86ee", "title": "Enhancing Emergency Decision-making with Knowledge Graphs and Large Language Models"}]}
