{"paperId": "6d13778ebda969e01c0c6be588fd32e5b2779aa7", "publicationVenue": {"id": "a0d0eb8a-33c6-4924-84e5-dc86b0305913", "name": "Nanoenergy Advances", "type": "journal", "alternate_names": ["Nanoenergy Adv"], "issn": "2673-706X"}, "title": "Recent Progress of Bioinspired Triboelectric Nanogenerators for Electronic Skins and Human–Machine Interaction", "abstract": "Advances in biomimetic triboelectric nanogenerators (TENGs) have significant implications for electronic skin (e-skin) and human–machine interaction (HMI). Emphasizing the need to mimic complex functionalities of natural systems, particularly human skin, TENGs leverage triboelectricity and electrostatic induction to bridge the gap in traditional electronic devices’ responsiveness and adaptability. The exploration begins with an overview of TENGs’ operational principles and modes, transitioning into structural and material biomimicry inspired by plant and animal models, proteins, fibers, and hydrogels. Key applications in tactile sensing, motion sensing, and intelligent control within e-skins and HMI systems are highlighted, showcasing TENGs’ potential in revolutionizing wearable technologies and robotic systems. This review also addresses the challenges in performance enhancement, scalability, and system integration of TENGs. It points to future research directions, including optimizing energy conversion efficiency, discovering new materials, and employing micro-nanostructuring techniques for enhanced triboelectric charges and energy conversion. The scalability and cost-effectiveness of TENG production, pivotal for mainstream application, are discussed along with the need for versatile integration with various electronic systems. The review underlines the significance of making bioinspired TENGs more accessible and applicable in everyday technology, focusing on compatibility, user comfort, and durability. Conclusively, it underscores the role of bioinspired TENGs in advancing wearable technology and interactive systems, indicating a bright future for these innovations in practical applications.", "venue": "Nanoenergy Advances", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2024-01-17", "journal": {"name": "Nanoenergy Advances"}, "authors": [{"authorId": "2279898565", "name": "Baosen Zhang"}, {"authorId": "2279901143", "name": "Yunchong Jiang"}, {"authorId": "2279829055", "name": "Baojin Chen"}, {"authorId": "2279865566", "name": "Haidong Li"}, {"authorId": "2259974554", "name": "Yanchao Mao"}], "citations": []}
