{"paperId": "6d1f6a87d3914ee4fe51492379b60ce5d216ec10", "publicationVenue": null, "title": "Doubly Stochastic Distance Clustering", "abstract": "In doubly stochastic (DS) clustering, it is common to initialize the DS matrix with a similarity matrix and use the eigen-decomposition of the DS-scaled similarity matrix to obtain the optimal cluster indicators. The selection of a proper initial similarity measure, however, is a difficult problem and the eigen-decomposition is time-consuming, with time complexity of <inline-formula> <tex-math notation=\"LaTeX\">$O(n^{3})$ </tex-math></inline-formula> where <inline-formula> <tex-math notation=\"LaTeX\">$n$ </tex-math></inline-formula> is the data size. In this paper, we propose to replace the DS similarity matrix with the DS Euclidean distance matrix for clustering. We show that the optimal cluster indicators minimize the <inline-formula> <tex-math notation=\"LaTeX\">$k$ </tex-math></inline-formula>-medoids error of data with DS Euclidean distance. We propose a fast method to obtain data with DS distance for clustering. Compared with DS similarity clustering, DS distance clustering is kernel-free and of low time complexity, typically <inline-formula> <tex-math notation=\"LaTeX\">$O(nd^{2}+d^{3})$ </tex-math></inline-formula> where <inline-formula> <tex-math notation=\"LaTeX\">$d$ </tex-math></inline-formula> is the input dimension. Experimental results on real-world datasets and the image segmentation task verify the superiority of our DS distance clustering over several competing methods.", "venue": "IEEE transactions on circuits and systems for video technology (Print)", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-11-01", "journal": {"name": "IEEE Transactions on Circuits and Systems for Video Technology", "pages": "6721-6732", "volume": "33"}, "authors": [{"authorId": "2109336321", "name": "Li He"}, {"authorId": "46197387", "name": "Hong Zhang"}], "citations": [{"paperId": "b5ce7545e1f4d74145451959e73a677a51aa412c", "title": "Bayesian non-negative matrix factorization with Student’s t-distribution for outlier removal and data clustering"}, {"paperId": "2526f623637b21af951d145473a40e90bb87a275", "title": "Deep Learning in the Ubiquitous Human–Computer Interactive 6G Era: Applications, Principles and Prospects"}]}
