{"paperId": "6d204918e9ebae8125ed7524dbe0a4f9cc4278dd", "publicationVenue": null, "title": "High-Performance Overlay Analysis of Massive Geographic Polygons That Considers Shape Complexity in a Cloud Environment", "abstract": ": Overlay analysis is a common task in geographic computing that is widely used in geographic information systems, computer graphics, and computer science. With the breakthroughs in Earth observation technologies, particularly the emergence of high-resolution satellite remote-sensing technology, geographic data have demonstrated explosive growth. The overlay analysis of massive and complex geographic data has become a computationally intensive task. Distributed parallel processing in a cloud environment provides an efficient solution to this problem. The cloud computing paradigm represented by Spark has become the standard for massive data processing in the industry and academia due to its large-scale and low-latency characteristics. The cloud computing paradigm has attracted further attention for the purpose of solving the overlay analysis of massive data. These studies mainly focus on how to implement parallel overlay analysis in a cloud computing paradigm but pay less attention to the impact of spatial data graphics complexity on parallel computing efficiency, especially the data skew caused by the difference in the graphic complexity. Geographic polygons often have complex graphical structures, such as many vertices, composite structures including holes and islands. When the Spark paradigm is used to solve the overlay analysis of massive geographic polygons, its calculation efficiency is closely related to factors such as data organization and algorithm design. Considering the influence of the shape complexity of polygons on the performance of overlay analysis, we design and implement a parallel processing algorithm based on the Spark paradigm in this paper. Based on the analysis of the shape complexity of polygons, the overlay analysis speed is improved via reasonable data partition, distributed spatial index, a minimum boundary rectangular filter and other optimization processes, and the high speed and parallel efficiency are maintained.", "venue": "ISPRS Int. J. Geo Inf.", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-06-26", "journal": {"name": "ISPRS Int. J. Geo Inf.", "pages": "290", "volume": "8"}, "authors": [{"authorId": "2074107196", "name": "Kang Zhao"}, {"authorId": "4418991", "name": "Baoxuan Jin"}, {"authorId": "2072838147", "name": "Hong Fan"}, {"authorId": "2118727901", "name": "Weiwei Song"}, {"authorId": "151226400", "name": "Sunyu Zhou"}, {"authorId": "151261716", "name": "Yuanyi Jiang"}], "citations": [{"paperId": "31b3c5f9c94a6dad67822d27200b6cc207ffeec4", "title": "Finding the forgotten spaces: Using a social-ecological framework to map informal green space in Melbourne, Australia"}, {"paperId": "f05be4f98dfb549fded8f20c15aaecfb7eba6aa2", "title": "Comparison of 4 vector polygon clipping algorithms in the spatial overlay analysis of GIS using simple feature model"}, {"paperId": "1fdebf461e2fb12fb0ff5b1c15fe2932800cc293", "title": "Investigation of the effects of hybrid modeling approaches, factor standardization, and categorical mapping on the performance of landslide susceptibility mapping in Van, Turkey"}, {"paperId": "555738ad04d1d1e199a025e2c0613205d955568d", "title": "A Zoning Earthquake Casualty Prediction Model Based on Machine Learning"}, {"paperId": "c4253cab23ebf45160195b4040dbf219d32e5488", "title": "Bi-Temporal Analysis of Spatial Changes of Boreal Forest Cover and Species in Siberia for the Years 1985 and 2015"}, {"paperId": "a867f35e73e672c3ded4aeaae36b23864236b6a2", "title": "Correction to: Constructing a spatial analysis model in assessing the sensitivity of landscape erosion in mountainous regions of Vietnam"}, {"paperId": "f9a7ed159c1f3994dc1e20dc1d0170eb366a1742", "title": "Introduction to Big Data Computing for Geospatial Applications"}, {"paperId": "10ed6607b28feed7cc6f9e397860fb55b9a0e44e", "title": "An Efficient Parallel Algorithm for Polygons Overlay Analysis"}, {"paperId": "7985106cd9508f98039467b530b3ee293fde7737", "title": "Comparative Study on the Effect of Shape Complexity on the Efficiency of Different Overlay Analysis Algorithms"}, {"paperId": "748bc7ae1e4c6b0d0246b6974958ff0b9f160ee0", "title": "Towards Hardware OpenGL Support in Cloud Computing"}, {"paperId": "01bb7c077f488b4f6465af823a738fff33fa3311", "title": "A Data Allocation Strategy for Geocomputation Based on Shape Complexity in A Cloud Environment Using Parallel Overlay Analysis of Polygons as an Example"}, {"paperId": "7e6d8cb05ef126bee71d0167169be070ff5b19f5", "title": "Investigation on Classification and Cleaning for Visually Self-Intersected Monocyclic Polygons"}, {"paperId": "867e823453fd44bee697cdb91b0b4d8d7cc3ca0a", "title": "Investigation on Classification and Cleaning for Visually Self-Intersected Multipart Polygon With One Outer Ring"}]}
