{"paperId": "6d26057f202f3346785eec76e85ecd44d9a67c80", "publicationVenue": {"id": "165fa1b5-e07f-4b6e-9203-04493f6a7c5c", "name": "Frontiers in Big Data", "alternate_names": ["Front Big Data"], "issn": "2624-909X", "url": "https://www.frontiersin.org/journals/big-data"}, "title": "Factors for the implementation of the circular economy in Big Data environments in service companies in post pandemic times of COVID-19: The case of Colombia", "abstract": "In emerging economies, Big Data (BD) analytics has become increasingly popular, particularly regarding the opportunities and expected benefits. Such analyzes have identified that the production and consumption of goods and services, while unavoidable, have proven to be unsustainable and inefficient. For this reason, the concept of the circular economy (CE) has emerged strongly as a sustainable approach that contributes to the eco-efficient use of resources. However, to develop a circular economy in DB environments, it is necessary to understand what factors influence the intention to accept its implementation. The main objective of this research was to assess the influence of attitudes, subjective norms, and perceived behavioral norms on the intention to adopt CE in BD-mediated environments. The methodology is quantitative, cross-sectional with a descriptive correlational approach, based on the theory of planned behavior and a Partial Least Squares Structural Equation Model (PLS-SEM). A total of 413 Colombian service SMEs participated in the study. The results show that managers' attitudes, subjective norms, and perceived norms of behavior positively influence the intentions of organizations to implement CB best practices. Furthermore, most organizations have positive intentions toward CE and that these intentions positively influence the adoption of DB; however, the lack of government support and cultural barriers are perceived as the main limitation for its adoption. The research leads to the conclusion that BD helps business and government develop strategies to move toward CE, and that there is a clear positive will and intent toward a more restorative and sustainable corporate strategy.", "venue": "Frontiers in Big Data", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-04-03", "journal": {"name": "Frontiers in Big Data", "volume": "6"}, "authors": [{"authorId": "2213419509", "name": "Carlos Alberto Almanza Junco"}, {"authorId": "2213262941", "name": "Marial del Pilar Pulido Ramirez"}, {"authorId": "2181882966", "name": "Mercedes Gaitán Angulo"}, {"authorId": "2023438717", "name": "M. Gómez-Caicedo"}, {"authorId": "2213420590", "name": "Álvaro Luis Mercado Suárez"}], "citations": []}
