{"paperId": "6d3378b9fcc0a8deb8e254dd5e351e39cd3acb48", "publicationVenue": {"id": "2216cafa-e724-48f0-a497-f46a99605f1e", "name": "Land", "type": "journal", "issn": "2073-445X", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-321184", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-321184", "https://www.mdpi.com/journal/land"]}, "title": "Knowledge Transfer on Digital Transformation: An Analysis of the Olive Landscape in Andalusia, Spain", "abstract": "The global economy, and agriculture, in particular, faces significant challenges and transformation pressures. A major challenge, and opportunity, is the transformation towards digital agriculture or agriculture 4.0, where knowledge transfer (KT) has an important role to play not only in ensuring that digital innovations reach end-users, but also that these innovations contribute to development in rural landscapes. This paper analyses the role of KT in the framework of digital transformation (DT) in the Andalusian olive landscape. Thus, from the perspective of knowledge-generating agents, the main knowledge emitting and receiving actors in the DT are identified by using Social Network Analysis techniques (SNA). Subsequently, the performance of the Technological Innovation System (TIS) in KT is evaluated by using the multi-criteria Analytic Hierarchy Process (AHP) method. The results suggest that the knowledge-generating agents, the knowledge transfer actors, and the scientific and dissemination media actors are the main knowledge emitters and highlight their role as cohesive actors of the social network. The main knowledge receivers are olive growers, cooperatives and non-cooperative groups. The results also indicate that the global performance of the TIS in the KT function is medium/low. Furthermore, in the KT sub-functions where the TIS in DT performs best is the quality of the transfer processes of DT, and where it performs worst is the sufficiency of spaces for KT.", "venue": "Land", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-01-02", "journal": {"name": "Land"}, "authors": [{"authorId": "1581652894", "name": "Liliana Reina-Usuga"}, {"authorId": "1402045327", "name": "C. Parra-López"}, {"authorId": "1403270033", "name": "Carmen Carmona-Torres"}], "citations": [{"paperId": "2bd3796793b8e188432c83e4e00820d0c69f99d0", "title": "Functional analysis of technological innovation systems enabling digital transformation: A semi-quantitative multicriteria framework applied in the olive sector"}, {"paperId": "29cd779763a41178b9ab92515aa2df03b751912b", "title": "Towards socio-digital rural territories to drive digital transformation: General conceptualisation and application to the olive areas of Andalusia, Spain"}, {"paperId": "14b5d907be271a910b044d6123f7fe4fb0a0cdac", "title": "Technology Transfer Model for Small-Scale Farms"}, {"paperId": "b531d31a63d28e1d9e819345e38a1ad1c81893e7", "title": "Use of digital technology for research data and information transfer within the Australian grains sector: A case study using Online Farm Trials"}, {"paperId": "d0ad8bdd5464eb324bb95fda98458eb9f8d91371", "title": "Z mladimi gospodarji do večje dodane vrednosti na slovenskih kmetijah"}]}
