{"paperId": "6d373717bb6cabddd211993432e6e4ac332f33a6", "publicationVenue": {"id": "011e0c39-7f47-401e-98d2-ee08fdf206a3", "name": "Library hi tech", "type": "journal", "alternate_names": ["Libr Hi Tech", "Library Hi Tech", "Libr hi tech"], "issn": "0737-8831", "url": "https://www.emerald.com/insight/publication/issn/0737-8831"}, "title": "Towards personal learning environment by enhancing adaptive access to digital library using ontology-supported collaborative filtering", "abstract": "PurposeThe purpose of this paper is to provide adaptive access to learning resources in the digital library.Design/methodology/approachA novel method using ontology-based multi-attribute collaborative filtering is proposed. Digital libraries are those which are fully automated and all resources are in digital form and access to the information available is provided to a remote user as well as a conventional user electronically. To satisfy users' information needs, a humongous amount of newly created information is published electronically in digital libraries. While search applications are improving, it is still difficult for the majority of users to find relevant information. For better service, the framework should also be able to adapt queries to search domains and target learners.FindingsThis paper improves the accuracy and efficiency of predicting and recommending personalized learning resources in digital libraries. To facilitate a personalized digital learning environment, the authors propose a novel method using ontology-supported collaborative filtering (CF) recommendation system. The objective is to provide adaptive access to learning resources in the digital library. The proposed model is based on user-based CF which suggests learning resources for students based on their course registration, preferences for topics and digital libraries. Using ontological framework knowledge for semantic similarity and considering multiple attributes apart from learners' preferences for the learning resources improve the accuracy of the proposed model.Research limitations/implicationsThe results of this work majorly rely on the developed ontology. More experiments are to be conducted with other domain ontologies.Practical implicationsThe proposed approach is integrated into Nucleus, a Learning Management System (https://nucleus.amcspsgtech.in). The results are of interest to learners, academicians, researchers and developers of digital libraries. This work also provides insights into the ontology for e-learning to improve personalized learning environments.Originality/valueThis paper computes learner similarity and learning resources similarity based on ontological knowledge, feedback and ratings on the learning resources. The predictions for the target learner are calculated and top N learning resources are generated by the recommendation engine using CF.", "venue": "Library hi tech", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-02-28", "journal": {"name": "Library Hi Tech"}, "authors": [{"authorId": "2128473954", "name": "V. Senthil Kumaran"}, {"authorId": "145906545", "name": "R. Latha"}], "citations": [{"paperId": "e5c4840be124ab27af9d351a09d0b76bf3961d3e", "title": "Editorial: Special selection on current bibliometrics and reviews"}, {"paperId": "d7fcdb4f68aba6d6d5545e3798cf6856b1dfee78", "title": "Editorial: Special selection on advances in learning technologies"}, {"paperId": "e62b3aa750fb48d1936dd93503dd641a6aebcb98", "title": "How is the development of library and information science in China?"}, {"paperId": "c67fba66cd8e073cb4bca7a7c1c8390cd5d264ae", "title": "Editorial: Special selection on contemporary bibliometric analytics"}, {"paperId": "3640070d4a8a52aff6c7bc6cab717425c0c45074", "title": "Ontology-Driven Intelligent Group Pairing in Project-Based Collaborative Learning"}]}
