{"paperId": "6d5eeb0948f5dadc8b0610ec2087c8fc78d24afa", "publicationVenue": null, "title": "Towards a Cloud Based Smart Traffic Management Framework", "abstract": "Abstract. Traffic big data has brought many opportunities for traffic management applications. However several challenges like heterogeneity, storage, management, processing and analysis of traffic big data may hinder their efficient and real-time applications. All these challenges call for well-adapted distributed framework for smart traffic management that can efficiently handle big traffic data integration, indexing, query processing, mining and analysis. In this paper, we present a novel, distributed, scalable and efficient framework for traffic management applications. The proposed cloud computing based framework can answer technical challenges for efficient and real-time storage, management, process and analyse of traffic big data. For evaluation of the framework, we have used OpenStreetMap (OSM) real trajectories and road network on a distributed environment. Our evaluation results indicate that speed of data importing to this framework exceeds 8000 records per second when the size of datasets is near to 5 million. We also evaluate performance of data retrieval in our proposed framework. The data retrieval speed exceeds 15000 records per second when the size of datasets is near to 5 million. We have also evaluated scalability and performance of our proposed framework using parallelisation of a critical pre-analysis in transportation applications. The results show that proposed framework achieves considerable performance and efficiency in traffic management applications.", "venue": "", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2017-09-27", "journal": {"name": "ISPRS - International Archives of the Photogrammetry, Remote Sensing and Spatial Information Sciences", "pages": "447-453", "volume": ""}, "authors": [{"authorId": "31226742", "name": "M. Rahimi"}, {"authorId": "2557282", "name": "F. Hakimpour"}], "citations": [{"paperId": "cd2901f61dd87f13fd7d4e6da1256b81fa4e618f", "title": "Cloud Computing based Smart Traffic Management System with Priority Switching for Health Care Services"}, {"paperId": "e241d0a1bcbe4b452f04b003665faaffd5372326", "title": "Issues and Challenges Related to Cloud-Based Traffic Management System: A Brief Survey"}]}
