{"paperId": "6d60bcd0e957dd5c564bed716d7198ae622a5d96", "publicationVenue": {"id": "899831a7-9af2-403b-b185-fa56c8634454", "name": "IEEE transactions on engineering management", "type": "journal", "alternate_names": ["IEEE Transactions on Engineering Management", "IEEE Trans Eng Manag", "IEEE trans eng manag"], "issn": "0018-9391", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=17", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=17"]}, "title": "Identifying the Determinants of Innovation Capability With Machine Learning and Patents", "abstract": "Innovation capability (IC) is a fundamental firms’ strategic asset to sustain competitive advantage. In this article, relying on patent data, patents forward citations are used as proxy of IC and the main patents numerical and categorical variables are considered as proxy of IC determinants. The main purpose of this article is to understand which patents features are relevant to predict IC, i.e., which are the determinants of IC within patents. Three different algorithms of machine learning, widely applied to model real-world phenomena, regularized least squares, deep neural networks, and random forest are applied for this investigation. Results show that the most important patent features useful to predict IC refer to internal determinants, such as the technological scope of the company (technological domains and International Patent Classification classes), the backward citations, and technical concepts. Some external variables are also relevant, such as the family size, a time-related variable, and the timespan between the youngest and oldest patent of the family. Implications from this article concern two perspectives. From a methodological perspective, the study shows the usefulness of machine learning approaches in simplifying the decision-making process as they reduce the number of variables to be considered to investigate the company’s IC and they provide accurate and easily interpretable result. From a managerial standpoint, this article points out the few and relevant patent variables to be considered when dealing with patents and IC.", "venue": "IEEE transactions on engineering management", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-10-01", "journal": {"name": "IEEE Transactions on Engineering Management", "pages": "2144-2154", "volume": "69"}, "authors": [{"authorId": "48065422", "name": "L. Ponta"}, {"authorId": "14415711", "name": "Gloria Puliga"}, {"authorId": "1682762", "name": "L. Oneto"}, {"authorId": "2775814", "name": "R. Manzini"}], "citations": [{"paperId": "115d40c2c11a539d9757dd7cbc082e1f4faafec3", "title": "Reacting and recovering after an innovation failure. An agent-based approach"}, {"paperId": "6dde769b6c5182c14727a05c5331f19f5230b6be", "title": "Assessing innovation capabilities of manufacturing companies by combination of unsupervised and supervised machine learning approaches"}, {"paperId": "971f6ebab375f4c3ff0f710420db9704785c6b31", "title": "Prediction of patent grant and interpreting the key determinants: an application of interpretable machine learning approach"}, {"paperId": "ae516332c38ea708e8b309b6f0e0bec575300f72", "title": "Evaluation of China's regional innovation capability based on simulated annealing projection pursuit model and nested fuzzy evaluation model"}, {"paperId": "8c0372f81418268159fcfe10bb85f0ba93ef2209", "title": "Topic identification and sentiment trends in Weibo and WeChat content related to intellectual property in China"}, {"paperId": "271674a22628145078e9aac51aaef0304d37a77d", "title": "Application of machine learning techniques to predict entrepreneurial firm valuation"}, {"paperId": "ccf9969a3d9651483234fa2d63ca558de4475a66", "title": "To copatent or not to copatent: An agent-based model for firms facing this dilemma"}, {"paperId": "8c910c763f78a9bf48215070bfd709b44bb07597", "title": "A measure of innovation performance: the Innovation Patent Index"}, {"paperId": "81895d6534862e9e89e7736b22661f3449750fe4", "title": "An Ensemble Machine Learning Technique for Functional Requirement Classification"}, {"paperId": "7b0ffd63cc56b410da8de16c8c63c019b63423a4", "title": "Deep MLP-CNN Model Using Mixed-Data to Distinguish between COVID-19 and Non-COVID-19 Patients"}, {"paperId": "c2753247c2b28d5647f552c046a8f9000cc7c5ed", "title": "A Machine Learning-Based Approach to Identifying Key Innovation Determinants for Industrial Firms: The Case of the Pharmaceutical Industry in China"}, {"paperId": "2f22e777a9e81dbf9747723946aa8e393361482e", "title": "Learning from Citation: Interpretable Patent Valuation via Conditional Variational Autoencoder"}]}
