{"paperId": "6d60a95b0b507d859a00b9d138373dc383b8962e", "publicationVenue": {"id": "20a3a2f3-532a-4f04-9f3d-1e268e100872", "name": "International Journal of Advanced Computer Science and Applications", "type": "journal", "alternate_names": ["Int J Adv Comput Sci Appl"], "issn": "2156-5570", "url": "http://sites.google.com/site/ijacsa2010/", "alternate_urls": ["http://thesai.org/Publication/Default.aspx", "https://thesai.org/Publications/IJACSA"]}, "title": "Hadoop as a Service: Integration of a Company’s Heterogeneous Data to a Remote Hadoop Infrastructure", "abstract": "—Data analysis is very important for the development of any business today. It helps to identify organizational bottlenecks, optimize business processes, foresee customers’ demands and behavior, and provides summarized data that could help reducing costs and increase profits. Having this information when designing new products or services highly increases the chances of their success, and thus provides an additional competitive advantage over other businesses. However, having a single data analyst with a computer is far from enough in the era of big data. There are powerful data analytical software tools, but they are either expensive or hard to deploy and require multiple high-performance servers to run. Buying expensive hardware and software, and hiring high-qualified IT experts, is not affordable for all companies, especially for smaller ones and start-ups. Therefore, this article proposes an architecture for integration of a company’s heterogeneous data (stored within a database of any type, or in the file system) to a remote Hadoop cluster, providing powerful data analytical services on demand. This is an affordable and cost-effective cloud-based solution, suitable for a company of any size. Businesses are not required to by any hardware or software, but use the data analytical services on demand, paying a small processing fee per request or by subscription.", "venue": "International Journal of Advanced Computer Science and Applications", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": {"name": "International Journal of Advanced Computer Science and Applications"}, "authors": [{"authorId": "2925614", "name": "Yordan Kalmukov"}, {"authorId": "39839198", "name": "M. Marinov"}], "citations": [{"paperId": "3b4c309f220789ace2efd29a25128da59936a42c", "title": "Automated system for tracking the condition of a patient's feet and selecting specialized insoles"}, {"paperId": "f71ba34e5cd1e8c477b0c0b5e5d9ecd826d18f85", "title": "Signal processing techniques used in speech recognition or synthesis. An overview"}, {"paperId": "865437df3037aa082421e32e6284d45fad2017c3", "title": "Experimental Analysis of WebHDFS API Throughput"}]}
