{"paperId": "6d6147d29202c86f23ee8ce1b00659fa5720380f", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Intrusion Detection in Internet of Things Systems: A Review on Design Approaches Leveraging Multi-Access Edge Computing, Machine Learning, and Datasets", "abstract": "The explosive growth of the Internet of Things (IoT) applications has imposed a dramatic increase of network data and placed a high computation complexity across various connected devices. The IoT devices capture valuable information, which allows the industries or individual users to make critical live dependent decisions. Most of these IoT devices have resource constraints such as low CPU, limited memory, and low energy storage. Hence, these devices are vulnerable to cyber-attacks due to the lack of capacity to run existing general-purpose security software. It creates an inherent risk in IoT networks. The multi-access edge computing (MEC) platform has emerged to mitigate these constraints by relocating complex computing tasks from the IoT devices to the edge. Most of the existing related works are focusing on finding the optimized security solutions to protect the IoT devices. We believe distributed solutions leveraging MEC should draw more attention. This paper presents a comprehensive review of state-of-the-art network intrusion detection systems (NIDS) and security practices for IoT networks. We have analyzed the approaches based on MEC platforms and utilizing machine learning (ML) techniques. The paper also performs a comparative analysis on the public available datasets, evaluation metrics, and deployment strategies employed in the NIDS design. Finally, we propose an NIDS framework for IoT networks leveraging MEC.", "venue": "Italian National Conference on Sensors", "year": 2022, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2022-05-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "22"}, "authors": [{"authorId": "1395812236", "name": "Eric Gyamfi"}, {"authorId": "9483953", "name": "A. Jurcut"}], "citations": [{"paperId": "25a1080503e29acf7046bd6ab17761af51f44147", "title": "Uncovering botnets in IoT sensor networks: a hybrid self-organizing maps approach"}, {"paperId": "2a0a056d57efcf1102898ad9553416cc9da02d37", "title": "A Novel Autoencoder based Federated Deep Transfer Learning and Weighted k-Subspace Network clustering for Intelligent Intrusion Detection for the Internet of Things"}, {"paperId": "7df041da99c48de11192bc06be5c7e6ede142f4e", "title": "Enhancing intrusion detection in IoT networks using machine learning-based feature selection and ensemble models"}, {"paperId": "6e90363a4030dc2be4fb0e251612015934736887", "title": "Adaptive Marine Predator Optimization Algorithm (AOMA)-Deep Supervised Learning Classification (DSLC) Based IDS Framework for MANET Security"}, {"paperId": "2ce003e0023a8097b4311e0493f717f5595140c7", "title": "Unlocking the potential: A comprehensive meta-synthesis of Internet of Things in the sports industry"}, {"paperId": "5d6e8ef53ea50788f10259fd2f8c4240ef26393f", "title": "Embedded machine learning of IoT streams to promote early detection of unsafe environments"}, {"paperId": "fbfc839a5e99841ac535ef9353ee98eba14922a4", "title": "Improving the security of Internet of Things (IoT) using Intrusion Detection System(IDS)"}, {"paperId": "ecd5979a9ae814be47c96c30fcc2ed6b4ebb3875", "title": "Computer Network Virus Defense with Data Mining-based Active Protection"}, {"paperId": "073f62081a43fc49a94e652aa18ac4a7c841df8d", "title": "ENSEMBLE MACHINE LEARNING APPROACH FOR IOT INTRUSION DETECTION SYSTEMS"}, {"paperId": "855d124ed1e74c6073a055d57d35bde583c55b5c", "title": "DANTD: A Deep Abnormal Network Traffic Detection Model for Security of Industrial Internet of Things Using High-Order Features"}, {"paperId": "99e81348aae8e3a5f0b8b2c44fe698ba4fd1c5a9", "title": "A Deep Learning Algorithm for Music Information Retrieval Recommendation System"}, {"paperId": "e347c4adfffdc4312b7be22aef9a85bd0ca1f4a4", "title": "Enhancing IoT Network Security: Unveiling the Power of Self-Supervised Learning against DDoS Attacks"}, {"paperId": "8fbac1419ee06a8a035adf27519123713dcb26fd", "title": "Cyberpsychology: A Longitudinal Analysis of Cyber Adversarial Tactics and Techniques"}, {"paperId": "19c85f3865577d1859808ab547ab239540e376c3", "title": "Implementing Machine Learning-based Autonomic Cyber Defense for IoT-enabled Healthcare Devices"}, {"paperId": "1c243d72a66350194f7c6d3905912ff80423bf48", "title": "A parallel game model‐based intrusion response system for cross‐layer security in industrial internet of things"}, {"paperId": "22a0e2c4436e35b22c9f7ece72cbed9e3c099e9d", "title": "Optimization algorithms in security and privacy-preserving data disturbance for collaborative edge computing social IoT deep learning architectures"}, {"paperId": "b2bb4d398e7d15a59f3f7d99f76c2dde7165b3a3", "title": "Evaluation of soft computing in intrusion detection for secure social Internet of Things based on collaborative edge computing"}, {"paperId": "51fe44efd3628fed2eccc23bcb4d905af7e36511", "title": "A survey on federated learning for security and privacy in healthcare applications"}, {"paperId": "8a99fa816af5bd02c9668fc4fbc89e0abb8977d9", "title": "TransIDS: A Transformer-based approach for intrusion detection in Internet of Things using Label Smoothing"}, {"paperId": "93a5d21d2ee12c11bf3f8331c49824a730543045", "title": "Survey on Intrusion Detection Systems Based on Machine Learning Techniques for the Protection of Critical Infrastructure"}, {"paperId": "c3b064a6d3ccb1cda413849dac42603a065943c5", "title": "Exploring Edge TPU for Network Intrusion Detection in IoT"}, {"paperId": "ed015a96b06de06adcd4e6ec948f5c5b42d1755d", "title": "SmartSentry: Cyber Threat Intelligence in Industrial IoT"}, {"paperId": "163ec23e6bc989277dc9c2497b3251b8f22fae1b", "title": "The Analysis of Communication Strategy of Disabled Sports Information Based on Deep Learning and the Internet of Things"}, {"paperId": "978152f4a6ef733bca9198077cad6f37b30e6136", "title": "Detection of Real-Time Malicious Intrusions and Attacks in IoT Empowered Cybersecurity Infrastructures"}]}
