{"paperId": "6d828a7aace632477c5d89c1d4e2182645030b85", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Balancing Autonomy and Alignment: A Multi-Dimensional Taxonomy for Autonomous LLM-powered Multi-Agent Architectures", "abstract": "Large language models (LLMs) have revolutionized the field of artificial intelligence, endowing it with sophisticated language understanding and generation capabilities. However, when faced with more complex and interconnected tasks that demand a profound and iterative thought process, LLMs reveal their inherent limitations. Autonomous LLM-powered multi-agent systems represent a strategic response to these challenges. Such systems strive for autonomously tackling user-prompted goals by decomposing them into manageable tasks and orchestrating their execution and result synthesis through a collective of specialized intelligent agents. Equipped with LLM-powered reasoning capabilities, these agents harness the cognitive synergy of collaborating with their peers, enhanced by leveraging contextual resources such as tools and datasets. While these architectures hold promising potential in amplifying AI capabilities, striking the right balance between different levels of autonomy and alignment remains the crucial challenge for their effective operation. This paper proposes a comprehensive multi-dimensional taxonomy, engineered to analyze how autonomous LLM-powered multi-agent systems balance the dynamic interplay between autonomy and alignment across various aspects inherent to architectural viewpoints such as goal-driven task management, agent composition, multi-agent collaboration, and context interaction. It also includes a domain-ontology model specifying fundamental architectural concepts. Our taxonomy aims to empower researchers, engineers, and AI practitioners to systematically analyze the architectural dynamics and balancing strategies employed by these increasingly prevalent AI systems. The exploratory taxonomic classification of selected representative LLM-powered multi-agent systems illustrates its practical utility and reveals potential for future research and development.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-10-05", "journal": {"name": "ArXiv", "volume": "abs/2310.03659"}, "authors": [{"authorId": "2267819041", "name": "Thorsten Händler"}], "citations": [{"paperId": "4d4092fe29c8798db2cdc25fa86c192ea3998db3", "title": "Language Models as Critical Thinking Tools: A Case Study of Philosophers"}, {"paperId": "550676250271276becf5a400f072241daf734f4f", "title": "Determinants of LLM-assisted Decision-Making"}, {"paperId": "b548a4f8ecc95c252b2e1c039926db492b09066c", "title": "PromptSet: A Programmer's Prompting Dataset"}, {"paperId": "938a1fd610f13804fac9dc052cb016c87f2991da", "title": "Evolving AI Collectives to Enhance Human Diversity and Enable Self-Regulation"}, {"paperId": "3f6f331c4ba2d2ed954288d62aad93a456bb04ea", "title": "Exploring a GPT-based large language model for variable autonomy in a VR-based human-robot teaming simulation"}, {"paperId": "4365b9c433eadcf9633568a6e6ad019f5b147650", "title": "A Taxonomy for Autonomous LLM-Powered Multi-Agent Architectures"}, {"paperId": "1ef6cb2e24a4ca377d8d1b592c7a529a2e9d1dc2", "title": "Exploring Large Language Models to Facilitate Variable Autonomy for Human-Robot Teaming"}]}
