{"paperId": "6d8aceb68892441761565bbb2254bb069e826ab5", "publicationVenue": null, "title": "Information and communication technology in agriculture: awareness, readiness and adoption in the Kingdom of Bahrain", "abstract": "PurposeInformation and communication technologies (ICT)-presented technological developments, such as soil sensors, remote sensing, artificial intelligence (AI) and big data, have shown the potential to increase crop output and quality while consuming fewer resources and having a smaller environmental impact. The first step in ushering in a new era of technological advancement in the agricultural sector in the Kingdom of Bahrain is evaluating how prepared farmers and farm owners are to adopt these technologies. Therefore, the current study examines how ICT are prepared, accepted and adopted in agriculture in the Kingdom of Bahrain.Design/methodology/approachThe study's goals were attained by using both quantitative and qualitative methodologies. A survey was created to learn more about the present state of ICT usage in agriculture, including its awareness, readiness, acceptance and adoption. To strengthen the conclusions and investigate the current situation related agricultural behavior, production and the use of information technology (IT) to support agriculture in the chosen farms, four exploratory field visits were made. Additionally, a strength-weakness-opportunities-threat (SWOT)-threat, opportunities, weakness, strength (TOWS) analysis was performed to evaluate the Kingdom of Bahrain's readiness and long-term plans for implementing ICT in agriculture. On the basis of secondary data, survey data and interview findings, SWOT-TOWS were created.FindingsThe findings revealed insufficient knowledge and awareness about ICT in agriculture. Despite the high level of digital infrastructure readiness in Bahrain, farmers are not ready to adopt sophisticated devices and complex applications such as crop sensing tools, the internet of things (IoT) and AI; however, there is a strong acceptance among farmers to implement new ideas and agriculture approaches.Originality/valueThe Arabian Gulf Countries, which are characterized by an arid environment, sporadic vegetation, weak soil and a lack of water supplies and arable land, have few studies that explore the crucial role of ICT in growing the agricultural sector. Considering the influence of ICT on the provision of more productive agriculture in a challenging and complicated environment, the study contributes to the body of knowledge by conducting an empirical investigation that addresses an urgent issue. The study is considered one of the few in the countries of the Arabian Gulf to address this subject.", "venue": "Arab Gulf Journal of Scientific Research", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2023-03-15", "journal": {"name": "Arab Gulf Journal of Scientific Research"}, "authors": [{"authorId": "119688312", "name": "J. Al-Ammary"}, {"authorId": "2211640640", "name": "Mohammed Essam Ghanem"}], "citations": [{"paperId": "c10cda9bd9e93fce5928f16dc38e2f02f5aec424", "title": "ICT acceptance, language use and information culture as tools for enhancing information literacy within smallholder maize farmers in Uganda"}, {"paperId": "5c54291f0492469d88ff385c74005df2b81d5096", "title": "Promoting the Transition towards Agriculture 4.0: A Systematic Literature Review on Drivers and Barriers"}, {"paperId": "2cc04b79227a8f6c4483ee94da2d3c7394b318ec", "title": "Adoption of smart farming technologies in field operations: A systematic review and future research agenda"}, {"paperId": "af35019176b004df4e166f546cf311789dd503ea", "title": "Entrepreneurial orientation and competitive aggressiveness: A need for conceptual refinement and contextualization"}]}
