{"paperId": "6d9400b40e092c9d79ff9846b3133b8baf43ac42", "publicationVenue": {"id": "fcbcaf18-8ab1-43e1-a973-604bbc7e344e", "name": "Proceedings of the VLDB Endowment", "type": "journal", "alternate_names": ["Proceedings of The Vldb Endowment", "Proc VLDB Endow", "Proc Vldb Endow"], "issn": "2150-8097", "url": "http://dl.acm.org/toc.cfm?id=J1174", "alternate_urls": ["http://portal.acm.org/toc.cfm?CFID=21632689&CFTOKEN=99329904&WantType=Affiliated%20Organizations&coll=ACM&dl=ACM&id=J1174&idx=J1174&part=affil&title=VLDB%20Endowment&type=periodical"]}, "title": "AnalyticDB-V", "abstract": "With the explosive growth of unstructured data (such as images, videos, and audios), unstructured data analytics is widespread in a rich vein of real-world applications. Many database systems start to incorporate unstructured data analysis to meet such demands. However, queries over unstructured and structured data are often treated as disjoint tasks in most systems, where hybrid queries (i.e., involving both data types) are not yet fully supported. In this paper, we present a hybrid analytic engine developed at Alibaba, named AnalyticDB-V (ADBV), to fulfill such emerging demands. ADBV offers an interface that enables users to express hybrid queries using SQL semantics by converting unstructured data to high dimensional vectors. ADBV adopts the lambda framework and leverages the merits of approximate nearest neighbor search (ANNS) techniques to support hybrid data analytics. Moreover, a novel ANNS algorithm is proposed to improve the accuracy on large-scale vectors representing massive unstructured data. All ANNS algorithms are implemented as physical operators in ADBV, meanwhile, accuracy-aware cost-based optimization techniques are proposed to identify effective execution plans. Experimental results on both public and in-house datasets show the superior performance achieved by ADBV and its effectiveness. ADBV has been successfully deployed on Alibaba Cloud to provide hybrid query processing services for various real-world applications.", "venue": "Proceedings of the VLDB Endowment", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-08-01", "journal": {"name": "Proceedings of the VLDB Endowment", "pages": "3152 - 3165", "volume": "13"}, "authors": [{"authorId": "2111631833", "name": "Chuangxian Wei"}, {"authorId": "2152563567", "name": "Bin Wu"}, {"authorId": "50695586", "name": "Sheng Wang"}, {"authorId": "1869921", "name": "Renjie Lou"}, {"authorId": "1943446516", "name": "Chaoqun Zhan"}, {"authorId": "2146324505", "name": "Feifei Li"}, {"authorId": "2912922", "name": "Yuanzhe Cai"}], "citations": [{"paperId": "c426a9ec535e04ddebd3e64b7f1605f456dcc4f3", "title": "SeRF: Segment Graph for Range-Filtering Approximate Nearest Neighbor Search"}, {"paperId": "b289d426e888a17b259b486a878c714e6ccd171e", "title": "A study of concept similarity in Wikidata"}, {"paperId": "c36d05d13ff0532fee315d441d20f390d3f2ad75", "title": "Starling: An I/O-Efficient Disk-Resident Graph Index Framework for High-Dimensional Vector Similarity Search on Data Segment"}, {"paperId": "414777b0fcdd48b2f20cd3fd24ba374dd61974c5", "title": "Towards Conceptualization Of A Prototype For Quantum Database: A Complete Ecosystem"}, {"paperId": "47764ccd0fcd215fc862101f9b0642fd5890b3c7", "title": "SPFresh: Incremental In-Place Update for Billion-Scale Vector Search"}, {"paperId": "95b949527025bf4c9ffe41947ac3ed43a2d3b2aa", "title": "Anser: Adaptive Information Sharing Framework of AnalyticDB"}, {"paperId": "12943da75c09b99534668ca5661cc2acd89e0a56", "title": "Modernization of Databases in the Cloud Era: Building Databases that Run Like Legos"}, {"paperId": "c4c193b3fca96a8b16f3dbe3247ad36389073537", "title": "Krypton: Real-time Serving and Analytical SQL Engine at ByteDance"}, {"paperId": "231b753ae413964f279db551795da7965366450c", "title": "Co-design Hardware and Algorithm for Vector Search"}, {"paperId": "73dd9f238f4ede76592d69003540351621937ba6", "title": "ARKGraph: All-Range Approximate K-Nearest-Neighbor Graph"}, {"paperId": "513792338b7314a039424af55b610579802123aa", "title": "Filtered-DiskANN: Graph Algorithms for Approximate Nearest Neighbor Search with Filters"}, {"paperId": "4f662c42b2bd52422b70d8f44175f33cec4f8969", "title": "High-Throughput Vector Similarity Search in Knowledge Graphs"}, {"paperId": "35cb6c17693ddec0d3ceaa598f3cd451637f08ea", "title": "iQAN: Fast and Accurate Vector Search with Efficient Intra-Query Parallelism on Multi-Core Architectures"}, {"paperId": "4b8040c9be47e30f1d2ab2a6db49efb4ee81353b", "title": "NLP And IR Applications For Financial Reporting And Non-Financial Disclosure. Framework Implementation And Roadmap For Feasible Integration With The Accounting Process"}, {"paperId": "b0e2dd233b2fa601fd769dd5a08ce07f0ae13e7c", "title": "Maze: A Cost-Efficient Video Deduplication System at Web-scale"}, {"paperId": "070e486dc29c8b5c7c109804390c66ba63e317cb", "title": "HQANN: Efficient and Robust Similarity Search for Hybrid Queries with Structured and Unstructured Constraints"}, {"paperId": "7083fd33bdfe380e2649dee969b3c44516d98675", "title": "Manu: A Cloud Native Vector Database Management System"}]}
