{"paperId": "6d97d97bd40da994ba40182e7890dc8533d73562", "publicationVenue": {"id": "2b17ce45-3b55-4be1-a978-fddecf5311de", "name": "Automation, Control, and Information Technology", "type": "conference", "alternate_names": ["International Conference on Applied Computing and Information Technology", "International Conference \"Advanced Computer Information Technologies\"", "ACIT", "Int Conf \"advanced Comput Inf Technol", "Int Conf Appl Comput Inf Technol", "Arab Conference on Information Technology", "Autom Control Inf Technol", "Arab Conf Inf Technol"]}, "title": "Towards an Effective Monitoring, Evaluation and Learning (MEL) System: Challenges and Solutions in a Data Science Perspective", "abstract": "This paper aims at addressing some challenges that prevent monitoring, evaluation and learning systems from effectively supporting the adaptive management. Using a case study of monitoring the drinking water quality compliance in Rwanda, a proposed four-step approach illustrated how big data can be integrated and leveraged to guarantee accurate and timely data insights as well as reliable predictions and user-friendly reporting. That approach capitalized on Hadoop data lake and R/RStudio to ingest and store structured and unstructured data from different sources, process them, and finally to consume them into interactive dashboards created in Microsoft Power Business Intelligence. Compared to the traditional practice of considering only measurable indicators, more quality key performance indicators were introduced to support the acquisition of additional and triangulated evidence on performance, which should satisfy the information needs of stakeholders.", "venue": "Automation, Control, and Information Technology", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-09-26", "journal": {"name": "2022 12th International Conference on Advanced Computer Information Technologies (ACIT)", "pages": "130-135"}, "authors": [{"authorId": "2187600163", "name": "Janvier Mwitirehe"}, {"authorId": "116702278", "name": "Cheruiyot W. Kipruto"}, {"authorId": "118976331", "name": "C. Ruranga"}], "citations": [{"paperId": "be2750c87af23b86937a2269c6df2e2420edc506", "title": "Large-scale Information Management using Hadoop Platform"}]}
