{"paperId": "6d9cd2d863d33b57b9bf435605a4e149d13e6d39", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "ML4IoT: A Framework to Orchestrate Machine Learning Workflows on Internet of Things Data", "abstract": "Internet of Things (IoT) applications generate vast amounts of real-time data. Temporal analysis of these data series to discover behavioural patterns may lead to qualified knowledge affecting a broad range of industries. Hence, the use of machine learning (ML) algorithms over IoT data has the potential to improve safety, economy, and performance in critical processes. However, creating ML workflows at scale is a challenging task that depends upon both production and specialized skills. Such tasks require investigation, understanding, selection, and implementation of specific ML workflows, which often lead to bottlenecks, production issues, and code management complexity and even then may not have a final desirable outcome. This paper proposes the Machine Learning Framework for IoT data (ML4IoT), which is designed to orchestrate ML workflows, particularly on large volumes of data series. The ML4IoT framework enables the implementation of several types of ML models, each one with a different workflow. These models can be easily configured and used through a simple pipeline. ML4IoT has been designed to use container-based components to enable training and deployment of various ML models in parallel. The results obtained suggest that the proposed framework can manage real-world IoT heterogeneous data by providing elasticity, robustness, and performance.", "venue": "IEEE Access", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-10-18", "journal": {"name": "IEEE Access", "pages": "152953-152967", "volume": "7"}, "authors": [{"authorId": "2053773096", "name": "J. M. Alves"}, {"authorId": "2851677", "name": "L. Honório"}, {"authorId": "1711826", "name": "Miriam A. M. Capretz"}], "citations": [{"paperId": "5ec64f04500e150188e50187507e9c03d776feb2", "title": "A Joint Study of the Challenges, Opportunities, and Roadmap of MLOps and AIOps: A Systematic Survey"}, {"paperId": "514a96af287ab19a399479f91ae91a28b1593c5c", "title": "AI-Enabled Secure Microservices in Edge Computing: Opportunities and Challenges"}, {"paperId": "805fa14448e84c0a89072592a187eca89bbf8e54", "title": "Orfeon: An AIOps framework for the goal-driven operationalization of distributed analytical pipelines"}, {"paperId": "4a22b6a37814762bc5b547491465306863e33b05", "title": "An Edge-Fog Architecture for Distributed 3D Reconstruction and Remote Monitoring of a Power Plant Site in the Context of 5G"}, {"paperId": "fe8defd9eae0f788d1210231e669fd0f95c4d922", "title": "Examining the Interplay Between Big Data and Microservices - A Bibliometric Review"}, {"paperId": "75bcb059911d8aabb9dc85857452b0fc339a405f", "title": "Dynamic Optimization and Heuristics Based Online Coverage Path Planning in 3D Environment for UAVs"}, {"paperId": "99de065a9253ebe85d402a61650726401eb88d71", "title": "A Heterogeneous Edge-Fog Environment Supporting Digital Twins for Remote Inspections"}, {"paperId": "c94540afea25f5402771f7deb88ab52d27399d73", "title": "Intelligent context-based healthcare metadata aggregator in internet of medical things platform"}]}
