{"paperId": "6d9ed444fe27237a2c53b19703c8ab84cdd2ea79", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Everything You wanted to Know about Smart Agriculture", "abstract": "The world population is anticipated to increase by close to 2 billion by 2050 causing a rapid escalation of food demand. A recent projection shows that the world is lagging behind accomplishing the\"Zero Hunger\"goal, in spite of some advancements. Socio-economic and well being fallout will affect the food security. Vulnerable groups of people will suffer malnutrition. To cater to the needs of the increasing population, the agricultural industry needs to be modernized, become smart, and automated. Traditional agriculture can be remade to efficient, sustainable, eco-friendly smart agriculture by adopting existing technologies. In this survey paper the authors present the applications, technological trends, available datasets, networking options, and challenges in smart agriculture. How Agro Cyber Physical Systems are built upon the Internet-of-Agro-Things is discussed through various application fields. Agriculture 4.0 is also discussed as a whole. We focus on the technologies, such as Artificial Intelligence (AI) and Machine Learning (ML) which support the automation, along with the Distributed Ledger Technology (DLT) which provides data integrity and security. After an in-depth study of different architectures, we also present a smart agriculture framework which relies on the location of data processing. We have divided open research problems of smart agriculture as future research work in two groups - from a technological perspective and from a networking perspective. AI, ML, the blockchain as a DLT, and Physical Unclonable Functions (PUF) based hardware security fall under the technology group, whereas any network related attacks, fake data injection and similar threats fall under the network research problem group.", "venue": "arXiv.org", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-01-13", "journal": {"name": "ArXiv", "volume": "abs/2201.04754"}, "authors": [{"authorId": "2052219738", "name": "Alakananda Mitra"}, {"authorId": "2114453829", "name": "Sukrutha L. T. Vangipuram"}, {"authorId": "1816755164", "name": "A. K. Bapatla"}, {"authorId": "2149797428", "name": "Vishnu Bathalapalli"}, {"authorId": "1710189", "name": "S. Mohanty"}, {"authorId": "1921834", "name": "E. Kougianos"}, {"authorId": "144445992", "name": "C. Ray"}], "citations": [{"paperId": "0d99fab6590afb310d67acff0388660fb36c5a5f", "title": "An Innovative Smart and Sustainable Low-Cost Irrigation System for Anomaly Detection Using Deep Learning"}, {"paperId": "47fe84f6c4391b13000e612cc088b6d762e42725", "title": "Identifying the Defective: Detecting Damaged Grains for Cereal Appearance Inspection"}, {"paperId": "c1b39b506e44d055381b7502f344022528721f91", "title": "Consensus Algorithms of Distributed Ledger Technology - A Comprehensive Analysis"}, {"paperId": "29b82fa68fca419303b9f5d179058bcb2376f24a", "title": "Design and IoT Implementation of Smart Greenhouse for Urban Agriculture"}, {"paperId": "74304e5f2b515cc2672c7af945e53b52fee9c319", "title": "aGRodet 2.0: An Automated Real-Time Approach for Multiclass Plant Disease Detection"}, {"paperId": "683d9e6ec06359383f68fa5c2edb91e2a0a8b776", "title": "EasyChain: an IoT-friendly blockchain for robust and energy-efficient authentication"}, {"paperId": "c45413963690b7c931d9fe7451d021d44360c659", "title": "An extensive survey of smart agriculture technologies: Current security posture"}, {"paperId": "48b6ed9a8779d075062899620576119cf3268eed", "title": "Soil Data Analytics using Machine Learning Techniques – A Survey"}, {"paperId": "029c4666df53dd2ae17ca1479be438f417372cf5", "title": "LoRa-based Novel System for Smart Agriculture"}, {"paperId": "a745bcbf40d53c6639acf9343294842f836ff537", "title": "A Comparative Analysis of ML Algorithms to Improve Crop Productivity Prediction"}, {"paperId": "fc8c33ffbda100b4937b5ae8ccbbbd70d34fd218", "title": "FinnWoodlands Dataset"}, {"paperId": "352147b8a59ca296c4940ecf571569581ef72056", "title": "Shape classification technology of pollinated tomato flowers for robotic implementation"}, {"paperId": "185cb6f0afa63e1bff12a0a8011b3d43bafa84ad", "title": "Agriculture 4.0 from IoT, Artificial Intelligence, Drone, & Blockchain Perspectives"}, {"paperId": "5c6577476510c8de740ff6cb7cab6ed1ba871c3f", "title": "agroString: Visibility and Provenance through a Private Blockchain Platform for Agricultural Dispense towards Consumers"}, {"paperId": "227941fd5a29fbf31fe0f3a50ce3e37e9e29969b", "title": "A User-friendly AIoT-Based Crop Recommendation system (UACR): concept and architecture"}, {"paperId": "4d5e852717f1aed4a8224612492ea40a133ccc70", "title": "Plantosphere: Next Generation Adaptive and Smart Agriculture System"}, {"paperId": "506898ac2e20ad99b1ee17e455d3c78d1f56c31f", "title": "eCrop: A Novel Framework for Automatic Crop Damage Estimation in Smart Agriculture"}, {"paperId": "0adf3bf3f8cc607221d2459d7671fc549cbc2075", "title": "A Comprehensive Survey on TinyML"}]}
