{"paperId": "6da60666a242a52b07d4ce7c005dd459d5aef458", "publicationVenue": null, "title": "The non-expert tax: quantifying the cost of auto-scaling in cloud-based data stream analytics", "abstract": "All major Cloud providers offer Data Stream Analytics as managed services, allowing non-expert users to easily extract knowledge from data streams. These services lift the burden of job deployment and maintenance off users by provisioning resources automatically. However, this automation often comes at a cost, as auto-scaling policies may choose to over-provision to meet performance goals. We term this cost the Non-Expert Tax: the relative error between the ideal cost of deployment if an expert user would carefully configure resource allocation and the actual cost incurred by executing the same job with auto-scaling enabled. We conduct an empirical evaluation study of auto-scaling in two popular Cloud-based data stream analytics services and we find that they aggressively scale out, allocating resources quickly to meet high demand, but are conservative when scaling down, thus, charging users for underutilized resources. We quantify the Non-Expert Tax and show it can be as high as 544% for short-term jobs and up to 332% per month for periodic workloads.", "venue": "BiDEDE@SIGMOD", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2022-06-12", "journal": {"name": "Proceedings of The International Workshop on Big Data in Emergent Distributed Environments"}, "authors": [{"authorId": "5846035", "name": "Yuanli Wang"}, {"authorId": "2064434231", "name": "Baiqing Lyu"}, {"authorId": "1993949", "name": "Vasiliki Kalavri"}], "citations": [{"paperId": "c44b23f6b060f3004b5b243c4afbf7c1cb778f52", "title": "Dirigo: Self-scaling Stateful Actors For Serverless Real-time Data Processing"}, {"paperId": "442cce72a508316afb174365d9ad7dc57fe30052", "title": "On Improving Streaming System Autoscaler Behaviour using Windowing and Weighting Methods"}, {"paperId": "87d727e3bde6f821e6fecc8f973d9474f9fd5694", "title": "Cost-Efficient and Latency-Aware Event Consuming in Workload-Skewed Distributed Event Queues"}]}
