{"paperId": "6db137480b8cbc71c4c955147f870f2b112e467f", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Sustainable Development of Smart Manufacturing Driven by the Digital Twin Framework: A Statistical Analysis", "abstract": "The Fourth Industrial Revolution drives industries from traditional manufacturing to the smart manufacturing approach. In this transformation, existing equipment, processes, or devices are retrofitted with some sensors and other cyber-physical systems (CPS), and adapted towards digital production, which is a blend of critical enabling technologies. In the current scenario of Industry 4.0, industries are shaping themselves towards the development of customized and cost-effective processes to satisfy customer needs with the aid of a digital twin framework, which enables the user to monitor, simulate, control, optimize, and identify defects and trends within, ongoing process, and reduces the chances of human prone errors. This paper intends to make an appraisal of the literature on the digital twin (DT) framework in the domain of smart manufacturing with the aid of critical enabling technologies such as data-driven systems, machine learning and artificial intelligence, and deep learning. This paper also focuses on the concept, evolution, and background of digital twin and the benefits and challenges involved in its implementation. The Scopus and Web of Science databases from 2016 to 2021 were considered for the bibliometric analysis and used to study and analyze the articles that fall within the research theme. For the systematic bibliometric analysis, a novel approach known as Proknow-C was employed, including a series of procedures for article selection and filtration from the existing databases to get the most appropriate articles aligned with the research theme. Additionally, the authors performed statistical and network analyses on the articles within the research theme to identify the most prominent research areas, journal/conference, and authors in the field of a digital twin. This study identifies the current scenarios, possible research gaps, challenges in implementing DT, case studies and future research goals within the research theme.", "venue": "Sustainability", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-09-10", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "96722727", "name": "Vivek Warke"}, {"authorId": "2117806165", "name": "Satish Kumar"}, {"authorId": "117600055", "name": "A. Bongale"}, {"authorId": "1794896", "name": "K. Kotecha"}], "citations": [{"paperId": "2a2be03dfd49d43ecfda842599687a86aa96d0c3", "title": "Methods for enabling real-time analysis in digital twins: A literature review"}, {"paperId": "656c3b732cca0597d3bb9949795a1de0d86655ac", "title": "Medium-Level Architectures for Digital Twins: Bridging Conceptual Reference Architectures to Practical Implementation in Cloud, Edge and Cloud–Edge Deployments"}, {"paperId": "012f2c984d3f70f74ddad1fc388c7e5574d128ea", "title": "Digital Twins and Industrial Internet of Things: Uncovering operational intelligence in industry 4.0"}, {"paperId": "6c605aafd5dc15bde8316aa4e9a45ed8f04440d4", "title": "Machining dynamics and chatters in micro-milling: A critical review on the state-of-the-art and future perspectives"}, {"paperId": "d69e98ca50929c5174bd7dbca3cf0fb8583096bb", "title": "Digital Twin: IoT resources metrics measurement using the server-based agent"}, {"paperId": "622f985c459be2700febeaff8ec0bf248bd03fd5", "title": "Design and Simulation of AI-Enabled Digital Twin Model for Smart Industry 4.0"}, {"paperId": "c35f8a3d214e749a6e8f54e522c41c11a3486632", "title": "Systematic Literature Review of Publications on Digital Twin Topics in Certain Research Areas"}, {"paperId": "8b3027de0bc7a17ccf986a6ad784fce7da4cb9a9", "title": "Towards a Domain-Neutral Platform for Sustainable Digital Twin Development"}, {"paperId": "c13ed4d39a0b0d1bbbb7400c84f9624a97d82b22", "title": "A Bibliometric Analysis of Digital Twin in the Supply Chain"}, {"paperId": "068dd386aef5c08c2bf872598495912215796adc", "title": "An Integrated Framework for Sustainable Development in Agri-Food SMEs"}, {"paperId": "b6d38d1915e036784794cad480b92d852543e6ea", "title": "The impact of digital twins on the evolution of intelligent manufacturing and Industry 4.0"}, {"paperId": "275ea94f0bf9263e1fe60c71ee4d0c3d919ff2cc", "title": "Influential Factors, Enablers, and Barriers to Adopting Smart Technology in Rural Regions: A Literature Review"}, {"paperId": "422caad4c216f8028edfbcec7a29e81bd22956c4", "title": "Metaverse for Digital Anti-Aging Healthcare: An Overview of Potential Use Cases Based on Artificial Intelligence, Blockchain, IoT Technologies, Its Challenges, and Future Directions"}, {"paperId": "323cce3ebaedf2e547418694f80e6d84b1a5a294", "title": "Digital Twin applications toward Industry 4.0: A Review"}, {"paperId": "62d4aa09f4b5d9fb3b4ba95fcd51afff4a3ed2b4", "title": "Research on the Interface of Sustainable Plant Factory Based on Digital Twin"}, {"paperId": "ff5d88aadc307b569b542b41b2221182ad4a017a", "title": "Research on consistency of digital twin test method and real vehicle site validation for intelligent vehicle"}, {"paperId": "ac2c8cfe91e92ff6f4670c6deabffb7d16fb73de", "title": "Digital Transformation and Its Influence on Sustainable Manufacturing and Business Practices"}, {"paperId": "eed687987e3c67b400cdf8c3bf9c5f7f0ac5f799", "title": "Intelligent Health Monitoring of Cable Network Structures Based on Fusion of Twin Simulation and Sensory Data"}, {"paperId": "201e899a1c60b3d55dc2a30b2097659885e799e3", "title": "Digital Twin in manufacturing. Part II. Case studies in removal and additive machining processes"}, {"paperId": "9a06964b5168500f2b1a3887a7b7e2d267117094", "title": "Digital twins and 3D information modeling in a smart city for traffic controlling: A review"}, {"paperId": "beeff2465ebde45b38bdba59e2b184fe9dc510db", "title": "Digital Twin: Benefits, use cases, challenges, and opportunities"}, {"paperId": "5586b3a44d5b4eb785e48159ae556097699091e4", "title": "Digital Twins: A Systematic Literature Review Based on Data Analysis and Topic Modeling"}, {"paperId": "fd3c839e197156687530c89774b466e057f35d7b", "title": "Review of Digital Twins for Constructed Facilities"}, {"paperId": "ba327f4daa856eb12a07fdcd474d4df625d0321f", "title": "A Digital Twin Case Study on Automotive Production Line"}, {"paperId": "83ef9f536d47a312eab3809b9167aaf2fa712e3d", "title": "How is extended reality bridging human and cyber-physical systems in the IoT-empowered logistics and supply chain management?"}, {"paperId": "e827a3d1cd6d8d6f831d853681065898cc57ecb0", "title": "Systematic Literature Review on The Usage of IoT in The Metaverse to Support The Education System"}, {"paperId": "5d99a9cda650196fad55f2d1b9309ed1f4e3b2ff", "title": "Digital Twin for Human–Robot Interactions by Means of Industry 4.0 Enabling Technologies"}, {"paperId": "806507082563666a20c3bf09492c666cd8e12c84", "title": "Towards Resilient and Sustainable Rail and Road Networks: A Systematic Literature Review on Digital Twins"}, {"paperId": "4216d248c86582a8860e027b922f4d106fa0a22c", "title": "Field Work’s Optimization for the Digital Capture of Large University Campuses, Combining Various Techniques of Massive Point Capture"}, {"paperId": "f0ff717cb436fe9ae33b686f0d81dacc47eac2d6", "title": "Drivers for Digital Twin Adoption in the Construction Industry: A Systematic Literature Review"}, {"paperId": "67e1e59fb0d8ef7a785193758db02e39f7251d88", "title": "Construction Theory for a Building Intelligent Operation and Maintenance System Based on Digital Twins and Machine Learning"}, {"paperId": "2abfa1bc89c4cb2b7866b090fb39587d6ae76db3", "title": "Digitalization Business Strategies in Energy Sector: Solving Problems with Uncertainty under Industry 4.0 Conditions"}, {"paperId": "4cddddbd1d0e95021392eed8ab18cb44035aab9a", "title": "Digital transformation and business intelligence for a SME: systems thinking action research using PrOH modelling"}, {"paperId": "b8f319fe3ae40aa5966ee5550d13c74b979f9b24", "title": "Exploring the revolution in healthcare systems through the applications of digital twin technology"}, {"paperId": "486781ad4b7a02b470898a1a04bd0c1870b71b7f", "title": "Experience of Creating Digital Twins as a Result of Monitoring the Health of Industrial Personnel"}]}
