{"paperId": "6de4e958606ff05d6293b6d40605ac6331e73b07", "publicationVenue": null, "title": "loT Home Medical Check-up System Application and Database Design", "abstract": "Recording the results of checking blood sugar, cholesterol and uric acid has not made a routine history every time you check, this is what makes us make an application in the Non-Invasive Home Medical Check-up tool, Non-Invasive Home Medical Check-up is a medical device made using non-invasive methods in checking blood sugar, uric acid, cholesterol, and body temperature. This tool uses MAX30105 sensors to check uric acid, blood glucose, and cholesterol levels, and MLX90614 to check body temperature. This application is connected to the device in real-time and there is a history check display to make it easier for users to review previous checks. Making applications using MIT APP INVENTOR and using the PostgreSQL database. To ensure that everything is as expected, testing is carried out to send and store data on the results of checking the device to the database and displayed in the application. Data transmission testing is done by determining the delay time of sending tools to the database using the internet network, and the average delay in the experiment is 0.0206 seconds. Integration testing is done by comparing the data in the database with the application by means of the user must enter the correct and appropriate ID.", "venue": "2022 6th International Conference on Information Technology, Information Systems and Electrical Engineering (ICITISEE)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference", "Review"], "publicationDate": "2022-12-13", "journal": {"name": "2022 6th International Conference on Information Technology, Information Systems and Electrical Engineering (ICITISEE)", "pages": "746-751"}, "authors": [{"authorId": "2211133466", "name": "Nadia Risitiani"}, {"authorId": "2285053401", "name": "th Helmy"}, {"authorId": "2285048517", "name": "Yusuf Darmawan"}, {"authorId": "2285048947", "name": "th Rika"}, {"authorId": "2285049229", "name": "Novita Wardhani"}, {"authorId": "2195041654", "name": "Nur Saida"}, {"authorId": "2195021388", "name": "Agung Sanubari"}, {"authorId": "2285048398", "name": "th Riandini"}, {"authorId": "2285049526", "name": "rd Rahmat"}, {"authorId": "2285053570", "name": "Noor Fauzi"}, {"authorId": "2285049212", "name": "th Prihatin Oktivasari"}], "citations": []}
