{"paperId": "6de63b89a82f92247c9205ca858fbdd507bf9f45", "publicationVenue": {"id": "eb4a4fda-0888-4ead-8fc4-e42b15ee7001", "name": "Ciencia Latina Revista Científica Multidisciplinar", "type": "journal", "alternate_names": ["Cienc Lat Rev Científica Multidiscip"], "issn": "2707-2207", "url": "http://ciencialatina.org/"}, "title": "Aplicación de un modelo estocástico para el Análisis RAM de Máquinas Rotatorias en la Industria 4.0", "abstract": "La aplicación de conceptos de la Industria 4.0 promovidas a través del mantenimiento predictivo de un activo industrial, marca la forma de la gestión operativa de una fábrica a largo plazo. El análisis de la data histórica de los activos brinda la oportunidad de aplicar técnicas como el modelamiento de datos, que definen el comportamiento de las máquinas a través del tiempo. Este paper presenta un análisis de confiabilidad, disponibilidad y mantenibilidad (RAM) de un grupo de ventiladores industriales que forman parte de un proceso de fabricación de clinker, desde una perspectiva que relaciona datos históricos de vibración con los estados que toman las máquinas, clasificados según el estándar ISO 14694. Para ello, se caracterizan series temporales por cada ventilador, y se obtienen métricas descriptivas, que habilitan la aplicación de un tipo de modelo autorregresivo integrado de media móvil, para predecir las condiciones que tomarán los equipos en los siguientes doce meses asociándolas al cálculo de los indicadores RAM, que definen la toma de decisiones en el marco operativo de la planta.", "venue": "Ciencia Latina Revista Científica Multidisciplinar", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-04-24", "journal": {"name": "Ciencia Latina Revista Científica Multidisciplinar"}, "authors": [{"authorId": "119964043", "name": "Tatiana Zambrano"}, {"authorId": "68982372", "name": "Ernesto Ponsot"}], "citations": []}
