{"paperId": "6df0ae78b225ee5d832eb7451a8616245fb23c65", "publicationVenue": {"id": "a00fde74-d8df-4613-b825-0fff9f531d3f", "name": "IEEE Transactions on Network and Service Management", "type": "journal", "alternate_names": ["IEEE Trans Netw Serv Manag"], "issn": "1932-4537", "url": "http://ejournals.ebsco.com/direct.asp?JournalID=714200", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4275028", "http://ieeexplore.ieee.org/servlet/opac?punumber=4275028"]}, "title": "Shed+: Optimal Dynamic Speculation to Meet Application Deadlines in Cloud", "abstract": "With the growing deadline-sensitivity of cloud applications, adherence to specific deadlines is becoming increasingly crucial, particularly in shared clusters. A few slow tasks called stragglers can potentially adversely affect job execution times. Equally, inadequate slotting of data analytics applications could result in inappropriate resource deployment, ultimately damaging system performance. Against this backdrop, one effective way of tackling stragglers is by making extra attempts (or clones)<xref ref-type=\"fn\" rid=\"fn1\"><sup>1</sup></xref> for every single straggler after the submission of a job. This paper proposes Shed<inline-formula> <tex-math notation=\"LaTeX\">$\\pmb {+}$ </tex-math></inline-formula>, which is an optimization framework utilizing dynamic speculation that aims to maximize the jobs’ PoCD (Probability of Completion before Deadline) by making full use of available resources. Notably, our work encompasses a new online scheduler that dynamically recomputes and reallocates resources during the course of a job’s execution. According to our findings, Shed<inline-formula> <tex-math notation=\"LaTeX\">$\\pmb {+}$ </tex-math></inline-formula> successfully leverages cloud resources and maximizes the percentage of jobs meeting their deadlines. In our experiments, we have seen this percentage for heavy load going up to 98% for Shed<inline-formula> <tex-math notation=\"LaTeX\">$\\pmb {+}$ </tex-math></inline-formula> as opposed to nearly 68%, 40%, 35% and 37% for Shed, Dolly, Hopper and Hadoop with speculation enabled, respectively.<fn id=\"fn1\"><label><sup>1</sup></label><p>Cloning or extra attempts means task duplication.</p></fn>", "venue": "IEEE Transactions on Network and Service Management", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-04-08", "journal": {"name": "IEEE Transactions on Network and Service Management", "pages": "1515-1526", "volume": "17"}, "authors": [{"authorId": "2282397", "name": "Sultan Alamro"}, {"authorId": "2829045", "name": "Maotong Xu"}, {"authorId": "143928529", "name": "Tian Lan"}, {"authorId": "80942368", "name": "S. Subramaniam"}], "citations": [{"paperId": "6d8fc6210dac2f7762cc8d15011e0ecd654df692", "title": "Meddal: meeting deadlines and data locality via bin packing in cloud environment"}, {"paperId": "61cb0123a3e66a79fa69f69e84e11d6ac993bc79", "title": "Forseti: Dynamic chunk-level reshaping for data processing on heterogeneous clusters"}, {"paperId": "aa78cb21326083bdf33fcfbb54f6ad0c7ce808b3", "title": "Multi Resource Scheduling with Task Cloning in Heterogeneous Clusters"}, {"paperId": "747090b30fb3ff44b3dc5231a37ad2937d416f64", "title": "On the choice of the best chunk size for the speculative execution of loops"}, {"paperId": "914b30e0e38fe1f25d1b2ed5792c56070408b681", "title": "Straggler identification approach in large data processing frameworks using ensembled gradient boosting in smart-cities cloud services"}]}
