{"paperId": "6df270f51eda3666d86bd3a7ac23f5e0b94b6c74", "publicationVenue": null, "title": "A disaster relief commodity supply chain network considering emergency relief volunteers: a case study", "abstract": "PurposeThe number of natural and man-made disasters is remarkable and threatened human lives at the time of occurrence and also after that. Therefore, an efficient response following a disaster can eliminate or mitigate the adverse effects. This paper aims to help address those challenges related to humanitarian logistics by considering disaster network design under uncertainty and the management of emergency relief volunteers simultaneously.Design/methodology/approachIn this paper, a robust fuzzy stochastic programming model is proposed for designing a relief commodity supply chain network in a disaster by considering emergency relief volunteers. To demonstrate the practicality of the proposed model, a case study is presented for the 22 districts of Tehran and solved by an exact method.FindingsThe results indicate that there are many parameters affecting the design of a relief commodity supply chain network in a disaster, and also many parameters should be controlled so that, the catastrophe is largely prevented and the lives of many people can be saved by sending the relief commodity on time.Practical implicationsThis model helps decision-makers and authorities to explore optimal location and allocation decisions without using complex optimization algorithms.Originality/valueTo the best of the authors’ knowledge, employee workforce management models have not received adequate attention despite their role in relief and recovery efforts. Hence, the proposed model focuses on the problem of managing employees and designing a disaster logistics network simultaneously. The robust fuzzy stochastic programming method is applied for the first time for controlling the uncertainties in the design of humanitarian relief supply chains.", "venue": "", "year": 2021, "fieldsOfStudy": ["Business"], "publicationTypes": null, "publicationDate": "2021-04-09", "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "2087566646", "name": "Omid Kebriyaii"}, {"authorId": "2100444196", "name": "Marzieh Hamzehei"}, {"authorId": "3210907", "name": "M. Khalilzadeh"}], "citations": [{"paperId": "1c670e9b0efc751aa5bea47f994712217b1c7794", "title": "Designing an Agile, flexible and resilient disaster supply chain network using a hybrid group decision-making robust optimization framework"}, {"paperId": "ec38cb89bebcec55c4554ae3024ebadeb529ef31", "title": "Determinants of health volunteer training in natural hazard management in Iran"}, {"paperId": "ad15945fb5f39de0d64edab5f83ceefd9977dfd0", "title": "Understanding public service supply chain management: a systematic literature review"}, {"paperId": "4a43f171ddeb85c501ee89af8419385bd4a5ba3c", "title": "Resource Support for “Mobilization–Participation” in Public Health Emergencies Based on a Complex Network Evolutionary Game"}, {"paperId": "37ca97429296c39661876c3a8a90a488a64a4c60", "title": "Supply chain network design with financial considerations: A comprehensive review"}, {"paperId": "57b4cb444c3e5dc03616e88587e8334f4cbfcb2f", "title": "Logistic distribution in humanitarian supply chain management: a thematic literature review and future research"}, {"paperId": "ec99cb969a23d4f9515aa19a578291e6f4a9f287", "title": "Decentralized Distribution of Humanitarian Aid for Natural Disaster Relief"}, {"paperId": "be6e6d5478bd73f2e11bbce379d2ce44b4c03783", "title": "Guest editorial: The COVID-19 impact on humanitarian operations: lessons for future disrupting events"}, {"paperId": "2f668ae00ed7a83fcaab97f810fbe6205d817e9b", "title": "Design of Disaster Relief Logistics Network System by Combining Three Data Envelopment Analysis-based Methods"}, {"paperId": "dcfdc8af1066176687808657c4d2c1d88a28e1ba", "title": "Humanitarian actions of a cultural center during the Covid-19 pandemic: an analogy with supply chain business processes"}, {"paperId": "af34f803b0c32e57720137863a9e37ea086fadd7", "title": "A decision-making tool for the determination of the distribution center location in a humanitarian logistics network"}, {"paperId": "5f4411ccd268092c3a3f4652f85bbb3d66494a5b", "title": "An optimization approach for disaster relief network design under uncertainty and disruption with sustainability considerations"}]}
