{"paperId": "6dfd70a9de57a2fecddd22d03d359bded0c01718", "publicationVenue": {"id": "228761ec-c40a-479b-8309-9dcbe9851bcd", "name": "IEEE Internet of Things Journal", "type": "journal", "alternate_names": ["IEEE Internet Thing J"], "issn": "2327-4662", "url": "https://www.ieee.org/membership-catalog/productdetail/showProductDetailPage.html?product=PER288-ELE", "alternate_urls": ["https://ieeexplore.ieee.org/servlet/opac?punumber=6488907", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6488907", "http://ieee-iotj.org/#"]}, "title": "MPDM: A Multi-Paradigm Deployment Model for Large-Scale Edge-Cloud Intelligence", "abstract": "The development of cloud and edge computing has enabled the easy access of artificial intelligence (AI) services for massive heterogeneous and resource-constrained devices. Particularly, computation-intensive AI services can be orchestrated and deployed in the cloud or edge according to varying performance and cost requirements. Nonetheless, the improved accessibility of deep learning (DL) model variants and the evolving of computational intelligence paradigms pose great challenges for orchestrating large-scale DL inference services in the cloud-edge continuum. Focusing on cloud or edge-based deployment, existing work on multi-variant service orchestration often has a limited solution space of deployment plans. To address this limitation, we first propose a novel multi-paradigm deployment model (MPDM) for service orchestration, which not only considers the model variants but also allows the co-existence of multiple paradigms for large-scale inference service deployment. The service deployment in the MPDM model is then formulated as a multiobjective optimization problem of seeking a better tradeoff among the system accuracy, service scale, and deployment cost. To solve the multiobjective optimization, we further propose a weighted metric-based constructive heuristic algorithm (WCH), which can efficiently obtain an approximately optimal Pareto frontier. Extensive experimental results have validated the effectiveness and efficiency of WCH, and revealed the impacts of both multi-paradigm deployment and edge-cloud collaborative intelligence (ECCI) paradigm on large-scale DL serving systems.", "venue": "IEEE Internet of Things Journal", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-15", "journal": {"name": "IEEE Internet of Things Journal", "pages": "8773-8785", "volume": "10"}, "authors": [{"authorId": "2153517132", "name": "Luhui Wang"}, {"authorId": "2235386", "name": "Xuebin Ren"}, {"authorId": "143955103", "name": "Cong Zhao"}, {"authorId": "2152340005", "name": "Fangyuan Zhao"}, {"authorId": "35829779", "name": "Shusen Yang"}], "citations": []}
