{"paperId": "6e00283d19c6e9a393030cbf6132cd3a002f376d", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Characterization of the Fracture Network and Its Spatial Variability in Complex Faulted Zones: Implication in Landslide Susceptibility Analysis", "abstract": "In the frame of a regional study that is aimed at defining the landslide susceptibility in the upper Susa Valley (Western Italian Alps), this paper investigated the variation in the fracture network of rock masses in correspondence to faults zones. Fracture networks were characterized at sites located along transects that are oriented normally to fault traces and scattered in their adjacent sectors with the scope to be able to define and estimate the variation in fracture abundance in the bedrock. Fracture collection using a traditional geomechanical survey was combined with topological analysis to estimate the degree of fracturing of rock masses in terms of fracture intensity (P21) and connectivity. Several sites were selected, and the variation in fracturing intensity values and degree of connectivity allowed for the defining of “high fracturing zones” (HFZ) near fault traces moving from the background values of adjacent rock masses. Considering the variation in fracture intensity, a range of 400 m to 150 m HFZ can be defined, with considerable differences between the areas analysed. The values recorded show a high irregular variability in fracture intensity in correspondence to the mapped faults due to the interference and overlay of structures related to the complexity setting of the fault damage zone.", "venue": "Applied Sciences", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-11-29", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "2089810123", "name": "Davide Vianello"}, {"authorId": "35159670", "name": "S. Bonetto"}, {"authorId": "2269626963", "name": "Pietro Mosca"}], "citations": []}
