{"paperId": "6e0d1241ddcdab44a0528a2c8ec48d920a2c24b3", "publicationVenue": {"id": "da1ee6f4-c965-42d6-8b0b-a4cb9294f05d", "name": "Agronomy", "type": "journal", "issn": "2073-4395", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217994", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217994", "https://www.mdpi.com/journal/agronomy"]}, "title": "Integrated-Smart Agriculture: Contexts and Assumptions for a Broader Concept", "abstract": "The innovative technologies developed in the different fields of science (nanotechnology, artificial intelligence, genetic modification, etc.) opened new and infinite possibilities for the several stakeholders that carry out their activities in the different economic sectors. For agriculture, these new approaches are particularly relevant and may bring interesting contributions, considering the specificities of the sector, often dealing with contexts of land abandonment and narrow profit margins. Nonetheless, the question in these unstopped evolutions is about the interlinkages with sustainability. In this context, the objectives of this study are to highlight the main insights from the available scientific literature about the interrelationships between the new trends in the agriculture and the sustainability. To achieve these aims, a search on the Web of Science Core Collection (WoS) and Scopus databases was carried out, on 15 May 2021, for the topics ‘smart agriculture’ and ‘sustainability’. A total of 231 documents (102 from WoS and 129 from Scopus) were obtained, remaining 155 documents after removing the duplicated, which were surveyed through systematic review following the PRISMA (Preferred Reporting Items for Systematic Reviews and Meta-Analyses) approach. As main insights, the concerns of the researchers with the impacts on the sustainability from the transformations in the farming organization are highlighted. On the other hand, it was shown the relevance and the new opportunities, including in terms of food supply, arising from the precision agriculture, agricultural intelligence, vertical/urban farming, circular economy, internet of things, and crowdfarming. We suggest the new and wider concept of ‘integrated-smart agriculture’, better than ‘climate-smart agriculture’.", "venue": "Agronomy", "year": 2021, "fieldsOfStudy": ["Business"], "publicationTypes": ["Review"], "publicationDate": "2021-08-05", "journal": {"name": "Agronomy"}, "authors": [{"authorId": "35633842", "name": "V. Martinho"}, {"authorId": "143900097", "name": "R. Guiné"}], "citations": [{"paperId": "e94c0cb0f68cff05c552906a2d74345263f12b34", "title": "Integration of Technology in Agricultural Practices towards Agricultural Sustainability: A Case Study of Greece"}, {"paperId": "704787f95dcb6e2f02a6d02f8dfbd07c9c1cdd11", "title": "Evaluating the environmental impacts of smart vineyards through the Life Cycle Assessment."}, {"paperId": "3aa6b8c4ea959f4dbfe34a9a0cb5839b0a19550b", "title": "Bioenergy relations with agriculture, forestry and other land uses: Highlighting the specific contributions of artificial intelligence and co-citation networks"}, {"paperId": "5db62f25181f6352df7cd5f6a1e9692046183cc8", "title": "Project management and circular economy in agribusiness: A systematic literature review."}, {"paperId": "bef9c0fa9c2150e1a20baf0746e2cde2b5640b7d", "title": "CERNAS—Current Evolution and Research Novelty in Agricultural Sustainability"}, {"paperId": "f3fa3c947810ed1a645eaf49b068c7f8d0441627", "title": "A systematic review on the factors governing precision agriculture adoption among small-scale farmers"}, {"paperId": "38b9705d71d6705e48a5ab8f55c9b43760ef1eb3", "title": "Agroclimatic and Phytosanitary Events and Emerging Technologies for Their Identification in Avocado Crops: A Systematic Literature Review"}, {"paperId": "57cf001ce5026757f5b4087db3d78bf9876fcc80", "title": "Fertiliser cost prediction in European Union farms: Machine-learning approaches through artificial neural networks"}, {"paperId": "1e821aec01568304b9267b1c39eaafb7deed8519", "title": "Machine Learning and Food Security: Insights for Agricultural Spatial Planning in the Context of Agriculture 4.0"}, {"paperId": "90ac5676268c81c5b186d67105ad50934aa57509", "title": "Fault-Tolerant Topology of Agricultural Wireless Sensor Networks Based on a Double Price Function"}, {"paperId": "159ad8c7eb20fa055c36e1412abce46ed08123c3", "title": "Bibliographic Coupling Links: Alternative Approaches to Carrying Out Systematic Reviews about Renewable and Sustainable Energy"}, {"paperId": "1e9ab76c2f341e9e435a1c223296da2db4b1c890", "title": "Virtex-II Pro FPGA Based Smart Agricultural System"}, {"paperId": "4a779dc11e4ee562791e8c400f2f3d10cd865ae3", "title": "Efficiency of the European Union farm types: Scenarios with and without the 2013 CAP measures"}, {"paperId": "03d4f66bd3a272e60442a11824089de9ab706739", "title": "Digital Agriculture: Mapping Knowledge Structure and Trends"}]}
