{"paperId": "6e15d3b2bb626e39a784e86e631362807525b5b8", "publicationVenue": {"id": "91d4ecad-d022-4953-901e-c5c57c614f72", "name": "Asia-Pacific Computer Systems Architecture Conference", "type": "conference", "alternate_names": ["ACSAC", "Asia-pacific Comput Syst Archit Conf", "Annu Comput Secur Appl Conf", "Annual Computer Security Applications Conference"], "url": "http://www.wikicfp.com/cfp/program?id=46", "alternate_urls": ["http://www.acsac.org/"]}, "title": "Log2Policy: An Approach to Generate Fine-Grained Access Control Rules for Microservices from Scratch", "abstract": "Microservice application architecture is one of the most widely used service architectures in the industry. To prevent a compromised microservice from abusing other microservices, authorization policy is applied to regulate the access among them. However, configuring access control policy manually is challenging due to the complexity and dynamic nature of microservice applications. In this paper, we present Log2Policy, a novel approach to generate microservice authorization policy based on access logs. Our approach consists of three fundamental techniques: (1) a log-based topological graph generation mechanism that automatically infers the invocation logic among microservices, (2) a machine learning based attributes mining method that extracts the relevant attributes of requests, and (3) a policy upgrade mechanism based on traffic management that can significantly reduce the upgrade time. We have implemented a prototype of Log2Policy on mainstream microservice infrastructures and have evaluated it with several microservice applications. The results show that Log2Policy can generate fine-grained and effective access control rules and upgrade them with negligible overhead.", "venue": "Asia-Pacific Computer Systems Architecture Conference", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2023-12-04", "journal": {"name": "Proceedings of the 39th Annual Computer Security Applications Conference"}, "authors": [{"authorId": "2269118318", "name": "Shaowen Xu"}, {"authorId": "2269049176", "name": "Qihang Zhou"}, {"authorId": "2269125708", "name": "Heqing Huang"}, {"authorId": "2269128076", "name": "Xiaoqi Jia"}, {"authorId": "9085105", "name": "Haichao Du"}, {"authorId": "2269138681", "name": "Yang Chen"}, {"authorId": "2269125893", "name": "Yamin Xie"}], "citations": []}
