{"paperId": "6e2620711444e0cdd29b4d5a7542a447ab3a2966", "publicationVenue": null, "title": "SISTEMAS PARA ALMACENAR GRANDES VOLÚMENES DE DATOS", "abstract": "RESUMEN ANALITICO La necesidad de almacenar y procesar grandes volumenes de datos ha dado origen al termino Big Data. Estos sistemas manejan informacion obtenida desde diversas fuentes y formatos, como es el caso de paginas web, redes sociales, el analisis del genoma humano, la fisica de particulas, entre otros. Estos almacenes de datos presentan dificultades que no pueden ser resueltas mediante el uso de sistemas de gestion de bases de datos tradicionales. El objetivo de este articulo es revisar el estado del arte en lo referente a tecnicas para el almacenamiento de grandes cantidades de datos. Se comparan las caracteristicas de las bases de datos relacionales y los modelos NoSQL, que han captado la atencion durante los ultimos anos. Todos estos sistemas deben adoptar soluciones de compromiso para lograr caracteristicas criticas tales como: escalabilidad, fiabilidad, durabilidad, tiempo de respuesta, interfaz de consulta, estructura de los datos almacenados (o carencia de la misma) y esquemas de particionamiento de datos. Se presenta una revision de las tecnicas mas representativas y de como cada una de ellas permite manejar las caracteristicas indicadas previamente. Para concluir se presenta un analisis de las ventajas y limitaciones de los modelos estudiados. Asi mismo, se identifican algunos de los problemas que son objeto de investigacion activa en el area. PALABRAS CLAVES: NoSQL, Almacenamiento Clave-Valor, Almacenes de documentos, Almacenamiento por columna, bases de datos de Grafos, SMBD, Bodegas de datos. BIG DATA STORES ANALYTICAL SUMMARY The need to store and process very large databases has given origin to the term “big data stores”. These are systems that handle information obtained from crawling the web, social networks, the analysis of the genome, particle physics, and many more. These data stores pose many challenging problems that cannot be handled by traditional database management systems. The goal of this survey is to explore the current state-of-the-art solutions to the problem of managing information stores of this scale. In this paper we compare the characteristics of relational databases against those of newly proposed NoSQL models. This latter has been the center of interest in recent years. All these systems exhibit different trade-offs around critical characteristics of the data store, such as scalability, reliability, durability, response time, query interface, structure (or the lack of) of the stored data, and data partitioning schemes. We present a review of the most representative techniques and how they handle each of these problems. We conclude by presenting and analysis of the different trade-offs and identifying some of the problems that are still active subject of research. KEYWORDS: NoSQL, Key Value Stores, Document Stores, Column Family Stores, Graph Databases, DBMS, Data-Warehouses. Forma de citar: Jaramillo Valbuena, S. & Londono, J. M. (2014). Sistemas para almacenar grandes volumenes de datos. En R, Llamosa Villalba (Ed.). Revista Gerencia Tecnologica Informatica, 13(37), 17-28. ISSN 1657-8236.", "venue": "", "year": 2015, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2015-03-20", "journal": {"name": "", "pages": "17-28", "volume": "13"}, "authors": [{"authorId": "98291431", "name": "S. Valbuena"}, {"authorId": "121922916", "name": "Jorge Londoño"}], "citations": [{"paperId": "b0f52270f94c485ce5332c50a99a7f3665c987c9", "title": "Monitorización de Sistemas con Tecnologías de Big Data"}, {"paperId": "c73d0e4b9497d21b8324989b4a1ee36603d3d1b8", "title": "Prototipo de Gestor de Medicación Utilizando Bases de Datos NoSQL"}, {"paperId": "254b94cc93355822ee8b920cb31e5d3bac9e47ae", "title": "Storage Scheme for Analysis of Academic Data and Interaction of Students With Virtual Education Platforms"}, {"paperId": "99482a3e52beb8fccedc1527aef989b204bbe89c", "title": "Big Data: an exploration of research, technologies and application cases"}, {"paperId": "d677fd7e1e7408a6444ef6ed25c8964530f72da7", "title": "MODELO PARA EL PROCESO DE EXTRACCIÓN, TRANSFORMACIÓN Y CARGA EN BODEGAS DE DATOS. UNA APLICACIÓN CON DATOS AMBIENTALES MODEL FOR THE EXTRACTION, TRANSFORMATION AND LOAD PROCESS IN DATA WAREHOUSES. AN APPLICATION WITH ENVIRONMENTAL DATA"}]}
