{"paperId": "6e34a053d7079051cb595a60a3e5dc99705793b2", "publicationVenue": null, "title": "Performance Evaluation of MongoDB, Cassandra, and HBase for Heterogenous IoT Data Storage", "abstract": "The Internet of Things produces very large data in a short time. The data generated by sensor nodes is very diverse, so it can be classified as structured or unstructured data. In this type of data, a database that is capable of handling a variety of data is very diverse. NoSQL is the solution to this data diversity problem. In this study explained the results of the comparison of selected NoSQL databases using MongoDB, Cassandra and HBase. Testing is done on IoT frameworks that have been built in previous studies. The results obtained are that in MongoDB structured data types are superior in run time performance and throughput values generated. Whereas for the Cassandra the unstructured data type has a better value in the run time and throughput metrics. But in terms of resource usage, MongoDB has the best performance in structured and unstructured data types.", "venue": "2019 2nd International Conference on Applied Information Technology and Innovation (ICAITI)", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2019-09-01", "journal": {"name": "2019 2nd International Conference on Applied Information Technology and Innovation (ICAITI)", "pages": "203-206"}, "authors": [{"authorId": "9744636", "name": "Eko Sakti Pramukantoro"}, {"authorId": "1491635832", "name": "Dany Primanita Kartikasari"}, {"authorId": "2059766749", "name": "Reza Siregar"}], "citations": [{"paperId": "1db04857e49b12fb0bc0d0d3c02e52d191b89ae4", "title": "Consistency issue and related trade-offs in distributed replicated systems and databases: a review"}, {"paperId": "b9d6d4bafaea3c0ccd88927356d0bec66600c559", "title": "Performance comparison of distributed in memory databases in dynamic fog environments"}, {"paperId": "0e9d3436bc26425c084f2c95bfe6fb8f25a1b095", "title": "Performance Comparison of Containerized HBase Clusters on Kubernetes"}, {"paperId": "67f39b74ae3e86d2893ad6b08f01bece01abf022", "title": "Evaluation of the response time of a geoservice using a hybrid and distributed database"}, {"paperId": "7ae4bb7a7bca9d0eed7c16c56822c35acc4191ef", "title": "Prototype of multi-layer personal cardiac monitoring system for data interoperability problem"}, {"paperId": "aa5191cf10db7b2cf293c336321cfce2410ae68b", "title": "Enhancing Decision-Making with Data Science in the Internet of Things Environments"}]}
