{"paperId": "6e53eb7d63cb2ee96b0256a7f9dc5ece3406bc18", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "An Adaptive Classification Model for Predicting Epileptic Seizures Using Cloud Computing Service Architecture", "abstract": "Data science techniques have increasing importance in medical data analysis, including detecting and predicting the probability of contracting a disease. A large amount of medical data is generated close to the patients in the form of a stream, such as data from sensors and medical devices. The distribution of these kinds of data may change from time to time; adaptive Machine Learning (ML) consists of a continuous training process responding to the distribution’s change. Adaptive ML models require high computational resources, which can be provided by cloud computing. In this work, a classification model is proposed to utilize the advantages of cloud computing, edge computing, and adaptive ML. It aims to precisely and efficiently classify EEG signal data, thereby detecting the seizures of epileptic patients using Adaptive Random Forest (ARF). It includes a global adaptive classifier in the cloud master node and a local light classifier in each edge node. In this model, the delayed labels consider missing values, and the Model-based imputation method is used to handle them in the global classifier. Implementing the proposed model on a real huge dataset (CHB-MIT) showed an accurate performance. It has a 0.998 True Negative Rate, a 0.785 True Positive Rate, and a 0.0017 False Positive Rate, which overcomes much of the research in the state-of-the-art.", "venue": "Applied Sciences", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-03-27", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "28948585", "name": "Hayder K. Fatlawi"}, {"authorId": "144936562", "name": "A. Kiss"}], "citations": [{"paperId": "9eac5d9416589925410b8b78456e3c10821cbb31", "title": "Landscape of Epilepsy Research: Analysis and Future Trajectory"}, {"paperId": "1b7658854bf3f23d1fa2291f2bc0f089cbeb491c", "title": "Removing artefacts and periodically retraining improve performance of neural network-based seizure prediction models"}, {"paperId": "058b287d629a5a2d30667fd23b0b809181573bc4", "title": "Similarity-Based Adaptive Window for Improving Classification of Epileptic Seizures with Imbalance EEG Data Stream"}, {"paperId": "fe0668b3dc5a6d7997e6802d1a480fce04be39d2", "title": "DiﬀNet: A Diﬀusion Convolutional Neural Network for Classiﬁcation of Epileptic Seizure"}]}
