{"paperId": "6e53924e5a5d84a553fad3b207bd3ec698071cf8", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Effects of COVID-19 on the Australian Economy: Insights into the Mobility and Unemployment Rates in Education and Tourism Sectors", "abstract": "Coronavirus Disease 2019 (COVID-19) has affected global economies due to lockdowns, business closures, and travel and other restrictions. To control the spread of the virus, several countries, including Australia, imposed strict border restrictions and lockdown measures. Accordingly, international borders have been closed, and all incoming international passengers are mandated to a 14-day hotel quarantine. Residents’ movements and businesses have been limited to essential services only. Employees have been directed to work from home while businesses moved to a remote working model. Due to such stringent measures, small and medium businesses such as cafes, restaurants, hotels, childcare centers, and tourism-based institutions incurred heavy losses, pushing a considerable portion of such small businesses to close. The airlines, education, tourism, and hospitality sector were the worst impacted among all. Due to such closures and associated effects of COVID-19, the unemployment rates are assumed to be significantly increased in countries like Australia. However, a study investigating this unemployment and reporting its status does not exist for Australia. Therefore, in this study, we investigated the effects of COVID-19 control measures such as travel restriction and lockdown on Australia’s employment status and labor markets. The data for the local transport network, unemployment rates and impacts on the tourism industry in Australia were extracted from the public data sources to assess the unemployment rates at both national and state-wide levels. Further, we also looked into the rehabilitation measures by the Australian government, such as the Job Keeper and Job Seeker programs in March 2020, that aim to provide support to people who are unable to run their businesses or have lost their jobs due to the pandemic. Overall, we observed that despite the global crisis, the Australian unemployment rate has reduced in the last year.", "venue": "Sustainability", "year": 2021, "fieldsOfStudy": ["Business"], "publicationTypes": null, "publicationDate": "2021-10-13", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "71940750", "name": "Hafiz Suliman Munawar"}, {"authorId": "2111181253", "name": "Sara Imran Khan"}, {"authorId": "48633912", "name": "Fahim Ullah"}, {"authorId": "3089801", "name": "A. Kouzani"}, {"authorId": "2065473783", "name": "M. P. Mahmud"}], "citations": [{"paperId": "a850505f587e8a5a12ef3f053c88bcc5d5931011", "title": "COVID-19 IMPACT ON LABOUR MARKET IN EU COUNTRIES – DIFFERENCES IN MEN AND WOMEN EMPLOYMENT RATE TENDENCIES"}, {"paperId": "27c85e0299964a7a7222768e171f5e641d5c5cdb", "title": "The economic impact of international travel measures used during the COVID-19 pandemic: a scoping review"}, {"paperId": "82af530ea81ec6654ba5e01f8192179028ef9108", "title": "Perfil de los usuarios del servicio del transporte de pasajeros: Taxis y Vehículos de Transporte con Conductor (VTC) en España tras la pandemia del COVID-19"}, {"paperId": "4b979c193732aff6e04761bc470ab355de9dc506", "title": "KOMPARASI KLASTER PENGANGGURAN TERBUKA DI INDONESIA SEBELUM DAN SAAT PANDEMI COVID-19 MENGGUNAKAN K-MEAN CLUSTERING"}, {"paperId": "388242c12a001146571b631b64728d91589d4a1f", "title": "Persistence in Australian tourism employment industries"}, {"paperId": "311edf6d95686f3519016727f0294f9083c2eacf", "title": "Spatiotemporal trends and impact of Covid-19 lockdown on eight sewage contaminants in brisbane, Australia, from 2012 to 2020."}, {"paperId": "f6084c5c06fe00578730b23fd64e19b5b46aa917", "title": "Impact of domestic tourism on economy under COVID-19: The perspective of tourism satellite accounts"}, {"paperId": "c791eba6e21acd8a3925651f4eaa95b69456b7cd", "title": "ANALYSIS OF THE ECONOMIC EFFICIENCY OF THE TOURISM MARKET OF KAZAKHSTAN IN THE POST-PANDEMIC PERIOD"}, {"paperId": "d3af0c621fbf631e72583555d6971917010eb83f", "title": "The Impacts of COVID-19 and Policies on Spatial and Temporal Distribution Characteristics of Traffic: Two Examples in Beijing"}, {"paperId": "66619375a03bb9751dc86e2ec2654de67e2a0b7c", "title": "Automatic Target Detection from Satellite Imagery Using Machine Learning"}, {"paperId": "50188173d1b50df800ed7da788b98493753a7864", "title": "Cloud- and Fog-Integrated Smart Grid Model for Efficient Resource Utilisation"}, {"paperId": "00aa9ecab8906642046c37df9f47b096fbfefbb3", "title": "Promoting Customer Loyalty and Satisfaction in Financial Institutions through Technology Integration: The Roles of Service Quality, Awareness, and Perceptions"}]}
