{"paperId": "6e6044684ba7a26eb913177953e71de312374eb7", "publicationVenue": {"id": "4b9f08bb-708d-454a-bc00-6d38eca03af4", "name": "ACM Transactions on Autonomous and Adaptive Systems", "type": "journal", "alternate_names": ["ACM Trans Auton Adapt Syst"], "issn": "1556-4665", "url": "http://www.acm.org/pubs/taas", "alternate_urls": ["http://dl.acm.org/citation.cfm?id=J1010&picked=prox", "http://portal.acm.org/taas/", "https://taas.acm.org/"]}, "title": "Hierarchical Auto-scaling Policies for Data Stream Processing on Heterogeneous Resources", "abstract": "Data Stream Processing (DSP) applications analyze data flows in near real-time by means of operators, which process and transform incoming data. Operators handle high data rates running parallel replicas across multiple processors and hosts. To guarantee consistent performance without wasting resources in the face of variable workloads, auto-scaling techniques have been studied to adapt operator parallelism at run-time. However, most of the effort has been spent under the assumption of homogeneous computing infrastructures, neglecting the complexity of modern environments. We consider the problem of deciding both how many operator replicas should be executed and which types of computing nodes should be acquired. We devise heterogeneity-aware policies by means of a two-layered hierarchy of controllers. While application-level components steer the adaptation process for whole applications, aiming to guarantee user-specified requirements, lower-layer components control auto-scaling of single operators. We tackle the fundamental challenge of performance and workload uncertainty, exploiting Bayesian optimization (BO) and reinforcement learning (RL) to devise policies. The evaluation shows that our approach is able to meet users’ requirements in terms of response time and adaptation overhead, while minimizing the cost due to resource usage, outperforming state-of-the-art baselines. We also demonstrate how partial model information is exploited to reduce training time for learning-based controllers.", "venue": "ACM Transactions on Autonomous and Adaptive Systems", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-16", "journal": {"name": "ACM Transactions on Autonomous and Adaptive Systems", "pages": "1 - 44", "volume": "18"}, "authors": [{"authorId": "2125194664", "name": "Gabriele Russo Russo"}, {"authorId": "1706698", "name": "V. Cardellini"}, {"authorId": "48682252", "name": "Francesco Lo Presti"}], "citations": [{"paperId": "6805612b3de3c5deae8d0f29ae6ee004cdfcd70c", "title": "A Survey on Design Methodologies for Accelerating Deep Learning on Heterogeneous Architectures"}]}
