{"paperId": "6e6e8b389fafd8dfd2456503c39cc0481ad7d57d", "publicationVenue": {"id": "3b4e0d11-3211-4ead-848c-99928b5ef30e", "name": "IEEE Network", "type": "journal", "alternate_names": ["IEEE Netw"], "issn": "0890-8044", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=65"}, "title": "A QoE-Driven Tactile Internet Architecture for Smart City", "abstract": "The Tactile Internet, described as a communication infrastructure combining low latency and high reliability, is considered as a leap compared with mobile Internet and Internet of things, and will thereby provide a revolution for almost every segment of society. When the Tactile Internet is introduced into smart city, it not only innovates existing communication and interaction, but also promotes the intelligent process of smart city and end-users' quality of experience (QoE) by taking advantage of haptic information and haptic-related applications. To fully integrate tactile technology with smart city, this article proposes a novel QoE-driven Tactile Internet architecture for smart city, containing five layers: sensing layer, transmission layer, storage layer, computing layer, and application layer. Importantly, the techniques supported in each layer of this architecture follow the requirements of low latency, high reliability, and high quality of user experience. Under this architecture, we devise a fast and reliable QoE management framework based on the broad learning system. Simulation results show that it can achieve high QoE performance under the premise of low computational complexity and high availability.", "venue": "IEEE Network", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-01-01", "journal": {"name": "IEEE Network", "pages": "130-136", "volume": "34"}, "authors": [{"authorId": "145505113", "name": "Xin Wei"}, {"authorId": "2055810805", "name": "Qi Duan"}, {"authorId": "2116539822", "name": "Liang Zhou"}], "citations": [{"paperId": "68a0de792a0e89bb485dab5fe2551ad28ada6f99", "title": "Cross-modal communication technology: A survey"}, {"paperId": "89d7b5835a52b140ef4eca4467e10ecd22791633", "title": "Towards Enabling Haptic Communications over 6G: Issues and Challenges"}, {"paperId": "d8dcf5eb6dd4b242dfedb4535bc66fcb682bc194", "title": "Tactile internet of federated things: Toward fine-grained design of FL-based architecture to meet TIoT demands"}, {"paperId": "a8da4146de624b391cb798a36c25f06783be0f21", "title": "Resource Allocation for OFDM-Based Status Update Systems: A Timeliness Perspective"}, {"paperId": "271c94287fcebab550c35925670dae7decc64c50", "title": "A Versatile Experimental Platform for Tactile Internet: Design Guidelines and Practical Implementation"}, {"paperId": "7de3045a7f096d84a6ba27902f6ac79154ae770c", "title": "A vision towards integrated 6G communication networks: Promising technologies, architecture, and use-cases"}, {"paperId": "0cd01b4fbd3137d175b5a0286d5dc73ef99898f1", "title": "Prediction Techniques on FPGA for Latency Reduction on Tactile Internet"}, {"paperId": "68382daf2ad1fe416770fdfd3eac179b4a575b99", "title": "A review on tactile IoT: Architecture, requirements, prospects, and future directions"}, {"paperId": "b611ce0521523fc359f17ba85588e602e9360497", "title": "5G-Enabled Tactile Internet Resource Provision via Software-Defined Optical Access Networks (SDOANs)"}, {"paperId": "71a7ba06ef16fa00d1e5638f4231957f2a90c1ef", "title": "Research Review for Broad Learning System: Algorithms, Theory, and Applications"}, {"paperId": "e6d30e44f04e7ce2825503901713d3b065afad0e", "title": "Resource Allocation for Tactile Internet via Software-Defined FiWi Access Network"}, {"paperId": "af4c01ae273d8447631f500aae44aa0d650a4854", "title": "A Comprehensive Survey of the Tactile Internet: State-of-the-Art and Research Directions"}, {"paperId": "b21fca1c7e86a9b9a4eb9592018536c4ea0cac1c", "title": "Broad Reinforcement Learning for Supporting Fast Autonomous IoT"}, {"paperId": "4f9dd32e2f4c3294a04199b7bdeac0fb5785df39", "title": "Internet of Things for Noise Mapping in Smart Cities: State of the Art and Future Directions"}, {"paperId": "2c3264e5b41e88d9ff45f0a32f876bd76fdb70fc", "title": "Secure Authentication and Key Agreement Protocol for Tactile Internet-based Tele-Surgery Ecosystem"}, {"paperId": "9872064564c9b6eacfe1d0c2f08c0072c3947e05", "title": "QoE-Driven Distributed Content Segments Sharing with Service Differentiation in D2D Network"}, {"paperId": "4bd26fe561886b99fee47569bf74dcbdb9903c51", "title": "5G-Enabled Tactile Internet for smart cities: vision, recent developments, and challenges"}, {"paperId": "ff4dc9922ed5620799f98138486d398c27baf0d1", "title": "The Construction and Communication of Guangzhou’s City Image: A Study of Fashion Image Communication from the Perspective of Semiotics"}, {"paperId": "401f69fb2367a2171148a225e5d9e8715f89bdeb", "title": "QoS Provisioning: Key Drivers and Enablers Toward the Tactile Internet in Beyond 5G Era"}, {"paperId": "b0ee7886b1c6f9b5bc8303604cb43794c2d4497b", "title": "QoS-Aware Multicast for Crowdsourced 360° Live Streaming in SDN Aided NG-EPON"}, {"paperId": "ca6692f6d0eb5cff850fbbfa6687c005eefc7ab0", "title": "Bilateral Teleoperation Performance Model for Network Resource Management"}, {"paperId": "6367626df45a6cc32ce59381333ed9f66ffeb8ea", "title": "Status and Development of Haptic Technology"}, {"paperId": "13205b2f0a28e69ababe3901412810c1f9949a4d", "title": "Remote Phobia Treatment as a Tactile Internet Application Case Study in Edge augmented with Mobile Ad Hoc Clouds Environment"}, {"paperId": "513e267a91ed6ee59a86a200a01f29feaad6c9b4", "title": "Architecture for Scalable, Self-*, human-centric, Intelligent, Secure, and Tactile next generation IoT ASSIST-IoT Technical Report #3 Tactile Internet in Internet of Things Ecosystems"}]}
