{"paperId": "6e7597530f564c05f30e0cd3f90c282bc7af6fb0", "publicationVenue": null, "title": "Enhancing Interpretability of Data-Driven Fault Detection and Diagnosis Methodology with Maintainability Rules in Smart Building Management", "abstract": "Data-driven fault detection and diagnosis (FDD) methods, referring to the newer generation of artificial intelligence (AI) empowered classification methods, such as data science analysis, big data, Internet of things (IoT), industry 4.0, etc., become increasingly important for facility management in the smart building design and smart city construction. While data-driven FDD methods nowadays outperform the majority of traditional FDD approaches, such as the physically based models and mathematically based models, in terms of both efficiency and accuracy, the interpretability of those methods does not grow significantly. Instead, according to the literature survey, the interpretability of the data-driven FDD methods becomes the main concern and creates barriers for those methods to be adopted in real-world industrial applications. In this study, we reviewed the existing data-driven FDD approaches for building mechanical & electrical engineering (M&E) services faults and discussed the interpretability of the modern data-driven FDD methods. Two data-driven FDD strategies integrating the expert reasoning of the faults were proposed. Lists of expert rules, knowledge of maintainability, international/local standards were concluded for various M&E services, including heating, ventilation air-conditioning (HVAC), plumbing, fire safety, electrical and elevator systems based on surveys of 110 buildings in Singapore. The surveyed results significantly enhance the interpretability of data-driven FDD methods for M&E services, potentially enhance the FDD performance in terms of accuracy and promote the data-driven FDD approaches to real-world facility management practices.", "venue": "J. Sensors", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-01-04", "journal": {"name": "J. Sensors", "pages": "5975816:1-5975816:48", "volume": "2022"}, "authors": [{"authorId": "50136601", "name": "M. Chew"}, {"authorId": "145829313", "name": "Ke Yan"}], "citations": [{"paperId": "7562ad1a3d16cccb9bd26663eefd969a9b1ffd24", "title": "An interpretable feature selection method integrating ensemble models for chiller fault diagnosis"}, {"paperId": "74685276a5cd92a5d88f4de7d300f356f12ed269", "title": "Potential of Advanced Technologies for Environmental Management Systems"}, {"paperId": "503c1fc42fe3b628567ebc9f94a75d83af54191c", "title": "A Type-2 Fuzzy-Based Explainable AI System for Predictive Maintenance Within the Water Pumping Industry"}, {"paperId": "92e7302cb1ab6281945aa5cdad27f7a6f5e57c2c", "title": "Potential Role and Challenges of ChatGPT and Similar Generative Artificial Intelligence in Architectural Engineering"}, {"paperId": "d9cdfefc7129334ec8d656712a16822d7ffaf6c9", "title": "Evaluation of success factors of utilizing AI in digital transformation of health and safety management systems in modern construction projects"}, {"paperId": "b8181a6dff050a5febf321d273f4adfcbc8c144e", "title": "Data-Driven Prediction Methods for Real-Time Indoor Fire Scenario Inferences"}, {"paperId": "4367d08800af2381aa2215adf5a2dc4161d04166", "title": "Optimization of Sensor Layout for Accurate Fire Localization Using LSTM Models"}, {"paperId": "2778812317b5bccf16c4eb3435d44c2355ef02f7", "title": "Data analysis and interpretable machine learning for HVAC predictive control: A case-study based implementation"}, {"paperId": "ffbdece49a61752bac4c45317d935c754838afa6", "title": "Application of Parity Relation in Elevator Fault Diagnosis"}, {"paperId": "87b54770122f2bd002113a8ee53b591a60d1b147", "title": "Data Rate Aware Reliable Transmission Mechanism in Wireless Sensor Networks using Bayesian Regularized Neural Network approach"}, {"paperId": "ea624af4c3a7d4f87735c846a7a87a07ffd0804c", "title": "Editorial: AI and IoT Applications of Smart Buildings and Smart Environment Design, Construction and Maintenance"}, {"paperId": "dd8b04d19fbc05ce77319406731e0cd736288a08", "title": "Analysis of Laboratory Data Management Based on LIMS System Technology"}, {"paperId": "8a696cb90d476c1ac4a70a69e4b807d2d82b4e03", "title": "Risk Assessment of Green Intelligent Building Based on Artificial Intelligence"}, {"paperId": "679a58d10d23d85ccebe5ead5af2884611f412ef", "title": "Predictive Maintenance 4.0 for Chilled Water System at Commercial Buildings: A Systematic Literature Review"}, {"paperId": "704de136362e7d64b55f947e3974d3452807b664", "title": "Analysis and System Design of Mechanical Fault Diagnosis Based on Deep Neural Network"}, {"paperId": "1826a4bd5cfb653e36cdb637ad21a745296bcccb", "title": "Imputing missing indoor air quality data with inverse mapping generative adversarial network"}, {"paperId": "dc23f65bcc4591fb7192e61e03f0fa3734de73f8", "title": "Air Quality Forecasting with Hybrid LSTM and Extended Stationary Wavelet Transform"}, {"paperId": "f45cbcd5b8823d3f292dfdc5cbf33a921855ecc3", "title": "MD-MARS: Maintainability Framework Based on Data Flow Prediction Using Multivariate Adaptive Regression Splines Algorithm in Wireless Sensor Network"}, {"paperId": "945f4f44ae375ed0458baf1fcc268ba210382f0f", "title": "Potential Role and Challenges of ChatGPT and Similar Generative Artificial Intelligence in Architectural Engineering"}]}
