{"paperId": "6e7519a12700efa0dfe482ca922a15b3ad8f09eb", "publicationVenue": {"id": "758df734-9f07-4673-955f-a9003ce1b998", "name": "Journal of Humanitarian Logistics and Supply Chain Management", "type": "journal", "alternate_names": ["J Humanit Logist Supply Chain Manag"], "issn": "2042-6747", "url": "https://www.emerald.com/insight/publication/issn/2042-6747", "alternate_urls": ["http://www.emeraldinsight.com/products/journals/journals.htm?id=jhlscm"]}, "title": "Transparency in humanitarian logistics and supply chain: the moderating role of digitalisation", "abstract": "PurposeMismanagement and corruption in disaster relief operations (DROs) have created a demand for transparency and visibility in humanitarian logistics and supply chains. The global relief organisations and recent research endorse the adoption of digital solutions in DROs. The purpose of this research is to examine the moderating role of digitalisation in enhancing transparency in humanitarian logistics and supply chains of DROs in Pakistan.Design/methodology/approachEmploying the quantitative research method, the data were collected from 340 disaster relief workers through survey questionnaires using the snowball sampling technique. The data were analysed in the SmartPLS3 software of PLS-SEM.FindingsThe findings suggested that in Pakistan, where corruption and mismanagement in humanitarian logistics and supply chain have been the greatest concerns of all the stakeholders, digitalisation of the DROs is a way forward to create transparency in the system and build the trust of the donor organisations and public.Research limitations/implicationsThe sample included only 340 disaster relief workers, future researchers may test the proposed model on a larger sample size and from different stakeholders' perspectives such as the disaster victims, government agencies and NGOs.Social implicationsThe ultimate beneficiaries of a digitalised and transparent humanitarian logistics and supply chain will be the society as a whole and particularly the victims of the disasters. By adopting the appropriate technologies in DROs, the victims will receive timely and entitled resources, and early warnings will save many lives.Originality/valueThe paper contributes to the body of knowledge by providing the first empirical evidence of examining the moderating role of digitalisation in creating transparency in humanitarian logistics from one of the top ten most disaster-affected nations.", "venue": "Journal of Humanitarian Logistics and Supply Chain Management", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-02-18", "journal": {"name": "Journal of Humanitarian Logistics and Supply Chain Management"}, "authors": [{"authorId": "46289999", "name": "T. Iqbal"}, {"authorId": "2109858467", "name": "Shabir Ahmad"}], "citations": [{"paperId": "3729571c229f1dcb03648638ccfd165259e14b50", "title": "Humanitarian Logistics and Emergency Response in Humanitarian Organizations in Kenya."}, {"paperId": "a70f22bee3d38f12758d15256d12aaecb7495f0e", "title": "Examining the white and dark sides of digitalisation effects on corruption: unveiling research patterns and insights for future research"}, {"paperId": "3ca0face6081ff46aca0de5b3843039909753cf0", "title": "Public Health and Health System’s Responsiveness During the 2022 Floods in Pakistan: What Needs to Be Done?"}, {"paperId": "de0965b8a2ffaafa411ea034565c4676d9d125bd", "title": "Humanitarian supply chain management in the digital age: a hybrid review using published literature and social media data"}, {"paperId": "5b7da8d5c9f79ce38de12be72d01ced7841a3162", "title": "Sustainable and transparent purchasing in the automotive industry"}, {"paperId": "02d5798d25c8cee27ae215c9c88962451d7a99f1", "title": "Designing a post-disaster humanitarian supply chain using machine learning and multi-criteria decision-making techniques"}, {"paperId": "cc745167dd884c8cce3339982f9787f27319c1e3", "title": "An integrated framework for digitalization of humanitarian supply chains in post COVID-19 era"}, {"paperId": "44d29cda3d34be6d19dd6f1b97ee5d00a1d4454f", "title": "Digital platforms in health care: evaluating workers' expectations and profiles during pandemic time"}, {"paperId": "b03ea668e7b6ef83dc216059bfe547594fae912b", "title": "A Model for Understanding the Mediating Association of Transparency between Emerging Technologies and Humanitarian Logistics Sustainability"}, {"paperId": "169e8ee26e9eac1d1ad1688cba8ec5bc7ba8640b", "title": "Digitalization for Fast, Fair, and Safe Humanitarian Logistics"}]}
