{"paperId": "6e7cf4462bcdce096684e08c4315593012089a53", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "6G Survey on Challenges, Requirements, Applications, Key Enabling Technologies, Use Cases, AI integration issues and Security aspects", "abstract": "The fifth-generation (5G) network is likely to bring in high data rates, more reliability, and low delays for mobile, personal and local area networks. Alongside the rapid growth of smart wireless sensing and communication technologies, data traffic has significantly risen, and existing 5G networks are not fully capable of supporting future massive data traffic in terms of services, storage, and processing. To meet the forthcoming challenges, the research community is investigating the Terahertz-based sixth-generation (6G) wireless network which is supposed to be offered for industrial usage in around 10 years. This is the right time to explore and learn about various 6G aspects that will play a key role in the successful execution and implementation of 6G networks in the future. This survey provides a review of specifications, requirements, applications, enabling technologies including disruptive and innovative, integration of 6G with advanced architectures and networks like software-defined networks (SDN), network functions virtualization (NFV), cloud/fog computing, etc, artificial intelligence (AI) oriented technologies, privacy and security issues and solutions, and potential futuristic use cases: virtual reality, smart healthcare and Industry 5.0. Furthermore, based on the conducted review, challenges and future research directions are highlighted to aid the deployment of 6G networks.", "venue": "arXiv.org", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-06-02", "journal": {"name": "ArXiv", "volume": "abs/2206.00868"}, "authors": [{"authorId": "1899890", "name": "M. Akbar"}, {"authorId": "145685787", "name": "Z. Hussain"}, {"authorId": "1713128", "name": "Quan Z. Sheng"}, {"authorId": "2074177760", "name": "Subhasis Mukhopadhyay"}], "citations": [{"paperId": "1435a8eb594698ebd6aa472006d9f7f339ced2a7", "title": "QoS-Aware Federated Crosschain-Based Model-Driven Reference Architecture for IIoT Sensor Networks in Distributed Manufacturing"}, {"paperId": "ec63049610ca590d02796e9350a597684ae64b28", "title": "Structured Approach to Web Security: Exploring Evolving Threats and Unresolved Research Challenges"}, {"paperId": "d1273e8e98d5cbbae47cc6e5f28bc0ac574d6f0b", "title": "Wi-Six: Precise Positioning in the Metaverse via Optimal Wi-Fi Router Deployment in 6G Networks"}, {"paperId": "1cf0c6fb134c62626790c6fa2f780759466d2591", "title": "IRS Assist Wireless communication: Scenarios, Advantages, Convergence"}, {"paperId": "91f8e70e810a8e47f9ac454018d0b23ba80bd5c8", "title": "The Similarities and Differences between Edge Computing and IOT"}, {"paperId": "c2530db59d00ffb2d5a1b548d6b024c53b2e2704", "title": "Cloud-Native Applications' Workload Placement over the Edge-Cloud Continuum"}]}
