{"paperId": "6e891e8c8f0a8375bf79ac79ba577899cb76bc49", "publicationVenue": {"id": "1620da87-4387-4b9a-9bf4-22fdf74d4dc3", "name": "Symmetry", "type": "journal", "issn": "2073-8994", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172134", "alternate_urls": ["https://www.mdpi.com/journal/symmetry", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172134"]}, "title": "A Normal Distributed Dwarf Mongoose Optimization Algorithm for Global Optimization and Data Clustering Applications", "abstract": "As data volumes have increased and difficulty in tackling vast and complicated problems has emerged, the need for innovative and intelligent solutions to handle these difficulties has become essential. Data clustering is a data mining approach that clusters a huge amount of data into a number of clusters; in other words, it finds symmetric and asymmetric objects. In this study, we developed a novel strategy that uses intelligent optimization algorithms to tackle a group of issues requiring sophisticated methods to solve. Three primary components are employed in the suggested technique, named GNDDMOA: Dwarf Mongoose Optimization Algorithm (DMOA), Generalized Normal Distribution (GNF), and Opposition-based Learning Strategy (OBL). These parts are used to organize the executions of the proposed method during the optimization process based on a unique transition mechanism to address the critical limitations of the original methods. Twenty-three test functions and eight data clustering tasks were utilized to evaluate the performance of the suggested method. The suggested method’s findings were compared to other well-known approaches. In all of the benchmark functions examined, the suggested GNDDMOA approach produced the best results. It performed very well in data clustering applications showing promising performance.", "venue": "Symmetry", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-05-17", "journal": {"name": "Symmetry", "pages": "1021", "volume": "14"}, "authors": [{"authorId": "9166190", "name": "Fahd M. Aldosari"}, {"authorId": "7833679", "name": "L. Abualigah"}, {"authorId": "2524054", "name": "Khaled H. Almotairi"}], "citations": [{"paperId": "106db0d2b1c56dd4acb48b79222f8a8c742a9cd3", "title": "BinDMO: a new Binary Dwarf Mongoose Optimization algorithm on based Z-shaped, U-shaped, and taper-shaped transfer functions for CEC-2017 benchmarks"}, {"paperId": "2e235698c53dc08c7be01533c5413cc2267341fd", "title": "Dwarf mongoose gannet optimization algorithm-enabled deep neuro-fuzzy network for detection of shockable ventricular cardiac arrhythmias"}, {"paperId": "a68668092ca51af19e4b138726aebb1b3325560c", "title": "Comprehensive analysis of classical and 2 DOF controllers for fuel cell powered nanogrids by Dwarf Mongoose algorithm"}, {"paperId": "9cd102b9cde6b03e7245b9469feed03c4ef94eca", "title": "Breast Cancer Classification Using Optimizer-based Feature Selection: A Metaheuristic Approach"}, {"paperId": "18c93a5ba8a4011d8502d279d126f78c74bf6368", "title": "Dwarf Mongoose Optimizer for Optimal Modeling of Solar PV Systems and Parameter Extraction"}, {"paperId": "96d0a8840465fcd03a7347e91d3ecb57b6fb759b", "title": "Improved dwarf mongoose optimization algorithm using novel nonlinear control and exploration strategies"}, {"paperId": "1251ebce94a0da0002481c3ac281b76395e4f51e", "title": "Cüce kuyruksüren optimizasyon algoritması: Çok seviyeli inverter çıkış geriliminin toplam harmonik distorsiyon değerinin azaltılması"}, {"paperId": "c34d2a0ec1dad67b006eeb3b742fb2e98cb8c1d2", "title": "Fuzzy Local Information C -Means based clustering and Fractional Dwarf Mongoose optimization enabled deep learning for relevant document retrieval"}, {"paperId": "7e2f64e1ce32dcc17b5a6abb7fb616c289c93754", "title": "Parameter estimation of nonlinear systems: dwarf mongoose optimization algorithm with key term separation principle"}, {"paperId": "923a6f08445072739754870d7198fad7f52acbf8", "title": "An Enhanced Dwarf Mongoose Optimization Algorithm for Solving Engineering Problems"}, {"paperId": "f2cd3fa491c8e3508a4d76aab6f7fe530caefc12", "title": "An efficient hybrid approach for optimization using simulated annealing and grasshopper algorithm for IoT applications"}, {"paperId": "113f3630711c6ba4e06b2242430147268d7947b1", "title": "Texture-driven super-resolution of ultrasound images using optimized deep learning model"}, {"paperId": "3e04482e165b7681f7e25918a9065c5427821e27", "title": "Intrusion detection system using combination of deep residual fuzzy network and white shark-dwarf mongoose optimization"}, {"paperId": "9f74d8fe38305a5f59c2010598cf0472505bd1f8", "title": "Classification Technique and its Combination with Clustering and Association Rule Mining in Educational Data Mining - A survey"}, {"paperId": "2fc9ae944df4f35ce883513ae2e5f63120d4417f", "title": "A multiple sensitive attributes data publishing method with guaranteed information utility"}, {"paperId": "039020d334226a5feb75dcf32dc5e10b3d3399eb", "title": "A novel swarm intelligence: cuckoo optimization algorithm (COA) and SailFish optimizer (SFO) in landslide susceptibility assessment"}, {"paperId": "12908bba0e7946e68014a56760e0fc7a20384a1f", "title": "Improved Dwarf Mongoose Optimization for Constrained Engineering Design Problems"}, {"paperId": "e2a1ab1cc6505d2fa12ccf78efb67799628a4afd", "title": "Feature Selection and Dwarf Mongoose Optimization Enabled Deep Learning for Heart Disease Detection"}, {"paperId": "8a3b693dc30a46ae79283f09ec4e1b7e0063ef71", "title": "Multilevel thresholding image segmentation using meta-heuristic optimization algorithms: comparative analysis, open challenges and new trends"}, {"paperId": "c8089b31dc20bdd8754ead8b0657ef18b78d5599", "title": "Dwarf Mongoose Optimization-Based Secure Clustering with Routing Technique in Internet of Drones"}, {"paperId": "40d78b784ac35589b14e5cbf61ea065cbe88b34c", "title": "Optimal Allocation of TCSC Devices in Transmission Power Systems by a Novel Adaptive Dwarf Mongoose Optimization"}, {"paperId": "224f70e319317f53c00d177e9cc2d90714afd5de", "title": "Multi-Task Learning for Electricity Price Forecasting and Resource Management in Cloud Based Industrial IoT Systems"}, {"paperId": "09ec8811dadbfef3c6a9353c29f96a8ac8b61cd7", "title": "Modified Dwarf Mongoose Optimization Enabled Energy Aware Clustering Scheme for Cognitive Radio Wireless Sensor Networks"}, {"paperId": "10eb0af1d9d1a16f60f8a91271126f930e4e1ed8", "title": "A multi-buffer congestion resolution scheme using prioritization and shortest path algorithms"}]}
