{"paperId": "6e89de0d309e59bddf72d725183f1fb7543e7ed7", "publicationVenue": {"id": "2dc4386c-f418-4a62-a2c3-6b89b06981be", "name": "Journal of Intelligent & Fuzzy Systems", "type": "journal", "alternate_names": ["Journal of Intelligent and Fuzzy Systems", "J Intell  Fuzzy Syst", "J Intell Fuzzy Syst"], "issn": "1064-1246", "url": "http://content.iospress.com/journals/journal-of-intelligent-and-fuzzy-systems/", "alternate_urls": ["http://www.iospress.nl/journal-of-intelligent-fuzzy-systems/", "https://www.iospress.nl/html/10641246.php"]}, "title": "Hybrid approach of baum-welch algorithm and SVM for sensor fault diagnosis in healthcare monitoring system", "abstract": "Internet of Things (IoT) based healthcare monitoring system is becoming the present and the future of the medical field around the world. Here the monitoring system acquires the regular health details of hospital discharged patients like elderly patients, patients out of critical operations, and patients from remote areas, etc., and transmits it to the doctors. But the system is highly susceptible to sensor faults. Hence a data-driven hybrid approach of Hidden Markov Model (HMM) based on baum-welch algorithm with Support Vector Machine (SVM) is proposed to predict the abnormality caused by the medical sensors. The proposed work first perform the abnormality detection on the sensor data using the HMM based on baum-welch algorithm in which the normal data is separated from abnormal data followed by classifying the abnormal data as critical patient data or sensor fault data using the SVM. Here the proposed work efficiently performs fault diagnosis with an overall accuracy of 99.94% which is 0.59% better than the existing SVM model. And also a comparison is made between the hybrid approach and the existing ML algorithms in terms of recall and F1-score where the proposed approach outperforms the other algorithms with a recall value of 100% and F1-score of 99.7%.", "venue": "Journal of Intelligent & Fuzzy Systems", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-02-05", "journal": {"name": "J. Intell. Fuzzy Syst.", "pages": "2979-2988", "volume": "42"}, "authors": [{"authorId": "2126654995", "name": "A. V. Anandhalekshmi"}, {"authorId": "2066760183", "name": "V. Rao"}, {"authorId": "2779867", "name": "G. Kanagachidambaresan"}], "citations": [{"paperId": "251f6bc41a7e661027dea871d90917475ec1596e", "title": "Wasserstein GAN-Based Digital Twin-Inspired Model for Early Drift Fault Detection in Wireless Sensor Networks"}, {"paperId": "a062719bf9c9e320d9613596bb4e55dd05166539", "title": "Identifying Abnormal Corporate Financial Data Based on the Comparison of SVM and Logistic Algorithms"}]}
