{"paperId": "6e95cfa13eb741067a4ecbad58463f283e873fbb", "publicationVenue": {"id": "9ec28b59-afd2-4d10-9a97-44d984123c30", "name": "IEEE International Conference on Information Reuse and Integration", "type": "conference", "alternate_names": ["Information Reuse and Integration", "IRI", "IEEE Int Conf Inf Reuse Integr", "Inf Reuse Integr"], "url": "https://ieeexplore.ieee.org/xpl/conhome/1001046/all-proceedings"}, "title": "Towards Interpretable Deep Extreme Multi-Label Learning", "abstract": "Many Machine Learning algorithms, such as deep neural networks, have long been criticized for being \"black-boxes\"-a kind of models unable to provide how it arrive at a decision without further efforts to interpret. This problem has raised concerns on model applications' trust, safety, nondiscrimination, and other ethical issues. In this paper, we discuss the machine learning interpretability of a real-world application, eXtreme Multi-label Learning (XML), which involves learning models from annotated data with many pre-defined labels. We propose a two-step XML approach that combines deep non-negative autoencoder with other multi-label classifiers to tackle different data applications with a large number of labels. Our experimental result shows that the proposed approach is able to cope with many-label problems as well as to provide interpretable label hierarchies and dependencies that helps us understand how the model recognizes the existences of objects in an image.", "venue": "IEEE International Conference on Information Reuse and Integration", "year": 2019, "fieldsOfStudy": ["Computer Science", "Mathematics"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-07-01", "journal": {"name": "2019 IEEE 20th International Conference on Information Reuse and Integration for Data Science (IRI)", "pages": "69-74"}, "authors": [{"authorId": "3426053", "name": "Yihuang Kang"}, {"authorId": "1944685333", "name": "I-Ling Cheng"}, {"authorId": "150338816", "name": "W. Mao"}, {"authorId": "150044188", "name": "Bowen Kuo"}, {"authorId": "2111214421", "name": "Pei-Ju Lee"}], "citations": []}
