{"paperId": "6e9bde55e852ccf6d131aab0484dfb78cd93ebe4", "publicationVenue": {"id": "1bbe62b5-6321-4644-a043-c05b37f8259f", "name": "International Journal of Computing and Digital Systems", "type": "journal", "alternate_names": ["Int J Comput Digit Syst"], "issn": "2210-142X", "url": "http://journals.uob.edu.bh/ijcds"}, "title": "Issues and Solution Techniques for IoT Security and Privacy - A Survey", "abstract": ": The Internet of Things (IoT) is a rapidly developing technology that enables the interconnection of physical objects in our day-to-day lives. It integrates various smart technologies such as smart agriculture, smart cities, smart homes, smart healthcare, smart grid, smart industry, and so on. Physical objects are embedded with network and wireless technologies to exchange information without human intervention. It allows improving the experience of customers by detecting problems in applications. The current IoT technology brings unparalleled opportunities, accessibility, and productivity to smart technology users, but it also causes security and privacy threats. Frequently, these issues are related to data leakage and service loss in applications. Unfortunately, many of the commercial IoT products are not supported by strong safekeeping contrivances on confidential information leakage and unauthorized activities. It requires a modified high authentication and recovery architecture to secure confidential data from attacks. Numerous research e ff orts have been increased to reduce these security risks, but many challenges have not yet been solved in current smart applications. In this paper, we appraise security and privacy challenges and solutions for IoT smart applications in detail. This technological era needs to concentrate more on security with enhanced approaches and many existing technologies to succeed against threats. The security and privacy concerns of IoT-based smart connected healthcare applications are addressed, and we designed a bio-inspired optimization trained model to overcome the challenges. We have determined the recent explorations of the smart application’s confidentiality and safety concerns through their controls theoretically. After the result of the analysis, we will focus more on the precarious issues with bio-inspired mechanisms", "venue": "International Journal of Computing and Digital Systems", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-10-31", "journal": {"name": "International Journal of Computing and Digital Systems"}, "authors": [{"authorId": "2180891235", "name": "Sripriyanka G"}, {"authorId": "145788376", "name": "Anish Mahendran"}], "citations": [{"paperId": "91f8e70e810a8e47f9ac454018d0b23ba80bd5c8", "title": "The Similarities and Differences between Edge Computing and IOT"}, {"paperId": "279b9d8d31480f65347e180504139da8bf31048a", "title": "Securing IoMT: A Hybrid Model for DDoS Attack Detection and COVID-19 Classification"}]}
