{"paperId": "6eb7ab884b3f4eef4272fcb5a40b7ef7b349baef", "publicationVenue": {"id": "c60f6e64-434b-4c82-931d-faefcb362d4c", "name": "IFIP International Information Security Conference", "type": "conference", "alternate_names": ["Symp Edge Comput", "Symposium on Edge Computing", "Inf Secur", "Information Security", "IFIP Int Inf Secur Conf", "SEC"], "url": "http://www.tc11.uni-frankfurt.de/", "alternate_urls": ["https://acm-ieee-sec.org"]}, "title": "Towards Performance Clarity of Edge Video Analytics", "abstract": "Edge video analytics is becoming the solution to many safety and management tasks. Its wide deployment, however, must first address the tension between inference accuracy and resource (compute/network) cost. This has led to the development of video analytics pipelines (VAPs), which reduce resource cost by combining deep neural network compression and speedup techniques with video processing heuristics. Our measurement study, however, shows that today's methods for evaluating VAPs are incomplete, often producing premature conclusions or ambiguous results. This is because each VAP's performance varies largely across videos and time, and is sensitive to different subsets of video content characteristics. We argue that accurate VAP evaluation must first characterize the complex interaction between VAPs and video characteristics, which we refer to as VAP performance clarity. Following this concept, we design and implement Yoda, the first VAP benchmark to achieve performance clarity. Using primitive-based profiling and a carefully curated bench-mark video set, Yoda builds a performance clarity profile for each VAP to precisely define its accuracy vs. cost trade-off and its relationship with video characteristics. We show that Yoda substantially improves VAP evaluations by (1) providing a comprehensive, transparent assessment of VAP performance and its dependencies on video characteristics; (2) explicitly identifying fine-grained VAP behaviors that were previously hidden by large performance variance; and (3) revealing strengths/weaknesses among different VAPs and new design opportunities.", "venue": "IFIP International Information Security Conference", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-05-18", "journal": {"name": "2021 IEEE/ACM Symposium on Edge Computing (SEC)", "pages": "148-164"}, "authors": [{"authorId": "3359577", "name": "Zhujun Xiao"}, {"authorId": "2072880961", "name": "Zhengxu Xia"}, {"authorId": "2704852", "name": "Haitao Zheng"}, {"authorId": "145970007", "name": "Ben Y. Zhao"}, {"authorId": "1727978", "name": "Junchen Jiang"}], "citations": [{"paperId": "676734b425348ea6eb0d9c8a1e1339eb2e28472a", "title": "Performance Evaluation of CNN-based Object Detectors on Embedded Devices"}, {"paperId": "3312c14404fa4f038364efba78665ffa851f7ea5", "title": "OneAdapt: Fast Adaptation for Deep Learning Applications via Backpropagation"}, {"paperId": "d3c58f1742830c94999d5800eea8a162b591b618", "title": "A comparative analysis of proactive and reactive methods for privacy-aware interleaved DNN offloading"}, {"paperId": "82cd161e7adbb8d7ad581e91751e6aa36b148c35", "title": "Data Fusion for Cross-Domain Real-Time Object Detection on the Edge"}, {"paperId": "9c196709ee1e628edee548afaa43822a365dff0b", "title": "Edge-Assisted Adaptive Configuration for Serverless-Based Video Analytics"}, {"paperId": "646449514de44d419e434303131b076bc1352d18", "title": "Blind Video Quality Assessment at the Edge"}, {"paperId": "5a90a8f4ec612cef6b1bb9cf4eae897385d33c2d", "title": "An Overview on Generative AI at Scale With Edge–Cloud Computing"}, {"paperId": "a04413a9a049090e61998a7e42ffd1a9683faa20", "title": "Owl: A Pre-and Post-processing Framework for Video Analytics in Low-light Surroundings"}, {"paperId": "e2106bf720a92150ce71156251dcddd341da36f5", "title": "Federated Learning Aided Deep Convolutional Neural Network Solution for Smart Traffic Management"}, {"paperId": "0e6ae0ef7ed0d53ca3b775f275e4e3837733d4b2", "title": "Nimbus: Towards Latency-Energy Efficient Task Offloading for AR Services"}, {"paperId": "7421820b8f677fcaafa6a40b9d2cd840e25cb8ac", "title": "SoC-Cluster as an Edge Server: an Application-driven Measurement Study"}, {"paperId": "64eab93d4b8554f280a4c1a84ea27b9255092923", "title": "Preva: Protecting Inference Privacy through Policy-based Video-frame Transformation"}, {"paperId": "d202d2936b7495b1c493d94a744f3f4653f6f447", "title": "Edge Video Analytics: A Survey on Applications, Systems and Enabling Techniques"}, {"paperId": "0fb6ea33656838fac812fe60569b1cce4636685a", "title": "Collaborative Video Analytics on Distributed Edges with Multiagent Deep Reinforcement Learning"}, {"paperId": "52635c56951b90362d6b96a08444a67d6f29f918", "title": "Performance Evaluation of Edge Computing-Aided IoT Augmented Reality Systems"}, {"paperId": "5746c7face092107cca8350f975a11e9ae71fd54", "title": "Turbo: Opportunistic Enhancement for Edge Video Analytics"}, {"paperId": "c4a582c2eed15773f1a5476b4458bf9902903a03", "title": "Dynamic DNN model selection and inference off loading for video analytics with edge-cloud collaboration"}, {"paperId": "7b07d2c0284f9c584900b37c8c2fb386a6a83d6b", "title": "SmartEye: An Open Source Framework for Real-Time Video Analytics with Edge-Cloud Collaboration"}, {"paperId": "3d8090add11821d51c124e35cd907ac76307b79d", "title": "Opportunities, Applications, and Challenges of Edge-AI Enabled Video Analytics in Smart Cities: A Systematic Review"}, {"paperId": "d327189f0960d10e50c289d94ff245bad9d1f5e9", "title": "AdaPyramid: Adaptive Pyramid for Accelerating High-resolution Object Detection on Edge Devices"}, {"paperId": "85106fc0a68a575166f0f18456fa755b7a2660a3", "title": "Deep Learning-Driven Edge Video Analytics: A Survey"}, {"paperId": "b0a08f083476eeef5986e9745e3fc2779eb234a7", "title": "Known Knowns and Unknowns: Near-realtime Earth Observation Via Query Bifurcation in Serval"}, {"paperId": "f50cc126e232724aa223c32d3874aaee94683b09", "title": "EcoGen: Fusing Generative AI and Edge Intelligence for Sustainable Scalability"}]}
