{"paperId": "6edfe852ddd798e0aea50ef777ba5cce98fe677e", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Urban Computing for Sustainable Smart Cities: Recent Advances, Taxonomy, and Open Research Challenges", "abstract": "The recent proliferation of ubiquitous computing technologies has led to the emergence of urban computing that aims to provide intelligent services to inhabitants of smart cities. Urban computing deals with enormous amounts of data collected from sensors and other sources in a smart city. In this article, we investigated and highlighted the role of urban computing in sustainable smart cities. In addition, a taxonomy was conceived that categorized the existing studies based on urban data, approaches, applications, enabling technologies, and implications. In this context, recent developments were elucidated. To cope with the engendered challenges of smart cities, we outlined some crucial use cases of urban computing. Furthermore, prominent use cases of urban computing in sustainable smart cities (e.g., planning in smart cities, the environment in smart cities, energy consumption in smart cities, transportation in smart cities, government policy in smart cities, and business processes in smart cities) for smart urbanization were also elaborated. Finally, several research challenges (such as cognitive cybersecurity, air quality, the data sparsity problem, data movement, 5G technologies, scaling via the analysis and harvesting of energy, and knowledge versus privacy) and their possible solutions in a new perspective were discussed explicitly.", "venue": "Sustainability", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-02-21", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "145963904", "name": "I. A. T. Hashem"}, {"authorId": "8917234", "name": "Raja Sher Afgun Usmani"}, {"authorId": "2160927112", "name": "M. Almutairi"}, {"authorId": "2185539258", "name": "Ashraf Osman Ibrahim"}, {"authorId": "144401763", "name": "A. Zakari"}, {"authorId": "17309740", "name": "Faiz Alotaibi"}, {"authorId": "2107088", "name": "S. Alhashmi"}, {"authorId": "1721261", "name": "H. Chiroma"}], "citations": [{"paperId": "c3a5f5ab546fb5e67bb7b56959eaaa63f15ac9ea", "title": "Design and Evaluation of a Dryer System for IoT Hyperlocal Particulate Matter Monitoring Device"}, {"paperId": "f34bc7da3d586bafe31a09796582028ed0c691ab", "title": "Evolutionary Multi-Objective Feature Selection Algorithms on Multiple Smart Sustainable Community Indicator Datasets"}, {"paperId": "2277598cedadf1562f409a791eb4ae54a2721e37", "title": "Achieving Sustainable Smart Cities through Geospatial Data-Driven Approaches"}, {"paperId": "1481c2166b139864680ab8910adeacd45d4db7c2", "title": "Method of structural-parametric adaptation of \"smart city\" to digital economy"}, {"paperId": "36f14bedb13d98bade6198bc307ea79270f48746", "title": "Connecting Internet of Drones and Urban Computing: Methods, protocols and applications"}, {"paperId": "5fad9cb92f46baf742c096f413db83955d64648b", "title": "Adaptive Behavioral Dynamics in Public Open Spaces During the COVID-19 Pandemic: A Technological Perspective on Urban Resilience"}, {"paperId": "66fc6467aec08ebb6047a3429a5c9ff6a8cceb90", "title": "Current trends in AI and ML for cybersecurity: A state-of-the-art survey"}, {"paperId": "5b3e8e7e8e2746dc537b68317cef39c7fa1e713c", "title": "Smart City Information Systems: Research on Information Published for Citizens and Design of Effective Content in the Czech Republic"}, {"paperId": "cc6bd3e111eedd539fe6c1d55093b6b6b2b53eae", "title": "Method for Selecting the Vehicles That Can Enter a Street Network to Maintain the Speed on Links above a Speed Threshold"}, {"paperId": "f20597442402c2c162cff247d043fa596e516e07", "title": "E-Government 3.0: An AI Model to Use for Enhanced Local Democracies"}, {"paperId": "b473abe8514ca6cb6394bdd8e60b59bd48744d1a", "title": "Simulation-Based Engineering of Heterogeneous Collaborative Systems—A Novel Conceptual Framework"}, {"paperId": "9699a03967ac8bac5ae8227d164d4ab9823c87fb", "title": "Perceptions and Attitudes toward Risks of City Administration Employees in the Context of Smart City Management"}, {"paperId": "643c64f2e8e11065bfb137f4e27e6ee2b58117a9", "title": "Development of an Intelligent Service Delivery System to Increase Efficiency of Software Defined Networks"}]}
