{"paperId": "6ef1a660ec0df4be4d2ffb59be974b1895c75d52", "publicationVenue": {"id": "01301914-0f59-4c88-bcf4-5fd9614b8b8e", "name": "SIGPLAN symposium on New ideas, new paradigms, and reflections on programming and software", "type": "conference", "alternate_names": ["Onward!", "SIGPLAN symp New idea new paradig reflect program softw"]}, "title": "Programming with neural surrogates of programs", "abstract": "Surrogates, models that mimic the behavior of programs, form the basis of a variety of development workflows. We study three surrogate-based design patterns, evaluating each in case studies on a large-scale CPU simulator. With surrogate compilation, programmers develop a surrogate that mimics the behavior of a program to deploy to end-users in place of the original program. Surrogate compilation accelerates the CPU simulator under study by 1.6×. With surrogate adaptation, programmers develop a surrogate of a program then retrain that surrogate on a different task. Surrogate adaptation decreases the simulator’s error by up to 50%. With surrogate optimization, programmers develop a surrogate of a program, optimize input parameters of the surrogate, then plug the optimized input parameters back into the original program. Surrogate optimization finds simulation parameters that decrease the simulator’s error by 5% compared to the error induced by expert-set parameters. In this paper we formalize this taxonomy of surrogate-based design patterns. We further describe the programming methodology common to all three design patterns. Our work builds a foundation for the emerging class of workflows based on programming with surrogates of programs.", "venue": "SIGPLAN symposium on New ideas, new paradigms, and reflections on programming and software", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2021-10-17", "journal": {"name": "Proceedings of the 2021 ACM SIGPLAN International Symposium on New Ideas, New Paradigms, and Reflections on Programming and Software"}, "authors": [{"authorId": "26433838", "name": "Alex Renda"}, {"authorId": "2111239073", "name": "Yi Ding"}, {"authorId": "1701041", "name": "Michael Carbin"}], "citations": [{"paperId": "ab00d9c919fb0ad2739869f91a7280865f62a6f4", "title": "Turaco: Complexity-Guided Data Sampling for Training Neural Surrogates of Programs"}]}
