{"paperId": "6ef21d506786429e1db48ed1c17b69d2434786b5", "publicationVenue": {"id": "22466e99-8720-4629-9169-4469e385e4d8", "name": "IEEE International Conference on Emerging Technologies and Factory Automation", "type": "conference", "alternate_names": ["Emerg Technol Fact Autom", "IEEE Int Conf Emerg Technol Fact Autom", "ETFA", "Emerging Technologies and Factory Automation"], "url": "http://www.wikicfp.com/cfp/program?id=937"}, "title": "Enhancing Cyber Situational Awareness for Cyber-Physical Systems through Digital Twins", "abstract": "Operators of cyber-physical systems (CPSs) need to maintain awareness of the cyber situation in order to be able to adequately address potential issues in a timely manner. For instance, detecting early symptoms of cyber attacks may speed up the incident response process and mitigate consequences of attacks (e.g., business interruption, safety hazards). However, attaining a full understanding of the cyber situation may be challenging, given the complexity of CPSs and the ever-changing threat landscape. In particular, CPSs typically need to be continuously operational, may be sensitive to active scanning, and often provide only limited in-depth analysis capabilities. To address these challenges, we propose to utilize the concept of digital twins for enhancing cyber situational awareness. Digital twins, i.e., virtual replicas of systems, can run in parallel to their physical counterparts and allow deep inspection of their behavior without the risk of disrupting operational technology services. This paper reports our work in progress to develop a cyber situational awareness framework based on digital twins that provides a profound, holistic, and current view on the cyber situation that CPSs are in. More specifically, we present a prototype that provides real-time visualization features (i.e., system topology, program variables of devices) and enables a thorough, repeatable investigation process on a logic and network level. A brief explanation of technological use cases and outlook on future development efforts completes this work.", "venue": "IEEE International Conference on Emerging Technologies and Factory Automation", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-09-01", "journal": {"name": "2019 24th IEEE International Conference on Emerging Technologies and Factory Automation (ETFA)", "pages": "1222-1225"}, "authors": [{"authorId": "47307908", "name": "Matthias Eckhart"}, {"authorId": "1745968", "name": "Andreas Ekelhart"}, {"authorId": "1797267", "name": "E. Weippl"}], "citations": [{"paperId": "350dcb8ba01d6e51271199a50402795a2825a2bf", "title": "Digital Twins and Its Security Issues and Implications"}, {"paperId": "c8b65afb38721756e07bfe24b3fdc5665d331fef", "title": "Digital Twin-Enhanced Incident Response for Cyber-Physical Systems"}, {"paperId": "ff0c8b90f6958b3ae56eb34f3929c7138c57c3c2", "title": "Digital Twins in Industry 4.0 Cyber Security"}, {"paperId": "a1e94582aeb0b5645b7f3e632d25c782b5010350", "title": "Enhancing Chiller Plant Modelling Performance Through NARX-Based Feature Optimization"}, {"paperId": "b5191c3d85fb404bc023b37fa2f1cee3f20b11cd", "title": "The Strategy of Digital Twin Convergence Service based on Metavers"}, {"paperId": "12871bd36fd7f4f1b4ec3533851d466dba768d5d", "title": "Understanding Indicators of Compromise against Cyber-attacks in Industrial Control Systems: A Security Perspective"}, {"paperId": "c9d67cfe0e43bd9787303279d40f63a81e8849c3", "title": "Towards next generation digital twin in robotics: Trends, scopes, challenges, and future"}, {"paperId": "7ef6707960eae62bffa945ff998b7c7471da7358", "title": "Holistic Security and Safety for Factories of the Future"}, {"paperId": "420f0bddc606d97c9a25f84a9b6508d6e9a477cd", "title": "Enhancing and securing cyber‐physical systems and Industry 4.0 through digital twins: A critical review"}, {"paperId": "38e688ce765bfeea7ad83936f67865629c5e3955", "title": "Security Attacks and Solutions for Digital Twins"}, {"paperId": "30bccd4f2610b35707938abeea3a0d56e1adc7a3", "title": "Predicting Cyber-Attack using Cyber Situational Awareness: The Case of Independent Power Producers (IPPs)"}, {"paperId": "2ff1a0a99d902069fd3bb52ea6b5859a1adec309", "title": "Towards Situational Aware Cyber-Physical Systems: A Security-Enhancing Use Case of Blockchain-based Digital Twins"}, {"paperId": "559fe1dd3271ca6b5ffc17a031712abe54923c56", "title": "Digital Twins for Industrial Control Systems Security"}, {"paperId": "916675774d0d7d253c8ee091cbb21a5c92ec04f1", "title": "Blockchain for securing aerial communications: Potentials, solutions, and research directions"}, {"paperId": "4a7fee3b6f498e13b09f1c15e86efd222bfb2f48", "title": "Towards Trusted and Intelligent Cyber-Physical Systems: A Security-by-Design Approach"}, {"paperId": "fdac458600be9e9f18a12ad7708ab219fd5f94a4", "title": "Is Digital Twin Technology Supporting Safety Management? A Bibliometric and Systematic Review"}, {"paperId": "f53afbb7ca82de26be908332f65570f466183b3e", "title": "Interactive Digital Twins Framework for Asset Management Through Internet"}, {"paperId": "6d2588950d4759ce27a363f20070383560bbefc8", "title": "A Traffic Flow Adaptive Energy Saving Scheme for Smart Lighting Systems"}, {"paperId": "2868244ea5c31267795ac8cb116c510e62fd6a18", "title": "The Role of Digital Twins in Collaborative Cyber-Physical Systems"}, {"paperId": "47889cb2f27391e47a60561b332da826c9a0e4d5", "title": "Digital Twin for Cybersecurity Incident Prediction: A Multivocal Literature Review"}, {"paperId": "c3f4aafb1cc03b2cf83eeabad875c77b67e40dc1", "title": "Digital Twin in the IoT Context: A Survey on Technical Features, Scenarios, and Architectural Models"}, {"paperId": "0d587143581988c0c08b6ac835c57979a07b1ab1", "title": "Microgrid Digital Twins: Concepts, Applications, and Future Trends"}, {"paperId": "23e47e810e5895a66e3f8e671f0356e5869ff27d", "title": "Digital Twins for Cyber-Physical Systems Security (Dagstuhl Seminar 22171)"}, {"paperId": "7fac568778a395c9a4471682cca5ea4ffee220f2", "title": "Enhancing Industrial Control System Forensics Using Replication-Based Digital Twins"}, {"paperId": "a62c585820a62f7944cc43c8e307b9f76b4584ae", "title": "Data-Driven Correlation of Cyber and Physical Anomalies for Holistic System Health Monitoring"}, {"paperId": "daa73813d90e1fe4dc456c342172ec6f84d94d84", "title": "Technological Innovation for Life Improvement: 11th IFIP WG 5.5/SOCOLNET Advanced Doctoral Conference on Computing, Electrical and Industrial Systems, DoCEIS 2020, Costa de Caparica, Portugal, July 1–3, 2020, Proceedings"}, {"paperId": "e8488db78d7137c8d327c65e6d3d9e0636c8eba7", "title": "Capability Management in Resilient ICT Supply Chain Ecosystems"}, {"paperId": "75522e04f7e11321e0ceab380c4b8c6162e7fbf3", "title": "Systematic Literature Review: Digital Twins’ Role in Enhancing Security for Industry 4.0 Applications"}]}
