{"paperId": "6ef4db81231ebe835b0b37935dfddfc14e8ac971", "publicationVenue": null, "title": "Fog Big Data Analysis for IoT Sensor Application Using Fusion Deep Learning", "abstract": "The IoT sensor applications have grown in extreme numbers, generating a large amount of data, and it requires very effective data analysis procedures. However, the different IoT infrastructures and IoT sensor device layers possess protocol limitations in transmitting and receiving messages which generate obstacles in developing the smart IoT sensor applications. This difficulty prohibited existing IoT sensor implementations from adapting to other IoT sensor applications. In this article, we study and analyze how IoT sensor produces data for big data analytics, and it also highlights the existing challenges of intelligent solutions. IoT sensor applications required big data classification and analysis in a Fog computing (FC) environment using computation intelligence (CI). Our proposed Fog big data analysis model (FBDAM) and BPNN analysis model for IoT sensor application using fusion deep learning (FDL) pose new obstacles for potential machine-to-machine communication practices. We have applied our proposed FBDAM on the most significant Fog applications developed on smart city datasets (parking, transportation, security, and sensor IoT dataset) and got improving results. We compared different deep and machine learning algorithms (SVM, SVMG-RBF, BPNN, S3VM, and proposed FDL) on different smart city dataset IoT application environments.", "venue": "", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-10-20", "journal": {"name": "Mathematical Problems in Engineering", "volume": "2021"}, "authors": [{"authorId": "40642247", "name": "A. Rajawat"}, {"authorId": "2005805289", "name": "P. Bedi"}, {"authorId": "2067928143", "name": "S. Goyal"}, {"authorId": "51249928", "name": "Adel R. Alharbi"}, {"authorId": "2495310", "name": "Amer Aljaedi"}, {"authorId": "90965785", "name": "Sajjad Shaukat Jamal"}, {"authorId": "2125838", "name": "P. Shukla"}], "citations": [{"paperId": "60fde86d68b01913e2c39c77d63df76ae3b20329", "title": "Survey on Big Data and Cloud Computing: Storage Challenges and Open Issues"}, {"paperId": "d33523cc77707390a484b8768510a2e17920d582", "title": "Smart contracts attribute-based access control model for security & privacy of IoT system using blockchain and edge computing"}, {"paperId": "1d343451e76342ae4387f4f9c8ce12b421aeea95", "title": "Evaluation Method of Japanese Teaching Effect Based on Feature Offset Compensation"}, {"paperId": "5a20a640410c02a53c9afded75a395c328dadad7", "title": "A systematic literature review of machine learning applications in IoT"}, {"paperId": "51e27839b5b3b3bc69c3a83e77b165757df4169e", "title": "Cognitive Adaptive Systems for Industrial Internet of Things Using Reinforcement Algorithm"}, {"paperId": "88bbfe91e791a3c76ba5abfc410859a6e3f5729c", "title": "Experimental Analysis for Position Estimation using Trilateration and RSSI in Industry 4.0"}, {"paperId": "df04ec2ede961727eb7ab8fe3abe5c2aff9509ea", "title": "Medical Data Analytics and Wearable Devices"}, {"paperId": "0a4afc810e208c0a147798c9e9737c4185a796c0", "title": "Accuracy determination using deep learning technique in cloud-based IoT sensor environment"}, {"paperId": "0a0e47317f9100a8df566cd5b9b785908ad12758", "title": "Text-Based Emotion Recognition Using Deep Learning Approach"}, {"paperId": "e1931d27e1cd656c7b0212363fc0c832a95e375d", "title": "Secure Routing-Based Energy Optimization for IoT Application with Heterogeneous Wireless Sensor Networks"}, {"paperId": "b4f5d63ce7400ac71417ee4ee7d9f3762a8694b0", "title": "On the Internet of Things, Blockchain Technology for Supply Chain Management (IoT)"}, {"paperId": "4452e2b28d94eb8ccabc8dfc71f6f8fa55aaa9d3", "title": "Energy-Efficient Resource Allocation and Migration in Private Cloud Data Centre"}, {"paperId": "7375b6f3a11d6fddd3fd6ad869ca4326aa678e5e", "title": "Zika Virus Prediction Using AI-Driven Technology and Hybrid Optimization Algorithm in Healthcare"}, {"paperId": "e015ed55bb67caedaf12e4c7b1b437136bbc7d7a", "title": "Analysis of Time Series Data Generated From the Internet of Things Using Deep Learning Models"}]}
