{"paperId": "6f0c13db767455303c3571222dc9d25c9371ed7f", "publicationVenue": {"id": "07ba6a02-fa13-4c5f-b428-795730d75e53", "name": "Big Data", "type": "conference", "alternate_names": ["Int Conf Big Data", "International Conference on Big Data"], "issn": "2167-6461", "url": "http://www.liebertonline.com/", "alternate_urls": ["https://home.liebertpub.com/publications/big-data/611/overview"]}, "title": "Internet of Things Data Visualization for Business Intelligence.", "abstract": "This study contributes to the research on Internet of Things data visualization for business intelligence processes, an area of growing interest to scholars, by conducting a systematic review of the literature. A total of 237 articles published over the past 11 years were obtained and compared. This made it possible to identify the top contributing and most influential authors, countries, publishers, institutions, papers, and research findings, together with the challenges facing current research. Based on these results, this work provides a thorough insight into the field by proposing four research categories (Technology infrastructure, Case examples, Final-user experience, and Big Data tools), together with the development of these research streams over time and their future research directions.", "venue": "Big Data", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-02-08", "journal": {"name": "Big data"}, "authors": [{"authorId": "2153847922", "name": "Sima Attar-Khorasani"}, {"authorId": "1707107", "name": "R. Chalmeta"}], "citations": [{"paperId": "63305a46f95d7e4436f8ac76eb40ce14ffbe4f92", "title": "A Business Intelligence Tool Designed for Governing Sustainability"}, {"paperId": "11062e7f3d359b1087bee66eb83125139d491eae", "title": "Developing a business intelligence tool for sustainability management"}, {"paperId": "5209ee70bcd4a4183e197701c1fc05eeaf69dcba", "title": "A computer architecture based on disruptive information technologies for drug management in hospitals"}, {"paperId": "5d1352e0ebf9b8b8562de9fbe570f33a0ba72908", "title": "Visual Graph Analysis of Domestic and Foreign Data Asset Research Based on CiteSpace"}, {"paperId": "bc12381fccb27256a06deafbe195c9a6b5563eee", "title": "UXBIV: An Evaluation Framework for Business Intelligence Visualization"}]}
