{"paperId": "6f2803dddd28b5470e063e310b10c729dfe6c5b2", "publicationVenue": {"id": "5a0ed765-2ec1-4e3a-914c-bdf5ec4750be", "name": "النشرة المعلوماتیة فی الحاسبات والمعلومات", "type": "journal", "alternate_names": ["النشرة المعلوماتیة فی الحاسبات والمعلومات"], "issn": "2535-1397"}, "title": "A Comparative Study Of Artificial Intelligence Techniques For Categorization And Prediction Of Heart Diseases", "abstract": "—Heart failure (HF) is one of the most common diseases in recent years, and a large number of people die annually around the world from it. The heart is considered one of the most important organs in the human body, so it requires high accuracy when predicting the presence of heart disease or not, as an error in prediction may cause human death, so it requires a high-accuracy method in predicting HF. Artificial intelligence (AI) plays a large and important role in many fields today, especially in the medical field, as AI helps doctors obtain a quick and accurate diagnosis of the patient’s condition, which contributes to saving time during the diagnosis. It is important to predict HF using AI to help with rapid and accurate diagnosis and thus reduce the number of deaths from this disease. AI techniques increase the accuracy of predicting whether or not HF is present compared to traditional methods. Also, in rural areas where there are fewer physicians, it is very important to provide such technologies to aid in diagnosis. Many studies point to new AI-based HF prediction techniques. These technologies relied on different algorithms and datasets of different sizes and types. Each of these technologies has advantages and limitations. Therefore, this paper presents an illustrative study of the most advanced AI methods for HF prediction. This study also included a comparison between the different methods based on the most famous standards.", "venue": "النشرة المعلوماتیة فی الحاسبات والمعلومات", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-01-01", "journal": {"name": "النشرة المعلوماتية في الحاسبات والمعلومات"}, "authors": [{"authorId": "2281694834", "name": "عبدالله رضا رشوان"}, {"authorId": "2281687349", "name": "ليلى الفنجري"}, {"authorId": "2281689019", "name": "صفاء عزام"}], "citations": []}
