{"paperId": "6f2ac99259669ad6af0f93772b986086e0443f0e", "publicationVenue": null, "title": "Towards comparison of real time stream processing engines", "abstract": "The real time stream processing engines are developed for different specific use cases, which incorporates various domains such as, IOT, finance, advertisement, telecommunications, healthcare etc. These stream processing engines are based on distributed processing models, where unbounded data streams are processed. Semantics of data stream is determined after complete scanning of whole data sets, which becomes inconvenient in real time stream processing to process entire data stream at once. Windowing mechanisms are used for processing data stream in a predefine topology with fixed number of operations such as, join, aggregate, filter etc. In this paper, a comparative study is performed with existing stream processing engines. This comparison provides a direction for choosing an appropriate stream processing engine. A modified master-slave model for stream processing is discussed for reducing latency, improving scalability and fault tolerance.", "venue": "2019 IEEE Conference on Information and Communication Technology", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2019-12-01", "journal": {"name": "2019 IEEE Conference on Information and Communication Technology", "pages": "1-5"}, "authors": [{"authorId": "150077616", "name": "Devesh Kumar Lal"}, {"authorId": "1972639", "name": "U. Suman"}], "citations": [{"paperId": "047d86734c430bbf532b9fd516909add5b34facc", "title": "On combining system and machine learning performance tuning for distributed data stream applications"}, {"paperId": "a5fa95a83c101e28d98e80817054668f66823852", "title": "Soft real-time data processing solutions in measurement systems on example of small-scale GEM based x-ray spectrometer"}, {"paperId": "7ce40b93689ef84eba5810fb3bda62ea7565b5c3", "title": "Mining Social Media Data Streams for Sentimental Analysis"}, {"paperId": "86094d15efe2a1a3c2c7846b9834052a35ea5d6d", "title": "An elastic and traffic-aware scheduler for distributed data stream processing in heterogeneous clusters"}, {"paperId": "527a8a85c63e85a780153cc258f660ec767ced86", "title": "Research on Optimal Checkpointing-Interval for Flink Stream Processing Applications"}, {"paperId": "8982fb6313b961ad53c881159b2a1bfc3bff081c", "title": "Big Data Processing: Batch-based processing and stream-based processing"}]}
