{"paperId": "6f3d485b694390434dc3e00836982b125420d78b", "publicationVenue": {"id": "2853e695-605a-467a-850f-64119eb2c09b", "name": "Nature and Science of Sleep", "type": "journal", "alternate_names": ["Nat Sci Sleep"], "issn": "1179-1608", "url": "https://www.dovepress.com/nature-and-science-of-sleep-journal"}, "title": "Association Between Eating Habits and Risk of Obstructive Sleep Apnea: A Population-Based Study", "abstract": "Objective The effect of dietary factors on OSA remains unclear. This study was to investigate the association of obstructive sleep apnea (OSA) with individual and overall effects of eating habits among adult Chinese. Methods A total of 9733 participants were selected from the baseline survey of the Guangzhou Heart Study. OSA was ascertained by Berlin Questionnaire. Food consumption was collected using a food frequency questionnaire, and eating patterns were extracted by principal component analysis. Odds ratios (ORs) with 95% confidence intervals (95% CIs) were calculated by the logistic regression model. Results After adjustment for confounders, fried food intake with ≥1/week was associated with an increased risk of OSA (OR: 1.77, 95% CI: 1.37–2.27), while fruit consumption of ≥1/day was associated with a 26% reduced risk of OSA (OR: 0.74, 95% CI: 0.62–0.88). Three eating patterns were defined and labeled as pattern I, II, and III. Eating pattern III which had higher factor loadings of animal innards, fried food, salted food, carbonate, and non-carbonated beverages was associated with an increased risk of OSA (OR: 1.30, 95% CI: 1.09–1.55) when comparing the highest with the lowest tertile of pattern score, after adjusting for confounders; every 1-unit increment of pattern III score was associated with an increased risk of OSA (OR: 1.09, 95% CI: 1.04–1.14). Neither pattern I nor pattern II was observed to be associated with OSA risk. Conclusion A higher frequency intake of fruits was associated with a reduced OSA risk and a diet with higher levels of consumption of animal innards, fried food, salted food, carbonated beverages, and non-carbonated beverages may increase the risk of OSA.", "venue": "Nature and Science of Sleep", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-10-01", "journal": {"name": "Nature and Science of Sleep", "pages": "1783 - 1795", "volume": "13"}, "authors": [{"authorId": "2173294039", "name": "Yan Du"}, {"authorId": "2049461056", "name": "Xueru Duan"}, {"authorId": "38970455", "name": "Murui Zheng"}, {"authorId": "49260891", "name": "Wenjing Zhao"}, {"authorId": "2145754327", "name": "Jun Huang"}, {"authorId": "2049481348", "name": "Lixian Lao"}, {"authorId": "2133444328", "name": "Fan Weng"}, {"authorId": "2147316241", "name": "D. Lin"}, {"authorId": "2149232584", "name": "Zhenxiao Yang"}, {"authorId": "2144431474", "name": "Haiyi Li"}, {"authorId": "46522678", "name": "Xudong Liu"}, {"authorId": "2072971621", "name": "Hai Deng"}], "citations": [{"paperId": "845459e199d9ae23669ca564ce029091a8a3a751", "title": "Association of the combination of obstructive sleep apnea risk and sleep duration with ideal cardiovascular health metrics in patients undergoing hemodialysis"}, {"paperId": "8ddc8764ca6855dff4f3ac28f4240492bebb73fe", "title": "Differentiation of lipid profiles of hen eggs from different regions based on lipidomics combined with chemometrics"}, {"paperId": "4128612d68287e5f375ec18819804cd54cd51de1", "title": "Association between Obstructive Sleep Apnea and Chronic Kidney Disease According to Sex, Long Working Hours: The Korean National Health and Nutrition Examination Survey (2019–2020)"}, {"paperId": "54e19baea95a3b4e8ef8fab1715f4eb62c69d800", "title": "Assessment of biological rhythm disturbances and emotion recognition in individuals with or without obstructive sleep apnea syndrome: The role of eating patterns"}, {"paperId": "0d640295fbb33bf4b5de4744d819c6a021f0d539", "title": "Association of healthy lifestyles on the risk of hypertension, type 2 diabetes mellitus, and their comorbidity among subjects with dyslipidemia"}, {"paperId": "8868b1b8720319051139b91f68fdb6d36e4ef123", "title": "Effect of healthy lifestyle index and lifestyle patterns on the risk of mortality: A community-based cohort study"}, {"paperId": "961d63972d5deba502f758adbc7f9eb6f8363f76", "title": "Association of Habitual Physical Activity With the Risk of All-Cause Mortality Among Chinese Adults: A Prospective Cohort Study"}]}
