{"paperId": "6f3e13973ff8692af3cdb0c01465b9b9f1272e5a", "publicationVenue": null, "title": "Development and Validation of Assessment Tool Measuring Knowledge on Sustainable Development - Basis for Instructional Emphasis on Higher Education", "abstract": "The Sustainable Development Goals are universal and intrinsically global goals for all people. Thus, this study aimed to develop and validate an assessment tool measuring knowledge on sustainable development goals, and it seeks to evaluate the value of multiple-choice questions to build a strong question bank for future usage by validating the questions through item analysis and validation. The study follows a descriptive-quantitative approach utilizing two hundred (200) researcher-made questions validated by experts. Three-hundred twenty-three college students were selected using stratified sampling and participated in the study. The discrimination index, difficulty index, reliability index, and content validity are used to identify the appropriateness of items. Results of the study revealed that out of two hundred (200) items, one hundred twenty-five (125) items were retained, eight (8 ) items were rejected, and sixty-seven (67) were subject to revision following the reliability test. Thus, results showed a reliability index of 97.04% or .97, indicating that the items are standardized and suitable for assessment. After conducting the reliability test, the one hundred twenty-five (125) retained items underwent a content validity test through Lawshe’s method to enhance the construct validity of the developed instrument. It was determined that seventy-two (72) items were to be retained, for it had reached the acceptable level of 0.99. Hence, fifty-three (53) items were to be removed for it has CVR lower than 0.99, which is not acceptable for an item to be retained. Following the result, it is recommended that the seventy-two items (72) retained to be used to assess students’ knowledge of the 17 sustainable development goals. This study also inferred that future assessments should include questions with a medium degree of difficulty and a high ability to distinguish between different functions.", "venue": "Journal of Tertiary Education and Learning", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-10-28", "journal": {"name": "Journal of Tertiary Education and Learning"}, "authors": [{"authorId": "2262353338", "name": "Erica L Villamor"}, {"authorId": "2262361029", "name": "Eloisa M Gamayot"}, {"authorId": "2262357827", "name": "Nicagiana R Baldon"}, {"authorId": "2118767124", "name": "T. Diquito"}, {"authorId": "1686742915", "name": "C. Panerio"}], "citations": []}
