{"paperId": "6f574a7e1ab9e6d79eaded34b7d8f792e6b66727", "publicationVenue": null, "title": "Predictive model of overburden deformation: based on machine learning and distributed optical fiber sensing technology", "abstract": "\nPurpose\nThe purpose of this paper is to establish a strain prediction model of mining overburden deformation, to predict the strain in the subsequent mining stage. In this way, the mining area can be divided into zones with different degrees of risk, and the prevention measures can be taken for the areas predicted to have large deformation.\n\n\nDesign/methodology/approach\nA similar-material model was built by geological and mining conditions of Zhangzhuang Coal Mine. The evolution characteristics of overburden strain were studied by using the distributed optical fiber sensing (DOFS) technology and the predictive model about overburden deformation was established by applying machine learning. The modeling method of the predictive model based on the similar-material model test was summarized. Finally, this method was applied to engineering.\n\n\nFindings\nThe strain value predicted by the proposed model was compared with the actual measured value and the accuracy is as high as 97%, which proves that it is feasible to combine DOFS technology with machine learning and introduce it into overburden deformation prediction. When this method was applied to engineering, it also showed good performance.\n\n\nOriginality/value\nThis paper helps to promote the application of machine learning in the geosciences and mining engineering. It provides a new way to solve similar problems.\n", "venue": "", "year": 2020, "fieldsOfStudy": ["Geology"], "publicationTypes": null, "publicationDate": "2020-10-12", "journal": {"name": "Engineering Computations", "volume": ""}, "authors": [{"authorId": "2144381848", "name": "Wenyuan Liu"}, {"authorId": "2137495", "name": "C. Piao"}, {"authorId": "1741702836", "name": "Yazhou Zhou"}, {"authorId": "150961548", "name": "Chaoqi Zhao"}], "citations": [{"paperId": "30672e8bcb046460e643a6a433aaadb4c4fa6cc4", "title": "Study on deep learning methods for coal burst risk prediction based on mining-induced seismicity quantification"}, {"paperId": "98606d8050209ad44d971f76488587bf9545af91", "title": "Analysis of Overburden Deformation and Migration under Huge Thick Unconsolidated Layers Based on Multiple Approaches"}, {"paperId": "4a0d420c001a52b515eec86194b46b94bab985b8", "title": "Applicability Analysis of Strain Transfer Between Surface-Mounted Optical Fiber Sensing Component and Materials"}]}
