{"paperId": "6f6b974e2f701dbb8d1fb10c5bb4088049840c66", "publicationVenue": {"id": "29df4b17-9a16-4a4c-94a6-002f52e628b4", "name": "International Conference on Parallel Processing", "type": "conference", "alternate_names": ["ICPP", "Int Conf Parallel Process", "IEEE Int Conf Pulsed Power", "IEEE International Conference on Pulsed Power"], "url": "http://www.wikicfp.com/cfp/program?id=1447"}, "title": "Selective Coflow Completion for Time-sensitive Distributed Applications with Poco", "abstract": "Recently, the abstraction of coflow is introduced to capture the collective data transmission patterns among modern distributed data-parallel application. During processing, coflows generally act as barriers; accordingly, time-sensitive applications prefer their coflows to complete within deadlines and deadline-aware coflow scheduling becomes very crucial. Regarding these data-parallel applications, we notice that many of them, including large-scale query system, distributed iterative training, and erasure codes enabled storage, are able to tolerate loss-bounded incomplete inputs by design. This tolerance indeed brings a flexible design space for the schedule of their coflows: when getting overloaded, the network can trade coflow completeness for timeliness, and balance the completenesses of different coflows on demand. Unfortunately, existing coflow schedulers neglect this tolerance, resulting in inflexible and inefficient bandwidth allocations. In this paper, we explore this fundamental trade-off and design Poco, a POlicy-based COflow scheduler, to achieve customizable selective coflow completions for these emerging time-sensitive distributed applications. Internally, Poco employs a suite of novel designs along with admission controls to make flexible, work-conserving, and performance-guaranteed rate allocation to online coflow requests very efficiently. Extensive trace-based simulations indicate that Poco is highly flexible and achieves optimal coflow schedules respecting the requirements specified by applications.", "venue": "International Conference on Parallel Processing", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2020-08-08", "journal": {"name": "Proceedings of the 49th International Conference on Parallel Processing"}, "authors": [{"authorId": "2962874", "name": "Shouxi Luo"}, {"authorId": "145563833", "name": "P. Fan"}, {"authorId": "38092176", "name": "Huanlai Xing"}, {"authorId": "2484540", "name": "Hong-Fang Yu"}], "citations": [{"paperId": "dfe207d1941e585575d70e004d44699068ca425b", "title": "Meeting Coflow Deadlines in Data Center Networks With Policy-Based Selective Completion"}, {"paperId": "74cb59f7980fd298da53e46d95a4c2319be3bb07", "title": "Fast Parameter Synchronization for Distributed Learning with Selective Multicast"}, {"paperId": "a90674452de56ff680494dce2940f45caaa97f8a", "title": "Poster: Accelerate Cross-Device Federated Learning With Semi-Reliable Model Multicast Over The Air"}]}
