{"paperId": "6f6cded4205259d709e79bf9fbde57f009f6d310", "publicationVenue": {"id": "f32b7322-b69c-4e63-801d-8f50784ef778", "name": "Computational Intelligence and Neuroscience", "type": "journal", "alternate_names": ["Comput Intell Neurosci"], "issn": "1687-5265", "url": "https://www.hindawi.com/journals/cin/"}, "title": "Quantitative Diagnosis of TCM Syndrome Types Based on Adaptive Resonant Neural Network", "abstract": "Artificial intelligence has become one of the most rapidly developing disciplines in the application field of pattern recognition. In target recognition, sometimes, there are multiple identical or similar copies of the target to be recognized in the image, and it is difficult to classify and estimate by traditional methods. In this case, it is necessary to use the SOM network to separate multiple targets and use the multiple order parameters in the improved SNN to pair the target. The change of its thickness can intuitively reflect the abnormality of its tissue. Therefore, the choroidal thickness of the central fovea can be measured to study the relationship between the choroidal structure and BRVO and arteriosclerosis. The purpose of this study is to further study the correlation between branch retinal vein occlusion and arteriosclerosis by quantitatively measuring retinal vessel diameter and choroidal thickness, to analyze the correlation between different TCM syndrome types of nonischemic BRVO and retinal arteriosclerosis, and to provide theoretical basis for clinical nonischemic BRVO TCM syndrome types and traditional Chinese medicine treatment, so as to reflect its clinical application value. In order to solve the single fixed structure of traditional SNN and poor scalability, combined with the Kohonen layer structure in the self-organizing mapping network, an improved collaborative neural network model is proposed. This paper studies the network training method and operation convergence and analyzes the converged network and the pattern classification results obtained by the network. In order to solve the single fixed structure of traditional SNN and poor scalability, combined with the Kohonen layer structure in the self-organizing mapping network, an improved collaborative neural network model is proposed. The results of our proposed improved model on the MNIST dataset can achieve the same level of current state-of-the-art machine learning classifiers in recognition accuracy with a smaller network size and network complexity.", "venue": "Computational Intelligence and Neuroscience", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-06-24", "journal": {"name": "Computational Intelligence and Neuroscience", "volume": "2022"}, "authors": [{"authorId": "2140171090", "name": "Yue Zhao"}, {"authorId": "2115593785", "name": "Yuanding Huang"}], "citations": [{"paperId": "e4ea90a5833d841b4f0d63f6e6eaa586ceaf8161", "title": "Analysis of Artificial Intelligence in Traditional Chinese Medicine Diagnosis"}, {"paperId": "daa9f73bc157f1ceb2199f525fbbff91b53142a4", "title": "Machine learning in TCM with natural products and molecules: current status and future perspectives"}, {"paperId": "2616aba1ce8b83f8039f42d81bef821eddd94232", "title": "Progression of Selected Parameters of the Clinical Profile of Patients with Periodontitis Using Kohonen’s Self-Organizing Maps"}, {"paperId": "cc17edc6703754a87354b957250211a1b4d6f83c", "title": "Artiﬁcial Intelligence in Choroid Through Optical Coherence Tomography: A Comprehensive Review"}]}
