{"paperId": "6f796b0551803112604e8f8ddacec2affbbd8846", "publicationVenue": {"id": "64f6bc7f-a080-473b-8e71-044beeeadb13", "name": "IEEE Transactions on Antennas and Propagation", "type": "journal", "alternate_names": ["IEEE Trans Antenna Propag"], "issn": "0018-926X", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=8", "alternate_urls": ["https://ieeeaps.org/aps_trans/index.htm", "http://ieeexplore.ieee.org/servlet/opac?punumber=8234", "http://ieeexplore.ieee.org/xpl/aboutJournal.jsp?punumber=8", "https://ieeexplore.ieee.org/xpl/aboutJournal.jsp?punumber=8"]}, "title": "Deep Learning of Transferable MIMO Channel Modes for 6G V2X Communications", "abstract": "In the emerging high mobility vehicle-to-everything (V2X) communications using millimeter wave (mmWave) and sub-THz, multiple-input multiple-output (MIMO) channel estimation is an extremely challenging task. At mmWaves/sub-THz frequencies, MIMO channels exhibit few leading paths in the space-time (ST) domain (i.e., directions or arrival/departure and delays). Algebraic low-rank (LR) channel estimation exploits ST channel sparsity through the computation of position-dependent MIMO channel eigenmodes leveraging recurrent training vehicle passages in the coverage cell. LR requires vehicles’ geographical positions and tens to hundreds of training vehicles’ passages for each position, leading to significant complexity and control signaling overhead. Here, we design a deep-learning (DL)-based LR channel estimation method to infer MIMO channel eigenmodes in V2X urban settings, starting from a single least squares (LS) channel estimate and without needing vehicle’s position information. Numerical results show that the proposed method attains comparable mean squared error (mse) performance as the position-based LR. Moreover, we show that the proposed model can be trained on a reference scenario and be effectively transferred to urban contexts with different ST channel features, providing comparable mse performance without an explicit transfer learning procedure. This result eases the deployment in arbitrary dense urban scenarios.", "venue": "IEEE Transactions on Antennas and Propagation", "year": 2021, "fieldsOfStudy": ["Computer Science", "Engineering"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-08-31", "journal": {"name": "IEEE Transactions on Antennas and Propagation", "pages": "4127-4139", "volume": "70"}, "authors": [{"authorId": "31174907", "name": "Lorenzo Cazzella"}, {"authorId": "2402713", "name": "D. Tagliaferri"}, {"authorId": "7337292", "name": "Marouan Mizmizi"}, {"authorId": "30572588", "name": "Damiano Badini"}, {"authorId": "15972289", "name": "C. Mazzucco"}, {"authorId": "145927530", "name": "M. Matteucci"}, {"authorId": "1803908", "name": "U. Spagnolini"}], "citations": [{"paperId": "e2de2da8c63822b5134c2d5916af50a5ae48e88f", "title": "On the Latent Space of mmWave MIMO Channels for NLOS Identification in 5G-Advanced Systems"}, {"paperId": "d9d0be5d7a1472deae5eb9ff43622dc1bd5037b2", "title": "Ultrasonic-Aided Fast-Layered Alternating Iterative Tensor Channel Estimation for V2X Millimeter-Wave Massive MIMO Systems"}, {"paperId": "092e6043f81a3b1165b673acf6c66c93d5fd3740", "title": "Model-driven Deep Learning Based Channel Estimation for HPO-MIMO"}, {"paperId": "cc8e5c3f577fb2dce1fcdb4c8cd27127b3df4ffd", "title": "MIMO-Based Physical Layer Evaluation on IEEE 802.11bd"}]}
