{"paperId": "6f85c822c31f2266941da56242268d4f045915ae", "publicationVenue": {"id": "8727dd2a-11c1-4c54-92e6-a0c7338e4d4b", "name": "European Journal of Environment and Public Health", "type": "journal", "alternate_names": ["Eur J Environ Public Health"], "issn": "2542-4904", "alternate_issns": ["2468-1997"], "url": "https://www.lectitopublishing.nl/european-journal-of-environmentand-public-health", "alternate_urls": ["https://www.lectitopublishing.nl/european-journal-of-sustainable-development-research"]}, "title": "Socioeconomic impacts of COVID-19 pandemic on foodborne illnesses in the United States", "abstract": "Foodborne diseases continue to impact human health and the economy. The COVID-19 pandemic has dramatically affected the food system from production to consumption. This project aims to determine the impact of the COVID-19 pandemic on the spread of foodborne diseases and the factors that may have contributed, including environmental, behavioral, political, and socioeconomic. Data for this study were collected from The Foodborne Diseases Active Surveillance Network (FoodNet) for 2015-2020. FoodNet personnel located at state health departments regularly contact the clinical laboratories in Connecticut (CT), Georgia (GA), Maryland (MD), Minnesota (MN), New Mexico (NM), Oregon (OR), Tennessee (TN), and selected counties in California (CA), Colorado (CO), and New York (NY). Data were analyzed using SAS to determine the changes in rates of foodborne pathogens reported in FoodNet before and during the COVID-19 pandemic in the ten reporting states. Results of the study showed a significant decline in the incidences of foodborne diseases ranging between 25% and 60%. A geographical variation was also observed between California and states with the highest decline rate of foodborne illnesses. Policies and restrictions, in addition to environmental and behavioral changes during the COVID-19 pandemic, may have reduced rates of foodborne diseases.", "venue": "European Journal of Environment and Public Health", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-10-28", "journal": {"name": "European journal of environment and public health", "volume": "7"}, "authors": [{"authorId": "5848493", "name": "Luma Akil"}, {"authorId": "144141687", "name": "H. Ahmad"}], "citations": [{"paperId": "07979497179a19d8c589e3a0f3065af6ccd36b18", "title": "An integrated FoodNet in North East India: fostering one health approach to fortify public health"}, {"paperId": "c4711b76c0b95956cfbb260c4248b4d31a81cbad", "title": "Characteristics and related factors of waterborne and foodborne infectious disease outbreaks before and after the onset of the COVID-19 pandemic (2017–2021) in the Republic of Korea: a descriptive study"}, {"paperId": "48ce3992c81b891f7f7b2b58670485c922b8f813", "title": "No Cow? Understanding US Consumer Preferences for Plant-Based over Regular Milk-Based Products"}]}
