{"paperId": "6f8eab0de681233a10bc62222a7bd50ce5584e63", "publicationVenue": {"id": "cf8c86c7-392d-4134-8593-f6d5ecc65304", "name": "International Journal of Smartcare Home", "type": "journal", "alternate_names": ["Int J Smartcare Home"], "issn": "2653-1941"}, "title": "Research on Elastic Network Clustering Algorithm Based on Maximum Entropy", "abstract": "In the information age, humans need to dig out potential information from a very large amount of information, and cluster analysis is one of the important methods. Most clustering analysis algorithms lack universal applicability, and they often encounter local minima problems when processing data sets with complex and diverse data structures. Cluster analysis has a strong ability to process uncertain information and is very robust. Among them, the elastic network algorithm, which belongs to unsupervised learning, has good geometric properties and can be solved for a specific objective function, which fits well with the definition of the clustering problem. Therefore, this paper has researched based on elastic network algorithm and applied the network in the field of cluster analysis. This paper proposes an Elastic Net of Clustering based on Maximum entropy (ENCM). According to the definition of clustering, the objective function of the elastic network algorithm is changed, and the principle of maximum entropy is used to determine the probability distribution of the data set without prior knowledge. Under the framework of the elastic network, the physical system is simulated, deterministic annealing technology is used to raise and lower the temperature of the system, control the network activity, and use the steepest descent method to track the minimum value.", "venue": "International Journal of Smartcare Home", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-06-30", "journal": {"name": "International Journal of Smartcare Home"}, "authors": [{"authorId": "2285567056", "name": "Lu Liu"}], "citations": []}
