{"paperId": "6f8fca44cc81cdf4f8e2d157ef4c0cd712c6dafd", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Transformation towards Risk-Sensitive Urban Development: A Systematic Review of the Issues and Challenges", "abstract": "Risk-sensitive urban development is an innovative planning approach that can transform the way cities are built in order to face the uncertainties that arise from climate-induced disaster risks. However, the potential to initiate such a transformative approach has not materialized because of the many underlying issues that need to be understood properly. Therefore, this study conducted a systematic review to gather empirical evidence on the issues and challenges in implementing risk-sensitive urban development. The study identified forty-six issues and challenges under seven key themes that need addressing in order to facilitate the desirable transition: trade-offs, governance, fragmentation and silos, capacity, design and development, data, and funding. The issues and challenges that exist under trade-offs for negotiating solutions for risk-sensitive urban development and the governance of multiple stakeholders were identified as the top two areas that need attention in facilitating the desirable transition. This study also revealed that important information, such as scientific information, hazard and risk information, temporal and spatial information, and critical local details are not being produced and shared between stakeholders in decision-making. A profound participatory process that involves all the stakeholders in the decision-making process was identified as the pathway to ensure equitable outcomes in risk-sensitive urban development.", "venue": "Sustainability", "year": 2021, "fieldsOfStudy": ["Business"], "publicationTypes": ["Review"], "publicationDate": "2021-09-24", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "97541713", "name": "A. Roslan"}, {"authorId": "145591905", "name": "T. Fernando"}, {"authorId": "74826593", "name": "S. Biscaya"}, {"authorId": "81932865", "name": "N. Sulaiman"}], "citations": [{"paperId": "e53454f3654f7fca9f2062ff4ea35a5dd7dc1359", "title": "Inter-Organisational Collaboration Structures and Features to Facilitate Stakeholder Collaboration"}, {"paperId": "b33d46fdf4ef80cf76ca2e0a657697e3f95c3eb1", "title": "Urban Defense Index for City Branding: A Case Study of Five Cities in Kalimantan"}, {"paperId": "7cba6cee3ab50e8dafb09efb00274fa8d0b5b1a4", "title": "Multi-Hazard Based Land Use Planning in Isolated Area; Learning from the Experience of Pul-e-Khumri City, Afghanistan"}, {"paperId": "64422d55ea7d6a739b90f9ed880ea15d70cb1c16", "title": "A Catalyst Approach for Smart Ecological Urban Corridors at Disused Waterways"}, {"paperId": "806dc4ace8093d35be5097ff89a73abf399c6380", "title": "Reviewing Challenges of Flood Risk Management in Malaysia"}, {"paperId": "04a7bca9c7eeeedc62e1191b513154b5e625a43c", "title": "A state-of-the-art decision-support environment for risk-sensitive and pro-poor urban planning and design in Tomorrow's cities"}, {"paperId": "db1f38c0a45341ef8213e5eaa2c7644ef8e8a7b3", "title": "Exploring the Scope of Public Participation for Risk Sensitive Land Use Planning in Nepal: A Policy Review"}, {"paperId": "33144f373c9916ee817a316d94805f2b99eed5cf", "title": "State of the art in risk sensitive urban development: A systematic literature review."}, {"paperId": "98c75c5c3c7290b0a086403bc48e317cd6513cc4", "title": "Toward an Integrated Disaster Management Approach: How Artificial Intelligence Can Boost Disaster Management"}, {"paperId": "5d24546d227675c748093294d3ab9b3981211221", "title": "Transformational climate action at the city scale: comparative South–North perspectives"}]}
