{"paperId": "6f8f308d4ccbd531f8ffa280decaa5055ebc596e", "publicationVenue": {"id": "8e1bd4b5-d5b2-4e22-ba0a-01fe5568d472", "name": "Remote Sensing", "type": "journal", "alternate_names": ["Remote Sens"], "issn": "2315-4675", "alternate_issns": ["2072-4292"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169233", "alternate_urls": ["https://www.mdpi.com/journal/remotesensing", "http://www.mdpi.com/journal/remotesensing", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169233"]}, "title": "Efficiency Study of Combined UAS Photogrammetry and Terrestrial LiDAR in 3D Modeling for Maintenance and Management of Fill Dams", "abstract": "Low-cost unmanned aerial system (UAS) photogrammetry and terrestrial laser scanner (TLS, terrestrial LiDAR) technologies are being used as noncontact measurement methods for collecting unstructured data for the maintenance of construction infrastructure facilities. This study investigated the possibility of settlement, which is a maintenance condition evaluation item for fill-dam bodies, using point clouds based on the UAS (unmanned aerial system) structure from motion (UAS-SfM) and TLS (terrestrial laser scanner) point clouds. Specifically, the Z-axis RMSE of the point cloud improved to 0.012 m and the shape reproducibility rate to 98.53% by complementing the heterogeneous data of the UAS and TLS by combining the two systems with block coordination and ICP algorithms. The maximum settlement height and volume (heaving) of the dam crest and upstream and downstream slopes were derived from the combined UAS/TLS point-cloud-based 3D model. The quantitative values for the settlement of the fill-dam body were derived using the combined 3D model with high accuracy and density. This result verified the possibility of using the combined 3D model for evaluation of the maintenance condition.", "venue": "Remote Sensing", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-04-11", "journal": {"name": "Remote. Sens.", "pages": "2026", "volume": "15"}, "authors": [{"authorId": "2217470873", "name": "Joonoh Kang"}, {"authorId": "2164726480", "name": "Daljoo Kim"}, {"authorId": "2143579646", "name": "Chulhee Lee"}, {"authorId": "2130217220", "name": "Jaemo Kang"}, {"authorId": "2157218549", "name": "Donggyou Kim"}], "citations": [{"paperId": "fe3ec5af1f5d5629e946c72acae7dfe076e15b5a", "title": "Determining the trend of geometrical changes of a hydrotechnical object based on data in the form of LiDAR point clouds"}]}
