{"paperId": "6f9c0ff832e6e8b5c740d0ea0c49592d16138608", "publicationVenue": null, "title": "Knowledge Distillation in Federated Edge Learning: A Survey", "abstract": "The increasing demand for intelligent services and privacy protection of mobile and Internet of Things (IoT) devices motivates the wide application of Federated Edge Learning (FEL), in which devices collaboratively train on-device Machine Learning (ML) models without sharing their private data. Limited by device hardware, diverse user behaviors and network infrastructure, the algorithm design of FEL faces challenges related to resources, personalization and network environments. Fortunately, Knowledge Distillation (KD) has been leveraged as an important technique to tackle the above challenges in FEL. In this paper, we investigate the works that KD applies to FEL, discuss the limitations and open problems of existing KD-based FEL approaches, and provide guidance for their real deployment.", "venue": "", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2023-01-14", "journal": null, "authors": [{"authorId": "2146254894", "name": "Zhiyuan Wu"}, {"authorId": "2109354976", "name": "Sheng Sun"}, {"authorId": "119917160", "name": "Yuwei Wang"}, {"authorId": "2118169652", "name": "Min Liu"}, {"authorId": "2144282461", "name": "Xue Jiang"}, {"authorId": "2201493991", "name": "Runhan Li"}, {"authorId": "2199129359", "name": "Bo Gao"}], "citations": [{"paperId": "9f0095d9476ccd46fb43967ebe81362b80320186", "title": "Logits Poisoning Attack in Federated Distillation"}, {"paperId": "ea34780711d60c020422b727e897be2ab0399c0e", "title": "Not all Minorities are Equal: Empty-Class-Aware Distillation for Heterogeneous Federated Learning"}, {"paperId": "1d871ce98e8d572cc16aab38ba1c980ace5e3551", "title": "Federated Class-Incremental Learning with New-Class Augmented Self-Distillation"}, {"paperId": "60e346f717533ad5c794d3516eb14af8e9200531", "title": "Federated Skewed Label Learning with Logits Fusion"}, {"paperId": "3256f44bcb3fa778d95a457ab15b10e9d959a914", "title": "FedCache: A Knowledge Cache-driven Federated Learning Architecture for Personalized Edge Intelligence"}, {"paperId": "e3a1e74d77652ad5567db8451fd3575b0db8e06d", "title": "A Survey of What to Share in Federated Learning: Perspectives on Model Utility, Privacy Leakage, and Communication Efficiency"}, {"paperId": "5b01caa6e43fe733fbdd189b894226c64c3d6382", "title": "Exploring the Distributed Knowledge Congruence in Proxy-data-free Federated Distillation"}]}
