{"paperId": "6f9c013fd4ed16dd6f13721f36bda7be4b5fbd70", "publicationVenue": {"id": "764e3630-ddac-4c21-af4b-9d32ffef082e", "name": "IEEE International Conference on Data Engineering", "type": "conference", "alternate_names": ["ICDE", "Int Conf Data Eng", "IEEE Int Conf Data Eng", "International Conference on Data Engineering"], "url": "http://www.wikicfp.com/cfp/program?id=1331"}, "title": "Equi-Joins over Encrypted Data for Series of Queries", "abstract": "Encryption provides a method to protect data out-sourced to a DBMS provider, e.g., in the cloud. However, performing database operations over encrypted data requires specialized encryption schemes that carefully balance security and performance. In this paper, we present a new encryption scheme that can efficiently perform equi-joins over encrypted data using only software and a single server with better security than the state-of-the-art. In particular, our encryption scheme reduces the leakage to equality of rows that match a selection criterion and only reveals the transitive closure of the union of the leakages of each query in a series of queries. Our encryption scheme is provable secure. We implemented our encryption scheme and evaluated it over a dataset from the TPC- H benchmark.", "venue": "IEEE International Conference on Data Engineering", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-03-10", "journal": {"name": "2022 IEEE 38th International Conference on Data Engineering (ICDE)", "pages": "1635-1648"}, "authors": [{"authorId": "80124924", "name": "Masoumeh Shafieinejad"}, {"authorId": "2116012230", "name": "Suraj Gupta"}, {"authorId": "2108458088", "name": "J. Liu"}, {"authorId": "2293851", "name": "Koray Karabina"}, {"authorId": "1682949", "name": "F. Kerschbaum"}], "citations": [{"paperId": "cd5ff9aa8be1dde3d81d0120de4aef4b23bc702e", "title": "d-DSE: Distinct Dynamic Searchable Encryption Resisting Volume Leakage in Encrypted Databases"}, {"paperId": "c90f3cf32573c5fd12b87204ac76e2c3839966e5", "title": "An Algorithm for Persistent Homology Computation Using Homomorphic Encryption"}, {"paperId": "0fcca6ef6753dfe70af0622fa389fe5659abbd22", "title": "Reversible Database Watermarking Based on Order-preserving Encryption for Data Sharing"}, {"paperId": "2ed57c19abed86b98fa7d8329c47e4fb3d16821f", "title": "One Size Cannot Fit All: a Self-Adaptive Dispatcher for Skewed Hash Join in Shared-nothing RDBMSs"}, {"paperId": "5be9523f8b7cac784acffaa0a095babc602aea24", "title": "Secure and Practical Functional Dependency Discovery in Outsourced Databases"}]}
