{"paperId": "6fa83887681886a8235f51160b162397f33db2d2", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "An Aggregated Mutual Information Based Feature Selection with Machine Learning Methods for Enhancing IoT Botnet Attack Detection", "abstract": "Due to the wide availability and usage of connected devices in Internet of Things (IoT) networks, the number of attacks on these networks is continually increasing. A particularly serious and dangerous type of attack in the IoT environment is the botnet attack, where the attackers can control the IoT systems to generate enormous networks of “bot” devices for generating malicious activities. To detect this type of attack, several Intrusion Detection Systems (IDSs) have been proposed for IoT networks based on machine learning and deep learning methods. As the main characteristics of IoT systems include their limited battery power and processor capacity, maximizing the efficiency of intrusion detection systems for IoT networks is still a research challenge. It is important to provide efficient and effective methods that use lower computational time and have high detection rates. This paper proposes an aggregated mutual information-based feature selection approach with machine learning methods to enhance detection of IoT botnet attacks. In this study, the N-BaIoT benchmark dataset was used to detect botnet attack types using real traffic data gathered from nine commercial IoT devices. The dataset includes binary and multi-class classifications. The feature selection method incorporates Mutual Information (MI) technique, Principal Component Analysis (PCA) and ANOVA f-test at finely-granulated detection level to select the relevant features for improving the performance of IoT Botnet classifiers. In the classification step, several ensemble and individual classifiers were used, including Random Forest (RF), XGBoost (XGB), Gaussian Naïve Bayes (GNB), k-Nearest Neighbor (k-NN), Logistic Regression (LR) and Support Vector Machine (SVM). The experimental results showed the efficiency and effectiveness of the proposed approach, which outperformed other techniques using various evaluation metrics.", "venue": "Italian National Conference on Sensors", "year": 2021, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-12-28", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "22"}, "authors": [{"authorId": "1397312292", "name": "Mohammed Al-Sarem"}, {"authorId": "1491585079", "name": "Faisal Saeed"}, {"authorId": "3066841", "name": "Eman H. Alkhammash"}, {"authorId": "2500712", "name": "N. Alghamdi"}], "citations": [{"paperId": "9bdfd1a326291590681f0f8f304f71a8b716ab6f", "title": "eMIFS: A Normalized Hyperbolic Ransomware Deterrence Model Yielding Greater Accuracy and Overall Performance"}, {"paperId": "792effb338223c6b10951fda36156c96c9cea256", "title": "Improving IoT Botnet Detection Using Ensemble Learning"}, {"paperId": "7ac655e19fed1042f3c3f7f9a634b85b45f18243", "title": "DT-ARO: Decision Tree-Based Artificial Rabbits Optimization to Mitigate IoT Botnet Exploitation"}, {"paperId": "f1c30102791c37e89818d06ebc2eafb3f3861fe1", "title": "Network Intrusion Detection for IoT-Botnet Attacks Using ML Algorithms"}, {"paperId": "e031ddc41b0778b6d39f977138540879d06d08e3", "title": "A Comprehensive Analysis of Intrusion Detection in Internet of Things (IoT)"}, {"paperId": "15f3e51867d705fa374ca8b325f78006bc756791", "title": "IoT Security: A Deep Learning-Based Approach for Intrusion Detection and Prevention"}, {"paperId": "88df3947e5eb31b53265624c7636c3191b31e6b4", "title": "Emerging Sensor Communication Network-Based AI/ML Driven Intelligent IoT"}, {"paperId": "1df10c81f888442aa39705f05aae1665eccb7891", "title": "ClearF++: Improved Supervised Feature Scoring Using Feature Clustering in Class-Wise Embedding and Reconstruction"}, {"paperId": "c75d1f836b30a12da98b70f02c18c37b478adefd", "title": "Joint IoT/ML Platforms for Smart Societies and Environments: A Review on Multimodal Information-Based Learning for Safety and Security"}, {"paperId": "8095f8d3adc98566855609f9cf1aefff47fe7777", "title": "An Efficient Hybrid-DNN for DDoS Detection and Classification in Software-Defined IIoT Networks"}, {"paperId": "fa0d8b61d9715c091509b859ae624d2c0b08f75f", "title": "Attack detection analysis in software-defined networks using various machine learning method"}, {"paperId": "bfc67a4fe1aa1a9e4d920bb5575585efbf1c25a9", "title": "An Improved Mutual Information Feature Selection Technique for Intrusion Detection Systems in the Internet of Medical Things"}, {"paperId": "a368f33a2d68785d346067abd4ad1d7d1a8cfce6", "title": "Threat Intelligence System for Internet of Things based Smart Environments using Unsupervised Learning"}, {"paperId": "78615b4efe5ff904cfe0d072d9ff68e829748602", "title": "Correlation-Based Feature Selection on Botnet Activity Detection Using Kendall Correlation"}, {"paperId": "909e191b258b8fbdd12041b1ae5c1f507d8530d5", "title": "Network intrusion detection model based on neural network feature extraction and PSO-SVM"}, {"paperId": "1aa075facbfc4597eb049728d10dc9e5cb879458", "title": "A survey of intrusion detection systems in wireless sensor networks"}]}
