{"paperId": "6fb035db0d69d71a811804902bffdbef88c551e3", "publicationVenue": null, "title": "Incremental (1 − ε ) -Approximate Dynamic Matching in O (poly(1 /ε )) Update Time", "abstract": "In the dynamic approximate maximum bipartite matching problem we are given bipartite graph G undergoing updates and our goal is to maintain a matching of G which is large compared the maximum matching size µ ( G ). We define a dynamic matching algorithm to be α (respectively ( α, β ))-approximate if it maintains matching M such that at all times | M | ≥ µ ( G ) · α (respectively | M | ≥ µ ( G ) · α − β ). We present the first deterministic (1 − ε )-approximate dynamic matching algorithm with O (poly( ε − 1 )) amortized update time for graphs undergoing edge insertions. Previous solutions either required super-constant [Gupta FSTTCS’14, Bhattacharya-Kiss-Saranurak SODA’23] or exponential in 1 /ε [Grandoni-Leonardi-Sankowski-Schwiegelshohn-Solomon SODA’19] update time. Our implementation is arguably simpler than the mentioned algorithms and its description is self contained. Moreover, we show that if we allow for additive (1 , ε · n )-approximation our algorithm seamlessly extends to also handle vertex deletions, on top of edge insertions. This makes our algorithm one of the few small update time algorithms for (1 − ε )-approximate dynamic matching allowing for updates both increasing and decreasing the maximum matching size of G in a fully dynamic manner. Our algorithm relies on the weighted variant of the celebrated Edge-Degree-Constrained-Subgraph (EDCS) datastructure introduced by [Bernstein-Stein ICALP’15]. As far as we are aware we introduce the first application of the weighted-EDCS for arbitrarily dense graphs. We also present a significantly simplified proof for the approximation ratio of weighed-EDCS as a matching sparsifier compared to [Bernstein-Stein], as well as simple descriptions of a fractional matching and fractional vertex cover defined on top of the EDCS. Considering the wide range of applications EDCS has found in settings such as streaming, sub-linear, stochastic and more we hope our techniques will be of independent research interest outside of the dynamic setting.", "venue": "", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "89931375", "name": "Joakim Blikstad"}, {"authorId": "2187429133", "name": "Peter Kiss"}, {"authorId": "2249662567", "name": "Inge Li"}, {"authorId": "1398716192", "name": "Martín Farach-Colton"}, {"authorId": "1879835", "name": "S. Puglisi"}, {"authorId": "2249678768", "name": "Grzegorz Herman"}], "citations": []}
