{"paperId": "6fb59987cf1d96919448ab21b3f839d5485f092f", "publicationVenue": {"id": "88957819-6d1a-49f6-8548-91372d0cccfd", "name": "Journal of Renewable and Sustainable Energy", "type": "journal", "alternate_names": ["J Renew Sustain Energy"], "issn": "1941-7012", "url": "http://jrse.aip.org/", "alternate_urls": ["https://aip.scitation.org/journal/rse", "http://scitation.aip.org/content/aip/journal/jrse/browse"]}, "title": "An attention mechanism based deep nonlinear ensemble paradigm of strengthened feature extraction method for wind power prediction", "abstract": "The inherent uncertainty of wind power always hampers difficulties in the development of wind energy and the smooth operation of power systems. Therefore, reliable ultra-short-term wind power prediction is crucial for the development of wind energy. In this research, a two-stage nonlinear ensemble paradigm based on double-layer decomposition technology, feature reconstruction, intelligent optimization algorithm, and deep learning is suggested to increase the prediction accuracy of ultra-short-term wind power. First, using two different signal decomposition techniques for processing can further filter out noise in the original signal and fully capture different features within it. Second, the multiple components obtained through double decomposition are reconstructed using sample entropy theory and reassembled into several feature subsequences with similar complexity to simplify the input variables of the prediction model. Finally, based on the idea of a two-stage prediction strategy, the cuckoo search algorithm and the attention mechanism optimized long- and short-term memory model are applied to the prediction of feature subsequences and nonlinear integration, respectively, to obtain the final prediction results. Two sets of data from wind farms in Liaoning Province, China are used for simulation experiments. The final empirical findings indicate that, in comparison to other models, the suggested wind power prediction model has a greater prediction accuracy.", "venue": "Journal of Renewable and Sustainable Energy", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-11-01", "journal": {"name": "Journal of Renewable and Sustainable Energy"}, "authors": [{"authorId": "2265939793", "name": "Jujie Wang"}, {"authorId": "2267217605", "name": "Yafen Liu"}], "citations": []}
