{"paperId": "6fba0d8326b4160a7f531181651bef5f0312ffe2", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Review on Fault Detection and Diagnosis Feature Engineering in Building Heating, Ventilation, Air Conditioning and Refrigeration Systems", "abstract": "Faults are inevitable in building energy systems, such as heating, ventilation, air conditioning and refrigeration systems. With the increasing utilization of these systems, their fault detection and diagnosis has become more significant for maintaining their operation and performance. The rapid development of data analytics has led to fault detection and diagnosis using data-based algorithms considering building intelligence. Feature engineering, which focuses on generating near minimum and optimal model inputs from the original dataset, is a fundamental technique to balance efficiency and accuracy of fault detection and diagnosis models. The generated inputs are fault features which ensures a better description of fault operations owing to their stronger fault indicative capability than original data. However, since most feature engineering research has been implemented alongside the development of data-based algorithms, most studies fail to effectively distinguish and understand their roles in fault detection and diagnosis models. To fill this research gap, this study presented the problems and mechanisms associated with feature engineering, comprehensively reviewed about 200 papers on the topic of feature engineering for heating, ventilation, air conditioning and refrigeration system fault detection and diagnosis tasks over the past 15 years. Firstly, feature engineering studies are divided according to their feature-generation technique, into manual and automated techniques. Next, feature engineering studies are analysed in terms of data type, system type, fault type, operation statue, methods and fault features. The desirable characteristics of feature engineering works are then discussed in terms of their capability of rapidly generating indicative, decoupled, interpretable and new fault features to enhance fault detection and diagnosis accuracy; the efficiency, reliability and robustness of feature engineering process; the mutual adaptability between feature engineering and fault detection and diagnosis; and their widespread applicability for more fault types and system operations. The challenges affecting feature engineering studies are discussed in terms of data volume, data diversity and quality, along with the performance evaluation of feature engineering with respect to feature engineering algorithms, fault detection and diagnosis models, fault features and online application constraints. Future work should aim to design a hybrid, heuristic, robust and automated feature engineering strategy under the guidance of expert knowledge and practical application constraints that consider the relationships between fault-related features and real-time fault impacts with energy consumption, occupants’ thermal comfort, etc.", "venue": "IEEE Access", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "2153-2187", "volume": "9"}, "authors": [{"authorId": "2179025", "name": "Guannan Li"}, {"authorId": "2395146", "name": "Yunpeng Hu"}, {"authorId": "2933483", "name": "Jiangyan Liu"}, {"authorId": "9131053", "name": "Xiumu Fang"}, {"authorId": "2045392351", "name": "Jing Kang"}], "citations": [{"paperId": "28ba8822dc3cf478c9f6733c56b48b9495b4894a", "title": "Selection of relevant features to detect and diagnose single and multiple simultaneous soft faults in air-source heat pumps"}, {"paperId": "5afc1c668b801e96349e9152a51a98f28d701b0f", "title": "AI in HVAC fault detection and diagnosis: A systematic review"}, {"paperId": "510cebc8b48d24054fdd08d388cf7c485ff10347", "title": "An intelligent fault detection and diagnosis model for refrigeration systems with a comprehensive feature selection method{fr}Un modèle intelligent de détection et de diagnostic des défauts pour les systèmes de réfrigération avec une méthode complète de sélection des caractéristiques"}, {"paperId": "d3583376bd46b14bee752e684450209bea530f43", "title": "A novel data-driven relationship inference approach for automatic data tagging in building heating, ventilation and air conditioning systems"}, {"paperId": "728d37184c2c45759008827d5b2c087244b17cf1", "title": "Interpretation and explanation of convolutional neural network-based fault diagnosis model at the feature-level for building energy systems"}, {"paperId": "4c8a3c2368f1c95b36d2d53e2642346a05f624f3", "title": "Improved convolutional neural network chiller early fault diagnosis by gradient-based feature-level model interpretation and feature learning"}, {"paperId": "e51889af915329ce12e23a51dfa44b8bc9870f48", "title": "An ensemble-based faults detection and diagnosis approach for determining faults severities at whole-building level"}, {"paperId": "4c5cb7e948df95d5a2d00a616960c2b0a25d9a86", "title": "Uncertainty quantification-based robust deep learning for building energy systems considering distribution shift problem"}, {"paperId": "a11d6bfb069d9acda247e92bdf419f1766e783b3", "title": "Fault Detection and Isolation for a Secondary Loop Refrigeration System"}, {"paperId": "8e1370eb89ff41ba96e0a4fcea3c36d6258f69ee", "title": "Classification and redundancy quantitative evaluation algorithm for highly efficient fault diagnosis of rotary machines in roll-to-roll system"}, {"paperId": "350075058f574bfbc684cc7fb9f366dbaee12c38", "title": "Deep Learning in Fault Detection and Diagnosis of building HVAC Systems: A Systematic Review with Meta Analysis"}, {"paperId": "35aa144f11fcff61511c5e38f016d68494e2247f", "title": "A Review of Data-Driven Approaches and Techniques for Fault Detection and Diagnosis in HVAC Systems"}, {"paperId": "ab2fed2e72daaa8c6d892f0c61f8e5a4d88d3618", "title": "A CNN-RNN unified framework for intrapartum cardiotocograph classification"}, {"paperId": "f823583c9a4b51a7abef494b55eee8ee87141397", "title": "Knowledge-infused deep learning diagnosis model with self-assessment for smart management in HVAC systems"}, {"paperId": "d61e6f3e1bdb34294da994b7846466e7b9ef0281", "title": "Integrated Design of Feedback Control and Fault Detection Based on Reduced-Order Observer"}, {"paperId": "cd9b7432e3299d53e9aedf80f28cd1b5c1142129", "title": "A performance assessment method for district cooling substations based on operational data"}, {"paperId": "4e95a1324fb4a2d2190c9ccff0d4c233663687c4", "title": "Comparing human and algorithmic anomaly detection for HVAC systems applications"}, {"paperId": "6d40439f3b89e6c3c0e1ce39fddf9960f2abb18c", "title": "Development of Fault Diagnosing System for Ice-Storage Air-Conditioning Systems"}, {"paperId": "7cfcac1f728e69d678250144bcc6a7fd6bc9d972", "title": "Machine learning based refrigerant leak diagnosis for a vehicle heat pump system"}, {"paperId": "168f2b01c996ba7f43416ff6d2c62867fffbc502", "title": "Knowledge transfer in fault diagnosis of rotary machines"}, {"paperId": "50b0c1410e1f7e3aa42da4ac5bb6d800152d2f4a", "title": "Delta-T-based operational signatures for operation pattern and fault diagnosis of building energy systems"}, {"paperId": "c59145ddaa9c8217c824c02ac2ff8943243b2754", "title": "An explainable one-dimensional convolutional neural networks based fault diagnosis method for building heating, ventilation and air conditioning systems"}, {"paperId": "cbde61965fe2f09dba85e17e1123df210568136c", "title": "Transfer learning-based strategies for fault diagnosis in building energy systems"}, {"paperId": "76e60dbe0358fb9fc3a8e5c618d6af6d5bd5cdfe", "title": "Enhancing the smart building supervisory system effectiveness"}, {"paperId": "6368a4579b341ae01855f8db0d89c510b1cc9a51", "title": "Physics-constrained cooperative learning-based reference models for smart management of chillers considering extrapolation scenarios"}]}
