{"paperId": "6fe6ead6117f7d9488fd3cd11120d3a388377662", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Environment Sustainability Is a Corporate Social Responsibility: Measuring the Nexus between Sustainable Supply Chain Management, Big Data Analytics Capabilities, and Organizational Performance", "abstract": "Sustainability has profound implications for environmental competitiveness, yet little has been done to study the feasibility of sustainable supply chain management (SSCM) practices as a predictor of organizational performance (operational and environmental performance). By integrating stakeholder theory and dynamic capability theory, this study aims to determine the impact of corporate social responsibility (CSR) on SSCM practices and assess its impact on organizational performance. This research also investigates the role of big data analytical capabilities (BDAC) in mediating the relationship between SSCM practices and organizational performance. The authors collected data online, examined 320 valid responses, and tested research hypotheses. The findings suggest that CSR (both internal and external CSR) positively promotes SSCM practices and contributes to expanding dynamic capacity theory in the context of BDA capabilities. BDAC is also a key mediator between SSCM practices and organizational performance. These results contribute to and improve the research on stakeholder theory and SSCM practice and provide a new perspective for scholars to further study this issue.", "venue": "Sustainability", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-03-14", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "2157403106", "name": "Changchun Zhu"}, {"authorId": "2149077228", "name": "Jianguo Du"}, {"authorId": "66567533", "name": "Fakhar Shahzad"}, {"authorId": "1722975287", "name": "Muhammad Umair Wattoo"}], "citations": [{"paperId": "83976bde6b619c3ac71069e0a0d04bdc5104f0a3", "title": "Big data driven supply chain innovative capability for sustainable competitive advantage in the food supply chain: Resource‐based view perspective"}, {"paperId": "4c6847fb7e0fb66f5c9e2e16b0122fd59d7afb0b", "title": "The Effect of Organizational Commitment, Organization Funding, and Intervening Organizational Performance towards Organizational Sustainability (on Islamic Boarding)"}, {"paperId": "e902afbd347a7a1f9b9028b982f147f9669a27d4", "title": "Analyzing the Nexus Between Environmental\nRegulations, Green Supply Chain Management,\nand Corporate Social Responsibility\nin the Agri-Food Business"}, {"paperId": "296fdb5aa5bdec8a7b54387e98694fd0337049f4", "title": "Seaweed: a sustainable solution for greening drug manufacturing in the pursuit of sustainable healthcare"}, {"paperId": "cad1d917731df7592f03be949909f210a0497790", "title": "Green process innovation, green product innovation, leverage, and corporate financial performance; evidence from system GMM"}, {"paperId": "f0e7a4e1fef7004880992f90aa529b57a0f5a0c3", "title": "The nexus between green intellectual capital, blockchain technology, green manufacturing, and sustainable performance."}, {"paperId": "61a7c8d8091022c002b014510bf425c90ed600bd", "title": "The relationship between information processing capabilities, Net-Zero capability and supply chain performance"}, {"paperId": "0f516f3784981781b05d1a06a1e9b5efd0872624", "title": "Drivers and influencers of blockchain and cloud-based business sustainability accounting in China: Enhancing practices and promoting adoption"}, {"paperId": "96edc6c7d1f58340099890addf42eacf8ac44f1c", "title": "Firms’ shareholding behavior in green supply chains: Carbon emissions reduction, power structures, and technology spillovers"}, {"paperId": "97b45640a7c007689af0ebfc68b0286be7f58344", "title": "Big data analytics capabilities: Patchwork or progress? A systematic review of the status quo and implications for future research"}, {"paperId": "35356dc57bc3047a272dbfa157156972412e8dde", "title": "A meta-regression analysis of environmental sustainability practices and firm performance"}, {"paperId": "6830b2db898514f54ed48ab13ea5aee043264f5a", "title": "A Fuzzy Multi-Criteria Model with Pareto Analysis for Prioritizing Sustainable Supply Chain Barriers in the Textile Industry: Evidence from an Emerging Economy"}, {"paperId": "eb920d5fddee29434194330082b1445db5ce37f7", "title": "Sustainable supply chain management and the UN sustainable development goals: exploring synergies towards sustainable development"}, {"paperId": "6e993977bd90df7f2ecfd201b3bd5037e63cfba9", "title": "The impact of business intelligence, big data analytics capability, and green knowledge management on sustainability performance"}, {"paperId": "c8aa4a9aa239507f55e97cf065f3936abdabd7d4", "title": "Evaluating Organizational Performance Using SmartPLS: A Management Perspective"}, {"paperId": "9d937b98158ce1b5316ed55f3a6fd45198169f20", "title": "The Methodology for Assessing the Applicability of CSR into Supplier Management Systems"}, {"paperId": "7d9d0ec49167fc9c737730f72b9c597fb0eb5563", "title": "Sustainable procurement implementation among public sector organisations in Ghana: The role of institutional isomorphism and sustainable leadership"}, {"paperId": "4763aae17ca3d110ca4928ed190a1125c439da38", "title": "Optimizing organizational performance in manufacturing: The role of IT capability, green supply chain integration, and green innovation"}, {"paperId": "82070037ff3b75ed201e79e07304120c02eb98cb", "title": "A Study on the Mechanism of Digital Technology’s Impact on the Green Transformation of Enterprises: Based on the Theory of Planned Behavior Approach"}, {"paperId": "d41627c86e7b828e6c3d04cdf3917938384a499f", "title": "Spatial Characteristics and Influencing Factors of Green Development Progress Level of Private Enterprises in China: Based on Large Collection Surveys"}, {"paperId": "e719bb41c90b506d03f445b26954f256e4e44b4f", "title": "Data-Driven Transformation: The Role of Ambidexterity and Analytics Capability in Building Dynamic and Sustainable Supply Chains"}, {"paperId": "561377e78426577f1a1e02ae0c23ee0f31dad5ba", "title": "Corporate Social Responsibility Reports: A Big Data Approach"}, {"paperId": "257c4c7060dd5253b5386f8973aa51aaf6bdf752", "title": "Knowledge mapping of resilience and human rights in supply chains: A roadmapping taxonomy for twin green and digital transition design"}, {"paperId": "6275584a642bcb57d34f1f71127920dc31e2d682", "title": "Green Behaviors and Innovations: A Green HRM Perspective to Move from Traditional to Sustainable Environmental Performance"}, {"paperId": "c4bec4af8edb70294094e1d68fda7071ca43e34f", "title": "Exploring a nexus between big data analytical capabilities and the supply chain performance of firm in big Four ASEAN countries: The Mediating Role of Environmental Dynamism"}, {"paperId": "f329e4dc23530ad2174a3d5c7932ba34816e19a4", "title": "An exploration into the factors influencing the implementation of big data analytics in sustainable supply chain management"}, {"paperId": "42366b0a8d9fb4130492b73af17e4237bacb9fdf", "title": "Big Data Analytics Capability and Firm Performance: Meta-Analysis"}, {"paperId": "eb3789b3c5a074b1e34a03d33976984cd75f15be", "title": "Challenges to corporate social responsibility adoption for sustainability: A picture fuzzy approach"}, {"paperId": "840d5ae4277b65c38cf94a638f6dddbd1f64b9a1", "title": "Data analytics dynamic capabilities for Triple-A supply chains"}, {"paperId": "0d874ff027f9f395c581e9c3d2067486deaf87ca", "title": "Study on the Impact of Supply Chain Dynamic Capabilities on Long-Term Performance of Enterprises"}, {"paperId": "43b45c1d4e3110addd2cb7df00e67d5dcb174d78", "title": "The efficacy of board independence on C.S.R. practices: empirical evidence from China"}, {"paperId": "4f64485235bf93b17137fbd71a9bd0bdaebc6449", "title": "Managing a Relationship between Corporate Social Responsibility and Sustainability: A Systematic Review"}, {"paperId": "5f5d363c49d03cd5fbc18246ff501cf2a372d37e", "title": "How digital transformation improves corporate environmental management: A review and research agenda"}, {"paperId": "6cff9fbace1bee45a68efaa06b4d40377babbbe1", "title": "The Effect of Big Data Analytics Capability on Competitive Performance: The Mediating Role of Resource Optimization and Resource Bricolage"}, {"paperId": "804ee894393c63de16c9b94da4aa5f1ba2707aa7", "title": "Decoupling Institutional Pressure on Green Supply Chain Management Efforts to Boost Organizational Performance: Moderating Impact of Big Data Analytics Capabilities"}, {"paperId": "b449bf90e339b93a10c7b2c91dfb28322998f8df", "title": "Big data analytics capabilities and supply chain sustainability: Evidence from the hospitality industry"}, {"paperId": "aaa8287fb6b2ed2716d1d4afa8712f5cec808824", "title": "Uncertain Supply"}]}
