{"paperId": "6fe6eb89ae3a413a8a669e0b50285d6fcb66f49a", "publicationVenue": {"id": "ccd8e532-73c6-414f-bc91-271bbb2933e2", "name": "Electronics", "type": "journal", "issn": "1450-5843", "alternate_issns": ["2079-9292", "0883-4989"], "url": "http://www.electronics.etfbl.net/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-247562", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-247562", "https://www.mdpi.com/journal/electronics"]}, "title": "An Efficient Hardware Design for a Low-Latency Traffic Flow Prediction System Using an Online Neural Network", "abstract": "Neural networks are computing systems inspired by the biological neural networks in human brains. They are trained in a batch learning mode; hence, the whole training data should be ready before the training task. However, this is not applicable for many real-time applications where data arrive sequentially such as online topic-detection in social communities, traffic flow prediction, etc. In this paper, an efficient hardware implementation of a low-latency online neural network system is proposed for a traffic flow prediction application. The proposed model is implemented with different Machine Learning (ML) algorithms to predict the traffic flow with high accuracy where the Hedge Backpropagation (HBP) model achieves the least mean absolute error (MAE) of 0.001. The proposed system is implemented using floating point and fixed point arithmetics on Field Programmable Gate Array (FPGA) part of the ZedBoard. The implementation is provided using BRAM architecture and distributed memory in FPGA in order to achieve the best trade-off between latency, the consumption of area, and power. Using the fixed point approach, the prediction times using the distributed memory and BRAM architectures are 150 ns and 420 ns, respectively. The area delay product (ADP) of the proposed system is reduced by 17 × compared with the hardware implementation of the latest proposed system in the literature. The execution time of the proposed hardware system is improved by 200 × compared with the software implemented on a dual core Intel i7-7500U CPU at 2.9 GHz. Consequently, the proposed hardware model is faster than the software model and more suitable for time-critical online machine learning models.", "venue": "Electronics", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-08-04", "journal": {"name": "Electronics"}, "authors": [{"authorId": "2047937415", "name": "Yasmin Adel Hanafy"}, {"authorId": "39717256", "name": "M. Mashaly"}, {"authorId": "113932496", "name": "Mohamed A. Abd El Ghany"}], "citations": [{"paperId": "d717c7dcd995b19fb310e43abbf2b22330a080b8", "title": "Ensemble Learning-based Algorithms for Traffic Flow Prediction in Smart Traffic Systems"}, {"paperId": "411e394bfc82356056c6d3ff9f9359da23c821f1", "title": "High Performance Design of Traffic-Flow Prediction Using Artificial Neural Network"}, {"paperId": "df29549a2741360765aa55f8f2b41dd43b6a0268", "title": "Reviving autoencoder pretraining"}]}
