{"paperId": "6fec7ea2dba611eb647e4fb08a9746bd60b7a835", "publicationVenue": null, "title": "Scalable Distributed Top-k Join Queries in Topic-Based Pub/Sub Systems", "abstract": "In this paper, we provide a novel approach that enables the execution of top-k join queries over sliding windows in a way that reduces the amount of data that need to be analyzed by the stream processing operators. The main idea is that brokers individually invoke the query on their received messages and forward the top-k results to a stream processing operator that performs the merging of the results and provides to the end-user the final top-k results. Moreover, our system exploits the Bayesian Optimization technique to determine automatically the number of top-k results that should be provided by each broker. Our approach has been developed in the Kappa architecture that exploits topic-based scalable publish/subscribe (pub/sub) systems like Apache Kafka to efficiently forward the high volume of incoming messages to distributed processing systems (i.e., Apache Spark or Apache Flink) that perform the batch and stream analytics operations. Our detailed experimental evaluation on our local cluster illustrates that we can efficiently execute top-k join queries on our system with high accuracy and low latency.", "venue": "2018 IEEE International Conference on Big Data (Big Data)", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2018-12-01", "journal": {"name": "2018 IEEE International Conference on Big Data (Big Data)", "pages": "378-383"}, "authors": [{"authorId": "2125879", "name": "Nikos Zacheilas"}, {"authorId": "7138350", "name": "Dimitris Dedousis"}, {"authorId": "1685532", "name": "V. Kalogeraki"}], "citations": [{"paperId": "64d6d0395e4807bc08fbfbd80bcd241ed24921a4", "title": "Load balance oriented data processing mechanism for bounded and unbounded data in smart cities"}, {"paperId": "1b454103614b5a4147c1157e6748fd54cfc88526", "title": "AMESoS: a scalable and elastic framework for latency sensitive streaming pipelines"}, {"paperId": "54a1ebda5c07e1ed2b97ca0f708d389da022f68b", "title": "Scaling the monitoring of approximate top-k queries in streaming windows"}, {"paperId": "237c7057af36ba2a339ce9f39ef670c3cb30a56a", "title": "A Distributed Stream Data Processing Platform Design and Implementation in Smart Cities"}]}
