{"paperId": "6fed3564863bffc54f3d3351f40b04dff992e643", "publicationVenue": null, "title": "An enhanced aquila optimization algorithm with velocity-aided global search mechanism and adaptive opposition-based learning.", "abstract": "The aquila optimization algorithm (AO) is an efficient swarm intelligence algorithm proposed recently. However, considering that AO has better performance and slower late convergence speed in the optimization process. For solving this effect of AO and improving its performance, this paper proposes an enhanced aquila optimization algorithm with a velocity-aided global search mechanism and adaptive opposition-based learning (VAIAO) which is based on AO and simplified Aquila optimization algorithm (IAO). In VAIAO, the velocity and acceleration terms are set and included in the update formula. Furthermore, an adaptive opposition-based learning strategy is introduced to improve local optima. To verify the performance of the proposed VAIAO, 27 classical benchmark functions, the Wilcoxon statistical sign-rank experiment, the Friedman test and five engineering optimization problems are tested. The results of the experiment show that the proposed VAIAO has better performance than AO, IAO and other comparison algorithms. This also means the introduction of these two strategies enhances the global exploration ability and convergence speed of the algorithm.", "venue": "Mathematical biosciences and engineering : MBE", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-02-01", "journal": {"name": "Mathematical biosciences and engineering : MBE", "pages": "\n          6422-6467\n        ", "volume": "20 4"}, "authors": [{"authorId": "2162462100", "name": "Yufei Wang"}, {"authorId": "2145064687", "name": "Yu-Jun Zhang"}, {"authorId": "2152647063", "name": "Yu-Xin Yan"}, {"authorId": "5848855", "name": "Juan Zhao"}, {"authorId": "6019500", "name": "Zheng-Ming Gao"}], "citations": [{"paperId": "4f9283681254fe6b2b927597862c86a6ac860283", "title": "Enhanced Aquila optimizer based on tent chaotic mapping and new rules."}, {"paperId": "15a51747e9ab72d645c98d194683813d6925d99a", "title": "Fast random opposition-based learning Aquila optimization algorithm"}, {"paperId": "0402d7938fa5956f07ef3d448f3d61154a84c0bf", "title": "Brain tumor diagnosis based on convolutional neural network improved by a new version of political optimizer"}, {"paperId": "1956137be7f0a28dc32934206f43ca5cb0483fbb", "title": "A Comprehensive Survey on Aquila Optimizer"}]}
