{"paperId": "6ff331cc9f4f543236ad396bac7a9e91df9a4438", "publicationVenue": null, "title": "A holistic review of cybersecurity and reliability perspectives in A holistic review of cybersecurity and reliability perspectives in smart airports smart airports", "abstract": "Advances in the Internet of Things (IoT) and aviation sector have resulted in the emergence of smart airports. Services and systems powered by the IoT enable smart airports to have enhanced robustness, efﬁciency and control, governed by real-time monitoring and analytics. Smart sensors control the environmental conditions inside the airport, automate passenger-related actions and support airport security. However, these augmentations and automation introduce security threats to network systems of smart airports. Cyber-attackers demonstrated the susceptibility of IoT systems and networks to Advanced Persistent Threats (APT), due to hardware constraints, software ﬂaws or IoT misconﬁgurations. With the increasing complexity of attacks, it is imperative to safeguard IoT networks of smart airports and ensure reliability of services, as cyber-attacks can have tremendous consequences such as disrupting networks, cancelling travel, or stealing sensitive information. There is a need to adopt and develop new Artiﬁcial Intelligence (AI)-enabled cyber-defence techniques for smart airports, which will address the challenges brought about by the incorporation of IoT systems to the airport business processes, and the constantly evolving nature of contemporary cyber-attacks. In this study, we present a holistic review of existing smart airport applications and services enabled by IoT sensors and systems. Additionally, we investigate several types of cyber defence tools including AI and data mining techniques, and analyse their strengths and weaknesses in the context of smart airports. Furthermore, we provide a classiﬁcation of smart airport sub-systems based on their purpose and criticality and address cyber threats that can affect the security of smart airport’s networks.", "venue": "", "year": null, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": null, "journal": null, "authors": [{"authorId": "38986974", "name": "Nickolaos Koroniotis"}, {"authorId": "3193106", "name": "Nour Moustafa"}, {"authorId": "2232845527", "name": "Ieee Francesco Ferranti Senior Member"}, {"authorId": "1680674", "name": "Praveen Gauravaram"}, {"authorId": "2260340101", "name": "Helge Janicke"}, {"authorId": "38986974", "name": "Nickolaos Koroniotis"}], "citations": []}
