{"paperId": "6ff86937cd6e2bcfe47c99c77bd1dbf658441a0b", "publicationVenue": {"id": "8a7c9905-f8cf-4711-bca6-0ef69aef9823", "name": "International Journal of Information Technology and Decision Making", "type": "journal", "alternate_names": ["Int J Inf Technol Decis Mak"], "issn": "1793-6845", "url": "http://www.worldscinet.com/ijitdm/ijitdm.shtml"}, "title": "Optimal Key Generation for Data Sanitization and Restoration of Cloud Data: Future of Financial Cyber Security", "abstract": "Cloud security in finance is considered as the key importance, taking account of the aspect of critical data stored over cloud spaces within organizations all around the globe. They are chiefly relying on cloud computing to accelerate their business profitability and scale up their business processes with enhanced productivity coming through flexible work environments offered in cloud-run working systems. Hence, there is a prerequisite to contemplate cloud security in the entire financial service sector. Moreover, the main issue challenged by privacy and security is the presence of diverse chances to attack the sensitive data by cloud operators, which leads to double the user’s anxiety on the stored data. For solving this problem, the main intent of this paper is to develop an intelligent privacy preservation approach for data stored in the cloud sector, mainly the financial data. The proposed privacy preservation model involves two main phases: (a) data sanitization and (b) data restoration. In the sanitization process, the sensitive data is hidden, which prevents sensitive information from leaking on the cloud side. Further, the normal as well as the sensitive data is stored in a cloud environment. For the sanitization process, a key should be generated that depends on the new meta-heuristic algorithm called crossover improved-lion algorithm (CI-LA), which is inspired by the lion’s unique social behavior. During data restoration, the same key should be used for effectively restoring the original data. Here, the optimal key generation is done in such a way that the objective model involves the degree of modification, hiding rate, and information preservation rate, which effectively enhance the cyber security performance in the cloud.", "venue": "International Journal of Information Technology and Decision Making", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-07-01", "journal": {"name": "Int. J. Inf. Technol. Decis. Mak.", "pages": "987-1013", "volume": "19"}, "authors": [{"authorId": "1752712739", "name": "B. Balashunmugaraja"}, {"authorId": "93071649", "name": "T. Ganeshbabu"}], "citations": [{"paperId": "23cce03548efe58b49157144d3e672127e050268", "title": "Proposed association rule hiding based privacy preservation model with block chain technology for IoT healthcare sector"}, {"paperId": "a3cc6f852645a6f7c5b3115fe7433a413213bb7d", "title": "Unmasking the other face of flexible working practices: A systematic literature review"}, {"paperId": "c702d6991b0841f607ff016a0a5f3e73bd7e4ee9", "title": "Privacy preservation of cloud data in business application enabled by multi-objective red deer-bird swarm algorithm"}, {"paperId": "449930181c8829411d33eac4c80e0247f9220af6", "title": "Enhancement of an Optimized Key for Database Sanitization to Ensure the Security and Privacy of an Autism Dataset"}]}
