{"paperId": "70176bb02424cbae874c1864fad7bb73306d9c5d", "publicationVenue": {"id": "c7227e89-93c0-4fff-9f44-ddd62529fc3f", "name": "Nanomaterials", "type": "journal", "issn": "2079-4991", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217790", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217790", "https://www.mdpi.com/journal/nanomaterials"]}, "title": "Triboelectric Nanogenerators for Preventive Health Monitoring", "abstract": "With the improvement in life quality, the increased focus on health has expedited the rapid development of portable preventative-health-monitoring devices. As one of the most attractive sensing technologies, triboelectric nanogenerators (TENGs) are playing a more and more important role in wearable electronics, machinery condition monitoring, and Internet of Things (IoT) sensors. TENGs possess many advantages, such as ease of fabrication, cost-effectiveness, flexibility, material-selection variety, and the ability to collect low-frequency motion, offering a novel way to achieve health monitoring for human beings in various aspects. In this short review, we initially present the working modes of TENGs based on their applications in health monitoring. Subsequently, the applications of TENG-based preventive health monitoring are demonstrated for different abnormal conditions of human beings, including fall-down detection, respiration monitoring, fatigue monitoring, and arterial pulse monitoring for cardiovascular disease. Finally, the discussion summarizes the current limitations and future perspectives. This short review encapsulates the latest and most influential works on preventive health monitoring utilizing the triboelectric effect for human beings and provides hints and evidence for future research trends.", "venue": "Nanomaterials", "year": 2024, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2024-02-01", "journal": {"name": "Nanomaterials", "volume": "14"}, "authors": [{"authorId": "2147417740", "name": "Mang Gao"}, {"authorId": "2283984301", "name": "Zhiyuan Yang"}, {"authorId": "2283965566", "name": "Junho Choi"}, {"authorId": "2163387658", "name": "Chan Wang"}, {"authorId": "113964133", "name": "Guozhang Dai"}, {"authorId": "1557359403", "name": "Jun-liang Yang"}], "citations": []}
