{"paperId": "701815ce22d1aff1609f7446647fd0bca16e2154", "publicationVenue": null, "title": "Privacy preserving on personalized medical data in cloud IoT using Extended Fully Homomorphic Encryption", "abstract": ": -Transition of healthcare to digital platforms is necessary for the present era to provide a better diagnosis with reduced operational cost. Digital platform makes the patient data available in an appropriate time. Cloud computing in health care applications senses the data through IoT modules and stored in the cloud. Manipulating medical data needs an essential protection mechanism to ensure data privacy. To reduce the privacy issues, encryption algorithms are preferred generally but their efficiency needs to be improved without breaking the data confidentiality. This research work proposed an Extended Fully Homomorphic Encryption (EFHE) scheme to preserve medical data privacy. Parameters such as Signal to Noise Ratio, Peak Signal to Noise Ratio, Mean Square Error, encoding, and decoding time are considered for analysis and conventional homomorphic and fully homomorphic algorithms are used to compare with the proposed research model to validate the superior performance of the proposed encryption scheme.", "venue": "", "year": null, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "2261225148", "name": "Pradeep Bedi"}, {"authorId": "2261221213", "name": "B. Goyal"}], "citations": [{"paperId": "f73703adb119de429b872f1d8a8fded18b0456bc", "title": "Adaptive Autonomous Protocol for Secured Remote Healthcare Using Fully Homomorphic Encryption (AutoPro-RHC)"}, {"paperId": "1531774ff3cfe20fecc2da8d380f139e1efbaf33", "title": "An improved IoT based security model for fitness tracker using quantum fruit fly optimization improved faster RCNN"}, {"paperId": "3ba267d05855c9a406f753d6c8938aaa6e5a80a3", "title": "Improved 3D Rotation-based Geometric Data Perturbation Based on Medical Data Preservation in Big Data"}]}
