{"paperId": "70210227462b7b3df498b32a30fd75dc7bb61dbd", "publicationVenue": null, "title": "FedLesScan: Mitigating Stragglers in Serverless Federated Learning", "abstract": "Federated Learning (FL) is a machine learning paradigm that enables the training of a shared global model across distributed clients while keeping the training data local. While most prior work on designing systems for FL has focused on using stateful always running components, recent work has shown that components in an FL system can greatly benefit from the usage of serverless computing and Function-as-a-Service technologies. To this end, distributed training of models with severless FL systems can be more resource-efficient and cheaper than conventional FL systems. However, serverless FL systems still suffer from the presence of stragglers, i.e., slow clients due to their resource and statistical heterogeneity. While several strategies have been proposed for mitigating stragglers in FL, most methodologies do not account for the particular characteristics of serverless environments, i.e., cold-starts, performance variations, and the ephemeral stateless nature of the function instances. Towards this, we propose FedLesScan, a novel clustering-based semi-asynchronous training strategy, specifically tailored for serverless F L. FedLesScan dynamically adapts to the behavior of clients and minimizes the effect of stragglers on the overall system. We implement our strategy by extending an open-source serverless FL system called FedLess. Moreover, we comprehensively evaluate our strategy using the 2nd generation Google Cloud Functions with four datasets and varying percentages of stragglers. Results from our experiments show that compared to other approaches FedLesScan reduces training time and cost by an average of 8% and 20% respectively while utilizing clients better with an average increase in the effective update ratio of 17.75%.", "venue": "2022 IEEE International Conference on Big Data (Big Data)", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-11-10", "journal": {"name": "2022 IEEE International Conference on Big Data (Big Data)", "pages": "1230-1237"}, "authors": [{"authorId": "8529334", "name": "M. Elzohairy"}, {"authorId": "8766032", "name": "Mohak Chadha"}, {"authorId": "38833592", "name": "Anshul Jindal"}, {"authorId": "51198759", "name": "Andreas Grafberger"}, {"authorId": "3016273", "name": "Jiatao Gu"}, {"authorId": "3240465", "name": "M. Gerndt"}, {"authorId": "1688937", "name": "Osama Abboud"}], "citations": [{"paperId": "8221357325c0ea1cc45c825e264a77ba220d2f83", "title": "FLIPS: Federated Learning using Intelligent Participant Selection"}, {"paperId": "dda9e433ac572636b57d05c1a1bf529fb4df2973", "title": "FaST-GShare: Enabling Efficient Spatio-Temporal GPU Sharing in Serverless Computing for Deep Learning Inference"}]}
