{"paperId": "7034d45160c8cac0afb8e3a3c99ac3d8fec74145", "publicationVenue": null, "title": "Towards Timely Edge-assisted Video Analytics Services", "abstract": "Real-time video analytics services are expected to deliver accurate recognition results to users timely. However, existing studies usually fail in the dilemma between reducing delay and improving accuracy. Balancing such conflicting metrics is extremely hard under dynamic network conditions. In this regard, we introduce the age of processed information (AoPI) concept, i.e., the time elapsed since the generation of the latest accurately recognized frame. As a systematic metric, AoPI depicts the integrated impact of recognition accuracy, transmission, and computation efficiency. We derive the closed-form expressions of AoPI under preemptive and non-preemptive computation scheduling policies w.r.t. the transmission/computation rate and recognition accuracy of video frames, which are validated using prototype experiments. Based on the derived results, we study the joint video configuration selection, bandwidth, and computation resource allocation problem to minimize the long-term average AoPI among all cameras. An efficient method is proposed to solve the problem, which utilizes Lyapunov optimization and block coordinate descent to make decisions online without requiring future information about network variations and video content. We prove that our method achieves asymptotically optimal performance. Extensive simulations show that our method reduces the AoPI by up to 4.06X compared with the state-of-the-art baselines.", "venue": "2023 IEEE International Conference on Web Services (ICWS)", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-07-01", "journal": {"name": "2023 IEEE International Conference on Web Services (ICWS)", "pages": "444-454"}, "authors": [{"authorId": "2108333769", "name": "Xishuo Li"}, {"authorId": "2116574681", "name": "Shan Zhang"}, {"authorId": "2165870541", "name": "Yuejiao Huang"}, {"authorId": "2244126135", "name": "Xiao Ma"}, {"authorId": "2163056936", "name": "Zhiyuan Wang"}, {"authorId": "2237112639", "name": "Hongbin Luo"}], "citations": []}
