{"paperId": "703745c3b75f8b7f34d67ff5f4563d1ecc42c6af", "publicationVenue": null, "title": "Évolution et formalisation de la Lambda Architecture pour des analyses à hautes performances - Application aux données de Twitter", "abstract": "Extraire de la valeur des donnees des reseaux sociaux est une tâche complexe induite par leur velocite, volume et variabilite. Les utilisateurs s'approprient le dispositif et developpent des usages multiples, ce qui renforce la variabilite semantique. Les resultats des analyses doivent etre produits au plus tot (de maniere optimale en temps reel) pour en renforcer la pertinence. Pour y parvenir, des connaissances metiers sont essentielles et elle sont generalement acquises lors d'analyses exploratoires. En consequence, les plateformes de collecte, stockage et analyse des donnees des reseaux sociaux doivent supporter des flux de donnees importants, des analyses en temps reel et des analyses exploratoires. Des styles et des patrons d'architecture permettent de prendre en compte ces specificites, afin de proposer des techniques de prise en charge de ces donnees, et ainsi de faciliter leur traitement. Ces architectures ont besoin d'etre formalisees, pour etudier de quelle maniere les proprietes essentielles sont respectees, connaitre leur comportement, et anticiper les effets que peuvent avoir les composants lorsqu'ils sont regroupes au sein d'une meme architecture, et ce avant meme de les developper puis de les mettre en production. Dans cet article, nous proposons un patron d'architecture, la Lambda+ Architecture, inspire de la Lambda Architecture et adapte au traitement des donnees massives. Nous proposons egalement un cadre formel pour la specification d'architectures se basant sur la theorie des categories, ainsi qu'une implementation de notre patron pour analyser les donnees issues de Twitter.", "venue": "", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-01-18", "journal": {"name": "", "volume": "2"}, "authors": [{"authorId": "1388989084", "name": "Annabelle Gillet"}, {"authorId": "146624835", "name": "É. Leclercq"}, {"authorId": "2091004205", "name": "Nadine Cullot"}], "citations": [{"paperId": "bfe49ee2fc0f0375dddfa28c18e7bac5109b9f7b", "title": "Big Data Architectures and Concepts"}]}
