{"paperId": "704fb0508f72a40566fb45279903fb124b3b44c8", "publicationVenue": {"id": "18bece41-6c56-4e90-a68d-0a07865a4ae7", "name": "Jurnal Minfo Polgan", "type": "journal", "alternate_names": ["J Minfo Polgan"], "issn": "2089-9424"}, "title": "The Role of Information Technology in Improving Urban Governance", "abstract": "The rapid development of information technology has a significant impact on various fields of human life, including urban governance. In the context of urban governance, information technology can be used to improve efficiency, transparency, and community participation in the decision-making process that has an impact on the quality of life of city residents. The purpose of this research is to explain the role of information technology in improving urban governance because it is important in the context of increasingly complex urban development and requires appropriate and efficient decision-making. The focus of this research is qualitative. Methods for gathering information included paying close attention and taking detailed notes, with subsequent analysis including data reduction, visualisation, and inference. The study arrived at the conclusion that the role of information technology in improving urban governance is crucial and requires special attention from the government and relevant stakeholders. By improving access and quality of information technology services, enhancing digital literacy and information technology skills, increasing community participation in urban governance, and improving data security and privacy, the application of information technology in urban governance can become more effective and efficient in improving urban governance. \n ", "venue": "Jurnal Minfo Polgan", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-01", "journal": {"name": "Jurnal Minfo Polgan"}, "authors": [{"authorId": "2058611798", "name": "M. A. K. Harahap"}, {"authorId": "67205594", "name": "Kraugusteeliana Kraugusteeliana"}, {"authorId": "2158250329", "name": "Susatyo Adhi Pramono"}, {"authorId": "2272346902", "name": "Oh Zi Jian"}, {"authorId": "2161177137", "name": "Abu Muna Almaududi Ausat"}], "citations": [{"paperId": "8a885a5bf2f35306642bc873f997cfa275015519", "title": "Education Management Strategies to Maximize the Effectiveness of Information and Communication Technology Integration in Teaching and Learning Processes"}, {"paperId": "6009967a7ab992185b28571af7b6c619ba172b98", "title": "Governance in the exploration of global and regional determinants of ICT development"}, {"paperId": "db1cd6ed372f482abbc20bc84c54f245d97650fd", "title": "Optimising Human Resources Capacity: Driving Adoption of Latest Technology and Driving Business Innovation amidst the Dynamics of the Digital Era"}, {"paperId": "4a3178ddf096cfab6c2fb756ad43b5ad1e1b91ca", "title": "Optimising Organisational Performance Through Human Resource Management Strategy and Technology Integration to Enhance Innovation"}, {"paperId": "2803927e73e263cce4070e55cfce265f7ebc31f8", "title": "Ethical Leadership in Information Technology Decision Making and its Impact on Risk Management"}, {"paperId": "eda7c242d6f2496d53094eeb9209c58041a79eba", "title": "Management Strategies to Address Human Resources Challenges in the Information Technology Era"}, {"paperId": "e82e844fe416b80e22e1640bf0da3a49ff08c247", "title": "A Study on Gender Roles in the Information Technology Profession and its Impact on Human Resources"}, {"paperId": "86871f7fa22b96bb41a54edd62765b7002150332", "title": "Entrepreneurship Education and the Role of Technology in Driving Business Innovation"}, {"paperId": "4a68fca41ea9286f88056cb18f3409c0b604a575", "title": "Application of ChatGPT in Business Management and Strategic Decision Making"}, {"paperId": "798e7217deb3580df98cfeaf85dd853bd0d0812e", "title": "The Role of Information Technology in Improving Resource Management Efficiency in Sustainable Agriculture"}, {"paperId": "9718b516e4e5dbc4336fcdf06758421c2f71911e", "title": "The Role of Social Media in Shaping Public Opinion and Its Influence on Economic Decisions"}, {"paperId": "01a61a7657c94107b551c169573847083a2d05d5", "title": "The Role of ChatGPT in Improving the Efficiency of Education Management Processes"}, {"paperId": "7206469332b4c8290ca03cad8c037da9ab588034", "title": "The Role of ChatGPT in Improving Cross-Cultural Team Management Performance"}, {"paperId": "de628b7089963b2e05a3428cd4405c355b86b064", "title": "Digital Entrepreneurship: The Role of Digital Technology in Building New Businesses"}, {"paperId": "3465fdcbb23edc4ba36e5f8e48b651b00a05e3c7", "title": "The Role of Information and Communication Technology in Improving the Efficiency of Human Resource Management Administration"}, {"paperId": "fd2a3166571502beb1821b64604d542e45a88421", "title": "The Role of Leadership in Managing Organisational Culture Change in the Context of Information Technology Implementation"}, {"paperId": "24bdb62e1bed1181eb62dd10a3502e80dc6c8f3c", "title": "The Role of Information Technology in Improving the Efficiency and Productivity of Human Resources in the Workplace"}, {"paperId": "b55b0bad38b2ed898c7d86d7bda58230f9f2ba7a", "title": "Use of ChatGPT in Building Personalisation in Business Services"}, {"paperId": "ee2559d0eefea59e8528043f1e9714c735015087", "title": "Application of ChatGPT in Improving Operational Efficiency in the Context of Entrepreneurship"}, {"paperId": "8a264805758cf460e931099385c92cf4b866b234", "title": "The Role of Information Technology in Improving Human Resources Career Development"}, {"paperId": "aee316b30f6fe609e29773e0189ee2f75e5d38c6", "title": "Efektivitas Entrepreneurship Melalui Digital Marketing Pada Pemasaran Produk Berbasis Website Pada UKM Deli Serdang Mall"}, {"paperId": "36635d1b4e84c778c085d60173b224585ab727b4", "title": "The Use of Information Technology in Improving the Recruitment and Selection Process of Human Resources"}, {"paperId": "63f7e756b3d9fde147989ef6c3914e04278970c0", "title": "Recent Trends in Social Media Marketing Strategy"}, {"paperId": "0d410b2be2da8286965635a502425431d814aaa6", "title": "Human Resource Management Strategy in Organisational Digital Transformation"}, {"paperId": "43c7b0f1c2187e8bf7c2d45d0bcca43c94aa8624", "title": "Human Capital Development and Economic Growth: A Literature Review on Information Technology Investment, Education, Skills, and Productive Labour"}, {"paperId": "cb27e7e859e0cf29f2202dd9ac20adf4082e87db", "title": "The Role of Information Technology in Driving Innovation and Entrepreneurial Business Growth"}, {"paperId": "9ab0a0c022dfafe5b5d3df6929d1823f8a6c030a", "title": "The Role of Information Technology in Improving the Efficiency and Effectiveness of Talent Management Processes"}, {"paperId": "2f4b4fbb20fd7645b19ac7f3ce64ce34f73355db", "title": "The Role of ChatGPT in Enhancing the Information Search and Decision-Making Process of Travellers"}, {"paperId": "fbdd1e19a469a72e2e3114da27176b42a5e66bac", "title": "Analysis of the Use of E-commerce in Improving Entrepreneurial Business Competitiveness"}, {"paperId": "9afbac611ddc4556ac3bd6be548163eb8b3ed2be", "title": "Overview of ChatGPT Technology and its Potential in Improving Tourism Information Services"}]}
