{"paperId": "705857defab9423a9a93579e122befcb0bf23a48", "publicationVenue": {"id": "5440268e-4691-4fc0-8d0e-dcd6df18e77f", "name": "ACM/IEEE International Conference on Mobile Computing and Networking", "type": "conference", "alternate_names": ["MOBICOM", "MobiCom", "ACM/IEEE Int Conf Mob Comput Netw"], "url": "http://www.acm.org/sigs/sigmobile/"}, "title": "RISE: robust wireless sensing using probabilistic and statistical assessments", "abstract": "Wireless sensing builds upon machine learning shows encouraging results. However, adopting wireless sensing as a large-scale solution remains challenging as experiences from deployments have shown the performance of a machine-learned model to suffer when there are changes in the environment, e.g., when furniture is moved or when other objects are added or removed from the environment. We present Rise, a novel solution for enhancing the robustness and performance of learning-based wireless sensing techniques against such changes during a deployment. Rise combines probability and statistical assessments together with anomaly detection to identify samples that are likely to be misclassified and uses feedback on these samples to update a deployed wireless sensing model. We validate Rise through extensive empirical benchmarks by considering 11 representative sensing methods covering a broad range of wireless sensing tasks. Our results show that Rise can identify 92.3% of misclassifications on average. We showcase how Rise can be combined with incremental learning to help wireless sensing models retain their performance against dynamic changes in the operating environment to reduce the maintenance cost, paving the way for learning-based wireless sensing to become capable of supporting long-term monitoring in complex everyday environments.", "venue": "ACM/IEEE International Conference on Mobile Computing and Networking", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2021-10-19", "journal": {"name": "Proceedings of the 27th Annual International Conference on Mobile Computing and Networking"}, "authors": [{"authorId": "23180428", "name": "Shuangjiao Zhai"}, {"authorId": "2238603", "name": "Zhanyong Tang"}, {"authorId": "2583077", "name": "Petteri Nurmi"}, {"authorId": "2068791", "name": "Dingyi Fang"}, {"authorId": "2466164", "name": "Xiaojiang Chen"}, {"authorId": "11032852", "name": "Z. Wang"}], "citations": [{"paperId": "e29993725247b586953b8fc4889725d714892e0d", "title": "RLoc"}, {"paperId": "c282b207a8fd20c9587e76f801835fd12a9c10a3", "title": "WVGR: Gesture Recognition based on WiFi-Video Fusion"}, {"paperId": "93f1f976c34a8cf29bc488a6c009b81475879ae5", "title": "TFSemantic: A Time-Frequency Semantic GAN Framework for Imbalanced Classification Using Radio Signals"}, {"paperId": "b86b3c273db582921bf71d4b4419f73569a4a733", "title": "TransRF: Towards a Generalized and Cross-Domain RFID Sensing System Using Few-Shot Learning"}, {"paperId": "a5c68f6f12550b80d3c3968c38323668dcaec8ec", "title": "Solving the WiFi Sensing Dilemma in Reality Leveraging Conformal Prediction"}, {"paperId": "393ae43b626dc0215009ae0730b7d197d98dcf5b", "title": "Wi-Learner"}, {"paperId": "21e783d0b2802fd1633b0cffc87296bd91c0a8d7", "title": "RF-CM"}, {"paperId": "30d51a26086a6632d2ed0edd882054b46e8519a9", "title": "Automating reinforcement learning architecture design for code optimization"}, {"paperId": "600e7671038e41d8ad67ce7d577c3414eba326f3", "title": "A Lightweight Passive Human Tracking Method Using Wi-Fi"}, {"paperId": "7c8971a4634f006b3a011fd5fb78a51660702db6", "title": "SLNet: A Spectrogram Learning Neural Network for Deep Wireless Sensing"}]}
