{"paperId": "705bd29e54fd2f73b083622370b66791676de059", "publicationVenue": {"id": "6a01e090-7d29-441f-b6c6-eaa2f90d7cb3", "name": "Baghdad Science Journal", "type": "journal", "alternate_names": ["Baghdad Sci J"], "issn": "2078-8665", "alternate_issns": ["2411-7986"], "url": "http://bsj.uobaghdad.edu.iq/index.php/BSJ", "alternate_urls": ["http://www.csw-journal.org/"]}, "title": "Crucial File Selection Strategy (CFSS) for Enhanced Download Response Time in Cloud Replication Environments", "abstract": "Cloud Computing is a mass platform to serve high volume data from multi-devices and numerous technologies. Cloud tenants have a high demand to access their data faster without any disruptions. Therefore, cloud providers are struggling to ensure every individual data is secured and always accessible. Hence, an appropriate replication strategy capable of selecting essential data is required in cloud replication environments as the solution. This paper proposed a Crucial File Selection Strategy (CFSS) to address poor response time in a cloud replication environment. A cloud simulator called CloudSim is used to conduct the necessary experiments, and results are presented to evidence the enhancement on replication performance. The obtained analytical graphs are discussed thoroughly, and apparently, the proposed CFSS algorithm outperformed another existing algorithm with a 10.47% improvement in average response time for multiple jobs per round.", "venue": "Baghdad Science Journal", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-12-20", "journal": {"name": "Baghdad Science Journal"}, "authors": [{"authorId": "96983143", "name": "M. A. Fazlina"}, {"authorId": "2563887", "name": "R. Latip"}, {"authorId": "144968020", "name": "A. Abdullah"}, {"authorId": "87656074", "name": "H. Ibrahim"}, {"authorId": "3111035", "name": "Mohamed A. Alrshah"}], "citations": [{"paperId": "13fd8ad00e13187f81c1b455c57d8f51e19c6600", "title": "Enhancing Cloud Resource Management Based on Intelligent System"}]}
