{"paperId": "706bc09f3a5baa4ab1a688e87229db957b7847d5", "publicationVenue": {"id": "312ca99c-9149-490d-813e-c60d5e949f65", "name": "Concurrency and Computation", "type": "journal", "alternate_names": ["Concurr Comput Pract Exp", "Concurrency and Computation: Practice and Experience", "Concurr Comput"], "issn": "1532-0626", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/77004395?CRETRY=1&SRETRY=0", "alternate_urls": ["http://www3.interscience.wiley.com/cgi-bin/jtoc?ID=77004395", "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1532-0634"]}, "title": "Service function chain composition and placement using grammar‐based genetic algorithm", "abstract": "Service function chaining (SFC) creates a requested orchestration for composition and placement of several service functions. One of the most critical issues for the service function providers is achieving the highest quality of service. We consider the problem of optimal Service Function composition and placement in an SFC‐enabled network with the aim of achieving maximum Quality of Service (QoS). To this end, a method of merging the composition, routing, and placement phases is introduced. A genetic algorithm is designed to find the service chain instance with the maximum QoS using grammar‐based Genetic Algorithm (GA) operators. This grammar is provided to filter invalid service compositions based on the data center, security, and mobile scenarios defined by Internet engineering task force. A chromosome in the proposed genetic algorithm corresponds to a service chain instance that matches the proposed grammar. For routing, strongly connected components (SCCs) are extracted to reduce search time in the network. Consequently, the search space is reduced for requests whose start and end nodes are placed in a SCC. Besides, the Floyd Warshall algorithm is used for routing between consecutive services. According to the results, the proposed method outperformed other methods in terms of the number of responded requests, runtime, and cost.", "venue": "Concurrency and Computation", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-09-09", "journal": {"name": "Concurrency and Computation: Practice and Experience", "volume": "34"}, "authors": [{"authorId": "1742429955", "name": "Pouya Khosravian"}, {"authorId": "37727673", "name": "S. Emadi"}, {"authorId": "2713504", "name": "G. Mirjalily"}, {"authorId": "2074190351", "name": "B. Zamani"}], "citations": []}
