{"paperId": "707dac793bede56d58291fd4a74293d84dc50a7e", "publicationVenue": {"id": "8ee71e17-421e-43db-ad2d-cc8af6217a0d", "name": "European Conference on Information Retrieval", "type": "conference", "alternate_names": ["ECIR", "Eur Conf Inf Retr"], "url": "https://en.wikipedia.org/wiki/European_Conference_on_Information_Retrieval"}, "title": "Multivariate Powered Dirichlet Hawkes Process", "abstract": "The publication time of a document carries a relevant information about its semantic content. The Dirichlet-Hawkes process has been proposed to jointly model textual information and publication dynamics. This approach has been used with success in several recent works, and extended to tackle specific challenging problems --typically for short texts or entangled publication dynamics. However, the prior in its current form does not allow for complex publication dynamics. In particular, inferred topics are independent from each other --a publication about finance is assumed to have no influence on publications about politics, for instance. In this work, we develop the Multivariate Powered Dirichlet-Hawkes Process (MPDHP), that alleviates this assumption. Publications about various topics can now influence each other. We detail and overcome the technical challenges that arise from considering interacting topics. We conduct a systematic evaluation of MPDHP on a range of synthetic datasets to define its application domain and limitations. Finally, we develop a use case of the MPDHP on Reddit data. At the end of this article, the interested reader will know how and when to use MPDHP, and when not to.", "venue": "European Conference on Information Retrieval", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-12-12", "journal": {"pages": "47-61"}, "authors": [{"authorId": "1469265097", "name": "Gael Poux-Medard"}, {"authorId": "1755585", "name": "Julien Velcin"}, {"authorId": "7533566", "name": "Sabine Loudcher"}], "citations": [{"paperId": "8c902fbd202d662fa2e78bdd2d0602dcb252848b", "title": "Dirichlet-Survival Process: Scalable Inference of Topic-Dependent Diffusion Networks"}]}
