{"paperId": "7083fd33bdfe380e2649dee969b3c44516d98675", "publicationVenue": {"id": "fcbcaf18-8ab1-43e1-a973-604bbc7e344e", "name": "Proceedings of the VLDB Endowment", "type": "journal", "alternate_names": ["Proceedings of The Vldb Endowment", "Proc VLDB Endow", "Proc Vldb Endow"], "issn": "2150-8097", "url": "http://dl.acm.org/toc.cfm?id=J1174", "alternate_urls": ["http://portal.acm.org/toc.cfm?CFID=21632689&CFTOKEN=99329904&WantType=Affiliated%20Organizations&coll=ACM&dl=ACM&id=J1174&idx=J1174&part=affil&title=VLDB%20Endowment&type=periodical"]}, "title": "Manu: A Cloud Native Vector Database Management System", "abstract": "With the development of learning-based embedding models, embedding vectors are widely used for analyzing and searching unstructured data. As vector collections exceed billion-scale, fully managed and horizontally scalable vector databases are necessary. In the past three years, through interaction with our 1200+ industry users, we have sketched a vision for the features that next-generation vector databases should have, which include long-term evolvability, tunable consistency, good elasticity, and high performance.\n We present Manu, a cloud native vector database that implements these features. It is difficult to integrate all these features if we follow traditional DBMS design rules. As most vector data applications do not require complex data models and strong data consistency, our design philosophy is to relax the data model and consistency constraints in exchange for the aforementioned features. Specifically, Manu firstly exposes the write-ahead log (WAL) and binlog as backbone services. Secondly, write components are designed as log publishers while all read-only analytic and search components are designed as independent subscribers to the log services. Finally, we utilize multi-version concurrency control (MVCC) and a delta consistency model to simplify the communication and cooperation among the system components. These designs achieve a low coupling among the system components, which is essential for elasticity and evolution. We also extensively optimize Manu for performance and usability with hardware-aware implementations and support for complex search semantics. Manu has been used for many applications, including, but not limited to, recommendation, multimedia, language, medicine and security. We evaluated Manu in three typical application scenarios to demonstrate its efficiency, elasticity, and scalability.", "venue": "Proceedings of the VLDB Endowment", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-06-28", "journal": {"name": "ArXiv", "volume": "abs/2206.13843"}, "authors": [{"authorId": "1764236", "name": "Rentong Guo"}, {"authorId": "3050427", "name": "Xi-Dao Luan"}, {"authorId": "2054371236", "name": "Long Xiang"}, {"authorId": "145837716", "name": "Xiao Yan"}, {"authorId": "1666260553", "name": "Xiaomeng Yi"}, {"authorId": "2173911143", "name": "Jigao Luo"}, {"authorId": "2173874701", "name": "Qianya Cheng"}, {"authorId": "2054230", "name": "Weizhi Xu"}, {"authorId": "2173911145", "name": "Jiarui Luo"}, {"authorId": "2108861125", "name": "Frank Liu"}, {"authorId": "2174063121", "name": "Zhenshan Cao"}, {"authorId": "2173874236", "name": "Yanliang Qiao"}, {"authorId": "2174014842", "name": "Ting Wang"}, {"authorId": "2084612700", "name": "Bo Tang"}, {"authorId": "2113619066", "name": "Charles Xie"}], "citations": [{"paperId": "53ebca8d109d498d65f3744e98becd28e9f3b4b1", "title": "eCIL-MU: Embedding based Class Incremental Learning and Machine Unlearning"}, {"paperId": "c36d05d13ff0532fee315d441d20f390d3f2ad75", "title": "Starling: An I/O-Efficient Disk-Resident Graph Index Framework for High-Dimensional Vector Similarity Search on Data Segment"}, {"paperId": "8e6b6596718fb3ab0512a8384154bfa9f78f0254", "title": "MUST: An Effective and Scalable Framework for Multimodal Search of Target Modality"}, {"paperId": "2efba5582aff9a26a24f8e6bf954fe2907930647", "title": "Optimizing Resource Utilization Using Vector Databases in Green Internet of Things"}, {"paperId": "77e851d469c929bb0d91919145a131071aaa3e1b", "title": "Vector Databases and Vector Embeddings-Review"}, {"paperId": "414777b0fcdd48b2f20cd3fd24ba374dd61974c5", "title": "Towards Conceptualization Of A Prototype For Quantum Database: A Complete Ecosystem"}, {"paperId": "e8881258c042da4b2f9d30dd8af8a2509974fd74", "title": "Experimental Analysis of Large-scale Learnable Vector Storage Compression"}, {"paperId": "47764ccd0fcd215fc862101f9b0642fd5890b3c7", "title": "SPFresh: Incremental In-Place Update for Billion-Scale Vector Search"}, {"paperId": "899f86566b04e7a79d15cd2df62fbb2e66ec8b75", "title": "Survey of Vector Database Management Systems"}, {"paperId": "b85f3a66245d483f3eb3447eaf9950bd55f2b21e", "title": "PentestGPT: An LLM-empowered Automatic Penetration Testing Tool"}, {"paperId": "a4e32021908ae088839878a94513c2202e4bf084", "title": "Harnessing Scalable Transactional Stream Processing for Managing Large Language Models [Vision]"}, {"paperId": "8093f2b74c5f9d705d88076d5d9675ecbed8ef50", "title": "MarineVRS: Marine Video Retrieval System with Explainability via Semantic Understanding"}, {"paperId": "4f662c42b2bd52422b70d8f44175f33cec4f8969", "title": "High-Throughput Vector Similarity Search in Knowledge Graphs"}]}
