{"paperId": "709246b20dd081e812d68fcda85908633196386c", "publicationVenue": null, "title": "A Unified Tensor Framework for Clustering and Simultaneous Reconstruction of Incomplete Imaging Data", "abstract": "Incomplete observations in the data are always troublesome to data clustering algorithms. In fact, most of the well-received techniques are not designed to encounter such imperative scenarios. Hence, clustering of images under incomplete samples is an inquisitive yet unaddressed area of research. Therefore, the aim of this article is to design a single-stage optimization procedure for clustering as well as simultaneous reconstruction of images without breaking the intrinsic spatial structure. The method employs the self-expressiveness property of submodules, and images are stacked as the lateral slices of a three-dimensional tensor. The proposed optimization method is designed to extract a sparse t-linear combination tensor with low multirank constraint, consisting of a unique set of linear coefficients in the form of mode-3 fibers and the spectral clustering is performed on these fibers. Simultaneously, the recovery of lost samples is accomplished by twisting the entire lateral slices of the data tensor and applying a low-rank approximation on each slice. The prominence of the proposed method lies in the simultaneous execution of data clustering and reconstruction of incomplete observations in a single step. Experimental results reveal the excellence of the proposed method over state-of-the-art clustering algorithms in the context of incomplete imaging data.", "venue": "ACM Trans. Multim. Comput. Commun. Appl.", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-08-25", "journal": {"name": "ACM Transactions on Multimedia Computing, Communications, and Applications (TOMM)", "pages": "1 - 24", "volume": "16"}, "authors": [{"authorId": "2067906778", "name": "Jobin Francis"}, {"authorId": "31077307", "name": "B. M"}, {"authorId": "2288329277", "name": "S. N. George"}], "citations": [{"paperId": "2df62fe2dc995d5cdd258c7178b98f24f42d6d1c", "title": "An approximate tensor singular value decomposition approach for the fast grouping of whole-body human poses"}, {"paperId": "3b0cc8c0f1ec35418a572866a664e3e1f79f2f13", "title": "Double High-Order Correlation Preserved Robust Multi-View Ensemble Clustering"}, {"paperId": "abf1d20cc076dcf60693405a82eb2d8f7af5b57c", "title": "An l½ and Graph Regularized Subspace Clustering Method for Robust Image Segmentation"}, {"paperId": "7d9629e1c0bedd51fdf419260c78beadcc67df47", "title": "A Tensor-Based Submodule Clustering for 2D Images Using $$l_{\\frac{1}{2}}$$-Induced Tensor Nuclear Norm Minimization"}, {"paperId": "221e5d7fa2d2fe8602c77cd69d3ed836453771f7", "title": "A Robust Tensor-Based Submodule Clustering for Imaging Data Using l12 Regularization and Simultaneous Noise Recovery via Sparse and Low Rank Decomposition Approach"}, {"paperId": "f547415972507c9f62812518b5e0bf3538faced2", "title": "Leveraging spatio-temporal features using graph neural networks for human activity recognition"}, {"paperId": "ee1bb051bb437fe3f9b9f2d0487db377dbf6e09f", "title": "A Nonconvex Low Rank and Sparse Constrained Multiview Subspace Clustering via $l_{\\frac{1}{2}}$-Induced Tensor Nuclear Norm"}, {"paperId": "a23fac1deaa89aebe659ac69255243d7435516db", "title": "A Comprehensive Tensor Framework for the Clustering of Hyperspectral Paper Data With an Application to Forensic Document Analysis"}]}
