{"paperId": "709b114cb7a9b79b97f65a5ebf9ae9000c5237c9", "publicationVenue": null, "title": "A ZEBRA Optimization Algorithm Search for Improving Localization in Wireless Sensor Network", "abstract": "Wireless sensor networks (WSNs) make use of an abundance of sensor nodes in order to gain a deeper understanding of the world around them. If the data were not gathered in an open and honest fashion, then no one would be interested in them. In military applications, for instance, the detection of opponent movement relies substantially on the placement of sensor nodes in wireless sensor networks (WSNs). Discovering the locations of all target nodes while utilizing anchor nodes is the major purpose of the localization challenge. This research suggests two adjustments that could be made to the zebra optimization algorithm (ZOA) in order to improve upon its deficiencies, one of which being its tendency to get trapped in the local optimal solution. In versions 1 and 2 of the ZOA, the exploration and exploitation components have been modified to make use of improved global and local search algorithms. In order to assess how effective, the proposed ZOA versions 1 and 2 are, a large number of simulations have been run, each with a different combination of target nodes and anchor nodes and a different number of each. In order to solve the problem of node localization, ZOA, along with a number of other attempted optimization strategies, are employed, and the outcomes obtained by each strategy are compared. Versions 1 and 2 of ZOA perform far better than its competitors in terms of the mean localization error, the number of nodes that are successfully localized, and the computation time. ZOA versions 1 and 2 are proposed, and the initial ZOA is evaluated in terms of how accurately it localizes nodes and the number of errors it generates when provided with a range of possible values for the target node and the anchor node. The simulations prove without a reasonable doubt that the suggested ZOA variation 2 performs better than both the existing ZOA and the original proposal in a variety of ways. The proposed ZOA variation 2 is superior to the proposed ZOA variation 1, ZOA, and other existing optimization methods for determining the location of a node because it performs calculations at a faster rate and has a lower mean localization error. This is due to the fact that the proposed ZOA variation 2 is based on a more accurate probability distribution.", "venue": "2022 2nd International Conference on Technological Advancements in Computational Sciences (ICTACS)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-10-10", "journal": {"name": "2022 2nd International Conference on Technological Advancements in Computational Sciences (ICTACS)", "pages": "817-824"}, "authors": [{"authorId": "47258403", "name": "A. Rana"}, {"authorId": "2187826958", "name": "Virender Khurana"}, {"authorId": "66027613", "name": "A. Shrivastava"}, {"authorId": "50098979", "name": "Durgaprasad Gangodkar"}, {"authorId": "2198497262", "name": "Deepika Arora"}, {"authorId": "2184852831", "name": "Anil Kumar Dixit"}], "citations": [{"paperId": "3a9a4c79220a5b4bd112b21dc1421f7609b57ab7", "title": "Solving the Green Economic Load Dispatch by Applying the Novel Meta-heuristic Algorithm"}, {"paperId": "e0767feed6be46e338051f8794e4b24a71a74794", "title": "Estimating the mechanical properties of high-performance concrete via automated and ensembled machine learning methods"}, {"paperId": "f9020777e9719dc6791f6846edbd14a366100d40", "title": "An Advanced Bio-Inspired Mantis Search Algorithm for Characterization of PV Panel and Global Optimization of Its Model Parameters"}]}
