{"paperId": "70a5d265c16d97b476f1eaaf5cddac01e0a2479b", "publicationVenue": {"id": "95476c30-e600-4582-aa77-bf9db261be05", "name": "International Symposium on Industrial Electronics", "type": "conference", "alternate_names": ["International Conference on Intelligence Science and Information Engineering", "ISIE", "Int Symp Ind Electron", "Int Conf Intell Sci Inf Eng"]}, "title": "Future Educational Technology with Big Data and Learning Analytics", "abstract": "In the recent years, big data and learning analytics have been emerging as fast-growing research fields. The application of these emerging research areas is gradually addressing the contemporary challenges of school and university education. Tracing out the information regarding students' misconceptions and dropping-out probabilities from the courses at the right instant of time, development of detectors of a range of educational importance and achieving the highest level of quality in the higher education are becoming more challenging. Moreover, providing well timed and the best suitable solutions to the students at-risk are even more strenuous. In this concept paper, we aim to address these contemporary challenges of school and the university education and their probable solutions by utilizing our research experiences of automated assessment, immediate feedback, learning analytics and the IT technologies. Solving such problems by knowing the history of students' activities, submissions, and the performances data is possible. The identification of students' misconceptions during the learning process, examining behavioral patterns and significant trends by efficiently aggregating and correlating the massive data, improving the state-of-the-art skills in creative thinking and innovation, and detecting the drop-outs on-time are highlighted in this article. We are aiming at extracting such knowledge so that adaptive and personalized learning will become a part of the current education system. Not only the available algorithm of supervised learning methods such as support vector machine, neural network, decision trees, discriminant analysis, and nearest neighborhood method but also new engineering and distillation of relevant data features can be carried out to solve these educational challenges.", "venue": "International Symposium on Industrial Electronics", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-06-01", "journal": {"name": "2018 IEEE 27th International Symposium on Industrial Electronics (ISIE)", "pages": "906-910"}, "authors": [{"authorId": "2482829", "name": "R. Kanth"}, {"authorId": "51027506", "name": "M. Laakso"}, {"authorId": "2857307", "name": "P. Nevalainen"}, {"authorId": "3875046", "name": "J. Heikkonen"}], "citations": [{"paperId": "82ef12e1e1cd78efcc3144ccbc020004c718d378", "title": "Resilient sustainable investment in digital education technology: A stakeholder-centric decision support model under uncertainty"}, {"paperId": "1bfbef85be7a2c5eb3d61601637b212b3742c9ac", "title": "Assessing the impact of digital education and the role of the big data analytics course to enhance the skills and employability of engineering students"}, {"paperId": "61cf8a3a10a8b3b08e483badfb26f499a6afbb7f", "title": "Predictive Model of Undergraduate Student Grading Using Machine Learning for Learning Analytics"}, {"paperId": "12a1fc12ea9aa0e75ce2e596be448c5facc8b49c", "title": "Developing a Virtual Smart Total Learning Environment for Future Teaching-Learning System"}, {"paperId": "e94c18d31d578d5557913830bc212e2801932d9f", "title": "Big Educational Data & Analytics: Survey, Architecture and Challenges"}, {"paperId": "7e9e7a3287a31ea651efa72d6636114c868f4b9e", "title": "Long Term Effects on Technology Enhanced Learning: The Use of Weekly Digital Lessons in Mathematics"}, {"paperId": "99bddafbb4b0b6a88dcc8c92251cf6f1916c02a7", "title": "Other Technology Approaches to Learning Analytics"}, {"paperId": "3a8c9b08493e068ad16ab63944a6ba67a8a7af6d", "title": "Effects of Regular Use of Scalable, Technology Enhanced Solution For Primary Mathematics Education Effects of Regular Use of Scalable, Technology Enhanced Solution for Primary Mathematics Education"}, {"paperId": "1f0a2e8e1223642843483e7f9f6f6314efd3a747", "title": "Digital Transformation of Education and Artificial Intelligence"}]}
