{"paperId": "70afbf5476f79bc57710502364977fc8bd19d153", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "VFLAIR: A Research Library and Benchmark for Vertical Federated Learning", "abstract": "Vertical Federated Learning (VFL) has emerged as a collaborative training paradigm that allows participants with different features of the same group of users to accomplish cooperative training without exposing their raw data or model parameters. VFL has gained significant attention for its research potential and real-world applications in recent years, but still faces substantial challenges, such as in defending various kinds of data inference and backdoor attacks. Moreover, most of existing VFL projects are industry-facing and not easily used for keeping track of the current research progress. To address this need, we present an extensible and lightweight VFL framework VFLAIR (available at https://github.com/FLAIR-THU/VFLAIR), which supports VFL training with a variety of models, datasets and protocols, along with standardized modules for comprehensive evaluations of attacks and defense strategies. We also benchmark 11 attacks and 8 defenses performance under different communication and model partition settings and draw concrete insights and recommendations on the choice of defense strategies for different practical VFL deployment scenario.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-10-15", "journal": {"name": "ArXiv", "volume": "abs/2310.09827"}, "authors": [{"authorId": "2258714484", "name": "Tianyuan Zou"}, {"authorId": "2258716361", "name": "Zixuan Gu"}, {"authorId": "2145050945", "name": "Yuanqin He"}, {"authorId": "2224016223", "name": "Hideaki Takahashi"}, {"authorId": "2258891827", "name": "Yang Liu"}, {"authorId": "2258714335", "name": "Guangnan Ye"}, {"authorId": "2177392354", "name": "Ya-Qin Zhang"}], "citations": [{"paperId": "b7e95253cce223cc911121e5b0cf0e2cbec55dd0", "title": "AIJack: Let's Hijack AI! Security and Privacy Risk Simulator for Machine Learning"}]}
