{"paperId": "70b5a607f487bcf26abfb4cf4c929c827ec2bcce", "publicationVenue": {"id": "6175efe8-6f8e-4cbe-8cee-d154f4e78627", "name": "Mathematics", "issn": "2227-7390", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-283014", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-283014", "https://www.mdpi.com/journal/mathematics"]}, "title": "Binary Approaches of Quantum-Based Avian Navigation Optimizer to Select Effective Features from High-Dimensional Medical Data", "abstract": "Many metaheuristic approaches have been developed to select effective features from different medical datasets in a feasible time. However, most of them cannot scale well to large medical datasets, where they fail to maximize the classification accuracy and simultaneously minimize the number of selected features. Therefore, this paper is devoted to developing an efficient binary version of the quantum-based avian navigation optimizer algorithm (QANA) named BQANA, utilizing the scalability of the QANA to effectively select the optimal feature subset from high-dimensional medical datasets using two different approaches. In the first approach, several binary versions of the QANA are developed using S-shaped, V-shaped, U-shaped, Z-shaped, and quadratic transfer functions to map the continuous solutions of the canonical QANA to binary ones. In the second approach, the QANA is mapped to binary space by converting each variable to 0 or 1 using a threshold. To evaluate the proposed algorithm, first, all binary versions of the QANA are assessed on different medical datasets with varied feature sizes, including Pima, HeartEW, Lymphography, SPECT Heart, PenglungEW, Parkinson, Colon, SRBCT, Leukemia, and Prostate tumor. The results show that the BQANA developed by the second approach is superior to other binary versions of the QANA to find the optimal feature subset from the medical datasets. Then, the BQANA was compared with nine well-known binary metaheuristic algorithms, and the results were statistically assessed using the Friedman test. The experimental and statistical results demonstrate that the proposed BQANA has merit for feature selection from medical datasets.", "venue": "Mathematics", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-08-04", "journal": {"name": "Mathematics"}, "authors": [{"authorId": "1401905662", "name": "Mohammad-Hossein Nadimi-Shahraki"}, {"authorId": "113416372", "name": "A. Fatahi"}, {"authorId": "2066035671", "name": "Hoda Zamani"}, {"authorId": "2144459216", "name": "Seyedali Mirjalili"}], "citations": [{"paperId": "21090f812b432980ae15ad6144f62bcd7fce8978", "title": "A binary hybrid sine cosine white shark optimizer for feature selection"}, {"paperId": "dbf5a4027d9c38727fd6e15e198b0a58a01675ab", "title": "An evolutionary crow search algorithm equipped with interactive memory mechanism to optimize artificial neural network for disease diagnosis"}, {"paperId": "30873da0bb06089cd08035710aa329a292151e70", "title": "Quantum-inspired meta-heuristic approaches for a constrained portfolio optimization problem"}, {"paperId": "25e575456b5d1b72fd15e278d7862139ef37ad2f", "title": "Enhanced chimp hierarchy optimization algorithm with adaptive lens imaging for feature selection in data classification"}, {"paperId": "cbc73d4c2cde132fecf6d9a5a01f28801e3020dc", "title": "Hyperbolic Sine Optimizer: a new metaheuristic algorithm for high performance computing to address computationally intensive tasks"}, {"paperId": "2b006ac3ca495781766b4415201b1cc7175d202e", "title": "Binary Peacock Algorithm: A Novel Metaheuristic Approach for Feature Selection"}, {"paperId": "00b7900833141f33b3e90ed023824a28b1c13a02", "title": "A Critical Review of Moth-Flame Optimization Algorithm and Its Variants: Structural Reviewing, Performance Evaluation, and Statistical Analysis"}, {"paperId": "916da226be9f01ee5dce157f51bee5c27872969f", "title": "A Systematic Review of Applying Grey Wolf Optimizer, its Variants, and its Developments in Different Internet of Things Applications"}, {"paperId": "9c6728a66fdec0779287dd168d642cca0227e120", "title": "A self-adaptive attraction and repulsion-based naked mole-rat algorithm for energy-efficient mobile wireless sensor networks"}, {"paperId": "b54d049d935ed5995a7e26dc5c5d6da2a01e0d2b", "title": "Horizontal crossover and co-operative hunting-based Whale Optimization Algorithm for feature selection"}, {"paperId": "0bd0db6edceadcdfc3a103a1a56d32647fe6b02f", "title": "An improved binary grey wolf optimizer for constrained engineering design problems"}, {"paperId": "c6e67a5d8f4f5cec86f8dd652324ff79009001ac", "title": "An Improved Binary Quantum-based Avian Navigation Optimizer Algorithm to Select Effective Feature Subset from Medical Data: A COVID-19 Case Study"}, {"paperId": "0d566b9f9f3b49bb77cf81c83cfb8400d8d356f1", "title": "A multi-objective mutation-based dynamic Harris Hawks optimization for botnet detection in IoT"}, {"paperId": "dbafce1fcc6c91d9fc3452af30a33332d3eb0eda", "title": "Fault prognosis of subsurface safety valve system with limited real data using self-adaptive neural network"}, {"paperId": "534727d19621b275bed0cd6e9a69b33b61284497", "title": "A ReliefF guided binary equalization optimizer based on Z-type and reverse Z-type transfer functions for feature selection"}, {"paperId": "d9a93fb605d40a19d8a37fe08698dd7681f41006", "title": "An Effective Imputation Method Using Data Enrichment for Missing Data of Loop Detectors in Intelligent Traffic Control Systems"}, {"paperId": "c80961a3566c1058e8d7059444aa43414ae428da", "title": "BE-GWO: Binary extremum-based grey wolf optimizer for discrete optimization problems"}, {"paperId": "fa374ae71493520396ff3f69945aa691b399b74a", "title": "A Systematic Review of the Whale Optimization Algorithm: Theoretical Foundation, Improvements, and Hybridizations"}, {"paperId": "e0419c9cad7cba112ea6603a99785ac6778d6c1f", "title": "A comprehensive comparison of accuracy-based fitness functions of metaheuristics for feature selection"}, {"paperId": "bfbd56ce903ed6b899a99430f17d7f097f9fe78c", "title": "Memory-Based Sand Cat Swarm Optimization for Feature Selection in Medical Diagnosis"}, {"paperId": "f33601b94703f909529dae9e17448a224ab79c03", "title": "A Review of Quantum-Inspired Metaheuristic Algorithms for Automatic Clustering"}, {"paperId": "8d3f1ebb59d1d4988a6e9110d90e465777932634", "title": "A Chaotic-Based Interactive Autodidactic School Algorithm for Data Clustering Problems and Its Application on COVID-19 Disease Detection"}, {"paperId": "ee849e942c4d2087063a76853453dc8f1abfd1f5", "title": "A novel binary greater cane rat algorithm for feature selection"}, {"paperId": "48bc02a5fe8ac664e96eb6d1a15a61d64d770cb1", "title": "A Quantum-Based Beetle Swarm Optimization Algorithm for Numerical Optimization"}, {"paperId": "b35e36839676bd24c2ec1548ed9436b8d13ffd80", "title": "An Effective Hybridization of Quantum-based Avian Navigation and Bonobo Optimizers to Solve Numerical and Mechanical Engineering Problems"}, {"paperId": "da6e5b7f21dcf03507ee2f46ae89636f9259471a", "title": "MFO-SFR: An Enhanced Moth-Flame Optimization Algorithm Using an Effective Stagnation Finding and Replacing Strategy"}, {"paperId": "82727c26dbe626961735555d1a4645df9f17173d", "title": "Improved slime mould algorithm based on hybrid strategy optimization of Cauchy mutation and simulated annealing"}, {"paperId": "31d44f972088c23df3ae8828f90043ac27d80282", "title": "Binary Starling Murmuration Optimizer Algorithm to Select Effective Features from Medical Data"}, {"paperId": "c73d7c21a0398b3d8f8a40e40de0128a6a27cc16", "title": "A novel Q-learning algorithm based on improved whale optimization algorithm for path planning"}, {"paperId": "0ccadfc060c708d8f909ec26c9a53488dd2be223", "title": "Binary dwarf mongoose optimizer for solving high-dimensional feature selection problems"}, {"paperId": "660c47250c8d6b4cda66b073bd08b8c4763c6c55", "title": "A New Lagrangian Problem Crossover: A Systematic Review and Meta-Analysis of Crossover Standards"}]}
