{"paperId": "70c0ea577a80aaca8ecf08af36850654e88b387f", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Erasmus Staff Mobility in the Building of a European Network: The Case of a Central European University", "abstract": "Globalization now applies to almost all aspects of life, and it also applies to the world of science. Internationalisation and interdisciplinarity are fundamental determinants of modern research and education. The foremost factor of functioning in the international world of science is the mobility of students and scientists. Considering this context, the objective of this study was to analyse the staff mobility for teaching under the Erasmus+ programme at the Wrocław University of Environmental and Life Sciences (UPWr). The research took into account the mobility of staff for teaching (STA) within the period of the academic years from 2009/2010 to 2020/2021. The methodological approach applied in this study is based on the concept of mobility network analysis and mobility flows. The geo-visualization was prepared with the use of a spider diagram. Using this approach, the connections between spatial locations and domains of scientific activity were analysed. The results show that the mobility flow at UPWr rose significantly after the authorities of the university decided to increase the funding for STA, and eventually was slowed down by the outbreak of the COVID-19 pandemic. Moreover, the findings in the geographical aspect show that there were two main regions of destination, which were the Iberian Peninsula and the closest neighbouring countries, where the predominant institutions could be observed. The most mobile group of teachers were the ones representing environment sciences. The STA flow is not reflected in the students’ mobility flow. COVID-19 has enhanced the virtual component of learning, resulting in the strengthening of the blended mobility model.", "venue": "Sustainability", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": null, "publicationDate": "2022-04-20", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "2163243128", "name": "Krzysztof Kafarski"}, {"authorId": "152447859", "name": "J. Kazak"}], "citations": [{"paperId": "0d99779b8ceeb2f847c995ed61bc5ce31f063dfc", "title": "Geovisualization: A Practical Approach for COVID-19 Spatial Analysis"}, {"paperId": "8e4f286bf10c73841585f43e4eb0f372df3113ad", "title": "Exploring Perspectives and Expectations of Undergraduate, and Postgraduate Students toward the Erasmus+ Program between Mogadishu University and Turkish Universities"}, {"paperId": "69de6be83f6dca97da1ae6ae64a256950ec9fa57", "title": "Use of an e-toolkit in the development of digital competencies in Weeks of International Teaching"}, {"paperId": "67fbe19270d3adcdc91ec0ae5827890b369d967a", "title": "TQM and SDGs for Erasmus+ Programme—Quality Education, Reducing Inequalities, Climate Change, Peace and Justice"}, {"paperId": "cad2c813a25866c5314bfa19c0ea26aa5ca1d772", "title": "Ensuring sustainability in internationalisation efforts at higher education institutions"}]}
