{"paperId": "70c1d29142a4aeff8aeef2781ac1583f790acd42", "publicationVenue": {"id": "804fd380-52e4-4dad-9650-b3106b8ed31b", "name": "International Conference on Electrical Engineering and Information Communication Technology", "type": "conference", "alternate_names": ["ICEEICT", "Int Conf Electr Eng Inf Commun Technol"]}, "title": "IFC_Health: Three-Layer Integrated Framework for Secure Smart Healthcare System", "abstract": "The Internet of Things (IoT) is a model that allows objects to monitor and collect data from their surroundings and then transmit that data over the Internet to be evaluated and used for various purposes. Healthcare is one of the IoT application fields that has attracted much attention from industry, academia, and government. The rise of IoT, fog and cloud computing in the medical sector enhances patient safety, staff happiness, and operational efficiency. A three-layer integrated framework for a secure, intelligent healthcare system is proposed in this research. The first layer is the IoT layer, which acquires and transmits healthcare data. The IoT layer uses healthcare embedded sensors and wearable's to communicate to exchange sensitive data with an aggregating node, which can then share data with the Fog server. The second layer is the Fog layer, which retrieves the measured value from the IoT layer and saves them in a local repository. Ensemble learning is used in the Fog layer to forecast diabetes and stroke problems. The third layer is the Cloud layer which provides secure data storage and access control for a smart healthcare system. For fine-grained data access, security, authentication, and user privacy of medical data, the cloud layer use hash-based ciphertext policy attribute-based encryption with signature. The suggested work's performance is tested for each layer using a different set of parameters, and the combination of Io'T, Fog, and Cloud improves the healthcare system's efficiency.", "venue": "International Conference on Electrical Engineering and Information Communication Technology", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-02-16", "journal": {"name": "2022 First International Conference on Electrical, Electronics, Information and Communication Technologies (ICEEICT)", "pages": "1-7"}, "authors": [{"authorId": "1992914389", "name": "Priyanka kumari Bhansali"}, {"authorId": "87076071", "name": "Dilendra Hiran"}], "citations": [{"paperId": "cea9b03698ae20b40b46b57e1529e2426a8eda41", "title": "IoT-Based Smart Air Conditioner as a Preventive in the Post-COVID-19 Era: A Review"}]}
