{"paperId": "70c4449bba692c06c2b39d10e0b75dd325c23b99", "publicationVenue": {"id": "03e270f3-9983-44e1-9d91-754044085687", "name": "International Conference on Climate Informatics", "type": "conference", "alternate_names": ["CI", "Comput Intell", "Computational Intelligence", "Int Conf Clim Informatics", "International Workshop Climate Informatics", "Computational intelligence", "Int Workshop Clim Informatics", "Comput intell"], "issn": "0824-7935", "url": "http://www.wiley.com/WileyCDA/WileyTitle/productCd-COIN.html", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/14678640"]}, "title": "Adaptive transfer learning in deep neural networks: Wind power prediction using knowledge transfer from region to region and between different task domains", "abstract": "Transfer learning (TL) in deep neural networks is gaining importance because, in most of the applications, the labeling of data is costly and time consuming. Additionally, TL also provides an effective weight initialization strategy for deep neural networks. This paper introduces the idea of adaptive TL in deep neural networks (ATL‐DNN) for wind power prediction. Specifically, we show in case of wind power prediction that adaptive TL of the deep neural networks system can be adaptively modified as regards training on a different wind farm is concerned. The proposed ATL‐DNN technique is tested for short‐term wind power prediction, where continuously arriving information has to be exploited. Adaptive TL not only helps in providing good weight initialization, but also in utilizing the incoming data for effective learning. Additionally, the proposed ATL‐DNN technique is shown to transfer knowledge between different task domains (wind power to wind speed prediction) and from one region to another region. The simulation results show that the proposed ATL‐DNN technique achieves average values of 0.0637, 0.0986, and 0.0984 for the mean absolute error, root mean squared error, and standard deviation error, respectively.", "venue": "International Conference on Climate Informatics", "year": 2018, "fieldsOfStudy": ["Computer Science", "Mathematics"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-10-30", "journal": {"name": "Computational Intelligence", "pages": "1088 - 1112", "volume": "35"}, "authors": [{"authorId": "8852220", "name": "Aqsa Saeed Qureshi"}, {"authorId": "2108486220", "name": "Asifullah Khan"}], "citations": [{"paperId": "23648d1a83211f6121cfdcca5dd64d4e9fc1f9ae", "title": "Online transfer learning-based residential demand response potential forecasting for load aggregator"}, {"paperId": "b7fb517bb9bfec4e9301228694cfa93018fb5304", "title": "Multi-Task Representation Learning for Renewable-Power Forecasting: A Comparative Analysis of Unified Autoencoder Variants and Task-Embedding Dimensions"}, {"paperId": "c80c32e18330da97297e052b8eac9d866988fec4", "title": "Small-Sample Solar Power Interval Prediction Based on Instance-Based Transfer Learning"}, {"paperId": "44f557462ef09dfdacc7e5079550a7819af3deef", "title": "Transfer Learning for Renewable Energy Systems: A Survey"}, {"paperId": "07b02fbb97c2bf84a31aaa7ba13d6850c197dab0", "title": "Deep Learning for Variable Renewable Energy: A Systematic Review"}, {"paperId": "c462888053dcdc2e55a9b62a42346c752e309f33", "title": "Homogenized Point Mutual Information and Deep Quantum Reinforced Wind Power Prediction"}, {"paperId": "2ef2e718060a3e43db638d14e4c3dfe8306825fc", "title": "Short-term Interval Prediction of Wind Speed Using LSTM with Improved Grid Search"}, {"paperId": "819477a163ad79a16b5273841373ab8a65df3c9b", "title": "Task Embedding Temporal Convolution Networks for Transfer Learning Problems in Renewable Power Time Series Forecast"}, {"paperId": "dd3e32f466bbbfc683cd977ca0a10dbb2653780b", "title": "Model selection, adaptation, and combination for transfer learning in wind and photovoltaic power forecasts"}, {"paperId": "107285b3927a9e177dc45a3f97528f23624c7989", "title": "AI Tool with Active Learning for Detection of Rural Roadside Safety Features"}, {"paperId": "65ce5268b1718cb108b2646aa07a5cb62e5131ba", "title": "Transfer learning in demand response: A review of algorithms for data-efficient modelling and control"}, {"paperId": "d6efb8aa401c5fbbce4b93dc6fb7fce2d6fb7f33", "title": "Analytics and Big Data in the Health Domain"}, {"paperId": "a0837cccddc4d229800717d79a5694d3e0dab0c6", "title": "Short Term Renewable Energy Forecasting with Deep Learning Neural Networks"}, {"paperId": "f4db6ecf7d3ecca251398eb015c80a3d381bb068", "title": "Segmentation of shoulder muscle MRI using a new Region and Edge based Deep Auto-Encoder"}, {"paperId": "a2bafa550aec370f2c05011c356c4fcc4df4bc61", "title": "Application of a hybrid neural network structure for FWD backcalculation based on LTPP database"}, {"paperId": "48dba8830df54540c432dae7f60774cf225b05cc", "title": "Classification and Region Analysis of COVID-19 Infection using Lung CT Images and Deep Convolutional Neural Networks"}, {"paperId": "f65d49a087747ed0d7245f3823ae0088fb5ea317", "title": "Improving machine learning-based weather forecast 1 post-processing with clustering and transfer learning"}, {"paperId": "0c26908a805d60bdf6b25ae96077827dd777e46b", "title": "Wind Speed Prediction using Deep Ensemble Learning with a Jet-like Architecture"}, {"paperId": "acba75f0a846107dd78443a7e46415adfa51b461", "title": "Convolutional Neural Network based on Transfer Learning for Medical Forms Classification 34"}, {"paperId": "d806e5d6d4379263672b929b75f09a84fddd5ebe", "title": "Transfer Learning and Meta Classification Based Deep Churn Prediction System for Telecom Industry"}, {"paperId": "8452941a175c899628c679523da952b18f63e335", "title": "A survey of the recent architectures of deep convolutional neural networks"}, {"paperId": "1018d48741361e249b7f35532ca52c63cb9cc0ce", "title": "Design of Neural Network Based Wind Speed Prediction Model Using GWO"}]}
