{"paperId": "70d5ea1a8d2408dcdbdae3d713874f28d70bdd6a", "publicationVenue": null, "title": "HDFS File Formats: Study and Performance Comparison", "abstract": "The distributed system Hadoop has become very popular for storing and process large amounts of data (Big Data). As it is composed of many machines, its file system, called HDFS (Hadoop Distributed File System), is also distributed. But as HDFS is not a traditional storage system, plenty of new file formats have been developed, to take advantage of its features. In this work we study that new formats to find out their characteristics, and being able to decide which ones can be better knowing the needs of our data. For that goal, we have made a theoretical framework to compare them, and easily recognize which formats fit our needs. Also we have made an experimental study to find out how the formats work in some specific situations, selecting two very different datasets and a set of simple queries, resolved with MapReduce jobs, written with Java or run using Hive tool. The final goal of this work is to be able to identify the different strengths and weakenesses of the file formats.", "venue": "", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": null, "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "2071288999", "name": "Álvaro Alonso Isla"}], "citations": [{"paperId": "7d2bada89453fea9e5e4a37dc21a9bd50951cbc3", "title": "A Benchmark for Suitability of Alluxio over Spark"}, {"paperId": "77967fcf7b93ad999c61fb771c23ba82e4590421", "title": "Explorando paralelismo em big data no processamento de séries temporais de imagens de sensoriamento remoto"}, {"paperId": "20b1cebbd515c20ff7a16db5609e42b5b2260374", "title": "Embedding Indices and Bloom Filters in Parquet files for Fast Apache Arrow Retrievals"}, {"paperId": "84cd7df443b31c60a839ade61cec9f2607ae7281", "title": "SmarT: Uso de Aprendizado de Máquina para Filtragem e Recuperação Eficiente de Dados Espaciais e Temporais em Big Data"}]}
