{"paperId": "70d71af0705a484928fd9b8189ca331b57c8d188", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Enhancing Data Lakes with GraphAr: Efficient Graph Data Management with a Specialized Storage Scheme", "abstract": "Data lakes, increasingly adopted for their ability to store and analyze diverse types of data, commonly use columnar storage formats like Parquet and ORC for handling relational tables. However, these traditional setups fall short when it comes to efficiently managing graph data, particularly those conforming to the Labeled Property Graph (LPG) model. To address this gap, this paper introduces GraphAr, a specialized storage scheme designed to enhance existing data lakes for efficient graph data management. Leveraging the strengths of Parquet, GraphAr captures LPG semantics precisely and facilitates graph-specific operations such as neighbor retrieval and label filtering. Through innovative data organization, encoding, and decoding techniques, GraphAr dramatically improves performance. Our evaluations reveal that GraphAr outperforms conventional Parquet and Acero-based methods, achieving an average speedup of $3283\\times$ for neighbor retrieval, $6.0\\times$ for label filtering, and $29.5\\times$ for end-to-end workloads. These findings highlight GraphAr's potential to extend the utility of data lakes by enabling efficient graph data management.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-15", "journal": {"name": "ArXiv", "volume": "abs/2312.09577"}, "authors": [{"authorId": "2155784160", "name": "Xue Li"}, {"authorId": "2274944066", "name": "Weibin Zeng"}, {"authorId": "2274942397", "name": "Zhibin Wang"}, {"authorId": "2275761217", "name": "Diwen Zhu"}, {"authorId": "2724949", "name": "Jingbo Xu"}, {"authorId": "2275047599", "name": "Wenyuan Yu"}, {"authorId": "2239750410", "name": "Jingren Zhou"}], "citations": []}
