{"paperId": "70e89bdfd0d6a4c981a2f027a78e5452fa1d0fd9", "publicationVenue": {"id": "12fff95b-d469-49a0-84a5-4fd4696c3f28", "name": "Knowledge-Based Systems", "type": "journal", "alternate_names": ["Knowl Based Syst", "Knowledge Based Systems", "Knowledge-based Syst"], "issn": "0950-7051", "url": "http://www.elsevier.com/wps/find/journaldescription.cws_home/525448/description#description", "alternate_urls": ["https://www.journals.elsevier.com/knowledge-based-systems", "http://www.sciencedirect.com/science/journal/09507051"]}, "title": "Big data time series forecasting based on nearest neighbours distributed computing with Spark", "abstract": null, "venue": "Knowledge-Based Systems", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-12-01", "journal": {"name": "Knowl. Based Syst.", "pages": "12-25", "volume": "161"}, "authors": [{"authorId": "1410654107", "name": "Ricardo L. Talavera-Llames"}, {"authorId": "1410614321", "name": "R. Pérez-Chacón"}, {"authorId": "6352591", "name": "A. T. Lora"}, {"authorId": "1397728402", "name": "F. Martínez-Álvarez"}], "citations": [{"paperId": "ce99a1f4ef89e8376009de5492e413c282a07a70", "title": "Pattern sequence-based algorithm for multivariate big data time series forecasting: Application to electricity consumption"}, {"paperId": "d21fca40744d877f9ebcbdec618a4d1aaef4d586", "title": "A Comparative Study on Predication of Appropriate Mechanical Ventilation Mode through Machine Learning Approach"}, {"paperId": "68b6843ee83379ead4755b4d0e4e2e5f5331e5a0", "title": "A comprehensive review of cyber-attacks and defense mechanisms for improving security in smart grid energy systems: Past, present and future"}, {"paperId": "90049ee3057e3d8c137fb8401afe098774792ce6", "title": "Using ARIMA to Predict the Growth in the Subscriber Data Usage"}, {"paperId": "42b0789cadbf7af3f7b00db266afd321ee418a93", "title": "Deep Learning-Assisted Short-Term Power Load Forecasting Using Deep Convolutional LSTM and Stacked GRU"}, {"paperId": "ccae54178a7141c741a1fb14129ddea6a5dd390c", "title": "Divide and Conquer: 3D Point Cloud Instance Segmentation With Point-Wise Binarization"}, {"paperId": "4fbffca122301fc918f9a609492755f9f8b37bef", "title": "FCM Clustering on Interaction Pattern Analysis of Chinese Language Learner Behavior"}, {"paperId": "841fa9108ede7cecd8f27ffa96e240844aef48f5", "title": "Integration and Optimization of British and American Literature Information Resources in the Distributed Cloud Computing Environment"}, {"paperId": "4242e70014a8179f57b9d8aba5de9e9b620e2377", "title": "A new PM2.5 forecasting model based on data preprocessing, reinforcement learning and gated recurrent unit network"}, {"paperId": "8a38f55981e2b140aa6625f12736c0f2c9c4fad2", "title": "Deep learning with small and big data of symmetric volatility information for predicting daily accuracy improvement of JKII prices"}, {"paperId": "082439c986601ed52cf8de0ad1eebd384caf2a96", "title": "Design of Rural Human Resource Management Platform Integrating IoT and Cloud Computing"}, {"paperId": "1d8d84e1c3c0793a58f042e0c3637c88c1705083", "title": "A deep LSTM network for the Spanish electricity consumption forecasting"}, {"paperId": "33fe25695f9735255c922449da5f5b0e64eb4652", "title": "Advanced traffic congestion early warning system based on traffic flow forecasting and extenics evaluation"}, {"paperId": "2a46856545c80205fe21dd8a9b0d4e108cd93a23", "title": "A new hybrid method for predicting univariate and multivariate time series based on pattern forecasting"}, {"paperId": "46528ff544390cd8fffcdc992cae7ec317907095", "title": "A novel extreme learning machine based kNN classification method for dealing with big data"}, {"paperId": "c6ce9143c9ef01829a3eb7c506619a4d075eb1ce", "title": "Accurate Demand Forecasting: A Flexible and Balanced Electric Power Production Big Data Virtualization Based on Photovoltaic Power Plant"}, {"paperId": "9b72a73687ae08ec78207a96049b81c572fa4b32", "title": "Imputing sentiment intensity for SaaS service quality aspects using T-nearest neighbors with correlation-weighted Euclidean distance"}, {"paperId": "13ef01605929b927687913d4af0abaf0eb2cdb7f", "title": "Ultra-short-term forecasting for photovoltaic power plants and real-time key performance indicators analysis with big data solutions. Two case studies - PV Agigea and PV Giurgiu located in Romania"}, {"paperId": "c111b8ec63162353b60610cf3064b6ad94317576", "title": "Hybridizing Deep Learning and Neuroevolution: Application to the Spanish Short-Term Electric Energy Consumption Forecasting"}, {"paperId": "58ffb0d6341c365fae22b355c4e4ab0c6bce4501", "title": "Distributed ARIMA models for ultra-long time series"}, {"paperId": "82bde72dcb60f31b62c4a84798c278faf1d0500d", "title": "Big data time series forecasting based on pattern sequence similarity and its application to the electricity demand"}, {"paperId": "50946207bdf83ad969dbd8751f646ce3a77359be", "title": "Automated Deployment of a Spark Cluster with Machine Learning Algorithm Integration"}, {"paperId": "9a2b50d8ac4af1f3343aed4ee0f7ed4495c7b412", "title": "Fast and Scalable Approaches to Accelerate the Fuzzy k-Nearest Neighbors Classifier for Big Data"}, {"paperId": "89dce85048a0a534666a41f459a5fc0972ccbc61", "title": "Stability of Multiple Seasonal Holt-Winters Models Applied to Hourly Electricity Demand in Spain"}, {"paperId": "a576dfa3921548067e1d084bd64ebf239dcc30db", "title": "An Efficient Network Method for Time Series Forecasting Based on the DC Algorithm and Visibility Relation"}, {"paperId": "c8d6f45e91cb22b986a72fa3ecd03c9c83ea7ac6", "title": "Distributed multi-label feature selection using individual mutual information measures"}, {"paperId": "8f30f54f52c6a0fc313bbbc8c9bb7a6880603373", "title": "A REST Framework on IoT Streams using Apache Spark for Smart Cities"}, {"paperId": "f7bd30395650f3e48892ad8bc71888680c5fa7ee", "title": "Parallelization implementation of Bayesian algorithms based on Spark platform"}, {"paperId": "d1088cb85ddfabf95e8132dbe482fd40d3aff8c3", "title": "Enhancement of a Short-Term Forecasting Method Based on Clustering and kNN: Application to an Industrial Facility Powered by a Cogenerator"}, {"paperId": "3018f42e3cfb21bd29c8444461e4e2e15a1ffb79", "title": "Performance Evaluation of Machine Learning Classifiers for Stock Market Prediction in Big Data Environment"}, {"paperId": "7bce19e9f9bd23559c828f0b357b6bcee5aba46f", "title": "Multi-task and multi-view learning based on particle swarm optimization for short-term traffic forecasting"}, {"paperId": "634a656e1d25022d90dc44b6b5e62e1273db24bc", "title": "Big Data Forecasting Applied Nearest Neighbor Method"}, {"paperId": "0e5b51c59ae8bdf96e62ddb148c473f11e2521de", "title": "Application of the Weighted K-Nearest Neighbor Algorithm for Short-Term Load Forecasting"}, {"paperId": "f2d4d24505c43e6e093cf400744c0f8308d14bbe", "title": "Time-Series Prediction of Iron and Silicon Content in Aluminium Electrolysis Based on Machine Learning"}, {"paperId": "5e4cd42c8a593a0c89e69dee7d2eb5a0bb082f09", "title": "Time series forecasting based on complex network in weighted node similarity"}, {"paperId": "0747e5583e27387734581615f74034d69bc43516", "title": "Cooperative multi-agent actor-critic control of traffic network flow based on edge computing"}, {"paperId": "eb0fad7a85f815aa00b5899fc99d89d464512afb", "title": "Nearest Neighbors-Based Forecasting for Electricity Demand Time Series in Streaming"}, {"paperId": "d5a4a50016c38561d91e156d7468cd4cdd730113", "title": "A Novel Configuration Tuning Method Based on Feature Selection for Hadoop MapReduce"}, {"paperId": "b908d70ab3688364e59b31afbc0988d77903e70f", "title": "Cooperative Design, Visualization, and Engineering: 17th International Conference, CDVE 2020, Bangkok, Thailand, October 25–28, 2020, Proceedings"}, {"paperId": "4b7af0b1ce02b9539ab4a4c5b15b65ce2d2a5300", "title": "Clustering of Time-Series Balance History Data Streams Using Apache Spark"}]}
