{"paperId": "70ef97d30c7318dd3d64a7f99aa833811b9531ac", "publicationVenue": {"id": "6336131c-2f71-4f61-bc3b-1bf31ec9fa3d", "name": "International Conference on Computing for Sustainable Global Development", "type": "conference", "alternate_names": ["INDIACom", "Int Conf Comput Sustain Glob Dev"]}, "title": "Ecosystem of Technologies for Smart Agriculture to Improve the Efficiency and Profitability of Indian Farmers", "abstract": "An increasing population demands more food, but the available resources are shrinking. The agriculture sector in India is facing several challenges such as climate change, water scarcity, soil degradation, and declining farm profitability. To address these challenges, there is a growing need for the adoption of smart agriculture practices that leverage technology. This paper presents an overview of the ecosystem of technologies for smart agriculture and their potential to improve the efficiency and profitability of Indian farmers. The paper explores the role of various technologies such as precision agriculture, IoT, artificial intelligence, drones, and robotics in improving crop yields, reducing input costs, and enhancing overall farm management. Additionally, the paper discusses the challenges that need to be overcome to ensure the successful adoption of smart agriculture technologies in India. These include the lack of awareness and access to technology, inadequate infrastructure, and limited availability of financing. The paper concludes that the ecosystem of technologies for smart agriculture holds significant promise for Indian farmers to overcome the challenges and improve the efficiency and profitability of their farms.", "venue": "International Conference on Computing for Sustainable Global Development", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference", "Review"], "publicationDate": "2023-03-15", "journal": {"name": "2023 10th International Conference on Computing for Sustainable Global Development (INDIACom)", "pages": "1442-1449"}, "authors": [{"authorId": "2139658927", "name": "Urvashi Sugandh"}, {"authorId": "2137952492", "name": "Swati Nigam"}, {"authorId": "2184652", "name": "Manju Khari"}], "citations": [{"paperId": "5db87e498e403d905847e417d6eba7f2e067f709", "title": "Multiclass Classification of Cereals Using Artificial Neural Network"}, {"paperId": "5580975e97891d3701286ac9f29932fa03952e86", "title": "A Bibliometric Analysis of the Evolution of State-of-the-Art Blockchain Technology (BCT) in the Agrifood Sector from 2014 to 2022"}]}
