{"paperId": "70f6a5d25eef16fa3936966c202e6604480bd541", "publicationVenue": {"id": "4bdc30a8-ea3d-459c-b5d3-9e8a34726ab3", "name": "Euromicro Conference on Real-Time Systems", "type": "conference", "alternate_names": ["ECRTS", "Euromicro Conf Real-time Syst"], "url": "http://www.ecrts.org/"}, "title": "Consensual Resilient Control: Stateless Recovery of Stateful Controllers", "abstract": "Safety-critical systems have to absorb accidental and malicious faults to obtain high mean-times-to-failures (MTTFs). Traditionally, this is achieved through re-execution or replication. However, both techniques come with significant overheads, in particular when cold-start effects are considered. Such effects occur after replicas resume from checkpoints or from their initial state. This work aims at improving on the performance of control-task replication by leveraging an inherent stability of many plants to tolerate occasional control-task deadline misses and suggests masking faults just with a detection quorum. To make this possible, we have to eliminate cold-start effects to allow replicas to rejuvenate during each control cycle. We do so, by systematically turning stateful controllers into instants that can be recovered in a stateless manner. We highlight the mechanisms behind this transformation, how it achieves consensual resilient control, and demonstrate on the example of an inverted pendulum how accidental and maliciously-induced faults can be absorbed, even if control tasks run in less predictable environments", "venue": "Euromicro Conference on Real-Time Systems", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": null, "journal": {"pages": "14:1-14:27"}, "authors": [{"authorId": "47562496", "name": "A. Matovic"}, {"authorId": "2248425", "name": "R. Graczyk"}, {"authorId": "50361382", "name": "Federico Lucchetti"}, {"authorId": "1720944", "name": "M. Völp"}], "citations": [{"paperId": "447def82d36aa9da2396e3919f54654654221781", "title": "Proximal Byzantine Consensus"}, {"paperId": "e52b0d55b78110b146ddabc73173f60d941c4a6d", "title": "35th Euromicro Conference on Real-Time Systems, ECRTS 2023, July 11-14, 2023, Vienna, Austria"}]}
