{"paperId": "70ff590afb12ea737ce4a54e4ad8eea0e170e2b7", "publicationVenue": {"id": "3096eb5c-d18c-4877-94cd-28edd3a9c357", "name": "International Journal of Environmental Research and Public Health", "type": "journal", "alternate_names": ["Int J Environ Res Public Health"], "issn": "1660-4601", "url": "http://www.mdpi.com/journal/ijerph/"}, "title": "Landslide Susceptibility Assessment Using an AutoML Framework", "abstract": "The risks associated with landslides are increasing the personal losses and material damages in more and more areas of the world. These natural disasters are related to geological and extreme meteorological phenomena (e.g., earthquakes, hurricanes) occurring in regions that have already suffered similar previous natural catastrophes. Therefore, to effectively mitigate the landslide risks, new methodologies must better identify and understand all these landslide hazards through proper management. Within these methodologies, those based on assessing the landslide susceptibility increase the predictability of the areas where one of these disasters is most likely to occur. In the last years, much research has used machine learning algorithms to assess susceptibility using different sources of information, such as remote sensing data, spatial databases, or geological catalogues. This study presents the first attempt to develop a methodology based on an automatic machine learning (AutoML) framework. These frameworks are intended to facilitate the development of machine learning models, with the aim to enable researchers focus on data analysis. The area to test/validate this study is the center and southern region of Guerrero (Mexico), where we compare the performance of 16 machine learning algorithms. The best result achieved is the extra trees with an area under the curve (AUC) of 0.983. This methodology yields better results than other similar methods because using an AutoML framework allows to focus on the treatment of the data, to better understand input variables and to acquire greater knowledge about the processes involved in the landslides.", "venue": "International Journal of Environmental Research and Public Health", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-10-01", "journal": {"name": "International Journal of Environmental Research and Public Health", "volume": "18"}, "authors": [{"authorId": "2134170275", "name": "Adrián G. Bruzón"}, {"authorId": "1403612817", "name": "Patricia Arrogante-Funes"}, {"authorId": "2134230145", "name": "Fátima Arrogante-Funes"}, {"authorId": "1405767782", "name": "F. Martín-González"}, {"authorId": "14858358", "name": "C. Novillo"}, {"authorId": "2150036053", "name": "Rubén R Fernández"}, {"authorId": "1403612763", "name": "René Vázquez-Jiménez"}, {"authorId": "1413572666", "name": "A. Alarcón-Paredes"}, {"authorId": "1413585667", "name": "G. A. Alonso-Silverio"}, {"authorId": "2134169493", "name": "Claudia A. Cantú-Ramírez"}, {"authorId": "1403612818", "name": "Rocío N. Ramos-Bernal"}], "citations": [{"paperId": "af482f564121e0049164143d652397296865775e", "title": "Assessment of large-scale multiple forest disturbance susceptibilities with AutoML framework: an Izmir Regional Forest Directorate case"}, {"paperId": "6c43c6b0e688164e950f90239974fe0f66cc8286", "title": "Landslide susceptibility assessment of South Korea using stacking ensemble machine learning"}, {"paperId": "7911d40ddfd9f00a9eb0b97922d5cd6e6b85380b", "title": "Enhancing Landslide Vulnerability Mapping Through Automated Fuzzy Logic Algorithm-Based Methodology"}, {"paperId": "7c09abc7874c05148836e2284f513f4fe1792d00", "title": "Modeling and Evaluation of the Susceptibility to Landslide Events Using Machine Learning Algorithms in the Province of Chañaral, Atacama Region, Chile"}, {"paperId": "d8dc488771e603d976c61e873b956155169b56d1", "title": "Assessment of the regeneration of landslides areas using unsupervised and supervised methods and explainable machine learning models"}, {"paperId": "88eec1ec6f76734a054d0ec4cdd465163aaa1b22", "title": "Spatio-Temporal Distribution and Trends of Major Agricultural Crops in Romania Using Interactive Geographic Information System Mapping"}, {"paperId": "0330433af3410baebe1288b4dccbc7825e860444", "title": "A novel QLattice‐based whitening machine learning model of landslide susceptibility mapping"}, {"paperId": "4a7d158b1d4bb7a5fc3e06c9d6abd8d68654d35a", "title": "Greedy-AutoML: A novel greedy-based stacking ensemble learning framework for assessing soil liquefaction potential"}, {"paperId": "f67bb23a0a2c2ae57a02acde0764ad4170f9c771", "title": "Rain Predictive Model using Machine learning Techniques"}, {"paperId": "4f23065014b1221eb4c275889cdf9c037d393981", "title": "Spatial Decision Support Systems with Automated Machine Learning: A Review"}, {"paperId": "608214a73cfabbf3282147087ea5c743c94e1d33", "title": "Ecosystem Services Assessment for Their Integration in the Analysis of Landslide Risk"}, {"paperId": "fea90618b0b11782f62d2642a29407da413e927d", "title": "Evaluation of Landslide Susceptibility Based on CF-SVM in Nujiang Prefecture"}, {"paperId": "ceec762cb52e0fb8f6e39288d7c39b8f96f20672", "title": "Mapping Landslide Sensitivity Based on Machine Learning: A Case Study in Ankang City, Shaanxi Province, China"}, {"paperId": "b4f7a0156747793679440be1482ca5a7fcbe256e", "title": "Integration of Vulnerability and Hazard Factors for Landslide Risk Assessment"}]}
