{"paperId": "710e4f01fe1488d6ac36755b4040b7179660e1e4", "publicationVenue": {"id": "9edb146e-1733-42d6-9ac6-91bced84ca22", "name": "Web Science Conference", "type": "conference", "alternate_names": ["Web Sci", "Web Science", "Web Sci Conf", "WebSci"]}, "title": "Are Anti-Feminist Communities Gateways to the Far Right? Evidence from Reddit and YouTube", "abstract": "Researchers have suggested that “the Manosphere,” a conglomerate of men-centered online communities, may serve as a gateway to far right movements. In that context, this paper quantitatively studies the migratory patterns between a variety of groups within the Manosphere and the Alt-right, a loosely connected far right movement that has been particularly active in mainstream social networks. Our analysis leverages over 300 million comments spread through Reddit (in 115 subreddits) and YouTube (in 526 channels) to investigate whether the audiences of channels and subreddits associated with these communities have converged between 2006 and 2018. In addition to subreddits related to the communities of interest, we also collect data on counterparts: other groups of users which we use for comparison (e.g., for YouTube we use a set of media channels). Besides measuring the similarity in the commenting user bases of these communities, we perform a migration study, calculating to which extent users in the Manosphere gradually engage with Alt-right content. Our results suggest that there is a large overlap between the user bases of the Alt-right and of the Manosphere and that members of the Manosphere have a bigger chance to engage with far right content than carefully chosen counterparts. However, our analysis also shows that migration and user base overlap varies substantially across different platforms and within the Manosphere. Members of some communities (e.g., Men’s Rights Activists) gradually engage with the Alt-right significantly more than counterparts on both Reddit and YouTube, whereas for other communities, this engagement happens mostly on Reddit (e.g., Pick Up Artists). Overall, our work paints a nuanced picture of the pipeline between the Manosphere and the Alt-right, which may inform platforms’ policies and moderation decisions regarding these communities.", "venue": "Web Science Conference", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2021-02-25", "journal": {"name": "Proceedings of the 13th ACM Web Science Conference 2021"}, "authors": [{"authorId": "2051550600", "name": "Robin Mami'e"}, {"authorId": "35700028", "name": "Manoel Horta Ribeiro"}, {"authorId": "145781376", "name": "Robert West"}], "citations": [{"paperId": "55b541a9a93bee3423e5fdfb2c0ec4620944a2ab", "title": "The Angry Echo Chamber: A Study of Extremist and Emotional Language Changes in Incel Communities Over Time."}, {"paperId": "b30e47b6459502227c74a9b41304e5ce10aed6fe", "title": "Intellectual dark web, alt-lite and alt-right: Are they really that different? a multi-perspective analysis of the textual content produced by contrarians"}, {"paperId": "a530c5e1271f4d06a72b0dfe04b1dd53aee32f77", "title": "“Are there any other male friendly subs on here?” - online men’s rights groups as simultaneous communities of care and hate, inclusion and exclusion"}, {"paperId": "bc76a3ddfedccfd185c289c9e49ec0a8ef2e5c24", "title": "Expresiones antifeministas en YouTube. Un análisis discursivo del youtuber Roma Gallardo"}, {"paperId": "20d15a1d1a59cf120f7a0d43d449534dc80bb704", "title": "Subscriptions and external links help drive resentful users to alternative and extremist YouTube channels"}, {"paperId": "26c154ac98b220fc1e4530c3f12fe46c80b585f3", "title": "Mainstreaming the Blackpill: Understanding the Incel Community on TikTok"}, {"paperId": "2da1e732b2b4c88a47816ebda2bdbef983d158be", "title": "A Data-driven Understanding of Left-Wing Extremists on Social Media"}, {"paperId": "c43a7d6591c92eb6a71ffc6102b977fd25cf94eb", "title": "Comparing the #StopTheSteal Movement across Multiple Platforms: Differentiating Discourse on Facebook, Twitter, and Parler"}, {"paperId": "33407f172df978a2134f68702c88e68763bbe2a6", "title": "Tube2Vec: Social and Semantic Embeddings of YouTube Channels"}, {"paperId": "cc8533946595fb00ed241598b7d57fbcf1a922d1", "title": "Identity Construction in a Misogynist Incels Forum"}, {"paperId": "c1b17bb803f4c2b737615850da5f55b2a913bd4e", "title": "Misogynistic Extremism: A Scoping Review."}, {"paperId": "d04a30799781273d6d232fd35f2b95a15dbd80d6", "title": "Reducing Exposure to Harmful Content via Graph Rewiring"}, {"paperId": "5db0c512c6655ea6bf8e452b0fb978748fc9ab8c", "title": "Sexualized violence and feminist counter-violence"}, {"paperId": "fafd97e3f98d578aa4fe29dc3dfe69485376442a", "title": "Beyond Fish and Bicycles: Exploring the Varieties of Online Women’s Ideological Spaces"}, {"paperId": "4115fd021f531d4ce8eb684e663e3018b09afd50", "title": "‘How Can I Love You if You Don’t Let Me Do this?’ Evaluating the Effects of the Red Pill Seduction Community Experienced by Intimate Partners"}, {"paperId": "8f029a873b297433a63edd5894530a6634db85ee", "title": "Sienkiewicz, M. & Marx, N. (2022). That’s not funny: how the right makes comedy work for them. University of California Press"}, {"paperId": "50355a322836793eaec5b64fe3f9b98c6e2f0231", "title": "The role of evidence-based misogyny in antifeminist online communities of the ‘manosphere’"}, {"paperId": "52e4e882de31f8862a4f15b6281f8a286b3b6bc7", "title": "Unsorted Significance: Examining Potential Pathways to Extreme Political Beliefs and Communities on Reddit"}, {"paperId": "dc4abd75cb5e9a07b2533cf588bc5da41c131981", "title": "A Study of Slang Representation Methods"}, {"paperId": "de7dbffe5622ada1b83e80a4fbae34375771d4f9", "title": "Multimodal and Explainable Internet Meme Classification"}, {"paperId": "70520ea51e4b31697eee851425a366e7856c6d55", "title": "Men not going their own way: a thick big data analysis of #MGTOW and #Feminism tweets"}, {"paperId": "03340c598043e549924db06f0a5d6a8c71392bcd", "title": "The Role of Perceived Injustice and Need for Esteem on Incel Membership Online"}, {"paperId": "1c7953444883054ac3a41042005e0ad40cc5c220", "title": "Men of today, soyboys of tomorrow: Constructions of masculinities in YouTube responses to Gillette’s The Best Men Can Be"}, {"paperId": "7cb0d0977e35f37d7cffcc0f19c9acbe84ee8385", "title": "‘Fascist Heroes’ vs. progressive policies and political correctness: Agenda and framing of the Spanish Alt-lite micro-celebrities on YouTube"}, {"paperId": "12d450050cd3155d82a13573fc70efca477fc859", "title": "Fighting for Masculine Hegemony: Contestation between Alt-Right and White Nationalist Masculinities on Stormfront"}, {"paperId": "693be8fc0fe567c67abc507fd0aebe3009ce2f29", "title": "The Reddit Politosphere: A Large-Scale Text and Network Resource of Online Political Discourse"}, {"paperId": "607bbb45aadf63e35bbe302f497cae128c152da8", "title": "The kids are alt-right: an introduction to PragerU and its role in radicalization in the United States"}, {"paperId": "405ee88e186df483df48db50fb58c94f956fa8ac", "title": "Examining incel subculture on reddit"}, {"paperId": "0eaebe9d278dc3b724a7842b7aad5b13e41067c8", "title": "Subscriptions and external links help drive resentful users to alternative and extremist YouTube videos"}, {"paperId": "f966109a407ec1165c4cfe8b73e12f4ef999de04", "title": "Characterizing Alternative Monetization Strategies on YouTube"}, {"paperId": "e20970a411973b90463fb49a7616dee386dafbda", "title": "Making a Radical Misogynist"}, {"paperId": "fd8357c94fa12e3dc6effac39e12bc747b7cab03", "title": "Reddit and the Fourth Estate: Exploring the magnitude and effects of media influence on community level moderation on Reddit"}, {"paperId": "160762eaab73ef24bc15668e13fcf836735fe45e", "title": "Explainable Classification of Internet Memes"}, {"paperId": "a64b0bbedbc043d0df9e92ae048acab986563ac9", "title": "The Polarizing Impact of Continuous Presence on Users' Behavior"}, {"paperId": "5704b03b446118d22dcc983d6f5d0a27fbf71bfa", "title": "Signposts A contextual background for the project Countering Radicalisation in Right-Wing Extremist Online Subcultures."}, {"paperId": "41070bce09c6954150518cbbf38aab8d984acaba", "title": "ExtremeBB: Enabling Large-Scale Research into Extremism, the Manosphere and Their Correlation by Online Forum Data"}, {"paperId": "1073c75d8c14f2dbc0d6324ad42295faf9e8ee1f", "title": "Doing masculinities online: defining and studying the manosphere"}]}
