{"paperId": "71156ebc6f4a94cf0834e8ef6bd0a865463ed9da", "publicationVenue": {"id": "0d563bf7-ad90-4e4a-85a8-d6def88b45ff", "name": "International Journal of Cartography", "type": "journal", "alternate_names": ["Int J Cartogr"], "issn": "2372-9333", "url": "http://tandfonline.com/tica", "alternate_urls": ["https://tandfonline.com/toc/tica20/current"]}, "title": "Accessing spatial knowledge networks with maps", "abstract": "ABSTRACT Currently, knowledge networks develop to establish common data spaces. A common data-space offers mutual exchange and reusability for data sources and their derived information and provides access to structured knowledge and even creates wisdom. The geospatial domain becomes included in those knowledge networks and, therefore, creates spatial knowledge networks. ‘Geospatial’ is moving from a special expert domain to a ‘normal’ common data source that is processed for specific data science use cases. Maps with their different levels of abstraction according to its transmission task may offer (1) strategies to enhance processing performance, due to its abstraction, (2) persistent references of map features throughout different scales (abstractions) and (3) improvement of the transmission of spatial information, which includes the transmission interfaces as well as geo-communication. This paper tries to identify new functions for maps in new developing application areas. For example, a ‘universal semantic structure of topographic content’ could help to establish relations/links across domains that only have their own feature keys. We try to set the scene of cartography in a common data-space and highlight some requirements in the world of spatial knowledge networks, which are needed for automatization, machine learning and AI. According to Gordon and de Souza location matters: ‘Mapping is not simply a mode of visualisation, but a “central organizational device for networked communications”, an adaptive interface through which users can access, alter and deploy an expansive database of information, and a platform to socialize spatial information through collective editing, annotations, discussion, etc.’ [Gordon, E., & de Souza e Silva, A. (2011). Net locality: Why location matters in a networked world. John Wiley & Sons, p. 28].", "venue": "International Journal of Cartography", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-09-06", "journal": {"name": "International Journal of Cartography", "pages": "102 - 117", "volume": "8"}, "authors": [{"authorId": "2379369", "name": "M. Jobst"}, {"authorId": "145218137", "name": "G. Gartner"}], "citations": [{"paperId": "892486879a4163ca4a6792b5feb070ba59900991", "title": "Conceptualizing and Validating the Trustworthiness of Maps through an Empirical Study on the Influence of Cultural Background on Map Design Perception"}, {"paperId": "018c63ec3f9bbbadb14d5fd6705c5ad051765060", "title": "Understanding relevance in maps through the use of knowledge graphs"}]}
