{"paperId": "7116b885b58b0520a76f51e104e107b7f31e35d7", "publicationVenue": {"id": "439d70ad-d909-4791-bdc6-dc765447bd42", "name": "Circulation Research", "type": "journal", "alternate_names": ["Circ Res"], "issn": "0009-7330", "url": "http://circres.ahajournals.org/"}, "title": "Use of Computation Ecosystems to Analyze the Kidney-Heart Crosstalk", "abstract": "The identification of mediators for physiologic processes, correlation of molecular processes, or even pathophysiological processes within a single organ such as the kidney or heart has been extensively studied to answer specific research questions using organ-centered approaches in the past 50 years. However, it has become evident that these approaches do not adequately complement each other and display a distorted single-disease progression, lacking holistic multilevel/multidimensional correlations. Holistic approaches have become increasingly significant in understanding and uncovering high dimensional interactions and molecular overlaps between different organ systems in the pathophysiology of multimorbid and systemic diseases like cardiorenal syndrome because of pathological heart-kidney crosstalk. Holistic approaches to unraveling multimorbid diseases are based on the integration, merging, and correlation of extensive, heterogeneous, and multidimensional data from different data sources, both -omics and nonomics databases. These approaches aimed at generating viable and translatable disease models using mathematical, statistical, and computational tools, thereby creating first computational ecosystems. As part of these computational ecosystems, systems medicine solutions focus on the analysis of -omics data in single-organ diseases. However, the data–scientific requirements to address the complexity of multimodality and multimorbidity reach far beyond what is currently available and require multiphased and cross-sectional approaches. These approaches break down complexity into small and comprehensible challenges. Such holistic computational ecosystems encompass data, methods, processes, and interdisciplinary knowledge to manage the complexity of multiorgan crosstalk. Therefore, this review summarizes the current knowledge of kidney-heart crosstalk, along with methods and opportunities that arise from the novel application of computational ecosystems providing a holistic analysis on the example of kidney-heart crosstalk.", "venue": "Circulation Research", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2023-04-14", "journal": {"name": "Circulation Research", "pages": "1084 - 1100", "volume": "132"}, "authors": [{"authorId": "2109569264", "name": "Zhuojun Wu"}, {"authorId": "1573509015", "name": "J. Lohmöller"}, {"authorId": "47965618", "name": "Christiane Kuhl"}, {"authorId": "1719689", "name": "Klaus Wehrle"}, {"authorId": "3452945", "name": "J. Jankowski"}], "citations": []}
