{"paperId": "712306a0c1d5c8546baa93b20a28533dfbaedad0", "publicationVenue": null, "title": "Resource Recommender for Cloud-Edge Engineering", "abstract": "The interaction between artificial intelligence (AI), edge, and cloud is a fast-evolving realm in which pushing computation close to the data sources is increasingly adopted. Captured data may be processed locally (i.e., on the edge) or remotely in the clouds where abundant resources are available. While many emerging applications are processed in situ due primarily to their data intensiveness and short-latency requirement, the capacity of edge resources remains limited. As a result, the collaborative use of edge and cloud resources is of great practical importance. Such collaborative use should take into account data privacy, high latency and high bandwidth consumption, and the cost of cloud usage. In this paper, we address the problem of resource allocation for data processing jobs in the edge-cloud environment to optimize cost efficiency. To this end, we develop Cost Efficient Cloud Bursting Scheduler and Recommender (CECBS-R) as an AI-assisted resource allocation framework. In particular, CECBS-R incorporates machine learning techniques such as multi-layer perceptron (MLP) and long short-term memory (LSTM) neural networks. In addition to preserving privacy due to employing edge resources, the edge utility cost plus public cloud billing cycles are adopted for scheduling, and jobs are profiled in the cloud-edge environment to facilitate scheduling through resource recommendations. These recommendations are outputted by the MLP neural network and LSTM for runtime estimation and resource recommendation, respectively. CECBS-R is trained with the scheduling outputs of Facebook and grid workload traces. The experimental results based on unseen workloads show that CECBS-R recommendations achieve a ∼65% cost saving in comparison to an online cost-efficient scheduler (BOS), resource management service (RMS), and an adaptive scheduling algorithm with QoS satisfaction (AsQ).", "venue": "Inf.", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-05-25", "journal": {"name": "Inf.", "pages": "224", "volume": "12"}, "authors": [{"authorId": "2015531", "name": "A. Pasdar"}, {"authorId": "2116463677", "name": "Young Choon Lee"}, {"authorId": "3123007", "name": "Tahereh Hassanzadeh"}, {"authorId": "1390009855", "name": "K. Almi'ani"}], "citations": [{"paperId": "cc0f4fad77290d9ba2aa0eae258977824ffc0111", "title": "Cost and response time optimization of edge architectures"}, {"paperId": "e0a75632bd8cd8176f1a1d8d65dc2de9a4aae381", "title": "A Method of Recommending Physical Education Network Course Resources Based on Machine Learning Algorithms"}]}
