{"paperId": "7137da51ee1487a49a81e0e628788e67e52aaf20", "publicationVenue": null, "title": "Review on Machine and Deep Learning Applications for Cyber Security", "abstract": "In today's world, everyone is generating a large amount of data on their own. With this amount of data generation, there is a change of security compromise of our data. This leads us to extend the security needs beyond the traditional approach which emerges the field of cyber security. Cyber security's core functionality is to protect all types of information, which includes hardware and software from cyber threats. The number of threats and attacks is increasing each year with a high difference between them. Machine learning and deep learning applications can be done to this attack, reducing the complexity to solve the problem and helping us to recover very easily. The algorithms used by both approaches are support vector machine (SVM), Bayesian algorithm, deep belief network (DBN), and deep random neural network (Deep RNN). These techniques provide better results than that of the traditional approach. The companies which use this approach in the real time scenarios are also covered in this chapter.", "venue": "", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": null, "journal": {"name": "", "pages": "42-63", "volume": ""}, "authors": [{"authorId": "145476245", "name": "M. Thangavel"}, {"authorId": "2090397765", "name": "T. Shree"}, {"authorId": "2091775963", "name": "P. Priyadharshini"}, {"authorId": "1401084415", "name": "T. Saranya"}], "citations": [{"paperId": "58b43268380002b916457746d9863b55c23e62c4", "title": "A Review on Machine Learning Strategies for Real-World Engineering Applications"}, {"paperId": "c6c9aed0e92c3aed602b8276b7d2854a46a8c85d", "title": "HoneyNetCloud Investigation Model, A Preventive Process Model for IoT Forensics"}, {"paperId": "4c30d041c137948aa75e40912f14558234bf1ce2", "title": "A Survey on Machine Learning Techniques for Cyber Security in the Last Decade"}]}
