{"paperId": "7165bf44255da5486fb80fe3f30747aa898e1792", "publicationVenue": {"id": "a25f0f0c-6f67-4e9b-8f42-ffddbf2b3f55", "name": "Journal of Gastroenterology and Hepatology", "type": "journal", "alternate_names": ["J Gastroenterol Hepatol"], "issn": "0815-9319", "url": "http://onlinelibrary.wiley.com/journal/10.1111/(issn)1440-1746", "alternate_urls": ["http://onlinelibrary.wiley.com/journal/10.1111/(ISSN)1440-1746/homepage/Society.html", "https://onlinelibrary.wiley.com/journal/14401746"]}, "title": "Prevalence of the pathobiont adherent‐invasive Escherichia coli and inflammatory bowel disease: a systematic review and meta‐analysis", "abstract": "Escherichia coli pathobionts and particularly the adherent‐invasive E. coli (AIEC) may play a putative role in initiating and maintaining the inflammatory process in the intestinal tissues of inflammatory bowel disease (IBD) patients, by providing stimulatory factors that trigger gut immune system activation. The aim of this study is to conduct a systematic review and meta‐analysis to determine the prevalence of AIEC among patients with Crohn's disease (CD) and ulcerative colitis (UC).", "venue": "Journal of Gastroenterology and Hepatology", "year": 2020, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2020-09-14", "journal": {"name": "Journal of Gastroenterology and Hepatology", "pages": "852 - 863", "volume": "36"}, "authors": [{"authorId": "89039497", "name": "B. Nadalian"}, {"authorId": "3980875", "name": "A. Yadegar"}, {"authorId": "3976260", "name": "H. Houri"}, {"authorId": "11614889", "name": "Meysam Olfatifar"}, {"authorId": "4648461", "name": "S. Shahrokh"}, {"authorId": "7398570", "name": "H. Asadzadeh Aghdaei"}, {"authorId": "1965783146", "name": "Hidekazu Suzuki"}, {"authorId": "66795518", "name": "M. Zali"}], "citations": [{"paperId": "09b810bdb6619723be74261a0d54393bf2cc7bab", "title": "Metabolic network of the gut microbiota in inflammatory bowel disease"}, {"paperId": "b29da8ed7862798e90f4a4782bb9956cf57235c9", "title": "Antibiotic Therapy for Active Crohn’s Disease Targeting Pathogens: An Overview and Update"}, {"paperId": "45523d7fd0f08852e32faa95571570d31829d8d2", "title": "Crohn's disease-associated Escherichia coli LF82 in the gut damage of germ-free honeybees: A laboratory study."}, {"paperId": "6d0a961ed2ad14aea2d606cfc2fdf4a379c00c06", "title": "Escherichia coli adhesion protein FimH exacerbates colitis via CD11b+CD103- dendritic cell activation"}, {"paperId": "b37b00cefb1e28fbf86f17c2927395d1586c4c4a", "title": "PUFAs add fuel to Crohn’s disease-associated AIEC-induced enteritis by exacerbating intestinal epithelial lipid peroxidation"}, {"paperId": "6e4fff7a1f71f97089df18c6bc97bb2d938f3321", "title": "Wastewater treatment for reuse in agriculture: Prospects and challenges."}, {"paperId": "2bf219bc7ca34d81952a22cfab7b64a0446ba8a9", "title": "Characterizing the Pathogenic Potential of Crohn’s Disease-Associated Adherent-Invasive Escherichia coli"}, {"paperId": "01e20519e8baf8d1297534bbef0b1434d73d085c", "title": "Anti-Inflammatory Effects of Two-Week Sacral Nerve Stimulation Therapy in Patients With Ulcerative Colitis."}, {"paperId": "a18a3d475dc389775e8eb838eb5418d756bafc7b", "title": "Saccharomyces cerevisiae prevents postoperative recurrence of Crohn's disease modeled by ileocecal resection in HLA-B27 transgenic rats"}, {"paperId": "83caf1d2af6dab0a3bf043d4f722b89bab47b1c5", "title": "The multifaceted virulence of adherent-invasive Escherichia coli"}, {"paperId": "583dee0afb301118d5b450f92d2e639b18906434", "title": "The Diversity of Escherichia coli Pathotypes and Vaccination Strategies against This Versatile Bacterial Pathogen"}, {"paperId": "5d0c5e8c01ceb30339c5c9c49b2542cf5af877e6", "title": "Role of adherent invasive Escherichia coli in pathogenesis of inflammatory bowel disease"}, {"paperId": "9688a5386c2c682dbcabb36f5545bde398656a7a", "title": "Overrepresentation of Enterobacteriaceae and Escherichia coli is the major gut microbiome signature in Crohn’s disease and ulcerative colitis; a comprehensive metagenomic analysis of IBDMDB datasets"}, {"paperId": "8caa5ea1495a15f989de96b8352e45974faa3634", "title": "Phylogrouping and characterization of Escherichia coli isolated from colonic biopsies and fecal samples of patients with flare of inflammatory bowel disease in Iran"}, {"paperId": "275254ab3d12413bdd23f685948782ba04988cc6", "title": "An IBD-associated pathobiont synergises with NSAID to promote colitis which is blocked by NLRP3 inflammasome and Caspase-8 inhibitors"}, {"paperId": "58bad9a21c263dc3b5a7a82d0efb42ce621aab21", "title": "Crohn’s Disease, Host–Microbiota Interactions, and Immunonutrition: Dietary Strategies Targeting Gut Microbiome as Novel Therapeutic Approaches"}, {"paperId": "4f5e5946c7d07da9ac745a10cd3783ba76bc8163", "title": "Genomics and pathotypes of the many faces of Escherichia coli"}, {"paperId": "2fd7a2ebe8b2ec1cb8926f2445728aa4e6156613", "title": "Role of adherent and invasive Escherichia coli in Crohn’s disease: lessons from the postoperative recurrence model"}, {"paperId": "0a12181a56c694bd524d9c5c7f2078c7cf8e6f14", "title": "Inflammatory Bowel Disease and COVID-19: How Microbiomics and Metabolomics Depict Two Sides of the Same Coin"}, {"paperId": "9c659f68ad8057a23370d954999df872539c850b", "title": "Prevalence, Abundance, and Virulence of Adherent-Invasive Escherichia coli in Ulcerative Colitis, Colorectal Cancer, and Coeliac Disease"}, {"paperId": "e6ac19801ffeb5594029cd058c2b7fb737629a8b", "title": "Rapid, Sensitive and Specific Electrochemical Detection of E. coli using Graphitized Mesoporous Carbon Modified Electrodes"}, {"paperId": "59e89f4376fe63a1d5ab4c51cee53794dbcbe273", "title": "The Nutrition-Microbiota-Physical Activity Triad: An Inspiring New Concept for Health and Sports Performance"}, {"paperId": "a13eb777ada4947c2b45334fd9097c3d025af792", "title": "Mucolytic bacteria license pathobionts to acquire host-derived nutrients during dietary nutrient restriction"}, {"paperId": "339eb18f7e6a4bbfad766a63afa8818c0ed771b6", "title": "Ultrasound, Hematological and Biochemical Analysis in Canine with Inflammatory Bowel Disease"}, {"paperId": "563a0d001941a40ed348dd2532edb575fa8147df", "title": "Research-Based Product Innovation to Address Critical Unmet Needs of Patients with Inflammatory Bowel Diseases"}, {"paperId": "bde715674f1fa349740216104b4c4634baf5c906", "title": "Faster and less invasive tools to identify patients with ileal colonization by adherent‐invasive E. coli in Crohn's disease"}, {"paperId": "979ea81f91b1f120c283fc20893444b8f549ae01", "title": "The Short-Chain Fatty Acids Propionate and Butyrate Augment Adherent-Invasive Escherichia coli Virulence but Repress Inflammation in a Human Intestinal Enteroid Model of Infection"}, {"paperId": "a3beb33dd566879f097752b4118f9f344bc63480", "title": "A Cranberry Concentrate Decreases Adhesion and Invasion of Escherichia coli (AIEC) LF82 In Vitro"}, {"paperId": "65e5f3a18cfe761c186a866ec52ac40b43c17b00", "title": "Milk Exosomes Transfer Oligosaccharides into Macrophages to Modulate Immunity and Attenuate Adherent-Invasive E. coli (AIEC) Infection"}, {"paperId": "a4531e18e48417a17c85882a52f27cb4173c8f5c", "title": "Adherent-Invasive and Non-Invasive Escherichia coli Isolates Differ in Their Effects on Caenorhabditis elegans’ Lifespan"}, {"paperId": "543872f38bcda6c0d93c42232cd32124b769c68d", "title": "Differential prevalence of pathobionts and host gene polymorphisms in chronic inflammatory intestinal diseases: Crohn’s disease and intestinal tuberculosis"}, {"paperId": "f64f9e4fcc6d0fc6c1c47a604da7825cc1c702fd", "title": "Regulation of CEACAM Family Members by IBD-Associated Triggers in Intestinal Epithelial Cells, Their Correlation to Inflammation and Relevance to IBD Pathogenesis"}, {"paperId": "c7cbffd05ba6cbba67e39e3ad942f0158880473f", "title": "Lessons For Human Holobiont Medicine in The Era of SARS-Cov-2"}, {"paperId": "9e5d2b272583a684421f3d38ff3b81de75ca5c79", "title": "Characterization of the gut microbiota in patients with primary sclerosing cholangitis compared to inflammatory bowel disease and healthy controls"}, {"paperId": "00421fc7aa992617dbfbe22d4f30fe8f7036c7ac", "title": "A Novel Strategy to Study the Invasive Capability of Adherent-Invasive Escherichia coli by Using Human Primary Organoid-Derived Epithelial Monolayers"}, {"paperId": "5daffa84569a9cf8ee54424bb5c77614c0d68a3f", "title": "The Role of Enterobacteriaceae in Gut Microbiota Dysbiosis in Inflammatory Bowel Diseases"}, {"paperId": "b2adaab7b9c73ed22a56a870f60111e41425b122", "title": "Modulatory effects of gut microbiome in cancer immunotherapy: A novel paradigm for blockade of immune checkpoint inhibitors"}, {"paperId": "2ea1b218c4852d810d421b378c079f670782141f", "title": "World Journal of Gastroenterology"}]}
