{"paperId": "7181e714ff865b51f961b6bb73ac9bb8cd35c42c", "publicationVenue": {"id": "c0d89891-691b-42f5-85ef-7f026f51e15b", "name": "International Conferences on Intelligent Systems, Metaheuristics & Swarm Intelligence", "type": "conference", "alternate_names": ["ISMSI", "Int Conf Intell Syst Metaheuristics  Swarm Intell"]}, "title": "Deepfake Detection Analyzing Hybrid Dataset Utilizing CNN and SVM", "abstract": "Social media is currently being used by many individuals online as a major source of information. However, not all information shared online is true, even photos and videos can be doctored. Deepfakes have recently risen with the rise of technological advancement and have allowed nefarious online users to replace one's face with a computer-generated face of anyone they would like, including important political and cultural figures. Deepfakes are now a tool to be able to spread mass misinformation. There is now an immense need to create models that are able to detect deepfakes and keep them from being spread as seemingly real images or videos. In this paper, we propose a new deepfake detection schema using two popular machine learning algorithms; support vector machine and convolutional neural network, along with a publicly available dataset named the 140k Real and Fake Faces to accurately detect deepfakes in images with accuracy rates reaching as high as 88.33%. ", "venue": "International Conferences on Intelligent Systems, Metaheuristics & Swarm Intelligence", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2023-01-27", "journal": {"name": "Proceedings of the 2023 7th International Conference on Intelligent Systems, Metaheuristics & Swarm Intelligence"}, "authors": [{"authorId": "2150912237", "name": "Jacob Mallet"}, {"authorId": "2132910527", "name": "Laura Pryor"}, {"authorId": "51288952", "name": "Rushit Dave"}, {"authorId": "117565513", "name": "Mounika Vanamala"}], "citations": [{"paperId": "8ced2f60a7125e0850b4e25b50898d52aa48ff12", "title": "Art of Detection: Custom CNN and VGG19 for Accurate Real Vs Fake Image Identification"}, {"paperId": "f830b1d3b8ba581925886a77a7b7113c99f76bfc", "title": "Deepfake Generation and Detection - An Exploratory Study"}, {"paperId": "e2f5cb9b91fe6eacde5f0c588c5349b4cf4d7e62", "title": "Secure Arcade: A Gamified Defense Against Cyber Attacks"}, {"paperId": "10cbd4727312b96d58cb614bdb9bd81b0b4f2e4c", "title": "Recent Advancements In The Field Of Deepfake Detection"}, {"paperId": "7ebff41444a4deaf34f4d233e121ba8bfd273580", "title": "Betray Oneself: A Novel Audio DeepFake Detection Model via Mono-to-Stereo Conversion"}]}
