{"paperId": "718339cbafd0b4613d3389cc2c22592764b92c62", "publicationVenue": {"id": "41bf9ed3-85b3-4c90-b015-150e31690253", "name": "Conference on Empirical Methods in Natural Language Processing", "type": "conference", "alternate_names": ["Empir Method Nat Lang Process", "Empirical Methods in Natural Language Processing", "Conf Empir Method Nat Lang Process", "EMNLP"], "url": "https://www.aclweb.org/portal/emnlp"}, "title": "Distilling the Knowledge of Large-scale Generative Models into Retrieval Models for Efficient Open-domain Conversation", "abstract": "Despite the remarkable performance of large-scale generative models in open-domain conversation, they are known to be less practical for building real-time conversation systems due to high latency. On the other hand, retrieval models could return responses with much lower latency but show inferior performance to the large-scale generative models since the conversation quality is bounded by the pre-defined response set. To take advantage of both approaches, we propose a new training method called G2R (Generative-to-Retrieval distillation) that preserves the efficiency of a retrieval model while leveraging the conversational ability of a large-scale generative model by infusing the knowledge of the generative model into the retrieval model. G2R consists of two distinct techniques of distillation: the data-level G2R augments the dialogue dataset with additional responses generated by the large-scale generative model, and the model-level G2R transfers the response quality score assessed by the generative model to the score of the retrieval model by the knowledge distillation loss. Through extensive experiments including human evaluation, we demonstrate that our retrieval-based conversation system trained with G2R shows a substantially improved performance compared to the baseline retrieval model while showing significantly lower inference latency than the large-scale generative models.", "venue": "Conference on Empirical Methods in Natural Language Processing", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-08-28", "journal": {"pages": "3357-3373"}, "authors": [{"authorId": "2141188926", "name": "Beomsu Kim"}, {"authorId": "7274568", "name": "Seokjun Seo"}, {"authorId": "2423429", "name": "Seungju Han"}, {"authorId": "3451729", "name": "Enkhbayar Erdenee"}, {"authorId": "50814662", "name": "Buru Chang"}], "citations": [{"paperId": "84212527ffadbdb19584f6df91b425229d39043e", "title": "SME-in-the-loop: Interaction Preferences when Supervising Bots in Human-AI Communities"}, {"paperId": "a04628d231295627708074b36c45217e9d9eebcf", "title": "Accurate Knowledge Distillation with n-best Reranking"}, {"paperId": "99313c8af01ac3662d11edd705ba80851eb44f0c", "title": "Measuring and Improving Semantic Diversity of Dialogue Generation"}, {"paperId": "aab1dead436211a7d9eb7a717ee63a5d23cf23f0", "title": "Meet Your Favorite Character: Open-domain Chatbot Mimicking Fictional Characters with only a Few Utterances"}, {"paperId": "2cb8db10fac79c8a6079a8b99b21af97e42ecfb9", "title": "Understanding and Improving the Exemplar-based Generation for Open-domain Conversation"}]}
