{"paperId": "718969620b6eeb9204c7e3b1a50bbb061348e852", "publicationVenue": {"id": "43832dae-bddd-4002-9b5f-a11440fe6909", "name": "International Conference on the Digital Society", "type": "conference", "alternate_names": ["International Conference on Data Science", "Int Conf Data Sci", "International Conference Data Science", "ICDS", "Int Conf Digit Soc"], "url": "http://www.wikicfp.com/cfp/program?id=1339"}, "title": "Air Surveillance Planning Approach for Large Areas", "abstract": "We consider an area we would like to scan using drones that can perform air surveillance, the area is too large for one drone in a mission can reach and scan. In our approach, the environment is modulated in a grid view, and each node (so called point) has a given priority, this priority define the importance of that point (the need to reach that point). The problem is processed as two sub-problems, the first part focuses on dividing the area to smaller zones which the drone can perform in a mission while meeting the required constraints. The drone has a limit energy, so a limit trajectory to perform. In the second part of the problem, we should find the best (optimal) trajectory for each zone, starting from a specific point and returning to it. The approach we present aim to maximize the gain (priorities sum) of the trajectory in each group of points that belongs to a part of the surveillance area, with the limit budget we have. Up next we detail the problem and discuss the performance of the approach.", "venue": "International Conference on the Digital Society", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2019-10-01", "journal": {"name": "2019 Third International Conference on Intelligent Computing in Data Sciences (ICDS)", "pages": "1-6"}, "authors": [{"authorId": "134865931", "name": "Wassim Khiati"}, {"authorId": "101710748", "name": "Younes Moumen"}, {"authorId": "134123398", "name": "Ilham Zerrouk"}, {"authorId": "10383009", "name": "Jamal Berrich"}, {"authorId": "1784078", "name": "T. Bouchentouf"}], "citations": [{"paperId": "4d8463d86b57135c73edfbf37eab706f7d88f29a", "title": "Grid Based approach (GBA): a new approach based on the grid-clustering algorithm to solve a CPP type problem for air surveillance using UAVs"}, {"paperId": "cdff6695a23c191910c2aea0543d9ab6ccdd7f51", "title": "CGA: A New Approach to Estimate the Geolocation of a Ground Target from Drone Aerial Imagery"}, {"paperId": "470b509444cc8e97679c0ef2a5d8331449719a7f", "title": "UAV AERIAL IMAGERY: MAPPING & 3D MODELLLING"}]}
