{"paperId": "71ae3a943f58b123ab34a4302d48d354c2879b93", "publicationVenue": {"id": "fe526af8-da0b-4a52-925c-e0e345537a7e", "name": "International Conference on Wireless Communications and Signal Processing", "type": "conference", "alternate_names": ["Int Conf Wirel Commun Signal Process", "WCSP"], "url": "http://www.ic-wcsp.org/"}, "title": "An Edge Based Framework for Risk Assessment of Communicable Disease", "abstract": "Along with the development of edge computing and Artificial Intelligence (AI), there has been an explosion of health-care system. As COVID-19 spread globally, the pandemic created significant challenges for the global health system. Therefore, we proposed an edge-based framework for risk assessment of communicable disease called CDM-FL. The CDM-FL consists of two modules, the common data model (CDM) and federated learning (FL). The CDM can process and store multi-source heterogeneous data with standardized semantics and schema. This provides more data for model training using medical data globally. The model is deployed on edge nodes that can measure patients' status locally and with low latency. It also keeps patient privacy from being disclosed that patient are more likely to share their medical data. The results based on real-world data show that CDM-FL can help physicians to evaluate the risk of communicable disease as well as save lives during severe epidemic situations.", "venue": "International Conference on Wireless Communications and Signal Processing", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-11-01", "journal": {"name": "2022 14th International Conference on Wireless Communications and Signal Processing (WCSP)", "pages": "331-335"}, "authors": [{"authorId": "2140386888", "name": "Ruocheng Huang"}, {"authorId": "2154405540", "name": "Yong Li"}, {"authorId": "2114324784", "name": "Wei Feng"}, {"authorId": "2149173289", "name": "Xin Zhang"}, {"authorId": "2067161279", "name": "Tao Shan"}, {"authorId": "46399898", "name": "Yun Liu"}], "citations": []}
