{"paperId": "71b72762b9ca46eb6df655dc5a0c14aee58fa1e7", "publicationVenue": null, "title": "Cellular Vehicle Networking Positioning Algorithm Based On Blockchain Technique", "abstract": "The wide application of sensor devices has promoted the rapid development of Internet of Vehicles. As the application of Internet of Things in intelligent transportation, Internet of Vehicles has brought great convenience to people's daily travel. Car networking can promote timely and accurate communication between cars and infrastructure, protect people's travel safety and improve traffic efficiency. The application of blockchain technique in the Internet of Vehicles has greatly alleviated the phenomena of data privacy and network security. In order to expand the application of blockchain technique, relevant personnel need to pay attention to technical research. Decentralization, tamper-proof, traceability, these three characteristics of blockchain can solve the pain points that are difficult to solve in traditional car networking questions, such as the security of car networking communication, privacy of car networking communication and so on. The method adopted in this paper is blockchain, which establishes an efficient secure channel through symmetric encryption algorithm, and realizes key agreement and message verification through public key encryption and public key signature algorithm. To benefit from location service, applications must trust location data. After research, the algorithm in this paper has remarkable effect and is suitable for being widely used.", "venue": "2022 2nd International Conference on Networking, Communications and Information Technology (NetCIT)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-12-01", "journal": {"name": "2022 2nd International Conference on Networking, Communications and Information Technology (NetCIT)", "pages": "617-621"}, "authors": [{"authorId": "2180517571", "name": "Jing Chen"}], "citations": [{"paperId": "00fcf2d8d34df4cf9767ac42001755027cf5c6c4", "title": "Multiple-RIS-Aided Vibrio Foraging Optimization Positioning Algorithm Under Internet of Vehicles Environment"}]}
