{"paperId": "71c20c4167da8087f8a5455ac4685abde8943d0f", "publicationVenue": {"id": "d5b215f3-f737-45b2-875b-df309ce14c43", "name": "Scientific Programming", "type": "journal", "alternate_names": ["Sci Program"], "issn": "1058-9244", "url": "https://www.hindawi.com/journals/sp/", "alternate_urls": ["https://www.iospress.nl/html/10589244.php", "https://www.wiley.com/legacy/compbooks/compjournals/sciprog.html", "http://content.iospress.com/journals/scientific-programming"]}, "title": "A Nondisturbing Service to Automatically Customize Notification Sending Using Implicit-Feedback", "abstract": "This paper addresses the problem of automatically customizing the sending of notifications in a nondisturbing way, that is, by using only implicit-feedback. Then, we build a hybrid filter that combines text mining content filtering and collaborative filtering to predict the notifications that are most interesting for each user. The content-based filter clusters notifications to find content with topics for which the user has shown interest. The collaborative filter increases diversity by discovering new topics of interest for the user, because these are of interest to other users with similar concerns. The paper reports the result of measuring the performance of this recommender and includes a validation of the topics-based approach used for content selection. Finally, we demonstrate how the recommender uses implicit-feedback to personalize the content to be delivered to each user.", "venue": "Scientific Programming", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-03-03", "journal": {"name": "Sci. Program.", "pages": "1293194:1-1293194:17", "volume": "2019"}, "authors": [{"authorId": "2004792335", "name": "Fernando López Hernández"}, {"authorId": "1383235782", "name": "E. Verdú"}, {"authorId": "2105047051", "name": "J. J. R. Granados"}, {"authorId": "1782898", "name": "R. G. Crespo"}], "citations": [{"paperId": "98f5e686c7ab038d7628f713740e28641e7d60a1", "title": "Machine Learning and Natural Language Processing in Domain Classification of Scientific Knowledge Objects: A Review"}]}
