{"paperId": "71ded8f5ce2596c8168f6f4b8e577234e57a331f", "publicationVenue": {"id": "c18ca9ea-c394-46d2-b458-30dcf166dabb", "name": "ISPRS Annals of the Photogrammetry, Remote Sensing and Spatial Information Sciences", "type": "journal", "alternate_names": ["ISPRS Ann Photogramm Remote Sens Spat Inf Sci"], "issn": "2196-6346", "url": "https://www.isprs.org/publications/annals.aspx"}, "title": "IMPROVING DATA QUALITY AND MANAGEMENT FOR REMOTE SENSING ANALYSIS: USE-CASES AND EMERGING RESEARCH QUESTIONS", "abstract": "Abstract. During the last decades satellite remote sensing has become an emerging technology producing big data for various application fields every day. However, data quality checking as well as the long-time management of data and models are still issues to be improved. They are indispensable to guarantee smooth data integration and the reproducibility of data analysis such as carried out by machine learning models. In this paper we clarify the emerging need of improving data quality and the management of data and models in a geospatial database management system before and during data analysis. In different use cases various processes of data preparation and quality checking, integration of data across different scales and references systems, efficient data and model management, and advanced data analysis are presented in detail. Motivated by these use cases we then discuss emerging research questions concerning data preparation and data quality checking, data management, model management and data integration. Finally conclusions drawn from the paper are presented and an outlook on future research work is given.\n", "venue": "ISPRS Annals of the Photogrammetry, Remote Sensing and Spatial Information Sciences", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-05", "journal": {"name": "ISPRS Annals of the Photogrammetry, Remote Sensing and Spatial Information Sciences"}, "authors": [{"authorId": "2271044760", "name": "M. Breunig"}, {"authorId": "2271308747", "name": "P. Kuper"}, {"authorId": "2271311247", "name": "F. Reitze"}, {"authorId": "2270693258", "name": "S. Landgraf"}, {"authorId": "1403759150", "name": "M. Al-Doori"}, {"authorId": "2271295883", "name": "E. Stefanakis"}, {"authorId": "2271322574", "name": "H. Abdulmuttalib"}, {"authorId": "2271302180", "name": "Z. Kugler"}], "citations": []}
