{"paperId": "71f900694925ac247373a2b733594bc90f474225", "publicationVenue": {"id": "20a3a2f3-532a-4f04-9f3d-1e268e100872", "name": "International Journal of Advanced Computer Science and Applications", "type": "journal", "alternate_names": ["Int J Adv Comput Sci Appl"], "issn": "2156-5570", "url": "http://sites.google.com/site/ijacsa2010/", "alternate_urls": ["http://thesai.org/Publication/Default.aspx", "https://thesai.org/Publications/IJACSA"]}, "title": "Applications of Clustering Techniques in Data Mining: A Comparative Study", "abstract": "In modern scientific research, data analyses are often used as a popular tool across computer science, communication science, and biological science. Clustering plays a significant role in the reference composition of data analysis. Clustering, recognized as an essential issue of unsupervised learning, deals with the segmentation of the data structure in an unknown region and is the basis for further understanding. Among many clustering algorithms, “more than 100 clustering algorithms known” because of its simplicity and rapid convergence, the K-means clustering algorithm is commonly used. This paper explains the different applications, literature, challenges, methodologies, considerations of clustering methods, and related key objectives to implement clustering with big data. Also, presents one of the most common clustering technique for identification of data patterns by performing an analysis of sample data.", "venue": "International Journal of Advanced Computer Science and Applications", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": null, "journal": {"name": "International Journal of Advanced Computer Science and Applications"}, "authors": [{"authorId": "47343655", "name": "M. Faizan"}, {"authorId": "38509860", "name": "M. Zuhairi"}, {"authorId": "1836900", "name": "S. Ismail"}, {"authorId": "2093397284", "name": "S. Sultan"}], "citations": [{"paperId": "6be7cb88435b8692609ebad726da3fe1c97a9305", "title": "Optimising Urban Freight Logistics Using Discrete-Event Simulation and Cluster Analysis: A Stochastic Two-Tier Hub-and-Spoke Architecture Approach"}, {"paperId": "4794e01629480cc2efde856fb85a6a4e9359b961", "title": "Parametric entropy based Cluster Centriod Initialization for k-means clustering of various Image datasets"}, {"paperId": "f33601b94703f909529dae9e17448a224ab79c03", "title": "A Review of Quantum-Inspired Metaheuristic Algorithms for Automatic Clustering"}, {"paperId": "539e1d29ca2bcd29c7dfb8da0c304bd5323908f1", "title": "The Significance of using Data Extraction Methods for an Effective Big Data Mining Process"}, {"paperId": "e66dedd173dd705be6d297ac9683ac8bb2ff0360", "title": "An Efficient and Speedy approach for Hierarchical Clustering Using Complete Linkage method"}, {"paperId": "db5a07935e38b5a5a05d838318362c11fb5742a0", "title": "Process mining to discover online learning behaviour"}, {"paperId": "950e00dc1565638b8dc64aee8e9ac9eaed648483", "title": "A Conceptual Predictive Analytics Model for the Identification of at-risk students in VLE using Machine Learning Techniques"}, {"paperId": "884c570674841f0791fd4ca97cd357c7b8172b50", "title": "Clustering-Using Data Mining-based Application to Identify the Hourly Loading Patterns of the Generation Units from the Hydropower Plants"}, {"paperId": "9abf0ee98f1ead46253828489a23daa26593190f", "title": "Data Analytics and Techniques"}, {"paperId": "3f03a83021029eba06a55e9b29557202e274dafe", "title": "Analyzing Factors of Mental Health Problems among Malaysian University Students using Clustering Analysis"}, {"paperId": "ab0399802e8916a45a447866ab4c2ad067a10e72", "title": "An improved image clustering algorithm based on Kernel method and Tchebychev orthogonal moments"}, {"paperId": "647822661f5be27f9b5aa57ea057972e38f3bbf0", "title": "A Review Of Clustering Methods Based on Artificial Intelligent Techniques"}, {"paperId": "dffaae152ff79814a8b5fc647fa55f1fb325509d", "title": "Priority power generation allocation method for reservoir power stations based on the priority index"}, {"paperId": "62bd6e08737098bfb7b84e5435b87885e1aefa31", "title": "Analysis of Playing Positions in Tennis Match Videos to Assess Competition Using a Centroid Clustering Heatmap Prediction Technique"}, {"paperId": "1fbd9c3507f36c72e526ac1d7c724054795a63ac", "title": "Analogy of the Application of Clustering and K-Means Techniques for the Approximation of Values of Human Development Indicators"}]}
