{"paperId": "71fdb9559be8c7f1a0646bd2afb7c280220db8f2", "publicationVenue": null, "title": "Privacy preserving big data analytics: A critical analysis of state‐of‐the‐art", "abstract": "In the era of “big data,” a huge number of people, devices, and sensors are connected via digital networks and the cross‐plays among these entities generate enormous valuable data that facilitate organizations to innovate and grow. However, the data deluge also raises serious privacy concerns which may cause a regulatory backlash and hinder further organizational innovation. To address the challenge of information privacy, researchers have explored privacy‐preserving methodologies in the past two decades. However, a thorough study of privacy preserving big data analytics is missing in existing literature. The main contributions of this article include a systematic evaluation of various privacy preservation approaches and a critical analysis of the state‐of‐the‐art privacy preserving big data analytics methodologies. More specifically, we propose a four‐dimensional framework for analyzing and designing the next generation of privacy preserving big data analytics approaches. Besides, we contribute to pinpoint the potential opportunities and challenges of applying privacy preserving big data analytics to business settings. We provide five recommendations of effectively applying privacy‐preserving big data analytics to businesses. To the best of our knowledge, this is the first systematic study about state‐of‐the‐art in privacy‐preserving big data analytics. The managerial implication of our study is that organizations can apply the results of our critical analysis to strengthen their strategic deployment of big data analytics in business settings, and hence to better leverage big data for sustainable organizational innovation and growth.", "venue": "WIREs Data Mining Knowl. Discov.", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-10-07", "journal": {"name": "Wiley Interdisciplinary Reviews: Data Mining and Knowledge Discovery", "volume": "11"}, "authors": [{"authorId": "32198841", "name": "Md. Ileas Pramanik"}, {"authorId": "144031692", "name": "Raymond Y. K. Lau"}, {"authorId": "2609796", "name": "Md. Sakir Hossain"}, {"authorId": "2410963", "name": "Md-Mizanur Rahoman"}, {"authorId": "34841707", "name": "Sumon Kumar Debnath"}, {"authorId": "2126004501", "name": "Md. Golam Rashed"}, {"authorId": "2930118", "name": "Md. Zasim Uddin"}], "citations": [{"paperId": "cb0526865795954556bc3072e84336919dbe9a8d", "title": "Optimal Key Generation for Privacy Preservation in Big Data Applications Based on the Marine Predator Whale Optimization Algorithm"}, {"paperId": "9d78322de014bb9be6059bde440539fc832aa909", "title": "Applying data science approach to predicting diseases and recommending drugs in healthcare using machine learning models – A cardio disease case study"}, {"paperId": "827aa4f53afab4aa7fbb3aebdb80735f0e35068f", "title": "Analyzing the role of big data and its effects on the retail industry"}, {"paperId": "0d792da2ea1d68f996b5f5c5df7fc858128643f3", "title": "Connecting the Indispensable Roles of IoT and Artificial Intelligence in Smart Cities: A Survey"}, {"paperId": "c171a8a93a57e7a499890b1e77233b8d16d4d384", "title": "Machine learning and blockchain technologies for cybersecurity in connected vehicles"}, {"paperId": "52ec8dccb701f731a0fcfb904d9cdd3bd1d48a41", "title": "Developing a Smart Healthy City Using Twitter Big Data by Modified Deep Belief Network"}, {"paperId": "eb0928daefd356a74db3e0b075da205713eee301", "title": "AFPr-AM: A novel Fuzzy-AHP based privacy risk assessment model for strategic information management of social media platforms"}, {"paperId": "5da496f5fdd4b37509de731c3f0d27d00ba8057a", "title": "Systematic Survey: Secure and Privacy-Preserving Big Data Analytics in Cloud"}, {"paperId": "be72f75f31c4cd7bb12e634b6e6da017429069f1", "title": "A decision-support framework for data anonymization with application to machine learning processes"}, {"paperId": "f5b80c508f64473994b6d5933922c2e807806da5", "title": "Relevance of Big Data Analytics in Nigerian Academic Libraries: University of Ilorin Library Experience"}, {"paperId": "2f0a8a3da145984635862cc59ee4a033bf42b6f9", "title": "Research on privacy-preserving techniques in the era of the 5G applications"}, {"paperId": "c9e0826ec05763f6bb73908038d89e2afd38d67b", "title": "(k, m, t)‐anonymity: Enhanced privacy for transactional data"}, {"paperId": "ee29a83f09756d41568cac5f84082ccc55166ad8", "title": "Towards Secure Big Data Analysis via Fully Homomorphic Encryption Algorithms"}, {"paperId": "bf8d6af02fe19da97f4740bc4cd3da98ce9b1fa8", "title": "Social network data analysis to highlight privacy threats in sharing data"}, {"paperId": "c906562762bb96f4b720bc408dadb9b7c9a50f95", "title": "A Review on Privacy-Preserving Techniques in Data Analytics"}, {"paperId": "139b6704eec1aa38f61834c7d4497755f4408149", "title": "Privacy Preserving Data Mining"}, {"paperId": "2b75478afae209103e8beddf353abe677e84c9ba", "title": "Comprehensive Review on Development of Smart Cities Using Industry 4.0 Technologies"}, {"paperId": "ecb454ef240aca595c2a981ab3b637651de1c549", "title": "BIGDATA ANALYTICS IN REAL TIME: SECURITY AND PRIVACY CONCERNS"}, {"paperId": "a4d894dc43b7335c3ed00adb9918caa185e246c4", "title": "An Approach to Trade-off Privacy and Classification Accuracy in Machine Learning Processes"}, {"paperId": "8e74816fe95ee8fa1a6a28162f745a4ce7f03b6e", "title": "Anonymization of distribution feeder data using statistical distribution and parameter estimation approach"}, {"paperId": "1d6d3d0f3ed7a959ed298da1d5d1708f46e9b8f1", "title": "Cross-Social Network Investigation to Highlight Privacy Violations in Data Sharing Activities"}, {"paperId": "b351632f24f5f7417fa96119893e24c587c0333d", "title": "IoT and Big Data Applications in Smart Cities: Recent Advances, Challenges, and Critical Issues"}, {"paperId": "9bdb2e40b8dd5d0c8261ec149fd1e8cd6c444515", "title": "Normative and Empirical Evaluation of Privacy Utility Trade-off in Healthcare"}]}
