{"paperId": "7201559280a25dd295c2bf6d93609f76bc4198c8", "publicationVenue": {"id": "fcbcaf18-8ab1-43e1-a973-604bbc7e344e", "name": "Proceedings of the VLDB Endowment", "type": "journal", "alternate_names": ["Proceedings of The Vldb Endowment", "Proc VLDB Endow", "Proc Vldb Endow"], "issn": "2150-8097", "url": "http://dl.acm.org/toc.cfm?id=J1174", "alternate_urls": ["http://portal.acm.org/toc.cfm?CFID=21632689&CFTOKEN=99329904&WantType=Affiliated%20Organizations&coll=ACM&dl=ACM&id=J1174&idx=J1174&part=affil&title=VLDB%20Endowment&type=periodical"]}, "title": "Alibaba hologres", "abstract": "In existing big data stacks, the processes of analytical processing and knowledge serving are usually separated in different systems. In Alibaba, we observed a new trend where these two processes are fused: knowledge serving incurs generation of new data, and these data are fed into the process of analytical processing which further fine tunes the knowledge base used in the serving process. Splitting this fused processing paradigm into separate systems incurs overhead such as extra data duplication, discrepant application development and expensive system maintenance. In this work, we propose Hologres, which is a cloud native service for hybrid serving and analytical processing (HSAP). Hologres decouples the computation and storage layers, allowing flexible scaling in each layer. Tables are partitioned into self-managed shards. Each shard processes its read and write requests concurrently independent of each other. Hologres leverages hybrid row/column storage to optimize operations such as point lookup, column scan and data ingestion used in HSAP. We propose Execution Context as a resource abstraction between system threads and user tasks. Execution contexts can be cooperatively scheduled with little context switching overhead. Queries are parallelized and mapped to execution contexts for concurrent execution. The scheduling framework enforces resource isolation among different queries and supports customizable schedule policy. We conducted experiments comparing Hologres with existing systems specifically designed for analytical processing and serving workloads. The results show that Hologres consistently outperforms other systems in both system throughput and end-to-end query latency.", "venue": "Proceedings of the VLDB Endowment", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-08-01", "journal": {"name": "Proceedings of the VLDB Endowment", "pages": "3272 - 3284", "volume": "13"}, "authors": [{"authorId": "2144812187", "name": "Xiaowei Jiang"}, {"authorId": "2143966375", "name": "Y. Hu"}, {"authorId": "2068334814", "name": "Yu Xiang"}, {"authorId": "2149457075", "name": "Guang-min Jiang"}, {"authorId": "2149113213", "name": "Xiaojun Jin"}, {"authorId": "2131682626", "name": "Chen Xia"}, {"authorId": "2152123448", "name": "Weihua Jiang"}, {"authorId": "2180318908", "name": "Jun Yu"}, {"authorId": "2109611108", "name": "Haitao Wang"}, {"authorId": "2143612366", "name": "Yuan-yuan Jiang"}, {"authorId": "2143607123", "name": "Jihong Ma"}, {"authorId": "2069860307", "name": "Lina Su"}, {"authorId": "1764347", "name": "Kai Zeng"}], "citations": [{"paperId": "dfafb2ca044156ae0d03d51fa46bc05c36c876fc", "title": "Formal Modeling and Verifying Dubbo Using Process Algebra"}, {"paperId": "c4c193b3fca96a8b16f3dbe3247ad36389073537", "title": "Krypton: Real-time Serving and Analytical SQL Engine at ByteDance"}, {"paperId": "f4b1c42e55a84ed565fce6cfb6712d334dcb38ed", "title": "Presto: A Decade of SQL Analytics at Meta"}, {"paperId": "d1ae4ab5047489c2b010c7ce72262982ad66ad60", "title": "ByteGraph: A High-Performance Distributed Graph Database in ByteDance"}, {"paperId": "129633a30d42053cb9f5f3df19cc10468e50ef09", "title": "Remus: Efficient Live Migration for Distributed Databases with Snapshot Isolation"}, {"paperId": "1f6d7305ab2e71dca2694c3e22c70c9a607982df", "title": "Optimizing Data-intensive Systems in Disaggregated Data Centers with TELEPORT"}, {"paperId": "2f4f25fa165cd8808a7917320c8f30474838bccd", "title": "A Model and Survey of Distributed Data-Intensive Systems"}, {"paperId": "dae231d3f58c7237f56a4ff5dc889d4c86d81880", "title": "Real-time Data Infrastructure at Uber"}]}
