{"paperId": "720dc65627e53d7e227ed1e32a8baab33c9afddf", "publicationVenue": {"id": "6b6df2de-21bc-4137-9859-3fcef46f6a21", "name": "Mobile Information Systems", "type": "journal", "alternate_names": ["Mob Inf Syst"], "issn": "1574-017X", "url": "https://www.hindawi.com/journals/misy/", "alternate_urls": ["https://www.iospress.nl/journal/mobile-information-systems/", "https://www.iospress.nl/html/1574017x.php", "http://content.iospress.com/journals/mobile-information-systems"]}, "title": "Application of Digital Twins to Flexible Production Management: Taking a Shandong Factory as an Example", "abstract": "\n By enabling the merging of the virtual and real worlds, DT (Digital Twin) technology has considerably aided the development of businesses at both levels of digitization and networking in recent years. As an outcome, industrial research has shifted its attention to this new technology in the manufacturing business. However, there are still technical issues with DT technology, such as real-time data interaction, high integration of constituent elements, and high simulation. This paper proposes to solve these issues by presenting a framework that blends DT with 3D visualization technologies. A case study of an intelligent logistics management 3D scheduling system for a factory in Shandong verifies the applicability of digital twins to flexible production management. The example demonstrates that the framework can be synchronizing the virtual and real systems. Moreover, the framework can effectively cover the whole manufacturing life cycle, enhance production efficiency and product quality, and achieve flexible production management, helping the manufacturing industry's digital and intelligent transition.", "venue": "Mobile Information Systems", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-01-13", "journal": {"name": "Mobile Information Systems"}, "authors": [{"authorId": "2074326636", "name": "Wenxue Ran"}, {"authorId": "2149298324", "name": "Yimin Hu"}, {"authorId": "2149981873", "name": "Yang Zhi"}], "citations": [{"paperId": "540e8b0a49b6b852a207a647f1ebe769513acf18", "title": "Transforming the Future of Furniture Woodworking Instruction Through VR-Enhanced Distance Teaching During the COVID-19 Pandemic"}, {"paperId": "3a6e1df171667c9e6b883b959baaef81b3e541e8", "title": "Production logistics digital twins: Research profiling, application, challenges and opportunities"}, {"paperId": "b1c54ba0e918bf835440f58f95e5d8eb209615a3", "title": "Factors influencing behavior intentions to use virtual reality in education"}]}
