{"paperId": "7216c6ed224b0c71f80b66b1447c425587cd75c2", "publicationVenue": {"id": "86daa573-0639-4ad6-a9c9-eb62790ca310", "name": "International Conference on the Internet, Cyber Security and Information Systems", "type": "conference", "alternate_names": ["ICICIS", "Int Conf Internet Cyber Secur Inf Syst"]}, "title": "On Development of Computer Aided System for Detecting Brain Neurological Disorders", "abstract": "Brain Neurological disorder is a serious disease that affects human's brain and may cause him to suffer. Computer Aided Systems have emerged in our daily life to provide support for the doctors and have become promising tools that assist healthcare professionals in predicting and diagnosing pathologies and recommend treatments for individual patients. This survey paper aims to provide a comprehensive overview of the current state of computer-aided systems for detecting brain neurological disorders including Alzheimer's disease and Autism spectrum disorders. The paper focuses on gathering the most popular datasets with different types such as EEG and fMRI that were utilized in the development and evaluation of these systems. We explored diverse range of features employed in these datasets which are vitally important for the precise identification and classification of brain neurological disorders. Additionally, recent studies in this field are collected and analyzed, with a particular emphasis on the methodologies utilized in the design and implementation of their models. These encompass traditional machine learning algorithms such as SVM, RF, DT and K-NN, as well as deep learning approaches, including CNN, DNN and Autoencoders. The findings are presented in a table format, showcasing the accuracy results of the different methodologies, sorted in descending order. Furthermore, the paper concludes by presenting insightful charts for statistical analysis that can guide researchers in understanding the current state of the art in this field to assist them in the development of more accurate, efficient, and accessible tools, utilizing the data accumulated throughout the survey paper, to enable early detection, diagnosis and ultimately improving patient outcomes and quality of life.", "venue": "International Conference on the Internet, Cyber Security and Information Systems", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference", "Review"], "publicationDate": "2023-11-21", "journal": {"name": "2023 Eleventh International Conference on Intelligent Computing and Information Systems (ICICIS)", "pages": "94-101"}, "authors": [{"authorId": "1419458601", "name": "Nada S. El-Askary"}, {"authorId": "2279922627", "name": "Mohamed Mabrouk Morsey"}, {"authorId": "2279916174", "name": "Abeer M. Mahmoud"}, {"authorId": "2091631258", "name": "Taha El-Arif"}], "citations": []}
