{"paperId": "721747f4479f1fca3c080669f8d9989f3b09bb4f", "publicationVenue": {"id": "73df6053-f5c6-46a6-aefc-8a109c2edd9d", "name": "EUROMICRO Conference on Software Engineering and Advanced Applications", "type": "conference", "alternate_names": ["EUROMICRO Conf Softw Eng Adv Appl", "SEAA", "Softw Eng Adv Appl", "Software Engineering and Advanced Applications"], "url": "http://www.euromicro.org/"}, "title": "A systematic mapping of performance in distributed stream processing systems", "abstract": "Several software systems are built upon stream processing architectures to process large amounts of data in near real-time. Today’s distributed stream processing systems (DSPSs) spread the processing among multiple machines to provide scalable performance. However, high-performance and Quality of Service (QoS) in distributed stream processing are challenging to predict, achieve, and maintain. While many studies focus on evaluating or improving the performance of stream processing, getting a comprehensive view of the current state of DSPSs and their performance in real-world deployments is challenging. In this paper, we present a systematic mapping study of the literature on DSPSs’ performance. We discuss existing challenges, the most used DSPSs, achieved performance, and future trends. Our results demonstrate that performance is still one of the major concerns in stream processing, with several solutions available and different outcomes regarding the metrics, execution environments, and use cases considered. Moreover, there is a need for better benchmarks and workloads as well as for performance improvements by increasing efficiency and utilizing modern hardware. Our study intends to help software engineering practitioners and researchers to understand how to choose the most suitable DSPS to build efficient data-intensive architectures.", "venue": "EUROMICRO Conference on Software Engineering and Advanced Applications", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-09-06", "journal": {"name": "2023 49th Euromicro Conference on Software Engineering and Advanced Applications (SEAA)", "pages": "293-300"}, "authors": [{"authorId": "2277535913", "name": "Adriano Vogel"}, {"authorId": "2277535340", "name": "Sören Henning"}, {"authorId": "48104573", "name": "Otmar Ertl"}, {"authorId": "2277533356", "name": "Rick Rabiser"}], "citations": [{"paperId": "8f876c2a8f9766606fe18272535a728f3c04afc0", "title": "Benchmarking scalability of stream processing frameworks deployed as microservices in the cloud"}]}
