{"paperId": "7220ecb2382fcd98597cc7820f8997e7455235ea", "publicationVenue": {"id": "159fd374-26d0-4834-b50f-c353928fd782", "name": "Robotica (Cambridge. Print)", "type": "journal", "alternate_names": ["Robotica", "Robot (cambridge Print"], "issn": "0263-5747", "url": "https://www.cambridge.org/core/journals/robotica", "alternate_urls": ["http://journals.cambridge.org/ROB", "http://journals.cambridge.org/action/displayJournal?jid=ROB"]}, "title": "Selective 6D grasping with a collision avoidance system based on point clouds and RGB+D images", "abstract": "Abstract In recent years, deep learning-based robotic grasping methods have surpassed analytical methods in grasping performance. Despite the results obtained, most of these methods use only planar grasps due to the high computational cost found in 6D grasps. However, planar grasps have spatial limitations that prevent their applicability in complex environments, such as grasping manufactured objects inside 3D printers. Furthermore, some robotic grasping techniques only generate one feasible grasp per object. However, it is necessary to obtain multiple possible grasps per object because not every grasp generated is kinematically feasible for the robot manipulator or does not collide with other close obstacles. Therefore, a new grasping pipeline is proposed to yield 6D grasps and select a specific object in the environment, preventing collisions with obstacles nearby. The grasping trials are performed in an additive manufacturing unit that has a considerable level of complexity due to the high chance of collision. The experimental results prove that it is possible to achieve a considerable success rate in grasping additive manufactured objects. The UR5 robot arm, Intel Realsense D435 camera, and Robotiq 2F-140 gripper are used to validate the proposed method in real experiments.", "venue": "Robotica (Cambridge. Print)", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-10-18", "journal": {"name": "Robotica", "pages": "3772 - 3787", "volume": "41"}, "authors": [{"authorId": "2141704047", "name": "C. C. B. Viturino"}, {"authorId": "2260530309", "name": "Andre Gustavo Scolari Conceicao"}], "citations": []}
