{"paperId": "722a0024a864b98b0388ac52a5b266b9f26a8272", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Anomaly-Based Intrusion Detection Systems in IoT Using Deep Learning: A Systematic Literature Review", "abstract": "The Internet of Things (IoT) concept has emerged to improve people’s lives by providing a wide range of smart and connected devices and applications in several domains, such as green IoT-based agriculture, smart farming, smart homes, smart transportation, smart health, smart grid, smart cities, and smart environment. However, IoT devices are at risk of cyber attacks. The use of deep learning techniques has been adequately adopted by researchers as a solution in securing the IoT environment. Deep learning has also successfully been implemented in various fields, proving its superiority in tackling intrusion detection attacks. Due to the limitation of signature-based detection for unknown attacks, the anomaly-based Intrusion Detection System (IDS) gains advantages to detect zero-day attacks. In this paper, a systematic literature review (SLR) is presented to analyze the existing published literature regarding anomaly-based intrusion detection, using deep learning techniques in securing IoT environments. Data from the published studies were retrieved from five databases (IEEE Xplore, Scopus, Web of Science, Science Direct, and MDPI). Out of 2116 identified records, 26 relevant studies were selected to answer the research questions. This review has explored seven deep learning techniques practiced in IoT security, and the results showed their effectiveness in dealing with security challenges in the IoT ecosystem. It is also found that supervised deep learning techniques offer better performance, compared to unsupervised and semi-supervised learning. This analysis provides an insight into how the use of data types and learning methods will affect the performance of deep learning techniques for further contribution to enhancing a novel model for anomaly intrusion detection and prediction.", "venue": "Applied Sciences", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2021-09-09", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "2119300726", "name": "Muaadh A. Alsoufi"}, {"authorId": "2965137", "name": "S. Razak"}, {"authorId": "38263858", "name": "M. M. Siraj"}, {"authorId": "3343720", "name": "I. Nafea"}, {"authorId": "2272279", "name": "Fuad A. Ghaleb"}, {"authorId": "2689948", "name": "Faisal Saeed"}, {"authorId": "52428050", "name": "Maged Nasser"}], "citations": [{"paperId": "a462c2abb486b56a12e8b379d7f8ba38c16a4b1b", "title": "Beta Hebbian Learning for intrusion detection in networks with MQTT Protocols for IoT devices"}, {"paperId": "70f95a330bee2da3954bb89347e94a74e269d085", "title": "Attack classification in network intrusion detection system based on optimization strategy and deep learning methodology"}, {"paperId": "27b4a1db8b86be6dd1bc283d3bb541901380e986", "title": "A review of security attacks and intrusion detection in the vehicular networks"}, {"paperId": "4f7b9f0541cbcd7f9e77397d3050322f7142468e", "title": "A Lightweight and Efficient IoT Intrusion Detection Method Based on Feature Grouping"}, {"paperId": "f0d3062263683c5023882ba5bc282e7e70981447", "title": "A novel IoT intrusion detection framework using Decisive Red Fox optimization and descriptive back propagated radial basis function models"}, {"paperId": "f587f18d5d693810a44af7da6eb7ed70861cc000", "title": "IoT Intrusion Detection: Evaluating ML-Based IDS on Image and Network Traffic Datasets"}, {"paperId": "855d124ed1e74c6073a055d57d35bde583c55b5c", "title": "DANTD: A Deep Abnormal Network Traffic Detection Model for Security of Industrial Internet of Things Using High-Order Features"}, {"paperId": "8acd0f1d6ebba941ad50a9eaf0aa758c79e4980c", "title": "Using Supervised Learning to Detect Command and Control Attacks in IoT"}, {"paperId": "74721f23f71a1cb946ce72476e6927a19679ae96", "title": "AIBPSF-IoMT: Artificial Intelligence and Blockchain-Based Predictive Security Framework for IoMT Technologies"}, {"paperId": "358259d32cd6ae81be7c9ec5ffa479a53ad74cd6", "title": "Deep Learning-Assisted Physical Education and Resource Allocation Management in Higher Education"}, {"paperId": "3bca61e97a4e5dc05cea4d13d0435f1bf1d0bbed", "title": "The Internet of Things for Smart Farming: Measuring Productivity and Effectiveness"}, {"paperId": "472b0f00cc6020b3e8ee2c68f848a304ce6be2e4", "title": "A systematic literature review of recent lightweight detection approaches leveraging machine and deep learning mechanisms in Internet of Things networks"}, {"paperId": "04bd50d005c6faa2906b6a67ebccf1e5d130b7fa", "title": "Optimization of Network Security in University Laboratories Based on Anomaly Intrusion Detection in Public Cloud Networks"}, {"paperId": "7dd1da8da4eb8aa4e7e4e0966dad98b064f2e625", "title": "Novel Intrusion Detection Algorithm of Information System based on RBM-KSVM"}, {"paperId": "5770e9f3527eb1b39ab63c589bbd7a10557363fa", "title": "A novel deep learning based intrusion detection system for the IoT-Cloud platform with blockchain and data encryption mechanisms"}, {"paperId": "10cdcee86f3a5d279fc4eb0a02f230e5c3744965", "title": "IoT Anomaly Detection to Strengthen Cybersecurity in the Critical Infrastructure of Smart Cities"}, {"paperId": "f4ee596aeb6dcc991dfc4f5d4a31b08a1a5a2636", "title": "An unsupervised TinyML approach applied to the detection of urban noise anomalies under the smart cities environment"}, {"paperId": "99c0f6aceab8662229cfd507dd3b6a3a508d066e", "title": "An early discovery of intrusion attack using novel optimized deep learning for internet of things"}, {"paperId": "d46c10ef77d0f996b9048e85d40fce53a922e636", "title": "A conjugate self-organizing migration (CSOM) and reconciliate multi-agent Markov learning (RMML) based cyborg intelligence mechanism for smart city security"}, {"paperId": "bf727137bb25c937b92919f51c660a780f911bed", "title": "Towards an efficient model for network intrusion detection system (IDS): systematic literature review"}, {"paperId": "c0e6a1cfb6a08f2d28d290e705488a33728b4ddc", "title": "Enhancing IoT Security Through AI-Based Anomaly Detection and Intrusion Prevention"}, {"paperId": "b22ef4eb9d6fdb464def68b9b1cc589bbf3a54d4", "title": "A Double-Layer Indemnity Enhancement Using LSTM and HASH Function Technique for Intrusion Detection System"}, {"paperId": "08f1bb6799d403b951a2dba0e29246538f83c7e6", "title": "Intrusive Detection Techniques Utilizing Machine Learning, Deep Learning, and Anomaly-based Approaches"}, {"paperId": "be9b6e2ae5f617fb6ee261d9aba79e5831ee158b", "title": "Machine Learning Approach for Anomaly-Based Intrusion Detection Systems Using Isolation Forest Model and Support Vector Machine"}, {"paperId": "a351a674b301d87006a779f2af0fe02341d33e3a", "title": "A feature enhancement-based model for the malicious traffic detection with small-scale imbalanced dataset"}, {"paperId": "397e62e9278133d413d53fbeece3aa00add4fc37", "title": "Dynamic Adaptation Attack Detection Model for a Distributed Multi-Access Edge Computing Smart City"}, {"paperId": "413a7b1e22b513f0864cd8d92cf8097efaace8e7", "title": "Comparative Analysis of Stack-Ensemble-Based Intrusion Detection System for Single-Layer and Cross-layer DoS Attack Detection in IoT"}, {"paperId": "1a13e5a1146c76d122c6feddf19d6e1f562cdedd", "title": "Decentralized Online Federated G-Network Learning for Lightweight Intrusion Detection"}, {"paperId": "3c20818b4be01efb3afa0127d39eafbedd2673db", "title": "Exploring the tractability of data fusion models for detecting anomalies in IoT-based dataset"}, {"paperId": "32633b6058c520172af87044dd4494acb9f25a67", "title": "Computer Vision-Based Intrusion Detection System for Internet of Things"}, {"paperId": "644f9ad5c9ea8f5874b833beccd5d4019d97bffa", "title": "Intrusion detection in internet of things-based smart farming using hybrid deep learning framework"}, {"paperId": "274839ca1df854c19e5c4a547717a0801c531208", "title": "Improving Reliability for Detecting Anomalies in the MQTT Network by Applying Correlation Analysis for Feature Selection Using Machine Learning Techniques"}, {"paperId": "931dc63d4fe0f23ec280634d512e8a4ac23e3076", "title": "Contrastive Learning Over Random Fourier Features for IoT Network Intrusion Detection"}, {"paperId": "d1fd69c8237784c8cace3ea7782bd44dcb3895c8", "title": "Securing a Smart Home with a Transformer-Based IoT Intrusion Detection System"}, {"paperId": "fd71f6eb79e84d95767c35a9975568c4a1dcbf6d", "title": "Intrusion Detection Using Chaotic Poor and Rich Optimization with Deep Learning Model for Smart City Environment"}, {"paperId": "e06f20abe33bd6a25e149821e5bb28e3043588dc", "title": "Intrusion detection method for internet of things based on the spiking neural network and decision tree method"}, {"paperId": "65628a5e65dce210f41b256f7ace47d63e691ef4", "title": "A systematic literature review for network intrusion detection system (IDS)"}, {"paperId": "e1dfa5200fc5aa3d1af534b47285141bcff385fa", "title": "Reinforcement Learning Based Intrusion Detection Systems for Drones: A Brief Survey"}, {"paperId": "0d768d4e3cc398e767d565ba54e749e986aafe9e", "title": "Rethinking the Operation Pattern for Anomaly Detection in Industrial Cyber–Physical Systems"}, {"paperId": "66d6d46368d02215cf192a1c3d5d6b23808c91c4", "title": "HH-NIDS: Heterogeneous Hardware-Based Network Intrusion Detection Framework for IoT Security"}, {"paperId": "ce8c93b95487c4bd6fabfb772601c0be19b369e1", "title": "IoT Based Intrusion Detection Systems from The Perspective of Machine and Deep Learning: A Survey and Comparative Study"}, {"paperId": "633798d826e6ae4afe000d66b1638f7f2185334a", "title": "Towards achieving lightweight intrusion detection systems in Internet of Things, the role of incremental machine learning: A systematic literature review"}, {"paperId": "86d05bfe3f39dbb766c153e4819cb440b175f81e", "title": "An intrusion detection system based on hybrid machine learning classifier"}, {"paperId": "f9977d944ed8f192f9f3671f55dc917da75dcba6", "title": "Feature Representation for Network Intrusion Detection System Trough Embedding Neural Network"}, {"paperId": "7683a86fb7dad95ceef3d5fa5c369a8b10d32a0d", "title": "Anomaly-based detection Technique using Deep Learning for Internet of Things: A Survey"}, {"paperId": "0f4fd5beac28d608669cfcc2277285273b7cd416", "title": "Classification of Botnet Attacks in IoT Using a Convolutional Neural Network"}, {"paperId": "46a608ed23daa337f17b91bfae84abf32cda0b3e", "title": "A two-tier hybrid ensemble learning pipeline for intrusion detection systems in IoT networks"}, {"paperId": "1c6c246b1dc8ebbca111b79b0a9e3d319643eaf8", "title": "A Modified Hybrid Method Based on PSO, GA, and K-Means for Network Anomaly Detection"}, {"paperId": "56f96793d2a1a21c9a84260a62f380d6ae51d0fa", "title": "Securing Smart Home Environment Using Edge Computing"}, {"paperId": "7065e70835ed5e3f4ff1ae4f1d52bee19a2b4a7b", "title": "Identification and prediction of attacks to industrial control systems using temporal point processes"}, {"paperId": "b802cd1d49558201cfb99265ca5c4b0b94375c48", "title": "Comparative analysis of soft computing approaches of zero-day-attack detection"}, {"paperId": "0a4afc810e208c0a147798c9e9737c4185a796c0", "title": "Accuracy determination using deep learning technique in cloud-based IoT sensor environment"}, {"paperId": "6e5e5171649621ae18611f6edf08e42465e8285e", "title": "AI federated learning based improvised random Forest classifier with error reduction mechanism for skewed data sets"}, {"paperId": "297193efeb0accaad18d29c956f01fc3d5db8dfc", "title": "Comparison of CNN and DNN Performance on Intrusion Detection System"}, {"paperId": "fd9fd54f887672ba57a54e8538ec5c18545529cf", "title": "Towards an Effective Intrusion Detection Model Using Focal Loss Variational Autoencoder for Internet of Things (IoT)"}, {"paperId": "6091b63acbdb43b472f01c6bf923b5095f8b1d3d", "title": "Towards an Explainable Universal Feature Set for IoT Intrusion Detection"}, {"paperId": "e6c57faec8cc5a1b0519a188134a4935d5154b53", "title": "Adaptive IDS for Cooperative Intelligent Transportation Systems Using Deep Belief Networks"}, {"paperId": "8685507d4d0029ab224dd8dd24afe9a66aafdfb7", "title": "Detecção de Ataques de Botnets em IoT via Variational Autoencoder"}, {"paperId": "6d6147d29202c86f23ee8ce1b00659fa5720380f", "title": "Intrusion Detection in Internet of Things Systems: A Review on Design Approaches Leveraging Multi-Access Edge Computing, Machine Learning, and Datasets"}, {"paperId": "07b4a2661d6428e18c5e15740a584acafb575ae1", "title": "Feature Reduction for Molecular Similarity Searching Based on Autoencoder Deep Learning"}, {"paperId": "693de46d8ce2ae33a97ab1cb2db556de565c3805", "title": "Benchmarking Deep Learning Methods for Behaviour-Based Network Intrusion Detection"}, {"paperId": "8dc1327712f6cb77df4c8ea823fc93b042036ce4", "title": "Combining Unsupervised Approaches for Near Real-Time Network Traffic Anomaly Detection"}, {"paperId": "6f5b87e38cfb4a47e3ac7988cca5612ccf0a2946", "title": "Detecting Cybersecurity Attacks in Internet of Things Using Artificial Intelligence Methods: A Systematic Literature Review"}, {"paperId": "6fa83887681886a8235f51160b162397f33db2d2", "title": "An Aggregated Mutual Information Based Feature Selection with Machine Learning Methods for Enhancing IoT Botnet Attack Detection"}, {"paperId": "6bf59c30ef8a08cdcd87ef1ae3dd3f36bb8f8792", "title": "A Comprehensive Study of Anomaly Detection Schemes in IoT Networks Using Machine Learning Algorithms"}, {"paperId": "4228be3804b4abd358c2a18ac1110368c37a64e2", "title": "IoT Security Challenges: Cloud and Blockchain, Postquantum Cryptography, and Evolutionary Techniques"}, {"paperId": "80fac5f4fa6dfbe0539f877016ab19451c817fb8", "title": "Application of Deep Learning for Quality of Service Enhancement in Internet of Things: A Review"}, {"paperId": "fd347e004c2b6fcf62cc84bec43070cf1e27b6ec", "title": "Enhancing Security of Host-Based Intrusion Detection Systems for the Internet of Things"}, {"paperId": "1c0bcc0c5eee0fab9a41b7248e16f1103b52ed49", "title": "Review on Approaches of Federated Modeling in Anomaly-Based Intrusion Detection for IoT Devices"}, {"paperId": "d250fc08c51d651070cc92169daecb99b331bb70", "title": "Deep learning algorithms for IoT security(survey)"}, {"paperId": "569cafb72135a96fc6c75f05c9422274c4a7264a", "title": "Deep Learning-Assisted Security and Privacy Provisioning in the Internet of Medical Things Systems: A Survey on Recent Advances"}, {"paperId": "2f7777e49476a4af1b862423882bf2ff5f144424", "title": "Hybrid Chain: Blockchain Enabled Framework for Bi-Level Intrusion Detection and Graph-Based Mitigation for Security Provisioning in Edge Assisted IoT Environment"}, {"paperId": "7d2fc0161d45b441004dfd8d6d483c20d2b0d6f9", "title": "Distributed System for Predicting Malicious Activity in Computer Networks"}, {"paperId": "4edd753adb25a14aff715d875ed61a1669549d4d", "title": "Securing Intrusion Detection Systems in IoT Networks Against Adversarial Learning: A Moving Target Defense Approach based on Reinforcement Learning"}, {"paperId": "e3d9bb4407b4b85ff5f9336828545c4039ae13c1", "title": "A Fine-Grained System Driven of Attacks Over Several New Representation Techniques Using Machine Learning"}, {"paperId": "773c91e25e7ebe1c98e6e95e8511298d45e76364", "title": "A new model for security analysis of network anomalies for IoT devices"}, {"paperId": "4363fd280a021f219fec474a79ad40b576f9bf6b", "title": "A Novel Tunicate Swarm Algorithm With Hybrid Deep Learning Enabled Attack Detection for Secure IoT Environment"}, {"paperId": "cd1e35135c998fdc46a786f2f74fc7d96793073a", "title": "A Data-Centric Anomaly-Based Detection System for Interactive Machine Learning Setups"}, {"paperId": "4dce79134d7c533ea49e2f0036e9efe912e8f247", "title": "Cyber-Security of Industrial Internet of Things in Electric Power Systems"}, {"paperId": "7c6a3de3c41474ab67858b130a0b2cce16b50a9a", "title": "Cyber Intrusion detection in Industry 4.0 Data using Machine Learning"}]}
