{"paperId": "7233dd6e98ef5a60195cf2ee4130512301faa6f4", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Recent Technologies, Security Countermeasure and Ongoing Challenges of Industrial Internet of Things (IIoT): A Survey", "abstract": "The inherent complexities of Industrial Internet of Things (IIoT) architecture make its security and privacy issues becoming critically challenging. Numerous surveys have been published to review IoT security issues and challenges. The studies gave a general overview of IIoT security threats or a detailed analysis that explicitly focuses on specific technologies. However, recent studies fail to analyze the gap between security requirements of these technologies and their deployed countermeasure in the industry recently. Whether recent industry countermeasure is still adequate to address the security challenges of IIoT environment are questionable. This article presents a comprehensive survey of IIoT security and provides insight into today’s industry countermeasure, current research proposals and ongoing challenges. We classify IIoT technologies into the four-layer security architecture, examine the deployed countermeasure based on CIA+ security requirements, report the deficiencies of today’s countermeasure, and highlight the remaining open issues and challenges. As no single solution can fix the entire IIoT ecosystem, IIoT security architecture with a higher abstraction level using the bottom-up approach is needed. Moving towards a data-centric approach that assures data protection whenever and wherever it goes could potentially solve the challenges of industry deployment.", "venue": "Italian National Conference on Sensors", "year": 2021, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2021-10-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "21"}, "authors": [{"authorId": "73217613", "name": "S. Tan"}, {"authorId": "1934725", "name": "A. Samsudin"}], "citations": [{"paperId": "84048541467adcd826300b9af3c01332597e0b6e", "title": "Next-gen security in IIoT: integrating intrusion detection systems with machine learning for industry 4.0 resilience"}, {"paperId": "11facb5f4cb932260686959aacad26c8d159d1c8", "title": "A Smart-Contract-Based Policy-Domain Access Control Framework for Distributed Industrial IoT"}, {"paperId": "4b5753d6e6c03c05a84da9b2adc031ad1669f5a6", "title": "A New Lightweight and Secure Certificateless Aggregate Signcryption Scheme for Industrial Internet of Things"}, {"paperId": "617f32889ce02a0ae29dcf06ba29f9a4e8a6de51", "title": "A Systematic Survey of Machine Learning and Deep Learning Models Used in Industrial Internet of Things Security"}, {"paperId": "6d00e9cf0daae7572951d90282e1441bdfb2d3de", "title": "Enhancing Security and Flexibility in the Industrial Internet of Things: Blockchain-Based Data Sharing and Privacy Protection"}, {"paperId": "5ade280c4d9cb28b07845fb43ee32079fcc30d84", "title": "Privacy and security issues in fog-to-fog communication: A survey"}, {"paperId": "93f2b4b847fbb3044badba5fe31ba459d4209bf2", "title": "A Dynamic IIoT Framework Based on the Publish–Subscribe Paradigm"}, {"paperId": "bc308ae36ee3f29ff81401fa5edd203aa4179ea4", "title": "Trust-based Approaches Towards Enhancing IoT Security: A Systematic Literature Review"}, {"paperId": "8d9a3e7dd6bbc490445dab6aa9140eca520f2d16", "title": "Market Research on IIoT Standard Compliance Monitoring Providers and deriving Attributes for IIoT Compliance Monitoring"}, {"paperId": "b254ddef927bf53a8dcbbc7f9bc5de9deb104f7d", "title": "Blockchain and federated learning-based intrusion detection approaches for edge-enabled industrial IoT networks: a survey"}, {"paperId": "f950a7cb0c550fc06f57978520953f44a29408d2", "title": "Timeseries on IIoT Platforms: Requirements and Survey for Digital Twins in Process Industry"}, {"paperId": "fcc5e826394c02f687b0830d48641f3a9eddc084", "title": "A Survey on Industrial Internet of Things Security: Requirements, Attacks, AI-Based Solutions, and Edge Computing Opportunities"}, {"paperId": "d0521e801cb8d692a33eb3a199b5cc135e2eff79", "title": "An Industrial Case Study on the Monitoring and Maintenance Service System for a Robot-Driven Polishing Service System under Industry 4.0 Contexts"}, {"paperId": "b2d29a552ee06fdcf0e2d27052f6df6f323a5d28", "title": "Advanced Persistent Threats and Their Defense Methods in Industrial Internet of Things: A Survey"}, {"paperId": "e8b7a78afee0470653bb45c0af25e7869d0d6e5e", "title": "A Review on Protecting SCADA Systems from DDOS Attacks"}, {"paperId": "69902cae166bb3ffbaa19b70f18c7a5ba9f95be4", "title": "Data acquisition and monitoring system framed in Industrial Internet of Things for PEM hydrogen generators"}, {"paperId": "99773fe8d62c8f38c3deee545b7b2916da77014b", "title": "An artificial intelligence lightweight blockchain security model for security and privacy in IIoT systems"}, {"paperId": "ac0c1ae9ceb1f2710a3800b5405f43beb8f2475f", "title": "Privacy-preserving data dissemination scheme based on Searchable Encryption, publish-subscribe model, and edge computing"}, {"paperId": "a23db08111da5f166621323d42ac2ddf2e8098fd", "title": "Analysis of Recent IIoT Security Technology Trends in a Smart Factory Environment"}, {"paperId": "d32844fb9b9882a9bc1dd5a93fbb0c8b1ccef3ef", "title": "Elliptic Curve-Based Query Authentication Protocol for IoT Devices Aided by Blockchain"}, {"paperId": "a7cf44af9c99bce437799b642d0643361fea9eeb", "title": "Analysis of architectures implemented for IIoT"}, {"paperId": "60d8019e5f8ee8637d028e11812da066fc760330", "title": "Modeling User-Centric Threats in Smart City: A Hybrid Threat Modeling Method"}, {"paperId": "126eba16b1bf6afdf186c635b33cf1dbfe28f7d3", "title": "Anomaly Detection in Encrypted Identity Resolution Traffic based on Machine Learning"}, {"paperId": "076d04ceb138dfbd3c301776831e28449c4c5b0e", "title": "An Overview and Ontology of Privacy to Preserve Privacy in Ultra-Wideband Networks"}, {"paperId": "ee4557abfb59e4de477043402e5935f8cc3be1ef", "title": "Towards a blockchain-SDN-based secure architecture for cloud computing in smart industrial IoT"}, {"paperId": "671e4aa47e2266b021c8662d44fb61bc7b7b8e25", "title": "A Blockchain-Based Intrusion Detection System Using Viterbi Algorithm and Indirect Trust for IIoT Systems"}, {"paperId": "2cbf3a5a274c475c1149122aabf1f84a94fbf636", "title": "Key Challenges and Emerging Technologies in Industrial IoT Architectures: A Review"}, {"paperId": "14c2ad3570162a5d52ba9bea58fc9b089d051ed4", "title": "Distributed and Privacy-Preserving Data Dissemination at the Network Edge via Attribute-Based Searchable Encryption"}, {"paperId": "dbb887e2267c5367f91dd226839455c526c4cc92", "title": "Scanner-Hunter: An Effective ICS Scanning Group Identification System"}, {"paperId": "671e7614dc5c6db8793eb078e027e4d04eb15e13", "title": "Industrial internet of things (IIoT): opportunities, challenges, and requirements in manufacturing businesses in emerging economies"}, {"paperId": "170b96ec9e4f3ba307ab53bf605d9b1c5b2f8b64", "title": "A Critical Survey of EEG-Based BCI Systems for Applications in Industrial Internet of Things"}, {"paperId": "43d35093ed41c17bef34c9ad5367d0e2917355eb", "title": "Internet of Things (IoT) Security With Blockchain Technology: A State-of-the-Art Review"}, {"paperId": "cfc61e2ab264d7bf3f42ab570e0b26b1d128a160", "title": "An Enhanced Approach for CP-ABE with Proxy Re-encryption in IoT Paradigm"}]}
