{"paperId": "725195ddc1f74e0ac346ef23891524021115fc13", "publicationVenue": {"id": "44aabbb9-28ab-46d0-845f-3dd44a78fb59", "name": "Frontiers of Information Technology & Electronic Engineering", "alternate_names": ["Front Inf Technol  Electron Eng"], "issn": "2095-9184", "url": "http://erf.sbb.spk-berlin.de/han/caj/eng.oversea.cnki.net/kns55/oldnavi/n_item.aspx?BaseID=JZUS&Flg=local&NaviID=48&NaviLink="}, "title": "Resource scheduling techniques in cloud from a view of coordination: a holistic survey", "abstract": "Nowadays, the management of resource contention in shared cloud remains a pending problem. The evolution and deployment of new application paradigms (e.g., deep learning training and microservices) and custom hardware (e.g., graphics processing unit (GPU) and tensor processing unit (TPU)) have posed new challenges in resource management system design. Current solutions tend to trade cluster efficiency for guaranteed application performance, e.g., resource over-allocation, leaving a lot of resources underutilized. Overcoming this dilemma is not easy, because different components across the software stack are involved. Nevertheless, massive efforts have been devoted to seeking effective performance isolation and highly efficient resource scheduling. The goal of this paper is to systematically cover related aspects to deliver the techniques from the coordination perspective, and to identify the corresponding trends they indicate. Briefly, four topics are involved. First, isolation mechanisms deployed at different levels (micro-architecture, system, and virtualization levels) are reviewed, including GPU multitasking methods. Second, resource scheduling techniques within an individual machine and at the cluster level are investigated, respectively. Particularly, GPU scheduling for deep learning applications is described in detail. Third, adaptive resource management including the latest microservice-related research is thoroughly explored. Finally, future research directions are discussed in the light of advanced work. We hope that this review paper will help researchers establish a global view of the landscape of resource management techniques in shared cloud, and see technology trends more clearly. 当前公有云中的资源竞争管控仍然是一个悬而未决的问题。新型应用框架（如深度学习和微服务）和专用硬件（如GPU和TPU）的开发与部署给资源管理系统的设计带来新的挑战。现有的解决方案往往为保证应用性能而牺牲集群效率，如资源超额分配导致的低利用率。由于涉及到了软件栈中的不同模块，突破该困境并非易事。尽管如此，产学界为寻找高效的性能隔离和资源调度进行了大量的研究。本文从协同的角度对相关工作进行了全面概述，并揭示其中的技术发展趋势。简言之，本文涉及如下四个主题：不同层次上（包括微体系结构、系统和虚拟层）的资源隔离机制，包括GPU多任务处理；机器层和集群层的资源调度技术，包括面向深度学习应用的GPU调度技术；自适应资源管理技术，包括微服务相关的最新研究；最后探讨了未来的研究方向。希望本文能帮助相关研究人员了解公有云中资源管理技术的概貌，并更好地把握其发展趋势。", "venue": "Frontiers of Information Technology & Electronic Engineering", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-01-01", "journal": {"name": "Frontiers of Information Technology & Electronic Engineering", "pages": "1-40", "volume": "24"}, "authors": [{"authorId": "2108824193", "name": "Yuzhao Wang"}, {"authorId": "2153201683", "name": "Junqing Yu"}, {"authorId": "145202330", "name": "Zhibin Yu"}], "citations": []}
