{"paperId": "726289b8e1b09e8f12fd02fa459f9ab24db375fd", "publicationVenue": {"id": "c0ded351-0e49-473e-816e-23b84c9f8dd3", "name": "Frontiers in Environmental Science", "type": "journal", "alternate_names": ["Front Environ Sci"], "issn": "2296-665X", "url": "http://www.frontiersin.org/Environmental_Science", "alternate_urls": ["https://www.frontiersin.org/journals/environmental-science"]}, "title": "Performance and sustainability evaluation of rural digitalization and its driving mechanism: evidence from Hunan province of China", "abstract": "Quantitatively measuring rural digitalization performance and development sustainability, identifying their key influencing factors and figuring out their driving mechanisms are of great value to policy design for rural revitalization and management. This paper analyzed the sustainable development degree, spatial patterns, and influencing factors of rural digitization in Hunan Province, China, based on a combination of PSR, TOPSIS, ESDA, GWR and GeoDetector, in an attempt to provide a basis for the planning and policy design of rural management. The sustainability and construction performance of rural digitalization in Hunan were characterized by significant spatial inequality and positive autocorrelation, with coefficients of variation of 0.33 and 0.24, and Moran’s I values of 0.29 and 0.34, respectively. The rural digitalization in Hunan showed significant non-equilibrium across different dimensions and brought forward diversified combination patterns, including single dimensional leadership, dual dimensional leadership, three-dimensional leadership, and all-round development. The pattern dual dimensional leadership, especially PS (pressure + state), was dominant in the sustainability of rural digitalization, compared to the pattern single dimensional leadership dominant in the construction performance, especially I (rural infra-structure digitalization), IL (rural infrastructure + life digitalization), IG (rural infrastructure + governance digitalization). The sustainability and construction performance of rural digitalization in Hunan were subject to a complex driving mechanism, with different factors differing significantly in their action nature, force, spatial effects and interactions. Notably, economic development (gross domestic product) is a positive key factor, while government intervention capacity (fiscal self-sufficiency rate) is an important factor, and natural environment (relief amplitude) is a mixed auxiliary factor (both positive and negative). Factor interactions were mainly characterized by nonlinear enhancement and a large number of super factor pairs. Therefore, the policy design should take into account both localized and differentiated management; and also emphasize enhanced cooperation with adjacent counties and synergistic management. It is suggested to divide Hunan into four planning zonings of leading, potential, warning and general zone, and design the spatial policies for each of them according to the driving mechanism, so as to develop a more reasonable and practical combination of development projects and management policies.", "venue": "Frontiers in Environmental Science", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-05", "journal": {"name": "Frontiers in Environmental Science"}, "authors": [{"authorId": "2267366673", "name": "Zhipeng Xing"}, {"authorId": "2267304863", "name": "Sidong Zhao"}, {"authorId": "2272005705", "name": "Di Wang"}], "citations": []}
