{"paperId": "7270ae890660825b4d157fba348cbe1b60c38753", "publicationVenue": {"id": "fcbcaf18-8ab1-43e1-a973-604bbc7e344e", "name": "Proceedings of the VLDB Endowment", "type": "journal", "alternate_names": ["Proceedings of The Vldb Endowment", "Proc VLDB Endow", "Proc Vldb Endow"], "issn": "2150-8097", "url": "http://dl.acm.org/toc.cfm?id=J1174", "alternate_urls": ["http://portal.acm.org/toc.cfm?CFID=21632689&CFTOKEN=99329904&WantType=Affiliated%20Organizations&coll=ACM&dl=ACM&id=J1174&idx=J1174&part=affil&title=VLDB%20Endowment&type=periodical"]}, "title": "User-Defined Operators: Efficiently Integrating Custom Algorithms into Modern Databases", "abstract": "In recent years, complex data mining and machine learning algorithms have become more common in data analytics. Several specialized systems exist to evaluate these algorithms on ever-growing data sets, which are built to efficiently execute different types of complex analytics queries.\n However, using these various systems comes at a price. Moving data out of traditional database systems is often slow as it requires exporting and importing data, which is typically performed using the relatively inefficient CSV format. Additionally, database systems usually offer strong ACID guarantees, which are lost when adding new, external systems. This disadvantage can be detrimental to the consistency of the results.\n Most data scientists still prefer not to use classical database systems for data analytics. The main reason why RDBMS are not used is that SQL is difficult to work with due to its declarative and set-oriented nature, and is not easily extensible.\n We present User-Defined Operators (UDOs) as a concept to include custom algorithms into modern query engines. Users can write idiomatic code in the programming language of their choice, which is then directly integrated into existing database systems. We show that our implementation can compete with specialized tools and existing query engines while retaining all beneficial properties of the database system.", "venue": "Proceedings of the VLDB Endowment", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-01-01", "journal": {"name": "Proc. VLDB Endow.", "pages": "1119-1131", "volume": "15"}, "authors": [{"authorId": "2125749678", "name": "Moritz Sichert"}, {"authorId": "143993045", "name": "Thomas Neumann"}], "citations": [{"paperId": "a0274192d63bf8997d56fc5fd4349f994cd8258b", "title": "Sharing Queries with Nonequivalent User-Defined Aggregate Functions"}, {"paperId": "66e5716f2d71d9c0e42248b5cd13eecdd2dabb3b", "title": "To UDFs and Beyond: Demonstration of a Fully Decomposed Data Processor for General Data Wrangling Tasks"}, {"paperId": "49d9666d6e3dd5a5a49a9db500c2683c23132b91", "title": "Efficient Execution of User-Defined Functions in SQL Queries"}, {"paperId": "0985e38dc2ac36eb26c5c0c195b5d5725a5583dc", "title": "Declarative Sub-Operators for Universal Data Processing"}, {"paperId": "651741ab0e3609adc40e6e6a4983f607b2da8a80", "title": "Programming Fully Disaggregated Systems"}, {"paperId": "3fb4813a08ecbbf4ceb31f722713f4bc8366e709", "title": "User-Defined Functions in Modern Data Engines"}, {"paperId": "017ed88c7a7f4d72319bcf5821b591b694fd23f7", "title": "The History, Present, and Future of ETL Technology (invited)"}, {"paperId": "b388f4defbd159f237a0dcd67089ef01c67b5930", "title": "Integrating Deep Learning Frameworks into Main-Memory Databases"}]}
