{"paperId": "729e8ed4e3356cded9b1a465f72a76813bac62a1", "publicationVenue": {"id": "d4610af5-85e0-480b-8773-5c71d92a7b99", "name": "International Conference on Architectural Support for Programming Languages and Operating Systems", "type": "conference", "alternate_names": ["ASPLOS", "Int Conf Archit Support Program Lang Oper Syst", "Archit Support Program Lang Oper Syst", "Architectural Support for Programming Languages and Operating Systems"], "url": "http://www.acm.org/sigplan/"}, "title": "GenStore: a high-performance in-storage processing system for genome sequence analysis", "abstract": "Read mapping is a fundamental step in many genomics applications. It is used to identify potential matches and differences between fragments (called reads) of a sequenced genome and an already known genome (called a reference genome). Read mapping is costly because it needs to perform approximate string matching (ASM) on large amounts of data. To address the computational challenges in genome analysis, many prior works propose various approaches such as accurate filters that select the reads within a dataset of genomic reads (called a read set) that must undergo expensive computation, efficient heuristics, and hardware acceleration. While effective at reducing the amount of expensive computation, all such approaches still require the costly movement of a large amount of data from storage to the rest of the system, which can significantly lower the end-to-end performance of read mapping in conventional and emerging genomics systems. We propose GenStore, the first in-storage processing system designed for genome sequence analysis that greatly reduces both data movement and computational overheads of genome sequence analysis by exploiting low-cost and accurate in-storage filters. GenStore leverages hardware/software co-design to address the challenges of in-storage processing, supporting reads with 1) different properties such as read lengths and error rates, which highly depend on the sequencing technology, and 2) different degrees of genetic variation compared to the reference genome, which highly depends on the genomes that are being compared. Through rigorous analysis of read mapping processes of reads with different properties and degrees of genetic variation, we meticulously design low-cost hardware accelerators and data/computation flows inside a NAND flash-based solid-state drive (SSD). Our evaluation using a wide range of real genomic datasets shows that GenStore, when implemented in three modern NAND flash-based SSDs, significantly improves the read mapping performance of state-of-the-art software (hardware) baselines by 2.07-6.05× (1.52-3.32×) for read sets with high similarity to the reference genome and 1.45-33.63× (2.70-19.2×) for read sets with low similarity to the reference genome.", "venue": "International Conference on Architectural Support for Programming Languages and Operating Systems", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2022-02-28", "journal": {"name": "Proceedings of the 27th ACM International Conference on Architectural Support for Programming Languages and Operating Systems"}, "authors": [{"authorId": "1403215560", "name": "Nika Mansouri-Ghiasi"}, {"authorId": "1992941239", "name": "Jisung Park"}, {"authorId": "33145535", "name": "Harun Mustafa"}, {"authorId": "17766732", "name": "Jeremie S. Kim"}, {"authorId": "2048193264", "name": "Ataberk Olgun"}, {"authorId": "2155488326", "name": "Arvid Gollwitzer"}, {"authorId": "70029851", "name": "Damla Senol Cali"}, {"authorId": "3432690", "name": "Can Firtina"}, {"authorId": "3064097", "name": "Haiyu Mao"}, {"authorId": "2048158626", "name": "N. Alserr"}, {"authorId": "1999972", "name": "Rachata Ausavarungnirun"}, {"authorId": "1920997", "name": "Nandita Vijaykumar"}, {"authorId": "3387282", "name": "M. Alser"}, {"authorId": "145929920", "name": "O. Mutlu"}], "citations": [{"paperId": "438497a8fe2a387aeabf4c182a92a154aa480385", "title": "Data Motion Acceleration: Chaining Cross-Domain Multi Accelerators"}, {"paperId": "ffb06f4691b2e3f841e698df09d2237705efa262", "title": "BeaconGNN: Large-Scale GNN Acceleration with Out-of-Order Streaming In-Storage Computing"}, {"paperId": "0390f8b6c0b2d377530b385bf5b1c0099eb7d70b", "title": "Smart-Infinity: Fast Large Language Model Training using Near-Storage Processing on a Real System"}, {"paperId": "95d21fe791f5f55b19935e8e9bc519998c016352", "title": "Bridging Software-Hardware for CXL Memory Disaggregation in Billion-Scale Nearest Neighbor Search"}, {"paperId": "3c8e4b14e3b08c692c11c0ba58c55ec4ce59385d", "title": "GEM: Ultra-Efficient Near-Memory Reconfigurable Acceleration for Read Mapping by Dividing and Predictive Scattering"}, {"paperId": "a0413c0576f73867d21777a07ed668410e73615a", "title": "Abakus: Accelerating k-mer Counting With Storage Technology"}, {"paperId": "5d734d85b88534e78f5c3d4be2365e5ef7c6ecc1", "title": "ISP Agent: A Generalized In-Storage-Processing Workload Offloading Framework by Providing Multiple Optimization Opportunities"}, {"paperId": "dc713beaed709b2077ba2679d3b418d556655c4b", "title": "Cambricon-R: A Fully Fused Accelerator for Real-Time Learning of Neural Scene Representation"}, {"paperId": "cfcf7ab0cc7e2fe8c571178810a8c67627f179a5", "title": "CASA: An Energy-Efficient and High-Speed CAM-based SMEM Seeding Accelerator for Genome Alignment"}, {"paperId": "a9f8da4e8a26fca3afa1f940db40f91d9d354aa8", "title": "An In-Memory Architecture for High-Performance Long-Read Pre-Alignment Filtering"}, {"paperId": "3db4337a5beb82db32ef647296f1a589bb4add1a", "title": "Virtual PIM: Resource-Aware Dynamic DPU Allocation and Workload Scheduling Framework for Multi-DPU PIM Architecture"}, {"paperId": "f163042aadc800489516f86475165543a62c88b1", "title": "Chameleon: a Heterogeneous and Disaggregated Accelerator System for Retrieval-Augmented Language Models"}, {"paperId": "bd3d145d79a45bcf99d92bdbc475ed6a629f318a", "title": "A Survey of Memory-Centric Energy Efficient Computer Architecture"}, {"paperId": "87411e3dc48b89cc8a1f4138f80977b4f60301c2", "title": "GateSeeder: Near-memory CPU-FPGA Acceleration of Short and Long Read Mapping"}, {"paperId": "87a21f216683ce98eb33bd2a28236a6264ff11c8", "title": "Employing Recursive Neural Networks in Voice Question-Answering Systems: A Novel Approach for Sequence Processing"}, {"paperId": "dc582ed585c8e99f40089877e03dc9412a92d93a", "title": "GAPiM: Discovering Genetic Variations on a Real Processing-in-Memory System"}, {"paperId": "678c909e0b3b9d6809fe6fe603d00a596befcad9", "title": "ABCD Analysis of Industries Using High-Performance Computing"}, {"paperId": "c615ded7d40f0ca6bfe148414d79ad2653b17ef3", "title": "ECSSD: Hardware/Data Layout Co-Designed In-Storage-Computing Architecture for Extreme Classification"}, {"paperId": "2ca63daafe06b15a63186d7b821b52638d330e90", "title": "Venice: Improving Solid-State Drive Parallelism at Low Cost via Conflict-Free Accesses"}, {"paperId": "03cc4c5afac8a0c311fdfa3ac0926a0d0e028bad", "title": "Invited: Accelerating Genome Analysis via Algorithm-Architecture Co-Design"}, {"paperId": "939635f472b9dcef243f20fa47d5cad67b4af384", "title": "SERICO: Scheduling Real-Time I/O Requests in Computational Storage Drives"}, {"paperId": "d27585f9929004196e06e24315c97f65a55da518", "title": "OptimStore: In-Storage Optimization of Large Scale DNNs with On-Die Processing"}, {"paperId": "8f30d325b555bd0b1cb61e55ed44a67e4b2ce2c4", "title": "The Memory-Bounded Speedup Model and Its Impacts in Computing"}, {"paperId": "f75e5d8cb6d3c10cf15c5011870e436320af59c6", "title": "RawHash: enabling fast and accurate real-time analysis of raw nanopore signals for large genomes"}, {"paperId": "fad8f862216ddadb49e4bc03f36e1c5a4bc9404e", "title": "Genome-on-Diet: Taming Large-Scale Genomic Analyses via Sparsified Genomics"}, {"paperId": "0c7607f8da3936420c778a6418e2ea5d89f7775c", "title": "DRAM Bender: An Extensible and Versatile FPGA-Based Infrastructure to Easily Test State-of-the-Art DRAM Chips"}, {"paperId": "d16845ff4b032bb1a973486bba865e1e68e0d441", "title": "ASSASIN: Architecture Support for Stream Computing to Accelerate Computational Storage"}, {"paperId": "204ec35646fcea9223a1f8f5b93da3586f46690a", "title": "GenPIP: In-Memory Acceleration of Genome Analysis via Tight Integration of Basecalling and Read Mapping"}, {"paperId": "3a2548a8286a15e0141dba6008f0eae2ac1ad724", "title": "Flash-Cosmos: In-Flash Bulk Bitwise Operations Using Inherent Computation Capability of NAND Flash Memory"}, {"paperId": "101f3046a38037529dbf584d5255634b0a463568", "title": "BWA-MEM-SCALE: Accelerating Genome Sequence Mapping on Commodity Servers"}, {"paperId": "425a24794315ce83c53025d513059eaeffd44f2f", "title": "Scrooge: a fast and memory-frugal genomic sequence aligner for CPUs, GPUs, and ASICs"}, {"paperId": "a4a80e375b3acc4ea7b09bd7c9c3b3e02e3fbb54", "title": "A framework for high-throughput sequence alignment using real processing-in-memory systems"}, {"paperId": "13f55ea705e9af6bcea883694d26fb4d6e3b79cc", "title": "From molecules to genomic variations: Accelerating genome analysis via intelligent algorithms and architectures"}, {"paperId": "6ec6d79e896bd5d544e0c154d6851b8320f8cab5", "title": "Survey on storage-accelerator data movement"}, {"paperId": "6445ef7945bbc2d231176e959b9cadce04acef23", "title": "ApHMM: Accelerating Profile Hidden Markov Models for Fast and Energy-Efficient Genome Analysis"}, {"paperId": "d2d3436259017029bbf084e01626a488b304fe53", "title": "GenStore: In-Storage Filtering of Genomic Data for High-Performance and Energy-Efficient Genome Analysis"}, {"paperId": "8f40e2a30ed2954877f879554df058e4f743d0ba", "title": "Going From Molecules to Genomic Variations to Scientific Discovery: Intelligent Algorithms and Architectures for Intelligent Genome Analysis"}, {"paperId": "5695f14582e4cef36d3fc41d4a52da4b2ffbcafa", "title": "SeGraM: a universal hardware accelerator for genomic sequence-to-graph and sequence-to-sequence mapping"}, {"paperId": "e3bfd8cdc03b610cbd959adb360e09b1aa1fc436", "title": "Algorithmic Improvement and GPU Acceleration of the GenASM Algorithm"}, {"paperId": "2d96f79f33af42a75a9e6d8b6eb0dfc675b914e3", "title": "Casper: Accelerating Stencil Computations Using Near-Cache Processing"}, {"paperId": "46d657297da65cd6105ac837ad24ec7fd651f3b1", "title": "BLEND: a fast, memory-efficient and accurate mechanism to find fuzzy seed matches in genome analysis"}, {"paperId": "7bb6015f45457fdbe3bb39e17dc9cb0786ecd688", "title": "A Modern Primer on Processing in Memory"}, {"paperId": "21efdbc4a18955156e82d55a48a24a1e24a7015f", "title": "CXL-ANNS: Software-Hardware Collaborative Memory Disaggregation and Computation for Billion-Scale Approximate Nearest Neighbor Search"}, {"paperId": "e804e5bfe114715af9d77ed27a009b7a894a7ed0", "title": "Taming Large-Scale Genomic Analyses via Sparsified Genomics"}]}
