{"paperId": "72b657145b7e91be0307553b259274d935100f91", "publicationVenue": {"id": "558a3215-8ffd-4b31-be7f-f653ca3b600d", "name": "PeerJ", "type": "journal", "issn": "2167-8359", "url": "http://www.peerj.com/"}, "title": "causalizeR: a text mining algorithm to identify causal relationships in scientific literature", "abstract": "Complex interactions among multiple abiotic and biotic drivers result in rapid changes in ecosystems worldwide. Predicting how specific interactions can cause ripple effects potentially resulting in abrupt shifts in ecosystems is of high relevance to policymakers, but difficult to quantify using data from singular cases. We present causalizeR (https://github.com/fjmurguzur/causalizeR), a text-processing algorithm that extracts causal relations from literature based on simple grammatical rules that can be used to synthesize evidence in unstructured texts in a structured manner. The algorithm extracts causal links using the relative position of nouns relative to the keyword of choice to extract the cause and effects of interest. The resulting database can be combined with network analysis tools to estimate the direct and indirect effects of multiple drivers at the network level, which is useful for synthesizing available knowledge and for hypothesis creation and testing. We illustrate the use of the algorithm by detecting causal relationships in scientific literature relating to the tundra ecosystem.", "venue": "PeerJ", "year": 2021, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-07-20", "journal": {"name": "PeerJ", "volume": "9"}, "authors": [{"authorId": "1405380011", "name": "F. Ancin‐Murguzur"}, {"authorId": "6009918", "name": "V. Hausner"}], "citations": [{"paperId": "26ba00878316ef9decbd4cee7f19fe23909e41f2", "title": "Construction of injury process from Japanese consumer product narrative injury data using an ontology-based method"}, {"paperId": "90c942ea0139c38c8b32304c1088bd810a3e48fd", "title": "Text to Causal Knowledge Graph: A Framework to Synthesize Knowledge from Unstructured Business Texts into Causal Graphs"}, {"paperId": "3ae1baf0f61ae78ccc34b63f56c3541d55aa775b", "title": "Questionnaires based on natural language processing elicit immersive ruminative thinking in ruminators: Evidence from behavioral responses and EEG data"}, {"paperId": "f84ceeb9ee2c9c979d5b002ce02e6f8a9c54d448", "title": "'Small Data' for big insights in ecology."}, {"paperId": "4de1dd700378a5a41ef93f1157b6510a3b38c2fd", "title": "Analytical Methods and Determinants of Frequency and Severity of Road Accidents: A 20-Year Systematic Literature Review"}]}
