{"paperId": "72bd8ff8e51b3843d2a43c740b8779d77ca35b81", "publicationVenue": null, "title": "Artificial intelligent smart home automation with secured camera management-based GSM, cloud computing, and arduino", "abstract": "Home management and controlling have seen a great introduction to network that enabled digital technology, especially in recent decades. For the purpose of home automation, this technique offers an exciting capability to enhance the connectivity of equipment within the home. Also, with the rapid expansion of the Internet, there are potentials that added to the remote control and monitoring of such network-enabled devices. In this paper, we had been designed and implemented a fully manageable and secure smart home automation system based on a cloud computing system with an ESP Arduino system. The security of home had been improved by adding a complete camera system with a GSM communication technique to connect the Arduino output data to an external specified number if there is no internet provider. We used three sensors for temperature, gas, and motion measurements. The ESP8226 Wi-Fi device programmed the sensors to maintain the sensors measurements and transfer them to the cloud server database which is programmed to the web server via Appatshy and Mysql formats. The system implemented with high time response so that all readings updated and appeared spontaneously. The designed system should be effective, a secure, and rapid response real-time smart home system should be achieved.", "venue": "", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2020-11-08", "journal": {"name": "Periodicals of Engineering and Natural Sciences (PEN)", "pages": "2160-2168", "volume": "8"}, "authors": [{"authorId": "2036130912", "name": "M. M. A. Zahra"}, {"authorId": "1658811958", "name": "M. Mohsin"}, {"authorId": "1405791429", "name": "L. Abdul-Rahaim"}], "citations": [{"paperId": "7b17ad0748fe719d03f1403630977604e215c08e", "title": "WNRoom Dataset: White Noise Dataset for Detecting the Status of Room"}, {"paperId": "240088fbfd1964ecd62eabfd33dfc28a00b059e2", "title": "An Effect of Stacked CNN for Network Intrusion Detection System"}, {"paperId": "4424947dec74ef538ecb38cd22a33d037a67f2f4", "title": "Design of Surgical Arm Robot Based on Cloud Computing"}, {"paperId": "a7ba747658faba40340e3a5fffe7e82da0e5407f", "title": "Smart Homes Automation System Using Cloud Computing Based Enhancement Security"}, {"paperId": "edfb15208602af70502a52e710ad91334a358ad9", "title": "Purwarupa Smart Home menggunakan MQTT Broker untuk Memonitor Kondisi Abnormal Perangkat Listrik"}, {"paperId": "1c25678c2c84eae89ec64cca950126d8a27aea58", "title": "Toward a Cloud based Disease Diagnosis System Using Sequential Quadratic Programming Approach"}, {"paperId": "4717e8c50720b8884582c16c53973931ea1f7d66", "title": "Design of Smart Home Control System Based on Wireless Voice Sensor"}, {"paperId": "cfe201a225d25644dc7caa5f01f5751709d32b7c", "title": "Design and implement of robotic arm and control of moving via IoT with Arduino ESP32"}, {"paperId": "3bb3ce6835c94d23266621f99c1ecda9edb20565", "title": "The artificial intelligence (AI) role for tackling against COVID-19 pandemic"}, {"paperId": "2de27a734d607bfeac1689fb8c4e5b8d97f9b54b", "title": "Mobile phone user behavior's recognition using gyroscope sensor and ML algorithms"}, {"paperId": "b9a5e33b699421f762b74c5d7ca1902842b7662b", "title": "Chaotic systems with pseudorandom number generate to protect the transmitted data of wireless network"}, {"paperId": "25a4b6b39b9d554b10a80bf84f580c5813b61dbb", "title": "Using A Hybrid Algorithm and Feature Selection for Network Anomaly Intrusion Detection"}]}
