{"paperId": "72c2ba2ef577d9684e55beb40813f2ad521d9db6", "publicationVenue": {"id": "e1882330-de0e-49a0-be92-edc862edc88d", "name": "Internet Research", "type": "journal", "alternate_names": ["Internet Res"], "issn": "1066-2243", "url": "https://www.emerald.com/insight/publication/issn/1066-2243"}, "title": "Effect of marketing messages and consumer engagement on economic performance: evidence from Weibo", "abstract": "Social media commerce provides a convenient way for users to share information and interact with each other. Few studies, however, have examined the effect of marketing messages and consumer engagement behaviors on the economic performance of marketing. This study, therefore, explored the economic performance of social media in terms of marketing messages and consumer engagement.,Using ordinary least squares regression and data collected from Weibo and Maoyan, this study analyzed the effects among marketing messages, consumer engagement and movie ticket sales.,The results indicated that marketing messages on Weibo had a positive effect on box office revenues, while consumer engagement behavior (whether personal or interactive) did not affect box office revenues. The results suggested that marketing messages on social media have more salient effects for predicting economic performance than consumer engagement behaviors.,This study underscores the importance of social media in consumer purchasing behavior. The findings also extend the literature related to commerce and product message design on social media platforms.", "venue": "Internet Research", "year": 2020, "fieldsOfStudy": ["Computer Science", "Business"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-06-30", "journal": {"name": "Internet Res.", "pages": "1565-1581", "volume": "30"}, "authors": [{"authorId": "2108199822", "name": "Jia Chen"}, {"authorId": "46860084", "name": "Gang Kou"}, {"authorId": "144580890", "name": "Yi Peng"}, {"authorId": "1978516", "name": "Xiangrui Chao"}, {"authorId": "2057533105", "name": "Feng Xiao"}, {"authorId": "40549277", "name": "F. Alsaadi"}], "citations": [{"paperId": "309a0526a926d8fb8d8e9a04af6ee7365168464c", "title": "Messenger Marketing Platforms and Performance of Tour Operating Companies in Kenya"}, {"paperId": "bd61336a1378571049fb09f84c7e8c6b628b5fe7", "title": "Impact of Interaction Effects between Visual and Auditory Signs on Consumer Purchasing Behavior Based on the AISAS Model"}, {"paperId": "37e9f392751ecc36300c3bef8b55449c96042827", "title": "Strategies to Improve Brand Awareness Through Social Media Marketing"}, {"paperId": "2578341f79be5f883846da7570cceb6135735858", "title": "Revisiting a model of customer engagement cycle: a systematic review"}, {"paperId": "f7193c6ebeff0428768c90158ff91c915fa3d75d", "title": "Examining the Role of Social Media Marketing on Brand Love and Its Impact on Brand Centrality: The Study of Local Fashion Brands for the Millennials"}, {"paperId": "7b48b9e64f41216b569ef7d95b17effd9fd3aa6b", "title": "The effects of social media use and consumer engagement on physician online return: evidence from Weibo"}, {"paperId": "eefdc33e92325526d4aec72104b5b1dd468f835f", "title": "Information distortion in word-of-mouth retransmission: the effects of retransmitter intention and source expertise"}, {"paperId": "a75cca57833d3ea706b39f175fdc5a24b2e2bf8f", "title": "APAKAH MEDIA SOSIAL MENYELAMATKAN BISNIS F&B DI ERA PANDEMI?"}, {"paperId": "de71c76f62accf5135f24e1fe5e244211d081e1c", "title": "The Social Impact from Danmu - Insights from Esports Online Videos"}, {"paperId": "d9769ac737f14b46b24dc76828c2309bba906504", "title": "Social media user-generated content, online search traffic and offline car sales"}, {"paperId": "6255f3915c96ee86e274654c1e9faab980b123b6", "title": "Social media marketing system: conceptualization, scale development and validation"}, {"paperId": "a433e30c9016cdd94f072351ee81ab8266b2438c", "title": "Understanding the Role of Users’ Psychological Needs on Relationship Quality in Short Video Applications"}, {"paperId": "6116f2553e088ecc3f681b51514feb6a0200b1a7", "title": "Fostering consumer engagement with marketer-generated content: the role of content-generating devices and content features"}, {"paperId": "0ad647875a62abc9053d2905cb3f4dd7866ecd3f", "title": "Development and Validity Test of Social Attachment Multidimensional Scale"}, {"paperId": "bed0faf370e9b6d440a56425a69a38654e8c3730", "title": "Lift the veil of rumors: the impact of the characteristics of information sources on the effectiveness of rumors spreading"}, {"paperId": "0df9de47ad6705944322c233a01eb2aec0cfe2a4", "title": "Understanding the Mechanism of Social Attachment Role in Social Media: A Qualitative Analysis"}, {"paperId": "151535fd14e62cbd88927cc7c21cb9d7d6456e60", "title": "Investigating the nexus between the types of advertising messages and customer engagement: Do customer involvement and generations matter?"}, {"paperId": "75063af14a15ac90cb25f71a70f0d3a1683cb504", "title": "How electronic word of mouth dynamically influences product sales and supplies: an evidence from China film industry"}, {"paperId": "5b3a56e82293759edb001aa76d9b1665a1506fbf", "title": "Effect of customization, core self-evaluation, and information richness on trust in online insurance service: Intelligent agent as a moderating variable"}, {"paperId": "e66a61aa7c51a267ad598afb9bc0e4c144e1f9a9", "title": "Study of Purchase Behaviour Using Black Box Model"}, {"paperId": "23d23b03376a88fe126cb1c01c5e20b3d13069c0", "title": "Social Media in China und ihr Einfluss auf Wirtschaft, Gesellschaft und Kultur"}, {"paperId": "da9f6f56faefa037ceba17578dd144a8809f84c5", "title": "Aesthetics of hotel photos and its impact on consumer engagement: A computer vision approach"}, {"paperId": "7a158b87f87d2e560669c26dd308c60d59075358", "title": "THE INFLUENCE OF INSTAGRAM SHOP FEATURE ON PURCHASE INTENTION OF INSTAGRAM USERS"}]}
