{"paperId": "72c6c3ede1d4457a85b9ddac0a2bc8d1096f221c", "publicationVenue": {"id": "29df4b17-9a16-4a4c-94a6-002f52e628b4", "name": "International Conference on Parallel Processing", "type": "conference", "alternate_names": ["ICPP", "Int Conf Parallel Process", "IEEE Int Conf Pulsed Power", "IEEE International Conference on Pulsed Power"], "url": "http://www.wikicfp.com/cfp/program?id=1447"}, "title": "Atos: A Task-Parallel GPU Scheduler for Graph Analytics", "abstract": "We present Atos, a task-parallel GPU dynamic scheduling framework that is especially targeted at dynamic irregular applications. Compared to the dominant Bulk Synchronous Parallel (BSP) frameworks, Atos exposes additional concurrency by supporting task-parallel formulations of applications with relaxed dependencies, achieving higher GPU utilization, which is particularly significant for problems with concurrency bottlenecks. Atos also offers implicit task-parallel load balancing in addition to data-parallel load balancing, providing users the flexibility to balance between them to achieve optimal performance. Finally, Atos allows users to adapt to different use cases by controlling the kernel strategy and task-parallel granularity. We demonstrate that each of these controls is important in practice. We evaluate and analyze the performance of Atos vs. BSP on three applications: breadth-first search, PageRank, and graph coloring. Atos implementations achieve geomean speedups of 3.44x, 2.1x, and 2.77x and peak speedups of 12.8x, 3.2x, and 9.08x across three case studies, compared to a state-of-the-art BSP GPU implementation. Beyond simply quantifying the speedup, we extensively analyze the reasons behind each speedup. This deeper understanding allows us to derive general guidelines for how to select the optimal Atos configuration for different applications. Finally, our analysis provides insights for future dynamic scheduling framework designs.", "venue": "International Conference on Parallel Processing", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2022-08-29", "journal": {"name": "Proceedings of the 51st International Conference on Parallel Processing"}, "authors": [{"authorId": "2109169510", "name": "Yuxin Chen"}, {"authorId": "107728021", "name": "Benjamin Brock"}, {"authorId": "2484950", "name": "Serban D. Porumbescu"}, {"authorId": "2238795", "name": "A. Buluç"}, {"authorId": "1731111", "name": "K. Yelick"}, {"authorId": "1399266021", "name": "J. Owens"}], "citations": [{"paperId": "bb06877c7fcc265d5dae90e3b2913cbde8d8c449", "title": "GPU-Initiated Resource Allocation for Irregular Workloads"}, {"paperId": "d4d651e6775a357ee16be634f93061c3b86f82d1", "title": "Multi-GPU Communication Schemes for Iterative Solvers: When CPUs are Not in Charge"}, {"paperId": "528a8bcb9a616154090f5bca021fa1b6661f52e4", "title": "A Programming Model for GPU Load Balancing"}, {"paperId": "6c8d5a08ff6d2c24d5af63e16962282f56995f02", "title": "Scalable Irregular Parallelism with GPUs: Getting CPUs Out of the Way"}, {"paperId": "779b687bb2d6347e66a159fb090a884318dca23a", "title": "An Experimental Evaluation of Graph Coloring Heuristics on Multi- and Many-Core Architectures"}]}
