{"paperId": "72c82cbc451c22d895a49b5b22918d116863395e", "publicationVenue": {"id": "312ca99c-9149-490d-813e-c60d5e949f65", "name": "Concurrency and Computation", "type": "journal", "alternate_names": ["Concurr Comput Pract Exp", "Concurrency and Computation: Practice and Experience", "Concurr Comput"], "issn": "1532-0626", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/77004395?CRETRY=1&SRETRY=0", "alternate_urls": ["http://www3.interscience.wiley.com/cgi-bin/jtoc?ID=77004395", "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1532-0634"]}, "title": "Research on application of data mining in fast character recognition based on big data", "abstract": "For improving the speed of character recognition, this paper applies data mining technology to character recognition under the condition of big data architecture. As an effective method of data mining, artificial neural network is a computational model established by simplifying, abstracting, and simulating the biological neural mechanism of human brain. Artificial neural network ensemble method, by training several weak learning devices to form the final strong learning device, can better improve the learning generalization ability of the model, and it has a broad application prospect. The main difficulties in the research of license plate recognition are the low quality of vehicle license plate image, the small proportion of license plate area, the distortion of characters to be recognized, and the large interference noise. In this paper, wavelet transform, edge detection, and line scanning methods are used to realize multi‐size and multi‐type license plate location, which overcomes the influence of illumination, color, size, and position. In the character recognition module, the improved BP neural network and the neural network integrated classifier based on weight clipping are used to identify. Experimental results show that the proposed data mining algorithm can further improve the learning efficiency and improve the performance of the time.", "venue": "Concurrency and Computation", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-09-27", "journal": {"name": "Concurrency and Computation: Practice and Experience", "volume": "30"}, "authors": [{"authorId": "2158585467", "name": "Ying Zheng"}, {"authorId": "2070583", "name": "Wangan Song"}, {"authorId": "2110951943", "name": "Longfeng Shen"}], "citations": [{"paperId": "9d7ad6c5b6e1e6f37152edd3f78693f63a2125b0", "title": "The 2018 International Conference on Modern Computer Science and Applications (MCSA2018)"}, {"paperId": "09ff5adb911551f7213cc7c5023c9605e87d33ab", "title": "Effectiveness of ideological and political education reform in universities based on data mining artificial intelligence technology"}, {"paperId": "23f61ce862180a5d1f46f30cf293a7878e9fb2b5", "title": "THE NEED FOR DOMAIN EXPERT IN DATA MINING APPLICATION"}]}
