{"paperId": "72ccfa8c5672f88d70d6ed16a4239726dbe1a6cf", "publicationVenue": null, "title": "A Hybrid Recommendation System of Upcoming Movies Using Improved version of SOM with Hybrid Filtering Methods", "abstract": "Using a hybrid recommendation system and optimization strategy based on weighted classification and user collaborative filtering algorithms, this study proposes a solution to the problem that conventional recommendation systems cannot accurately reflect user preferences, as the single model of a conventional recommendation system cannot. The top-N personalized movie suggestions are generated depending on the combination of the weighted classification model, the local recommendation model, which is trained depending on the clustering of users, and the sparse linear model, which is a fundamental recommendation model. The target user is assigned to the cluster that is closest to each cluster after the scoring matrix is transformed into a low-dimensional, dense item category preference matrix based on item category preference, and then the cluster centers are identified, the distances between each cluster center and the target user are calculated, and the target user is then assigned to each cluster. To create the suggestion list, the next step is to use the collaborative filtering technique that anticipates the ratings for the unrated items for the target user. In order to further reduce the sparsity of the data, a high-dimensional rating matrix is converted to a low-dimensional item category preference matrix. After that, the items are categorized in accordance with the categories selected by the data analysis system. The recommendation algorithm presented in this article solves some of the drawbacks of a single algorithm model. It also enhances the suggestion effect, according to experiments using the MovieLens movie dataset.", "venue": "2023 6th International Conference on Information Systems and Computer Networks (ISCON)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-03-03", "journal": {"name": "2023 6th International Conference on Information Systems and Computer Networks (ISCON)", "pages": "1-6"}, "authors": [{"authorId": "1956589", "name": "Saurabh Sharma"}, {"authorId": "3470672", "name": "H. K. Shakya"}], "citations": [{"paperId": "4de9abb48e322049d98511583e5534001adf1d24", "title": "An Enhanced Semantic Analysis of Potential Recommender Systems for Big Data Management"}]}
