{"paperId": "72d2b26d6b70eeb2f82cd5b1bed7e0747d5fbbf3", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "OpenCluster: A Flexible Distributed Computing Framework for Astronomical Data Processing", "abstract": "The volume of data generated by modern astronomical telescopes is extremely large and rapidly growing. However, current high-performance data processing architectures/frameworks are not well suited for astronomers because of their limitations and programming difficulties. In this paper, we therefore present OpenCluster, an open-source distributed computing framework to support rapidly developing high-performance processing pipelines of astronomical big data. We first detail the OpenCluster design principles and implementations and present the APIs facilitated by the framework. We then demonstrate a case in which OpenCluster is used to resolve complex data processing problems for developing a pipeline for the Mingantu Ultrawide Spectral Radioheliograph. Finally, we present our OpenCluster performance evaluation. Overall, OpenCluster provides not only high fault tolerance and simple programming interfaces, but also a flexible means of scaling up the number of interacting entities. OpenCluster thereby provides an easily integrated distributed computing framework for quickly developing a high-performance data processing system of astronomical telescopes and for significantly reducing software development expenses.", "venue": "arXiv.org", "year": 2017, "fieldsOfStudy": ["Physics", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2017-01-18", "journal": {"name": "Publications of the Astronomical Society of the Pacific", "volume": "129"}, "authors": [{"authorId": "3277631", "name": "Shoulin Wei"}, {"authorId": "2145755489", "name": "Feng Wang"}, {"authorId": "145869039", "name": "H. Deng"}, {"authorId": "2107996419", "name": "Cuiyin Liu"}, {"authorId": "101698329", "name": "W. Dai"}, {"authorId": "49968206", "name": "Bo Liang"}, {"authorId": "2162694", "name": "Y. Mei"}, {"authorId": "8798175", "name": "Congming Shi"}, {"authorId": "7894759", "name": "Yingbo Liu"}, {"authorId": "2149267987", "name": "Jingping Wu"}], "citations": [{"paperId": "69a8fdf57be7adcb62d561387f3b1c379831b923", "title": "Scalable framework of intelligent RFI flagging for large-scale HI survey data from FAST"}, {"paperId": "51c9ef8c9048068b0b32578d55b5039eecd64cac", "title": "Astronomical big data processing using machine learning: A comprehensive review"}, {"paperId": "676211f975b1638611ac2daa7dd9567e545f6641", "title": "Review of Parallel Processing Methods for Big Image Data Applications"}, {"paperId": "bf7f7b0db9c836009de2eb04ef05a3f08bdf5b84", "title": "GPU-Based High-performance Imaging for Mingantu Spectral RadioHeliograph"}, {"paperId": "4267820d59eb67781393a2da6b37ae5b3c03340c", "title": "A Task-Oriented General-Purpose Distributed Computing System Based on CLTS Scheduling Algorithm"}, {"paperId": "4948704273f64d51d40ce152246f887aa379baf0", "title": "Execution framework technology"}, {"paperId": "ca01d9a35e941da694f1e835e7331a808e8d3e65", "title": "Application design for execution framework"}, {"paperId": "e3da860ac5b21cf54c139da9da6a9529db23115b", "title": "Implementation of gridding algorithm for radio interferometric imaging based on OpenCL"}]}
