{"paperId": "72d8ae327ed821b5012bd77687206504f85ce2f0", "publicationVenue": {"id": "07ba6a02-fa13-4c5f-b428-795730d75e53", "name": "Big Data", "type": "conference", "alternate_names": ["Int Conf Big Data", "International Conference on Big Data"], "issn": "2167-6461", "url": "http://www.liebertonline.com/", "alternate_urls": ["https://home.liebertpub.com/publications/big-data/611/overview"]}, "title": "Big Data, Small Personas: How Algorithms Shape the Demographic Representation of Data-Driven User Segments", "abstract": "Derived from the notion of algorithmic bias, it is possible that creating user segments such as personas from data results in over- or under-representing certain segments (FAIRNESS), does not properly represent the diversity of the user populations (DIVERSITY), or produces inconsistent results when hyperparameters are changed (CONSISTENCY). Collecting user data on 363M video views from a global news and media organization, we compare personas created from this data using different algorithms. Results indicate that the algorithms fall into two groups: those that generate personas with low diversity-high fairness and those that generate personas with high diversity-low fairness. The algorithms that rank high on diversity tend to rank low on fairness (Spearman's correlation: -0.83). The algorithm that best balances diversity, fairness, and consistency is Spectral Embedding. The results imply that the choice of algorithm is a crucial step in data-driven user segmentation, because the algorithm fundamentally impacts the demographic attributes of the generated personas and thus influences how decision makers view the user population. The results have implications for algorithmic bias in user segmentation and creating user segments that not only consider commercial segmentation criteria but also consider criteria derived from ethical discussions in the computing community.", "venue": "Big Data", "year": 2022, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-08-01", "journal": {"name": "Big data", "pages": "\n          313-336\n        ", "volume": "10 4"}, "authors": [{"authorId": "2734912", "name": "Joni O. Salminen"}, {"authorId": "2089407401", "name": "Kamal Chhirang"}, {"authorId": "1861541", "name": "Soon-Gyo Jung"}, {"authorId": "2934941", "name": "Saravanan Thirumuruganathan"}, {"authorId": "1666242842", "name": "Kathleen W. Guan"}, {"authorId": "144715575", "name": "B. Jansen"}], "citations": [{"paperId": "8950702e7a505d322a0f27c782a52b4bbdf45e14", "title": "How can algorithms help in segmenting users and customers? A systematic review and research agenda for algorithmic customer segmentation"}]}
