{"paperId": "72f5fb8396484f0dc336fb19916e07af53a95546", "publicationVenue": {"id": "8546baab-d567-408d-9a65-0887d8197468", "name": "International Symposiu on Visual Information Communication and Interaction", "type": "conference", "alternate_names": ["VINCI", "Int Symp Vis Inf Commun Interact", "Visual Information Communication and Interaction", "Vis Inf Commun Interact"]}, "title": "Identifying Correlation Patterns in Large Educational Data Sources", "abstract": "Data on education contains various attributes, modeling the pupils’ or students’ personal properties or educational outcomes like reading or writing performances, mathematical skills, or linguistic competences. In this paper we describe a visual analysis tool that takes into account a multitude of educational data sources, filters those into the most relevant ones, and derives attributes-of-interest which form a high-dimensional dataset. For this data we apply t-SNE as one possible projection method to visualize and uncover similarities and dissimilarities among the high-dimensional attributes in a lower-dimensional space like in a scatter plot. We also support interaction techniques and further visual variables to encode additional data attributes in the form of color codings, sizes, and shapes. We illustrate the usefulness of our approach by applying it to educational data sources focusing on pupils and students in Switzerland while also visually communicating the found insights with educational science experts. Finally, we discuss limitations and scalability issues.", "venue": "International Symposiu on Visual Information Communication and Interaction", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2021-09-06", "journal": {"name": "Proceedings of the 14th International Symposium on Visual Information Communication and Interaction"}, "authors": [{"authorId": "2142724457", "name": "Marco Schmid"}, {"authorId": "2142315654", "name": "Rahel Haymoz"}, {"authorId": "143906350", "name": "David Schiller"}, {"authorId": "144484816", "name": "Michael Burch"}], "citations": [{"paperId": "ce13ad395fde35ae93e8fa52fdd2a4a0772ea6eb", "title": "The Benefits and Drawbacks of Eye Tracking for Improving Educational Systems"}]}
