{"paperId": "72fbbc72be862753ccc2786f373479295bb49bd6", "publicationVenue": null, "title": "Internet of Things, Big Data Analytics, and Deep Learning for Sustainable Precision Agriculture", "abstract": "Agriculture is undergoing a digital transformation because of population growth, climate change, and food security concerns. Agriculture is influenced by information technology in terms of cost reduction, efficiency, and sustainability. Precision agriculture employs IoT, deep learning, predictive analytics, and AI-based technologies to aid in the detection of plant diseases, pests, and poor plant nutrition in the field. The study’s objectives are as follows: 1) evaluate the role of smart technologies and their impact on precision agriculture sustainability; 2) assess the typical application of IoT data analytics and deep learning in precision agriculture; and 3) investigate the barriers to the adoption of sustainable precision farming. IoT technologies collect data and relay it to data analytics and deep learning for in-depth analysis. The findings indicate that data assists farmers in managing crop variety, phenotypes and selection, crop performance, soil quality, pH level, irrigation, and fertilizer application quantity. The study looks at typical application areas and critical success factors for precision agriculture. Technological issues, safety, privacy, cost, and legal issues influence the adoption of these technologies. Individual farmers, government, academics, and agricultural authorities will all benefit from the research. The study recommends the adoption and optimization of innovations and technologies e.g. mobile devices, access to better internet speed, low-cost and dependable satellites for positioning and imagery, and precision agriculture-optimized agricultural machinery. Future research should focus on the application of appropriate decision-support systems for implementing precision decisions.", "venue": "2022 IST-Africa Conference (IST-Africa)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-05-16", "journal": {"name": "2022 IST-Africa Conference (IST-Africa)", "pages": "1-12"}, "authors": [{"authorId": "30587433", "name": "E. Micheni"}, {"authorId": "151055507", "name": "Jackson Machii"}, {"authorId": "31344416", "name": "Julius Murumba"}], "citations": [{"paperId": "3d07855e1ad5f00219eccb2c468d266d1ca5b5da", "title": "Smart Farming Using the Big Data-Driven Approach for Sustainable Agriculture with IOT"}, {"paperId": "f0362b7058c15d2fbfaf1b37f9024119571f1ae0", "title": "A Conceptual Model Relationship between Industry 4.0—Food-Agriculture Nexus and Agroecosystem: A Literature Review and Knowledge Gaps"}, {"paperId": "5def69a4e5a4559814f987f4017db87feb5639ef", "title": "Examining the Impact of Machine Learning on Streamlining Data Analysis in Real-Time"}, {"paperId": "c61529f41817141b7fce6e6df6c75102359f945d", "title": "Comprehensive Analysis of IoT with Artificial Intelligence to Predictive Maintenance Optimization for Indian Shipbuilding"}, {"paperId": "9d8d863af3cfe947d1140b3920b2b74d39e739a5", "title": "THE ROLE OF DIGITAL TECHNOLOGIES IN INCREASING THE EFFICIENCY OF AGRICULTURAL ENTERPRISES"}, {"paperId": "b384dc5547ec8ab01dcc5d51fcbc9e474613630b", "title": "IS-DASPA: an IoT system for data analysis from soil preparation in agribusiness"}, {"paperId": "0a70a6b568e37c9a9d6cbff1ce616af40c589d36", "title": "Internet of Things (IoT) Assisted Context Aware Fertilizer Recommendation"}]}
