{"paperId": "72fe7aa34502bf2a65b07ecc957a3dd87e59ea93", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Identification of Interaction Clusters Using a Semi-supervised Hierarchical Clustering Method", "abstract": "Motivation: Identifying interaction clusters of large gene regulatory networks (GRNs) is critical for its further investigation, while this task is very challenging, attributed to data noise in experiment data, large scale of GRNs, and inconsistency between gene expression profiles and function modules, etc. It is promising to semi-supervise this process by prior information, but shortage of prior information sometimes make it very challenging. Meanwhile, it is also annoying, and sometimes impossible to discovery gold standard for evaluation of clustering results.\\\\ Results: With assistance of an online enrichment tool, this research proposes a semi-supervised hierarchical clustering method via deconvolved correlation matrix~(SHC-DC) to discover interaction clusters of large-scale GRNs. Three benchmark networks including a \\emph{Ecoli} network and two \\emph{Yeast} networks are employed to test semi-supervision scheme of the proposed method. Then, SHC-DC is utilized to cluster genes in sleep study. Results demonstrates it can find interaction modules that are generally enriched in various signal pathways. Besides the significant influence on blood level of interleukins, impact of sleep on important pathways mediated by them is also validated by the discovered interaction modules.", "venue": "arXiv.org", "year": 2019, "fieldsOfStudy": ["Computer Science", "Biology", "Mathematics"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-10-20", "journal": {"name": "ArXiv", "volume": "abs/1910.08864"}, "authors": [{"authorId": "2144836646", "name": "Yu Chen"}, {"authorId": "2108828447", "name": "Yuanyuan Yang"}, {"authorId": "2157835870", "name": "Yaochu Jin"}, {"authorId": "32463234", "name": "Xiufen Zou"}], "citations": []}
