{"paperId": "72ff472d6a2793590c56b87abfd147463cfa01c8", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Review on Integrating Geospatial Big Datasets and Open Research Issues", "abstract": "Big data and geographic information systems (GIS) are two technologies that have increasingly influenced many areas in the last 10 years and will continue to improve and help solve serious global problems, such as consequences of climate change or global pandemics. A wide spectrum of GIS applications interacts with the continuous growth of geospatial big data sources to drive precise and informed decisions. Geospatial big data integration is designed to accomplish the compatibility of distinct geospatial datasets regardless of their spatial coverage. The large number of geospatial big data sources demand effective data integration for storing and handling such datasets, which will be used for geospatial data analysis and visualization. For instance, risk management datasets related to healthcare and the environment are heterogeneous and disparate. Obtaining a unified view of such geospatial big datasets is complicated and challenging, especially if we consider problems related to healthcare pandemics and environmental disasters. Hence, before we can attempt to predict and mitigate processes occurring in these domains, we must realize that geospatial big data integration is crucial in consolidating datasets. We explore and discuss issues involved in integrating geospatial big datasets in this study. We then classify big data integration processes into three categories, namely, data warehousing, data transformation and integration methods. Furthermore, several research challenges focused on geospatial big data, big earth data, data warehousing, data transformation and linked data are presented. Lastly, open research issues and emerging trends that require in-depth investigations in the near future are highlighted in this study.", "venue": "IEEE Access", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "10604-10620", "volume": "9"}, "authors": [{"authorId": "2047240451", "name": "Sohaib Al-Yadumi"}, {"authorId": "119263593", "name": "T. Xion"}, {"authorId": "2107504650", "name": "S. Wei"}, {"authorId": "1759546", "name": "P. Boursier"}], "citations": [{"paperId": "2277598cedadf1562f409a791eb4ae54a2721e37", "title": "Achieving Sustainable Smart Cities through Geospatial Data-Driven Approaches"}, {"paperId": "a96a85a35ad8f54d120a644942ffa291ef3cb088", "title": "Reimagining standardization and geospatial interoperability in today's GeoAI culture"}, {"paperId": "e69f0dcf48c4f7fb5c5dc72b854bce6454ab0acb", "title": "Cloud-based storage and computing for remote sensing big data: a technical review"}, {"paperId": "f8b829923938866fea051da47b5a3ab3d4c4e9f5", "title": "Multimatcher Model to Enhance Ontology Matching Using Background Knowledge"}, {"paperId": "7dc215cbc3c3e2d93ac5789e989af3659c133eb0", "title": "Applications of geospatial big data in the Internet of Things"}]}
