{"paperId": "7300d17d9fcf7c7732bbbd835e588b3c78cbf275", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "A review of systematic selection of clustering algorithms and their evaluation", "abstract": "Data analysis plays an indispensable role for value creation in industry. Cluster analysis in this context is able to explore given datasets with little or no prior knowledge and to identify unknown patterns. As (big) data complexity increases in the dimensions volume, variety, and velocity, this becomes even more important. Many tools for cluster analysis have been developed from early on and the variety of different clustering algorithms is huge. As the selection of the right clustering procedure is crucial to the results of the data analysis, users are in need for support on their journey of extracting knowledge from raw data. Thus, the objective of this paper lies in the identification of a systematic selection logic for clustering algorithms and corresponding validation concepts. The goal is to enable potential users to choose an algorithm that fits best to their needs and the properties of their underlying data clustering problem. Moreover, users are supported in selecting the right validation concepts to make sense of the clustering results. Based on a comprehensive literature review, this paper provides assessment criteria for clustering method evaluation and validation concept selection. The criteria are applied to several common algorithms and the selection process of an algorithm is supported by the introduction of pseudocode-based routines that consider the underlying data structure.", "venue": "arXiv.org", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-06-24", "journal": {"name": "ArXiv", "volume": "abs/2106.12792"}, "authors": [{"authorId": "2091908628", "name": "Markus Wegmann"}, {"authorId": "2114883882", "name": "Domenique Zipperling"}, {"authorId": "1582078901", "name": "J. Hillenbrand"}, {"authorId": "48180375", "name": "J. Fleischer"}], "citations": [{"paperId": "3a59cc32fcc6d2aa963ecd5b458e35a3d2cc9d2a", "title": "Influence of various text embeddings on clustering performance in NLP"}, {"paperId": "f65b9136fe024cd0d480410580a4e175e1840e04", "title": "Collection and classification of influence parameters for safety effectiveness of ADAS"}, {"paperId": "8fa6901c976042b8e26b528d726154f9c62be296", "title": "Cloud services cost comparison: a clustering analysis framework"}, {"paperId": "de39d7214498d6470ca7a578fa539d90e4e2aec8", "title": "Accelerating FCM Algorithm Using High-Speed FPGA Reconfigurable Computing Architecture"}, {"paperId": "2e7cb53175a73c28f168a1776325c70617dca830", "title": "Machine Learning Assisted Temporal Continuous Clustering"}, {"paperId": "9dc4c1b88482cf85ea079e7d57506dead5493e67", "title": "Analysis of Perception Accuracy of Roadside Millimeter-Wave Radar for Traffic Risk Assessment and Early Warning Systems"}, {"paperId": "4fef4b6d64da44a61a2fd07fdce3c999ff3401dd", "title": "Defining biologically relevant and hierarchically nested population units to inform wildlife management"}, {"paperId": "a6893cafe6401e104250ec033d7559ec83ee84fa", "title": "Seeking the Truth Beyond the Data. An Unsupervised Machine Learning Approach"}, {"paperId": "7da4254a0db084ed175ccaaed544a2fc6c4a04e3", "title": "Unsupervised Behaviour Analysis of News Consumption in Turkish Media"}, {"paperId": "9111a7542dec22a331d439cdd8313f7748ef4fcc", "title": "Twitter Referral Behaviours on News Consumption with Ensemble Clustering of Click-Stream Data in Turkish Media"}]}
