{"paperId": "7306e97d2fb5977572f47a90866323239ab1ccdc", "publicationVenue": null, "title": "Large Language Models in Biomedical and Health Informatics: A Bibliometric Review", "abstract": "Large Language Models (LLMs) have rapidly become important tools in Biomedical and Health Informatics (BHI), enabling new ways to analyze data, treat patients, and conduct research. This bibliometric review aims to provide a panoramic view of how LLMs have been used in BHI by examining research articles and collaboration networks from 2022 to 2023. It further explores how LLMs can improve Natural Language Processing (NLP) applications in various BHI areas like medical diagnosis, patient engagement, electronic health record management, and personalized medicine. To do this, our bibliometric review identifies key trends, maps out research networks, and highlights major developments in this fast-moving field. Lastly, it discusses the ethical concerns and practical challenges of using LLMs in BHI, such as data privacy and reliable medical recommendations. Looking ahead, we consider how LLMs could further transform biomedical research as well as healthcare delivery and patient outcomes. This bibliometric review serves as a resource for stakeholders in healthcare, including researchers, clinicians, and policymakers, to understand the current state and future potential of LLMs in BHI.", "venue": "", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2024-03-24", "journal": null, "authors": [{"authorId": "2118683388", "name": "Huizi Yu"}, {"authorId": "2268855367", "name": "Lizhou Fan"}, {"authorId": "2261065167", "name": "Lingyao Li"}, {"authorId": "2293319779", "name": "Jiayan Zhou"}, {"authorId": "2116609500", "name": "Zihui Ma"}, {"authorId": "2293313603", "name": "Lu Xian"}, {"authorId": "2007245028", "name": "Wenyue Hua"}, {"authorId": "2278792922", "name": "Sijia He"}, {"authorId": "2267333980", "name": "Mingyu Jin"}, {"authorId": "2239061409", "name": "Yongfeng Zhang"}, {"authorId": "2293313152", "name": "Ashvin Gandhi"}, {"authorId": "2290011099", "name": "Xin Ma"}], "citations": []}
