{"paperId": "73064cf70c9c7eb2b2d25393fe4cf228251db1ec", "publicationVenue": {"id": "89487478-e1f1-49f7-b9e9-676674e19ea6", "name": "ETRI Journal", "type": "journal", "alternate_names": ["ETRI J", "Etri J", "Etri Journal"], "issn": "1225-6463", "url": "https://onlinelibrary.wiley.com/journal/22337326", "alternate_urls": ["https://etrij.etri.re.kr/"]}, "title": "Combined time bound optimization of control, communication, and data processing for FSO‐based 6G UAV aerial networks", "abstract": "Because of the rapid increase of mobile traffic, flexible broadband supportive unmanned aerial vehicle (UAV)‐based 6G mobile networks using free space optical (FSO) links have been recently proposed. Considering the advancements made in UAVs, big data processing, and artificial intelligence precision control technologies, the formation of an additional wireless network based on UAV aerial platforms to assist the existing fixed base stations of the mobile radio access network is considered a highly viable option in the near future. In this paper, a combined time bound optimization scheme is proposed that can adaptively satisfy the control and communication time constraints as well as the processing time constraints in FSO‐based 6G UAV aerial networks. The proposed scheme controls the relation between the number of data flows, input data rate, number of worker nodes considering the time bounds, and the errors that occur during communication and data processing. The simulation results show that the proposed scheme is very effective in satisfying the time constraints for UAV control and radio access network services, even when errors in communication and data processing may occur.", "venue": "ETRI Journal", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2020-10-01", "journal": {"name": "ETRI Journal", "volume": "42"}, "authors": [{"authorId": "145260554", "name": "Seungwoo Seo"}, {"authorId": "2061196021", "name": "Da-Eun Ko"}, {"authorId": "145966639", "name": "Jong‐Moon Chung"}], "citations": [{"paperId": "89f4c03ac48d6b37597dca3f95bb38b29e714015", "title": "Level and Program Analytics of MUM-T System"}, {"paperId": "275f7702308f7f17e172f63764ca72e0da9d3c65", "title": "BandBlock: Bandwidth allocation in blockchain‐empowered UAV‐based heterogeneous networks"}, {"paperId": "ce57f15a139cf6e88a50b78879d14ee1558d918b", "title": "Driving altitude generation method with pseudo‐3D building model for unmanned aerial vehicles"}, {"paperId": "ad011ad89b860b3b19d88dbd3254e7835453b457", "title": "Challenges to the Development of Manned and Unmanned Combat Systems"}, {"paperId": "a371dbdf21dc9d955ee36d7de0f522afd3ab4396", "title": "Tracking Efficiency Improvement According to Incident Beam Size in QPD-Based PAT System for Common Path-Based Full-Duplex FSO Terminals"}, {"paperId": "9b79dd8c4ac6a3df404ca0213021aea0387b899e", "title": "Information Processing Methods of Electronic Warfare Events Based on Communication Technology"}, {"paperId": "5d179b5ffbecd8ab540fd34ce3930254a0c71f7c", "title": "The Intelligent Integration of Interactive Installation Art Based on Artificial Intelligence and Wireless Network Communication"}, {"paperId": "89294e9fa9aed1c17589ccc7e2db8f8508fa221d", "title": "On secrecy performance of mixed α − η − μ and Málaga RF-FSO variable gain relaying channel"}, {"paperId": "eefea3167b8e26a30e81e9bff672d127959e6825", "title": "6G and Internet of Things: a survey"}, {"paperId": "b32f0cb6ed3fa3d60b9b208e71907f3a8f68a9b1", "title": "Optimization of the Online Teaching System Based on Streaming Media"}, {"paperId": "648a6b255f2a37f592d30fdac9fd0111dc5a7c69", "title": "Issue Information"}, {"paperId": "46fc333ad91951443cd71c073ecb58f837e934ea", "title": "Adaptive Trust Management and Data Process Time Optimization for Real-time Spark Big Data Systems"}]}
