{"paperId": "730ae1201240ee6bb14a6a89837aa45f5fe36923", "publicationVenue": null, "title": "Control System Design and Implementation Based on Big Data and Ontology", "abstract": "In this article, the decision mechanism of a control system has been created by using big data and by applying an ontology model. This type of control is important in order to minimize, or even eliminate human influence in systematic industrial processes. The development presented in the article in order to make the ontology model compatible with a relational database in the decision mechanism, is a step taken to eliminate the human effect. The method used in the article aims to carry out a decision mechanism under the guidance of big data by using relational databases integrated with the ontology model. In line with this goal, the ontology model associated with relational databases with high prevalence will be able to access the continuous data required for the decision process and enrich the decision mechanism. In this study, when the necessary parameters for the decision process are obtained, dynamic threshold determination is provided by a machine learning model with these parameters. This dynamic threshold varies over various time periods, with the combination of inputs provided to the machine learning model and differences in value. Our test results state that the Decision Tree model predictions’ accuracy is 100%.", "venue": "2022 IEEE International Conference on Big Data (Big Data)", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-12-17", "journal": {"name": "2022 IEEE International Conference on Big Data (Big Data)", "pages": "6048-6056"}, "authors": [{"authorId": "2203105348", "name": "Seyithan Temel"}, {"authorId": "2139927772", "name": "Emre Ummak"}, {"authorId": "2203381466", "name": "Abdülkadir Tokgöz"}, {"authorId": "146716322", "name": "F. Işık"}, {"authorId": "2120334587", "name": "Özlem Albayrak"}, {"authorId": "2297567", "name": "Perin Ünal"}, {"authorId": "2239834944", "name": "Murat Özbayoğlu"}], "citations": []}
