{"paperId": "731701f470f114b51718454a803b16e1abac1d25", "publicationVenue": {"id": "34e23edc-d287-46e8-9963-ad079321aa9f", "name": "International Symposium on Autonomous Decentralized Systems", "type": "conference", "alternate_names": ["Int Symp Auton Decentralized Syst", "ISADS"], "url": "http://www.wikicfp.com/cfp/program?id=1669"}, "title": "A pipeline to collaborative AI models creation between Brazilian governmental institutions", "abstract": "The government has worked to improve technolo-gies to advance criminal investigations. It is very common for Brazilian public institutions to spend resources on systems to improve population security or investigations through artificial intelligence. A central point in this context is the data used by the institutions classified as highly sensitive. This sensitiveness creates a complex barrier to cooperation between governmental institutions from different areas. In this context, this study proposes a federated learning pipeline to encourage artificial intelligence model sharing between government institutions, taking advantage of high-security networks and computational resources from governmental institutions. We leveraged consolidated frameworks such as Docker and TensorFlow to ease the model sharing and training process without working with sensitive data risks. In this work, the performance of 5 different Federated Learning algorithms was tested using three different AI algorithms. In our experiments, the use of Federated Learning in the context of Brazilian governmental institutions proved to create models with performance similar to the standard Centralized Learning techniques in three different federated learning algorithms.", "venue": "International Symposium on Autonomous Decentralized Systems", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-03-15", "journal": {"name": "2023 IEEE 15th International Symposium on Autonomous Decentralized System (ISADS)", "pages": "1-7"}, "authors": [{"authorId": "116171163", "name": "Gabriel Souza"}, {"authorId": "50283693", "name": "Mickael Figueredo"}, {"authorId": "2213870724", "name": "Daniel Sabino"}, {"authorId": "1736197", "name": "N. Cacho"}], "citations": []}
