{"paperId": "731880114e8d82d4f269af12a5de315a13b87b26", "publicationVenue": {"id": "79af09a2-54e8-4f97-8edf-9fba208ab744", "name": "International Journal of Digital Earth", "type": "journal", "alternate_names": ["Int J Digit Earth"], "issn": "1753-8947", "url": "http://www.informaworld.com/smpp/title~content=1753-8947", "alternate_urls": ["http://www.tandfonline.com/toc/tjde20/current"]}, "title": "A novel semantic segmentation approach based on U-Net, WU-Net, and U-Net++ deep learning for predicting areas sensitive to pluvial flood at tropical area", "abstract": "ABSTRACT Floods remain one of the most devastating weather-induced disasters worldwide, resulting in numerous fatalities each year and severely impacting socio-economic development and the environment. Therefore, the ability to predict flood-prone areas in advance is crucial for effective risk management. The objective of this research is to assess and compare three convolutional neural networks, U-Net, WU-Net, and U-Net++, for spatial prediction of pluvial flood with a case study at a tropical area in the north of Vietnam. They are relative new convolution algorithms developed based on U-shaped architectures. For this task, a geospatial database with 796 historical flood locations and 12 flood indicators was prepared. For training the models, the binary cross-entropy was employed as the loss function, while the Adaptive moment estimation (ADAM) algorithm was used for the optimization of the model parameters, whereas, F1-score and classification accuracy (Acc) were used to assess the performance of the models. The results unequivocally highlight the high performance of the three models, achieving an impressive accuracy rate of 96.01%. The flood susceptibility maps derived from this research possess considerable utility for local authorities, providing valuable insights and information to enhance decision-making processes and facilitate the implementation of effective risk management strategies.", "venue": "International Journal of Digital Earth", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-13", "journal": {"name": "International Journal of Digital Earth", "pages": "3661 - 3679", "volume": "16"}, "authors": [{"authorId": "1596891613", "name": "Laura Melgar-García"}, {"authorId": "1397728402", "name": "F. Martínez-Álvarez"}, {"authorId": "2382463", "name": "D. Bui"}, {"authorId": "6352591", "name": "A. T. Lora"}], "citations": [{"paperId": "df9df7847d873dd8f904fc5a05b9c5ef65512dcd", "title": "Brain tumor segmentation algorithm based on pathology topological merging"}, {"paperId": "5bfe0698f17c1d83fb98b2108a17ebb8c01b7124", "title": "Spatial Prediction of Fluvial Flood in High-Frequency Tropical Cyclone Area Using TensorFlow 1D-Convolution Neural Networks and Geospatial Data"}]}
