{"paperId": "7318e84f1e1b1301758493021f64d0b16227ff11", "publicationVenue": {"id": "8d848812-c4dd-4524-a6ac-5f5822355b19", "name": "International journal of recent technology and engineering", "type": "journal", "alternate_names": ["Int j recent technol eng"], "issn": "2277-3878", "url": "https://www.ijrte.org/"}, "title": "A Systematic Review of the Sarcasm Detection in the Twitter Dataset", "abstract": "Text is the most significant contributor to data generated on the Internet. Understanding a person's opinion is an essential part of natural language processing. However, people's views can be skewed and inaccurate if people use sarcasm when they post status updates, comment on blogs, and review products and movies. Sarcasm detection has gained an important role in social networking platforms because it can impact many applications such as sentimental analysis, opinion mining, and stance detection. Twitter is rapidly growing in volume, and its analysis presents significant challenges in detecting sarcasm. Our research work focuses on various methodologies available for detection of sarcasm. Various papers from recent years were collected and review was carried out. This paper discusses the literature on sarcasm detection under the category of datasets, in different pre-processing, feature extraction, feature selection, classification algorithms, and performance measures. This paper discusses the literature on sarcasm detection under the category of datasets, in different pre-processing, feature extraction, feature selection, classification algorithms, and performance measures. This work explores existing approaches, challenges, and future scopes for sarcasm detection in the Twitter dataset. This review bringsto light the analysis ofsarcasm identification in Twitter data and is intended to serve as a resource for researchers and practitioners interested in sarcasm detection and text classification.", "venue": "International journal of recent technology and engineering", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2024-01-30", "journal": {"name": "International Journal of Recent Technology and Engineering (IJRTE)"}, "authors": [{"authorId": "2280545138", "name": "K. Veena"}, {"authorId": "2260892835", "name": "Dr.V. Sasirekha"}], "citations": []}
