{"paperId": "7321cfbc523f5a9f3de9e8a1f4380a9fc6725bcc", "publicationVenue": {"id": "6436ce18-1f30-4633-84ee-5809ed8c1aab", "name": "International journal of computer and information technologies", "type": "journal", "alternate_names": ["International Journal of Computing and Information Technology", "International Journal of Computer and Information Technology(2279-0764)", "International journal of computer and information technology", "Int J Comput Inf Technol", "Int j comput inf technol"], "issn": "2345-3877", "alternate_issns": ["2790-170X", "2279-0764", "2078-5828"], "url": "http://www.ijocit.org/", "alternate_urls": ["http://www.ijcit.com/", "http://www.ijcit.org/"]}, "title": "A Vision of the Internet of Things: A Review of Critical Challenges", "abstract": "Today, Information Communication Technology has brought many benefits to have a better life. Meanwhile, the concept of the Internet of Things (IoT), which has transformed the traditional lifestyle into a modern lifestyle and is growing rapidly, is of great importance. This research deals with the critical challenges of IoT. Although not much time has passed since the advent of the concept of the IoT, today the Internet of Things has faced a great deal of complexity in the industry, which requires in-depth studies to realise its potential and challenges. This study introduces and examines IoT challenges including security and privacy, scalability, interoperability, mobility, protocol & standardisation, and energy consumption. In this study, the relationship between these challenges has been clearly defined. Finally, based on the research, some main challenges or sub-challenges considered for these challenges.", "venue": "International journal of computer and information technologies", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2021-07-31", "journal": {"name": "International Journal of Computer and Information Technology(2279-0764)"}, "authors": [{"authorId": "93985752", "name": "Zahra Valadkhani"}, {"authorId": "2143198217", "name": "Farhad Lotfi"}, {"authorId": "145555340", "name": "Branka Rodić"}], "citations": []}
