{"paperId": "73322fb538811034065b055da1475ba5860aa9dd", "publicationVenue": null, "title": "Multivariate‐bounded Gaussian mixture model with minimum message length criterion for model selection", "abstract": "Bounded support Gaussian mixture model (BGMM) has been proposed for data modelling as an alternative to unbounded support mixture models for the cases when the data lies in bounded support. In this paper, we propose applications of multivariate BGMM in data clustering for more insightful analysis of the model. We also propose minimum message length (MML) criterion for model selection in data clustering using multivariate BGMM. The presented model is applied to data clustering in several speech (TSP and Spoken Digits) and image databases (MNIST and Fashion MNIST). We also propose the application of BGMM in code‐book generation at feature extraction phase. Inspired by the success of bag of visual words approach in computer vision, it is also introduced in speech data representation and validated through experiments presented in this paper. For validation of model selection criterion, MML is applied to different medical, speech and image datasets. Experimental results obtained during the model selection through MML are further compared with seven different model selection criteria. The results presented in the paper demonstrate the effectiveness of BGMM for clustering speech and image databases, code‐book generation through clustering for feature representation and model selection.", "venue": "Expert Syst. J. Knowl. Eng.", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-03-16", "journal": {"name": "Expert Systems", "volume": "38"}, "authors": [{"authorId": "144821487", "name": "Muhammad Azam"}, {"authorId": "1729109", "name": "N. Bouguila"}], "citations": [{"paperId": "3513c842ab107721179fbac8fae819e9e7eac87e", "title": "Novel approach for ECG separation using adaptive constrained IVABMGGMM"}, {"paperId": "e0853e931ca4aa90db675d7d366c82151eb7bde5", "title": "Automatic music mood classification using multi-modal attention framework"}, {"paperId": "a397c113bec428aaa14337a839f7bfcf4594d7cf", "title": "Unsupervised Mixture Models on the Edge for Smart Energy Consumption Segmentation with Feature Saliency"}, {"paperId": "0d624e2ceb76647dc2e3e96af1a8933ff13075a7", "title": "Explainable Robust Smart Meter Data Clustering for Improved Energy Management"}]}
