{"paperId": "73350fc5f47c999913fb3b2823cfdbed97dc85c4", "publicationVenue": {"id": "138e58fc-8643-41c2-a92c-068ea4f4c607", "name": "PeerJ Computer Science", "alternate_names": ["Peerj Comput Sci"], "issn": "2376-5992", "url": "https://peerj.com/archives/?journal=cs", "alternate_urls": ["https://peerj.com/computer-science/", "http://peerj.com/cs"]}, "title": "The impact of advance organizers in virtual classrooms on the development of integrated science process skills", "abstract": "Unlike virtual classrooms that have received extensive research attention in both academic and practical contexts because of their ability to improve students’ outcomes, the use of advance organizers are still in need for more research to prove their efficacy in fulfilling expected learning outcomes in these virtual classrooms. Hence, the present study aims to identify the impact of using such organizers in virtual classrooms on the development of students’ integrated science process skills. The present study was applied to 64 students who were studying for their Master’s degree in the vocational education techniques in the ”Research Project” course. Participants were randomly divided into two equal experimental groups with 32 students in each. An assessment card of five main domains was used to evaluate students’ skills in research procedural definition, identification and control of the research variables, questions and/or hypotheses, procedures and experimentation besides research interpretation of the results. Data analysis showed that the use of advance organizers in virtual classes was of great effect on the development of participants’ integrated science process skills because skills of students in the first experimental group were better mastered than the skills of their peers in the second experimental group in accordance with the subskills in the five domains.", "venue": "PeerJ Computer Science", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-04-05", "journal": {"name": "PeerJ Computer Science"}, "authors": [{"authorId": "30774329", "name": "Abdellah Ibrahim Mohammed Elfeky"}, {"authorId": "2295420416", "name": "Ali Hassan Najmi"}, {"authorId": "2295422226", "name": "Marwa Yasien Helmy Elbyaly"}], "citations": []}
