{"paperId": "734ec4a3d454f63dc19df5666034a7b2d349b6d1", "publicationVenue": {"id": "89d61e17-5d06-4d45-a0d0-c7b62b0a35b4", "name": "ACM Workshop on Hot Topics in Networks", "type": "conference", "alternate_names": ["HotNets", "ACM Workshop Hot Top Netw", "Hot Top Netw", "Hot Topics in Networks"], "url": "http://www.sigcomm.org/events/hotnets-workshop"}, "title": "Don't You Worry 'Bout a Packet: Unified Programming for In-Network Computing", "abstract": "In-network computing is gaining momentum as programmable switches are increasingly employed for compute acceleration. Designed for packet processing, data plane programming languages force developers to express compute in networking terms, resulting in a complex, error-prone practice. We envision the unification of switch and host programming and propose the Net Compute Language (NCL), a C/C++ extension for expressing computational kernels for switches to execute. NCL implements Compute Centric Communication (C3), our proposed programming model for INC under which, point-to-point primitives are augmented to carry out computations. We motivate our approach with real-world use cases and discuss the technical challenges for its realization.", "venue": "ACM Workshop on Hot Topics in Networks", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2021-11-04", "journal": {"name": "Proceedings of the 20th ACM Workshop on Hot Topics in Networks"}, "authors": [{"authorId": "2139374426", "name": "George Karlos"}, {"authorId": "144680288", "name": "H. Bal"}, {"authorId": "2144733651", "name": "Lin Wang"}], "citations": [{"paperId": "8a040d0d99fa248c415f0aa90a083123320bf21a", "title": "Offloading Machine Learning to Programmable Data Planes: A Systematic Survey"}, {"paperId": "de569676bf48bb9a392cee017f3966a9e6dc7b46", "title": "NetRPC: Enabling In-Network Computation in Remote Procedure Calls"}, {"paperId": "0ba37cbf08c0be57f2aacd4b2924f70655fd327a", "title": "Distributed DNN serving in the network data plane"}]}
