{"paperId": "7350aafd8ca50aebf47b7aeac878ac9456edf77f", "publicationVenue": {"id": "312ca99c-9149-490d-813e-c60d5e949f65", "name": "Concurrency and Computation", "type": "journal", "alternate_names": ["Concurr Comput Pract Exp", "Concurrency and Computation: Practice and Experience", "Concurr Comput"], "issn": "1532-0626", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/77004395?CRETRY=1&SRETRY=0", "alternate_urls": ["http://www3.interscience.wiley.com/cgi-bin/jtoc?ID=77004395", "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1532-0634"]}, "title": "PB3Opt: Profile‐based biased Bayesian optimization to select computing clusters on the cloud", "abstract": "Given the wide variety of cloud computing resources for creating high‐performance computer clusters and their complex performance relationship with applications, finding the optimal, or near‐optimal, cluster is a complex problem. As a result, several approaches have been proposed to find the optimal, or near‐optimal, cluster for a given high‐performance computing workload, while reducing the search cost. Among the approaches found in the literature, Bayesian optimization is one of the most known and applied. However, it is still possible to increase its performance by integrating it with historical data related to workload behavior. In this context, we suggest the PB3Opt$$ {\\mathrm{PB}}^3\\mathrm{Opt} $$ approach, which introduces a bias in the Bayesian optimization expected improvement acquisition function. The new acquisition function uses the ranking of computer clusters of previously explored workloads that have the same behavior as the workload being optimized. Our experimental results show that PB3Opt$$ {\\mathrm{PB}}^3\\mathrm{Opt} $$ classifies the behavior of workloads in groups so that the average‐ranking has 88.7% similarity with the ranking of the workload. With this, PB3Opt$$ {\\mathrm{PB}}^3\\mathrm{Opt} $$ finds, for almost 95% of workloads, a solution that is less than or equal to 1.2 ×$$ \\times $$ worse than the optimal computer cluster. In addition, the PB3Opt$$ {\\mathrm{PB}}^3\\mathrm{Opt} $$ works well when combined with the paramount iterations technique and is capable of reducing the search cost significantly.", "venue": "Concurrency and Computation", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-12-22", "journal": {"name": "Concurrency and Computation: Practice and Experience", "volume": "35"}, "authors": [{"authorId": "1779720762", "name": "Thais A. Silva Camacho"}, {"authorId": "17297886", "name": "V. M. Rosário"}, {"authorId": "134551342", "name": "O. Napoli"}, {"authorId": "1931645", "name": "E. Borin"}], "citations": []}
