{"paperId": "7351ac6dabf267f708b3a638765825effb9cb1ee", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Privacy-Preserving Deep Learning on Machine Learning as a Service—a Comprehensive Survey", "abstract": "The exponential growth of big data and deep learning has increased the data exchange traffic in society. Machine Learning as a Service, (MLaaS) which leverages deep learning techniques for predictive analytics to enhance decision-making, has become a hot commodity. However, the adoption of MLaaS introduces data privacy challenges for data owners and security challenges for deep learning model owners. Data owners are concerned about the safety and privacy of their data on MLaaS platforms, while MLaaS platform owners worry that their models could be stolen by adversaries who pose as clients. Consequently, Privacy-Preserving Deep Learning (PPDL) arises as a possible solution to this problem. Recently, several papers about PPDL for MLaaS have been published. However, to the best of our knowledge, no previous paper has summarized the existing literature on PPDL and its specific applicability to the MLaaS environment. In this paper, we present a comprehensive survey of privacy-preserving techniques, starting from classical privacy-preserving techniques to well-known deep learning techniques. Additionally, we present a detailed description of PPDL and address the issue of using PPDL for MLaaS. Furthermore, we undertake detailed comparisons between state-of-the-art PPDL methods. Subsequently, we classify an adversarial model on PPDL by highlighting possible PPDL attacks and their potential solutions. Ultimately, our paper serves as a single point of reference for detailed knowledge on PPDL and its applicability to MLaaS environments for both new and experienced researchers.", "venue": "IEEE Access", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "167425-167447", "volume": "8"}, "authors": [{"authorId": "3385931", "name": "Harry Chandra Tanuwidjaja"}, {"authorId": "36105968", "name": "Rakyong Choi"}, {"authorId": "30708702", "name": "Seunggeun Baek"}, {"authorId": "1741995", "name": "Kwangjo Kim"}], "citations": [{"paperId": "376a26c5f9ff3b782018ebdbf9c04b81b1071d10", "title": "A comprehensive survey and taxonomy on privacy-preserving deep learning"}, {"paperId": "f0e185eb0836c6765d8ce5788cefd01f8cf9bc1e", "title": "Differential privacy scheme using Laplace mechanism and statistical method computation in deep neural network for privacy preservation"}, {"paperId": "25cf1c4dcec0a13c8353fc42d7ba87f3c2916719", "title": "Privacy-Preserving Deep Learning Framework Based on Restricted Boltzmann Machines and Instance Reduction Algorithms"}, {"paperId": "09e81b39f3e42b928766d9ac8b2ef6b5685d90ac", "title": "DISTINQT: A Distributed Privacy Aware Learning Framework for QoS Prediction for Future Mobile and Wireless Networks"}, {"paperId": "58ea3d87a84bc4cd9d1a22a7cee1cfa73e412038", "title": "A Machine Learning Framework for Industrial IoT Systems That Helps Preserve Privacy Using Poly1305 Encryption"}, {"paperId": "8609a2bb1cf03d8064418d40894d94ab2d9c0649", "title": "Privacy-Preserving Machine Learning as a Service: Challenges and Opportunities"}, {"paperId": "e8e98901428b840c8c9f1fb7777549de6ce22bb0", "title": "Toward a Comprehensive Framework for Ensuring Security and Privacy in Artificial Intelligence"}, {"paperId": "ce68c26988c482c826f5bf569e3a383c16b1c389", "title": "Privacy protection of quantum BP neural network based on game theory"}, {"paperId": "a21acd19c2ee1e329a111ff88cb8e0be8ae83396", "title": "User Acceptance Criteria for Privacy Preserving Machine Learning Techniques"}, {"paperId": "5be1fc20d5f5c9cdb5c25cc5bf11ec3b5b347781", "title": "Privacy Preservation Using Machine Learning in the Internet of Things"}, {"paperId": "2e99f94ca64df7b5d23b8e9fa576cc7bbc897757", "title": "Privacy Preserving Data Analysis with the Encode, Shuffle, Analyse Architecture in Vehicular Data Sharing"}, {"paperId": "9c1139b485558c9c1e266b917e9d975fbf1a9480", "title": "Rbox: A web API for software integration with the R programming language"}, {"paperId": "d1b01ab123bbee54bc864212a890689ca59e296d", "title": "Classification of satellite images for ecology management using deep features obtained from convolutional neural network models"}, {"paperId": "9630019d166f48d995f2df8552a82ac5aea9b915", "title": "Threats, Vulnerabilities, and Controls of Machine Learning Based Systems: A Survey and Taxonomy"}, {"paperId": "835b24bea25912e96a28285cd8c484cab7dc1639", "title": "Weakly supervised deep metric learning on discrete metric spaces for privacy-preserved clustering"}, {"paperId": "0d4b008b686a4c150e3c31cfe585b953304efa0f", "title": "A Systematic Literature Review On Privacy Of Deep Learning Systems"}, {"paperId": "9064ba420ef1fa2bf9ac43e06a50e18288642094", "title": "On-device federated learning with fuzzy logic based client selection"}, {"paperId": "788a445bc8ca20c240b285d3225aefe63c5a4046", "title": "Privacy-preserving time series prediction with temporal convolutional neural networks"}, {"paperId": "86dfcb4f18e5f44425cf06790bdb294e61773443", "title": "Refacing Defaced MRI with PixelCNN"}, {"paperId": "f90e4db93456237d70da5b48121cb480c1255992", "title": "Internet of Intelligence: A Survey on the Enabling Technologies, Applications, and Challenges"}, {"paperId": "187e13df657c67e9d2287959ee39835f70331b1a", "title": "Privacy-Preserving Image Template Sharing Using Contrastive Learning"}, {"paperId": "b92436912fd02fa4cfef9125eb8cd00fde7ecd4a", "title": "A privacy-preserving model based on differential approach for sensitive data in cloud environment"}, {"paperId": "8d7f75e8e4c15ac402686b8e4fd153c4cc2b12c2", "title": "Towards learning trustworthily, automatically, and with guarantees on graphs: An overview"}, {"paperId": "8e46064c33fd16393512cd4d76a824c1a2923880", "title": "Securing the Classification of COVID-19 in Chest X-ray Images: A Privacy-Preserving Deep Learning Approach"}, {"paperId": "c8781c9a120f974bb140c1dd05f7b7cb68a461da", "title": "Visual privacy attacks and defenses in deep learning: a survey"}, {"paperId": "784f3d6dff7bf5e7b981e56369c01687fa903a35", "title": "Adversarial learning techniques for security and privacy preservation: A comprehensive review"}, {"paperId": "f6e5ab183e69f19adab45bad96421bf7352c3182", "title": "Data Privacy Protection based on Feature Dilution in Cloud Services"}, {"paperId": "04e0f8658b1ff8eeaa17969194a42e72ce5d8cb4", "title": "Evaluating Privacy-Preserving Machine Learning in Critical Infrastructures: A Case Study on Time-Series Classification"}, {"paperId": "9ea9c96c45307dfd38d10d0e0b467f7c50552505", "title": "SoK: Efficient Privacy-preserving Clustering"}, {"paperId": "31f3dbc28dd7158e95d76bb0757030295c9f769d", "title": "SoK: Privacy-Preserving Computation Techniques for Deep Learning"}, {"paperId": "76c500a32917e16d0b9fe4cc694d1b67f3c8d9c7", "title": "Efficient and Privacy-preserving Distributed Learning in Cloud-Edge Computing Systems"}, {"paperId": "af7a0821e4cada05facbede501f0870ab96351ee", "title": "Privacy-Preserving Deep Neural Network Methods: Computational and Perceptual Methods—An Overview"}, {"paperId": "68b181d030c24a4dbbe806de456c48309c65f0ba", "title": "An Efficient Approach Based on Privacy-Preserving Deep Learning for Satellite Image Classification"}, {"paperId": "d55e3fae78a8ec268a043470f709b8aaac9e5e14", "title": "Machine Learning for the Educational Sciences"}, {"paperId": "8d8bbfd1b42b504e3f45e2c7e8fe78e4e09d83f1", "title": "FedBoosting: Federated learning with gradient protected boosting for text recognition"}, {"paperId": "1556769045d618b5a48bb8c22865c86c7e4b9551", "title": "Private Hierarchical Clustering and Efficient Approximation"}, {"paperId": "6f01ca395514bfe216aade6b2d3c5c43f1e9dd42", "title": "Privacy and Security Concerns in Generative AI: A Comprehensive Survey"}, {"paperId": "2fb92d1a04fabeb0814ccfa0f0781ac36fc975d0", "title": "Encryption and Generation of Images for Privacy-Preserving Machine Learning in Smart Manufacturing"}, {"paperId": "d84d5960fccc9b68b85e3acd463353f1d89a8276", "title": "A Generic Cryptographic Deep-Learning Inference Platform for Remote Sensing Scenes"}, {"paperId": "9a1720986bcf7b055ed5aae1b8cfd0a8ff88d08a", "title": "Verifiable Homomorphic Secret Sharing for Machine Learning Classifiers"}, {"paperId": "de4c4b1ef4efe36a945f59be3aaf3a9f59901492", "title": "SEC: Fast Private Boolean Circuit Evaluation from Encrypted Look-ups"}, {"paperId": "a531e7b82a8a3262440dff4dc5f10b0f2ddd8798", "title": "Practical Privacy-Preserving Machine Learning using Fully Homomorphic Encryption"}, {"paperId": "18335c8d291de2d6fdb91915a1bacaf3a446513a", "title": "Privacy and Security in Distributed Learning: A Review of Challenges, Solutions, and Open Research Issues"}, {"paperId": "8a318f05d1f551d6d398b417a86063d6df26e2bf", "title": "Robust Botnet DGA Detection: Blending XAI and OSINT for Cyber Threat Intelligence Sharing"}, {"paperId": "44cd69e3337f2ed684679020b4111cd29f4981c9", "title": "Introduction"}, {"paperId": "9f8dc511f33e1b67d2cf77084ea56762095ba94d", "title": "Privacy-Preserving Deep Learning: A Comprehensive Survey"}]}
