{"paperId": "73581e6df0c5de38136de4cea4d93889e16a3872", "publicationVenue": null, "title": "Transforming Social Determinants to Educational Outcomes: Geospatial Considerations", "abstract": "In recovering from one of the worst educational crises in recorded history due to the pandemic, in a mission to rebuild and become more resilient, there has been a heightened urgency to provide resources to communities most in need. However, precisely identifying those needs have become all the more important due to the increase in popularity of e-learning as a suitable option and the improvement of technologies. Most notably, socially disadvantaged and historically marginalized communities were disproportionately and severely impacted by several aspects of the pandemic, in terms of health, economics, access to education, and sustainable well-being. This differential effect was modeled spatially with the combination of aerial photogrammetry, traditional geospatial mapping, and other robust AI-driven techniques to synthesize and analyze the various types of data. In this original research study, we apply various spatial health variables, relate them to educational variables in an initial empirical process of understanding how to address equity-related considerations from the context of the learner’s experience, providing the empirical evidence for the development of locally tailored learner support and assistance, meeting students where they are by specifically identifying and targetting geographically underserved areas. We found that there were clear statistically significant relationships between educational attainment and several physical (p < 0.001), mental (p = 0.003), access to healthy food/food security (p < 0.001), and uptake of preventative health measures (p < 0.001), which also varied geographically. Geographic variations in learning experiences demonstrates the unquestionable need to understand a variety of physical, mental, and dietary factors surrounding the student’s success. Understanding a combination of these factors in a geospatial context will allow educational institutions to best serve the needs of learners.", "venue": "Healthcare", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-10-01", "journal": {"name": "Healthcare", "volume": "10"}, "authors": [{"authorId": "1646759684", "name": "Sri Banerjee"}, {"authorId": "6084480", "name": "G. Szirony"}, {"authorId": "113347586", "name": "Nina McCune"}, {"authorId": "2068063841", "name": "W. Davis"}, {"authorId": "2187525155", "name": "Sue Subocz"}, {"authorId": "11367335", "name": "Brian Ragsdale"}], "citations": [{"paperId": "fdf7732fd270a5ab533893c742507def934e5efc", "title": "Centering Health Equity Through the Social Determinants of Health, Interprofessional Education, and Sustainable Partnerships With Historically Black Colleges and Universities: Envisioning Upstream and Downstream Impacts"}, {"paperId": "275588aa4535b9b1571d9ff27cab492847178dc1", "title": "URBAN–RURAL DIFFERENCES IN PRIMARY SCHOOL RESOURCES IN CHINA: A CASE STUDY OF YUNCHENG COUNTY"}]}
