{"paperId": "73581892ee3f6d83f83863e95c627cbaec0911cd", "publicationVenue": {"id": "2652c952-18cb-468d-8abf-d8334001c372", "name": "INTERNATIONAL JOURNAL OF SOCIAL SCIENCE AND EDUCATION RESEARCH STUDIES", "type": "journal", "alternate_names": ["INT J SOC SCI EDUC RES STUD"], "issn": "2770-2782"}, "title": "Analysis of Social Inequality and Education Level in South Sulawesi Province, Indonesia", "abstract": "The purpose of this research is to analyze social inequality and education levels in regencies and cities in South Sulawesi so that the development process can be improved and there is an equitable distribution of development. This type of research is survey research with quantitative data. The factors analyzed and influencing social inequality in this study are population growth, population density, level of education, and the number of workers. The findings show that the average socio-economic inequality in the high category includes Selayar regency, Bulukumba regency, Bantaeng regency, Takallar regency, Pangkep regency, Soppeng regency, Wajo regency, Sidrap regency, Bone regency, Barru regency, Enrekang regency, Tana Toraja regency, North Luwu regency, Luwu regency, East Luwu regency and Makassar city. Meanwhile, the average socio-economic inequality in the moderate category includes Jeneponto regency, Gowa regency, Maros regency, Sinjai regency, Pinrang regency, North Toraja regency, Pare-pare city, and Palopo city. The suggestions to be conveyed are to expand the study by adding several related variables and developing a Green Open Space (RTH) variable to see the environmental quality of each Regency and City in responding to climate change issues.", "venue": "INTERNATIONAL JOURNAL OF SOCIAL SCIENCE AND EDUCATION RESEARCH STUDIES", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-07-12", "journal": {"name": "INTERNATIONAL JOURNAL OF SOCIAL SCIENCE AND EDUCATION RESEARCH STUDIES"}, "authors": [{"authorId": "1413692184", "name": "Besse Qur’ani"}, {"authorId": "1581161810", "name": "A. Hadis"}, {"authorId": "2223362451", "name": "Muh. Ashary Anshar"}], "citations": []}
