{"paperId": "736202827d8601af1cbf0a46373b72f58c5243fd", "publicationVenue": null, "title": "Maintenance 4.0: implementation challenges and its analysis", "abstract": "PurposeThe purpose of this paper is to identify and analyze the challenges associated with the implementation of the concept of Maintenance 4.0 in industries.Design/methodology/approachThe challenges in the implementation of Maintenance 4.0 are identified through a literature survey and interaction with professionals from the industry and academia. A structural hierarchy framework that integrates the methodologies of ISM and MICMAC is used for the analysis of Maintenance 4.0 implementation challenges. The framework establishes the interrelationship among challenges and segregates them into driving, linkage, dependent and autonomous groups.FindingsA novel concept of Maintenance 4.0 under the aegis of Industry 4.0 is gaining appreciation worldwide. However, there are challenges in the adaptation of Maintenance 4.0 concepts among industries. The various challenges as well as their impact on the objective of implementation of Maintenance 4.0 are identified.Practical implicationsThe practicing engineers, academicians, researchers and the concerned industries can infer from the results to improve upon the causes of such challenges and promote the implementation of Maintenance 4.0 most efficiently and effectively.Originality/valueThis paper is a novel, unique and first of its kind that addresses the most contemporary challenges in the implementation of Maintenance 4.0 concepts in industries.", "venue": "International Journal of Quality &amp; Reliability Management", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-12-08", "journal": {"name": "International Journal of Quality &amp; Reliability Management"}, "authors": [{"authorId": "48515533", "name": "A. James"}, {"authorId": "144612998", "name": "Girish Kumar"}, {"authorId": "2194460025", "name": "Adnan Qayyum Khan"}, {"authorId": "1985034", "name": "M. Asjad"}], "citations": [{"paperId": "63771e1c9d067e6f445e839ebe7f4db6958d6902", "title": "Barriers to Industry 4.0 technology adoption in agricultural supply chains: a Fuzzy Delphi-ISM approach"}, {"paperId": "a1f472e289e123407218ea1f2a799e662dc998c5", "title": "Machine Learning-Based Predictive Maintenance: Using CNN – LSTM network"}, {"paperId": "da53b06506101ea543e54526fd9fef1e6b5a6527", "title": "An Artificial Intelligence Approach for Improving Maintenance to Supervise Machine Failures and Support Their Repair"}]}
