{"paperId": "736bbee6029e650ca39d94ceeec2604f8f52a6be", "publicationVenue": {"id": "1e07c289-2f48-4e53-952a-2774c8173782", "name": "Business Process Management Journal", "type": "journal", "alternate_names": ["Bus Process Manag J"], "issn": "1463-7154", "url": "https://www.emerald.com/insight/publication/issn/1463-7154"}, "title": "Supply chain agility and firm performance: testing serial mediations in pharmaceutical industry", "abstract": "PurposeThe supply chain agility (SCA) is becoming a source of competitive differentiation but debate on its antecedents which can result in optimal firm performance is still non-pervasive in the literature. Taking this gap into consideration, the current research aimed at investigating various enablers of supply chain agility of Pakistani pharmaceutical industry.Design/methodology/approachThe data were collected from 204 top executives working in different supply chain functions including planning, supplying, operations and purchasing in national and multinational pharmaceutical companies in Pakistan.FindingsThrough serial-mediation model, results revealed the strength of various SCA enablers, along with the mediating roles of delivery dependability.Originality/valueThis study adds in the literature on how various supply chain enablers and competencies help the organizations to achieve supply chain agility and performance, especially in a developing country.", "venue": "Business Process Management Journal", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-04-18", "journal": {"name": "Bus. Process. Manag. J.", "pages": "991-1009", "volume": "29"}, "authors": [{"authorId": "2166727732", "name": "Rehan Ahmad"}, {"authorId": "2105529363", "name": "Khurram Shahzad"}, {"authorId": "145360801", "name": "M. Ishaq"}, {"authorId": "16147995", "name": "Junaid Aftab"}], "citations": [{"paperId": "42a0ba214d48b1d0319ad1c6b8672ab5aeacf735", "title": "Blockchain-Capabilities, Supply Chain Resilience, and Company Performance: An Empirical Study in Indonesia and Switzerland"}]}
