{"paperId": "737dfafa721ee0fe288d7ab3052885167189a466", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Landslide Susceptibility Modeling Using a Deep Random Neural Network", "abstract": "Developing landslide susceptibility modeling is essential for detecting landslide-prone areas. Recently, deep learning theories and methods have been investigated in landslide modeling. However, their generalization is hindered because of the limited size of landslide data. In the present study, a novel deep learning-based landslide susceptibility assessment method named deep random neural network (DRNN) is proposed. In DRNN, a random mechanism is constructed to drop network layers and nodes randomly during landslide modeling. We take the Lushui area (Southwest China) as the case and select 12 landslide conditioning factors to perform landslide modeling. The performance evaluation results show that our method achieves desirable generalization performance (Kappa = 0.829) and outperforms other network models such as the convolution neural network (Kappa = 0.767), deep feedforward neural network (Kappa = 0.731), and Adaboost-based artificial neural network (Kappa = 0.732). Moreover, the robustness test shows the advantage of our DRNN, which is insensitive to variations in training data size. Our method yields an accuracy higher than 85% when the training data size stands at only 10%. The results demonstrate the effectiveness of the proposed landslide modeling method in enhancing generalization. The proposed DRNN produces accurate results in terms of delineating landslide-prone areas and shows promising applications.", "venue": "Applied Sciences", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-12-15", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "2150608129", "name": "Cheng Huang"}, {"authorId": "2200164571", "name": "Fang Li"}, {"authorId": "2110581049", "name": "Lei Wei"}, {"authorId": "1997478327", "name": "Xudong Hu"}, {"authorId": "7608085", "name": "Yingdong Yang"}], "citations": [{"paperId": "d043666d29d6430a63d3f20385b18ace7549cdea", "title": "Unraveling the evolution of landslide susceptibility: a systematic review of 30-years of strategic themes and trends"}, {"paperId": "a470bea8c32952cbd4889c263752a25f91520161", "title": "Landslide Susceptibility Evaluation Based on a Coupled Informative–Logistic Regression Model—Shuangbai County as an Example"}, {"paperId": "2be2e9eef1f5827fe2bc4c192e8ce378c7206d7e", "title": "Apparatus for the Measurement of Electromagnetic Activity of Landslides"}, {"paperId": "e1ba47047d3e25c9a4fc26b294d3e1d4a9529cb0", "title": "Credal-Decision-Tree-Based Ensembles for Spatial Prediction of Landslides"}]}
