{"paperId": "73811b98ac44e6c8a76123279c590433bc9faae9", "publicationVenue": null, "title": "Artificial Intelligence Enabled Middleware for Distributed Cyberattacks Detection in IoT-based Smart Environments", "abstract": "The Internet of Things (IoT) in the world is drastically increasing to make environments more efficient, user-friendly, and automated. However, cyberattacks on these IoT devices continue to be a significant t hreat. I n t his a rticle, w e p ropose a novel Artificial Intelligence (AI)-based middleware and model for middleware to detect attacks in versatile Smart Environments. To assess the applicability of the proposed method, we designed four-step process for data-driven multi-agent malware and attack detection. The first s tep c orresponds w ith t he a ggregation of multi-level network traffic d ata f rom s everal I oT d evices s uch as Arduino, Rasberry Pi, NVIDIA Jetson devices, etc. In the second phase, different AI and Deep Learning models are applied for multi-level malware and attack classifications, a nd t he efficiency of the off-chip inferred AI model is evaluated with a motive to reduce the overhead and latency of the IoT components. In the third step, we deploy the different versions of the inferred model on our heterogeneous local smart environments. Finally, as the fourth step, the performance and concurrency testing in terms of electrical power, network bandwidth, and memory usage by the model is measured to check how efficient the Artificial Intelligence method is towards IoT cybersecurity for smart environments. The experimental results on the heterogeneous IoT malware and attack datasets inspected in this study suggest AI can be used as an effective tool to prevent the smart environment from cybersecurity threats.", "venue": "2022 IEEE International Conference on Big Data (Big Data)", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-12-17", "journal": {"name": "2022 IEEE International Conference on Big Data (Big Data)", "pages": "3023-3032"}, "authors": [{"authorId": "11670279", "name": "G. Bhandari"}, {"authorId": "2164768045", "name": "Andreas Lyth"}, {"authorId": "2724426", "name": "Andrii Shalaginov"}, {"authorId": "1390761616", "name": "Tor-Morten Grønli"}], "citations": [{"paperId": "ed015a96b06de06adcd4e6ec948f5c5b42d1755d", "title": "SmartSentry: Cyber Threat Intelligence in Industrial IoT"}]}
