{"paperId": "73836929255dcd42b41ea235766d889da322fd28", "publicationVenue": {"id": "d5b215f3-f737-45b2-875b-df309ce14c43", "name": "Scientific Programming", "type": "journal", "alternate_names": ["Sci Program"], "issn": "1058-9244", "url": "https://www.hindawi.com/journals/sp/", "alternate_urls": ["https://www.iospress.nl/html/10589244.php", "https://www.wiley.com/legacy/compbooks/compjournals/sciprog.html", "http://content.iospress.com/journals/scientific-programming"]}, "title": "Using Natural Language Preprocessing Architecture (NLPA) for Big Data Text Sources", "abstract": "During the last years, big data analysis has become a popular means of taking advantage of multiple (initially valueless) sources to find relevant knowledge about real domains. However, a large number of big data sources provide textual unstructured data. A proper analysis requires tools able to adequately combine big data and text-analysing techniques. Keeping this in mind, we combined a pipelining framework (BDP4J (Big Data Pipelining For Java)) with the implementation of a set of text preprocessing techniques in order to create NLPA (Natural Language Preprocessing Architecture), an extendable open-source plugin implementing preprocessing steps that can be easily combined to create a pipeline. Additionally, NLPA incorporates the possibility of generating datasets using either a classical token-based representation of data or newer synset-based datasets that would be further processed using semantic information (i.e., using ontologies). This work presents a case study of NLPA operation covering the transformation of raw heterogeneous big data into different dataset representations (synsets and tokens) and using the Weka application programming interface (API) to launch two well-known classifiers.", "venue": "Scientific Programming", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-08-01", "journal": {"name": "Sci. Program.", "pages": "2390941:1-2390941:13", "volume": "2020"}, "authors": [{"authorId": "2006000708", "name": "María Novo-Lourés"}, {"authorId": "1831596", "name": "Reyes Pavón"}, {"authorId": "3249246", "name": "Rosalía Laza"}, {"authorId": "1398027047", "name": "David Ruano-Ordás"}, {"authorId": "1771389", "name": "J. R. Méndez"}], "citations": [{"paperId": "34cd50c0d9e92a6013878bec4520f18357dff509", "title": "ChatGPT versus Bard: A comparative study"}, {"paperId": "d9991b4fdbc2533df674852094f058dc0f0a5a2d", "title": "Multi-objective evolutionary optimization for dimensionality reduction of texts represented by synsets"}, {"paperId": "499626749ceb60f13735c88e17e479fa6ac221c7", "title": "Research on Big Data Text Clustering Algorithm Based on Swarm Intelligence"}, {"paperId": "613ef3daf9bdf11cf15ddeaab007d178db746366", "title": "Enhancing representation in the context of multiple-channel spam filtering"}, {"paperId": "b0e08b330f1c29869909d14da874a67dceea39e4", "title": "Supporting Emotion Automatic Detection and Analysis over Real-Life Text Corpora via Deep Learning: Model, Methodology and Framework"}, {"paperId": "8ebbbdbf7a77b28739200a49789bc3e1011eb59a", "title": "ChatGPT vs. Bard: A Comparative Study"}, {"paperId": "606db3fbf52d3c7e6886d077df72515bd4c33f31", "title": "Design Principles and a Software Reference Architecture for Big Data Question Answering Systems"}]}
