{"paperId": "7386df9e82c5f0411084f7594cadd3e4c97ab790", "publicationVenue": null, "title": "The viability of analog-based accelerators for neuromorphic computing: a survey", "abstract": "Focus in deep neural network hardware research for reducing latencies of memory fetches has steered in the direction of analog-based artificial neural networks (ANN). The promise of decreased latencies, increased computational parallelism, and higher storage densities with crossbar non-volatile memory (NVM) based in-memory-computing/processing-in-memory techniques is not without its caveats. This paper surveys this rich landscape and highlights the advantages and challenges of emerging NVMs as multi-level synaptic emulators in various neural network types and applications. Current and potential methods for reliably programming these devices in a crossbar matrix are discussed, as well as techniques for reliably integrating and propagating matrix products to emulate the well-known MAC-like operations throughout the neural network. This paper complements previous surveys, but most importantly uncovers further areas of ongoing research relating to the viability of analog-based ANN implementations based on state-of-the-art NVM technologies in the context of hardware accelerators. While many previous reviews of analog-based ANN focus on device characteristics, this review presents the perspective of crossbar arrays, peripheral circuitry and the required architectural and system considerations for an emerging memory crossbar neural network.", "venue": "Neuromorph. Comput. Eng.", "year": 2021, "fieldsOfStudy": ["Physics", "Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-05-17", "journal": {"name": "Neuromorphic Computing and Engineering", "volume": "1"}, "authors": [{"authorId": "2121837045", "name": "Mirembe Musisi-Nkambwe"}, {"authorId": "1490775352", "name": "Sahra Afshari"}, {"authorId": "34944601", "name": "H. Barnaby"}, {"authorId": "1916282", "name": "M. Kozicki"}, {"authorId": "30786176", "name": "Ivan Sanchez Esqueda"}], "citations": [{"paperId": "b8625ad7c66202a9f0dd32477aad9b483fae76e3", "title": "SpikeExplorer: hardware-oriented Design Space Exploration for Spiking Neural Networks on FPGA"}, {"paperId": "8a729086dd7c08b4df23629cd6266aaa8706220b", "title": "Effect of stochastic activation function on reconstruction performance of restricted Boltzmann machines with stochastic magnetic tunnel junctions"}, {"paperId": "8a1f79f2cfb131fa3da26ed34f3074c785959a40", "title": "Ferroelectric Tunnel Junction Memristors for In‐Memory Computing Accelerators"}, {"paperId": "7224124d8db3afbbdc096f12714b9a28aa5d6d15", "title": "QuickNN: Python Toolbox for Training and Optimizing ANN for Hardware Implementation"}, {"paperId": "1cb4d2d90c71aaa1ece9f6fac8d89da76b992712", "title": "Variability Analysis of Multilevel Spin-Orbit Torque MRAMs using Machine Learning"}, {"paperId": "5387d1c8b1703108ae09c3425303d3307ec93c1e", "title": "Energy-efficient on-chip learning for a fully connected neural network using domain wall device"}, {"paperId": "454932d21a87acffc23fec59b567bb5c8fbea353", "title": "Impact of Temperature-Induced Oxide Defects on HfxZr1−xO2 Ferroelectric Tunnel Junction Memristor Performance"}, {"paperId": "e9c829ec4cc5e073d76099be723aed5fe0a405f0", "title": "Brain-inspired methods for achieving robust computation in heterogeneous mixed-signal neuromorphic processing systems"}, {"paperId": "a9076199a51e1c988f7ee20ca106f5f94f9bb6f7", "title": "Hexagonal boron nitride (h-BN) memristor arrays for analog-based machine learning hardware"}, {"paperId": "100b4566071631fbcd3fee659c5079f81bfc1b56", "title": "Security as an Important Ingredient in Neuromorphic Engineering"}, {"paperId": "014a346eff535d696b7a688ce418dd8dc56c3c43", "title": "Advantages of binary stochastic synapses for hardware spiking neural networks with realistic memristors"}, {"paperId": "9b6e4aab0552630b640e993331add3baeb57d9aa", "title": "Universal Non-Polar Switching in Carbon-doped Transition Metal Oxides (TMOs) and Post TMOs"}, {"paperId": "597c2de158c0c67333e244d06eee0de214501f7d", "title": "On-chip learning of a domain-wall-synapse-crossbar-array-based convolutional neural network"}, {"paperId": "45a37d48406f9ac083ae4ec618a99328eb186ca5", "title": "Modeling and analyzing neuromorphic SNNs as discrete event systems"}, {"paperId": "f0be4145b42ef53a42791732fe22fed87ed4fa17", "title": "Implementing Spiking Neural Networks on Neuromorphic Architectures: A Review"}, {"paperId": "8b4e4df8e3334046ae69feb2827b3d279cc809dd", "title": "Introducing \"Neuromorphic Computing and Engineering\""}, {"paperId": "a508bec45949fdf7a9c5d061295e47b773fdd344", "title": "The role of analog signal processing in upcoming telecommunication systems: Concept, challenges, and outlook"}, {"paperId": "96a30aaf83f2a05ae5009336ed9377e66f3ff719", "title": "Complex Oxides for Computing Beyond von Neumann"}]}
