{"paperId": "7396b87c86f9a6f1edf25f8753f787e9578d0afb", "publicationVenue": {"id": "74f47cf8-2839-4a56-959a-524dd0ed9e3e", "name": "International Conference on Extending Database Technology", "type": "conference", "alternate_names": ["Int Conf Extending Database Technol", "Extending Database Technology", "Extending Database Technol", "EDBT"], "url": "http://www.edbt.org/"}, "title": "Production Experiences from Computation Reuse at Microsoft", "abstract": "Massive data processing infrastructures are commonplace in modern data-driven enterprises. They facilitate data engineers in building scalable data pipelines over shared datasets. Unfortunately, data engineers often end up building pipelines that have portions of their computations common across other pipelines over the same set of shared datasets. Consolidating these data pipelines is therefore crucial for eliminating redundancies and improving production efficiency, thus saving significant operational costs. We had built CloudViews for automatic computation reuse in Cosmos big data workloads at Microsoft. CloudViews added a feedback loop in the SCOPE query engine to learn from past workloads and opportunistically materialize and reuse common computations as part of query processing in future SCOPE jobs — all completely automatic and transparent to the users. In this paper, we describe our production experiences with CloudViews. We first describe the data preparation process in Cosmos and show how computation reuse naturally augments this process. This is because computation reuse prepares data further into more shareable datasets that can improve the performance and efficiency of subsequent processing. We then discuss the usage and impact of CloudViews on our production clusters and describe many of the operational challenges that we have faced so far. Results from our current production deployment over a two month window show that the cumulative latency of jobs improved by 34%, with a median improvement of 15%, and the total processing time reduced by 37%, indicating better customer experience and lower operational costs for these workloads.", "venue": "International Conference on Extending Database Technology", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": null, "journal": {"pages": "623-634"}, "authors": [{"authorId": "2153832", "name": "Alekh Jindal"}, {"authorId": "49830907", "name": "S. Qiao"}, {"authorId": "1471618633", "name": "Hiren Patel"}, {"authorId": "2153931746", "name": "Abhishek Roy"}, {"authorId": "50334798", "name": "Jyoti Leeka"}, {"authorId": "144843868", "name": "Brandon Haynes"}], "citations": [{"paperId": "cfd55aeec363d9e0c29b127aa8c0fc8bfbb24085", "title": "Sibyl: Forecasting Time-Evolving Query Workloads"}, {"paperId": "b7aeca3f9116da88c89357b0cf4438401bc7ba3b", "title": "GEqO: ML-Accelerated Semantic Equivalence Detection"}, {"paperId": "ac08fa76038762f89a0f6c39ea38655422926408", "title": "Towards Building Autonomous Data Services on Azure"}, {"paperId": "344fcf9c139da6c21fa9516a1f57b586507a0d53", "title": "Query Optimizer as a Service"}, {"paperId": "3330cf365150d11afbaf0c0011157208948dab7f", "title": "Pipemizer: An Optimizer for Analytics Data Pipelines"}, {"paperId": "b362eae4b08e36a01e03ab2b7a51870ebf6d3a97", "title": "Machine Learning for Cloud Data Systems: the Promise, the Progress, and the Path Forward"}]}
