{"paperId": "73a509db2f00416fde92ec7c94ded3cafd8fd7a3", "publicationVenue": {"id": "298dfa38-1ee5-4cfc-bbf3-0ca3b1f2b389", "name": "Cytometry Part A", "type": "journal", "alternate_names": ["Cytom Part A"], "issn": "1552-4922", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/33945", "alternate_urls": ["http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1552-4930", "https://onlinelibrary.wiley.com/journal/15524930"]}, "title": "In situ imaging for tumor microbiome interactions via imaging mass cytometry on single‐cell level", "abstract": "Co‐detection of multiplex cancer subtypes and bacteria subtypes in situ is crucial for understanding tumor microbiome interactions in tumor microenvironment. Current standard techniques such as immunohistochemical staining and immunofluorescence staining are limited for their multiplicity. Simultaneously visualizing detailed cell subtypes and bacteria distribution across the same pathological section remains a major technical challenge. Herein, we developed a rapid semi‐quantitative method for in situ imaging of bacteria and multiplex cell phenotypes on the same solid tumor tissue sections. We designed a panel of antibody probes labeled with mass tags, namely prokaryotic and eukaryotic cell hybrid probes for in situ imaging (PEHPSI). For application demonstration, PEHPSI stained two bacteria subtypes (lipopolysaccharides (LPS) for Gram‐negative bacteria and lipoteichoic acid (LTA) for Gram‐positive bacteria) simultaneously with four types of immune cells (leukocytes, CD8 + T‐cells, B‐cells and macrophages) and four breast cancer subtypes (classified by a panel of 12 human proteins) on the same tissue section. We unveiled that breast cancer cells are commonly enriched with Gram‐negative bacteria and almost absent of Gram‐positive bacteria, regardless of the cancer subtypes (triple‐negative breast cancer [TNBC], HER2+, Luminal A and Luminal B). Further analysis revealed that on the single‐cell level, Gram‐negative bacteria have a significant correlation with CD8 + T‐cells only in HER2+ breast cancer, while PKCD, ER, PR and Ki67 are correlated with Gram‐negative bacteria in the other three subtypes of breast cancers. On the cell population level, in TNBC, CD19 expression intensity is up‐regulated by approximately 25% in bacteria‐enriched cells, while for HER2+, Luminal A and Luminal B breast cancers, the intensity of biomarkers associated with the malignancy, metastasis and proliferation of cancer cells (PKCD, ISG15 and IFI6) is down‐regulated by 29%–38%. The flexible and expandable PEHPSI system permits intuitive multiplex co‐visualization of bacteria and mammalian cells, which facilitates future research on tumor microbiome and tumor pathogenesis.", "venue": "Cytometry Part A", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-03-17", "journal": {"name": "Cytometry Part A", "pages": "617 - 629", "volume": "101"}, "authors": [{"authorId": "2149060217", "name": "Zijian Feng"}, {"authorId": "11979804", "name": "Yu-lian Hu"}, {"authorId": "2153688175", "name": "Xin Wang"}, {"authorId": "2110418707", "name": "Yiyang Li"}, {"authorId": "2111510307", "name": "Youyi Yu"}, {"authorId": "2143775262", "name": "Jie He"}, {"authorId": "2108579008", "name": "Hongxia Li"}, {"authorId": "2146320381", "name": "Ting Zhang"}, {"authorId": "2156145988", "name": "Lulu Zhang"}, {"authorId": "5785458", "name": "Guangxia Shen"}, {"authorId": "37776697", "name": "Xianting Ding"}], "citations": [{"paperId": "b8423a3527c1eca55d72cddd0a735a0fdd1615e6", "title": "SpiDe-Sr: blind super-resolution network for precise cell segmentation and clustering in spatial proteomics imaging"}, {"paperId": "e458b1aafc4a9dbaff3e22ae4c98a3ca11a15719", "title": "Environmental insults and compensative responses: when microbiome meets cancer"}, {"paperId": "f663eb30a5552875deb367c3959da13e562ccdf8", "title": "Single-cell high-dimensional imaging mass cytometry: one step beyond in oncology"}, {"paperId": "6eab148bfae469b9ea682249f55e4f8188c8acbb", "title": "Microbiome as an immune regulator in health, disease, and therapeutics."}]}
