{"paperId": "73b222c2808a95878c8a3aa762b9ba1d4dd9ecd4", "publicationVenue": null, "title": "Parameter-Efficient Legal Domain Adaptation", "abstract": "Seeking legal advice is often expensive. Recent advancements in machine learning for solving complex problems can be leveraged to help make legal services more accessible to the public. However, real-life applications encounter significant challenges. State-of-the-art language models are growing increasingly large, making parameter-efficient learning increasingly important. Unfortunately, parameter-efficient methods perform poorly with small amounts of data, which are common in the legal domain (where data labelling costs are high). To address these challenges, we propose parameter-efficient legal domain adaptation, which uses vast unsupervised legal data from public legal forums to perform legal pre-training. This method exceeds or matches the fewshot performance of existing models such as LEGAL-BERT on various legal tasks while tuning only approximately 0.1% of model parameters. Additionally, we show that our method can achieve calibration comparable to existing methods across several tasks. To the best of our knowledge, this work is among the first to explore parameter-efficient methods of tuning language models in the legal domain.", "venue": "NLLP", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-10-25", "journal": {"pages": "119-129"}, "authors": [{"authorId": "2124950910", "name": "Jonathan Li"}, {"authorId": "2008160154", "name": "R. Bhambhoria"}, {"authorId": "150345740", "name": "Xiaodan Zhu"}], "citations": [{"paperId": "ec23c1a8e326bd55cc3d6bfcb9388d40a442ac5c", "title": "Walking a Tightrope – Evaluating Large Language Models in High-Risk Domains"}, {"paperId": "8f49bd5a69d64d0547a9e8c59cb7f91fcb5ed3ab", "title": "DecipherPref: Analyzing Influential Factors in Human Preference Judgments via GPT-4"}, {"paperId": "ba0483bd564370d98edd615b62336ebd08750f13", "title": "Zero-shot Topical Text Classification with LLMs - an Experimental Study"}]}
