{"paperId": "73b655f46d87076877649ba85a3eb4b9d16ca951", "publicationVenue": null, "title": "Feature Selection in Big Data using Filter Based Techniques", "abstract": "Today organizations are capturing and processing a very large amount of data that is informative which is further continuing to increase in an exponential manner. The analysis of data of this size to make a decision in decision making system often goes inaccurate and it computationally overburdens the system. The Hadoop is a working model which is based on a framework known as the Map-Reduce which efficiently process big data and reduce computation complexity. The methods of feature selection primarily aim at the elimination of irrelevant, redundant and noisy features that could otherwise bring down the performance of classification. But most of the traditional methods lack the level of scalability that is needed to cope with the various instances and bring about some successful results within a limited time. The work brings about feature selection that is based on the Minimal Redundancy Maximal Relevance (MRMR) along with the Information Gain (IG) which makes use of the paradigm known as the MapReduce for obtaining the feature subsets from all big datasets. The methods of feature selection were evaluated by making use of the classifiers such as the Naïve Bayes and the K-Nearest Neighbour (KNN). The results of the research show that this proposed method has achieved a good demonstration compared to the other methods.", "venue": "2019 4th MEC International Conference on Big Data and Smart City (ICBDSC)", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": null, "journal": {"name": "2019 4th MEC International Conference on Big Data and Smart City (ICBDSC)", "pages": "1-7"}, "authors": [{"authorId": "73768897", "name": "Sumitra Srinivas K"}, {"authorId": "73768301", "name": "Gangadhara Rao Kancharla"}], "citations": [{"paperId": "39575795e912abd4a9ea1ac666c31cf381211675", "title": "Feature Selection on K-Nearest Neighbor Algorithm Using Similarity Measure"}, {"paperId": "9ee1f6d74a665d8b29ed010a367b8ec270531ad2", "title": "Big Data Analytics in Cyber Security: Network Traffic and Attacks"}]}
