{"paperId": "73e18818523039960be4f56571af5b8534d6f239", "publicationVenue": {"id": "9181819e-530e-4408-9917-93c5f58d7fce", "name": "International Congress on Information and Communication Technology", "type": "conference", "alternate_names": ["Int Conf Inf Comput Technol", "International Conference on Inventive Computation Technologies", "ICICT", "Int Congr Inf Commun Technol", "Int Conf Inven Comput Technol", "International Conference on Issues and Challenges in Intelligent Computing Techniques", "International Conference on Information and Computer Technologies", "Int Conf Issue Chall Intell Comput Tech"]}, "title": "Review of Machine Learning Algorithms for Health-care Management Medical Big Data Systems", "abstract": "Review of machine learning algorithms for health-care management medical big data systems is conducted in this research. Intelligent diagnosis originated from the introduction of mathematical models as a computer-assisted diagnostic tool in clinical science. Later, various expert systems have gradually appeared. There are many methods for classification in machine learning, including the support vector machine, decision tree algorithm, logical regression, integration method and so on. Among them, support vector machine is the most widely used, it has strong robustness and can then the model nonlinear decision boundary, and there are many optional kernel functions. We review from the 2 major aspects. (1) The input dataset consists of examples, each of which is an input data without an explicit output value. The most studied and widely used method in unsupervised learning tasks is clustering. (2) Semi-supervised learning is to add unlabeled data to the supervised classification algorithm to achieve semi-supervised classification. It is between supervised and unsupervised learning. It belongs to a learning method combining the two. The proposed review will have the efficient support for the further analysis.", "venue": "International Congress on Information and Communication Technology", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference", "Review"], "publicationDate": "2020-02-01", "journal": {"name": "2020 International Conference on Inventive Computation Technologies (ICICT)", "pages": "651-654"}, "authors": [{"authorId": "2057446562", "name": "Zou Xiang"}, {"authorId": "2286367508", "name": "Jinghua Cao"}, {"authorId": "2112529042", "name": "Wen Tao"}], "citations": []}
