{"paperId": "73e2125d2ad73225cffabd85cbb03cb0db860ea2", "publicationVenue": {"id": "88cc76ce-f486-46c4-bfa1-a31809d402d7", "name": "International Conference on Big Data and Smart Computing", "type": "conference", "alternate_names": ["BIGCOMP", "BigComp", "Int Conf Big Data Smart Comput"]}, "title": "Importance of Data Distribution on Hive-Based Systems for Query Performance: An Experimental Study", "abstract": "SQL-on-Hadoop systems have been gaining popularity in recent years. One popular example of SQL-on-Hadoop systems is Apache Hive; the pioneer of SQL-on-Hadoop systems. Hive is located on the top of big data stack as an application layer. Besides the application layer, the Hadoop Ecosystem is composed of 3 different main layers: storage, the resource manager and processing engine. The demand from industry has led to the development of new efficient components for each layer. As the ecosystem evolves over time, Hive employed different execution engines too. Understanding the strengths of components is very important in order to exploit the full performance of the Hadoop Ecosystem. Therefore, recent works in the literature study the importance of each layer separately. To the best of our knowledge, the present work is the first work that focuses on the performance of the combination of both the storage layer and the execution engine. In this work, we compare the Hive's query performance by using three different execution engines: MR, Tez and Spark on the skewed/well-balanced data distribution through the full TPC-H benchmark. Our results show the importance of data distribution on the storage layer for overall job performance of SQL-on-Hadoop systems and empirically showed even distribution improves performance up to 48% compared to skewed distribution. Moreover, the present study provides insightful findings by identifying particular SQL query cases that the certain processing engine deals exceptionally well.", "venue": "International Conference on Big Data and Smart Computing", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-02-01", "journal": {"name": "2020 IEEE International Conference on Big Data and Smart Computing (BigComp)", "pages": "370-376"}, "authors": [{"authorId": "40930805", "name": "Hilmi Egemen Ciritoglu"}, {"authorId": "152381427", "name": "John Murphy"}, {"authorId": "27629294", "name": "Christina Thorpe"}], "citations": [{"paperId": "56999a1418f52bd66d52f052320340efc586d6c5", "title": "Multi-Relational Data Characterization by Tensors: Perturbation Analysis"}, {"paperId": "5d3006f11ba06d927c373924d8af59eac629428b", "title": "Using compression tables to improve HiveQL Performance with Spark A Case study on NVMe Storage Devices"}, {"paperId": "03c5f3a6d1d50da7bfc0f50be0f80e8b582f47e2", "title": "Aadhaar Data Analysis Comparison in MapReduce, Hive and Spark"}]}
