{"paperId": "73e60d50639e607692c4a0c90d2a5d7c9b1c468e", "publicationVenue": {"id": "5c9bdf4b-339c-4d97-b0a9-47c6be5b661d", "name": "International ACM Conference on Management of Emergent Digital EcoSystems", "type": "conference", "alternate_names": ["Int ACM Conf Manag Emergent Digit Ecosyst", "Management of Emergent Digital EcoSystems", "MEDES", "Manag Emergent Digit Ecosyst"]}, "title": "Matching disparate dimensions for analytical integration of heterogeneous data sources", "abstract": "The paper presents the first steps towards an authorial integration methodology for heterogeneous data. Exposing information from multiple heterogeneous data sources demands a global (mediated) schema. We need a model to couple with the mismatches between schemata of different sources and to provide uniform access to the data. The virtual global schema is apparently more convenient for assembling big data sources because of useless time consumption during the processes of materialization and synchronization. Thus, an integral analytical model has been proposed as the global schema of heterogeneous data sources. The suggested model provides virtual integration of complex and diverse information for further analytical processing. It combines the original multidimensional design and lattice structure according to the formal conceptual analysis. The main goal of the paper is to suggest an approach to automatic mapping between the schemata of the disparate data sources and virtual integral analytical model with human moderation.", "venue": "International ACM Conference on Management of Emergent Digital EcoSystems", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2019-11-12", "journal": {"name": "Proceedings of the 11th International Conference on Management of Digital EcoSystems"}, "authors": [{"authorId": "2860043", "name": "A. Korobko"}, {"authorId": "51443291", "name": "A. Korobko"}], "citations": [{"paperId": "d21e308dcb0ffb291561c913547d7143616dc3e9", "title": "Exploring the Properties of the Context and Lattice of the Integral Analytical Model *"}]}
