{"paperId": "73e77bebd95c7259efdd9c3bfbc26936cbbff0bf", "publicationVenue": {"id": "ffe5bb5c-04ed-488e-985d-d3a7b39542cf", "name": "IEEE International Conference on Distributed Computing Systems", "type": "conference", "alternate_names": ["International Conference on Distributed Computing Systems", "IEEE Int Conf Distrib Comput Syst", "Int Conf Device Circuit Syst", "ICDCS", "Int Conf Distrib Comput Syst", "International Conference on Devices, Circuits and Systems"], "url": "https://ieeexplore.ieee.org/xpl/conhome/1000213/all-proceedings"}, "title": "Accelerating Apache Hive with MPI for Data Warehouse Systems", "abstract": "Data warehouse systems, like Apache Hive, have been widely used in the distributed computing field. However, current generation data warehouse systems have not fully embraced High Performance Computing (HPC) technologies even though the trend of converging Big Data and HPC is emerging. For example, in traditional HPC field, Message Passing Interface (MPI) libraries have been optimized for HPC applications during last decades to deliver ultra-high data movement performance. Recent studies, like DataMPI, are extending MPI for Big Data applications to bridge these two fields. This trend motivates us to explore whether MPI can benefit data warehouse systems, such as Apache Hive. In this paper, we propose a novel design to accelerate Apache Hive by utilizing DataMPI. We further optimize the DataMPI engine by introducing enhanced non-blocking communication and parallelism mechanisms for typical Hive workloads based on their communication characteristics. Our design can fully and transparently support Hive workloads like Intel HiBench and TPC-H with high productivity. Performance evaluation with Intel HiBench shows that with the help of light-weight DataMPI library design, efficient job start up and data movement mechanisms, Hive on DataMPI performs 30% faster than Hive on Hadoop averagely. And the experiments on TPC-H with ORCFile show that the performance of Hive on DataMPI can improve 32% averagely and 53% at most more than that of Hive on Hadoop. To the best of our knowledge, Hive on DataMPI is the first attempt to propose a general design for fully supporting and accelerating data warehouse systems with MPI.", "venue": "IEEE International Conference on Distributed Computing Systems", "year": 2015, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2015-06-01", "journal": {"name": "2015 IEEE 35th International Conference on Distributed Computing Systems", "pages": "664-673"}, "authors": [{"authorId": "2056015437", "name": "Lu Chao"}, {"authorId": "2890125", "name": "Chundian Li"}, {"authorId": "2053834824", "name": "Fan Liang"}, {"authorId": "1720335", "name": "Xiaoyi Lu"}, {"authorId": "1719934", "name": "Zhiwei Xu"}], "citations": [{"paperId": "549dbfb7b89dfba168d8cb18dc41658ecc512af5", "title": "BAASH: Lightweight, Efficient, and Reliable Blockchain-As-A-Service for HPC Systems"}, {"paperId": "ae051b24d8cea3220dcc813837b93a03be1e6f34", "title": "ROLAP DW transformation proposal for OLAP architecture in NoSQL database"}, {"paperId": "a6f938ef2e02c81c6ab9d71d3e4f2c1cb1d66f04", "title": "Tight Bound of Parallel Request Latency for Erasure-Coded Distributed Storage System"}, {"paperId": "7c7f3b7789002fb2bd9a086dbbb44f179b18eabb", "title": "BAASH: Enabling Blockchain-as-a-Service on High-Performance Computing Systems"}, {"paperId": "7905be4192f686bb5164695a5a77ecefae24cbce", "title": "Achieving Load Balance for Parallel Data Access on Distributed File Systems"}, {"paperId": "3e3b52432c030b1b27e3a9f2ccc4a568a2cca2c0", "title": "A Hybrid Transaction Processing and Data Analysis Framework: A Use Case Study for Multi-Source Healthcare Data Management"}, {"paperId": "7f38d8791e9a22a272975f727ed93195ae661ae0", "title": "High-performance computing environment: a review of twenty years of experiments in China"}, {"paperId": "3d1a3dcd0b0edcb55995eb1e3879fa5e476afffd", "title": "Special Topic : High Performance Computing High-performance computing environment : a review of twenty years of experiments in China"}]}
