{"paperId": "73f305039a9ed5c067ea1d3f25e56833baa5577d", "publicationVenue": {"id": "e2742a49-1b55-4a31-b319-7455fa5e12d4", "name": "IEEE Transactions on Services Computing", "type": "journal", "alternate_names": ["IEEE Trans Serv Comput"], "issn": "1939-1374", "url": "http://www.computer.org/tsc", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=4629386"]}, "title": "An Availability Analysis Approach for Deployment Configurations of Containers", "abstract": "Operating system (OS) containers enabling the microservice-oriented architecture are becoming popular in the context of Cloud services. Containers provide the ability to create lightweight and portable runtime environments that decouple the application requirements from the characteristics of the underlying system. Services built on containers have a small resource footprint in terms of processing, storage, memory and network, allowing a more dense deployment environment. While the performance of such containers is addressed in few previous studies, understanding the failure-repair behavior of the containers remains unexplored. In this paper, from an availability point of view, we propose and compare different configuration models for deploying a containerized software system. Inspired by Google Kubernetes, a container management system, these configurations are characterized with a failure response and migration service. We develop novel non-state-space (i.e., fault tree) and state-space (i.e., stochastic reward net) analytic models for container availability analysis. Analytical as well as simulative solutions are obtained for the developed models. Our analysis provides insights on k out-of N availability and sensitivity of system availability for key system parameters. Finally, we build an open-source software tool powered by these models. The tool helps a Cloud administrator to assess the availability of a containerized system and to conduct a what-if analysis based on user-provided parameters and configurations.", "venue": "IEEE Transactions on Services Computing", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-01-01", "journal": {"name": "IEEE Transactions on Services Computing", "pages": "16-29", "volume": "14"}, "authors": [{"authorId": "2291658", "name": "Stefano Sebastio"}, {"authorId": "145634631", "name": "R. Ghosh"}, {"authorId": "2057462055", "name": "Tridib Mukherjee"}], "citations": [{"paperId": "b0a3f2b10567dd909d298bc2864130664e886c46", "title": "A Reliability and Availability Model of a Kubernetes Cluster Using SysML"}, {"paperId": "f25225e17eefe56c143cf1e40955c5676cb29d54", "title": "Multi-Provider IMS Infrastructure With Controlled Redundancy: A Performability Evaluation"}, {"paperId": "29cfe2e140ac6bd11c254b74ae99864493a652bc", "title": "A REST-Based Framework for Performability Management of Service Function Chains"}, {"paperId": "a671217b5d2c892b85a96db3e2ca02d38a10499f", "title": "Understanding Container-based Services under Software Aging: Dependability and Performance Views"}, {"paperId": "69ac9eaa20a97c0245ddeb1385f9a1380f5567d9", "title": "Model-Driven Dependability Assessment of Microservice Chains in MEC-Enabled IoT"}, {"paperId": "7edaa7225128ff632f285d2d400631fa3cb68ff9", "title": "A Mutation-Enabled Proactive Defense Against Service-Oriented Man-in-The-Middle Attack in Kubernetes"}, {"paperId": "58c611ab8d21645e0a56414fa9ddd1b4ca08fd3a", "title": "Rule-Based Modelling Approach for Network Application Availability Assessment Under Dynamic Network Restoration Scheme"}, {"paperId": "cf8ed8e05522c87de017e52d669fda504b003a03", "title": "Performability Assessment of Containerized Multi-Tenant IMS through Multidimensional UGF"}, {"paperId": "87801ca80d05abf6c1c91e8d3a4bd55be1ab79b3", "title": "A Latency-Driven Availability Assessment for Multi-Tenant Service Chains"}, {"paperId": "297486ee3ad3a3d72c57235d428ce45626a7b6c4", "title": "Comparison of Placement Variants of Virtual Network Functions From Availability and Reliability Perspective"}, {"paperId": "bd43ba8d9ae643b64d0d26c7788c10694733fb66", "title": "Challenges and Solution Directions of Microservice Architectures: A Systematic Literature Review"}, {"paperId": "e4b1c0224a1cc687b65a68d9a94a57f568ab9fdb", "title": "Performability Analysis of Containerized IMS through Queueing Networks and Stochastic Models"}, {"paperId": "c2e20a65fa338212eebfe21d19a30d31b469210b", "title": "Performance and availability evaluation of the blockchain platform hyperledger fabric"}, {"paperId": "c6118497a70e07918d78e0ff8c71e42ab8c81727", "title": "Modeling and evaluation of dispatching policies in IaaS cloud data centers using SANs"}, {"paperId": "73ced72e3175c2e0e974d962a4140f003254ee14", "title": "Resilience-Driven Quantitative Analysis of Vehicle Platooning Service"}, {"paperId": "4372161a78a3c11e18719dba67835c56984e1554", "title": "A model-based approach for planning blockchain service provisioning"}, {"paperId": "86e2c860d2e93759f05a3a1597921d49e3ee1493", "title": "Performability of Network Service Chains: Stochastic Modeling and Assessment of Softwarized IP Multimedia Subsystem"}, {"paperId": "00c9afbdabb61de763a9a5ec29a8dbaa4d879cd6", "title": "Comparative Performability Assessment of SFCs: The Case of Containerized IP Multimedia Subsystem"}, {"paperId": "1e5ad93a0ba365583309c101442029323c2c3cd9", "title": "Distributed application provisioning over Ethereum-based private and permissioned blockchain: availability modeling, capacity, and costs planning"}, {"paperId": "12739fec6c4f7909052c1d5a7428e688e3994b68", "title": "Automated Generation of Availability Models for SFCs: The case of Virtualized IP Multimedia Subsystem"}, {"paperId": "efdd7ca4a206554230de5f885f99e4224dee8ced", "title": "Performability Management of Softwarized IP Multimedia Subsystem"}, {"paperId": "02ed8a33bf8870299125329dbb6e9e7dcb248adb", "title": "An Attribute-Based Availability Model for Large Scale IaaS Clouds with CARMA"}, {"paperId": "3a2596b0d88814a03cfa59bb86ec25c8f7e8c21f", "title": "On the Resilience of the NFV-MANO: An Availability Model of a Cloud-native Architecture"}, {"paperId": "07eda67c65fec050ed833adeaa9e9a5d21e858f5", "title": "Availability Analysis of IP Multimedia Subsystem in Cloud Environments"}, {"paperId": "8f8854cc4336f30360252c33fa76c24625714750", "title": "Blockchain provisioning over private cloud computing environments: Availability modeling and cost requirements"}, {"paperId": "d0cea67a5a111340fe419c24b5234d9521ec4777", "title": "IP Multimedia Subsystem in a containerized environment: availability and sensitivity evaluation"}, {"paperId": "5b192215895e851e2647786755aae9b5a495be74", "title": "Optimized Availability-Aware Component Scheduler for Applications in Container-Based Cloud"}, {"paperId": "1a86d0d0aa6946b2d711bbcfa7f9b8e607b07c7b", "title": "Availability Evaluation of Multi-Tenant Service Function Chaining Infrastructures by Multidimensional Universal Generating Function"}, {"paperId": "650b9295f46e21935c2bb8945e45e20e4f619cc0", "title": "A configuration method of computing resources for microservice-based edge computing apparatus in smart distribution transformer area"}, {"paperId": "65fcd189ca719adc9ace37c7f2df9cf692099ea1", "title": "An Architecture for Intelligent e-Learning Platform for Student’s Lab Deployment"}, {"paperId": "aaf4304bc3d1857ddbf08aeb8e7b87a7d3dfa90b", "title": "Optimistic scheduling with service guarantees"}]}
