{"paperId": "73f4d0ba49d1d5bbc359c464fa7020090b444631", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Adaptive Resonance Theory-based Topological Clustering with a Divisive Hierarchical Structure Capable of Continual Learning", "abstract": "Adaptive Resonance Theory (ART) is considered as an effective approach for realizing continual learning thanks to its ability to handle the plasticity-stability dilemma. In general, however, the clustering performance of ART-based algorithms strongly depends on the specification of a similarity threshold, i.e., a vigilance parameter, which is data-dependent and specified by hand. This paper proposes an ART-based topological clustering algorithm with a mechanism that automatically estimates a similarity threshold from the distribution of data points. In addition, for improving information extraction performance, a divisive hierarchical clustering algorithm capable of continual learning is proposed by introducing a hierarchical structure to the proposed algorithm. Experimental results demonstrate that the proposed algorithm has high clustering performance comparable with recently-proposed state-of-the-art hierarchical clustering algorithms.", "venue": "IEEE Access", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-01-26", "journal": {"name": "IEEE Access", "pages": "1-1", "volume": "PP"}, "authors": [{"authorId": "2415102", "name": "Naoki Masuyama"}, {"authorId": "2065641570", "name": "Narito Amako"}, {"authorId": "2000930850", "name": "Yuna Yamada"}, {"authorId": "34654033", "name": "Y. Nojima"}, {"authorId": "10022373", "name": "H. Ishibuchi"}], "citations": [{"paperId": "103bc9b45348a9f55d70357685b32879e411301a", "title": "Privacy-preserving Continual Federated Clustering via Adaptive Resonance Theory"}, {"paperId": "563e8e39934f950f494178080c1a9a1529f36c89", "title": "SSFuzzyART: A Semi-Supervised Fuzzy ART through seeding initialization and a clustered data generation algorithm to deeply study clustering solutions"}, {"paperId": "e5f6db4b81c7226e2d3ddc4c08f56e05fd011509", "title": "Adaptive Resonance Theory-Based Topological Clustering with Node Deletion Mechanism for Evolving Stream Data"}, {"paperId": "b841f764f03ecdcf77cfe0ba1b4dc1bfcf4befc8", "title": "A One-Shot Learning Method for Human Activity Recognition Using Extracted Essential Poses from Push-Fixed Adaptive Resonance Theory"}, {"paperId": "8b2adac2a14d776c0d254bbe7b16de3fc826dea2", "title": "A Parameter-free Adaptive Resonance Theory-based Topological Clustering Algorithm Capable of Continual Learning"}, {"paperId": "3ac62279720fac75dda7a5efba0e2b6f716b9bbe", "title": "Adaptive Resonance Theory-based Clustering for Handling Mixed Data"}, {"paperId": "ac1740a21e4222cd13a422511220f993361c13b5", "title": "Reference Vector Adaptation and Mating Selection Strategy via Adaptive Resonance Theory-Based Clustering for Many-Objective Optimization"}, {"paperId": "ac10abc48461a3b242d880f8d0007a233cc19d23", "title": "Class-wise Classifier Design Capable of Continual Learning using Adaptive Resonance Theory-based Topological Clustering"}]}
