{"paperId": "7411139f57f9825372647eac71c997338c4b3075", "publicationVenue": {"id": "93be7524-e38d-4d5a-b7f1-bb2b08b85275", "name": "Data Science Journal", "type": "journal", "alternate_names": ["Data Sci J"], "issn": "1683-1470", "url": "http://www.jds-online.com/", "alternate_urls": ["https://datascience.codata.org/", "http://www.codata.org/dsj/", "http://www.datasciencejournal.org/"]}, "title": "Understanding Perspectives on Sharing Neutron Data at Oak Ridge National Laboratory", "abstract": "Even though the importance of sharing data is frequently discussed, data sharing appears to be limited to a few fields, and practices within those fields are not well understood. This study examines perspectives on sharing neutron data collected at Oak Ridge National Laboratory’s neutron sources. Operation at user facilities has traditionally focused on making data accessible to those who create them. The recent emphasis on open data is shifting the focus to ensure that the data produced are reusable by others. This mixed methods research study included a series of surveys and focus group interviews in which 13 data consumers, data managers, and data producers answered questions about their perspectives on sharing neutron data. Data consumers reported interest in reusing neutron data for comparison/verification of results against their own measurements and testing new theories using existing data. They also stressed the importance of establishing context for data, including how data are produced, how samples are prepared, units of measurement, and how temperatures are determined. Data managers expressed reservations about reusing others’ data because they were not always sure if they could trust whether the people responsible for interpreting data did so correctly. Data producers described concerns about their data being misused, competing with other users, and over-reliance on data producers to understand data. We present the Consumers Managers Producers (CMP) Model for understanding the interplay of each group regarding data sharing. We conclude with policy and system recommendations and discuss directions for future research.", "venue": "Data Science Journal", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2017-06-29", "journal": {"name": "Data Sci. J.", "pages": "35", "volume": "16"}, "authors": [{"authorId": "2943474", "name": "D. R. Donaldson"}, {"authorId": "144879204", "name": "Shawn Martin"}, {"authorId": "91139958", "name": "T. Proffen"}], "citations": [{"paperId": "16885021fa746c199f55c84ce412d0125a78e083", "title": "Data managers' perspectives on OAIS designated communities and the FAIR principles: mediation, tools and conceptual models"}, {"paperId": "64ae08eb36db1431649febba7d5c295814556be9", "title": "Driving Scientific and Engineering Discoveries Through the Convergence of HPC, Big Data and AI: 17th Smoky Mountains Computational Sciences and Engineering Conference, SMC 2020, Oak Ridge, TN, USA, August 26-28, 2020, Revised Selected Papers"}, {"paperId": "bfba454df233911894039207f67b6e102abbe736", "title": "Performance Improvements on SNS and HFIR Instrument Data Reduction Workflows Using Mantid"}]}
