{"paperId": "74378bf5ad32ff247188b1844b1a166034f09518", "publicationVenue": null, "title": "1 Section 1 : Modeling and Understanding the Spread of COVID-19 REACT : Real-Time Contact Tracing and Risk Monitoring using", "abstract": "Contact tracing is an essential public health tool for controlling epidemic disease outbreaks such as the COVID-19 pandemic. Digital contact tracing using real-time locations or proximity of individuals can be used to significantly speed up and scale up contact tracing. In this article, we present our project, REACT, for REAal-time Contact Tracing and risk monitoring via privacyenhanced tracking of users’ locations and symptoms. With privacy enhancement that allows users to control and refine the precision with which their information will be collected and used, REACT will enable: 1) contact tracing of individuals who are exposed to infected cases and identification of hot-spot locations, 2) individual risk monitoring based on the locations they visit and their contact with others; and 3) community risk monitoring and detection of early signals of community spread. We will briefly describe our ongoing work and the approaches we are taking as well as some challenges we encountered in deploying the app.", "venue": "", "year": 2020, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "2003642221", "name": "T. Anderson"}, {"authorId": "2003878054", "name": "Yanan Da"}, {"authorId": "1939822", "name": "Ritesh Ahuja"}, {"authorId": "2803640", "name": "V. Hertzberg"}, {"authorId": "2502991", "name": "L. Waller"}, {"authorId": "2144810197", "name": "Xiaoqian Jiang"}, {"authorId": "40457924", "name": "A. Franklin"}, {"authorId": "1756679", "name": "M. Mokbel"}, {"authorId": "3009678", "name": "Sofiane Abbar"}, {"authorId": "34186100", "name": "James Rineer"}, {"authorId": "145498079", "name": "Sarah K. Rhea"}, {"authorId": "1688423", "name": "Joon-Seok Kim"}, {"authorId": "2076358592", "name": "H. Kavak"}, {"authorId": "3221975", "name": "Andreas Züfle"}], "citations": []}
