{"paperId": "744fa6f836e39626889219a42174da09c8ae93ec", "publicationVenue": {"id": "d5b215f3-f737-45b2-875b-df309ce14c43", "name": "Scientific Programming", "type": "journal", "alternate_names": ["Sci Program"], "issn": "1058-9244", "url": "https://www.hindawi.com/journals/sp/", "alternate_urls": ["https://www.iospress.nl/html/10589244.php", "https://www.wiley.com/legacy/compbooks/compjournals/sciprog.html", "http://content.iospress.com/journals/scientific-programming"]}, "title": "Grade Prediction in Blended Learning Using Multisource Data", "abstract": "Today, blended learning is widely carried out in many colleges. Different online learning platforms have accumulated a large number of fine granularity records of students’ learning behavior, which provides us with an excellent opportunity to analyze students’ learning behavior. In this paper, based on the behavior log data in four consecutive years of blended learning in a college’s programming course, we propose a novel multiclassification frame to predict students’ learning outcomes. First, the data obtained from diverse platforms, i.e., MOOC, Cnblogs, Programming Teaching Assistant (PTA) system, and Rain Classroom, are integrated and preprocessed. Second, a novel error-correcting output codes (ECOC) multiclassification framework, based on genetic algorithm (GA) and ternary bitwise calculator, is designed to effectively predict the grade levels of students by optimizing the code-matrix, feature subset, and binary classifiers of ECOC. Experimental results show that the proposed algorithm in this paper significantly outperforms other alternatives in predicting students’ grades. In addition, the performance of the algorithm can be further improved by adding the grades of prerequisite courses.", "venue": "Scientific Programming", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-09-11", "journal": {"name": "Sci. Program.", "pages": "4513610:1-4513610:15", "volume": "2021"}, "authors": [{"authorId": "2145141867", "name": "Ling Chen"}, {"authorId": "2157943856", "name": "Mei-ting Wu"}, {"authorId": "9355727", "name": "Li-fang Pan"}, {"authorId": "2147253953", "name": "Ru-bin Zheng"}], "citations": [{"paperId": "b482b5b53a17cb49a63eb4bebae6f0ba3ed1a2a8", "title": "Evaluation of student failure in higher education by an innovative strategy of fuzzy system combined optimization algorithms and AI"}, {"paperId": "c1720b2bfe323a1021c9c38137e6f45ba50557b1", "title": "Analysis of factors affecting the effectiveness of face-to-face marketing learning via TikTok, YouTube and video conferencing"}, {"paperId": "86627e4e6f58c6bf29dabfe8770f3e35936f489f", "title": "ARCS approach to PTA-based programming language practice sessions: Factors influencing Programming Problem-Solving Skills"}, {"paperId": "42da38b88419e6021e39ecee34d280f22c882401", "title": "A Grade Prediction Method Based on Long Short-Term Memory Network in Smart Campus"}, {"paperId": "3d9298e8b74d065ae24d25a43e8f4890d158c571", "title": "Early Prediction of Students’ Final Grades in a Gamified Course"}, {"paperId": "67bf37bf0435924f400b4157fc1353c40e1826c7", "title": "Using Ensemble Learning Algorithms to Predict Student Failure and Enabling Customized Educational Paths"}]}
