{"paperId": "7453876679fc000b00446b93c9d9222fa6508bbb", "publicationVenue": {"id": "3da56ce6-4a70-402c-a8b0-7dd39a3273d3", "name": "Software, Practice & Experience", "type": "journal", "alternate_names": ["Softw  Pract Exp", "Softw Pract  Exp", "Software - Practice and Experience"], "issn": "0038-0644", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/1752", "alternate_urls": ["http://www.interscience.wiley.com/jpages/0038-0644/", "https://onlinelibrary.wiley.com/journal/1097024X"]}, "title": "Journey from cloud of things to fog of things: Survey, new trends, and research directions", "abstract": "With the advent of the Internet of Things (IoT) paradigm, the cloud model is unable to offer satisfactory services for latency‐sensitive and real‐time applications due to high latency and scalability issues. Hence, an emerging computing paradigm named as fog/edge computing was evolved, to offer services close to the data source and optimize the quality of services (QoS) parameters such as latency, scalability, reliability, energy, privacy, and security of data. This article presents the evolution in the computing paradigm from the client‐server model to edge computing along with their objectives and limitations. A state‐of‐the‐art review of Cloud Computing and Cloud of Things (CoT) is presented that addressed the techniques, constraints, limitations, and research challenges. Further, we have discussed the role and mechanism of fog/edge computing and Fog of Things (FoT), along with necessitating amalgamation with CoT. We reviewed the several architecture, features, applications, and existing research challenges of fog/edge computing. The comprehensive survey of these computing paradigms offers the depth knowledge about the various aspects, trends, motivation, vision, and integrated architectures. In the end, experimental tools and future research directions are discussed with the hope that this study will work as a stepping‐stone in the field of emerging computing paradigms.", "venue": "Software, Practice & Experience", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-10-24", "journal": {"name": "Software: Practice and Experience", "pages": "496 - 551", "volume": "53"}, "authors": [{"authorId": "2188897977", "name": "Ananya Chakraborty"}, {"authorId": "2157797834", "name": "Mohit Kumar"}, {"authorId": "38879355", "name": "N. Chaurasia"}, {"authorId": "31043248", "name": "S. S. Gill"}], "citations": [{"paperId": "a871f9be70f31752338836fe4756031d41b2322d", "title": "Privacy‐preserving task offloading in mobile edge computing: A deep reinforcement learning approach"}, {"paperId": "115efb6260148f95ac6b93438bd18cb4adfdc77d", "title": "Modern Computing: Vision and Challenges"}, {"paperId": "c523373bcf7313e20c5cdeecf6e00255df2bf68c", "title": "Secure framework for IoT applications using Deep Learning in fog Computing"}, {"paperId": "1e924e823b2dd42f2c03087624fe73cf535a5114", "title": "Fault-Tolerant Trust-Based Task Scheduling Algorithm Using Harris Hawks Optimization in Cloud Computing"}, {"paperId": "846e3325a8a436abb2b5a4a59f0a2f41febaa850", "title": "Unboxing fog security: a review of fog security and authentication mechanisms"}, {"paperId": "97b021987790a3c44278d88b0d32896cd2a598d8", "title": "How to secure the IoT-based surveillance systems in an ELEGANT way"}, {"paperId": "9b45f7ac6cab699918d77255de1dc8cf172973c1", "title": "QoS\n ‐aware resource scheduling using whale optimization algorithm for microservice applications"}, {"paperId": "4f241fc917a0a69b1c6e9dc1e475ded419d551d4", "title": "Edge AI: A survey"}, {"paperId": "b4b8286b866a17464a4133c5aa49a3737bdfa2ae", "title": "AI-based Fog and Edge Computing: A Systematic Review, Taxonomy and Future Directions"}, {"paperId": "9586dc185c9d0754d79b60dca13362ee2aaf0ea5", "title": "HunterPlus: AI based energy-efficient task scheduling for cloud-fog computing environments"}, {"paperId": "0b262a0b4952ebc490a743db36a78355ed94a427", "title": "Internet of Things"}, {"paperId": "0697791b674f77ec094d7f56786e078229dc3454", "title": "Efficiency in the serverless cloud paradigm: A survey on the reusing and approximation aspects"}, {"paperId": "ab039a91a941db0e736a0f17f10508dfaaf7df32", "title": "Channel Allocation to GAA Users Using Double Deep Recurrent Q-Learning Based on Double Auction Method"}, {"paperId": "b02364ab877be7f412027c769eb368a8c4c10d35", "title": "Telematics and Informatics Reports"}]}
