{"paperId": "746723804bb6e0df505cbaff7a8f4ae0094515d3", "publicationVenue": null, "title": "Research and Analysis on the Distributed Database of Blockchain and Non- Blockchain", "abstract": "In the Data Technology (DT) era, data have become the most important means of production. With the rapid development of cloud computing, the database technology has become the most basic data technology facility. Especially, the Distributed Databases have been widely used to store and process large-scale data, which are applied in different scenarios than relational databases. In addition, blockchain technology has led to changes in decentralized architecture. The BigchainDB database is based on a distributed database with the features of blockchain. It has not only the advantages of distributed database, such as high throughput, low latency and easy expansion, but also has the characteristics of blockchain, such as decentralized control, tamper-proof and traceability. This paper mainly analyzes the comparison between the BigchainDB and other distributed databases in terms of execution performance. In practice, this paper focuses on the characteristics of BigchainDB, then compares the performance of creating and querying transactions between the BigchainDB and two important distributed databases: HadoopDB and Hive. The experiments in this paper show three things. Firstly, the BigchainDB is obviously better than HadoopDB and Hive in transaction creation. Secondly, the transaction query performance of the BigchainDB is one order higher than them. Thirdly, the BigchainDB is three orders of magnitude higher than them in fuzzy query performance. These results demonstrate that BigchainDB is significantly better than HadoopDB and Hive in both the performance of read and write.", "venue": "2020 IEEE 5th International Conference on Cloud Computing and Big Data Analytics (ICCCBDA)", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2020-04-01", "journal": {"name": "2020 IEEE 5th International Conference on Cloud Computing and Big Data Analytics (ICCCBDA)", "pages": "307-313"}, "authors": [{"authorId": "2115647226", "name": "Yajun Wang"}, {"authorId": "1712218131", "name": "Chao-Hsien Hsieh"}, {"authorId": "1710165938", "name": "Changfeng Li"}], "citations": [{"paperId": "1172c25d71ebe833af2f9d4a2ac773767d4d8942", "title": "Supply chain finance: What are the challenges in the adoption of blockchain technology?"}, {"paperId": "c4ad53d76436bb5e8512394e9365c1e108de046f", "title": "How to improve blockchain for blogosphere?"}, {"paperId": "53ef1640bc20a21448d656cc4386a7a761ab518c", "title": "Creducate: Blockchain-based Academic Record Management and Verification System Built in the Solana Network"}, {"paperId": "51ebffec954fd6b6bde879ee86b6eaa9dfd7bdcd", "title": "IPFS enabled blockchain for smart cities"}, {"paperId": "e58608fb33c5c65f1e849a20d000c4d9bc4d0a4a", "title": "HEALTHCARE BLOCKCHAIN USING BIGCHAINDB"}]}
