{"paperId": "7467503c3284faa1611f526a3498ca8993ba1fae", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Benchmark Time Series Database with IoTDB-Benchmark for IoT Scenarios", "abstract": "With the wide application of time series databases (TSDB) in big data fields like cluster monitoring and industrial IoT, there have been developed a number of TSDBs for time series data management. Different TSDBs have test reports comparing themselves with other databases to show their advantages, but the comparisons are typically based on their own tools without using a common well-recognized test framework. To the best of our knowledge, there is no mature TSDB benchmark either. With the goal of establishing a standard of evaluating TSDB systems, we present the IoTDB-Benchmark framework, specifically designed for TSDB and IoT application scenarios. We pay close attention to some special data ingestion scenarios and summarize 10 basic queries types. We use this benchmark to compare four TSDB systems: InfluxDB, OpenTSDB, KairosDB and TimescaleDB. Our benchmark framework/tool not only measures performance metrics but also takes system resource consumption into consideration.", "venue": "arXiv.org", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-01-24", "journal": {"name": "ArXiv", "volume": "abs/1901.08304"}, "authors": [{"authorId": "144207288", "name": "R. Liu"}, {"authorId": "2110948548", "name": "Jun Yuan"}], "citations": [{"paperId": "886cf8a244e46ff8042e539354c510b7018da271", "title": "MOST: Model-Based Compression with Outlier Storage for Time Series Data"}, {"paperId": "53860f50a4e50f385047c348756b347eb6b195cd", "title": "Performance Impact of Parallel Access of Time Series in the Context of Relational, NoSQL and NewSQL Database Management Systems"}, {"paperId": "75637e4b3d02cd4972f1e1ac2c321b0a5bc93538", "title": "How to Select Time Series Databases for an Insurance Company?"}, {"paperId": "75f7c5050f4b858809627d81ab6d5b71b46bb365", "title": "TSM-Bench: Benchmarking Time Series Database Systems for Monitoring Applications"}, {"paperId": "b8b32591f57191001626b90dc8aeb36e70527a50", "title": "Capacity-Based Trust System in Untrusted MEC Environments"}, {"paperId": "978c29ab9a973de24a25896afbb6a3c7bc0423bf", "title": "A Comparison Of Relational, NoSQL and NewSQL Database Management Systems For The Persistence Of Time Series Data"}, {"paperId": "56092b161fef090c6a0fece7248e13fdb12da941", "title": "Performance Study of Time Series Databases"}, {"paperId": "1ac6b3a3904b6c9022206be7c0b9d180b84b1fb4", "title": "Unicorn: detect runtime errors in time-series databases with hybrid input synthesis"}, {"paperId": "fd7b348e8cc678c38d1e4ec594a08aae81b21439", "title": "SciTS: A Benchmark for Time-Series Databases in Scientific Experiments and Industrial Internet of Things"}, {"paperId": "2b4418e80f49b10b0a9e9073c129c3d17166c644", "title": "TorqueDB: Distributed Querying of Time-Series Data from Edge-local Storage"}, {"paperId": "72773a0d268301579432e66da193a98e314a0c1f", "title": "Industrial Internet of Things: Persistence for Time Series with NoSQL Databases"}, {"paperId": "fc0e27bce9f554b233067e455211ec7c08817ae7", "title": "SciTS: A Benchmark for Time-Series Database in Scientific Experiments and Industrial Internet of Things"}, {"paperId": "dc92b02f11be0a1205214eea3f6c81b86fd7a156", "title": "An Implementation of Blockchain Decentralized Application for Industrial IoT Scenarios"}, {"paperId": "38e7364dcfff6030546c19ed6f7c89524fbaabf5", "title": "Development of an Industry 4.0 Big Data Processing and Management System"}]}
