{"paperId": "7468b9f7207c91fe5df07e57808b1c94d9ffe3ce", "publicationVenue": {"id": "7c9d091e-015e-4e5d-a11f-9bc369fcf414", "name": "IEEE Transactions on Parallel and Distributed Systems", "type": "journal", "alternate_names": ["IEEE Trans Parallel Distrib Syst"], "issn": "1045-9219", "url": "http://www.computer.org/tpds", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=71"]}, "title": "ISEE: An Intelligent Scene Exploration and Evaluation Platform for Large-Scale Visual Surveillance", "abstract": "Intelligent video surveillance (IVS) is always an interesting research topic to utilize visual analysis algorithms for exploring richly structured information from big surveillance data. However, existing IVS systems either struggle to utilize computing resources adequately to improve the efficiency of large-scale video analysis, or present a customized system for specific video analytic functions. It still lacks of a comprehensive computing architecture to enhance efficiency, extensibility and flexibility of IVS system. Moreover, it is also an open problem to study the effect of the combinations of multiple vision modules on the final performance of end applications of IVS system. Motivated by these challenges, we develop an Intelligent Scene Exploration and Evaluation (ISEE) platform based on a heterogeneous CPU-GPU cluster and some distributed computing tools, where Spark Streaming serves as the computing engine for efficient large-scale video processing and Kafka is adopted as a middle-ware message center to decouple different analysis modules flexibly. To validate the efficiency of the ISEE and study the evaluation problem on composable systems, we instantiate the ISEE for an end application on person retrieval with three visual analysis modules, including pedestrian detection with tracking, attribute recognition and re-identification. Extensive experiments are performed on a large-scale surveillance video dataset involving 25 camera scenes, totally 587 hours 720p synchronous videos, where a two-stage question-answering procedure is proposed to measure the performance of execution pipelines composed of multiple visual analysis algorithms based on millions of attribute-based and relationship-based queries. The case study of system-level evaluations may inspire researchers to improve visual analysis algorithms and combining strategies from the view of a scalable and composable system in the future.", "venue": "IEEE Transactions on Parallel and Distributed Systems", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-12-01", "journal": {"name": "IEEE Transactions on Parallel and Distributed Systems", "pages": "2743-2758", "volume": "30"}, "authors": [{"authorId": "2108338270", "name": "Da Li"}, {"authorId": "48805574", "name": "Zhang Zhang"}, {"authorId": "2114076497", "name": "Kai Yu"}, {"authorId": "2887871", "name": "Kaiqi Huang"}, {"authorId": "143874948", "name": "T. Tan"}], "citations": [{"paperId": "7726e8bd28be2c5580d9ce511d16382164fc4a30", "title": "Explaining Autonomous Driving Actions with Visual Question Answering"}, {"paperId": "235041352a7041484846d2cc7670a398ce3a0b3c", "title": "A novel contrast and saturation prior for image dehazing"}, {"paperId": "a675f9e3ee49a1ffaabdca86d2c249ca517d0224", "title": "Development of a CPU-GPU heterogeneous platform based on a nonlinear parallel algorithm"}, {"paperId": "da7570b0e006490201fb50325a296eaa652091ac", "title": "LightAnomalyNet: A Lightweight Framework for Efficient Abnormal Behavior Detection"}, {"paperId": "4ad979854e955a6ed79d7d35901ef92e94d62c77", "title": "An effective motion object detection using adaptive background modeling mechanism in video surveillance system"}, {"paperId": "3fb9e014d52a2082141acefdeaddbd81fd422b24", "title": "Visual Question Answering: which investigated applications?"}, {"paperId": null, "title": "2020 Index IEEE Transactions on Parallel and Distributed Systems Vol. 31"}, {"paperId": "52db3b426bafc56f745147eda0a78764a07e637f", "title": "A Distributed Automatic Video Annotation Platform"}, {"paperId": "7b4f7e31a7f51982235037821bd80a50d904b04c", "title": "Construction of an Intelligent Processing Platform for Equestrian Event Information Based on Data Fusion and Data Mining"}]}
