{"paperId": "74721f23f71a1cb946ce72476e6927a19679ae96", "publicationVenue": {"id": "ccd8e532-73c6-414f-bc91-271bbb2933e2", "name": "Electronics", "type": "journal", "issn": "1450-5843", "alternate_issns": ["2079-9292", "0883-4989"], "url": "http://www.electronics.etfbl.net/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-247562", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-247562", "https://www.mdpi.com/journal/electronics"]}, "title": "AIBPSF-IoMT: Artificial Intelligence and Blockchain-Based Predictive Security Framework for IoMT Technologies", "abstract": "The latest advancements in artificial intelligence (AI) technologies, including machine and deep learning models, in prediction, recommending, and automating processes have greatly impacted IoT devices in general, and protect them from cyberattacks in particular. Blockchain also has features that assist in creating more secure IoT devices due to its abilities of traceability, acceptability, and trust. This paper studies the current advancements in the IoT and blockchain, their architectures, and their effect on security. The paper proposes a novel framework that takes into consideration the advantages and benefits of machine/deep learning models and blockchain in order to provide a solution that makes IoT devices more secure. This framework is based on the IoT four-layer architecture, and it aims to enhance the way IoT devices detect and recognise cyberattacks using blockchain and machine/deep learning algorithms. Machine and deep learning algorithms are responsible for detecting security attacks in the IoT, based on their patterns. The blockchain platform is responsible for verifying whether a specific request is secure, and it also uses cryptography to sign all new requests in order to recognise them in future requests. The MQTTset dataset, which is contains data associated with intrusion detection cases, has been used to implement a case study that aims to prove the validity of this framework. Various machine and deep learning algorithms have been used in this case study which have all achieved high results with regard to precision, recall, accuracy, and F1 performance measurements. Such results have proven the validity and reliability of the proposed framework to detect and predict new attacks before their requests are processed within a particular IoT system.", "venue": "Electronics", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-11-28", "journal": {"name": "Electronics"}, "authors": [{"authorId": "2260813357", "name": "Bandar M. Alshammari"}], "citations": []}
