{"paperId": "74982b942f4c64a0a692d70eef8df6971edafc6c", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Time-Aware Neighbor Sampling for Temporal Graph Networks", "abstract": "We present a new neighbor sampling method on temporal graphs. In a temporal graph, predicting different nodes' time-varying properties can require the receptive neighborhood of various temporal scales. In this work, we propose the TNS (Time-aware Neighbor Sampling) method: TNS learns from temporal information to provide an adaptive receptive neighborhood for every node at any time. Learning how to sample neighbors is non-trivial, since the neighbor indices in time order are discrete and not differentiable. To address this challenge, we transform neighbor indices from discrete values to continuous ones by interpolating the neighbors' messages. TNS can be flexibly incorporated into popular temporal graph networks to improve their effectiveness without increasing their time complexity. TNS can be trained in an end-to-end manner. It needs no extra supervision and is automatically and implicitly guided to sample the neighbors that are most beneficial for prediction. Empirical results on multiple standard datasets show that TNS yields significant gains on edge prediction and node classification.", "venue": "arXiv.org", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-12-18", "journal": {"name": "ArXiv", "volume": "abs/2112.09845"}, "authors": [{"authorId": "2108841625", "name": "Yiwei Wang"}, {"authorId": "1928716951", "name": "Yujun Cai"}, {"authorId": "3431194", "name": "Yuxuan Liang"}, {"authorId": "49441320", "name": "Henghui Ding"}, {"authorId": "1906061249", "name": "Changhu Wang"}, {"authorId": "2019961", "name": "Bryan Hooi"}], "citations": [{"paperId": "7e55d5b5630ea4e90cb6187a58a9e67465242aec", "title": "TASER: Temporal Adaptive Sampling for Fast and Accurate Dynamic Graph Representation Learning"}, {"paperId": "17a6213e30895fb7e5d0b368236ea8beeb94ee86", "title": "Relational Deep Learning: Graph Representation Learning on Relational Databases"}, {"paperId": "2786f4d208e1fdafe33eae9e9db4bb7303538dae", "title": "Spear and Shield: Adversarial Attacks and Defense Methods for Model-Based Link Prediction on Continuous-Time Dynamic Graphs"}, {"paperId": "69e5e4f61a68d5b39f889aba5514673631673cb2", "title": "HGWaveNet: A Hyperbolic Graph Neural Network for Temporal Link Prediction"}, {"paperId": "ed23b5871365c873f3958210f2accce353c20db6", "title": "Do We Really Need Complicated Model Architectures For Temporal Networks?"}, {"paperId": "0780812e35b642aecd25148757019fd52466c0e0", "title": "Topological and Temporal Data Augmentation for Temporal Graph Networks"}]}
