{"paperId": "74ab68e882b0748ce10e53a6651117e5ac009c2b", "publicationVenue": {"id": "25710d4b-a2d9-4b6c-9f28-154866d9fbbe", "name": "International Convention on Information and Communication Technology, Electronics and Microelectronics", "type": "conference", "alternate_names": ["Int Conv Inf Commun Technol Electron Microelectron", "MIPRO"], "url": "http://www.mipro.hr/"}, "title": "Comparative Analysis of Machine Learning Algorithms on Data Sets of Different Characteristics for Digital Transformation", "abstract": "The application scenarios for machine learning algorithms are getting more complicated as machine learning and real-world situations converge more and more. All fields of study have adopted and benefit from diverse machine learning algorithms implementation. The challenge is to determine which algorithm is best suited to solve a given problem. This problem is especially challenging in social sciences. To tackle that issue, this paper explores a group of machine learning algorithms used for predictive models’ development in social science domains of business and education. Several machine learning algorithms are applied here (algorithms of artificial neural networks, k-nearest neighbors, decision tree) along with characteristics of datasets measured by meta-features. In the empirical part of the research, algorithms are compared on the data sets using standard predictive model evaluation metrics. Data sets are extracted from the education and business domain. Research results provide insights into machine learning algorithms’ performance depending on their meta-features. Meta-features are significant predictors of machine learning algorithms’ performance in both education and business domain. Machine learning-based predictive models developed in this paper are a step forward to the acceleration of digital transformation in the education and business sector.", "venue": "International Convention on Information and Communication Technology, Electronics and Microelectronics", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-22", "journal": {"name": "2023 46th MIPRO ICT and Electronics Convention (MIPRO)", "pages": "1428-1433"}, "authors": [{"authorId": "1702910", "name": "D. Oreški"}, {"authorId": "9237585", "name": "Igor Pihir"}, {"authorId": "2174065293", "name": "Dunja Višnjić"}], "citations": []}
