{"paperId": "74b391acac66aaf373a7c4d74199d8c62de7f95a", "publicationVenue": {"id": "efad5e01-e2cf-44e8-9cfa-c5d9634707fc", "name": "Proceedings", "issn": "2198-7432", "alternate_issns": ["0377-2969"], "url": "http://paspk.org/Proceedings-of-PAS-39"}, "title": "A Jaccard Similarity-Based Model to Match Stakeholders for Collaboration in an Industry-Driven Portal", "abstract": "The industry–university collaboration has been emphasized for innovation and economic development in the Triple Helix Model. To facilitate this collaboration often necessitates implementing interfaces between stakeholders. EGEVASYON, an industry-driven platform coined from the combination of innovation and Ege for the Aegean Region of Turkey, has been proposed to foster collaboration by involving researchers in industry projects. Moreover, the platform has a portal project under development, where researchers can receive recommendations among ongoing projects. Our study presents the use of Jaccard similarity measure in this recommendation model. Moreover, recommendation selection is demonstrated using a sample dataset of EU projects.", "venue": "Proceedings", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-03-11", "journal": {"name": "Proceedings"}, "authors": [{"authorId": "152426832", "name": "İnanç Kabasakal"}, {"authorId": "2085403750", "name": "Haluk Soyuer"}], "citations": [{"paperId": "5b578705ad14fec8eaf2dc37a825994eb690f2c7", "title": "A web content mining application for detecting relevant pages using Jaccard similarity"}, {"paperId": "585738b4caf8a2a76125a2b5b0106e74beaa8e05", "title": "Occupation similarity through bipartite graphs"}, {"paperId": "6026336daf6f0277d2300aa82131927b25574622", "title": "International Journal of Electrical and Computer Engineering (IJECE)"}, {"paperId": "c9230d092500df7e2e2710e95326022f68bc1c2b", "title": "A Comprehensive Survey on the Process, Methods, Evaluation, and Challenges of Feature Selection"}]}
