{"paperId": "74c6720507e1a8b8ad88565ec74b5dc8cb54c5a2", "publicationVenue": {"id": "29e6e722-a307-4196-958e-46e585f2fc47", "name": "IEEE Transactions on Reliability", "type": "journal", "alternate_names": ["IEEE Trans Reliab"], "issn": "0018-9529", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=24", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=24"]}, "title": "An Intelligent Resource Management Solution for Hospital Information System Based on Cloud Computing Platform", "abstract": "With the rapid growth in medical data, hospitals need to make enormous investments annually to expand computing resources. Cloud computing offers a platform for running medical services. However, sharing of medical data with unknown neighbors in the cloud environment may threaten the sensitive data of medical services. Private cloud provides a safety way to protect the sensitive data of medical services. But it is quite different from public cloud, since it is not easy to obtain more resources timely when the unpredictable workload is over the total amount of resources of private cloud. In addition, optimal resource allocation becomes a key issue as medical services possess distinctive features require different kinds of resource combination. In this article, an efficient resource management solution for medical services in hospital information system based on private cloud is proposed. We use intelligent control theory to adjust the resource allocation based on the dynamic workload adaptively, that effectively utilizes the limited resources of the private cloud while ensures the quality of services. The experiment results suggest that the proposed solution enables the efficient application of resources and reactions to unpredictable situations, which reduces the IT resources to hospitals.", "venue": "IEEE Transactions on Reliability", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-03-01", "journal": {"name": "IEEE Transactions on Reliability", "pages": "329-342", "volume": "72"}, "authors": [{"authorId": "48886151", "name": "Siqian Gong"}, {"authorId": "2125164206", "name": "Xiaomin Zhu"}, {"authorId": "36444740", "name": "Runtong Zhang"}, {"authorId": "2146230765", "name": "Hongmei Zhao"}, {"authorId": "2110225838", "name": "Chao Guo"}], "citations": [{"paperId": "319e6ca2fd2960a7c92b43f776aa200d0d26b28d", "title": "The Smart Measurement of Quality of Service (QoS) for Cloud Computing Platforms"}, {"paperId": "acebf78a8f2d76ae8273ef3e83c1dbb79c371d50", "title": "Emerging Technologies for 6G Communication Networks: Machine Learning Approaches"}, {"paperId": "f7363284d69871fd273f152efe656c1d24a58db1", "title": "Smart information analysis for health quality: decision tree approach"}, {"paperId": "afcb18d3c9fc547be3d319b97ae4cbb2b8553141", "title": "A review of observability issues in hospital information system"}, {"paperId": "f2e26e842d0ddba7be707ca3e56b895d577f3127", "title": "Content Management System Development for Medical Web Applications"}, {"paperId": "75bdef4d6ea27a71e719ba7303303a7199d3e376", "title": "Smart Hospitals and IoT Sensors: Why Is QoS Essential Here?"}]}
