{"paperId": "74c8c151a53af3bd5180be8821527eb133142e65", "publicationVenue": {"id": "32df3807-b551-4342-ae9e-be1854d1e7d8", "name": "American Journal of Gastroenterology", "type": "journal", "alternate_names": ["The American Journal of Gastroenterology", "Am J Gastroenterol"], "issn": "0002-9270", "url": "http://www.amjgastro.com/", "alternate_urls": ["http://www.nature.com/ajg/", "http://www3.interscience.wiley.com/journal/117955841/home", "http://www.sciencedirect.com/science/journal/00029270", "https://journals.lww.com/ajg/pages/default.aspx", "http://www.blackwellpublishing.com/journal.asp?ref=0002-9270"]}, "title": "Digital Health Technologies for Remote Monitoring and Management of Inflammatory Bowel Disease: A Systematic Review", "abstract": "INTRODUCTION: Digital health technologies may be useful tools in the management of chronic diseases. We performed a systematic review of digital health interventions in the management of patients with inflammatory bowel diseases (IBD) and evaluated its impact on (i) disease activity monitoring, (ii) treatment adherence, (iii) quality of life (QoL) measures, and/or (iv) health care utilization. METHODS: Through a systematic review of multiple databases through August 31, 2020, we identified randomized controlled trials in patients with IBD comparing digital health technologies vs standard of care (SoC) for clinical management and monitoring and reporting impact on IBD disease activity, treatment adherence, QoL, and/or health care utilization or cost-effectiveness. We performed critical qualitative synthesis of the evidence supporting digital health interventions in patients with IBD and rated certainty of evidence using Grading of Recommendations Assessment, Development and Evaluation. RESULTS: Overall, we included 14 randomized controlled trials (median, 98 patients; range 34—909 patients; follow-up <12 months) that compared web-based interventions, mobile applications, and different telemedicine platforms with SoC (clinic-based encounters). Although overall disease activity and risk of relapse were comparable between digital health technologies and SoC (very low certainty of evidence), digital health interventions were associated with lower rate of health care utilization and health care costs (low certainty of evidence). Digital health interventions did not significantly improve patients' QoL and treatment adherence compared with SoC (very low certainty of evidence). Trials may have intrinsic selection bias due to nature of digital interventions. DISCUSSION: Digital health technologies may be effective in decreasing health care utilization and costs, though may not offer advantage in reducing risk of relapse, QoL, and improving treatment adherence in patients with IBD. These techniques may offer value-based care for population health management.", "venue": "American Journal of Gastroenterology", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-11-09", "journal": {"name": "The American Journal of Gastroenterology", "pages": "78 - 97", "volume": "117"}, "authors": [{"authorId": "32174943", "name": "N. Nguyen"}, {"authorId": "2058916166", "name": "I. Martínez"}, {"authorId": "1790687", "name": "A. Atreja"}, {"authorId": "6593157", "name": "Amy M. Sitapati"}, {"authorId": "4349130", "name": "W. Sandborn"}, {"authorId": "1397958221", "name": "L. Ohno-Machado"}, {"authorId": "40519589", "name": "Siddharth Singh"}], "citations": [{"paperId": "569dd6e07c283257a7bcb6d2a3ab9706bec6b5c5", "title": "Gut microbiota and metabolites as predictors of biologics response in inflammatory bowel disease: A comprehensive systematic review."}, {"paperId": "8d6aa2e047e7905ff96ee2a95b2f456ebc5b4816", "title": "The 2023 Impact of Inflammatory Bowel Disease in Canada: Access to and Models of Care"}, {"paperId": "7c4697f50fb9a7720940811c88672b636ab3bcd5", "title": "Surfing the web as a patient with IBD: New horizons"}, {"paperId": "4e64e4244adb36c0c0180268abbc0e03ce725f95", "title": "Health Disparities in Inflammatory Bowel Disease Care Driven by Rural Versus Urban Residence: Challenges and Potential Solutions."}, {"paperId": "33789049a7cf559d77d62e67ee3987fe7b64a422", "title": "Health Disparities in Inflammatory Bowel Disease Care Driven by Rural Versus Urban Residence: Challenges and Potential Solutions."}, {"paperId": "adfa3a601197587fbe8fd44bd3b35a5d7f6dab96", "title": "Evaluation of the effectiveness of telemedical technologies in patients with digestive diseases"}, {"paperId": "58f1382d35cd9d76dc62e151a899952d17887f49", "title": "Telemedical follow-up in patients with inflammatory bowel diseases"}, {"paperId": "35642455cd153b68004bb7795487aed21c6d3ff8", "title": "Telemedicine in inflammatory bowel disease from its origin to the post pandemic golden age: A narrative review."}, {"paperId": "e132d7ded92522546b34c3884d55e8bef8500c04", "title": "Development of the ehive Digital Health App: Protocol for a Centralized Research Platform"}, {"paperId": "2fb521aa856ab9b7f7e2042898c706d6eda51c52", "title": "Management of Inflammatory Bowel Disease Using E-health Technologies: A Systematic Review and Meta-Analysis"}, {"paperId": "2cfa715565e4b44ef9ceac0e859c651de6baf1a2", "title": "A novel sparse linear mixed model for multi-source mixed-frequency data fusion in telemedicine"}, {"paperId": "28a998dfa0628d65b804a52a9b6abe5a0cf29302", "title": "Profiles of Web-based Portal Users with Inflammatory Bowel Disease."}, {"paperId": "bb4bdcba1033836ffd1baaaffb72113ba9036c5f", "title": "A Digital Health Intervention to Improve the Clinical Care of Inflammatory Bowel Disease Patients"}, {"paperId": "586daea09c299fa19f18246f8027665c4483f898", "title": "Effectiveness and cost-effectiveness of combined asynchronous telemonitoring and patient-initiated care for spondyloarthritis: protocol for a pragmatic multicentre randomised controlled trial (TeleSpA Study)"}, {"paperId": "173c83be6c1f6db360121e294f9c3a97980a2e3b", "title": "Agreement between patients and physicians on scores of inflammatory bowel disease activity and burden assessed on a telemonitoring platform"}, {"paperId": "44bccdd0cca32f2c1f7982bda520d0cb5137272e", "title": "The role of digital innovation in improving healthcare quality in extreme adversity: an interpretative phenomenological analysis study"}, {"paperId": "ec1533733f4dd83ab4b68b11a881934d47c64717", "title": "The future of telemedicine and wearable technology in IBD"}, {"paperId": "23a188348e03fb0eb17aa574d6d5a10afc1b9ec5", "title": "Remote care through telehealth for people with inflammatory bowel disease"}, {"paperId": "b0788984401c39d23920806a4e979555f517b3f5", "title": "Multichannel Mobile Companions for Personalized Healthcare Opportunities and Challenges"}, {"paperId": "0920e881019776f5da4a96b647fc9e2605f86617", "title": "Оценка точек приложения телемедицинских технологий в рамках оказания помощи пациентам с заболеваниями желудочно-кишечного тракта"}, {"paperId": "b95c6837423e80e499fae070a408e65926a19709", "title": "World Journal of Gastroenterology"}]}
