{"paperId": "74c85fdda1885b38cd8fd0f1891b1023a7133853", "publicationVenue": null, "title": "the Proceedings of the 20th USENIX Symposium on Networked Systems Design and Implementation", "abstract": "The breakthroughs in deep learning enable unstructured data to be represented as high-dimensional feature vectors for serving a wide range of applications. Processing vector queries (i.e., ﬁnding the nearest neighbor vectors for an input vector) for large unstructured datasets (with billions of items) is challenging, especially for applications with strict service level objectives (SLOs). Existing solutions trade query accuracy for latency, but without any guarantees, causing SLO violations. This paper presents Auncel, a vector query engine for large unstructured datasets that provides bounded query errors and bounded query latencies. The core idea of Auncel is to exploit local geometric properties of individual query vectors to build a precise error-latency proﬁle (ELP) for each query. This proﬁle enables Auncel to sample the right amount of data to process a given query while satisfying its error or latency requirements. Auncel is a distributed solution that can scale out with multiple workers. We evaluate Auncel with a variety of benchmarking datasets. The experimental results show that Auncel outperforms state-of-the-art approximate solutions by up to 10 × on query latency with the same error bound ( ≤ 10%). In particular, Auncel only takes 25 ms to process a vector query on the DEEP1B dataset that contains one billion items with four c5.metal EC2 instances.", "venue": "", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "2258740767", "name": "Systems Design"}, {"authorId": "2182609505", "name": "Zili Zhang"}, {"authorId": "2170749149", "name": "Chao Jin"}, {"authorId": "2237080638", "name": "Xuanzhe Liu"}, {"authorId": "2239060901", "name": "Xin Jin"}, {"authorId": "2258740824", "name": "†. LinpengTang"}], "citations": []}
