{"paperId": "74c9f4bc3bf808abce7a6639c8746c7aa012debd", "publicationVenue": {"id": "5334d34c-deab-4ef6-8460-abd4cd569f74", "name": "International Journal of Advanced Trends in Computer Science and Engineering", "type": "journal", "alternate_names": ["Int J Adv Trends Comput Sci Eng"], "issn": "2278-3091", "url": "http://warse.org/ijatcse_current.html"}, "title": "Performance Analysis of Multi-hop Technique on Two-tier Network Clustering in Wireless Sensor Network", "abstract": "Wireless Sensor Network (WSN) is a distributed connection that consists of many wireless sensor devices. It is used to get information from surrounding activities or environment and to send the details to the user for future computation. Due to its advantages, the WSN has been widely used to help people to collect, monitor and analyse the data. However, the biggest limitation of WSN is limited energy consumption which can affect the network performance. In order to reduce the energy usage, the process of selecting a path to the destination is very important. The current implementation uses the single-hop technique to send and receive data from source to destination and vice versa. The investigation shows that, the sensor nodes lifetime can be increased if some changes are made to the data transmission method. Therefore, the goal of this research is to increase energy efficiency using multi-hop technique as the primary transmission to make the network able to operate in a long period. An enhancement based on the Multi-tier Algorithm Protocol (MAP) has been produced. The enhancement technique is implemented to avoid direct communication between sensor nodes and cluster head, which is believed to be the main reason that caused inefficient use of energy (wastage). The proposed approach will give some advantages to data transmission, especially to the nodes that are located far from the cluster head. Subsequently, the experiment has been conducted to investigate the current implementation and this information has been used to make some improvements, before the performance of both techniques will be evaluated. The MATLAB is used to simulate and generate a graph. The results show that the enhancement algorithms will save energy up to 30% and is able to prolong the WSN lifetime with an advantage of 4462 cycles (to become 14283) compared to the original MAP which recorded only 9824 cycles.", "venue": "International Journal of Advanced Trends in Computer Science and Engineering", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2020-09-25", "journal": {"name": "International Journal of Advanced Trends in Computer Science and Engineering"}, "authors": [{"authorId": "145627193", "name": "Wan Isni Soffiah Wan Din"}], "citations": []}
