{"paperId": "74ce2a9a9b69121a5a5ac4d474ce1e7cafebb344", "publicationVenue": {"id": "fff3549c-df24-4aef-accb-a33ae442a828", "name": "Journal of Marine Science and Engineering", "type": "journal", "alternate_names": ["J Mar Sci Eng"], "issn": "2077-1312", "url": "https://www.mdpi.com/journal/jmse"}, "title": "A webGIS Application to Assess Seawater Quality: A Case Study in a Coastal Area in the Northern Aegean Sea", "abstract": "The assessment of seawater quality in coastal areas is an important issue as it is related to the welfare of coastal ecosystems, a prerequisite for the provision of the related ecosystem services. During the last decades, marine eutrophication has become an important problem in coastal waters as a result of nutrient inputs increase. Consequently, there is need for appropriate methods and tools to assess the eutrophication status of seawater which should be user-friendly to coastal managers and support the adoption of effective plans for the protection and sustainable development of the coastal environment. In this framework, a user-friendly webGIS application has been developed and the Strait of Mytilene at the southeastern part of the Island of Lesvos in the NE Aegean Sea, Greece, was used as a case study. The methodology includes, as a first step, the evaluation of the accuracy of spatial interpolators widely applied in oceanographic studies for assessing the spatial distribution of relevant variables. The most appropriate interpolator revealed for each variable is subsequently applied for the production of the representative thematic layer. The second step involves the integration of the information from the optimal thematic layers representing the spatial distributions of the variables under study; as a result, a new thematic layer illustrating the eutrophication status of the study area is produced. The webGIS application is fully available via a web browser and provides a number of geoprocessing modules developed in Python which implement the user interface, the application of the interpolation analytical tasks, the statistical evaluation toolset and the integration of the optimal interpolated layers. Suggestions for further improvement of the proposed webGIS application are discussed.", "venue": "Journal of Marine Science and Engineering", "year": 2020, "fieldsOfStudy": ["Environmental Science"], "publicationTypes": null, "publicationDate": "2020-12-31", "journal": {"name": "Journal of Marine Science and Engineering"}, "authors": [{"authorId": "14558814", "name": "D. Kitsiou"}, {"authorId": "2091817885", "name": "A. Patera"}, {"authorId": "91915628", "name": "G. Tsegas"}, {"authorId": "94201199", "name": "T. Nitis"}], "citations": [{"paperId": "234e8283598855c17b146a21e7d4a3079a66bdfc", "title": "Geo-Informatics for the Future: A Systematic Literature Review on the Role of WebGIS in Infrastructure Planning and Development"}, {"paperId": "004bc22acdc612900c93e2172ed97b1ff6c16865", "title": "Design for Wharf Quality Evaluation Service Platform Based on WebGIS: Design for Wharf Quality Evaluation Service Platform Based on WebGIS"}, {"paperId": "8d1f380845b38e78d00e98cb2d2c74da38007fec", "title": "Development of a webGIS Application to Assess Conflicting Activities in the Framework of Marine Spatial Planning"}, {"paperId": "93c0646db1282679ff7d045f826499de483c03fe", "title": "An Interactive WebGIS Framework for Coastal Erosion Risk Management"}]}
