{"paperId": "74d1590042ba96029c35579ead155b6f06eb7251", "publicationVenue": {"id": "1124d164-490d-4da9-b0c2-ce8a8dc98202", "name": "BigData Congress [Services Society]", "type": "conference", "alternate_names": ["BigData", "Bigdata Congr [services Soc", "IEEE Int Conf Big Data", "IEEE International Conference on Big Data", "Int Congr Big Data", "International Congress on Big Data", "Bigdata Congr", "BigData Congress"]}, "title": "Student success analysis for minority students in higher education", "abstract": "The dropout rate among minority students towards the end of their higher education studies is a significant issue. This research work centers on the analysis of student success at Marquette University, WI, USA, and holds significant importance from both an academic achievement perspective and for the nation’s growth. The Institute of Woman’s Leadership at Marquette University in collaboration with EECE faculty is investigating the cause of retention and dropout rates of minority students and preparing to come up with a solution to prevent that. We possess two datasets of 136k undergraduate and 29k PhD/graduate students. The main object of this study was to analyze the success rate of students based on their academic background and demographic data and to investigate how factors such as gender, race, and previous academic performance impact the success rate of minority students in higher education. Another important goal is to assess the impact of the Covid-19 pandemic on the success rate of these students. Several different classification algorithms Decision Tree, Random Forest, Logistic Regression, etc. were applied to the resampled datasets for predicting student success. Out of all the classifiers applied Random Forest had the best accuracy at 96.7% for the undergraduate dataset and 91.1% for the graduate student’s dataset. The study’s results will aid in implementing targeted interventions and strategies to prevent minority student dropout rates and improve their academic performance.", "venue": "BigData Congress [Services Society]", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-12-15", "journal": {"name": "2023 IEEE International Conference on Big Data (BigData)", "pages": "5292-5298"}, "authors": [{"authorId": "2051288097", "name": "Shamiha Binta Manir"}, {"authorId": "2280385320", "name": "Priya Deshpande"}], "citations": []}
