{"paperId": "74dbc069841d8fa55cd2721e53b9f4532899c146", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Ad Recommendation in a Collapsed and Entangled World", "abstract": "In this paper, we present an industry ad recommendation system, paying attention to the challenges and practices of learning appropriate representations. Our study begins by showcasing our approaches to preserving priors when encoding features of diverse types into embedding representations. Specifically, we address sequence features, numeric features, pre-trained embedding features, as well as sparse ID features. Moreover, we delve into two pivotal challenges associated with feature representation: the dimensional collapse of embeddings and the interest entanglement across various tasks or scenarios. Subsequently, we propose several practical approaches to effectively tackle these two challenges. We then explore several training techniques to facilitate model optimization, reduce bias, and enhance exploration. Furthermore, we introduce three analysis tools that enable us to comprehensively study feature correlation, dimensional collapse, and interest entanglement. This work builds upon the continuous efforts of Tencent's ads recommendation team in the last decade. It not only summarizes general design principles but also presents a series of off-the-shelf solutions and analysis tools. The reported performance is based on our online advertising platform, which handles hundreds of billions of requests daily, serving millions of ads to billions of users.", "venue": "arXiv.org", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-02-22", "journal": {"name": "ArXiv", "volume": "abs/2403.00793"}, "authors": [{"authorId": "2244166352", "name": "Junwei Pan"}, {"authorId": "2289832570", "name": "Wei Xue"}, {"authorId": "2289860061", "name": "Ximei Wang"}, {"authorId": "2290307914", "name": "Haibin Yu"}, {"authorId": "2289859772", "name": "Xun Liu"}, {"authorId": "2234352886", "name": "Shijie Quan"}, {"authorId": "2289841766", "name": "Xueming Qiu"}, {"authorId": "2244021955", "name": "Dapeng Liu"}, {"authorId": "2290133976", "name": "Lei Xiao"}, {"authorId": "2203425092", "name": "Jie Jiang"}], "citations": []}
