{"paperId": "751ab340ff7e344206b9d1c1fb71817fb952c74d", "publicationVenue": {"id": "278131df-030d-4e6c-b083-d57f3b740dc4", "name": "JMIR Research Protocols", "type": "journal", "alternate_names": ["JMIR Res Protoc"], "issn": "1929-0748", "url": "https://www.researchprotocols.org/", "alternate_urls": ["http://www.researchprotocols.org/index"]}, "title": "Understanding the Uptake of Big Data in Health Care: Protocol for a Multinational Mixed-Methods Study", "abstract": "Background Despite the high potential of big data, their applications in health care face many organizational, social, financial, and regulatory challenges. The societal dimensions of big data are underrepresented in much medical research. Little is known about integrating big data applications in the corporate routines of hospitals and other care providers. Equally little is understood about embedding big data applications in daily work practices and how they lead to actual improvements for health care actors, such as patients, care professionals, care providers, information technology companies, payers, and the society. Objective This planned study aims to provide an integrated analysis of big data applications, focusing on the interrelations among concrete big data experiments, organizational routines, and relevant systemic and societal dimensions. To understand the similarities and differences between interactions in various contexts, the study covers 12 big data pilot projects in eight European countries, each with its own health care system. Workshops will be held with stakeholders to discuss the findings, our recommendations, and the implementation. Dissemination is supported by visual representations developed to share the knowledge gained. Methods This study will utilize a mixed-methods approach that combines performance measurements, interviews, document analysis, and cocreation workshops. Analysis will be structured around the following four key dimensions: performance, embedding, legitimation, and value creation. Data and their interrelations across the dimensions will be synthesized per application and per country. Results The study was funded in August 2017. Data collection started in April 2018 and will continue until September 2021. The multidisciplinary focus of this study enables us to combine insights from several social sciences (health policy analysis, business administration, innovation studies, organization studies, ethics, and health services research) to advance a holistic understanding of big data value realization. The multinational character enables comparative analysis across the following eight European countries: Austria, France, Germany, Ireland, the Netherlands, Spain, Sweden, and the United Kingdom. Given that national and organizational contexts change over time, it will not be possible to isolate the factors and actors that explain the implementation of big data applications. The visual representations developed for dissemination purposes will help to reduce complexity and clarify the relations between the various dimensions. Conclusions This study will develop an integrated approach to big data applications that considers the interrelations among concrete big data experiments, organizational routines, and relevant systemic and societal dimensions. International Registered Report Identifier (IRRID) DERR1-10.2196/16779", "venue": "JMIR Research Protocols", "year": 2020, "fieldsOfStudy": ["Medicine", "Business"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-10-01", "journal": {"name": "JMIR Research Protocols", "volume": "9"}, "authors": [{"authorId": "34963471", "name": "R. Wehrens"}, {"authorId": "113607445", "name": "V. Sihag"}, {"authorId": "13485234", "name": "Sandra Sülz"}, {"authorId": "151412027", "name": "H. V. van Elten"}, {"authorId": "51320667", "name": "E. V. van Raaij"}, {"authorId": "3049048", "name": "A. D. de Bont"}, {"authorId": "1421296812", "name": "A. M. Weggelaar-Jansen"}], "citations": [{"paperId": "a819a0ac23991011ab22e90231ab21e041b308eb", "title": "Why Personal Dreams Matter: How professionals affectively engage with the promises surrounding data-driven healthcare in Europe"}, {"paperId": "64de05258bc649e9aa0726c5060db572be868718", "title": "Big Data Health Care Innovations: Performance Dashboarding as a Process of Collective Sensemaking"}]}
