{"paperId": "752da8e93d8da7941eab2ead37ebbed6462c2453", "publicationVenue": {"id": "7f838445-bde8-43c7-b527-396e2894eab1", "name": "International Journal of Grid and Utility Computing", "type": "journal", "alternate_names": ["Int J Grid Util Comput"], "issn": "1741-847X", "url": "https://www.inderscience.com/jhome.php?jcode=ijguc"}, "title": "A study on computing and e-learning in the perspective of distributed models", "abstract": "Electronic learning systems have been an area of interest for researchers in the past few decades as it offers flexible, reusable, scalable, available, affordable services to a wide variety of users including content generators, content users, and content managers. E-learning system involves digital content development, administration, and delivery of learning contents that can be made available even to remote locations. In the advent of huge digital content available on the internet, an effective e-learning system requires collaboration among the content creators, users, and administrators, further, it requires huge computational power and storage capacity. Presently, the system focuses mostly on the delivery of content to learners rather than concentrating on the effective storage and efficient retrieval of the content based on the skill of the individual learners. Several approaches have been attempted towards the personalised content delivery based on the basic skill of learners. However, the system maintained a repository of verified contents relatively than a validated content. In order to maintain a validated content for efficient retrieval, distributed models with respect to a different perspective of validation may be fruitful. This paper studied various distributed models that are developed in the domain of e-learning with respect to the learning environment, learning objects and learning style.", "venue": "International Journal of Grid and Utility Computing", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-08-11", "journal": {"name": "Int. J. Grid Util. Comput.", "pages": "243-255", "volume": "9"}, "authors": [{"authorId": "143729379", "name": "P. Kalyanaraman"}, {"authorId": "9523558", "name": "M. Anouncia"}], "citations": [{"paperId": "77aedc36b92f1dc9b9bd861f3641bbeb45afdb8f", "title": "Gamification in human resource management—Status quo and quo vadis"}, {"paperId": "01abdb8d78b23001e072be8dce71a6c513ecac3b", "title": "Virtual reality and gamification in marketing higher education: a review and research agenda"}, {"paperId": "99c62b351396127d2adddf2931efd43b5cf01aa8", "title": "Virtual reality and gami ﬁ cation in marketing higher education: a review and research agenda Realidad virtual y gami ﬁ caci (cid:1) on en la educaci (cid:1) on superior de marketing: revisi (cid:1) on y agenda futura de investigaci"}]}
