{"paperId": "7540dbd15c07c9256dba3d77b75a6b921bbcf8c2", "publicationVenue": {"id": "849b6687-df71-4d12-9c46-59f45d5ce951", "name": "IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing", "type": "journal", "alternate_names": ["IEEE J Sel Top Appl Earth Obs Remote Sens"], "issn": "1939-1404", "url": "https://ieeexplore.ieee.org/servlet/opac?punumber=4609443", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4609443"]}, "title": "Improved Ocean–Fog Monitoring Using Himawari-8 Geostationary Satellite Data Based on Machine Learning With SHAP-Based Model Interpretation", "abstract": "Ocean–fog is a type of fog that forms over the ocean and has a visibility of less than 1 km. Ocean–fog frequently causes incidents over oceanic and coastal regions; ocean–fog detection is required regardless of the time of day. Ocean–fog has distinct thermo-optical properties, and spatially and temporally extensive ocean–fog detection methods based on geostationary satellites are typically employed. Infrared (IR) channels of Himawari-8 were used to construct three machine-learning models for the continuous detection of ocean–fog. In contrast, visible channels are valid only during the daytime. As control models, we used fog products from the National Meteorological Satellite Center (NMSC) and machine-learning models trained by adding a visible channel. The extreme gradient boosting model utilizing IR channels corrected ocean–fog perfectly day and night, with the highest F1 score of 97.93% and a proportion correct (PC) of 98.59% throughout the day. In contrast, the NMSC product had a probability of detection of 87.14%, an F1 score of 93.13%, and a PC of 71.9%. As demonstrated by the qualitative evaluation, the NMSC product overestimates clouds over small and coarsely textured ocean–fog regions. In contrast, the proposed model distinguishes between ocean–fog, clear skies, and clouds at the pixel scale. The Shapley additive explanation analysis demonstrated that the difference between channels 14 and 7 was very useful for ocean–fog detection at night, and its extremely low values contributed significantly to distinguishing nonfog during the daytime. Channel 15, affected by water vapor absorption, contributed most to ocean–fog detection among atmospheric window channels. The research findings can be used to improve operational ocean–fog detection and forecasting.", "venue": "IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing", "pages": "7819-7837", "volume": "16"}, "authors": [{"authorId": "9708784", "name": "Seongmun Sim"}, {"authorId": "143927093", "name": "J. Im"}], "citations": []}
