{"paperId": "7551ad363ac0a90cd4283a6a4cf8493f09260e8d", "publicationVenue": {"id": "d5b215f3-f737-45b2-875b-df309ce14c43", "name": "Scientific Programming", "type": "journal", "alternate_names": ["Sci Program"], "issn": "1058-9244", "url": "https://www.hindawi.com/journals/sp/", "alternate_urls": ["https://www.iospress.nl/html/10589244.php", "https://www.wiley.com/legacy/compbooks/compjournals/sciprog.html", "http://content.iospress.com/journals/scientific-programming"]}, "title": "Intelligent Community Management System Based on Big Data Technology", "abstract": "Community safety has become an important part of social public safety. The construction of a safe community focuses on the accumulation of community safety capabilities. This paper discusses the application of big data technology in community safety construction and the improvement of community safety promotion capabilities. We analyzed the sources and collection methods of community data, classified multisource heterogeneous community data, and constructed seven types of community data. We designed the conceptual structure and storage structure of the community database. On the basis of the construction of the community database, the architecture design of the big data platform for community security was launched. From the perspective of different user types, the functional requirements of the big data platform were analyzed. Combined with demand analysis, the overall architecture design of the community big data platform was carried out. On the basis of the overall architecture, the application architecture and technical architecture were designed in more detail, and the key technologies of the community big data platform were analyzed. Finally, it analyzes how to use the community big data platform to predict public security risks by constructing a CART regression tree model.", "venue": "Scientific Programming", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-02-23", "journal": {"name": "Scientific Programming"}, "authors": [{"authorId": "31505222", "name": "Yang Liu"}], "citations": []}
