{"paperId": "75522e04f7e11321e0ceab380c4b8c6162e7fbf3", "publicationVenue": null, "title": "Systematic Literature Review: Digital Twins’ Role in Enhancing Security for Industry 4.0 Applications", "abstract": "Connectivity and data exchange are key features of Industry 4.0. In this paradigm, (Industrial) Internet of Things ((I)IoT) devices are a vital component facilitating the collection and transmission of environmental data from the physical sys-tem to the central station for processing and analysis(Digital Twin). However, although (I)IoT devices play a critical role in this process, they are not inherently equipped to run strong encryption mechanisms to secure the data they transmit over wired or wireless channels. This research aims to explore the potential of Digital Twins (DT) in securing Industry 4.0 applications and the security mechanism employed to ensure con-ﬁdentiality, integrity, and authentication of data communicated between (I)IoT and DT through a Systematic Literature Review (SLR). This systematic literature review, based on the analysis of 67 papers published between 2018 and 2023, un-derscores the evolving signiﬁcance of Digital Twin technology, particularly within the ambit of Industry 4.0. The ﬁndings illuminate the pervasive inﬂuence of Digital Twin technology across multiple industrial sectors. The result SLR revealed that DT is growing and being widely adopted as a security tool particularly in Industry 4.0 using enabling technology like machine learning, data analytics, blockchain, and 5G networks to provide security solutions such as intrusion detection, vulnerability assessment, cyber range, and threat intelligence.", "venue": "", "year": null, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": null, "journal": null, "authors": [{"authorId": "2295153567", "name": "Mohammed El-Hajj"}, {"authorId": "2295137886", "name": "Teklit Gebremariam"}, {"authorId": "2295143737", "name": "Taru Itapelo"}], "citations": []}
