{"paperId": "7557105c9aa6a26db4f8e73fabb25e8134013fb5", "publicationVenue": {"id": "1e33b3be-b2ab-46e9-96e8-d4eb4bad6e44", "name": "Annual Meeting of the Association for Computational Linguistics", "type": "conference", "alternate_names": ["Annu Meet Assoc Comput Linguistics", "Meeting of the Association for Computational Linguistics", "ACL", "Meet Assoc Comput Linguistics"], "url": "https://www.aclweb.org/anthology/venues/acl/"}, "title": "Pivotal Role of Language Modeling in Recommender Systems: Enriching Task-specific and Task-agnostic Representation Learning", "abstract": "Recent studies have proposed unified user modeling frameworks that leverage user behavior data from various applications. Many of them benefit from utilizing users’ behavior sequences as plain texts, representing rich information in any domain or system without losing generality. Hence, a question arises: Can language modeling for user history corpus help improve recommender systems? While its versatile usability has been widely investigated in many domains, its applications to recommender systems still remain underexplored. We show that language modeling applied directly to task-specific user histories achieves excellent results on diverse recommendation tasks. Also, leveraging additional task-agnostic user histories delivers significant performance benefits. We further demonstrate that our approach can provide promising transfer learning capabilities for a broad spectrum of real-world recommender systems, even on unseen domains and services.", "venue": "Annual Meeting of the Association for Computational Linguistics", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-12-07", "journal": {"pages": "1146-1161"}, "authors": [{"authorId": "2810739", "name": "Kyuyong Shin"}, {"authorId": "3434480", "name": "Hanock Kwak"}, {"authorId": "2382193", "name": "Wonjae Kim"}, {"authorId": "2115678107", "name": "Jisu Jeong"}, {"authorId": "1753223653", "name": "Seungjae Jung"}, {"authorId": "2109351321", "name": "KyungHyun Kim"}, {"authorId": "2577039", "name": "Jung-Woo Ha"}, {"authorId": "3226948", "name": "Sang-Woo Lee"}], "citations": [{"paperId": "b2718403fc1c7f7cc07fa276d392bad8c26aa167", "title": "Personalized Transformer-based Ranking for e-Commerce at Yandex"}, {"paperId": "60f15685ae7b147513375e23eff33afa7551012a", "title": "NineRec: A Benchmark Dataset Suite for Evaluating Transferable Recommendation"}, {"paperId": "bae4d1fcf4cb64fcfe158e6c53596b17d5fb1bcb", "title": "Can Current Task-oriented Dialogue Models Automate Real-world Scenarios in the Wild?"}, {"paperId": "5fa104bc6ecdc4d8c8753002d3a9bf8a525ebcb1", "title": "Contextual Bandits for Hyper-Personalization based on User Behavior in Local Domain"}]}
