{"paperId": "755b0e56c4477bf4134bd0909c95e4a6d93a184c", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "WebGIS Implementation for Dynamic Mapping and Visualization of Coastal Geospatial Data: A Case Study of BESS Project", "abstract": "Within an E.U.-funded project, BESS (Pocket Beach Management and Remote Surveillance System), the notion of a geographic information system is an indispensable tool for managing the dynamics of georeferenced data and information for any form of territorial planning. This notion was further explored with the creation of a WebGIS portal that will allow local and regional stakeholders/authorities obtain an easy remote access tool to monitor the status of pocket beaches (PB) in the Maltese Archipelago and Sicily. In this paper, we provide a methodological approach for the implementation of a WebGIS necessary for very detailed dynamic mapping and visualization of geospatial coastal data; the description of the dataset necessary for the monitoring of coastal areas, especially the PBs; and a demonstration of a case study for the PBs of Sicily and Malta by using the methodology and the dataset used during the BESS project. Detailed steps involved in the creation of the WebGIS are presented. These include data preparation, data storage, and data publication and transformation into geo-services. With the help of different Open Geospatial Consortium protocols, the WebGIS displays different layers of information for 134 PBs including orthophotos, sedimentological/geomorphological beach characteristics, shoreline evolution, geometric and morphological parameters, shallow water bathymetry, and photographs of pocket beaches. The WebGIS allows not only for identifying, evaluating, and directing potential solutions to present and arising issues, but also enables public access and involvement. It reflects a platform for future local and regional coastal zone monitoring and management, by promoting public/private involvement in addressing coastal issues and providing local public administrations with an improved technology to monitor coastal changes and help better plan suitable interventions.", "venue": "Applied Sciences", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-09-05", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "2807593", "name": "G. Randazzo"}, {"authorId": "104635147", "name": "F. Italiano"}, {"authorId": "101987527", "name": "A. Micallef"}, {"authorId": "50603010", "name": "A. Tomasello"}, {"authorId": "2088816761", "name": "F. P. Cassetti"}, {"authorId": "6650310", "name": "A. Zammit"}, {"authorId": "1402477676", "name": "S. D’Amico"}, {"authorId": "2135122929", "name": "Oliver Saliba"}, {"authorId": "7682282", "name": "M. Cascio"}, {"authorId": "2134168904", "name": "Franco Cavallaro"}, {"authorId": "104965892", "name": "A. Crupi"}, {"authorId": "47161559", "name": "M. Fontana"}, {"authorId": "2054187548", "name": "Francesco Gregorio"}, {"authorId": "2057339430", "name": "S. Lanza"}, {"authorId": "51230925", "name": "E. Colica"}, {"authorId": "2129229623", "name": "Anselme Muzirafuti"}], "citations": [{"paperId": "9eaef66b4b0065df839879e0ed57eca48476429d", "title": "Digital Mapping of Dukuh Village’s Potential, Banyudono Subdistrict, Boyolali Regency"}, {"paperId": "d0e153b6d946bce96aa25e12120f1feee947b1ca", "title": "Assessing Shallow Soft Deposits through Near-Surface Geophysics and UAV-SfM: Application in Pocket Beaches Environments"}, {"paperId": "c0af1bb7baa668353095e718e3e533ab7b30aaf0", "title": "Smart Island Lemukutan Through WebGIS Based Benthic Habitat Data Collection"}, {"paperId": "5b4c5aa3c53cb09eacf6eab20559b9bc19a1101a", "title": "GIS-Driven Management of Maltese Pocket Beaches: Insights and Applications from the SIPOBED Project"}, {"paperId": "52e66a4585b1ec0cd51960215cceddd69e911dd2", "title": "Geomorphology in the Digital Age: A Case Study Project of Quantitative Geomorphology from Images"}, {"paperId": "d43fdde3ce0f995327737d5333abdba9a6ad5bd9", "title": "A national scale web mapping platform for mainstreaming ecosystem services in Greece"}, {"paperId": "d070512c8bed9e3e2eccb152471d66c1fba983d9", "title": "Using geovisual analytics to enrich conservation science: a review of interactive visualization of wildlife and environmental spatial data across ecosystems"}, {"paperId": "d7018923ed0185c3acf4d3b8f46db3f35e28472d", "title": "Satellite-Derived Bathymetry for Selected Shallow Maltese Coastal Zones"}, {"paperId": "10f39996661b59733cfff42d9539023ad7736da7", "title": "Analysis of the Rockfall Phenomena Contributing to the Evolution of a Pocket Beach Area Using Traditional and Remotely Acquired Data (Lo Zingaro Nature Reserve, Southern Italy)"}, {"paperId": "56419982ce9d6df7fa172e57cdfa10d8c4803854", "title": "Co-Creating GIS-Based Dashboards to Democratize Knowledge on Urban Resilience Strategies: Experience with Camerino Municipality"}, {"paperId": "6c0da884133c7f1acf8973b3292e142b892ec088", "title": "Spatiotemporal Variation of Land Surface Temperature Retrieved from FY-3D MERSI-II Data in Pakistan"}, {"paperId": "e951dbbc387ce1505136df69a3a895f740b45a2f", "title": "Investigating Pocket beach dynamics in Malta: The SIPOBED project"}, {"paperId": "2b728bf879aebc238367b137f55ac6652c19627f", "title": "UAV Application for Coastal Area Monitoring: A Case Study of Sant'Alessio Siculo, Sicily"}, {"paperId": "7107cf62c7f192a2db52e17b7e76e059157ae443", "title": "Enhancing 3D Reconstruction Model by Deep Learning and Its Application in Building Damage Assessment after Earthquake"}, {"paperId": "a173726027e8338ad1b521e04787b63f67263c87", "title": "A Classification Feature Optimization Method for Remote Sensing Imagery Based on Fisher Score and mRMR"}, {"paperId": "a1a8f10ff06a2bb4411aed1635270711067fd5ab", "title": "Improvement of Integrated Watershed Management in Indonesia for Mitigation and Adaptation to Climate Change: A Review"}, {"paperId": "b2ba4e9f2367945885ba4b1a5a64bdaf75131fbc", "title": "DESIGN AND IMPLEMENTATION OF AN OPEN-SOURCE WEB-GIS TO MANAGE THE PUBLIC WORKS OF ABRUZZO REGION: AN EXAMPLE TOWARDS THE DIGITALIZATION OF THE MANAGEMENT PROCESS OF PUBLIC ADMINISTRATIONS"}, {"paperId": "8dfebc63385f0352824563e4c401c90d2a231dea", "title": "A Blueprint for the Estimation of Seagrass Carbon Stock Using Remote Sensing-Enabled Proxies"}, {"paperId": "ac0bc8b107c7803feb9ca3dc00f17e3ef222605f", "title": "Morphology of Dome- and Tepee-Like Landforms Generated by Expansive Hydration of Weathering Anhydrite: A Case Study at Dingwall, Nova Scotia, Canada"}, {"paperId": "5e0981df800b31724a0ae7cda253eff6718fca0e", "title": "Geomorphological and Structural Assessment of the Coastal Area of Capo Faro Promontory, NE Salina (Aeolian Islands, Italy)"}, {"paperId": "65a51b44e126c04fd627fae500d905428ab712ab", "title": "3D-Reconstruction of a Giant Posidonia oceanica Beach Wrack (Banquette): Sizing Biomass, Carbon and Nutrient Stocks by Combining Field Data With High-Resolution UAV Photogrammetry"}, {"paperId": "5983ce4b16c02a4736c27add4c3c3116699e1527", "title": "Rational Sampling Numbers of Soil pH for Spatial Variation: A Case Study from Yellow River Delta in China"}, {"paperId": "7c8689a4b1bcd93c5da980a2b886bd0de76a1371", "title": "A Smart and Mechanized Agricultural Application: From Cultivation to Harvest"}, {"paperId": "972cde36fe00a89b56e881e0050aea0aeff34bbd", "title": "Aerial Monitorization—A Vector for Ensuring the Agroecosystems Sustainability"}, {"paperId": "0c6f40045aad0783a568639b9a185d9ac8253e43", "title": "An Investigation of the Policies and Crucial Sectors of Smart Cities Based on IoT Application"}, {"paperId": "f8763e8d65d89807941841366070701fd384f71d", "title": "Combining Object-Based Machine Learning with Long-Term Time-Series Analysis for Informal Settlement Identification"}, {"paperId": "acf43d16a28016bde32b56671af40d9deff5cfe3", "title": "Application of Remote Sensing Tools to Assess the Land Use and Land Cover Change in Coatzacoalcos, Veracruz, Mexico"}, {"paperId": "25ebbd2d61c0506a0f9019dc0953113fecf85147", "title": "Geomorphic Evolution of Radial Sand Ridges in the South Yellow Sea Observed from Satellites"}]}
