{"paperId": "756740456d47a5760ad585560669c97302b03b87", "publicationVenue": {"id": "657a4bec-9a11-40fb-acfe-243d7fb993ae", "name": "Frontiers in Earth Science", "type": "journal", "alternate_names": ["Frontiers of Earth Science", "Frontiers in Earth Sciences", "Front Earth Sci"], "issn": "2296-6463", "alternate_issns": ["1863-4621", "2095-0195"], "url": "http://www.frontiersin.org/Earth_Science", "alternate_urls": ["http://journal.hep.com.cn/fesci/EN/2095-0195/current.shtml", "http://www.frontiersin.org/Journal/Archive.aspx?artId=0&f=19&name=Earth_Science", "https://www.frontiersin.org/journals/earth-science", "https://www.springer.com/series/7066"]}, "title": "Response of granite residual soil slopes under dry–wet cycles", "abstract": "Granite residual soil is widely distributed in the southern coastal areas of China, and the slopes of granite residual soil are prone to instability and failure under the alternating action of rainfall and drying, which will cause great disasters to human society. In order to study the response mechanism of granite residual soil slopes under the alternating action of rainfall–drying–static–rainfall (RDSR), this study conducted indoor scaling model tests to analyze the response during dry and wet cycles. This study presented the response process of the slope under the influence of dry and wet cycles and discussed the change laws of slope deformation, water content, and matric suction. The results show that, under the alternating action of rainfall–drying–static–rainfall, 1) the network cracks on the slope form a dominant channel for rainwater seepage, which is the main reason for the rapid decline in soil anti-sliding ability within a short time; 2) at a rainfall intensity of 1.7–2.4 mm/min, the erosion effect of rain on the slope is obviously stronger than that of osmotic erosion, and the surface erosion failure of the granite residual soil slope tends to occur without an obvious sliding surface; 3) after the loss of matric suction over a certain period, the phenomenon of channeling and loss failure on the slope serve as a sufficient condition for slope instability failure but is not a necessary condition. The above research results are expected to provide the basis and reference for preventing and controlling landslide hazards in granite residual soil slopes under similar conditions.", "venue": "Frontiers in Earth Science", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-01-18", "journal": {"name": "Frontiers in Earth Science"}, "authors": [{"authorId": "2280769849", "name": "Qiang Mao"}, {"authorId": "2280538619", "name": "Kai Guo"}, {"authorId": "2247702067", "name": "Jiangwei Zhang"}, {"authorId": "2247857583", "name": "Guangning Xiao"}, {"authorId": "2281677716", "name": "Jianhang Du"}, {"authorId": "2247996743", "name": "Xiaohui Cheng"}, {"authorId": "2157780109", "name": "Hongxian Guo"}], "citations": []}
