{"paperId": "75715a95a481ccea7857cc556f4af38137c75fcf", "publicationVenue": {"id": "a8d3f485-7623-41d7-9888-9fc7c046ccb3", "name": "Journal of Information and Optimization Sciences", "type": "journal", "alternate_names": ["J Inf Optim Sci"], "issn": "0252-2667", "url": "http://www.tandfonline.com/loi/tios20", "alternate_urls": ["http://www.tarupublications.com/jios.html"]}, "title": "Open research problem for effective IoT authentication", "abstract": "Abstract IoT is collection of different “things” which are associated with open web. As all the things are connected to the Internet, it offers convenience to end users for accessing the resources from “Any Where, Any Time” throughout the globe. At the same time, open nature of IoT provides a fertile ground to an intruder for launching different security related threats. If we can not apply proper security safeguards to the IoT System, then it will be not useful to society. Authentication, Encryption, Trust Management and Secure Routing are different domains to offer security in IoT system. Among them, Authentication is very much important security service as it validates device identity before granting access to system services/resources. Existing IoT Authentication algorithms fail to verify device identity in unambiguous way. Existing authentication methods are based on Identity, Key, Password or token attribute for validating device identity. They are vulnerable to different security threats such as Key Stolen threat, MITM threat and Location Spoofing threat. These kinds of approaches are not suitable in the applications related to target tracking, smart city or defense. They provide device identification in ambiguous way and because of that intruder can perform malicious activities in a system, which can decrease system performance. So, it is a demand of time to design an efficient and secure Multi-factor Context aware Multi Key based IoT algorithm which can offer better security from well-known security threats and validate device identity in unambiguous way.", "venue": "Journal of Information and Optimization Sciences", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-04-03", "journal": {"name": "Journal of Information and Optimization Sciences", "pages": "401 - 410", "volume": "43"}, "authors": [{"authorId": "79525172", "name": "M. Mehta"}, {"authorId": "2113271743", "name": "Kajal Patel"}], "citations": []}
