{"paperId": "7576542e28f5bdbf3d9edfde689fdf68e1c981ca", "publicationVenue": {"id": "adf5e97b-02a0-4db1-8b89-5b7998a06314", "name": "International Journal of Preventive Medicine and Health", "type": "journal", "alternate_names": ["Int J Prev Med Health"], "issn": "2582-7588"}, "title": "Chronic Kidney Disease Prediction using Machine Learning Algorithms", "abstract": "Kidney diseases are increasing day by day among people. It is becoming a major health issue around the world. Not maintaining proper food habits and drinking less amount of water are one of the major reasons that contribute this condition. With this, it has become necessary to build up a system to foresee Chronic Kidney Diseases precisely. Here, we have proposed an approach for real time kidney disease prediction. Our aim is to find the best and efficient machine learning (ML) application that can effectively recognize and predict the condition of chronic kidney disease. We have used the data from UCI machine learning repository. In this work, five important machine learning classification techniques were considered for predicting chronic kidney disease which are KNN, Logistic Regression, Random Forest Classifier, SVM and Decision Tree Classifier. In this process, the data has been divided into two sections. In one section train dataset got trained and another section got evaluated by test dataset. The analysis results show that Decision Tree Classifier and Logistic Regression algorithms achieved highest performance than the other classifiers, obtaining the accuracy of 98.75% followed by random Forest, which stands at 97.5%.", "venue": "International Journal of Preventive Medicine and Health", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-07-10", "journal": {"name": "International Journal of Preventive Medicine and Health"}, "authors": [{"authorId": "2169083559", "name": "Kallu Samatha Ms."}, {"authorId": "2169094218", "name": "Muppidi Rohitha Reddy Ms."}, {"authorId": "2169090542", "name": "Pattan Faizal Khan Mr."}, {"authorId": "2169082113", "name": "Rayapati Akhil Chowdary Mr."}, {"authorId": "122739391", "name": "Padidela  Swarochish Rao"}], "citations": [{"paperId": "c2c96ac6873e8e56bc0dda332b49c79bbb212064", "title": "An Analysis of Machine Learning Algorithms for Chronic Kidney Disease Prediction"}, {"paperId": "232079bfb15c13b8d8d4f19b5e42ba0de12d2dad", "title": "Machine Learning Methodology for Prediction of Chronic Kidney Disease"}]}
