{"paperId": "7576b03835494b047c1c1d56244212858aa4be48", "publicationVenue": {"id": "8a9e9f3b-a025-473d-801e-72cdb0653d22", "name": "IEEE Symposium Series on Computational Intelligence", "type": "conference", "alternate_names": ["IEEE Symp Ser Comput Intell", "SSCI"], "url": "http://www.ieee-ssci.org/"}, "title": "Scalable Kernelized Deep Fuzzy Clustering Algorithms for Big Data", "abstract": "Conventional scalable clustering-based Deep Neural Network (DNN) algorithms cluster linearly separable data, however non-linearly separable data in the feature space is harder to cluster. This paper proposes a novel Scalable Deep Neural Network Kernelized Literal Fuzzy C-Means (SDnnKLFCM) and Scalable Deep Neural Network Kernelized Random Sampling Iterative Optimization Fuzzy C-Means for Big Data (SDnnKRSIO-FCM). These kernelized clustering methods solve non-linear separable issues by non-linearly transforming the input data space into a high-dimensional feature space using a Cauchy Kernel Function (CKF). We create kernelized deep neural network fuzzy clustering methods using Apache Spark in-memory cluster computing technique to efficiently cluster Big Data on High-Performance Computing (HPC) machine. To demonstrate the effectiveness of the proposed (SDnnKLFCM) and (SDnnKRSIO-FCM) in comparison to previous scalable deep neural network clustering methods, extensive tests are carried out on a variety of large datasets. The reported experimental results show that the kernelized non-linear deep clustering algorithms in comparison with linear fuzzy clustering algorithms achieve significant improvement in terms of Normalized Mutual Information (NMI), Adjusted Rand Index (ARI), and F-score, respectively.", "venue": "IEEE Symposium Series on Computational Intelligence", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-05", "journal": {"name": "2023 IEEE Symposium Series on Computational Intelligence (SSCI)", "pages": "1322-1327"}, "authors": [{"authorId": "40499767", "name": "Preeti Jha"}, {"authorId": "2238121861", "name": "Aruna Tiwari"}, {"authorId": "1815524", "name": "Neha Bharill"}, {"authorId": "4474139", "name": "M. Ratnaparkhe"}, {"authorId": "39832205", "name": "O. Patel"}, {"authorId": "2277578088", "name": "Anjali Gupta"}, {"authorId": "2279568824", "name": "Deepali Sukhija"}, {"authorId": "2279568822", "name": "Deepika Sukhija"}, {"authorId": "2238121045", "name": "Rajesh Dwivedi"}], "citations": []}
