{"paperId": "75770196c9bda99fc2e27b427e2755741bb8f965", "publicationVenue": {"id": "ef00f0de-a7e5-443a-9a2d-c78502a4b598", "name": "Conference on Computer Science and Information Systems", "type": "conference", "alternate_names": ["Fed Conf Comput Sci Inf Syst", "Conf Comput Sci Inf Syst", "FedCSIS", "Federated Conference on Computer Science and Information Systems"], "url": "https://fedcsis.org/"}, "title": "Khaos: Dynamically Optimizing Checkpointing for Dependable Distributed Stream Processing", "abstract": "Distributed Stream Processing systems are becoming an increasingly essential part of Big Data processing platforms as users grow ever more reliant on their ability to provide fast access to new results. As such, making timely decisions based on these results is dependent on a system’s ability to tolerate failure. Typically, these systems achieve fault tolerance and the ability to recover automatically from partial failures by implementing checkpoint and rollback recovery. However, owing to the statistical probability of partial failures occurring in these distributed environments and the variability of workloads upon which jobs are expected to operate, static configurations will often not meet Quality of Service constraints with low overhead.In this paper we present Khaos, a new approach which utilizes the parallel processing capabilities of cloud orchestration technologies for the automatic runtime optimization of fault tolerance configurations in Distributed Stream Processing jobs. Our approach employs three subsequent phases which borrows from the principles of Chaos Engineering: establish the steady-state processing conditions, conduct experiments to better understand how the system performs under failure, and use this knowledge to continuously minimize Quality of Service violations. We implemented Khaos prototypically together with Apache Flink and demonstrate its usefulness experimentally.", "venue": "Conference on Computer Science and Information Systems", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-09-06", "journal": {"name": "2022 17th Conference on Computer Science and Intelligence Systems (FedCSIS)", "pages": "553-561"}, "authors": [{"authorId": "88355634", "name": "Morgan K. Geldenhuys"}, {"authorId": "2124213396", "name": "Benjamin J. J. Pfister"}, {"authorId": "2051551482", "name": "Dominik Scheinert"}, {"authorId": "144754478", "name": "O. Kao"}, {"authorId": "2294791", "name": "L. Thamsen"}], "citations": [{"paperId": "d55d57ec10332532d085993b152da83bfa5ce422", "title": "Daedalus: Self-Adaptive Horizontal Autoscaling for Resource Efficiency of Distributed Stream Processing Systems"}, {"paperId": "e42283730684b5c55d51ca7af30f375f4b54e4d7", "title": "Evaluation of Data Enrichment Methods for Distributed Stream Processing Systems"}, {"paperId": "de5aa6b31e3fbfb2586ebd847a1e05594a738dd4", "title": "Probabilistic Time Series Forecasting for Adaptive Monitoring in Edge Computing Environments"}]}
