{"paperId": "757d9f291795c64a2a569624a3ddbe4232217eb3", "publicationVenue": null, "title": "Auto-tuning elastic applications in production", "abstract": "Modern cloud applications must be tuned for high performance. Yet, a single static configuration is insufficient since a cloud application must deal with changes in workload, varying numbers of replicas due to auto-scaling, and upgrades to the environment and the application code itself. These dynamics can only be observed altogether during the application execution and affects different layers of the application stack. In this paper, we describe SmartTuning, a technique and tool to auto-tune cloud applications on the fly, improving resource utilization and performance under dynamic workloads. SmartTuning reacts to different workloads over time and automatically explores and adapts the application's configuration through Bayesian Optimization. SmartTuning searches for configurations that better use resources when the application is subject to auto-scaling and dynamic workloads. It minimizes the need for the operations team to instrument code or manually try out configurations in testing environments. Our evaluation of three industrial applications indicates that SmartTuning can, on average, improve application efficiency by 58% and reduce cost by 27%.", "venue": "2023 IEEE/ACM 45th International Conference on Software Engineering: Software Engineering in Practice (ICSE-SEIP)", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-05-01", "journal": {"name": "2023 IEEE/ACM 45th International Conference on Software Engineering: Software Engineering in Practice (ICSE-SEIP)", "pages": "355-367"}, "authors": [{"authorId": "144376181", "name": "Adalberto R. Sampaio"}, {"authorId": "2637596", "name": "Ivan Beschastnikh"}, {"authorId": "153318210", "name": "Daryl Maier"}, {"authorId": "40544471", "name": "D. Bourne"}, {"authorId": "2284225576", "name": "Vijay Sundaresan"}], "citations": [{"paperId": "8dd47f2ab5b6901c71c6472d6394ab93427e20b6", "title": "QoS-Driven Auto-Scaling Docker Containers Testbed with Dynamic Weighted Load Balancing"}]}
