{"paperId": "757d72ef41da2705eb38605c8361bee790ad8932", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "A Cost-based Storage Format Selector for Materialization in Big Data Frameworks", "abstract": "Modern big data frameworks (such as Hadoop and Spark) allow multiple users to do large-scale analysis simultaneously. Typically, users deploy Data-Intensive Workflows (DIWs) for their analytical tasks. These DIWs of different users share many common parts (i.e, 50-80%), which can be materialized to reuse them in future executions. The materialization improves the overall processing time of DIWs and also saves computational resources. Current solutions for materialization store data on Distributed File Systems (DFS) by using a fixed data format. However, a fixed choice might not be the optimal one for every situation. For example, it is well-known that different data fragmentation strategies (i.e., horizontal, vertical or hybrid) behave better or worse according to the access patterns of the subsequent operations. \nIn this paper, we present a cost-based approach which helps deciding the most appropriate storage format in every situation. A generic cost-based storage format selector framework considering the three fragmentation strategies is presented. Then, we use our framework to instantiate cost models for specific Hadoop data formats (namely SequenceFile, Avro and Parquet), and test it with realistic use cases. Our solution gives on average 33% speedup over SequenceFile, 11% speedup over Avro, 32% speedup over Parquet, and overall, it provides upto 25% performance gain.", "venue": "arXiv.org", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-06-11", "journal": {"name": "ArXiv", "volume": "abs/1806.03901"}, "authors": [{"authorId": "2240624", "name": "Rana Faisal Munir"}, {"authorId": "48843545", "name": "A. Abelló"}, {"authorId": "144149891", "name": "Oscar Romero"}, {"authorId": "2405035", "name": "Maik Thiele"}, {"authorId": "7337091", "name": "Wolfgang Lehner"}], "citations": [{"paperId": "b8a3f696171c09c0732cf598e63100a0d8d5f360", "title": "Configuring Parallelism for Hybrid Layouts Using Multi-Objective Optimization"}, {"paperId": "ef7fe8f009ec1364145b72954d4461fbc886f7a1", "title": "Automatically Configuring Parallelism for Hybrid Layouts"}, {"paperId": "1b845057a6c900bd920021b2bd3c88e7e3e6e5b9", "title": "ATUN-HL: Auto Tuning of Hybrid Layouts Using Workload and Data Characteristics"}]}
