{"paperId": "7587c29cbe8f8e80d4b690482e3f84a66d0560d5", "publicationVenue": {"id": "8e1bd4b5-d5b2-4e22-ba0a-01fe5568d472", "name": "Remote Sensing", "type": "journal", "alternate_names": ["Remote Sens"], "issn": "2315-4675", "alternate_issns": ["2072-4292"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169233", "alternate_urls": ["https://www.mdpi.com/journal/remotesensing", "http://www.mdpi.com/journal/remotesensing", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169233"]}, "title": "Big Geospatial Data or Geospatial Big Data? A Systematic Narrative Review on the Use of Spatial Data Infrastructures for Big Geospatial Sensing Data in Public Health", "abstract": "Background: Often combined with other traditional and non-traditional types of data, geospatial sensing data have a crucial role in public health studies. We conducted a systematic narrative review to broaden our understanding of the usage of big geospatial sensing, ancillary data, and related spatial data infrastructures in public health studies. Methods: English-written, original research articles published during the last ten years were examined using three leading bibliographic databases (i.e., PubMed, Scopus, and Web of Science) in April 2022. Study quality was assessed by following well-established practices in the literature. Results: A total of thirty-two articles were identified through the literature search. We observed the included studies used various data-driven approaches to make better use of geospatial big data focusing on a range of health and health-related topics. We found the terms ‘big’ geospatial data and geospatial ‘big data’ have been inconsistently used in the existing geospatial sensing studies focusing on public health. We also learned that the existing research made good use of spatial data infrastructures (SDIs) for geospatial sensing data but did not fully use health SDIs for research. Conclusions: This study reiterates the importance of interdisciplinary collaboration as a prerequisite to fully taking advantage of geospatial big data for future public health studies.", "venue": "Remote Sensing", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-06-23", "journal": {"name": "Remote. Sens.", "pages": "2996", "volume": "14"}, "authors": [{"authorId": "35586198", "name": "Keumseok Koh"}, {"authorId": "46824861", "name": "A. Hyder"}, {"authorId": "2109857", "name": "Yogita Karale"}, {"authorId": "49143963", "name": "M. Boulos"}], "citations": [{"paperId": "159052bab6be0689e70091ae383b22818ff2f90a", "title": "Geospatial Big Data for a Sustainable and Green Smart City"}, {"paperId": "56875a6db84296edb22a86ccd511858dc187bd4f", "title": "Improving Crop Mapping by Using Bidirectional Reflectance Distribution Function (BRDF) Signatures with Google Earth Engine"}, {"paperId": "1845f307ee981646d00c0e93089b1949482dc8ca", "title": "Effects of Visual Communication Design Accessibility (VCDA) Guidelines for Low Vision on Public and Open Government Health Data"}]}
