{"paperId": "75920884c8fead8a155e4076eb4e5e79760fe018", "publicationVenue": {"id": "d5b215f3-f737-45b2-875b-df309ce14c43", "name": "Scientific Programming", "type": "journal", "alternate_names": ["Sci Program"], "issn": "1058-9244", "url": "https://www.hindawi.com/journals/sp/", "alternate_urls": ["https://www.iospress.nl/html/10589244.php", "https://www.wiley.com/legacy/compbooks/compjournals/sciprog.html", "http://content.iospress.com/journals/scientific-programming"]}, "title": "Secure Smart Healthcare Monitoring in Industrial Internet of Things (IIoT) Ecosystem with Cosine Function Hybrid Chaotic Map Encryption", "abstract": "The technological progression is raised as a hybrid ecosystem with the industrial Internet of Things (IIoT). Among them, healthcare is also broadly unified with the Internet of Things to develop an industrial forthcoming system. Utilizing this type of system can be facilitating optimum patient monitoring, competent diagnosis, intensive care, and including the appropriate operation against the existing critical diseases. Due to enormous data theft or privacy leakage, security, and privacy towards patient-based informative data, the preservation of personal patients’ informative data has now become a necessity in the digitized community. The produced article is underlined on handsomely monitoring, perceptively extracted keyframe, and further processed lightweight cosine functions using hybrid way chaotic map keyframe image encryption. Initially, a regular concept of extracted keyframe is deployed to salvage meaningful detected frames by transmitting an alert autonomously to the administration. Then, lightweight cosine function for encryption is employed. This encryption incorporates keyframe exceedingly secure and safe from the outside world or any adversary. Our proposed methodology validates effectiveness throughout the IIoT ecosystem. The produced outcome is highly acceptable and has minimum execution time, robustness, and reasonably adopted cost-effective, secure parameter than any other (keyframes) image encryption methods. Furthermore, this methodology has optimally reduced bandwidth, essential communicating price, transmission cost, storage, and immediately judicious analysis of each occurred activity from the outside world or any adversary to remain secure and confident about the real patient-based data in the smartly developed environment.", "venue": "Scientific Programming", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-03-29", "journal": {"name": "Scientific Programming"}, "authors": [{"authorId": "50319941", "name": "Jalaluddin Khan"}, {"authorId": "68972452", "name": "G. Khan"}, {"authorId": "2151965621", "name": "J. Li"}, {"authorId": "3447397", "name": "M. Alajmi"}, {"authorId": "23729239", "name": "A. Haq"}, {"authorId": "2152490091", "name": "Shakir Khan"}, {"authorId": "2088581156", "name": "Naved Ahmad"}, {"authorId": "5854343", "name": "Shadma Parveen"}, {"authorId": "2066575910", "name": "Mohammad Shahid"}, {"authorId": "1492124608", "name": "Sultan Ahmad"}, {"authorId": "67240578", "name": "Mordecai F. Raji"}, {"authorId": "1491245965", "name": "Bilal Ahamad"}, {"authorId": "153182928", "name": "A. Alghamdi"}, {"authorId": "2112239748", "name": "Amjad Ali"}], "citations": [{"paperId": "38cd60e6507a3e899fd07150e303b1fd0baff272", "title": "A non-invasive smart healthcare monitoring system based on the Internet of things"}, {"paperId": "d3c59849c1636aa2e4e042c4ff261d9fc9357c30", "title": "End-to-end security enabled intelligent remote IoT monitoring system"}, {"paperId": "dd41f909de46afadcae411feac35e83e8ce1b355", "title": "A Novel Context-Aware Computing Framework with the Internet of Things and Prediction of Sensor Rank Using Random Neural XG-Boost Algorithm"}, {"paperId": "d6f5178344f0b3334485baf378e4ff0c5f3cbae8", "title": "Security in internet of things: a review on approaches based on blockchain, machine learning, cryptography, and quantum computing"}, {"paperId": "2ac5a1475e0f17b6d3f9238ea42465cc71828fd7", "title": "Internet of Things Based Horizontal Axis Tracking Solar Panel Performance Evaluation"}, {"paperId": "666e2e82c040a69cf221edb4570606e5255fedd5", "title": "Lightweight Security for IoT"}, {"paperId": "e4cb61b5d750c3b895c91512b0bd9f242b2e2f25", "title": "A comprehensive systematic and bibliometric review of the IoT-based healthcare systems"}, {"paperId": "c4a9d8fd89d3cfa9ec3b9c9ec0b339f616d44561", "title": "A Smart Card-Based Two-Factor Mutual Authentication Scheme for Efficient Deployment of an IoT-Based Telecare Medical Information System"}, {"paperId": "f0f4e0dc4d1e6eb33c37332a750ab249febdebe1", "title": "U-Net-Based Models towards Optimal MR Brain Image Segmentation"}, {"paperId": "8a74222877564b611964acedfdf313cf0316563e", "title": "Comparative Analysis of DWT, SLT, and SWT for Source Authentication in Online Social Media"}, {"paperId": "9b468736cdec832a3df953b76397a30b1ca7e1f8", "title": "Deep Learning Based Sensitive Data Detection"}, {"paperId": "c80bfe35c661947f403652b6ed9bb63b6597a939", "title": "Community Detection Approach Via Graph Regularized Non-Negative Matrix Factorization"}, {"paperId": "589f2378b2cc52e0b896144e46eba9c0e5681463", "title": "SAR Target Orientation Estimation Based on Manifold Learning"}, {"paperId": "3ba9ac4cb98ff62e41467a220868a3bc42a8f114", "title": "LFSS-KF: lightweight fast real-time security standards with key fusion for surveillance videos"}, {"paperId": "50fda4fc1c1f65fc56fdb42c74cc06612f1862f7", "title": "Development and Performance Evaluation of a Blockchain Associated E-Voting System in IoT-Enabled Smart-Cities"}, {"paperId": "013b5dab4435237172c099496478fe42b11253c9", "title": "IoMT and blockchain oriented smart healthcare monitoring system"}, {"paperId": "e367edb18f99b8d90fc83ca985c96ca349b76f0c", "title": "Research on Settlement Prediction of Building Foundation in Smart City Based on BP Network"}]}
