{"paperId": "759785be6da465bf63527bfefdd2eb469fe2a912", "publicationVenue": {"id": "29f17448-f8df-47cc-8f0f-f1d0977497b8", "name": "Revista Politécnica", "type": "journal", "alternate_names": ["Rev Politécnica"], "issn": "1900-2351", "url": "https://revistas.elpoli.edu.co/index.php/pol/"}, "title": "Machine learning aplicado al análisis del rendimiento de desarrollos de software", "abstract": "Las pruebas de rendimiento son determinantes para medir la calidad de los desarrollos de software, ya que permiten identificar aspectos que se deben mejorar en pro de alcanzar la satisfacción del cliente. El objetivo de este trabajo fue identificar la técnica óptima de Machine Learning para predecir si un desarrollo de software cumple o no con los criterios de aceptación del cliente. Se empleó una base de datos de información obtenida en pruebas de rendimiento a servicios web y la métrica de calidad F1-score. Se concluye que, a pesar de que la técnica de Random Forest obtuvo el mejor puntaje, no es correcto afirmar que sea la mejor técnica de Machine Learning; la cantidad y la calidad de los datos empleados en el entrenamiento desempeñan un papel de gran importancia, al igual que un procesamiento adecuado de la información. \nPerformance tests are crucial to measure the quality of software developments, since they allow identifying aspects to be improved in order to achieve customer satisfaction. The objective of this research was to identify the optimal Machine Learning technique to predict whether or not a software development meets the customer's acceptance criteria. A dataset with information obtained from web services performance tests and the F1-score quality metric were used. This paper concludes that, although the Random Forest technique obtained the best score, it is not correct to state that it is the best Machine Learning technique; the quantity and quality of the data used in the training play a very important role, as well as an adequate processing of the information.", "venue": "Revista Politécnica", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-04-29", "journal": {"name": "Revista Politécnica"}, "authors": [{"authorId": "2095940502", "name": "V. Gil-Vera"}, {"authorId": "2165045663", "name": "Cristian Seguro-Gallego"}], "citations": []}
