{"paperId": "759a9a202017d6a5083b21a63b762a62bcf8c733", "publicationVenue": null, "title": "Raising the Flag: Monitoring User Perceived Disinformation on Reddit", "abstract": "The truth value of any new piece of information is not only investigated by media platforms, but also debated intensely on internet forums. Forum users are fighting back against misinformation, by informally flagging suspicious posts as false or misleading in their comments. We propose extracting posts informally flagged by Reddit users as a means to narrow down the list of potential instances of disinformation. To identify these flags, we built a dictionary enhanced with part of speech tags and dependency parsing to filter out specific phrases. Our rule-based approach performs similarly to machine learning models, but offers more transparency and interactivity. Posts matched by our technique are presented in a publicly accessible, daily updated, and customizable dashboard. This paper offers a descriptive analysis of which topics, venues, and time periods were linked to perceived misinformation in the first half of 2020, and compares user flagged sources with an external dataset of unreliable news websites. Using this method can help researchers understand how truth and falsehood are perceived in the subreddit communities, and to identify new false narratives before they spread through the larger population.", "venue": "Inf.", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-12-22", "journal": {"name": "Inf.", "pages": "4", "volume": "12"}, "authors": [{"authorId": "105024203", "name": "V. Achimescu"}, {"authorId": "2104102810", "name": "Pavel Dimitrov Chachev"}], "citations": [{"paperId": "59da941bc621760b8241affbc1ea11ced244916c", "title": "A Survey on the Role of Crowds in Combating Online Misinformation: Annotators, Evaluators, and Creators"}, {"paperId": "c64eaf42c0673627f4830d911b0753ae419aedfd", "title": "Temporal Analysis of Misinformation on Parler"}, {"paperId": "452edcee44036eee178e4450680c16e4da36f412", "title": "Wisdom of Two Crowds: Misinformation Moderation on Reddit and How to Improve this Process---A Case Study of COVID-19"}, {"paperId": "1fd67263900d36942b988f68b627e7889c97848d", "title": "Modeling, Evaluating, and Applying the eWoM Power of Reddit Posts"}, {"paperId": "038a236a46d9d9409c4ec80098dc2632db27baea", "title": "Disinformation and Echo Chambers: How Disinformation Circulates on Social Media Through Identity-Driven Controversies"}, {"paperId": "1c82ff00d35bba406abe6ab9cb2cc73394c10953", "title": "Persistence and Attrition among Participants in a Multi-Page Online Survey Recruited via Reddit’s Social Media Network"}, {"paperId": "431241acabca43dd12ee66da4d7ae90160b061fa", "title": "Reddit Users' Experiences of Suicidal Thoughts During the COVID-19 Pandemic: A Qualitative Analysis of r/Covid19_support Posts"}, {"paperId": "9a8cbf6778220845b47f33467b0c4aa6f6e2cb1c", "title": "A Practical Guide to Doing Behavioral Research on Fake News and Misinformation"}, {"paperId": "3ec460ec18867721d4bc9e4178299726a9b3f235", "title": "Misinformation Detection in the Wild: News Source Classification as a Proxy for Non-article Texts"}]}
