{"paperId": "75a8faa6861b7fdd49b36615df1835f1c4bbcb65", "publicationVenue": {"id": "fcbcaf18-8ab1-43e1-a973-604bbc7e344e", "name": "Proceedings of the VLDB Endowment", "type": "journal", "alternate_names": ["Proceedings of The Vldb Endowment", "Proc VLDB Endow", "Proc Vldb Endow"], "issn": "2150-8097", "url": "http://dl.acm.org/toc.cfm?id=J1174", "alternate_urls": ["http://portal.acm.org/toc.cfm?CFID=21632689&CFTOKEN=99329904&WantType=Affiliated%20Organizations&coll=ACM&dl=ACM&id=J1174&idx=J1174&part=affil&title=VLDB%20Endowment&type=periodical"]}, "title": "G-Tran: A High Performance Distributed Graph Database with a Decentralized Architecture", "abstract": "Graph transaction processing poses unique challenges such as random data access due to the irregularity of graph structures, low throughput and high abort rate due to the relatively large read/write sets in graph transactions. To address these challenges, we present G-Tran, a remote direct memory access (RDMA)-enabled distributed in-memory graph database with serializable and snapshot isolation support. First, we propose a graph-native data store to achieve good data locality and fast data access for transactional updates and queries. Second, G-Tran adopts a fully decentralized architecture that leverages RDMA to process distributed transactions with the massively parallel processing (MPP) model, which can achieve high performance by utilizing all computing resources. In addition, we propose a new multi-version optimistic concurrency control (MV-OCC) protocol with two optimizations to address the issue of large read/write sets in graph transactions. Extensive experiments show that G-Tran achieves competitive performance compared with other popular graph databases on benchmark workloads.", "venue": "Proceedings of the VLDB Endowment", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-07-01", "journal": {"name": "Proc. VLDB Endow.", "pages": "2545-2558", "volume": "15"}, "authors": [{"authorId": "2108844303", "name": "Hongzhi Chen"}, {"authorId": "2145413970", "name": "Changji Li"}, {"authorId": "72117196", "name": "Che Zheng"}, {"authorId": "2150609388", "name": "Chenghuan Huang"}, {"authorId": "2115219530", "name": "Juncheng Fang"}, {"authorId": "2116502347", "name": "James Cheng"}, {"authorId": "2151811827", "name": "Jian Zhang"}], "citations": [{"paperId": "ac441cb1810dce8e41d9cd554366b72aa182bf41", "title": "Testing Graph Database Systems via Graph-Aware Metamorphic Relations"}, {"paperId": "e53188a2374237a095fe8c037a463633fc7b07c2", "title": "VeriDKG: A Verifiable SPARQL Query Engine for Decentralized Knowledge Graphs"}, {"paperId": "420f8b01e0ddd3c3f4c5620acbd71e26275786b5", "title": "The Graph Database Interface: Scaling Online Transactional and Analytical Graph Workloads to Hundreds of Thousands of Cores"}, {"paperId": "d1ae4ab5047489c2b010c7ce72262982ad66ad60", "title": "ByteGraph: A High-Performance Distributed Graph Database in ByteDance"}]}
