{"paperId": "75aa3317a7be7d66ab2562924565c9aeab27509d", "publicationVenue": {"id": "da36c48c-5d3a-40f6-934c-14a6dc0fbebc", "name": "International Conference on Information Communication and Management", "type": "conference", "alternate_names": ["ICICM", "Int Conf Inf Commun Manag"]}, "title": "Graph_CC: Accelerator of Connected Component Search in Graph Computing", "abstract": "The connected component algorithm is an important basic algorithm for graph computing, which can be applied to scenarios such as network robustness and social network analysis. The connected component algorithm requires high data access and computation overhead to traverse the entire graph to find all connected components, resulting in intensive random memory access and inefficient use of on-chip memory. In order to solve this problem, this paper studies the influence of three different data organization forms on the cache locality of CC algorithm, and selects the storage form of CSCI format with better cache locality. On this basis, this paper designs a connected component search accelerator that can achieve fast addressing: Graph-CC, which stores indexes and data in separate partitions. Through address calculation, sequential addressing can be achieved, and the addressing mode of data in memory is optimized. Using ego-Facebook, p2p-Gnute11a05, and wiki-Vote graph datasets to complete the prototype test of Graph-CC based on the XCVU9P-L2FLGA2104 development board, the results show that compared with accelerators such as ThunderGP, the computing resources are reduced by 22.48%, and the storage resources are reduced by 35.16%, while the throughput is increased by up to 2.75$\\times$, and the power consumption efficiency is up to 25.4$\\times$.", "venue": "International Conference on Information Communication and Management", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-10-28", "journal": {"name": "2022 7th International Conference on Integrated Circuits and Microsystems (ICICM)", "pages": "441-447"}, "authors": [{"authorId": "3314658", "name": "Junyong Deng"}, {"authorId": "2185585770", "name": "Xiaoliang Fu"}, {"authorId": "2185510101", "name": "Baoxiang Zhang"}, {"authorId": "2197664641", "name": "Junjie Wang"}, {"authorId": "2201799473", "name": "Pan Zhang"}, {"authorId": "150345021", "name": "Xiaoyan Xie"}], "citations": []}
