{"paperId": "75bc11818fc79a1b1130c17ea19aa2a997a58061", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Imbalanced Classification Methods for Student Grade Prediction: A Systematic Literature Review", "abstract": "Student success is essential for improving the higher education system student outcome. One way to measure student success is by predicting students’ performance based on their prior academic grades. Concerning the significance of this area, various predictive models are widely developed and applied to help the institution identify students at risk of failure. However, building a high-accuracy predictive model is challenging due to the dataset’s imbalanced nature, which caused biased results. Therefore, this study aims to review the existing research article by providing a state-of-the-art approach for handling imbalanced classification in higher education, including the best practices of dataset characteristics, methods, and comparative analysis of the proposed algorithms, focusing on student grade prediction context problems. The study also presents the most common balancing methods published from 2015 to 2021 and highlights their impact on resolving imbalanced classification in three approaches: data-level, algorithm-level, and hybrid-level. The survey results reveal that the data-level approach using SMOTE oversampling is broadly applied in determining imbalanced problems for student grade prediction. However, the application of hybrid and feature selection methods supporting the generalization of the predictive model to boost student grade prediction performance is generally lacking. Other than that, some of the strengths and weaknesses of the proposed methods are discussed and summarized for the direction of future research. The outcomes of this review will guide the professionals, practitioners, and academic researchers in dealing with imbalanced classification, mainly in the higher education field.", "venue": "IEEE Access", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "1970-1989", "volume": "11"}, "authors": [{"authorId": "2106625855", "name": "Siti Dianah Abdul Bujang"}, {"authorId": "1749862", "name": "A. Selamat"}, {"authorId": "1755574", "name": "O. Krejcar"}, {"authorId": "6726318", "name": "Farhan Mohamed"}, {"authorId": "9461828", "name": "Lim Kok Cheng"}, {"authorId": "46500168", "name": "P. Chiu"}, {"authorId": "2087905015", "name": "Hamido Fujita"}], "citations": [{"paperId": "b09353cc2e04e01b45136a1c50e553033553e5e5", "title": "Advancements in Machine Learning Techniques for Educational Data Mining: An Overview of Perspectives and Trends"}, {"paperId": "f68b97ad1315869c668bdc2bc5a6d1c9b2bc8d4b", "title": "Sustainable Development of Employability and Skill Development in Outcome-based Education: A Machine Learning Approach"}, {"paperId": "f10603ce7e7a1554cae624c4058e0b03c5231e52", "title": "A Two-Phase Ensemble-Based Method for Predicting Learners’ Grade in MOOCs"}, {"paperId": "221b275c54a3d190514dd3e5a8c2e3e3dc96cfa9", "title": "Early Warning of Student Performance With Integration of Subjective and Objective Elements"}]}
