{"paperId": "75c5ac68b27785a60e46f4f335dd5a08c2ec9c30", "publicationVenue": null, "title": "Edge Computer-Enabled Internet of Vehicle Applications with Secure Computing and Load Balancing", "abstract": "In recent years, the Network of Automobiles has attracted great interests. Several IoV applications have been developed to improve road safety, performance and comfort. A virtualization is a common tool for disruption streaming video. However, cloud computing can cause undue delays in applications sensitive to progressive delays, such as auto/assisted driving and emergency error handling. The beneficial technology is edge computed, which expands processing and storage capacities to the network’s periphery. Throughout this report, we merge mobile agent networks or fixed-point processing domains into defined road networks to establish collaboration for all these machine and intensity implementations in IoVs. IoV is designed to optimize the use of these stratified boundary computation strengths in the idea of technology communication and communication technologies. Moreover, the loss of all nodes and communications, which can have life-threatening implications, is possible in an IoV system that is complicated and dynamic. We are integrating both partial computing offloading and consistent job assignments with a reprocessing system for EC-SDIoV to ensure the IoV services’ fulfilment with high reliability. Since the problem of optimization is built to optimize latency durability by the faulty tolerant particulate swarm protocol. The performance appraisal findings validate that both latency reduction and stability are still feasible under the current scheme.", "venue": "Journal of Physics: Conference Series", "year": 2021, "fieldsOfStudy": ["Physics"], "publicationTypes": ["Conference"], "publicationDate": "2021-07-01", "journal": {"name": "Journal of Physics: Conference Series", "volume": "1964"}, "authors": [{"authorId": "2100738314", "name": "D. Majumder"}, {"authorId": "2285767083", "name": "Mohan Kumar"}, {"authorId": "1938392", "name": "D. Ashoka"}, {"authorId": "2285997804", "name": "Shajin Naragunam"}], "citations": [{"paperId": "4c8aa7ba26737a1e10c0db592d114bc8621f146c", "title": "A Novel Load Balancing Approach in Internet of Vehicles (IoV)"}, {"paperId": "a98908243b8d57e89aa280a7249664209ffaad34", "title": "IoT based Secure Smart Home Automation System"}, {"paperId": "11b6fa3f31a81c70d978b248a3617096895133ff", "title": "An Overview of Deep Learning Techniques for Autonomous Driving Vehicles"}]}
