{"paperId": "75ce4928d5542b58354a4a7bc410f853107c7ee6", "publicationVenue": {"id": "20a3a2f3-532a-4f04-9f3d-1e268e100872", "name": "International Journal of Advanced Computer Science and Applications", "type": "journal", "alternate_names": ["Int J Adv Comput Sci Appl"], "issn": "2156-5570", "url": "http://sites.google.com/site/ijacsa2010/", "alternate_urls": ["http://thesai.org/Publication/Default.aspx", "https://thesai.org/Publications/IJACSA"]}, "title": "Exploring the Challenges and Impacts of Artificial Intelligence Implementation in Project Management: A Systematic Literature Review", "abstract": "—This paper presents a systematic literature review (SLR) investigating the challenges and impacts of implementing artificial intelligence (AI) in project management, specifically mapping them into the process groups defined in the Project Management Body of Knowledge (PMBOK). The study aims to contribute to the understanding of integrating AI in project management and provides insights into the challenges and impacts within each process group. The SLR methodology was applied, and a total of 34 scientific articles were analyzed. The results and analysis reveal the specific challenges and impacts within each process group. In the Initiating Process Group, AI tools and analysis techniques address challenges in risk assessment, cost prediction, and decision-making. The Planning process group benefits from various tools and methodologies that improve risk assessment, project selection, cost estimation, resource allocation, and decision-making. The Execution process group emphasizes the importance of advanced tools and techniques in enhancing productivity, resource utilization, cost reduction, and decision-making. The Monitoring and Controlling process group demonstrates the potential of advanced tools in achieving efficiency, cost reduction, improved quality, and informed decision-making. Lastly, the Closing process group emphasizes the importance of utilizing advanced tools to minimize waste, optimize resource utilization, reduce costs, improve quality, and project closure success. Overall, this research provides valuable insights and strategies for organizations seeking to implement AI in project management, thereby enhancing the potential for success within the PMBOK Process Group.", "venue": "International Journal of Advanced Computer Science and Applications", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "International Journal of Advanced Computer Science and Applications"}, "authors": [{"authorId": "2205933533", "name": "Muhammad Irfan Hashfi"}, {"authorId": "2255681830", "name": "Teguh Raharjo"}], "citations": [{"paperId": "4207fcb9126f77165d27190086782f86812489f1", "title": "Impact of Artificial Intelligence and Internet of Things on Performance Management: A Systematic Review"}, {"paperId": "21333fb7d42ca39d8d13a243b1b02962432cf53e", "title": "Statistically Significant Differences in AI Support Levels for Project Management between SMEs and Large Enterprises"}, {"paperId": "12702f5a2ec0931d91f84814843e6e88fbf2b33b", "title": "Integrating ChatGPT, Bard, and leading-edge generative artificial intelligence in building and construction industry: applications, framework, challenges, and future scope"}]}
