{"paperId": "75e51db1ff2677900d146bab4d5f98f23a8cfed7", "publicationVenue": {"id": "c869678a-e697-4742-9f17-3a28324360d7", "name": "WIREs Water", "type": "journal", "alternate_names": ["Wire Water", "Wiley Interdisciplinary Reviews: Water", "Wiley Interdiscip Rev Water"], "issn": "2049-1948", "url": "http://onlinelibrary.wiley.com/doi/10.1002/wat2.2014.1.issue-1/issuetoc", "alternate_urls": ["http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)2049-1948/issues", "https://onlinelibrary.wiley.com/journal/20491948", "http://wires.wiley.com/WileyCDA/WiresJournal/wisId-WAT2.html"]}, "title": "From rain to data: A review of the creation of monthly and daily station‐based gridded precipitation datasets", "abstract": "Monthly and daily gridded precipitation datasets are one of the most demanded products in climatology and hydrology. These datasets describe the high spatial and temporal variability of precipitation as a continuous surface and for defined periods. However, due to the complex characteristics of precipitation, it is difficult to obtain accurate estimations. Thus, the creation of a gridded dataset from observations requires the comprehensive and precise application of quality control, reconstruction, and gridding procedures. Yet, despite multiple advances, most of the gridded datasets created and published since the mid‐1990s to the present use a wide variety of techniques, methods, and outputs, which can completely change the final representativity of the data. It is, therefore, critical to provide general guidelines for the development of future and more robust gridded datasets based on the data characteristics, geographical factors, and advanced statistical techniques. We identified gaps and challenges for near‐future perspectives and provide guidelines for implementing improved approaches based on the performance of 48 products. Finally, we concluded that, despite better spatial and temporal resolutions, data access, and data processing capabilities, observational coverage remains a challenge. Moreover, scientists should adopt tailored strategies to improve the representativity and uncertainty of the estimates.", "venue": "WIREs Water", "year": 2021, "fieldsOfStudy": ["Environmental Science"], "publicationTypes": ["Review"], "publicationDate": "2021-08-26", "journal": {"name": "Wiley Interdisciplinary Reviews: Water", "volume": "8"}, "authors": [{"authorId": "1399071663", "name": "R. Serrano‐Notivoli"}, {"authorId": "40619789", "name": "E. Tejedor"}], "citations": [{"paperId": "240e0e19c35510965fe197c2b91a0ff7c46aba66", "title": "Validation of global precipitation time series products against tree ring records and remotely sensed vegetation greenness"}, {"paperId": "64de8eb0e431e20f4d6c259ceac47fa049fff681", "title": "Comparison of linear, generalized additive models and machine learning algorithms for spatial climate interpolation"}, {"paperId": "b6d6ac0a67755c8ea7d53720c267c0b9aadc379a", "title": "The influence of spatial patterns in rainfall on shallow landslides"}, {"paperId": "57d002707d977ef393263506d1701ed53bdb8199", "title": "A new long term gridded daily precipitation dataset at high-resolution for Cuba (CubaPrec1)"}, {"paperId": "58ac23783b4661276263bf7bad199830a94b1d11", "title": "Estimating daily precipitation climatology by postprocessing high‐resolution reanalysis data"}, {"paperId": "67089e53fd6b512815d9e28416d161908b1f458a", "title": "bioclim: An R package for bioclimatic classifications via adaptive water balance"}, {"paperId": "149f4a598bb6cc08d82603b790f2873aa624a42a", "title": "Heat and cold waves in mainland Spain: Origins, characteristics, and trends"}]}
