{"paperId": "75fdd9993622a3f252e74aca114a8348c4b8c1e3", "publicationVenue": {"id": "52d976ef-ee21-403d-b8f5-d61cee0e58fb", "name": "Journal of information science", "type": "journal", "alternate_names": ["J inf sci", "Journal of Information Science", "J Inf Sci"], "issn": "0165-5515", "alternate_issns": ["1352-7460", "2228-8457"], "url": "http://jis.sagepub.com/", "alternate_urls": ["https://journals.sagepub.com/home/jis", "https://tci-thaijo.org/index.php/jiskku/index"]}, "title": "Enhancing data quality to mine credible patterns", "abstract": "The importance of big data is widely accepted in various fields. Organisations spend a lot of money to collect, process and mine the data to identify patterns. These patterns facilitate their future decision-making process to improve the organisational performance and profitability. However, among discovered patterns, there are some meaningless and misleading patterns which restrict the effectiveness of decision-making process. The presence of data discrepancies, noise and outliers also impacts the quality of discovered patterns and leads towards missing strategic goals and objectives. Quality inception of these discovered patterns is vital before utilising them in making predictions, decision-making process or strategic planning. Mining useful and credible patterns over social media is a challenging task. Often, people spread targeted content for character assassination or defamation of brands. Recently, some studies have evaluated the credibility of information over social media based on users’ surveys, experts’ judgement and manually annotating Twitter tweets to predict credibility. Unfortunately, due to the large volume and exponential growth of data, these surveys and annotation-based information credibility techniques are not efficiently applicable. This article presents a data quality and credibility evaluation framework to determine the quality of individual data instances. This framework provides a way to discover useful and credible patterns using credibility indicators. Moreover, a new Twitter bot detection algorithm is proposed to classify tweets generated by Twitter bots and real users. The results of conducted experiments showed that the proposed model generates a positive impact on improving classification accuracy and quality of discovered patterns.", "venue": "Journal of information science", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-06-06", "journal": {"name": "Journal of Information Science", "pages": "544 - 564", "volume": "49"}, "authors": [{"authorId": "2113544604", "name": "Muhammad Imran"}, {"authorId": "2117023755", "name": "Adnan Ahmad"}], "citations": [{"paperId": "7aa4b37c0d79d8a589cde5cd1b04cdaaccf6d4d6", "title": "A hesitant fuzzy group decision-making framework with data credibility and strategic evaluations"}, {"paperId": "ef9dcdd18cc1a7b9f2b0eaddb5b673b8662c5b43", "title": "The Problem of Data Extraction in Social Media: A Theoretical Framework"}, {"paperId": "d629a1223b866f61d585fc9c702e724fc5803627", "title": "Environmental Analysis of Hemorrhagic Fever in Iraq Using Machine Learning"}]}
