{"paperId": "7603dcb7769f30284fab3a5e783fa4db036308ac", "publicationVenue": null, "title": "Weighted Distinct Sampling: Cardinality Estimation for SPJ Queries", "abstract": "SPJ (select-project-join) queries form the backbone of many SQL queries used in practice. Accurate cardinality estimation of these queries is thus an important problem, with applications in query optimization, approximate query processing, and data analytics. However, this problem has not been rigorously addressed in the literature, despite the fact that cardinality estimation techniques of the three relational operators, selection, projection, and join, have each been extensively studied (but not when used in combination) in the past 30+ years. The major technical difficulty is that (distinct) projection seems to be difficult to combine with the other two operators when it comes to cardinality estimation. In this paper, we give the first formal study of cardinality estimation for SP queries. While it was studied in a prior work in 2001, there is no guarantee on its optimality. We define a class of algorithms, which we call weighted distinct sampling, for estimating SP query sizes, and show how to find a near-optimal sampling strategy that is away from the optimum only by a lower order term. We then extend it to handling SPJ queries, giving the first non-trivial solution for SPJ cardinality estimation. We have also performed an extensive experimental evaluation to complement our theoretical findings.", "venue": "SIGMOD Conference", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2021-06-09", "journal": {"name": "Proceedings of the 2021 International Conference on Management of Data"}, "authors": [{"authorId": "2087352728", "name": "Yuan Qiu"}, {"authorId": "3057294", "name": "Yilei Wang"}, {"authorId": "144744111", "name": "K. Yi"}, {"authorId": "3245752", "name": "Feifei Li"}, {"authorId": "2152563567", "name": "Bin Wu"}, {"authorId": "1943446516", "name": "Chaoqun Zhan"}], "citations": [{"paperId": "b53e3a987571564332cd0a40da2a8eb164cadb7d", "title": "ALECE: An Attention-based Learned Cardinality Estimator for SPJ Queries on Dynamic Workloads (Extended)"}, {"paperId": "12e8be17e7fba74dbb329a2e42a38bdb7daac456", "title": "Cardinality Estimation Via Learned Dynamic Sample Selection"}, {"paperId": "96cd0d31b6188cae63cab75cbdc67141f158b11e", "title": "Fine-Grained Modeling and Optimization for Intelligent Resource Management in Big Data Processing"}, {"paperId": "f9e0a938f9fa75d2a2c96691d4812516a1ecc388", "title": "Density-optimized Intersection-free Mapping and Matrix Multiplication for Join-Project Operations"}]}
