{"paperId": "76051512a92ca180468bfe88eee1ca6008f16ae4", "publicationVenue": {"id": "d2c01867-9f24-4855-ba69-ec42deb8ae8f", "name": "Journal of Advances in Management Research", "type": "journal", "alternate_names": ["J Adv Manag Res"], "issn": "0972-7981", "url": "https://www.emerald.com/insight/publication/issn/0972-7981", "alternate_urls": ["http://www.emeraldinsight.com/jamr.htm"]}, "title": "NDPD: an improved initial centroid method of partitional clustering for big data mining", "abstract": "PurposeThe K-means (KM) clustering algorithm is extremely responsive to the selection of initial centroids since the initial centroid of clusters determines computational effectiveness, efficiency and local optima issues. Numerous initialization strategies are to overcome these problems through the random and deterministic selection of initial centroids. The random initialization strategy suffers from local optimization issues with the worst clustering performance, while the deterministic initialization strategy achieves high computational cost. Big data clustering aims to reduce computation costs and improve cluster efficiency. The objective of this study is to achieve a better initial centroid for big data clustering on business management data without using random and deterministic initialization that avoids local optima and improves clustering efficiency with effectiveness in terms of cluster quality, computation cost, data comparisons and iterations on a single machine.Design/methodology/approachThis study presents the Normal Distribution Probability Density (NDPD) algorithm for big data clustering on a single machine to solve business management-related clustering issues. The NDPDKM algorithm resolves the KM clustering problem by probability density of each data point. The NDPDKM algorithm first identifies the most probable density data points by using the mean and standard deviation of the datasets through normal probability density. Thereafter, the NDPDKM determines K initial centroid by using sorting and linear systematic sampling heuristics.FindingsThe performance of the proposed algorithm is compared with KM, KM++, Var-Part, Murat-KM, Mean-KM and Sort-KM algorithms through Davies Bouldin score, Silhouette coefficient, SD Validity, S_Dbw Validity, Number of Iterations and CPU time validation indices on eight real business datasets. The experimental evaluation demonstrates that the NDPDKM algorithm reduces iterations, local optima, computing costs, and improves cluster performance, effectiveness, efficiency with stable convergence as compared to other algorithms. The NDPDKM algorithm minimizes the average computing time up to 34.83%, 90.28%, 71.83%, 92.67%, 69.53% and 76.03%, and reduces the average iterations up to 40.32%, 44.06%, 32.02%, 62.78%, 19.07% and 36.74% with reference to KM, KM++, Var-Part, Murat-KM, Mean-KM and Sort-KM algorithms.Originality/valueThe KM algorithm is the most widely used partitional clustering approach in data mining techniques that extract hidden knowledge, patterns and trends for decision-making strategies in business data. Business analytics is one of the applications of big data clustering where KM clustering is useful for the various subcategories of business analytics such as customer segmentation analysis, employee salary and performance analysis, document searching, delivery optimization, discount and offer analysis, chaplain management, manufacturing analysis, productivity analysis, specialized employee and investor searching and other decision-making strategies in business.", "venue": "Journal of Advances in Management Research", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-08-23", "journal": {"name": "Journal of Advances in Management Research"}, "authors": [{"authorId": "152370045", "name": "K. Pandey"}, {"authorId": "2058003111", "name": "D. Shukla"}], "citations": [{"paperId": "c04d06f251b8603f179b41d1e26a84fffaaca163", "title": "Analysis of Machine Learning Based Big Data Mining System for Enterprise Businesses"}]}
