{"paperId": "761606f47dc634db8dd2416bc8dec79cbc0af44e", "publicationVenue": null, "title": "Ten quick tips for bioinformatics analyses using an Apache Spark distributed computing environment", "abstract": "Some scientific studies involve huge amounts of bioinformatics data that cannot be analyzed on personal computers usually employed by researchers for day-to-day activities but rather necessitate effective computational infrastructures that can work in a distributed way. For this purpose, distributed computing systems have become useful tools to analyze large amounts of bioinformatics data and to generate relevant results on virtual environments, where software can be executed for hours or even days without affecting the personal computer or laptop of a researcher. Even if distributed computing resources have become pivotal in multiple bioinformatics laboratories, often researchers and students use them in the wrong ways, making mistakes that can cause the distributed computers to underperform or that can even generate wrong outcomes. In this context, we present here ten quick tips for the usage of Apache Spark distributed computing systems for bioinformatics analyses: ten simple guidelines that, if taken into account, can help users avoid common mistakes and can help them run their bioinformatics analyses smoothly. Even if we designed our recommendations for beginners and students, they should be followed by experts too. We think our quick tips can help anyone make use of Apache Spark distributed computing systems more efficiently and ultimately help generate better, more reliable scientific results.", "venue": "PLoS Comput. Biol.", "year": 2023, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-07-01", "journal": {"name": "PLOS Computational Biology", "volume": "19"}, "authors": [{"authorId": "1702328", "name": "D. Chicco"}, {"authorId": "1685710", "name": "U. F. Petrillo"}, {"authorId": "2534895", "name": "G. Cattaneo"}], "citations": [{"paperId": "6eaac755121acb5689e79e942942dc8000b780f8", "title": "Analyzing distributed Spark MLlib regression algorithms for accuracy, execution efficiency and scalability using best subset selection approach"}]}
