{"paperId": "7625289aa5efe48d67ed559d25ffed69111afc88", "publicationVenue": null, "title": "Light gradient boosting machine with optimized hyperparameters for identification of malicious access in IoT network", "abstract": null, "venue": "Digit. Commun. Networks", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-10-01", "journal": {"name": "Digit. Commun. Networks", "pages": "125-137", "volume": "9"}, "authors": [{"authorId": "2052180355", "name": "Debasmita Mishra"}, {"authorId": "144191254", "name": "B. Naik"}, {"authorId": "2564858", "name": "Janmenjoy Nayak"}, {"authorId": "2145708412", "name": "Alireza Souri"}, {"authorId": "113089111", "name": "Pandit Byomakesha Dash"}, {"authorId": "2120985715", "name": "S. Vimal"}], "citations": [{"paperId": "f52853f1c63df5f4893b1a7a857a901110bc2778", "title": "Machine Learning Algorithms for Power System Sign Classification and a Multivariate Stacked LSTM Model for Predicting the Electricity Imbalance Volume"}, {"paperId": "55b073fe6580e07669aad0fa30b6464e5aa28044", "title": "Optimisation and economic analysis of industrial-scale anaerobic co-digestion (ACoD) of palm oil mill effluent (POME) and decanter cake (DC) using machine learning models: A comparative study of Gradient Boosting Machines (GBM), K-nearest neighbours (KNN), and random forest (RF)"}, {"paperId": "2ea8d278948e91c07d4d509b25468afb4a0ab4fe", "title": "Optimizing age-related hearing risk predictions: an advanced machine learning integration with HHIE-S"}, {"paperId": "db2a6e68097249e98724bf124e1e931bf0b619bc", "title": "Unleashing the power of Bat optimized CNN-BiLSTM model for advanced network anomaly detection: Enhancing security and performance in IoT environments"}, {"paperId": "af5fe62f024c6d58c1ddeffd8f5e413b51c2024a", "title": "An integrated strategy of AEF attribute evaluation for reliable thunderstorm detection"}, {"paperId": "7a315e70e94cf73e318e14a6a37c2ec5486d4b84", "title": "Depression detection for twitter users using sentiment analysis in English and Arabic tweets"}, {"paperId": "aaf3596fc544f0d110ba179b0c642ecd1db36be3", "title": "Optimization of Boosting Classifier Method for Paddy Growth Phase Classification Using Oversampling and Hyperparameter Tuning"}, {"paperId": "61039221156df7cc9dca11c5bdd533e72c2f22b8", "title": "A Deep Learning Methodology for Predicting Cybersecurity Attacks on the Internet of Things"}, {"paperId": "885babf55f106129fadb3966196cd03acc61d887", "title": "A Review on Optimization and Feature Selection Techniques for Data Security in IoT"}, {"paperId": "1e8ccc3909baf44b45161f8ee10bd25a49fc01a1", "title": "A comprehensive study on cybersecurity challenges and opportunities in the IoT world"}, {"paperId": "b7fb1214ea0d277f745c2d64a3dfbc5c790d2f3d", "title": "A novel abstraction for security configuration in virtual networks"}, {"paperId": "6252cc86a3331e6c16a63fef9750e8937e0f047a", "title": "Boosting Algorithm to Handle Unbalanced Classification of PM2.5 Concentration Levels by Observing Meteorological Parameters in Jakarta-Indonesia Using AdaBoost, XGBoost, CatBoost, and LightGBM"}, {"paperId": "696c69a8765e900e25576b9b3c2400a4a27de909", "title": "IGWO-SoE: Improved Grey Wolf Optimization Based Stack of Ensemble Learning Algorithm for Anomaly Detection in Internet of Things Edge Computing"}, {"paperId": "b46277b1449b6ec4f5b21b32668348f8a0f2bd3b", "title": "novel abstraction for security configuration in virtual networks"}]}
