{"paperId": "762943143618dc58b580dc7064f9d8353f28f64d", "publicationVenue": {"id": "e4c2dd82-8546-4599-ad16-eff0542b4e1d", "name": "Mathematical and Computational Applications", "type": "journal", "alternate_names": ["Mathematical & Computational Applications", "Math Comput Appl", "Math  Comput Appl"], "issn": "1300-686X", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-558596", "alternate_urls": ["https://www.mdpi.com/journal/mca", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-558596"]}, "title": "Construction and Modification of Topological Tables for Digital Models of Linear Complexes", "abstract": "Building information systems use topological tables to implement the transition from two-dimensional line drawings of the geometry of buildings to digital three-dimensional models of linear complexes. The topological elements of the complex are named and the topological relations of the complex are described by arranging the element names in topological tables. The efficient construction and modification of topological tables for complete buildings is investigated. The topology of a linear complex with nodes, edges, faces, and cells is described with 12 tables. Three of the tables of a complex are independent of each other and form a basis for the construction of the other tables. A highly efficient construction algorithm with complexity O (number of cells) for typical buildings with an approximately constant number of edges per face and faces per cell of is presented. In practice, building designs and their digital models are frequently modified. A modification algorithm is presented, whose complexity equals that of the construction algorithm. Examples illustrate that the efficient algorithms permit the replacement of the conventional focus on the topology of building components by a focus on the topology of the entire building. A set of properties of the original, which are not explicitly described by the topological tables, for example, the orientation of surfaces and multiply connected domains, are analyzed in the paper. An overview of the research dealing with the topological attributes that are not contained in topological tables concludes the paper.", "venue": "Mathematical and Computational Applications", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2023-03-07", "journal": {"name": "Mathematical and Computational Applications"}, "authors": [{"authorId": "2211033297", "name": "Aleksandr N. Rozhkov"}, {"authorId": "94944028", "name": "V. Galishnikova"}], "citations": []}
