{"paperId": "763488734b9b5f6f475838c43746cf16f3fe5b0a", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Rethinking the Producer-Consumer Relationship in Modern DRAM-Based Systems", "abstract": "Generational improvements to commodity DRAM throughout half a century have long solidified its prevalence as main memory across the computing industry. However, overcoming today's DRAM technology scaling challenges requires new solutions driven by both DRAM producers and consumers. In this paper, we observe that the separation of concerns between producers and consumers specified by industry-wide DRAM standards is becoming a liability to progress in addressing scaling-related concerns. To understand the problem, we study four key directions for overcoming DRAM scaling challenges using system-memory cooperation: (i) improving memory access latencies; (ii) reducing DRAM refresh overheads; (iii) securely defending against the RowHammer vulnerability; and (iv) addressing worsening memory errors. We find that the single most important barrier to advancement in all four cases is the consumer's lack of insight into DRAM reliability. Based on an analysis of DRAM reliability testing, we recommend revising the separation of concerns to incorporate limited information transparency between producers and consumers. Finally, we propose adopting this revision in a two-step plan, starting with immediate information release through crowdsourcing and publication and culminating in widespread modifications to DRAM standards.", "venue": "arXiv.org", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-01-29", "journal": {"name": "ArXiv", "volume": "abs/2401.16279"}, "authors": [{"authorId": "2097715520", "name": "Minesh Patel"}, {"authorId": "51017214", "name": "Taha Shahroodi"}, {"authorId": "2044356504", "name": "Aditya Manglik"}, {"authorId": "11827442", "name": "A. G. Yağlıkçı"}, {"authorId": "2048193264", "name": "Ataberk Olgun"}, {"authorId": "1720701024", "name": "Haocong Luo"}, {"authorId": "2239200492", "name": "Onur Mutlu"}], "citations": []}
