{"paperId": "763c705bcca85b3535e75e22002556b3dcdd9dc0", "publicationVenue": {"id": "d5b215f3-f737-45b2-875b-df309ce14c43", "name": "Scientific Programming", "type": "journal", "alternate_names": ["Sci Program"], "issn": "1058-9244", "url": "https://www.hindawi.com/journals/sp/", "alternate_urls": ["https://www.iospress.nl/html/10589244.php", "https://www.wiley.com/legacy/compbooks/compjournals/sciprog.html", "http://content.iospress.com/journals/scientific-programming"]}, "title": "Advances in an Event-Based Spatiotemporal Data Modeling", "abstract": "Spatiotemporal data are vitally important for the national economy and defense modernization since it is not only an important component of human society and geographical information of the environment but also a key carrier of spatiotemporal information. An event-based spatiotemporal data model and its improvements are employed to model spatiotemporal objects, change history, and change relation, which is the main approach to resolve the spatiotemporal change modeling and has been comprehensively developed in modeling theory and applications. This manuscript studies the event-based spatiotemporal data modeling theory based on three aspects of the cognitive theory, which are the spatiotemporal object, the concept of the spatiotemporal dynamic object, and the spatiotemporal object relationship. Then, the implementation characteristics of the models were analyzed regarding the management of cadastral information, analog natural disaster phenomena, and reasoning. Finally, the key points and difficulties of an event-based spatiotemporal data modeling and prospective developmental trends were discussed to provide insights with spatiotemporal data modeling.", "venue": "Scientific Programming", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-12-14", "journal": {"name": "Sci. Program.", "pages": "3532845:1-3532845:9", "volume": "2021"}, "authors": [{"authorId": "2152512824", "name": "Xinming Zhu"}, {"authorId": "2183241822", "name": "Haiyan Liu"}, {"authorId": "144361328", "name": "Qing Xu"}, {"authorId": "2108309091", "name": "Junnan Liu"}, {"authorId": "2145601917", "name": "Xiaoyang Lihua"}], "citations": []}
