{"paperId": "76442a3a16f09d80deec930f868f2e97a2f5404b", "publicationVenue": {"id": "228761ec-c40a-479b-8309-9dcbe9851bcd", "name": "IEEE Internet of Things Journal", "type": "journal", "alternate_names": ["IEEE Internet Thing J"], "issn": "2327-4662", "url": "https://www.ieee.org/membership-catalog/productdetail/showProductDetailPage.html?product=PER288-ELE", "alternate_urls": ["https://ieeexplore.ieee.org/servlet/opac?punumber=6488907", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6488907", "http://ieee-iotj.org/#"]}, "title": "Tabdoc Approach: An Information Fusion Method to Implement Semantic Interoperability Between IoT Devices and Users", "abstract": "Services generated by various Internet of Things (IoT) devices are in heterogeneous contexts, hindering users from efficient consumption of those services and hence development of IoT. This paper addresses the problems in user-device interaction. A user-device interoperability framework, Tabdoc approach, is hereby established to implement semantic interoperability between IoT devices and users. In this approach, a divide-and-conquer strategy is used; a semantic document representation method for message modeling is devised to guarantee consistent message understanding among different contexts, and a semantic extraction algorithm and a semantic interpretation algorithm are proposed to implement automatic cross-context message processing. The experimental results show promising performance improvements over state-of-the-art methods.", "venue": "IEEE Internet of Things Journal", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-04-01", "journal": {"name": "IEEE Internet of Things Journal", "pages": "1972-1986", "volume": "6"}, "authors": [{"authorId": "153909464", "name": "Shuo Yang"}, {"authorId": "2055787305", "name": "Ran Wei"}], "citations": [{"paperId": "2d50cebd59e2744f226faf3eaf87966226f5e0a1", "title": "A Self-Adaptive Access Control Framework Based on User Attributes Among Heterogeneous Internet of Things Platforms"}, {"paperId": "ee08dc78efe794897d79731dd5e44ad4c5140912", "title": "Resource identifier interoperability among heterogeneous IoT platforms"}, {"paperId": "5e100f0c3b426a101fed984dad2d683e9aaf789a", "title": "A Comprehensive Survey on Interoperability for IIoT: Taxonomy, Standards, and Future Directions"}, {"paperId": "ce306a5dea712ef203db7e7b80b43520023d3998", "title": "Interoperable access framework for internet of things backhauled heterogeneous applications"}, {"paperId": "892c2f9d4c60805991aa770f095210c77e4b8c9d", "title": "Applying Class Distance to Decide Similarity on Information Models for Automated Data Interoperability"}, {"paperId": "0c9170b1f0e77d38232ce27a897bc8b74fe50c0f", "title": "DoCA: A Content-Based Automatic Classification System Over Digital Documents"}, {"paperId": "91f36c4c25df640d19032e71a6691772e5be04a3", "title": "A Bridge between Legacy Wireless Communication Systems and Internet of\n Things"}, {"paperId": "e3b7d1aed464db67e0711517fefca50c6756755a", "title": "Towards lightweight representation of the table semantics for the cross-context information exchange"}, {"paperId": "d78f007ffedb629b1a2493aea18f6f99de9f4afa", "title": "An Empirical Study on System Level Aspects of Internet of Things (IoT)"}]}
