{"paperId": "764e69550e941478ecaf1ec61d6a0a5ec2bf4050", "publicationVenue": {"id": "228761ec-c40a-479b-8309-9dcbe9851bcd", "name": "IEEE Internet of Things Journal", "type": "journal", "alternate_names": ["IEEE Internet Thing J"], "issn": "2327-4662", "url": "https://www.ieee.org/membership-catalog/productdetail/showProductDetailPage.html?product=PER288-ELE", "alternate_urls": ["https://ieeexplore.ieee.org/servlet/opac?punumber=6488907", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6488907", "http://ieee-iotj.org/#"]}, "title": "Low-Latency and Resource-Efficient Service Function Chaining Orchestration in Network Function Virtualization", "abstract": "Recently, network function virtualization (NFV) has been proposed to solve the dilemma faced by traditional networks and to improve network performance through hardware and software decoupling. The deployment of the service function chain (SFC) is a key technology that affects the performance of virtual network function (VNF). The key issue in the deployment of SFCs is proposing effective algorithms to achieve efficient use of resources. In this article, we propose an SFC deployment optimization (SFCDO) algorithm based on a breadth-first search (BFS). The algorithm first uses a BFS-based algorithm to find the shortest path between the source node and the destination node. Then, based on the shortest path, the path with the fewest hops is preferentially chosen to implement the SFC deployment. Finally, we compare the performances with the greedy and simulated annealing (G-SA) algorithm. The experiment results show that the proposed algorithm is optimized in terms of end-to-end delay and bandwidth resource consumption. In addition, we also consider the load rate of the nodes to achieve network load balancing.", "venue": "IEEE Internet of Things Journal", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-07-01", "journal": {"name": "IEEE Internet of Things Journal", "pages": "5760-5772", "volume": "7"}, "authors": [{"authorId": "143847421", "name": "Gang Sun"}, {"authorId": "2109070863", "name": "Zhu Xu"}, {"authorId": "49514984", "name": "Hongfang Yu"}, {"authorId": "2145307270", "name": "Xi Chen"}, {"authorId": "2000026046", "name": "Victor I. Chang"}, {"authorId": "1747034", "name": "A. Vasilakos"}], "citations": [{"paperId": "ea6ec42cd73d0895a2df24686194a73be7e1dd49", "title": "Gradient pyramid mechanism and Nelder-Mead simplex enhanced Colony Predation Algorithm for optimal power flow problems"}, {"paperId": "757e5ec368702dbe1a6402a89342b5c3dcfba8f7", "title": "A new pilot shared method for saving bandwidth cost of OFDM"}, {"paperId": "f993a11be2e5a7635e03b837058456018d87bb39", "title": "Dynamic identification of important nodes in complex networks by considering local and global characteristics"}, {"paperId": "a31dbcbad76babc31b8407779072af1dbf82c406", "title": "Delay-Aware resource allocation to increase efficiency over LTE network for M2M communications in a noisy channel"}, {"paperId": "b426d1f0a5bc6a6c810a40190a558c5921d3b33e", "title": "A novel method for effective intrusion detection based on convolutional speaking neural networks"}, {"paperId": "4a0ae86a2866b3e5706241500b687673a6dc4974", "title": "Innovative deep learning techniques for monitoring aggressive behavior in social media posts"}, {"paperId": "4948aaac4f0c5cdb83300ac24fb7a3dfa583c132", "title": "Towards improving community detection in complex networks using influential nodes"}, {"paperId": "f75db48845b4a8a909f82710bf18c83bc622cf89", "title": "Online Service Function Chain Deployment Method Based on Advantage Actor-Critic Learning"}, {"paperId": "39b37857b806921a543284580099b98e49e59907", "title": "Prediction of evolution behavior of Internet bottleneck delay based on improved Logistic equation"}, {"paperId": "4195a5759f1ef64fb9981fa38f5af33754272d24", "title": "CE-VNE: Constraint escalation virtual network embedding algorithm assisted by graph convolutional networks"}, {"paperId": "38eeb4465a6260ae5f00d7316361a90d7077f9e7", "title": "Large-Scale Service Function Chaining Management and Orchestration in Smart City"}, {"paperId": "398c8c793e1bf94b78fbc0dc0c5918f5029ea3f2", "title": "Service Function Chaining to Support Ultra-Low Latency Communication in NFV"}, {"paperId": "ddfb6061394b2b8a45d3cc17f015415adfc45cab", "title": "Load Balancing of Virtual Network Functions through Packet Delegation"}, {"paperId": "8b17b82e37f65a589726e28d705b224c2d5cda58", "title": "RANCE: A Randomly Centralized and On-Demand Clustering Protocol for Mobile Ad Hoc Networks"}, {"paperId": "63fd2b83ba497961ea7be9463dc214688ebc04ad", "title": "A novel reliable low-latency service function chaining to enable URLLC in NFV"}, {"paperId": "4da92fce9eb09adf841a40a4b517e35a5f27d5cf", "title": "Delay-aware and resource-efficient service function chain mapping in inter-datacenter elastic optical networks"}, {"paperId": "1cefc7a35d7f065e6666ef279115ade86477b44f", "title": "A review on Virtualized Infrastructure Managers with management and orchestration features in NFV architecture"}, {"paperId": "58f232e2721297b90763853203d44a34425fc307", "title": "SFCSim: a network function virtualization resource allocation simulation platform"}, {"paperId": "9f9fe9a035af2e947bd2c1ed2d94e5d13cade7ce", "title": "Service function path selection methods for multi-layer satellite networks"}, {"paperId": "025f9c50f5c4cd0a956f533933e5e08138e4cb31", "title": "A security-aware service function chain deployment method for load balance and delay optimization"}, {"paperId": "6c28065851f020535030663ac839c1e3b5dde391", "title": "Network Function Virtualization and Service Function Chaining Frameworks: A Comprehensive Review of Requirements, Objectives, Implementations, and Open Research Challenges"}, {"paperId": "f10abdd842654e7a4be59b192e8b6b487e813a92", "title": "Resource Management and Security Scheme of ICPSs and IoT Based on VNE Algorithm"}, {"paperId": "1ccddb6422d4dd74556c8b5437a4cd85dd331b80", "title": "Fast recovery for online service function chaining interruption using adaptive migration"}, {"paperId": "b08e3ea387f8232312e285b5382e1a3a9dbe5bdd", "title": "Dynamic Service Function Chaining Orchestration in a Multi-Domain: A Heuristic Approach Based on SRv6"}, {"paperId": "eea4fe360f14e66d4110f41cd80239b0dc9f3cdd", "title": "Joint Virtual Network Topology Design and Embedding for Cybertwin-Enabled 6G Core Networks"}, {"paperId": "b7b725aa1a5f621b464d5071908c0ff9c9ef39be", "title": "Security Service Function Chain Deployment Using a Viterbi-Based Algorithm"}, {"paperId": "fb065a9af2186f271fbb0a9b1518f945dbc40c44", "title": "A multi-stage graph based algorithm for survivable Service Function Chain orchestration with backup resource sharing"}, {"paperId": "5430676d7575231670fe0cca62ff006fa8e5d4f4", "title": "Energy-Aware Service Function Chain Embedding in Edge–Cloud Environments for IoT Applications"}, {"paperId": "0bd858bdd5f79d5da14609967a444a162309d262", "title": "Energy and Cost Efficient Resource Allocation for Blockchain-Enabled NFV"}, {"paperId": "46928dbdec34820f89a5ab63828b6248bf235f88", "title": "Cross-MapReduce: Data transfer reduction in geo-distributed MapReduce"}, {"paperId": "1d9c20e27d1a5b1a4268fa79a13840751ed8020b", "title": "Governing the progress of internet-of-things: Ambivalence in the quest of technology exploitation and user rights protection"}, {"paperId": "a6a8873123c59d3d9e1f081710b21b560d0e461c", "title": "Dynamic Resource Allocation Model for Distribution Operations Using SDN"}, {"paperId": "fbd82ca86e98f8a385564b5a663ebc21155967d1", "title": "A comprehensive survey of load balancing techniques in software-defined network"}, {"paperId": "10320e4befbc71d16a59532d06fe1ccf8dc7059f", "title": "MailLeak: Obfuscation-Robust Character Extraction Using Transfer Learning"}, {"paperId": "7dab04afae0bdb9e1a00e6c4c34241d2c82a0a53", "title": "A Fast and Scalable Authentication Scheme in IoT for Smart Living"}, {"paperId": "67903b5b0298f97bbea07ff6e944d4cbe19e9b42", "title": "A comprehensive survey of service function chain provisioning approaches in SDN and NFV architecture"}, {"paperId": "75847cd20cba6072127f9f5963b01f7c8dd69c44", "title": "InSight2: A Modular Visual Analysis Platform for Network Situational Awareness in Large-Scale Networks"}, {"paperId": "ee379e60fde36bc354ac3cdf37845ab95ff42012", "title": "A deep reinforcement learning-based algorithm for reliability-aware multi-domain service deployment in smart ecosystems"}, {"paperId": "79ea9486ab6144cea1c30f5e2e9396aaf0d5bb3c", "title": "The Programmable Data Plane"}, {"paperId": "de151373b7c73a9a0e25328c82b055334562817e", "title": "A Conceptual Data Model and Its Automatic Implementation for IoT-Based Business Intelligence Applications"}, {"paperId": "c3485565cc4de1d48629913bf3f5d562613a5388", "title": "Improvement of the Fairness of Non-Preemptive Priorities in the Transmission of Heterogeneous Traffic"}, {"paperId": "11ba679a4812d348ecee161d12c89a905e5915ff", "title": "Complex Event Processing for Self-Optimizing Cellular Networks"}, {"paperId": "d36fba2b1b0b4a36dd680cde2f3e0b7f4b27c31f", "title": "A Time-efficient Multi-Protocol Probe Scheme for Fine-grain IoT Device Identification"}, {"paperId": "5938fb9817cc807ded0df8c6daf5dd29e3702e02", "title": "Device-Enhanced MEC: Multi-Access Edge Computing (MEC) Aided by End Device Computation and Caching: A Survey"}, {"paperId": "c9de77ae62a3ef1b6afa0b247c3ec5d083ca5e12", "title": "P4SC: A High Performance and Flexible Framework for Service Function Chain"}]}
