{"paperId": "7652461cea7ed24ebf5ba34fabf0516bab1230f0", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "IoT Vulnerability Assessment for Sustainable Computing: Threats, Current Solutions, and Open Challenges", "abstract": "Over the last few decades, sustainable computing has been widely used in areas like social computing, artificial intelligence-based agent systems, mobile computing, and Internet of Things (IoT). There are social, economic, and commercial impacts of IoT on human lives. However, IoT nodes are generally power-constrained with data transmission using an open channel, i.e., Internet which opens the gates for various types of attacks on them. In this context, several efforts are initiated to deal with the evolving security issues in IoT systems and make them self-sufficient to harvest energy for smooth functioning. Motivated by these facts, in this paper, we explore the evolving vulnerabilities in IoT devices. We provide a state-of-the-art survey that addresses multiple dimensions of the IoT realm. Moreover, we provide a general overview of IoT, Sustainable IoT, its architecture, and the Internet Engineering Task Force (IETF) protocol suite. Subsequently, we explore the open-source tools and datasets for the proliferation in research and growth of IoT. A detailed taxonomy of attacks associated with various vulnerabilities is also presented in the text. Then we have specifically focused on the IoT Vulnerability Assessment techniques followed by a case study on sustainability of Smart Agriculture. Finally, this paper outlines the emerging challenges related to IoT and its sustainability, and opening the doors for the beginners to start research in this promising area.", "venue": "IEEE Access", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "168825-168853", "volume": "8"}, "authors": [{"authorId": "37223979", "name": "Pooja Anand"}, {"authorId": "47724043", "name": "Yashwant Singh"}, {"authorId": "9219040", "name": "A. Selwal"}, {"authorId": "2474250", "name": "M. Alazab"}, {"authorId": "49252696", "name": "S. Tanwar"}, {"authorId": "144996075", "name": "Neeraj Kumar"}], "citations": [{"paperId": "c23d527b882c94ccf7f9ee52735d39c9b3a6e054", "title": "Research Trends in the Use of the Internet of Things in Sustainability Practices: A Systematic Review"}, {"paperId": "9c79e2704ad72c8665e1d60e11e028903ca71a87", "title": "Eco-Friendly Technology Derivation and Planning for Rooftop Greenhouse Smart Farm"}, {"paperId": "80e5c2a9b733b751fa28654777325137091187e8", "title": "Transferability of Machine Learning Algorithm for IoT Device Profiling and Identification"}, {"paperId": "321f7c18e6a0602b285f835203b19f9209e69dde", "title": "Review of EEG-Based Biometrics in 5G-IoT: Current Trends and Future Prospects"}, {"paperId": "b9f329a568f5daa75914b36f31588bdbb19255a5", "title": "Smart Home Automation with Smart Metering using ZigBee Technology and Deep Belief Network"}, {"paperId": "5c00f23f33f39a1bb3797c02e4a3a368ab8bd808", "title": "Harvesting a sustainable future: An overview of smart agriculture's role in social, economic, and environmental sustainability"}, {"paperId": "5c1090858a73516bece7399227d51e6bcf76dc4e", "title": "Machine learning enabled Industrial IoT Security: Challenges, Trends and Solutions"}, {"paperId": "72bfcbd5eded2a5909c49b456f363092893386fc", "title": "AI-based Secure Intrusion Detection Framework for Digital Twin-enabled Critical Infrastructure"}, {"paperId": "8076b56a986c4f5893f9d0fddeed4f0d84507a16", "title": "Security of digital agriculture networks: A review and bibliometric analysis"}, {"paperId": "a00c33abebfce1eed38cfed6e5bf78be65f71ecc", "title": "IoT Vulnerabilities and Attacks: SILEX Malware Case Study"}, {"paperId": "2e44171b3d0d73719f6b581db869b414699d3894", "title": "Automated Security Audit Testbed For IP-Based IoT Devices Without Physical Access"}, {"paperId": "b66ba926ba1f52c4e7318290bad8d7c192a6afb4", "title": "Context-Aware Security in the Internet of Things: What We Know and Where We are Going"}, {"paperId": "a46d2beaae663b619b8619046a064ba381c6edfc", "title": "Blockchain-based privacy and security model for transactional data in large private networks"}, {"paperId": "82d191ec6bbc59da7b6c4a74066f4c9116c74e41", "title": "Vulnerability Data Assessment and Management Based on Passive Scanning Method and CVSS"}, {"paperId": "8a8149943cdee1ea44369c08951aede7a145f2ae", "title": "Energy Efficient, Secure and Spectrum Aware Ultra-Low Power Internet-of-Things System Infrastructure for Precision Agriculture"}, {"paperId": "82cd9f0cc0e318e617a2d1c502915f7c4a83bc64", "title": "Model-based security testing in IoT systems: A Rapid Review"}, {"paperId": "e523dbd5cba2bcda71c58f811543c3499b93e183", "title": "Energy harvesting in self-sustainable IoT devices and applications based on cross-layer architecture design: A survey"}, {"paperId": "000d494dc0b341d559f353d5efb35b09cbc77d2a", "title": "A Novel Approach of a Low-Cost Voltage Fault Injection Method for Resource-Constrained IoT Devices: Design and Analysis"}, {"paperId": "955b05aea555cf4c6bf1def8f20393e8652e9660", "title": "Securing IoT Devices Against Emerging Security Threats: Challenges and Mitigation Techniques"}, {"paperId": "8fb019019a0f97c1f0707a6af8b2d7921cfb3509", "title": "Home IoT Authority Control Method Based on DID Auth"}, {"paperId": "c45413963690b7c931d9fe7451d021d44360c659", "title": "An extensive survey of smart agriculture technologies: Current security posture"}, {"paperId": "344375c97dbc95c2b23f6516912e1eb823df5072", "title": "Toward the internet of things forensics: A data analytics perspective"}, {"paperId": "208dc9d832cf2888b8394d81f658bd856c7a0e81", "title": "Analysis of Consumer IoT Device Vulnerability Quantification Frameworks"}, {"paperId": "2d93bb4f91379a34a81dbab937b96d0abd9cb0e9", "title": "A Systematic Survey: Security Threats to UAV-Aided IoT Applications, Taxonomy, Current Challenges and Requirements With Future Research Directions"}, {"paperId": "a8310cef09d0bdc74cc692aa51107e2376fb2d5d", "title": "Blockchain Technology as a Solution for Vulnerabilities in Internet of Things-A Survey"}, {"paperId": "6c2f2f543eedfea3ca738d227dc8f511d754df8a", "title": "Characteristics of Smart Farms for Architectural Planning and Design"}, {"paperId": "b78f710e979ae528dbb0da29920e7d8eb1980e6e", "title": "D-Score: An Expert-Based Method for Assessing the Detectability of IoT-Related Cyber-Attacks"}, {"paperId": "180407d781a5f57729d88e24431bba50f67c8d03", "title": "IPChain: Blockchain-Based Security Protocol for IoT Address Management Servers in Smart Homes"}, {"paperId": "03ce94ca3fda64e00d39dcfdbca2544b16395773", "title": "Static vulnerability mining of IoT devices based on control flow graph construction and graph embedding network"}, {"paperId": "bab3590a73cf58add75528fc56a5a0414e2b1c37", "title": "Network Based Detection of IoT Attack Using AIS-IDS Model"}, {"paperId": "e66c8ba0751088bca4d0576cde9bc014c3f86b03", "title": "Sustainable Data-Driven Secured Optimization Using Dynamic Programming for Green Internet of Things"}, {"paperId": "d9e71d4fd5cb35ef6d2996ef77ee3b5872994c2e", "title": "Energy System 4.0: Digitalization of the Energy Sector with Inclination towards Sustainability"}, {"paperId": "f13c915d56720c5501de574a3864248c7d9e49ac", "title": "Smart Healthcare System Implementation Challenges: A stakeholder perspective"}, {"paperId": "f483fbc84a129871a25b06137689aade401e1679", "title": "SALT: transfer learning-based threat model for attack detection in smart home"}, {"paperId": "e3a1e1579f31cecb896dcbf0a37640ee951f9e45", "title": "Blockchain for Future Wireless Networks: A Decade Survey"}, {"paperId": "9adaf09b12c093334ffaac0d4010eb22a18c0698", "title": "An Improved Deep Belief Network IDS on IoT-Based Network for Traffic Systems"}, {"paperId": "40e08440960d36952ec9f8ba61d3ba9cc4bcbf0e", "title": "A Blockchain-based Security Architecture for the Internet of Things"}, {"paperId": "b55924278c0349f0ec3d601af57dc888a7a5d9ac", "title": "A Method Based on Deep Learning for the Detection and Characterization of Cybersecurity Incidents in Internet of Things Devices"}, {"paperId": "e7794f88c87260166298d46da972e515858478a0", "title": "Trusting Machine Learning Algorithms in Predicting Malicious Nodes Attacks"}, {"paperId": "1336980a68885a3aa2a14430dcf51160db0d1cdf", "title": "Artificial intelligence for sustainable energy: A contextual topic modeling and content analysis"}, {"paperId": "50371393163480ceebe6aeb059e5a535d25a4a03", "title": "Recent Advances in Evolving Computing Paradigms: Cloud, Edge, and Fog Technologies"}, {"paperId": "cf61f5ff4fbcc953f6d9a97db2d0493ea50b8c2b", "title": "Application of Machine Learning Algorithms in Ensuring Information Security of the Internet of Things in Water Transport"}, {"paperId": "391453413761a841adfd1239bb30ccc86f909bda", "title": "Artificial intelligence for Sustainable Energy: A Contextual Topic Modeling and Content Analysis"}, {"paperId": "2e0641267864c173cddbcbda42d30985a8daa05b", "title": "IVQFIoT: An intelligent vulnerability quantification framework for scoring internet of things vulnerabilities"}, {"paperId": "4c5f5364ddf68df7472e7683735d4697b87ff9e1", "title": "Research on Analysis and Classification of Vulnerability of Electromagnetic Pulse with a STM32 Single-Chip Microcomputer"}, {"paperId": "6e0d1241ddcdab44a0528a2c8ec48d920a2c24b3", "title": "Integrated-Smart Agriculture: Contexts and Assumptions for a Broader Concept"}, {"paperId": "dbd4869ccb59c970a39f2efe0d9f78a9ce575d23", "title": "Internet of Things-assisted E-marketing and distribution framework"}, {"paperId": "3bb2ae803b96dbd05f1840e0b2707838bcdbd25e", "title": "Industrial IoT, Cyber Threats, and Standards Landscape: Evaluation and Roadmap"}, {"paperId": "3bef9493d520ba967d867a83b2d7b4825fbe16aa", "title": "Aerobics player’s energy level monitoring using IoT"}, {"paperId": "4b6c4836d57f21b5ef09aa460838c157ff676965", "title": "Internet of Things: Evolution, Concerns and Security Challenges"}, {"paperId": "39c401d2fd898251a6fc24edc34e56448afdbd92", "title": "A systematic survey on internet of things: Energy efficiency and interoperability perspective"}, {"paperId": "6dec298acd3c0e705ea8be57043184f2e6915467", "title": "Sustainability and Artificial Intelligence: Necessary, Challenging, and Promising Intersections"}, {"paperId": "b1ab7faf7a16821d85afd9b4e101cb4a49dd6ee4", "title": "A Large-Scale Analysis of IoT Firmware Version Distribution in the Wild"}, {"paperId": "c010198f986f31d246f3c0ddc1d54d4a67ffb07c", "title": "Internet of Things (IoT): Vulnerabilities and Remediation Strategies"}, {"paperId": "dcb5b7b245a53110cc553c125c453c859794691f", "title": "LSTM-Based Jamming Detection and Forecasting Model Using Transport and Application Layer Parameters in Wi-Fi Based IoT Systems"}, {"paperId": "6f8573cdc8ec096356c3afe95526f265dce91b8d", "title": "Federated Learning Based Privacy Ensured Sensor Communication in IoT Networks: A Taxonomy, Threats and Attacks"}, {"paperId": "faa696fbbe2e5cdeb38e794e681cd7acbf0971cd", "title": "Smart Agriculture Development and Its Contribution to the Sustainable Digital Transformation of the Agri-Food Sector"}, {"paperId": "2d64879faa6b662ef1ac56d8b27ad82016868f1c", "title": "Retraction Retracted: Research on Analysis and Classification of Vulnerability of Electromagnetic Pulse with a STM32 Single-Chip Microcomputer"}, {"paperId": "8ce060d1c81d54f490eff690aaeede58524752f1", "title": "Anomaly Detection Based on CNN and Regularization Techniques Against Zero-Day Attacks in IoT Networks"}, {"paperId": "441f06604f0da5e7fc8657188e14e7bf20c1dc82", "title": "Cyber Security Challenges in Internet of Things"}, {"paperId": "09f3f60a63a03b11c0135cb5fa5aa82365180a4f", "title": "Internet of Things Applications, Security Challenges, Attacks, Intrusion Detection, and Future Visions: A Systematic Review"}, {"paperId": "301ef5eacc2d758e088e45fd1a05636019b6d0ff", "title": "Application of Machine Learning Algorithms in Agriculture: An Analysis"}, {"paperId": "c9e381755016b1e53ea2b70b841a683a9f8c6ec6", "title": "Integrated-Smart Agriculture | Encyclopedia"}, {"paperId": "16709390ac660b7b44432bf556cae763dc31a3f8", "title": "OPERATIONAL TECHNOLOGY THREATS IN DEVELOPING COUNTRIES AND POSSIBLE SOLUTION"}, {"paperId": "379eb8e92de37b6f91081173a3ca90d9b8b7dbd4", "title": "Metaheuristic Routing: A Taxonomy and Energy-Efficient Framework for Internet of Things"}]}
