{"paperId": "7667bc888de12981cecddfb70faff58f2fbd7c3f", "publicationVenue": {"id": "25248f80-fe99-48e5-9b8e-9baef3b8e23b", "name": "IEEE Transactions on Pattern Analysis and Machine Intelligence", "type": "journal", "alternate_names": ["IEEE Trans Pattern Anal Mach Intell"], "issn": "0162-8828", "url": "http://www.computer.org/tpami/", "alternate_urls": ["http://www.computer.org/portal/web/tpami", "http://ieeexplore.ieee.org/servlet/opac?punumber=34"]}, "title": "Scalable Joint Models for Reliable Uncertainty-Aware Event Prediction", "abstract": "Missing data and noisy observations pose significant challenges for reliably predicting events from irregularly sampled multivariate time series (longitudinal) data. Imputation methods, which are typically used for completing the data prior to event prediction, lack a principled mechanism to account for the uncertainty due to missingness. Alternatively, state-of-the-art joint modeling techniques can be used for jointly modeling the longitudinal and event data and compute event probabilities conditioned on the longitudinal observations. These approaches, however, make strong parametric assumptions and do not easily scale to multivariate signals with many observations. Our proposed approach consists of several key innovations. First, we develop a flexible and scalable joint model based upon sparse multiple-output Gaussian processes. Unlike state-of-the-art joint models, the proposed model can explain highly challenging structure including non-Gaussian noise while scaling to large data. Second, we derive an optimal policy for predicting events using the distribution of the event occurrence estimated by the joint model. The derived policy trades-off the cost of a delayed detection versus incorrect assessments and abstains from making decisions when the estimated event probability does not satisfy the derived confidence criteria. Experiments on a large dataset show that the proposed framework significantly outperforms state-of-the-art techniques in event prediction.", "venue": "IEEE Transactions on Pattern Analysis and Machine Intelligence", "year": 2017, "fieldsOfStudy": ["Medicine", "Computer Science", "Mathematics"], "publicationTypes": ["JournalArticle"], "publicationDate": "2017-08-16", "journal": {"name": "IEEE Transactions on Pattern Analysis and Machine Intelligence", "pages": "1948-1963", "volume": "40"}, "authors": [{"authorId": "2064711501", "name": "Hossein Soleimani"}, {"authorId": "3166500", "name": "J. Hensman"}, {"authorId": "1932128", "name": "S. Saria"}], "citations": [{"paperId": "0f747d0ba59eb57df18ddd6aaa4dc5b8067ad6d9", "title": "Online Learning under Haphazard Input Conditions: A Comprehensive Review and Analysis"}, {"paperId": "1926f091fd6ce415f3cd2eae2f7500a51fb0e86c", "title": "Multinomial belief networks for healthcare data"}, {"paperId": "6ad431b629054fda01bec2bb0287f25d1a1bdb45", "title": "Guaranteed Coverage Prediction Intervals with Gaussian Process Regression"}, {"paperId": "932827b0406195c078d13f2c07c427eddeb6ed61", "title": "Heterogeneous multi-task Gaussian Cox processes"}, {"paperId": "c8c56cd174e8e7fa426e3bcb3fc07e183be6e58b", "title": "Germline mechanisms of immunotherapy toxicities in the era of genome‐wide association studies"}, {"paperId": "16568b42e0167f04a9858af034b4c2f78a4d375e", "title": "Learning Generative RNN-ODE for Collaborative Time-Series and Event Sequence Forecasting"}, {"paperId": "138cfbdb2b4ccf9022f8c4d6f0734dd84cac4490", "title": "Multi-Label Temporal Evidential Neural Networks for Early Event Detection"}, {"paperId": "da06cf349d3adada5d780aae45ae1ac4119cd9aa", "title": "A Deep Learning Architecture for Egocentric Time-to-Saccade Prediction using Weibull Mixture-Models and Historic Priors"}, {"paperId": "7c1e9a366d72f306ddc9e00e65b79bd922e11c1e", "title": "A Survey on Event Prediction Methods from a Systems Perspective: Bringing Together Disparate Research Areas"}, {"paperId": "6d67efb7546706820d1fff3dd11e3f6102ddcd98", "title": "CRU: A Novel Neural Architecture for Improving the Predictive Performance of Time-Series Data"}, {"paperId": "d004b226e20d3453b479507a510a971e893ea1a9", "title": "Mutual-Assistance Learning for Standalone Mono-Modality Survival Analysis of Human Cancers"}, {"paperId": "e7dab3b3e2679108961ac1bbf9960a11b6599e1e", "title": "Lessons in machine learning model deployment learned from sepsis."}, {"paperId": "f27f8a9b77093b10197b77b1da4418f4975d7774", "title": "When can I Speak? Predicting initiation points for spoken dialogue agents"}, {"paperId": "22ea0aa6c750d327529053d66e4f0a9457485402", "title": "Human–machine teaming is key to AI adoption: clinicians’ experiences with a deployed machine learning system"}, {"paperId": "4cf1afc1e27d26a77aca58d7a5ec7fe3d6b7ffad", "title": "Factors driving provider adoption of the TREWS machine learning-based early warning system and its effects on sepsis treatment timing"}, {"paperId": "f7f60fb1ca4fd817bb5b394c65995886c79106e9", "title": "SurvLatent ODE : A Neural ODE based time-to-event model with competing risks for longitudinal data improves cancer-associated Venous Thromboembolism (VTE) prediction"}, {"paperId": "1ae3289f1edd9077d3b137e7edd8f809c2489c21", "title": "Neighborhood Spatial Aggregation MC Dropout for Efficient Uncertainty-Aware Semantic Segmentation in Point Clouds"}, {"paperId": "a8b97a796abc912e20c7c9a978bac05ea5c4960c", "title": "Improving Irregularly Sampled Time Series Learning with Time-Aware Dual-Attention Memory-Augmented Networks"}, {"paperId": "eec5893a1fa5d21362de4de567d0a84137224337", "title": "Tensorial Time Series Prediction via Tensor Neural Ordinary Differential Equations"}, {"paperId": "6cb36845038e3b299b1d9116a90c4fb0f52b657d", "title": "Evaluating Adoption, Impact, and Factors Driving Adoption for TREWS, a Machine Learning-Based Sepsis Alerting System"}, {"paperId": "d3d1d3e4e14e7810e94de4c11eda135bc17bd41f", "title": "Using Machine Learning for Early Prediction of Cardiogenic Shock in Patients with Acute Heart Failure"}, {"paperId": "ad594fcaf59b705180466c14df1aefcdab009dbd", "title": "A Temporal Kernel Approach for Deep Learning with Continuous-time Information"}, {"paperId": "c4d1a9622831594e65f0108324b3c676ac13a1cb", "title": "Document-level event causality identification via graph inference mechanism"}, {"paperId": "c9fa5f9069177800e35a929aaf94870951e6ef86", "title": "Clinician checklist for assessing suitability of machine learning applications in healthcare"}, {"paperId": "13363fecbe9098d8291aa3600e10d81e84d8a39c", "title": "A Survey on Principles, Models and Methods for Learning from Irregularly Sampled Time Series: From Discretization to Attention and Invariance"}, {"paperId": "a38be61e6f7eb0600bbcc0c24901649bdc5542b6", "title": "Multioutput Gaussian Process Modulated Poisson Processes for Event Prediction"}, {"paperId": "798992f88a0cf20d489d6199977b82cc159f276f", "title": "A Comprehensive Evaluation of Multi-task Learning and Multi-task Pre-training on EHR Time-series Data"}, {"paperId": "6cf64152a29a0871427cb1aa8883a86019a6058d", "title": "Reporting and Implementing Interventions Involving Machine Learning and Artificial Intelligence"}, {"paperId": "f8d163033b58317b58a3fd2389e1ac2209be1f40", "title": "Feature engineering with clinical expert knowledge: A case study assessment of machine learning model complexity and performance"}, {"paperId": "d511dcdf04433a8aaaa7e1aa29cfba0636087329", "title": "Flexible Modelling of Longitudinal Medical Data"}, {"paperId": "d54ee2e0590b9c9f44a5a95d84315f58f7fa8724", "title": "Too Many Definitions of Sepsis: Can Machine Learning Leverage the Electronic Health Record to Increase Accuracy and Bring Consensus?"}, {"paperId": "722ee06e247d5f9ca5a2c874b6ac274170e8ad6d", "title": "The Rényi Gaussian Process"}, {"paperId": "16d96c9ae82aff4ee357907311a9b4dd1cbf068d", "title": "Comparison of Automated Sepsis Identification Methods and Electronic Health Record–based Sepsis Phenotyping: Improving Case Identification Accuracy by Accounting for Confounding Comorbid Conditions"}, {"paperId": "f8db5fafc97fdbafe547aae407b2b337f6971454", "title": "Machine Learning and Visualization in Clinical Decision Support: Current State and Future Directions"}, {"paperId": "4eea7f5b0e1365eb7f7354626cc2acb3701e84d2", "title": "Future Event Prediction: If and When"}, {"paperId": "63c99c04869a52ac69850e21732b26d8633852ea", "title": "GRU-ODE-Bayes: Continuous modeling of sporadically-observed time series"}, {"paperId": "0b385532ffe0383fc56d3da8aed7d90e410ce087", "title": "Joint Models for Event Prediction From Time Series and Survival Data"}, {"paperId": "3bcd3a77fc859da833e10dac85706026264f1db8", "title": "Dynamic Measurement Scheduling for Event Forecasting using Deep RL"}, {"paperId": "cce76cc10f3ce01cc4fdca20e4896547bdc44f43", "title": "Can You Trust This Prediction? Auditing Pointwise Reliability After Learning"}, {"paperId": "a7ef9211f77cd6e35c0c31493114ffda44d064be", "title": "Auditing Pointwise Reliability Subsequent to Training"}, {"paperId": "5f8b5c84d006bc6f7d130548ef56bea3f3118eac", "title": "Dynamic Measurement Scheduling for Adverse Event Forecasting using Deep RL"}, {"paperId": "b85c63aa538c65821bb65baad09cac020bb45596", "title": "Prediction of Cardiac Arrest from Physiological Signals in the Pediatric ICU"}, {"paperId": "86adde87714a470c55af58c69ee0b0c8b1a761e4", "title": "Deep Ensemble Tensor Factorization for Longitudinal Patient Trajectories Classification"}, {"paperId": "605e16c4cb3cfbfec1f14196f0e263dceeea6ca3", "title": "Counterfactual Normalization: Proactively Addressing Dataset Shift and Improving Reliability Using Causal Mechanisms"}, {"paperId": "6840f1132021d440c4a19ab6cca07b717a89aac2", "title": "Generalized Spectral Mixture Kernels for Multi-Task Gaussian Processes"}, {"paperId": "449310e3538b08b43227d660227dfd2875c3c3c1", "title": "Neural Ordinary Differential Equations"}, {"paperId": "4a7bf718fc147447378f53bb1462bce0209e90b3", "title": "Heterogeneous Multi-output Gaussian Process Prediction"}, {"paperId": "9c89f239d30890edb71f8e48ca4f7849a8626b77", "title": "Towards AI-assisted Healthcare: System Design and Deployment for Machine Learning based Clinical Decision Support"}, {"paperId": "db9dc311c48d47f81cbe41e2cc6a5aa7b33fd067", "title": "Disease-Atlas: Navigating Disease Trajectories using Deep Learning"}, {"paperId": "9c67de02bb6a881a368c65e5cab1641f1e66c803", "title": "Distribution Reliability Assessment-Based Incremental Learning for Automatic Target Recognition"}, {"paperId": "c1a25afbe74fe6bd76e8c13ec57c65de8e2025a7", "title": "SurvLatent ODE : A Neural ODE based time-to-event model with competing risks for longitudinal data improves cancer-associated Deep Vein Thrombosis (DVT) prediction"}, {"paperId": "8d14e2a057d2b11344d0eadc678584fadd4bdb5d", "title": "DAMA-Net: A Novel Predictive Model for Irregularly Asynchronously and Sparsely Sampled Multivariate Time Series"}, {"paperId": "2ffaa19550cfc4465f424f998866141c8403a739", "title": "Age Time Invariant Features Forecasting Model Time Variant Features ( t = 3 )"}, {"paperId": "fef4ae10ef86be0a234bc865dcde6fb13ce876e3", "title": "GAO-20-215SP, Accessible Version, Artificial Intelligence in Health Care Benefits and Challenges of Machine Learning in Drug Development"}, {"paperId": "04e797d9fa1c8acc4fc8ca635042237f5894ae55", "title": "Gaussian Process-Based Models for Clinical Time Series in Healthcare"}, {"paperId": "660476883f72712eee13cca5a68804ad21d7e8dc", "title": "Counterfactual Normalization: Proactively Addressing Dataset Shift Using Causal Mechanisms"}]}
