{"paperId": "766db91e917209d9b4fe475b6b3bcf715f4a2d5c", "publicationVenue": {"id": "70628d6a-97aa-4571-9701-bc0eb3989c32", "name": "IEEE Transactions on Geoscience and Remote Sensing", "type": "journal", "alternate_names": ["IEEE Trans Geosci Remote Sens"], "issn": "0196-2892", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=36", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=36"]}, "title": "Robust Sliding Window CFAR Detection Based on Quantile Truncated Statistics", "abstract": "In this article, the concept of quantile is introduced and elaborately related to the truncation depth, based on which quantile truncated statistics (QTS) is put forward. The QTS gives a reasonable explanation of truncation depth and makes the selection of truncation depth well-founded and controllable. In addition, maximum likelihood (ML) estimation based on QTS (QTS-MLE) for the probability density function (pdf) parameters is derived. We start the analysis from Weibull background assuming that the shape parameter is known, and then extend it to the case where the shape parameter is unknown. By analyzing the variance and mean square error (MSE) of the estimated parameters in Weibull background, it is found that QTS-MLE has better estimation performance than the MLE based on TS (TS-MLE). On this basis, the constant false alarm rate (CFAR) detector based on QTS-MLE, i.e., QTS-CFAR, is proposed. The analytic expressions of the false alarm rate and detection probability of QTS-CFAR are derived under the Weibull background with known shape parameter. The full CFAR characteristics of TS- and QTS-CFAR detectors in Weibull background with unknown shape parameter are proved by an invariant theory. Monte Carlo simulations show that the QTS-CFAR detector has better antiinterference performance and false alarm control ability in multiple-target environment. Furthermore, the superiority of QTS-CFAR detector is verified by the real data collected by skywave over-the-horizon radar (OTHR). Finally, we present the expression of QTS-MLE for the scale parameter in the Gamma background.", "venue": "IEEE Transactions on Geoscience and Remote Sensing", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Transactions on Geoscience and Remote Sensing", "pages": "1-23", "volume": "60"}, "authors": [{"authorId": "49178343", "name": "Jie Zhou"}, {"authorId": "2012272", "name": "Junhao Xie"}, {"authorId": "1557393469", "name": "X. Liao"}, {"authorId": "2153033671", "name": "Chang Sun"}], "citations": [{"paperId": "27547dd00cdec85673039fe935368fa0b0299cb4", "title": "A Multi-Beam Seafloor Constant False Alarm Detection Method Based on Weighted Element Averaging"}, {"paperId": "d20ff90ce8324607f6a774f50c614f3b867bd6b4", "title": "Superpixel-level CFAR Ship Detection Based on Polarimetric Bilateral Truncated Statistics"}, {"paperId": "959fdcdf0497374014032f2d5de7f568ebc1f4fa", "title": "Robust CFAR Detector Based on KLQ Estimator for Multiple-Target Scenario"}]}
