{"paperId": "767b10f4140f1b945f265eba1d750216566b674c", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "CANsec: A Practical in-Vehicle Controller Area Network Security Evaluation Tool", "abstract": "The Internet of Things (IoT) is an industry-recognized next intelligent life solution that increases the level of comfort, efficiency, and automation for citizens through numerous sensors, smart devices, and cloud stations connected physically. As an important application scenario of IoT, the Internet of Vehicles (IoV) plays an extremely critical role in the intelligent transportation field. In fact, the In-Vehicle Network of smart vehicles that are recognized as the core roles in intelligent transportation is currently the Controller Area Network (CAN). However, the In-Vehicle CAN bus protocol has several vulnerabilities without any encryption, authentication, or integrity checking, which severely threatens the safety of drivers and passengers. Once malicious attackers hack the vehicular gateway and obtain the access right of the CAN, they may control the vehicle based on the vulnerabilities of the CAN bus protocol. Given the severe security risk of CAN, we proposed the CANsec, a practical In-Vehicle CAN security evaluation tool that simulates malicious attacks according to major attack models to evaluate the security risk of the In-Vehicle CAN. We also show a usage case of the CANsec without knowing any information from the vehicle manufacturer.", "venue": "Italian National Conference on Sensors", "year": 2020, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-08-30", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "20"}, "authors": [{"authorId": "1686702789", "name": "Haichun Zhang"}, {"authorId": "2115698149", "name": "Xuejun Meng"}, {"authorId": "2143001039", "name": "Xiong Zhang"}, {"authorId": "2913613", "name": "Zhenglin Liu"}], "citations": [{"paperId": "351377daa011d59b7c4f132d308a08da1eb895c1", "title": "An Effective Ensemble Learning-Based Real-Time Intrusion Detection Scheme for an In-Vehicle Network"}, {"paperId": "cc084d26e0e84e42a047a4c8bee106aeaa958a03", "title": "Lightweight Intrusion Detection Method of Vehicle CAN Bus under Computational Resource Constraints"}, {"paperId": "24082906449fe529033efd79c0c2de1cd6990a07", "title": "Design and Experimental Assessment of Real-Time Anomaly Detection Techniques for Automotive Cybersecurity"}, {"paperId": "e0c60bc7b18c4c5103c0b0a0a138756f19dffa18", "title": "In-Vehicle Intrusion Detection based on Machine Learning"}, {"paperId": "c008f94256e4ce05b080e8ef786360f439e21a54", "title": "CANAttack: Assessing Vulnerabilities within Controller Area Network"}, {"paperId": "420b2f51d1bd8d6b38fb0adb75efbc89f957ef47", "title": "A lightweight-X-authentication protocol over automotive gateway"}, {"paperId": "210fc669b3eec3b8834cd5eed5ecd1703c7226a3", "title": "State-of-the-art survey of in-vehicle protocols and automotive Ethernet security and vulnerabilities."}, {"paperId": "bdacf5e1c202fab8cb0277fe92cb7e0f020bfd7f", "title": "Design of Fault-Tolerant Automotive Gateway Architecture Using MC9S12XDP512 Microcontroller Device"}, {"paperId": "93a9f9dfd09a615241b93465fa8ac13c22efa37e", "title": "Autonomous Vehicles: Sophisticated Attacks, Safety Issues, Challenges, Open Topics, Blockchain, and Future Directions"}, {"paperId": "4a5dcad2fb8bd28d134570568af85d038d9a819c", "title": "VitroBench: Manipulating in-vehicle networks and COTS ECUs on your bench: A comprehensive test platform for automotive cybersecurity research"}, {"paperId": "c105a6ac766bd36793a820b379b41a12ed65db96", "title": "Research on university laboratory network security based on Cloud Computing"}, {"paperId": "8b65c8fdf14c4ed1bf3b66d90a116e63fc3fcbe8", "title": "Autonomous Vehicle Security Enhancement"}, {"paperId": "035618585a7c59daa55d82f490f56388e48c7cc7", "title": "A qualitative cybersecurity analysis of time-triggered communication networks in automotive systems"}, {"paperId": "9228bbad54122923b54a2a30b0474e109186ad40", "title": "Decoding Vehicle Motion Data on the Internal Network"}, {"paperId": "e814fa766d1c2a6be69cb15d35c3235d1edc9f68", "title": "A comparative study of hash algorithms with the prospect of developing a CAN bus authentication technique"}, {"paperId": "4c6881fb47842aecfc2bf73eec28b2c9ee1c10d6", "title": "Classification of Normal and Malicious Traffic Based on an Ensemble of Machine Learning for a Vehicle CAN-Network"}, {"paperId": "a58a403cbe986af93bab363da53084e121007a8e", "title": "Survey on Integrated Vehicular Platforms for Next Generation Mobility"}, {"paperId": "d47f336a7cafee9bf083c1c6c510c78ec0642754", "title": "CANflict: Exploiting Peripheral Conflicts for Data-Link Layer Attacks on Automotive Networks"}, {"paperId": "e431c56942e9c7351f4439226145d63507e5d2e4", "title": "Design and Testing of a Computer Security Layer for the LIN Bus"}, {"paperId": "c25216051d9543c79e5682499554192fd45029ce", "title": "Application of Data Mining in Predictive Analysis of Network Security Model"}, {"paperId": "8a667617e9cfd38523137b6343cf7c461936ba6f", "title": "In-vehicle Network IDS Using Message Time Interval Infrastructure"}, {"paperId": "88e8f093864f63130cf0b0c39011d8590f159227", "title": "A CAN-Bus Lightweight Authentication Scheme"}, {"paperId": "a4a218b48bf476382342780d4c6e16a373659daf", "title": "Adaptive Fault-Tolerant System and Optimal Power Allocation for Smart Vehicles in Smart Cities Using Controller Area Network"}, {"paperId": "eba048c713b831647905682fcfa0035f34489fbc", "title": "Smart vehicle monitoring for detecting anomalies on CAN bus"}, {"paperId": "815ec7c2451c97329c4323dc15d5d67bf31e4fb1", "title": "Optimization of AUTOSAR Communication Stack in the Context of Advanced Driver Assistance Systems †"}, {"paperId": "d99662e3da875116eab6327c46cc2706535073d3", "title": "Dynamic safety measurement-control technology for intelligent connected vehicles based on digital twin system"}, {"paperId": "4dcf0bc8c650d2faf810c80d91fbfd98b8ec2035", "title": "COMPATIBILITY CHECK FOR SERIAL COMMUNICATION PROTOCOLS"}, {"paperId": "eed7a312db9c564f455214f6b9742b2b455ca71b", "title": "A Cyber Security Evaluation Framework for In-Vehicle Electrical Control Units"}]}
