{"paperId": "767e45d2877f05f87151c63157213d18d4028035", "publicationVenue": {"id": "6a8c0041-d0b7-4e32-b52c-33adef005c7e", "name": "Frontiers in Artificial Intelligence", "alternate_names": ["Front Artif Intell"], "issn": "2624-8212", "url": "https://www.frontiersin.org/journals/artificial-intelligence#"}, "title": "Experiments with LDA and Top2Vec for embedded topic discovery on social media data—A case study of cystic fibrosis", "abstract": "Social media has become an important resource for discussing, sharing, and seeking information pertinent to rare diseases by patients and their families, given the low prevalence in the extraordinarily sparse populations. In our previous study, we identified prevalent topics from Reddit via topic modeling for cystic fibrosis (CF). While we were able to derive/access concerns/needs/questions of patients with CF, we observed challenges and issues with the traditional techniques of topic modeling, e.g., Latent Dirichlet Allocation (LDA), for fulfilling the task of topic extraction. Thus, here we present our experiments to extend the previous study with an aim of improving the performance of topic modeling, by experimenting with LDA model optimization and examination of the Top2Vec model with different embedding models. With the demonstrated results with higher coherence and qualitatively higher human readability of derived topics, we implemented the Top2Vec model with doc2vec as the embedding model as our final model to extract topics from a subreddit of CF (“r/CysticFibrosis”) and proposed to expand its use with other types of social media data for other rare diseases for better assessing patients' needs with social media data.", "venue": "Frontiers in Artificial Intelligence", "year": 2022, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-08-18", "journal": {"name": "Frontiers in Artificial Intelligence", "volume": "5"}, "authors": [{"authorId": "13703524", "name": "Bradley Karas"}, {"authorId": "2181838206", "name": "Sue Qu"}, {"authorId": "4955058", "name": "Yanji Xu"}, {"authorId": "2152204281", "name": "Qian Zhu"}], "citations": [{"paperId": "eb1ba93a1289b02e0a78aac7e1eb09777ec9246e", "title": "Topic Extraction: BERTopic's Insight into the 117th Congress's Twitterverse"}, {"paperId": "78bf37a98c705d302eec2b1f7c21232826bdd01a", "title": "Emotional Health and Climate-Change-Related Stressor Extraction from Social Media: A Case Study Using Hurricane Harvey"}, {"paperId": "c3ceb9ff219f39ee222e97801d1e0bd8367008b7", "title": "Insights into the nutritional prevention of macular degeneration based on a comparative topic modeling approach"}, {"paperId": "cb1a6b333ef868a132705f90445081375a94c362", "title": "Modeling Education Studies Indexed in Web of Science Using Natural Language Processing"}, {"paperId": "f7fa47b42531c23f420bd68a066d5a9ae6980f75", "title": "Integrative Rare Disease Profile Creation via NormMap to Advance Rare Disease Research"}, {"paperId": "7453f13ad28d59be14fd8b47750aaffedfc70835", "title": "Make Love or War? Monitoring the Thematic Evolution of Medieval French Narratives"}, {"paperId": "f7c7eb746affac5843751bb4dc4fdb0222f1d40b", "title": "Advancements of Artificial Intelligence Techniques in the Realm About Library and Information Subject—A Case Survey of Latent Dirichlet Allocation Method"}]}
