{"paperId": "7683a86fb7dad95ceef3d5fa5c369a8b10d32a0d", "publicationVenue": null, "title": "Anomaly-based detection Technique using Deep Learning for Internet of Things: A Survey", "abstract": "Cyber-attacks are increasing dramatically and becoming an inevitable threat which is challenging to eliminate. These attacks include broad range of internal intrusions and external intrusions as well as new (zero-day) form of attacks which make the conventional security techniques obsolete. The growth in the volume of emerging cyber threats plays a critical factor that impedes the advances in technologies such as the Internet of things (IoT). IoT has significantly evolved in recent years to improve several aspects of every Industry. However, the vast acceleration toward adopting IoT technology has exacerbated the size of attack surface and magnetized plenty of cyber-attacks. Deep learning (DL) characteristics has motivated investigations to explore the capabilities of DL in perceiving the security of IoT architecture. In this paper, a review is presented on DL approaches used for IoT anomaly-based attacks detection and their effectiveness in conquering the security challenges in IoT environment. In addition, a comparative study is presented to highlight the performance indicators and architecture of each DL technique. Several DL models are used to detect malicious attacks in different IoT areas. Implementing DL methods with relevant vast datasets can significantly resist different security and privacy concerns.", "venue": "2022 International Conference on Innovation and Intelligence for Informatics, Computing, and Technologies (3ICT)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference", "Review"], "publicationDate": "2022-11-20", "journal": {"name": "2022 International Conference on Innovation and Intelligence for Informatics, Computing, and Technologies (3ICT)", "pages": "278-284"}, "authors": [{"authorId": "2198762635", "name": "Hussain Ismaeel"}, {"authorId": "2074454875", "name": "Wael Elmedany"}], "citations": [{"paperId": "3e9b570bd30fb1e02e3a704a6105b93149ad4be6", "title": "Analysis of IoT Security Challenges and Its Solutions Using Artificial Intelligence"}]}
