{"paperId": "768968fa79e9f72ec1e0521787e3814b32599409", "publicationVenue": {"id": "f2c78b1b-6bcc-4700-859b-af9401c02941", "name": "Buildings", "type": "journal", "issn": "0007-3725", "alternate_issns": ["2075-5309"], "url": "https://www.buildings.com/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217973", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217973", "https://www.mdpi.com/journal/buildings"]}, "title": "When Blockchain Meets the AEC Industry: Present Status, Benefits, Challenges, and Future Research Opportunities", "abstract": "Blockchain is regarded as a potential technology for transforming the architecture, engineering, and construction (AEC) industry, and the number of related publications is increasing rapidly. However, a systematic review of blockchain applications in the AEC industry is lacking. The objective of this study was to review the current status of blockchain applications via a bibliometric analysis combined with a systematic literature review. According to related articles collected from databases, the present status of blockchain was analysed with regard to the distribution of articles over publication years, journals, institutions, countries, cooperation networks between authors, keyword co-occurrence networks, and research methodologies. The results indicated that research on blockchain applications is still relatively new and fragmented with regard to several topics. Five areas of benefit were identified: (i) supply chain management, (ii) contract management, (iii) information management, (iv) stakeholder management, and (v) integration management. On the basis of the technology–organisation–environment framework, nine types of challenges were identified. Future research opportunities were proposed according to the research findings. This study contributes to the current body of knowledge and provides guidelines for further research on blockchain applications in the AEC industry.", "venue": "Buildings", "year": 2021, "fieldsOfStudy": ["Business"], "publicationTypes": ["Review"], "publicationDate": "2021-08-06", "journal": {"name": "Buildings"}, "authors": [{"authorId": "49712512", "name": "Mengyuan Cheng"}, {"authorId": "2158131810", "name": "Guoliang Liu"}, {"authorId": "2044318587", "name": "Yongshun Xu"}, {"authorId": "122178544", "name": "Ming-tan Chi"}], "citations": [{"paperId": "e751e5f26d5fd09e29ea225522b8995e8021c5b1", "title": "The challenges of adopting emerging technologies in the AEC industry a literature review and bibliometric analysis"}, {"paperId": "477a3daa24f26ac1afd23207bc04063c81d38dcf", "title": "Investigating barriers to blockchain adoption in construction supply chain management: A fuzzy-based MCDM approach"}, {"paperId": "4626f8f4fd92abe5bcd61a7cd4b971416455b101", "title": "Investigation of barriers and mitigation strategies to blockchain technology implementation in construction industry: an interpretive structural modeling approach"}, {"paperId": "3b154b7cdd3c8ae47b647747b78b18d4f6703a75", "title": "Integrating BIM and Blockchain across construction lifecycle and supply chains"}, {"paperId": "4bd04451b2bc0c4c244a2faa6b1f3555ea3bc251", "title": "Blockchain Applications in Digital Construction Supply Chains"}, {"paperId": "7e5be8027a389dc83ebe60d56fc339982aae1a60", "title": "Blockchain technology in the AEC industry: Scientometric analysis of research activities"}, {"paperId": "7f774056ca253c59d7366e0efde9e395c9ed0813", "title": "Investigating the barriers to the adoption of blockchain technology in sustainable construction projects"}, {"paperId": "7ac0e1c70ff1701e7d43e68e88a56d0f73301d1c", "title": "Knowledge driven approach for smart bridge maintenance using big data mining"}, {"paperId": "69e05aed9a82be304accd90d69f35b634600da77", "title": "Blockchain and its Potential in the Digitization of Land and Real Estate Property Records"}, {"paperId": "4e424627b876393e92ff3121864f893096079bde", "title": "Suitability analysis of consensus protocols for blockchain-based applications in the construction industry"}, {"paperId": "2b11892921ffafb1978933a1542cb513e35f4586", "title": "An analysis of blockchain technology and smart contracts for Building Information Modeling"}, {"paperId": "61003709f2c26b5b0b5a6f500f3f87b49e7fc7a2", "title": "Factors Influencing the Adoption of Blockchain in the Construction Industry: A Hybrid Approach Using PLS-SEM and fsQCA"}, {"paperId": "3ae9091e78374e78b7a6db9fe2ef89529bb6b0cf", "title": "Blockchain in Civil Engineering, Architecture and Construction Industry: State of the Art, Evolution, Challenges and Opportunities"}, {"paperId": "55537c677d5be9c291de1e72b63654543c22b481", "title": "Exploring the Barriers against Using Cryptocurrencies in Managing Construction Supply Chain Processes"}, {"paperId": "9aec76e53fe1734bd1e0e5d5d6817a3f72201993", "title": "Major Barriers and Best Solutions to the Adoption of Ethics and Compliance Program in Chinese International Construction Companies: A Sustainable Development Perspective"}, {"paperId": "a80f845796ebedc9b673177cbe99444a358beeba", "title": "Application of Terrestrial Laser Scanning (TLS) in the Architecture, Engineering and Construction (AEC) Industry"}, {"paperId": "1f27a0417c10ae757737c45584ec600848b63193", "title": "Blockchain-Based Trusted Property Transactions in the Built Environment: Development of an Incubation-Ready Prototype"}, {"paperId": "afb7d56173b5291188fe0321ccbb394effbd61e3", "title": "Blockchain for Supply Chain Management: A Literature Review and Open Challenges"}]}
