{"paperId": "768d4ee7be42710f9fb0689608834483d55ef877", "publicationVenue": {"id": "4a8bbf74-8b02-49b1-ad58-836790bbc79f", "name": "International Conference on Enterprise Information Systems", "type": "conference", "alternate_names": ["ICEIS", "Int Conf Enterp Inf Syst"], "url": "http://www.iceis.org/"}, "title": "Anonylitics: From a Small Data to a Big Data Anonymization System for Analytical Projects", "abstract": "When a company requires analytical capabilities using data that might include sensitive information, it is important to use a solution that protects those sensitive portions, while maintaining its usefulness. An analysis of existing anonymization approaches found out that some of them only permit to disclose aggregated information about large groups or require to know in advance the type of analysis to be performed, which is not viable in Big Data projects; others have low scalability which is not feasible with large data sets. Another group of works are only presented theoretically, without any evidence on evaluations or tests in real environments. To fill this gap this paper presents Anonylitics, an implementation of the k-anonymity principle for small and Big Data settings that is intended for contexts where it is necessary to disclose small or large data sets for applying supervised or non-supervised techniques. Anonylitics improves available implementations of k-anonymity using a hybrid approach during the creation of the anonymized blocks, maintaining the data types of the original attributes, and guaranteeing scalability when used with large data sets. Considering the diverse infrastructure and data volumes managed by current companies, Anonylitics was implemented in two versions, the first one uses a centralized approach, for companies that have small data sets, or large data sets, but good vertical infrastructure capabilities, and a Big Data version, for companies with large data sets and horizontal infrastructure capabilities. Evaluation on different data sets with diverse protection requirements demonstrates that our solution maintains the utility of the data, guarantees its privacy and has a good time-complexity performance.", "venue": "International Conference on Enterprise Information Systems", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-05-03", "journal": {"pages": "61-71"}, "authors": [{"authorId": "3286100", "name": "A. P. Quimbaya"}, {"authorId": "2079178462", "name": "Alejandro Sierra-Múnera"}, {"authorId": "2090410802", "name": "Jaime Mendoza-Mendoza"}, {"authorId": "1416858497", "name": "Julián Malaver-Moreno"}, {"authorId": "2074312387", "name": "Hernán Carvajal"}, {"authorId": "120750028", "name": "Victor Moncayo"}], "citations": [{"paperId": "f137749983a119212dd3d4b0d7927d68906385c5", "title": "A Novel Hybrid Approach for Multi-Dimensional Data Anonymization for Apache Spark"}, {"paperId": "10e30e000b91ec3386fc2a3725814e7daed4936a", "title": "Scalable, High-Performance, and Generalized Subtree Data Anonymization Approach for Apache Spark"}, {"paperId": "7c6590f473ac7af103f7da0779db247dff2523ec", "title": "In-Memory Data Anonymization Using Scalable and High Performance RDD Design"}, {"paperId": "2c9444d95fa4e6289aa367a1e4fe08fac3969c50", "title": "Big Data, Anonymisation and Governance to Personal Data Protection"}, {"paperId": "3abb7f90765dec7ca91445f08be59ba61c3b7fba", "title": "Anonymisation and Compliance to Protection Data: Impacts and Challenges into Big Data"}]}
