{"paperId": "768e886de3f626f2a484a18fbc24773de8621582", "publicationVenue": {"id": "939ba3df-4270-4ba0-ad98-ffe889f3546e", "name": "Processes", "issn": "2227-9717", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-317995", "alternate_urls": ["https://www.mdpi.com/journal/processes", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-317995"]}, "title": "Fuzzy Harmony Search Technique for Cyber Risks in Industry 4.0 Wireless Communication Networks", "abstract": "Industry 4.0 houses diverse technologies including wireless communication and shared networks for internal and external operations. Due to the wireless nature and remote operability, the exposure to security threats is high. Cyber risk detection and mitigation are prominent for secure industrial operations and planned outcomes. In addition, the system faces the threat of intelligence attacks, security standards issues, privacy concerns and scalability problems. The cyber risk related research problems influence overall data transmission in industry wireless communication networks. For augmenting communication security through cyber risk detection, this article introduces an Explicit Risk Detection and Assessment Technique (ERDAT) for cyber threat mitigation in the industrial process. A fuzzy harmony search algorithm powers this technique for identifying the risk and preventing its impact. The harmony search algorithm mimics the adversary impact using production factors such as process interruption or halting and production outcome. The search performs a mimicking operation for a high objective function based on production output for the admitted plan. The fuzzy operation admits the above factors for identifying the cyber impacting risk, either for its impacts or profitable outcome. In this process, the fuzzy optimization identifies the maximum or minimum objective output targeted for either outcome or risk interrupts, respectively. The fuzzy threshold is identified using a mediated acceptable range, computed as the ratio between minimum and maximum, mimicking occurrences between the risk and scheduled production outcomes. Therefore, the mimicking crossing or falling behind the threshold for the interruption/halting or production, respectively, are identified as risks and their source is detected. The detection communication source is disconnected from the industrial process for preventing further adversary impacts. The introduced system achieves 8.52% high-risk detection, 12.5% fewer outcome interrupts, 8.3% fewer halted schedules, 8.08% less interrupt span, and 7.94% less detection time compared to traditional methods.", "venue": "Processes", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-03-20", "journal": {"name": "Processes"}, "authors": [{"authorId": "2989645", "name": "Z. Diao"}, {"authorId": "3003954", "name": "Fanglei Sun"}], "citations": []}
