{"paperId": "76a32680960dfc9f2abc395cd41d11a5296463ec", "publicationVenue": {"id": "9448f839-459b-45f3-8573-5eff3f032334", "name": "USENIX Annual Technical Conference", "type": "conference", "alternate_names": ["USENIX Annu Tech Conf", "USENIX", "USENIX ATC"], "url": "https://www.usenix.org/conferences/byname/131"}, "title": "Placement of Virtual Containers on NUMA systems: A Practical and Comprehensive Model", "abstract": "Our work addresses the problem of placement of threads, or virtual cores, onto physical cores in a multicore NUMA system. Different placements result in varying degrees of contention for shared resources, so choosing the right placement can have a large effect on performance. Prior work has studied this problem, but either addressed hardware with specific properties, leaving us unable to generalize the models to other systems, or modeled much simpler effects than the actual performance in different placements. Our contribution is a general framework for reasoning about workload placement on machines with shared resources. It enables us to build an accurate performance model for any machine with a hierarchy of known shared resources automatically, with only minimal input from the user. Using our methodology, data center operators can minimize the number of NUMA (CPU+memory) nodes allocated for an application or a service, while ensuring that it meets performance objectives.", "venue": "USENIX Annual Technical Conference", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2018-07-11", "journal": {"pages": "281-294"}, "authors": [{"authorId": "3009139", "name": "Justin R. Funston"}, {"authorId": "2105186800", "name": "Maxime Lorrillere"}, {"authorId": "1679976", "name": "Alexandra Fedorova"}, {"authorId": "2526126", "name": "Baptiste Lepers"}, {"authorId": "2880503", "name": "D. Vengerov"}, {"authorId": "2160840", "name": "Jean-Pierre Lozi"}, {"authorId": "1679769", "name": "Vivien Quéma"}], "citations": [{"paperId": "c851cf4982f3cdb238354affb9b04927f15c66b7", "title": "Adapt Burstable Containers to Variable CPU Resources"}, {"paperId": "d8bc509529f44b97f1b2f5a39dfd5c6a93c5a2de", "title": "Blender: A Container Placement Strategy by Leveraging Zipf-Like Distribution Within Containerized Data Centers"}, {"paperId": "76d418eb247edc049df9f8c7a7d206dc00a31b5e", "title": "CIMAR, NIMAR, and LMMA: Novel algorithms for thread and memory migrations in user space on NUMA systems using hardware counters"}, {"paperId": "a4f4322e723862e571d371e109a05de5774e4fb7", "title": "Octans: Optimal Placement of Service Function Chains in Many-Core Systems"}, {"paperId": "bdf5bbd1ffd8732f963215205eb365a876887c19", "title": "Improving Prediction Accuracy of Memory Interferences for Multicore Platforms"}, {"paperId": "e6b39782c9099cb4997c23726ba13f38dade4aff", "title": "LG-RAM: Load-aware global resource affinity management for virtualized multicore systems"}, {"paperId": "4078de0f4530d5445c22df480f3914fbdc972a05", "title": "Toward Efficient In-memory Data Analytics on NUMA Systems"}, {"paperId": "8a9a9adc7c609e48b76e371302c413dd6895b0a9", "title": "vDARM: Dynamic Adaptive Resource Management for Virtualized Multiprocessor Systems"}]}
