{"paperId": "76abb37b5639b2f7e2f515f7ecfb5129f9510d96", "publicationVenue": {"id": "9333a27b-3e39-480d-80bd-e577d8e6f6dd", "name": "Geoscientific Model Development", "type": "journal", "alternate_names": ["Geosci Model Dev"], "issn": "1991-959X", "url": "https://www.geosci-model-dev.net/", "alternate_urls": ["http://geoscientific-model-development.net/", "https://www.geoscientific-model-development.net/"]}, "title": "TempestExtremes v2.1: a community framework for feature detection, tracking, and analysis in large datasets", "abstract": "Abstract. TempestExtremes (TE) is a multifaceted framework for feature detection, tracking, and scientific analysis of regional or global Earth system datasets on either rectilinear or unstructured/native grids. Version 2.1 of the TE framework now provides extensive support for examining both nodal (i.e., pointwise) and areal features, including tropical and extratropical cyclones, monsoonal lows and depressions, atmospheric rivers, atmospheric blocking, precipitation clusters, and heat waves. Available operations include nodal and areal thresholding, calculations of quantities related to nodal features such as accumulated cyclone energy and azimuthal wind profiles, filtering data based on the characteristics of nodal features, and stereographic compositing. This paper describes the core algorithms (kernels) that have been added to the TE framework since version 1.0, including algorithms for editing pointwise trajectory files, composition of fields around nodal features, generation of areal masks via thresholding and nodal features, and tracking of areal features in time. Several examples are provided of how these kernels can be combined to produce composite algorithms for evaluating and understanding common atmospheric features and their underlying processes. These examples include analyzing the fraction of precipitation from tropical cyclones, compositing meteorological fields around extratropical cyclones, calculating fractional contribution to poleward vapor transport from atmospheric rivers, and building a climatology of atmospheric blocks.\n", "venue": "Geoscientific Model Development", "year": 2021, "fieldsOfStudy": ["Geology"], "publicationTypes": null, "publicationDate": "2021-08-13", "journal": {"name": "Geoscientific Model Development"}, "authors": [{"authorId": "12334455", "name": "P. Ullrich"}, {"authorId": "65936958", "name": "C. Zarzycki"}, {"authorId": "71706548", "name": "E. McClenny"}, {"authorId": "38119091", "name": "M. Pinheiro"}, {"authorId": "108727549", "name": "A. Stansfield"}, {"authorId": "12037037", "name": "K. Reed"}], "citations": [{"paperId": "7b333b9588f1da2c3b667efe7d1839a1d5f64a22", "title": "DCMIP2016: the tropical cyclone test case"}, {"paperId": "d55be08295f8974cb2683ebf7420ec37ee417663", "title": "CyTRACK: An open-source and user-friendly python toolbox for detecting and tracking cyclones"}, {"paperId": "c3b57ee27561189b07141f24533020cfea9695b9", "title": "Tropical Cyclones on Tidally Locked Rocky Planets: Dependence on Rotation Period"}, {"paperId": "03da156feeff0de2366bbbf39a960ae9db2f5ce0", "title": "Scalable Feature Extraction and Tracking (SCAFET): a general framework for feature extraction from large climate data sets"}, {"paperId": "fc3f7ee976c45476d8e4ce1a16df2b8e5d214e79", "title": "Present‐Day Regional Antarctic Sea Ice Response to Extratropical Cyclones"}, {"paperId": "3c720b57a3b28f65a52ab0687ac3b6a0832a8775", "title": "Evaluating Mesoscale Convective Systems Over the US in Conventional and Multiscale Modeling Framework Configurations of E3SMv1"}, {"paperId": "5e5af196d9ca977e5751b3c57acdd856060e4b3f", "title": "Evaluating the Water Cycle Over CONUS at the Watershed Scale for the Energy Exascale Earth System Model Version 1 (E3SMv1) Across Resolutions"}, {"paperId": "83e03e2803adad37bdc432e7cac5a107109c127d", "title": "Climate Change Signal in Atlantic Tropical Cyclones Today and Near Future"}, {"paperId": "f35919a72f783c489adf7f9e778ef871f387e2fb", "title": "The Multi‐Scale Interactions of Atmospheric Phenomenon in Mean and Extreme Precipitation"}, {"paperId": "2eae064500e0583ced8ad38589b7b537a7e49d6d", "title": "Spatiotemporally Adaptive Compression for Scientific Dataset with Feature Preservation – A Case Study on Simulation Data with Extreme Climate Events Analysis"}, {"paperId": "389ccf97fa3fff2768d9b2cab7fc6af8b9e84963", "title": "Continental United States climate projections based on thermodynamic modification of historical weather"}, {"paperId": "1071b057067ac1f9e1560d22ffbb1d29f99fd701", "title": "Increased amplitude of atmospheric rivers and associated extreme precipitation in ultra-high-resolution greenhouse warming simulations"}, {"paperId": "09aaa6e500817a224ccced297f29e315bf11d1e0", "title": "Recent advances in seasonal and multi-annual tropical cyclone forecasting"}, {"paperId": "27f817e51087761da7450b6676602d2f607efdb4", "title": "Assessing the representation of tropical cyclones in ERA5 with the CNRM tracker"}, {"paperId": "80a4ec6089b10746eeaa66de1ffb2011103d602f", "title": "Connecting Large‐Scale Meteorological Patterns to Extratropical Cyclones in CMIP6 Climate Models Using Self‐Organizing Maps"}, {"paperId": "b4d47f51401ed2fb3211010301bccd70e839bd64", "title": "A composite approach to produce reference datasets for extratropical cyclone tracks: application to Mediterranean cyclones"}, {"paperId": "4a2f8f94b7872871bea0cefe4500a2bf101af6af", "title": "The fully coupled regionally refined model of E3SM version 2: overview of the atmosphere, land, and river results"}, {"paperId": "a3b954912005ef22cd103b99d16d07b07f08ec76", "title": "Chasing rainfall: estimating event precipitation along tracks of tropical cyclones via reanalysis data and in-situ gauges"}, {"paperId": "625f340015e9239dca6ae1ec7de0235cc737d930", "title": "Evaluating the Simulation of CONUS Precipitation by Storm Type in E3SM"}, {"paperId": "9b352af8eb717774726b239fd250e4371046d141", "title": "Tropical Cyclone Genesis Potential Indices in a New High‐Resolution Climate Models Ensemble: Limitations and Way Forward"}, {"paperId": "2b5b29d549c895d71ec0217590f09ac22c916eb5", "title": "Global tropical cyclone precipitation scaling with sea surface temperature"}, {"paperId": "5228c9fd5144cc6cab7e59b10bb1328debea421d", "title": "PyFLEXTRKR: a flexible feature tracking Python software for convective cloud analysis"}, {"paperId": "37f2afba795b1b9bf88e0b2c4add828e881b8193", "title": "Process-oriented diagnostics: principles, practice, community development and common standards"}, {"paperId": "869f9bfb3ca6c77868f99ce0510b8719dda0ede8", "title": "Correcting biases in tropical cyclone intensities in low-resolution datasets using dynamical systems metrics"}, {"paperId": "e95fb046d9862f8e24278ea148aa46e3de37698e", "title": "Unsupervised Discovery of Extreme Weather Events Using Universal Representations of Emergent Organization"}, {"paperId": "e1b16f0597c00a07f0d17fa49fa37b7d996e933c", "title": "Statistics of extreme events in coarse-scale climate simulations via machine learning correction operators trained on nudged datasets"}, {"paperId": "d69943e138007d0b704ec06759482665c13212f9", "title": "Increased U.S. coastal hurricane risk under climate change"}, {"paperId": "3c0e33573adebd3bdb3c58b289b529c7e20bbe28", "title": "The June 2012 North American Derecho: A Testbed for Evaluating Regional and Global Climate Modeling Systems at Cloud‐Resolving Scales"}, {"paperId": "600dc2d54870e4e8a0b3ce2433f7245c4a426d0d", "title": "Understanding Precipitation Bias Sensitivities in E3SM‐Multi‐Scale Modeling Framework From a Dilution Framework"}, {"paperId": "0f82782687ccb7f6f0de400482a2577676777126", "title": "Role of Tropical Cyclones in Determining ENSO Characteristics"}, {"paperId": "11b0d109604b6c70e1aaa2de2d6503e2802569ed", "title": "Bias Analysis in the Simulation of the Western North Pacific Tropical Cyclone Characteristics by Two High-Resolution Global Atmospheric Models"}, {"paperId": "40d00347370d1c22c12e0f4d9a2d4aaa886f7514", "title": "Tropical cyclone strength, precipitation, and environment in variable resolution CAM-MPAS simulations over Western North Pacific"}, {"paperId": "60bf61451e21b5065c8374685d469593453b293e", "title": "The Initial Mesoscale Vortexes Leading to the Formation of Tropical Cyclones in the Western North Pacific"}, {"paperId": "b753216e3ae8b462a40292ebc2503f6597535385", "title": "The E3SM Diagnostics Package (E3SM Diags v2.7): a Python-based diagnostics package for Earth system model evaluation"}, {"paperId": "b9348e946e4414325d236e4261bdebb7101330b4", "title": "A methodology for attributing severe extratropical cyclones to climate change based on reanalysis data: the case study of storm Alex 2020"}, {"paperId": "f79db8dff6721e6a73306dcc1bc9ae8a852bdc23", "title": "Increasing Hurricane Intensification Rate Near the US Atlantic Coast"}, {"paperId": "0f8b8a383976a68c924ee85277a8a4f80733c94f", "title": "Exploring Cyclone Evolution with Hierarchical Features"}, {"paperId": "7f16c1ee79347520fa2b2cd15cfb4a550ca7e738", "title": "Intercomparison of four algorithms for detecting tropical cyclones using ERA5"}, {"paperId": "6724105c5f5495aece55427751314b62bd8c9747", "title": "Metrics as tools for bridging climate science and applications"}, {"paperId": "2ac2b62c39409f6b0edff89f7ab38b3ecea8bfed", "title": "Region-adaptive, Error-controlled Scientific Data Compression using Multilevel Decomposition"}, {"paperId": "7b3362b4e2d513e366c15968004d74ca33999056", "title": "Attribution of 2020 hurricane season extreme rainfall to human-induced climate change"}, {"paperId": "38cc91c355ef8fc378685fd7fb60abdcaeb51158", "title": "Tropical Cyclone Precipitation Response to Surface Warming in Aquaplanet Simulations With Uniform Thermal Forcing"}, {"paperId": "8fac9b7a6db4a0c1aaf0b4931d37cad73273e417", "title": "Effect of Horizontal Resolution on the Simulation of Tropical\nCyclones in the Chinese Academy of Sciences FGOALS-f3 Climate\nSystem Model"}, {"paperId": "e7a2c7f16aad91d0ade8a1c524447a0aa852e72b", "title": "Using variable-resolution grids to model precipitation from atmospheric rivers around the Greenland ice sheet"}, {"paperId": "dd2a77e463e60b88885fb772cf9f1832aa4bae5f", "title": "Intercomparison of Four Tropical Cyclones Detection Algorithms on ERA5"}, {"paperId": "cdd7247d628c6a6a2f4f2e8b6f248ff40f3cf36e", "title": "Meteorological Drivers of North American Monsoon Extreme Precipitation Events"}, {"paperId": "1f17c56b8e980aaa22e50363abd38ba72b9a4ea1", "title": "Process-Oriented Diagnostics Principles, Practice, Community Development, and Common Standards"}]}
