{"paperId": "76c259cd0e5c4db7d133695ef5a7688062da4a8d", "publicationVenue": {"id": "6175efe8-6f8e-4cbe-8cee-d154f4e78627", "name": "Mathematics", "issn": "2227-7390", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-283014", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-283014", "https://www.mdpi.com/journal/mathematics"]}, "title": "Benchmarking Maintenance Practices for Allocating Features Affecting Hydraulic System Maintenance: A West-Balkan Perspective", "abstract": "As a consequence of the application advanced maintenance practices, the theoretical probability of failures occurring is relatively low. However, observations of low levels of market intelligence and maintenance management have been reported. This comprehensive study investigates the determinants of maintenance practices in companies utilising hydraulic machinery, drawing on empirical evidence from a longitudinal questionnaire-based survey across the West-Balkan countries. This research identifies critical predictors of technical and sustainable maintenance performance metrics by employing the CA-AHC (Correspondence Analysis with Agglomerative Hierarchical Clustering) method combined with non-parametric machine learning models. Key findings highlight the significant roles of the number of maintenance personnel employed; equipment size, determined on the basis of nominal power consumption; machinery age; and maintenance activities associated with fluid cleanliness in influencing hydraulic machine maintenance outcomes. These insights challenge current perceptions and introduce novel considerations with respect to aspects such as equipment size, maintenance skills and activities with the aim of preserving peak performance. However, the study acknowledges the variability resulting from differing operational conditions, and calls for further research for broader validation. As large-scale heterogeneous datasets are becoming mainstream, this research underscores the importance of using multidimensional data analysis techniques to better understand operational outcomes.", "venue": "Mathematics", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-09-05", "journal": {"name": "Mathematics"}, "authors": [{"authorId": "80320630", "name": "Marko Dragan Orošnjak"}, {"authorId": "101824233", "name": "Dragoljub Šević"}], "citations": [{"paperId": "e8d104913b553fa7eda344ef849ccd9882ce3fba", "title": "From Signals to Insights: Uncovering Latent Degradation with Deep Learning as a Stepping Stone Towards Digital Twins of Failures (DTFs)"}]}
