{"paperId": "76dacb1850b768ae396339d06b15b34a624f1d5b", "publicationVenue": {"id": "3b4e0d11-3211-4ead-848c-99928b5ef30e", "name": "IEEE Network", "type": "journal", "alternate_names": ["IEEE Netw"], "issn": "0890-8044", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=65"}, "title": "Crowdsensing-Based Personalized Dynamic Route Planning for Smart Vehicles", "abstract": "Current route planning systems report to the driver routes based on expected travel time and distance. However, these systems do not provide individualized routing options. With the current routing systems lacking the provision of individualized routing choices, a routing framework which provides a personalized route option not solely based on time and distance would be a step up. With the expanding sensing and computing capabilities in both vehicles and smart devices along with the promising low-latency of 5G networks, a real-time personalized route planner is achievable. In this article, a route planning framework that utilizes the in-vehicle and smartphone sensors to build a crowdsensed database on road surface quality and the driver's personalized skillfulness in different driving environments is proposed. Such databases are leveraged to provide drivers with routing options based on their personal preferences. This framework is tested and validated through a case study of a real driving scenario in Kingston, Ontario to show the framework capabilities compared to conventional route planning.", "venue": "IEEE Network", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-03-27", "journal": {"name": "IEEE Network", "pages": "216-223", "volume": "34"}, "authors": [{"authorId": "50686568", "name": "Abdalla E. Abdelrahman"}, {"authorId": "1403864503", "name": "Amr S. El-Wakeel"}, {"authorId": "153052913", "name": "A. Noureldin"}, {"authorId": "35725657", "name": "H. Hassanein"}], "citations": [{"paperId": "600618031bc84c6e3767b5258bc7931f47ea9b28", "title": "Federated Learning in Intelligent Transportation Systems: Recent Applications and Open Problems"}, {"paperId": "028276800ea153287a8d62a147e69cbe799e1e19", "title": "Human-Centered Traffic Management Supporting Smart Cities and the Metaverse"}, {"paperId": "388fb5003e4fbddd1c190513a3e24bba05c0af30", "title": "Development of a Dynamically Adaptable Routing System for Data Analytics Insights in Logistic Services"}, {"paperId": "207b7854fcb52ad1bed87cd9cb8219215a05a05c", "title": "Privacy-Preserving and Customization-Supported Data Aggregation in Mobile Crowdsensing"}, {"paperId": "a0eddbf11ae4e944fedf54bc44081e6cf9fceabe", "title": "Tourism Route Selection Model for Tourism Sustainable Development Based on Improved Genetic Algorithm"}, {"paperId": "06f5002613c8e3fb8da8d0d15316a3323b1d1d30", "title": "A Survey on Crowdsourcing Applications in Smart Cities"}, {"paperId": "92e2d4c9cba541f51bc0efe39fbea9e006660dd9", "title": "A Dynamic and Scalable User-Centric Route Planning Algorithm Based on Polychromatic Sets Theory"}, {"paperId": "e3444fa85a670e0c24e65b15f47826c7c165af77", "title": "Assessing the Environmental Performances of Urban Roundabouts Using the VSP Methodology and AIMSUN"}, {"paperId": "3216789386fe486560397738abb1207e0a90653c", "title": "Evaluation of 5G Cell Densification for Autonomous Vehicles Positioning in Urban Settings"}, {"paperId": "0a3c6e246fdafeca2b4ee876995f4c0bebab0778", "title": "Collaborative Industrial Internet of Things for Noise Mapping: Prospects and Research Opportunities"}, {"paperId": "785b07f85fdee1033acc9286a647904ed001d79d", "title": "IoT-Based Crowd Management Framework for Departure Control and Navigation"}, {"paperId": "6f8ea1461d2f7b05b96336f28ed800b1825ef39b", "title": "Multiscale matters for part segmentation of instruments in robotic surgery"}, {"paperId": "4ad1aaa2957fe67ec25ea667a84e98d61fbff74d", "title": "TripPlanner: Personalized Trip Planning Leveraging Heterogeneous Trajectory Data"}, {"paperId": "d020415ce04837418b9dab19c84ef8c3bbc32772", "title": "A Cloud Architecture for Networked and Autonomous Vehicles"}, {"paperId": "1d23d5d4a1aed39febd4811530852f9249d41c6b", "title": "Towards Cross-Cultural Intelligent Vehicles: A Review"}]}
