{"paperId": "76e60dbe0358fb9fc3a8e5c618d6af6d5bd5cdfe", "publicationVenue": {"id": "e57a385f-3f90-4178-a194-c93884c2e86b", "name": "Intelligent Buildings International", "type": "journal", "alternate_names": ["Intell Build Int"], "issn": "1750-8975", "url": "http://www.tandfonline.com/loi/tibi20"}, "title": "Enhancing the smart building supervisory system effectiveness", "abstract": "ABSTRACT Modern buildings are managed by the BMS (Building Management System), a supervisory system that controls its mechanical and electrical devices. The automatic detection of faults and malfunctions plays a crucial role in the monitoring and control processes of electrical devices located in a smart building. The integration of this functionality within a BMS allows to improve the consistency and the effectiveness of the control network and to recognize and report in real-time the system’s malfunctioning. The research focuses on the definition of Fault Detection procedures to verify the successful implementation of sequential commands given by control and supervisory system. The authors realize a tool to control and manage in real-time the data coming from the sensors to verify the effective implementation of a command. The procedure is based on the following important assumption – we must be able to associate the trend of a given reference magnitude with each command. By monitoring the magnitude’s status and comparing them with default threshold values, the algorithms determine the command execution. Authors apply the proposed strategies on the F40 building, located in the ENEA R.C. ‘La Casaccia’, to detect faults and anomalies that can be traced to probable cyber intrusion or devices malfunctioning.", "venue": "Intelligent Buildings International", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-05-10", "journal": {"name": "Intelligent Buildings International", "pages": "564 - 580", "volume": "14"}, "authors": [{"authorId": "3440329", "name": "Dario Masucci"}, {"authorId": "2746974", "name": "Chiara Foglietta"}, {"authorId": "2772062", "name": "S. Panzieri"}, {"authorId": "144703686", "name": "S. Pizzuti"}], "citations": []}
