{"paperId": "76e92d5bf5dec4fa984879f1a8f2c359d3ea384a", "publicationVenue": {"id": "3da56ce6-4a70-402c-a8b0-7dd39a3273d3", "name": "Software, Practice & Experience", "type": "journal", "alternate_names": ["Softw  Pract Exp", "Softw Pract  Exp", "Software - Practice and Experience"], "issn": "0038-0644", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/1752", "alternate_urls": ["http://www.interscience.wiley.com/jpages/0038-0644/", "https://onlinelibrary.wiley.com/journal/1097024X"]}, "title": "Characterizing application scheduling on edge, fog, and cloud computing resources", "abstract": "Cloud computing has grown to become a popular distributed computing service offered by commercial providers. More recently, edge and fog computing resources have emerged on the wide‐area network as part of Internet of things (IoT) deployments. These three resource abstraction layers are complementary, and offer distinctive benefits. Scheduling applications on clouds has been an active area of research, with workflow and data flow models offering a flexible abstraction to specify applications for execution. However, the application programming and scheduling models for edge and fog are still maturing, and can benefit from learnings on cloud resources. At the same time, there is also value in using these resources cohesively for application execution. In this article, we offer a taxonomy of concepts essential for specifying and solving the problem of scheduling applications on edge, fog, and cloud computing resources. We first characterize the resource capabilities and limitations of these infrastructure and offer a taxonomy of application models, quality‐of‐service constraints and goals, and scheduling techniques, based on a literature review. We also tabulate key research prototypes and papers using this taxonomy. This survey benefits developers and researchers on these distributed resources in designing and categorizing their applications, selecting the relevant computing abstraction(s), and developing or selecting the appropriate scheduling algorithm. It also highlights gaps in literature where open problems remain.", "venue": "Software, Practice & Experience", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2019-04-23", "journal": {"name": "Software: Practice and Experience", "pages": "558 - 595", "volume": "50"}, "authors": [{"authorId": "9561284", "name": "Prateeksha Varshney"}, {"authorId": "1761220", "name": "Yogesh L. Simmhan"}], "citations": [{"paperId": "6acfd2a63a57691f72842020d668f69514b8eeb5", "title": "Improved Algorithms for Co-Scheduling of Edge Analytics and Routes for UAV Fleet Missions"}, {"paperId": "50d3688dbf477b728f66cd353ea04dc470e734fa", "title": "FedNow: An Efficiency-Aware Incentive Mechanism Enables Privacy Protection and Efficient Resource Utilization in Federated Edge Learning"}, {"paperId": "e305432f5b3338839d16f203b5b0406d2b438f80", "title": "Integration of cloud computing in BCI: A review"}, {"paperId": "153f0c21b65cf92be470c03cb5145b7ecff26486", "title": "A comprehensive review on Internet of Things application placement in Fog computing environment"}, {"paperId": "909ac1616cf5571bfb45b15619b83b251dd94bb4", "title": "Cuckoo search optimization-based energy efficient job scheduling approach for IoT-edge environment"}, {"paperId": "98bcde60c7cd99ea4d5300472fb6669c02d807f0", "title": "Bandwidth Allocation Algorithm for Makespan Optimization in a Fog-Cloud Environment: Monitoring Application"}, {"paperId": "8de6f6c2402b2abb3548d8c88238cd99e163257d", "title": "Automation in Fog Cloud assisted Internet of Things Ecosystem: Challenges, Components and Protocols"}, {"paperId": "fa360f662a74101ff4bf1a600db374029ea57bbd", "title": "A multi‐queue priority‐based task scheduling algorithm in fog computing environment"}, {"paperId": "eef589eee24d78d62ce25264686751364068d206", "title": "Multi-workflow scheduling and resource provisioning in Mobile Edge Computing using opposition-based Marine-Predator Algorithm"}, {"paperId": "699ca9e4d6bb5289d7532008f1246fbf0422ce53", "title": "A Heuristic Task Scheduling Strategy for Intelligent Manufacturing in the Big Data-Driven Fog Computing Environment"}, {"paperId": "7581d743dc72699f62f7c6e46db7a56e4d477d53", "title": "An improved discrete harris hawk optimization algorithm for efficient workflow scheduling in multi-fog computing"}, {"paperId": "9998223c0da61c8f28dfec86bf7958fb975d9c59", "title": "Placement of Microservices-based IoT Applications in Fog Computing: A Taxonomy and Future Directions"}, {"paperId": "3ded9a611e722c135074239df69c07c938ad7012", "title": "Cost-Efficient Deadline Constrained Scientific Workflow Scheduling in Infrastructure-as-a-Service Clouds by Disqualifying Tasks with Anomalies"}, {"paperId": "64464d5f41404fd9d3d762972f3fc23fc400fa5a", "title": "A systematic review of task scheduling approaches in fog computing"}, {"paperId": "2839b8200afefb95dfe3e643bff5affd22b25d9a", "title": "On the impact of stale information on distributed online load balancing protocols for edge computing"}, {"paperId": "6d256356bb6ddc36f3ed9576b010bb080d2283e2", "title": "Resilient Execution of Data-triggered Applications on Edge, Fog and Cloud Resources"}, {"paperId": "8ad63379eb1ad95c82084f42930edf066b005ea1", "title": "Service composition in dynamic environments: A systematic review and future directions"}, {"paperId": "d0912365f4cc8f463fa0433f2fab3533ee346b7d", "title": "Towards cost-aware VM migration to maximize the profit in federated clouds"}, {"paperId": "73d5dad667549eb95981223bb74ef731213aa696", "title": "Genetic-based optimization in Fog Computing: current trends and research opportunities"}, {"paperId": "ba1ae90d0366b154361963e1edade4ffed7edd9c", "title": "Fog computing: A taxonomy, systematic review, current trends and research challenges"}, {"paperId": "61a44ee1921f6e09e7d449ccf1f819c35cf97d25", "title": "A metaheuristic‐based data replica placement approach for data‐intensive IoT applications in the fog computing environment"}, {"paperId": "b39dead888d8bd6fdc54b2a562a9c1d5f2bca703", "title": "VIoLET"}, {"paperId": "ef299efb2f84d768646e0c823246205a9548b308", "title": "Quality of Service Provision in Fog Computing: Network-Aware Scheduling of Containers"}, {"paperId": "342e5371f0577085cd62570ef3f41dcae6621cd8", "title": "Toward an autonomic approach for Internet of Things service placement using gray wolf optimization in the fog computing environment"}, {"paperId": "e5ed42854fe20e2e5097e9f29190818225ce449f", "title": "ECO: Edge-Cloud Optimization of 5G applications"}, {"paperId": "52832929b1548ce978d31e260a4bc8004b7de877", "title": "Exploring Task Placement for Edge-to-Cloud Applications using Emulation"}, {"paperId": "61072e819cfb13bda06e47b2f7a21f8f495d508f", "title": "Adaptive Batch Size for Federated Learning in Resource-Constrained Edge Computing"}, {"paperId": "4eb81b6dcbdb53c968c89317112cc7fd41c7a451", "title": "Process Automation in an IoT–Fog–Cloud Ecosystem: A Survey and Taxonomy"}, {"paperId": "2a128d9214625e089cd88c39cf41b257ae0fb3f5", "title": "Heuristic Algorithms for Co-scheduling of Edge Analytics and Routes for UAV Fleet Missions"}, {"paperId": "3e1aa09c126eb4502f258dfe2ba583075dd789b2", "title": "Distributed algorithms based on proximity for self-organizing fog computing systems"}, {"paperId": "485386d8923a608512b86174f829490f96abf12d", "title": "Scheduling of Scientific Workflows in Multi-Fog Environments Using Markov Models and a Hybrid Salp Swarm Algorithm"}, {"paperId": "fd3aed72c4e631ff5129529bbfebe7370e09c008", "title": "Semantic-based discovery method for high-performance computing resources in cyber-physical systems"}, {"paperId": "2b4418e80f49b10b0a9e9073c129c3d17166c644", "title": "TorqueDB: Distributed Querying of Time-Series Data from Edge-local Storage"}, {"paperId": "c428f6acb253f3babf5842966f484fcbcf9ff122", "title": "Comparison of Alternative Architectures in Fog Computing"}, {"paperId": "e73bae11ce0978732ca7af9482d83e2c34026a33", "title": "Impact of etcd deployment on Kubernetes, Istio, and application performance"}, {"paperId": "0c03f89461b55eaab7a92538e78641b5e570f3e3", "title": "A Scalable Platform for Distributed Object Tracking Across a Many-Camera Network"}, {"paperId": "b09789b6bdc0cdd9e902431966a4adf608f86293", "title": "Multi-Objective Grey Wolf Optimizer Algorithm for Task Scheduling in Cloud-Fog Computing"}, {"paperId": "e5fc0e010b781309faecf7ae068f26c6b7388cdd", "title": "On workflow scheduling for latency-sensitive edge computing applications"}, {"paperId": "8fb94151f043084f084c0a41e58eee124ae7b6d1", "title": "Evolutionary Game Theory-Based Optimal Scheduling Strategy for Heterogeneous Computing"}, {"paperId": "57b5b65a940602aba845b062b5b14d327361eddd", "title": "Microservices-based IoT Applications Scheduling in Edge and Fog Computing: A Taxonomy and Future Directions"}, {"paperId": "095dd17238e1fafe7301d4889dae095e7f416ebf", "title": "A Comprehensive Review of Computing Paradigms, enabling Computation Offloading and Task Execution in Vehicular Networks"}, {"paperId": "2eb248b9e49ec4a504bc6d6e414a30592ed85d9a", "title": "Fault-Tolerance in the Scope of Cloud Computing"}, {"paperId": "dea1f5e230ac344950d6fd53b46c5fdc73b12a95", "title": "A Systematic Literature Review on Cloud Computing Security: Threats and Mitigation Strategies"}, {"paperId": "2115895cdba272fc5f31d480945e24a7cdab6f81", "title": "Services Composition under Uncertainty: A Systematic Review and Future Directions"}]}
