{"paperId": "76ea6b18bd1a2cf31b534a484712550b697497dd", "publicationVenue": {"id": "b827eced-82ea-44e6-b6d3-e8dfd4d8f000", "name": "Bulletin of Electrical Engineering and Informatics", "type": "journal", "alternate_names": ["Bull Electr Eng Informatics"], "issn": "2089-3191", "alternate_issns": ["2302-9285"], "url": "https://web.archive.org/web/20180818122233/http:/portalgaruda.org/portalgaruda/journals/index.php/EEI/issue/archive", "alternate_urls": ["http://beei.org/index.php/EEI"]}, "title": "The scheduling techniques in the Hadoop and Spark of smart cities environment: a systematic review", "abstract": "Processing extensive and diverse data in real-time is a significant challenge in the context of smart cities. Timely access to information and efficient analytics is essential for smart city services to make data-driven decisions and enhance urban living. Scheduling algorithms play a crucial role in ensuring the prompt delivery of services and efficient task completion. This paper explores various scheduling techniques, including static, dynamic, and hybrid schedulers, and compares their objectives and performance. Additionally, the study examines two prominent data processing frameworks, Hadoop and Spark, and compares their capabilities in handling big data in smart cities. With its ability to process large amounts of data quickly and efficiently, Spark has shown superiority over Hadoop in real-time data processing and performance optimization. The paper concludes by highlighting the strengths and limitations of each framework. It discusses the need for further research in optimizing scheduling techniques and exploring hybrid artificial intelligence scheduling for Spark. Overall, the findings contribute to a better understanding of data processing in real-time and provide insights for researchers and practitioners in smart cities.", "venue": "Bulletin of Electrical Engineering and Informatics", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2024-02-01", "journal": {"name": "Bulletin of Electrical Engineering and Informatics"}, "authors": [{"authorId": "2274151010", "name": "Nada Massed Mirza"}, {"authorId": "2274150255", "name": "Adnan Ali"}, {"authorId": "2274162376", "name": "Mohamad Khairi Ishak"}], "citations": []}
