{"paperId": "76eb3156b79fbeaef0a06e56582cf74cab428e07", "publicationVenue": {"id": "7928228e-aff0-41d1-a24d-17b496673b31", "name": "International Journal of Economics and Finance", "type": "journal", "alternate_names": ["Int J Econ Finance", "International journal of economics and finance", "Int j econ finance"], "issn": "1916-971X", "alternate_issns": ["1916-9728"], "url": "http://www.ccsenet.org/journal/index.php/ijef"}, "title": "The Integration of Big Data and Artificial Neural Networks for Enhancing Credit Risk Scoring in Emerging Markets: Evidence from Egypt", "abstract": "This study investigates the effectiveness of technology models in credit risk scoring modeling in emerging markets. the study proposes evaluation methods for credit risk scoring modeling for current and potential borrowers through an investigation into the Egyptian banking industry by offering and examining a framework for the integration of big data and artificial neural networks based on systematic and unsystematic risk for both the macroeconomic environment and characteristics of current and potential borrowers. The data for the borrowers under examination covers the period from 2015 to 2019 for 75 firms, excluding 2020 and 2021 data to isolate the impact of COVID-19 on the results of the inferred statistics. Artificial Neural Networks was training within 25 firms under NeuroXL program but examination for 50 firms. The study found the ability of artificial neural networks to rank the commitment of borrowers in Egyptian banks under big data about the firm and Egyptian economy. Additions to discrepancy between the proposed model against some traditional models. Finally; The Integration of Big Data and ANN can help banks to bring out the value of data within create a level of financial stability for banks. Especially in emerging markets characterized by information inefficiency.", "venue": "International Journal of Economics and Finance", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-01-07", "journal": {"name": "International Journal of Economics and Finance"}, "authors": [{"authorId": "98567928", "name": "Osama Wagdi"}, {"authorId": "134897065", "name": "Y. Tarek"}], "citations": [{"paperId": "3e12746bb621126e52fd64561c13c787a5ba6df0", "title": "Evolutionary Game Analysis of the Impact of Big Data Credit Technology on the Credit Rationing of Micro and Small Enterprises (MSEs)"}, {"paperId": "58e9561dd7de8cf995d420dcb79aaa6847311d1d", "title": "Credit risk prediction based on loan profit: Evidence from Chinese SMEs"}, {"paperId": "bccbd844008928afa496db07d6d6836dc0557287", "title": "Integration between technical indicators and artificial neural networks for the prediction of the exchange rate: Evidence from emerging economies"}, {"paperId": "67904d570e40cb47b27a0f370cb5772659ceea68", "title": "Big data and credit risk assessment: a bibliometric review, current streams, and directions for future research"}]}
