{"paperId": "76fabf22456f5549f320753cd65071c4c8dc9673", "publicationVenue": {"id": "486a8a53-464e-4738-8f52-4560d20b262e", "name": "International Scientific-Practical Conference Problems of Infocommunications Science and Technology", "type": "conference", "alternate_names": ["PIC S&T", "Int Sci Conf Probl Infocommunications Sci Technol"]}, "title": "Energy Efficiency of the D2D Direct Connection System in 5G Networks", "abstract": "This paper is dedicated to the analysis of energy efficiency of the D2D direct connection system in 5G networks. Fast development of 5G networks results in large increase of volumes of the data transmitted by the users. On one hand, the reduction of coverage areas of small cells and increase of their number in places with high load level enhance the capacity and quality of the whole system. On the other hand, increase of density of the network coverage leads to greater complexity of the system. As a result, one requires alternative approaches to improve the communication quality. In the research we suggest to apply direct connection technologies for the improvement of performance of 5G systems. The paper presents the results of numerical experiments and analysis of the dependences of number of users, of the probability of blocking and of the energy consumption on the input intensity of sessions of D2D systems. These results demonstrate improved performance of the 5G network with D2D direct connection compared to LTE systems. Therefore, the application of D2D technology allows to increase the data transfer rates and to improve energy efficiency of 5G networks.", "venue": "International Scientific-Practical Conference Problems of Infocommunications Science and Technology", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2020-10-06", "journal": {"name": "2020 IEEE International Conference on Problems of Infocommunications. Science and Technology (PIC S&T)", "pages": "537-542"}, "authors": [{"authorId": "2017420975", "name": "A. Bulashenko"}, {"authorId": "9308371", "name": "S. Piltyay"}, {"authorId": "2074730274", "name": "I. Demchenko"}], "citations": [{"paperId": "e976be586681d61a1cc540f95e0673a18920f16a", "title": "Polarization and Dispersion Properties of Electromagnetic Waves Propagation and Their Applications in Radio Engineering, Information Systems and Telecommunications"}, {"paperId": "684dd95f2d823a324ca0a1e168254806a4c25ce3", "title": "Metaverse Driven Edge-Fogging-Cloud Network for Complex Human Activity Recognition Using Sensors Fusion"}, {"paperId": "8605e3e24c19c4e29551afac839f16bfefde8760", "title": "Interference Mitigation Strategy for D2D Communication in 5G Networks"}, {"paperId": "af0ace553861ccb4c64e0e8c411820fa2a5bdc38", "title": "Review of Beamforming’s Energy Consumption Algorithms for (5G) Wireless Networks"}, {"paperId": "2b0ce0f35704b6bc2e205ecdb4dcba1b67cb3396", "title": "FEM, FDTD and Wave Matrix Methods Application for Modeling of Phase Shifting Devices Based on a Waveguide with Diaphragms"}, {"paperId": "e981624d7ca0b47f0040452500f88006b8060dc8", "title": "Compact Septum Waveguide Polarizer for X-band Satellite Communication Systems"}, {"paperId": "039649540595b50f8b239ef14b7bc004fb757b22", "title": "Experimental Measurement and Theoretical Analysis of Rectangular Waveguide Filters for C-band Satellite Antenna Systems"}, {"paperId": "ef6f5db5b2c90bcc639f2c1ddf753a889f0f94e1", "title": "Electromagnetic Performance of Waveguide Polarizers with Sizes Obtained by Single-Mode Technique and by Trust Region Optimization"}, {"paperId": "f61eaf209220e87a813a3c93961f53a0a866ca4e", "title": "Accuracy and Agreement of FDTD, FEM and Wave Matrix Methods for the Electromagnetic Simulation of Waveguide Polarizers"}, {"paperId": "33bcdabef6d40f22da1daf9abf287108cc7e2af0", "title": "Evaluation of the effect of 5G Hardware Impairments on achieving high Energy Efficiency"}, {"paperId": "9749dc277a68f883b718919c7821929075628d05", "title": "A 5G-Based VR Application for Efficient Port Management"}, {"paperId": "3c3f4eea5e537cc0f28565edba268ba551ca451f", "title": "Computer‐aided development and experimental investigation of a double‐ridged orthomode transducer for modern satellite and space communication systems"}, {"paperId": "a483d263f73d777f2ca8da66f5de24bf634db7dc", "title": "Analysis of waveguide polarizers using equivalent network and finite elements methods"}, {"paperId": "7fce2a08a4e002fc25743783db3c9507b131dd99", "title": "Electromagnetic and bandwidth performance optimization of new waveguide polarizers with septum of a stepped-thickness type for satellite systems"}, {"paperId": "8758c6fa6d24cb90fa4b16d2468a55b90e719be2", "title": "Square Waveguide Polarizer with Diagonally Located Irises for Ka-Band Antenna Systems"}, {"paperId": "b125a1f3fd08ebb93f898b1327a2be8f1582a057", "title": "Electromagnetic Simulation of New Tunable Guide Polarizers with Diaphragms and Pins"}, {"paperId": "08334d0bfee4bd1c915b17c07a7e64899f5fcce0", "title": "FDTD and wave matrix simulation of adjustable DBS-band waveguide polarizer"}, {"paperId": "5b4a7411de7f9c236d0c531431a6e77d89db3e2b", "title": "Multiple Reflections Method for Diaphragms Polarizers Development"}, {"paperId": "dd83b582ce4ce89a08c89f176910065c77f30fd8", "title": "Development and optimization of microwave guide polarizers using equivalent network method"}, {"paperId": "e073847fc7973bcec16e0e6de59b186ee27ac0a6", "title": "TUNABLE POLARIZERS FOR X-BAND RADAR AND TELECOMMUNICATION SYSTEMS"}, {"paperId": "29d41ee329eaaf1d69bd163f7b01680f5b31994e", "title": "Adjustable Iris-Post Waveguide Polarizer for Ku-band Satellite Uplink Systems"}, {"paperId": "478ec9e948029b25f18d22ca992f663da79abc84", "title": "Compact Posts-Based Waveguide Polarizer for Satellite Communications and Radar Systems"}, {"paperId": "f11e0b30af30b629d014831961b4206e8b707708", "title": "Waveguide Polarizer for Radar Systems of 2 cm Wavelength Range"}, {"paperId": "b463e019d1dff562900935fb2ed18669f5828b76", "title": "Synthesis of Waveguide Diaphragm Polarizers Using Wave Matrix Approach"}, {"paperId": "449b1af1a24ed3363401e847a96f6ad1e55b7e45", "title": "Modern Microwave Polarizers and Their Electromagnetic Characteristics"}, {"paperId": "33a4279ade37aae4faa557fe9fc263e9d79f8c58", "title": "Characteristic Impedances of Rectangular and Circular Waveguides for Fundamental Modes"}, {"paperId": "aa99f06736d4f205a4e2f896c17b2fa96444e307", "title": "Comparative Analysis of Compact Satellite Polarizers Based on a Guide with Diaphragms"}, {"paperId": "e997a95ef1fffb4a4d20c971172870eec8f54a6b", "title": "Waveguide Slot Feed Section for Antennas with Circular Polarization"}, {"paperId": "d3524003be2dc555ebe09236a5e0549b7b703b3f", "title": "Optimized guide polarizer for extended C-band"}, {"paperId": "b1ee0a82c46de9c02905ea6f296cfbbf11ef41b5", "title": "Polarization Converter for Satellite Systems"}, {"paperId": "8018fbadaf4515cc90a9d072312710853f65f4aa", "title": "Analytical modeling and optimization of new Ku‐band tunable square waveguide iris‐post polarizer"}, {"paperId": "25b831b0c57fd9e93b52f0cfdf967e43e277d8f3", "title": "КОМПАКТНИЙ ПЕРЕТВОРЮВАЧ ПОЛЯРИЗАЦІЇ ДЛЯ СУПУТНИКОВИХ АНТЕННИХ СИСТЕМ"}, {"paperId": "3af76c98043ad69f0e727b83869f86c56c77c998", "title": "New Traffic Model of M2M Technology in 5G Wireless Sensor Networks"}, {"paperId": "a40262293c16856e408a8b297496de0c74607800", "title": "Designing a 6G Testbed for Location: Use Cases, Challenges, Enablers and Requirements"}, {"paperId": "1797b0dcc8655e0452f5cf9e39fc692f2d5facc3", "title": "MODELLING AND OPTIMIZATION OF WAVEGUIDE POLARIZERS WITH THE ACCOUNT OF IRISES THICKNESS"}]}
