{"paperId": "76ff59ee33b1575e00050b6076c92201c0b183bb", "publicationVenue": {"id": "a59db0cb-8287-4db4-9378-0eb4c692f830", "name": "International Symposium on Service Oriented Software Engineering", "type": "conference", "alternate_names": ["IEEE International Conference on System of Systems Engineering", "Int Symp Serv Oriented Softw Eng", "International Conference on System of Systems Engineering", "SoSE", "Service Oriented Software Engineering", "Serv Oriented Softw Eng", "Int Conf Syst Syst Eng", "IEEE Int Conf Syst Syst Eng", "SOSE"]}, "title": "Detection and classification of failures as an emergent behavior in a machinery system modelled as a system of systems", "abstract": "In Industry 4.0 context predictive maintenance is a hot topic with several challenges that can be investigated by a system of systems engineering approach where the emergent behaviour can be related to possible system failures. The Internet of Things (IoT) can be also used to monitor and control the different system components. This work proposes a simple approach to detect, monitor, and control emergent behavior by IoT sensors. Starting from the raw data which were daily extracted from sensors, an analysis of the collected signals is performed to help decision-making concerning its maintenance. In the case study related to a door system in a bus, the proposed method can recognize the different damage states analysing the input parameters: temperature, pressure, and humidity of door systems. Some recent reliability performance indicators are used to evaluate the damage classification.", "venue": "International Symposium on Service Oriented Software Engineering", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-06-14", "journal": {"name": "2023 18th Annual System of Systems Engineering Conference (SoSe)", "pages": "1-7"}, "authors": [{"authorId": "1793835", "name": "R. Sacile"}, {"authorId": "2816686", "name": "M. Sallak"}, {"authorId": "49502810", "name": "Enrico Zero"}], "citations": [{"paperId": "019cef07e7c630925e3f44906fc32d12c3e271e4", "title": "Dynamic MPC-Based Scheduling in a Smart Manufacturing System Problem"}]}
