{"paperId": "7701490b046bff2261602c8fd7a73fe7aed05064", "publicationVenue": {"id": "bfe18e38-5c78-46c0-9f50-1cda4155944e", "name": "Journal of Asian Development", "type": "journal", "alternate_names": ["J Asian Dev"], "issn": "2377-9594", "url": "http://jad.macrothink.org/"}, "title": "Heterogeneity in the Effects of Group Lending in Microfinance-The Case of Mongolia", "abstract": "This study examines the heterogeneity of the effects of the joint and several liability systems of microfinance in Mongolia. The heterogeneity was examined from three perspectives: consumption, repayment rate, and income.\nIn terms of business income and business expenditure, the older the household, the greater the number of loans, and the more private businesses the household owns, the greater the business expenditure. For household consumption, there is no difference between group and individual lending except in the number of private businesses, but when we restrict the analysis to food consumption, group lending increases food consumption more for households with more than one borrower and borrowers with longer borrowing periods. While more variable heterogeneity was found for the whole sample, only age and borrowing duration were found to affect household income across different types of microfinance for the poorest households with below median household income. The results of this study suggest that even if there was no significant difference in each attribute between the treatment and control groups, joint and several liabilities may or may not be effective depending on the level of the attribute. To maximize the effect of a simple measure, it is important to understand the factors that affect heterogeneity and the effective level of the heterogeneity. Even if a measure is not effective, it may become effective if the level of the attribute changes.", "venue": "Journal of Asian Development", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-02-07", "journal": {"name": "Journal of Asian Development"}, "authors": [{"authorId": "144901752", "name": "Takaharu Ishii"}], "citations": [{"paperId": "ac11ecdd586b39fe55b3d2476661cbb9108ee06c", "title": "Effectiveness of Microfinance Based on Rational Mechanisms"}]}
