{"paperId": "771031b74d4a6a3ca8bdc8fc6e6ac75bdcf8ee0a", "publicationVenue": {"id": "6fa18ffd-a3c3-4260-9a9a-9da6896ec372", "name": "Critical reviews in microbiology", "type": "journal", "alternate_names": ["Critical Reviews in Microbiology", "Crit Rev Microbiol", "Crit rev microbiol"], "issn": "1040-841X", "url": "http://informahealthcare.com/loi/mby", "alternate_urls": ["http://www.tandfonline.com/loi/imby", "http://www.tandfonline.com/imby", "http://www.metapress.com/openurl.asp?genre=journal&issn=1040-841X"]}, "title": "Leveraging big data bioinformatics approaches to extract knowledge from Staphylococcus aureus public omics data", "abstract": "Abstract Staphylococcus aureus is a notorious pathogen posing challenges in the medical industry due to drug resistance and biofilm formation. The horizon of knowledge on S. aureus pathogenesis has expanded with the advancement of data-driven bioinformatics techniques. Mining information from sequenced genomes and their expression data is an economic approach that alleviates wastage of resources and redundancy in experiments. The current review covers how big data bioinformatics has been used in the analysis of S. aureus from publicly available –omics data to uncover mechanisms of infection and inhibition. Particularly, advances in the past two decades in biomarker discovery, host responses, phenotype identification, consolidation of information, and drug development are discussed highlighting the challenges and shortcomings. Overall, the review summarizes the diverse aspects of scrupulous re-analysis of S. aureus proteomic and transcriptomic expression datasets retrieved from public repositories in terms of the efforts taken, benefits offered, and follow-up actions. The detailed review thus serves as a reference and aid for (i) Computational biologists by briefing the approaches utilized for bacterial omics re-analysis concerning S. aureus and (ii) Experimental biologists by elucidating the potential of bioinformatics in biological research to generate reliable postulates in a prompt and economical manner.", "venue": "Critical reviews in microbiology", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-04-25", "journal": {"name": "Critical Reviews in Microbiology", "pages": "391 - 413", "volume": "49"}, "authors": [{"authorId": "2072330006", "name": "Devika Subramanian"}, {"authorId": "2355178", "name": "J. Natarajan"}], "citations": [{"paperId": "45babc18eb2d907aa820b8bc6e8176fcfc59fc30", "title": "Toxicity evaluation of processing Evodiae fructus based on intestinal microbiota"}]}
