{"paperId": "77118f4a929c41c741f40c375189888d95df9db3", "publicationVenue": {"id": "72cd3646-f908-4a0f-abbf-68f6c809b649", "name": "Jurnal Pendidikan Teknologi dan Kejuruan", "type": "journal", "alternate_names": ["JURNAL PENDIDIKAN TEKNOLOGI DAN KEJURUAN", "J Pendidik Teknol dan Kejuru", "J PENDIDIK TEKNOL DAN KEJURU"], "issn": "0216-3241", "alternate_issns": ["2407-7453", "0854-4735", "0854-7467"], "url": "https://ejournal.undiksha.ac.id/index.php/JPTK", "alternate_urls": ["https://jurnal.unimed.ac.id/2012/index.php/mbt", "https://journal.uny.ac.id/index.php/jptk"]}, "title": "The Effect of an Augmented Reality Teaching Kit on Visualization, Cognitive Load and Teaching Styles", "abstract": "The purpose of this study was to identify the visualization of the students, the students' cognitive load, and the teaching style of the teacher while teaching using the augmented reality (AR) teaching kit in the classroom. The population involved 90 Welding Technology students at Vocational College of Batu Pahat. The purposive sampling method was used and involved 30 respondents. The instrument used was a questionnaire to obtain information. Data were collected and analyzed descriptively. Based on the pilot study, the Cronbach Alpha value was 0.94. The results showed that the use of an AR teaching kit was able to enhance students’ visualization and reduced the cognitive load experienced by the students. In addition, teaching and learning are more interesting because of the teaching style of teachers who use theories and practices simultaneously. Furthermore, the use of AR in education can enhance the visualization of students abstractly, which helps them when conducting experiential tests and establishing a safe teaching and learning environment.", "venue": "Jurnal Pendidikan Teknologi dan Kejuruan", "year": 2018, "fieldsOfStudy": ["Psychology"], "publicationTypes": null, "publicationDate": "2018-09-29", "journal": {"name": "Jurnal Pendidikan Teknologi dan Kejuruan"}, "authors": [{"authorId": "32917144", "name": "Mohd Erfy Ismail"}, {"authorId": "80785350", "name": "P. Utami"}, {"authorId": "24475483", "name": "I. Ismail"}, {"authorId": "103945194", "name": "M. Khairudin"}, {"authorId": "40316622", "name": "M. Amiruddin"}, {"authorId": "101324755", "name": "B. Lastariwati"}, {"authorId": "2325779", "name": "Nopadon Maneetien"}], "citations": [{"paperId": "98aaa22eda079a7400e2ad4c285022cda9db1a04", "title": "Volleyball Sports Teaching Based on Augmented Reality and Wireless Communication Assistance"}, {"paperId": "71d2fbed1395d5ca464670e991aa677bfb217e9f", "title": "Developing Augmented Reality (AR) as Assisted Technology in Reading Based on Content-Language Integrated Learning"}, {"paperId": "0603c931fae57cb692226e8b673952295e3c4c74", "title": "IMPLEMENTASI TEACHING FACTORY KOMPETENSI KEAHLIAN TEKNIK DAN BISNIS SEPEDA MOTOR DI SMK MA’ARIF 1 WATES"}, {"paperId": "43194c855ec33efeff96bb61d0e913c4c26f6d0b", "title": "Development of Mobile Augmented Reality Based Media for An Electrical Measurement Instrument"}, {"paperId": "520b89b63da9f265f1e9e676bf29558f2f186552", "title": "The Potential of Augmented Reality for Vocational High School Learning Amid Covid-19 Spread"}, {"paperId": "a3d8cb07fdb11ddc13f701703e71989885f12afd", "title": "Development of augmented reality teaching materials of chemical bonding"}, {"paperId": "fe9a57e70b65ad53aadd6d5578e05393488bcb1f", "title": "Design of Virtual Reality Application for Taharah Using 3D Blender"}, {"paperId": "9e9fb18ef219cfd3f5c31b7c68db74e04ff5267c", "title": "Virtual Trainer for Mobile Augmented Reality Based Electrical Lighting Installation"}, {"paperId": "dda88bcf9fe16ff3128f2dc8b723498a8a5cca09", "title": "AUTOC-AR: A Car Design and Specification as a Work Safety Guide Based on Augmented Reality Technology"}, {"paperId": "d2de8d31b5ef252c9f770cbf167b11623cbd2105", "title": "Learning Media of Electric Lighting Installation Based on Mobile Augmented Reality"}, {"paperId": "ec5fb79abad0df9d8d48837b200f021152c55760", "title": "Development of wet preservation learning media based on mobile application integrated augmented reality on invertebrate material"}, {"paperId": "8c5c8ade1af1649c3509179f9332a0cb75a7b68f", "title": "Sharia financial education using augmented reality technology to increase student motivation in distance learning"}, {"paperId": "35a9eb6d730ec3524d1532a7ce73d507c4fa6148", "title": "Augmented reality integrated learning media material for electrolysis cells as student learning material in basic chemistry"}, {"paperId": "40f44ddc1d61f53e04b088173da5f516c37a3dff", "title": "Development of Augmented Reality Assisted Textbooks to Develop Patriotism Character for Students of Grade 4th in Elementary School"}, {"paperId": "70ebc15098d8ec7562bfae5dcecb6d3a0580f799", "title": "Effectiveness of Augmented Reality (AR) based learning media on increasing the physical examination system of pregnant women urinary system."}]}
