{"paperId": "7712f3398a99504e45ad50f2c82ec727d9832ddc", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Scientific Workflows Management and Scheduling in Cloud Computing: Taxonomy, Prospects, and Challenges", "abstract": "Cloud computing provides solutions to a large number of organizations in terms of hosting systems and services. The services provided by cloud computing are broadly used for business and scientific applications. Business applications are task oriented applications and structured into business workflows. Whereas, scientific applications are data oriented and compute intensive applications and structured into scientific workflows. Scientific workflows are managed through scientific workflows management and scheduling systems. Recently, a significant amount of research is carried out on management and scheduling of scientific workflow applications. This study presents a comprehensive review on scientific workflows management and scheduling in cloud computing. It provides an overview of existing surveys on scientific workflows management systems. It presents a taxonomy of scientific workflow applications and characteristics. It shows the working of existing scientific workflows management and scheduling techniques including resource scheduling, fault-tolerant scheduling and energy efficient scheduling. It provides discussion on various performance evaluation parameters along with definition and equation. It also provides discussion on various performance evaluation platforms used for evaluation of scientific workflows management and scheduling strategies. It finds evaluation platforms used for the evaluation of scientific workflows techniques based on various performance evaluation parameters. It also finds various design goals for presenting new scientific workflow management techniques. Finally, it explores the open research issues that require attention and high importance.", "venue": "IEEE Access", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "53491-53508", "volume": "9"}, "authors": [{"authorId": "2020286823", "name": "Z. Ahmad"}, {"authorId": "3196099", "name": "A. I. Jehangiri"}, {"authorId": "1413434253", "name": "M. Ala’anzy"}, {"authorId": "145121884", "name": "M. Othman"}, {"authorId": "2563887", "name": "R. Latip"}, {"authorId": "51200193", "name": "S. K. U. Zaman"}, {"authorId": "2287708", "name": "A. I. Umar"}], "citations": [{"paperId": "302d38d8b8083cbb38db0631a47ca19188ebb83c", "title": "A serverless computing architecture for Martian aurora detection with the Emirates Mars Mission"}, {"paperId": "23bda784d71ad2bf3c8ea479ce596f571bb14c00", "title": "Optimization of Maritime Communication Workflow Execution with a Task-Oriented Scheduling Framework in Cloud Computing"}, {"paperId": "dd093e8f7ee820a56cc8bf5a73b549903121c94d", "title": "A Min-Max Workload Scheduling Technique Using Soft-Computing Approach in Multi-Cloud Platform"}, {"paperId": "d54c780804f6b1e8fcd5802764b343c0eccef69e", "title": "Green cloud computing adoption challenges and practices: a client’s perspective-based empirical investigation"}, {"paperId": "090b57268060d2aec6c1f572162d924bb25ae470", "title": "PPTS-PSO: a new hybrid scheduling algorithm for scientific workflow in cloud environment"}, {"paperId": "a783345d148059655477418bfc39a3f36e025353", "title": "Runtime Management of Service Level Agreements through Proactive Resource Provisioning for a Cloud Environment"}, {"paperId": "2ec46ec78856140a99463a34f9788d00aa59cbf7", "title": "IKH-EFT: An improved method of workflow scheduling using the krill herd algorithm in the fog-cloud environment"}, {"paperId": "6f0d8024a9c5f8bcc9528178a664819f003c5695", "title": "Data Mining and Analysis of Business Administration Based on Cloud Computing"}, {"paperId": "0ae24cff80bf656781723b558bc94189ea90d55b", "title": "CoPUP: content popularity and user preferences aware content caching framework in mobile edge computing"}, {"paperId": "b42cef8d1e7a73b9ef7cb00d78f7ac707e3bc167", "title": "Overview of Scientific Workflow Security Scheduling in Clouds"}, {"paperId": "8ac6b5a8a5d99c338e5c7634f9f4c3f42b5166cd", "title": "Genetically-modified Multi-objective Particle Swarm Optimization approach for high-performance computing workflow scheduling"}, {"paperId": "3181e9d024c71a65f87a5c4abe1a9769db7d8f3f", "title": "Mapping and Consolidation of VMs Using Locust-Inspired Algorithms for Green Cloud Computing"}, {"paperId": "927dcc1555fc2c71acc9af2435244ea08171c96e", "title": "Multi-Swarm PSO Algorithm for Static Workflow Scheduling in Cloud-Fog Environments"}, {"paperId": "3e1f735ae225aaf1496a46d81e87ae9630c4666a", "title": "Enterprise Financial Management Informatization under Cloud Computing Environment"}]}
