{"paperId": "772aba4722255f67ec68f04d3805182faf0dee32", "publicationVenue": {"id": "8bc59e8b-e251-4201-839a-ec83ae78859d", "name": "Complex", "type": "conference", "alternate_names": ["Int Conf Complex Sci", "International Conference on Complex Sciences"], "issn": "0806-1912", "alternate_issns": ["1538-6848"], "url": "http://wo.uio.no/as/WebObjects/nettlogg.woa/1/wa/logg?logg=5904", "alternate_urls": ["http://www.wikicfp.com/cfp/program?id=545", "https://www.complex.com/"]}, "title": "A BERT-BiGRU-CRF Model for Entity Recognition of Chinese Electronic Medical Records", "abstract": "Because of difficulty processing the electronic medical record data of patients with cerebrovascular disease, there is little mature recognition technology capable of identifying the named entity of cerebrovascular disease. Excellent research results have been achieved in the field of named entity recognition (NER), but there are several problems in the pre processing of Chinese named entities that have multiple meanings, of which neglecting the combination of contextual information is one. Therefore, to extract five categories of key entity information for diseases, symptoms, body parts, medical examinations, and treatment in electronic medical records, this paper proposes the use of a BERT-BiGRU-CRF named entity recognition method, which is applied to the field of cerebrovascular diseases. The BERT layer first converts the electronic medical record text into a low-dimensional vector, then uses this vector as the input to the BiGRU layer to capture contextual features, and finally uses conditional random fields (CRFs) to capture the dependency between adjacent tags. The experimental results show that the F1 score of the model reaches 90.38%.", "venue": "Complex", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-01-27", "journal": {"name": "Complex.", "pages": "6631837:1-6631837:11", "volume": "2021"}, "authors": [{"authorId": "9279480", "name": "Qiuli Qin"}, {"authorId": "2181701622", "name": "Shuang Zhao"}, {"authorId": "2120324303", "name": "Chunmei Liu"}], "citations": [{"paperId": "061a49b47013a53a1e78a3c23a3f53d2575ba36b", "title": "MRC-based Nested Medical NER with Co-prediction and Adaptive Pre-training"}, {"paperId": "92652f41cad1eb2f1f9405885641c7b53ecb019e", "title": "A Named Entity Recognition Model Based on BERT Model and Lexical Fusion in the Financial Regulation Field"}, {"paperId": "ea349e8f1542a3d62d0ee0abae4625698ebebf0f", "title": "Construction of a knowledge graph for breast cancer diagnosis based on Chinese electronic medical records: development and usability study"}, {"paperId": "b0d8ab5d53b8d64043f9b720ee0f7e85b40fe733", "title": "BERT-BiGRU-CRF Application in Insulin Dosage Monitoring System for Control of Blood Glucose Levels in Type 2 Diabetic Patients"}, {"paperId": "c1f8e3dbd74cfb3a8b2b66e33f5a2e4798fc27ec", "title": "Research on Threat Intelligence-Based Attack Organization Identification"}, {"paperId": "3863dd2c67223e775a9d8fc94fd8074ddfc244db", "title": "MTR-SAM: Visual Multimodal Text Recognition and Sentiment Analysis in Public Opinion Analysis on the Internet"}, {"paperId": "37be78b91ad55fac04724841358d7eb55f447c61", "title": "The Dynamic Vectors-Based Attention Model for Chinese Mathematical Term Extraction"}, {"paperId": "44d53aa6df04dc99c441972cfd14b11ba12b1e2c", "title": "End-to-End Transformer-Based Models in Textual-Based NLP"}, {"paperId": "19c1c577ff5ca82eb37c4f58d5a5cd3167c8172f", "title": "BERT-based Extractive Text Summarization of Scholarly Articles: A Novel Architecture"}, {"paperId": "cdc537ade94aa85ae3e4d593add3ff7e2701091f", "title": "Medical QA Oriented Multi-Task Learning Model for Question Intent Classification and Named Entity Recognition"}, {"paperId": "64531a099a2e413b41af58db5986969a406a6d9b", "title": "Research on medical named entity recognition based on DB-MA-BiLSTM-CRF"}, {"paperId": "2a424acb4d186d39e9fc823cfdb24f29fd419b26", "title": "Research on Structured Extraction Method for Function Points Based on Event Extraction"}, {"paperId": "23fb5b670a41b3f1e80a4a319d717039677a3080", "title": "Automatic Extraction of Medication Information from Cylindrically Distorted Pill Bottle Labels"}, {"paperId": "34f91cc1696071a7dab8e141b2c8a6cf62e88a19", "title": "A multi-layer soft lattice based model for Chinese clinical named entity recognition"}, {"paperId": "2a72bbf2cae6c368a1d4f3dd37abf7d65079ee85", "title": "An RG-FLAT-CRF Model for Named Entity Recognition of Chinese Electronic Clinical Records"}, {"paperId": "9f5816ee3dc40d4edf5f8442ab8157baa6744686", "title": "A Chinese Named Entity Recognition Model of Maintenance Records for Power Primary Equipment Based on Progressive Multitype Feature Fusion"}, {"paperId": "576518a9b2d8ec6397179ef7e2c269f7c194a09b", "title": "Medical Name Entity Recognition Based on Lexical Enhancement and Global Pointer"}, {"paperId": "de142258773c061faed36bbe6de64f1ce065c5d6", "title": "MRC-based Medical NER with Multi-task Learning and Multi-strategies"}]}
