{"paperId": "772e41111a1d99f1c1dbd4fb340b863ff4412348", "publicationVenue": {"id": "d5e5b5e7-54b1-4f53-82fc-4853f3e71c58", "name": "medRxiv", "type": "journal", "url": "https://www.medrxiv.org/"}, "title": "Applications of Digital Microscopy and Densely Connected Convolutional Neural Networks for Automated Quantitation of Babesia-Infected Erythrocytes", "abstract": "Background: Clinical babesiosis is diagnosed, and parasite burden is determined, by microscopic inspection of a thick or thin Giemsa-stained peripheral blood smear. However, quantitative analysis by manual microscopy is subject to observer bias, slide distribution errors, statistical sampling error, recording errors, and is inherently burdensome from time management and workflow efficiency standpoints. As such, methods for the automated measurement of percent parasitemia in digital microscopic images of peripheral blood smears could improve clinical accuracy, relative to the predicate method. Methods: Individual erythrocyte images (shape: 70x70x3) were manually labeled as \"parasite\" or \"normal\" and were used to train a model for binary image classification. The best model was then used to calculate percent parasitemia from a clinical validation dataset, and values were compared to a clinical reference value. Lastly, model interpretability was examined using an integrated gradient to identify pixels most likely to influence classification decisions. Results: The precision and recall of the model during development testing were 0.92 and 1.00, respectively. In clinical validation, the model returned increasing positive signal with increasing mean reference value. However, there were two highly erroneous false positive values returned by the model. Lastly, the model incorrectly assessed three cases well above the clinical threshold of 10%. The integrated gradient suggested potential sources of false positives including rouleaux formations, cell boundaries, and precipitate as deterministic factors in negative erythrocyte images. Conclusions: While the model demonstrated highly accurate single cell classification and correctly assessed most slides, several false positives were highly incorrect. This project highlights the need for integrated testing of ML-based models, even when models in the development phase perform well.", "venue": "medRxiv", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": null, "publicationDate": "2021-04-29", "journal": null, "authors": [{"authorId": "48946116", "name": "T. Durant"}, {"authorId": "49688985", "name": "S. Dudgeon"}, {"authorId": "51208883", "name": "J. McPadden"}, {"authorId": "2207911601", "name": "Anisia Simpson"}, {"authorId": "1411393005", "name": "Nathan Price"}, {"authorId": "14677344", "name": "W. Schulz"}, {"authorId": "39634361", "name": "Richard Torres"}, {"authorId": "47701834", "name": "Eben M. Olson"}], "citations": [{"paperId": "a53ffc6c26fe77ac0d584ac476129358b2d84523", "title": "Deep learning for microscopic examination of protozoan parasites"}]}
