{"paperId": "772fe7974f2b24bbf3d2946778f4c553b6c3a585", "publicationVenue": {"id": "59eaa32d-b026-4d64-beaa-c422bc2629ed", "name": "Small", "type": "journal", "issn": "1613-6810", "url": "http://www.small-journal.com/", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/16136829", "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1613-6829"]}, "title": "Coaxial Flexible Fiber-Shaped Triboelectric Nanogenerator Assisted by Deep Learning for Self-Powered Vibration Monitoring.", "abstract": "Self-powered vibration sensor is highly desired for distributed and continuous monitoring requirements of Industry 4.0. Herein, a flexible fiber-shaped triboelectric nanogenerator (F-TENG) with a coaxial core-shell structure is proposed for the vibration monitoring. The F-TENG exhibits higher adaptability to the complex surfaces, which has an outstanding application prospect due to vital compensation for the existing rigid sensors. Initially, the contact characteristics between the dielectric layers, that related to the perceiving performance of the TENG, are theoretically analyzed. Such a TENG with 1D structure endows high sensitivity, allowing for accurately responding to a wide range of vibration frequencies (0.1 to 100 Hz). Even applying to the real diesel engine, the error in detecting the vibration frequencies is only 0.32% compared with the commercial vibration sensor, highlighting its potential in practical application. Further, assisted by deep learning, the recognition accuracy in monitoring nine operating conditions of the system achieves 97.87%. Overall, the newly designed F-TENG with the merits of high-adaptability, cost-efficiency, and self-powered, has offered a promising solution to fulfill an extensive range of vibration sensing applications in the future.", "venue": "Small", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-11-27", "journal": {"name": "Small", "pages": "\n          e2307680\n        "}, "authors": [{"authorId": "2112446753", "name": "Cong Zhao"}, {"authorId": "2041735662", "name": "Taili Du"}, {"authorId": "2161915043", "name": "Bin Ge"}, {"authorId": "2265816516", "name": "Ziyue Xi"}, {"authorId": "2241879894", "name": "Zian Qian"}, {"authorId": "2145195275", "name": "Yawei Wang"}, {"authorId": "2165960601", "name": "Junpeng Wang"}, {"authorId": "2051899957", "name": "Fangyang Dong"}, {"authorId": "2268458324", "name": "Dianlong Shen"}, {"authorId": "2268488001", "name": "Zhenhao Zhan"}, {"authorId": "2233760810", "name": "Minyi Xu"}], "citations": [{"paperId": "481d8cf9add6617d2e6fcdfdb5c260d350235065", "title": "Self-charging power module for multidirectional ultra-low frequency mechanical vibration monitoring and energy harvesting"}]}
