{"paperId": "77355764fa24d063f9526747a432c374110cdad2", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "PandaDB: Understanding Unstructured Data in Graph Database", "abstract": "—Unstructured data (e.g., images, videos, PDF ﬁles, etc.) contain semantic information, for example, the facial feature of a person and the plate number of a vehicle. There could be semantic relationships among data items. For example, a person’s face may appear in two irrelevant photos. Also, part of data is in structured format (e.g., person’s name and age). Naturally, end-users prefer to query unstructured data and structured data together based on the potential relationships among them. In this work, we build an open-source graph database named PandaDB to manage and query structured and unstructured data in graph. We ﬁrst introduce graph as the data model to manage structured and unstructured data in one framework, then propose a query language extension to understand the semantic information of the unstructured data in the graph. Next, we develop a new cost model and related query optimization techniques to speed up the unstructured data processing in graph. Finally, we optimize the unstructured data storage and provide the index to speed up the query processing for unstructured data. PandaDB is widely used in industrial applications like FinTech, Knowledge Graph, and Recommendation System. The results show PandaDB can support a large scale of unstructured data query processing in a graph.", "venue": "arXiv.org", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-07-05", "journal": {"name": "ArXiv", "volume": "abs/2107.01963"}, "authors": [{"authorId": "2117928332", "name": "Zihao Zhao"}, {"authorId": "3303634", "name": "Zhihong Shen"}, {"authorId": "47605128", "name": "Mingjie Tang"}], "citations": []}
