{"paperId": "77395aa5528178dbad323279a55a77e4903f7a2c", "publicationVenue": null, "title": "FogFly: A Traffic Light Optimization Solution based on Fog Computing", "abstract": "This paper provides a fog-based approach to solving the traffic light optimization problem which utilizes the Adaptive Traffic Signal Control (ATSC) model. ATSC systems demand the ability to strictly reflect real-time traffic state. The proposed fog computing framework, namely FogFly, aligns with this requirement by its natures in location-awareness, low latency and affordability to the changes in traffic conditions. As traffic data is updated timely and processed at fog nodes deployed close to data sources (i.e., vehicles at intersections) traffic light cycles can be optimized efficiently while virtualized resources available at network edges are efficiently utilized. Evaluation results show that services running in FogFly produce better performance comparing to those in cloud computing approaches.", "venue": "UbiComp/ISWC Adjunct", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2018-10-08", "journal": {"name": "Proceedings of the 2018 ACM International Joint Conference and 2018 International Symposium on Pervasive and Ubiquitous Computing and Wearable Computers"}, "authors": [{"authorId": "1679045", "name": "Q. Minh"}, {"authorId": "145111410", "name": "Chanh Minh Tran"}, {"authorId": "153050379", "name": "Tuan An Le"}, {"authorId": "2201292576", "name": "Thai Binh Nguyen"}, {"authorId": "2201002067", "name": "Minh-Triet Tran"}, {"authorId": "9140912", "name": "R. Balan"}], "citations": [{"paperId": "402646d6298f995fbd1054de5fb66a04fa58dc44", "title": "Evaluation and Challenges of IoT Simulators for Intelligent Transportation System Applications"}, {"paperId": "72404f48c32d4d215fc68a7649bfdb121578263a", "title": "Elasticity of Intelligent Transportation System Applications in a Fog Computing Environment"}, {"paperId": "4e1000b9418de4de21ca5099bcec437132035662", "title": "Distributed agent-based deep reinforcement learning for large scale traffic signal control"}, {"paperId": "ba1ae90d0366b154361963e1edade4ffed7edd9c", "title": "Fog computing: A taxonomy, systematic review, current trends and research challenges"}, {"paperId": "bad603bb334ce3e0c8805fcfb4fa153514abb8a0", "title": "A novel framework for message dissemination with consideration of destination prediction in VFC"}, {"paperId": "390a238d8300bc118baac42d3354cf28a1be9d5a", "title": "ARTSIA: Escalabilidade de Aplicações para Sistemas Inteligentes de Transportes em um Ambiente de Computação em Neblina"}, {"paperId": "f1f599281acca955de76d3b3dbf650b577fac4a7", "title": "A Novel Message Dissemination Scheme Based on Pub/Sub Model and Vehicular Fog Computing"}, {"paperId": "20df127e6b25a11f354dd349120331cef2048e23", "title": "Designed Features for Improving Openness, Scalability and Programmability in the Fog Computing-Based IoT Systems"}, {"paperId": "cdec6050792fd805fa46a8d04e3a41662b95c6aa", "title": "Online Offloading Scheduling and Resource Allocation Algorithms for Vehicular Edge Computing System"}, {"paperId": "158b40e11e8a66664cf8911943776711869bb969", "title": "Openness in Fog Computing for the Internet of Things"}, {"paperId": "092eed98921d537e1465db3b17103890ee755050", "title": "Vehicular Fog Computing-Planning and Design"}]}
