{"paperId": "773c91e25e7ebe1c98e6e95e8511298d45e76364", "publicationVenue": {"id": "2b3aa273-d994-4f8f-a44b-310f1a8f9a1c", "name": "International Journal of Data and Network Science", "type": "journal", "alternate_names": ["Int J Data Netw Sci"], "issn": "2561-8148", "url": "http://growingscience.com/ijds/ijds.html"}, "title": "A new model for security analysis of network anomalies for IoT devices", "abstract": "In the era of IoT gaining traction, attacks on IoT-enabled devices are the order of the day that emanates the need for more protected IoT networks. IoT's key feature deals with massive amounts of data sensed by numerous heterogeneous IoT devices. Numerous machine learning techniques are used to collect data from different types of sensors on the objects and transform them into information relevant to the application. Furthermore, business and data analytics algorithms help in event prediction based on observed behavior and information. Routing information securely over the internet with limited resources in IoT applications is a key problem. The study proposes a model for detecting network anomalies in IoT devices to enhance the security of the devices. The study employed the IoT Botnet dataset, and K-fold cross-validation tests were used for validating the values of evaluation metrics. The average values of Accuracy, Precision, Recall, and F Score was 97.4.", "venue": "International Journal of Data and Network Science", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "International Journal of Data and Network Science"}, "authors": [{"authorId": "69865895", "name": "Mohammad Al Rawajbeh"}, {"authorId": "2277538165", "name": "Wael Alzyadat"}, {"authorId": "2549962", "name": "K. Kaabneh"}, {"authorId": "3039848", "name": "Suha Afaneh"}, {"authorId": "94776337", "name": "Dima Farhan Alrwashdeh"}, {"authorId": "2212646630", "name": "Hamdah Samih Albayaydah"}, {"authorId": "2221474214", "name": "ssam Hamad AlHadid"}], "citations": [{"paperId": "ca63fa6eb4bf07d9b048b22e1522ca6326c78305", "title": "A Methodology for Dynamic Security Risks Assessment in Interconnected IT Systems"}, {"paperId": "e4343d646fb4cf6d7269f0377ef83e73e797b615", "title": "Evaluating the influence of security considerations on information dissemination via social networks"}]}
