{"paperId": "7760a8740d5c263a6d204d7f98578147aa4853ba", "publicationVenue": {"id": "1d55d186-c439-4cb2-9e32-c7dd3785fe7d", "name": "International Colloquium on Signal Processing and Its Applications", "type": "conference", "alternate_names": ["CSPA", "Int Colloq Signal Process It Appl"]}, "title": "The Security Issues in IoT - Cloud: A Review", "abstract": "The rapid growth and adoption of IoT technologies in sectors of life are challenged by the resources constrained IoT devices. However, the growth of IoT technologies can be enhanced by integrating them with cloud computing. Hence, a new area of computing called IoT Cloud or CloudIoT has emerged. That is, the data collected from the IoT technologies are stored and processed in the cloud infrastructure so that IoT technologies are relived from resources constrained issue. As a result, some new classes of security and privacy issues are introduced. This paper presents security issues pertaining to IoT cloud.", "venue": "International Colloquium on Signal Processing and Its Applications", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2020-02-01", "journal": {"name": "2020 16th IEEE International Colloquium on Signal Processing & Its Applications (CSPA)", "pages": "191-196"}, "authors": [{"authorId": "1396343228", "name": "Nawaf Almolhis"}, {"authorId": "1642210544", "name": "A. M. Alashjaee"}, {"authorId": "1642211629", "name": "Salahaldeen Duraibi"}, {"authorId": "49992536", "name": "F. Alqahtani"}, {"authorId": "39094564", "name": "A. Moussa"}], "citations": [{"paperId": "f78467cec48a9e07b09dd07b605074d414078a8d", "title": "Securing Cloud-Based Internet of Things: Challenges and Mitigations"}, {"paperId": "eb4fb7cdfe993eab1201fef47099e9e476f1bc67", "title": "A Review about Internet of Things (IoT) integration with Cloud Computing with a Limelight on Security"}, {"paperId": "cb95453932b9aedaade7bf9ddd575fa13bbaa127", "title": "Towards Smart Healthcare: Challenges and Opportunities in IoT and ML"}, {"paperId": "25ecf980052965f26123b1e324ddb57e1bd20338", "title": "Machine Learning Based Framework for Attack Detection on IoT Devices"}, {"paperId": "caaaf5ad27b2c70b744cae2f64196e43c3b6f1de", "title": "Blockchain-Based Distributed Hybrid Cloud Identity Management for Securing IoT Devices in the Cloud"}, {"paperId": "6586d59186830d62ff7bbad4e2691ec58e8b6b09", "title": "Integration of the Internet of Things and Cloud: Security Challenges and Solutions - A Review"}, {"paperId": "5dbded826d028b5873b64604f7249946ac2fae22", "title": "Using Machine Learning for Detection and Classification of Cyber Attacks in Edge IoT"}, {"paperId": "03e945552e6e45bac5bc0b4a35edd834d04a9924", "title": "Edge Computing and Sensor-Cloud: Overview, Solutions, and Directions"}, {"paperId": "51588d58f15552502bbebc78bc8e19482e9b3dda", "title": "A systematic review of IoT technologies and their constituents for smart and sustainable agriculture applications"}, {"paperId": "1148209adbdd1bd1a797285ca1648eb1c077c431", "title": "Current security and privacy issues, and concerns of Internet of Things (IoT) and Cloud Computing: A review"}, {"paperId": "a991237d1815c641d5e0f18f842e5b1b64077ce2", "title": "A robust and trusted framework for IoT networks"}, {"paperId": "7439fd72ebbfe1093a560545db84d24cbdd3623a", "title": "Review of Human-Machine Interaction Towards Industry 5.0: Human-Centric Smart Manufacturing"}, {"paperId": "383644988e6f353efd455738fe16d3cd59813c41", "title": "A Perspective Review of Security Issues in IoT with Cloud Environment"}, {"paperId": "79bc72bafcf49972ba74a2e9f5a23b8b513aaf01", "title": "Improving IoT data Security Using Compression and Lightweight Encryption Technique"}, {"paperId": "3355967a28481b816b4758119c72fa923bf988fa", "title": "Privacy-Preserving Cloud Computing: Ecosystem, Life Cycle, Layered Architecture and Future Roadmap"}, {"paperId": "37fe0c6329bf93e74ff726c9c12ccdf28d429c9b", "title": "Edge and fog computing for IoT: A survey on current research activities & future directions"}, {"paperId": "e223b06135350c636b3e4833c46b8f840244bdd3", "title": "Evaluation and Analysis of IoT-based Smart City Design Parameters"}, {"paperId": "7af139cdba4d569ff9ed3c30027c3fffc9148982", "title": "A Secure IoT-Based Cloud Platform Selection Using Entropy Distance Approach and Fuzzy Set Theory"}, {"paperId": "c576c1ed40a9c27f05dbac2fcb51f7a73a74ee0b", "title": "IoT Cloud Security Review"}, {"paperId": "7bbbd0e16e29def93713c839101e231932a3184c", "title": "Forensic Requirements Specification for Mobile Device Malware Forensic Models"}, {"paperId": "ce7499d6862df8269c655220049c3ed20b9b6f5e", "title": "A Comprehensive Survey on Machine Learning-Based Big Data Analytics for IoT-Enabled Smart Healthcare System"}, {"paperId": "0e5dbaffcb0b530416e311c62ed55d8363ac5ee1", "title": "Voice Feature Learning using Convolutional Neural Networks Designed to Avoid Replay Attacks"}, {"paperId": "11954ec840f9c2dcf31fdf40891a5e2cdaea18db", "title": "Analysis on Literature Review of Internet of Things Adoption Among the Consumer at the Individual Level"}, {"paperId": "465a71e1105d54743ef2796f9c875518777ba9d9", "title": "DUCE: Distributed Usage Control Enforcement for Private Data Sharing in Internet of Things"}]}
