{"paperId": "77666a5ce2ced6536d302c7018580d9cbfe62eda", "publicationVenue": null, "title": "Here Be Livestreams: Trade-offs in Creating Temporal Maps of Reddit", "abstract": "We present a method for mapping Reddit communities that accounts for temporal shifts, using quantitative and qualitative analyses of clustering techniques to produce high-quality, stable, and meaningful maps for researchers, journalists and casual Reddit users. Building on previous work using community embeddings, we find that only a month of Reddit comments suffices to create snapshot embeddings that maintain quality while supporting insight into changes in Reddit communities over time. Comparing different clusterings of community embeddings with quantitative measures of quality and temporal stability, we describe properties of the models and what they tell us about the underlying Reddit data. Moreover, qualitative analysis of the resulting clusters illuminate which properties of clusterings are useful for analysis of Reddit communities. Although clusterings of subreddits have been used in many earlier works, we believe this is the first study to qualitatively analyze how these clusterings are perceived by social media researchers at a Reddit-wide scale. Finally, we demonstrate how the temporal snapshots might be used in exploratory study. We are able to identify particularly stable communities during 2021-2022, such as the Reddit Public Access Network, as well as emerging communities, like one focused on NFT trading. This work informed the development of a webtool for exploring Reddit now available to the public at RedditMap.social.", "venue": "", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2023-09-25", "journal": null, "authors": [{"authorId": "2247693412", "name": "Virginia Partridge"}, {"authorId": "2247694873", "name": "Jasmine Mangat"}, {"authorId": "38603208", "name": "R. Curran"}, {"authorId": "2247698207", "name": "Ryan McGrady"}, {"authorId": "2214843", "name": "Ethan Zuckerman"}], "citations": []}
