{"paperId": "77706c91f7116965951fff98ce1c8abacc64f817", "publicationVenue": {"id": "deedf64a-dd5c-4b33-b345-ff83bfb93d71", "name": "International Symposium on Computer Architecture", "type": "conference", "alternate_names": ["Int Symp Comput Archit", "ISCA"], "url": "http://www.cs.wisc.edu/~arch/www/"}, "title": "Spy in the GPU-box: Covert and Side Channel Attacks on Multi-GPU Systems", "abstract": "The deep learning revolution has been enabled in large part by GPUs, and more recently accelerators, which make it possible to carry out computationally demanding training and inference in acceptable times. As the size of machine learning networks and workloads continues to increase, multi-GPU machines have emerged as an important platform offered on High Performance Computing and cloud data centers. Since these machines are shared among multiple users, it becomes increasingly important to protect applications against potential attacks. In this paper, we explore the vulnerability of Nvidia's DGX multi-GPU machines to covert and side channel attacks. These machines consist of a number of discrete GPUs that are interconnected through a combination of custom interconnect (NVLink) and PCIe connections. We reverse engineer the interconnected cache hierarchy and show that it is possible for an attacker on one GPU to cause contention on the L2 cache of another GPU. We use this observation to first develop a covert channel attack across two GPUs, achieving the best bandwidth of around 4 MB/s. We also develop a prime and probe attack on a remote GPU allowing an attacker to recover the cache access pattern of another workload. This access pattern can be used in any number of side channel attacks: we demonstrate a proof of concept attack that fingerprints the application running on the remote GPU, with high accuracy. We also develop a proof of concept attack to extract hyperparameters of a machine learning workload. Our work establishes for the first time the vulnerability of these machines to microarchitectural attacks and can guide future research to improve their security.", "venue": "International Symposium on Computer Architecture", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2022-03-30", "journal": {"name": "Proceedings of the 50th Annual International Symposium on Computer Architecture"}, "authors": [{"authorId": "19358776", "name": "Sankha Baran Dutta"}, {"authorId": "1413788826", "name": "Hoda Naghibijouybari"}, {"authorId": "48668934", "name": "Arjun Gupta"}, {"authorId": "2113900189", "name": "Nael B. Abu-Ghazaleh"}, {"authorId": "144222468", "name": "A. Márquez"}, {"authorId": "1757394", "name": "K. Barker"}], "citations": [{"paperId": "1028c80f76bec0e769856a9fd7677ba3631a9ad0", "title": "Beyond the Bridge: Contention-Based Covert and Side Channel Attacks on Multi-GPU Interconnect"}, {"paperId": "7e18b34ed2a6965fc168c7416323e66ada89484c", "title": "Whispering Pixels: Exploiting Uninitialized Register Accesses in Modern GPUs"}, {"paperId": "66c0bf2cc5869ddc9205db601ca8c1c92837d9bb", "title": "Exploit Detection and Mitigation Technique of Cache Side-Channel Attacks using Artificial Intelligence"}, {"paperId": "753e07f227607d1578fafa6f8f9fbd2bf9bcc67e", "title": "The First Concept and Real-world Deployment of a GPU-based Thermal Covert Channel: Attack and Countermeasures"}, {"paperId": "1255030232f2f4a27b17385c5abeec551123a2b2", "title": "GhostLeg: Selective Memory Coalescing for Secure GPU Architecture"}]}
