{"paperId": "7773488ce9978b23a0c379b2655d4fcb705e49b3", "publicationVenue": {"id": "6779b5f8-34fa-4236-b4de-86143cfa1d78", "name": "Geocarto International", "type": "journal", "alternate_names": ["Geocarto Int"], "issn": "1010-6049", "url": "http://www.tandfonline.com/toc/tgei20/current"}, "title": "Landslide susceptibility mapping at sin Ho, Lai Chau province, Vietnam using ensemble models based on fuzzy unordered rules induction algorithm", "abstract": "Abstract Landslide susceptibility map is considered as one of the important steps in assessing vulnerability of an area to landslide hazard. In this study, the main objective is to propose ensemble machine learning models: BF, DF and RSSF which are a combination of Fuzzy Unordered Rules Induction algorithm (F) and three optimization techniques namely Bagging, Decorate, and Random Subspace, respectively for landslide susceptibility mapping. In addition, two other single models namely F and Support Vector Machines (SVM) were also applied for the comparison of performance of the proposed models. For this purpose, the Sin Ho district, Lao Cai Province, Vietnam was selected as the study area. For the development of models, database of 850 present and historical landslides of this province including ten landslide affecting input parameters namely slope, curvature, elevation, aspect, Topographic Wetness Index (TWI), deep division, river density, fault density, aquifer, and geology were used. Validation of the models was done using various popular statistical indicators including Area Under the Receiver Operating Characteristics (AUC) curve. The results show that the BF model (AUC = 0.923) is the best model for accurate landslide susceptibility mapping (LSM) in comparison to other models namely DF (AUC = 0.899), RSSF (AUC = 0.893), SVM (AUC = 0.840), and F (AUC = 0.862). The study revealed that LSM map constructed using BF model can be used for better land use planning and proper landslide hazard management.", "venue": "Geocarto International", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-10-13", "journal": {"name": "Geocarto International", "pages": "17777 - 17798", "volume": "37"}, "authors": [{"authorId": "2188091513", "name": "Tran Xuan Bien"}, {"authorId": "2130430438", "name": "Pham The Truyen"}, {"authorId": "105037658", "name": "T. Phong"}, {"authorId": "2153961208", "name": "D. D. Nguyen"}, {"authorId": "2124681579", "name": "M. Amiri"}, {"authorId": "95511696", "name": "R. Costache"}, {"authorId": "66591362", "name": "D. M. Duc"}, {"authorId": "21322397", "name": "H. V. Le"}, {"authorId": "2148658180", "name": "Hanh Bich Thi Nguyen"}, {"authorId": "46952045", "name": "Indra Prakash"}, {"authorId": "144109958", "name": "B. Pham"}], "citations": [{"paperId": "28f46c35a3352605212edcf62b19ec08843a39b5", "title": "Fast hybrid methods for modeling landslide susceptibility in Ardal County"}, {"paperId": "d13d13a14eb9d953fb5997465386371373f8fe28", "title": "Landslide spatial prediction utilizing fuzzy unordered rules induction ensemble models: a case study in Thai Nguyen, Vietnam"}, {"paperId": "298a3fde7f36b58e6c83b62e09a812e98e44ccb7", "title": "Integration of rotation forest and multiboost ensemble methods with forest by penalizing attributes for spatial prediction of landslide susceptible areas"}, {"paperId": "1ee343fe2430bb3d99ea6063ca9c5a8a08e875e0", "title": "Landslide susceptibility modeling and mapping at Dien Bien province, Vietnam using Bagging based MLP neural network"}, {"paperId": "1d99d74d8760b9f2236b0d2f9b61754a70403d37", "title": "GIS-based data-driven bivariate statistical models for landslide susceptibility prediction in Upper Tista Basin, India"}, {"paperId": "996f309d0d55d06d2252a62fed4c284fd7b570a1", "title": "Groundwater potential mapping in the Central Highlands of Vietnam using spatially explicit machine learning"}]}
