{"paperId": "777856095c2059e06c19f49d69e22172f49deb3b", "publicationVenue": {"id": "b093d4d3-f396-43ee-ab10-059b1b2cc604", "name": "Mediterranean Communication and Computer Networking Conference", "type": "conference", "alternate_names": ["MedComNet", "Mediterr Commun Comput Netw Conf"]}, "title": "Joint Speed and Bandwidth Optimized Strategy of UAV-Assisted Data Collection in Post-Disaster Areas", "abstract": "In natural disasters, due to the destruction of ground infrastructure, ground terminals (GTs) participating in rescue cannot communicate with the outside world, so the rapid establishment of wireless network is crucial for rescue operations. Due to its large coverage and rapid deployment, unmanned aerial vehicles (UAVs) are often used in emergency communications. In this paper, a hovering UAV and a cruising UAV are adopted cooperatively to collect data efficiently from GTs. Firstly, the locations of the GTs are modeled by a Thomas cluster process (TCP) which is more accurate. Secondly, based on the different distribution densities of GTs, the speed in sub-regions and bandwidth allocation of UAV are jointly optimized to maximize the number of GTs served by UAV, where the GTs need to upload the minimum amount of data within a given cruise cycle to ensure efficiency. The optimization problem we propose is a mixed integer non-linear problem (MINLP) and NP-hard. To solve this problem, we employ the improved particle swarm optimization (PSO) to find the optimal solution. Extensive simulations and experiments show that the number of served GTs can be effectively increased by jointly optimizing the speed and bandwidth of sub-regions compared with the constant speed and static channel resource allocation scheme.", "venue": "Mediterranean Communication and Computer Networking Conference", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-06-01", "journal": {"name": "2022 20th Mediterranean Communication and Computer Networking Conference (MedComNet)", "pages": "39-42"}, "authors": [{"authorId": "2051634368", "name": "Yue Fu"}, {"authorId": "120510518", "name": "Demin Li"}, {"authorId": "2069578929", "name": "Qinghua Tang"}, {"authorId": "67276075", "name": "Shuangquan Zhou"}], "citations": [{"paperId": "41580006d2cdf57fbfe8cd4293055aa1523f722a", "title": "Distributed computing model for channel bandwidth allocation and optimization using machine learning techniques"}, {"paperId": "0c682328301fe8431678d8d02fb1b75bfb4b1135", "title": "Joint Optimization of UAV Swarm Deployment and Spectrum Allocation Based on Multidimensional Priority"}, {"paperId": "fef4e44e722cb30c5b143c5036d65ac0474d8b98", "title": "Speed-Control Technique for Achieving Fair Uplink Communications With a UAV-Aided Flying Base Station"}]}
