{"paperId": "77835f0049433f7f0d1c6c4fb9dbbeebf31b82d0", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Adaptive-Latency DRAM: Reducing DRAM Latency by Exploiting Timing Margins", "abstract": "This paper summarizes the idea of Adaptive-Latency DRAM (AL-DRAM), which was published in HPCA 2015, and examines the work's significance and future potential. AL-DRAM is a mechanism that optimizes DRAM latency based on the DRAM module and the operating temperature, by exploiting the extra margin that is built into the DRAM timing parameters. DRAM manufacturers provide a large margin for the timing parameters as a provision against two worst-case scenarios. First, due to process variation, some outlier DRAM chips are much slower than others. Second, chips become slower at higher temperatures. The timing parameter margin ensures that the slow outlier chips operate reliably at the worst-case temperature, and hence leads to a high access latency. \nUsing an FPGA-based DRAM testing platform, our work first characterizes the extra margin for 115 DRAM modules from three major manufacturers. The experimental results demonstrate that it is possible to reduce four of the most critical timing parameters by a minimum/maximum of 17.3%/54.8% at 55C while maintaining reliable operation. AL-DRAM uses these observations to adaptively select reliable DRAM timing parameters for each DRAM module based on the module's current operating conditions. AL-DRAM does not require any changes to the DRAM chip or its interface; it only requires multiple different timing parameters to be specified and supported by the memory controller. Our real system evaluations show that AL-DRAM improves the performance of memory-intensive workloads by an average of 14% without introducing any errors. Our characterization and proposed techniques have inspired several other works on analyzing and/or exploiting different sources of latency and performance variation within DRAM chips.", "venue": "arXiv.org", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-05-04", "journal": {"name": "ArXiv", "volume": "abs/1805.03047"}, "authors": [{"authorId": "48893570", "name": "Donghyuk Lee"}, {"authorId": "6821159", "name": "Yoongu Kim"}, {"authorId": "3257164", "name": "Gennady Pekhimenko"}, {"authorId": "2781428", "name": "S. Khan"}, {"authorId": "1720084", "name": "Vivek Seshadri"}, {"authorId": "2289261", "name": "K. Chang"}, {"authorId": "145929920", "name": "O. Mutlu"}], "citations": [{"paperId": "76ed7e41fabd91a86f5e5dc58688a58f329d31db", "title": "Recent Advances in DRAM and Flash Memory Architectures"}, {"paperId": "305dea0339faabadcd591a31a6ad31e495f5f7d9", "title": "Flexible-Latency DRAM: Understanding and Exploiting Latency Variation in Modern DRAM Chips"}, {"paperId": "5219b25edc5eb64b279fd7e69c49556032e80c22", "title": "Guest Editor"}]}
