{"paperId": "778965de4f295b1ba92afec30fddd5f6b9ae7f8c", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Robust Blocking of Human Faces with Personal Information Using Artificial Deep Neural Computing", "abstract": "High-speed wired and wireless Internet are one of the useful ways to acquire various types of media data easily. In this circumstance, people also can easily get media data including objects with exposed personal information through the Internet. Exposure of personal information emerges as a social issue. This paper proposes an effective blocking technique that makes it possible to robustly detect target objects with exposed personal information from various types of input images with the use of deep neural computing and to effectively block the detected objects’ regions. The proposed technique first utilizes the neural computing-based learning algorithm to robustly detect the target object including personal information from an image. It next generates a grid-type mosaic and lets the mosaic overlap the target object region detected in the previous step so as to effectively block the object region that includes personal information. Experimental results reveal that the proposed algorithm robustly detects the target object region with exposed personal information from a variety of input images and effectively blocks the detected region through grid-type mosaic processing. The object blocking technique proposed in this paper is expected to be applied to various application fields such as image security, sustainable anticipatory computing, object tracking, and target blocking.", "venue": "Sustainability", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2020-03-18", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "1802640", "name": "Seok-Woo Jang"}, {"authorId": "1704515", "name": "Sang-Hong Lee"}], "citations": [{"paperId": "13296805c78924f35a5f657acbc09800c7d66956", "title": "Extraction of mosaic regions through projection and filtering of features from image big data"}]}
