{"paperId": "778cd4ce7192310a8a4eaae3f2caacebbd340916", "publicationVenue": {"id": "bb1e43d8-72e5-4f3a-a4dc-a5e2e6d038cc", "name": "Cyberpsychology, Behavior, and Social Networking", "type": "journal", "alternate_names": ["Cyberpsychology Behav Soc Netw"], "issn": "2152-2715", "url": "https://www.liebertpub.com/cpb", "alternate_urls": ["http://online.liebertpub.com/loi/CYBER"]}, "title": "COVID-19 and Sinophobia: Detecting Warning Signs of Radicalization on Twitter and Reddit", "abstract": "Hate crimes and hateful rhetoric targeting individuals of Asian descent have increased since the outbreak of COVID-19. These troubling trends have heightened concerns about the role of the Internet in facilitating radicalization. This article explores the existence of three warning signs of radicalization-fixation, group identification, and energy bursts-using data from Twitter and Reddit. Data were collected before and after the outbreak of COVID-19 to assess the role of the pandemic in affecting social media behavior. Using computational social science and Natural Language Processing techniques, we looked for signs of radicalization targeting China or Chinese individuals. Results show that fixation on the terms China and Chinese increased on Twitter and Reddit after the pandemic began. Moreover, tweets and posts containing either of these terms became more hateful, offensive, and negative after the outbreak. We also found evidence of individuals identifying more closely with a particular group, or adopting an \"us vs. them\" mentality, after the outbreak of COVID-19. These findings were especially prominent in subreddits catering to self-identified Republicans and Conservatives. Finally, we detected bursts of activity on Twitter and Reddit following the start of the pandemic. These warning signs suggest COVID-19 may have had a radicalizing effect on some social media users. This work is important because it not only shows the potential radicalizing effect of the pandemic, but also demonstrates the ability to detect warning signs of radicalization on social media. This is critical, as detecting warning signs of radicalization can potentially help curb hate-fueled violence.", "venue": "Cyberpsychology, Behavior, and Social Networking", "year": 2023, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-07-01", "journal": {"name": "Cyberpsychology, behavior and social networking", "pages": "\n          546-553\n        ", "volume": "26 7"}, "authors": [{"authorId": "144156342", "name": "Matthew Costello"}, {"authorId": "8842079", "name": "Nishant Vishwamitra"}, {"authorId": "48588429", "name": "Song Liao"}, {"authorId": "143778806", "name": "Long Cheng"}, {"authorId": "2140495064", "name": "Feng Luo"}, {"authorId": "7150554", "name": "Hongxin Hu"}], "citations": []}
