{"paperId": "7794cafc651701e1d4eeef7388f7321476d8c11f", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Predictive and Prescriptive Analytics in Identifying Opportunities for Improving Sustainable Manufacturing", "abstract": "Environmental issues and sustainability performance are more and more significant in today’s business world. A growing number of manufacturing companies are searching for changes to improve their sustainability in the areas of products and manufacturing processes. These changes should be introduced in the design process and affect the whole product life cycle. This paper is concerned with developing a method based on predictive and prescriptive analytics to identify opportunities for increasing sustainable manufacturing through changes incorporated at the product design stage. Predictive analytics uses parametric models obtained from regression analysis and artificial neural networks in order to predict sustainability performance. In turn, prescriptive analytics refers to the identification of opportunities for improving sustainability performance in manufacturing, and it is based on a constraint programming implemented within a constraint satisfaction problem (CSP). The specification of sustainability performance in terms of a CSP provides a pertinent framework for identifying all admissible solutions (if there are any) of the considered problem. The identified opportunities for improving sustainability performance are dedicated to specialists in product development, and aim to reduce both resources used in manufacturing and negative effects on the environment. The applicability of the proposed method is illustrated through reducing the number of defective products in manufacturing.", "venue": "Sustainability", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-07", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "2212143", "name": "Marcin Relich"}], "citations": [{"paperId": "5ec85f5a4f0eb559e347383081d17746e07484b5", "title": "Factors Affecting Eco-Innovations in the European Union"}]}
