{"paperId": "77b640258ef47ae3dd91d5832d72532fc547591f", "publicationVenue": {"id": "f80ba4a3-7aed-4021-b4d8-e4f50668847a", "name": "IEEE International Joint Conference on Neural Network", "type": "conference", "alternate_names": ["IJCNN", "IEEE Int Jt Conf Neural Netw", "Int Jt Conf Neural Netw", "International Joint Conference on Neural Network"], "url": "http://www.wikicfp.com/cfp/program?id=1573"}, "title": "A Comparative Study of Machine Learning and NLP Techniques for Uses of Stop Words by Patients in Diagnosis of Alzheimer's Disease", "abstract": "Alzheimer's Disease (AD) is one of the most common forms of neuropsychological disorder in elderly people. It is a slow progressive disease affecting the brain cells. This affects the cognitive abilities of people and their daily activities. During the course of the disease, memory gets brutally affected too. Working as well as long-term declarative memory deteriorates in AD patients. Due to this deterioration of the memory, AD patients tend to show a decline in their communicative skills as well. This decline is reflected in their speech. AD patients usually have poor grammar along with very low coherent ideas. Also, they tend to repeat the words very often and hence become unclear on the message they are trying to convey. As the disease progresses, the speech is completely impaired, and the patients are left to sing or utter words that are totally out of context. Stopwords are the words that are most commonly used in language and it is often hypothesized that AD patients use them much often as compared to Control Normal (CN) subjects. It is seen that due to the degeneration of brain cells in AD patients, they have a tendency to use a lot of stopwords to fill their perplexities in their statements. In this paper, the usefulness of the stopwords in capturing the linguistic information of the patients suffering from AD are discussed. Learning algorithms are evaluated by including stopwords and dropping stopwords at preprocessing to draw comparisons.", "venue": "IEEE International Joint Conference on Neural Network", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-07-18", "journal": {"name": "2021 International Joint Conference on Neural Networks (IJCNN)", "pages": "1-8"}, "authors": [{"authorId": "1992911761", "name": "Surabhi Adhikari"}, {"authorId": "1978790638", "name": "Surendrabikram Thapa"}, {"authorId": "1992896280", "name": "Priyanka Singh"}, {"authorId": "2609599", "name": "Huan Huo"}, {"authorId": "3201199", "name": "Gnana Bharathy"}, {"authorId": "145499331", "name": "M. Prasad"}], "citations": [{"paperId": "344891c6d7c0f05db90731dc163deb2fed7534c5", "title": "Enhancing ESG Impact Type Identification through Early Fusion and Multilingual Models"}, {"paperId": "e65a96b55fe8ac5532f8075a81c64bafb16b7866", "title": "Incorporating historical information by disentangling hidden representations for mental health surveillance on social media"}, {"paperId": "2eef2d7ffb7fcadef36ce0fa879ad79d62e8c609", "title": "Systems that evaluate international equivalency in health-related professions: a scoping review with a focus on Canada"}, {"paperId": "1cd1a58e5068fa6afa08ba3249eed6a0568b5c09", "title": "Alzheimer's Diagnosis and Generation-Based Chatbot Using Hierarchical Attention and Transformer"}, {"paperId": "62c833b1548e44bc4c7c59c84c353625556ba060", "title": "Hate Speech Detection Using Natural Language Processing: Applications and Challenges"}, {"paperId": "06bdd91951dc1c6160a51c01426ad1d661b03ab2", "title": "Stance and Hate Event Detection in Tweets Related to Climate Activism - Shared Task at CASE 2024"}, {"paperId": "ba067bb339ce3d28c0f084a029485374b3773aba", "title": "Reducing Knowledge Noise for Improved Semantic Analysis in Biomedical Natural Language Processing Applications"}, {"paperId": "0efa041ca071077cac8440b124f5a8ba6a577c84", "title": "Breaking Barriers: Exploring the Diagnostic Potential of Speech Narratives in Hindi for Alzheimer’s Disease"}, {"paperId": "bf765774710c7a5b0041d79bd58ce101eb89e9e2", "title": "Multimodal Hate Speech Event Detection - Shared Task 4, CASE 2023"}, {"paperId": "f415cc2d69303c20806e2b18b45e775543c80e9e", "title": "Temporal Tides of Emotional Resonance: A Novel Approach to Identify Mental Health on Social Media"}, {"paperId": "9f934e02a670e48aca99415c24442893c46b54c9", "title": "Cognitive Internet of Things (IoT) and computational intelligence for mental well-being"}]}
