{"paperId": "77dc08d28a7912ac714f9b56dbe44d6709344d95", "publicationVenue": null, "title": "Panic Detection Using Machine Learning and Real-Time Biometric and Spatiotemporal Data", "abstract": "It is common sense that immediate response and action are among the most important terms when it comes to public safety, and emergency response systems (ERS) are technology components strictly tied to this purpose. While the use of ERSs is increasingly adopted across many aspects of everyday life, the combination of them with real-time biometric and location data appears to provide a different perspective. Panic is one of the most important emergency indicators. Until now, panic events of any cause tend to be treated in a local manner. Various attempts to detect such events have been proposed based on traditional methods such as visual surveillance technologies and community engagement systems. The aim of this paper is twofold. First, it presents an innovative multimodal dataset containing biometric and spatiotemporal data associated with the detection of panic state in subjects that perform various activities during a certain period. For this purpose, time-enabled location data are combined with biometrics coming from wearables and smartphones that are analyzed in real-time and produce data indicating possible panic events that are geospatially described. Second, the proposed dataset is used to train various machine learning models, and their applicability to correctly distinguish panic states from normal behavior is thoroughly examined. As a result, the Gaussian SVM classifier ranked first among seven classifiers, achieving an accuracy score of 94.5%. The dataset was also tested in a deep learning framework, achieving an accuracy level of 93.4%. A long short-term memory approach was also used, which reached a top accuracy of 94%. Moreover, the contribution of the various biometric and geospatial features is analyzed in-depth to determine their partial importance in the overall panic detection process. This is moving towards the creation of a smart geo-referenced ERS that could be used to inform the authorities regarding a potentially unpleasant event by detecting possible crowd panic patterns and helping to act accordingly, getting the information right from the source of the event, the human body. The proposed dataset is freely distributed to the scientific community under the third version of GNU General Public License (GPL v3) through the GitHub platform.", "venue": "ISPRS Int. J. Geo Inf.", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-11-08", "journal": {"name": "ISPRS Int. J. Geo Inf.", "pages": "552", "volume": "11"}, "authors": [{"authorId": "2190346021", "name": "Ilias Lazarou"}, {"authorId": "51133862", "name": "A. Kesidis"}, {"authorId": "3263660", "name": "G. Hloupis"}, {"authorId": "8462092", "name": "A. Tsatsaris"}], "citations": [{"paperId": "b9a467e4a7d29a748c69dbb9b92464c3a55b6ed3", "title": "From Sensors to Safety: Internet of Emergency Services (IoES) for Emergency Response and Disaster Management"}, {"paperId": "45d709d105988feffbffa008ef6f14cba1be15e2", "title": "Real-Time Monitoring of Crowd Panic Based on Biometric and Spatiotemporal Data"}]}
