{"paperId": "77e1a9128f09729b8f4cd99b2c0112467dabc162", "publicationVenue": null, "title": "A.M.B.R.O.S.I.A: Providing Performant Virtual Resiliency for Distributed Applications", "abstract": "When writing today’s distributed programs, which frequently span both devices and cloud services, programmers are faced with complex decisions and coding tasks around coping with failure, especially when these distributed components are stateful. If their application can be cast as pure data processing, they benefit from the past 40-50 years of work from the database community, which has shown how declarative database systems can completely isolate the developer from the possibility of failure in a performant manner. Unfortunately, while there have been some attempts at bringing similar functionality into the more general distributed programming space, a compelling general-purpose system must handle non-determinism, be performant, support a variety of machine types with varying resiliency goals, and be language agnostic, allowing distributed components written in different languages to communicate. This paper introduces the first system, Ambrosia, to satisfy all these requirements. We coin the term “virtual resiliency”, analogous to virtual memory, for the platform feature which allows failure oblivious code to run in a failure resilient manner. We also introduce a programming construct, the “impulse”, which resiliently handles non-deterministic information originating from outside the resilient component. Of further interest to our community is the effective reapplication of much database performance optimization technology to make Ambrosia more performant than many of today’s non-resilient cloud solutions.", "venue": "", "year": 2019, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "2288556441", "name": "Jonathan Goldstein"}, {"authorId": "2288558034", "name": "Ahmed Abdelhamid"}, {"authorId": "2288561587", "name": "Mike Barnett"}, {"authorId": "2288546526", "name": "Sebastian Burckhardt"}, {"authorId": "2288557168", "name": "Badrish"}, {"authorId": "2288551136", "name": "Chandramouli"}, {"authorId": "2288551114", "name": "Darren Gehring"}, {"authorId": "2620157", "name": "Niel Lebeck"}, {"authorId": "2288546515", "name": "Christopher Meiklejohn"}, {"authorId": "1856878", "name": "U. F. Minhas"}, {"authorId": "2288551938", "name": "Ryan Newton"}, {"authorId": "1387122758", "name": "Rahee Peshawaria"}, {"authorId": "8833664", "name": "Tal Zaccai"}, {"authorId": "2288558256", "name": "Irene Zhang"}], "citations": [{"paperId": "03abd35bb56e4f3ad5c7b2236972ec49f5c5c303", "title": "Predicate-based push-pull communication for distributed CEP"}, {"paperId": "9b8778e098299b742423cc4a13a4c8f2f9c882f4", "title": "Netherite: Efficient Execution of Serverless Workflows"}, {"paperId": "fcf4c0ecb2d6b194fb0534fd2e4d5f5a233a5452", "title": "Durable functions: semantics for stateful serverless"}, {"paperId": "343ab5a191f326653fa3739607be6eebc8dffbb3", "title": "A Survey on Resilience in the IoT"}, {"paperId": "b03b55f6d5ba12b5a5a6f6d359977309cd5f8d7f", "title": "MuSE Graphs for Flexible Distribution of Event Stream Processing in Networks"}, {"paperId": "fd6e3e81abbc11ada2bedc639adcf83efb52503d", "title": "SurfaceFleet: Exploring Distributed Interactions Unbounded from Device, Application, User, and Time"}, {"paperId": "3f49dd417633b5f9526a31ec0874060e225a7d50", "title": "Making edge-computing resilient"}, {"paperId": "d3c5debfb04e09886f291fa246a057bbc296af1a", "title": "Beyond Analytics: The Evolution of Stream Processing Systems"}, {"paperId": "134b5cabd308b389883adf56ee703a1198680a4f", "title": "Reproducible Containers"}, {"paperId": "e662de9fe71eb31c9b84e4996bbbd1731e2b563e", "title": "A fault-tolerant programming model for distributed interactive applications"}, {"paperId": "190970015912cf1c1472882696693954ca1f416d", "title": "This paper is included in the Proceedings of the 2022 USENIX Annual Technical Conference."}, {"paperId": "9a5a6dd4e97d1bed2d00936561ebb511409b587a", "title": "This paper is included in the Proceedings of the 20th USENIX Symposium on Networked Systems Design and Implementation."}]}
