{"paperId": "77e7d7af7b4d498dce940dd407344e4a8f1f3883", "publicationVenue": {"id": "95d0dda7-5d58-4afd-b59f-315447b81992", "name": "IEEE Communications Surveys and Tutorials", "type": "journal", "alternate_names": ["IEEE Commun Surv Tutor"], "issn": "1553-877X", "url": "http://www.comsoc.org/cst", "alternate_urls": ["http://www.comsoc.org/livepubs/surveys/index.html", "https://ieeexplore.ieee.org/servlet/opac?punumber=7041148", "http://ieeexplore.ieee.org/servlet/opac?punumber=9739"]}, "title": "Electric Vehicle Charging: A Survey on the Security Issues and Challenges of the Open Charge Point Protocol (OCPP)", "abstract": "The increased use of smart Electric Vehicles (EVs) and Plug-in Electric Vehicles (PEV) opened a new area of research and development. The number of EV charging sites has considerably increased in residential as well as in public areas. Within these EV charging sites, various entities need to communicate in a secure and efficient way. The Open Charge Point Protocol (OCPP) offers a way to coordinate this communication and is already being used in many implementations. However, only the latest OCPP 2.0 version of the protocol includes certain security features. In this article, we present the entities that take part in an OCPP-based smart charging scenario, we identify security issues and threats and present solutions that have been proposed by scholars. We identify open security issues for OCPP and propose future research directions for the security enhancement of the protocol.", "venue": "IEEE Communications Surveys and Tutorials", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-07-05", "journal": {"name": "IEEE Communications Surveys & Tutorials", "pages": "1504-1533", "volume": "24"}, "authors": [{"authorId": "9836337", "name": "Zacharenia Garofalaki"}, {"authorId": "1813307", "name": "Dimitrios Kosmanos"}, {"authorId": "31949472", "name": "S. Moschoyiannis"}, {"authorId": "3236279", "name": "Dimitrios N. Kallergis"}, {"authorId": "1728886", "name": "C. Douligeris"}], "citations": [{"paperId": "cf04f68f145fc852c4667e88f7dee441a09d28ef", "title": "TLS-handshake for Plug and Charge in vehicular communications"}, {"paperId": "00583e885752e1a4d6f8727f90268b836a392cfd", "title": "Exploring the EV Charging Ecosystem and Performing an Experimental Assessment of its Cloud and Mobile Application Infrastructure Security"}, {"paperId": "a7b1c51927c8ccc35b3e6c9abb48048251d3c516", "title": "EV Charging Infrastructure Discovery to Contextualize Its Deployment Security"}, {"paperId": "fb3d0c9184ed3e9e3c547ed2b686839752e8beba", "title": "Optimal Spatial–Temporal Scheduling for EVs With Stochastic Behaviors and Possible Inauthentic Information"}, {"paperId": "afa7eab97f1476db4116a2e077df7d02844c15b8", "title": "Evaluation Framework for Electric Vehicle Security Risk Assessment"}, {"paperId": "a067a95570c2563d424df7be643775cc5bb1752e", "title": "Privacy-Preserving and Traceable Blockchain-Based Charging Payment Scheme for Electric Vehicles"}, {"paperId": "cf7ecd8e2ad3f47aae5a891543321455f8bbeac7", "title": "Disrupting EV Charging Sessions and Gaining Remote Code Execution with DoS, MITM, and Code Injection Exploits using OCPP 1.6"}, {"paperId": "db7c0ea98c34e78b026daa0cf52ea46aad578edc", "title": "Retrofitting Existing Charging Stations for Light Mobility: Enhancing Infrastructure to Support Sustainable Transportation"}, {"paperId": "f5e9f87eaf6b1b551e633e53e73270e8e8407394", "title": "Modelling of the Electric Vehicle Charging Infrastructure as Cyber Physical Power Systems: A Review on Components, Standards, Vulnerabilities and Attacks"}, {"paperId": "fc155203e468b2ad5e47ac43822360b81d0d950f", "title": "Charge Manipulation Attacks Against Smart Electric Vehicle Charging Stations and Deep Learning-based Detection Mechanisms"}, {"paperId": "fde49ec2785480b6b9b8c4d3649ccfde45ea5b75", "title": "HoneyEVSE: An Honeypot to emulate Electric Vehicle Supply Equipments"}, {"paperId": "68ca55ceee1f3e2816a3934f17d19633687e6303", "title": "Establishing communication between EV – EVSE – CSMS based on IEC61851-1 and OCPP 2.0.1 Standard"}, {"paperId": "a333a226b068953f90d0ca776db28f9ddcc47ad9", "title": "Ultra-fast charging of electric vehicles: A review of power electronics converter, grid stability and optimal battery consideration in multi-energy systems"}, {"paperId": "c1fa05f4bac6531099cacaf546a48125ecfd47e6", "title": "Enabling EV Roaming Through Cascading WebSockets in OCPP 1.6"}, {"paperId": "07deea192bf8b6141892abd2f3d57a1875ba7c89", "title": "Artificial Intelligence (AI) and Machine Learning (ML)-based Information Security in Electric Vehicles: A Review"}, {"paperId": "237f5ffc1e691907888e861c76a24363cb0a6aa5", "title": "Battery Charging Systems"}, {"paperId": "1be231567b5ee0de9c79d8610ddaa58fe9025bb7", "title": "An Integrated Transmission and Distribution Grid Model for the Cybersecurity Analysis of an EV Ecosystem"}, {"paperId": "5eaf653d184304c6f91f46dcd5b62e6ec45c0972", "title": "sTrade: Blockchain based secure energy trading using vehicle-to-grid mutual authentication in smart transportation"}, {"paperId": "bb43ce97da1ca2d84c21654c9296b5211b4ca96b", "title": "PREVENT: A Mechanism for Preventing Message Tampering Attacks in Electric Vehicle Networks"}, {"paperId": "a32a7931526c0b74e690f3863c27d405587495a2", "title": "Electric Vehicle Security and Privacy: A Comparative Analysis of Charging Methods"}, {"paperId": "e62bdef1253c614db977affa2352b7064a79892f", "title": "OCPP in the spotlight: threats and countermeasures for electric vehicle charging infrastructures 4.0"}, {"paperId": "f45032d28777ceecbcc08e483064cccbb66c3b04", "title": "Cybersecurity Challenges in Electric Vehicles: An initial literature review and research agenda"}, {"paperId": "f638e04eab6c0a844841ad33990b986a880ae642", "title": "Understanding Open Charge Point Protocol"}, {"paperId": "2577f0a58b80f228a546dab026a26a3118b955ed", "title": "Real Time Implementation of OCPP Communication Protocol for Electric Vehicle Supply Equipment"}, {"paperId": "2c28254585d08cac8cd79b44b75df0eae8a44067", "title": "DCA: Delayed Charging Attack on the Electric Shared Mobility System"}, {"paperId": "35690c538e3303f6e6b5f6855e7da214db11a491", "title": "Electric Vehicles Security and Privacy: Challenges, Solutions, and Future Needs"}, {"paperId": "af4e42fe9ef711ec2e6443edfc28f751f084c89e", "title": "Automatic Generation of Charging Point's Digital Twin for Virtual Commissioning of Their Automation Systems"}]}
