{"paperId": "77f62bda59b101b598846a71256b4941b4d4b163", "publicationVenue": {"id": "b5038ebc-7250-4e6b-807f-7150ef007dd1", "name": "Proceedings of the ACM on Measurement and Analysis of Computing Systems", "alternate_names": ["Proc ACM Meas Anal Comput Syst"], "issn": "2476-1249", "url": "https://dl.acm.org/pub.cfm?id=J1567"}, "title": "Design-Induced Latency Variation in Modern DRAM Chips", "abstract": "Variation has been shown to exist across the cells within a modern DRAM chip. Prior work has studied and exploited several forms of variation, such as manufacturing-process- or temperature-induced variation. We empirically demonstrate a new form of variation that exists within a real DRAM chip, induced by the design and placement of different components in the DRAM chip: different regions in DRAM, based on their relative distances from the peripheral structures, require different minimum access latencies for reliable operation. In particular, we show that in most real DRAM chips, cells closer to the peripheral structures can be accessed much faster than cells that are farther. We call this phenomenon design-induced variation in DRAM. Our goals are to i) understand design-induced variation that exists in real, state-of-the-art DRAM chips, ii) exploit it to develop low-cost mechanisms that can dynamically find and use the lowest latency at which to operate a DRAM chip reliably, and, thus, iii) improve overall system performance while ensuring reliable system operation. To this end, we first experimentally demonstrate and analyze designed-induced variation in modern DRAM devices by testing and characterizing 96 DIMMs (768 DRAM chips). Our characterization identifies DRAM regions that are vulnerable to errors, if operated at lower latency, and finds consistency in their locations across a given DRAM chip generation, due to design-induced variation. Based on our extensive experimental analysis, we develop two mechanisms that reliably reduce DRAM latency. First, DIVA Profiling uses runtime profiling to dynamically identify the lowest DRAM latency that does not introduce failures. DIVA Profiling exploits design-induced variation and periodically profiles only the vulnerable regions to determine the lowest DRAM latency at low cost. It is the first mechanism to dynamically determine the lowest latency that can be used to operate DRAM reliably. DIVA Profiling reduces the latency of read/write requests by 35.1%/57.8%, respectively, at 55°C. Our second mechanism, DIVA Shuffling, shuffles data such that values stored in vulnerable regions are mapped to multiple error-correcting code (ECC) codewords. As a result, DIVA Shuffling can correct 26% more multi-bit errors than conventional ECC. Combined together, our two mechanisms reduce read/write latency by 40.0%/60.5%, which translates to an overall system performance improvement of 14.7%/13.7%/13.8% (in 2-/4-/8-core systems) across a variety of workloads, while ensuring reliable operation.", "venue": "Proceedings of the ACM on Measurement and Analysis of Computing Systems", "year": 2017, "fieldsOfStudy": ["Computer Science", "Mathematics"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2017-06-05", "journal": {"name": "Proceedings of the ACM on Measurement and Analysis of Computing Systems", "pages": "1 - 36", "volume": "1"}, "authors": [{"authorId": "48893570", "name": "Donghyuk Lee"}, {"authorId": "2781428", "name": "S. Khan"}, {"authorId": "35164008", "name": "Lavanya Subramanian"}, {"authorId": "33801185", "name": "Saugata Ghose"}, {"authorId": "1999972", "name": "Rachata Ausavarungnirun"}, {"authorId": "3257164", "name": "Gennady Pekhimenko"}, {"authorId": "1720084", "name": "Vivek Seshadri"}, {"authorId": "145929920", "name": "O. Mutlu"}], "citations": [{"paperId": "c9edf92c1f762c52a90cc0cb45eb06d4eed82110", "title": "MIMDRAM: An End-to-End Processing-Using-DRAM System for High-Throughput, Energy-Efficient and Programmer-Transparent Multiple-Instruction Multiple-Data Computing"}, {"paperId": "d5f2e95be45d3e003655a9a84e0adda9468b0838", "title": "MIMDRAM: An End-to-End Processing-Using-DRAM System for High-Throughput, Energy-Efficient and Programmer-Transparent Multiple-Instruction Multiple-Data Processing"}, {"paperId": "6ba01138fcabdc9df56e8a69588a82fd91480a63", "title": "Spatial Variation-Aware Read Disturbance Defenses: Experimental Analysis of Real DRAM Chips and Implications on Future Solutions"}, {"paperId": "8c5ef03e9118253ec019965bf142d1be7998a453", "title": "Functionally-Complete Boolean Logic in Real DRAM Chips: Experimental Characterization and Analysis"}, {"paperId": "763488734b9b5f6f475838c43746cf16f3fe5b0a", "title": "Rethinking the Producer-Consumer Relationship in Modern DRAM-Based Systems"}, {"paperId": "ba25f77e417be575b0c41a400b116b82416df73c", "title": "Rowhammer Attacks in Dynamic Random-Access Memory and Defense Methods"}, {"paperId": "b173f464ef74f8bfa424e51e4ae43ec000eb67ad", "title": "Unity ECC: Unified Memory Protection Against Bit and Chip Errors"}, {"paperId": "ee68d4752c2763650a68d65564ae9eca1b6ba266", "title": "Understanding Read Disturbance in High Bandwidth Memory: An Experimental Analysis of Real HBM2 DRAM Chips"}, {"paperId": "3f42e18e10f251bd0e1ac25981f65451568ccc9b", "title": "CDAR-DRAM: Enabling Runtime DRAM Performance and Energy Optimization via In-Situ Charge Detection and Adaptive Data Restoration"}, {"paperId": "b5ace93de904d7ccebbc328d5fce45c2f8e671bb", "title": "Retrospective: RAIDR: Retention-Aware Intelligent DRAM Refresh"}, {"paperId": "70f2f94f9a2759eb86b0ed1079da0dce468e3f7c", "title": "Retrospective: An Experimental Study of Data Retention Behavior in Modern DRAM Devices: Implications for Retention Time Profiling Mechanisms"}, {"paperId": "ceda5606b2189405adb20b12424e12388acb0a4e", "title": "RowPress: Amplifying Read Disturbance in Modern DRAM Chips"}, {"paperId": "2dfbef5f657e7e53916dc2ed1038abd1e32c43e9", "title": "An Experimental Analysis of RowHammer in HBM2 DRAM Chips"}, {"paperId": "05f3fd64e1d6479a95458613381ad4fe595d0516", "title": "DSAC: Low-Cost Rowhammer Mitigation Using In-DRAM Stochastic and Approximate Counting Algorithm"}, {"paperId": "452a416cbd7cde150f6ab33df7ada10a4c1ff162", "title": "A Low-Cost Reduced-Latency DRAM Architecture With Dynamic Reconfiguration of Row Decoder"}, {"paperId": "0c7607f8da3936420c778a6418e2ea5d89f7775c", "title": "DRAM Bender: An Extensible and Versatile FPGA-Based Infrastructure to Easily Test State-of-the-Art DRAM Chips"}, {"paperId": "7c9b615fe6fc7409b837e2a5cfda1be13e36ef93", "title": "SpyHammer: Using RowHammer to Remotely Spy on Temperature"}, {"paperId": "85331dc894818f26e416688ff3f0535335f8768c", "title": "HiRA: Hidden Row Activation for Reducing Refresh Latency of Off-the-Shelf DRAM Chips"}, {"paperId": "07caf8168591f8598cd9aee06b49971f88e06ba5", "title": "Sectored DRAM: A Practical Energy-Efficient and High-Performance Fine-Grained DRAM Architecture"}, {"paperId": "f15b80ab5173a9cc3d7dd2353678e617e89bd54e", "title": "Self-Managing DRAM: A Low-Cost Framework for Enabling Autonomous and Efficient in-DRAM Operations"}, {"paperId": "5f9ba66514be76868e2a2d1c540a858b38ef5000", "title": "Understanding RowHammer Under Reduced Wordline Voltage: An Experimental Study Using Real DRAM Devices"}, {"paperId": "40b261c056da0e26f598b75000a6bccafffd09fd", "title": "A Case for Transparent Reliability in DRAM Systems"}, {"paperId": "00c6c8b3ac452a6710af1fd33011f24da5eccce9", "title": "DR-STRaNGe: End-to-End System Design for DRAM-based True Random Number Generators"}, {"paperId": "d0e452f841649e4dc50edfff3287fb2ea9be3f04", "title": "Extending Memory Capacity in Consumer Devices with Emerging Non-Volatile Memory: An Experimental Study"}, {"paperId": "361b14bbd0345f404c3be486464fb3cb6c78aad4", "title": "PiDRAM: A Holistic End-to-end FPGA-based Framework for Processing-in-DRAM"}, {"paperId": "62bc74c87efc71004c8b0c7e29ecc40d51c68cfd", "title": "A Deeper Look into RowHammer’s Sensitivities: Experimental Analysis of Real DRAM Chips and Implications on Future Attacks and Defenses"}, {"paperId": "3e234d3c5aa3730c05986090b8c42121c90aa4e9", "title": "Uncovering In-DRAM RowHammer Protection Mechanisms:A New Methodology, Custom RowHammer Patterns, and Implications"}, {"paperId": "7b78d629c823f6345343cce85a11f3d95aa4ac3e", "title": "Benchmarking Memory-Centric Computing Systems: Analysis of Real Processing-In-Memory Hardware"}, {"paperId": "f77a451dcd82fb6a35f079ac50bda2dfe3ef31a7", "title": "HARP: Practically and Effectively Identifying Uncorrectable Errors in Memory Chips That Use On-Die Error-Correcting Codes"}, {"paperId": "5e35f12c1764b8869d8e92c4dc86a3bac820aad3", "title": "Quantifying Server Memory Frequency Margin and Using It to Improve Performance in HPC Systems"}, {"paperId": "77c2faaf3f170822c3e37c4ecb4c8f13894b27ab", "title": "CODIC: A Low-Cost Substrate for Enabling Custom In-DRAM Functionalities and Optimizations"}, {"paperId": "12aac691cfdcd8fae14bda71ca93076009101bab", "title": "SIMDRAM: An End-to-End Framework for Bit-Serial SIMD Computing in DRAM"}, {"paperId": "d441e66baa101273fc5323a1fb05f5141f5a8a51", "title": "QUAC-TRNG: High-Throughput True Random Number Generation Using Quadruple Row Activation in Commodity DRAM Chips"}, {"paperId": "8e87c31c9174c254b824910e28b5bf66f274650e", "title": "Benchmarking a New Paradigm: An Experimental Analysis of a Real Processing-in-Memory Architecture"}, {"paperId": "8e85281351edfd13081f1175fb102836ccc4baca", "title": "DAMOV: A New Methodology and Benchmark Suite for Evaluating Data Movement Bottlenecks"}, {"paperId": "63a77243ccf7ae22fd545ebba64866e352782f50", "title": "SIMDRAM: a framework for bit-serial SIMD processing using DRAM"}, {"paperId": "7a210280d4775b1dfb36401a1007ac57602ab1e5", "title": "pLUTo: Enabling Massively Parallel Computation in DRAM via Lookup Tables"}, {"paperId": "887c229a88896265ee14d68bbc8a65edf6c192cc", "title": "Microcontroller Fingerprinting Using Partially Erased NOR Flash Memory Cells"}, {"paperId": "304b971520976e3a060abfd23399108434a3308e", "title": "BlockHammer: Preventing RowHammer at Low Cost by Blacklisting Rapidly-Accessed DRAM Rows"}, {"paperId": "ceae40ef15d8230940716b2f9c4a1f705ea8b05c", "title": "The Granularity Gap Problem: A Hurdle for Applying Approximate Memory to Complex Data Layout"}, {"paperId": "f58babc873f629090f213499f3dee18a2c507329", "title": "Intelligent Architectures for Intelligent Computing Systems"}, {"paperId": "db2c7eb1bad3ff523d303cf34a16cfa90fec680d", "title": "Reducing solid-state drive read latency by optimizing read-retry"}, {"paperId": "7bb6015f45457fdbe3bb39e17dc9cb0786ecd688", "title": "A Modern Primer on Processing in Memory"}, {"paperId": "46c462c389080d0eec5df105af5817e856bea89c", "title": "WoLFRaM: Enhancing Wear-Leveling and Fault Tolerance in Resistive Memories using Programmable Address Decoders"}, {"paperId": "6679cfabe152f418ea9d32efff4db874886fcfa8", "title": "Bit-Exact ECC Recovery (BEER): Determining DRAM On-Die ECC Functions by Exploiting DRAM Data Retention Characteristics"}, {"paperId": "9e5140f40c2dc97eff173fefe9d73337f4a523fc", "title": "FIGARO: Improving System Performance via Fine-Grained In-DRAM Data Relocation and Caching"}, {"paperId": "04621c422475a040e7a661a79559c64531dacc25", "title": "Intelligent Architectures for Intelligent Machines"}, {"paperId": "42cc29152f725c0f94646558b0d8ea379d55be5a", "title": "3D-Stacked Memory For Shared-Memory Multithreaded Workloads"}, {"paperId": "1b8ed306f0c9cca532f493bb654d9eea5ba128d6", "title": "The Virtual Block Interface: A Flexible Alternative to the Conventional Virtual Memory Framework"}, {"paperId": "ec6ca596b8a74e2a2c6a525fb9ccd3476c20eb3e", "title": "Revisiting RowHammer: An Experimental Analysis of Modern DRAM Devices and Mitigation Techniques"}, {"paperId": "c0efcbad169910782c3d17d08c689c43dd2bc631", "title": "StragglerHelper: Alleviating Straggling in Computing Clusters via Sharing Memory Access Patterns"}, {"paperId": "acdfe34aab867d1a0101c88dba299a56274388d8", "title": "CLR-DRAM: A Low-Cost DRAM Architecture Enabling Dynamic Capacity-Latency Trade-Off"}, {"paperId": "6316e1473e478c5ff5099b3b3b77b529d36f9f77", "title": "TRRespass: Exploiting the Many Sides of Target Row Refresh"}, {"paperId": "a5266677b9d76abbbd3805701c3a78104564e7ac", "title": "Are We Susceptible to Rowhammer? An End-to-End Methodology for Cloud Providers"}, {"paperId": "41e70b64c645693fac4c640a25a77909a32e4b7f", "title": "Robust Machine Learning Systems: Challenges,Current Trends, Perspectives, and the Road Ahead"}, {"paperId": "140c914f0add58a9599a2fa58eeb95cdd5365348", "title": "In-Memory Low-Cost Bit-Serial Addition Using Commodity DRAM Technology"}, {"paperId": "64de7c5a2434e8293c86dcc223283280a584604c", "title": "Demystifying Complex Workload-DRAM Interactions"}, {"paperId": "1cb4384fd0c37cdb8bc8e0a779a32cac8cd73ffe", "title": "Towards the Avoidance of Counterfeit Memory: Identifying the DRAM Origin"}, {"paperId": "2ca11e69ae23eb51cdbc35f9b6a2981b3f5fdc0c", "title": "Refresh Triggered Computation"}, {"paperId": "ae216775f6d86773da7eeac27d361de019f386bb", "title": "EDEN: Enabling Energy-Efficient, High-Performance Deep Neural Network Inference Using Approximate DRAM"}, {"paperId": "5d156f1d8ca37631c7ffd3d94ba373a20625df33", "title": "ComputeDRAM"}, {"paperId": "edbe28dd34307f8154624f4d69a21b2e103d4e0d", "title": "3D photonics as enabling technology for deep 3D DRAM stacking"}, {"paperId": "ed283e07932bd8e40a9eb7a3c2b183f318445ac0", "title": "Processing-in-memory: A workload-driven perspective"}, {"paperId": "49532cb16924c06454301f989e2c37c9accc6cd3", "title": "A Workload and Programming Ease Driven Perspective of Processing-in-Memory"}, {"paperId": "047238356ae93372a97be3b4cbd36ae6fee71ae5", "title": "Demystifying Complex Workload-DRAM Interactions: An Experimental Study"}, {"paperId": "de0c0e2df937e6a126f2322ea07d3e36080ed991", "title": "Understanding and Modeling On-Die Error Correction in Modern DRAM: An Experimental Study Using Real Devices"}, {"paperId": "b0197170bd915f3d4060096e5ffd8eed5f14f61f", "title": "CROW: A Low-Cost Substrate for Improving DRAM Performance, Energy Efficiency, and Reliability"}, {"paperId": "91e028dd30c114f1a0af539cf6ac86c20eda9f73", "title": "In-DRAM Bulk Bitwise Execution Engine"}, {"paperId": "a98041dc8b935f9c5ff2b1fd2ad1e772be03c6a7", "title": "Tiered-ReRAM: A Low Latency and Energy Efficient TLC Crossbar ReRAM Architecture"}, {"paperId": "f835e54450463440d0f9e21b1c1874db086fc44c", "title": "RowHammer: A Retrospective"}, {"paperId": "53a3c799e870dd99a2d0764655743053bc9d8d9d", "title": "RowHammer and Beyond"}, {"paperId": "4f17bd15a6f86730ac2207167ccf36ec9e6c2391", "title": "Processing Data Where It Makes Sense: Enabling In-Memory Computation"}, {"paperId": "680daccbd4b662ea8ccba859bd42e4b9df97d27d", "title": "Understanding the Interactions of Workloads and DRAM Types: A Comprehensive Experimental Study"}, {"paperId": "4af86a9f6e6e2d34c4e90fbf8c82026f79429055", "title": "Dataplant: Enhancing System Security with Low-Cost In-DRAM Value Generation Primitives"}, {"paperId": "8993082c9ae0fcd5f0545a850e5e4ef09a2d17d5", "title": "A191 THE NEURAL SIGNAL, CALCITONIN GENE-RELATED PEPTIDE (CGRG) ENHANCES A REGULATORY PHENOTYPE IN THE HUMAN IL-4-TREATED MACROPHAGE"}, {"paperId": "4746be9f3fa6d5816438b5a32a2d6db2966d6ee3", "title": "Large Scale Studies of Memory, Storage, and Network Failures in a Modern Data Center"}, {"paperId": "6fd3cf784f9608f57a4f9c26ad63d09f1e8419c5", "title": "Solar-DRAM: Reducing DRAM Access Latency by Exploiting the Variation in Local Bitlines"}, {"paperId": "b5d8306cb9f648b5567b934124010849ba752816", "title": "Reducing DRAM Latency via Charge-Level-Aware Look-Ahead Partial Restoration"}, {"paperId": "0a3dd16af1e98459a854b309b33dda53b332e348", "title": "The Processing-in-Memory Paradigm: Mechanisms to Enable Adoption"}, {"paperId": "5535fec7822abc2edc8e4a45df5432426b45e138", "title": "D-RaNGe: Using Commodity DRAM Devices to Generate True Random Numbers with Low Latency and High Throughput"}, {"paperId": "67cd6da17d4f51951d4dbfb3429c82fc77df7c52", "title": "Architectural Techniques for Improving NAND Flash Memory Reliability"}, {"paperId": "0f6e64b74fb20adc53749ca2dfb02332aab3ff3f", "title": "PreLatPUF: Exploiting DRAM Latency Variations for Generating Robust Device Signatures"}, {"paperId": "900421076ef05b56ba843ebcf80d991840104dcb", "title": "Exploiting DRAM Latency Variations for Generating True Random Numbers"}, {"paperId": "cc1eff4ad90308ced3d2a89e1d1150ce6bf83a4c", "title": "What Your DRAM Power Models Are Not Telling You"}, {"paperId": "65fec44db0d1b425fd46a8f01a35ea767dc36337", "title": "Improving 3D NAND Flash Memory Lifetime by Tolerating Early Retention Loss and Process Variation"}, {"paperId": "08328e40bf7b914b979b2f8ca45c54eaeb32cbf7", "title": "Processing Data Where It Makes Sense in Modern Computing Systems: Enabling In-Memory Computation"}, {"paperId": "b6388aea4fff822b953a3961d2f0cdfc675a44b8", "title": "VRL-DRAM: Improving DRAM Performance via Variable Refresh Latency"}, {"paperId": "3b23c39f21156f9ea86ad8bb2ca53b2cf56b4181", "title": "Predictable Performance and Fairness Through Accurate Slowdown Estimation in Shared Main Memory Systems"}, {"paperId": "305dea0339faabadcd591a31a6ad31e495f5f7d9", "title": "Flexible-Latency DRAM: Understanding and Exploiting Latency Variation in Modern DRAM Chips"}, {"paperId": "ed43aed792ce705ee7911d94dcabf72d7ce073f1", "title": "Exploiting Row-Level Temporal Locality in DRAM to Reduce the Memory Access Latency"}, {"paperId": "d2177743e33252be186e1fe131389d28fd1dddf9", "title": "Voltron: Understanding and Exploiting the Voltage-Latency-Reliability Trade-Offs in Modern DRAM Chips to Improve Energy Efficiency"}, {"paperId": "12b68cb06efdab086a80c638d21a2927e8d82f59", "title": "SoftMC: Practical DRAM Characterization Using an FPGA-Based Infrastructure"}, {"paperId": "dda7c10868d398a61d113a0671491422b57f9f93", "title": "Characterizing, Exploiting, and Mitigating Vulnerabilities in MLC NAND Flash Memory Programming"}, {"paperId": "6d3fd6c1f6b59c3f041a3bb416dfeb05f80a697e", "title": "Experimental Characterization, Optimization, and Recovery of Data Retention Errors in MLC NAND Flash Memory"}, {"paperId": "84dfc3ef4cbb24cf1a42203b15397d36983c00df", "title": "LISA: Increasing Internal Connectivity in DRAM for Fast Data Movement and Low Latency"}, {"paperId": "01fb05cb6bff252f829ead807251c6329a5f8d0b", "title": "RowClone: Accelerating Data Movement and Initialization Using DRAM"}, {"paperId": "77835f0049433f7f0d1c6c4fb9dbbeebf31b82d0", "title": "Adaptive-Latency DRAM: Reducing DRAM Latency by Exploiting Timing Margins"}, {"paperId": "df63fdb20669a8b7d3ba7dafebf75b9a94d7ba46", "title": "Exploiting the DRAM Microarchitecture to Increase Memory-Level Parallelism"}, {"paperId": "0cc9f0cf9fb45e57cdfea47f84b20474df4b9c61", "title": "Tiered-Latency DRAM: Enabling Low-Latency Main Memory at Low Cost"}, {"paperId": "a0796edf402715d2f0aae5168c1554ab5ebc26f2", "title": "Reducing DRAM Refresh Overheads with Refresh-Access Parallelism"}, {"paperId": "1f1a3f97b43d7fa4c8ea23db36d4148c4285248f", "title": "Holistic Management of the GPGPU Memory Hierarchy to Manage Warp-level Latency Tolerance"}, {"paperId": "4ea33217f6d927f22331bc23eee8daef7038e01c", "title": "High-Performance and Energy-Effcient Memory Scheduler Design for Heterogeneous Systems"}, {"paperId": "b360dd90e9ef6604be0b205686b894514f2998a1", "title": "A Memory Controller with Row Buffer Locality Awareness for Hybrid Memory Systems"}, {"paperId": "d79366509f04b9188837657d586fbf50b032dd22", "title": "Techniques for Shared Resource Management in Systems with Throughput Processors"}, {"paperId": "342ebf89fb87bd271ae3abc4512129f8db4e258d", "title": "The DRAM Latency PUF: Quickly Evaluating Physical Unclonable Functions by Exploiting the Latency-Reliability Tradeoff in Modern Commodity DRAM Devices"}, {"paperId": "0c4fe1f1a8043e8f4175b21faca1b72bff8033e6", "title": "Enabling the Adoption of Processing-in-Memory: Challenges, Mechanisms, Future Research Directions"}, {"paperId": "a5807e24d7f90f398e7ad8afe221f8edaf4e74e3", "title": "Understanding and Improving the Latency of DRAM-Based Memory Systems"}, {"paperId": "ade903df1e67fb59069b51a0a8fc227853a4a8dc", "title": "Errors in Flash-Memory-Based Solid-State Drives: Analysis, Mitigation, and Recovery"}, {"paperId": "a5d63bcc1ff5dcd305a556edd3e329d6784b161c", "title": "GRIM-Filter: Fast seed location filtering in DNA read mapping using processing-in-memory technologies"}, {"paperId": "4d23b5d9225f86efb56b0241c3a00349a6f51136", "title": "Detecting and Mitigating Data-Dependent DRAM Failures by Exploiting Current Memory Content"}, {"paperId": "35334a700a26ca41464ede7f27763a51c21e1b46", "title": "Ambit: In-Memory Accelerator for Bulk Bitwise Operations Using Commodity DRAM Technology"}, {"paperId": "4828a11ee5221ad6f7d97ae0c8ffec8c62c65fa8", "title": "Concurrent Data Structures for Near-Memory Computing"}, {"paperId": "ea4c3cda2f27cc9428789321363ba46304635b80", "title": "Error Characterization, Mitigation, and Recovery in Flash-Memory-Based Solid-State Drives"}, {"paperId": "3d83961bab2a7293f643c6839f60862de1959336", "title": "Using ECC DRAM to Adaptively Increase Memory Capacity"}, {"paperId": "0baee7d0bf986ddf9445dedb2bfb17ffb0c26c44", "title": "The reach profiler (REAPER): Enabling the mitigation of DRAM retention failures via profiling at aggressive conditions"}, {"paperId": "b74fbb8d5063711f4377ec4c80fd41c527f78422", "title": "Understanding Reduced-Voltage Operation in Modern DRAM Devices"}, {"paperId": "57f32185e2db8c373af40dcf643c81267a1a08c9", "title": "Architectural Techniques to Enable Reliable and Scalable Memory Systems"}, {"paperId": "15d849ab95745403c0c407641335c7938e3714d4", "title": "The RowHammer problem and other issues we may face as memory becomes denser"}, {"paperId": "071564baef078867847fc54a3a0b50dd22d29d62", "title": "SoftMC: A Flexible and Practical Open-Source Infrastructure for Enabling Experimental DRAM Studies"}, {"paperId": "5c478e5c774eb3cf71e446e2c9eb2166ca032b28", "title": "Understanding and Exploiting Design-Induced Latency Variation in Modern DRAM Chips"}, {"paperId": "0f41b9c0900b1c17b63d3d59bd4c334f7cf736af", "title": "Rethinking Memory System Design"}, {"paperId": "0855d63e5f68930cafd99b8e01472f196829d929", "title": "Heterogeneous-Reliability Memory: Exploiting Application-Level Memory Error Tolerance"}, {"paperId": "6eff535aaa0b344bbabd9f8b9928b3c14802e875", "title": "High-Performance and Power-Saving Mechanism for Page Activations Based on Full Independent DRAM Sub-Arrays in Multi-Core Systems"}, {"paperId": "30e469c369af4a4ddc6490d1bd2760c1c70ff57d", "title": "Extending Memory Capacity in Modern Consumer Systems With Emerging Non-Volatile Memory: Experimental Analysis and Characterization Using the Intel Optane SSD"}, {"paperId": "084809bcb66911c8cef94879311beb96d11bc6a6", "title": "Benchmarking a New Paradigm: Experimental Analysis and Characterization of a Real Processing-in-Memory System"}, {"paperId": "d1eb487fb036d05f5710f40d5217eb875a4b70e8", "title": "Sectored DRAM: An Energy-Efficient High-Throughput and Practical Fine-Grained DRAM Architecture"}, {"paperId": "f690fdf2b2e8eac966b4d6e0f75b3af5ed4e1803", "title": "EnTiered-ReRAM: An Enhanced Low Latency and Energy Efficient TLC Crossbar ReRAM Architecture"}, {"paperId": "8e46cf6a16eb1419b808ba3dda39f764508c62fa", "title": "Reliability Issues in Flash-Memory-Based Solid-State Drives: Experimental Analysis, Mitigation, Recovery"}]}
