{"paperId": "780060732049f47898dbe01eb450add1ea2db568", "publicationVenue": {"id": "eb7fffbe-b4f2-4801-a618-5ee8ef3cc742", "name": "IDAACS International Symposium on Wireless Systems", "type": "conference", "alternate_names": ["IDAACS-SWS", "IDAACS Int Symp Wirel Syst"], "url": "https://ieeexplore.ieee.org/xpl/conhome/1801997/all-proceedings"}, "title": "A Feature Selection Approach for Network Intrusion Detection Based on Tree-Seed Algorithm and K-Nearest Neighbor", "abstract": "Network intrusion detection is one of the hottest and most difficult issues in the field of network security. K-nearest neighbor technique is a kind of lazy classification algorithm which has been successfully applied to network intrusion detection. However, with the increase of the characteristic dimensions of network data, classification performance is significantly reduced. Considering that tree-seed algorithm(TSA)has good classification ability in reducing feature redundancy, it can be used in network intrusion detection. In the paper, the tree-seed algorithm(TSA) is introduced to extract the effective feature of the input data, and KNN is used for classification. A novel network intrusion detection model (KNN-TSA) based on K-nearest neighbor (KNN) and tree-seed algorithm (TSA) algorithm is proposed to select features to improve improve Classification efficiency of intrusion detection. This paper uses some data from UCI repository and KDD CUP 99 datasets to test the performance of the proposed model. Experimental results testify that the proposed model is able to remove the redundant features and reduce the input dimensions of classifier. In addition, it can improve the accuracy and efficiency of network intrusion detection.", "venue": "IDAACS International Symposium on Wireless Systems", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2018-09-01", "journal": {"name": "2018 IEEE 4th International Symposium on Wireless Systems within the International Conferences on Intelligent Data Acquisition and Advanced Computing Systems (IDAACS-SWS)", "pages": "68-72"}, "authors": [{"authorId": "2157325547", "name": "Feng Chen"}, {"authorId": "2082775", "name": "Z. Ye"}, {"authorId": "1824201", "name": "Chunzhi Wang"}, {"authorId": "3281646", "name": "Lingyu Yan"}, {"authorId": "2047414002", "name": "Ruoxi Wang"}], "citations": [{"paperId": "71dd806e38ba7c33b938e23bcfc291ac0034d29f", "title": "Hybrid ML-MDKL Feature Subset Selection and Classification Technique Accompanied with Rat Swarm Optimizer to Classify the Multidimensional Breast Cancer Mammogram Image"}, {"paperId": "bb814914c51f4f9476ed3764f9721631fde64495", "title": "Artificial intelligence algorithms for cyberspace security applications: a technological and status review"}, {"paperId": "97d5abea0e30b554c631aa40f85ec48ea068168f", "title": "Research on Adaptive 1DCNN Network Intrusion Detection Technology Based on BSGM Mixed Sampling"}, {"paperId": "c58bdc5a9d7f4063317a6937202cf6cf6c6028bb", "title": "Boosted CSIRT with AI powered open source framework"}, {"paperId": "a80106d624fc96fb11625cc1a6b617f71282ef82", "title": "A Review on Challenges and Future Research Directions for Machine Learning-Based Intrusion Detection System"}, {"paperId": "2687875db304b360ddc58238122b3bd9e668d6e5", "title": "Swarm intelligence for IoT attack detection in fog-enabled cyber-physical system"}, {"paperId": "6a445536000e5e98e89d0b27ffa06c435e0e7161", "title": "A novel adaptive memetic binary optimization algorithm for feature selection"}, {"paperId": "67ce920b574cbf63bb9b969de843b26191b68157", "title": "Random resampling algorithms for addressing the imbalanced dataset classes in insider threat detection"}, {"paperId": "7e571b64157178b25a2b244a831bb64f7e440c0a", "title": "DDOS attacks detection based on attention-deep learning and local outlier factor"}, {"paperId": "fc748d27cdcbc75a2bc88b3cd45053146dc14ef2", "title": "Machine Learning-Based Intrusion Detection System for the Internet of Vehicles"}, {"paperId": "6d55e6db1f7c4df1bc2c07eea87c060eea9e11aa", "title": "An Abnormal Traffic Detection Based on Attention-Guided Bidirectional GRU"}, {"paperId": "205fa7a3c2db296fd2be7c2508db6da8eef81485", "title": "The determinants of investment fraud: A machine learning and artificial intelligence approach"}, {"paperId": "3257d0c87b741f1c8cd42ec0a29f7e4316987c07", "title": "Cyberattack Feature Selection using Correlation-Based Feature Selection Method in an Intrusion Detection System"}, {"paperId": "52efeeefc7cd23dafa50219579852098eb32d7d7", "title": "An efficient intrusion detection system for MQTT-IoT using enhanced chaotic salp swarm algorithm and LightGBM"}, {"paperId": "351883a74f932ad2f848d252b7536e601bb6a9ea", "title": "A binary tree seed algorithm with selection-based local search mechanism for huge-sized optimization problems"}, {"paperId": "680001c10342b22c6dc815af5113acc6119562b3", "title": "Network Data Feature Selection in Detecting Network Intrusion using Supervised Machine Learning Techniques"}, {"paperId": "202ec140bcf3494632507131fb779558dc39e2f3", "title": "An Intrusion Detection Method Using ADASYN and Bayesian Optimized LightGBM"}, {"paperId": "4ca9a9b50da033c44f0cda270b3e91db7e668c0a", "title": "Context adaptive ensemble classification mechanism with multi‐criteria decision making for network intrusion detection"}, {"paperId": "b3c379507b63b1117d6b2b555d650b6b2663a478", "title": "MMM-RF: A novel high accuracy multinomial mixture model for network intrusion detection systems"}, {"paperId": "34edab246fc056f6737a4bfdd13d5030f04ed4fe", "title": "Effectively predicting cyber‐attacks through isolation forest learning‐based outlier detection"}, {"paperId": "81b690f85f56504d477c20dd8833d14c44714583", "title": "Advances in Tree Seed Algorithm: A Comprehensive Survey"}, {"paperId": "c9c1ee23cbce73431fbe49629ea6b9e8a39ae591", "title": "Evaluation of Machine Learning Algorithms for Detection of Malicious Traffic in SCADA Network"}, {"paperId": "ff76f2f356d054d80df1a9b6946a5739e7294317", "title": "A Review on Cybersecurity based on Machine Learning and Deep Learning Algorithms"}, {"paperId": "846532a56f96a15eac0f6e6f14ddf320e121158b", "title": "Adopting Machine Learning Blockchain Intrusion Detection for Protecting Attacks on Internet of Things"}, {"paperId": "5dbe348a219fc05fb271e5825793d2221ea15a6d", "title": "Important Features of CICIDS-2017 Dataset For Anomaly Detection in High Dimension and Imbalanced Class Dataset"}, {"paperId": "47dc4f4885f938632b2b87a0abb8b30e5d335ad1", "title": "A fast network intrusion detection system using adaptive synthetic oversampling and LightGBM"}, {"paperId": "bfe69e2f0e374a84c87e6e91a6ac538fb9f4bc2c", "title": "An anomaly detection parameter optimization algorithm for data center data"}, {"paperId": "227a7ca22374233f4e1a86e02d50247b2089b1cd", "title": "Research on feature selection for cyber attack detection in industrial Internet of Things"}, {"paperId": "b5b3cb479759c6625dede2d95b1140805dcc8e1c", "title": "Training Feed-Forward Multi-Layer Perceptron Artificial Neural Networks with a Tree-Seed Algorithm"}, {"paperId": "a1b267d58ef98e6335de967677386eba5edf0354", "title": "Scalable machine learning-based intrusion detection system for IoT-enabled smart cities"}, {"paperId": "cc3fd7613d2461b89d3c827ff98895961d4a1491", "title": "A Design of Intrusion Detection using Modified Bat Algorithm and Deep Autoencoder Network"}, {"paperId": "561ac012735f46fa1c619d220c4ce729fdde2824", "title": "Data mining, fuzzy AHP and TOPSIS for optimizing taxpayer supervision"}, {"paperId": "c90cb462019e93afc15757f5c03b270de00ed2dc", "title": "Machine Learning Models for Secure Data Analytics: A taxonomy and threat model"}, {"paperId": "6915a8ba649e7c7575ed4f907dea14117ce0e8dc", "title": "Improving Intrusion Detection System by Estimating Parameters of Random Forest in Boruta"}, {"paperId": "4bd703485635d6472008598f6bf54f56f034bf98", "title": "Insider Threat Detection Model Using Anomaly-Based Isolation Forest Algorithm"}, {"paperId": "62e930da1b9fc38514bb53f9e9ee2e3e607f6c4d", "title": "Performance Analysis of Network Attack DetectionFrameworkusing Machine Learning"}, {"paperId": "2e1d0daea8270a996f577430217e836bf7a780a3", "title": "Efficient Cyber Attack Detection on the Internet of Medical Things-Smart Environment Based on Deep Recurrent Neural Network and Machine Learning Algorithms"}, {"paperId": "400c5fdeb732e42084a9a4afa19802484c9f1a7f", "title": "Network Intrusion Detection Based on Supervised Adversarial Variational Auto-Encoder With Regularization"}, {"paperId": "6db57fa6c5be5290b88c4834a660186a68326838", "title": "Network Intrusion Detection Based on PSO-Xgboost Model"}, {"paperId": "9d8ee01d83c7466f28906d16ff62601de305ada8", "title": "CICIDS-2017 Dataset Feature Analysis With Information Gain for Anomaly Detection"}, {"paperId": "e42b4f723ddeb67dc4b7d94c91601ccae6199d0f", "title": "Peningkatan Akurasi K-Nearest Neighbor Pada Data Index Standar Pencemaran Udara Kota"}, {"paperId": "dc64936ce028b67b439b35d2643ca024f81c01f1", "title": "SELECTION FEATURES TO IMPROVE THE ACCURACY OF K-NEAREST NEIGHBOR"}, {"paperId": "47f174170e16f1fecee387f4ccb8f8d88ce1be74", "title": "EVALUATION OF DEEP LEARNING AND MACHINE LEARNING ALGORITHMS IN INTRUSION DETECTION SYSTEMS"}]}
