{"paperId": "78098c12a49c01522a7232e4295486156c77b7f0", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Energy-Aware Scheduling in Edge Computing Based on Energy Internet", "abstract": "Edge computing has been widely researched when 5G network and cloud platforms work together for people’s life. The limitation of energy provided by the battery of the edge device hinders its application. This paper focuses on task scheduling in edge computing combined with the Energy harvesting technology (EH) and Energy Internet (EI). The edge node collects green energy by EH. And nodes exchange energy by EI. Energy Internet obtains green energy from edge nodes. Compared to green energy, we call energy from the power grid (not from the energy of edge nodes by energy harvesting technology) brown energy. How to reduce brown energy consumption is one of the most important problem in our paper. Previous works have not examined the energy attenuation between nodes, neither have they studied the immigration routes of virtual machines (VMs). This paper analyzes VM scheduling and models the energy consumption of VM immigrations, offloading tasks, and green energy transfer in edge computing. The paper proposes a heuristic assumption that there is only one VM in the system, and then presents three heuristics for the system with multiple VMs. The simulation results show that the proposed - immigrated VMs with the minimum energy transferring attenuation ratio method (METAR) is effective in reducing brown energy and total energy consumption, and improving the utilization rate of green energy. Compared to the Energy-Efficiency problem solution (EE-PRO) and maximize task energy consumption scheduling (MTS), METAR average reduces by 28.23% and 49.50% in brown energy consumption. At the same time, METAR average decreases by 5.67% and 11.52% in execution time.", "venue": "IEEE Access", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "229052-229065", "volume": "8"}, "authors": [{"authorId": "2108056258", "name": "Qing Zhang"}, {"authorId": "2044334981", "name": "Xiaoyong Lin"}, {"authorId": "40161364", "name": "Yongsheng Hao"}, {"authorId": "2115219112", "name": "Jie Cao"}], "citations": [{"paperId": "337546b96b1f9f259c4104d83b793374823e03d5", "title": "Collaborative Service Placement, Task Scheduling, and Resource Allocation for Task Offloading With Edge-Cloud Cooperation"}, {"paperId": "e5e3804b65f0ea6ac083e0b13664c115e7b8c0b5", "title": "Critical Analysis of Life Span Improvement Techniques in Energy Constraints Edge IoT Devices"}, {"paperId": "50527521595eb9aa5a2e519bc9d9c13b710ef3b8", "title": "Analysis of wireless communication networks under edge computing scenarios"}, {"paperId": "9d8d6fdb3803b1cacaaffc647b0aa3a7ccf9c5c0", "title": "Teaching mechanism empowered by virtual simulation: Edge computing-driven approach"}, {"paperId": "eae91c85ba1ccc404ecc50c752c5e3963a0d6c3b", "title": "Fluid-Flow Approximation in the Analysis of Vast Energy-Aware Networks"}, {"paperId": "5ec117cad863af52e8c0d29e57817d7934a5499d", "title": "Proactive Virtual Machine Scheduling to Optimize the Energy Consumption of Computational Cloud"}]}
