{"paperId": "780a25c9673a6efda028601755eefcf3edf5e800", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Empirical Density Estimation based on Spline Quasi-Interpolation with applications to Copulas clustering modeling", "abstract": "Density estimation is a fundamental technique employed in various fields to model and to understand the underlying distribution of data. The primary objective of density estimation is to estimate the probability density function of a random variable. This process is particularly valuable when dealing with univariate or multivariate data and is essential for tasks such as clustering, anomaly detection, and generative modeling. In this paper we propose the mono-variate approximation of the density using spline quasi interpolation and we applied it in the context of clustering modeling. The clustering technique used is based on the construction of suitable multivariate distributions which rely on the estimation of the monovariate empirical densities (marginals). Such an approximation is achieved by using the proposed spline quasi-interpolation, while the joint distributions to model the sought clustering partition is constructed with the use of copulas functions. In particular, since copulas can capture the dependence between the features of the data independently from the marginal distributions, a finite mixture copula model is proposed. The presented algorithm is validated on artificial and real datasets.", "venue": "arXiv.org", "year": 2024, "fieldsOfStudy": ["Mathematics", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-02-18", "journal": {"name": "ArXiv", "volume": "abs/2402.11552"}, "authors": [{"authorId": "1768752698", "name": "C. Tamborrino"}, {"authorId": "2402872", "name": "Antonella Falini"}, {"authorId": "2269359063", "name": "Francesca Mazzia"}], "citations": []}
