{"paperId": "78192fe077eaad20e6cf856de3e77f63b5766b4c", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Adaptive Reward Computation in Reinforcement Learning-Based Continuous Integration Testing", "abstract": "Reinforcement learning (RL) has been applied to prioritizing test cases in Continuous Integration (CI) testing, where the reward plays a crucial role. It has been demonstrated that historical information-based reward function can improve the effectiveness of the test case prioritization (TCP). However, the inherent character of frequent iterations in CI can produce a considerable accumulation of historical information, which may decrease TCP efficiency and result in slow feedback. In this paper, the partial historical information is considered in the reward computation, where sliding window techniques are adopted to capture the possible efficient information. Firstly, the fixed-size sliding window is introduced to set a fixed length of recent historical information for each CI test. Then dynamic sliding window techniques are proposed, where the window size is continuously adaptive to each CI testing. Two methods are proposed, the test suite-based dynamic sliding window and the individual test case-based dynamic sliding window. The empirical studies are conducted on fourteen industrial-level programs, and the results reveal that under limited time, the sliding window-based reward function can effectively improve the TCP effect, where the NAPFD (Normalized Average Percentage of Faults Detected) and Recall of the dynamic sliding windows are better than that of the fixed-size sliding window. In particular, the individual test case-based dynamic sliding window approach can rank 74.18% failed test cases in the top 50% of the sorting sequence, with 1.35% improvement of NAPFD and 6.66 positions increased in TTF (Test to Fail).", "venue": "IEEE Access", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "36674-36688", "volume": "9"}, "authors": [{"authorId": "2152283242", "name": "Yang Yang"}, {"authorId": "2052100504", "name": "Chaoyue Pan"}, {"authorId": "2146248035", "name": "Zheng Li"}, {"authorId": "2701910", "name": "Ruilian Zhao"}], "citations": [{"paperId": "ff4666a59b7ff89c08bda51e3173b540db2fe4ce", "title": "Integration test order generation based on reinforcement learning considering class importance"}, {"paperId": "49bbeb8c5da8761dc69df0f94687890e8faa5f9b", "title": "Focus on New Test Cases in Continuous Integration Testing based on Reinforcement Learning"}, {"paperId": "21add9901523ad7f42e21460c0567642d3d9b75a", "title": "Continuous Delivery of Blockchain Distributed Applications"}]}
