{"paperId": "78201d43d5d0c7677e3d1b4188a11fcca3aabc0c", "publicationVenue": {"id": "2669396b-fea2-4bef-bf3f-7ddc0967feed", "name": "International journal of human computer interactions", "type": "journal", "alternate_names": ["Int j hum comput interact"], "issn": "2180-1347", "url": "http://www.cscjournals.org/"}, "title": "Smart Cities, Playable Cities, and Cybersecurity: A Systematic Review", "abstract": "ABSTRACT Smart cities connect humans to networks of information to create urban operating systems that optimize traffic management, sustainable energy use, and enact smart governance. The concept of playable cities has been advanced to create smart cities that are more human-centered. As smart cities are socio-technical structures involving technologies, people, and policies that each impact privacy and security, such an approach also has potential to develop stronger cybersecurity protocols for smart cities going beyond technological approaches. In this article, we conduct a systematic literature review of articles from 2015 to 2020 that discuss smart/playable cities and data gathering in relation to privacy and security. Based on this systematic review, we found a disconnect exists between smart and playable cities literature in terms of exclusive focus on technological solutions for security and little focus on people and policies as part of cybersecurity in the literature analyzed. Seeing as playable cities embrace user-generated co-creation, we argue that this personal side is important to get people to participate meaningfully in smart cities that lets them embrace cybersecurity policies as part of personal behavior. For this purpose, we propose utilizing a cybersecurity lens (e.g., McCumber cube model) so that smart city designers can more fully develop and consider cybersecurity that includes both personal privacy and playable approaches.", "venue": "International journal of human computer interactions", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-12-27", "journal": {"name": "International Journal of Human–Computer Interaction", "pages": "378 - 390", "volume": "39"}, "authors": [{"authorId": "3267035", "name": "Gustav Verhulsdonck"}, {"authorId": "143827144", "name": "Jennifer L. Weible"}, {"authorId": "3365360", "name": "S. Helser"}, {"authorId": "2006717684", "name": "N. Hajduk"}], "citations": [{"paperId": "1ce5cf3f174e90ae41cc16bbf4b7dda76876a5f6", "title": "Navigating Data Secrecy Challenges: A Study on Cyberespionage Intentions in the WFH Era"}, {"paperId": "dcdcc0fe44585d5028ef18542c5971dcb6e94c4a", "title": "Efficient Security and Privacy of Lossless Secure Communication for Sensor-Based Urban Cities"}, {"paperId": "9da03b3fb1891a6d5175d6efa41fce2425c76e4f", "title": "Metaheuristic algorithms for 6G wireless communications: Recent advances and applications"}, {"paperId": "e5c91a56231b98efe354227d884da74440b59fa0", "title": "The Cybersecurity Applied by Online Travel Agencies and Hotels to Protect Users’ Private Data in Smart Cities"}, {"paperId": "f3510fac603f6c61ed338c0bd583530c299bce73", "title": "Person Re-identification with Spatial Multi-granularity Feature Exploration for Social Risk Situational Assessment"}, {"paperId": "d75a088b5dae57fdf36d91cc1adff2d9afa6e64a", "title": "Enabling Technologies for Next-Generation Smart Cities: A Comprehensive Review and Research Directions"}, {"paperId": "22cafcd8393623c4e509fb67180385c36295d2b7", "title": "Information Security Applications in Smart Cities: A Bibliometric Analysis of Emerging Research"}, {"paperId": "91f1a29c5a9ea610c9281b8a6c90ea5b0cfd0ca7", "title": "A New Shift in Implementing Unmanned Aerial Vehicles (UAVs) in the Safety and Security of Smart Cities: A Systematic Literature Review"}, {"paperId": "67fef520f24cc1edafe2b7f1884f330ffba47c83", "title": "Intelligent Energy Management with IoT Framework in Smart Cities Using Intelligent Analysis: An Application of Machine Learning Methods for Complex Networks and Systems"}, {"paperId": "56eaabe593e01dc1a607e71f4bca44a55f2079af", "title": "Smart city governance from an innovation management perspective: Theoretical framing, review of current practices, and future research agenda"}, {"paperId": "a3639c6b1fb903e326ffc0a6fa95e598307cd989", "title": "Top-down and bottom-up collaboration as a factor in the technological development of smart city. The example of Taipei"}, {"paperId": "5b70992c851c9e5e7aea397f5945822ca18b2934", "title": "Phantom or Menace: User Behaviors in Cybersecurity"}]}
