{"paperId": "7822da688030ed01cb6e9eb10174a72100031b7e", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Analysis of the Possibility to Detect Road Vehicles via Bluetooth Technology", "abstract": "As road traffic networks become more congested and information systems are implemented to manage traffic flows, real-time data gathering becomes increasingly important. Classic detectors are placed in one point of the network and are able to provide information only from that area. As useful as this is, it lacks the big picture of the routes the vehicles usually travel. There are applications developed to help individuals make their way into the road network, but these are no solutions that deal with the cause of traffic; rather, they counteract the effects. It becomes obvious that a proper management system, with knowledge of all the relevant aspects will better serve all travelers. The detection solution proposed in this paper is based on Bluetooth detectors. This system is able to match detected devices in the road network, filter the results, and generate a vehicle count that is proved to follow RADAR detection results.", "venue": "Italian National Conference on Sensors", "year": 2021, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-11-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "21"}, "authors": [{"authorId": "3013623", "name": "Razvan Andrei Gheorghiu"}, {"authorId": "12311463", "name": "V. Iordache"}, {"authorId": "17670537", "name": "A. C. Cormos"}], "citations": [{"paperId": "5894ca0072cf2ce378deb09e3845b0f8cd70c8a4", "title": "Bayesian Mixture Model to Estimate Freeway Travel Time under Low-Frequency Probe Data"}, {"paperId": "a6b12fa870929da222a8f9a829509bfaa72d658f", "title": "Factors Influencing the Accuracy of Directional Traffic Volume Estimation at Signalized Interaction Using Bluetooth MAC Address"}]}
