{"paperId": "782fb765ee18108b3da4c8b672a62febc1f3edc6", "publicationVenue": null, "title": "A Review of Spatial Big Data Platforms, Opportunities, and Challenges", "abstract": "Abstract The advancements in remote sensing technologies and emergence of social networks, Internet of Things, and mobile devices have accelerated collection of spatial data from a wide variety of sources. For example, geo tagging in social media posts, location traces from mobile phones, and data streams from sensor networks are newly emerged spatial data sources. The size, type, and frequency of generation of these data exceed the capacity of Geographic Information System (GIS) hence called Spatial Big Data. Spatial Big Data forms a significant portion of Big Data generated across the globe and its proportion is growing rapidly. The effective processing and analysis of Spatial Big Data could trigger their state-of-the-art application for traffic analysis in smart cities, real-time monitoring of pandemic, safety of autonomous vehicles and more. The attainment of Spatial Big Data skills is no longer optional but has become inevitable in almost all the sectors. Hence in this paper a comprehensive view of development in Spatial Big Data storage, processing, analytics, and visualization platforms is presented. Some of the use cases for potential application of Spatial Big Data and challenges that need to be addressed to support their seamless design and implementation are also discussed in this paper.", "venue": "", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2020-07-02", "journal": {"name": "IETE Journal of Education", "pages": "80 - 89", "volume": "61"}, "authors": [{"authorId": "35277199", "name": "Swapnil Shrivastava"}], "citations": [{"paperId": "52461cb2ca4b2fd1fcff39cfb5ba24d823629ef4", "title": "Design of a community risk prevention big data platform with multi-agent collaboration"}, {"paperId": "67f5490e67f2b83d566cc5798a0a3b5958333d85", "title": "Geospatial Big Data Platforms: A Comprehensive Review"}, {"paperId": "3d7afe0267bada957aa2810c40b3b922b7b2c78f", "title": "Big Spatial Data Systems - A review"}, {"paperId": "9f7721136d58fa6367677d7d9c984bf3962ba92b", "title": "SmarT: Machine Learning Approach for Efficient Filtering and Retrieval of Spatial and Temporal Data in Big Data"}, {"paperId": "dccfbe93c99dc014464b070ac009a1b59853a06f", "title": "User-Centred Design of Multidisciplinary Spatial Data Platforms for Human-History Research"}]}
