{"paperId": "78320e40784cb39c01b1ebc7d5ed74fc52045619", "publicationVenue": {"id": "12a30c33-a624-44e7-b58e-adb66eec70f3", "name": "Bosnian Journal of Basic Medical Sciences", "type": "journal", "alternate_names": ["Bosn J Basic Med Sci"], "issn": "1512-8601", "url": "https://locatorplus.gov/cgi-bin/Pwebrecon.cgi?CNT=20&DB=local&SID=1&Search_Arg=%20%20%20%20%20%20101200947&Search_Code=0359&ti=1,1&v2=1", "alternate_urls": ["http://www.bjbms.org/"]}, "title": "Dysbiosis of gut microbiota in inflammatory bowel disease: Current therapies and potential for microbiota-modulating therapeutic approaches", "abstract": "There is a growing body of evidence reinforcing the unique connections between the host microbiome, health, and diseases. Due to the extreme importance of the symbiotic relationship between the intestinal microbiome and the host, it is not surprising that any alteration in the gut microbiota would result in various diseases, including inflammatory bowel disease (IBD), Crohn’s disease (CD) and ulcerative colitis (UC). IBD is a chronic, relapsing-remitting condition that is associated with significant morbidity, mortality, compromised quality of life, and costly medical care. Dysbiosis is believed to exacerbate the progression of IBD. One of the currently used treatments for IBD are anti-tumor necrosis factor (TNF) drugs, representing a biologic therapy that is reported to have an impact on the gut microbiota composition. The efficacy of anti-TNF agents is hindered by the possibility of non-response, which occurs in 10-20% of treated patients, and secondary loss of response, which occurs in up to 30% of treated patients. This underscores the need for novel therapies and studies that evaluate the role of the gut microbiota in these conditions. The success of any therapeutic strategy for IBD depends on our understanding of the interactions that occur between the gut microbiota and the host. In this review, the health and disease IBD-associated microbiota patterns will be discussed, in addition to the effect of currently used therapies for IBD on the gut microbiota composition, as well as new therapeutic approaches that can be used to overcome the current treatment constraints.", "venue": "Bosnian Journal of Basic Medical Sciences", "year": 2020, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2020-09-21", "journal": {"name": "Bosnian Journal of Basic Medical Sciences", "pages": "270 - 283", "volume": "21"}, "authors": [{"authorId": "1995577057", "name": "D. Alshehri"}, {"authorId": "3770723", "name": "O. Saadah"}, {"authorId": "4707435", "name": "M. Mosli"}, {"authorId": "6265182", "name": "S. Edris"}, {"authorId": "2100796076", "name": "Rashad R AlHindi"}, {"authorId": "6715900", "name": "A. Bahieldin"}], "citations": [{"paperId": "82e1e541c851a482f1009c37e32849046588bf45", "title": "The effect of anti-TNF drugs on the intestinal microbiota in patients with spondyloarthritis, rheumatoid arthritis, and inflammatory bowel diseases"}, {"paperId": "5ade2f39eeccdad44ca79450759f9351d9be0a94", "title": "Microbiome Dynamics: A Paradigm Shift in Combatting Infectious Diseases"}, {"paperId": "0d8703fe1405952ff0476c6af8d7690e198395af", "title": "Compositional and functional alteration of gut microbiota profiles in response to anti-TNF-α therapy in inflammatory bowel disease: A Pilot study"}, {"paperId": "54ee16378987b484f5e91127f381bc21fe789b30", "title": "An insight into genetic landscape of inflammatory bowel disease."}, {"paperId": "4aa173d112a20abb25540d5f3feadc6cba8803db", "title": "Diversity of the microbiota communities found in the various regions of the intestinal tract in healthy individuals and inflammatory bowel diseases"}, {"paperId": "91e070e7e1b299f3a1a5565b1dc2fe5df95c949d", "title": "The SYSCID map: a graphical and computational resource of molecular mechanisms across rheumatoid arthritis, systemic lupus erythematosus and inflammatory bowel disease"}, {"paperId": "96f0403a2a5637cb130a8810f69fc38352acd206", "title": "Evolution of a Pathogenic Microbiome"}, {"paperId": "1a814a4210cd308ce22b2d2359aba02346dd3847", "title": "Drug-microbiota interactions: an emerging priority for precision medicine"}, {"paperId": "26eabb1c43f0c79eb0980f388415365883509113", "title": "Probing the Relationship Between the Human Gut Microbiome and Prospects of Prostate Cancer: A Systematic Review"}, {"paperId": "d0acc7e903d97cd51164c6bbf45c35aa9b2ecf5d", "title": "Recent updates on correlation between reactive oxygen species and synbiotics for effective management of ulcerative colitis"}, {"paperId": "98db1c5ed38c2c1d2b932c5bf4bc634a2d6f7eb5", "title": "Lacticaseibacillus rhamnosus ATCC 53103 and Limosilactobacillus reuteri ATCC 53608 Synergistically Boost Butyrate Levels upon Tributyrin Administration Ex Vivo"}, {"paperId": "f42987e70eecd11a1d66379f0d5d5263ec78ed9d", "title": "Grape Processing Waste: Effects on Inflammatory Bowel Disease and Colorectal Cancer"}, {"paperId": "26b53cd397075c4dff840a38db31d078303a0166", "title": "Dose escalation randomised study of efmarodocokin alfa in healthy volunteers and patients with ulcerative colitis"}, {"paperId": "107ca9ff99e5f8b787418fe75c18e829e774e0b2", "title": "Composition of the gut microbiota in patients with inflammatory bowel disease in Saudi Arabia: A pilot study"}, {"paperId": "9f0a94d685e4099df36563546b572d08b66f6764", "title": "Parkinson’s Disease, It Takes Guts: The Correlation between Intestinal Microbiome and Cytokine Network with Neurodegeneration"}, {"paperId": "44134ef8108b4da144ff24b5f450c7f2b71f9d86", "title": "Homeostasis and Dysbiosis of the Intestinal Microbiota: Comparing Hallmarks of a Healthy State with Changes in Inflammatory Bowel Disease"}, {"paperId": "4fa7a438fd14f5a3dc78179776a55ad0cd61eb3c", "title": "Approaching the Gut and Nasal Microbiota in Parkinson’s Disease in the Era of the Seed Amplification Assays"}, {"paperId": "bcdce8e940a058c068abf7c2ecbce152ed0d6f4a", "title": "Intestinal microbiota and cardiovascular diseases"}, {"paperId": "7e92110211924848a0053bfc5e542317745b4bc7", "title": "Inhibitory effect of infliximab on orthodontic tooth movement in male rats."}, {"paperId": "22673dfffe791ecc2a5142e681df9e4bf3bf6d25", "title": "The mitigative effect of ovotransferrin-derived peptide IQW on DSS-induced colitis via alleviating intestinal injury and reprogramming intestinal microbes"}, {"paperId": "3ae80eaa048876545ff529d2c79e03f675e9dce2", "title": "Altered fecal microbial and metabolic profile reveals potential mechanisms underlying iron deficiency anemia in pregnant women in China"}, {"paperId": "f2430b97e74de2eef93b46096412f06288b023e0", "title": "Prebiotic potential of apple pomace and pectins from different apple varieties: Modulatory effects on key target commensal microbial populations"}, {"paperId": "b072803862cc1015d95ed33985bf8e1c5fafea8c", "title": "Arabinoxylan and Pectin Metabolism in Crohn’s Disease Microbiota: An In Silico Study"}, {"paperId": "59098906c446d3b6ddd6e439ceafc0f46c67a634", "title": "Intestinal epithelial Axin1 deficiency protects against colitis via altered gut microbiota"}, {"paperId": "0a12181a56c694bd524d9c5c7f2078c7cf8e6f14", "title": "Inflammatory Bowel Disease and COVID-19: How Microbiomics and Metabolomics Depict Two Sides of the Same Coin"}, {"paperId": "1ac7eef173e37ad736b878be47700a8e5283a5e3", "title": "Microbiota medicine: towards clinical revolution"}, {"paperId": "e74ab68840837493817a48d5f43aa12093e5ce14", "title": "Microbiota-targeted therapies in inflammation resolution."}, {"paperId": "11f34cbe669991e56b63bf44671439f4ffdcec3f", "title": "Nano-selenium stablilized by Konjac Glucommannan and its biological activity in vitro"}, {"paperId": "b25e783b5905ae1fabf603439d02f768e175c418", "title": "Association between Fecal Short-Chain Fatty Acid Levels, Diet, and Body Mass Index in Patients with Inflammatory Bowel Disease"}, {"paperId": "668e73029ec3ddc9ea9294b042379239b7aeeb44", "title": "The role of bacterial translocation in sepsis: a new target for therapy"}, {"paperId": "e8434da0c0b28463590dd063d917b938f324d798", "title": "Attributes of intestinal microbiota composition and their correlation with clinical primary non-response to anti-TNF-α agents in inflammatory bowel disease patients"}, {"paperId": "dd1135d8537f6fc1585a481a9a9c071ea210e124", "title": "Reconstruction of intestinal microecology of type 2 diabetes by fecal microbiota transplantation: Why and how"}, {"paperId": "bc33c961253f8dac2a05d6bf3dd598eecc845cf4", "title": "Intestinal Macrophages and Intestinal Infection"}, {"paperId": "f18c8f2a73172dee4fc6346c5a3cc8a1637ffc88", "title": "Animal Models of PCOS: A Comprehensive Review on Current Advancement, Diet-Microbiota Interactions and Future Trend on Developing PCOS Induced Rodent Models"}, {"paperId": "721889e229df3efc1c2b76349ebf3233dad5d83a", "title": "Gut microbiota-derived 5-hydroxyindole-3-acetic acid mediates the anti-colitis effect of Phellinus gilvus in mice"}, {"paperId": "c97d0e963d50ef576dd6a389bef72b718bd792ab", "title": "COVID-19 INFECTION IN INFLAMMATORY BOWEL DISEASE PATIENTS TREATED WITH TNF-Α ANTAGONISTS: A POSSIBLE CRITICTAL ENROLLMENT OF GUT MICROBIOTA AND VITAMIN D LEVEL – A REVIEW"}]}
