{"paperId": "7843287ffcd48bdf830f16465741a548c2ba8d66", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Generative AI for Math: Part I - MathPile: A Billion-Token-Scale Pretraining Corpus for Math", "abstract": "High-quality, large-scale corpora are the cornerstone of building foundation models. In this work, we introduce \\textsc{MathPile}, a diverse and high-quality math-centric corpus comprising about 9.5 billion tokens. Throughout its creation, we adhered to the principle of ``\\emph{less is more}'', firmly believing in the supremacy of data quality over quantity, even in the pre-training phase. Our meticulous data collection and processing efforts included a complex suite of preprocessing, prefiltering, language identification, cleaning, filtering, and deduplication, ensuring the high quality of our corpus. Furthermore, we performed data contamination detection on downstream benchmark test sets to eliminate duplicates. We hope our \\textsc{MathPile} can help to enhance the mathematical reasoning abilities of language models. We plan to open-source different versions of \\mathpile with the scripts used for processing, to facilitate future developments in this field.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-28", "journal": {"name": "ArXiv", "volume": "abs/2312.17120"}, "authors": [{"authorId": "3196852", "name": "Zengzhi Wang"}, {"authorId": "2253471115", "name": "Rui Xia"}, {"authorId": "2276753486", "name": "Pengfei Liu"}], "citations": [{"paperId": "3f75c088b44be491fa1060a0eb3064f61dfe70c3", "title": "Key-Point-Driven Data Synthesis with its Enhancement on Mathematical Reasoning"}, {"paperId": "186c3023473ad6093b654d4f4d8da64e0749fc32", "title": "ConceptMath: A Bilingual Concept-wise Benchmark for Measuring Mathematical Reasoning of Large Language Models"}, {"paperId": "574568e9403ca38d7b3e3c243e2a55ceeecc2ba8", "title": "Autonomous Data Selection with Language Models for Mathematical Texts"}, {"paperId": "af1d4a4141eaf52384ca85f1d468443f8f3d5c06", "title": "InternLM-Math: Open Math Large Language Models Toward Verifiable Reasoning"}, {"paperId": "35b142ea69598e6241f0011312128031df55895c", "title": "DeepSeekMath: Pushing the Limits of Mathematical Reasoning in Open Language Models"}, {"paperId": "f863fe7b55264760dec713728a49b7fa3da7b80f", "title": "Query of CC: Unearthing Large Scale Domain-Specific Knowledge from Public Corpora"}, {"paperId": "5ee871537ae51e7e2e93d2a70fff5d100649a655", "title": "Mathematical Language Models: A Survey"}, {"paperId": "98b607e7cb84e1a5c87c8a49562ae35435e6722d", "title": "Learning From Mistakes Makes LLM Better Reasoner"}]}
