{"paperId": "784b47289a2aae2f841454b25b63cb9b4d5d0ff1", "publicationVenue": {"id": "228761ec-c40a-479b-8309-9dcbe9851bcd", "name": "IEEE Internet of Things Journal", "type": "journal", "alternate_names": ["IEEE Internet Thing J"], "issn": "2327-4662", "url": "https://www.ieee.org/membership-catalog/productdetail/showProductDetailPage.html?product=PER288-ELE", "alternate_urls": ["https://ieeexplore.ieee.org/servlet/opac?punumber=6488907", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6488907", "http://ieee-iotj.org/#"]}, "title": "Queuing Algorithm for Effective Target Coverage in Mobile Crowd Sensing", "abstract": "In recent years, various researches have been conducted in order to find ways to cover a target or groups of targets with priority-based target coverage and sensor deployment mechanisms taking the front seats. However, with these researches, effective target coverage has been a recurrent issue due to various factors like conflict between sensors and excessive waiting time for targets to be covered. In this paper, we proposed an algorithm based on queuing theory in tandem with mobile crowd sensing to tackle these issues. To do this, first, we develop some models which are based on the birth-and-death mechanism (one of the tools in queuing theory) to determine how long a target has to wait, the mean busy period of sensors and mean idle period of sensors. While developing these models, we consider cases where there exist a single sensor and  $n$ -sensors in the system. Based on these models, we develop the required algorithm. The simulation result shows that as the number of sensors increases relative to the number of targets, an average time before a target gets discovered is 0.2 s and sensor utilization decreasing toward zero as the number of sensors increases.", "venue": "IEEE Internet of Things Journal", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2017-03-28", "journal": {"name": "IEEE Internet of Things Journal", "pages": "1046-1055", "volume": "4"}, "authors": [{"authorId": "22398583", "name": "Alex Adim Obinikpo"}, {"authorId": "49890284", "name": "Y. Zhang"}, {"authorId": "29907659", "name": "Houbing Song"}, {"authorId": "9533837", "name": "T. Luan"}, {"authorId": "22450805", "name": "Burak Kantarcih"}], "citations": [{"paperId": "516fda1eff2e26ed72e5a30c39f25ea71a45898d", "title": "Trustworthiness of Data in IoT Crowd Sensing Environments"}, {"paperId": "388afdab2e134f75020601ffec0a88003519915f", "title": "Participant selection algorithms for large-scale mobile crowd sensing environment"}, {"paperId": "659dd62316bfd10cd1ab43c423a5e2646746b412", "title": "Optimal Deployment of Solar Insecticidal Lamps Over Constrained Locations in Mixed-Crop Farmlands"}, {"paperId": "9be3a143189e37b547cf9011726023cf73bda137", "title": "Система вивантаження даних за технологією D2D у неліцензованому діапазоні частот у складі систем зв’язку 5G"}, {"paperId": "d1e25a80653445bc444d61d6c999441972b7c4fd", "title": "A Partition-Based Node Deployment Strategy in Solar Insecticidal Lamps Internet of Things"}, {"paperId": "76fabf22456f5549f320753cd65071c4c8dc9673", "title": "Energy Efficiency of the D2D Direct Connection System in 5G Networks"}, {"paperId": "fd30430085a67436698995943551f4665197c4e2", "title": "Security analysis of mobile crowd sensing applications"}, {"paperId": "489aa000fbbde59e5a465a2eb7f4628454bc14c6", "title": "A Probabilistic Model for the Deployment of Human-Enabled Edge Computing in Massive Sensing Scenarios"}, {"paperId": "ffb51b8d6a235713b283390221f781fc9b90d6b5", "title": "Coverage-Balancing User Selection in Mobile Crowd Sensing with Budget Constraint"}, {"paperId": "ce4d79197d15c26416ce6e75a914072a4089df2a", "title": "A Survey on Mobile Crowdsensing Systems: Challenges, Solutions, and Opportunities"}, {"paperId": "f10b110553955d4eb0bc803140f7dde44231040d", "title": "Data-Oriented Mobile Crowdsensing: A Comprehensive Survey"}, {"paperId": "3f433cb9ba0a3eb97b41019111db82807383067a", "title": "Multimedia Data Throughput Maximization in Internet-of-Things System Based on Optimization of Cache-Enabled UAV"}, {"paperId": "179de4c69b450b3a2d4ff69b8365639860d39ff0", "title": "Big data aggregation in the case of heterogeneity: a feasibility study for digital health"}, {"paperId": "40db68f43e8ff6487058ea2b84806dbc9513303b", "title": "Cost Effective Algorithms for Participant Selection Problem in Mobile Crowd Sensing Environment"}, {"paperId": "2a8466befaa2a9fe4eb8ea78d6a8e80bf44fe8d0", "title": "Internet of Music Things: an edge computing paradigm for opportunistic crowdsensing"}, {"paperId": "a6e3ad5c2062f0f66c8f1d8c60c46ede05c9f57d", "title": "Selective versus Non-Selective Acquisition of Crowd-Solicited IoT Data and Its Dependability"}, {"paperId": "82575e1f5073856059d9849fb2ac17ae70000897", "title": "Intelligent Gaming for Mobile Crowd-Sensing Participants to Acquire Trustworthy Big Data in the Internet of Things"}, {"paperId": "1e23ebfcc56bf9565e7a9ee67176aa9965e122d8", "title": "Novel MA-VFBC Based Deployment of Obstacle-Avoiding Scattered Sensors for Region-of-Interest Incidence Monitoring"}]}
