{"paperId": "788131b9cf42dfcd1b9b53d9b96a1dc832316a50", "publicationVenue": null, "title": "RESHAPING THE FUTURE OF RETAIL MARKETING THROUGH “BIG DATA”: A REVIEW FROM 2009 TO 2022", "abstract": "Technological revolutions have brought drastic changes in every field of life and Big Data is one of them. At the same time marketing function in retail organizations is also getting more sophisticated and personalized. Big Data has driven the digital transformation by gaining the faster insights from faster data. The increasing speed of data generation has made it very difficult for the organizations to extract useful data and take decisions accordingly. Organizations are using data driven decisions which not only help them to deal with industry challenges but also help them to take decisions based on the valuable data. There has been increasing emphasis in literature on big data but still it remains rather less explored area. The objective of this review article is to give readers an overview of work done in the field of big data especially in context of retail marketing. Thematic analysis has been used in the following review while using PRISMA framework to improve transparency in systematic review. Findings have been presented in the respective themes. Big data has emerged after 2008, keeping that in mind data from 2009-2022 is reviewed from good impact factor journals. The following reviewed paper address definitions, types of big data, different techniques, and methods used to extract information about customers and businesses from big data and key benefits of big data in retail marketing. In the end, future directions are stated from reviewed articles. As big data is in the initial stages of its development, for the enrichment of big data studies, different domains of business studies should be applied to big data. It will open new avenues for future research and lay the basic foundations", "venue": "", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": null, "journal": null, "authors": [{"authorId": "2132319774", "name": "Tanzeela Aqif"}, {"authorId": "2289376844", "name": "Abdul Wahab"}, {"authorId": "2289469465", "name": "Dhar Chang"}, {"authorId": "2289333011", "name": "Gary Xu"}], "citations": []}
