{"paperId": "78a31e06bbe7837d835ffb9747f8239b36ba8a16", "publicationVenue": null, "title": "AoI-Aware UAV-Enabled Marine MEC Networks with Integrated Sensing, Computation, and Communication", "abstract": "The rapid development of Internet of things (IoTs) communications and integrated sensing, computation, and communication (ISCC) technology has recently received widespread attention for mobile edge computing (MEC) networks. This paper considers a marine MEC system designed for efficient data sensing where an UAV is dispatched for data sensing from marine surface IoT devices, and then offloading to the remote marine base station for computation. The age of information (AoI) is introduced as the metric for evaluating the data freshness that is sensed by the marine IoT targets. In this marine MEC systems, we aim to minimize the average AoI of all marine IoT targets by jointly optimizing the trajectory of the UAV, the total number of time slots, the sensing scheduling policy of the data sensing. Since the optimization problem is difficult to solve by conventional schemes, we design a learning-based scheme that is leveraged by deep reinforcement learning algorithm to optimize the AoI minimization problem. The numerical results indicate that the proposed learning-based scheme is effective and robust compared with two benchmark schemes.", "venue": "2023 IEEE/CIC International Conference on Communications in China (ICCC Workshops)", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-08-10", "journal": {"name": "2023 IEEE/CIC International Conference on Communications in China (ICCC Workshops)", "pages": "1-6"}, "authors": [{"authorId": "2237082858", "name": "Wenchao Liu"}, {"authorId": "2211504180", "name": "Zhenzhen Jin"}, {"authorId": "2237108465", "name": "Xuhui Zhang"}, {"authorId": "2074914", "name": "Weilin Zang"}, {"authorId": "34479192", "name": "Shuqiang Wang"}, {"authorId": "46724143", "name": "Yanyan Shen"}], "citations": []}
