{"paperId": "78a6960fdc306313b38a3e9b4f0f2d5d183dc039", "publicationVenue": null, "title": "An Open-Source Workflow for Spatiotemporal Studies with COVID-19 as an Example", "abstract": "Many previous studies have shown that open-source technologies help democratize information and foster collaborations to enable addressing global physical and societal challenges. The outbreak of the novel coronavirus has imposed unprecedented challenges to human society. It affects every aspect of livelihood, including health, environment, transportation, and economy. Open-source technologies provide a new ray of hope to collaboratively tackle the pandemic. The role of open source is not limited to sharing a source code. Rather open-source projects can be adopted as a software development approach to encourage collaboration among researchers. Open collaboration creates a positive impact in society and helps combat the pandemic effectively. Open-source technology integrated with geospatial information allows decision-makers to make strategic and informed decisions. It also assists them in determining the type of intervention needed based on geospatial information. The novelty of this paper is to standardize the open-source workflow for spatiotemporal research. The highlights of the open-source workflow include sharing data, analytical tools, spatiotemporal applications, and results and formalizing open-source software development. The workflow includes (i) developing open-source spatiotemporal applications, (ii) opening and sharing the spatiotemporal resources, and (iii) replicating the research in a plug and play fashion. Open data, open analytical tools and source code, and publicly accessible results form the foundation for this workflow. This paper also presents a case study with the open-source spatiotemporal application development for air quality analysis in California, USA. In addition to the application development, we shared the spatiotemporal data, source code, and research findings through the GitHub repository.", "venue": "ISPRS Int. J. Geo Inf.", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-12-29", "journal": {"name": "ISPRS Int. J. Geo Inf.", "pages": "13", "volume": "11"}, "authors": [{"authorId": "2045204695", "name": "Anusha Srirenganathan Malarvizhi"}, {"authorId": "2152650213", "name": "Qian Liu"}, {"authorId": "97095966", "name": "D. Sha"}, {"authorId": "144910341", "name": "H. Lan"}, {"authorId": "98140935", "name": "Chaowei Yang"}], "citations": [{"paperId": "51fab78f03820d43bc2031d54668a50c4e890814", "title": "Geospatial Analytics Extension for KNIME"}, {"paperId": "99afd52f7759e5badd8fb5a873a915e766f84311", "title": "Effective Application of Artificial Intelligence Techniques in Security Risk Assessment and Dependency Analysis of Open Source Components"}, {"paperId": "25790fb108daeb22de1d646082ae28fd887b17b6", "title": "Improved intelligent methods for power transformer fault diagnosis based on tree ensemble learning and multiple feature vector analysis"}]}
