{"paperId": "78b4122d1c51638cdec9adee059493a976bcd831", "publicationVenue": {"id": "1dee5d6b-42c3-46a4-a423-263834ae8d52", "name": "Frontiers in Management Science", "type": "journal", "alternate_names": ["Front Manag Sci"], "issn": "2788-8592"}, "title": "Intelligence Information Intervention in Emergency Management of Emergencies: The Case of the “7.20 Zhengzhou Rainstorm”", "abstract": "Public emergencies can be divided into four categories: natural disasters, accidents and disasters, public health and social security. This paper discusses government countermeasures and measures in natural disaster emergency management, public health emergency management and information intervention management, and summarises and analyses them. In July 2021, a significant rainstorm and flooding disaster occurred in Zhengzhou, causing substantial damage to the area and attracting national attention. However, the development of emergency management and intelligence intervention in emergencies has gradually become chaotic, with problems such as “slow updates”, “one-sided reporting” and “low quality”; this has put massive pressure on the handling of intelligence information and online public opinion. Therefore, it is of great theoretical value and practical significance to explore the management of information interventions in emergency management of emergencies. Taking the “Zhengzhou 7.20” incident as the object of study, this paper uses literature analysis and case study methods to explore the shortcomings of the Zhengzhou municipal government in emergency management and information intervention, as well as the serious social losses and negative social impacts caused by the incident. The paper uses crisis theory, life cycle theory, coordination theory and membrane technology to analyse the emergency management and information intervention in this emergency. In response to the problems encountered in the Zhengzhou incident and the reasons for the shortcomings of information intervention in emergency management, corresponding suggestions and countermeasures for improvement are put forward. Moreover, suggestions and model diagrams are given on how to build a perfect information system, hoping to provide some reference values for better-solving emergency events in the future.", "venue": "Frontiers in Management Science", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-01", "journal": {"name": "Frontiers in Management Science"}, "authors": [{"authorId": "2171647129", "name": "Ruichen Liu"}], "citations": [{"paperId": "406ce6ac2f03ca402ac3f4abd2a202135ae9796b", "title": "Emotion Recognition and Management in the Tourism Industry During Emergency Events Using Improved Convolutional Neural Network"}]}
