{"paperId": "78b86d2cf79ee230316e832e8838fb68ee26947c", "publicationVenue": {"id": "2ca4279c-8ed7-4280-8022-09e577923a09", "name": "Frontiers in Neuroscience", "type": "journal", "alternate_names": ["Front Neurosci"], "issn": "1662-453X", "url": "https://www.frontiersin.org/journals/neuroscience", "alternate_urls": ["http://journal.frontiersin.org/journal/neuroscience", "http://www.frontiersin.org/neuroscience/"]}, "title": "Research progress on acupuncture treatment in central nervous system diseases based on NLRP3 inflammasome in animal models", "abstract": "Central nervous system (CNS) disorders exhibit complex neurophysiological and pathological mechanisms, which seriously affect the quality of life in patients. Acupuncture, widely accepted as complementary and alternative medicine, has been proven to exert significant therapeutic effects on CNS diseases. As a part of the innate immune system, NLRP3 inflammasome contributes to the pathogenesis of CNS diseases via regulating neuroinflammation. To further explore the mechanisms of acupuncture regulating NLRP3 inflammasome in CNS diseases, our study focused on the effects of acupuncture on neuroinflammation and the NLRP3 inflammasome in vascular dementia, Alzheimer’s disease, stroke, depression, and spinal cord injury. This study confirmed that the activation of NLRP3 inflammasome promotes the development of CNS diseases, and inhibiting the activation of NLRP3 inflammasome is a potential key target for the treatment of CNS diseases. In addition, it is concluded that acupuncture alleviates neuroinflammation by inhibiting the activation of the NLRP3 inflammasome pathway, thereby improving the progression of CNS diseases, which provides a theoretical basis for acupuncture to attenuate neuroinflammation and improve CNS diseases.", "venue": "Frontiers in Neuroscience", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2023-02-28", "journal": {"name": "Frontiers in Neuroscience", "volume": "17"}, "authors": [{"authorId": "2108557106", "name": "Hai-ming Zhang"}, {"authorId": "2061548499", "name": "Dan Luo"}, {"authorId": "2118229989", "name": "Rui Chen"}, {"authorId": "2136383002", "name": "Shu-Han Wang"}, {"authorId": "2190942862", "name": "Yajun Zhao"}, {"authorId": "2109017308", "name": "Jinxiao Li"}, {"authorId": "1477690566", "name": "Min-feng Zhou"}, {"authorId": "5739425", "name": "Zhao-Min Yu"}, {"authorId": "2210263184", "name": "Jun-Li Zhang"}, {"authorId": "153059359", "name": "F. Liang"}], "citations": [{"paperId": "5bf803164076d08cb24b4e3ff726c4008a16eff3", "title": "Global Trends of fMRI Studies on Acupuncture for CNS Diseases over the Past Two Decades: A Bibliometric Analysis"}, {"paperId": "ec310f67deeaf128cfb85f958c1865778914ae3b", "title": "Plants, phytochemicals, and natural practices in complementary and alternative system of medicine for treatment of central nervous system disorders"}]}
