{"paperId": "78be87cbee9cc13b8c992480ea227bc1f79f7bd8", "publicationVenue": {"id": "40e3ce3f-da3f-4cfd-a1f5-313fa98e94ff", "name": "Journal of applied entomology", "type": "journal", "alternate_names": ["J Appl Èntomol", "Journal of Applied Entomology", "J appl èntomol"], "issn": "0931-2048", "url": "http://onlinelibrary.wiley.com/journal/10.1111/(issn)1439-0418", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/14390418"]}, "title": "Susceptibility assessment and mapping of Ips typographus (L.) (Coleoptera: Curculionidae) in oriental spruce forests in Artvin, Turkey", "abstract": "Ips typographus, which was first identified in 1984 in the oriental spruce forests of Artvin, Turkey, has killed millions of cubic metres of trees. Severe outbreaks of I. typographus following storms resulting in fallen trees and salvage logging done as a part of control activities have caused gaps in the stand canopy of oriental spruce forests. These forests, which have many important functions, such as supplying water, soil conservation and preventing natural disasters in the area they spread, have a fragmented structure because of beetle damages and various traditional utilization practices of the local community. In this study, the local spread of I. typographus in the forests of Hatila Valley National Park and the neighbouring Taşlıca Forest Sub‐District was evaluated, and the areas susceptible to the beetle were determined using the frequency ratio method. A total of 120 pheromone traps were employed in the study. A beetle density map of the study area was produced using the inverse distance weighting interpolation method based on the total number of beetles caught by the traps. Then, the correlation between the regions with high I. typographus density and environmental factors that contributed to this situation were determined using the frequency ratio method. An average 6528.70 beetles were caught by the pheromone traps as a result of this study. The density of the beetles was high in 60.64% of the study area, and an average 10,844.25 beetles were caught by the pheromone traps in these areas. The difference in the total number of beetles between areas with high beetle density and those with low or medium beetle density was significant. It was determined that 32.53% of the study area had very high or high susceptibility to I. typographus. Different parameters such as altitude, slope, aspect, distance to forest roads, stand type, topographic wetness index and area solar radiation were found to be associated with the susceptibility of an area to I. typographus.", "venue": "Journal of applied entomology", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-07-05", "journal": {"name": "Journal of Applied Entomology", "pages": "1185 - 1199", "volume": "146"}, "authors": [{"authorId": "2048151946", "name": "Hazan ALKAN AKINCI"}, {"authorId": "153071349", "name": "Ç. Genç"}, {"authorId": "33915613", "name": "H. Akıncı"}], "citations": [{"paperId": "74b1943bfd0373bf2710bb8c60cd7dd9ec1c30a9", "title": "Ips typographus (L.) (Coleoptera: Curculionidae: Scolytinae)’un kitle halinde yakalanmasında kullanılan feromon tuzaklarında tespit edilen hedef olmayan böcek türleri ve önemi"}, {"paperId": "a7cdfd837d90febf7d8d3c0d4f7a2e752197ccf8", "title": "Comparative study of the analytical hierarchy process, frequency ratio, and logistic regression models for predicting the susceptibility to Ips sexdentatus in Crimean pine forests"}]}
