{"paperId": "78cbdf836064fd693ac13f3f715a2195e9ced92f", "publicationVenue": {"id": "5e07a437-469d-4072-9d25-ea2d144e1601", "name": "Conference on Innovation in Clouds, Internet and Networks", "type": "conference", "alternate_names": ["ICIN", "Conf Innov Cloud Internet Netw"]}, "title": "Service-based Federated Deep Reinforcement Learning for Anomaly Detection in Fog Ecosystems", "abstract": "With Digital transformation, the diversity of services and infrastructure in backhaul fog network(s) is rising to unprecedented levels. This is causing a rising threat of a wider range of cyber attacks coupled with a growing integration of constrained range of infrastructure, particularly seen at the network edge. Deep reinforcement-based learning is an attractive approach to detecting attacks, as it allows less dependency on labeled data with better ability to classify different attacks. However, current approaches to learning are known to be computationally expensive (cost) and the learning experience can be negatively impacted by the presence of outliers and noise (quality). This work tackles both the cost and quality challenges with a novel service-based federated deep reinforcement learning solution, enabling anomaly detection and attack classification at a reduced data cost and with better quality. The federated settings in the proposed approach enable multiple edge units to create clusters that follow a bottom-up learning approach. The proposed solution adapts deep Q-learning Network (DQN) for service-tunable flow classification, and introduces a novel federated DQN (FDQN) for federated learning. Through such targeted training and validation, variation in data patterns and noise is reduced. This leads to improved performance per service with lower training cost. Performance and cost of the solution, along with sensitivity to exploration parameters are evaluated using an example publicly available dataset (UNSW-NB15). Evaluation results show the proposed solution to maintain detection accuracy with lower data supply, while improving the classification rate by a factor of ≈ 2.", "venue": "Conference on Innovation in Clouds, Internet and Networks", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-03-06", "journal": {"name": "2023 26th Conference on Innovation in Clouds, Internet and Networks and Workshops (ICIN)", "pages": "121-128"}, "authors": [{"authorId": "1404810662", "name": "M. Al-Naday"}, {"authorId": "2179135556", "name": "Martin J. Reed"}, {"authorId": "2212143777", "name": "Vlad Dobre"}, {"authorId": "3280633", "name": "S. Toor"}, {"authorId": "1803683", "name": "B. Volckaert"}, {"authorId": "1715957", "name": "F. Turck"}], "citations": [{"paperId": "b15615850bd65c9c4c0363ea122232e4a6770c2d", "title": "Machine Learning and Deep Learning Techniques for Internet of Things Network Anomaly Detection—Current Research Trends"}, {"paperId": "61470e1723d8a9ffeb2250874061e813f7712707", "title": "Federated deep Q-learning networks for service-based anomaly detection and classification in edge-to-cloud ecosystems"}]}
