{"paperId": "78cc4d17769c6cfbbf4aaf62751cecfa5231064c", "publicationVenue": {"id": "c0ded351-0e49-473e-816e-23b84c9f8dd3", "name": "Frontiers in Environmental Science", "type": "journal", "alternate_names": ["Front Environ Sci"], "issn": "2296-665X", "url": "http://www.frontiersin.org/Environmental_Science", "alternate_urls": ["https://www.frontiersin.org/journals/environmental-science"]}, "title": "The Applicability of Big Data in Climate Change Research: The Importance of System of Systems Thinking", "abstract": "The aim of this paper is to provide an overview of the interrelationship between data science and climate studies, as well as describes how sustainability climate issues can be managed using the Big Data tools. Climate-related Big Data articles are analyzed and categorized, which revealed the increasing number of applications of data-driven solutions in specific areas, however, broad integrative analyses are gaining less of a focus. Our major objective is to highlight the potential in the System of Systems (SoS) theorem, as the synergies between diverse disciplines and research ideas must be explored to gain a comprehensive overview of the issue. Data and systems science enables a large amount of heterogeneous data to be integrated and simulation models developed, while considering socio-environmental interrelations in parallel. The improved knowledge integration offered by the System of Systems thinking or climate computing has been demonstrated by analysing the possible inter-linkages of the latest Big Data application papers. The analysis highlights how data and models focusing on the specific areas of sustainability can be bridged to study the complex problems of climate change.", "venue": "Frontiers in Environmental Science", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2021-03-17", "journal": {"volume": "9"}, "authors": [{"authorId": "15546854", "name": "V. Sebestyén"}, {"authorId": "2024985239", "name": "Tímea Czvetkó"}, {"authorId": "1976610", "name": "J. Abonyi"}], "citations": [{"paperId": "91a8064acbfc85ba59e89e4a9b94b9829ce5aa10", "title": "Recently emerging trends in big data analytic methods for modeling and combating climate change effects"}, {"paperId": "bfcbf7c173a67984ab1f84a366b90bcb9e302727", "title": "Unleashing the power of artificial intelligence for climate action in industrial markets"}, {"paperId": "0a3e0af94b4ac7f5927c660e2c830097c68c7f3e", "title": "Climate Risks Resilience Development: A Bibliometric Analysis of Climate-Related Early Warning Systems in Southern Africa"}, {"paperId": "370c224ae3abc2309b3b67dac3b8a196d95530a5", "title": "Exploring Trends in Global Temperature: A Data Analysis Approach"}, {"paperId": "ee059a481ce3ec8e575e55552a5d4bfaab9521d3", "title": "Climate Changes through Data Science: Understanding and Mitigating Environmental Crisis"}, {"paperId": "9e0e6b0b2bc305a739f1d60c78be3dd6ba8549a2", "title": "Transformers for Modeling Long-Term Dependencies in Time Series Data: A Review"}, {"paperId": "5a00fbf6020d2220a7ef76ed3065d7d11bb381f5", "title": "Evaluation of coupling coordination development between digital economy and green finance: Evidence from 30 provinces in China"}, {"paperId": "f015def21eecf8ae12d1fc37736206449b25b6cc", "title": "Machine-Learning-Based Imputation Method for Filling Missing Values in Ground Meteorological Observation Data"}, {"paperId": "db45158ac55dc875bdd07b04c09356bb954a1afe", "title": "Enhancing Climate Adaptation Through Hybrid Energy Systems"}, {"paperId": "93bd231c1b826280e02de2b90788bd5cd07ca09b", "title": "Incorporating big data and IoT in intelligent ecosystems: state-of-the-arts, challenges and opportunities, and future directions"}, {"paperId": "68efa61460da24de26923a1c01ecaed08a0ab5ee", "title": "What is “big data” and how should we use it? The role of large datasets, secondary data, and associated analysis techniques in outdoor recreation research"}, {"paperId": "59d003adb16290d283e3608f25e79543bc6d1e7d", "title": "An Ensemble Machine Learning Approach for Tropical Cyclone Localization and Tracking From ERA5 Reanalysis Data"}, {"paperId": "48ac4085301aadf276448d54112ca579db370db7", "title": "Exploring the accuracy of correlation coefficients representing the long-term meteorological data for projecting weather in Bahrain for sustainability"}, {"paperId": "b1ccba5517c1b259a4dda371096af729e4140915", "title": "Exploring CO2 emission in developing countries by PCA and time series analysis"}, {"paperId": "65b5e5f618fd2df7955e1fac7a0bc65ebb171557", "title": "IoT-BASED CLIMATE CHANGE PREDICTION SYSTEM"}, {"paperId": "e41ee6f0f8549a54c33b5d6b1c59e64144ad4b1f", "title": "An interdisciplinary approach to artificial intelligence in agriculture"}, {"paperId": "6e2fd9673618dae329c46c58aa4aa8fcd5066a3d", "title": "Drivers to mitigate climate change in context of manufacturing industry: An emerging economy study"}, {"paperId": "740e92d8929bbeb5e3656c8b5911a7716aa23465", "title": "A Review on Sustainable Agriculture and Production- Challenges and Opportunities"}, {"paperId": "73871e3d035a2e3cabc623b8bdef5a27d7f2e835", "title": "The impact of temperature on labor productivity——evidence from temperature-sensitive enterprises"}, {"paperId": "739a34c7202fe1a52c0041520111bb1f6f3e38bd", "title": "Dispersion and Disparity: Bibliometric and Visualized Analysis of Research on Climate Change Science Communication"}, {"paperId": "43a96851cf5bf8e364fb9e8d90eaf10b51cd47e7", "title": "Predicting climate factors based on big data analytics based agricultural disaster management"}, {"paperId": "f670a90786796cd2730ec2fd6cbbaa6e66c1c484", "title": "Growth performance and scale insect infestation of Shorea leprosula in a common garden experimental plot"}, {"paperId": "b339c09878455da211ac5dd19d6a181d9148baad", "title": "Agricultural Big Data Architectures in the Context of Climate Change: A Systematic Literature Review"}, {"paperId": "996a97c825a19aee3dc890455fcdfabeeeadb8ec", "title": "Promoting uptake and integration of climate smart agriculture technologies, innovations and management practices into policy and practice in Nigeria"}, {"paperId": "d90f339575b434d3e3ed42714e9e2a3dda081488", "title": "Polar night jet characterization through artificial intelligence"}, {"paperId": "8d5e1f211490bb733ef52b1a3394c6250847174b", "title": "Towards adoption of mobile data collection for effective adaptation and climate risk management in Africa"}, {"paperId": "432a2119f7403ef61034e51391cb1aa2896ed66e", "title": "Examining the Nexus between the Vs of Big Data and the Sustainable Challenges in the Textile Industry"}, {"paperId": "bfc8a29fe76bfe515f391302ff5e6b255b6db61e", "title": "SmartAirQ: A Big Data Governance Framework for Urban Air Quality Management in Smart Cities"}, {"paperId": "b6b3f2683ac9c1b74639510f565c3c99c7d5581c", "title": "Climate to COVID, global to local, policies to people: a biopsychosocial ecological framework for syndemic prevention and response in behavioral medicine."}, {"paperId": "0c1d627ca4908ac0cd04293e6fc1476a877cc4e0", "title": "Prospects of an agricultural drought early warning system in South Africa"}, {"paperId": "29fadb5641ca44cb7e006377993b6f0beb8a0894", "title": "DeepSense: A Physics-Guided Deep Learning Paradigm for Anomaly Detection in Soil Gas Data at Geologic CO2 Storage Sites."}, {"paperId": "52acfe760074ba98587cf01af15fc506c8153be3", "title": "NOAA Open Data Dissemination (formerly NOAA Big Data Project / Program)"}, {"paperId": "ba3fbc4f9946cc988e096a2e28956876484c0e99", "title": "Harnessing Crop Wild Diversity for Climate Change Adaptation"}, {"paperId": "b6221b20505f9802562f2b71e3b358394f8b60ec", "title": "adoption of mobile data collection"}, {"paperId": "ac354de2615219edb019c1ef0c3219e684496c62", "title": "Novel Approach for Spatiotemporal Weather Data Analysis"}, {"paperId": "3bf5bbe5014caf77a49e1c3d0e5de055c45baea2", "title": "Cloud Mining Actionable Pattern Discovery in Big Data: A Survey"}, {"paperId": "2df8787195815871e2aed45a94e119edc2f1806e", "title": "Big Data Governance, Technology, and Implementation in Climate-Resilient Societies"}, {"paperId": "d1f2a9af6ba23a3c32d633ae4f980f34d0de0830", "title": "Regional ocean grid reﬁnement and its eﬀect on simulated atmospheric climate"}]}
