{"paperId": "78d1f12a2fc0741b430bcd535f791e289d3fc8e1", "publicationVenue": null, "title": "Stochastic Modeling and Optimization of Stragglers in Mapreduce Framework", "abstract": "MapReduce framework is widely used to parallelize batch jobs since it exploits a high degree of multi-tasking to process them. However, it has been observed that when the number of servers increases, the map phase can take much longer than expected. This thesis analytically shows that the stochastic behavior of the servers has a negative effect on the completion time of a MapReduce job, and continuously increasing the number of servers without accurate scheduling can degrade the overall performance. We analytically model the map phase in terms of hardware, system, and application parameters to capture the effects of stragglers on the performance. Mean sojourn time (MST), the time needed to sync the completed tasks at a reducer, is introduced as a performance metric and mathematically formulated. Following that, we stochastically investigate the optimal task scheduling which leads to an equilibrium property in a datacenter with different types of servers. Our experimental results show the performance of the different types of schedulers targeting MapReduce applications. We also show that, in the case of mixed deterministic and stochastic schedulers, there is an optimal scheduler that can always achieve the lowest MST.", "venue": "", "year": 2015, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2015-10-28", "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "35779995", "name": "F. Farhat"}], "citations": [{"paperId": "b6c92fc88094dbf909bfd46309b16e1d7f04c1c7", "title": "START: Straggler Prediction and Mitigation for Cloud Computing Environments Using Encoder LSTM Networks"}, {"paperId": "d5b324df59991708ce8ade1a5d0dbecd705bb85c", "title": "Tails in the cloud: a survey and taxonomy of straggler management within large-scale cloud data centres"}, {"paperId": "f6f25e1e92d8b9e695a94c7bcdf38c3270d6e494", "title": "PRISM: An Experiment Framework for Straggler Analytics in Containerized Clusters"}, {"paperId": "648144ab2d392a9715af29ad68e395e124b188ee", "title": "Towards Stochastically Optimizing Data Computing Flows"}, {"paperId": "56f00b694f9c36efff691e4bcea33cb3cab89700", "title": "Optimal Placement of Cores, Caches and Memory Controllers in On-Chip Network"}, {"paperId": "98c06431ac184f83ff9be09fd6b6fb417528a93c", "title": "Towards Optimizing Data Computing Flow in the Cloud"}, {"paperId": "2f6db79cc6d762be8c7ef4643942c7ac89e0adce", "title": "Optimal Placement of Cores, Caches and Memory Controllers in NoC"}, {"paperId": "7a24c6db75e8fdf8640f30d9399bf51eb7f37929", "title": "Evaluating the Combined Impact of Node Architecture and Cloud Workload Characteristics on Network Traffic and Performance/Cost"}, {"paperId": "ff1ea6b135e716c1f5def73c61535d230e9e028f", "title": "START: Straggler Prediction and Mitigation Technique for Cloud Computing Environments using Encoder LSTM Networks"}, {"paperId": "5199a1a87aad96c9d2cd0a102f2e16ce5418e8ca", "title": "HYBRIDML: FAULTY NODE DETECTION USING HYBRID LEARNING MODEL FOR DISTRIBUTED DATA CENTRES"}]}
