{"paperId": "78d69366e5d7389fac0541d171423b5c3a15a291", "publicationVenue": {"id": "0dc0e794-53db-401d-bd8f-8da9165b2865", "name": "International Conferences on Contemporary Computing and Informatics", "type": "conference", "alternate_names": ["IC3I", "Int Conf Contemp Comput Informatics"]}, "title": "A Millimeter Wave Filter for 5G Applications", "abstract": "Bandpass filters, which only transmit frequencies that fall inside the transmission band and reject all other frequencies, are necessary for wireless communication systems. As 5G is set to be implemented, there will be a greater need for filters that operate in new frequency ranges. In 2022, the initial use is anticipated. The two key standards for filters that are used to build mobile applications are size and performance. With a repetition range of 26–28 GHz, the passband channel is designed in this proposal, simulated, and constructed. For downconversion of mmWave signals to microwave frequencies between 2 and 18 GHz, this channel can be employed as the front end of the apparatus. The size and efficiency of channels must be taken into account when planning new portable communications applications. Small, high-performance filters made by merging two components can be used in future mmWave applications like 5G. High-quality channels with minimal imprint are preferred for mmWave applications like 5G.", "venue": "International Conferences on Contemporary Computing and Informatics", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-12-14", "journal": {"name": "2022 5th International Conference on Contemporary Computing and Informatics (IC3I)", "pages": "605-609"}, "authors": [{"authorId": "80088179", "name": "Pradosh Kumar Sharma"}, {"authorId": "2090781977", "name": "A. Rana"}, {"authorId": "2212227267", "name": "Smita Sharma"}, {"authorId": "2212051222", "name": "Manish Sharma"}, {"authorId": "115310455", "name": "Mesay Mengstie"}, {"authorId": "2212777308", "name": "Annam Takshitha Rao"}], "citations": [{"paperId": "b43cb4957e570888b1e65f66d749985aa84621a4", "title": "High Power BandPass Filter Design for 5G Satellite Based Communications"}]}
