{"paperId": "78e1090ce81dc7743510a3ded77f60a97fdaf4da", "publicationVenue": {"id": "be267cb9-6411-4126-8b64-4847025171ee", "name": "Conference on Computer Communications Workshops", "type": "conference", "alternate_names": ["INFOCOM WKSHPS", "Conf Comput Commun Work"]}, "title": "Overcast: Running Controlled Experiments Spanning Research and Commercial Clouds", "abstract": "The Chameleon project developed a unique experimental testbed by adapting a mainstream cloud implementation to the needs of systems research community and thereby demonstrated that clouds can be configured to serve as a platform for this type research. More recently, the CloudBank project embarked on a mission of providing a conduit to commercial clouds for the systems research community that eliminates much of the complexity and some of the cost of using them for research. This creates an opportunity to explore running systems experiments in a combined setting, spanning both research and commercial clouds. In this paper, we present an extension to Chameleon for constructing controlled experiments across its resources and commercial clouds accessible via CloudBank, present a case study of an experiment running across such combined resources, and discuss the impact of using a combined research platform.", "venue": "Conference on Computer Communications Workshops", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-05-10", "journal": {"name": "IEEE INFOCOM 2021 - IEEE Conference on Computer Communications Workshops (INFOCOM WKSHPS)", "pages": "1-6"}, "authors": [{"authorId": "39332980", "name": "Paul Ruth"}, {"authorId": "2036262", "name": "K. Keahey"}, {"authorId": "47897461", "name": "Mert Cevik"}, {"authorId": "8449917", "name": "Zhuo Zhen"}, {"authorId": "2116640864", "name": "Cong Wang"}, {"authorId": "2110869979", "name": "J. Anderson"}], "citations": [{"paperId": "b5e70a4a99380c896b2e25181bf979d2b12edecb", "title": "Migrating towards Single Sign-On and Federated Identity"}, {"paperId": "fe1560d2f2fa4e59f629588ce617ef74db45d28e", "title": "CHI-in-a-Box: Reducing Operational Costs of Research Testbeds"}]}
