{"paperId": "78f0f1ba187359b4c48264d3d7ee838d470d587a", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Negating Negatives: Alignment without Human Positive Samples via Distributional Dispreference Optimization", "abstract": "Large language models (LLMs) have revolutionized the role of AI, yet also pose potential risks of propagating unethical content. Alignment technologies have been introduced to steer LLMs towards human preference, gaining increasing attention. Despite notable breakthroughs in this direction, existing methods heavily rely on high-quality positive-negative training pairs, suffering from noisy labels and the marginal distinction between preferred and dispreferred response data. Given recent LLMs' proficiency in generating helpful responses, this work pivots towards a new research focus: achieving alignment using solely human-annotated negative samples, preserving helpfulness while reducing harmfulness. For this purpose, we propose Distributional Dispreference Optimization (D$^2$O), which maximizes the discrepancy between the generated responses and the dispreferred ones to effectively eschew harmful information. We theoretically demonstrate that D$^2$O is equivalent to learning a distributional instead of instance-level preference model reflecting human dispreference against the distribution of negative responses. Besides, D$^2$O integrates an implicit Jeffrey Divergence regularization to balance the exploitation and exploration of reference policies and converges to a non-negative one during training. Extensive experiments demonstrate that our method achieves comparable generation quality and surpasses the latest baselines in producing less harmful and more informative responses with better training stability and faster convergence.", "venue": "arXiv.org", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-03-06", "journal": {"name": "ArXiv", "volume": "abs/2403.03419"}, "authors": [{"authorId": "2258959896", "name": "Shitong Duan"}, {"authorId": "2258961742", "name": "Xiaoyuan Yi"}, {"authorId": "2290178596", "name": "Peng Zhang"}, {"authorId": "1711569", "name": "T. Lu"}, {"authorId": "2187555771", "name": "Xing Xie"}, {"authorId": "2258958923", "name": "Ning Gu"}], "citations": []}
