{"paperId": "78f22c4c7769058c2dd2aa3c92e372c05a663b85", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Container Migration in the Fog: A Performance Evaluation †", "abstract": "The internet of things (IoT) is essential for the implementation of applications and services that require the ability to sense the surrounding environment through sensors and modify it through actuators. However, IoT devices usually have limited computing capabilities and hence are not always sufficient to directly host resource-intensive services. Fog computing, which extends and complements the cloud, can support the IoT with computing resources and services that are deployed close to where data are sensed and actions need to be performed. Virtualisation is an essential feature in the cloud as in the fog, and containers have been recently getting much popularity to encapsulate fog services. Besides, container migration among fog nodes may enable several emerging use cases in different IoT domains (e.g., smart transportation, smart industry). In this paper, we first report container migration use cases in the fog and discuss containerisation. We then provide a comprehensive overview of the state-of-the-art migration techniques for containers, i.e., cold, pre-copy, post-copy, and hybrid migrations. The main contribution of this work is the extensive performance evaluation of these techniques that we conducted over a real fog computing testbed. The obtained results shed light on container migration within fog computing environments by clarifying, in general, which migration technique might be the most appropriate under certain network and service conditions.", "venue": "Italian National Conference on Sensors", "year": 2019, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2019-03-27", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "19"}, "authors": [{"authorId": "40480653", "name": "C. Puliafito"}, {"authorId": "1786806", "name": "Carlo Vallati"}, {"authorId": "1701506", "name": "E. Mingozzi"}, {"authorId": "40056738", "name": "Giovanni Merlino"}, {"authorId": "143898348", "name": "F. Longo"}, {"authorId": "1721699", "name": "A. Puliafito"}], "citations": [{"paperId": "c71efc629eb00c9d5816c35b002b1e2110f43d32", "title": "Cloud-Fog Automation: Vision, Enabling Technologies, and Future Research Directions"}, {"paperId": "1b9a7055bc01a2214bb7f5974d0d71d7e74b36ad", "title": "Enabling containerized Central Unit live migration in 5G radio access network: An experimental study"}, {"paperId": "efb594d7793910e16513b3571cd220eb40fee1fb", "title": "OptFog: Optimized Mobility-Aware Task Offloading and Migration Model for Fog Networks"}, {"paperId": "ce241af6dfe14cd32a30d565d5c2659af54172e9", "title": "Remote Orchestration of NextG Services Across the Global Internet: An Experimental Study"}, {"paperId": "2a1f4ac1a724f07a32ed72eea7a099b030a5038c", "title": "Ensuring Lossless Workload Migration at the Edge with SRv6"}, {"paperId": "f5c3e49f3bd2d352743bb2d7b43b1265adf3aa71", "title": "A Q-learning-based Approach for Optimizing Workflow Migration in Fog Environments"}, {"paperId": "4b853204355b701afb4bb731981a8554139b6bef", "title": "Towards Disaggregated Resilient 5G Radio Access Network: A Proof of Concept"}, {"paperId": "3d2e5738bd8b56e12df10aaaecd276e177694144", "title": "Avaliação de Desempenho de Migração ao Vivo de Contêineres com Redes de Petri Estocásticas"}, {"paperId": "a1d4529a3f64e0de1622a09f5a562b9e892fc2e8", "title": "A cost‐efficient and QoS‐aware adaptive placement of applications in fog computing"}, {"paperId": "8de6f6c2402b2abb3548d8c88238cd99e163257d", "title": "Automation in Fog Cloud assisted Internet of Things Ecosystem: Challenges, Components and Protocols"}, {"paperId": "7c0ffe0549761f06a78398de2cb6c2fbb41614e7", "title": "End-to-end network slicing in vehicular clouds using the MobFogSim simulator"}, {"paperId": "d1ccdda7f5df86a93b4f562b7cb6f4728ec56c05", "title": "CFSSN: Container with Fog based Scalable Self-organizing Network"}, {"paperId": "66e34939fdbde55e5414e9d5651142440c1d3c58", "title": "CSM-DBEN: Container Storage Manager for Data Backup on Edge Nodes"}, {"paperId": "8e81a89314a1c03ba18cc34631f8744c84b6e6b1", "title": "Enabling Application Relocation in ETSI MEC: A Container-Migration Approach"}, {"paperId": "162d4c966dc070288543cad2a65edefbbd60bb76", "title": "Container placement and migration strategies for cloud, fog, and edge data centers: A survey"}, {"paperId": "4fc55919043539b73fc657b4eced30feb81509a8", "title": "A Technique of the Distributed Information Systems Control Method Choice under the High Network Dynamics Conditions"}, {"paperId": "90752324587c24e97053a81f3ded9b416d3bad88", "title": "Computational and Adaptive Offloading in Edge/Fog based IoT environments"}, {"paperId": "0696f4059a5ef24b7dabdcb3f859f29a5e468887", "title": "A Predictive Checkpoint Technique for Iterative Phase of Container Migration"}, {"paperId": "3019131dea95ed8201353da2dc739f3bf38cf8b7", "title": "Digital Twin based Fault Analysis in Hybrid-cloud Applications"}, {"paperId": "7d0a2d36bddaf05d423f551776ff51483a4be826", "title": "CONTINUER: Maintaining Distributed DNN Services During Edge Failures"}, {"paperId": "00de8eac2aec4b5645237399385c041a730f3b3d", "title": "Downtime Optimized Live Migration of Industrial Real-Time Control Services"}, {"paperId": "877985b32e4d123520497114233962e35b4873ee", "title": "Classification of resource management approaches in fog/edge paradigm and future research prospects: a systematic review"}, {"paperId": "b94042bd9cdc13193385a82e3115a250e6cc9edd", "title": "MS2M: A message-based approach for live stateful microservices migration"}, {"paperId": "069f98ead00992063fed4758cf3950bae7faedd4", "title": "Server-side QUIC connection migration to support microservice deployment at the edge"}, {"paperId": "ee946f689e81a82913526ba02189253d063484cd", "title": "A novel application framework for resource optimization, service migration, and load balancing in fog computing environment"}, {"paperId": "744e71c82e24ecfe8a5525000d1bfb066466b4fe", "title": "Choosing Methodology of How to Manage Distributed Information Systems under Conditions of High Dynamics of Network Infrastructure"}, {"paperId": "074bcab2b4d0b199eb549381ddefe2dc210113a1", "title": "Towards Organic 6G Networks: Virtualization and Live Migration of Core Network Functions"}, {"paperId": "e8c64ad587caa1583ecd90d513d0b56e1650f342", "title": "Application Agnostic Container Migration and Failover"}, {"paperId": "eef7d217fc1b9c110e30da87627676c8fd1ac651", "title": "A Joint Model Provisioning and Request Dispatch Solution for Low-Latency Inference Services on Edge"}, {"paperId": "3dd871cb9158ab5326aa4e297d1b13709e736024", "title": "Live Migration of Virtual Machine and Container Based Mobile Core Network Components: A Comprehensive Study"}, {"paperId": "65c87cabcaf958cabc9c390160c07c0913b75fb9", "title": "A Distributed Application Placement and Migration Management Techniques for Edge and Fog Computing Environments"}, {"paperId": "586d8a6ac46e352fd67e466c4da63e4d88eaab69", "title": "Development of functionalities extension approach and implementation of address routing for IFogSim based simulators"}, {"paperId": "420681c6c3d34c7faa1909f4504327061f6e8969", "title": "NEUKONFIG: Reducing Edge Service Downtime When Repartitioning DNNs"}, {"paperId": "c1d1eab2cdb3fb9ba857db810f7e1ccfed0bf7d0", "title": "Orchestrating Virtualized Core Network Migration in OpenROADM SDN-Enabled Network"}, {"paperId": "ac23f38699836f3f3c8a643c068cf8a573f50b50", "title": "Swarm-Like Distributed Algorithm for Scheduling a Microservice- Based Application to the Cloud Servers"}, {"paperId": "775f0d1ac2ef3ba9941e7495a8f3b91ef49f2ba1", "title": "Nature‐inspired resource management and dynamic rescheduling of microservices in Cloud datacenters"}, {"paperId": "8882bd9f4d43748d93029b19c74a01dd8fdab32a", "title": "Design and evaluation of a fog platform supporting device mobility through container migration"}, {"paperId": "fc98deedec9af235961596ef60aef98537c4773f", "title": "Edgedancer: Secure Mobile WebAssembly Services on the Edge"}, {"paperId": "fd7f31c0d30dc553dd99e061d7d285ca5cf0477d", "title": "Adaptive live migration of virtual machines under limited network bandwidth"}, {"paperId": "579a32c52664a8e370ddf82e0850e0561f4c1665", "title": "A review of edge computing: Features and resource virtualization"}, {"paperId": "669cfaa375a2d7fb9a40def82f1566410555049f", "title": "Service consumption planning for efficient service migration in mobile edge computing environments"}, {"paperId": "0434b3a91e1af5c08dba72b4816bc93ece7ae39e", "title": "An Efficient Approach Towards Surrogate Node Selection For Container Migration In Fog Computing"}, {"paperId": "4eb81b6dcbdb53c968c89317112cc7fd41c7a451", "title": "Process Automation in an IoT–Fog–Cloud Ecosystem: A Survey and Taxonomy"}, {"paperId": "e2e31833b51ffff4d2ce9269c53bd48d176c8439", "title": "Dynamic Network Slicing in Fog Computing for Mobile Users in MobFogSim"}, {"paperId": "78eab9c286deda14cc8fd243b990ce06a7cbe1c3", "title": "Stateful Container Migration in Geo-Distributed Environments"}, {"paperId": "477f55689352b06521ea5d480edc2b41367ca3b8", "title": "MirageManager: enabling stateful migration for unikernels"}, {"paperId": "96a92222552c2929b334779706f716100b244c66", "title": "A Method for Microservices Handover in A Local Area Network"}, {"paperId": "8dec48854b1cfa91d192144001e8d2593c21f7f8", "title": "Migration of Multi-container Services in the Fog to Support Things Mobility"}, {"paperId": "d2afb3bc65b0927dfe92b0ca810933458479ed33", "title": "The Impact of Container Migration on Fog Services as Perceived by Mobile Things"}, {"paperId": "d1e323775022ca7b33759e25fb38e4918aa03c06", "title": "Virtualization Construction of Security Components of Edge IoT Agent Based on Security Requirements"}, {"paperId": "4037e3359efc1d985e581f5f3c9a42a341d59d3c", "title": "Enabling Mobile Service Continuity Across Orchestrated Edge Networks"}, {"paperId": "516835fb5ff1cbf549c62f6183d742645c4a6915", "title": "Hardware-assisted Service Live Migration in Resource-limited Edge Computing Systems"}, {"paperId": "20b64cec61ac6d6519903732568d4649cf2cad7a", "title": "Formal Algebraic Specification of an IoT/Fog Data Centre for Fat Tree or Leaf and Spine architectures"}, {"paperId": "289eefda0e802190bee6c1848df72234eb7d6b21", "title": "Mobile Mist Computing for the Internet of Vehicles†"}, {"paperId": "3fedba8579c020569796cabb0ba148597f2b9d83", "title": "MobFogSim: Simulation of mobility and migration for fog computing"}, {"paperId": "92a78eae2388101c97ef9653c02c68469395b26d", "title": "Modelling Fog Offloading Performance"}, {"paperId": "57213bd043e0234c381da0ee8a3bf395750098a2", "title": "A new fog based security strategy (FBS2) for reliable image transmission"}, {"paperId": "314f92abf4fc576ecf15d8e9576c9ebab4fcff6f", "title": "Fast delivery of virtual machines and containers : understanding and optimizing the boot operation. (Contributions à l'approvisionnement d'environnements virtualisés : la problématique des temps de démarrage des machines virtuelles et des conteneurs)"}, {"paperId": "3b8a06930efb98e6fbc6cf0f30222411577e3b77", "title": "Machine Learning for Service Migration: A Survey"}, {"paperId": "94dd621558c4b03bcab817ed48ca41bdf3095322", "title": "A Container Migration Technique to Minimize the Network Overhead with Reusable Memory State"}, {"paperId": "665754b46806fb7d06feccacb9e685f240362791", "title": "MiGrror: Mitigating Downtime in Mobile Edge Computing, An Extension to Live Migration"}, {"paperId": "b0b71a2578ac281ba097eb2974fdae19984bf289", "title": "ShareOn: Shared Resource Dynamic Container Migration Framework for Real-Time Support in Mobile Edge Clouds"}, {"paperId": "1bed512e9f58a9fb7f4e4d3ee671533a48b71966", "title": "GWO-SA: Gray Wolf Optimization Algorithm for Service Activation Management in Fog Computing"}, {"paperId": "4eeb39a5edcf2c4c7c368adfa72e6a5efc04561d", "title": "Optimal Container Migration for Mobile Edge Computing: Algorithm, System Design and Implementation"}, {"paperId": "d0a1cab89ed296d10369ba441bf95e586777c405", "title": "Container Placement and Migration in Edge Computing: Concept and Scheduling Models"}, {"paperId": "7d7f533f9d223c7c8227378b2fa2d7dcdde49af4", "title": "MIGRATION OF CONTAINERIZED MICROSERVICES IN THE FOG COMPUTING ENVIRONMENT"}, {"paperId": "258970d8267e89c7565c6e035ea48f18d56492fd", "title": "A Technique to Provide an Efficient System Recovery in the Fog- and Edge-Environments of Robotic Systems"}, {"paperId": "1d022f85d93e343c8751366208eea6d60e30e770", "title": "Service Migration Based on Replaying"}, {"paperId": "c7a2ce271fc1f3f6815af57cec1ae9966248af39", "title": "Simulation Modelling Practice and Theory"}, {"paperId": "fe0287dad64529422cfdf20be1db4aba8dd1f21b", "title": "An Application Placement and Migration Management Techniques for IoT Applications in Edge and Fog Computing Environments"}, {"paperId": "aeda366917f783beb72765ec4d2df02a5f72f02d", "title": "Mobility-Aware Container Migration in Cloudlet-Enabled IoT Systems using Integrated Muticriteria Decision Making"}]}
