{"paperId": "790f180b4a5e9d9192312bb9f8f6b45fcb44fe09", "publicationVenue": null, "title": "Blockchain Empowered Secure Video Sharing With Access Control for Vehicular Edge Computing", "abstract": "The dramatically growing trend of vehicles equipped with driving camera recorders has allowed realizing real-time crowdsourced video sharing in vehicular edge computing (VEC). Such cameras can assist in monitoring objects directly in front of and behind the vehicles, enabling them to provide important visual information through real-time video streaming in case of possible accidents. Exploiting the on-board units (OBUs) for VEC can allow drivers and passengers to share and access on-road video surveillance services. However, data security and privacy concerns of video generators (owners) are two key challenges that can severely limit video sharing in a VEC environment. In this article, we propose a blockchain empowered publish/subscribe (P/S) scheme to enable one-to-many secure video sharing in the VEC scenario. Then, we design an attribute-based encryption algorithm with static and dynamic attributes (ABE-SD) to achieve fine-grained access control in a mobile environment. Finally, We utilize permissioned blockchain and smart contracts to record access policy and publish and subscribe events, thus resulting in user self-certification and event traceability. The numerical results indicate that our proposed scheme ABE-SD outperforms traditional centralized CP-ABE methods in terms of encryption and decryption performance. The simulation experiments demonstrated that the proposed video-sharing scheme is secure and efficient.", "venue": "IEEE transactions on intelligent transportation systems (Print)", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-01", "journal": {"name": "IEEE Transactions on Intelligent Transportation Systems", "pages": "9041-9054", "volume": "24"}, "authors": [{"authorId": "80766787", "name": "Bingcheng Jiang"}, {"authorId": "1752801988", "name": "Qian He"}, {"authorId": "145779142", "name": "Peng Liu"}, {"authorId": "2461792", "name": "Sabita Maharjan"}, {"authorId": "2152819646", "name": "Yan Zhang"}], "citations": [{"paperId": "bb18fc53a0dcf105225cbe83a4205d2433b0bc94", "title": "A comprehensive review of blockchain technology: Underlying principles and historical background with future challenges"}, {"paperId": "886b7bb3ac77c94ea0f029d90c030b7717bc2355", "title": "Data Security Access Control Based on Blockchain and Smart Contracts"}, {"paperId": "87a685da2913dae391f46eddd397616705680249", "title": "Deep Reinforcement Learning-Based Video Offloading and Resource Allocation in NOMA-Enabled Networks"}]}
