{"paperId": "79219625fe49b8606743d63f84b35db5b85ce903", "publicationVenue": null, "title": "Digital Story Mapping to Advance Educational Atlas Design and Enable Student Engagement", "abstract": "Storytelling is recognized as a valid and important method of communicating information and knowledge gleaned from volumes of ever-accumulating data. Practices of data-driven storytelling in journalism and geovisual analytics have contributed to the development of geovisual stories; also called story maps. The benefits of student-focused multi-thematic atlases and digital storytelling methods in education can also be realized in story maps. An online, interactive version of the original paper version of the Wyoming Student Atlas was developed using story mapping technology. Studies on best practices for data-driven storytelling and web map interaction were used to inform the transition of the atlas from a traditional paper format to a collection of story maps. Evaluation of the atlas story maps for educational purposes was conducted by observing students from multiple classrooms as they used the story maps in a lesson. The students and educators responded to a survey after using the story maps. Results of the survey show positive responses to the atlas story maps, including ease of use and preference over a traditional paper atlas. However, certain types of interaction with the map resulted in increased negative or uncertain responses from students concerning their perception of the atlas story maps.", "venue": "ISPRS Int. J. Geo Inf.", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2018-03-19", "journal": {"name": "ISPRS Int. J. Geo Inf.", "pages": "125", "volume": "7"}, "authors": [{"authorId": "40994957", "name": "Margo E. Berendsen"}, {"authorId": "40992894", "name": "J. Hamerlinck"}, {"authorId": "30203793", "name": "Gerald R. Webster"}], "citations": [{"paperId": "e430dc731552cd9c37280b6d1b8aab5d2f634e6a", "title": "Use of the “story map” in educational settings as a spatial technology tool: a review of the literature"}, {"paperId": "3c5b0e7cd7b1d8b1fa07496255d843f52acceadf", "title": "The Potential of the SMART Learning Framework to Design and Implement Geospatial Curricula in the Secondary Classroom"}, {"paperId": "d9f4147cc7a630bcb661409edd12d45c6996e318", "title": "From high school to postgraduate: student perceptions of learning experiences creating ArcGIS StoryMaps"}, {"paperId": "531786ee7f7dff95974b60b1e2bfb2ee9bda953e", "title": "The Geo-Cultural Heritage of Kos Revisited: Web-GIS Applications and Storytelling Promoting the Well-Known Island of Dodecanese, Greece"}, {"paperId": "7a62e67697fb18410b545cf2e93e8bf5a2235337", "title": "The Effects of Story Mapping and Hortatory Exposition Techniques on Students’ Compositions"}, {"paperId": "65968fd4d5fa1603913560cef5feaac926491ee2", "title": "Mapping for Awareness of Indigenous Stories"}, {"paperId": "694c2176d3dbf02d219c8b1c24911cda320d2865", "title": "Web GIS for Sustainable Education: Towards Natural Disaster Education for High School Students"}, {"paperId": "870887cc8e15db881ef103b22333c508b4fc1831", "title": "An exploratory digital environment for learning about southern African pre-colonial urbanism – A usability study"}, {"paperId": "5b1ad4c7d4425318f196833b4a448cd2d3e29406", "title": "The Decision-Making Process and the Construction of Online Sociality through the Digital Storytelling Methodology"}, {"paperId": "e6fd3405eb5031e28dcfbcee9e8e5996a270d454", "title": "Evaluation of story maps by future geography teachers"}, {"paperId": "5a5f44a701800944f1233af24944a3835126f12e", "title": "Towards a holistic framework for delivering quality GIS education within and across disciplines"}, {"paperId": "13b2ee1acc3384193aae303d5b7f6a14e4033acb", "title": "Nisyros Volcanic Island: A Geosite through a Tailored GIS Story"}, {"paperId": "a63dbf04770e693c04047c807e1f7ebf504e304a", "title": "Using Data Visualization to Demonstrate Outcomes—Examples\nFrom Ripple Effects Mapping"}, {"paperId": "4f1246721cf6df7dc16e60268ba03c2c893e2248", "title": "Teaching tourism: urban routes design using GIS Story Map"}, {"paperId": "5d261068eac7f21a395d3a0b4cc638b8ab3d1196", "title": "Storylines for practice: a visual storytelling approach to strengthen the science-practice interface"}, {"paperId": "98a7e894c420ee915a9883aeef056b5e58cd9e72", "title": "Pandangan guru dan murid terhadap pengaplikasian Story Map GIS dalam mata pelajaran Sejarah STPM"}, {"paperId": "66fb565c5862cb228b2942cb78b0e89302d2b6ae", "title": "Short Take: Story-mapping Experiences"}, {"paperId": "56b931e8dc739f72579880fb1b4f2c2e45586e5c", "title": "‘Story Maps’ e Geologia"}, {"paperId": "9cd25bea245b391c12ea1c5ad1f144f3dd77b129", "title": "Digital Story Map Learning for STEM Disciplines"}, {"paperId": "546f2261c111ff9ae1e75e52457620dfb0ee3397", "title": "Creating a Story Map Using Geographic Information Systems to Explore Geomorphology and History of Methana Peninsula"}, {"paperId": "91909e8c7a8b90f38bcfb96ed9764d81b1d63b02", "title": "RE-SIGNIFY THE DOMESTIC SPACE IN TIMES OF CONFINEMENT FROM THE APPLICATION OF ETHNOGRAPHIC TOOLS AND PERSONAL CENTERED DESIGN"}, {"paperId": "90f81cf622f306e5a6f4e68c6dec9435be219aa5", "title": "Engaging Children in Digital Storytelling"}, {"paperId": "7e0a0cdd46b49409f194850162f084402a3a2af2", "title": "Re-signifying Domestic Space in Times of Confinement Based on Biophilic Design"}, {"paperId": "439bc15b7755a99dcee289be698ecd03ea57d4be", "title": "Narrative techniques and digital storytelling laboratory for the development of emotional and cognitive skills in school"}, {"paperId": "cd9dff3d55c0750d0a6fabf67f3addc61936182a", "title": "Novelette, a Usable Visual Storytelling Digital Learning Environment"}, {"paperId": "09819d8800e4705eaff7ecf97669d88c3e3e5610", "title": "A Multi-Method Measurement of Adolescent Food Environments and Related Health Behaviors and Food Choices: School, Community, and Home Environments"}, {"paperId": "ae3eb0cadba25239c901ceb963956f9c9f6610f9", "title": "AN INVENTORY DATABASE FOR GEOEDUCATIONAL OUTREACH BASED ON VOLUNTEERED GEOGRAPHIC INFORMATION (VGI) APPROACH IN MALAYSIA"}]}
