{"paperId": "79277d98f02a92fcf60bbacf7b2e0f5b9e1e8e2b", "publicationVenue": {"id": "018dbcc4-52fa-4865-9b2f-6af96b2ca317", "name": "International Conference on Engineering, Technology and Innovation", "type": "conference", "alternate_names": ["ICE/ITMC", "Int Conf Eng Technol Innov"]}, "title": "User interface support for a big ETL data processing pipeline an application scenario on highway toll charging models", "abstract": "Urban and national road networks in many countries are severely congested, resulting in increased travel times and number of stops, unexpected delays, greater travel costs, inconvenience to drivers and passengers, increased air pollution and noise level and number of traffic accidents. Expanding traffic network capacities by building more roads is extremely costly as well as environmentally damaging. More efficient usage of the existing network is vital in order to sustain the growing travel demand. Congestion pricing has been advocated by transport economists and traffic planners for a long time as an efficient means to reduce road congestion, however such practices have not been widely adopted. Portugal has a good and underused toll highway network that is close to congested free urban/national road networks. Portuguese drivers choose to use free roads disregarding safety, travel time and other aspects, basing their decision only toll prices. Therefore, urban/national road network has been suffering from a more intensive use than it was projected for, increasing maintenance costs and reducing safety and comfort for users. The main objective of the application scenario presented is to transfer traffic from urban / national roads to highways, through the adoption of congestion pricing technologies. To this end, innovative Big Data processing and mining as well as optimization techniques need to be developed and applied so as to support real-time decision-making capabilities for congestion pricing. This paper presents an ETL (extract, transform and load) architecture for intelligent transportation systems, addressing an application scenario on dynamic toll charging for highways, supported by a novel Web User Interface.", "venue": "International Conference on Engineering, Technology and Innovation", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2017-06-01", "journal": {"name": "2017 International Conference on Engineering, Technology and Innovation (ICE/ITMC)", "pages": "1437-1444"}, "authors": [{"authorId": "144239323", "name": "Paulo Figueiras"}, {"authorId": "50531199", "name": "R. Costa"}, {"authorId": "8396625", "name": "G. Guerreiro"}, {"authorId": "80168818", "name": "Hugo Antunes"}, {"authorId": "2064455066", "name": "Antonio Rosa"}, {"authorId": "1398998656", "name": "R. Jardim-Gonçalves"}], "citations": [{"paperId": "c8b2900cbdd4348a7bcccddb19790a51bd85b98a", "title": "A non-intrusive and reactive architecture to support real-time ETL processes in data warehousing environments"}, {"paperId": "872b2a0dcc05482290be2754cb26df6ba5727916", "title": "A novel solution to perform real-time ETL process based on non-intrusive and reactive concepts"}, {"paperId": "5a31895a8762cc0d4ad7c51df29c0eb0894b2707", "title": "Model-Based Dynamic Toll Pricing: An Overview"}]}
