{"paperId": "792a67c514d59b3f7f3e42713d5ed8b47ebb11d5", "publicationVenue": {"id": "deedf64a-dd5c-4b33-b345-ff83bfb93d71", "name": "International Symposium on Computer Architecture", "type": "conference", "alternate_names": ["Int Symp Comput Archit", "ISCA"], "url": "http://www.cs.wisc.edu/~arch/www/"}, "title": "Sibyl: adaptive and extensible data placement in hybrid storage systems using online reinforcement learning", "abstract": "Hybrid storage systems (HSS) use multiple different storage devices to provide high and scalable storage capacity at high performance. Data placement across different devices is critical to maximize the benefits of such a hybrid system. Recent research proposes various techniques that aim to accurately identify performance-critical data to place it in a \"best-fit\" storage device. Unfortunately, most of these techniques are rigid, which (1) limits their adaptivity to perform well for a wide range of workloads and storage device configurations, and (2) makes it difficult for designers to extend these techniques to different storage system configurations (e.g., with a different number or different types of storage devices) than the configuration they are designed for. Our goal is to design a new data placement technique for hybrid storage systems that overcomes these issues and provides: (1) adaptivity, by continuously learning from and adapting to the workload and the storage device characteristics, and (2) easy extensibility to a wide range of workloads and HSS configurations. We introduce Sibyl, the first technique that uses reinforcement learning for data placement in hybrid storage systems. Sibyl observes different features of the running workload as well as the storage devices to make system-aware data placement decisions. For every decision it makes, Sibyl receives a reward from the system that it uses to evaluate the long-term performance impact of its decision and continuously optimizes its data placement policy online. We implement Sibyl on real systems with various HSS configurations, including dual- and tri-hybrid storage systems, and extensively compare it against four previously proposed data placement techniques (both heuristic- and machine learning-based) over a wide range of workloads. Our results show that Sibyl provides 21.6%/19.9% performance improvement in a performance-oriented/cost-oriented HSS configuration compared to the best previous data placement technique. Our evaluation using an HSS configuration with three different storage devices shows that Sibyl outperforms the state-of-the-art data placement policy by 23.9%-48.2%, while significantly reducing the system architect's burden in designing a data placement mechanism that can simultaneously incorporate three storage devices. We show that Sibyl achieves 80% of the performance of an oracle policy that has complete knowledge offuture access patterns while incurring a very modest storage overhead of only 124.4 KiB.", "venue": "International Symposium on Computer Architecture", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2022-05-15", "journal": {"name": "Proceedings of the 49th Annual International Symposium on Computer Architecture"}, "authors": [{"authorId": "2117029302", "name": "Gagandeep Singh"}, {"authorId": "2165382467", "name": "Rakesh Nadig"}, {"authorId": "1992941239", "name": "Jisung Park"}, {"authorId": "2067157527", "name": "Rahul Bera"}, {"authorId": "19170520", "name": "Nastaran Hajinazar"}, {"authorId": "2195958", "name": "D. Novo"}, {"authorId": "1474355913", "name": "Juan G'omez-Luna"}, {"authorId": "115679894", "name": "S. Stuijk"}, {"authorId": "1684335", "name": "H. Corporaal"}, {"authorId": "145929920", "name": "O. Mutlu"}], "citations": [{"paperId": "5e2d898f8b24fdb718641aca9aec66bc08976071", "title": "Text Semantics-Driven Data Classification Storage Optimization"}, {"paperId": "8aa4e459fa9076fe75019137ac2cfc28f4c4f000", "title": "An optimized learning-based directory placement policy with two-rounds selection in distributed file systems"}, {"paperId": "06bf7a094c9560ba31858fb04a956f70073c029a", "title": "A Framework for Designing Efficient Deep Learning-Based Genomic Basecallers"}, {"paperId": "e77b8dc1f15bcd8c5e75f5b6e9133180976c47b2", "title": "Network Contention-Aware Cluster Scheduling with Reinforcement Learning"}, {"paperId": "024c572ac227bf7c2fe8e296cd44a84fe2805c9b", "title": "Hierarchical Resource Partitioning on Modern GPUs: A Reinforcement Learning Approach"}, {"paperId": "b07942d9ff066a1d64e2b3845b3f205c4b26a94b", "title": "Micro-Armed Bandit: Lightweight & Reusable Reinforcement Learning for Microarchitecture Decision-Making"}, {"paperId": "112eebe5b90a424700d718e5e96f06cf4c069a1b", "title": "Automatic Kernel Generation for Large Language Models on Deep Learning Accelerators"}, {"paperId": "bc6a9cc9d5228991d71c83c5513d1d72e0012176", "title": "Cost-aware Joint Caching and Forwarding in Networks with Heterogeneous Cache Resources"}, {"paperId": "b3ad97f01f06d40059c0be5e0c827bf4c097f05f", "title": "Cache eviction for SSD-HDD hybrid storage based on sequential packing"}, {"paperId": "2e81b5a00dbb324e8f7d29f556a5a40f446f2c81", "title": "SPARTA: Spatial Acceleration for Efficient and Scalable Horizontal Diffusion Weather Stencil Computation"}, {"paperId": "15b3523eecb9a4035324662bbb77d7d8b7185d5b", "title": "DaeMon: Architectural Support for Efficient Data Movement in Fully Disaggregated Systems"}, {"paperId": "36451df837c0c28c7344501cd3a6c14d63b08b9e", "title": "DaeMon: Architectural Support for Efficient Data Movement in Disaggregated Systems"}, {"paperId": "33a976423a7e46650d09193a5dc9691ba1f1dbe1", "title": "RUBICON: a framework for designing efficient deep learning-based genomic basecallers"}, {"paperId": "e827a686216beadd08a5d2840c24ed470e521a94", "title": "An Experimental Evaluation of Machine Learning Training on a Real Processing-in-Memory System"}, {"paperId": "d0e452f841649e4dc50edfff3287fb2ea9be3f04", "title": "Extending Memory Capacity in Consumer Devices with Emerging Non-Volatile Memory: An Experimental Study"}, {"paperId": "30e469c369af4a4ddc6490d1bd2760c1c70ff57d", "title": "Extending Memory Capacity in Modern Consumer Systems With Emerging Non-Volatile Memory: Experimental Analysis and Characterization Using the Intel Optane SSD"}]}
