{"paperId": "792bc4f65bce8a927b7cfa075bc373b9ee49b085", "publicationVenue": {"id": "2e8c30d0-78f6-4b13-aecb-9a65bff00635", "name": "IEEE wireless communications", "type": "journal", "alternate_names": ["IEEE Wirel Commun", "IEEE Wireless Communications", "IEEE wirel commun"], "issn": "1536-1284", "url": "http://www.comsoc.org/wirelessmag/", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=7742"]}, "title": "Digital Twins for Intelligent Authorization in the B5G-Enabled Smart Grid", "abstract": "Beyond fifth generation (B5G) communication networks and computation paradigms in the edge are expected to be integrated into power grid infrastructures over the coming years. In this sense, AI technologies will play a fundamental role to efficiently manage dynamic information flows of future applications, which impacts the authorization policies applied in such a complex scenario. This article studies how digital twins can evolve their context awareness capabilities and simulation technologies to anticipate faults or to detect cyber-security issues in real time, and update access control policies accordingly. Our study analyzes the evolution of monitoring platforms and architecture decentralization, including the application of machine learning and blockchain technologies in the smart grid, toward the goal of implementing autonomous and self-learning agents in the medium and long term. We conclude this study with future challenges on applying digital twins to B5G-based smart grid deployments.", "venue": "IEEE wireless communications", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-04-01", "journal": {"name": "IEEE Wireless Communications", "pages": "48-55", "volume": "28"}, "authors": [{"authorId": "36088836", "name": "Javier López"}, {"authorId": "145483726", "name": "J. E. Rubio"}, {"authorId": "2934170", "name": "Cristina Alcaraz"}], "citations": [{"paperId": "53b40b22a80552da5da826888fe88b0b7ad750d3", "title": "The convergence of Digital Twins and Distributed Ledger Technologies: A systematic literature review and an architectural proposal"}, {"paperId": "d8ee7a79cae542b8474d14f6c37cc3f5d423998d", "title": "A comprehensive survey on digital twin for future networks and emerging Internet of Things industry"}, {"paperId": "5ca9acf7dd4cf5bd6e2d149fd26eae30956030b7", "title": "Cross-FCL: Toward a Cross-Edge Federated Continual Learning Framework in Mobile Edge Computing Systems"}, {"paperId": "93226f6284b799ee8d04e0c470f14a32216ce529", "title": "Intelligent wireless resource management in industrial camera systems: Reinforcement Learning-based AI-extension for efficient network utilization"}, {"paperId": "911c120315388b340fd20bd15c174111f5e0ef96", "title": "Federated Continual Learning via Knowledge Fusion: A Survey"}, {"paperId": "51c01c7010803c38a8ac071b374fa00ed8c2cf51", "title": "Navigating the Future Data-Driven Automation Tools: State-of-the-Art and Research Roadmap for Digital Twins of Energy Systems"}, {"paperId": "b2a3510895d0fc1fe6b64a3a7a97483e38b80e46", "title": "ACA: Anonymous, Confidential and Auditable Transaction Systems for Blockchain"}, {"paperId": "84cf562af4bea95f3a706b88d1c6dfc0cd795da1", "title": "Techniques for Enhancing Security in Industrial Control Systems"}, {"paperId": "4c0001879f0597c365058b6e3195009548465946", "title": "Research on digital portrait of power information communication system based on business drive"}, {"paperId": "0855cfe5712ded24b8764a3f68553795c0da6d94", "title": "GNN-Based Power Allocation and User Association in Digital Twin Network for the Terahertz Band"}, {"paperId": "54c32236e98359924b417e36f4dbbf8a907d8be3", "title": "Advances in nanogenerators for electrical power system state sensing and monitoring"}, {"paperId": "fc2e9c90b67ccabe1bd4e39e2c2017ce4ecefa7f", "title": "Artificial intelligence and blockchain technology for secure smart grid and power distribution Automation: A State-of-the-Art Review"}, {"paperId": "0af8f9b3c058ce51da7c560fff2ed302569d7999", "title": "A spatiotemporal intelligent framework and experimental platform for urban digital twins"}, {"paperId": "1d5858619db9fb8d19dc124619f706bc379be52e", "title": "Energy Trading Framework Based on IoT and Digital Twin for Nanogrid Environment"}, {"paperId": "232647fad818a5eddd099aee7aca464a773c4b45", "title": "Digital twin for smart manufacturing, A review"}, {"paperId": "daba80534aa74ae19a095216673993a55d37bd1a", "title": "Staying Ahead of Threats: A Review of AI and Cyber Security in Power Generation and Distribution"}, {"paperId": "c16d07c0a8898c548961c0be1e14029d86df0d8c", "title": "A Blockchain-Based Cross-Domain and Autonomous Access Control Scheme for Internet of Things"}, {"paperId": "bc0b2c5033fdf66b5f48adf715dd333f94f9064d", "title": "A Survey on Digital Twins: Architecture, Enabling Technologies, Security and Privacy, and Future Prospects"}, {"paperId": "fdc0d781b3b0f4e5bae7324b0c6462a56f9f044b", "title": "Encrypted 5G over-the-top voice traffic classification using deep learning"}, {"paperId": "354acd92d1952f6c954bea4e04efff105f352850", "title": "Age-of-Information-Aware Digital Twin Assisted Resource Management for Distributed Energy Scheduling"}, {"paperId": "ba2eef273f7bdb0993c12ff382f9e9530cde606e", "title": "Explainable AI Over the Internet of Things (IoT): Overview, State-of-the-Art and Future Directions"}, {"paperId": "a8c28c9532e842fea5c24b6e19a1dddf204719e0", "title": "Smart Grid based Wireless Communication in 5G Network for Monitoring and Control Systems in Renewable Energy Management"}, {"paperId": "71e1706ac7f1bd820b8e7c91ad70a005081d30b1", "title": "Classifying resilience approaches for protecting smart grids against cyber threats"}, {"paperId": "bb623ee45751c15337facc5e28a8070ce3904ad6", "title": "Unmanned aerial vehicle-aided edge networks with ultra-reliable low-latency communications: A digital twin approach"}, {"paperId": "6139abd9e393fbbdeef570eed23cbfc57d0ecfbf", "title": "Smartgrid-based hybrid digital twins framework for demand side recommendation service provision in distributed power systems"}, {"paperId": "ffc038250119457744925a47978818114d3dc061", "title": "Digital Twin-Assisted OWC: Towards Smart and Autonomous 6G Networks"}, {"paperId": "d70015cbfa98817dcc74f55cd88fc4b9dfc7e36e", "title": "Digital Twins for Smart Home Gadget Threat Prediction using Deep Convolution Neural Network"}, {"paperId": "b2875f876d8f01011ed5fb9e8577ad534b951df9", "title": "Digital Twin: A Comprehensive Survey of Security Threats"}, {"paperId": "f31b7a0f85a086a6181b4cad3a6b0086446fe258", "title": "Machine Learning-Based Digital Twin for Predictive Modeling in Wind Turbines"}, {"paperId": "8a1c747371d101ee85e98b555b802b7604e783a6", "title": "A Taxonomy and Lessons Learned From Blockchain Adoption Within the Internet of Energy Paradigm"}, {"paperId": "75522e04f7e11321e0ceab380c4b8c6162e7fbf3", "title": "Systematic Literature Review: Digital Twins’ Role in Enhancing Security for Industry 4.0 Applications"}]}
