{"paperId": "793d69ecc8fe11e0a41aad5e34e5764227552e24", "publicationVenue": null, "title": "Summary Cycles: Exploring the Impact of Prompt Engineering on Large Language Models’ Interaction with Interaction Log Information", "abstract": "With the aim of improving work efficiency, we examine how Large Language Models (LLMs) can better support the handoff of information by summarizing user interactions in collaborative intelligence analysis communication. We experiment with interaction logs, or a record of user interactions with a system. Inspired by chain-of-thought prompting, we describe a technique to avoid API token limits with recursive summarization requests. We then apply ChatGPT over multiple iterations to extract named entities, topics, and summaries, combined with interaction sequence sentences, to generate summaries of critical events and results of analysis sessions. We quantitatively evaluate the generated summaries against human-generated ones using common accuracy metrics (e.g., ROUGE-L, BLEU, BLEURT, and TER). We also report qualitative trends and the factuality of the output. We find that manipulating the audience feature or providing single-shot examples minimally influences the model’s accuracy. While our methodology successfully summarizes interaction logs, the lack of significant results raises questions about prompt engineering and summarization effectiveness generally. We call on explainable artificial intelligence research to better understand how terms and their placement may change LLM outputs, striving for more consistent prompt engineering guidelines.", "venue": "EVAL4NLP", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": {"name": "Proceedings of the 4th Workshop on Evaluation and Comparison of NLP Systems"}, "authors": [{"authorId": "2288267734", "name": "Jeremy Block"}, {"authorId": "2288305375", "name": "Yu-Peng Chen"}, {"authorId": "2288267231", "name": "Abhilash Budharapu"}, {"authorId": "2288272204", "name": "Lisa Anthony"}, {"authorId": "2288267838", "name": "Bonnie Dorr"}], "citations": []}
