{"paperId": "795a2a9ea0bbb64fa4c070b3e9269bf114ed1e52", "publicationVenue": {"id": "3afb600a-49ad-40aa-858c-081def027584", "name": "Workshop on Biomedical Natural Language Processing", "type": "conference", "alternate_names": ["BioNLP", "Workshop Biomed Nat Lang Process"]}, "title": "Conversational Bots for Psychotherapy: A Study of Generative Transformer Models Using Domain-specific Dialogues", "abstract": "Conversational bots have become non-traditional methods for therapy among individuals suffering from psychological illnesses. Leveraging deep neural generative language models, we propose a deep trainable neural conversational model for therapy-oriented response generation. We leverage transfer learning methods during training on therapy and counseling based data from Reddit and AlexanderStreet. This was done to adapt existing generative models – GPT2 and DialoGPT – to the task of automated dialog generation. Through quantitative evaluation of the linguistic quality, we observe that the dialog generation model - DialoGPT (345M) with transfer learning on video data attains scores similar to a human response baseline. However, human evaluation of responses by conversational bots show mostly signs of generic advice or information sharing instead of therapeutic interaction.", "venue": "Workshop on Biomedical Natural Language Processing", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"pages": "285-297"}, "authors": [{"authorId": "10389390", "name": "Avisha Das"}, {"authorId": "2054695", "name": "S. Selek"}, {"authorId": "113795187", "name": "Alia R. Warner"}, {"authorId": "2044484154", "name": "X. Zuo"}, {"authorId": "2113665949", "name": "Yan Hu"}, {"authorId": "65893930", "name": "V. Keloth"}, {"authorId": "2117984733", "name": "Jianfu Li"}, {"authorId": "2152934259", "name": "Wen Zheng"}, {"authorId": "2165251677", "name": "Hua Xu"}], "citations": [{"paperId": "82dcef936d139b6ce8a6198a2de9c597b28b4ded", "title": "Large language models could change the future of behavioral healthcare: a proposal for responsible development and evaluation"}, {"paperId": "ab80047970b739af80b607468204f7822e6a9653", "title": "The opportunities and risks of large language models in mental health"}, {"paperId": "6eea9bfa66a15cc8ef7e3f659d5881bb35250ece", "title": "COCOA: CBT-based Conversational Counseling Agent using Memory Specialized in Cognitive Distortions and Dynamic Prompt"}, {"paperId": "20c6714262e2f71feae4331f312f1ab1dc9754fd", "title": "Artificial intelligence and social intelligence: preliminary comparison study between AI models and psychologists"}, {"paperId": "7e1db7c3f45ff1fb18409433af29303b1b604542", "title": "Improving conversational recommender systems via multi-preference modeling and knowledge-enhanced"}, {"paperId": "7327fe84b4b39e2bd946d471613cd17a9356b3d0", "title": "How Well Did ChatGPT Perform in Answering Questions on Different Topics in Gross Anatomy?"}, {"paperId": "fea583ba25a011bd793f555e8ec44b3fae3b17da", "title": "OpenAI's GPT‐4 performs to a high degree on board‐style dermatology questions"}, {"paperId": "8f3b43e6382a74e3934c3f5f4dc902f65c81f560", "title": "TS-DDD: A Two-Stage Training Strategy for Dialogue-based Disease Diagnosis"}, {"paperId": "cf3e8af119bae0d72a9d62fbc2a66d44bf854e94", "title": "An Integrative Survey on Mental Health Conversational Agents to Bridge Computer Science and Medical Perspectives"}, {"paperId": "1428366f8d70984d7151d7959b89dae76fffbb12", "title": "Using ChatGPT to Predict Cancer Predisposition Genes: A Promising Tool for Pediatric Oncologists"}, {"paperId": "248c5008d47863e5530795506d1ced93f6f23a36", "title": "A Friend in Need Is a Friend Indeed: Investigating the Quality of Training Data from Peers for Auto-generating Empathetic Textual Responses to Non-Sensitive Posts in a Cohort of College Students"}, {"paperId": "c9b2b9f04daf1465fc849886b105894fc6826935", "title": "Transformación digital de la atención psicológica: estado actual de la telepsicología en Colombia"}, {"paperId": "c84a1be410f08416eaa87fb1ad90ddbc69cecf1c", "title": "The revolutionary impact of chatGPT: advances in biomedicine and redefining healthcare with large language models"}, {"paperId": "2461675ae633a5ef5a3d557299d57f707b3e07cd", "title": "ChatGPT Performs on the Chinese National Medical Licensing Examination"}, {"paperId": "d0e3d2ff64443ccecec3399a3575e3dd2a562666", "title": "Development and Evaluation of Three Chatbots for Postpartum Mood and Anxiety Disorders"}, {"paperId": "7d0e8a7f005ea81087a71a879c0dbc5b65860a1c", "title": "Towards Cross-Content Conversational Agents for Behaviour Change: Investigating Domain Independence and the Role of Lexical Features in Written Language Around Change"}, {"paperId": "969b2d3912326c175f68767ab608ccad5f19dd7d", "title": "Performance of ChatGPT on Chinese national medical licensing examinations: a five-year examination evaluation study for physicians, pharmacists and nurses"}, {"paperId": "ed26016878ec049ae8b3179cc7a5fdd896a69d08", "title": "ChatGPT, a powerful language model and its potential uses in bioinformatics"}, {"paperId": "c7c391196fe86446ab1c364fb1aa1b55f806cb52", "title": "ChatGPT: Opportunities, Features and Future Prospects"}, {"paperId": "cd4d112f3f9120d0715f22a9de2ce4720822368c", "title": "How Does ChatGPT Perform on the United States Medical Licensing Examination (USMLE)? The Implications of Large Language Models for Medical Education and Knowledge Assessment"}, {"paperId": "9c0b6f0041835f1ce74d448dacdb76b27dceb17a", "title": "Digital mental health: challenges and next steps"}, {"paperId": "7d4867e28b02059eef4cb25bfcd304b2071b30a9", "title": "How Well Does ChatGPT Do When Taking the Medical Licensing Exams? The Implications of Large Language Models for Medical Education and Knowledge Assessment"}, {"paperId": "586d317634acea3a327e0567c210c35e93835985", "title": "How Can Client Motivational Language Inform Psychotherapy Agents?"}, {"paperId": "85f715f324aa5a8a8d841c0474d3093857392961", "title": "Application of ChatGPT in multilingual medical education: How does ChatGPT fare in 2023's Iranian residency entrance examination"}, {"paperId": "a120f0587815932b78f3c6686d489005ccf927c4", "title": "Enhanced Emotion Detection and Analysis in Human-Robot Interactions: An Innovative Model and Its Experimental Validation"}, {"paperId": "0ef6295935749f1812a206478820c94a33fb8d53", "title": "RealMedDial: A Real Telemedical Dialogue Dataset Collected from Online Chinese Short-Video Clips"}]}
