{"paperId": "7963195725cc4f58e3bb9f1945c775c96260b27a", "publicationVenue": {"id": "472adb76-f5bd-4ad0-a989-08c3a9ccf86e", "name": "Journal of Environmental and Public Health", "type": "journal", "alternate_names": ["J Environ Public Health"], "issn": "1687-9805", "url": "https://www.hindawi.com/journals/jeph/"}, "title": "Comparative Analysis of Chinese Culture and Hong Kong, Macao, and Taiwan Culture in the Field of Public Health Based on the CNN Model", "abstract": "In view of the defect of a large amount of information on cultural resources and poor recommendation effect on a standalone platform, a cultural recommendation system based on the Hadoop platform was proposed, combined with the convolutional neural network (CNN). It aims to improve the adaptability of Chinese culture and Hong Kong, Macao, and Taiwan culture. Firstly, the CNN is used to encode the collected information deeply and map it to the deep feature space. Secondly, the attention mechanism is used to focus the coded features in the deep feature space to improve the classification ability of features. Then, the model in this article is deployed using the distributed file system of the Hadoop platform, and the MapReduce programming model is used to implement the cultural resource recommendation algorithm in parallel. Finally, the recommendation simulation experiment of cultural resources is carried out, and the results show that the proposed model has good recommendation performance, and it is applied to open-source data in the real public health field to test, and the results also perform well.", "venue": "Journal of Environmental and Public Health", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-09-06", "journal": {"name": "Journal of Environmental and Public Health", "volume": "2022"}, "authors": [{"authorId": "2054473436", "name": "H. Xiong"}], "citations": [{"paperId": "ae18576047af791329a433eb34bbf89f050dcded", "title": "Retracted: Comparative Analysis of Chinese Culture and Hong Kong, Macao, and Taiwan Culture in the Field of Public Health Based on the CNN Model"}]}
