{"paperId": "796ad821a779182a72be042f1593bfc8b702e774", "publicationVenue": {"id": "ad34e82f-f936-47a5-9c78-c4453dff3f60", "name": "International Conference on Trust, Security and Privacy in Computing and Communications", "type": "conference", "alternate_names": ["TrustCom", "Trust Secur Priv Comput Commun", "Trust, Security And Privacy In Computing And Communications", "Int Conf Trust Secur Priv Comput Commun"]}, "title": "Energy Efficient Merkle Trees for Blockchains", "abstract": "Blockchain-powered smart systems deployed in different industrial applications promise operational efficiencies and improved yields, while mitigating significant cybersecurity risks pertaining to the main application. Associated tradeoffs between availability and security arise at implementation, however, triggered by the additional resources (e.g., memory, computation) required by each blockchain-enabled host. This paper applies an energy-reducing algorithmic engineering technique for Merkle Tree root calculations, a principal element of blockchain computations, as a means to preserve the promised security benefits but with less compromise to system availability. Using pyRAPL, a python library to measure computational energy, we experiment with both the standard and energy-reduced implementations of the Merkle Tree for different input sizes (in bytes). Our results show up to 98% reduction in energy consumption is possible within the blockchain's Merkle Tree construction module, such reductions typically increasing with larger input sizes. The proposed energy-reducing technique is similarly applicable to other key elements of blockchain computations, potentially affording even “greener” blockchain-powered systems than implied by only the Merkle Tree results obtained thus far.", "venue": "International Conference on Trust, Security and Privacy in Computing and Communications", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-10-01", "journal": {"name": "2021 IEEE 20th International Conference on Trust, Security and Privacy in Computing and Communications (TrustCom)", "pages": "1093-1099"}, "authors": [{"authorId": "118960635", "name": "Cesar Castellon"}, {"authorId": "40066494", "name": "Swapnoneel Roy"}, {"authorId": "47322184", "name": "Patrick Kreidl"}, {"authorId": "145905625", "name": "Ayan Dutta"}, {"authorId": "1701593", "name": "Ladislau Bölöni"}], "citations": [{"paperId": "ea5c946c8e84e047eebdbee2f28740fc2cb334d9", "title": "Navigating the Blockchain Landscape: Role, Challenges, Risks, and Issues in the Banking and Finance Sector"}, {"paperId": "29f6cc329fe4f9b6f41a8b7be2b4ab283d253f74", "title": "Hardware Accelerated Reusable Merkle Tree Generation for Bitcoin Blockchain Headers"}, {"paperId": "d40ebdc8597e7b8bfb150655dde75f48841e6e3a", "title": "Toward a Green Blockchain: Engineering Merkle Tree and Proof of Work for Energy Optimization"}, {"paperId": "1a4ead6341a2b217720b73e98199a2489d527c76", "title": "Towards an Energy-Efficient Hash-based Message Authentication Code (HMAC)"}, {"paperId": "f9ffdbd151a34e9b41084093c0a8b652b76674f6", "title": "MTTBA- A Key Contributor for Sustainable Energy Consumption Time and Space Utility for Highly Secured Crypto Transactions in Blockchain Technology"}, {"paperId": "951b3011b2868a1a283518fddb8d6b6526d56710", "title": "Blockchain-Based Local Energy Market Enabling P2P Trading: An Australian Collated Case Study on Energy Users, Retailers and Utilities"}, {"paperId": "7baf40bfd0b72b2a0a3bd08350ba8ca4ea292c25", "title": "ENHANCING TRANSACTION VERIFICATION THROUGH PRUNED MERKLE TREE IN BLOCKCHAIN"}]}
