{"paperId": "797601c1b73acc8d98046281383bb63f80fbb42d", "publicationVenue": {"id": "2135230a-3b24-4b71-9583-60624389377a", "name": "IEEE Transactions on Industrial Informatics", "type": "journal", "alternate_names": ["IEEE Trans Ind Informatics"], "issn": "1551-3203", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=9424", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=9424"]}, "title": "Improving the Efficiency of the EMS-Based Smart City: A Novel Distributed Framework for Spatial Data", "abstract": "The smart city system, which is a type of enterprise management system (EMS), automatically manages cities and schedules resources efficiently based on spatial data generated by devices, such as the Internet of Things and mobile. However, with the increasing deployment of technologies, including sensor and location-based services, their ever-growing spatial data are no longer managed efficiently by traditional EMS. To overcome this issue, we present SeFrame, which is a spatially enabled framework for improving the efficiency of smart city EMS based on a distributed architecture. The framework supports a set of spatial queries, including: The range query, k-nearest neighbors query, and spatial join query. It benefits greatly from using the buffer-enabled partition method to eliminate duplicate results. In each partition, the local index based on combination of the quad-tree and grid index (CQG) significantly improves the spatial query efficiency in memory. CQG manages complex spatial objects, including a point, polygon, and polyline. By taking full advantage of the local index, SeFrame accesses skewed spatial data in constant time. In experiments, we demonstrated that the proposed method delivered superior performance in terms of scalability and query efficiency, in most cases.", "venue": "IEEE Transactions on Industrial Informatics", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-01-01", "journal": {"name": "IEEE Transactions on Industrial Informatics", "pages": "594-604", "volume": "19"}, "authors": [{"authorId": "2149509114", "name": "Guangsheng Chen"}, {"authorId": "4661558", "name": "Weitao Zou"}, {"authorId": "2831961", "name": "Weipeng Jing"}, {"authorId": "2149191656", "name": "Wei Wei"}, {"authorId": "1710827", "name": "R. Scherer"}], "citations": [{"paperId": "34208ab137ad1b29effa0bef760b93a47e42bd2e", "title": "Polygon Simplification for the Efficient Approximate Analytics of Georeferenced Big Data"}, {"paperId": "77450c8a3f0748a9aa1dad786d3b1dd7e2a728f1", "title": "Guest Editorial: Augmented Intelligence of Things for Smart Enterprise Systems"}]}
