{"paperId": "797964d067c67997eae6655a51de88a0ea1d541d", "publicationVenue": {"id": "0aed7a40-85f3-4c66-9e1b-c1556c57001b", "name": "PLoS ONE", "type": "journal", "alternate_names": ["Plo ONE", "PLOS ONE", "PLO ONE"], "issn": "1932-6203", "url": "https://journals.plos.org/plosone/", "alternate_urls": ["http://www.plosone.org/"]}, "title": "The application of structural and machine learning models to predict the default risk of listed companies in the Iranian capital market", "abstract": "Inattention of economic policymakers to default risk and making inappropriate decisions related to this risk in the banking system and financial institutions can have many economic, political and social consequences. In this research, it has been tried to calculate the default risk of companies listed in the capital market of Iran. To achieve this goal, two structural models of Merton and Geske, two machine learning models of Random Forest and Gradient Boosted Decision Tree, as well as financial information of companies listed in the Iranian capital market during the years 2016 to 2021 have been used. Another goal of this research is to measure the predictive power of the four models presented in the calculation of default risk. The results obtained from the calculation of the default rate of the investigated companies show that 50 companies listed in the Iranian capital market (46 different companies) have defaulted during the 5-year research period and are subject to the Bankruptcy Article of the Iranian Trade Law. Also, the results obtained from the ROC curves for the predictive power of the presented models show that the structural models of Merton and Geske have almost equal power, but the predictive power of the Random Forest model is a little more than the Gradient Boosted Decision Tree model.", "venue": "PLoS ONE", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-11-27", "journal": {"name": "PLOS ONE", "volume": "18"}, "authors": [{"authorId": "52426142", "name": "P. Peykani"}, {"authorId": "2268458319", "name": "Mostafa Sargolzaei"}, {"authorId": "2185633042", "name": "Negin Sanadgol"}, {"authorId": "2158303051", "name": "Amir Takaloo"}, {"authorId": "2268457475", "name": "Hamidreza Kamyabfar"}], "citations": []}
