{"paperId": "7981a846f4d2c7baa5e6e19569daa9e3f011cf81", "publicationVenue": {"id": "ef1356d5-69c7-484e-a110-3efae1e93ecc", "name": "IEEE/CAA Journal of Automatica Sinica", "type": "journal", "alternate_names": ["IEEE/CAA J Autom Sin"], "issn": "2329-9266", "url": "https://ieeexplore.ieee.org/servlet/opac?punumber=6570654", "alternate_urls": ["http://www.ieee-jas.org/"]}, "title": "Attacks Against Cross-Chain Systems and Defense Approaches: A Contemporary Survey", "abstract": "The blockchain cross-chain is a significant technology for inter-chain interconnection and value transfer among different blockchain networks. Cross-chain overcomes the “information island” problem of the closed blockchain network and is increasingly applied to multiple critical areas such as finance and the internet of things (IoT). Blockchain can be divided into three main categories of blockchain networks: public blockchains, private blockchains, and consortium blockchains. However, there are differences in block structures, consensus mechanisms, and complex working mechanisms among heterogeneous blockchains. The fragility of the cross-chain system itself makes the cross-chain system face some potential security and privacy threats. This paper discusses security defects on the cross-chain implementation mechanism, and discusses the impact of the structural features of blockchain networks on cross-chain security. In terms of cross-chain intercommunication, a cross-chain attack can be divided into a multi-chain combination attack, native chain attack, and inter-chain attack diffusion. Then various security threats and attack paths faced by the cross-chain system are analyzed. At last, the corresponding security defense methods of cross-chain security threats and future research directions for cross-chain applications are put forward.", "venue": "IEEE/CAA Journal of Automatica Sinica", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-08-01", "journal": {"name": "IEEE/CAA Journal of Automatica Sinica", "pages": "1647-1667", "volume": "10"}, "authors": [{"authorId": "2152220352", "name": "Li Duan"}, {"authorId": "2151882580", "name": "Yangyang Sun"}, {"authorId": "144820734", "name": "Wei Ni"}, {"authorId": "2163787981", "name": "Weiping Ding"}, {"authorId": "2132637642", "name": "Jiqiang Liu"}, {"authorId": "2158505683", "name": "Wei Wang"}], "citations": [{"paperId": "a7a7833b1aae1582a640caac2422de11feba446f", "title": "A Repeated Game-Based Distributed Denial of Service Attacks Mitigation Method for Mining Pools"}, {"paperId": "72a100e85f90facae34d8ed6db4c1e5997a262be", "title": "A Trusted Sharing Model for Risk Information of Food Full-process and All-information Based on Blockchain and Federated Learning"}, {"paperId": "1c31c456c1bdbc86113130add983e0e0ed46756d", "title": "Multi-Blockchain Based Data Trading Markets With Novel Pricing Mechanisms"}, {"paperId": "cf67884b903e5287f3c246c547af54c9d2e30d58", "title": "A New Smart Contract Anomaly Detection Method by Fusing Opcode and Source Code Features for Blockchain Services"}, {"paperId": "b4e6310f7ae5d23156c959a3b46cda54a2f9197e", "title": "Cross-chain General Message Passing Protocol via Eternal Bridge"}, {"paperId": "ba72dcfe336de3577783aea16f7905a00339aedb", "title": "Decentralized Finance (DeFi): A Survey"}, {"paperId": "3f84851c65e5de6aee859fd9009de44e904a3bc4", "title": "The Application of Hakka Enclosed House Elements in Rural Public Space-Taking Gankeng Town as an Example"}]}
