{"paperId": "7985106cd9508f98039467b530b3ee293fde7737", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Comparative Study on the Effect of Shape Complexity on the Efficiency of Different Overlay Analysis Algorithms", "abstract": "Polygon shape is an important factor affecting the efficiency of vector polygon overlay analysis. Aiming at the problems that polygon shape is difficult to accurately measure and different algorithms have different sensitivities to the same polygon in vector polygon overlay analysis, 27 shape variables are selected from literature to establish the shape complexity models for Vatti, Greiner-Hormann and Martinez algorithms by multiple linear regression analysis in this paper. These three algorithms are suitable for arbitrary polygon clipping and include intersection, union, difference and symmetric difference operators. The experimental results show that the calculated performances of the intersection, union, difference and symmetric difference operators belonging to the same algorithm are similar to their sensitivity to the same polygon shape. The fitting correlation coefficient R2 of the shape complexity model based on the Greiner-Hormann algorithm is the highest among the three algorithms, which can explain 99% of the performance of this algorithm.", "venue": "IEEE Access", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "144179-144194", "volume": "9"}, "authors": [{"authorId": "2151331383", "name": "Peng Zhang"}, {"authorId": "49714653", "name": "Junfu Fan"}, {"authorId": "2207016517", "name": "Panpan Zhang"}, {"authorId": "2135582553", "name": "Zhikun Zhang"}, {"authorId": "2141145503", "name": "Zheng Chen"}, {"authorId": "46930959", "name": "Liusheng Han"}], "citations": [{"paperId": "462fb1c33d16f95fb5b055fcfd12aca6d8fb878f", "title": "Multicore Parallelized Spatial Overlay Analysis Algorithm Using Vector Polygon Shape Complexity Index Optimization"}, {"paperId": "1f890b3d5a386d841e5ccd93500f08c1a94c62fe", "title": "A method for measuring geometric information content of area cartographic objects based on discrepancy degree of shape points"}, {"paperId": "c20903e4cb320ea9ceee249b21a474eb6c925d20", "title": "Spatiotemporal Analysis of Urban Green Areas Using Change Detection: A Case Study of Kharkiv, Ukraine"}]}
