{"paperId": "798ae76704c0c68b506a89c398407ee076e89df3", "publicationVenue": {"id": "6783a3e6-dd20-4b41-a808-933fb104f37d", "name": "International Journal of Corpus Linguistics", "type": "journal", "alternate_names": ["Int J Corpus Linguistics"], "issn": "1384-6655", "url": "https://benjamins.com/catalog/ijcl"}, "title": "Register variation across text lengths", "abstract": "\nThis paper explores variation in lexico-grammatical register features across text lengths in a large-scale sample of Reddit comments. Very short texts are known to be problematic for many statistical methods, so understanding their nature is important for the corpus-linguistic study of social media, where most contributions are short. I show that the frequencies of linguistic features change with comment length, even between longer comments, although longer texts are often considered similar in statistical terms. Moreover, I classify the variation found between short comments of different lengths into two main patterns, although other patterns can also be found, and there is variation even within these patterns. Furthermore, I interpret the observed differences in terms of register variation. For example, shorter comments appear to be more casual and less edited in terms of their feature makeup, whereas narrative and informational registers seem to favor longer comments.", "venue": "International Journal of Corpus Linguistics", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-08-23", "journal": {"name": "International Journal of Corpus Linguistics"}, "authors": [{"authorId": "1392927669", "name": "A. Liimatta"}], "citations": [{"paperId": "f48d8373b137398c13b9214e345aa7d0d36fd0dd", "title": "Linguistic Variation in Functional Types of Statutory Law"}, {"paperId": "ad7ba3b5eecbc4c0bf7dd32650267d1f302eb1a5", "title": "A novel multi-dimensional analysis of reply, response and rejoinder articles: When discipline meets time"}, {"paperId": "98eefeb60efb3a7e1fce55f46290a1c3e43c0500", "title": "Do registers have different functions for text length?"}]}
