{"paperId": "79936be44448515df4af4c1839c63e53a1f9d3ed", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Energy Consumption Minimization for Near-Far Server Cooperation in NOMA-Assisted Mobile Edge Computing System", "abstract": "Mobile edge computing (MEC) is fast becoming a key communication technique by enabling mobile users to offload their computation tasks to the edge servers. However, the computation resource of each MEC server is limited which may lead to a worse offloading experience of dense edge users. Besides, the communication and computation resources are usually unevenly distributed among different MEC servers which affect the computational efficiency of the MEC network. In this paper, we propose a non-orthogonal multiple access (NOMA) assisted MEC system with two near-far edge servers performing cooperative communication, i.e., the edge user employs NOMA to offload partial computation workloads to a nearer MEC server and a farther MEC server, then the nearer server decodes and forwards the farther server’s task data by full-duplex relaying mode. Based on the above system model, we formulate an optimization problem of the total system energy consumption minimization by jointly optimizing the local CPU frequency, the power allocation for the user and nearer MEC server, the system time assignment and the task partition. Due to the optimization problem is non-convex, a joint communication and computation resource iterative optimization (JCCRIO) algorithm based on approximation and alternation is designed. Firstly, the local CPU frequency is optimized so as to transform the original problem into a simplified equivalent form. In this way, then the simplified minimization problem can be solved iteratively in two steps. Finally, we obtain the closed-form solutions to the optimization variables at each step. Numerical results show that the proposed NOMA-assisted cooperative MEC scheme is more effective against the terms of energy consumption reduction than comparable schemes.", "venue": "IEEE Access", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "133269-133282", "volume": "8"}, "authors": [{"authorId": "46809477", "name": "Xiao-xia Duan"}, {"authorId": "2047712", "name": "Baogang Li"}, {"authorId": "2150717515", "name": "Wei Zhao"}], "citations": [{"paperId": "293d38fbf3ac813a77fd6cb3ea0db6b6435d7b32", "title": "CoNet: Borderless and decentralized server cooperation in edge computing"}, {"paperId": "9245c98e1dd74c0230f7dec42127ee743436c6e5", "title": "Overview of Energy Consumption Optimization in Mobile Edge Computing"}, {"paperId": "f74b2f9ede11a780448d3eee85bf0076c84c06de", "title": "Performance Analysis of MEC Based on NOMA under Imperfect CSI with Eavesdropper"}, {"paperId": "64f38b9d9c90f97e911e25293b55c50464046ef6", "title": "User Clustering and Power Allocation for Energy Efficiency Maximization in Downlink Non-Orthogonal Multiple Access Systems"}]}
