{"paperId": "799d5a8271887adede035644d878c7bd555576df", "publicationVenue": null, "title": "Geospatial Data Management Research: Progress and Future Directions", "abstract": "Without geospatial data management, today’s challenges in big data applications such as earth observation, geographic information system/building information modeling (GIS/BIM) integration, and 3D/4D city planning cannot be solved. Furthermore, geospatial data management plays a connecting role between data acquisition, data modelling, data visualization, and data analysis. It enables the continuous availability of geospatial data and the replicability of geospatial data analysis. In the first part of this article, five milestones of geospatial data management research are presented that were achieved during the last decade. The first one reflects advancements in BIM/GIS integration at data, process, and application levels. The second milestone presents theoretical progress by introducing topology as a key concept of geospatial data management. In the third milestone, 3D/4D geospatial data management is described as a key concept for city modelling, including subsurface models. Progress in modelling and visualization of massive geospatial features on web platforms is the fourth milestone which includes discrete global grid systems as an alternative geospatial reference framework. The intensive use of geosensor data sources is the fifth milestone which opens the way to parallel data storage platforms supporting data analysis on geosensors. In the second part of this article, five future directions of geospatial data management research are presented that have the potential to become key research fields of geospatial data management in the next decade. Geo-data science will have the task to extract knowledge from unstructured and structured geospatial data and to bridge the gap between modern information technology concepts and the geo-related sciences. Topology is presented as a powerful and general concept to analyze GIS and BIM data structures and spatial relations that will be of great importance in emerging applications such as smart cities and digital twins. Data-streaming libraries and “in-situ” geo-computing on objects executed directly on the sensors will revolutionize geo-information science and bridge geo-computing with geospatial data management. Advanced geospatial data visualization on web platforms will enable the representation of dynamically changing geospatial features or moving objects’ trajectories. Finally, geospatial data management will support big geospatial data analysis, and graph databases are expected to experience a revival on top of parallel and distributed data stores supporting big geospatial data analysis.", "venue": "ISPRS Int. J. Geo Inf.", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-02-04", "journal": {"name": "ISPRS Int. J. Geo Inf.", "pages": "95", "volume": "9"}, "authors": [{"authorId": "3248270", "name": "M. Breunig"}, {"authorId": "145663597", "name": "P. Bradley"}, {"authorId": "46581566", "name": "M. Jahn"}, {"authorId": "145216339", "name": "P. Kuper"}, {"authorId": "1576996670", "name": "Nima Mazroob"}, {"authorId": "2071346808", "name": "N. Rösch"}, {"authorId": "1403759150", "name": "M. Al-Doori"}, {"authorId": "2418044", "name": "E. Stefanakis"}, {"authorId": "1483744000", "name": "M. Jadidi"}], "citations": [{"paperId": "f1b22ce904842c1be4229443e6537cb8528fa963", "title": "Spherical Gravity Forwarding of Global Discrete Grid Cells by Isoparametric Transformation"}, {"paperId": "90aa34ab254039e9943a0bb1d5529ee7c9a31653", "title": "A GIS-Based Top-Down Approach to Support Energy Retrofitting for Smart Urban Neighborhoods"}, {"paperId": "b758623f5489d28fb2b39be757e229c9271b78a5", "title": "RESEARCH ON CONSTRUCTION OF NATURAL RESOURCES THREE-DIMENSIONAL SPATIO-TEMPORAL DATABASE SYSTEM"}, {"paperId": "b3b2e3d901066b7bb9c95a2dd6017002c3fc405d", "title": "Deep Learning for Cross-Domain Data Fusion in Urban Computing: Taxonomy, Advances, and Outlook"}, {"paperId": "ce0d554263edcdef061e4db6f72290186e7bcede", "title": "Analysis of the Regularity of Distribution of Natural Landscapes in the Greater Caucasus Depending on Physical-Geographical Characteristics Using GIS Technology"}, {"paperId": "8b86875107b6cb7c2074ba94c0dd66093c618d00", "title": "Mass-Balance-Consistent Geological Stock Accounting: A New Approach toward Sustainable Management of Mineral Resources"}, {"paperId": "e8f578b5b022333489758b47025a1edbd36dc94a", "title": "An efficient visual exploration approach of geospatial vector big data on the web map"}, {"paperId": "207be119a92827de805fbd0b10a0d635c10aefca", "title": "Quantum Machine Learning on Remote Sensing Data Classification"}, {"paperId": "28ee52476342cfe935ecb0836348db221f50a6c8", "title": "A Novel Query Method for Spatial Database Based on Improved K-Nearest Neighbor Algorithm"}, {"paperId": "fd34804305c7da3045e140141f4d4da3fe73e02c", "title": "Concept of Server-side Clusterization of Semi-Static Big Geodata for Web Maps"}, {"paperId": "c33dffc451a67a38c1767e47aeaf292bb7056777", "title": "Study on Digital Twin Technologies for Watershed Information Modeling (WIM): A Systematic Literature Review and Bibliometric Analysis"}, {"paperId": "f30e8f6cb7982913cb9387fb4364ea682abbf3e9", "title": "A Big Data Grided Organization and Management Method for Cropland Quality Evaluation"}, {"paperId": "159052bab6be0689e70091ae383b22818ff2f90a", "title": "Geospatial Big Data for a Sustainable and Green Smart City"}, {"paperId": "e8ae6dfff744cccf319674cd542402e35a7ba795", "title": "Application and enabling technologies of digital twin in operation and maintenance stage of the AEC industry: A literature review"}, {"paperId": "4d69e48d11c5c5211684d1ec02dc192d2580f51f", "title": "Natural Hazard Impact in Protected Areas for Resilience Management: The Case of Wildfires in the Basilicata Region"}, {"paperId": "5ed5d7e5a843741619133eee860001a5804d182c", "title": "Single Update Sketch with Variable Counter Structure"}, {"paperId": "24e152270df0b79b44f25d24b3764997636e256f", "title": "Challenges of a GIS-based physical-geographical regionalization of Poland"}, {"paperId": "d14a597864bc2b0a6b79fa88bac63894ec88c9fe", "title": "Construction of quality evaluation indicator system for diamond discrete global grid systems"}, {"paperId": "8aeb59df7223024e9f68453cf7a88a4e99448829", "title": "A Knowledge Graph-driven Method for Geospatial Data Production"}, {"paperId": "b19419645ce23fede6e1227dd5c8085dbfd8a204", "title": "3D WEBGIS APPLICATIONS FOR DIGITAL HUMANITIES STUDIES: THE TURIN 1911 PROJECT"}, {"paperId": "5dfe71bc0b4e4e21abe59e794819f84240e693cf", "title": "BETWEEN SPATIAL AND ARCHIVAL DATA: DIGITAL HUMANITIES FOR THE HISTORY OF A STAIRCASE OF PITTI PALACE"}, {"paperId": "704fb0508f72a40566fb45279903fb124b3b44c8", "title": "The Role of Information Technology in Improving Urban Governance"}, {"paperId": "20fc079a6116c2e72cfffc5ae8c8a1b520633e06", "title": "W-Hilbert: A W-shaped Hilbert curve and coding method for multiscale geospatial data index"}, {"paperId": "762943143618dc58b580dc7064f9d8353f28f64d", "title": "Construction and Modification of Topological Tables for Digital Models of Linear Complexes"}, {"paperId": "334f93eb362a332dc2a64128e0262d5b9c399fcf", "title": "Implementation of Digital Geotwin-Based Mobile Crowdsensing to Support Monitoring System in Smart City"}, {"paperId": "f75b23dee352debf7a3cde644c03410f34703cf8", "title": "A review of geospatial technologies for improving Marine Spatial Planning: Challenges and opportunities"}, {"paperId": "d8cca70598f85ef1dffd489c4d04a74a53cb9cd0", "title": "Digital twin-supported smart city: Status, challenges and future research directions"}, {"paperId": "5471f0b024d00b939e6f7d9dcc00101201a13429", "title": "An Efficient Approach for Track Data Simplification in Geographic Information System"}, {"paperId": "ff8dcd4b1fea978f5a877ab51e5071ffcdded64d", "title": "Mobile Terminal Simulation of Network Guiding Innovation Platform"}, {"paperId": "54508fd111116eaa11590a780d73c9ddf0ec1324", "title": "Understanding and Improving Information Extraction From Online Geospatial Data Visualizations for Screen-Reader Users"}, {"paperId": "73581e6df0c5de38136de4cea4d93889e16a3872", "title": "Transforming Social Determinants to Educational Outcomes: Geospatial Considerations"}, {"paperId": "a042c4a206ab7a3e4b47d302aa72fa0a96bfbd5e", "title": "Geospatial Information Research: State of the Art, Case Studies and Future Perspectives"}, {"paperId": "cd6d93149d3ab7da013684ef068007d669f72700", "title": "Ganos: A Multidimensional, Dynamic, and Scene-Oriented Cloud-Native Spatial Database Engine"}, {"paperId": "80ce36699037587beb3e781688c860a6faa37280", "title": "Automating the Integration of Services for the Web Processing of Environmental Monitoring Data with Distributed Scientific Applications"}, {"paperId": "6afaeaed6f163d5a6306ca3811420735b10747d1", "title": "Perfomance Evaluation of Java Serialization Frameworks on Geospatial Big Data"}, {"paperId": "0544f5f7402b7cc625c8f9bc331152bca3b2be1d", "title": "Area and shape distortions in open-source discrete global grid systems"}, {"paperId": "a75e471f483dae50e61e163a9620a3f2a5c36a8e", "title": "Contamination presence and dynamics at a polluted site: Spatial analysis of integrated data and joint conceptual modeling approach."}, {"paperId": "703c6c79ef4923bdfb53a0e41b8f3b8ceb9c70c7", "title": "A Robustness Study for the Extraction of Watertight Volumetric Models from Boundary Representation Data"}, {"paperId": "c54bd1c32f96e06337515d1ac8f7dce43a945710", "title": "An Access Control Mechanism for Geospatial Image Security Using Encrypted Pyramid Structure"}, {"paperId": "1fbf2c0462c9f8bc13aefc71976bec7cd8c914df", "title": "Python for Smarter Cities: Comparison of Python libraries for static and interactive visualisations of large vector data"}, {"paperId": "f1c6eddd26b99dfaa4fd3bc894d3d6bda1dd2fc0", "title": "Evaluation of an Android-Based Application for Monitoring the Spread of Covid-19 in Real-Time"}, {"paperId": "3b48bede2972acd0a48ca07cb345ad9513db5092", "title": "TRENDS IN BIM AND GIS STANDARDIZATION – REPORT FROM THE JOINT\nISO/TC59/SC13–ISO/TC211 WG: GIS-BIM"}, {"paperId": "844f18597bb32fc3248c1f0c691baed980547145", "title": "GPU UTILIZATION IN GEOPROCESSING BIG GEODATA: A REVIEW"}, {"paperId": "eccaaecbc4f106a2d2fff2bfeb29b5830c9cf6bf", "title": "Scenario Expression Method for Regional Geological Structures"}, {"paperId": "eb327e6418718c2cf4f6dbbf50030fc9664c460a", "title": "Integration of Web Processing Services with Workflow-Based Scientific Applications for Solving Environmental Monitoring Problems"}, {"paperId": "4291cdccb1ca3f8dc9339a362d1a5bb6ab2997ca", "title": "MODELLING IMMOVABLE ASSET IN 3D USING CITYGML 3.0 CONCEPT TO SUPPORT SMART CITY INITIATIVES"}, {"paperId": "bb78dc2e16f42fb01bf8d911d394517f32db89dc", "title": "COMPUTING WATERTIGHT VOLUMETRIC MODELS FROM BOUNDARY REPRESENTATIONS TO ENSURE CONSISTENT TOPOLOGICAL OPERATIONS"}, {"paperId": "c9b6d9967a7a911aab9689c974a1df57549dfd15", "title": "City Information Modelling as a support decision tool for planning and management of cities: A systematic literature review and bibliometric analysis"}, {"paperId": "7dc215cbc3c3e2d93ac5789e989af3659c133eb0", "title": "Applications of geospatial big data in the Internet of Things"}, {"paperId": "8d34dc003b692ac68acaaaeb2114c00546eb41d8", "title": "Investigation of Groundwater Prospecting Zones of the Giri River Catchment of the Himachal Pradesh and Its Quality Suitability for Human Consumption"}, {"paperId": "de926fb2103ac1b2213d7c72450ff44b8378574d", "title": "Bibliometric analysis of building information modeling, geographic information systems and web environment integration"}, {"paperId": "d181329d7b329bcb9028eef8a76188f8e99a9d58", "title": "Big Data in Smart City: Management Challenges"}, {"paperId": "dc153950b442d800018cb7a6235c40c60b9182cc", "title": "Geometric Model Checking of Continuous Space"}, {"paperId": "f540913977e35a644116492a55ac5c11b7547b57", "title": "Utilization of geospatial technology for land use planning and sustainable agricultural mapping in Aceh Province, Indonesia: a case study"}, {"paperId": "508d76ac2876c261ab45d298a535116e2ffbb451", "title": "Chiuro laboratory: integration of workflows from digital survey to optimised 3D urban models for interactive exploration"}, {"paperId": "ee0b4cdeff94b579273a5f5e0ad682f47e1594db", "title": "Smart technology applications for the optimal management of underground facilities"}, {"paperId": "34078d8baabcab74b69a6d824dae775985019623", "title": "Sustainable Smart Cities and Energy Management: The Labor Market Perspective"}, {"paperId": "601cd68978edf717caf4e574677ede2babb77405", "title": "Open Standards used in Oceanography Research Spatial Data Repositories in Spain"}, {"paperId": "280b3da0bb9c762132578ccd55512b1740501c8a", "title": "Spatio-Temporal Research Data Infrastructure in the Context of Autonomous Driving"}, {"paperId": "0ee45581a5319cb600a93fa6347fa52d6cd6a502", "title": "A multi-granularity knowledge association model of geological text based on hypernetwork"}, {"paperId": "0e4cb076d055706fae70c5a9a8581e9b73575388", "title": "Managing the Engineering Projects Through the GIS Tools"}, {"paperId": "d3dc16cbe98291179b72c834dcb189a7f6f0c685", "title": "Advancements of Randomized Data Structures for Geospatial Data"}, {"paperId": "897a5eea09015068adf546c8ccedd9a1722d23f5", "title": "TGVE: a tool for analysis and visualization of geospatial data"}, {"paperId": "0a314fe89f1b8874c571f554ca5d8411d7433688", "title": "On Bisimilarity for Polyhedral Models and SLCS"}, {"paperId": "72ff472d6a2793590c56b87abfd147463cfa01c8", "title": "Review on Integrating Geospatial Big Datasets and Open Research Issues"}, {"paperId": "c0c934035599f5c56e3ec6c4d2b6cbf205c26b71", "title": "Visualization of Georeferenced Data Through the Web: A Systematic Literature Review"}, {"paperId": "d637a9f68d8d58ed26e4f510ee5ebff3cd3e127c", "title": "Interactive Labeling for Generation of CityGML Building Models from Meshes"}, {"paperId": "f6a64b68ba70e5bacc00fabc215bcc7b0872e5ce", "title": "The New Geodatabase of the Municipality of Genoa: Innovative Aspects and Applications"}, {"paperId": "4a3e7eb231c351387b9e8adb3dc97dc956d94067", "title": "Mappemonde, 131 | 2021"}, {"paperId": "fc734fb30d511d0b9dd50755aeb44ac454719eda", "title": "Integration of BIM, GIS and WEB environments for solving multifaceted construction project problems"}, {"paperId": "1512ec5b81f3cba4578d5eb3716cefb1fda8a35f", "title": "A Study of the Impact of Interface Colour Schemes and Work Experience on Visual Search Performance"}, {"paperId": "6228db1c32b665becbc0cb676b13a27a178f08e5", "title": "A Method for Constructing and Managing Level of Detail for Non-Closed Boundary Models of Buildings"}]}
