{"paperId": "79ac5846e984c19400cb4a05fe6299cef2aed49a", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Personal Data Stores (PDS): A Review", "abstract": "Internet services have collected our personal data since their inception. In the beginning, the personal data collection was uncoordinated and was limited to a few selected data types such as names, ages, birthdays, etc. Due to the widespread use of social media, more and more personal data has been collected by different online services. We increasingly see that Internet of Things (IoT) devices are also being adopted by consumers, making it possible for companies to capture personal data (including very sensitive data) with much less effort and autonomously at a very low cost. Current systems architectures aim to collect, store, and process our personal data in the cloud with very limited control when it comes to giving back to citizens. However, Personal Data Stores (PDS) have been proposed as an alternative architecture where personal data will be stored within households, giving us complete control (self-sovereignty) over our data. This paper surveys the current literature on Personal Data Stores (PDS) that enable individuals to collect, control, store, and manage their data. In particular, we provide a comprehensive review of related concepts and the expected benefits of PDS platforms. Further, we compare and analyse existing PDS platforms in terms of their capabilities and core components. Subsequently, we summarise the major challenges and issues facing PDS platforms’ development and widespread adoption.", "venue": "Italian National Conference on Sensors", "year": 2023, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2023-01-28", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "23"}, "authors": [{"authorId": "2203886355", "name": "Khalid U. Fallatah"}, {"authorId": "3293164", "name": "M. Barhamgi"}, {"authorId": "143742327", "name": "Charith Perera"}], "citations": [{"paperId": "cf707cf718078e6bbdcb86b97f7a9805e0d51293", "title": "A Systematic Review on Privacy-Aware IoT Personal Data Stores"}, {"paperId": "092a6f01155f398c45874256d70e09c0c3ff75c2", "title": "Post-mortem information management: exploring contextual factors in appropriate personal data access after death"}, {"paperId": "377f6603b31253f31975b2101a5a3c2935fbc446", "title": "Lifelogging As An Extreme Form of Personal Information Management - What Lessons To Learn"}, {"paperId": "f4ce7f8180dfcef8b12fbb2ee7483807940c1042", "title": "Visualising Personal Data Flows: Insights from a Case Study of Booking.com"}]}
