{"paperId": "79b06e40ead2b9c33a525d394d48c26c34766231", "publicationVenue": {"id": "0d6f7fba-7092-46b3-8039-93458dba736b", "name": "IEEE International Conference on Acoustics, Speech, and Signal Processing", "type": "conference", "alternate_names": ["Int Conf Acoust Speech Signal Process", "IEEE Int Conf Acoust Speech Signal Process", "ICASSP", "International Conference on Acoustics, Speech, and Signal Processing"], "url": "http://ieeexplore.ieee.org/xpl/conhome.jsp?punumber=1000002"}, "title": "Generalized Distributed Dual Coordinate Ascent in a Tree Network for Machine Learning", "abstract": "With explosion of data size and limited storage space at a single location, data are often distributed at different locations. We thus face the challenge of performing large-scale machine learning from these distributed data through communication networks. In this paper, we generalize the distributed dual coordinate ascent in a star network to a general tree structured network, and provide the convergence rate analysis of the general distributed dual coordinate ascent. In numerical experiments, we demonstrate that the performance of the distributed dual coordinate ascent in a tree network can outperform that of the distributed dual coordinate ascent in a star network when a network has a lot of communication delays between the center node and its direct child nodes.", "venue": "IEEE International Conference on Acoustics, Speech, and Signal Processing", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-05-01", "journal": {"name": "ICASSP 2019 - 2019 IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP)", "pages": "3512-3516"}, "authors": [{"authorId": "144799159", "name": "Myung Cho"}, {"authorId": "144637362", "name": "L. Lai"}, {"authorId": "34193597", "name": "Weiyu Xu"}], "citations": [{"paperId": "ba29140354bcb511613c9074bd5c51ac524f11a5", "title": "Distributed Dual Coordinate Ascent With Imbalanced Data on a General Tree Network"}, {"paperId": "39e0db5bae8f9ec7f880396405ea0c7eea276c4a", "title": "Distributed Dual Coordinate Ascent in General Tree Networks and Communication Network Effect on Synchronous Machine Learning"}]}
