{"paperId": "79b8f787a4334a1fc4baeb40c3b7b5e9a541fb38", "publicationVenue": null, "title": "Developing an Architecture for IoT Interoperability in Healthcare: A Case Study of Real-time SpO2 Signal Monitoring and Analysis", "abstract": "The article presents a novel approach to address the interoperability issues in the Internet of Things (IoT) systems. Based on the IoT Reference Architecture, an IoT system architecture integrated with gateways and data converter solutions has been proposed to enhance the information exchange and data sharing across interconnected devices, networks and platforms.In addition, distributed open-source analytic platforms for real-time computational and streaming processing has been introduced to the proposed architecture. A case study of real-time oxygen saturation (SpO2) monitoring and analysis has been implemented to demonstrate the feasibility of the proposed architecture. The experimental results show the efficiency in terms of collecting and analyzing large volumes of data.", "venue": "2020 IEEE International Conference on Big Data (Big Data)", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-12-10", "journal": {"name": "2020 IEEE International Conference on Big Data (Big Data)", "pages": "3394-3403"}, "authors": [{"authorId": "2006214821", "name": "Quoc H. Nguyen"}, {"authorId": "2066154598", "name": "Q. Dang"}, {"authorId": "1949053", "name": "Chuan Pham"}, {"authorId": "2642093", "name": "Tien-Dung Nguyen"}, {"authorId": "2110524826", "name": "Hang Nguyen"}, {"authorId": "9817735", "name": "Arveity Setty"}, {"authorId": "153050389", "name": "T. Le"}], "citations": [{"paperId": "39133c81f8419058bd75f2f0bc49ed3f1de68666", "title": "A Framework for Real-time Remote ECG Monitoring and Diagnoses"}, {"paperId": "fb3cc434150ef6233a6bb0da29cd9ac00868182d", "title": "Efficient IoT Data Management for Geological Disasters Based on Big Data-Turbocharged Data Lake Architecture"}]}
