{"paperId": "79b9f532ac82da23c86d82f3df483520e819661a", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Development of a Framework to Aid the Transition from Reactive to Proactive Maintenance Approaches to Enable Energy Reduction", "abstract": "The disparity between public datasets and real industrial datasets is limiting the practical application of advanced data analysis. Therefore, industry is stuck in a reactive mode regarding their maintenance strategy and cannot transition to cost-effective and energy-efficient proactive maintenance approaches. In this paper, an integration-type adaptation of the CRISP-DM data mining process model is proposed to combine domain expertise with data science techniques to address the pervasive data issues in industrial datasets. The development of the Industrial Data Analysis Improvement Cycle (IDAIC) framework led to the novel repurposing of knowledge-based fault detection and diagnosis (FDD) techniques for data quality assessment. Through interdisciplinary collaboration, the proposed framework facilitates a transition from reactive to proactive problem solving by firstly resolving known faults and data issues using domain expertise, and secondly exploring unknown or novel faults using data analysis.", "venue": "Applied Sciences", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-07-01", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "2059353023", "name": "M. Ahern"}, {"authorId": "1400154215", "name": "D. O’Sullivan"}, {"authorId": "3286083", "name": "K. Bruton"}], "citations": [{"paperId": "bf839a61276adf674802de79f35bb1a0abb4fa82", "title": "A dataset for fault detection and diagnosis of an air handling unit from a real industrial facility"}, {"paperId": "a9171b943fcae895c8124f66f0d21d671e2414f7", "title": "Implementation of the IDAIC Framework on an Air Handling Unit to Transition to Proactive Maintenance"}]}
