{"paperId": "79ba5dafe38c40287c66d2efd61c5d8fb4f09812", "publicationVenue": null, "title": "Secure IoHT Data Sharing in the Cloud: Machine Learning with Logistic Regression for Privacy Protection", "abstract": "Healthcare delivery and patient monitoring have been transformed by the fast rise of the Internet of Healthcare Things (IoHT). Cloud storage of sensitive health data creates privacy issues. Logistic Regression (LR) is used to ensure IoHT data sharing in this investigation. The cloud architecture allows efficient data exchange while protecting health information. LR is used to predict data sharing risk and make privacy choices. A varied collection of health measures and demographic data trains the model to generalize well to numerous contexts. The suggested system is tested extensively with Logistic Regression, which reliably identifies and mitigates privacy threats. Data accessibility and privacy are balanced by the model's high sensitivity and specificity. It also examines the model's interpretability to provide privacy prediction factors. This openness improves user trust and regulatory compliance. This technique is scalable for large-scale IoHT installations. The cloud-based IoHT data sharing challenge has a unique approach. Machine learning, especially Logistic Regression, protects privacy without reducing health data usefulness. This research increases healthcare data security in the connected device age.", "venue": "2024 2nd International Conference on Intelligent Data Communication Technologies and Internet of Things (IDCIoT)", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2024-01-04", "journal": {"name": "2024 2nd International Conference on Intelligent Data Communication Technologies and Internet of Things (IDCIoT)", "pages": "93-99"}, "authors": [{"authorId": "2260371798", "name": "Ramakrishnan Raman"}, {"authorId": "2279914985", "name": "K. Saravanan"}, {"authorId": "2291039787", "name": "Atul A Gokhale"}, {"authorId": "2292751799", "name": "K. Anitha"}, {"authorId": "2291039836", "name": "Ishwarya M.V"}, {"authorId": "2261953796", "name": "S. Sujatha"}], "citations": []}
