{"paperId": "79bb025077b46d4f1340ea46084532fdb5e650de", "publicationVenue": {"id": "138e58fc-8643-41c2-a92c-068ea4f4c607", "name": "PeerJ Computer Science", "alternate_names": ["Peerj Comput Sci"], "issn": "2376-5992", "url": "https://peerj.com/archives/?journal=cs", "alternate_urls": ["https://peerj.com/computer-science/", "http://peerj.com/cs"]}, "title": "Digital security vulnerabilities and threats implications for financial institutions deploying digital technology platforms and application: FMEA and FTOPSIS analysis", "abstract": "Digital disruptions have led to the integration of applications, platforms, and infrastructure. They assist in business operations, promoting open digital collaborations, and perhaps even the integration of the Internet of Things (IoTs), Big Data Analytics, and Cloud Computing to support data sourcing, data analytics, and storage synchronously on a single platform. Notwithstanding the benefits derived from digital technology integration (including IoTs, Big Data Analytics, and Cloud Computing), digital vulnerabilities and threats have become a more significant concern for users. We addressed these challenges from an information systems perspective and have noted that more research is needed identifying potential vulnerabilities and threats affecting the integration of IoTs, BDA and CC for data management. We conducted a step-by-step analysis of the potential vulnerabilities and threats affecting the integration of IoTs, Big Data Analytics, and Cloud Computing for data management. We combined multi-dimensional analysis, Failure Mode Effect Analysis, and Fuzzy Technique for Order of Preference by Similarity for Ideal Solution to evaluate and rank the potential vulnerabilities and threats. We surveyed 234 security experts from the banking industry with adequate knowledge in IoTs, Big Data Analytics, and Cloud Computing. Based on the closeness of the coefficients, we determined that insufficient use of backup electric generators, firewall protection failures, and no information security audits are high-ranking vulnerabilities and threats affecting integration. This study is an extension of discussions on the integration of digital applications and platforms for data management and the pervasive vulnerabilities and threats arising from that. A detailed review and classification of these threats and vulnerabilities are vital for sustaining businesses’ digital integration.", "venue": "PeerJ Computer Science", "year": 2021, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-08-03", "journal": {"name": "PeerJ Computer Science", "volume": "7"}, "authors": [{"authorId": "1712199889", "name": "S. A. Edu"}, {"authorId": "2779273", "name": "Mary Agoyi"}, {"authorId": "1712195892", "name": "D. Q. Agozie"}], "citations": [{"paperId": "419c353865911166f2a08eec4ceacf087a0eeebd", "title": "Why do so many digital transformations fail? A bibliometric analysis and future research agenda"}, {"paperId": "b2a9cb33f7a6c82320540d7f697ca5a85c65b5d4", "title": "Securing financial data storage: A review of cybersecurity challenges and solutions"}, {"paperId": "2a3637d57049285c5cebdb456fd44392f8feb45d", "title": "Application of Failure Mode and Effects Analysis to Improve the Quality of the Front Page of Electronic Medical Records in China: Cross-Sectional Data Mapping Analysis"}, {"paperId": "ba00b9595286aeadc84045d74c6d9bf84abb7ecc", "title": "Enterprise information security risks: a systematic review of the literature"}, {"paperId": "efc8b47e0332ced8dd6f4134528622bcb3be0bfa", "title": "Metaverse: A Bibliometric Analysis by Internet Crawler and Big Data Technology"}, {"paperId": "222d433fd2e78fb64197acec02975aa7f2edec3a", "title": "Proposal for an objective binary benchmarking framework that validates each other for comparing MCDM methods through data analytics"}, {"paperId": "961332a242a830cc3604c351ff4311500704ee3c", "title": "Preserving cultural heritage through virtual simulation design of traditional clothing styles: a study of Mazu clothing"}, {"paperId": "a9c239bb8cb692fb5089c85e9e51e95038903910", "title": "Indonesian Journal of Electrical Engineering and Computer Science"}]}
