{"paperId": "79bfa3a8e065ba6fa9501b3e9d9999b4fb895168", "publicationVenue": {"id": "1b767051-ba1f-457e-bd23-1b483c7029c7", "name": "E3S Web of Conferences", "alternate_names": ["E3S Web Conf"], "issn": "2267-1242", "url": "https://web.archive.org/web/*/http:/www.e3s-conferences.org/", "alternate_urls": ["https://www.e3s-conferences.org/"]}, "title": "A survey on AI Approaches for Internet of Things Devices Failure Prediction", "abstract": "The use of Internet of Things (IoT) devices has experienced a substantial surge in various sectors, including manufacturing, healthcare, agriculture, and transportation. Nonetheless, the susceptibility of these devices to failures has emerged as a significant concern, contributing to costly periods of inactivity and diminished productivity. Consequently, the development of sophisticated and precise techniques for forecasting device failures in advance has become imperative. This research paper thoroughly investigates and analyses the most recent advancements and scholarly inquiries pertaining to the implementation of artificial intelligence methodologies, notably machine learning and deep learning, in the realm of predicting and averting IoT device failures. These AI-based approaches can be trained on extensive historical datasets, enabling the detection of distinctive patterns and anomalies that serve as potential precursors to device malfunctions. By incorporating these innovative failure prediction techniques into their operations, organizations can actively identify and address potential issues, thereby minimizing the adverse repercussions of device failures on their overall performance and functionality.", "venue": "E3S Web of Conferences", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Conference", "Review"], "publicationDate": null, "journal": {"name": "E3S Web of Conferences"}, "authors": [{"authorId": "2275695117", "name": "Ouiam Khattach"}, {"authorId": "2276810923", "name": "Omar Moussaoui"}, {"authorId": "2275709584", "name": "Mohammed Hassine"}], "citations": []}
