{"paperId": "79c2b825d40313a798693a3f7a75b76659c4f78a", "publicationVenue": {"id": "af806702-8820-45ae-9a4e-2073e928bdef", "name": "Annual Conference on Information Sciences and Systems", "type": "conference", "alternate_names": ["CISS", "Annu Conf Inf Sci Syst", "Conference on Information Sciences and Systems", "Conf Inf Sci Syst"], "url": "http://www.wikicfp.com/cfp/program?id=476"}, "title": "A Novel Feature Selection Technique for Intrusion Detection System Using RF-RFE and Bio-inspired Optimization", "abstract": "A massive change has been brought about by the constantly expanding usage of technology and the internet, which has substantially enhanced the accessibility to services that might drastically alter people's lives. However, this every time-on connection has also enabled malicious actors to exploit vulnerabilities in hardware and software, leading to potential damage to network infrastructure. Due to the large amount of data flowing through networks, it can be difficult for cyber security experts to quickly identify and respond to potential security breaches. To maintain the security and protection of the network infrastructure and digital assets, the implementation of Intrusion Detection Systems is necessary. These systems aid in preserving the availability, confidentiality, and reliability of the network. Intrusion Detection Systems (IDS) is a key component in securing networks, but the complexity of large datasets used to build them can lead to time-consuming computations. To address this issue, a two-layer feature selection technique is proposed in this study. Results show the usefulness of the suggested feature selection strategy in lowering the complexity of IDS while enhancing accuracy. This approach is tested on a significant dataset called CSE-CIC-IDS-2018. Finally, Random Forest Classification is used to verify the model. The outcomes of this strategy show how the suggested feature selection technique works to make IDS less difficult while improving accuracy.", "venue": "Annual Conference on Information Sciences and Systems", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-03-22", "journal": {"name": "2023 57th Annual Conference on Information Sciences and Systems (CISS)", "pages": "1-6"}, "authors": [{"authorId": "2086709920", "name": "Zinia Anzum Tonni"}, {"authorId": "3253867", "name": "M. Rashed"}], "citations": [{"paperId": "4ababed9e3c434fe2ad360374ec321bd76076ba5", "title": "Recursive Feature Elimination with Cross-Validation with Decision Tree: Feature Selection Method for Machine Learning-Based Intrusion Detection Systems"}]}
