{"paperId": "79c83f362b31c0250ad917a4c70c77a9a0c7611c", "publicationVenue": null, "title": "Fog Computing based SDI Framework for Mineral Resources Information Infrastructure Management in India", "abstract": "Spatial Data Infrastructure (SDI) is an important concept for sharing spatial data across the web. With cumulative techniques with spatial cloud computing and fog computing, SDI has the greater potential and has been emerged as a tool for processing, analysis and transmission of spatial data. The Fog computing is a paradigm where Fog devices help to increase throughput and reduce latency at the edge of the client with respect to cloud computing environment. This paper proposed and developed a fog computing based SDI framework for mining analytics from spatial big data for mineral resources management in India. We built a prototype using Raspberry Pi, an embedded microprocessor. We validated by taking suitable case study of mineral resources management in India by doing preliminary analysis including overlay analysis. Results showed that fog computing hold a great promise for analysis of spatial data. We used open source GIS i.e. QGIS and QIS plugin for reducing the transmission to cloud from the fog node.", "venue": "", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2017-12-26", "journal": {"name": "arXiv: Distributed, Parallel, and Cluster Computing", "volume": ""}, "authors": [{"authorId": "34688005", "name": "Rabindra Kumar Barik"}, {"authorId": "3399971", "name": "R. K. Lenka"}, {"authorId": "51281290", "name": "N. Simha"}, {"authorId": "1732944", "name": "Harishchandra Dubey"}, {"authorId": "1690308", "name": "K. Mankodiya"}], "citations": [{"paperId": "8aa2a2c5f9d27a1eb37ad18ed769c2f71c5d9019", "title": "A Systematic Analysis on Raspberry Pi Prototyping: Uses, Challenges, Benefits, and Drawbacks"}, {"paperId": "384fc8a712c2eb45cdaeb2debf044440403a6b30", "title": "Utilizing technologies of fog computing in educational IoT systems: privacy, security, and agility perspective"}, {"paperId": "a9e48dda8ebb64d6f5e6058f19cd9088a3961e97", "title": "Automated Testing Tool: QTP"}, {"paperId": "bbb3d91243da9af523e63e74a769217de8a6d975", "title": "Comparative Analysis on Automated Testing of Web-based Application"}, {"paperId": "313e5a9ebc5e84e3dbc7e466348db64a376b0368", "title": "Performance Analysis of Automated Testing Tools: JMeter and TestComplete"}, {"paperId": "504d99e11b27cb6006169a1de2822de4504a1664", "title": "An Architecture to Support Interoperability in IoT Devices"}, {"paperId": "9cca3dade29ee7e829021f48dfdac4bf70b5dd0f", "title": "Load Performance Testing on Cloud Platform"}, {"paperId": "554d47b163c73d16ed24b6750405abb560adfeca", "title": "Performance and Load Testing: Tools and Challenges"}, {"paperId": "bd1716edfdd86b6439407c3248f4383029f9a41a", "title": "Geospatial Edge-Fog Computing: A Systematic Review, Taxonomy, and Future Directions"}, {"paperId": "acbbd57fd69bb2d48fa8498e2ad8aa67ed84291d", "title": "Fog Assisted Cloud Computing in Era of Big Data and Internet-of-Things: Systems, Architectures, and Applications"}]}
