{"paperId": "79cf5c8def1980786693031fa424843ef875262e", "publicationVenue": {"id": "19f79e93-facd-4a98-b616-5d2fbed32867", "name": "International Conference on 3D Technologies for the World Wide Web", "type": "conference", "alternate_names": ["Web3D", "Int Conf 3D Technol World Wide Web", "international conference on 3D web technology", "int conf 3D web technol"], "url": "http://www.wikicfp.com/cfp/program?id=3031"}, "title": "Forests in the Digital Age: Concepts and Technologies for Designing and Deploying Forest Digital Twins", "abstract": "Forests are among the most widespread and diverse ecosystems on Earth, providing essential ecosystem services at local and global scales. However, they are facing major challenges due to climate change, economic pressures and human population growth. Digital twins of forests could help address these challenges by enabling comprehensive forest monitoring and supporting management decisions. In this publication, we describe how digital twins differ from other digital tools in the forest domain and explore concepts and technologies that can serve as the basis for implementing forest digital twins. We outline the underlying data model of the digital twins, which includes trees as the core forest elements, as well as their environment. We explain how a wide range of data collection approaches can be combined for comprehensive data collection and how the data can be integrated into a spatio-temporal forest data space. We describe data processing approaches to enrich raw data with semantic information and address how digital twins can support decision making through modeling and simulation. We explain the role of web-based visualization in interacting with forest digital twins. Overall, our concept lays the foundation for the technical implementation of forest digital twins that integrate, process, analyze and visualize forest data from a variety of sources. The implementation of forest digital twins in practice would enrich our understanding of forest ecosystems and enable targeted management of forests and their ecosystem services.", "venue": "International Conference on 3D Technologies for the World Wide Web", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2023-10-09", "journal": {"name": "Proceedings of the 28th International ACM Conference on 3D Web Technology"}, "authors": [{"authorId": "2256512307", "name": "Jürgen Döllner"}, {"authorId": "32902856", "name": "R. de Amicis"}, {"authorId": "2174735571", "name": "Josafat-Mattias Burmeister"}, {"authorId": "153698242", "name": "R. Richter"}], "citations": []}
