{"paperId": "79f1df49bde8636615a3b5e32314ee131cf1490a", "publicationVenue": {"id": "501c1070-b5d2-4ff0-ad6f-8769a0a1e13f", "name": "Wireless Communications and Mobile Computing", "type": "journal", "alternate_names": ["Wirel Commun Mob Comput"], "issn": "1530-8669", "url": "https://www.hindawi.com/journals/wcmc/", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/15308677", "http://www.interscience.wiley.com/jpages/1530-8669/"]}, "title": "T-RBAC Model Based on Two-Dimensional Dynamic Trust Evaluation under Medical Big Data", "abstract": "The professionalism and complexity of medical big data and the expensiveness of acquiring medical knowledge make it difficult for policymakers to judge whether the information accessed by doctors is necessary from a professional perspective and to formulate accurate access control strategies. To solve the above problems, this paper proposes a T-RBAC (trust-role based access control) model based on two-dimensional dynamic trust assessment, Using AHP and Grey theory to quantify the role attribute trust in the dimension of the doctor’s own attributes, Using Euler’s measurement method and probability statistics to quantify doctors’ behavioral trust in the dimension of historical behavior, then, the trust rule base performs hierarchical authorization based on the comprehensive trust value obtained by the weighted average. Multiattribute trust comprehensive evaluation makes the access control model have finer access granularity and higher security. At the same time, the introduction of time decay function and penalty function enhances the model’s sensitivity, dynamics, and resistance to bleaching attacks.", "venue": "Wireless Communications and Mobile Computing", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-08-12", "journal": {"name": "Wirel. Commun. Mob. Comput.", "pages": "9957214:1-9957214:17", "volume": "2021"}, "authors": [{"authorId": "2052890621", "name": "Rong Jiang"}, {"authorId": "2067673282", "name": "Yang Xin"}, {"authorId": "9369888", "name": "Huiping Cheng"}, {"authorId": "2139631514", "name": "Wenxuan Wu"}], "citations": [{"paperId": "25459e3295eeb0085f43da4501fb0faf12d164ac", "title": "A Blockchain-Based Trustworthy Access Control Scheme for Medical Data Sharing"}, {"paperId": "08b8d2a7abfc2e54b5d753b80bebbdb1a27a5395", "title": "Trust management in social Internet of Things across domains"}, {"paperId": "4078461fcb362a6004eb8322e16fdfdaaecf04c5", "title": "TRUST BASED MONTORING AND AUDITING SYSTEM FOR M-HEALTHCARE IN CLOUD COMPUTING: A Review"}]}
