{"paperId": "79f6c424c5c8c534dc9f7eeef10a388b24a7f23d", "publicationVenue": {"id": "501c1070-b5d2-4ff0-ad6f-8769a0a1e13f", "name": "Wireless Communications and Mobile Computing", "type": "journal", "alternate_names": ["Wirel Commun Mob Comput"], "issn": "1530-8669", "url": "https://www.hindawi.com/journals/wcmc/", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/15308677", "http://www.interscience.wiley.com/jpages/1530-8669/"]}, "title": "Threat Assessment for Android Environment with Connectivity to IoT Devices from the Perspective of Situational Awareness", "abstract": "As smartphones such as mobile devices become popular, malicious attackers are choosing them as targets. The risk of attack is steadily increasing as most people store various personal information such as messages, contacts, and financial information on their smartphones. Particularly, the vulnerabilities of the installed operating systems (e.g., Android, iOS, etc.) are trading at a high price in the black market. In addition, the development of the Internet of Things (IoT) technology has created a hyperconnected society in which various devices are connected to one network. Therefore, the safety of the smartphone is becoming an important factor to remotely control these technologies. A typical attack method that threatens the security of such a smartphone is a method of inducing installation of a malicious application. However, most studies focus on the detection of malicious applications. This study suggests a method to evaluate threats to be installed in the Android OS environment in conjunction with machine learning algorithms. In addition, we present future direction from the cyber threat intelligence perspective and situational awareness, which are the recent issues.", "venue": "Wireless Communications and Mobile Computing", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-04-11", "journal": {"name": "Wirel. Commun. Mob. Comput.", "pages": "5121054:1-5121054:14", "volume": "2019"}, "authors": [{"authorId": "40907130", "name": "Mookyu Park"}, {"authorId": "2599213", "name": "Jaehyeok Han"}, {"authorId": "4625633", "name": "Haengrok Oh"}, {"authorId": "1891565", "name": "Kyungho Lee"}], "citations": [{"paperId": "091a1804126cf6abfdbb638f81e1740e4e44e1e2", "title": "To Study Traffic Behaviors for Detecting Unusual Activities by Analyzing HTTP Packets"}, {"paperId": "e1ca851fb51fccc8fc912771f881174e23844ec5", "title": "A Systematic Literature Review and a Conceptual Framework Proposition for Advanced Persistent Threats (APT) Detection for Mobile Devices Using Artificial Intelligence Techniques"}, {"paperId": "849b9e11ea9be0e5cf890ee5e10ecd894ec6842f", "title": "A systematic literature review for APT detection and Effective Cyber Situational Awareness (ECSA) conceptual model"}, {"paperId": "6b559d13e9e38b2d23f1ef9be0a85668f2c63d63", "title": "Exploration of a network security situational awareness model based on multisource data fusion"}, {"paperId": "e9aafa41281473ab9d301e3776ff5a48f0525352", "title": "Recent Developments in Game-Theory Approaches for the Detection and Defense against Advanced Persistent Threats (APTs): A Systematic Review"}, {"paperId": "5914d3f0d6249438dc5498f378e6c76fa05b1f57", "title": "A Novel Trusted Software Base for Commercial Android Devices Using Secure TF Card"}, {"paperId": "d613f46f2a264377b2f2ad930428b92267541587", "title": "Threat detection in Internet of Things using Cuckoo search Chicken Swarm optimisation algorithm"}, {"paperId": "ade9540571d63d9af21a2e960994f62d8f632e82", "title": "Development of a Cyber-Situational Awareness Model of Risk Maturity Using Fuzzy FMEA"}, {"paperId": "120681221a7c5a928b3367917409e87f1f190ea6", "title": "A Multi-Component Analysis of CPTED in the Cyberspace Domain"}, {"paperId": "69820d9a73fc678994322bad113f8fa88dd2605b", "title": "Security Risk Measurement for Information Leakage in IoT-Based Smart Homes from a Situational Awareness Perspective"}, {"paperId": "96e1842b5e8d6a6c44d59aee89cd533f0faddc88", "title": "A Comprehensive Survey of Security Issues of Smart Home System: “Spear” and “Shields,” Theory and Practice"}, {"paperId": "24f198613c538c4a619d72030f3de35f72134349", "title": "Realizing IoE for Smart Service Delivery"}, {"paperId": "265c6f7e135e4eefb7254a892cc053a1dd5020e2", "title": "Permission Extraction Framework for Android Malware Detection"}, {"paperId": "2c4f1ca7efdfe9b7211bc627980046da39caf87c", "title": "Framework fitness/suitability- Real Time Risk Assessment Models v1"}]}
