{"paperId": "79f8c9b99bc746e501c024f6ca76c7a452ec626e", "publicationVenue": {"id": "2670b208-aca8-45b3-8a07-dba73daff0bf", "name": "International Transactions on Electrical Energy Systems", "type": "journal", "alternate_names": ["Int Trans Electr Energy Syst"], "issn": "0939-3072", "alternate_issns": ["2050-7038"], "url": "https://onlinelibrary.wiley.com/journal/15463109", "alternate_urls": ["http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)2050-7038", "http://www3.interscience.wiley.com/cgi-bin/jtoc/106562716/all"]}, "title": "Evaluation and Application of Public Management Service Quality of Smart City Based on Intelligent Computing", "abstract": "The service quality of smart city public management is the direction of modern city management construction of Chinese local government, but the current work of smart city management construction and management is not perfect. Among them, the most obvious and prominent problem is that there is no evaluation system for the public management service quality of smart cities, which makes it difficult to achieve the expected effect in the actual construction process without considering all factors. In this case, it is necessary to establish a complete and effective smart city management evaluation system to ensure the rationality and effectiveness of urban management input, which is a problem that must be solved by the current smart city local government smart city public management service quality. In this context, this paper first introduces and analyzes the research background, purpose, and significance of public satisfaction with public information services in smart cities. The origin, significance, and application status of smart cities are sorted out, the relationship between them is elaborated, and the overall research framework is determined. Second, the evaluation model of public management service quality of a smart city based on the fuzzy analytic hierarchy process is constructed, and the theoretical basis of this satisfaction model is elaborated. Finally, the simulation results demonstrate the effectiveness and practicability of the proposed method.", "venue": "International Transactions on Electrical Energy Systems", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-04-26", "journal": {"name": "International Transactions on Electrical Energy Systems"}, "authors": [{"authorId": "2146558880", "name": "Yang Lu"}], "citations": [{"paperId": "72b6efc17fa348484d7d8bdb740004b6b6882dc5", "title": "Retracted: Evaluation and Application of Public Management Service Quality of Smart City Based on Intelligent Computing"}, {"paperId": "6c1542d402720e2430451187cc6eaf571ae2d633", "title": "Intelligent urbanism with artificial intelligence in shaping tomorrow’s smart cities: current developments, trends, and future directions"}]}
