{"paperId": "7a03ff4cddb306b9c8ced2f5c0a1a9998774bb0e", "publicationVenue": {"id": "ccd8e532-73c6-414f-bc91-271bbb2933e2", "name": "Electronics", "type": "journal", "issn": "1450-5843", "alternate_issns": ["2079-9292", "0883-4989"], "url": "http://www.electronics.etfbl.net/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-247562", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-247562", "https://www.mdpi.com/journal/electronics"]}, "title": "AI in IIoT Management of Cybersecurity for Industry 4.0 and Industry 5.0 Purposes", "abstract": "If we look at the chronology of transitions between successive stages of industrialization, it is impossible not to notice a significant acceleration. There were 100 years between the industrial revolutions from 2.0 to 3.0, and only half a century passed from the conventional 3.0 to 4.0. Assuming that progress will inevitably continue to accelerate, and given that 2011 is the set date for the start of the fourth industrial revolution, we can expect Industry 5.0 by 2035. In recent years, Industrial Internet of Things (IIoT) applications proliferated, which include multiple network elements connected by wired and wireless communication technologies, as well as sensors and actuators placed in strategic locations. The significant pace of development of the industry of advantages in predicting threats to infrastructure will be related to the speed of analyzing the huge amount of data on threats collected not locally, but globally. This article sheds light on the potential role of artificial intelligence (AI) techniques, including machine learning (ML) and deep learning (DL), to significantly impact IIoT cyber threat prediction in Industry 5.0.", "venue": "Electronics", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-08", "journal": {"name": "Electronics"}, "authors": [{"authorId": "2219466575", "name": "Grzegorz Czeczot"}, {"authorId": "1678545", "name": "I. Rojek"}, {"authorId": "2249110", "name": "D. Mikołajewski"}, {"authorId": "2238791458", "name": "Belco Sangho"}], "citations": [{"paperId": "9e1f7032982481fc3ee5762a05bfc60026cfaa40", "title": "Autonomous Threat Response at the Edge Processing Level in the Industrial Internet of Things"}]}
