{"paperId": "7a07eea66007a5ba1a6e4a41704e4940d600b29b", "publicationVenue": {"id": "8c36c300-10f5-4008-ae53-6371fcc3030d", "name": "International Conferences on Information Science and System", "type": "conference", "alternate_names": ["ICISS", "International Conference on Information Systems Security", "Int Conf Inf Syst Secur", "Int Conf Intell Sustain Syst", "International Conference Intelligent Sustainable Systems", "Int Conf Inf Sci Syst"], "url": "http://www.wikicfp.com/cfp/program?id=1400"}, "title": "Smart Tourism Destinations Research Trend: A Systematic Literature Review", "abstract": "Purpose - This study aims to identify and analyze the main themes, the countries, the destination category, and the current trend regarding Smart Tourism research through a systematic literature review (SLR). Methodology- The research is based on a systematic review of the literature using the kitchenham method combined with the PRISMA method and focuses on smart tourism destination articles published between 2018 and 2021. Findings- The authors summarize the result, which is the main themes came out with seven clusters; the countries, there are eighteen countries spread over five regions worldwide; the destination category found three categories which are cultural heritage attractions, special events, and museums; the current trends there are top five keywords that become trends based on previous study literature review namely: Smart Tourism Destinations, Tourist Experiences, Tourism Industry, ICT, and DMOs.The originality of the research- The study provides the SLR method to investigate the main themes, the countries, the destination category, and the current trend regarding Smart Tourism research. This finding helps build a complete understanding of smart tourism destination implementation comprehensively.", "venue": "International Conferences on Information Science and System", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference", "Review"], "publicationDate": "2022-08-10", "journal": {"name": "2022 International Conference on ICT for Smart Society (ICISS)", "pages": "1-11"}, "authors": [{"authorId": "1411343884", "name": "Siti Elda Hiererra"}, {"authorId": "2596989", "name": "Meyliana"}, {"authorId": "2148613937", "name": "Arief Ramadhan"}, {"authorId": "2083799367", "name": "F. Purnomo"}], "citations": [{"paperId": "0627397cdfe977031a1402042b69072ead6df86d", "title": "Development of Buffer Zone into Living Lab - Garuda Smart City Framework: Systematic Review"}, {"paperId": "15f5def053e91d62949716c4fd4fe0475ebd3d60", "title": "Proposed Avatar Model for Sustainable Smart Tourism Growth: Systematic Literature Review"}]}
