{"paperId": "7a112817adf5acfe2fbdbb839b9da06fd21f79ce", "publicationVenue": {"id": "187dde4a-2b59-491b-b6cf-1a8618878cdc", "name": "International Conference on Mobile Data Management", "type": "conference", "alternate_names": ["Int Conf Mob Data Manag", "MDM", "Mobile Data Management", "Mob Data Manag"]}, "title": "Building a Large-Scale Microscopic Road Network Traffic Simulator in Apache Spark", "abstract": "Road network traffic data has been widely studied by researchers and practitioners in different areas such as urban planning, traffic prediction, and spatial-temporal databases. For instance, researchers use such data to evaluate the impact of road network changes. Unfortunately, collecting large-scale high-quality urban traffic data requires tremendous efforts because participating vehicles must install GPS receivers and administrators must continuously monitor these devices. There has been a number of urban traffic simulators trying to generate such data with different features. However, they suffer from two critical issues (1) scalability: most of them only offer single-machine solution which is not adequate to produce large-scale data. Some simulators can generate traffic in parallel but do not well balance the load among machines in a cluster. (2) granularity: many simulators do not consider microscopic traffic situations including traffic lights, lane changing, car following. In the paper, we propose GeoSparkSim, a scalable traffic simulator which extends Apache Spark to generate large-scale road network traffic datasets with microscopic traffic simulation. The proposed system seamlessly integrates with a Spark-based spatial data management system, GeoSpark, to deliver a holistic approach that allows data scientists to simulate, analyze and visualize largescale urban traffic data. To implement microscopic traffic models, GeoSparkSim employs a simulation-aware vehicle partitioning method to partition vehicles among different machines such that each machine has a balanced workload. The experimental analysis shows that GeoSparkSim can simulate the movements of 200 thousand vehicles over a very large road network (250 thousand road junctions and 300 thousand road segments).", "venue": "International Conference on Mobile Data Management", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-06-01", "journal": {"name": "2019 20th IEEE International Conference on Mobile Data Management (MDM)", "pages": "320-328"}, "authors": [{"authorId": "151479797", "name": "Zishan Fu"}, {"authorId": "97583810", "name": "Jia Yu"}, {"authorId": "1769421", "name": "Mohamed Sarwat"}], "citations": [{"paperId": "a6ac910543d85026a7114bf91f5c26031acdb852", "title": "Dynamic Straggler Mitigation for Large-Scale Spatial Simulations"}, {"paperId": "ff6fc1f72d1e8294f11d02cd1ceec1b38c6a9585", "title": "Distributed Architecture for Large Scale Simulation to Estimate CO Vehicles Emissions"}, {"paperId": "634b6aa1f7f7296faf0b42cfdcc14f922082780c", "title": "Offline Reinforcement Learning for Road Traffic Control"}, {"paperId": "bee4fd93ca7feadb66b8176d8745864aac2cfcd3", "title": "An efficient parallel indexing structure for multi-dimensional big data using spark"}, {"paperId": "be5aa65e1d959522ffa47b81701d9ef7ac7651e5", "title": "QarSUMO: A Parallel, Congestion-optimized Traffic Simulator"}, {"paperId": "3fc7170956e0a4ed6b66fdc14f932c0ac463e77a", "title": "Masivo: Parallel Simulation Model Based on OpenCL for Massive Public Transportation Systems’ Routes"}, {"paperId": "488d91b8312cbb6a898d8b8d3ecc20efb524ae5f", "title": "Demonstrating GeoSparkSim: A Scalable Microscopic Road Network Traffic Simulator Based on Apache Spark"}, {"paperId": "185529766eeff4cf833aedbc24724c31c5463d56", "title": "Design and Evaluation of a Distributed Architecture for GeoSparkSim"}]}
