{"paperId": "7a27a0b14e37a4b38e4ee0c999ad0caaf3813cf3", "publicationVenue": {"id": "f32b7322-b69c-4e63-801d-8f50784ef778", "name": "Computational Intelligence and Neuroscience", "type": "journal", "alternate_names": ["Comput Intell Neurosci"], "issn": "1687-5265", "url": "https://www.hindawi.com/journals/cin/"}, "title": "Sports Deep Learning Method Based on Cognitive Human Behavior Recognition", "abstract": "An in-depth learning-based approach is designed to develop the ability to recognize human behavior on the move. We introduce 3D residual structures and create 3D residual models. In order to get the most out of the data relationship of several consecutive frames, this study introduces 3D techniques for assigning different values to the existing frames. Experiments show that both structures improve recognition performance. For the 3D residual model, 3D attention model, and 3D attention residual model, this study proposes two model fusion strategies: average and weighted. Among them, the weighted fusion is to give a higher fusion proportion to the high accuracy model by using the model weight calculation method designed in this study. The experimental results show that the additive fusion strategy based on feature contribution has an obvious improvement effect on the test results of the two benchmark datasets, with an increase of more than 2% points, including an increase of 2.69% on HMDB51. The effect of splicing and fusion strategy has also increased by more than 1% point, including 1.34% on UCF101 dataset and about 1.9% on HMDB51. It is proven that deep learning can effectively recognize human behavior in sports.", "venue": "Computational Intelligence and Neuroscience", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-08-12", "journal": {"name": "Computational Intelligence and Neuroscience", "volume": "2022"}, "authors": [{"authorId": "3300934", "name": "Xiwei Liu"}], "citations": [{"paperId": "aa522c1048798f3ff009659c90fa3ea983a02ad2", "title": "Retracted: Sports Deep Learning Method Based on Cognitive Human Behavior Recognition"}, {"paperId": "f7c62629b5c0a459958816aa68d7f41f32b06d45", "title": "Non-contrast CT radiomics and machine learning for outcomes prediction of patients with acute ischemic stroke receiving conventional treatment."}, {"paperId": "0a41f0011e47bc4f2260ee0b6670c7b8f5e1680b", "title": "An IoT-Platform-Based Deep Learning System for Human Behavior Recognition in Smart City Monitoring Using the Berkeley MHAD Datasets"}]}
