{"paperId": "7a35df140d9b0502cad9c789ea41385b677d7b9e", "publicationVenue": {"id": "c3e5f1c8-9ba7-47e5-acde-53063a69d483", "name": "Future Internet", "type": "journal", "issn": "1999-5903", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-156830", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-156830", "https://www.mdpi.com/journal/futureinternet"]}, "title": "Configurable Hardware Core for IoT Object Detection", "abstract": "Object detection is an important task for many applications, like transportation, security, and medical applications. Many of these applications are needed on edge devices to make local decisions. Therefore, it is necessary to provide low-cost, fast solutions for object detection. This work proposes a configurable hardware core on a field-programmable gate array (FPGA) for object detection. The configurability of the core allows its deployment on target devices with diverse hardware resources. The object detection accelerator is based on YOLO, for its good accuracy at moderate computational complexity. The solution was applied to the design of a core to accelerate the Tiny-YOLOv3, based on a CNN developed for constrained environments. However, it can be applied to other YOLO versions. The core was integrated into a full system-on-chip solution and tested with the COCO dataset. It achieved a performance from 7 to 14 FPS in a low-cost ZYNQ7020 FPGA, depending on the quantization, with an accuracy reduction from 2.1 to 1.4 points of mAP50.", "venue": "Future Internet", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-10-30", "journal": {"name": "Future Internet", "pages": "280", "volume": "13"}, "authors": [{"authorId": "2105727358", "name": "Pedro R. Miranda"}, {"authorId": "2105728590", "name": "Daniel Pestana"}, {"authorId": "152631140", "name": "J. Lopes"}, {"authorId": "2201912", "name": "R. Duarte"}, {"authorId": "2186431", "name": "M. Véstias"}, {"authorId": "144269211", "name": "H. Neto"}, {"authorId": "145035060", "name": "J. Sousa"}], "citations": [{"paperId": "b37e39d5b8c1099c9152481ad7410ee4b2943d05", "title": "Fast and Scalable Multicore YOLOv3-Tiny Accelerator Using Input Stationary Systolic Architecture"}, {"paperId": "79e768058ad9a7205ab654cd48501a31d363e836", "title": "Dedicated FPGA Implementation of the Gaussian TinyYOLOv3 Accelerator"}, {"paperId": "372cbe23ca67b01221fcb8bb0b045d8dbc993737", "title": "LPYOLO: Low Precision YOLO for Face Detection on FPGA"}, {"paperId": "e8cc810c437b6f44c34f91e1b5cb8dc0c2850895", "title": "License Plate Recognition System Based on Improved YOLOv5 and GRU"}]}
