{"paperId": "7a81369d06b9c2bcbed102f61146793631eed547", "publicationVenue": {"id": "c3e5f1c8-9ba7-47e5-acde-53063a69d483", "name": "Future Internet", "type": "journal", "issn": "1999-5903", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-156830", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-156830", "https://www.mdpi.com/journal/futureinternet"]}, "title": "A New AI-Based Semantic Cyber Intelligence Agent", "abstract": "The surge in cybercrime has emerged as a pressing concern in contemporary society due to its far-reaching financial, social, and psychological repercussions on individuals. Beyond inflicting monetary losses, cyber-attacks exert adverse effects on the social fabric and psychological well-being of the affected individuals. In order to mitigate the deleterious consequences of cyber threats, adoption of an intelligent agent-based solution to enhance the speed and comprehensiveness of cyber intelligence is advocated. In this paper, a novel cyber intelligence solution is proposed, employing four semantic agents that interact autonomously to acquire crucial cyber intelligence pertaining to any given country. The solution leverages a combination of techniques, including a convolutional neural network (CNN), sentiment analysis, exponential smoothing, latent Dirichlet allocation (LDA), term frequency-inverse document frequency (TF-IDF), Porter stemming, and others, to analyse data from both social media and web sources. The proposed method underwent evaluation from 13 October 2022 to 6 April 2023, utilizing a dataset comprising 37,386 tweets generated by 30,706 users across 54 languages. To address non-English content, a total of 8199 HTTP requests were made to facilitate translation. Additionally, the system processed 238,220 cyber threat data from the web. Within a remarkably brief duration of 6 s, the system autonomously generated a comprehensive cyber intelligence report encompassing 7 critical dimensions of cyber intelligence for countries such as Russia, Ukraine, China, Iran, India, and Australia.", "venue": "Future Internet", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-29", "journal": {"name": "Future Internet", "pages": "231", "volume": "15"}, "authors": [{"authorId": "49907610", "name": "F. Sufi"}], "citations": [{"paperId": "24cc8bf3834e6f9fb4a3da6fd30d30ae41398598", "title": "A New Time Series Dataset for Cyber-Threat Correlation, Regression and Neural-Network-Based Forecasting"}, {"paperId": "f60e5735e7c9277ca21d44202c13849da9a9437a", "title": "A Novel Authentication Scheme Based on Verifiable Credentials Using Digital Identity in the Context of Web 3.0"}, {"paperId": "3e4e538e32013a3a7975eec3686cdea5188a064a", "title": "Open-Source Cyber Intelligence Research Through PESTEL Framework: Present and Future Impact"}, {"paperId": "3139e0c7002df948519a66b5a57a43fab9e013b9", "title": "Artificial intelligence in cybersecurity: Protecting national infrastructure: A USA review"}, {"paperId": "7f66c8de8df165730cea7a316f7f562bd0f3bfc8", "title": "A global cyber-threat intelligence system with artificial intelligence and convolutional neural network"}, {"paperId": "9129496324fc286feb3503946021c424836203ed", "title": "A New Social Media Analytics Method for Identifying Factors Contributing to COVID-19 Discussion Topics"}, {"paperId": "6923d139855c70f70c68186d900fc6db0cc73aaa", "title": "Social Media Analytics on Russia-Ukraine Cyber War with Natural Language Processing: Perspectives and Challenges"}, {"paperId": "cb74216039e142d7d39e37ce520a92c22c08e258", "title": "Novel Application of Open-Source Cyber Intelligence"}]}
