{"paperId": "7a84f7bf4e53b1e9ebe357d7c296d03b6a4f209e", "publicationVenue": null, "title": "Behavior Driven Development: Tools and Challenges", "abstract": "Nowadays testing usually applies Test Driven Development (TDD) which is an approach to software development in which developers write tests first which initially fail and by adding more application codes tests pass. However, the latest development in this field is an extension to Test Driven Development (TDD) which usually referred as Behavior Driven Development (BDD). As being a modified version of TDD, both the technologies have various similarities. Nevertheless, the differences are also not unnoticeable. Where BDD is more about communication and collaboration TDD is more about coders and coding. This paper focuses on the advantages and glitches of TDD which led to the development of along with the method of working of BDD and several tools along with their features and a comparison of their functionalities.", "venue": "2018 International Conference on Advances in Computing, Communication Control and Networking (ICACCCN)", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2018-10-01", "journal": {"name": "2018 International Conference on Advances in Computing, Communication Control and Networking (ICACCCN)", "pages": "1032-1037"}, "authors": [{"authorId": "3399971", "name": "R. K. Lenka"}, {"authorId": "38503959", "name": "Srikant Kumar"}, {"authorId": "107732006", "name": "Sunakshi Mamgain"}], "citations": [{"paperId": "75f73119ba86d24250d02a5050063d98108ae390", "title": "The role of informal communication in building shared understanding of non-functional requirements in remote continuous software engineering"}, {"paperId": "1139a258454315a7f5a86010ae2cb27ea16645e4", "title": "An Investigation Into the Efficacy of RANOREX Software Test Automation Tool"}, {"paperId": "7f1314331207f42283917428821ff4fecdee5055", "title": "Behaviour Driven Development: A Systematic Mapping Study"}, {"paperId": "b3191888801960c3b8178626902bb2468318bfe7", "title": "ViMoTest: a low code approach to specify ViewModel-based tests with a projectional DSL using JetBrains MPS"}, {"paperId": "4aa3053a0a439ba223cf0a5e17adc1a1b76216bd", "title": "Software Practices For Agile Developers: A Systematic Literature Review"}, {"paperId": "08080ae56ffb6b48b37c20285b0bd181f7255596", "title": "A Case Study of Building Shared Understanding of Non-Functional Requirements in a Remote Software Organization"}, {"paperId": "ad1362208ced659c14be06fd7fe86451b972aaec", "title": "Behavior-Driven Development of Microservice Applications"}, {"paperId": "2a0f8a2bada28b388afef69f2e243ce8c52ecc76", "title": "Behavior Driven Development: Best Practices for Software Quality"}, {"paperId": "fef15bfeb078ef83cbc624c0f6ba3b0bc7802fea", "title": "Continuous Security Testing: A Case Study on Integrating Dynamic Security Testing Tools in CI/CD Pipelines"}, {"paperId": "029445b1e223debbf3384ea8521f80b1c590c373", "title": "Moldable scenario builder Master Thesis"}]}
