{"paperId": "7aad13541f38a8adf4d2b4bc466089bacc973133", "publicationVenue": {"id": "f32b7322-b69c-4e63-801d-8f50784ef778", "name": "Computational Intelligence and Neuroscience", "type": "journal", "alternate_names": ["Comput Intell Neurosci"], "issn": "1687-5265", "url": "https://www.hindawi.com/journals/cin/"}, "title": "Applying Lightweight Deep Learning-Based Virtual Vision Sensing Technology to Realize and Develop New Media Interactive Art Installation", "abstract": "The work intends to optimize the situation that interactive art devices and remote control based on traditional technology cannot meet people's actual needs to a certain extent. With the assistance of Lightweight Deep Learning (LDL) models, Interactive Artistic Installation (IAI) shows excellent creative potential in terms of dimension, space, and sense. Virtual Vision Sensing Technology (VST) explores the emotional semantics in the human-machine environment with the help of interactive art, finds the emotional interaction elements between human and machine, and promotes Human-Computer Interaction (HCI). From the perspective of the media elements of interactive art, this paper reviews the virtual VST that subverts the expression of interactive art. Then, from the perspective of artistic creation, the impact of virtual VST on IAI thinking, methods, and artistic experience is analyzed. Thereupon, a scene construction method is designed where the physical equipment is premodeled. The model is loaded in real time with visual information. The proposed method does not require complex vision and laser scanning equipment or high-configured computer systems. The proposed new media IAI model realizes the real-time loading of the scene model. According to the physical equipment dynamic information obtained by the visual data acquisition system, the proposed method can keep the virtual scene and physical models in motion synchronization. Finally, experiment results corroborate that the environment will significantly interfere with the experimental results. The training data set with boundary occlusion will be more suitable for model training and better test results (about 97% accuracy). Hence, the research content can make the Virtual Reality works have better performance, especially the sense of experience from the perspective of aesthetics. Meanwhile, it also enriches the research theory in the field of new media art installation technology.", "venue": "Computational Intelligence and Neuroscience", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-07-11", "journal": {"name": "Computational Intelligence and Neuroscience", "volume": "2022"}, "authors": [{"authorId": "92059872", "name": "Lanjun Luo"}], "citations": [{"paperId": "86936bf4433c406964fce30b932a8c2a65ff4075", "title": "Designing and Developing Android-based E-Book as a Guide for Students in Making Smart-Key: A Learning Media for Electronic Circuits Course"}, {"paperId": "f914421881b9e59bf2e73055f06d5e7cacf2c6ee", "title": "Retracted: Applying Lightweight Deep Learning-Based Virtual Vision Sensing Technology to Realize and Develop New Media Interactive Art Installation"}, {"paperId": "9deeec40cf96dea4f6928f128ca0c1643120d0d5", "title": "Machine Learning-Enabled Internet of Things (IoT): Data, Applications, and Industry Perspective"}]}
