{"paperId": "7ab161895d05cbdab1c33303a5bbd96218049114", "publicationVenue": {"id": "74f47cf8-2839-4a56-959a-524dd0ed9e3e", "name": "International Conference on Extending Database Technology", "type": "conference", "alternate_names": ["Int Conf Extending Database Technol", "Extending Database Technology", "Extending Database Technol", "EDBT"], "url": "http://www.edbt.org/"}, "title": "Revisiting Runtime Dynamic Optimization for Join Queries in Big Data Management Systems", "abstract": "Effective query optimization remains an open problem for Big Data Management Systems. In this work, we revisit an old idea, runtime dynamic optimization, and adapt it to a big data management system, AsterixDB. The approach runs in stages (re-optimization points), starting by first executing all predicates local to a single dataset. The intermediate result created by a stage is then used to re-optimize the remaining query. This re-optimization approach avoids inaccurate intermediate result cardinality estimates, thus leading to much better execution plans. While it introduces overhead for materializing intermediate results, experiments show that this overhead is relatively small and is an acceptable price to pay given the optimization benefits.", "venue": "International Conference on Extending Database Technology", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-10-01", "journal": {"name": "ACM SIGMOD Record", "pages": "104 - 113", "volume": "52"}, "authors": [{"authorId": "2189698", "name": "C. Pavlopoulou"}, {"authorId": "1703347", "name": "M. Carey"}, {"authorId": "1761528", "name": "V. Tsotras"}], "citations": [{"paperId": "0476c0e43cfb8f53eef717c1b74b18bdb9fa834b", "title": "Structured query language query join optimization by using rademacher averages and mapreduce algorithms"}, {"paperId": "e18993cef2182001738272463c7aef7a3717ecf8", "title": "UltraLogLog: A Practical and More Space-Efficient Alternative to HyperLogLog for Approximate Distinct Counting"}]}
