{"paperId": "7ab4d13b072b4025158f65868243bc2c2336b8fc", "publicationVenue": {"id": "983fd916-c977-4314-840b-3fdd258647fe", "name": "International Journal of Energy Research", "type": "journal", "alternate_names": ["Int J Energy Res"], "issn": "0363-907X", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/3343", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/1099114X", "http://interscience.wiley.com/jpages/0363-907X", "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1099-114X"]}, "title": "Smart and intelligent energy monitoring systems: A comprehensive literature survey and future research guidelines", "abstract": "Computationally intelligent energy forecasting methods for appropriate energy management at the consumer/producer side have a positive impact on the preservation of energy and play a constructive role in tackling global climate change. The energy production and consumption are very high worldwide, demanding intelligent methods with real‐world implementation potentials for appropriate energy management. In this paper, we survey the existing intelligent load forecasting (ILF) systems, highlight their advantages and downsides, and briefly discuss the workflow of the employed literature. Furthermore, we debate on the existing load forecasting datasets and their features along with a brief overview of the challenges confronted by researchers using these datasets. Distinct from previous survey papers, we provide a detailed review of performance evaluation metrics and comparison of employed methods for energy load forecasting, thereby concluding the need of efficient, effective, and adoptable ILF methods functional in real‐world scenarios. Finally, we assess the employed techniques and deliver future research opportunities based on the derived conclusions from existing research works. This paper delivers the overall energy forecasting literature in a compact form with possible future insights for researchers working in ILF domain.", "venue": "International Journal of Energy Research", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2021-01-06", "journal": {"name": "International Journal of Energy Research", "pages": "3590 - 3614", "volume": "45"}, "authors": [{"authorId": "144591441", "name": "Tanveer Hussain"}, {"authorId": "66624503", "name": "F. Ullah"}, {"authorId": "143997136", "name": "Khan Muhammad"}, {"authorId": "143929828", "name": "Seungmin Rho"}, {"authorId": "46329495", "name": "Amin Ullah"}, {"authorId": "144965014", "name": "Eenjun Hwang"}, {"authorId": "9770584", "name": "Jihoon Moon"}, {"authorId": "1777998", "name": "S. Baik"}], "citations": [{"paperId": "8ad40ec0cb10ff0c07e7f38b744bf23a0163242d", "title": "DSPM: Dual sequence prediction model for efficient energy management in micro-grid"}, {"paperId": "e7f9a0ef16e3c861e355d267f92caef8d4805bc4", "title": "Enhancing Short-Term Electrical Load Forecasting for Sustainable Energy Management in Low-Carbon Buildings"}, {"paperId": "dd105ecf43d7511d691c37a1dc8d6b23a3f0a6ed", "title": "Low-Frequency Load Identification using CNN-BiLSTM Attention Mechanism"}, {"paperId": "b4ea9e07564c9f38b85cc0d035478bd8abd3cf03", "title": "Smart energy sustainability hub in light of Industry 4.0"}, {"paperId": "b0cd2ef7d0fa0e0c920788dc59d0bb126a8314cc", "title": "A Cyber-Physical monitoring and diagnosis scheme of energy consumption in Plant-Wide chemical processes"}, {"paperId": "1bf8ca6d25af8191675fb36d8bc9124e112c916d", "title": "An Electrical Efficiency Audit on a Paper Factory with a Focus on Energy Monitoring Systems and Industrial Motors"}, {"paperId": "733c8af62b910f581a6c0f14631bb05ae4ed69dd", "title": "An electricity load forecasting model based on multilayer dilated LSTM network and attention mechanism"}, {"paperId": "1cb915b9c8a686dc5620b593297568a352005277", "title": "Solar Power Prediction Using Dual Stream CNN-LSTM Architecture"}, {"paperId": "8a4e3fb32c8437a6d752fd657098c1d519d03dd9", "title": "Toward explainable electrical load forecasting of buildings: A comparative study of tree-based ensemble methods with Shapley values"}, {"paperId": "93503ddd9ee226e65881f16285115e04903bafb2", "title": "DSRD-Net: Dual-stream residual dense network for semantic segmentation of instruments in robot-assisted surgery"}, {"paperId": "42b0789cadbf7af3f7b00db266afd321ee418a93", "title": "Deep Learning-Assisted Short-Term Power Load Forecasting Using Deep Convolutional LSTM and Stacked GRU"}, {"paperId": "d4581fa4ad035e1e41ae5ee1145fc90f664ddf0b", "title": "User Behavior Analytics with Machine Learning for Household Electricity Demand Forecasting"}, {"paperId": "1cf81abcbdbdc8727f137c3dd2922079035c9f48", "title": "A CNN-Assisted deep echo state network using multiple Time-Scale dynamic learning reservoirs for generating Short-Term solar energy forecasting"}, {"paperId": "7537630cd56b7b9953be092140cd68da51b699e2", "title": "Critical success factors for the implementation and management of energy cloud environments"}, {"paperId": "27611c0532e73c37a3e2857da45ad8cc731660b7", "title": "Generation of Sub-item Load Profiles for Public Buildings Based on the Conditional Generative Adversarial Network and Moving Average Method"}, {"paperId": "fdce77728bce9c25e1a45c50172ff49a32915f79", "title": "STLF-Net: Two-stream deep network for short-term load forecasting in residential buildings"}, {"paperId": "09f7ef63c3d63311d7cdd142ebce78c36d453d72", "title": "Analysis and feasibility of integrating a new and novel hybrid solar chimney power plant with a traditional electrical grid"}, {"paperId": "c61e077cf62c89ad9f08667c467da958a40dbbf7", "title": "Interpretable Short-Term Electrical Load Forecasting Scheme Using Cubist"}, {"paperId": "2403abc5e60d1129417067996b01e273e33faee8", "title": "Development of smart energy systems for communities: Technologies, policies and applications"}, {"paperId": "dc7f4f1dbbb2c921e082d2d70b158897879f50fb", "title": "Verification of De-Identification Techniques for Personal Information Using Tree-Based Methods with Shapley Values"}, {"paperId": "5f5b830839a2582fd42e9871b47093075893d250", "title": "Boosting energy harvesting via deep learning-based renewable power generation prediction"}, {"paperId": "c833aca815fde1a83d0959db197cf2ab0b888d46", "title": "Regularization methods for the short-term forecasting of the Italian electric load"}, {"paperId": "53a59cec7380011a68e0c6094ccde336549ea7e8", "title": "Robust building energy consumption forecasting using an online learning approach with R ranger"}, {"paperId": "5e99982216329f01c8f8139b0df25045de60611f", "title": "Atrous Convolutions and Residual GRU Based Architecture for Matching Power Demand with Supply"}, {"paperId": "f8136a24cc5d8c9affd24c7604b8d284ab1d6ba4", "title": "Diving Deep into Short-Term Electricity Load Forecasting: Comparative Analysis and a Novel Framework"}, {"paperId": "ae088621acb04a5ab0501fe38531d280dbc0a841", "title": "Sequential Learning-Based Energy Consumption Prediction Model for Residential and Commercial Sectors"}, {"paperId": "32df205bbf5c5ed974bd650f0a0bba83900a18f0", "title": "Efficient Short-Term Electricity Load Forecasting for Effective Energy Management"}, {"paperId": "2b6de94625bf41efae921401d2b7d8bc7d479638", "title": "Impact of Input Data Structure on Convolutional Neural Network Energy Prediction Model"}, {"paperId": "b551e150cd85ba4b87f8f10421dcaf1fdedeaf7c", "title": "Transformgraph: A Novel Short-Term Electricity Net Load Forecasting Model"}]}
