{"paperId": "7aba47e7dbebf1afe9c0eea18d8f8ac3d331641d", "publicationVenue": {"id": "a2802f40-c210-444a-92bf-62245b599bb1", "name": "EDBT/ICDT Workshops", "type": "conference", "alternate_names": ["EDBT-ICDT", "EDBT/ICDT Work"]}, "title": "Exploration of Interesting Dense Regions on Spatial Data", "abstract": "Nowadays, spatial data are ubiquitous in various fields of science, such as transportation and the social Web. A recent research direction in analyzing spatial data is to provide means for \"exploratory analysis\" of such data where analysts are guided towards interesting options in consecutive analysis iterations. Typically, the guidance component learns analyst's preferences using her explicit feedback, e.g., picking a spatial point or selecting a region of interest. However, it is often the case that analysts forget or don't feel necessary to explicitly express their feedback in what they find interesting. Our approach captures implicit feedback on spatial data. The approach consists of observing mouse moves (as a means of analyst's interaction) and also the explicit analyst's interaction with data points in order to discover interesting spatial regions with dense mouse hovers. In this paper, we define, formalize and explore Interesting Dense Regions (IDRs) which capture preferences of analysts, in order to automatically find interesting spatial highlights. Our approach involves a polygon-based abstraction layer for capturing preferences. Using these IDRs, we highlight points to guide analysts in the analysis process. We discuss the efficiency and effectiveness of our approach through realistic examples and experiments on Airbnb and Yelp datasets.", "venue": "EDBT/ICDT Workshops", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-03-10", "journal": {"name": "ArXiv", "volume": "abs/1903.04049"}, "authors": [{"authorId": "1784040", "name": "P. A. S. Neto"}, {"authorId": "1410289337", "name": "Francisco B. Silva Júnior"}, {"authorId": "1410287455", "name": "Felipe M. Freire Pontes"}, {"authorId": "1403851743", "name": "Behrooz Omidvar-Tehrani"}], "citations": [{"paperId": "f5c5614118de96e569cc22ca1920b1f5db87427e", "title": "Interactive Region-of-Interest Discovery using Exploratory Feedback"}, {"paperId": "9a73ee25f6ce2c816dfbbc0a4478ab0be56369c0", "title": "Designing Ambient Wanderer: Mobile Recommendations for Urban Exploration"}]}
