{"paperId": "7ac62003a2255bd2840637d357750de8d1bb5868", "publicationVenue": {"id": "0a05a451-a2de-4e8e-bade-704b9857926a", "name": "Distributed Event-Based Systems", "type": "conference", "alternate_names": ["DEBS", "Distrib Event-based Syst"], "url": "https://en.wikipedia.org/wiki/Distributed_Event-Based_Systems"}, "title": "Fast recovery of correlated failures in distributed stream processing engines", "abstract": "In a large-scale cluster, correlated failures usually involve a number of nodes failing simultaneously. Although correlated failures occur infrequently, they have significant effect on systems' availability, especially for streaming applications that require real-time analysis, as repairing the failed nodes or acquiring additional ones would take a significant amount of time. Most state-of-the-art distributed stream processing systems (DSPSs) focus on recovering individual failures and do not consider the optimization for recovering correlated failure. In this work, we propose an incremental and query-centric recovery paradigm where the recovery of failed operator partitions would be carefully scheduled based on the current availability of resources, such that the outputs of queries can be recovered as early as possible. By analyzing the existing recovery techniques, we identify the challenges and propose a fault-tolerance framework that can support incremental recovery with minimum overhead during the system's normal execution. We also formulate the new problem of recovery scheduling under correlated failures and design algorithms to optimize the recovery latency with a performance guarantee. A comprehensive set of experiments are conducted to study the validity of our proposal.", "venue": "Distributed Event-Based Systems", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2021-06-28", "journal": {"name": "Proceedings of the 15th ACM International Conference on Distributed and Event-based Systems"}, "authors": [{"authorId": "2069857320", "name": "Li Su"}, {"authorId": "2145492298", "name": "Yongluan Zhou"}], "citations": [{"paperId": "cb480a06cbc9c50f2041890c8491b5c1604b9a3d", "title": "An exploratory analysis of methods for real-time data deduplication in streaming processes"}, {"paperId": "f13822098a392676416a934cb940f13b0d52a1fb", "title": "Region-based Sub-Snapshot (RegSnap): Enhanced Fault Tolerance in Distributed Stream Processing with Partial Snapshot"}]}
