{"paperId": "7acaca6e5b632c95978594002bde7ea0b79da0cf", "publicationVenue": {"id": "aa746a02-d187-42c2-bdf9-df6a5d4e648c", "name": "Computer/law journal", "type": "journal", "alternate_names": ["Computer journal", "The Computer Journal", "Comput j", "Comput J"], "issn": "0164-8756", "alternate_issns": ["0010-4620"], "url": "https://repository.jmls.edu/jitpl/all_issues.html", "alternate_urls": ["http://comjnl.oxfordjournals.org/"]}, "title": "Cost- and Time-Based Data Deployment for Improving Scheduling Efficiency in Distributed Clouds", "abstract": "In recent years, with the continuous development of internet of things and cloud computing technologies, data intensive applications have gotten more and more attention. In the distributed cloud environment, the access of massive data is often the bottleneck of its performance. It is very significant to propose a suitable data deployment algorithm for improving the utilization of cloud server and the efficiency of task scheduling. In order to reduce data access cost and data deployment time, an optimal data deployment algorithm is proposed in this paper. By modeling and analyzing the data deployment problem, the problem is solved by using the improved genetic algorithm. After the data are well deployed, aiming at improving the efficiency of task scheduling, a task progress aware scheduling algorithm is proposed in this paper in order to make the speculative execution mechanism more accurate. Firstly, the threshold to detect the slow tasks and fast nodes are set. Then, the slow tasks and fast nodes are detected by calculating the remaining time of the tasks and the real-time processing ability of the nodes, respectively. Finally, the backup execution of the slow tasks is performed on the fast nodes. While satisfying the load balancing of the system, the experimental results show that the proposed algorithms can obviously reduce data access cost, service-level agreement (SLA) default rate and the execution time of the system and optimize data deployment for improving scheduling efficiency in distributed clouds.", "venue": "Computer/law journal", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-09-29", "journal": {"name": "Comput. J.", "pages": "874-889", "volume": "65"}, "authors": [{"authorId": "50599276", "name": "Chunlin Li"}, {"authorId": "2108058454", "name": "Yihan Zhang"}, {"authorId": "2052432369", "name": "Xiao Qu"}, {"authorId": "2309971", "name": "Youlong Luo"}], "citations": [{"paperId": "94c5da68ffb0cc5e289381ae66a198ef25bafed2", "title": "A task scheduling algorithm with deadline constraints for distributed clouds in smart cities"}, {"paperId": "ab1f8c4a5c05b26159ac7a9a63f7ea32ff81232e", "title": "Improving MapReduce heterogeneous performance using KNN fair share scheduling"}]}
