{"paperId": "7ae4bb7a7bca9d0eed7c16c56822c35acc4191ef", "publicationVenue": {"id": "c3c7b8e2-15d3-4389-b416-7f670cb2f30e", "name": "International Conference on Sustainable Information Engineering and Technology", "type": "conference", "alternate_names": ["SIET", "Int Conf Sustain Inf Eng Technol"]}, "title": "Prototype of multi-layer personal cardiac monitoring system for data interoperability problem", "abstract": "Personal monitoring of heart conditions offers an advantage as a prevention mechanism for cardiovascular disease. This system can be developed using a wearable sensor device along with IoT approach. However, the data interoperability problem often arises in attempt to develop an IoT-based system. Data interoperability comes from different data formats to save the data that are produced by health sensor devices. The current solution can be either cloud or edge-based middleware which both have their own merits and drawbacks. This study offers multi-layer monitoring heart conditions that combines cloud and edge-based middleware to solve data interoperability. The middleware on the edge layer performs data normalization using the JSON format and Restful API standard to transfer data to communicate with an IoT application. On the other hand, at the cloud side, it provides heterogeneous data storage with the ability to store various health data formats.", "venue": "International Conference on Sustainable Information Engineering and Technology", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2020-11-16", "journal": {"name": "Proceedings of the 5th International Conference on Sustainable Information Engineering and Technology"}, "authors": [{"authorId": "9744636", "name": "Eko Sakti Pramukantoro"}, {"authorId": "145441278", "name": "A. Gofuku"}], "citations": [{"paperId": "3592398e145c58b130d02db4ff454d2c3c8a22e3", "title": "Heterogeneous data format integration and conversion (HDFIC) using machine learning and IBM-DFDL for IoT"}, {"paperId": "e02ad52e09dc676b0d430b2e116f2498868e7b73", "title": "ECG Standards and Formats for Interoperability between mHealth and Healthcare Information Systems: A Scoping Review"}]}
