{"paperId": "7ae69600423c41b1df3b1aff3b60bd783e3cb0ed", "publicationVenue": {"id": "6175efe8-6f8e-4cbe-8cee-d154f4e78627", "name": "Mathematics", "issn": "2227-7390", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-283014", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-283014", "https://www.mdpi.com/journal/mathematics"]}, "title": "Evaluation of Clustering Algorithms on HPC Platforms", "abstract": "Clustering algorithms are one of the most widely used kernels to generate knowledge from large datasets. These algorithms group a set of data elements (i.e., images, points, patterns, etc.) into clusters to identify patterns or common features of a sample. However, these algorithms are very computationally expensive as they often involve the computation of expensive fitness functions that must be evaluated for all points in the dataset. This computational cost is even higher for fuzzy methods, where each data point may belong to more than one cluster. In this paper, we evaluate different parallelisation strategies on different heterogeneous platforms for fuzzy clustering algorithms typically used in the state-of-the-art such as the Fuzzy C-means (FCM), the Gustafson–Kessel FCM (GK-FCM) and the Fuzzy Minimals (FM). The experimental evaluation includes performance and energy trade-offs. Our results show that depending on the computational pattern of each algorithm, their mathematical foundation and the amount of data to be processed, each algorithm performs better on a different platform.", "venue": "Mathematics", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-09-04", "journal": {"name": "Mathematics"}, "authors": [{"authorId": "145150420", "name": "J. M. Cebrian"}, {"authorId": "2286604", "name": "Baldomero Imbernón"}, {"authorId": "145042947", "name": "Jesús A. Soto"}, {"authorId": "145731614", "name": "J. Cecilia"}], "citations": [{"paperId": "38a4a26976a86935e695f81bd97cdd4ab4a9ab4c", "title": "POFCM: A Parallel Fuzzy Clustering Algorithm for Large Datasets"}, {"paperId": "1d1d7d6bba6074db3820ed7a8692eddb43055097", "title": "Performance Analysis of Distributed GPU-Accelerated Task-Based Workflows"}]}
