{"paperId": "7af3f3d5d4c3c7ac0caf41b43302f412352c85d3", "publicationVenue": {"id": "6ac6be0f-c9a2-4eb8-b98e-4f2456955f94", "name": "Security and Privacy", "alternate_names": ["Secur Priv"], "issn": "2475-6725", "url": "https://onlinelibrary.wiley.com/journal/24756725"}, "title": "Review of security issues in Internet of Things and artificial intelligence‐driven solutions", "abstract": "Internet of Things (IoT) is a network of several hardware and software systems which is broadly based upon internet services and several state‐of‐the‐art sensing and communication technologies. The emergence of 5G technology will witness a further surge in the growth of IoT across the world but simultaneously security concerns pertinent to the IoT technology also need rigorous evaluations. This article will present a thorough survey of the security challenges in an IoT network, recent cases of attacks on IoT technology, communication protocols prevalent in IoT systems and the role of artificial intelligence (AI) in IoT security. For the first time, all the major attributes related to IoT security along with potential solutions using AI are reviewed and articulated together. This work would act as a useful resource for understanding useful perspectives in future research focused around the development of more secured IoT communication protocols as well as AI tools for handling privacy and security in IoT.", "venue": "Security and Privacy", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-11-09", "journal": {"name": "Security and Privacy", "volume": "6"}, "authors": [{"authorId": "2063967586", "name": "Ali K. Abed"}, {"authorId": "51953808", "name": "Angesh Anupam"}], "citations": [{"paperId": "656fda44ce351d4639c77db06f46b491df21e0c3", "title": "Application of Chaotic Systems Reduced-Order Observer Synchronization Based on DNA Strand Displacement in Information Encryption of IoT"}, {"paperId": "b83853a125b7a4995df99e23ca87a2236b7820d1", "title": "A Forensic Framework to Improve Digital Image Evidence Administration in IIoT"}, {"paperId": "df1050add6a5204c4ad353280328a9fdf1a8d46a", "title": "Systematic Approach to Analyze The Avast IOT-23 Challenge Dataset For Malware Detection Using Machine Learning"}, {"paperId": "45207acf2a4c649f324d3ed4bf6908022b0f7a1a", "title": "Internet of Things Security: A Review on Challenges, Solutions and Research Directions"}, {"paperId": "1de87a342ac409c16cf7731c3468d6e9d0f938e5", "title": "Perceived Online Tax Compliance Measures on Tax Compliance among Online Traders in Kenya"}, {"paperId": "6586d59186830d62ff7bbad4e2691ec58e8b6b09", "title": "Integration of the Internet of Things and Cloud: Security Challenges and Solutions - A Review"}, {"paperId": "8c7424e13b5668dfb995c044a1e2506bf14f75e6", "title": "Building Trust in Fintech: An Analysis of Ethical and Privacy Considerations in the Intersection of Big Data, AI, and Customer Trust"}, {"paperId": "842cdfa1cff372145dd9309c7957ee2dac1585d1", "title": "IoT-based child tracking using RFID and GPS"}, {"paperId": "3c5873281f5d3d869b4b9d7fc15588ce8b7e779d", "title": "Securing the Internet of Things in Artificial Intelligence Era: A Comprehensive Survey"}]}
