{"paperId": "7b01a6e9af93544be4db8f0e4104c9afe4f49279", "publicationVenue": {"id": "e574da12-4e4c-4b78-a203-ae3719c0c4f7", "name": "Annual International Computer Software and Applications Conference", "type": "conference", "alternate_names": ["Comput Softw Appl Conf", "Annu Int Comput Softw Appl Conf", "COMPSAC Work", "Computer Software and Applications Conference", "COMPSAC Workshops", "COMPSAC"], "url": "http://www.wikicfp.com/cfp/program?id=548"}, "title": "A Dynamic Resource Allocation Framework for Apache Spark Applications", "abstract": "In this paper we design and implement a middleware service for dynamically allocating computing resources for Apache Spark applications on cloud platforms, and consider two different approaches to allocate resources. In the first approach, based on limited execution data of an application, we estimate the amount of resource adjustment (i.e., Delta) for each application separately a priori which is static during the execution of that particular application (i.e., Approach - I). In the second approach, we adjust the value of Delta dynamically during runtime based on execution pattern in real-time (i.e., Approach - II). Our evaluation using six different Apache Spark applications on both physical and virtual clusters demonstrates that our approaches can improve application performance while reducing resource requirements significantly in most cases compared to static resource allocation strategies.", "venue": "Annual International Computer Software and Applications Conference", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-07-01", "journal": {"name": "2020 IEEE 44th Annual Computers, Software, and Applications Conference (COMPSAC)", "pages": "997-1004"}, "authors": [{"authorId": "2145043561", "name": "Kewen Wang"}, {"authorId": "2209601", "name": "Mohammad Maifi Hasan Khan"}, {"authorId": "145769297", "name": "Nhan Nguyen"}], "citations": [{"paperId": "2f4445f19564770e5aa8426248b9c13e58ea244c", "title": "Optimization for resource management in heterogeneous spark clusters"}, {"paperId": "132b3c21e6c33497e02157a2008332bf096f750c", "title": "Twister2 Cross‐platform resource scheduler for big data"}, {"paperId": "43d03b55dbc4534e8262e244d22fa02d962f544d", "title": "DISTRIBUTED COMPUTATION SCHEDULING FOR DECENTRALIZED SYSTEMS AND WEB"}]}
