{"paperId": "7b083c936f1af18dab27d47198ee3dcdc16feb86", "publicationVenue": {"id": "228761ec-c40a-479b-8309-9dcbe9851bcd", "name": "IEEE Internet of Things Journal", "type": "journal", "alternate_names": ["IEEE Internet Thing J"], "issn": "2327-4662", "url": "https://www.ieee.org/membership-catalog/productdetail/showProductDetailPage.html?product=PER288-ELE", "alternate_urls": ["https://ieeexplore.ieee.org/servlet/opac?punumber=6488907", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6488907", "http://ieee-iotj.org/#"]}, "title": "Tornado: Enabling Blockchain in Heterogeneous Internet of Things Through a Space-Structured Approach", "abstract": "With the widespread applications of the Internet of Things (IoT), e.g., smart city, business, healthcare, etc., the security of data and devices becomes a major concern. Although blockchain can effectively enhance the network security and achieve fault tolerance, the huge resource consumption and limited performance of data processing restrict its deployments in IoT scenarios. Observing the heterogeneity and resource constraints, we intend to make blockchain accommodate both wimpy and brawny IoT devices. In this article, we present <inline-formula> <tex-math notation=\"LaTeX\">${\\textsf {Tornado}}$ </tex-math></inline-formula>, a high-performance blockchain system based on space-structured ledger and corresponding algorithms, to enable blockchain in IoT. Specifically, we first design a space-structured chain architecture with novel data structures for promoting the network scalability. To address the huge heterogeneity of IoT, a novel consensus mechanism named collaborative-proof of work is developed. Moreover, we propose the space-structured greedy heaviest-observed subtree (S<sup>2</sup>GHOST) protocol for improving the resource efficiency of IoT devices. Additionally, a dynamic weight assignment mechanism in S<sup>2</sup>GHOST contributes to reflect the trustworthiness of data and devices. Extensive experiments demonstrate that <inline-formula> <tex-math notation=\"LaTeX\">${\\textsf {Tornado}}$ </tex-math></inline-formula> can achieve a maximum throughput of 3464.76 transactions per second. The optimizations of propagation latency and resource efficiency are 68.14% and 30.56%, respectively.", "venue": "IEEE Internet of Things Journal", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-02-01", "journal": {"name": "IEEE Internet of Things Journal", "pages": "1273-1286", "volume": "7"}, "authors": [{"authorId": "1604963638", "name": "Yinqiu Liu"}, {"authorId": "144547968", "name": "Kun Wang"}, {"authorId": "2053225439", "name": "Kai Qian"}, {"authorId": "50593492", "name": "Miao Du"}, {"authorId": "144123438", "name": "Song Guo"}], "citations": [{"paperId": "121b11ce09c7e2b74970a4ae0960eddbdf944331", "title": "HPCchain: A Consortium Blockchain System Based on CPU-FPGA Hybrid-PUF for Industrial Internet of Things"}, {"paperId": "dd1ec4a50449569e78ba62f0deaa91642aa336fa", "title": "Towards a Framework for Analyzing the Suitability of DLTs for Integration in the IoT"}, {"paperId": "7a1e65c611405451fb3d780295b729c11b4ce3b2", "title": "A Cooperative PoW and Incentive Mechanism for Blockchain in Edge Computing"}, {"paperId": "9f4e3c258d5c0336206171b2781090f6aa740013", "title": "Rapid Detection of Multi-QR Codes Based on Multistage Stepwise Discrimination and a Compressed MobileNet"}, {"paperId": "5b8246d8d7992ffd461abb9d42608809fb44dd2a", "title": "HPCLS-BC: A novel blockchain framework using heterogeneous peer-node and cloud-based ledger storage for Internet of Things applications"}, {"paperId": "c461d5e6186c27e505551f3f6715e6f5e02fe9b6", "title": "Fine-Grained Benchmarking and Targeted Optimization: Enabling Green IoT-Oriented Blockchain in the 6G Era"}, {"paperId": "6e733b3d2ae18451b972113e1d84c85cfce2069a", "title": "An Efficient Approach for Merging Multidimensional Blockchains in Mobile IoT"}, {"paperId": "1e8ccc3909baf44b45161f8ee10bd25a49fc01a1", "title": "A comprehensive study on cybersecurity challenges and opportunities in the IoT world"}, {"paperId": "99aaa943ca42563dc8b4dee8dc2e7fcd6d92eac9", "title": "A Multidimensional Blockchain Framework For Mobile Internet of Things"}, {"paperId": "4e232506ce88a45d6b307d6a650b5666349aa08b", "title": "BCmaster: A Compatible Framework for Comprehensively Analyzing and Monitoring Blockchain Systems in IoT"}, {"paperId": "ee07fb68b173a39e8e0da3e59dbd050fab120339", "title": "Novel Early Termination Method of an ADMM-Penalized Decoder for LDPC Codes in the IoT"}, {"paperId": "7d73351b0e6d9b14ca04eb00d8d469da341d6c75", "title": "Architecture, Integrated Gateway Design, And Performance Evaluation for High Concurrency Access of Power Internet of Things"}, {"paperId": "f79308535082cf377d2897852f17ef01f3e9f34c", "title": "Advanced encryption schemes in multi-tier heterogeneous internet of things: taxonomy, capabilities, and objectives"}, {"paperId": "4ecf257175c2ea67604cae73219659e073b2fef2", "title": "BCadvisor: Enabling Green Blockchain Systems Through Resource-Oriented Benchmarking"}, {"paperId": "8bda15698d5eecde2a6b48daf8c77dc694176854", "title": "Improved spider monkey optimization‐based multi‐objective software‐defined networking routing with block chain technology for Internet of Things security"}, {"paperId": "8a54b523bed3ad353171b21f2f54d649c79a19b6", "title": "Dynamic Bargain Game Theory in the Internet of Things for Data Trustworthiness"}, {"paperId": "639baa6adab9f07b4ba5b323cc673d52c091eaf8", "title": "A Survey on blockchain for industrial Internet of Things"}, {"paperId": "e62f5333177df0369147b8a460417e5362fdc13d", "title": "Blockchain-Based Authentication with Optional Privacy Preservation for Internet of Vehicles"}, {"paperId": "975e28806752336fa57ec5a3e7c6376de8549187", "title": "Blockchain technology in the smart city: a bibliometric review"}, {"paperId": "392a71ccb9cd296714d3fe8ce6ca027e4a92a25c", "title": "Leveraging blockchain for ensuring trust in IoT: A survey"}, {"paperId": "327b90d3f060ddadab3b5e4e62baf0dcd576f1fa", "title": "Transaction Throughput Optimization for Integrated Blockchain and MEC System in IoT"}, {"paperId": "a179ea37b6d5c4d62ae3a0c40d2d3189cdfc85c0", "title": "Blockchain as a mean to secure Internet of Things ecosystems - a systematic literature review"}, {"paperId": "ef3fd925ed85e3295770cd0b35b7e9effe787445", "title": "Quantum-Inspired Blockchain-Based Cybersecurity: Securing Smart Edge Utilities in IoT-Based Smart Cities"}, {"paperId": "131165f7cd825f62f8a9258c6f9820f7e7446288", "title": "IoT-enabled healthcare systems using block chain-dependent adaptable services"}, {"paperId": "3782dda1e42b99a15668565fd4d067db53c0f495", "title": "MNCF: Prediction Method for Reliable Blockchain Services under a BaaS Environment"}, {"paperId": "1c3f234a4eefc6146f35342411ed5d10c4cc7408", "title": "Monitoring Health of IIOT Devices using Blockchain"}, {"paperId": "a58e2dba09a31c7c85880e9b8e20c25ec65070f0", "title": "Intelligent Content-Centric Networking Routing Strategy: A Bacterial Quorum Inspired Pattern"}, {"paperId": "a282c36eefad87907d426c20485b82e004da1819", "title": "IoTCop: A Blockchain-Based Monitoring Framework for Detection and Isolation of Malicious Devices in Internet-of-Things Systems"}, {"paperId": "c1bedf52f2774add23fe9b13ce455c09889f04cc", "title": "Design and Prototype Implementation of a Blockchain-Enabled LoRa System With Edge Computing"}, {"paperId": "7acae7d7462c4ee78e26e71553cd56897d012b6c", "title": "Convergence of Blockchain and Edge Computing for Secure and Scalable IIoT Critical Infrastructures in Industry 4.0"}, {"paperId": "d6222dcabe262a857fb7128e57dd20b88cf20a15", "title": "Identity Authentication with Association Behavior Sequence in Machine-to-Machine Mobile Terminals"}, {"paperId": "6ef09814f6877c03b55dd2a4027b59ed340ec5d3", "title": "Novel Paradigm for Abstraction and Management of Heterogenous Things over Large-scale Internet of Things"}, {"paperId": "6dd10e7d8104e2409b7b529d3279a55fadc7f9c5", "title": "Blockchain at the Edge: Performance of Resource-Constrained IoT Networks"}, {"paperId": "1aa6e2cb5f295c49ba7ef6654706bdf173efd4b5", "title": "Big Data and Actuarial Science"}, {"paperId": "d1f359bd5083a12ad83dfae679e895497d73f8f2", "title": "Blockchain based End-to-end Tracking System for Distributed IoT Intelligence Application Security Enhancement"}, {"paperId": "bb294817966e2373c0c00282b4e502b3de4f3a0e", "title": "LSEA: Software-Defined Networking-Based QoS-Aware Routing Mechanism for Live-Soccer Event Applications in Smart Cities"}, {"paperId": "e14ac759d10da22831dc0f928ca82105322133be", "title": "Providing reliability and auditability to the IoT LwM2M protocol through Blockchain"}, {"paperId": "1ab808983da69128f7db195984df0733731ff593", "title": "Spacechain: A Three-Dimensional Blockchain Architecture for IoT Security"}, {"paperId": "1243d958f1dcadfe1cdfc29664a59be7382248a0", "title": "Blockchain-Based Hierarchical Trust Networking for JointCloud"}, {"paperId": "a1aaf65b52c49292bff4856d67ab54cc9b7b4598", "title": "FATMLPGS: Design of a fault-aware trust establishment model for low-power IoT deployments via generic lightweight sidechains"}, {"paperId": "88e5234093b547b2dc9ddffe3eafebd496d4acbb", "title": "A Novel Classified Ledger Framework for Data Flow Protection in AIoT Networks"}, {"paperId": "a6f07826ce344fe993f7628272cd8dc890e0e499", "title": "Blockchain for Smart Cities: A Systematic Literature Review"}, {"paperId": "9f1390eb97a2d12ee9e6240f079773a06ccdf1e4", "title": "Performance Benchmarking and Optimization for IIoT-oriented Blockchain"}, {"paperId": "98628af92ef3e9e49e54b9a1591fa19e26867d3c", "title": "ANALYSIS OF BLOCKCHAIN AND IOT INTEGRATED SMART CITY ARCHITECTURE"}, {"paperId": "b2a99c7e0ecb226abcee0fc6306c4ab1f463d06d", "title": "ScholarWorks @ UTRGV ScholarWorks @ UTRGV"}]}
