{"paperId": "7b0b3fb7090c4da553e06ff0a8ed7d529e6a402b", "publicationVenue": {"id": "eb83052e-28c9-4a33-a49b-05885d2e59cd", "name": "International Journal of Pervasive Computing and Communications", "type": "journal", "alternate_names": ["Int J Pervasive Comput Commun"], "issn": "1742-7371", "url": "https://www.emerald.com/insight/publication/issn/1742-7371"}, "title": "Context-aware assistive driving: an overview of techniques for mitigating the risks of driver in real-time driving environment", "abstract": "\nPurpose\nThis study aims to analyze driver risks in the driving environment. A complete analysis of context aware assistive driving techniques. Context awareness in assistive driving by probabilistic modeling techniques. Advanced techniques using Spatio-temporal techniques, computer vision and deep learning techniques.\n\n\nDesign/methodology/approach\nAutonomous vehicles have been aimed to increase driver safety by introducing vehicle control from the driver to Advanced Driver Assistance Systems (ADAS). The core objective of these systems is to cut down on road accidents by helping the user in various ways. Early anticipation of a particular action would give a prior benefit to the driver to successfully handle the dangers on the road. In this paper, the advancements that have taken place in the use of multi-modal machine learning for assistive driving systems are surveyed. The aim is to help elucidate the recent progress and techniques in the field while also identifying the scope for further research and improvement. The authors take an overview of context-aware driver assistance systems that alert drivers in case of maneuvers by taking advantage of multi-modal human processing to better safety and drivability.\n\n\nFindings\nThere has been a huge improvement and investment in ADAS being a key concept for road safety. In such applications, data is processed and information is extracted from multiple data sources, thus requiring training of machine learning algorithms in a multi-modal style. The domain is fast gaining traction owing to its applications across multiple disciplines with crucial gains.\n\n\nResearch limitations/implications\nThe research is focused on deep learning and computer vision-based techniques to generate a context for assistive driving and it would definitely adopt by the ADAS manufacturers.\n\n\nSocial implications\nAs context-aware assistive driving would work in real-time and it would save the lives of many drivers, pedestrians.\n\n\nOriginality/value\nThis paper provides an understanding of context-aware deep learning frameworks for assistive driving. The research is mainly focused on deep learning and computer vision-based techniques to generate a context for assistive driving. It incorporates the latest state-of-the-art techniques using suitable driving context and the driver is alerted. Many automobile manufacturing companies and researchers would refer to this study for their enhancements.\n", "venue": "International Journal of Pervasive Computing and Communications", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-08-16", "journal": {"name": "Int. J. Pervasive Comput. Commun.", "pages": "325-342", "volume": "19"}, "authors": [{"authorId": "71618867", "name": "S. Gite"}, {"authorId": "1794896", "name": "K. Kotecha"}, {"authorId": "65867720", "name": "G. Ghinea"}], "citations": [{"paperId": "8434b118d8b24a049374c766d83d320a9a621726", "title": "Autonomous Driving using Residual Sensor Fusion and Deep Reinforcement Learning"}, {"paperId": "1b19425ec9569755d540cb23598b5b510d10d881", "title": "An Assistance System for Driver’s Safety based on YOLO Algorithm"}, {"paperId": "055432fe274aa8de29a5006ecf6b33fdd2a79876", "title": "Context-aware behaviour prediction for autonomous driving: a deep learning approach"}]}
