{"paperId": "7b1687a9d1cd6058cda2fd36ac9c2d69065aca23", "publicationVenue": null, "title": "Reinforcement Learning for Primary care e Appointment Scheduling", "abstract": "Patient scheduling is a complex task that plays a crucial role in the quality of care. Effective scheduling avoids patient and physician dissatisfaction, and as such, is an important determinant of care. However, the task of patient scheduling is traditionally done ad hoc, with disregard of potential aspects that may determine appointment duration and overall waiting time. Since scheduling in this setting is frequently done one patient at a time, the problem cannot be readily solved by optimization methods. Furthermore, the constant changing nature of clinical settings implies that one-fits-all heuristic scheduling approaches would generally be poor, rendering the task of automated patient scheduling resource intensive, costly to maintain, and thus, generally unfeasible. The present work aims to develop a framework to create fully configurable patient scheduling environments, study the performance of the Advantage Actor-Critic reinforcement learning algorithm to schedule appointments in a set of increasingly challenging environments, and benchmark it against a set of simple deterministic heuristics. A micro-service application was developed to create and test any scheduling environments over which to develop and test agents. The platform enabled online monitoring of the agent performance and data collection for posterior analysis. It also enabled humans to work as agents. The platform was developed in such a way that it can be run in local machines or cloud infrastructure. We devised and developed a set of seven specific appointment scheduling environments that implement the basic requirements of scheduling in Primary Care, and studied the performance of RL agents implemented using the A3C algorithm. Finally, we have shown that RL agents are able to learn the underlying rules that govern such environments, that needed to be considered to arrive at optimal or near optimal scheduling solutions, and thus are promising algorithms for production environments.", "venue": "", "year": 2017, "fieldsOfStudy": ["Engineering"], "publicationTypes": null, "publicationDate": "2017-10-30", "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "12950074", "name": "T. T. Gomes"}], "citations": [{"paperId": "a168fa6c702bf4908df936e1793cc67730fa3103", "title": "A reinforcement learning-based optimal control approach for managing an elective surgery backlog after pandemic disruption"}, {"paperId": "e3709b64de3a1fb2a498e8c649a42f03ca8244e2", "title": "An alternative to the black box: Strategy learning"}, {"paperId": "eb1ed3e65130fb14e86a4a3a1c6c70bae113e4dd", "title": "NICE: Robust Scheduling through Reinforcement Learning-Guided Integer Programming"}, {"paperId": "f8492a321d66c381637b693a24af994af41b3cdf", "title": "Transfer Learning in Deep Reinforcement Learning: A Survey"}, {"paperId": "2bed17dc270c5c185278c262b2424295b6a21fce", "title": "Reinforcement learning for intelligent healthcare applications: A survey"}, {"paperId": "04bb18b206b655b6b99705d6723b7b85b0b49ee5", "title": "Intelligent and Convolutional-Neural-Network based Smart Hospital and Patient Scheduling System"}, {"paperId": "222baa4e9e7ce691fdfddbc826a70e027daed70d", "title": "Reinforcement Learning in Healthcare: A Survey"}, {"paperId": "48dfc91cbaa1d0720c70b7aad43d573b738968e6", "title": "in Healthcare in Healthcare"}]}
