{"paperId": "7b234917ef105f333d935f18467f9e3d08fab72f", "publicationVenue": {"id": "82901c74-dc2e-4d08-b633-637c7e209284", "name": "Conference on Applications, Technologies, Architectures, and Protocols for Computer Communication", "type": "conference", "alternate_names": ["Conf Appl Technol Archit Protoc Comput Commun", "ACM Special Interest Group on Data Communication", "SIGCOMM", "ACM Spéc Interest Group Data Commun"], "url": "https://en.wikipedia.org/wiki/SIGCOMM"}, "title": "Using trio: juniper networks' programmable chipset - for emerging in-network applications", "abstract": "This paper describes Trio, a programmable chipset used in Juniper Networks' MX-series routers and switches. Trio's architecture is based on a multi-threaded programmable packet processing engine and a hierarchy of high-capacity memory systems, making it fundamentally different from pipeline-based architectures. Trio gracefully handles non-homogeneous packet processing rates for a wide range of networking use cases and protocols, making it an ideal platform for emerging in-network applications. We begin by describing the Trio chipset's fundamental building blocks, including its multi-threaded Packet Forwarding and Packet Processing Engines. We then discuss Trio's programming language, called Microcode. To showcase Trio's flexible Microcode-based programming environment, we describe two use cases. First, we demonstrate Trio's ability to perform in-network aggregation for distributed machine learning. Second, we propose and design an in-network straggler mitigation technique using Trio's timer threads. We prototype both use cases on a testbed using three real DNN models (ResNet50, DenseNet161, and VGG11) to demonstrate Trio's ability to mitigate stragglers while performing in-network aggregation. Our evaluations show that when stragglers occur in the cluster, Trio outperforms today's pipeline-based solutions by up to 1.8x.", "venue": "Conference on Applications, Technologies, Architectures, and Protocols for Computer Communication", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2022-08-22", "journal": {"name": "Proceedings of the ACM SIGCOMM 2022 Conference"}, "authors": [{"authorId": "1949057114", "name": "Mingran Yang"}, {"authorId": "2175863262", "name": "Alex Baban"}, {"authorId": "2175858518", "name": "Valery Kugel"}, {"authorId": "46305078", "name": "J. Libby"}, {"authorId": "25706216", "name": "Scott P. Mackie"}, {"authorId": "2181221317", "name": "Swamy Sadashivaiah Renu Kananda"}, {"authorId": "2181206628", "name": "Chang-Hong Wu"}, {"authorId": "51130413", "name": "M. Ghobadi"}], "citations": [{"paperId": "f7ba2bb86f0804e627fcf9a89039360ecca80445", "title": "MLTCP: Congestion Control for DNN Training"}, {"paperId": "2b69d57d04ae5f528c04d737882c41607e1f6b24", "title": "Identifying Performance Bottleneck in Shared In-Network Aggregation during Distributed Training"}, {"paperId": "819f0ee932e9c328fcc0d4ba425b3d1bb5cbb8ba", "title": "FlatProxy: A DPU-centric Service Mesh Architecture for Hyperscale Cloud-native Application"}, {"paperId": "027d5abb7a0711b389b6ec6b571749082771f021", "title": "On-Fiber Photonic Computing"}, {"paperId": "5d2962c8973dfe161ff92abeaa435c55b12f5080", "title": "Straggler-Aware In-Network Aggregation for Accelerating Distributed Deep Learning"}, {"paperId": "6543ff72581d7913cfa5832f2547a68f0168e23a", "title": "Yama: Providing Performance Isolation for Black-Box Offloads"}, {"paperId": "3558599bd03e4b5c6ea238c5a56b9f2ddadc65cb", "title": "PA-ATP: Progress-Aware Transmission Protocol for In-Network Aggregation"}, {"paperId": "55d8e8b15cd95e3c005cd05be4c89f9041c0b818", "title": "Making programmable packet scheduling time-sensitive with a FIFO queue"}, {"paperId": "0435db1dcda224a60a9a7eca8554ca22fee9a88d", "title": "Memory Management in ActiveRMT: Towards Runtime-programmable Switches"}, {"paperId": "fa3b127c94e22e26cb03a99dbdb25895130c7354", "title": "BitSense: Universal and Nearly Zero-Error Optimization for Sketch Counters with Compressive Sensing"}, {"paperId": "c095361942179c96cae0c30248fb6ff80b0bc390", "title": "CASSINI: Network-Aware Job Scheduling in Machine Learning Clusters"}, {"paperId": "6930158e6d53f31d2fae041f1315bfcf240cd599", "title": "Robust open-set classification for encrypted traffic fingerprinting"}, {"paperId": "c2828f19a219ffdf0814a313bac147a0db713866", "title": "ClickINC: In-network Computing as a Service in Heterogeneous Programmable Data-center Networks"}, {"paperId": "622c7bb6bce04fc7d3749c6bf752e8e56ec825dd", "title": "Compiling Service Function Chains via Fine-Grained Composition in the Programmable Data Plane"}, {"paperId": "0188ae91430779f5d32ea7e18b76d5da1fe5f779", "title": "Roar: A Router Microarchitecture for In-network Allreduce"}, {"paperId": "8a040d0d99fa248c415f0aa90a083123320bf21a", "title": "Offloading Machine Learning to Programmable Data Planes: A Systematic Survey"}, {"paperId": "b0e010361793bea5e39a5d6cda8fa75461380569", "title": "GraphINC: Graph Pattern Mining at Network Speed"}, {"paperId": "4cc6008b3615804bd02f55ec9848028d0c726968", "title": "Maximizing Aggregation Throughput for Distributed Training with Constrained In-Network Computing"}, {"paperId": "6e307d4955f004972e5d24bf39891fd554dacf44", "title": "Serene: Handling the Effects of Stragglers in In-Network Machine Learning Aggregation"}, {"paperId": "d3562d9e310873f49a3f10c93dc1db2e4e0b93ec", "title": "A2TP: Aggregator-aware In-network Aggregation for Multi-tenant Learning"}, {"paperId": "864e982cf283f90814c0a27bff349794a237ba84", "title": "Network Monitoring on Multi-Pipe Switches"}, {"paperId": "fc2f87333527ea30f9bdf7391572509c2a6f79c3", "title": "THC: Accelerating Distributed Deep Learning Using Tensor Homomorphic Compression"}, {"paperId": "89984698591f6eb8d288bf6811c080bda435ab3f", "title": "A Generic Service to Provide In-Network Aggregation for Key-Value Streams"}, {"paperId": "f70719547a33377ac22cfc106768233c45278eba", "title": "In-network aggregation for data center networks: A survey"}, {"paperId": "bff2afa467751fbc94e977b58149016eb516293c", "title": "A Programmable SRv6 Processor for SFC"}, {"paperId": "e7eeca9111ecc28e185c7310ca2cbfe9a4fefed2", "title": "Optimizing Network Latency: Unveiling the Impact of Reflection Server Tuning"}]}
