{"paperId": "7b2dd3a8622b1a2a613c82b8823e6b531576bbad", "publicationVenue": null, "title": "A survey on Big Data storage strategies", "abstract": "Over the last decade the enterprises across public and personal entities have made strategic determination to change big data into useful advantage. Big data used to describe the large and complex set of both structured and unstructured data range in the size of exabytes (1016) and quintillions. Such amount of data surpassed the potential of present online storage systems and computing systems. Big data is being produced at alarming rate which is driven by individuals and their increased used of media, organizations, the switch from analogue to digital technologies, the expansion of internet connected devices and systems. Such the swelling of big data will approach the zettabyte per year range with in a little time period. The one major characteristic of big data is volume; other characteristics are velocity and variety. The storage issue seems to be easily handled in the recent session but shows a tedious session challenges. Big Data technologies explains the new batch of storage technologies and new framework proposed to monetarily extricate the useful information from the huge amount of unstructured data.", "venue": "2015 International Conference on Green Computing and Internet of Things (ICGCIoT)", "year": 2015, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference", "Review"], "publicationDate": "2015-10-08", "journal": {"name": "2015 International Conference on Green Computing and Internet of Things (ICGCIoT)", "pages": "280-284"}, "authors": [{"authorId": "2084018305", "name": "Gazal"}, {"authorId": "31574132", "name": "P. Kaur"}], "citations": [{"paperId": "08f467fe93ca684792680838472af95a170ecbfd", "title": "Aluminium metal matrix composites and effect of reinforcements – A Review"}, {"paperId": "a6504dba7348035482072cd3f22b3fc1d193ed9a", "title": "An efficient storage-optimizing tick data clustering model"}, {"paperId": "83e95b1f04ab44c554be71d9ba7b9c028ab2494c", "title": "Big Data Classification and Internet of Things in Healthcare"}, {"paperId": "44454bc0c23fb3d515540eb64c8636de727abe85", "title": "Context-Aware Computing, Learning, and Big Data in Internet of Things: A Survey"}, {"paperId": "746c2c36786e40c56e166dbde86d10c69427277a", "title": "Big data storage and management in SaaS applications"}, {"paperId": "edfd409c4fd5bfd9183bb28c3c14dc8ca7a75920", "title": "Optimizing B-tree search performance of big data sets / Mohsen Marjani"}, {"paperId": "0c2cd263b86e26a3266bd21d72a3e18a2a3c411e", "title": "Increasing the availability of multi-object tasks on multi-region distributed system"}, {"paperId": "981a36f5ec5959ee373ba4067cbdac1ca8cf525d", "title": "Emerging Role of Data Analytics in Combating Financial Frauds: the Era of Big Data in India"}, {"paperId": "086fe45d4888ed5752d79624f53f3144e0d96045", "title": "An extended IoT framework with semantics, big data, and analytics"}, {"paperId": "b3ba4980c94700cac33b2ef69cc8680d0a030dd9", "title": "in Computer Science and Software Engineering"}, {"paperId": "b7895cc8cf49e51e9306f1cc0fc8487a25e12106", "title": "2016 Ieee International Conference on Big Data (big Data) an Extended Iot Framework with Semantics, Big Data, and Analytics"}]}
