{"paperId": "7b366669759018e15ae798d26b26e0e4d4460a7d", "publicationVenue": {"id": "8270cfe1-3713-4325-a7bd-c6a87eed889e", "name": "Entropy", "type": "journal", "issn": "1099-4300", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-155606", "alternate_urls": ["http://www.mdpi.com/journal/entropy/", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-155606", "https://www.mdpi.com/journal/entropy"]}, "title": "Measuring the Effectiveness of Adaptive Random Forest for Handling Concept Drift in Big Data Streams", "abstract": "We are living in the age of big data, a majority of which is stream data. The real-time processing of this data requires careful consideration from different perspectives. Concept drift is a change in the data’s underlying distribution, a significant issue, especially when learning from data streams. It requires learners to be adaptive to dynamic changes. Random forest is an ensemble approach that is widely used in classical non-streaming settings of machine learning applications. At the same time, the Adaptive Random Forest (ARF) is a stream learning algorithm that showed promising results in terms of its accuracy and ability to deal with various types of drift. The incoming instances’ continuity allows for their binomial distribution to be approximated to a Poisson(1) distribution. In this study, we propose a mechanism to increase such streaming algorithms’ efficiency by focusing on resampling. Our measure, resampling effectiveness (ρ), fuses the two most essential aspects in online learning; accuracy and execution time. We use six different synthetic data sets, each having a different type of drift, to empirically select the parameter λ of the Poisson distribution that yields the best value for ρ. By comparing the standard ARF with its tuned variations, we show that ARF performance can be enhanced by tackling this important aspect. Finally, we present three case studies from different contexts to test our proposed enhancement method and demonstrate its effectiveness in processing large data sets: (a) Amazon customer reviews (written in English), (b) hotel reviews (in Arabic), and (c) real-time aspect-based sentiment analysis of COVID-19-related tweets in the United States during April 2020. Results indicate that our proposed method of enhancement exhibited considerable improvement in most of the situations.", "venue": "Entropy", "year": 2021, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-07-01", "journal": {"name": "Entropy", "volume": "23"}, "authors": [{"authorId": "2118934545", "name": "Abdulaziz O. Alqabbany"}, {"authorId": "2569677", "name": "Aqil M. Azmi"}], "citations": [{"paperId": "4a7aed5046b9cdfc30448b1594f4884df189f55a", "title": "Incremental Online Machine Learning for Detecting Malicious Nodes in Vehicular Communications Using Real-Time Monitoring"}, {"paperId": "600ac843c5a210c902b094e5291b2ddb2dbc798e", "title": "Continual Learning Approach for Continuous Data Stream Analysis in Dynamic Environments"}, {"paperId": "873dbc889e590721aa1b05f6b2636ea45f2b81ef", "title": "Spanish Emotion Recognition Method Based on Cross-Cultural Perspective"}]}
