{"paperId": "7b3d27f7c0fe22d654f299fe2148077f9dbd7f9c", "publicationVenue": null, "title": "OPERA-gSAM: Big Data Processing Framework for UMI Sequencing at High Scalability and Efficiency", "abstract": "genome Sequence Alignment Map The rapidly increasing demand for next-generation biotechnologies has enabled the development of DNA and RNA big data-oriented (BD) pipelines. The preprocessing stage requires sequencing and alignment tools that provide barcoding for error correction and increase accuracy during sequencing. Unique Molecular Identifiers (UMIs) promise a highly accurate bioinformatic identification of PCR duplication before the amplification stage. However, using alignment coordinates alone is Data-intensiveand challenging due to the increased demand for computational throughput, affecting the performance of the underlying resources. This paper proposes a highly scalable data scheduling and resource allocation framework called OPERA-gSAM for the genome Sequence Alignment Map (SAM). OPERA-gSAM, an OPportunistic and Elastic Resource Allocation, is an enabling big data platform (i.e., Apache Spark) for the next-generation massively parallel sequencing applications. We validate OPERA-gSAM scalability and efficiency using Genomics single-cell RNA sequencing. Our experiments demonstrate the usability and high efficiency of the proposed framework. Results show that OPERA-gSAM is up to 2.4× faster while consuming 50% fewer resources than the conventional pipeline using SAM and UMI tools.", "venue": "2023 IEEE/ACM 23rd International Symposium on Cluster, Cloud and Internet Computing Workshops (CCGridW)", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-01", "journal": {"name": "2023 IEEE/ACM 23rd International Symposium on Cluster, Cloud and Internet Computing Workshops (CCGridW)", "pages": "160-167"}, "authors": [{"authorId": "1820448928", "name": "P. V. Caderno"}, {"authorId": "17663383", "name": "Feras M. Awaysheh"}, {"authorId": "1403776249", "name": "Yolanda Colino-Sanguino"}, {"authorId": "2166230188", "name": "Laura Rodriguez de la Fuente"}, {"authorId": "1401786102", "name": "F. Valdés-Mora"}, {"authorId": "3145307", "name": "J. C. Cabaleiro"}, {"authorId": "145834089", "name": "T. F. Pena"}, {"authorId": "1398488432", "name": "D. Gallego-Ortega"}], "citations": [{"paperId": "1e844ad2bba6d2f6173da3fad1a7f71bd87fe2b9", "title": "A cognitive deep learning approach for medical image processing"}]}
