{"paperId": "7b50bcb65e14850de86a7295a3e84a32b972a28a", "publicationVenue": {"id": "b189dec0-41d0-4cea-a906-7c5186895904", "name": "Global Communications Conference", "type": "conference", "alternate_names": ["GLOBECOM", "Glob Commun Conf"], "url": "http://www.ieee-globecom.org/"}, "title": "Position Optimization and Resource Management for UAV-Assisted Wireless Sensor Networks", "abstract": "In this paper, we focus on the energy saving problem for the wireless sensor networks (WSNs). Specifically, we propose a UAV-assisted wireless network architecture, where the cell-edge sensor devices (SDs) can access the aerial access points (AAPs) instead of the terrestrial access point (TAP). Since the transmitter-to-receiver distance is shortened and the ground-to-air channel is usually line-of-sight, the SDs can use lower power to transmit data and thereby prolong their lifetime. To fully exploit the potential of the network architecture, we jointly optimize the AAPs' position, channel allocation, and power control to minimize the total transmission power of all SDs. In order to solve the complex joint optimization problem, we reformulate it as three tractable subproblems and use the methods in graph theory to design low-complex algorithms. Simulation results indicate that the proposed network architecture greatly outperforms the traditional WSNs, and the proposed algorithms can further reduce the total power consumption.", "venue": "Global Communications Conference", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-12-01", "journal": {"name": "2021 IEEE Global Communications Conference (GLOBECOM)", "pages": "1-6"}, "authors": [{"authorId": "2277855", "name": "Daosen Zhai"}, {"authorId": "2109115529", "name": "Chen Wang"}, {"authorId": "151029271", "name": "Huakui Sun"}, {"authorId": "1866371", "name": "Haotong Cao"}, {"authorId": "143619374", "name": "Feng Tian"}, {"authorId": "1776980", "name": "Ruonan Zhang"}], "citations": [{"paperId": "8bdad697e6ce13e4f2a922fb9b026b0aa9af9bd5", "title": "Joint optimization for latency minimization in UAV-assisted MEC networks"}]}
