{"paperId": "7b584e1c7a313e14c6f518d3caec7942e3fa14c4", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Exploration and Comparison of the Effect of Conventional and Advanced Modeling Algorithms on Landslide Susceptibility Prediction: A Case Study from Yadong Country, Tibet", "abstract": "Shallow landslides pose serious threats to human existence and economic development, especially in the Himalayan areas. Landslide susceptibility mapping (LSM) is a proven way for minimizing the hazard and risk of landslides. Modeling as an essential step, various algorithms have been applied to LSM, but no consensus exists on which model is most suitable or best. In this study, information value (IV) and logistic regression (LR) were selected as representatives of the conventional algorithms, categorical boosting (CatBoost), and conventional neural networks (CNN) as the advanced algorithms, for LSM in Yadong County, and their performance was compared. To begin with, 496 historical landslide events were compiled into a landslide inventory map, followed by a list of 11 conditioning factors, forming a data set. Secondly, the data set was randomly divided into two parts, 80% of which was used for modeling and 20% for validation. Finally, the area under the curve (AUC) and statistical metrics were applied to validate and compare the performance of the models. The results showed that the CNN model performed the best (sensitivity = 79.38%, specificity = 91.00%, accuracy = 85.28%, and AUC = 0.908), while the LR model performed the worst (sensitivity = 79.38%, specificity = 76.00%, accuracy = 77.66%, and AUC = 0.838) and the CatBoost model performed better (sensitivity = 76.28%, specificity = 85.00%, accuracy = 80.81%, and AUC = 0.893). Moreover, the LSM constructed by the CNN model did a more reasonable prediction of the distribution of susceptible areas. As for feature selection, a more detailed analysis of conditioning factors was conducted, but the results were uncertain. The result analyzed by GI may be more reliable but fluctuates with the amount of data. The conclusion reveals that the accuracy of LSM can be further improved with the advancement of algorithms, by determining more representative features, which serve as a more effective guide for land use planning in the study area or other highlands where landslides are frequent.", "venue": "Applied Sciences", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-19", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "2113515899", "name": "Zhu Liang"}, {"authorId": "2221568737", "name": "Weiping Peng"}, {"authorId": "2157222795", "name": "Wei Liu"}, {"authorId": "2196109752", "name": "Houzan Huang"}, {"authorId": "2221826966", "name": "Jiaming Huang"}, {"authorId": "2221794341", "name": "Kangming Lou"}, {"authorId": "2222279170", "name": "Guochao Liu"}, {"authorId": "2052123585", "name": "Kaihua Jiang"}], "citations": [{"paperId": "0bcba4d57ba04b626d9839e673a1c104b84b36b8", "title": "Modelling landslide susceptibility prediction: A review and construction of semi-supervised imbalanced theory"}, {"paperId": "d043666d29d6430a63d3f20385b18ace7549cdea", "title": "Unraveling the evolution of landslide susceptibility: a systematic review of 30-years of strategic themes and trends"}]}
