{"paperId": "7b5e06aea115be84f43a439d007e85ad24290cbf", "publicationVenue": {"id": "b02cf974-33be-46bd-9cbc-022db6cb7151", "name": "IEEE International Conference on Software Maintenance and Evolution", "type": "conference", "alternate_names": ["Int Conf Sci Manag Eng", "IEEE Int Conf Softw Maint Evol", "ICSME", "International Conference Science, Management, and Engineering"], "url": "http://conferences.computer.org/icsm/"}, "title": "Soundy Automated Parallelization of Test Execution", "abstract": "Regression Testing is an important quality assurance practice widely adopted today. Optimizing regression testing is important. Test parallelization has the potential to leverage the power of multi-core architectures to accelerate regression testing. Unfortunately, it is not possible to directly use parallelization options available in build systems and testing frameworks without introducing test flakiness. Tests can fail because of data races or broken test dependencies. Although it is possible to safely circumvent those problems with the assistance of an automated tool to collect test dependencies (e.g., PRADET), the cost of that solution is prohibitive, defeating the purpose of test parallelization. This paper proposes PASTE an approach to automatically parallelize the execution of test suites. PASTE alternates parallel and sequential execution of test cases and test classes to circumvent provoked test failures. PASTE does not provide the safety guarantee that flakiness will not be manifested, but our results indicate that the strategy is sufficient to avoid them. We evaluated PASTE on 25 projects mined from GitHub using an objective selection criteria. Results show that (i) PASTE could circumvent flakiness introduced with parallelization in all projects that manifested them and (ii) 52% of the projects benefited from test-parallelization with a median speedup of 1.59x (best: 2.28x, average: 1.47x, worst: 0.93x).", "venue": "IEEE International Conference on Software Maintenance and Evolution", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-09-01", "journal": {"name": "2021 IEEE International Conference on Software Maintenance and Evolution (ICSME)", "pages": "309-319"}, "authors": [{"authorId": "32484435", "name": "Shouvick Mondal"}, {"authorId": "2006451021", "name": "Denini Silva"}, {"authorId": "1403835151", "name": "Marcelo d’Amorim"}], "citations": [{"paperId": "bf2526fc177d072687b6aea37ea4ab197b0d40db", "title": "Test Flakiness' Causes, Detection, Impact and Responses: A Multivocal Review"}, {"paperId": "319bbe81a92bd0d7fffd1435e891378c2e9609b0", "title": "NeuDep: neural binary memory dependence analysis"}]}
