{"paperId": "7b78d629c823f6345343cce85a11f3d95aa4ac3e", "publicationVenue": {"id": "1981260f-d0bb-4414-9470-7683389919d0", "name": "International Green and Sustainable Computing Conference", "type": "conference", "alternate_names": ["IGSC", "Int Green Sustain Comput Conf"], "url": "http://www.green-conf.org/"}, "title": "Benchmarking Memory-Centric Computing Systems: Analysis of Real Processing-In-Memory Hardware", "abstract": "Many modern workloads such as neural network inference and graph processing are fundamentally memory-bound. For such workloads, data movement between memory and CPU cores imposes a significant overhead in terms of both latency and energy. A major reason is that this communication happens through a narrow bus with high latency and limited bandwidth, and the low data reuse in memory-bound workloads is insufficient to amortize the cost of memory access. Fundamentally addressing this data movement bottleneck requires a paradigm where the memory system assumes an active role in computing by integrating processing capabilities. This paradigm is known as processing-in-memory (PIM). Recent research explores different forms of PIM architectures, motivated by the emergence of new technologies that integrate memory with a logic layer, where processing elements can be easily placed. Past works evaluate these architectures in simulation or, at best, with simplified hardware prototypes. In contrast, the UPMEM company has designed and manufactured the first publicly-available real-world PIM architecture. The UPMEM PIM architecture combines traditional DRAM memory arrays with general-purpose in-order cores, called DRAM Processing Units (DPUs), integrated in the same chip. This paper presents key takeaways from the first comprehensive analysis [1] of the first publicly-available real-world PIM architecture. First, we introduce our experimental characterization of the UPMEM PIM architecture using microbenchmarks, and present PrIM (Processing-In-Memory benchmarks), a benchmark suite of 16 workloads from different application domains (e.g., dense/sparse linear algebra, databases, data analytics, graph processing, neural networks, bioinformatics, image processing), which we identify as memory-bound. Second, we provide four key takeaways about the UPMEM PIM architecture, which stem from our study of the performance and scaling characteristics of PrIM benchmarks on the UPMEM PIM architecture, and their performance and energy consumption comparison to their state-of-the-art CPU and GPU counterparts. More insights about suitability of different workloads to the PIM system, programming recommendations for software designers, and suggestions and hints for hardware and architecture designers of future PIM systems are available in [1].", "venue": "International Green and Sustainable Computing Conference", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-10-04", "journal": {"name": "2021 12th International Green and Sustainable Computing Conference (IGSC)", "pages": "1-7"}, "authors": [{"authorId": "1474355913", "name": "Juan G'omez-Luna"}, {"authorId": "3077499", "name": "I. E. Hajj"}, {"authorId": "2061067079", "name": "Ivan Fernandez"}, {"authorId": "46175739", "name": "Christina Giannoula"}, {"authorId": "2173743", "name": "Geraldo F. Oliveira"}, {"authorId": "145929920", "name": "O. Mutlu"}], "citations": [{"paperId": "cbb505aafe497d6d3da167c18e2984fc31edf61e", "title": "PUMA: Efficient and Low-Cost Memory Allocation and Alignment Support for Processing-Using-Memory Architectures"}, {"paperId": "d5f2e95be45d3e003655a9a84e0adda9468b0838", "title": "MIMDRAM: An End-to-End Processing-Using-DRAM System for High-Throughput, Energy-Efficient and Programmer-Transparent Multiple-Instruction Multiple-Data Processing"}, {"paperId": "23e389c22549eb50e692279d23dd633ee567e5c3", "title": "A3PIM: An Automated, Analytic and Accurate Processing-in-Memory Offloader"}, {"paperId": "763488734b9b5f6f475838c43746cf16f3fe5b0a", "title": "Rethinking the Producer-Consumer Relationship in Modern DRAM-Based Systems"}, {"paperId": "40a095e6abe7d11f13a84b5c76c8c39da21841d4", "title": "Bridge-NDP: Achieving Efficient Communication-Computation Overlap in Near Data Processing with Bridge Architecture"}, {"paperId": "a2bd05bf3b3e37701bde5e71518bb35b3bcf6960", "title": "PIM-STM: Software Transactional Memory for Processing-In-Memory Systems"}, {"paperId": "711910e69879e512fde3f591eca5447a46625e00", "title": "SimplePIM: A Software Framework for Productive and Efficient Processing-in-Memory"}, {"paperId": "1978610dadb790fe56e9a07be245b5461d20914d", "title": "Inclusive-PIM: Hardware-Software Co-design for Broad Acceleration on Commercial PIM Architectures"}, {"paperId": "4e268759f57e64f59febafb0250071dee4a8cffe", "title": "Evaluating Homomorphic Operations on a Real-World Processing-In-Memory System"}, {"paperId": "ef0638c10bba5e53bf348cd3e64c2954dc903d57", "title": "Pathfinding Future PIM Architectures by Demystifying a Commercial PIM Technology"}, {"paperId": "dc582ed585c8e99f40089877e03dc9412a92d93a", "title": "GAPiM: Discovering Genetic Variations on a Real Processing-in-Memory System"}, {"paperId": "7a391064a366fb8dfb550ea29ed3a4e292a1c207", "title": "Lightning Talk: Memory-Centric Computing"}, {"paperId": "f04fff0b07165fb0ceff2aa6be96c69084559dab", "title": "Emerging Hardware Technologies and 3D System Integration for Ubiquitous Machine Intelligence"}, {"paperId": "56b85672e02fb1800c2f7a529c756f8e4ce4e40a", "title": "Memory-Centric Computing"}, {"paperId": "4d2be7d4f3f797a32805362de585e572ec36a1bb", "title": "TransPimLib: A Library for Efficient Transcendental Functions on Processing-in-Memory Systems"}, {"paperId": "e2b920c623dd1b00577fee7f081c13b047025141", "title": "TransPimLib: Efficient Transcendental Functions for Processing-in-Memory Systems"}, {"paperId": "06444c5756a513124b35300d1374f0e34df12990", "title": "Evaluating Machine LearningWorkloads on Memory-Centric Computing Systems"}, {"paperId": "45a28196727aaa19b54d1ce7d7307585096cebcd", "title": "Simulation Environment with Customized RISC-V Instructions for Logic-in-Memory Architectures"}, {"paperId": "7c44a09adfc412e2addfba16778b3a8b098bd7ae", "title": "Accelerating Irregular Applications via Efficient Synchronization and Data Access Techniques"}, {"paperId": "5be7859c83248307d0efaad13874cba9c8880fce", "title": "Accelerating Time Series Analysis via Processing using Non-Volatile Memories"}, {"paperId": "126a59bef0700440808384b0bc7c0c4f4817f4de", "title": "High-performance and balanced parallel graph coloring on multicore platforms"}, {"paperId": "dda5728ddca81df3721744f1441ee8302c075456", "title": "Accelerating Neural Network Inference With Processing-in-DRAM: From the Edge to the Cloud"}, {"paperId": "a4a80e375b3acc4ea7b09bd7c9c3b3e02e3fbb54", "title": "A framework for high-throughput sequence alignment using real processing-in-memory systems"}, {"paperId": "e827a686216beadd08a5d2840c24ed470e521a94", "title": "An Experimental Evaluation of Machine Learning Training on a Real Processing-in-Memory System"}, {"paperId": "2aee1899e87c3bc8cd9af32001d1550abc373551", "title": "SparseP: Efficient Sparse Matrix Vector Multiplication on Real Processing-In-Memory Architectures"}, {"paperId": "2b34303b55a0538bde48f37c24f16cdd3b2b1419", "title": "Energy-efficient In-Memory Address Calculation"}, {"paperId": "036f2336db908986ba83082641423ad1da234b9d", "title": "Machine Learning Training on a Real Processing-in-Memory System"}, {"paperId": "1d2a69b5f4d7d32e05e1e663a592d1e7943a8031", "title": "Towards Efficient Sparse Matrix Vector Multiplication on Real Processing-In-Memory Architectures"}, {"paperId": "35592c445d2e6adeb1c43ed5b25700b544188954", "title": "Exploiting Near-Data Processing to Accelerate Time Series Analysis"}, {"paperId": "67b1e1eeb5d7af8ea7d880cd561b81d85d89144b", "title": "Heterogeneous Data-Centric Architectures for Modern Data-Intensive Applications: Case Studies in Machine Learning and Databases"}, {"paperId": "b83439573935033e7af5a8eb6a561e813e3b2839", "title": "Methodologies, Workloads, and Tools for Processing-in-Memory: Enabling the Adoption of Data-Centric Architectures"}, {"paperId": "4eac0fca0e861e56f502f348c3c0e024e0960c42", "title": "Polynesia: Enabling High-Performance and Energy-Efficient Hybrid Transactional/Analytical Databases with Hardware/Software Co-Design"}, {"paperId": "39f74f26853ccc34bfe5485e4d78219ed317d0e6", "title": "Enabling High-Performance and Energy-Efficient Hybrid Transactional/Analytical Databases with Hardware/Software Cooperation"}, {"paperId": "40b261c056da0e26f598b75000a6bccafffd09fd", "title": "A Case for Transparent Reliability in DRAM Systems"}, {"paperId": "9f4ed3ba3bbdf48637ac48206882cc357396e9d1", "title": "High-throughput Pairwise Alignment with the Wavefront Algorithm using Processing-in-Memory"}, {"paperId": "9fc0eb78461f7b22c079da879f36064500a2f9f1", "title": "Towards Efficient Sparse Matrix Vector Multiplication on Real Processing-In-Memory Systems"}, {"paperId": "cbf4d8928e9d55a03575fd752dcf9eeefcfbe0e3", "title": "SparseP"}, {"paperId": "ef58a34c000f5f7cc4329d03641481342b830a84", "title": "SparseP: Towards Efficient Sparse Matrix Vector Multiplication on Real Processing-In-Memory Systems"}, {"paperId": "2a47d481636a67bf1edbd2bcd73d823e69bc4c75", "title": "Accelerating Weather Prediction Using Near-Memory Reconfigurable Fabric"}, {"paperId": "8e87c31c9174c254b824910e28b5bf66f274650e", "title": "Benchmarking a New Paradigm: An Experimental Analysis of a Real Processing-in-Memory Architecture"}, {"paperId": "7a210280d4775b1dfb36401a1007ac57602ab1e5", "title": "pLUTo: Enabling Massively Parallel Computation in DRAM via Lookup Tables"}, {"paperId": "7bb6015f45457fdbe3bb39e17dc9cb0786ecd688", "title": "A Modern Primer on Processing in Memory"}, {"paperId": "084809bcb66911c8cef94879311beb96d11bc6a6", "title": "Benchmarking a New Paradigm: Experimental Analysis and Characterization of a Real Processing-in-Memory System"}, {"paperId": "0358743aa728c8913b08247731668cb201d9f8d8", "title": "SwiftRL: Towards Efficient Reinforcement Learning on Real Processing-In-Memory Systems"}]}
