{"paperId": "7b7c8f2f78b17257a0e2742e894e8a8042e58352", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Deviation of Peak Hours for Urban Rail Transit Stations: A Case Study in Xi’an, China", "abstract": "The inconsistencies of passenger flow volume between stations’ peak hours and cities’ peak hours have emerged as a phenomenon in various cities worldwide. Passenger flow forecasting at planning stages can only predict passenger flow volume in city peak hours and for the whole day. For some stations, the highest flow does not occur in the city peak hours, and station scale design is often too small. This study locates the formation mechanism of station peak in which the temporal distribution of the station is the superposition of different temporal distributions of the purpose determined by land-use attributes. Data from 63 stations in Xi’an, China, were then used to present an enlargement coefficient which can change the boarding and alighting volume in city peak hours to a station’s own peak hours. This was done by analyzing the inconsistencies of passenger flow volume between the station’s peak hours and the city’s peak hours. Morning peak deviation coefficient (PDC) and evening PDC were selected as datasets, and stations were classified accordingly. Statistics of land usage for every type of station showed that when the stations were surrounded by developed land, the relationship between the PDC and the commuter travel land proportion was to some extent orderly. More than 90.00% of stations with a proportion of commuter travel land that was more than 0.50 had PDCs under 1.10. All stations with a proportion of commuter travel land that was less than 0.50 had morning PDCs over 1.10. Finally, data from 52 stations in Chongqing, China were used to verify the findings, with the results in Chongqing predominantly corresponding to those in Xi’an.", "venue": "Sustainability", "year": 2019, "fieldsOfStudy": ["Economics"], "publicationTypes": null, "publicationDate": "2019-05-14", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "2112429244", "name": "Lijie Yu"}, {"authorId": "96447370", "name": "Quanquen Chen"}, {"authorId": "2202745736", "name": "Kuanmin Chen"}], "citations": [{"paperId": "ec3769486a1d49edc8d513bdf4b8b4ae1e34ec7d", "title": "Predicting Station-Level Peak Hour Ridership of Metro Considering the Peak Deviation Coefficient"}, {"paperId": "c0368e273560339238263880b39be33a409fb893", "title": "Deviation of peak hours for metro stations based on least square support vector machine"}, {"paperId": "126801b4142d69d0553bd89ef4dfc5c5bb4c9af2", "title": "Multi-Model Attention Fusion Multilayer Perceptron Prediction Method for Subway OD Passenger Flow under COVID-19"}, {"paperId": "2d792910f90bd9b0cb7f4c0bca451b8610505d18", "title": "Nonlinear Model-Based Subway Station-Level Peak-Hour Ridership Estimation Approach in the Context of Peak Deviation"}, {"paperId": "d937f61c34cefbb4789e2e68035352dfd1008bfd", "title": "Improved Approach for Forecasting Extra-Peak Hourly Subway Ridership at Station-Level Based on LASSO"}, {"paperId": "164206151af76132efba6d5b5f1797b309b77710", "title": "Determination of the Peak Hour Ridership of Metro Stations in Xi’an, China Using Geographically-Weighted Regression"}, {"paperId": "162aa667b985903e96cf9a383e46a74bde332a82", "title": "Analysis of the Insertion Angle of Lane-Changing Vehicles in Nearly Saturated Fast Road Segments"}, {"paperId": "b59065135e6c2b71e02a105af82767ffb2450bb8", "title": "Analysis of Prediction Accuracy under the Selection of Optimum Time Granularity in Different Metro Stations"}, {"paperId": "c6e0ea8bf30eddae54828b7835fda613cff8e054", "title": "Passenger Flow Prediction of Urban Rail Transit Based on Time Series Algorithm"}]}
