{"paperId": "7b840c27be8c80c90d96a7e55a271b9376ee71fc", "publicationVenue": null, "title": "Data Marketplaces: Best Practices, Challenges, and Advancements for Embedded Finance", "abstract": "Data leads to knowledge, being considered crucial for running a successful business. Its production is dramatically increasing, generating challenges into identifying what data is worth extracting and what is not. Complementary to the data value, data marketplaces are becoming increasingly popular serving as the sources for additional data. They offer purchasing and selling capabilities for external data, simplifying data sourcing, while enabling users to navigate today's complex data world. Data marketplaces are continuously developed, serving the requirements of individuals and businesses in industries such as healthcare or telecommunications, with the top ones covering individual online activities and financial information. Above all, bank transactions have altered due to digitalization, with most consumers currently employing Embedded Finance (EmFi) applications. Given that the latter can benefit from accessing data from federated data providers in different sectors and transparent value driven approaches, the existence of EmFi data marketplaces is vital. In this manuscript, the FAME project is introduced aiming to launch a federated EmFi data marketplace. It goes beyond current data marketplaces since it supports the EmFi domain that currently lacks dedicated marketplaces, also offering: (i) a federated data catalogue, (ii) a single-entry point authorization/authentication infrastructure, (iii) a decentralized trading and monetization capability, and (iv) a set of EmFi-related trusted and energy-efficient analytics. All the capabilities of the FAME data marketplace are analysed, depicting the current market status and FAME's advancements. The manuscript concludes into the overall vision of FAME, depicting its applicability and future evaluation processes.", "venue": "2023 19th International Conference on Distributed Computing in Smart Systems and the Internet of Things (DCOSS-IoT)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-06-01", "journal": {"name": "2023 19th International Conference on Distributed Computing in Smart Systems and the Internet of Things (DCOSS-IoT)", "pages": "533-540"}, "authors": [{"authorId": "3403940", "name": "Athanasios Kiourtis"}, {"authorId": "3404011", "name": "Argyro Mavrogiorgou"}, {"authorId": "2042705161", "name": "Georgios Makridis"}, {"authorId": "90773902", "name": "G. Fatouros"}, {"authorId": "2247710961", "name": "John Soldatos"}, {"authorId": "1681006", "name": "D. Kyriazis"}], "citations": [{"paperId": "123982fe6e4f082789607952057ced582bb0a225", "title": "Navigating the Data Economy: A Comprehensive Review of Evolution, Impact, and Future Trends"}]}
