{"paperId": "7b99f20582e1ff8899773e7afd13499fb4d53cde", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Micro-level Modularity of Computaion-intensive Programs in Big Data Platforms: A Case Study with Image Data", "abstract": "With the rapid advancement of Big Data platforms such as Hadoop, Spark, and Dataflow, many tools are being developed that are intended to provide end users with an interactive environment for large-scale data analysis (e.g., IQmulus). However, there are challenges using these platforms. For example, developers find it difficult to use these platforms when developing interactive and reusable data analytic tools. One approach to better support interactivity and reusability is the use of microlevel modularisation for computation-intensive tasks, which splits data operations into independent, composable modules. However, modularizing data and computation-intensive tasks into independent components differs from traditional programming, e.g., when accessing large scale data, controlling data-flow among components, and structuring computation logic. In this paper, we present a case study on modularizing real world computationintensive tasks that investigates the impact of modularization on processing large scale image data. To that end, we synthesize image data-processing patterns and propose a unified modular model for the effective implementation of computation-intensive tasks on data-parallel frameworks considering reproducibility, reusability, and customization. We present various insights of using the modularity model based on our experimental results from running image processing tasks on Spark and Hadoop clusters.", "venue": "arXiv.org", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-10-20", "journal": {"name": "ArXiv", "volume": "abs/1910.11125"}, "authors": [{"authorId": "2785515", "name": "A. Mondal"}, {"authorId": "50666808", "name": "B. Roy"}, {"authorId": "1738612", "name": "C. Roy"}, {"authorId": "38558513", "name": "Kevin A. Schneider"}], "citations": [{"paperId": "83a29c498c1ce7e2470e76d01ec0c1affd8d2473", "title": "A Data Management Scheme for Micro-Level Modular Computation-Intensive Programs in Big Data Platforms"}, {"paperId": "85aea81ff3255013a113a08819871e62708495d5", "title": "An Intermediate Data-driven Methodology for Scientific Workflow Management System to Support Reusability"}, {"paperId": "ab514eb118f45585e8d0434cff771fe32a418ae7", "title": "Right to Be Forgotten in the Age of Machine Learning"}]}
