{"paperId": "7b99fc176763a77daaf86ba5917a7d4688ee21a2", "publicationVenue": null, "title": "Recent Advances in Blockchain and Artificial Intelligence Integration: Feasibility Analysis, Research Issues, Applications, Challenges, and Future Work", "abstract": "Blockchain constructs a distributed point-to-point system, which is a secure and verifiable mechanism for decentralized transaction validation and is widely used in financial economy, Internet of +ings, large data, cloud computing, and edge computing. On the other hand, artificial intelligence technology is gradually promoting the intelligent development of various industries. As two promising technologies today, there is a natural advantage in the convergence between blockchain and artificial intelligence technologies. Blockchain makes artificial intelligence more autonomous and credible, and artificial intelligence can prompt blockchain toward intelligence. In this paper, we analyze the combination of blockchain and artificial intelligence from a more comprehensive and three-dimensional point of view. We first introduce the background of artificial intelligence and the concept, characteristics, and key technologies of blockchain and subsequently analyze the feasibility of combining blockchain with artificial intelligence. Next, we summarize the research work on the convergence of blockchain and artificial intelligence in home and overseas within this category. After that, we list some related application scenarios about the convergence of both technologies and also point out existing problems and challenges. Finally, we discuss the future work.", "venue": "Secur. Commun. Networks", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "Secur. Commun. Networks", "pages": "9991535:1-9991535:15", "volume": "2021"}, "authors": [{"authorId": "50317076", "name": "Zhong-Yuan Zhang"}, {"authorId": "2149063776", "name": "Xifei Song"}, {"authorId": "2150801768", "name": "Lei Liu"}, {"authorId": "2116398547", "name": "Jie Yin"}, {"authorId": "2153603378", "name": "Yu Wang"}, {"authorId": "51043175", "name": "Dapeng Lan"}], "citations": [{"paperId": "b43f94922ea02e27eb72cdded976ae4cdc2ff6df", "title": "Intelligent blockchain based attack detection framework for cross-chain transaction"}, {"paperId": "b20a449545a9047523057577ce988ba4a5c3960f", "title": "A Systematic Review of Blockchain Technology Assisted with Artificial Intelligence Technology for Networks and Communication Systems"}, {"paperId": "b20589941cd52d199ba381b92e092ba7fb36d689", "title": "Use of Graph Neural Networks in Aiding Defensive Cyber Operations"}, {"paperId": "65dd6dd986c9ad66332380dfc9b0512353a39a5d", "title": "Machine learning-based ransomware classification of Bitcoin transactions"}, {"paperId": "305e2a4062d3b6221bb91162231bc3ab2bfaa8e6", "title": "AI Enabled Crypto Mining for Electric Vehicle Systems"}, {"paperId": "160a00224181e0c8a160ced7968df33d0b3812a3", "title": "Research on Encryption Technology in \"Internet +\" Big Data Security"}, {"paperId": "257d41df2b48f9ec8ca378f02aec833438af53f4", "title": "Towards a blockchain and machine learning-based framework for decentralised energy management"}, {"paperId": "4bd0aaa2b52bcc5001ef90d390ccbdc8347909d5", "title": "Exploiting Blockchain to Make AI Trustworthy: A Software Development Lifecycle View"}, {"paperId": "4e2d9abf437daa1570cb8b6b8f2f3bcfba0663fd", "title": "Artificial Intelligence in Supply Chain Optimization"}, {"paperId": "95e7cebbd85b1079288b141e3301b421aa73ae91", "title": "Secure Internet of Thing based data communication in blockchain model using novel teaching‐learning optimized fuzzy approach"}, {"paperId": "99165bc38af01cc05f6df5368427a15988e2545f", "title": "Use of blockchain in the agri-food value chain: State of the art in Spain and some lessons from the perspective of public support."}, {"paperId": "714468963edfca120dac7c53e7af7e41d0a1d26d", "title": "A Case Study of How Maersk Adopts Cloud-Based Blockchain Integrated with Machine Learning for Sustainable Practices"}, {"paperId": "50368e45368c9ac390cd39f61c3edf428a0d7a17", "title": "Autonomous Vehicles Security: Challenges and Solutions Using Blockchain and Artificial Intelligence"}, {"paperId": "7e5be8027a389dc83ebe60d56fc339982aae1a60", "title": "Blockchain technology in the AEC industry: Scientometric analysis of research activities"}, {"paperId": "ace740197ba99ea502112b10531d0973febad1ba", "title": "Why Decentralize Deep Learning?"}, {"paperId": "3ff3b1df8f4c2f8b1e5b287dc62e6fe71986f883", "title": "Supply Chain Disruption versus Optimization: A Review on Artificial Intelligence and Blockchain"}, {"paperId": "851ffba8830c745e8ab1db6d9c60fa855eca93d1", "title": "A critical analysis of the integration of blockchain and artificial intelligence for supply chain"}, {"paperId": "e27b6941cecc014ef9f0b6543eb261361c9184bb", "title": "Machine Learning-Based Ransomware Classification of Bitcoin Transactions"}, {"paperId": "5fee0f4d0511c9f9fa17004c360c42c56c522620", "title": "Blockchain technology and software engineering practices: a systematic review of literature using topic modelling approach"}, {"paperId": "040347fe53c9e5b5a3f46cce61b612a37aace281", "title": "Evaluation of Block-chain Transaction Accuracy using Neural Network Model"}, {"paperId": "3f22aa157ffabda90441abe6e6bd24ca69713166", "title": "ComputerBank: A Community-based Computer Donation Platform using Machine Learning and NFT"}, {"paperId": "fac6910f37cd814b9dbb509b1df838f7fa30f453", "title": "Modeling the Enablers to FinTech Innovation in Saudi Arabia: A Hybrid Approach Using ISM and ANP"}, {"paperId": "ffb57d098f22f5372802ffaa61b05b36c1161601", "title": "Energy trading scheme based on consortium blockchain and game theory"}, {"paperId": "5d7ffd363840045090fb260e3195af6b91914ae1", "title": "Privacy‐preserving CNN feature extraction and retrieval over medical images"}, {"paperId": "acbada2e6ef95ecd4fe08f8ad1cdf4e9533e6bb6", "title": "Future Direction of AI in Block-chain for security systems – A Comprehensive Report"}, {"paperId": "4426a309bf3403095b747e7478fe1bf6810ac4b1", "title": "Blockchain-Based Convolutional Neural Network E-Voting Scheme"}, {"paperId": "2b009c02b98c709eb872769cdef49355ff9a2bae", "title": "An analysis of the blockchain and COVID-19 research landscape using a bibliometric study"}, {"paperId": "10863a52a79970a167183bde12a51e544fc27da2", "title": "The Applications of Blockchain in Artificial Intelligence"}]}
