{"paperId": "7baacb7c441416d629cb77859776da35a4ba4c40", "publicationVenue": null, "title": "EXPLORATORY BIG DATA STATISTICAL ANALYSIS THE IMPACT OF PEOPLE LIFE'S CHARACTERISTICS ON THEIR EDUCATIONAL LEVEL", "abstract": "Big data and cloud computing become the most important technologies in the most of fields over the world. That because their wide range of applicability in the main drivers of our life. Education is one of the most significant big data application area. Although there are many researches of analyzing big data in education sector as tools, performance and methods of teaching and how to enhancement them in all levels of education, there is absence of studies for applying big data analysis in census education data to study the impact of other people life's characteristics on their educational level. This research paper introduces exploratory big data analysis methods for categorical variables using python language to analyze the educational data in Egypt census (2017), and discuss the relations between educational data features as indicators of educational levels of Egyptians in the future. The implementation of exploratory big data analysis module (EBDA) displayed in this paper and the regression model used as a traditional statistical method to categorical data analysis Also, there is comparison between two results. This exploration of data analysis considered as the step for predictions, suggestions and recommendations of enhancement people educational level.", "venue": "", "year": null, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "123138287", "name": "Salwa Zaki"}, {"authorId": "2256449633", "name": "Abd Elhady"}, {"authorId": "1707709", "name": "Neveen I. Ghali"}, {"authorId": "2191339794", "name": "Afaf Abo-Elfetoh"}, {"authorId": "3371301", "name": "A. Idrees"}], "citations": [{"paperId": "529a21a1ad1218feafa31df4b4de5d4e96469f0d", "title": "Analysis Of Mining Algorithms for Patterns of Frequent Item sets and Hidden"}, {"paperId": "f0871d54d6b3b95c79b0f16556d1503f1ef41b6d", "title": "BUY NOW PAY LATER SERVICES ON GENERATION Z: EXPLORATORY DATA ANALYSIS USING MACHINE LEARNING"}, {"paperId": "9df8c7d4ee81f396f74a7963b97209a73abc1a44", "title": "PROPOSED APPROACH FOR ACADEMIC PAPER RANKING BASED ON BIG DATA AND GRAPH ANALYTICS"}]}
