{"paperId": "7bc98e778c142cbe8ba109685157593248f96399", "publicationVenue": {"id": "2216cafa-e724-48f0-a497-f46a99605f1e", "name": "Land", "type": "journal", "issn": "2073-445X", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-321184", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-321184", "https://www.mdpi.com/journal/land"]}, "title": "Landslide Susceptibility Mapping Based on Resampling Method and FR-CNN: A Case Study of Changdu", "abstract": "Deep learning can extract complex and high-dimensional characteristic information with its deep structure, effectively exploring the complex relationship between landslides and their numerous influencing factors, and ultimately, more accurately predict future landslide disasters. This study builds a landslide susceptibility mapping (LSM) method based on deep learning, compares the frequency ratio (FR) sampling method with a buffer random sampling method, and performs resampling operations of landslide and non-landslide samples to explore the applicability of deep learning in LSM. In addition, six indices, precision, accuracy, recall, ROC, and the harmonic mean F1 of accuracy and recall were selected for quantitative comparison. The results show that both the resampling method proposed in this paper and the non-landslide sample selection method based on FR can significantly improve the accuracy of the model, with the area under curve (AUC) increasing by 1.34–8.82% and 3.98–7.20%, respectively, and the AUC value can be improved by 5.32–9.66% by combining the FR selection and resampling methods. Furthermore, all the deep learning models constructed in this study can obtain accurate and reliable landslide susceptibility analysis results compared to traditional models.", "venue": "Land", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-11", "journal": {"name": "Land"}, "authors": [{"authorId": "2185160976", "name": "Zili Qin"}, {"authorId": "51216785", "name": "Xinyao Zhou"}, {"authorId": "2145711830", "name": "Mengyao Li"}, {"authorId": "2204163736", "name": "Yuanxin Tong"}, {"authorId": "50052163", "name": "Hongxia Luo"}], "citations": [{"paperId": "7b34722518389d50d97723db1400dbf5835b7f9f", "title": "Effects of non-landslide sampling strategies on machine learning models in landslide susceptibility mapping"}, {"paperId": "c8e1e2c6d4314f3172adc0164ebcacd900a3cc9d", "title": "A Comparison of Different Machine Learning Methods to Reconstruct Daily Evapotranspiration Time Series Estimated by Thermal–Infrared Remote Sensing"}]}
