{"paperId": "7bc9b50707546270fbe67c3e0a953075ff7f29a3", "publicationVenue": {"id": "f01cecb2-2e15-44d4-97ce-2575886e7d01", "name": "World Journal of Gastroenterology", "type": "journal", "alternate_names": ["World J Gastroenterol"], "issn": "1007-9327", "alternate_issns": ["2219-2840"], "url": "https://www.wjgnet.com/", "alternate_urls": ["https://www.wjgnet.com/1007-9327/", "http://www.wjgnet.com/", "http://www.wjgnet.com/1007-9327/wj.htm"]}, "title": "Artificial intelligence in gastroenterology: A state-of-the-art review", "abstract": "The development of artificial intelligence (AI) has increased dramatically in the last 20 years, with clinical applications progressively being explored for most of the medical specialties. The field of gastroenterology and hepatology, substantially reliant on vast amounts of imaging studies, is not an exception. The clinical applications of AI systems in this field include the identification of premalignant or malignant lesions (e.g., identification of dysplasia or esophageal adenocarcinoma in Barrett’s esophagus, pancreatic malignancies), detection of lesions (e.g., polyp identification and classification, small-bowel bleeding lesion on capsule endoscopy, pancreatic cystic lesions), development of objective scoring systems for risk stratification, predicting disease prognosis or treatment response [e.g., determining survival in patients post-resection of hepatocellular carcinoma), determining which patients with inflammatory bowel disease (IBD) will benefit from biologic therapy], or evaluation of metrics such as bowel preparation score or quality of endoscopic examination. The objective of this comprehensive review is to analyze the available AI-related studies pertaining to the entirety of the gastrointestinal tract, including the upper, middle and lower tracts; IBD; the hepatobiliary system; and the pancreas, discussing the findings and clinical applications, as well as outlining the current limitations and future directions in this field.", "venue": "World Journal of Gastroenterology", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2021-10-28", "journal": {"name": "World Journal of Gastroenterology", "pages": "6794 - 6824", "volume": "27"}, "authors": [{"authorId": "16023117", "name": "P. Kröner"}, {"authorId": "2016778692", "name": "M. Engels"}, {"authorId": "2121562557", "name": "B. Glicksberg"}, {"authorId": "10776200", "name": "Kipp W. Johnson"}, {"authorId": "2092033223", "name": "Obaie Mzaik"}, {"authorId": "48560011", "name": "J. V. van Hooft"}, {"authorId": "1991161", "name": "M. Wallace"}, {"authorId": "1397980564", "name": "H. El‐Serag"}, {"authorId": "8633608", "name": "C. Krittanawong"}], "citations": [{"paperId": "71e32ddaefde8968e6111dbb4af656f13c511c73", "title": "Current Developments and Role of Intestinal Ultrasound including the Advent of AI"}, {"paperId": "914f37380db265a7003d213ecdb2c4b5588aecb3", "title": "Development of an Artificial Intelligence Model for the Classification of Gastric Carcinoma Stages Using Pathology Slides"}, {"paperId": "0c4838327fd05ec288b5534e508098b805e6df93", "title": "Value of magnetic resonance imaging radiomics features in predicting histologic grade of invasive ductal carcinoma of the breast."}, {"paperId": "c84e9853fae928375b2237175ccf1d7586cf5213", "title": "The Role of Artificial Intelligence in Colonoscopy"}, {"paperId": "5af2040c4b17800f848a7d0ff9a0629d1abde227", "title": "Understanding the Landscape: The Emergence of Artificial Intelligence (AI), ChatGPT, and Google Bard in Gastroenterology"}, {"paperId": "61bf7c53d8b02edf233fa0a6ee79821eca2043cc", "title": "LiveBoost: A GB-based prediction system for liver fibrosis in chronic hepatitis B patients in China - A multi-center retrospective study"}, {"paperId": "5edc904ce96ff2648a84251b6af7867f03b877f9", "title": "Personalized Medicine in Urolithiasis: AI Chatbot-Assisted Dietary Management of Oxalate for Kidney Stone Prevention"}, {"paperId": "3f7b51007ab5ae1ffa42c9d2240b349eba2f4c94", "title": "The future implementation of artificial intelligence technology in esophageal surgery"}, {"paperId": "eb63337b3cc72e7cf110d2ac24252cef8b6dc65d", "title": "Modeling the influence of attitudes, trust, and beliefs on endoscopists’ acceptance of artificial intelligence applications in medical practice"}, {"paperId": "6027e14842ac6be468bae982c7256b15b97dea78", "title": "Pancreatic Ductal Adenocarcinoma: Update of CT-Based Radiomics Applications in the Pre-Surgical Prediction of the Risk of Post-Operative Fistula, Resectability Status and Prognosis"}, {"paperId": "54db54f9d7acf932ffdd1b0a29f0d8328e135c59", "title": "Multidisciplinary approach and diagnostic difficulties in esophageal adenocarcinoma: a case report"}, {"paperId": "92e4feec080e73a9fcc92a33dea6a319cb1d3f90", "title": "Recent advances in devices and technologies that might prove revolutionary for colonoscopy procedures"}, {"paperId": "1531e169ef81752ce21173144c8894748e5c0e2e", "title": "The Impact of Artificial Intelligence in Improving Polyp and Adenoma Detection Rate During Colonoscopy: Systematic-Review and Meta-Analysis"}, {"paperId": "83a6941f14370513018956bfa04087567c08b795", "title": "Operating Artificial Intelligence to Assist Physicians Diagnose Medical Images: A Narrative Review"}, {"paperId": "7e3bffa4621d2570251c58db551253f19ce528da", "title": "Role of artificial intelligence in Barrett’s esophagus"}, {"paperId": "3be0665925e82024f237bd959a2912d80435f403", "title": "Application value of an artificial intelligence-based diagnosis and recognition system in gastroscopy training for graduate students in gastroenterology: a preliminary study."}, {"paperId": "295dc873de03e817e0355e6b7789baf235e4e83d", "title": "Enhancing the Evidence with Algorithms: How Artificial Intelligence Is Transforming Forensic Medicine"}, {"paperId": "efcf4854f7c381c5364bf3e197fd3910bd90125c", "title": "The Role of Artificial Intelligence and Machine Learning in Assisted Reproductive Technologies."}, {"paperId": "4c12e115bfd912938ec8957b869ac9f80ce6a830", "title": "The importance of predicting patient responses to monoclonal antibodies for Crohn’s disease"}, {"paperId": "012d5942a34ec8e530f7f7d411a1527e2cbe3d07", "title": "Use of artificial intelligence in diagnostic cystoscopy of bladder cancer"}, {"paperId": "bfebf42c3dca0fb48b4ff641cb3a9a0f512f4cff", "title": "Advancing Patient Care: How Artificial Intelligence Is Transforming Healthcare"}, {"paperId": "45509813380a4122924f5283db46a174a256599b", "title": "Diagnostic accuracy of artificial intelligence-aided capsule endoscopy (TOP100) in overt small bowel bleeding"}, {"paperId": "f0c5a0dd2cb1d55b370e10b1c4cc37afd1f087de", "title": "Risk Perception, Acceptance, and Trust of Using Artificial Intelligence in Gastroenterology Practice: Survey from the Asia Pacific Region (Preprint)"}, {"paperId": "ad038f30d9c4988640524399e752a87eff170a85", "title": "Leveraging the Academic Artificial Intelligence Silecosystem to Advance the Community Oncology Enterprise"}, {"paperId": "8ad873127b93c1a24955a49c21c9ad369c5e8cf3", "title": "Convolutional Neural Networks for Optical Discrimination Between Histological Types of Colorectal Polyps Based on White Light Endoscopic Images"}, {"paperId": "b64a236479320a6ca9087a4dfd0a928540b91232", "title": "Artificial Intelligence in Colonoscopy"}, {"paperId": "7a8add31802173af1f3d6959a6be4a3dc8054840", "title": "Cost-effectiveness of Artificial Intelligence-Aided Colonoscopy for Adenoma Detection in Colon Cancer Screening"}, {"paperId": "cbdf62eb9587d773d226fe43ba2fd8ae363f3d6a", "title": "Gastrointestinal Bleeding in Children: Current Management, Controversies, and Advances."}, {"paperId": "d28684e20eb293ea5341f4652953ba5b52377040", "title": "Upskilling Pediatric Ileocolonoscopy."}, {"paperId": "1281b3195c813b0405bee275cbd185a74891af58", "title": "Implications of Artificial Intelligence Algorithms in the Diagnosis and Treatment of Motor Neuron Diseases—A Review"}, {"paperId": "9f1d4ee30949452f8b40497a2d9d819e71c6ba4f", "title": "Real-Time Computer-Aided Polyp and Adenoma Detection During Screening Colonoscopy In Expert And Non-Expert Endoscopists: A Single Center Study"}, {"paperId": "767c4845cd5e973f40a383addeb91cf9c38c73cc", "title": "Artificial Intelligence in Medicine and Dentistry"}, {"paperId": "6504cc677718bd7341d6568a8b8ab51ba83fa9cb", "title": "Study on brain function of the frontal lobe in patients with functional gastroduodenal disease by near-infrared functional imaging."}, {"paperId": "d838a7907edbd59697634e59ba1db137aa900002", "title": "Advances in Analgosedation and Periprocedural Care for Gastrointestinal Endoscopy"}, {"paperId": "1c05aa5d8b11b70db963283bfd18186ae04fa24c", "title": "Artificial Intelligence—The Rising Star in the Field of Gastroenterology and Hepatology"}, {"paperId": "8232564fd5670404339288c0479bb400e2124a7e", "title": "The Use of Artificial Intelligence in the Diagnosis and Classification of Thyroid Nodules: An Update"}, {"paperId": "712b46e0e9949face53bc69774113d71cb52e8bb", "title": "Achalasia, from diagnosis to treatment"}, {"paperId": "5a6d97f7162a41679310c02253043a45c525d1f3", "title": "Barrett’s Esophagus: An Updated Review"}, {"paperId": "40044a3e6cf5c4e869c21f59d20e343db8dfea41", "title": "Artificial intelligence in gastroenterology: A narrative review"}, {"paperId": "3e2ed5005a22d6c2796f78fe59b9028ad466a9d1", "title": "Convolutional neural network based anatomical site identification for laryngoscopy quality control: A multicenter study."}, {"paperId": "8fcce697d024ed520574c1ecf0557bce4ed36b07", "title": "Using of artificial intelligence: Current and future applications in colorectal cancer screening"}, {"paperId": "360a47f8df8274356e6821bbf646c252c662fc34", "title": "Artificial intelligence using advanced imaging techniques and cholangiocarcinoma: Recent advances and future direction"}, {"paperId": "7bc75f9f44b0acc9bd15704b1a3c5ed0a0b81609", "title": "Advances and horizons for artificial intelligence of endoscopic screening and surveillance of gastric and esophageal disease"}, {"paperId": "132180ab163728ec27f51fb24c471a089c8d4a24", "title": "Deep Learning Staging of Liver Iron Content From Multiecho MR Images"}, {"paperId": "6d36d7fccde246e1288395cd807d50a350dd4f3d", "title": "Application Status and Prospects of Artificial Intelligence in Peptic Ulcers"}, {"paperId": "b1f1bbd603d18de40e9c8603a7e476b6dcd82f7e", "title": "Performance of a Deep Learning System for Automatic Diagnosis of Protruding Lesions in Colon Capsule Endoscopy"}, {"paperId": "00684f29561f9e5edf289e279ccf7b9923997540", "title": "Comment on “Artificial intelligence in gastroenterology: A state-of-the-art review”"}, {"paperId": "94bbf972329543665effab8db5beb32d8ad7afd6", "title": "Could artificial intelligence replace fine-needle aspiration in endoscopic ultrasound?"}, {"paperId": "28319158e7146a3efb03102144ae0c3db89fdc6b", "title": "Artificial Intelligence in Medical Imaging"}, {"paperId": "4ca489b0aaff2607c9ddbf5e0ab46892b5617a1d", "title": "Artificial Intelligence in"}, {"paperId": "7b615e3cf93427f34e4bf2be2c8b8b3adab90dce", "title": "Risk Perception, Acceptance, and Trust of Using AI in Gastroenterology Practice in the Asia-Pacific Region: Web-Based Survey Study"}]}
