{"paperId": "7bcd70ad01a8ea93f243aacbf558fc5a5fa9d117", "publicationVenue": {"id": "228761ec-c40a-479b-8309-9dcbe9851bcd", "name": "IEEE Internet of Things Journal", "type": "journal", "alternate_names": ["IEEE Internet Thing J"], "issn": "2327-4662", "url": "https://www.ieee.org/membership-catalog/productdetail/showProductDetailPage.html?product=PER288-ELE", "alternate_urls": ["https://ieeexplore.ieee.org/servlet/opac?punumber=6488907", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6488907", "http://ieee-iotj.org/#"]}, "title": "SmartFilter: An Edge System for Real-Time Application-Guided Video Frames Filtering", "abstract": "Given the limited bandwidth available in distributed camera systems, it is nearly impossible for cameras to transmit their entire feed to the server in real time. Furthermore, as the number of camera units increases, the processing overheads on the server also increase, resulting in excessive latencies. This article introduces SmartFilter, a new Edge-to-Cloud filtering solution for video analytics. SmartFilter exploits the feedbacks from the running server-side application to filter directly on the camera, frames that are likely to produce the same application result as the previously offloaded ones. Because of its unique filtering mechanism, SmartFilter improves the system’s throughput, latency, and network usage and reduces the server’s processing overhead while maintaining the overall accuracy. SmartFilter is typically a fast and lightweight binary classifier that examines changes within frames to decide when these changes are significant enough to alter the application output. Experiments with various video data sets and in a real-world scenario demonstrate that our solution can achieve 40 FPS on a commodity camera while delivering a filtering efficiency of more than 90%.", "venue": "IEEE Internet of Things Journal", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-12-01", "journal": {"name": "IEEE Internet of Things Journal", "pages": "23772-23785", "volume": "9"}, "authors": [{"authorId": "1411295963", "name": "Jude Tchaye-Kondi"}, {"authorId": "2779198", "name": "Yanlong Zhai"}, {"authorId": "2143669121", "name": "Jun Shen"}, {"authorId": "2111831372", "name": "D. Lu"}, {"authorId": "1692039", "name": "Liehuang Zhu"}], "citations": [{"paperId": "c983190594d4b39448a43a1307d78c37992c857b", "title": "Underprovisioned GPUs: On Sufficient Capacity for Real-Time Mission-Critical Perception"}, {"paperId": "ad020c3b49bc7cb1999815f7fe5f2b33fe0b0c48", "title": "Multitask Scheduling of Computer Vision Workload on Edge Graphical Processing Units"}, {"paperId": "52635c56951b90362d6b96a08444a67d6f29f918", "title": "Performance Evaluation of Edge Computing-Aided IoT Augmented Reality Systems"}]}
