{"paperId": "7becb9226f4bc2b0e8761834ddadc257b1f88340", "publicationVenue": null, "title": "A Survey On Secure Architectures Using Hash Function Based On FPGA for Block Chain Enabled IoT Devices", "abstract": "Currently, a large number of cryptographic techniques have been developed to safeguard users’ original data. In a variety of applications, cryptographic hash functions are employed to safeguard the validity and integrity of data. The most crucial primitive for data integrity and authentication is the hash function (HF) security. A cryptographic hash function serves as the foundation of the blockchain technology, which is built on cryptographic principles. Due to its recent integration with Internet of Things (IoT) technology in different fields, blockchain is gaining popularity. Therefore, it remains difficult to deploy existing blockchain technology. Due to their low power consumption and high performance, Application Specific Integrated Circuits (ASICs) have served as the primary substrate for lightweight cryptography up to this point and only used in high volume applications because to their lengthy design cycle and extremely expensive non-recurring engineering costs. The power consumption difference between ASICs and FPGAs has started to close in recent years thanks to the development of high-power, low-cost Field Programmable Gate Arrays (FPGAs). This research provided an analytical assessment of secure designs for block chain enabled Internet of Things devices employing hash functions based on FPGA while taking into account high speed and small-area hardware architectures.", "venue": "2023 11th International Conference on Emerging Trends in Engineering & Technology - Signal and Information Processing (ICETET - SIP)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference", "Review"], "publicationDate": "2023-04-28", "journal": {"name": "2023 11th International Conference on Emerging Trends in Engineering & Technology - Signal and Information Processing (ICETET - SIP)", "pages": "1-6"}, "authors": [{"authorId": "70315570", "name": "Preeti R. Lawhale"}, {"authorId": "152697899", "name": "S. Kale"}], "citations": []}
