{"paperId": "7becd4eb01c1ef491edda67b19c2a386d4126dee", "publicationVenue": {"id": "7fca7065-fa6f-490b-923e-3ffc07857f1c", "name": "IEEE Transactions on Cloud Computing", "type": "journal", "alternate_names": ["IEEE Trans Cloud Comput"], "issn": "2168-7161", "url": "https://www.computer.org/web/tcc", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6245519"]}, "title": "Interactive Visualization of Large Turbulent Flow as a Cloud Service", "abstract": "Many scientific communities today have community datasets that are continuously created, curated, and maintained for community use. Such datasets are often hosted and shared through cloud-based data repositories. In this work, we propose a lightweight and affordable visualization cloud service that can be deployed as a companion service of a community dataset. Our target visualization use case is parallel flow visualization, which is crucial for understanding planet-scale phenomena such as the Earth’s atmosphere and ocean. As a core research topic of scientific visualization, parallel flow visualization typically uses HPC computing platforms. It is complex to implement with scalability, deploy with efficiency, and is often considered an advanced form of scientific visualization. Because of the heterogeneous nature of cloud platforms, in this work, we use a swarm-based parallel design to replace traditional HPC designs that assume homogeneity and rely upon conventional methods such as Message Passing Interface (MPI). This design enables interactive visualization of large flow fields in a way that is lightweight, efficient and easily deployable as a cloud service. We demonstrate our proposed system using NOAA’s NCEP ensemble data, which captures turbulent planet-scale atmospheric flows in observed forms, as well as in forecast forms for varying time scales. We evaluate the performance and efficacies of our system on Amazon Web Services (AWS) for three use cases, where remote users can use their laptops to (i) interactively explore global atmospheric flow patterns in general, (ii) to specifically compare how a forecast is different from the observation, and (iii) to explore flow patterns in a typical information visualization dashboard.", "venue": "IEEE Transactions on Cloud Computing", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-01-01", "journal": {"name": "IEEE Transactions on Cloud Computing", "pages": "263-277", "volume": "11"}, "authors": [{"authorId": "47468170", "name": "Tanner Hobson"}, {"authorId": "1699379", "name": "J. Hammer"}, {"authorId": "2121325793", "name": "Preston Provins"}, {"authorId": "2144452426", "name": "Jian Huang"}], "citations": [{"paperId": "5c58c4cf2cf02a35c99415199316c543306be0ef", "title": "Visualizing and Evaluating Microbubbles in Multiphase Flow Applications"}]}
