{"paperId": "7bfa5b7748f36987fd1b5a28dc7d2d754fed7718", "publicationVenue": {"id": "b74a2620-354a-4c74-9103-1a44d3a71e48", "name": "International Journal of Cloud Computing", "type": "journal", "alternate_names": ["Int J Cloud Comput"], "issn": "2043-9989", "url": "http://www.inderscience.com/ijcc"}, "title": "A survey of scheduling frameworks in big data systems", "abstract": "Cloud and big data technologies are now converging to enable organizations to outsource data in the cloud and get value from data through big data analytics. Big data systems typically exploit computer clusters to gain scalability and obtain a good cost-performance ratio. However, scheduling a workload in a computer cluster remains a well-known open problem. Scheduling methods are typically implemented in a scheduling framework and may have different objectives. In this paper, we survey scheduling methods and frameworks for big data systems, propose a taxonomy and analyze the features of the different categories of scheduling frameworks. These frameworks have been designed initially for the cloud (MapReduce) to process Web data. We examine sixteen popular scheduling frameworks and discuss their features. Our study shows that different frameworks are proposed for different big data systems, different scales of computer clusters and different objectives. We propose the main dimensions for workloads and metrics for benchmarks to evaluate these scheduling frameworks. Finally, we analyze their limitations and propose new research directions.", "venue": "International Journal of Cloud Computing", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2018-08-06", "journal": {"name": "Int. J. Cloud Comput.", "pages": "103-128", "volume": "7"}, "authors": [{"authorId": "2108410330", "name": "Ji Liu"}, {"authorId": "1685125", "name": "Esther Pacitti"}, {"authorId": "144255847", "name": "P. Valduriez"}], "citations": [{"paperId": "50cc6ca1092e34cf286d0d9f0136fbb6c2dc3bfb", "title": "Mapping tree‐shaped workflows on systems with different memory sizes and processor speeds"}, {"paperId": "d5c0d9f1e04441c5b429498d7c9682915b90cc85", "title": "An Adaptive RPC Mechanism for Performance and Node Fault Tolerance Optimization in HDFS"}, {"paperId": "dd131d2937b46e2790ff67241886e8be9efcce38", "title": "PAS: Performance-Aware Job Scheduling for Big Data Processing Systems"}, {"paperId": "02947b09d4a8fe42bcaad5cb5efa2ffb8ec3f270", "title": "An Auto Optimized Payment Service Requests Scheduling Algorithm via Data Analytics through Machine Learning"}, {"paperId": "2df5a82ced15a92536723ceae61c4d985857793c", "title": "ImRP: A Predictive Partition Method for Data Skew Alleviation in Spark Streaming Environment"}, {"paperId": "a8bf6d64b3e267c4a3a8f4e1d6640f2b0cd85530", "title": "Job scheduler for streaming applications in heterogeneous distributed processing systems"}, {"paperId": "456c011594ecacdd24298a161787389ccbe4b88b", "title": "Big Data Service Architecture: A Survey"}, {"paperId": "a798f39547eed9e483322b03e3ea727bd99058a0", "title": "Orchestrating Big Data Analysis Workflows in the Cloud"}, {"paperId": "60cc516ff57c9f370aee5ce9cf54d6d5fb1cfdff", "title": "Insights from big Data Analytics in supply chain management: an all-inclusive literature review using the SCOR model"}, {"paperId": "a6b1c6a8b4cca54d9c55fcac71d8769d646e3703", "title": "Data-Intensive Workflow Management: For Clouds and Data-Intensive and Scalable Computing Environments"}, {"paperId": "778338bf2f76896c0b83e7f8f7f38687e165177c", "title": "A Survey on Global Management View: Toward Combining System Monitoring, Resource Management, and Load Prediction"}, {"paperId": "15597fc0677be6615ff7b067cf1da9b0d87fb772", "title": "TrIMS: Transparent and Isolated Model Sharing for Low Latency Deep Learning Inference in Function-as-a-Service"}, {"paperId": "773174429ea85dcedb4167a5700b8d88538e0a59", "title": "An MDA Approach Based on UML and ODM Standards to Support Big Data Analytics Regarding Ontology Development"}, {"paperId": "2bff634eaa9cbadf0f9e4c7a816b0fc631b286d0", "title": "Parallel computation of PDFs on big spatial data using Spark"}, {"paperId": "6c5eb76e307009bc3ae62afe10663e75fda12af6", "title": "Mapping Tree-Shaped Workflows on Memory-Heterogeneous Architectures"}, {"paperId": "108bbe134909a097c76cae222884268329b9cfe5", "title": "An Automatic Generation of Domain Ontologies Based on an MDA Approach to Support Big Data Analytics"}, {"paperId": "cf17d712c76ccc151badc2872ea49f7d80c79a7d", "title": "A Review of Dynamic Scalability and Dynamic Scheduling in Cloud-Native Distributed Stream Processing Systems"}, {"paperId": "e4f2ab9c81fa053f8ab9a85a2c147df025b8fcd5", "title": "Processing of association rules with ontology in distributed NoSQL systems"}]}
