{"paperId": "7bfd45294c5f6b5a0b23574aaffc37754b8e0ce9", "publicationVenue": {"id": "f6752838-f268-4a1b-87e7-c5f30a36713c", "name": "International Conference on Machine Learning and Applications", "type": "conference", "alternate_names": ["Int Conf Mach Learn Appl", "ICMLA"], "url": "http://www.icmla-conference.org/"}, "title": "CSNNs: Unsupervised, Backpropagation-Free Convolutional Neural Networks for Representation Learning", "abstract": "This work combines Convolutional Neural Networks (CNNs), clustering via Self-Organizing Maps (SOMs) and Hebbian Learning to propose the building blocks of Convolutional Self-Organizing Neural Networks (CSNNs), which learn representations in an unsupervised and Backpropagation-free manner. Our approach replaces the learning of traditional convolutional layers from CNNs with the competitive learning procedure of SOMs and simultaneously learns local masks between those layers with separate Hebbian-like learning rules to overcome the problem of disentangling factors of variation when filters are learned through clustering. We investigate the learned representation by designing two simple models with our building blocks, achieving comparable performance to many methods which use Backpropagation, while we reach comparable performance on Cifar10 and give baseline performances on Cifar100, Tiny ImageNet and a small subset of ImageNet for Backpropagation-free methods.", "venue": "International Conference on Machine Learning and Applications", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-12-01", "journal": {"name": "2019 18th IEEE International Conference On Machine Learning And Applications (ICMLA)", "pages": "1613-1620"}, "authors": [{"authorId": "1490942327", "name": "Bonifaz Stuhr"}, {"authorId": "32522952", "name": "Jürgen Brauer"}], "citations": [{"paperId": "dee626dcedf3686399294cb1ce707f1ecda89e29", "title": "Hebbian Deep Learning Without Feedback"}, {"paperId": "7cc66d8d610bdcfef9971d01af848b5d88ebf895", "title": "AN INTEGRATED MODEL FOR PRECEDING VEHICLE TARGET DETECTION AND LOCATION BASED ON DEEP VISION"}, {"paperId": "01c04b7bec696492a0355ec93de63faea943276b", "title": "Deep Learning Self-Organizing Map of Convolutional Layers"}, {"paperId": "b2a600905e9340beac843aba2b36144246582630", "title": "Don’t miss the mismatch: investigating the objective function mismatch for unsupervised representation learning"}, {"paperId": "2b80895d9401d93bfed983422c328fa8a384f909", "title": "Solving the Feature Diversity Problem Based on Multi-Model Scheme"}]}
