{"paperId": "7c067cd8c5ae5a0db9d40c02d30e6adae5cfcd00", "publicationVenue": null, "title": "Investigating the Regression Analysis Results for Classification in Test Case Prioritization: A Replicated Study", "abstract": "Research classification of software modules was done to validate the approaches proposed for addressing limitations in existing classification approaches. The objective of this study was to replicate the experiments of a recently published research study and re-evaluate its results. The reason to repeat the experiment(s) and re-evaluate the results was to verify the approach to identify the faulty and non-faulty modules applied in the original study for the prioritization of test cases. As a methodology, we conducted this study to re-evaluate the results of the study. The results showed that binary logistic regression analysis remains helpful for researchers for predictions, as it provides an overall prediction of accuracy in percentage. Our study shows a prediction accuracy of 92.9% for the PureMVC Java open source program, while the original study showed an 82% prediction accuracy for the same Java program classes. It is believed by the authors that future research can refine the criteria used to classify classes of web systems written in various programming languages based on the results of this study.", "venue": "", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": null, "journal": {"name": "", "pages": "1-10", "volume": "11"}, "authors": [{"authorId": "145266289", "name": "Muhammad Hasnain"}, {"authorId": "1910416", "name": "I. Ghani"}, {"authorId": "1801924", "name": "M. F. Pasha"}, {"authorId": "1571964099", "name": "Ishrat Hayat Malik"}, {"authorId": "2113570201", "name": "S. Malik"}], "citations": [{"paperId": "595439562dd9c13dac227dbc943faceabb2c95e9", "title": "Lessons learned from replicating a study on information-retrieval-based test case prioritization"}, {"paperId": "e1c9ec3ef33448c72f6f3a88e995a310c002481f", "title": "Trend Application of Machine Learning in Test Case Prioritization: A Review on Techniques"}]}
