{"paperId": "7c29355731754afe5d0f440ae5c34d933681f0be", "publicationVenue": {"id": "60275282-b076-42f7-99dc-8757c2064681", "name": "Informatics", "type": "journal", "alternate_names": ["Informatics (basel", "Informatics (Basel)"], "issn": "2227-9709", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-390272", "alternate_urls": ["https://www.mdpi.com/journal/informatics", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-390272"]}, "title": "Academic Activities Recommendation System for Sustainable Education in the Age of COVID-19", "abstract": "Currently, universities are going through a critical moment due to the coronavirus disease in 2019. To prevent its spread, countries have declared quarantines and isolation in all sectors of society. This has caused many problems in the learning of students, since, when moving from a face-to-face educational model to a remote model, several academic factors such as psychological, financial, and methodological have been overlooked. To exactly identify the variables and causes that affect learning, in this work a data analysis model using a Hadoop framework is proposed. By processing the data, it is possible to identify and classify students to determine the problems they present in different learning activities. The results are used by an artificial intelligence system that takes student information and converts it into knowledge, evaluates the academic performance problems they present, and determines what type of activity aligns with the students. The artificial intelligence system processes the information and recommends activities that focus on each student’s abilities and needs. The integration of these systems to universities creates an adaptive educational model that responds to the new challenges of society.", "venue": "Informatics", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-04-20", "journal": {"name": "Informatics", "pages": "29", "volume": "8"}, "authors": [{"authorId": "1410234504", "name": "W. Villegas-Ch."}, {"authorId": "2089421683", "name": "Santiago Sánchez-Viteri"}, {"authorId": "103754310", "name": "Milton Román Cañizares"}], "citations": [{"paperId": "0d9627191bec879b5d99a390b9884c89d6b32f5b", "title": "Administrative Management and Teaching Process of Teachers in Public Universities"}, {"paperId": "afd2bdcb21825da52f3b5b021a0b8742efae014d", "title": "The next big thing: role of ChatGPT in personal knowledge management challenges and opportunities for knowledge workers across diverse disciplines"}, {"paperId": "2f6f13732a3710db88a4fc4b95dd52f75c096404", "title": "Educational technology: Exploring the convergence of technology and pedagogy through mobility, interactivity, AI, and learning tools"}, {"paperId": "4858fa952d9e313ba58febafcf9c82b1bcf2ddb3", "title": "Revolutionizing education with AI: Exploring the transformative potential of ChatGPT"}, {"paperId": "fe216bf9d93dab5673aee492ec0c0732f71f5eb1", "title": "Systematic literature review on opportunities, challenges, and future research recommendations of artificial intelligence in education"}, {"paperId": "3497ffe43371469641abd3c90c8922fca375819f", "title": "Supporting Meteorologists in Data Analysis through Knowledge-Based Recommendations"}, {"paperId": "3cc62b3bb01b24aec1016a9a4ab055208d6327f3", "title": "Identification of the Consequences of COVID-19 through the Analysis of Data Obtained in Surveys of a Specific Population"}, {"paperId": "034381d5f34782ef22b15678cb2f9e8737f7b02d", "title": "Intelligent Academic Specialties Selection in Higher Education for Ukrainian Entrants: A Recommendation System"}]}
