{"paperId": "7c44b4575aaa9d8e0380cb2f095f7291464fb453", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "A Novel Approach to Topological Graph Theory with R-K Diagrams and Gravitational Wave Analysis", "abstract": "Graph Theory and Topological Data Analytics, while powerful, have many drawbacks related to their sensitivity and consistency with TDA&Graph Network Analytics. In this paper, we aim to propose a novel approach for encoding vectorized associations between data points for the purpose of enabling smooth transitions between Graph and Topological Data Analytics. We conclusively reveal effective ways of converting such vectorized associations to simplicial complexes representing micro-states in a Phase-Space, resulting in filter specific, homotopic self-expressive, event-driven unique topological signatures which we have referred as Roy-Kesselman Diagrams or R-K Diagrams with persistent homology, which emerge from filter-based encodings of R-K Models. The validity and impact of this approach were tested specifically on high-dimensional raw and derived measures of Gravitational Wave Data from the latest LIGO datasets published by the LIGO Open Science Centre along with testing a generalized approach for a non-scientific use-case, which has been demonstrated using the Tableau Superstore Sales dataset. We believe the findings of our work will lay the foundation for many future scientific and engineering applications of stable, high-dimensional data analysis with the combined effectiveness of Topological Graph Theory transformations.", "venue": "arXiv.org", "year": 2021, "fieldsOfStudy": ["Physics", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-12-14", "journal": {"name": "ArXiv", "volume": "abs/2201.06923"}, "authors": [{"authorId": "2153931748", "name": "Animikh Roy"}, {"authorId": "123541011", "name": "Andor Kesselman"}], "citations": []}
