{"paperId": "7c4697f50fb9a7720940811c88672b636ab3bcd5", "publicationVenue": {"id": "a18bc17b-a45d-4087-a9cf-9a56dd12d92c", "name": "United European Gastroenterology journal", "type": "journal", "alternate_names": ["United Eur gastroenterol j", "United Eur Gastroenterol j", "United European gastroenterology journal"], "issn": "2050-6406", "url": "https://journals.sagepub.com/loi/ueg", "alternate_urls": ["http://ueg.sagepub.com/"]}, "title": "Surfing the web as a patient with IBD: New horizons", "abstract": "Inflammatory bowel disease (IBD) is a chronic lifelong condition with a disabling course in a significant proportion of patients. Additionally, it is more frequently diagnosed during childhood and in young adults, so its impact can be observed in many aspects of their life in the long‐ term. Despite this negative perspective, the therapeutic armamentarium has increased in recent years, so the probability of controlling the disease activity has increased notably. As we continue to learn about the triggers of the disease and the underlying immunological alterations, our understanding of the real impact of this condition is also growing. For instance, it is now clear how the disease may affect extraintestinal organs but, even more importantly, also the critical impairment of quality of life, disability, mental health and work productivity. This is highly relevant, since this impact on several domains of the patients' lives might be present despite an adequate control of the disease in the gut. The increasing awareness of its impact led the European Medicines Agency (EMA) to express their support to include quality of life and patient‐reported outcomes (PRO) in IBD clinical trials in 2019. Crohn's disease (CD) and ulcerative colitis‐PRO signs and symptoms diaries were developed and endorsed by EMA for this purpose, and they are now considered as the first choice in the assessment of disease activity as the use of other scores like Crohn's Disease Activity Index and total Mayo are difficult to use in daily practice or can be biased in certain situations. These new endpoints and trial designs have already been implemented during the development of the most recently developed biologics and small molecules and hopefully can lead to broader the concept of disease‐modification strategies in the near future. Thus, the shift in the management of these patients has evolved from a physician‐centered model to a patient‐focused evaluation. This is expected to bring new perspectives with more realistic and impactful unmet needs, and they can also potentially reduce patient‐care variability. Despite this remarkable ‐and positive‐ change, it should be stressed that both perspectives (from physicians and patients) have demonstrated significant differences in the assessment of disease activity or adverse drug reactions. Nevertheless, in the era of electronic health records, digital PRO have been developed in parallel with telemedicine resources; thus, patient wellbeing, certain follow‐up consultations and patient self‐ management are new tools available to improve a more comprehensive evaluation of the disease. We should all be involved in implementing these advances within our clinical practice, as this is a unique opportunity to work together and understand what patients need more in detail. Platforms where patients can report their perception of the disease and interact with their physicians are urgently needed. Ideally, they should also serve as a source for research that can explore new treatment alternatives and how to fulfil other patient needs. However, new tools also bring new questions. Digital platforms, and mainly those using cell phones, may not be suitable for all patients and across all ages. Accessibility will always be an issue, as they need to encourage the participation of those (not so) motivated patients, those with disabilities, and those without limited access to certain technologies. In this issue, Engel et al. provide new and useful information about how these resources can be applied for research. Here, StuffThatWorks (www.stuffthatworks.health), a platform designed to collect clinical information from chronic conditions using a machine learning algorithm, was used to gather patient experience on different medical treatments for CD. The authors showed that anti‐TNF agents were ranked as the most effective by patients, followed by ustekinumab and vedolizumab, respectively. Interestingly, surgery appeared in second place. However, one of the most remarkable aspects evaluated in the study is the triggers associated with disease activity, highlighting that psychological factors and certain foods were the most important factors reported by patients. Nonetheless, we also think that validation across diseases and countries would increase the value of their interesting findings. In conclusion, the featured paper by Israeli colleagues provides novel and relevant information about how new technologies can bridge the gap between patient and physician perceptions in IBD and to include PRO in future research. Still, some questions remain open about how these data could be combined with traditional trials. Nonetheless, in our opinion, these novel digital approaches explore how we can closely collaborate with patients in order to shape and improve the future clinical care of patients affected with IBD.", "venue": "United European Gastroenterology journal", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Editorial", "JournalArticle"], "publicationDate": "2023-07-06", "journal": {"name": "United European Gastroenterology Journal", "pages": "592 - 594", "volume": "11"}, "authors": [{"authorId": "2258691603", "name": "Iago Rodríguez-Lago"}, {"authorId": "1422452216", "name": "I. Catalán-Serra"}, {"authorId": "1397232089", "name": "M. Barreiro-de Acosta"}], "citations": []}
