{"paperId": "7c48efb07ff8ddb56d62bb4b88fabab30376db94", "publicationVenue": {"id": "ab43544e-0815-4d8b-8874-b2b11e365890", "name": "Workshop on the Theory and Practice of Provenance", "type": "conference", "alternate_names": ["TaPP", "Workshop Theory Pract Proven"]}, "title": "Provenance-based explanations: are they useful?", "abstract": "As machine-learning models and data-driven decisions continue to be on the rise, interpreting and explaining their results has recently gained increased interest as well. In this context, provenance has often been advertised as metadata that can be used to provide explanations about some data processing. Advantages of such explanations are possibly many: they may help data engineers get a better sense of their data processing pipelines, offer transparency to auditors or end users, and ultimately, improve the trust one has in the data processing. While today, provenance can be efficiently captured for a large variety of data processing pipelines, systematic research on how useful explanations based on provenance actually is scarce. This paper advocates that there is an urgent need to study in which settings what type of provenance-based explanation is useful, given the somewhat mitigated results that have become available for explanations of machine learning results. This is underlined by a first study that shows that provenance-based explanations of record linkage decisions may not have the desired effect.", "venue": "Workshop on the Theory and Practice of Provenance", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2022-06-12", "journal": {"name": "Proceedings of the 14th International Workshop on the Theory and Practice of Provenance"}, "authors": [{"authorId": "51250765", "name": "Sarah Oppold"}, {"authorId": "143677452", "name": "Melanie Herschel"}], "citations": [{"paperId": "a171beea0e66977300b4542c987da904bcc6626f", "title": "Towards Observability for Production Machine Learning Pipelines [Vision]"}]}
