{"paperId": "7c58e34633d59aa9e1984f06f175c7f540691eeb", "publicationVenue": {"id": "e9a44b89-3d84-4bff-8c78-c53cd2ad7cf8", "name": "Foods", "type": "journal", "issn": "2304-8158", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-277853", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-277853", "https://www.mdpi.com/journal/foods/about", "https://www.mdpi.com/journal/foods"]}, "title": "A Role of Multi-Omics Technologies in Sheep and Goat Meats: Progress and Way Ahead", "abstract": "Sheep and goat meats are increasingly popular worldwide due to their superior nutritional properties and distinctive flavor profiles. In recent decades, substantial progress in meat science has facilitated in-depth examinations of ovine and caprine muscle development during the antemortem phase, as well as post-mortem changes influencing meat attributes. To elucidate the intrinsic molecular mechanisms and identify potential biomarkers associated with meat quality, the methodologies employed have evolved from traditional physicochemical parameters (such as color, tenderness, water holding capacity, flavor, and pH) to some cutting-edge omics technologies, including transcriptomics, proteomics, and metabolomics approaches. This review provides a comprehensive analysis of multi-omics techniques and their applications in unraveling sheep and goat meat quality attributes. In addition, the challenges and future perspectives associated with implementing multi-omics technologies in this area of study are discussed. Multi-omics tools can contribute to deciphering the molecular mechanism responsible for the altered the meat quality of sheep and goats across transcriptomic, proteomic, and metabolomic dimensions. The application of multi-omics technologies holds great potential in exploring and identifying biomarkers for meat quality and quality control, thereby promoting the optimization of production processes in the sheep and goat meat industry.", "venue": "Foods", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2023-11-01", "journal": {"name": "Foods", "volume": "12"}, "authors": [{"authorId": "2267030131", "name": "Jin Wang"}, {"authorId": "2118637282", "name": "Yu Fu"}, {"authorId": "2266497883", "name": "Tianyu Su"}, {"authorId": "2266719103", "name": "Yupeng Wang"}, {"authorId": "14427287", "name": "O. P. Soladoye"}, {"authorId": "2185495347", "name": "Yongfu Huang"}, {"authorId": "2266709367", "name": "Zhongquan Zhao"}, {"authorId": "2151271546", "name": "Yongjuan Zhao"}, {"authorId": "2266699885", "name": "Wei Wu"}], "citations": []}
