{"paperId": "7c62a373e4b7b4b5c49ba58ff15a0d775b4b922a", "publicationVenue": null, "title": "Blockchain Enabled Real Estate Property Transactions using NFT: An Approach", "abstract": "Real estate is an asset class traditionally associated with complex transactions and lengthy paperwork. The emergence of blockchain technology, Non-Fungible Tokens (NFTs), and smart contracts help the real estate industry transactions faster, more secure, and more transparent. This study proposes an integrated framework for revolutionizing property transactions by leveraging blockchain technology, ensuring heightened security and transparency. Here we use NFTs to represent properties which makes it easier to track changes in ownership and ensure that all parties involved in a transaction clearly understand who owns the property and when it was transferred. It also extends the application of cryptographic principles, introducing zero-knowledge proofs to validate property ownership. This innovative approach enables parties involved in property transactions to verify the authenticity of ownership without disclosing sensitive information. Through a combination of theoretical analysis, technological exploration, and real-world considerations, this paper lays the groundwork for a more secure, efficient, and privacy-aware landscape for property transactions.", "venue": "2023 International Conference on Research Methodologies in Knowledge Management, Artificial Intelligence and Telecommunication Engineering (RMKMATE)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-11-01", "journal": {"name": "2023 International Conference on Research Methodologies in Knowledge Management, Artificial Intelligence and Telecommunication Engineering (RMKMATE)", "pages": "1-6"}, "authors": [{"authorId": "2277660192", "name": "Vivekrabinson K"}, {"authorId": "2277665614", "name": "Bharath Singh J"}, {"authorId": "2277660116", "name": "Rajesh Kumar S"}, {"authorId": "2277654006", "name": "Vijay M"}, {"authorId": "2277666271", "name": "Vijayakumar D"}, {"authorId": "2277631169", "name": "Shanmuga Raja B"}], "citations": []}
