{"paperId": "7c6b0ce2c1bff2c4c82784d7eaef574ff264f657", "publicationVenue": {"id": "21d30da0-b703-4d49-8451-7a74b39f5026", "name": "International Journal of Performability Engineering", "type": "journal", "alternate_names": ["Int j perform eng", "International journal of performability engineering", "Int J Perform Eng"], "issn": "0973-1318", "url": "http://www.ramsconsultants.org/Journal.htm"}, "title": "Creative Combination of Legacy System and MapReduce in Cloud Migration", "abstract": "With the advent of the big data era, the response speed of traditional legacy systems is gradually unable to meet the requirements of users. Because legacy systems carry domain knowledge and critical resources, many organizations are migrating legacy systems to cloud platform so as to maximize the reuse of legacy systems as well as improve the performance of big data processing. MapReduce is recognized as an effective programming model for processing big data in parallel mode in cloud computing. Therefore, how to creatively combine parallelizable legacy code and the MapReduce model to enable legacy code to be accurately mapped into the MapReduce model is a challenging issue. We use the first type of creative computing to propose an approach for legacy code refactoring. The legacy code of big data processing is divided into several types according to the business logic, and then the corresponding refactoring rules are proposed. We use the second type of creative computing to develop a tool to support the refactoring process. The experimental results indicate that the refactoring results are correct and efficient in practical scenarios.", "venue": "International Journal of Performability Engineering", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": null, "journal": {"name": "International Journal of Performability Engineering"}, "authors": [{"authorId": "2288943615", "name": "Junfeng Zhao"}, {"authorId": "2157016391", "name": "Wenmeng Wang"}], "citations": []}
