{"paperId": "7c7fda1c61691c1a7c749bbed0ed90d754b65126", "publicationVenue": {"id": "2248fe58-f8fa-45bd-8a19-64282dffe19d", "name": "Cuestiones políticas", "alternate_names": ["Cuest políticas"], "issn": "0798-1406", "url": "http://revistas.luz.edu.ve/index.php/cc"}, "title": "Activities of Law Enforcement Agencies in the Context of the Introduction of Innovative Technologies (Comparative Legal Aspect)", "abstract": "The objective of the study was to determine the legal mechanisms for the use of innovative technologies in law enforcement and to outline the main problems of their implementation in the fight against crime. The methodological scheme of the article was the use of theoretical and empirical research methods, as well as comparative, structural and logical methods, documentary, and systems analysis. It is established that the main types of modern technologies used in law enforcement are unmanned aerial vehicles, artificial intelligence, robotics, biotechnology, analytical and geographic information systems, explosion locators and chatbots. The problems of introducing innovative technologies into law enforcement were found to be objective and subjective. The ways of overcoming them are offered through the creation of legal mechanisms for the legal use of various modern technologies by law enforcement agents. It is concluded that effective mechanisms for the use of innovations in law enforcement will increase the effectiveness of crime prevention and enable law enforcement officials to avoid conflicts related to violations of citizens' rights and the protection of national security.", "venue": "Cuestiones políticas", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-03-07", "journal": {"name": "Cuestiones Políticas"}, "authors": [{"authorId": "2093274497", "name": "V. Tulinov"}, {"authorId": "2024984", "name": "Iryna Bilykh"}, {"authorId": "123957471", "name": "O. Merdova"}, {"authorId": "153311570", "name": "O. Volobuieva"}, {"authorId": "1659230513", "name": "M. Veselov"}], "citations": []}
