{"paperId": "7c8008bf230993440283b9331df54b4ba841e9d9", "publicationVenue": {"id": "764e3630-ddac-4c21-af4b-9d32ffef082e", "name": "IEEE International Conference on Data Engineering", "type": "conference", "alternate_names": ["ICDE", "Int Conf Data Eng", "IEEE Int Conf Data Eng", "International Conference on Data Engineering"], "url": "http://www.wikicfp.com/cfp/program?id=1331"}, "title": "LineageBA: A Fast, Exact and Scalable Graph Generation for the Barabási-Albert Model", "abstract": "The Barabási-Albert(BA) model plays an important role in many domains since it can generate a scale-free graph having the degree exponents that real graphs have. However, due to the dependency among the edges generated at different time steps, the exact generation methods support only a single thread, and the parallel generation methods generate a graph only approximately. There is no method that can generate a large-scale graph following the BA model strictly using multiple threads. We propose a fast, exact, and scalable graph generation method called LineageBA that solves the above issue. We propose the concept of lineage relationship for reducing memory usage significantly and the detection of hash collisions for parallelizing the graph generation. Through extensive experiments, we have shown that LineageBA significantly outperforms the state-of-the-art BA graph generation methods and easily generates 2.5 trillion edges within four hours using a small cluster of PCs.", "venue": "IEEE International Conference on Data Engineering", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-04-01", "journal": {"name": "2021 IEEE 37th International Conference on Data Engineering (ICDE)", "pages": "540-551"}, "authors": [{"authorId": "2021341", "name": "Himchan Park"}, {"authorId": "2116504190", "name": "Min-Soo Kim"}], "citations": [{"paperId": "b01c4f2c4d54723b590a828d4e1b4cdbfea5dad4", "title": "Improved GraphSVX for GNN Explanations Based on Cross Entropy"}, {"paperId": "76a9932f7de265323a355a6f3d2e171caed93f10", "title": "sGrow: Explaining the Scale-Invariant Strength Assortativity of Streaming Butterflies"}, {"paperId": "7a2781ef3cb67a458a391198a026933fdea69a2a", "title": "Scale-Invariant Strength Assortativity of Streaming Butterflies"}]}
