{"paperId": "7c84a837ac53802fc8b772cd05a17b4d7c6d8464", "publicationVenue": {"id": "8a7c9905-f8cf-4711-bca6-0ef69aef9823", "name": "International Journal of Information Technology and Decision Making", "type": "journal", "alternate_names": ["Int J Inf Technol Decis Mak"], "issn": "1793-6845", "url": "http://www.worldscinet.com/ijitdm/ijitdm.shtml"}, "title": "A New Energy-Efficient Multipath Routing in Internet of Things Based on Gray Theory", "abstract": "Internet of Things (IoT) is a network of smart things. It indicates the ability that the mentioned physical things transfer information with each other. The characteristics of these networks, such as topology dynamicity and energy constraint, make the routing problem a challenging task in these networks. Traditional routing methods could not achieve the required performance in these networks. Therefore, developers of these networks have to consider specific routing methods in order to satisfy their requirements. One of the routing methods is utilization of the multipath protocols in which data are sent to its destination using multiple routes with separate links. One of such protocols is AOMDV routing protocol. In this paper, AOMDV is improved using gray system theory which chooses the best paths used for separate routes to send packets. To do this, Ad hoc On-demand Multipath Distance Vector (AOMDV) packet format is altered and some fields are added to it so that energy criteria, link expiration time, and signal-to-noise ratio can also be considered during selection of the best route. The proposed method named RMPGST-IoT is introduced which chooses the routes with highest rank for concurrent transmission of data, using a specific method based on the gray system theory. In order to evaluate the results, the proposed Routing Multipath based on Gray System Theory (RMPGST)-IoT method is compared to the Emergency Response IoT based on Global Information Decision (ERGID) and Ad hoc Delay-aware Distributed Routing Model (ADRM)-IoT approaches in terms of throughput, packet receiving rate, packet loss rate, average remaining energy, and network lifetime. The results demonstrate that the performance of the proposed RMPGST-IoT is superior to that of ERGID and ADRM-IoT approaches.", "venue": "International Journal of Information Technology and Decision Making", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-08-10", "journal": {"name": "Int. J. Inf. Technol. Decis. Mak.", "pages": "1581-1617", "volume": "19"}, "authors": [{"authorId": "1573089941", "name": "Rogayye Khaleghnasab"}, {"authorId": "19381012", "name": "Karamollah Bagherifard"}, {"authorId": "2272205", "name": "S. Nejatian"}, {"authorId": "2143490", "name": "H. Parvin"}, {"authorId": "23626122", "name": "B. Ravaei"}], "citations": [{"paperId": "6cc5eb45ced6804273095bce2b3e26a0de267af6", "title": "Design of Hybrid Energy Aware Cluster Based Multipath Routing Protocol in IoT Assisted Wireless Sensor Networks"}, {"paperId": "c43e8fae908a8e453d9590a6206fff41e8717f5e", "title": "Hybrid Marine Predators and Border Collie Optimization algorithm for multipath routing in IoT"}, {"paperId": "fb4d8c42f03d1852ed5e84148715f14a4c3ddf61", "title": "Quality of service aware energy efficient multipath routing protocol for internet of things using hybrid optimization algorithm"}, {"paperId": "c2bb285053e81e4103164ee4aded9342e037f2fa", "title": "Holistic survey on energy aware routing techniques for IoT applications"}, {"paperId": "fb3ed55d5158d827df2d23ce793da016cd6abfe6", "title": "An Improved Emergency Response Routing Protocol for Internet of Things"}, {"paperId": "3d4f082599c84ce13f28e1e8ace25afe67de4d8c", "title": "Distributed network security framework of energy internet based on internet of things"}]}
