{"paperId": "7c8ef2cfc2a82d2e7653589191083d11af939eca", "publicationVenue": null, "title": "Towards Building a Distributed Data Management Architecture to Integrate Multi-Sources Remote Sensing Big Data", "abstract": "Recent advances in sensor technologies have led to the significant growth of remote sensing data in terms of its volume, velocity, and variety. Remote sensing data are recognized as the big data, which pose the urgent need for new technologies to integrate and manage heterogeneous remote sensing big data. In this paper, a scalable, efficient, distributed data management system is proposed for heterogeneous remote sensing big data integration and management across the distributed environment. In the system, the remote sensing data are stored as NetCDF files. Meanwhile, the corresponding remote sensing metadata are standardized according to the ISO 19115-2:2009 based metadata template. In this way, a unified view of heterogeneous remote sensing data is formed. Two organization models are designed to store massive remote sensing data and its metadata in HDFS and HBase, respectively. Besides, an Elasticsearch-based secondary index is built for HBase to provide users with query ability of metadata contents.", "venue": "2018 IEEE 20th International Conference on High Performance Computing and Communications; IEEE 16th International Conference on Smart City; IEEE 4th International Conference on Data Science and Systems (HPCC/SmartCity/DSS)", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2018-06-01", "journal": {"name": "2018 IEEE 20th International Conference on High Performance Computing and Communications; IEEE 16th International Conference on Smart City; IEEE 4th International Conference on Data Science and Systems (HPCC/SmartCity/DSS)", "pages": "83-90"}, "authors": [{"authorId": "2116186085", "name": "Xiaohui Huang"}, {"authorId": "2108594617", "name": "Lizhe Wang"}, {"authorId": "3453168", "name": "Jining Yan"}, {"authorId": "3264743", "name": "Ze Deng"}, {"authorId": "47673319", "name": "Shaoyuan Wang"}, {"authorId": "153000328", "name": "Yan Ma"}], "citations": [{"paperId": "48f9307af2f34b540dbf34a385a86f282dd97dd7", "title": "Extração, Integração e Importação de Dados Heterogêneos em Cidades Inteligentes: Um Mapeamento Sistemático"}, {"paperId": "d2cb079e74e16c4a6630adbc8253ba948a2ddb4f", "title": "3-D Channel and Spatial Attention Based Multiscale Spatial–Spectral Residual Network for Hyperspectral Image Classification"}, {"paperId": "48ef0ce20a5c0c99a1ae5ba73342c93c8018a12e", "title": "Big Earth Observation Data Integration in Remote Sensing Based on a Distributed Spatial Framework"}, {"paperId": "edf29427d40278eeda484145a2c18364717abcaf", "title": "Remote Sensing Image Interpretation With Semantic Graph-Based Methods: A Survey"}, {"paperId": "7f76d5bee1d5311300c5461eff2cc3fe20cd57e0", "title": "A Big Data Framework for Satellite Images Processing using Apache Hadoop and RasterFrames: A Case Study of Surface Water Extraction in Phu Tho, Viet Nam"}]}
