{"paperId": "7c93bc4173c9b4d2a71866e8189c8e35cdb00b34", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Large Language Models for Code Analysis: Do LLMs Really Do Their Job?", "abstract": "Large language models (LLMs) have demonstrated significant potential in the realm of natural language understanding and programming code processing tasks. Their capacity to comprehend and generate human-like code has spurred research into harnessing LLMs for code analysis purposes. However, the existing body of literature falls short in delivering a systematic evaluation and assessment of LLMs' effectiveness in code analysis, particularly in the context of obfuscated code. This paper seeks to bridge this gap by offering a comprehensive evaluation of LLMs' capabilities in performing code analysis tasks. Additionally, it presents real-world case studies that employ LLMs for code analysis. Our findings indicate that LLMs can indeed serve as valuable tools for automating code analysis, albeit with certain limitations. Through meticulous exploration, this research contributes to a deeper understanding of the potential and constraints associated with utilizing LLMs in code analysis, paving the way for enhanced applications in this critical domain.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-10-18", "journal": {"name": "ArXiv", "volume": "abs/2310.12357"}, "authors": [{"authorId": "65927400", "name": "Chongzhou Fang"}, {"authorId": "2260336596", "name": "Ning Miao"}, {"authorId": "2260337053", "name": "Shaurya Srivastav"}, {"authorId": "2213138702", "name": "Jialin Liu"}, {"authorId": "2110065155", "name": "Ruoyu Zhang"}, {"authorId": "2162344763", "name": "Ruijie Fang"}, {"authorId": "2238171668", "name": "Asmita Asmita"}, {"authorId": "2162752709", "name": "Ryan Tsang"}, {"authorId": "12539086", "name": "Najmeh Nazari"}, {"authorId": "2260364590", "name": "Han Wang"}, {"authorId": "1747542", "name": "H. Homayoun"}], "citations": [{"paperId": "4db1f9a44187f618ca2ce5879089defd3860b54a", "title": "Introducing an Open-Source Python Toolkit for Machine Learning Research in Physiological Signal based Affective Computing"}]}
