{"paperId": "7c9abae93ee7ff943b3ef5023e655e1ab8abc42a", "publicationVenue": {"id": "d65e8b4a-f9c2-45ae-9b87-090db7e872f1", "name": "International Conference on Parallel Architectures and Compilation Techniques", "type": "conference", "alternate_names": ["Int Conf Parallel Archit Compil Tech", "PACT", "Parallel Comput Technol", "Parallel Computing Technologies", "Pan African Conference Science, Computing and Telecommunications", "PaCT", "Pan Afr Conf Sci Comput Telecommun"], "url": "http://www.pactconf.org/", "alternate_urls": ["http://ssd.sscc.ru/en/conference"]}, "title": "Decoupling Schedule, Topology Layout, and Algorithm to Easily Enlarge the Tuning Space of GPU Graph Processing", "abstract": "Only with a right schedule and a right topology layout, a graph algorithm can be efficiently processed on GPUs. Existing GPU graph processing frameworks try to find an optimal schedule and topology layout for an algorithm via iterative search, but they fail to find the optimal configuration because their schedules and topology layouts are tightly coupled in their processing models. Moreover, their tightly coupled schedules and topology layouts make it difficult for developers to extend the tuning space. To easily enlarge the tuning space of GPU graph processing, this work proposes a new GPU graph processing abstraction scheme that fully decouples schedules, topology layouts, and algorithms from each other with abstraction interfaces. Moreover, this work proposes GRAssembler, a new GPU graph processing framework that efficiently integrates the decoupled schedule, topology layout, and algorithm without abstraction overhead. Thanks to the efficient decoupling and integration, GRAssembler increases the tuning space from 336 to 4,480 and achieves 30.4% higher performance on geomean average, compared to the state-of-the-art GPU graph processing framework.", "venue": "International Conference on Parallel Architectures and Compilation Techniques", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2022-10-08", "journal": {"name": "Proceedings of the International Conference on Parallel Architectures and Compilation Techniques"}, "authors": [{"authorId": "1508763907", "name": "Shinnung Jeong"}, {"authorId": "2109254759", "name": "Yongwoo Lee"}, {"authorId": "2202232956", "name": "Jaeho Lee"}, {"authorId": "10885248", "name": "H. Choi"}, {"authorId": "35471135", "name": "Seungbin Song"}, {"authorId": "2108602524", "name": "Jinho Lee"}, {"authorId": "2567514", "name": "Youngsok Kim"}, {"authorId": "2363315", "name": "Hanjun Kim"}], "citations": []}
