{"paperId": "7c9fc3befe24dfd0f36681d246f35fc4fde3d756", "publicationVenue": {"id": "312ca99c-9149-490d-813e-c60d5e949f65", "name": "Concurrency and Computation", "type": "journal", "alternate_names": ["Concurr Comput Pract Exp", "Concurrency and Computation: Practice and Experience", "Concurr Comput"], "issn": "1532-0626", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/77004395?CRETRY=1&SRETRY=0", "alternate_urls": ["http://www3.interscience.wiley.com/cgi-bin/jtoc?ID=77004395", "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1532-0634"]}, "title": "A clustering‐based anonymization approach for privacy‐preserving in the healthcare cloud", "abstract": "Today, modern healthcare systems rely on advanced computational technologies, including cloud‐based systems, to gather and examine personal health data on a large scale. The use of advanced cloud services technologies, such as software as a service, application as a service, is challenging for end‐users of cloud systems to protect sensitive data in their health applications. According to the importance of publishing data in the cloud, the information should be recorded and handled somehow so that any individuals' identity remains hidden. Therefore, one of the critical privacy challenges is protecting the quality of published data and privacy‐preserving on the healthcare cloud simultaneously. The K‐anonymity technology is one of the prevalent methods used for privacy‐preserving. In this article, we suggest a novel approach based on the clustering process using the K‐means++ method to achieve an optimal k‐anonymity algorithm. Also, we use the normal distribution function to delete data that is less frequent, which can be improved the quality of anonymized data. Extensive experiments show the proposed method has been able to reduce information loss 1.5 times and execution time 3.5 times compared to AKA and GCCG algorithms. Also, it is highly scalable than others.", "venue": "Concurrency and Computation", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-07-13", "journal": {"name": "Concurrency and Computation: Practice and Experience", "volume": "34"}, "authors": [{"authorId": "2128490113", "name": "Afsoon Abbasi"}, {"authorId": "144125066", "name": "Behnaz Mohammadi"}], "citations": [{"paperId": "3a8b087b56e164bf41ee5ea6da7d8ea539716d51", "title": "Towards Optimization of Privacy-Utility Trade-Off Using Similarity and Diversity Based Clustering"}, {"paperId": "d73c552829e2ee8da100564cdd506854e9863f65", "title": "A Privacy-Preserving Smart Body Scale with K-Means Anonymization towards GDPR-Compliant IoT"}, {"paperId": "f3850a7042fa78bde04bc6104718129924a73ac6", "title": "Designing a Novel Approach Using a Greedy and Information-Theoretic Clustering-Based Algorithm for Anonymizing Microdata Sets"}, {"paperId": "27f75660ed8c1ed8c116a54ce7e5ac0f1659a567", "title": "A novel Jarratt butterfly Ebola optimization-based attentional random forest for data anonymization in cloud environment"}, {"paperId": "9c82eb8e4ce1c70792f3b7532bc1d99e64b92bbd", "title": "The Social and Professional Image of the Nurse: Results of an Online Snowball Sampling Survey among the General Population in the Post-Pandemic Period"}, {"paperId": "061a7a219341e83ad0165f8b86352704307d31a8", "title": "An intuitionistic fuzzy-based intelligent system for semantic interoperability and privacy preservation in healthcare systems"}, {"paperId": "04244fd566b9e4f93ddffaa63a00a0899d8285a9", "title": "An anonymization-based privacy-preserving data collection protocol for digital health data"}, {"paperId": "e914238f5331935aacf99004714f789225294c73", "title": "Design of privacy preserving model based on clustering involved anonymization along with feature selection"}, {"paperId": "626b4bab46a3b17cfd820226839c01d6a3cb8ec1", "title": "Group Privacy: An Underrated but Worth Studying Research Problem in the Era of Artificial Intelligence and Big Data"}, {"paperId": "c91a48598c34f3e44bbd264f4220c92d2ec85e23", "title": "A Customer Clustering Algorithm for Power Logistics Distribution Network Structure and Distribution Volume Constraints"}, {"paperId": "4bdb613b5324a64072f4ddab21eb888343b1d85c", "title": "Quantifying the Vulnerability of Attributes for Effective Privacy Preservation Using Machine Learning"}, {"paperId": "7e94e2f2aeef3a514184bafcd76ed36cc27f5e40", "title": "Privacy Preserving Attribute-Focused Anonymization Scheme for Healthcare Data Publishing"}, {"paperId": "913bdcd38bf69b06e12c922f2ebb4f2a70ba759d", "title": "Towards Privacy Preservation using Clustering based Anonymization: Recent Advances and Future Research Outlook"}, {"paperId": "7f088a95b1e5d9f01ed2ed67eea5c080cce0b689", "title": "The Next Generation of eHealth: A Multidisciplinary Survey"}]}
