{"paperId": "7ca28f9045a5cbfe98cd945a5958a50af1556f76", "publicationVenue": {"id": "501c1070-b5d2-4ff0-ad6f-8769a0a1e13f", "name": "Wireless Communications and Mobile Computing", "type": "journal", "alternate_names": ["Wirel Commun Mob Comput"], "issn": "1530-8669", "url": "https://www.hindawi.com/journals/wcmc/", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/15308677", "http://www.interscience.wiley.com/jpages/1530-8669/"]}, "title": "A Survey of IoT Stream Query Execution Latency Optimization within Edge and Cloud", "abstract": "IoT (Internet of Things) streaming data has increased dramatically over the recent years and continues to grow rapidly due to the exponential growth of connected IoT devices. For many IoT applications, fast stream query processing is crucial for correct operations. To achieve better query performance and quality, researchers and practitioners have developed various types of query execution models—purely cloud-based, geo-distributed, edge-based, and edge-cloud-based models. Each execution model presents unique challenges and limitations of query processing optimizations. In this work, we provide a comprehensive review and analysis of query execution models within the context of the query execution latency optimization. We also present a detailed overview of various query execution styles regarding different query execution models and highlight their contributions. Finally, the paper concludes by proposing promising future directions towards advancing the query executions in the edge and cloud environment.", "venue": "Wireless Communications and Mobile Computing", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2021-11-16", "journal": {"name": "Wireless Communications and Mobile Computing"}, "authors": [{"authorId": "2083374671", "name": "Fatima Abdullah"}, {"authorId": "40572483", "name": "Limei Peng"}, {"authorId": "144543382", "name": "Byungchul Tak"}], "citations": [{"paperId": "ceeb56ecc3d05a21ed03a4feadf789b6e619d93d", "title": "Performance-Aware Big Data Management for Remote Sensing Systems"}, {"paperId": "9b4388164baf952dfef190492ad72ea1727ef142", "title": "Towards green smart cities using Internet of Things and optimization algorithms: A systematic and bibliometric review"}, {"paperId": "a771b675f72bb3ee710ed127eed332eb306cc014", "title": "Querying Distributed Sensor Streams in the Edge-to-Cloud Continuum"}]}
