{"paperId": "7cad99340b84943c06e53f856fd8d40d9a4faf54", "publicationVenue": {"id": "29df4b17-9a16-4a4c-94a6-002f52e628b4", "name": "International Conference on Parallel Processing", "type": "conference", "alternate_names": ["ICPP", "Int Conf Parallel Process", "IEEE Int Conf Pulsed Power", "IEEE International Conference on Pulsed Power"], "url": "http://www.wikicfp.com/cfp/program?id=1447"}, "title": "A Coflow-Based Co-Optimization Framework for High-Performance Data Analytics", "abstract": "Efficient execution of distributed database operators such as joining and aggregating is critical for the performance of big data analytics. With the increase of the compute speedup of modern CPUs, reducing the network communication time of these operators in large systems is becoming increasingly important, and also challenging current techniques. Significant performance improvements have been achieved by using state-of-the-art methods, such as reducing network traffic designed in the data management domain, and data flow scheduling in the data communications domain. However, the proposed techniques in both fields just view each other as a black box, and performance gains from a co-optimization perspective have not yet been explored.In this paper, based on current research in coflow scheduling, we propose a novel Coflow-based Co-optimization Framework (CCF), which can co-optimize application-level data movement and network-level data communications for distributed operators, and consequently contribute to their performance in large distributed environments. We present the detailed design and implementation of CCF, and conduct an experimental evaluation of CCF using large-scale simulations on large data joins. Our results demonstrate that CCF can always perform faster than current approaches on network communications in large-scale distributed scenarios.", "venue": "International Conference on Parallel Processing", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2017-09-01", "journal": {"name": "2017 46th International Conference on Parallel Processing (ICPP)", "pages": "392-401"}, "authors": [{"authorId": "2145203648", "name": "Long Cheng"}, {"authorId": "144810556", "name": "Ying Wang"}, {"authorId": "1382535564", "name": "Yulong Pei"}, {"authorId": "1776848", "name": "D. Epema"}], "citations": [{"paperId": "1cd0a36db369abdf152e5007b47e2ca3eaebde0c", "title": "Toward Network-Aware Query Execution Systems in Large Datacenters"}, {"paperId": "269b93b3dfbb2d3fb0fafef3647e9cadad7dc7d0", "title": "Optimizing data query performance of Bi-cluster for large-scale scientific data in supercomputers"}, {"paperId": "abe98b3fd67f1b3664dca662bdba4c5a378c9b35", "title": "Network-Aware Locality Scheduling for Distributed Data Operators in Data Centers"}, {"paperId": "a03af809b497694ec3516f8db8eeed05d62855f4", "title": "JobPacker: Job Scheduling for Data-Parallel Frameworks with Hybrid Electrical/Optical Datacenter Networks"}, {"paperId": "3b326269b3defb8ca572767077b87e4f21f128e3", "title": "Bi-Cluster: A High-Performance Data Query Framework for Large-Scale Scientific Data"}, {"paperId": "bf20fa3baae315be677d4a6c2fb96afb8de179d1", "title": "New Bipartite Graph Techniques for Irregular Data Redistribution Scheduling"}, {"paperId": "a525679d3c7942c34565425a68ac6737a7f16f42", "title": "Software data analytics: architectural model discovery and design pattern detection"}, {"paperId": "7c666cf265e42e608fad47ee3e6258535262bc75", "title": "Construction and Application of Data Standard in Big Data Environment"}, {"paperId": "3fac5beabc80914f9e64a927dab1db24e2ed02de", "title": "Spatial-temporal Data Association Based Ontology Alignment Research in High Education Context"}, {"paperId": "75b674883c1ae3e4a569fd3776852c3c6b95e8f2", "title": "Rendering differential performance preference through intelligent network edge in cloud data centers"}, {"paperId": "dba1ce223ee2b2a1952894b7913abb6e9204ae08", "title": "I/O Workload Management for All-Flash Datacenter Storage Systems Based on Total Cost of Ownership"}, {"paperId": "b4c7f5ce077cd917a1eb043cd12f49fa94006c1a", "title": "Minimizing Network Traffic for Distributed Joins Using Lightweight Locality-Aware Scheduling"}, {"paperId": "a12f946aff7eb27a8b7a3a86215e0517e02f1ac2", "title": "Erasure code of small file in a distributed file system"}, {"paperId": "bde2878dc6c18f23fb93f7000027d269c54c7df2", "title": "Automatic and Scalable Data Replication Manager in Distributed Computation and Storage Infrastructure of Cyber-Physical Systems"}, {"paperId": "1fa52be9824bdcc89dfe13542da3fd3c888e9cb3", "title": "Scalable Computing: Practice and Experience"}]}
