{"paperId": "7cb89eb72fdda9033f72d24fc691fbd841b06d50", "publicationVenue": null, "title": "Conceptual Approach of Big Data Architecture Mozita Application in Industry 4.0", "abstract": "In industry 4.0, the growth of data generated from an application will increase in a very large amount of volume and occur massively. The phenomenon of massive data growth with a wide variety of data formats is called the big data. The main problem with big data is that large volumes of data with a variety of formats can provide reliable access speeds to extract data in the form of analytics or data visualization. Likewise, the Mozita application in the industrial era 4.0 will experience a similar problem that occurs in big data. Therefore in this study a conceptual scheme of Mozita application big data architecture conceptual approach using cluster data, batch processing, and stream processing is proposed to provide high reliability in analyzing and visualizing data. The conceptual scheme of the big data architecture developed consists of 3 layers: data processing data collection, and access to analytic and data visualization needs. This big data architecture uses the Hadoop technique as a big data processing framework, with Apache Hive tools, and Cassandra as a NoSQL-based database. This big data architecture can provide high availability and reliability for very large data collection, real-time processing and data access for information extraction in the form of analytics and data visualization. In the application of the new architecture proven to increase speed in data storage by 62.15% and an increase in speed in reading data by 42.38%.", "venue": "Proceedings of the 2nd International Seminar on Science and Technology (ISSTEC 2019)", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2020-10-11", "journal": {"name": "Proceedings of the 2nd International Seminar on Science and Technology (ISSTEC 2019)"}, "authors": [{"authorId": "97722494", "name": "A. P. Widodo"}, {"authorId": "73913394", "name": "D. E. Riyanto"}, {"authorId": "71943581", "name": "M. F. Rizal"}], "citations": []}
