{"paperId": "7cbdc8cbd4e389a541a1761cf5fae977ba255041", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "A Survey of Big Data Machine Learning Applications Optimization in Cloud Data Centers and Networks", "abstract": "This survey article reviews the challenges associated with deploying and optimizing big data applications and machine learning algorithms in cloud data centers and networks. The MapReduce programming model and its widely-used open-source platform; Hadoop, are enabling the development of a large number of cloud-based services and big data applications. MapReduce and Hadoop thus introduce innovative, efficient, and accelerated intensive computations and analytics. These services usually utilize commodity clusters within geographically-distributed data centers and provide cost-effective and elastic solutions. However, the increasing traffic between and within the data centers that migrate, store, and process big data, is becoming a bottleneck that calls for enhanced infrastructures capable of reducing the congestion and power consumption. Moreover, enterprises with multiple tenants requesting various big data services are challenged by the need to optimize leasing their resources at reduced running costs and power consumption while avoiding under or over utilization. In this survey, we present a summary of the characteristics of various big data programming models and applications and provide a review of cloud computing infrastructures, and related technologies such as virtualization, and software-defined networking that increasingly support big data systems. Moreover, we provide a brief review of data centers topologies, routing protocols, and traffic characteristics, and emphasize the implications of big data on such cloud data centers and their supporting networks. Wide ranging efforts were devoted to optimize systems that handle big data in terms of various applications performance metrics and/or infrastructure energy efficiency. Finally, some insights and future research directions are provided.", "venue": "arXiv.org", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2019-10-01", "journal": {"name": "ArXiv", "volume": "abs/1910.00731"}, "authors": [{"authorId": "49260301", "name": "S. Mohamed"}, {"authorId": "1402001150", "name": "T. El-Gorashi"}, {"authorId": "34082289", "name": "J. Elmirghani"}], "citations": [{"paperId": "bce4a6acded867b966a1fc6f902b6c00b51b75be", "title": "Two phased Yarn scheduling with novel binary hypergraphed PSO"}, {"paperId": "df86437401513c56986cf6a27cde8d42c4f0a11d", "title": "New Efficient YARN Scheduler with Improved MVO"}, {"paperId": "d321758e50fdd0bbbb936608836e7de7e6b3ecad", "title": "New efficient Hadoop scheduler: Generalized particle swarm optimization and simulated annealing‐dominant resource fairness"}, {"paperId": "ce254e0da8a37d82d852339bdb0e919f46055fbc", "title": "Machine Learning- and Feature Selection-Enabled Framework for Accurate Crop Yield Prediction"}, {"paperId": "53c217a63ca9816c5556338f5e247e34d40183ab", "title": "Optimizing the Performance of Wireless Sensor Network Based on Software Defined Network and Gaussian Filter"}, {"paperId": "4070944c31d3ee5f557cefeaec8c89c8b9ae8b42", "title": "A Hybrid Machine Learning Approach for Performance Modeling of Cloud-Based Big Data Applications"}, {"paperId": "dfbf2ac8d6e6a61b72a9fbe393706cb48c0cf2dd", "title": "A new weighted fuzzy C-means clustering for workload monitoring in cloud datacenter platforms"}, {"paperId": "ccaace1c44e8bb5f6a2529e0c8bf4939c12a4063", "title": "Learning on Hardware: A Tutorial on Neural Network Accelerators and Co-Processors"}, {"paperId": "bab6fc03b73dc3e219fd58ff75a3faeef14a6fd9", "title": "A Distributed Computing Framework Based on Variance Reduction Method to Accelerate Training Machine Learning Models"}, {"paperId": "61641ab9af2946a8bc95836bddd3639047de7fe0", "title": "FPGA Based Embedded Neural Network Object Detector"}, {"paperId": "1276a67e91bd2b55ec79ed8a293336fcdc4ab1cc", "title": "High-Capacity Photon Switching Systems Based on the Two-Stage $$256\\times 256$$ Switch"}]}
