{"paperId": "7cc0b7971c7a973ab7071d1d9d777d41b6b59761", "publicationVenue": {"id": "bd93f51e-8207-47f7-b838-1e50382eded6", "name": "Journal of the Institution of Electronics and Telecommunication Engineers", "type": "journal", "alternate_names": ["J Inst Electron Telecommun Eng", "Iete Journal of Research", "Iete J Res"], "issn": "0377-2063", "url": "http://www.tandfonline.com/loi/tijr20"}, "title": "DewCityGame: Dew Computing-based 5G IoT for Smart City Using Coalition Formation Game", "abstract": "In this article, a smart city architecture with dew computing and machine-to-machine (M2M) communication for the Internet of Things (IoT) is proposed. IoT devices are directly connected to the machines and these machines contain a small amount of computing unit, called dew. The machines combine to form clusters based on distances through a coalition formation game and the machines within the cluster perform the tasks of the IoT nodes. The dew located within each machine can complete a maximum threshold amount of task. If the task exceeds that, then it is transferred to another machine connected to it via M2M communication. In DewCityGame, delay and power consumption of the proposed network are calculated. The delay and power consumption of the proposed optimized dew-enabled M2M communication network has been compared with other non-optimized dew-enabled M2M communication and non-M2M communication network. The proposed optimized dew-enabled M2M communication network has generated ∼15% to 42% less delay and ∼20% to 50% less power consumption than non-optimized dew-enabled M2M communication and non-M2M communication network.", "venue": "Journal of the Institution of Electronics and Telecommunication Engineers", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-09-15", "journal": {"name": "IETE Journal of Research", "pages": "5784 - 5793", "volume": "69"}, "authors": [{"authorId": "2760321", "name": "Subhankar Ghosh"}, {"authorId": "2054406012", "name": "Debashis De"}], "citations": [{"paperId": "ea10e0c1fcb6c34cdf3377e23cfdf52079018549", "title": "DewGame: D2D communication enabled dew computing for 5G IoT using coalition formation game"}, {"paperId": "6f19c2e977a5ba39a677c742b399d215dd6f58bb", "title": "E-CropReco: a dew-edge-based multi-parametric crop recommendation framework for internet of agricultural things"}, {"paperId": "edea07a00665e3531c0e3a25b41bc4ee135661f0", "title": "Blockchain Integration with Machine Learning for Securing Fog Computing Vulnerability in Smart City Sustainability"}]}
