{"paperId": "7cc40779388f95daaaa395a177eaeef29bd9aa59", "publicationVenue": {"id": "05528bac-d212-46a6-9c84-314d4bd77368", "name": "International Journal of Intelligent Systems", "type": "journal", "alternate_names": ["Int J Intell Syst"], "issn": "0884-8173", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/36062", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/1098111X"]}, "title": "Multicriteria recommendation based on bacterial foraging optimization", "abstract": "Recommender systems assist users to make decisions among a huge volume of options. Accuracy‐oriented recommender systems focus on the prediction power of algorithms and neglect that users may appreciate diverse and novel recommendations in real‐world scenarios. Thus, this paper proposed a multicriteria recommendation model that can optimize the recommendation accuracy, diversity, novelty, and individual tendency simultaneously. Additionally, a new multiobjective bacterial foraging optimization method is proposed to improve its searching capability and the performance of recommendation model. The proposed optimization‐based multicriteria recommendation algorithm is compared with existing methods on both benchmark functions and real‐world data sets. The results demonstrate that the proposed algorithm is superior to other recommendation algorithms in most cases. This study provides insights in recommendation system design and draws scholarly attention to the optimization‐based recommendation strategy.", "venue": "International Journal of Intelligent Systems", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-10-06", "journal": {"name": "International Journal of Intelligent Systems", "pages": "1618 - 1645", "volume": "37"}, "authors": [{"authorId": "151354406", "name": "S. Geng"}, {"authorId": "2154302430", "name": "Xiaofu He"}, {"authorId": "2108735445", "name": "Yixin Wang"}, {"authorId": "145850472", "name": "Hong Wang"}, {"authorId": "1887661", "name": "B. Niu"}, {"authorId": "2060692837", "name": "Kris M. Y. Law"}], "citations": [{"paperId": "aa43d1faa25fe68520ffcb7bd1c9ba445671a47d", "title": "Adaptive genetic algorithm for user preference discovery in multi-criteria recommender systems"}, {"paperId": "06b55041ba63529c15bf8aa864c70f49a6bc8924", "title": "Accuracy-diversity optimization in personalized recommender system via trajectory reinforcement based bacterial colony optimization"}]}
