{"paperId": "7cca234b50f4b03dbf99b8579a5fd55a5a653094", "publicationVenue": {"id": "cd492924-29c4-496b-9535-082805f228d8", "name": "International Conference on Performance Engineering", "type": "conference", "alternate_names": ["Int Conf Perform Eng", "ICPE"], "url": "http://www.wikicfp.com/cfp/program?id=1445"}, "title": "Graph Greenifier: Towards Sustainable and Energy-Aware Massive Graph Processing in the Computing Continuum", "abstract": "Our society is increasingly digital, and its processes are increasingly digitalized. As an emerging technology for the digital society, graphs provide a universal abstraction to represent concepts and objects, and the relationships between them. However, processing graphs at a massive scale raises numerous sustainability challenges; becoming energy-aware could help graph-processing infrastructure alleviate its climate impact. Graph Greenifier aims to address this challenge in the conceptual framework offered by the Graph Massivizer architecture. We present an early vision of how Graph Greenifier could provide sustainability analysis and decision-making capabilities for extreme graph-processing workloads. Graph Greenifier leverages an advanced digital twin for data center operations, based on the OpenDC open-source simulator, a novel toolchain for workload-driven simulation of graph processing at scale, and a sustainability predictor. The input to the digital twin combines monitoring of the information and communication technology infrastructure used for graph processing with data collected from the power grid. Graph Greenifier thus informs providers and consumers on operational sustainability aspects, requiring mutual information sharing, reducing energy consumption for graph analytics, and increasing the use of electricity from renewable sources.", "venue": "International Conference on Performance Engineering", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2023-04-15", "journal": {"name": "Companion of the 2023 ACM/SPEC International Conference on Performance Engineering"}, "authors": [{"authorId": "1760940", "name": "A. Iosup"}, {"authorId": "100533173", "name": "R.-C. Prodan"}, {"authorId": "1784556", "name": "A. Varbanescu"}, {"authorId": "30139648", "name": "Sacheendra Talluri"}, {"authorId": "2213077931", "name": "Gilles Magalhaes"}, {"authorId": "2213311124", "name": "Kailhan Hokstam"}, {"authorId": "2213439705", "name": "Hugo Zwaan"}, {"authorId": "2115012771", "name": "Vincent van Beek"}, {"authorId": "101707848", "name": "Reza Farahani"}, {"authorId": "1887201", "name": "Dragi Kimovski"}], "citations": []}
