{"paperId": "7cca3d2f4267adf1f3339f7a39c0556f90c296a2", "publicationVenue": {"id": "45c0e379-77b8-42f3-aeaf-812c2a1ee6b1", "name": "Trames-journal of The Humanities and Social Sciences", "type": "journal", "alternate_names": ["Trames-journal Humanit Soc Sci"]}, "title": "Sexualization of Children in Deepfakes and Hentai: Examining Reddit User Views", "abstract": "Based on a large dataset (N=13293) of Reddit comments collected on the topic, this article takes a qualitative approach to examine Reddit users’ views and attitudes about the sexualization of minors (SOM) in deepfakes and hentai. The analysis captured five major themes in the discussion over SOM: illegality, art, promoting pedophilia, increase in offending and general harmfulness. Furthermore, the discussion was underscored by the central question of who is a minor, which feeds the already problematic definitional ambiguity and keeps the perceived discursive boundaries of the illegality of SOM in flux. Current study adds to the existing literature by presenting information that could be useful in designing prevention and awareness efforts addressing SOM and CSAM, particularly to the general public.", "venue": "Trames-journal of The Humanities and Social Sciences", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": null, "publicationDate": null, "journal": {"name": "Trames. Journal of the Humanities and Social Sciences"}, "authors": [{"authorId": "120649727", "name": "S. Eelmaa"}], "citations": [{"paperId": "cd717138d0f45f78ab1f06767fa8656348d23942", "title": "Information Security Practices and Intervention Among Teenagers"}, {"paperId": "104b6e3988474f81338931f4a4e48f34beed77bb", "title": "The Spiral of Digital Falsehood in Deepfakes"}, {"paperId": "0205b9bf7e45dd50827fb0800fe54cc4590a64b5", "title": "Engaging with deepfakes: a meta-synthesis from the perspective of social shaping of technology theory"}, {"paperId": "908f3697b3047c9ad6c3d39e0752f11383c12e18", "title": "Are Deepfakes Concerning? Analyzing Conversations of Deepfakes on Reddit and Exploring Societal Implications"}, {"paperId": "dd5db6619159ffef115ffe4bb474e6c0a0fea32f", "title": "Yeni Nesil Tehdit: Derin Kurgu (DeepFake)"}]}
