{"paperId": "7ccf4d5a65a112655c569cf673451e0a387e2c5b", "publicationVenue": {"id": "1db2368e-5986-4b06-9137-e63c1aa4f5e1", "name": "Symposium on Computer Architecture and High Performance Computing", "type": "conference", "alternate_names": ["SBAC-PAD", "Symp Comput Archit High Perform Comput"]}, "title": "COMET: Client-Oriented METadata Service for Highly Available Distributed File Systems", "abstract": "Highly available metadata services of distributed file systems are essential to cloud applications. However, existing highly available metadata designs lack client-oriented features that treat metadata discriminately, leading to a single metadata fault domain and low availability. After investigating the workload characteristics of Hadoop, we propose Client-Oriented METadata (COMET), a novel highly available metadata service design that divides and distributes metadata into independent regions in terms of clients. These regions are isolated fault domains inherently, and failures in one region will not break file operations in other regions. A prototype of COMET was implemented based on HDFS, and the experimental results show that COMET can significantly improve metadata availability of HDFS without obvious performance degradation. It can also deliver scalable performance and faster metadata recovery due to its decentralized architecture.", "venue": "Symposium on Computer Architecture and High Performance Computing", "year": 2015, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2015-10-17", "journal": {"name": "2015 27th International Symposium on Computer Architecture and High Performance Computing (SBAC-PAD)", "pages": "154-161"}, "authors": [{"authorId": "2385784", "name": "Ruini Xue"}, {"authorId": "2992723", "name": "Lixiang Ao"}, {"authorId": "3235543", "name": "Zhongyang Guan"}], "citations": [{"paperId": "b3c52c7906a3c5410aa17a6b911b6a214fb45f01", "title": "A Novel Meta-Information Management System for SaaS"}, {"paperId": "b031e5b5bb0a23700a495f0506daaa03a7f212a6", "title": "Replichard: Towards Tradeoff between Consistency and Performance for Metadata"}]}
