{"paperId": "7cd27f13b8cc9af3d1a4968e2d6899ef620620f3", "publicationVenue": {"id": "3bc59e53-8413-4f2a-b739-d2b155898833", "name": "International Conference on Contemporary Computing", "type": "conference", "alternate_names": ["Int Conf Contemp Comput", "IC3"], "url": "http://www.wikicfp.com/cfp/program?id=1263"}, "title": "Cryptober: A Blockchain-based Secure and Cost-Optimal Car Rental Platform", "abstract": "Blockchain is a growing list of records, stored in blocks, which are linked and secured using cryptography. Blockchain is important because it brings trust to peer-to-peer networks. Various blockchain applications from small to big are focused towards decentralizing different tasks and are trying to empower the masses to act without any intermediary in between. The existing and upcoming blockchain applications are highly promising to increase the level of comfort for everyone. Smart contracts can be thought of as self-executing contracts with the terms of the agreement between buyer and seller directly written into lines of code. In this paper, we present a detailed review of how blockchain and smart contracts can be used to create a platform for car rental services that will be beneficial for both the car owner and the renter. The platform is cost optimal because there will be no intermediary in between. This will also introduce high security, privacy, authentication, and safety in the car rental industry.", "venue": "International Conference on Contemporary Computing", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference", "Review"], "publicationDate": "2019-08-01", "journal": {"name": "2019 Twelfth International Conference on Contemporary Computing (IC3)", "pages": "1-6"}, "authors": [{"authorId": "150331642", "name": "Vikas Hassija"}, {"authorId": "119205376", "name": "Mohd Zaid"}, {"authorId": "48652936", "name": "G. Singh"}, {"authorId": "2192267193", "name": "Amit Srivastava"}, {"authorId": "5265167", "name": "Vikas Saxena"}], "citations": [{"paperId": "ca128b57e0c5703bec3fabdd773a7e0183ad9604", "title": "A Multiservice Cab Booking Application"}, {"paperId": "430737e60e799e829e161726efdcae900dcccfed", "title": "A new location verification protocol and blockchain-based drone rental mechanism in smart farming"}, {"paperId": "f93d57b9a73dbfc6f861cd74583d3d07c55ab01b", "title": "Blockchain-Enabled Car Sharing Platform: Enhancing Reliability and Vehicle History Management"}, {"paperId": "d6043b8a3ea08fb965fd9f5f414aee256aed4b0e", "title": "IoT and Blockchain Technology Adoption Models to Increase Transaction Transparency in The Car Rental Industry"}, {"paperId": "3e22758b2fb000ffe55fad5fcf9f57da0a4f0bd3", "title": "Lenrow: A Blockchain Based Peer-to-Peer Product Lending and Borrowing System"}, {"paperId": "4f90defe8b3239cf38f06173d6ea1aebc6572eaf", "title": "Smart Vehicle Rental Application using Blockchain and IoT"}, {"paperId": "ff83766d73b62f34b96c2caf243312ac518e57bd", "title": "Towards blockchain-IoT based shared mobility: Car-sharing and leasing as a case study"}, {"paperId": "75badfa5fa325fa0227d66985b25a9be8ded86fa", "title": "velink - A Blockchain-based Shared Mobility Platform for Private and Commercial Vehicles utilizing ERC-721 Tokens"}, {"paperId": "206d2e13a288ed6663a48c2e035fff6f186ab2fc", "title": "Blockchain Software System Proposal Applied to Electric Self-driving Cars Charging Stations: A TSP Academic Project"}, {"paperId": "28d49e482ac4d8110d05ded3afbb19dfc31dacd9", "title": "Secure Lending: Blockchain and Prospect Theory-Based Decentralized Credit Scoring Model"}, {"paperId": "ba9afeaeb30f24d562596dc78bbbe157db2a246a", "title": "A Novel Blockchain-Based Framework for Vehicle Life Cycle Tracking: An End-to-End Solution"}, {"paperId": "9888c3272ab56ddd0a26e1f141d44fb657682e53", "title": "A Parking Slot Allocation Framework Based on Virtual Voting and Adaptive Pricing Algorithm"}, {"paperId": "6c261bde1311ad2082818a1516ba7cc6a3d2d17c", "title": "BitCom: A Commerce Model on Blockchain"}, {"paperId": "fb20de1c0b30587696b31beedc17d9b60c8037b3", "title": "Block Chain Adoption in The Vehicle Leasing Business to Increase The Transparency of Transactions"}, {"paperId": "61cf033f80b40532401f6e3a914902b33d1067f5", "title": "Shedding Light on the Blockchain Disintermediation Mystery: A Review and Future Research Agenda"}, {"paperId": "82714bdc27af1d0b69692188614c5fc1f2975e0e", "title": "Blockchain Technology for Intelligent Transportation Systems: A Systematic Literature Review"}, {"paperId": "841b275b3cf1d955eb7d74c14067125ff75ec28b", "title": "Police FIR Registration and Tracking Using Consortium Blockchain"}]}
