{"paperId": "7cd6f69fd39113ace2d052585e6bed0b7cafd088", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Improving Dialogue Breakdown Detection with Semi-Supervised Learning", "abstract": "Building user trust in dialogue agents requires smooth and consistent dialogue exchanges. However, agents can easily lose conversational context and generate irrelevant utterances. These situations are called dialogue breakdown, where agent utterances prevent users from continuing the conversation. Building systems to detect dialogue breakdown allows agents to recover appropriately or avoid breakdown entirely. In this paper we investigate the use of semi-supervised learning methods to improve dialogue breakdown detection, including continued pre-training on the Reddit dataset and a manifold-based data augmentation method. We demonstrate the effectiveness of these methods on the Dialogue Breakdown Detection Challenge (DBDC) English shared task. Our submissions to the 2020 DBDC5 shared task place first, beating baselines and other submissions by over 12\\% accuracy. In ablations on DBDC4 data from 2019, our semi-supervised learning methods improve the performance of a baseline BERT model by 2\\% accuracy. These methods are applicable generally to any dialogue task and provide a simple way to improve model performance.", "venue": "arXiv.org", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-10-30", "journal": {"name": "ArXiv", "volume": "abs/2011.00136"}, "authors": [{"authorId": "144055124", "name": "Nathan Ng"}, {"authorId": "2804918", "name": "M. Ghassemi"}, {"authorId": "3019690", "name": "Narendran Thangarajan"}, {"authorId": "2122295319", "name": "Jiacheng Pan"}, {"authorId": "2153929670", "name": "Qi Guo"}], "citations": [{"paperId": "6cdc91a8a6eaf655e0a228f3fb075d91de3a703e", "title": "Leveraging Large Language Models for Automated Dialogue Analysis"}, {"paperId": "36a23d4aa7fd26b7362509c7f4e0a331c56766c5", "title": "Dialog Breakdown Detection using Multimodal Features for Non-task-oriented Dialog Systems"}, {"paperId": "3cd02d5e8421612aff2525c1fb294ed229cfaa68", "title": "A Semi-Supervised Learning Approach with Two Teachers to Improve Breakdown Identification in Dialogues"}, {"paperId": "12b786c02173aac52c83ddb6a687af79666f6433", "title": "On The Use of Gestures in Dialogue Breakdown Detection"}, {"paperId": "002bdeeb00007247cbb78ee45a089a12baa70397", "title": "GOLD: Improving Out-of-Scope Detection in Dialogues using Data Augmentation"}]}
