{"paperId": "7cd80630f07a4082be24db0c9cc1ff8dc2078132", "publicationVenue": {"id": "316506ad-c672-4283-9b3e-3f126d973e85", "name": "SDM", "type": "conference", "alternate_names": ["SIAM Int Conf Data Min", "Secur Data Manag (VLDB Workshop", "SIAM nternational Conf Data Min", "Secure Data Management (VLDB Workshop)", "SIAM International Conference on Data Mining", "SIAM nternational Conference on Data Mining"], "issn": "0049-0016", "url": "https://archive.siam.org/meetings/archives.php"}, "title": "Discovering Multiple Co-Clusterings in Subspaces", "abstract": "Multiple clustering approaches aim at exploring alternative ways of organizing a given collection of data into various clusters from different perspectives. Although multiple one-way clusterings have been studied for more than a decade, how to explore alternative two-way clusterings (or co-clusterings) still remains an untouched topic, and an important one from an application standpoint. To solve this interesting but yet unexplored topic, we assume the existence of alternative co-clusterings embedded in different subspaces and simultaneously pursue multiple co-clusterings therein. We initially specify a subspace indicator matrix for each feature subspace, and employ matrix tri-factorization to seek row-wise and column-wise cluster indicator matrices in each subspace. To ensure diversity, we quantify the redundancy between pairwise co-clusterings using the cluster indicator and the subspace indicator matrices. We further introduce a unified objective function to simultaneously account for the two pursues, and an alternating optimization solution to iteratively optimize cluster indicator and feature indicator matrices. Our empirical study shows that the proposed solution can explore multiple meaningful co-clusterings and generally achieves better results than state-of-the-art methods.", "venue": "SDM", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": null, "journal": {"pages": "423-431"}, "authors": [{"authorId": "145833247", "name": "Shixin Yao"}, {"authorId": "46546894", "name": "Guoxian Yu"}, {"authorId": "2144801522", "name": "Xing Wang"}, {"authorId": "66063792", "name": "J. Wang"}, {"authorId": "1741392", "name": "C. Domeniconi"}, {"authorId": "37538718", "name": "Maozu Guo"}], "citations": [{"paperId": "dadbaa7e3f7eebfbd99655ca3aecd89ebf67df2a", "title": "Selection of clusters based on internal indices in multi-clustering collaborative filtering recommender system"}, {"paperId": "73a76fbaa2b0adead513951e769a8190553a5ab6", "title": "A Diversified Attention Model for Interpretable Multiple Clusterings"}, {"paperId": "25edfe263f15a20bf6ecaae8d13e05f9588211f4", "title": "A Meta Heuristic Multi-View Data Analysis over Unconditional Labeled Material: An Intelligence OCMHAMCV"}, {"paperId": "b07400a8c90ee50bdbda6963e40d83829c63e019", "title": "Orthogonal Constrained Meta Heuristic Adaptive Multi-View Clustering Over Multi Labeled Categorical Data Analysis"}, {"paperId": "fdc7ea8d3eaf0bcebd21738c2bddf53ad8aa777c", "title": "EpiHNet: Detecting Epistasis by Heterogeneous Molecule Network."}, {"paperId": "49e5812d01d81402f3c7b6f7edd3e2225d9e242c", "title": "Multiple clusterings of heterogeneous information networks"}, {"paperId": "1402d9e64c294a97ddc8e812d1e18d2626efeb6f", "title": "EpiMC: Detecting Epistatic Interactions Using Multiple Clusterings"}, {"paperId": "68b48c4788b5792eebd77d6e6dff34d32d1b0a51", "title": "EpIntMC: Detecting Epistatic Interactions Using Multiple Clusterings"}, {"paperId": "695a24d54ddf563da0481c6d25e23c204fec6ccc", "title": "Deep Incomplete Multi-View Multiple Clusterings"}, {"paperId": "04f0c6ea5c62afdef3174aea2c450de23b10399f", "title": "Effect of Dataset Size on Efficiency of Collaborative Filtering Recommender Systems with Multi-clustering as a Neighbourhood Identification Strategy"}, {"paperId": "7044760d8c434f7eb72f46c2833e514c467c5f94", "title": "Multi-View Multiple Clusterings using Deep Matrix Factorization"}, {"paperId": "aff69f76a41b5fcec927a4e11f682a783c08bd7c", "title": "Data Sparsity and Cold-Start Problems in $$M-CCF$$ Recommender System"}]}
