{"paperId": "7ce2bd2fd3e71fafcdabe1c2b8cdf577e3a700f8", "publicationVenue": {"id": "658465d7-3c50-4d5d-b3ad-34b6fc978004", "name": "SAGE Open", "type": "journal", "issn": "2158-2440", "url": "https://journals.sagepub.com/home/sgoa", "alternate_urls": ["http://sgo.sagepub.com/", "http://sgo.sagepub.com/content/4/3/2158244014545971"]}, "title": "Privacy Prevention of Big Data Applications: A Systematic Literature Review", "abstract": "This paper focuses on privacy and security concerns in Big Data. This paper also covers the encryption techniques by taking existing methods such as differential privacy, k-anonymity, T-closeness, and L-diversity. Several privacy-preserving techniques have been created to safeguard privacy at various phases of a large data life cycle. The purpose of this work is to offer a comprehensive analysis of the privacy preservation techniques in Big Data, as well as to explain the problems for existing systems. The advanced repository search option was utilized for the search of the following keywords in the search: “Cyber security” OR “Cybercrime”) AND ((“privacy prevention”) OR (“Big Data applications”)). During Internet research, many search engines and digital libraries were utilized to obtain information. The obtained findings were carefully gathered out of which 103 papers from 2,099 were found to gain the best information sources to address the provided study subjects. Hence a systemic review of 32 papers from 103 found in major databases (IEEExplore, SAGE, Science Direct, Springer, and MDPIs) were carried out, showing that the majority of them focus on the privacy prediction of Big Data applications with a contents-based approach and the hybrid, which address the major security challenge and violation of Big Data. We end with a few recommendations for improving the efficiency of Big Data projects and provide secure possible techniques and proposed solutions and model that minimizes privacy violations, showing four different types of data protection violations and the involvement of different entities in reducing their impacts.", "venue": "SAGE Open", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-04-01", "journal": {"name": "SAGE Open", "volume": "12"}, "authors": [{"authorId": "2165709150", "name": "Fatima Rafiq"}, {"authorId": "1476819061", "name": "Mazhar Javed Awan"}, {"authorId": "2090326025", "name": "Awais Yasin"}, {"authorId": "94514899", "name": "Haitham Nobanee"}, {"authorId": "1768864", "name": "A. Zain"}, {"authorId": "2086773250", "name": "Saeed Ali Omer Bahaj"}], "citations": [{"paperId": "4eae0ebc867893757301792c4bf5a5ee1c2d15f0", "title": "Crime investigation using Big Data on CDR"}, {"paperId": "54cb2ca4f41fe056bdd517d783f347832f211b34", "title": "Technology integration in higher education and student privacy beyond learning environments - A comparison of the UK and US perspective"}, {"paperId": "0e889770b5443d78e84c38b777853a2a1b861a60", "title": "Disclosure of Multiple \"Patient Characteristics\" Format Statistics leaks Quasi-identifier Linkage"}, {"paperId": "7c7338cec7e17b4964bdd0672c4d75c6b5c0b11c", "title": "The shift in research trends related to artificial intelligence in library repositories during the coronavirus pandemic"}, {"paperId": "baeabbd0b0cf14de63782b4093dd8f63763f6e8c", "title": "A Survey on Big Data Technologies and Their Applications to the Metaverse: Past, Current and Future"}, {"paperId": "96ec80641e87b684bb6505b58f376064c9ed955b", "title": "Stock market prediction by applying big data mining"}, {"paperId": "01fed8807b9f01dec75e14294e41c69c71996879", "title": "Next-Generation Intrusion Detection and Prevention System Performance in Distributed Big Data Network Security Architectures"}]}
