{"paperId": "7ce4802e223fddb6da94d2caaa2447510cb8ce27", "publicationVenue": {"id": "2216cafa-e724-48f0-a497-f46a99605f1e", "name": "Land", "type": "journal", "issn": "2073-445X", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-321184", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-321184", "https://www.mdpi.com/journal/land"]}, "title": "Analysis of Spatiotemporal Changes in the Gravitational Structure of Urban Agglomerations in Northern and Southern Xinjiang Based on a Gravitational Model", "abstract": "The urban agglomeration plays a significant role in enhancing integrated regional development. Nevertheless, the expansion of urban agglomerations has demonstrated a lackluster ability to attract cities. Presently, finding solutions to stabilize the existing urban strength and effectively extend attraction to neighboring cities has become a crucial matter. This study adopts the enhanced comprehensive attraction model, fracture point model, and radiation radius model to examine the level of city attraction, intensity of radiation, and range of radiation in the northern and southern Xinjiang city clusters between 2010 and 2020. Based on the analysis, the following conclusions are drawn: (1) the comprehensive strength and city attraction of cities in the northern Xinjiang region is higher than that of the southern Xinjiang region; (2) the intensity of spatial connection between cities in the northern and southern Xinjiang regions is gradually increasing, and the intensity of spatial connection of cities in the northern Xinjiang region is significantly greater than that in the southern Xinjiang region. The intensity of spatial connection between cities in the northern and southern Xinjiang regions is significantly greater than that in the southern Xinjiang region; (3) the central role of the central cities in the northern and southern Xinjiang regions is weakening, the development of cities in the region is gradually becoming unified and coordinated, and regional integration is gradually being strengthened. This study reveals the similarities and differences in urban development in the north and south of Xinjiang and provides important theoretical reference value for regional urban development.", "venue": "Land", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-25", "journal": {"name": "Land"}, "authors": [{"authorId": "2182663336", "name": "Difan Liu"}, {"authorId": "2276754819", "name": "Yuejian Wang"}, {"authorId": "2276658294", "name": "Lei Wang"}, {"authorId": "2276661827", "name": "Liping Xu"}, {"authorId": "2233687840", "name": "Huanhuan Chen"}, {"authorId": "2276753810", "name": "Yuxiang Ma"}], "citations": []}
