{"paperId": "7ceec645bd21c73711ca4dfcd22c6b73dbe7b7d4", "publicationVenue": null, "title": "Securing Cloud Environment Using Hybrid (Adaptive Public Key) Model", "abstract": "Although data security has always been important, it is now even more so given the significance of cloud computing and the enormous amounts of complex data it holds. In cloud computing, having data accessible at all times is vital, as is collecting and preserving data without loss or corruption. The use of appropriate algorithms is one of the most important aspects of security. These protocols protect data by limiting unauthorized access. In order to ensure the security of your data, you need to conduct research on the security risks associated with public clouds. The purpose of this document is to provide an in-depth review of public clouds and the security issues associated with them. In order to review the literature review that provides an in-depth understanding of cloud storage and security issues, it is necessary to overcome several obstacles. As a result, based on an analysis of cloud architecture, we provide the data security model that can be applied to cloud computing. Our cloud computing data security model is now better. Lastly, the work can be done in a direction that benefits from faster encryption times and increased data secrecy by utilising machine learning and authentication technologies for safe cloud storage. ", "venue": "European Journal of Theoretical and Applied Sciences", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2024-01-01", "journal": {"name": "European Journal of Theoretical and Applied Sciences"}, "authors": [{"authorId": "2179041994", "name": "Douglas Allswell Kelechi"}, {"authorId": "78691329", "name": "Ituma Chinagolum"}, {"authorId": "2142091016", "name": "Ukabuiro Ikenna Kelechi"}, {"authorId": "2168273379", "name": "Chidi Ukamaka Betrand"}, {"authorId": "1448484114", "name": "M. E. Benson-Emenike"}], "citations": []}
