{"paperId": "7cf1833facdec88a62639da0eb667c39e53e9958", "publicationVenue": {"id": "71b5bb6a-2b03-49f9-a4c2-63c55c57713d", "name": "InterCarto. InterGIS", "alternate_names": ["Intercarto Intergis"], "issn": "2414-9179", "url": "http://intercarto.msu.ru/", "alternate_urls": ["http://intercarto.msu.ru/jour/"]}, "title": "Principles of implementation of the ESG agenda as part of geoportals", "abstract": "The balanced socio-economic development of the Territory, its enterprises and society as a whole is largely based on non-financial criteria laid down in the basis of the ESG agenda. Environmental protection, social and managerial vectors of the development of the business community and the territory today are represented as part of geoportals, while the very diversity of available solutions and their aggregates have a diverse format, both in the Russian regions and abroad. The purpose of the study: to develop mechanisms for information geoportal support of ESG-strategizing for regional development. Research objectives is to consider foreign and domestic experience in the implementation of geoportals within the ESG strategy; to analyze the state of state information resources for the purposes of ESG in the model region; and to identify priority ESG development goals for the model region. The object of the study, on the example of which the simulation of the results was performed, is the territory of the Tyumen region (without autonomous districts). The subject of the study was the organization of environmental monitoring in the region for the purposes of the ESG agenda. Research methods: spatial-temporal representation of geodata and comparative. According to the results of comparison of geoportal solutions in the Russian Federation and abroad, a differentiated assessment of functional solutions of geoportals under the principles of the ESG agenda was performed. The advantages of implementing Chinese geoportals focused on interactive representation of the territory for the considered specialization are noted. Using the example of the Tyumen Region (without autonomous districts), geoportals functioning for territorial communities of people at the regional and federal levels are considered, their comparison with domestic and foreign analogues is carried out. Based on the results of the study, mechanisms for presenting information as part of geoportals for ESG tasks are proposed: 1) integration of existing geoinformation resources in one regional geoportal display window with the possibility of regulated connection; 2) displaying meta-information in the data that allows the user to navigate the parameters of the information value of the data; 3) displaying for each territorial social system of the region its unique ecological, social and managerial characteristics, taking into account the synthesis of globalization and localization for a specific territorial community of people (introduction of glocalization).", "venue": "InterCarto. InterGIS", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "InterCarto. InterGIS"}, "authors": [{"authorId": "2267640201", "name": "Alexander Zatolokin"}, {"authorId": "2267631886", "name": "Yuriy Petrov"}], "citations": []}
