{"paperId": "7cf42c8505cf080bfba37c8356dfb4959cccf64c", "publicationVenue": {"id": "0fa5fb50-57a4-4633-aa8f-91804e20ac17", "name": "JOIV: International Journal on Informatics Visualization", "type": "journal", "alternate_names": ["JOIV Int J Informatics Vis"], "issn": "2549-9610", "url": "http://joiv.org/"}, "title": "Applications of Big Data Analytics in Traffic Management in Intelligent Transportation Systems", "abstract": "Big Data technology is emerging as a mass technology that can be applied to many industries in life. Decisions in a wide range of fields may benefit greatly from the information provided by Big Data and Analytics research. One of the areas that have benefited the most from this technology is transportation, which is known as an important field in the development of each nation and possesses a huge treasure of data that traditional technologies cannot handle. Indeed, many countries have applied Big Data-based intelligent transportation systems because it is a traffic system that interacts with vehicles and people on the road, thereby reducing traffic congestion and traffic accidents year by year in many countries. The article presents the applications of Big Data technology in smart traffic systems, thereby providing the perspective of a smart city with a smart traffic system as a critical factor. This paper's analysis indicated that smart cities could be born and further developed through the linkage of Big Data technology and smart traffic systems with smart traffic systems as the core. In addition, the results also showed that the obstacle that needs to be studied at this time is the policy and legal framework for Big Data technology. Therefore, a system managed by the state or shared between the state and the private sector should be studied in the future, aiming to harmonize interests and develop the system extensively.", "venue": "JOIV: International Journal on Informatics Visualization", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-05-31", "journal": {"name": "JOIV : International Journal on Informatics Visualization"}, "authors": [{"authorId": "2251634578", "name": "Hoang Phuong Nguyen"}, {"authorId": "2290449368", "name": "Phuoc Quy Phong Nguyen"}, {"authorId": "2128262144", "name": "V. Bui"}], "citations": [{"paperId": "9dc911ddc2d38d966be235c2541889451a9f4f2e", "title": "Blockchain-Enabled Transfer Learning for Vulnerability Detection and Mitigation in Maritime Logistics"}, {"paperId": "39741fb2a68156a8e669b31bcdd3d516faa4e708", "title": "Strategies for Developing Logistics Centres: Technological Trends and Policy Implications"}, {"paperId": "9eb0ea29146840484ec89323152cf10b731f87ee", "title": "Edge AI-Assisted IoV Application for Aggressive Driver Monitoring: A Case Study on Public Transport Buses"}, {"paperId": "68207a9ae2a8b41d24dc996729f9b63c325bdb02", "title": "Data Science with Semantic Technologies: Application to Information Systems Development"}, {"paperId": "84d0157d56f9d378a6bcb794dbf019fdabbd4992", "title": "Using Artificial Neural Networks for Predicting Ship Fuel Consumption"}, {"paperId": "a3a494e8b182ed47c004bdb05c00962ebf3dd11c", "title": "Hierarchical Analysis of Intelligent Fusion Data of College Training Theory based on Virtual Cloud Classroom"}, {"paperId": "9a3d85d80b061b7c50707b0295bb19d11b186693", "title": "A Distributed Big Data Analytics Architecture for Vehicle Sensor Data"}]}
