{"paperId": "7cfdae1d8e2d261ba6d4972189edfba2d1dc7aa2", "publicationVenue": null, "title": "Apache Spark and MLlib-Based Intrusion Detection System or How the Big Data Technologies Can Secure the Data", "abstract": "Since the turn of the millennium, the volume of data has increased significantly in both industries and scientific institutions. The processing of these volumes and variety of data we are dealing with are unlikely to be accomplished with conventional software solutions. Thus, new technologies belonging to the big data processing area, able to distribute and process data in a scalable way, are integrated into classical Business Intelligence (BI) systems or replace them. Furthermore, we can benefit from big data technologies to gain knowledge about security, which can be obtained from massive databases. The paper presents a security-relevant data analysis based on the big data analytics engine Apache Spark. A prototype intrusion detection system is developed aimed at detecting data anomalies through machine learning by using the k-means algorithm for clustering analysis implemented in Sparks MLlib. The extraction of features to detect anomalies is currently challenging because the problem of detecting anomalies is not actively and exhaustively monitored. The detection of abnormal data can be effectuated by using relevant data that are already in companies’ and scientific organizations’ possession. Their interpretation and further processing in a continuous manner can sufficiently contribute to anomaly and intrusion detection.", "venue": "Inf.", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-01-24", "journal": {"name": "Inf.", "pages": "58", "volume": "13"}, "authors": [{"authorId": "40866415", "name": "Otmane Azeroual"}, {"authorId": "34530294", "name": "Anastasija Nikiforova"}], "citations": [{"paperId": "e4d27b4c30a4811ae9bf4139c4503ab2fb83ac06", "title": "Application research of credit fraud detection based on distributed rotation deep forest"}, {"paperId": "6106c4c13d6d935e22a30b0c2f00882007966648", "title": "An Exploratory Study of Vulnerabilities in Big Data Systems"}, {"paperId": "892ccf560be1fe3a1a024a98402a5019ab833bb5", "title": "From Pixels to Insights: Image Datasets for AI/ML in Software-Defined Networking"}, {"paperId": "d6e810fffd25120d2e1239f23178bbc869ce3337", "title": "Visualization of hyperspectral images on parallel and distributed platform: Apache Spark"}, {"paperId": "adc18e74f5496d9f96fa2c34eb98dee856f3249c", "title": "Cost based Random Forest Classifier for Intrusion Detection System in Internet of Things"}, {"paperId": "9eb2baad7c7fb5048da3f02a7fea3f19fed896e5", "title": "Apache Spark Big data Analysis, Performance Tuning, and Spark Application Optimization"}, {"paperId": "31f4842baee6d15c5fe20d72460a41b83d08c5b7", "title": "Machine learning based data collection protocol for intelligent transport systems: a real-time implementation on Dublin M50, Ireland"}, {"paperId": "fa2e3a354e84aa11d646363094ffb6c85aa9f135", "title": "Frameworks, Applications and Challenges in Streaming Big Data Analytics: A Review"}, {"paperId": "88823e98d601b8f7857df93835e79870a9ed57bc", "title": "RAISING INFORMATION SECURITY AWARENESS USING DIGITAL SERIOUS GAMES WITH EMOTIONAL DESIGN"}, {"paperId": "078820d5dd02ccb4ec079bf27f85c5ef8d685127", "title": "Identifying similar sentences when processed by Apache Spark"}, {"paperId": "c439b362fb33c6bd8e2fcec2804c184ea03da57e", "title": "Evaluating Deep Packet Inspection in Large-scale Data Processing"}, {"paperId": "3b44401e1aef1e42c01215f3d9f575179f771a93", "title": "Reducing the False Negative Rate in Deep Learning Based Network Intrusion Detection Systems"}, {"paperId": "561d3a13b203944d177d5084d502384e1d8f5cc8", "title": "An Intrusion Detection Method for Industrial Control System Based on Machine Learning"}, {"paperId": "0a129ac454bb0ee0db54ff84b1b92bf5fd0c902b", "title": "NoSQL security: can my data-driven decision-making be affected from outside?"}, {"paperId": "7d03909da35bfd5a146f2db2e085241732c0cf4d", "title": "Fuzzy Local Information and Bhattacharya-Based C-Means Clustering and Optimized Deep Learning in Spark Framework for Intrusion Detection"}, {"paperId": "3f318d659d9f9fbc2d9c3f1a5aa9ea164fcf4485", "title": "Incentive Mechanisms for Smart Grid: State of the Art, Challenges, Open Issues, Future Directions"}, {"paperId": "7838f0370cd1b649a98e18d2e7b33a5ea1666db7", "title": "Enhancing the Intrusion Detection Efficiency using a Partitioning-based Recursive Feature Elimination in Big Cloud Environment"}, {"paperId": "fe7926f1e9336b8aa5b8f046065815fa6587e467", "title": "Hybrid Machine Learning-Based Approach for Anomaly Detection using Apache Spark"}, {"paperId": "c83bb50c0a2951edf17b92e89c20557e92dadff3", "title": "Apache Spark in Healthcare: Advancing Data-Driven Innovations and Better Patient Care"}, {"paperId": "472cc2253c9c78b5ad5c8b2db62dbb17af10c07b", "title": "Apache Spark Based Deep Learning for Social Transaction Analysis"}]}
