{"paperId": "7cfe23a50465060fda35b94ce469cc5382cb1c91", "publicationVenue": {"id": "69bcef46-e562-43b7-a194-bbcb9c0d4657", "name": "Public Health Nutrition", "type": "journal", "alternate_names": ["Public Health Nutr"], "issn": "1368-9800", "url": "https://www.cambridge.org/core/journals/public-health-nutrition", "alternate_urls": ["http://journals.cambridge.org/action/displayJournal?jid=PHN"]}, "title": "Association between pre-pregnancy weight status and dietary patterns during pregnancy: results from the Japan Environment and Children’s Study", "abstract": "Abstract Objective: Pre-pregnancy weight status is related to offspring health and may influence dietary patterns during pregnancy. We aimed to evaluate the link between pre-pregnancy weight status and dietary patterns during pregnancy. Design: Dietary data were collected using a FFQ during middle or late pregnancy. Dietary patterns were identified using principal component analysis. Anthropometric data were extracted from medical charts. Multiple linear regression was used to assess associations between pre-pregnancy weight status (severely or moderately underweight, mildly underweight, normal weight, overweight and obese) and dietary patterns during pregnancy after adjusting for socio-demographic characteristics. Setting: Nationwide Japan. Participants: Pregnant Japanese women enrolled in the Japan Environment and Children’s Study, a prospective birth cohort study (n 90 765). Results: We identified three dietary patterns. Compared with women with pre-pregnancy normal weight, those with pre-pregnancy obesity were less likely to habitually consume ‘fruits and vegetables’ pattern (coefficient, –0·18; 95 % CI, –0·21, –0·14) and ‘confectionery’ pattern (coefficient, –0·18; 95 % CI, –0·21, –0·14) and more likely to consume ‘white rice and soy products’ pattern (coefficient, 0·08; 95 % CI, 0·04, 0·11), and those with severely or moderately pre-pregnancy underweight were more likely to consume ‘confectionery’ pattern (coefficient, 0·06; 95 % CI, 0·03, 0·09) during pregnancy, after adjusting for confounders. Conclusion: We found that moderately and severely pre-pregnancy underweight women and those with obesity had unhealthy dietary patterns compared to those with pre-pregnancy normal weight. Our findings suggest that prenatal dietary advice is important and should be based on the pre-pregnancy weight status.", "venue": "Public Health Nutrition", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-02", "journal": {"name": "Public Health Nutrition", "pages": "1807 - 1814", "volume": "26"}, "authors": [{"authorId": "34327137", "name": "Kazue Ishitsuka"}, {"authorId": "1403331517", "name": "K. Yamamoto-Hanada"}, {"authorId": "6763675", "name": "H. Mezawa"}, {"authorId": "1413037867", "name": "M. Saito-Abe"}, {"authorId": "3587878", "name": "Hatoko Sasaki"}, {"authorId": "1500583378", "name": "Minaho Nishizato"}, {"authorId": "47702120", "name": "M. Sato"}, {"authorId": "35266258", "name": "Y. Ohya"}], "citations": []}
