{"paperId": "7d15bfa1e12ed9d2a0b5eaa7a850d46fc0a6346f", "publicationVenue": {"id": "d80d58be-58fc-4181-a397-5ac6fd976a47", "name": "ACM Symposium on Applied Computing", "type": "conference", "alternate_names": ["Sel Area Cryptogr", "Int Conf Sel area Cryptogr", "International Conference on Selected areas in Cryptography", "ACM Symp Appl Comput", "Selected Areas in Cryptography", "Symposium on Applied Computing", "SAC", "Symp Appl Comput"], "url": "https://www.acm.org/publications", "alternate_urls": ["http://sacworkshop.org/"]}, "title": "Data locality and VM interference aware mitigation of data skew in hadoop leveraging modern portfolio theory", "abstract": "Data skew, which is the result of uneven distribution of data among tasks in big data processing frameworks such as MapReduce, causes significant variation in the execution time of tasks and makes their placement on computing resources more challenging. Moreover, with the proliferation of big data processing in the cloud, the interference among virtual machines co-located on the same physical machine exacerbates the aforementioned variation. To tackle this challenge, we propose Locality and Interference aware Portfolio-based Task Assignment (LIPTA) approach. LIPTA leverages the modern portfolio theory to mitigate the variation in execution time of tasks while considering the interference of virtual machines and locality of input data. It selects and assigns groups of tasks (the portfolio) to each machine such that variation of their total execution time is reduced due to portfolio effect. Experimental results using real-world workload logs demonstrate the effectiveness of our LIPTA approach. It can reduce the total execution time of workloads by up to 46.7% compared with several variation-oblivious approaches.", "venue": "ACM Symposium on Applied Computing", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2018-04-09", "journal": {"name": "Proceedings of the 33rd Annual ACM Symposium on Applied Computing"}, "authors": [{"authorId": "1996108", "name": "Seyed Morteza Nabavinejad"}, {"authorId": "1768091", "name": "M. Goudarzi"}], "citations": [{"paperId": "0f01335dfae95b3253a14b5b3977252ec54ad3ca", "title": "A Review on Data locality in Hadoop MapReduce"}, {"paperId": "a2a45b7aa671d55d2617feeb9469bf58e63db188", "title": "MapReduce service provisioning for frequent big data jobs on clouds considering data transfers"}]}
