{"paperId": "7d2182d3cf28ad0aa4abc130a128b506e72e2b0c", "publicationVenue": null, "title": "Design and Implementation of Campus Digital Twin System Based on Game Engine", "abstract": "The design and implementation scheme of game engine is proposed for the campus digital twin system. The system integrates various sensor data and three-dimensional models generated by drone tilt photography technology, providing users with a real-time and highly realistic simulation of the campus environment. It mainly uses the WiFi microcontroller ESP8266 to remotely transmit data from current sensors ACS712, smoke sensors MQ2 and MQ135 and immersion sensors by using the MQTT protocol via message queue. On the backend, it uses Python scripts to parse the uploaded data and store it separately in MySQL and Redis databases. It writes the backend programs by using the Springboot framework and provides the corresponding application program interface API. The front-end adopts the advanced Unreal engine 5 for display and uses the VaRest plugin to send HTTP requests to the back-end, so as to obtain the real-time data for rendering. This article provides the detailed introduction to the design, implementation and optimization process of the system and verifies its effectiveness. In addition, it extensively discusses the basic technologies, definitions and methods which are involved in developing the digital twin system.", "venue": "2023 IEEE International Conference on Sensors, Electronics and Computer Engineering (ICSECE)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-08-18", "journal": {"name": "2023 IEEE International Conference on Sensors, Electronics and Computer Engineering (ICSECE)", "pages": "1343-1349"}, "authors": [{"authorId": "2242615713", "name": "Min Wang"}, {"authorId": "2243512260", "name": "Fengshuo Liu"}, {"authorId": "2242653167", "name": "Xiaotian Bi"}, {"authorId": "2249071607", "name": "Jiyang Zhu"}, {"authorId": "2249323792", "name": "Zikang Zhang"}, {"authorId": "2248254448", "name": "Sijia Zhou"}], "citations": []}
