{"paperId": "7d2cbf7c5f5abf91ffc44c5bb1fb83e9062f2592", "publicationVenue": null, "title": "Interactive Privacy Management: Toward Enhancing Privacy Awareness and Control in the Internet of Things", "abstract": "The balance between protecting user privacy while providing cost-effective devices that are functional and usable is a key challenge in the burgeoning Internet of Things (IoT). In traditional desktop and mobile contexts, the primary user interface is a screen; however, in IoT devices, screens are rare or very small, invalidating many existing approaches to protecting user privacy. Privacy visualizations are a common approach for assisting users in understanding the privacy implications of web and mobile services. To gain a thorough understanding of IoT privacy, we examine existing web, mobile, and IoT visualization approaches. Following that, we define five major privacy factors in the IoT context: type, usage, storage, retention period, and access. We then describe notification methods used in various contexts as reported in the literature. We aim to highlight key approaches that developers and researchers can use for creating effective IoT privacy notices that improve user privacy management (awareness and control). Using a toolkit, a use case scenario, and two examples from the literature, we demonstrate how privacy visualization approaches can be supported in practice.", "venue": "ACM Trans. Internet Things", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-07", "journal": {"name": "ACM Transactions on Internet of Things", "pages": "1 - 34", "volume": "4"}, "authors": [{"authorId": "2219634865", "name": "Bayan AL MUHANDER"}, {"authorId": "2926492", "name": "Jason Wiese"}, {"authorId": "144024945", "name": "Omer F. Rana"}, {"authorId": "2121000333", "name": "Charith Perera"}], "citations": [{"paperId": "bbdc7f601dfde5cb8dbcd39048ed28f106ded11e", "title": "Designing Privacy-Aware IoT Applications for Unregulated Domains"}]}
