{"paperId": "7d2d939cf471e500f8c59996ea5da82a92e3f5a5", "publicationVenue": {"id": "b189dec0-41d0-4cea-a906-7c5186895904", "name": "Global Communications Conference", "type": "conference", "alternate_names": ["GLOBECOM", "Glob Commun Conf"], "url": "http://www.ieee-globecom.org/"}, "title": "Taming Hybrid-Cloud Fast and Scalable Graph Analytics at Twitter", "abstract": "We have witnessed a boosted demand for graph analytics at Twitter in recent years, and graph analytics has become one of the key parts of Twitter's large-scale data analytics and machine learning for driving engagement, serving the most relevant content, and promoting healthier conversations. However, infrastructure for graph analytics has historically not been an area of investment at Twitter, resulting in a long timeline and huge engineering effort for each project to deal with graphs at the Twitter scale. How do we build a unified graph analytics user experience to fulfill modern data analytics on various graph scales spanning from thousands to hundreds of billions of vertices and edges? To bring fast and scalable graph analytics capability into production, we investigate the challenges we are facing in largescale graph analytics at Twitter and propose a unified graph analytics platform for efficient, scalable, and reliable graph analytics across on-premises and cloud to fulfill the requirements of diverse graph use cases and challenging scales. We also conduct quantitative benchmarking on Twitter's production-level graph use cases between popular graph analytics frameworks to certify our solution.", "venue": "Global Communications Conference", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-04-24", "journal": {"name": "GLOBECOM 2022 - 2022 IEEE Global Communications Conference", "pages": "498-503"}, "authors": [{"authorId": "9655650", "name": "Chunxu Tang"}, {"authorId": "2110976880", "name": "Yao Li"}, {"authorId": "2053397", "name": "Zhenxiao Luo"}, {"authorId": "2065507698", "name": "Mainak Ghosh"}, {"authorId": "2119106461", "name": "Huijun Wu"}, {"authorId": "2156147176", "name": "Lu Zhang"}, {"authorId": "2149931837", "name": "Anneliese Lu"}, {"authorId": "2133417801", "name": "Ruchin Kabra"}, {"authorId": "2133417351", "name": "Nikhil Kantibhai Navadiya"}, {"authorId": "2151851962", "name": "Prachi Mishra"}, {"authorId": "2149931597", "name": "Prateek Mukhedkar"}, {"authorId": "2133416850", "name": "Vrushali Channapattan"}], "citations": [{"paperId": "ac096edbb428e65efb65f9b10073336556b896c3", "title": "Serving Hybrid-Cloud SQL Interactive Queries at Twitter"}]}
