{"paperId": "7d2f6a3358e1e869021a218e6e97901476bef18a", "publicationVenue": {"id": "57f970eb-366a-4bfa-aa06-2ff70d834806", "name": "IEEE/ACM International Symposium on Cluster, Cloud and Internet Computing", "type": "conference", "alternate_names": ["Clust Comput Grid", "CCGRID", "IEEE/ACM Int Symp Clust Cloud Grid Comput", "IEEE/ACM International Symposium Cluster, Cloud and Grid Computing", "Cluster Computing and the Grid", "IEEE/ACM Int Symp Clust Cloud Internet Comput"], "url": "http://www.buyya.com/ccgrid/"}, "title": "Adapting the Secretary Hiring Problem for Optimal Hot-Cold Tier Placement Under Top-K Workloads", "abstract": "Top-K queries are an established heuristic in information retrieval. This paper presents an approach for optimal tiered storage allocation under stream processing workloads using this heuristic: those requiring the analysis of only the top-K ranked most relevant documents from a fixed-length stream, stream window, or batch job. Documents are ranked for relevance on a user-specified interestingness function, the top-K stored for further processing. This scenario bears similarity to the classic Secretary Hiring Problem (SHP), and the expected rate of document writes and document lifetime can be modelled as a function of document index. We present parameter-based algorithms for storage tier placement, minimizing document storage and transport costs. We derive expressions for optimal parameter values in terms of tier storage and transport costs a priori, without needing to monitor the application. This contrasts with (often complex) existing work on tiered storage optimization, which is either tightly coupled to specific use cases, or requires active monitoring of application IO load – ill-suited to long-running or one-off operations common in the scientific computing domain. We motivate and evaluate our model with a trace-driven simulation of human-in-the-loop bio-chemical model exploration, and two cloud storage case studies.", "venue": "IEEE/ACM International Symposium on Cluster, Cloud and Internet Computing", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-01-22", "journal": {"name": "2019 19th IEEE/ACM International Symposium on Cluster, Cloud and Grid Computing (CCGRID)", "pages": "576-583"}, "authors": [{"authorId": "3233326", "name": "Ben Blamey"}, {"authorId": "65864741", "name": "Fredrik Wrede"}, {"authorId": "50408573", "name": "Johan Karlsson"}, {"authorId": "2312431", "name": "A. Hellander"}, {"authorId": "3280633", "name": "S. Toor"}], "citations": [{"paperId": "c28cb52a0be1ff70c002c33d6c1a6e95be45ce81", "title": "Cost Optimization for Cloud Storage from User Perspectives: Recent Advances, Taxonomy, and Survey"}, {"paperId": "9c0dd58ec3a6073ff4be660dac8b76bd0b2c0688", "title": "Low-Complexity Recruitment for Collaborative Mobile Crowdsourcing Using Graph Neural Networks"}, {"paperId": "8573f7872c07052d5154007032ad303df3b6f577", "title": "Rapid development of cloud-native intelligent data pipelines for scientific data streams using the HASTE Toolkit"}, {"paperId": "491c37b15d24f9d8c1accb783d609562eba9dd4d", "title": "Apache Spark Streaming, Kafka and HarmonicIO: A Performance Benchmark and Architecture Comparison for Enterprise and Scientific Computing"}, {"paperId": "cd31ee329ddc81aac8e221d7e0d7845931900634", "title": "Benchmarking, Measuring, and Optimizing: Second BenchCouncil International Symposium, Bench 2019, Denver, CO, USA, November 14–16, 2019, Revised Selected Papers"}]}
