{"paperId": "7d2fc0161d45b441004dfd8d6d483c20d2b0d6f9", "publicationVenue": {"id": "2fbc399d-2fbd-4281-b999-990521efd96e", "name": "International Workshop on Intelligent Information Technologies & Systems of Information Security", "type": "conference", "alternate_names": ["IntelITSIS", "Int Workshop Intell Inf Technol  Syst Inf Secur"]}, "title": "Distributed System for Predicting Malicious Activity in Computer Networks", "abstract": "This article introduce a self-organized that based on deep learning (DL) algorithms. A new self-organized incremental neural network FG-SOINN presented in the Python programming language. This self-organized neural network (SOINN) algorithm generates packets of nodes and edges that are cleaned through fixed, user-defined time intervals. This leads to sudden changes in the network structure. This is due to the fact that large regions of the network are removed with a fixed period before the resumption of the training. Such \"oblivion\" conflicts with a more gradual oblivion on a large period of time, which is usually observed in natural cognitive systems. In a self-organized incremental algorithm, the removal of nodes and edges is determined by two parameters. These settings should be improved for each existing program through cross-checking. This article proves that FG-SOINN significantly eliminates this shortcoming, considering removal of nodes and edges as a necessary part of the process of study. Three concepts have been developed and implemented to form FG: Time of idle nodes and edges, reliability and utility of a particular node or edges. It is using these concepts that this algorithm and system will remove nodes and fins. The FG technique or node wear technique determines when and after which node of the period it will be removed. But if they are not updated in the specified time, they are simply deleted. These characteristics make it attractive for the dynamics of the environment, which requires long-term training. To ensure system scalability, the network will be guided by the n parameter. The algorithm starts its work and initiates the network with empty sets of nodes.Next, the nodes are added to the weight vectors. After that, the winner vector (nearest node) and the second winner vector will be searched. Distance measurement formulas will be used to determine the distance. The structure and results of the system demonstrate that this proposition can be adapted to the dynamic profile of network data for both normal and attack classes. The algorithm uses less resources, is faster, and has a higher detection rate than the teaching-teacher method than the traditional SOINN.", "venue": "International Workshop on Intelligent Information Technologies & Systems of Information Security", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"pages": "401-410"}, "authors": [{"authorId": "2214777175", "name": "Denys Liubinetskyi"}, {"authorId": "1783786928", "name": "A. Kashtalian"}, {"authorId": "3234670", "name": "T. Sochor"}, {"authorId": "2106529797", "name": "Andrii Selskyi"}, {"authorId": "2214779291", "name": "Olexandr Klein"}], "citations": []}
