{"paperId": "7d417465bdf254f8b4491c0e4adbace8f49010ab", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Unified View of Grokking, Double Descent and Emergent Abilities: A Perspective from Circuits Competition", "abstract": "Recent studies have uncovered intriguing phenomena in deep learning, such as grokking, double descent, and emergent abilities in large language models, which challenge human intuition and are crucial for a deeper understanding of neural models. In this paper, we present a comprehensive framework that provides a unified view of these three phenomena, focusing on the competition between memorization and generalization circuits. This approach, initially employed to explain grokking, is extended in our work to encompass a wider range of model sizes and training data volumes. Our framework delineates four distinct training dynamics, each depending on varying combinations of model size and training data quantity. Utilizing this framework, we provide a detailed analysis of the double descent phenomenon and propose two verifiable predictions regarding its occurrence, both substantiated by our experimental results. Moreover, we expand our framework to the multi-task learning paradigm, demonstrating how algorithm tasks can be turned into emergent abilities. This offers a novel perspective to understand emergent abilities in Large Language Models.", "venue": "arXiv.org", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-02-23", "journal": {"name": "ArXiv", "volume": "abs/2402.15175"}, "authors": [{"authorId": "2286459314", "name": "Yufei Huang"}, {"authorId": "1576223501", "name": "Shengding Hu"}, {"authorId": "2284728053", "name": "Xu Han"}, {"authorId": "2141313179", "name": "Zhiyuan Liu"}, {"authorId": "2273551430", "name": "Maosong Sun"}], "citations": [{"paperId": "79da7a751caf78b9369bbbd4c7ef4da6b087ee4d", "title": "Conditional computation in neural networks: principles and research trends"}]}
