{"paperId": "7d434537cce3fd903e1ba09e694895fbe3628cbc", "publicationVenue": null, "title": "Get Your Memory Right: The Crispy Resource Allocation Assistant for Large-Scale Data Processing", "abstract": "Distributed dataflow systems like Apache Spark and Apache Hadoop enable data-parallel processing of large datasets on clusters. Yet, selecting appropriate computational resources for dataflow jobs — that neither lead to bottlenecks nor to low resource utilization — is often challenging, even for expert users such as data engineers. Further, existing automated approaches to resource selection rely on the assumption that a job is recurring to learn from previous runs or to warrant the cost of full test runs to learn from. However, this assumption often does not hold since many jobs are too unique. Therefore, we present Crispy, a method for optimizing data processing cluster configurations based on job profiling runs with small samples of the dataset on just a single machine. Crispy attempts to extrapolate the memory usage for the full dataset to then choose a cluster configuration with enough total memory. In our evaluation on a dataset with 1031 Spark and Hadoop jobs, we see a reduction of job execution costs by 56% compared to the baseline, while on average spending less than ten minutes on profiling runs per job on a consumer-grade laptop.", "venue": "2022 IEEE International Conference on Cloud Engineering (IC2E)", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-06-28", "journal": {"name": "2022 IEEE International Conference on Cloud Engineering (IC2E)", "pages": "58-66"}, "authors": [{"authorId": "153294591", "name": "Jonathan Will"}, {"authorId": "2294791", "name": "L. Thamsen"}, {"authorId": "2062906007", "name": "Jonathan Bader"}, {"authorId": "2051551482", "name": "Dominik Scheinert"}, {"authorId": "144754478", "name": "O. Kao"}], "citations": [{"paperId": "742b3ede9a93f166e695ebedfc1bb060b60457ff", "title": "Selecting Efficient Cluster Resources for Data Analytics: When and How to Allocate for In-Memory Processing?"}, {"paperId": "4c27e561d7c0a78fc4f7593235c021d08ab6e1e0", "title": "Towards Advanced Monitoring for Scientific Workflows"}, {"paperId": "150d620b3207725c4db1ae464e8182bd2c611586", "title": "Leveraging Reinforcement Learning for Task Resource Allocation in Scientific Workflows"}, {"paperId": "23a6e0bd5ef9e9deeb0b939b1521b97dc54a0707", "title": "Ruya: Memory-Aware Iterative Optimization of Cluster Configurations for Big Data Processing"}, {"paperId": "f1934721a369b99949d374beebf466814118d462", "title": "Macaw: The Machine Learning Magnetometer Calibration Workflow"}]}
