{"paperId": "7d457bec0947e3725d6af271319d83a2b9062803", "publicationVenue": null, "title": "GETS : Sentence Scoring Scheme in Graph-based Extractive Text Summarization for Text Mining Applications", "abstract": "Recently, there is an exponential inﬂux of textual data in big data applications, which necessitates the requirement of text mining tools for analysis of data. In Text Mining applications (TM), Text Summarization (TS) has emerged as an emergent ﬁeld in Natural Language Processing (NLP). Mostly, in TS, abstractive approaches are presented which build complex models, and thus, a shift is envisioned towards graph-based extractive text summarization models. Such models allow review and feedback analysis of a service or product, and have the beneﬁts of being less complex, ﬂexible, and require low computational resources. This makes them an eﬀective ﬁt for modern text mining based big data and Internet-of-Things (IoT) applications. Thus, in the proposed work, we present a scheme, GETS , which exploits a graph-based model to establish relations between words and sentences based on statistical operations. In the scheme, a post processing phase is presented which uses sentence clustering based on graph preparation. To make the scheme scalable ﬁt for real world applications, we use the Apache Spark environment for parallel execution of graph-based operations. In experimental setup, the Recall-oriented Understudying Gisting Evaluation (ROUGE) parameters is used to evaluate the proposed graph based model with a comparative analysis with ROUGE 1,2,L measures. Comparative analysis is done based on clustered and non-clustered approaches. The obtained results renders the scheme eﬀective as a backend of Artiﬁcial Intelligence (AI) models in crowdsourcing applications and decision-analytics models.", "venue": "", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": null, "journal": null, "authors": [{"authorId": "32740225", "name": "Pronaya Bhattacharya"}, {"authorId": "2059051509", "name": "J. P. Verma"}, {"authorId": "2233191945", "name": "Shir Bhargav"}, {"authorId": "2073842862", "name": "Madhuri Bhavsar"}], "citations": []}
