{"paperId": "7d4a18c5cd6c739b4b445094cd658142da739782", "publicationVenue": null, "title": "“I Can’t Keep It Up Anymore.” A Dataset from the Defunct Voat.co News Aggregator", "abstract": "Voat was a news aggregator website that shut down on December 25, 2020. The site had a troubled history and was known for hosting various banned subreddits. This paper presents a dataset with over 2 . 3 M submissions and 16 . 2 M comments posted from 113 K users in 7 . 1 K subverses (the equivalent of subreddit for Voat). Our dataset covers the whole lifetime of Voat, from its developing period starting on November 8, 2013, the day it was founded, April 2014, up until the day it shut down (December 25, 2020). This work presents the largest and most complete publicly available Voat dataset, to the best of our knowledge. We also present a preliminary analysis to cover posting activity and daily user and subverse registration on the platform so that researchers interested in our dataset can know what to expect. Our data may prove helpful to false news dissemination studies as we analyze the links users share on the platform, ﬁnding that many communities rely on alternative news press, like Breitbart and GatewayPundit, for their daily discussions. Last, we perform network analysis on user interactions ﬁnding that many users prefer not to interact with sub-verses outside their narrative interests, which could be helpful to researchers focusing on polarization and echo chambers. Also, since Voat was one of the platforms many Red-dit users migrated to after a ban, we are conﬁdent that our dataset will motivate and assist researchers studying deplat-forming. In addition, many hateful and conspiratorial communities seem to be very popular on Voat, which makes our work valuable for researchers focusing on toxicity, conspir-acy theories, cross-platform studies of social networks, and natural language processing", "venue": "", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "2279553027", "name": "Amin Mekacher"}, {"authorId": "9207147", "name": "Antonis Papasavva"}], "citations": [{"paperId": "975a2ff83e207340385d07499a2c9414fec7d3b2", "title": "Waiting for Q: An Exploration of QAnon Users' Online Migration to Poal in the Wake of Voat's Demise"}, {"paperId": "ac01adc12cd2a1fd6381e57afbe77d20d8d8fe88", "title": "Understanding Online Migration Decisions Following the Banning of Radical Communities"}, {"paperId": "9ae39b1b2a029bd0134c4e115136a7acd91d0fd3", "title": "\"I can't keep it up anymore.\" The Voat.co dataset"}]}
