{"paperId": "7d76d5162b953166ea3f7757ed6bf3d320e502da", "publicationVenue": {"id": "02efd70e-db1b-4898-8ce4-67264f7c2559", "name": "Proceedings of the Pakistan Academy of Sciences: A. Physical and Computational Sciences", "type": "journal", "alternate_names": ["Proc Pak Acad Sci Phys Comput Sci"], "issn": "2518-4245"}, "title": "Design and Implementation of Low-Cost Data Acquisition System for Small and Medium Enterprises (SMEs) of Pakistan", "abstract": "This paper presents the development of low-cost and robust industrial IoT based data acquisition system primarily focused on domestic manufacturing industries striving to achieve goals and benefits of “Industrial 4.0”. This proposes aims to promote DAQ System integration in traditional manufacturing process of the small and mid-sized industries of Pakistan with limited capacity of investment. Proposed method comprises of Arduino and it’s IoT features for Data Collection, along with a self-developed PC based Centralized Software for Collection of Data, Graphical User Display and Storing collected Data in Local SQL Database. PC based Software replaces requirement of multiple software in case of traditional low-cost DAQ systems, like OPC Software for collecting data from industrial hardware, Java or PHP based any GUI and SQL Data storage. The analysis of work is done with the help of the Message Queue Telemetry Transport (MQTT) protocol. This project will be in further stages evaluated to add features of Supervisory Control, along with Data Acquisition hardware with minimum increase in cost and further upgrading PC Software to add more features of Industry 4.0, as compared to costly commercial solutions available in the market. A machine learning algorithm, k-nearest neighbors algorithm has been used to classify sensitive and non-sensitive data for improvising cloud security. K-Nearest Neighbors is also called KNN algorithm which is supervised machine learning classifier.", "venue": "Proceedings of the Pakistan Academy of Sciences: A. Physical and Computational Sciences", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-11-24", "journal": {"name": "Proceedings of the Pakistan Academy of Sciences: A. Physical and Computational Sciences"}, "authors": [{"authorId": "32011989", "name": "M. I. Majid"}, {"authorId": "2242065444", "name": "Ejaz Malik"}, {"authorId": "1581318674", "name": "Tahniyat Aslam"}, {"authorId": "69474863", "name": "Osama Mahfooz"}, {"authorId": "32006317", "name": "Fatima Maqbool"}], "citations": []}
