{"paperId": "7d8a7650684d0542a364da4984d6fad5299bc678", "publicationVenue": {"id": "38a8edf0-2998-4daf-93f7-16f34689e228", "name": "IEEE Systems Journal", "type": "journal", "alternate_names": ["IEEE Syst J"], "issn": "1932-8184", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=4267003", "alternate_urls": ["http://www.systemsjournal.org/"]}, "title": "PPRT: Privacy Preserving and Reliable Trust-Aware Platoon Recommendation Scheme in IoV", "abstract": "Vehicular platoon is an evolved driving pattern in Internet of Vehicles (IoV) that consists of a platoon head (PH) vehicle and several member vehicles to reduce fuel consumption and enhance communication efficiency. In such vehicular platoon system, PH vehicles' reputation is calculated according to feedback reports provided by its member vehicles. Hence, it is essential to calculate a truthful reputation for PH vehicle without revealing the privacy and weight information of member vehicles. Inspired by this, we explore homomorphic encryption, data perturbation, and truth discovery techniques to design a privacy-preserving and reliable trust-aware platoon recommendation scheme. Compared with existing schemes, this article features the following advantages. The feedback reports collection process and never reveals the privacy and weight information of member vehicles. Besides, PH vehicles' reputation is iteratively calculated by fog node and cloud service provider without the involvement of member vehicles, which considers high-speed mobility and equipment limitations of vehicles. The security analysis illustrates that our scheme fulfills security requirements of IoV. Further, we deployed Network Simulator-3 (NS-3) and Simulation of Urban Mobility (SUMO) for simulations, which demonstrated that our scheme reduces the computation burden by at least <inline-formula><tex-math notation=\"LaTeX\">${42.62{\\%}}$</tex-math></inline-formula>, communication burden by at least <inline-formula><tex-math notation=\"LaTeX\">${2{\\%}}$</tex-math></inline-formula>, and storage burden by at least <inline-formula><tex-math notation=\"LaTeX\">${45.95{\\%}}$</tex-math></inline-formula>, compared with related schemes.", "venue": "IEEE Systems Journal", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-01", "journal": {"name": "IEEE Systems Journal", "pages": "4922-4933", "volume": "17"}, "authors": [{"authorId": "48925088", "name": "Hongyuan Cheng"}, {"authorId": "2162627130", "name": "Xianchao Zhang"}, {"authorId": "2209876719", "name": "Jingkang Yang"}, {"authorId": "3289574", "name": "Yining Liu"}], "citations": []}
