{"paperId": "7d921c0676b418a3f663f1f92dfdcea7cd6ff5d9", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Use of Receiver Operating Characteristic Curve to Evaluate a Street Lighting Control System", "abstract": "Intelligent control of public lighting is nowadays one of the most challenging issues in smart city deployment. Lighting optimization entails a compromise between comfort, safety, and power consumption, affecting both vehicles and pedestrians. Smart solutions must estimate their characteristics to trade-off users’ needs and energy requirements. This paper proposes an intelligent street lighting control system and the Receiver Operating Characteristic (ROC) curve method to evaluate the best number of street lamps to achieve a balance between public road user comfort and system power consumption. The control system is based on the detection of users, mainly pedestrians, using presence sensors. From the detection of a pedestrian by two or more consecutive street lamps it is possible to determine their speed. Knowing the pedestrian speed, allows the system to anticipate and adjust the light intensity of the remaining street lamps, and provide a comfortable view of the street. Using the ROC curve, we evaluate the control algorithm in terms of the number of previous street lamps used. We have tested the system and the method in a model of pedestrians walking down a street. The obtained results show that ROC analysis used to control street lighting allows measuring the whole control system’s efficiency by providing a concrete number of previous street lamps.", "venue": "IEEE Access", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "144660-144675", "volume": "9"}, "authors": [{"authorId": "1402334873", "name": "José-Luis Poza-Luján"}, {"authorId": "1417570651", "name": "Juan-José Sáenz-Peñafiel"}, {"authorId": "1402334914", "name": "Juan-Luis Posadas-Yagüe"}, {"authorId": "145489608", "name": "J. Conejero"}, {"authorId": "144651767", "name": "Juan-Carlos Cano"}], "citations": [{"paperId": "21f69c614c2d0d0c26333ab8bac8cd569fb736c7", "title": "Smart Street Light Control: A Review on Methods, Innovations, and Extended Applications"}, {"paperId": "1b4072926ea527dee599d4e67dfaf9320a40ee5f", "title": "Development of public lighting system with smart lighting control systems and internet of thing (IoT) technologies for smart city"}, {"paperId": "2464183f9703edabcffe9e76aec1ddb51951a949", "title": "The Energy-Efficient Control Solutions of Smart Street Lighting Systems: A Review, Issues, and Recommendations"}]}
