{"paperId": "7da4254a0db084ed175ccaaed544a2fc6c4a04e3", "publicationVenue": null, "title": "Unsupervised Behaviour Analysis of News Consumption in Turkish Media", "abstract": "Clickstream data, which come with a massive volume generated by human activities on websites, have become a prominent feature for identifying readers’ characteristics by newsrooms after the digitization of news outlets. It is essential to have elastic architectures to process the streaming data, particularly for unprecedented traﬃc, enabling conducting more comprehensive analyses, such as rec-ommending mostly related articles to readers. Although the nature of clickstream data has a similar logic within websites, it has inherent limitations to recognize human behaviours when looking from a broad perspective, which brings the need to limit the problem in niche areas. This study investigates the anonymized readers’ click activities on the organizations’ websites to identify news consumption patterns following referrals from Twitter, who incidentally reach but propensity is mainly routed news content. The investigation is widened to a broad perspective by linking the log data with news content to enrich the insights rather than sticking into the web journey. Methodologies for ensemble cluster analysis with mixed-type embedding strategies are applied and compared to ﬁnd similar reader groups and interests independent of time. Various internal validation perspectives are used to determine the optimality of the quality of clusters, where the Calinski Harabasz Index (CHI) is found to give a generalizable result. Our ﬁndings demonstrate that clustering a mixed-type dataset approaches the optimal internal validation scores, which we deﬁne to discriminate the clusters and algorithms considering applied strategies, when embedded by Uniform Manifold Approximation and Projection (UMAP) and using a consensus function as a key to access the most applicable hyper parameter conﬁgurations in the", "venue": "", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2022-02-04", "journal": null, "authors": [{"authorId": "150971197", "name": "Didem Makaroglu"}, {"authorId": "2053259725", "name": "Altan Cakir"}, {"authorId": "35131167", "name": "B. U. Toreyin"}], "citations": []}
