{"paperId": "7db34aead4ad98fb777d587e84b4b96f79e27958", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "WUDI: A Human Involved Self-Adaptive Framework to Prevent Childhood Obesity in Internet of Things Environment", "abstract": "The Internet of Things (IoT) connects people, devices, and information resources, in various domains to improve efficiency. The healthcare domain has been transformed by the integration of the IoT, leading to the development of digital healthcare solutions such as health monitoring, emergency detection, and remote operation. This integration has led to an increase in the health data collected from a variety of IoT sources. Consequently, advanced technologies are required to analyze health data, and artificial intelligence has been employed to extract meaningful insights from the data. Childhood overweight and obesity have emerged as some of the most serious global public health challenges, as they can lead to a variety of health-related problems and the early development of chronic diseases. To address this, a self-adaptive framework is proposed to prevent childhood obesity by using lifelog data from IoT environments, with human involvement being an important consideration in the framework. The framework uses an ensemble-based learning model to predict obesity using the lifelog data. Empirical experiments using lifelog data from smartphone applications were conducted to validate the effectiveness of human involvement and obesity prediction. The results demonstrated the efficiency of the proposed framework with human involvement in obesity prediction. The proposed framework can be applied in real-world healthcare services for childhood obesity.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-30", "journal": {"name": "ArXiv", "volume": "abs/2308.15944"}, "authors": [{"authorId": "1880611", "name": "Euijong Lee"}, {"authorId": "2179307112", "name": "Jaemin Jung"}, {"authorId": "2235833677", "name": "Gee-Myung Moon"}, {"authorId": "2234854986", "name": "Seong-Whan Lee"}, {"authorId": "2804094", "name": "Ji-Hoon Jeong"}], "citations": [{"paperId": "150bbb7d40f735e048a6f2d43f1bf4fef19ad888", "title": "DeepHealthNet: Adolescent Obesity Prediction System Based on a Deep Learning Framework"}]}
