{"paperId": "7dc215cbc3c3e2d93ac5789e989af3659c133eb0", "publicationVenue": null, "title": "Applications of geospatial big data in the Internet of Things", "abstract": "The Internet of Things (IoT) paradigm represents networks of objects that, without requiring human action, sense and interact with the environment, collect data, and transmit these data for users and applications via the internet. IoT applications can generate a massive amount of data, with a significant part containing geospatial aspects and requiring applications to deal with the objects' geospatial relationships and extract information and knowledge. This article describes a systematic literature mapping investigating the geospatial evolution of big data in the IoT. For the mapping, 116 documents were selected from four academic databases—Scopus, IEEE Xplore, ACM Digital Library, and Web of Science—and classified according to their main contributions. The analysis of these works allowed us to view what domains have applied geospatial big data from IoT, the artifacts that support this application, and the most prolific authors and venues involved in this research area.", "venue": "Trans. GIS", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-09-24", "journal": {"name": "Transactions in GIS", "pages": "41 - 71", "volume": "26"}, "authors": [{"authorId": "1492175284", "name": "D. S. Silva"}, {"authorId": "143906110", "name": "M. Holanda"}], "citations": [{"paperId": "78f5a4a1ab437d4c790f5f9e313be4facfcbfee1", "title": "Integration of migration and attention flow data to reveal association of virtual–real dual intercity network structure"}, {"paperId": "16115e039d92a9fca5d3ef538179b48b79663c54", "title": "FogLBS: Utilizing fog computing for providing mobile Location-Based Services to mobile customers"}, {"paperId": "4b8f5c1cd446fea85afde1746e4ac0107a348e4e", "title": "Fast clustering algorithm based on MST of representative points."}, {"paperId": "104d1f9ef88e766ea1c98e605c4a10c51f15a373", "title": "Performance evaluation of priority Queueing assisted IoST-Fog-Blockchain framework in Geospatial Cloud Environment"}, {"paperId": "73581e6df0c5de38136de4cea4d93889e16a3872", "title": "Transforming Social Determinants to Educational Outcomes: Geospatial Considerations"}]}
