{"paperId": "7dec8a25543921c1d00cd0a9003ce0d4038bea22", "publicationVenue": {"id": "deedf64a-dd5c-4b33-b345-ff83bfb93d71", "name": "International Symposium on Computer Architecture", "type": "conference", "alternate_names": ["Int Symp Comput Archit", "ISCA"], "url": "http://www.cs.wisc.edu/~arch/www/"}, "title": "GenDP: A Framework of Dynamic Programming Acceleration for Genome Sequencing Analysis", "abstract": "Genomics is playing an important role in transforming healthcare. Genetic data, however, is being produced at a rate that far outpaces Moore's Law. Many efforts have been made to accelerate genomics kernels on modern commodity hardware such as CPUs and GPUs, as well as custom accelerators (ASICs) for specific genomics kernels. While ASICs provide higher performance and energy efficiency than general-purpose hardware, they incur a high hardware design cost. Moreover, in order to extract the best performance, ASICs tend to have significantly different architectures for different kernels. The divergence of ASIC designs makes it difficult to run commonly used modern sequencing analysis pipelines due to software integration and programming challenges. With the observation that many genomics kernels are dominated by dynamic programming (DP) algorithms, this paper presents GenDP, a framework of dynamic programming acceleration including DPAx, a DP accelerator, and DPMap, a graph partitioning algorithm that maps DP objective functions to the accelerator. DPAx supports DP kernels with various dependency patterns, such as 1D and 2D DP tables and long-range dependencies in the graph structure. DPAx also supports different DP objective functions and precisions required for genomics applications. GenDP is evaluated on genomics kernels in both short-read and long-read analysis pipelines, achieving 157.8× throughput/mm2 over GPU baselines and 132.0× throughput/mm2 over CPU baselines.", "venue": "International Symposium on Computer Architecture", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2023-06-17", "journal": {"name": "Proceedings of the 50th Annual International Symposium on Computer Architecture"}, "authors": [{"authorId": "2220855404", "name": "Yufeng Gu"}, {"authorId": "30731918", "name": "Arun K. Subramaniyan"}, {"authorId": "2113924665", "name": "Tim Dunn"}, {"authorId": "10724434", "name": "Alireza Khadem"}, {"authorId": "2110720794", "name": "Kuan-Yu Chen"}, {"authorId": "7908929", "name": "Somnath Paul"}, {"authorId": "2228059", "name": "Md. Vasimuddin"}, {"authorId": "3215200", "name": "Sanchit Misra"}, {"authorId": "1687117", "name": "D. Blaauw"}, {"authorId": "1678884", "name": "S. Narayanasamy"}, {"authorId": "40040123", "name": "R. Das"}], "citations": [{"paperId": "a9f8da4e8a26fca3afa1f940db40f91d9d354aa8", "title": "An In-Memory Architecture for High-Performance Long-Read Pre-Alignment Filtering"}]}
