{"paperId": "7df3df4f8961ee456d2e29e6b6f367a49b1dc418", "publicationVenue": null, "title": "Uma Proposta de Implementação de Álgebra de Workflows em Apache Spark no Apoio a Processos de Análise de Dados", "abstract": "The typical activity of a Data Scientist involves the implementation of various processes that characterize data analysis experiments. In these analyzes there is a need to execute several codes in different programming languages (Python, R, C, Java, and Scala) in different parallel and distributed processing environments. Depending on the complexity of the process and the numerous possibilities for distributed execution of these solutions, it may be necessary to spend a lot of energy on different implementations that take the Data Scientist away from his ultimate goal of producing knowledge from large volumes of data. In this context, this paper aims to support this difficulty by proposing the construction of a framework conceived from an algebraic approach that isolates the process modeling from the difficulty of optimally executing such workflows. The proposal presents a typical Extract Transform Load (ETL) workflow for performing data analysis and points to promising results in terms of representation and abstraction/isolation potential of the execution environment. Resumo. A atividade tı́pica de um Cientista de Dados envolve a implementação de diversos processos que caracterizam experimentos de análise de dados. Nestas análises há a necessidade de executar diversos códigos em diferentes linguagens de programação (Python, R, C, Java e Scala) em diferentes ambientes de processamento paralelo e distribuı́do. Dependendo da complexidade do processo e das inúmeras possibilidades para execução distribuı́da destas soluções, pode ser necessário gastar muito energia em diferentes implementações que afastam o Cientista de Dados do seu objetivo final, que é produzir conhecimento a partir dos grandes volumes de dados. Dentro deste contexto, este trabalho visa apoiar na solução de tal dificuldade ao propor a construção de um framework concebido a partir de uma abordagem algébrica que isola a modelagem do processo da dificuldade de executar, de modo otimizado, tais workflows. A proposta apresenta um workflow tı́pico de Extract Transform Load (ETL) para realização de análise de dados e aponta para resultados promissores em termos de representação e potencial de abstração/isolamento do ambiente de execução.", "venue": "", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2020-02-18", "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "145873565", "name": "J. A. Ferreira"}, {"authorId": "82717050", "name": "D. Gaspar"}, {"authorId": "2073618117", "name": "Bernardo Monteiro"}, {"authorId": "143821689", "name": "Ana Beatriz Cruz"}, {"authorId": "2064319003", "name": "Fábio Porto"}, {"authorId": "2083080838", "name": "Eduardo S. Ogasawara"}], "citations": [{"paperId": "0050eea2c464e06d019bce218aaacb72a9123efa", "title": "Rumo à Otimização de Operadores sobre UDF no Spark"}]}
