{"paperId": "7dfb2d42214874edf3f58a25000a188be8c25a6e", "publicationVenue": null, "title": "Uncertainty Handling in Genetic Risk Assessment and Counseling", "abstract": "In this paper, we consider genetic risk assessment and genetic counseling for breast cancer from the point of view of reliable uncertainty handling. In medical practice, there exist fairly accurate numerical tools predicting breast cancer (or gene mutation) probability based on such factors as the family history of a patient. However, they are too complex to be applied in normal doctors’ offices, so that several simplified, questionnaire-type support tools appeared. This process is highly affected by uncertainty. At the same time, reliability of test interpretations and counseling conclusions is especially important since they have direct influence on humans and their decisions. We show how expert opinions on mutation probabilities can be combined using the Dempster-Shafer theory. Based on multi-criteria binary decision trees and interval analysis, we combine the referral screening tool designed to determine patients at risk of breast cancer (and recommend genetic counseling or testing for them) with three further risk assessment tools available for this purpose. A patient’s confidence in the outcome of a genetic counseling session can be heightened by the proposed method since it combines different sources to provide score ranges leading to more information. Finally, based on this approach, a decision tree for assigning a risk category is proposed which enhances the existing methodology. The great impact of epistemic uncertainty is reflected through large overlapping intervals for the risk classes.", "venue": "Journal of universal computer science (Online)", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-12-28", "journal": {"name": "J. Univers. Comput. Sci.", "pages": "1347-1370", "volume": "27"}, "authors": [{"authorId": "3255827", "name": "E. Auer"}, {"authorId": "145283941", "name": "W. Luther"}], "citations": [{"paperId": "af87b7648fedc75b56a3c3648b3fd46396fee6d2", "title": "Towards a Traceable Data Model Accommodating Bounded Uncertainty for DST Based Computation of BRCA1/2 Mutation Probability With Age"}, {"paperId": "638e09672c32e2a235be4c1115b59bf4d4f0d7be", "title": "Dempster-Shafer Theory Based Uncertainty Models for Assessing Hereditary, BRCA1/2-Related Cancer Risk"}]}
