{"paperId": "7e0b54e7f667a3b5214cc2113075343dd0e0dca5", "publicationVenue": {"id": "2018b690-8eab-42c2-8397-9d67983f7a69", "name": "Biophysical Journal", "type": "journal", "alternate_names": ["Biophys J"], "issn": "0006-3495", "url": "http://www.cell.com/biophysj/", "alternate_urls": ["http://www.biophysj.org/"]}, "title": "Molecular Insights from Conformational Ensembles via Machine Learning", "abstract": null, "venue": "Biophysical Journal", "year": 2019, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-12-21", "journal": {"name": "Biophysical Journal", "pages": "765 - 780", "volume": "118"}, "authors": [{"authorId": "95566541", "name": "Oliver Fleetwood"}, {"authorId": "3249073", "name": "M. Kasimova"}, {"authorId": "30427104", "name": "Annie M. Westerlund"}, {"authorId": "6066455", "name": "L. Delemotte"}], "citations": [{"paperId": "9fc7eaa93c3a27bdb86a22fc9b7dfa167c806577", "title": "Toward physics‐based precision medicine: Exploiting protein dynamics to design new therapeutics and interpret variants"}, {"paperId": "97e314d0300d6661d5f00069574bab0b48df7be9", "title": "Binding to nucleosome poises human SIRT6 for histone H3 deacetylation"}, {"paperId": "efff37bc1fd77e2ab8e485a13463ea3ba3634bc3", "title": "GPCR molecular dynamics forecasting using recurrent neural networks"}, {"paperId": "4fa46b0b4cc2910bbaba173cc41d9ca65de9305d", "title": "Online Boosted Gaussian Learners for In-Situ Detection and Characterization of Protein Folding States in Molecular Dynamics Simulations"}, {"paperId": "58dcd876f80e1d2556250cd466506451da3fddf5", "title": "Toward a Benchmark for Markov State Models: The Folding of HP35."}, {"paperId": "10b95af4325c343c3d5bdd801d8998562a90deee", "title": "A unified framework for machine learning collective variables for enhanced sampling simulations: mlcolvar."}, {"paperId": "01e6d5e2ed6ce9101a47c2362b60b0b255f32a3a", "title": "Can artificial intelligence help a clinical laboratory to draw useful information from limited data sets ? Application to Mixed Connective Tissue Disease"}, {"paperId": "a2bfba9f1cf4c8e1ebe66bd74deb5ac5c0254612", "title": "Resolving Protein Conformational Plasticity and Substrate Binding via Machine Learning."}, {"paperId": "d878b874b542de6db81ca40b4840a401fa980060", "title": "Exploring and Learning the Universe of Protein Allostery Using Artificial Intelligence Augmented Biophysical and Computational Approaches"}, {"paperId": "2bcf9c722e160a46fbd5e4b9f53a994dcf2e01f4", "title": "Revealing the Molecular Interactions between Human ACE2 and the Receptor Binding Domain of the SARS-CoV-2 Wild-Type, Alpha and Delta Variants"}, {"paperId": "acb4500dbe32454b002d20a4192d6e603117e672", "title": "Rational and mechanistic approaches for improving biocatalyst performance"}, {"paperId": "e51863b6097cbe2aa2d5598211967928dc03de42", "title": "Markov state modelling reveals heterogeneous drug-inhibition mechanism of Calmodulin"}, {"paperId": "610624932a8caf26f130b437dd151915311046b2", "title": "Characterization of RNA polymerase II trigger loop mutations using molecular dynamics simulations and machine learning"}, {"paperId": "7f76f9d14e0a19bb34c41e0ffe37553589bd14b2", "title": "Thermodynamics of Interpretation"}, {"paperId": "dda370d49e28d5f4b7199d581183f1c5671bc303", "title": "Novel insights into the structural changes induced by disease-associated mutations in TDP-43: a computational approach"}, {"paperId": "f0e48f0ee2e92c8b831e6598573e8126d3ed3d4f", "title": "How Fragile We Are: Influence of Stimulator of Interferon Genes (STING) Variants on Pathogen Recognition and Immune Response Efficiency"}, {"paperId": "bb79d9cd244a46ec8f94f6aa057a7872be938b2c", "title": "Specific Recognition of the 5′-Untranslated Region of West Nile Virus Genome by Human Innate Immune System"}, {"paperId": "13dc2b43477777f6a174c282477310e067263c32", "title": "Characterizing metastable states with the help of machine learning"}, {"paperId": "32c074bdbff0a37559e7bc16a00a80361a71d6af", "title": "Recent Advances in Machine Learning Variant Effect Prediction Tools for Protein Engineering."}, {"paperId": "234eb5b8624db45577bc5e75e00e239491981cc5", "title": "Allostery: Allosteric Cancer Drivers and Innovative Allosteric Drugs."}, {"paperId": "fe16255bbbfbd74b63b4bbf72899069830ff27d3", "title": "An Interpretable Convolutional Neural Network Framework for Analyzing Molecular Dynamics Trajectories: a Case Study on Functional States for G-Protein-Coupled Receptors"}, {"paperId": "b44d831a3e6e394d6db92139f4f2fba5bbe5b6f3", "title": "GLOW: A Workflow Integrating Gaussian-Accelerated Molecular Dynamics and Deep Learning for Free Energy Profiling."}, {"paperId": "32c154c74b44f36c6749e91ba2c1f9d1d005c0bf", "title": "Is There a Need for a More Precise Description of Biomolecule Interactions to Understand Cell Function?"}, {"paperId": "12afd8ddb77b9149f3823390448fc778a1cdafa6", "title": "Resolving Protein Conformational Plasticity and Substrate Binding Through the Lens of Machine-Learning"}, {"paperId": "03c85a13243f7f00ab9beff98aa686905aa30910", "title": "Autophagy and evasion of the immune system by SARS-CoV-2. Structural features of the non-structural protein 6 from wild type and Omicron viral strains interacting with a model lipid bilayer"}, {"paperId": "a8e285e60c96e67901beb62d6cc709ee0efe2763", "title": "Resolving Dynamics in the Ensemble: Finding Paths through Intermediate States and Disordered Protein Structures."}, {"paperId": "7e9489c3f871a007d61bbad4a6d6746da8c3367d", "title": "Mechanotransduction as a major driver of cell behaviour: mechanisms, and relevance to cell organization and future research"}, {"paperId": "80f2c48ffd29dcb76a551fbfd42a6870438978b2", "title": "Identification of electroporation sites in the complex lipid organization of the plasma membrane"}, {"paperId": "2b9d67f82fb26e99ea49a7299dbd494e2a9a4228", "title": "Risk Prediction of Cardiovascular Events by Exploration of Molecular Data with Explainable Artificial Intelligence"}, {"paperId": "9e1eadae0055cf3d52ec18c74008856cb9c0b1eb", "title": "Molecular Mechanisms Associated with Clustered Lesion-Induced Impairment of 8-oxoG Recognition by the Human Glycosylase OGG1"}, {"paperId": "6c1cd5414c4b34bdbd50b43cfd0201f4b8d8a875", "title": "Unravelling the effects of disease-associated mutations in TDP-43 protein via molecular dynamics simulation and machine learning"}, {"paperId": "974d23189aea0233f61e161bf485316d3e82efd9", "title": "Allosteric Effect of Nanobody Binding on Ligand-Specific Active States of the β2 Adrenergic Receptor"}, {"paperId": "f80244fcbe5822f4d6b2b061783b899d96f560ab", "title": "AI-driven prediction of SARS-CoV-2 variant binding trends from atomistic simulations"}, {"paperId": "460b914b90a312e049fb044caffbc4c92dd89382", "title": "Machine Learning Reveals the Critical Interactions for SARS-CoV-2 Spike Protein Binding to ACE2"}, {"paperId": "a14450e3118cb23e0018f1a032883504606024a5", "title": "Deep learning the structural determinants of protein biochemical properties by comparing structural ensembles with DiffNets"}, {"paperId": "ea24fede9ce0b7e99302289c56714eff286d911c", "title": "Recognition of a tandem lesion by DNA bacterial formamidopyrimidine glycosylases explored combining molecular dynamics and machine learning"}, {"paperId": "18502999e7e9c3cb38477d0a622f041fa636543d", "title": "Computational studies of the mitochondrial carrier family SLC25. Present status and future perspectives"}, {"paperId": "fdbeacced7bc7c6117dc4e647e9cb25db43a7740", "title": "Critical interactions for SARS-CoV-2 spike protein binding to ACE2 identified by machine learning"}, {"paperId": "ae46621a0e4dc797f25ae890ecf455c637cc9b81", "title": "Recognition of a Tandem Lesion by DNA Glycosylases Explored Combining Molecular Dynamics and Machine Learning"}, {"paperId": "aacefe263c09730f4189f58c0f7fa944e999547a", "title": "Molecular Dynamics Approach for Capturing Calixarene-Protein Interactions: The Case of Cytochrome C."}, {"paperId": "f97964fd13dfccf136dfca52a9d9e4840e34211b", "title": "Predicting new protein conformations from molecular dynamics simulation conformational landscapes and machine learning"}, {"paperId": "d6f54d0a4e97d3b356bb20ec7479ea7f83f1e3d0", "title": "Identification of ligand-specific G protein-coupled receptor states and prediction of downstream efficacy via data-driven modeling"}, {"paperId": "a7b01ea68d993ee08af71ffeefb28c61fbf930ce", "title": "AE-LGBM: Sequence-Based Novel Approach To Detect Interacting Protein Pairs via Ensemble of Autoencoder and LightGBM"}, {"paperId": "df4dce3513b71e0ddcb8ab284fdd498d1864ec63", "title": "Modeling the formation and growth of atmospheric molecular clusters: A review"}, {"paperId": "22ad90c0d3ca8be0929c70b58ce3e53f2f255788", "title": "Integrating NMR and simulations reveals motions in the UUCG tetraloop"}, {"paperId": "116bb50116982f0aaafb8e12234ac8a8ffb2aed7", "title": "Impact of the nucleosome histone core on the structure and dynamics of DNA containing pyrimidine-pyrimidone (6-4) photoproduct"}, {"paperId": "8410b8adc7fe22eb074ad9fbae2507ec0d1c67e6", "title": "A Two-ended DAta-Driven Accelerated Sampling Method for Exploring the Transition Pathways between Two Known States of Protein."}, {"paperId": "a5d1e6f46bd2679ff975907bc25f2b28e666cff7", "title": "Nucleosomal embedding reshapes the dynamics of abasic sites"}, {"paperId": "9de06a34f09f77d984337821f1abd04dba2173fc", "title": "Energy Landscapes Reveal Agonist Control of G Protein-Coupled Receptor Activation via Microswitches"}, {"paperId": "bef7c61e1d111ab3d4b0ad39291346181aeabfe6", "title": "Coupling Molecular Dynamics and Deep Learning to Mine Protein Conformational Space"}, {"paperId": "8a108acd0a1520f3835dbfa39dabf3b8441acfb7", "title": "Envisaging the conformational space of proteins by coupling machine learning and molecular dynamics"}, {"paperId": "635f77662ff955761fa11d5187ca46c195e8f2c9", "title": "Automated Parsing of Flexible Molecular Systems using Principal Component Analysis and K-Means Clustering Techniques"}, {"paperId": "e482fe61192480ac79d838ddb1169d025cf2c353", "title": "GPRC Molecular Dynamics Forecasting using Recurrent Neural Networks"}]}
