{"paperId": "7e289d82e28297473fb27b748b4451c850cc436e", "publicationVenue": {"id": "2bff3ecd-cb0d-467a-bdff-036c3e4b3e2d", "name": "Water", "type": "journal", "issn": "2073-4441", "alternate_issns": ["1462-897X", "0310-0367"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-160269", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-160269", "http://www.mdpi.com/journal/water/about/", "https://www.mdpi.com/journal/water"]}, "title": "Computational Tools for Supporting the Operation and Management of Water Distribution Systems towards Digital Transformation", "abstract": "This paper presents a set of computational tools specially developed for supporting the operation and management of water distribution systems towards digital transformation of water services. These tools were developed in the scope of two R&D projects carried out in Portugal, DECIdE and WISDom, during 2018–2022. The DECIdE project focused on the development of tools for importing cadastral and operational data, as well as on the three operational tools for supporting the performance assessment: the first allows the calculation of different key performance indicators, both at a global and sectorial level, which is an annual requirement of the water regulator, and the other two allow the calculation of the water and the energy balances and a set of complementary indices. The WISDom project aimed at the implementation of applications that directly address specific water utility needs, namely, the flow rate data processing, the optimal location of pressure sensors, the identification of critical areas in the distribution network for pipe burst location, and the prioritization of pipes for rehabilitation. Implemented tools are useful to support water utilities in the daily operation and management of their systems, being a step forward towards digital transformation of the water sector.", "venue": "Water", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-01-31", "journal": {"name": "Water"}, "authors": [{"authorId": "3020748", "name": "N. Carriço"}, {"authorId": "2141625914", "name": "B. Ferreira"}, {"authorId": "48664172", "name": "A. Antunes"}, {"authorId": "2064759752", "name": "João Caetano"}, {"authorId": "97280830", "name": "D. Covas"}], "citations": [{"paperId": "155f21bc1d92762e847eae0419de361e4a32e7e3", "title": "A Formal Model for Reliable Data Acquisition and Control in Legacy Critical Infrastructures"}, {"paperId": "070f02ac933793900a793b3173f2106f8567c362", "title": "A survey of water utilities’ digital transformation: drivers, impacts, and enabling technologies"}, {"paperId": "d7d36c2ce99356505ae79125fcbc943cac14ce42", "title": "A formal model for reliable digital transformation of water distribution networks"}]}
