{"paperId": "7e2a7908bdae9e19e79bc2644d85d32542284cef", "publicationVenue": {"id": "3513ce18-3757-4358-b15f-7060af98e6d0", "name": "Frontiers in Neurology", "type": "journal", "alternate_names": ["Front Neurol"], "issn": "1664-2295", "url": "https://www.frontiersin.org/journals/neurology", "alternate_urls": ["http://www.frontiersin.org/neurology/about", "http://frontiersin.org/neurology"]}, "title": "A novel speech analysis algorithm to detect cognitive impairment in a Spanish population", "abstract": "Early detection of cognitive impairment in the elderly is crucial for diagnosis and appropriate care. Brief, cost-effective cognitive screening instruments are needed to help identify individuals who require further evaluation. This study presents preliminary data on a new screening technology using automated voice recording analysis software in a Spanish population.Data were collected from 174 Spanish-speaking individuals clinically diagnosed as cognitively normal (CN, n = 87) or impaired (mild cognitive impairment [MCI], n = 63; all-cause dementia, n = 24). Participants were recorded performing four common language tasks (Animal fluency, alternating fluency [sports and fruits], phonemic “F” fluency, and Cookie Theft Description). Recordings were processed via text-transcription and digital-signal processing techniques to capture neuropsychological variables and audio characteristics. A training sample of 122 subjects with similar demographics across groups was used to develop an algorithm to detect cognitive impairment. Speech and task features were used to develop five independent machine learning (ML) models to compute scores between 0 and 1, and a final algorithm was constructed using repeated cross-validation. A socio-demographically balanced subset of 52 participants was used to test the algorithm. Analysis of covariance (ANCOVA), covarying for demographic characteristics, was used to predict logistically-transformed algorithm scores.Mean logit algorithm scores were significantly different across groups in the testing sample (p < 0.01). Comparisons of CN with impaired (MCI + dementia) and MCI groups using the final algorithm resulted in an AUC of 0.93/0.90, with overall accuracy of 88.4%/87.5%, sensitivity of 87.5/83.3, and specificity of 89.2/89.2, respectively.Findings provide initial support for the utility of this automated speech analysis algorithm as a screening tool for cognitive impairment in Spanish speakers. Additional study is needed to validate this technology in larger and more diverse clinical populations.", "venue": "Frontiers in Neurology", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-04-04", "journal": {"name": "Frontiers in Neurology"}, "authors": [{"authorId": "2256491652", "name": "Alyssa N Kaser"}, {"authorId": "2228832229", "name": "L. Lacritz"}, {"authorId": "2256493621", "name": "Holly R. Winiarski"}, {"authorId": "2238798878", "name": "Peru Gabirondo"}, {"authorId": "2256486758", "name": "Jeffrey Schaffert"}, {"authorId": "2275226091", "name": "Alberto J. Coca"}, {"authorId": "2275214542", "name": "Javier Jiménez-Raboso"}, {"authorId": "2295211060", "name": "Tomas Rojo"}, {"authorId": "2238796859", "name": "Carla Zaldua"}, {"authorId": "2295219531", "name": "Iker Honorato"}, {"authorId": "2295220247", "name": "Dario Gallego"}, {"authorId": "2210848700", "name": "Emmanuel Rosario Nieves"}, {"authorId": "4738081", "name": "L. Rosenstein"}, {"authorId": "2250370645", "name": "C. M. Cullum"}], "citations": []}
