{"paperId": "7e4b151c928d02c29e4ad4ec6752f5a7ed0ae1ac", "publicationVenue": null, "title": "Remote Procedure Call Optimization of Big Data Systems Based on Data Awareness", "abstract": "In recent years, with the development of artificial intelligence technologies, mobile smart terminals, and high-bandwidth wireless internet, the scale of data generated by various data sources has continued to expand. Huge amounts of data contain huge economic value, therefore how to store and process the data efficiently becomes very significant. HDFS (Hadoop Distributed File System) has emerged as a typical representative of data-intensive distributed file systems, and it has features such as high fault tolerance, high throughput, and can be deployed on low-cost hardwares. However, the remote procedure call in HDFS is still not good enough to work better in terms of network throughput and abnormal response. This paper presents an optimization method to improve the performance of HDFS. The proposed method dynamically adjusts the RPC (Remote Procedure Call) configurations between NameNode and DataNodes by sensing the data characters that stored in DataNodes. This method can effectively reduce the processing pressure of the NameNode and reduce the network throughput generated by the information transmission between NameNode and DataNodes. It can also reduce the abnormal response time of the whole system. Finally, the extensive experiments show the effectiveness and efficiency of our proposed method.", "venue": "2020 IEEE Intl Conf on Parallel & Distributed Processing with Applications, Big Data & Cloud Computing, Sustainable Computing & Communications, Social Computing & Networking (ISPA/BDCloud/SocialCom/SustainCom)", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-12-01", "journal": {"name": "2020 IEEE Intl Conf on Parallel & Distributed Processing with Applications, Big Data & Cloud Computing, Sustainable Computing & Communications, Social Computing & Networking (ISPA/BDCloud/SocialCom/SustainCom)", "pages": "441-447"}, "authors": [{"authorId": "2143716975", "name": "Jin Wang"}, {"authorId": "47795877", "name": "Yaqiong Yang"}, {"authorId": "2108122564", "name": "Jingyu Zhang"}, {"authorId": "2152506888", "name": "Lei Wang"}], "citations": [{"paperId": "e5cac4a1a60ba8abd16e538eaab0fc568b9b6278", "title": "Digital healthcare framework for patients with disabilities based on deep federated learning schemes"}]}
