{"paperId": "7e555856fc97b669379b0989a8c50097e4f607ed", "publicationVenue": {"id": "c6840156-ee10-4d78-8832-7f8909811576", "name": "IEEE Transactions on Knowledge and Data Engineering", "type": "journal", "alternate_names": ["IEEE Trans Knowl Data Eng"], "issn": "1041-4347", "url": "https://www.computer.org/web/tkde", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=69"]}, "title": "A Survey for Federated Learning Evaluations: Goals and Measures", "abstract": "Evaluation is a systematic approach to assessing how well a system achieves its intended purpose. Federated learning (FL) is a novel paradigm for privacy-preserving machine learning that allows multiple parties to collaboratively train models without sharing sensitive data. However, evaluating FL is challenging due to its interdisciplinary nature and diverse goals, such as utility, efficiency, and security. In this survey, we first review the major evaluation goals adopted in the existing studies and then explore the evaluation metrics used for each goal. We also introduce FedEval, an open-source platform that provides a standardized and comprehensive evaluation framework for FL algorithms in terms of their utility, efficiency, and security. Finally, we discuss several challenges and future research directions for FL evaluation.", "venue": "IEEE Transactions on Knowledge and Data Engineering", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-08-23", "journal": {"name": "ArXiv", "volume": "abs/2308.11841"}, "authors": [{"authorId": "2064208321", "name": "Di Chai"}, {"authorId": "2143500842", "name": "Leye Wang"}, {"authorId": "2145494870", "name": "Liu Yang"}, {"authorId": "1908497", "name": "Junxue Zhang"}, {"authorId": "2157740727", "name": "Kai Chen"}, {"authorId": "144286907", "name": "Qian Yang"}], "citations": [{"paperId": "ea34780711d60c020422b727e897be2ab0399c0e", "title": "Not all Minorities are Equal: Empty-Class-Aware Distillation for Heterogeneous Federated Learning"}, {"paperId": "4b8e0faa191e8f5849b9b378c06e904f47b95070", "title": "Preserving Privacy in Next Keyword Prediction using Federated Learning"}]}
