{"paperId": "7e569ce337a1e6bbc716cf2230c822b610acdc7d", "publicationVenue": {"id": "9704c32e-4051-4155-95f8-dcb3c01abc51", "name": "Interactive Learning Environments", "type": "journal", "alternate_names": ["Interact Learn Environ"], "issn": "1049-4820", "url": "http://www.informaworld.com/1744-5191", "alternate_urls": ["http://www.tandfonline.com/loi/nile20"]}, "title": "A predictive analytics framework as a countermeasure for attrition of students", "abstract": "ABSTRACT Attrition is one of the main concerns in distance learning due to the impact on the incomes and institutions reputation. Timely identification of students at risk has high practical value in effective students’ retention services. Big Data mining and machine learning methods are applied to manipulate, analyze and predict students’ failure, supporting self-directed learning. Despite the extensive application of data mining to education, the imbalance problem in minority classes of students’ attrition is often overlooked in conventional models. This document proposes a large data frame using the Hadoop ecosystem and the application of machine learning techniques to different datasets of an academic year at the Hellenic Open University. Datasets were divided into thirty-five weeks. Thirty-two classifiers were created, compared and statistical analyzed to address the minority classes’ imbalance of student’s failure. The algorithms metacost-SMO, and C4.5 provide the most accurate performance for each target class. Early predictions of timeframes determine a remarkable performance, while the importance of written assignments and specific quizzes is noticeable. The models’ performance in any week is exploited by developing a prediction tool for student attrition, contributing to timely and personalized intervention.", "venue": "Interactive Learning Environments", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-10-25", "journal": {"name": "Interactive Learning Environments", "pages": "568 - 582", "volume": "30"}, "authors": [{"authorId": "30469865", "name": "Andreas F. Gkontzis"}, {"authorId": "1697867", "name": "S. Kotsiantis"}, {"authorId": "1749926", "name": "C. Panagiotakopoulos"}, {"authorId": "1744411", "name": "V. Verykios"}], "citations": [{"paperId": "e69d768e8b01386c32f414eb047e759629c39abe", "title": "Supervised machine learning algorithms for predicting student dropout and academic success: a comparative study"}, {"paperId": "70099049a4d553de3f53c165278394e345c40df5", "title": "A Thematic Review on Predicting Student Performance Using Data Mining"}, {"paperId": "9799cbcbbf22b41676ea73cf2c1630fd299438ab", "title": "Retention Factors in STEM Education Identified Using Learning Analytics: A Systematic Review"}, {"paperId": "63b01164ff86eb073cb2d69cabe0c3c2d8346cd7", "title": "‘Everything is data’: towards one big data ecosystem using multiple sources of data on higher education in Indonesia"}, {"paperId": "63646cafc9b2f29d6ce2f0ba462a6398959493b4", "title": "Coping with Access Difficulties and Absenteeism through Data Visualization: A Case Study from a Rural Vocational School in Northern Greece"}, {"paperId": "4f449834466c64fe10f4722a406945ff60a9e5a0", "title": "Predictive analytics for appointment bookings"}, {"paperId": "d1d50efb9bf0131af33fa517a50a4a72f65feceb", "title": "A Proposed Framework for Evaluating the Academic-failure Prediction in Distance Learning"}, {"paperId": "abcec95da0d4c7cd5aa33b902362556dd62d5181", "title": "How Does Learning Analytics Contribute to Prevent Students' Dropout in Higher Education: A Systematic Literature Review"}, {"paperId": "96ef78bec3d1685c7a0ab5b18a0ee80738b07e8d", "title": "An Effective Ensemble Model to Predict Employment Status of Graduates in Higher Educational Institutions"}, {"paperId": "f50164bf11a72ce4b49fa16d73ff13633e054d10", "title": "Research Review on Big Data Usage for Learning Analytics and Educational Data Mining: A Way Forward to Develop an Intelligent Automation System"}, {"paperId": "5e842b35c055360ce0eb8f5cce94f24666922de6", "title": "Multi-Tier Student Performance Evaluation Model (MTSPEM) with Integrated Classification Techniques for Educational Decision Making"}, {"paperId": "0f2e74e1fcf823fe55c336652d6613602cba28de", "title": "Impact of using learning analytics in asynchronous online discussions in higher education"}, {"paperId": "8bf53d7e7f73c2caa83ad3884e67374f02ec67fd", "title": "Big and open linked data analytics: a study on changing roles and skills in the higher educational process"}, {"paperId": "6d71b888790e3a0d28c0bba6677b8fa19b775117", "title": "Mining Educational Data to Predict Students’ Performance through Procrastination Behavior"}, {"paperId": "be8d968088224f01070ba3df7947959d233a1cd4", "title": "New Learning – Fokusveränderung im Lernen"}, {"paperId": "38b184b207b34104e6acc14154e322ab3f7f5e90", "title": "Polarity, emotions and online activity of students and tutors as features in predicting grades"}]}
