{"paperId": "7e61d20d6a1d0d5c1c639a9e6a057029a7853972", "publicationVenue": {"id": "8ba56476-c1c5-4591-8422-2f222f234589", "name": "World Forum on Internet of Things", "type": "conference", "alternate_names": ["WF-IoT", "World Forum Internet Thing"]}, "title": "A Comprehensive Approach for Applying Threat Modeling to Internet of Things Systems", "abstract": "Internet of Things (IoT) technologies are being increasingly used by society. Industry, Agriculture, and Healthcare are examples of areas where IoT is intensively used. In this way, security became a primary concern for IoT systems since its lack can cause considerable damages from the disclosure of restricted information to the loss of lives. Threat Modeling is a well-known approach to mitigating security threats in information systems. However, to appropriately applying Threat Modeling to the IoT context is necessary to adjust the modeling to consider attacks that affect the security of those systems. This work presents a comprehensive approach for applying threat modeling to IoT systems. We performed survey-of-surveys on attacks and countermeasures for IoT and used this survey as input for traditional Threat Modeling techniques such as STRIDE and DREAD. We applied the adjusted approach to an open-source smart lock system finding some possible attacks. We present the process's steps to other practitioners performing threat modeling for IoT systems.", "venue": "World Forum on Internet of Things", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-10-26", "journal": {"name": "2022 IEEE 8th World Forum on Internet of Things (WF-IoT)", "pages": "01-06"}, "authors": [{"authorId": "2220750428", "name": "Lucas Peixoto da Silva"}, {"authorId": "2220462690", "name": "Bernardo S. Nascimento"}, {"authorId": "2220460922", "name": "Rafael A. Mello P. Dias"}, {"authorId": "133843995", "name": "D. S. Mendonça"}], "citations": [{"paperId": "6fab37f5e00284c75370f76ba18df4f8153796e3", "title": "Facilitating Threat Modeling by Leveraging Large Language Models"}]}
