{"paperId": "7e631bbcc70e2af840662dc84fd482892857fb9c", "publicationVenue": {"id": "ea9ffd99-e5a9-4509-8b08-a1b8d3fe566c", "name": "Journal of Autonomous Intelligence", "type": "journal", "alternate_names": ["J Auton Intell"], "issn": "2630-5046"}, "title": "Dynamic convolution layer based optimization techniques for object classification and semantic segmentation", "abstract": "Providing meaningful classification for each pixel in an image is a primary goal of computer vision, and the tasks of object classification and semantic segmentation are among the field’s greatest challenges. To improve object classification, this study presents a novel method that combines semantic segmentation with dynamic convolution layer-based optimization techniques. In the proposed method, a Refined Convolution Neural Network (R-CNN) is used, which uses non-extensive entropy to dynamically increase the size of its convolutional layers. The Common Objects in Context (COCO) dataset is used to assess the performance of the model. The model performs exceptionally well at different Intersections over Union (IoU) cutoffs, with average precision values of 40.1, 61.9, and 45.4, respectively, for Average Precision (AP), AP50, and AP75. These results demonstrate the model’s efficiency in discriminating between various image contents. Additionally, the model predicts an image’s outcome on average in just 0.901 s. The model has been proven to be superior through various performance evaluation parameters, showing an average mean precision of 91.78%. This study demonstrates the power of combining dynamic convolution layers with semantic segmentation to improve object classification accuracy, a key component in the development of computer vision applications.", "venue": "Journal of Autonomous Intelligence", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-01-09", "journal": {"name": "Journal of Autonomous Intelligence"}, "authors": [{"authorId": "2278982881", "name": "Jaswinder Singh"}, {"authorId": "2278934487", "name": "B. K. Sharma"}], "citations": []}
