{"paperId": "7e678d502a2553001de118efe4fab287c0aa7f5c", "publicationVenue": null, "title": "HUNTER: An Online Cloud Database Hybrid Tuning System for Personalized Requirements", "abstract": "Recently, using machine learning for performance tuning of cloud database (CDB) service has shown great potentials. However, facing personalized requirements such as various restrictions for tuning with very different workloads, pre-trained models may mismatch or recommend suboptimal configurations given a new workload. On the other hand, if the system tunes configurations in an online fashion, the system will suffer from the cold start problem, resulting in long tuning time and performance fluctuation. To accommodate these problems, we propose an online CDB tuning system called HUNTER. The key feature of HUNTER is a hybrid architecture, which uses samples generated by Genetic Algorithm to warm-start the finer grained exploration of deep reinforcement learning. Meanwhile, we employ Principal Component Analysis, Random Forest, and Fast Exploration Strategy to reduce the search space and the update time of the learning model. In addition, we further propose a clone and parallelization scheme to stress-test workloads on multiple cloned CDB instances (CDBs), resulting in faster and safer configuration exploration. Extensive trials on CDB with public and real-world workloads demonstrate that, given the same time budget and resources, HUNTER improves performance and considerably decreases recommendation time compared to state-of-the-art tuning systems, with accelerations of up to 2.8× and 22.8× utilizing 1 and 20 cloned CDBs, respectively.", "venue": "SIGMOD Conference", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2022-06-10", "journal": {"name": "Proceedings of the 2022 International Conference on Management of Data"}, "authors": [{"authorId": "2169798932", "name": "Baoqing Cai"}, {"authorId": "6782471", "name": "Yu Liu"}, {"authorId": "2146064162", "name": "Ce Zhang"}, {"authorId": "2169799166", "name": "Guangyu Zhang"}, {"authorId": "2075359500", "name": "Ke Zhou"}, {"authorId": "2150978132", "name": "Li Liu"}, {"authorId": "40584698", "name": "Chun-hua Li"}, {"authorId": "1752857201", "name": "Bin Cheng"}, {"authorId": "2169810037", "name": "Jie Yang"}, {"authorId": "147178991", "name": "Jiashu Xing"}], "citations": [{"paperId": "8e0175e00163e80aea89daf12474cbe68643fb99", "title": "Rethinking Learned Cost Models: Why Start from Scratch?"}, {"paperId": "263b0924f50444bbd7cdf5374638695e3eb56156", "title": "Automatic Database Knob Tuning: A Survey"}, {"paperId": "1648da99ff6edff5e7c60aaf36b2e5d4f4822eb4", "title": "A Sample-Aware Database Tuning System With Deep Reinforcement Learning"}, {"paperId": "8ddb165278176f279ace760a8c14f5e0fcb652b0", "title": "GPTuner: A Manual-Reading Database Tuning System via GPT-Guided Bayesian Optimization"}, {"paperId": "b3422e193ad183a38c8c98525d89d85919041d6f", "title": "HWTune: A Hardware-Aware Database Tuning System with Deep Reinforcement Learning"}, {"paperId": "0f119b265c39f70db0b6965ed9a68a85959e1e3f", "title": "Towards General and Efficient Online Tuning for Spark"}, {"paperId": "f351f850e92b7ea71541d1047c2c3b8a3409cc3d", "title": "Joint Workload Forecasting and Configuration Tuning to Achieve Cloud Database Performance Adaptation"}, {"paperId": "ebe7b4b3931d9df634b0e9667ec7686e1eac9c94", "title": "Grep: A Graph Learning Based Database Partitioning System"}, {"paperId": "219af6ca8d476bd2d8ac0cf0eac3dc0297ce6c00", "title": "FASTune: Towards Fast and Stable Database Tuning System with Reinforcement Learning"}, {"paperId": "fc4e95185b9a669dab434c42fdcc5aa13c59c0bb", "title": "A Unified and Efficient Coordinating Framework for Autonomous DBMS Tuning"}, {"paperId": "d1181cf30d9af280469e560a1934d18cd540c05e", "title": "A Survey of Database Knob Tuning with Machine Learning"}, {"paperId": "58d5e454364a3e1c592499734d7d40be6a3bbed5", "title": "Adaptive Buffer Replacement Policies for Multi-Tenant Cloud Services"}, {"paperId": "b1c231ce1290beae315fffb39f94de046f57cc04", "title": "Optimizing Replacement Policies for Content Delivery Network Caching: Beyond Belady to Attain A Seemingly Unattainable Byte Miss Ratio"}, {"paperId": "defc06199f7c0ac13a7cdaf90c36d332b1310fa4", "title": "LDPP: A Learned Directory Placement Policy in Distributed File Systems"}]}
