{"paperId": "7e6d8cb05ef126bee71d0167169be070ff5b19f5", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Investigation on Classification and Cleaning for Visually Self-Intersected Monocyclic Polygons", "abstract": "In the geographic information system field, identifying and cleaning self-intersected polygons to achieve simple polygons is a basic and core issue. In traditional research, self-intersected polygons were identified by the topological relationship between the line segments that form polygons. However, in the process of map generalization or map spatial overlay calculations, the elimination of topological self-intersection is not sufficient. Elements (vertices and line segments) that are topologically separated but whose distance is smaller than the minimum visible distance on the map also need to be considered to avoid graphic conflicts. Both the above two cases are defined as visual self-intersection in this article. Aimed at monocyclic polygons, a method of classification and cleaning for visual self-intersection is proposed. First, three basic visual self-intersection patterns, intersecting, separating and collinear, were distinguished and defined and then further divided into ten refined types. Second, the automatic recognition of different visual self-intersection types was achieved by calculating the topological and distance relationships between the vertices of the polygon and the line segments of the polygon, and corresponding cleaning algorithms for different visual self-intersection types were proposed. Finally, the real topographical map data of a typical area in Jiangsu were used for validation. The experimental results indicate that all self-intersections identified by the advanced Martinez-Llario method were successfully captured by the proposed method, and it identified eight more types, accounting for 40% of the total number of visual self-intersection polygons. After human-computer interaction verification, the identification rate of the proposed method was found to reach 100%. In addition, the visual perception of human cartographers and the closure property of polygons were considered simultaneously during the cleaning for each visual self-intersection pattern, so the proposed method also obtained better cleaning results.", "venue": "IEEE Access", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "192936-192950", "volume": "8"}, "authors": [{"authorId": "2128670244", "name": "Chengming Li"}, {"authorId": "2008280286", "name": "Man Guo"}, {"authorId": "10418459", "name": "Pengda Wu"}, {"authorId": "46524764", "name": "Yong Yin"}], "citations": []}
