{"paperId": "7e70bbfae9f8254411c286e821dc4bffde8898cf", "publicationVenue": {"id": "1620da87-4387-4b9a-9bf4-22fdf74d4dc3", "name": "Symmetry", "type": "journal", "issn": "2073-8994", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172134", "alternate_urls": ["https://www.mdpi.com/journal/symmetry", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172134"]}, "title": "Intelligent Computing Collaboration for the Security of the Fog Internet of Things", "abstract": "The application of fog Internet of Things (IoT) technology helps solve the problem of weak computing power faced by IoT terminals. Due to asymmetric differences in communication methods, sensing data offloading from IoT terminals to fog and cloud layers faces different security issues, and both processes should be protected through certain data transmission protection measures. To take advantage of the relative asymmetry between cloud, fog, and sensing layers, this paper considers using physical layer security technology and encryption technology to ensure the security of the sensing data unloading process. An efficient resource allocation method based on deep reinforcement learning is proposed to solve the problem of channel and power allocation in fog IoT scenarios, as well as the selection of unloading destinations. This problem, which is NP-hard, belongs to the attribute of mixed integer nonlinear programming. Meanwhile, the supporting parameters of the method, including state space, action space, and rewards, are all adaptively designed based on scene characteristics and optimization goals. The simulation and analysis show that the proposed method possesses good convergence characteristics. Compared to several heuristic methods, the proposed method reduces latency by at least 18.7% on the premise that the transmission of sensing data is securely protected.", "venue": "Symmetry", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-04-24", "journal": {"name": "Symmetry", "pages": "974", "volume": "15"}, "authors": [{"authorId": "2185024098", "name": "Hong Zhao"}, {"authorId": "2215490686", "name": "Guowei Sun"}, {"authorId": "2215497327", "name": "Weiheng Li"}, {"authorId": "46181621", "name": "Peiliang Zuo"}, {"authorId": "48458284", "name": "Zhaobin Li"}, {"authorId": "2183003357", "name": "Zhanzhen Wei"}], "citations": []}
