{"paperId": "7e86ee67f5aa0627e23db3c29323a1c24276940e", "publicationVenue": {"id": "9846de51-dadf-4086-9e40-62466a7e2c87", "name": "International Conference on Fog and Mobile Edge Computing", "type": "conference", "alternate_names": ["FMEC", "Int Conf Fog Mob Edge Comput"]}, "title": "Feasibility study and requirements for mobile cloud healthcare systems in Saudi Arabia", "abstract": "There is a significant improvement in the healthcare services recently due to the integration of Information and Communication Technology (ICT). There are new service models in Healthcare systems being developed and used nowadays influenced by the use different technologies. Cloud computing and Mobile computing technologies are playing a major role in this transfer. Physicians can use their smart mobile devices to run useful medical applications, access patients records, and place lab orders. However, mobile devices limitations including battery lifetime and processing capabilities prevent the ultimate use of these devices. Mobile Cloud Computing (MCC) can resolve many mobile computing limitations. However, MCC has its challenges including high latency and large transmission power consumption when accessing compute and storage resources over the network. In this paper, we investigate the feasibility and requirements of a converged mobile healthcare cloud infrastructure for Saudi Arabia. This study aims to identify the requirements for cloud infrastructures that will be needed in the kingdom to support integrated countrywide interoperable healthcare applications and systems. In the future, we are planning to propose designs of network and system architectures for next generation mobile cloud-based healthcare system in Saudi Arabia.", "venue": "International Conference on Fog and Mobile Edge Computing", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2018-04-23", "journal": {"name": "2018 Third International Conference on Fog and Mobile Edge Computing (FMEC)", "pages": "300-304"}, "authors": [{"authorId": "46192571", "name": "Suhaila Habeeb"}, {"authorId": "31167976", "name": "L. Tawalbeh"}], "citations": [{"paperId": "beb7075e638b5616589b4928e9b5f6c7d5ab3a66", "title": "An Enhanced and highly Authenticated Medical Treatment for an Emergency Management System using Cloud Computing"}, {"paperId": "d96907bd620d3c04be6b978b6c39a048429857bb", "title": "Artificial intelligence-based public healthcare systems: G2G knowledge-based exchange to enhance the decision-making process"}, {"paperId": "22843a7077f1886047ae8c606c37c2155a4de49b", "title": "Mobile Application for Diseases Self-Diagnosis during Pandemic"}]}
