{"paperId": "7e8b4c04561346f6eed001e1b46bb5f125b6d0b2", "publicationVenue": {"id": "4299b928-18a2-403a-adf4-b15510e38aed", "name": "IEEE Computer Society Annual Symposium on VLSI", "type": "conference", "alternate_names": ["IEEE Comput Soc Annu Symp VLSI", "ISVLSI"], "url": "http://www.wikicfp.com/cfp/program?id=1766"}, "title": "Oscillatory Neural Networks for Edge AI Computing", "abstract": "In this paper, we showcase the innovative concept of implementing Oscillatory Neural Networks (ONNs) for neuromorphic computing with beyond-CMOS devices based on vanadium dioxide to mimic neurons and resistors to emulate synapses. We explore ONN technology potentials from device to analog circuit-level simulations. We report that ONN behaves like an associative memory and can implement energy-based models such as Hopfield Neural Networks on edge devices. Finally, as a proof of concept, a reconfigurable digital ONN is implemented on FPGA for pattern recognition tasks.", "venue": "IEEE Computer Society Annual Symposium on VLSI", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-07-01", "journal": {"name": "2021 IEEE Computer Society Annual Symposium on VLSI (ISVLSI)", "pages": "326-331"}, "authors": [{"authorId": "2115013041", "name": "Corentin Delacour"}, {"authorId": "7990765", "name": "S. Carapezzi"}, {"authorId": "2007506752", "name": "Madeleine Abernot"}, {"authorId": "12305287", "name": "G. Boschetto"}, {"authorId": "1775356", "name": "N. Azémard"}, {"authorId": "145835687", "name": "Jérémie Salles"}, {"authorId": "2074764646", "name": "Thierry Gil"}, {"authorId": "3182535", "name": "A. Todri"}], "citations": [{"paperId": "39f956b18671468c006998c483588ec3c3c87a1d", "title": "Tracing a new path in the field of AI and robotics: mimicking human intelligence through chemistry. Part II: systems chemistry"}, {"paperId": "3c0c14ff4ad458a9131dd06dab04a05141089610", "title": "Improving equilibrium propagation without weight symmetry through Jacobian homeostasis"}, {"paperId": "b95a2e6a7090624c8739e0495332a70c2bd0cf29", "title": "Digital Implementation of On-Chip Hebbian Learning for Oscillatory Neural Network"}, {"paperId": "a47e87acfc3c095ae4fa77c13d5a64e7d3885c24", "title": "A mixed-signal oscillatory neural network for scalable analog computations in phase domain"}, {"paperId": "b861ecd59dc18a81ce7f2389c8ca336edc741abf", "title": "Training energy-based single-layer Hopfield and oscillatory networks with unsupervised and supervised algorithms for image classification"}, {"paperId": "ed61f84c7e4f54cdcd652fc3f88fe706d1300baa", "title": "Understanding Rhythmic Synchronization of Oscillatory Neural Networks Based on NbOx Artificial Neurons for Edge Detection"}, {"paperId": "4f241fc917a0a69b1c6e9dc1e475ded419d551d4", "title": "Edge AI: A survey"}, {"paperId": "1bf47c7377e0bed81df9782f322f37c4a1d8ea9a", "title": "Simulation and implementation of two-layer oscillatory neural networks for image edge detection: bidirectional and feedforward architectures"}, {"paperId": "955c13cdbaa47f126aaa3dfa5063dd63abe649e5", "title": "Role of ambient temperature in modulation of behavior of vanadium dioxide volatile memristors and oscillators for neuromorphic applications"}, {"paperId": "a4778d82e09cacdbe2fef7b72fecb8a4fea9f353", "title": "Oscillatory Neural Network for Edge Computing: A Mobile Robot Obstacle Avoidance Application"}, {"paperId": "f9c1876d617641f8b5de8be5e25e07c3a61d79ce", "title": "Synchronization phenomena in dual-transistor spiking oscillators realized experimentally towards physical reservoirs"}, {"paperId": "5767ff5d9e92d5a79f72f04eae8c23ec2e5b148f", "title": "Oscillatory Neural Networks for Obstacle Avoidance on Mobile Surveillance Robot E4"}, {"paperId": "4a0e18dab996e29d2f284ca3de3d0bae09f71b52", "title": "Oscillatory Neural Network as Hetero-Associative Memory for Image Edge Detection"}]}
