{"paperId": "7ea671f8953893f7a3a4625272d8fff5696efc1b", "publicationVenue": {"id": "fbbafe0e-5e14-431f-9456-f569300a37cb", "name": "IEEE Open Journal of the Communications Society", "type": "journal", "alternate_names": ["IEEE Open J Commun Soc"], "issn": "2644-125X", "url": "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=8782661"}, "title": "Learning Based Methods for Traffic Matrix Estimation From Link Measurements", "abstract": "Network traffic matrix (TM) is a critical input for capacity planning, anomaly detection and many other network management related tasks. The TMs are often computed from link load measurements. The TM estimation problem is the determination of the TM from link load measurements. The relationship between the link loads and the TM that generated the link loads can be modeled as an under-determined linear system and has multiple feasible solutions. Therefore, prior knowledge of the traffic demand pattern has to be used in order to find a potentially feasible TM. In this paper, we consider the TM estimation problem with limited prior information. Unlike previous methods that require past measurements of complete TMs, which are hard to obtain or protected by regulations, our method works even if only the distribution of TMs is known. We develop an iterative projection based algorithm to solve this problem. If large number of past TMs can be measured, we propose a Generative Adversarial Network (GAN) based approach for solving the problem. We compare the strengths of the two approaches and evaluate their performance for several networks using varying amounts of past data.", "venue": "IEEE Open Journal of the Communications Society", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-08-03", "journal": {"name": "IEEE Open Journal of the Communications Society", "pages": "488-499", "volume": "2"}, "authors": [{"authorId": "2724053", "name": "Shenghe Xu"}, {"authorId": "2665763", "name": "M. Kodialam"}, {"authorId": "145362407", "name": "T. V. Lakshman"}, {"authorId": "1788530", "name": "S. Panwar"}], "citations": [{"paperId": "63e49a0abab766e6287dffd852635d028ddc3dcf", "title": "Traffic Matrix Estimation based on Denoising Diffusion Probabilistic Model"}, {"paperId": "812bc23a46f408e6140d550597366fb4a6d9b08c", "title": "Network Tomography and Partial Least Squares for Traffic Matrix Estimation"}, {"paperId": "90aeba0e9b216187bd6a3b54cf8a1a953787d5e8", "title": "Structured Nonnegative Matrix Factorization for Traffic Flow Estimation of Large Cloud Networks"}, {"paperId": "72e5cd012c8ab3ec449102471c971b954d8f665e", "title": "Generative Deep Learning Techniques for Traffic Matrix Estimation From Link Load Measurements"}]}
