{"paperId": "7ead40d4cdcf83b2c53af30dda2a2dfbf4bb88a3", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Characterizing the Performance of Emerging Deep Learning, Graph, and High Performance Computing Workloads Under Interference", "abstract": "Throughput-oriented computing via co-running multiple applications in the same machine has been widely adopted to achieve high hardware utilization and energy saving on modern supercomputers and data centers. However, efficiently co-running applications raises new design challenges, mainly because applications with diverse requirements can stress out shared hardware resources (IO, Network and Cache) at various levels. The disparities in resource usage can result in interference, which in turn can lead to unpredictable co-running behaviors. To better understand application interference, prior work provided detailed execution characterization. However, these characterization approaches either emphasize on traditional benchmarks or fall into a single application domain. To address this issue, we study 25 up-to-date applications and benchmarks from various application domains and form 625 consolidation pairs to thoroughly analyze the execution interference caused by application co-running. Moreover, we leverage mini-benchmarks and real applications to pinpoint the provenance of co-running interference in both hardware and software aspects.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-03-28", "journal": {"name": "ArXiv", "volume": "abs/2303.15763"}, "authors": [{"authorId": "2108836411", "name": "Hao Xu"}, {"authorId": "46746040", "name": "Shuang Song"}, {"authorId": "2211602056", "name": "Ze Mao"}], "citations": [{"paperId": "ff99c2376224e6a2cbea883f8c938e42c4f2fce1", "title": "Deep Learning-Based Medical Image Registration Algorithm: Enhancing Accuracy with Dense Connections and Channel Attention Mechanisms"}, {"paperId": "a7c84a5f1162bd169f7d9038c76ce0862797a23a", "title": "Enhancing Disease Prediction with a Hybrid CNN-LSTM Framework in EHRs"}, {"paperId": "a688d1f026bf2ab93f95bfc977004a7a8909934f", "title": "Software Resource Disaggregation for HPC with Serverless Computing"}]}
