{"paperId": "7eafe3a796751c8d9208eb5d441d01290d3b8326", "publicationVenue": null, "title": "IoT-Based Healthcare-Monitoring System towards Improving Quality of Life: A Review", "abstract": "The Internet of Things (IoT) is essential in innovative applications such as smart cities, smart homes, education, healthcare, transportation, and defense operations. IoT applications are particularly beneficial for providing healthcare because they enable secure and real-time remote patient monitoring to improve the quality of people’s lives. This review paper explores the latest trends in healthcare-monitoring systems by implementing the role of the IoT. The work discusses the benefits of IoT-based healthcare systems with regard to their significance, and the benefits of IoT healthcare. We provide a systematic review on recent studies of IoT-based healthcare-monitoring systems through literature review. The literature review compares various systems’ effectiveness, efficiency, data protection, privacy, security, and monitoring. The paper also explores wireless- and wearable-sensor-based IoT monitoring systems and provides a classification of healthcare-monitoring sensors. We also elaborate, in detail, on the challenges and open issues regarding healthcare security and privacy, and QoS. Finally, suggestions and recommendations for IoT healthcare applications are laid down at the end of the study along with future directions related to various recent technology trends.", "venue": "Healthcare", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2022-10-01", "journal": {"name": "Healthcare", "volume": "10"}, "authors": [{"authorId": "2187762932", "name": "Suliman Abdulmalek"}, {"authorId": "2064000013", "name": "A. Nasir"}, {"authorId": "3216665", "name": "W. Jabbar"}, {"authorId": "2187762926", "name": "Mukarram A. M. Almuhaya"}, {"authorId": "3390642", "name": "A. Bairagi"}, {"authorId": "2109170103", "name": "M. Khan"}, {"authorId": "10331914", "name": "Seong-Hoon Kee"}], "citations": [{"paperId": "91c632a52f798445f492302c85c0d47c97d933a8", "title": "Lightweight block ciphers for resource-constrained environments: A comprehensive survey"}, {"paperId": "a2dcd6695f0b83a9abbc700b4e7c9f8cb8f8c13d", "title": "Opto-Electronic Smart Home: Heterogeneous Optical Sensors Approaches and Artificial Intelligence for Novel Paradigms in Remote Monitoring"}, {"paperId": "3b3eb2bf15af817b706eda0e24160e07f64d0f52", "title": "Healthcare and internet of things: The future of artificial intelligence and IoT technology"}, {"paperId": "282b1d9ad93b596a957cae5dfb7ef1a59bb59e65", "title": "Security Threats and Promising Solutions Arising from the Intersection of AI and IoT: A Study of IoMT and IoET Applications"}, {"paperId": "1a2c498705538925159954864d640ade86c8a9ba", "title": "IoT in healthcare: a review of services, applications, key technologies, security concerns, and emerging trends"}, {"paperId": "d56e9d8c836d9171c79a38fe0a08414401bfa751", "title": "Monitoring and analysis of physical activity and health conditions based on smart wearable devices"}, {"paperId": "ede9babe03430dbb2768e1dd9fb3ffe16a826180", "title": "A Novel Cloud-Based IoT Framework for Secure Health Monitoring"}, {"paperId": "19b4c5428066b34236d5e23050abe182e30ff29f", "title": "SCSO-MHEF: Sand Cat Swarm Optimization based MHEF for Nonlinear LTI-IoT Sensor Data Enhancement"}, {"paperId": "3416a38727ad5ea33328f2b6b8652aeda6b46f51", "title": "Applications of Machine Learning (ML) and Mathematical Modeling (MM) in Healthcare with Special Focus on Cancer Prognosis and Anticancer Therapy: Current Status and Challenges"}, {"paperId": "ec9690961a55c998d2439e7be148350dafdf2de7", "title": "LoRaWAN-based Hybrid Internet of Wearable Things System Implementation for Smart Healthcare"}, {"paperId": "ac9be8000200edc0752907895b944fd3754ffeae", "title": "Development of a Modified Medical Data Transmission over the Cellular Network System to Secure Health-Related Data from Changes in Environmental Parameters"}, {"paperId": "0cc22651605b1d31b6ca1bedad0c87a1ac760862", "title": "Digital patient twins for personalized therapeutics and pharmaceutical manufacturing"}, {"paperId": "07a448026422e5bdeb431c866d0e528b7eb67581", "title": "An energy-aware heart disease prediction system using ESMO and optimal deep learning model for healthcare monitoring in IoT."}, {"paperId": "b5b8d7570647c0a7d750b138cc2383cc0b47f610", "title": "IoT-Based Smart Health Monitoring System: Investigating the Role of Temperature, Blood Pressure and Sleep Data in Chronic Disease Management"}, {"paperId": "cafd51cae6e9ee6c756fb9f6f3c0ed7864e7745a", "title": "XOR-Free Approach Towards Realization of Low Pass FIR Filter in Bio-Medical Signal Acquisition : Vedic Multiplier-based ASIC Implementation"}, {"paperId": "30fdc98b1717195eaab30a91f61f739117464dbe", "title": "A Node MCU Enabled Comprehensive Remote Healthcare Evaluation System for Elder People Care and Support"}, {"paperId": "678ab5118bd0531c1c69d79076232ba1a622ff75", "title": "Lightweight Privacy-Preserving Remote User Authentication and Key Agreement Protocol for Next-Generation IoT-Based Smart Healthcare"}, {"paperId": "a22a1b5f3c5f7b5d951e07671e7a449451ffb16b", "title": "Secure cloud storage for IoT based distributed healthcare environment using blockchain orchestrated and deep learning model"}, {"paperId": "41b00ef40719e04b11e013b05fa87ec7e4ad5add", "title": "Evaluation of 5G techniques affecting the deployment of smart hospital infrastructure: Understanding 5G, AI and IoT role in smart hospital"}, {"paperId": "3dc4f905882aee0cacf333e04b4804ed48e7b200", "title": "Exploring the Risks, Benefits, Advances, and Challenges in Internet Integration in Medicine With the Advent of 5G Technology: A Comprehensive Review"}, {"paperId": "ed9205179d56df4d18629183ce7ec8ff7ac8a82e", "title": "Advancing Structural Health Monitoring: A Vibration-Based IoT Approach for Remote Real-Time Systems"}, {"paperId": "a7f353bbe0fdb742e943cf2daff1dc2392dcccd7", "title": "Pemantauan Suhu Tubuh dan Detak Jantung Berbasis IoT dan Terintegrasi ThingSpeak, SMS dan Telegram"}, {"paperId": "6886a2c645d9ee16831adc149ef86a989cf83141", "title": "Designing a Wearable Wireless System for Real-time Bioimpedance Spectroscopy of Body Fluid"}, {"paperId": "5f1223fa7455470e6541647194bdf9f5d2c5d74b", "title": "Context-aware Status Updating: Wireless Scheduling for Maximizing Situational Awareness in Safety-critical Systems"}, {"paperId": "37a845e8afc87ab1db0d96db16dab5ec1dfae64e", "title": "Optimizing Remote Patient Monitoring Security’s Features Managing Compacted Real Time IoT PAYLOAD Deploying Light Weighted Encryption and Foveal Quality Optimization Tools"}, {"paperId": "a697dc6602e7851db6d3d872cebb3d1c4f439ed2", "title": "Assessment Scales in Cerebral Palsy: A Comprehensive Review of Tools and Applications"}, {"paperId": "444e88ab47203e96b715a2634cd4823f55226da3", "title": "Predictive Maintenance Method using Machine Learning for IoT Connected Computed Tomography Scan Machine"}, {"paperId": "1c65a0b4788d709a860eabc1a5ee06ec7f212cb9", "title": "Development and Test of a Prototype IoT-based Energy-Aware Distributed Control System(eDCS)"}, {"paperId": "93b9a9e892932e9bc21dce2defdac53839d8afb4", "title": "Heart rate estimation from ballistocardiogram signals processing via low-cost telemedicine architectures: a comparative performance evaluation"}, {"paperId": "e74e396ad0bd4eb6d71aad37459c7ae7ae9aed52", "title": "An IOT based Model for Monitoring Health Parameters using Arduino Mega"}, {"paperId": "e4cb61b5d750c3b895c91512b0bd9f242b2e2f25", "title": "A comprehensive systematic and bibliometric review of the IoT-based healthcare systems"}, {"paperId": "06982521ea72bcd63ddc1f296cc3deaef696cec8", "title": "Bluetooth-Based Healthcare Information and Medical Resource Management System"}, {"paperId": "24884bc99ba9d85d55be4061c3a5110e293de2aa", "title": "Home Care Assistance Solution based on a Software Multi-Agents System"}, {"paperId": "db8d9897426835bde670fea3e3418e6b46bfda9e", "title": "Evaluation of Novel Embroidered Textile-Electrodes Made from Hybrid Polyamide Conductive Threads for Surface EMG Sensing"}, {"paperId": "4163d916776b50af84df3928c157b923b4a44bfc", "title": "Semantic Model for IoT-Enabled Smart Healthcare ‒ An Ontology-based Study"}, {"paperId": "8ab99fb1a6877ce6ee36b322e415fb15710f745f", "title": "Utilization of 5G Technologies in IoT Applications: Current Limitations by Interference and Network Optimization Difficulties—A Review"}, {"paperId": "2d4b3c5c52ad74b1b9a90a6988e0c6955b4b1269", "title": "Trends in Passive IoT Biomarker Monitoring and Machine Learning for Cardiovascular Disease Management in the U.S. Elderly Population"}, {"paperId": "e658c7fbd9b1d720a9c77216980de9a5d665e595", "title": "IoT-Based Wearable and Smart Health Device Solutions for Capnography: Analysis and Perspectives"}, {"paperId": "ae89516461b0e7bb56342b7c7a429bb17d45cb06", "title": "Amplifiers in Biomedical Engineering: A Review from Application Perspectives"}, {"paperId": "255f41b596b95089640fbc052521e389076afffc", "title": "IoT-Based Solution for Paraplegic Sufferer to Send Signals to Physician via Internet"}, {"paperId": "689eb22bea353309286e93e610d178ea9da34b35", "title": "A Novel Low Complexity Two-Stage Tone Reservation Scheme for PAPR Reduction in OFDM Systems"}, {"paperId": "48c35b6b3128c3d35b015c665ab9c8133071df0b", "title": "An Integrated Scalable Framework for Cloud and IoT Based Green Healthcare System"}, {"paperId": "53a6339f64a4120c33dfd02617077c7d7b00b666", "title": "Patient Health Monitoring System Development using ESP8266 and Arduino with IoT Platform"}, {"paperId": "b96948041b8469250f67ad9e90c872d7ee3282d6", "title": "Application of smart watches for monitoring the health state of professional drivers"}, {"paperId": "33a41d468118bd8fe7a72c31d0ff0601752378e3", "title": "Wireless Antenna Sensors for Biosimilar Monitoring Toward Cyber-Physical Systems: A Review of Current Trends and Future Prospects"}]}
