{"paperId": "7ebfaaf79cbc3a6c9577a1b44af6f17843524f57", "publicationVenue": {"id": "32dc1675-83bf-4a94-bf5d-cc320a66a8de", "name": "International Conference on System Engineering and Technology", "type": "conference", "alternate_names": ["IEEE Int Conf Sustain Energy Technol", "IEEE International Conference on Sustainable Energy Technologies", "International Conference Sustainable Engineering and Technology", "ICSET", "Int Conf Syst Eng Technol", "Int Conf Sustain Eng Technol"]}, "title": "Utilizing AI and Data Analytics to Track Patterns and Attitudes of PUV Drivers on the Streets", "abstract": "Public utility vehicles (PUVs), such as buses and modern jeepneys, play a vital role in the transportation sector of the Philippines. They facilitate the connection of people and goods across the diverse islands of the country, fostering economic growth by granting access to essential services and bridging urban and rural areas. Nevertheless, accidents involving these public utility vehicles remain a significant concern. Hence, the focal point of this paper is to develop applications that enable the evaluation of roadworthiness and facilitate the enhancement of road competency and behavior among public utility vehicle drivers— effectively alleviating road accidents. This research paper discusses the development and integration of mobile applications, web applications, artificial intelligence, and data analytics to monitor and analyze drivers’ learning curves, driving patterns, and behaviors and assess the roadworthiness of public utility vehicle drivers. In partnership with the Department of Science and Technology and the Technological Institute of the Philippines, the project seeks to enhance drivers’ comprehension and actions by incorporating monitoring, assessment, and evaluation functionalities. To determine the profile of drivers who are frequently involved in accidents, receiving complaints, and obtaining violations, the Clustering Algorithm is implemented in the visualizations. On the other hand, the linear regression approach was used to determine the connection between different items in datasets. Through the implementation of this project, public utility vehicle drivers can attain the essential expertise and information to reduce the likelihood of being engaged in road accidents. This, in turn, plays a role in fostering a safer and more effective transportation sector in the Philippines.", "venue": "International Conference on System Engineering and Technology", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-10-02", "journal": {"name": "2023 IEEE 13th International Conference on System Engineering and Technology (ICSET)", "pages": "284-289"}, "authors": [{"authorId": "35292824", "name": "Felizardo C. Reyes"}, {"authorId": "35279448", "name": "G. Cayabyab"}, {"authorId": "2264137903", "name": "Paula Jean C. Mendoza"}, {"authorId": "51400480", "name": "Jasmin A. Caliwag"}, {"authorId": "2263552259", "name": "Danward Bryle N. Bautista"}], "citations": []}
