{"paperId": "7ec83d031352282cf07b72f7b322dd2b2597c15d", "publicationVenue": {"id": "8664a0b8-3299-4a1d-9df4-01cbfb1ed679", "name": "Computers & industrial engineering", "type": "journal", "alternate_names": ["Comput  ind eng", "Computers & Industrial Engineering", "Comput  Ind Eng"], "issn": "0360-8352", "url": "https://www.journals.elsevier.com/computers-and-industrial-engineering", "alternate_urls": ["http://www.sciencedirect.com/science/journal/03608352"]}, "title": "Digital transformation: A systematic literature review", "abstract": null, "venue": "Computers & industrial engineering", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-11-01", "journal": {"name": "Comput. Ind. Eng.", "pages": "107774", "volume": "162"}, "authors": [{"authorId": "2139943973", "name": "Xiaoteng Zhu"}, {"authorId": "2519448", "name": "S. Ge"}, {"authorId": "1797317", "name": "Nianxin Wang"}], "citations": [{"paperId": "880113fca5700e64aeca5ad1dab508c67f1daff9", "title": "Digital transformation requires digital resource primacy: Clarification and future research directions"}, {"paperId": "841f15680e8f08f4706068b807e08a04c505d1be", "title": "Leaders, let’s get agile! Observing agile leadership in successful digital transformation projects"}, {"paperId": "88e1aad9cdc4a4dfef5bd6df388d9db338b80360", "title": "From riches to digitalization: The role of AMC in overcoming challenges of digital transformation in resource-rich regions"}, {"paperId": "e3a9382f52c5d286b091277933aeb44ee25e5c85", "title": "Uncovering the dynamics of enterprises digital transformation research: A comparative review on literature before and after the COVID-19 pandemic"}, {"paperId": "f3ac1eaac8395ba927c737165a03f743aa6cd1f7", "title": "The effect of IT security issues on the implementation of industry 4.0 in SMEs: Barriers and challenges"}, {"paperId": "db9c8f43c2413750d8a5626cc01388e6405c6c2b", "title": "Unveiling micro-foundations of digital transformation: Cognitive models, routines, and organizational structures in agri-food SMEs"}, {"paperId": "240dcfba8ba46987747ac74e054d54d6360cee3a", "title": "Digital transformation research: A bird's eye image of core knowledge and global trends"}, {"paperId": "ebe8023e76115ac542ca5f732ad2b2374d1d1297", "title": "Clarification of the Present Understanding of the Assessment of an Organization’s Digital Readiness in SMEs"}, {"paperId": "f4a4fc4d013ab7c8dde623b7f953d18119541fbf", "title": "Digital technologies and knowledge processes: new emerging strategies in international business. A systematic literature review"}, {"paperId": "b0cb94c6a81f4c52c59ac7feae838876b5fc6b37", "title": "Exploring omnichannel strategies: a path to improve customer experiences"}, {"paperId": "a4b335856752601bc9f4a853f96e9cd69bee8fc3", "title": "The Impact of Dissonant Tie on Innovation Performance of Digital Transformation: Innovation From Difficult Working Individuals"}, {"paperId": "13b37b16dd5673bd9fc4c2734f19e29cf927e992", "title": "An artificial intelligence transformation model – pod redesign of photomasks in semiconductor manufacturing"}, {"paperId": "3e8419a10a59bc797d169c479921233cd3e59d19", "title": "Digitalisation dynamics in SMEs: An approach from systems dynamics and artificial intelligence"}, {"paperId": "b016d30164ce73e8f41ba997feb09f439d785e83", "title": "How to realize value creation of digital transformation? A system dynamics model"}, {"paperId": "06d7a01b06f886367865aa9bcaca0f2e3abbce2c", "title": "Emotional Kansei Words for Digital and Pervasive Product Design"}, {"paperId": "3ccae073379e4feca7b9d6933b8ef3f3f2868d3b", "title": "Does digital transformation matter to green innovation: based on TOE framework and configuration perspective"}, {"paperId": "aa9b1a4e3097f7db8717c7827181f4a22e4d50a1", "title": "Digitalization Enables High-Quality Development of Enterprises"}, {"paperId": "3369440d554b89f9b13871f3585a0880754dfed9", "title": "Industry 4.0 Implementation and Industry 5.0 Readiness in Industrial Enterprises"}, {"paperId": "8f58f574c1dfb9897df14364cc5b6db5fd1aa2ac", "title": "Impacts of Business Architecture in the Context of Digital Transformation: An Empirical Study Using PLS-SEM Approach"}, {"paperId": "e5359b4674c85faef81319a661553ceb26dfbeee", "title": "Can digital policy improve corporate sustainability? Empirical evidence from China's national comprehensive big data pilot zones"}, {"paperId": "c2f00e56c2e973edcecf1c738717ea5fbdc4edaa", "title": "Digitalisation and digital transformation in the social economy: the cases of Anecoop and Consum"}, {"paperId": "2cff5f17584bd2571437a9037a0630b942ce66de", "title": "Chatbots and Voice Assistants: Digital Transformers of the Company-Customer Interface - A Systematic Review of the Business Research Literature"}, {"paperId": "394ebae69577a1f26dff6ca1df24844a58ac35af", "title": "Digital Transformation Strategies, Practices, and Trends: A Large-Scale Retrospective Study Based on Machine Learning"}, {"paperId": "41f0ad86f554788b4baed0b79840950db29bbd4d", "title": "A bibliometric analysis of the increasing knowledge base on the role of thinking teaching strategy in sciences teaching"}, {"paperId": "90b7a242351f2e93e2ca2045528de67eb201dffa", "title": "Supporting the digital transformation of SMEs — trained digital evangelists facilitating the positioning phase"}, {"paperId": "672bbeced651fe4176a1d6e86631603a9b9ae701", "title": "Business Transformation in Industry 4.0 and Strategies for Facing Industry in the 5.0 Era"}, {"paperId": "ef2de5bd578340c0a5e48e04c36fb3434d51897a", "title": "Digital transformation and marketing: a systematic and thematic literature review"}, {"paperId": "81da8d42bb39cbeee7d931a190129738d3d9530d", "title": "A new framework to evaluate and optimize digital transformation policies in the construction industry: A China case study"}, {"paperId": "8ef60ab1836ee19cf7de258085171da6c09d0bbb", "title": "Digital transformation: A meta-review and guidelines for future research"}, {"paperId": "ee9ad3672e7406d8d4858cbf6266b0bb96156db2", "title": "Knowledge diffusion trajectories of agile software development research: A main path analysis"}, {"paperId": "601595a54ade58ac1f6b31fbd32bfa88199923da", "title": "Impact Assessment Model for Low Cost (Shoestring) Digitalisation in Small Construction Organizations"}, {"paperId": "2809dd72a815d22b8d62ba5174ca7a756005294a", "title": "Digital transformation: A review and research agenda"}, {"paperId": "4bf7a48f44f66a0e169960e3868ccdc06c4f319a", "title": "The Software Architecture Driving A Successful Digital Transformation within Small and Medium Enterprises"}, {"paperId": "6a2951706c0415d7e591aaaec317acb74c271c5c", "title": "Digital Transformation and Manufacturing Firm Performance: Evidence from China"}, {"paperId": "e6efc79375cd8246fbc3cffa3c8fbb7768a4b445", "title": "Digital Transformation Framework: A Review"}, {"paperId": "1795bb8a2ed96d1421671ac0318552df008794b9", "title": "Esboço para o aprofundamento da inteligência artificial"}, {"paperId": "187b76fa9b5558eb3af56901068047abb51a7f38", "title": "Digital Transformation in Asset Management ? A Case of BIM Adoption in New Zealand Local government"}, {"paperId": "e5336e4fe1a42b2bc108867c138890532d6c9550", "title": "Insight into the Balancing Effect of a Digital Green Innovation (DGI) Network to Improve the Performance of DGI for Industry 5.0: Roles of Digital Empowerment and Green Organization Flexibility"}, {"paperId": "1f0a5232c47fd2a4bde9219e62c454a399948336", "title": "Digital Technology and the Stages of Digital Business Transformation"}, {"paperId": "376bd1ec5f3ce06b580792ef83773333d7109bfe", "title": "Digital transformation and corporate environmental performance: The moderating role of board characteristics"}, {"paperId": "105228373103e540f21c0fc5ad5344555b0874c4", "title": "Trends and Trajectories in the Software Industry: implications for the future of work"}, {"paperId": "323999daf99474a1af03ec51675ce9a0c3a5caff", "title": "Koncepti in spremembe, ki vplivajo na pomen digitalne preobrazbe"}, {"paperId": "a91708ec8052b47781b4603658697ed1e1b6e079", "title": "Does Digital Transformation Promote Enterprise Development?: Evidence From Chinese A-Share Listed Enterprises"}, {"paperId": "252114b2e76c49be8dcf78960e340ad74bdc16bf", "title": "The Management Perspective in Digital Health Literature: Systematic Review"}, {"paperId": "4cddddbd1d0e95021392eed8ab18cb44035aab9a", "title": "Digital transformation and business intelligence for a SME: systems thinking action research using PrOH modelling"}, {"paperId": "194529df80ce961d0d0325a3814f43918ad8f46d", "title": "Digital Transformation's Influence on Marketing Management Strategies: An Exploration"}, {"paperId": "78fd6e977f29ea8c2ecd87118e32eef7ff5302f3", "title": "Digital Strategizing: The Role of the Corporate Culture"}]}
