{"paperId": "7ed4c0b845040b62d0ec7cb09f5e839e555c6031", "publicationVenue": null, "title": "Open and shut: Identifying activity patterns by volunteer organizations active in disaster using space-time permutation scan statistics", "abstract": "After a catastrophic flood, the pace of residential cleanup is an important precondition of community resilience. When the process is fast, cleanup reduces additional health or economic risks by preventing structural or electrical damage from escalating. Mobilizing volunteers to complete cleanup work quickly is a challenge that the U.S. Natural Disaster Recovery Framework has assigned to the nonprofit sector. Nonprofit coordination networks—such as those convened through volunteer organizations active in disaster (VOAD) in the United States—aim to create systems of communication that improve the efficiency and equity of post-disaster cleanup. However, the process of coordination and the conditions that encourage quick action remain understudied. The aim of this paper is to identify the impacts of network coordination on the timeline of post-disaster cleanup using geospatial analytics. To do this, we apply a space-time permutation scan statistic (STPSS) to data on the speed at which organizations from the North Carolina VOAD (NC VOAD) closed requests for volunteer assistance following Hurricane Florence in 2018. STPSS results identify clusters of requests that were filled at different speeds through space and time. In total, we identified six space-time clusters indicative of coordinated cleanup. Exploration of clustered data helps to generate new questions about why coordination sometimes happened months after the disaster and suggests ways to use data exploration to inform network function and to leverage the unique capacities of individual nonprofits while also prioritizing housing resilience in socially vulnerable communities.", "venue": "International Journal of Mass Emergencies &amp; Disasters", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-03-01", "journal": {"name": "International Journal of Mass Emergencies & Disasters", "pages": "174 - 185", "volume": "41"}, "authors": [{"authorId": "2238223000", "name": "Byron Ifediora"}, {"authorId": "3784251", "name": "B. Cutts"}], "citations": []}
