{"paperId": "7edd41a13ac11ec99fb56cd9b739fa5acfa5ed47", "publicationVenue": {"id": "28df6cf4-b335-41eb-acc6-50eb3c965e5a", "name": "IEEE Transactions on Computational Social Systems", "type": "journal", "alternate_names": ["IEEE Trans Comput Soc Syst"], "issn": "2329-924X", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=6570650", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/aboutJournal.jsp?punumber=6570650"]}, "title": "A Rhombic Dodecahedron Topology for Human-Centric Banking Big Data", "abstract": "Banks are collecting an unprecedentedly large amount of data about their customers from difference sources, considering their cyber, physical, social activities. The focus of this paper is to study the problem of information sharing and lower the communication overhead among different nodes for a specific data mining approach in distributed big data architectures. This problem can be abstracted as how to efficiently search under a specific cluster node topology. This paper proposes a new design rule for topologies including: 1) low coordination number; 2) high packing density; and 3) having a 3-D structure. According to this rule, a rhombic dodecahedron topology is proposed. A distributed banking big data mining framework based on the proposed topology is implemented. The experiments based on multioptimization benchmark functions show the excellent searching ability of the proposed topology; and a banking customer feature reduction prototype has been implemented to showcase the practicality of the data mining framework.", "venue": "IEEE Transactions on Computational Social Systems", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-06-19", "journal": {"name": "IEEE Transactions on Computational Social Systems", "pages": "1095-1105", "volume": "6"}, "authors": [{"authorId": "2789275", "name": "Hao Wang"}, {"authorId": "3059152", "name": "Shenglan Ma"}, {"authorId": "2464154", "name": "Hongning Dai"}], "citations": [{"paperId": "e9e33e2c8eb3c9eaacd20df51fbc4c83eba712ee", "title": "Big Data Applications the Banking Sector: A Bibliometric Analysis Approach"}, {"paperId": "faa5507d453e57806dee7711e122dbba08097100", "title": "Strategi Human Centric Marketing dalam Meningkatkan Omzet Penjualan RM Abah Wardja Kec. Talun Kab. Cirebon"}, {"paperId": "4b6eebaff43ad2ad6d8843e32fb4f9c45eca6c6b", "title": "Blockchain-based data privacy management with Nudge theory in open banking"}, {"paperId": "fad5295f6e66bd37332c3c69cd288f057a8b39a8", "title": "Keywords-Driven and Popularity-Aware Paper Recommendation Based on Undirected Paper Citation Graph"}, {"paperId": "a91b9d4215db896cebf5fa4ff1cd5ee30293c581", "title": "Attention Neural Network for Water Image Classification under IoT Environment"}, {"paperId": "d488270d4d8796981bbc6b55386ae02d63dc66c3", "title": "LMM: latency-aware micro-service mashup in mobile edge computing environment"}, {"paperId": "512b80cf5273b9c0032d17e4bdabb13da96320a7", "title": "Low-cohesion differential privacy protection for industrial Internet"}, {"paperId": "7d53d3b8604e9f2eace450c931e971a44ba52017", "title": "Quantum Searchable Encryption for Cloud Data Based on Full-Blind Quantum Computation"}, {"paperId": "46bc9f5cb188d204251cb93e1d9ff528ec4df512", "title": "Uncertainty-aware workflow migration among edge nodes based on blockchain"}, {"paperId": "eb381849510e4f272f0b5256eb44928ff81bb2e7", "title": "A feature-based Method by butterfly Optimization Algorithm to Predict the Execution Time of a Job in Hadoop"}, {"paperId": "fdd35d9a0990f8c73e4362fb82a6e52e8c493324", "title": "Distance Teaching Method of Accounting Informatization Course Based on Big Data Mining"}, {"paperId": "0ee06f42093b26a3a98171f0aaf5aadc93cfc174", "title": "A CNN-Based Hybrid Model for Tropical Cyclone Intensity Estimation in Meteorological Industry"}, {"paperId": "bf212042064ae86db8e502c0fcf0950c9131b3e0", "title": "A Novel Technique for Behavioral Analytics Using Ensemble Learning Algorithms in E-Commerce"}]}
