{"paperId": "7ee39f28104540c644f98146e214413c43ebe3c6", "publicationVenue": null, "title": "Ensuring sustainable human resource management during the COVID-19 pandemic: The case of Lithuanian catering organisations", "abstract": "The COVID-19 pandemic-induced work challenges have hit the catering organisations particularly hard worldwide. Lockdown suspended business activities, and uncertainty about the future alarmed both catering companies and their employees. The principles of sustainable human resource management (HRM) declared by the organisations have been put to test in critical conditions. The aim of the paper was to reveal the challenges faced by the catering organisations during the COVID-19 pandemic in the field of sustainable HRM and the way they were addressed. Qualitative in-depth interviews with the representatives of Lithuania’s catering service sector responsible for human resource management were carried out in order to explore how sustainable HRM has been ensured in their organisations. The research showed that state support played a critical role, which, especially when faced with the first wave of the COVID-19 pandemic, was crucial in helping to preserve businesses and to retain employees by ensuring the conditions for continuous sustainable HRM development in the future.", "venue": "Economics &amp; Sociology", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": null, "publicationDate": null, "journal": {"name": "Economics &amp; Sociology"}, "authors": [{"authorId": "3483278", "name": "A. Savanevičienė"}, {"authorId": "2187521551", "name": "Rūta Salickaitė-Žukauskienė"}, {"authorId": "113954123", "name": "Violeta Šilingienė"}, {"authorId": "118745354", "name": "S. Bilan"}], "citations": [{"paperId": "2d57727f6d9838baac68a1a834cc49fb69adf774", "title": "Sustainable HRM the next hotspot for management research? A study using topic modelling"}, {"paperId": "fd3cfc6018c8b8d1fad09790ebe822f8b8406d2e", "title": "Evaluation of personnel risk in the SMEs in the V4 countries"}]}
