{"paperId": "7ef089af0afa9b727a19646139b1c5ae8f766e7a", "publicationVenue": {"id": "1b767051-ba1f-457e-bd23-1b483c7029c7", "name": "E3S Web of Conferences", "alternate_names": ["E3S Web Conf"], "issn": "2267-1242", "url": "https://web.archive.org/web/*/http:/www.e3s-conferences.org/", "alternate_urls": ["https://www.e3s-conferences.org/"]}, "title": "Techniques of Machine Learning for the Purpose of Predicting Diabetes Risk in PIMA Indians", "abstract": "Chronic Metabolic Syndrome Diabetes is often called a “silent killer” due to how little symptoms appear early on. High blood sugar occurs in people with diabetes because their bodies have a hard time maintaining normal glucose levels. Care for a recurrent sickness would be permanent. The two most common forms of diabetes are type 1 and type 2. A better prognosis can help reduce the high risk of developing diabetes. In order to better predict the likelihood that a PIMA Indian may develop diabetes, this study will use a machine learning-based algorithm. The demographic and health records of 768 PIMA Indians were used in the analysis. Standardisation, feature selection, missing value filling, and outlier rejection were all parts of the data preparation process. Machine learning techniques such as logistic regression, decision trees, random forests, the KNN model, the AdaBoost classifier, the Naive Bayes model, and the XGBoost model were used in the study. Accuracy, precision, recall, and F1 score were the only metrics utilised to assess the models' efficacy. The results demonstrate that. The results of this study reveal that diabetes risk may be reliably predicted using machine learning-based models, which has important implications for the early detection and prevention of this illness among PIMA Indians.", "venue": "E3S Web of Conferences", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": null, "journal": {"name": "E3S Web of Conferences"}, "authors": [{"authorId": "2256243191", "name": "Bhukya Madhu"}, {"authorId": "2105397831", "name": "Veerender Aerranagula"}, {"authorId": "2216345907", "name": "Riyaz Mahomad"}, {"authorId": "2256909564", "name": "V. Ravindernaik"}, {"authorId": "2256893939", "name": "K. Madhavi"}, {"authorId": "2256892723", "name": "Gopal Krishna"}], "citations": [{"paperId": "b90e73eb24fa8ad246aa37c27adef5efc61ea861", "title": "Progressive Collaborative Method for Protecting Users Privacy in Location-Based Services"}, {"paperId": "a5668998751aa3f0e18a4fcb47c5315e6c5b3bf9", "title": "Personalizing the E-Commerce – Experience: A Recommendation System"}, {"paperId": "d25e1014d16ea34544d9ed118d19be36e2ff4a1a", "title": "Investigating the abnormalities of deep learning with customized architecture using deep learning 4J"}, {"paperId": "b06ee578e2f92c0fef9dff314486c4e1f53ad876", "title": "Smart Air Quality Monitoring Using IoT"}, {"paperId": "021e930dd127cb31c4817832904423b92c8abdb8", "title": "Enhancing Agricultural Productivity through Smart Farming with IoT"}, {"paperId": "f9da3fafb41582529171cc8d5b2c2ef52e8276e9", "title": "Image reconstruction techniques using deep learning quality segmentation"}]}
