{"paperId": "7f02d3c5c49b299551863f1591ef79597e8e594d", "publicationVenue": {"id": "6c277161-2256-47dc-8278-f478894f0fd2", "name": "Advances in Digital Crime, Forensics, and Cyber Terrorism", "alternate_names": ["Adv Digit Crime Forensics Cyber Terror"], "issn": "2327-0381", "url": "https://www.igi-global.com/book-series/advances-digital-crime-forensics-cyber/73676"}, "title": "Applications of Machine Learning in Cyber Forensics", "abstract": "Nowadays, individuals and organizations experience an increase in cyber-attacks. Combating such cybercrimes has become the greatest struggle for individual persons and organizations. Furthermore, the battle has heightened as cybercriminals have gone a step ahead, employing the complicated cyber-attack technique. These techniques are minute and unobtrusive in nature and habitually disguised as authentic requests and commands. The cyber-secure professionals and digital forensic investigators enforce by collecting large and complex pools of data to reveal the potential digital evidence (PDE) to combat these attacks and helps investigators to arrive at particular conclusions and/or decisions. In cyber forensics, the challenging issue is hard for the investigators to make conclusions as the big data often comes from multiple sources and in different file formats. The objective is to explore the possible applications of machine learning (ML) in cyber forensics and to discuss the various research issues, the solutions of which will serve out to provide better predictions for cyber forensics.", "venue": "Advances in Digital Crime, Forensics, and Cyber Terrorism", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": null, "journal": {"name": "Advances in Digital Crime, Forensics, and Cyber Terrorism"}, "authors": [{"authorId": "2321972", "name": "Kishore Rajendiran"}, {"authorId": "144135750", "name": "K. Kannan"}, {"authorId": "1770550", "name": "Yongbin Yu"}], "citations": [{"paperId": "a941ec8498f82c809b714a4724825347d0e204f8", "title": "Digital Forensics and Machine Learning to Fraudulent Email Prediction"}, {"paperId": "9f7442294dd7a93122243ff6f1686d42f36628b9", "title": "Holistic Analytics of Digital Artifacts: Unique Metadata Association Model"}]}
