{"paperId": "7f07617e52a36dd7a0e46f604dab92b53ad1219f", "publicationVenue": {"id": "0aed7a40-85f3-4c66-9e1b-c1556c57001b", "name": "PLoS ONE", "type": "journal", "alternate_names": ["Plo ONE", "PLOS ONE", "PLO ONE"], "issn": "1932-6203", "url": "https://journals.plos.org/plosone/", "alternate_urls": ["http://www.plosone.org/"]}, "title": "Boosting k-means clustering with symbiotic organisms search for automatic clustering problems", "abstract": "Kmeans clustering algorithm is an iterative unsupervised learning algorithm that tries to partition the given dataset into k pre-defined distinct non-overlapping clusters where each data point belongs to only one group. However, its performance is affected by its sensitivity to the initial cluster centroids with the possibility of convergence into local optimum and specification of cluster number as the input parameter. Recently, the hybridization of metaheuristics algorithms with the K-Means algorithm has been explored to address these problems and effectively improve the algorithm’s performance. Nonetheless, most metaheuristics algorithms require rigorous parameter tunning to achieve an optimum result. This paper proposes a hybrid clustering method that combines the well-known symbiotic organisms search algorithm with K-Means using the SOS as a global search metaheuristic for generating the optimum initial cluster centroids for the K-Means. The SOS algorithm is more of a parameter-free metaheuristic with excellent search quality that only requires initialising a single control parameter. The performance of the proposed algorithm is investigated by comparing it with the classical SOS, classical K-means and other existing hybrids clustering algorithms on eleven (11) UCI Machine Learning Repository datasets and one artificial dataset. The results from the extensive computational experimentation show improved performance of the hybrid SOSK-Means for solving automatic clustering compared to the standard K-Means, symbiotic organisms search clustering methods and other hybrid clustering approaches.", "venue": "PLoS ONE", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-08-11", "journal": {"name": "PLoS ONE", "volume": "17"}, "authors": [{"authorId": "51039276", "name": "A. M. Ikotun"}, {"authorId": "9304618", "name": "A. Ezugwu"}], "citations": [{"paperId": "d9ab201abcc30e843f5bff53e3a4e99b7a534860", "title": "Genome sequencing of drake semen micobiome with correlation with their compositions, sources and potential mechanisms affecting semen quality"}, {"paperId": "76c4364eb8cb18e2d1bf9165866627247c50efa9", "title": "A systematic review of symbiotic organisms search algorithm for data clustering and predictive analysis"}, {"paperId": "dcef3118fe328a099da8afc30a9eef8f9f5a4d5c", "title": "Recognition of mineralization-related anomaly patterns through an autoencoder neural network for mineral exploration targeting"}, {"paperId": "6e52575c9b84cd6ee2939a760f885176f4a69414", "title": "Molecular Dynamics Simulations Combined with Markov Model to Explore the Effect of Allosteric Inhibitor Binding on Bromodomain-Containing Protein 4"}, {"paperId": "0e3096cc654d8b50537ea9ffeb70d6710b5380b6", "title": "Exploring the synergistic effects of hybrid grid partitioning and rough set method for fuzzy rule generation in dataset classification"}, {"paperId": "5b38e07869f1dc4d62cc741d7561b255d15f5ce5", "title": "A Clustering Approach for Business Models of Iranian Banks; Analysis of Risks and Migrations"}, {"paperId": "e55bf10214484b935f35adc92836ec82c24b7433", "title": "Improved SOSK-Means Automatic Clustering Algorithm with a Three-Part Mutualism Phase and Random Weighted Reflection Coefficient for High-Dimensional Datasets"}, {"paperId": "4c22b1afca28296dbcfb07a489ebf2dd194fb687", "title": "Prediction and Visualisation of SICONV Project Profiles Using Machine Learning"}, {"paperId": "84b22fdb4d2f61f64c5847fc3c2fb1c9815e36f6", "title": "Enhanced Firefly-K-Means Clustering with Adaptive Mutation and Central Limit Theorem for Automatic Clustering of High-Dimensional Datasets"}, {"paperId": "8a354d07c259c66b52d09320ba250a4ac565945c", "title": "Mapping Indonesian potential fishing zone using hierarchical and non-hierarchical clustering"}]}
