{"paperId": "7f1314331207f42283917428821ff4fecdee5055", "publicationVenue": {"id": "10a4a695-8417-42c7-983d-742df48b3905", "name": "Journal of Systems and Software", "type": "journal", "alternate_names": ["J Syst Softw"], "issn": "0164-1212", "url": "http://www.elsevier.com/wps/find/journaldescription.cws_home/505732/description#description", "alternate_urls": ["http://www.elsevier.com/wps/find/journaldescription.cws_home/505732/description", "http://www.sciencedirect.com/science/journal/01641212"]}, "title": "Behaviour Driven Development: A Systematic Mapping Study", "abstract": "Context: Behaviour Driven Development (BDD) uses scenarios written in semi-structured natural language to express software requirements in a way that can be understood by all stakeholders. The resulting natural language specifications can also be executed to reveal correct and problematic parts of a software. Although BDD was introduced about two decades ago, there is a lack of secondary studies in peer-reviewed scientific literature. Objective: To understand the current state of BDD research by conducting a systematic mapping study that covers studies published from 2006 to 2021. Method: By following the guidelines for conducting systematic mapping studies in software engineering, we sought to answer research questions on types of venues in which BDD papers have been published, research, contributions, studied topics and their evolution, and evaluation methods used in published BDD research. Results: The study identified 166 papers which were mapped. Key results include the following: the dominance of conference papers; scarcity of research with insights from the industry; shortage of philosophical papers on BDD; acute shortage of metrics for measuring various aspects of BDD specifications and the processes for producing BDD specifications; the dominance of studies on using BDD for facilitating various software development endeavours, improving the BDD process and associated artefacts, and applying BDD in different contexts; scarcity of studies on using BDD alongside other software techniques and technologies; increase in diversity of studied BDD topics; and notable use of case studies and experiments to study different BDD aspects. Conclusion: The paper improves our understanding of the state of the art of BDD, and highlights important areas of focus for future BDD research.", "venue": "Journal of Systems and Software", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-05-01", "journal": {"name": "J. Syst. Softw.", "pages": "111749", "volume": "203"}, "authors": [{"authorId": "40865456", "name": "L. Binamungu"}, {"authorId": "2694337", "name": "Salome Maro"}], "citations": []}
