{"paperId": "7f188bd8e638a74eea0d720abc9f43110c1bb388", "publicationVenue": {"id": "ccd8e532-73c6-414f-bc91-271bbb2933e2", "name": "Electronics", "type": "journal", "issn": "1450-5843", "alternate_issns": ["2079-9292", "0883-4989"], "url": "http://www.electronics.etfbl.net/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-247562", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-247562", "https://www.mdpi.com/journal/electronics"]}, "title": "Towards Secure Fog Computing: A Survey on Trust Management, Privacy, Authentication, Threats and Access Control", "abstract": "Fog computing is an emerging computing paradigm that has come into consideration for the deployment of Internet of Things (IoT) applications amongst researchers and technology industries over the last few years. Fog is highly distributed and consists of a wide number of autonomous end devices, which contribute to the processing. However, the variety of devices offered across different users are not audited. Hence, the security of Fog devices is a major concern that should come into consideration. Therefore, to provide the necessary security for Fog devices, there is a need to understand what the security concerns are with regards to Fog. All aspects of Fog security, which have not been covered by other literature works, need to be identified and aggregated. On the other hand, privacy preservation for user’s data in Fog devices and application data processed in Fog devices is another concern. To provide the appropriate level of trust and privacy, there is a need to focus on authentication, threats and access control mechanisms as well as privacy protection techniques in Fog computing. In this paper, a survey along with a taxonomy is proposed, which presents an overview of existing security concerns in the context of the Fog computing paradigm. Moreover, the Blockchain-based solutions towards a secure Fog computing environment is presented and various research challenges and directions for future research are discussed.", "venue": "Electronics", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2021-05-14", "journal": {"name": "Electronics", "pages": "1171", "volume": "10"}, "authors": [{"authorId": "1515559453", "name": "Abdullah Al-Noman Patwary"}, {"authorId": "8610236", "name": "R. Naha"}, {"authorId": "144901372", "name": "S. Garg"}, {"authorId": "2018677", "name": "S. Battula"}, {"authorId": "104207848", "name": "Md Anwarul Kaium Patwary"}, {"authorId": "2733437", "name": "E. Aghasian"}, {"authorId": "1755774", "name": "M. B. Amin"}, {"authorId": "2346798", "name": "Aniket Mahanti"}, {"authorId": "3102409", "name": "Mingwei Gong"}], "citations": [{"paperId": "5b9190a27f9522a98d290d7eaed5e8568e0c92ea", "title": "Enhancing security mechanisms for robot-fog computing networks"}, {"paperId": "d8f499a196c1196c51d8f6ac274396e35941c1ba", "title": "Blockchain-enabled trust management for secure content caching in mobile edge computing using deep reinforcement learning"}, {"paperId": "bad2f46aaac855bcc680ea440a7a9420dd949a52", "title": "Enhanced Authentication Methods for Access and Control Management in Cloud Computing"}, {"paperId": "8a94fc4b153262348879cb82616a0e980813fc08", "title": "Mode selection, caching and physical layer security for fog networks"}, {"paperId": "846e3325a8a436abb2b5a4a59f0a2f41febaa850", "title": "Unboxing fog security: a review of fog security and authentication mechanisms"}, {"paperId": "dd2bc506efe59844d39176e7bb3b20aeee5fa299", "title": "Fog computing security: A review"}, {"paperId": "25022251d1d60037629777c62ceb411e069d7a47", "title": "RepuTE: A soft voting ensemble learning framework for reputation-based attack detection in fog-IoT milieu"}, {"paperId": "23e2a22c630a26d4e14868e7af606d84c7321ca2", "title": "FogCrypto: Towards Cryptographic protocols for securing Fog assisted cloud System"}, {"paperId": "dc417e06047c76f6dbc471140f9e4531b506b7b6", "title": "A Fuzzy Approach to Trust Management in Fog Computing"}, {"paperId": "d2f78f50412cbc60e9385ec24a2fc0783c728ef5", "title": "A Toolchain and Interoperability Framework to enhance privacy and individual control at the Edge"}, {"paperId": "04d95bd95d659f6104759db290e0fc38763fc290", "title": "A social qualitative trust framework for Fog computing"}, {"paperId": "82a1cf0b94fa54cc937521e031e4822b27368841", "title": "Improving Network-Based Anomaly Detection in Smart Home Environment"}, {"paperId": "b3931e8c488a253092b617685d337e919a9dafc3", "title": "An Improved ID-Based Data Storage Scheme for Fog-Enabled IoT Environments"}, {"paperId": "5099df8a8c59b57c179e0bad234777dde729ab22", "title": "Optimization of 5G/6G Telecommunication Infrastructure through an NFV-Based Element Management System"}, {"paperId": "0f4320c0bb68ebbf320352e9f9d92bb59fa6816f", "title": "Multi-Unit Serial Polynomial Multiplier to Accelerate NTRU-Based Cryptographic Schemes in IoT Embedded Systems"}, {"paperId": "74b51656d81df46ab41f531b3f6cc51aff1c3505", "title": "CL-MLSP: The design of a detection mechanism for sinkhole attacks in smart cities"}, {"paperId": "8776224a0a099597d5cf841776f72c0b775afe11", "title": "A blockchain-based and privacy-preserved authentication scheme for inter-constellation collaboration in Space-Ground Integrated Networks"}, {"paperId": "2cbc81ecad1f52ed4cb082486f8674e432c3eaf4", "title": "Systematically Understanding Cybersecurity Economics: A Survey"}, {"paperId": "3b4a353808546640ed26b793ad66a97c38ca2114", "title": "An Overview of Fog Computing and Edge Computing Security and Privacy Issues"}, {"paperId": "30f48a9727389bff8f1c729380e9e97a993be818", "title": "Analysis of quality of service metrics and the security concerns in integrated cloud-fog environment for healthcare system"}, {"paperId": "6bf453d0855c937922ddc47599fbb60871ede9c7", "title": "Asset Management Method of Industrial IoT Systems for Cyber-Security Countermeasures"}, {"paperId": "b5340a637e497e6a3c147f4e80556e1352e5a44a", "title": "Modeling of a Generic Edge Computing Application Design"}, {"paperId": "be81c7ee02475e2ff0e63608d025ea6a246975ff", "title": "Constructing a prior-dependent graph for data clustering and dimension reduction in the edge of AIoT"}, {"paperId": "db4f927e142bfd75d1606c80e5a76559bddcb6c7", "title": "Privacy Preservation and Analytical Utility of E-Learning Data Mashups in the Web of Data"}, {"paperId": "0970642cbe568044a71143b6b96dd7a09dbdc242", "title": "Managing Trust and Detecting Malicious Groups in Peer-to-Peer IoT Networks"}, {"paperId": "140b4ad3792dcd7356ea186ada7186fe81a3832b", "title": "Demystifying Blockchain: A Critical Analysis of Application Characteristics in Different Domains"}, {"paperId": "880f016495f6479fdcbb20621e04e67fab391f6e", "title": "Mitigating Security Problems in Fog Computing System"}]}
