{"paperId": "7f319090f8fd98e6f66a36b974b4317acfd301aa", "publicationVenue": {"id": "6afe5f5f-0d54-4e3a-aa07-ed4778cf1405", "name": "International Conference on Communication Systems and Networks", "type": "conference", "alternate_names": ["Communication Systems and Networks", "Int Conf Commun Syst Netw", "COMSNETS", "Commun Syst Netw"], "url": "http://www.comsnets.org/"}, "title": "Demo: Battery Depletion Attack Through Packet Injection on IoT Thread Mesh Network", "abstract": "In the rapidly expanding landscape of Internet of Things (IoT) device manufacturing and deployment, concerns about security have become prominent. This demonstration involves practical attacks on a thread-mesh network within a controlled environment, exploiting vulnerabilities in various components of the Thread network stack. Our attack vectors successfully identified nearby Thread networks and devices by gathering 2-byte Personal Area Network ID (PAN ID) and device frequency information, serving as reconnaissance for potential additional attacks. The focus was on investigating susceptibility to replay attacks and packet injection into thread-mesh networks. Although the experiment attempted to capture thread packets to emulate an authorised sender, the cryptographic encryption and sequence numbers employed for integrity checks resulted in packet rejection by the network. Despite this, our successful injection of packets highlights the potential for battery depletion attacks.", "venue": "International Conference on Communication Systems and Networks", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2024-01-03", "journal": {"name": "2024 16th International Conference on COMmunication Systems & NETworkS (COMSNETS)", "pages": "318-320"}, "authors": [{"authorId": "2284343075", "name": "Poonam Yadav"}, {"authorId": "2284342249", "name": "Nirdesh Sagathia"}, {"authorId": "2284342318", "name": "Dan Wade"}], "citations": []}
