{"paperId": "7f369202dfbfc57ae89efccbc54b232cabefe66d", "publicationVenue": {"id": "721ed878-9136-408b-b2a3-dce27b9fa39e", "name": "Journal of Personalized Medicine", "type": "journal", "alternate_names": ["J Pers Med"], "issn": "2075-4426", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-225205", "alternate_urls": ["https://www.mdpi.com/journal/jpm", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-225205"]}, "title": "A Novel Patient Similarity Network (PSN) Framework Based on Multi-Model Deep Learning for Precision Medicine", "abstract": "Precision medicine can be defined as the comparison of a new patient with existing patients that have similar characteristics and can be referred to as patient similarity. Several deep learning models have been used to build and apply patient similarity networks (PSNs). However, the challenges related to data heterogeneity and dimensionality make it difficult to use a single model to reduce data dimensionality and capture the features of diverse data types. In this paper, we propose a multi-model PSN that considers heterogeneous static and dynamic data. The combination of deep learning models and PSN allows ample clinical evidence and information extraction against which similar patients can be compared. We use the bidirectional encoder representations from transformers (BERT) to analyze the contextual data and generate word embedding, where semantic features are captured using a convolutional neural network (CNN). Dynamic data are analyzed using a long-short-term-memory (LSTM)-based autoencoder, which reduces data dimensionality and preserves the temporal features of the data. We propose a data fusion approach combining temporal and clinical narrative data to estimate patient similarity. The experiments we conducted proved that our model provides a higher classification accuracy in determining various patient health outcomes when compared with other traditional classification algorithms.", "venue": "Journal of Personalized Medicine", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-05-01", "journal": {"name": "Journal of Personalized Medicine", "volume": "12"}, "authors": [{"authorId": "9627285", "name": "Alramzana Nujum Navaz"}, {"authorId": "2164969197", "name": "Hadeel T. El-Kassabi"}, {"authorId": "2394689", "name": "M. Serhani"}, {"authorId": "50196474", "name": "A. Oulhaj"}, {"authorId": "2090653121", "name": "Khaled Khalil"}], "citations": [{"paperId": "49c18f7a97b79eddc7d951c932c15ff32e3d1a82", "title": "A Patient Similarity Network (CHDmap) to Predict Outcomes After Congenital Heart Surgery: Development and Validation Study"}, {"paperId": "2bc05a09e6aa691016f38e0d8dc6f245d29dc32f", "title": "Resource-Aware Federated Hybrid Profiling for Edge Node Selection in Federated Patient Similarity Network"}, {"paperId": "409615de63a284c6f7fab5940af18c8765f7ad5e", "title": "Constructing gene similarity networks using co-occurrence probabilities"}, {"paperId": "858bd4ed56012c1460f329ac7ad8f7ce4a208884", "title": "Empowering Patient Similarity Networks through Innovative Data-Quality-Aware Federated Profiling"}, {"paperId": "59b632008446293513c57dc70f7d1437852622c7", "title": "Composition of caching and classification in edge computing based on quality optimization for SDN-based IoT healthcare solutions"}, {"paperId": "60c00529b1ddfaf8af8ca900eb87f06d1d3ca995", "title": "Resource-Aware Federated Hybrid Proﬁling for Edge Node Selection in Federated Patient Similarity Network"}]}
