{"paperId": "7f50e8324ce3175eac914387bbdfea8bb8bff03e", "publicationVenue": {"id": "da6a2ec5-0670-4749-9af2-146d7ca04778", "name": "Civil and Environmental Engineering Reports", "type": "journal", "alternate_names": ["Civ Environ Eng Rep"], "issn": "2080-5187", "url": "http://www.degruyter.com/view/j/ceer"}, "title": "Accuracy Characteristics of the Selected Diagnostics Methods and the Adjustment of Geodetic Observations", "abstract": "Abstract The article presents the results of the adjustment of the experimental horizontal geodetic network using the classical method and the estimation of strengths in identifying observations with gross error and analyzing the accuracy of the obtained results. The presented analyses were made considering the possibility of their use in implementation networks and measurement and control networks used for monitoring building structures. The paper’s subject was a horizontal network established on the Morasko campus (Poznań). While creating it, the practical needs and economics of measurements were taken into account. The obtained results of numerical analyzes confirmed the benefits of using the methods of estimating strengths in the equalization process, which give satisfactory results in the case of outliers.", "venue": "Civil and Environmental Engineering Reports", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-12-01", "journal": {"name": "Civil and Environmental Engineering Reports", "pages": "167 - 183", "volume": "31"}, "authors": [{"authorId": "2151012264", "name": "Martyna Kulupa"}, {"authorId": "2151012480", "name": "Paulina Magda"}, {"authorId": "69489610", "name": "M. Mrówczyńska"}], "citations": [{"paperId": "00dab64464883961a9b6754abc3130adc3395d69", "title": "Slope stability analysis of post-mining dumps with the use of photogrammetric geometry measurements – a case study"}, {"paperId": "78e6268ec4491a3684259394d08734a43ca47e1d", "title": "Practical methods of observation of the impact of mining exploitation in the right-of-way on selected examples"}]}
