{"paperId": "7f5801f8036e71658a12d16203617b2ab25ef14f", "publicationVenue": {"id": "41bf9ed3-85b3-4c90-b015-150e31690253", "name": "Conference on Empirical Methods in Natural Language Processing", "type": "conference", "alternate_names": ["Empir Method Nat Lang Process", "Empirical Methods in Natural Language Processing", "Conf Empir Method Nat Lang Process", "EMNLP"], "url": "https://www.aclweb.org/portal/emnlp"}, "title": "Discovering Differences in the Representation of People using Contextualized Semantic Axes", "abstract": "A common paradigm for identifying semantic differences across social and temporal contexts is the use of static word embeddings and their distances. In particular, past work has compared embeddings against “semantic axes” that represent two opposing concepts. We extend this paradigm to BERT embeddings, and construct contextualized axes that mitigate the pitfall where antonyms have neighboring representations. We validate and demonstrate these axes on two people-centric datasets: occupations from Wikipedia, and multi-platform discussions in extremist, men’s communities over fourteen years. In both studies, contextualized semantic axes can characterize differences among instances of the same word type. In the latter study, we show that references to women and the contexts around them have become more detestable over time.", "venue": "Conference on Empirical Methods in Natural Language Processing", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-10-21", "journal": {"pages": "3477-3494"}, "authors": [{"authorId": "15983089", "name": "Li Lucy"}, {"authorId": "2174240589", "name": "Divya Tadimeti"}, {"authorId": "2064411219", "name": "David Bamman"}], "citations": [{"paperId": "dcf14d5ca582f1a29d2224340704a66f17c4ea68", "title": "Adjusting Interpretable Dimensions in Embedding Space with Human Judgments"}, {"paperId": "7a4fe2f003241ad97bf1778e527cb0306fa90da2", "title": "CoMPosT: Characterizing and Evaluating Caricature in LLM Simulations"}, {"paperId": "70b73e272621562c6261f86d2ebf814703b760ed", "title": "Unsupervised Contrast-Consistent Ranking with Language Models"}, {"paperId": "0f9d73aff3db64622c9a4d1a146f79ef1b8e5c70", "title": "WikiBio: a Semantic Resource for the Intersectional Analysis of Biographical Events"}, {"paperId": "25c1708ed244c88e3c34fdb9fd91f2274f9fe244", "title": "Measuring Social Dimensions of Self-Presentation in Social Media Biographies with an Identity-based Approach"}, {"paperId": "fafd97e3f98d578aa4fe29dc3dfe69485376442a", "title": "Beyond Fish and Bicycles: Exploring the Varieties of Online Women’s Ideological Spaces"}, {"paperId": "d667c5ccdda72896c5be0fb2e490351d5ff4a1b2", "title": "Overleaf Example"}, {"paperId": null, "title": "CIDER: Context-sensitive polarity measurement for short-form text"}]}
