{"paperId": "7f76c15554df3f6c12f8c37ba0ff13cf06737dff", "publicationVenue": null, "title": "Prediction of monthly Arctic sea ice concentrations using satellite and reanalysis data based on convolutional neural networks", "abstract": "Abstract. Changes in Arctic sea ice affect atmospheric circulation,\nocean current, and polar ecosystems. There have been unprecedented decreases\nin the amount of Arctic sea ice due to global warming. In this study, a novel 1-month sea ice concentration (SIC)\nprediction model is proposed, with eight predictors using a deep-learning\napproach, convolutional neural networks (CNNs). This monthly SIC prediction\nmodel based on CNNs is shown to perform better predictions (mean absolute\nerror – MAE – of 2.28 %, anomaly correlation coefficient – ACC – of 0.98, root-mean-square error – RMSE – of 5.76 %, normalized RMSE – nRMSE – of 16.15 %,\nand NSE – Nash–Sutcliffe efficiency – of 0.97) than a random-forest-based (RF-based) model (MAE of 2.45 %, ACC\nof 0.98, RMSE of 6.61 %, nRMSE of 18.64 %, and NSE of 0.96) and the\npersistence model based on the monthly trend (MAE of 4.31 %, ACC of 0.95,\nRMSE of 10.54 %, nRMSE of 29.17 %, and NSE of 0.89) through hindcast\nvalidations. The spatio-temporal analysis also confirmed the superiority of\nthe CNN model. The CNN model showed good SIC prediction results in extreme\ncases that recorded unforeseen sea ice plummets in 2007 and 2012 with RMSEs of less\nthan 5.0 %. This study also examined the importance of the input\nvariables through a sensitivity analysis. In both the CNN and RF models, the\nvariables of past SICs were identified as the most sensitive factor in\npredicting SICs. For both models, the SIC-related variables generally\ncontributed more to predict SICs over ice-covered areas, while other\nmeteorological and oceanographic variables were more sensitive to the\nprediction of SICs in marginal ice zones. The proposed 1-month SIC\nprediction model provides valuable information which can be used in various\napplications, such as Arctic shipping-route planning, management of the fishing\nindustry, and long-term sea ice forecasting and dynamics.", "venue": "", "year": 2020, "fieldsOfStudy": ["Environmental Science"], "publicationTypes": null, "publicationDate": "2020-03-25", "journal": {"name": "The Cryosphere", "pages": "1083-1104", "volume": "14"}, "authors": [{"authorId": "2152651140", "name": "Y. J. Kim"}, {"authorId": "46695915", "name": "Hyun‐cheol Kim"}, {"authorId": "65853237", "name": "Daehyeon Han"}, {"authorId": "2108229655", "name": "Sanggyun Lee"}, {"authorId": "143927093", "name": "J. Im"}], "citations": [{"paperId": "27b2b70c860225d7da75f0023c0391b7fc6352ce", "title": "Sea Ice Extraction via Remote Sensing Imagery: Algorithms, Datasets, Applications and Challenges"}, {"paperId": "8b823748fde57873c2b1da46612fd00e48ca381f", "title": "Advances in machine learning techniques can assist across a variety of stages in sea ice applications"}, {"paperId": "86d95286411fb54a2f3e761525503251a9f84f20", "title": "Deep Learning‐Based Seasonal Forecast of Sea Ice Considering Atmospheric Conditions"}, {"paperId": "f8d7ce1b042710918afc06952aabf568b339929b", "title": "Surrogate Modelling for Sea Ice Concentration using Lightweight Neural Ensemble"}, {"paperId": "bbd3f495b70e232165e591bcd3157d74beb5aaa9", "title": "Daily-Scale Prediction of Arctic Sea Ice Concentration Based on Recurrent Neural Network Models"}, {"paperId": "2328199fba57fdda2f7011e3960cf560a0f8d6b5", "title": "Machine Learning-Based Image Processing for Ice Concentration during Chukchi and Beaufort Sea Trials"}, {"paperId": "176a88e8f5d4123c8198c9bcd0c69c437cad2689", "title": "Self-Attention Convolutional Long Short-Term Memory for Short-Term Arctic Sea Ice Motion Prediction Using Advanced Microwave Scanning Radiometer Earth Observing System 36.5 GHz Data"}, {"paperId": "f761a76b474b72d751104c9a12a504bc505f3986", "title": "Multi-task Deep Convolutional Network to Predict Sea Ice Concentration and Drift in the Arctic Ocean"}, {"paperId": "59702bc145b1bbdbc7abb78c4bc2805d8a3b40a4", "title": "Optimization of the k-nearest-neighbors model for summer Arctic Sea ice prediction"}, {"paperId": "ae105688f3ee8eb82947b8233c752d3d6319c0c2", "title": "Key factors for quantitative precipitation nowcasting using ground weather radar data based on deep learning"}, {"paperId": "210ea0bda4b32f0ce2155dfae8fc1ca67e20befd", "title": "CoCluster-DAGCN: a dynamic aggregate graph convolution network by a co-attention LSTM cluster for ocean temperature predictions"}, {"paperId": "1217207c9415827579886e5452b6e0f34113bcbe", "title": "Subseasonal Prediction of Regional Antarctic Sea Ice by a Deep Learning Model"}, {"paperId": "02bf891ed6ebb38d83278a97413834c58017257b", "title": "IceTFT v1.0.0: interpretable long-term prediction of Arctic sea ice extent with deep learning"}, {"paperId": "2d30f0999172bc4a865b3d586ffabb5eb81b914c", "title": "Machine learning for daily forecasts of Arctic sea-ice motion: an attribution assessment of model predictive skill"}, {"paperId": "dece82994a5e37894008f4694039adb074294aec", "title": "Sea Ice Extraction via Remote Sensed Imagery: Algorithms, Datasets, Applications and Challenges"}, {"paperId": "6537f3b509e436070cac7d6d6fa2060268a7a997", "title": "A Deep Learning and Hidden Hierarchical Markov Model based analysis of Polar Ice Depletions and effects on Movements of Vulnerable Polar Animals"}, {"paperId": "e536eb895ea3d17fd0e2bae529e69bb5609a48f5", "title": "Estimation of Daily Arctic Winter Sea Ice Thickness from Thermodynamic Parameters Using a Self-Attention Convolutional Neural Network"}, {"paperId": "a7a0c77b6166b328525cc9d156bcb2ba8f973140", "title": "A Multi-Mode Convolutional Neural Network to reconstruct satellite-derived chlorophyll-a time series in the global ocean from physical drivers"}, {"paperId": "884aa396c8c94c598aef944eac35bcfada6b6ba4", "title": "Seasonal prediction and possible causes of sudden losses of sea-ice in the Weddell Sea in recent years based on potential oceanic and atmospheric factors"}, {"paperId": "284d543c61e904e0dfd10caa673ae716eabab42c", "title": "MT-IceNet - A Spatial and Multi-Temporal Deep Learning Model for Arctic Sea Ice Forecasting"}, {"paperId": "44ba12d5bb4eac3602752ee40c36cdbedecab949", "title": "Data-Driven Short-Term Daily Operational Sea Ice Regional Forecasting"}, {"paperId": "b5951daaa11db401ce8227be88da8c8c4b03e010", "title": "ConvLSTM-CRF: Sea Ice Concentration Prediction with ConvLSTM and Conditional Random Fields"}, {"paperId": "bd219195915259c1effb3c5ff314335a630c318a", "title": "Probabilistic spatiotemporal seasonal sea ice presence forecasting using sequence-to-sequence learning and ERA5 data in the Hudson Bay region"}, {"paperId": "7c4a8fd79e518ed855b72d7609aafdc80a3985ee", "title": "Semantic image segmentation for sea ice parameters recognition using deep convolutional neural networks"}, {"paperId": "4fa97f26a1cc23127e6dbd16e28670900313f34e", "title": "A Mid- and Long-Term Arctic Sea Ice Concentration Prediction Model Based on Deep Learning Technology"}, {"paperId": "4f54412787090adc91415020e93f0343b22e9356", "title": "Prediction of Pan-Arctic Sea Ice Using Attention-Based LSTM Neural Networks"}, {"paperId": "e1db6d1bce925b64b1574d15f20951859aa32628", "title": "The Challenge of Arctic Sea Ice Thickness Prediction by ECMWF on Subseasonal Time Scales"}, {"paperId": "99ac537df28ce641f0e7f66a9013a60a7c54090a", "title": "Neural Network Prediction for Ice Shapes on Airfoils Using iceFoam Simulations"}, {"paperId": "3dfb5ac8335557d6865642290d168102d1a4b880", "title": "Multi-Task Deep Learning Based Spatiotemporal Arctic Sea Ice Forecasting"}, {"paperId": "bed523942f87ebe4a5e2d51a79823cdc81eb4d86", "title": "Probabilistic Gridded Seasonal Sea Ice Presence Forecasting using Sequence to Sequence Learning"}, {"paperId": "bc62aba69459ff601b910b9980190e87d74b369c", "title": "Short-Term Daily Prediction of Sea Ice Concentration Based on Deep Learning of Gradient Loss Function"}, {"paperId": "82622b7e863a5f6cb5c7263e0547362bcbb4e204", "title": "Two-Stream Convolutional Long- and Short-Term Memory Model Using Perceptual Loss for Sequence-to-Sequence Arctic Sea Ice Prediction"}, {"paperId": "05f53adf1921037008b1bbc3468520454eae84fb", "title": "Bibliography"}, {"paperId": "d2f5569ad830054b824b693b869101257381882d", "title": "Sea Ice Forecasting using Attention-based Ensemble LSTM"}, {"paperId": "ac7adca1ba2ff160c4028a130b27cd734523b4dd", "title": "Predicting Daily Arctic Sea Ice Concentration in the Melt Season Based on a Deep Fully Convolution Network Model"}, {"paperId": "023c88adc3e766ae7dac1e8c4a10fe9ab8b5b7f7", "title": "Mapping Potential Plant Species Richness over Large Areas with Deep Learning, MODIS, and Species Distribution Models"}, {"paperId": "ee31583b8f8f88104b12bcf97752dfc902679a07", "title": "ConvLSTM-Based Wave Forecasts in the South and East China Seas"}, {"paperId": "ad64da80df85f8c7afe762f0b3b39281b59d3a0c", "title": "Regression Networks for Calculating Englacial Layer Thickness"}, {"paperId": "522144237db906e2e0d930a1af97888893072608", "title": "Seasonal Arctic sea ice forecasting with probabilistic deep learning"}, {"paperId": "9973e36702996ed225e61ce388eeb3653669b50c", "title": "Calibration of sea ice drift forecasts using random forest algorithms"}, {"paperId": "e4530532e012b08b68a806ea79c428b0a43b2acb", "title": "Assessment of High‐Resolution Dynamical and Machine Learning Models for Prediction of Sea Ice Concentration in a Regional Application"}, {"paperId": "706c0fc81771b5a16eb8e4b751c0fbc7a57932c9", "title": "A Bayesian Logistic Regression for Probabilistic Forecasts of the Minimum September Arctic Sea Ice Cover"}, {"paperId": "17d6a2607529fc1eff36d1d5a6cd0588414748f3", "title": "Extended Range Arctic Sea Ice Forecast with Convolutional Long-Short Term Memory Networks"}, {"paperId": "653c3255447c033e8efbdd0365f1f07d7c24b0e3", "title": "A Spatiotemporal Multiscale Deep Learning Model for Subseasonal Prediction of Arctic Sea Ice"}, {"paperId": "a8022ce07064fc2618faad3bcd25f9b56706c696", "title": "Predicting Sea Ice Concentration With Uncertainty Quantification Using Passive Microwave and Reanalysis Data: A Case Study in Baffin Bay"}, {"paperId": "5631e5695ef6e8dbb08d3819fe4712e32a390919", "title": "Predicting the Daily Sea Ice Concentration on a Subseasonal Scale of the Pan-Arctic During the Melting Season by a Deep Learning Model"}, {"paperId": "707c8353c106f092f98ebac6312630f2b6f3f225", "title": "Forecasting of Sea Ice Concentration using CNN, PDE discovery and Bayesian Networks"}, {"paperId": "1d5bf49e91ea6bbc81386cde994c5d6881eb2f66", "title": "A data-driven deep learning model for weekly sea ice concentration prediction of the Pan-Arctic during the melting season"}, {"paperId": "e330b2f1fca19d6357320f396001e5ab81d27ede", "title": "Multi-Task Spatiotemporal Deep Learning Based Arctic Sea Ice Prediction"}]}
