{"paperId": "7f7b326d3fcc7b77216b8f7014e9a911f4c30d45", "publicationVenue": {"id": "59eaa32d-b026-4d64-beaa-c422bc2629ed", "name": "Small", "type": "journal", "issn": "1613-6810", "url": "http://www.small-journal.com/", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/16136829", "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1613-6829"]}, "title": "Transepithelial Electrical Impedance Increase Following Porous Substrate Electroporation Enables Label-Free Delivery.", "abstract": "Porous substrate electroporation (PSEP) is a promising new method for intracellular delivery, yet fundamentals of PSEP are not well understood, especially the intermediate processes leading to delivery. PSEP is an electrical method, yet the relationship between PSEP and electrical impedance remains underexplored. In this study, a device capable of measuring impedance and performing PSEP is developed and the changes in transepithelial electrical impedance (TEEI) are monitored. These measurements show TEEI increases following PSEP, unlike other electroporation methods. The authors then demonstrate how cell culture conditions and electrical waveforms influence this response. More importantly, TEEI response features are correlated with viability and delivery efficiency, allowing prediction of outcomes without fluorescent cargo, imaging, or image processing. This label-free delivery also allows improved temporal resolution of transient processes following PSEP, which the authors expect will aid PSEP optimization for new cell types and cargos.", "venue": "Small", "year": 2024, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-02-23", "journal": {"name": "Small", "pages": "\n          e2310221\n        "}, "authors": [{"authorId": "2067633881", "name": "Justin R. Brooks"}, {"authorId": "2261482491", "name": "Tyler C. Heiman"}, {"authorId": "2261481400", "name": "Sawyer R. Lorenzen"}, {"authorId": "2144704421", "name": "Ikhlaas Mungloo"}, {"authorId": "92874969", "name": "S. Mirfendereski"}, {"authorId": "2152276621", "name": "Jae Sung Park"}, {"authorId": "2152903705", "name": "Ruiguo Yang"}], "citations": []}
