{"paperId": "7fae7aa333b7393864b62f8695b481fa39c857e2", "publicationVenue": null, "title": "Complete Event Trend Detection in High-Rate Event Streams", "abstract": "Event processing applications from financial fraud detection to health care analytics continuously execute event queries with Kleene closure to extract event sequences of arbitrary, statically unknown length, called Complete Event Trends (CETs). Due to common event sub-sequences in CETs, either the responsiveness is delayed by repeated computations or an exorbitant amount of memory is required to store partial results. To overcome these limitations, we define the CET graph to compactly encode all CETs matched by a query. Based on the graph, we define the spectrum of CET detection algorithms from CPU-optimal to memory-optimal. We find the middle ground between these two extremes by partitioning the graph into time-centric graphlets and caching partial CETs per graphlet to enable effective reuse of these intermediate results. We reveal cost monotonicity properties of the search space of graph partitioning plans. Our CET optimizer leverages these properties to prune significant portions of the search to produce a partitioning plan with minimal CPU costs yet within the given memory limit. Our experimental study demonstrates that our CET detection solution achieves up to 42--fold speed-up even under rigid memory constraints compared to the state-of-the-art techniques in diverse scenarios.", "venue": "SIGMOD Conference", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2017-05-09", "journal": {"name": "Proceedings of the 2017 ACM International Conference on Management of Data"}, "authors": [{"authorId": "3035292", "name": "Olga Poppe"}, {"authorId": "40536846", "name": "Chuan Lei"}, {"authorId": "2109250356", "name": "Salah Ahmed"}, {"authorId": "1715020", "name": "Elke A. Rundensteiner"}], "citations": [{"paperId": "fabc580ab9cc6cf85385fab70a4f718a600dd68f", "title": "Exploring alternatives of Complex Event Processing execution engines in demanding cases"}, {"paperId": "60331a1766626fa0ba417f1e3b1ec4f20a1bc8f4", "title": "DLACEP: A Deep-Learning Based Framework for Approximate Complex Event Processing"}, {"paperId": "8089d1e234983cf85cedd58992c7a9a484430e7e", "title": "HYPERSONIC: A Hybrid Parallelization Approach for Scalable Complex Event Processing"}, {"paperId": "ac8b3339c8eb7740962c8fcdc88cec0a418ffc2a", "title": "Gloria: Graph-based Sharing Optimizer for Event Trend Aggregation"}, {"paperId": "ccdbdd2d53de824a315494289202242872fd59c9", "title": "CORE: a COmplex event Recognition Engine"}, {"paperId": "d34393943460ec2ae2fe04a9c1f670fc6b7c6e57", "title": "DARLING: Data-Aware Load Shedding in Complex Event Processing Systems"}, {"paperId": "622994cf18df953a3731596eabd0acfea1be40da", "title": "Efficient Complete Event Trend Detection over High-Velocity Streams"}, {"paperId": "7285b35fad3eda80c1a77bbad8af87d6aab789f8", "title": "Network-wide complex event processing over geographically distributed data sources"}, {"paperId": "895ef3dc5396799420765e6ba5e7a66305f94be8", "title": "Efficient Row Pattern Matching Using Pattern Hierarchies for Sequence OLAP"}, {"paperId": "2c24e273671849754a166b7f2fcf6204e31bed74", "title": "Efficient Join Processing Over Incomplete Data Streams"}, {"paperId": "3794875ae6504807de1e20eacebc06a517550776", "title": "Real-Time Multi-Pattern Detection over Event Streams"}, {"paperId": "e97ab7b6b4e68d3ad794595a88bc8761fb28d694", "title": "Event Trend Aggregation Under Rich Event Matching Semantics"}, {"paperId": "274afbef7369c7a4d91fbfa17be56bbc15cb25ac", "title": "A Comprehensive Survey on Parallelization and Elasticity in Stream Processing"}, {"paperId": "fd9b50f389bfa668416d93bd59333a28feebb711", "title": "A query language for semantic complex event processing: Syntax, semantics and implementation"}, {"paperId": "5e06b3a37c36a6adcaa2c881ab45e72dc749f8d6", "title": "Ares: A High Performance and Fault-Tolerant Distributed Stream Processing System"}, {"paperId": "ba4402c073463d54c8660ebb3414bd1e40262833", "title": "Complex Event Processing under Constrained Resources by State-Based Load Shedding"}, {"paperId": "08e39ddccf2a1a42fa3f896ff3ea7c203a53c062", "title": "All that Incremental is not Efficient: Towards Recomputation Based Complex Event Processing for Expensive Queries"}, {"paperId": "d3b4ec9eb7c100b11900d995b5a597bba4257830", "title": "Join Query Optimization Techniques for Complex Event Processing Applications"}, {"paperId": "18f97e0f25ff60651992c30eed70d3b0b6e24e68", "title": "GRETA: Graph-based Real-time Event Trend Aggregation"}, {"paperId": "eca0c7929893ca03e7f6af9b10621b2c73ac42c3", "title": "Object Tracking from Laser Scanned Dataset"}, {"paperId": "23a1d177381072a96b902a688f6ce3fd638067c3", "title": "A Comprehensive Survey on Parallelization and Elasticity in Stream Processing 1 : 3 apply methods from control theory to adapt the parallelization degree of the operators"}]}
