{"paperId": "7faf6975ff0fec56439860520aba1002958100c7", "publicationVenue": null, "title": "Weighted Laplacian Method and Its Theoretical Applications", "abstract": "Recently, a class of multilevel graph clustering (graph partitioning) algorithms have been extensively studied due to their practical utility. Although these newly proposed algorithms work well, there is still not many theoretical guarantees for the quality of partition in these existing methods due to their intrinsic heuristic properties to a great extent. In this paper, we propose a novel weighted Laplacian method for the multilevel graph clustering problem with more powerful theoretical background to further improve clustering performance mainly in terms of accuracy. Since our algorithm inherits the virtues of spectral methods, it possesses a friendly optimization property since it can produce the global optimal solution of a relaxation to the weighted cut on the coarsened graph in the middle stage. Meanwhile, the multilevel strategy can make it possible for our method to produce final clustering results with reasonable time range. Additionally, the weighted graph Laplacian is also suitable for doubly-weighted graph, which will endow our algorithm with a potential wide range of applications. The experimental results verify that our weighted Laplacian methods is indeed superior over existing algorithms in terms of clustering accuracy while also maintains comparable clustering speed.", "venue": "IOP Conference Series: Materials Science and Engineering", "year": 2019, "fieldsOfStudy": ["Physics", "Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2019-11-23", "journal": {"name": "IOP Conference Series: Materials Science and Engineering", "volume": "768"}, "authors": [{"authorId": "2110942621", "name": "Shijie Xu"}, {"authorId": "2115378747", "name": "Jiayan Fang"}, {"authorId": "46218395", "name": "Xiangyang Li"}], "citations": [{"paperId": "bb6cb93a147ef5a20e9ee621e9ddab7f5721a079", "title": "Efficient and Effective Algorithms for Generalized Densest Subgraph Discovery"}, {"paperId": "1d2422701e3dc4ce1b14e9a4b8e5fe34446b2712", "title": "Genomics data analysis via spectral shape and topology"}, {"paperId": "36d10eb5dfb55c501761dfaa5eab47d05d9e713a", "title": "Clustering Vertex-Weighted Graphs by Spectral Methods"}, {"paperId": "1d8de84578b3a0c3a9d8fe167c421e322c54689c", "title": "Deletion-contraction for a unified Laplacian and applications"}, {"paperId": "fb9b6ec1314d8299379112e3af63e5a08ea39bb8", "title": "Multi-label classification with local pairwise and high-order label correlations using graph partitioning"}, {"paperId": "bb4f7907b97e64cb73d9c1515ef111ca60351f56", "title": "Distributed clustering algorithm for adaptive pandemic control"}]}
