{"paperId": "7fbb73f3e61ed9ab1f18d0290082729a46ca36cd", "publicationVenue": {"id": "1124d164-490d-4da9-b0c2-ce8a8dc98202", "name": "BigData Congress [Services Society]", "type": "conference", "alternate_names": ["BigData", "Bigdata Congr [services Soc", "IEEE Int Conf Big Data", "IEEE International Conference on Big Data", "Int Congr Big Data", "International Congress on Big Data", "Bigdata Congr", "BigData Congress"]}, "title": "Towards a Peer-to-Peer Data Distribution Layer for Efficient and Collaborative Resource Optimization of Distributed Dataflow Applications", "abstract": "Performance modeling can help to improve the resource efficiency of clusters and distributed dataflow applications, yet the available modeling data is often limited. Collaborative approaches to performance modeling, characterized by the sharing of performance data or models, have been shown to improve resource efficiency, but there has been little focus on actual data sharing strategies and implementation in production environments. This missing building block holds back the realization of proposed collaborative solutions.In this paper, we envision, design, and evaluate a peer-to-peer performance data sharing approach for collaborative performance modeling of distributed dataflow applications. Our proposed data distribution layer enables access to performance data in a decentralized manner, thereby facilitating collaborative modeling approaches and allowing for improved prediction capabilities and hence increased resource efficiency. In our evaluation, we assess our approach with regard to deployment, data replication, and data validation, through experiments with a prototype implementation and simulation, demonstrating feasibility and allowing discussion of potential limitations and next steps.", "venue": "BigData Congress [Services Society]", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-11-24", "journal": {"name": "2023 IEEE International Conference on Big Data (BigData)", "pages": "2339-2345"}, "authors": [{"authorId": "2051551482", "name": "Dominik Scheinert"}, {"authorId": "2268310503", "name": "Soeren Becker"}, {"authorId": "153294591", "name": "Jonathan Will"}, {"authorId": "2268308087", "name": "Luis Englaender"}, {"authorId": "2294791", "name": "L. Thamsen"}], "citations": []}
