{"paperId": "7fe9289bc05013ad600c5575512b90be835514f3", "publicationVenue": {"id": "1124d164-490d-4da9-b0c2-ce8a8dc98202", "name": "BigData Congress [Services Society]", "type": "conference", "alternate_names": ["BigData", "Bigdata Congr [services Soc", "IEEE Int Conf Big Data", "IEEE International Conference on Big Data", "Int Congr Big Data", "International Congress on Big Data", "Bigdata Congr", "BigData Congress"]}, "title": "Towards a Better Replica Management for Hadoop Distributed File System", "abstract": "The Hadoop Distributed File System (HDFS) is the storage of choice when it comes to large-scale distributed systems. In addition to being efficient and scalable, HDFS provides high throughput and reliability through the replication of data. Recent work exploits this replication feature by dynamically varying the replication factor of in-demand data as a means of increasing data locality and achieving a performance improvement. However, to the best of our knowledge, no study has been performed on the consequences of varying the replication factor. In particular, our work is the first to show that although HDFS deals well with increasing the replication factor, it experiences problems with decreasing it. This leads to unbalanced data, hot spots, and performance degradation. In order to address this problem, we propose a new workload-aware balanced replica deletion algorithm. We also show that our algorithm successfully maintains the data balance and achieves up to 48% improvement in execution time when compared to HDFS, while only creating an overhead of 1.69% on average.", "venue": "BigData Congress [Services Society]", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-07-01", "journal": {"name": "2018 IEEE International Congress on Big Data (BigData Congress)", "pages": "104-111"}, "authors": [{"authorId": "40930805", "name": "Hilmi Egemen Ciritoglu"}, {"authorId": "2588256", "name": "Takfarinas Saber"}, {"authorId": "2658305", "name": "Teodora Sandra Buda"}, {"authorId": "152381427", "name": "John Murphy"}, {"authorId": "27629294", "name": "Christina Thorpe"}], "citations": [{"paperId": "20d23315a20c2290388ef26cab2cfc5c3b6bf937", "title": "Investigating Multi-Feature Selection and Ensembling for Audio Classification"}, {"paperId": "e02ff58265bd297d679011d7acfb7f282988c6aa", "title": "A classification framework for straggler mitigation and management in a heterogeneous Hadoop cluster: A state-of-art survey"}, {"paperId": "705bd29e54fd2f73b083622370b66791676de059", "title": "Crucial File Selection Strategy (CFSS) for Enhanced Download Response Time in Cloud Replication Environments"}, {"paperId": "c35d5c2a4bdb81725f23dd7ad151bb5bff79c6ad", "title": "Optimization on Replication Performance via Balance Quorum (BQ) and Data Center Selection Method (DCSM) Algorithms in Cloud Environment"}, {"paperId": "621753289db04dc9f4cd459bc976ecc733a48aa9", "title": "Intelligent Replication Management for HDFS Using Reinforcement Learning"}, {"paperId": "9167e0d156fbc0dd7a30f66ff3bfe65ec53f0047", "title": "Evolving Better Rerouting Surrogate Travel Costs with Grammar-Guided Genetic Programming"}, {"paperId": "73e2125d2ad73225cffabd85cbb03cb0db860ea2", "title": "Importance of Data Distribution on Hive-Based Systems for Query Performance: An Experimental Study"}, {"paperId": "03a404f9a75f309901f57adf915b37939219993e", "title": "Storage and Rack Sensitive Replica Placement Algorithm for Distributed Platform with Data as Files"}, {"paperId": "cda6d1e6ce005dc1290dd68155e92b87f90d9770", "title": "HaRD: a heterogeneity-aware replica deletion for HDFS"}, {"paperId": "568609f6998952cca472a2eaef060c5f946d8676", "title": "A multi-level grammar approach to grammar-guided genetic programming: the case of scheduling in heterogeneous networks"}, {"paperId": "3698645c3f071582c771aa5383fcdc0e5c842b59", "title": "Vigorous Replication Strategy With Balanced Quorum for Minimizing the Storage Consumption and Response Time in Cloud Environments"}, {"paperId": "de838facac546dd4f69e1d1755aefce6357aea14", "title": "Spying on Instant Messaging Servers: Potential Privacy Leaks through Metadata"}, {"paperId": "ca4255287971119a273edb2c1cf8cd8556bf86bd", "title": "Data and container placement in scalable data analytics platforms"}]}
