{"paperId": "7fff5c07e630c756f11517f81662cd272b6048f1", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Position Paper on Dataset Engineering to Accelerate Science", "abstract": "Data is a critical element in any discovery process. In the last decades, we observed exponential growth in the volume of available data and the technology to manipulate it. However, data is only practical when one can structure it for a well-defined task. For instance, we need a corpus of text broken into sentences to train a natural language machine-learning model. In this work, we will use the token \\textit{dataset} to designate a structured set of data built to perform a well-defined task. Moreover, the dataset will be used in most cases as a blueprint of an entity that at any moment can be stored as a table. Specifically, in science, each area has unique forms to organize, gather and handle its datasets. We believe that datasets must be a first-class entity in any knowledge-intensive process, and all workflows should have exceptional attention to datasets' lifecycle, from their gathering to uses and evolution. We advocate that science and engineering discovery processes are extreme instances of the need for such organization on datasets, claiming for new approaches and tooling. Furthermore, these requirements are more evident when the discovery workflow uses artificial intelligence methods to empower the subject-matter expert. In this work, we discuss an approach to bringing datasets as a critical entity in the discovery process in science. We illustrate some concepts using material discovery as a use case. We chose this domain because it leverages many significant problems that can be generalized to other science fields.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-03-09", "journal": {"name": "ArXiv", "volume": "abs/2303.05545"}, "authors": [{"authorId": "2178217", "name": "E. V. Brazil"}, {"authorId": "1380985003", "name": "E. Soares"}, {"authorId": "1972836", "name": "L. V. Real"}, {"authorId": "2211330126", "name": "L. Azevedo"}, {"authorId": "33713332", "name": "V. Segura"}, {"authorId": "2211337235", "name": "Luiz Zerkowski"}, {"authorId": "2321887", "name": "Renato F. G. Cerqueira"}], "citations": []}
