{"paperId": "80028fc5c4c750d6c7c841e81d00d9462bc71255", "publicationVenue": null, "title": "A graph neural network-enhanced knowledge graph framework for intelligent analysis of policing cases.", "abstract": "In this paper, we model a knowledge graph based on graph neural networks, conduct an in-depth study on building knowledge graph embeddings for policing cases, and design a graph neural network-enhanced knowledge graph framework. In detail, we use the label propagation algorithm (LPA) to assist the convolutional graph network (GCN) in training the edge weights of the knowledge graph to construct a policing case prediction method. This improves the traditional convolutional neural network from a single-channel network to a multichannel network to accommodate the multiple feature factors of policing cases. In addition, this expands the perceptual field of the convolutional neural network to improve prediction accuracy. The experimental results show that the multichannel convolutional neural network's prediction accuracy can reach 87.7%. To ensure the efficiency of the security case analysis network, an efficient pairwise feature extraction base module is added to enhance the backbone network, which reduces the number of parameters of the whole network and decreases the complexity of operations. We experimentally demonstrate that this method achieves a better balance of efficiency and performance by obtaining approximate results with 53.5% fewer floating-point operations and 70.2% fewer number parameters than its contemporary work.", "venue": "Mathematical biosciences and engineering : MBE", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-05", "journal": {"name": "Mathematical biosciences and engineering : MBE", "pages": "\n          11585-11604\n        ", "volume": "20 7"}, "authors": [{"authorId": "144988347", "name": "Hong-Miao Zhu"}], "citations": [{"paperId": "a30a66feb2718ba2b6df3addbf082518b9ee5ca6", "title": "Edge-Enabled Anomaly Detection and Information Completion for Social Network Knowledge Graphs"}, {"paperId": "b090f2ea7d3b22a1468bd88c2657503ff6c7a6a5", "title": "Web Crawlers for News Aggregation Systems based on Graph Convolutional Neural Networks"}]}
