{"paperId": "800908f83398a6bea5df126963354f21cb508870", "publicationVenue": {"id": "229ff272-1128-48a4-94eb-2ea4041eadff", "name": "International Conference on Cloud Computing and Services Science", "type": "conference", "alternate_names": ["CLOSER", "Int Conf Cloud Comput Serv Sci"], "url": "http://closer.scitevents.org/"}, "title": "Analysis and Rewrite of Quantum Workflows: Improving the Execution of Hybrid Quantum Algorithms", "abstract": ": With the rapid evolution of quantum computers and the emergence of different quantum cloud offerings, use cases from various application areas, such as chemistry or physics, can now be implemented and executed on real quantum computers. Thereby, the applications are typically hybrid, i.e., combine quantum and classical programs. Workflows enable the orchestration of these programs and provide advantages, such as robustness or reproducibility. However, different quantum algorithms require executing the quantum and classical programs in a loop with many iterations, leading to an inefficient orchestration through the workflow. For the efficient execution of such algorithms, hybrid runtimes are offered, combining the quantum and classical programs in a single hybrid program, optimizing the execution. However, this leads to a conceptional gap between the modeling benefits of workflow technologies, e.g., modularization, reuse, and understandability, and the efficiency improvements when using hybrid runtimes. To overcome this issue, we present a method to model all tasks explicitly in the workflow model and analyze the workflow to detect loops that can benefit from hybrid runtimes. Furthermore, corresponding hybrid programs are automatically generated, and the workflow is rewritten to use them. We validate the practical feasibility of our approach by a prototypical implementation.", "venue": "International Conference on Cloud Computing and Services Science", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"pages": "38-50"}, "authors": [{"authorId": "1474569575", "name": "Benjamin Weder"}, {"authorId": "2890261", "name": "Johanna Barzen"}, {"authorId": "2160322198", "name": "Martin Beisel"}, {"authorId": "1688415", "name": "F. Leymann"}], "citations": [{"paperId": "d5c33c5d0a54c430d4e4c4494aaf59a55969c4ab", "title": "Unraveling quantum computing system architectures: An extensive survey of cutting-edge paradigms"}, {"paperId": "0a605274472d93670458375401983714f27db056", "title": "Provenance-Preserving Analysis and Rewrite of Quantum Workflows for Hybrid Quantum Algorithms"}, {"paperId": "54131c96160f9ebcc5b21582c147795454ec8511", "title": "Execution Patterns for Quantum Applications"}, {"paperId": "0768051d805657408c7bf1fbef78aeb1b2c5ff54", "title": "Conﬁgurable Readout Error Mitigation in Quantum Workﬂows"}]}
