{"paperId": "802d530cd334a3e49228af2d7a889aaaf163cd91", "publicationVenue": {"id": "1355ccee-1cfd-459c-8df4-bc82e5f741da", "name": "Journal of Learning Analytics", "type": "journal", "alternate_names": ["J Learn Anal", "J learn Anal", "Journal of learning Analytics"], "issn": "1929-7750", "url": "https://epress.lib.uts.edu.au/journals/index.php/JLA/index", "alternate_urls": ["https://learning-analytics.info/journals/index.php/JLA/index", "https://learning-analytics.info/journals/index.php/JLA/about"]}, "title": "Video Features, Engagement, and Patterns of Collective Attention Allocation: An Open Flow Network Perspective", "abstract": "Network analytics has the potential to examine new behaviour patterns that are often hidden by the complexity of online interactions. One of the varied network analytics approaches and methods, the model of collective attention, takes an ecological system perspective to exploring the dynamic process of participation patterns in online and flexible learning environments. This study selected “Fundamentals of C++ programming (Spring 2019)” on XuetangX as an example through which to observe the allocation patterns of attention within MOOC videos, as well as how video features and engagement correlate with the accumulation, circulation, and dissipation pattern of collective attention. The results showed that the types of instructions in videos predicted attention allocation patterns, but they did not predict the engagement of video watching. Instead, the length and whether the full screen was used in the videos had a strong impact on engagement. Learners were more likely to reach a high level of engagement in video watching when their attention had been circulated around the videos. The results imply that understanding the patterns and dynamics of attention flow and how learners engage with videos will allow us to design cost-effective learning resources to prevent learners from becoming overloaded.", "venue": "Journal of Learning Analytics", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-03-11", "journal": {"name": "J. Learn. Anal.", "pages": "32-52", "volume": "9"}, "authors": [{"authorId": "2108089756", "name": "Jingjing Zhang"}, {"authorId": "2158814730", "name": "Yicheng Huang"}, {"authorId": "2061765404", "name": "M. Gao"}], "citations": [{"paperId": "baa79f0261b6ec6296a7d1bca869b8fde4c0c74f", "title": "Factors affecting students’ concept retention in learning science online using instructional videos"}, {"paperId": "dbfd4d076a397f8247b9d732dbd99565f25745d2", "title": "Using Learning Analytics to Understand K–12 Learner Behavior in Online Video-Based Learning"}, {"paperId": "bb481f0e8c00d7e13d24344a7bbd8e88f6b35c7c", "title": "Individual learning paths mastering teachers’ professional vision"}, {"paperId": "ca67eeccd18230778668ff099c666de8e897a80f", "title": "Networks in Learning Analytics: Where Theory, Methodology, and Practice Intersect"}, {"paperId": "ba14b3db1ee64dd55787f99397288332191ae349", "title": "Investigating Cognitive Network Models of Learners' Knowledge Representations"}, {"paperId": "3bb9b8699014c0686995ca79a4bec4a0792f5de2", "title": "Participation and Interaction Patterns of MOOC Learners with Different Learning Achievements: A Collective Attention Network Perspective"}]}
