{"paperId": "803107082de529a87048b94a184acaee35b48b89", "publicationVenue": {"id": "cae6cb4c-8766-4468-93d6-02676ecbf415", "name": "Canadian Medical Education Journal", "type": "journal", "alternate_names": ["Can med educ j", "Can Med Educ J", "Canadian medical education journal"], "issn": "1923-1202", "url": "http://www.cmej.ca/", "alternate_urls": ["https://journalhosting.ucalgary.ca/index.php/cmej"]}, "title": "Inter-institutional data-driven education research: consensus values, principles, and recommendations to guide the ethical sharing of administrative education data in the Canadian medical education research context", "abstract": "Background Administrative data are generated when educating, licensing, and regulating future physicians but these data are rarely used beyond their pre-specified purposes. The capacity necessary for sensitive and responsive oversight that supports the sharing of administrative medical education data across institutions for research purposes needs to be developed. Method A pan-Canadian consensus-building project was undertaken to develop agreement on the goals, benefits, risks, values, and principles that should underpin inter-institutional data-driven medical education research in Canada. A survey of key literature, consultations with various stakeholders and five successive knowledge synthesis workshops informed this project. Propositions were developed, driving subsequent discussions until collective agreement was distilled. Results Consensus coalesced around six key principles: establishing clear purposes, rationale, and methodology for inter-institutional data-driven research a priori; informed consent from data generators in education systems is non-negotiable; multi-institutional data sharing requires special governance; data governance should be guided by data sovereignty; data use should be guided by an identified set of shared values; and best practices in research data-management should be applied. Conclusion We recommend establishing a representative governance body, engaging trusted data facility, and adherence to extant data management policies when sharing administrative medical education data for research purposes in Canada.", "venue": "Canadian Medical Education Journal", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-06-21", "journal": {"name": "Canadian Medical Education Journal", "pages": "113 - 120", "volume": "14"}, "authors": [{"authorId": "2154588359", "name": "L. Grierson"}, {"authorId": "1390172071", "name": "Alice Cavanagh"}, {"authorId": "31766030", "name": "Alaa Youssef"}, {"authorId": "1414033985", "name": "Rachelle C. W. Lee-Krueger"}, {"authorId": "2269028362", "name": "Kestrel McNeill"}, {"authorId": "2128110755", "name": "Brenton Button"}, {"authorId": "4848923", "name": "K. Kulasegaram"}], "citations": [{"paperId": "c4b838130d140e641115fe0c8f5105f08878c384", "title": "Data sharing and big data in health professions education: Ottawa consensus statement and recommendations for scholarship."}, {"paperId": "ca35586c9735f23a7bfe4c2b3bef60d8766ab6fe", "title": "See you at ICAM in Vancouver, April 2024!"}]}
