{"paperId": "805acd51d891521399571c5fc2a966b5d037316a", "publicationVenue": {"id": "44a8affe-ff49-4c97-915b-0e4378776101", "name": "International Journal of Emerging Technologies in Learning (iJET)", "type": "journal", "alternate_names": ["Int J Emerg Technol Learn (ijet", "International Journal of Emerging Technologies in Learning", "Int J Emerg Technol Learn", "International Journal of Emerging Technologies in Learning (ijet)"], "issn": "1863-0383", "url": "http://www.i-jet.org/", "alternate_urls": ["https://www.online-journals.org/index.php/i-jet/about", "https://www.online-journals.org/index.php/i-jet"]}, "title": "Use of Technological Equipment for E-learning in Peruvian University Students in Times of Covid-19", "abstract": "The advance of technology grew on a large scale due to the presence of Covid-19 together with education, this growth accompanied the teaching and learning process. The transfer from face-to-face to virtual suggested choosing a teaching process, having e-learning as the most friendly. The method applied to the research is descriptive, correlational, transversal and predictive. The sample was applied randomly and voluntarily to 3532 university students from all over Peru, the sample was collected through an online survey. The results show that there are still problems with the materials they share due to the lack of reading comprehension, but by making use of communication technology and the Internet, students are able to take advantage of it and improve their teaching and learning through self-learning.", "venue": "International Journal of Emerging Technologies in Learning (iJET)", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-10-25", "journal": {"name": "Int. J. Emerg. Technol. Learn.", "volume": "16"}, "authors": [{"authorId": "2135738639", "name": "Yersi-Luis Huamán-Romaní"}, {"authorId": "2135732604", "name": "José Luis Estrada-Pantía"}, {"authorId": "2135732688", "name": "Orlando Olivares-Rivera"}, {"authorId": "2135732692", "name": "Efraín Rodas-Guizado"}, {"authorId": "2135751975", "name": "Frida Esmeralda Fuentes-Bernedo"}], "citations": [{"paperId": "6dcc83b9792bbda622e73274969fe160f932a580", "title": "Self-regulated Learning in Students from Native Communities. Case: reading and reading comprehension"}, {"paperId": "a8bbd2d927e5e3639713964f621267d349510ca7", "title": "Development of a Framework to Assess Challenges to Virtual Education in an Emergency Remote Teaching Environment: A Developing Country Student Perspective—The Case of Peru"}, {"paperId": "86c4ce328d72edcca7acea3ad295cdc9e500f094", "title": "E-learning Acceptance Model in a Pandemic Period with an Expansion to the Quality of Work Life and Information Technology Self-Efficacy Aspects"}, {"paperId": "aecb40ed8c19d90e1d51c795fb7aa4f44312ff80", "title": "Analysis of the Academic Performance of Mechanical-Electrical Engineering Students during the COVID-19 Pandemic: A Case Study in a Private University in Peru"}, {"paperId": "2d70aefded315dbe06e63a4205710b49b8757080", "title": "E-learning in the Teaching-Learning of Distance Higher Education: A Review"}, {"paperId": "59c6e80b060f9d28b2a2f6630feb6a0caaa7616e", "title": "E-learning Acceptance Model in a Pandemic Period with an expansion to the Quality Work-Life and IT Self Efficacy Aspects"}]}
