{"paperId": "80670111d7f473d5ae9e5b300bc49850d3ac1fdb", "publicationVenue": {"id": "6ffd3030-fbaa-4915-9ec8-888f211c7b73", "name": "International Computer Science and Engineering Conference", "type": "conference", "alternate_names": ["ICSEC", "Int Comput Sci Eng Conf"]}, "title": "A Hybrid Book Recommendation System for University Library", "abstract": "Nowadays, Recommendation systems become an important role in daily life such as recommended goods, recommended musics, recommended books, or recommended movies. Furthermore, a university library initiated a book recommendation system for improving the efficiency of book searching. This paper presents a methodology for book recommendation in a university library using a hybrid recommendation technique by weighting a combination of 2 similarity scores from two recommendations system. Normally a hybrid recommendation system is built on a combination of content-based filtering and collaborative filtering, whereas this paper use technique for applied books from the Course Syllabus and combines it with a standard hybrid recommendation system. To solve the cold start problem and improve the accuracy of the book recommendation system in the university library. For the evaluation, RSME has been used to collaborate with K-Fold Cross Validation and Train Test Split technique. Eventually, the result of the evaluated book recommendation system shown RSME is 1.2061 for 5-Fold Cross Validation and 1.2247 for Train & Test Split", "venue": "International Computer Science and Engineering Conference", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-12-21", "journal": {"name": "2022 26th International Computer Science and Engineering Conference (ICSEC)", "pages": "291-295"}, "authors": [{"authorId": "2209510332", "name": "Pitiwat Arunruviwat"}, {"authorId": "2247306", "name": "V. Muangsin"}], "citations": [{"paperId": "060fefabe95c3cd2c5a93caea98f873fec49922a", "title": "An automatic college library book recommendation system using optimized Hidden Markov based weighted fuzzy ranking model"}, {"paperId": "ae79cce4e541beb1a3cc5c708681e3bcfc62ca5b", "title": "Segmentation Combination Method for Corrective Action Recommendation"}]}
