{"paperId": "8076b56a986c4f5893f9d0fddeed4f0d84507a16", "publicationVenue": {"id": "a70d4f6e-c912-4ffc-b15d-8313fbe2c464", "name": "International Conference on Advanced Communication Technologies and Networking", "type": "conference", "alternate_names": ["CommNet", "Int Conf Adv Commun Technol Netw"]}, "title": "Security of digital agriculture networks: A review and bibliometric analysis", "abstract": "The Internet of Things (IoT) applied to agriculture has great potential for improving agricultural production. It involves the use of connected objects such as sensors/actuators, Unmanned Aerial Vehicle (UAV), and robots to enhance productivity and yield while paying attention to the use of pesticides, water, agricultural inputs and Livestock monitoring. Like any computer network, IoT network presents also security problems inducing the false prediction and data analysis in case of network attack. The purpose of this paper consists in analyzing publications on the digital agriculture security study. A database was extracted from Web of Science (WoS) using a defined search string from 2012 to 2023 and processed using the Preferred Reporting Item for Systematic Reviews and Meta-Analysis (PRISMA) method was used to select the most relevant documents on the subject. These documents presented vulnerabilities or attacks on digital agriculture networks and proposed security solutions like cryptography. Search strategy retrieved 227 documents, written by 909 authors and published in 167 sources. The United States of America (USA), India and China were the most productive country with many international collaborations.", "venue": "International Conference on Advanced Communication Technologies and Networking", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference", "Review"], "publicationDate": "2023-12-11", "journal": {"name": "2023 6th International Conference on Advanced Communication Technologies and Networking (CommNet)", "pages": "1-9"}, "authors": [{"authorId": "2275994727", "name": "Soumaya Marfoun-Dini Ahmed"}, {"authorId": "1491177520", "name": "Anne-Carole Honfoga"}, {"authorId": "2101769318", "name": "Patrick Sotindjo"}], "citations": []}
