{"paperId": "8083e919f6ba7f4372015a4194ca436fc5f670c2", "publicationVenue": {"id": "70628d6a-97aa-4571-9701-bc0eb3989c32", "name": "IEEE Transactions on Geoscience and Remote Sensing", "type": "journal", "alternate_names": ["IEEE Trans Geosci Remote Sens"], "issn": "0196-2892", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=36", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=36"]}, "title": "Spatial–Spectral Similarity Based on Adaptive Region for Landslide Inventory Mapping With Remote-Sensed Images", "abstract": "Landslide is one of the most serious geological disasters around the world, and acquiring landslide inventory mapping (LIM) with remote-sensed images (RSIs) plays an important role in disaster relief. However, various external imaging conditions of bitemporal RSIs usually cause pseudo-changes and challenges for achieving satisfied LIMs. In this article, a pioneering change magnitude measured distance named Spectral–Spatial Similarity based on Adaptive Region (S3AR) is proposed for achieving LIMs with bitemporal RSIs. First, an adaptive region is proposed to utilize the spatial-contextual information around each pixel, because the shapes and size of a landslide site are usually irregular and unpredictable. Then, a shape description algorithm is proposed for constructing a shape description vector, which aims at measuring the spatial difference of adaptive regions. Finally, to improve the separability between the landslide area and the background, brightness is suggested to couple with the shape description vector of an adaptive region to generate spatial–spectral similarity to measure the change magnitude between pairwise adaptive regions from the bitemporal RSIs. When the entire bitemporal RSIs are scanned and calculated via these steps, a change magnitude image between bitemporal RSIs can be generated, and then binary LIMs are obtained by a binary threshold. Experiments based on comparing eight state-of-the-art approaches demonstrated the feasibility and superiorities of the proposed S3AR for achieving LIMs with bitemporal RSIs. For example, the improvements on the four datasets are 5.81%, 14.06%, 6.03%, and 20.51% in terms of total error.", "venue": "IEEE Transactions on Geoscience and Remote Sensing", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Transactions on Geoscience and Remote Sensing", "pages": "1-11", "volume": "62"}, "authors": [{"authorId": "2246637", "name": "Z. Lv"}, {"authorId": "2292899468", "name": "Tianyv Yang"}, {"authorId": "2055852254", "name": "Tao Lei"}, {"authorId": "2292930831", "name": "WenMing Zhou"}, {"authorId": "2279017209", "name": "Zhou Zhang"}, {"authorId": "2238330357", "name": "Zhenzhen You"}], "citations": []}
