{"paperId": "8088005ccd54e1954d62c34a9192bc9dc450c140", "publicationVenue": {"id": "c6840156-ee10-4d78-8832-7f8909811576", "name": "IEEE Transactions on Knowledge and Data Engineering", "type": "journal", "alternate_names": ["IEEE Trans Knowl Data Eng"], "issn": "1041-4347", "url": "https://www.computer.org/web/tkde", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=69"]}, "title": "ScaleG: A Distributed Disk-Based System for Vertex-Centric Graph Processing", "abstract": "Designing distributed graph systems has drawn a lot of research interests due to the strong expressiveness of the graph model and rapidly increasing graph volume. Most of them require the graph data and all intermediate messages to reside in main memory, which may sacrifice the scalability. Even though several disk-based systems have been studied to remedy such issue, several challenges still exist in achieving both high computational efficiency and low network communication under the limitation of memory usage. In this paper, we design a novel disk-based distributed graph system, called ScaleG. The system provides a series of user-friendly programming interfaces. Unlike previous systems, the programmer in ScaleG does not need to concern any logic regarding the communication between vertices like sending messages and combining messages. In addition, we propose several techniques to reduce both disk I/Os in each machine and message I/Os via the network. We manage all messages in memory and bound all messages by the number of vertices. We also carefully design the data structure to support partial computation and automatic vertex activation. We conduct extensive experiments on six big graphs to show the high efficiency of our system.", "venue": "IEEE Transactions on Knowledge and Data Engineering", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-07-30", "journal": {"name": "IEEE Transactions on Knowledge and Data Engineering", "pages": "2019-2033", "volume": "35"}, "authors": [{"authorId": "2108142732", "name": "Xubo Wang"}, {"authorId": "2054328740", "name": "Dong Wen"}, {"authorId": "145770133", "name": "Lu Qin"}, {"authorId": "38736958", "name": "Lijun Chang"}, {"authorId": "48379623", "name": "Y. Zhang"}, {"authorId": "19262604", "name": "W. Zhang"}], "citations": [{"paperId": "a4930d487446f8fe30bd5769426a282306ac165b", "title": "Play like a Vertex: A Stackelberg Game Approach for Streaming Graph Partitioning"}, {"paperId": "ebc06a22fa91e03648bc38e3a02cf444d8d3785e", "title": "CUTTANA: Scalable Graph Partitioning for Faster Distributed Graph Databases and Analytics"}, {"paperId": "a49da37fbcb39221ce8143d0d9d7ddad58013685", "title": "Efficient Distributed Core Graph Decomposition"}, {"paperId": "bfa8447d3a1ba385b9a7b40ad77adfeee161f716", "title": "Distributed Near-Maximum Independent Set Maintenance over Large-scale Dynamic Graphs"}, {"paperId": "9e981820d4dcf9bbfa2e10f52faa16db893bf7e3", "title": "Optimizing Graph Partition by Optimal Vertex-Cut: A Holistic Approach"}, {"paperId": "060a4a2af39726604e6e3f58c794752dc3a49222", "title": "Distributed Approaches to Butterfly Analysis on Large Dynamic Bipartite Graphs"}, {"paperId": "ddec050197205669a5b87752dc75e419cf01b81b", "title": "A method for accelerating relations search over big data scenario"}]}
