{"paperId": "8089d1e234983cf85cedd58992c7a9a484430e7e", "publicationVenue": null, "title": "HYPERSONIC: A Hybrid Parallelization Approach for Scalable Complex Event Processing", "abstract": "The ability to promptly and efficiently detect arbitrarily complex patterns in massive real-time data streams is a crucial requirement in many modern applications. The ever-growing scale of these applications and the sophistication of the patterns involved make it imperative to employ advanced solutions that can optimize pattern detection. One of the most prominent and well-established ways to achieve the above goal is to apply complex event processing (CEP) in a parallel manner, using a multi-core machine and/or a distributed environment. However, the inherent tightly coupled nature of CEP severely limits the scalability of the parallelization methods currently available. In this paper, we introduce a novel parallelization mechanism for efficient complex event processing over data streams. This mechanism is based on a hybrid two-tier model combining multiple layers of parallelism. By employing a fine-grained load balancing model, this multi-layered approach leads to a substantial increase in event detection throughput, while at the same time reducing the latency and the memory consumption. An extensive experimental evaluation on multiple real-life datasets shows that our approach consistently outperforms state-of-the-art CEP parallelization methods by a factor of two to three orders of magnitude.", "venue": "SIGMOD Conference", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2022-06-10", "journal": {"name": "Proceedings of the 2022 International Conference on Management of Data"}, "authors": [{"authorId": "2103073673", "name": "Maor Yankovitch"}, {"authorId": "1819420", "name": "I. Kolchinsky"}, {"authorId": "145475383", "name": "A. Schuster"}], "citations": [{"paperId": "60331a1766626fa0ba417f1e3b1ec4f20a1bc8f4", "title": "DLACEP: A Deep-Learning Based Framework for Approximate Complex Event Processing"}, {"paperId": "0958b2baadcb313cbe26db12b7c4c3e4ca366a26", "title": "Mining Logical Arithmetic Expressions From Proper Representations"}, {"paperId": "0801eb175a88b7faf5d736157a3f8b5e67e08613", "title": "Expert Systems With Applications"}]}
