{"paperId": "8093f2b74c5f9d705d88076d5d9675ecbed8ef50", "publicationVenue": {"id": "cb6bf908-73f5-4b2c-bb93-0412207b00e7", "name": "Oceans", "type": "conference", "alternate_names": ["OCEANS Conference", "OCEANS", "Europe Oceans", "OCEAN Conf", "Eur Ocean"], "issn": "0029-8174", "alternate_issns": ["0197-7385", "2673-1924"], "url": "http://ieeexplore.ieee.org/xpl/conhome.jsp?punumber=1000515", "alternate_urls": ["https://www.mdpi.com/journal/oceans"]}, "title": "MarineVRS: Marine Video Retrieval System with Explainability via Semantic Understanding", "abstract": "Building a video retrieval system that is robust and reliable, especially for the marine environment, is a challenging task due to several factors such as dealing with massive amounts of dense and repetitive data, occlusion, blurriness, low lighting conditions, and abstract queries. To address these challenges, we present MarineVRS, a novel and flexible video retrieval system designed explicitly for the marine domain. MarineVRS integrates state-of-the-art methods for visual and linguistic object representation to enable efficient and accurate search and analysis of vast volumes of underwater video data. In addition, unlike the conventional video retrieval system, which only permits users to index a collection of images or videos and search using a freeform natural language sentence, our retrieval system includes an additional Explainability module that outputs the segmentation masks of the objects that the input query referred to. This feature allows users to identify and isolate specific objects in the video footage, leading to more detailed analysis and understanding of their behavior and movements. Finally, with its adaptability, explainability, accuracy, and scalability, MarineVRS is a powerful tool for marine researchers and scientists to efficiently and accurately process vast amounts of data and gain deeper insights into the behavior and movements of marine species.", "venue": "Oceans", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-05", "journal": {"name": "OCEANS 2023 - Limerick", "pages": "1-8"}, "authors": [{"authorId": "2186056399", "name": "Tan-Sang Ha"}, {"authorId": "2047941615", "name": "Hai Nguyen-Truong"}, {"authorId": "122699959", "name": "Tuan-Anh Vu"}, {"authorId": "123914790", "name": "Sai-Kit Yeung"}], "citations": []}
