{"paperId": "80a6890c4b9d30e68f52980427b1fd61281e8cef", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "False Positive RFID Detection Using Classification Models", "abstract": "Radio frequency identification (RFID) is an automated identification technology that can be utilized to monitor product movements within a supply chain in real-time. However, one problem that occurs during RFID data capturing is false positives (i.e., tags that are accidentally detected by the reader but not of interest to the business process). This paper investigates using machine learning algorithms to filter false positives. Raw RFID data were collected based on various tagged product movements, and statistical features were extracted from the received signal strength derived from the raw RFID data. Abnormal RFID data or outliers may arise in real cases. Therefore, we utilized outlier detection models to remove outlier data. The experiment results showed that machine learning-based models successfully classified RFID readings with high accuracy, and integrating outlier detection with machine learning models improved classification accuracy. We demonstrated the proposed classification model could be applied to real-time monitoring, ensuring false positives were filtered and hence not stored in the database. The proposed model is expected to improve warehouse management systems by monitoring delivered products to other supply chain partners.", "venue": "Applied Sciences", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2019-03-19", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "3212733", "name": "Ganjar Alfian"}, {"authorId": "2913270", "name": "Muhammad Syafrudin"}, {"authorId": "100709173", "name": "Bohan Yoon"}, {"authorId": "3353468", "name": "J. Rhee"}], "citations": [{"paperId": "f89777ad79f1b7f2ac68db824f0e22a1b072eb6d", "title": "Displacement Estimation via 3D-Printed RFID Sensors for Structural Health Monitoring: Leveraging Machine Learning and Photoluminescence to Overcome Data Gaps"}, {"paperId": "ef0208a943e140fe3014b4225e18a4476f38bc4b", "title": "Leveraging Text Mining for Analyzing Students' Preferences in Computer Science and Language Courses"}, {"paperId": "4b734edeee713e8822abd7b1d8c7c9865123ff1e", "title": "Customer Shopping Behavior Analysis Using RFID and Machine Learning Models"}, {"paperId": "cdc41dd632108716a2a5f76b05070259de5eb8dd", "title": "A Near-Field Focused Array Antenna Empowered by Deep Learning for UHF-RFID Smart Gates"}, {"paperId": "41f8e84517f88354ba0c467d7f23dfd5268fb7ef", "title": "Systematic literature review of machine learning for manufacturing supply chain"}, {"paperId": "bbc17cd8fcc36bef9b867b8a53a3eed0910d2601", "title": "Heart Disease Prediction using Ensemble Learning"}, {"paperId": "5cfef043029b88df514df0258c776e44cf66f82e", "title": "RFID Inventory Management System Sampling Optimization Based on Zebra Android Framework"}, {"paperId": "4ea1e3f0f14e6b7872544c5e696d6c8bddb54249", "title": "Setting the stage to tag “n” track: a guideline for implementing, validating and reporting a radio frequency identification system for monitoring resource visit behavior in poultry"}, {"paperId": "ec957c9dcefe872b71fbaeb8fa769c8cae8def24", "title": "Applications of Industry 4.0 Technologies in Warehouse Management: A Systematic Literature Review"}, {"paperId": "de55942cbaaab1555728b16cbb3b656f5ed9437f", "title": "Utilizing Random Forest with iForest-Based Outlier Detection and SMOTE to Detect Movement and Direction of RFID Tags"}, {"paperId": "595fe1d4b48037b59834febe8178a124e3d01479", "title": "Location estimation and tracking scheme for passive RF tags with angled antennas"}, {"paperId": "fa62e0ac4fcca0bbcc0d0069b8d489a8d399198a", "title": "Precise Identifying Assets Inside a Metal Cabinet Using RFID and Machine Learning Method"}, {"paperId": "03ca97d74e13fa7240e250883294cc8dcd6b671c", "title": "A Personalized Blood Glucose Prediction Model Using Random Forest Regression"}, {"paperId": "0ab2255d2f23b177f9b25b41a76aca9d5c5c8cd6", "title": "State estimation scheme for multiple RF tags with an angled single antenna"}, {"paperId": "4ef6c5a9a41db28a62d4d05d2074f0dc0160e11b", "title": "Design of an efficient decision support system using evolutionary deep forward network model"}, {"paperId": "68caadc29302b585b7e52929c9e16f1773cd4b3e", "title": "An Action Classification Method for Forklift Monitoring in Industry 4.0 Scenarios"}, {"paperId": "5f4634aa233231551b832729ac753fdfd0dd8f11", "title": "Agri-Food 4.0 and Innovations: Revamping the Supply Chain Operations"}, {"paperId": "e896393ed8b7513957edff71c1a3c66a30be34d1", "title": "Accurate performance prediction of IoT communication systems for smart cities: An efficient deep learning based solution"}, {"paperId": "eaf2eeecc0ec11fc1626c0eda61b8e5e138cec17", "title": "Data analytics-enable production visibility for Cyber-Physical Production Systems"}, {"paperId": "f4266bf03f9470d58756ec11b5ebff80ece971bc", "title": "Blood glucose prediction model for type 1 diabetes based on artificial neural network with time-domain features"}, {"paperId": "943c44d56e64ac23803eac3d402a06d5aa1837c1", "title": "Fusion Learning on Multiple-Tag RFID Measurements for Respiratory Rate Monitoring"}, {"paperId": "e4777b4d8b06c84f11817d17a14648c35bda47be", "title": "Blood Glucose Prediction Model for Type 1 Diabetes based on Extreme Gradient Boosting"}, {"paperId": "c33c681b9545d97d01c44b1732b332442db6bdbb", "title": "In-store Customer Shopping Behavior Analysis by Utilizing RFID-enabled Shelf and Multilayer Perceptron Model"}, {"paperId": "81977ebd30b322eb808c6e2e11a3e610dab797c3", "title": "Improving efficiency of RFID-based traceability system for perishable food by utilizing IoT sensors and machine learning model"}, {"paperId": "4b58d3066632898d6aec2746de0e40056bff0bb2", "title": "Efficient, Effective and Well Justified Estimation of Active Nodes within a Cluster"}, {"paperId": "1da0cc890371a396651c0e17352da54a9b230ffc", "title": "An Optimization Framework for Codes Classification and Performance Evaluation of RISC Microprocessors"}, {"paperId": "02e31a4f9fbc4d7cec5d1c64517c67675e161b8a", "title": "Detecting Movement and Direction of Tags for RFID Gate"}, {"paperId": "3bb19d2bc8686804a4b076edd1ee253bbf029ecd", "title": "RFID Applications in Healthcare Systems From an Operational Perspective"}, {"paperId": "a48ddfdb6be58c7714ec6c2d39b884105ee5faae", "title": "Machine Learning in Warehouse Management: A Survey"}, {"paperId": "f857b9b8e339497fa0a5e578d27a7c901cf6b07f", "title": "Efficient Tag Grouping RFID Anti-Collision Algorithm for Internet of Things Applications Based on Improved K-Means Clustering"}, {"paperId": "ae7c16169be95bd6464c84c3a0a2d9711746d748", "title": "P RODUCTION E NGINEERING A RCHIVES"}, {"paperId": "a0a5924d66cc6f292475581eedf7e80263a05e98", "title": "Automatic Identification and Categorize Zone of RFID Reading in Warehouse Management System"}, {"paperId": "2bb8e00c49effac0f8905dd86c48b3821a316a14", "title": "The Identification of RFID Signal Using k-Means for Pallet-Level Tagging"}, {"paperId": "410fad193b2ddaba0579258eea87315c8f2d9538", "title": "Development of Disease Prediction Model Based on Ensemble Learning Approach for Diabetes and Hypertension"}]}
