{"paperId": "80a8009b3a967d079155f6de5878042d1b50ae16", "publicationVenue": {"id": "8546baab-d567-408d-9a65-0887d8197468", "name": "International Symposiu on Visual Information Communication and Interaction", "type": "conference", "alternate_names": ["VINCI", "Int Symp Vis Inf Commun Interact", "Visual Information Communication and Interaction", "Vis Inf Commun Interact"]}, "title": "2.5D dust & magnet visualization for large multivariate data", "abstract": "In this paper, we present a 2.5D visualization technique based on the dust & magnet metaphor, which generally allows for interactively exploring and analyzing large multivariate data sets. In addition to position and color, we introduce height as additional visual variable for particles to encode extra data attributes in the 2.5D visualization, thus increasing the potential for identifying correlations between attributes. Further, we have developed a real-time collision detection algorithm as part of the particle simulation that ensures overlap-free particle positioning, thereby enabling the continuous perception of patterns, clusters, and outliers. These extensions facilitate on-the-fly validation of hypotheses through the highly dynamic configuration of magnets and visual attribute encoding, which also allows for a better integration of the user's domain knowledge. We demonstrate the application of our visualization technique using various real-world data sets from different domains, e.g., finance and software analytics.", "venue": "International Symposiu on Visual Information Communication and Interaction", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2020-12-02", "journal": {"name": "Proceedings of the 13th International Symposium on Visual Information Communication and Interaction"}, "authors": [{"authorId": "2369688", "name": "Jan Ole Vollmer"}, {"authorId": "1774471", "name": "J. Döllner"}], "citations": [{"paperId": "15434948c1209fe3c15a435b83074ef0beeebd63", "title": "Hagrid: using Hilbert and Gosper curves to gridify scatterplots"}, {"paperId": "f0a94de0a35c573f4804e279783bcf10d13a9987", "title": "Visualization of Source Code Similarity Using 2.5D Semantic Software Maps"}]}
