{"paperId": "80b42a4d4d831a578a2b59aa2b4fbfab66de8f17", "publicationVenue": null, "title": "Towards Fighting Cybercrime: Malicious URL Attack Type Detection using Multiclass Classification", "abstract": "Malicious Uniform Resource Locators (URLs) re-main one of the most common threats to cybersecurity. They are commonly spread through phishing, malware and spam. One popular way to detect malicious URLs is through black-lists. Blacklists maintain records of previously known malicious URL reputations. These lists are however shortcoming when there is need to detect newly generated malicious URLs. For that reason, modern research has resorted to training machine learning algorithms to detect malicious URLs. In this paper, we contributed towards the detection of malicious URLs using URL based features in a multiclass classification setting. We focused on three popular URL attack types which are phishing, spam and malware. Our work can be used as a supplementary tool in new or existing anti-phishing, anti-spam and anti-malware detection platforms. We compared the performance of the following ensemble learners: Extreme Gradient Boosting (XGBoost), Adaptive Boosting (AdaBoost), Light Gradient Boosting (LightGBM) and Categorical Boosting (CatBoost). We evaluated the performance of some URL features that we referred to as our features. These included priority features like Kullback-Leibler Divergence (KL divergence), bag of words segmentation and other word-based features. Results showed that our features performed better when compared to experiments we conducted without our features. We trained these algorithms on 126 983 URLs from benchmark datasets and all four learners returned an overall accuracy above 0.95.", "venue": "2020 IEEE International Conference on Big Data (Big Data)", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-12-10", "journal": {"name": "2020 IEEE International Conference on Big Data (Big Data)", "pages": "1813-1822"}, "authors": [{"authorId": "1986524237", "name": "Tariro Manyumwa"}, {"authorId": "2059028415", "name": "Phillip Francis Chapita"}, {"authorId": "49499048", "name": "Hanlu Wu"}, {"authorId": "2081160", "name": "S. Ji"}], "citations": [{"paperId": "22eab96480509439cc074fb1e4031ef5fe36524e", "title": "An Approach for Ranking Cyber Crime using Fuzzy AHP and Fuzzy TOPSIS"}, {"paperId": "f90ce5d2424410a87760ac1ba83436a49fabd73e", "title": "Using Machine Learning to Detect and Classify URLs: A Phishing Detection Approach"}, {"paperId": "55a87d7fbc43d7ccc03268cd7e22befbbd655a98", "title": "Fraudulent URL and Credit Card Transaction Detection System Using Machine Learning"}, {"paperId": "0e6b57a845ef658466eee6d399437626e4733c54", "title": "How AI Can be Used for Governance of Messaging Services: A Study on Spam Classification Leveraging Multi-Channel Convolutional Neural Network"}, {"paperId": "27af40fa148f113f22fe9271ffadba6cf3fccef0", "title": "Multiclass malicious URL attack type detection via capsule-based neural network"}, {"paperId": "9a82d251ecf3afa137b5c8902f164fb2fc772b4b", "title": "A Detailed Study on Preventing the Malicious URLs from Cyber Attacks"}, {"paperId": "8460bda650fd55fdb21c279172e6e8d6a11f8087", "title": "Detection of Malware in the Network Using Machine Learning Techniques"}, {"paperId": "0ce51ad682ead66309aead2b7a2c9aa2e274d672", "title": "Malicious URL Detection Using Decision Tree-based Lexical Features Selection and Multilayer Perceptron Model"}, {"paperId": "05fc13b5173bb2a9ef097b1bac4fb841ed8368a6", "title": "Hybrid Ensemble Machine Learning Approach for URL Phishing Detection"}, {"paperId": "ab5309f49ddf26cc1d142343e4f13b8b13e3aa95", "title": "A Hybrid approach combining blocklists, machine learning and deep learning for detection of malicious URLs"}, {"paperId": "7c8625bcefc070fcf884fad71f058e5e0a7b155a", "title": "Crafting Text Adversarial Examples to Attack the Deep-Learning-based Malicious URL Detection"}, {"paperId": "aa0ed1d8a3d128b6159b543b57ed7cfec035f23d", "title": "Efficient Classification of Malicious URLs: M-BERT—A Modified BERT Variant for Enhanced Semantic Understanding"}, {"paperId": "ccf2ae666cf9084fce307debeba0d37afe42a5e0", "title": "Detecting Malicious URLs Using Machine Learning Techniques: Review and Research Directions"}, {"paperId": "cc75d45fde183d794fc6c5adbbb2b07b05b2f3c1", "title": "DEEP NEURAL SYSTEM FOR IDENTIFYING CYBERCRIME ACTIVITIES IN NETWORKS"}, {"paperId": "aad7cd8eb4900135fa2d8138056c791bd3424645", "title": "PERFORMANCE EVALUATION BY FEATURE REDUCTION USING DEEP LEARNING FOR IDENTIFYING MALICIOUS WEBSITES"}]}
