{"paperId": "80b60f5eca84573fdcd55b8c4c8fcb0c8db360a3", "publicationVenue": {"id": "349f119f-f4ee-48cf-aedb-89bcb56ab8e3", "name": "Physical Review Research", "type": "journal", "alternate_names": ["Phys Rev Res"], "issn": "2643-1564", "url": "https://journals.aps.org/prresearch"}, "title": "Spatial Applications of Topological Data Analysis: Cities, Snowflakes, Random Structures, and Spiders Spinning Under the Influence", "abstract": "Spatial networks are ubiquitous in social, geographical, physical, and biological applications. To understand the large-scale structure of networks, it is important to develop methods that allow one to directly probe the effects of space on structure and dynamics. Historically, algebraic topology has provided one framework for rigorously and quantitatively describing the global structure of a space, and recent advances in topological data analysis (TDA) have given scholars a new lens for analyzing network data. In this paper, we study a variety of spatial networks -- including both synthetic and natural ones -- using novel topological methods that we recently developed for analyzing spatial networks. We demonstrate that our methods are able to capture meaningful quantities, with specifics that depend on context, in spatial networks and thereby provide useful insights into the structure of those networks, including a novel approach for characterizing them based on their topological structures. We illustrate these ideas with examples of synthetic networks and dynamics on them, street networks in cities, snowflakes, and webs spun by spiders under the influence of various psychotropic substances.", "venue": "Physical Review Research", "year": 2020, "fieldsOfStudy": ["Computer Science", "Physics", "Mathematics"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-01-07", "journal": {"name": "ArXiv", "volume": "abs/2001.01872"}, "authors": [{"authorId": "2533113", "name": "Michelle Feng"}, {"authorId": "48722701", "name": "M. A. Porter"}], "citations": [{"paperId": "ed51dc33148ee34adb202a6e58a8b59c52bc1ff7", "title": "Topological data analysis of the synchronization of a network of Rössler chaotic electronic oscillators."}, {"paperId": "4a4c28c07659063e4a496acd92aba7994fde9938", "title": "Topological analysis of U.S. city demographics"}, {"paperId": "857a22d71a8e148140e8c495063f331c406cfdb3", "title": "Topological data analysis for geographical information science using persistent homology"}, {"paperId": "acbceae408b5db37b5cb3d3c22d28ee6962042b5", "title": "Hypergraphs for multiscale cycles in structured data"}, {"paperId": "d58c6a0483eff05a670bedc5d0d3386f3696e22c", "title": "Persistent Homology for Resource Coverage: A Case Study of Access to Polling Sites"}, {"paperId": "cfb75784e1dc87a2e3e568c1fdaee634094da44e", "title": "Multiscale topology characterizes dynamic tumor vascular networks"}, {"paperId": "837e2cc64f3b667d65057ce9cd7dc067ed59bfa9", "title": "Topological data analysis of truncated contagion maps"}, {"paperId": "19bd7db20806dc305ba78fbd86d3686e664ce506", "title": "Networks behind the morphology and structural design of living systems."}, {"paperId": "669ee209ccea54c1795cf5568e018b8e4f975585", "title": "The shape of cancer relapse: Topological data analysis predicts recurrence in paediatric acute lymphoblastic leukaemia"}, {"paperId": "0f137c8b04a951451e2ecbc046ff01c40e44a2fc", "title": "Topological Data Analysis in an Economic Context: Property Tax Maps"}, {"paperId": "7833a98ce975d0a809545277449d65605ce1af4d", "title": "Identifying important persons in the promotion of positive behaviour support (PBS) in disability services: A social network analysis"}, {"paperId": "c928b69319dc1559527c2bf86eca6ac23eca8ea4", "title": "A persistent homology model of street network connectivity"}, {"paperId": "b4395bfe36ff4b391e6ac5edf9ec695f3ceb944f", "title": "Analysis of Spatial and Spatiotemporal Anomalies Using Persistent Homology: Case Studies with COVID-19 Data"}, {"paperId": "159dbbc91e2bfbaee1b44aac360685b0a4c36c02", "title": "Topological Machine Learning Methods for Power System Responses to Contingencies"}, {"paperId": "0a2ef8f91e290436d2fa22c28d15e7b432dcfdc7", "title": "Topological Data Analysis of Spatial Systems"}, {"paperId": "34f843137e07a85909134fd0168025c1a3a6ec2c", "title": "Topological analysis of traffic pace via persistent homology"}, {"paperId": "156e87ce1a99116bfdce512d2ebdd54a1f4e9709", "title": "Capturing Dynamics of Time-Varying Data via Topology"}, {"paperId": "da9b3f35148dccfa631de2e22a3a7f5e74069734", "title": "Multiscale Topology Characterises Dynamic Tumour Vascular Networks"}, {"paperId": "9b547a4206888e67634a5b2a9bf462c92cfc3a3a", "title": "The right tools for the job: The case for spatial science tool‐building"}, {"paperId": "2cd8d164c0aaf66fb5130033c606da1745c4d4b7", "title": "The (homological) persistence of gerrymandering"}, {"paperId": "eb26d6a0aa3baaceac6b72c2662a86836a93e63b", "title": "Hypergraphs for predicting essential genes using multiprotein complex data"}, {"paperId": "02dcde9573c0694db9f709ac6647831bfe82dd2f", "title": "Topological data analysis of task-based fMRI data from experiments on schizophrenia"}, {"paperId": "886b6b20854c59d7ff4bae35a647c3f026c16b63", "title": "Analysis of Spatiotemporal Anomalies Using Persistent Homology: Case Studies with COVID-19 Data"}, {"paperId": "d5c4e60cb42f6eb1c45c76edb91687b4a1cbc9e7", "title": "THE (HOMOLOGICAL) PERSISTENCE OF GERRYMANDERING"}]}
