{"paperId": "80d0a26f0980efa273cd4974330621e6a6eba34f", "publicationVenue": {"id": "dec98343-9970-4b42-bbc4-55083f423307", "name": "International journal of advances in soft computing and its applications", "type": "journal", "alternate_names": ["Int j adv soft comput it appl"], "issn": "2074-8523", "url": "http://www.home.ijasca.com/about-ijasca/"}, "title": "IoT Forensic Frameworks (DFIF, IoTDOTS, FSAIoT): A Comprehensive Study", "abstract": "Abstract In the Internet of Things, millions of electronic items, including automobiles, smoke alarms, watches, eyeglasses, webcams, and other devices, are now connected to the Internet (IoT). Aside from the luxury and comfort that the individual obtains in the field of IoT, as well as its ability to communicate and obtain information easily and quickly, the other concerning aspect is the achievement of privacy and security in this connection, especially given the rapid increase in the number of existing and new IoT devices. Concerns, threats, and assaults related to IoT security have been regarded as a potential and problematic area of research. This necessitates the quick development or creation of suitable technologies with the nature of crimes in the IoT environment. On the other hand, criminal investigation specialists encounter difficulties and hurdles due to various locations, data types, instruments used, and device recognition. This paper provides an in-depth explanation of the criminal content of the Internet of Things. It compares its stages to the detailed stages of traditional digital forensics in terms of similarities and differences, the frameworks used in dealing with electronic crimes, and the techniques used in both types. This paper presents previous discussions of researchers in the field of digital forensics. For the IoT, which brings us to the most important parts of this paper, which is a comprehensive study of the IoT criminal frameworks that are used to protect communication in the field of IoT, such as Digital Forensic Investigation Framework (DFIF), Digital Forensic Framework for Smart Environments (IoTDOTS), Forensic State Acquisition from the Internet of Things (FSAIoT), and discusses the challenges in their general frameworks and provides solutions and strategies. Keywords: digital forensic, FSAIoT, IoT, IoT Challenges, IoT Forensic, IoT Framework, IOTDOTS.", "venue": "International journal of advances in soft computing and its applications", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-03-24", "journal": {"name": "ArXiv", "volume": "abs/2203.15705"}, "authors": [{"authorId": "145152610", "name": "M. A. Hassan"}, {"authorId": "2254218", "name": "G. Samara"}, {"authorId": "2160630620", "name": "Mohammad Abu Fadda"}], "citations": [{"paperId": "5364218e6f91400dd6a5fe1634c4b618ec9d94b4", "title": "Comparative study of IoT forensic frameworks"}, {"paperId": "1691384eb0b6de12d12ea0fcd6c4fdcd18ab2cec", "title": "Optimizing Road Safety through Intelligent Congestion Management"}, {"paperId": "80a0878cdeb00dbce3cec8f16d64598a04f006bb", "title": "Internet of Things and Digital Forensics: Recent Studies and Challenges"}, {"paperId": "b7b8ef8dddf33a170d8d130ed88755a8d4a64d21", "title": "Enhancing Network Forensic and Deep Learning Mechanism for Internet of Things Networks"}, {"paperId": "b94f7fc25d41c6c2a64d77a590eaa93ac1e99bf0", "title": "Explainable IoT Forensics: Investigation on Digital Evidence"}, {"paperId": "0f2401c1d1d7f223a7bb3e00bdd6478d79bf4271", "title": "Forensic Analysis of Blackhole Attack in Wireless Sensor Networks/Internet of Things"}, {"paperId": "83b223eded785344d98fd6e5f6f9494a8e3d5c1e", "title": "Integrated intelligent IOT forensic framework for data acquisition through open-source tools"}]}
