{"paperId": "80d8afd7166b5642a8a61e23e4ba2d92077d93a1", "publicationVenue": {"id": "99fb912c-384c-4d69-92e4-8be397aa3df2", "name": "International journal of mathematical, engineering and management sciences", "type": "journal", "alternate_names": ["Int j math eng manag sci"], "issn": "2455-7749", "url": "http://ijmems.in/"}, "title": "About Scaling of Controlling Information System of Industrial Complex by Streamlining of Big Data Arrays in Compliance with Hierarchy of the Present Lifeworlds", "abstract": "This article discusses the problem of scaling the control information system. Some new type of horizontal scaling of big data array is offered. It consists in structuring of this array in compliance with hierarchy of lifeworlds (Lebenswelt), which become distinguishable in the paradigm of large-scale system. Processes of the \"lower\" lifeworlds can be so slow that won't be caught by strategic analysis and design instruments of \"top\" lifeworlds. However, these processes can give some delayed cumulative effect called \"black swan effect\". The complex formation algorithms recreating the logic of the interconnection of industrial enterprise subsystems are presented. The bases of the choice of temporary horizon extension for large-scale system strategic planning are given.", "venue": "International journal of mathematical, engineering and management sciences", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2019-10-01", "journal": {"name": "International Journal of Mathematical, Engineering and Management Sciences"}, "authors": [{"authorId": "31379871", "name": "D. Reut"}, {"authorId": "120380005", "name": "S. Falko"}, {"authorId": "2101246764", "name": "E. Postnikova"}], "citations": [{"paperId": "e417a01978fdedff986cbe74290306008cfd0399", "title": "The Function-and-Value Component of Kinesthetic Controlling (in the Example of State-Owned Aircraft Construction Companies)"}, {"paperId": "ad6bc220f14873ac18616156fd3c769ca8e68f1b", "title": "Modeling of nonlinear socio-economic processes at critical information infrastructure enterprises"}, {"paperId": "0ab932a2a6cf3f99eb5f7d2062728d9de84a30e9", "title": "An approach to exploratory neural network analysis and visualization of economic data in the space industry"}, {"paperId": "25d03d577b356bbe229b2d8fc6555d8e81aff8c8", "title": "Specifics of applying agile methods in the space industry"}, {"paperId": "d322bce1573459be46c45e0693d340b9cbe7064c", "title": "Black swan: bibliometric analysis and development of research agenda"}, {"paperId": "000c68797c622c00b8f3b112cc01d45022b5e123", "title": "Improvement of the \"Research and Development\" and \"Development R&D\" Process Maps for Enterprises of the Nuclear Industry"}, {"paperId": "34fe2e5a1b25cf1955105e4baa07e89981ac1d21", "title": "The smart technologies application for the product life-cycle management in modern manufacturing systems"}, {"paperId": "8f34134a5ff0da0eb285fa3a63652172804e823d", "title": "Development the Risk Management System of Processes in the Enterprise"}, {"paperId": "666d1e039212e33b6ce97b038e49553b088cd098", "title": "The Perspective Flexible Manufacturing System for a Newly Forming Robotic Enterprises : Approach to Organization Subsystem Formation"}]}
