{"paperId": "80d91b17f3a9c828a217d7f7beaa47c4665535c9", "publicationVenue": {"id": "31e844d7-20ce-4ec1-9a5c-12fcb592af8a", "name": "Clinical Therapeutics", "type": "journal", "alternate_names": ["Clin Ther"], "issn": "0149-2918", "url": "https://www.clinicaltherapeutics.com/", "alternate_urls": ["http://www.sciencedirect.com/science/journal/01492918", "http://www.clinicaltherapeutics.com/", "http://www.elsevier.com/wps/find/journaldescription.cws_home/525050/description#description"]}, "title": "S802 Persistence Among Patients With Crohn’s Disease Previously Treated With an Anti-tumor Necrosis Factor Inhibitor and Switching or Cycling to Another Biologic Agent", "abstract": "PURPOSE\nNonresponse to an anti-tumor necrosis factor (TNF) agent in patients with Crohn disease (CD) is often managed by either a switch to a different class of biologic (ie, ustekinumab, vedolizumab) or by cycling to another anti-TNF agent (ie, adalimumab, infliximab, certolizumab pegol). Persistence after a switch to a different biologic class or after cycling within the anti-TNF class was assessed in patients with nonresponse to an anti-TNF agent.\n\n\nMETHODS\nAdults with CD who discontinued from an anti-TNF agent and either switched to a different class of biologic (ie, anti-interleukin/integrin; the switching cohort) or cycled within the anti-TNF class (the cycling cohort) between September 23, 2016, and August 1, 2019, were selected from a commercial database. The index date was defined as the date of the first claim of the subsequent-line biologic (index biologic) after an anti-TNF. The switching and cycling cohorts were balanced with regard to baseline characteristics, using inverse probability of treatment weights-average treatment effect (IPTW-ATE). Persistence with the index biologic was defined as consistent use with no gaps of >120 days (ustekinumab, vedolizumab, infliximab) or of >60 days (adalimumab, certolizumab pegol) in biologic supply. Composite end points were persistence while being corticosteroid-free (defined as no use of corticosteroids with ≥14 days of supply after day 90 post-index) and persistence while on monotherapy (no immunomodulators/nonindex biologics). Weighted Kaplan-Meier and Cox models were used to assess outcomes at 12 months post-index.\n\n\nFINDINGS\nThere were 444 patients in the weighted switching cohort (mean age, 40.4 years; 56.3% female) and 441 in the weighted cycling cohort (mean age, 39.5 years; 58.4% female). At 12 months post-index, the rate of persistence with the index biologic was 75.7% in the switching cohort compared to 67.5% in the cycling cohort (log-rank P = 0.023); the rate of persistence while on monotherapy was 58.2% compared to 44.2%, respectively (log-rank P < 0.001). The rate of persistence was 44% greater in the switching compared to that in the cycling cohort (hazard ratio [HR] = 1.44; 95% CI, 1.11-1.88; P = 0.007); the rate of persistence while on monotherapy was 56% greater in the switching cohort (HR = 1.56; 95% CI, 1.28-1.90; P < 0.001). The between-cohort difference in persistence while being corticosteroid-free was not statistically significant (HR = 1.08; 95% CI, 0.89-1.32; P = 0.426).\n\n\nIMPLICATIONS\nPatients with CD who switched to a different biologic class were more persistent than were patients who cycled to another anti-TNF agent. These findings may be useful for physicians when considering the treatment of patients who have experienced nonresponse or loss of response to the first-line anti-TNF agent.", "venue": "Clinical Therapeutics", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-10-01", "journal": {"name": "The American Journal of Gastroenterology", "pages": "e572 - e573", "volume": "117"}, "authors": [{"authorId": "17894718", "name": "M. Zhdanava"}, {"authorId": "2934706", "name": "A. Manceur"}, {"authorId": "1515757663", "name": "Z. Ding"}, {"authorId": "2170915172", "name": "C. Holiday"}, {"authorId": "153780545", "name": "R. Zhao"}, {"authorId": "8520054", "name": "B. Goodwin"}, {"authorId": "50167979", "name": "D. Pilon"}], "citations": []}
