{"paperId": "80dd9664026eaddbc7fe7e4468b1d554997ada21", "publicationVenue": {"id": "47f3ab87-b9a2-4519-a61f-2b025937c786", "name": "International Conference on Internet of Things, Big Data and Security", "type": "conference", "alternate_names": ["IoTBDS", "Int Conf Internet Thing Big Data Secur"], "url": "http://www.iotbds.org"}, "title": "Machine Learning based Malware Traffic Detection on IoT Devices using Summarized Packet Data", "abstract": "As the number of IoT (Internet of Things) devices increases, the countermeasures against cyberattacks caused by IoT devices become more important. Although mechanisms to prevent malware infection to IoT devices are important, such prevention becomes hard due to sophisticated infection steps and lack of computational resource for security software in IoT devices. Therefore, detecting malware infection of devices is also important to suppress malware spread. As the types of IoT devices and malwares are increasing, advanced anomaly detection technology like machine learning is required to find malware infected devices. Because IoT devices cannot analyze own behavior by using machine learning due to limited computing resources, such analysis should be executed at gateway devices to the Internet. This paper proposes an architecture for detecting malware traffic using summarized statistical data of packets instead of whole packet information. As this proposal only uses information of amount of traffic and destination addresses for each IoT device, it can reduce the storage space taken up by data and can analyze number of IoT devices with low computational resources. We performed the malware traffic detection on proposed architecture by using machine learning algorithms of Isolation Forest and K-means clustering, and show that high accuracy can be achieved with the summarized statistical data. In the evaluation, we collected the statistical data from 26 IoT devices (9 categories), and obtained the result that the data size required for analysis is reduced over 90% with keeping high accuracy.", "venue": "International Conference on Internet of Things, Big Data and Security", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"pages": "78-87"}, "authors": [{"authorId": "39465320", "name": "Masataka Nakahara"}, {"authorId": "1490916289", "name": "Norihiro Okui"}, {"authorId": "1965900227", "name": "Yasuaki Kobayashi"}, {"authorId": "35261945", "name": "Yutaka Miyake"}], "citations": [{"paperId": "31e1bd4210d31c451a21605e446f48330dc93a37", "title": "A Machine Learning-Based Framework for Detecting Malicious HTTPS Traffic"}, {"paperId": "a79065a97543e19328e9fcc9a33708d77948f60e", "title": "Machine learning for Internet of things anomaly detection under low-quality data"}, {"paperId": "2391ac25be2a77b9aea47e4a9311312a131e511b", "title": "Light-weight Unsupervised Anomaly Detection for Encrypted Malware Traffic"}, {"paperId": "fb794db47f25b080c2b0f2a62ebcc52b182ae851", "title": "Machine learning for encrypted malicious traffic detection: Approaches, datasets and comparative study"}, {"paperId": "da99de6fdd8125e560e4c6d19c0409cce331d14b", "title": "Malware Detection for IoT Devices using Automatically Generated White List and Isolation Forest"}]}
