{"paperId": "80dfd1ec408610090733a1290881d699e824961c", "publicationVenue": {"id": "1d72e5bc-120e-47cd-8320-4b474c2821da", "name": "IEEE Conference of Russian Young Researchers in Electrical and Electronic Engineering", "type": "conference", "alternate_names": ["EIConRus", "IEEE Conf Russ Young Res Electr Electron Eng"]}, "title": "Study of The Possibility of Applying Intellectual Methods in Creating Risk Analysis Decision Support System in The Socio-Economic Sphere", "abstract": "In the context of the socio-economic development of the world economy, as well as improvements in the field of automation of risk analysis and assessment processes intelligent methods are used more often. The article explores the possibility of creating a risk analysis decision support system using modern intelligent methods. Creating a decision support system in this area is a complex process, but it is also important and valuable in the context of the transition to a digital economy. The possibility of creating an algorithm for dynamic risk analysis under uncertainty taking into account the obtained unstructured information is described. The modern intelligent methods applied to the development of decision support system in the socioeconomic sphere are investigated. We propose using the methods of cognitive visualization in the transformation of the results of risk analysis into a graphical form, which simplifies the evaluation and analysis of the received information.", "venue": "IEEE Conference of Russian Young Researchers in Electrical and Electronic Engineering", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2019-01-01", "journal": {"name": "2019 IEEE Conference of Russian Young Researchers in Electrical and Electronic Engineering (EIConRus)", "pages": "1892-1896"}, "authors": [{"authorId": "3314593", "name": "M. Skvortsova"}, {"authorId": "35149867", "name": "V. Terekhov"}], "citations": [{"paperId": "c242154add447402663b55a1cf76a2e0765a2687", "title": "Systematic assessment of food security by recurrent addition of fuzzy cognitive maps"}, {"paperId": "e157a760653b20792c883812c3b0f0402ff808dd", "title": "Visualization of Integrated Indicators of Information Risk in Decision Support Systems"}, {"paperId": "7a2bb8f0d6945058e0fad8b9059533701f58c1b3", "title": "Environmental data flow processing information factory"}, {"paperId": "46c1ab1d2cbf2adc0c2068248aac0b85c3d2af10", "title": "COGNITIVE VISUALIZATION IN A HYBRID INTELLIGENT RISK CONTROLLING SYSTEM"}, {"paperId": "1608ad798c6687f3a95b2e7f42cc55f63ee432da", "title": "Metaanamorphosical Method as a Project-based Approach for the University Course on Decision Support Methods"}, {"paperId": "89f9d738e3cb9e48e24c20f77ff27b00544e2099", "title": "Recurrent method for constructing fuzzy cognitive maps for food security assessment"}]}
