{"paperId": "80e5c2a9b733b751fa28654777325137091187e8", "publicationVenue": {"id": "228761ec-c40a-479b-8309-9dcbe9851bcd", "name": "IEEE Internet of Things Journal", "type": "journal", "alternate_names": ["IEEE Internet Thing J"], "issn": "2327-4662", "url": "https://www.ieee.org/membership-catalog/productdetail/showProductDetailPage.html?product=PER288-ELE", "alternate_urls": ["https://ieeexplore.ieee.org/servlet/opac?punumber=6488907", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6488907", "http://ieee-iotj.org/#"]}, "title": "Transferability of Machine Learning Algorithm for IoT Device Profiling and Identification", "abstract": "The lack of appropriate cyber security measures deployed on Internet of Things (IoT) makes these devices prone to security issues. Consequently, the timely identification and detection of these compromised devices become crucial. Machine learning (ML) models which are used to monitor devices in a network have made tremendous strides. However, most of the research in profiling and identification uses the same data for training and testing. Hence, a slight change in the data renders most learning algorithms to work poorly. In this article, we study a transferability approach based on the concept of transductive transfer learning for IoT device profiling and identification. Notably, this type of transfer learning works by explicitly assigning labels to the test data in the target domain by using the test feature space in the target domain, with training data from the source domain. Specifically, we propose a three-component system comprising: 1) the device type identification; 2) the vulnerability assessment; and 3) the visualization module. The device type identification component uses the underlying concept of transductive transfer learning where the trained model is transferred to a remote lab for testing. A variety of ML models are evaluated with respect to accuracy, precision, recall, and F1-score in order to determine which are the most suitable for the proposed transferability profiling. Furthermore, the vulnerability of the predicted device type is also assessed by using three vulnerability databases: 1) Vulners; 2) National Vulnerability Database (NVD); and 3) IBM X-Force. Finally, the results from the vulnerability assessment are visualized and displayed on a dashboard.", "venue": "IEEE Internet of Things Journal", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-01-15", "journal": {"name": "IEEE Internet of Things Journal", "pages": "2322-2335", "volume": "11"}, "authors": [{"authorId": "2182494748", "name": "Priscilla Kyei Danso"}, {"authorId": "38268697", "name": "Sajjad Dadkhah"}, {"authorId": "2180307018", "name": "Euclides Carlos Pinto Neto"}, {"authorId": "2182460579", "name": "Alireza Zohourian"}, {"authorId": "2312641", "name": "Heather Molyneaux"}, {"authorId": "103073143", "name": "Rongxing Lu"}, {"authorId": "1698268", "name": "A. Ghorbani"}], "citations": [{"paperId": "55cb378f51fcb186f1a6d65bd2fb12c36fd41ed8", "title": "Deep Reinforcement Learning Aided Device Profiling for Anomaly Detection in IIoT Over Zero Trust Security Network"}]}
