{"paperId": "80e79f66a1cefec938fb91ea65ad4aac30e789b3", "publicationVenue": {"id": "18be6e14-0ac5-454e-b78d-100e2dddd04e", "name": "International Journal of Advanced Research in Science, Communication and Technology", "type": "journal", "alternate_names": ["Int J Adv Res Sci Commun Technol"], "issn": "2581-9429"}, "title": "A Survey for Women Safety Alert System with Location-Based Notification and Community Awareness", "abstract": "Individual’s safety and well-being in public settings, particularly for women, have emerged as major concerns in modern society. Enhancing public safety by analysing women’s screams and focusing on the detection of suspicious activities and timely intimating it to the nearby police station and preferred contacts. Proposing a comprehensive system that integrates advanced audio processing techniques, machine learning algorithms, real-time communication mechanisms, combination of geospatial technology, mobile applications and sensors connected to wearable devices provides security alerts. This comprehensive approach aims to create a safer environment and empower women to take control of their safety. It’s a wonder technology and community involvement for a greater impact. By using advanced audio processing and machine learning techniques, the system can identify specific patterns or characteristics in screams that may indicate a potential threat. This innovative approach aims to enhance public safety and provide early warning signs in emergency situations. It’s an interesting application of technology that could help improve response times and prevent incidents", "venue": "International Journal of Advanced Research in Science, Communication and Technology", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2024-02-05", "journal": {"name": "International Journal of Advanced Research in Science, Communication and Technology"}, "authors": [{"authorId": "2283009960", "name": "Prakruthi N S"}, {"authorId": "2283010839", "name": "Radhika P"}, {"authorId": "2283017929", "name": "Niriksha S"}, {"authorId": "2283003661", "name": "Manjunatha S"}], "citations": []}
