{"paperId": "80fac5f4fa6dfbe0539f877016ab19451c817fb8", "publicationVenue": {"id": "1cd505d9-195d-4f99-b91c-169e872644d4", "name": "Energies", "type": "journal", "issn": "1996-1073", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-155563", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-155563", "https://www.mdpi.com/journal/energies", "http://www.mdpi.com/journal/energies"]}, "title": "Application of Deep Learning for Quality of Service Enhancement in Internet of Things: A Review", "abstract": "The role of the Internet of Things (IoT) networks and systems in our daily life cannot be underestimated. IoT is among the fastest evolving innovative technologies that are digitizing and interconnecting many domains. Most life-critical and finance-critical systems are now IoT-based. It is, therefore, paramount that the Quality of Service (QoS) of IoTs is guaranteed. Traditionally, IoTs use heuristic, game theory approaches and optimization techniques for QoS guarantee. However, these methods and approaches have challenges whenever the number of users and devices increases or when multicellular situations are considered. Moreover, IoTs receive and generate huge amounts of data that cannot be effectively handled by the traditional methods for QoS assurance, especially in extracting useful features from this data. Deep Learning (DL) approaches have been suggested as a potential candidate in solving and handling the above-mentioned challenges in order to enhance and guarantee QoS in IoT. In this paper, we provide an extensive review of how DL techniques have been applied to enhance QoS in IoT. From the papers reviewed, we note that QoS in IoT-based systems is breached when the security and privacy of the systems are compromised or when the IoT resources are not properly managed. Therefore, this paper aims at finding out how Deep Learning has been applied to enhance QoS in IoT by preventing security and privacy breaches of the IoT-based systems and ensuring the proper and efficient allocation and management of IoT resources. We identify Deep Learning models and technologies described in state-of-the-art research and review papers and identify those that are most used in handling IoT QoS issues. We provide a detailed explanation of QoS in IoT and an overview of commonly used DL-based algorithms in enhancing QoS. Then, we provide a comprehensive discussion of how various DL techniques have been applied for enhancing QoS. We conclude the paper by highlighting the emerging areas of research around Deep Learning and its applicability in IoT QoS enhancement, future trends, and the associated challenges in the application of Deep Learning for QoS in IoT.", "venue": "Energies", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2021-10-06", "journal": {"name": "Energies"}, "authors": [{"authorId": "8771696", "name": "Nasser Kimbugwe"}, {"authorId": "3258090", "name": "Tingrui Pei"}, {"authorId": "8749100", "name": "Moses Ntanda Kyebambe"}], "citations": [{"paperId": "6fd47f43f5536e8cf9925d430b75ba6dc2d99b50", "title": "Predictive Analysis of Endoscope Demand in Otolaryngology Outpatient Settings"}, {"paperId": "fe9ead2706ff243bce55c582bdf5d11b50b722e8", "title": "Improve Quality of Service for the Internet of Things using Blockchain & Machine Learning Algorithms."}, {"paperId": "b2cab48bccba49e9460b5c00fb5bd72435ee2509", "title": "Deep Learning Driven QoS Anomaly Detection for Network Performance Optimization"}, {"paperId": "9d1dcff42f4aaa6ca497917672307a0919573cad", "title": "Enhancing quality of service in IoT through deep learning techniques"}, {"paperId": "1f9caf24830cd71efa67adbfa036ab8e21a42940", "title": "A Dynamic Step-wise Tiny Encryption Algorithm with Fruit Fly Optimization for Quality of Service improvement in healthcare"}, {"paperId": "a8866de629513da3c48c8ae4817ba3815e07bde1", "title": "MobileNetV3 based Classification Model for Diabetic Retinopathy"}, {"paperId": "d250fc08c51d651070cc92169daecb99b331bb70", "title": "Deep learning algorithms for IoT security(survey)"}]}
