{"paperId": "80fc8b763f44e75c177931fa425bc77c86cdc1af", "publicationVenue": null, "title": "Recognizing Long-term Sleep Behaviour Change using Clustering for Elderly in Smart Homes", "abstract": "The need for smart healthcare tools and techniques has increased due to the availability of low-cost IoT sensors and devices and the growing aging population in the world. Early detection of health conditions such as dementia and Parkinsons are important for treatment and medication. Out of the many symptoms of such health conditions, one critical behavior is sleep activity changes. In this paper, we evaluate and apply an unsupervised machine learning: K-Means, to detect changes in long-term sleep behavior in the bedroom using smart-home motion sensors installed in 6 real-life single resident elderly homes for approximately three years. Our method analyses the transformation of clusters for a participant over three years, 2019, 2020, and 2021. This is done using three features: duration of stay, the hour of the day, and duration frequency. Data clustering is used to group durations of being in the bedroom at different hours of the day. This is done to see if there is a shift in these clusters for elderly persons with healthy aging and those developing health conditions like dementia and Parkinsons. We foresee that such methods to detect long-term behavior changes can support caregivers in carrying out their assessment for discovering the early onset of health conditions, thereby preventing further progression and providing timely treatment.", "venue": "2022 IEEE International Smart Cities Conference (ISC2)", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-09-26", "journal": {"name": "2022 IEEE International Smart Cities Conference (ISC2)", "pages": "1-7"}, "authors": [{"authorId": "2162040706", "name": "Zahraa Khais Shahid"}, {"authorId": "8773876", "name": "S. Saguna"}, {"authorId": "2044546", "name": "C. Åhlund"}], "citations": [{"paperId": "b4946714561a595e9b59ebed530386cb00e86441", "title": "Recognizing Seasonal Sleep Patterns of Elderly in Smart Homes Using Clustering"}, {"paperId": "c73b457d623af018b696aee551cf1a79464acaef", "title": "Forecasting and Detecting Anomalies in ADLs in Single-Resident Elderly Smart Homes"}, {"paperId": "4666883f76b5a5cbeae739bcd1001567d40f9417", "title": "The Internet of Things in dementia: A systematic review"}, {"paperId": "221a941a7ea5372c28f83d0f8c8194a1179fd87f", "title": "Unsupervised Forecasting and Anomaly Detection of ADLs in single-resident elderly smart homes"}, {"paperId": "17e5570b669c42a6fd1bea188ab020561361fccd", "title": "Outlier Detection in IoT data for Elderly Care in Smart Homes"}]}
