{"paperId": "81025eed2924e0719321a3a69f8a2cf1f869e596", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "An IIoT machine model for achieving consistency in product quality in manufacturing plants", "abstract": "Consistency in product quality is of critical importance in manufacturing. However, achieving a target product quality typically involves balancing a large number of manufacturing attributes. Existing manufacturing practices for dealing with such complexity are driven largely based on human knowledge and experience. The prevalence of manual intervention makes it difficult to perfect manufacturing practices, underscoring the need for a data-driven solution. In this paper, we present an Industrial Internet of Things (IIoT) machine model which enables effective monitoring and control of plant machinery so as to achieve consistency in product quality. We present algorithms that can provide product quality prediction during production, and provide recommendations for machine control. Subsequently, we perform an experimental evaluation of the proposed solution using real data captured from a food processing plant. We show that the proposed algorithms can be used to predict product quality with a high degree of accuracy, thereby enabling effective production monitoring and control.", "venue": "arXiv.org", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-09-27", "journal": {"name": "ArXiv", "volume": "abs/2109.12964"}, "authors": [{"authorId": "51336994", "name": "Abhik Banerjee"}, {"authorId": "2831719", "name": "A. Forkan"}, {"authorId": "1782841", "name": "Dimitrios Georgakopoulos"}, {"authorId": "78354269", "name": "J. Milovac"}, {"authorId": "1777356", "name": "P. Jayaraman"}], "citations": [{"paperId": "0f9c4637fa5cfd2a0a0bb118147f0f3d34496d7f", "title": "IoT-QWatch: A Novel Framework to Support the Development of Quality-Aware Autonomic IoT Applications"}, {"paperId": "293dcc8bd70a1b2c2a6c2a15d6ae72e42edad65b", "title": "Digital Twins and Dependency/Constraint-Aware AI for Digital Manufacturing"}, {"paperId": "005bcf6fd759a149dddd2e501f3e20f77c74deea", "title": "SCADA Systems With Focus on Continuous Manufacturing and Steel Industry: A Survey on Architectures, Standards, Challenges and Industry 5.0"}]}
