{"paperId": "8105df2690704b656030d95605e39757afa00127", "publicationVenue": {"id": "011e0c39-7f47-401e-98d2-ee08fdf206a3", "name": "Library hi tech", "type": "journal", "alternate_names": ["Libr Hi Tech", "Library Hi Tech", "Libr hi tech"], "issn": "0737-8831", "url": "https://www.emerald.com/insight/publication/issn/0737-8831"}, "title": "Libraries in Internet of Things (IoT) era", "abstract": "\nPurpose\nInternet of Things (IoT) has been widely adopted in the commercial sector. Although IoT enables traditional libraries to convert into digital ones, the implementation of the IoT in libraries is slow. The purpose of this paper is to report on the current state of research on applications of IoT in libraries, describe challenges that IoT applications face in libraries and discus directions of adopting IoT in libraries in the future.\n\n\nDesign/methodology/approach\nTo conduct this research, the literature of IoT and its application in libraries were reviewed by examining existing literature in Institute of Electrical and Electronics Engineers (IEEE) Xplore.\n\n\nFindings\nThe literature review finds that radio-frequency identification has been adopted by digital libraries. The slow implementation of IoT is caused by security and privacy issues, lack of standards and the lack of financial, technological and organizational resources. This study provides a prospective for the application of IoT in libraries; the technologies of IoT have the potential in betterment of library services.\n\n\nResearch limitations/implications\nThe limitation of this study is that only IEEE Xplore is included. Other database should be explored in future research.\n\n\nOriginality/value\nThe application of IoT in libraries is an emerging issue; a systematic and extensive review of recent research on applications of IoT in libraries is unavailable. This paper presents an overview of IoT in libraries, findings and potential research opportunities.\n", "venue": "Library hi tech", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2018-09-18", "journal": {"name": "Libr. Hi Tech", "pages": "79-93", "volume": "38"}, "authors": [{"authorId": "2283874070", "name": "Xueling Liang"}, {"authorId": "2115840630", "name": "Yong Chen"}], "citations": [{"paperId": "edfb096c60e04775a5c57e1a84cdb338400b1002", "title": "Library practitioners’ perceptions on the applications of IoT in university libraries of Bangladesh"}, {"paperId": "bc2daa7f7beb61bc027ffe28c20e3dd4368351d9", "title": "Factors influencing the adoption of Internet of Things (IoT) in university libraries: a systematic literature review (SLR)"}, {"paperId": "a58d4c60914ad99046e15abdf27227159062260a", "title": "From traditional to emerging technologies in supporting smart libraries. A bibliometric and thematic approach from 2013 to 2022"}, {"paperId": "4d03616a2c21d32f7902476fdde9e148071e27e0", "title": "Development of smart academic library services with Internet of Things technology: a qualitative study in Hong Kong"}, {"paperId": "b21d440148ba56e3e7df1e24f43f66b1b1078160", "title": "Tendências de Serviços para Biblioteca e as competências do profissional Bibliotecário: um olhar para o futuro"}, {"paperId": "cd903147b38515d38458232c3547f0e808bc8ed2", "title": "A framework for the incorporation of digital scholarship contents in South African Library and Information Science Schools"}, {"paperId": "f30372e2d7ab2371914ffc43e55de1da7178df5d", "title": "Bibliometric analyses and network mapping on the smart library in Web of Science from 2003 to 2021"}, {"paperId": "3c1f21ef5a968c2e6d27b6b2615e6a9b3beb2743", "title": "Applications of metaverse-related technologies in the services of US urban libraries"}, {"paperId": "36850612ffc9ffc395e89dc8b39760b885bd55cf", "title": "Applications of Internet of Things in university libraries of Pakistan: An empirical investigation"}, {"paperId": "1bc4e17fef9860bbc7b4b902208c78a141b67407", "title": "A review of logistics Internet-of-Things: Current trends and scope for future research"}, {"paperId": "6bbf819c3a935b3f2ff57f9792cedea7b82ab658", "title": "Rethinking the roles and skills of information professionals in the 4th Industrial Revolution"}, {"paperId": "59f1ff08a078c1ab3fa127ba4e2c4eda0030e4f5", "title": "A blended learning model with IoT-based technology"}, {"paperId": "2558699ca6c136516be41434c1848bda4ffb21a3", "title": "Presenting a Conceptual Model for Using the Internet of Things in Modern Services of Digital Libraries"}, {"paperId": "c8f0a653e243a1fc87092d758712683d353f3174", "title": "The correlation analysis between the service quality of intelligent library and the behavioral intention of users"}, {"paperId": "4d622c460e5a3acb8bf4064a11528c2e130e9fc4", "title": "Turning a Traditional Library into a Smart Library"}, {"paperId": "d5a7934a04d7077c921e2bee49ea549834b9e3b5", "title": "Smart libraries: an emerging and innovative technological habitat of 21st century"}, {"paperId": "c2a20f614871b4c50024738648693b185694aeb8", "title": "SWOT Analysis of Internet of Things in the Library and Information Science Environment"}, {"paperId": "5777b4c9866e38fd584f87b4c768367a8b9c14a5", "title": "Exposé - Bibliotheken in der Transformation zu Smart Libraries"}, {"paperId": "5e255ece0d4f261f2a577af604357be5efc0522c", "title": "Use and management of information systems in academic libraries in Ghana"}]}
