{"paperId": "810c8f236a248c6eb9cd622f8e7ff38483e53a5c", "publicationVenue": {"id": "6401bb05-050b-4beb-8824-066cb2938eb4", "name": "Mathematical Problems in Engineering", "type": "journal", "alternate_names": ["Math Probl Eng"], "issn": "1024-123X", "url": "http://www.gbhap-us.com/journals/238/238-top.htm", "alternate_urls": ["https://www.hindawi.com/journals/mpe/"]}, "title": "Talking about the Innovative Application of Big Data in Enterprise Human Resources Performance Management", "abstract": "With the advent of the wave of big data, data has become an important information asset. With data information, we have the ability to gain insight into market conditions and strengthen management. The use of big data technology to conduct statistics, analysis, and mining of massive information can make information assets play a very high value in corporate strategy formulation and accurate decision-making. However, the traditional performance management concepts and management methods have not adapted to the development requirements of the times, and there are various drawbacks. This paper analyzes the impact of big data on enterprise performance management. Combining the key aspects of the company’s performance in the old data era, a new method of company performance management and the subsequent innovative development path are proposed. Recognition frameworks, employee similarity, FCM, and other assessment formulas are emphasized. From the employee’s work attitude, workability and appearance, and daily performance, combined with the calculation of employee benefits, the evaluation is more clear; after the implementation of the material reward experiment, the attendance rate increased by 16.3%. At the same time, the workload was gradually refined, from quantitative to qualitative, and sales increased by 28.6%, maximizing the advantages of human resources and promoting the sustainable development of the enterprise.", "venue": "Mathematical Problems in Engineering", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-05-30", "journal": {"name": "Mathematical Problems in Engineering"}, "authors": [{"authorId": "1453959303", "name": "Dazhi Xu"}, {"authorId": "2646538", "name": "Tianyi Tu"}, {"authorId": "2118723403", "name": "Xiaoyong Xiao"}], "citations": [{"paperId": "809fdcc7292aa9782d0de13642d23bf61f8de73a", "title": "Fusing talent horizons: the transformative role of data integration in modern talent management"}, {"paperId": "f659376e3ba860eb157a72d812ecc57b752b2c25", "title": "The Performance Evaluation Model of Hotel Green Human Resources Based on Internet of Things and Fuzzy Theory"}, {"paperId": "1a0ea9e9b85818ed6bcc474934963c68497ab260", "title": "Jurnal Riset Manajemen Sains Indonesia"}]}
