{"paperId": "810c5862d63f01bce7ae656a90caab53a43379e1", "publicationVenue": null, "title": "Uncertainty-aware transfer learning to evolve digital twins for industrial elevators", "abstract": "Digital twins are increasingly developed to support the development, operation, and maintenance of cyber-physical systems such as industrial elevators. However, industrial elevators continuously evolve due to changes in physical installations, introducing new software features, updating existing ones, and making changes due to regulations (e.g., enforcing restricted elevator capacity due to COVID-19), etc. Thus, digital twin functionalities (often built on neural network-based models) need to evolve themselves constantly to be synchronized with the industrial elevators. Such an evolution is preferred to be automated, as manual evolution is time-consuming and error-prone. Moreover, collecting sufficient data to re-train neural network models of digital twins could be expensive or even infeasible. To this end, we propose unceRtaInty-aware tranSfer lEarning enriched Digital Twins LATTICE, a transfer learning based approach capable of transferring knowledge about the waiting time prediction capability of a digital twin of an industrial elevator across different scenarios. LATTICE also leverages uncertainty quantification to further improve its effectiveness. To evaluate LATTICE, we conducted experiments with 10 versions of an elevator dispatching software from Orona, Spain, which are deployed in a Software in the Loop (SiL) environment. Experiment results show that LATTICE, on average, improves the Mean Squared Error by 13.131% and the utilization of uncertainty quantification further improves it by 2.71%.", "venue": "ESEC/SIGSOFT FSE", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2022-11-07", "journal": {"name": "Proceedings of the 30th ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software Engineering"}, "authors": [{"authorId": "2118221146", "name": "Qinghua Xu"}, {"authorId": "47495965", "name": "Sajid Ali"}, {"authorId": "145456500", "name": "T. Yue"}, {"authorId": "114947151", "name": "Maite Arratibel"}], "citations": [{"paperId": "dcd1b4a3acf5dbb04329ea1fb40d8c3a8a6aace9", "title": "Application of Quantum Extreme Learning Machines for QoS Prediction of Elevators' Software in an Industrial Context"}, {"paperId": "5998e7367d12538602d8d536f19100a0d201ab5e", "title": "Quantifying and combining uncertainty for improving the behavior of Digital Twin Systems"}, {"paperId": "bf847822a3f8c21228c8a43026736bd0c5f93049", "title": "Pretrain, Prompt, and Transfer: Evolving Digital Twins for Time-to-Event Analysis in Cyber-physical Systems"}, {"paperId": "eb6f92b6a6739a2563591e47c98d67b7298d4c04", "title": "Evolve the Model Universe of a System Universe"}, {"paperId": "bb7374cff7ff646e6db0c9f4e69368677dbe948e", "title": "KDDT: Knowledge Distillation-Empowered Digital Twin for Anomaly Detection"}, {"paperId": "60f68117c4e847bed7c5f2cc05977f27b406d7a2", "title": "EvoCLINICAL: Evolving Cyber-Cyber Digital Twin with Active Transfer Learning for Automated Cancer Registry System"}, {"paperId": "a83c36265a1ac01520c7b07c4ead83b4a18d0937", "title": "Test Case Generation for Drivability Requirements of an Automotive Cruise Controller: An Experience with an Industrial Simulator"}, {"paperId": "d2bcf346f4998cfc233f49dbb6a73b390600ee21", "title": "Challenges of Testing an Evolving Cancer Registration Support System in Practice"}, {"paperId": "b00b507037355823cacd33fbc557d56ed93c12ab", "title": "Digital Twin-based Anomaly Detection with Curriculum Learning in Cyber-physical Systems"}, {"paperId": "3ff525b9bcd342c96444c8613488336770329b6d", "title": "Uncertainty-Aware Robustness Assessment of Industrial Elevator Systems"}, {"paperId": "b919d6d3caae1037a74cea4f287c71aedbea3c60", "title": "Are elevator software robust against uncertainties? results and experiences from an industrial case study"}, {"paperId": "9cdc452d3f232f16c3f67b878c78314f061157f7", "title": "Development and state-of-the art in green elevators technologies: A survey"}]}
