{"paperId": "81254b668d111d825441cc4c077c23525852efc1", "publicationVenue": {"id": "ef00f0de-a7e5-443a-9a2d-c78502a4b598", "name": "Conference on Computer Science and Information Systems", "type": "conference", "alternate_names": ["Fed Conf Comput Sci Inf Syst", "Conf Comput Sci Inf Syst", "FedCSIS", "Federated Conference on Computer Science and Information Systems"], "url": "https://fedcsis.org/"}, "title": "KnowledgePit Meets BrightBox: A Step Toward Insightful Investigation of the Results of Data Science Competitions", "abstract": "We discuss the benefits of integrating the KnowledgePit data science competition platform with the BrightBox technology aimed at diagnostics of machine learning models embedded within complex software systems. We briefly recall the history of international challenges held at KnowledgePit and we also discuss in what sense such technologies as BrightBox can be helpful during the post-challenge analysis. In particular, we show how to combine solutions submitted by the competition participants in order to obtain even more accurate predictions. The discussed functionalities are of significant importance for the sponsors and organizers of data science / machine learning online contests because they support adoption of submissions while designing ultimate solutions of real-world problems.", "venue": "Conference on Computer Science and Information Systems", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-09-04", "journal": {"name": "2022 17th Conference on Computer Science and Intelligence Systems (FedCSIS)", "pages": "393-398"}, "authors": [{"authorId": "2434014", "name": "Andrzej Janusz"}, {"authorId": "145514740", "name": "D. Ślęzak"}], "citations": [{"paperId": "eb63d04fe8db5195d96d0c25da0f40fd9b573607", "title": "A practical study of methods for deriving insightful attribute importance rankings using decision bireducts"}, {"paperId": "cefa31e7b935f2cae9d039b1456515d36f8cf76c", "title": "Cybersecurity Threat Detection in the Behavior of IoT Devices: Analysis of Data Mining Competition Results"}, {"paperId": "8c317e974ca3a935e3d68e604d5f06355f25e2a8", "title": "Predicting Frags in Tactic Games at KnowledgePit.ai: ICME 2023 Grand Challenge Report"}, {"paperId": "ec16a25d9dffbe2b6a4f4bbe775a0dc544fe04ae", "title": "BrightBox - A rough set based technology for diagnosing mistakes of machine learning models"}, {"paperId": "d7c27681e432c32b960710ce9e24c6dcc3899e96", "title": "IEEE BigData Cup 2022 Report Privacy-preserving Matching of Encrypted Images"}, {"paperId": "5d4fe33a15583cc2b695e1b78f6af3243565a1c1", "title": "Predicting the Costs of Forwarding Contracts: Analysis of Data Mining Competition Results"}]}
