{"paperId": "812a350b59d22beef4df4c3c56d0d346061c750d", "publicationVenue": {"id": "6813b010-0f27-487d-afd0-c3d67cd5654f", "name": "IEEE international Symposium on Broadband Multimedia Systems and Broadcasting", "type": "conference", "alternate_names": ["IEEE int Symp Broadband Multimedia Syst Broadcast", "International Symposium on Broadband Multimedia Systems and Broadcasting", "BMSB", "Int Symp Broadband Multimedia Syst Broadcast"]}, "title": "Machine Learning-based Malicious Users Detection in Blockchain-Enabled CR-IoT Network for Secured Spectrum Access", "abstract": "Cognitive radio has been established as an optimal solution to enhance spectrum usage proficiency and compensate the growing spectrum scarcity for wireless multimedia communications by acquiring opportunistic access to temporarily unoccupied radio spectrum resources, which arise as a core aspect of the Internet of Things (IoT). Malicious cognitive users attack and single factor failure centralized Fusion Center (FC) architecture are important problems for handling the huge volume of spectrum sensing data created in the Cognitive Radio-based IoT (CR-IoT) network. The centralized FC is also facing many challenges, including security, privacy, trustworthiness issues, and vulnerability to attack. To address the weakness of a centralized FC, many scholars proposed a blockchain-based dynamic spectrum access framework. In the blockchain network mining and updating sensing, and access results are stored in a distributed and secure manner without the need for an FC. Nonetheless, the selfish mining or Denial of Service (DoS) attack for accessing the spectrum holes singly or disrupting the spectrum access is caused by the malicious users. To cope with the mentioned problems, we propose an intelligent Machine Learning (ML) model that identifies and clusters malicious CR-IoT users and a blockchain technology that designs a secure framework for efficient spectrum usage and sharing. Each cognitive user acts as a sensing node and mining node in the blockchain-enabled CR-IoT network. Before the Cooperative Spectrum Sensing (CSS) and mining process, cognitive users will be properly organized. Simply, CSS approaches and secured spectrum access are incentivized just by the optimized cognitive user group. The extensive experiments demonstrate the effectiveness of the proposed ML model in a blockchain-enabled CR-IoT network.", "venue": "IEEE international Symposium on Broadband Multimedia Systems and Broadcasting", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-06-15", "journal": {"name": "2022 IEEE International Symposium on Broadband Multimedia Systems and Broadcasting (BMSB)", "pages": "1-6"}, "authors": [{"authorId": "1850117", "name": "Md. Sipon Miah"}, {"authorId": "46357084", "name": "Md Shamim Hossain"}, {"authorId": "9206138", "name": "A. G. Armada"}], "citations": [{"paperId": "b5b5fdb73a5ea305943fe7c640ab267a95c6f42d", "title": "Multiple Features-Aided Malicious Users Detection in OFDM-based Cognitive Radio-Internet of Things"}, {"paperId": "f3f08dc456b5f0b3996a4d39e07542b71defaec2", "title": "Malicious Users Detection in OFDM-based Cognitive Radio-Internet of Things using Machine Learning: Simulation and Performance"}, {"paperId": "edbf63a4d4cbc53b347206aca7463dd4dada59a8", "title": "CR-IOT based selfish attack detection via RSSI-LSTM"}, {"paperId": "fd600e7cbf10b35dfa193d440a0d7d606b859558", "title": "A Framework for Secure Cooperative Spectrum Sensing based with Blockchain and Deep Learning model in Cognitive Radio"}, {"paperId": "7bf7ed90b0aea76bed38767e3085d7a16b6d9421", "title": "A Survey on Blockchain for Dynamic Spectrum Sharing"}]}
