{"paperId": "8157e807daf3475a8e88c4b364a0f35e5bc596c4", "publicationVenue": {"id": "1a24ea21-4c37-41d8-9e76-ab802d4afb3e", "name": "Engineering applications of artificial intelligence", "type": "journal", "alternate_names": ["Eng appl artif intell", "Eng Appl Artif Intell", "Engineering Applications of Artificial Intelligence"], "issn": "0952-1976", "url": "http://www.sciencedirect.com/science/journal/09521976"}, "title": "A comprehensive survey of clustering algorithms: State-of-the-art machine learning applications, taxonomy, challenges, and future research prospects", "abstract": null, "venue": "Engineering applications of artificial intelligence", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-04-01", "journal": {"name": "Eng. Appl. Artif. Intell.", "pages": "104743", "volume": "110"}, "authors": [{"authorId": "2181827", "name": "Ezugwu E. Absalom"}, {"authorId": "51039276", "name": "A. M. Ikotun"}, {"authorId": "144382748", "name": "O. N. Oyelade"}, {"authorId": "7833679", "name": "L. Abualigah"}, {"authorId": "2353371", "name": "J. Agushaka"}, {"authorId": "52534659", "name": "C. I. Eke"}, {"authorId": "2555593", "name": "A. A. Akinyelu"}], "citations": [{"paperId": "6dd091c8d42821585f83d2ba38dd82549f2e47ef", "title": "Predictive models in machine learning for strength and life cycle assessment of concrete structures"}, {"paperId": "ecf7d9913e75652e0f31548be71f9f24b4c59ecc", "title": "UBUMonitor: Desktop application for visual e-learning student clustering with Moodle"}, {"paperId": "9479c86cfd8817c075e79c7241a6b2fe6c403800", "title": "Data Science Applications in Circular Economy: Trends, Status, and Future."}, {"paperId": "5bb64a70af91928721c02fd540baf3479c4da0a5", "title": "Implementation of K-means Clustering Algorithm for the Indonesian Stock Exchange"}, {"paperId": "f35d9ed85d15d295eef7e146b07d8e7291cea0d1", "title": "CLUSTERIZAÇÃO DE PROCESSOS JUDICIAIS COM ASSUNTOS SIMILARES"}, {"paperId": "2dd5acdf911a047917f8e8d9d84e9e127bf2063d", "title": "Heptagonal Reinforcement Learning (HRL): a novel algorithm for early prevention of non-sinus cardiac arrhythmia"}, {"paperId": "37a643deff0cd34d2272ff1c7641fcb3e8337545", "title": "Visual hazardous models: A hybrid approach to investigate road hazardous events."}, {"paperId": "a7d83c9f7da5f2938f900ee7f0494d8f8ca639e4", "title": "Multi-Choice Diet Recommendation Application for Indian Scenario Based on Insights from Ensemble Learning Techniques"}, {"paperId": "431ae2477d916c6f2ead1c8c9ed44d37ee3064b5", "title": "A Psycholinguistics-Inspired Method to Counter IP Theft using Fake Documents"}, {"paperId": "cbddf41f690f8bd69fffdfd4185fd9baf48efc93", "title": "Veri Madenciliğinde Kümeleme Teknikleri: Yöntemler, Zorluklar ve Uygulamalar Üzerine Bir Araştırma"}, {"paperId": "03906fdd16b043607b9dd0e610d4b6e2eb7b0be3", "title": "A fast DBSCAN algorithm using a bi-directional HNSW index structure for big data"}, {"paperId": "f987e7a0af0e59917bd559967a5be7cade5d5b9a", "title": "A critical review of machine learning algorithms in maritime, offshore, and oil & gas corrosion research: A comprehensive analysis of ANN and RF models"}, {"paperId": "f2b2a3bd973d8062870611165bda4b6075245aa1", "title": "Sparse Membership Affinity Lasso for Fuzzy Clustering"}, {"paperId": "ca47c639d79540c706fdc608826d23bd3a92b51b", "title": "INCM: neutrosophic c-means clustering algorithm for interval-valued data"}, {"paperId": "83a965876a1b77b55c136dda7c3cff5b57226260", "title": "Fully automated learning and predict price of aquatic products in Taiwan wholesale markets using multiple machine learning and deep learning methods"}, {"paperId": "98d7588d95d2487d7d9f98ad8c047074cd5b79c6", "title": "A spatio-temporal binary grid-based clustering model for seismicity analysis"}, {"paperId": "b0857f8c7d7e781f8f0d8682c3dea090805468fc", "title": "Smart Strategic Management for the Cold Plasma Process Using ORP Monitoring and Total Organic Carbon Correlation"}, {"paperId": "ba44f7e49dbb3528bb0479e0c99526c4771555e3", "title": "Neurocognitive responses to spatial design behaviors and tools among interior architecture students: a pilot study"}, {"paperId": "b3ca17208efb6c7807659618d0e80b20ebd9664d", "title": "Extension of a clustering identification approach to multivariable piecewise affine systems: Application to an industrial dryer"}, {"paperId": "25d5f6fcea1a61b5e2b44de8b615981907de8066", "title": "A New Initialization Method for K-means Clustering"}, {"paperId": "651be1c925e7a1a16fc927ce1f4e8316a2ab6cf1", "title": "CCFC++: Enhancing Federated Clustering through Feature Decorrelation"}, {"paperId": "780a25c9673a6efda028601755eefcf3edf5e800", "title": "Empirical Density Estimation based on Spline Quasi-Interpolation with applications to Copulas clustering modeling"}, {"paperId": "f3ab44f401cc178f4e506d3a60dd55bd1b6ff40b", "title": "Optimizing pick-place operations: Leveraging k-means for visual object localization and decision-making in collaborative robots"}, {"paperId": "73df7c3c7e93b752664b56b9fb2f8008143af8bb", "title": "Fatal Crash Occurrence Prediction and Pattern Evaluation by Applying Machine Learning Techniques"}, {"paperId": "e973766494b8a8be90280ee88f961104ea95de57", "title": "A Review of Machine Learning Approaches for Brain Positron Emission Tomography Data Analysis"}, {"paperId": "c51d60725510b036a2e3a220ff0466057b83a13d", "title": "Distributional Reduction: Unifying Dimensionality Reduction and Clustering with Gromov-Wasserstein Projection"}, {"paperId": "9a7a5d81a6027bc3606b17a4a5c5d999f85be6ad", "title": "Deep clustering framework review using multicriteria evaluation"}, {"paperId": "eaf1f7464bfafd96ceec7d8115d1460fb196b398", "title": "The dawn of intelligent technologies in tea industry"}, {"paperId": "656cbd5fb6241310ee3c6de2e19be02ab6b618de", "title": "Deep Clustering Using the Soft Silhouette Score: Towards Compact and Well-Separated Clusters"}, {"paperId": "bca3deb7edb04264dc39b59fe50bf59f48311a07", "title": "Robust spectral embedded bilateral orthogonal concept factorization for clustering"}, {"paperId": "542c0781c24de4ab20feafd0de6a50e57cf6db80", "title": "A comprehensive framework for explainable cluster analysis"}, {"paperId": "00703263fbdbbf3980ad6da359d169522db4f63d", "title": "High-density cluster core-based <mml:math xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" display=\"inline\" id=\"d1e5009\" altimg=\"si356.svg\"><mml:mi>k</mml:mi></mml:math>-means clustering with an unknown number of clusters"}, {"paperId": "54f026f99e6f66d29ad61c6049f2fd837844d12e", "title": "A randomized algorithm for clustering discrete sequences"}, {"paperId": "83e6f338ad8d9d6b69d17e80fee34ee0d0135184", "title": "Global Health Management in the Face of Emerging Pandemic Threats: Strategies, Challenges, and Opportunities for International Cooperation"}, {"paperId": "52d0d021c8a2421423941fcea06609966dae4a14", "title": "Analysis of Machine Learning Classifiers for Speaker Identification: A Study on SVM, Random Forest, KNN, and Decision Tree"}, {"paperId": "a502e9fe9ac33d0406d58f463a8c4a2fa63188fe", "title": "Machine learning in physical activity, sedentary, and sleep behavior research"}, {"paperId": "08f064bcc9bac15f0ebfef7cafc13dff37ae8e76", "title": "A Prediction Approach Based on Clustering Reconstruction for Abnormal Mining Pressure of Longwall Face under Residual Coal Pillars"}, {"paperId": "376d0c7f248da32b0b2956ae8ede2c958194b0b4", "title": "Bald eagle search algorithm for solving a three-dimensional path planning problem."}, {"paperId": "2758d681febdb4c76266eb48bb41fbca0255b08d", "title": "Data-Driven Process Monitoring and Fault Diagnosis: A Comprehensive Survey"}, {"paperId": "0154ad5e692dd316fc10a4d2647653e871cadd17", "title": "Performance of 4 Pre-Trained Sentence Transformer Models in the Semantic Query of a Systematic Review Dataset on Peri-Implantitis"}, {"paperId": "85f029dde5d8945bdcda1538b65c37bd92cf314d", "title": "Differential evolution algorithms with novel mutations, adaptive parameters, and Weibull flight operator"}, {"paperId": "e04ca520934e68bbd0803c9c89bae71398b50539", "title": "Improved Selective Deep-Learning-Based Clustering Ensemble"}, {"paperId": "785551fcfbc1fad5d8be2c39207d1ff9d4b76ed9", "title": "A Rapid Review of Clustering Algorithms"}, {"paperId": "b84adcd3cfb39330884df8c1de7d0096a2fca0dc", "title": "Data-driven machine learning for pattern recognition and detection of loosening torque in bolted joints"}, {"paperId": "781bebeeefd454d2a40890c4791db35f35dacd58", "title": "Silhouette Aggregation: From Micro to Macro"}, {"paperId": "645b758bb52519340db5a8a16f94521beb4e781c", "title": "Clustering method for time-series images using quantum-inspired digital annealer technology"}, {"paperId": "3a5069fa53fea54c2e52a6ae3bed69ac0c8034a6", "title": "A New Criterion for Improving Convergence of Fuzzy C-Means Clustering"}, {"paperId": "69982affd0831eefe7f7bbb564fd49cdbeae87fe", "title": "Development and evaluation of an immersive VR-CFD-Based tool for dust exposure mitigation in underground tunnelling operations"}, {"paperId": "1451e95b6dd969639fbad1d405492a2799d58c15", "title": "A flexible framework for coding and predicting acute hypotensive episodes using Markov chains"}, {"paperId": "599feb3bd9de4f4c461179c6562df5714d73c1ed", "title": "AI-based clustering of similar issues in GitHub’s repositories"}, {"paperId": "ff68f2e7ae72e5b088e871ed4762a6e539284de6", "title": "Representing uncertainty and imprecision in machine learning: A survey on belief functions"}, {"paperId": "81417fd909e8e31b943397b2239262b683bd6621", "title": "MSLR: A Self-supervised Representation Learning Method for Tabular Data Based on Multi-scale Ladder Reconstruction"}, {"paperId": "f12437f99ea9115d11fc784f09751610fd33bb74", "title": "Multi-Objective Neural Architecture Search for Efficient and Fast Semantic Segmentation on Edge"}, {"paperId": "f45aa9211a74e145b105504fa47552b32be216f3", "title": "Intelligent Waste-Volume Management Method in the Smart City Concept"}, {"paperId": "cad59a669405fc6ab2170dd429ad71debc178459", "title": "Advances in Clustering Algorithms for Large-Scale Data Processing with AI"}, {"paperId": "811e3123dbcf4d33f7d8c2e2e27abfc36f117d36", "title": "Using Medical Data and Clustering Techniques for a Smart Healthcare System"}, {"paperId": "a6101ba3c1a3b23ffc9eb1a057e491427743e648", "title": "Spectroscopy, a Tool for the Non-Destructive Sensory Analysis of Plant-Based Foods and Beverages: A Comprehensive Review"}, {"paperId": "3eda31e49faf340253643db30b67f20201b9c5df", "title": "Aerial Target Grouping based on Sparse Subspace Clustering with the Mixed constraints of Distance and Velocity"}, {"paperId": "4d6ba24581b5fceb5addf3edeebff3626cdb37bb", "title": "Classification of Datasets Based on Combination Algorithm of Clustering and Neural Network"}, {"paperId": "523ef85869ad7601141845f4cd82ad84ceef194e", "title": "Uncertainty in GNN Learning Evaluations: A Comparison between Measures for Quantifying Randomness in GNN Community Detection"}, {"paperId": "855010df350211c9806631949fe9474146904e63", "title": "Viscous Gravity Algorithm for Clustering Multidimensional Data"}, {"paperId": "e7b92163c5c2af09fac0c0baacc45bdca87f8b8d", "title": "An Improved Routing Protocol for IoT Sensors Utilizing Clustering Techniques and Optimization Methods"}, {"paperId": "6b4ce6e127fab6fd20a32df964523fea728d777d", "title": "Integrated assessment of financial knowledge through a latent profile analysis"}, {"paperId": "636b5a2d8e8906ddb798c5218ebbdea2a053e305", "title": "Student Enrollment Performance of Telkom Schools in 23/24 schoolyear using k-Means Clustering"}, {"paperId": "d2a9723694fa5ff5f35bea7ed1d19489ada9843a", "title": "Empowering English language learning and mental health using AI and Big data"}, {"paperId": "5e7e351f82fc15bdf77c55ca7284cf55440c6fb7", "title": "A Modified Class Topper Algorithm and its Hybridization for Clustering Agriculture, Health-care and Geology Data"}, {"paperId": "eedc5003da3b637399bc06be087ce3fea3145fae", "title": "Application of machine learning in polymer additive manufacturing: A review"}, {"paperId": "9bcf8cf2b0f034d8a4f687adcf0ffce7708a290b", "title": "Big Data-Driven Portfolio Simplification: Leveraging Self-Labeled Clustering to Enhance Decision-Making"}, {"paperId": "fd930af3f3304d9e78a8ca83ae38991650fb0e05", "title": "Workflow Engines in the Compute Continuum: a Comparative Analysis"}, {"paperId": "7c9d1e40f899e0745235d34a99bc120b2c7eb8f2", "title": "Anchor-graph regularized orthogonal concept factorization for document clustering"}, {"paperId": "350d2e5b9132e9a53b796216e4c715b03e156ab5", "title": "Modeling the lane-changing behavior of non-motorized vehicles on road segments via social force model"}, {"paperId": "c6046385a334ab0fad4387025192a9b02a140ed6", "title": "Hybridization of Data-driven Threshold Algorithm with Fuzzy Particle Swarm Optimization Technique for Gene Selection in Microarray Data"}, {"paperId": "d294e942e8d73ae83e9a13dc34ef5f48808b14bd", "title": "Three-way evidence theory-based density peak clustering with the principle of justifiable granularity"}, {"paperId": "f05e75a3354d04a050e414c9a12e9e072940111f", "title": "Density peaks algorithm based on information entropy and merging strategy for power load curve clustering"}, {"paperId": "d08da02f130ecc3328e32e318ab5e6bddacec4e7", "title": "The Expansion of Data Science: Dataset Standardization"}, {"paperId": "5550b1195a9bea9955291024cfc8a65d03b7c40a", "title": "Randomized self-updating process for clustering large-scale data"}, {"paperId": "c3b915b5410b6ecf04f96cafc378aa4bfbf22ee5", "title": "Spatial Clustering of Child Malnutrition in Central Java: A Comparative Analysis Using K-Means and DBSCAN"}, {"paperId": "ae02ead6b6f3f374edb9a0d889faebc3e58ad54a", "title": "A Multi-Stage Approach for External Trucks and Yard Cranes Scheduling with CO2 Emissions Considerations in Container Terminals"}, {"paperId": "57155882d8a93b75d053213e84e5b2b74e01b683", "title": "Characterizing Demand Curves Using the Cluster Technique-A Case Study From Ecuador"}, {"paperId": "7c365fc5c0c8a97aaf09e2ace0a6727dcc133590", "title": "Ship Engine Data Analysis for the Application of Machine Learning Algorithms"}, {"paperId": "dbb5b180df171ddc8209c8136bc78e0825dabba4", "title": "VEAD: Variance profile Exploitation for Anomaly Detection in real-time IoT data streaming"}, {"paperId": "3660a3034d0b78921c3316242584f45ffffd07db", "title": "A comprehensive overview of graph neural network-based approaches to clustering for spatial transcriptomics"}, {"paperId": "99510c13a642e00e8e6d153349950aef99c992a5", "title": "Gaussian kernel fuzzy c-means with width parameter computation and regularization"}, {"paperId": "e979919f7b5deb99f34a197acc1b33aa1a8a8739", "title": "Supervised and unsupervised machine learning approaches using Sentinel data for flood mapping and damage assessment in Mozambique"}, {"paperId": "38882f5ddd077a56f9f0491e9c762ef9c4c80c3e", "title": "Generalized black hole clustering algorithm"}, {"paperId": "5ca51b5e83d82d9552c3ed512c483ef7656f95db", "title": "Machine learning-based multiscale framework for mechanical behavior of nano-crystalline structures"}, {"paperId": "ec65aeb273bdef9a5f698492590dda5ca4edf9cd", "title": "Dimensionality reduction model based on integer planning for the analysis of key indicators affecting life expectancy"}, {"paperId": "eb8ecd17d6a30b1f522e7de62a0f28e3452c12b1", "title": "Hyperdimensional Computing for Robust and Efficient Unsupervised Learning"}, {"paperId": "64bdc2a873e0c0124852ab3d3ad5e72eeb3fe327", "title": "Phenotypic Clustering of Beta-Thalassemia Intermedia Patients Using Cardiovascular Magnetic Resonance"}, {"paperId": "890b6c579cddef9aba1bb46f35d6cb24480e59a8", "title": "DeepBlock: a Collaborative Intrusion Detection Framework Based on Blockchain and Deep Learning"}, {"paperId": "90ccadf1274f079b85f27121da7036f13c7f2064", "title": "Improving fuzzy clustering model for probability density functions using the two-objective genetic algorithm"}, {"paperId": "37abf57349bfdd14a0b6b26b891ac7b0fdb5efd5", "title": "A Multiclustering Evolutionary Hyperrectangle-Based Algorithm"}, {"paperId": "7596efe50077c8c3b369205254f8862257a760cb", "title": "A Comprehensive Review of the Recent Advancement in Integrating Deep Learning with Geographic Information Systems"}, {"paperId": "3f58b88b773f78976934731f02fc30352d5ea9ef", "title": "Exploring Diverse Clustering Methods for Analyzing Gas Turbine Emissions"}, {"paperId": "cd26e1fc64c1ae33a88c3e7ca8bb46f0916d206e", "title": "A new clustering method based on multipartite networks"}, {"paperId": "d3e0d55b8d392990dbe1f439bce6a591a8669cdb", "title": "Comparison between Two Algorithms for Computing the Weighted Generalized Affinity Coefficient in the Case of Interval Data"}, {"paperId": "291e400786587f9925e01d5c1fb9b0aaa2a0ebd2", "title": "Evaluation of Stock Closing Prices using Transformer Learning"}, {"paperId": "33910419031935d7c5147b2d03531eee90a2b4db", "title": "Investigation of Natural Gas Hydrate Microscopic Occurrence Types and Pore-Scale Flow Simulation Based on Digital Cores"}, {"paperId": "7f1704d487e3b0edf1198ab3ed3c1846d0cd685a", "title": "Algorithms for Finding the Optimal Cluster Head Locations for Wireless Sensor Networks in Presence of Prohibited Regions"}, {"paperId": "c163e4c1d0bf854c9dc5a6c8c58f98825b32567f", "title": "An incremental clustering method based on multiple objectives for dynamic data analysis"}, {"paperId": "c98e5cdbe50c6e24bda5adc74ede843f7619dd34", "title": "Multivariate Analysis Approach to Factor-Affected Tuberculosis Disease"}, {"paperId": "e37a57553fd4a9667727dbaf948f6c592e4fb040", "title": "Adaptive local Principal Component Analysis improves the clustering of high-dimensional data"}, {"paperId": "1c5cd18f93eabc684c2425a79d4a173f43f4dadc", "title": "Discrete correntropy-based multi-view anchor-graph clustering"}, {"paperId": "4cd0102b81362157f87c0c8ea42b674814ee3e19", "title": "Statistical topology optimization scheme for structural damage identification"}, {"paperId": "42c6823a03c1b5402e8faaee463ed1062740211c", "title": "Logistics distribution optimization: Fuzzy clustering analysis of e-commerce customers' demands"}, {"paperId": "8aa3b7beeb256541599913968f0c4e1fba3a1df5", "title": "A fast O(NlgN) time hybrid clustering algorithm using the circumference proximity based merging technique for diversified datasets"}, {"paperId": "e74f15293bc5bd4743e11b14b773be9cd39d9f38", "title": "Real-Time Deployment of Simplified Volterra Nonlinear Equalizer in High-Speed PON"}, {"paperId": "ec3a5cf47df62c5b6a980b3a4388427c17060000", "title": "Cloud migration framework clustering method for social decision support in modernizing the legacy system"}, {"paperId": "5bf325135b55e3eeca835510027e6f55c95193af", "title": "Systematic analysis of the blockchain in the energy sector: Trends, issues, and future directions"}, {"paperId": "3836f286472022d14697737598131b7d68dbb81e", "title": "ML-aVAT: A Novel 2-Stage Machine-Learning Approach for Automatic Clustering Tendency Assessment"}, {"paperId": "46c7830c5fc024190dbd72367e5ccb0573e73305", "title": "Exploring Organizational Self-(re)presentations on Visual Social Media: Computational Analysis of Startups’ Instagram Photos Based on Unsupervised Learning"}, {"paperId": "3542deeadf86d917628ed5483b286d125b9198c9", "title": "A Strategy to Develop and Translate Custom 5G Network Slice Templates Using Machine Learning Techniques"}, {"paperId": "8c78c0f7fdf425aa356de9b45a3a85ecee8ce1eb", "title": "Unsupervised Learning via Network-Aware Embeddings"}, {"paperId": "08b2752a7df0c44015c6be8fc026565a4873fc3c", "title": "An integrated fuzzy neural supervision and attention-based graph neural network for improving network clustering"}, {"paperId": "432ba640000b403330e1bb0210a1f6db60059fc0", "title": "DissIdent: A Dissimilarity-based Approach for Improving the Identification of Unknown UAVs"}, {"paperId": "75aa9bfdff89b02f7dc9e6f73514ca4aebf40d11", "title": "The application of integrating comprehensive evaluation and clustering algorithms weighted by maximal information coefficient for urban flood susceptibility."}, {"paperId": "16cfe5b8b7a89fdbf4338dd7cdee46292df5a125", "title": "Equitable-FL: Federated Learning with Sparsity for Resource-Constrained Environment"}, {"paperId": "abe2dbbf51d1ef53f5e881550c07331f20a59725", "title": "A Topic Modeling Approach to Discover the Global and Local Subjects in Membrane Distillation Separation Process"}, {"paperId": "9187e78142d7056bab67090e7f7b5baf55fdc233", "title": "Semi-supervised hierarchical ensemble clustering based on an innovative distance metric and constraint information"}, {"paperId": "dc38e04924869e3fa0eb05c5ae2ca79ac0ddfcbf", "title": "A methodology for urban planning generation: A novel approach based on generative design"}, {"paperId": "64c58a934d345722557a78af4ac00e71e4f738c2", "title": "Machine Learning Techniques for Vertical Lidar-Based Detection, Characterization, and Classification of Aerosols and Clouds: A Comprehensive Survey"}, {"paperId": "ccc662aaef9972a04723cf3125a6388f7aa13841", "title": "A novel clustering method with consistent data in a three-dimensional graphical format over existing clustering mechanisms"}, {"paperId": "2dfe6120882d7dd8da9aeb75bc7a808dc0f4e61f", "title": "Comparative Analysis of the Clustering Quality in Self-Organizing Maps for Human Posture Classification"}, {"paperId": "55f9c6445d18ea79423fb3eb0a39b5543cc3f0ba", "title": "Operational optimisation of integrated campus energy systems considering integrated demand response"}, {"paperId": "270ab6444e5caf89194927eabcc87799a08fb4b7", "title": "Deep Learning Based Model for Predicting the Contribution of SMEs to the Economy"}, {"paperId": "80be2a4087191e161ca07f550cc7c83b61c19833", "title": "Enhancing classification accuracy through feature extraction: a comparative study of discretization and clustering approaches on sensor-based datasets"}, {"paperId": "f01f2d295109642aea302824a3ba7e6f315b1edc", "title": "Mobile Customer Satisfaction Scoring Research Based on Quadratic Dimension Reduction and Machine Learning Integration"}, {"paperId": "d753dd8541b0f35cc93d0f0926fa4d92272fbff6", "title": "Development of a decentralized cohort for studying post-acute sequelae of COVID-19 in India in the Data4life Study"}, {"paperId": "3a0fab327f68f49a2108db60fdeb81be3eb876fc", "title": "Constrained Density Peak Clustering"}, {"paperId": "a5879c50bc8c5e657f0191cac04286f3e9ef87fa", "title": "Energy Efficient Clustering for Equating the Load in Wireless Sensor Network"}, {"paperId": "99788abeb184d6913cc058d9c17b63b0b4b9f695", "title": "Investigating Cases and Clusters-Based Reuse Policies for Card-Playing Agents"}, {"paperId": "1ff1d4830381afc136480816b1c0776146fd9d9d", "title": "Clustering Time Series from Complex Systems using Intermittent Forces in System Decomposition"}, {"paperId": "803d1945b28293194d2ada9103421bfc92f15b11", "title": "A clustering algorithm for overlapping Gaussian mixtures"}, {"paperId": "648c051ef79e378f2cece34fffc5e0dc4d9df666", "title": "GOLFS: feature selection via combining both global and local information for high dimensional clustering"}, {"paperId": "638d93d3e5df02a5a4984e89f1977d05edf10ee4", "title": "Enhanced tensor multi-view clustering via dual constraints"}, {"paperId": "c20ce1cae2288a0f455f1de0bc277de9ed79ca44", "title": "Scalable incomplete multi-view clustering via tensor Schatten p-norm and tensorized bipartite graph"}, {"paperId": "2dfba0c10282820784ec09c514d4b407466ce9a2", "title": "Data collection optimization of ocean observation network based on AUV path planning and communication"}, {"paperId": "568a17e98c8157d2f9a1dfed8b3d62dd407403c5", "title": "Explainable Graph Spectral Clustering of Text Documents"}, {"paperId": "739fd0b8452bd18c46da87a84999e10cd9a26ca3", "title": "Improved Kernel-based Fuzzy Clustering Algorithm Based on Maximum Tsallis Entropy"}, {"paperId": "4c97cab7fa7a52677dd37c8a3171f0c8d307cd10", "title": "Hybrid Approach to the Cost Estimation of External-Fleet Full Truckload Contracts"}, {"paperId": "4121539bde562aa8d97f2b3dc8eec56f1236f192", "title": "DBGSA: A Novel Data Adaptive Bregman Clustering Algorithm"}, {"paperId": "d579b087d6a5ca0c1999c9259ee2b09afe1cf17a", "title": "Dingo Algorithm-Based Efficient Group Leader Selection in Wireless Network"}, {"paperId": "d8014eee831d63d9b77ad3e2d8e9a297133eea0b", "title": "DeviceGPT: A Generative Pre-Training Transformer on the Heterogenous Graph for Internet of Things"}, {"paperId": "c32b3979424c1716b55c53c05c08b64456726c76", "title": "Hyperspectral Image Classification using Mutual Nearest Neighbour Clustering"}, {"paperId": "5b3045482fc2d1eb47857a175e3dc10c7852c7b2", "title": "Clustering of Asphalt Pavement Maintenance Sections Based on 3D Ground-Penetrating Radar and Principal Component Techniques"}, {"paperId": "6fc9f7611010f9e3d85941332dd53c7141ef0778", "title": "Credit Card Fraud Detector Based on Machine Learning Techniques"}, {"paperId": "36914b8b0faf9d06d98298384b34a3e2fa6c5c28", "title": "Systematic and Comprehensive Review of Clustering and Multi-Target Tracking Techniques for LiDAR Point Clouds in Autonomous Driving Applications"}, {"paperId": "3791a786b1e905e259c47ef8f30bc95222b29cb9", "title": "Row Detection BASED Navigation and Guidance for Agricultural Robots and Autonomous Vehicles in Row-Crop Fields: Methods and Applications"}, {"paperId": "85f44125e79458e190a15f5ea6a0e4f25377ec6f", "title": "Exploratory analysis of a real wind turbine dataset, using AI tools to cluster and classify data, for condition monitoring and fault detection"}, {"paperId": "007d6e6be042e11559022f7a4141a7bb8701f5a1", "title": "Characterisation of Youth Entrepreneurship in Medellín-Colombia Using Machine Learning"}, {"paperId": "8dcedad55fa86dec5000a177c7d79624e9c249c8", "title": "Content-based comparison of communities in social networks: Ex-Yugoslavian reactions to the Russian invasion of Ukraine"}, {"paperId": "2df0da5308c72438193758a4285166b0e726c11e", "title": "Analysis of Advertising Promotion Strategy Based on Improved Collaborative Filtering Algorithm under Digital Media Technology"}, {"paperId": "ca4e9843118a2c23183fc0b076086f850ee9e472", "title": "Mitigating Negative Transfer with Task Awareness for Sexism, Hate Speech, and Toxic Language Detection"}, {"paperId": "eb7d025af682268edbfaf13a8ac89de53da9dd1f", "title": "PaVa: a novel Path-based Valley-seeking clustering algorithm"}, {"paperId": "be9b3eed1c758e50c96050b8bde9daea8084706a", "title": "An Effective Partitional Crisp Clustering Method Using Gradient Descent Approach"}, {"paperId": "1946b25b4137b31553b4b9edc041f8623cd4a2e1", "title": "An integrated approach for fuzzy rule generation in dataset classification using hybrid grid partitioning and rough set theory"}, {"paperId": "66ab9a910027ecfab01a2d6afefb8b8f7f3cbf51", "title": "Soft dimensionality reduction for reinforcement data clustering"}, {"paperId": "bf72e78c08b1811310ec9a3b94efe719a34d1e17", "title": "Clustering Optimization Method for Liquid Metal Battery Screening Requirements"}, {"paperId": "8e64eef798c90ac9a4cdcf7fb3853b0c3f62a5d7", "title": "Application of Classification and Regression Tree and Spectral Clustering to Breast Cancer Prediction: Optimizing the Precision-Recall Trade-Off"}, {"paperId": "7b7ea26c9921a5e94950d9060a2963a637ebc4fd", "title": "A simple distributed fuzzy c-means clustering method via the technique of Map-Reduce"}, {"paperId": "1120ccbc1e87abaad08e2922e278f6f4ef6ee1d8", "title": "Enhancing the quality of compressed images using rounding intensity followed by novel dividing technique"}, {"paperId": "eca2824b364c5c07b9ec8d2d0a34f9d093b013a1", "title": "Consensus Big Data Clustering for Bayesian Mixture Models"}, {"paperId": "f717dfb790c0404026d549d25c3025031b454ba2", "title": "Unsupervised Mutual Transformer Learning for Multi-Gigapixel Whole Slide Image Classification"}, {"paperId": "ffb4ff6e9b99b192587db3556a0efdc9c8387e97", "title": "Machine learning-assisted self-powered intelligent sensing systems based on triboelectricity"}, {"paperId": "80e7d2a682f73a12b31713210db06b0e98c80b60", "title": "Machine learning for modern power distribution systems: Progress and perspectives"}, {"paperId": "f6b521e2df2daf48b5a45786a940e5e056ba8d33", "title": "Clustering Using Conditional Generative Adversarial Networks (cGANs)"}, {"paperId": "e1f8aa35aa2eb20764ddcc7b8c373d38a2b9b299", "title": "Comparison of hierarchical clustering and neural network clustering: an analysis on precision dominance"}, {"paperId": "6f8677ee23d62146b5890723f3fae89de7ee4873", "title": "Numerical analysis on liquid seepage - Diffusion coupled with heat in soil of low - Pressure buried pipelines leakage"}, {"paperId": "e90c3af225f8e9bec36554fb0528783ff3cc2013", "title": "Efficient energy management for a plug-in hybrid electric vehicle considering motor current alert mechanism"}, {"paperId": "dd2a14b414444429589aaad076524ee293570446", "title": "A semantic data-driven knowledge base construction method to assist designers in design inspiration based on traditional motifs"}, {"paperId": "b93efa440e948b4944eeb208f1516c047b881885", "title": "Discussion of ‘Is designed data collection still relevant in the Big Data era?'"}, {"paperId": "d217223e36f4cb6b90bd48cf06452e5abcbd99e9", "title": "Optimizing Predictive Maintenance Decisions: Use of Non-Arbitrary Multi-Covariate Bands in a Novel Condition Assessment under a Machine Learning Approach"}, {"paperId": "4ec36a231068d2ffe24e0a1cfa54f5114c9be0cc", "title": "Boosting precision crop protection towards agriculture 5.0 via machine learning and emerging technologies: A contextual review"}, {"paperId": "6e6c26f1eb7b1a8048499c975fffd2f84be8e6b6", "title": "Low-dimensional representation of monthly electricity demand profiles"}, {"paperId": "d345240b7491d86db8956379025a445d72f24ad7", "title": "An efficient entropy based dissimilarity measure to cluster categorical data"}, {"paperId": "005c8d55325b71be58eec814ed71bb4724afa2dc", "title": "Heterogeneous Graph Convolutional Network Based on Correlation Matrix"}, {"paperId": "53d9dd5e9d48fdc04ed38b799e0ea5ca105e3327", "title": "Incremental estimation of low-density separating hyperplanes for clustering large data sets"}, {"paperId": "b1e6827fb17f56d0718d420da43a497ef69e5336", "title": "WGSDMM+GA: A genetic algorithm-based service clustering methodology assimilating dirichlet multinomial mixture model with word embedding"}, {"paperId": "237753a399d653abeaa91b89d5c7ab56d7388ad3", "title": "Geospatial data-driven assessment of earthquake-induced liquefaction impact mapping using classifier and cluster ensembles"}, {"paperId": "a7cd96b431f11f6033261984170b722516989fee", "title": "Simulation of Solar Radiation on Metropolitan Building Surfaces: A Novel and Refined Research Framework"}, {"paperId": "f8d606bd3b5e0bd9b3a14eb794fa75906ed7f713", "title": "Semi-supervised Clustering with Two Types of Background Knowledge: Fusing Pairwise Constraints and Monotonicity Constraints"}, {"paperId": "3784d50d709b9504c3a945382334a00bc8c84b2e", "title": "Improving the Efficiency of Link Prediction on Handling Incomplete Knowledge Graph Using Clustering"}, {"paperId": "b44a6a7bd8f03769c1720e0ff9ed5bd768bb0efb", "title": "Online Monitoring of Sensor Calibration Status to Support Condition-Based Maintenance"}, {"paperId": "691254ca5399e191d49344a5ca30d58b3fc6f189", "title": "A Modified DBSCAN clustering algorithm for the identification of PWA systems"}, {"paperId": "bd2c0ca0ba23508a051c7ec0c0cde56471beb69a", "title": "A hybrid chimp optimization algorithm and generalized normal distribution algorithm with opposition-based learning strategy for solving data clustering problems"}, {"paperId": "8abf7ac95a4279fafc9c006ad6a882c3bbf10f36", "title": "ANALISIS MANAJEMEN LOKASI PUSAT LOKASI PENGOLAHAN GABAH MENGGUNAKAN K-MEAN CLUSTERING DENGAN BAHASA PYTHON"}, {"paperId": "9facc73b9dd09cf17b9a23960008f6890b239939", "title": "A bio-inspired computational classifier system for the evaluation of children’s theatrical anxiety at school"}, {"paperId": "373ade594871ca9a74ea0d1b69ade7f82728e4a5", "title": "An efficient document information retrieval using hybrid global search optimization algorithm with density based clustering technique"}, {"paperId": "5e159c0f1f56ebc51e8d44c18cf579a891ef1c5f", "title": "Unsupervised Deep Learning for IoT Time Series"}, {"paperId": "c32130579d1ec9a771d55aec2c987c2d92ce1f05", "title": "Review on the Application of Photovoltaic Forecasting Using Machine Learning for Very Short- to Long-Term Forecasting"}, {"paperId": "14e9d7a393e78edd3a393d5a090bf12bea14f640", "title": "Applications of Clustering Methods for Different Aspects of Electric Vehicles"}, {"paperId": "b97c5d461e29b5409ff62ce0e3de7215946b16c0", "title": "A semi-supervised clustering approach using labeled data"}, {"paperId": "3a1c428d38ac6cfc2ac9c4575384870f5e0836a7", "title": "Inclusivity induced adaptive graph learning for multi-view clustering"}, {"paperId": "7a395e2af4ca14bfa1d9d4723a8df226e79456e0", "title": "A Semantics-Based Clustering Approach for Online Laboratories Using K-Means and HAC Algorithms"}, {"paperId": "9a1f12462d40acb0697a7977d498e84921b472a8", "title": "Clustering of Relevant Documents Based on Findability Effort in Information Retrieval"}, {"paperId": "b31b907e572e97c5e9f3694267258b88d0cfee97", "title": "Evaluation of Rainfall Erosivity in the Western Balkans by Mapping and Clustering ERA5 Reanalysis Data"}, {"paperId": "b5f8bc7a896fad3f269dc8c695f0c7b620f313aa", "title": "Zinc- and Copper-Doped Mesoporous Borate Bioactive Glasses: Promising Additives for Potential Use in Skin Wound Healing Applications"}, {"paperId": "91db89ad44fe1ae988bb76760ee9af50342290f7", "title": "Surface Mount Technology Line Optimisation using Modified k-means with Feature Weight Constraints"}, {"paperId": "7c39d8e9292687ca83b87781a72cea6aed699d39", "title": "Extraction of SIFT Features for Identifying Disaster Hit areas using Machine Learning Techniques"}, {"paperId": "fbef5d753d833274ad1440957a25373f60bf545b", "title": "Omada: Robust clustering of transcriptomes through multiple testing"}, {"paperId": "0dbccbd94d76d4382b2cc3549495cff37eb8fd6e", "title": "Enhancing Cluster Quality of Numerical Datasets with Domain Ontology"}, {"paperId": "a98125b55013fe8e7cc791f5b0e862520c410eb8", "title": "Cloud Center Devices Associated Temporal Evolved Feature extraction and clustering for Energy Internet"}, {"paperId": "31eb1cf190a665776cd3a54d455bdc51d5643f65", "title": "K-RBBSO Algorithm: A Result-Based Stochastic Search Algorithm in Big Data"}, {"paperId": "cac6de6637ecbd85c9fe95bbce341603d98cd5a7", "title": "K-means clustering algorithms: A comprehensive review, variants analysis, and advances in the era of big data"}, {"paperId": "6736e44d8f660f1212ede7f32eeff273afa56826", "title": "Scalable clustering by aggregating representatives in hierarchical groups"}, {"paperId": "5fd66cf74ec4b9c8bbfb29de914a3ac15fa0dcd3", "title": "An isomorphism identification method of kinematic chain based on optimal arrangement and comparison of branch-chain matrix derived from dendrogram graph"}, {"paperId": "22291401d9f0d23eb48ca595944f74498f383cce", "title": "Multidimensional Data Clustering and Visualization Using Hybrid Artificial Neural Network"}, {"paperId": "7ce381553534914df8ebc9ef4cc233c27c29db67", "title": "Data clustering: application and trends"}, {"paperId": "7ecbaa8e7a47b66f5e3bd91c644e5f3000475035", "title": "Unsupervised K-means for Energy Conservation in IoT Networks"}, {"paperId": "c8e1012f716f183ae184f215ed0b26fad73e578d", "title": "I/F-Race tuned firefly algorithm and particle swarm optimization for K-medoids-based clustering"}, {"paperId": "44d83d536aa034e931e8de4ed13994f8cc079946", "title": "Brain Inspired Cortical Coding Method for Fast Clustering and Codebook Generation"}, {"paperId": "4198c80589896573b748cb1634d22da644a997f8", "title": "AnoDe: A Log-based Self-Supervised Framework to Detect Scrubber Failures in SRAM-FPGA"}, {"paperId": "2fd37493aaba25ffe789a43f71cea42b5a3e42c6", "title": "Discretization of the Urban and Non-Urban Shape: Unsupervised Machine Learning Techniques for Territorial Planning"}, {"paperId": "0769976533b3e812ed7d9c2dab6a3144f42ba2b6", "title": "A Clustering Fault Diagnosis Method for Gas Turbine Performance Parameters Based on t-SNE"}, {"paperId": "c8b05a660fd483d2438a455ee806d135c7cbfc08", "title": "Applications of machine learning techniques for enhancing nondestructive food quality and safety detection"}, {"paperId": "f2116ae056718dc6bebe66f63231212193dbd48b", "title": "A survey of parallel clustering algorithms based on vertical scaling platforms for big data"}, {"paperId": "078820d5dd02ccb4ec079bf27f85c5ef8d685127", "title": "Identifying similar sentences when processed by Apache Spark"}, {"paperId": "193fdb8c80d952b9fc4a1955877118480e43daa0", "title": "Differentially Private Propensity Scores for Bias Correction"}, {"paperId": "06d035f461eba82d9133af2f03b29e51236c77f4", "title": "A multistage retrieval system for health-related misinformation detection"}, {"paperId": "39c09618007e154913dac820396a60d6763e9ebc", "title": "ACQC: Apollonius Circle-based Quantum Clustering"}, {"paperId": "7a2552684e02e90e0944884186adca4b3311aa5d", "title": "Advancing Reproducibility and Accountability of Unsupervised Machine Learning in Text Mining: Importance of Transparency in Reporting Preprocessing and Algorithm Selection"}, {"paperId": "dcd351a408b4779d72de673003a684f46258bc3a", "title": "Protein Function Analysis through Machine Learning"}, {"paperId": "2d63d4c87f0828b71ac42f64ced334a23204ed29", "title": "Clustering pedestrians’ perceptions towards road infrastructure and traffic characteristics"}, {"paperId": "34ed2efe94040c2fc9ac04a6797258f137f2ca87", "title": "The Construction of a Prediction Model for the Teaching Effect of Two Courses Education in Colleges and Universities Based on Machine Learning Algorithms"}, {"paperId": "7f07617e52a36dd7a0e46f604dab92b53ad1219f", "title": "Boosting k-means clustering with symbiotic organisms search for automatic clustering problems"}, {"paperId": "7bda875a9d50aa5b54daa0707a04f5759ad2d505", "title": "Path-scan: A novel clustering algorithm based on core points and connexity"}, {"paperId": "23841c5ac9126c3e486a78f6bf9eea3b36c4211d", "title": "Collaborative annealing power <mml:math xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" display=\"inline\" id=\"d1e9861\" altimg=\"si100.svg\"><mml:mi>k</mml:mi></mml:math>-means＋＋ clustering"}, {"paperId": "5eb722d141e4b110b2cf52af25f6755952ec47d7", "title": "Discrete Dynamic Modeling Analysis of Data Mining Algorithm under the Background of Big Data in the Strategic Goal of Sustainable Development of College Physical Training"}, {"paperId": "5dae446c57fb1ef36f83d20f859c9e2c133055b7", "title": "Keyword Extraction in Scientific Documents"}, {"paperId": "d4c2a9ac71e453fba1bced4ac3bdca379c34d822", "title": "Sine-Cosine-Barnacles Algorithm Optimizer with disruption operator for global optimization and automatic data clustering"}, {"paperId": "bde5276c3662fa15e8b7ae8b76728e92eae05621", "title": "A hybrid steady-state evolutionary algorithm using random swaps for Gaussian model-based clustering"}, {"paperId": "d6a1b5e4e426fe5838e9dc740b40fb9fce6d8622", "title": "A new distance measurement and its application in K-Means Algorithm"}, {"paperId": "e39ffcb787a68ecba6ce2d454484bfaf4b17b1bb", "title": "Classification of Glaucoma Based on Elephant-Herding Optimization Algorithm and Deep Belief Network"}, {"paperId": "5ab09d74a8a077d5b05b32977b32c37ad19e8727", "title": "A New Stock Price Forecasting Method Using Active Deep Learning Approach"}, {"paperId": "ba9e9e6fbc3ed6104a2184004278d825854020aa", "title": "Tackling Provably Hard Representative Selection via Graph Neural Networks"}, {"paperId": "6e891e8c8f0a8375bf79ac79ba577899cb76bc49", "title": "A Normal Distributed Dwarf Mongoose Optimization Algorithm for Global Optimization and Data Clustering Applications"}, {"paperId": "bf2dc3b2d62dc47cbb49c7979731075498e25ad4", "title": "Machine Learning-Based Emotion Factor Analysis of Sport Fan Community"}, {"paperId": "61eb14c93a9d8520d9eb5763cdae51f4773ea9a2", "title": "Clustering at the Disposal of Industry 4.0: Automatic Extraction of Plant Behaviors"}, {"paperId": "e6953924b6eb8fb3e62e98e45b8aa6f5a194b90d", "title": "Machine learning in medical applications: A review of state-of-the-art methods"}, {"paperId": "232a1336054017818e8c97b46992459a3af82c74", "title": "Voice disorder detection using machine learning algorithms: An application in speech and language pathology"}, {"paperId": "57a720e7f3a3fee4c3a727b545702b32d641f28e", "title": "Internet of Intelligent Things: A convergence of embedded systems, edge computing and machine learning"}, {"paperId": "1644c868e73266beae849a8cf49dd4ac9125a90c", "title": "Enhanced Network QoS in Large Scale and High Sensor Node Density Wireless Sensor Networks Using (IR-DV-Hop) Localization Algorithm and Mobile Data Collector (MDC)"}, {"paperId": "469fb9ab8f8d940b2a12bac26fc32c4547a4ad39", "title": "Error-robust multi-view subspace clustering with nonconvex low-rank tensor approximation and hyper-Laplacian graph embedding"}, {"paperId": "7fc89dd5c7315d7163088cb1b0b279c73e980df1", "title": "Clustering Algorithms in Sentiment Analysis Techniques in Social Media – A Rapid Literature Review"}, {"paperId": "593192d778e250cd02e63845cc0c4371ce420d2f", "title": "Low-Rank Multi-View Subspace Clustering Based on Sparse Regularization"}, {"paperId": "069417319360886b4c542eb009396fb77d88edda", "title": "ML-Augmented Automation for Recovering Links Between Pull-Requests and Issues on GitHub"}, {"paperId": "f9388411d54c215ea8a34358692732db85999bbc", "title": "An Improved Generic Hybrid Prognostic Method for RUL Prediction Based on PF-LSTM Learning"}, {"paperId": "49aebbfafed3e92690e80c48f214a3066b325c26", "title": "Advanced Clustering Approach for Peer-to-Peer Local Energy Markets Considering Prosumers’ Preference Vectors"}, {"paperId": "d5dc664615e76e2d85b8adf3d755c24be8d44457", "title": "An analysis of the spatial heterogeneity of future climate change impacts in support of cross-sectoral adaptation strategies in Japan"}, {"paperId": "a689afc413e3764d18d2ebf9f75208226026354a", "title": "Genetically Optimized UFLANN for Uncovering Clusters"}, {"paperId": "255ca9f687c0e08c2be47039cff8a060ed43719f", "title": "An Enhanced Regularized Clustering Method With Adaptive Spurious Connection Detection"}, {"paperId": "d1bbf5ce48ab7ecff55eb30d2cd1ce961bb6425e", "title": "Machine Learning for Smart Cities: A Comprehensive Review of Applications and Opportunities"}, {"paperId": "ae65dc48393488b31b36e05cb499281415910edd", "title": "Enriching smart card data with the trip purpose attribute"}, {"paperId": "d025e4b22c403b1fdf77bb83ab745fbc24f43ae8", "title": "Quantum Steganography: Hiding Secret Messages in Images using Quantum Circuits and SIFT"}, {"paperId": "5019e0100ad28a9486a52160f2df0fbb498f606a", "title": "Smart Counting Machines for Modular Industry 4.0 Packing Lines"}, {"paperId": "e2cecb7f2e7dffc388bd1a945512d3d639fc31ba", "title": "Artificial Intelligence in Visible Light Positioning for Indoor IoT: A Methodological Review"}, {"paperId": "2e3d7cd5ecd0b6926f4b1c41f8fc399a267d4a63", "title": "A generic model of the information and decisional chain using Machine Learning based assistance in a manufacturing context"}, {"paperId": "1f7847797517b789050bab61278835d4cea92922", "title": "Applying Big Data Analysis and Machine Learning Approaches for Optimal Production Management"}, {"paperId": "d0df9638f81d140591cb1294492564173ba2d576", "title": "An Efficient Parallel Algorithm for Clustering Big Data based on the Spark Framework"}, {"paperId": "69cfc061da693b427302efd468664791191f8338", "title": "A Comparative Study of Unsupervised Anomaly Detection Algorithms used in a Small and Medium-Sized Enterprise"}, {"paperId": "3c43c5b8479bc9c82946df8c6cd52ba953ace951", "title": "Multiple Sound Source Localization in Three Dimensions Using Convolutional Neural Networks and Clustering Based Post-Processing"}, {"paperId": "d40d66a0b0447ab01c6dba5492084222d882cd82", "title": "Piecemeal Clustering: a Self-Driven Data Clustering Algorithm"}, {"paperId": "ef5488506cc186ff31340e59361e2b4d1236d06a", "title": "Clustering-based Automated Requirement Trace Retrieval"}, {"paperId": "0101e036539940a1bd2606f5b027562087028704", "title": "Summary of Clustering Research in Time Series Data Mining"}, {"paperId": "7924fef24401f7f64a8ba91871e3d9dcce82647f", "title": "Life cycle assessment of agricultural waste recycling for sustainable environmental impact"}, {"paperId": "ee32611350ca1db523100bb05fd183746a96d90a", "title": "Gravity Sub-centroids for Optimal Clustering"}, {"paperId": "8aeef304f1bd390ff9fd544868afbe6850fbb233", "title": "A Novel Classroom Teaching Evaluation Method for Assessing Learning Effectiveness Based on Machine Vision and Neutrosophic Sets A Novel Classroom Teaching Evaluation Method for Assessing Learning Effectiveness Based on Machine Vision and Neutrosophic Sets"}, {"paperId": "69eba7bd9e33e2345cea180c014c8a1762f7e3c3", "title": "Enhancing Document Clustering with Hybrid Recurrent Neural Networks and Autoencoders: A Robust Approach for E ff ective Semantic Organization of Large Textual Datasets"}]}
