{"paperId": "8159dc7bce11fdb404b43b06fd6e33cb2f02b5e0", "publicationVenue": {"id": "decf6508-caea-45e7-803f-5a3f8420ac34", "name": "Geofluids", "type": "journal", "issn": "1468-8115", "url": "https://www.hindawi.com/journals/Geofluids/", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/14688123"]}, "title": "Simulation Analysis of Influencing Factors of Subsidence Based on Mining under Huge Loose Strata: A Case Study of Heze Mining Area, China", "abstract": "Based on the coal seam mining under the condition of thick soil layer, the mechanical mining subsidence process under the condition of thick soil layer was analyzed. Combined with the results of core drilling and laboratory test in the mining area, the mechanical analysis of the special transition strata of “hard soil-soft rock” at the bottom of the soil layer was carried out. Additionally, the characteristics of the shallow buried soil layer were compared and analyzed. Furthermore, the significance of this transitional font to the surface subsidence law was proposed. By using the numerical simulation software of FLAC3D and choosing the thickness of “hard soil-soft rock” transitional font as the influencing factor, a model was established and the surface subsidence characteristics of different stratum combinations were numerically simulated. The research results show that the transitional font is the special strata indicating that the hard soil is transiting to the soft rock, having a significant effect on the ground movement and deformation induced by coal mining. It cannot be designated into the loose strata. Also, it cannot be regarded as the bed rock to study the influence of it on the surface subsidence. The “hard soil-soft rock” transitional font has the support effect on the overlying strata during coal seam mining, which can restrict the surface subsidence. Furthermore, the larger the thickness of the transitional font is, the more obvious the restricting effect of it on the surface subsidence is. Meantime, this restricting effect will not be changed with the variation of the proportion between the loss bed and the bed rock thickness. Only the restricting extent is a little different.", "venue": "Geofluids", "year": 2020, "fieldsOfStudy": ["Geology"], "publicationTypes": null, "publicationDate": "2020-06-12", "journal": {"name": "Geofluids"}, "authors": [{"authorId": "1390544451", "name": "Xianxiang Zhu"}, {"authorId": "96986765", "name": "Wenquan Zhang"}, {"authorId": "1820790054", "name": "Zaiyong Wang"}, {"authorId": "2144523625", "name": "Chenghao Wang"}, {"authorId": "2157336325", "name": "Wei Li"}, {"authorId": "2146411150", "name": "Changhao Wang"}], "citations": [{"paperId": "dc148d4c5fea65764df57f6ce32eb1b59f1b47de", "title": "Influence of Coal Mining on Historical Buildings: Case Study in Shanxi"}, {"paperId": "98606d8050209ad44d971f76488587bf9545af91", "title": "Analysis of Overburden Deformation and Migration under Huge Thick Unconsolidated Layers Based on Multiple Approaches"}, {"paperId": "b08eb6d637d6b94a2a7f3c3c444225edbfac15da", "title": "Land subsidence calculation model under the coupling effect of groundwater and coal mining"}, {"paperId": "edc62bb62c143a243c522c5911b7b028c9df45f9", "title": "Research on the Prediction Model of Mine Subsidence Based on Object-Oriented and Probability Integration Method"}, {"paperId": "9f9f4608193f56b4a65a1ce008ac4d1028b67e5c", "title": "Predicting Mining Areas Deformations under the Condition of High Strength and Depth of Cover"}, {"paperId": "c01f152027b855dc44cda5d4ffd763613af4e98c", "title": "Content and gradation of aggregates effect on compaction property of gangue backfill and strata movement: experiments and models"}, {"paperId": "95fdd2ff52e9a22a049ff55d7330db3e16e46318", "title": "Roof Subsidence and Movement Law of Composite Strata Mining: Insights from Physical and Numerical Modeling"}, {"paperId": "deba40e3b7c74666dc61bb1522862ffb6c95a756", "title": "Research on the establishment of a mining subsidence prediction model under thick loose layer and its parameter inversion method"}]}
