{"paperId": "8166f9476a82f313e924dc74c0c5e3f1ce1212ba", "publicationVenue": null, "title": "An Expert Uncertainty in Healthcare Using Materialized View through Big-Query", "abstract": "One of the greatest data-generating industries is the health care sector, thus we must prepare the way for improved technology implementation that appeals to users. This method uses materialised views to develop adaptive queries and identify connectivity based on terms found in the search criteria. This method helps the user understand the steps to take when querying the technology to find out more information. In order to construct a model that meets user requirements for users to understand the condition of the medical medication analysis and as well as treatment analysis, the fields of health and the materialised views using Google's big query can be of assistance. An accurate way to evaluate how well a technique is understood will be created by analysing drug-related data and disease symptoms. To establish better health practises, a user or patient must do the following. The OLAP technique is an outdated method of comprehending the data aggregation, and other models, such as business intelligence and ETL (Extract, Transform, Load), will aid the model in comprehending the inner feelings of the keywords that are being used in the implementation of health care. The optimization method employing Big Query can strengthen the model to comprehend the data's insights.", "venue": "2023 Third International Conference on Advances in Electrical, Computing, Communication and Sustainable Technologies (ICAECT)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-01-05", "journal": {"name": "2023 Third International Conference on Advances in Electrical, Computing, Communication and Sustainable Technologies (ICAECT)", "pages": "1-5"}, "authors": [{"authorId": "2193824499", "name": "Popuri Srinivasarao"}, {"authorId": "46676806", "name": "A. Satish"}, {"authorId": "2217466499", "name": "K. Revathi"}], "citations": []}
