{"paperId": "816fab7767a89aea86541625d296ea0d2bedf87b", "publicationVenue": {"id": "91a2a93e-8a9e-44bd-8c3e-4e6941f31a5d", "name": "Revista Brasileira de Computação Aplicada", "alternate_names": ["Rev Bras Comput Apl"], "issn": "2176-6649", "url": "http://www.upf.br/seer/index.php/rbca"}, "title": "A survey of the characteristics of SDN, NFV and information security in IoT and 5G networks", "abstract": "Background, The 5G technology has emerged as a trusted source to meet the increased demand of Internet of Things (IoT) devices, in addition to enabling Internet connectivity at high broadband speeds. Another important feature of 5G is the use of techniques such as Software Defined Networking (SDN) and Network Functions Virtualization (NVF), mechanisms responsible for performing network configurations through software, in addition to massive control and management of devices using the network configuration functions or device virtualization. Results, The concern with information security in the 5G network is increasing, as cybercriminals try to access important data that is transported over the network, since the demand for connected IoT devices will be greater, thus allowing for several possibilities of attacks. The understanding of possible threats and attacks is necessary, so that new measures are taken against cybercrimes presented in the 5G and IoT networks. Conclusions, This paper aims to elucidate some conceptions of what 5G technology is and the use of IoT in this network, contextualizing the SDN and NFV techniques to allow the configuration of the functionality and management of the network by software. In addition, concerns will be reported about possible information security attacks that may occur in 5G.", "venue": "Revista Brasileira de Computação Aplicada", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-11-27", "journal": {"name": "Revista Brasileira de Computação Aplicada"}, "authors": [{"authorId": "2272857686", "name": "Roger William Coêlho"}, {"authorId": "2750821", "name": "E. Leonardo"}, {"authorId": "1919270", "name": "L. A. F. Martimiano"}, {"authorId": "52179213", "name": "Ronan Assumpção Silva"}], "citations": []}
