{"paperId": "81756901f2bcfb26e471576434793d713175e962", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Random Partition Based Adaptive Distributed Kernelized SVM for Big Data", "abstract": "In this paper, we present a distributed classification technique for big data by efficiently using distributed storage architecture and data processing units of a cluster. While handling such large data, the existing approaches consider specific data partitioning techniques which demand complete data be processed before partitioning. This leads to an excessive overhead of high computation and data communication. The proposed method does not require any pre-structured data partitioning technique and is also adaptive to big data mining tools. We hypothesize that an effective aggregation of the information generated from data partitions by subprocesses of the complete learning process can lead to accurate prediction results while reducing the overall time complexity. We build three SVM based classifiers, namely one phase voting SVM (1PVSVM), two phase voting SVM (2PVSVM), and similarity based SVM (SIMSVM). Each of these classifiers utilizes the support vectors as the local information to construct the synthesized learner for efficiently reducing the training time and ensuring minimal communication between processing units. In this context, an extensive empirical analysis demonstrates the effectiveness of our classifiers when compared to other existing approaches on several benchmark datasets. However, among existing methods and three of our proposed (1PVSVM, 2PVSIM, and SIMSVM) methods, SIMSVM is the most efficient. Considering MNIST dataset, SIMSVM achieves an average speedup ratio of 0.78 and minimum scalability of 73% when the data size is scaled up to 10 times. It also retains high accuracy (99%) similar to centralized approaches.", "venue": "IEEE Access", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "95623-95637", "volume": "10"}, "authors": [{"authorId": "9308970", "name": "Amrit Pal"}, {"authorId": "8633562", "name": "Abishi Chowdhury"}, {"authorId": "2138537077", "name": "Satakshi"}, {"authorId": "145618791", "name": "Husnu S. Narman"}, {"authorId": "40272208", "name": "Arkabandhu Chowdhury"}, {"authorId": "48387892", "name": "Manish Kumar"}], "citations": [{"paperId": "a46e9da6a1ec77106972d35fc092df70ca18afcd", "title": "A Novel Hybrid Fingerprint-Based Indoor Localization Scheme with Hierarchical Training"}]}
