{"paperId": "81a87dc4ad6b563cf0a9873c18b21c33f322dea8", "publicationVenue": {"id": "79ca3e12-1e1d-4da8-9915-54a393e8c512", "name": "International Journal of Electrical and Computer Engineering (IJECE)", "type": "journal", "alternate_names": ["Int J Electr Comput Eng", "Int J Electr Comput Eng (IJECE", "International Journal of Electrical and Computer Engineering"], "issn": "2088-8708", "url": "http://iaesjournal.com/online/index.php/IJECE/issue/archive"}, "title": "Survey on detecting and preventing web application broken access control attacks", "abstract": "Web applications are an essential component of the current wide range of digital services proposition including financial and governmental services as well as social networking and communications. Broken access control vulnerabilities pose a huge risk to that echo system because they allow the attacker to circumvent the allocated permissions and rights and perform actions that he is not authorized to perform. This paper gives a broad survey of the current research progress on approaches used to detect access control vulnerabilities exploitations and attacks in web application components. It categorizes these approaches based on their key techniques and compares the different detection methods in addition to evaluating their strengths and weaknesses. We also spotted and elaborated on some exciting research gaps found in the current literature, Finally, the paper summarizes the general detection approaches and suggests potential research directions for the future.", "venue": "International Journal of Electrical and Computer Engineering (IJECE)", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2024-02-01", "journal": {"name": "International Journal of Electrical and Computer Engineering (IJECE)"}, "authors": [{"authorId": "2266942544", "name": "Ahmed Anas"}, {"authorId": "2266973354", "name": "Salwa Elgamal"}, {"authorId": "2200712201", "name": "B. Youssef"}], "citations": []}
