{"paperId": "81be1e917d64c614f7f7d5dbd9e5c859abaab7fb", "publicationVenue": null, "title": "A domain specific language for business transaction processing", "abstract": "Business transactions are entities in the business world which have high importance and relevance. Business transaction processing systems lack ease of usability and acceptability among those who work on defining transactions for business processes. The major reason behind this is the difficulty in understanding the business processing framework provided by these systems and the adept programming skills required to work on them. Thus new challenges and barriers seem to come up in this area. This work tries to overcome this problem, by introducing a domain specific language called XBRL which brings down the level of programming knowledge required to work on business transaction systems. This can help the the business domain experts in implementing complex business transactions without learning complex programming languages. The XBRL language is developed using Eclipse Framework Xtext and programming language Xtend. This framework gives better efficiency than any general purpose language in terms of complexity of programming. It also provides a set of features like domain specific content-assist, validator and quickfix suggestions. The XBRL language can be easily extended for using in newer domains like big data processing and machine learning, which can enable business transaction processing systems to handle transactions involving huge volumes of data. This paper describes the implementation, features, capabilities and expandability of a newly developed domain specific language called XBRL.", "venue": "2017 IEEE International Conference on Signal Processing, Informatics, Communication and Energy Systems (SPICES)", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2017-08-01", "journal": {"name": "2017 IEEE International Conference on Signal Processing, Informatics, Communication and Energy Systems (SPICES)", "pages": "1-7"}, "authors": [{"authorId": "2139188528", "name": "K. Neeraj"}, {"authorId": "145169257", "name": "P. Janardhanan"}, {"authorId": "9724436", "name": "Anu Bonia Francis"}, {"authorId": "2059375516", "name": "Reena Murali"}], "citations": [{"paperId": "e3adce2cdcf0a7adc337134634971f8fc6186836", "title": "Guaranteeing Sound Reactions to Long-Tailed Changes: A Syntax-Directed Annotation Approach"}, {"paperId": "63ba4ef02c2c914f2c8a2b81a5836cf99678ed14", "title": "ERPL: A Language for Structuring Business Processes in ERP Systems"}, {"paperId": "94d22c61ff4b76eb53defcd5023e81a5f75d1829", "title": "On the Use of Metaprogramming and Domain Specific Languages: An Experience Report in the Logistics Domain"}]}
