{"paperId": "81c50b0ec0bab0892f6dc8fe09765d7ae59478cc", "publicationVenue": {"id": "08fad3a9-3a40-4fa4-bef7-173563de983b", "name": "European Journal of Electrical Engineering and Computer Science", "type": "journal", "alternate_names": ["Eur J Electr Eng Comput Sci"], "issn": "2506-9853", "url": "https://www.ejece.org/index.php/ejece"}, "title": "Improving the Efficiency of Medical Malpractice Attorneys in Collecting, Processing, and Analyzing Data Via a Software-Assisted Solution", "abstract": "Technology enables more complicated problems to be solved quicker and at lower costs by lowering the labor. Technology is also assisting in the development of decision-making through the gathering and analysis of enormous volumes of data. Everywhere, technology is utilized to address difficult problems, yet for some reason, the medical malpractice sector lags far behind since doing so implies risk. Big Data is the most recent development in information technology, and Artificial Intelligence can imitate human intelligence processes in machines. Big Data delivers speed, precision, and efficiency. This paper has presented a solution based on artificial intelligence and big data analytics tools to assist medical malpractice attorneys greatly reduce time spent on collecting, processing, and analyzing data during manual legal research process. This software solution can successfully address the underlying problem of legal research process which takes longer time by medical malpractice attorneys. This paper has shown how to combine historical court cases, legal texts, rules and regulations, and social media can be gathered, examined, and analyzed via the prospective algorithms.", "venue": "European Journal of Electrical Engineering and Computer Science", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-02-12", "journal": {"name": "European Journal of Electrical Engineering and Computer Science"}, "authors": [{"authorId": "2284250793", "name": "Girija Sahoo"}, {"authorId": "2284335394", "name": "Yanzhen Qu"}], "citations": []}
