{"paperId": "81d5dca139d04c1bc5a18f3897340ffdf68362e2", "publicationVenue": {"id": "12cf261e-f151-4062-8f3d-93679fa07009", "name": "Advanced Energy Materials", "type": "journal", "alternate_names": ["Adv Energy Mater"], "issn": "1614-6832", "url": "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1614-6840", "alternate_urls": ["https://onlinelibrary.wiley.com/page/journal/16146840/homepage/productinformation.html"]}, "title": "Synergistic Integration of Nanogenerators and Solar Cells: Advanced Hybrid Structures and Applications", "abstract": "The rapid growth of global energy consumption and the increasing demand for sustainable and renewable energy sources have urged vast research into harnessing energy from various sources. Among them, the most promising approaches are nanogenerators (NGs) and solar cells (SCs), which independently offer innovative solutions for energy harvesting. This review paper presents a comprehensive analysis of the integration of NGs and SCs, exploring advanced hybrid structures and their diverse applications. First, an overview of the principles and working mechanisms of NGs and SCs is provided for seamless hybrid integrations. Then, various design strategies are discussed, such as piezoelectric and triboelectric NGs with different types of SCs. Finally, a wide range of applications are explored that benefit from the synergistic integration of NGs and SCs, including self‐powered electronics, wearable devices, environmental monitoring, and wireless sensor networks. The potential for these hybrid systems is highlighted to address real‐world energy needs and contribute to developing sustainable and self‐sufficient technologies. In conclusion, this review provides valuable insights into the state‐of‐the‐art developments in NGs and SCs integration, shedding light on advanced hybrid structures and their diverse applications.", "venue": "Advanced Energy Materials", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2024-02-26", "journal": {"name": "Advanced Energy Materials"}, "authors": [{"authorId": "94068601", "name": "S. Hajra"}, {"authorId": "2280284894", "name": "Amanat Ali"}, {"authorId": "2054910704", "name": "Swati Panda"}, {"authorId": "2288041286", "name": "Heewoon Song"}, {"authorId": "88739834", "name": "P. M. Rajaitha"}, {"authorId": "2238840656", "name": "Deepak Dubal"}, {"authorId": "2288003449", "name": "Ana Borras"}, {"authorId": "2003803648", "name": "Pichaya In-na"}, {"authorId": "9286442", "name": "N. Vittayakorn"}, {"authorId": "11916087", "name": "V. Vivekananthan"}, {"authorId": "9852365", "name": "Hoe-Joon Kim"}, {"authorId": "2163461029", "name": "S. Divya"}, {"authorId": "2287975309", "name": "Tae Hwan Oh"}], "citations": []}
