{"paperId": "81e1447fca819a361bb19a17347273ada48f8b27", "publicationVenue": null, "title": "G-HBase: A High Performance Geographical Database Based on HBase", "abstract": "With the recent explosion of geographic data generated by smartphones, sensors, and satellites, a data storage that can handle the massive volume of data and support high-computational spatial queries is becoming essential. Although key-value stores efficiently handle large-scale data, they are not equipped with effective functions for supporting geographic data. To solve this problem, in this paper, we present G-HBase, a high-performance geographical database based on HBase, a standard keyvalue store. To index geographic data, we first use Geohash as the rowkey in HBase. Then, we present a novel partitioning method, namely binary Geohash rectangle partitioning, to support spatial queries. Our extensive experiments on real datasets have demonstrated an improved performance with k nearest neighbors and range query in G-HBase when compared with SpatialHadoop, a state-of-the-art framework with native support for spatial data. We also observed that performance of spatial join in G-HBase is on par with SpatialHadoop and outperforms SJMR algorithm in HBase. key words: HBase, high performance, spatial index, GeoHash, BGR Partitioning", "venue": "IEICE Trans. Inf. Syst.", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-04-01", "journal": {"name": "IEICE Trans. Inf. Syst.", "pages": "1053-1065", "volume": "101-D"}, "authors": [{"authorId": "2349959", "name": "H. Lê"}, {"authorId": "144752372", "name": "A. Takasu"}], "citations": [{"paperId": "3b5325634156f6128cb6b68cc93690d70165e111", "title": "GridMesa: A NoSQL-based big spatial data management system with an adaptive grid approximation model"}, {"paperId": "5e5934627ae91bc636734a1ee249a1413f854fa5", "title": "Historiographical Study of the Evolution of the Geocoding Systems with Equiangular Tessellation"}, {"paperId": "48d467619f66ccf0daa8f193c6ff449e3b9ac008", "title": "Z-ordered Range Refinement for Multi-dimensional Range Queries"}, {"paperId": "73b0acc88e3e17305576c4454fd98ec1746ca831", "title": "Optimizing segmented trajectory data storage with HBase for improved spatio-temporal query efficiency"}, {"paperId": "158add2dcac3ff74c969b24e9db127c0c2d06293", "title": "HGST: A Hilbert-GeoSOT Spatio-Temporal Meshing and Coding Method for Efficient Spatio-Temporal Range Query on Massive Trajectory Data"}, {"paperId": "bd563aaffada778cf8712c8f79080cdad7de34ea", "title": "A Trajectory Big Data Storage Model Incorporating Partitioning and Spatio-Temporal Multidimensional Hierarchical Organization"}, {"paperId": "c3df6d2a45e3a333a77fb0cf86e3557b7564b468", "title": "A Map Tile Data Access Model Based on the Jump Consistent Hash Algorithm"}, {"paperId": "0d77c5578eca3ce256137850b49e3b652e2f3654", "title": "An adaptive geographic meshing and coding method for remote sensing data"}, {"paperId": "87dc61d3a9bda20a5470b99d1cf21953f7346ac5", "title": "State-of-the-Art Geospatial Information Processing in NoSQL Databases"}, {"paperId": "d5b5c02013cd243688e0edbaede1faf5b1bc37e7", "title": "Distributed Spatiotemporal Indexes for Querying and Mining in Key-Value Stores"}, {"paperId": "80f4e43efa03fa469c817bb06c3b8187b4d5ce91", "title": "Parallelizing top-k frequent spatiotemporal terms computation on key-value stores"}, {"paperId": "fe8b3d9f0bbe761f35c53351adf5fe1a4f1d9dc5", "title": "A Comprehensive Study of HBase Storage Architecture - A Systematic Literature Review"}, {"paperId": "01458da3d3902e6ccd4b8af92cd22553596da923", "title": "Performance Evaluation of IoT Data Management Using MongoDB Versus MySQL Databases in Different Cloud Environments"}]}
