{"paperId": "81fd5c28fdbe6ced7f2212f6276668d7b99519da", "publicationVenue": {"id": "4d1bd24e-40dd-4bef-ac43-cae491a0b11d", "name": "Fractal and Fractional", "alternate_names": ["Fractal Fract"], "issn": "2504-3110", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-1077177", "alternate_urls": ["https://www.mdpi.com/journal/fractalfract", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-1077177"]}, "title": "An End-to-End Underwater-Image-Enhancement Framework Based on Fractional Integral Retinex and Unsupervised Autoencoder", "abstract": "As an essential low-level computer vision task for remotely operated underwater robots and unmanned underwater vehicles to detect and understand the underwater environment, underwater image enhancement is facing challenges of light scattering, absorption, and distortion. Instead of using a specific underwater imaging model to mitigate the degradation of underwater images, we propose an end-to-end underwater-image-enhancement framework that combines fractional integral-based Retinex and an encoder–decoder network. The proposed variant of Retinex aims to alleviate haze and color distortion in the input image while preserving edges to a large extent by utilizing a modified fractional integral filter. The encoder–decoder network with channel-wise attention modules trained in an unsupervised manner to overcome the lack of paired underwater image datasets is designed to refine the output of the Retinex. Our framework was evaluated under qualitative and quantitative metrics on several public underwater image datasets and yielded satisfactory enhancement results on the evaluation set.", "venue": "Fractal and Fractional", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-01-09", "journal": {"name": "Fractal and Fractional"}, "authors": [{"authorId": "2152845709", "name": "Yang Yu"}, {"authorId": "2200098471", "name": "Chenfeng Qin"}], "citations": [{"paperId": "2c2840ebee8bd140796f4d51e7f9fd519c3b5c69", "title": "A novel image multitasking enhancement model for underwater crack detection"}, {"paperId": "200e53bc0453f53b1f93aee4aa1c683eda7015e8", "title": "Multi-cues underwater image restoration algorithm combined with light field technology"}]}
