{"paperId": "81feb8e5b8c2045f06c93f567422f561f49e5e17", "publicationVenue": {"id": "a5f453f0-eda4-4acc-b115-1dd1577fec00", "name": "Journal of Marine Engineering & Technology", "type": "journal", "alternate_names": ["Journal of Marine and Engineering Technology", "J Mar Eng Technol", "Journal of Marine Engineering and Technology", "J Mar Eng  Technol"], "issn": "1476-1548", "alternate_issns": ["2791-7134", "2046-4177"], "url": "http://www.tandfonline.com/loi/tmar20", "alternate_urls": ["http://www.tandfonline.com/loi/tmar20?open=14&repitition=0"]}, "title": "Strength and stability studies of ring-stiffened circular cylindrical shells using self-organising maps (SOM) and data mining analysis", "abstract": "ABSTRACT Ring-stiffened circular cylindrical shells are commonly used in many engineering applications. In the present study, the strength and stability characteristics of ring-stiffened circular cylindrical shells are investigated using self-organising map (SOM) technique and multivariate approaches. Stress and critical pressure analysis of ring-stiffened circular cylindrical shells under hydrostatic pressure are obtained from the design guide. Design of experiment (DOE) technique is employed for generating design samples. The information behind these design samples can be studied by the self-organising map (SOM) approach. Multivariate analysis is adopted for post- processing of SOM's results. The clustering of samples can be obtained from the codebook of SOM with the help of multivariate analysis. The samples in different clusters would have their own characteristics. The variable significance in each cluster is examined. The dimensionality reduction approach is used for finding the structure of the data set. A useful visualisation approach, parallel coordinate plot with clustering information, is proposed for visualisation of design samples. Correlations and clustering of variables are also studied by the hierarchical method. The ranking of samples is conducted by minimising the distance to an ‘ideal’ solution in the data set. A final compromises sample is obtained. A numerical example is provided for the illustration of the present analysis.", "venue": "Journal of Marine Engineering & Technology", "year": 2020, "fieldsOfStudy": ["Geology"], "publicationTypes": null, "publicationDate": "2020-01-02", "journal": {"name": "Journal of Marine Engineering & Technology", "pages": "24 - 39", "volume": "19"}, "authors": [{"authorId": "2145432066", "name": "Xuebin Li"}], "citations": [{"paperId": "ef4549b0fa32f28515073dedb04a2794b5d4098c", "title": "Progressive failure analysis of cylindrical shell under hydrostatic pressure based on an extended bond-based peridynamic method"}, {"paperId": "f073ce36273dea588365a9c166d30128ec3af48d", "title": "Prediction of the Stability of the Loaded Rock Based on the Acoustic Emission Characteristics of the Loaded Rock Based on Data Mining"}, {"paperId": "6685f7a5760db00475910e9e7f414193154be51f", "title": "A semi-analytical analysis of strength and critical buckling behavior of underwater ring-stiffened cylindrical shells"}]}
