{"paperId": "82037478bfb4743b702d4270a2beffbeb955c49a", "publicationVenue": {"id": "2216cafa-e724-48f0-a497-f46a99605f1e", "name": "Land", "type": "journal", "issn": "2073-445X", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-321184", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-321184", "https://www.mdpi.com/journal/land"]}, "title": "Estimation of Landslide and Mudslide Susceptibility with Multi-Modal Remote Sensing Data and Semantics: The Case of Yunnan Mountain Area", "abstract": "Landslide and mudslide susceptibility predictions play a crucial role in environmental monitoring, ecological protection, settlement planning, etc. Currently, multi-modal remote sensing data have been used for precise landslide and mudslide disaster prediction with spatial details, spectral information, or terrain attributes. However, features regarding landslide and mudslide susceptibility are often hidden in multi-modal remote sensing images, beyond the features extracted and learnt by deep learning approaches. This paper reports our efforts to conduct landslide and mudslide susceptibility prediction with multi-modal remote sensing data involving digital elevation models, optical remote sensing, and an SAR dataset. Moreover, based on the results generated by multi-modal remote sensing data, we further conducted landslide and mudslide susceptibility prediction with semantic knowledge. Through the comparisons with the ground truth datasets created by field investigation, experimental results have proved that remote sensing data can only enhance deep learning techniques to detect the landslide and mudslide, rather than the landslide and mudslide susceptibility. Knowledge regarding the potential clues about landslide and mudslide, which would be critical for estimating landslide and mudslide susceptibility, have not been comprehensively investigated yet.", "venue": "Land", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-10-20", "journal": {"name": "Land"}, "authors": [{"authorId": "2260962196", "name": "Fan Yang"}, {"authorId": "2260867638", "name": "Xiaozhi Men"}, {"authorId": "2260912330", "name": "Yangsheng Liu"}, {"authorId": "2260868666", "name": "Huigeng Mao"}, {"authorId": "2261058704", "name": "Yingnan Wang"}, {"authorId": "2261085148", "name": "Li Wang"}, {"authorId": "2109009825", "name": "Xiran Zhou"}, {"authorId": "2200157174", "name": "Chong Niu"}, {"authorId": "2111365120", "name": "Xiao Xie"}], "citations": []}
