{"paperId": "8210f6a9b276f954b4bb852c5f9ee73e0f23d3b7", "publicationVenue": {"id": "29b9c461-963e-4d11-b2ab-92c182243942", "name": "IEEE Symposium on Security and Privacy", "type": "conference", "alternate_names": ["S&P", "IEEE Symp Secur Priv"], "url": "http://www.ieee-security.org/"}, "title": "IVD: Automatic Learning and Enforcement of Authorization Rules in Online Social Networks", "abstract": "Authorization bugs, when present in online social networks, are usually caused by missing or incorrect authorization checks and can allow attackers to bypass the online social network's protections. Unfortunately, there is no practical way to fully guarantee that an authorization bug will never be introduced—even with good engineering practices—as a web application and its data model become more complex. Unlike other web application vulnerabilities such as XSS and CSRF, there is no practical general solution to prevent missing or incorrect authorization checks. In this paper we propose Invariant Detector (IVD), a defense-in-depth system that automatically learns authorization rules from normal data manipulation patterns and distills them into likely invariants. These invariants, usually learned during the testing or pre-release stages of new features, are then used to block any requests that may attempt to exploit bugs in the social network's authorization logic. IVD acts as an additional layer of defense, working behind the scenes, complementary to privacy frameworks and testing. We have designed and implemented IVD to handle the unique challenges posed by modern online social networks. IVD is currently running at Facebook, where it infers and evaluates daily more than 200,000 invariants from a sample of roughly 500 million client requests, and checks the resulting invariants every second against millions of writes made to a graph database containing trillions of entities. Thus far IVD has detected several high impact authorization bugs and has successfully blocked attempts to exploit them before code fixes were deployed.", "venue": "IEEE Symposium on Security and Privacy", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2017-05-01", "journal": {"name": "2017 IEEE Symposium on Security and Privacy (SP)", "pages": "1094-1109"}, "authors": [{"authorId": "39470595", "name": "P. Marinescu"}, {"authorId": "17072147", "name": "Chad Parry"}, {"authorId": "2522299", "name": "Marjori Pomarole"}, {"authorId": "2152947658", "name": "Yuan Tian"}, {"authorId": "2331637", "name": "P. Tague"}, {"authorId": "2763385", "name": "I. Papagiannis"}], "citations": [{"paperId": "81a87dc4ad6b563cf0a9873c18b21c33f322dea8", "title": "Survey on detecting and preventing web application broken access control attacks"}, {"paperId": "8a99dab86b59b755ed394216b65b07e6f4d25edc", "title": "Access Control for Database Applications: Beyond Policy Enforcement"}, {"paperId": "544a7dfebb5ec911f24e8e7ee3fb3a3f0ce254f5", "title": "Adaptive ABAC Policy Learning: A Reinforcement Learning Approach"}, {"paperId": "ef8f94735ba8fe9d3cc8ab36a4bc0df83685f340", "title": "Self-Patch: Beyond Patch Tuesday for Containerized Applications"}, {"paperId": "aedf19fddf7e51e096e4008fa0af1db67ef8189b", "title": "An Automatic Attribute-Based Access Control Policy Extraction From Access Logs"}, {"paperId": "c8c12385ae2d31ce241c0a96cdb3295ba167ab1d", "title": "A Technical Evaluation of Neo4j and Elasticsearch for Mining Twitter Data"}, {"paperId": "5c7fa9054619d1db0c9943f8c5400f61e40e7944", "title": "A survey of intrusion detection techniques"}, {"paperId": "0766b4d4977e09769f797a43933914099c19f72c", "title": "Evolutionary Search for Authorization Vulnerabilities in Web Applications"}, {"paperId": "65dc5e38f83e7f59e221246ca8fd7a090aa0185c", "title": "DELF: Safeguarding deletion correctness in Online Social Networks"}, {"paperId": "2ae107a094d688d1aca7d68f5f0656bb5f504946", "title": "Automation of Authorisation Vulnerability Detection in Authenticated Web Applications"}, {"paperId": "e36ae4d80202c0ca02dec9fcda89715ffb6a42ad", "title": "Qapla: Policy compliance for database-backed systems"}]}
