{"paperId": "82201597cc7e351531ecd8d7a4615e8a3a271871", "publicationVenue": null, "title": "Streaming information integration unit for mass customization", "abstract": "With the development of the information industry, there are a large number of software systems in enterprises. Due to the lack of top-level design, the data assets in these systems have formed data silos. Under the trend of mass customization production, it is of great significance to combine factory manufacturing data with user data to connect traditional information silos into user-centric intelligent production lines. Traditional offline batch processing tools cannot real-time and automated decision-making in mass customization. Based on the streaming programming model and distributed computing technology, this paper proposes a streaming information integration unit for mass-customized industrial Internet platforms. This unit provides information sharing capabilities in the process of enterprise information management, eliminates information blind spots in the service and workshop layers, and integrates internal information resources of the enterprise. Through the realization of two-way real-time transmission of production information, the user experience is improved and the delivery cycle of mass customization is shortened. In addition, data acquisition tests are performed using factory line temperature sensor data. The experimental results show that compared with the traditional batch processing scheme, the acquisition delay of this scheme is much lower than that of traditional batch processing tools, which provides a feasible solution for information integration in mass customization systems.", "venue": "IOP Conference Series: Materials Science and Engineering", "year": 2020, "fieldsOfStudy": ["Computer Science", "Physics"], "publicationTypes": ["Conference"], "publicationDate": "2020-03-31", "journal": {"name": "IOP Conference Series: Materials Science and Engineering", "volume": "768"}, "authors": [{"authorId": "2119061199", "name": "Liu Yang"}, {"authorId": "2400436", "name": "Xiangqian Ding"}, {"authorId": "9083202", "name": "Ruichun Hou"}, {"authorId": "2105709747", "name": "Ye Tao"}, {"authorId": "2075332166", "name": "Ning Yang"}], "citations": []}
