{"paperId": "8221357325c0ea1cc45c825e264a77ba220d2f83", "publicationVenue": {"id": "911e7332-8ea8-4e9d-bc20-5572a2523f92", "name": "International Middleware Conference", "type": "conference", "alternate_names": ["Middleware", "ACM/IFIP/USENIX int conf Middlew", "ACM/IFIP/USENIX international conference on Middleware", "Int Middlew Conf"], "url": "https://dl.acm.org/conference/middleware/proceedings"}, "title": "FLIPS: Federated Learning using Intelligent Participant Selection", "abstract": "This paper presents the design and implementation of FLIPS, a middleware system to manage data and participant heterogeneity in federated learning (FL) training workloads. In particular, we examine the benefits of label distribution clustering on participant selection in federated learning. FLIPS clusters parties involved in an FL training job based on the label distribution of their data apriori, and during FL training, ensures that each cluster is equitably represented in the participants selected. FLIPS can support the most common FL algorithms, including FedAvg, FedProx, FedDyn, FedOpt and FedYogi. To manage platform heterogeneity and dynamic resource availability, FLIPS incorporates a straggler management mechanism to handle changing capacities in distributed, smart community applications. Privacy of label distributions, clustering and participant selection is ensured through a trusted execution environment (TEE). Our comprehensive empirical evaluation compares FLIPS with random participant selection, as well as three other \"smart\" selection mechanisms -- Oort [51], TiFL [15] and gradient clustering [27] using four real-world datasets, two different non-IID distributions and three common FL algorithms (FedYogi, FedProx and FedAvg). We demonstrate that FLIPS significantly improves convergence, achieving higher accuracy by 17-20 percentage points with 20-60% lower communication costs, and these benefits endure in the presence of straggler participants.", "venue": "International Middleware Conference", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2023-08-07", "journal": {"name": "Proceedings of the 24th International Middleware Conference"}, "authors": [{"authorId": "2262079748", "name": "R. Bhope"}, {"authorId": "143863352", "name": "K. R. Jayaram"}, {"authorId": "1732742", "name": "N. Venkatasubramanian"}, {"authorId": "2152638957", "name": "Ashish Verma"}, {"authorId": "18730445", "name": "Gegi Thomas"}], "citations": [{"paperId": "c220b4e9a467bcfbad4104def216256f415ce0e8", "title": "Solution Simplex Clustering for Heterogeneous Federated Learning"}]}
