{"paperId": "8230e7c24680db7f0818f9d834f5d9a454ab548d", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "A Review on the Immediate Advancement of the Internet of Things in Wireless Telecommunications", "abstract": "Internet of Things is emerging as an incredible future technology to improve the existing lifestyle from the research community, industry, and the public sector. The main intention of IoT is to create an efficient, interactive, and autonomous infrastructure for a safer and healthier world. Moreover, it grows faster day-to-day with the support of many other technologies, i.e. Cloud computing, Blockchain, Wireless Body Sensor Networks, Nanotechnology, and Artificial Intelligence for smart applications, including healthcare, environment, automotive industries, transportation, agriculture, etc. Nevertheless, managing big data is one of the challenging tasks due to the increased number of devices leading to various serious issues like security, privacy, accuracy, latency, scheduling, etc. Further, specific infrastructures with remarkable techniques are required to analyze the bulk of raw data to progress the quality of life and allow timely intervention through various capabilities, i.e., data capture, unique identification, actuation, communication, data mining, etc. In past literature, numerous reviews/surveys are presented that explore the technologies mentioned above as standalone and application specific. However, this paper aims to integrate all the mentioned technologies and deliver a clear vision to future researchers (newcomers) as a kick-start article to boost up and understand the status of the existing research through a comprehensive review of the Internet of Things and its evolution in wireless telecommunications from a general perspective. The most significant challenges and issues are highlighted to research further in these evolving domains.", "venue": "IEEE Access", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "21020-21048", "volume": "11"}, "authors": [{"authorId": "3091832", "name": "K. A. Bakar"}, {"authorId": "29834520", "name": "F. Zuhra"}, {"authorId": "1742165527", "name": "Babangida Isyaku"}, {"authorId": "49384008", "name": "Sapiah Sulaiman"}], "citations": [{"paperId": "2dd07b0fc22e0206ecacf77bfaf2c11db03a508e", "title": "Throughput Maximization in Cellular Networks With Wireless Backhaul and Energy Harvesting"}, {"paperId": "e27619a57fcfc18f0a1d48a4fb0802faeb8742bf", "title": "Dynamic Multi-Attribute Security Permission Management for Edge Devices in Power Internet of Things"}, {"paperId": "319bb9b17647ade96b23878e81caea20a53cf667", "title": "A Survey on IoT Task Offloading Decisions in Multi-access Edge Computing: A Decision Content Perspective"}, {"paperId": "7f9b62b6a231327650464a178019c0f7b9d63af8", "title": "Analysis and Improvement on an Authentication Scheme for Wireless Sensor Networks in Internet of Things Environment"}, {"paperId": "040abbdca762736348dcd6511fce3cbb3b6c0b83", "title": "Performance Comparison of Machine Learning Classifiers for DDOS Detection and Mitigation on Software Defined Networks"}]}
