{"paperId": "82313ad81d45c6805ea226eda23dc50629addde6", "publicationVenue": {"id": "4b287a90-4cd2-44ad-8edb-c670c48a64b3", "name": "Geological Journal", "type": "journal", "alternate_names": ["Geol J"], "issn": "0072-1050", "alternate_issns": ["1025-6814"], "url": "http://eu.wiley.com/WileyCDA/WileyTitle/productCd-GJ.html", "alternate_urls": ["http://geojournal.igs-nas.org.ua/", "https://onlinelibrary.wiley.com/journal/10991034", "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1099-1034", "http://www3.interscience.wiley.com/cgi-bin/jhome/1903"]}, "title": "Landslide susceptibility prediction modelling based on semi‐supervised XGBoost model", "abstract": "In the process of landslide susceptibility prediction (LSP) modelling, there are some problems in the model dataset relating to landslide and non‐landslide samples, such as landslide sample errors, subjective randomness and low accuracy of non‐landslide sample selection. In order to solve the above problems, a semi‐supervised machine learning model for LSP is innovatively proposed. Firstly, Yanchang County of Shanxi Province, China, is taken as the study area. Secondly, the frequency ratio values of 12 environmental factors (elevation, slope, aspect, etc.) and the randomly selected twice non‐landslides are used to form the initial model datasets. Thirdly, an extreme gradient boosting (XGBoost) model is adopted for training and testing the initial datasets, so as to produce initial landslide susceptibility maps (LSMs) which are divided into very low, low, moderate, high and very high susceptibility levels. Next, the landslide samples in initial LSMs with very low and low susceptibility levels are excluded to improve the accuracy of landslide samples, and the unlabelled twice non‐landslide samples in initial LSMs with low and very low susceptibility levels are randomly selected to ensure the accuracy of non‐landslide samples. These new obtained landslide and non‐landslide samples are reimported into XGBoost model to construct the semi‐supervised XGBoost (SSXGBoost) model. Finally, accuracy, kappa coefficient and statistical indexes of susceptibility indexes are adopted to assess the LSP performance of XGBoost and SSXGBoost models. Results show that SSXGBoost model has remarkably better LSP performance than that of XGBoost model. Conclusively, the proposed SSXGBoost model effectively overcomes the problems that the accuracy of landslide samples needs to be further improved and that non‐landslide samples are difficult to select accurately.", "venue": "Geological Journal", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-03-08", "journal": {"name": "Geological Journal"}, "authors": [{"authorId": "2283177209", "name": "Qiangqiang Shua"}, {"authorId": "2290852732", "name": "Hongbin Peng"}, {"authorId": "2283197573", "name": "Jingkai Li"}], "citations": []}
