{"paperId": "8235eda00c10273655a7c6a2f56b49416e64e9b3", "publicationVenue": null, "title": "Edge Computing Based Resource Supplementation for Software Defined Vehicular Networks", "abstract": "Next-generation vehicular networks based on autonomous vehicles would be expected to support a wide array of applications. This would entail the creation of an environment that would be capable of providing infrastructure support that balances the communication and computation overheads. The particular characteristics of traditional vehicular networks, such as high mobility, processing delay, limited response time are the bottlenecks for effective resource utilization which can cause several safety and non safety related issues. Vehicular Edge Computing has emerged as a promising solution for overcoming these constraints by providing the fast computation and processing capabilities. Therefore, this paper proposes a software-defined vehicular networks-based edge management scheme that uses vehicles at traffic light crossroad junctions. An effective resource supplementation scheme is also formulated that delivers additional infrastructure for applications through created edge networks. Resources of vehicles waiting for a green signal at different junctions are used to create the virtual edge networks. Infrastructure-based static primary edge nodes are deployed at each junction to communicate with respective native edges using vehicular communication in a distributed manner. The performance of the proposed scheme is analyzed using NS3, and the obtained simulation results show superior resource supplementation concerning comparative benchmarks.", "venue": "2022 IEEE Globecom Workshops (GC Wkshps)", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-12-04", "journal": {"name": "2022 IEEE Globecom Workshops (GC Wkshps)", "pages": "1693-1698"}, "authors": [{"authorId": "2187519654", "name": "Shilpi Mittal"}, {"authorId": "2140022323", "name": "Deepanshu Garg"}, {"authorId": "2269500", "name": "R. S. Bali"}, {"authorId": "8880101", "name": "G. Aujla"}], "citations": [{"paperId": "e37ffd30df8a68e64864385d1aaad55e7443636c", "title": "Federated Learning Based Task Orchestration Scheme Using Intelligent Vehicular Edge Networks"}]}
