{"paperId": "8237c9db4dbeda194d5f776e3e59d7e9565a6ce7", "publicationVenue": {"id": "8506a01a-40b8-4e6f-bbb8-ce2492139c15", "name": "International Journal of Molecular Sciences", "type": "journal", "alternate_names": ["Int J Mol Sci"], "issn": "1422-0067", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-157693", "alternate_urls": ["https://www.mdpi.com/journal/ijms", "http://www.mdpi.com/journal/ijms/", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-157693"]}, "title": "NanoLC-EI-MS: Perspectives in Biochemical Analysis", "abstract": "Although LC-MS with atmospheric pressure ionization (API) sources is the primary technique used in modern bioanalytical studies, electron ionization mass spectrometry (EI-MS) can provide some substantial advantages over it. EI-MS is a matrix effect-free technique that provides reproducible and comparable mass spectra, serving as a compound fingerprint for easy identification through automated comparison with spectral libraries. Leveraging EI-MS in biochemical studies can yield critical analytical benefits for targeted and untargeted analyses. However, to fully utilize EI-MS for heavy and non-volatile molecules, a new technology that enables the coupling of liquid chromatography with EI-MS is needed. Recent advancements in nanoLC have addressed the compatibility issues between LC and EI-MS, and innovative interfacing strategies such as Direct-EI, liquid electron ionization (LEI), and Cold-EI have extended the application of EI-MS beyond the determination of volatile organic molecules. This review provides an overview of the latest developments in nanoLC-EI-MS interfacing technologies, discussing their scope and limitations. Additionally, selected examples of nanoLC-EI-MS applications in the field of biochemical analysis are presented, highlighting the potential prospects and benefits that the establishment of this technique can bring to this field.", "venue": "International Journal of Molecular Sciences", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2023-07-01", "journal": {"name": "International Journal of Molecular Sciences", "volume": "24"}, "authors": [{"authorId": "2051341588", "name": "Natalia Gabrielly Pereira dos Santos"}, {"authorId": "11713171", "name": "E. Maciel"}, {"authorId": "1413772292", "name": "D. A. Vargas Medina"}, {"authorId": "12774889", "name": "F. Lanças"}], "citations": []}
