{"paperId": "824f4b5662a5e433c58e5c2da58de8c40e952fd6", "publicationVenue": null, "title": "Industry 4.0 Technologies for Smart Manufacturing: A Systematic Review of Machine Learning Methods for Predictive Maintenance", "abstract": "The automotive sector, which has a significant impact on economic and social growth, has been a driving force behind the development of Industry 4.0 and its associated technologies such as Smart Production, Smart Manufacturing, and the Internet of Things (IoT). One important area of focus within Industry 4.0 is the use of machine learning (ML) algorithms and predictive maintenance (PdM) methods to optimize manufacturing tool performance. With the advent of digital convergence and communication networks, it is now possible to collect vast amounts of process and performance data from different parts of manufacturing tools and use this data for diagnostic and automatic fault detection to reduce downtime and increase component utilization rates. This work provides a brief review of current developments in machine learning methods that are broadly useful for PdM in smart manufacturing within the context of Industry 4.0. The study categorizes research based on ML algorithms and focuses on the future prediction of temperature using time series and multivariate analysis techniques. By highlighting the state-of-the-art advances in ML and PdM for smart manufacturing, this paper aims to contribute to the ongoing effort to enhance manufacturing processes and improve competitiveness in the industry.", "venue": "2023 International Conference on Self Sustainable Artificial Intelligence Systems (ICSSAS)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference", "Review"], "publicationDate": "2023-10-18", "journal": {"name": "2023 International Conference on Self Sustainable Artificial Intelligence Systems (ICSSAS)", "pages": "397-403"}, "authors": [{"authorId": "2249104247", "name": "Madhurima Sharma"}, {"authorId": "2273641047", "name": "Manu Sharma"}, {"authorId": "2273641049", "name": "Mohnish Sharma"}, {"authorId": "2270176511", "name": "Kuldeep Singh Yadav"}, {"authorId": "2270115486", "name": "Shailja Shukla"}], "citations": [{"paperId": "480e640856ff9626e92b4cd7c7b261f061607a04", "title": "Towards an extension of Fault Trees in the Predictive Maintenance Scenario"}]}
