{"paperId": "825fc08a4da9079febfe203eafa36fd9dd6122dd", "publicationVenue": {"id": "8ecc7f6b-513e-420d-9531-255b48a99a8a", "name": "Micromachines", "type": "journal", "issn": "2072-666X", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-165882", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-165882", "https://www.mdpi.com/journal/micromachines"]}, "title": "Translational MEMS Platform for Planar Optical Switching Fabrics", "abstract": "While 3-D microelectromechanical systems (MEMS) allow switching between a large number of ports in optical telecommunication networks, the development of such systems often suffers from design, fabrication and packaging constraints due to the complex structures, the wafer bonding processes involved, and the tight alignment tolerances between different components. In this work, we present a 2-D translational MEMS platform capable of highly efficient planar optical switching through integration with silicon nitride (SiN) based optical waveguides. The discrete lateral displacement provided by simple parallel plate actuators on opposite sides of the central platform enables switching between different input and output waveguides. The proposed structure can displace the central platform by 3.37 µm in two directions at an actuation voltage of 65 V. Additionally, the parallel plate actuator designed for closing completely the 4.26 µm air gap between the fixed and moving waveguides operates at just 50 V. Eigenmode expansion analysis shows over 99% butt-coupling efficiency the between the SiN waveguides when the gap is closed. Also, 2.5 finite-difference time-domain analysis demonstrates zero cross talk between two parallel SiN waveguides across the length of the platform for a 3.5 µm separation between adjacent waveguides enabling multiple waveguide configuration onto the platform. Different MEMS designs were simulated using static structural analysis in ANSYS. These designs were fabricated with a custom process by AEPONYX Inc. (Montreal, QC, Canada) and through the PiezoMUMPs process of MEMSCAP (Durham, NC, USA).", "venue": "Micromachines", "year": 2019, "fieldsOfStudy": ["Medicine", "Materials Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-06-30", "journal": {"name": "Micromachines", "volume": "10"}, "authors": [{"authorId": "2109862524", "name": "Suraj Sharma"}, {"authorId": "30862887", "name": "Niharika Kohli"}, {"authorId": "30349867", "name": "Jonathan Brière"}, {"authorId": "145405207", "name": "M. Ménard"}, {"authorId": "1750659", "name": "F. Nabki"}], "citations": [{"paperId": "35f69090e356e7df1909b388d101ca21a5499350", "title": "Multi Degrees-of-Freedom Hybrid Piezoelectric-Electrostatic MEMS Actuators Integrated With Displacement Sensors"}, {"paperId": "74faf9d1648de2da04cfcd8a05ecb4d03491a192", "title": "Hybrid MEMS Actuator With 3 Degrees-of- Freedom for Efficient Planar Optical Switching"}, {"paperId": "a37ec6d2a5e650a3da7eb64c58b06b3dcf5bfa22", "title": "Broadband 1 x 4 Silicon Nitride Photonic Switch Fabricated on a Hybrid Electrothermal and Electrostatic MEMS Platform"}, {"paperId": "8aca90d968d3b236dc957a7603835bf38b9d741c", "title": "Aluminum Nitride Out-of-Plane Piezoelectric MEMS Actuators"}, {"paperId": "6e5fb0b40128205984bce95a836acdfc310747e2", "title": "Vertical Electrostatic MEMS Aligner with Integrated Silicon Nitride Optical Waveguides"}, {"paperId": "d32612e12f34b29c6c366e63ea44d063493763d0", "title": "A SOI Out-of-Plane Electrostatic MEMS Actuator Based on In-Plane Motion"}, {"paperId": "67529945d81c798a0bdb71036bb5d37155e6b847", "title": "Demonstration of Heterogeneous Structure for Fabricating a Comb-Drive Actuator for Cryogenic Applications"}, {"paperId": "4e127d6a224d97c07b731c2c13f29a8ebece4b18", "title": "Surface Micromachined Out-of-plane Electrostatic MEMS Actuator Integrated with Displacement Sensor"}, {"paperId": "dff58f0d582ab79adb23c8426fbaae5a3d127b24", "title": "Tunable terahertz metamaterial using electrostatically electric split-ring resonator"}, {"paperId": "ba5594feabbda081c294906d88b61e54818d355a", "title": "Editorial for the Special Issue on Silicon Photonics Bloom"}, {"paperId": "b7f54b4683e5107cdfd47fe402083ae0df65a81f", "title": "CMOS-compatible, piezo-optomechanically tunable photonics for visible wavelengths and cryogenic temperatures."}]}
