{"paperId": "826ca832bd5842862dccb703d3af02019abdff96", "publicationVenue": {"id": "b147e0ad-dec8-401c-87b9-3ff4c341adf3", "name": "Software Language Engineering", "type": "conference", "alternate_names": ["SLE", "Softw Lang Eng"]}, "title": "Executing certified model transformations on Apache Spark", "abstract": "Formal reasoning on model transformation languages allows users to certify model transformations against contracts. CoqTL includes a specification of a transformation engine in the Coq interactive theorem prover. An executable engine can be automatically extracted from this specification. Transformation contracts are proved by the user against the CoqTL specification and guaranteed to hold on the transformation running on the extracted implementation of CoqTL. The design of the transformation engine specification in CoqTL aims at easing the certification step, but this requirement harms the execution performance of the extracted engine. In this paper, we aim at providing a scalable distributed implementation of the CoqTL specification. To achieve this objective we proceed in two steps. First, we introduce a refined specification of CoqTL that increases the engine parallelization. We present a mechanized proof of the equivalence with standard CoqTL. Second, we develop a prototype implementation of the refined specification on top of Spark. Finally, by evaluating the performance of a simple case study, we assess the speedup our solution can reach.", "venue": "Software Language Engineering", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2021-10-17", "journal": {"name": "Proceedings of the 14th ACM SIGPLAN International Conference on Software Language Engineering"}, "authors": [{"authorId": "31933880", "name": "Jolan Philippe"}, {"authorId": "2532798", "name": "M. Tisi"}, {"authorId": "1802900", "name": "Héléne Coullon"}, {"authorId": "1702306", "name": "G. Sunyé"}], "citations": [{"paperId": "4a99de8b49190bb89ee63bcd2fe491125ef02d3a", "title": "Towards Verified Scalable Parallel Computing with Coq and Spark"}]}
