{"paperId": "8274819c3146f00b2d8501b4de2b586c3d956f3f", "publicationVenue": {"id": "c2eeb1be-38e9-4a0a-a89d-957f4fd71ea1", "name": "IEEE Transactions on Intelligent Vehicles", "alternate_names": ["IEEE Trans Intell Veh"], "issn": "2379-8858", "url": "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=7274857"}, "title": "DRL-Based Computation Offloading With Queue Stability for Vehicular-Cloud-Assisted Mobile Edge Computing Systems", "abstract": "Computation offloading is considered as a promising method to improve computation performance of Intelligent Vehicles (IVs), where IVs can offload resource-hungry applications to Mobile Edge Computing (MEC) servers. However, due to the dynamic environment of Intelligent Transportation Systems, it's challenging to develop an effective offloading scheme that ensures stable operation of the system. Furthermore, IVs only offload tasks to MEC servers or parked vehicles, how to take full advantage of resources in a random traffic flow is a main challenge. In this paper, we propose a vehicular-cloud-assisted MEC network in urban cities to fully explore the idle resources and ensure the stability of task queue. Specifically, we develop a novel virtual platform based on deep neural network that predicts vehicles trajectory and creates vehicular cloud to integrate computation resources. We then design a vehicular-cloud-assisted offloading scheme that aims to maximize task throughput in continuous time slots subject to multi-constraint. To address the coupling among multiple variables and different time slots, we put forward a lightweight framework to apply the Lyapunov optimization in combination with deep reinforcement learning. In particular, we apply Lyapunov drift-plus-penalty approach to decompose the initial problem into per-slot subproblems and control the long-term task queue stability. To further reduce the computation complexity, we decouple the subproblem into three processes, and the deep Q-network is put forward to solve it. Extensive simulations demonstrate that under different task arrivals, our proposed scheme can achieve the task queue stability within 10 time slots with a low transmission power.", "venue": "IEEE Transactions on Intelligent Vehicles", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-04-01", "journal": {"name": "IEEE Transactions on Intelligent Vehicles", "pages": "2797-2809", "volume": "8"}, "authors": [{"authorId": "14825447", "name": "Guifu Ma"}, {"authorId": "2108202291", "name": "Xiaowei Wang"}, {"authorId": "3196996", "name": "Manjiang Hu"}, {"authorId": "2205355442", "name": "Wenjie Ouyang"}, {"authorId": "2144203930", "name": "Xiaolong Chen"}, {"authorId": "98177814", "name": "Y. Li"}], "citations": [{"paperId": "270222a2f76768921e7ed952abc9152b9e6ea3f4", "title": "Multi-Objective Optimization Using Adaptive Distributed Reinforcement Learning"}, {"paperId": "8ae768589f5bc24b68ed20ae1d663d5c4e951c11", "title": "Efficient vehicular networks offloading using Hybrid Localization Algorithm and Deep Reinforcement Learning"}, {"paperId": "97e19075d5d9ef69b7e52dc7d3a9adb5b9fcd5b9", "title": "EPtask: Deep Reinforcement Learning Based Energy-Efficient and Priority-Aware Task Scheduling for Dynamic Vehicular Edge Computing"}, {"paperId": "8ea9118506e30b18fddabc89810d3cd65ef5ed21", "title": "The Use of Game Theoretic Based Algorithms for Dynamic Resource Allocation in Vehicular Cloud Computing Systems"}, {"paperId": "8337539561a3253dc7d1b7f328abe6025d662bc3", "title": "A Digital Twin-Assisted Intelligent Partial Offloading Approach for Vehicular Edge Computing"}, {"paperId": "78a31e06bbe7837d835ffb9747f8239b36ba8a16", "title": "AoI-Aware UAV-Enabled Marine MEC Networks with Integrated Sensing, Computation, and Communication"}, {"paperId": "ca2dccafc93281dcd7332f1a7a581215d9f5d8c4", "title": "Learning to Hybrid Offload in Space-Air-Ground Integrated Mobile Edge Computing for IoT Networks"}]}
