{"paperId": "827aa4f53afab4aa7fbb3aebdb80735f0e35068f", "publicationVenue": {"id": "801703f5-a310-442a-a58a-41bb05ae1f68", "name": "International Conference on Wirtschaftsinformatik", "type": "conference", "alternate_names": ["WI", "Int Conf Wirtsch", "Web Intell", "IEEE/WIC/ACM Int Conf Web Intell", "IEEE/WIC/ACM International Conference on Web Intelligence", "Web Intelligence"], "url": "https://aisel.aisnet.org/wi/", "alternate_urls": ["http://www.wikicfp.com/cfp/program?id=3061"]}, "title": "Analyzing the role of big data and its effects on the retail industry", "abstract": "The expansion of social media, technology, and online shopping will eventually speed up massive development of retail industry. Retailing organizations are trying to figure out how the usage of big data analysis may enable them to make the correct decisions as we see Big Data as one of the buzzwords sweeping the IT world by force. Therefore, the current study’s objective is to investigate and assess the function of big data and its consequences on the retail business with the support of employees and managers from the Indian retail sector. The main factors covered in the study include big data technologies like data sources, data analysis, data storage, data security and privacy, real-time processing, and messaging system. This study employs a quantitative technique and performs Partial Least Square Structural Equation Modeling (PLS-SEM) to analyze the effects of big data in the retail sector The study findings revealed that data analysis, real-time processing, and messaging system significantly impact the performance of the retail industry whereas, data source, data storage, and data security and privacy do not significantly impact the performance of the retail industry. Various aspects discussed in the study revolving around big data technology are important factor and demands the maximum attention of the organization such as inventory utilization, customer involvement, and current value in the retail sector. The study recommends that in order to succeed, businesses of all sizes must make sure they are competitive. As internet businesses engage with their customers in real time, the rivalry heats up. Big Data analysis may benefit merchants in the following ways.", "venue": "International Conference on Wirtschaftsinformatik", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-01-17", "journal": {"name": "Web Intelligence"}, "authors": [{"authorId": "2280605695", "name": "Kameswari"}, {"authorId": "2279638302", "name": "P. Ramesh"}, {"authorId": "2196163969", "name": "Veena Bhavikatti"}, {"authorId": "2279635886", "name": "B. Omnamasivaya"}, {"authorId": "2279636260", "name": "Gorli Chaitanya"}, {"authorId": "2280596341", "name": "Tejeswani Bastray"}, {"authorId": "2196129797", "name": "Sony Hiremath"}, {"authorId": "2280598629", "name": "G. S. gondesi"}], "citations": []}
