{"paperId": "827b90820c4319c7b41d272d32b422f0576808fd", "publicationVenue": {"id": "849b6687-df71-4d12-9c46-59f45d5ce951", "name": "IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing", "type": "journal", "alternate_names": ["IEEE J Sel Top Appl Earth Obs Remote Sens"], "issn": "1939-1404", "url": "https://ieeexplore.ieee.org/servlet/opac?punumber=4609443", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4609443"]}, "title": "A New Cloud Computing Architecture for the Classification of Remote Sensing Data", "abstract": "This paper proposes a new distributed architecture for supervised classification of large volumes of earth observation data on a cloud computing environment. The architecture supports distributed execution, network communication, and fault tolerance in a transparent way to the user. The architecture is composed of three abstraction layers, which support the definition and implementation of applications by researchers from different scientific investigation fields. The implementation of architecture is also discussed. A software prototype (available online), which runs machine learning routines implemented on the cloud using the Waikato Environment for Knowledge Analysis (WEKA), a popular free software licensed under the GNU General Public License, is used for validation. Performance issues are addressed through an experimental analysis in which two supervised classifiers available in WEKA were used: random forest and support vector machines. This paper further describes how to include other classification methods in the available software prototype", "venue": "IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2017-02-01", "journal": {"name": "IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing", "pages": "409-416", "volume": "10"}, "authors": [{"authorId": "31016870", "name": "V. A. A. Quirita"}, {"authorId": "144794424", "name": "G. Costa"}, {"authorId": "2222679", "name": "P. Happ"}, {"authorId": "2017816", "name": "R. Feitosa"}, {"authorId": "2067626986", "name": "R. Ferreira"}, {"authorId": "34475405", "name": "Dario Augusto Borges Oliveira"}, {"authorId": "143767945", "name": "A. Plaza"}], "citations": [{"paperId": "5193019ad9b394ff3cf409e9c89cfdd55ce0ae0a", "title": "Exploring the Advancements in High-Performance Computing Paradigm for Remote Sensing Big Data Analytics"}, {"paperId": "483163cb69a88e476a39f87181a6c6abb4e8334b", "title": "A Smart IoT-Based Model to Improve the Agriculture Industry by Sensor Mobile Computing (SMC)"}, {"paperId": "a9f0bc2127792551a4acc6c37669fab5b0fc35ac", "title": "Multi-scale change monitoring of water environment using cloud computing in optimal resolution remote sensing images"}, {"paperId": "460751ecf144adc4d07607b689e85c4d1b8912b1", "title": "DeepPrecip: a deep neural network for precipitation retrievals"}, {"paperId": "f07f0f6fc55a46f394c192e946019af8e1498780", "title": "Parallel Extraction of Marine Targets Applying OIDA Architecture"}, {"paperId": "c7c554ee309f242cd9533bf41647119cb30a5b7d", "title": "A Scalable Computing Resources System for Remote Sensing Big Data Processing Using GeoPySpark Based on Spark on K8s"}, {"paperId": "47fb9adda249080b92f881fa19e5f4ee7632521e", "title": "Parallel and Distributed Computing for Anomaly Detection From Hyperspectral Remote Sensing Imagery"}, {"paperId": "87de3e4809efaf1e87b4a679a1a6efad9be861e9", "title": "Spark-based adaptive Mapreduce data processing method for remote sensing imagery"}, {"paperId": "3ddde4a2223f0b336a3763fa265d448cac311cce", "title": "Scheduling-Guided Automatic Processing of Massive Hyperspectral Image Classification on Cloud Computing Architectures"}, {"paperId": "136c8dd027bebc37d494c575f6702bb58156eb3a", "title": "Data Mining in Cloud Computing: Survey"}, {"paperId": "3caf5c6ac95c8f849750b87f978a4135cb6cd5ab", "title": "Systematic review of deep learning techniques in plant disease detection"}, {"paperId": "e0c07069faa326a50e634ebd39cc6d5cdf3f576c", "title": "A New GPU Implementation of Support Vector Machines for Fast Hyperspectral Image Classification"}, {"paperId": "eee76973eea241ffde45d966a6ae4be36b89f4cb", "title": "Application of Cloud Computing in Product Design"}, {"paperId": "abf89173b9bb0555f860aa698aaa00ee3dc8637c", "title": "Cloud Computing with Heavy CNC Machine Tools"}, {"paperId": "181146ebc8c6c98b2e151bb2d908eba6273441a8", "title": "Application of Semantic Segmentation with Few Labels in the Detection of Water Bodies from Perusat-1 Satellite’s Images"}, {"paperId": "c8cdd589603347088d61f64a4d845bf11dbb6804", "title": "Deep learning classifiers for hyperspectral imaging: A review"}, {"paperId": "e0859657be33c8094a8299c6ac1ed4fec05400c1", "title": "Assessing the pasturelands and livestock dynamics in Brazil, from 1985 to 2017: A novel approach based on high spatial resolution imagery and Google Earth Engine cloud computing"}, {"paperId": "0c0ed92be81bb53b86153d9e9d40bb0a02b75b94", "title": "MAPPING GLACIER CHANGES USING CLUSTERING TECHNIQUES ON CLOUD COMPUTING INFRASTRUCTURE"}, {"paperId": "1f97d7a5c3a2e0b094bf1b805c653516a9f9d52c", "title": "Multi-Core Processing Cloud Eclat Growth"}, {"paperId": "19417d56172ae0500d99e31d3bae3be1036e4c35", "title": "Cloud Deep Networks for Hyperspectral Image Analysis"}, {"paperId": "d9abf92d1da917eb8d01967a060b7a20f7ff2262", "title": "Mapping Ausangate glacier changes using clustering techniques on cloud computing infrastructure"}, {"paperId": "5d3ba34ab0ec095568b97e6025a421b2ace8d2d6", "title": "Online image classification and analysis using OGC web processing service"}, {"paperId": "7ac663a29cbf1e5bea467f47c0146d34ef102c84", "title": "Dynamically Scalable Distributed Virtual Framework Based on Agents and Pub/Sub Pattern for IoT Media Data"}, {"paperId": "21d32ecd17d99493054ac16a23e0baeda54e8e16", "title": "An automated and optimized approach for online spatial biodiversity model: a case study of OGC web processing service"}, {"paperId": "c480f89178c1fe4c2bfcba1116238260b5fe5666", "title": "An Efficient and Scalable Framework for Processing Remotely Sensed Big Data in Cloud Computing Environments"}, {"paperId": "c75d592f649f9683f64eeb693556aade0e372e1e", "title": "Proof of concept of a novel cloud computing approach for object-based remote sensing data analysis and classification"}, {"paperId": "406e03afbed909c890fa82fb67d2114be1961aec", "title": "A Distributed Parallel Algorithm Based on Low-Rank and Sparse Representation for Anomaly Detection in Hyperspectral Images"}, {"paperId": "7b41a2b991d578a0df2b41f0918679f403d9e5fb", "title": "Time Performance Analysis of Multi-CPU and Multi-GPU in Big Data Clustering Computation"}, {"paperId": "d39951764ed76758a9e4e9c22654d1954887f666", "title": "Parallel and Distributed Local Fisher Discriminant Analysis to Reduce Hyperspectral Images on Cloud Computing Architectures"}, {"paperId": "6d4531da9fd0cf2d9e35eaffda3605943b776a23", "title": "Secure communication and archiving of low altitude remote sensing data using high capacity fragile data hiding"}, {"paperId": "be28092478faa4df11063fecaef53370de6a29e7", "title": "A review of neural networks in plant disease detection using hyperspectral data"}, {"paperId": "b5412098bd4df4aa2fb38d074f29910ed359e6b4", "title": "An Investigation on Self-Normalized Deep Neural Networks for Hyperspectral Image Classification"}, {"paperId": "fab13173afc2be64d3fb907eaadd6009724141a5", "title": "Optimizing Lifespan and Energy Consumption by Smart Meters in Green-Cloud-Based Smart Grids"}, {"paperId": "1e2ed440ef96b343756a057ffed0625941f34e54", "title": "Exploiting Different Types of Parallelism in Distributed Analysis of Remote Sensing Data"}, {"paperId": "7a533d4f3a7fc10fab239239dad458a09520e61b", "title": "Cloud-Based Analysis of Large-Scale Hyperspectral Imagery for Oil Spill Detection"}, {"paperId": "f45ae70588a286623064f0cbc53f795b3a6eee8d", "title": "A CLOUD BASED ENERGY AND FREQUENCY MONITORING SYSTEM USING IOT FOR THEFT DETECTION AND FORECASTING"}, {"paperId": "1b9ddcebf80bb21d732ee0a2f7b6e1e31cc775da", "title": "Multiobjective Task Scheduling for Energy-Efficient Cloud Implementation of Hyperspectral Image Classification"}, {"paperId": "c08706f28b56a698440af358135490ba684e7862", "title": "Performance Comparison Of The Cloud Optimized Eclat Growth And Multi-Core Processing Cloud Eclat Growth"}, {"paperId": "0a62cf11dc1b1c0b8299259517c304573e553df2", "title": "International Journal of Innovative Technology and Exploring Engineering (IJITEE)"}, {"paperId": "cdb2591572239493271748b9bb9e20c3a0b5b0e1", "title": "International Journal of Innovative Technology and Exploring Engineering (IJITEE)"}, {"paperId": "7a3a76ffa338eaa165a4e7ea55c05befa1c03597", "title": "Application of data mining techniques in cloud computing: A literature review"}, {"paperId": "a2299347a4124d07fbc591eb52dcb982d3cefce1", "title": "EFFICIENT ENERGY CONSUMPTION IN CLOUD LOAD BALANCING AND CONSOLIDATION USING MAX -MIN ANT COLONY OPTIMIZATION"}, {"paperId": "db6d5d5be763c1f4aff4f72590a98d2264a45c6b", "title": "Cloud Computing - An Overview of Architectures, Security Threats and Their Solutions"}]}
