{"paperId": "828bea76bed32e0e16e7a0cf9949a606244414f0", "publicationVenue": {"id": "a00fde74-d8df-4613-b825-0fff9f531d3f", "name": "IEEE Transactions on Network and Service Management", "type": "journal", "alternate_names": ["IEEE Trans Netw Serv Manag"], "issn": "1932-4537", "url": "http://ejournals.ebsco.com/direct.asp?JournalID=714200", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4275028", "http://ieeexplore.ieee.org/servlet/opac?punumber=4275028"]}, "title": "Diversity-by-Design for Dependable and Secure Cyber-Physical Systems: A Survey", "abstract": "Diversity-based security approaches have been studied for several decades since the 1970s. The concept of diversity-by-design emerged in the 1980s. Since then, diversity-based system design research has been explored to provide more secure and dependable services in cyber-physical systems (CPSs). In this work, we are particularly interested in providing an in-depth, comprehensive survey of existing diversity-based approaches, their insights, and associated future work directions for building secure and dependable CPSs. This will allow us to provide promising ways of providing quality network and services based on key diversity-by-design principles for those who want to conduct research on developing secure and dependable CPSs using diversity as a system design feature. This survey paper mainly provides: (i) The common concept of diversity based on its multidisciplinary nature along with the historical evolution of the concept of diversity-by-design for providing secure and dependable services; (ii) the key diversity-by-design principles; (iii) the key benefits and caveats of using the diversity-by-design; (iv) the main concerns of CPS environments utilizing the diversity-by-design; (v) an extensive survey and discussions of existing diversity-based approaches based on five different classifications; (vi) the types of attacks considered by diversity-based approaches; (vii) the overall trends of evaluation methodologies used for diversity-based approaches, in terms of metrics, datasets, and testbeds; and (viii) the insights, lessons, and gaps identified from this extensive survey and future work directions.", "venue": "IEEE Transactions on Network and Service Management", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2020-07-16", "journal": {"name": "IEEE Transactions on Network and Service Management", "pages": "706-728", "volume": "19"}, "authors": [{"authorId": "2139528527", "name": "Qisheng Zhang"}, {"authorId": "2112710701", "name": "A. Mohammed"}, {"authorId": "116992328", "name": "Zelin Wan"}, {"authorId": "2779190", "name": "Jin-Hee Cho"}, {"authorId": "3189746", "name": "T. Moore"}], "citations": [{"paperId": "a3ddecf805d052e1627d7302d77fcc8299e2b590", "title": "DAEDALUS: Defense Against Firmware ROP Exploits Using Stochastic Software Diversity"}, {"paperId": "4c680dea243c3b5d3a3ef4148a987470251a244e", "title": "Cutting Medusa's Path - Tackling Kill-Chains with Quantum Computing"}, {"paperId": "0a53d0c2cf30766fd403516ee6db1b62d9348765", "title": "Network Resilience Under Epidemic Attacks: Deep Reinforcement Learning Network Topology Adaptations"}, {"paperId": "71aaf19a3d290ad83b70ebe27176209bbb1ed34e", "title": "ANOMALY DETECTION IN CYBER-PHYSICAL SYSTEMS USING EXPLAINABLE ARTIFICIAL INTELLIGENCE AND MACHINE LEARNING"}]}
