{"paperId": "8296d073c9b1435a3f82c0e92fcb7369ae293395", "publicationVenue": null, "title": "Configurable Distributed Data Management for the Internet of the Things", "abstract": "One of the main challenges in modern Internet of Things (IoT) systems is the efficient collection, routing and management of data streams from heterogeneous sources, including sources with high ingestion rates. Despite the existence of various IoT data streaming frameworks, there is still no easy way for collecting and routing IoT streams in efficient and configurable ways that are easy to be implemented and deployed in realistic environments. In this paper, we introduce a programmable engine for Distributed Data Analytics (DDA), which eases the task of collecting IoT streams from different sources and accordingly, routing them to appropriate consumers. The engine provides also the means for preprocessing and analysis of data streams, which are two of the most important tasks in Big Data analytics applications. At the heart of the engine lies a Domain Specific Language (DSL) that enables the zero-programming definition of data routing and preprocessing tasks. This DSL is outlined in the paper, along with the middleware that supports its runtime execution. As part of the paper, we present the architecture of the engine, as well as the digital models that it uses for modelling data streams in the digital world. We also discuss the validation of the DDA in several data intensive IoT use cases in industrial environments, including use cases in pilot productions lines and in several real-life manufacturing environments. The latter manifest the configurability, programmability and flexibility of the DDA engine, as well as its ability to support practical applications.", "venue": "Inf.", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-11-20", "journal": {"name": "Inf.", "pages": "360", "volume": "10"}, "authors": [{"authorId": "51447665", "name": "Nikos Kefalakis"}, {"authorId": "2078312", "name": "Aikaterini Roukounaki"}, {"authorId": "2060010", "name": "J. Soldatos"}], "citations": [{"paperId": "e640470f70491027d7f6535214847ac264c61304", "title": "End-to-end industrial IoT platform for Quality 4.0 applications"}, {"paperId": "a749af20bd0f2271eab3f7f6fd96373e638d174e", "title": "An overview of big data analysis"}, {"paperId": "2c58a1ac0c1ebdbac07b8def7ea98d5448a4249a", "title": "Predictive and Explainable Machine Learning for Industrial Internet of Things Applications"}, {"paperId": "d60ae895468d67186df467a84c74519e8eaeedf2", "title": "End-to-End Industrial IoT Platform for Actionable Predictive Maintenance"}]}
