{"paperId": "82b2d10bc8b44008ab5b6ebabe6cd8201e945d72", "publicationVenue": null, "title": "Critical factors for a successful Big Data adoption in Morocco's Transport and Logistics Sector: An exploratory case study of Logistics Service Provider", "abstract": "Purpose - This paper aims to identify the Critical Success Factors (CSFs) for the Big Data adoption in Morocco's Transport and Logistics Sector (TLS) through an exploratory case study of Moroccan Logistics Service Provider (LSP) specializing in Big Data and Analytics consulting for Logistics and Supply Chain Management (SCM). Design/methodology/approach - This paper utilized a qualitative method of research using an exploratory case study, employing interviews, observation of the areas of intervention, and several services and projects provided by LSP. A semi-structured interview was conducted to provide opinions on the use of Big Data Analytics (BDA) and to explore the influential CSFs on Big Data adoption in Morocco's TLS. Findings - Based on the exploratory case study, we outline some suggestions related to the challenges and obstacles to Big Data adoption in Morocco's TLS. Some of these suggestions are in line with what the literature survey has been examining. Originality/value - This paper provides two original contributions. The first contribution is to identify the influential key factors for a Big Data project's success in Morocco's TLS. The second contribution asks specifically about the role of LSPs in stimulating the Big Data adoption in Morocco's TLS.", "venue": "2022 14th International Colloquium of Logistics and Supply Chain Management (LOGISTIQUA)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-05-25", "journal": {"name": "2022 14th International Colloquium of Logistics and Supply Chain Management (LOGISTIQUA)", "pages": "1-8"}, "authors": [{"authorId": "118903309", "name": "Tarik Talii"}, {"authorId": "79589541", "name": "Razane Chroqui"}], "citations": []}
