{"paperId": "82b30ecd1997d4f0032710e49ce5eb36c4d72d61", "publicationVenue": {"id": "228761ec-c40a-479b-8309-9dcbe9851bcd", "name": "IEEE Internet of Things Journal", "type": "journal", "alternate_names": ["IEEE Internet Thing J"], "issn": "2327-4662", "url": "https://www.ieee.org/membership-catalog/productdetail/showProductDetailPage.html?product=PER288-ELE", "alternate_urls": ["https://ieeexplore.ieee.org/servlet/opac?punumber=6488907", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6488907", "http://ieee-iotj.org/#"]}, "title": "pAElla: Edge AI-Based Real-Time Malware Detection in Data Centers", "abstract": "The increasing use of Internet-of-Things (IoT) devices for monitoring a wide spectrum of applications, along with the challenges of “big data” streaming support they often require for data analysis, is nowadays pushing for increased attention to the emerging edge computing paradigm. In particular, smart approaches to manage and analyze data directly on the network edge, are more and more investigated, and artificial intelligence (AI)-powered edge computing is envisaged to be a promising direction. In this article, we focus on data centers (DCs) and supercomputers (SCs), where a new generation of high-resolution monitoring systems is being deployed, opening new opportunities for analysis like anomaly detection and security, but introducing new challenges for handling the vast amount of data it produces. In detail, we report on a novel lightweight and scalable approach to increase the security of DCs/SCs, which involves AI-powered edge computing on high-resolution power consumption. The method—called pAElla—targets real-time malware detection (MD), it runs on an out-of-band IoT-based monitoring system for DCs/SCs, and involves power spectral density of power measurements, along with autoencoders. Results are promising, with an F1-score close to 1, and a false alarm and malware miss rate close to 0%. We compare our method with State-of-the-Art (SoA) MD techniques and show that, in the context of DCs/SCs, pAElla can cover a wider range of malware, significantly outperforming SoA approaches in terms of accuracy. Moreover, we propose a methodology for online training suitable for DCs/SCs in production, and release open data set and code.", "venue": "IEEE Internet of Things Journal", "year": 2020, "fieldsOfStudy": ["Computer Science", "Engineering", "Mathematics"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-04-07", "journal": {"name": "IEEE Internet of Things Journal", "pages": "9589-9599", "volume": "7"}, "authors": [{"authorId": "3458839", "name": "Antonio Libri"}, {"authorId": "2241007", "name": "Andrea Bartolini"}, {"authorId": "1710649", "name": "L. Benini"}], "citations": [{"paperId": "863513d01cef44f233b6a8635b1ec3605040afbf", "title": "MalBuster: Scalable, Real-Time, and Concept Drift-Adaptive Malware Detection for Smart Environments"}, {"paperId": "b5a8bf67dd8226459cc7230ab5d72a04e23750c7", "title": "The Security and Privacy of Mobile-Edge Computing: An Artificial Intelligence Perspective"}, {"paperId": "cc97f49c268d46c5d29ac9d751e45a0d33e4334b", "title": "Deep Note: Can Acoustic Interference Damage the Availability of Hard Disk Storage in Underwater Data Centers?"}, {"paperId": "f12edcc4b0f28fb80524c7c967b03e08095b9e32", "title": "Load Balancing With Deadline-Driven Parallel Data Transmission in Data Center Networks"}, {"paperId": "35e7cc2f836eab3b5eaef6315ff0399570fe6264", "title": "Enhanced Performance of Finitie Boundary Isolation Forest (FBIF) for Datasets with Standard Distribution Properties"}, {"paperId": "c49217bafca6ff7c3e26c028296223a67076df13", "title": "Malware Detection Using Machine Learning on Edge Devices"}, {"paperId": "66ef2f0c8e787915df371e320705288b28fcac3d", "title": "Monte Cimone: Paving the Road for the First Generation of RISC-V High-Performance Computers"}, {"paperId": "b56a507ffdc139af018608452fc7856f1784a730", "title": "Possible Applications of Edge Computing in the Manufacturing Industry—Systematic Literature Review"}, {"paperId": "b680ad562d3582e00f3695c31d6d9a6efeee1d17", "title": "Artificial intelligence Internet of Things: A new paradigm of distributed sensor networks"}, {"paperId": "482a4d02e7fb2a7110f3650a0f58c1d693343c65", "title": "LightLog: A lightweight temporal convolutional network for log anomaly detection on the edge"}, {"paperId": "46452d708eedf2ff7092c2dc6b88428b4bea0433", "title": "Büyük Veri Ortamlarında Zararlı Yazılım Tespiti Kapsamında Makine Öğrenmesi Algoritmalarının Performansının İncelenmesi"}, {"paperId": "496cee4fa24ef324224572d0d72906ec7b1b906c", "title": "QoE-Aware Traffic Aggregation Using Preference Logic for Edge Intelligence"}, {"paperId": "88fb99731168db395eccadc8eb37845d29ff059a", "title": "MADDPG-Based Security Situational Awareness for Smart Grid with Intelligent Edge"}, {"paperId": "8255328fe61dd66b9e82627c5e9fa3ec25b31415", "title": "Security and Privacy on 6G Network Edge: A Survey"}, {"paperId": "3c0bbd7cefa0c8d628a7cab08eb7735dae73c521", "title": "A Survey of State-of-the-Art on Edge Computing: theoretical Models, Technologies, Directions, and Development Paths"}]}
