{"paperId": "82cc3cff25679be6243253f79dfed86aa4117ec2", "publicationVenue": {"id": "0d3564f0-947d-4124-b171-400399406075", "name": "IEEE Transactions on Control of Network Systems", "type": "journal", "alternate_names": ["IEEE Trans Control Netw Syst"], "issn": "2325-5870", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=6509490"}, "title": "Relaxed Connected Dominating Set Problem for Power System Cyber–Physical Security", "abstract": "Motivated by power system cyber–physical security applications, this article investigates a variant of the connected dominating set problem called the relaxed connected dominating set (RCDS) problem, where between every two nodes in the solution dominating set there exists a path not traversing two consecutive nodes not in the set. The RCDS problem is NP-hard. To facilitate solving, presolving and problem reduction techniques are developed. In addition, three integer program formulations are obtained using single commodity flow, Dantzig–Fulkerson–Johnson and Miller–Tucker–Zemlin ideas to enforce graph connectedness. For a realistic power network repository (MATPOWER 7) including graphs with 70k nodes, our presolving and reduction procedures simplify problem instances to on average 30% of the original sizes. All reduced instances, when modeled by our formulations, can be solved with optimality gap less than 0.5% within 20 min using a PC with Gurobi 9.", "venue": "IEEE Transactions on Control of Network Systems", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-12-01", "journal": {"name": "IEEE Transactions on Control of Network Systems", "pages": "1780-1792", "volume": "9"}, "authors": [{"authorId": "34988240", "name": "K. C. Sou"}, {"authorId": "2157816134", "name": "Jie Lu"}], "citations": [{"paperId": "b44478497dc6ad3fbed85b78cf98e175bb81b1af", "title": "Observability Defense-Constrained Distribution Network Reconfiguration for Cyber-Physical Security Enhancement"}]}
