{"paperId": "82dc238455489fe13e4f4e92216f6d62c16c9480", "publicationVenue": null, "title": "The Era of Digital Agriculture", "abstract": "The main objective of Multi-access Edge Computing (MEC) is to bring computational capabilities at the edge of the network to better support low-latency applications. Such capabilities are typically offered by Edge Data Centers (EDC). The MEC paradigm is not tied to a single radio technology, rather it embraces both cellular and other radio access technologies such as WiFi. Distributed intelligence at the edge for AI purposes requires careful spatial planning of computing and storage resources. The problem of EDC deployment in urban environments is challenging and, to the best of our knowledge, it has been explored only for cellular connectivity so far. In this paper, we study the possibility of deploying EDC without analyzing the expected data traffic load of the cellular network, a kind of information rarely shared by network operators. To this purpose, we propose in this work CLUB, CLUstering-Based strategy tailored on the analysis of urban mobility. We analyze two experimental mobility data sets, and we analyze some mobility features in order to characterize their properties. Finally, we compare the performance of CLUB against state-of-the-art techniques in terms of the outage probability, namely the probability an EDC is not able to serve a request. Our results show that the CLUB strategy is always comparable with respect to our benchmarks, but without using any information related to network traffic.", "venue": "", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "2286813503", "name": "Fabrizio Falchi"}, {"authorId": "2284823987", "name": "Silvia Giannini"}, {"authorId": "2286813983", "name": "Carol Peters"}, {"authorId": "2284824373", "name": "Claudia Raviolo"}, {"authorId": "2284819207", "name": "Roberto Scopigno"}, {"authorId": "2240555236", "name": "Salvatore Rinzivillo"}, {"authorId": "39284160", "name": "D. Fadda"}, {"authorId": "2286960197", "name": "Beatrice Rapisarda"}], "citations": []}
