{"paperId": "82e42ec3fdb7d76fdd3804b1b18bc01a5ee58cd4", "publicationVenue": {"id": "9448f839-459b-45f3-8573-5eff3f032334", "name": "USENIX Annual Technical Conference", "type": "conference", "alternate_names": ["USENIX Annu Tech Conf", "USENIX", "USENIX ATC"], "url": "https://www.usenix.org/conferences/byname/131"}, "title": "FineStream: Fine-Grained Window-Based Stream Processing on CPU-GPU Integrated Architectures", "abstract": "Accelerating SQL queries on stream processing by utilizing heterogeneous coprocessors, such as GPUs, has shown to be an effective approach. Most works show that heterogeneous coprocessors bring signiﬁcant performance improvement because of their high parallelism and computation capacity. However, the discrete memory architectures with relatively low PCI-e bandwidth and high latency have dragged down the beneﬁts of heterogeneous coprocessors. Recently, hardware vendors propose CPU-GPU integrated architectures that integrate CPU and GPU on the same chip. This integration provides new opportunities for ﬁne-grained cooperation be-tween CPU and GPU for optimizing SQL queries on stream processing. In this paper, we propose a data stream system, called FineStream, for efﬁcient window-based stream processing on integrated architectures. Particularly, FineStream performs ﬁne-grained workload scheduling between CPU and GPU to take advantage of both architectures, and it also provides efﬁcient mechanism for handling dynamic stream queries. Our experimental results show that 1) on integrated architectures, FineStream achieves an average 52% throughput improvement and 36% lower latency over the state-of-the-art stream processing engine; 2) compared to the stream processing engine on the discrete architecture, FineStream on the integrated", "venue": "USENIX Annual Technical Conference", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": null, "journal": {"pages": "633-647"}, "authors": [{"authorId": "2158118667", "name": "Feng Zhang"}, {"authorId": "2155557933", "name": "Lin Yang"}, {"authorId": "2188004", "name": "Shuhao Zhang"}, {"authorId": "143824511", "name": "Bingsheng He"}, {"authorId": "2153424287", "name": "Wei Lu"}, {"authorId": "144589756", "name": "Xiaoyong Du"}], "citations": [{"paperId": "b86c75e2a1edabe452bd73b3afc29cec7f43e0d7", "title": "Accelerating network analytics with an on-NIC streaming engine"}, {"paperId": "3a53ba9f5855e702cd0bc3af34c883d008de0d2e", "title": "SMG: A System-Level Modality Gating Facility for Fast and Energy-Efficient Multimodal Computing"}, {"paperId": "13648e055c16b76822a8e9b53b6ee88ba94ab81e", "title": "SmartNIC-Accelerated Stream Processing Analytics"}, {"paperId": "3f88b30c63cb50478fa45c25629f60314f69b89c", "title": "Enabling Efficient Random Access to Hierarchically Compressed Text Data on Diverse GPU Platforms"}, {"paperId": "edb0c0907548a72220ca375aeda8fe9d2cceea61", "title": "FlowKV: A Semantic-Aware Store for Large-Scale State Management of Stream Processing Engines"}, {"paperId": "081ddd991440c51f614eb366581f40a3d366bc67", "title": "Stream Aggregation with Compressed Sliding Windows"}, {"paperId": "4c0e91e6e8349f462d529d950a41c489427a22e2", "title": "CompressStreamDB: Fine-Grained Adaptive Stream Processing without Decompression"}, {"paperId": "e18093d0e0c21580426d2fc2024547ab1af77af4", "title": "EdgeNN: Efficient Neural Network Inference for CPU-GPU Integrated Edge Devices"}, {"paperId": "3b1aebbba665045854fd2fc2ce4a999f05be487e", "title": "FSP: a Framework for Data Stream Processing Applications targeting FPGAs"}, {"paperId": "c89f2018be6515b77873f198f5862484232aa045", "title": "When the Metaverse Meets Carbon Neutrality: Ongoing Efforts and Directions"}, {"paperId": "5c03e7f2146a80d9917c9761e8337b810a467e99", "title": "Optimizing Random Access to Hierarchically-Compressed Data on GPU"}, {"paperId": "5da4ba5e8df597b15d31012c3ae57594783dfe23", "title": "Comparative Analysis of GPU Stream Processing between Persistent and Non-persistent Kernels"}, {"paperId": "3f6274082da696e91d2155dada93f36f4d38b25f", "title": "Exploring Data Analytics Without Decompression on Embedded GPU Systems"}, {"paperId": "8dfc197273d65924e669283c8cb0c36c0633a55e", "title": "iGPU-Accelerated Pattern Matching on Event Streams"}, {"paperId": "6a8d644fe0420fafa05e2d3778f1fe734cb73fee", "title": "Towards Parallel Data Stream Processing on System-on-Chip CPU+GPU Devices"}, {"paperId": "7d88407d6fa5cd3c428f443e1b6ec7e267c308a3", "title": "Query Processing on Heterogeneous CPU/GPU Systems"}, {"paperId": "4514c62e2da99046fe90f51b5808dec650c3c95f", "title": "STRETCH: Virtual Shared-Nothing Parallelism for Scalable and Elastic Stream Processing"}, {"paperId": "3dcfd10a00bea271f236ec032a8b0c21d6fbe3d3", "title": "WindFlow: High-Speed Continuous Stream Processing With Parallel Building Blocks"}, {"paperId": "5929a2b0b6a256a08917a39bc2ae298cd4759c67", "title": "Fine-Grained Multi-Query Stream Processing on Integrated Architectures"}, {"paperId": "cbf2dbf9249218914aae4cda40e2be014c83386a", "title": "iMLBench: A Machine Learning Benchmark Suite for CPU-GPU Integrated Architectures"}, {"paperId": "b906b82b80bfa010568d68997a1696ca0dba7d63", "title": "Hardware-Conscious Sliding Window Aggregation on GPUs"}, {"paperId": "8a5949348dc16596a3f6a449e8ed4bcb4e6295a1", "title": "G-TADOC: Enabling Efficient GPU-Based Text Analytics without Decompression"}, {"paperId": "4f4e15a96d34e75b08dc330e3a969b3cb651a868", "title": "Performance Analysis of Big Data ETL Process over CPU-GPU Heterogeneous Architectures"}, {"paperId": "ed8b176d882b6452c6ebc66b444868b560bd5793", "title": "Benchmarking Stream Join Algorithms on GPUs: A Framework and its Application to the State-of-the-art"}, {"paperId": "7c6ed0ff29cb7298082527c4cba6f9869097a05b", "title": "Exploring Query Processing on CPU-GPU Integrated Edge Device"}]}
