{"paperId": "82f2e466564db954b990fdda2c52670e442aad15", "publicationVenue": {"id": "6cbed6ad-fb46-4c9a-8477-75227ff3a47e", "name": "International Conference on Blockchain Computing and Applications", "type": "conference", "alternate_names": ["BCCA", "Int Conf Blockchain Comput Appl"], "url": "https://ieeexplore.ieee.org/xpl/conhome/1839124/all-proceedings"}, "title": "Psychological Information Sharing Using Ethereum Blockchain and Smart Contracts", "abstract": "Blockchain technology has increasingly impacted our society across all industries over the last decade. Aside from being one of the most widely used technologies, blockchain not only enables cryptocurrencies with anonymous properties that apply robust information security for consolidating and building trust between users and providers but also provisions a new channel for information sharing. Further, deploying blockchain can in-crease security, privacy, and reliability for data sharing at a low cost. Hence, this paper presents a solution framed by considering the anonymous properties of blockchain with the idea of building a secure and trustworthy platform for sharing personal information. The platform's primary goal is to create a community where information such as psychological data from various stakeholders could be used in related exploratory research. Because of the nature of blockchain, imparting privacy over personal data will not necessarily violate any current ethics with blockchain technology. The architectural design shows the development process's means and the implementation of a unique psychological information-sharing platform. The proposed solution could encourage more people to share their data through blockchain and make it accessible to a broader range of users.", "venue": "International Conference on Blockchain Computing and Applications", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-10-24", "journal": {"name": "2023 Fifth International Conference on Blockchain Computing and Applications (BCCA)", "pages": "561-568"}, "authors": [{"authorId": "2274042346", "name": "Xirong Cao"}, {"authorId": "2266467418", "name": "Mohamed Rahouti"}, {"authorId": "2067322880", "name": "S. Jagatheesaperumal"}, {"authorId": "2253393649", "name": "Kaiqi Xiong"}], "citations": []}
