{"paperId": "82ff9bedce8c90ca69d005e242dae654c4ecc1c5", "publicationVenue": {"id": "7b2adce0-d53f-49d6-8784-b0645604fe62", "name": "ACM Computing Surveys", "type": "journal", "alternate_names": ["ACM Comput Surv"], "issn": "0360-0300", "url": "http://www.acm.org/pubs/surveys/", "alternate_urls": ["http://portal.acm.org/csur", "https://csur.acm.org/", "http://csur.acm.org/"]}, "title": "Machine Learning Applications in Internet-of-Drones: Systematic Review, Recent Deployments, and Open Issues", "abstract": "Deep Learning (DL) and Machine Learning (ML) are effectively utilized in various complicated challenges in healthcare, industry, and academia. The Internet of Drones (IoD) has lately cropped up due to high adjustability to a broad range of unpredictable circumstances. In addition, Unmanned Aerial Vehicles (UAVs) could be utilized efficiently in a multitude of scenarios, including rescue missions and search, farming, mission-critical services, surveillance systems, and so on, owing to technical and realistic benefits such as low movement, the capacity to lengthen wireless coverage zones, and the ability to attain places unreachable to human beings. In many studies, IoD and UAV are utilized interchangeably. Besides, drones enhance the efficiency aspects of various network topologies, including delay, throughput, interconnectivity, and dependability. Nonetheless, the deployment of drone systems raises various challenges relating to the inherent unpredictability of the wireless medium, the high mobility degrees, and the battery life that could result in rapid topological changes. In this paper, the IoD is originally explained in terms of potential applications and comparative operational scenarios. Then, we classify ML in the IoD-UAV world according to its applications, including resource management, surveillance and monitoring, object detection, power control, energy management, mobility management, and security management. This research aims to supply the readers with a better understanding of (1) the fundamentals of IoD/UAV, (2) the most recent developments and breakthroughs in this field, (3) the benefits and drawbacks of existing methods, and (4) areas that need further investigation and consideration. The results suggest that the Convolutional Neural Networks (CNN) method is the most often employed ML method in publications. According to research, most papers are on resource and mobility management. Most articles have focused on enhancing only one parameter, with the accuracy parameter receiving the most attention. Also, Python is the most commonly used language in papers, accounting for 90% of the time. Also, in 2021, it has the most papers published.", "venue": "ACM Computing Surveys", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-11-18", "journal": {"name": "ACM Computing Surveys", "pages": "1 - 45", "volume": "55"}, "authors": [{"authorId": "2063999298", "name": "Arash Heidari"}, {"authorId": "40867497", "name": "Nima Jafari Navimipour"}, {"authorId": "2135061216", "name": "Mehmet Unal"}, {"authorId": "2133617351", "name": "Guodao Zhang"}], "citations": [{"paperId": "34059ccd04127a3fb8a02f667613b85d04bc485f", "title": "Artificial intelligence (AI) advancements for transportation security: in-depth insights into electric and aerial vehicle systems"}, {"paperId": "5b67c9e5d8274ccac33b1400c0f51f2063c2fab4", "title": "Promoting UAV autonomous aerial video to improve cross-cultural understanding, historical knowledge, and students’ perception"}, {"paperId": "7ff6f4b41cf86cbf3f7f0b3e4439df88c8ae9271", "title": "Machine learning for enhancing transportation security: A comprehensive analysis of electric and flying vehicle systems"}, {"paperId": "11f5ded924c35c34b6f30213820193c1d7200052", "title": "Improved YOLOv7 Algorithm for Small Object Detection in Unmanned Aerial Vehicle Image Scenarios"}, {"paperId": "3e19a8481724fba4c66896b2bc337d8e3e485968", "title": "Investigating Novel Approaches to Interactive Communication Media Algorithms for Networking Applications"}, {"paperId": "3efc838cfb28e13d38f9af78451e13fe9f54295c", "title": "The deep learning applications in IoT-based bio- and medical informatics: a systematic literature review"}, {"paperId": "bd567fa2d733d453f215f6b938e37e4ded0a5b9d", "title": "Multiscale leapfrog structure: An efficient object detector architecture designed for unmanned aerial vehicles"}, {"paperId": "2ace2a02a94341c0ef546f3bab28206bd29879c6", "title": "Opportunities and challenges of artificial intelligence and distributed systems to improve the quality of healthcare service."}, {"paperId": "75cb415da4e6dab58fe304e4a74341109ec9c4d8", "title": "Analysis of Artificial Intelligence Technology and Its Application in Improving the Effectiveness of Physical Education Teaching"}, {"paperId": "d0d280a07ef77c588853155d2a6e06035af6d71f", "title": "Meet User’s Service Requirements in Smart Cities Using Recurrent Neural Networks and Optimization Algorithm"}, {"paperId": "097247eae9a5a014ad1e5eb6dc783b43341a3e4a", "title": "Expert teacher based on foundation image segmentation model for object detection in aerial images"}, {"paperId": "259071854684a188d3897878f446bf0cc7247ba9", "title": "UAV Detection and Tracking in Urban Environments Using Passive Sensors: A Survey"}, {"paperId": "a38f2e474dd9a585ac61eb2b0d6b3c6b09a1a92e", "title": "Learning Template-Constraint Real-Time Siamese Tracker for Drone AI Devices via Concatenation"}, {"paperId": "5939ba737e5003bb6b0406622a892def8c6ddb36", "title": "Generalizing Spacecraft Recognition via Diversifying Few-Shot Datasets in a Joint Trained Likelihood"}, {"paperId": "bebaff1283271b832a6d231c66a69a172c963609", "title": "A block chain-based approach using proof of continuous work consensus algorithm to secure the educational records"}, {"paperId": "8e92d0139ba26b3819c0822119dea0bf2c064de5", "title": "The Personal Health Applications of Machine Learning Techniques in the Internet of Behaviors"}, {"paperId": "dc4f210fc458fd6dbe74bcef99286ae5be1ac6f4", "title": "An Intra-Class Ranking Metric for Remote Sensing Image Retrieval"}, {"paperId": "e7660c8ec72499925c379408842b26badd6221cf", "title": "A Novel Ant Colony-inspired Coverage Path Planning for Internet of Drones"}, {"paperId": "2dbc94f8b99a855c9b395eaa9120053cf1930a3d", "title": "The applications of machine learning techniques in medical data processing based on distributed computing and the Internet of Things"}, {"paperId": "341e0b210861cd3a464a514b28fe76dfdf381262", "title": "Internet of things empowering Operations Management; A systematic review based on bibliometric and content analysis"}, {"paperId": "1fc9ef44ad921d0eb00b9212fa50f0da5b648a0b", "title": "Assessing the carbon footprint of soccer events through a lightweight CNN model utilizing transfer learning in the pursuit of carbon neutrality"}, {"paperId": "32b784b2dc110337a3a4df01c167459c4f98b4a3", "title": "Electrophysiology and hyperscanning applied to e-learning for organizational training"}, {"paperId": "2b3ff780db6555d8d39219ee87037821d46f0e86", "title": "Path Planning Algorithms For Unmanned Aerial Vehicle: Classification, Performance, and Implementation"}, {"paperId": "3904a9fe5ed78b556c48c264e9640ff236f4b8c5", "title": "Deep learning based high performance classification architecture for low-altitude aerial images"}, {"paperId": "dfae653a0f84af29d17ee8f342d31f0752b50b9f", "title": "Current security and privacy posture in wireless body area networks"}, {"paperId": "3475e1d2727db9d9cd1a084e10be5062b7081075", "title": "Mobile Edge Computing and Machine Learning in the Internet of Unmanned Aerial Vehicles: A Survey"}, {"paperId": "e7d929c0eee4620b5ed0131ff865304dd1975a49", "title": "Industrial revolution and environmental sustainability: an analytical interpretation of research constituents in Industry 4.0"}, {"paperId": "f53af021d7ae45db4cfe1366a6b87e6704f31403", "title": "A Secure Intrusion Detection Platform Using Blockchain and Radial Basis Function Neural Networks for Internet of Drones"}, {"paperId": "8fe1b09bc98c175992464c7d9d60ee5cc3b8d0af", "title": "Robust Autonomous Vehicle Computer-Vision-Based Localization in Challenging Environmental Conditions"}, {"paperId": "a307f2d0216b58b39c33d72411931a31ffa9e3fd", "title": "Application of graph auto-encoders based on regularization in recommendation algorithms"}, {"paperId": "d3b7dd1ebf5230503482afea2a255b14333e6c16", "title": "Artificial Intelligence, Machine Learning and Deep Learning in Advanced Robotics, A Review"}, {"paperId": "2ec45bacf6822f015dad162967ca7855aef0fdd9", "title": "Recognizing Road Surface Traffic Signs Based on Yolo Models Considering Image Flips"}, {"paperId": "c722e57c36b2e6d60e7661038f91efa8a2ac20d1", "title": "Using IoT Sensor Technologies to Reduce Waste and Improve Sustainability in Artisanal Fish Farming in Southern Brazil"}, {"paperId": "981bf226ee2439ed7512a12d8828951caea451d0", "title": "Quadcopter Drone for Vision-Based Autonomous Target Following"}, {"paperId": "64af351d96a51a7a3da35d3eab48304067f2acee", "title": "Small Fixed-Wing UAV Radar Cross-Section Signature Investigation and Detection and Classification of Distance Estimation Using Realistic Parameters of a Commercial Anti-Drone System"}, {"paperId": "87c2c617fc21e155ce04b8e73e58c04f589652b2", "title": "Machine Learning-Aided Operations and Communications of Unmanned Aerial Vehicles: A Contemporary Survey"}, {"paperId": "30abf734ec471e763efbd72249be524e15028736", "title": "ROAD: Robotics-Assisted Onsite Data Collection and Deep Learning Enabled Robotic Vision System for Identiﬁcation of Cracks on Diverse Surfaces"}, {"paperId": "9c64db8ba980800a9d40535e3ec7fcd052757744", "title": "Future Prospects and Challenges of On-Demand Mobility Management Solutions"}, {"paperId": "cdb03e880e49193e55c2fc9ce2ad4b9e89f07e9d", "title": "Design and Exploration of Real Time Monitoring System for Power Grid Operation Safety Based on YOLO Object Detection Algorithm"}, {"paperId": "b2f7265206d3b211a4aea19ef03c26ebf02105f4", "title": "Two-way Delayed Updates with Model Similarity in Communication-Efficient Federated Learning"}]}
