{"paperId": "830257f86a5ada8b9ef8b907a766d6dd56120b84", "publicationVenue": {"id": "c192003b-48dd-45d7-b737-5ff93540aca3", "name": "Journal of Industrial Information Integration", "type": "journal", "alternate_names": ["J Ind Inf Integr"], "issn": "2452-414X", "url": "https://www.journals.elsevier.com/journal-of-industrial-information-integration/", "alternate_urls": ["https://www.journals.elsevier.com/journal-of-industrial-information-integration", "http://www.sciencedirect.com/science/journal/2452414X"]}, "title": "Supply chain data integration: A literature review", "abstract": null, "venue": "Journal of Industrial Information Integration", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2020-09-01", "journal": {"name": "J. Ind. Inf. Integr.", "pages": "100161", "volume": "19"}, "authors": [{"authorId": "144967378", "name": "António A. C. Vieira"}, {"authorId": "3444055", "name": "L. Dias"}, {"authorId": "2209529137", "name": "M. Y. Santos"}, {"authorId": "143920816", "name": "G. Pereira"}, {"authorId": "145854739", "name": "J. A. Oliveira"}], "citations": [{"paperId": "91329acb74e91a94311a4d4b79282163c3085ccf", "title": "Enabling digital transformation of dynamic location-inventory-routing optimization in natural gas-to-product and energy networks via a domain-adaptable ontological agent-based framework"}, {"paperId": "4bf68f5f0d272515aca8d4aef36c532b99c2f2e9", "title": "Introducing an integrated method for assessing supply chain sustainability based on HF-ARAS and IT2F-BWM"}, {"paperId": "fc1ade2e9aff298dd940f0c4ec6a2b1eba470fae", "title": "Multi-agent simulation of autonomous industrial vehicle fleets: Towards dynamic task allocation in V2X cooperation mode"}, {"paperId": "50515da0d8023a3d11a02145094fe4822846457b", "title": "Application of quantum computing based on heterogeneous cellular network algorithm in college student entrepreneurship management"}, {"paperId": "9e3918b3cef4208dbd03dba7f0dc0054f43e3b6c", "title": "COVID-19 automotive supply chain risks: A manufacturer-supplier development approach"}, {"paperId": "609473649539fe77112be816f60018def515a00c", "title": "VaccineChain: A checkpoint assisted scalable blockchain based secure vaccine supply chain with selective revocation"}, {"paperId": "ac47a9f750100b4dd762c9e375a290156f1e5317", "title": "Supply Chain Integration in Marketing:A Literature Review"}, {"paperId": "f5e2e9ae678a34fc5ff141d545632733f1b17209", "title": "Using Internet of Things (IoT) in Agri-Food Supply Chains: A Research Framework for Social Good With Network Clustering Analysis"}, {"paperId": "399b669730aab22cd62eaf0ba3a85e44e84e8943", "title": "A reliable and ensemble forecasting model for slow-moving and repairable spare parts: Data mining approach"}, {"paperId": "179707f3e5236909af660de95b0ba7ccb4567731", "title": "An edge-computing based Industrial Gateway for Industry 4.0 using ARM TrustZone technology"}, {"paperId": "edfb48f79a9e78b7f521db58430b3b7de2eeadd9", "title": "Integrated Big Data Analytics Conceptual Framework for Information Sharing across the fast-moving consumer goods industry"}, {"paperId": "b048776172f07d642f77b15814f8fec4cb17b551", "title": "Simulation of it Data Integration to Optimize an Antibiotics Supply Chain with System Dynamics"}, {"paperId": "aaa510cce8bbfad0ea18e64d6e2e1e278b927554", "title": "Data Integration from Heterogeneous Control Levels for the Purposes of Analysis within Industry 4.0 Concept"}, {"paperId": "4a62ad838eb3c23ba6c7259ad509fb3db4e59b1b", "title": "A bibliometric review of a decade’ research on industry 4.0 & supply chain management"}, {"paperId": "cd6c740049d6a17018d8431652948ef23cab4b60", "title": "A sustainable supply chain network considering lot sizing with quantity discounts under disruption risks: centralized and decentralized models"}, {"paperId": "66d6e78fd6e46bf738a7a4b8f7154ac5b2deaeee", "title": "Information sharing in supply chains - Interoperability in an era of circular economy"}, {"paperId": "28090edc8fc746462c74ac8534ccdfc2126055b4", "title": "Information Integration and Multiple Slowly Changing Dimensions Modeling"}, {"paperId": "2689ea7bd6f5b1c7a125ea14c13d3a97b0f2a5ec", "title": "Toward a resilient supply chain model: critical role of knowledge management and dynamic capabilities"}, {"paperId": "2b2497f772dafeec4d75c9ce3421c7651a2363e7", "title": "Use of Model-Based System Engineering methodology and tools for disruption analysis of supply chains: A case in semiconductor manufacturing"}, {"paperId": "9e4755daf207cee6a6410fe26ec7397712d25e66", "title": "Meta-analysis of Supply Chain Disruption Research"}, {"paperId": "dc3540d7a648a505c5bab242c8e0d3f7c998f6f4", "title": "End to End Secure Data Exchange in Value Chains with Dynamic Policy Updates"}, {"paperId": "c66e4c6409f6d5cb28470136eacf406916cc7e55", "title": "Integrated Lean Logistics - Warehousing model to reduce Lead Time in an SME of food sector: A research in Peru"}, {"paperId": "2d977bccf523d603d25d235b58dd43bb9be85158", "title": "Robust optimization of risk-aware, resilient and sustainable closed-loop supply chain network design with Lagrange relaxation and fix-and-optimize"}, {"paperId": "a80453e99865c9c867909b0919ec6fc840752fde", "title": "A generic information framework for decision-making in a forest-based bio-economy"}, {"paperId": "a5cd6eb8c158911b88bd9242582a833522a72c5e", "title": "Improved strategies of relation extraction based on graph convolutional model on tree structure for web information processing"}, {"paperId": "937cd6348ee7e370d02c81fd4f861ae6050a13fa", "title": "Fatores de Riscos Humanos em uma Cadeia de Suprimentos: Uma análise a partir de uma metáfora organizacional"}, {"paperId": "4e702d2861c2b9405ea50ffea3fc630ead69e458", "title": "A simulation-based analysis for effective distribution of COVID-19 vaccines: A case study in Norway"}, {"paperId": "3aae0cb9bb78766b4cf2f2b62ced9cf81eaaa5b6", "title": "Organizational process maturity model for IoT data quality management"}, {"paperId": "eb438658f797fe936d09b864b0cb59e2734e30fa", "title": "Two-level supply chain models with imperfect quality items when demand influences price and marketing promotion"}, {"paperId": "896fe2c1882057acb3b79a69fbf224d3a3b8323d", "title": "Optimal batch shipment policy for an imperfect production system under price-, advertisement- and green-sensitive demand"}, {"paperId": "ea6a6d2166ad083e1010b2d70b349dd09832c212", "title": "A Taxonomy Study on Securing Blockchain-based Industrial Applications: An Overview, Application Perspectives, Requirements, Attacks, Countermeasures, and Open Issues"}, {"paperId": "4372db65123b423b6a98c47857a59a9f5bb5c72a", "title": "Technological Resources for Fighting COVID-19 Pandemic Health Issues"}, {"paperId": "fd595ab42933b0a9a6bd79ce3a2e780261a6e1ed", "title": "The fourth industrial revolution of supply chains: A tertiary study"}, {"paperId": "4cdecdee63d57b5cd8f6089ecae42759041d87ce", "title": "Two-echelon imperfect production supply chain with probabilistic deterioration rework and reliability under fuzziness"}, {"paperId": "a2093a5eaf9b3d98307f6af2c9add56b5f908ca7", "title": "Effective inventory management using postponement strategy with fuzzy cost"}, {"paperId": "e1b618dd8624a17a522e85ffa60649536bae3f2d", "title": "Industrial information integration in track allocation optimization in high-speed train stations"}, {"paperId": "b0fc6fbd6f31636da3724048aaceb0ab67c2c642", "title": "A review on the role of 3D printing in the fight against COVID-19: safety and challenges"}, {"paperId": "1d55c75f1e9394141e24ab29dfa51fdcfd6700cf", "title": "Big Data Integration Solutions in Organizations: A Domain-Specific Analysis"}, {"paperId": "dffa041ad571083d5121462dcb6bb6d369a60349", "title": "A hyper-hybrid fuzzy decision-making framework for the sustainable-resilient supplier selection problem: a case study of Malaysian Palm oil industry"}, {"paperId": "86576703fcea63b960ce37c6026b3322f8676d9d", "title": "A bi-level optimization for a make-to-order manufacturing supply chain planning: a case in the steel industry"}, {"paperId": "b12e28f3fa94a86a268ed07b84fa191740572e59", "title": "Digital Twins: State of the Art Theory and Practice, Challenges, and Open Research Questions"}, {"paperId": "c5d6b38158ad15bc3a650df47d9f512137885703", "title": "Developing Digital Supply Network's Visibility Towards Transparency and Predictability"}, {"paperId": "1b9c79ea6394431b36aaa5c9f22e04a891006744", "title": "Unlocking Technology Adoption for a Robust Food Supply Chain: Evidence from Indian Food Processing Sector"}]}
