{"paperId": "830d702e0c7b0178af5182e44a35d90026436c61", "publicationVenue": {"id": "18cbbd77-05f9-43c3-96de-07b953983bcf", "name": "Engineer", "type": "journal", "alternate_names": ["The Engineer", "Eng"], "issn": "0046-1989", "alternate_issns": ["0013-7758"], "url": "https://purl.fdlp.gov/GPO/gpo115855"}, "title": "Development of Rock Classification Systems: A Comprehensive Review with Emphasis on Artificial Intelligence Techniques", "abstract": "At the initial phases of tunnel design, information on rock properties is often limited. In such instances, the engineering classification of the rock is recommended as a primary assessment of its geotechnical condition. This paper reviews different rock mass classification methods in the tunnel industry. First, some important considerations for the classification of rock are discussed, such as rock quality designation (RQD), uniaxial compressive strength (UCS) and groundwater condition. Traditional rock classification methods are then assessed, including the rock structure rating (RSR), rock mass rating (RMR), rock mass index (RMI), geological strength index (GSI) and tunnelling quality index (Q system). As RMR and the Q system are two commonly used methods, the relationships between them are summarized and explored. Subsequently, we introduce the detailed application of artificial intelligence (AI) method on rock classification. The advantages and limitations of traditional methods and artificial intelligence (AI) methods are indicated, and their application scopes are clarified. Finally, we provide suggestions for the selection of rock classification methods and prospect the possible future research trends.", "venue": "Engineer", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2024-01-25", "journal": {"name": "Eng"}, "authors": [{"authorId": "2215081121", "name": "Gang Niu"}, {"authorId": "2267022414", "name": "Xuzhen He"}, {"authorId": "2000462364", "name": "Haoding Xu"}, {"authorId": "2266500427", "name": "Shaoheng Dai"}], "citations": []}
