{"paperId": "831d016d80fe49225fae700c23060c8872c12019", "publicationVenue": null, "title": "IoT Cloud Computing Middleware for Crowd Monitoring and Evacuation", "abstract": "Map-Reduce is a programming model and an associated implementation for processing and generating large data sets. This model has a single point of failure: the master, who coordinates the work in a cluster. On the contrary, wireless sensor networks (WSNs) are distributed systems that scale and feature large numbers of small, computationally limited, low-power, unreliable nodes. In this article, we provide a top-down approach explaining the architecture, implementation and rationale of a distributed fault-tolerant IoT middleware. Specifically, this middleware consists of multiple mini-computing devices (Raspberry Pi) connected in a WSN which implement the Map-Reduce algorithm. First, we explain the tools used to develop this system. Second, we focus on the Map-Reduce algorithm implemented to overcome common network connectivity issues, as well as to enhance operation availability and reliability. Lastly, we provide benchmarks for our middleware as a crowd tracking application for a preserved building in Greece (i.e., M. Hatzidakis’ residence). The results of this study show that IoT middleware with low-power and low-cost components are viable solutions for medium-sized cloud computing distributed and parallel computing centres. Potential uses of this middleware apply for monitoring buildings and indoor structures, in addition to crowd tracking to prevent the spread of COVID-19.", "venue": "International Journal of Circuits, Systems and Signal Processing", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": null, "publicationDate": "2021-12-23", "journal": {"name": "International Journal of Circuits, Systems and Signal Processing"}, "authors": [{"authorId": "117581931", "name": "Alexandros Gazis"}, {"authorId": "3196180", "name": "E. Katsiri"}], "citations": [{"paperId": "dc3673684931ee129963305b1e45ace89e49e38c", "title": "A Blockchain Cloud Computing Middleware for Academic Manuscript Submission"}]}
