{"paperId": "8337539561a3253dc7d1b7f328abe6025d662bc3", "publicationVenue": {"id": "68f20e73-515e-4c73-9cd5-5684926b45f7", "name": "IEEE Journal on Selected Areas in Communications", "type": "journal", "alternate_names": ["IEEE J Sel Area Commun"], "issn": "0733-8716", "url": "http://www.comsoc.org/jsac/", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=49", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?puNumber=49"]}, "title": "A Digital Twin-Assisted Intelligent Partial Offloading Approach for Vehicular Edge Computing", "abstract": "Vehicle Edge Computing (VEC) is a promising paradigm that exposes Mobile Edge Computing (MEC) to road scenarios. In VEC, task offloading can enable vehicles to offload the computing tasks to nearby Roadside Units (RSUs) that deploy computing capabilities. However, the highly dynamic network topology, strict low-delay constraints, and massive data of tasks of VEC pose significant challenges for implementing efficient offloading. Digital Twin-based VEC is emerging as a promising solution that enables real-time monitoring of the state of the VEC network through mapping and interaction between the physical and virtual worlds, thus assisting in making sound offload decisions in the physical world. Thus, this paper proposes an intelligent partial offloading scheme, namely, Digital Twin-Assisted Intelligent Partial Offloading (IGNITE). First, to find the optimal offloading space in advance, we combine the improved clustering algorithm with the Digital Twin (DT) technique, in which unreasonable decisions can be avoided by reducing the size of the decision space. Second, to reduce the overall cost of the system, Deep Reinforcement Learning (DRL) algorithm is employed to train the offloading strategy, allowing for automatic optimization of computational delay and vehicle service price. To improve the efficiency of cooperation between digital and physical spaces, a feedback mechanism is established. It can adjust the parameters of the clustering algorithm based on the final offloading results in this clustering. To the best of our knowledge, this is the first study on DT-assisted vehicle offloading that proposes a feedback mechanism, forming a complete closed loop as prediction-offloading-feedback. Extensive experiments demonstrate that IGNITE has significant advantages in terms of total system computational cost, total computational delay, and offloading success rate compared with its counterparts.", "venue": "IEEE Journal on Selected Areas in Communications", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-11-01", "journal": {"name": "IEEE Journal on Selected Areas in Communications", "pages": "3386-3400", "volume": "41"}, "authors": [{"authorId": "144010790", "name": "Liang Zhao"}, {"authorId": "2236890799", "name": "Zijia Zhao"}, {"authorId": "2202431896", "name": "Enchao Zhang"}, {"authorId": "2119430859", "name": "Ammar Hawbani"}, {"authorId": "102161257", "name": "A. Al-Dubai"}, {"authorId": "120636643", "name": "Zhiyuan Tan"}, {"authorId": "2154003779", "name": "Amir Hussain"}], "citations": [{"paperId": "f32c7241214274f3550042828552c9d17baf2c7f", "title": "Energy-efficient offloading based on hybrid bio-inspired algorithm for edge–cloud integrated computation"}, {"paperId": "45eeab88838abf6c4a78c47961aeb1e33a68ce6c", "title": "EDITORS: Energy-aware Dynamic Task Offloading using Deep Reinforcement Transfer Learning in SDN-enabled Edge Nodes"}, {"paperId": "d13efe23f296c155868fbd06c6e7135a12cb6e4e", "title": "Intelligent Computation Offloading Based on Digital Twin-Enabled 6G Industrial IoT"}, {"paperId": "e9840ac3e30a115c1a2798d972175e71e48435a9", "title": "Deploying a Low-Cost Wi-Fi-Based Vehicular Ad Hoc Network in a Shopping Mall Parking Lot: An Empirical Study"}]}
