{"paperId": "833f7ec6310b6aac7a1bb620349134ca101a0e62", "publicationVenue": {"id": "537b4f76-bc99-4d19-8786-bf5851198a14", "name": "International Conference on Speech Technology and Human-Computer Dialogue", "type": "conference", "alternate_names": ["International Conference for Convergence for Technology", "Int Conf Converg Technol", "Int Conf Commun Technol", "International Conference on Communication Technology", "Int Conf Speech Technol Human-computer Dialogue", "ICCT", "SpeD"]}, "title": "Millimeter-Wave Radar Target Detection Based on Inter-frame DBSCAN Clustering", "abstract": "High-resolution millimeter wave radar sensor plays an important role in the process of detecting and classifying targets in complex environments. To process the radar data, clustering is often used to group the measured data. However, due to the different numbers and densities of available target points in different scenarios, data with high sparsity characteristics can cause incomplete target detection in the process of classifying targets, which is very challenging. Therefore, this study introduces a target detection method based on inter-frame DBSCAN clustering. In order to improve the accuracy of target detection, we employ a modified DBSCAN algorithm to cluster the inter-frame data by fusing Doppler features. The method uses a multi-frame merging process to improve the single-frame clustering accuracy, and uses frame sequence features to solve the multi-target noise problem. The effectiveness of the proposed method is verified using real-world dataset, as the clustering accuracy is improved compared to other methods, indicating the advantages of the proposed method.", "venue": "International Conference on Speech Technology and Human-Computer Dialogue", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-11-11", "journal": {"name": "2022 IEEE 22nd International Conference on Communication Technology (ICCT)", "pages": "1703-1708"}, "authors": [{"authorId": "2114081576", "name": "Siyi Xie"}, {"authorId": "2135747841", "name": "Chaofeng Wang"}, {"authorId": "2112088312", "name": "Xiaohua Yang"}, {"authorId": "3109215", "name": "Yaping Wan"}, {"authorId": "123945246", "name": "Tiejun Zeng"}, {"authorId": "2145312667", "name": "Zhenghai Liu"}], "citations": []}
