{"paperId": "83404cf71d9a737469b1ae8550c126431fc0040d", "publicationVenue": null, "title": "Performance comparison of Apache Hadoop and Apache Spark", "abstract": "The term 'Big Data' is a broad term used for the data sets, which is enormous and traditional data processing applications find it hard to process. Both Apache Spark and Apache Hadoop are one of the significant parts of the big data family. Some of the researchers view both frameworks as the rivals but it is not that easy to compare these two as they perform numerous things same, but there are also some areas where both work differently. Still both Apache Hadoop and Apache Spark are comparable on different parameters. This research intends to compare these two popular frameworks and figure out their strengths, weaknesses, unique characteristics and try to answer whether Spark can replace hadoop or not.", "venue": "ICAICR '19", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2019-06-15", "journal": {"name": "Proceedings of the Third International Conference on Advanced Informatics for Computing Research  - ICAICR '19"}, "authors": [{"authorId": "2031868430", "name": "Amritpal Singh"}, {"authorId": "6806161", "name": "A. Khamparia"}, {"authorId": "1858621", "name": "A. K. Luhach"}], "citations": [{"paperId": "fedff66ebf19f1ab1371b18342ae75fdca1a8731", "title": "A Comparative Study of Bigdata Tools: Hadoop Vs Spark Vs Storm"}, {"paperId": "761606f47dc634db8dd2416bc8dec79cbc0af44e", "title": "Ten quick tips for bioinformatics analyses using an Apache Spark distributed computing environment"}, {"paperId": "17fd16b416894cc4bcaea8290e670e3214dc7a1a", "title": "Big Data and Personalisation for Non-Intrusive Smart Home Automation"}, {"paperId": "637236d135c4ac230648d7ecfdd1ed34fef4b45f", "title": "Silence Elimination for Robust Speaker Detection in Large Database"}, {"paperId": "af225b810dfc8a90eb07c8f225dbf530fbb7c1dd", "title": "MOBDA: Microservice-Oriented Big Data Architecture for Smart City Transport Systems"}, {"paperId": "e1da99124c28406654902ec79b3b143381daf7b9", "title": "Erasure-Code Algorithm for Distributed Stream Processing"}, {"paperId": "44e419a83ce9235c7c208de8fe852bf39231d948", "title": "Big data applications based on web mining techniques and recommender systems: Survey"}, {"paperId": "2a140624be2f2f77f0d9622704f82779de4a80e7", "title": "Parallel Ant Colony Optimization Algorithm for Finding the Shortest Path for Mountain Climbing"}]}
