{"paperId": "834c696f7181057c9a481132c537f0a753f39a1b", "publicationVenue": null, "title": "Perturbation-enabled Deep Federated Learning for Preserving Internet of Things-based Social Networks", "abstract": "Federated Learning (FL), as an emerging form of distributed machine learning (ML), can protect participants’ private data from being substantially disclosed to cyber adversaries. It has potential uses in many large-scale, data-rich environments, such as the Internet of Things (IoT), Industrial IoT, Social Media (SM), and the emerging SM 3.0. However, federated learning is susceptible to some forms of data leakage through model inversion attacks. Such attacks occur through the analysis of participants’ uploaded model updates. Model inversion attacks can reveal private data and potentially undermine some critical reasons for employing federated learning paradigms. This article proposes novel differential privacy (DP)-based deep federated learning framework. We theoretically prove that our framework can fulfill DP’s requirements under distinct privacy levels by appropriately adjusting scaled variances of Gaussian noise. We then develop a Differentially Private Data-Level Perturbation (DP-DLP) mechanism to conceal any single data point’s impact on the training phase. Experiments on real-world datasets, specifically the social media 3.0, Iris, and Human Activity Recognition (HAR) datasets, demonstrate that the proposed mechanism can offer high privacy, enhanced utility, and elevated efficiency. Consequently, it simplifies the development of various DP-based FL models with different tradeoff preferences on data utility and privacy levels.", "venue": "ACM Trans. Multim. Comput. Commun. Appl.", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-05-23", "journal": {"name": "ACM Transactions on Multimedia Computing, Communications, and Applications (TOMM)", "pages": "1 - 19", "volume": "18"}, "authors": [{"authorId": "2073105889", "name": "Sara Salim"}, {"authorId": "3193106", "name": "Nour Moustafa"}, {"authorId": "145811892", "name": "B. Turnbull"}, {"authorId": "1630421985", "name": "Imran Razzak"}], "citations": [{"paperId": "165458b5fcd26ad2a1d527edbb3f61a050243c40", "title": "Deep-Federated-Learning-Based Threat Detection Model for Extreme Satellite Communications"}, {"paperId": "aa1c9d623cbea5f3147caf707204e1ea288f00ee", "title": "Exploring Machine Learning Models for Federated Learning: A Review of Approaches, Performance, and Limitations"}, {"paperId": "a225622b104f9b46530b61202cc2587da8cea396", "title": "Pelican Optimization Algorithm with Federated Learning Driven Attack Detection model in Internet of Things environment"}, {"paperId": "7b2135e060f7d48b41cda229f16b3da34ff9e05c", "title": "Recoverable Privacy-Preserving Image Classification through Noise-like Adversarial Examples"}, {"paperId": "b0339da56f714fbab21d3a0e5a84f80d38a1867c", "title": "Incomplete Multiview Clustering via Semidiscrete Optimal Transport for Multimedia Data Mining in IoT"}, {"paperId": "64a0fb7b7e0ad648496aa0874fc73d112474c267", "title": "Assessing Wearable Human Activity Recognition Systems Against Data Poisoning Attacks in Differentially-Private Federated Learning"}, {"paperId": "804340ac1e3de1fc3cfe22521fbaca4d62d4f7ac", "title": "Federated Learning Method for Local Differential Privacy in IoT Networks"}, {"paperId": "bf9ffe9b156c2f079212fb9b70599b6924962603", "title": "Exploring Deep Federated Learning for the Internet of Things: A GDPR-Compliant Architecture"}]}
