{"paperId": "834ce1692a7d9703a144a264b217666e9a6f4756", "publicationVenue": {"id": "ccd8e532-73c6-414f-bc91-271bbb2933e2", "name": "Electronics", "type": "journal", "issn": "1450-5843", "alternate_issns": ["2079-9292", "0883-4989"], "url": "http://www.electronics.etfbl.net/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-247562", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-247562", "https://www.mdpi.com/journal/electronics"]}, "title": "Agent-Based In-Vehicle Infotainment Services in Internet-of-Things Environments", "abstract": "With the growth of Internet-of-Things (IoT) technology and the automobile industry, various In-Vehicle Infotainment (IVI) services have been developed, in which users can exploit a variety of IVI devices, such as navigation systems, cameras, speakers, headrest displays and heated seats. A typical IVI system is based on the peer-to-peer model, in which the user will directly control each device. This tends to induce a large overhead and inconvenience to the user. To overcome the drawbacks of the peer-to-peer model, the centralized IVI (C-IVI) scheme was recently proposed in which an IVI master is employed to provide IVI services between users and devices. However, the centralized model gives lower performance, as the number of users and devices gets larger. To improve the performance of IVI services, in this paper, we propose an agent-based IVI (A-IVI) scheme. In the proposed A-IVI scheme, a new entity called ‘agent’ is introduced, based on the C-IVI model. Each IVI agent will be used to manage a group of devices and also to perform the communication with the IVI master, on behalf of the concerned devices. The proposed scheme can be used to provide scalability and perform enhancement. The IVI agents are also helpful for supporting a variety of constrained IVI devices, such as speakers or cameras, which may usually have too low power to perform IoT communications. The proposed A-IVI scheme is implemented by using the IoT messaging protocols. For performance comparison with the existing schemes, we performed testbed experimentations. From the results, we see that the proposed A-IVI scheme can provide better performance than the existing IVI systems in terms of transmission delays, throughput and master’s loads. It is expected that the proposed scheme may be used effectively for IVI systems with a large number of users/devices, as seen in public transportation, such as public trains or airplanes.", "venue": "Electronics", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2020-08-11", "journal": {"name": "Electronics"}, "authors": [{"authorId": "40652583", "name": "Dongkyu Choi"}, {"authorId": "40997488", "name": "Joong-Hwa Jung"}, {"authorId": "2005236206", "name": "Hye-Been Nam"}, {"authorId": "1774664", "name": "S. Koh"}], "citations": [{"paperId": "0f783247cc21758feb64a4cb449b982a71af0bdd", "title": "How Dose Aesthetic Design Affect Continuance Intention in In-Vehicle Infotainment Systems? An Exploratory Study"}, {"paperId": "b89c686cbdd0fcbe048e62b6b03b134bcc51665a", "title": "Terminal modeling for power Internet of Things"}, {"paperId": "5f479370fc56c580fe67bbac7fba2a6b20a5a5b6", "title": "Performance Assessment of Context-aware Online Learning for Task Offloading in Vehicular Edge Computing Systems"}]}
