{"paperId": "8352ddce5d13f5e47dd83ec30e5471af555299ea", "publicationVenue": null, "title": "Fault Coverage-Based Test Case Prioritization and Selection Using African Buffalo Optimization", "abstract": ": Software needs modifications and requires revisions regularly. Owing to these revisions, retesting software becomes essential to ensure that the enhancements made, have not affected its bug-free functioning. The time and cost incurred in this process, need to be reduced by the method of test case selection and prioritization. It is observed that many nature-inspired techniques are applied in this area. African Buffalo Optimization is one such approach, applied to regression test selection and prioritization. In this paper, the proposed work explains and proves the applicability of the African Buffalo Optimization approach to test case selection and prioritization. The proposed algorithm converges in polynomial time (O(n 2 )). In this paper, the empirical evaluation of applying African Buffalo Optimization for test case prioritization is done on sample data set with multiple iterations. An astounding 62.5% drop in size and a 48.57% drop in the runtime of the original test suite were recorded. The obtained results are compared with Ant Colony Optimization. The comparative analysis indicates that African Buffalo Optimization and Ant Colony Optimization exhibit similar fault detection capabilities (80%), and a reduction in the overall execution time and size of the resultant test suite. The results and analysis, hence, advocate and encourages the use of African Buffalo Optimization in the area of test case selection and prioritization.", "venue": "Computers, Materials &amp; Continua", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": {"name": "Computers, Materials &amp; Continua"}, "authors": [{"authorId": "46459155", "name": "S. Singhal"}, {"authorId": "2730031", "name": "Nishtha Jatana"}, {"authorId": "2124527433", "name": "Ahmad F. Subahi"}, {"authorId": "2064616809", "name": "Charu Gupta"}, {"authorId": "2124535133", "name": "Osamah Ibrahim Khalaf"}, {"authorId": "2085508", "name": "Youseef A. Alotaibi"}], "citations": [{"paperId": "ff3a3d0b9bcc0d7c840e401fcee5d0a4938b2380", "title": "Fault sensitivity index-based multi-objective testcase prioritization"}, {"paperId": "d77a521ffec2007c023907ad8ce822a8f7458754", "title": "Test Case Prioritization via Embedded Autoencoder Model for Software Quality Assurance"}, {"paperId": "94d4f8d8f76c818339ad15962c679d1d2e34b7c5", "title": "Hybrid whale optimized crow search algorithm and multi-SVM classifier for effective system level test case selection"}, {"paperId": "1b5985e521eb9e6bae2c2b580cc33ed2e22366b8", "title": "Factors influencing consumers' repurchase behavior on fresh food e-commerce platforms: An empirical study"}, {"paperId": "88fda88c1d55633465bd5ea655dc4e2128dffa67", "title": "Machine Learning Approach for Prediction of Lateral Confinement Coefficient of CFRP-Wrapped RC Columns"}, {"paperId": "6884938c89dd23b7cee25f82d440a800232a3158", "title": "Design and Performance Analysis of 32 × 32 Memory Array SRAM for Low-Power Applications"}, {"paperId": "7a317fc191a9fee6490c9d781e88bb21b380050f", "title": "A Hybrid Cross Layer with Harris-Hawk-Optimization-Based Efficient Routing for Wireless Sensor Networks"}]}
