{"paperId": "835d9860841dc573c9026721c7045e90788ffa7c", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Monitoring of Student Learning in Learning Management Systems: An Application of Educational Data Mining Techniques", "abstract": "In this study, we used a module for monitoring and detecting students at risk of dropping out. We worked with a sample of 49 third-year students in a Health Science degree during a lockdown caused by COVID-19. Three follow-ups were carried out over a semester: an initial one, an intermediate one and a final one with the UBUMonitor tool. This tool is a desktop application executed on the client, implemented with Java, and with a graphic interface developed in JavaFX. The application connects to the selected Moodle server, through the web services and the REST API provided by the server. UBUMonitor includes, among others, modules for log visualisation, risk of dropping out, and clustering. The visualisation techniques of boxplots and heat maps and the cluster analysis module (k-means ++, fuzzy k-means and Density-based spatial clustering of applications with noise (DBSCAN) were used to monitor the students. A teaching methodology based on project-based learning (PBL), self-regulated learning (SRL) and continuous assessment was also used. The results indicate that the use of this methodology together with early detection and personalised intervention in the initial follow-up of students achieved a drop-out rate of less than 7% and an overall level of student satisfaction with the teaching and learning process of 4.56 out of 5.", "venue": "Applied Sciences", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-03-17", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "1403114218", "name": "M. Sáiz-Manzanares"}, {"authorId": "2087603537", "name": "J. Rodríguez-Díez"}, {"authorId": "1398681367", "name": "J. Díez-Pastor"}, {"authorId": "1416628740", "name": "Sandra Rodríguez-Arribas"}, {"authorId": "1415036592", "name": "Raúl Marticorena-Sánchez"}, {"authorId": "2087703525", "name": "Y. Ji"}], "citations": [{"paperId": "ecf7d9913e75652e0f31548be71f9f24b4c59ecc", "title": "UBUMonitor: Desktop application for visual e-learning student clustering with Moodle"}, {"paperId": "cb494a5bb6ecbef2d15ac3703b4cd5109f8c3af0", "title": "PLATA: Design of an Online Platform for Chemistry Undergraduate Fully Automated Assignments"}, {"paperId": "bdffdcf9ee4814c6faa9674e00693a86a85b6d52", "title": "Usability of a Virtual Learning Environment in Down Syndrome Adult Learning"}, {"paperId": "8f86fd6d5c3c22aeb494169a51bfe6a9f4934da8", "title": "The Application of data Mining Technology in Student Management"}, {"paperId": "1a8d49469fd5db7d931bb5dc775a71a140c4a817", "title": "Empowering Health Care Education Through Learning Analytics: In-depth Scoping Review"}, {"paperId": "c6314c709b3247e0303cd08aa5f45a918e89096f", "title": "Towards Smart Education through Internet of Things: A Survey"}, {"paperId": "cdeb95aec13a690c73900d7498a1190472b59e5e", "title": "Sustained Improvement of Educational Information Asymmetry: Intentions to Use School Social Media"}, {"paperId": "fd968dace0c8d170010252fef1aa74d4c32a3e2d", "title": "Using Data Mining Techniques To Enhance The Student Performance. A semantic review."}, {"paperId": "5776aff719d5449c469c007508d50fb749df8dac", "title": "Educational data mining in the academic setting: employing the data produced by blended learning to ameliorate the learning process"}, {"paperId": "d211d84689c2bf94dd0dba0599b814fa92aba199", "title": "Nursing Students’ Perceived Satisfaction with Flipped Learning Experiences: A Mixed-Methods Study"}, {"paperId": "9df124cd0fb70bdc85b15acb3286cd2d1c3cf3db", "title": "Comparative Study of Moodle Plugins to Facilitate the Adoption of Computer-Based Assessments"}, {"paperId": "26eba793d96f0760b00458eff17f1f786e09a46c", "title": "Exercise Recommendation Model Based on Cognitive Level and Educational Big Data Mining"}, {"paperId": "5c2bfefb0a51a274d24fba85964080e4fd089225", "title": "Chicken Swarm-Based Feature Subset Selection with Optimal Machine Learning Enabled Data Mining Approach"}, {"paperId": "39b3d581c5ed95b14f58bf6fb97a2535d1ff5b24", "title": "Teacher Training Effectiveness in Self-Regulation in Virtual Environments"}, {"paperId": "041d1241e375a2ce349910c3acb8729029017409", "title": "Study on Machine Learning Applications in Ideological and Political Education under the Background of Big Data"}, {"paperId": "94bf9e236ea5107e6c2d222ce1fbcd530dbf50a2", "title": "COVID-19 Emergency Remote Teaching Opinions and Academic Performance of Undergraduate Students: Analysis of 4 Students’ Profiles. A Case Study"}, {"paperId": "1b53d53a9943cf8e2408c133ad760d17ca067dd7", "title": "Valoración de la Ecología de Aprendizaje Autorregulado Virtualizada para la Didáctica de las Ciencias de la Naturaleza durante la crisis COVID-19"}, {"paperId": "dda0bbb4237b85761e17c8177b1bb4a9eb96c651", "title": "Improve teaching with modalities and collaborative groups in an LMS: an analysis of monitoring using visualisation techniques"}, {"paperId": "e0fb3482f5222dac19e261d7ddc5332dbcc2ac67", "title": "Using Moodle Learning Management System in Teaching from Distance Learning to the E-learning 5.0 of New Technology"}, {"paperId": "271940d961b21e374f5f44e2311edb5983f7fed7", "title": "Advancing Sustainable Learning Environments: A Literature Review on Data Encoding Techniques for Student Performance Prediction using Deep Learning Models in Education"}, {"paperId": "1984fa157904e2eee472fdacc3ba3b17271ffbe7", "title": "Machine Learning in Higher Education: Students’ Performance Assessment Considering Online Activity Logs"}, {"paperId": "d15e7a6269158d2685b008e57fe6b03563cf5bee", "title": "Intelligent Anomaly Identiﬁcation of Uplift Pressure Monitoring Data and Structural Diagnosis of Concrete Dam"}, {"paperId": "641bd8c4fef0f4ba2bc1735a1547a4ddc7553ee7", "title": "TOWARD IMPROVING STUDENT PERFORMANCE IN AN ONLINE ENVIRONMENT USING EDUCATIONAL DATA MINING APPROACH"}]}
