{"paperId": "8362a9eb2d8e02de04124919d15e18a3c8164b07", "publicationVenue": {"id": "a00fde74-d8df-4613-b825-0fff9f531d3f", "name": "IEEE Transactions on Network and Service Management", "type": "journal", "alternate_names": ["IEEE Trans Netw Serv Manag"], "issn": "1932-4537", "url": "http://ejournals.ebsco.com/direct.asp?JournalID=714200", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4275028", "http://ieeexplore.ieee.org/servlet/opac?punumber=4275028"]}, "title": "Robust and Reliable SFC Placement in Resource-Constrained Multi-Tenant MEC-Enabled Networks", "abstract": "With the rapid development and incoming implementation of 5G networks, many use cases, such as Intelligent Transportation Systems (ITS), are being realized. Utilizing networking technologies, including Network Function Virtualization and Mobile Edge Computing, along with 5G network slicing, the Next-Generation Service Placement Problem (NGSPP) is gaining significant attention due to the criticality of its services and its resource-constrained network nodes. The placement of services on Next-Generation (NG) networks has inherent challenges, mainly ultra-low latency requirements and the complexity of NG network management and orchestration. A candidate solution to the NGSPP should provide a placement that adheres to the strict Quality of Service (QoS) requirements. This work presents the formulation of a robust optimization problem that optimizes the high-availability placement of applications in resource-constrained and multi-tenant NG networks, which complies with QoS requirements and is capable of protecting the performance of the solution under adverse conditions. Finally, a set of hierarchical clustering-based heuristic algorithms, which reduce the time-complexity of the solution are proposed. Results demonstrate that formulating the robust solution is a proactive method of injecting resilience into the system and can preserve performance across various levels of system uncertainty.", "venue": "IEEE Transactions on Network and Service Management", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-02-01", "journal": {"name": "IEEE Transactions on Network and Service Management", "pages": "187-199", "volume": "21"}, "authors": [{"authorId": "1379775094", "name": "D. Manias"}, {"authorId": "1697654224", "name": "I. Shaer"}, {"authorId": "1403307021", "name": "Joe Naoum-Sawaya"}, {"authorId": "2193497884", "name": "Abdallah Shami"}], "citations": []}
