{"paperId": "83731e2165798c5ce1f31f08513c9d1625b8e6a9", "publicationVenue": {"id": "5857d727-45eb-4f03-9c71-889349e363a7", "name": "Geomatics, Natural Hazards & Risk", "type": "journal", "alternate_names": ["Geomatics, Natural Hazards and Risk", "Geomatics Nat Hazard  Risk", "Geomatics Nat Hazard Risk"], "issn": "1947-5705", "url": "http://www.informaworld.com/smpp/title~content=t913444127~db=all", "alternate_urls": ["https://www.tandfonline.com/toc/tgnh20/current", "http://www.tandfonline.com/TGNH"]}, "title": "A comparative evaluation of machine learning algorithms and an improved optimal model for landslide susceptibility: a case study", "abstract": "Abstract In this study, four representative machine learning methods (support vector machine (SVM), maximum entropy (MaxEnt), random forest (RF), and artificial neural network (ANN)) were employed to construct a landslide susceptibility map (LSM) in Xulong Gully (XLG), southwest China. The models were subsequently compared in order to select the best-performing model. This model was further improved to optimize the machine learning method. A total of 16 layers were extracted from the collected data and employed as conditional factors for the correlation analysis and subsequent modelling. The LSMs were then divided into four levels (very high susceptibility (VH), high susceptibility (H), moderate susceptibility (M) and low susceptibility (L)). The results were verified by receiver operating characteristic (ROC) curves, Root Mean Squared Error (RMSE) and Frequency Ratio (FR). The higher of the area under ROC curve (AUC) and the lower the RMSE, the more accurate and stable the performance. Following the factor performance analysis, the optimal SVM model was linearity improved to the Trace Ratio Criterion (TRC)-SVM, with a better performance and the ability to overcome the factor defect. The comprehensive comparisons and proposed LSM can support future research, as well as local authorities in the development of landslide remission strategies.", "venue": "Geomatics, Natural Hazards & Risk", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-01-01", "journal": {"name": "Geomatics, Natural Hazards and Risk", "pages": "1973 - 2001", "volume": "12"}, "authors": [{"authorId": "2145579203", "name": "Yue Liu"}, {"authorId": "49080205", "name": "Peihua Xu"}, {"authorId": "143773134", "name": "C. Cao"}, {"authorId": "2064114468", "name": "Bo Shan"}, {"authorId": "2035850807", "name": "Kuanxing Zhu"}, {"authorId": "2153709256", "name": "Qiuyang Ma"}, {"authorId": "2128673629", "name": "Zongshuo Zhang"}, {"authorId": "2150499729", "name": "Hang Yin"}], "citations": [{"paperId": "8997425746c06fb1b868e9a3d6ead2b397e2a5d6", "title": "Temporal and spatial pattern analysis and susceptibility assessment of geological hazards in Hunan Province of China from 2015 to 2022"}, {"paperId": "62be63c211ce57aebd515f3444edc0e895ee4b3f", "title": "A quick method of early landslide identification based on dynamic susceptibility analysis using M-SVM method: a case study"}, {"paperId": "5404a732323745aa72ac9cd1becce8df11176122", "title": "Landslide Modeling in a Tropical Mountain Basin Using Machine Learning Algorithms and Shapley Additive Explanations"}, {"paperId": "22a0ce202a72e0951c8cb98e27ec8323b48ac218", "title": "Special Physical Characteristic and Training Strategy of Badminton Based on Machine Learning Algorithm"}, {"paperId": "664ade78b1b5c28463465757cdccb739d0a7faef", "title": "Refined landslide susceptibility analysis based on InSAR technology and UAV multi-source data"}, {"paperId": "e7e498fef5430abc0e43beb5739c7fe7efdae193", "title": "Landslide Susceptibility Model Using Artificial Neural Network (ANN) Approach in Langat River Basin, Selangor, Malaysia"}]}
