{"paperId": "837b1b422cff2f0ec5b39f26e94b2ced4c1aa25c", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "An optimal sensors-based simulation method for spatiotemporal event detection", "abstract": "Human movements in urban areas are essential for understanding the human-environment interactions. However, activities and associated movements are full of uncertainties due to the complexity of a city. In this paper, we propose an optimal sensors-based simulation method for spatiotemporal event detection using human activity signals derived from taxi trip data. A sensor here is an abstract concept such that only the true observation data at the sensor location will be treated as known data for the simulation. Specifically, we first identify the optimal number of sensors and their locations that have the strongest correlation with the whole dataset. The observation data points from these sensors are then used to simulate a regular, uneventful scenario using the Discrete Empirical Interpolation Method. By comparing the simulated and observation scenarios, events are extracted both spatially and temporally. We apply this method in New York City with taxi trip records data. Results show that this method is effective in detecting when and where events occur.", "venue": "arXiv.org", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-08-16", "journal": {"name": "ArXiv", "volume": "abs/2208.07969"}, "authors": [{"authorId": "2008739232", "name": "Yuqin Jiang"}, {"authorId": "152881295", "name": "A. Popov"}, {"authorId": "48458661", "name": "Zhenlong Li"}, {"authorId": "32871698", "name": "M. Hodgson"}], "citations": [{"paperId": "49a224d5faaf9f22126d1a0c175fafd68963a269", "title": "An entropy-based measurement for understanding origin-destination trip distributions: a case study of New York City taxis (preprint)"}]}
