{"paperId": "837b205f9804d13525b22f459cc11f8c734d0a85", "publicationVenue": {"id": "0dc0e794-53db-401d-bd8f-8da9165b2865", "name": "International Conferences on Contemporary Computing and Informatics", "type": "conference", "alternate_names": ["IC3I", "Int Conf Contemp Comput Informatics"]}, "title": "A Review: Heart Disease Prediction Based on Conventional and Machine Learning Algorithms", "abstract": "In our daily life, heart-related diseases are the most dangerous diseases in the world, some of them can be cured even though it is time taking, but others have high-risk factors that make them difficult to treat. Considering these risk factors, there is a chance that a patient can die. This is the main criterion to focus on this disease because of death rate is high. As a team, we mainly focused on four diseases that have recorded increased deaths: Heart disease, Depression, Kidney disease, and Lung Cancer. Based on this, we have surveyed the disorders to predict them at the earliest, making them easy to cure. From this survey, we learned that a high number of deaths are recorded due to heart-related issues, which 17.9 million people globally each year. It is known that diagnosis of heart disease is quite challenging, but that doesn't mean that person is on the verge of their life. There are effective ways in which a person can be gone through an automated prediction of their heart condition. Machine and deep learning algorithms are practical and efficient in producing the most accurate results. These algorithms are helpful in many ways and different fields, mainly in the medical domain, for predicting diseases based on symptoms.", "venue": "International Conferences on Contemporary Computing and Informatics", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference", "Review"], "publicationDate": "2022-12-14", "journal": {"name": "2022 5th International Conference on Contemporary Computing and Informatics (IC3I)", "pages": "1429-1435"}, "authors": [{"authorId": "49596260", "name": "Surinder Kumar"}, {"authorId": "2150507794", "name": "Abhishek Bhola"}, {"authorId": "2212153184", "name": "Vandavasi Venkata Satvika"}, {"authorId": "2212142522", "name": "Palapati Vaishnavi Akshaya"}, {"authorId": "2091563264", "name": "N. Reshma"}, {"authorId": "2212176634", "name": "Maka Hemanth Kumar"}], "citations": []}
