{"paperId": "837d1fde9e2042003f4c190bb44fb2f1bd19a72c", "publicationVenue": {"id": "7ec19773-02ec-4b44-bd9d-338e6da82040", "name": "eScience", "type": "journal", "alternate_names": ["IEEE International Conference on eScience", "IEEE Int Conf escience"], "issn": "2667-1417", "url": "https://www.keaipublishing.com/en/journals/escience/"}, "title": "Efficient Runtime Capture of Multiworkflow Data Using Provenance", "abstract": "Computational Science and Engineering (CSE) projects are typically developed by multidisciplinary teams. Despite being part of the same project, each team manages its own workflows, using specific execution environments and data processing tools. Analyzing the data processed by all workflows globally is a core task in a CSE project. However, this analysis is hard because the data generated by these workflows are not integrated. In addition, since these workflows may take a long time to execute, data analysis needs to be done at runtime to reduce cost and time of the CSE project. A typical solution in scientific data analysis is to capture and relate the data in a provenance database while the workflows run, thus allowing for data analysis at runtime. However, the main problem is that such data capture competes with the running workflows, adding significant overhead to their execution. To mitigate this problem, we introduce in this paper a system called ProvLake, which adopts design principles for providing efficient distributed data capture from the workflows. While capturing the data, ProvLake logically integrates and ingests them into a provenance database ready for analyses at runtime. We validated ProvLake in a real use case in the O&G industry encompassing four workflows that process 5 TB datasets for a deep learning classifier. Compared with Komadu, the closest solution that meets our goals, our approach enables runtime multiworkflow data analysis with much smaller overhead, such as 0.1%.", "venue": "eScience", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-09-01", "journal": {"name": "2019 15th International Conference on eScience (eScience)", "pages": "359-368"}, "authors": [{"authorId": "144712722", "name": "Renan Souza"}, {"authorId": "1763201", "name": "M. Mattoso"}, {"authorId": "1785758", "name": "L. Azevedo"}, {"authorId": "3460979", "name": "R. Thiago"}, {"authorId": "1737790840", "name": "E. Soares"}, {"authorId": "36242067", "name": "Marcelo Nery dos Santos"}, {"authorId": "1777317", "name": "M. Netto"}, {"authorId": "2178217", "name": "E. V. Brazil"}, {"authorId": "1727586", "name": "Renato Cerqueira"}, {"authorId": "144255847", "name": "P. Valduriez"}], "citations": [{"paperId": "638d132c1fd4a42d6e679951ef975c54a105d6c1", "title": "PINNProv: Provenance for Physics-Informed Neural Networks"}, {"paperId": "97248b3e7415d2abf7acd723de8b006ca76373d6", "title": "Towards Lightweight Data Integration Using Multi-Workflow Provenance and Data Observability"}, {"paperId": "06d6635aaf2276a74914d678ea8998cbd945b09f", "title": "A Polystore Architecture Using Knowledge Graphs to Support Queries on Heterogeneous Data Stores"}, {"paperId": "34908e472d266de1fc5c1a278225742614866b91", "title": "PROV-IO<inline-formula><tex-math notation=\"LaTeX\">$^+$</tex-math><alternatives><mml:math><mml:msup><mml:mrow/><mml:mo>+</mml:mo></mml:msup></mml:math><inline-graphic xlink:href=\"zheng-ieq1-3374555.gif\"/></alternatives></inline-formula>: A Cross-Platform Provenance Framework for Scientific Data on HP"}, {"paperId": "0a4f7757e60ca0b8e52ff9df7f0663e5c37eb937", "title": "ProvLight: Efficient Workflow Provenance Capture on the Edge-to-Cloud Continuum"}, {"paperId": "7fff5c07e630c756f11517f81662cd272b6048f1", "title": "Position Paper on Dataset Engineering to Accelerate Science"}, {"paperId": "a12e64c8bd53136147862b570981581758e4937e", "title": "Management of Machine Learning Lifecycle Artifacts"}, {"paperId": "7272a31dbd389c5f2c3f151a3b67d3bdceaff489", "title": "PROV-IO: An I/O-Centric Provenance Framework for Scientific Data on HPC Systems"}, {"paperId": "c09e2dbad84f113ef39885349823bac7dafc50b9", "title": "Engineering a machine learning pipeline for automating metadata extraction from longitudinal survey questionnaires"}, {"paperId": "0dde8b496b1335f90aeb363c2f6e8959ca951d6c", "title": "User Steering Support in Large-scale Workflows"}, {"paperId": "f21460a0a5f2413630b7610601e7a0bd2f244b35", "title": "Context-aware Execution Migration Tool for Data Science Jupyter Notebooks on Hybrid Clouds"}, {"paperId": "aa16513b1ec2b939b05c8a51532a8945c334a771", "title": "Know Your Model (KYM): Increasing Trust in AI and Machine Learning"}, {"paperId": "dea31cbcf29a62120d437208a754455acb8bc82b", "title": "Distributed in-memory data management for workflow executions"}, {"paperId": "cb7655a0e1dcf642e930dd54ca10c0d16c8db610", "title": "Polyflow: a Polystore-compliant Mechanism to Provide Interoperability to Heterogeneous Provenance Graphs"}, {"paperId": "1cbd70964eb7ebacab53717e1a284740415d5a5c", "title": "Experiencing ProvLake to Manage the Data Lineage of AI Workflows"}, {"paperId": "af83a168b7877f48f13a8ee86d8379eaba60bdfd", "title": "Workflow provenance in the lifecycle of scientific machine learning"}, {"paperId": "82348a35db7584ca2622efb6dc388bcfe60582f9", "title": "Managing Data Lineage of O&G Machine Learning Models: The Sweet Spot for Shale Use Case"}, {"paperId": "dbb53d19f601da0f7e1ff3cf6ae5e4d08521c513", "title": "Supporting User Steering In Large-Scale Workflows With Provenance Data. (Support des actions de pilotage dans les workflows à grande échelle avec données de provenance)"}, {"paperId": "af92c3d829d9fca89e1dbb445e32cab5b222a30a", "title": "Provenance Data in the Machine Learning Lifecycle in Computational Science and Engineering"}, {"paperId": "c330fa2dee65be4a8ccdc83e64a5e068c21e6437", "title": "Towards A Practical Provenance Framework for Scientiﬁc Data on HPC Systems"}, {"paperId": "2fc99aade084d35dcebbc88b4bb7fa0416b439d4", "title": "Supporting Polystore Queries using Provenance in a Hyperknowledge Graph"}, {"paperId": "0b136463cd1ea48dfb24b1d570362eea7b782f4f", "title": "UNIVERSIDADE FEDERAL DE JUIZ DE FORA INSTITUTO DE CIÊNCIAS EXATAS PROGRAMA DE PÓS-GRADUAÇÃO EM CIÊNCIA DA COMPUTAÇÃO"}, {"paperId": "1e4be21294e24232a98d0b3c24857ccd5fa05cd6", "title": "Experiment Workbench: A Co-agent for Assisting Data Scientists"}]}
