{"paperId": "839a48bf03ab70915d443e991d6af0701b19afe1", "publicationVenue": {"id": "138e58fc-8643-41c2-a92c-068ea4f4c607", "name": "PeerJ Computer Science", "alternate_names": ["Peerj Comput Sci"], "issn": "2376-5992", "url": "https://peerj.com/archives/?journal=cs", "alternate_urls": ["https://peerj.com/computer-science/", "http://peerj.com/cs"]}, "title": "Cyber-attack method and perpetrator prediction using machine learning algorithms", "abstract": "Cyber-attacks have become one of the biggest problems of the world. They cause serious financial damages to countries and people every day. The increase in cyber-attacks also brings along cyber-crime. The key factors in the fight against crime and criminals are identifying the perpetrators of cyber-crime and understanding the methods of attack. Detecting and avoiding cyber-attacks are difficult tasks. However, researchers have recently been solving these problems by developing security models and making predictions through artificial intelligence methods. A high number of methods of crime prediction are available in the literature. On the other hand, they suffer from a deficiency in predicting cyber-crime and cyber-attack methods. This problem can be tackled by identifying an attack and the perpetrator of such attack, using actual data. The data include the type of crime, gender of perpetrator, damage and methods of attack. The data can be acquired from the applications of the persons who were exposed to cyber-attacks to the forensic units. In this paper, we analyze cyber-crimes in two different models with machine-learning methods and predict the effect of the defined features on the detection of the cyber-attack method and the perpetrator. We used eight machine-learning methods in our approach and concluded that their accuracy ratios were close. The Support Vector Machine Linear was found out to be the most successful in the cyber-attack method, with an accuracy rate of 95.02%. In the first model, we could predict the types of attacks that the victims were likely to be exposed to with a high accuracy. The Logistic Regression was the leading method in detecting attackers with an accuracy rate of 65.42%. In the second model, we predicted whether the perpetrators could be identified by comparing their characteristics. Our results have revealed that the probability of cyber-attack decreases as the education and income level of victim increases. We believe that cyber-crime units will use the proposed model. It will also facilitate the detection of cyber-attacks and make the fight against these attacks easier and more effective.", "venue": "PeerJ Computer Science", "year": 2021, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-04-09", "journal": {"name": "PeerJ Computer Science", "volume": "7"}, "authors": [{"authorId": "2078333624", "name": "Abdulkadir Bilen"}, {"authorId": "153694658", "name": "A. Özer"}], "citations": [{"paperId": "693590dcce5ad5229d34d120233c8d9bec3997cb", "title": "Simulation and Analysis of Cyber Attacks on Power and Energy Systems"}, {"paperId": "34abb94a587a41c6914dea6174fb4c5d6c73de59", "title": "Exploring the impact of how criminals interact with cyber-networks—a mathematical modeling approach"}, {"paperId": "47f3eaa14fe51faa2321bfa387b48dd1db06abeb", "title": "Utilization of Artificial Intelligence in Predicting Crime"}, {"paperId": "034be60990f6104df5c3e78c94d172bf16d71a9c", "title": "Network Security in Cyberspace Using Machine Learning Techniques"}, {"paperId": "551e678cb8fb0719e1b125d7ba8b6306e3ec6527", "title": "Multi-stage intrusion detection system aided by grey wolf optimization algorithm"}, {"paperId": "1983ffba20cfe0458af0b48f6a84aa27e7275dd9", "title": "Detecting Conventional and Adversarial Attacks Using Deep Learning Techniques: A Systematic Review"}, {"paperId": "11ab2b174f164909a13f124581eaa7114df9cd84", "title": "Prediction of Future Nation-initiated Cyberattacks from News-based Political Event Graph"}, {"paperId": "b0a014f314313a33dee5188b2738f050b1361aa2", "title": "Deep Learning Assisted Cyber Criminal Profiling"}, {"paperId": "e25a88b62e1c06eac90bc4a12ffb2a8ab006efcc", "title": "Analyze and Forecast the Cyber Attack Detection Process using Machine Learning Techniques"}, {"paperId": "979c526741e626e20b7221db2c332d095dfd8147", "title": "Prediction of Cyber-attacks and Criminality Using Machine Learning Algorithms"}, {"paperId": "8759f0707326d81721fbca69f2dffee4e9bcf879", "title": "Cyber-Crime Detection: Experimental Techniques Comparison Analysis"}, {"paperId": "7b14601c78dfa5f2404a543e139485d29ff1b123", "title": "Disaster risk and artificial intelligence: A framework to characterize conceptual synergies and future opportunities"}, {"paperId": "eab05168926ca7bc3f8f2ccb4a82f3112961cd43", "title": "A DEEP NEURAL NETWORK FOR SPATIOTEMPORAL PREDICTION OF THEFT CRIMES"}, {"paperId": "14bd9dd7fe308fce6f45411de6fdb4c134e17207", "title": "Web Extension for Phishing URL Identification"}, {"paperId": "83b1f85fbfc6c56ae6e85d4a4679a3ba55526437", "title": "Regresyon Yöntemlerine Dayalı Suç Tespit Analizi Karşılaştırması Elazığ İli Örneği"}, {"paperId": "6cf8d72842537ed62ad882d2635a09063a4ca8fd", "title": "Human, All Too Human? An All-Around Appraisal of the “Artificial Intelligence Revolution” in Medical Imaging"}, {"paperId": "77981c14c63a302e9f87ad0676632548f1e525a6", "title": "Comparison and Investigation of AI-Based Approaches for Cyberattack Detection in Cyber-Physical Systems"}, {"paperId": "67e9e345dfa7f93257c82cc562f7a9c7372261b4", "title": "Global Cyber Attack Forecast using AI Techniques"}, {"paperId": "938a532b8f3c55f362e4e82a74873c7938297ac1", "title": "Enhancing Intrusion Detection in IoT Communications Through ML Model Generalization With a New Dataset (IDSAI)"}, {"paperId": "849d57ec77537562c4eb8731e8cdd7e0667b9072", "title": "Classification and Prediction of Significant Cyber Incidents (SCI) Using Data Mining and Machine Learning (DM-ML)"}, {"paperId": "cadf2442d6dad897c4865abea215d7e22ac9a277", "title": "Realizing a Multi-Layered Mobile Strategy for Underserved Areas for Cybersecurity Leadership"}]}
