{"paperId": "839ed46d8654a9f68597568c37e8e73077b15486", "publicationVenue": null, "title": "Spatial data systems support for the internet of things", "abstract": "The Internet of Things (IoT) has recently received significant attention. An IoT device may possess an array of sensors that for example monitors the air temperature, carbon monoxide level, wifi signals, and sound intensity. IoT data is initially created on the device, then sent over to a central database system (e.g., the cloud) that organizes and prepares such data for the ongoing use by myriad applications, which include but are not limited to smart home, smart city, the industrial internet, connected cars, and connected health. Data generated by IoT devices is inherently spatial and temporal. For instance, an audio signal represents the variation of the sound intensity (retrieved by a sound sensor) over the time dimension. Furthermore, IoT devices are either installed in a static location (e.g., a building, a traffic intersection) or can be attached to moving objects such as a connected vehicle or a wearable device. In this article, we argue that existing IoT data systems do not properly consider the SpatioTemporal aspect of such data. Hence, the article represents a call for action to the SIGSPATIAL community in order to conduct research on building systems and applications that treat both the spatial and temporal dimensions of IoT data as first class citizens.", "venue": "ACM SIGSPATIAL Special", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-10-26", "journal": {"name": "SIGSPATIAL Special", "pages": "42 - 47", "volume": "12"}, "authors": [{"authorId": "1769421", "name": "Mohamed Sarwat"}], "citations": [{"paperId": "f5d1069018fb1263d8101810fd6547aaa4f94f20", "title": "Clustering-based method for big spatial data partitioning"}, {"paperId": "b4b8286b866a17464a4133c5aa49a3737bdfa2ae", "title": "AI-based Fog and Edge Computing: A Systematic Review, Taxonomy and Future Directions"}, {"paperId": "d67f47a0accb2b3f3af3700c04a3fd6f67d91c5e", "title": "Mobile edge computing for V2X architectures and applications: A survey"}, {"paperId": "0b262a0b4952ebc490a743db36a78355ed94a427", "title": "Internet of Things"}, {"paperId": "7dc215cbc3c3e2d93ac5789e989af3659c133eb0", "title": "Applications of geospatial big data in the Internet of Things"}, {"paperId": "0b0f79be5ea35c3e3ce3d1c28f12b4b2086656fc", "title": "Scalable analytics of air quality batches with Apache Spark and Apache Sedona"}]}
