{"paperId": "83a27858be6d9ae55acb64f7f5ba8fb0b5d3c1fb", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Pruned Landmark Labeling Meets Vertex Centric Computation: A Surprisingly Happy Marriage!", "abstract": "In this paper, we study how the Pruned Landmark Labeling (PPL) algorithm can be parallelized in a scalable fashion, producing the same results as the sequential algorithm. More specifically, we parallelize using a Vertex-Centric (VC) computational model on a modern SIMD powered multicore architecture. We design a new VC-PLL algorithm that resolves the apparent mismatch between the inherent sequential dependence of the PLL algorithm and the Vertex- Centric (VC) computing model. Furthermore, we introduce a novel batch execution model for VC computation and the BVC-PLL algorithm to reduce the computational inefficiency in VC-PLL. Quite surprisingly, the theoretical analysis reveals that under a reasonable assumption, BVC-PLL has lower computational and memory access costs than PLL and indicates it may run faster than PLL as a sequential algorithm. We also demonstrate how BVC-PLL algorithm can be extended to handle directed graphs and weighted graphs and how it can utilize the hierarchical parallelism on a modern parallel computing architecture. Extensive experiments on real-world graphs not only show the sequential BVC-PLL can run more than two times faster than the original PLL, but also demonstrates its parallel efficiency and scalability.", "venue": "arXiv.org", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-06-28", "journal": {"name": "ArXiv", "volume": "abs/1906.12018"}, "authors": [{"authorId": "1740308", "name": "R. Jin"}, {"authorId": "2113952229", "name": "Zhen Peng"}, {"authorId": "12237726", "name": "W. Wu"}, {"authorId": "1757152", "name": "F. Dragan"}, {"authorId": "145340303", "name": "G. Agrawal"}, {"authorId": "153108488", "name": "Bin Ren"}], "citations": [{"paperId": "b948ad86ef3efe4039adc3c7fa75fdf4c3dcf404", "title": "Workload-Aware Shortest Path Distance Querying in Road Networks"}, {"paperId": "c10013dc6d3b44852084883e9235c6d80923cdae", "title": "PathEnum: Towards Real-Time Hop-Constrained s-t Path Enumeration"}, {"paperId": "6510ef26ad1da6c9c8863a8dc0428d122bb17c81", "title": "Parallelizing pruned landmark labeling: dealing with dependencies in graph algorithms"}]}
