{"paperId": "83c73fdce066529d3e13083aa5364bf1ce88ad5e", "publicationVenue": null, "title": "Research on Acceptance of Intelligent Substation Equipment Based on Secondary System Debugging Technology", "abstract": "Substation has always been the hub of power grid transmission, supply and distribution. Its construction has become a key link in the process of power grid construction. In the operation of the power grid, the secondary system provides the basic guarantee for the safe operation of the substation. The safety and reliability of the secondary work is of great significance to the power grid. In order to ensure the safe and stable operation of the secondary system, the protection still adopts the way of directly inputting the voltage and current of the primary system from the current and voltage transformer, and directly controlling the circuit breaker outlet through the relay. This paper mainly aims at the acceptance status of secondary equipment in the intelligent substation. Based on the analytic hierarchy process for data acquisition, analysis and research, obtain the operation acceptance status of secondary equipment in smart substation and make fault prediction. In the example test, the final evaluation score of the secondary equipment in the smart substation is 97.54, which verifies the accuracy of the fuzzy comprehensive evaluation method. Establish a scientific, consistent, feasible and standard state index for the power system.", "venue": "Journal of Physics: Conference Series", "year": 2022, "fieldsOfStudy": ["Physics"], "publicationTypes": ["Conference"], "publicationDate": "2022-04-01", "journal": {"name": "Journal of Physics: Conference Series", "volume": "2260"}, "authors": [{"authorId": "2135960731", "name": "Wenwei Li"}, {"authorId": "2108683856", "name": "Xiaoming Wang"}, {"authorId": "2216899181", "name": "Zipei Guo"}], "citations": [{"paperId": "6a4e8965e99dcfd7c6230493aff4409f2c14123f", "title": "The construction schedule of medium voltage overhead distribution network is optimized based on neural network algorithm"}, {"paperId": "d04d0e692a7b2d4d419f0cd920e1014c771fcef1", "title": "Grid risk intelligent analysis system based on communication network and power grid coupling"}, {"paperId": "2a94a29f12bb4def88357dc06846260a676e4d5c", "title": "Construction of power equipment fault feature model based on unified semantic expression"}, {"paperId": "e4e9ecab8e89ba5b7d728501c4c1a89ab94c966b", "title": "Construction Schedule of Medium Voltage Overhead Distribution Network Optimization Based on Neural Network Algorithm"}]}
