{"paperId": "83caf4c1063f7738f1a9adae8d57622d4c7c2e91", "publicationVenue": {"id": "8e1bd4b5-d5b2-4e22-ba0a-01fe5568d472", "name": "Remote Sensing", "type": "journal", "alternate_names": ["Remote Sens"], "issn": "2315-4675", "alternate_issns": ["2072-4292"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169233", "alternate_urls": ["https://www.mdpi.com/journal/remotesensing", "http://www.mdpi.com/journal/remotesensing", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169233"]}, "title": "A Robust Method for Generating High-Spatiotemporal-Resolution Surface Reflectance by Fusing MODIS and Landsat Data", "abstract": "The methods for accurately fusing medium- and high-spatial-resolution satellite reflectance are vital for monitoring vegetation biomass, agricultural irrigation, ecological processes and climate change. However, the currently existing fusion methods cannot accurately capture the temporal variation in reflectance for heterogeneous landscapes. In this study, we proposed a new method, the spatial and temporal reflectance fusion method based on the unmixing theory and a fuzzy C-clustering model (FCMSTRFM), to generate Landsat-like time-series surface reflectance. Unlike other data fusion models, the FCMSTRFM improved the similarity of pixels grouped together by combining land cover maps and time-series data cluster algorithms to define endmembers. The proposed method was tested over a 2000 km2 study area in Heilongjiang Provence, China, in 2017 and 2018 using ten images. The results show that the accuracy of the FCMSTRFM is better than that of the popular enhanced spatial and temporal adaptive reflectance fusion model (ESTARFM) (correlation coefficient (R): 0.8413 vs. 0.7589; root mean square error (RMSE): 0.0267 vs. 0.0401) and the spatial-temporal data fusion approach (STDFA) (R: 0.8413 vs. 0.7666; RMSE: 0.0267 vs. 0.0307). Importantly, the FCMSTRFM was able to maintain the details of temporal variations in complicated landscapes. The proposed method provides an alternative method to monitor the dynamics of land surface variables over complicated heterogeneous regions.", "venue": "Remote Sensing", "year": 2020, "fieldsOfStudy": ["Environmental Science", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-07-18", "journal": {"name": "Remote. Sens.", "pages": "2312", "volume": "12"}, "authors": [{"authorId": "1705844883", "name": "Junming Yang"}, {"authorId": "2415824", "name": "Yunjun Yao"}, {"authorId": "2300283", "name": "Yongxia Wei"}, {"authorId": "2108543260", "name": "Yuhu Zhang"}, {"authorId": "144091220", "name": "K. Jia"}, {"authorId": "49470539", "name": "Xiaotong Zhang"}, {"authorId": "1454044319", "name": "Ke Shang"}, {"authorId": "152747946", "name": "Xiangyi Bei"}, {"authorId": "152978072", "name": "Xiaozheng Guo"}], "citations": [{"paperId": "ef19719c49336db59be72d9fbc0bd478ebd32674", "title": "Estimation of the Concentration of XCO2 from Thermal Infrared Satellite Data Based on Ensemble Learning"}, {"paperId": "41b7920fbae76422c09910e9d9ed6bb465f1a06c", "title": "A review of remote sensing image spatiotemporal fusion: Challenges, applications and recent trends"}, {"paperId": "210d58a58454b94658b9b74a84a64e2f9e9b25d9", "title": "High-Spatial-Resolution NDVI Reconstruction with GA-ANN"}, {"paperId": "a009411e5dd4055516ee02b7b4fdcfa0c61978d8", "title": "Thermal infrared remote sensing data downscaling investigations: An overview on current status and perspectives"}, {"paperId": "7c5d730051214db17dee92f4b50f202b0d0f8f54", "title": "A reliable and adaptive spatiotemporal data fusion method for blending multi-spatiotemporal-resolution satellite images"}, {"paperId": "409812fa29f90881c00712cd560a3fd290161304", "title": "Mapping Tree Species Using Advanced Remote Sensing Technologies: A State-of-the-Art Review and Perspective"}, {"paperId": "871a5a1b935537264655ff41e26948d404454c9d", "title": "Using Partial Cloud-Free Images to Improve Spatiotemporal Fusion for Terrestrial Latent Heat Flux: The Multiphase Self-Adaptive (MSA) Model"}, {"paperId": "e52edb429d3e7b5c38b8a8ecdd730289b1fe925f", "title": "Spatial analysis of particulate matter (PM10) using MODIS aerosol optical thickness observations and GIS over East Malaysia"}, {"paperId": "8c70bffdba0cd9fa464acbab47af030b2a20e672", "title": "An Improved Spatiotemporal Fusion Algorithm for Monitoring Daily Snow Cover Changes With High Spatial Resolution"}]}
