{"paperId": "83d19bf272a2d5a6e117c685d914af1154a3a243", "publicationVenue": {"id": "7bb54772-a70c-44df-9b9d-9f3b5354c0e2", "name": "IEEE International Parallel and Distributed Processing Symposium", "type": "conference", "alternate_names": ["IEEE Int Parallel Distrib Process Symp", "International Parallel and Distributed Processing Symposium", "IPDPS", "Int Parallel Distrib Process Symp"], "url": "http://www.ipdps.org/"}, "title": "SALoBa: Maximizing Data Locality and Workload Balance for Fast Sequence Alignment on GPUs", "abstract": "Sequence alignment forms an important backbone in many sequencing applications. A commonly used strategy for sequence alignment is an approximate string matching with a two-dimensional dynamic programming approach. Although some prior work has been conducted on GPU acceleration of a sequence alignment, we identify several shortcomings that limit exploiting the full computational capability of modern GPUs. This paper presents SALoBa, a GPU-accelerated sequence alignment library focused on seed extension. Based on the analysis of previous work with real-world sequencing data, we propose techniques to exploit the data locality and improve work-load balancing. The experimental results reveal that SALoBa significantly improves the seed extension kernel compared to state-of-the-art GPU-based methods.", "venue": "IEEE International Parallel and Distributed Processing Symposium", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-05-01", "journal": {"name": "2022 IEEE International Parallel and Distributed Processing Symposium (IPDPS)", "pages": "728-738"}, "authors": [{"authorId": "2118886501", "name": "Seong-Bin Park"}, {"authorId": "2176603384", "name": "Hajin Kim"}, {"authorId": "2056326790", "name": "Tanveer Ahmad"}, {"authorId": "123757203", "name": "Nauman Ahmed"}, {"authorId": "1387519224", "name": "Z. Al-Ars"}, {"authorId": "1698579", "name": "H. P. Hofstee"}, {"authorId": "2567514", "name": "Youngsok Kim"}, {"authorId": "2108602524", "name": "Jinho Lee"}], "citations": [{"paperId": "e252a67c13447254bd314e7aabeba1a7fffb62ac", "title": "AGAThA: Fast and Efficient GPU Acceleration of Guided Sequence Alignment for Long Read Mapping"}, {"paperId": "e3aff4f654790a7c8b7d7af175d241fd32ca6a8b", "title": "Performance Analysis of Parallel Implementations of Global Sequence Alignment Methods for DNA Sequencing"}]}
