{"paperId": "83e5a6c3c4c073f908d728882c7f6b049d682a20", "publicationVenue": {"id": "ccd8e532-73c6-414f-bc91-271bbb2933e2", "name": "Electronics", "type": "journal", "issn": "1450-5843", "alternate_issns": ["2079-9292", "0883-4989"], "url": "http://www.electronics.etfbl.net/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-247562", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-247562", "https://www.mdpi.com/journal/electronics"]}, "title": "A DRL-Based Task Offloading Scheme for Server Decision-Making in Multi-Access Edge Computing", "abstract": "Multi-access edge computing (MEC), based on hierarchical cloud computing, offers abundant resources to support the next-generation Internet of Things network. However, several critical challenges, including offloading methods, network dynamics, resource diversity, and server decision-making, remain open. Regarding offloading, most conventional approaches have neglected or oversimplified multi-MEC server scenarios, fixating on single-MEC instances. This myopic focus fails to adapt to computational offloading during MEC server overload, rendering such methods sub-optimal for real-world MEC deployments. To address this deficiency, we propose a solution that employs a deep reinforcement learning-based soft actor-critic (SAC) approach to compute offloading and facilitate MEC server decision-making in multi-user, multi-MEC server environments. Numerical experiments were conducted to evaluate the performance of our proposed solution. The results demonstrate that our approach significantly reduces latency, enhances energy efficiency, and achieves rapid and stable convergence, thereby highlighting the algorithm’s superior performance over existing methods.", "venue": "Electronics", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-14", "journal": {"name": "Electronics"}, "authors": [{"authorId": "3413111", "name": "Ducsun Lim"}, {"authorId": "1686981", "name": "I. Joe"}], "citations": [{"paperId": "45eeab88838abf6c4a78c47961aeb1e33a68ce6c", "title": "EDITORS: Energy-aware Dynamic Task Offloading using Deep Reinforcement Transfer Learning in SDN-enabled Edge Nodes"}, {"paperId": "5a6b6e40081715255fde0a1ef8f67ff961e3bdce", "title": "Soft Actor-Critic-Based Service Migration in Multiuser MEC Systems"}, {"paperId": "a46fac22128f3681736c3f3fa703a0a9e9385dff", "title": "PPO-Based Joint Optimization for UAV-Assisted Edge Computing Networks"}, {"paperId": "84b5de6412e781cce7ba7bc8cb14af7253a839e1", "title": "Optimization of Task-Scheduling Strategy in Edge Kubernetes Clusters Based on Deep Reinforcement Learning"}]}
