{"paperId": "83e5d03981cf79f12ba302dc1682abf3702fd7aa", "publicationVenue": {"id": "528ced1f-e949-4e1a-8fee-2ffbf0be551d", "name": "Conference on Innovative Data Systems Research", "type": "conference", "alternate_names": ["CIDR", "Conf Innov Data Syst Res"], "url": "http://cidrdb.org/"}, "title": "DataSense: Display-Agnostic Data Documentation", "abstract": "Producing and consuming documentation is an essential step when creating and analyzing data. Good documentation helps a consumer of data to understand the context of the data and its schema, including (i) semantics (e.g., the currency of an account balance), (ii) data collection techniques (e.g., which assay was used to measure blood iron), (iii) limitations or caveats (e.g., that missing values are due to sensor failure), and (iv) assumptions made (e.g., missing geographical locations were inferred through geocoding). Misunderstanding the context of a dataset can lead to statistical errors and mistakes with potentially serious, life-threatening consequences. In short, good data documentation is critical. Unfortunately, extensive documentation can overwhelm users, making it hard to find elements in the documentation that are relevant for the task at hand. We need a better way to interact with documentation than the current state of the art: dozens or even hundreds of pages of word documents. Modern code development environments (IDEs) present a compelling solution for code: (i) Syntax highlighting is a high-level overview of the document structure, helping users to survey it; and (ii) Mouseover detail views show users the specifics of functions, types, classes, etc. We argue that a similar paradigm is needed for datasets, a paradigm we term display-agnostic data documentation ( DAD ). DAD facilitates both discovery and lookup of context-relevant data documentation by inlining them directly and interactively into the data display. This documentation can often be derived from the data or by analyzing provenance. Many such techniques already exist, from fully automated data documentation techniques like data profiling, provenance summarization, to user-provided prose annotations. For example:", "venue": "Conference on Innovative Data Systems Research", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference", "Review"], "publicationDate": null, "journal": null, "authors": [{"authorId": "145948846", "name": "P. Kumari"}, {"authorId": "147423641", "name": "Mike Brachmann"}, {"authorId": "2087587228", "name": "Su Feng"}, {"authorId": "144018997", "name": "Oliver Kennedy"}, {"authorId": "1798930", "name": "Boris Glavic"}], "citations": [{"paperId": "7896e3970556e3f4f2b9098b39ee6ce745127664", "title": "Overlay Spreadsheets"}, {"paperId": "72f6b4c898517d4d312e567a3b14e7ce431c3cb6", "title": "Social determinants of health derived from people with opioid use disorder: Improving data collection, integration and use with cross-domain collaboration and reproducible, data-centric, notebook-style workflows"}, {"paperId": "87a741701c302bfc2120b3789e68ecefc06523db", "title": "The Right Tool for the Job: Data-Centric Workflows in Vizier"}]}
