{"paperId": "83e8af507697b73f6c0b7741d9af373ce332fa37", "publicationVenue": {"id": "56d73aaf-5cb7-41d1-9bab-614a4634b369", "name": "Journal of Advanced Research in Applied Sciences and Engineering Technology", "type": "journal", "alternate_names": ["J Adv Res Appl Sci Eng Technol"], "issn": "2462-1943", "url": "http://www.akademiabaru.com/araset.html"}, "title": "Smart Campus 4.0: Digitalization of University Campus with Assimilation of Industry 4.0 for Innovation and Sustainability", "abstract": "According to the United Nations, global sustainability in terms of social, economic, and environmental issues must be achieved by 2030. SDGs 4 and 9 are related to education and strengthen the attainment of quality education and infrastructure innovation. Resilient infrastructure plays a significant role in strengthening the campus in terms of education, management, placement and environment. These all aspects come under the smart campus. Smart campus 4.0 is the amalgamation of multitude industry 4.0 enabling technologies for delivering smart and innovative facilities with the aspect of sustainability. The previous studies have proved that the sustainable development goals (SDGs) can be achieved with the amalgamation of industry 4.0 enabling technologies in the campus such as cloud computing, artificial intelligence (AI), Internet of things (IoT), edge/fog computing, blockchain, robot process automation (RPA), drones, augmented reality (AR), virtual reality (VR), big data, digital twin, and metaverse. The main objective of this study to provide the detailed discussion of all industry 4.0 enabling technologies in single research related to smart campus. The findings observed are IoT-Based Drone system is intended to ground patrolling, and a cloud server to develop a smart campus energy monitoring system. AI for campus placement prediction model; cloud and Edge computing architecture to build an intelligent air-quality monitoring system. The novelty of the study, it has discussed all industry 4.0 enabling technologies for a smart campus with challenges, recommendations, and future directions.", "venue": "Journal of Advanced Research in Applied Sciences and Engineering Technology", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-19", "journal": {"name": "Journal of Advanced Research in Applied Sciences and Engineering Technology"}, "authors": [{"authorId": "2237500000", "name": "Satish Kumar Mahariya"}, {"authorId": "2243016863", "name": "Awaneesh Kumar"}, {"authorId": "2237606689", "name": "Rajesh Singh"}, {"authorId": "9280578", "name": "Anita Gehlot"}, {"authorId": "1712192495", "name": "S. Akram"}, {"authorId": "2662511", "name": "Bhekisipho Twala"}, {"authorId": "2237514165", "name": "Mohammed Ismail Iqbal"}, {"authorId": "51281171", "name": "Neeraj Priyadarshi"}], "citations": [{"paperId": "79d43cb9c1fd9a9bcf502985bc5a0428fd1391ec", "title": "Examining IoT-Based Smart Campus Adoption Model: An Investigation Using Two-Stage Analysis Comprising Structural Equation Modelling and Artificial Neural Network"}, {"paperId": "3519e161a0fb5ba414b72dbf8fe52264c9af2d6d", "title": "Metaverse as a cutting-edge platform for attaining Sustainable Development Goals (SDGs)"}, {"paperId": "559b0b19dd6cecbb80c9b8e44a4be2f961386352", "title": "Development of Deep Learning Enabled Augmented Reality Framework for Monitoring the Physical Quality Training of Future Trainers-Teachers"}]}
