{"paperId": "84166c6920960b0ce128a7359a6d18196d915fc3", "publicationVenue": {"id": "ab453bce-d4ec-48ec-ad78-ef19dc9333ab", "name": "Conference and Labs of the Evaluation Forum", "type": "conference", "alternate_names": ["CLEF", "Conf Lab Evaluation Forum", "Cross-language Evaluation Forum", "Cross-Language Evaluation Forum"], "url": "http://www.clef-initiative.eu/"}, "title": "UNSL at eRisk 2021: A Comparison of Three Early Alert Policies for Early Risk Detection", "abstract": "Early risk detection (ERD) can be considered as a multi-objective problem in which the challenge is to find an adequate trade-off between two different and related aspects: 1) the accuracy in identifying risky users and, 2) the minimum time that a risky user detection requires to be reliable. The first aspect is usually addressed as a typical classification problem and evaluated with standard classification metrics like precision, recall, and 𝐹 1 . The second one involves a policy to decide when the information from a user classified as risky is enough to raise an alarm/alert and usually is evaluated by penalizing the delay in making that decision. In fact, temporal evaluation metrics used in ERD like ERDE 𝜃 and 𝐹 latency combine both aspects in different ways. In that context, unlike our previous participations at eRisk Labs, we focus this year on the second aspect in ERD tasks, that is to say, the early alert policies that decide if a user classified as risky should effectively be reported as such. In this paper, we describe three different early alert policies that our research group from the Universidad Nacional de San Luis (UNSL) used at the CLEF eRisk 2021 Lab. Those policies were evaluated on the two ERD tasks proposed for this year: early risk detection of pathological gambling and early risk detection of self-harm. The first approach uses standard classification models to identify risky users and a simple (manual) rule-based early alert policy. The second approach is a deep learning model trained end-to-end that simultaneously learns to identify risky users and the early alert policy through a Rein-forcement Learning approach. Finally, the last approach consists of a simple and interpretable model that identifies risky users, integrated with a global early alert policy. That policy, based on the (global) estimated risk level for all processed users, decides which users should be reported as risky. Regarding the achieved results, our models obtained the best performance in terms of decision-based performance metrics ( 𝐹 1 , ERDE 50 , 𝐹 latency ) as well as in terms of the ranking-based performance measures, for both tasks. Furthermore, in terms of the 𝐹 latency measure, the performance obtained in the first task was twice as good as the second-best team.", "venue": "Conference and Labs of the Evaluation Forum", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"pages": "992-1021"}, "authors": [{"authorId": "65851863", "name": "J. M. Loyola"}, {"authorId": "51168007", "name": "S. Burdisso"}, {"authorId": "2124424899", "name": "Horacio Thompson"}, {"authorId": "145418766", "name": "L. Cagnina"}, {"authorId": "2652846", "name": "M. Errecalde"}], "citations": [{"paperId": "f64f00621638d2d3bb7e3412bdeb53d6b4adf543", "title": "Automatic detection of problem-gambling signs from online texts using large language models"}, {"paperId": "a694e85fe1725c0f1d1a1984fbf773ba5b05d79b", "title": "Strategies to Harness the Transformers' Potential: UNSL at eRisk 2023"}, {"paperId": "b117f220c6e2172ddb1552299ee883dbb2aaac1b", "title": "Early Detection of Depression and Eating Disorders in Spanish: UNSL at MentalRiskES 2023"}, {"paperId": "6b88fd846b20cf72ef411885501f1902ddac6a75", "title": "Applications of data science for responsible gambling: a scoping review"}, {"paperId": "0d943b36e5f2b14316039a8fc3c15529e48a8336", "title": "An End-to-End Set Transformer for User-Level Classification of Depression and Gambling Disorder"}, {"paperId": "c879fe679170b66779ba9240187b0effebc137bf", "title": "ELiRF-UPV at eRisk 2023: Early detection of pathological gambling using SVM"}, {"paperId": "795cefef5fa431671fa7a49a90914aa971290b16", "title": "NLP-UNED-2 at eRisk 2023: Detecting Pathological Gambling in Social Media through Dataset Relabeling and Neural Networks"}, {"paperId": "e518d148df8bdc0dba66c4ee5531940c809b235d", "title": "ZHAW at eRisk 2022: Predicting Signs of Pathological Gambling - GloVe for Snowy Days"}, {"paperId": "a7c0820d3896c904bb9e63a98636b35f1c81d1c0", "title": "UNED-NLP at eRisk 2022: Analyzing gambling disorders in Social Media using Approximate Nearest Neighbors"}, {"paperId": "19a11cab99009bd304ae69fb84469f5b0ebb0be0", "title": "UNSL at eRisk 2022: Decision policies with history for early classification"}]}
