{"paperId": "84294c7bbde52b026fc08dae023998af97b52218", "publicationVenue": {"id": "4beec6e4-346c-42c4-9ba1-51c51e7709d0", "name": "International Journal of General Systems", "type": "journal", "alternate_names": ["Int J Gen Syst"], "issn": "0308-1079", "url": "http://www.tandfonline.com/action/journalInformation?journalCode=ggen20"}, "title": "Efficient distributed algorithms for distance join queries in spark-based spatial analytics systems", "abstract": "ABSTRACT Apache Sedona (formerly GeoSpark) is a new in-memory cluster computing system for processing large-scale spatial data, which extends the core of Apache Spark to support spatial datatypes, partitioning techniques, spatial indexes, and spatial operations (e.g. spatial range, nearest neighbor, and spatial join queries). Distance-based Join Queries (DJQs), like nearest neighbor join (kNNJQ) or closest pairs queries (kCPQ), are not supported by it. Therefore, in this paper, we investigate how to design and implement efficient DJQ distributed algorithms in Apache Sedona, using the most appropriate spatial partitioning and other optimization techniques. The results of an extensive set of experiments with real-world datasets are presented, demonstrating that the proposed kNNJQ and kCPQ distributed algorithms are efficient, scalable, and robust in Apache Sedona. Finally, Sedona is also compared to other similar cluster computing systems, showing the best performance for kCPQ and competitive results for kNNJQ.", "venue": "International Journal of General Systems", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-02-19", "journal": {"name": "International Journal of General Systems", "pages": "206 - 250", "volume": "52"}, "authors": [{"authorId": "1410620391", "name": "Francisco García-García"}, {"authorId": "145747811", "name": "Antonio Corral"}, {"authorId": "1807223", "name": "L. Iribarne"}, {"authorId": "1809602", "name": "M. Vassilakopoulos"}], "citations": [{"paperId": "ca7f283addfd4087fe68e3cb53f0e5f2364e78d9", "title": "Machine learning platform design and application based on spark"}, {"paperId": "c26bc1e91a0ea0f4edfdbfdc280e3b4eb869f6e0", "title": "RelJoin: Relative-cost-based Selection of Distributed Join Methods for Query Plan Optimization"}, {"paperId": "357e49bcc13f09598e5269bca18ab164f12b8e19", "title": "Preface of the special issue on advances in data-driven engineering"}]}
