{"paperId": "842d7d377dd51e1b949b139c928cba5e2841fb2d", "publicationVenue": {"id": "57f970eb-366a-4bfa-aa06-2ff70d834806", "name": "IEEE/ACM International Symposium on Cluster, Cloud and Internet Computing", "type": "conference", "alternate_names": ["Clust Comput Grid", "CCGRID", "IEEE/ACM Int Symp Clust Cloud Grid Comput", "IEEE/ACM International Symposium Cluster, Cloud and Grid Computing", "Cluster Computing and the Grid", "IEEE/ACM Int Symp Clust Cloud Internet Comput"], "url": "http://www.buyya.com/ccgrid/"}, "title": "In Datacenter Performance, The Only Constant Is Change", "abstract": "All computing infrastructure suffers from performance variability, be it bare-metal or virtualized. This phenomenon originates from many sources: some transient, such as noisy neighbors, and others more permanent but sudden, such as changes or wear in hardware, changes in the underlying hypervisor stack, or even undocumented interactions between the policies of the computing resource provider and the active workloads. Thus, performance measurements obtained on clouds, HPC facilities, and, more generally, datacenter environments are almost guaranteed to exhibit performance regimes that evolve over time, which leads to undesirable nonstationarities in application performance. In this paper, we present our analysis of performance of the bare-metal hardware available on the CloudLab testbed where we focus on quantifying the evolving performance regimes using changepoint detection. We describe our findings, backed by a dataset with nearly 6.9M benchmark results collected from over 1600 machines over a period of 2 years and 9 months. These findings yield a comprehensive characterization of real-world performance variability patterns in one computing facility, a methodology for studying such patterns on other infrastructures, and contribute to a better understanding of performance variability in general.", "venue": "IEEE/ACM International Symposium on Cluster, Cloud and Internet Computing", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-03-10", "journal": {"name": "2020 20th IEEE/ACM International Symposium on Cluster, Cloud and Internet Computing (CCGRID)", "pages": "370-379"}, "authors": [{"authorId": "2474639", "name": "Dmitry Duplyakin"}, {"authorId": "2860260", "name": "Alexandru Uta"}, {"authorId": "51461457", "name": "Aleksander Maricq"}, {"authorId": "144993692", "name": "R. Ricci"}], "citations": [{"paperId": "0c3c7e99f51af98916b6a5503305f6d2d37148ab", "title": "Secure and Agile 6G Networking – Quantum and AI Enabling Technologies"}, {"paperId": "96e345f9ba63383a60b7c520ef2906f165f3b173", "title": "The Performance of Distributed Applications: A Traffic Shaping Perspective"}, {"paperId": "d8d17c2cac15ed55d0fc301545fd67d8aa7beb24", "title": "Hunter: Using Change Point Detection to Hunt for Performance Regressions"}, {"paperId": "5afae4a5a9674a893bff372133adb59346848d44", "title": "Performance Variability and Causality in Complex Systems"}, {"paperId": "5e7a9e09b27b917cb6d032a417d7958a99aab4ae", "title": "Cloud Performance Variability Prediction"}, {"paperId": "182fa6ad0e077f495d00fdfeb755f69fb0535fae", "title": "Creating a Virtuous Cycle in Performance Testing at MongoDB"}, {"paperId": "dee0652584849bfa914cd1c009bea949ccec4d5b", "title": "Avoiding the Ordering Trap in Systems Performance Measurement"}, {"paperId": "0d86ad66746691d5b7e1537045d7c25e3ea15d4e", "title": "SURFB OARD : R EPRODUCIBLE P ERFORMANCE A NALYSIS FOR D ISTRIBUTED M ACHINE L EARNING W ORKFLOWS"}, {"paperId": "66b9fcb4768b20df1c559fe083360229cf4764b9", "title": "Secure and Agile 6G Networking"}]}
