{"paperId": "84307b29577991e47ed7f4c8f4c587bfd4fd8395", "publicationVenue": {"id": "97ab7809-0edd-42b4-ab3f-9f6a6099102a", "name": "International Food and Agribusiness Management Review", "type": "journal", "alternate_names": ["The International Food and Agribusiness Management Review", "Int Food Agribus Manag Rev"], "issn": "1096-7508", "url": "http://www.sciencedirect.com/science/journal/10967508", "alternate_urls": ["https://www.wageningenacademic.com/journals/ifamr/general-information", "https://www.ifama.org/resources/Documents/v17i3/Zander-Beske.pdf"]}, "title": "Shortening food supply chain in home-grown school feeding: experiences and lessons from south central China", "abstract": "\nBoth home-grown school feeding (HGSF) and short food supply chain (SFSC) emphasize on proximity and aim to strengthen the competitiveness of local smallholder farmers. From a theoretical perspective, HGSF implemented as a type of SFSC could help deliver synergies. A pivotal question is how HGSF can be combined with SFSC and the benefits and drawbacks of such combination. Using an HGSF program which was implemented as an integral part of a free preschool lunch pilot in South Central China, this paper shows that HGSF and SFSC (in its full term) could be combined through one structured demand intervention. This study uses both qualitative and quantitative materials. Qualitative data were collected through focus group discussions with government and preschool staff, parents or caregivers, cooks, World Food Programme representatives and other stakeholders involved in the pilot program. The quantitative part used both small panel data and cross-sectional data from 106 smallholders. This study analyzes the design, implementation, good practices, benefits and constraints of the HGSF-SFSC model. We find that direct purchase from smallholder farmers was linked with higher income and production and dietary diversity. Moreover, this study identifies several constraints of the current HGSF-SFSC model. The policy implications for sustaining and scaling up the current pilot are discussed in the paper.", "venue": "International Food and Agribusiness Management Review", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-11-24", "journal": {"name": "International Food and Agribusiness Management Review"}, "authors": [{"authorId": "2269711577", "name": "Xinghua Liu"}, {"authorId": "2269734886", "name": "Chengfang Liu"}, {"authorId": "2269531997", "name": "Jieying Bi"}], "citations": []}
