{"paperId": "843a966baa72b8d495d2c7c28714be95f902b804", "publicationVenue": null, "title": "Efficient and Resilient Data Synchronization with Timestamp Compression in IoT Systems", "abstract": "Cohesive collaboration in distributed Internet of Things (IoT) systems relies exclusively on accurate time synchronization. However, traditional time synchronization methods over the Internet require frequent timestamp exchange, inevitably increasing the related network overhead and energy consumption. Furthermore, resource-constrained IoT devices and varying Internet conditions can easily lead to unreliable timestamp-based latency measurement during synchronization. In this paper, we propose both a resilient timestamping process for data synchronization over the Internet to retain accurate temporal relationships among data samples as well as a supporting timestamp compression technique to reduce the related overhead. The new timestamp design can support energy-efficient and reliable data synchronization over dynamic Internet conditions. Specifically, by measuring the clock cycles between two sampling instants using the local clocks, an accurate timestamp can be provided for each data sample while eliminating the unreliability induced by network uncertainties during data transmission. Moreover, MAC-layer timestamps are employed to estimate clock drifts inherent to each IoT device in comparison to the universal time reference, where redundant timestamps are compressed to minimize the communication and computation burden of energy-constrained IoT devices. Additionally, a check digit is derived from the compressed segments to validate timestamps, further enhancing synchronization reliability. Simulation results demonstrate the superiority of the proposed scheme with increased synchronization accuracy and prolonged network lifespan.", "venue": "2023 IEEE Globecom Workshops (GC Wkshps)", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-04", "journal": {"name": "2023 IEEE Globecom Workshops (GC Wkshps)", "pages": "1994-1999"}, "authors": [{"authorId": "32706834", "name": "Pengyi Jia"}, {"authorId": "2293239746", "name": "Yue Wen"}, {"authorId": "2292176293", "name": "Xianbin Wang"}], "citations": []}
