{"paperId": "844f18597bb32fc3248c1f0c691baed980547145", "publicationVenue": {"id": "4ab1e1bf-98e8-4e0c-a53a-7a00e37e44e2", "name": "The International Archives of the Photogrammetry, Remote Sensing and Spatial Information Sciences", "type": "journal", "alternate_names": ["Int Arch Photogramm Remote Sens Spat Inf Sci"], "issn": "1682-1750", "url": "https://www.isprs.org/publications/archives.aspx"}, "title": "GPU UTILIZATION IN GEOPROCESSING BIG GEODATA: A REVIEW", "abstract": "Abstract. The expansion of data collection from remote sensing and other geographic data sources, as well as from other technology such as cloud, sensors, mobile, and social media, have made mapping and analysis more complex. Some geospatial applications continue to rely on conventional geospatial processing, where limitation on computation capabilities often lacking to attain significant data interpretation. In recent years, GPU processing has improved far more GIS applications than using CPU alone. As a result, numerous researchers have begun utilising GPUs for scientific, geometric, and database computations in addition to graphics hardware use. This paper summarizes parallel processing concept and architecture, the development of GPU geoprocessing for big geodata ranging from remote sensing and 3D modelling to smart cities studies. This paper also addresses the GPU future trends advancement opportunities with other technologies, machine learning, deep learning, and cloud-based computing.\n", "venue": "The International Archives of the Photogrammetry, Remote Sensing and Spatial Information Sciences", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-01-11", "journal": {"name": "The International Archives of the Photogrammetry, Remote Sensing and Spatial Information Sciences"}, "authors": [{"authorId": "2265542862", "name": "Sazlieya Saupi"}, {"authorId": "2265544188", "name": "Alias Ivin Amri Musliman"}, {"authorId": "2265620685", "name": "Abdul Rahman"}], "citations": [{"paperId": "24e152270df0b79b44f25d24b3764997636e256f", "title": "Challenges of a GIS-based physical-geographical regionalization of Poland"}, {"paperId": "8bfbd2a7a755a81fed334bd7fe4fe9425c824a92", "title": "EARTH OBSERVATION DATACUBES MULTI-VISUALIZATION TOOLBOX"}]}
