{"paperId": "8453f80a6ca9f9b3d230d0102ec2dd32cd32e989", "publicationVenue": {"id": "7a30a111-07e4-4ab7-a402-1990d9cd4832", "name": "Telecommunications Forum", "type": "conference", "alternate_names": ["TELFOR", "Telecommun Forum"]}, "title": "Survey on machine learning algorithms as cloud service for CIDPS", "abstract": "Today IT vendors and mail/web/internet providers put their cloud strategy in the first place. Challenges such as data security, privacy protection, data access, storage model, lack of standards and service interoperability were set up almost ten years ago. This paper presents a part of the research on the cloud security systems at the infrastructure layer and its sublayer — network layer. To analyze and protect cloud systems we need storage and machines with extra features. Due to these needs, we used new technologies from Microsoft to suggest framework of host and network based systems for cloud intrusion detection and prevention system (CIDPS). The purpose of this research is to recommend use of the architecture for the detection network anomalies and protection of large amounts of data and traffic generated by cloud systems.", "venue": "Telecommunications Forum", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2017-11-01", "journal": {"name": "2017 25th Telecommunication Forum (TELFOR)", "pages": "1-4"}, "authors": [{"authorId": "92875232", "name": "I. Avdagic"}, {"authorId": "3330808", "name": "Kemal Hajdarevic"}], "citations": [{"paperId": "ad715e173bf53a48fc0ae09d77d90f7869310ed8", "title": "Machine learning for anomaly detection and process phase classification to improve safety and maintenance activities"}, {"paperId": "dad4e312e1b6370433f35b62ae90746bd8c86931", "title": "Cloud based Security Framework for Anomaly Based Intrusion Detection using Machine Learning Techniques"}, {"paperId": "6ccf181468b57389d75b70e1e666782c7519b143", "title": "Accuracy Enhancement in Machine Learning Approach for Cloud Application"}, {"paperId": "03535bbc40907d52e6a91427adf9da5b999a48a8", "title": "Machine Learning for Cloud Security: A Systematic Review"}, {"paperId": "935ff8c2c20ccb520e170e68fc27c6774c761e90", "title": "Use of Machine Learning Services in Cloud"}]}
