{"paperId": "84684845d285fc164425d8c40d6236de1d0b568c", "publicationVenue": {"id": "939ba3df-4270-4ba0-ad98-ffe889f3546e", "name": "Processes", "issn": "2227-9717", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-317995", "alternate_urls": ["https://www.mdpi.com/journal/processes", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-317995"]}, "title": "Task Containerization and Container Placement Optimization for MEC: A Joint Communication and Computing Perspective", "abstract": "Containers are used by an increasing number of Internet service providers to deploy their applications in multi-access edge computing (MEC) systems. Although container-based virtualization technologies significantly increase application availability, they may suffer expensive communication overhead and resource use imbalances. However, so far there has been a scarcity of studies to conquer these difficulties. In this paper, we design a workflow-based mathematical model for applications built upon interdependent multitasking composition, formulate a multi-objective combinatorial optimization problem composed of two subproblems—graph partitioning and multi-choice vector bin packing, and propose several joint task-containerization-and -container-placement methods to reduce communication overhead and balance multi-type computing resource utilization. The performance superiority of the proposed algorithms is demonstrated by comparison with the state-of-the-art task and container scheduling schemes.", "venue": "Processes", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-19", "journal": {"name": "ArXiv", "volume": "abs/2305.13732"}, "authors": [{"authorId": "2148558259", "name": "Ao Liu"}, {"authorId": "2115298554", "name": "Shaoshi Yang"}, {"authorId": "2217967117", "name": "Jingsheng Tan"}, {"authorId": "2026602199", "name": "Zong-qiang Liang"}, {"authorId": "2154934991", "name": "Jiasen Sun"}, {"authorId": "2055590281", "name": "Tao Wen"}, {"authorId": "46995326", "name": "Hongyan Yan"}], "citations": []}
