{"paperId": "84849418529ca40cbf8fa970ec17d1721e22fdd2", "publicationVenue": {"id": "68f951c0-009e-4451-9fdd-fb6fb73a47af", "name": "ACM/SIGCOMM Internet Measurement Conference", "type": "conference", "alternate_names": ["ACM/SIGCOMM Internet Meas Conf", "Internet Measurement Conference", "IEEE Int Multitopic Conf", "IMC", "Internet Meas Conf", "Int Conf Intell Interact Assist Mob Multimedia Comput", "International Conference on Intelligent Interactive Assistance and Mobile Multimedia Computing", "IEEE International Multitopic Conference"], "url": "http://www.sigcomm.org/events/imc-conference"}, "title": "Examination of WAN traffic characteristics in a large-scale data center network", "abstract": "Large cloud service providers have built an increasing number of geo-distributed data centers (DCs) connected by WAN to host their diverse services. While we have seen a large body of work on traffic engineering of WAN, the WAN traffic characteristics of production DC networks remain not well understood. In this paper, we report on the network traffic observed in Baidu's DC network (DCN) that consists of tens of geo-distributed DCs. Baidu hosts both traditional services like Web and Computing, as well as emerging services, such as Analytics, AI, and Map. We analyze WAN traffic characteristics in Baidu's DCN from the perspectives of traffic demands, traffic communication among DCs, and traffic characteristics of diverse services. Specifically, we focus on the disparity that might exist among different types of services. We also discuss the implications of our findings for WAN traffic engineering, fabric design, and service deployment.", "venue": "ACM/SIGCOMM Internet Measurement Conference", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2021-11-02", "journal": {"name": "Proceedings of the 21st ACM Internet Measurement Conference"}, "authors": [{"authorId": "2144719476", "name": "Zhaohua Wang"}, {"authorId": "50819554", "name": "Zhenyu Li"}, {"authorId": "48573548", "name": "Guangming Liu"}, {"authorId": "2144865185", "name": "Yunfei Chen"}, {"authorId": "2152862695", "name": "Qinghua Wu"}, {"authorId": "144869572", "name": "Gang Cheng"}], "citations": [{"paperId": "3eac1e61cf75b5cf80d80b0ea0059e15af85b264", "title": "Demystifying the QoS and QoE of Edge-hosted Video Streaming Applications in the Wild with SNESet"}, {"paperId": "d8822afb82cdbe6eea3aee860fe5aa52f8f86b54", "title": "Mitigating the impact of controller failures on QoS robustness for software-defined wide area networks"}, {"paperId": "919a58ea7ec73db460b0ba4c56a3c570487657cf", "title": "Bifrost: Extending RoCE for Long Distance Inter-DC Links"}, {"paperId": "7b7c6b99a3f79077d15d335d10624604458d8cc4", "title": "Felinet"}, {"paperId": "a268e23e84621873851775246d4df4aba10ba4e2", "title": "A large-scale holistic measurement of crowdsourced edge cloud platform"}, {"paperId": "2cb92ce56edaa7bde3fd5021bf5239270c095427", "title": "Maintaining QoS-aware and Resilient Path Programmability for Metaverse in SD-WANs"}, {"paperId": "ba186041f2f94eb7558349479345fd11022ed0e4", "title": "Modeling Sparse Store-and-Forward Bulk Data Transfers in Inter-Datacenter Networks With Multiple Congested Links"}, {"paperId": "0c08fb7a94ee8e93fed105b37729f7759e665731", "title": "A Holistic QoS View of Crowdsourced Edge Cloud Platform"}, {"paperId": "98c61f9a7cb4d3ce4c1b2f3b5ff6c8db0b883524", "title": "Reinforcement Learning-based Traffic Engineering for QoS Provisioning and Load Balancing"}, {"paperId": "e85f30482b2765d65a89766e2c175abecd239d20", "title": "Asynchronous multi-class traffic management in wide area networks"}, {"paperId": "1e7eebe93aa5295fdb2ec21cd3bc248db5a646a0", "title": "Large-Scale Measurements and Prediction of DC-WAN Traffic"}, {"paperId": "3488d554eb58839204a8c486fb517e622c52d6c5", "title": "Analysis and Prediction of the IPv6 Traffic over Campus Networks in Shanghai"}, {"paperId": "fa4188bcc6728b580699f714a8a6fe5fc60d7dfe", "title": "Rethinking data-driven networking with foundation models: challenges and opportunities"}, {"paperId": "b05db3592b8ee318a33a83301d4177ae9e812939", "title": "Fast Traffic Engineering by Gradient Descent with Learned Differentiable Routing"}, {"paperId": "f2efb0f5fa423448ea059b3c6d42983d6965785a", "title": "High-Speed Path Probing Method for Large-Scale Network"}, {"paperId": "3399801b8c5f50a617f359ccb280ef8b6b4effab", "title": "Flexible and Efficient Multicast Transfers in Inter-Datacenter Networks"}, {"paperId": "44ec3a0af2418ad24bfbd1a6f247e0c069394a06", "title": "Bandwidth Allocation Games"}, {"paperId": "842bfe0efb04228aedc5e8fd7bb33b7451e7f760", "title": "Research on ship tracking and control for COVID-19 epidemic prevention based on multi-source information fusion"}, {"paperId": "482a99310347ab1486bae3f93a5c266f68dfa9c2", "title": "ENERO: Efficient real-time WAN routing optimization with Deep Reinforcement Learning"}]}
