{"paperId": "84849eb18a103aac184668d72e469fa5545802e7", "publicationVenue": null, "title": "A Comprehensive Survey on Enterprise Financial Risk Analysis from Big Data Perspective", "abstract": "Enterprise financial risk analysis aims at predicting the future financial risk of enterprises. Due to its wide and significant application, enterprise financial risk analysis has always been the core research topic in the fields of Finance and Management. Based on advanced computer science and artificial intelligence technologies, enterprise risk analysis research is experiencing rapid developments and making significant progress. Therefore, it is both necessary and challenging to comprehensively review the relevant studies. Although there are already some valuable and impressive surveys on enterprise risk analysis from the perspective of Finance and Management, these surveys introduce approaches in a relatively isolated way and lack recent advances in enterprise financial risk analysis. In contrast, this paper attempts to provide a systematic literature survey of enterprise risk analysis approaches from Big Data perspective, which reviews more than 250 representative articles in the past almost 50 years (from 1968 to 2023). To the best of our knowledge, this is the first and only survey work on enterprise financial risk from Big Data perspective. Specifically, this survey connects and systematizes the existing enterprise financial risk studies, i.e. to summarize and interpret the problems, methods, and spotlights in a comprehensive way. In particular, we first introduce the issues of enterprise financial risks in terms of their types,granularity, intelligence, and evaluation metrics, and summarize the corresponding representative works. Then, we compare the analysis methods used to learn enterprise financial risk, and finally summarize the spotlights of the most representative works. Our goal is to clarify current cutting-edge research and its possible future directions to model enterprise risk, aiming to fully understand the mechanisms of enterprise risk generation and contagion.", "venue": "", "year": 2022, "fieldsOfStudy": ["Economics", "Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2022-11-28", "journal": null, "authors": [{"authorId": "97522134", "name": "Yu Zhao"}, {"authorId": "94613261", "name": "Huaming Du"}, {"authorId": "2117895423", "name": "Qing Li"}, {"authorId": "2162961864", "name": "Fuzhen Zhuang"}, {"authorId": "2155375528", "name": "Ji Liu"}, {"authorId": "2147326459", "name": "Gang Kou"}], "citations": [{"paperId": "20b104f1f10867f995cf0dfa146150220a999b70", "title": "ANALYSIS OF RISKS IN THE FINANCIAL SECURITY MANAGEMENT SYSTEM OF BUSINESS ENTITIES"}]}
