{"paperId": "848ef6ba20be884b6f7a9082cd877f63e3252812", "publicationVenue": {"id": "0aed7a40-85f3-4c66-9e1b-c1556c57001b", "name": "PLoS ONE", "type": "journal", "alternate_names": ["Plo ONE", "PLOS ONE", "PLO ONE"], "issn": "1932-6203", "url": "https://journals.plos.org/plosone/", "alternate_urls": ["http://www.plosone.org/"]}, "title": "Comparing spatial regression to random forests for large environmental data sets", "abstract": "Environmental data may be “large” due to number of records, number of covariates, or both. Random forests has a reputation for good predictive performance when using many covariates with nonlinear relationships, whereas spatial regression, when using reduced rank methods, has a reputation for good predictive performance when using many records that are spatially autocorrelated. In this study, we compare these two techniques using a data set containing the macroinvertebrate multimetric index (MMI) at 1859 stream sites with over 200 landscape covariates. A primary application is mapping MMI predictions and prediction errors at 1.1 million perennial stream reaches across the conterminous United States. For the spatial regression model, we develop a novel transformation procedure that estimates Box-Cox transformations to linearize covariate relationships and handles possibly zero-inflated covariates. We find that the spatial regression model with transformations, and a subsequent selection of significant covariates, has cross-validation performance comparable to random forests. We also find that prediction interval coverage is close to nominal for each method, but that spatial regression prediction intervals tend to be narrower and have less variability than quantile regression forest prediction intervals. A simulation study is used to generalize results and clarify advantages of each modeling approach.", "venue": "PLoS ONE", "year": 2018, "fieldsOfStudy": ["Medicine", "Mathematics"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-12-26", "journal": {"name": "PLoS ONE", "volume": "15"}, "authors": [{"authorId": "37478591", "name": "E. Fox"}, {"authorId": "4442593", "name": "J. V. Ver Hoef"}, {"authorId": "1711878", "name": "A. Olsen"}], "citations": [{"paperId": "4f4a49ab938f418a6d14d583b324beef44cd66c1", "title": "Assessing the Efficiency of a Random Forest Regression Model for Estimating Water Quality Indicators"}, {"paperId": "63e430bfb1261917f8445d65536a741c921d7ea7", "title": "Spatiotemporal modelling of $$\\hbox {PM}_{2.5}$$ concentrations in Lombardy (Italy): a comparative study"}, {"paperId": "5416c412869fdb5d20a660e0ef5a3c9aeaf46493", "title": "Comparing machine learning algorithms for predicting and digitally mapping surface soil available phosphorous: a case study from southwestern Iran"}, {"paperId": "7aa00f4852b972857fcdfabb68ff969fe2cfe623", "title": "Association of social vulnerability and influenza vaccination rates for Annual Medicare Enrollees at the county-level in the United States."}, {"paperId": "a50779b87d077f0669c31babd48d2dfe55489730", "title": "Unbiased Estimation of Structured Prediction Error"}, {"paperId": "aa502eadee43516e5f1f39fa44354d36b4b80dd3", "title": "Using social media data and machine learning to map recreational ecosystem services"}, {"paperId": "de2f77d1e352b146eded5aca64aed7866601501b", "title": "The importance of C3 and C4 grasses and CAM shrubs in the Greater Cape Floristic Region under contemporary and Last Glacial Maximum climates"}, {"paperId": "a5a5443b90072e3f4379abf8641fe6bf06ebcd74", "title": "Spatiotemporal modelling of PM$_{2.5}$ concentrations in Lombardy (Italy) -- A comparative study"}, {"paperId": "ac231a6632d1dc4c8aa6a4ba6e57d3dc4b914bf1", "title": "Social vulnerability predictors of drug poisoning mortality: A machine learning analysis in the United States."}, {"paperId": "dd4877641fafc766be83508eac5d43ba947211d3", "title": "Digital soil mapping: a predictive performance assessment of spatial linear regression, Bayesian and ML-based models"}, {"paperId": "01d50737354bf96a911473cbc8bc8adea7173e7d", "title": "Pantropical distribution of short-rotation woody plantations: spatial probabilities under current and future climate"}, {"paperId": "349b5025be7d6dbbb37897ee9e24f3a6560c6263", "title": "Predicting Optical Water Quality Indicators from Remote Sensing Using Machine Learning Algorithms in Tropical Highlands of Ethiopia"}, {"paperId": "9111c66d15c6068b7afd58b2ea8244caec325bb0", "title": "TRANCO: Thermo radiometric normalization of crop observations"}, {"paperId": "07a1786abbe9a47ff946c7b49e8497023fcfaf17", "title": "A path in regression Random Forest looking for spatial dependence: a taxonomy and a systematic review"}, {"paperId": "99ac80c285a5cfa8d5b313f1952e5f38455f8af7", "title": "Random forests for binary geospatial data"}, {"paperId": "f08d5e65192f6b174e2a8f190e1b56f6a4799727", "title": "Global patterns and key drivers of stream nitrogen concentration: A machine learning approach"}, {"paperId": "57a253a7148e8c85b892a4b34268c41299940514", "title": "Soil quality estimation using environmental covariates and predictive models: an example from tropical soils of Nigeria"}, {"paperId": "40bb301bfce60c79502440d651ea40556f753247", "title": "Comparing the prediction performance, uncertainty quantification and extrapolation potential of regression kriging and random forest while accounting for soil measurement errors"}, {"paperId": "01c4102190e8b3b7cf31444dff89f02d71d37fbf", "title": "Predicting Heavy Metal Concentrations in Shallow Aquifer Systems Based on Low-Cost Physiochemical Parameters Using Machine Learning Techniques"}, {"paperId": "50407257cff5a40ab1049a8378ce0c4e3f7c700a", "title": "On exploring bivariate and trivariate maps as visualization tools for spatial associations in digital soil mapping: A focus on soil properties"}, {"paperId": "ab6e1abce0cd0c84815b9f13d9cb2ea301afe0e1", "title": "Mapping the groundwater memory across Ireland: a step towards a groundwater drought susceptibility assessment"}, {"paperId": "35120b78702c2f942c4555d6bbeb3cacbc5c9ff5", "title": "Global relationships in tree functional traits"}, {"paperId": "f3038781d5ad59f134ecc587a426d435561d470b", "title": "Mapping and modeling the impact of climate change on recreational ecosystem services using machine learning and big data"}, {"paperId": "b2f3dc0f0d2e2c31d87a7cf8dcee81e01700b8f4", "title": "Geostatistical, deterministic and interpolation with barriers methods—a comparative analysis for interpolating soil NPK"}, {"paperId": "c4b383960459f5c31003666ea290e9453d10da9d", "title": "A global assessment of nitrogen concentrations using spatiotemporal random forests"}, {"paperId": "a2d723cdd5f31cdfac32ee0c0a38d8232040efa2", "title": "A novel high-resolution gridded precipitation dataset for Peruvian and Ecuadorian watersheds – development and hydrological evaluation"}, {"paperId": "f53324d6a4ec584258b5123660edd013c6972ade", "title": "Spatial machine-learning model diagnostics: a model-agnostic distance-based approach"}, {"paperId": "23e0ac25a412dd46b7c2f522a98301fb3326c62c", "title": "Distance from Healthcare Facilities Is Associated with Increased Morbidity of Acute Infection in Pediatric Patients in Matiari, Pakistan"}, {"paperId": "6d55c783f63a4a7c04fde0dc50175afd0d782e58", "title": "Changes in Meadow Phenology in Response to Grazing Management at Multiple Scales of Measurement"}, {"paperId": "499409d7b122ff42ff13a30b08bdab47be49d8f6", "title": "Treeging"}, {"paperId": "0b2b0a857202f3748e1947a1f1a9c9fd5fee0877", "title": "Global trade-offs in tree functional traits"}, {"paperId": "e58a4a576f608dac28121ddafe41e87cccc6bb65", "title": "Random Forests for Spatially Dependent Data"}, {"paperId": "7825fcb49adf4058831b0df96ae0c0713a577e1e", "title": "Continuous‐surface geographic assignment of migratory animals using strontium isotopes: A case study with monarch butterflies"}, {"paperId": "01a07f80fdc5e3f42addd24b5979c44da6a0af7b", "title": "Autocart - spatially-aware regression trees for ecological and spatial modeling"}, {"paperId": "1a26a6c922489adbac448c79ea60895ddda1c931", "title": "Reducing the Uncertainty of Radiata Pine Site Index Maps Using an Spatial Ensemble of Machine Learning Models"}, {"paperId": "1a9d81183333c7834380e8b02e992e1a54e42028", "title": "Random Forests for dependent data"}, {"paperId": "9c328dbec578701e7fd4f2380b00ba24e84c204a", "title": "Random Spatial Forests"}, {"paperId": "db3e40325f36b828eed422cdc8694763b920990b", "title": "Machine learning and geostatistical approaches for estimating aboveground biomass in Chinese subtropical forests"}, {"paperId": "d9a9f4cdf4a926ae4a65f9e8d94bdbf6b6cfc0e1", "title": "Unveiling greenwashing in Colombian manufacturing: A machine learning approach"}, {"paperId": "6298bcae851e0e3ea5dbf0aae7ddbc62536a56d6", "title": "Groundwater isotopes across scales: continent-wide modeling and local field characterization"}, {"paperId": "55ff8863392c1e8c82fc159a692c09c18c57e913", "title": "Research on financial default risk prediction method based on big data model"}]}
