{"paperId": "84a390d63cc0dd840a599d77d34bc752084567ce", "publicationVenue": null, "title": "A collaborative GIS programming course using GitHub Classroom", "abstract": "Geospatial software developers often rely on Git to collaborate with each other and manage source code in an efficient way. Yet, most GIS programming courses do not prepare students for such a work environment. This article proposes a typology that a GIS programming course could follow consisting of three components: group organization, project and evaluation. Based on the typology, a GIS programming course was designed where randomly formed pairs develop a state‐of‐the‐art QGIS plugin. GitHub Classroom was used to facilitate collaboration among students, which also allowed the lecturer to monitor the progress of groups and provide timely feedback. Five out of the six groups were successful in completing the projects, and a substantial majority of the students were satisfied with the course. A strengths–weaknesses–opportunities–threats analysis reveals insights that other lecturers may find useful when designing their GIS programming courses.", "venue": "Trans. GIS", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-07-21", "journal": {"name": "Transactions in GIS", "pages": "3132 - 3158", "volume": "25"}, "authors": [{"authorId": "3056896", "name": "B. Anbaroğlu"}], "citations": [{"paperId": "7cdcffc7c462ef6b581627cff4dd8f4c23bc0bb3", "title": "Attribution of Work in Programming Teams with Git Reporter"}, {"paperId": "b7621173f0b9cdf09c6cc95c47f4eb9b5e7c1a6b", "title": "Space Time Cube analytics in QGIS and Python for hot spot detection"}, {"paperId": "8b410b150071ebf8ce20773cc94489f858b12578", "title": "Not just for programmers: How GitHub can accelerate collaborative and reproducible research in ecology and evolution"}, {"paperId": "e637e53bf24c2454905dbf36936f4abfd84acd4f", "title": "Integrating GRASS GIS and Jupyter Notebooks to facilitate advanced geospatial modeling education"}, {"paperId": "eba225010fba27e5a4f7b6000f6dfca1fa8cb683", "title": "A process‐driven geo‐analysis engine to support online collaborative geographic experiments"}, {"paperId": "edb3522ba3d1905a70547c1349d23241d25d311e", "title": "GitHub in the Classroom: Lessons Learnt"}]}
