{"paperId": "84ad920e7232c0b16246a24160c5342f049dd9e9", "publicationVenue": {"id": "a0edb93b-1e95-4128-a295-6b1659149cef", "name": "Knowledge Discovery and Data Mining", "type": "conference", "alternate_names": ["KDD", "Knowl Discov Data Min"], "url": "http://www.acm.org/sigkdd/"}, "title": "Generative Causal Interpretation Model for Spatio-Temporal Representation Learning", "abstract": "Learning, interpreting, and predicting from complex and high-dimensional spatio-temporal data is a natural ability of humans and other intelligent agents, and one of the most important and difficult challenges of AI. Although objects may present different observed phenomena under different situations, their causal mechanism and generation rules are stable and invariant. Different from most existing studies that focus on dynamic correlation, we explore the latent causal structure and mechanism of causal descriptors in the spatio-temporal dimension at the microscopic level, thus revealing the generation principle of observation. In this paper, we regard the causal mechanism as a spatio-temporal causal process modulated by non-stationary exogenous variables. To this end, we propose a theoretically-grounded Generative Causal Interpretation Model (GCIM), which infers explanatory-capable microscopic causal descriptors from observational data via spatio-temporal causal representations. The core of GCIM is to estimate the prior distribution of causal descriptors by using the spatio-temporal causal structure and transition process under the constraints of identifiable conditions, thus extending the Variational Auto Encoder (VAE). Furthermore, our method is able to automatically capture domain information from observations to model non-stationarity. We further analyze the model identifiability, showing that the proposed model learned from observations recovers the true one up to a certain degree. Experiments on synthetic and real-world datasets show that GCIM can successfully identify latent causal descriptors and structures, and accurately predict future data.", "venue": "Knowledge Discovery and Data Mining", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2023-08-04", "journal": {"name": "Proceedings of the 29th ACM SIGKDD Conference on Knowledge Discovery and Data Mining"}, "authors": [{"authorId": "2182926233", "name": "Yu Zhao"}, {"authorId": "2201888783", "name": "Pan Deng"}, {"authorId": "2182922976", "name": "Junting Liu"}, {"authorId": "2112827524", "name": "Xiaofeng Jia"}, {"authorId": "2108091915", "name": "Jianwei Zhang"}], "citations": [{"paperId": "f3adeb6c40a0962245ceeab2dfea73f49ac2a6eb", "title": "Towards Causal Relationship in Indefinite Data: Baseline Model and New Datasets"}]}
