{"paperId": "84b4c855318276c63c2a5a4e82164a7289dc04c8", "publicationVenue": {"id": "c5ccb785-bfaa-4628-b7e1-f3c6e2fc6873", "name": "IEEE International Reliability Physics Symposium", "type": "conference", "alternate_names": ["IEEE Int Reliab Phys Symp", "Int Reliab Phys Symp", "International Reliability Physics Symposium", "IRPS"], "issn": "1541-7026", "alternate_issns": ["1938-1891"], "url": "http://ieeexplore.ieee.org/xpl/conhome.jsp?punumber=1000627"}, "title": "Reliability, Availability, and Serviceability Challenges for Heterogeneous System Design", "abstract": "The demand for high-performance computation continues to accelerate. To satisfy this increasing demand, modern server and high-performance computing systems are increasingly deploying nodes with greater heterogeneity and integration. Both trends reduce the cost of computation: heterogeneity by increasing absolute performance, and integration by reducing cost per computation. What has not changed, however, are the stringent reliability, availability, and serviceability (RAS) requirements for nodes used in server and high-performance computing systems. A high level of RAS is required to ensure that data centers deploying nodes can correctly perform computations over their expected lifetime.This paper describes the increased RAS challenges posed by increased heterogeneity and integration. The paper motivates these challenges using data gathered from production systems and presents a case study of the RAS implementation on a highly integrated, heterogeneous node: the AMD EPYC™ and AMD Instinct™ MI250X heterogeneous compute node. Finally, the paper provides a call for standardization to aid in meeting these goals for future data centers.", "venue": "IEEE International Reliability Physics Symposium", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-03-01", "journal": {"name": "2022 IEEE International Reliability Physics Symposium (IRPS)", "pages": "2C.4-1-2C.4-8"}, "authors": [{"authorId": "2990049", "name": "Majed Valad Beigi"}, {"authorId": "1729676", "name": "S. Gurumurthi"}, {"authorId": "145448804", "name": "Vilas Sridharan"}], "citations": [{"paperId": "1b94dc8237778169942b8d50ef24a745406ebe6d", "title": "Enhancing multi-cloud service deployment with SkyCap: A loss-aware coordinator in sky computing"}, {"paperId": "e87a1308355358d8fbba94bf7ed69650f3df64d5", "title": "Impact of Voltage Scaling on Soft Errors Susceptibility of Multicore Server CPUs"}, {"paperId": "08d61417c88d912caf1c40b65ffe3ba1b763b5a5", "title": "Fault Management Impacts on the Networking Systems Hardware Design"}, {"paperId": "adb9ba3fac2ac94bee3247633bf29d359fda7e33", "title": "A Research Retrospective on AMD's Exascale Computing Journey"}, {"paperId": "66635a486eaeb1b6a88387794b8c91c9cf80e65f", "title": "A Systematic Study of DDR4 DRAM Faults in the Field"}]}
