{"paperId": "84b80e87b7ec94e696dc546d9ef8b3756b6384f9", "publicationVenue": {"id": "a5003fc4-eef0-4a12-be46-7516f12c4554", "name": "IEEE International Symposium on Reliable Distributed Systems", "type": "conference", "alternate_names": ["Symposium on Reliable Distributed Systems", "IEEE Int Symp Reliab Distrib Syst", "SRDS", "Symp Reliab Distrib Syst"], "url": "https://en.wikipedia.org/wiki/International_Symposium_on_Reliable_Distributed_Systems"}, "title": "Enabling Low-Redundancy Proactive Fault Tolerance for Stream Machine Learning via Erasure Coding", "abstract": "Machine learning for continuous data streams, or stream machine learning in short, is increasingly adopted in real-time big data applications. Fault tolerance is a critical requirement for stream machine learning applications in large-scale distributed deployment. However, existing reactive fault tolerance mechanisms, which trigger failure recovery upon the detection of failures, inevitably incur high recovery overhead and compromise the low-latency requirement of stream machine learning. We design StreamLEC, a stream machine learning system that leverages erasure coding to provide low-redundancy proactive fault tolerance for immediate failure recovery. StreamLEC supports general stream machine learning applications, and incorporates different techniques to mitigate erasure coding overhead. Evaluation on a local cluster and Amazon EC2 shows that StreamLEC achieves much higher throughput than both reactive fault tolerance and replication-based proactive fault tolerance, with negligible failure recovery overhead.", "venue": "IEEE International Symposium on Reliable Distributed Systems", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-09-01", "journal": {"name": "2021 40th International Symposium on Reliable Distributed Systems (SRDS)", "pages": "99-108"}, "authors": [{"authorId": "2354851", "name": "Zhinan Cheng"}, {"authorId": "2110211545", "name": "Lu Tang"}, {"authorId": "1391129727", "name": "Qun Huang"}, {"authorId": "33431705", "name": "P. Lee"}], "citations": []}
