{"paperId": "84b84a48e34f6bb9529578b49fa5ecb6622f2fd8", "publicationVenue": {"id": "50fcded1-c68a-4683-b5dc-ed5a03d02719", "name": "Computer communication review", "type": "journal", "alternate_names": ["Computer Communication Review", "Comput commun rev", "Comput Commun Rev"], "issn": "0146-4833", "url": "http://portal.acm.org/browse_dl.cfm?idx=j101", "alternate_urls": ["http://portal.acm.org/sigcomm/newsletter"]}, "title": "C-share", "abstract": "Integrating optical circuit switches in data-centers is an on-going research challenge. In recent years, state-of-the-art solutions introduce hybrid packet/circuit architectures for different optical circuit switch technologies, control techniques, and traffic re-routing methods. These solutions are based on separated packet and circuit planes that cannot utilize an optical circuit with flows that do not arrive from or delivered to switches directly connected to the circuit's end-points. Moreover, current SDN-based elephant flow re-routing methods require a forwarding rule for each flow, which raises scalability issues. In this paper, we present C-Share - a scalable SDN-based circuit sharing solution for data center networks. C-Share inherently enables elephant flows to share optical circuits by exploiting a flat top-of-rack tier network topology. C-Share is based on a scalable and decoupled SDN-based elephant flow re-routing method comprised of elephant flow detection, tagging and identification, which is utilized by using a prevalent network sampling method (e.g., sFlow). C-Share requires only a single OpenFlow rule for each optical circuit, and therefore significantly reduces the required OpenFlow rule entry footprint and setup rule rate. It also mitigates the OpenFlow outbound latency for subsequent elephant flows. We implement a proof-of-concept system for C-Share based on Mininet, and test the scalability of C-Share by using an event-driven simulation. Our results show a consistent increase in the mice/elephant flow separation in the network, which, in turn, improves both network throughput and flow completion time.", "venue": "Computer communication review", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2016-09-15", "journal": {"name": "ACM SIGCOMM Computer Communication Review", "pages": "2 - 9", "volume": "50"}, "authors": [{"authorId": "1402228862", "name": "Y. Ben-Itzhak"}, {"authorId": "2465897", "name": "C. Caba"}, {"authorId": "46647687", "name": "L. Schour"}, {"authorId": "3431317", "name": "S. Vargaftik"}], "citations": [{"paperId": "2339e49c04aa2b5d2651439542687ebcc4549b80", "title": "ExRec: Experimental Framework for Reconfigurable Networks Based on Off-the-Shelf Hardware"}, {"paperId": "3ab757d78823f816e60f3d24c7332ce123cf0536", "title": "Fully SDN-enabled all-optical architecture for data center virtualization with time and space multiplexing"}, {"paperId": "a28be5203b26935c29d370753b5b9f5ac676184a", "title": "Resource allocation in slotted optical data center networks"}, {"paperId": "6d4ed02e3d96704bc176503648a5c2d9ae28bcd7", "title": "Efficient Routing by Detecting Elephant Flows with Deep Learning Method in SDN"}, {"paperId": "2aa9f100bc924485d5d74c420ea720c05f2ede49", "title": "Traffic footprint characterization of workloads using BPF"}, {"paperId": "afd3a18eb25dcd744955d59382e5f1604e500c44", "title": "Optical Switching in Datacenters: Architectures Based on Optical Circuit Switching"}]}
