{"paperId": "84d411eb8cb116bcf686c3e762303fe2981360cd", "publicationVenue": null, "title": "A Survey on Intrusion Detection System in Smart City: Security Concerns", "abstract": "Emergence of Internet of Things (IoT) -driven smart cities has brought both security and privacy challenges that demand effective countermeasures. Traditional cyber-security strategies are insufficient for the heterogeneity and dynamic nature of smart cities, necessitating a proactive approach to address security and privacy threats during system design and implementation. This article provides an analysis of the security threats and vulnerabilities, a complete review of security challenges, available Intrusion Detection Systems (IDS), and exemplary approaches for smart cities, categorized based on governance, socioeconomic factors, and technology. The survey examines the use of deep learning techniques for anomaly detection and intrusion detection in IoT networks. Furthermore, the integration of blockchain technology with IoT, and deep learning models towards the development of robust security measures are discussed. Developers working on creating and safeguarding smart cities can benefit significantly from the conclusions and suggestions for future studies offered in this paper.", "venue": "2023 7th International Conference on Computer Applications in Electrical Engineering-Recent Advances (CERA)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference", "Review"], "publicationDate": "2023-10-27", "journal": {"name": "2023 7th International Conference on Computer Applications in Electrical Engineering-Recent Advances (CERA)", "pages": "1-6"}, "authors": [{"authorId": "2290088181", "name": "N. Nandhini"}, {"authorId": "2290097246", "name": "V. Manikandan"}, {"authorId": "2290088183", "name": "G. Manavaalan"}, {"authorId": "2290087328", "name": "S. Elango"}, {"authorId": "2290093673", "name": "C. Jeevakarunya"}, {"authorId": "2290309995", "name": "P. V. Kumar"}], "citations": []}
