{"paperId": "84d9b01fa0f00c304760c2d26a8ab73e8584e061", "publicationVenue": null, "title": "Platform-agnostic Model to Detect Sinophobia on Social Media", "abstract": "Although the boom of social media in the past decade has enabled the creation, distribution, and consumption of information at a remarkable rate, it has also led to the growth of different forms of online abuse. Since the outbreak of COVID-19, hate against Chinese or Sinophobia has increased significantly in real world as well as on online platforms making it necessary to design ways to combat it. In this paper, we design a platform-agnostic model to detect Sinophobic content on social media websites automatically. We use pre-trained word embeddings with several machine learning classifiers to detect Sinophobia on three platforms---Parler, Reddit, and Twitter. Our results demonstrate that the BERT model shows the best performance among all the models by achieving an accuracy of 98.51% on Parler, 95.36% on Reddit, and 88.12% on Twitter datasets.", "venue": "Proceedings of the 2023 ACM Southeast Conference", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Book", "Conference"], "publicationDate": "2023-04-12", "journal": {"name": "Proceedings of the 2023 ACM Southeast Conference"}, "authors": [{"authorId": "50665098", "name": "Matthew Morgan"}, {"authorId": "46964024", "name": "Adita Kulkarni"}], "citations": [{"paperId": "7fda6bccd114744be5fcc3514fd991a6113ece40", "title": "Controlling bad-actor-artificial intelligence activity at scale across online battlefields"}, {"paperId": "4507fc0c6f78fcfcbb39351fadf4de6612689213", "title": "Unprecedented reach and rich online journeys drive hate and extremism globally"}, {"paperId": "4b805583a9af5120bdd4cc77a91d33eeb2700c0a", "title": "Controlling bad-actor-AI activity at scale across online battlefields"}, {"paperId": "ee3f8e44bb28990b58f8b6699e9c0a0ca0e0719c", "title": "Adaptive link dynamics drive online hate networks and their mainstream influence"}]}
