{"paperId": "84daf32afccb046695958d6dd0ef6c18a10b0018", "publicationVenue": null, "title": "Towards a GPU accelerated spatial computing framework", "abstract": "Ease of availability of spatial data has increased the interest in the domain of spatial computing. Various services such as Uber, Google maps, and Blue Brain Project have been developed that consume and process such spatial data. Spatial data processing is not only data intensive but also compute intensive. A lot of efforts have been made by the spatial computing community to tackle the problems due to huge volumes of data. However, unfortunately, not enough attention has been given to address the compute intensive nature of the problem. In parallel to the advancements in spatial domain, Graphics Processing Units (GPUs) have emerged as compelling computing units. A lot of work has been done in spatial domain to leverage the computing power of GPUs. However, to the best of our knowledge, none of the work present a holistic system. In this paper, we propose a vision for a GPU accelerated end-to-end system for performing spatial computations. Our envisioned system supports a plethora of spatial operations ranging from basic operations, computational geometry operations to Open Geospatial Consortium (OGC) compliant operations. Our system exploits the power of CPU-GPU co-processing by scheduling the execution of spatial operators either on CPU or GPU based on a cost model. Within the framework of our system we discuss the challenges and open research problems in building such a system. We also provide some preliminary results to show the computational gain achieved by performing spatial operations on GPUs.", "venue": "ICDE Workshops", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2016-05-16", "journal": {"pages": "135-142"}, "authors": [{"authorId": "35225448", "name": "Harshad Chavan"}, {"authorId": "2527313", "name": "Rami Alghamdi"}, {"authorId": "1756679", "name": "M. Mokbel"}], "citations": [{"paperId": "f26e551c0172bcc40fe7f2fa36c852ace4467639", "title": "Cloud Computing in natural hazard modeling systems: Current research trends and future directions"}, {"paperId": "de389fbe3f2787e782e6b2d6f78607dc8b6dc55d", "title": "Near by Services using Spatial Computing"}, {"paperId": "e5495de934a703f47b4304b19b914e486c22d992", "title": "Adaptive Geospatial Joins for Modern Hardware"}, {"paperId": "c86ab97241c3aa175eea20862e2884f46d9e676b", "title": "GPU-GIST – a case of generalized database indexing on modern hardware"}, {"paperId": "0e8058eaf29bf8092bb5da1d5493fd375c74e42b", "title": "Towards GPU-Accelerated Web-GIS for Query-Driven Visual Exploration"}, {"paperId": "c89e4b7b7cd538922247449a73dd6e6b354ae2ce", "title": "High-performance polyline intersection based spatial join on GPU-accelerated clusters"}, {"paperId": "48ee0ff5de5832fd604edcec7426797eb90d3e1f", "title": "Adaptive Main-Memory Indexing for High-Performance Point-Polygon Joins"}, {"paperId": "5718f301636879f7b622bee0ce1e75824c750871", "title": "Advancing Analytical Database Systems"}]}
