{"paperId": "84f60428f78964c0cb663ee36caf222e9f182b32", "publicationVenue": {"id": "a0edb93b-1e95-4128-a295-6b1659149cef", "name": "Knowledge Discovery and Data Mining", "type": "conference", "alternate_names": ["KDD", "Knowl Discov Data Min"], "url": "http://www.acm.org/sigkdd/"}, "title": "Rover: An Online Spark SQL Tuning Service via Generalized Transfer Learning", "abstract": "Distributed data analytic engines like Spark are common choices to process massive data in industry. However, the performance of Spark SQL highly depends on the choice of configurations, where the optimal ones vary with the executed workloads. Among various alternatives for Spark SQL tuning, Bayesian optimization (BO) is a popular framework that finds near-optimal configurations given sufficient budget, but it suffers from the re-optimization issue and is not practical in real production. When applying transfer learning to accelerate the tuning process, we notice two domain-specific challenges: 1) most previous work focus on transferring tuning history, while expert knowledge from Spark engineers is of great potential to improve the tuning performance but is not well studied so far; 2) history tasks should be carefully utilized, where using dissimilar ones lead to a deteriorated performance in production. In this paper, we present Rover, a deployed online Spark SQL tuning service for efficient and safe search on industrial workloads. To address the challenges, we propose generalized transfer learning to boost the tuning performance based on external knowledge, including expert-assisted Bayesian optimization and controlled history transfer. Experiments on public benchmarks and real-world tasks show the superiority of Rover over competitive baselines. Notably, Rover saves an average of 50.1% of the memory cost on 12k real-world Spark SQL tasks in 20 iterations, among which 76.2% of the tasks achieve a significant memory reduction of over 60%.", "venue": "Knowledge Discovery and Data Mining", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2023-02-08", "journal": {"name": "Proceedings of the 29th ACM SIGKDD Conference on Knowledge Discovery and Data Mining"}, "authors": [{"authorId": "2117688209", "name": "Yu Shen"}, {"authorId": "100602630", "name": "Xinyuyang Ren"}, {"authorId": "2140024987", "name": "Yupeng Lu"}, {"authorId": "2156396421", "name": "Huaijun Jiang"}, {"authorId": "2204987158", "name": "Huanyong Xu"}, {"authorId": "2204764872", "name": "Di Peng"}, {"authorId": "2154902040", "name": "Yang Li"}, {"authorId": "2136776579", "name": "Wentao Zhang"}, {"authorId": "2143385807", "name": "Bin Cui"}], "citations": [{"paperId": "bfb2b0b0d0621ea4de93fb960d45a4c5bbabcc38", "title": "ByteCard: Enhancing ByteDance's Data Warehouse with Learned Cardinality Estimation"}, {"paperId": "0f119b265c39f70db0b6965ed9a68a85959e1e3f", "title": "Towards General and Efficient Online Tuning for Spark"}, {"paperId": "2bce7a26af564fc3c95a1dfe48fd796848f93035", "title": "OpenBox: A Python Toolkit for Generalized Black-box Optimization"}]}
