{"paperId": "8502125a7e2d5d43197194f376171725a34f8f2c", "publicationVenue": {"id": "9ee7345a-5e9f-4002-9880-d6b27d275524", "name": "Transactions on Emerging Telecommunications Technologies", "type": "journal", "alternate_names": ["European Transactions on Telecommunications", "Eur Trans Telecommun", "TETT", "Trans Emerg Telecommun Technol"], "issn": "1120-3862", "alternate_issns": ["2161-3915", "1124-318X"], "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/104087069", "alternate_urls": ["http://eu.wiley.com/WileyCDA/WileyTitle/productCd-ETT.html", "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1541-8251", "https://onlinelibrary.wiley.com/journal/21613915", "https://onlinelibrary.wiley.com/journal/15418251"]}, "title": "Efficient data transfer in edge envisioned environment using artificial intelligence based edge node algorithm", "abstract": "Edge computing technology has drawn the keystone of future intelligent transportation systems, especially in smart cities, because of processing data that are near to the user location present at the edge of the cloud server. Generally, in smart cities where distributed things have access to computational resources, data transfer becomes inevitable because of high latency, thereby resulting in crucial situations. Even though numerous technologies have emerged for improving the data communication among geo‐distributed devices received from the cloud server but still, it lags in low learning performance. To address these challenges, an innovative artificial intelligence (AI) based edge node (E‐Node) algorithm is implemented to optimize the edge to edge learning for well‐organized data migration. To attain high reliability, AI‐K‐means neural network (KNN) and convolution neural network (CNN) is used initially for pre‐processing and filtering the edge node. Further, the proposed E‐Node algorithm outperforms the optimization technique effectively through the edge to edge computing The reliability performance is increased by reducing the node optimization time from 132 to 98 ms for 25 kb data and data transmission time is reduced from 93 to 45 ms for 80 kb data, thus reducing the latency in an edge envisioned environment.", "venue": "Transactions on Emerging Telecommunications Technologies", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-09-16", "journal": {"name": "Transactions on Emerging Telecommunications Technologies", "volume": "32"}, "authors": [{"authorId": "2112128693", "name": "Visvam Devadoss Ambeth Kumar"}, {"authorId": "2136071300", "name": "Abhishek Kumar"}, {"authorId": "41131001", "name": "R. Batth"}, {"authorId": "151422498", "name": "M. Rashid"}, {"authorId": "2118972690", "name": "S. Gupta"}, {"authorId": "2003479705", "name": "Manish Raghuraman"}], "citations": [{"paperId": "18e3c1e40b04e6feeed2241a7021dfd2354d62b3", "title": "Autonomous proactive data management in support of pervasive edge applications"}, {"paperId": "52a596ebba597fc212b7b1f1947581fc2f3c33b8", "title": "Deep Q-learning Network Solution for Subjective Computational Task Scheduling in Edge Platforms"}, {"paperId": "f8a710bebe755653be521b511e529dc71d70fda8", "title": "Intelligent Sensing and Monitoring System for High-Voltage Transmission Line Status of Smart Grid Based on IoT Technology"}, {"paperId": "ee2900b3e538b65af6773b6fc49b8b87664e1948", "title": "UAV‐IoT collaboration: Energy and time‐saving task scheduling scheme"}, {"paperId": "236b5d9bc6140ab0d790b43d573d429b70cdc771", "title": "Prospect-theoretic DRL Approach for Container Provisioning in Energy-constrained Edge Platforms"}, {"paperId": "66ebf105e98a31b3b0ec8d9379bd68e3d2ae7111", "title": "Revolutionizing Healthcare through IoT and Edge Computing: A Evaluation of Optimization Techniques"}, {"paperId": "88a758d5b1eeae47d8f13f2a2b02f986a386c826", "title": "Gamified Learning and Assessment Using ARCS with Next-Generation AIoMT Integrated 3D Animation and Virtual Reality Simulation"}, {"paperId": "985590b5ac490f795bc730316963425815d409a9", "title": "Next-Gen Mulsemedia: Virtual Reality Haptic Simulator’s Impact on Medical Practitioner for Higher Education Institutions"}, {"paperId": "a9a2d8a6ffa05fc9574f68f36978e831b134d3ce", "title": "Green-Tech CAV: Next Generation Computing for Traffic Sign and Obstacle Detection in Connected and Autonomous Vehicles"}, {"paperId": "85cc2347b419f1e824f9cc45eb0da30201dde296", "title": "Motivation, Definition, Application and the Future of Edge Artificial Intelligence"}, {"paperId": "43afdedc4803557d18e695701c0930800c0180d0", "title": "Cognitive decision-making in smart police industry"}, {"paperId": "732813e2a214ca33b3f1ae73ca7e4b3c77cf1e84", "title": "Intelligent transmission control layer for efficient node management in SDN"}, {"paperId": "2568b00836d38503c820bb8691234acdecf42c74", "title": "Research on Data Retrieval Algorithm of English Microlearning Teaching Based on Wireless Network Information Classification"}, {"paperId": "f7a07a6d74c92300fbe093bc1ac9bcb4d4e69589", "title": "Performance Analysis of K-Nearest Neighbor Classification Algorithms for Bank Loan Sectors"}, {"paperId": "396bebcb7c67b60c10a72ad568ebdb500bcd0a87", "title": "Green Communication in Wireless Power Consumption and Energy Efficient Trade-offs"}, {"paperId": "2e479cfb8e7059ed1aea141bddb3072aaa0c038d", "title": "Edge Computing: Classification, Applications, and Challenges"}, {"paperId": "4c5a1573641cc554a72f9542bfeee4f51956a90f", "title": "Development of Top K-Association Rule Mining for Discovering pattern in Medical Dataset"}, {"paperId": "6facdf05f43417940e526704f4ba374af535d953", "title": "Development of Fuzzy based intelligent System for Assessment of Risk Estimation in Software project for Hospitals Network"}, {"paperId": "ad569927117fe67b6eda87e3c098d19556e1370a", "title": "Diabetes Data Prediction in healthcare Using Hadoop over Big Data"}, {"paperId": "743965a87382e1571195dd48e7ba3b3410cf558c", "title": "Deep Analysis of ITIL Framework for Improvement of Indian IT Services in Industries"}, {"paperId": "cea50369cd0e285ee4b8b646b5c09f7ad542344c", "title": "Environment parameters extraction using intelligent image processing system for efficient autonomous driving of a vehicle"}, {"paperId": "b9b56b9e22b65b8c1e535e5d702978fe46183450", "title": "Home area network – Smart grid"}, {"paperId": "299431ed589a7ddcb6aee815b804f1f2e07fad01", "title": "Modelling information flow in social networks: Metrics and evaluation"}, {"paperId": "8823c78ddb2e383046d8bea634535d8d1785deba", "title": "Designing efficient streaming-data processing for intrusion avoidance and detection engines using entity selection and entity attribute approach"}, {"paperId": "ee686edb013c29171a996293344706abacb3e6ca", "title": "SEQUENTIAL LOGIC GATES USING QUANTUM DOT CELLULAR AUTOMATA FOR HIGH SPEED APPLICATIONS"}, {"paperId": "1bca88df63c07979036072ffd33be40f8ecdf11b", "title": "IMPLEMENT THE ORGANIC TRANSISTORS LOGIC INTO THE MEM SENSOR"}, {"paperId": "c7f2740fb36a6f437cb8bcdfbae4293f531e97ec", "title": "An Analysis of Different Watermarking Schemes for Medical Image Authentication"}, {"paperId": "6b6501b8ecf5571a5720f310646fd8a9f9a4a2a2", "title": "MION-A Deep Analysis of New Fault Tolerant MIN in Faulty and Non-Faulty Network Conditions for Medical Domain"}]}
