{"paperId": "850fda6a8aabcd0de84c2b0ae90439f3516ff475", "publicationVenue": {"id": "2e7913cf-49f3-4c19-9a51-68860c6d73f9", "name": "IEEE International Conference on e-Business Engineering", "type": "conference", "alternate_names": ["IEEE Int Conf bus Eng", "Int Conf bus Eng", "International Conference on e-Business Engineering", "ICEBE"], "url": "http://www.wikicfp.com/cfp/program?id=1344"}, "title": "Towards Fractional NFTs for Joint Ownership and Provenance in Real Estate", "abstract": "Owning a house or investing in real estate can present challenges for many individuals. While fractional ownership offers potential solutions, establishing joint ownership among multiple participants poses obstacles that hinder its widespread adoption and limit accessibility. In response to these challenges, we propose JOINFT, a blockchain-based solution that utilizes fractional non-fungible tokens (F- NFTs) for facilitating joint ownership in real estate. JOINFT aims to enhance accessibility, empower individuals to participate in property ownership, and promote affordability while ensuring secure and transparent transactions. This paper provides an overview of the JOINFT system, including key participants, platform structure, functionality, and the utilization of the group level agreement. Additionally, our proposed method incorporates provenance information to capture user participation history within groups which contributes to the calculation of their trust score. To evaluate the effectiveness of JOINFT in enabling joint ownership through F-NFTs, we developed a prototype and conducted test transactions within an integrated development environment that supports decentralized applications and smart contracts. The evaluation demonstrates the effectiveness of utilizing F- NFTs for joint ownership in the real estate industry. It validates JOINFT’s ability to enhance accessibility, affordability, and transparency and trust in real estate transactions. Nevertheless, as JOINFT is an ongoing project, further research is required on regulatory frameworks, wider acceptance, and the potential of F-NFTs, trust scores, and provenance information in joint ownership in the real estate industry.", "venue": "IEEE International Conference on e-Business Engineering", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference", "Review"], "publicationDate": "2023-11-04", "journal": {"name": "2023 IEEE International Conference on e-Business Engineering (ICEBE)", "pages": "143-148"}, "authors": [{"authorId": "2275305357", "name": "Abdullah J. Abualhamayl"}, {"authorId": "2147254599", "name": "M. A. Almalki"}, {"authorId": "1410094857", "name": "Firas Al-Doghman"}, {"authorId": "2275305367", "name": "Abdulmajeed A. Alyoubi"}, {"authorId": "2275113772", "name": "F. Hussain"}], "citations": []}
