{"paperId": "85106fc0a68a575166f0f18456fa755b7a2660a3", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Deep Learning-Driven Edge Video Analytics: A Survey", "abstract": "—Video, as a key driver in the global explosion of digital information, can create tremendous beneﬁts for human society. Governments and enterprises are deploying innumerable cameras for a variety of applications, e.g., law enforcement, emergency management, trafﬁc control, and security surveillance, all facilitated by video analytics (VA). This trend is spurred by the rapid advancement of deep learning (DL), which enables more precise models for object classiﬁcation, detection, and tracking. Meanwhile, with the proliferation of Internet-connected devices, massive amounts of data are generated daily, overwhelming the cloud. Edge computing, an emerging paradigm that moves workloads and services from the network core to the network edge, has been widely recognized as a promising solution. The resulting new intersection, edge video analytics (EVA), begins to attract widespread attention. Nevertheless, only a few loosely-related surveys exist on this topic. A dedicated venue for collecting and summarizing the latest advances of EVA is highly desired by the community. Besides, the basic concepts of EVA (e.g., deﬁnition, architectures, etc.) are ambiguous and neglected by these surveys due to the rapid development of this domain. A thorough clariﬁcation is needed to facilitate a consensus on these concepts. To ﬁll in these gaps, we conduct a comprehensive survey of the recent efforts on EVA. In this paper, we ﬁrst review the fundamentals of edge computing, followed by an overview of VA. The EVA system and its enabling techniques are discussed next. In addition, we introduce prevalent frameworks and datasets to aid future researchers in the development of EVA systems. Finally, we discuss existing challenges and foresee future research directions. We believe this survey will help readers comprehend the relationship between VA and edge computing, and spark new ideas on EVA.", "venue": "arXiv.org", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "ArXiv", "volume": "abs/2211.15751"}, "authors": [{"authorId": "2257479773", "name": "Renjie Xu"}, {"authorId": "2059060573", "name": "S. Razavi"}, {"authorId": "2257295173", "name": "Rong Zheng"}], "citations": [{"paperId": "3d8090add11821d51c124e35cd907ac76307b79d", "title": "Opportunities, Applications, and Challenges of Edge-AI Enabled Video Analytics in Smart Cities: A Systematic Review"}]}
