{"paperId": "8520ef086d6cb337fc775becb1c71c71e46fc3b9", "publicationVenue": {"id": "4bb92bad-912d-41ad-8249-a81483c297c6", "name": "Conference on Research, Innovation and Vision for the Future in Computing & Communication Technologies", "type": "conference", "alternate_names": ["Rencontres en Informatique Vietnam-France", "RIVF", "Conf Res Innov Vis Future Comput  Commun Technol", "Rencontres Inform Vietnam"]}, "title": "Advanced Feature Processing for IoT-Based Intrusion Detection System", "abstract": "Nowadays, Internet of Things (IoT) has been globally adopted and faced a growing threat of cyberattacks. To protect IoT networks effectively, powerful machine learning models have been widely utilized to realize IoT intrusion detection systems. Selecting suitable features plays a key role in the successful training of machine learning models, as it enhances detection accuracy and computational efficiency. In this paper, we study an IoT intrusion detection system that employs machine learning. We propose an effective feature processing procedure which includes feature engineering based on meanings, feature selection using Random Forest feature importance, and forward selection procedure in order to figure out two optimal feature sets for optimizing the binary and multiclass classification performances of the system. We also apply Borderline-SMOTE and One-Sided Selection techniques to resolve the data imbalance problem for multiclass classification. Numerical simulation results are conducted on the BoT-IoT dataset to verify the efficiency of our developed method. It is demonstrated that our proposed method outperforms the notable conventional works and attains the accuracy of two optimal feature sets 99.9998% and 99.9905% respectively for the binary and multiclass classifications.", "venue": "Conference on Research, Innovation and Vision for the Future in Computing & Communication Technologies", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-12-23", "journal": {"name": "2023 RIVF International Conference on Computing and Communication Technologies (RIVF)", "pages": "37-42"}, "authors": [{"authorId": "2236467760", "name": "Van Thinh Pham"}, {"authorId": "9426755", "name": "T. Huu"}, {"authorId": "2161237003", "name": "M. Nguyen"}, {"authorId": "2270221069", "name": "Hai-Chau Le"}], "citations": []}
