{"paperId": "85331dc894818f26e416688ff3f0535335f8768c", "publicationVenue": {"id": "0942fb86-c16f-4084-9902-10ddcfe18180", "name": "Micro", "type": "conference", "alternate_names": ["Int Symp Microarchitecture", "MICRO", "International Symposium on Microarchitecture", "Annual IEEE/ACM International Symposium on Microarchitecture", "Annu IEEE/ACM Int Symp Microarchitecture"], "issn": "0271-9002", "alternate_issns": ["2151-4143", "2673-8023"], "url": "http://www.microarch.org/"}, "title": "HiRA: Hidden Row Activation for Reducing Refresh Latency of Off-the-Shelf DRAM Chips", "abstract": "DRAM is the building block of modern main memory systems. DRAM cells must be periodically refreshed to prevent data loss. Refresh operations degrade system performance by interfering with memory accesses. As DRAM chip density increases with technology node scaling, refresh operations also increase be-cause: 1) the number of DRAM rows in a chip increases; and 2) DRAM cells need additional refresh operations to mitigate bit failures caused by RowHammer, a failure mechanism that becomes worse with technology node scaling. Thus, it is critical to enable refresh operations at low performance overhead. To this end, we propose a new operation, Hidden Row Activation (HiRA), and the HiRA Memory Controller (HiRA-MC) to perform HiRA operations. HiRA hides a refresh operation’s latency by refreshing a row concurrently with accessing or refreshing another row within the same bank. Unlike prior works, HiRA achieves this parallelism without any modifications to off-the-shelf DRAM chips. To do so, it leverages the new observation that two rows in the same bank can be activated without data loss if the rows are connected to different charge restoration circuitry. We experimentally demonstrate on 56 real off-the-shelf DRAM chips that HiRA can reliably parallelize a DRAM row’s refresh operation with refresh or activation of any of the 32% of the rows within the same bank. By doing so, HiRA reduces the overall latency of two refresh operations by 51.4%. HiRA-MC modifies the memory request scheduler to perform HiRA when a refresh operation can be performed concurrently with a memory access or another refresh. Our system-level evaluations show that HiRA-MC increases system performance by 12.6% and $3.73\\times$ as it reduces the performance degradation due to periodic refreshes and refreshes for RowHammer protection (preventive refreshes), respectively, for future DRAM chips with increased density and RowHammer vulnerability.", "venue": "Micro", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-09-21", "journal": {"name": "2022 55th IEEE/ACM International Symposium on Microarchitecture (MICRO)", "pages": "815-834"}, "authors": [{"authorId": "11827442", "name": "A. G. Yağlıkçı"}, {"authorId": "2048193264", "name": "Ataberk Olgun"}, {"authorId": "2097715520", "name": "Minesh Patel"}, {"authorId": "1720701024", "name": "Haocong Luo"}, {"authorId": "40016363", "name": "Hasan Hassan"}, {"authorId": "3126431", "name": "Lois Orosa"}, {"authorId": "144889368", "name": "O. Ergin"}, {"authorId": "145929920", "name": "O. Mutlu"}], "citations": [{"paperId": "e0f43d7d24293fd8e1142d6e75765e514133cecb", "title": "START: Scalable Tracking for any Rowhammer Threshold"}, {"paperId": "c9edf92c1f762c52a90cc0cb45eb06d4eed82110", "title": "MIMDRAM: An End-to-End Processing-Using-DRAM System for High-Throughput, Energy-Efficient and Programmer-Transparent Multiple-Instruction Multiple-Data Computing"}, {"paperId": "c2a1dbf0ceefdf850ca1fdf093219bcd42a10404", "title": "CoMeT: Count-Min-Sketch-based Row Tracking to Mitigate RowHammer at Low Cost"}, {"paperId": "d5f2e95be45d3e003655a9a84e0adda9468b0838", "title": "MIMDRAM: An End-to-End Processing-Using-DRAM System for High-Throughput, Energy-Efficient and Programmer-Transparent Multiple-Instruction Multiple-Data Processing"}, {"paperId": "8c5ef03e9118253ec019965bf142d1be7998a453", "title": "Functionally-Complete Boolean Logic in Real DRAM Chips: Experimental Characterization and Analysis"}, {"paperId": "6ba01138fcabdc9df56e8a69588a82fd91480a63", "title": "Spatial Variation-Aware Read Disturbance Defenses: Experimental Analysis of Real DRAM Chips and Implications on Future Solutions"}, {"paperId": "35cd686796602367674625edd44e2d080ccad203", "title": "Multi-Ported GC-eDRAM Bitcell with Dynamic Port Configuration and Refresh Mechanism"}, {"paperId": "ba25f77e417be575b0c41a400b116b82416df73c", "title": "Rowhammer Attacks in Dynamic Random-Access Memory and Defense Methods"}, {"paperId": "cccf7e41660e45992cb2052ed64f06470086b908", "title": "Siloz: Leveraging DRAM Isolation Domains to Prevent Inter-VM Rowhammer"}, {"paperId": "7524cc310dba98bea6acaaa7be6802f20815b74a", "title": "ABACuS: All-Bank Activation Counters for Scalable and Low Overhead RowHammer Mitigation"}, {"paperId": "5c6d39653cbaed5be4a53bb8e3691c2076d29aeb", "title": "Exploring the Horizon: A Comprehensive Survey of Rowhammer"}, {"paperId": "288719f2a9436427ed7e3b21359a73efcf4dcbfb", "title": "Mayhem: Targeted Corruption of Register and Stack Variables"}, {"paperId": "1c495ff41a8e795641dbf81d5e8ac8b289ab89ba", "title": "Scalable and Configurable Tracking for Any Rowhammer Threshold"}, {"paperId": "b5ace93de904d7ccebbc328d5fce45c2f8e671bb", "title": "Retrospective: RAIDR: Retention-Aware Intelligent DRAM Refresh"}, {"paperId": "70f2f94f9a2759eb86b0ed1079da0dce468e3f7c", "title": "Retrospective: An Experimental Study of Data Retention Behavior in Modern DRAM Devices: Implications for Retention Time Profiling Mechanisms"}, {"paperId": "ceda5606b2189405adb20b12424e12388acb0a4e", "title": "RowPress: Amplifying Read Disturbance in Modern DRAM Chips"}, {"paperId": "79ed8d15950de3947b65c85ae5efe42396233d3a", "title": "Analysis of thermodynamic resistive switching in ZnO-based RRAM device"}, {"paperId": "4bdbdcbab8216acd846987f8b3e0e2a98cbbe5ff", "title": "Fundamentally Understanding and Solving RowHammer"}, {"paperId": "0c7607f8da3936420c778a6418e2ea5d89f7775c", "title": "DRAM Bender: An Extensible and Versatile FPGA-Based Infrastructure to Easily Test State-of-the-Art DRAM Chips"}, {"paperId": "07caf8168591f8598cd9aee06b49971f88e06ba5", "title": "Sectored DRAM: A Practical Energy-Efficient and High-Performance Fine-Grained DRAM Architecture"}, {"paperId": "6eff535aaa0b344bbabd9f8b9928b3c14802e875", "title": "High-Performance and Power-Saving Mechanism for Page Activations Based on Full Independent DRAM Sub-Arrays in Multi-Core Systems"}]}
