{"paperId": "8534b14537e42f72c9070163f6e6fe265c3e799a", "publicationVenue": null, "title": "Big linked data ETL benchmark on cloud commodity hardware", "abstract": "Linked Data storage solutions often optimize for low latency querying and quick responsiveness. Meanwhile, in the back-end, offline ETL processes take care of integrating and preparing the data. In this paper we explain a workflow and the results of a benchmark that examines which Linked Data storage solution and setup should be chosen for different dataset sizes to optimize the cost-effectiveness of the entire ETL process. The benchmark executes diversified stress tests on the storage solutions. The results include an in-depth analysis of four mature Linked Data solutions with commercial support and full SPARQL 1.1 compliance. Whereas traditional benchmarks studies generally deploy the triple stores on premises using high-end hardware, this benchmark uses publicly available cloud machine images for reproducibility and runs on commodity hardware. All stores are tested using their default configuration. In this setting Virtuoso shows the best performance in general. The other tree stores show competitive results and have disjunct areas of excellence. Finally, it is shown that each store's performance heavily depends on the structural properties of the queries, giving an indication of where vendors can focus their optimization efforts.", "venue": "SBD '16", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2016-06-26", "journal": {"pages": "12"}, "authors": [{"authorId": "2529173", "name": "D. Witte"}, {"authorId": "2925775", "name": "Laurens De Vocht"}, {"authorId": "1723397", "name": "R. Verborgh"}, {"authorId": "35712273", "name": "K. Knecht"}, {"authorId": "47278203", "name": "F. Pattyn"}, {"authorId": "3416691", "name": "H. Constandt"}, {"authorId": "1691320", "name": "E. Mannens"}, {"authorId": "144520698", "name": "R. Walle"}], "citations": [{"paperId": "4c7d05537ff8a91b969fe09ad3a45af6fd8f64ab", "title": "A performance benchmark over semantic rule checking approaches in construction industry"}, {"paperId": "1bde6d9937e63738f8acdeb1525f41df3ddc6a0b", "title": "Exploring the potential of semantics on the git protocol and its extensions"}, {"paperId": "241ff8de5dbf2471f6bbd491032b6e5ed764b2b0", "title": "A Framework for Reproducible Evaluation of Semantic Storage Options"}, {"paperId": "91bc4ae4331665db1111b579acd5257810da445f", "title": "Scaling Out Federated Queries for Life Sciences Data in Production"}]}
