{"paperId": "853b4f28e2f845d7f8db446634e89a7df12b48cb", "publicationVenue": {"id": "983b0731-eddf-4f05-9c9b-81059a9f9c51", "name": "IEEE Transactions on Vehicular Technology", "type": "journal", "alternate_names": ["IEEE Trans Veh Technol"], "issn": "0018-9545", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=25", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=25"]}, "title": "On the Design of Federated Learning in Latency and Energy Constrained Computation Offloading Operations in Vehicular Edge Computing Systems", "abstract": "With the advent of smart vehicles, several new latency-critical and data-intensive applications are emerged in Vehicular Networks (VNs). Computation offloading has emerged as a viable option allowing to resort to the nearby edge servers for remote processing within a requested service latency requirement. Despite several advantages, computation offloading over resource-limited edge servers, together with vehicular mobility, is still a challenging problem to be solved. In particular, in order to avoid additional latency due to out-of-coverage operations, Vehicular Users (VUs) mobility introduces a bound on the amount of data to be offloaded towards nearby edge servers. Therefore, several approaches have been used for finding the correct amount of data to be offloaded. Among others, Federated Learning (FL) has been highlighted as one of the most promising solving techniques, given the data privacy concerns in VNs and limited communication resources. However, FL consumes resources during its operation and therefore incurs an additional burden on resource-constrained VUs. In this work, we aim to optimize the VN performance in terms of latency and energy consumption by considering both the FL and the computation offloading processes while selecting the proper number of FL iterations to be implemented. To this end, we first propose an FL-inspired distributed learning framework for computation offloading in VNs, and then develop a constrained optimization problem to jointly minimize the overall latency and the energy consumed. An evolutionary Genetic Algorithm is proposed for solving the problem in-hand and compared with some benchmarks. The simulation results show the effectiveness of the proposed approach in terms of latency and energy consumption.", "venue": "IEEE Transactions on Vehicular Technology", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-02-01", "journal": {"name": "IEEE Transactions on Vehicular Technology", "pages": "2041-2057", "volume": "71"}, "authors": [{"authorId": "1557358679", "name": "S. Shinde"}, {"authorId": "25844074", "name": "Arash Bozorgchenani"}, {"authorId": "2914774", "name": "D. Tarchi"}, {"authorId": "143710669", "name": "Q. Ni"}], "citations": [{"paperId": "04ef16d9802dce8d4474a093ce8bfdbba8caec06", "title": "Vehicle Selection and Resource Allocation for Federated Learning-Assisted Vehicular Network"}, {"paperId": "662172551048158e88c2334ad275bfbac282bb85", "title": "A Distributed Multi-Agent Deep Reinforcement Learning-Aided Transmission Design for Dynamic Vehicular Communication Networks"}, {"paperId": "e951cdec067264d1821fcc89d2a966d3c6de42ef", "title": "Joint Incentive Mechanism Design and Energy-Efficient Resource Allocation for Federated Learning in UAV-Assisted Internet of Vehicles"}, {"paperId": "c2cc383152118d019d82f156392870214c9741f0", "title": "Network Sliced Distributed Learning-as-a-Service for Internet of Vehicles Applications in 6G Non-Terrestrial Network Scenarios"}, {"paperId": "fe0f2c2df0a0182be9de2ac0887681f3dde249e4", "title": "Networked Federated Learning-based Intelligent Vehicular Traffic Management in IoV Scenarios"}, {"paperId": "72c9d70a1cf3d1ba81b3786db2ed8be33e4d85d3", "title": "Video data offloading techniques in Mobile Edge Computing: A survey"}, {"paperId": "0a9290e39ea93801cfe80a7ed89d315df5dff1ba", "title": "Task Migration and Resource Allocation Scheme in IoV With Roadside Unit"}, {"paperId": "e3cb1854071e55b14d26ea4ce6d8d49ef81298bf", "title": "Location-Aware and Delay-Minimizing Task Offloading in Vehicular Edge Computing Networks"}, {"paperId": "35eae129769d74320c401da9abec4e9195a37964", "title": "Optimal Task Allocation for Battery-Assisted and Price-Aware Mobile Edge Computing"}, {"paperId": "3e4513de8a6b4429c9da74ae288a38392e075b7a", "title": "pdRide: Privacy-Preserving Distributed Online Ride-Hailing Matching Scheme"}, {"paperId": "59fb2eeb10ad7e9e79dad46562d5f66d122664e7", "title": "An Air-Ground Coordinated Sensing, Relay and Offloading for Emergency Disposal in ITS System"}, {"paperId": "48e4791b4b38a30ede877eb3d8c04fb028d26a68", "title": "A Distributed Learning Architecture for Semantic Communication in Autonomous Driving Networks for Task Offloading"}, {"paperId": "364d15da9d300a4d69d993fba56c7307969c9a6f", "title": "Resource Optimization for Task Offloading With Real-Time Location Prediction in Pedestrian-Vehicle Interaction Scenarios"}, {"paperId": "3d31561ec224029a61c7ad7a862f9d2896cb5ff1", "title": "Multi-Destination Cooperative Task Offloading in Blockchain-Based Vehicular Edge Computing Networks"}, {"paperId": "600618031bc84c6e3767b5258bc7931f47ea9b28", "title": "Federated Learning in Intelligent Transportation Systems: Recent Applications and Open Problems"}, {"paperId": "d50f11892559fdb596634a9c1a885f748ed1b3bb", "title": "Enabling Intelligent Vehicular Networks Through Distributed Learning in the Non-Terrestrial Networks 6G Vision"}, {"paperId": "b0bca64d6534c861887b1a125f3f0abff47915a7", "title": "Joint Air-Ground Distributed Federated Learning for Intelligent Transportation Systems"}, {"paperId": "a831f6796ff540ae12e7c1dc02618c5d133a6774", "title": "A Markov Decision Process Solution for Energy-Saving Network Selection and Computation Offloading in Vehicular Networks"}, {"paperId": "8668a4eff67bf57153f3b28add02fef7c8c2f0f6", "title": "Analysis and Performance Evaluation of Transfer Learning Algorithms for 6G Wireless Networks"}, {"paperId": "76e38224399733097b3b2fcfb14ff01a18522603", "title": "Task scheduling of computation-intensive graph jobs in UAV-assisted hybrid vehicular networks"}, {"paperId": "15517d5be1572b9c802636bf587929aeb1977f8e", "title": "Blockchain-Based Cooperative Computation Offloading and Secure Handover in Vehicular Edge Computing Networks"}, {"paperId": "b2779f677bbf7059ea1fcd0bcde686c8f66cd77b", "title": "TinyFL: On-Device Training, Communication and Aggregation on a Microcontroller For Federated Learning"}, {"paperId": "0345399381f2045087febefdc83309cd9cb3f9f2", "title": "Seismic Data Query Algorithm Based on Edge Computing"}, {"paperId": "541fd99af6d8f1bd3c337a80299832eb591ac413", "title": "Computation Offloading and Resource Allocation Based on Game Theory in Symmetric MEC-Enabled Vehicular Networks"}, {"paperId": "ab9964158aa70f733cf4bab1ad4c82d36fcb6542", "title": "Urban Air Mobility: Vision, Challenges and Opportunities"}, {"paperId": "fedacf3d69ef8ec1f4d9b081af2f3d05a6f590b9", "title": "Intelligent Space-Air-Ground Collaborative Computing Networks"}, {"paperId": "c21ac4a5d2c5c556eccb3c478c78d56ac95d6b55", "title": "Latency and Task Loss Probability for NOMA Assisted MEC in Mobility-Aware Vehicular Networks"}, {"paperId": "ac5a34da896e64c113369ea49d3e6691523e06a0", "title": "Multi-type task offloading for wireless Internet of Things by federated deep reinforcement learning"}, {"paperId": "dcdd50ef2daeed3ff25c906bfd3b18df2e54671d", "title": "Joint C-V2X Based Offloading and Resource Allocation in Multi-Tier Vehicular Edge Computing System"}, {"paperId": "779bb90c7c6cc62a90fd414e187c88abfe473acb", "title": "Collaborative Reinforcement Learning for Multi-Service Internet of Vehicles"}, {"paperId": "e817ce4bf7fe8bf1c150ab867c7509874c01182e", "title": "Efficient Rate-Splitting Multiple Access for the Internet of Vehicles: Federated Edge Learning and Latency Minimization"}, {"paperId": "28125071767280acebcfd051cef58335023f23c3", "title": "Double Auction Mechanism for Cooperative Swarm Learning in Internet of Vehicles"}, {"paperId": "203a43214fc836b5037842fad7f75a0d81f521ce", "title": "Blockchain-Based Trusted Traffic Offloading in Space-Air-Ground Integrated Networks (SAGIN): A Federated Reinforcement Learning Approach"}, {"paperId": "90c494fa3803971cfa5b1ef6c46847764665394c", "title": "Federated Deep Reinforcement Learning Based Task Offloading with Power Control in Vehicular Edge Computing"}, {"paperId": "f1fe07793f162510e4605a54603fffc0eb6c3936", "title": "Privacy-Preserving Digital Twin for Vehicular Edge Computing Networks"}, {"paperId": "21681ad1be96eb69ad9ecbf266b0cb13564b358a", "title": "Enhancing vehicular edge computing system through cooperative computation offloading"}, {"paperId": "0c0e9dc6d025ab74ecd8f7085db80c9d3d10faac", "title": "A federated multi-agent deep reinforcement learning for vehicular fog computing"}, {"paperId": "85194c4e386086784794ada9e8e2e308a51380d3", "title": "Blockchain-Empowered AI for 6G-Enabled Internet of Vehicles"}, {"paperId": "5ae6fe4e5053e3037c432443919de74fbb656407", "title": "Contract-based scheme for computational resource allocation in cloud-assisted parked vehicular edge computing"}, {"paperId": "958b74f165a16d22e819785e9bfc165aec3722f1", "title": "Network Selection and Computation Offloading in Non-Terrestrial Network Edge Computing Environments for Vehicular Applications"}, {"paperId": "01ddc54683147d20eb4472a3a8ab1af0b3eaa307", "title": "Cooperative Computation Offloading in Blockchain-Based Vehicular Edge Computing Networks"}, {"paperId": "99158f7f5c23a599d77fa2d7ce2d171cd214eb65", "title": "Computational Resources Allocation and Vehicular Application Offloading in VEC Networks"}, {"paperId": "114be6ba8e36393b956d5d9fcdbcc110dbf0debf", "title": "Overview of Distributed Machine Learning Techniques for 6G Networks"}, {"paperId": "be018d951b0b20483e5efab9e1256b8b416afa9a", "title": "Ruin Theory for User Association and Energy Optimization in Multi-Access Edge Computing"}, {"paperId": "9aa7c47db195cc412a67a76b2d2f19d092c9dd74", "title": "A Review on the Application of Internet of Medical Things in Wearable Personal Health Monitoring: A Cloud-Edge Artificial Intelligence Approach"}]}
