{"paperId": "85455ab8b1c36beb279d366aa36caa3eabb252b5", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Security Protection of 3D Models of Oblique Photography by Digital Watermarking and Data Encryption", "abstract": "To clarify the copyrights of 3D models of oblique photography (3DMOP) and guarantee their security, a novel security protection scheme of 3DMOP was proposed in this study by synergistically applying digital watermarking and data encryption. In the proposed scheme, point clouds were clustered first, and then the centroid and feature points of each cluster were calculated and extracted, respectively. Afterward, the watermarks were embedded into the point clouds cluster-by-cluster, taking distances between feature points and centroids as the embedding positions. In addition, the watermarks were also embedded using texture coordinates of 3DMOP to further enhance the robustness of the watermarking algorithm. Furthermore, Arnold transformation was performed on texture images of 3DMOP for security protection of classified or sensitive information. Experimental results have verified the strong imperceptibility and robustness of the proposed watermarking algorithm, as well as the high security of the designed data encryption algorithm. The outcomes of this work can refine the current security protection methods of 3DMOP and thus further expand their application scope.", "venue": "Applied Sciences", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-07", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "2248340132", "name": "Yaqin Jiao"}, {"authorId": "2273010759", "name": "Cong Ma"}, {"authorId": "2116813772", "name": "Juhua Luo"}, {"authorId": "9662219", "name": "Yinguo Qiu"}], "citations": [{"paperId": "e607782ead8857238beb601b019d716e0e936582", "title": "Homomorphic encryption domain asymmetric fingerprinting scheme for 3D models of oblique photography"}]}
