{"paperId": "854617ec026f7e4592b56259d37d938c709aae85", "publicationVenue": {"id": "75d7a8c1-d871-42db-a8e4-7cf5146fdb62", "name": "Social Science Research Network", "type": "journal", "alternate_names": ["SSRN, Social Science Research Network (SSRN) home page", "SSRN Electronic Journal", "Soc Sci Res Netw", "SSRN", "SSRN Home Page", "SSRN Electron J", "Social Science Electronic Publishing presents Social Science Research Network"], "issn": "1556-5068", "url": "http://www.ssrn.com/", "alternate_urls": ["www.ssrn.com/", "https://fatcat.wiki/container/tol7woxlqjeg5bmzadeg6qrg3e", "https://www.wikidata.org/wiki/Q53949192", "www.ssrn.com/en", "http://www.ssrn.com/en/", "http://umlib.nl/ssrn", "umlib.nl/ssrn"]}, "title": "An Efficient Online Prediction of Host Workloads Using Pruned GRU Neural Nets", "abstract": "Host load prediction is essential for dynamic resource scaling and job scheduling in a cloud computing environment. In this context, workload prediction is challenging because of several issues. First, it must be accurate to enable precise scheduling decisions. Second, it must be fast to schedule at the right time. Third, a model must be able to account for new patterns of workloads so it can perform well on the latest and old patterns. Not being able to make an accurate and fast prediction or the inability to predict new usage patterns can result in severe outcomes such as service level agreement (SLA) misses. Our research trains a fast model with the ability of online adaptation based on the gated recurrent unit (GRU) to mitigate the mentioned issues. We use a multivariate approach using several features, such as memory usage, CPU usage, disk I/O usage, and disk space, to perform the predictions accurately. Moreover, we predict multiple steps ahead, which is essential for making scheduling decisions in advance. Furthermore, we use two pruning methods: L1 norm and random, to produce a sparse model for faster forecasts. Finally, online learning is used to create a model that can adapt over time to new workload patterns.", "venue": "Social Science Research Network", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-03-29", "journal": {"name": "ArXiv", "volume": "abs/2303.16601"}, "authors": [{"authorId": "2169822983", "name": "Amin Setayesh"}, {"authorId": "103421957", "name": "Hamidreza Hadian"}, {"authorId": "1718255", "name": "R. Prodan"}], "citations": [{"paperId": "fb4c0aded6c581d0361f946bc73ff15deedcfb9c", "title": "GT-scheduler: a hybrid graph-partitioning and tabu-search based task scheduler for distributed data stream processing systems"}]}
