{"paperId": "854f96eda5da7e8d73c224de0c1f676b0f850b78", "publicationVenue": {"id": "6c8289bb-af7a-4fe0-9174-7850c42777a9", "name": "Journal of Alzheimer's Disease", "type": "journal", "alternate_names": ["J Alzheimer's Dis", "J Alzheimers Dis", "Journal of Alzheimers Disease"], "issn": "1387-2877", "url": "http://content.iospress.com/journals/journal-of-alzheimers-disease/", "alternate_urls": ["https://www.j-alz.com/", "http://www.j-alz.com/"]}, "title": "Neural Computation-Based Methods for the Early Diagnosis and Prognosis of Alzheimer's Disease Not Using Neuroimaging Biomarkers: A Systematic Review.", "abstract": "Background\nThe growing number of older adults in recent decades has led to more prevalent geriatric diseases, such as strokes and dementia. Therefore, Alzheimer's disease (AD), as the most common type of dementia, has become more frequent too.\n\n\nBackground\nObjective: The goals of this work are to present state-of-the-art studies focused on the automatic diagnosis and prognosis of AD and its early stages, mainly mild cognitive impairment, and predicting how the research on this topic may change in the future.\n\n\nMethods\nArticles found in the existing literature needed to fulfill several selection criteria. Among others, their classification methods were based on artificial neural networks (ANNs), including deep learning, and data not from brain signals or neuroimaging techniques were used. Considering our selection criteria, 42 articles published in the last decade were finally selected.\n\n\nResults\nThe most medically significant results are shown. Similar quantities of articles based on shallow and deep ANNs were found. Recurrent neural networks and transformers were common with speech or in longitudinal studies. Convolutional neural networks (CNNs) were popular with gait or combined with others in modular approaches. Above one third of the cross-sectional studies utilized multimodal data. Non-public datasets were frequently used in cross-sectional studies, whereas the opposite in longitudinal ones. The most popular databases were indicated, which will be helpful for future researchers in this field.\n\n\nConclusions\nThe introduction of CNNs in the last decade and their superb results with neuroimaging data did not negatively affect the usage of other modalities. In fact, new ones emerged.", "venue": "Journal of Alzheimer's Disease", "year": 2024, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2024-03-10", "journal": {"name": "Journal of Alzheimer's disease : JAD"}, "authors": [{"authorId": "1412941953", "name": "Ylermi Cabrera-León"}, {"authorId": "2809820", "name": "P. G. Báez"}, {"authorId": "84317562", "name": "P. Fernández-López"}, {"authorId": "1411394767", "name": "C. P. Suárez-Araujo"}], "citations": []}
