{"paperId": "8551cc683869a141462f8a982e66ab06f8921e6c", "publicationVenue": {"id": "20a3a2f3-532a-4f04-9f3d-1e268e100872", "name": "International Journal of Advanced Computer Science and Applications", "type": "journal", "alternate_names": ["Int J Adv Comput Sci Appl"], "issn": "2156-5570", "url": "http://sites.google.com/site/ijacsa2010/", "alternate_urls": ["http://thesai.org/Publication/Default.aspx", "https://thesai.org/Publications/IJACSA"]}, "title": "Exploring the Impact of Hybrid Recommender Systems on Personalized Mental Health Recommendations", "abstract": "—Personalized mental health recommendations are crucial in addressing the diverse needs and preferences of individuals seeking mental health support. This research aims to study the investigates the impact of hybrid recommender systems on the provision of personalized recommendations for mental health interventions. This paper explores the integration of various recommendation techniques, including collaborative filtering, content-based filtering, and knowledge-based filtering, within the hybrid system to leverage their respective strengths for Personalized Mental Health Recommendations. Additionally, this paper discusses the challenges and considerations involved in combining multiple techniques, such as data integration and algorithm selection for Hybrid Recommender System for this domain. Furthermore, this paper also discusses the data sources that are typically used in hybrid recommender systems for mental health and evaluation metrics that are employed to assess the effectiveness of the hybrid recommender system. Future research opportunities, including incorporating emerging technologies and leveraging novel data sources, are identified to further enhance the performance and relevance of hybrid recommender systems in the mental health domain. The findings of this research contribute to the advancement of personalized mental health support and the development of effective recommendation systems tailored to individual mental health needs.", "venue": "International Journal of Advanced Computer Science and Applications", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "International Journal of Advanced Computer Science and Applications"}, "authors": [{"authorId": "2132369047", "name": "I. Mazlan"}, {"authorId": "38991778", "name": "N. Abdullah"}, {"authorId": "94382422", "name": "N. Ahmad"}], "citations": [{"paperId": "916f28a0bd8700461d27fb9c9e87261bb435c9c6", "title": "MMKG-PAR: Multi-Modal Knowledge Graphs-Based Personalized Attraction Recommendation"}, {"paperId": "2ba199c25641c460ee6a162a6052ccdf553b5556", "title": "Model-based Filtering Techniques for Recommendation Systems in Healthcare Domain"}]}
