{"paperId": "85551fbf4fae0cbd2b4a7f9e2ea658d3cae307f7", "publicationVenue": {"id": "b827eced-82ea-44e6-b6d3-e8dfd4d8f000", "name": "Bulletin of Electrical Engineering and Informatics", "type": "journal", "alternate_names": ["Bull Electr Eng Informatics"], "issn": "2089-3191", "alternate_issns": ["2302-9285"], "url": "https://web.archive.org/web/20180818122233/http:/portalgaruda.org/portalgaruda/journals/index.php/EEI/issue/archive", "alternate_urls": ["http://beei.org/index.php/EEI"]}, "title": "A deep learning-based intelligent decision-making model for tumor and cancer cell identification", "abstract": "In the current era, the prevalence of common ailments is leading to an increasing number of fatalities. Various infections, viruses, and other pathogens can cause these illnesses. Some illnesses can give rise to tumors that seriously threaten human health. Distinct forms of tumors exist, including benign, premalignant, and malignant, with cancer being present only in malignant forms. Deep learning (DL) algorithms have emerged as one of the most promising methods for detecting cancers within the human body. However, existing models face criticism for their limitations, such as lack of support for large datasets, and reliance on a limited number of attributes from input images. To address these limitations and enable efficient cancer detection throughout the human body, an intelligent decision-making approach model (IDMA) is proposed. The IDMA is combined with the pre-trained VGG19 for improved training. The IDMA analyses convolutional neural network (CNN) layer images for signs of malignancy and rules out false positives. Various performance indicators, like sensitivity, precision, recall, and F1-score, are used to assess the system's performance. The suggested system has been evaluated and proven to outperform similar current systems, achieving an impressive 98.67% accuracy in detecting cancer cells.", "venue": "Bulletin of Electrical Engineering and Informatics", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-02-01", "journal": {"name": "Bulletin of Electrical Engineering and Informatics"}, "authors": [{"authorId": "2254119632", "name": "Putta Durga"}, {"authorId": "2051699226", "name": "Deepthi Godavarthi"}], "citations": []}
