{"paperId": "855c6417417b5d865150a337d07ea56743c26cd2", "publicationVenue": {"id": "6225799c-fcc0-4c08-b753-4bb16e4bf8e1", "name": "Wireless Days", "type": "conference", "alternate_names": ["WD", "Wirel Day"]}, "title": "Investigations on recent power-aware opportunistic protocols in WSN", "abstract": "Nowdays, Wireless Sensor Networks (WSNs), Internet of Things (IoT), Industrial IoT (IIoT), and Cognitive IoT (CIoT), have attracted the attention of many researchers and industrials in different domains due to their wide deployment in Cyber-Physical Systems and other emerging areas. However, battery lifetime extension and energy usage constraints associated with WSNs and IoT were found to be the major challenges of concern. To address these challenges various Network Lifetime (NL) maximization techniques and approaches have been proposed to extend battery longevity and to ensure continuous full operational network activity. Power-aware opportunistic transmission and data gathering schemes are among the relevant NL maximization. Accordingly, in this paper, we review and discuss various recent contributions related to opportunistic MAC and routing approaches. Furthermore, we present a comprehensive comparison between opportunistic routing mechanisms for WSN.", "venue": "Wireless Days", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2018-04-03", "journal": {"name": "2018 Wireless Days (WD)", "pages": "187-189"}, "authors": [{"authorId": "2330607", "name": "L. Chaari"}, {"authorId": "1414952523", "name": "Sarrah El-Kaffel"}, {"authorId": "2818872", "name": "A. B. Mnaouer"}, {"authorId": "2265946", "name": "F. Touati"}], "citations": [{"paperId": "0b0b86a9095d6df1ea64aba14552373cf6b59b58", "title": "Artificial intelligence implication on energy sustainability in Internet of Things: A survey"}, {"paperId": "e7940f383cc75db5e49bdd44562e8215783d6b22", "title": "Improving Energy Efficiency and Reliability in WuR-Based IoT Systems: An Error Correction Approach"}, {"paperId": "4cfd295763e5479206330ac3727fb70ecf2d785c", "title": "Machine learning based multi scale parallel K-means++ clustering for cloud assisted internet of things"}]}
