{"paperId": "855d124ed1e74c6073a055d57d35bde583c55b5c", "publicationVenue": {"id": "228761ec-c40a-479b-8309-9dcbe9851bcd", "name": "IEEE Internet of Things Journal", "type": "journal", "alternate_names": ["IEEE Internet Thing J"], "issn": "2327-4662", "url": "https://www.ieee.org/membership-catalog/productdetail/showProductDetailPage.html?product=PER288-ELE", "alternate_urls": ["https://ieeexplore.ieee.org/servlet/opac?punumber=6488907", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6488907", "http://ieee-iotj.org/#"]}, "title": "DANTD: A Deep Abnormal Network Traffic Detection Model for Security of Industrial Internet of Things Using High-Order Features", "abstract": "With the development of blockchain, artificial intelligence, and data mining technology, abnormal network traffic data has become easy to obtain. The traffic detection model detects the traffic patterns in the network to find abnormal traffic that does not conform to the normal traffic law, which has great security significance for Industrial Internet of Things (IIoT) networks and devices in real scenarios. However, previous abnormal detection models rely on expert experience and cannot cope with real-time changes in IIoT scenarios. The manual features cannot be sufficiently representative and adaptive. Moreover, there are few abnormal traffic data in real scenarios, which makes the model unable to fully learn the potential distribution in abnormal data. Therefore, in this work, we propose a deep abnormal network traffic detection model (DANTD) for the security of IIoT using high-order features and novel data augmentation strategies. The DANTD model first adopts a deep convolutional autoencoder to extract effective high-order features to make it more representative. Then, the DANTD model uses generative adversarial networks as data augmentation strategies to enrich the abnormal data, so that the model can fully consider the information of the data distribution. Comprehensive experiments on real IIoT data sets validate the effectiveness of the DANTD model.", "venue": "IEEE Internet of Things Journal", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-15", "journal": {"name": "IEEE Internet of Things Journal", "pages": "21143-21153", "volume": "10"}, "authors": [{"authorId": "13997282", "name": "Guolong Shi"}, {"authorId": "2107643826", "name": "X. Shen"}, {"authorId": "2211056553", "name": "Fuke Xiao"}, {"authorId": "2143919532", "name": "Yigang He"}], "citations": [{"paperId": "e2630c57dd5ecd0b05c0240e56fcdada9dd8905f", "title": "Dynamic Serpentine Convolution with Attention Mechanism Enhancement for Beef Cattle Behavior Recognition"}, {"paperId": "4878e4ddf544c1f641dfb0732ed0fe797403a9f0", "title": "Deep Learning Based Anomalous Traffic Detection Research"}, {"paperId": "9e05e251b1659c0bccbc89e9c715c102a23ae5d6", "title": "Cataluminescence Sensor Based on LaCO3OH Microspheres for Volatile Organic Compounds Detection and Pattern Recognition"}, {"paperId": "02cbd7bae77c2861a835a0bf1d40cfc3d03e8711", "title": "A high performance computing technology powered multimedia fusion model in university English translation"}, {"paperId": "09fa3e164df88874d485a9c2954ee83163fbd90b", "title": "Landscape planning and design and visual evaluation for landscape protection of geological environment"}, {"paperId": "805ebd539e03664a09c0f2fb8895ef1e2ab7a83a", "title": "An abnormal traffic detection method using GCN-BiLSTM-Attention in the internet of vehicles environment"}, {"paperId": "5666605bd2c1a7871bebdc848448957c322e2916", "title": "Landscape Architecture Design and Implementation Based on Intelligent Monitoring Sensing Network"}, {"paperId": "fc898b27c1c61f216bb9249c0d5232215885fbba", "title": "Research on Strategic Decision Model of Human Resource Management based on Biological Neural Network"}, {"paperId": "85cd006304b48850b6f8344ca1a5a1edb8c8f662", "title": "Smart Sensor Signal-Assisted Behavioral Model and Control of Live Interaction in Digital Media Art"}, {"paperId": "6b90c9e2d6e4b22667d4952af9fa9b0d62797ca0", "title": "Construction and Application of Automatic Scoring Index System for College English Multimedia Teaching Based on Neural Network"}, {"paperId": "699d70ae16c9a4e27ff2a053ab01fe10b03d3603", "title": "Design Strategy and Application of Headwear with National Characteristics Based on Information Visualization Technology"}, {"paperId": "dcb733baf01885184280e22f1bf990ae466bbbfe", "title": "Novel Class Probability Features for Optimizing Network Attack Detection With Machine Learning"}]}
