{"paperId": "856f7599062e584c4acc02772d565dd875d31e1b", "publicationVenue": {"id": "79c5a18d-0295-432c-aaa5-961d73de6d88", "name": "IEEE Transactions on Neural Networks and Learning Systems", "alternate_names": ["IEEE Trans Neural Netw Learn Syst"], "issn": "2162-237X", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=5962385", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=5962385"]}, "title": "Energy-Performance Assessment of Oscillatory Neural Networks Based on VO 2 Devices for Future Edge AI Computing.", "abstract": "Oscillatory neural network (ONN) is an emerging neuromorphic architecture composed of oscillators that implement neurons and are coupled by synapses. ONNs exhibit rich dynamics and associative properties, which can be used to solve problems in the analog domain according to the paradigm let physics compute. For example, compact oscillators made of VO 2 material are good candidates for building low-power ONN architectures dedicated to AI applications at the edge, like pattern recognition. However, little is known about the ONN scalability and its performance when implemented in hardware. Before deploying ONN, it is necessary to assess its computation time, energy consumption, performance, and accuracy for a given application. Here, we consider a VO 2 -oscillator as an ONN building block and perform circuit-level simulations to evaluate the ONN performances at the architecture level. Notably, we investigate how the ONN computation time, energy, and memory capacity scale with the number of oscillators. It appears that the ONN energy grows linearly when scaling up the network, making it suitable for large-scale integration at the edge. Furthermore, we investigate the design knobs for minimizing the ONN energy. Assisted by technology computer-aided design (TCAD) simulations, we report on scaling down the dimensions of VO 2 devices in crossbar (CB) geometry to decrease the oscillator voltage and energy. We benchmark ONN versus state-of-the-art architectures and observe that the ONN paradigm is a competitive energy-efficient solution for scaled VO 2 devices oscillating above 100 MHz. Finally, we present how ONN can efficiently detect edges in images captured on low-power edge devices and compare the results with Sobel and Canny edge detectors.", "venue": "IEEE Transactions on Neural Networks and Learning Systems", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-01-26", "journal": {"name": "IEEE transactions on neural networks and learning systems", "volume": "PP"}, "authors": [{"authorId": "2115013041", "name": "Corentin Delacour"}, {"authorId": "7990765", "name": "S. Carapezzi"}, {"authorId": "2007506752", "name": "Madeleine Abernot"}, {"authorId": "1404803112", "name": "A. Todri-Sanial"}], "citations": [{"paperId": "115efb6260148f95ac6b93438bd18cb4adfdc77d", "title": "Modern Computing: Vision and Challenges"}, {"paperId": "35cce44d75f0ff8b44677b777c3da4977bb76bc2", "title": "Operating Coupled VO₂-Based Oscillators for Solving Ising Models"}, {"paperId": "b823588b72769325a3f7c54f7d408b3e4a5efe56", "title": "Temporal credit assignment for one-shot learning utilizing a phase transition material"}, {"paperId": "56d2e3d5386a9747215c22984d0ae60c62d24952", "title": "An Enhanced 1440 Coupled CMOS Oscillator Network to Solve Combinatorial Optimization Problems"}, {"paperId": "39e9d1b3aa6b0b4d8022aba5f38acdc4b2962095", "title": "How fast can vanadium dioxide neuron-mimicking devices oscillate? Physical mechanisms limiting the frequency of vanadium dioxide oscillators"}, {"paperId": "b95a2e6a7090624c8739e0495332a70c2bd0cf29", "title": "Digital Implementation of On-Chip Hebbian Learning for Oscillatory Neural Network"}, {"paperId": "5e79e80176ef0f5c44ed23cf352b1625c6b6fbcb", "title": "Energy-Efficient Machine Learning Acceleration: From Technologies to Circuits and Systems"}, {"paperId": "a47e87acfc3c095ae4fa77c13d5a64e7d3885c24", "title": "A mixed-signal oscillatory neural network for scalable analog computations in phase domain"}, {"paperId": "8ad1088a99c40b0ccde29fd53b3a0a5fe34f7221", "title": "Oscillatory neural network learning for pattern recognition: an on-chip learning perspective and implementation"}, {"paperId": "b861ecd59dc18a81ce7f2389c8ca336edc741abf", "title": "Training energy-based single-layer Hopfield and oscillatory networks with unsupervised and supervised algorithms for image classification"}, {"paperId": "ed61f84c7e4f54cdcd652fc3f88fe706d1300baa", "title": "Understanding Rhythmic Synchronization of Oscillatory Neural Networks Based on NbOx Artificial Neurons for Edge Detection"}, {"paperId": "369b67abe4228541a6df56aa17f71e0b33e23b10", "title": "Hardware Design of Memristor-based Oscillators for Emulation of Neurological Diseases"}, {"paperId": "2dedc977fc8a9590a24f3d6fde65bac481cb0dc3", "title": "Two-Layered Oscillatory Neural Networks with Analog Feedforward Majority Gate for Image Edge Detection Application"}, {"paperId": "1522ecf4bd938c3c68138eba590fc3c5df2e4db8", "title": "SIFT-ONN: SIFT Feature Detection Algorithm Employing ONNs for Edge Detection"}, {"paperId": "019574d1e3125180c0b56366f17c57c4f2da84d9", "title": "Building Oscillatory Neural Networks: AI Applications and Physical Design Challenges"}, {"paperId": "955c13cdbaa47f126aaa3dfa5063dd63abe649e5", "title": "Role of ambient temperature in modulation of behavior of vanadium dioxide volatile memristors and oscillators for neuromorphic applications"}, {"paperId": "a4778d82e09cacdbe2fef7b72fecb8a4fea9f353", "title": "Oscillatory Neural Network for Edge Computing: A Mobile Robot Obstacle Avoidance Application"}, {"paperId": "5767ff5d9e92d5a79f72f04eae8c23ec2e5b148f", "title": "Oscillatory Neural Networks for Obstacle Avoidance on Mobile Surveillance Robot E4"}, {"paperId": "b3b07568c4f543185284b4da5ca7f4d6530736d6", "title": "Brain-Inspired Mutual Synchronization in Cross-Coupled NbOx Oscillation Neurons for Oscillatory Neural Network Applications"}, {"paperId": "af105839258d85165523d20f22817f952481b728", "title": "Ultra-low power in-sensor neuronal computing with oscillatory retinal neurons for frequency-multiplexed, parallel machine vision"}, {"paperId": "b02364ab877be7f412027c769eb368a8c4c10d35", "title": "Telematics and Informatics Reports"}]}
