{"paperId": "857138baa0ee48b1f9c1d617a16a5beecc963d78", "publicationVenue": {"id": "8f125553-3fd5-4370-a175-f7179db29048", "name": "IEEE International Performance, Computing, and Communications Conference", "type": "conference", "alternate_names": ["International Phoenix Conference on Computers and Communications", "IPCCC", "Int Phoenix Conf Comput Commun", "International Performance, Computing, and Communications Conference", "Int Perform Comput Commun Conf", "IEEE Int Perform Comput Commun Conf"], "url": "http://www.ipccc.org/"}, "title": "Data Heat Prediction in Storage Systems Using Behavior Specific Prediction Models", "abstract": "The increase in data generation and the decrease in the cost of storage increases the need for intelligent data management. One avenue that would allow storage systems to manage data better is to feed it with an accurate prediction of how many disk operations are expected on that data. In this paper, we introduce a method to predict the data heat in a storage system. Our method is derived from two insights. The first is that we can use a set of quick to compute signals which constrain the set of possible future heat patterns. The underlying assumption in this is that the signals provide a description of the access pattern and the requests that have similar signals have a similar set of future behavior. The second is that the storage requests can be partitioned into groups based on their signal. Our method generates a unique prediction model for each group from the corresponding heat patterns. This makes the model generation process easier and more precise. The results of our method on public datasets show that it is a viable way to predict heat. Our method is able to accurately almost all inactive regions and provides useful predictions for active regions.", "venue": "IEEE International Performance, Computing, and Communications Conference", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-10-01", "journal": {"name": "2019 IEEE 38th International Performance Computing and Communications Conference (IPCCC)", "pages": "1-8"}, "authors": [{"authorId": "1486036960", "name": "Lu Pang"}, {"authorId": "1679172", "name": "Anis Alazzawe"}, {"authorId": "1716613", "name": "K. Kant"}, {"authorId": "2054652137", "name": "Jeremy Swift"}], "citations": [{"paperId": "1a1ac6b4c0112c03fc4738e94c971151e3450b10", "title": "Streaming Machine Learning for Supporting Data Prefetching in Modern Data Storage Systems"}, {"paperId": "1a6fb925152d9933dbc1e8eed9661e26631ee5b2", "title": "I/O Access Patterns in HPC Applications: A 360-Degree Survey"}, {"paperId": "28d70dfe11ff60cd76003d1005ad1d029cab02bf", "title": "Efficient Big-Data Access: Taxonomy and a Comprehensive Survey"}, {"paperId": "cfeb90accdf98fbaa517e5a01e3035119f1799fa", "title": "Optimized Proactive Recovery in Erasure-Coded Cloud Storage Systems"}]}
