{"paperId": "8598b4ed55bfba0d72bc757fa21af85a767b6e0d", "publicationVenue": null, "title": "DiaVis: Exploration and Analysis of Diabetes through Visual Interactive System", "abstract": "Background: Diabetes is a long-term disease characterized by high blood sugar and has risen as a public health problem globally. Exploring and analyzing diabetes data is a timely concern because it may prompt a variety of serious illnesses, including stroke, kidneyfailure,heartattacks,etc.Severalexistingpiecesofresearchhaverevealedthatdiabetesdata,suchassystolicbloodpressure(SBP),diastolicbloodpressure(DBP),weight,height,age,etc.,canprovideinsightfulinformationaboutpatientsdiabetesstates. However,veryfewstudieshavefocusedonvisualizingdiabetesmellitus(DM)insightstosupporthealthcareadministrator(HA)’sgoalsadequately,suchas(i)decision-making,(ii)identifyingandgroupingassociatedfactors,and(iii)analyzinglargedata effectivelyremainsunexplored. Objective: This study aims to design an interactive Visualization system (Vis) to explore diabetes mellitus (DM) insights and its associated factors in Bangladesh. Methods: In this study, first, a case study method has employed to understand diabetes data. Second, we examine the potential of user-centered technology in addressing these challenges and design a Vis named “ DiaVis ” to process and present raw data in the form of graphics, graphs, and processed text, as well as a variety of user interaction possibilities. It helps to extract valuable data and present it in a simple and easy-to-understand way. Moreover, we highlight some key insights from our study that may help explore the healthcare community. Results: A user study with 20 individuals is used to evaluate our system. By allowing iterative exploration and modification of data in a dashboard with multiple-coordinated views, the DiaVis system improves the flow of visual analysis. Conclusion: This study suggests that the healthcare community should pay more attention to developing appropriate policy measures to reduce the risk of DM. © 2021 The Authors . Publishing services by Atlantis Press International B.V. This is an open access article distributed under the CC BY-NC 4.0 license (http://creativecommons.org/licenses/by-nc/4.0/).", "venue": "Hum. Centric Intell. Syst.", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "Hum. Centric Intell. Syst.", "pages": "75", "volume": "1"}, "authors": [{"authorId": "34318865", "name": "Mosiur Rahman"}, {"authorId": "2110073056", "name": "Md. Rafiqul Islam"}, {"authorId": "2066061053", "name": "Sharmin Akter"}, {"authorId": "2131186840", "name": "Shanjita Akter"}, {"authorId": "68975161", "name": "Linta Islam"}, {"authorId": "2149131224", "name": "Guandong Xu"}], "citations": [{"paperId": "5aa3cfc2c41c3a2e09a01bbf1f23a17511aa10ab", "title": "LieVis: A Visual Interactive Dashboard for Lie Detection Using Machine Learning and Deep Learning Techniques"}, {"paperId": "2f15a472dd454769500d6928f880a1b3d848c6fd", "title": "SIDVis: Designing Visual Interactive System for Analyzing Suicide Ideation Detection"}, {"paperId": "01c057b4b59fee5ffd7c5b2dad83cacc4190567f", "title": "ECTRS: A Personalised Early Career Trajectory Recommender System for Youths"}, {"paperId": "3c7d71c59f50808c839ac1def6de64ab2fc13674", "title": "HDVis: An Interactive Heart Disease Analysis Through Visualization System"}, {"paperId": "7ef089af0afa9b727a19646139b1c5ae8f766e7a", "title": "Techniques of Machine Learning for the Purpose of Predicting Diabetes Risk in PIMA Indians"}]}
