{"paperId": "85abe67340479bd415a708da2bf4f2b2999dd5b4", "publicationVenue": {"id": "6793bab8-ff4a-4076-87a2-ee9deac019a5", "name": "International Journal of Occupational Medicine and Environmental Health", "type": "journal", "alternate_names": ["Int J Occup Med Environ Health"], "issn": "1232-1087", "url": "https://link.springer.com/journal/13382", "alternate_urls": ["http://www.versita.com/ijomeh/", "http://ijomeh.eu/"]}, "title": "ANALYSIS OF THE PREVALENCE OF ANTI-SARS-CoV-2 ANTIBODIES IN GROUPS OF MEDICAL AND NON-MEDICAL PROFESSIONS", "abstract": "Objectives: The assessment of the prevalence of anti-SARS-CoV-2 antibodies in various professional groups is very important. Hence, the purpose of the following study was to analyze the seroprevalence of anti-SARS-CoV-2 antibodies among employees performing both medical and non-medical professions before the launch of SARS-CoV-2 vaccination. Material and Methods: The study was conducted among employers of 1 of the institutions: The Provincial Specialist Hospital of Władysław Biegański in Łódź, Poland, Radio Łódź and the Border Guards of Łódź Airport. Blood samples were collected in December 2020–February 2021. Patients were screened for the presence of SARS-CoV-2 antibodies. Simultaneously respondents were asked to complete a self-designed questionnaire including demographic data, detailed profession, history of SARS-CoV-2 infection and willingness to be vaccinated against COVID-19. Results: A total of 659 people were included in the study. The presence of anti-SARS-CoV-2 antibodies was found in 26.1% (N = 172) of the subjects. Seroprevalence was significantly higher in the group of rural residents (p < 0.012), participants who declared previous COVID-19 infection (p < 0.001) and healthcare workers (HCWs) (p = 0.002), especially nurses (35.5%, p = 0.003) and medics worked in areas dedicated to COVID-19 than in other specialties (38.7% vs. 26.8%, respectively, p = 0.017). There was no association between the presence of antibodies and the gender (p = 0.118), age (p = 0.559) or BMI (p = 0.998). Conclusions: Healthcare workers, in particular nurses, are at high risk of contracting COVID-19 in the workplace. Occupational infections can occur during occur not only during contact with the patient, but also with members of the medical team who do not show typical symptoms of the disease. Shortages in medical staff may also increase the number of infections among HCWs. Medical and hospital staff providing health services during the COVID-19 epidemic in Poland, may seek compensation in the event of consequences related to SARS-CoV-2 infection. The effectiveness of education and self-discipline in complying to safety rules among HCWs should also be constantly monitored.", "venue": "International Journal of Occupational Medicine and Environmental Health", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-01", "journal": {"name": "International Journal of Occupational Medicine and Environmental Health", "pages": "643 - 655", "volume": "36"}, "authors": [{"authorId": "2248059070", "name": "Paulina Biernacka"}, {"authorId": "5750592", "name": "A. Piekarska"}, {"authorId": "1402234851", "name": "A. Berkan-Kawińska"}], "citations": []}
