{"paperId": "85bb879258b048f950056fccab92bea9f81ca130", "publicationVenue": null, "title": "Intelligent Computation to build a Novel Recommender of Products through (PageRank-Clustering and DgSpan- FBR)", "abstract": "Data is considered as one of the worthiest existent resources in the world. The fast development of technology provides us with huge/big data that needs deep analysis to understand and extraction useful information\\knowledge from it. Thus, analysing such kind of data resembles a great challenge for researchers in the field of intelligent computation. The proposed model consists of three stages: the first stage is the collecting and preparing data (i.e., includes handle missing values and data convert into graphs). The second stage generates communities from graphs by developing one of the graph mining algorithms called (PageRank Clustering & Verification). Third stage includes building association patterns to the optimal clusters (subgraphs) and validating from it through developing one of the association pattern algorithms called Develop gSpan-Forward\\ Backward Rules (DgSpan-FBR). The design model called Novel Recommender of products based on Graph Mining (NRGM) is distinguished by compressing the lost time of searching the best products that users need as well as increasing the accuracy of selecting of products. NRGM model is applied using on one of huge/big database have six parts different in number of samples, NRGM processed database to generated a set of communities through PageRank-Clustering. Then verification from these communities by apply two measures called (i.e., Modularity and Silhouette) to find optimal community. We test different number of communities (i.e., 2, 4, 6, 8,10 and 12) Then found two communities are the optimal where the Modularity of it is 0.679 while, silhouette is 0.699. Finally, a set of association patterns is found from the optimal community through both traditional association graph mining method called (gSpan) and developed method (DgSpan-FBR), where, the traditional method generates 3000 pattens for each community. While DgSpan-FBR generates 262 patterns. As a result, NRGM is consider as pragmatic model to deal with hug/big dataset, at the same time, it reduces the searching time and increase the accuracy of results.", "venue": "2020 International Conference on Decision Aid Sciences and Application (DASA)", "year": 2020, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2020-11-08", "journal": {"name": "2020 International Conference on Decision Aid Sciences and Application (DASA)", "pages": "547-554"}, "authors": [{"authorId": "152229303", "name": "Samaher Al-Janabi"}, {"authorId": "2046957100", "name": "Noor K."}], "citations": [{"paperId": "2c2f9b1ed7b6c3596c456d23cd679c6672f28d29", "title": "BAR: Behavior-aware recommendation for sequential heterogeneous one-class collaborative filtering"}, {"paperId": "fa550c9a1de9730b1d3a3cf6d1d4cf6568522cd3", "title": "Uncertainty measurement for single cell RNA-seq data via Gaussian kernel: Application to unsupervised gene selection"}, {"paperId": "3f8d21663590a81ebcce2c8b5836e8295b7b9fb6", "title": "Scheduling Activities of Smart Phone and Smart Watch Based on Optimal Pattern Model (SA-OPM)"}]}
