{"paperId": "85c6db4e2eb186a8cd251220882342cdafd34ce1", "publicationVenue": {"id": "6a1abd85-3eca-4491-ac76-0134749a10fc", "name": "International Workshop on Data Warehousing and OLAP", "type": "conference", "alternate_names": ["Data Warehousing and OLAP", "Int Workshop Data Warehous L", "DOLAP", "Data Warehous L"], "url": "http://www.wikicfp.com/cfp/program?id=748"}, "title": "An In-depth Investigation of Large-scale RDF Relational Schema Optimizations Using Spark-SQL", "abstract": "This paper discusses one of the most significant challenges of large-scale RDF data processing over Apache Spark, the relational schema optimization. The choice of RDF partitioning techniques and storage formats using SparkSQL significantly impacts query performance. The impact of the relational schemas and the underlying data storage formats is indisputable; they significantly affect the query performance. Nevertheless, the trade-offs in different configurations have not been a subject of intensive study in the literature. This paper presents an in-depth investigation for practitioners to understand such trade-offs and their best practices. It also reports on the pitfalls behind the implementation SPARQL optimizations over SparkSQL . Our experiments provide insights into these schemas’ relative strengths by comparing three different partitioning techniques and four other storage formats. Our results draw a better understanding of the current State-Of-The-Art (S.O.T.A) and pave the way for a wide range of best practices and systematically tuning the performance of distributed systems to handle vast RDF data.", "venue": "International Workshop on Data Warehousing and OLAP", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"pages": "71-80"}, "authors": [{"authorId": "2065777089", "name": "Mohamed Ragab"}, {"authorId": "50271459", "name": "Riccardo Tommasini"}, {"authorId": "17663383", "name": "Feras M. Awaysheh"}, {"authorId": "145441140", "name": "J. Ramos"}], "citations": [{"paperId": "1848fd7dc64e9cd99ebe7a67dd3672907ca851fb", "title": "PAPAYA: A library for performance analysis of SQL-based RDF processing systems"}, {"paperId": "1b9ce0e84228882e912e8c526eca0911860929bd", "title": "Big Data Analytics from the Rich Cloud to the Frugal Edge"}, {"paperId": "27c0b3467106c49e1d365b44e6a4cedc5b8972c4", "title": "FedCSD: A Federated Learning Based Approach for Code-Smell Detection"}, {"paperId": "7b3d27f7c0fe22d654f299fe2148077f9dbd7f9c", "title": "OPERA-gSAM: Big Data Processing Framework for UMI Sequencing at High Scalability and Efficiency"}, {"paperId": "18f95c677e014391acd632cf2c8d5033cf6a1a20", "title": "PAPyA: Performance Analysis of Large RDF Graphs Processing Made Easy"}, {"paperId": "77abea0ef5894c4c6b7e3bf37cbbe7f4caaf56f1", "title": "A Framework to Compute Entity Relatedness in Large RDF Knowledge Bases"}, {"paperId": "39ea64bfdcc901e382775554d85c260e426b6fb8", "title": "SparkFlow: Towards High-Performance Data Analytics for Spark-based Genome Analysis"}, {"paperId": "e3235cee4c22facafbaa5dd50d64ace8f8bdd840", "title": "A distributed framework to investigate the entity relatedness problem in large RDF knowledge bases"}, {"paperId": "75f8b79bbc35e6ca6ff1e83a71b117b228ed2bc2", "title": "Javier Guillot Jiménez Strategies to Understand the Connectivity of Entity Pairs in Knowledge Bases"}]}
