{"paperId": "85cc2347b419f1e824f9cc45eb0da30201dde296", "publicationVenue": {"id": "41ff2886-2e87-4b22-8699-e044ff7fb0c9", "name": "Journal of Computing and Natural Science", "type": "journal", "alternate_names": ["J Comput Nat Sci"], "issn": "2789-181X"}, "title": "Motivation, Definition, Application and the Future of Edge Artificial Intelligence", "abstract": "The term \" Edge Artificial Intelligence (Edge AI)\" refers to the part of a network where data is analysed and aggregated. Dispersed networks, such as those found in the Internet of Things (IoT), have enormous ramifications when it comes to \"Edge AI,\" or \"intelligence at the edge\". Smartphone applications like real-time traffic data and facial recognition data, including semi-autonomous smart devices and automobiles are integrated in this class. Edge AI products include wearable health monitors, security cameras, drones, robots, smart speakers and video games. Edge AI was established due to the marriage of Artificial Intelligence with cutting Edge Computing (EC) systems. Edge Intelligence (EI) is a terminology utilized to define the model learning or the inference processes, which happen at the system edge by employing available computational resources and data from the edge nodes to the end devices under cloud computing paradigm. This paper provides a light on \"Edge AI\" and the elements that contribute to it. In this paper, Edge AI's motivation, definition, applications, and long-term prospects are examined.", "venue": "Journal of Computing and Natural Science", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-07-05", "journal": {"name": "Journal of Computing and Natural Science"}, "authors": [{"authorId": "65902985", "name": "A. Haldorai"}, {"authorId": "2093434336", "name": "Shrinand Anandakumar"}], "citations": [{"paperId": "b108695e9e6063b6a0705fa6e28aa28ce1b4257f", "title": "Transfer Driven Ensemble Learning Approach using ROI Pooling CNN For Enhanced Breast Cancer Diagnosis"}, {"paperId": "39a84e13db2d0525828e977c04ce964a1f5a545e", "title": "Analysis of Conventional Feature Learning Algorithms and Advanced Deep Learning Models"}]}
