{"paperId": "85e4f160c6520472543eff06aab2a4a8932bbeab", "publicationVenue": {"id": "1042faa2-59ed-4755-bc0d-be06dc2e3707", "name": "Electronic library", "type": "journal", "alternate_names": ["Electron Libr", "The Electronic Library", "Electron libr"], "issn": "0264-0473", "url": "https://www.emerald.com/insight/publication/issn/0264-0473", "alternate_urls": ["http://www.emeraldinsight.com/loi/el"]}, "title": "Effects of ASQE-based learning on the information literacy, problem-solving and critical thinking of students with different growth mindsets", "abstract": "\nPurpose\nThis study aims to investigate the information literacy (IL) performance and higher order thinking skills of students with different levels of growth mindset and their perceptions of library-supported learning by using the annotate, summarize, question and evaluate (ASQE)-based learning approach.\n\n\nDesign/methodology/approach\nIn this study, the ASQE-based learning approach was applied to the learning activities to cultivate students’ IL, problem-solving awareness and critical thinking tendency. A total of 60 postgraduate students were invited to participate in this study. In addition, students’ perceptions of library-supported learning were analysed via drawing analysis.\n\n\nFindings\nIntroducing ASQE-based learning into an IL learning activity promoted reflection and thought and had positive effects on students’ problem-solving awareness and on the critical thinking tendency of students with different levels of growth mindset. Additionally, the drawing analysis indicated that most of the students with low levels of growth mindset believed that learners should actively study in the library and students with higher levels of growth mindset preferred more motivating and enjoyable learning environments.\n\n\nOriginality/value\nThe findings of this study demonstrate that the ASQE-based learning approach can improve higher order thinking skills of students with different levels of growth mindset. In addition, this study examined the perceptions of students with different levels of growth mindset of library-supported learning via drawing analysis.\n", "venue": "Electronic library", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-04-28", "journal": {"name": "Electron. Libr.", "pages": "269-290", "volume": "40"}, "authors": [{"authorId": "50557352", "name": "Chenchen Liu"}, {"authorId": "2883439", "name": "Chiu-Lin Lai"}, {"authorId": "144217709", "name": "Gwo-jen Hwang"}, {"authorId": "35656591", "name": "Y. Tu"}], "citations": [{"paperId": "dcb547d1387bb075b5816143eee7f62cedd133e6", "title": "Library instruction and information literacy 2022"}, {"paperId": "b03c1e4b685a76edf7591b7a5a838ecc47b27a36", "title": "Conceptions of the metaverse in higher education: A draw-a-picture analysis and surveys to investigate the perceptions of students with different motivation levels"}, {"paperId": "bf166b4b527cbc6885eba1c42652c0dbea14d333", "title": "Promoting Sustainable Learning in the Post-Pandemic Era: Focused on the Role of Motivation, Growth Mindset, Self-Regulated Learning, Well-Being, and Smart Device Utilization"}]}
