{"paperId": "85f74413ee235d0815817a76ab92665667ff1e7c", "publicationVenue": {"id": "37555ef6-5b69-4ae8-a9b3-f2052c7552a5", "name": "Advances in Multimedia", "alternate_names": ["Adv Multimedia"], "issn": "1687-5680", "url": "https://www.hindawi.com/journals/am/"}, "title": "Intelligent Data Processing and Optimization of University Logistics Combined with Block Chain Storage Algorithm", "abstract": "The traditional Hadoop-based logistic data processing platform of universities cannot fully collect and control remote data in the process of data processing and has defects such as poor efficiency, high error, and difficult query. In existing designs, devices often need to store complete block data. When retrieving or verifying specific data on the chain, a large number of blocks need to be traversed to find the corresponding data, which reduces the response speed on the user side. In addition, the traditional consensus algorithm is not suitable for resource-constrained terminal devices. Therefore, this paper proposes an intelligent data processing and optimization method of university logistics combined with block chain storage algorithm. For unstructured data on the cloud storage network, the storage information can be obtained through domain analysis, and the storage frequency can be dynamically adjusted based on the estimated data flapping. Moreover, a data storage audit scheme is designed on the cloud storage network to improve data storage efficiency. In order to ensure the integrity verification efficiency of unstructured big data cloud storage, a multilayer block chain network model suitable for university logistics data is designed by introducing block chain technology. The throughput and average occupancy under the same conditions in different environments are evaluated and analyzed, and it is verified that the proposed method is not affected by the initial priority distribution and has good stability and optimization performance. The results show that the proposed method can significantly improve the cloud storage efficiency of unstructured data, can effectively respond to a large number of requests to access data, and has good big data processing capability.", "venue": "Advances in Multimedia", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-07-18", "journal": {"name": "Advances in Multimedia"}, "authors": [{"authorId": "2156062352", "name": "Li Li"}], "citations": [{"paperId": "c2faddcad72206da74abbc3008431cda155a1034", "title": "FPGA-based Intelligent Logistics Management for Universities"}, {"paperId": "57a086edd5bd9ae962fa3fa73d54e022ed84618a", "title": "Blockchain Applications in Higher Education: A Systematic Literature Review"}]}
