{"paperId": "8603b743bb101a987421854b78bf2047785ba7d1", "publicationVenue": {"id": "bfc8a599-10ec-4962-8580-cf721254c091", "name": "International Conference on Software, Telecommunications and Computer Networks", "type": "conference", "alternate_names": ["SoftCOM", "Int Conf Softw Telecommun Comput Netw"]}, "title": "Dynamic Optimization of Provider-Based Scheduling for HPC Workloads", "abstract": "The vast array of cloud providers present in today’s market proffer a suite of High-Performance Computing (HPC) services. However, these offerings are characterized by significant variations in execution times and cost structures. Consequently, selecting the optimal cloud provider and configuring the features of the chosen computing instance (e.g. virtual machines) proves to be a challenging task for users intending to execute HPC workloads. This paper introduces a novel component designed for effortless integration with existing HPC scheduling systems. This module’s primary function is to facilitate the selection of the most appropriate cloud provider for each distinct job, thereby empowering dynamic and adaptive cost-minimization strategies. Through the application of data augmentation techniques and the employment of Continuous Machine Learning, the system is endowed with the capability to operate efficiently with cloud providers that have not been previously utilized. Furthermore, it is capable of tracking the evolution of jobs over time. Our results show that this component can achieve consistent economic savings, based on the quality of the data used in the training phase.", "venue": "International Conference on Software, Telecommunications and Computer Networks", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-09-21", "journal": {"name": "2023 International Conference on Software, Telecommunications and Computer Networks (SoftCOM)", "pages": "1-6"}, "authors": [{"authorId": "2243193006", "name": "Jacopo Marino"}, {"authorId": "2240973101", "name": "Fulvio Risso"}, {"authorId": "2243974345", "name": "Mauro Bighi"}], "citations": []}
