{"paperId": "860b873942feab1cc58110e1ea75198297c5cda2", "publicationVenue": {"id": "856cfd79-9870-456a-8476-dff1ad7751ac", "name": "Lahore Garrison University research journal of computer science and information technology", "type": "journal", "alternate_names": ["Lahore Garrison Univ res j comput sci inf technol"], "issn": "2519-7991"}, "title": "A Comparative Analysis on Handling Big Data Using Cloud Services", "abstract": "In this era of technology, a lot of advancements have been done in almost every field such as medical, science, aerospace and other fields. With the increasing advancements in technology, a lot of data is being produced at the same time. For instances in the field of medicine there is a huge amount of data that is being generated as there are hundreds and thousands of patients who came for their checkup. So now the question arises where this huge amount of data is being stored. This huge amount of data is called as Big Data. And the major problem faced is how to manage and organize this huge amount of data along with its security and not being lost. Big data is used for extracting a lot of useful information but it is not easy to organize it. If the data is being lost than there are a lot of problems that can occur on a huge level as a lot of data being stored in big data is very confidential. This data can be stored on cloud which is the new advancement in the field of technology as it is highly reliable for huge amount of information. So, in this survey paper we will discuss about the solutions of organizing and handling big data proposed by different authors.", "venue": "Lahore Garrison University research journal of computer science and information technology", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2021-12-27", "journal": {"name": "Lahore Garrison University Research Journal of Computer Science and Information Technology"}, "authors": [{"authorId": "2151747255", "name": "A. U. Rehman"}, {"authorId": "2058046327", "name": "Sajid Mahmood"}, {"authorId": "2014037949", "name": "Ghulam Mustafa"}, {"authorId": "81460923", "name": "Sumet Mehta"}], "citations": []}
