{"paperId": "860ca3087b399ffef29c9453690b98a52d68fa76", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Offloading of Atomic Tasks in Satellite Networks: A Fast Adaptive Resource Collaboration Method", "abstract": "With the explosive growth of multimedia services and the continuous emergence of new space tasks, the spatial task scheduling timeliness problem is of great concern. The high computational cost of existing task scheduling methods is not suitable for the time-varying scenarios of space-based networks. This paper proposes a scheduling optimization method containing an atomic task offloading model based on maximum flow theory and a dynamic caching model. Firstly, the model calculates the task offloading upper limit in the satellite network based on the maximum flow theory to achieve the maximum volume of offloaded tasks to improve the resource utilization of idle satellites. Then, we design onboard task offloading and buffer optimization algorithms to reduce the request load of single-satellite atomic tasks. The method improves the overall computational performance and timeliness of the satellite network and reduces the waiting time of atomic tasks competing for resources. Finally, we analyze the time complexity of the proposed method and construct a simulation experiment scenario. The performance comparison results with various baseline models show that the proposed method has certain time complexity and task execution timeliness advantages.", "venue": "Applied Sciences", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-03-24", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "72206534", "name": "Huilong Fan"}, {"authorId": "2150717838", "name": "Wei Zhao"}, {"authorId": "47002958", "name": "Yanbing Li"}], "citations": [{"paperId": "19486c9c7b9c33682524130be23eb0c7825cba91", "title": "Autonomous Task Planning Method for Multi-Satellite System Based on a Hybrid Genetic Algorithm"}, {"paperId": "feb430feb1db99f17e8ebc44d5c2caab710fbf89", "title": "Network Simulators for Satellite-Terrestrial Integrated Networks: A Survey"}]}
