{"paperId": "860cfc60a834bcb1e7097f50443aaa700ac0f615", "publicationVenue": null, "title": "Deep Learning Techniques for Emotion Recognition From EEG Signals: Improving Accuracy and Efficiency", "abstract": "Acknowledgment of emotions is One of the major problems with the subject of emotional technology is its significant scientific value and numerous real-world applications. Due to their intrinsic limitations, the single iris ID in the current circumstances has a problem with inadequate accuracy in feeling categorization. This message's content is intended to supply a need for abundant expression-EEG highly changeable fusion emotion identification devices in order to overcome this issue. In order to acquire high-quality EEG signal traits, this strategy leverages the improved emotional data network structure to swiftly extract facial expression features. Artefacts are eliminated from the electroencephalogram (EEG) signal employing a wavelet soft filter approach. The system is then constructed and tested using the electrical feature data gathered via the expression-EEG bimodality method to finish the finished bi-modal melting mood grouping as a detection study. The results of this study depend on both extended and short-memory neural networks and the option-fused technique. The proposed approach is then confirmed with the feelings collection. The recommended model can effectively detect things with a degree of test reliability of 99.87%, according to testing results. Comparing the suggested methodology to the traditional way, the total time for each detection technique will be decreased to around 20 seconds.", "venue": "2023 International Conference on Computational Intelligence, Networks and Security (ICCINS)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-12-22", "journal": {"name": "2023 International Conference on Computational Intelligence, Networks and Security (ICCINS)", "pages": "1-6"}, "authors": [{"authorId": "2290294496", "name": "PriyaDarsini R"}, {"authorId": "2290293013", "name": "Paramasivam C"}], "citations": []}
