{"paperId": "8612f9fc673275729aa28bb88e748d528eae5be8", "publicationVenue": {"id": "8e1bd4b5-d5b2-4e22-ba0a-01fe5568d472", "name": "Remote Sensing", "type": "journal", "alternate_names": ["Remote Sens"], "issn": "2315-4675", "alternate_issns": ["2072-4292"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169233", "alternate_urls": ["https://www.mdpi.com/journal/remotesensing", "http://www.mdpi.com/journal/remotesensing", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169233"]}, "title": "A Hybrid Model Consisting of Supervised and Unsupervised Learning for Landslide Susceptibility Mapping", "abstract": "Landslides cause huge damage to social economy and human beings every year. Landslide susceptibility mapping (LSM) occupies an important position in land use and risk management. This study is to investigate a hybrid model which makes full use of the advantage of supervised learning model (SLM) and unsupervised learning model (ULM). Firstly, ten continuous variables were used to develop a ULM which consisted of factor analysis (FA) and k-means cluster for a preliminary landslide susceptibility map. Secondly, 351 landslides with “1” label were collected and the same number of non-landslide samples with “0” label were selected from the very low susceptibility area in the preliminary map, constituting a new priori condition for a SLM, and thirteen factors were used for the modeling of gradient boosting decision tree (GBDT) which represented for SLM. Finally, the performance of different models was verified using related indexes. The results showed that the performance of the pretreated GBDT model was improved with sensitivity, specificity, accuracy and the area under the curve (AUC) values of 88.60%, 92.59%, 90.60% and 0.976, respectively. It can be concluded that a pretreated model with strong robustness can be constructed by increasing the purity of samples.", "venue": "Remote Sensing", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-04-10", "journal": {"name": "Remote. Sens.", "pages": "1464", "volume": "13"}, "authors": [{"authorId": "2087645493", "name": "Z. Liang"}, {"authorId": "50096702", "name": "Chang-ming Wang"}, {"authorId": "2100417565", "name": "Zhijie Duan"}, {"authorId": "2109527698", "name": "Hailiang Liu"}, {"authorId": "2111038927", "name": "Xiaoyang Liu"}, {"authorId": "40579452", "name": "K. Khan"}], "citations": [{"paperId": "a420ae41bcc6ef0a4c9f83c4b2d7aaa844118ba8", "title": "Review of the Accuracy of Satellite Remote Sensing Techniques in Identifying Coastal Aquaculture Facilities"}, {"paperId": "14090f942a87a1742556f7aab85bf638f723e34f", "title": "Assessment of Landslide Susceptibility Using the PCA and ANFIS with Various Metaheuristic Algorithms"}, {"paperId": "9e62e1263d171c28e40ec5697c6ab68f0fb7a886", "title": "Unified Plasticity Potential of Soils"}, {"paperId": "7b584e1c7a313e14c6f518d3caec7942e3fa14c4", "title": "Exploration and Comparison of the Effect of Conventional and Advanced Modeling Algorithms on Landslide Susceptibility Prediction: A Case Study from Yadong Country, Tibet"}, {"paperId": "b51eb90d395cf65c7989a5cb90936b7c2c73ae7f", "title": "Comparison of optimized data-driven models for landslide susceptibility mapping"}, {"paperId": "d20993920f51792d6bb9d04125f3f0b7fd13f415", "title": "Landslide Susceptibility Mapping and Driving Mechanisms in a Vulnerable Region Based on Multiple Machine Learning Models"}, {"paperId": "87035af88c1ab9a979a0f337b43efa236e45a776", "title": "Landslide Susceptibility Prediction: Improving the Quality of Landslide Samples by Isolation Forests"}, {"paperId": "84be1ee1e0a2ff3d4f54a1479a6f29c596fafcb7", "title": "A DCGAN image generation algorithm based on AE feature extraction"}, {"paperId": "6d667d5b11b789cb59fe37a5e5d71c660948e7a1", "title": "A bibliometric and content analysis of research trends on GIS-based landslide susceptibility from 2001 to 2020"}, {"paperId": "ceec762cb52e0fb8f6e39288d7c39b8f96f20672", "title": "Mapping Landslide Sensitivity Based on Machine Learning: A Case Study in Ankang City, Shaanxi Province, China"}, {"paperId": "678eee707456dae65d151eaf283612996020e849", "title": "Landslide Susceptibility Prediction Considering Neighborhood Characteristics of Landslide Spatial Datasets and Hydrological Slope Units Using Remote Sensing and GIS Technologies"}, {"paperId": "b7fe94ecfac3aa916236d461cd89fc86d5d467fb", "title": "Slope-Unit Scale Landslide Susceptibility Mapping Based on the Random Forest Model in Deep Valley Areas"}, {"paperId": "66bee88a717d9478ad4fd1f6d42f2fa2871a090a", "title": "Landslide Susceptibility Mapping Using Machine Learning: A Literature Survey"}, {"paperId": "77717fc89986540570aaa9e610336e0f1f2e2b5c", "title": "Prediction of spatial landslide susceptibility applying the novel ensembles of CNN, GLM and random forest in the Indian Himalayan region"}, {"paperId": "a0ea48218ce4ebf6cd336fa2ad5a0cd362071fc3", "title": "Multi-hazard spatial modeling via ensembles of machine learning and meta-heuristic techniques"}, {"paperId": "ebf667d18421e2cba41c03950b64855c2880a2e7", "title": "Review of landslide susceptibility assessment based on knowledge mapping"}, {"paperId": "d646da3865923851638579ff04cabb2d8535aec6", "title": "Investigation of steel frame damage based on computer vision and deep learning"}, {"paperId": "5331077086f4bba36d76d8121835e9d4e46c61af", "title": "Landslide and Wildfire Susceptibility Assessment in Southeast Asia Using Ensemble Machine Learning Methods"}, {"paperId": "eb7d022ddfb5bd09db74fb427b1646e9b4aa805a", "title": "How the recursive feature elimination affects the SVM and RF for relative wildfire susceptibility in a certain area? A study case in Northern Iran"}]}
