{"paperId": "86168413f3fc096315883b005621f6212002041f", "publicationVenue": {"id": "10e76a35-58d6-443c-9683-fc16f2dd0a92", "name": "IEEE transactions on multimedia", "type": "journal", "alternate_names": ["IEEE Transactions on Multimedia", "IEEE Trans Multimedia", "IEEE trans multimedia"], "issn": "1520-9210", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=6046"}, "title": "IF-MCA: Importance Factor-Based Multiple Correspondence Analysis for Multimedia Data Analytics", "abstract": "Multimedia concept detection is a challenging topic due to the well-known class imbalance issue, where the data instances are distributed unevenly across different classes. This problem becomes even more prominent when the minority class that contains an extremely small proportion of the data represents the concept of interest as has occurred in many real-world applications such as frauds in banking transactions and goal events in soccer videos. Traditional data mining approaches often have difficulty handling largely skewed data distributions. To address this issue, in this paper, an importance-factor (IF)-based multiple correspondence analysis (MCA) framework is proposed to deal with the imbalanced datasets. Specifically, a hierarchical information gain analysis method, which is inspired by the decision tree algorithm, is presented for critical feature selection and IF assignment. Then, the derived IF is incorporated with the MCA algorithm for effective concept detection and retrieval. The comparison results in video concept detection using the disaster dataset and the soccer dataset demonstrate the effectiveness of the proposed framework.", "venue": "IEEE transactions on multimedia", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-04-01", "journal": {"name": "IEEE Transactions on Multimedia", "pages": "1024-1032", "volume": "20"}, "authors": [{"authorId": "2108776795", "name": "Yimin Yang"}, {"authorId": "1997924", "name": "Samira Pouyanfar"}, {"authorId": "2229900", "name": "Haiman Tian"}, {"authorId": "2108556642", "name": "Min Chen"}, {"authorId": "1705664", "name": "Shu‐Ching Chen"}, {"authorId": "144987531", "name": "Mei-Ling Shyu"}], "citations": [{"paperId": "1c8a3e3fec8fa81cea8e5d26ce8cb5cb59e3b3df", "title": "Simplified Video Surveillance Framework for Dynamic Object Detection under Challenging Environment"}, {"paperId": "15f48e28c77ceb373479e1f17707d6d041530829", "title": "SkeletonNet: A Hybrid Network With a Skeleton-Embedding Process for Multi-View Image Representation Learning"}, {"paperId": "657eae3d3a7f7445ee49edf848739e96205f6758", "title": "Multimodal deep learning based on multiple correspondence analysis for disaster management"}, {"paperId": "d3aba33ac0025d067bc3ed80d2d73ee883a1c2b1", "title": "Multiscale Deep Alternative Neural Network for Large-Scale Video Classification"}, {"paperId": "748e8e23b96665da11b0c6a9e9bae95c70322891", "title": "Multimodal deep representation learning for video classification"}]}
