{"paperId": "8617b86ee2dc2203d03dd47124dc1b991df13e78", "publicationVenue": {"id": "d4610af5-85e0-480b-8773-5c71d92a7b99", "name": "International Conference on Architectural Support for Programming Languages and Operating Systems", "type": "conference", "alternate_names": ["ASPLOS", "Int Conf Archit Support Program Lang Oper Syst", "Archit Support Program Lang Oper Syst", "Architectural Support for Programming Languages and Operating Systems"], "url": "http://www.acm.org/sigplan/"}, "title": "IceBreaker: warming serverless functions better with heterogeneity", "abstract": "Serverless computing, an emerging computing model, relies on \"warming up\" functions prior to its anticipated execution for faster and cost-effective service to users. Unfortunately, warming up functions can be inaccurate and incur prohibitively expensive cost during the warmup period (i.e., keep-alive cost). In this paper, we introduce IceBreaker, a novel technique that reduces the service time and the \"keep-alive\" cost by composing a system with heterogeneous nodes (costly and cheaper). IceBreaker does so by dynamically determining the cost-effective node type to warm up a function based on the function's time-varying probability of the next invocation. By employing heterogeneity, IceBreaker allows for more number of nodes under the same cost budget and hence, keeps more number of functions warm and reduces the wait time during high load. Our real-system evaluation confirms that IceBreaker reduces the overall keep-alive cost by 45% and execution time by 27% using representative serverless applications and industry-grade workload trace. IceBreaker is the first technique to employ and leverage the idea of mixing expensive and cheaper nodes to improve both service time and keep-alive cost for serverless functions -- opening up a new research avenue of serverless computing on heterogeneous servers for researchers and practitioners.", "venue": "International Conference on Architectural Support for Programming Languages and Operating Systems", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2022-02-28", "journal": {"name": "Proceedings of the 27th ACM International Conference on Architectural Support for Programming Languages and Operating Systems"}, "authors": [{"authorId": "15723239", "name": "Rohan Basu Roy"}, {"authorId": "28293642", "name": "Tirthak Patel"}, {"authorId": "34966505", "name": "Devesh Tiwari"}], "citations": [{"paperId": "4daa4472143082c1c9ef6e55a9a4a139378046b8", "title": "Serverless? RISC more!"}, {"paperId": "2a85f343b47f3a54580d9845cc036703bccba67f", "title": "SPES: Towards Optimizing Performance-Resource Trade-Off for Serverless Functions"}, {"paperId": "bd519576e75063a1b249ada944411aba4ade7e32", "title": "PerOS: Personalized Self-Adapting Operating Systems in the Cloud"}, {"paperId": "9fdad4289301e42a2ae644e793c6e201961555e6", "title": "FSD-Inference: Fully Serverless Distributed Inference with Scalable Cloud Communication"}, {"paperId": "413021d23a97a603abdca274949c35bf9da15b90", "title": "Jiagu: Optimizing Serverless Computing Resource Utilization with Harmonized Efficiency and Practicability"}, {"paperId": "b7462464d6929bffd35ff3d3ec2e933417951312", "title": "Cold Start Latency Mitigation Mechanisms in Serverless Computing: Taxonomy, Review, and Future Directions"}, {"paperId": "59877dc00faf12035ebe02ebf71d2a6eeada04fa", "title": "Optimizing serverless computing: A comparative analysis of multi-output regression models for predictive function invocations"}, {"paperId": "bb444b19251784aba6a288a426329afbffd911aa", "title": "StarShip: Mitigating I/O Bottlenecks in Serverless Computing for Scientific Workflows"}, {"paperId": "b582117a278f54acf1e0623ff51bf9a8e21afbc9", "title": "Shabari: Delayed Decision-Making for Faster and Efficient Serverless Functions"}, {"paperId": "1ecdf0add6e2d139c1afc970d427d7b34a8e6cf3", "title": "Online Function Caching in Serverless Edge Computing"}, {"paperId": "0fec41f1a577513e9bb59a5eb85820eb84771acf", "title": "The globus compute dataset: An open function-as-a-service dataset from the edge to the cloud"}, {"paperId": "aded5f10c600756cb6a853bf99e8d4dbf1401397", "title": "Fine-grained accelerator partitioning for Machine Learning and Scientific Computing in Function as a Service Platform"}, {"paperId": "4aef67cc481b5ab9592b79db393ea019fbdd5ff7", "title": "Parrotfish: Parametric Regression for Optimizing Serverless Functions"}, {"paperId": "680bbe3127fcbdbd90a857a39fff50505b8f8809", "title": "AsyFunc: A High-Performance and Resource-Efficient Serverless Inference System via Asymmetric Functions"}, {"paperId": "ec25a1a0561d28cf2fa48de85a65b8d267bad6de", "title": "Memento: Architectural Support for Ephemeral Memory Management in Serverless Environments"}, {"paperId": "286cff915ebe79dbc6b013d70f9e68ac9a71303b", "title": "XFaaS: Hyperscale and Low Cost Serverless Functions at Meta"}, {"paperId": "7c636382a2c1225c66cea78cf5c51c2e9e6ada43", "title": "Understanding the Neglected Cost of Serverless Cluster Management"}, {"paperId": "284478c2dca7226fdb62c8c980716c116ee5b244", "title": "Cross-Edge Orchestration of Serverless Functions with Probabilistic Caching"}, {"paperId": "1f161c7de715d830232d8907db21d839caaef989", "title": "Keep-Alive Caching for the Hawkes process"}, {"paperId": "a35ebea873d9377c6704e3810300835cbf6e0ae9", "title": "ESMA: Towards elevating system happiness in a decentralized serverless edge computing framework"}, {"paperId": "cb2f1c0804456cec62fd7818b5213c4c825b7516", "title": "ProPack: Executing Concurrent Serverless Functions Faster and Cheaper"}, {"paperId": "6602a90aa14e17d8c12c267e5aee04f44b5ab88c", "title": "Ilúvatar: A Fast Control Plane for Serverless Computing"}, {"paperId": "0bf71472e055f6fe7d44fc8228f2a230364147b2", "title": "Latency and resource consumption analysis for serverless edge analytics"}, {"paperId": "d0f789d8327c54b6b8c5c9fd566206b68d5ac42a", "title": "Storm-RTS: Stream Processing with Stable Performance for Multi-Cloud and Cloud-edge"}, {"paperId": "cfaa41867cf453e1ff4fadda2a9f677a2e4422b8", "title": "DFlow: Efficient Dataflow-based Invocation Workflow Execution for Function-as-a-Service"}, {"paperId": "65ab3724346fdea45ff1c21a3074f0423f1ad65b", "title": "MXFaaS: Resource Sharing in Serverless Environments for Parallelism and Efficiency"}, {"paperId": "8344d8b370742ab9f8952233efac492d58db983b", "title": "On Efficient Zygote Container Planning toward Fast Function Startup in Serverless Edge Cloud"}, {"paperId": "f85fde870a1eb9c98c62ded89602e2bd1bab6a86", "title": "S-Cache: Function Caching for Serverless Edge Computing"}, {"paperId": "3101ce811198e24de826c963d39804edfeae6911", "title": "FIRST: Exploiting the Multi-Dimensional Attributes of Functions for Power-Aware Serverless Computing"}, {"paperId": "a127f5f5d041bfad1cba2c0a6599732c2835015a", "title": "Persistent Memory-Aware Scheduling for Serverless Workloads"}, {"paperId": "38fd0b34bb905d5a659f2b7b9c771bb2488e6930", "title": "Hybrid Computing for Interactive Datacenter Applications"}, {"paperId": "f1b8b60d21123aa4d8136b025c66114b3e7d8125", "title": "Flame: A Centralized Cache Controller for Serverless Computing"}, {"paperId": "ff70b57466ca768b2c70bb8459eda4f3f78af4b6", "title": "In-Storage Domain-Specific Acceleration for Serverless Computing"}, {"paperId": "11e09c5f1f8e6d0a3a413102bffc7e2120928d0d", "title": "SpecFaaS: Accelerating Serverless Applications with Speculative Function Execution"}, {"paperId": "9c3b022d391887865f6c52803d2a91235b70b951", "title": "QoS-Aware Resource Management for Multi-phase Serverless Workflows with Aquatope"}, {"paperId": "05ab07f7b7f85769526550bd715d49a83c8e78db", "title": "Graalvisor: Virtualized Polyglot Runtime for Serverless Applications"}, {"paperId": "c24b9ba9fb10def76556ab4b2553f14e30184e7a", "title": "AQUATOPE: QoS-and-Uncertainty-Aware Resource Management for Multi-stage Serverless Workflows"}, {"paperId": "b97babfa49aca733504020e9132d2e17c3dc2a11", "title": "SimLess: simulate serverless workflows and their twins and siblings in federated FaaS"}, {"paperId": "dfa329adfdf3bc21b4503a5237f4a55225a78d35", "title": "DayDream: Executing Dynamic Scientific Workflows on Serverless Platforms with Hot Starts"}, {"paperId": "39d6e833bbbbb9257e7550ecb632333986b83f9a", "title": "SFS: Smart OS Scheduling for Serverless Functions"}, {"paperId": "af2c5ef7d92dac89f05e82ac425484d3b3d1ab64", "title": "OrcBench: A Representative Serverless Benchmark"}, {"paperId": "7a72f6724ebefe212893c6c6854c6c282dc04352", "title": "Bringing Serverless Computing to the HPC Community"}, {"paperId": "c9f749be5327c3515520aa177d6a6599a7ac0879", "title": "Zenix: Efficient Execution of Bulky Serverless Applications"}, {"paperId": "0894814ae9f32ceca0a7dedebd0abcc4891789d2", "title": "UnFaaSener: Latency and Cost Aware Offloading of Functions from Serverless Platforms"}, {"paperId": "028d4c5f2c18938af4d45d0ca121680a9c9ccbcc", "title": "This paper is included in the Proceedings of the 21st USENIX Conference on File and Storage Technologies."}, {"paperId": "6fe337a78c779f3bebdcb2404bd0d8565e1ba5fa", "title": "Taming Serverless Cold Start of Cloud Model Inference with Edge Computing"}, {"paperId": "296ddafcf5b75202046ce1b19272c6d254897d3e", "title": "Resource-Centric Serverless Computing"}, {"paperId": "00878d8bf11e16657a7dab490a7fa856ccf55c38", "title": "Power and Energy-Aware Computing on Heterogeneous Systems (PEACHES) (Dagstuhl Seminar 22341)"}, {"paperId": null, "title": "Help Rather Than Recycle: Alleviating Cold Startup in Serverless Computing Through Inter-Function Container Sharing"}, {"paperId": "d872cd54e6fea60f040c4e280cafb806294cf919", "title": "RainbowCake : Mitigating Cold-starts in Serverless with Layer-wise Container Caching and Sharing"}, {"paperId": "c65ffadf5400131b11e77ea4c2a469e75c60c2fa", "title": "This paper is included in the Proceedings of the 17th USENIX Symposium on Operating Systems Design and Implementation"}, {"paperId": "7717a43059cecc8d40651f83187a77d8cf8089a5", "title": "Pronghorn: Effective Checkpoint Orchestration for Serverless Hot-Starts"}, {"paperId": "2145129c795c7b7b36fb98c7aa3b91ccd2d398b8", "title": "This paper is included in the Proceedings of the 2022 USENIX Annual Technical Conference."}]}
