{"paperId": "862527514e2d4c4c907e10ab9fc6489309477cbb", "publicationVenue": {"id": "e574da12-4e4c-4b78-a203-ae3719c0c4f7", "name": "Annual International Computer Software and Applications Conference", "type": "conference", "alternate_names": ["Comput Softw Appl Conf", "Annu Int Comput Softw Appl Conf", "COMPSAC Work", "Computer Software and Applications Conference", "COMPSAC Workshops", "COMPSAC"], "url": "http://www.wikicfp.com/cfp/program?id=548"}, "title": "A Self-attention Agent of Reinforcement Learning in Continuous Integration Testing", "abstract": "Test case prioritization based on reinforcement learning has been seen as a promising way to achieve continuous integration testing. Agent and reward function are two crucial components of reinforcement learning. During the process of reinforcement learning in continuous integration test case prioritization, the agent decides on the execution order of test cases (actions) for the next integration testing (environment) based on the corresponding test case features (states), aiming to detect errors early by maximizing the reward. Furthermore, having more test case features allows the agent to perceive the environment better, but it also increases computation consumption and brings convergence problems to learning. In this paper, we first propose a multi-feature environment perception for continuous integration test case prioritization. It introduces multiple features based on test case history execution information to solve the agent’s limitation in obtaining environmental information. Additionally, we propose a self-attention agent network structure, which captures relationships between multiple features to prevent the convergence problem of reinforcement learning. An extensive experimental and analytical study was conducted with 15 existing reward functions on 14 industrial data sets. The results show that (1) the proposed multiple features can help the agent to perceive environmental information more comprehensively, and (2) the proposed self-attention agent can process environmental information better to achieve more effective test case prioritization in continuous integration testing.", "venue": "Annual International Computer Software and Applications Conference", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-06-01", "journal": {"name": "2023 IEEE 47th Annual Computers, Software, and Applications Conference (COMPSAC)", "pages": "886-891"}, "authors": [{"authorId": "2226681932", "name": "Bangfu Liu"}, {"authorId": "2205725805", "name": "Zheng Li"}, {"authorId": "2114014020", "name": "Ruilian Zhao"}, {"authorId": "2093090542", "name": "Y. Shang"}], "citations": []}
