{"paperId": "86422321884438547fd2510577aadee7b058c501", "publicationVenue": {"id": "a00fde74-d8df-4613-b825-0fff9f531d3f", "name": "IEEE Transactions on Network and Service Management", "type": "journal", "alternate_names": ["IEEE Trans Netw Serv Manag"], "issn": "1932-4537", "url": "http://ejournals.ebsco.com/direct.asp?JournalID=714200", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4275028", "http://ieeexplore.ieee.org/servlet/opac?punumber=4275028"]}, "title": "Efficient QoS-Aware Spatial Join Processing for Scalable NoSQL Storage Frameworks", "abstract": "Current cloud-enabled NoSQL database frameworks support flexible and scalable storage of huge amounts of data arriving through various and often heterogeneous channels. However, they do not natively provide optimised processing of spatial data, thus making it more difficult to perform accurate data analytics needed in many smart city application scenarios. To improve the performance of spatial data computation in the NoSQL MongoDB storage framework, this article proposes a novel data partitioning method based on dimensionality reduction. The underlying key idea is to reduce a spatial data representation from multi to single dimensionality, by still maintaining its geometrical meaning and by employing a specific geo-encoding scheme, i.e., a geohash string. In particular, the geohash string is used as a sharding key in order to store geometrically-nearby objects into the same chunks (and consequently into the same shard). In addition, as a distinctive feature, we have extended the MongoDB framework with a custom spatial QoS-aware optimizer that exploits our novel partitioning scheme to support two, typically expensive, types of spatial queries with QoS guarantees. Those queries are containment (and consequently top-N) and proximity. The paper also contributes to the existing literature with extensive experimental results about the performance of both our partitioning method and query optimizer; the reported results show that our solutions outperform baselines by orders of magnitude.", "venue": "IEEE Transactions on Network and Service Management", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-06-01", "journal": {"name": "IEEE Transactions on Network and Service Management", "pages": "2437-2449", "volume": "18"}, "authors": [{"authorId": "51980690", "name": "I. M. A. Jawarneh"}, {"authorId": "1740127", "name": "P. Bellavista"}, {"authorId": "144765161", "name": "Antonio Corradi"}, {"authorId": "1748978", "name": "L. Foschini"}, {"authorId": "1713456", "name": "R. Montanari"}], "citations": [{"paperId": "d06767b7fcb61507065066976bc9eb93cfd48088", "title": "SpatialSSJP: QoS-Aware Adaptive Approximate Stream-Static Spatial Join Processor"}, {"paperId": "7424e30c0d6f508c30691d5864a5da9a8c667cd6", "title": "Cost-Effective Approximate Aggregation Queries on Geospatial Big Data"}, {"paperId": "4dc40e5bf500b8bc891d5876ff76ddde78ec9328", "title": "Efficient Generation of Approximate Region-based Geo-maps from Big Geotagged Data"}, {"paperId": "5e5934627ae91bc636734a1ee249a1413f854fa5", "title": "Historiographical Study of the Evolution of the Geocoding Systems with Equiangular Tessellation"}, {"paperId": "613d7ced4243b6df2c4da16a1e4faef1fb4ba12a", "title": "NoSQL Database Modeling and Management: A Systematic Literature Review"}, {"paperId": "34208ab137ad1b29effa0bef760b93a47e42bd2e", "title": "Polygon Simplification for the Efficient Approximate Analytics of Georeferenced Big Data"}, {"paperId": "5a7ed26e8b54b1e3492c17ecaa1d9451d02b05ae", "title": "Efficient Integration of Heterogeneous Mobility-Pollution Big Data for Joint Analytics at Scale with QoS Guarantees"}, {"paperId": "92ce670263547daed18435f264edc20fc73ed89b", "title": "DASTData: a Fog-Cloud model for distributed storage and traceability of IoT data in Smart Cities"}, {"paperId": "3c6be52aa2ffe48896b7bddb3d2ec936b0b87703", "title": "Trajectory visualization based on multi-level spatio-temporal data organization model"}, {"paperId": "797601c1b73acc8d98046281383bb63f80fbb42d", "title": "Improving the Efficiency of the EMS-Based Smart City: A Novel Distributed Framework for Spatial Data"}, {"paperId": "bd563aaffada778cf8712c8f79080cdad7de34ea", "title": "A Trajectory Big Data Storage Model Incorporating Partitioning and Spatio-Temporal Multidimensional Hierarchical Organization"}, {"paperId": "6cfe3f77f08f1e7679e00085a67b29413d99f0c2", "title": "Efficient Geospatial Analytics on Time Series Big Data"}, {"paperId": "bb65087238adf9cbb0eb024b0cfcf88293f546f3", "title": "Efficiently Integrating Mobility and Environment Data for Climate Change Analytics"}, {"paperId": "6a6c2d991aed70a5f2fe342b41a6fe198cef5a66", "title": "QoS-Aware Approximate Query Processing for Smart Cities Spatial Data Streams"}, {"paperId": "89f86a915245043e1ecd7a3c462945fdde171e7b", "title": "A Survey on Deep Learning for Human Mobility"}]}
