{"paperId": "8644027d78a2cebc2050f251d9e80a949089be23", "publicationVenue": {"id": "7b6f2c34-c42a-40fa-b990-8c673c821aab", "name": "JMIR Nursing", "alternate_names": ["JMIR Nurs"], "issn": "2562-7600", "url": "https://nursing.jmir.org/", "alternate_urls": ["https://nursing.jmir.org/issue/archive"]}, "title": "Nurses’ Work Concerns and Disenchantment During the COVID-19 Pandemic: Machine Learning Analysis of Web-Based Discussions", "abstract": "Background Web-based forums provide a space for communities of interest to exchange ideas and experiences. Nurse professionals used these forums during the COVID-19 pandemic to share their experiences and concerns. Objective The objective of this study was to examine the nurse-generated content to capture the evolution of nurses’ work concerns during the COVID-19 pandemic. Methods We analyzed 14,060 posts related to the COVID-19 pandemic from March 2020 to April 2021. The data analysis stage included unsupervised machine learning and thematic qualitative analysis. We used an unsupervised machine learning approach, latent Dirichlet allocation, to identify salient topics in the collected posts. A human-in-the-loop analysis complemented the machine learning approach, categorizing topics into themes and subthemes. We developed insights into nurses’ evolving perspectives based on temporal changes. Results We identified themes for biweekly periods and grouped them into 20 major themes based on the work concern inventory framework. Dominant work concerns varied throughout the study period. A detailed analysis of the patterns in how themes evolved over time enabled us to create narratives of work concerns. Conclusions The analysis demonstrates that professional web-based forums capture nuanced details about nurses’ work concerns and workplace stressors during the COVID-19 pandemic. Monitoring and assessment of web-based discussions could provide useful data for health care organizations to understand how their primary caregivers are affected by external pressures and internal managerial decisions and design more effective responses and planning during crises.", "venue": "JMIR Nursing", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-06-30", "journal": {"name": "JMIR Nursing", "volume": "6"}, "authors": [{"authorId": "11007015", "name": "Haoqiang Jiang"}, {"authorId": "2616045", "name": "A. Castellanos"}, {"authorId": "2089401", "name": "Alfred Castillo"}, {"authorId": "2199574664", "name": "Paulo J Gomes"}, {"authorId": "2116825079", "name": "Juanjuan Li"}, {"authorId": "1699374", "name": "Debra E. VanderMeer"}], "citations": []}
