{"paperId": "86504845c4f0544bfca5a9fbc89f3ae2a3685adb", "publicationVenue": {"id": "fcbcaf18-8ab1-43e1-a973-604bbc7e344e", "name": "Proceedings of the VLDB Endowment", "type": "journal", "alternate_names": ["Proceedings of The Vldb Endowment", "Proc VLDB Endow", "Proc Vldb Endow"], "issn": "2150-8097", "url": "http://dl.acm.org/toc.cfm?id=J1174", "alternate_urls": ["http://portal.acm.org/toc.cfm?CFID=21632689&CFTOKEN=99329904&WantType=Affiliated%20Organizations&coll=ACM&dl=ACM&id=J1174&idx=J1174&part=affil&title=VLDB%20Endowment&type=periodical"]}, "title": "Check Out the Big Brain on BRAD: Simplifying Cloud Data Processing with Learned Automated Data Meshes", "abstract": "\n The last decade of database research has led to the prevalence of specialized systems for different workloads. Consequently, organizations often rely on a combination of specialized systems, organized in a\n Data Mesh.\n Data meshes present significant challenges for system administrators, including picking the right system for each workload, moving data between systems, maintaining consistency, and correctly configuring each system. Many non-expert end users (e.g., data analysts or app developers) either cannot solve their business problems, or suffer from sub-optimal performance or cost due to this complexity. We envision BRAD, a cloud system that automatically integrates and manages data and systems into an instance-optimized data mesh, allowing users to efficiently store and query data under a unified data model (i.e., relational tables) without knowledge of underlying system details. With machine learning, BRAD automatically deduces the strengths and weaknesses of each engine through a combination of offline training and online probing. Then, BRAD uses these insights to route queries to the most suitable (combination of) system(s) for efficient execution. Furthermore, BRAD automates configuration tuning, resource scaling, and data migration across component systems, and makes recommendations for more impactful decisions, such as adding or removing systems. As such, BRAD exemplifies a new class of systems that utilize machine learning and the cloud to make complex data processing more accessible to end users, raising numerous new problems in database systems, machine learning, and the cloud.\n", "venue": "Proceedings of the VLDB Endowment", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-07-01", "journal": {"name": "Proc. VLDB Endow.", "pages": "3293-3301", "volume": "16"}, "authors": [{"authorId": "1746961", "name": "Tim Kraska"}, {"authorId": "2118910354", "name": "Tianyu Li"}, {"authorId": "144478906", "name": "S. Madden"}, {"authorId": "2094294894", "name": "Markos Markakis"}, {"authorId": "1666750692", "name": "Amadou Latyr Ngom"}, {"authorId": "2109685286", "name": "Ziniu Wu"}, {"authorId": "2191212297", "name": "Geoffrey X. Yu"}], "citations": [{"paperId": "aa29d9c773729b22b73800ea11c54591d73486ac", "title": "Hybrid Data Management Architecture for Present Quantum Computing"}, {"paperId": "aba80d2362dff1097af6c5f10e4292e410e3cdc9", "title": "DB-BERT: making database tuning tools “read” the manual"}, {"paperId": "c8c9dd471375ad529e12de0729c0ce271e70b99c", "title": "Serverless State Management Systems"}, {"paperId": "7e22b9221c5ebf24075de864eccaa6ff5ac36e7c", "title": "Optimizing Data Integration Processes with the Support of Machine Learning - Is it really possible?"}]}
