{"paperId": "866140fc8d971dafa8a12885b6739ad61c0224a4", "publicationVenue": null, "title": "Using Distributed Data over HBase in Big Data Analytics Platform for Clinical Services", "abstract": "Big data analytics (BDA) is important to reduce healthcare costs. However, there are many challenges of data aggregation, maintenance, integration, translation, analysis, and security/privacy. The study objective to establish an interactive BDA platform with simulated patient data using open-source software technologies was achieved by construction of a platform framework with Hadoop Distributed File System (HDFS) using HBase (key-value NoSQL database). Distributed data structures were generated from benchmarked hospital-specific metadata of nine billion patient records. At optimized iteration, HDFS ingestion of HFiles to HBase store files revealed sustained availability over hundreds of iterations; however, to complete MapReduce to HBase required a week (for 10 TB) and a month for three billion (30 TB) indexed patient records, respectively. Found inconsistencies of MapReduce limited the capacity to generate and replicate data efficiently. Apache Spark and Drill showed high performance with high usability for technical support but poor usability for clinical services. Hospital system based on patient-centric data was challenging in using HBase, whereby not all data profiles were fully integrated with the complex patient-to-hospital relationships. However, we recommend using HBase to achieve secured patient data while querying entire hospital volumes in a simplified clinical event model across clinical services.", "venue": "Comput. Math. Methods Medicine", "year": 2017, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2017-12-11", "journal": {"name": "Computational and Mathematical Methods in Medicine", "volume": "2017"}, "authors": [{"authorId": "2065410", "name": "D. Chrimes"}, {"authorId": "33856868", "name": "H. Zamani"}], "citations": [{"paperId": "d4626c37e22e6b352e2c76409605482af32586a6", "title": "Digital twin: Data exploration, architecture, implementation and future"}, {"paperId": "372095667472684497488665c50f28fe50e3181c", "title": "Data integration in a Hadoop-based data lake: A bioinformatics case"}, {"paperId": "b7d162a3e4c1be96c25ecb3362fc073b38748f4a", "title": "Transforming healthcare with big data analytics: technologies, techniques and prospects"}, {"paperId": "85328b4a8132bf4299f8cd7f8e79e850d561c8fc", "title": "Big Data Analytics: A Survey"}, {"paperId": "9e572ed3ac75414c460a46312857bb162a45d81b", "title": "Psychosocial Factors and Psychological Characteristics of Personality of Patients with Chronic Diseases Using Artificial Intelligence Data Mining Technology and Wireless Network Cloud Service Platform"}, {"paperId": "f21a76b9d97dabe939a419bc0d4ea8dd8558dfb9", "title": "Application of Big Data and Artificial Intelligence in COVID-19 Prevention, Diagnosis, Treatment and Management Decisions in China"}, {"paperId": "5aaf5839180758b96d231e48f525c33dfe4b9781", "title": "Framework for efficient transformation for complex medical data for improving analytical capability"}, {"paperId": "c18a833f2bd8adb8fb36ecb5d8bf976841bcb8be", "title": "Big Data Applications in Medical Field: A Literature Review"}, {"paperId": "e7dc816080eb05759fbc40a761282944c61654b8", "title": "A Novel Big Data Index Architecture for Programming Environment"}, {"paperId": "a184143861103bfb040ffd64d302e09532afc6a1", "title": "Research on the Secure Medical Big Data Ecosystem Based on Hadoop"}, {"paperId": "ef2afdce9b71657522d743178ab39fb03a394647", "title": "Big data analytics in medical engineering and healthcare: methods, advances and challenges"}, {"paperId": "1ade772f489b4027b3fed3a5869988bc0ea56034", "title": "Desiderata for delivering NLP to accelerate healthcare AI advancement and a Mayo Clinic NLP-as-a-service implementation"}, {"paperId": "fc9d30293860a41108d13200a4196c13b58368a5", "title": "A Novel Template - Based Data Structurization Scheme for Normalizing and Analyzing Medical Data"}, {"paperId": "8523c695886462f1a7904598a9e7034b6b6db70b", "title": "Advancements in Systems Medicine using Big Data Analytics"}, {"paperId": "39878c3fcb4f4b8cca625d772d6f448a71b31001", "title": "A Comparative Study of NoSQL Databases"}, {"paperId": "2c8b7375f2e6e0512eaabb708e3ed0e1bc75ea24", "title": "Refinement of the COHESIVE Information System towards a Unified Ontology of Food Terms for the Public Health Organizations"}, {"paperId": "348ead324704287ae0644c4d0a7779f2dd391c2b", "title": "Exploring Strategies to Integrate Disparate Bioinformatics Datasets"}, {"paperId": "9b38cca280292beeea0e82c760eb11f3632f0231", "title": "Big Data Analytics and Deep Learning in Bioinformatics With Hadoop"}]}
