{"paperId": "8662f9190cd4ce160ce009b473812042fb5cc281", "publicationVenue": {"id": "e574da12-4e4c-4b78-a203-ae3719c0c4f7", "name": "Annual International Computer Software and Applications Conference", "type": "conference", "alternate_names": ["Comput Softw Appl Conf", "Annu Int Comput Softw Appl Conf", "COMPSAC Work", "Computer Software and Applications Conference", "COMPSAC Workshops", "COMPSAC"], "url": "http://www.wikicfp.com/cfp/program?id=548"}, "title": "Weighted Reward for Reinforcement Learning based Test Case Prioritization in Continuous Integration Testing", "abstract": "Test Case Prioritization (TCP) based on the continuous decision of Reinforcement Learning (RL) has achieved a successful application for test cases optimization in Continuous Integration (CI). The reward functions of RL describe how a test case \"ought\" to be executed in next integration, of which the design is usually based on the historical executions of the test case. The Average Percentage of Historical Failure (APHF) had been considered as one of the best reward function which has a strong correlation with the recent failure executions of a test case. However, for a test case with many historical failures but passes in recent cycles, the APHF value may be low. In this paper, two novel reward functions are proposed focusing on the impact of failure position in test case history execution sequence, which are the Average Position Exponential Weight (APEW) reward function and the Average Position Quadratic Weight (APQW) reward function, respectively. Both APEW and APQW carry out weight design of failure position but with different weights. We theoretically prove the issue of the only strong correlation with recent failure executions, and also prove that both proposed reward functions can reflect the quantity of historical failures and the distribution of these failures. Experimental verification on 10 industrial-level data sets show that the proposed reward functions can effectively improve the fault detection capability of test cases.", "venue": "Annual International Computer Software and Applications Conference", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-07-01", "journal": {"name": "2021 IEEE 45th Annual Computers, Software, and Applications Conference (COMPSAC)", "pages": "980-985"}, "authors": [{"authorId": "2108381437", "name": "Guowei Li"}, {"authorId": "2152283242", "name": "Yang Yang"}, {"authorId": "2109667775", "name": "Zhaolin Wu"}, {"authorId": "2130108666", "name": "Tiange Cao"}, {"authorId": "2144385436", "name": "Yong Liu"}, {"authorId": "2146248035", "name": "Zheng Li"}], "citations": [{"paperId": "bbf01ce7fea52987ae096b75328410019e5115a3", "title": "Semantic‐aware two‐phase test case prioritization for continuous integration"}, {"paperId": "3f06dcb2a0a153658dd894adfa8f1a2c5b598012", "title": "Systematic Literature Review on Application of Machine Learning in Continuous Integration"}]}
