{"paperId": "866843cd5d352e3910981e8ea5eb339c6f96f938", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Industrial Big Data and Computational Sustainability: Multi-Method Comparison Driven by High-Dimensional Data for Improving Reliability and Sustainability of Complex Systems", "abstract": "Sustainable development is of great significance. The emerging research on data-driven computational sustainability has become an effective way to solve this problem. This paper presents a fault diagnosis and prediction framework for complex systems based on multi-dimensional data and multi-method comparison, aimed at improving the reliability and sustainability of the system by selecting methods with relatively superior performance. This study took the avionics system in the industrial field as an example. Based on the literature research on typical fault modes and fault diagnosis requirements of avionics systems, three popular high-dimensional data-driven fault diagnosis methods—support vector machine, convolutional neural network, and long- and short-term memory neural network—were comprehensively analyzed and compared. Finally, the actual bearing failure data were used for programming in order to verify and compare various methods and the process of selecting the superior method driven by high-dimensional data was fully demonstrated. We attempt to provide a sustainable development idea that continuously explores multi-method integration and comparison, aimed at improving the calculation efficiency and accuracy of reliability assessments, optimizing system performance, and ultimately achieving the goal of long-term improvement of system reliability and sustainability.", "venue": "Sustainability", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2019-08-22", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "4893241", "name": "Chunting Liu"}, {"authorId": "8063854", "name": "Guozhu Jia"}], "citations": [{"paperId": "8a4ec5b67a16c148e4d2f5680fff6f7bbfbdb084", "title": "Deep learning-based methods in structural reliability analysis: a review"}, {"paperId": "b6be2126bc4cc8ac162232862d4c872f16f96189", "title": "Research on the Fault Diagnosis Method of a Synchronous Condenser Based on the Multi-Scale Zooming Learning Framework"}, {"paperId": "bffd4e4988edfa8edd6364268ae5143457ca0a76", "title": "New and emerging forms of data and technologies: literature and bibliometric review"}, {"paperId": "ffed6e89ff221d0a336bb98507015dea71af5fda", "title": "Review of the state of the art in autonomous artificial intelligence"}, {"paperId": "02ace0f3cd6b1a9d8d3e3fae048cc132e6bddec0", "title": "Super-forecasting the ‘technological singularity’ risks from artificial intelligence"}, {"paperId": "baab1a6da0fcf6733b9f2defc5e2b709198eff4d", "title": "A Qualitative Study on the United States Internet of Energy: A Step Towards Computational Sustainability"}]}
