{"paperId": "86731254b7ff4c11d26820f596f346cfe77527ae", "publicationVenue": {"id": "3416dd37-f45d-40ed-b04e-875fcff8fa2f", "name": "Nutrients", "type": "journal", "issn": "2072-6643", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169249", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169249", "http://www.mdpi.com/journal/nutrients/", "https://www.mdpi.com/journal/nutrients"]}, "title": "Use of Food Services by Consumers in the SARS-CoV-2 Pandemic. How the Eating Habits of Consumers Changed in View of the New Disease Risk Factors?", "abstract": "The SARS-CoV-2 pandemic in 2020–2021 changed the eating habits of people around the world. The aim of this study is to understand the effects of COVID-19 on changing consumers’ eating habits, including their concerns about food service nutrition in case of new disease risk factors. The survey conducted using the computer-assisted web-based interviewing method on a group of 1021 adult respondents in Poland. We collected information about consumer choices and habits related to use of food services during the pandemic. This research found that COVID-19 had an impact on consumers’ use of food services, both on-site and take-away. Using cluster analysis, we identified five main groups of food service consumers. It was found that almost half of the respondent group did not change their diet during the pandemic, 20% of respondents changed their diet to a positive one, and 20% to a diet that was negative. For respondents the most important forms of protection against COVID-19 in catering establishments were hand disinfection (70.3%), table disinfection (70.4%), wearing of masks and visors by staff (68.2%), and the possibility of cashless payments (64.6%). Based on cluster analysis (eight consumer clusters), we stated that majority of respondents did not see any threats to using catering service during the pandemic. Only a small group (8.1%) of respondents were afraid of the possibility of getting sick with COVID-19. This study presented the effects of COVID-19 on consumer eating behavior in catering and their concerns with food services uses. Discovering consumer concerns can reduce risk, increase food safety and improve eating habits.", "venue": "Nutrients", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-08-01", "journal": {"name": "Nutrients", "volume": "13"}, "authors": [{"authorId": "2069188022", "name": "E. Czarniecka-Skubina"}, {"authorId": "92094676", "name": "Marlena Pielak"}, {"authorId": "97706150", "name": "P. Sałek"}, {"authorId": "1403242964", "name": "Artur Głuchowski"}, {"authorId": "1401972728", "name": "J. Kobus‐Cisowska"}, {"authorId": "46380662", "name": "T. Owczarek"}], "citations": [{"paperId": "d4b6949a37966174f3af85526b6f1d654b2bf940", "title": "Changes in eating behaviours and physical activity among primary schoolchildren aged 7-12 during the pandemic in the light of qualitative and quantitative research - Junior-Edu-Żywienie (JEŻ) Project."}, {"paperId": "f048744b9bb2b1e6cdc4e8e9bf67232c49aad94d", "title": "Eating habits and lifestyle behaviors during COVID-19 lockdown: The Lebanese experience"}, {"paperId": "66d911c246194ec94a0828dd065500c3eaf4b54a", "title": "Exploring restaurant and customer needs, barriers, interests, and food choices induced by the COVID-19 pandemic in Tarragona Province (Catalonia, Spain): A cross-sectional study"}, {"paperId": "d30e6f6a4463daeba86a2a68151af1d4eac2507c", "title": "Effects of dietary intake behavior, food supply, nutrition, and health during the COVID-19 outbreak"}, {"paperId": "6f85c822c31f2266941da56242268d4f045915ae", "title": "Socioeconomic impacts of COVID-19 pandemic on foodborne illnesses in the United States"}, {"paperId": "a79920e2f744f63aac6116aa128f7d3e70419f57", "title": "Factors Influencing Online Food Delivery Apps Use During COVID-19 Lockdown among Female College Students in Bangladesh"}, {"paperId": "5f7888cda51b85c128edccaa8ead3bd7216e492b", "title": "Variations in Microstructural and Physicochemical Properties of Soy Wax/Soybean Oil-Derived Oleogels Using Soy Lecithin"}, {"paperId": "998365cf230e2ebad197a4d0dcf0bf64bebf204d", "title": "Determinants for food service market segmentation and contemporary consumers’ behaviours amid the Covid-19 pandemic"}, {"paperId": "123425969815fb243673a189806956ccc9a4b912", "title": "Behavior of Polish Consumers in Relation to Meals Ordered in Food Service Establishments in the Context of Plate Waste"}, {"paperId": "fd1fbeb425e5d63e89d954d54f9c549fc9271fc0", "title": "A Study on the Factors Affecting Customer Satisfaction with Institutional Foodservice during COVID-19"}, {"paperId": "8ae3533c4d76d71a7940df7502693c68c910b450", "title": "Analysis of Food Habits during Pandemic in a Polish Population-Based Sample of Primary School Adolescents: Diet and Activity of Youth during COVID-19 (DAY-19) Study"}, {"paperId": "5221d28eeff926a9888354f28972ed389b5369e3", "title": "Changes in Dietary Patterns and Clinical Health Outcomes in Different Countries during the SARS-CoV-2 Pandemic"}, {"paperId": "7ee39f28104540c644f98146e214413c43ebe3c6", "title": "Ensuring sustainable human resource management during the COVID-19 pandemic: The case of Lithuanian catering organisations"}, {"paperId": "efad2bfa436ed1ed070d829434049c10d224c523", "title": "Analyzing Academic Discourse Evolution on Consumer Behavior and covid-19 Using Topic Modeling"}]}
