{"paperId": "867e823453fd44bee697cdb91b0b4d8d7cc3ca0a", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Investigation on Classification and Cleaning for Visually Self-Intersected Multipart Polygon With One Outer Ring", "abstract": "In the field of cartography and geographic information systems, eliminating self-intersection problems is a key step in improving the reliability and robustness of spatial data representations, especially for the multipart polygon with one outer ring (MPOOR). In traditional studies, self-intersected MPOORs were identified by the topological intersection relationships between the line segments, but during map generalization or map spatial calculations, identifying only topological self-intersections is insufficient. Elements (vertices and line segments) that are topologically separated but have a distance smaller than the minimum visible distance (MVD) on the map also need to be considered to avoid graphic conflicts. The former condition is known as a topological self-intersection (TS), while the latter is known as a cartographic self-intersection (CS). Both the above two cases are called visual self-intersections in this paper, and a method for the classification and cleaning of visually self-intersected MPOORs is proposed. First, four visual self-intersection patterns are distinguished and defined, namely, intersecting, separating, collinear and combined, which are further divided into ten refined patterns that can be identified automatically based on the topological and distance relationships between the vertices and line elements. Second, general displacement and shrinkage algorithms are proposed to clean visually self-intersected MPOORs by taking the conflict regions and the MVD as constraints. Finally, real data from the Second National Land Survey of five counties in Guizhou Province in China are used for validation. The experimental results show that all the TS patterns identified by the Martinez-Llario method were successfully captured by the proposed method, and two TS patterns and four CS patterns were newly identified. Moreover, the proposed method yields more reasonable cleaning results that are not only topologically correct but also morphologically consistent and visually distinguishable.", "venue": "IEEE Access", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "202522-202539", "volume": "8"}, "authors": [{"authorId": "2128670244", "name": "Chengming Li"}, {"authorId": "2008280286", "name": "Man Guo"}, {"authorId": "10418459", "name": "Pengda Wu"}, {"authorId": "46524764", "name": "Yong Yin"}], "citations": []}
