{"paperId": "8681ea04e728439b79750b983194912f07ee5d99", "publicationVenue": null, "title": "Zigbee Wireless Sensor Networks: Performance Study in an Apartment-Based Indoor Environment", "abstract": "Zigbee is a very popular technology for Internet of things (IoT) networks mainly because of its low power consumption and low-cost features. It shares the unlicensed 2.4 GHz Industrial, Scientific, and Medical (ISM) radio band with other wireless networks such as Wi-Fi. Usually, Zigbee and Wi-Fi networks coexist in indoor environments for their respective applications. Hence, the coexistence introduces interference for both types of networks lowering the performance of the networks, but Zigbee suffers more significant performance losses because of its lower transmission power than Wi-Fi. Since the number of IoT devices is increasing at an unprecedented rate due to numerous emerging applications and thus making the indoor environments very populous, the peaceful coexistence between Zigbee and Wi-Fi networks in proximity becomes an important research study. For this purpose, this paper presents a comprehensive performance study of a Zigbee network in the presence of a Wi-Fi interference network in a real-life apartment-based indoor environment where Wi-Fi access points of dense neighbors exist. The experiments were done in a XBee module-based Zigbee network for measuring the received signal strength indicator (RSSI), packet drop rate (PDR), and loopback throughput with and without nearby Wi-Fi traffic introduced on purpose. Various networking parameters such as the operating channels, the distances between Zigbee devices and Wi-Fi devices, the transmit timeout of Zigbee packets, and the transmission power of the Zigbee transmitter have been used in the experiments to study the network performance. Our results show that in the deployment of IoT networks in a smart home, radio interference from neighboring homes would not be an important factor, but serious considerations may need to be taken inside the same home. The experimental observations of this paper can serve as a good reference study for Zigbee network deployments in real indoor environments, particularly when interference sources are present in proximity.", "venue": "J. Comput. Networks Commun.", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-08-05", "journal": {"name": "J. Comput. Networks Commun.", "pages": "2144702:1-2144702:14", "volume": "2022"}, "authors": [{"authorId": "2135286373", "name": "B. Dash"}, {"authorId": "143839372", "name": "Jun Peng"}], "citations": [{"paperId": "7a7d93c8a9870100520f211ce390a791e5b2c92a", "title": "Exploring Radio Frequency-Based UAV Localization\nTechniques: A Comprehensive Review"}, {"paperId": "c2562619bd01de80aa9bec1d72e0d06ba111bd8b", "title": "Zigbee Based Mobile Sensing for Wireless Sensor Networks"}, {"paperId": "e21aeb7eb8fa8aee4d6eae92f29f15baa734f503", "title": "Network Performance Analysis of Smart Grid Communications Over LTE cat-M"}]}
