{"paperId": "8688bf167289c5ad416925e104739b89e0f7d1f3", "publicationVenue": null, "title": "Consistency and Completeness: Rethinking Distributed Stream Processing in Apache Kafka", "abstract": "An increasingly important system requirement for distributed stream processing applications is to provide strong correctness guarantees under unexpected failures and out-of-order data so that its results can be authoritative (not needing complementary batch results). Although existing systems have put a lot of effort into addressing some specific issues, such as consistency and completeness, how to enable users to make flexible and transparent trade-off decisions among correctness, performance, and cost still remains a practical challenge. Specifically, similar mechanisms are usually applied to tackle both consistency and completeness, which can result in unnecessary performance penalties. We present Apache Kafka's core design for stream processing, which relies on its persistent log architecture as the storage and inter-processor communication layers to achieve correctness guarantees. Kafka Streams, a scalable stream processing client library in Apache Kafka, defines the processing logic as read-process-write cycles in which all processing state updates and result outputs are captured as log appends. Idempotent and transactional write protocols are utilized to guarantee exactly-once semantics. Furthermore, revision-based speculative processing is employed to emit results as soon as possible while handling out-of-order data. We also demonstrate how Kafka Streams behaves in practice with large-scale deployments and performance insights exhibiting its flexible and low-overhead trade-offs.", "venue": "SIGMOD Conference", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2021-06-09", "journal": {"name": "Proceedings of the 2021 International Conference on Management of Data"}, "authors": [{"authorId": "1920325", "name": "Guozhang Wang"}, {"authorId": "2146073264", "name": "Lei Chen"}, {"authorId": "2113627906", "name": "Ayusman Dikshit"}, {"authorId": "38526280", "name": "Jason Gustafson"}, {"authorId": "2436255", "name": "Bo-Shoe Chen"}, {"authorId": "46459221", "name": "Matthias Sax"}, {"authorId": "49475500", "name": "J. Roesler"}, {"authorId": "1446050238", "name": "Sophie Blee-Goldman"}, {"authorId": "2923634", "name": "Bruno Cadonna"}, {"authorId": "2114814505", "name": "Apurva Mehta"}, {"authorId": "2113625968", "name": "Varun Madan"}, {"authorId": "144765080", "name": "Jun Rao"}], "citations": [{"paperId": "89e87add8f188fea27767955d3deea851a6f4a29", "title": "ShuffleBench: A Benchmark for Large-Scale Data Shuffling Operations with Distributed Stream Processing Frameworks"}, {"paperId": "a3f024adb39ecfa4fdb098b435545c396e26a112", "title": "Building Advanced Web Applications Using Data Ingestion and Data Processing Tools"}, {"paperId": "73a39f81bc29fd1f9b57969192497d5f840b5dc7", "title": "Efficient topic partitioning of Apache Kafka for high-reliability real-time data streaming applications"}, {"paperId": "600767f7cfaa03c9bbdc1de4c49e9b4c5822e9dd", "title": "Combining fault-tolerant persistence and low-latency streaming access to binary data for AI models"}, {"paperId": "29ce03c64e6a53c95fadca86087b832d01194418", "title": "A Streaming Application for Real-Time Analytics of Seismic Data"}, {"paperId": "85ba041e145806b6a252544d31dd66d5b9b1d153", "title": "RocketHA: A High Availability Design Paradigm for Distributed Log-Based Storage System"}, {"paperId": "db868e1c425c2a94302adc37146b4bb40e38e8d8", "title": "Global Message Ordering using Distributed Kafka Clusters"}, {"paperId": "b4a7c65ae255ffd2acc44c38fa1f3b6d85b12bc9", "title": "StreamOps: Cloud-Native Runtime Management for Streaming Services in ByteDance"}, {"paperId": "16884aa1a953fe5349ed6dc39157fef9cdde4027", "title": "Optimizing Apache Kafka Deployments - Configuration customization is all you need"}, {"paperId": "6abac2248f92c60380793fea61d865b95f79537d", "title": "System Architecture for Real-time Condition Monitoring and Anomaly Detection on Ships"}, {"paperId": "a536c7a149efc0c35e67ccb28946d46389f69031", "title": "DARQ Matter Binds Everything: Performant and Composable Cloud Programming via Resilient Steps"}, {"paperId": "d1099e351f997850a25a1b82309a3945e6296f2a", "title": "What's the Difference? Incremental Processing with Change Queries in Snowflake"}, {"paperId": "9b22fae25c44dbcf5b8b643f780abba073b386cf", "title": "Information management, from Client applications, through TCP / IP Communication on interrupts, in a Multiclient-Server application"}, {"paperId": "5095c3b0c6ac1683b906ea8921ca86341c4748c2", "title": "Memento: A Framework for Detectable Recoverability in Persistent Memory"}, {"paperId": "166f20a55c9770881d5761731d4c2af7ac942bfb", "title": "Towards an Optimized Distributed Message Queue System for AIoT Edge Computing: A Reinforcement Learning Approach"}, {"paperId": "8f876c2a8f9766606fe18272535a728f3c04afc0", "title": "Benchmarking scalability of stream processing frameworks deployed as microservices in the cloud"}, {"paperId": "175f55a642c29af33cf53e6899e9fd4df3270757", "title": "The Evolution of a New Model of Computation"}, {"paperId": "78ee85ac29775aefed350a18500ecfb4c5182dd9", "title": "Distributed real-time ETL architecture for unstructured big data"}, {"paperId": "0fa3a046db190830ea6b334637516f9f371b3de9", "title": "Streaming Platform Implementation in Banking and Financial Systems"}, {"paperId": "6017c63c56c9f20cede1236f79d768bcc21b5e8d", "title": "A configurable method for benchmarking scalability of cloud-native applications"}, {"paperId": "e33de8f18b2dddd7c664ea2fef6baeb87b0819ed", "title": "MicroStream: A Distributed In-memory Caching Service For Data Production"}, {"paperId": "b5a1450444e17ac117ab45b5c30255acb52a8545", "title": "Blockchain for 5G-enabled networks in healthcare service based on several aspects"}, {"paperId": "d42ac2361b1ab529a9f878ba45e9a7895faec424", "title": "On Efficiently Partitioning a Topic in Apache Kafka"}, {"paperId": "0c3820f5fdd981e92fa909d1f298c13e954a329c", "title": "Streaming vs. Functions: A Cost Perspective on Cloud Event Processing"}, {"paperId": "db357091362d5759efc4204fa0705d44ddd131c2", "title": "Practical Detectability for Persistent Lock-Free Data Structures"}, {"paperId": "1b856804b18531bd78fa055d24064b959c5eca1a", "title": "Watermarks in Stream Processing Systems: Semantics and Comparative Analysis of Apache Flink and Google Cloud Dataflow"}, {"paperId": "c8c9dd471375ad529e12de0729c0ce271e70b99c", "title": "Serverless State Management Systems"}, {"paperId": "d01fa90ee9444121aaa3e814e4876598f593cd3f", "title": "Benchmarking scalability of stream processing frameworks deployed as event-driven microservices in the cloud"}, {"paperId": "5ba700e7fafe4e50aa7e272c93e659859ebfa019", "title": "Challenges in Empirically Testing Memory Persistency Models"}]}
