{"paperId": "868d1b1dcc83ce472cb2051307444d315d381afc", "publicationVenue": null, "title": "The Era of Big Spatial Data: Challenges and Opportunities", "abstract": "This seminar describes the state-of-the-art research in the area of big spatial data and it consists of four parts. Part I gives a background about big spatial data and the limitations of traditional systems in handling such data. Part II gives an overview of the four main components that constitute a system for big spatial data, namely, language, indexing, query processing, and visualization. In part III, we delve into the details of each of these four components and describe the recent research efforts in each component while highlighting the open research problems. Finally, part IV wraps up the seminar by describing case studies of systems and end-user applications for big spatial data. This part describes how the four components are implemented in these systems and how they are used in end-user applications.", "venue": "2015 16th IEEE International Conference on Mobile Data Management", "year": 2015, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference", "Review"], "publicationDate": "2015-06-15", "journal": {"name": "2015 16th IEEE International Conference on Mobile Data Management", "pages": "7-10", "volume": "2"}, "authors": [{"authorId": "1876123", "name": "A. Eldawy"}, {"authorId": "1756679", "name": "M. Mokbel"}], "citations": [{"paperId": "57c19b2e76961db9dd03a6cd7b5c4f435a77f449", "title": "Quadtree-Based Adaptive Spatial Decomposition for Range Queries Under Local Differential Privacy"}, {"paperId": "af1a16c213d7637dcace4b843710cfd2b0896cea", "title": "Spatial Computing Opportunities in Biomedical Decision Support: The Atlas-EHR Vision"}, {"paperId": "6427fafde1d38bbd75eb7aaec619f518da0b212d", "title": "GeoBalance: workload-aware partitioning of real-time spatiotemporal data"}, {"paperId": "5792e04759d384971b40f76e50eca83b7f96298d", "title": "State-of-the-Art Applications of Spatial Data Infrastructure in the Provision of e-Government Services in Latin America"}, {"paperId": "022c6df13a30203710f2514b51ac6df074515e63", "title": "Large Spatial Database Indexing with aX-tree"}, {"paperId": "046c6041b8c57bc79780aa0902497082f9fb533b", "title": "A comparison of big remote sensing data processing with Hadoop MapReduce and Spark"}, {"paperId": "40a2287feb202e82634c225675c838d4f8875658", "title": "GeoTrie: A scalable architecture for location-temporal range queries over massive geotagged data sets"}, {"paperId": "3c46f3319533332f7677723730d1511f6cbf4ae9", "title": "Large spatial datasets: Present Challenges, future opportunities"}, {"paperId": "c4fdd5313e0b1b63f5c9a480225240087ee4306b", "title": "Improvement of satellite image classification: Approach based on Hadoop/MapReduce"}, {"paperId": "58225907ac03d27067d6fdec0d0502bf30f1baaf", "title": "Hybrid Concept of NoSQL and Relational Database for GIS Operation"}]}
