{"paperId": "869eabda357332ab7012c5bbb09e699cd391a67e", "publicationVenue": {"id": "1cd505d9-195d-4f99-b91c-169e872644d4", "name": "Energies", "type": "journal", "issn": "1996-1073", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-155563", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-155563", "https://www.mdpi.com/journal/energies", "http://www.mdpi.com/journal/energies"]}, "title": "Faulty Operation of Coils’ and Humidifier Valves in a Typical Air-Handling Unit: Experimental Impact Assessment of Indoor Comfort and Patterns of Operating Parameters under Mediterranean Climatic Conditions", "abstract": "Data-driven Automated Fault Detection and Diagnosis (AFDD) are recognized as one of the most promising options to improve the efficiency of Air-Handling Units (AHUs). In this study, the field operation of a typical single-duct dual-fan constant air volume AHU is investigated through a series of experiments carried out under Mediterranean (southern Italy) climatic conditions considering both fault-free and faulty scenarios. The AHU performances are analyzed while artificially introducing the following five different typical faults: (1) post-heating coil valve stuck at 100% (always open); (2) post-heating coil valve stuck at 0% (always closed); (3) cooling coil valve stuck at 100% (always open); (4) cooling coil valve stuck at 0% (always closed); (5) humidifier valve stuck at 0% (always closed). The measured faulty data are compared against the corresponding fault-free performance measured under the same boundary conditions with the aim of assessing the faults’ impact on both thermal/hygrometric indoor conditions, as well as patterns of 16 different key operating parameters. The results of this study can help building operators and facility engineers in identifying faults’ symptoms in typical AHUs and facilitate the related development of new AFDD tools.", "venue": "Energies", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-09-16", "journal": {"name": "Energies"}, "authors": [{"authorId": "91351364", "name": "A. Rosato"}, {"authorId": "48743096", "name": "F. Guarino"}, {"authorId": "5850245", "name": "Mohammad El Youssef"}, {"authorId": "30566636", "name": "Alfonso Capozzoli"}, {"authorId": "2827423", "name": "M. Masullo"}, {"authorId": "47475366", "name": "L. Maffei"}], "citations": [{"paperId": "a25b1a869f695d31eb697cab60f4ec99531ca19a", "title": "Performance assessment and improvement of district cooling system: A case study of enhancing energy efficiency of hospital buildings"}, {"paperId": "2bd1b291e79ce1d8252c044970b699ca6bc9c92f", "title": "Reduction of electricity consumption in an AHU using mathematical modelling for controller tuning"}]}
