{"paperId": "86db5998c36d529ece67f124de25c5bbbff80aaf", "publicationVenue": null, "title": "Integration of Apache Spark with Invasive Resource Manager", "abstract": "The scheduling of resources on High-Performance Computing systems (HPC) for compute-intensive scientific applications often results in idle nodes at different points in time due to the difference in node requirements for each application. One option to optimize node usage is to assign all idle nodes to data analytics applications. Scientific applications generate data as output which can be used as input for data analytics applications. So it would be beneficial if both types of applications can be run on the same HPC system. The Invasive Resource Manager (IRM) is an extension of the Simple Linux Utility Resource Manager (SLURM) with dynamic resource management and scheduling capabilities on HPC systems and Apache Spark is an open-source cluster computing framework that is widely used for data analytics applications. This project integrates Apache Spark with the IRM so that data analytics applications can be run on HPC systems with dynamic resource allocation. This work also collects performance data from Spark applications and improves the existing scheduling strategy of the IRM. The integrated system is deployed on SuperMUC, the supercomputer at the Leibniz Supercomputing Centre in Germany for testing and evaluation. This project illustrates the design for integrating data analytics on HPC systems with the additional advantage of improving resource utilization. The evaluation shows complete utilization of idle nodes by Spark applications.", "venue": "2019 IEEE SmartWorld, Ubiquitous Intelligence & Computing, Advanced & Trusted Computing, Scalable Computing & Communications, Cloud & Big Data Computing, Internet of People and Smart City Innovation (SmartWorld/SCALCOM/UIC/ATC/CBDCom/IOP/SCI)", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-08-01", "journal": {"name": "2019 IEEE SmartWorld, Ubiquitous Intelligence & Computing, Advanced & Trusted Computing, Scalable Computing & Communications, Cloud & Big Data Computing, Internet of People and Smart City Innovation (SmartWorld/SCALCOM/UIC/ATC/CBDCom/IOP/SCI)", "pages": "1553-1560"}, "authors": [{"authorId": "1629599394", "name": "Jeeta Ann Chacko"}, {"authorId": "3255189", "name": "Isaías A. Comprés Ureña"}, {"authorId": "3240465", "name": "M. Gerndt"}], "citations": []}
