{"paperId": "86dd09314d3c49a45e45e0d5ec1cf8b02e22f170", "publicationVenue": {"id": "fc68e327-d77a-40af-a83f-d9dff851fda4", "name": "Tropical biomedicine", "type": "journal", "alternate_names": ["Trop biomed", "Tropical Biomedicine", "Trop Biomed"], "issn": "0127-5720", "url": "http://msptm.org/journal/"}, "title": "Investigation of chigger mites on small mammals in Ruili, Yunnan Province, China.", "abstract": "Chigger mites are arthropods and are the sole vectors of scrub typhus, and rodents as well as other small mammals are the most common hosts of chigger mite larvae. Therefore, it is of great medical significance to study the ecology of chigger mites. In this study, a detailed analysis of chigger mites was conducted based on field survey data. A total of 4,941 chigger mites were collected from 86 hosts at 34 survey sites in Ruili, Yunnan Province, China. Among the 4,941 chiggers, five genera in one subfamily were identified; Schoengastiella ligula was the dominant chigger species with the highest infestation index, prevalence (Pm, 42.86%) and mean intensity (MI, 59.09%) (P<0.001). The association coefficient (V) between S. ligula and Gahrliepia radiopunctata was positively correlated (P<0.05), indicating the tendency of chiggers to select and coexist on the same host at the same time. The dominant species Leptotrombidium kunmingense, Ascoschoengastia indica, S. ligula and G. radiopunctata showed aggregation distribution patterns, indicating that the distribution of chiggers among different hosts was not uniform. Low altitudes and low latitudes appeared to be more favorable for the growth and reproduction of chigger mites (P<0.05). It is suggested to collect as many host samples as possible in future field investigations to better understand the dynamics of chigger mite populations and their primary hosts.", "venue": "Tropical biomedicine", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-09-01", "journal": {"name": "Tropical biomedicine", "pages": "\n          455-461\n        ", "volume": "39 3"}, "authors": [{"authorId": "2253833613", "name": "Y. Zhou"}, {"authorId": "2253403460", "name": "B. Duan"}, {"authorId": "40603213", "name": "T. Ren"}, {"authorId": "5977358", "name": "W. Dong"}], "citations": [{"paperId": "b18b51e58fbcf7e9372c3d4a2489e39729ec346e", "title": "Species diversity and related ecology of chiggers on small mammals in a unique geographical area of Yunnan Province, southwest China"}]}
