{"paperId": "86e7d81bc9e6eda77e4223d9872c5bd08ec9def2", "publicationVenue": null, "title": "RASQL: A Powerful Language and its System for Big Data Applications", "abstract": "There is a growing interest in supporting advanced Big Data applications on distributed data processing platforms. Most of these systems support SQL or its dialect as the query interface due to its portability and declarative nature. However, current SQL standard cannot effectively express advanced analytical queries due to its limitation in supporting recursive queries. In this demonstration, we show that this problem can be resolved via a simple SQL extension that delivers greater expressive power by allowing aggregates in recursion. To this end, we propose the Recursive-aggregate-SQL (RASQL) language and its system on top of Apache Spark to express and execute complex queries and declarative algorithms in many applications, such as graph search and machine learning. With a variety of examples, we will (i) show how complicated analytic queries can be expressed with RASQL; (ii) illustrate formal semantics of the powerful new constructs; and (iii) present a user-friendly interface to interact with the RASQL system and monitor the query results.", "venue": "SIGMOD Conference", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2020-05-29", "journal": {"name": "Proceedings of the 2020 ACM SIGMOD International Conference on Management of Data"}, "authors": [{"authorId": "2143717242", "name": "Jin Wang"}, {"authorId": "2055961934", "name": "Guorui Xiao"}, {"authorId": "2150059168", "name": "Jiaqi Gu"}, {"authorId": "1720822981", "name": "Jiacheng Wu"}, {"authorId": "1712630", "name": "C. Zaniolo"}], "citations": [{"paperId": "ab7eac8eacf50dcb03a5b4a0776f1a248811826e", "title": "Communication-Avoiding Recursive Aggregation"}, {"paperId": "2b24030b5aa6ad601380ffc3aca63124511df48d", "title": "Bring Your Own Data Structures to Datalog"}, {"paperId": "5b01f1caeef7c93cf01f9d4ebc0af5efd8acc96e", "title": "Optimizing Parallel Recursive Datalog Evaluation on Multicore Machines"}, {"paperId": "495fbff8c27e854426264b9f9a1888e3927f22df", "title": "Demonstration of LogicLib: An Expressive Multi-Language Interface over Scalable Datalog System"}, {"paperId": "893ed788c9ca7b160fba2f3001141a0b70a0b479", "title": "Formal semantics and high performance in declarative machine learning using Datalog"}, {"paperId": "d0614367ae0946c8c420e8a8173395ed2d683de8", "title": "KDDLog:Performance and Scalability in Knowledge Discovery by Declarative Queries with Aggregates"}, {"paperId": "d558f0a3332c47f0f9dd950b87730b8432604e08", "title": "Proceedings 36th International Conference on Logic Programming (Technical Communications)"}, {"paperId": "5ba1e2d13cc12e8ebc27255bcef292347d639e47", "title": "Developing Big-Data Application as Queries: an Aggregate-Based approach"}]}
