{"paperId": "86e734f0ce62247ba373cd70c9468533168207ea", "publicationVenue": {"id": "312ca99c-9149-490d-813e-c60d5e949f65", "name": "Concurrency and Computation", "type": "journal", "alternate_names": ["Concurr Comput Pract Exp", "Concurrency and Computation: Practice and Experience", "Concurr Comput"], "issn": "1532-0626", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/77004395?CRETRY=1&SRETRY=0", "alternate_urls": ["http://www3.interscience.wiley.com/cgi-bin/jtoc?ID=77004395", "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1532-0634"]}, "title": "Popularity and correlation aware data replication strategy based on half‐life concept and clustering in cloud system", "abstract": "In the new millennium, a myriad of large‐scale applications (e.g., social networks, ecommerce, internet of things, and scientific experiments) often generate large volumes of data. Given their volumes, their heterogeneous and distributed nature, the management of such data constitutes a challenge for distributed systems, particularly cloud computing. In this regard, data replication is a well‐known and effective data management technique that consists in creating multiple copies of the same data in different storage resources. In this article, we propose a popularity and correlation based data replication strategy, called PCDR. The main idea of our strategy is to replicate a set of the most popular correlated file groups based on files access history analysis. In this respect, the popularity of the files in each group is determined while taking into consideration temporal locality. Moreover, a clustering technique is used to find groups of correlated files. Using the CloudSim simulator, extensive experimentations show that our proposed strategy outperforms other strategies for several evaluation metrics.", "venue": "Concurrency and Computation", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-12-28", "journal": {"name": "Concurrency and Computation: Practice and Experience", "volume": "33"}, "authors": [{"authorId": "2105343075", "name": "Maawya Chellouf"}, {"authorId": "2904813", "name": "T. Hamrouni"}], "citations": [{"paperId": "b23268234c79cc1d448863d7f3313b93c7594d3a", "title": "Review on data replication strategies in single vs. interconnected cloud systems: Focus on data correlation‐aware strategies"}, {"paperId": "9f33af02bf99e564b481e185c1ce730625044b06", "title": "Optimization assisted frequent pattern mining for data replication in cloud: Combining sealion and grey wolf algorithm"}, {"paperId": "21ade5ffa0391f7a445cc352d9aea5fb26bf05af", "title": "Data correlation and fuzzy inference system-based data replication in federated cloud systems"}]}
