{"paperId": "86f126f4b1d28144c5316342a72a598ea0f4639e", "publicationVenue": null, "title": "Reshaping Banking Industry Through Digital Transformation", "abstract": "Development and breakthrough of information and communication technologies in all spheres and aspects significantly changed the way of conducting business. Digital transformation is not an option for organizations, no matter of their size, industry, maturity, number of employees, customers and so on. In order to survive and stay competitive in digital age, organizations need to be agile, flexible, ready to adjust on rapid changes in the business environment and create new values for customers. Traditional banks recognized all benefits and potentials reflected in usage of new digital technologies. Their focus is shifted on simplification of providing service on anytime in any place to potential customers. Through adoption of Big Data concept and customer-centric approach, banks are among those organizations which widely use new technologies in digital age with the aim to create and sustain competitive advantage. Banking industry is obviously changed and significantly reshaped by digitalization process. In this paper is presented the case of DBS bank from Singapore, which made an extraordinary turnover in its business toward digital transformation and positioned itself as the leading digital bank in the world..", "venue": "Proceedings of the 6th International Scientific Conference - FINIZ 2019", "year": 2019, "fieldsOfStudy": ["Business"], "publicationTypes": ["Conference"], "publicationDate": null, "journal": {"name": "Proceedings of the 6th International Scientific Conference - FINIZ 2019"}, "authors": [{"authorId": "15751158", "name": "Vladimir Mirković"}, {"authorId": "152528655", "name": "J. Lukić"}, {"authorId": "143817947", "name": "Vesna Martin"}, {"authorId": "122072025", "name": "Marija Vujičić"}, {"authorId": "121476675", "name": "Zdenka Dudić"}, {"authorId": "103530163", "name": "B. Dudić"}], "citations": [{"paperId": "e90eb850cbec3759b80e343107a83c590a47c7c5", "title": "Does financial inclusion moderate the effect of digital transformation on banks’ performance in China?"}, {"paperId": "74d788ffe3cf3788dec86c7df4543fe27524da2a", "title": "Makeover of Banks by Digital Interventions and Innovations by Fintechs"}, {"paperId": "3ab654361d6cbfdce45fa5e231bd76b9b16888d4", "title": "Study on the strategic influence of corporate social responsibility in the world's most digitised banks"}, {"paperId": "58bc9939fc6842275c5a7e74804637decc6fd78e", "title": "Digital Transformation Planning Based on Big Data Technology (Case Study: XYZ Bank)"}, {"paperId": "f0573d212f02b2565d5580356f56367b5742fa9d", "title": "Does The Digital Marketing Capability of Indonesian Banks Align with Digital Leadership and Technology Capabilities on Company Performance?"}, {"paperId": "a70ef4ad5e8c00864f5f9eb6f6e474c60a930c4f", "title": "Empirical Evidence of a Changing Operating Cost Structure and Its Impact on Banks’ Operating Profit: The Case of Germany"}, {"paperId": "4b90b1218f4e90c1bee273e9cbc7502322110799", "title": "Digital capabilities and innovation capabilities in Vietnamese SMEs"}]}
