{"paperId": "8708ef3d7b9269f5f1eb2d9953dbf1a8b117f22c", "publicationVenue": {"id": "2f0d2a88-0112-4e04-8883-399ef3c1a9e4", "name": "Journal of Institute of Science and Technology", "type": "journal", "alternate_names": ["J Inst Sci Technol", "Journal of the Institute of Science and Technology"], "issn": "2467-9062", "alternate_issns": ["2146-0574"], "url": "http://dergipark.gov.tr/jist"}, "title": "CBS Tabanlı Melez Makine Öğrenmesi Uygulamalarının Ani Sel Duyarlılık Haritalamasında Kullanımı", "abstract": "Bu çalışmada Kentucky Nehri havzasında son yirmi yılda meydana gelen ani sel baskınları kayıtlarına dayanarak makine öğrenmesi yöntemleri kullanılarak taşkın tehlike haritalamasının yapılması amaçlanmıştır. Tahminlerin gerçekleştirilebilmesi için yaygın olarak kullanılan ve pratik bir algoritma olan rastgele orman (RF) yöntemi kullanılmıştır. Ayrıca, bu yöntemin içsel parametreleri (ağaç sayısı ve maksimum ağaç derinliği) ise parçacık sürü optimizasyonu (PSO) algoritması ile optimize edilmiştir. Bu bağlamda 343 adet geçmiş ani sel kayıtlarına ilaveten havza sınırları içerisinde yer alacak şekilde aynı sayıda rastgele nokta atanmıştır. Tüm bu noktalara 12 adet ani sel tehlikesini tetikleyecek faktörler tanıtılmış olup, tahminler bu doğrultuda gerçekleştirilmiştir. Tahmin sonuçları birçok performans değerlendirme indikatörü göz önüne alınarak analiz edildiğinde melez PSO-RF modelinin test veri setinde oldukça başarılı sonuçlar gösterdiği görülmüştür. Öyle ki hem ani sel olan noktalar hem de ani sel gerçekleşmeyen noktalar %70 oranında doğruluk ile tahmin edilmiştir. Yapılan detaylı değerlendirmeler sonucu ise ikili sınıflandırma problemlerinde önemli bir gösterge olan AUROC değeri ise 0.79 olarak hesaplanmıştır. Ayrıca, ani selleri tetikleyen faktörlerin sonuçlar üzerindeki tekil etkileri incelendiğinde şiddetli yağış faktörü en etkili değişken olarak bulunmuş olup, onu sırasıyla topoğrafya, NDVI ve eğri numarası faktörleri izlemiştir. Öte yandan, litoloji faktörünün ani sellerin modellenmesi üzerindeki etkisi ise diğer faktörlere göre oldukça az olduğu sonucuna varılmıştır. Tüm bu bulgular ışığında elde edilen sonuçlar hem taşkın tehlike haritalaması literatürüne katkı yapacak, hem de ilgili bölgede yaşanacak gelecek ani sel olayları meydana gelmeden alınması gereken tedbirler ile ilgili yol gösterici nitelikte olacaktır.", "venue": "Journal of Institute of Science and Technology", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-01", "journal": {"name": "Journal of the Institute of Science and Technology"}, "authors": [{"authorId": "2272008811", "name": "Ö. Ekmekcioğlu"}], "citations": []}
