{"paperId": "870c1c8341f6e5c9589be7368ec76a80a08f5bcd", "publicationVenue": {"id": "7dc964d5-49e6-4c37-b1c4-a7f0de1fa425", "name": "International Conference on Web and Social Media", "type": "conference", "alternate_names": ["Int Conf Weblogs Soc Media", "International Conference on Weblogs and Social Media", "Int Conf Web Soc Media", "ICWSM"], "url": "http://www.aaai.org/Library/ICWSM/icwsm-library.php"}, "title": "Turning Stocks into Memes: A Dataset for Understanding How Social Communities Can Drive Wall Street", "abstract": "Who actually expresses an intent to buy shares of GameStop Corporation (GME) on Reddit? What convinces people to buy stocks? Are people convinced to support a coordinated plan to adversely impact Wall Street investors? Existing literature on understanding intent has mainly relied on surveys and self-reporting; however there are limitations to these methodologies. Hence, in this paper, we develop an annotated dataset of communications centered on the GameStop phenomenon to analyze the subscriber intention behaviors within the r/WallStreetBets community to buy (or not buy) stocks. Likewise, we curate a dataset to better understand how intent interacts with a user's general support towards the coordinated actions of the community for GameStop. Overall, our dataset can provide insight to social scientists on the persuasive power of social movements online by adopting common language and narrative. WARNING: This paper contains offensive language that commonly appears on Reddit's r/WallStreetBets subreddit.", "venue": "International Conference on Web and Social Media", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-03-16", "journal": {"pages": "1192-1200"}, "authors": [{"authorId": "2158998243", "name": "Richard Alvarez"}, {"authorId": "152575655", "name": "Paras Bhatt"}, {"authorId": "2159185818", "name": "Xingmeng Zhao"}, {"authorId": "26355137", "name": "Anthony Rios"}], "citations": [{"paperId": "9b1f83bed79199a4fe2147a136919b0dc2444941", "title": "Which Came First, Price or Activity? A Vicious Circle of a Blockchain-based Social Media in the Bear Market"}]}
