{"paperId": "873a17dbe1d6174d16b9963c3eafe5de1f461cb1", "publicationVenue": null, "title": "Design an Adaptive Mechanism Model for Supporting the Prevention of SLAs Violation in a Context of COPD Patient Monitoring", "abstract": "During recent decades, contextual computing applications have emerged in the field of healthcare and particularly in the field of telemonitoring of patients suffering from chronic obstructive pulmonary disease (COPD). According to WHO rankings, chronic obstructive pulmonary disease (COPD) is the third leading cause of death worldwide. Various research works are therefore carried out to improve the health of patients and the monitoring of patients in the comfort of their home environment. To this end, several telemonitoring systems are designed to COPD patients. These systems are connected to health center. Emergency physicians follow the patients subscribed to these systems remotely. These systems focus mainly on prediction, decision-making and the requirements of the healthcare profession, and do not address the quality control aspects of services or QoS based on service level agreements (SLAs). This situation can be dangerous for patients in case of extreme exacerbation of COPD patients. For example, the unavailability of the monitoring system can lead to the death of the patient because the emergency physician could not have access to the patient's data in real time in the context of COPD Patient Monitoring. In addition, Remote medical monitoring platforms are manipulating large volumes of data and the risks of data lost or data quality are real. It is therefore important to have the mechanisms to continuously improve the quality of service of these monitoring platforms in general and COPD patients particularly. In this article, we propose an ontology that uses SLA information from COPD monitoring platforms with dynamic data from the patient context. The purpose of this article is to propose a dynamic mechanism model for evaluating SLA violations. This solution allows retrieving knowledge from the main items of the SLA document based on XML and the COPD patient context data dynamically from a COPD SLA ontology. These data retrieved in real time allow the calculation of SLO-based metrics and display a SLA template available on the supplier and consumer interfaces. The information of the SLA violation control Interface changes dynamically depending the context-aware system and SLA document data. The SLA parties can dynamically control their Key Performance Indicators (KPI) Target.", "venue": "", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2020-08-24", "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "51313530", "name": "Konan-Marcelin Kouamé"}, {"authorId": "3138293", "name": "H. Mcheick"}, {"authorId": "40579401", "name": "Hicham Ajami"}], "citations": []}
