{"paperId": "873ed3067e8175b7bba033c6b2bcb300ad9dded1", "publicationVenue": {"id": "20a3a2f3-532a-4f04-9f3d-1e268e100872", "name": "International Journal of Advanced Computer Science and Applications", "type": "journal", "alternate_names": ["Int J Adv Comput Sci Appl"], "issn": "2156-5570", "url": "http://sites.google.com/site/ijacsa2010/", "alternate_urls": ["http://thesai.org/Publication/Default.aspx", "https://thesai.org/Publications/IJACSA"]}, "title": "Exploring the Joint Potential of Blockchain and AI for Securing Internet of Things", "abstract": "—The emergence of the Internet of Things (IoT) has revolutionized the way we interact with the physical world. The rapid growth of IoT devices has led to a pressing need for robust security measures. Two promising approaches that can enhance IoT security are blockchain and artificial intelligence (AI). Blockchain can offer a decentralized and tamper-proof framework, ensuring the confidentiality and integrity of IoT data. AI can analyze large volumes of real-time data and detect anomalies in response to security threats in the IoT ecosystem. This paper explores the potential of these technologies and how they complement each other to provide a secured IoT system. Our main argument is that combining blockchain with AI can provide a robust solution for securing IoT networks and safeguarding the privacy of IoT users. This survey paper aims to provide a comprehensive understanding of the potential of these technologies for securing IoT networks and discuss the challenges and opportunities associated with their integration. It also provides a discussion on the current state of research on this topic and presents future research directions in this area.", "venue": "International Journal of Advanced Computer Science and Applications", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "International Journal of Advanced Computer Science and Applications"}, "authors": [{"authorId": "2138190645", "name": "Mohammed Tauseef"}, {"authorId": "3169998", "name": "Manjunath R. Kounte"}, {"authorId": "31115804", "name": "Abdul Haq Nalband"}, {"authorId": "27554362", "name": "Mohammed Riyaz Ahmed"}], "citations": [{"paperId": "cdcc1114e80fedca4480668f94f89f9c4614ac62", "title": "Blockchain Based Digital Identity Solution"}, {"paperId": "b5e5d08143431ca1559ce7fdcbe0b60249f50148", "title": "Crop Growth Aid and Monitoring System Using Penman Monteith"}]}
