{"paperId": "873e550ba3cbbe72d48c012a03536beaf36743f8", "publicationVenue": {"id": "29df4b17-9a16-4a4c-94a6-002f52e628b4", "name": "International Conference on Parallel Processing", "type": "conference", "alternate_names": ["ICPP", "Int Conf Parallel Process", "IEEE Int Conf Pulsed Power", "IEEE International Conference on Pulsed Power"], "url": "http://www.wikicfp.com/cfp/program?id=1447"}, "title": "DAG-SFC: Minimize the Embedding Cost of SFC with Parallel VNFs", "abstract": "Network Function Virtualization (NFV) is an emerging technology, which enables service agility, flexibility and cost reduction by replacing traditional hardware middleboxes with Virtual Network Functions (VNFs) running on general-purpose servers. Service Function Chain (SFC) constitutes an end-to-end service by organizing a series of VNFs in a specific order. Particularly, hybrid SFC (SFC with parallel VNFs) is proposed to much reduce the traffic delay in sequential SFCs. Nevertheless, how to strategically select VNF instances and links in hybrid SFC embedding remains an open problem. In this paper, we target at the cost minimization and address the optimal hybrid SFC embedding problem. Specifically, we first develop a novel abstraction model for the hybrid SFC with Directed Acyclic Graph (DAG), which helps convert diverse hybrid SFCs to the standardized DAG-SFC form. Then, we formulate the optimal DAG-SFC embedding problem as an integer optimization model and propose a greedy method (called BBE) to solve the NP-hard problem. MBBE method is developed upon BBE method to further cut down the computation complexity in model solving. Extensive simulation results demonstrate the effectiveness of our approach for cost reduction in hybrid SFC embedding.", "venue": "International Conference on Parallel Processing", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2018-08-13", "journal": {"name": "Proceedings of the 47th International Conference on Parallel Processing"}, "authors": [{"authorId": "2120980", "name": "Xu Lin"}, {"authorId": "144233921", "name": "Deke Guo"}, {"authorId": "1885653", "name": "Yulong Shen"}, {"authorId": "1968264", "name": "Guoming Tang"}, {"authorId": "39016718", "name": "Bangbang Ren"}], "citations": [{"paperId": "85fdf21e912b3d55cc30dc72b918601a20df6f82", "title": "Energy efficient and delay aware deployment of parallelized service function chains in NFV-based networks"}, {"paperId": "cc6869df0f126899966d6848db8c4def74274176", "title": "SFT-Box: An Online Approach for Minimizing the Embedding Cost of Multiple Hybrid SFCs"}, {"paperId": "bc7508dea7712179424f36098bc3172dd8a1317f", "title": "NEST: Optimal deploying DAG-SFCs to maximize the flows wholly served in the network edge"}, {"paperId": "8cdd63a58689c8864f1caf1cd612d849190e5af9", "title": "vHSFC: Generic and Agile Verification of Service Function Chain with parallel VNFs"}, {"paperId": "ab9276b62898fed8fb6ea8843050d96f984603ee", "title": "Dynamic SFC placement scheme with parallelized SFCs and reuse of initialized VNFs: An A3C-based DRL approach"}, {"paperId": "3c9ac47fb1958ce347a0985b6d8a5f43fa7aaac4", "title": "Parallel Deployment of VNFs in Service Function Chain: Benefit or Not?"}, {"paperId": "1ccc4cce831dba85aabee14ebc47cd459ebe397a", "title": "Joint Optimization of VNF Placement and Flow Scheduling in Mobile Core Network"}, {"paperId": "f9b2e1eef5c52562de8a3fd1873c7f2fa203bd92", "title": "Resource Reservation for Graph-structured Multimedia Services in Computing Power Network"}, {"paperId": "6f4e1ffe894091369996351659136d80899d673b", "title": "A survey on the placement of virtual network functions"}, {"paperId": "54bd554d324e37202637f90669be23bd57cbf05e", "title": "Towards Optimal Parallelism-Aware Service Chaining and Embedding"}, {"paperId": "706bc09f3a5baa4ab1a688e87229db957b7847d5", "title": "Service function chain composition and placement using grammar‐based genetic algorithm"}, {"paperId": "f84a3007418b24d9a80ad1834c4b3fc611a2c65f", "title": "A containerized task clustering for scheduling workflows to utilize processors and containers on clouds"}, {"paperId": "7c96b333e33a1fc905dcecf52f82e51ea0fc658d", "title": "Quality of service provisioning in network function virtualization: a survey"}, {"paperId": "db9116324068cc2218ee28c9e606a63272382ce4", "title": "Delay-Sensitive Multi-Source Multicast Resource Optimization in NFV-Enabled Networks: A Column Generation Approach"}, {"paperId": "e565f38c78cd7a76f3606ec4ea8b113f63fdc72a", "title": "NFV Resource Allocation: a Systematic Review and Taxonomy of VNF Forwarding Graph Embedding"}, {"paperId": "f019b23a24cc5981af30c0ca6aeec08a6b28e377", "title": "CoDeC: A Cost-Effective and Delay-Aware SFC Deployment"}, {"paperId": "65c0d4a8e740b46879a0c5f32cdf52848f1a98af", "title": "Composing and deploying parallelized service function chains"}, {"paperId": "6db4487424d6bfcf8c68df1c503bad8d0a176db6", "title": "ICN-based Service Function Chaining for Workflows"}, {"paperId": "e37a595d9ae3a81dd8ce5e94b8647055f515feb3", "title": "A Parallel Placement Approach for Service Function Chain Using Deep Reinforcement Learning"}, {"paperId": "147b4452f3989aa7e845840bac4037ae326266d5", "title": "Branching-Aware Service Function Placement and Routing in Network Function Virtualization"}, {"paperId": "d036c6e8d11899b395e1abbf60c41d42ef9a35a7", "title": "Clustering-based Service Function Scheduling Algorithm for Service Function Chaining"}, {"paperId": "04938169966dc0eb238d4ac17eec861b37fe3b31", "title": "Embedding Service Function Tree With Minimum Cost for NFV-Enabled Multicast"}, {"paperId": "96f1d2319f95e586215330d139fba6d04908bf00", "title": "Towards Efficient and Delay-Aware NFV-Enabled Unicasting With Adjustable Service Function Chains"}, {"paperId": "dc0ab800bdcf68fe06e1ad54a5e4875555e3287f", "title": "Service Function Graph Design And Embedding In Next Generation Internet"}]}
