{"paperId": "87482bf8500518fed52600186f44a67d22558bd3", "publicationVenue": {"id": "9ee7345a-5e9f-4002-9880-d6b27d275524", "name": "Transactions on Emerging Telecommunications Technologies", "type": "journal", "alternate_names": ["European Transactions on Telecommunications", "Eur Trans Telecommun", "TETT", "Trans Emerg Telecommun Technol"], "issn": "1120-3862", "alternate_issns": ["2161-3915", "1124-318X"], "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/104087069", "alternate_urls": ["http://eu.wiley.com/WileyCDA/WileyTitle/productCd-ETT.html", "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1541-8251", "https://onlinelibrary.wiley.com/journal/21613915", "https://onlinelibrary.wiley.com/journal/15418251"]}, "title": "A review on workflow scheduling and resource allocation algorithms in distributed mobile clouds", "abstract": "The advent of distributed computing and mobile clouds made it possible to transfer and distribute the heavy processes of complex workflows to the cloud. Managing and with the help of the mobile cloud, virtualization and shared resources managing the executing large-scale workflows is possible. Since virtual resources are used, scheduling and resource allocation are important and key research topics in public cloud environment and mobile clouds. The cloud model of mobile devices with public or virtual cloud, which consists of temporary mobile devices, is an interesting topic to be investigated. Workflow scheduling and availability of resources in mobile clouds by high mobility and Energy efficient, it is one of the challenges and problems that must be investigated one of the main challenges in this research area. The purpose of scheduling algorithms is to improve service quality criteria by observing the constraints. In this article, the main goal is to extensively review the scheduling algorithms for the complex scientific workflow in public and mobile clouds. Furthermore, a review of the use of heuristic and meta-heuristic techniques in dynamic and static states, with various constraints for task scheduling in cloud and mobile computing has been performed. This article accomplishes a review of using existing techniques for scheduling tasks in mobile clouds. We also present a comprehensive analysis and systematic comparison between these scheduling algorithms.", "venue": "Transactions on Emerging Telecommunications Technologies", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-06-19", "journal": {"name": "Trans. Emerg. Telecommun. Technol.", "volume": "34"}, "authors": [{"authorId": "143959986", "name": "Akram Golmohammadi"}, {"authorId": "2028369", "name": "S. R. K. Tabbakh"}, {"authorId": "2506085", "name": "R. Ghaemi"}], "citations": []}
