{"paperId": "874dbf5c0d7133f54ab06e2a7c201f69447a5eb5", "publicationVenue": {"id": "59eaa32d-b026-4d64-beaa-c422bc2629ed", "name": "Small", "type": "journal", "issn": "1613-6810", "url": "http://www.small-journal.com/", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/16136829", "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1613-6829"]}, "title": "Electrospun Cellulose Nanocrystals Reinforced Flexible Sensing Paper for Triboelectric Energy Harvesting and Dynamic Self-Powered Tactile Perception.", "abstract": "The technical synergy between flexible sensing paper and triboelectric nanogenerator (TENG) in the next stage of artificial intelligence Internet of Things engineering makes the development of intelligent sensing paper with triboelectric function very attractive. Therefore, it is extremely urgent to explore functional papers that are more suitable for triboelectric sensing. Here, a cellulose nanocrystals (CNCs) reinforced PVDF hybrid paper (CPHP) is developed by electrospinning technology. Benefitting from the unique effects of CNCs, CPHP forms a solid cross-linked network among fibers and obtains a high-strength (25 MPa) paper-like state and high surface roughness. Meanwhile, CNCs also improve the triboelectrification effect of CPHP by assisting the PVDF matrix to form more electroactive phases (96% share) and a higher relative permittivity (17.9). The CPHP-based TENG with single electrode configuration demonstrates good output performance (open-circuit voltage of 116 V, short-circuit current of 2.2 µA and power density of 91 mW m-2 ) and ultrahigh pressure-sensitivity response (3.95 mV Pa-1 ), which endows CPHP with reliable power supply and sensing capability. More importantly, the CPHP-based flexible self-powered tactile sensor with TENG array exhibits multifunctional applications in imitation Morse code compilation, tactile track recognition, and game character control, showing great prospects in the intelligent inductive device and human-machine interaction.", "venue": "Small", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-05", "journal": {"name": "Small", "pages": "\n          e2307810\n        "}, "authors": [{"authorId": "2120512449", "name": "Zhaoxuan Niu"}, {"authorId": "2240267165", "name": "Qingxiang Wang"}, {"authorId": "2727090", "name": "Jiqing Lu"}, {"authorId": "2149297025", "name": "Yi Hu"}, {"authorId": "2270684690", "name": "Jiaqi Huang"}, {"authorId": "2258808412", "name": "Wei Zhao"}, {"authorId": "2269832854", "name": "Yanju Liu"}, {"authorId": "2266737513", "name": "Yun-Ze Long"}, {"authorId": "2269933964", "name": "Guangping Han"}], "citations": []}
