{"paperId": "876fc45721d562653fd67fd2bf2f9ef29c8b6efd", "publicationVenue": {"id": "1180127d-c41e-49e3-8369-202f0e78a719", "name": "Jurnal Penelitian dan Pengembangan Pendidikan", "alternate_names": ["J Penelit dan Pengemb Pendidik"], "issn": "1979-7109", "url": "https://ejournal.undiksha.ac.id/index.php/JJL"}, "title": "Evaluasi Kurikulum Program Sarjana Sistem Komputer Menggunakan Model CIPP Stufflebeam", "abstract": "Kurikulum yang telah diterapkan pada suatu periode tertentu perlu dilakukan evaluasi untuk memonitoring dan menganalisis ketercapaian suatu program apakah terlaksana sesuai tujuan atau perlu dilakukan perbaikan. Penelitian ini bertujuan mengevaluasi kurikulum program studi sistem komputer yang dikembangkan oleh sivitas akademika Institut Bisnis dan Teknologi Indonesia. Penelitian ini memakai metode kualitatif dengan mengimplementasikan evaluasi CIPP Stufflebeam. Pendekatan implementasi evaluasi CIPP menggunakan analisis komparatif dengan membandingkan indikator kurikulum dengan standar nasional. Pengumpulan data didapatkan melalui wawancara pihak terkait dan analisis dokumen. Subjek pada penelitian ini adalah bidang akademik, koordinator program studi dan dosen sistem komputer yang semuanya berjumlah 30 responden. Simpulan yang dapat dijabarkan bahwa evaluasi kurikulum program studi sistem komputer masuk pada kategori sangat efektif. Pencapaian ini dikarenakan program studi sudah melakukan monitoring secara berkala terkait indikator pencapaian dari suatu kurikulum. Evaluasi pada setiap indikator-indikator di dalam kurikulum sistem komputer sudah memiliki target yang di evaluasi setiap semester, sehingga standar-standar yang dicanangkan oleh pemerintah pusat sudah dilaksanakan sangat efektif. Implikasi dari penelitian ini bahwa hasil evaluasi ini memberikan gambaran secara komprehensif terkait kurikulum yang telah berjalan, sehingga dapat digunakan sebagai acuan pengembangan kurikulum selanjutnya.", "venue": "Jurnal Penelitian dan Pengembangan Pendidikan", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-10-31", "journal": {"name": "Jurnal Penelitian dan Pengembangan Pendidikan"}, "authors": [{"authorId": "72607029", "name": "A. A. G. Ekayana"}, {"authorId": "98190105", "name": "I. G. Ratnaya"}], "citations": [{"paperId": "57f76950d766e3f95ab4e0bee0da8c6974789ae0", "title": "EVALUASI KURIKULUM MERDEKA MENGGUNAKAN MODEL CIPP PADA SEKOLAH DASAR"}, {"paperId": "1b1545128ae5d347958319eb78af7c2f71478849", "title": "Evaluasi pelaksanaan perkuliahan Dasar Industri 4.0 di Program Studi Teknik Kimia PTKI Medan"}, {"paperId": "217a9c32550bd6e334481ddf6792d8699179e8a2", "title": "Evaluation of the Implementation of Independent Learning-Independent Campus (MBKM) Curriculum by Using the CIPP Evaluation Model"}]}
