{"paperId": "87774347413df332e80efaed262929efa26ee6ae", "publicationVenue": {"id": "d03a5bfe-db75-4dc9-95f3-ae92b081f42c", "name": "International Conference on Utility and Cloud Computing", "type": "conference", "alternate_names": ["IEEE/ACM Int Conf Util Cloud Comput", "Utility and Cloud Computing", "Int Conf Util Cloud Comput", "Util Cloud Comput", "UCC", "IEEE/ACM International Conference Utility and Cloud Computing"]}, "title": "Confluence: Adaptive Spatiotemporal Data Integration Using Distributed Query Relaxation over Heterogeneous Observational Datasets", "abstract": "Combining data from disparate sources enhances the opportunity to explore different aspects of the phenomena under consideration. However, there are several challenges in doing so effectively that include, inter alia, the heterogeneity in data representation and format, collection patterns, and integration of foreign data attributes in a ready-to-use condition. In this study, we have designed a scalable query-oriented distributed data integration framework, Confluence, that also dynamically generates accurate interpolations for the targeted spatiotemporal scopes along with an estimate of the uncertainty involved with such estimation in case of spatiotemporal misalignment of datapoints. Confluence efficiently orchestrates computations to evaluate spatiotemporal query joins and facilitates distributed query evaluations with a dynamic relaxation of query constraints. Query evaluations are locality-aware and we leverage model-based dynamic parameter selection to provide accurate estimation for data points. We have included empirical benchmarks that profile our system in terms of accuracy, latency, and throughput at scale and also demonstrate its improvement in performance in a distributed cloud computing environment over GeoMesa, a Spark-based geospatial analytics framework.", "venue": "International Conference on Utility and Cloud Computing", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2018-12-01", "journal": {"name": "2018 IEEE/ACM 11th International Conference on Utility and Cloud Computing (UCC)", "pages": "184-193"}, "authors": [{"authorId": "50298753", "name": "Saptashwa Mitra"}, {"authorId": "145069202", "name": "S. Pallickara"}], "citations": [{"paperId": "3df9947eaab7258c97e848bafdbf048990d3d919", "title": "Query relaxation of fuzzy spatiotemporal RDF data"}, {"paperId": "038a106387c8074d4e01d540d9f994bba22e2522", "title": "Adaptive query relaxation and top‐k result sorting of fuzzy spatiotemporal data based on XML"}]}
