{"paperId": "877d0bb86f6935825953f7f0ba2e8f80a4f67d54", "publicationVenue": {"id": "07ba6a02-fa13-4c5f-b428-795730d75e53", "name": "Big Data", "type": "conference", "alternate_names": ["Int Conf Big Data", "International Conference on Big Data"], "issn": "2167-6461", "url": "http://www.liebertonline.com/", "alternate_urls": ["https://home.liebertpub.com/publications/big-data/611/overview"]}, "title": "Automated Natural Language Processing-Based Supplier Discovery for Financial Services.", "abstract": "Public procurement is viewed as a major market force that can be used to promote innovation and drive small and medium-sized enterprises growth. In such cases, procurement system design relies on intermediates that provide vertical linkages between suppliers and providers of innovative services and products. In this work we propose an innovative methodology for decision support in the process of supplier discovery, which precedes the final supplier selection. We focus on data gathered from community-based sources such as Reddit and Wikidata and avoid any use of historical open procurement datasets to identify small and medium sized suppliers of innovative products and services that own very little market shares. We look into a real-world procurement case study from the financial sector focusing on the Financial and Market Data offering and develop an interactive web-based support tool to address certain requirements of the Italian central bank. We demonstrate how a suitable selection of natural language processing models, such as a part-of-speech tagger and a word-embedding model, in combination with a novel named-entity-disambiguation algorithm, can efficiently analyze huge quantity of textual data, increasing the probability of a full coverage of the market.", "venue": "Big Data", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-07-07", "journal": {"name": "Big data"}, "authors": [{"authorId": "2221215278", "name": "Mauro Papa"}, {"authorId": "2221215489", "name": "Ioannis Chatzigiannakis"}, {"authorId": "9602006", "name": "A. Anagnostopoulos"}], "citations": []}
