{"paperId": "878d8495a5d1dae6113a2149f157bea060c1e0e5", "publicationVenue": {"id": "8270cfe1-3713-4325-a7bd-c6a87eed889e", "name": "Entropy", "type": "journal", "issn": "1099-4300", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-155606", "alternate_urls": ["http://www.mdpi.com/journal/entropy/", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-155606", "https://www.mdpi.com/journal/entropy"]}, "title": "Sentiment Classification Method Based on Blending of Emoticons and Short Texts", "abstract": "With the development of Internet technology, short texts have gradually become the main medium for people to obtain information and communicate. Short text reduces the threshold of information production and reading by virtue of its short length, which is in line with the trend of fragmented reading in the context of the current fast-paced life. In addition, short texts contain emojis to make the communication immersive. However, short-text content means it contains relatively little information, which is not conducive to the analysis of sentiment characteristics. Therefore, this paper proposes a sentiment classification method based on the blending of emoticons and short-text content. Emoticons and short-text content are transformed into vectors, and the corresponding word vector and emoticon vector are connected into a sentencing matrix in turn. The sentence matrix is input into a convolution neural network classification model for classification. The results indicate that, compared with existing methods, the proposed method improves the accuracy of analysis.", "venue": "Entropy", "year": 2022, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-03-01", "journal": {"name": "Entropy", "volume": "24"}, "authors": [{"authorId": "1982002802", "name": "Haochen Zou"}, {"authorId": "2066495582", "name": "Kun Xiang"}], "citations": [{"paperId": "397600f663503e2511df7824a185a669bf58d0dd", "title": "Emoticons Unveiled: A Multifaceted Analysis of Their Linguistic Impact"}, {"paperId": "4dd299e12418f15639df5523987737d1fcdb148f", "title": "Textual emotion analysis using improved metaheuristics with deep learning model for intelligent systems"}, {"paperId": "e0fa7bd141d4375ccfd85420a2a0c43dbf0bed37", "title": "Position-Wise Gated Res2Net-Based Convolutional Network with Selective Fusing for Sentiment Analysis"}, {"paperId": "05fe734705dcaf8df1e85c5ff19de34b139bccba", "title": "How do consumers react to chatbots' humorous emojis in service failures"}, {"paperId": "b330ef6dd2a7dfa3c8b1f338aa63e131e872e224", "title": "An Approach to Disambiguate the Innate Sense of a Message with the Help of Emoji"}, {"paperId": "4217b0dc87b549c3fa1f077312e247478f80ad4a", "title": "Sentiment Analysis Model using Text and Emoticons for Pharmaceutical & Healthcare Industries"}, {"paperId": "46e832123f28e69b29fb175b96562f85a9c7b742", "title": "A Novel Rigorous Measurement Model for Big Data Quality Characteristics"}, {"paperId": "2b681156e7ba0eb6001a96e6e374a7d111b372ae", "title": "Research on Aspect-Level Sentiment Analysis Based on Text Comments"}, {"paperId": "50ca74e713ade4de05138240dbb250ce384109a8", "title": "Lexicon-Enhanced Multi-Task Convolutional Neural Network for Emotion Distribution Learning"}]}
