{"paperId": "8792bdc6f3dfebe253e44a920a15e2844c65a5af", "publicationVenue": {"id": "74327c3b-deba-44e5-994a-7f270981af06", "name": "IET Blockchain", "type": "journal", "issn": "2634-1573", "url": "https://ietresearch.onlinelibrary.wiley.com/journal/26341573"}, "title": "An efficient secure predictive demand forecasting system using Ethereum virtual machine", "abstract": "Predictive demand forecasting plays a pivotal role in optimizing supply chain management, enabling businesses to effectively allocate resources and minimize operational inefficiencies. This paper introduces a novel approach to enhancing demand forecasting processes by leveraging the Ethereum virtual machine within a blockchain framework. The proposed system capitalizes on the inherent security, transparency, and decentralized nature of blockchain technology to create a secure and efficient platform for predictive demand forecasting. The system leverages the Ethereum virtual machine to establish a secure, decentralized, and tamper‐resistant platform for demand prediction while ensuring data integrity and privacy. By utilizing the capabilities of smart contracts and decentralized applications within the Ethereum ecosystem, the proposed system offers an efficient and transparent solution for demand forecasting challenges. The current research focused on Ethereum virtual machine characteristics, features, components, and implementation details. A secured framework for the prediction of demand forecasting systems is proposed. Finally, the authors tried to validate and optimize the gas cost by using distinguished statistics and analysis.", "venue": "IET Blockchain", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-02-26", "journal": {"name": "IET Blockchain"}, "authors": [{"authorId": "2244351468", "name": "Himani Saraswat"}, {"authorId": "2244345945", "name": "Mahesh Manchanda"}, {"authorId": "2244345643", "name": "Sanjay Jasola"}], "citations": []}
