{"paperId": "87a756a3109c405ca2ae70f514d6bf020c016c59", "publicationVenue": {"id": "8e1bd4b5-d5b2-4e22-ba0a-01fe5568d472", "name": "Remote Sensing", "type": "journal", "alternate_names": ["Remote Sens"], "issn": "2315-4675", "alternate_issns": ["2072-4292"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169233", "alternate_urls": ["https://www.mdpi.com/journal/remotesensing", "http://www.mdpi.com/journal/remotesensing", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169233"]}, "title": "Automatic Mapping of Potential Landslides Using Satellite Multitemporal Interferometry", "abstract": "Mapping potential landslides is crucial to mitigating and preventing landslide disasters and understanding mountain landscape evolution. However, the existing methods to map and demonstrate potential landslides in mountainous regions are challenging to use and inefficient. Therefore, herein, we propose a method using hot spot analysis and convolutional neural networks to map potential landslides in mountainous areas at a regional scale based on ground deformation detection using multitemporal interferometry synthetic aperture radar. Ground deformations were detected by processing 76 images acquired from the descending and ascending orbits of the Sentinel-1A satellite. In total, 606 slopes with large ground deformations were automatically detected using hot spot analysis in the study area, and the extraction accuracy rate and the missing rate are 71.02% and 7.89%, respectively. Subsequently, based on the high-deformation areas and potential landslide conditioning factors, we compared the performance of convolutional neural networks with the random forest algorithm and constructed a classification model with the area under the curve (AUC), accuracy, recall, and precision for testing being 0.75, 0.75, 0.82, and 0.75, respectively. Our approach underpins the ability of interferometric synthetic aperture radar (InSAR) to map potential landslides regionally and provide a scientific foundation for landslide risk management. It also enables an accurate and efficient identification of potential landslides within a short period and under extremely hazardous conditions.", "venue": "Remote Sensing", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-10-13", "journal": {"name": "Remote. Sens.", "pages": "4951", "volume": "15"}, "authors": [{"authorId": "2153910623", "name": "Yi Zhang"}, {"authorId": "2143132876", "name": "Yuanxi Li"}, {"authorId": "21661654", "name": "Xing-min Meng"}, {"authorId": "2116007792", "name": "Wangcai Liu"}, {"authorId": "2152659363", "name": "Ai-Jun Wang"}, {"authorId": "2258528069", "name": "Yiwen Liang"}, {"authorId": "2087722595", "name": "Xiaojun Su"}, {"authorId": "37280774", "name": "R. Zeng"}, {"authorId": "2258445637", "name": "Xu Chen"}], "citations": []}
