{"paperId": "87a90b8b454555e65c7951522c4babd17aac0e61", "publicationVenue": {"id": "c2b4e337-68da-4de9-94da-10f746446703", "name": "Business Informatics", "type": "journal", "alternate_names": ["Business informatics", "Bus Informatics", "Bus informatics"], "issn": "1998-0663", "alternate_issns": ["2587-814X"], "url": "https://bijournal.hse.ru/", "alternate_urls": ["https://bijournal.hse.ru/en/"]}, "title": "The present and future of the digital transformation of real estate: A systematic review of smart real estate", "abstract": "The contribution of the real estate industry to the global and regional economy is remarkable, yet in today’s evolving digital technology and digital economy, the digital transformation of the real estate industry is lagging behind other industries. This is, on the one hand, due to the solidified processes and systems linked to the upstream and downstream real estate industries, and, on the other hand, due to the fact that digital technology disrupts traditional ways of doing business, making the industry full of uncertainty. The digital transformation of the real estate industry is a broad and emerging concept. Various related research fields are concerned with the penetration and application of different innovative technologies to the industry. This study provides a systematic review focusing on the field of smart real estate using the bibliometric analysis approach under the guidance of PRISMA. The bibliometric analyses were performed in RStudio by utilizing 22 scientific documents indexed in Scopus and Web of Science that were published from 2012 to 2022. The findings suggest that: (i) smart real estate research is still a new but rapidly emerging field; (ii) only limited academic institutions from a few countries, such as the University of New South Wales in Australia, have shown significant contributions; (iii) the research exhibits specific collaborative network characteristics, leading to a high concentration of authors and citations; and (iv) data-driven topics such as “machine learning,” “information management,” “data analytics” and “big data” indicate a high degree of research density and centrality.", "venue": "Business Informatics", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-06-30", "journal": {"name": "Business Informatics"}, "authors": [{"authorId": "1799463962", "name": "Feng Wang"}], "citations": [{"paperId": "ea1e409afbfd38f0c50abbcd20031539e21d9f3f", "title": "Exploring the Nexus of Eco-Innovation and Sustainable Development: A Bibliometric Review and Analysis"}]}
