{"paperId": "87b298c52cb81462149d13b65f5393dcb8277616", "publicationVenue": {"id": "d5ed89e9-e3b2-4ecd-8f8c-0db2459fcc70", "name": "Collective Intelligence", "alternate_names": ["Collect Intell"], "issn": "2633-9137"}, "title": "A Survey on Social-Physical Sensing", "abstract": "Propelled by the omnipresence of versatile data capture, communication, and computing technologies, physical sensing has revolutionized the avenue for decisively interpreting the real world. However, various limitations hinder physical sensing’s effectiveness in critical scenarios such as disaster response and urban anomaly detection. Meanwhile, social sensing is contriving as a pervasive sensing paradigm leveraging observations from human participants equipped with portable devices and ubiquitous Internet connectivity to perceive the environment. Despite its virtues, social sensing also inherently suffers from a few drawbacks (e.g., inconsistent reliability and uncertain data provenance). Motivated by the complementary strengths of the two sensing modes, social-physical sensing (SPS) is protruding as an emerging sensing paradigm that explores the collective intelligence of humans and machines to reconstruct the “state of the world,” both physically and socially. While a good number of interesting SPS applications have been studied, several critical unsolved challenges still exist in SPS. In this paper, we provide a comprehensive survey of SPS, emphasizing its definition, key enablers, state-of-the-art applications, potential research challenges, and roadmap for future work. This paper intends to bridge the knowledge gap of existing sensing-focused survey papers by thoroughly examining the various aspects of SPS crucial for building potent SPS systems.", "venue": "Collective Intelligence", "year": 2021, "fieldsOfStudy": ["Computer Science", "Engineering", "Mathematics"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-04-03", "journal": {"name": "ArXiv", "volume": "abs/2104.01360"}, "authors": [{"authorId": "34914861", "name": "Md. Tahmid Rashid"}, {"authorId": "2112076776", "name": "Na Wei"}, {"authorId": "2152692296", "name": "Dong Wang"}], "citations": [{"paperId": "4ace15b4f9335d2dd6a843564372a9d4a4091de5", "title": "Multi-sensor integration management in the earth observation sensor web: State-of-the-art and research challenges"}, {"paperId": "25a12449ae204dfb86aff1318c9c1433fc8d0423", "title": "Secure Vote: AI-powered Fingerprint Authentication for Next-Generation Online Voting"}, {"paperId": "0cb22e9fa6c7c7be157d7badd554adb8ee4d9fc1", "title": "Transforming Healthcare through AI: Unleashing the Power of Personalized Medicine"}, {"paperId": "a4eac6393455be79c11704108102eb221c36f426", "title": "The Future of Medicine: Harnessing the Power of AI for Revolutionizing Healthcare"}]}
