{"paperId": "87bf9ec345dd5cee04608aa122b30bf61512601b", "publicationVenue": {"id": "c0ec137d-a370-425d-9cf0-766fd7f536dd", "name": "Journal of Applied Security Research", "type": "journal", "alternate_names": ["J Appl Secur Res"], "issn": "1936-1610", "url": "http://www.tandfonline.com/loi/wasr20", "alternate_urls": ["http://www.tandfonline.com/toc/wasr20/current"]}, "title": "Exquisite Analysis of Popular Machine Learning–Based Phishing Detection Techniques for Cyber Systems", "abstract": "Abstract Recent advances in data science have made available many URL-analysis–based detection and machine learning algorithms, which are being leveraged for phishing detection. It is necessary to measure the efficacy of each technique so as to select an efficient phishing detection technique for integrating into a system. There have been a number of studies stated so far in this related field to assist with this task. While most of the studies have covered all the approaches, only a few have concentrated their study on machine learning–based techniques. Additionally, the parameters such as true-positive, false-positive, true-negative, and false-negative rates have been analyzed in most of the studies in these related articles. In order to achieve new objectives in the field of security, the study on analysis of phishing detection techniques needs to be expanded. In contrast to state-of-the-art methods, our research scrutinizes the different mechanisms and taxonomy used in each machine learning–based detection technique succeeded by an upper bound computing time.", "venue": "Journal of Applied Security Research", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2020-09-11", "journal": {"name": "Journal of Applied Security Research", "pages": "538 - 562", "volume": "16"}, "authors": [{"authorId": "2067610807", "name": "M. Das"}, {"authorId": "104908623", "name": "S. Saraswathi"}, {"authorId": "1985950", "name": "Rashmi Panda"}, {"authorId": "2559902", "name": "Alekha Kumar Mishra"}, {"authorId": "2417318", "name": "A. Tripathy"}], "citations": [{"paperId": "5c52b7032925e7554c41b4664faa2c3402ebb5ad", "title": "Autoencoder-Based Architecture for Identification and Mitigating Phishing URL Attack in IoT Using DNN"}, {"paperId": "b9e2a00b2b019d5eda4faeac5cbebf4bde3d3798", "title": "Phishing and Smishing Detection Using Machine Learning"}, {"paperId": "3af76b03bfe5fc8b1f97b2021f218a726d8c5f72", "title": "Data Management Risks: A Bane of Construction Project Performance"}, {"paperId": "ff21d933ab845011570ba5ee167a2f7db7e88b95", "title": "A Novel Logo Identification Technique for Logo-Based Phishing Detection in Cyber-Physical Systems"}, {"paperId": "db8d370ed0e7163c26076a7a9089c668149ba3bd", "title": "Phishing websites detection using a novel multipurpose dataset and web technologies features"}, {"paperId": "fad507a7068e24b1e82691a3bdd608223c001b7f", "title": "Intelligent System for Phishing detection on web pages using Random Forest"}, {"paperId": "47c8e60515e5f8be7222757d25296fe5f94bae8f", "title": "Characterizing Mobile Money Phishing Using Reinforcement Learning"}, {"paperId": "6528881f2ed4a854fbfbf0d77a71923b7d53ccb2", "title": "Phishing Detection Using ML Based URL Classification"}, {"paperId": "001a4a6cafe5a0e328aea5d92bec8db9e019b8cb", "title": "Fraudulent E-Commerce Websites Detection Through Machine Learning"}]}
