{"paperId": "87cfa078bbb74de8b14e59120246b5d385aa3f96", "publicationVenue": null, "title": "Sparse reward for reinforcement learning‐based continuous integration testing", "abstract": "Reinforcement learning (RL) has been used to optimize the continuous integration (CI) testing, where the reward plays a key role in directing the adjustment of the test case prioritization (TCP) strategy. In CI testing, the frequency of integration is usually very high, while the failure rate of test cases is low. Consequently, RL will get scarce rewards in CI testing, which may lead to low learning efficiency of RL and even difficulty in convergence. This paper introduces three rewards to tackle the issue of sparse rewards of RL in CI testing. First, the historical failure density‐based reward (HFD) is defined, which objectively represents the sparse reward problem. Second, the average failure position‐based reward (AFP) is proposed to increase the reward value and reduce the impact of sparse rewards. Furthermore, a technique based on additional reward is proposed, which extracts the test occurrence frequency of passed test cases for additional rewards. Empirical studies are conducted on 14 real industry data sets. The experiment results are promising, especially the reward with additional reward can improve NAPFD (Normalized Average Percentage of Faults Detected) by up to 21.97%, enhance Recall with a maximum of 21.87%, and increase TTF (Test to Fail) by an average of 9.99 positions.", "venue": "J. Softw. Evol. Process.", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-12-01", "journal": {"name": "Journal of Software: Evolution and Process", "volume": "35"}, "authors": [{"authorId": "2152283242", "name": "Yang Yang"}, {"authorId": "2146248035", "name": "Zheng Li"}, {"authorId": "2093090542", "name": "Y. Shang"}, {"authorId": "2142800925", "name": "Qianyu Li"}], "citations": [{"paperId": "e9e1b57dfc99969871372adb7cadf3fa154026ee", "title": "Deep reinforcement learning based energy management strategies for electrified vehicles: Recent advances and perspectives"}, {"paperId": "862527514e2d4c4c907e10ab9fc6489309477cbb", "title": "A Self-attention Agent of Reinforcement Learning in Continuous Integration Testing"}, {"paperId": "5f988b895e8fbb698d2c90a9479d2f020f03a25b", "title": "Editorial: Machine learning, software process, and global software engineering"}]}
