{"paperId": "87d4c95f166bc2d8939b8084d836a65a10ccdf23", "publicationVenue": null, "title": "Constructing Recommendation about Skills Combinations Frequently Sought in IT Industries Based on Apriori Algorithm", "abstract": "To adapt the IT curriculum to the requirements of the IT industry skills, several methods have been proposed. Among them is the method of mining job advertisement data to find skills that are being sought by the industry. However, so far no significant research has focused on providing recommendations on skills that need to be taken along with other popular skills to fill the job vacancies offered. Traditional recommendation methods cannot be applied because information related to user or industry ratings on a skill is not available in advertisements. This article proposes an alternative solution to this need by developing recommendation techniques based on skill association rules, where the rules are mined using Apriori algorithm. The recommendation results were confirmed to curriculum managers in several universities, and had obtained quite good recall and precision, namely 70% and 76% respectively. The proposed recommendation system is also able to find skill combinations that are prominent in job advertisements. Keywords—association rule, recommendation system, skillset", "venue": "Proceedings of the Mathematics, Informatics, Science, and Education International Conference (MISEIC 2019)", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2019-12-01", "journal": {"name": "Proceedings of the Mathematics, Informatics, Science, and Education International Conference (MISEIC 2019)"}, "authors": [{"authorId": "96979055", "name": "Latifah"}, {"authorId": "9322724", "name": "T. M. Akhriza"}, {"authorId": "2105210397", "name": "Laras Dewi Adistia"}], "citations": [{"paperId": "2fc49aafa340f21ecd9a4740812389a8837f214f", "title": "A Comprehensive Survey of Artificial Intelligence Techniques for Talent Analytics"}, {"paperId": "ff0bc9fd82c9d4d309738d7bf4104322fb7ad262", "title": "Analyzing the Needs of ICT Job Market in Jordan Using a Text Mining Approach"}, {"paperId": "2439e4e49ba82b966b79423c4a0b18dc8d210be1", "title": "Analyzing the relationship between information technology jobs advertised on-line and skills requirements using association rules"}]}
