{"paperId": "87d85e9aab7e2228321d0a050f397ffa1d9b74bd", "publicationVenue": {"id": "a658f37d-f6a7-4848-ad22-b2488e5ba84e", "name": "Engineering Construction and Architectural Management", "type": "journal", "alternate_names": ["Eng Constr Archit Manag", "Engineering, Construction and Architectural Management"], "issn": "0969-9988", "url": "http://www.blackwell-synergy.com/member/institutions/issuelist.asp?journal=eca", "alternate_urls": ["https://www.emerald.com/insight/publication/issn/0969-9988"]}, "title": "Walkability evaluation of building circulation based on user preference", "abstract": "PurposeBuilding circulation has an important impact on human comfort of buildings and is one of the critical factors in building design. A quantitative walkability evaluation of building circulation can benefit both building design and operation. However, indoor walkability of building circulation is determined not only by objective path features but also by subjective user preference. How to incorporate the preference from a large group of users into the design process is still a challenging issue.Design/methodology/approachThis study proposes a participatory framework of indoor path walkability evaluation based on user preference. Hierarchical indicators are developed to objectively measure indoor path features. Furthermore, group decision-making theory is adopted to aggregate individual user preference into user common preference for determining the relative indicator weights. Finally, integrated walkability scores (IWSs) are calculated to evaluate indoor path walkability quantitatively.FindingsA total of three case scenarios demonstrate that the proposed evaluation framework provides an efficient way for designers and owners to measure user preference quantitatively, analyze building circulations based on user preference and compare the walkability of different building design schemes.Practical implicationsThe developed methods provide an efficient way for designers and owners to measure user preference quantitatively, analyze building circulations based on user preference and compare the walkability of different building design schemes.Originality/valueThis study develops a comprehensive and quantitative walkability evaluation approach that considers both objective path features and subjective user preference derived from user characteristics and walking purposes, which provides an effective way to incorporate user feedback into the building design process and operation.", "venue": "Engineering Construction and Architectural Management", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2020-12-09", "journal": {"name": "Engineering, Construction and Architectural Management"}, "authors": [{"authorId": "35556319", "name": "Meiqing Fu"}, {"authorId": "144207288", "name": "R. Liu"}, {"authorId": "97808018", "name": "C. Hon"}], "citations": [{"paperId": "7f6f063097fdfaf439890fb8b37475106602ad18", "title": "A Framework for Assessing the Building Spatial Design from Fire Evacuation Perspective"}, {"paperId": "a0721faf3a53b51c508976dec7f7cbd66d5e69c5", "title": "Studying the impact of building morphology on occupants’ movement using a rule mining approach"}, {"paperId": "bd362f9d8b8941e9f2c69d2705985fc9a177020d", "title": "Evaluating building egress safety for the elderly under different urgent-level circumstances in high-density cities: Based on ABEM-enabled simulation"}, {"paperId": "d425ba75f81def5614b1fdcfaf0b977498f71ab8", "title": "Function matters: Development of a value engineering building–function–assessment framework from stakeholders’ perspectives using hybrid analytical methods"}, {"paperId": "ac1f4675fd81184ba72c0f5fd7bad4c563bd2911", "title": "ABEM-based Simulation of Building Egression Safety for the Elderly Under Different Circumstances: Enlightenments of Healthy Residential Buildings for the Elderly"}, {"paperId": "a0a5b944d00a47d23b1a04e3d09d437d023a18cb", "title": "The Influence of Interior Design on Consumer Decisions in Choosing a Cinema Building"}, {"paperId": "58096866d708e91bb2512e64e53f3f3abe0475e3", "title": "Engaging in social interaction: relationships between the accessibility of path structure and intensity of passive social interaction in urban parks"}]}
