{"paperId": "87dc61d3a9bda20a5470b99d1cf21953f7346ac5", "publicationVenue": null, "title": "State-of-the-Art Geospatial Information Processing in NoSQL Databases", "abstract": "Geospatial information has been indispensable for many application fields, including traffic planning, urban planning, and energy management. Geospatial data are mainly stored in relational databases that have been developed over several decades, and most geographic information applications are desktop applications. With the arrival of big data, geospatial information applications are also being modified into, e.g., mobile platforms and Geospatial Web Services, which require changeable data schemas, faster query response times, and more flexible scalability than traditional spatial relational databases currently have. To respond to these new requirements, NoSQL (Not only SQL) databases are now being adopted for geospatial data storage, management, and queries. This paper reviews state-of-the-art geospatial data processing in the 10 most popular NoSQL databases. We summarize the supported geometry objects, main geometry functions, spatial indexes, query languages, and data formats of these 10 NoSQL databases. Moreover, the pros and cons of these NoSQL databases are analyzed in terms of geospatial data processing. A literature review and analysis showed that current document databases may be more suitable for massive geospatial data processing than are other NoSQL databases due to their comprehensive support for geometry objects and data formats and their performance, geospatial functions, index methods, and academic development. However, depending on the application scenarios, graph databases, key-value, and wide column databases have their own advantages.", "venue": "ISPRS Int. J. Geo Inf.", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2020-05-19", "journal": {"name": "ISPRS Int. J. Geo Inf.", "pages": "331", "volume": "9"}, "authors": [{"authorId": "2068109952", "name": "Dongming Guo"}, {"authorId": "5286097", "name": "Erling Onstein"}], "citations": [{"paperId": "09a02e6a83bc43b5fa3a764ddf761972b2ebc529", "title": "A Survey on Spatio-Temporal Big Data Analytics Ecosystem: Resource Management, Processing Platform, and Applications"}, {"paperId": "8a9d44cdf6a7a60a86b3468f1d40a6e969469b98", "title": "From spatial data warehouse into NoSQL document-oriented database: case study Forest fire risk management"}, {"paperId": "e3414f476daeb0bfe0dd2cac9e8654d31fcaf9ee", "title": "How to manage massive spatiotemporal dataset from stationary and non-stationary sensors in commercial DBMS?"}, {"paperId": "fd34804305c7da3045e140141f4d4da3fe73e02c", "title": "Concept of Server-side Clusterization of Semi-Static Big Geodata for Web Maps"}, {"paperId": "b4ffe21bd9ca14d8f9ab36b708172a08763305a9", "title": "Soft Querying Features in GeoJSON Documents: The GeoSoft Proposal"}, {"paperId": "8834cb92c9cd376f07b1b4bfcd1d7c3eb4b2a4c4", "title": "The Innovation of GIS Service Mode Based on “Grid Integration” and “Elastic Cloud”"}, {"paperId": "c299093d6a7773e8274a6f217a439b02ade7882e", "title": "Augmenting Mobile App with NAO Robot for Autism Education"}, {"paperId": "bf668549484ea82ba0652cd4f7db8e851a4eb943", "title": "Designing and Developing a Meat Traceability System: A Case Study for the Greek Meat Industry"}, {"paperId": "74e6a794f0bb12dd069863915fe5a32a946938aa", "title": "A New Approach Based on ELK Stack for the Analysis and Visualisation of Geo-referenced Sensor Data"}, {"paperId": "052f440686ec0bd4535d536dae559003711a33a3", "title": "GeoYCSB: A Benchmark Framework for the Performance and Scalability Evaluation of Geospatial NoSQL Databases"}, {"paperId": "b110f320c84053fddb280d67b5664da48c4167e8", "title": "Improving NoSQL Spatial-Query Processing with Server-Side In-Memory R*-Tree Indexes for Spatial Vector Data"}, {"paperId": "cd4b2913df40fc717cb97f94e4d427911f6a2312", "title": "The Application of Graph in BIM/GIS Integration"}, {"paperId": "c8d43139ad3998a318dae6eaa533f26088d3f5f1", "title": "Real-Time Big Data Processing and Analytics: Concepts, Technologies, and Domains"}, {"paperId": "9dcdfbac34c87576e6cb24e8f60b42f446e2730c", "title": "A Low-Cost Labeling Service for Satellite Imagery Data"}, {"paperId": "3c45a4492e2f767611fd701f28045740afaa9afc", "title": "Geospatial complex event processing in smart city applications"}, {"paperId": "0c912599202d94f1a016072d02ad6b3e9bd94137", "title": "3D Model Management and Dynamic Loading based on GIS Database"}, {"paperId": "e69f0dcf48c4f7fb5c5dc72b854bce6454ab0acb", "title": "Cloud-based storage and computing for remote sensing big data: a technical review"}, {"paperId": "68bbff5d365636f0c7f5725690231fe858f01f18", "title": "Serverless Geospatial Data Processing Workflow System Design"}, {"paperId": "474d0f308269c14292122ab900c3a8489207b5be", "title": "Benchmarking geospatial database on Kubernetes cluster"}, {"paperId": "e81a93d2fde4ee43af911608d3d7b1421007e8d4", "title": "Coleta e Persistência de Informação Geográfica Voluntária"}, {"paperId": "244279783ab15423992e446b9da855b363a367ef", "title": "A Survey on Spatio-temporal Data Analytics Systems"}, {"paperId": "bb665a23f41d7c2c96a0b2f994cbace0ae844de1", "title": "Análise do desmatamento e das queimadas na Amazônia Legal em 2018 e 2019 utilizando dados geoespaciais"}, {"paperId": "4da144c2fa9d906578c5a880b6f38c65ed8c2ce9", "title": "VOXEL DATA MANAGEMENT AND ANALYSIS IN POSTGRESQL/POSTGIS UNDER DIFFERENT DATA LAYOUTS"}, {"paperId": "3d040204925877a5d26cfe08139d99b8962a1f14", "title": "A Survey of Cloud-Enabled GIS Solutions Toward Edge Computing: Challenges and Perspectives"}, {"paperId": "2f875ae39e21fe9d7eb4cb039be570f1bfb3a2d6", "title": "Managing 3D GIS Data for Indoor Environment Using Property Graph Database"}, {"paperId": "8215f6c7bdc26bb7960e25b38e6b73f6336b3e58", "title": "Solutions and approaches analysis for geospatial data clustering to optimize performance and user experience of web maps"}, {"paperId": "72ff472d6a2793590c56b87abfd147463cfa01c8", "title": "Review on Integrating Geospatial Big Datasets and Open Research Issues"}, {"paperId": "bbd6c4932042d844aa05b9986d6f68ad101951a6", "title": "An Analytical Tool for Georeferenced Sensor Data based on ELK Stack"}, {"paperId": "de0efe707ade401015ab5b64946d54442af651b8", "title": "Geospatial Tools for Mapping and Monitoring Coastal Mangroves"}, {"paperId": "5fbc855192ed8b3932621a9b872880c9f7d0829e", "title": "Using a DBMS based on various data models in solving problems of cartography and geoinformatics"}, {"paperId": "c06faad909501d290580e05e6132a47d04f63b82", "title": "Method for Query Processing in a Geographic Information System"}, {"paperId": "0ef22742e925f93c70f797762652591b4bfb8c4e", "title": "An Efficient NoSQL-Based Storage Schema for Large-Scale Time Series Data"}]}
