{"paperId": "87f03427738ee72b1cd70f90a572e0c00b4593c5", "publicationVenue": {"id": "027ffd21-ebb0-4af8-baf5-911124292fd0", "name": "bioRxiv", "type": "journal", "url": "http://biorxiv.org/"}, "title": "Functional gradients in the human lateral prefrontal cortex revealed by a comprehensive coordinate-based meta-analysis", "abstract": "The human lateral prefrontal cortex (LPFC) enables flexible goal-directed behavior. Yet, its organizing principles remain actively debated despite decades of research. Meta-analysis efforts to map the LPFC have either been restricted in scope or suffered from limited expressivity in meta-analysis tools. The latter short-coming hinders the complexity of questions that can be expressed in a meta-analysis and hence limits the specificity of structure-function associations. Here, we adopt NeuroLang, a novel approach to meta-analysis based on first-order probabilistic logic programming, to infer the organizing principles of the LPFC with greater specificity from 14,371 neuroimaging publications. Our results reveal a rostrocaudal and a dorsoventral gradient, respectively explaining the most and second-most variance in whole-brain meta-analytic connectivity in the LPFC. Moreover, we find a cross-study agreement on a spectrum of increasing abstraction from caudal to rostral LPFC both in specific network connectivity and structure-function associations that supports a domain-general role for the mid-LPFC. Furthermore, meta-analyzing inter-hemispheric asymmetries along the rostrocaudal gradient reveals specific associations with topics of language, memory, response inhibition, and error processing. Overall, we provide a comprehensive mapping of the organizing principles of task-dependent activity in the LPFC, grounding future hypothesis generation on a quantitative overview of past findings.", "venue": "bioRxiv", "year": 2022, "fieldsOfStudy": ["Biology", "Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-01-23", "journal": {"name": "eLife", "volume": "11"}, "authors": [{"authorId": "121694497", "name": "M. Abdallah"}, {"authorId": "2006414215", "name": "G. Zanitti"}, {"authorId": "1453725790", "name": "Valentin Iovene"}, {"authorId": "35466637", "name": "D. Wassermann"}], "citations": [{"paperId": "4174ed20808cb62d29c9b41e37f39a5271d70276", "title": "Pathological claustrum activity drives aberrant cognitive network processing in human chronic pain"}, {"paperId": "ad57ddf0122795fabc0507d65cec477c92941a93", "title": "Graded functional organization in the left inferior frontal gyrus: evidence from task-free and task-based functional connectivity"}, {"paperId": "34e899584d74256b1b509dec3d1a42f6381e20f3", "title": "The role of the prefrontal cortex in social interactions of animal models and the implications for autism spectrum disorder"}, {"paperId": "36982bc292cc249558c11a8efcbdecd3068810b3", "title": "A new open, high-resolution, multishell, diffusion-weighted imaging dataset of the living squirrel monkey"}, {"paperId": "7bc7cf485467eade50153625909dc2f739217634", "title": "Graded functional organisation in the left inferior frontal gyrus: evidence from task-free and task-based functional connectivity"}]}
