{"paperId": "87f2dde5622887c20fe6ca23b21669f5ce2e6cd3", "publicationVenue": {"id": "946e893f-4e7f-47c5-8544-15aa5a2cc679", "name": "Journal of Healthcare Engineering", "type": "journal", "alternate_names": ["J Healthc Eng"], "issn": "2040-2295", "url": "https://www.hindawi.com/journals/jhe/", "alternate_urls": ["http://www.multi-science.co.uk/jhe.htm"]}, "title": "An Efficient Middle Layer Platform for Medical Imaging Archives", "abstract": "Digital medical image usage is common in health services and clinics. These data have a vital importance for diagnosis and treatment; therefore, preservation, protection, and archiving of these data are a challenge. Rapidly growing file sizes differentiated data formats and increasing number of files constitute big data, which traditional systems do not have the capability to process and store these data. This study investigates an efficient middle layer platform based on Hadoop and MongoDB architecture using the state-of-the-art technologies in the literature. We have developed this system to improve the medical image compression method that we have developed before to create a middle layer platform that performs data compression and archiving operations. With this study, a platform using MapReduce programming model on Hadoop has been developed that can be scalable. MongoDB, a NoSQL database, has been used to satisfy performance requirements of the platform. A four-node Hadoop cluster has been built to evaluate the developed platform and execute distributed MapReduce algorithms. The actual patient medical images have been used to validate the performance of the platform. The processing of test images takes 15,599 seconds on a single node, but on the developed platform, this takes 8,153 seconds. Moreover, due to the medical imaging processing package used in the proposed method, the compression ratio values produced for the non-ROI image are between 92.12% and 97.84%. In conclusion, the proposed platform provides a cloud-based integrated solution to the medical image archiving problem.", "venue": "Journal of Healthcare Engineering", "year": 2018, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-06-21", "journal": {"name": "Journal of Healthcare Engineering", "volume": "2018"}, "authors": [{"authorId": "51102125", "name": "A. Ergüzen"}, {"authorId": "51091466", "name": "Erdal Erdal"}], "citations": [{"paperId": "923850c2435fbc68bb7015ade8c9ae0ab44cdef8", "title": "Hand-Traced versus Digitally Traced Cephalometric Analysis: A Comparative Study"}, {"paperId": "d1f131377260c49c7f5f0306b2c63a8f7d3782ed", "title": "Huffman-based lossless image encoding scheme"}, {"paperId": "aab87d5d6f23069249b22a8f3b51ccfb25b402f6", "title": "A Proposed Integration Architecture for University Research Data Repository to Support University and University Hospital on Medical Digital Image Management and Analytics using Hadoop"}, {"paperId": "a184143861103bfb040ffd64d302e09532afc6a1", "title": "Research on the Secure Medical Big Data Ecosystem Based on Hadoop"}, {"paperId": "7249c32fe3dbf4e8e9a8fda3d36c6719cdc06f2c", "title": "USMED and Surgery Assist: IMAGO MOL Cluster Biomedical Solutions to Improve Patient Imaging Availability and Noninvasive Diagnosis"}, {"paperId": "64c1cdd5b97a166cd783ff2d26bc296be034faec", "title": "ROI Determination and Compression in MRI Using Gradient Method with CUDA"}, {"paperId": "b548acd771d1783766099ca7bfe00b2a549cc22c", "title": "A Survey Study of Diseases Diagnosed Through Imaging Methodology Using Ultrasonography"}]}
