{"paperId": "87f6cb8ead9d7436d66b0c23853c00540638590f", "publicationVenue": null, "title": "Cloud Computing System Design for Improving and Control Central Air Conditioning", "abstract": "All areas of life have steadily progressed towards a modern time, thanks to the quick development, deep application, and cooperation of new concepts and technology introduced by the Internet of Things (IOT) and cloud computing all over the world. These technologies have steadily made their way into the smart city industry. This study describes a cloud computing system for big businesses to optimize and control central air conditioning based on humidity and temperature. Cooling a group of rooms with a central air conditioning unit to regulate and monitor centralized cooling for large buildings, system primarily relies on weather data saved in the cloud. Because in this work does have any sensors and this building has a lot of space and many branches, the best decision is to manage the speed of the centralized cooling fan by using weather data that is updated in the cloud. When considering gigantic currents in buildings and control, the automatization of simple changes in cooling and humidity will cut expenses and minimize the probability of failure. This paper uses the C++ programming language to program the Arduino, as well as the temperature and humidity sensors. These sensors will feed the centralized cooling data to the cloud, where it can be monitored and controlled from any device, such as a smartphone, to meet the building's temperature and humidity requirements. The building's air conditioning system is an essential component of a comfortable and good environment for internal settings.", "venue": "2022 2nd International Conference on Advances in Engineering Science and Technology (AEST)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-10-24", "journal": {"name": "2022 2nd International Conference on Advances in Engineering Science and Technology (AEST)", "pages": "366-369"}, "authors": [{"authorId": "2283150386", "name": "Tania Mohammed Abbas"}, {"authorId": "2283153730", "name": "Laith Ali Abdul-Rahim"}, {"authorId": "2283266408", "name": "Sura Mousa Ali"}], "citations": []}
