{"paperId": "87fc6ec21a9292f7dce62bd211452b9e86c88299", "publicationVenue": {"id": "ed5f019d-fcfe-4bb9-8342-9a729784715d", "name": "Journal of Open Innovation: Technology, Market and Complexity", "type": "journal", "alternate_names": ["J Open Innov Technol Mark Complex"], "issn": "2199-8531", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-1111697", "alternate_urls": ["https://jopeninnovation.springeropen.com/", "http://www.springer.com/business+&+management/technology+management/journal/40852", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-1111697", "https://www.mdpi.com/journal/JOItmC", "http://www.jopeninnovation.com/"]}, "title": "Optimal Exploitation of On-Street Parked Vehicles as Roadside Gateways for Social IoV—A Case of Kigali City", "abstract": "Vehicular Ad Hoc Network (VANET) is a subclass of Mobile Ad Hoc Network that mainly consists of moving and/or stationary vehicles, connected through wireless protocols such as IEEE 802.11p and wireless access in vehicular environments (WAVE). With the evolution of the Internet of Things (IoT), ordinary VANET has turned to the Internet of Vehicles (IoV), with additional social aspects, a novel extension themed SIoV has become common in urban areas. However vehicular wireless communication paradigms exhibit short radio communication. This problem has always been approached by supplementing moving vehicles with stationary Road Side Infrastructures, commonly known as roadside units (RSUs). The penetration of such RSUs on the global market is very low; furthermore, their procurement, deployment, and maintenance costs are prohibitively very high. All mentioned challenges have discouraged the widespread deployment of roadside infrastructure especially within large urban scenarios. With this research, we leverage on-street parked vehicles to allow them to exist as temporal gateways in the case study area. A novel modeling technique is introduced to enable a specific Percentage of parked vehicles to take up the role of roadside gateways for a certain percentage of their parking time. A mobile application is implemented that manages parking duration of the vehicle, based on the arrival, and departure time frames. Two more existing strategies were discussed (road-intersection RSUs deployment approach and Inter-vehicle scheme) to validate our proposed method through comparative studies. To evaluate the network performance evaluation, we compare two performance metrics, that is, Packets success delivery rate, and overall packets throughput under numerous vehicle densities. Using parked vehicles as temporal roadside gateways has demonstrated better results in comparison to intersection based RSUs deployment approach, and free vehicle to vehicle communication approach.", "venue": "Journal of Open Innovation: Technology, Market and Complexity", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2020-09-03", "journal": {"name": "Journal of Open Innovation: Technology, Market, and Complexity"}, "authors": [{"authorId": "2005542941", "name": "Twahirwa Evariste"}, {"authorId": "1585011767", "name": "Willie Kasakula"}, {"authorId": "71931241", "name": "James Rwigema"}, {"authorId": "3317770", "name": "R. Datta"}], "citations": [{"paperId": "11ddc38081529a743a54404b4d4b2368fcf9a8a2", "title": "Design and Deployment of Vehicular Internet of Things for Smart City Applications"}, {"paperId": "e3d0cd767f1dda6acc56453e16e8cc21bafa1ee8", "title": "Moisture Computing-Based Internet of Vehicles (IoV) Architecture for Smart Cities"}, {"paperId": "10bfc45b0d660fdfc38a5206f663a201ab848bf0", "title": "Efficient Certificate-Less Aggregate Signature Scheme with Conditional Privacy-Preservation for Vehicular Ad Hoc Networks Enhanced Smart Grid System"}]}
