{"paperId": "88119a89dc790172ca4056f650ceedfc70330ec5", "publicationVenue": {"id": "b198f59e-0da6-4b35-b995-a02322b9dada", "name": "IEEE International Conference on Services Computing", "type": "conference", "alternate_names": ["International Conference on Services Computing [Services Society]", "International Conference on Services Computing", "IEEE Int Conf Serv Comput", "Int Conf Serv Comput [services Soc", "SCC", "Int Conf Serv Comput", "IEEE SCC"], "url": "https://ieeexplore.ieee.org/xpl/conhome/1001209/all-proceedings"}, "title": "Data Provenance for Complex Event Processing Invoking Composition of Services", "abstract": "Data provenance is a fundamental concept in scientific experimentation in general and complex event processing (CEP) in particular. For accurate determination and visualization of data provenance, efficient and user-friendly mechanisms are needed. Research in CEP optimization and visual notations can help in this process. This paper presents the extension of an optimized CEP framework to respond to data provenance requests. The extension consists in enriching the formal representation of execution plans of CEP queries to make them provenance-aware. These provenance-aware execution plans are then queried to generate a visual representation of the provenance data. We present the implementation of this framework and then its deployment and the associated evaluation in the context of an industrial use case.", "venue": "IEEE International Conference on Services Computing", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-11-01", "journal": {"name": "2020 IEEE International Conference on Services Computing (SCC)", "pages": "142-151"}, "authors": [{"authorId": "2153468", "name": "Malik Khalfallah"}, {"authorId": "71300895", "name": "P. Ghodous"}], "citations": [{"paperId": "af04260faa68353d261c5357d86106392af08ed2", "title": "2020 IEEE International Conference on Services Computing, SCC 2020, Beijing, China, November 7-11, 2020"}]}
