{"paperId": "881806ed444618a22f8d5183fb95555e0b91fac6", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "A Self-Optimizing Technique Based on Vertical Handover for Load Balancing in Heterogeneous Wireless Networks Using Big Data Analytics", "abstract": "With the heterogeneity and collaboration of many wireless operators (2G/3G/4G/5G/Wi-Fi), the priority is to effectively manage shared radio resources and ensure transparent user movement, which includes mechanisms such as mobility support, handover, quality of service (QoS), security and pricing. This requires considering the transition from the current mobile network architecture to a new paradigm based on collecting and storing information in big data for further analysis and decision making. For this reason, the management of big data analytics-driven networks in a cloud environment is an urgent issue, as the growth of its volume is becoming a challenge for today’s mobile infrastructure. Thus, we have formalized the problem of access network selection to improve the quality of mobile services through the efficient use of heterogeneous wireless network resources and optimal horizontal–vertical handover procedures. We proposed a method for adaptive selection of a wireless access node in a heterogeneous environment. A structural diagram of the optimization stages for wireless heterogeneous networks was developed, making it possible to improve the efficiency of their functioning. A model for studying the processes of functioning of a heterogeneous network environment is proposed. This model uses the methodology of big data evaluation to perform data transmission monitoring, analysis of tasks generated by network users, and statistical output of vertical handover initiation in (2G/3G/4G/5G/Wi-Fi) mobile communication infrastructure. The model allows studying the issues of optimization of operators’ networks by implementing the algorithm of redistribution of its network resources and providing flexible load balancing with QoS users in mind. The effectiveness of the proposed solutions is evaluated, and the performance of the heterogeneous network is increased by 16% when using the method of static reservation of network resources, compared to homogeneous networks, and another 13% when using a uniform distribution of resources and a dynamic process of their reservation, as well as compared to the previous method. An appropriate self-optimizing technique based on vertical handover for load balancing in heterogeneous wireless networks, using big data analytics, improves the QoS for users.", "venue": "Applied Sciences", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-05-21", "journal": {"name": "Applied Sciences", "pages": "4737", "volume": "11"}, "authors": [{"authorId": "3322503", "name": "M. Beshley"}, {"authorId": "1727208", "name": "N. Kryvinska"}, {"authorId": "144334392", "name": "O. Yaremko"}, {"authorId": "9120177", "name": "H. Beshley"}], "citations": [{"paperId": "aca4cb8d935af2840ff4f579d19c64da43027401", "title": "DCTCADM: Data-Centric Cognitive Agent Decision Making Based an Effective Handoff for Heterogeneous Wireless Communication"}, {"paperId": "031dc7f9b65f000d9898ffe0ea264443905a389c", "title": "An adaptive optimized handover decision model for heterogeneous networks"}, {"paperId": "49e1c8dd7b7f9fee6cc543039ec041278a1d5b3b", "title": "Vertical Handover in WLAN Systems Using Cooperative Scheduling"}, {"paperId": "58860cd445ec3cb127ad71b7a61adcb308b056ec", "title": "Quality of service management method in а heterogeneous wireless network using Big Data technology аnd mobile QoE application"}, {"paperId": "dbd5660b0a986de29f07892a76764033ca2b9fdb", "title": "Heterogeneous Network Handover Techniques for Vehicular Communication: Methods and Techniques"}, {"paperId": "b22acc810b216dd89566feef6a838203cf84d966", "title": "CONVERGENCE OF HETEROGENEOUS WIRELESS NETWORKS FOR FUTURE COMMUNICATIONS: ARCHITECTURE, QOS AND RESOURCE MANAGEMENT"}, {"paperId": "ce9885b22c6aa8b7631d0391a682b717d6df8719", "title": "Soft Computing-Based Schemes for Handover Management in Future Networks"}, {"paperId": "9619da7c744ccec67aa3eb6b34b5a496b11e9cf8", "title": "Algorithm for vertical handover decision using geometric mean and MADM techniques"}, {"paperId": "ac61262767b0ab0934b308b031b4a129c7c2723d", "title": "Load dynamic balancing algorithm based on software defined wireless network for different access points"}, {"paperId": "16e3e4a5c5dc68f3af0c0a9d585e47140c94fa05", "title": "Exploiting Multihoming Capabilities in 5G-Enabled IoT Nodes"}, {"paperId": "75f24dd04d14f1dde14e887f946d5cee2e4e8d48", "title": "Handover for 5G Networks using Fuzzy Logic: A Review"}]}
