{"paperId": "88297d3a7713b2c4beb6574488efb2312a6221d9", "publicationVenue": null, "title": "Journal of University Teaching & Learning Practice Journal of University Teaching & Learning Practice", "abstract": "Abstract Artificial Intelligence in higher education (AIED) is becoming a more important research area with increasing developments and application of AI within the wider society. However, as yet AI based tools have not been widely adopted in higher education. As a result there is a lack of sound evidence available on the pedagogical impact of AI for learning and teaching. This conceptual paper thus seeks to bridge the gap and addresses the following question: is artificial intelligence really the new big thing that will revolutionise learning and teaching in higher education? Adopting the technological pedagogical content knowledge (TPACK) framework and the Unified Theory of Acceptance and Use of Technology (UTAUT) as the theoretical foundations, we argue that Artificial Intelligence (AI) technologies, at least in their current state of development, do not afford any real new advances for pedagogy in higher education. This is mainly because there does not seem to be valid evidence as to how the use of AI technologies and applications has helped students improve learning, and/or helped tutors make effective pedagogical changes. In addition, the pedagogical affordances of AI have not yet been clearly defined. The challenges that the higher education sector is currently experiencing relating to AI adoption are discussed at three hierarchical levels, namely national, institutional and personal levels. The paper ends with recommendations with regard to accelerating AI use in universities. This includes developing dedicated AI adoption strategies at the institutional level, updating the existing technology infrastructure and up-skilling academic tutors for AI.", "venue": "", "year": null, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "2290510955", "name": "Dr Joseph Crawford"}], "citations": [{"paperId": "21fb2d395ee539367312989ee521225222ff1277", "title": "Influence of Special Learning Technology on the Effectiveness of Pedagogical Ethics Formation in Future Teachers"}, {"paperId": "adab3e34cbb8b7f4bdce5c241b75df44b2f0559d", "title": "Online teaching and learning: Experiences of students in a nursing college during the onset of COVID-19"}, {"paperId": "999d19554f9357ba824349a668e78d8d7a0d7ad5", "title": "Perceived quality of online learning during COVID-19 in higher education in Singapore: perspectives from students, lecturers, and academic leaders"}, {"paperId": "5c99a4020462ecfb9836cd1cb4c963701ba4d32b", "title": "Digital influences on academic attainment"}, {"paperId": "309eff614709aa861243130ca8a1f46e8d03cad2", "title": "Present and Future of Teacher Education Admission: Perspectives From Europe"}, {"paperId": "a0144258cceb03b7893db297ebce9ed3abdaf637", "title": "‘Bittersweet’ and ‘alienating’: An extreme comparison of collaborative autoethnographic perspectives from higher education students, non-teaching staff and faculty during the pandemic in the UK and Singapore"}, {"paperId": "07dc3a569887ffa364f19f5208c1ede7a298359f", "title": "Collaborative testing in Sport and Exercise Degrees: A comparison of first and third year students' perceptions"}, {"paperId": "0c1c226d6c3a118a8baa3337ef75a418a94eaae3", "title": "The impacts of supervisor – PhD student relationships on PhD students’ satisfaction: A case study of Vietnamese universities"}, {"paperId": "fd1d3e93a29160c5a6c173b734dfdf0fb86342fc", "title": "Teacher’s Facilitating Strategies in Conducting Science Investigatory Project"}, {"paperId": "6c10db0d9d5aed8b34c816fdfdac5c949c890c27", "title": "Journal of University Teaching & Learning Practice Journal of University Teaching & Learning Practice"}]}
