{"paperId": "883b5a6cbbf3c499c8402204a657abf1e836d310", "publicationVenue": {"id": "7b2adce0-d53f-49d6-8784-b0645604fe62", "name": "ACM Computing Surveys", "type": "journal", "alternate_names": ["ACM Comput Surv"], "issn": "0360-0300", "url": "http://www.acm.org/pubs/surveys/", "alternate_urls": ["http://portal.acm.org/csur", "https://csur.acm.org/", "http://csur.acm.org/"]}, "title": "Deep Learning Workload Scheduling in GPU Datacenters: A Survey", "abstract": "Deep learning (DL) has demonstrated its remarkable success in a wide variety of fields. The development of a DL model is a time-consuming and resource-intensive procedure. Hence, dedicated GPU accelerators have been collectively constructed into a GPU datacenter. An efficient scheduler design for a GPU datacenter is crucially important to reduce operational cost and improve resource utilization. However, traditional approaches designed for big data or high performance computing workloads can not support DL workloads to fully utilize the GPU resources. Recently, many schedulers are proposed to tailor for DL workloads in GPU datacenters. This paper surveys existing research efforts for both training and inference workloads. We primarily present how existing schedulers facilitate the respective workloads from the scheduling objectives and resource utilization manner. Finally, we discuss several promising future research directions including emerging DL workloads, advanced scheduling decision making and underlying hardware resources. A more detailed summary of the surveyed paper and code links can be found at our project website: https://github.com/S-Lab-System-Group/Awesome-DL-Scheduling-Papers.", "venue": "ACM Computing Surveys", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "ACM Computing Surveys"}, "authors": [{"authorId": "2114133698", "name": "Zhisheng Ye"}, {"authorId": "2153578116", "name": "Wei Gao"}, {"authorId": "2150570711", "name": "Qi Hu"}, {"authorId": "2075416290", "name": "Peng Sun"}, {"authorId": "2145745781", "name": "Xiaolin Wang"}, {"authorId": "36644172", "name": "Yingwei Luo"}, {"authorId": "2146333441", "name": "Tianwei Zhang"}, {"authorId": "2262199050", "name": "Yonggang Wen"}], "citations": []}
