{"paperId": "8858689f744d258d28a913e5dfdd3b14fd09f972", "publicationVenue": {"id": "8a7c9905-f8cf-4711-bca6-0ef69aef9823", "name": "International Journal of Information Technology and Decision Making", "type": "journal", "alternate_names": ["Int J Inf Technol Decis Mak"], "issn": "1793-6845", "url": "http://www.worldscinet.com/ijitdm/ijitdm.shtml"}, "title": "Multi-Scale Shapelets Discovery for Time-Series Classification", "abstract": "Shapelets are subsequences of time-series that represent local patterns and can improve the accuracy and the interpretability of time-series classification. The major task of time-series classification using shapelets is to discover high quality shapelets. However, this is challenging since local patterns may have various scales/lengths rather than a unified scale. In this paper, we resolve this problem by discovering shapelets with multiple scales. We propose a novel Multi-Scale Shapelet Discovery (MSSD) algorithm to discover expressive multi-scale shapelets by extending initial single-scale shapelets (i.e., shapelets with a unified scale). MSSD adopts a bi-directional extension process and is robust to extend single-shapelets obtained by different methods. A supervised shapelet quality measurement is further developed to qualify the extension of shapelets. Comprehensive experiments conducted on 25 UCR time-series datasets show that multi-scale shapelets discovered by MSSD improve classification accuracy by around 10% (in average), compared with single-scale shapelets discovered by counterpart methods.", "venue": "International Journal of Information Technology and Decision Making", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-06-05", "journal": {"name": "Int. J. Inf. Technol. Decis. Mak.", "pages": "721-739", "volume": "19"}, "authors": [{"authorId": "8811761", "name": "Borui Cai"}, {"authorId": "2074183", "name": "Guangyan Huang"}, {"authorId": "2068338805", "name": "Yong Xiang"}, {"authorId": "117576173", "name": "Maia Angelova Turkedjieva"}, {"authorId": "46846136", "name": "Limin Guo"}, {"authorId": "36452710", "name": "Chi-Hung Chi"}], "citations": [{"paperId": "d31bb846ea5a643a3d235c931d620a1e76a6e6d4", "title": "SE-shapelets: Semi-supervised Clustering of Time Series Using Representative Shapelets"}, {"paperId": "052df98a0ce1b949870d6443af458bcc9d513bcf", "title": "A wavelet multifractal model for quality of life index measuring during pandemics and crises"}, {"paperId": "37cf42aaae1ed8d5c943926af8cbf3c7e0ba7d00", "title": "CDPS: Constrained DTW-Preserving Shapelets"}]}
