{"paperId": "885a27c73cf094c41647607fbf8ea1ae3eb89e1f", "publicationVenue": {"id": "fcbcaf18-8ab1-43e1-a973-604bbc7e344e", "name": "Proceedings of the VLDB Endowment", "type": "journal", "alternate_names": ["Proceedings of The Vldb Endowment", "Proc VLDB Endow", "Proc Vldb Endow"], "issn": "2150-8097", "url": "http://dl.acm.org/toc.cfm?id=J1174", "alternate_urls": ["http://portal.acm.org/toc.cfm?CFID=21632689&CFTOKEN=99329904&WantType=Affiliated%20Organizations&coll=ACM&dl=ACM&id=J1174&idx=J1174&part=affil&title=VLDB%20Endowment&type=periodical"]}, "title": "Exploiting the Power of Equality-generating Dependencies in Ontological Reasoning", "abstract": "Equality-generating dependencies (EGDs) allow to fully exploit the power of existential quantification in ontological reasoning settings modeled via Tuple-Generating Dependencies (TGDs), by enabling value-assignment or forcing the equivalence of fresh symbols. These capabilities are at the core of many common reasoning tasks, including graph traversals, clustering, data matching and data fusion, and many more related real-world scenarios.\n However, the interplay of TGDs and EGDs is known to lead to undecidability or intractability of query answering in tractable Datalog+/- fragments, like Warded Datalog+/-, for which, in the sole presence of TGDs, query answering is PTIME in data complexity. Restrictions of equality constraints, like separable EGDs, have been studied, but all achieve decidability at the cost of limited expressive power, which makes them unsuitable for the mentioned tasks.\n This paper introduces the class of \"harmless\" EGDs, that subsume separable EGDs and allow to model a very broad class of tasks. We contribute a sufficient syntactic condition for testing harmlessness, an undecidable task in general. We argue that in Warded Datalog+/- with harmless EGDs, ontological reasoning is decidable and PTIME. From such theoretical underpinnings, we develop novel chase-based techniques for reasoning with harmless EGDs and present an implementation within the Vadalog system, a state-of-the-art Datalog-based reasoner. We provide full-scale experimental evaluation and comparative analysis.", "venue": "Proceedings of the VLDB Endowment", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-09-01", "journal": {"name": "Proc. VLDB Endow.", "pages": "3976-3988", "volume": "15"}, "authors": [{"authorId": "1716855", "name": "Luigi Bellomarini"}, {"authorId": "105049426", "name": "Davide Benedetto"}, {"authorId": "2083490", "name": "M. Brandetti"}, {"authorId": "1739608", "name": "Emanuel Sallinger"}], "citations": [{"paperId": "21b987cc9b254fec4cccec8707ac0ee25fa68f48", "title": "Ontological Reasoning over Shy and Warded Datalog+/- for Streaming-based Architectures (technical report)"}, {"paperId": "e9adf93dd5e007f93e479df9412c1835667e0df7", "title": "KG-Roar: Interactive Datalog-based Reasoning on Virtual Knowledge Graphs"}]}
