{"paperId": "885b8a9c9d47319ada112c17314af8b22a3340de", "publicationVenue": {"id": "ccd8e532-73c6-414f-bc91-271bbb2933e2", "name": "Electronics", "type": "journal", "issn": "1450-5843", "alternate_issns": ["2079-9292", "0883-4989"], "url": "http://www.electronics.etfbl.net/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-247562", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-247562", "https://www.mdpi.com/journal/electronics"]}, "title": "Integration and Applications of Fog Computing and Cloud Computing Based on the Internet of Things for Provision of Healthcare Services at Home", "abstract": "Due to the COVID-19 pandemic, the world has faced a significant challenge in the increase of the rate of morbidity and mortality among people, particularly the elderly aged patients. The risk of acquiring infections may increase during the visit of patients to the hospitals. The utilisation of technology such as the “Internet of Things (IoT)” based on Fog Computing and Cloud Computing turned out to be efficient in enhancing the healthcare quality services for the patients. The present paper aims at gaining a better understanding and insights into the most effective and novel IoT-based applications such as Cloud Computing and Fog Computing and their implementations in the healthcare field. The research methodology employed the collection of the information from the databases such as PubMed, Google Scholar, MEDLINE, and Science Direct. There are five research articles selected after 2015 based on the inclusion and exclusion criteria set for the study. The findings of the studies included in this paper indicate that IoT-based Fog Computing and Cloud Computing increase the delivery of healthcare quality services to patients. The technology showed high efficiency in terms of convenience, reliability, safety, and cost-effectiveness. Future studies are required to incorporate the models that provided the best quality services using the Fog and Cloud Computation techniques for the different user requirements. Moreover, edge computing could be used to significantly enhance the provision of health services at home.", "venue": "Electronics", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-05-02", "journal": {"name": "Electronics", "pages": "1077", "volume": "10"}, "authors": [{"authorId": "48761742", "name": "M. Ijaz"}, {"authorId": "2108744479", "name": "G. Li"}, {"authorId": "2107675398", "name": "L. Lin"}, {"authorId": "2146753", "name": "O. Cheikhrouhou"}, {"authorId": "2373768", "name": "H. Hamam"}, {"authorId": "2113828555", "name": "A. Noor"}], "citations": [{"paperId": "e9228d84ab6b1d219f5017638d6cefb4e513357c", "title": "Optimized deep autoencoder and BiLSTM for intrusion detection in IoTs-Fog computing"}, {"paperId": "1e50a70421e484d685184f94b04344b03146bc26", "title": "Research Progress on Router Devices for the OAM Optical Communication"}, {"paperId": "1d620afe7c00e31c2681ba11ea207083c2d5ce80", "title": "FNSS: A Heuristics for Fog Node Site Selection"}, {"paperId": "dea6d4c23df1e510c4711b4eca54f161d949fd3f", "title": "A hybrid feature selection approach for urinary tract infection detection and prediction in IoT-Fog environment"}, {"paperId": "b03f6a5054647094460d5931dc32a790a2521fb8", "title": "Exploring the Transformative Convergence of IoT and Fog Computing for Healthcare, Agriculture, Urbanization, and Transportation"}, {"paperId": "60b40542f70cba857c9b789a20f89d325021dadb", "title": "DAHS: Development of Android based Healthcare System using Cloud Computing"}, {"paperId": "e81e4e5a3b8f078a1b3d09026e768d5414a203a9", "title": "Machine Learning in Robotics with Fog/Cloud Computing and IoT"}, {"paperId": "f4b51c5dec776dc5e926211bb6163fb314cca7bc", "title": "ACC-PH: a Comprehensive Framework for Adopting Cloud Computing in Private Hospitals"}, {"paperId": "1dd19f2b09a9d0c55807b05ea2f4df9297c1088e", "title": "Empowering elderly care with intelligent IoT-Driven smart toilets for home-based infectious health monitoring"}, {"paperId": "846e3325a8a436abb2b5a4a59f0a2f41febaa850", "title": "Unboxing fog security: a review of fog security and authentication mechanisms"}, {"paperId": "758d903ee60e30b47f137cc8901ee3a7ec54b2f6", "title": "Mapping a Decade of Smart Homes for the Elderly in Web of Science: A Scientometric Review in CiteSpace"}, {"paperId": "d4186fea23b2dfa88221a0bcb8befaf042000b19", "title": "Fog-Based Smart Cardiovascular Disease Prediction System Powered by Modified Gated Recurrent Unit"}, {"paperId": "b93dd3cddcf792be1c01d1491d6c21cb8b2ed3d6", "title": "Improving Healthcare Facilities in Remote Areas Using Cutting-Edge Technologies"}, {"paperId": "4fcf1ad2499a20569aba3b5e3083b5532731738e", "title": "Prediction of Urinary Tract Infection in IoT-Fog Environment for Smart Toilets Using Modified Attention-Based ANN and Machine Learning Algorithms"}, {"paperId": "c8bf65b5eb972fea82c479f2526ba03653c8f082", "title": "Blockchain Application in Healthcare Systems: A Review"}, {"paperId": "c15efbad78e3d155dc87a85af6d440fc2e942f98", "title": "An Empirical Study on the Use of Digital Technologies to Achieve Cost-Effectiveness in Healthcare Management."}, {"paperId": "0c0925c6f5082ba2f392bb6fc48973bddc293120", "title": "Evolutionary Trends in Progressive Cloud Computing based Healthcare: Ideas, Enablers, and Barriers"}, {"paperId": "670604e67c38815fd363e2d7ae2a447171862255", "title": "Smart electronic medical record based on blockchain technology to combat Covid-19 pandemic"}, {"paperId": "63a7bce242f47e5ff435d78e8f50a8fb05945889", "title": "Fog Computing Service in the Healthcare Monitoring System for Managing the Real-Time Notification"}, {"paperId": "06df86ef799cb8d00298b9598fcf8881a84f0af6", "title": "Intelligent Load-Balancing Framework for Fog-Enabled Communication in Healthcare"}, {"paperId": "229778b1fd490f2452f635a4f0a5a21648ba1c44", "title": "Intelligent Reasoning Rules for Home Energy Management (IRRHEM): Algeria Case Study"}, {"paperId": "b1e0df0b86aab7316008343238c8299ac2318cf3", "title": "A generic and lightweight security mechanism for detecting malicious behavior in the uncertain Internet of Things using fuzzy logic- and fog-based approach"}, {"paperId": "f8019d919e847b214801863df6d51f3c2fdbae6c", "title": "Edge Enabled IoT System Model for Secure Healthcare"}, {"paperId": "b7034546bee38ba13d3b312fce893a22e33ce4dd", "title": "HealthBlock: A secure blockchain-based healthcare data management system"}, {"paperId": "8fd06983e0906e314b4ac21aa1b76033d764f035", "title": "The analysis of edge computing combined with cloud computing in strategy optimization of music educational resource scheduling"}, {"paperId": "a046734b9baa41d8698c9c4843db249a944747e2", "title": "Privacy Preserving Face Recognition in Cloud Robotics: A Comparative Study"}, {"paperId": "a565818665ff3ef5ccd97d5cc0bf709da9d219d4", "title": "One-Dimensional CNN Approach for ECG Arrhythmia Analysis in Fog-Cloud Environments"}]}
