{"paperId": "8861762cf05f2e1d54352ad1cc851ed9d35a9399", "publicationVenue": {"id": "7f92b1d2-f2b3-454d-adbe-ff02c83fe404", "name": "IEEE Conference on Computer Communications", "type": "conference", "alternate_names": ["INFOCOM", "IEEE Conf Comput Commun"], "url": "http://www.ieee-infocom.org/"}, "title": "Detecting Anomaly in Large-scale Network using Mobile Crowdsourcing", "abstract": "In this paper, we propose a tree modeling-based data mining method to detect anomalies from crowdsourced network data. We design an algorithm to extract potential network anomalies from decision trees. Moreover, we propose a criteria to evaluate the severity of anomaly in terms of three factors: standard deviation, weight sum and impurity decrease. To enhance generalization performance, we randomly generate sample subspace of the original dataset as the input for each subtree and compact detected anomalies from all subtrees. We carry out experiments based on the crowdsourced network measurement dataset containing five million samples, which contains round trip time (RTT) from more than 5,000 users. Experiments show that the proposed method can effectively detect high-latency network anomalies. Moreover, the random forest-based approach can achieve an improvement of approximately 25% of generalization performance compared to the single decision tree approach.", "venue": "IEEE Conference on Computer Communications", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-04-01", "journal": {"name": "IEEE INFOCOM 2019 - IEEE Conference on Computer Communications", "pages": "2179-2187"}, "authors": [{"authorId": "2154895303", "name": "Yang Li"}, {"authorId": "2981441", "name": "Jiachen Sun"}, {"authorId": "16038169", "name": "Wenguang Huang"}, {"authorId": "2394645", "name": "Xiaohua Tian"}], "citations": [{"paperId": "b165b8f2f713735a5d3c5934db2cf19a74288f08", "title": "In-Forest: Distributed In-Network Classification with Ensemble Models"}, {"paperId": "e4b0b78872f7bc50708789fcd15f508b8b2f8457", "title": "ProTrack: Detecting Proximity and Trajectory from Passive Wireless Traces of Mobile Devices"}, {"paperId": "28b78d3ec2a2b2cfe2e4ddc366b5a24aca1fdc11", "title": "Dynamic threshold strategy optimization for security protection in Internet of Things: An adversarial deep learning‐based game‐theoretical approach"}, {"paperId": "1eb1ba551e54d124844d984c82fa33364a323bd0", "title": "Reliable and Secure Data Sharing in Decentralized Mobile Crowd Systems"}, {"paperId": "a99168228cce1c5e4b309ecf0d0ae928457bb479", "title": "CoCo"}, {"paperId": "9ff6e09d97b5fa0616bbe5eba0b456cfffb2c4dd", "title": "Blockchain based Mobile Crowd Sensing for Reliable Data Sharing in IoT Systems"}, {"paperId": "ce4905152ba56a0aab3d6ac98df46193a8948b9a", "title": "ADA: Adaptive Deep Log Anomaly Detector"}, {"paperId": "9d13c6b39f7ea80b5b91dff29f5e682ed1436893", "title": "Towards Robust LiDAR-based Perception in Autonomous Driving: General Black-box Adversarial Sensor Attack and Countermeasures"}, {"paperId": "b8af8fc9048caf1afd17d2c66ed731fd9333fe33", "title": "RICERCANDO: Data Mining Toolkit for Mobile Broadband Measurements"}]}
