{"paperId": "887b2985b3f2417bf2278b0d7a6cddee04959c7b", "publicationVenue": {"id": "8e1bd4b5-d5b2-4e22-ba0a-01fe5568d472", "name": "Remote Sensing", "type": "journal", "alternate_names": ["Remote Sens"], "issn": "2315-4675", "alternate_issns": ["2072-4292"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169233", "alternate_urls": ["https://www.mdpi.com/journal/remotesensing", "http://www.mdpi.com/journal/remotesensing", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169233"]}, "title": "Minimax Bridgeness-Based Clustering for Hyperspectral Data", "abstract": "Hyperspectral (HS) imaging has been used extensively in remote sensing applications like agriculture, forestry, geology and marine science. HS pixel classification is an important task to help identify different classes of materials within a scene, such as different types of crops on a farm. However, this task is significantly hindered by the fact that HS pixels typically form high-dimensional clusters of arbitrary sizes and shapes in the feature space spanned by all spectral channels. This is even more of a challenge when ground truth data is difficult to obtain and when there is no reliable prior information about these clusters (e.g., number, typical shape, intrinsic dimensionality). In this letter, we present a new graph-based clustering approach for hyperspectral data mining that does not require ground truth data nor parameter tuning. It is based on the minimax distance, a measure of similarity between vertices on a graph. Using the silhouette index, we demonstrate that the minimax distance is more suitable to identify clusters in raw hyperspectral data than two other graph-based similarity measures: mutual proximity and shared nearest neighbours. We then introduce the minimax bridgeness-based clustering approach, and we demonstrate that it can discover clusters of interest in hyperspectral data better than comparable approaches.", "venue": "Remote Sensing", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-04-04", "journal": {"name": "Remote. Sens.", "pages": "1162", "volume": "12"}, "authors": [{"authorId": "3330401", "name": "S. L. Moan"}, {"authorId": "1868705", "name": "C. Cariou"}], "citations": [{"paperId": "31fdbbd5b9e6a468e1c89f3defea27e716bdbfe0", "title": "Connecting the Dots -- Density-Connectivity Distance unifies DBSCAN, k-Center and Spectral Clustering"}, {"paperId": "edf2b532dbe51994431d7830871e817119a6969c", "title": "A Semi-Supervised Reduced-Space Method for Hyperspectral Imaging Segmentation"}, {"paperId": "75ca83e1aab011bdd5e134e733d12ceaefa4ec8a", "title": "Nonlocal Means Regularized Sketched Reweighted Sparse and Low-Rank Subspace Clustering for Large Hyperspectral Images"}, {"paperId": "ab173a5b9dc3033b4887c0d63d959fc1cefb7fed", "title": "Improving K-Nearest Neighbor Approaches for Density-Based Pixel Clustering in Hyperspectral Remote Sensing Images"}, {"paperId": "4fc3f20e2630650fc4e99cceba0ff1d70f92d45b", "title": "Hyperspectral Imaging Tera Hertz System for Soil Analysis: Initial Results"}, {"paperId": "432e99d5541db45e3aee885dac6d4d0a0baf6171", "title": "Hyperspectral Image Clustering with Spatially-Regularized Ultrametrics"}, {"paperId": "7505827856ed47c82c1842026c0ab5e34516de29", "title": "Spatial and Cluster Structural Prior-Guided Subspace Clustering for Hyperspectral Image"}]}
