{"paperId": "887efa148132784f9a4b993c974cf30a97960a9b", "publicationVenue": {"id": "d0bfb97a-a20e-4896-9afe-1e63e459db20", "name": "Smart Cities", "alternate_names": ["Smart City"], "issn": "2624-6511", "alternate_issns": ["2731-3409"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-1343723", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-1343723", "https://www.mdpi.com/journal/smartcities"]}, "title": "Smart and Sustainable? Positioning Adaptation to Climate Change in the European Smart City", "abstract": "This article reports on the elements of adaptation to climate change in European Smart City initiatives in order to understand to what extent Smart Cities can be the answer in the fight against climate change. On the grounds of innovative efforts implemented in Barcelona, Rotterdam, and Vienna, we examine the opportunities and obstacles to both Smart Environment (defined as an axis of the Smart City) and adaptation to climate change, linking them together. As it is difficult to estimate the benefits of climate action in the short term due to often costly solutions, Smart City proposals could provide the economic incentive to create adaptive, energy-efficient, and sustainable societies. As the need for adaptive and resilient cities in the global context of climate change rises, the concept of Smart City might need to evolve into that of a Smart Sustainable City, positioning the environment at the core of its development. Results from this analysis suggest that the interaction between technology and nature can be enhanced when a Smart City approach promotes the integration of climate strategies and encourages the participation of citizens, something that is crucial since early adaptation efforts can safeguard smart infrastructure from climate impacts.", "venue": "Smart Cities", "year": 2020, "fieldsOfStudy": ["Business"], "publicationTypes": null, "publicationDate": "2020-06-01", "journal": {"name": "Smart Cities"}, "authors": [{"authorId": "47329732", "name": "C. García Fernández"}, {"authorId": "1867763", "name": "Daniel Peek"}], "citations": [{"paperId": "87c557593892c8d65e990803d57def3a37007e60", "title": "Geospatial modeling of climate change indices at Mexico City using machine learning regression"}, {"paperId": "cbb7ad88b64b545c541157144af29819218ee4c3", "title": "Evaluation of the Use of Permeable Interlocking Concrete Pavement in Chile: Urban Infrastructure Solution for Adaptation and Mitigation against Climate Change"}, {"paperId": "6923f04c33667fbcc4774a7210d120cba893dcee", "title": "Green facades support biodiversity in urban environment – A case study from Poland"}, {"paperId": "d7a3371535714dd978c3f4ac55f3457715d94f60", "title": "Can smart city planning enhance the sustainable transition of the E.U. capitals? A project and strategy-based smart, sustainable performance analysis in the programming period 2014-2020"}, {"paperId": "27b63fe753ed4aecd9ef6e197f38787cacd22395", "title": "Integration of Citizens’ Feelings and Feedback into the City Information Modeling Environment"}, {"paperId": "48a03e24bc9f67aaf3ca6aa1dd1d7ed608349c43", "title": "Disaster Risk Management and Spatial Planning: Evidence from the Fire-Stricken Area of Mati, Greece"}, {"paperId": "e604b81625f9af8d4eb8a08e5977d6f474d07695", "title": "Prosumers—A New Mindset for Citizens in Smart Cities"}, {"paperId": "e58e40c65085f1b57b220e3f6fbb122d589aadda", "title": "Greencoin as an AI-Based Solution Shaping Climate Awareness"}, {"paperId": "3f6dcc259fe59956f09ce5f76dd6741ace0ff492", "title": "Adapting to climate risks through cross-border investments: industrial vulnerability and smart city resilience"}, {"paperId": "a53615f420122a4a902914068e99bf0f9f147b97", "title": "Sustainable Development of Smart City Concept Linked to Limited Resources Abroad and in Slovakia"}, {"paperId": "8df0ae24abeb375fe0c169343c532cb745b39928", "title": "Effective Public Administration as a Tool for Building Smart Cities: The Experience of the Slovak Republic"}, {"paperId": "093e8d5bbca486d542f6dd7ddd402485854a24de", "title": "Towards Circulating and Ecological Sphere in Urban Areas: An Indicator-Based Framework for Food-Energy-Water Security Assessment in Nagpur, India"}, {"paperId": "f87d12477cb28780b599908b1ea0bdb4e5097385", "title": "Increasing the resistance of Mediterranean extensive green roofs by using native plants from old roofs and walls"}, {"paperId": "b766f63451a2af1e0d3ba7d235e1df3f32e0ca70", "title": "Evidence-Based Public Policy Decision-Making in Smart Cities: Does Extant Theory Support Achievement of City Sustainability Objectives?"}, {"paperId": "d5751579a70612e7405e4f6208a3a109c6527f83", "title": "An energy-efficient smart city for sustainable green tourism industry"}, {"paperId": "611752d7e3e20d2dd1f13b20124a5c12cfe64e26", "title": "Non-stationary Investigation of Extreme Rainfall"}, {"paperId": "077f1384102a22ac35187d6469ee0972a872b797", "title": "Towards a National Harmonized Framework for Urban Plans and Strategies in Romania"}, {"paperId": "64bf85db255da30cdb1ee07ca557d3edba3c6b03", "title": "Trend and nonstationary relation of extreme rainfall: Central Anatolia, Turkey"}, {"paperId": "ee53a30a12cc1811a8365c9f1cabb4456af9f0db", "title": "Toward indicators of the performance of US infrastructures under climate change risks"}, {"paperId": "f1002764b23247bf32d5814646c531f6f8df8cd8", "title": "Role of Smart Cities in Optimizing Water-Energy-Food Nexus: Opportunities in Nagpur, India"}, {"paperId": "9bde19d8ecf6322562f0ee033ccb12fe135410bb", "title": "Perceptions on Smart Gas Meters in Smart Cities for Reducing the Carbon Footprint"}, {"paperId": "88cefa31791f94a4e5eef6886ccf67ed233c7f26", "title": "Analiza gospodarske in okoljske trajnostnosti na\nMadžarskem: uspešnost mest z županijskimi\npravicami pri doseganju ciljev trajnostnega razvoja"}, {"paperId": "c714faafeef9874e7c80afd0423db83a434b5483", "title": "Analysing economic and environmental\nsustainability in Hungary: How cities with county\nrights perform in SDGs"}, {"paperId": "238108ea9ebd3b324d76940a5607f970274fb285", "title": "Ready for Climate Change? An Assessment of Measures Adopted by 45 Mediterranean Coastal Cities to Face Climate Change"}, {"paperId": "705c5326cc481675942a37225cf3dc0a701f754d", "title": "Smart City Needs a Smart Urban-Rural Interface. An Overview on Romanian Urban Transformations"}, {"paperId": "e25eed53ba59f5a224fea08d595a69e119733514", "title": "The Green Dimension in 11 Smart City Plans: Is There an Environmental Ethic Embedded in Long Term Strategic Commitments?"}, {"paperId": "44ef44ab5a7eda0be50966be4b348c2ddf2a6502", "title": "A Multicultural Tourism for Evaluating the Cultural Heritage: The Case Study of the Region of Sardinia (Italy)"}, {"paperId": "8d9efcc04a9867d8f410040d1a572ab3879ad522", "title": "Smart City Needs a Smart Urban-Rural Interface: An Overview on Romanian Urban Transformations"}]}
