{"paperId": "88801df237798b59dff338f6cded1fac89c4d3a3", "publicationVenue": {"id": "0f276dc7-7c36-4465-aab9-b358ee2dafa9", "name": "International Journal of Data Warehousing and Mining", "type": "journal", "alternate_names": ["Int J Data Warehous Min"], "issn": "1548-3924", "url": "http://www.idea-group.com/journals/details.asp?id=4291", "alternate_urls": ["https://www.igi-global.com/journal/international-journal-data-warehousing-mining/1085"]}, "title": "Logical and Physical Design of Spatial Non-Strict Hierarchies in Relational Spatial Data Warehouse", "abstract": "The emergence of spatial or geographic data in DW Systems defines new models that support the storage and manipulation of the data. The need to build an SDW and to optimize SOLAP queries continues to attract the interest of researchers in recent years. Several spatial data models have been investigated to extend classical multidimensional data models with spatial concepts. However, most of existing models do not handle a non-strict spatial hierarchy. Moreover, the complexity of the spatial data makes the execution time of spatial queries very considerable. Often, spatial indexation methods are applied to optimizing access to large volumes of data and helps reduce the cost of spatial OLAP queries. Most of existing indexes support predefined spatial hierarchies. The authors show, in this article, that the logical models proposed in the literature and indexing techniques are not suitable to non-strict hierarchies. The authors propose a new logical schema supporting the non-strict hierarchies and a bitmap index to optimize queries defined by spatial dimensions with several non-strict hierarchies.", "venue": "International Journal of Data Warehousing and Mining", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-01-01", "journal": {"name": "Int. J. Data Warehous. Min.", "pages": "1-18", "volume": "15"}, "authors": [{"authorId": "17326549", "name": "Ibtisam Ferrahi"}, {"authorId": "1719976", "name": "S. Bimonte"}, {"authorId": "3006590", "name": "K. Boukhalfa"}], "citations": [{"paperId": "b4b835c119052197464797b9e0438b284cb5df24", "title": "Healthcare Decision-Making Over a Geographic, Socioeconomic, and Image Data Warehouse"}, {"paperId": "cc1e9e8d298384337625949171847ff8401044cc", "title": "ADBIS, TPDL and EDA 2020 Common Workshops and Doctoral Consortium: International Workshops: DOING, MADEISD, SKG, BBIGAP, SIMPDA, AIMinScience 2020 and Doctoral Consortium, Lyon, France, August 25–27, 2020, Proceedings"}, {"paperId": "d7e9c14ba526d9a61a4a88088e91e27a5e0963a8", "title": "Developing Reliable Taxonomic Features for Data Warehouse Architectures"}, {"paperId": "977905527eaff053435db21951b7b0723f666a2b", "title": "Image Retrieval Using Intensity Gradients and Texture Chromatic Pattern: Satellite Images Retrieval"}]}
