{"paperId": "88822550a5864bf845d43672e00166b25c586a7f", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "IoT-Enabled Smart Cities: Evolution and Outlook", "abstract": "For the last decade the Smart City concept has been under development, fostered by the growing urbanization of the world’s population and the need to handle the challenges that such a scenario raises. During this time many Smart City projects have been executed–some as proof-of-concept, but a growing number resulting in permanent, production-level deployments, improving the operation of the city and the quality of life of its citizens. Thus, Smart Cities are still a highly relevant paradigm which needs further development before it reaches its full potential and provides robust and resilient solutions. In this paper, the focus is set on the Internet of Things (IoT) as an enabling technology for the Smart City. In this sense, the paper reviews the current landscape of IoT-enabled Smart Cities, surveying relevant experiences and city initiatives that have embedded IoT within their city services and how they have generated an impact. The paper discusses the key technologies that have been developed and how they are contributing to the realization of the Smart City. Moreover, it presents some challenges that remain open ahead of us and which are the initiatives and technologies that are under development to tackle them.", "venue": "Italian National Conference on Sensors", "year": 2021, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2021-06-30", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "21"}, "authors": [{"authorId": "144484538", "name": "M. Bauer"}, {"authorId": "49761616", "name": "Luis Sánchez"}, {"authorId": "145937249", "name": "Jaeseung Song"}], "citations": [{"paperId": "fbb7a7719b9b4efd6158c30a24520f28680c7af2", "title": "IoT-enabled smart cities: a hybrid systematic analysis of key research areas, challenges, and recommendations for future direction"}, {"paperId": "1ddd94286730c84cfc3f4d751005d0884eeef751", "title": "Towards an AI-Driven Data Reduction Framework for Smart City Applications"}, {"paperId": "0d792da2ea1d68f996b5f5c5df7fc858128643f3", "title": "Connecting the Indispensable Roles of IoT and Artificial Intelligence in Smart Cities: A Survey"}, {"paperId": "f95a28c04f2559d6c585bbceb97324e821a0ac88", "title": "The Role of Microelectronics for Smart Cities, Smart Grids and Industry 5.0: Challenges, Solutions, and Opportunities"}, {"paperId": "512f50853026e75457eaf3523bc10c1a22feaa8f", "title": "The Internet of Things-Enabled Smart City: An In-Depth Review of Its Domains and Applications"}, {"paperId": "3a2e41eb7d169cf964405d2f958deec535f8b61c", "title": "Smart city healthcare delivery innovations: a systematic review of essential technologies and indicators for developing nations"}, {"paperId": "c1ae67919da10332337e76262ce6498007d1b8e4", "title": "Concept Drift Challenges in the Internet of Things (IoT) Era of Smart Cities: A Preliminary Investigation"}, {"paperId": "9dbeb5b6a3d92329dc262fe0b4c36f3e0bc59a00", "title": "HELPFuL: Human Emotion Label Prediction Based on Fuzzy Learning for Realizing Artificial Intelligent in IoT"}, {"paperId": "d8c5d6e72a3637d3bb2572588f3122f9bdf33e16", "title": "Cybersecurity and Cyber Forensics for Smart Cities: A Comprehensive Literature Review and Survey"}, {"paperId": "e88ad8314530bcdb4e2317f77b2bda5b5960f111", "title": "Special Issue on the Internet of Things (IoT) in Smart Cities"}, {"paperId": "25b84313df06067aa3e0df26258d5681b65734b3", "title": "The Adoption of an Intelligent Waste Collection System in a Smart City"}, {"paperId": "cea9b03698ae20b40b46b57e1529e2426a8eda41", "title": "IoT-Based Smart Air Conditioner as a Preventive in the Post-COVID-19 Era: A Review"}, {"paperId": "8bdf783d9ff4b9912cac6b16888d0931d57e21a3", "title": "A Comparative Assessment of JVM Frameworks to Develop Microservices"}, {"paperId": "0125095b6567303082ca259be5e96202b7e58d78", "title": "Wastewater-based epidemiology for preventing outbreaks and epidemics in Latin America – Lessons from the past and a look to the future"}, {"paperId": "d0204aed871a3cdd0e23c763cea6dca5b28b61d0", "title": "Selection of IoT service provider for sustainable transport using q-rung orthopair fuzzy CRADIS and unknown weights"}, {"paperId": "af16553ff0efc6fe6539fd255dfa7c9f5fd4d63e", "title": "DIDS:A deep neural network based real-time intrusion detection system for IoT"}, {"paperId": "5bd2c50f8cf2fb97f09bcbd8006109538086e89a", "title": "An overview of Secure Communication in Smart Cities: Issues and Cryptographic Solution"}, {"paperId": "d475a488950fc78af18b7572a520019ff5c71318", "title": "Smart Cities after COVID-19: Building a conceptual framework through a multidisciplinary perspective"}, {"paperId": "126c56930ba587ecd79c367c391a810be34e3501", "title": "Aveiro Tech City Living Lab: A Communication, Sensing, and Computing Platform for City Environments"}, {"paperId": "a4e693779d439ac8c343dc0d7ebaa2fe60e57f4b", "title": "Research on Architectural Planning and Landscape Design of Smart City Based on Computational Intelligence"}, {"paperId": "7c6577b056f0b7ce98567c0f1f8638801bec186c", "title": "The Dual Role of Artificial Intelligence in Developing Smart Cities"}, {"paperId": "2fcd85857bba82c417813e83b46c983f4e39acc5", "title": "The Path of Digital Government and University Asset Intelligence Value-Added Service Driven by Block Chain Technology"}, {"paperId": "84803788ace001524475b8382972c8ba143eea6d", "title": "IoT-Enabled Smart Cities: A Review of Concepts, Frameworks and Key Technologies"}, {"paperId": "42d965df319de90770b223a773e5232c73faf073", "title": "Modeling an Edge Computing Arithmetic Framework for IoT Environments"}, {"paperId": "2e471a79d51fe00b4709a7b8d70d6154e68354ba", "title": "GaN Transistors’ Radiated Switching Noise Source Evidenced by Hall Sensor Experiments Toward Integration"}, {"paperId": "b9ee5237498ec228a23e191cb41cf9382613aa01", "title": "Implementation of Augmented Reality and Drones to Serve Smart Cities"}]}
