{"paperId": "88a8e2cd491b49e33013f77edd93fbb428d1a93b", "publicationVenue": {"id": "48433268-b689-457a-8e57-36895fd4f04e", "name": "Computing", "type": "journal", "issn": "0010-485X", "url": "https://link.springer.com/journal/607"}, "title": "Development of a methodology for cost optimization of software testing for the automatically tests generation", "abstract": "The paper is devoted to issues of software development and support processes, in particular, for software testing. The task of developing a methodology for testing has been solved. It allows optimizing the company's costs for the automatically tests generation. The widely applied software quality control practices were analyzed; the requirements for the developed method were formulated. The IT infrastructure for software quality control has been designed on the basis of the developed methodology. A new result of the research is tools representation for the automatically qualitative tests generation that does not require a significant transformation of the architecture of the software under the test. The presented solution can help companies to optimize significantly their costs for quality control of the developed software. The object for the analysis and implementation of solutions was a company that is a specialized depository, i.e, a participant of the securities market. Its information system is a complex multi-module product. The best practice for increasing the reliability of software, i.e., code coverage with tests has been implemented for it. The task was to find automatically generating tests solution to support the business processes of a specialized depository.", "venue": "Computing", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": {"name": "Proceedings of the III International Workshop on Modeling, Information Processing and Computing (MIP: Computing-2021)"}, "authors": [{"authorId": "2119067942", "name": "Alexander A. Platonov"}, {"authorId": "12007876", "name": "N. Mamedova"}], "citations": []}
