{"paperId": "88ab95fc5e0519ffb21e72c02f0069f59e119b1c", "publicationVenue": null, "title": "Security Algorithms for Privacy Protection and Security in Aadhaar", "abstract": "Government is enforcing the citizens to link Aadhaar details with various government services to provide services to right beneficiaries. At the same time resident of India are worried about their privacy and security. In recent months, many cases of fraudulent increased the worry of all citizens. The Aadhaar project is the largest biometric identity project, a great initiative taken by the Planning Commission of India in 2009.The project has taken care of all aspects of privacy protection and security issues. Then after the fraudulent and theft of identity related issues keep on taking place. In this paper, various security measures are discussed which can be implemented to be safe from insider’s attacks. Authentication, Authorization, Data Encryption, Security against various attacks are the key levels of data and information security in the Hadoop environment. In recent years, various efforts made to manage more effectively each and every level of security. Kerberos is one such effort in order to attain Authentication and Authorization and it succeeded in doing so, but with the attackers having new technologies and hacking tools attackers can easily bypass the security provided by Hadoop's Kerberos Authentication system and then the data at storage level is unencrypted can easily be stolen or damaged which is a big concern. A new encryption technique to secure data in HDFS environment is the combination of AES and Map Reduce. It performs encryption in parallel using AES-MR (an Advanced Encryption standard based encryption using Map Reduce) technique in Map Reduce paradigm. To provide network security Quantum Cryptography and Biometric based Security solution using BB84 protocol is suggested protocol. This paper also explained the various suggested algorithms and security measure to implement on the Network level security Layer, Database level Security Layer and Application Level security Layer.", "venue": "", "year": null, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "67288201", "name": "Arpana Chaturvedi"}, {"authorId": "2288161542", "name": "Dr. Meenu Dave"}, {"authorId": "2288750790", "name": "Dr. Vinay Kumar"}], "citations": [{"paperId": "8fbb56b17282b69aaeeab681f002611e40cdd9ee", "title": "A critical survey of the security and privacy aspects of the Aadhaar framework"}, {"paperId": "e241a84cff7d6796a990b12b219072f3625d52c5", "title": "A Comprehensive Survey of Aadhar and Security Issues"}]}
