{"paperId": "890f8039aa05b4d671fff0f6ba563a01654a93f8", "publicationVenue": {"id": "5b12c785-cf12-40ca-b4d1-aefd13b26e39", "name": "Intelligent Data Analysis", "type": "journal", "alternate_names": ["Intell Data Anal"], "issn": "1088-467X", "url": "http://content.iospress.com/journals/intelligent-data-analysis", "alternate_urls": ["http://www.iospress.nl/intelligent-data-analysis/"]}, "title": "Efficient frequent subgraph mining on large streaming graphs", "abstract": ". We propose an efﬁcient, approximate algorithm to solve the problem of ﬁnding frequent subgraphs in large streaming graphs. The graph stream is treated as batches of labeled nodes and edges. Our proposed algorithm ﬁnds the set of frequent subgraphs as the graph evolves after each batch. The computational complexity is bounded to linear limits by looking only at the changes made by the most recent batch, and the historical set of frequent subgraphs. As a part of our approach, we also propose a novel sampling algorithm that samples regions of the graph that have been changed by the most recent update to the graph. The performance of the proposed approach is evaluated using ﬁve large graph datasets, and our approach is shown to be faster than the state of the art large graph miners while maintaining their accuracy. We also compare our sampling algorithm against a well known sampling algorithm for network motif mining, and show that our sampling algorithm is faster, and capable of discovering more types of patterns. We provide theoretical guarantees of our algorithm’s accuracy using the well known Chernoff bounds, as well as an analysis of the computational complexity of our approach.", "venue": "Intelligent Data Analysis", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-02-20", "journal": {"name": "Intell. Data Anal.", "pages": "103-132", "volume": "23"}, "authors": [{"authorId": "2064768676", "name": "A. Ray"}, {"authorId": "144468194", "name": "L. Holder"}, {"authorId": "1762931", "name": "A. Bifet"}], "citations": [{"paperId": "b5ef4389387244d9da5f02eaaa2704bd0a657079", "title": "Modeling Complex Object Changes in Satellite Image Time-Series: Approach based on CSP and Spatiotemporal Graph"}, {"paperId": "4e73232c79d88375a34a543547896d51f7dd99df", "title": "A New Method Combining Pattern Prediction and Preference Prediction for Next Basket Recommendation"}, {"paperId": "11b496aa22865f1386c2defccbf035c13317bbae", "title": "Online Sampling of Temporal Networks"}, {"paperId": "1cb325539a65c9718ffc4462954c5cac06c7a3b5", "title": "Authorship Verification using a Graph Knowledge Discovery Approach"}, {"paperId": "53707d51e9d0c5d904aa229607919e62a49aca63", "title": "Sensitive integration of multilevel optimization model in human activity recognition for smartphone and smartwatch applications"}, {"paperId": "35891336d706727555c8b043fa00990456834dd9", "title": "Supergraph Topology Feature Index for Personalized Interesting Subgraph Query in Large Labeled Graphs"}, {"paperId": "3f8d21663590a81ebcce2c8b5836e8295b7b9fb6", "title": "Scheduling Activities of Smart Phone and Smart Watch Based on Optimal Pattern Model (SA-OPM)"}, {"paperId": "9e327bf4c7c4e1244209cc48f8902b4966cf4f1d", "title": "Multi-fuzzy-constrained graph pattern matching with big graph data"}]}
