{"paperId": "8912ec5e34f6741566e4d31d8bd65d6f23d6bc0d", "publicationVenue": {"id": "7268156f-34a0-4e6f-b464-09b5631f9052", "name": "Logistique & Management", "alternate_names": ["Logistique  Manag"], "issn": "1250-7970", "url": "https://www.tandfonline.com/action/journalInformation?journalCode=tlam20"}, "title": "Proposition d’une échelle de mesure de la transparence informationnelle : le rôle clé de la compréhension de l’information partagée", "abstract": "Résumé En dépit des efforts de la littérature pour comprendre la notion de transparence au sein des supply chains, en théorie comme en pratique, cette notion souffre d’une certaine hétérogénéité. Cette recherche se concentre sur les aspects informationnels de la transparence. Une revue de la littérature de la transparence informationnelle (TI), ancrée dans la théorie du traitement organisationnel de l’information (TTOI), permet d’établir que les dimensions retenues pour appréhender ce concept portent essentiellement sur des aspects objectifs de l’information, comme la précision et l’accessibilité de l’information dont le rôle est d’atténuer l’incertitude, et plus rarement sur des aspects plus subjectifs et cognitifs comme la compréhension de l’information partagée permettant de répondre à l’ambiguïté. Alors que la TTOI préconise de combiner des dimensions permettant à la fois d’atténuer l’incertitude et l’ambiguïté pour garantir le caractère effectif de la TI, les mesures proposées dans la littérature empirique sont pour l’essentiel unidimensionnelles, les rares mesures multidimensionnelles de tiennent pas compte de la complémentarité des dimensions. Pour répondre à cette problématique, cet article propose de conceptualiser, instrumentaliser et tester sur la base du paradigme de Churchill, une échelle de mesure intégrative de la TI tenant compte de la complémentarité des dimensions suggérées par la TTOI. L’échelle ainsi obtenue enrichit la littérature antérieure en révélant que la dimension subjective est non seulement complémentaire aux dimensions objectives, mais exerce également un rôle prédominant. Ce dernier résultat suggère des perspectives de recherche sur l’interprétation collective des informations partagées dans le cadre de la transparence des.", "venue": "Logistique & Management", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-07-01", "journal": {"name": "Logistique & Management", "pages": "212 - 227", "volume": "29"}, "authors": [{"authorId": "1481063230", "name": "Benyamin Aghhavani-Shajari"}, {"authorId": "2063076805", "name": "S. Brion"}], "citations": [{"paperId": "d72158d72734c6e8f2b82ada0ccc5660756f4506", "title": "La transparence informationnelle et son impact sur la performance opérationnelle dyadique : vers une approche configurationnelle"}, {"paperId": "4f688231e5757c154a7875beadbdfde27ea8a571", "title": "Relever les défis associés à l’adoption d’un processus S&OP : une étude de cas en contexte nord-américain"}]}
