{"paperId": "8914bd5964177558cf3c50b037bdb08f3eabdbae", "publicationVenue": null, "title": "Big Data Algorithms Adapted to Vehicular Networks for Driver's Behavior Modeling. (Algorithmes de Big Data adaptés aux réseaux véhiculaires pour modélisation decomportement de conducteur)", "abstract": "Les technologies Big Data gagnent de plus en plus d’attentions de communautes de recherches variees, surtout depuis que les donnees deviennent si volumineuses, qu’elles posent de reels problemes, et que leurs traitements ne sont maintenant possibles que grâce aux grandes capacites de calculs des equipements actuels. De plus, les reseaux vehiculaires, aussi appeles VANET pour Vehicular Ad-hoc Networks, se developpent considerablement et ils constituent une part de plus en plus importante du marche du vehicule. La topologie de ces reseaux en constante evolution est accompagnee par des donnees massives venant d’un volume croissant de vehicules connectes. Dans cette these, nous discutons dans notre premiere contribution des problemes engendres par la croissance rapide des VANET, et nous etudions l’adaptation des technologies liees aux Big Data pour les VANET. Ainsi, pour chaque etape cle du Big Data, nous posons le probleme des VANET. Notre seconde contribution est l’extraction des caracteristiques liees aux VANET afin d’obtenir des donnees provenant de ceux-ci. Pour ce faire, nous discutons de comment etablir des scenarios de tests, et comment emuler un environnement afin, dans un premier temps, de tester une implementation dans un environnement controle, avant de pouvoir effectuer des tests dans un environnement reel, afin d’obtenir de vraies donnees provenant des VANET. \nPour notre troisieme contribution, nous proposons une approche originale de la modelisation du comportement de conducteur. Cette approche est \nbasee sur un algorithme permettant d’extraire des representants d’une population, appeles exemplaires, en utilisant un concept de densite locale dans un voisinage.", "venue": "", "year": 2018, "fieldsOfStudy": ["Computer Science", "Political Science"], "publicationTypes": null, "publicationDate": "2018-12-03", "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "3446739", "name": "Emilien Bourdy"}], "citations": [{"paperId": "7724f772ed5ca99862f5900ca6bc76bc9b3f304d", "title": "Improving Recommendation Accuracy Using Social Network of Owners in Social Internet of Vehicles"}, {"paperId": "24f09bb1592eae2d2c9afdb34f7c07f98c36d4d3", "title": "An Agent-Based Simulation of an Adaptive Social Internet of Vehicles Recommendation System"}, {"paperId": "3921dfa9b9eac1ac2b062653b90adea21e83384e", "title": "Feasibility of Recommendation System Mediated by Social Internet of Vehicles"}]}
