{"paperId": "891c68cb339ba3736cb96832bb516fe4d71cf845", "publicationVenue": {"id": "e95c8d18-09be-464f-a3cf-5b2637f0eff6", "name": "Algorithms", "type": "journal", "issn": "1999-4893", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-150910", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-150910", "http://www.mdpi.com/journal/algorithms", "http://www.mdpi.com/journal/algorithms/"]}, "title": "CVE2ATT&CK: BERT-Based Mapping of CVEs to MITRE ATT&CK Techniques", "abstract": "Since cyber-attacks are ever-increasing in number, intensity, and variety, a strong need for a global, standardized cyber-security knowledge database has emerged as a means to prevent and fight cybercrime. Attempts already exist in this regard. The Common Vulnerabilities and Exposures (CVE) list documents numerous reported software and hardware vulnerabilities, thus building a community-based dictionary of existing threats. The MITRE ATT&CK Framework describes adversary behavior and offers mitigation strategies for each reported attack pattern. While extremely powerful on their own, the tremendous extra benefit gained when linking these tools cannot be overlooked. This paper introduces a dataset of 1813 CVEs annotated with all corresponding MITRE ATT&CK techniques and proposes models to automatically link a CVE to one or more techniques based on the text description from the CVE metadata. We establish a strong baseline that considers classical machine learning models and state-of-the-art pre-trained BERT-based language models while counteracting the highly imbalanced training set with data augmentation strategies based on the TextAttack framework. We obtain promising results, as the best model achieved an F1-score of 47.84%. In addition, we perform a qualitative analysis that uses Lime explanations to point out limitations and potential inconsistencies in CVE descriptions. Our model plays a critical role in finding kill chain scenarios inside complex infrastructures and enables the prioritization of CVE patching by the threat level. We publicly release our code together with the dataset of annotated CVEs.", "venue": "Algorithms", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-08-31", "journal": {"name": "Algorithms", "pages": "314", "volume": "15"}, "authors": [{"authorId": "9334521", "name": "Octavian Grigorescu"}, {"authorId": "2064259375", "name": "Andreea Nica"}, {"authorId": "2059094747", "name": "Mihai Dascalu"}, {"authorId": "145441542", "name": "R. Rughinis"}], "citations": [{"paperId": "80b56ad13df83b8c0f58164b48823ea9c6cf0f1c", "title": "Symbiotic Game and Foundation Models for Cyber Deception Operations in Strategic Cyber Warfare"}, {"paperId": "e68b8794b9aeac0f02a1821e8ed6174ee27424f8", "title": "Automated Discovery and Mapping ATT&CK Tactics and Techniques for Unstructured Cyber Threat Intelligence"}, {"paperId": "16bce0a70e7091bc51c010e9decd15fc0c9ef12b", "title": "Improving Threat Mitigation Through a Cybersecurity Risk Management Framework: A Computational Design Science Approach"}, {"paperId": "94a9d9e240c7a9633986db0820a49fbbccd45c37", "title": "Analyzing Threat Vectors in ICS Cyberattacks"}, {"paperId": "786323935fb3882f7eba207e9c171df4741e2a22", "title": "Automated Mapping Method for Sysmon Logs to ATT&CK Techniques by Leveraging Atomic Red Team"}, {"paperId": "626c6bc0480cf70ef3572f385156941ea9b21797", "title": "Intell-dragonfly: A Cybersecurity Attack Surface Generation Engine Based On Artificial Intelligence-generated Content Technology"}, {"paperId": "f5094f5f0a7c5639ed8cb9da4c5ffb4bfd18ab9c", "title": "Towards Evaluation and Understanding of Large Language Models for Cyber Operation Automation"}, {"paperId": "7978cd0aeb91f756ae50fd583d1e140bebd95489", "title": "CVE-driven Attack Technique Prediction with Semantic Information Extraction and a Domain-specific Language Model"}, {"paperId": "95776afe8393bd754ff49ba46d7a201c1af7fc60", "title": "Special Issue \"AI for Cybersecurity: Robust Models for Authentication, Threat and Anomaly Detection\""}, {"paperId": "f9bed5eb19623aa30703c5a40923d30db973257d", "title": "ICAR, a categorical framework to connect vulnerability, threat and asset managements"}, {"paperId": "7924fc452ed88c0ec134205a5634689cc5d2fce3", "title": "Evaluation of Feature Engineering Techniques for Improving CVE Vulnerability Classification"}, {"paperId": "5943d1d95d49aec516cb621319153e37b3c21e46", "title": "Identifying missing relationships of CAPEC attack patterns by transformer models and graph structure"}, {"paperId": "facfb331673cec2352a4c7a3d33ca22eae0df011", "title": "SoK: The MITRE ATT&CK Framework in Research and Practice"}, {"paperId": "8f308c998215e518aa8109323d518cc8d7899454", "title": "Adversarial Technique Validation & Defense Selection Using Attack Graph & ATT&CK Matrix"}, {"paperId": "ec6f04282353dfaf1ccc6afc1dc31cecc4c7234c", "title": "Analysis of Common Vulnerabilities and Exposures to Produce Security Trends"}, {"paperId": "0b0cb449977abc4fd7bc124d52c8ea4919a16082", "title": "Model for Describing Processes of AI Systems Vulnerabilities Collection and Analysis using Big Data Tools"}]}
