{"paperId": "8926b70755579ad411f2a8972ea1d88c648a5a7d", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Physiological Signals-Driven Personal Thermal Comfort System Based on Environmental Intervention", "abstract": "The primary objective of personal thermal comfort (PTC) is to enhance overall quality of life, encompassing well-being, productivity, and health. PTC necessitates the measurement of physiological responses and occupant preferences to generate intricate and dynamic comfort-related knowledge. This study introduces a comprehensive comfort-related processing framework that integrates physiological, environmental, and individual factors, examining physiological signals through occupant preference measurements within interventional chambers. Physiological signals, including skin temperature, heart rate, electrodermal activity, and airflow, are employed to portray an occupant’s physiological response to essential feature parameters. Additionally, variables such as age, sex, and body mass index are utilized to represent occupant preferences. The results reveal a highly significant relationship (p < 0.01) between physiological responses, taste, and satisfaction. This information serves as inputs to assist standard machine learning (ML) algorithms, categorized into probability, geometry, and logical expression, in encoding PTC and effectively predicting occupant satisfaction. The outcomes demonstrate that the logical decision tree, representing logical expression, along with k-nearest neighbors and artificial neural networks, representing geometry, achieved approximately 90%, 89%, and 80% of the average F-measure, respectively. These models exhibit superior accuracy in predicting individual occupant satisfaction compared to traditional approaches. This suggests their natural suitability for PTC-requiring intelligent systems.", "venue": "IEEE Access", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "142903-142915", "volume": "11"}, "authors": [{"authorId": "40372233", "name": "Bukhoree Sahoh"}, {"authorId": "2274857832", "name": "Paweena Chaithong"}, {"authorId": "2274854039", "name": "Fayaz Heembu"}, {"authorId": "101988917", "name": "K. Yeranee"}, {"authorId": "2992036", "name": "Yunyong Punsawad"}], "citations": []}
