{"paperId": "892af2476f8cdc6409400bf7a02be6fc8d23b3c7", "publicationVenue": {"id": "6dcf82ac-7373-43d7-9939-cdc8dcc3fd2f", "name": "IAES International Journal of Artificial Intelligence (IJ-AI)", "type": "journal", "alternate_names": ["IAES Int J Artif Intell", "IAES International Journal of Artificial Intelligence", "IAES Int J Artif Intell (IJ-AI"], "issn": "2089-4872", "url": "http://iaesjournal.com/online/index.php/IJAI"}, "title": "Classification of customer churn prediction model for telecommunication industry using analysis of variance", "abstract": "Customer predictive analytics has shown great potential for effective churn models. Thriving in today's telecommunications industry, discerning between consumers who are likely to migrate to a competitor is enormous. Having reliable predictive client behavior in the future is required. Machine learning algorithms are essential to predict customer turnovers, and researchers have proposed various techniques. Churn prediction is a problem due to the unequal dispersal of classes. Most traditional machine learning algorithms are ineffective in classifying data. Client cluster with a higher risk has been discovered. A support vector machine is employed as the foundational learner, and a churn prediction model is constructed based on each analysis of variance. The separation of churn data revealed by experimental assessment is recommended for churn prediction analysis. Customer attrition is high, but an instantaneous support can ensure that customer needs are addressed and assess an employee's capacity to achieve customer satisfaction. This study uses an analysis of variance (ANOVA) with a support vector machine (SVM), classification in analyzing risks in telecom systems It may be determined that SVM provides the most accurate forecast of customer turnover (95%). The projected outcomes will allow other organizations to assess possible client turnover and collect customer feedback.", "venue": "IAES International Journal of Artificial Intelligence (IJ-AI)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-09-01", "journal": {"name": "IAES International Journal of Artificial Intelligence (IJ-AI)"}, "authors": [{"authorId": "70311152", "name": "R. Babatunde"}, {"authorId": "2212974940", "name": "Sulaiman Olaniyi Abdulsalam"}, {"authorId": "2212982690", "name": "Olanshile Abdulkabir Abdulsalam"}, {"authorId": "2213257022", "name": "Micheal Olaolu Arowolo"}], "citations": [{"paperId": "824aff734740550aad44570de46cf4508f6918f9", "title": "A novel artificial intelligent-based approach for real time prediction of telecom customer’s coming interaction"}]}
