{"paperId": "893150f171bd7656d86a56c1026e6129d265a957", "publicationVenue": {"id": "764e3630-ddac-4c21-af4b-9d32ffef082e", "name": "IEEE International Conference on Data Engineering", "type": "conference", "alternate_names": ["ICDE", "Int Conf Data Eng", "IEEE Int Conf Data Eng", "International Conference on Data Engineering"], "url": "http://www.wikicfp.com/cfp/program?id=1331"}, "title": "TeGraph: A Novel General-Purpose Temporal Graph Computing Engine", "abstract": "Temporal graphs attach time information to edges and are commonly used for implementing time-critical applications that can not be effectively processed by traditional static and dynamic graph processing engines. State-of-the-art solutions that target temporal path problems remain ad-hoc and often suboptimal. A unified and high-performance solution that could efficiently process general temporal path problems via a universal optimization strategy and relieve practitioners from heavy optimization efforts is in urgent demand. In this paper, we make two key observations: (1) temporal path problems can be described as topological-optimum problems and solved by a universal single scan execution model; and (2) data redundancy commonly occurs in the native format of the transformed temporal graphs, which is unnecessary for information propagation and can be eliminated for better memory utilization and execution efficiency. Based on these core insights, we propose TegRaph, the first general-purpose temporal graph computing engine to provide a unified optimization strategy and execution model for general temporal path problems and their applications. TegRaph not only presents temporal information-aware graph representation that naturally fits temporal graphs but also offers general system-level supports such as out-of-core execution. Extensive evaluation reveals that TegRaph can achieve significant speedups over the state-of-the-art designs with up to two orders of magnitude (241×) with the throughput of two hundred million edges per second.", "venue": "IEEE International Conference on Data Engineering", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-05-01", "journal": {"name": "2022 IEEE 38th International Conference on Data Engineering (ICDE)", "pages": "578-592"}, "authors": [{"authorId": "40879604", "name": "Chengying Huan"}, {"authorId": "2155504216", "name": "Hang Liu"}, {"authorId": "9990171", "name": "Mengxing Liu"}, {"authorId": "2916386", "name": "Yongchao Liu"}, {"authorId": "2087126495", "name": "Changhua He"}, {"authorId": "1680073", "name": "Kang Chen"}, {"authorId": "1699531", "name": "Jinlei Jiang"}, {"authorId": "2115858706", "name": "Yongwei Wu"}, {"authorId": "1798309", "name": "S. Song"}], "citations": [{"paperId": "a01fd8bb8b6e3192122da318925c3c8e8f432c12", "title": "Kairos: Efficient Temporal Graph Analytics on a Single Machine"}, {"paperId": "62cc7294101aadb79acb8996af4e1261bcb81924", "title": "SciDG: Benchmarking Scientific Dynamic Graph Queries"}, {"paperId": "430c1151c3f58149a256fb2c21544031805ed86d", "title": "TEA: A General-Purpose Temporal Graph Random Walk Engine"}, {"paperId": "a1162fa7e6e09872341001175c39a8662d41162b", "title": "T-GCN: A Sampling Based Streaming Graph Neural Network System with Hybrid Architecture"}, {"paperId": "3e190752057e4d54f655a90de45a28fb876cacd3", "title": "GraphTheta: A Distributed Graph Neural Network Learning System With Flexible Training Strategy"}]}
