{"paperId": "893a75dabd6f69070b15ffd20ba2273d81f7bf8c", "publicationVenue": {"id": "130f7aa7-1552-45e2-a924-46e8efee92d5", "name": "IEEE Micro", "type": "journal", "issn": "0272-1732", "url": "http://www.computer.org/micro/", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=40"]}, "title": "FPGA-Based Near-Memory Acceleration of Modern Data-Intensive Applications", "abstract": "Modern data-intensive applications demand high computational capabilities with strict power constraints. Unfortunately, such applications suffer from a significant waste of both execution cycles and energy in current computing systems due to the costly data movement between the computation units and the memory units. Genome analysis and weather prediction are two examples of such applications. Recent field-programmable gate arrays (FPGAs) couple a reconfigurable fabric with high-bandwidth memory (HBM) to enable more efficient data movement and improve overall performance and energy efficiency. This trend is an example of a paradigm shift to near-memory computing. We leverage such an FPGA with HBM for improving the prealignment filtering step of genome analysis and representative kernels from a weather prediction model. Our evaluation demonstrates large speedups and energy savings over a high-end IBM POWER9 system and a conventional FPGA board with DDR4 memory. We conclude that FPGA-based near-memory computing has the potential to alleviate the data movement bottleneck for modern data-intensive applications.", "venue": "IEEE Micro", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-06-11", "journal": {"name": "IEEE Micro", "pages": "39-48", "volume": "41"}, "authors": [{"authorId": "2117029302", "name": "Gagandeep Singh"}, {"authorId": "3387282", "name": "M. Alser"}, {"authorId": "70029851", "name": "Damla Senol Cali"}, {"authorId": "2810385", "name": "D. Diamantopoulos"}, {"authorId": "1388812849", "name": "Juan Gómez-Luna"}, {"authorId": "1684335", "name": "H. Corporaal"}, {"authorId": "145929920", "name": "O. Mutlu"}], "citations": [{"paperId": "2bdc168ed2a4b40d9e86bf37549038a5686a226e", "title": "SmartDIMM: In-Memory Acceleration of Upper Layer Protocols"}, {"paperId": "c9edf92c1f762c52a90cc0cb45eb06d4eed82110", "title": "MIMDRAM: An End-to-End Processing-Using-DRAM System for High-Throughput, Energy-Efficient and Programmer-Transparent Multiple-Instruction Multiple-Data Computing"}, {"paperId": "d5f2e95be45d3e003655a9a84e0adda9468b0838", "title": "MIMDRAM: An End-to-End Processing-Using-DRAM System for High-Throughput, Energy-Efficient and Programmer-Transparent Multiple-Instruction Multiple-Data Processing"}, {"paperId": "41ec37fd77d67f625230d180dd7db69fca4ad4d3", "title": "A Near-Memory Dynamically Programmable Many-Core Overlay"}, {"paperId": "06bf7a094c9560ba31858fb04a956f70073c029a", "title": "A Framework for Designing Efficient Deep Learning-Based Genomic Basecallers"}, {"paperId": "8f0599b5cc3944f8cb7daa4b957991ab22615bab", "title": "Mathematical Framework for Optimizing Crossbar Allocation for ReRAM-based CNN Accelerators"}, {"paperId": "57c4c25fbdfaafd31d74ae80838ccfd64851b1a3", "title": "XFM: Accelerated Software-Defined Far Memory"}, {"paperId": "22efe680dcc09f1d3d02ee00b9b0750955e4ec7c", "title": "Design and Implementation of Data-Intensive Application using Memory Expansion Device"}, {"paperId": "711910e69879e512fde3f591eca5447a46625e00", "title": "SimplePIM: A Software Framework for Productive and Efficient Processing-in-Memory"}, {"paperId": "87411e3dc48b89cc8a1f4138f80977b4f60301c2", "title": "GateSeeder: Near-memory CPU-FPGA Acceleration of Short and Long Read Mapping"}, {"paperId": "7a391064a366fb8dfb550ea29ed3a4e292a1c207", "title": "Lightning Talk: Memory-Centric Computing"}, {"paperId": "9a7a09a1884b1b76aa606918d879253277a4d448", "title": "Retrospective: A Scalable Processing-in-Memory Accelerator for Parallel Graph Processing"}, {"paperId": "a490646bc1857939c94f9593d8398832fde0aeac", "title": "CPU-free Computing: A Vision with a Blueprint"}, {"paperId": "bf535f6d604a66918d1a79df78e2ccf765530c55", "title": "Breaking Boundaries: Optimizing FPGA CAD with Flexible and Multi-threaded Re-Clustering"}, {"paperId": "56b85672e02fb1800c2f7a529c756f8e4ce4e40a", "title": "Memory-Centric Computing"}, {"paperId": "b86582bf2deb699c3bcd46a09f0d4eeda405fb0c", "title": "SuperCut: Communication-Aware Partitioning for Near-Memory Graph Processing"}, {"paperId": "03cc4c5afac8a0c311fdfa3ac0926a0d0e028bad", "title": "Invited: Accelerating Genome Analysis via Algorithm-Architecture Co-Design"}, {"paperId": "957261ddc91cef0d32e5b430a4d512eba7270aab", "title": "Space Efficient Sequence Alignment for SRAM-Based Computing: X-Drop on the Graphcore IPU"}, {"paperId": "06444c5756a513124b35300d1374f0e34df12990", "title": "Evaluating Machine LearningWorkloads on Memory-Centric Computing Systems"}, {"paperId": "2e81b5a00dbb324e8f7d29f556a5a40f446f2c81", "title": "SPARTA: Spatial Acceleration for Efficient and Scalable Horizontal Diffusion Weather Stencil Computation"}, {"paperId": "8f30d325b555bd0b1cb61e55ed44a67e4b2ce2c4", "title": "The Memory-Bounded Speedup Model and Its Impacts in Computing"}, {"paperId": "f75e5d8cb6d3c10cf15c5011870e436320af59c6", "title": "RawHash: enabling fast and accurate real-time analysis of raw nanopore signals for large genomes"}, {"paperId": "57b84d0b1bb0cbf0725762d5b00ec22037645184", "title": "A sparse matrix vector multiplication accelerator based on high-bandwidth memory"}, {"paperId": "0c7607f8da3936420c778a6418e2ea5d89f7775c", "title": "DRAM Bender: An Extensible and Versatile FPGA-Based Infrastructure to Easily Test State-of-the-Art DRAM Chips"}, {"paperId": "5be7859c83248307d0efaad13874cba9c8880fce", "title": "Accelerating Time Series Analysis via Processing using Non-Volatile Memories"}, {"paperId": "33a976423a7e46650d09193a5dc9691ba1f1dbe1", "title": "RUBICON: a framework for designing efficient deep learning-based genomic basecallers"}, {"paperId": "204ec35646fcea9223a1f8f5b93da3586f46690a", "title": "GenPIP: In-Memory Acceleration of Genome Analysis via Tight Integration of Basecalling and Read Mapping"}, {"paperId": "8c725a22bef2de556ef4a780de0e923cb957b82c", "title": "LEAPER: Fast and Accurate FPGA-based System Performance Prediction via Transfer Learning"}, {"paperId": "425a24794315ce83c53025d513059eaeffd44f2f", "title": "Scrooge: a fast and memory-frugal genomic sequence aligner for CPUs, GPUs, and ASICs"}, {"paperId": "13f55ea705e9af6bcea883694d26fb4d6e3b79cc", "title": "From molecules to genomic variations: Accelerating genome analysis via intelligent algorithms and architectures"}, {"paperId": "6445ef7945bbc2d231176e959b9cadce04acef23", "title": "ApHMM: Accelerating Profile Hidden Markov Models for Fast and Energy-Efficient Genome Analysis"}, {"paperId": "e827a686216beadd08a5d2840c24ed470e521a94", "title": "An Experimental Evaluation of Machine Learning Training on a Real Processing-in-Memory System"}, {"paperId": "d2d3436259017029bbf084e01626a488b304fe53", "title": "GenStore: In-Storage Filtering of Genomic Data for High-Performance and Energy-Efficient Genome Analysis"}, {"paperId": "2aee1899e87c3bc8cd9af32001d1550abc373551", "title": "SparseP: Efficient Sparse Matrix Vector Multiplication on Real Processing-In-Memory Architectures"}, {"paperId": "036f2336db908986ba83082641423ad1da234b9d", "title": "Machine Learning Training on a Real Processing-in-Memory System"}, {"paperId": "35592c445d2e6adeb1c43ed5b25700b544188954", "title": "Exploiting Near-Data Processing to Accelerate Time Series Analysis"}, {"paperId": "2106b4aa6b61168c317dccd94f8ded96bbae10b8", "title": "PiDRAM: An FPGA-based Framework for End-to-end Evaluation of Processing-in-DRAM Techniques"}, {"paperId": "67b1e1eeb5d7af8ea7d880cd561b81d85d89144b", "title": "Heterogeneous Data-Centric Architectures for Modern Data-Intensive Applications: Case Studies in Machine Learning and Databases"}, {"paperId": "8f40e2a30ed2954877f879554df058e4f743d0ba", "title": "Going From Molecules to Genomic Variations to Scientific Discovery: Intelligent Algorithms and Architectures for Intelligent Genome Analysis"}, {"paperId": "5695f14582e4cef36d3fc41d4a52da4b2ffbcafa", "title": "SeGraM: a universal hardware accelerator for genomic sequence-to-graph and sequence-to-sequence mapping"}, {"paperId": "4eac0fca0e861e56f502f348c3c0e024e0960c42", "title": "Polynesia: Enabling High-Performance and Energy-Efficient Hybrid Transactional/Analytical Databases with Hardware/Software Co-Design"}, {"paperId": "39f74f26853ccc34bfe5485e4d78219ed317d0e6", "title": "Enabling High-Performance and Energy-Efficient Hybrid Transactional/Analytical Databases with Hardware/Software Cooperation"}, {"paperId": "e3bfd8cdc03b610cbd959adb360e09b1aa1fc436", "title": "Algorithmic Improvement and GPU Acceleration of the GenASM Algorithm"}, {"paperId": "067d7fe9cb647d0397c2fb53897791c8c1500e37", "title": "Automatic Creation of High-bandwidth Memory Architectures from Domain-specific Languages: The Case of Computational Fluid Dynamics"}, {"paperId": "729e8ed4e3356cded9b1a465f72a76813bac62a1", "title": "GenStore: a high-performance in-storage processing system for genome sequence analysis"}, {"paperId": "4d3fb0382d679483570650e091c89a086a585c07", "title": "GenStore: A High-Performance and Energy-Efficient In-Storage Computing System for Genome Sequence Analysis"}, {"paperId": "b1777d08e3848e47bf68e69164f24338b5b9f78b", "title": "EcoFlow: Efficient Convolutional Dataflows for Low-Power Neural Network Accelerators"}, {"paperId": "00c6c8b3ac452a6710af1fd33011f24da5eccce9", "title": "DR-STRaNGe: End-to-End System Design for DRAM-based True Random Number Generators"}, {"paperId": "2d96f79f33af42a75a9e6d8b6eb0dfc675b914e3", "title": "Casper: Accelerating Stencil Computations Using Near-Cache Processing"}, {"paperId": "46d657297da65cd6105ac837ad24ec7fd651f3b1", "title": "BLEND: a fast, memory-efficient and accurate mechanism to find fuzzy seed matches in genome analysis"}, {"paperId": "aa97d9f856e51f27ea59751a37bf5aca5fa59a5b", "title": "Energy-Efficient Deflection-based On-chip Networks: Topology, Routing, Flow Control"}, {"paperId": "ea6fa81df014ca1aa849241edd35250863fad7a3", "title": "Accelerating Genome Sequence Analysis via Efficient Hardware/Algorithm Co-Design"}, {"paperId": "7b78d629c823f6345343cce85a11f3d95aa4ac3e", "title": "Benchmarking Memory-Centric Computing Systems: Analysis of Real Processing-In-Memory Hardware"}, {"paperId": "e4a109f37137d8bc73954ecb808aee70522f8691", "title": "Survey on Near-Data Processing: Applications and Architectures"}, {"paperId": "2a47d481636a67bf1edbd2bcd73d823e69bc4c75", "title": "Accelerating Weather Prediction Using Near-Memory Reconfigurable Fabric"}, {"paperId": "8e87c31c9174c254b824910e28b5bf66f274650e", "title": "Benchmarking a New Paradigm: An Experimental Analysis of a Real Processing-in-Memory Architecture"}, {"paperId": "7bb6015f45457fdbe3bb39e17dc9cb0786ecd688", "title": "A Modern Primer on Processing in Memory"}, {"paperId": "5c06586c36943d22268e6a6faed4fc6665979d1b", "title": "Chapter Eight - The design of an energy-efficient deflection-based on-chip network"}, {"paperId": "084809bcb66911c8cef94879311beb96d11bc6a6", "title": "Benchmarking a New Paradigm: Experimental Analysis and Characterization of a Real Processing-in-Memory System"}, {"paperId": "b1cb96dcdd3c39d645e708b07f06763f0e4d40cf", "title": "LEAPER: Modeling Cloud FPGA-based Systems via Transfer Learning"}, {"paperId": "ab0fa40072d22d330fbb47cfa96b721cf8726cd9", "title": "ETH 263-2210-00L Computer Architecture, Fall 2022 HW 1: Processing-in-memory (SOLUTIONS)"}]}
