{"paperId": "893b69725bc00ff70ea5acc30a060442f45a9ff2", "publicationVenue": {"id": "ef7ffa98-c6c0-456e-b34e-89afdd3fa947", "name": "IEEE Internet of Things Magazine", "type": "journal", "alternate_names": ["IEEE Internet Thing Mag"], "issn": "2576-3180", "url": "https://www.comsoc.org/publications/magazines/ieee-internet-things-magazine", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=8548628", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=8548628&punumber=8548628"]}, "title": "Blockchain-Governed Federated Transfer Learning for Secure Internet of Drones Networks", "abstract": "Internet of Drones (IoD) is a critical paradigm of future networks used for complex cooperative tasks. Due to its heterogeneity, high mobility, and exposed connectivity, it inevitably suffers from the crucial security threats of nodes failure, malicious tampering, and anonymous attacks. Specifically, federated transfer learning (FTL) and blockchain are seen as promising technologies for network security. FTL utilizes the distinctive transfer of prior knowledge to facilitate security applications in various networks. It strengthens privacy protection and the resilience of AI, which will be crucial in more complicated circumstances. Blockchain (BC) technology attracts attention due to its inherent characteristics of security authentication and tamper-resistant storage. In this article, the superiority of FTL and BC are intergraded to overcome the cyber-security concerns associated with IoD networks. We propose FTLchain, a blockchain-empowered FTL architecture. To significantly boost the cyber-security of collaborative AI while preserving privacy, we empower the architecture with lightweight safety technology and detail the relationship between the critical components in the security design. Then, we devise a hierarchical consensus mechanism integrating the FTL aggregation with the blockchain consensus to ensure the architecture's scalability. The FTLchain's robustness is explained and proved with numerical simulations.", "venue": "IEEE Internet of Things Magazine", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-09-01", "journal": {"name": "IEEE Internet of Things Magazine", "pages": "134-139", "volume": "5"}, "authors": [{"authorId": "2113221991", "name": "Hai Wang"}, {"authorId": "47067803", "name": "Hao Jiang"}, {"authorId": "2149267160", "name": "Jing Wu"}, {"authorId": "2113326707", "name": "Pan Zhou"}, {"authorId": "21941206", "name": "Huawei Huang"}], "citations": []}
