{"paperId": "894ac35725d3c0f834b795d1612b306391edd722", "publicationVenue": {"id": "b189dec0-41d0-4cea-a906-7c5186895904", "name": "Global Communications Conference", "type": "conference", "alternate_names": ["GLOBECOM", "Glob Commun Conf"], "url": "http://www.ieee-globecom.org/"}, "title": "Crowdsensing Based Prompt Emergency Discovery: A Sequential Detection Approach", "abstract": "The growth in the number of smart devices has mobilized the rise of CrowdSensing (CS) as an enabler of smart cities, where state-of-the-art technologies are utilized to improve citizens' quality of life. CS is a novel sensing paradigm that leverages data collected from smart devices to support a wide range of services. Particularly, smart emergency management systems are attracting increasing attention due to their potential to save lives, as they accelerate the delivery of emergency services including detection, mitigation and recovery. In this paper, we study the problem of the detection of an abnormal change in a monitored sensory variable, where the change is suggestive of an emergency situation. Specifically, we formulate our problem as a sequential change-point detection problem, where the underlying distribution of the variable changes at an unknown time. Our aim is to detect the change-point with minimal delay, subject to certain performance constraints. We utilize Shiryaev's optimal solution in two variants of the problem depending on the mobility behaviour of the participants, and conduct simulation experiments to show the performance of our schemes.", "venue": "Global Communications Conference", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-12-01", "journal": {"name": "2019 IEEE Global Communications Conference (GLOBECOM)", "pages": "1-6"}, "authors": [{"authorId": "17339934", "name": "Rawan F. El Khatib"}, {"authorId": "144533481", "name": "N. Zorba"}, {"authorId": "35725657", "name": "H. Hassanein"}], "citations": [{"paperId": "5399e1534ed87a3674d7107824435d3dc9beb927", "title": "Novel Task Allocation Method for Emergency Events under Delay-Cost Tradeoff"}, {"paperId": "f6d9694ba45fb2e8fbada14fcbf873ab0d4a1266", "title": "A Smartphone Crowdsensing System Enabling Environmental Crowdsourcing for Municipality Resource Allocation with LSTM Stochastic Prediction"}, {"paperId": "b67152b04c255b563ecb59ef55223405a2821f04", "title": "Edge Technologies for Disaster Management: A Survey of Social Media and Artificial Intelligence Integration"}]}
