{"paperId": "89543389c6d537ee94caad951415669d522de4f8", "publicationVenue": {"id": "85ac2dda-27ce-4f18-826f-69d0d3fff930", "name": "International Joint Conference on Computer Science and Software Engineering", "type": "conference", "alternate_names": ["JCSSE", "Int Jt Conf Comput Sci Softw Eng"]}, "title": "Performance Improvement on a Learning Assessment Web Application Using AWS DynamoDB as a Cache Database", "abstract": "When the COVID-19 pandemic began, the world had to step into a new normal world, forcing real-life activities to transform into online activities. Formal teaching, learning, and examination were also affected. The online learning assessment system is a highly complex system because it must be able to handle a mass of students taking exams simultaneously, especially during the midterm and the final exam week. Therefore, the system must have an acceptable response time and high reliability. Our assessment system had been developed utilizing MySQL as a database, but the response time was unsatisfactory for actual usage. This paper proposes methods to improve the system's efficiency during high traffic by utilizing Amazon Web Services (AWS) DynamoDB as a cache of MySQL since it has a higher read-and-write efficiency than MySQL database. The read operation will be conducted in the Viewing exam session operation. At the same time, the write policy used for Managing exam sessions is write-through, while the policy for Saving examinees' answers is write-back. Choosing between write-through and write-back policies should take into account the acceptable response time and required instant consistency validation. The evaluation results with JMeter reveal that the method can double the efficiency of the read operation. On the other hand, the write operation is less than 3 seconds, which is still within an acceptable limit. For improving the DynamoDB efficiency, further suggestions have also been given in this paper.", "venue": "International Joint Conference on Computer Science and Software Engineering", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-06-28", "journal": {"name": "2023 20th International Joint Conference on Computer Science and Software Engineering (JCSSE)", "pages": "303-308"}, "authors": [{"authorId": "2231392479", "name": "Sirawit Tantiphuwanart"}, {"authorId": "1968994", "name": "Nuengwong Tuaycharoen"}, {"authorId": "1767476", "name": "Dittaya Wanvarie"}, {"authorId": "2646141", "name": "Naruemon Pratanwanich"}, {"authorId": "3105785", "name": "A. Suchato"}], "citations": [{"paperId": "ea4fdd262186a494152a554a31bb42f0f41ae677", "title": "A Novel Approach of Latency and Energy Efficiency Analysis of IIoT With SQL and NoSQL Databases Communication"}]}
