{"paperId": "8959e9653139b627d6dc5d53018df1051d107508", "publicationVenue": null, "title": "Feasibility of capturing real-world data from health information technology systems at multiple centers to assess cardiac ablation device outcomes: A fit-for-purpose informatics analysis report", "abstract": "Abstract Objective The study sought to conduct an informatics analysis on the National Evaluation System for Health Technology Coordinating Center test case of cardiac ablation catheters and to demonstrate the role of informatics approaches in the feasibility assessment of capturing real-world data using unique device identifiers (UDIs) that are fit for purpose for label extensions for 2 cardiac ablation catheters from the electronic health records and other health information technology systems in a multicenter evaluation. Materials and Methods We focused on data capture and transformation and data quality maturity model specified in the National Evaluation System for Health Technology Coordinating Center data quality framework. The informatics analysis included 4 elements: the use of UDIs for identifying device exposure data, the use of standardized codes for defining computable phenotypes, the use of natural language processing for capturing unstructured data elements from clinical data systems, and the use of common data models for standardizing data collection and analyses. Results We found that, with the UDI implementation at 3 health systems, the target device exposure data could be effectively identified, particularly for brand-specific devices. Computable phenotypes for study outcomes could be defined using codes; however, ablation registries, natural language processing tools, and chart reviews were required for validating data quality of the phenotypes. The common data model implementation status varied across sites. The maturity level of the key informatics technologies was highly aligned with the data quality maturity model. Conclusions We demonstrated that the informatics approaches can be feasibly used to capture safety and effectiveness outcomes in real-world data for use in medical device studies supporting label extensions.", "venue": "J. Am. Medical Informatics Assoc.", "year": 2021, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-07-27", "journal": {"name": "Journal of the American Medical Informatics Association : JAMIA", "pages": "2241 - 2250", "volume": "28"}, "authors": [{"authorId": "145788496", "name": "Guoqian Jiang"}, {"authorId": "3978377", "name": "S. Dhruva"}, {"authorId": "47739622", "name": "Jiajing Chen"}, {"authorId": "14677344", "name": "W. Schulz"}, {"authorId": "2749172", "name": "Amit A. Doshi"}, {"authorId": "6995238", "name": "P. Noseworthy"}, {"authorId": "2107918085", "name": "Shumin Zhang"}, {"authorId": "47111906", "name": "Yue Yu"}, {"authorId": "145701467", "name": "H. P. Young"}, {"authorId": "2058311908", "name": "Eric Brandt"}, {"authorId": "2121261610", "name": "Keondae R. Ervin"}, {"authorId": "2236220543", "name": "N. Shah"}, {"authorId": "2150934540", "name": "J. Ross"}, {"authorId": "47496751", "name": "P. Coplan"}, {"authorId": "10195048", "name": "J. Drozda"}], "citations": [{"paperId": "b98efecd3ab253d24c912a27dceabfd4af0f3b58", "title": "Predictive utility of the impedance drop on AF recurrence using digital intraprocedural data linked to electronic health record data"}, {"paperId": "a04b9d92326fd157bdfb9bd57bf1de64a17cb06f", "title": "Endovascular Aneurysm Repair Devices as a Use Case for Postmarketing Surveillance of Medical Devices."}, {"paperId": "e04d3e7a914fde87af09d3048c1f554f14af1151", "title": "Validation and clinical discovery demonstration of a real-world data extraction platform"}, {"paperId": "681b593dac6aa901b6ad4da7f96660eabc1af30c", "title": "Using real-world data from health systems to evaluate the safety and effectiveness of a catheter to treat ischemic ventricular tachycardia"}, {"paperId": "b0fa186ee994352afe1a4351792a21ee0cdd81f4", "title": "Review of Approvals and Recalls of US Specific Medical Devices in General and Plastic Surgery"}, {"paperId": "850896e4a310f14ab377ff39f4e7f91cdfcb6c91", "title": "Integrating real-world data to assess cardiac ablation device outcomes in a multicenter study using the OMOP common data model for regulatory decisions: implementation and evaluation"}, {"paperId": "da46460efb270d9a9081e9d566ac91031731e01a", "title": "Exploring unique device identifier implementation and use for real-world evidence: a mixed-methods study with NESTcc health system network collaborators"}, {"paperId": "511225d4011f0f1fe0127157f7410dc1348e9e6a", "title": "Safety and Effectiveness of a Catheter With Contact Force and 6-Hole Irrigation for Ablation of Persistent Atrial Fibrillation in Routine Clinical Practice"}, {"paperId": "f098755edc81fb64b55778d22703dc91f29996ef", "title": "Advancing Patient Safety Surrounding Medical Devices: Barriers, Strategies, and Next Steps in Health System Implementation of Unique Device Identifiers"}, {"paperId": "7f9d462d8d9eaf6a72853dd07d3ea26a868b8b7a", "title": "Feasibility of using real-world data in the evaluation of cardiac ablation catheters: a test-case of the National Evaluation System for Health Technology Coordinating Center"}, {"paperId": "306bb6d72706d751e85fff12a7c803c657b10c8c", "title": "Synergies between centralized and federated approaches to data quality: a report from the national COVID cohort collaborative"}, {"paperId": "29da40c0476e4473e8f97813a8a1eea5cd2d25e1", "title": "Advancing Patient Safety Surrounding Medical Devices: Barriers, Strategies, and Next Steps in Health System Implementation of Unique Device Identifiers"}]}
