{"paperId": "895ec5da8ad112909c56104c5b01b44cc4aff5cb", "publicationVenue": {"id": "396366a4-a1ba-422b-a9ff-1471ee08eab8", "name": "Acta Cybernetica", "type": "journal", "alternate_names": ["Acta Cybern"], "issn": "0324-721X", "alternate_issns": ["2676-993X"], "url": "http://www.inf.u-szeged.hu/actacybernetica/"}, "title": "A Case Study of Advancing Remote Sensing Image Analysis", "abstract": "Big data and cloud computing are two phenomena, which have gained significant reputation over the last few years. In computer science the approach shifted towards distributed architectures and high performance computing. In case of geographical information systems (GIS) and remote sensing image analysis, the new paradigms have already been successfully applied to several problems, and systems have been developed to support processing of geographical and remote sensing data in the cloud. However, due to different circumstances many previous workflows have to be reconsidered and redesigned. \n \nOur goal is to show a way how the existing approaches to remote sensing image analysis can be advanced to take advantages of these new paradigms. The task aiming in shifting the algorithms shall require a moderate effort and must avoid the complete redesign and reimplementation of the existing approaches. We present the whole journey as a case study using an existing industrial workflow for demonstration. Nevertheless, we define the rules of thumb, which can come in hand when shifting any existing GIS workflows. \n \nOur case study is the workflow of waterlogging and flood detection, which is an operative task at the Institute of Geodesy, Cartography and Remote Sensing (FOMI). This task in currently operational using a semi-automatic single machine approach involving multiple software. The workflow is neither efficient nor scalable, thus it is not applicable in emergency situations where quick response is required. We present an approach utilizing distributed computing, which enables the automated execution of this task on large input data with much better response time. The approach is based on the well-known MapReduce paradigm, its open-source implementation, the Apache Hadoop framework and the AEGIS geospatial toolkit. This enables the replacement of multiple software to a single, generic framework. Results show that significant performance benefits can be achieved at the expense of minor accuracy loss.", "venue": "Acta Cybernetica", "year": 2015, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "Acta Cybern.", "pages": "57-79", "volume": "22"}, "authors": [{"authorId": "1960934", "name": "Roberto Giachetta"}, {"authorId": "31738535", "name": "I. Fekete"}], "citations": [{"paperId": "06d647e64206ab8750dd487db0d1628610957dce", "title": "Cognitive Cloud-Based Telemedicine System"}, {"paperId": "afd423c25c89f07c20f6c2c1918314ac6543db07", "title": "Big data streaming for remote sensing time series analytics using MapReduce"}, {"paperId": "6e6f8ebed768dd936fe9ac1d537f5ada5953c03e", "title": "In-Memory Parallel Processing of Massive Remotely Sensed Data Using an Apache Spark on Hadoop YARN Model"}, {"paperId": "2d0fd4dcaba43667b696a9f2af2653885f5c35d5", "title": "A Clinical System Integration Methodology for Bio-Sensory Technology with Cloud Architecture"}, {"paperId": "d3d975cd53d074c45a1df2f069e3137230b39422", "title": "Overview of Hadoop in Remote Sensing Image Processing with Various Algorithms and Techniques in Cloud"}]}
