{"paperId": "89743f306e0680c09a30194a9cdd8c28eb8ee16d", "publicationVenue": {"id": "5640d101-aca5-4a94-b2ae-56233ede88fa", "name": "International Journal of Evaluation and Research in Education (IJERE)", "type": "journal", "alternate_names": ["Int J Evaluation Res Educ", "Int J Evaluation Res Educ (IJERE", "International Journal of Evaluation and Research in Education"], "issn": "2252-8822", "url": "http://iaesjournal.com/online/index.php/IJERE"}, "title": "Scholar’s vocabulary-knowledge favored listening-reading tenets: Concurrences from Madura", "abstract": "The study objective was to seek the favored tenets betwixt mobile-assisted-language-learning (MALL) listening-reading appliances by video-conferencing-technology (VCT) and direct-listening-reading appliances to Madurese-scholar’s second-language (L2) vocabulary-knowledge (VK) listening-reading competencies. The analysis of variance (ANOVA), which produced concurrences, contained 41 scholars in two distinct emplacements amidst a Madurese-scholars preponderance and the different amounts in groups. Several significant conclusions emerged from the current ANOVA analysis. First, the comprehensive implication betwixt MALL listening-reading-appliance and direct-listening-reading-appliance to scholar’s L2-VK listening-reading competencies was not substantiated because it was more than level significant (0.440>0.05). Second, we convened cognizance by direct perception, inside and outside deliberation, and documented it. Third, the cross-examination eventualities of perception-documentation were coded, and research eventualities established the Madurese-scholar higher education framework to pervade case study evidence vacuity that aims to scrutinize: i) the Madurese-scholar teaching-learning peculiarities performance of MALL-VCT-Zoom and Smart-TV multimedia edification; ii) Madurese-scholar interminable concurrences in MALL-VCT-Zoom and Smart-TV; and iii) impediments obtain by MALL-VCT-Zoom and Smart-TV during participation in edification. Irrevocably, concurrence betwixt MALL-VCT-Zoom and smart-TV to scholars’ L2-VK listening-reading competencies were interrelated impacts as Madurese-scholars can learn conveniently with their necessity and concurrently utilize smart-TV or Zoom despite their impediments.", "venue": "International Journal of Evaluation and Research in Education (IJERE)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-01", "journal": {"name": "International Journal of Evaluation and Research in Education (IJERE)"}, "authors": [{"authorId": "2264160432", "name": "Roziyan Adi Wicaksana"}, {"authorId": "2105514356", "name": "Shofiyatul Hasanah"}, {"authorId": "2105515211", "name": "Parahita Pradipta"}, {"authorId": "77949466", "name": "Erfan Efendi"}], "citations": []}
