{"paperId": "897fbccf523b6ae59023bdc63be3c9a69b163c13", "publicationVenue": null, "title": "Improving random forest algorithm by Lasso method", "abstract": "The random forest (RF) algorithm is a very practical and excellent ensemble learning algorithm. In this paper, we improve the random forest algorithm and propose an algorithm called ‘post-selection boosting random forest’ (PBRF). This algorithm combines the original random forest and the Lasso method, without giving the number of decision trees for final prediction in advance, it can dynamically obtain the decision trees according to different input samples to output the prediction results. Meanwhile, we verify that the proposed algorithm can improve the performance of the model through simulation studies and real data analysis.", "venue": "", "year": 2020, "fieldsOfStudy": ["Mathematics"], "publicationTypes": null, "publicationDate": "2020-09-02", "journal": {"name": "Journal of Statistical Computation and Simulation", "pages": "353 - 367", "volume": "91"}, "authors": [{"authorId": "46507139", "name": "Haibo Wang"}, {"authorId": "48738350", "name": "Gui-Rong Wang"}], "citations": [{"paperId": "d0dbdbdc19754c1a4865689412385d3b4680142e", "title": "Application of hybrid intelligent algorithm for multi-objective optimization of high performance concrete in complex alpine environment highway"}, {"paperId": "508989c71a1f44064e2ff676a6fca340f3711958", "title": "An improved random forest based on the classification accuracy and correlation measurement of decision trees"}, {"paperId": "c14b7055ac0f5af28b00763926918eb0c37c7879", "title": "Generating High Spatial Resolution Exposure Estimates from Sparse Regulatory Monitoring Data."}, {"paperId": "47aed7c176934081d0021153fcaa9b7fe33dcb58", "title": "SWEP-RF: Accuracy sliding window-based ensemble pruning method for latent sector error prediction in cloud storage computing"}, {"paperId": "c58d6054b2548a511041d4cd2941fb63c7f69453", "title": "Reducing spatial resolution increased net primary productivity prediction of terrestrial ecosystems: A Random Forest approach."}, {"paperId": "1761eb6283f3e036b16dbbf6e2564a683d45851c", "title": "A Review on Optimal Design of Fluid Machinery Using Machine Learning Techniques"}, {"paperId": "ef109f9547f17bbe6d367463d04d3132f1c4f9a4", "title": "Multi-Output Based Hybrid Integrated Models for Student Performance Prediction"}, {"paperId": "81fe72bfedf3b73062b28d299457cb18a9fdf0bd", "title": "Steering the interpretability of decision trees using lasso regression - an evolutionary perspective"}, {"paperId": "21577f94eede223df55ee61e9129e772e62d106d", "title": "Loose Particle Localization Method for Sealed Electronic Equipment Based on Improved Random Forest"}, {"paperId": "3276b53669617caa0ec6b9a13ef7fbd570656855", "title": "Improving random forest algorithm by selecting appropriate penalized method"}, {"paperId": "24db43fe5d2dce8291ae628a8c57fd169aa65ec5", "title": "An Ensemble Framework to Improve the Accuracy of Prediction Using Clustered Random-Forest and Shrinkage Methods"}, {"paperId": "b0a5cdf47f7a3a4e19f39cd0cea2b3156589788a", "title": "Assessing scale‐dependent effects on Forest biomass productivity based on machine learning"}, {"paperId": "2e090e08300df5fa1bdf8b2487ca1e1dab79674c", "title": "Study on the university students' satisfaction of the wisdom tree massive open online course platform based on parameter optimization intelligent algorithm"}, {"paperId": "668bb5c67154844d8d06747af6775afb01c2a39a", "title": "ERDeR: The Combination of Statistical Shrinkage Methods and Ensemble Approaches to Improve the Performance of Deep Regression"}, {"paperId": "f59c0c75ea10793936bfa32314e0586f7408c13d", "title": "A Tabular Variational Auto Encoder-Based Hybrid Model for Imbalanced Data Classification With Feature Selection"}]}
