{"paperId": "8994a90ac9ddc27de8ffa1760d65091bb7ea9498", "publicationVenue": {"id": "a0edb93b-1e95-4128-a295-6b1659149cef", "name": "Knowledge Discovery and Data Mining", "type": "conference", "alternate_names": ["KDD", "Knowl Discov Data Min"], "url": "http://www.acm.org/sigkdd/"}, "title": "Clockwork: A Delay-Based Global Scheduling Framework for More Consistent Landing Times in the Data Warehouse", "abstract": "Recurring batch data pipelines are a staple of the modern enterprise-scale data warehouse. As a data warehouse scales to support more products and services, a growing number of interdependent pipelines running at various cadences can give rise to periodic resource bottlenecks for the cluster. This resource contention results in pipelines starting at unpredictable times each day and consequently variable landing times for the data artifacts they produce. The variability gets compounded by the dependency structure of the workload, and the resulting unpredictability can disrupt the project workstreams which consume this data. We present Clockwork, a delay-based global scheduling framework for data pipelines which improves landing time stability by spreading out tasks throughout the day. Whereas most scheduling algorithms optimize for makespan or average job completion times, Clockwork's execution plan optimizes for stability in task completion times while also targeting predefined pipeline SLOs. We present this new problem formulation and design a list scheduling algorithm based on its analytic properties. We also discuss how we estimate the resource requirements for our recurring pipelines, and the architecture for integrating Clockwork with Dataswarm, Facebook's existing data workflow management service. Online experiments comparing this novel scheduling algorithm and a previously proposed greedy procrastinating heuristic show tasks complete almost an hour earlier on average, while exhibiting lower landing time variance and producing significantly less competition for resources in the cluster.", "venue": "Knowledge Discovery and Data Mining", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2021-08-14", "journal": {"name": "Proceedings of the 27th ACM SIGKDD Conference on Knowledge Discovery & Data Mining"}, "authors": [{"authorId": "1403189401", "name": "Martin Valdez-Vivas"}, {"authorId": "50633744", "name": "Varun Sharma"}, {"authorId": "1382576982", "name": "N. Stanisha"}, {"authorId": "2124830740", "name": "Shan Li"}, {"authorId": "2123020047", "name": "Luo Mi"}, {"authorId": "2152122601", "name": "Wei Jiang"}, {"authorId": "152508900", "name": "A. Kalinin"}, {"authorId": "47638768", "name": "Josh Metzler"}], "citations": []}
