{"paperId": "899ccf26525e644bf2e2f0bc6dc3dc69d17be2c0", "publicationVenue": null, "title": "Cancer subtype identification using large-scale omics data analysis", "abstract": "Cancer is the second leading cause of death worldwide. It is characterized by abnormal cell proliferation, potentially followed by spreading into surrounding tissue and body organs. Cancer is challenging to treat since it is very heterogeneous: even tumors originating from the same organ can greatly vary in their biological mechanism, survival risk, and response to treatment. Recent years have shown the emergence of large cancer genomic projects, providing detailed multi-omic profiles together with clinical information for thousands of cancer samples. In line with the vision of precision medicine, integration of omic and clinical data using statistical and algorithmic methods allows us to computationally identify clinically distinct subgroups that may have a profound impact on diagnosis, drug discovery, and treatment. In this work, we developed a methodology for improving the classification of cancers based on high-throughput omic data and applied it to both breast and skin cancers. Our analysis of the breast cancer cohort revealed a significant heterogeneity within the luminal-A subtype and partitioned its samples into prognostic subgroups based on expression and methylation patterns. Our analysis of the skin cancer cohort identified a group of poor-prognosis melanoma samples characterized by melanogenesis genes. We also suggested a simple three-gene classifier for predicting melanoma subtypes. Lastly, we describe PROMO, an interactive software tool we developed for multi-omic cancer data analysis and subtyping that generalizes the methodology used in the breast and skin cancer projects.", "venue": "", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "6181728", "name": "D. Netanely"}], "citations": []}
