{"paperId": "89b01f439cf85283cb3cffb15a67d2740cb1a141", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Trends and Recommendations for Enhancing Maturity Models in Supply Chain Management and Logistics", "abstract": "Maturity models (MMs) are strategic tools used to assess and improve the current state of processes, objects, or people, with the goal of achieving continuous performance enhancement. While MMs are applied in various fields, their scope, design, and application criteria within Supply Chain Management and Logistics (SCML) lack comprehensive studies. This article aims to address this gap through a systematic literature review. The review analyzes 137 relevant articles using both bibliometric and content analysis techniques. The bibliometric analysis identifies major contributions, popular journals, and the classification and evolution of key keywords. The content analysis focuses on critical criteria related to the scope, design, and application of MMs. The findings reveal a growing emphasis on models assessing Industry 4.0 readiness and sustainability principles. However, several gaps are identified, including limited attention to optimizing and integrating logistic processes, underutilized and unvalidated MMs, and the absence of comprehensive improvement guidelines. Based on these trends and research gaps, this study proposes five recommendations for future developments that benefit both academics and practitioners. These recommendations aim to address the identified limitations and provide guidance for comprehensive and effective improvement strategies.", "venue": "Applied Sciences", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-08-28", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "2195171199", "name": "S. Ferraro"}, {"authorId": "2145871534", "name": "L. Leoni"}, {"authorId": "2037094465", "name": "Alessandra Cantini"}, {"authorId": "79324340", "name": "F. De Carlo"}], "citations": [{"paperId": "8b713dd8ea2a77bcabf344070715dfa9caf89852", "title": "Critical Steps and Conditions to Be Included in a Business Model in Logistics, Seeking Competitive Advantage from the Perspective of the Modern Digital Age and Industry 4.0"}, {"paperId": "2d0142d5f75232178b18504a56424588d937b0cc", "title": "Evolution of Green Vehicle Routing Problem: A Bibliometric and Visualized Review"}]}
