{"paperId": "89b1f645d2d48017d551b9ef391f395ff5970044", "publicationVenue": null, "title": "Bearing Fault Detection Scheme Using Machine Learning for Condition Monitoring Applications", "abstract": "Bearings are the significant components among the rolling machine elements subjected to high wear and tear. The timely detection of faults in such components rotating at higher frequencies can save substantial maintenance costs and production setbacks. Physical examination and fault detection by human experts is always challenging at runtime. Predictive maintenance and real-time condition monitoring are gaining higher utility with the advent of suitable instrumentation and machine learning classifiers. A convolutional neural network (CNN) based bearing fault detection scheme is developed in this research work. The acquired sensory data of vibration signals are converted into the frequency domain and then fed to the classifier for spectral feature extraction and fault classification. The CNN architecture is trained and tested using a bearing dataset available online. The model is further tested and validated with the data acquired from an indigenously designed bearing test rig. The proposed scheme has successfully detected inner and outer race faults and no fault or normal state. This multiclass fault classification has shown promising results with 97.68% accuracy, 96.9% precision, 99.14% sensitivity, 98.01% F1-score, and 93.65% specificity. The achieved results validate the utility of the proposed detection system. Hence the presented scheme has deployment potential for real-time condition monitoring and predictive maintenance applications.", "venue": "ICMAME 2023 Conference Proceedings", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": null, "journal": {"name": "ICMAME 2023 Conference Proceedings"}, "authors": [{"authorId": "2060087650", "name": "Ali Saad"}, {"authorId": "14550984", "name": "A. Usman"}, {"authorId": "2220496719", "name": "Saad Arif"}, {"authorId": "1743758", "name": "M. Liwicki"}], "citations": [{"paperId": "f3963639b97a6fc5fef888041a36f714cafece53", "title": "Binary Classification of Skin Cancer using Pretrained Deep Neural Networks"}]}
