{"paperId": "89b143506753ee90cd29663d080a7e899d434975", "publicationVenue": {"id": "68571925-b158-4563-8047-3f483854eae6", "name": "European Journal of Science and Technology", "type": "journal", "alternate_names": ["Eur J Sci Technol"], "issn": "2148-2683"}, "title": "Veri Merkezi Güvenliğinin Sağlanmasında IoT Sensörlerinin Kullanımı Üzerine Bir Uygulama", "abstract": "Smart systems have become an indispensable part of our lives in our day by day digitalizing life. Items used in homes; transportation vehicles started to be equipped with smart sensors and systems. Developments in smart systems and artificial intelligence technologies have also made the Industry 4.0 revolution in the production sector. All these developments are the realization of digital innovation expressed as the Internet of Things, ie IoT. In this way, security scenarios are provided quickly and securely with devices that can communicate with each other. In this study, an open source data center monitoring application was implemented using some sensors with Raspberry Pi and Arduino boards developed for Internet of Things (IOT) applications. In the study, besides Raspberry Pi 3 B + and Arduino Nano development boards with 64 bit processors, motion detection, temperature-humidity sensors, RC522 RFID module, camera, relay, led, buzzer and I2C LCD screen were used. It has been observed that the basic functions required for monitoring data centers were successfully performed in the developed system.", "venue": "European Journal of Science and Technology", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-09-10", "journal": {"name": "European Journal of Science and Technology"}, "authors": [{"authorId": "2083401446", "name": "Fatih Çağatay Baz"}, {"authorId": "2137460802", "name": "Kadir Uludağ"}], "citations": [{"paperId": "07f9bd3583aba7a0940c2daf3131aa7591dd1a7e", "title": "Data Center Control Application With Fuzzy Logic"}]}
