{"paperId": "89b1ab996ea9ccd9c3da15425d4e0f02f0e1e327", "publicationVenue": {"id": "c3e5f1c8-9ba7-47e5-acde-53063a69d483", "name": "Future Internet", "type": "journal", "issn": "1999-5903", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-156830", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-156830", "https://www.mdpi.com/journal/futureinternet"]}, "title": "Multimodel Phishing URL Detection Using LSTM, Bidirectional LSTM, and GRU Models", "abstract": "In today’s world, phishing attacks are gradually increasing, resulting in individuals losing valuables, assets, personal information, etc., to unauthorized parties. In phishing, attackers craft malicious websites disguised as well-known, legitimate sites and send them to individuals to steal personal information and other related private details. Therefore, an efficient and accurate method is required to determine whether a website is malicious. Numerous methods have been proposed for detecting malicious uniform resource locators (URLs) using deep learning, machine learning, and other approaches. In this study, we have used malicious and benign URLs datasets and have proposed a detection mechanism for detecting malicious URLs using recurrent neural network models such as long short-term memory (LSTM), bidirectional long short-term memory (Bi-LSTM), and the gated recurrent unit (GRU). Experimental results have shown that the proposed mechanism achieved an accuracy of 97.0% for LSTM, 99.0% for Bi-LSTM, and 97.5% for GRU, respectively.", "venue": "Future Internet", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-11-21", "journal": {"name": "Future Internet", "pages": "340", "volume": "14"}, "authors": [{"authorId": "1897677", "name": "Sanjiban Sekhar Roy"}, {"authorId": "4073409", "name": "A. Awad"}, {"authorId": "2191988717", "name": "Lamesgen Adugnaw Amare"}, {"authorId": "2191985954", "name": "Mabrie Tesfaye Erkihun"}, {"authorId": "2191986736", "name": "Mohd Anas"}], "citations": [{"paperId": "c7a2430c8b6840e8b6b4ef15e6f82e30e586888e", "title": "Detect malicious websites by building a neural network to capture global and local features of websites"}, {"paperId": "c7ca55fb0d65bb19501db2ac307b94540ee6e506", "title": "URL based phishing attack detection using BiLSTM-gated highway attention block convolutional neural network"}, {"paperId": "28b00bd0761533857f98c9d14b229889d0f73cc2", "title": "Investigation of Phishing Susceptibility with Explainable Artificial Intelligence"}, {"paperId": "85ea80dced297ebcb42e541c16c1024c0098d478", "title": "FakeStack: Hierarchical Tri-BERT-CNN-LSTM stacked model for effective fake news detection"}, {"paperId": "dc938932b2330e15177b1b9736d672ae14ef6ee3", "title": "Time Series Forecasting Performance of the Novel Deep Learning Algorithms on Stack Overflow Website Data"}]}
