{"paperId": "89c590a06247d654bc1c9675b354725c489255ca", "publicationVenue": {"id": "009bf25d-4bf4-470e-af03-7580910f0e01", "name": "Frontiers in Research Metrics and Analytics", "type": "journal", "alternate_names": ["Front Res Metr Anal"], "issn": "2504-0537", "url": "https://www.frontiersin.org/journals/research-metrics-and-analytics#articles", "alternate_urls": ["http://journal.frontiersin.org/journal/research-metrics-and-analytics#"]}, "title": "Bibliometric and Visualized Analysis of China's Smart Grid Research 2008–2018", "abstract": "Smart grid (SG) offers great advantages in renewable energy integration and has become a popular trend of modern power development recently; meanwhile China is the second most prolific country using SG. Hence the purpose of this study is to get access to the research status, development, and trends of SG in China based on the 3,558 published papers obtained from the WOS core library and application of the bibliometric method and visualization analysis software VOSviewer and alluvial diagrams. The results consequently demonstrate some valuable insights. Firstly, the volume of publications in China's SG is on the rise, and the cooperation between countries and institutions is getting closer. Besides, the research hotspots have obvious interdisciplinary characteristics. Taking into consideration the impact of the information and communication field on SG, the major current research hotspots include wireless sensor network (WSN), internet of things (IoT), smart meter, big data, and security. Taking into consideration the impact of SG on traditional power systems, the main hotspots cover demand response, micro-grid, distributed generation, and electric vehicle (EV). Furthermore, China's SG research shows a trend from a single theme to diversified development. The research themes during 2010–2018 have deepened with most studies focusing on the traditional power system. The findings of this paper provide some enlightenment on China's SG research, which can present scholars with an overview of the macro perspective, help them understand the latest development of the SG field in China and offer useful guidance for future research in this subject as well.", "venue": "Frontiers in Research Metrics and Analytics", "year": 2020, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2020-10-28", "journal": {"name": "Frontiers in Research Metrics and Analytics", "volume": "5"}, "authors": [{"authorId": "2119128482", "name": "Cheng Wang"}, {"authorId": "143750478", "name": "Tao Lv"}, {"authorId": "2100403879", "name": "Xu Deng"}], "citations": [{"paperId": "2c447179a4c8cb49f416731b35b366a5343e0c82", "title": "Using the Alluvial diagram to display variable characteristics for COVID-19 patients and research achievements on the topic of COVID-19, epidemiology, pathogenesis, and vaccine (CEPV): Bibliometric analysis"}, {"paperId": "7d60bb91da5b07e71aa668b0f3d144a60e23f72a", "title": "Social Adoption of Smart Grids: The Research Agenda"}, {"paperId": "1a32995e86b9278aa39ebd117ad3dba7d40ae1cf", "title": "Treatment of coal fly ash and its environmentally friendly use in the rubber and plastic industries"}, {"paperId": "3cc77134efb411ba5390e7fa60270d20ba6a143f", "title": "Global Research Trends on the Link Between the Microbiome and COPD: A Bibliometric Analysis"}, {"paperId": "fc1f4e26f44036a8a5d9ccc9dd954323c6237637", "title": "Understanding the dynamics and conceptualization of environmental citizenship and energy citizenship: Evidence from the existing literature"}, {"paperId": "ff4930d09706593331336e84c336ddd93913c6ec", "title": "Using the Sankey diagram to visualize article features on the topics of whole-exome sequencing (WES) and whole-genome sequencing (WGS) since 2012: Bibliometric analysis"}, {"paperId": "42f76307fcb093c2332546db0bb904ac4577c9d3", "title": "Using the alluvial plot to visualize the network characteristics of 100 top-cited articles on attention-deficit/hyperactivity disorder (ADHD) since 2011: Bibliometric analysis"}, {"paperId": "43b9491489669cafbb340e4916d51cc934bede73", "title": "Bibliometric Analysis of Multi-Level Perspective on Sustainability Transition Research"}, {"paperId": "eca56ac3824ad6d224202256ab8048ceb9b427b7", "title": "Smart Grid Technologies as a Concept of Innovative Energy Development: Initial Proposals for the Development of Ukraine"}, {"paperId": "79c8cf1f80287e62fc941d079c360e0887d6b659", "title": "Smart home and internet of things: A bibliometric study"}]}
