{"paperId": "89d008f2262f3fd6810f13483f900bf45c368a01", "publicationVenue": {"id": "41bf9ed3-85b3-4c90-b015-150e31690253", "name": "Conference on Empirical Methods in Natural Language Processing", "type": "conference", "alternate_names": ["Empir Method Nat Lang Process", "Empirical Methods in Natural Language Processing", "Conf Empir Method Nat Lang Process", "EMNLP"], "url": "https://www.aclweb.org/portal/emnlp"}, "title": "Automatic Analysis of Substantiation in Scientific Peer Reviews", "abstract": "With the increasing amount of problematic peer reviews in top AI conferences, the community is urgently in need of automatic quality control measures. In this paper, we restrict our attention to substantiation -- one popular quality aspect indicating whether the claims in a review are sufficiently supported by evidence -- and provide a solution automatizing this evaluation process. To achieve this goal, we first formulate the problem as claim-evidence pair extraction in scientific peer reviews, and collect SubstanReview, the first annotated dataset for this task. SubstanReview consists of 550 reviews from NLP conferences annotated by domain experts. On the basis of this dataset, we train an argument mining system to automatically analyze the level of substantiation in peer reviews. We also perform data analysis on the SubstanReview dataset to obtain meaningful insights on peer reviewing quality in NLP conferences over recent years.", "venue": "Conference on Empirical Methods in Natural Language Processing", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference", "Review"], "publicationDate": "2023-11-20", "journal": {"name": "ArXiv", "volume": "abs/2311.11967"}, "authors": [{"authorId": "2155600393", "name": "Yanzhu Guo"}, {"authorId": "2266842024", "name": "Guokan Shang"}, {"authorId": "2058944389", "name": "Virgile Rennard"}, {"authorId": "1690383", "name": "M. Vazirgiannis"}, {"authorId": "2266841646", "name": "Chlo'e Clavel"}], "citations": []}
