{"paperId": "89d3d19ad717cd534bdd1866d28e2da253147705", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "EE-LLM: Large-Scale Training and Inference of Early-Exit Large Language Models with 3D Parallelism", "abstract": "We present EE-LLM, a framework for large-scale training and inference of early-exit large language models (LLMs). While recent works have shown preliminary evidence for the efficacy of early exiting in accelerating LLM inference, EE-LLM makes a foundational step towards scaling up early-exit LLMs by supporting their training and inference with massive 3D parallelism. Built upon Megatron-LM, EE-LLM implements a variety of algorithmic innovations and performance optimizations tailored to early exiting, including a lightweight method that facilitates backpropagation for the early-exit training objective with pipeline parallelism, techniques of leveraging idle resources in the original pipeline schedule for computation related to early-exit layers, and two approaches of early-exit inference that are compatible with KV caching for autoregressive generation. Our analytical and empirical study shows that EE-LLM achieves great training efficiency with negligible computational overhead compared to standard LLM training, as well as outstanding inference speedup without compromising output quality. To facilitate further research and adoption, we release EE-LLM at https://github.com/pan-x-c/EE-LLM.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-08", "journal": {"name": "ArXiv", "volume": "abs/2312.04916"}, "authors": [{"authorId": "2272979112", "name": "Yanxi Chen"}, {"authorId": "2211993531", "name": "Xuchen Pan"}, {"authorId": "2237607166", "name": "Yaliang Li"}, {"authorId": "2266389996", "name": "Bolin Ding"}, {"authorId": "2145786974", "name": "Jingren Zhou"}], "citations": [{"paperId": "96c3a6156546d0447fa2b3327e55bc5973e01d57", "title": "FFN-SkipLLM: A Hidden Gem for Autoregressive Decoding with Adaptive Feed Forward Skipping"}, {"paperId": "dbf829c977c121c3704d070d7800d29fe5914756", "title": "LLM Inference Unveiled: Survey and Roofline Model Insights"}, {"paperId": "664e518fa4873e281180b7ead965608ae14b1aef", "title": "SLEB: Streamlining LLMs through Redundancy Verification and Elimination of Transformer Blocks"}, {"paperId": "7ff1c7fefef44fc36d3163bd818c078ac66fbdc2", "title": "EE-Tuning: An Economical yet Scalable Solution for Tuning Early-Exit Large Language Models"}]}
