{"paperId": "89e3ad36f6de0b211504322232f7311e24e3f099", "publicationVenue": null, "title": "Meta-Migration: Reducing Switch Migration Tail Latency Through Competition", "abstract": "Resource management in distributed network control planes plays a vital role in the performance of the data plane and therefore the performance of network applications. Overwhelmed controller instances or underutilized instances could reshape their workloads by exchanging their load, i.e., switches that they control. To safely implement this exchange procedure, switch migration protocols are being used. As the migration procedure pauses processing new flows for a few milliseconds, these protocols are designed to be as fast as possible. Faster protocols add to the agility of the network to rapidly cope with the changing demand. In this paper, we introduce a general framework, called Meta-Migration, which focuses on expediting the existing time-sensitive controller load migration protocols. Based on the observation that these protocols impose low overheads on the involved parties, we modify them in a way that they can run in parallel toward multiple candidate destinations. Unlike the usual Fixed protocols that have to decide their destinations before running the protocol, here we rely on the real-time probes that we obtain from multiple systems and commit to only one of them in the middle of the procedure. Typically, migrations can complete on sub-second timescales, but sudden traffic bursts or system-level glitches can significantly slow down these protocols. We observe that by using Meta-Migration, we can dramatically diminish these negative effects. We show theoretical justifications for why this approach improves the overall performance of the migration, namely, its mean finishing time, and the tail latency of the migration. In addition, by developing a distributed controller simulator over real physical devices, we thoroughly measure the effectiveness of this approach as well as its incurred overheads. Our testbed results show up to a 53% tail reduction in the migration time.", "venue": "2023 IFIP Networking Conference (IFIP Networking)", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-06-12", "journal": {"name": "2023 IFIP Networking Conference (IFIP Networking)", "pages": "1-9"}, "authors": [{"authorId": "2441621", "name": "Sepehr Abbasi Zadeh"}, {"authorId": "2220362822", "name": "Farid Zandi"}, {"authorId": "153794969", "name": "Matthew Buckley"}, {"authorId": "1731999", "name": "Y. Ganjali"}], "citations": []}
