{"paperId": "8a16640e1889d7e39062767108cccd4cc6cf35fe", "publicationVenue": {"id": "72017ba4-9cc9-45cc-89cb-ced49936b1c0", "name": "International Conference on Computing, Communication and Automation", "type": "conference", "alternate_names": ["ICCCA", "Int Conf Comput Commun Autom"]}, "title": "Investigation into the efficacy of geospatial big data visualization tools", "abstract": "Big Data is a new emerging field as well as a big challenge. A vast amount of data is generated and stored daily and only 20% of data is structured. It is difficult to analyze and work on unstructured data. Geospatial data has already exceeded the storage capacity and is now considered as a big data problem. Visualizing data makes things a bit easier as data visualization helps in finding patterns and relationships in the data. There exist several visualization tools that are especially designed for geospatial data. In the present paper, it has been investigated and reviewed some of the popular tools for geospatial big data visualizations. Whitebox GAT, ArcMap, GeoMesa, HadoopViz and GRASS GIS are the tools which have been critically analyzed for geospatial big data visualization. Finally, it has been summarized with suitable recommendation as per the various parameters like code availability, desktop processing, online processing, mobile client processing, online course availability and various API compatibilities according to the requirements.", "venue": "International Conference on Computing, Communication and Automation", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference", "Review"], "publicationDate": "2017-05-01", "journal": {"name": "2017 International Conference on Computing, Communication and Automation (ICCCA)", "pages": "88-93"}, "authors": [{"authorId": "34688005", "name": "Rabindra Kumar Barik"}, {"authorId": "3399971", "name": "R. K. Lenka"}, {"authorId": "7492996", "name": "Syed Mohd Ali"}, {"authorId": "50169589", "name": "Noopur Gupta"}, {"authorId": "32589488", "name": "Ananya Satpathy"}, {"authorId": "50673881", "name": "Ankit Raj"}], "citations": [{"paperId": "f06c17414f9e9894fb2eec5bda300b6d51ef8def", "title": "Temperature impacts the environmental suitability for malaria transmission by Anopheles gambiae and Anopheles stephensi"}, {"paperId": "12579a9075b39015ce6b94c7dc21b6ef1c0e7e16", "title": "Temperature impacts the transmission of malaria parasites by Anopheles gambiae and Anopheles stephensi mosquitoes"}, {"paperId": "9834e9c7790e0765dfa6204ca71d5a8433bbdcc2", "title": "APPLICATION OF VARIOUS OPEN SOURCE VISUALIZATION TOOLS FOR EFFECTIVE MINING OF INFORMATION FROM GEOSPATIAL PETROLEUM DATA"}, {"paperId": "a9e48dda8ebb64d6f5e6058f19cd9088a3961e97", "title": "Automated Testing Tool: QTP"}, {"paperId": "bbb3d91243da9af523e63e74a769217de8a6d975", "title": "Comparative Analysis on Automated Testing of Web-based Application"}, {"paperId": "313e5a9ebc5e84e3dbc7e466348db64a376b0368", "title": "Performance Analysis of Automated Testing Tools: JMeter and TestComplete"}, {"paperId": "504d99e11b27cb6006169a1de2822de4504a1664", "title": "An Architecture to Support Interoperability in IoT Devices"}, {"paperId": "9cca3dade29ee7e829021f48dfdac4bf70b5dd0f", "title": "Load Performance Testing on Cloud Platform"}, {"paperId": "554d47b163c73d16ed24b6750405abb560adfeca", "title": "Performance and Load Testing: Tools and Challenges"}, {"paperId": "0cd43ae52418fad15e9fd306931aa5d96dd1c077", "title": "The Challenges of Big Data Visual Analytics and Recent Platforms"}, {"paperId": "f9dc5c29b7c9f5a1f060671fcfd04076e3edf6a1", "title": "Performance Optimisation in Sharing Big Geoscience Data"}]}
