{"paperId": "8a1a263d4ddcb1fdb7ed6d868aac3d1d5c648459", "publicationVenue": null, "title": "Adding Velocity to BigBench", "abstract": "BigBench standardized as TPCx-BB is a popular application benchmark that targets Big Data storage and processing systems. BigBench V2 addresses some of the BigBench limitations by introducing a new simplified data model, semi-structured web logs in JSON file format and new queries mandating late binding. However, it still covers only batch processing workloads and the Big Data velocity characteristic is not addressed. This work extends the BigBench V2 benchmark with a data streaming component that simulates typical statistical and predictive analytics queries in a retail business scenario. Our approach is to preserve the existing BigBench design and introduce a new streaming component that supports two data streaming modes: active and passive. In active mode, the data stream generation and processing happen in parallel, whereas in passive mode, the data stream is pre-generated in advance before the actual stream processing. The stream workload consists of five queries inspired by the existing 30 BigBench queries. To validate the proposed streaming extension, the two streaming modes were implemented and tested using Kafka and Spark Streaming. The experimental results prove the feasibility of our benchmark design. Finally, we outline design challenges and future plans for improving the proposed BigBench extension.", "venue": "DBTest@SIGMOD", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2018-06-15", "journal": {"name": "Proceedings of the Workshop on Testing Database Systems"}, "authors": [{"authorId": "29758338", "name": "Todor Ivanov"}, {"authorId": "2786371", "name": "Patrick Bedué"}, {"authorId": "34374672", "name": "A. Ghazal"}, {"authorId": "145723719", "name": "R. Zicari"}], "citations": [{"paperId": "f976d17cb4aff953f07392ee3b66617c71d68c5b", "title": "Tutorial on Benchmarking Big Data Analytics Systems"}, {"paperId": "f2cc8603ca284ae9b49be20e5e9e64399f33c0cd", "title": "The impact of columnar file formats on SQL‐on‐hadoop engine performance: A study on ORC and Parquet"}, {"paperId": "84fad4320fe9cc04ab3e9a9dc83db05e4691dd18", "title": "Classifying, evaluating and advancing big data benchmarks"}]}
