{"paperId": "8a3419b225869674b67dee1d25a073a7ea323a9e", "publicationVenue": null, "title": "Prediction on the Indoor Thermal Comfort of Occupied Room Based on IoT Climate Measurement Open Datasets", "abstract": "Efficient control of energy consumption in a building becomes one of the main focuses in reducing exponentially increase global energy consumption and world emission. One promising strategy to achieve efficiently control of energy consumption is by implementing Internet of Things (IoT). Despite its potential, studies on integrating IoT for predicting indoor thermal comfort of buildings are very scarce. Therefore, this manuscript is focused on a prediction study on the indoor thermal comfort of an occupied room with respect to relative humidity and room temperature as the main parameters. The room climate measurement datasets were obtained from open source. Various daily tasks were conducted during data measurement i.e. read, stand, walk, and work (typing). An analysis was made based on the adaptive thermal comfort theory by calculating PMV and PPD from Fanger thermal comfort theory. Results from data analysis proved there was an increasing trend of PMV and PPD values and directly influenced by room climates. Most of PMV and PPD values was considered as acceptable indoor thermal comfort according to ASHRAE standard 55. It was between -1.99 (cool) and +0.34 (neutral). Only reading on day seventeen that has -2 (cold) as thermal sensation scale with 76.6% PPD value. Certain tasks with low metabolic rate used lower temperature and created colder thermal sensation. In order to obtain neutral scale of temperature sensation and create energy efficiency, increasing on the indoor temperature and indoor relative humidity were needed.", "venue": "2020 International Conference on Informatics, Multimedia, Cyber and Information System (ICIMCIS)", "year": 2020, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2020-11-19", "journal": {"name": "2020 International Conference on Informatics, Multimedia, Cyber and Information System (ICIMCIS)", "pages": "40-45"}, "authors": [{"authorId": "92742001", "name": "R. Widiastuti"}, {"authorId": "93460402", "name": "J. Zaini"}, {"authorId": "2631665", "name": "W. Caesarendra"}, {"authorId": "1798534006", "name": "Dina Shona Laila"}, {"authorId": "2051656104", "name": "Jundika Candra Kurnia"}], "citations": [{"paperId": "e2ff9707c6f9ad750e341082318051704d4d756d", "title": "Comparison Analysis of Data Sending Performance Using The Cayenne and ThingSpeak IoT Platform"}, {"paperId": "bcceb69b0de95f20c2044c5bc9add0db19a8c07d", "title": "Multivariate Time-Series Deep Learning for Joint Prediction of Temperature and Relative Humidity in a Closed Space"}]}
