{"paperId": "8a400cc43c903b18e7990bdc00bd575ac046aac1", "publicationVenue": {"id": "054ddb2c-47fb-4de8-acfd-38566bec5015", "name": "Methods", "type": "journal", "issn": "1046-2023", "url": "https://www.journals.elsevier.com/methods/", "alternate_urls": ["http://www.sciencedirect.com/science/journal/10462023"]}, "title": "SGMFQP: An Ontology-based Swine Gut Microbiota Federated Query Platform", "abstract": "Gut microbiota plays a crucial role in modulating pig development and health, and gut microbiota characteristics are associated with differences in feed efficiency. To answer open questions in feed efficiency analysis, biologists seek to retrieve information across multiple heterogeneous data sources. However, this is error-prone and time-consuming work since the queries can involve a sequence of multiple sub-queries over several databases. We present an implementation of an ontology-based Swine Gut Microbiota Federated Query Platform (SGMFQP) that provides a convenient, automated, and efficient query service about swine feeding and gut microbiota. The system is constructed based on a domain-specific Swine Gut Microbiota Ontology (SGMO), which facilitates the construction of queries independent of the actual organization of the data in the individual sources. This process is supported by a template-based query interface. A Datalog+-based federated query engine transforms the queries into sub-queries tailored for each individual data source, and an automated workflow orchestration mechanism executes the queries in each source database and consolidates the results. The efficiency of the system is demonstrated on several swine feeding scenarios.", "venue": "Methods", "year": 2023, "fieldsOfStudy": ["Medicine", "Computer Science", "Biology"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-02-01", "journal": {"name": "Methods"}, "authors": [{"authorId": "2155516572", "name": "Ying Wang"}, {"authorId": "2199265655", "name": "Qin Jiang"}, {"authorId": "2204691151", "name": "Yilin Geng"}, {"authorId": "2209240301", "name": "Yuren Hu"}, {"authorId": "2119310862", "name": "Yue Tang"}, {"authorId": "2154546710", "name": "Jixiang Li"}, {"authorId": "2108124125", "name": "Junmei Zhang"}, {"authorId": "144480837", "name": "W. Mayer"}, {"authorId": "8603050", "name": "Shanmei Liu"}, {"authorId": "2200569777", "name": "Hong-Yu Zhang"}, {"authorId": "5741214", "name": "Xianghua Yan"}, {"authorId": "3162519", "name": "Zaiwen Feng"}], "citations": []}
