{"paperId": "8a426e8ddaf4f3581b011740171bdd9e590d1f34", "publicationVenue": {"id": "657a4bec-9a11-40fb-acfe-243d7fb993ae", "name": "Frontiers in Earth Science", "type": "journal", "alternate_names": ["Frontiers of Earth Science", "Frontiers in Earth Sciences", "Front Earth Sci"], "issn": "2296-6463", "alternate_issns": ["1863-4621", "2095-0195"], "url": "http://www.frontiersin.org/Earth_Science", "alternate_urls": ["http://journal.hep.com.cn/fesci/EN/2095-0195/current.shtml", "http://www.frontiersin.org/Journal/Archive.aspx?artId=0&f=19&name=Earth_Science", "https://www.frontiersin.org/journals/earth-science", "https://www.springer.com/series/7066"]}, "title": "Landslide Susceptibility Prediction Based on Frequency Ratio Method and C5.0 Decision Tree Model", "abstract": "This paper aims to propose an efficient landslide susceptibility prediction (LSP) model based on the frequency ratio method and C5.0 Decision Tree (C5.0 DT) model. Taking Ruijin City as the study area, local landslide inventory and 12 environmental factors are collected. Then the nonlinear correlations between landslide inventory and environmental factors are established by frequency ratio (FR) method. Thirdly, the FR values of these environmental factors are taken as the input variables of the C5.0 DT/SVM models; landslide samples and non-landslide samples are set as the output variables with values of 1 and 0, respectively. The mathematical relationship between input variables and output variables is established by C5.0 DT/SVM models. Finally, the performance of LSP of both models is evaluated by the Area Under Receiver Operation Characteristic Curve (AUC). Results show that: 1) The landslide susceptibility mapping (LSM) of the C5.0 DT and the SVM models are similar on the whole, high and very high susceptibility levels are mainly distributed in the north and in the edge of the study area. 2) The AUC values of C5.0 DT and SVM are 0.886 and 0.819, respectively. Both models have good LSP accuracy, however, the overall LSP accuracy of the C5.0 DT model is better than that of SVM. 3) It is significant and reliable to carry out LSP based on frequency ratio method and C5.0 DT model.", "venue": "Frontiers in Earth Science", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-05-31", "journal": {"volume": "10"}, "authors": [{"authorId": "112831797", "name": "Mingqiang Sheng"}, {"authorId": "2038508693", "name": "Jianqi Zhou"}, {"authorId": "2116081266", "name": "Xiaogang Chen"}, {"authorId": "2166986387", "name": "Yuxin Teng"}, {"authorId": "145215423", "name": "Anyu Hong"}, {"authorId": "2167046143", "name": "Gengzhe Liu"}], "citations": [{"paperId": "ab9ce9e99ffd473bd032bd6b253e9a8fb07a4581", "title": "Hurricane risk assessment in a multi-hazard context for Dominica in the Caribbean"}, {"paperId": "7da10e963c2b5bfd6850136214e8ec75e35a0f6b", "title": "Landslide susceptibility zonation of a hilly region: A quantitative approach"}, {"paperId": "bf4f1b2e296bc9dbd3b7a5e8ec983e61f6ac92d6", "title": "Landslide susceptibility mapping using O-CURE and PAM clustering algorithms"}, {"paperId": "ae5343672af8a27213eb59c534e208625359beeb", "title": "Modeling rules of regional flash flood susceptibility prediction using different machine learning models"}, {"paperId": "25ed2255eb1fd228743e72d87212da013cd91f65", "title": "Assessment of Slope Instability in Darjeeling Himalayan Region: Comparative Evaluation of Bi-Variate Statistical Methodologies"}, {"paperId": "e28f9a1524e8781d39583eb5de9673bbc65aff34", "title": "Evaluation of linear, nonlinear and ensemble machine learning models for landslide susceptibility assessment in Southwest China"}, {"paperId": "2f7c45eba3bec847abae33600027df58a2418b57", "title": "Landslide Susceptibility Evaluation Based on Potential Disaster Identification and Ensemble Learning"}]}
