{"paperId": "8a4b3b2e996a46ece0ab55fcc0f02007a6456b55", "publicationVenue": {"id": "e7c556b0-162f-4c48-9d25-fe3c141f984e", "name": "Big Data and Cognitive Computing", "alternate_names": ["Big Data Cogn Comput"], "issn": "2504-2289", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-1077183", "alternate_urls": ["https://www.mdpi.com/journal/BDCC", "https://www.mdpi.com/journal/BDCC/about", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-1077183"]}, "title": "Enabling Digital Twins to Support the UN SDGs", "abstract": "Digitalisation has enjoyed rapid acceleration during the COVID-19 pandemic on top of the already fast-paced expansion impacting almost every aspect of daily life. Digital twin technology, which is considered a building block of Metaverse and an important pillar of Industrial revolution 4.0, has also received growing interest. Apart from its significant contribution to intelligent manufacturing, there has been considerable discussion on its implementation and the as yet undiscovered potential. This paper reviews the current trajectory of digital twin applications in supporting general sustainability, in the context of the 17 UN SDGs. Furthermore, it connects researchers and readers from different fields with the aim of achieving a better understanding of emerging digital twin technologies, the current values this technology has brought to support UN SDGs, and identify areas with potential for future research to better contribute to achieving the remaining tasks of Agenda 2030.", "venue": "Big Data and Cognitive Computing", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-10-16", "journal": {"name": "Big Data Cogn. Comput.", "pages": "115", "volume": "6"}, "authors": [{"authorId": "144152608", "name": "Hossein Hassani"}, {"authorId": "2118519984", "name": "Xu Huang"}, {"authorId": "100591098", "name": "S. MacFeely"}], "citations": [{"paperId": "18ac2646bf6bc705e79bb782fcbd6934bd4a26fe", "title": "Leveraging cognitive digital twins in industry 5.0 for achieving sustainable development goal 9: An exploration of inclusive and sustainable industrialization strategies"}, {"paperId": "257da4825bf7cf1c73c48857b74493f3588667d3", "title": "Fostering Agricultural Transformation through AI: An Open-Source AI Architecture Exploiting the MLOps Paradigm"}, {"paperId": "19e3a5d335077ed97e886c6627aacf75992d1f12", "title": "IoT-enabled technologies for controlling COVID-19 Spread: A scientometric analysis using CiteSpace"}, {"paperId": "052507530a0fa8a104d696828bbd95dc9d9e5d34", "title": "Digital Twin Four-Dimension Fusion Modeling Method Design and Application to the Discrete Manufacturing Line"}, {"paperId": "9388f54f3ef90344ee4f0fb3166d2dc1f3d1de08", "title": "Towards Digital Twins of the Oceans: The Potential of Machine Learning for Monitoring the Impacts of Offshore Wind Farms on Marine Environments"}, {"paperId": "470cd75235228f41abed6473fc06d500b9c76f1f", "title": "Digital Twin for Sustainability Assessment and Policy Evaluation: A Systematic Literature Review"}]}
