{"paperId": "8a5cc432fbd7e08e2fe0583a490cf879cb30f350", "publicationVenue": {"id": "4c2b8cb8-e51c-4ece-9122-89595989b56f", "name": "European Symposium on Security and Privacy", "type": "conference", "alternate_names": ["EuroS&P", "IEEE European Symposium on Security and Privacy", "Eur Symp Secur Priv", "IEEE Eur Symp Secur Priv", "EUROS&P"]}, "title": "SOK: Side Channel Monitoring for Additive Manufacturing - Bridging Cybersecurity and Quality Assurance Communities", "abstract": "Additive Manufacturing (AM) is critical for the fourth industrial revolution (i.e., Industry 4.0). It involves printing a 3D object layer-by-layer from scratch. Fused filament fabrication (FFF), one of the most widely used AM technology, has been adopted by commercial and domestic consumers. With the recent addition of metal filaments, FFF caters to a broad spectrum of manufacturing industry requirements. Cybersecurity and Quality Assurance (QA) of the FFF process is an active research area. Like any other cyber-physical system, FFF exhibits many side channels (SCs), including acoustic and thermal emissions, vibrations, etc. Researchers in the QA domain use SCs to predict defects in the printed parts. Cybersecurity researchers, on the other hand, utilize SCs to identify malicious anomalies in the process. While the aims are different, there are definite overlaps in both communities’ acquisition and analysis methodologies. As the two communities bring distinct skill sets and expertise, we find an opportunity to bring them closer through a systematic study of available work and identifying the commonalities and distinctions to motivate the consumption of cross-domain knowledge. Our approach to systematizing the knowledge is based on identifying the available SC, the acquisition and analysis methodologies, performance statistics, associated challenges, and future research directions. This knowledge consolidation and systematization exercise will not only help the new researchers aiming to explore SCs in the FFF process but also highlight collaboration opportunities between QA and cybersecurity communities.", "venue": "European Symposium on Security and Privacy", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-07-01", "journal": {"name": "2023 IEEE 8th European Symposium on Security and Privacy (EuroS&P)", "pages": "1160-1178"}, "authors": [{"authorId": "2177467111", "name": "Muhammad Ahsan"}, {"authorId": "8757168", "name": "M. H. Rais"}, {"authorId": "2150353642", "name": "Irfan Ahmed"}], "citations": [{"paperId": "67e3549c4155c619414cc3874bd5ba779c95e088", "title": "LsStk: Lightweight solution to preventing Stack from buffer overflow vulnerability"}]}
