{"paperId": "8a7c144fbab7f2aaf417d178a4c9a4dc059dbe8a", "publicationVenue": {"id": "c3e5f1c8-9ba7-47e5-acde-53063a69d483", "name": "Future Internet", "type": "journal", "issn": "1999-5903", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-156830", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-156830", "https://www.mdpi.com/journal/futureinternet"]}, "title": "Towards an Integrated Methodology and Toolchain for Machine Learning-Based Intrusion Detection in Urban IoT Networks and Platforms", "abstract": "The constant increase in volume and wide variety of available Internet of Things (IoT) devices leads to highly diverse software and hardware stacks, which opens new avenues for exploiting previously unknown vulnerabilities. The ensuing risks are amplified by the inherent IoT resource constraints both in terms of performance and energy expenditure. At the same time, IoT devices often generate or collect sensitive, real-time data used in critical application scenarios (e.g., health monitoring, transportation, smart energy, etc.). All these factors combined make IoT networks a primary target and potential victim of malicious actors. In this paper, we presented a brief overview of existing attacks and defense strategies and used this as motivation for proposing an integrated methodology for developing protection mechanisms for smart city IoT networks. The goal of this work was to lay out a theoretical plan and a corresponding pipeline of steps, i.e., a development and implementation process, for the design and application of cybersecurity solutions for urban IoT networks. The end goal of following the proposed process is the deployment and continuous improvement of appropriate IoT security measures in real-world urban IoT infrastructures. The application of the methodology was exemplified on an OMNET++-simulated scenario, which was developed in collaboration with industrial partners and a municipality.", "venue": "Future Internet", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-02-28", "journal": {"name": "Future Internet", "pages": "98", "volume": "15"}, "authors": [{"authorId": "1491246659", "name": "Denis Rangelov"}, {"authorId": "2711297", "name": "Philipp Lämmel"}, {"authorId": "2210267557", "name": "Lisa Brunzel"}, {"authorId": "2397153", "name": "Stephan Borgert"}, {"authorId": "2210267555", "name": "Paul Darius"}, {"authorId": "2770759", "name": "Nikolay Tcholtchev"}, {"authorId": "1453623057", "name": "Michell Boerger"}], "citations": [{"paperId": "edce8e4d42948edeabf81c3b953ee13a29f838a2", "title": "Class imbalance data handling with optimal deep learning-based intrusion detection in IoT environment"}, {"paperId": "af88c2484670606b5c4e7a0829cd4292d778f555", "title": "A Blockchain-enabled Authentication Scheme for IoT Cybersecurity Infrastructure"}]}
