{"paperId": "8a8c446a5e2dd5c4c399f5ea614135cdd3316aed", "publicationVenue": {"id": "deedf64a-dd5c-4b33-b345-ff83bfb93d71", "name": "International Symposium on Computer Architecture", "type": "conference", "alternate_names": ["Int Symp Comput Archit", "ISCA"], "url": "http://www.cs.wisc.edu/~arch/www/"}, "title": "Flex: High-Availability Datacenters With Zero Reserved Power", "abstract": "Cloud providers, like Amazon and Microsoft, must guarantee high availability for a large fraction of their workloads. For this reason, they build datacenters with redundant infrastructures for power delivery and cooling. Typically, the redundant resources are reserved for use only during infrastructure failure or maintenance events, so that workload performance and availability do not suffer. Unfortunately, the reserved resources also produce lower power utilization and, consequently, require more datacenters to be built. To address these problems, in this paper we propose \"zero-reserved-power\" datacenters and the Flex system to ensure that workloads still receive their desired performance and availability. Flex leverages the existence of software-redundant workloads that can tolerate lower infrastructure availability, while imposing minimal (if any) performance degradation for those that require high infrastructure availability. Flex mainly comprises (1) a new offline workload placement policy that reduces stranded power while ensuring safety during failure or maintenance events, and (2) a distributed system that monitors for failures and quickly reduces the power draw while respecting the workloads’ requirements, when it detects a failure. Our evaluation shows that Flex produces less than 5% stranded power and increases the number of deployed servers by up to 33%, which translates to hundreds of millions of dollars in construction cost savings per datacenter site. We end the paper with lessons from our experience bringing Flex to production in Microsoft’s datacenters.", "venue": "International Symposium on Computer Architecture", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2021-06-01", "journal": {"name": "2021 ACM/IEEE 48th Annual International Symposium on Computer Architecture (ISCA)", "pages": "319-332"}, "authors": [{"authorId": "47423576", "name": "Chaojie Zhang"}, {"authorId": "3198758", "name": "A. Kumbhare"}, {"authorId": "3239756", "name": "I. Manousakis"}, {"authorId": "2013381067", "name": "Deli Zhang"}, {"authorId": "20165375", "name": "Pulkit A. Misra"}, {"authorId": "2088938625", "name": "Rod Assis"}, {"authorId": "2088937159", "name": "Kyle Woolcock"}, {"authorId": "147685223", "name": "Nithish Mahalingam"}, {"authorId": "2088938375", "name": "Brijesh Warrier"}, {"authorId": "2057154614", "name": "D. Gauthier"}, {"authorId": "2088940228", "name": "Lalu Kunnath"}, {"authorId": "144451224", "name": "Steven Solomon"}, {"authorId": "2070769909", "name": "Osvaldo Morales"}, {"authorId": "1765528", "name": "M. Fontoura"}, {"authorId": "2118138", "name": "R. Bianchini"}], "citations": [{"paperId": "d45096b77ceb6e34a51c2bc14958fb443355c1f4", "title": "Challenges and Opportunities in Sustainable Serverless Computing"}, {"paperId": "ebc4fcf5a402e0c3cae73e108e1efd8cd5145fdf", "title": "POLCA: Power Oversubscription in LLM Cloud Providers"}, {"paperId": "382dd44ab11d674d3b0180fa3bb194bffaac735c", "title": "Fine-Grained Online Energy Management of Edge Data Centers Using Per-Core Power Gating and Dynamic Voltage and Frequency Scaling"}, {"paperId": "02ec781c9cc74a1e0bcba22009bfe0977fd4f402", "title": "The War of the Efficiencies: Understanding the Tension between Carbon and Energy Optimization"}, {"paperId": "bb43ed64ccd0c7271f72383ac39711ee0daf08ca", "title": "An Introduction to the Compute Express Link (CXL) Interconnect"}, {"paperId": "acf7ad874677eb09e8c31f413c3cb2f423a7f772", "title": "Market Mechanism-Based User-in-the-Loop Scalable Power Oversubscription for HPC Systems"}, {"paperId": "c89f2018be6515b77873f198f5862484232aa045", "title": "When the Metaverse Meets Carbon Neutrality: Ongoing Efforts and Directions"}, {"paperId": "7421820b8f677fcaafa6a40b9d2cd840e25cb8ac", "title": "SoC-Cluster as an Edge Server: an Application-driven Measurement Study"}, {"paperId": "8dce6113a222a5de6bc1bca8c4bed6c11d197ba0", "title": "Online Demand Scheduling with Failovers"}, {"paperId": "d36b4983578460cbcfeeb0e711a5ff58ff600c4e", "title": "PowerMorph: QoS-Aware Server Power Reshaping for Data Center Regulation Service"}, {"paperId": "8a00a71e772bdf1c8471ee83a0991f2bfba3aaed", "title": "CoolEdge: hotspot-relievable warm water cooling for energy-efficient edge datacenters"}, {"paperId": "9b62574f87232879d2c1438d3514b9602c49d835", "title": "Carbon Explorer: A Holistic Framework for Designing Carbon Aware Datacenters"}, {"paperId": "6835032558e1f88d030cd0d1f0cc9400e8c84af9", "title": "Redesigning Data Centers for Renewable Energy"}, {"paperId": "49abc270e25510b168d63d90ca6c78273163f66a", "title": "High-availability clusters: A taxonomy, survey, and future directions"}, {"paperId": "33129ee647593b873fed4477a056c750a78c2684", "title": "Socio-Technological Challenges and Opportunities: Paths Forward"}, {"paperId": "d278e3cf247f2f48d5c9bc8e0bb8efe23c606da2", "title": "Efficient Cloud Server Deployment Under Demand Uncertainty"}, {"paperId": "affeb2e2f559eff9752e236113e945b37a4eda6f", "title": "EMPower: The Case for a Cloud Power Control Plane"}, {"paperId": "4d8db397d38e913adc100c062634c782ee0d5ec2", "title": "RETROSPECTIVE: Ensemble-level Power Management for Dense Blade Servers"}, {"paperId": "f1ed8ea79ce5e7b6c645a304e50147df53218e52", "title": "A Holistic Approach for Designing Carbon Aware Datacenters"}, {"paperId": "dcda9d84b551b272e4947525b55f125f8a1339d4", "title": "Beyond PUE: Flexible Datacenters Empowering the Cloud to Decarbonize"}, {"paperId": "77df655b79cadee01f736af5b7fd3391fe493506", "title": "Cooling as You Wish: Component-Level Cooling for Heterogeneous Edge Datacenters"}]}
