{"paperId": "8a9baa19478fe4804aa97f5363fa6b074e416b6a", "publicationVenue": {"id": "a0edb93b-1e95-4128-a295-6b1659149cef", "name": "Knowledge Discovery and Data Mining", "type": "conference", "alternate_names": ["KDD", "Knowl Discov Data Min"], "url": "http://www.acm.org/sigkdd/"}, "title": "Solving the Batch Stochastic Bin Packing Problem in Cloud: A Chance-constrained Optimization Approach", "abstract": "This paper investigates a critical resource allocation problem in the first party cloud: scheduling containers to machines. There are tens of services, and each service runs a set of homogeneous containers with dynamic resource usage; containers of a service are scheduled daily in a batch fashion. This problem can be naturally formulated as Stochastic Bin Packing Problem (SBPP). However, traditional SBPP research often focuses on cases of empty machines, whose objective, i.e., to minimize the number of used machines, is not well-defined for the more common reality with nonempty machines. This paper aims to close this gap. First, we define a new objective metric, Used Capacity at Confidence (UCaC), which measures the maximum used resources at a probability and is proved to be consistent for both empty and nonempty machines and reformulate the SBPP under chance constraints. Second, by modeling the container resource usage distribution in a generative approach, we reveal that UCaC can be approximated with Gaussian, which is verified by trace data of real-world applications. Third, we propose an exact solver by solving the equivalent cutting stock variant as well as two heuristics-based solvers -- UCaC best fit, bi-level heuristics. We experimentally evaluate these solvers on both synthetic datasets and real application traces, demonstrating our methodology's advantage over traditional SBPP optimal solver minimizing the number of used machines, with a low rate of resource violations.", "venue": "Knowledge Discovery and Data Mining", "year": 2022, "fieldsOfStudy": ["Computer Science", "Mathematics"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2022-07-20", "journal": {"name": "Proceedings of the 28th ACM SIGKDD Conference on Knowledge Discovery and Data Mining"}, "authors": [{"authorId": "2107302346", "name": "Jie Yan"}, {"authorId": "9263970", "name": "Yunlei Lu"}, {"authorId": "2108438312", "name": "Liting Chen"}, {"authorId": "2054558542", "name": "Si Qin"}, {"authorId": "2153039145", "name": "Yixin Fang"}, {"authorId": "2793487", "name": "Qingwei Lin"}, {"authorId": "1715172", "name": "T. Moscibroda"}, {"authorId": "148121358", "name": "S. Rajmohan"}, {"authorId": "2109581369", "name": "Dongmei Zhang"}], "citations": [{"paperId": "9102700bb8c2d060b6750f3049b45325dae9bd94", "title": "Hotspot resolution in cloud computing: A Γ-robust knapsack approach for virtual machine migration"}, {"paperId": "38b6aee621a20b5b99f4140ac0d217db4333dd95", "title": "A Poisson-Based Approximation Algorithm for Stochastic Bin Packing of Bernoulli Items"}, {"paperId": "4f6d130948d275d97e4f23a7c3967b0cbfc1061d", "title": "An efficient container bin-packing method for large scale cloud-native clusters"}, {"paperId": "24b68676d44ac892da7faa963769870417326459", "title": "Auto-scaling edge cloud for network slicing"}, {"paperId": "e45fda0e5b49771d02e9fc25734955b15b3b1db9", "title": "The Ensemble Approach of Column Generation for Solving Cutting Stock Problems"}, {"paperId": "2036f29f9d08d2078c637d2b9e6d915d0c3bd37a", "title": "Cutting and packing problems under uncertainty: literature review and classification framework"}, {"paperId": "f2b5e7853fb2d4411a52d5da981f6a8e70f66980", "title": "Unbalanced penalization: A new approach to encode inequality constraints of combinatorial problems for quantum optimization algorithms"}, {"paperId": "2567f18373876c8914cd6889b826c653361be46e", "title": "Parallel Enhanced Whale Optimization Algorithm for Independent Tasks Scheduling on Cloud Computing"}]}
