{"paperId": "8aa3d042883d639d25a4e9957f230e2e67bc2b08", "publicationVenue": null, "title": "A Proficient and secure way of Transmission using Cryptography and Steganography", "abstract": "People are concerned about the security of their data over the internet. The data can be protected in many ways to keep unauthorized individuals from accessing it. To secure data, steganography can be used in conjunction with cryptography. It is common for steganography to be used for hiding data or secret messages, whereas cryptography encrypts the messages so that they cannot be read. As a result, the proposed system combines both cryptography and steganography. A steganographic message can be concealed from prying eyes by using an image as a carrier of data. In steganography, writing is done secretly or covertly. The digital steganography algorithm uses text, graphics, and audio as cover media. Due to recent advancements in technology, steganography is challenging to employ to safeguard private data, messages, or digital photographs. This paper presents a new steganography strategy for confidential communications between private parties. A transformation of the ciphertext into an image system is also performed during this process. To implement XOR and ECC (Elliptic Curve Cryptography) encryption, three secure mechanisms were constructed using the least significant bit (LSB). In order to ensure a secure data transmission over web applications, both steganography and cryptography must be used in conjunction. Combined techniques can be used and replace the current security techniques, since there has been an incredible growth in security and awareness among individuals, groups, agencies, and government institutions.", "venue": "2022 2nd International Conference on Technological Advancements in Computational Sciences (ICTACS)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-10-10", "journal": {"name": "2022 2nd International Conference on Technological Advancements in Computational Sciences (ICTACS)", "pages": "582-586"}, "authors": [{"authorId": "2198498488", "name": "G. D. Reddy"}, {"authorId": "2198498237", "name": "Yaddanapudi Vssrr Uday Kiran"}, {"authorId": "2109206001", "name": "Prabhdeep Singh"}, {"authorId": "2108405361", "name": "Shubhranshu Singh"}, {"authorId": "2198497898", "name": "Sanchita Shaw"}, {"authorId": "2198568174", "name": "Jitendra Singh"}], "citations": [{"paperId": "f0ef8e59ae26d624e9ad17bd0244cfa3fd69b381", "title": "An Investigation of the Use of Applied Cryptography for Preventing Unauthorized Access"}, {"paperId": "e9680e98cfebea11883dd189ed02a0d40f6637bb", "title": "Novel Signal Processing Techniques for Non-Invasive Brain-Computer Interfaces"}, {"paperId": "971861a966ce7266e5caa90521f21378f0e1ed2e", "title": "Crop Yield Prediction Through Artificial Neural Networks"}, {"paperId": "9f4d416fad3ab080a073d64b16e73e1cdb9d3367", "title": "Multi-Modal Signal Fusion: Enhancing Speech Recognition in Noisy Environments"}, {"paperId": "f887c1ab268578715bfc10e3cd0ec5b47d128b9b", "title": "Early Detection of Pancreatic Cancer Using Ensemble Learning with Medical Imaging"}, {"paperId": "2232737242dce0bffdeb29efb48c8e1d5ddd2d29", "title": "Automated Detection of Glaucoma from Fundus Images Using Deep Convolutional Networks"}, {"paperId": "0ffb65bfb083fc4afdc54eb197ece4ec3ef9e7a8", "title": "Modern 3d Compression Application in Medical Imaging Approach"}, {"paperId": "50c8d5c90dec55c94b7ad5deab59777ff3c57246", "title": "Smart Building Management with IoT and AI: Energy-Efficient and Cost-Effective Solutions"}, {"paperId": "71836a1f1d121e92c646767f3316c114b408f994", "title": "Deep Learning Techniques for Autonomous Navigation of Underwater Robots"}, {"paperId": "b3f7346db5dd4f47a16310345530b1b3fa960b12", "title": "Optical Communication Systems for Ultra-High-Speed Data Transmission"}, {"paperId": "88977a327dfeab22ebecb29e78575d06756d5a54", "title": "Employee Absenteeism Prediction Using Machine Learning"}, {"paperId": "7495b1c39d7edce48dc787482fc080590558f723", "title": "Geographical Visitor Locator"}, {"paperId": "4d71317cb522b09b2d8fd31e1abec3856e2e49fe", "title": "AI and ML for Enhancing Crop Yield and Resource Efficiency in Agriculture"}, {"paperId": "0f36f5f40c3a9e5f9ecc295ad3b36cff9096ec8b", "title": "Quantum Signal Processing: A New Frontier in Information Processing"}, {"paperId": "fa21214913e325208ffecbb0800309fd3be028d9", "title": "Adaptive Signal Processing for Anomaly Detection in Industrial Systems"}, {"paperId": "50dce8f9addb6ff2994470c1ea5b5a0d474c4d61", "title": "Low Earth Orbit (LEO) Satellite Networks: A New Era in Global Communication"}, {"paperId": "f0a195df57e44ff6b941db282f355af95c1381d1", "title": "Stock Market Prediction using different Machine Learning Algorithms"}, {"paperId": "fa4a45d3f5462b341ec9252978567477100b3158", "title": "Weather Forecasting using Machine Learning"}, {"paperId": "f44dc888d0a0f4af042315ede1e1c9881dd08295", "title": "AI & Lean Management Principles Based Pharmaceutical Manufacturing Processes"}, {"paperId": "24b796f091decb7b7a6536157d166735a1e9fdd4", "title": "Remote Sensing: A Comprehensive Overview of Principles and Applications"}, {"paperId": "b799f6dc5812f2a7630a487bb1b2c7c80276f933", "title": "Green IoT Edge Computing Towards Sustainable and Distributed Data Processing"}]}
