{"paperId": "8aa4cae691d4d195372a3453e1d66035e3b61c00", "publicationVenue": null, "title": "Towards Improving Cloud Security and Performance by using Proposed Controlled Replication Model", "abstract": "Unlike traditional data centres, cloud computing can be used for data hosting and management, allowing the resources to be used in comparable ways. To host data, cloud companies employ a variety of ways. The most popular data is copied using the fewest resources, while the remainder is not. Placing data fragments in the middle and closest nodes to the user reduces access time. Through replication, data is always available, so its availability is ensured. Data files stored in the cloud should always be available to users. Users can replicate data files based on their reputation degree and replication benefits. The purpose of replication is to ensure consistency, availability, and reliability of data by maintaining different copies of the same data on multiple storage servers. Using a cloud provider creates a sense of trust in the belief that data is available whenever needed. Several factors have been considered when developing the Controlled Replication Model for reducing such instances on the cloud platform. These factors are the level of data reputation, the replication benefit, and the replication cost. As a result, it controls replication costs and lowers resource use. Denial of service and reflection attacks are reduced to a certain level, and the system's stability, availability, load balancing, and fault tolerance are increased.", "venue": "2022 International Conference on Computer, Power and Communications (ICCPC)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-12-14", "journal": {"name": "2022 International Conference on Computer, Power and Communications (ICCPC)", "pages": "12-16"}, "authors": [{"authorId": "2091876520", "name": "K. Rajalakshmi"}, {"authorId": "101762104", "name": "M. Sambath"}, {"authorId": "72522411", "name": "Linda Joseph"}], "citations": [{"paperId": "11ab8546cda732786f984a8c775ee0de5425ec76", "title": "An Effective Approach for Improving Data Access Time using Intelligent Node Selection Model (INSM) in Cloud Computing Environment"}]}
