{"paperId": "8aa59ec5f7e4fe6106a8a4665acdd4c3b3584929", "publicationVenue": null, "title": "Research on Intelligent Pet Management Platform System Based on Big Data Environment", "abstract": "This paper mainly focuses on the design and implementation of the pet community platform system based on big data. Pet community platform system is divided into two subsystems: client and administrator. The two subsystems are developed in the way of front and rear end separation. The back end uses the current mainstream JavaWeb development framework SpringBoot+ MyBatisPlus, and the front end uses the popular VUE +Element UI framework. The database of the system uses MySQL8 +Redis, and the platform system uses NGINX to achieve load balancing. After system requirements, feasibility analysis, business analysis, case analysis, system function of activity diagram and the database design and detailed design, using the MVC model view controller design specification, design to achieve the system each function module, through the way of writing test cases and manual test to test the main functions of the system, the system of the client subsystem mainly for the majority of raising pet pet professionals provide a communication platform with pet as the theme of community, published on the platform users can questions about pets or subject, the platform can communicate the case for users. This system use enterprise Java applications for pet lovers create pet exchange platform for the community, the community will gather all kinds of pet owners, users can learn all kinds of pets here knowledge and skills, to communicate with other pet owners to discuss, share moments of pet, pet adoption information release, we work together to solve the problem of pet relocation. At the same time, it provides data collection and analysis to provide strong data support for the development of pet market.", "venue": "2021 IEEE International Conference on Artificial Intelligence and Industrial Design (AIID)", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2021-05-28", "journal": {"name": "2021 IEEE International Conference on Artificial Intelligence and Industrial Design (AIID)", "pages": "641-649"}, "authors": [{"authorId": "2116269612", "name": "Huajie Luo"}, {"authorId": "2031512853", "name": "Yuqiang Wen"}, {"authorId": "2144525539", "name": "Xiao-Feng Zhang"}], "citations": []}
