{"paperId": "8ab1310f5d564f9c03669e953b860c98870542ed", "publicationVenue": {"id": "2baad992-2268-4c38-9120-e453622f2eeb", "name": "Journal of Medical Internet Research", "type": "journal", "alternate_names": ["J Med Internet Res"], "issn": "1438-8871", "url": "http://www.symposion.com/jmir/index.htm", "alternate_urls": ["http://www.jmir.org/", "https://www.jmir.org/"]}, "title": "Web-Based Risk Prediction Tool for an Individual's Risk of HIV and Sexually Transmitted Infections Using Machine Learning Algorithms: Development and External Validation Study", "abstract": "Background HIV and sexually transmitted infections (STIs) are major global public health concerns. Over 1 million curable STIs occur every day among people aged 15 years to 49 years worldwide. Insufficient testing or screening substantially impedes the elimination of HIV and STI transmission. Objective The aim of our study was to develop an HIV and STI risk prediction tool using machine learning algorithms. Methods We used clinic consultations that tested for HIV and STIs at the Melbourne Sexual Health Centre between March 2, 2015, and December 31, 2018, as the development data set (training and testing data set). We also used 2 external validation data sets, including data from 2019 as external “validation data 1” and data from January 2020 and January 2021 as external “validation data 2.” We developed 34 machine learning models to assess the risk of acquiring HIV, syphilis, gonorrhea, and chlamydia. We created an online tool to generate an individual’s risk of HIV or an STI. Results The important predictors for HIV and STI risk were gender, age, men who reported having sex with men, number of casual sexual partners, and condom use. Our machine learning–based risk prediction tool, named MySTIRisk, performed at an acceptable or excellent level on testing data sets (area under the curve [AUC] for HIV=0.78; AUC for syphilis=0.84; AUC for gonorrhea=0.78; AUC for chlamydia=0.70) and had stable performance on both external validation data from 2019 (AUC for HIV=0.79; AUC for syphilis=0.85; AUC for gonorrhea=0.81; AUC for chlamydia=0.69) and data from 2020-2021 (AUC for HIV=0.71; AUC for syphilis=0.84; AUC for gonorrhea=0.79; AUC for chlamydia=0.69). Conclusions Our web-based risk prediction tool could accurately predict the risk of HIV and STIs for clinic attendees using simple self-reported questions. MySTIRisk could serve as an HIV and STI screening tool on clinic websites or digital health platforms to encourage individuals at risk of HIV or an STI to be tested or start HIV pre-exposure prophylaxis. The public can use this tool to assess their risk and then decide if they would attend a clinic for testing. Clinicians or public health workers can use this tool to identify high-risk individuals for further interventions.", "venue": "Journal of Medical Internet Research", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-08-01", "journal": {"name": "Journal of Medical Internet Research", "volume": "24"}, "authors": [{"authorId": "12186298", "name": "Xian-hui Xu"}, {"authorId": "80553353", "name": "Zhenglun Yu"}, {"authorId": "2144689325", "name": "Z. Ge"}, {"authorId": "8022119", "name": "E. Chow"}, {"authorId": "148382799", "name": "Yining Bao"}, {"authorId": "144978963", "name": "J. Ong"}, {"authorId": "2157336142", "name": "Wei Li"}, {"authorId": "47876432", "name": "Jinrong Wu"}, {"authorId": "2134255471", "name": "C. Fairley"}, {"authorId": "2152838923", "name": "Lei Zhang"}], "citations": [{"paperId": "5af7badf32502b2b4fbe4db01a67139f8a83a347", "title": "Lightweight federated learning for STIs/HIV prediction"}, {"paperId": "7f34ff9702aecbcb31778596b356e09d1c7abc99", "title": "Clinical features-based machine learning models to separate sexually transmitted infections from other skin diagnoses."}, {"paperId": "a834a82934f53a0175829a66f2a6c5ebae63ca7d", "title": "Assessing the effectiveness of HIV/STI risk communication displays among Melbourne Sexual Health Centre attendees: a cross-sectional, observational and vignette-based study."}, {"paperId": "ea751b7087b59b871d1025e9009621e5934e2d7b", "title": "Building gender-specific sexually transmitted infection risk prediction models using CatBoost algorithm and NHANES data"}, {"paperId": "40ed3bc81bfd425cbf30f217dd93b5f26371ac27", "title": "Identifying Individuals at High Risk for HIV and Sexually Transmitted Infections With an Artificial Intelligence–Based Risk Assessment Tool"}, {"paperId": "9d21d00f20d354c7d9ebba912464ba0331f7ccfe", "title": "Assessing disparity in the distribution of HIV and sexually transmitted infections in Australia: a retrospective cross-sectional study using Gini coefficients"}]}
