{"paperId": "8ac077c55fd0a709efde47d53e768a9bcf7bc320", "publicationVenue": {"id": "764e3630-ddac-4c21-af4b-9d32ffef082e", "name": "IEEE International Conference on Data Engineering", "type": "conference", "alternate_names": ["ICDE", "Int Conf Data Eng", "IEEE Int Conf Data Eng", "International Conference on Data Engineering"], "url": "http://www.wikicfp.com/cfp/program?id=1331"}, "title": "Provenance in Temporal Interaction Networks", "abstract": "In temporal interaction networks (TINs), vertices correspond to entities, which exchange data quantities (e.g., money, bytes, messages) over time. We study the problem of con-tinuously tracking the origins of quantities at network vertices, as interactions take place over time. We target applications, such as financial exchange networks, where the selected transferred units at each interaction are not specified. We investigate several quantity selection policies that apply to different application scenarios. For each policy, we propose space- and time-efficient meta-data propagation mechanisms for continuously tracking provenance at vertices. For the hard case of proportional selection policy, we reduce the cost of tracking in practice, by either (i) limiting provenance tracking to a subset of vertices or groups of vertices, or (ii) tracking provenance only for quantities that were generated in the near past or limiting the provenance data in each vertex by a budget constraint. Our experimental evaluation on real datasets demonstrate the efficiency and scalability of our techniques compared to baseline approaches that extend flow computation algorithms to track provenance.", "venue": "IEEE International Conference on Data Engineering", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-10-11", "journal": {"name": "2022 IEEE 38th International Conference on Data Engineering (ICDE)", "pages": "2277-2290"}, "authors": [{"authorId": "22628631", "name": "Chrysanthi Kosyfaki"}, {"authorId": "1718168", "name": "N. Mamoulis"}], "citations": [{"paperId": "f4d3ee74dd98970cb6bdadbf0b365adbf63e3f04", "title": "Fundamental dynamics of popularity-similarity trajectories in real networks"}, {"paperId": "a6d79766cd23173ee6fab6278e96c47a21fed47f", "title": "A Summary of ICDE 2022 Research Session Panels"}]}
