{"paperId": "8ae3533c4d76d71a7940df7502693c68c910b450", "publicationVenue": {"id": "3416dd37-f45d-40ed-b04e-875fcff8fa2f", "name": "Nutrients", "type": "journal", "issn": "2072-6643", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169249", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169249", "http://www.mdpi.com/journal/nutrients/", "https://www.mdpi.com/journal/nutrients"]}, "title": "Analysis of Food Habits during Pandemic in a Polish Population-Based Sample of Primary School Adolescents: Diet and Activity of Youth during COVID-19 (DAY-19) Study", "abstract": "The improper dietary behaviors of children and adolescents during the COVID-19 pandemic, which are associated with lockdowns and reduced physical activity, are a complex problem, potentially resulting in increased risk of diet-related diseases, including overweight and obesity and their consequences. The aim of the study was to assess the food habits during the COVID-19 pandemic and to define their association with physical activity and body mass changes in a Polish population of primary school adolescents within the Diet and Activity of Youth During COVID-19 (DAY-19) Study. The DAY-19 Study was conducted in June 2020 in a national cohort of 1334 primary school students aged 10–16 years, recruited based on a stratified random sampling of schools (sampling counties from voivodeships and schools from counties). The Adolescent Food Habits Checklist (AFHC) was used to assess food habits, associated with food purchase, preparation, and consumption, which in the studied group were analyzed separately for the period before (retrospective data) and during the COVID-19 pandemic (prospective data). The recognizable physical activity changes and recognizable body mass changes were also assessed (retrospective data) and respondents were classified as those declaring that their physical activity and body mass decreased, remained stable, or increased during the COVID-19 pandemic. It was observed that during the COVID-19 pandemic the majority of food habits changed in a statistically significant way (p < 0.05). Within food purchase habits, the number of respondents who declared choosing a low-fat lunch away from home decreased, often buying pastries or cakes decreased, and buying a low-fat crisps brand increased (p < 0.05). Within food preparation habits, the number of respondents who declared trying to keep overall fat intake down increased, trying to keep overall sugar intake down increased, eating at least one serving of vegetables or salad with evening meal increased, and usually including some chocolate and/or biscuits in a packed lunch decreased (p < 0.05). Within food consumption habits, the number of respondents who declared making sure that they eat at least one serving of fruit a day increased, eating at least three servings of fruit most days increased, making sure that they eat at least one serving of vegetables or salad a day increased, trying to ensure that they eat plenty of fruit and vegetables increased, often choosing a fruit when they have a snack between meals increased, eating at least three servings of fruit most days increased, and generally trying to have a healthy diet increased (p < 0.05). It was concluded that in the period of the COVID-19 pandemic and resultant remote education, adolescents in Poland presented different food habits than before, while the majority of changes were positive. The positive food purchase, preparation, and consumption habits were observed mainly in sub-groups of adolescents declaring decreased body mass or increased physical activity during the COVID-19 pandemic. It may be suggested that physical activity may support positive changes of dietary behaviors and while combined positive changes of diet and increased physical activity, they may effectively promote body mass reduction in adolescents.", "venue": "Nutrients", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-10-22", "journal": {"name": "Nutrients", "volume": "13"}, "authors": [{"authorId": "1413710000", "name": "A. Kołota"}, {"authorId": "152426495", "name": "D. Głąbska"}], "citations": [{"paperId": "b0580c0568b775965643e396646ff2745971424d", "title": "Dietary Changes of Youth During the COVID-19 Pandemic: A Systematic Review."}, {"paperId": "bf970d9e04667b06d1bc7e4e459639c72b4d1d6d", "title": "EXPENDITURE ON FOOD AND FOOD CONSUMPTION IN HOUSEHOLDS IN POLAND DURING THE COVID-19 PANDEMIC"}, {"paperId": "b387ba8e663e8eb822d4e51c1b108e0668b0c2b8", "title": "Physical activity levels before and after the COVID-19 restrictions among Danish adolescents: a retrospective cohort study."}, {"paperId": "c97376454cd788e7f23d24a346761a4a1db9a327", "title": "Diet, Oral Hygiene Habits, and Approach to Dental Visits of Early School-Aged Children during the COVID-19 Pandemic and Possible Long-Term Health Consequences"}, {"paperId": "47e1a89739af84c1ba58ca46c16d3b96de2d161d", "title": "Changes in Food Consumption and Eating Behaviours of Children and Their Families Living in Italy during the COVID-19 Pandemic: The EPaS-ISS Study"}, {"paperId": "efbfaced364e9914bf3a49ea56c6e7b2233d996f", "title": "COVID-19 effects on diet, sleep, and physical activity among mid- to late-adolescents residing in the deep south in the United States"}, {"paperId": "82a7a2ce54ddabe42225e68f1e943d4aa54378d4", "title": "Analysis of Determinants of Food Preferences in a Polish Population-Based Sample of Primary School Adolescents: Diet and Activity of Youth during COVID-19 (DAY-19) Study"}, {"paperId": "a0c775119df72df5703c842a8b88abd14f28762d", "title": "Changes in Lifestyle and Body Weight in Children and Adolescents during the COVID-19 Pandemic: A Representative Survey of Parents in Germany"}, {"paperId": "3b383bb3bd65cffa5a9b1756e73213b5e58977df", "title": "A PRECEDE‐PROCEED model‐based educational intervention to promote healthy eating habits in middle school girls"}, {"paperId": "7d3f9efb6499aee7dc9cbc4e3e623b9a8003affd", "title": "Investigation of Changes in Nutrition/Eating Habits and Physical Activity Status of Nursing Students in the COVID-19 Period and Determination of Vaccination Status"}, {"paperId": "9790075b3af101af22f34c62d3044b65b6180f30", "title": "Analysis of Association between Adolescents’ Food Habits and Body Mass Change in a Population-Based Sample: Diet and Activity of Youth during COVID-19 (DAY-19) Study"}, {"paperId": "ad2d60e2dcad5301904d34f8f3b369efa2e608af", "title": "Conventional or Organic? Motives and Trends in Polish Vegetable Consumption"}, {"paperId": "e49a98ef191b1999a7bf4e11403e45b5dcfe3fd4", "title": "The Impact of the COVID-19 Pandemic on Food Consumption Behavior: Based on the Perspective of Accounting Data of Chinese Food Enterprises and Economic Theory"}]}
