{"paperId": "8af3be5ea9089a55c36b64ef58358cf2bac9b2e1", "publicationVenue": {"id": "a25f0f0c-6f67-4e9b-8f42-ffddbf2b3f55", "name": "Journal of Gastroenterology and Hepatology", "type": "journal", "alternate_names": ["J Gastroenterol Hepatol"], "issn": "0815-9319", "url": "http://onlinelibrary.wiley.com/journal/10.1111/(issn)1440-1746", "alternate_urls": ["http://onlinelibrary.wiley.com/journal/10.1111/(ISSN)1440-1746/homepage/Society.html", "https://onlinelibrary.wiley.com/journal/14401746"]}, "title": "Clinical applications of artificial intelligence and machine learning‐based methods in inflammatory bowel disease", "abstract": "Our objective was to review and exemplify how selected applications of artificial intelligence (AI) might facilitate and improve inflammatory bowel disease (IBD) care and to identify gaps for future work in this field. IBD is highly complex and associated with significant variation in care and outcomes. The application of AI to IBD has the potential to reduce variation in healthcare delivery and improve quality of care. AI refers to the ability of machines to mimic human intelligence. The range of AI's ability to perform tasks that would normally require human intelligence varies from prediction to complex decision‐making that more closely resembles human thought. Clinical applications of AI have been applied to study pathogenesis, diagnosis, and patient prognosis in IBD. Despite these advancements, AI in IBD is in its early development and has tremendous potential to transform future care.", "venue": "Journal of Gastroenterology and Hepatology", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-02-01", "journal": {"name": "Journal of Gastroenterology and Hepatology", "pages": "279 - 285", "volume": "36"}, "authors": [{"authorId": "1400933586", "name": "S. Cohen-Mekelburg"}, {"authorId": "48334225", "name": "Sameer K Berry"}, {"authorId": "3914291", "name": "R. Stidham"}, {"authorId": "2108715098", "name": "Ji Zhu"}, {"authorId": "5239295", "name": "A. Waljee"}], "citations": [{"paperId": "18dd4a2b22e0de2358c9412738b4a7be42566e91", "title": "A Review on the Use of Machine Learning Techniques in Monkeypox Disease Prediction"}, {"paperId": "b89a7eb31713ab4390386f406c6fd4380ad591aa", "title": "Artificial intelligence for gastroenterology: Singapore artificial intelligence for Gastroenterology Working Group Position Statement"}, {"paperId": "9cbadc4940ca547e9ff6e90a8782b65558d63098", "title": "Artificial intelligence in inflammatory bowel disease: implications for clinical practice and future directions"}, {"paperId": "012a7dc29e1835bf3fb95310a9ea38ac3e26aff4", "title": "Dietary polyphenols ameliorate inflammatory bowel diseases: advances and future perspectives to maximize their nutraceutical applications"}, {"paperId": "f3c22c2ada22087b9ae3bf034d44d603ca8049ef", "title": "The Role of Artificial Intelligence in Monitoring Inflammatory Bowel Disease—The Future Is Now"}, {"paperId": "40044a3e6cf5c4e869c21f59d20e343db8dfea41", "title": "Artificial intelligence in gastroenterology: A narrative review"}, {"paperId": "b63e229bd917a30ba99764b7896ffe542583d497", "title": "Automatically detecting Crohn’s disease and Ulcerative Colitis from endoscopic imaging"}, {"paperId": "9d095aea5c0040a98a389d4c612d56ac43483158", "title": "Highlighting the Undetectable — Fluorescence Molecular Imaging in Gastrointestinal Endoscopy"}]}
