{"paperId": "8affc659868f6e84296251183931b01a6e636931", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Integration of IoT Streaming Data With Efficient Indexing and Storage Optimization", "abstract": "In the era of IoT, the world of connected experiences is created by the convergence of multiple technologies including real-time analytics, machine learning, and commodity sensors and embedded systems. However, with the proliferation of these IoT technologies and devices, there are challenges in integrating, indexing and managing time-series data from multiple sources to optimize the storage of those data and/or retrieve the information from them in real-time. Many researchers have addressed the data integration issue through developing time-series data compression techniques; however, they focused mainly on the application of integer value compression to IoT data. Moreover, existing work does not focus on the issues of data and information retrieval without decompression. In this paper, we solve these issues by constructing an indexing framework within a lossless compression for floating point time-series data, where an index is based on the time-stamp from the compressed data that facilitates the search for data without full decompression. We conduct several sets of experiments and quantify the performance of our proposed approach. The experimental results, performed on IoT datasets, show a reduction in storage compared with existing compression techniques. The experimental study also demonstrates the capability of time-series data indexing and integration in real-time.", "venue": "IEEE Access", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-03-11", "journal": {"name": "IEEE Access", "pages": "47456-47467", "volume": "8"}, "authors": [{"authorId": "1582967605", "name": "Quang-Tu Doan"}, {"authorId": "2285641289", "name": "A. S. M. Kayes"}, {"authorId": "145492472", "name": "W. Rahayu"}, {"authorId": "37064022", "name": "Kinh Nguyen"}], "citations": [{"paperId": "e9c2b1d32ceef3b24bba1f9081018faabde83a19", "title": "Time Series Compression for IoT: A Systematic Literature Review"}, {"paperId": "a33844af3ab5f75aae0c85a2c50dfd9a4b3a07fd", "title": "Efficient Method for Continuous IoT Data Stream Indexing in the Fog-Cloud Computing Level"}, {"paperId": "76b5d8dbde926fc12189a9c8e62eaa6da2fe847c", "title": "Implementation of the Internet of Things Technology in the Smart Power Grid"}, {"paperId": "c5fd1fd6266446a420ec685a2449148a28e437bf", "title": "Integrated Forecast of Financial Time Series Data Based on Deep Learning Model"}, {"paperId": "6a0448819f16f8c2c03bd08b26128b65c24eb10f", "title": "A Survey on IoT-Enabled Smart Grids: Emerging, Applications, Challenges, and Outlook"}, {"paperId": "3593aa0cec6147b2d8b05da9d052ff0f1736ae55", "title": "A Framework for Identifying Influential People by Analyzing Social Media Data"}, {"paperId": "15cac4360fafe7b3ef437467214b2d0b4a264f0e", "title": "RSS Fingerprinting Dataset Size Reduction Using Feature-Wise Adaptive k-Means Clustering"}, {"paperId": "87fc6ec21a9292f7dce62bd211452b9e86c88299", "title": "Optimal Exploitation of On-Street Parked Vehicles as Roadside Gateways for Social IoV—A Case of Kigali City"}, {"paperId": "8963ab50b94adb0a5ca992ed767fbded29a1d7b0", "title": "IoT streaming data integration from multiple sources"}, {"paperId": "0f42a06bf7ce9db29a39473b0e64a98516819e41", "title": "Smarter Grid in the 5G Era: Integrating the Internet of Things With a Cyber-Physical System"}, {"paperId": "548606d39683c8ba4d40ab7629fb3f3d1c39f31c", "title": "CURRENT STATE AND DEVELOPMENT PROSPECTS OF HETEROGENEOUS STREAMING DATA PROCESSING METHODS"}, {"paperId": "709832c7e37237c662f2903cb6831478f134bc9b", "title": "A Novel Time Series Representation Approach for Dimensionality Reduction"}, {"paperId": "5df598c78841ac04ee05e368c6dc8db2a0350ce4", "title": "The Internet of Things and Architectures of Big Data Analytics: Challenges of Intersection at Different Domains"}, {"paperId": "1c888b7a2fc7803ce7b151642061d9fd59661934", "title": "IoT-Enabled Smart Energy Grid: Applications and Challenges"}]}
