{"paperId": "8b01e8b340d3b32fb96f28913e4193228f63b237", "publicationVenue": {"id": "fcbcaf18-8ab1-43e1-a973-604bbc7e344e", "name": "Proceedings of the VLDB Endowment", "type": "journal", "alternate_names": ["Proceedings of The Vldb Endowment", "Proc VLDB Endow", "Proc Vldb Endow"], "issn": "2150-8097", "url": "http://dl.acm.org/toc.cfm?id=J1174", "alternate_urls": ["http://portal.acm.org/toc.cfm?CFID=21632689&CFTOKEN=99329904&WantType=Affiliated%20Organizations&coll=ACM&dl=ACM&id=J1174&idx=J1174&part=affil&title=VLDB%20Endowment&type=periodical"]}, "title": "Improving reproducibility of data science pipelines through transparent provenance capture", "abstract": "Data science has become prevalent in a large variety of domains. Inherent in its practice is an exploratory, probing, and fact finding journey, which consists of the assembly, adaptation, and execution of complex data science pipelines. The trustworthiness of the results of such pipelines rests entirely on their ability to be reproduced with fidelity, which is difficult if pipelines are not documented or recorded minutely and consistently. This difficulty has led to a reproducibility crisis and presents a major obstacle to the safe adoption of the pipeline results in production environments. The crisis can be resolved if the provenance for each data science pipeline is captured transparently as pipelines are executed. However, due to the complexity of modern data science pipelines, transparently capturing sufficient provenance to allow for reproducibility is challenging. As a result, most existing systems require users to augment their code or use specific tools to capture provenance, which hinders productivity and results in a lack of adoption. In this paper, we present Ursprung,1 a transparent provenance collection system designed for data science environments.2 The Ursprung philosophy is to capture provenance and build lineage by integrating with the execution environment to automatically track static and runtime configuration parameters of data science pipelines. Rather than requiring data scientists to make changes to their code, Ursprung records basic provenance information from system-level sources and combines it with provenance from application-level sources (e.g., log files, stdout), which can be accessed and recorded through a domain-specific language. In our evaluation, we show that Ursprung is able to capture sufficient provenance for a variety of use cases and only adds an overhead of up to 4%.", "venue": "Proceedings of the VLDB Endowment", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-08-01", "journal": {"name": "Proceedings of the VLDB Endowment", "pages": "3354 - 3368", "volume": "13"}, "authors": [{"authorId": "33677967", "name": "Lukas Rupprecht"}, {"authorId": "113882367", "name": "James C. Davis"}, {"authorId": "146327766", "name": "Constantine Arnold"}, {"authorId": "143763011", "name": "Yaniv Gur"}, {"authorId": "40091832", "name": "Deepavali Bhagwat"}], "citations": [{"paperId": "b4452cb0cdfa5c139db1c7e89976403f4afcb0e0", "title": "\"We Have No Idea How Models will Behave in Production until Production\": How Engineers Operationalize Machine Learning"}, {"paperId": "822927054ec12e49c1b095c742c8bd0b50e6533c", "title": "ProvFL: Client-Driven Interpretability of Global Model Predictions in Federated Learning"}, {"paperId": "79a8e513ac136cc91175b99dead2306e6edd36af", "title": "Supporting Better Insights of Data Science Pipelines with Fine-grained Provenance"}, {"paperId": "ecca166beffbc2fe591d851ca04693d46cfcd55c", "title": "Summarizing Provenance of Aggregate Query Results in Relational Databases"}, {"paperId": "c51ea3693caba0bf1181580f4a8a9329ec4b6226", "title": "Open Science Best Practices in Data Science and Artificial Intelligence"}, {"paperId": "de81f0a51ee1059bb4eedad1f799f6596ae12858", "title": "Data Pipeline Quality: Influencing Factors, Root Causes of Data-related Issues, and Processing Problem Areas for Developers"}, {"paperId": "ddf3071fa4757fcf7a0bde62089bb8129ab9771d", "title": "Towards \"all-inclusive\" Data Preparation to ensure Data Quality"}, {"paperId": "a6dd23b5814886cc047d718631759bee9c2f8640", "title": "OneProvenance: Efficient Extraction of Dynamic Coarse-Grained Provenance From Database Query Event Logs"}, {"paperId": "dd27ab07b19772a56616da96918dec1753d62c97", "title": "How Provenance helps Quality Assurance Activities in AI/ML Systems"}, {"paperId": "be6d6bd04a99c74d4e1ab3ab271f25bc366085cf", "title": "How Do Data Science Workers Communicate Intermediate Results?"}, {"paperId": "151859cde9c2d69798e2d1e98348fcb41e39805a", "title": "Data provenance for cloud forensic investigations, security, challenges, solutions and future perspectives: A survey"}, {"paperId": "3ef5d807fdee09bce423a87d8afe2fce016b6a4c", "title": "Network cards: concise, readable summaries of network data"}, {"paperId": "5818cae37a473d279faf096295f4f06a358d3054", "title": "Sources of Irreproducibility in Machine Learning: A Review"}, {"paperId": "4dce252d907d1ec3aca220d37da8ce4b6f803e48", "title": "Quantifying variability in predictions of student performance: Examining the impact of bootstrap resampling in data pipelines"}, {"paperId": "73fe3cc9a5bd51da856d749d83e4ecc8872bcf46", "title": "A Study of Database Performance Sensitivity to Experiment Settings"}, {"paperId": "2322393bde80683c1d44e4843dd6582971e53d58", "title": "XLPN: Efficient and Scalable Cross-Ledger Protocols for the Topological Consortium of Permissioned Blockchains"}, {"paperId": "7fba3100768fa3aac0fbf961d5e894b2f629e6e6", "title": "Federated Data Science to Break Down Silos [Vision]"}, {"paperId": "8ac077c55fd0a709efde47d53e768a9bcf7bc320", "title": "Provenance in Temporal Interaction Networks"}, {"paperId": "bd768726c78b2cafae18fb1e571622b2f025a8a8", "title": "Use Python Data Analysis to Gain Insights from Airbnb Hosts"}, {"paperId": "f63b76c11bcddfae723224d33f13306b2b7db71e", "title": "NPARS—A Novel Approach to Address Accuracy and Reproducibility in Genomic Data Science"}, {"paperId": "b97ada759585d59313c150805ab5a81c97d815bd", "title": "Enhancing data pipelines for forecasting student performance: integrating feature selection with cross-validation"}, {"paperId": "0b5b801861374fdb78b043e23203feb3bd97e909", "title": "Flow Provenance in Temporal Interaction Networks"}, {"paperId": "e4ec612abcc934a3ac21ebfaa8b7b5e9bc122b82", "title": "Production Machine Learning Pipelines: Empirical Analysis and Optimization Opportunities"}, {"paperId": "af83a168b7877f48f13a8ee86d8379eaba60bdfd", "title": "Workflow provenance in the lifecycle of scientific machine learning"}, {"paperId": "e650db2530daefac6418dd9f770fb8106eec90bc", "title": "A Near Real-Time Big Data Provenance Generation Method Based on the Conjoint Analysis of Heterogeneous Logs"}, {"paperId": "f78436a7843889180e696d4fedbdba843c8a3dbb", "title": "Towards a Holistic Data Preparation Tool"}, {"paperId": "4e3257f85e20289c6653cf6410b0d6901103f695", "title": "OneProvenance: Efficient Extraction of Dynamic Coarse-Grained Provenance from Database Logs"}, {"paperId": "13508b6a9722aaf148d6cae65d05c173865acb33", "title": "Data Narrations - Using flexible Data Bindings to support the Reproducibility of Claims in Digital Library Objects"}]}
