{"paperId": "8b01b0da99409cc47e8d272f20e6d7d326ba1e21", "publicationVenue": null, "title": "Smart Vehicle Document Verification System Using IoT", "abstract": "The verification of vehicle documents is a significant role of the transportation department that is becoming more important as the number of vehicles registered grows. This process can be made more efficient by using an automated vehicle document verification system. IoT-based vehicle document verification system based on RFID technology in proposed this paper. As a result, the manual vehicle inspection that is currently performed can be replaced by automation. When normal vehicle checks are performed manually, a significant amount of time is lost. The proposed system will automate this process. The current verification method employs inductive loops installed in a roadbed to detect vehicles as they pass through the magnetic field loop. Similarly, sensing devices installed along the road can detect passing vehicles using the Bluetooth mechanism. Fixed audio detection devices that can identify the type of vehicle on the road. Other measurements include fixed cameras installed at strategic points along roads to categorize vehicles. However, none of these mechanisms can verify the vehicles’ documents and certificates. In this work, algorithm is proposed that uses RFID technology to automate the document verification process of vehicles with the help of an RFID reader and alcohol sensor to detect alcohol consumption by drivers to avoid road accidents.", "venue": "2022 IEEE International Conference on Data Science and Information System (ICDSIS)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-07-29", "journal": {"name": "2022 IEEE International Conference on Data Science and Information System (ICDSIS)", "pages": "1-5"}, "authors": [{"authorId": "2941496", "name": "N. Pavithra"}, {"authorId": "52622663", "name": "C. Manasa"}, {"authorId": "2154385999", "name": "Preethi"}, {"authorId": "2187824730", "name": "R. Sapna"}], "citations": []}
