{"paperId": "8b0a626b20022ae8fa8676b514e77eb399fdc9a7", "publicationVenue": {"id": "2135230a-3b24-4b71-9583-60624389377a", "name": "IEEE Transactions on Industrial Informatics", "type": "journal", "alternate_names": ["IEEE Trans Ind Informatics"], "issn": "1551-3203", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=9424", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=9424"]}, "title": "Digital Twin for Real-time Li-Ion Battery State of Health Estimation With Partially Discharged Cycling Data", "abstract": "To meet the fairly high safety and reliability requirements in practice, the state of health (SOH) estimation of Lithium-ion batteries (LIBs), which has a close relationship with the degradation performance, has been extensively studied with the widespread applications of various electronics. The conventional SOH estimation approaches with digital twin are end-of-cycle estimation that require the completion of a full charge/discharge cycle to observe the maximum available capacity. However, under dynamic operating conditions with partially discharged data, it is impossible to sense accurate real-time SOH estimation for LIBs. To bridge this research gap, we put forward a digital twin framework to gain the capability of sensing the battery's SOH on the fly, updating the physical battery model. The proposed digital twin solution consists of three core components to enable real-time SOH estimation without requiring a complete discharge. First, to handle the variable training cycling data, the energy discrepancy-aware cycling synchronization is proposed to align cycling data with guaranteeing the same data structure. Second, to explore the temporal importance of different training sampling times, a time-attention SOH estimation model is developed with data encoding to capture the degradation behavior over cycles, excluding adverse influences of unimportant samples. Finally, for online implementation, a similarity analysis-based data reconstruction has been put forward to provide real-time SOH estimation without requiring a full discharge cycle. Through a series of results conducted on a widely used benchmark, the proposed method yields the real-time SOH estimation with errors less than 1$\\%$ for most sampling times in ongoing cycles.", "venue": "IEEE Transactions on Industrial Informatics", "year": 2022, "fieldsOfStudy": ["Computer Science", "Engineering"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-12-09", "journal": {"name": "IEEE Transactions on Industrial Informatics", "pages": "7247-7257", "volume": "19"}, "authors": [{"authorId": "2143595563", "name": "Yan Qin"}, {"authorId": "2003299", "name": "Anushiya Arunan"}, {"authorId": "2064729563", "name": "Chau Yuen"}], "citations": [{"paperId": "bdf73eede2c26a65099322ac494dcecc97acc63a", "title": "A Time-Stamp Attack on Digital Twin-Based Lithium-ion Battery Monitoring for Electric Vehicles"}, {"paperId": "25da7369e2ad455690e32c1a3b9f51f4c70ab04d", "title": "Smart Lithium-Ion Battery Monitoring in Electric Vehicles: An AI-Empowered Digital Twin Approach"}, {"paperId": "afe10511ecebf8453a9edc7e4cf7f83c848096d9", "title": "Li-ion battery state-of-health estimation based on the combination of statistical and geometric features of the constant-voltage charging stage"}, {"paperId": "2720eaa93889a0162a6b14183dbdd74e74ee5517", "title": "Sensitivity Analysis of Battery Digital Twin Design Variables Using Genetic Programming"}, {"paperId": "84de849b6a9d3df9187de607cfab1e542c893e46", "title": "Industrial Process Monitoring Based on Parallel Global-Local Preserving Projection with Mutual Information"}, {"paperId": "795ee3c219975a3ede8041c83cf9fad8375adc66", "title": "A Federated Learning-based Industrial Health Prognostics for Heterogeneous Edge Devices using Matched Feature Extraction"}, {"paperId": "929bbd122a2fcdb9493f236db85ad31deb8ba5f6", "title": "The Monitoring and Management of an Operating Environment to Enhance the Safety of a Container-Type Energy Storage System"}, {"paperId": "cf9918ccaef7747546b1b86d1103c25c9524bdf0", "title": "Artificial intelligence and digital twins in power systems: Trends, synergies and opportunities"}, {"paperId": "0cb229ca5e82140c10cb784e362f756d46b0470b", "title": "Comprehensive Review of Machine Learning, Deep Learning, and Digital Twin Data-Driven Approaches in Battery Health Prediction of Electric Vehicles"}]}
