{"paperId": "8b11fec62aa6d73300813e367a011e96c898c3a6", "publicationVenue": {"id": "01301914-0f59-4c88-bcf4-5fd9614b8b8e", "name": "SIGPLAN symposium on New ideas, new paradigms, and reflections on programming and software", "type": "conference", "alternate_names": ["Onward!", "SIGPLAN symp New idea new paradig reflect program softw"]}, "title": "An approach for persistent time-varying values", "abstract": "As reactive systems, such as cyber-physical systems and the Internet of Things, become increasingly important, time-varying values, also known as signals, are playing an important role in software development. Although reactive systems require the change histories of some signals to be stored for various purposes such as post analysis and simulation, current programming languages do not provide a way to declare that signals are persistent. This paper proposes a method that realizes persistent signals in a reactive programming language, where (1) every update to each persistent signal is recorded in a time-series database, which can be seen as a part of the programming language runtime; and (2) persistent signals support a convenient time-oriented query mechanism. In this approach, each signal in the reactive programming language is seamlessly connected with the time-series database. This method is implemented as an extension of SignalJ, a Java-based reactive programming language that supports signals. In the implementation, the persistent signal mechanism is integrated with TimescaleDB, a PostgreSQL-based time-series database. In preliminary performance evaluations, our implementation had good responsiveness on most tests, indicating its feasibility for use in many applications.", "venue": "SIGPLAN symposium on New ideas, new paradigms, and reflections on programming and software", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2019-10-23", "journal": {"name": "Proceedings of the 2019 ACM SIGPLAN International Symposium on New Ideas, New Paradigms, and Reflections on Programming and Software"}, "authors": [{"authorId": "3351087", "name": "T. Kamina"}, {"authorId": "2987058", "name": "Tomoyuki Aotani"}], "citations": [{"paperId": "1d582fa946e9fbd8b7b5b9ecfde9eef7db5822a9", "title": "Realizing Persistent Signals in JavaScript"}, {"paperId": "656b574c5f74b612c414e791b5d8d3982d47c211", "title": "Temporal Layers: Reactive Activation Scope of First-Class Layer Instances"}, {"paperId": "e7bfaaa3d673ad424e64aac0af2a5b762d2ddbed", "title": "Distributed Persistent Signals: Architecture and Implementation"}, {"paperId": "761c60ca899ad04007429910314d657fb85bce99", "title": "Signal Classes: A Mechanism for Building Synchronous and Persistent Signal Networks"}]}
