{"paperId": "8b2740a5844095598d28bee17c8bafe85e50f4c8", "publicationVenue": {"id": "a88140cf-3ca8-46c2-b1f7-446f137cf336", "name": "Frontiers in Education Conference", "type": "conference", "alternate_names": ["FIE", "Front Educ Conf"], "url": "http://fie-conference.org/"}, "title": "Online Prediction to Facilitate a Flipped and Adaptive Classroom", "abstract": "In a flipped and adaptive learning environment, adaptability in time is the key to handling constant change and student individuality for their success. To maximize the learning experience, an urgently demanding task is to identify lower-performance students on the fly for targeted timely interventions. Existing state-of-the-art works focus on a regular course setting, where timelines in adaptability is not necessarily a high priority. These works apply batch-based (offline) learning algorithms or ensemble methods, which need the entire training data collected before prediction. These methods, without the whole learning process into consideration, may affect the accuracy of prediction results. In response to the urgent need, we propose to apply an online predictive learning method to handle incoming student data throughout the time steps of a course semester and predict low-performing students for each time step, with a goal to minimize the overall classification error. We built up our experimental design on the multiple learning theories, designed and executed four surveys, and conducted predictive analysis on student data. In the process of feature engineering, we conducted a series of correlation and cause-effect regression analyses and further quantified the determinant factors of predicting student performance. We further developed a framework for identifying low-performing students on the fly and comparing and analyzing deep online learning and diverse traditional batch-based (offline) predictive modeling methods. Our comparative analysis indicates that the online predictive learning approach is encouraging. It outperforms all batch-based (offline) methods overall; prediction results on low-performing students at a time step help identify their problem patterns situated in the context of the whole course progress to design and conduct timely interventions. The innovative study set up a stage for us to deeply understand the learning process, identify main determinant factors, interpret predictive models, and design targeted timely interventions or interactions to help those struggling students through a semester.", "venue": "Frontiers in Education Conference", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference", "Review"], "publicationDate": "2023-10-18", "journal": {"name": "2023 IEEE Frontiers in Education Conference (FIE)", "pages": "1-10"}, "authors": [{"authorId": "1564050281", "name": "Qiong Cheng"}], "citations": []}
