{"paperId": "8b30232e595f803371d00f607bce436bcbe2da34", "publicationVenue": {"id": "f32b7322-b69c-4e63-801d-8f50784ef778", "name": "Computational Intelligence and Neuroscience", "type": "journal", "alternate_names": ["Comput Intell Neurosci"], "issn": "1687-5265", "url": "https://www.hindawi.com/journals/cin/"}, "title": "Application of Unsupervised Transfer Technique Based on Deep Learning Model in Physical Training", "abstract": "The research purpose is to study the standardization and scientizing of physical training actions. Stacking denoising auto encoder (SDAE), a BiLSTM deep network model (SDAL-DNM) (a kind of training action model), and an unsupervised transfer model are used to deeply study the action problem of physical training. Initially, the physical training action discrimination model adopted here is a combination of stacked noise reduction self-encoder and bidirectional depth network model. Then, this model can collect data for five actions in physical training and further analyze the importance of action standardization for physical training. Afterward, the SDAL-DNM implemented here fully integrates the advantages of SDAE and BiLSTM. Finally, the unsupervised transfer model adopted here is based on SDAL-DNM deep learning (DL). The movement data of the physical training crowd are collected, and then the unsupervised transfer model is trained. According to the movement characteristics of physical training, the data difference between trainers is calculated so that the actions of each trainer can be continuously adapted according to the model, and finally, the benefits of effectively distinguishing the training actions can be achieved. The research shows that before and after unsupervised learning, the average decline of the model used is 1.69%, while the average decline of extreme learning machine (ELM) is 5.5%. The conclusion is that the unsupervised transfer model can improve the discrimination accuracy of physical training actions and provide theoretical support to effectively correct mistakes in physical training actions.", "venue": "Computational Intelligence and Neuroscience", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-04-14", "journal": {"name": "Computational Intelligence and Neuroscience", "volume": "2022"}, "authors": [{"authorId": "2162684408", "name": "Quanbin Zhao"}, {"authorId": "2144396304", "name": "Hanqi Wang"}], "citations": [{"paperId": "c2ec6d1972a7afaf504aaa6e262f569a5f1ae368", "title": "Fine classification of crops based on an inductive transfer learning method with compact polarimetric SAR images"}]}
