{"paperId": "8b3cd3e182c7d85d71d8a9609192e5eb160519d1", "publicationVenue": {"id": "9cc701cf-1f49-4121-8ea9-11bac24d61ad", "name": "IEEE Transactions on Big Data", "type": "journal", "alternate_names": ["IEEE Trans Big Data"], "issn": "2332-7790", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=6687317", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6687317", "https://ieeexplore.ieee.org/xpl/aboutJournal.jsp?punumber=6687317"]}, "title": "Asynchronous Parallel Incremental Block-Coordinate Descent for Decentralized Machine Learning", "abstract": "Machine learning (ML) is a key technique for big-data-driven modelling and analysis of massive Internet of Things (IoT) based intelligent and ubiquitous computing. For fast-increasing applications and data amounts, distributed learning is a promising emerging paradigm since it is often impractical or inefficient to share/aggregate data to a centralized location from distinct ones. This paper studies the problem of training an ML model over decentralized systems, where data are distributed over many user devices and the learning algorithm run on-device, with the aim of relaxing the burden at a central entity/server. Although gossip-based approaches have been used for this purpose in different use cases, they suffer from high communication costs, especially when the number of devices is large. To mitigate this, incremental-based methods are proposed. We first introduce incremental block-coordinate descent (I-BCD) for the decentralized ML, which can reduce communication costs at the expense of running time. To accelerate the convergence speed, an asynchronous parallel incremental BCD (API-BCD) method is proposed, where multiple devices/agents are active in an asynchronous fashion. We derive convergence properties for the proposed methods. Simulation results also show that our API-BCD method outperforms state of the art in terms of running time and communication costs.", "venue": "IEEE Transactions on Big Data", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-02-07", "journal": {"name": "IEEE Transactions on Big Data", "pages": "1252-1259", "volume": "9"}, "authors": [{"authorId": "2149052445", "name": "Hao Chen"}, {"authorId": "1845874192", "name": "Yu Ye"}, {"authorId": "2099594473", "name": "Ming Xiao"}, {"authorId": "1707959", "name": "M. Skoglund"}], "citations": [{"paperId": "3254e5936993e7446ac4d987ddb512991923b2fe", "title": "A Multi-Token Coordinate Descent Method for Semi-Decentralized Vertical Federated Learning"}, {"paperId": "9ec9e84b9bdb312a897c11a1ef187d84664820c3", "title": "A principled framework for the design and analysis of token algorithms"}, {"paperId": "6fab947d9932638753c83e15b14b54e268986bad", "title": "A Multi-Token Coordinate Descent Method for Vertical Federated Learning"}]}
