{"paperId": "8b41e6079322aae52250b33044f4ccc6dc1b73cb", "publicationVenue": {"id": "7e79de3e-93d0-413c-9f0d-e0288f94b4d5", "name": "Expert systems", "type": "journal", "alternate_names": ["Expert Syst", "Expert Systems", "Expert syst"], "issn": "0266-4720", "url": "https://onlinelibrary.wiley.com/journal/14680394"}, "title": "Energy optimization in path arbitrary wireless sensor network", "abstract": "A network of wireless sensors is a self‐infrastructure approach with many sensory nodes. The distributed sensory nodes communicate with each other via sensory points. In wireless sensor network (WSN), the sensory nodes collect information for healthcare, military and monitoring systems. Such networks require an exclusive arrangement of the nodes to challenge inherent limitations and energy deficiency. The conventional design of a communication system consumes more energy with high latency causing degraded performance. This study provided a machine learning‐based path optimization mechanism using the least energy resources in designing an effective wireless network system with enhanced three measures of network performance, including throughput, packet delivery efficiency and energy usage. The proposed methodology is validated through network simulation tools.", "venue": "Expert systems", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-03-16", "journal": {"name": "Expert Systems", "volume": "41"}, "authors": [{"authorId": "2058535228", "name": "B. Goud"}, {"authorId": "144013381", "name": "T. Shankar"}, {"authorId": "123967928", "name": "Basant Sah"}, {"authorId": "2014972", "name": "Dr Rajanikanth Aluvalu"}], "citations": [{"paperId": "4f030d8c5657796c12b4b9dabb341674dbbfeb87", "title": "DSRO based data annotation with improved EfficientNet for forest fire detection using image processing in IoT environment"}, {"paperId": "e18c621fe294220b0a3d3f57f7d02c7353bb3440", "title": "Recent trends and advances in machine learning challenges and applications for industry 4.0"}]}
