{"paperId": "8b4672d7cee1838329a6ba79e796f1ea866b0e3b", "publicationVenue": {"id": "e0174555-0649-4c3e-b2d8-519443892039", "name": "International Conference on Artificial Intelligence and Soft Computing", "type": "conference", "alternate_names": ["Int Conf Artif Intell Soft Comput", "ICAISC"], "url": "http://www.wikicfp.com/cfp/program?id=1277"}, "title": "Towards Edge Computing for 6G Internet of Everything: Challenges and Opportunities", "abstract": "The Internet of Everything (IoE)-based smart services are becoming more prominent as a result of the growing demands placed on wireless networks. Despite 5G having the ability to serve a wide range of IoE-based applications, they are unable to fully satisfy the needs of the newest intelligent systems. Therefore, 6G is the next generation for the IoT, IoE, and cellular networks, which aim to significantly improve smart services quality, such as maximum throughput and reduced latency. The number of internet-connected smart devices grows exponentially on a daily basis, resulting in Big Data. Several other cloud-based implementations use data centers as centralized servers for handling data collected by edge devices. This model places ever-increasing demands on computational infrastructure and communication, with unavoidable consequences for Experience and Quality-of-Service. By attempting to obtain cloud abilities closer to end users, edge computing is a novel technology which enables the development for 6G by attempting to overcome typical cloud weaknesses such as high latency and a lack of security. The purpose of this paper is to discuss challenges and opportunities in edge computing technology in 6G IoE.", "venue": "International Conference on Artificial Intelligence and Soft Computing", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-01-23", "journal": {"name": "2023 1st International Conference on Advanced Innovations in Smart Cities (ICAISC)", "pages": "1-6"}, "authors": [{"authorId": "2156467678", "name": "Abdulwadood Alawadhi"}, {"authorId": "102330835", "name": "Abdullah Almogahed"}, {"authorId": "71962772", "name": "E. Azrag"}], "citations": [{"paperId": "cc9dfa572dcda98b628e9f13e674b7e241b693d9", "title": "Development of IoE-Edge-AI Architecture For Landslide Early Warning System"}, {"paperId": "d4a1dc6746c8ba568bc37824b11095bf841144b1", "title": "Deep Learning Techniques in Mobile Edge Computing for Internet of Medical Things"}, {"paperId": "45dfa42c37c2e4b8804592b5726f623f247ec32f", "title": "6G—Enabling the New Smart City: A Survey"}]}
