{"paperId": "8b46766ec9ed1779f3cd6f28a20dc34d9ccfa014", "publicationVenue": {"id": "373104e5-1f99-4648-b90a-c19a1bab12f4", "name": "Journal of Research on Educational Effectiveness", "type": "journal", "alternate_names": ["J Res Educ Eff"], "issn": "1934-5747", "url": "https://erlbaum.com/", "alternate_urls": ["http://www.informaworld.com/openurl?genre=journal&issn=1934-5747", "http://www.tandfonline.com/action/aboutThisJournal?journalCode=uree20&show=aimsScope", "http://www.tandfonline.com/loi/uree20"]}, "title": "A Commentary on Construct Validity When Using Operational Virtual Learning Environment Data in Effectiveness Studies", "abstract": "Abstract Virtual learning environments (VLEs) are increasingly used at-scale in educational contexts to facilitate teaching and promote learning, and the data they produce can be used for educational research purposes. Meanwhile, the U.S. Department of Education’s Office of Educational Technology has repeatedly emphasized the importance of using evidence to validate claims from VLE-based educational research. Although VLE data can provide some affordances for conducting educational research, we argue that many challenges can arise with respect to providing evidence for construct validity. The objective of this commentary is to encourage educational researchers using operational, at-scale VLE data to align their data and intended constructs to a theoretical framework of construct validity threats in order to develop a comprehensive set of actionable solutions. We use examples from our research project as a demonstration resource for performing such an alignment.", "venue": "Journal of Research on Educational Effectiveness", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2019-10-02", "journal": {"name": "Journal of Research on Educational Effectiveness", "pages": "750 - 759", "volume": "12"}, "authors": [{"authorId": "1403600128", "name": "A. Huggins-Manley"}, {"authorId": "2237697965", "name": "Carole R. Beal"}, {"authorId": "2240433543", "name": "Sidney K. D’Mello"}, {"authorId": "2237697038", "name": "Walter L. Leite"}, {"authorId": "2237698411", "name": "Dyugu Dee Cetin-Berber"}, {"authorId": "2145183336", "name": "Dongho Kim"}, {"authorId": "2244286747", "name": "Danielle S. McNamara"}], "citations": [{"paperId": "6c2688a3e379f684f084c37440fa73074a04ce5b", "title": "Unreliable Continuous Treatment Indicators in Propensity Score Analysis."}, {"paperId": "1d789fd8ee40d94877d83f484a71c3539f114b83", "title": "Classroom Assessment and Instructional Modes: An Exploration of School-Level Contextualized Psychometric Challenges"}, {"paperId": "c79c2dc3a284f97a35345c8b9fab38b3351b675c", "title": "Using Twins to Assess What Might Have Been: The Co-twin Control Design"}, {"paperId": "e5b08ccb91a846dd454dde2fd2b4823c0e13aba5", "title": "Using Performance Measures to Predict Early Childhood Reading Outcomes: An Exploratory Longitudinal Analysis"}, {"paperId": "6a661a9dd65f3dc77144187df707628df17be889", "title": "Multilevel Mixture Modeling with Propensity Score Weights for Quasi-Experimental Evaluation of Virtual Learning Environments"}, {"paperId": "7a600284aac9121143dac09c8d6f6d938a90d34b", "title": "The Evolving Assessment Landscape and Adaptive Instructional Systems - Moving Beyond Good Intentions"}, {"paperId": "abc956752c3610d689c4676a0ebecb6db3ad7c1d", "title": "Exploring student and teacher usage patterns associated with student attrition in an open educational resource-supported online learning platform"}, {"paperId": "7a0e8978ece0368b6e2c6566a1e2e317f32d6e61", "title": "Education Research in a New Data Environment: Special Issue Introduction"}]}
