{"paperId": "8b4e6d422a6fd041ea1979b40d299f56a2382bd9", "publicationVenue": {"id": "270b9ee4-7c1e-4371-a62b-46100377ae2d", "name": "International Conference on Knowledge Discovery and Information Retrieval", "type": "conference", "alternate_names": ["KDIR", "Int Conf Knowl Discov Inf Retr"]}, "title": "Towards Tracking Provenance from Machine Learning Notebooks", "abstract": ": Machine learning (ML) pipelines are constructed to automate every step of ML tasks, transforming raw data into engineered features, which are then used for training models. Even though ML pipelines provide beneﬁts in terms of ﬂexibility, extensibility, and scalability, there are many challenges when it comes to their reproducibility and data dependencies. Therefore, it is crucial to track and manage metadata and provenance of ML pipelines, including code, model, and data. The provenance information can be used by data scientists in developing and deploying ML models. It improves understanding complex ML pipelines and facilitates analyzing, debugging, and reproducing ML experiments. In this paper, we discuss ML use cases, challenges, and design goals of an ML provenance management tool to automatically expose the metadata. We introduce MLProvLab, a JupyterLab extension, to automatically identify the relationships between data and models in ML scripts. The tool is designed to help data scientists and ML practitioners track, capture, compare, and visualize the provenance of machine learning notebooks.", "venue": "International Conference on Knowledge Discovery and Information Retrieval", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"pages": "274-281"}, "authors": [{"authorId": "2136062866", "name": "Dominik Kerzel"}, {"authorId": "38718062", "name": "Sheeba Samuel"}, {"authorId": "1389035902", "name": "B. König-Ries"}], "citations": [{"paperId": "dd27ab07b19772a56616da96918dec1753d62c97", "title": "How Provenance helps Quality Assurance Activities in AI/ML Systems"}, {"paperId": "af5b0366e78d05034fa5df391ca0350c92dbcabf", "title": "Human-Centered Approaches for Provenance in Automated Data Science"}]}
