{"paperId": "8b53b6b333f11c77c6cd88995d0e2575e6e9823b", "publicationVenue": {"id": "9cb29d4c-aff5-4a8d-8ae4-6a2cd440519d", "name": "International Conference on Advanced Communication Technology", "type": "conference", "alternate_names": ["Int Conf Adv Commun Technol", "ICACT"]}, "title": "Dynamic Weighted Hybrid Recommender Systems", "abstract": "Recommender Systems (RSs) have emerged since the mid-90s for dealing with the problem of information overload. They are commonly defined as software tools and techniques that serve as an assistant providing suggestions to the users. The two most familiar recommendation techniques are probably Collaborative filtering (CF) and Content-based filtering (CBF). Whereas CF computes recommendations based on past ratings of users with similar preferences, CBF assumes that each user operates independently, thus exploits only information derived from item features. Technically speaking, the performance of every single recommendation algorithm is limited and each has its own strengths and weaknesses, so recently more attentions are paid to the hybrid recommendation algorithms. In this work, we focus on the weighted hybridization and rather than using fixed weighted for the combination, we aim to propose a simple method to dynamic weight a combination of CF and CBF. Our experimental results on one of the most popular public datasets in the field of RSs - MovieLens have verified the effectiveness of our strategy against the traditional CF, and CBF approaches. It not only boost the prediction performance, but also alleviate the problem of new item cold start.", "venue": "International Conference on Advanced Communication Technology", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-02-01", "journal": {"name": "2020 22nd International Conference on Advanced Communication Technology (ICACT)", "pages": "644-650"}, "authors": [{"authorId": "30484925", "name": "Hong-Quan Do"}, {"authorId": "1628042637", "name": "T. Le"}, {"authorId": "46550567", "name": "Byeongnam Yoon"}], "citations": [{"paperId": "bf7ba5e8da01d82c006059d4fd78954f5d777b36", "title": "What rating they will probably give: A cognitive diagnosis approach for recommending items based on polytomous responses and latent attributes"}, {"paperId": "012ade7e82b64b3418a8dd8f7a95175f14494fad", "title": "An Intelligent Movies Recommendation System Based Facial Attributes Using Machine Learning"}, {"paperId": "6e47e3ed6654ba9b872c8e1f6741e433b535c311", "title": "Petpaws: A Comprehensive Dataset and Recommender System for Canine and Feline Breeds"}, {"paperId": "79484c70a2226ac69d15808babfb1cf3b7f1fca6", "title": "HypeRS: Building a Hypergraph-driven ensemble Recommender System"}, {"paperId": "55aceaa68ea3a784ef26d5ab4707db34465cb5d3", "title": "Candidate project selection in cross project defect prediction using hybrid method"}, {"paperId": "80670111d7f473d5ae9e5b300bc49850d3ac1fdb", "title": "A Hybrid Book Recommendation System for University Library"}, {"paperId": "4e2de64e331de1dc77225c9debd38b4a01a054db", "title": "A Systematic Literature Review on the Hybrid Approaches for Recommender Systems"}, {"paperId": "2035fea180b60c7c50281513e304514ea0be79af", "title": "A Fast Clustering-based Recommender System for Big Data"}, {"paperId": "8551cc683869a141462f8a982e66ab06f8921e6c", "title": "Exploring the Impact of Hybrid Recommender Systems on Personalized Mental Health Recommendations"}, {"paperId": "c14cd6327742048549468bcc3050dd964fe811e2", "title": "A Cognitive Diagnosis Approach for Recommending Items Based on Polytomous Responses and Latent Attributes"}, {"paperId": "8c5ae8cf31e36be606421b2aa1cd3cf25e17b103", "title": "A Hybrid Movies Recommendation System Based on Demographics and Facial Expression Analysis using Machine Learning"}, {"paperId": "854d3c15eb1ebb6a57b4ea88817b4c6087c7bd04", "title": "Hybrid Recommendation Systems: A State of Art"}, {"paperId": "058f7abebc901c764ac629c91736ae1a039ee155", "title": "HYBRID RECOMMENDATION SYSTEM TO SOLVE COLD START PROBLEM"}]}
