{"paperId": "8b6bd6ba05d305a2bbaf33ce7a3ce5edb292cdc7", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Advanced Supervision of Smart Buildings Using a Novel Open-Source Control Platform", "abstract": "Gathering data and monitoring performance are at the heart of energy efficiency and comfort securing strategies in smart buildings. Therefore, it is crucial to present the obtained data to the user or administrator of such a building in an appropriate form. Moreover, evaluating the data in real time not only helps to maintain comfort, but also allows for a timely response from the user or operator to a possible fault. Continuous online monitoring and analysis of process behaviour, which is referred to as advanced supervision, is addressed in this paper by developing a procedure that will form an artificial operator autonomously supervising process. After introducing several techniques that are used for signal analysis, we propose an approach to advanced supervision of processes in smart buildings or other industrial control systems. The developed procedure is implemented on a control system platform that is particularly suitable for this purpose. Moreover, this platform includes a framework that provides support for the implementation of advanced control techniques and it is based on open-source tools, which is rarely seen in industrial applications. The developed advanced supervision procedure has been tested in simulation as well as in a practical case study using a real two-storey family house.", "venue": "Italian National Conference on Sensors", "year": 2020, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-12-29", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "21"}, "authors": [{"authorId": "1395866927", "name": "Peter Minarčík"}, {"authorId": "32062087", "name": "H. Procházka"}, {"authorId": "9294976", "name": "M. Gulan"}], "citations": [{"paperId": "3eca9c12131c17c2790c0517fff174dcaff7001f", "title": "Scalable decarbonisation using automated operation optimisation"}, {"paperId": "87aaf53655390f8e99a6c409d803bbe408bfaba4", "title": "A Data-Driven Identification Procedure for HVAC Processes with Laboratory and Real-World Validation"}, {"paperId": "1c7a41ba6d708c5d837ef7f6467496c12496dcc2", "title": "Effect of HVAC’s Management on Indoor Thermo-Hygrometric Comfort and Energy Balance: In Situ Assessments on a Real nZEB"}, {"paperId": "8d8ff11ad52b0c63c6076503f237912e61479f06", "title": "Intelligent supervision concept integrated into a laboratory HVAC system"}, {"paperId": "4d0d51501f5af9bd2eb2d7a37fc924756fe8bccb", "title": "An Experimental Platform for Monitoring, Identification, and Control of HVAC Processes*"}]}
