{"paperId": "8b713dd8ea2a77bcabf344070715dfa9caf89852", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Critical Steps and Conditions to Be Included in a Business Model in Logistics, Seeking Competitive Advantage from the Perspective of the Modern Digital Age and Industry 4.0", "abstract": "The main purpose of this study is to research the literature and examine how logistics companies can effectively integrate modern digital technologies of Industry 4.0 internally and then present the most critical steps and conditions that determine the successful operation of an innovative business model in logistics, as well as the expected benefits of this process. This study was written entirely as a literature review. Four steps of literature review research were completed: (a) initial formulation of the problem, (b) search of literature sources, (c) selection and evaluation of articles, and d) final classification and presentation of data. The results show that the most critical steps and conditions that contribute to the successful adoption of new Industry 4.0 technologies in the business models of logistics companies are Business Model Innovation, Digital Transformation, Quality 4.0, Human Resource Management, and Logistics 4.0. These critical prerequisites and Industry 4.0 architecture are now at the forefront of logistics, proving the key role they play in modernizing a business and gaining competitive advantage, and to fully reap these benefits, businesses must be prepared to adapt their organizational culture, embrace change, and invest in the necessary resources.", "venue": "Applied Sciences", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2024-03-23", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "2293482267", "name": "Panagiotis Tsarouhas"}, {"authorId": "2293483848", "name": "Nikolaos Papaevangelou"}], "citations": []}
