{"paperId": "8b7210353641326affab4b57567093f6a03145b2", "publicationVenue": null, "title": "Functional inferences over heterogeneous data", "abstract": "Inference enables an agent to create new knowledge from old or discover implicit relationships between concepts in a knowledge base (KB), provided that appropriate techniques are employed to deal with ambiguous, incomplete and sometimes erroneous data. The ever-increasing volumes of KBs on the web, available for use by automated systems, present an opportunity to leverage the available knowledge in order to improve the inference process in automated query answering systems. This thesis focuses on the FRANK (Functional Reasoning for Acquiring Novel Knowledge) framework that responds to queries where no suitable answer is readily contained in any available data source, using a variety of inference operations. Most question answering and information retrieval systems assume that answers to queries are stored in some form in the KB, thereby limiting the range of answers they can find. We take an approach motivated by rich forms of inference using techniques, such as regression, for prediction. For instance, FRANK can answer “what country in Europe will have the largest population in 2021?\" by decomposing Europe geo-spatially, using regression on country population for past years and selecting the country with the largest predicted value. Our technique, which we refer to as Rich Inference, combines heuristics, logic and statistical methods to infer novel answers to queries. It also determines what facts are needed for inference, searches for them, and then integrates the diverse facts and their formalisms into a local query-specific inference tree. Our primary contribution in this thesis is the inference algorithm on which FRANK works. This includes (1) the process of recursively decomposing queries in way that allows variables in the query to be instantiated by facts in KBs; (2) the use of aggregate functions to perform arithmetic and statistical operations (e.g. prediction) to infer new values from child nodes; and (3) the estimation and propagation of uncertainty values into the returned answer based on errors introduced by noise in the KBs or errors introduced by aggregate functions. We also discuss many of the core concepts and modules that constitute FRANK. We explain the internal “alist” representation of FRANK that gives it the required flexibility to tackle different kinds of problems with minimal changes to its internal representation. We discuss the grammar for a simple query language that allows users to express queries in a formal way, such that we avoid the complexities of natural", "venue": "", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "3449903", "name": "Kwabena Nuamah"}], "citations": [{"paperId": "1b63bd8524cae254fb3c8eeaf52a2a4ab38a1986", "title": "ALIST: Associative Logic for Inference, Storage and Transfer. A Lingua Franca for Inference on the Web"}, {"paperId": "6b68d95b9d502b8c7f5f0c014e02a6f65405218c", "title": "Combining Deductive and Statistical Explanations in the FRANK Query Answering System"}, {"paperId": "de9e7476f3891c2aa4da3d09732dc665ae700d79", "title": "Explainable Inference in the FRANK Query Answering System"}, {"paperId": "206b92fbbb0fea2a0f484296baf22756aa8d4300", "title": "Towards Mathematical AI via a Model of the Content and Process of Mathematical Question and Answer Dialogues"}, {"paperId": "ddee3487f3e3c05e7844ce9a50966cdf394afb70", "title": "Unified Decomposition-Aggregation (UDA) Rules: Dynamic, Schematic, Novel Axioms"}, {"paperId": "bfde5eeea6751a6cfa8a7789aed51da9f430eb29", "title": "Integrating Paraphrasing into the FRANK QA System"}, {"paperId": "a3862fce87783b63a89cebc841f48644f0c41d8e", "title": "GPy-ABCD: A Configurable Automatic Bayesian Covariance Discovery Implementation"}]}
