{"paperId": "8b73701060de3b46a21278ff99428b5d7358f1ae", "publicationVenue": {"id": "b4b9c2ab-3b92-4da7-a4ae-26c8247300d0", "name": "International Conference on Wireless Communications and Mobile Computing", "type": "conference", "alternate_names": ["IWCMC", "Int Conf Wirel Commun Mob Comput"], "url": "http://iwcmc.com/"}, "title": "Study of Nature Inspired Power-aware Wake-Up Scheduling Mechanisms in WSN", "abstract": "The Internet of Things (IoT) has the potentialities to advance the concretisation of the smart world through a wide interaction between the human society with its physical environment. This interaction is enabled by Wireless Sensor Network (WSN) used to identify and to interpret contexts. However, the IoT and WSN have intrinsically challenges, particularly Network Lifetime (NL) maximisation. In this context, researchers have developed power-aware mechanisms for WSN and IoT. These mechanisms delay the battery depletion of a sensor node and extend the NL to ensure continuous full operational network activity. Accordingly, in this paper, we review and discuss various recent contributions related to nature inspired power-aware wake-up scheduling approaches. Furthermore, we present a comprehensive taxonomy of the various nature-inspired wake-up schedule mechanisms. Besides this paper provides for the reviewed approaches usability contexts.", "venue": "International Conference on Wireless Communications and Mobile Computing", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2020-06-01", "journal": {"name": "2020 International Wireless Communications and Mobile Computing (IWCMC)", "pages": "2154-2159"}, "authors": [{"authorId": "2330607", "name": "L. Chaari"}, {"authorId": "1414952523", "name": "Sarrah El-Kaffel"}, {"authorId": "2818872", "name": "A. B. Mnaouer"}, {"authorId": "2265946", "name": "F. Touati"}], "citations": [{"paperId": "0b0b86a9095d6df1ea64aba14552373cf6b59b58", "title": "Artificial intelligence implication on energy sustainability in Internet of Things: A survey"}, {"paperId": "deddad91a5a68316da74f7e594d7dfc5ae21e084", "title": "An Adaptive Framework Using Machine Learning in Wireless Sensor Network"}]}
