{"paperId": "8b77cb298e119ed2010a7a2e1cd1b003cbadabe8", "publicationVenue": {"id": "1e33b3be-b2ab-46e9-96e8-d4eb4bad6e44", "name": "Annual Meeting of the Association for Computational Linguistics", "type": "conference", "alternate_names": ["Annu Meet Assoc Comput Linguistics", "Meeting of the Association for Computational Linguistics", "ACL", "Meet Assoc Comput Linguistics"], "url": "https://www.aclweb.org/anthology/venues/acl/"}, "title": "Towards Fine-grained Classification of Climate Change related Social Media Text", "abstract": "With climate change becoming a cause of concern worldwide, it becomes essential to gauge people’s reactions. This can help educate and spread awareness about it and help leaders improve decision-making. This work explores the fine-grained classification and Stance detection of climate change-related social media text. Firstly, we create two datasets, ClimateStance and ClimateEng, consisting of 3777 tweets each, posted during the 2019 United Nations Framework Convention on Climate Change and comprehensively outline the dataset collection, annotation methodology, and dataset composition. Secondly, we propose the task of Climate Change stance detection based on our proposed ClimateStance dataset. Thirdly, we propose a fine-grained classification based on the ClimateEng dataset, classifying social media text into five categories: Disaster, Ocean/Water, Agriculture/Forestry, Politics, and General. We benchmark both the datasets for climate change stance detection and fine-grained classification using state-of-the-art methods in text classification. We also create a Reddit-based dataset for both the tasks, ClimateReddit, consisting of 6262 pseudo-labeled comments along with 329 manually annotated comments for the label. We then perform semi-supervised experiments for both the tasks and benchmark their results using the best-performing model for the supervised experiments. Lastly, we provide insights into the ClimateStance and ClimateReddit using part-of-speech tagging and named-entity recognition.", "venue": "Annual Meeting of the Association for Computational Linguistics", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": null, "journal": {"pages": "434-443"}, "authors": [{"authorId": "2165225721", "name": "Roopal Vaid"}, {"authorId": "1384359611", "name": "Kartikey Pant"}, {"authorId": "2045067", "name": "Manish Shrivastava"}], "citations": [{"paperId": "57f1c95b15e50aab0ddb50699977290e2bc9a03e", "title": "DOWN: Dynamic Order Weighted Network for Fine-grained Category Discovery"}, {"paperId": "d839519477bd2f2055ec189f796bce578c578102", "title": "Foundation Models for Weather and Climate Data Understanding: A Comprehensive Survey"}, {"paperId": "d7edb8d07a7acabee7cc785e06f510261bc9365f", "title": "DNA: Denoised Neighborhood Aggregation for Fine-grained Category Discovery"}, {"paperId": "166b92d792ce75ae3cb43d17928622d8fe9e1323", "title": "Intensity-Valued Emotions Help Stance Detection of Climate Change Twitter Data"}, {"paperId": "95eab0b0ec185416fd25e44e0ffb2cdf52cb5fe2", "title": "Towards sentiment and Temporal Aided Stance Detection of climate change tweets"}, {"paperId": "11971963b2a60f39ae8c07a0e31f6c992d4c7e36", "title": "Conflicts, Villains, Resolutions: Towards models of Narrative Media Framing"}, {"paperId": "bdcf9adaf7e8cf315d74a13cdbda6e4682609d62", "title": "A Multi-task Model for Emotion and Offensive Aided Stance Detection of Climate Change Tweets"}, {"paperId": "7a1ddb1ccf78f43f3c8ca9d0963c4782db8a5b85", "title": "Towards Answering Climate Questionnaires from Unstructured Climate Reports"}, {"paperId": "924036c17537adc8574a1476bf13d9d17a6eebae", "title": "ClimaBench: A Benchmark Dataset For Climate Change Text Understanding in English"}, {"paperId": "6dc2ddfc58f772862d114673b1449b4bfce26320", "title": "Communicating Climate Change: A Comparison Between Tweets and Speeches by German Members of Parliament"}]}
