{"paperId": "8b86875107b6cb7c2074ba94c0dd66093c618d00", "publicationVenue": {"id": "9efb20cf-7484-450d-8245-12dfbf639d3e", "name": "Environmental Science and Technology", "type": "journal", "alternate_names": ["Environ Sci  Technol", "Environ Sci Technol", "Environmental Science & Technology"], "issn": "0013-936X", "url": "https://pubs.acs.org/journal/esthag", "alternate_urls": ["http://pubs.acs.org/journals/esthag/", "https://pubs.acs.org/page/esthag/about.html", "http://pubs.acs.org/journals/esthag/index.html"]}, "title": "Mass-Balance-Consistent Geological Stock Accounting: A New Approach toward Sustainable Management of Mineral Resources", "abstract": "Global resource extraction raises concerns about environmental pressures and the security of mineral supply. Strategies to address these concerns depend on robust information on natural resource endowments, and on suitable methods to monitor and model their changes over time. However, current mineral resources and reserves reporting and accounting workflows are poorly suited for addressing mineral depletion or answering questions about the long-term sustainable supply. Our integrative review finds that the lack of a robust theoretical concept and framework for mass-balance (MB)-consistent geological stock accounting hinders systematic industry-government data integration, resource governance, and strategy development. We evaluate the existing literature on geological stock accounting, identify shortcomings of current monitoring of mine production, and outline a conceptual framework for MB-consistent system integration based on material flow analysis (MFA). Our synthesis shows that recent developments in Earth observation, geoinformation management, and sustainability reporting act as catalysts that make MB-consistent geological stock accounting increasingly feasible. We propose first steps for its implementation and anticipate that our perspective as “resource realists” will facilitate the integration of geological and anthropogenic material systems, help secure future mineral supply, and support the global sustainability transition.", "venue": "Environmental Science and Technology", "year": 2024, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2024-01-02", "journal": {"name": "Environmental Science & Technology", "pages": "971 - 990", "volume": "58"}, "authors": [{"authorId": "2277596072", "name": "Mark U Simoni"}, {"authorId": "2277596447", "name": "Johannes A Drielsma"}, {"authorId": "2244496686", "name": "Magnus Ericsson"}, {"authorId": "2277596445", "name": "Andrew G Gunn"}, {"authorId": "2277595076", "name": "Sigurd Heiberg"}, {"authorId": "2277595074", "name": "Tom A Heldal"}, {"authorId": "49031961", "name": "N. T. Nassar"}, {"authorId": "115764968", "name": "Evi Petavratzi"}, {"authorId": "2277596701", "name": "D. B. Müller"}], "citations": []}
