{"paperId": "8b9f53687682e960482a329a43e422d376b7677e", "publicationVenue": {"id": "0be0e7dd-a7b1-46dc-abb3-5226ed0e2289", "name": "IEEE International Conference on Cluster Computing", "type": "conference", "alternate_names": ["Int Conf Clust Comput", "IEEE Int Conf Clust Comput", "International Conference on Cluster Computing", "CLUSTER"], "url": "http://www.clustercomp.org/"}, "title": "Exploring HPC and Big Data Convergence: A Graph Processing Study on Intel Knights Landing", "abstract": "The question \"Can big data and HPC infrastructure converge?\" has important implications for many operators and clients of modern computing. However, answering it is challenging. The hardware is currently different, and fast evolving: big data uses machines with modest numbers of fat cores per socket, large caches, and much memory, whereas HPC uses machines with larger numbers of (thinner) cores, non-trivial NUMA architectures, and fast interconnects. In this work, we investigate the convergence of big data and HPC infrastructure for one of the most challenging application domains, the highly irregular graph processing. We contrast through a systematic, experimental study of over 300,000 core-hours the performance of a modern multicore, Intel Knights Landing (KNL) and of traditional big data hardware, in processing representative graph workloads using state-of-the-art graph analytics platforms. The experimental results indicate KNL is convergence-ready, performance-wise, but only after extensive and expert-level tuning of software and hardware parameters.", "venue": "IEEE International Conference on Cluster Computing", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2018-09-01", "journal": {"name": "2018 IEEE International Conference on Cluster Computing (CLUSTER)", "pages": "66-77"}, "authors": [{"authorId": "2860260", "name": "Alexandru Uta"}, {"authorId": "1784556", "name": "A. Varbanescu"}, {"authorId": "51934225", "name": "Ahmed Musaafir"}, {"authorId": "51925541", "name": "Chris Lemaire"}, {"authorId": "1760940", "name": "A. Iosup"}], "citations": [{"paperId": "35cb6c17693ddec0d3ceaa598f3cd451637f08ea", "title": "iQAN: Fast and Accurate Vector Search with Efficient Intra-Query Parallelism on Multi-Core Architectures"}, {"paperId": "960a41ff2bcdb7df14023333569231901febd9e4", "title": "Accelerating Spark-Based Applications with MPI and OpenACC"}, {"paperId": "8f973517436e21e4e6f54b37837a9f6681d06265", "title": "The future is big graphs"}, {"paperId": "75b5c1fcbefb2d20840806bf4a175f3f785517db", "title": "Grade10: A Framework for Performance Characterization of Distributed Graph Processing"}, {"paperId": "d68d5fd09304f89b02ca83f558e53220c9fbac8d", "title": "Benchmarking Graph Data Management and Processing Systems: A Survey"}, {"paperId": "9d51705b3672b445ee5064929b8a2b06324d30b5", "title": "A Sampling-Based Tool for Scaling Graph Datasets"}, {"paperId": "35a6ba47dda46217d7d2f727e3171489f8927efa", "title": "A survey on evaluating and optimizing performance of Intel Xeon Phi"}, {"paperId": "5b6b2e63ee5b70119830c7c0bbf8a5dc37b752e9", "title": "The AtLarge Vision on the Design of Distributed Systems and Ecosystems"}, {"paperId": "e4a24d6fa86de0b79392e09cf07ce9d7f738d7c2", "title": "There are Trillions of Little Forks in the Road. Choose Wisely! - Estimating the Cost and Likelihood of Success of Constrained Walks to Optimize a Graph Pruning Pipeline"}, {"paperId": "6084b97c397e9379d690b736286cfbfeb32d0e8a", "title": "Principles and Foundations of Artificial Intelligence and Internet of Things Technology"}]}
