{"paperId": "8baaf1417187124122f888ef8fbde2b1008d5b11", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "A Comprehensive and Effective Framework for Traffic Congestion Problem Based on the Integration of IoT and Data Analytics", "abstract": "Traffic congestion is still a challenge faced by most countries of the world. However, it can be solved most effectively by integrating modern technologies such as Internet of Things (IoT), fog computing, cloud computing, data analytics, and so on, into a framework that exploits the strengths of these technologies to address specific problems faced in traffic management. Unfortunately, no such framework that addresses the reliability, flexibility, and efficiency issues of smart-traffic management exists. Therefore, this paper proposes a comprehensive framework to achieve a reliable, flexible, and efficient solution for the problem of traffic congestion. The proposed framework has four layers. The first layer, namely, the sensing layer, uses multiple data sources to ensure a reliable and accurate measurement of the traffic status of the streets, and forwards these data to the second layer. The second layer, namely, the fog layer, consumes these data to make efficient decisions and also forwards them to the third layer. The third layer, the cloud layer, permanently stores these data for analytics and knowledge discoveries. Finally, the fourth layer, the services layer, provides assistant services for traffic management. We also discuss the functional model of the framework and the technologies that can be used at each level of the model. We propose a smart-traffic light algorithm at level 1 for the efficient management of congestion at intersections, tweet-classification and image-processing algorithms at level 2 for reliable and accurate decision-making, and support services at level 4 of the functional model. We also evaluated the proposed smart-traffic light algorithm for its efficiency, and the tweet classification and image-processing algorithms for their accuracy.", "venue": "Applied Sciences", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-02-16", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "89420819", "name": "Yazed Alsaawy"}, {"authorId": "66478232", "name": "A. Alkhodre"}, {"authorId": "2154994764", "name": "Adnan Abi Abi Sen"}, {"authorId": "2274533180", "name": "Abdullah M. Alshanqiti"}, {"authorId": "2066759", "name": "W. A. Bhat"}, {"authorId": "1418073786", "name": "N. Bahbouh"}], "citations": [{"paperId": "e8c6f84f04e016c32661c9e123fea434e0563f18", "title": "A STUDY ON OPTIMIZING TRAFFIC SIGNAL CONTROL FOR IMPROVED TRAFFIC FLOW"}, {"paperId": "af8748748837a0ded6aab95311039dcb648ead03", "title": "Simulation-Based Traffic Management Model to Minimize the Vehicle Congestion in Traffic Signals"}, {"paperId": "5160a0f4a285c96389236528d22feff0f47c6494", "title": "Mobile crowdsensing with energy efficiency to control road congestion in internet cloud of vehicles: a review"}, {"paperId": "4f965fd7a696360e33bebbf0ec0c1bce8e34ec29", "title": "Enhanced Traffic Congestion Management with Fog Computing: A Simulation-based Investigation using iFog-Simulator"}, {"paperId": "53a4b520eba9cde96fcdc83c9d073806d534d326", "title": "Detecting image edges in IOT nodes without FPU"}, {"paperId": "eaace1ba176a561895684ed1e3389725beb24990", "title": "A new method for vulnerability and risk assessment of IoT"}, {"paperId": "a7e384545aeb411b22b6e747a226fb7870466d81", "title": "The Internet of Vehicles and Sustainability—Reflections on Environmental, Social, and Corporate Governance"}, {"paperId": "e88ad8314530bcdb4e2317f77b2bda5b5960f111", "title": "Special Issue on the Internet of Things (IoT) in Smart Cities"}, {"paperId": "f68efe1fcea8267635d514d9248b3068de6a6705", "title": "Artificial intelligence for visually impaired"}, {"paperId": "d685951b468ecfba1bde87c02e96adf4635bdb99", "title": "SUMO-Network: Generating and Remodeling Real World Map using osmWebWizard and NETEDIT"}, {"paperId": "76fb0fedbd3390b2fe5649e55771b10c1d77e3cd", "title": "Feasibility of Economic Forecasting Model Based on Intelligent Algorithm of Smart City"}, {"paperId": "7a33d789743458defb68318b906024f316b66d33", "title": "Using Singular Value Decomposition and Chaotic Maps for Selective Encryption of Video Feeds in Smart Traffic Management"}, {"paperId": "c7ff423b6251071f0624af4c1940cfbae9d306ef", "title": "Deep Learning for Resource Management in Internet of Things Networks: A Bibliometric Analysis and Comprehensive Review"}, {"paperId": "c8601cd16f2317b3952d9934ea879a96df42e896", "title": "ENCRYPTION-BASED SECURE FRAMEWORK FOR SMART TRAFFIC MANAGEMENT USING FOG COMPUTING"}]}
