{"paperId": "8baf091097e90426e061d4e2b31c77343f4d68d6", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "The Power of Internet of Things (IoT): Connecting the Dots with Cloud, Edge, and Fog Computing", "abstract": "The Internet of Things (IoT) is regarded as an improved communication system that has revolutionized traditional lifestyles. To function successfully, IoT requires a combination of cloud, fog, and edge computing architectures. Few studies have addressed cloud, fog, and edge computing simultaneously, comparing them and their issues, although several studies have looked into ways of integrating IoT with either one or two computing systems. Thus, this review provides a thorough understanding of IoT integration with these three computing architectures, as well as their respective applications and limitations. It also highlights the advantages, unresolved issues, future opportunities and directions of IoT integration with the computing systems to advance the IoT. IoT can use the Cloud's almost limitless resources to overcome technology restrictions, such as data processing, storage, and transmission. While edge computing can outperform cloud computing in many circumstances, IoT and edge computing become increasingly integrated as IoT devices increase. Cloud computing also poses a few issues, including managing time-sensitive IoT applications like video gaming, simulation, and streaming, which can be addressed by fog computing integrated with IoT. Due to the proximity of fog computing resources to the edge, data transfers and communication delays to the cloud can be reduced as a result of combining the two. The integration of IoT with cloud, fog, and edge computing will create new business prototypes and opportunities. Since IoT has the potential to greatly enhance connectivity infrastructure as an inevitable component of the future internet, further study is needed before it can be fully integrated.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-09-07", "journal": {"name": "ArXiv", "volume": "abs/2309.03420"}, "authors": [{"authorId": "2191712368", "name": "Shams Forruque Ahmed"}, {"authorId": "2237985506", "name": "Shanjana Shuravi"}, {"authorId": "2132098774", "name": "Shaila Afrin"}, {"authorId": "2237985695", "name": "Sabiha Jannat Rafa"}, {"authorId": "2221944125", "name": "Mahfara Hoque"}, {"authorId": "1764455", "name": "A. Gandomi"}], "citations": [{"paperId": "eec102aa233a3a82ce5c781883e50d7da4a556c0", "title": "Cloud Digital Forensics: Beyond Tools, Techniques, and Challenges"}]}
