{"paperId": "8bc2948db1836b0c0fa9fa7d026a9625c310cc63", "publicationVenue": {"id": "6dc66c37-9e89-4095-af22-25677efd948d", "name": "International Journal of Web Information Systems", "type": "journal", "alternate_names": ["Int J Web Inf Syst"], "issn": "1744-0084", "url": "https://www.emerald.com/insight/publication/issn/1744-0084", "alternate_urls": ["http://www.troubador.co.uk/ijwis/"]}, "title": "Ensemble incremental deep multiple layer perceptron model - sentiment analysis application", "abstract": "\nPurpose\nThe purpose of this paper is to enhance the accuracy of classification of streaming big data sets with lesser processing time. This kind of social analytics would contribute to society with inferred decisions at a correct time. The work is intended for streaming nature of Twitter data sets.\n\n\nDesign/methodology/approach\nIt is a demanding task to analyse the increasing Twitter data by the conventional methods. The MapReduce (MR) is used for quickest analytics. The online feature selection (OFS) accelerated bat algorithm (ABA) and ensemble incremental deep multiple layer perceptron (EIDMLP) classifier is proposed for Feature Selection and classification. Three Twitter data sets under varied categories are investigated (product, service and emotions). The proposed model is compared with Particle Swarm Optimization, Accelerated Particle Swarm Optimization, accelerated simulated annealing and mutation operator (ASAMO). Feature Selection algorithms and classifiers such as Naïve Bayes, support vector machine, Hoeffding tree and fuzzy minimal consistent class subset coverage with the k-nearest neighbour (FMCCSC-KNN).\n\n\nFindings\nThe proposed model is compared with PSO, APSO, ASAMO. Feature Selection algorithms, and classifiers such as Naïve Bayes (NB), support vector machine (SVM), Hoeffding Tree (HT), and Fuzzy Minimal Consistent Class Subset Coverage with the K-Nearest Neighbour (FMCCSC-KNN). The outcome of the work has achieved an accuracy of 99%, 99.48%, 98.9% for the given data sets with the processing time of 0.0034, 0.0024, 0.0053, seconds respectively.\n\n\nOriginality/value\nA novel framework is proposed for Feature Selection and classification. The work is compared with the authors’ previously developed classifiers with other state-of-the-art Feature Selection and classification algorithms.\n", "venue": "International Journal of Web Information Systems", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-08-19", "journal": {"name": "Int. J. Web Inf. Syst.", "pages": "714-727", "volume": "17"}, "authors": [{"authorId": "41196786", "name": "D. R. Devi"}, {"authorId": "144500365", "name": "S. Sasikala"}], "citations": [{"paperId": "b01ac789454390003cb515245cee099bdb96a027", "title": "Assessing public satisfaction of public service application using supervised machine learning"}]}
