{"paperId": "8bc71ad631a144720bfc4ff2a00be1516108eeb8", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "A SBC-Based Data Acquisition System: A Case Study on Smart Reclosers and Multiagent Systems", "abstract": "Efficiently handling faults and analyzing signals in power distribution systems is a persistent challenge. Previous studies proposed using smart devices, but most evaluations considered simulated environments. In this paper, we propose a novel approach to address signal acquisition and processing using a single board computer (SBC) to provide more local computational capabilities to reclosers. This paper addresses the challenge of using multiple software programs to digitize signals, monitor faults, and communicate with other reclosers for fault handling. We show the high-level software on the SBC can meet the requirements of the data acquisition system and provide high computational power for various local data processing tasks. The proposed hardware enables real-time signal acquisition with low latency and a reduced probability of sample loss, which is vital for accurate signal detection and analysis. We evaluate our approach in an in-house embedded system with communication capabilities, taking into account the multi-agent approach for handling faults in power distribution systems. Our results demonstrate the proposed system provides signals to the application without sample loss. Regarding noise levels, we measured error lower than 1%, and harmonic distortions smaller than 5% of the 50/60 Hz waveform, indicating minimal circuitry impact. We measured latencies around a few microseconds, which is crucial for fault detection. Finally, we present an evaluation setup that demonstrates an efficient process for restoring energy service in power distribution systems. Therefore, the proposed hardware shows promising performance for smart reclosers and other real-time data acquisition systems that require intensive local computations.", "venue": "IEEE Access", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "48988-49001", "volume": "11"}, "authors": [{"authorId": "143889954", "name": "Leonardo Ramalho"}, {"authorId": "1742244297", "name": "Ilan S. Correa"}, {"authorId": "2178393050", "name": "Marcos E. P. Monteiro"}, {"authorId": "3275617", "name": "D. Issicaba"}, {"authorId": "2217723812", "name": "T. V. Ferreira"}, {"authorId": "2217729810", "name": "Ricardo A. O. De Faria"}], "citations": []}
