{"paperId": "8be2e49416f59d4f87accd44b4e100427b2b6a74", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Blockchain for the Internet of Vehicles: A Decentralized IoT Solution for Vehicles Communication Using Ethereum", "abstract": "The concept of smart cities has become prominent in modern metropolises due to the emergence of embedded and connected smart devices, systems, and technologies. They have enabled the connection of every “thing” to the Internet. Therefore, in the upcoming era of the Internet of Things, the Internet of Vehicles (IoV) will play a crucial role in newly developed smart cities. The IoV has the potential to solve various traffic and road safety problems effectively in order to prevent fatal crashes. However, a particular challenge in the IoV, especially in Vehicle-to-Vehicle (V2V) and Vehicle-to-Infrastructure (V2I) communications, is to ensure fast, secure transmission and accurate recording of the data. In order to overcome these challenges, this work is adapting Blockchain technology for real time application (RTA) to solve Vehicle-to-Everything (V2X) communications problems. Therefore, the main novelty of this paper is to develop a Blockchain-based IoT system in order to establish secure communication and create an entirely decentralized cloud computing platform. Moreover, the authors qualitatively tested the performance and resilience of the proposed system against common security attacks. Computational tests showed that the proposed solution solved the main challenges of Vehicle-to-X (V2X) communications such as security, centralization, and lack of privacy. In addition, it guaranteed an easy data exchange between different actors of intelligent transportation systems.", "venue": "Italian National Conference on Sensors", "year": 2020, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-07-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "20"}, "authors": [{"authorId": "51902484", "name": "Rateb Jabbar"}, {"authorId": "2990031", "name": "Mohamed Kharbeche"}, {"authorId": "1397713765", "name": "K. Al-Khalifa"}, {"authorId": "2190149", "name": "M. Krichen"}, {"authorId": "1681669", "name": "Kamel Barkaoui"}], "citations": [{"paperId": "d2d3072db368773be7d2cce1dec3c3239ff7f09b", "title": "Copula: a decentralized solution for construction project monitoring using blockchain"}, {"paperId": "4f5c88bf5f6fb9e7802373cf4b696151fad5afb7", "title": "A decentralized prototype framework for peer-to-peer based electric car sharing services towards sustainable road transportation"}, {"paperId": "f8d89907004a225babd19d59d8046e4eea1b9d85", "title": "Leveraging big data analytics for intelligent transportation systems: optimize the internet of vehicles data structure and modeling"}, {"paperId": "147a811d9a34c9265a71818de9bc0249fbcab9f4", "title": "Efficient Packet Handling Mechanism In MQTT During Emergency Message Dissemination In Internet of Vehicles"}, {"paperId": "67645c84310d274f13fafda82c6e47afd5f961ab", "title": "ESP2CS: Securing Internet of Vehicles through Blockchain-enabled Communications and Payments"}, {"paperId": "37ca32d4d62d1ba707c5211138bcda6389b0ce6f", "title": "Blockchain-Enabled Federated Learning Approach for Vehicular Networks"}, {"paperId": "93da9f0bbee296a88cdff3529d17090946843a1d", "title": "Communicate Vehicle Accident Data to Blockchain for Secure and Reliable Record-Keeping Using Android Automotive Application"}, {"paperId": "d5402d9562b8ec6fcc73608b2a855d0fded373a9", "title": "VANET-Sec: A Framework to Secure Vehicular Ad-Hoc Networks Using a Permissioned Blockchain"}, {"paperId": "14c2fd361632ddc5e2227bc9915137baa45a4ee3", "title": "Using of Blockchain in the Context of Automotive Industry: A Survey"}, {"paperId": "3d05aff3d73ea942927f750062f5742c52e90661", "title": "Enabling secure lightweight mobile Narrowband Internet of Things (NB-IoT) applications using blockchain"}, {"paperId": "9017d1472afdb8b66cccb83c57f53f0074801a01", "title": "A Trustable and Secure Usage-Based Insurance Policy Auction Mechanism and Platform Using Blockchain and Smart Contract Technologies"}, {"paperId": "0de6c613d3407ef1946bd30a30bfd554b3c9e532", "title": "A multidimensional interpretation of Marxist globalization theory based on decentralized internet"}, {"paperId": "a51dd3e003a6f7885a98e89f4ca720e4da612ef0", "title": "Intelligent Transport System using Blockchain Technology"}, {"paperId": "fa1ebcf99ebea04a375f204406f26f306d49f6ef", "title": "A Secure Blockchain Enabled V2V Communication System Using Smart Contracts"}, {"paperId": "0f3f061a758edf91dd0acc6dee582018c1dd426c", "title": "5G-Enabled Cyber-Physical Systems for Smart Transportation Using Blockchain Technology"}, {"paperId": "d13a1b2331f9bd7432753bb64accf67270f36947", "title": "Data-driven review of blockchain applications in supply chain management: key research themes and future directions"}, {"paperId": "99033b3cfde68f00534ca9451e6329b7ec3a72c6", "title": "Blockchain‐based multi‐layered federated extreme learning networks in connected vehicles"}, {"paperId": "89aef9195c64ae08d505f9f140e560c5dad8e8de", "title": "Assessing the feasibility of Blockchain Technology in Automotive Industry"}, {"paperId": "dd59d18ca53158b3ffaeab122f13f4eae6673b74", "title": "Understanding Fusion of Internet of Vehicles with Blockchain : IoV and Blockchain"}, {"paperId": "e8128291d27d62433bf6cef7d2d0ee97d8741a36", "title": "Probit Cryptographic Blockchain for Secure Data Transmission in Intelligent Transportation Systems"}, {"paperId": "3d4a568465c65433af33d64780ce5ea4044adfb2", "title": "Secure 2 Tier Routing based on Vehicle Classification using Blockchain"}, {"paperId": "17909626dfd78933150de2de3f9936af073f5634", "title": "VBlock: A Blockchain-Based Tamper-Proofing Data Protection Model for Internet of Vehicle Networks"}, {"paperId": "5555bb10b81980d91823f79b3e918b6540bcaa2f", "title": "The Use of Blockchain in Aviation Safety Reporting Systems: A Framework Proposal"}, {"paperId": "4c867c2b00ca3474f608fdd626dece6f72bd4be4", "title": "The Internet of Things Security and Privacy: Current Schemes, Challenges and Future Prospects"}, {"paperId": "b9cc0159d4e1c6313d27f3b7a9bed91d982c37b1", "title": "An Intelligent Automated System for Detecting Malicious Vehicles in Intelligent Transportation Systems"}, {"paperId": "da696b3cd2a213f70a5278c123c9d63538fc1adc", "title": "Hybrid On/Off Blockchain Approach for Vehicle Data Management, Processing and Visualization Exemplified by the ADAPT Platform"}, {"paperId": "a477907cf6eb9c79a4dcf62bcc02157035795e6b", "title": "Privacy‐preserving federated learning cyber‐threat detection for intelligent transport systems with blockchain‐based security"}, {"paperId": "695181970b1517e97853f4968319b009b1924b2e", "title": "The big picture on the internet of things and the smart city: a review of what we know and what we need to know"}, {"paperId": "78bb887d4dc5609e3603468e89b0179682e2a9bd", "title": "Blockchain for Modern Applications: A Survey"}, {"paperId": "b141a7a234278986c4fdd6a1004ca00012b0b1a9", "title": "Communication mechanism of Internet of Things based on blockchain"}, {"paperId": "c03a5f5b53c54a1bc35ce4448fe1833dcc336a8f", "title": "Using Blockchain for Data Collection in the Automotive Industry Sector: A Literature Review"}, {"paperId": "6df1969d3f40ebf9550df0ca7eac3b3ad25e39d6", "title": "Internet of vehicles: concept, process, security aspects and solutions"}, {"paperId": "9e16ef8f6b7d917c67f45c5c248f1c5c84f9ab67", "title": "AnonSURP: an anonymous and secure ultralightweight RFID protocol for deployment in internet of vehicles systems"}, {"paperId": "444368942d937721afa7cdbab713803a89419586", "title": "A Scalable Big Data Framework for Real-Time Traffic Monitoring System"}, {"paperId": "1cb8277c7e033682555faf81da9fe0e2de44afd5", "title": "Blockchain-based solutions for smart mobility sustainability assurance"}, {"paperId": "e3bb4bf72f3e410fdaa83bf6905db4027f3ac993", "title": "Blockchain-enabled capabilities in transport operations: an overview of the literature"}, {"paperId": "e45dcdc47c2620c9722faae500a2b95d4c589b9d", "title": "Blockchain Application in Internet of Vehicles: Challenges, Contributions and Current Limitations"}, {"paperId": "5b3a6768a2fd198636398ca0c7b3028e2357fea8", "title": "Authentication and Identity Management of IoHT Devices: Achievements, Challenges, and Future Directions"}, {"paperId": "e94c004d80a33917182a3566f03439f7edc605ca", "title": "BLOCKCHAIN TECHNOLOGY AND INDUSTRY 4.0 AT AUTONOMOUS VEHICLES: A LITERATURE REVIEW"}, {"paperId": "50f057c8d44b9999063b1d9df04e2dcff01c532c", "title": "Design and development of automobile assembly model using federated artificial intelligence with smart contract"}, {"paperId": "4f261cfdbe5bcadc867af7b357ae30e1dd07794d", "title": "An Effective Framework of Private Ethereum Blockchain Networks for Smart Grid"}, {"paperId": "888459043e80f65c5e444c3f084884f43690be50", "title": "Study of integration of block chain and Internet of Things (IoT): an opportunity, challenges, and applications as medical sector and healthcare"}, {"paperId": "b3784507852bcce0b3e482cc8e53fdc21fb22ca5", "title": "Mobile edge computing task distribution and offloading algorithm based on deep reinforcement learning in internet of vehicles"}, {"paperId": "12a44bff1b60183c2a307f53ff1ac9c12a392d0f", "title": "Computing Paradigms in Emerging Vehicular Environments: A Review"}, {"paperId": "b38ac36a48904a1569c27a9cc34185d0d5793927", "title": "RC-chain: Reputation-based Crowdsourcing Blockchain for Vehicular Networks"}, {"paperId": "292409dc91f263153c9019e6f6b294f75ece8f6b", "title": "Blockchain Integration for IoT-Enabled V2X Communications: A Comprehensive Survey, Security Issues and Challenges"}, {"paperId": "ae53b3526d9f17caa9c65c3d26e9c9c7310d5d3a", "title": "Bibliometric Analysis: The Use of Blockchain Technology in Smart City Mapping Concept"}, {"paperId": "5f684a021d62e77c7160402ebd7cd050906642c2", "title": "Using Distributed Ledger Technologies in VANETs to Achieve Trusted Intelligent Transportation Systems"}, {"paperId": "82714bdc27af1d0b69692188614c5fc1f2975e0e", "title": "Blockchain Technology for Intelligent Transportation Systems: A Systematic Literature Review"}, {"paperId": "e298fa77ed00c4181030ebc3902a13e557422c50", "title": "An Extensive Blockchain Based Applications Survey: Tools, Frameworks, Opportunities, Challenges and Solutions"}, {"paperId": "d339b568e044349370691b28adec823900b4007a", "title": "Machine Learning for Industrial IoT Systems"}, {"paperId": "5ff5014b2a9e2bd8e2eb4b51681368f01a1c05c2", "title": "Smart contracts for automated control system in Blockchain based smart cities"}]}
