{"paperId": "8becf496d9e3583d6c3cc2d2515fd1a2317a7dd5", "publicationVenue": {"id": "838ca88f-3961-404a-ad64-3a2f95c65615", "name": "International Conference on Information Systems Security and Privacy", "type": "conference", "alternate_names": ["ICISSP", "Int Conf Inf Syst Secur Priv"]}, "title": "Bridging Knowledge Gaps in Security Analytics", "abstract": "In a cyber-physical world, the number of links between corporate assets is growing and infrastructures are becoming more complex. This and related developments significantly enlarge the attack surface of organizations. Additionally, more and more attacks do not exploit technical vulnerabilities directly but gain a foothold through phishing or social engineering. Since traditional security systems prove to be no longer sufficient to detect incidents effectively, humans and their specialized knowledge are becoming a critical security factor. Therefore, it is vital to maintain an overview of the cybersecurity knowledge spread across the entire company. However, there is no uniform understanding of knowledge in the field of security analytics. We aim to close this gap by formalizing knowledge and defining a conceptual knowledge model in the context of security analytics. This allows existing research to be better classified and shows that individual areas offer much potential for future research. In particular, the collaboration between domain experts but also between machines and employees could enable the exploitation of previously unused but crucial knowledge. For example, this knowledge is of great value for defining security rules in current security analytics systems. We introduce a proof of concept implementation using visual programming to showcase how even security novices can easily contribute their knowledge to security analytics.", "venue": "International Conference on Information Systems Security and Privacy", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"pages": "98-108"}, "authors": [{"authorId": "2044358892", "name": "Fabian Böhm"}, {"authorId": "40929870", "name": "Manfred Vielberth"}, {"authorId": "145178500", "name": "G. Pernul"}], "citations": [{"paperId": "023fe68dc019381912ab81abcd94f6ae3d813d30", "title": "BISCUIT - Blockchain Security Incident Reporting based on Human Observations"}, {"paperId": "07b586fd3fb606c93f7b7014e7b5f2b96ba7d254", "title": "Formalizing and Integrating User Knowledge into Security Analytics"}, {"paperId": "b40df0f5591ae056783364b7d7089b987e90a607", "title": "Visual Decision-Support for Live Digital Forensics"}, {"paperId": "85976698fc0598517c80dce46aea2bbffab37782", "title": "Augmented Reality and the Digital Twin: State-of-the-Art and Perspectives for Cybersecurity"}, {"paperId": "32fb802ac71f9ab2ee27e6044137e2ce364bb73f", "title": "A Flexible Security Analytics Service for the Industrial IoT"}]}
