{"paperId": "8becf144134e36245e4680a9f166d7582d4fda51", "publicationVenue": {"id": "dc6419f3-98b3-4718-bba0-6b6d6c3d192b", "name": "JMIR Medical Informatics", "type": "journal", "alternate_names": ["JMIR med informatics", "JMIR medical informatics", "JMIR Med Informatics"], "issn": "2291-9694", "url": "https://medinform.jmir.org/"}, "title": "Evaluation of Natural Language Processing for the Identification of Crohn Disease–Related Variables in Spanish Electronic Health Records: A Validation Study for the PREMONITION-CD Project", "abstract": "Background The exploration of clinically relevant information in the free text of electronic health records (EHRs) holds the potential to positively impact clinical practice as well as knowledge regarding Crohn disease (CD), an inflammatory bowel disease that may affect any segment of the gastrointestinal tract. The EHRead technology, a clinical natural language processing (cNLP) system, was designed to detect and extract clinical information from narratives in the clinical notes contained in EHRs. Objective The aim of this study is to validate the performance of the EHRead technology in identifying information of patients with CD. Methods We used the EHRead technology to explore and extract CD-related clinical information from EHRs. To validate this tool, we compared the output of the EHRead technology with a manually curated gold standard to assess the quality of our cNLP system in detecting records containing any reference to CD and its related variables. Results The validation metrics for the main variable (CD) were a precision of 0.88, a recall of 0.98, and an F1 score of 0.93. Regarding the secondary variables, we obtained a precision of 0.91, a recall of 0.71, and an F1 score of 0.80 for CD flare, while for the variable vedolizumab (treatment), a precision, recall, and F1 score of 0.86, 0.94, and 0.90 were obtained, respectively. Conclusions This evaluation demonstrates the ability of the EHRead technology to identify patients with CD and their related variables from the free text of EHRs. To the best of our knowledge, this study is the first to use a cNLP system for the identification of CD in EHRs written in Spanish.", "venue": "JMIR Medical Informatics", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-05-11", "journal": {"name": "JMIR Medical Informatics", "volume": "10"}, "authors": [{"authorId": "5451213", "name": "C. Montoto"}, {"authorId": "3131394", "name": "J. Gisbert"}, {"authorId": "34320295", "name": "I. Guerra"}, {"authorId": "35276097", "name": "R. Plaza"}, {"authorId": "9871479", "name": "R. Pajares Villarroya"}, {"authorId": "12603056", "name": "L. Moreno Almazán"}, {"authorId": "15577285", "name": "María Del Carmen López Martín"}, {"authorId": "16325567", "name": "Mercedes Domínguez Antonaya"}, {"authorId": "112884158", "name": "I. Vera Mendoza"}, {"authorId": "2055880439", "name": "J. Aparicio"}, {"authorId": "2143114541", "name": "V. Martínez"}, {"authorId": "3798041", "name": "I. Tagarro"}, {"authorId": "83875416", "name": "A. Fernandez-Nistal"}, {"authorId": "1916754", "name": "Lea Canales"}, {"authorId": "2154909144", "name": "Sebastian Menke"}, {"authorId": "6835305", "name": "F. Gomollón"}], "citations": [{"paperId": "7140f0d2f53acbdc0a5306120747622a29804613", "title": "Accurate, Robust, and Scalable Machine Abstraction of Mayo Endoscopic Subscores From Colonoscopy Reports."}, {"paperId": "41c9b43bf582225e312b9b264c30e1dcc1c7e211", "title": "Prevalence of cancer in patients with hypothyroidism: Analysis using big data tools."}, {"paperId": "a3bd488501d128410ee53c0a752b92457738d3ec", "title": "Patient journey of individuals tested for HCV in Spain: LiverTAI, a retrospective analysis of EHRs through natural language processing"}, {"paperId": "62158cfcb7d01aa7ecf3d5a7cedfd1def6fcf3fc", "title": "Using natural language processing to explore characteristics and management of patients with axial spondyloarthritis and psoriatic arthritis treated under real-world conditions in Spain: SpAINET study"}, {"paperId": "46e95081c9e1baaade68a3dceeb73dd5bce5563b", "title": "Validation of an Artificial Intelligence driven framework to automatically detect red flag symptoms in screening for rare diseases in electronic health records: hereditary transthyretin amyloidosis polyneuropathy as a key example"}, {"paperId": "5a0cc63cab869274700624741f44f379c304cb32", "title": "Natural Language Processing Approach for Learning Process Analysis in a Bioinformatics Course"}, {"paperId": "061bc6b6deb0e2e0ad3898c0175238ac8cfb54a7", "title": "Prevalencia de cáncer en pacientes con hipotiroidismo: análisis mediante herramientas de big data"}]}
