{"paperId": "8bf1e11b7bf477f87ce66d159000133da19bd1b3", "publicationVenue": {"id": "9cc701cf-1f49-4121-8ea9-11bac24d61ad", "name": "IEEE Transactions on Big Data", "type": "journal", "alternate_names": ["IEEE Trans Big Data"], "issn": "2332-7790", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=6687317", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6687317", "https://ieeexplore.ieee.org/xpl/aboutJournal.jsp?punumber=6687317"]}, "title": "A Survey on Geographically Distributed Big-Data Processing Using MapReduce", "abstract": "Hadoop and Spark are widely used distributed processing frameworks for large-scale data processing in an efficient and fault-tolerant manner on private or public clouds. These big-data processing systems are extensively used by many industries, e.g., Google, Facebook, and Amazon, for solving a large class of problems, e.g., search, clustering, log analysis, different types of join operations, matrix multiplication, pattern matching, and social network analysis. However, all these popular systems have a major drawback in terms of locally distributed computations, which prevent them in implementing geographically distributed data processing. The increasing amount of geographically distributed massive data is pushing industries and academia to rethink the current big-data processing systems. The novel frameworks, which will be beyond state-of-the-art architectures and technologies involved in the current system, are expected to process geographically distributed data at their locations without moving entire raw datasets to a single location. In this paper, we investigate and discuss challenges and requirements in designing geographically distributed data processing frameworks and protocols. We classify and study batch processing (MapReduce-based systems), stream processing (Spark-based systems), and SQL-style processing geo-distributed frameworks, models, and algorithms with their overhead issues.", "venue": "IEEE Transactions on Big Data", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2017-07-06", "journal": {"name": "IEEE Transactions on Big Data", "pages": "60-80", "volume": "5"}, "authors": [{"authorId": "1724392", "name": "S. Dolev"}, {"authorId": "2260885", "name": "Patricia Florissi"}, {"authorId": "1795510", "name": "E. Gudes"}, {"authorId": "2028614385", "name": "Shantanu Sharma"}, {"authorId": "40547215", "name": "Ido Singer"}], "citations": [{"paperId": "9bd24c0f4f9c142380ee5c60d2f632b0476de3a5", "title": "Geographically distributed data management to support large-scale data analysis"}, {"paperId": "7e18f02a7097b8a56182a44dbe243a10b11f95cf", "title": "DAG-Aware Optimization for Geo-Distributed Data Analytics"}, {"paperId": "465edb61bd32ca126909bb40afb9fa6b1e419e08", "title": "Toward Building Edge Learning Pipelines"}, {"paperId": "daa2171619a5a00d478798f400dcece231b1706e", "title": "A comprehensive study and review of tuning the performance on database scalability in big data analytics"}, {"paperId": "37334cc8664467c8ac1933d8270ec6220a4c3e40", "title": "Data Locality in High Performance Computing, Big Data, and Converged Systems: An Analysis of the Cutting Edge and a Future System Architecture"}, {"paperId": "9cae3d969748238ea23598a45b3c66d8a9607dcd", "title": "Real-Time Query Method Based on Distributed Database Demand Information"}, {"paperId": "ccff94b73aadea93888dcc117b410a1cd3423bd7", "title": "Research Trends, Enabling Technologies and Application Areas for Big Data"}, {"paperId": "c4a2a2993f4e66a8266c7d621419b11935ef1b6c", "title": "A taxonomy of tools and approaches for distributed genomic analyses"}, {"paperId": "077196723872168989127f990cd5a7a0b1a3feff", "title": "Visual Analysis of Sports Actions Based on Machine Learning and Distributed Expectation Maximization Algorithm"}, {"paperId": "d526e0dc63b8a2cf52dec21d570b0cf0db558de5", "title": "Optimizing Network Transfers for Data Analytic Jobs Across Geo-Distributed Datacenters"}, {"paperId": "e6d88148f251086c9cd233ee1c474e7962ed75ca", "title": "Computing"}, {"paperId": "380783ad2768017beb619dcb89543340b9753d98", "title": "Various Approaches Proposed for Eliminating Duplicate Data in a System"}, {"paperId": "555b3a930cae4543670746796fc4f357e4cfa7b8", "title": "Adaptive priority-based data placement and multi-task scheduling in geo-distributed cloud systems"}, {"paperId": "a30f7e27968ad360629253eb8a1e2b933169e68d", "title": "Compliant Geo-distributed Query Processing"}, {"paperId": "662bb5b24238b7d676609f9e02f66784a0abfe66", "title": "Hadoop-Based Painting Resource Storage and Retrieval Platform Construction and Testing"}, {"paperId": "ea4e321de6163db57106757119c90c308a51c5e0", "title": "A survey on bandwidth-aware geo-distributed frameworks for big-data analytics"}, {"paperId": "46928dbdec34820f89a5ab63828b6248bf235f88", "title": "Cross-MapReduce: Data transfer reduction in geo-distributed MapReduce"}, {"paperId": "27ff0b7fd59a38c35e5f062007c4825b3008fa14", "title": "Cluster load based content distribution and speculative execution for geographically distributed cloud environment"}, {"paperId": "2a790f2c5b05e9b91cd3baa75e8ef4c7a5933a0e", "title": "Probabilistic Hesitant Fuzzy Methods for Prioritizing Distributed Stream Processing Frameworks for IoT Applications"}, {"paperId": "e33fa01e24b151f6a13d58f03b6c30fffcbe63d7", "title": "Comparative Research on Active Learning of Big Aata based on Mapreduce and Spark"}, {"paperId": "9ceab02df4cab2cef6095a94f397c2fe3e50c79d", "title": "Feather: Hierarchical Querying for the Edge"}, {"paperId": "b41d5c54926e76d8de4939fe7168f148c8a3aa34", "title": "Efficient orchestration of Node-RED IoT workflows using a Vector Symbolic Architecture"}, {"paperId": "a3076cd3b4fd4795b46bc44816fe3adb9ec0abe1", "title": "Efficient Graph Query Processing over Geo-Distributed Datacenters"}, {"paperId": "aca6d5f3866372a4506cf15773ae298f18c3f453", "title": "A comprehensive survey of anomaly detection techniques for high dimensional big data"}, {"paperId": "915ab7b6ca3633230403d47dbb31cf74888cc5c9", "title": "A Survey on Automatic Parameter Tuning for Big Data Processing Systems"}, {"paperId": "caf50e2947c2900d1300b74513e09ddd962af6aa", "title": "2019 Index IEEE Transactions on Big Data Vol. 5"}, {"paperId": "40c235361a67d324b79f5ef7a41086199ff8731e", "title": "Optimizing Geo-Distributed Data Analytics with Coordinated Task Scheduling and Routing"}, {"paperId": "14e9fcd8c0e0d550b175d22c7bc2755e23f30ee5", "title": "Exploring and cleaning big data with random sample data blocks"}, {"paperId": "7cbdc8cbd4e389a541a1761cf5fae977ba255041", "title": "A Survey of Big Data Machine Learning Applications Optimization in Cloud Data Centers and Networks"}, {"paperId": "2cbf041608704c92f3f32c4d703d35a09b5a8b53", "title": "Harmony: An Approach for Geo-distributed Processing of Big-Data Applications"}, {"paperId": "0d288ca565ea3daaa2c79ed16844ae628d91088a", "title": "MapReduce Join Across Geo-Distributed Data Centers"}, {"paperId": "020ff615dd9874cfa81ba5d447586caae76c0022", "title": "Real-Time Search Method for Large-Scale Regional Targets Based on Parallel Google S2 Algorithm"}, {"paperId": "2d224804a245c07922a5ab71b4cbebc0d59f3ef2", "title": "Learning over inherently distributed data"}, {"paperId": "39a5a8f95b30af5e58da56eb1879c52c4932a197", "title": "Bi-objective Traffic Optimization in Geo-distributed Data Flows"}, {"paperId": "02426593807eace0c4dc173093f55f8cfe78946d", "title": "A fast solution for bi-objective traffic minimization in geo-distributed data flows"}, {"paperId": "1aa4dc9ed4a44437b29d9284a8aa9f2fd8be3dd1", "title": "Efficient Parallel Mining Of Frequent Itemset Using MapReduce"}, {"paperId": "c17fd0011ac75d999c6cb1dec43ecd838d033ba7", "title": "Fast Communication-Efficient Spectral Clustering over Distributed Data"}, {"paperId": "31a07baa71dc89355e8f1bc077749413182acc9b", "title": "A Cache-Based Data Movement Infrastructure for On-demand Scientific Cloud Computing"}, {"paperId": "90b7928f19cc37e53e978fa2f22795fea40f3954", "title": "A Performance Study of Geo-Distributed IoT Data Aggregation for Fog Computing"}, {"paperId": "ee047e8be6611a36422c068d426a5b63e4fbe36c", "title": "Scheduling Stream Processing Tasks on Geo-Distributed Heterogeneous Resources"}, {"paperId": "2eb8fd92ca5a07296cd537e5818e1a8c97c77935", "title": "Exact and heuristic MapReduce scheduling algorithms for cloud federation"}, {"paperId": "949b89f2bde3e512dca7c12e6677ac1452f1d275", "title": "Performance measurement of data flow processing employing software defined architecture"}, {"paperId": "fb1fe13c4db249b55c190c580296a4497d613f1a", "title": "A Study on Log Parser Analysis and Error Detection using Big Data"}, {"paperId": "cc7a33743cce381ce2d3b16ddf0b36e0b3f26a6c", "title": "An Analytics in Health Record for Medical Analysis using MapReduce"}, {"paperId": "fed3b593c4732724483f383308cf87945bb9fbdf", "title": "System Framework for Cardiovascular Disease Prediction Based on Big Data Technology"}, {"paperId": "215dbf2170fa15de651ee14b689fc34c6b74a2cf", "title": "Energy-Efficient Analytics for Geographically Distributed Big Data"}, {"paperId": "d76051276f0b0ff7a12104ba3f5d7b7201457f8f", "title": "Energy-efficient Geo-Distributed Big Data Analytics"}, {"paperId": "31d3c657987119aaa1e0b8306c0abbe84bf35222", "title": "A Survey on Scheduling Techniques in Computing and Network Convergence"}, {"paperId": "a976b06dc13def22bab2ece83e467ebed5113816", "title": "Simulation Research on Fast Matching of Big Data Based on Spark"}, {"paperId": "9cdf7d841c540ca9675c08162279f50a062495af", "title": "A Review on VANET Research: Perspective of Recent Emerging Technologies"}, {"paperId": "0bf23c50929143e6f9d7aca34596b8e950cc07cd", "title": "Improving Privacy Preservation Approach for Healthcare Data using Frequency Distribution of Delicate Information"}, {"paperId": "3c9010df5a14ef0f3b0de140b0bceb2994cad2bd", "title": "SLA-Aware Multi-Criteria Data Placement in Cloud Storage Systems"}, {"paperId": "02e764bdc1e8510dc6e99587845f6b6fe2e5249a", "title": "Exploring the Factors Influencing Big Data Technology Acceptance"}, {"paperId": "cf8a787eb8e9278a8f5d0969e89412e7c41e6008", "title": "GeoLocalitySim: Geographical Cloud Simulator with Data Locality"}, {"paperId": "d10fcf5753515a72e5b59bb24ae7dc4fb52d29df", "title": "Edge-Centric Queries’ Stream Management Based on an Ensemble Model"}, {"paperId": "c76b0217cb3734acb6b0c4202f445472a50d63e1", "title": "Challenges and Solutions for Processing Real-Time Big Data Stream: A Systematic Literature Review"}, {"paperId": "be18f961ec161cd03f6aef8f627323a94e4e6cc8", "title": "Distributed Data Strategies to Support Large-Scale Data Analysis Across Geo-Distributed Data Centers"}, {"paperId": "c3d8ca293718eec2b143af6b386cf9b48201a014", "title": "Chapter One - Fast execution of RDF queries using Apache Hadoop"}, {"paperId": "7bd6d1178e7eeb8f5fd54daeb1f388db2047fdff", "title": "Survey of Public Safety Communications: User-Side and Network-Side Solutions and Future Directions"}]}
