{"paperId": "8bf71ce902a9e1340ce5a64f076d08e2efe2dc8a", "publicationVenue": {"id": "2e8c30d0-78f6-4b13-aecb-9a65bff00635", "name": "IEEE wireless communications", "type": "journal", "alternate_names": ["IEEE Wirel Commun", "IEEE Wireless Communications", "IEEE wirel commun"], "issn": "1536-1284", "url": "http://www.comsoc.org/wirelessmag/", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=7742"]}, "title": "A Vision of Self-Evolving Network Management for Future Intelligent Vertical HetNet", "abstract": "Future integrated terrestrial-aerial-satellite networks will have to exhibit some unprecedented characteristics for the provision of both communications and computation services, and security for a tremendous number of devices with very broad and demanding requirements across multiple networks, operators, and ecosystems. Although 3GPP introduced the concept of self-organizing networks (SONs) in 4G and 5G documents to automate network management, even this progressive concept will face several challenges as it may not be sufficiently agile in coping with the immense levels of complexity, heterogeneity, and mobility in the envisioned beyond-5G integrated networks. In the presented vision, we discuss how future integrated networks can be intelligently and autonomously managed to efficiently utilize resources, reduce operational costs, and achieve the targeted Quality of Experience (QoE). We introduce the novel concept of the “self-evolving networks (SENs)” framework, which utilizes artificial intelligence, enabled by machine learning (ML) algorithms, to make future integrated networks fully automated and intelligently evolve with respect to the provision, adaptation, optimization, and management aspects of networking, communications, computation, and infrastructure nodes' mobility. To envisage the concept of SEN in future integrated networks, we use the Intelligent Vertical Heterogeneous Network (I-VHetNet) architecture as our reference. The article discusses five prominent scenarios where SEN plays the main role in providing automated network management. Numerical results provide an insight into how the SEN framework improves the performance of future integrated networks. The article presents the leading enablers and examines the challenges associated with the application of the SEN concept in future integrated networks.", "venue": "IEEE wireless communications", "year": 2020, "fieldsOfStudy": ["Computer Science", "Engineering"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-09-06", "journal": {"name": "IEEE Wireless Communications", "pages": "96-105", "volume": "28"}, "authors": [{"authorId": "2136516", "name": "Tasneem S. J. Darwish"}, {"authorId": "1397291952", "name": "Günes Karabulut-Kurt"}, {"authorId": "1745843", "name": "H. Yanikomeroglu"}, {"authorId": "1717152", "name": "G. Senarath"}, {"authorId": "34555513", "name": "Peiying Zhu"}], "citations": [{"paperId": "2ae747b101eec59f1519ea1a7b0d56535a0f3cd9", "title": "Self-Evolving Wireless Communications: A Novel Intelligence Trend for 6G and Beyond"}, {"paperId": "aa47a4a92a7d0e0187a882623b9aadd482881741", "title": "Toward Reliability-Enhanced, Delay-Guaranteed Dynamic Network Slicing: A Multiagent DQN Approach With an Action Space Reduction Strategy"}, {"paperId": "ab4249e9f758ede75ee22ccf28d3717c418072e6", "title": "Emerging Technologies for 6G Non-Terrestrial-Networks: From Academia to Industrial Applications"}, {"paperId": "e11b8ab2232d58b50a42d7d45b56dd958f2c391a", "title": "Abnormal Node Location Algorithm in Multi-source Heterogeneous Network Based on Association Rules"}, {"paperId": "1cd0ca52b6e7b9570a38123b9b9ba91628a62026", "title": "Enhancing heterogeneous mobile network management based on a well-founded reference ontology"}, {"paperId": "7606f63e411b9c5d200cbb21d0159ba9f8e75e38", "title": "Communication-Efficient and Scalable Management of Self-Organizing Mobile Networks"}, {"paperId": "2a6afd5969d841dc52838a1d614c155c1476b837", "title": "A VHetNet-Enabled Asynchronous Federated Learning-Based Anomaly Detection Framework for Ubiquitous IoT"}, {"paperId": "fc661a4d23b6511927c4a795bab4adca76f48055", "title": "Deep Learning-Based Autonomous UAV-BSs for NGWNs: Overview and a Novel Architecture"}, {"paperId": "8204f58daca6885fd5818feaecb087bab67aa0d2", "title": "A Review of 6G Enabler: Vertical Heterogeneous Network (v-HetNet)"}, {"paperId": "04592968d7abe2642176c502c9841a549df738df", "title": "VHetNets for AI and AI for VHetNets: An Anomaly Detection Case Study for Ubiquitous IoT"}, {"paperId": "8f6801b6cc0df16dc03fc03e48f9d1c50c50c6ea", "title": "Intelligent SON Coordination in the 5G-and-beyond era"}, {"paperId": "00add80e93ee9137e9ec6db41038bba59718ee0e", "title": "Federated Multi-Discriminator BiWGAN-GP based Collaborative Anomaly Detection for Virtualized Network Slicing"}, {"paperId": "34136e9a8e8cdd9b254e2f947c432670c49cd807", "title": "Hybrid Self-Organizing Networks: Evolution, Standardization Trends, and a 6G Architecture Vision"}, {"paperId": "504b0edc120eefe206425d229b71c085e8107f96", "title": "LEO Satellites in 5G and Beyond Networks: A Review From a Standardization Perspective"}, {"paperId": "d28626fe5555c336ef03bda12e9fe19a283c1f54", "title": "Autonomous UAV Base Stations for Next Generation Wireless Networks: A Deep Learning Approach"}, {"paperId": "851e7c9e033e6092db24f871f653dbf39df47c95", "title": "Self-Evolving Integrated Vertical Heterogeneous Networks"}, {"paperId": "7e7f4af6a71a1529403f9019793977f118efcc9e", "title": "Location Management in Internet Protocol-Based Future LEO Satellite Networks: A Review"}, {"paperId": "ad09cf683131248ee946b03ba86fe3107022d847", "title": "Wireless Access Architecture: The Next 20+ Years"}, {"paperId": "62193342da8df71189ac3756b8f35836f71ef5de", "title": "A Vision and Framework for the High Altitude Platform Station (HAPS) Networks of the Future"}, {"paperId": "ca144450cde4945a965b4d6c513b41b8ecc5dc90", "title": "A Vertical Heterogeneous Network (VHetNet)-Enabled Asynchronous Federated Learning-Based Anomaly Detection Framework for Ubiquitous IoT"}, {"paperId": "80fd272102965aa59072274882226b7400c48070", "title": "A Detailed Relevance Analysis of Enabling Technologies for 6G Architectures"}, {"paperId": "ba8f43c47d5a4ad1e4279bbb2d337d12d942fcec", "title": "An Accurate Model for Computation Offloading in 6G Networks and a HAPS-Based Case Study"}, {"paperId": "18c2075d7c3a8697f28ec1730e870c61bd0d7dd8", "title": "Survey on 6G Frontiers: Trends, Applications, Requirements, Technologies and Future Research"}, {"paperId": "dd14021061a2b10627bda500691c565efc90ec5f", "title": "Self-Organizing Networks in the 6G Era: State-of-the-Art, Opportunities, Challenges, and Future Trends"}, {"paperId": "bc386981a594aea41430f75aedb724a233ca2bdc", "title": "Toward 6G Network: Requirements, Key Technologies, and Challenges in Future Research"}, {"paperId": "8cb714862c3cee95542a85a5acd92011e40a4b86", "title": "A Blockchain-Based Authentication and Key Agreement (AKA) Protocol for 5G Networks"}]}
