{"paperId": "8c1cafc4d278cd33f06565a0eb6caa4f46c9e7bd", "publicationVenue": {"id": "7e6222b3-5405-42a2-a1ad-538d7078d6d9", "name": "Network", "type": "journal", "alternate_names": ["Network: Computation In Neural Systems", "Netw Comput Neural Syst"], "issn": "0085-3909", "alternate_issns": ["0954-898X", "2673-8732", "0093-3341"], "url": "https://www.mdpi.com/journal/network", "alternate_urls": ["http://www.informahealthcare.com/net"]}, "title": "A Review of Blockchain Technology in Knowledge-Defined Networking, Its Application, Benefits, and Challenges", "abstract": "Knowledge-Defined Networking (KDN) necessarily consists of a knowledge plane for the generation of knowledge, typically using machine learning techniques, and the dissemination of knowledge, in order to make knowledge-driven intelligent network decisions. In one way, KDN can be recognized as knowledge-driven Software-Defined Networking (SDN), having additional management and knowledge planes. On the other hand, KDN encapsulates all knowledge-/intelligence-/ cognition-/machine learning-driven networks, emphasizing knowledge generation (KG) and dissemination for making intelligent network decisions, unlike SDN, which emphasizes logical decoupling of the control plane. Blockchain is a technology created for secure and trustworthy decentralized transaction storage and management using a sequence of immutable and linked transactions. The decision-making trustworthiness of a KDN system is reliant on the trustworthiness of the data, knowledge, and AI model sharing. To this point, a KDN may make use of the capabilities of the blockchain system for trustworthy data, knowledge, and machine learning model sharing, as blockchain transactions prevent repudiation and are immutable, pseudo-anonymous, optionally encrypted, reliable, access-controlled, and untampered, to protect the sensitivity, integrity, and legitimacy of sharing entities. Furthermore, blockchain has been integrated with knowledge-based networks for traffic optimization, resource sharing, network administration, access control, protecting privacy, traffic filtering, anomaly or intrusion detection, network virtualization, massive data analysis, edge and cloud computing, and data center networking. Despite the fact that many academics have employed the concept of blockchain in cognitive networks to achieve various objectives, we can also identify challenges such as high energy consumption, scalability issues, difficulty processing big data, etc. that act as barriers for integrating the two concepts together. Academicians have not yet reviewed blockchain-based network solutions in diverse application categories for diverse knowledge-defined networks in general, which consider knowledge generation and dissemination using various techniques such as machine learning, fuzzy logic, and meta-heuristics. Therefore, this article fills a void in the content of the literature by first reviewing the diverse existing blockchain-based applications in diverse knowledge-based networks, analyzing and comparing the existing works, describing the advantages and difficulties of using blockchain systems in KDN, and, finally, providing propositions based on identified challenges and then presenting prospects for the future.", "venue": "Network", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-08-30", "journal": {"name": "Network", "pages": "343-421", "volume": "3"}, "authors": [{"authorId": "1490686985", "name": "Patikiri Arachchige Don Shehan Nilmantha Wijesekara"}, {"authorId": "39778573", "name": "Subodha Gunawardena"}], "citations": [{"paperId": "daff7183a1837f3877fed76c11729b2659237025", "title": "Research on 5G User Perception Detection and Experience Improvement Optimization Based on Capsule Network"}]}
