{"paperId": "8c2290cc1555209dcb6affdf4db0ff96370703ed", "publicationVenue": {"id": "5206db5e-119e-4015-8871-2265648b8626", "name": "IEICE transactions on communications", "type": "journal", "alternate_names": ["IEICE Trans Commun", "IEICE Transactions on Communications", "IEICE trans commun"], "issn": "0916-8516", "alternate_issns": ["1745-1345"], "url": "https://search.ieice.org/bin/index.php?category=B&curr=1&lang=E"}, "title": "Traffic reduction technologies and data aggregation control to minimize latency in IoT systems", "abstract": "SUMMARY The spread of the Internet of Things (IoT) has led to the generation of large amounts of data, requiring massive communication, computing, and storage resources. Cloud computing plays an important role in realizing most IoT applications classiﬁed as massive machine type communication and cyber-physical control applications in vertical domains. To handle the increasing amount of IoT data, it is important to reduce the tra ﬃ c concentrated in the cloud by distributing the computing and storage resources to the network edge side and to suppress the latency of the IoT applications. In this paper, we ﬁrst present a recent literature review on fog / edge computing and data aggregation as representative tra ﬃ c reduction technologies for e ﬃ ciently utilizing communication, computing, and storage resources in IoT systems, and then focus on data aggregation control minimizing the latency in an IoT gateway. We then present a uniﬁed modeling for statistical and nonstatistical data aggregation and analyze its latency. We analytically derive the Laplace–Stieltjes transform and average of the stationary distribution of the latency and approximate the average latency; we subsequently apply it to an adaptive aggregation number control for the time-variant data arrival. The transient tra ﬃ c characteristics, that is, the absorption of tra ﬃ c ﬂuctuations realizing a stable optimal latency, were clariﬁed through a simulation with a time-variant Poisson input and non-Poisson inputs, such as a Beta input, which is a typical IoT tra ﬃ c model.", "venue": "IEICE transactions on communications", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": null, "journal": {"name": "IEICE Transactions on Communications"}, "authors": [{"authorId": "50748194", "name": "H. Yoshino"}, {"authorId": "1792993", "name": "Kenko Ota"}, {"authorId": "2933172", "name": "T. Hiraguri"}], "citations": [{"paperId": "dbb421b02c4c8a5e0a9ff71bb5fa68727b76815f", "title": "Designing an intelligent image detection and transmission system for the Internet of Things"}, {"paperId": "80a7a42c7119b3e9161967121d6ecdb466372bb1", "title": "Comprehensive Survey of Research on Emerging Communication Technologies from ICETC2020"}]}
