{"paperId": "8c240d676a2a30e5fbd6eec08669651004b48ed0", "publicationVenue": {"id": "228761ec-c40a-479b-8309-9dcbe9851bcd", "name": "IEEE Internet of Things Journal", "type": "journal", "alternate_names": ["IEEE Internet Thing J"], "issn": "2327-4662", "url": "https://www.ieee.org/membership-catalog/productdetail/showProductDetailPage.html?product=PER288-ELE", "alternate_urls": ["https://ieeexplore.ieee.org/servlet/opac?punumber=6488907", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6488907", "http://ieee-iotj.org/#"]}, "title": "A Proof-of-Quality-Factor (PoQF)-Based Blockchain and Edge Computing for Vehicular Message Dissemination", "abstract": "Blockchain applications in vehicular networks can offer many advantages, including decentralization and improved security. However, most of the consensus algorithms in blockchain are difficult to be implemented in vehicular ad hoc networks (VANETs) without the help of edge computing services. For example, the connectivity in VANET only remains for a short period of time, which is not sufficient for highly time-consuming consensus algorithms, e.g., Proof of Work, running on mobile-edge nodes (vehicles). Other consensus algorithms also have some drawbacks, e.g., Proof of Stake (PoS) is biased toward nodes with a higher amount of stakes and Proof of Elapsed Time (PoET) is not highly secure against malicious nodes. For these reasons, we propose a voting blockchain based on the Proof-of-Quality-Factor (PoQF) consensus algorithm, where the threshold number of votes is controlled by edge computing servers. Specifically, PoQF includes voting for message validation and a competitive relay selection process based on the probabilistic prediction of channel quality between the transmitter and receiver. The performance bounds of failure and latency in message validation are obtained. This article also analyzes the throughput of block generation, as well as the asymptotic latency, security, and communication complexity of PoQF. An incentive distribution mechanism to reward honest nodes and punish malicious nodes is further presented and its effectiveness against the collusion of nodes is proved using the game theory. Simulation results show that PoQF reduces failure in validation by 11% and 15% as compared to PoS and PoET, respectively, and is 68 ms faster than PoET.", "venue": "IEEE Internet of Things Journal", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-09-25", "journal": {"name": "IEEE Internet of Things Journal", "pages": "2468-2482", "volume": "8"}, "authors": [{"authorId": "3097241", "name": "Ferheen Ayaz"}, {"authorId": "143876012", "name": "Zhengguo Sheng"}, {"authorId": "2992987", "name": "Daxin Tian"}, {"authorId": "1737045", "name": "Y. Guan"}], "citations": [{"paperId": "7b2ba23688514d58cf4b1ac63385b1b438bb27dc", "title": "Secure Targeted Message Dissemination in IoT Using Blockchain Enabled Edge Computing"}, {"paperId": "4d5799c3345b5c3315f4200db369834b6ed7d703", "title": "A Blockchain-Based Trust-Value Management Approach for Secure Information Sharing in Internet of Vehicles"}, {"paperId": "0f86713619323800e3ff75bc43e8f881a88b78b8", "title": "B-UAVM: A Blockchain-Supported Secure Multi-UAV Task Management Scheme"}, {"paperId": "7962f21e30fbab7ea62e4b8f8df19ecaae11bd17", "title": "When Distributed Consensus Meets Wireless Connected Autonomous Systems: A Review and A DAG-based Approach"}, {"paperId": "6c3edd01a4bed20983258fcc2e9be1d64913558c", "title": "Challenges and Solutions for Vehicular Ad-Hoc Networks Based on Lightweight Blockchains"}, {"paperId": "e488007cf7f0ad76e7897cc602517e12695224b0", "title": "Traffic data security sharing scheme based on blockchain and traceable ring signature for VANETs"}, {"paperId": "a9239b30b73a78d23f074a6d8c26ce30f0c24396", "title": "BDFL: A Blockchain-Enabled FL Framework for Edge-based Smart UAV Delivery Systems"}, {"paperId": "0c277cc456b24498d381e30fe87c3a906fb6f187", "title": "Time Synchronization-Aware Edge-End Collaborative Network Routing Management for FL-Assisted Distributed Energy Scheduling"}, {"paperId": "b7c03269e541269506e3fe474975acf83a2d6a07", "title": "Towards Net-Zero Goal through Altruistic Prosumer based Energy Trading among Connected Electric Vehicles"}, {"paperId": "2756e68479139d4aa262999cb2c422b42a035239", "title": "Intelligent Proof-of-Trustworthiness-Based Secure Safety Message Dissemination Scheme for Vehicular Ad Hoc Networks Using Blockchain and Deep Learning Techniques"}, {"paperId": "907685cd5281b3d496f9b154c1565e72e9eac90d", "title": "Efficient Consensus and Elastic Resource Allocation Empowered Blockchain for Vehicular Networks"}, {"paperId": "d73eabe61bb7bfe9edd8c033eb95200711e6d7b6", "title": "BPR: Blockchain-Enabled Efficient and Secure Parking Reservation Framework With Block Size Dynamic Adjustment Method"}, {"paperId": "1e02fa24ffc1160689e932806aa2728c04a514fb", "title": "Collaborative and Intelligent Resource Optimization for Computing and Caching in IoV With Blockchain and MEC Using A3C Approach"}, {"paperId": "3c89a84ec27d565d996ece73d2d3d9cc3d2845f1", "title": "Vision, Enabling Technologies, and Scenarios for a 6G-Enabled Internet of Verticals (6G-IoV)"}, {"paperId": "65d198316badeb0a27a67bc2d67723c79994e4d3", "title": "A Study on Decentralized Electronic-Voting Using Blockchain"}, {"paperId": "c1e24fd982dc616e900a4b94e216cf62ad905524", "title": "Blockchain-Enabled Online Traffic Congestion Duration Prediction in Cognitive Internet of Vehicles"}, {"paperId": "85194c4e386086784794ada9e8e2e308a51380d3", "title": "Blockchain-Empowered AI for 6G-Enabled Internet of Vehicles"}, {"paperId": "7c553bd5c5c01ed752cdf55b213fb6c8aa1b559d", "title": "RVC: A reputation and voting based blockchain consensus mechanism for edge computing-enabled IoT systems"}, {"paperId": "54a912c0f69ee8ec363b172655d4149296bdbd1e", "title": "Trust in Edge-based Internet of Things Architectures: State of the Art and Research Challenges"}, {"paperId": "b741bb2f2563a2303df684528e041c08e8796a8c", "title": "Recent Advances of Blockchain and its Applications"}, {"paperId": "ae942a25067b51935ff8a3b4ffa1f51da487225a", "title": "An IoV-PBFT Consensus-Based Blockchain for Collaborative Congestion Avoidance and Simulation Test"}, {"paperId": "dfbde7e3bb89facffb81b831107e225ad663976b", "title": "Moving direction-based adaptive task migration in MEC"}, {"paperId": "e7dbcb847fe6ec3009c02bff51a1c2b2ccc189d0", "title": "Blockchain-enabled FD-NOMA based Vehicular Network with Physical Layer Security"}, {"paperId": "2767b3704d1de9a6cfc100ef208f3ff2089bed9c", "title": "Integration of Blockchain and Edge Computing in Internet of Things: A Survey"}, {"paperId": "087c08e4e1df37fdef8fae977624c13b407355ef", "title": "A blockchain-based lightweight authentication and key agreement scheme for internet of vehicles"}, {"paperId": "45987fa42def24211fa3ed30a2d2aecd39bac9c5", "title": "Energy Efficient Consensus Approach of Blockchain for IoT Networks with Edge Computing"}, {"paperId": "a7cc84b5af8171b5ab3aec0ee177d6fbab1ab20a", "title": "Blockchain-Enabled Vehicular Ad Hoc Networks: A Systematic Literature Review"}, {"paperId": "e2064e6246b06273b9d9d98fa7aec4053703b02c", "title": "A Blockchain Based Federated Learning for Message Dissemination in Vehicular Networks"}, {"paperId": "538328db72fabfc4d0dbebb76aeee0ca64a894b5", "title": "Efficient Blockchain-Enabled Large Scale Parked Vehicular Computing With Green Energy Supply"}, {"paperId": "1fb20bca0281691a755ad03e24ef8a56927e5278", "title": "Approaches towards Blockchain Innovation: A Survey and Future Directions"}, {"paperId": "82714bdc27af1d0b69692188614c5fc1f2975e0e", "title": "Blockchain Technology for Intelligent Transportation Systems: A Systematic Literature Review"}, {"paperId": "4290621933aa1bd730026e308cd967b62dbc9a58", "title": "Multi-Channel Blockchain Scheme for Internet of Vehicles"}, {"paperId": "96cc4ccd180ace846ab299625f05bb0dcb6c134f", "title": "A Survey of Blockchain-Based Solutions for IoTs, VANETs, and FANETs"}]}
