{"paperId": "8c2866015be5fd73b5b5720cc11b2c869e901a3a", "publicationVenue": {"id": "2e5b2b9d-b39f-4cf0-ae86-4c9ff4011524", "name": "Nature Reviews Microbiology", "type": "journal", "alternate_names": ["Nat Rev Microbiol"], "issn": "1740-1526", "url": "https://www.nature.com/nrmicro/", "alternate_urls": ["http://www.nature.com/nrmicro/index.html"]}, "title": "Forest microbiome and global change", "abstract": null, "venue": "Nature Reviews Microbiology", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2023-03-20", "journal": {"name": "Nature Reviews Microbiology", "pages": "487-501", "volume": "21"}, "authors": [{"authorId": "3726547", "name": "P. Baldrian"}, {"authorId": "1432701366", "name": "R. López-Mondéjar"}, {"authorId": "30435503", "name": "P. Kohout"}], "citations": [{"paperId": "dccd4645e131934f24eb9f7ab933325775931b89", "title": "Studying soil viral ecology under an ecosystem services framework"}, {"paperId": "6f5777a5630636bf6eee51bb777a30112040d8d1", "title": "Suillus: an emerging model for the study of ectomycorrhizal ecology and evolution."}, {"paperId": "3235f87380b870051c3e876d2fb346ed8547d10a", "title": "Fungal and bacterial communities and their associations in snow-free and snow covered (sub-)alpine Pinus cembra forest soils"}, {"paperId": "9d14cc6c6530632f95da3290cd81f61e1262155e", "title": "Potential distribution of Biscogniauxia mediterranea and Obolarina persica causal agents of oak charcoal disease in Iran’s Zagros forests"}, {"paperId": "1bf4bf16cb37339390fc8b47d94cb258fcaa5a4f", "title": "Arbuscular mycorrhizal fungal interactions bridge the support of root‐associated microbiota for slope multifunctionality in an erosion‐prone ecosystem"}, {"paperId": "d06ed20758ffeeec5eaeaddb0898067ae4fbbd70", "title": "Current trends, limitations and future research in the fungi?"}, {"paperId": "82d9559aab37cd413732f4703b8bfd53ff2e05ff", "title": "Leaf nutrient traits of planted forests demonstrate a heightened sensitivity to environmental changes compared to natural forests"}, {"paperId": "7d9f169b22273dfc572d12aa1c132d422a5f3020", "title": "Editorial: Theme issue on the ecology of soil microorganisms"}, {"paperId": "573b81373bf39c09ffb137181ed58617aec3d3ef", "title": "Rapid and chemically diverse C transfer from trees to mycorrhizal fruit bodies in the forest"}, {"paperId": "224123b7c6d532204fd3e9b4bae6aa39c1119aa8", "title": "Chronic enhanced nitrogen deposition and elevated precipitation jointly benefit soil microbial community in a temperate forest"}, {"paperId": "39dfaa2fe1d042eee58d66e830472246b01eaf0b", "title": "The Effects of Salinity and Genotype on the Rhizospheric Mycobiomes in Date Palm Seedlings"}, {"paperId": "7bcfb5b16e1f439442210f0852bed0c6f99b15ad", "title": "Effects of rewatering on soil fungi and soil enzymes in a spruce-beech forest after a 5-year experimental drought"}, {"paperId": "3ddec8d90e82b487c5c75659b0809aa9e7ec4075", "title": "Carbon fractions in wood for estimating embodied carbon in the built environment."}, {"paperId": "f252a84b01ff6a45b60263f33fdc1a44a983a587", "title": "Decoding seasonal changes: soil parameters and microbial communities in tropical dry deciduous forests"}, {"paperId": "d7723465f7108080faf8f25d5b17032f54e789ad", "title": "Canopy nitrogen addition and understory removal destabilize the microbial community in a subtropical Chinese fir plantation."}, {"paperId": "e2f1fe79971f5d9bf08373290a707539c3c94757", "title": "Substantial contribution of tree canopy nitrifiers to nitrogen fluxes in European forests"}, {"paperId": "cf5debadb13cb3a1b7a4b32f76cdc533c23b240c", "title": "Drought-induced tree mortality in Scots pine mesocosms promotes changes in soil microbial communities and trophic groups"}, {"paperId": "b2e80ee3381dc516f9235117c6a29c6f6195b87c", "title": "Drought determines the growth stability of different dominant conifer species in Central Asia"}, {"paperId": "53c8e43b824b5168e6129f3cd7b627c432b7c01f", "title": "The mycorrhizal symbiosis: research frontiers in genomics, ecology, and agricultural application."}, {"paperId": "c8898b533a7885074b54f058a2d3246c240dde4a", "title": "SWVR: A Lightweight Deep Learning Algorithm for Forest Fire Detection and Recognition"}, {"paperId": "a99ed5564120fd1d395810f664638cd1c5ebb291", "title": "Drought legacy interacts with wildfire to alter soil microbial communities in a Mediterranean climate-type forest."}, {"paperId": "42ffcd797476887ee0b79bc3e9c6f54b16590ef9", "title": "A cryptically diverse microbial community drives organic matter decomposition in forests"}, {"paperId": "d009e863dd5ae7620a92a5e46596391911d3a494", "title": "Lignin developmental patterns and Casparian strip as apoplastic barriers: A review."}, {"paperId": "8faab5e2dcf046d7bba45a1fb7ad3355f45d5c91", "title": "Herbarium specimens reveal that mycorrhizal type does not mediate declining temperate tree nitrogen status over a century of environmental change."}, {"paperId": "ed303169ca3e465b428eaebb302ff6b861c53e2f", "title": "Beyond the surface: exploring the mycobiome of Norway spruce under drought stress and with Heterobasidion parviporum"}, {"paperId": "2f98f21e1567d8d82698c043aada758cf2003849", "title": "Evaluation of Different Geographic Provenances of Silver Fir (Abies alba) as Seed Sources, Based on Seed Traits and Germination"}, {"paperId": "66c5cd1a96326b8c896fbd7980ef7b97432908f6", "title": "Recent Advances and Future Perspectives in Carbon Capture, Transportation, Utilization, and Storage (CCTUS) Technologies: A Comprehensive Review"}, {"paperId": "9e1ed3f6dd66da9f66aaa715bf993e6681d97144", "title": "Fine root decomposition in forest ecosystems: an ecological perspective"}, {"paperId": "947c0403718f1f1f434474b7dd95cfa3b5b34510", "title": "Convergent and divergent responses of the rhizosphere chemistry and bacterial communities to a stress gradient in the Atacama Desert"}, {"paperId": "1f5d1ae1377ed0c68de60b0fa0a1840af6d0f195", "title": "Long-term mitigation of drought changes the functional potential and life-strategies of the forest soil microbiome involved in organic matter decomposition"}, {"paperId": "2effbe8c1a28c0deb6ac87199459fff877720727", "title": "Editorial: Soil microbe-arthropod interactions under global change"}, {"paperId": "e4c1b3f42c5ce635728a975f6522cb5cfa9ddb1e", "title": "A review of the global climate change impacts, adaptation strategies, and mitigation options in the socio-economic and environmental sectors"}, {"paperId": "52d015195b092a7da4119e8d761f258cd54e3f93", "title": "Perspectives on Artificial Intelligence for Predictions in Ecohydrology"}, {"paperId": "da39bcd285ea669a88d946de9d285e8244dfef70", "title": "Litter and soil biodiversity jointly drive ecosystem functions"}, {"paperId": "416cbeb599bb548ee02ee616a9081ad3355c4add", "title": "Microbial Composition of Natural, Agricultural, and Technogenic Soils of Both Forest and Forest-Tundra of the Russian North"}, {"paperId": "6b769d3b1462b0e85b6d68153a38a31a39980845", "title": "An Overview of Climate Change Impacts on Agriculture and Their Mitigation Strategies"}, {"paperId": "a0b10f2b220fae40f4192d0a33f42e18bfedf6be", "title": "Temperature sensitivity and decomposition rate of 101 leaf litter types from Mediterranean ecosystems."}, {"paperId": "b20b7663532331ed65b8063738e2feacdab1e60c", "title": "New Developments in Climate Change, Air Pollution, Pollen Allergy, and Interaction with SARS-CoV-2"}]}
