{"paperId": "8c382e97c543853e4cdc73a81a200116f11b0599", "publicationVenue": {"id": "74f72915-6d78-48b3-85dc-5f79881ab60b", "name": "International Conference on Data Science in Cyberspace", "type": "conference", "alternate_names": ["DSC", "Int Conf Data Sci Sp", "IEEE Conference Dependable and Secure Computing", "IEEE Conference on Dependable and Secure Computing", "IEEE Conf Dependable Secur Comput", "IEEE International Conference on Data Science in Cyberspace", "IEEE Int Conf Data Sci Sp"]}, "title": "Facilitating Deep Learning for Edge Computing: A Case Study on Data Classification", "abstract": "Deep Learning (DL) is increasingly empowering technology and engineering in a plethora of ways, especially when big data processing is a core requirement. Many challenges, however, arise when solely depending on cloud computing for Artificial Intelligence (AI), such as data privacy, communication latency, and power consumption. Despite the elevating popularity of edge computing, its overarching issue is not the lack of technical specifications in many edge computing platforms but the sparsity of comprehensive documentation on how to correct utilize hardware to run ML and DL algorithms. Due to its specialized nature, installing the full version of TensorFlow, a common ML library, on an edge device is a complicated procedure that is seldom successful, due to the many dependent software libraries needed to be compatible with varying architectures of edge computing devices. Henceforth, in this paper, we present a novel technical guide on setting up the TensorFlow Lite, a lightweight version of TensorFlow, and demonstrate a complete workflow of model training, validation, and testing on the ODROID-XU4. Results are presented for a case study on energy data classification using the outlined model show almost 7 times higher computational performance compared to cloud-based AI.", "venue": "International Conference on Data Science in Cyberspace", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-06-22", "journal": {"name": "2022 IEEE Conference on Dependable and Secure Computing (DSC)", "pages": "1-4"}, "authors": [{"authorId": "30148974", "name": "A. Alsalemi"}, {"authorId": "144730155", "name": "A. Amira"}, {"authorId": "1915596", "name": "H. Malekmohamadi"}, {"authorId": "1729110", "name": "Kegong Diao"}], "citations": [{"paperId": "36af7aeb1a38bd25aea8c44947ec35277e126fd7", "title": "Novel domestic building energy consumption dataset: 1D timeseries and 2D Gramian Angular Fields representation"}]}
