{"paperId": "8c452780e9a4c37d298c84d1f8139638521be3d6", "publicationVenue": null, "title": "Optimal transmit power and antenna selection to achieve energy-efficient and low-complexity in 5G massive MIMO systems", "abstract": "This paper investigates joint antenna selection and optimal transmit power in multi cell massive multiple input multiple output systems. The pilot interference and activated transmit antenna selection plays an essential role in maximizing energy efficiency. We derived the closed-form of maximal energy efficiency with complete knowledge of large-scale fading with maximum ratio transmission while accounting for channel estimation and eliminated pilot contamination when the antennas approach infinity. We investigated joint optimal antenna selection and optimal transmit power under minimized reuse of pilot sequences based on a novel iterative low-complexity algorithm for Lagrange multiplayer and Newton methods. The two scenarios of achievable high data rate and total transmit power allocation are critical to the performance maximal energy efficiency. We propose new power consumption for each antenna based on the transmit power amplifier and circuit power consumption to analyze exact power consumption. The simulation results show that maximal energy efficiency could be achieved using the iterative low complexity algorithm based on the reasonable maximum transmit power when the noise power was less than the power received pilot. The proposed low complexity iterative algorithm offers maximum energy efficiency by repeating a minimized pilot signal until the optimal antenna selection and transmission power are achieved.", "venue": "THE 5TH INTERNATIONAL CONFERENCE ON BIOSCIENCE AND BIOTECHNOLOGY", "year": 2021, "fieldsOfStudy": ["Computer Science", "Engineering", "Mathematics"], "publicationTypes": ["Conference"], "publicationDate": "2021-06-04", "journal": {"name": "THE 5TH INTERNATIONAL CONFERENCE ON BIOSCIENCE AND BIOTECHNOLOGY"}, "authors": [{"authorId": "32557756", "name": "A. Salh"}, {"authorId": "1874985", "name": "L. Audah"}, {"authorId": "144756441", "name": "N. Shah"}, {"authorId": "123456218", "name": "Qazwan Abdullah  (غزوان عبد الله محمد طربوش)"}, {"authorId": "31902208", "name": "N. Abdullah"}, {"authorId": "9092007", "name": "Jameel Mukred"}, {"authorId": "2429085", "name": "S. Hamzah"}], "citations": []}
