{"paperId": "8c587c2974ce9ece5deaab7c6ecfa7a6dd5a8b12", "publicationVenue": null, "title": "QoS-Aware Proactive Data Replication for Big Data Analytics in Edge Clouds", "abstract": "We are in the era of big data and cloud computing, large quantity of computing resource is desperately needed to detect invaluable information hidden in the coarse big data through query evaluation. Users demand big data analytic services with various Quality of Service (QoS) requirements. However, cloud computing is facing new challenges in meeting stringent QoS requirements of users due to the remoteness from its users. Edge computing has emerged as a new paradigm to address such shortcomings by bringing cloud services to the edge of the operation network in proximity of users for performance improvement. To satisfy the QoS requirements of users for big data analytics in edge computing, the data replication and placement problem must be properly dealt with such that user requests can be efficiently and promptly responded. In this paper, we consider data replication and placement for big data analytic query evaluation. We first cast a novel proactive data replication and placement problem of big data analytics in a two-tier edge cloud environment, we then devise an approximation algorithm with an approximation ratio for it, we finally evaluate the proposed algorithm against existing benchmarks, using both simulation and experiment in a testbed based on real datasets, the evaluation results show that the proposed algorithm is promising.", "venue": "ICPP Workshops", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2019-08-05", "journal": {"name": "Workshop Proceedings of the 48th International Conference on Parallel Processing"}, "authors": [{"authorId": "2806902", "name": "Qiufen Xia"}, {"authorId": "143622634", "name": "Luyao Bai"}, {"authorId": "145884252", "name": "W. Liang"}, {"authorId": "2956815", "name": "Zichuan Xu"}, {"authorId": "143848922", "name": "Lin Yao"}, {"authorId": "46659935", "name": "Lei Wang"}], "citations": [{"paperId": "9b32a685b7b8497293e9eabd5d254222d91b1917", "title": "Schedule or Wait: Age-Minimization for IoT Big Data Processing in MEC via Online Learning"}, {"paperId": "d0648e9283feafb0c4a935bb3667f69054ed3a6a", "title": "Proactive and intelligent evaluation of big data queries in edge clouds with materialized views"}, {"paperId": "f26cbd802bb132648b09f0143b56073d162f241f", "title": "Enhancing the quality of communication of cellular networks using big data applications"}, {"paperId": "52b4576515dcd53f40ab0637d93f7d4350b9adc0", "title": "Quantitative Analysis and Performance Evaluation of Target-Oriented Replication Strategies in Cloud Computing"}, {"paperId": "4f9aab436ad2990aa1ac98a00aa7babdcc946326", "title": "Age-Aware Query Evaluation for Big Data Analytics in Mobile Edge Clouds"}, {"paperId": "a3052e7afd126031743f806ca46840e77a64c12d", "title": "Collaborate or Separate? Distributed Service Caching in Mobile Edge Clouds"}, {"paperId": "561dd6fc4bfd8cb37829947dd92ac694d321959a", "title": "Learning-based Online Query Evaluation for Big Data Analytics in Mobile Edge Clouds"}, {"paperId": "009f698cb7fa6bab7a75b9ac3a5df58097ab06f6", "title": "KuVS-Fachgespr¨ach Fog Computing 2020"}]}
