{"paperId": "8c62a95dd168983e5b113893286eb17d73d23a10", "publicationVenue": null, "title": "Improved MapReduce k-Means Clustering Algorithm with Combiner", "abstract": "Data Mining and High Performance Computing are two broad fields in Computer Science. The k-Means Clustering is a very simple and popular data mining algorithm that has its application spread over a very broad spectrum. MapReduce is a programming style that is used for handling high volume data over a distributed computing environment. This paper proposes an improved and efficient method to implement the k-Means Clustering Technique using the MapReduce paradigm. The main idea is to introduce a combiner in the mapper function to decrease the amount of data to be written by the mapper and the amount of data to be read by the reducer which has considerably reduced the redundant Map-Reduce calls that have resulted in a significant reduction in the time required for clustering as it has decreased the read/write operations to a large extent. The implementation of Improved MapReduce k-Means Clustering has been clearly discussed and its effectiveness is compared to the regular implementation in an experimental analysis. The results consolidate this research by concluding that the Improved MapReduce Implementation of k-Means Clustering Algorithm out performs the regular implementation by over 300 seconds.", "venue": "2014 UKSim-AMSS 16th International Conference on Computer Modelling and Simulation", "year": 2014, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2014-03-26", "journal": {"name": "2014 UKSim-AMSS 16th International Conference on Computer Modelling and Simulation", "pages": "386-391"}, "authors": [{"authorId": "2443228", "name": "P. Anchalia"}], "citations": [{"paperId": "8e55dbc8ea2692fc26f57c6134eb814d34ce3c9c", "title": "Research on Level Assessment of English Teaching Model Based on K-Means and Information Fusion"}, {"paperId": "fe4cae529bbd410d233b008f29554ff694db204e", "title": "Distributed Big Data Clustering using MapReduce-based Fuzzy C-Medoids"}, {"paperId": "e1350c9b7e106ec836502883967debbcb589d762", "title": "MapReduce-based Fuzzy C-means Algorithm for Distributed Document Clustering"}, {"paperId": "7ecd43795aa98d4258ea0d58ccbb85df1e9cd816", "title": "Design of Fast and Scalable Clustering Algorithm on Spark"}, {"paperId": "7bc6a13361a6494001945ba8d3ae19c65dac6145", "title": "Models for Internal Clustering Validation Indexes Based on Hadoop-MapReduce"}, {"paperId": "320be3bc82b92598ab938b2b095ccf8398baa804", "title": "mbkmeans: Fast clustering for single cell data using mini-batch k-means"}, {"paperId": "07ed7283e0f9cbc27517417c630d4d2fcdf3471f", "title": "Analysis of Large Set of Images Using MapReduce Framework"}, {"paperId": "aee28a03f51f7f3c8288dc92cb9b547c0a9e1151", "title": "Journey Of CFBA Variants With Advancement In Text-Mining And Subspace-Clustering"}, {"paperId": "859d308f451b1f6c3cbb3645ac83b1b91245e2ef", "title": "Enhanced Map Reduce Techniques for Big Data Analytics based on K-Means Clustering"}, {"paperId": "cc7a5ff0c8b62aa5845bbe001464ca1e35810d50", "title": "Partition based clustering of large datasets using MapReduce framework: An analysis of recent themes and directions"}, {"paperId": "1f69096606c28b199b0bf62d796afdd35220a9b8", "title": "Analysis of parallel computational models for clustering"}, {"paperId": "85e78b82a848f757afb6d298f29efd6f1faed99c", "title": "SparkSNN: A density-based clustering algorithm on spark"}, {"paperId": "4f2bec3024ef62d3801f5a0b0420ce6d880a9a8d", "title": "An Automatic Alignment and Grouping of Hadoop Cluster"}, {"paperId": "895a7e0c49a9ae1eb90331274dbee9dbe4fb17da", "title": "Towards Clustering Validation in Big Data Context"}, {"paperId": "e09914b0cc6707d2609eb8ab8a5aa1869c359e37", "title": "A parallel k‐means clustering algorithm based on redundance elimination and extreme points optimization employing MapReduce"}, {"paperId": "6c0f8377a6f887848c6db2d78dba175563bdba08", "title": "MR-SNN: Design of parallel Shared Nearest Neighbor clustering algorithm using MapReduce"}, {"paperId": "c7c169db020dad5db5be6ae89a3b31f7e161230b", "title": "Issues of K Means Clustering While Migrating to Map Reduce Paradigm with Big Data: A Survey"}, {"paperId": "a76caa5710ea822d4d2ab59736538602e8d57ed0", "title": "A New Parallelization Method for K-means"}, {"paperId": "5fa246bdf552c64332e478ee3c85457c30750c47", "title": "A Time Sharing Scheduler with Multiple Priority Based Queues for Improving Scheduling in Hadoop Cluster - Cloud Environment"}, {"paperId": "a4acceb06750671223ab9f45e23772462068d3dd", "title": "Parallel MapReduce for Clustering of Residential Customers Energy Behavior"}, {"paperId": "4dcddd53d2c9ff7133643e8dc192da449b1b7722", "title": "An Improved K Means Algorithm for Unstructured Data"}, {"paperId": "78edba7358390695a66abad1a476d92dd04b6efd", "title": "An Optimization Algorithm of Selecting Initial Clustering Center in K - means"}, {"paperId": "dc1121e5594d16b828767881c41ccf50326fe5b4", "title": "A Novel MapReduce Based k-Means Clustering"}, {"paperId": "f9e1a15cdb1da9ae33b12f577c8b29c306465b7f", "title": "Comparative Analysis of K-Means using MapReduce"}, {"paperId": "b4f1140254bf036d6233fc43ed2ed45b46f46c72", "title": "Critique of Wordcount Blueprint By Virtue of MapReduce Postulate"}, {"paperId": "976494a652478969c5d8565043511adff4aab088", "title": "A K-means Approach for Map-Reduce Model and Social Network Privacy Protection"}]}
