{"paperId": "8c68ba842187073049e5f81001f65725ca5383a2", "publicationVenue": null, "title": "On the Future of Cloud Engineering", "abstract": "Ever since the commercial offerings of the Cloud started appearing in 2006, the landscape of cloud computing has been undergoing remarkable changes with the emergence of many different types of service offerings, developer productivity enhancement tools, and new application classes as well as the manifestation of cloud functionality closer to the user at the edge. The notion of utility computing, however, has remained constant throughout its evolution, which means that cloud users always seek to save costs of leasing cloud resources while maximizing their use. On the other hand, cloud providers try to maximize their profits while assuring service-level objectives of the cloud-hosted applications and keeping operational costs low. All these outcomes require systematic and sound cloud engineering principles. The aim of this paper is to highlight the importance of cloud engineering, survey the landscape of best practices in cloud engineering and its evolution, discuss many of the existing cloud engineering advances, and identify both the inherent technical challenges and research opportunities for the future of cloud computing in general and cloud engineering in particular.", "venue": "2021 IEEE International Conference on Cloud Engineering (IC2E)", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference", "Review"], "publicationDate": "2021-08-19", "journal": {"name": "2021 IEEE International Conference on Cloud Engineering (IC2E)", "pages": "264-275"}, "authors": [{"authorId": "3077067", "name": "David Bermbach"}, {"authorId": "144114650", "name": "A. Chandra"}, {"authorId": "1713536", "name": "C. Krintz"}, {"authorId": "145201463", "name": "A. Gokhale"}, {"authorId": "48657690", "name": "Aleksander Slominski"}, {"authorId": "2294791", "name": "L. Thamsen"}, {"authorId": "144667647", "name": "Everton Cavalcante"}, {"authorId": "144554004", "name": "Tian Guo"}, {"authorId": "1783686", "name": "I. Brandić"}, {"authorId": "1682591", "name": "R. Wolski"}], "citations": [{"paperId": "d0e7abadd0273eb6f890faf0cf8ca902e418e872", "title": "Application-Centric Benchmarking of Distributed FaaS Platforms using BeFaaS"}, {"paperId": "09b897a16595eec666b0aab5afad99718ef25fff", "title": "Fusionize++: Improving Serverless Application Performance Using Dynamic Task Inlining and Infrastructure Optimization"}, {"paperId": "87da36ad28c28883d9d8f191d9b0ec58536e013a", "title": "Efficiently Detecting Performance Changes in FaaS Application Releases"}, {"paperId": "2cf2954ff6daf1c95cbf05d333cda019aa1b1a81", "title": "ProFaaStinate: Delaying Serverless Function Calls to Optimize Platform Performance"}, {"paperId": "c03e5049cf7224c7940805f3910a0d1f63cb45f8", "title": "Data Sovereignty at the Edge of the Network"}, {"paperId": "c085db32567ba2e84158ad9baf8a8068f4fbc6fa", "title": "The Night Shift: Understanding Performance Variability of Cloud Serverless Platforms"}, {"paperId": "409748453febc1b06fa4e6adba8b0ffdbd5114cd", "title": "Design and Evaluation of an Agile Framework for Continuous Education in Software Engineering"}, {"paperId": "b0a48a2a768f2913dd5030800a321aa68ea50977", "title": "Transparent Serverless execution of Python multiprocessing applications"}, {"paperId": "0c3820f5fdd981e92fa909d1f298c13e954a329c", "title": "Streaming vs. Functions: A Cost Perspective on Cloud Event Processing"}, {"paperId": "d77a1dd72a1a5a1369b5edbfc70be34c0c0ced30", "title": "Fusionize: Improving Serverless Application Performance through Feedback-Driven Function Fusion"}, {"paperId": "51ee4139af2f1755899a2a7bee17a5a0589cdd91", "title": "AI for Next Generation Computing: Emerging Trends and Future Directions"}, {"paperId": "1e2dc8bc815dd51b23e0cd00ba580a90103ca168", "title": "Model-based cloud service deployment optimisation method for minimisation of application service operational cost"}, {"paperId": "8aa9bae2e4bbfcb9e494368a0886ed7e8d04ae7d", "title": "Predictive replica placement for mobile users in distributed fog data stores with client-side markov models"}, {"paperId": "455a94ddacfa925bb54b394f2f8a992355b0c6ac", "title": "Towards grassroots peering at the edge"}, {"paperId": "bcd5824b74b500655bec8ae4a4f5ba767c782b05", "title": "AuctionWhisk: Using an auction‐inspired approach for function placement in serverless fog platforms"}]}
