{"paperId": "8c6fbc2791f9a886d19694d00ebfc0ee5d0c3fbe", "publicationVenue": {"id": "41bf9ed3-85b3-4c90-b015-150e31690253", "name": "Conference on Empirical Methods in Natural Language Processing", "type": "conference", "alternate_names": ["Empir Method Nat Lang Process", "Empirical Methods in Natural Language Processing", "Conf Empir Method Nat Lang Process", "EMNLP"], "url": "https://www.aclweb.org/portal/emnlp"}, "title": "FANATIC: FAst Noise-Aware TopIc Clustering", "abstract": "Extracting salient topics from a collection of documents can be a challenging task when a) the amount of data is large, b) the number of topics is not known a priori , and/or c) “topic noise” is present. We deﬁne “topic noise\" as the collection of documents that are irrelevant to any coherent topic and should be ﬁltered out. By design, most clustering algorithms (e.g., k-means , hierarchical clustering) assign all input documents to one of the available clusters, guaranteeing any topic noise to propagate into the result. To address these challenges, we present a novel algorithm, FANATIC , that efﬁciently distinguishes genuine topic documents from those that are topic noise. We also introduce a new Reddit dataset to showcase FANATIC as it contains short, noisy data that is difﬁcult to cluster using most clustering algorithms. We ﬁnd that FANATIC clusters 500k Reddit titles (of which 20% are topic noise) in 2 minutes and achieves an AMI score of 0.59, in contrast with hdbscan (McInnes et al., 2017), a popular algorithm suited for this type of task, which requires over 7 hours and achieves an AMI of 0.03. Finally, we test FANATIC against a Twitter dataset and ﬁnd again that it outperforms the other algorithms with an AMI score of 0.60. We make our code 1 and data publicly available.", "venue": "Conference on Empirical Methods in Natural Language Processing", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": null, "journal": {"pages": "650-663"}, "authors": [{"authorId": "103334047", "name": "A. Silburt"}, {"authorId": "2022991207", "name": "Anja Subasic"}, {"authorId": "2057178422", "name": "Evan Thompson"}, {"authorId": "3283700", "name": "Carmeline J. Dsilva"}, {"authorId": "29781674", "name": "Tarec Fares"}], "citations": [{"paperId": "7e560e24c9946a5213bed19f48cbea0ad1a30271", "title": "Topic Modeling With Topological Data Analysis"}]}
