{"paperId": "8c81b9933a2855d75393d0169b1c5ba97a14f531", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Data-Driven Decision Making in Maintenance Service Delivery Process: A Case Study", "abstract": "Data availability is changing the way companies make decisions at various levels (e.g., strategical and operational). Researchers and practitioners are exploring how product–service system (PSS) providers can benefit from data availability and usage, especially when it comes to making decisions related to service delivery. One of the services that are expected to benefit most from data availability is maintenance. Through the analysis of the asset health status, service providers can make informed and timely decisions to prevent failures. Despite this, the offering of data-based maintenance service is not trivial, and requires providers to structure themselves to collect, analyze and use historical and real-time data properly (e.g., introducing suitable information flows, methods and competencies). The paper aims to investigate how a manufacturing company can re-engineer its maintenance service delivery process in a data-driven fashion. Thus, the paper presents a case study where, based on the Dual-perspective, Data-based, Decision-making process for Maintenance service delivery (D3M), an Italian manufacturing company reengineered its maintenance service delivery process in a data-driven fashion. The case study highlights the benefits and barriers coming with this transformation and aims at helping manufacturing companies in understanding how to address it.", "venue": "Applied Sciences", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-07-22", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "2056998026", "name": "Roberto Sala"}, {"authorId": "2479720", "name": "F. Pirola"}, {"authorId": "2985562", "name": "G. Pezzotta"}, {"authorId": "35811127", "name": "S. Cavalieri"}], "citations": [{"paperId": "f51f11276978c33cb6cc171d7af9908eea111333", "title": "Sustainability perceptions towards digitalization of maintenance services – A survey"}, {"paperId": "b06c392aab22519025cf9982d0f1ce5cd951da56", "title": "The Digitalization Paradigm: Impacts on Agri-Food Supply Chain Profitability and Sustainability"}, {"paperId": "ac895f82eed5b076af4677fcdb8b2af7595c1c1e", "title": "Q-Learning Decision-Making Model for Robotic System"}, {"paperId": "8c1340ab48434f7af2c4375143eef906bd69a364", "title": "Special Issue “Advanced Digital Technologies for the Integration of Production and Maintenance”"}, {"paperId": "d0c2aea5f2f0f2f5d361848ed85ae627b7192f78", "title": "Leveraging Natural Language Processing for enhanced remote troubleshooting in Product-Service Systems: A case study"}]}
