{"paperId": "8c879b8afef2184dc75f7ff9923fd78be8c0af30", "publicationVenue": {"id": "cb87b91e-7788-4e4f-bed1-6ca64f4102de", "name": "ACM Transactions on Reconfigurable Technology and Systems", "type": "journal", "alternate_names": ["ACM Trans Reconfigurable Technol Syst"], "issn": "1936-7406", "url": "https://trets.cse.sc.edu/index.html", "alternate_urls": ["http://portal.acm.org/browse_dl.cfm?coll=portal&dl=ACM&idx=J1151&linked=1&part=transaction", "http://portal.acm.org/trets/"]}, "title": "Substream-Centric Maximum Matchings on FPGA", "abstract": "Developing high-performance and energy-efficient algorithms for maximum matchings is becoming increasingly important in social network analysis, computational sciences, scheduling, and others. In this work, we propose the first maximum matching algorithm designed for FPGAs; it is energy-efficient and has provable guarantees on accuracy, performance, and storage utilization. To achieve this, we forego popular graph processing paradigms, such as vertex-centric programming, that often entail large communication costs. Instead, we propose a substream-centric approach, in which the input stream of data is divided into substreams processed independently to enable more parallelism while lowering communication costs. We base our work on the theory of streaming graph algorithms and analyze 14 models and 28 algorithms. We use this analysis to provide theoretical underpinning that matches the physical constraints of FPGA platforms. Our algorithm delivers high performance (more than 4× speedup over tuned parallel CPU variants), low memory, high accuracy, and effective usage of FPGA resources. The substream-centric approach could easily be extended to other algorithms to offer low-power and high-performance graph processing on FPGAs.", "venue": "ACM Transactions on Reconfigurable Technology and Systems", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-04-24", "journal": {"name": "ACM Transactions on Reconfigurable Technology and Systems (TRETS)", "pages": "1 - 33", "volume": "13"}, "authors": [{"authorId": "2919642", "name": "Maciej Besta"}, {"authorId": "2125673249", "name": "Marc Fischer"}, {"authorId": "1402921119", "name": "Tal Ben-Nun"}, {"authorId": "35608738", "name": "J. D. F. Licht"}, {"authorId": "1713648", "name": "T. Hoefler"}], "citations": [{"paperId": "eff9d7ed06f30f121d30ee13802a11f172ef66f4", "title": "Demystifying Chains, Trees, and Graphs of Thoughts"}, {"paperId": "94e3bc7762f52ad0b125847abb44991877069a4e", "title": "PH-CF: A Phased Hybrid Algorithm for Accelerating Subgraph Matching Based on CPU-FPGA Heterogeneous Platform"}, {"paperId": "420f8b01e0ddd3c3f4c5620acbd71e26275786b5", "title": "The Graph Database Interface: Scaling Online Transactional and Analytical Graph Workloads to Hundreds of Thousands of Cores"}, {"paperId": "17f3d9b84c21cfc313d5c11f9efba37605cade94", "title": "Software Systems Implementation and Domain-Specific Architectures towards Graph Analytics"}, {"paperId": "1cbbe1a129c0d1f53d8e16ca74238334372507dc", "title": "Neural Graph Databases"}, {"paperId": "7e3b8a70d72a0ba4c7f189991d912822a1f2959d", "title": "ProbGraph: High-Performance and High-Accuracy Graph Mining with Probabilistic Set Representations"}, {"paperId": "8018a561d2ed821cfb4be7ce04993cabf9932c2f", "title": "Parallel and Distributed Graph Neural Networks: An In-Depth Concurrency Analysis"}, {"paperId": "fae835d155ab7a11361a56ce811a3f7620833e55", "title": "I/O-Optimal Cache-Oblivious Sparse Matrix-Sparse Matrix Multiplication"}, {"paperId": "0c2d35908e1af4fd3ec48db93333f82d9a09c4de", "title": "Motif Prediction with Graph Neural Networks"}, {"paperId": "939afb90c0777d59c2b0cda0eeba0c81de37f966", "title": "Pebbles, Graphs, and a Pinch of Combinatorics: Towards Tight I/O Lower Bounds for Statically Analyzable Programs"}, {"paperId": "5984a0b6957b0e9ed8b030c3784f3ec367fbfd8c", "title": "SISA: Set-Centric Instruction Set Architecture for Graph Mining on Processing-in-Memory Systems"}, {"paperId": "6957a14503962507e54ba81f6de389c1d4f3efc6", "title": "GraphMineSuite: Enabling High-Performance and Programmable Graph Mining Algorithms with Set Algebra"}, {"paperId": "492dd72eefe96dbeac7d584bdd5a8defc84f519e", "title": "FAST: FPGA-based Subgraph Matching on Massive Graphs"}, {"paperId": "707bbb88b98d57ee9b0abb37032d7ac52ecae80e", "title": "SeBS: a serverless benchmark suite for function-as-a-service computing"}, {"paperId": "8718602787607f263848d61bf25f749734c7f38a", "title": "FatPaths: Routing in Supercomputers and Data Centers when Shortest Paths Fall Short"}, {"paperId": "a1124bbff30af32e9fe5bee6c4fa0cdcef5e7356", "title": "High-Performance Parallel Graph Coloring with Strong Guarantees on Work, Depth, and Quality"}, {"paperId": "d0ecffd78981d6bb85dec8b6ed27fc55a01179bf", "title": "Non-relational Databases on FPGAs: Survey, Design Decisions, Challenges"}, {"paperId": "9db6be4865c09d406e7fe0f5fe1a0ad21c4f184f", "title": "High-Performance Routing With Multipathing and Path Diversity in Ethernet and HPC Networks"}, {"paperId": "d286f81e9cdb9371f8d91d1407c1fc8906f4865a", "title": "High-Performance Routing with Multipathing and Path Diversity in Supercomputers and Data Centers"}, {"paperId": "db0b44855b14533a22dbbd09f24f62a08cedef80", "title": "Practice of Streaming Processing of Dynamic Graphs: Concepts, Models, and Systems"}, {"paperId": "1d7e36762ba7cda0231ff6f64d33f3c324f5d48b", "title": "Practice of Streaming and Dynamic Graphs: Concepts, Models, Systems, and Parallelism"}, {"paperId": "663475b0ea12e123afff6d7ccd75488cc19ea79c", "title": "Slim graph: practical lossy graph compression for approximate graph processing, storage, and analytics"}, {"paperId": "80338991128f599da08f8b27224bd2cd4b92daed", "title": "Communication-Efficient Jaccard similarity for High-Performance Distributed Genome Comparisons"}, {"paperId": "689c7a86d973895a14feb984b8faa3d5581038ef", "title": "Demystifying Graph Databases: Analysis and Taxonomy of Data Organization, System Designs, and Graph Queries"}, {"paperId": "7dd855287e476ef967885732f127a5206d777e0d", "title": "Quality Measurement of Judgment Documents"}, {"paperId": "0b9078c176ded3a7d46dd56f242a74ab3e92a241", "title": "Graph Processing on FPGAs: Taxonomy, Survey, Challenges"}, {"paperId": "8a4af4ef0d8beb356ffa009ab96437f833a3dba3", "title": "Transformations of High-Level Synthesis Codes for High-Performance Computing"}, {"paperId": "d9a69324902294e297c5ba366b0658cf5b17921c", "title": "High-Performance Graph Databases That Are Portable, Programmable, and Scale to Hundreds of Thousands of Cores"}]}
