{"paperId": "8c90fc44298eb3d84456472db804f7fa88276c34", "publicationVenue": {"id": "6cbed6ad-fb46-4c9a-8477-75227ff3a47e", "name": "International Conference on Blockchain Computing and Applications", "type": "conference", "alternate_names": ["BCCA", "Int Conf Blockchain Comput Appl"], "url": "https://ieeexplore.ieee.org/xpl/conhome/1839124/all-proceedings"}, "title": "Poster Paper: Towards Blockchain-Based AI Alignment Using a Proof of Personhood Consensus Mechanism", "abstract": "Recent developments in the field of AI and the public availability of remarkably powerful AI tools, such as the chatbot ChatGPT, have sparked mass interest in AI, raised the possibility of timely emergence of an artificial general intelligence, and thus increased the urgency for AI safety. As AI alignment lags behind other developments in AI, this work explores how blockchain technology can support AI safety. Other works propose the use of distributed ledger technology for this purpose, but mostly without referring to novel consensus mechanisms. This paper suggests to write AI alignment rules in a blockchain that can only be updated by humans using a Proof of Personhood consensus mechanism in combination with, for instance, identity mechanisms and biometric features. Thus, relevant technologies are identified and combined to propose a system that is protected from AI interference and suitable to govern its behavior. Designing such a system is of great importance at a time when an artificial general intelligence could emerge that might one day reject human ethics, goals, and principles.", "venue": "International Conference on Blockchain Computing and Applications", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-10-24", "journal": {"name": "2023 Fifth International Conference on Blockchain Computing and Applications (BCCA)", "pages": "240-242"}, "authors": [{"authorId": "2170908039", "name": "Alexander Neulinger"}], "citations": []}
