{"paperId": "8c910c763f78a9bf48215070bfd709b44bb07597", "publicationVenue": {"id": "ccd6a358-7326-42a7-95e5-bd515c9b5e6c", "name": "Management Decision", "type": "journal", "alternate_names": ["Manag Decis"], "issn": "0025-1747", "url": "http://emeraldgrouppublishing.com/products/journals/journals.htm?id=jmh", "alternate_urls": ["https://www.emeraldinsight.com/loi/md", "http://www.emeraldinsight.com/0025-1747.htm"]}, "title": "A measure of innovation performance: the Innovation Patent Index", "abstract": "PurposeThe measure of companies' Innovation Performance is fundamental for enhancing the value and decision-making processes of firms. The purpose of this paper is to present a new measure of Innovation Performance, called Innovation Patent Index (IPI), which makes it possible to quantitatively summarize different aspects of firms' innovation.Design/methodology/approachIn order to define the IPI, a secondary source, i.e. patent data, has been used. The five dimensions of IPI, i.e. efficiency, time, diversification, quality and internationalization have been defined both analyzing the literature and applying three different machine learning algorithms (regularized least squares, deep neural networks and decision trees), considering patent forward citations as a proxy of the innovation performance.FindingsResults show that the IPI index is a very useful tool, simple to use and very promptly. In fact, it is possible to get important results without making time consuming analysis with primary sources. It is a tool that can be used by managers, businessmen, policymakers, organizations, patent experts and financiers to evaluate and plan future activities, to enhance the innovation capability, to find financing and to support and improve innovation.Research limitations/implicationsPatent data are not widely used in all the sectors. Moreover, the pure number of forward citations is not the only forward looking indicator suggested by the literature.Originality/valueThe demand for a useable Innovation Performance tool, as well as the lack of tools able to grasp different aspects of the innovation, highlight the need to develop new instruments. In fact, although previous studies provide several measures of Innovation Performance, these are often difficult for managers to use, do not appreciate different aspects of the innovation and are not forward looking.", "venue": "Management Decision", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-06-01", "journal": {"name": "Management Decision"}, "authors": [{"authorId": "48065422", "name": "L. Ponta"}, {"authorId": "14415711", "name": "Gloria Puliga"}, {"authorId": "2775814", "name": "R. Manzini"}], "citations": [{"paperId": "5d5c02bae51e6980bce6ab2fb46ff6a8c5ffc160", "title": "Assessing the development of green innovation in China through patent evolution: the hallmark of government policy and private enterprises"}, {"paperId": "a89ec8a70d91b4c88d63bb24c1518dac3655c41b", "title": "Impact of China’s free trade zones on the innovation performance of firms: evidence from a quasi-natural experiment"}, {"paperId": "115d40c2c11a539d9757dd7cbc082e1f4faafec3", "title": "Reacting and recovering after an innovation failure. An agent-based approach"}, {"paperId": "584756923da4dc73e2e179feeac0672602ef2766", "title": "Pengaruh Penerapan Total Quality Management terhadap Kinerja Inovasi Dimediasi Knowledge Sharing"}, {"paperId": "5904771d7ffe082fc9c32c7e58583aa6122c0c5d", "title": "Macroeconomic and financial determinants of green growth: an empirical investigation on BRICS-T countries"}, {"paperId": "144b07081f1bacba40aaa9cda8e2a44c0e4e4aaf", "title": "Innovation Performance Measurement in Entrepreneurial Business: A Comparative Study between Start-ups and More Established Enterprises"}, {"paperId": "b43c9c2f4b4c32a055cf653f7fbdbceca7357640", "title": "Sustainability of the New Energy Automobile Industry: Examining the Relationship among Government Subsidies, R&D Intensity, and Innovation Performance"}, {"paperId": "1c530a4470d5db5b175a71172e56e42f66d4e5cc", "title": "NAVIGATING THE INNOVATION LANDSCAPE: THE CRUCIAL ROLE OF TECHNOLOGY AND ENTREPRENEURIAL ORIENTATION"}, {"paperId": "2b081b1600a9b8429b38b2f504913928462d7c2a", "title": "Do coopetition and cohesion of business groups stimulate their innovation performance?"}, {"paperId": "d0ab402113ce01bbba192e3fd86ec592ea6b2d21", "title": "The Effect of Strategic Flexibility on Innovation Performance of Quoted Pharmaceutical Companies in Nigeria"}, {"paperId": "09f26a18c806eaacef2accb37dbcef66c1289508", "title": "Dissecting the compensation conundrum: a machine learning-based prognostication of key determinants in a complex labor market"}, {"paperId": "bb8d692fe6c0b08821dead573632218067f89574", "title": "Patent Acquisitions in the Healthcare Industry: An Analysis of Learning Mechanisms"}, {"paperId": "ac579f3983c1b79804c1f171849b627060990ab2", "title": "The effect of CEO social capital, CEO duality and state-ownership on corporate innovation"}, {"paperId": "5ca715615ee7763589347e19b5240b2c3e5fc740", "title": "Family Ownership and the Export Performance of SMEs: The Mediating Role of Innovation Capabilities"}, {"paperId": "ffec567b2ce8979d1c0aee025d5eaf562a5091fb", "title": "Impact of minority perceived discrimination on resistance to innovation and moderating role of psychological distress: Evidence from ethnic minority students of China"}, {"paperId": "de0083d763b23bad0d48b82387460ae0d886d0c1", "title": "Strategic trademark management: a systematic literature review and prospects for future research"}, {"paperId": "ccf9969a3d9651483234fa2d63ca558de4475a66", "title": "To copatent or not to copatent: An agent-based model for firms facing this dilemma"}, {"paperId": "435fce507e64a89832de55690ca99255930af87e", "title": "Sustainability-oriented innovation and co-patenting role in agri-food sector: Empirical analysis with patents"}, {"paperId": "4ac974f6bb64a48ed6dc678d5937ea0c9f7732d9", "title": "The Impact of Business Strategic Orientation on Innovation-Driven Mergers and Acquisitions: An Empirical Study"}, {"paperId": "bbd8eb78586aa0dc4b09ba7711e56677039bfc99", "title": "Citations or dollars? Early signals of a firm's research success"}, {"paperId": "680f70c1c47730d439f3013a6f62c52250e6e73d", "title": "The Mechanism of the Role of Big Data Knowledge Management in the Development of Enterprise Innovation"}, {"paperId": "f03af0d3716ee6ca327fd00b744e2f2991532910", "title": "International collaboration and innovation: Evidence from a leading Chinese multinational enterprise"}, {"paperId": "df974af6fae25a91bc7bd2138b7f7cf37ad43a4d", "title": "IMPROVING THE EFFICIENCY OF MANAGEMENT OF INNOVATION ACTIVITY OF THE ENTERPRISE"}]}
