{"paperId": "8c9dcfdd8bfc6390e31ee625cad0fda5909241bd", "publicationVenue": {"id": "4c304f78-3883-487b-8d1e-8e1e14c9b645", "name": "IEEE Photonics Journal", "type": "journal", "alternate_names": ["IEEE Photonics J"], "issn": "1943-0647", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=4563994", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4563994"]}, "title": "A Tunable Dual-Band Metamaterial Filter Based on the Coupling Between Two Crossed SRRs", "abstract": "A tunable dual-band metamaterial filter based on crossed split-ring resonators is numerically and experimentally demonstrated. The proposed tunable metamaterial filter consists of two same metal split rings with different angles. Based on the cross-coupling between these two split rings, two stopbands are generated. Moreover, the operating frequency of the two stopbands can be tuned by changing the angle between the two split rings. In the context of numerical results, surface current distributions and electric field distributions were employed to analyze the basic principle, and the experiments were performed to demonstrate the practical effect. All results verified the tunable characteristics of the proposed metamaterial filter. This design proposes a new tunable metamaterial filter through the angle rotation.", "venue": "IEEE Photonics Journal", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-06-01", "journal": {"name": "IEEE Photonics Journal", "pages": "1-7", "volume": "13"}, "authors": [{"authorId": "1791371", "name": "Z. Qiao"}, {"authorId": "12491216", "name": "Xuchao Pan"}, {"authorId": "2153304555", "name": "Fan Zhang"}, {"authorId": "49394415", "name": "Jianchun Xu"}], "citations": [{"paperId": "a1724b669083a13679671d0e948e819c79470928", "title": "Ka-Band Miniaturized 90 nm Complementary Metal Oxide Semiconductor Wideband Rat-Race Coupler Using Left-Handed and Right-Handed Transmission Lines"}, {"paperId": "3208e8522d40d13fc514a0bd4c2590962fb934c8", "title": "Gap coupled symmetric square split ring high EMR resonator-based metamaterial for S-, C-, and X-bands wireless applications: Simulation and experiment"}, {"paperId": "7c52cf289f279d12bbb3883f12c5aa6d212a4e01", "title": "Research on accelerated coding absorber design with deep learning"}, {"paperId": "71ea5300b4586d2fb2cb0caa4d87df1cb6c11677", "title": "Split-Ring Enclosed K-shaped Rotational Symmetric Metamaterial Absorber for Multiband Wireless Applications"}, {"paperId": "11cc0fd14ec33c157756bc59f151a94e1de2b66e", "title": "A tunable filter with long hole resonance structure"}, {"paperId": "83afb017d77e4c076b2b381fd4ad85104ee1572d", "title": "Optimization of Structural Parameters of PCF Polarization Filter by a Genetic Algorithm"}, {"paperId": "09badfc73e9d3f189cf28bbe8de18589b314b09f", "title": "Graphene-Based Absorption–Transmission Multi-Functional Tunable THz Metamaterials"}, {"paperId": "b904732b48bee0adf2aecf507ac4e2485465e14f", "title": "Switch Controlled 4 bands Band pass Filter with Two E-shaped SIRs*"}, {"paperId": "c3e37e0e22d00f57def4da3b5f14848521ed1ff1", "title": "Symmetric resonator based tunable epsilon negative near zero index metamaterial with high effective medium ratio for multiband wireless applications"}, {"paperId": "e3ee6810e340c31bf6c9153e0d8cb4502c8f1fa2", "title": "A Miniaturized Recon(cid:12)gurable Quad-Band Bandpass Filter with W-Shaped SIRs"}]}
