{"paperId": "8ca77b80c21c909d014c07ef9bfcaf11b1a80832", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "A Comprehensive Analysis of Healthcare Big Data Management, Analytics and Scientific Programming", "abstract": "Healthcare systems are transformed digitally with the help of medical technology, information systems, electronic medical records, wearable and smart devices, and handheld devices. The advancement in the medical big data, along with the availability of new computational models in the field of healthcare, has enabled the caretakers and researchers to extract relevant information and visualize the healthcare big data in a new spectrum. The role of medical big data becomes a challenging task in the form of storage, required information retrieval within a limited time, cost efficient solutions in terms care, and many others. Early decision making based healthcare system has massive potential for dropping the cost of care, refining quality of care, and reducing waste and error. Scientific programming play a significant role to overcome the existing issues and future problems involved in the management of large scale data in healthcare, such as by assisting in the processing of huge data volumes, complex system modelling, and sourcing derivations from healthcare data and simulations. Therefore, to address this problem efficiently a detailed study and analysis of the available literature work is required to facilitate the doctors and practitioners for making the decisions in identifying the disease and suggest treatment accordingly. The peer reviewed reputed journals are selected for the accumulated of published research work during the period ranges from 2015 – 2019 (a portion of 2020 is also included). A total of 127 relevant articles (conference papers, journal papers, book section, and survey papers) are selected for the assessment and analysis purposes. The proposed research work organizes and summarizes the existing published research work based on the research questions defined and keywords identified for the search process. This analysis on the existence research work will help the doctors and practitioners to make more authentic decisions, which ultimately will help to use the study as evidence for treating patients and suggest medicines accordingly.", "venue": "IEEE Access", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2020-05-19", "journal": {"name": "IEEE Access", "pages": "95714-95733", "volume": "8"}, "authors": [{"authorId": "3195938", "name": "S. Nazir"}, {"authorId": "1738153049", "name": "Sulaiman Khan"}, {"authorId": "2056138430", "name": "Habib Ullah Khan"}, {"authorId": "47495965", "name": "Sajid Ali"}, {"authorId": "1398294938", "name": "I. García-Magariño"}, {"authorId": "2198513", "name": "R. Atan"}, {"authorId": "2058324586", "name": "Muhammad Nawaz"}], "citations": [{"paperId": "fa4e6691d216858d9f89007d08ceccd78027e849", "title": "A comprehensive review of data analytics in healthcare management: Leveraging big data for decision-making"}, {"paperId": "5526b42a85eecc65b32a2d0a60fd1fc8ddeee0ce", "title": "Deep Learning-based Cluster Analysis for Healthcare Data Classification"}, {"paperId": "d93f825728cd7fd0d3e4fc61bff6cfd0e68793f4", "title": "A Systematic Review of Literature on Sustaining Decision-Making in Healthcare Organizations Amid Imperfect Information in the Big Data Era"}, {"paperId": "1ab8cbb95457207a99ee5a6e13b6fffde6967aac", "title": "Brain Hemorrhage Detection Using Improved AlexNet with Inception-v4"}, {"paperId": "f70a2212619c1fb3e1450baa3f694d89469b1ff9", "title": "Bibliometric Analysis of Smart Healthcare"}, {"paperId": "af1b75d0c773d642122184675565b1d45cf95fdd", "title": "Data Analytic for Healthcare Cyber Physical System"}, {"paperId": "f7dbd43c0e3667f6aef58eac4a062935d309e89e", "title": "A systematic review on big data applications and scope for industrial processing and healthcare sectors"}, {"paperId": "9216c318b628861d15ed625593cda1d7f7569604", "title": "Design and Evaluation of Application for Enhancing Entrance Exam Preparation"}, {"paperId": "ec9a99f3e7410fd0ea800b2cc79e39254ae35573", "title": "Artificial Intelligence Based System on Enhancing the Capabilities of Transport System: A Systemic Literature Review"}, {"paperId": "2d8b75c1c35ebbdb9351bf30073a2a9dc2a0385d", "title": "Cognitive computing technological trends and future research directions in healthcare - A systematic literature review"}, {"paperId": "d75c6bd8bf8d62aac9487c98548636700f149c62", "title": "Data-driven prediction of greenhouse aquaponics air temperature based on adaptive time pattern network"}, {"paperId": "779f14dc8f99995f4941153a40497d2bb5e87ea2", "title": "Digital-care in next generation networks: Requirements and future directions"}, {"paperId": "8166f9476a82f313e924dc74c0c5e3f1ce1212ba", "title": "An Expert Uncertainty in Healthcare Using Materialized View through Big-Query"}, {"paperId": "a62496d22b8eae05c62320a1bc2dbfc44753ed34", "title": "Data Analytics in Healthcare: A Tertiary Study"}, {"paperId": "cdb5e1ddd8e60ae239d98d1c91e7d6f453d54e83", "title": "Systematic analysis of healthcare big data analytics for efficient care and disease diagnosing"}, {"paperId": "c92ac92ac8a318696ab006b9d9631483c56fe8f2", "title": "Utilizing the collective wisdom of fintech in the gcc region: A systematic mapping approach"}, {"paperId": "ebe560512999b1a400a89c62daa5125e8d3d35b2", "title": "Ship detection based on deep learning using SAR imagery: a systematic literature review"}, {"paperId": "0246524c62e9157e9f059923b641ec2bbca0ff70", "title": "Electronic Medical Record Management System Using Recommendation Algorithm"}, {"paperId": "09d4c7def5f01a7d94ae918f26eca5d166bbbbfe", "title": "A Comprehensive Study On Medical Image Security Algorithms"}, {"paperId": "35f42fd36b648721d4ebf4f009e0c61628749390", "title": "Big Data with IoT to Develop Sustainability"}, {"paperId": "073d760ce3a07c53702cb5588ebce55c177b9b24", "title": "Visual Presentation and Trend Derivation of the Medical Big Data Research based on a Multi-level Bibliometric Analysis"}, {"paperId": "9f3b7778fcb6fe2460c39a0eae4997f10ff81d16", "title": "Transforming the competencies of Artificial Intelligence to ensure the Cyber Threats: A Systemic Literture Review of Busniess Sectors"}, {"paperId": "e85530ffb6dce57f19d742b198ac086a9369d602", "title": "Classification of clustered health care data analysis using generative adversarial networks (GAN)"}, {"paperId": "75920884c8fead8a155e4076eb4e5e79760fe018", "title": "Secure Smart Healthcare Monitoring in Industrial Internet of Things (IIoT) Ecosystem with Cosine Function Hybrid Chaotic Map Encryption"}, {"paperId": "ccd3ce9a2ffa132f472a3037d8d7f6fd1488ad1e", "title": "An innovative big data framework for exploring the impact on decision-making in the European Mediterranean healthcare sector"}, {"paperId": "6a5aa380d5f990a20c6548d158c0e94d4f01d378", "title": "Decision-Making and Computational Modeling of Big Data for Sustaining Influential Usage"}, {"paperId": "23b6b8f3cd73aec94af1acef3eeda550753fbd9f", "title": "A Cluster-based Stratified Hybrid Decision Support Model under Uncertainty: Sustainable Healthcare Landfill Location Selection"}, {"paperId": "dd39a9a9260089c07317642867c3fc7c076ea8ec", "title": "Mobile health evaluation: Taxonomy development and cluster analysis"}, {"paperId": "b3519c37a5f720b181f256319e6cff68e0da9629", "title": "Internet of Things Based Intelligent Techniques in Workable Computing: An Overview"}, {"paperId": "2fa67853e6f60d9fdc3e8fb2d867847fabd1aa1b", "title": "Security Aware Information classification in Health Care Big Data"}, {"paperId": "e73438185bce358ddaf0eb330cb216970d79df63", "title": "Secured Big Data Analytics for Decision-Oriented Medical System Using Internet of Things"}, {"paperId": "54dbc31dc6e1d71aa67fae26d52becdbbc165ad2", "title": "Security and provenance for Internet of Health Things: A systematic literature review"}, {"paperId": "481b865ce3ab5f2374c854f160386effae3927e2", "title": "Business big data analysis based on microprocessor system and mathematical modeling"}, {"paperId": "336053001fc6ab6a17f69923f7be4a51abd80113", "title": "An Overview on Analyzing Deep Learning and Transfer Learning Approaches for Health Monitoring"}, {"paperId": "62b0ad27ea2c73d94acf5ef4756ee5da0d5520fb", "title": "Big data driven COVID-19 pandemic crisis management: potential approach for global health"}, {"paperId": "23855d26d3df96715c4490a5e6eba7dfe8fecdd2", "title": "Correlation between Triadic Closure and Homophily Formed over Location-Based Social Networks"}, {"paperId": "c752c01b22a07b9718acb476fab2d5be887fcc23", "title": "Big Data, Extracting Insights, Comprehension, and Analytics in Cardiology: An Overview"}, {"paperId": "697f2f3598057cd17cff7749d768cae0993c6727", "title": "A Framework for Pandemic Prediction Using Big Data Analytics"}, {"paperId": "1160889744a54a1cac0d1e0d474001c6016745b3", "title": "Investigation of PCA as a compression pre-processing tool for X-ray image classification"}, {"paperId": "72d0d6f5f4a4b9a1063c982a0ed3654aa5c42415", "title": "Use of Big Data Tools and Industrial Internet of Things: An Overview"}, {"paperId": "9d50398a415946467fcb446a35fe152ccf1c5548", "title": "On How Chronic Conditions Affect the Patient-AI Interaction: A Literature Review"}, {"paperId": "da422f6e82cab7ced4f6cbfe4a7383f15437c844", "title": "A Systematic Review on Cloud Storage Mechanisms Concerning e-Healthcare Systems"}, {"paperId": "3fa879b746d9bb620fed43e68e277ecf66070186", "title": "A Comprehensive Analysis of Healthcare Websites Usability Features, Testing Techniques and Issues"}, {"paperId": "90da4e3a61e416c17827c6351c6ce699a6fd8728", "title": "A Dynamic Repository Approach for Small File Management With Fast Access Time on Hadoop Cluster: Hash Based Extended Hadoop Archive"}, {"paperId": "a6566636802cad8691e2764bbda9571ddef3905c", "title": "Genetic Algorithm Based Automatic Out-Patient Experience Management System (GAPEM) Using RFIDs and Sensors"}, {"paperId": "9169c1d18cfddc6c3eee7bba85a716f58630f8b0", "title": "Analysis of Navigation Assistants for Blind and Visually Impaired People: A Systematic Review"}, {"paperId": "f08e4c15173a9dab9ba2bbaff63394e0e82b8de4", "title": "Big Data Insights and Comprehensions in Industrial Healthcare: An Overview"}, {"paperId": "04963a3ffa31360d1f85694f8a20621ee3a5a45f", "title": "Big Data and Its V's with IoT to Develop Sustainability"}, {"paperId": "80693216f756f57c9c4aee716941c3c6ab2bf99e", "title": "MOBILE DATA COLLECTION TECHNOLOGY AS IMPETUS FOR THE USE OF QUALITY OF CARE (QOC) ASSESSMENT IN NON-FOR-PROFIT FACILITIES"}, {"paperId": "7345ffdda0036065121fce6b13946441cb8df32d", "title": "Innovative Paradigms for Supporting Privacy-Preserving Multidimensional Big Healthcare Data Management and Analytics: The Case of the EU H2020 QUALITOP Research Project"}, {"paperId": "307182c3225a7177f31b930aebdf714f2cd6f399", "title": "Inference Control in a Diabetes Data Set Algorithm"}, {"paperId": "c2640c8fefb3df1e37c899bffed491ae4776abdf", "title": "Systematic Analysis of Safety and Security Risks in Smart Homes"}, {"paperId": "337e8575584c696136d3b12237be74823cd130e9", "title": "International Journal of Soft Computing and Engineering"}, {"paperId": "12d6ac7d217736f86c3470e8c24f4861c8d14d5d", "title": "ROLE OF BIG DATA ANALYTICS AND FIFA WORLD CUP 2022 ON THE QATAR’S TOURISM INDUSTRY: SYSTEMATIC REVIEW"}]}
