{"paperId": "8cb35bbf013802218d1c3554051ac5425d91868a", "publicationVenue": {"id": "31c6e511-cc0b-42e2-901d-97b4b6f6605e", "name": "International Conference on Field-Programmable Logic and Applications", "type": "conference", "alternate_names": ["Field-programmable Log Appl", "Int Conf Field-programmable Log Appl", "Field-Programmable Logic and Applications", "FPL"], "url": "http://www.fpl.org/h/"}, "title": "Exploring FPGA Optimizations in OpenCL for Breadth-First Search on Sparse Graph Datasets", "abstract": "Breath-first search (BFS) is a fundamental building block in many graph-based applications. It is challenging to optimize due to its irregular memory-access pattern. Prior work, based on hardware description languages (HDLs) and high-level synthesis (HLS), address the memory-access bottleneck by using techniques such as edge-centric traversal, data alignment, and compute-unit (CU) replication. While these optimizations work well for dense graph datasets, optimizing BFS on sparse graphs remains a significant challenge due to the kernel launch overhead and poor workload distribution across processing elements. As a complement to the prior work, we present and evaluate optimizations in OpenCL for BFS on sparse graphs. Specifically, we explore application-specific and architecture-aware optimizations aimed at mitigating the irregular global-memory access bottleneck in sparse graphs. In our kernel design, we consider factors such as choice of data structure between queue and array, number of memory banks, and kernel launch configuration. We evaluate the impact of proposed optimizations on a diverse set of sparse graphs. In comparison with the state-of-the-art OpenCL implementation for FPGA, we achieve 5.7X-22.3X speedup on Stratix 10 SX 2800 FPGA for the graphs that are most sensitive to our optimization scheme.", "venue": "International Conference on Field-Programmable Logic and Applications", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-08-01", "journal": {"name": "2020 30th International Conference on Field-Programmable Logic and Applications (FPL)", "pages": "133-137"}, "authors": [{"authorId": "1996183921", "name": "Atharva Gondhalekar"}, {"authorId": "1409948849", "name": "W. Feng"}], "citations": [{"paperId": "14518fbd754dd5755a77c3c416677d235b9e131a", "title": "Optimal Task-Offloading Control for Edge Computing System With Tasks Offloaded and Computed in Sequence"}, {"paperId": "105352aa26973006ccd5417e0cf65f07256b46ec", "title": "Analysis of Graph Processing in Reconfigurable Devices for Edge Computing Applications"}, {"paperId": "3136699565684d2c73b0bc55da730355f8ffc4c3", "title": "Towards Intelligent RAN Slicing for B5G: Opportunities and Challenges"}]}
