{"paperId": "8cc39b989ccd4711df25b25563cd7c6443c808a7", "publicationVenue": {"id": "3f2626a8-9d78-42ca-9e0d-4b853b59cdcc", "name": "IEEE International Conference on Robotics and Automation", "type": "conference", "alternate_names": ["International Conference on Robotics and Automation", "Int Conf Robot Autom", "ICRA", "IEEE Int Conf Robot Autom"], "issn": "2152-4092", "alternate_issns": ["2379-9544"], "url": "http://ieeexplore.ieee.org/xpl/conhome.jsp?punumber=1000639", "alternate_urls": ["http://www.ncsu.edu/IEEE-RAS/"]}, "title": "Multi-swarm Genetic Gray Wolf Optimizer with Embedded Autoencoders for High-dimensional Expensive Problems", "abstract": "High-dimensional expensive problems are often encountered in the design and optimization of complex robotic and automated systems and distributed computing systems, and they suffer from a time-consuming fitness evaluation process. It is extremely challenging and difficult to produce promising solutions in a high-dimensional search space. This work proposes an evolutionary optimization framework with embedded autoencoders that effectively solve optimization problems with high-dimensional search space. Autoencoders provide strong dimension reduction and feature extraction abilities that compress a high-dimensional space to an informative low-dimensional one. Search operations are performed in a low-dimensional space, thereby guiding whole population to converge to the optimal solution more efficiently. Multiple subpopulations coevolve iteratively in a distributed manner. One subpopulation is embedded by an autoencoder, and the other one is guided by a newly proposed Multi-swarm Gray-wolf-optimizer based on Genetic-learning (MGG). Thus, the proposed multi-swarm framework is named Autoencoder-based MGG (AMGG). AMGG consists of three proposed strategies that balance exploration and exploitation abilities, i.e., a dynamic subgroup number strategy for reducing the number of subpopulations, a subpopulation reorganization strategy for sharing useful information about each subpopulation, and a purposeful detection strategy for escaping from local optima and improving exploration ability. AMGG is compared with several widely used algorithms by solving benchmark problems and a real-life optimization one. The results well verify that AMGG outperforms its peers in terms of search accuracy and convergence efficiency.", "venue": "IEEE International Conference on Robotics and Automation", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-05-29", "journal": {"name": "2023 IEEE International Conference on Robotics and Automation (ICRA)", "pages": "7265-7271"}, "authors": [{"authorId": "2344116", "name": "J. Bi"}, {"authorId": "2154098312", "name": "Jiahui Zhai"}, {"authorId": "34825854", "name": "Haitao Yuan"}, {"authorId": "2221311752", "name": "Ziqi Wang"}, {"authorId": "1723689", "name": "J. Qiao"}, {"authorId": "2108830806", "name": "Jia Zhang"}, {"authorId": "2205058164", "name": "Mengchu Zhou"}], "citations": [{"paperId": "01fd2a50caeeeb47918a4616fbf0425b947cbfa2", "title": "Autoencoder and Teaching-learning-based Optimizer for Mobile Edge Computing System Optimization Problems"}]}
