{"paperId": "8cc8de58490bdbd131df4d986f5d047f942b1fb1", "publicationVenue": {"id": "a9e5a34f-a71a-4cd8-bac7-9e902fa6d088", "name": "IEEE Conference on Local Computer Networks", "type": "conference", "alternate_names": ["LCN", "Local Computer Networks", "IEEE Conf Local Comput Netw", "Local Comput Netw"], "url": "http://www.ieeelcn.org/"}, "title": "Managing Container QoS with Network and Storage Workloads over a Hyperconverged Platform", "abstract": "Container resource management is non-trivial over hyperconverged platforms where the storage is shared among host servers. Therefore, the same backbone network is used by storage and regular network traffic. In this paper, we first characterize this problem by analyzing the nature of the traffic from storage workloads and its impact on the network workloads in a container-based virtualization environment. Accordingly, we develop CONtrol, a resource management approach for assuring network workloads’ performance in the presence of storage workloads. CONtrol uses a proportional-integral-derivative controller to dynamically decide the bandwidth redistribution among various workloads. Additionally, it uses a container migration strategy for balancing the workloads across different servers of a hyperconverged platform. We have implemented CONtrol over a hyperconverged platform with 5 physical servers. Thorough testing indicates that it can significantly improve the performance of various benchmark applications over a containerized hyper-converged platform.", "venue": "IEEE Conference on Local Computer Networks", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-11-16", "journal": {"name": "2020 IEEE 45th Conference on Local Computer Networks (LCN)", "pages": "112-123"}, "authors": [{"authorId": "9414718", "name": "Sumitro Bhaumik"}, {"authorId": "1708109", "name": "Sandip Chakraborty"}], "citations": [{"paperId": "deb4754f39b56bfdaaedbc2f07039a434d29432d", "title": "VNF and CNF Placement in 5G: Recent Advances and Future Trends"}, {"paperId": "bfed157532e5741b6c18227d47513a8402ebfa94", "title": "VNF and Container Placement: Recent Advances and Future Trends"}]}
