{"paperId": "8cd5d7220f173fa1fc070b40ecec3e5e37a959ab", "publicationVenue": {"id": "22d1db70-9ab0-44a4-ab3c-72560c6d550d", "name": "Digital Twin", "alternate_names": ["Digit Twin"], "issn": "2752-5783"}, "title": "Digital twins: A brief overview of applications, challenges and enabling technologies in the last decade", "abstract": "The concept of Digitals Twins (DTs) is an evolving idea, which is becoming the center of attention for the industry and the scientific community. It can be described as the pairing of the digital and the physical, interconnected for data sharing. DT is a key enabler for Industry 4.0, especially on the digitalization and visualization processes. Even though the idea of DT has been defined thoroughly throughout the recent years, there are still many different interpretations which are the result of different viewpoints of the involved professionals. The digitalization process requires huge amounts of data, which is generated, collected, handled and processed by various sources as well as digital twins themselves, thus offering new challenges that need to be addressed. In this paper, we attempt to i) assess the current state of digital twins, ii) describe the terms digital model and digital shadow as they are often misused as synonyms and iii) review the concepts of Internet of Things (IoT) and Industry 4.0 and discuss how these are connected. Moreover, some applications of DTs and their enabling technologies will be presented.", "venue": "Digital Twin", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-03-17", "journal": {"name": "Digital Twin"}, "authors": [{"authorId": "2159270833", "name": "O. Eleftheriou"}, {"authorId": "1696199", "name": "C. Anagnostopoulos"}], "citations": [{"paperId": "2ff804ccba3755cc0bf99d34bb1fe42122145b71", "title": "Digital twin applications on cultural world heritage sites in China: A state-of-the-art overview"}, {"paperId": "40146de64e5f93c1661c101ace3a0d7bf5effc6f", "title": "A Comprehensive Review of Digital Twin from the Perspective of Total Process: Data, Models, Networks and Applications"}, {"paperId": "fa1d34f186d5b1405974411282009885a3e04429", "title": "Design of an Educational-development Platform for Digital Twins using the Interoperability of the OPC UA Standard and Industry 4.0 Components"}, {"paperId": "814f42ab4ce0da1c8bcc14840e6d8072bf1d76c7", "title": "Role of Digital Twin Technology in Automotive Sectors: An Overview"}, {"paperId": "b4593f87044af68002ec8db595d4816b168619a8", "title": "A user-centred virtual city information model for inclusive community design: State-of-art"}, {"paperId": "877f5e75104bca00b9784a02d72f372e5e719f30", "title": "Educational-development Workplace for Digital Twins using the OPC UA and Unity 3D"}, {"paperId": "c6d8568c2bb95fdc6b17c386fd10785834edd64b", "title": "The Digital Twin in Medicine: A Key to the Future of Healthcare?"}, {"paperId": "c6889dfb97ee9b518ff35f054d851a8e8d79f57c", "title": "Dataspaces in Urban Digital Twins: a Case Study in the Photovoltaics"}, {"paperId": "dc396a2a194065464b6bbf166959e9467f71e4a2", "title": "Application of the digital twin concept in cultural heritage"}, {"paperId": "2c8e2aecedf93872b1ce3358b92e2ffba9954f8c", "title": "An immersive experience for the room with agrestic paintings in Carditello (CE)"}]}
