{"paperId": "8cdaa9ae87217adf849e95be18f2422024b51724", "publicationVenue": {"id": "fa91d303-6b86-4497-bb95-1ba405c3fc7c", "name": "Architecture", "issn": "2673-8945"}, "title": "A Beginner’s Guide to Developing Review-Based Conceptual Frameworks in the Built Environment", "abstract": "With the boom of industry 4.0 technologies and their adoption in the built environment (BE), conceptual frameworks (CFs) are increasingly developed to facilitate the adoption. It is becoming increasingly important to develop a standard or guide for new BE research entrants and aspirants who want to conduct a systematic literature review and develop such CFs. However, they struggle to find a standard and reproducible procedure to conduct systematic literature reviews and develop CFs successfully. Accordingly, the current study based on requests and inspirations from nascent BE researchers presents guidelines about conducting such studies. A simplistic yet reproducible methodology is presented that can be followed by BE research aspirants to produce high-quality and well-organized review articles and develop a CF. Using an example of big data-based disaster management in smart cities, the current study provides a practical example of conducting a systematic literature review and developing a CF. It is expected that this research will serve as a baseline for conducting systematic studies in the BE field that other fields of science can adopt. Further, it is expected that this study will motivate the nascent BE researchers to conduct systematic reviews and develop associated CFs with confidence. This will pave the way for adopting disruptive technologies and innovative tools in the BE in line with industry 4.0 requirements.", "venue": "Architecture", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2021-09-01", "journal": {"name": "Architecture"}, "authors": [{"authorId": "48633912", "name": "Fahim Ullah"}], "citations": [{"paperId": "c269db97e30c810590dc221fcf3faa835192bf10", "title": "Decoding Social Sustainability in Construction Projects: Analysis of Project Dynamics and Impact"}, {"paperId": "5c265d10da00b50cd32bf3f5ad9ed219661fdfd1", "title": "Function Follows Form: Considerations on Hard Heritage Facing the Climate Emergency"}, {"paperId": "1a4293fa15c25a5b14a9b980c365a2e38a300f44", "title": "Functionality as a Key Concept for Integrated Project Planning and Scheduling Methods"}, {"paperId": "35347aed40b8fa7fbea7f97bfafba7eb8b035561", "title": "A Scoping Review of Voxel-Model Applications to Enable Multi-Domain Data Integration in Architectural Design and Urban Planning"}, {"paperId": "05e7f955df980be5cece123bab3ea851c3fa29a9", "title": "A Review of the Public Transport Services Based on the Blockchain Technology"}, {"paperId": "544a9a212345efa8418d42807fbeea1e9e3ada38", "title": "Key Enablers of Resilient and Sustainable Construction Supply Chains: A Systems Thinking Approach"}, {"paperId": "08258f852be376729fdaaa0eccc8229f00832f1e", "title": "Automated Computer Vision-Based Construction Progress Monitoring: A Systematic Review"}, {"paperId": "365b45331c09672c6070816b50a21fb901012d28", "title": "Circular Economy in the Construction Industry: A Step towards Sustainable Development"}, {"paperId": "177b16358f58d07a1459fd79a7949e04b6dda1ed", "title": "Scientific Landscape of Embodied Experience in the Virtual Environment: A Bibliometric Analysis"}, {"paperId": "896570d328180646c30f8c2ca61bb3dad6f5c5a4", "title": "Building Information Modeling (BIM) Capabilities in the Operation and Maintenance Phase of Green Buildings: A Systematic Review"}, {"paperId": "d678f6e538edbd6870a9eaed224869e5529d9293", "title": "Key Adoption Factors for Collaborative Technologies and Barriers to Information Management in Construction Supply Chains: A System Dynamics Approach"}, {"paperId": "673ec1c6c06e4c0ad8193355164ef57e55874528", "title": "Systematic Literature Review to Identify the Critical Success Factors of the Build-to-Rent Housing Model"}, {"paperId": "66619375a03bb9751dc86e2ec2654de67e2a0b7c", "title": "Automatic Target Detection from Satellite Imagery Using Machine Learning"}, {"paperId": "bf6b994a579b1a8b74dfd6d5ba3dc5888fd86188", "title": "Using Adaptive Sensors for Optimised Target Coverage in Wireless Sensor Networks"}, {"paperId": "9a541498e285a35443f08b5bdf165e95de394f19", "title": "Assessing Rainwater Harvesting Potential in Urban Areas: A Building Information Modelling (BIM) Approach"}, {"paperId": "f39e5bf6948806d5b3ef33e2802b382292316230", "title": "Assessing Nitrate Contamination Risks in Groundwater: A Machine Learning Approach"}, {"paperId": "2af7b1da7aac431242c3e9967a0d7f01d4988a08", "title": "Application of Deep Learning on UAV-Based Aerial Images for Flood Detection"}]}
