{"paperId": "8cdd63a58689c8864f1caf1cd612d849190e5af9", "publicationVenue": {"id": "a966c5e8-76dc-45c0-942a-3c7e41ac9b1a", "name": "International Conference on Computer Supported Cooperative Work in Design", "type": "conference", "alternate_names": ["Computer Supported Cooperative Work in Design", "Int Conf Comput Support Cooperative Work Des", "CSCWD", "Comput Support Cooperative Work Des"], "url": "http://www.cscwd.org/"}, "title": "vHSFC: Generic and Agile Verification of Service Function Chain with parallel VNFs", "abstract": "With the advent of network function virtualization (NFV) and mobile edge computing (MEC), outsourcing network functions (NFs, i.e., firewall) to the MEC is becoming popular among network service providers. Notably, NF outsourcing raises an essential security concern about whether these outsourced NFs and associated service function chains (SFCs) are correctly implemented according to enterprises’ specifications. In particular, SFC with parallel VNFs, which take advantage of parallelism, have been conducted to reduce the traffic delay of traditional sequential SFC, called the hybrid SFC in this paper. Nevertheless, how to ensure correct behaviors and discover runtime mistakes for hybrid SFC remains an open problem.In this paper, we propose vHSFC, a verification scheme for hybrid SFC, enabling enterprises to verify the correctness of SFC enforcement in real-time. vHSFC achieves its goal with a lightweight verified routing protocol, which detects various hybrid SFC violations and attacks, i.e., packet modification, incompliant forwarding path, etc. To demonstrate the feasibility and performance of vHSFC, we have implemented the prototype on top of several containers and conducted extensive experiments with real traffic. The experimental results show that our vHSFC can continuously ensure proper enforcement and discover unexpected violations while incurring sensible overhead.", "venue": "International Conference on Computer Supported Cooperative Work in Design", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-05-24", "journal": {"name": "2023 26th International Conference on Computer Supported Cooperative Work in Design (CSCWD)", "pages": "498-503"}, "authors": [{"authorId": "2118530504", "name": "Sheng Chen"}, {"authorId": "2185512468", "name": "Jinxi Li"}, {"authorId": "2108427217", "name": "Baochao Chen"}, {"authorId": "144233921", "name": "Deke Guo"}, {"authorId": "143668329", "name": "Keqiu Li"}], "citations": []}
