{"paperId": "8ce11e6fc8aa5baf4e4f0417580ff9f8e04b1b49", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Automating Assessment and Providing Personalized Feedback in E-Learning: The Power of Template Matching", "abstract": "This research addressed the need to enhance template-matching performance in e-learning and automated assessments within Egypt’s evolving educational landscape, marked by the importance of e-learning during the COVID-19 pandemic. Despite the widespread adoption of e-learning, robust template-matching feedback mechanisms should still be developed for personalization, engagement, and learning outcomes. This study augmented the conventional best-buddies similarity (BBS) approach with four feature descriptors, Harris, scale-invariant feature transform (SIFT), speeded-up robust features (SURF), and maximally stable extremal regions (MSER), to enhance template-matching performance in e-learning. We systematically selected algorithms, integrated them into enhanced BBS schemes, and assessed their effectiveness against a baseline BBS approach using challenging data samples. A systematic algorithm selection process involving multiple reviewers was employed. Chosen algorithms were integrated into enhanced BBS schemes and rigorously evaluated. The results showed that the proposed schemes exhibited enhanced template-matching performance, suggesting potential improvements in personalization, engagement, and learning outcomes. Further, the study highlights the importance of robust template-matching feedback in e-learning, offering insights into improving educational quality. The findings enrich e-learning experiences, suggesting avenues for refining e-learning platforms and positively impacting the Egyptian education sector.", "venue": "Sustainability", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-09-26", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "2248595761", "name": "Zainab R. Alhalalmeh"}, {"authorId": "2248594397", "name": "Yasser M. Fouda"}, {"authorId": "2248594374", "name": "Muhammad A. Rushdi"}, {"authorId": "1398661880", "name": "Moawwad E. A. El-Mikkawy"}], "citations": []}
