{"paperId": "8ce2075774fca8122b6486a4b75559f91c9598a4", "publicationVenue": {"id": "b36a6509-bfd0-4dc4-8ac0-cb39f0408dbc", "name": "KnE Social Sciences", "type": "journal", "alternate_names": ["Kne Soc Sci"], "issn": "2518-668X", "url": "http://www.knepublishing.com/index.php/Kne-Social"}, "title": "Opportunities and Challenges in the Use of Big Data in Healthcare: A Literature Review", "abstract": "Digitalisation and the use of technology are pushing the spread of new business models and improving the efficiency of processes. The demand for innovative and revolutionary applications is increasing, along with the use of big data (BD). The proliferation of large quantities of data is receiving considerable attention in all sectors due to the possibility of using these data in decision-making processes. In the healthcare sector, the role of BD is prominent, especially regarding patient diagnostics, fast epidemic recognition and patient management improvement. To ensure personalised care, the health system must transform individual medical services into electronic forms and favour complete and systemic automation based on the advanced technologies of Industry 4.0. This paper consists of a systematic literature review of the use of BD in the healthcare sector, focusing on the opportunities and challenges. To this end, we selected articles from the Scopus and Web of Science databases. Providing a deep understanding of the state of the art, this paper aims to reveal the implications of the use of BD and offer valuable insights to address future research and identify emerging issues. \nKeywords: big data, healthcare, digitalisation, internet of things, artificial intelligence", "venue": "KnE Social Sciences", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2021-11-30", "journal": {"name": "KnE Social Sciences"}, "authors": [{"authorId": "101392862", "name": "Grazia Dicuonzo"}, {"authorId": "2084174748", "name": "Graziana Galeone"}, {"authorId": "2151843865", "name": "Matilda Shini"}], "citations": []}
