{"paperId": "8ce43ac9574435ec0fb9d3d4d09731ad9ff817d5", "publicationVenue": {"id": "e7c556b0-162f-4c48-9d25-fe3c141f984e", "name": "Big Data and Cognitive Computing", "alternate_names": ["Big Data Cogn Comput"], "issn": "2504-2289", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-1077183", "alternate_urls": ["https://www.mdpi.com/journal/BDCC", "https://www.mdpi.com/journal/BDCC/about", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-1077183"]}, "title": "Unraveling the Impact of Land Cover Changes on Climate Using Machine Learning and Explainable Artificial Intelligence", "abstract": "A general issue in climate science is the handling of big data and running complex and computationally heavy simulations. In this paper, we explore the potential of using machine learning (ML) to spare computational time and optimize data usage. The paper analyzes the effects of changes in land cover (LC), such as deforestation or urbanization, on local climate. Along with green house gas emission, LC changes are known to be important causes of climate change. ML methods were trained to learn the relation between LC changes and temperature changes. The results showed that random forest (RF) outperformed other ML methods, and especially linear regression models representing current practice in the literature. Explainable artificial intelligence (XAI) was further used to interpret the RF method and analyze the impact of different LC changes on temperature. The results mainly agree with the climate science literature, but also reveal new and interesting findings, demonstrating that ML methods in combination with XAI can be useful in analyzing the climate effects of LC changes. All parts of the analysis pipeline are explained including data pre-processing, feature extraction, ML training, performance evaluation, and XAI.", "venue": "Big Data and Cognitive Computing", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-10-15", "journal": {"name": "Big Data Cogn. Comput.", "pages": "55", "volume": "5"}, "authors": [{"authorId": "2134233973", "name": "Anastasiia Kolevatova"}, {"authorId": "10395256", "name": "M. Riegler"}, {"authorId": "47679943", "name": "F. Cherubini"}, {"authorId": "51281328", "name": "Xiangping Hu"}, {"authorId": "48352716", "name": "H. Hammer"}], "citations": [{"paperId": "6e153bc3d74040dea8db5016f5bfae5ce90230f7", "title": "Scalable approach for high-resolution land cover: a case study in the Mediterranean Basin"}, {"paperId": "bbe29701155d01d81c528abd0f94ec5842cbc2e2", "title": "Operationalizing Digitainability: Encouraging Mindfulness to Harness the Power of Digitalization for Sustainable Development"}, {"paperId": "f0e0359086a0e405bc24d9ac2f802cd2f02fca7b", "title": "A simplified multi-model statistical approach for predicting the effects of forest management on land surface temperature in Fennoscandia"}, {"paperId": "6428dd5ba19c099766796aa20ec712f60fe41a17", "title": "Detecting Multi-Density Urban Hotspots in a Smart City: Approaches, Challenges and Applications"}, {"paperId": "23082daf12f7955e4aa4465fd02616e1e31efd32", "title": "One month in advance prediction of air temperature from Reanalysis data with eXplainable Artificial Intelligence techniques"}]}
