{"paperId": "8ce5ea27e169423bfe3187a5ab969a2e0e625385", "publicationVenue": null, "title": "Comparison of SQL and NoSQL databases with different workloads: MongoDB vs MySQL evaluation", "abstract": "One of the most important considerations when selecting a database is how relational (SQL) and non-relational (NoSQL) data structures will interact. While all options are viable, consumers should take certain distinctions into account before choosing. Since SQL databases are vertically scalable, you can typically scale server components like CPU, RAM, or SSD. NoSQL databases, on the other hand, support horizontal scaling. As a result, you can increase the capacity of your NoSQL database by fragmenting (data partitioning), or by adding extra servers. Why, then, is it still challenging to choose the instance that is most appropriate for a given application and requires the least amount of runtime? Because data that will be conveyed via the internet uses a cloud in computer networks as a metaphor. To determine which model to utilize, it is required to conduct a comparison study of SQL-oriented database engines. SQL has a form created for another side of non-productive data and is offered in the form of ordered data, but NoSQL databases are horizontally expandable. Workload management solutions are therefore also in charge of automating organizational procedures, i.e., they carry out activities without requiring manual employee attendance. For businesses trying to implement continuous delivery methods and enhance the effectiveness of customer service delivery, they are unavoidable.", "venue": "2022 International Conference on Data Analytics for Business and Industry (ICDABI)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-10-25", "journal": {"name": "2022 International Conference on Data Analytics for Business and Industry (ICDABI)", "pages": "214-218"}, "authors": [{"authorId": "2181269221", "name": "Ticiana Capris"}, {"authorId": "2206007892", "name": "Pedro Melo"}, {"authorId": "2112807", "name": "N. Garcia"}, {"authorId": "34362859", "name": "I. Pires"}, {"authorId": "2128240364", "name": "Eftim Zdravevski"}], "citations": [{"paperId": "b4a7e6dd8775ed96006d16fa520cfe268716af86", "title": "Database Management System: A Study of Increasing Impact of NoSQL Databases"}, {"paperId": "5aba967d39919634a5edd48d3df75cd53c997da5", "title": "Optimizing Software Development through Data Access Speed using Object-Relational Mapping (ORM) on Credit Risk Application"}]}
