{"paperId": "8ce572fe401ca2969c7a47758fd0fe816fa20f6a", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Smart City: A Shareable Framework and Its Applications in China", "abstract": "Smart City is a new concept that uses information and communication technology (ICT) to promote the smartification of urban construction, planning and services. Currently, a number of cities have conducted studies on smart cities, but they have mostly focused on analyzing the conceptual connotations or applications in specific domains and lack a shareable and integrated framework, which has led to significant barriers for individual smart projects. By analyzing the framework and applications of Smart City, this paper proposes a common, shareable and integrated conceptual framework. Then, based on this framework, it further proposes a unified portal platform that can balance multiple stakeholders, including the government, citizens and businesses, as well as for common, custom and other application modes. Finally, the implementation of Smart Weifang based on this platform is discussed. The applications indicate that this shareable platform can effectively eliminate the data and technological barriers between different smart city systems while also avoiding redundant financial investments. The investigation of this proposed framework and platform is highly significant for the unified construction of smart cities and the intensification of the hardware environment, thus representing a true achievement in the transition from ‘information islands’ to ‘information sharing and interconnection’ for urban informatization.", "venue": "Sustainability", "year": 2019, "fieldsOfStudy": ["Economics"], "publicationTypes": null, "publicationDate": "2019-08-12", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "2128670244", "name": "Chengming Li"}, {"authorId": "46522476", "name": "Xiaoli Liu"}, {"authorId": "48811052", "name": "Z. Dai"}, {"authorId": "47122564", "name": "Zhanjie Zhao"}], "citations": [{"paperId": "a7ea5f5dee631404455863718afed9b44ed7183c", "title": "SECURING THE SMART CITY: A REVIEW OF CYBERSECURITY CHALLENGES AND STRATEGIES"}, {"paperId": "3ac28818f89c1abe89a7ff98da2cbb89a6fa1f1b", "title": "A Review of the Theory and Practice of Smart City Construction in China"}, {"paperId": "95bd66a7ebf1c56540ce6520eeae301261d0c089", "title": "Systematic Literature Review of Smart Community Governance in China: Status, Challenges, and Opportunities"}, {"paperId": "aad91f422cba281c01cafbfc7cd8c3d4ca3ed593", "title": "SMART CITY CONCEPT: DIGITAL PLATFORM OF INVESTMENT LOCATIONS"}, {"paperId": "55769b1838e239f591429d12180bbcdd0024e2ee", "title": "ASSMA-SLM: Autonomous System for Smart Motor-Vehicles integrating Artificial and Soft Learning Mechanisms"}, {"paperId": "b6b1223c7bcb4f1e07884fafa5b869694fbf7edd", "title": "Analysis on the Development of Smart City of Big Cities in China and Its Effect to Economic Structure Based on Entropy Method"}, {"paperId": "4d680321c1f007b5bd9329f5fe7f6361d69be2d0", "title": "Legal Governance in the Smart Cities of China: Functions, Problems, and Solutions"}, {"paperId": "b90df7405ce5d757023a57f7810d63cfcbc45f0e", "title": "Smart cities and urban household carbon emissions: A perspective on smart city development policy in China"}, {"paperId": "e12ac59fcadb29545bf8390fb29bd547c69f648d", "title": "Digital Inclusive Finance Data Mining and Model-Driven Analysis of the Impact of Urban-Rural Income Gap"}, {"paperId": "3318ede3db13b9a52c543058e1f8123557d15902", "title": "State-steered smartmentality in Chinese smart urbanism"}, {"paperId": "d6a061e6e1a3ceb260ed2386cadff7a2abde412a", "title": "Exploring the factors to promote circular supply chain implementation in the smart logistics ecological chain"}, {"paperId": "cf21c06bbfb9755a07474c93a94d6e64f5797d91", "title": "Research Models and Methodologies on the Smart City: A Systematic Literature Review"}, {"paperId": "e41f8920f236e26efb8272685dc5870b191b64a0", "title": "Population mobility and sustainable development in the Mamminasata Metropolitan South Sulawesi, Indonesia"}, {"paperId": "ee5ab85b0920855d8b18918c316a3954cc12f6b2", "title": "A FRAMEWORK IN DEVELOPING A CITIZEN-CENTERED SMART CITY MOBILE APPLICATION AS A PLATFORM FOR DIGITAL PARTICIPATION IN ILOILO CITY"}, {"paperId": "f553df0181e20c6a01fc5b94c5016034367b93af", "title": "Characteristics and Problems of Smart City Development in China"}, {"paperId": "7da48f8e513fabca962e9736115f934cb94f0eca", "title": "Research on Training-mode of Intelligent Technical Talents in the Local Application-oriented University"}, {"paperId": "21c6785916d5c73e22ae08593cf957dfc36d4298", "title": "Stakeholders no contexto das smart cities"}, {"paperId": "05c864a47598198c0961811a9779d9b021ccb9af", "title": "Path Choice of Smart City Construction from the Perspective of Economic Growth"}, {"paperId": "220024131412c58a26293386c506c5e90624985c", "title": "A Bibliometric Diagnosis and Analysis about Smart Cities"}, {"paperId": "a59706bb8d9da68a78215ffab52b4743d3e493f2", "title": "Evaluation System: Evaluation of Smart City Shareable Framework and Its Applications in China"}, {"paperId": "105a5dfe1ddff48b4775eda3a1913f315bd54bba", "title": "Understanding the relationships between information architectures and business models: An empirical study on the success configurations of smart communities"}, {"paperId": "ab5c244bbe8b97e0530e89ba68de15e72f2fd8f5", "title": "Technological Drivers of Urban Innovation: A T-DNA Analysis Based on US Patent Data"}, {"paperId": "f66e00fc229415dd68339a681e12de7858a869ad", "title": "Mapping the Knowledge Domain of Smart-City Research: A Bibliometric and Scientometric Analysis"}, {"paperId": "7fd7f390d1ef1b9592e3a4ea2c1f4bcd9a276dde", "title": "Smart City Applications: A Patent Landscape Exploration"}, {"paperId": "412f2c1841580e12125334ba6b9cd0b540ca7b2b", "title": "Section 1. Demography and ethnography SEMARANG SMART CITY GOVERNANCE MODEL"}, {"paperId": "ed60c9199603d9ce2cc61195ff81de487950d425", "title": "Big-Data-Technology Talent Cultivation in the Application-oriented University: Practice and Prospects with a Case Study"}, {"paperId": "763dc0e89a0f7aac931ef2c2d263635667cc13d0", "title": "Retraction Retracted: Analysis on the Development of Smart City of Big Cities in China and Its Effect to Economic Structure Based on Entropy Method"}, {"paperId": "9f02639ade356a0ebe3cd7f2f8833d5d0e379d64", "title": "Gathering Global Intelligence for Assessing Performance of Smart, Sustainable, Resilient, and Inclusive Cities (S2RIC)"}]}
