{"paperId": "8ce7e08d6d7eba18679b0b3a3eaecc7b94718411", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Identifying Worldwide Interests in Organic Foods by Google Search Engine Data", "abstract": "Global interests in organic foods are of importance to researchers and the food industry. Traditional questionnaire-based methods do not provide a broad picture. To meet this need, worldwide interests in organic foods were studied by integrating query data from the Google search engine and deep learning methods. The results show that organic oil, organic milk, organic chicken, and organic apples are the most interested organic foods; people from Singapore, US, New Zealand, Australia, United Kingdom and Canada care about organic foods the most; consumers’ interest in organic foods has no correlation with GDP and life expectancy but has significant correlations with other dimensions of culture such as individualism, uncertainty avoidance, and long-term orientation. A recurrent neural network (RNN) model structure is useful in predicting people’s interests in major organic foods over time.", "venue": "IEEE Access", "year": 2019, "fieldsOfStudy": ["Computer Science", "Business"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-10-02", "journal": {"name": "IEEE Access", "pages": "147771-147781", "volume": "7"}, "authors": [{"authorId": "40913460", "name": "X. Liu"}, {"authorId": "2112680133", "name": "Meiying Zhong"}, {"authorId": "2185911702", "name": "Bin Li"}, {"authorId": "2109826969", "name": "Ye Su"}, {"authorId": "1815555", "name": "Jinglu Tan"}, {"authorId": "6843742", "name": "S. Gharibzahedi"}, {"authorId": "114820584", "name": "Ya Guo"}, {"authorId": "2108516816", "name": "Juan Liu"}], "citations": [{"paperId": "190ddae405597aa3221ba65045ece3b4f488fde1", "title": "Global economic crisis impact on organic food consumption in the Czech Republic"}, {"paperId": "a960f47e342fe7ff1a4abe5460947ddd2cb7e1c0", "title": "Consumer awareness and search trends for agrifood products certified with European Quality Schemes: PDO, PGI, and TSG - An analysis through Google Trends"}, {"paperId": "db1533ff4a4a4a0f6482402dadb0ad5532f3f71a", "title": "Encapsulating capacity of ultra-high-pressure homogenization (UHPH): Replacement of milk fat by vegetable oils using buttermilk as a functional ingredient in yogurt processing"}, {"paperId": "c9234bbcede46338a18300077197fb103a2bb130", "title": "Lesser mealworm (Alphitobius diaperinus L.) larvae oils extracted by pure and binary mixed organic solvents: Physicochemical and antioxidant properties, fatty acid composition, and lipid quality indices."}, {"paperId": "c06b253eabc28f20b6592eca32cec20bb7d57697", "title": "Food-grade encapsulated polyphenols: recent advances as novel additives in foodstuffs"}, {"paperId": "65e1a2bad6d9ba297955e8445dc3d194c0adef4e", "title": "Yogurts supplemented with lipid emulsions rich in omega-3 fatty acids: New insights into the fortification, microencapsulation, quality properties, and health-promoting effects"}, {"paperId": "303332a39046a30d6ecb2f6cf0e7c1247b6e45e4", "title": "Short‐term railway passenger demand forecast using improved Wasserstein generative adversarial nets and web search terms"}, {"paperId": "a52a56aecaa56d1f35ec765215ce8de8b2fb9d62", "title": "The functional modification of legume proteins by ultrasonication: A review"}, {"paperId": "df6ce9aab08161fda884cdda02e3cb61a5460588", "title": "A quick bite and instant gratification: A simulated Yelp experiment on consumer review information foraging behavior"}]}
