{"paperId": "8cecfd0a55b2b2b1d20e1104378ff1a5e5ead801", "publicationVenue": {"id": "79af09a2-54e8-4f97-8edf-9fba208ab744", "name": "International Journal of Digital Earth", "type": "journal", "alternate_names": ["Int J Digit Earth"], "issn": "1753-8947", "url": "http://www.informaworld.com/smpp/title~content=1753-8947", "alternate_urls": ["http://www.tandfonline.com/toc/tjde20/current"]}, "title": "A hierarchical indexing strategy for optimizing Apache Spark with HDFS to efficiently query big geospatial raster data", "abstract": "ABSTRACT Earth observations and model simulations are generating big multidimensional array-based raster data. However, it is difficult to efficiently query these big raster data due to the inconsistency among the geospatial raster data model, distributed physical data storage model, and the data pipeline in distributed computing frameworks. To efficiently process big geospatial data, this paper proposes a three-layer hierarchical indexing strategy to optimize Apache Spark with Hadoop Distributed File System (HDFS) from the following aspects: (1) improve I/O efficiency by adopting the chunking data structure; (2) keep the workload balance and high data locality by building the global index (k-d tree); (3) enable Spark and HDFS to natively support geospatial raster data formats (e.g., HDF4, NetCDF4, GeoTiff) by building the local index (hash table); (4) index the in-memory data to further improve geospatial data queries; (5) develop a data repartition strategy to tune the query parallelism while keeping high data locality. The above strategies are implemented by developing the customized RDDs, and evaluated by comparing the performance with that of Spark SQL and SciSpark. The proposed indexing strategy can be applied to other distributed frameworks or cloud-based computing systems to natively support big geospatial data query with high efficiency.", "venue": "International Journal of Digital Earth", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-10-04", "journal": {"name": "International Journal of Digital Earth", "pages": "410 - 428", "volume": "13"}, "authors": [{"authorId": "46183721", "name": "F. Hu"}, {"authorId": "98140935", "name": "Chaowei Yang"}, {"authorId": "2096996", "name": "Yongyao Jiang"}, {"authorId": "2117014117", "name": "Yun Li"}, {"authorId": "2118727901", "name": "Weiwei Song"}, {"authorId": "2257367", "name": "D. Duffy"}, {"authorId": "2531168", "name": "J. Schnase"}, {"authorId": "152240966", "name": "Tsengdar J. Lee"}], "citations": [{"paperId": "2d896f33b67afa0288952f24288413475561fcf5", "title": "A graph-based approach for representing addresses in geocoding"}, {"paperId": "b9b100d484b7f6fe7fc1fccd557632340d879e3d", "title": "Cloud-based backup and data recovery"}, {"paperId": "bc7b5d1d63dc896664f91a052bd529e6d8134ea1", "title": "Clustering and parallel indexing of big IoT data in the fog‐cloud computing level"}, {"paperId": "1c54c11f075429adefadc3ae04549f8d0a9b4dab", "title": "A Ceph-based storage strategy for big gridded remote sensing data"}, {"paperId": "433572fd6ce6b6a6825eff402132b2a2feba8acb", "title": "Distributed file system for rewriting Big Data files using a local-write protocol"}, {"paperId": "70987cd9b05ff4d38e427008ca01212ff1967c23", "title": "An Efficient Group-Based Replica Placement Policy for Large-Scale Geospatial 3D Raster Data on Hadoop"}, {"paperId": "83959ae1856f04ad9127caf32483bb0fc280c713", "title": "SAT-Hadoop-Processor: A Distributed Remote Sensing Big Data Processing Software for Earth Observation Applications"}, {"paperId": "6f2afa187214d266a11d189f07d93ea01bca9f94", "title": "Analysis and application of engineering data in the STEP file format"}, {"paperId": "8353935956aded5e6ba52f43200ac28d9cd65222", "title": "A Comparative Study of Indexing Techniques Effect in Big Data System Storage Optimization"}, {"paperId": "394b09194aeb6a2baf62418386e972c4417cf12e", "title": "A Roadmap Towards Big Data Opportunities, Emerging Issues and Hadoop as a Solution"}, {"paperId": "21a2cce5038424042a66df6091bd717a7c3832a3", "title": "DAPR-tree: a distributed spatial data indexing scheme with data access patterns to support Digital Earth initiatives"}, {"paperId": "19b0a431ab2aa46871c0dee6c2a09e40e9a0c137", "title": "A Survey of Big Data Analytics for Smart Forestry"}, {"paperId": "2112a5cdfeeddd4a8b2f242d25dcc48cd3d353b3", "title": "Cloud, Edge, and Mobile Computing for Smart Cities"}, {"paperId": "31606516f09837a137a44126fc20c2ffbde90e4d", "title": "High Performance Spatiotemporal Visual Analytics Technologies and Its Applications in Big Socioeconomic Data Analysis"}]}
