{"paperId": "8cf7e1737ec49026962d3e8cb400381e411c190f", "publicationVenue": null, "title": "Accelerating the Configuration Tuning of Big Data Analytics with Similarity-aware Multitask Bayesian Optimization", "abstract": "One of the key challenges for data analytics deployment is configuration tuning. The existing approaches for configuration tuning are expensive and overlook the dynamic characteristics of the analytics environment (i.e. frequent changes in workload due to receiving evolving input sizes or change in the underlying cluster environment). Such workload/environment changes can cause significant performance degradation, with retuning the configuration to accommodate those changes can yield up to 85% potential execution time saving.We propose SimTune, an approach that accommodates such changes through efficient configuration tuning. SimTune combines workload characterization and Multitask Bayesian optimization to identify similarity across workloads and accelerate finding near-optimal configurations. Our experimental results show that SimTune reduces the search time for finding close-to-optimal configurations by 56-73% (at the median) when compared to existing state-of-the-art techniques. This means that the amortization of the tuning cost happens significantly faster, enabling practical tuning in the rapidly changing environment of distributed analytics.", "venue": "2020 IEEE International Conference on Big Data (Big Data)", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-12-10", "journal": {"name": "2020 IEEE International Conference on Big Data (Big Data)", "pages": "266-275"}, "authors": [{"authorId": "34807973", "name": "Ayat Fekry"}, {"authorId": "1784243", "name": "Lucian Carata"}, {"authorId": "3176695", "name": "Thomas Pasquier"}, {"authorId": "47590914", "name": "A. Rice"}], "citations": [{"paperId": "707d67b3d1045488d775ab61d55de38c1f3ad876", "title": "ETune: Efficient configuration tuning for big-data software systems via configuration space reduction"}, {"paperId": "7fbb73f3e61ed9ab1f18d0290082729a46ca36cd", "title": "Towards a Peer-to-Peer Data Distribution Layer for Efficient and Collaborative Resource Optimization of Distributed Dataflow Applications"}, {"paperId": "0f3b97eb980a9d4f07d606d5f483055e1ca178bd", "title": "Karasu: A Collaborative Approach to Efficient Cluster Configuration for Big Data Analytics"}, {"paperId": "c21546642283a980e780897061dc198d6632e9ca", "title": "EFTuner: A Bi-Objective Configuration Parameter Auto-Tuning Method Towards Energy-Efficient Big Data Processing"}, {"paperId": "6a9bfc08af212ca74c6546e3fa57efa7a0bd8d43", "title": "Perona: Robust Infrastructure Fingerprinting for Resource-Efficient Big Data Analytics"}, {"paperId": "23a6e0bd5ef9e9deeb0b939b1521b97dc54a0707", "title": "Ruya: Memory-Aware Iterative Optimization of Cluster Configurations for Big Data Processing"}, {"paperId": "e0917b7f212261e01194b6eb6e190f1b66ce002b", "title": "ATConf: auto-tuning high dimensional configuration parameters for big data processing frameworks"}, {"paperId": "c00b4d2800e313a9b75fd6aa4ed1c3e6e3e9f909", "title": "JointConf: Jointly autotuning configuration parameters for modularized graph databases"}, {"paperId": "7d434537cce3fd903e1ba09e694895fbe3628cbc", "title": "Get Your Memory Right: The Crispy Resource Allocation Assistant for Large-Scale Data Processing"}, {"paperId": "b1f3a0a6e73da401a52cb2ce15131c1182d5ad0f", "title": "A literature review of parameter tuning within the context of big data processing frameworks"}]}
