{"paperId": "8d12a380cef7af53dc552c66db35d79f72ae6802", "publicationVenue": {"id": "b210fd3d-11d7-478e-a0aa-7e3d2a4f482d", "name": "IEEE Sensors Journal", "type": "journal", "alternate_names": ["IEEE Sens J"], "issn": "1530-437X", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=7361", "alternate_urls": ["http://ieee-sensors.org/sensors-journal/", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?puNumber=7361", "http://www.ieee-sensors.org/journals", "https://ieee-sensors.org/sensors-journal/"]}, "title": "Energy-Efficient Software-Defined Data Collection by Participatory Sensing", "abstract": "Internet of Things (IoT) has been widely used in big data applications, such as intelligent transportation, intelligent tourism, and so on. On the one hand, in order to provide better services, a lot of IoT devices are extensively installed in the city for collecting environmental data. Then, the sensors and communication modules integrated in the IoT devices will consume a lot of energy and bandwidth during data collection and transmission. On the other hand, smartphones and cars have become important parts of people's daily life, and integrate more and more sensors. Thus, the owners of smartphones and cars can be the environmental data contributors for big data applications. However, people's activities are not programmed and hard to predict, and data contribution may also cause privacy leakage. In this paper, we propose a multi-role-based participatory sensing architecture, which assigns participants to different work roles. Then, through a coordination mechanism among work roles, the application server can control the flow of data between participants or participants and application server without knowing the details of data, which can reduce the privacy leakage. Meanwhile, the data aggregators can help the application server to ensure the quality of the collected data. Then, the application server can select participants or aggregate data without collecting participants' personal information and worrying about the quality of the collected data. Furthermore, we also propose a QoI-aware, budget-fairness-based participant selection approach for multi-task participatory systems and provide a suboptimal solution to the defined optimization problem. Finally, we have compared our proposed scheme with existing methods via extensive simulations based on the data set of mobility traces of taxi cabs in Rome, Italy. Extensive simulation results well justify the effectiveness and robustness of our approach.", "venue": "IEEE Sensors Journal", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2016-05-17", "journal": {"name": "IEEE Sensors Journal", "pages": "7315-7324", "volume": "16"}, "authors": [{"authorId": "2156622606", "name": "Bo Zhang"}, {"authorId": "2148905213", "name": "Zheng Zhang"}, {"authorId": "2113994122", "name": "Ziyu Ren"}, {"authorId": "2146391959", "name": "Jian Ma"}, {"authorId": "152201638", "name": "Wendong Wang"}], "citations": [{"paperId": "3fdf06dfb304c846e52078d7c7db582eddeaa247", "title": "Service-Oriented Architecture-Guided Information Service System for Design and Implementation of Rural Tourism"}, {"paperId": "ba6ed441020152626c3cd3e781301bd8f7f84711", "title": "Rethinking the D'Hondt method"}, {"paperId": "e311eab55d98e0624e39872b91aa17a065e65822", "title": "Big Data Meet Cyber-Physical Systems: A Panoramic Survey"}, {"paperId": "a946fd00f714724793134805b631f8d2167fad76", "title": "SCAI-SVSC: Smart clothing for effective interaction with a sustainable vital sign collection"}, {"paperId": "9e3e099834f28274bce3cac8cfb12c2f1bfe14b5", "title": "Target Aucourant Data Dissemination by Collaboratory Sensing in IOT Environment"}, {"paperId": "a1a852f90d90c3c84309a8bd048465cf31ea7fc8", "title": "Enabling Cyber-Physical Communication in 5G Cellular Networks: Challenges, Solutions and Applications"}, {"paperId": "d2487ea77beb9e13a8b28c116638848d8987bd83", "title": "Maritime data technology landscape and value chain exploiting oceans of data for maritime applications"}, {"paperId": "8566f36d7917d4bd5705e1f7dff39197e2d22817", "title": "A Manufacturing Big Data Solution for Active Preventive Maintenance"}, {"paperId": "d2fed852162382ebbf358602223cb171df58dff6", "title": "Robots-Aided Participatory Crowdsourcing with Limited Task Budget"}, {"paperId": "e6cea44ede5ec59acc6eb50f76c76a90db337caf", "title": "Simultaneously aided diagnosis model for outpatient departments via healthcare big data analytics"}, {"paperId": "f7fda02fc6afabd391503b146db73df468cb5262", "title": "Mobile Participatory Sensing Systems: A Comprehensive Review"}, {"paperId": "3872eafdd6357e3779d5f075e31a8c6ed98dc648", "title": "An Optimized Clustering Communication Protocol Based on Intelligent Computing in Information-Centric Internet of Things"}, {"paperId": "356f723d25913487ee0f69c55b08381773e88e11", "title": "SDQ-6WI: Software Defined Quadcopter-Six Wheeled IoT Sensor Architecture for Future Wind Turbine Placement"}]}
