{"paperId": "8d13e821be3308ccdd5e28b8e816b78fd1cd135b", "publicationVenue": {"id": "764e3630-ddac-4c21-af4b-9d32ffef082e", "name": "IEEE International Conference on Data Engineering", "type": "conference", "alternate_names": ["ICDE", "Int Conf Data Eng", "IEEE Int Conf Data Eng", "International Conference on Data Engineering"], "url": "http://www.wikicfp.com/cfp/program?id=1331"}, "title": "Summarizing Hierarchical Multidimensional Data", "abstract": "Data scientists typically analyze and extract insights from large multidimensional data sets such as US census data, enterprise sales data, and so on. But before sophisticated machine learning and statistical methods are employed, it is useful to build and explore concise summaries of the data set. While a variety of summaries have been proposed over the years, the goal of creating a concise summary of multidimensional data that can provide worst-case accuracy guarantees has remained elusive. In this paper, we propose Tree Summaries, which attain this challenging goal over arbitrary hierarchical multidimensional data sets. Intuitively, a Tree Summary is a weighted \"embedded tree\" in the lattice that is the cross-product of the dimension hierarchies; individual data values can be efficiently estimated by looking up the weight of their unique closest ancestor in the Tree Summary. We study the problems of generating lossless as well as (given a desired worst-case accuracy guarantee a) lossy Tree Summaries. We develop a polynomial-time algorithm that constructs the optimal (i.e., most concise) Tree Summary for each of these problems; this is a surprising result given the NP-hardness of constructing a variety of other optimal summaries over multidimensional data. We complement our analytical results with an empirical evaluation of our algorithm, and demonstrate with a detailed set of experiments on real and synthetic data sets that our algorithm outperforms prior methods in terms of conciseness of summaries or accuracy of estimation.", "venue": "IEEE International Conference on Data Engineering", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-04-01", "journal": {"name": "2020 IEEE 36th International Conference on Data Engineering (ICDE)", "pages": "877-888"}, "authors": [{"authorId": "2080286891", "name": "Alexandra Kim"}, {"authorId": "1708593", "name": "L. Lakshmanan"}, {"authorId": "145860176", "name": "D. Srivastava"}], "citations": [{"paperId": "d53a0f75aa12181e49e1ddc687356655f16ed387", "title": "Summarized Causal Explanations For Aggregate Views"}, {"paperId": "82960f8f911cf144eebdbc2f8795b8f7ab564364", "title": "Explaining Dataset Changes for Semantic Data Versioning with Explain-Da-V (Technical Report)"}, {"paperId": "17d5adafa8a151d2d906abf206f380fae40fc72c", "title": "EDA4SUM: Guided Exploration of Data Summaries"}, {"paperId": "5d809ae3499f10c73eba96dc5c1bbb55a56fb1c0", "title": "Guided Exploration of Data Summaries"}, {"paperId": "b52342858596ca1613c0326553d875bc10b2aa3f", "title": "Data Summarization with Hierarchical Taxonomy"}, {"paperId": "2b4deb9e85c6898de59a4daa44124b9b3914ecb4", "title": "Putting Things into Context: Rich Explanations for Query Answers using Join Graphs"}, {"paperId": "508f6a5cebe42cdd0b876841a3858a6f4c08a478", "title": "Efficient and Optimal Algorithms for Tree Summarization With Weighted Terminologies"}, {"paperId": "be5f510ac62453c22dadcd8db0fb6ff56e6b65bf", "title": "Ontology-based Graph Visualization for Summarized View"}, {"paperId": "a090850361166f098f3b8904bac3341d9e29057a", "title": "Trends in Explanations"}, {"paperId": "9056b3c83b9036db5c43b7e2603efa8c62907a07", "title": "Trends in Explanations: Understanding and Debugging Data-driven Systems"}]}
