{"paperId": "8d2f6b044fbd097b484d959655073f917eb2d4e1", "publicationVenue": {"id": "312ca99c-9149-490d-813e-c60d5e949f65", "name": "Concurrency and Computation", "type": "journal", "alternate_names": ["Concurr Comput Pract Exp", "Concurrency and Computation: Practice and Experience", "Concurr Comput"], "issn": "1532-0626", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/77004395?CRETRY=1&SRETRY=0", "alternate_urls": ["http://www3.interscience.wiley.com/cgi-bin/jtoc?ID=77004395", "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1532-0634"]}, "title": "An efficient iterative graph data processing framework based on bulk synchronous parallel model", "abstract": "Graph data processing has been widely applied in a variety of domains such as industry, science, social network, and so on. It therefore has stimulated many efforts devoted to this area. To embrace the fast development trend of big graph data, graph data processing based on Pregel‐like systems has been regarded as one of the most promising ways and has widely attracted the attention of researchers. However, it still remains in its early stage and there still exist many challenges. In Pregel, the superstep synchronization is time consuming as the graph data iteration operation requires multiple synchronizations. Furthermore, the graph data partition strategy adopted by Pregel fails to support load balancing, therefore causing the increase of network I/O overhead as the scale of graph data grows. To address these issues, this paper presents an efficient computational framework for graph data processing based on the bulk synchronous parallel model. The global synchronization control mechanism is improved by determining the start time of the next round of superstep through counting the number of global message files. Furthermore, an improved graph data partition mechanism based on a balanced hash method is proposed to reduce the communication overhead between different partitions of sub‐graph computational tasks. We also re‐design the PageRank algorithm to verify the effectiveness of the proposed framework. Experimental results on different real‐world datasets verify the efficiency of our proposed framework as it outperforms Giraph (an open source Pregel‐like system) by 58%−69%, and achieves 10×−17× performance improvement over Hadoop.", "venue": "Concurrency and Computation", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-02-10", "journal": {"name": "Concurrency and Computation: Practice and Experience", "volume": "32"}, "authors": [{"authorId": "2152503549", "name": "Chao Liu"}, {"authorId": "2288376751", "name": "Deze Zeng"}, {"authorId": "144053269", "name": "Hong Yao"}, {"authorId": "1718175", "name": "Xuesong Yan"}, {"authorId": "40448767", "name": "Linchen Yu"}, {"authorId": "3213259", "name": "Zhangjie Fu"}], "citations": [{"paperId": "00c571ffd9e4cbeb0d3dbc7a854204cb77d8e54b", "title": "Data Processing in CPSS Platform Based on Data Mining and Cloud Edge Computing"}, {"paperId": "6fa93f3d7677db8c53569414f955b0a1871a0fa2", "title": "Real geo‐time‐based secured access computation model for e‐Health systems"}, {"paperId": "37bb9676c8701ce4f079b3402f47f3a87f2369c1", "title": "An efficient pattern-based approach for workflow supporting large-scale science: The DagOnStar experience"}, {"paperId": "20f7bfdcb02de0eb41b116ada1cbda34ef269450", "title": "Special Issue: Graph Computing"}, {"paperId": "4965b77574cb2fa350094ba3009eb3819b668903", "title": "A Free Stale Synchronous Parallel Strategy for Distributed Machine Learning"}, {"paperId": "2aae3f94454b0bf661b93683e4b1c1647d02a712", "title": "Effective Parallel Computing via a Free Stale Synchronous Parallel Strategy"}]}
