{"paperId": "8d30539b3e1ec1561f98a324000a51ddc228656c", "publicationVenue": {"id": "290335d6-cddc-465d-87f1-807e86d8efee", "name": "IEEE Geoscience and Remote Sensing Letters", "type": "journal", "alternate_names": ["IEEE Geosci Remote Sens Lett"], "issn": "1545-598X", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=8859", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=8859"]}, "title": "Research on Landslide Risk Assessment Based on Convolutional Neural Network", "abstract": "Landslide risk assessment (LRA) is of great significance to reduce the loss of landslide disaster and improve the effect of disaster prevention and reduction. At present, there are few studies on LRA, and the theories and methods need to be innovated. In view of this, convolutional neural network (CNN) is applied to LRA. Based on nine landslide hazard conditioning factors and five vulnerability conditioning factors, a CNN framework suitable for LRA (LR-CNN framework) was constructed by using the Bayesian method to optimize the CNN hyperparameters. In order to obtain more stable model and assessment results, a five-fold cross-validation method was adopted. The LR-CNN framework and the risk expression of the United Nations Department of Humanitarian Affairs (risk expression of UNDHA) method were applied to Tumen, China, and the two methods were analyzed and compared. From the rationality test results, both methods meet the rationality test standard. From the landslide risk mapping, both methods can obtain better LRA results. From the area within each risk class, the LR-CNN framework is slightly inferior to risk expression of UNDHA method, but from the perspective of landslide distribution and landslide density, the LR-CNN framework is superior to risk expression of UNDHA method. It can be seen that the application of CNN to LRA is feasible and superior to the risk expression of UNDHA method to a certain extent.", "venue": "IEEE Geoscience and Remote Sensing Letters", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Geoscience and Remote Sensing Letters", "pages": "1-5", "volume": "19"}, "authors": [{"authorId": "48569910", "name": "Xia Li"}, {"authorId": "2329866", "name": "Jiulong Cheng"}, {"authorId": "2141505864", "name": "De-Hao Yu"}], "citations": [{"paperId": "17b700d720f35b05aafa4d0411dd6191a69bbd2f", "title": "A methodological framework of landslide quantitative risk assessment in areas with incomplete historical landslide information"}]}
