{"paperId": "8d36e700a54a48d739d0e2c8187b950cb49a5f9a", "publicationVenue": {"id": "84d4bb12-5d12-44a3-871a-73ca7f2f682d", "name": "Human Systems Management", "type": "journal", "alternate_names": ["Hum Syst Manag", "Hum syst manag", "Human systems management"], "issn": "0167-2533", "url": "http://content.iospress.com/journals/human-systems-management", "alternate_urls": ["https://www.iospress.nl/journal/human-systems-management/"]}, "title": "Digital transformation in higher education: A comprehensive review of e-learning adoption", "abstract": "BACKGROUND: Data-driven practices are now crucial in the digital age for streamlining operations and boosting output across a range of industries. With e-Learning emerging as a cutting-edge and promising strategy to improve educational delivery and student engagement, higher education institutions are also adopting this trend. Despite the potential advantages, e-Learning adoption in higher education is still a developing topic with scant published research. OBJECTIVE: This study aims to conduct a thorough analysis of existing literature, seeking to determine the present status of e-Learning adoption in higher education while also identifying promising avenues for further research. METHODS: In this study, a systematic literature review methodology and a bibliometric approach are utilized to examine 63 papers sourced from the Scopus database, encompassing the years 2017 to 2021. These papers were specifically chosen due to their pertinence to e-Learning adoption in higher education institutions, following the exclusion and inclusion criteria outlined in the preferred reporting items for systematic reviews and meta-analyses (PRISMA) framework. The analysis techniques employed include descriptive overviews, citation analysis, and keyword co-occurrence. RESULTS: The systematic review of the literature revealed a significant increase in e-Learning adoption within higher education institutions (HEIs) in recent times. The findings highlighted several crucial factors influencing e-Learning adoption, including perceived ease of use, usefulness, learner attitude, self-efficacy, and facilitating conditions. However, further investigation is needed to better understand the impact of perceived learning and teaching styles on e-Learning acceptance in higher education settings. CONCLUSION: This study suggests conducting future investigations on e-Learning in developing countries, with a specific focus on intention, usage, adoption, and impact. Additionally, it emphasizes the importance of exploring the influence of learning and teaching styles on e-Learning acceptance within higher education institutions. These valuable insights will facilitate the development of effective strategies for the successful implementation of e-Learning in higher education settings.", "venue": "Human Systems Management", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2024-02-21", "journal": {"name": "Human Systems Management"}, "authors": [{"authorId": "2195043959", "name": "Shard"}, {"authorId": "2255917148", "name": "Devesh Kumar"}, {"authorId": "2181407668", "name": "Sapna Koul"}], "citations": []}
