{"paperId": "8d47325c7a51c4591865e3791c8f484144ac44d1", "publicationVenue": {"id": "3da56ce6-4a70-402c-a8b0-7dd39a3273d3", "name": "Software, Practice & Experience", "type": "journal", "alternate_names": ["Softw  Pract Exp", "Softw Pract  Exp", "Software - Practice and Experience"], "issn": "0038-0644", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/1752", "alternate_urls": ["http://www.interscience.wiley.com/jpages/0038-0644/", "https://onlinelibrary.wiley.com/journal/1097024X"]}, "title": "An efficient list‐based task scheduling algorithm for heterogeneous distributed computing environment", "abstract": "The task scheduling in heterogeneous distributed computing systems plays a crucial role in reducing the makespan and maximizing resource utilization. The diverse nature of the devices in heterogeneous distributed computing systems intensifies the complexity of scheduling the tasks. To overcome this problem, a new list‐based static task scheduling algorithm namely Deadline‐Aware‐Longest‐Path‐of‐all‐Predecessors (DA‐LPP) is being proposed in this article. In the prioritization phase of the DA‐LPP algorithm, the path length of the current task from all its predecessors at each level is computed and among them, the longest path length value is assigned as the rank of the task. This strategy emphasizes the tasks in the critical path. This well‐optimized prioritization phase leads to an observable minimization in the makespan of the applications. In the processor selection phase, the DA‐LPP algorithm implements the improved insertion‐based policy which effectively utilizes the unoccupied leftover free time slots of the processors which improve resource utilization, further least computation cost allocation approach is followed to minimize the overall computation cost of the processors and parental prioritization policy is incorporated to further reduce the scheduling length. To demonstrate the robustness of the proposed algorithm, a synthetic graph generator is used in this experiment to generate a huge variety of graphs. Apart from the synthetic graphs, real‐world application graphs like Montage, LIGO, Cybershake, and Epigenomic are also considered to grade the performance of the DA‐LPP algorithm. Experimental results of the DA‐LPP algorithm show improvement in performance in terms of scheduling length ratio, makespan reduction rate , and resource reduction rate when compared with other algorithms like DQWS, DUCO, DCO and EPRD. The results reveal that for 1000 task set with deadline equals to two times of the critical path, the scheduling length ratio of the DA‐LPP algorithm is better than DQWS by 35%, DUCO by 23%, DCO by 26 %, and EPRD by 17%.", "venue": "Software, Practice & Experience", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-10-13", "journal": {"name": "Software: Practice and Experience", "pages": "390 - 412", "volume": "53"}, "authors": [{"authorId": "2286341437", "name": "Rajarethinam Madhura"}, {"authorId": "1791477", "name": "V. R. Uthariaraj"}, {"authorId": "2286324268", "name": "Benjamin Lydia Elizabeth"}], "citations": [{"paperId": "34968e96b3355cdcca9abe12364dc71bb60f1a91", "title": "Research on network security algorithms in distributed computing environment"}, {"paperId": "1ceb1942910a3a67f2b2401dffde062c16fa4c3c", "title": "DRS: A deep reinforcement learning enhanced Kubernetes scheduler for microservice‐based system"}, {"paperId": "61958ba19af59632d6a4e0e67299913cadb505a3", "title": "Heterogeneous High-Performance System Algorithm Based on Computer Big Data Technology"}]}
