{"paperId": "8d5e58a71cbc39cad4063bd6e19ae4537de690f4", "publicationVenue": null, "title": "User Perceptions of the Security of Mobile Applications", "abstract": "With the exponential increase in the use of mobile devices across the globe, there is a concomitant need to understand how mobile users perceive the security of mobile application, and the potential risks involved in accessing and downloading them. Such an understanding will enable users to ensure the apps they download are secure and create greater awareness in the marketplace of the presence of hackers and malware used to invade the privacy and personal details of smartphones users. Research on the perception of users' mobile security is very limited and needs further investigation. This study aims to identify how mobile users perceive the security of different mobile apps and the extent to which different apps affect such perceptions. This study also investigates mobile user preferences for the places where they can access apps and their perceptions of risk at marketplaces vs. websites. This study is based on a qualitative research in which interviews were conducted with 32 university students. The study found that mobile users do not feel secure when installing mobile apps, and that concerns about hacking personal and private information are pervasive. Users expressed more security concerns regarding entertainment apps such as games and communication rather than financial apps, such as banking. The study also found that users prefer installing apps from app stores. The findings of this research contribute a greater understanding of how mobile users perceive mobile app security and offers insights that will help developers adjust their security policies to ensure users' security. The study also presents theoretical and empirical contributions, along with limitations and suggestions for further work.", "venue": "Int. J. E Serv. Mob. Appl.", "year": 2020, "fieldsOfStudy": ["Computer Science", "Business"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-10-01", "journal": {"name": "Int. J. E Serv. Mob. Appl.", "pages": "24-41", "volume": "12"}, "authors": [{"authorId": "120949403", "name": "Yasmeen Elsantil"}], "citations": [{"paperId": "0be4ad4adde7070b4d896e42662ccbad0f259a95", "title": "Expert Review on Usefulness of an Integrated Checklist-based Mobile Usability Evaluation Framework"}, {"paperId": "eabe2dddbe85af0b90e8ac2fd6b4e5b1405f38f1", "title": "Risks and Requirements in Sustainable App Development—A Review"}, {"paperId": "4fe79a05dbb8252b957325c6f1b703ec04cfc531", "title": "User's Perception on Security and Privacy in Using Crypto Currency Trading Application in India"}, {"paperId": "e45fa4dce792cbac3a7e7fb9feedcb65c1d36f1c", "title": "The Impact of Credibility Attributes on Consumer Intention to Adopt Information on Social Networking Sites: Application to Tourism Services"}, {"paperId": "f5d79b39573b45f4bde0db8005504bbd7a23c44c", "title": "Practical Approach for Apps Design in Compliance With Accessibility, Usability, and User Experience"}, {"paperId": "63c009b40b6a5ee8785d3f2c0017a1b5b4c8fc25", "title": "A Review of Internal and External Factors Underlying the Purchase of Counterfeit Products"}]}
