{"paperId": "8d6d21b67d37dbe8e75ecbf1020944404a9d5732", "publicationVenue": {"id": "335fe380-b5cc-4f2d-b91b-44d821d01227", "name": "Journal of Engineering Advancements", "type": "journal", "alternate_names": ["J Eng Adv"], "issn": "2708-6429", "url": "https://scienpg.com/jea/index.php/jea"}, "title": "Security Threats and Research Challenges of IoT-A Review", "abstract": "Internet of things (IoT) is the epitome of sustainable development. It has facilitated the development of smart systems, industrialization, and the state-of-the-art quality of life. IoT architecture is one of the essential baselines of understanding the widespread adoption. Security issues are very crucial for any technical infrastructure. Since IoT comprises heterogeneous devices, its security issues are diverse too. Various security attacks can be responsible for compromising confidentiality, integrity, and availability. In this paper, at first, the IoT architecture is described briefly. After that, the components of IoT are explained with perspective to various IoT based applications and services. Finally, various security issues, including recommended solutions, are elaborately described and the potential research challenges and future research directions.", "venue": "Journal of Engineering Advancements", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2020-12-01", "journal": {"name": "ArXiv", "volume": "abs/2101.03022"}, "authors": [{"authorId": "2285072325", "name": "Akm Bahalul Haque"}, {"authorId": "2046530774", "name": "Sonia Tasmin"}], "citations": [{"paperId": "b722889256de2fb22d7ded004cdb1c9851e103d8", "title": "The survey and meta-analysis of the attacks, transgressions, countermeasures and security aspects common to the Cloud, Edge and IoT"}, {"paperId": "1c66d16f780b07cefbed964559b6bc7cb2ca50b0", "title": "Security Threats and Research Challenges of IoT - A Review"}, {"paperId": "c81d3c7f46cae83189c55a1c2576c05bf3f9a0a8", "title": "Understanding the IOT Adoption for Home Automation in the Perspective of UTAUT2"}, {"paperId": "076554710f720c7b4c47945532e63628e23f5fd7", "title": "Technical solution to counter potential crime: Text analysis to detect fake news and disinformation"}, {"paperId": "4120d160bf2900d7ffb6cbe0a5b8399ef1183de4", "title": "Advances in Engineering and Technology An"}]}
