{"paperId": "8d82715789f921937fa3b49ca79810a67e3a135b", "publicationVenue": {"id": "6c8289bb-af7a-4fe0-9174-7850c42777a9", "name": "Journal of Alzheimer's Disease", "type": "journal", "alternate_names": ["J Alzheimer's Dis", "J Alzheimers Dis", "Journal of Alzheimers Disease"], "issn": "1387-2877", "url": "http://content.iospress.com/journals/journal-of-alzheimers-disease/", "alternate_urls": ["https://www.j-alz.com/", "http://www.j-alz.com/"]}, "title": "Can T1-Weighted Magnetic Resonance Imaging Significantly Improve Mini-Mental State Examination-Based Distinguishing Between Mild Cognitive Impairment and Early-Stage Alzheimer’s Disease?", "abstract": "Background: Detecting early-stage Alzheimer’s disease (AD) is still problematic in clinical practice. This work aimed to find T1-weighted MRI-based markers for AD and mild cognitive impairment (MCI) to improve the screening process. Objective: Our assumption was to build a screening model that would be accessible and easy to use for physicians in their daily clinical routine. Methods: The multinomial logistic regression was used to detect status: AD, MCI, and normal control (NC) combined with the Bayesian information criterion for model selection. Several T1-weighted MRI-based radiomic features were considered explanatory variables in the prediction model. Results: The best radiomic predictor was the relative brain volume. The proposed method confirmed its quality by achieving a balanced accuracy of 95.18%, AUC of 93.25%, NPV of 97.93%, and PPV of 90.48% for classifying AD versus NC for the European DTI Study on Dementia (EDSD). The comparison of the two models: with the MMSE score only as an independent variable and corrected for the relative brain value and age, shows that the addition of the T1-weighted MRI-based biomarker improves the quality of MCI detection (AUC: 67.04% versus 71.08%) while maintaining quality for AD (AUC: 93.35% versus 93.25%). Additionally, among MCI patients predicted as AD inconsistently with the original diagnosis, 60% from ADNI and 76.47% from EDSD were re-diagnosed as AD within a 48-month follow-up. It shows that our model can detect AD patients a few years earlier than a standard medical diagnosis. Conclusion: The created method is non-invasive, inexpensive, clinically accessible, and efficiently supports AD/MCI screening.", "venue": "Journal of Alzheimer's Disease", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-02-14", "journal": {"name": "Journal of Alzheimer's Disease", "pages": "941 - 957", "volume": "92"}, "authors": [{"authorId": "80294828", "name": "A. Marcisz"}, {"authorId": "49399310", "name": "J. Polańska"}], "citations": [{"paperId": "bb434e2423dd6a57a9f01c9bf667367579fbbc88", "title": "Machine Learning Approach for Improved Longitudinal Prediction of Progression from Mild Cognitive Impairment to Alzheimer’s Disease"}, {"paperId": "0869cc05dfed576c6c18e3cea3c0f9020eb64091", "title": "Fuzzy Clustering to Asses BALI and LIBRA Factors for Estimation of DTI Measures"}, {"paperId": "ea45840e3b5a8fc4d156d1c7fb6c4b3b4b6a7853", "title": "Artificial Intelligence in Neuroradiology: A Review of Current Topics and Competition Challenges"}]}
