{"paperId": "8d8912b717f1e8e08229043f752fccb32e2a2bdf", "publicationVenue": {"id": "7f03ba38-4bb4-41a3-a6d7-914c28f84272", "name": "Dependable Systems and Networks", "type": "conference", "alternate_names": ["DSN", "Dependable Syst Netw"], "url": "http://www.dsn.org/"}, "title": "General Feature Selection for Failure Prediction in Large-scale SSD Deployment", "abstract": "Solid-state drive (SSD) failures are likely to cause system-level failures leading to downtime, enabling SSD failure prediction to be critical to large-scale SSD deployment. Existing SSD failure prediction studies are mostly based on customized SSDs with proprietary monitoring metrics, which are difficult to reproduce. To support general SSD failure prediction of different drive models and vendors, this paper proposes Wear-out-updating Ensemble Feature Ranking (WEFR) to select the SMART attributes as learning features in an automated and robust manner. WEFR combines different feature ranking results and automatically generates the final feature selection based on the complexity measures and the change point detection of wear-out degrees. We evaluate our approach using a dataset of nearly 500K working SSDs at Alibaba. Our results show that the proposed approach is effective and outperforms related approaches. We have successfully applied the proposed approach to improve the reliability of cloud storage systems in production SSD-based data centers. We release our dataset for public use.", "venue": "Dependable Systems and Networks", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-06-01", "journal": {"name": "2021 51st Annual IEEE/IFIP International Conference on Dependable Systems and Networks (DSN)", "pages": "263-270"}, "authors": [{"authorId": "2006594759", "name": "Fan Xu"}, {"authorId": "49107255", "name": "Shujie Han"}, {"authorId": "33431705", "name": "P. Lee"}, {"authorId": "2153630802", "name": "Yi Liu"}, {"authorId": "2087126508", "name": "Cheng He"}, {"authorId": "120809530", "name": "Jiongzhou Liu"}], "citations": [{"paperId": "a203be1e17f891749529dd3202136f2ee89a24f5", "title": "EPBS_FIDMV: A fault injection and diagnosis methods validation benchmark for EPBS of EMU"}, {"paperId": "9fd1a0941f0ef80df90455e0dce2a5950a35d584", "title": "Detection Latencies of Anomaly Detectors: An Overlooked Perspective ?"}, {"paperId": "86b70431ac3e4679000b23b49199609653112149", "title": "Hard disk failure prediction based on improved WOA-BP"}, {"paperId": "3ddbc634d720406cfe639bbf6c5c3df47d867bc1", "title": "Equipment anomaly detection method under cloud-edge collaboration model based bi-directional long short-term memory and variational autoencoder"}, {"paperId": "4c0fc221142a607e6afd0cca98c18705390ce709", "title": "A locally weighted multi-domain collaborative adaptation for failure prediction in SSDs"}, {"paperId": "8fbb990f4d71fb21d7777f9b565e3c77fd9864a1", "title": "Towards Learned Predictability of Storage Systems"}, {"paperId": "2aee96809ae25e7f3f3e9f76b60c533994475dda", "title": "StreamDFP: A General Stream Mining Framework for Adaptive Disk Failure Prediction"}, {"paperId": "31f2073b2b32969e7dcaa509d0ac9788a47aac9a", "title": "A One-Class Anomaly Detection Method for Drives based on Adversarial Auto-Encoder"}, {"paperId": "9888d9685a917bde010d0723f0fbc925b00625c2", "title": "A Disk Failure Prediction Method Based on Active Semi-supervised Learning"}, {"paperId": "ed7d5ccbc3f46937cd850366fa9df29b6309990e", "title": "SSD Failure Prediction Based on Classification Models and Data Engineering"}, {"paperId": "6c14f4f2efb8d081f4119b1a982e476c811716d6", "title": "Improving disk failure detection accuracy via data augmentation"}, {"paperId": "35d13a1a51e2915d317c299fa34c108296e078d6", "title": "A survey on AI for storage"}, {"paperId": "17024d1c0a2249d38a6903ef3db5a36d1436d1b7", "title": "Multi-Instance Adversarial Learning Domain Adaptation Network for Failure Prediction of Unlabeled Solid-State Drives"}]}
