{"paperId": "8d95c8ada3bc53718c841c40be8a5a978ee54c4c", "publicationVenue": {"id": "e2acdbdd-8665-4181-be7e-b7d710482fe5", "name": "International Journal of Cloud Applications and Computing", "type": "journal", "alternate_names": ["Int J Cloud Appl Comput"], "issn": "2156-1834", "url": "http://www.igi-global.com/ijcac"}, "title": "Cost Effective Approaches for Content Placement in Cloud CDN Using Dynamic Content Delivery Model", "abstract": "Cloud providers give storage access and efficient content placement and delivery services to content providers by optimizing cloud-based content delivery. The cost-efficient model should not only consider the content delivery cost but also the storage cost associated with the cloud network. In this article, a novel cloud-based content delivery model is proposed that uses shared storage models for cost optimization in content delivery. Shared storages are placed in different areas of the content delivery network and an efficient replica placement strategy is employed using optimization techniques. Different content delivery schemes are used in proposed model for different situations and overall content delivery cost is optimized. Experimental results show better performance and lesser cost in terms of storage, traffic and latency and also satisfy Quality-of-Service (QoS) and Quality-of-Experience (QoE) in content delivery using PSO when compared to ACO and GA.", "venue": "International Journal of Cloud Applications and Computing", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-07-01", "journal": {"name": "Int. J. Cloud Appl. Comput.", "pages": "78-117", "volume": "8"}, "authors": [{"authorId": "2287667075", "name": "S. Sajitha"}, {"authorId": "2071886926", "name": "Hari Krishnan Ramachandran"}, {"authorId": "32796566", "name": "Sai Saketh"}, {"authorId": "2287646858", "name": "Prasenjit Kumar Patra"}, {"authorId": "2287832199", "name": "Harshpreet Singh"}, {"authorId": "2287799063", "name": "Rajwinder Singh"}, {"authorId": "2287760823", "name": "Saptarshi Das"}], "citations": [{"paperId": "3a1b942507231d8df82668fca7977c2dd45ff879", "title": "Direct push–pull or assisted push–pull? Toward optimal video content delivery using shared storage-based cloud CDN (SS-CCDN)"}, {"paperId": "4dc99f0b4c82b1903b172ab9802eb8e3e2e4334f", "title": "Design of a Novel Architecture for Cost-Effective Cloud-based Content Delivery Network"}]}
