{"paperId": "8d9e5424b27f45e0cbf007d9ca97f3c310aa353a", "publicationVenue": {"id": "443b907e-306a-41c3-bca4-b35f1da4bb38", "name": "International Conference on Cloud Computing Technologies and Applications", "type": "conference", "alternate_names": ["Cloudtech", "Int Conf Cloud Comput Technol Appl"]}, "title": "A New Classification for Data Placement Techniques in Cloud Computing", "abstract": "The efficient management of data placement in cloud computing is of paramount importance, as it fundamentally influences the performance, cost-effectiveness, and execution time of workflows, including the seamless movement of data across diverse data centers. This paper contributes significantly to the global scientific community by introducing a novel classification framework for data placement techniques in the realm of cloud computing. This classification system categorizes these techniques based on their unique approaches to optimizing data placement, thus enhancing system performance. Furthermore, this work offers a valuable overview of existing data placement algorithms found in the extensive literature. This overview serves as a valuable resource for researchers and practitioners, facilitating a comprehensive comparison of the various algorithms in terms of their properties and objectives. Such insights can inform better decision-making in the selection of data placement strategies. In conclusion, this paper not only sheds light on the critical role of data placement in cloud computing but also addresses pertinent open issues in this domain. Its contributions are poised to shape the future of cloud computing research and practice. It is our hope that this work will inspire further research endeavors and pave the way for innovative solutions to the evolving challenges in data placement within cloud computing environments.", "venue": "International Conference on Cloud Computing Technologies and Applications", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference", "Review"], "publicationDate": "2023-11-21", "journal": {"name": "2023 IEEE 6th International Conference on Cloud Computing and Artificial Intelligence: Technologies and Applications (CloudTech)", "pages": "1-9"}, "authors": [{"authorId": "1490680802", "name": "L. Bouhouch"}, {"authorId": "3386300", "name": "M. Zbakh"}, {"authorId": "49481182", "name": "C. Tadonki"}], "citations": []}
