{"paperId": "8db04e894158bb2f0fe154b7dc567f9f4843240d", "publicationVenue": null, "title": "Exploring a landslide inventory created by automated web data mining: the case of Italy", "abstract": null, "venue": "Landslides", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-01-19", "journal": {"name": "Landslides", "pages": "841 - 853", "volume": "19"}, "authors": [{"authorId": "1518023001", "name": "Rachele Franceschini"}, {"authorId": "2274106", "name": "A. Rosi"}, {"authorId": "38237427", "name": "F. Catani"}, {"authorId": "46388108", "name": "N. Casagli"}], "citations": [{"paperId": "210c2c576cb7aa34712cc1d6ec3eb3a6d1f364f5", "title": "Uncertainties of landslide susceptibility prediction: influences of different study area scales and mapping unit scales"}, {"paperId": "1f1ecaee5e3ad9bf1458e73d8e53b93ca176645e", "title": "The impact of hydrogeological events on firms: Evidence from Italy"}, {"paperId": "d7be0a7b1d5d4c9cf52caa191e19d8f4826b963b", "title": "Perancangan Aplikasi Inventory E-Canteen Berbasis Web Service"}, {"paperId": "68b865c6fa9934fd475bd21ae5aa8f6e220d3f4c", "title": "Event-based rainfall-induced landslide inventories and rainfall thresholds for Malawi"}, {"paperId": "c4be704669e92f30ac6a021126be608430311b92", "title": "Spatiotemporal deformation characteristics of Outang landslide and identification of triggering factors using data mining"}, {"paperId": "7c2004f2b2eb2d0e891fb37c66c083f9555d09a7", "title": "Exploring the Potential of Text Mining for Automated Information Analysis"}, {"paperId": "15a195cb03c4b8deb47c83afa99a83f4a7ac2732", "title": "Tracking a Decade of Hydrogeological Emergencies in Italian Municipalities"}, {"paperId": "d2a2eaa273e2b2c1cc84e899e7dd61d8282e5541", "title": "Analysis of spatial and temporal characteristics of major natural disasters in China from 2008 to 2021 based on mining news database"}, {"paperId": "99a149b1287f01fa7e4481aba50e8f0ee247ffaa", "title": "The ITAlian rainfall-induced LandslIdes CAtalogue, an extensive and accurate spatio-temporal catalogue of rainfall-induced landslides in Italy"}, {"paperId": "ff7e2223cc41f9e58cd5d030a19a6d67170b674f", "title": "Investigation on the spatial distribution of landslides in Sichuan Province, southwest China"}, {"paperId": "4b3b903ed11820b474e3ccce11f3ed2dbd10b662", "title": "Emergency management through information crowdsourcing"}, {"paperId": "20f2110610e0c70d76e778ce4d2d0f932a196925", "title": "Towards landslide space-time forecasting through machine learning: the influence of rainfall parameters and model setting"}, {"paperId": "13be0ed37ef0867db477aa833d81f563676050c2", "title": "A Focused Event Crawler with Temporal Intent"}, {"paperId": "23126a0f5641f06429a8d8286f116989e0eafe2a", "title": "Spatial patterns of shallow landslides induced by the 19 September 2017 Puebla-Morelos earthquake, Mexico"}, {"paperId": "4147eebcc03b4514af7e4d145fe5dfdebc2d65ed", "title": "How can landslide risk maps be validated? Potential solutions with open-source databases"}, {"paperId": "1115f493cf3dce7a670407284df1b21d6e8148ce", "title": "Integrating multiple information sources for landslide hazard assessment: the case of Italy"}, {"paperId": "961aaf7aad26c39ae7dec793ecfdf007fde63485", "title": "Using Sentinel-1 radar amplitude time series to constrain the timings of individual landslides: a step towards understanding the controls on monsoon-triggered landsliding"}, {"paperId": "36c8ca239f871696a2705e0cb118b29dd5a1cb6f", "title": "PEMANFAATAN SISTEM INFORMASI GEOGRAFIS BERBASIS WEB DALAM MENINGKATKAN AKURASI INFORMASI TERKAIT REKAM JEJAK SUMUR MINYAK DAN GAS BUMI DI PULAU MADURA"}, {"paperId": "dbc7bce9c6a1af39453faaa78d9feed05acc717c", "title": "Media Content Mining Based on Artificial Intelligence and Network Interaction"}, {"paperId": "cbf6decaa9052e0c264f9218eb55f8d21f953656", "title": "A Near-Real-Time Global Landslide Incident Reporting Tool Demonstrator Using Social Media and Artificial Intelligence"}, {"paperId": "97c3410dd15f39e03e89f334457d8dd2f3d27d73", "title": "Machine Learning for Defining the Probability of Sentinel-1 Based Deformation Trend Changes Occurrence"}, {"paperId": "b63c88a9bba6ed073351954032fc0db7330e1202", "title": "ITALICA, an extensive and accurate spatio-temporal catalogue of rainfall-induced landslides in Italy"}, {"paperId": "6732777ae3e5cc6fa1e6dc0408a977d801304400", "title": "LoRa Based Metrics Evaluation for Real-Time Landslide Monitoring On IoT Platform"}]}
