{"paperId": "8db7702f204c24e371136c2d7e1e59fed8a50d52", "publicationVenue": {"id": "47c47088-7640-441b-85ba-375fe8f5c3a4", "name": "International Conference on Computing Communication and Networking Technologies", "type": "conference", "alternate_names": ["Int Conf Comput Commun Netw Technol", "International Conference on Computing, Communication and Networking Technologies", "ICCCNT"]}, "title": "TOTEM : Token for controlled computation: Integrating Blockchain with Big Data", "abstract": "Conventional methods for data analysis demands data be moved across networks for analysis. Along with it being highly network intensive, data owners are also reluctant to provide their data due to security and privacy breaches. In order to overcome these issues, we proposed TOTEM: Token for controlled computation, that combines both blockchain technologies and big data systems. The objective is to allow computation to be taken to the data, rather than moving the data to the computation. A third-party user uses the TOTEM SDK to create a MapReduce code for computation, which will be executed within the data owner's environment. This computational system prevents the execution of any malicious functions in the user code, by putting constraints on computational operations. A pre-defined totem will be assigned to authorised users, based on their computational needs. A smart contract performs pre-checks on user-submitted code and associated totem value, by using a totem estimator to determine the required totem for executing the given code. A Totem manager and updater is introduced to coordinate computation of user code until it exits gracefully, or the assigned totem gets exhausted. The TOTEM project ensures data security by allowing organisations to open their data centers and allow disruptive business models.", "venue": "International Conference on Computing Communication and Networking Technologies", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-07-01", "journal": {"name": "2019 10th International Conference on Computing, Communication and Networking Technologies (ICCCNT)", "pages": "1-7"}, "authors": [{"authorId": "73143857", "name": "Dhanya Therese Jose"}, {"authorId": "39510587", "name": "Antorweep Chakravorty"}, {"authorId": "8791444", "name": "Chunming Rong"}], "citations": [{"paperId": "bc48e2fd9576b0bf619f5caf74d3daacf838bca6", "title": "Blockchain-based Cross-organizational Workflow Platform"}, {"paperId": "cdb626e75fcb1fed9f998886ca332df7495c6acd", "title": "Flexible Fine-grained Data Access Management for Hyperledger Fabric"}, {"paperId": "2c644c844a68ae2734267773746474909e8b8a19", "title": "Integrating big data and blockchain to manage energy smart grid - TOTEM framework"}, {"paperId": "6fea597ec5ea069d12d8b2390ae696043a3f02bf", "title": "DID-eFed: Facilitating Federated Learning as a Service with Decentralized Identities"}, {"paperId": "e7cff98c8b632dbd53a6ff19375552afecdab680", "title": "REVIEW OF FSCM WITH BLOCKCHAIN AND BIG DATA INTEGRATION"}, {"paperId": "f18982f0c7ac33e23c325de96299a5d0b2c5bc6a", "title": "Distributed computational framework in TOTEM architecture enabled by blockchain"}]}
