{"paperId": "8dc1327712f6cb77df4c8ea823fc93b042036ce4", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Combining Unsupervised Approaches for Near Real-Time Network Traffic Anomaly Detection", "abstract": "The 0-day attack is a cyber-attack based on vulnerabilities that have not yet been published. The detection of anomalous traffic generated by such attacks is vital, as it can represent a critical problem, both in a technical and economic sense, for a smart enterprise as for any system largely dependent on technology. To predict this kind of attack, one solution can be to use unsupervised machine learning approaches, as they guarantee the detection of anomalies regardless of their prior knowledge. It is also essential to identify the anomalous and unknown behaviors that occur within a network in near real-time. Three different approaches have been proposed and benchmarked in exactly the same condition: Deep Autoencoding with GMM and Isolation Forest, Deep Autoencoder with Isolation Forest, and Memory Augmented Deep Autoencoder with Isolation Forest. These approaches are thus the result of combining different unsupervised algorithms. The results show that the addition of the Isolation Forest improves the accuracy values and increases the inference time, although this increase does not represent a relevant problematic factor. This paper also explains the features that the various models consider most important for classifying an event as an attack using the explainable artificial intelligence methodology called Shapley Additive Explanations (SHAP). Experiments were conducted on KDD99, NSL-KDD, and CIC-IDS2017 datasets.", "venue": "Applied Sciences", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-02-08", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "2153996195", "name": "Francesco Carrera"}, {"authorId": "68978125", "name": "V. Dentamaro"}, {"authorId": "2125481532", "name": "Stefano Galantucci"}, {"authorId": "2153750304", "name": "Andrea Iannacone"}, {"authorId": "2624156", "name": "D. Impedovo"}, {"authorId": "1800607", "name": "G. Pirlo"}], "citations": [{"paperId": "d8f1aea081d21257ba7b95e76ec27afd863275e7", "title": "SAKMR: Industrial control anomaly detection based on semi-supervised hybrid deep learning"}, {"paperId": "d958a81b199234ba8dbedd0bd018bdc6769f87c3", "title": "Improving Network Traffic Anomaly Detection through Data Denoising and Unsupervised Learning"}, {"paperId": "61fe43ae213a91febb0fbb1fa707783c66d07e54", "title": "A Critical Overview of Industrial Internet of Things Security and Privacy Issues Using a Layer-Based Hacking Scenario"}, {"paperId": "95d4adc7609b1d07fe460f02e8114afd62992a23", "title": "BOOSTING ALGORİTMALARI KULLANARAK SALDIRI TESPİT SİSTEMLERİ SINIFLANDIRMADA AÇIKLANABİLİR YAPAY ZEKA UYGULAMASI"}, {"paperId": "010d940496e80537f62eb473d742fa737016054f", "title": "A Network Traffic Abnormal Detection Method: Sketch-Based Profile Evolution"}, {"paperId": "17268e1a2ddbcc9ddf07184e264fdcde81c076bd", "title": "Real-Time Packet-Based Intrusion Detection on Edge Devices"}, {"paperId": "c1b7cd9a21bc6747f30f126f5c689ba1fd0cf325", "title": "Detecting anomalies and de-noising monitoring data from sensors: A smart data approach"}, {"paperId": "99dafc698b7510ff2916c1464e0195737aff48ed", "title": "Efficient, Lightweight Cyber Intrusion Detection System for IoT Ecosystems Using MI2G Algorithm"}, {"paperId": "eb15803e1b6c5bb91f149d949b95e5e1780f43e1", "title": "Automatic Traffic Anomaly Detection on the Road Network with Spatial-Temporal Graph Neural Network Representation Learning"}, {"paperId": "57f80fb15184f732f6503f1e2bbddbed69ddeeb7", "title": "IoT Intrusion Detection Using Machine Learning with a Novel High Performing Feature Selection Method"}, {"paperId": "7921789407583c207937720a762489d4c8029333", "title": "Extraction of Time-Domain Characteristics and Selection of Effective Features Using Correlation Analysis to Increase the Accuracy of Petroleum Fluid Monitoring Systems"}, {"paperId": "ded91bde98d5066865b99790af7276cb84455e21", "title": "A Federated Learning System with Biometric Medical Image Authentication for Alzheimer's Diagnosis"}, {"paperId": "8d886c8b4630fa6b6946e55d3576d474e2bb0888", "title": "Handwriting Detection Test (HWDT): Android Application for the Recognition of Neurodegenerative Diseases"}, {"paperId": "7b652d06727c0025b1e940fd5027545206fab980", "title": "Human Activity Recognition for Identifying Bullying and Cyberbullying: A Comparative Analysis Between Users Under and over 18 Years Old"}, {"paperId": "23e9768050ec61916041cc142b1f071c0a0ece74", "title": "A Hierarchical Approach for Improved Anomaly Detection in Video Surveillance"}, {"paperId": "b9080fb415bd69081ee6dfb5f513eb5ae4022650", "title": "Next Activity Prediction: An Application of Shallow Learning Techniques Against Deep Learning Over the BPI Challenge 2020"}, {"paperId": "4544076e9df174cb90bb28f43598bb39c70b0305", "title": "Handwriting Task-Selection based on the Analysis of Patterns in Classification Results on Alzheimer Dataset"}, {"paperId": "c4b2e05a069ab91a2c622faee15c5ea5ac9dfe11", "title": "Multi-Type Feature Extraction and Early Fusion Framework for SMS Spam Detection"}]}
