{"paperId": "8dc8ce191a565f665f2319b024baac9a7cbe521f", "publicationVenue": {"id": "7c9d091e-015e-4e5d-a11f-9bc369fcf414", "name": "IEEE Transactions on Parallel and Distributed Systems", "type": "journal", "alternate_names": ["IEEE Trans Parallel Distrib Syst"], "issn": "1045-9219", "url": "http://www.computer.org/tpds", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=71"]}, "title": "An Efficient Hybrid I/O Caching Architecture Using Heterogeneous SSDs", "abstract": "Storage subsystem is considered as the performance bottleneck of computer systems in data-intensive applications. Solid-State Drives (SSDs) are emerging storage devices which unlike Hard Disk Drives (HDDs), do not have mechanical parts and therefore, have superior performance compared to HDDs. Due to the high cost of SSDs, entirely replacing HDDs with SSDs is not economically justified. Additionally, SSDs can endure a limited number of writes before failing. To mitigate the shortcomings of SSDs while taking advantage of their high performance, SSD caching is practiced in both academia and industry. Previously proposed caching architectures have only focused on either performance or endurance and neglected to address both parameters in suggested architectures. Moreover, the cost, reliability, and power consumption of such architectures is not evaluated. This paper proposes a hybrid I/O caching architecture that while offers higher performance than previous studies, it also improves power consumption with a similar budget. The proposed architecture uses DRAM, Read-Optimized SSD (RO-SSD), and Write-Optimized SSD (WO-SSD) in a three-level cache hierarchy and tries to efficiently redirect read requests to either DRAM or RO-SSD while sending writes to WO-SSD. To provide high reliability, dirty pages are written to at least two devices which removes any single point of failure. The power consumption is also managed by reducing the number of accesses issued to SSDs. The proposed architecture reconfigures itself between performance- and endurance-optimized policies based on the workload characteristics to maintain an effective tradeoff between performance and endurance. We have implemented the proposed architecture on a server equipped with industrial SSDs and HDDs. The experimental results show that as compared to state-of-the-art studies, the proposed architecture improves performance and power consumption by an average of 8 and 28 percent, respectively, and reduces the cost by 5 percent while increasing the endurance cost by 4.7 percent and negligible reliability penalty.", "venue": "IEEE Transactions on Parallel and Distributed Systems", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-12-10", "journal": {"name": "IEEE Transactions on Parallel and Distributed Systems", "pages": "1238-1250", "volume": "30"}, "authors": [{"authorId": "2894539", "name": "Reza Salkhordeh"}, {"authorId": "2077408116", "name": "Mostafa Hadizadeh"}, {"authorId": "144394335", "name": "H. Asadi"}], "citations": [{"paperId": "4ef0a7257bba4413709abe66771902efac337897", "title": "An Enterprise-Grade Open-Source Data Reduction Architecture for All-Flash Storage Systems"}, {"paperId": "e305657709d755127dc95b655bfd59465a65d31f", "title": "CoPA: Cold Page Awakening to Overcome Retention Failures in STT-MRAM Based I/O Buffers"}, {"paperId": "e1e14fc15dd52b411886bdcf173e9bd7d6e04ab8", "title": "RC-RNN: Reconfigurable Cache Architecture for Storage Systems Using Recurrent Neural Networks"}, {"paperId": "275fd6a0f7b37a00947506c66849acac3d673f75", "title": "ETICA: Efficient Two-Level I/O Caching Architecture for Virtualized Platforms"}, {"paperId": "bdd35c0c96398144f2ac402b09ded4e56398bf07", "title": "HeuristicDB: a hybrid storage database system using a non-volatile memory block device"}, {"paperId": null, "title": "2020 Index IEEE Transactions on Parallel and Distributed Systems Vol. 31"}, {"paperId": "e62f23a6474a2dea29d4497767de0fc38c26ab37", "title": "A Modeling Framework for Reliability of Erasure Codes in SSD Arrays"}, {"paperId": "fc6955ef2530d59f20ce7ea40148beeb6d1766a1", "title": "STAIR: High Reliable STT-MRAM Aware Multi-Level I/O Cache Architecture by Adaptive ECC Allocation"}, {"paperId": "3aedc5997c36befdbecd4b225588e7f404638b45", "title": "LBICA: A Load Balancer for I/O Cache Architectures"}, {"paperId": "35c90418e6b44496541d4512028651ec39d1767c", "title": "Survey of Memory Management Techniques for HPC and Cloud Computing"}]}
