{"paperId": "8dccc035d440fae48e469c8baba8d2bd2918eab2", "publicationVenue": {"id": "20a3a2f3-532a-4f04-9f3d-1e268e100872", "name": "International Journal of Advanced Computer Science and Applications", "type": "journal", "alternate_names": ["Int J Adv Comput Sci Appl"], "issn": "2156-5570", "url": "http://sites.google.com/site/ijacsa2010/", "alternate_urls": ["http://thesai.org/Publication/Default.aspx", "https://thesai.org/Publications/IJACSA"]}, "title": "Analysis of Big Data Storage Tools for Data Lakes based on Apache Hadoop Platform", "abstract": "When developing large data processing systems, the question of data storage arises. One of the modern tools for solving this problem is the so-called data lakes. Many implementations of data lakes use Apache Hadoop as a basic platform. Hadoop does not have a default data storage format, which leads to the task of choosing a data format when designing a data processing system. To solve this problem, it is necessary to proceed from the results of the assessment according to several criteria. In turn, experimental evaluation does not always give a complete understanding of the possibilities for working with a particular data storage format. In this case, it is necessary to study the features of the format, its internal structure, recommendations for use, etc. The article describes the features of both widely used data storage formats and the currently gaining popularity. Keywords—Big data formats; data lakes; Apache Hadoop; data warehouses", "venue": "International Journal of Advanced Computer Science and Applications", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": {"name": "International Journal of Advanced Computer Science and Applications"}, "authors": [{"authorId": "35188328", "name": "V. Belov"}, {"authorId": "2228832", "name": "E. Nikulchev"}], "citations": [{"paperId": "81dd30876a76548a1e42a8a3332efc0b12fd4468", "title": "Analysis of Optimization Strategies for Big Data Storage Management: A Study"}, {"paperId": "8802e7ed7ff24334d9ef1492f9497b63b27352a5", "title": "LST-Bench: Benchmarking Log-Structured Tables in the Cloud"}, {"paperId": "7e8e2143ccff91127f4578c265ab6115ee984fdc", "title": "A Big Data Methodology for Analyzing Machine Energy Consumption Based on IIoT Technology under ESG Concept"}]}
