{"paperId": "8ddcbb5084b73097b2d605fdc23a0d38dba4a942", "publicationVenue": null, "title": "Knowledge Discovery Web Service for Spatial Data Infrastructures", "abstract": "The size, volume, variety, and velocity of geospatial data collected by geo-sensors, people, and organizations are increasing rapidly. Spatial Data Infrastructures (SDIs) are ongoing to facilitate the sharing of stored data in a distributed and homogeneous environment. Extracting high-level information and knowledge from such datasets to support decision making undoubtedly requires a relatively sophisticated methodology to achieve the desired results. A variety of spatial data mining techniques have been developed to extract knowledge from spatial data, which work well on centralized systems. However, applying them to distributed data in SDI to extract knowledge has remained a challenge. This paper proposes a creative solution, based on distributed computing and geospatial web service technologies for knowledge extraction in an SDI environment. The proposed approach is called Knowledge Discovery Web Service (KDWS), which can be used as a layer on top of SDIs to provide spatial data users and decision makers with the possibility of extracting knowledge from massive heterogeneous spatial data in SDIs. By proposing and testing a system architecture for KDWS, this study contributes to perform spatial data mining techniques as a service-oriented framework on top of SDIs for knowledge discovery. We implemented and tested spatial clustering, classification, and association rule mining in an interoperable environment. In addition to interface implementation, a prototype web-based system was designed for extracting knowledge from real geodemographic data in the city of Tehran. The proposed solution allows a dynamic, easier, and much faster procedure to extract knowledge from spatial data.", "venue": "ISPRS Int. J. Geo Inf.", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-12-31", "journal": {"name": "ISPRS Int. J. Geo Inf.", "pages": "12", "volume": "10"}, "authors": [{"authorId": "97946235", "name": "M. Omidipoor"}, {"authorId": "1811072", "name": "A. Toomanian"}, {"authorId": "3129040", "name": "N. Samany"}, {"authorId": "3182886", "name": "A. Mansourian"}], "citations": [{"paperId": "90beecbe3c7098ede8e5aab01a016c41f5bfacf9", "title": "Web service discovery: Rationale, challenges, and solution directions"}, {"paperId": "de8fcdb55d2a3736d5c68a4378bdf4e7869a8b78", "title": "Privacy protection based distributed clustering with deep learning algorithm for distributed data mining"}, {"paperId": "aa3f7db73e44a81f042347004d16cc75d39cc424", "title": "A semantically aware user interface design for gis applications through cloud based microservices"}, {"paperId": "7d8c9ae92759df220d7d0ad6cb0d84fc95de85c8", "title": "Seismic vulnerability assessment of urban buildings using the rough set theory and weighted linear combination"}, {"paperId": "b080dbc93cad02a15fb7135544c209362c8d705b", "title": "Detection of safe areas in flood as emergency evacuation stations using modified particle swarm optimization with local search"}, {"paperId": "e3052256965e24dff4409de3ea52eb294dfae4fe", "title": "The most places at risk surrounding the COVID-19 treatment hospitals in an urban environment- case study: Tehran city"}, {"paperId": "e072aca955022f04206be7851ab9da2b1ecf2b02", "title": "Subsurface Topographic Modeling Using Geospatial and Data Driven Algorithm"}]}
