{"paperId": "8ddf27c5b64da2a43593d08703607f3d262e9023", "publicationVenue": {"id": "1ec5a55c-414e-4f79-b7dc-48e1dba3618e", "name": "IEEE Region 10 Conference", "type": "conference", "alternate_names": ["TENCON", "Digit Process Appl", "Digital Processing Applications", "IEEE Reg 10 Conf"]}, "title": "A Privacy-Preserving Approach for Big Data Mining Using RainForest with Federated Learning", "abstract": "Federated Learning (FL) in Machine Learning (ML) has become very popular nowadays because it trains classifiers across multiple decentralized devices without transferring data to a central server. It is a decentralized learning approach that amalgamates several different nodes into one. In 2016, Google introduced the concept of FL when the use and misuse of personal data were gaining global attention. In this paper, we have proposed a privacy-preserving approach for mining big personalized data employing scalable decision tree induction with FL. The concept of the RainForest framework refers to addressing big data challenges via a Decision Tree (DT) classifier. The proposed method does not share the data or personal information with the central server. It only transfers the local models' parameter values to the central server. Each individual device or node trains its own local DT classifier and shares the prior and conditional probability values with the central server. We have tried to simulate the proposed concept using five benchmark datasets. The results of the evaluation indicate that the model exhibits exceptional performance and accuracy.", "venue": "IEEE Region 10 Conference", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-10-31", "journal": {"name": "TENCON 2023 - 2023 IEEE Region 10 Conference (TENCON)", "pages": "59-64"}, "authors": [{"authorId": "2218333685", "name": "Dipu Saha"}, {"authorId": "2218711981", "name": "Mainul Karim"}, {"authorId": "10732674", "name": "Suriya Phongmoo"}, {"authorId": "1771095", "name": "D. Farid"}], "citations": []}
