{"paperId": "8de3c021e88b6413fc3741c9dc9b0adcd9489e54", "publicationVenue": {"id": "be267cb9-6411-4126-8b64-4847025171ee", "name": "Conference on Computer Communications Workshops", "type": "conference", "alternate_names": ["INFOCOM WKSHPS", "Conf Comput Commun Work"]}, "title": "Latency and Reliability Oriented Collaborative Optimization for Multi-UAV Aided Mobile Edge Computing System", "abstract": "Intelligent emergency rescue equipment increasingly plays an important emergency rescue, which can greatly enhance the capability and efficiency of the rescue activities. In this paper, we construct a multi-UAV enabled latency and reliability guaranteed mobile edge computing framework (LR-UMEN) to provide on-demand computing services, where both the latency and the reliability are considered. Moreover, being different from the existing work about the latency and reliability, we propose a joint optimization of communications, computing and caching to decrease the latency as well as enhance the reliability relying on the novel definition of ‘expected latency’, which effectively benchmarks the characteristic of both the latency and reliability considered. Finally, a hybrid binary particle swarm optimization (HBPSO) algorithm is conceived for solving the non-convex optimization problem, followed by a range of simulations.", "venue": "Conference on Computer Communications Workshops", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-07-01", "journal": {"name": "IEEE INFOCOM 2020 - IEEE Conference on Computer Communications Workshops (INFOCOM WKSHPS)", "pages": "150-156"}, "authors": [{"authorId": "50821781", "name": "Xiangwang Hou"}, {"authorId": "145932639", "name": "Zhiyuan Ren"}, {"authorId": "1519283536", "name": "Jingjing Wang"}, {"authorId": "114213127", "name": "Shuya Zheng"}, {"authorId": "49723609", "name": "Hailin Zhang"}], "citations": [{"paperId": "488cfab0de1cea2b1c8cd400a0391669f00075a0", "title": "Reliability and QoS Aware Intelligent UAV Communication with Throughput Maximization in Wireless Networks"}, {"paperId": "01c8f86a76e8b2495200f968233f5a764dd31f93", "title": "Performance Analysis for Subgraph Isomorphism Based Embedding Service Function Chains"}, {"paperId": "1be1aac6805e3e95e3a3c2464db7e555be1f4a99", "title": "Aerial Edge Computing: A Survey"}, {"paperId": "118541fc6530f289d3eaeba44c6899ff60839f1d", "title": "A Survey of Faults and Fault-Injection Techniques in Edge Computing Systems"}, {"paperId": "5ef0e813fa4e6dce8a96f4b07027c53f3dd3812c", "title": "ITS: Improved Tabu Search Algorithm for Path Planning in UAV-Assisted Edge Computing Systems"}, {"paperId": "cba9df14a14c098a13988fcda6e958664455fa70", "title": "Fault Tolerant Edge Computing: Challenges and Opportunities"}, {"paperId": "1c28cc10b06611d9ecf68e54856b920f9ca5b5d4", "title": "Joint 3-D Position Deployment and Traffic Offloading for Caching and Computing-Enabled UAV Under Asymmetric Information"}, {"paperId": "2fc13470c93576d1eb423f1ef9b67c9351671f0c", "title": "Reliability Theory and Practice for Unmanned Aerial Vehicles"}, {"paperId": "139da0a7281143f4121f545390fe6ef41a4fb1e5", "title": "On the Modeling of Reliability in Extreme Edge Computing Systems"}, {"paperId": "eafc5d12a83bf43a42b79c6da7a0fe75010b16d8", "title": "Multi-UAV Cooperative Assisted RSU Data Acquisition Strategy considering Coverage Quality"}, {"paperId": "fba167c782567eea229a2a5820b2e0720bcd5191", "title": "Edge Intelligence for Mission-Critical 6G Services in Space-Air-Ground Integrated Networks"}, {"paperId": "f2b3c09649b63e382f883fc68042deefc498ffd8", "title": "Towards Energy-Efficient Scheduling of UAV and Base Station Hybrid Enabled Mobile Edge Computing"}, {"paperId": "5bdef3206eeda1dbf11f72fe9dfde759fbe5928b", "title": "Multi-UAVs cooperative task assignment and path planning scheme"}, {"paperId": "b486115c8cd44fc8e1a43e80584cf1c5621c6db5", "title": "A Baseline Assessment Method of UAV Swarm Resilience Based on Complex Networks*"}]}
