{"paperId": "8dfdccad58caaed09d2732111f5a968957d5dce5", "publicationVenue": null, "title": "How Big Data in Health 4.0 Helps Prevent the Spread of Tuberculosis", "abstract": "Internet development has initiated an industry 4.0 evolution, where the production process can be arranged virtually and connected with large data services. The use of big data in all fields now also impacts on the health sector better known as health 4.0. This study analyzes the use of big data in the era of industry 4.0 in the health domain with the aim of knowing how much the benefits of big data technology and health 4.0 can help prevent the spread of infectious diseases. In this study, we took papers online and conducted an analogous review process. The results of the paper that we reviewed further provided us with an overview and proposal for a scheme for monitoring infectious diseases such as TB by utilizing big data. And open new opportunities to understand public health and the prevention of infectious diseases in the health era 4.0.", "venue": "2019 2nd International Conference on Bioinformatics, Biotechnology and Biomedical Engineering (BioMIC) - Bioinformatics and Biomedical Engineering", "year": 2019, "fieldsOfStudy": ["Business"], "publicationTypes": ["Conference", "Review"], "publicationDate": "2019-09-01", "journal": {"name": "2019 2nd International Conference on Bioinformatics, Biotechnology and Biomedical Engineering (BioMIC) - Bioinformatics and Biomedical Engineering", "pages": "1-6", "volume": "1"}, "authors": [{"authorId": "2082286322", "name": "Dhana Sudana"}, {"authorId": "9140749", "name": "A. Emanuel"}], "citations": [{"paperId": "872c356614dd1152d036835778d3505f23ef1edb", "title": "Effects of Lean Interventions Supported by Digital Technologies on Healthcare Services: A Systematic Review"}, {"paperId": "2be15f29b36e9e5eab90d3580ec054b72fb5d4f8", "title": "Big Data for Healthcare Industry 4.0: Applications, challenges and future perspectives"}, {"paperId": "3958ab160d19c070a06d2fb0c54a43275d31671e", "title": "Applications of Technological Solutions in Primary Ways of Preventing Transmission of Respiratory Infectious Diseases—A Systematic Literature Review"}, {"paperId": "9e8f3ccaf908cdbef44d64bfbc518fed209083a5", "title": "Putting Health 4.0 at the service of Society 5.0: Exploratory insights from a pilot study"}, {"paperId": "3a52b8094cae991627119b66fc33a56b95eebf8d", "title": "Secure Patient Data Transfer Using Information Embedding and Hyperchaos"}, {"paperId": "862f05647e53b06e5d3f6692e2248e0628dcb8f3", "title": "Tendencias y desarrollo de las tecnologías de la Industria 4.0 en el sector de la salud"}, {"paperId": "669a74b0689e5c1ffafffc475d89119fadf12b5d", "title": "Sensors and Systems for Physical Rehabilitation and Health Monitoring—A Review"}, {"paperId": "16de62812cf657eb5782fc560dac50ce4973116e", "title": "Monitoring of Vital Signs in the Home Environment: A Review of Current Technologies and Solutions"}, {"paperId": "4e0aee2a14614ad92cd9d9c198e8f47676ee645a", "title": "Sensors for Health Monitoring"}]}
