{"paperId": "8e00277d353b59e90190344c5c64a7e4b1ad8d2d", "publicationVenue": {"id": "9cc701cf-1f49-4121-8ea9-11bac24d61ad", "name": "IEEE Transactions on Big Data", "type": "journal", "alternate_names": ["IEEE Trans Big Data"], "issn": "2332-7790", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=6687317", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6687317", "https://ieeexplore.ieee.org/xpl/aboutJournal.jsp?punumber=6687317"]}, "title": "Privacy-Preserving Aggregation in Federated Learning: A Survey", "abstract": "Over the recent years, with the increasing adoption of Federated Learning (FL) algorithms and growing concerns over personal data privacy, Privacy-Preserving Federated Learning (PPFL) has attracted tremendous attention from both academia and industry. Practical PPFL typically allows multiple participants to individually train their machine learning models, which are then aggregated to construct a global model in a privacy-preserving manner. As such, Privacy-Preserving Aggregation (PPAgg) as the key protocol in PPFL has received substantial research interest. This survey aims to fill the gap between a large number of studies on PPFL, where PPAgg is adopted to provide a privacy guarantee, and the lack of a comprehensive survey on the PPAgg protocols applied in FL systems. In this survey, we review the PPAgg protocols proposed to address privacy and security issues in FL systems. The focus is placed on the construction of PPAgg protocols with an extensive analysis of the advantages and disadvantages of these selected PPAgg protocols and solutions. Additionally, we discuss the open-source FL frameworks that support PPAgg. Finally, we highlight important challenges and future research directions for applying PPAgg to FL systems and the combination of PPAgg with other technologies for further security improvement.", "venue": "IEEE Transactions on Big Data", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-03-31", "journal": {"name": "ArXiv", "volume": "abs/2203.17005"}, "authors": [{"authorId": "2117941651", "name": "Ziyao Liu"}, {"authorId": "31458322", "name": "Jiale Guo"}, {"authorId": "2120802457", "name": "Wenzhuo Yang"}, {"authorId": "2151839519", "name": "Jiani Fan"}, {"authorId": "49535103", "name": "Kwok-Yan Lam"}, {"authorId": "2145805930", "name": "Jun Zhao"}], "citations": [{"paperId": "d4e9db1048e37add4ef194b5531d4366e2d80383", "title": "Threats, Attacks, and Defenses in Machine Unlearning: A Survey"}, {"paperId": "464e2e1dc785927c882a0b0f2bcc4d4f82fc38f2", "title": "Privacy preserving and secure robust federated learning: A survey"}, {"paperId": "3ba7810f54a0d658a3b53252066d064faaa0fd86", "title": "Differential privacy preserved federated learning for prognostic modeling in COVID-19 patients using large multi-institutional chest CT dataset."}, {"paperId": "858d60dcb97c6d7938e24050508c69f55e5f2161", "title": "Device Scheduling and Assignment in Hierarchical Federated Learning for Internet of Things"}, {"paperId": "9158b61f7b97bd520a5c9ddd95f9199cf2f9edb5", "title": "Towards Efficient and Certified Recovery from Poisoning Attacks in Federated Learning"}, {"paperId": "d470b07ae85e67b689ba2cbc0be3104f543036b5", "title": "Harnessing the Power of Federated Learning in Federated Contextual Bandits"}, {"paperId": "eb57487a463fdab75952a637a3c581075754e1a1", "title": "Privacy-Preserving Cross-Silo Federated Learning Atop Blockchain for IoT"}, {"paperId": "88c107a502415ac2977396e1cda1e7b17e6b45cc", "title": "AHSecAgg and TSKG: Lightweight Secure Aggregation for Federated Learning Without Compromise"}, {"paperId": "145661c7061dfcc957309c2f40a53670b6675587", "title": "Towards Efficient Secure Aggregation in FL: Partial Vector Freezing for Cost Compression"}, {"paperId": "75c71251149947a5e3d9ac2e42b3dff466af4ab0", "title": "Hide Your Model: A Parameter Transmission-free Federated Recommender System"}, {"paperId": "7e04f3dcb95b0c9bb2a635224976ee1d19154584", "title": "EdgeSA: Secure Aggregation for Privacy-Preserving Federated Learning in Edge Computing"}, {"paperId": "2346defec98067fe7102abdf985066c2f123b7c0", "title": "A Survey on Federated Unlearning: Challenges, Methods, and Future Directions"}, {"paperId": "eafa0d7da36816f1a29fc258fe79c9c417f991b3", "title": "The Capacity Region of Information Theoretic Secure Aggregation with Uncoded Groupwise Keys"}, {"paperId": "72a544d93720204d0c0539fe3ab9032755f00bc7", "title": "User Assignment and Resource Allocation for Hierarchical Federated Learning over Wireless Networks"}, {"paperId": "ee0a002aafc366a65e93bc4a5b3f5a840a6c7e94", "title": "Differential privacy preserved federated transfer learning for multi-institutional 68Ga-PET image artefact detection and disentanglement"}, {"paperId": "7febaeb3abf38bc02e662dcd2a582b639065effd", "title": "Fast Secure Aggregation With High Dropout Resilience for Federated Learning"}, {"paperId": "eb3dfc62b10b370a1dbe63a9c7079780dbd062f3", "title": "Privacy Enhanced Federated Learning via Privacy Masks and Additive Homomorphic Encryption"}, {"paperId": "abaae675989dbf951a520a81f733134451388c55", "title": "A verifiable and privacy-preserving blockchain-based federated learning approach"}, {"paperId": "3a5149834ae2cd6baab4126a585a1547e086bd4b", "title": "A Review of Privacy-Preserving Federated Learning, Deep Learning, and Machine Learning IIoT and IoTs Solutions"}, {"paperId": "e0a7de219b4621495b91f98dd2bd588279e899ac", "title": "Towards Open Federated Learning Platforms: Survey and Vision from Technical and Legal Perspectives"}, {"paperId": "c167677b38490e58f313c96204b23dee091f4381", "title": "Edge Learning for 6G-Enabled Internet of Things: A Comprehensive Survey of Vulnerabilities, Datasets, and Defenses"}, {"paperId": "f1b8bd9a3862a88c6004ca3da7310c4c3968e053", "title": "Fairness and Privacy-Preserving in Federated Learning: A Survey"}, {"paperId": "2d6613d0dd0dda6bfd65f7dd2a8669d9c549744e", "title": "A Survey on Federated Learning Poisoning Attacks and Defenses"}, {"paperId": "a0e40d9a07fdc5848ef2f10d9b63f5c28e0cec03", "title": "Trustworthy Federated Learning: A Survey"}, {"paperId": "9e002ff246b1817740c8de53730a29d35cd4986a", "title": "Reviewing Federated Learning Aggregation Algorithms; Strategies, Contributions, Limitations and Future Perspectives"}, {"paperId": "96b577d42d8abed888d5694e24a94ec17c861ea9", "title": "FedVS: Straggler-Resilient and Privacy-Preserving Vertical Federated Learning for Split Models"}, {"paperId": "fc94022f93ecfbcb8d0270e80d0d407b2e7fdfaf", "title": "Protecting Private Information for Two Classes of Aggregated Database Queries"}, {"paperId": "a2824a98cc43083fb830bd3b4c844e2c4ef5c74e", "title": "Marvel DC: A Blockchain-Based Decentralized and Incentive-Compatible Distributed Computing Protocol"}, {"paperId": "2a299a5a6350686dee9d9969427e092c1983f6f3", "title": "SafeNet: The Unreasonable Effectiveness of Ensembles in Private Collaborative Learning"}, {"paperId": "29d8037bb87dc186e8ca40d83e7f6307f830978a", "title": "SRFL: A Secure & Robust Federated Learning framework for IoT with trusted execution environments"}, {"paperId": "a9796704ea39b4d267aae937be29f6dd14519219", "title": "Long-Term Privacy-Preserving Aggregation With User-Dynamics for Federated Learning"}, {"paperId": "6f8573cdc8ec096356c3afe95526f265dce91b8d", "title": "Federated Learning Based Privacy Ensured Sensor Communication in IoT Networks: A Taxonomy, Threats and Attacks"}, {"paperId": "2161d95e6fe33a09848efeb6280d8a85b89e20ce", "title": "Efficient Verifiable Protocol for Privacy-Preserving Aggregation in Federated Learning"}, {"paperId": "caaecea1ed7a7eeb3bedcbbd4933233e137d91fc", "title": "Implementing Privacy-Preserving and Collaborative Industrial Artificial Intelligence"}, {"paperId": "18c478f3608b00185e5bbb0296f35edf5d130085", "title": "SafeNet: Mitigating Data Poisoning Attacks on Private Machine Learning"}, {"paperId": "a0d6cb8016fa91be0cf03988f92d9379bfa91948", "title": "MicroSecAgg: Streamlined Single-Server Secure Aggregation"}]}
