{"paperId": "8e00bcb56194f72d6d9d1d58d0902d0e15032297", "publicationVenue": null, "title": "TEA-bot: a thermography enabled autonomous robot for detecting thermal leaks of HVAC systems in ceilings", "abstract": "We propose TEA-bot (Thermography Enabled Autonomous Robot) to address the problem of labor-intensive manual inspections of thermal leaks in Heating Ventilation and Air Conditioning (HVAC) systems while avoiding installation of sensor networks, which can be challenging and expensive for existing buildings. TEA-bot is an Unmanned Ground Vehicle (UGV) designed to navigate in ceilings using visual-based Simultaneously Localization And Mapping (SLAM) while detecting thermal leaks from HVAC systems using Convolutional Neural Networks (CNN). TEA-bot uses inexpensive 3D printed parts as the bones, a single-board computer (SBC) as the brain, an RGB-D camera as the eyes, and a thermal camera as the leak detector. We build an in-lab ceiling environment as a true-to-size testing site with five types of common leaks in HVAC systems (e.g., improper connection) to test the feasibility and effectiveness of TEA-bot. Results show that TEA-bot can 1) generate high-resolution ceiling maps in the format of point clouds for existing buildings without Building Information Models (BIMs), with an average error of 1.56 inches in duct length measurements; 2) identify leak types with a precision of 86.60% using the thermal camera images; and 3) register leaks onto the point cloud maps, providing a holistic and intuitive view of leak locations in an unknown ceiling environment.", "venue": "BuildSys@SenSys", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2022-11-09", "journal": {"name": "Proceedings of the 9th ACM International Conference on Systems for Energy-Efficient Buildings, Cities, and Transportation"}, "authors": [{"authorId": "2181159932", "name": "Weijia Cai"}, {"authorId": "2142320764", "name": "Le Zhang"}, {"authorId": "2109140237", "name": "Lei Huang"}, {"authorId": "1471262577", "name": "Xinran Yu"}, {"authorId": "66185937", "name": "Zhengbo Zou"}], "citations": [{"paperId": "3f352644481cc85832470799f9b07b00b70eadac", "title": "Self-Optimization of Robot Design for Navigating in Ceiling Systems"}, {"paperId": "523de012c78b326534525dd56b8a983fb2056f37", "title": "Robot morphology evolution for automated HVAC system inspections using graph heuristic search and reinforcement learning"}]}
