{"paperId": "8e10b199058bdaa54598da61cbbdf8c0c91957f9", "publicationVenue": null, "title": "Understanding Community-Level Conflicts Through Reddit r/place", "abstract": "Conflicts between communities in social-networking sites can degrade quality of communication and discourage participation, so understanding conflict dynamics can aid community management. However, studying inter-community conflict is challenging due to the open-ended nature of communication between communities. We study r/place, a 3-day pseudo-experiment on Reddit that provides an opportunity to observe inter-community conflict in a zero-sum environment. We quantify conflicts on r/place, identifying users and communities involved. We find that conflicts on r/place involve multiple communities on both the winning and losing side, and that communities get involved in conflicts due to geographic proximity on the canvas and due to existing political or cultural conflicts. Examining conflict winners reveals that total number of users is more important than highly-active users. Our results have implications for mitigating negative inter-community conflict on social-networking sites.", "venue": "CSCW Companion", "year": 2020, "fieldsOfStudy": ["Computer Science", "Sociology"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2020-10-17", "journal": {"name": "Companion Publication of the 2020 Conference on Computer Supported Cooperative Work and Social Computing"}, "authors": [{"authorId": "134608112", "name": "Prateek Vachher"}, {"authorId": "51915733", "name": "Zachary Levonian"}, {"authorId": "10391344", "name": "H. Cheng"}, {"authorId": "1744803", "name": "S. Yarosh"}], "citations": [{"paperId": "228edb554ad728df2804856f40f0fd9715b94b05", "title": "With Flying Colors: Predicting Community Success in Large-scale Collaborative Campaigns"}, {"paperId": "4fb55eef05b32d384561c741015bde64850940d1", "title": "A Black Mirror of Bright Ideas: Could Media Educate towards Positive Creativity?"}, {"paperId": "d9533fabe2a5244066fa97c0d822f60ed60b5211", "title": "This Must Be the Place: Predicting Engagement of Online Communities in a Large-scale Distributed Campaign"}]}
