{"paperId": "8e1ad45fc1bc098a33468fd4981223457af080f7", "publicationVenue": null, "title": "A comparative study on online machine learning techniques for network traffic streams analysis", "abstract": null, "venue": "Comput. Networks", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-02-01", "journal": {"name": "Comput. Networks", "pages": "108836", "volume": "207"}, "authors": [{"authorId": "143730558", "name": "A. Shahraki"}, {"authorId": "2055548438", "name": "Mahmoud Abbasi"}, {"authorId": "2848485", "name": "Amirhosein Taherkordi"}, {"authorId": "9483953", "name": "A. Jurcut"}], "citations": [{"paperId": "85ff9bdb48cac992c4bad81ccda2d7efab6511c3", "title": "Liquid Neural Network-based Adaptive Learning vs. Incremental Learning for Link Load Prediction amid Concept Drift due to Network Failures"}, {"paperId": "87d52255308e2c719640bf9580e8a9e8a0f78090", "title": "Online performance and proactive maintenance assessment of data driven prediction models"}, {"paperId": "ecca1d5ff8590c964b212f3dcc6af0fa29983ff7", "title": "A Survey on Consumer IoT Traffic: Security and Privacy"}, {"paperId": "9468b2608a8da305ebaec060f5e790a9450aa7cc", "title": "自适应增强的动态网络流量主动异常检测"}, {"paperId": "813ce6438ebc52c90daa2a6b78447b78c5df1abf", "title": "Method for the Identification and Classification of Zones with Vehicular Congestion"}, {"paperId": "c11f4f50cb7c3be07d1ea5b89684655344c01f3d", "title": "A network security situation assessment method based on fusion model"}, {"paperId": "abdb00cdc13170303832787962c86c7ca45206f1", "title": "Ensemble adaptive online machine learning in data stream: a case study in cyber intrusion detection system"}, {"paperId": "6890ae202a31d45464722076adbaf0a2ca088560", "title": "Rarity updated ensemble with oversampling: An ensemble approach to classification of imbalanced data streams"}, {"paperId": "8e26a29e94861e27d56a0afc6fa890da88651cd7", "title": "Transfer and online learning for IP maliciousness prediction in a concept drift scenario"}, {"paperId": "2ecde21d3d17383dcd826d954f18dabcbad65eed", "title": "A Sketch Framework for Fast, Accurate and Fine-Grained Analysis of Application Traffic"}, {"paperId": "4a4023eecf6137f64924af4d35b4c39cc03df11d", "title": "Strategies for Optimizing Time Series Visual Data Exploration"}, {"paperId": "e950f511a0aa37291012dfb209370d61ef08122f", "title": "SABeDM: a sliding adaptive beta distribution model for concept drift detection in a dynamic environment"}, {"paperId": "8fe7c19cbb209322e5027013631625ed8e2a807c", "title": "Resource Efficient Intrusion Detection Systems for Internet of Things Using Online Machine-Learning Models"}, {"paperId": "0c943e6dcc90a015723fbd17aebd6d6a41fedde6", "title": "Differentially Private Distributed Online Convex Optimization Towards Low Regret and Communication Cost"}, {"paperId": "d6acfc15fe2e0329282a02198de15a812f394013", "title": "Enhancing Security for Online Transactions through Supervised Machine Learning and Block Chain Technology in Credit Card Fraud Detection"}, {"paperId": "4d0c3ffce46607b06f9f56548f18564f98cb8155", "title": "A multi-manifold learning based instance weighting and under-sampling for imbalanced data classification problems"}, {"paperId": "be41b6f5e625cbe2c24a2205c9f4ca3691d6728a", "title": "Explorando internet de las cosas basado en ESP8266: herramientas y caso de estudio"}, {"paperId": "73ee54db5462e1948a663a1362ac96d5ca0721c9", "title": "DeepMetricCorr: Fast flow correlation for data center networks with deep metric learning"}, {"paperId": "03621b85fdfa0c4d76496deabf951b24b8bbeaae", "title": "Streaming via SDN: Resource forecasting for video streaming in a Software-Defined Network"}, {"paperId": "5e584ef35397bbe88057cc3c4f1306ea75e936bf", "title": "Performance Characterization of Multi-Container Deployment Schemes for Online Learning Inference"}, {"paperId": "e3d62ac1977bfe355c8d0e2f0ad0f3332a15ccc5", "title": "Encrypted DNS Traffic Analysis for Service Intention Inferring"}, {"paperId": "a47161b684d3befb103be727cbc3c979d7a5cb28", "title": "A Profit-Aware Adaptive Approach for In-Network Traffic Classification"}, {"paperId": "1075acd70a329dbe906f4f8a36f673ce7a5994be", "title": "A Comparative Study of Continual, Lifelong, and Online Supervised Learning Libraries"}, {"paperId": "b6ceabc75a2afd39ddaf9ae067af2f19b71c5994", "title": "Managing Cold-start in The Serverless Cloud with Temporal Convolutional Networks"}, {"paperId": "8313d84ed455e7fdf67186e2e897953f503931e3", "title": "A Robust Deep Learning-based Approach for Network Traffic Classification using CNNs and RNNs"}, {"paperId": "1ce7b4cd4f838df0b19c5bd2c7b3425a668147a9", "title": "Univariate machine learning models applied in photovoltaic power prediction using Python"}, {"paperId": "3809d308b61d8b605c0afc0a0504513f53da4320", "title": "IP traffic behavior characterization via semantic mining"}, {"paperId": "30f9163e748baa6c3d3399b951bfaa4ca4b1f7b9", "title": "Critical-Threat-Alert Detection using Online Machine Learning"}, {"paperId": "1b61538a1417321e3754d3e0c4fa6a0d24c5d106", "title": "Design of Intrusion Detection System based on Cyborg intelligence for security of Cloud Network Traffic of Smart Cities"}, {"paperId": "32851eb0d96b41b38b2e8de5f24d64e08e5acc9e", "title": "DFAID: Density-aware and feature-deviated active intrusion detection over network traffic streams"}, {"paperId": "2c9896868d8ea4d725d147151a696fdd6210666b", "title": "A Comparative Study of Situation Awareness-Based Decision-Making Model Reinforcement Learning Adaptive Automation in Evolving Conditions"}, {"paperId": "2a7d8d9886d97e9dda5193046dac5272b7e916fa", "title": "Machine Learning-Powered Encrypted Network Traffic Analysis: A Comprehensive Survey"}, {"paperId": "aa1db552af782953588f3cc5aa7ff2d678de78cf", "title": "Security in the Internet of Things Application Layer: Requirements, Threats, and Solutions"}]}
