{"paperId": "8e1d9a5a43abbcbb7997dd4ed31c229ebb16b8b0", "publicationVenue": {"id": "cbd94920-595d-438f-9d0b-17193b8fab85", "name": "Journal of Information Technology in Construction", "type": "journal", "alternate_names": ["J Inf Technol Constr"], "issn": "1874-4753", "url": "https://www.itcon.org/"}, "title": "Challenges faced by the adoption of big data in the Dominican Republic construction industry: an empirical study", "abstract": "The adoption of Big Data (BD) in the construction industry has been identified as a possible solution to the demand of the current needs of projects, but the integration of this technology has proven to be a challenge specially in industries such as construction that are not technological driven. The understanding of the key elements for the BD adoption has become the focus of many industries that seek to exploit the benefits offered by this technology. Therefore, this paper aims to explore the challenges faced by the adoption of BD in the Dominican Republic (DR) construction industry. To identify these challenges qualitative research was undertaken due to the paucity of scientific data. Twenty-one individuals representing 19 companies who have great impact in the DR construction sector were interviewed. From the analysis six main challenges were identified. They are: lack BD awareness, high cost of investment, resistance to change, lack of government support and regulation, lack of technological expertise, and security concerns of BD. The challenges identified in this study, will serve to help companies better plan their technology adoption process, mainly considering aspects such as the need to tackle the lack of awareness by disseminating and promoting the concept of BD which will not only generate a better understanding of technology by making sure that present and future professionals understand the technology and its benefits. This study provides insight in the challenges to overcome for a successful adoption of BD technology, which would help companies to prepare for a future adoption.", "venue": "Journal of Information Technology in Construction", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-11-04", "journal": {"name": "J. Inf. Technol. Constr.", "pages": "812-831", "volume": "26"}, "authors": [{"authorId": "66889948", "name": "Paola Reyes Veras"}, {"authorId": "66968893", "name": "S. Renukappa"}, {"authorId": "145465560", "name": "S. Suresh"}], "citations": [{"paperId": "e751e5f26d5fd09e29ea225522b8995e8021c5b1", "title": "The challenges of adopting emerging technologies in the AEC industry a literature review and bibliometric analysis"}, {"paperId": "e0792176b61ff1057729264b5e84313fbe536e97", "title": "Digital technologies in the AEC sector: a comparative study of digital competence among industry practitioners"}, {"paperId": "f241d76797d6a255c74129a58658dca54ec020d0", "title": "Mapping the Barriers of Big Data Process in Construction: The Perspective of Construction Professionals"}, {"paperId": "44ac605074d8c2480a82489e5ad6b461cdf936b1", "title": "A multivariate regression analysis of barriers to digital technologies adoption in the construction industry"}, {"paperId": "ef3207a3715fe9011c4a4331db400b7eb0c341e1", "title": "Transformative role of big data through enabling capability recognition in construction"}, {"paperId": "ba9da721bbb0af670ca61b9d0616268fa38a6871", "title": "SPECIAL ISSUE EDITORIAL: CONSTRUCTION 4.0: ESTABLISHED AND EMERGING DIGITAL TECHNOLOGIES WITHIN THE CONSTRUCTION INDUSTRY"}]}
