{"paperId": "8e251194669cd54d5d2cc296b6cafb1203dfba0b", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "DONAPI: Malicious NPM Packages Detector using Behavior Sequence Knowledge Mapping", "abstract": "With the growing popularity of modularity in software development comes the rise of package managers and language ecosystems. Among them, npm stands out as the most extensive package manager, hosting more than 2 million third-party open-source packages that greatly simplify the process of building code. However, this openness also brings security risks, as evidenced by numerous package poisoning incidents. In this paper, we synchronize a local package cache containing more than 3.4 million packages in near real-time to give us access to more package code details. Further, we perform manual inspection and API call sequence analysis on packages collected from public datasets and security reports to build a hierarchical classification framework and behavioral knowledge base covering different sensitive behaviors. In addition, we propose the DONAPI, an automatic malicious npm packages detector that combines static and dynamic analysis. It makes preliminary judgments on the degree of maliciousness of packages by code reconstruction techniques and static analysis, extracts dynamic API call sequences to confirm and identify obfuscated content that static analysis can not handle alone, and finally tags malicious software packages based on the constructed behavior knowledge base. To date, we have identified and manually confirmed 325 malicious samples and discovered 2 unusual API calls and 246 API call sequences that have not appeared in known samples.", "venue": "arXiv.org", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-03-13", "journal": {"name": "ArXiv", "volume": "abs/2403.08334"}, "authors": [{"authorId": "2291031235", "name": "Cheng Huang"}, {"authorId": "2291075174", "name": "Nannan Wang"}, {"authorId": "2326425", "name": "Ziteng Wang"}, {"authorId": "2291085515", "name": "Siqi Sun"}, {"authorId": "2289912636", "name": "Lingzi Li"}, {"authorId": "2291080514", "name": "Junren Chen"}, {"authorId": "2287531385", "name": "Qianchong Zhao"}, {"authorId": "2291074413", "name": "Jiaxuan Han"}, {"authorId": "2291122188", "name": "Zhen Yang"}, {"authorId": "2291030693", "name": "Lei Shi Sichuan University"}, {"authorId": "2291065906", "name": "Huawei Technologies"}], "citations": []}
