{"paperId": "8e33066b368c85ab8c3bb68b1c51867a0561cd0d", "publicationVenue": {"id": "4ab1e1bf-98e8-4e0c-a53a-7a00e37e44e2", "name": "The International Archives of the Photogrammetry, Remote Sensing and Spatial Information Sciences", "type": "journal", "alternate_names": ["Int Arch Photogramm Remote Sens Spat Inf Sci"], "issn": "1682-1750", "url": "https://www.isprs.org/publications/archives.aspx"}, "title": "DENDROGRAM CLUSTERING FOR 3D DATA ANALYTICS IN SMART CITY", "abstract": "Abstract. Smart city is a connection of physical and social infrastructure together with the information technology to leverage the collective intelligence of the city. Cities will build huge data centres. These data are collected from sensors, social media, and legacy data sources. In order to be smart, cities needs data analysis to identify infrastructure that needs to be improved, city planning and predictive analysis for citizen safety and security. However, no matter how much smart city focus on the updated technology, data do not organize themselves in a database. Such tasks require a sophisticated database structure to produce informative data output. Furthermore, increasing number of smart cities and generated data from smart cities contributes to current phenomenon called big data. These large and complex data collections would be difficult to process using regular database management tools or traditional data processing applications. There are multiple challenges for big data, including visualization, mining, analysis, capture, storage, search, and sharing. Efficient data analysis mechanisms are necessary to search and extract valuable patterns and knowledge through the big data of smart cities. In this paper, we present a technique of three-dimensional data analytics using dendrogram clustering approach. Data will be organized using this technique and several output and analyses are carried out to proof the efficiency of the structure for three – dimensional data analytics in smart city.\n", "venue": "The International Archives of the Photogrammetry, Remote Sensing and Spatial Information Sciences", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2018-10-30", "journal": {"name": "The International Archives of the Photogrammetry, Remote Sensing and Spatial Information Sciences"}, "authors": [{"authorId": "35236792", "name": "S. Azri"}, {"authorId": "3096117", "name": "U. Ujang"}, {"authorId": "2148758968", "name": "Alias Abdul Rahman"}], "citations": [{"paperId": "b294d3747a72e6209ea838e2a3f5debca93474e7", "title": "INFLUENCE OF DIFFERENT WIND ANGLES ON PEDESTRIAN WIND COMFORT IN 3D SPACE"}, {"paperId": "c2fbd3be5b34550a9b555bf4e267ae4e54130155", "title": "Investigating the influence of 3D building models on pedestrian wind comfort through wind computational fluid dynamics analysis"}, {"paperId": "c4116d3fe3bd925fce1fc23ee12b5f1d397d3a76", "title": "Current uses of topology in 3D GIS: An overview"}, {"paperId": "258074abfb727858fc83e37f27077716e0a500fd", "title": "VOXELIZATION TECHNIQUES: DATA SEGMENTATION AND DATA MODELLING FOR 3D BUILDING MODELS"}, {"paperId": "dd01af95a06e2a4fb53bdd98d4fee29390d108ee", "title": "MANAGING INDOOR MOVABLE ASSETS IN 3D USING CITYGML FOR SMART CITY APPLICATIONS"}, {"paperId": "c9f0b8b260fe82ec55b76a073d9faf3d6351e0b4", "title": "Computational Fluid Dynamics of Wind Flow and Air Pollution Modelling: A Review on 3D Building Model Standards"}, {"paperId": "112ff84a4a954fa7f55835c1a677ba633b85f6c2", "title": "Clustering for smart cities in the internet of things: a review"}, {"paperId": "4291cdccb1ca3f8dc9339a362d1a5bb6ab2997ca", "title": "MODELLING IMMOVABLE ASSET IN 3D USING CITYGML 3.0 CONCEPT TO SUPPORT SMART CITY INITIATIVES"}, {"paperId": "81633be965fce130e084031000316c4629f66650", "title": "3D TOPOLOGICAL SUPPORT IN SPATIAL DATABASES: AN OVERVIEW"}, {"paperId": "1847f575859fcf104bcf33f8f34edc2fd0cb4b8f", "title": "CONCEPTUAL MODEL OF 3D ASSET MANAGEMENT BASED ON MYSPATA TO SUPPORT SMART CITY APPLICATION IN MALAYSIA"}, {"paperId": "89b5154f39585ef69f5f1f2d3dff61eb8f457696", "title": "EXPLORATORY STUDY OF 3D POINT CLOUD TRIANGULATION FOR SMART CITY MODELLING AND VISUALIZATION"}, {"paperId": "20a2b659a4d52b985edf93ad9868d60816b7046c", "title": "3D GEOMETRIC EXTRACTION USING SEGMENTATION FOR ASSET MANAGEMENT"}, {"paperId": "b9e32df9a9e9a1cee8ec7788d9f148a0ac1dcf4a", "title": "VISUALISING URBAN AIR QUALITY USING AERMOD, CALPUFF AND CFD MODELS: A CRITICAL REVIEW"}, {"paperId": "0d25484e0b39cfdc833df44bb120676ec0d64965", "title": "Voronoi classified and clustered data constellation: A new 3D data structure for geomarketing strategies"}, {"paperId": "0485ff145a3d2b522fa863ea90a1f784c0a14395", "title": "Smart City: Recent Advances and Research Issues"}]}
