{"paperId": "8e38847edd65368fb3ddd6f54c460e1e02509e31", "publicationVenue": {"id": "c83872c8-8037-4ef1-8ced-abb2233a2886", "name": "IEEE Transactions on Green Communications and Networking", "alternate_names": ["IEEE Trans Green Commun Netw"], "issn": "2473-2400", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=7511293", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=7511293"]}, "title": "Joint Workload Scheduling and Energy Management for Green Data Centers Powered by Fuel Cells", "abstract": "The fuel cell is a promising power source for green data centers due to its high energy efficiency, low carbon emissions, and high reliability. However, because of the mechanical limitations related to fuel delivery, fuel cells are slow in adjusting power output when the energy demand quickly changes, which is called limited load following. Many recent work have studied to mitigate the limited load following by using energy storage to adjust energy supply, but achieves limited successes because of the constraint of energy storage size. In this paper, we address this challenge by changing both energy supply and demand, via joint workload scheduling and energy management. Specifically, we consider multiple geo-distributed data centers powered by both fuel cells and energy storage. An online algorithm has been proposed to minimize the gap between energy supply and demand by jointly managing the fuel cells output and migrating workloads among data centers. Simulations results based on real-world traces show that the proposed algorithms can achieve satisfactory performance.", "venue": "IEEE Transactions on Green Communications and Networking", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-01-17", "journal": {"name": "IEEE Transactions on Green Communications and Networking", "pages": "397-406", "volume": "3"}, "authors": [{"authorId": "50049890", "name": "Xiaoxuan Hu"}, {"authorId": "143667002", "name": "Peng Li"}, {"authorId": "28014924", "name": "Kun Wang"}, {"authorId": "1759469", "name": "Yanfei Sun"}, {"authorId": "2288376751", "name": "Deze Zeng"}, {"authorId": "50821885", "name": "Xiaoyan Wang"}, {"authorId": "144123438", "name": "Song Guo"}], "citations": [{"paperId": "6b6b0d57b6d329894107642cac997f15e3128800", "title": "Human-Centric Irregular RIS-Assisted Multi-UAV Networks With Resource Allocation and Reflecting Design for Metaverse"}, {"paperId": "c7aafddbad4330e046821fbfb9db57b583b9c627", "title": "A novel demand response-based distributed multi-energy system optimal operation framework for data centers"}, {"paperId": "90333dd12a62ea33645c13fcdff9df8804072b17", "title": "GEECO: Green Data Centers for Energy Optimization and Carbon Footprint Reduction"}, {"paperId": "2c43535b09793ecf211e4d055ed7e6ef91a7edd6", "title": "Data Center-Enabled High Altitude Platforms: A Green Computing Alternative"}, {"paperId": "f97c4b3ec13993ca6b18261cbd1dba0489a5c03b", "title": "Multi-Terminal Smart Transformer for Green Data Centres"}, {"paperId": "5d312364e07743097ceb015c69ddd638728eb45b", "title": "Firefly algorithm and learning-based geographical task scheduling for operational cost minimization in distributed green data centers"}, {"paperId": "764f166746f89c8a5e9f3c0ceca46547f6c93668", "title": "A comprehensive survey on Green ICT with 5G-NB-IoT: Towards sustainable planet"}, {"paperId": "e4258e0a983b3251a1a60479eba246ae53ded0b5", "title": "Minimizing the operation cost of distributed green data centers with energy storage under carbon capping"}, {"paperId": "a83a42431e8a17f63fb0e63542497eaf0cc47d1b", "title": "Energy-Efficient Stable and Balanced Task Scheduling in Data Centers"}, {"paperId": "1712c9ed83faa98cfaf373dc7c48574ac15c1035", "title": "Improving the energy-efficiency of virtual machines by I/O compensation"}, {"paperId": "a491be3b71a67ae3b6a7f4fb0470e4322a07b43f", "title": "A Deep Reinforcement Learning-Based Power Resource Management for Fuel Cell Powered Data Centers"}, {"paperId": "47eea9d53b84ffbd127ff93f7996594a2444be6d", "title": "Topology-Aware Job Scheduling for Machine Learning Cluster"}, {"paperId": "e0a24db996833d84f8d369062ade75d777bded40", "title": "2019 Index IEEE Transactions on Green Communications and Networking Vol. 3"}, {"paperId": "d765a7b311f71b991c5cc0b7f58d03e777420937", "title": "International Journal of Electrical and Computer Engineering (IJECE)"}, {"paperId": "e57ba151bd20835cd93558b6264e6333ed470fa5", "title": "Eco-Friendly Powering and Delay-Aware Task Scheduling in Geo-Distributed Edge-Cloud System: A Two-Timescale Framework"}, {"paperId": "a1f918a46dfe1b8a203fc9dea2f1a81a0b73c86b", "title": "Efficiently Controlling Wireless Data Centers with Exact Topology Adjustment Strategy"}]}
