{"paperId": "8e3d30825a4690acec7457699ca5afe5b4ad5e9d", "publicationVenue": null, "title": "Improving Healthcare Using Big Data Analytics", "abstract": ": In daily terms we call the current era as ‗Modern Era‘, which can also be named as the era of Big Data in the field of Information Technology. Our daily lives in today‘s world are rapidly advancing never quenching ones thirst. The fields of science, engineering and technology are producing data at an exponential rate leading to Exabyte(s) of data every day. Big data helps us to explore and re-invent many areas not limited to education, health and law. The primary purpose of this paper is to provide an in-depth analysis in the area of Healthcare using the big data and analytics. The main purpose is to emphasize on the usage of the big data which is being stored all the time helping to look back in the history, but this is the time to emphasize on the analyzation to improve the medication and services. Although, many big data implementations happen to be in-house development, this proposed implementation aims to propose a broader extent using Hadoop, which just happen to be the tip of the iceberg. The focus of this paper is not limited to the improvement and analysis of the data; it also focusses on the strengths and drawbacks compared to the conventional techniques available.", "venue": "", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2017-03-25", "journal": {"name": "International Journal of Scientific & Technology Research", "pages": "142-146", "volume": "6"}, "authors": [{"authorId": "101179268", "name": "Revanth Sonnati"}], "citations": [{"paperId": "484eb2f1d26b47949f8df68c546d324950389d98", "title": "A Secured Healthcare Management and Service Retrieval for Society Over Apache Spark Hadoop Environment"}, {"paperId": "a576460a810495ff52d8b5a7047c1d1dc0280a93", "title": "Big Data: A Boom in biomedical sciences"}, {"paperId": "1a8b99dab8b652b7b535a3f93a300c1a10c73df6", "title": "Comparative Study of Apache Pig & Apache Cassandra in Hadoop Distributed Environment"}, {"paperId": "92fe9c6f9413f48368ffdf597b5aa60a2dd823d1", "title": "Developing a Model to Enhance the Quality of Health Informatics using Big Data"}, {"paperId": "4454571d59c042da45b3422e8dd1a804f1780981", "title": "Big Data in Healthcare: Technologies, Need, Advantages, and Disadvantages"}, {"paperId": "a48cafc0c3dbd001ae6bac3fc0e4119f8c10ebeb", "title": "An Analysis on Future Prospects of Big Data in Healthcare"}, {"paperId": "3cf84ae8d42f8f734e62983411137aa3180a7144", "title": "Big Data in Healthcare: Technical Challenges and Opportunities"}, {"paperId": "d999c365fe61661c3eda5bafa622f4078c6d0661", "title": "Leveraging Big Data to Balance New Key Performance Indicators in Emergency Physician Management Networks"}, {"paperId": "fb7106d36618cf3c895696eff25ca081fb75a3f8", "title": "Application of Seasonal Analytics in HealthCare Sector"}, {"paperId": "38afd22149845eeb80b522c5dae788698cda1bc0", "title": "Big Data and Data-Driven Healthcare Systems"}, {"paperId": "8c985d8415bddecee48fcfec296e693a4e3976a6", "title": "Analyzing the Big Data Security Through a Unified Decision-Making Approach"}, {"paperId": "f91b4ee2fec12d7171f54107b40af23a2f0d454f", "title": "Big Data Analytics in Healthcare: A Review"}, {"paperId": "d731b928cd3e09eb27eb4a00c3a6981ea473e9c2", "title": "A Walk Through the World of Data Analytics"}, {"paperId": "75d6d083230759bd5f9d41e674d3863909bb0d27", "title": "A novel approach of telemedicine for managing fetal condition based on machine learning technology from IoT-based wearable medical device"}, {"paperId": "ef6edd7a1fb6b3154bb29ff9e4bb690dd5d7102b", "title": "Big Data Analytics in Healthcare"}, {"paperId": "bd08c2198f8d97eb5962783ec438d9f01044e85a", "title": "Exploring Factors Influencing Big Data and Analytics Adoption in Healthcare Management"}, {"paperId": "3ff5150f10cc6658ad825c4b142fb65287d1084b", "title": "New Age Approaches to Predictive Healthcare Using In Silico Drug Design and Internet of Things (IoT)"}, {"paperId": "da98fb785d0102c2dd6d9786ded3ef37f8fd9285", "title": "Application of Big Data in Field of Medicine"}, {"paperId": "93e0d42bee2ace0a3e9519542ae58e94ba917338", "title": "A Framework Development on Big Data Analytics for Terahertz Healthcare"}, {"paperId": "6544f22677b34283dcfcb7d16e6b093a3df4dec6", "title": "Big Data Analytics in Healthcare: A Critical Analysis"}]}
