{"paperId": "8e414fb454e71010fec3b28feee8b01876d52c6e", "publicationVenue": {"id": "4ee942df-8fd9-437c-a9a6-e82a7cfdfb33", "name": "International Conference on Data Science and Information Technology", "type": "conference", "alternate_names": ["DSIT ", "Int Conf Data Sci Inf Technol"]}, "title": "Centroid 360: An Enhanced Centroid Initialization Method for K Means Algorithm", "abstract": "A weakness of the classic K means algorithm uses a random method for initializing centroids since it will produce random results that is unpredictable making it unreliable. The enhanced K means algorithm uses an innovative solution through a new method called Centroid 360 that is consistent and uses radius and 360 degrees to distribute centroid positions while at the same time separating the initial centroids from each other resulting into less pull from clustering similar datapoints against each other which results better number of iterations making the enhanced K means algorithm for initializing centroids more accurate, more efficient and faster. The new algorithm is tested using popular synthetic and real datasets available that can be found on the internet. The research is a success as the enhancement to the algorithm is consistent, uses less iterations and provides 61.21% more efficiency, 45.57% faster when it comes to speed and 14.66% more accurate than the traditional K means using random initialization method.", "venue": "International Conference on Data Science and Information Technology", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2019-07-19", "journal": {"name": "Proceedings of the 2019 2nd International Conference on Data Science and Information Technology"}, "authors": [{"authorId": "152373763", "name": "Jovy Jay D. Cabrera"}, {"authorId": "50844357", "name": "Ariel M. Sison"}, {"authorId": "30430551", "name": "Ruji P. Medina"}], "citations": [{"paperId": "6b9d3c712decacccf9216fd10b5e5319e1bb83fc", "title": "k-Means-Based Tactile Data Recognition Method for Sharp and Dangerous Objects for Robots"}, {"paperId": "f31aecd58b36e369884f10c3a1022d573cf749d0", "title": "The Systematic Review of K-Means Clustering Algorithm"}]}
