{"paperId": "8e51f65e05dca6a74576ae896ca39eeea2264bad", "publicationVenue": {"id": "74f47cf8-2839-4a56-959a-524dd0ed9e3e", "name": "International Conference on Extending Database Technology", "type": "conference", "alternate_names": ["Int Conf Extending Database Technol", "Extending Database Technology", "Extending Database Technol", "EDBT"], "url": "http://www.edbt.org/"}, "title": "Exploration of Approaches for In-Database ML", "abstract": "Database systems are no longer used only for the storage of plain structured data and basic analyses. An increasing role is also played by the integration of ML models, e.g., neural networks with specialized frameworks, and their use for classification or prediction. However, using such models on data stored in a data-base system might require downloading the data and performing the computations outside. In this paper, we evaluate approaches for integrating the ML inference step as a special query operator - the ModelJoin. We explore several options for this integration on different abstraction levels: relational representation of the models as well as SQL queries for inference, the use of UDFs, the use of APIs to existing ML runtimes and a native implementation of the ModelJoin as a query operator supporting both CPU and GPU execution. Our evaluation results show that integrating ML runtimes over APIs perform similarly to a native operator while being generic to support arbitrary model types. The solution of relational representation and SQL queries is most portable and works well for smaller inputs without any changes needed in the database engine.", "venue": "International Conference on Extending Database Technology", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": null, "journal": {"pages": "311-323"}, "authors": [{"authorId": "32867588", "name": "Steffen Kläbe"}, {"authorId": "2522511", "name": "Stefan Hagedorn"}, {"authorId": "1716839", "name": "K. Sattler"}], "citations": [{"paperId": "49beab6faf0126d47e19fb781e1677742c150d9c", "title": "The Duck's Brain: Training and Inference of Neural Networks in Modern Database Engines"}, {"paperId": "a72c5ff8bb28397049dfd49831d3208ed94fe4c2", "title": "Architecting Intermediate Layers for Efficient Composition of Data Management and Machine Learning Systems"}]}
