{"paperId": "8e5b754bf92d1481f381b4f72699b3e5155efb6f", "publicationVenue": {"id": "6625af65-e8dc-49f0-93fb-69824c0657c1", "name": "Machines", "issn": "2075-1702", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-318010", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-318010", "https://www.mdpi.com/2075-1702/5/4/24", "https://www.mdpi.com/journal/machines"]}, "title": "Yaw Rate Prediction and Tilting Feedforward Synchronous Control of Narrow Tilting Vehicle Based on RNN", "abstract": "The synchronous control of yaw motion and tilting motion is an important problem related to the lateral stability and energy consumption of narrow tilting vehicles. This paper proposes a method for the tilting control of narrow tilting vehicles: tilting feedforward synchronous control. This method utilizes a proposed novel prediction method for yaw rate based on a recurrent neural network. Meanwhile, considering that classical recurrent neural networks can only predict yaw rate at a given time, and that yaw rate prediction generally needs to analyze a large amount of computer vision data, in this paper, the yaw rate is represented by a polynomial operation to predict the continuous yaw rate in the time domain; this prediction is realized using only the driving data of the vehicle itself and does not include the data generated by computer vision. A prototype experiment is provided in this work to prove the advantages and feasibility of the proposed tilting feedforward synchronous control method for narrow tilting vehicles. The proposed tilting feedforward synchronous control method can ensure the synchronous response of the yaw motion and the tilting motion of narrow tilting vehicles.", "venue": "Machines", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-03-09", "journal": {"name": "Machines"}, "authors": [{"authorId": "153377934", "name": "Ruolin Gao"}, {"authorId": "2108590030", "name": "Haitao Li"}, {"authorId": "2115811253", "name": "Ya Wang"}, {"authorId": "2728584", "name": "Shaobing Xu"}, {"authorId": "47748188", "name": "Wenjun Wei"}, {"authorId": "2115477354", "name": "X. Zhang"}, {"authorId": "2211381111", "name": "Na Li"}], "citations": [{"paperId": "43045532746b385fc65bed864a8099c90c7fdba3", "title": "Direct Tilt Controller Design with Disturbance Compensation and Implementation for a Narrow Tilting Electric Vehicle"}]}
