{"paperId": "8e5d42f5b98146d0784fe85e29c768a4989e1478", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Foundational Models in Medical Imaging: A Comprehensive Survey and Future Vision", "abstract": "Foundation models, large-scale, pre-trained deep-learning models adapted to a wide range of downstream tasks have gained significant interest lately in various deep-learning problems undergoing a paradigm shift with the rise of these models. Trained on large-scale dataset to bridge the gap between different modalities, foundation models facilitate contextual reasoning, generalization, and prompt capabilities at test time. The predictions of these models can be adjusted for new tasks by augmenting the model input with task-specific hints called prompts without requiring extensive labeled data and retraining. Capitalizing on the advances in computer vision, medical imaging has also marked a growing interest in these models. To assist researchers in navigating this direction, this survey intends to provide a comprehensive overview of foundation models in the domain of medical imaging. Specifically, we initiate our exploration by providing an exposition of the fundamental concepts forming the basis of foundation models. Subsequently, we offer a methodical taxonomy of foundation models within the medical domain, proposing a classification system primarily structured around training strategies, while also incorporating additional facets such as application domains, imaging modalities, specific organs of interest, and the algorithms integral to these models. Furthermore, we emphasize the practical use case of some selected approaches and then discuss the opportunities, applications, and future directions of these large-scale pre-trained models, for analyzing medical images. In the same vein, we address the prevailing challenges and research pathways associated with foundational models in medical imaging. These encompass the areas of interpretability, data management, computational requirements, and the nuanced issue of contextual comprehension.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-10-28", "journal": {"name": "ArXiv", "volume": "abs/2310.18689"}, "authors": [{"authorId": "2262442826", "name": "Bobby Azad"}, {"authorId": "1763181", "name": "Reza Azad"}, {"authorId": "2143241060", "name": "Sania Eskandari"}, {"authorId": "9345245", "name": "Afshin Bozorgpour"}, {"authorId": "2131612425", "name": "A. Kazerouni"}, {"authorId": "3243720", "name": "I. Rekik"}, {"authorId": "1737693", "name": "D. Merhof"}], "citations": [{"paperId": "e3bbe8a4807e9412e9d6cd2bfcd33e8dbc2e0e0f", "title": "A Segmentation Foundation Model for Diverse-type Tumors"}, {"paperId": "0e3bafe8aa1895605ab9dc95a9dada411e11c81f", "title": "The Application of Radiomics and AI to Molecular Imaging for Prostate Cancer"}, {"paperId": "9a990fbd08473b0439cbcab6f490c6305cbbda70", "title": "Semi-weakly-supervised neural network training for medical image registration"}, {"paperId": "b4e241e73c614f4278945dd963b3efcf452953cb", "title": "Artificial Intelligence in Image-based Cardiovascular Disease Analysis: A Comprehensive Survey and Future Outlook"}, {"paperId": "fcaa710d17613cccd8b14217e65fcff11a05b0d7", "title": "USFM: A Universal Ultrasound Foundation Model Generalized to Tasks and Organs towards Label Efficient Image Analysis"}, {"paperId": "e5950d7e51e8a48101737cc1fd2d601babc002bc", "title": "Continual Learning in Medical Image Analysis: A Comprehensive Review of Recent Advancements and Future Prospects"}, {"paperId": "e999bd1eb04c4343ca725a2e461ee5d1806be11e", "title": "Loss Functions in the Era of Semantic Segmentation: A Survey and Outlook"}, {"paperId": "86d93cd175055b85c496c2e18424d53a7067d8cf", "title": "An unsupervised approach towards promptable defect segmentation in laser-based additive manufacturing by Segment Anything"}, {"paperId": "55c62c859e410f09fa12ddfef007abb46001044c", "title": "Leveraging Unlabeled Data for 3D Medical Image Segmentation through Self-Supervised Contrastive Learning"}, {"paperId": "5f0dcd30110d064d775e1b16e5550a207a90eb11", "title": "Label-Efficient Deep Learning in Medical Image Analysis: Challenges and Future Directions"}, {"paperId": "7d5316c7f3a13d133b7ce44fd04902580e7b4fa8", "title": "Medical Image Analysis"}]}
