{"paperId": "8e61e42fe7b2939394ed4cf326f77f7e20d21573", "publicationVenue": {"id": "72c05183-0dc0-4677-a987-a1d6a8691b97", "name": "International Conference on Information Visualisation", "type": "conference", "alternate_names": ["IEEE International Conference on Information Visualization", "Intell Veh Symp", "IEEE Int Conf Inf Vis", "IV", "Int Conf Inf Vis", "Intelligent Vehicles Symposium"], "url": "http://www.wikicfp.com/cfp/program?id=1803"}, "title": "Big Data in 3D: Design guidelines for an immersive 3 dimensional approach to Big Data interaction design", "abstract": "The aim of this paper is to inspire the development of Big Data interaction in a 3 dimensional form to make Big Data Visualization more immersive, intuitive, visually engaging and user friendly. This paper initially discusses the current approaches to Big Data interaction and their limitation therein. It then proceeds to review the latest trends and developments in the technology sphere to explore how Big Data interaction could be technologically enhanced. Following which, the paper articulates design guidelines that could be adopted in the design of 3 dimensional Big Data interaction, based on literature research. These guidelines contribute towards visual formatting, information organization and interaction design of Big Data, to make it more human centered. Through proposing the interaction design of Big Data in alignment with the natural orientation of human perception of the world, the paper intends to make the field of data science accessible to all. Lastly, the paper concludes with a discussion of future vision for Big Data interaction.", "venue": "International Conference on Information Visualisation", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference", "Review"], "publicationDate": "2022-07-01", "journal": {"name": "2022 26th International Conference Information Visualisation (IV)", "pages": "194-198"}, "authors": [{"authorId": "2202563847", "name": "Akshay A. S. Rege"}], "citations": []}
