{"paperId": "8e62ef5cb205677be8461ea2fda2fcd214e5391a", "publicationVenue": null, "title": "MB2: Decomposed Behavior Modeling for Self-Driving Database Management Systems", "abstract": "Database management systems (DBMSs) are notoriously difficult to deploy and administer. The goal of a self-driving DBMS is to remove these impediments by managing itself automatically. However, a critical problem in achieving full autonomy is how to predict the DBMS's runtime behavior and resource consumption. These predictions guide a self-driving DBMS's decision-making components to tune and optimize all aspects of the system. We present the ModelBot2 end-to-end framework for constructing and maintaining prediction models using machine learning (ML) in self-driving DBMSs. Our approach decomposes a DBMS's architecture into fine-grained operating units that make it easier to estimate the system's behavior for configurations that it has never seen before. ModelBot2 then provides an offline execution environment to exercise the system to produce the training data used to train its models. We integrated ModelBot2 in an in-memory DBMS and measured its ability to predict its performance for OLTP and OLAP workloads running in dynamic environments. We also compare ModelBot2 against state-of-the-art ML models and show that our models are up to 25x more accurate in multiple scenarios.", "venue": "SIGMOD Conference", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2021-06-09", "journal": {"name": "Proceedings of the 2021 International Conference on Management of Data"}, "authors": [{"authorId": "2115503336", "name": "Lin Ma"}, {"authorId": "2108310792", "name": "William Zhang"}, {"authorId": "1382719174", "name": "Jie Jiao"}, {"authorId": "2108455857", "name": "Wuwen Wang"}, {"authorId": "1453023356", "name": "Matthew Butrovich"}, {"authorId": "1384266964", "name": "Wan Shen Lim"}, {"authorId": "39882369", "name": "Prashanth Menon"}, {"authorId": "1774210", "name": "Andrew Pavlo"}], "citations": [{"paperId": "2efe12dcaf4d4935f82b39c0aa557d371c7f3212", "title": "Limousine: Blending Learned and Classical Indexes to Self-Design Larger-than-Memory Cloud Storage Engines"}, {"paperId": "263b0924f50444bbd7cdf5374638695e3eb56156", "title": "Automatic Database Knob Tuning: A Survey"}, {"paperId": "d2c1744871529d90a02d7bda9129605a4eaed3f0", "title": "DBPA: A Benchmark for Transactional Database Performance Anomalies"}, {"paperId": "219af6ca8d476bd2d8ac0cf0eac3dc0297ce6c00", "title": "FASTune: Towards Fast and Stable Database Tuning System with Reinforcement Learning"}, {"paperId": "80e4d7f1a11dbcefe9b2078871dd60fc7b60f588", "title": "DBAugur: An Adversarial-based Trend Forecasting System for Diversified Workloads"}, {"paperId": "adb91139a9d2d43abb0fb4bb0bdcc8ca53e00457", "title": "Survey on performance optimization for database systems"}, {"paperId": "bbe192c04b8a97a67a0742b529efa14b6643716e", "title": "SageDB: An Instance-Optimized Data Analytics System"}, {"paperId": "96cd0d31b6188cae63cab75cbdc67141f158b11e", "title": "Fine-Grained Modeling and Optimization for Intelligent Resource Management in Big Data Processing"}, {"paperId": "e9b0f9456717fb3985ce2c6b7dc15316d2e742e1", "title": "Tiresias: Enabling Predictive Autonomous Storage and Indexing"}, {"paperId": "7e678d502a2553001de118efe4fab287c0aa7f5c", "title": "HUNTER: An Online Cloud Database Hybrid Tuning System for Personalized Requirements"}, {"paperId": "0e9ff048ae1efe0fb9656f230349f7f446bc13fd", "title": "Tastes Great! Less Filling! High Performance and Accurate Training Data Collection for Self-Driving Database Management Systems"}, {"paperId": "d53ef63ada540f20ebbf28aa47072e36c8faf024", "title": "LearnedSQLGen: Constraint-aware SQL Generation using Reinforcement Learning"}, {"paperId": "354fbd6c940ead125fe995503b87462470d2d4f5", "title": "Database Optimizers in the Era of Learning"}, {"paperId": "259b8a12045d59e884de29a9edb275c3a13378fb", "title": "A Comparative Study of in-Database Inference Approaches"}, {"paperId": "95a7e4b4d535a9c61a6f466a090a4004ef151b50", "title": "Machine Learning for Data Management: A System View"}, {"paperId": "c2f111fd378b0347eaf2f747f85c6b30c044a0da", "title": "Towards Dynamic and Safe Configuration Tuning for Cloud Databases"}, {"paperId": "f0b261866f03b14da7af8671965979df7195a0dd", "title": "Robust and Budget-Constrained Encoding Configurations for In-Memory Database Systems"}, {"paperId": "86ce2817d31831f011f364c5324e503574ea2b07", "title": "Make Your Database System Dream of Electric Sheep: Towards Self-Driving Operation"}, {"paperId": "cfb5acf534c651540c2cd6c597f00047ba4504bd", "title": "Self-driving Vehicles Will Revolutionize the Transportation System"}, {"paperId": "a397840de4303ca3346466632466892a6a69829a", "title": "PilotScope: Steering Databases with Machine Learning Drivers"}, {"paperId": "9fa364d966f4ef8231ff5d67bc03949fb178381f", "title": "High-Performance Database Management System Design for Efficient Query Scheduling"}, {"paperId": "fbd2ec1505de35ccceca9bf29c2746733cb09278", "title": "Database Gyms"}, {"paperId": "b9be91244d02909d11fc8bd1b867ffba86d24e63", "title": "Workload-Driven Data Placement for Tierless In-Memory Database Systems"}, {"paperId": "30c8ecc7afc84e36a3c977ff81f4fcd315ce9900", "title": "Evaluating Lightweight Integer Compression Algorithms in Column-Oriented In-Memory DBMS"}, {"paperId": "45e98f37ff35c155649958027c2e8f37b8496e23", "title": "Panda : Performance Debugging for Databases using LLM Agents"}]}
