{"paperId": "8e676f5aeea75abb6e85f840793aab691b1033ac", "publicationVenue": {"id": "d73da5c1-25a6-434d-9613-27fb2114cbb8", "name": "Advance in Civil Engineering", "type": "journal", "alternate_names": ["Adv Civ Eng", "Advances in Civil Engineering"], "issn": "2707-3262", "alternate_issns": ["1687-8086"], "url": "https://www.sciscanpub.com/journals/ace", "alternate_urls": ["http://www.hindawi.com/journals/ace/contents.html", "https://www.hindawi.com/journals/ace/2017/8987626/", "https://www.hindawi.com/journals/ace/"]}, "title": "A Study on the Instability Mechanisms of Coal Pillars in Shallow Coal Seams Group Mining", "abstract": "To explore the instability mechanisms of coal pillars in the upper coal during coal seam group mining in the Yulin area and hence to achieve safe and green mining of the lower coal seams, the engineering geological condition for no. 3−1, no. 4−2, and no. 5−2 coal seams in the north-second panel area of Hongliulin Coal Mine was investigated in this article. Using the combination of physical simulation, FLAC3D numerical calculation, and theoretical analysis, the instability mechanisms, the characteristics of the fracture structure, and fracture evolution between the coal pillars and the interval rocks were all studied. The results showed that a layout position existed that induced instability and subsidence of the coal pillars of the upper coal seam. The instability mechanism was such that the concentrated stress of the upper and lower coal pillars caused shear plastic damage in the interval rock along the direction of stress-transfer influence angle. The phenomenon of “inclined step beam” fracture structure, falling fracture zone, and severe mine pressure happened during seam group mining. Furthermore, the minimum center offset formula was put forward to study the instability of the upper coal pillars. This study provides a theoretical basis for a reasonable layout on how to position coal pillars for shallow coal seams group mining.", "venue": "Advance in Civil Engineering", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-03-21", "journal": {"name": "Advances in Civil Engineering"}, "authors": [{"authorId": "2148250533", "name": "Tielin Shang"}, {"authorId": "2128724364", "name": "Jindong Wang"}, {"authorId": "1822122850", "name": "Yuwei Liu"}, {"authorId": "2035414726", "name": "Y. Suo"}, {"authorId": "2108504089", "name": "Zhiyi Wang"}, {"authorId": "1491724138", "name": "Sixin Fu"}, {"authorId": "2144025494", "name": "Fei Zhang"}], "citations": []}
