{"paperId": "8e6c889b136604856813962ad7d1be6b85902c9c", "publicationVenue": null, "title": "The BRS-inequality and its applications", "abstract": "This article is a survey of results concerning an inequality, which may be seen as a versatile tool to solve problems in the domain of Applied Probability. The inequality, which we call BRS-inequality, gives a convenient upper bound for the expected maximum number of non-negative random variables one can sum up without exceeding a given upper bound s > 0. One valuable property of the BRS-inequality is that it is valid without any hypothesis about independence of the random variables. Another welcome feature is that, once one sees that one can use it in a given problem, its application is often straightforward or not very involved. This survey is focussed, and we hope that it is pleasant and inspiring to read. Focus is easy to achieve, given that the BRS-inequality and its most useful versions can be displayed in five Theorems and their proofs. We try to present these in an appealing way. The objective to be inspiring is harder, and the best we can think of is offering a variety of applications. Our examples include comparisons between sums of i.i.d. versus non-identically distributed and/or dependent random variables, problems of condensing point processes, awkward processes, monotone subsequence problems, knapsack problems, online algorithms, tiling policies, Borel-Cantelli type problems, up to applications in the theory of resource dependent branching processes. Apart from our wish to present the inequality in an organised way, the motivation for this survey is the hope that interested readers may see potential of the inequality for their own problems. MSC2020 subject classifications: Primary 60-01; secondary 60-02.", "venue": "", "year": 2021, "fieldsOfStudy": ["Mathematics"], "publicationTypes": ["Review"], "publicationDate": null, "journal": {"name": "Probability Surveys", "volume": "18"}, "authors": [{"authorId": "1937660", "name": "F. Bruss"}], "citations": [{"paperId": "c0d9c9880fbe4727a715bcfe79672555e56b7fe5", "title": "The Bruss–Robertson–Steele inequality"}, {"paperId": "4024e9e377eab95b99e2d41b3604697c797e509b", "title": "Galton-Watson processes and their role as building blocks for branching processes"}, {"paperId": "4caa80e44689634ad284ff86bbf93e1aa76eb430", "title": "A Complete Bibliography of Publications in Probability Surveys"}]}
