{"paperId": "8e73b77dfc056a46531bb3011e52847aecaddaa4", "publicationVenue": {"id": "fe526af8-da0b-4a52-925c-e0e345537a7e", "name": "International Conference on Wireless Communications and Signal Processing", "type": "conference", "alternate_names": ["Int Conf Wirel Commun Signal Process", "WCSP"], "url": "http://www.ic-wcsp.org/"}, "title": "Energy-Efficient UAV Deployment and Task Scheduling in Multi-UAV Edge Computing", "abstract": "Unmanned Aerial Vehicle (UAV) Edge Computing is expected to be critical for providing communications, computation, and storage services at areas with weak infrastructures through extending cloud service installed on low cost and easy-to-deploy UAVs to network edge. However, the service availability and capacity of one single UAV edge server is very limited, and can not meet the requirements of a number of mobile terminals (MTs) distributed in a large area. Therefore, it is more promising to have multiple UAVs collaborate with each other to provide edge computing service. In this circumstance, this paper establishes a Multi-UAV collaborative edge computing framework, in which the offloaded tasks to the UAVs from MTs are collaboratively processed through inter-UAV task offloading. Then, an optimization problem is built to minimize the system's energy consumption while completing all offloaded tasks. To solve this problem, we jointly optimize the number of deployed UAVs and the offloading decision at each MT. Firstly, a multi-UAV deployment mechanism based on differential evolution (DE) is adopted to determine each deployed UAV's position. Secondly, an efficient collaborative greedy algorithm for task scheduling is designed to help each MT decide whether to offload and its offloading destination. These two steps are iteratively conducted to reduce the number of deployed UAVs and system's energy consumption. To evaluate our proposal's performance, a series of simulations are conducted. Simulation results have shown that our proposal outperforms existing works in in terms of energy consumption as well as the number of deployed UAVs.", "venue": "International Conference on Wireless Communications and Signal Processing", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-10-21", "journal": {"name": "2020 International Conference on Wireless Communications and Signal Processing (WCSP)", "pages": "1147-1152"}, "authors": [{"authorId": "2146020653", "name": "Yangang Wang"}, {"authorId": "2155273677", "name": "Hai Wang"}, {"authorId": "1697298", "name": "Xianglin Wei"}], "citations": [{"paperId": "08e8d485018ec7816ae4d5eea23258a9c9f7d563", "title": "A Novel Federated Learning-Based Smart Power and 3D Trajectory Control for Fairness Optimization in Secure UAV-Assisted MEC Services"}, {"paperId": "fd5dbf85019b310e440c4636fc0109e8bad68310", "title": "Multiagent Reinforcement Learning in Controlling Offloading Ratio and Trajectory for Multi-UAV Mobile-Edge Computing"}, {"paperId": "4f43abca05307c4c26b1c673a6dafc176a9a4d6d", "title": "Multitask and Multiobjective Joint Resource Optimization for UAV-Assisted Air-Ground Integrated Networks Under Emergency Scenarios"}, {"paperId": "3c908ca8405f0bc030112edbc858000d7dfe3d44", "title": "Supporting UAVs with Edge Computing: A Review of Opportunities and Challenges"}, {"paperId": "070d0f463263a10bbebbf2099e11984baa75ec64", "title": "Deep Reinforcement Learning Based Task Offloading for UAV-Assisted Edge Computing"}, {"paperId": "b88ca170556df02f7c573eafb257deb3ed880a70", "title": "Vehicle Digital Twins in Space-Air-Ground Integrated Networks: A Game-based Migration Scheme"}, {"paperId": "f9294b93a53783fb56b6af3e47d6c862f765a455", "title": "Drone’s node placement algorithm with routing protocols to enhance surveillance"}, {"paperId": "b0e1f88c86282cbccaf7fb82da3f5b5cfbed28e7", "title": "Joint task offloading and UAVs deployment for UAV-assisted mobile edge computing"}, {"paperId": "4bdae1f7159bf93bdcddcbfe09e7814873b7f650", "title": "Fair Energy-Efficient Resource Optimization for Green Multi-NOMA-UAV Assisted Internet of Things"}, {"paperId": "95dc4f914dd37ac9ccbb5747e4a262278fdeca98", "title": "Secure Transmission for Multi-UAV-Assisted Mobile Edge Computing Based on Reinforcement Learning"}, {"paperId": "afb8d681736cc11ff99debdc8febad02aff7b70f", "title": "Green UAV-enabled Internet-of-Things Network with AI-assisted NOMA for Disaster Management"}, {"paperId": "fe8e6cbbd2900e0c053cf8337faa17985013ffc9", "title": "Energy-aware Message Distribution Algorithm for Enhance FANET Pipeline Surveillance Reliability."}, {"paperId": "0d174dbe4f1661e09221686a377e45cf7a5f919c", "title": "Fairness-Aware Task Loss Rate Minimization for Multi-UAV Enabled Mobile Edge Computing"}, {"paperId": "9fcb9f47b2416bf19ec21bec72ea4348baa3869e", "title": "Deep reinforcement learning based delay-aware task offloading for UAV-assisted edge computing"}, {"paperId": "bcce8ab6582f1e429997ae4b09d2aae470fd3df8", "title": "A Novel Optimization Strategy For Computation Offloading in the UAV-assisted Edge Computing"}, {"paperId": "ea705962b0db62b58776ddf3e8d20854ec15d720", "title": "UAV Swarm Trajectory and Cooperative Beamforming Design in Double-IRS Assisted Wireless Communications"}, {"paperId": "40b362616c7284b62acd1fe9176b60c7f57f9991", "title": "Multi-Slot Dynamic Computing Resource Optimization in Edge Computing"}, {"paperId": "0936746ea0df6b42635a5ad20a271cfbc6190916", "title": "Collaborative UAV Deployment and Task Allocation for Environment Sensing in Multi-UAV Networks"}, {"paperId": "0c4b92ede1973c2dbcd8aaf023a1326e28ed6132", "title": "Distributed Interference Optimization Method of Large-scale UAV Based on Tabu Search Artificial Bee Colony Algorithm"}, {"paperId": "f6315cb5d56d027466d59ca733b506d251ec3efd", "title": "Analysis of deployment and task assignment for multi-UAV-assisted MEC networks"}, {"paperId": "0d254de5cdb918665d9adc120748972ada755c9f", "title": "Collaborative task offloading and resource allocation with hybrid energy supply for UAV-assisted multi-clouds"}, {"paperId": "8814c947171c2f07c861dbdc826778aea08e946d", "title": "A Task Offloading Strategy for Compute-Intensive Scenarios in UAV-Assisted IoV"}, {"paperId": "bb623ee45751c15337facc5e28a8070ce3904ad6", "title": "Unmanned aerial vehicle-aided edge networks with ultra-reliable low-latency communications: A digital twin approach"}, {"paperId": "18aabfe28d7ba70e44b3620251015050b2b30489", "title": "Cooperative Task Offloading in UAV Swarm-based Edge Computing"}, {"paperId": "b188d95b09d20a44be57d3e77f0d9a3cfc76173c", "title": "Hybrid beamforming NOMA for mmWave half-duplex UAV relay-assisted B5G/6G IoT networks"}]}
