{"paperId": "8e7dcddd116556f8e0bd4724b99e761842c95d8e", "publicationVenue": null, "title": "Scalable preference queries for high-dimensional data using map-reduce", "abstract": "Preference (top-k) queries play a key role in modern data analytics tasks. Top-k techniques rely on ranking functions in order to determine an overall score for each of the objects across all the relevant attributes being examined. This ranking function is provided by the user at query time, or generated for a particular user by a personalized search engine which prevents the pre-computation of the global scores. Executing this type of queries is particularly challenging for high-dimensional data. Recently, bit-sliced indices (BSI) were proposed to answer these preference queries efficiently in a non-distributed environment for data with hundreds of dimensions. As MapReduce and key-value stores proliferate as the preferred methods for analyzing big data, we set up to evaluate the performance of BSI in a distributed environment, in terms of index size, network traffic, and execution time of preference (top-k) queries, over data with thousands of dimensions. Indexing is implemented on top of Apache Spark for both column and row stores and shown to outperform Hive when running on Map-reduce, and Tez for top-k (preference) queries.", "venue": "2015 IEEE International Conference on Big Data (Big Data)", "year": 2015, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2015-10-29", "journal": {"name": "2015 IEEE International Conference on Big Data (Big Data)", "pages": "2243-2252"}, "authors": [{"authorId": "2257058", "name": "Gheorghi Guzun"}, {"authorId": "37636509", "name": "Joel E. Tosado"}, {"authorId": "1791664", "name": "G. Canahuate"}], "citations": [{"paperId": "1ff5c4b9471d24b78cda1ef632e87e067ecd9a17", "title": "Information Fusion for Multi-Source Material Data: Progress and Challenges"}, {"paperId": "6c0ad80c1c9e2cee7dd0c50d8c77f5f0d4adf75b", "title": "Fast and Efficient In-Memory Big Data Processing"}, {"paperId": "678571b5de3faee6d8a3bf0a9d1059440641c562", "title": "Progress on Artificial Neural Networks for Big Data Analytics: A Survey"}, {"paperId": "6f957e55c356cfc8ad0c5d7d4cb2b3075a6ec2a4", "title": "ΑΡΙΣΤΟΤΕΛΕΙΟ ΠΑΝΕΠΙΣΤΗΜΙΟ ΘΕΣΣΑΛΟΝΙΚΗΣ"}, {"paperId": "e57c8f440f04208484171880f41965703a8c3999", "title": "Studying Recommender Systems to Enhance Distributed Computing Schedulers"}]}
