{"paperId": "8e7d14738cd766acc7b3d55af64799357c4ad97a", "publicationVenue": {"id": "b9046b70-b291-4f52-b799-e5b7693b0910", "name": "Digital Policy Regulation and Governance", "alternate_names": ["Digit Policy Regul Gov"], "issn": "2398-5038", "url": "https://www.emerald.com/insight/publication/acronym/DPRG", "alternate_urls": ["http://www.emeraldinsight.com/loi/dprg"]}, "title": "What influences citizens’ expectations towards digital government? An exploratory survey", "abstract": "\nPurpose\nGovernments around the world engage in digitalization projects to improve their internal functioning and the delivery of information and services to their users, including citizens. There are several ways to implement this digitalization and, therefore, different roles for citizens, who can be considered as customers, as participants and as coproducers in a digital government. The purpose of this study is to identify which factors influence the roles citizens are willing to take in a digital government.\n\n\nDesign/methodology/approach\nThis paper conducted an exploratory survey in Belgium. This paper examined which factors among age, gender, occupation, education, digital literacy, government level and frequency of use of other e-services influence citizens’ roles.\n\n\nFindings\nThrough a statistical analysis conducted on data collected from 203 citizens, this paper identifies 25 relationships between the aforementioned factors and expectations mapped to the citizens’ roles. This paper has identified relationships between expectations and government level, gender, age, occupation, use frequency of other e-services and digital literacy. On the other hand, this paper found no influence for the education level and for working in an administration.\n\n\nResearch limitations/implications\nThis study contributes to the research field by providing insights into what citizens expect from digital government and exploring several relationships to be investigated in further research.\n\n\nOriginality/value\nNo previous work has asked directly to citizens which role they would be willing to take and, consequently, what expectations they have towards digital government. This paper contributes a usable survey instrument to achieve this and has demonstrated how it can be used to collect data from citizens. In doing so, this paper contributed valuable findings supporting Belgian policymakers in developing digital government policies that are aligned with citizens' expectations.\n", "venue": "Digital Policy Regulation and Governance", "year": 2021, "fieldsOfStudy": ["Political Science"], "publicationTypes": ["Review"], "publicationDate": "2021-06-10", "journal": {"name": "Digital Policy, Regulation and Governance"}, "authors": [{"authorId": "11031666", "name": "Anthony Simonofski"}, {"authorId": "81103948", "name": "Antoine Clarinval"}, {"authorId": "3168244", "name": "B. Vanderose"}, {"authorId": "33545118", "name": "Bruno Dumas"}, {"authorId": "1774221", "name": "M. Snoeck"}], "citations": []}
