{"paperId": "8e87c31c9174c254b824910e28b5bf66f274650e", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Benchmarking a New Paradigm: An Experimental Analysis of a Real Processing-in-Memory Architecture", "abstract": "Many modern workloads, such as neural networks, databases, and graph processing, are fundamentally memory-bound. For such workloads, the data movement between main memory and CPU cores imposes a significant overhead in terms of both latency and energy. A major reason is that this communication happens through a narrow bus with high latency and limited bandwidth, and the low data reuse in memory-bound workloads is insufficient to amortize the cost of main memory access. Fundamentally addressing this data movement bottleneck requires a paradigm where the memory system assumes an active role in computing by integrating processing capabilities. This paradigm is known as processing-in-memory (PIM). Recent research explores different forms of PIM architectures, motivated by the emergence of new 3D-stacked memory technologies that integrate memory with a logic layer where processing elements can be easily placed. Past works evaluate these architectures in simulation or, at best, with simplified hardware prototypes. In contrast, the UPMEM company has designed and manufactured the first publicly-available real-world PIM architecture. This paper provides the first comprehensive analysis of the first publicly-available real-world PIM architecture. We make two key contributions. First, we conduct an experimental characterization of the UPMEM-based PIM system using microbenchmarks to assess various architecture limits such as compute throughput and memory bandwidth, yielding new insights. Second, we present PrIM, a benchmark suite of 16 workloads from different application domains (e.g., linear algebra, databases, graph processing, neural networks, bioinformatics).", "venue": "arXiv.org", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-05-09", "journal": {"name": "ArXiv", "volume": "abs/2105.03814"}, "authors": [{"authorId": "1474355913", "name": "Juan G'omez-Luna"}, {"authorId": "3077499", "name": "I. E. Hajj"}, {"authorId": "2061067079", "name": "Ivan Fernandez"}, {"authorId": "46175739", "name": "Christina Giannoula"}, {"authorId": "2173743", "name": "Geraldo F. Oliveira"}, {"authorId": "145929920", "name": "O. Mutlu"}], "citations": [{"paperId": "068d28f32d8246db1346b94a6ad0e6603df2c30e", "title": "Accelerating Regular Path Queries over Graph Database with Processing-in-Memory"}, {"paperId": "cbb505aafe497d6d3da167c18e2984fc31edf61e", "title": "PUMA: Efficient and Low-Cost Memory Allocation and Alignment Support for Processing-Using-Memory Architectures"}, {"paperId": "c9edf92c1f762c52a90cc0cb45eb06d4eed82110", "title": "MIMDRAM: An End-to-End Processing-Using-DRAM System for High-Throughput, Energy-Efficient and Programmer-Transparent Multiple-Instruction Multiple-Data Computing"}, {"paperId": "d5f2e95be45d3e003655a9a84e0adda9468b0838", "title": "MIMDRAM: An End-to-End Processing-Using-DRAM System for High-Throughput, Energy-Efficient and Programmer-Transparent Multiple-Instruction Multiple-Data Processing"}, {"paperId": "2a6b93149da73a7048377866fcd7aa830f8f1843", "title": "The Landscape of Compute-near-memory and Compute-in-memory: A Research and Commercial Overview"}, {"paperId": "0ed573cc058e3cc1ea89ac774075d4484eed8943", "title": "CARAT KOP: Towards Protecting the Core HPC Kernel from Linux Kernel Modules"}, {"paperId": "49a04d62fa1c7b8510532b32cde1002298e3215e", "title": "Unlocking the Potential of LDPC Decoders with PiM Acceleration"}, {"paperId": "3db4337a5beb82db32ef647296f1a589bb4add1a", "title": "Virtual PIM: Resource-Aware Dynamic DPU Allocation and Workload Scheduling Framework for Multi-DPU PIM Architecture"}, {"paperId": "a8dd9ca207477e704c1b6f026de3136d45e94f3e", "title": "DaPPA: A Data-Parallel Framework for Processing-in-Memory Architectures"}, {"paperId": "711910e69879e512fde3f591eca5447a46625e00", "title": "SimplePIM: A Software Framework for Productive and Efficient Processing-in-Memory"}, {"paperId": "bd3d145d79a45bcf99d92bdbc475ed6a629f318a", "title": "A Survey of Memory-Centric Energy Efficient Computer Architecture"}, {"paperId": "ef0638c10bba5e53bf348cd3e64c2954dc903d57", "title": "Pathfinding Future PIM Architectures by Demystifying a Commercial PIM Technology"}, {"paperId": "e682f005d5424fd773adf2a1a3e83b3f89171dfe", "title": "Operand-Oriented Virtual Memory Support for Near-Memory Processing"}, {"paperId": "00d28de172e4e90d540758c5caff6abb234e6ea8", "title": "NMExplorer: An Efficient Exploration Framework for DIMM-based Near-Memory Tensor Reduction"}, {"paperId": "b89356d62d3fb25c453a111cb24353dd85225c55", "title": "Design and Analysis of a Processing-in-DIMM Join Algorithm: A Case Study with UPMEM DIMMs"}, {"paperId": "4d2be7d4f3f797a32805362de585e572ec36a1bb", "title": "TransPimLib: A Library for Efficient Transcendental Functions on Processing-in-Memory Systems"}, {"paperId": "e2b920c623dd1b00577fee7f081c13b047025141", "title": "TransPimLib: Efficient Transcendental Functions for Processing-in-Memory Systems"}, {"paperId": "2d8a061ad65ecd81296c7d64822e778f904c7f25", "title": "Analysis of Conventional, Near-Memory, and In-Memory DNN Accelerators"}, {"paperId": "06444c5756a513124b35300d1374f0e34df12990", "title": "Evaluating Machine LearningWorkloads on Memory-Centric Computing Systems"}, {"paperId": "249438ec45356dc02a324aa816bc69b1f80367e9", "title": "DIMM-Link: Enabling Efficient Inter-DIMM Communication for Near-Memory Processing"}, {"paperId": "f6774d2f0b465e6624605d087bbc386c7b694712", "title": "CINM (Cinnamon): A Compilation Infrastructure for Heterogeneous Compute In-Memory and Compute Near-Memory Paradigms"}, {"paperId": "a593ac76eb47c211fbc0ccd010c07ad5f74a331d", "title": "PIM-tree: A Skew-resistant Index for Processing-in-Memory"}, {"paperId": "5be7859c83248307d0efaad13874cba9c8880fce", "title": "Accelerating Time Series Analysis via Processing using Non-Volatile Memories"}, {"paperId": "f9866033653abe02d6ca7d953aa832fbbd2febbf", "title": "NearPM: A Near-Data Processing System for Storage-Class Applications"}, {"paperId": "65aca345ce657182e1ae3e5e82616849435a56d2", "title": "Evaluating HPC Kernels for Processing in Memory"}, {"paperId": "5d2619fc1c92f32b6551235425711bc57879e2b0", "title": "CIMulator: A Computing in Memory Emulator Framework"}, {"paperId": "dda5728ddca81df3721744f1441ee8302c075456", "title": "Accelerating Neural Network Inference With Processing-in-DRAM: From the Edge to the Cloud"}, {"paperId": "9821eabce5c4b9a23576364a0b44a55edd8233f1", "title": "Implementation and Evaluation of Deep Neural Networks in Commercially Available Processing in Memory Hardware"}, {"paperId": "9f5cb9a9ba0ed7761f31f0cba525847939f6f84a", "title": "Protecting On-Chip Data Access Against Timing-Based Side-Channel Attacks on Multicores"}, {"paperId": "7e3b8a70d72a0ba4c7f189991d912822a1f2959d", "title": "ProbGraph: High-Performance and High-Accuracy Graph Mining with Probabilistic Set Representations"}, {"paperId": "5d2b2199328708baf4372b6d317c811302b3e877", "title": "A Fresh Perspective on DNN Accelerators by Performing Holistic Analysis Across Paradigms"}, {"paperId": "a4a80e375b3acc4ea7b09bd7c9c3b3e02e3fbb54", "title": "A framework for high-throughput sequence alignment using real processing-in-memory systems"}, {"paperId": "23c9e2c55b0fcfb3d406c5e93c13853d040a82ba", "title": "RNA-seq Quantification on Processing in memory Architecture: Observation and Characterization"}, {"paperId": "e827a686216beadd08a5d2840c24ed470e521a94", "title": "An Experimental Evaluation of Machine Learning Training on a Real Processing-in-Memory System"}, {"paperId": "dfd70befe6cc1724386c21682d99fb9299feff1f", "title": "HybriDS: Cache-Conscious Concurrent Data Structures for Near-Memory Processing Architectures"}, {"paperId": "2aee1899e87c3bc8cd9af32001d1550abc373551", "title": "SparseP: Efficient Sparse Matrix Vector Multiplication on Real Processing-In-Memory Architectures"}, {"paperId": "036f2336db908986ba83082641423ad1da234b9d", "title": "Machine Learning Training on a Real Processing-in-Memory System"}, {"paperId": "1d2a69b5f4d7d32e05e1e663a592d1e7943a8031", "title": "Towards Efficient Sparse Matrix Vector Multiplication on Real Processing-In-Memory Architectures"}, {"paperId": "38e4f6716329feb8d70b9336bd8ccd9666ba4077", "title": "Bulk JPEG decoding on in-memory processors"}, {"paperId": "35592c445d2e6adeb1c43ed5b25700b544188954", "title": "Exploiting Near-Data Processing to Accelerate Time Series Analysis"}, {"paperId": "67b1e1eeb5d7af8ea7d880cd561b81d85d89144b", "title": "Heterogeneous Data-Centric Architectures for Modern Data-Intensive Applications: Case Studies in Machine Learning and Databases"}, {"paperId": "b83439573935033e7af5a8eb6a561e813e3b2839", "title": "Methodologies, Workloads, and Tools for Processing-in-Memory: Enabling the Adoption of Data-Centric Architectures"}, {"paperId": "8018a561d2ed821cfb4be7ce04993cabf9932c2f", "title": "Parallel and Distributed Graph Neural Networks: An In-Depth Concurrency Analysis"}, {"paperId": "4eac0fca0e861e56f502f348c3c0e024e0960c42", "title": "Polynesia: Enabling High-Performance and Energy-Efficient Hybrid Transactional/Analytical Databases with Hardware/Software Co-Design"}, {"paperId": "39f74f26853ccc34bfe5485e4d78219ed317d0e6", "title": "Enabling High-Performance and Energy-Efficient Hybrid Transactional/Analytical Databases with Hardware/Software Cooperation"}, {"paperId": "9f4ed3ba3bbdf48637ac48206882cc357396e9d1", "title": "High-throughput Pairwise Alignment with the Wavefront Algorithm using Processing-in-Memory"}, {"paperId": "9fc0eb78461f7b22c079da879f36064500a2f9f1", "title": "Towards Efficient Sparse Matrix Vector Multiplication on Real Processing-In-Memory Systems"}, {"paperId": "cbf4d8928e9d55a03575fd752dcf9eeefcfbe0e3", "title": "SparseP"}, {"paperId": "ef58a34c000f5f7cc4329d03641481342b830a84", "title": "SparseP: Towards Efficient Sparse Matrix Vector Multiplication on Real Processing-In-Memory Systems"}, {"paperId": "2d96f79f33af42a75a9e6d8b6eb0dfc675b914e3", "title": "Casper: Accelerating Stencil Computations Using Near-Cache Processing"}, {"paperId": "aa97d9f856e51f27ea59751a37bf5aca5fa59a5b", "title": "Energy-Efficient Deflection-based On-chip Networks: Topology, Routing, Flow Control"}, {"paperId": "7b78d629c823f6345343cce85a11f3d95aa4ac3e", "title": "Benchmarking Memory-Centric Computing Systems: Analysis of Real Processing-In-Memory Hardware"}, {"paperId": "2a47d481636a67bf1edbd2bcd73d823e69bc4c75", "title": "Accelerating Weather Prediction Using Near-Memory Reconfigurable Fabric"}, {"paperId": "893a75dabd6f69070b15ffd20ba2273d81f7bf8c", "title": "FPGA-Based Near-Memory Acceleration of Modern Data-Intensive Applications"}, {"paperId": "8e85281351edfd13081f1175fb102836ccc4baca", "title": "DAMOV: A New Methodology and Benchmark Suite for Evaluating Data Movement Bottlenecks"}, {"paperId": "7a210280d4775b1dfb36401a1007ac57602ab1e5", "title": "pLUTo: Enabling Massively Parallel Computation in DRAM via Lookup Tables"}, {"paperId": "5984a0b6957b0e9ed8b030c3784f3ec367fbfd8c", "title": "SISA: Set-Centric Instruction Set Architecture for Graph Mining on Processing-in-Memory Systems"}, {"paperId": "7bb6015f45457fdbe3bb39e17dc9cb0786ecd688", "title": "A Modern Primer on Processing in Memory"}, {"paperId": "084809bcb66911c8cef94879311beb96d11bc6a6", "title": "Benchmarking a New Paradigm: Experimental Analysis and Characterization of a Real Processing-in-Memory System"}, {"paperId": "4525aa1a03d4a5f3ee41cad036bb812afade30c1", "title": "Partitioned Persist Ordering"}, {"paperId": "12a74ede42a9772db96dbc92c05f64a9ddeaaa35", "title": "Data Structures for Modern Memory and Storage Hierarchies (Dagstuhl Seminar 21283)"}, {"paperId": "51d3e43e070ded0d7b46d0ae61ec63b87dd352c9", "title": "Edinburgh Research Explorer UNIFICO: Thread Migration in Heterogeneous-ISA CPUs without State Transformation"}]}
