{"paperId": "8e94078915518454a7ee87d90f1470bd7e65bd50", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "The Need for Cybersecurity in Industrial Revolution and Smart Cities", "abstract": "Cities have grown in development and sophistication throughout human history. Smart cities are the current incarnation of this process, with increased complexity and social importance. This complexity has come to involve significant digital components and has thus come to raise the associated cybersecurity concerns. Major security relevant events can cascade into the connected systems making up a smart city, causing significant disruption of function and economic damage. The present paper aims to survey the landscape of scientific publication related to cybersecurity-related issues in relation to smart cities. Relevant papers were selected based on the number of citations and the quality of the publishing journal as a proxy indicator for scientific relevance. Cybersecurity will be shown to be reflected in the selected literature as an extremely relevant concern in the operation of smart cities. Generally, cybersecurity is implemented in actual cities through the concerted application of both mature existing technologies and emerging new approaches.", "venue": "Italian National Conference on Sensors", "year": 2022, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2022-12-23", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "23"}, "authors": [{"authorId": "67202332", "name": "Antonio Clim"}, {"authorId": "37810962", "name": "Andrei Toma"}, {"authorId": "1864544", "name": "R. Zota"}, {"authorId": "2073745480", "name": "Radu Constantinescu"}], "citations": [{"paperId": "a7ea5f5dee631404455863718afed9b44ed7183c", "title": "SECURING THE SMART CITY: A REVIEW OF CYBERSECURITY CHALLENGES AND STRATEGIES"}, {"paperId": "5ba6e0de342a97519c9543acdbc4cda8bb4b2dd1", "title": "Research Progress of Acoustic Energy Harvesters Based on Nanogenerators"}, {"paperId": "6be7cb24eaa894a8c9c9bf47f44d478cf4f931eb", "title": "Enhancing Software Reliability Forecasting Through a Hybrid ARIMA-ANN Model"}, {"paperId": "35b6519bd5447a65c7319c4526de10070440afb4", "title": "Collaborative Robots and Cyber Security in Industry 5.0"}, {"paperId": "267b7f9c3da9e02835bfd5ed377f3d59b9acb6f8", "title": "Smart Contracts for Managing the Chain-of-Custody of Digital Evidence: A Practical Case of Study"}]}
