{"paperId": "8ea331e78d6990cc6827c71cb66cb6a43bfca0f3", "publicationVenue": {"id": "99026156-eedd-4e3c-9797-a7eca6658ad3", "name": "IEEE International Conference on Cognitive Infocommunications", "type": "conference", "alternate_names": ["CogInfoCom", "IEEE Int Conf Cogn Infocommunications"]}, "title": "Healthcare Framework for Smarter Cities with bio-sensory data", "abstract": "In recent years, innovations that occurred in technology caused an evolution in computational and communicational areas. These advancements allowed us to apply some capabilities of smartphones, smart devices, and wearable devices as well. Sensory data, produced by smart devices are essential for implementing a cognitive, scalable, autonomous, and extensible Smart City architecture. Based on it, we propose an architecture which could extend Smart City solutions in a way that recognizes new data sources and applies data categorization rules without introducing any side effects for maintenance while protecting data privacy definition that complies with the GDPR and providing an anonymized data repository that is publicly available for the client consumption to further produce useful, value-added data based on analytics. Considering the evolution of smart devices, it becomes a necessity to provide an architecture definition such as microservice orchestration that allows an easier adaption of new data types and domain requirements to keep the ever-maintainable state of the Smart City architecture in a technology-agnostic fashion. Our paper shows a small fragment of this field on a focus on eHealth.", "venue": "IEEE International Conference on Cognitive Infocommunications", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-09-23", "journal": {"name": "2020 11th IEEE International Conference on Cognitive Infocommunications (CogInfoCom)", "pages": "000337-000342"}, "authors": [{"authorId": "1453306891", "name": "Emirhan Enler"}, {"authorId": "3431600", "name": "István Péntek"}, {"authorId": "2977194", "name": "A. Adamkó"}], "citations": [{"paperId": "b2aa4a9a2b1c1cc05851b59e82d169e4a4c89fab", "title": "A Comparative Study of Monolithic and Microservices Architectures in Machine Learning Scenarios"}, {"paperId": "442abe05a6afe245ee17c63873ae97ecdde9d40d", "title": "Evaluation of Modern Smart Cities in South Asian Countries: Advanced Applications of Internet of Things (IoT)"}, {"paperId": "348d97b7faf23c0b1ffb2ba7d4391f7f85231537", "title": "Integrating Data Mining Methods Across all Domains of a Smart City"}, {"paperId": "92041ceccd7bb6f1058cbabb9b34daa1dfc941b1", "title": "Federated Learning enabled Digital Twins for smart cities: Concepts, recent advances, and future directions"}, {"paperId": "33146c3c1039f1c3e64dd00516816227b5af7faf", "title": "Evaluating Service-Oriented and Microservice Architecture Patterns to Deploy eHealth Applications in Cloud Computing Environment"}, {"paperId": "79c0b0a739a75fafab43c5f23594bc158d9ad8cd", "title": "Cognitive Pervasive Service Composition Applied to Predatory Crime Deterrence"}, {"paperId": "f7f1204f6aa9f14c4babb15a59846ab886dcb69f", "title": "Enhanced Living Environments (ELE): A Paradigm Based on Integration of Industry 4.0 and Society 5.0 Contexts with Ambient Assisted Living (AAL)"}]}
