{"paperId": "8ea4d4a500e3109bd1ee2bc07db317b76006d6dd", "publicationVenue": {"id": "ccd8e532-73c6-414f-bc91-271bbb2933e2", "name": "Electronics", "type": "journal", "issn": "1450-5843", "alternate_issns": ["2079-9292", "0883-4989"], "url": "http://www.electronics.etfbl.net/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-247562", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-247562", "https://www.mdpi.com/journal/electronics"]}, "title": "An Indoor Multi-Environment Sensor System Based on Intelligent Edge Computing", "abstract": "Monitoring and predicting the environment in an indoor space plays an important role in securing big data and detecting abnormal conditions in the industrial environment and living space. This study proposes an indoor multi-environment sensor system based on intelligent edge computing that collects and predicts environmental data. The system collects data using 14 types of environmental sensors and object detection technology models and implements a model that predicts indoor air quality based on the bi-directional LSTM network. The trained model shows high performance in predicting indoor air quality (IAQ) factors, such as CO2, PM2.5, and total volatile organic compounds (TVOC). The indoor multi-environment sensor system based on intelligent edge computing is available for data collection and environmental prediction in various spaces without restrictions on specific locations. This study proposes an integrated approach with various functions by applying edge computing to indoor environment monitoring. We verify the proposed system through various experiments.", "venue": "Electronics", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-12-28", "journal": {"name": "Electronics"}, "authors": [{"authorId": "2110145170", "name": "M. Kim"}, {"authorId": "46760211", "name": "Taehyeong Kim"}, {"authorId": "2107941494", "name": "Seho Park"}, {"authorId": "49564299", "name": "Kyungtaek Lee"}], "citations": [{"paperId": "716b3e32f3e887c0e6d7164d87f28e2bf072aff0", "title": "Towards Federated Learning and Multi-Access Edge Computing for Air Quality Monitoring: Literature Review and Assessment"}, {"paperId": "3137abf8294553a56a69ab6eb00126ea881d69d7", "title": "Artificial Intelligence Techniques for Electronics"}, {"paperId": "b2518a3fbfc57041f717b1bba6732afcf986e646", "title": "Artificial Intelligence (AI) and Internet of Things (IoT) - based sensors for monitoring and controlling in architecture, engineering, and construction: applications, challenges, and opportunities"}]}
