{"paperId": "8eb3a3b68f5a34f5bed11de06508b44f671ca98b", "publicationVenue": {"id": "d2423c06-c1fe-458d-bf8a-cc24aefe3f59", "name": "International Conference on Future Internet of Things and Cloud", "type": "conference", "alternate_names": ["FiCloud", "Int Conf Future Internet Thing Cloud"]}, "title": "On the Cost of the Management of user Applications in a Multicloud Environment", "abstract": "Multi-cloud solutions are becoming increasingly popular among enterprises and, today, it is easy to find organizations that use resources and services belonging to two or more cloud providers. It is well-known that the adoption of a multi-cloud infrastructure provides several advantages: it limits vendor lock-in and/or dependence on a single provider, enables cost reduction, grants the access to a wide variety of services and computational resources and allows the exploitation of the geographical location of the servers (e.g., to be consistent with data compliance policies). These advantages, however, have a cost in terms of greater complexity in resources' configuration and management: e.g., security policies have to be adapted and made consistent among all the different cloud providers. This complexity implies that most of the companies that use a multi-cloud infrastructure manage the resources belonging to different providers as independent and autonomous, exploiting only a portion of the advantages that could be benefited if those resources were used in an integrated and optimized way. In this paper, we will describe and discuss some of the aspects related to the inter-networking among resources belonging to multiple providers, a necessary and fundamental step towards a strong integration among different clouds.", "venue": "International Conference on Future Internet of Things and Cloud", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-08-01", "journal": {"name": "2019 7th International Conference on Future Internet of Things and Cloud (FiCloud)", "pages": "175-181"}, "authors": [{"authorId": "144998586", "name": "G. Modica"}, {"authorId": "1703176", "name": "A. Stefano"}, {"authorId": "49792148", "name": "G. Morana"}, {"authorId": "1725309", "name": "O. Tomarchio"}], "citations": []}
