{"paperId": "8eb4ad9b2bc21e2ac169313cfc16da5e88654ab7", "publicationVenue": {"id": "75d7a8c1-d871-42db-a8e4-7cf5146fdb62", "name": "Social Science Research Network", "type": "journal", "alternate_names": ["SSRN, Social Science Research Network (SSRN) home page", "SSRN Electronic Journal", "Soc Sci Res Netw", "SSRN", "SSRN Home Page", "SSRN Electron J", "Social Science Electronic Publishing presents Social Science Research Network"], "issn": "1556-5068", "url": "http://www.ssrn.com/", "alternate_urls": ["www.ssrn.com/", "https://fatcat.wiki/container/tol7woxlqjeg5bmzadeg6qrg3e", "https://www.wikidata.org/wiki/Q53949192", "www.ssrn.com/en", "http://www.ssrn.com/en/", "http://umlib.nl/ssrn", "umlib.nl/ssrn"]}, "title": "Data-Driven Revenue Management: The Interplay of Data, Model, and Decision", "abstract": "Revenue management (RM) is the application of analytical methodologies and tools that predict consumer behavior and optimize product availability and prices to maximize a firm’s revenue or profit. In the last decade, data has been playing an increasingly crucial role in business decision making. As firms rely more on collected or acquired data to make business decisions, it brings opportunities and challenges to the RM research community. In this review paper, we systematically categorize the related literature by how a study is “driven” by data and focus on studies that explore the interplay between two or three of the elements: data, model, and decisions, in which the data element must be present. Specifically, we cover five data-driven RM research areas, including inference (data to model), predict then optimize (data to model to decisions), online learning (data to model to decisions to new data in a loop), end-to-end decision making (data directly to decisions), and experimental design (decisions to data to model). Finally, we point out future research directions. Funding: The research of N. Chen is partly supported by Natural Sciences and Engineering Research Council of Canada Discovery [Grant RGPIN-2020-04038]. The research of M. Hu is in part supported by Natural Sciences and Engineering Research Council of Canada [Grant RGPIN-2021-04295].", "venue": "Social Science Research Network", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2023-03-10", "journal": {"name": "SSRN Electronic Journal"}, "authors": [{"authorId": "2959816", "name": "Ningyuan Chen"}, {"authorId": "2163377900", "name": "Mingya Hu"}], "citations": [{"paperId": "c2ad822fd5fe14545a207385c40a8da835181c31", "title": "Loss Functions for Discrete Contextual Pricing with Observational Data"}]}
