{"paperId": "8ee0d23b80d89ae803ab67d3ebc7509958187ffb", "publicationVenue": null, "title": "The Practical Model DAM for Analyzing Data Lake Architectures in a Financial Institution in Peru", "abstract": "As the volume of data generated in the financial sector continues to grow organizations are challenged to effectively manage this vast amount of information. However, the implementation of a technological solution, especially in highly regulated financial environments with stringent security and privacy requirements, does not achieve the expected result. This study proposes a novel model, called DAM (Data Lake Analysis Model), to analyze the implemented Data Lake architecture of a Peruvian financial institution in order to identify opportunities for improvement and close the gaps that may arise in the management of large volumes of data. This methodology consists of 3 levels: (1) data and internal process analysis, (2) architecture and tools analysis, and (3) data governance analysis. A case study was conducted in a financial institution, and interviews and questionnaires were conducted with analysts and data scientists. The results at the three levels of analysis were very positive, with scores of 4.33, 4.06, and 4.11, respectively. In addition, the results of the questionnaire indicate that the experts rated the analysis as “good”, suggesting that the DAM model is effective in addressing the challenges of financial data management in the Peruvian context.", "venue": "2023 International Conference on Electrical, Computer and Energy Technologies (ICECET)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-11-16", "journal": {"name": "2023 International Conference on Electrical, Computer and Energy Technologies (ICECET)", "pages": "1-6"}, "authors": [{"authorId": "2280464330", "name": "Cristhian Zaña Ramirez"}, {"authorId": "2280843730", "name": "Sergio Benancio Mauricio"}, {"authorId": "2268069042", "name": "Lenis Wong"}], "citations": []}
