{"paperId": "8ee09969b3b01a1f05230ac1d8eb540eed582358", "publicationVenue": {"id": "4c2b8cb8-e51c-4ece-9122-89595989b56f", "name": "European Symposium on Security and Privacy", "type": "conference", "alternate_names": ["EuroS&P", "IEEE European Symposium on Security and Privacy", "Eur Symp Secur Priv", "IEEE Eur Symp Secur Priv", "EUROS&P"]}, "title": "CostCO: An automatic cost modeling framework for secure multi-party computation", "abstract": "The last decade has seen an explosion in the number of new secure multi-party computation (MPC) protocols that enable collaborative computation on sensitive data. No single MPC protocol is optimal for all types of computation. As a result, researchers have created hybrid-protocol compilers that translate a program into a hybrid protocol that mixes different MPC protocols. Hybrid-protocol compilers crucially rely on accurate cost models, which are handwritten by the compilers' developers, to choose the correct schedule of protocols. In this paper, we propose CostCO, the first automatic MPC cost modeling framework. CostCO develops a novel API to interface with a variety of MPC protocols, and leverages domain-specific properties of MPC in order to enable efficient and automatic cost-model generation for a wide range of MPC protocols. CostCO employs a two-phase experiment design to efficiently synthesize cost models of the MPC protocol's runtime as well as its memory and network usage. We verify CostCO's modeling accuracy for several full circuits, characterize the engineering effort required to port existing MPC protocols, and demonstrate how hybrid-protocol compilers can leverage CostCO's cost models.", "venue": "European Symposium on Security and Privacy", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-06-01", "journal": {"name": "2022 IEEE 7th European Symposium on Security and Privacy (EuroS&P)", "pages": "140-153"}, "authors": [{"authorId": "2073461077", "name": "Vivian Fang"}, {"authorId": "2116861508", "name": "Lloyd Brown"}, {"authorId": "1851601", "name": "William Lin"}, {"authorId": "2152934594", "name": "Wenting Zheng"}, {"authorId": "3169583", "name": "Aurojit Panda"}, {"authorId": "144963510", "name": "Raluca A. Popa"}], "citations": [{"paperId": "0300397a880405a8ae44f9625ad5c8a4811d19ea", "title": "COMBINE: COMpilation and Backend-INdependent vEctorization for Multi-Party Computation"}, {"paperId": "9b205cc73002642c472d538513360d66bed89ed0", "title": "Arboretum: A Planner for Large-Scale Federated Analytics with Differential Privacy"}, {"paperId": "d2f9c4a94ba68e86dc80ce01c17761e02985736d", "title": "FUSE – Flexible File Format and Intermediate Representation for Secure Multi-Party Computation"}, {"paperId": "6935413ae8984df22d5985f91024ff3f0b7c8ce1", "title": "Silph: A Framework for Scalable and Accurate Generation of Hybrid MPC Protocols"}, {"paperId": "f036683a3ec6dced55f7b3e3560cc57ca55ebc78", "title": "CoVault: A Secure Analytics Platform"}, {"paperId": "c44b5d8c79f98dd9dfc840e8f2434ed1346ad93e", "title": "Compilation and Backend-Independent Vectorization for Multi-Party Computation"}, {"paperId": "0342f5b2e070dcdc62bbf4da4e44c4073d534949", "title": "SECRECY: Secure collaborative analytics in untrusted clouds"}, {"paperId": "add0d9f8075069bc09208b4d777647a69f799582", "title": "Secure Noise Sampling for DP in MPC with Finite Precision"}, {"paperId": "ffa4db6030c13ef23a40446a8e08cf4ffc4fad38", "title": "Compilation and Backend-Independent Vectorization for Multi-Party Computation (Extended Version)"}, {"paperId": "7a7cb1b069b3f8257011d70ec2ca213561832fab", "title": "Compilation and Backend-Independent Vectorization for Multi-Party Computation (Extended Version)"}]}
