{"paperId": "8eefa3a017f238699b56abfe6a1d03f26e9a917d", "publicationVenue": {"id": "bb21160f-0f31-4e34-abab-715b95a870a2", "name": "Indonesian Journal of Electrical Engineering and Computer Science", "type": "journal", "alternate_names": ["Indones J Electr Eng Comput Sci"], "issn": "2502-4752", "url": "http://www.iaescore.com/journals/index.php/IJEECS"}, "title": "A functional framework based on big data analytics for smart farming", "abstract": "Big data in agriculture is defined as massive volumes of data with a wide variety of sources and types which can be captured using internet of things sensors (soil and crops sensors, drones, and meteorological stations), analyzed and used for decision-making. In the era of internet of things (IoT) tools, connected agriculture has appeared. Big data outputs can be exploited by the future connected agriculture in order to reduce cost and time production, improve yield, develop new products, offer optimization and smart decision-making. In this article, we propose a functional framework to model the decision-making process in digital and connected agriculture.", "venue": "Indonesian Journal of Electrical Engineering and Computer Science", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-12-01", "journal": {"name": "Indonesian Journal of Electrical Engineering and Computer Science"}, "authors": [{"authorId": "1396659028", "name": "Loubna Rabhi"}, {"authorId": "2634624", "name": "N. Falih"}, {"authorId": "2100891221", "name": "Lekbir Afraites"}, {"authorId": "3000461", "name": "B. Bouikhalene"}], "citations": [{"paperId": "f47f03c92e2f108a217a6e9e941b9501e8473f52", "title": "Intelligent agriculture system using low energy and based on the use of the internet of things"}, {"paperId": "9c0ac7646d1c5b9003d833d13399542b20e90e61", "title": "Impact of mulching and planting time on spring-wheat (Triticum aestivum) growth: A combined field experiment and empirical modeling approach"}, {"paperId": "7f28070f247311f5f38bd1a907341abca62f544d", "title": "Challenges in big data adoption for Malaysian organizations: a review"}, {"paperId": "d9dee6e3f081565696900f6516c1f71c406b1778", "title": "Agriculture 4.0: Literature Review and Application Challenges in the “Beni Mellal-Khenifra” region"}, {"paperId": "55fa477c4b9da9f8e7ebd1a99e879659e8d2aab7", "title": "Emerging Technological Methods for Effective Farming by Cloud Computing and IoT"}]}
