{"paperId": "8efa353bf9505a4bbb4c7ac5f49a596fb0b4b955", "publicationVenue": {"id": "21182d65-bf3b-462a-878d-62b8dc0d8fef", "name": "EAI Endorsed Transactions on Context-aware Systems and Applications", "alternate_names": ["EAI Endorsed Trans Context Syst Appl"], "issn": "2409-0026", "url": "http://eai.eu/transaction/context-aware-systems-and-applications", "alternate_urls": ["https://eudl.eu/journal/casa"]}, "title": "Integration and Recommendation System of Profiles based on Professional Social Networks", "abstract": "The aim of our investigation is to personalize bilateral recommendation of job-related proposals based on existing professional social networks. In a context where the points of view of job seekers and employers can be contradictory, our approach consists in trying to bring the both in a best possible matching. To this end, we propose an integration system that gives a minimum of credit to the users’ data in order to facilitate the discovery of relevant proposals based on the users’ behaviors, on the characteristics of the proposals and on possible relationships. The main contribution is the proposal of an architecture for the recommendation of profiles and job offers including social and administrative factors. The particularity of our approach lies in the freedom from the recommendation problem by using metrics proven in the literature for the estimation of similarity rates. We have used these metrics as default values to appropriate data dimensions. It emerges that, the user’s behavior is exclusively responsible for the recommendations. However, the cross-analysis of randomly generated behaviors on real profiles collected on Cameroonian sites dedicated to job offers, shows the influence of the most active users. But, for requests via the search bar (interface with the script respecting the path of our architecture) the central subject remains the user. Our current work is limited by a data set that is not very representative of changing socio-economic conditions.", "venue": "EAI Endorsed Transactions on Context-aware Systems and Applications", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-01-15", "journal": {"name": "EAI Endorsed Transactions on Context-aware Systems and Applications"}, "authors": [{"authorId": "2281842724", "name": "Paul Dayang"}, {"authorId": "2287587846", "name": "Ulriche Mbouche Bomda"}], "citations": []}
