{"paperId": "8f0f002b97df3bfab6330a35a1eea6654369ca31", "publicationVenue": null, "title": "Towards a big data analytics platform with Hadoop/MapReduce framework using simulated patient data of a hospital system", "abstract": "Database (DAD) metadata profiles including workflow steps carried out on a regular basis by VIHA staff only. Med2020 WinRecs abstraction software is used to abstract data based on dictionaries and data standards, accordingly. Figure 6. The main components of our Healthcare Big Data Analytics (HBDA) platform that were envisioned by stakeholders and derived from research team. There are numerous reasons why the BDA platform did not use real patient data. Firstly, the process of Ethics and Research Capacity at VIHA for approval for the entire patient data of the hospital system is not possible without existing system and total security/privacy testing. Secondly, it is not possible to piece together summarized data specific to health outcomes because this data has already been summarized and no benefit to VIHA, and, therefore, Ethics will not approve. Thirdly, in a real setting the data will have to be moved or migrated off of the production architecture to avoid using and consuming network resources in use in the hospital. Fourthly, real data in the data warehouse at VIHA will require several months to review and develop the solution to use big data technologies, which is not available. Fifthly, the platform Big Data Analytics in Healthcare Generated Patient Data: •Validation •Integration •Replication HBDA Patient and Hospital Applications and Visualization: Interface Systems Actions and Filters: Query Performance, Benchmarking for Healthcare noSQL Database: Indexed qualifiers, Management, Data Integrity and Access", "venue": "", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": null, "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "2065410", "name": "D. Chrimes"}], "citations": [{"paperId": "a0cb3416c4fb89cf064ec4001bcc150e79ae20c5", "title": "Improving Usability, Safety and Patient Outcomes with Health Information Technology - From Research to Practice, Information Technology and Communications in Health Conference, ITCH 2019, Victoria, BC, Canada, 14-17 February 2019"}]}
