{"paperId": "8f1acde3b9d7f3983c8d928a36a85776b0d33ad6", "publicationVenue": {"id": "c60f6e64-434b-4c82-931d-faefcb362d4c", "name": "IFIP International Information Security Conference", "type": "conference", "alternate_names": ["Symp Edge Comput", "Symposium on Edge Computing", "Inf Secur", "Information Security", "IFIP Int Inf Secur Conf", "SEC"], "url": "http://www.tc11.uni-frankfurt.de/", "alternate_urls": ["https://acm-ieee-sec.org"]}, "title": "AggNet: Cost-Aware Aggregation Networks for Geo-distributed Streaming Analytics", "abstract": "Large-scale real-time analytics services continuously collect and analyze data from end-user applications and devices distributed around the globe. Such analytics requires data to be transferred over the wide-area network (WAN) to data centers (DCs) capable of processing the data. Since WAN bandwidth is expensive and scarce, it is beneficial to reduce WAN traffic by partially aggregating the data closer to end-users. We propose aggregation networks for performing aggregation on a geo-distributed edge-cloud infrastructure consisting of edge servers, transit and destination DCs. We identify a rich set of research questions aimed at reducing the traffic costs in an aggregation network. We present an optimization formulation for solving these questions in a principled manner, and use insights from the optimization solutions to propose an efficient, near-optimal practical heuristic. We implement the heuristic in AggNet, built on top of Apache Flink. We evaluate our approach using a geo-distributed deployment on Amazon EC2 as well as a WAN-emulated local testbed. Our evaluation using real-world traces from Twitter and Akamai shows that our approach is able to achieve 47% to 83% reduction in traffic cost over existing baselines without any compromise in timeliness.", "venue": "IFIP International Information Security Conference", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-12-01", "journal": {"name": "2021 IEEE/ACM Symposium on Edge Computing (SEC)", "pages": "297-311"}, "authors": [{"authorId": "2109402853", "name": "Dhruv Kumar"}, {"authorId": "2109915870", "name": "Sohaib Ahmad"}, {"authorId": "144114650", "name": "A. Chandra"}], "citations": [{"paperId": "17dd9ffb8ad93868de465e6d3ba30dfd8d4aa45d", "title": "Janus: Latency-Aware Traffic Scheduling for IoT Data Streaming in Edge Environments"}, {"paperId": "7e18f02a7097b8a56182a44dbe243a10b11f95cf", "title": "DAG-Aware Optimization for Geo-Distributed Data Analytics"}, {"paperId": "57a5677c71c6e3734476c8ca1a16fad58ff86d51", "title": "Fast Prototyping of Distributed Stream Processing Applications with stream2gym"}, {"paperId": "fe81557cb5e2d67303528f0139f75daf300334ba", "title": "AggFirstJoin: Optimizing Geo-Distributed Joins using Aggregation-Based Transformations"}, {"paperId": "e826268209f603e176688ea91e2200ad0252c19b", "title": "Query Latency Optimization by Resource-Aware Task Placement in Fog"}, {"paperId": "eb4f4c96430b41a81bd6a8be1ee3ee7d436d11e0", "title": "SDN-enabled Resource Provisioning Framework for Geo-Distributed Streaming Analytics"}, {"paperId": "4cfb281b959f257374cb60f5a3e86893a7a938ca", "title": "Efficient Transmission and Reconstruction of Dependent Data Streams via Edge Sampling"}, {"paperId": "8ba46047a9a8818b415472a7f83b0e579c479e98", "title": "Think before you shuffle: data-driven shuffles for geo-distributed analytics"}, {"paperId": "c6002247dee39ff91db2b646d8f2dd375cbb0a43", "title": "Towards WAN-aware join sampling over geo-distributed data"}]}
