{"paperId": "8f1c469c1aa35a39e71c8b3f62343e96a1ca3d3e", "publicationVenue": null, "title": "Digital twins in agri-food : Societal and ethical themes and questions for further research", "abstract": "ABSTRACT Digital Twins are computational representations of both living and non-living entities and processes, which can be used to analyse and simulate interventions in these entities and processes. When developing Digital Twins, it is important to anticipate on the societal, ethical and safety impacts they may have. Since in the agri-food domain Digital Twins are still in its infancy, it is possible to include societal values from the beginning onwards, during the research and development process. In this paper, we present four themes (i.e. resources, representations, actions and implementations) to organise the anticipation of and reflection on potential impacts of Digital Twins in the agri-food domain. Using insights from the smart farming literature, we assess for each theme which issues and questions require further research and attention, in order to develop an agenda for responsible research and innovation on Digital Twins.", "venue": "", "year": 2021, "fieldsOfStudy": ["Sociology"], "publicationTypes": null, "publicationDate": "2021-01-01", "journal": {"name": "NJAS: Impact in Agricultural and Life Sciences", "pages": "98 - 125", "volume": "93"}, "authors": [{"authorId": "35184482", "name": "S. van der Burg"}, {"authorId": "66494690", "name": "S. Kloppenburg"}, {"authorId": "3175099", "name": "E. Kok"}, {"authorId": "33743631", "name": "M. van der Voort"}], "citations": [{"paperId": "e98d696decc174acea771c232104fe2d44155795", "title": "Food Passports and Intelligent Food Recipes: The Data-Oriented Way of Producing Food"}, {"paperId": "d8ee7a79cae542b8474d14f6c37cc3f5d423998d", "title": "A comprehensive survey on digital twin for future networks and emerging Internet of Things industry"}, {"paperId": "e68b0066d0d6ecd72015ebea451a929d38cd2974", "title": "Reduction of Losses and Wastage in Seafoods: The Role of Smart Tools and Biosensors Based on Artificial Intelligence"}, {"paperId": "b6ed0590d4d1e2f73c8b9295be1acdc08bb20b5a", "title": "Nachhaltige Digitale Zwillinge in der Landwirtschaft"}, {"paperId": "c38b1ba3191384e7e52ea0c8765322238eeb5ae5", "title": "Smart Fruit Growing Through Digital Twin Paradigm: Systematic Review and Technology Gap Analysis"}, {"paperId": "f5a9b13f70128d1acca7def729b62167cb826585", "title": "Metaverse and microorganism digital twins: A deep transfer learning approach"}, {"paperId": "b95ac76d8216e556adb69413eab944ee7b1aa96b", "title": "Social and ethical implications of data and technology use on farms: a qualitative study of Swedish dairy and pig farmers"}, {"paperId": "0ffabb6d7bdf6c8713c4d98058ac674c4b23ab79", "title": "Analyzing the Implementation of Digital Twins in the Agri-Food Supply Chain"}, {"paperId": "0f5ef36c4bb47b4a154c910e3d9b9342ea382345", "title": "Digital Twins in the Marine Industry"}, {"paperId": "a416cb753c6f1a35404a91af896f21a685e7d434", "title": "Digital Twins in agriculture: challenges and opportunities for environmental sustainability"}, {"paperId": "f284f886fbf57c0b105b35ed47dfe92383fa7843", "title": "Robotization and intelligent digital systems in the meat cutting industry: From the perspectives of robotic cutting, perception, and digital development"}, {"paperId": "f4d326d69d6558bdc80cde1012d5283fc3427e5e", "title": "Opportunities and perspectives of the digital twins’ conception: the case in agriculture"}, {"paperId": "a3a2d2f9fe540fd48fcc38cbd3d1a69400d9dbc7", "title": "Digital revolution for the agroecological transition of food systems: A responsible research and innovation perspective"}, {"paperId": "f30cbd4e1a4f6095407a52923fb6901652799af1", "title": "Digital twins in the green life sciences"}, {"paperId": "573daa5de46b4fa52c2f8cc4e28a50c39f22d7f2", "title": "The fourth industrial revolution in the food industry—Part I: Industry 4.0 technologies"}, {"paperId": "14af81e14689e04c43b822c24e6e66dfbfccf785", "title": "Digital twinning as an act of governance in the wind energy sector"}, {"paperId": "679884bf55e81e802988aceac01488b7c55a1a7b", "title": "Toward the Next Generation of Digitalization in Agriculture Based on Digital Twin Paradigm"}, {"paperId": "8e3ddc0b423317bcd74812a2ddcdfffdf3a0534f", "title": "Digital Twin for Inventory Planning of Fresh Produce"}, {"paperId": "06c970503b490c302f9c7764d4ea502dccc87247", "title": "the Metaverse for Agriculture"}]}
