{"paperId": "8f1ded497c08f61d5687e5792a35d8b957580b30", "publicationVenue": {"id": "c3e5f1c8-9ba7-47e5-acde-53063a69d483", "name": "Future Internet", "type": "journal", "issn": "1999-5903", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-156830", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-156830", "https://www.mdpi.com/journal/futureinternet"]}, "title": "A Review on Clustering Techniques: Creating Better User Experience for Online Roadshow", "abstract": "Online roadshow is a relatively new concept that has higher flexibility and scalability compared to the physical roadshow. This is because online roadshow is accessible through digital devices anywhere and anytime. In a physical roadshow, organizations can measure the effectiveness of the roadshow by interacting with the customers. However, organizations cannot monitor the effectiveness of the online roadshow by using the same method. A good user experience is important to increase the advertising effects on the online roadshow website. In web usage mining, clustering can discover user access patterns from the weblog. By applying a clustering technique, the online roadshow website can be further improved to provide a better user experience. This paper presents a review of clustering techniques used in web usage mining, namely the partition-based, hierarchical, density-based, and fuzzy clustering techniques. These clustering techniques are analyzed from three perspectives: their similarity measures, the evaluation metrics used to determine the optimality of the clusters, and the functional purpose of applying the techniques to improve the user experience of the website. By applying clustering techniques in different stages of the user activities in the online roadshow website, the advertising effectiveness of the website can be enhanced in terms of its affordance, flow, and interactivity.", "venue": "Future Internet", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-09-13", "journal": {"name": "Future Internet", "pages": "233", "volume": "13"}, "authors": [{"authorId": "2119844454", "name": "Zhou-Yi Lim"}, {"authorId": "2459162", "name": "Lee-Yeng Ong"}, {"authorId": "3433690", "name": "M. Leow"}], "citations": [{"paperId": "3f28fa0c9ea5f34ce30e4f16843cdd766a72ada7", "title": "Feasibility Analysis of Bengkel Koding Website Using Black Box Testing and Boundary Value Analysis"}, {"paperId": "4a6feec642cc7448aad0700a3f05364f24781a50", "title": "Using Pattern Analysis and Machine Learning to Categorise users of Online Directories based on their Surfing Habits"}, {"paperId": "c440655792d1f355d1068fcb7f23aaf61ca00d94", "title": "New RFI Model for Behavioral Audience Segmentation in Wi-Fi Advertising System"}, {"paperId": "bde6a203624a8b8ef731df19f69850d6798ce5a7", "title": "A New Big Data Processing Framework for the Online Roadshow"}, {"paperId": "68a14ea7c385655965ba98a940155effdab1949f", "title": "An innovative data collection method to eliminate the preprocessing phase in web usage mining"}, {"paperId": "37fab1df0567c1c93f88bb8061cbe3049fd1897a", "title": "Understanding User Behaviour with Web Session Clustering and User Engagement Metrics"}, {"paperId": "dd5e727781f89e29f9425f57b5ed60c6dbbdd1bc", "title": "Using a Clustering Method to Detect Spatial Events in a Smartphone-Based Crowd-Sourced Database for Environmental Noise Assessment"}, {"paperId": "8f14083f22918eb8285aa4217087b4695c7966e8", "title": "Cluster-N-Engage: A New Framework for Measuring User Engagement of Website With User Navigational Behavior"}]}
