{"paperId": "8f23907c2d34c12eb56755bad4525bc2d8d2939a", "publicationVenue": {"id": "20a3a2f3-532a-4f04-9f3d-1e268e100872", "name": "International Journal of Advanced Computer Science and Applications", "type": "journal", "alternate_names": ["Int J Adv Comput Sci Appl"], "issn": "2156-5570", "url": "http://sites.google.com/site/ijacsa2010/", "alternate_urls": ["http://thesai.org/Publication/Default.aspx", "https://thesai.org/Publications/IJACSA"]}, "title": "Data Citation Service for Wikipedia Articles", "abstract": "The citation of big scientific data is crucial not only for scientific activity but also for the scientific discovery and dissemination within scientist network. The main objective of this research is to develop a service-oriented data citation system using data mining techniques for Middle East and North Africa scientists. A novel service oriented framework is proposed to prototype the development of the system that includes query for-malization, service discovery, service composition design, service selection, search space, and service optimization. In this research, Wikipedia scientific-related articles are connected with more than 35 petabyte Pangaea datasets. The output of this work is a web service that takes Wikipedia article information as an input and provides the possible relevant datasets (if exist) related to the article. The evaluation of this research is based on a quantitative assessment performed to the quality of web service metrics, such as number of access and bandwidth utilization; which shows that the framework is robust enough to handle both big data access and its citation.", "venue": "International Journal of Advanced Computer Science and Applications", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": null, "journal": {"name": "International Journal of Advanced Computer Science and Applications"}, "authors": [{"authorId": "2591609", "name": "Arif Bramantoro"}, {"authorId": "145932706", "name": "Ahmad Alzahrani"}], "citations": []}
