{"paperId": "8f2406e411274589d48ecaa70e37aca758c5e555", "publicationVenue": {"id": "312ca99c-9149-490d-813e-c60d5e949f65", "name": "Concurrency and Computation", "type": "journal", "alternate_names": ["Concurr Comput Pract Exp", "Concurrency and Computation: Practice and Experience", "Concurr Comput"], "issn": "1532-0626", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/77004395?CRETRY=1&SRETRY=0", "alternate_urls": ["http://www3.interscience.wiley.com/cgi-bin/jtoc?ID=77004395", "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1532-0634"]}, "title": "A hybrid multi‐objective firefly and simulated annealing based algorithm for big data classification", "abstract": "Efficient management of big data becomes challenging in recent decades. Online Feature Selection (OFS) is one type of online learning in contrast to batch learning, allowing a classifier to have small and fixed number of features. The major aim of this work is to introduce an OFS algorithm supported on meta‐heuristic algorithm that exploits the MapReduce paradigm. A novel Hybrid Multi‐Objective Firefly and Simulated Annealing (HMOFSA) algorithm is proposed to select optimal set of features. Therefore, as a first step, the original big dataset is decomposed into blocks of examples in the map phase. Subsequently, HMOFSA algorithm is employed to choose the selected features from examples. After that, the attained partial outcomes will be combined into a final vector of features in the reduce phase and evaluated using Kernel Support Vector Machine (KSVM) classifier. The mentioned OFS approach is analyzed with the help of the well‐known classifiers (Logistic Regression, KSVM and Naïve Bayes) developed within the Spark framework. Experiments were conducted on big datasets, containing 66 million samples and 2000 attributes that confirm the proficiency of proposed work. The proposed KSVM classifier results are measured in terms of the metrics like Precision, Recall, Geometric‐mean (G‐mean), F‐measure, and accuracy.", "venue": "Concurrency and Computation", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-11-28", "journal": {"name": "Concurrency and Computation: Practice and Experience", "volume": "31"}, "authors": [{"authorId": "152223544", "name": "S. Devi"}, {"authorId": "3093483", "name": "M. Sabrigiriraj"}], "citations": [{"paperId": "4da4feb1c84903536bb0be6188d02a296cca0212", "title": "Improved versions of crow search algorithm for solving global numerical optimization problems"}, {"paperId": "238b980a3ebfd7fb47d48688956a10752e0d717b", "title": "A case study for performance analysis of big data stream classification using spark architecture"}, {"paperId": "cb33081978c4e5ffc64150d21a27690d89f44784", "title": "Feature selection for online streaming high-dimensional data: A state-of-the-art review"}, {"paperId": "5630b95447d36d92956fe40b6b188e1fa9c9d938", "title": "A novel meta-heuristic algorithm for solving numerical optimization problems: Ali Baba and the forty thieves"}, {"paperId": "bfd1d71b8d81aea6bcd2f7c7a854815f68dcfb1e", "title": "Mathematical formulation and hybrid meta‐heuristic algorithms for multiproduct oil pipeline scheduling problem with tardiness penalties"}, {"paperId": "5c4066230d04a4815bef0ddd2b5a9d16d8df5f87", "title": "A modified firefly algorithm based on neighborhood search"}, {"paperId": "7fcbd0a446a5dce411ef88ebd5700fbbe9992ee6", "title": "A novel meta-heuristic search algorithm for solving optimization problems: capuchin search algorithm"}, {"paperId": "0157ba7edd37fceab9ddfdf4d13c3b4b97bbf31f", "title": "Online Feature Selection (OFS) with Accelerated Bat Algorithm (ABA) and Ensemble Incremental Deep Multiple Layer Perceptron (EIDMLP) for big data streams"}, {"paperId": "1a0251a1ab54cef0e3093615208fb6cf120a8a8d", "title": "Multiobjective Simulated Annealing: Principles and Algorithm Variants"}, {"paperId": "b811bd3e756b2a1cdad6f3f81f8972eae9383480", "title": "Design of Human Resource Big Data Parallel Classification System Based on Social Information Cognitive Model"}, {"paperId": "903597d27895136502b0ac84c9ff20def059a52f", "title": "Service Deployment of C4ISR Based on Genetic Simulated Annealing Algorithm"}]}
