{"paperId": "8f4e4a556186234c05434e517203d0ddf1c76b33", "publicationVenue": {"id": "fa1f0815-0811-4291-b4fc-8230a6c9bf5b", "name": "Annals of the New York Academy of Sciences", "type": "journal", "alternate_names": ["Ann n y Acad Sci"], "issn": "0077-8923", "url": "http://onlinelibrary.wiley.com/journal/10.1111/(ISSN)1749-6632", "alternate_urls": ["http://www.annalsnyas.org/", "http://www.nyas.org/publications/annals/default.aspx", "https://onlinelibrary.wiley.com/journal/17496632"]}, "title": "Clostridium butyricum MIYAIRI 588 alleviates periodontal bone loss in mice with diabetes mellitus", "abstract": "The gut microbiota is a bridge linking periodontitis and systemic diseases, such as diabetes mellitus (DM). The probiotic Clostridium butyricum MIYAIRI 588 (CBM588) is reportedly an effective therapeutic approach for gut dysbiosis. Here, in a mouse model, we explored the therapeutic effect of CBM588 on periodontal bone destruction in DM and DM‐associated periodontitis (DMP), as well as the underlying mechanism. Micro‐computed tomography revealed that DM and DMP both aggravated periodontal bone destruction, which was alleviated by intragastric supplementation with CBM588. Moreover, 16S rRNA sequencing and untargeted metabolite analysis indicated that CBM588 ameliorated DMP‐triggered dysbiosis and led to reduced oxidative stress associated with elevated 4‐hydroxybenzenemethanol (4‐HBA) in serum. Furthermore, in vitro and in vivo experiments found that the metabolite 4‐HBA promoted nuclear factor erythroid 2‐related factor 2 (Nrf2) signaling activation and modulated the polarization of macrophages, thus ameliorating inflammatory bone destruction in DMP. Our study demonstrates the protective effects of CBM588 in DM‐induced mice, with and without ligature‐induced periodontitis. The mechanism involves regulation of the gut microbiota and restoration of the integrity of the gut barrier to alleviate oxidative damage by elevating serum 4‐HBA. This study suggests the possibility of CBM588 as a therapeutic adjuvant for periodontal treatment in diabetes patients.", "venue": "Annals of the New York Academy of Sciences", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-02", "journal": {"name": "Annals of the New York Academy of Sciences", "pages": "100 - 84", "volume": "1529"}, "authors": [{"authorId": "2200409128", "name": "Yanan Zhang"}, {"authorId": "2177548111", "name": "Miao Lu"}, {"authorId": "2232577211", "name": "Yang Zhang"}, {"authorId": "2158757987", "name": "Xulei Yuan"}, {"authorId": "2112493572", "name": "Mengjiao Zhou"}, {"authorId": "2168521817", "name": "Xiaohui Xu"}, {"authorId": "2146320485", "name": "Tingwei Zhang"}, {"authorId": "2107185846", "name": "Jinlin Song"}], "citations": [{"paperId": "003b7460e37eaca276de3653c103efa5bc335173", "title": "Effects of Clostridium butyricum on Production Performance and Bone Development of Laying Hens"}]}
