{"paperId": "8f4e1746d925542ac22a49ce5f55dbffc903b8ef", "publicationVenue": null, "title": "Virtual Infrastructure Planning for a Workﬂow with Multiple Overlapping Deadline Constraints in Cloud", "abstract": "—Cloud providers offer various types of virtual infrastructures (e.g. Virtual Machines, Dockers) to consumers in a pay-as-you go manner. For an application represented by a complex workﬂow, it is difﬁcult for the consumer to decide what type of infrastructure they need to meet the Quality-of-Service (QoS) requirements and achieve objectives like monetary cost optimisation. We call such problem as the virtual infrastructure planning problem in cloud. Most existing studies focus on only one single deadline-constrained workﬂow planning. The single deadline constraint usually refers to a global deadline since the start execution of a workﬂow to its ﬁnish. However, such simple model cannot allow a time critical application to specify internal deadlines inside the workﬂow. To allow such ﬂexibility for consumers, we propose a multi-deadline model and consider the virtual infrastructure planning problem for workﬂow with multi-deadline constraints. To solve the problem efﬁciently, we propose a Multiple-Deadline overlapping-based Infrastructure Planning (MDIP) algorithm. In MDIP, we deﬁne the criticality of tasks by analysing the deadline coverages. Then we rank the tasks in the workﬂow by their criticality and assign them with VM type of better performance. To evaluate the effectiveness of our algorithm, we compare it with a meta-heuristic solution (Genetic Algorithm-based) and a hybrid solution combining critical path and genetic algorithm. Simulated experiments show our approach can achieve better results than existing solutions and more efﬁcient than GA-based solution. Keywords: Time", "venue": "", "year": 2018, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "2109486732", "name": "Junchao Wang"}, {"authorId": "2146382377", "name": "Huan Zhou"}, {"authorId": "2113664740", "name": "Yang Hu"}, {"authorId": "145793422", "name": "C. D. Laat"}, {"authorId": "2146631871", "name": "Zhi-Gang Zhao"}], "citations": []}
