{"paperId": "8f5587c238b9ba10c3271b9cf4aa35ee5cbe4dba", "publicationVenue": {"id": "1490edaa-ffbc-4472-bc44-138df888bc1b", "name": "Journal of information science and engineering", "type": "journal", "alternate_names": ["J Inf Sci Eng", "Journal of Information Science and Engineering", "J inf sci eng"], "issn": "1016-2364"}, "title": "Optimizing Read Operations of Hadoop Distributed File System on Heterogeneous Storages", "abstract": "The key challenge in big data processing frameworks such as Hadoop distributed ﬁle system (HDFS) is to optimize the throughput for read operations. Toward this goal, several studies have been conducted to enhance read performance on heterogeneous storages. Recently, although HDFS has supported several storage policies for placing data blocks in heterogeneous storages, it fails to fully utilize the potential of fast storages ( e.g. , SSD). The primary reason for its suboptimal read performance is that, while distributing read requests, existing HDFS only considers the network distance between the client and datanodes, thereby incurring more read requests to slower storages with more data ( e.g. , HDD). In this paper, we propose a new data retrieval policy for distributing read requests on heterogeneous stor-ages in HDFS. Speciﬁcally, the proposed policy considers both the unique characteristics of storages in datanodes and the network environments, to efﬁciently distribute read requests. We develop several policies including the proposed policy to balance these two factors such as random selection, storage type selection, weighted round-robin selection, and dynamic round-robin selection. Our experimental results show that the throughput of the proposed method outperforms those of the existing policies by up to six times in extensive benchmark datasets.", "venue": "Journal of information science and engineering", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-05-01", "journal": {"name": "J. Inf. Sci. Eng.", "pages": "709-729", "volume": "37"}, "authors": [{"authorId": "2157182695", "name": "Jongbaeg Lee"}, {"authorId": "2289313453", "name": "Jongwuk Lee"}, {"authorId": "2289186085", "name": "Sang-Won Lee"}], "citations": [{"paperId": "53b914c8fdd3f00d1a201f6bdb7c38e393356f7a", "title": "Fog Computing Capabilities for Big Data Provisioning: Visualization Scenario"}]}
