{"paperId": "8f61273a97f57f8ec8fb72c9bd548549bbec8f90", "publicationVenue": {"id": "9cc701cf-1f49-4121-8ea9-11bac24d61ad", "name": "IEEE Transactions on Big Data", "type": "journal", "alternate_names": ["IEEE Trans Big Data"], "issn": "2332-7790", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=6687317", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6687317", "https://ieeexplore.ieee.org/xpl/aboutJournal.jsp?punumber=6687317"]}, "title": "MarS-FL: Enabling Competitors to Collaborate in Federated Learning", "abstract": "Federated learning (FL) is rapidly gaining popularity and enables multiple data owners ({\\em a.k.a.} FL participants) to collaboratively train machine learning models in a privacy-preserving way. A key unaddressed scenario is that these FL participants are in a competitive market, where market shares represent their competitiveness. Although they are interested to enhance the performance of their respective models through FL, market leaders (who are often data owners who can contribute significantly to building high performance FL models) want to avoid losing their market shares by enhancing their competitors' models. Currently, there is no modeling tool to analyze such scenarios and support informed decision-making. In this paper, we bridge this gap by proposing the \\underline{mar}ket \\underline{s}hare-based decision support framework for participation in \\underline{FL} (MarS-FL). We introduce {\\em two notions of $\\delta$-stable market} and {\\em friendliness} to measure the viability of FL and the market acceptability of FL. The FL participants' behaviours can then be predicted using game theoretic tools (i.e., their optimal strategies concerning participation in FL). If the market $\\delta$-stability is achievable, the final model performance improvement of each FL-PT shall be bounded, which relates to the market conditions of FL applications. We provide tight bounds and quantify the friendliness, $\\kappa$, of given market conditions to FL. Experimental results show the viability of FL in a wide range of market conditions. Our results are useful for identifying the market conditions under which collaborative FL model training is viable among competitors, and the requirements that have to be imposed while applying FL under these conditions.", "venue": "IEEE Transactions on Big Data", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-10-26", "journal": {"name": "IEEE Transactions on Big Data"}, "authors": [{"authorId": "2108011141", "name": "Xiaohu Wu"}, {"authorId": "2110984588", "name": "Han Yu"}], "citations": [{"paperId": "76cb5e92916a40a7b6c4517fa7ffa1d7c961db17", "title": "Duopoly Business Competition in Cross-Silo Federated Learning"}, {"paperId": "28b9c624492b3c72ba63ea82c7833e450322acc9", "title": "FedCompetitors: Harmonious Collaboration in Federated Learning with Competing Participants"}, {"paperId": "2652828435c6b1971317473484876565795bdd4e", "title": "A Framework for Incentivized Collaborative Learning"}, {"paperId": "5cce7e2288cbf252e0e02d2e6a650f5659b4502b", "title": "Strategic Data Sharing between Competitors"}, {"paperId": "a0e40d9a07fdc5848ef2f10d9b63f5c28e0cec03", "title": "Trustworthy Federated Learning: A Survey"}, {"paperId": "7159a11d770b15d125fd7f28a673cf5ac99a118b", "title": "Adaptive incentive for cross-silo federated learning: A multi-agent reinforcement learning approach"}, {"paperId": "056450b5e66453fce0f94b4926e5e17f10b6c5fc", "title": "Federated learning using game strategies: State-of-the-art and future trends"}, {"paperId": "24dbd4dda8ae9edd648902c2b0036db7f0ab8f38", "title": "Incentivizing Data Contribution in Cross-Silo Federated Learning"}, {"paperId": "2c863e0ac016e3787d913e2d33078244bdfecdcd", "title": "IcoCap: Improving Video Captioning by Compounding Images"}]}
