{"paperId": "8f618dbb2c0fbbc6c8e29e7571b5b9580e164571", "publicationVenue": {"id": "ccd8e532-73c6-414f-bc91-271bbb2933e2", "name": "Electronics", "type": "journal", "issn": "1450-5843", "alternate_issns": ["2079-9292", "0883-4989"], "url": "http://www.electronics.etfbl.net/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-247562", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-247562", "https://www.mdpi.com/journal/electronics"]}, "title": "Security and Internet of Things: Benefits, Challenges, and Future Perspectives", "abstract": "Due to the widespread use of the Internet of Things (IoT), organizations should concentrate their efforts on system security. Any vulnerability could lead to a system failure or cyberattack, which would have a large-scale impact. IoT security is a protection strategy and defense mechanism that protects against the possibility of cyberattacks that specifically target physically linked IoT devices. IoT security teams are currently dealing with growing difficulties, such as inventories, operations, diversity, ownership, data volume, threats, etc. This review examines research on security and IoT with a focus on the situation, applications, and issues of the present as well as the potential for the future. IoT network security has received greater attention from interdisciplinary and geographically scattered researchers in recent years. Data integrity, secrecy, authentication, and authorization should be guaranteed due to the large amount of data that flows across network devices. However, the area of IoT security still has a lot of room for growth.", "venue": "Electronics", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-04-18", "journal": {"name": "Electronics"}, "authors": [{"authorId": "2636344", "name": "Hamed Taherdoost"}], "citations": [{"paperId": "41dfe071eaca77b7a0fb0561f0beda1442d76443", "title": "Including GRC Principles in IoT Security: A Comparison of Current Approaches and Future Prospects"}, {"paperId": "34af84b5a9b52551a370ee6770e45cc5198216d9", "title": "Secure Enhancement for MQTT Protocol Using Distributed Machine Learning Framework"}, {"paperId": "e187cf6986df3d0d8064fb2e854301cb1a85f646", "title": "Real-Time Remote Patient Monitoring: A Review of Biosensors Integrated with Multi-Hop IoT Systems via Cloud Connectivity"}, {"paperId": "b31e9bc7e5614f80284b01efa4bb2606a76cc352", "title": "Exploring the Impact of Security Technologies on Mental Health: A Comprehensive Review"}, {"paperId": "75ea6a05546d4649a1d890a236959fcc39cf8404", "title": "Smart Contract-Based Access Control Framework for Internet of Things Devices"}, {"paperId": "c278dc342fe65a3f7fecefea9697f6fd04ea223d", "title": "An intelligent optimization framework to predict the vulnerable range of tumor cells using Internet of things"}, {"paperId": "d6f5178344f0b3334485baf378e4ff0c5f3cbae8", "title": "Security in internet of things: a review on approaches based on blockchain, machine learning, cryptography, and quantum computing"}, {"paperId": "c32d0577a77e46b7d5b8d779e2d7ac0280a4843a", "title": "An Efficient and Secure Fog Based Routing Mechanism in IoT Network"}, {"paperId": "2e1700d355e4bdcbc9e13ca5b55114fc851b7e2c", "title": "Effeciency assessment of IoT devices control with Teletraffic theory"}, {"paperId": "d2318d96de287bb8155133cd466d3848455809c1", "title": "IoT-enabled B2B Integration"}]}
