{"paperId": "8f6fdbf399c18bd91c88436f0b4067a025122f77", "publicationVenue": {"id": "1ec5a55c-414e-4f79-b7dc-48e1dba3618e", "name": "IEEE Region 10 Conference", "type": "conference", "alternate_names": ["TENCON", "Digit Process Appl", "Digital Processing Applications", "IEEE Reg 10 Conf"]}, "title": "Artificial Intelligence in Software Testing: A Systematic Review", "abstract": "Software testing is a crucial component of software development. With the increasing complexity of software systems, traditional manual testing methods are becoming less feasible. Artificial Intelligence (AI) has emerged as a promising approach to software testing in recent years. This review paper aims to provide an in-depth understanding of the current state of software testing using AI. The review will examine the various approaches, techniques, and tools used in this area and assess their effectiveness. The selected articles for this study have been extracted from different research databases using the advanced search string strategy. Initially, 40 articles have been extracted from different research libraries. After gradual filtering finally, 20 articles have been selected for the study. After studying all the selected papers, we find that various testing tasks can be automated successfully using AI (Machine Learning and Deep Learning) such as Test Case Generation, Defect Prediction, Test Case Prioritization Metamorphic Testing, Android Testing, Test Case Validation, and White Box Testing. This study also finds that the integration of AI in software testing is making software testing activities easier along with better performance. This literature review paper provides a thorough analysis of the impact AI can have on the software testing process.", "venue": "IEEE Region 10 Conference", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference", "Review"], "publicationDate": "2023-10-31", "journal": {"name": "TENCON 2023 - 2023 IEEE Region 10 Conference (TENCON)", "pages": "524-529"}, "authors": [{"authorId": "2265293816", "name": "Mahmudul Islam"}, {"authorId": "2268220203", "name": "Farhan Khan"}, {"authorId": "2267756353", "name": "Sabrina Alam"}, {"authorId": "2237111433", "name": "Mahady Hasan"}], "citations": [{"paperId": "fcb5aaacf47a0373faf24675505fb3d4470e1deb", "title": "DesignSystemsJS - Building a Design Systems API for aiding standardization and AI integration"}]}
