{"paperId": "8f741859ea320641471ae216d8c3e24fd765e661", "publicationVenue": {"id": "9cc701cf-1f49-4121-8ea9-11bac24d61ad", "name": "IEEE Transactions on Big Data", "type": "journal", "alternate_names": ["IEEE Trans Big Data"], "issn": "2332-7790", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=6687317", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6687317", "https://ieeexplore.ieee.org/xpl/aboutJournal.jsp?punumber=6687317"]}, "title": "Trident: Distributed Storage, Analysis, and Exploration of Multidimensional Phenomena", "abstract": "Rising storage and computational capacities have led to the accumulation of voluminous datasets. These datasets contain insights that describe natural phenomena, usage patterns, trends, and other aspects of complex, real-world systems. Statistical and machine learning models are often employed to identify these patterns or attributes of interest. However, a wide array of potentially relevant models and parameterizations exist, and may provide the best performance only after preprocessing steps have been carried out. Our distributed analytics platform, Trident, facilitates the modeling process by providing high-level data exploration functionality as well as guidance for creation of effective models. Trident handles (1) data partitioning and storage, (2) metadata extraction and indexing, and (3) selective retrievals or transformations to prepare and generate training data. In this study, we evaluate Trident in the context of a 1.1 petabyte epidemiology dataset generated by a disease spread simulation; such datasets are often used in planning for national-scale outbreaks in animal populations.", "venue": "IEEE Transactions on Big Data", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-06-01", "journal": {"name": "IEEE Transactions on Big Data", "pages": "252-265", "volume": "5"}, "authors": [{"authorId": "2528759", "name": "Matthew Malensek"}, {"authorId": "2930999", "name": "Walid Budgaga"}, {"authorId": "2067442139", "name": "Ryan Stern"}, {"authorId": "1747019", "name": "S. Pallickara"}, {"authorId": "145069202", "name": "S. Pallickara"}], "citations": [{"paperId": "39ff1368382d391c7bfca0908123bd2bc7c2dfb2", "title": "Concerto: Leveraging Ensembles for Timely, Accurate Model Training Over Voluminous Datasets"}, {"paperId": "caf50e2947c2900d1300b74513e09ddd962af6aa", "title": "2019 Index IEEE Transactions on Big Data Vol. 5"}, {"paperId": "1c3117f6b9a913896255edd089cb818cf3f3f018", "title": "Alleviating I/O Inefficiencies to Enable Effective Model Training Over Voluminous, High-Dimensional Datasets"}, {"paperId": "672c3db094ac5005a299ba8e9d63bd089165eeac", "title": "THESIS A QUESTIONNAIRE INTEGRATION SYSTEM BASED ON QUESTION CLASSIFICATION AND SHORT TEXT SEMANTIC TEXTUAL SIMILARITY Submitted by"}, {"paperId": "a6dd6b45e49792cbe3f43613228660baef2f71fd", "title": "LEVERAGING STREAM PROCESSING ENGINES IN SUPPORT OF PHYSIOLOGICAL DATA PROCESSING Submitted"}]}
