{"paperId": "8f7c84483736ecb3029e802d8b4171d01e2e2001", "publicationVenue": null, "title": "Toward automatic assessment of a risk of women’s health disorders based on ontology decision models and menstrual cycle analysis", "abstract": "We discuss how to bridge a gap between low-level processing of measurements related to women’s menstrual cycles and high-level analysis of health disorders. On the one hand, such disorders can be associated with some well-describable symptoms by medical experts. On the other hand, such symptoms could be connected with anomalous menstrual patterns detected in the acquired data. This leads toward an opportunity to establish a hierarchical model of concepts based on data-driven recognition of an increased risk of disorders. In our study we rely on the menstrual cycle analysis system that has been already productized by the OvuFriend company. Going further, we discuss how to utilize medical knowledge and learn medical concepts from data in order to better assist the OvuFriend’s application users in self-monitoring of their health.", "venue": "2021 IEEE International Conference on Big Data (Big Data)", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-12-15", "journal": {"name": "2021 IEEE International Conference on Big Data (Big Data)", "pages": "5544-5552"}, "authors": [{"authorId": "2287590432", "name": "Lukasz Sosnowski"}, {"authorId": "2287577888", "name": "Jakub Wróblewski"}], "citations": [{"paperId": "4c51f9229d5252a00aa4768cda1a056bcb0b0848", "title": "Medical decision support in the light of interactive granular computing: Lessons from the Ovufriend project"}, {"paperId": "00758c751060698d3ad2e3878782fe26c133acbb", "title": "Rough Sets Turn 40: From Information Systems to Intelligent Systems"}, {"paperId": "83f9468606c487da027eea8b01bb445e180be996", "title": "Artificial Intelligence in Personalized Healthcare Analysis for Women’s’ Menstrual Health Disorders"}]}
