{"paperId": "8faa94033d9816eeba0a90888313f7f67602a235", "publicationVenue": {"id": "d0bfb97a-a20e-4896-9afe-1e63e459db20", "name": "Smart Cities", "alternate_names": ["Smart City"], "issn": "2624-6511", "alternate_issns": ["2731-3409"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-1343723", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-1343723", "https://www.mdpi.com/journal/smartcities"]}, "title": "Towards a Novel Air–Ground Intelligent Platform for Vehicular Networks: Technologies, Scenarios, and Challenges", "abstract": "Modern cities require a tighter integration with Information and Communication Technologies (ICT) for bringing new services to the citizens. The Smart City is the revolutionary paradigm aiming at integrating the ICT with the citizen life; among several urban services, transports are one of the most important in modern cities, introducing several challenges to the Smart City paradigm. In order to satisfy the stringent requirements of new vehicular applications and services, Edge Computing (EC) is one of the most promising technologies when integrated into the Vehicular Networks (VNs). EC-enabled VNs can facilitate new latency-critical and data-intensive applications and services. However, ground-based EC platforms (i.e., Road Side Units—RSUs, 5G Base Stations—5G BS) can only serve a reduced number of Vehicular Users (VUs), due to short coverage ranges and resource shortage. In the recent past, several new aerial platforms with integrated EC facilities have been deployed for achieving global connectivity. Such air-based EC platforms can complement the ground-based EC facilities for creating a futuristic VN able to deploy several new applications and services. The goal of this work is to explore the possibility of creating a novel joint air-ground EC platform within a VN architecture for helping VUs with new intelligent applications and services. By exploiting most modern technologies, with particular attention towards network softwarization, vehicular edge computing, and machine learning, we propose here three possible layered air-ground EC-enabled VN scenarios. For each of the discussed scenarios, a list of the possible challenges is considered, as well possible solutions allowing to overcome all or some of the considered challenges. A proper comparison is also done, through the use of tables, where all the proposed scenarios, and the proposed solutions, are discussed.", "venue": "Smart Cities", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-12-09", "journal": {"name": "Smart Cities"}, "authors": [{"authorId": "1557358679", "name": "S. Shinde"}, {"authorId": "2914774", "name": "D. Tarchi"}], "citations": [{"paperId": "3a73c09b1ff9570399197c4b7d0f7e3280250211", "title": "Intelligent Transport Systems Using High Altitude Platform Stations"}, {"paperId": "b0bca64d6534c861887b1a125f3f0abff47915a7", "title": "Joint Air-Ground Distributed Federated Learning for Intelligent Transportation Systems"}, {"paperId": "8668a4eff67bf57153f3b28add02fef7c8c2f0f6", "title": "Analysis and Performance Evaluation of Transfer Learning Algorithms for 6G Wireless Networks"}, {"paperId": "6d018b67aee7e3b0c892d4b8f198c1ef0588cd6c", "title": "Internet of Vehicles and Real-Time Optimization Algorithms: Concepts for Vehicle Networking in Smart Cities"}, {"paperId": "85194c4e386086784794ada9e8e2e308a51380d3", "title": "Blockchain-Empowered AI for 6G-Enabled Internet of Vehicles"}, {"paperId": "958b74f165a16d22e819785e9bfc165aec3722f1", "title": "Network Selection and Computation Offloading in Non-Terrestrial Network Edge Computing Environments for Vehicular Applications"}, {"paperId": "114be6ba8e36393b956d5d9fcdbcc110dbf0debf", "title": "Overview of Distributed Machine Learning Techniques for 6G Networks"}, {"paperId": "022117dcf9a47432e7108209af4cb3c87782023b", "title": "UAV/HAP-Assisted Vehicular Edge Computing in 6G: Where and What to Offload?"}]}
