{"paperId": "8fafbbb6ca3435c070119fdd28c7fb9aadb23874", "publicationVenue": {"id": "e587f364-8685-4bc2-8192-09d327173a5c", "name": "IEEE Cloud Computing", "type": "journal", "alternate_names": ["IEEE Cloud Comput"], "issn": "2325-6095", "url": "http://publications.computer.org/cloud-computing/", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/aboutJournal.jsp?punumber=6509491", "https://ieeexplore.ieee.org/servlet/opac?punumber=6509491"]}, "title": "HERMES: Federating Fog and Cloud Domains to Support Query Evaluations in Continuous Sensing Environments", "abstract": "As networked sensing devices continue to proliferate, the storage and processing capabilities of fog or edge devices have also increased substantially while offering low energy consumption and hardware costs. These complimentary technologies enable unique opportunities for performing decentralized analysis on the edges of the network while also leveraging the capabilities of public and private clouds for coordination and long-term storage. Our framework, HERMES, enables federated query evaluations that transition between cloud and fog nodes seamlessly. The system selectively samples from observational streams to reduce communication and memory consumption on fog nodes; our evaluation over a real-world observational dataset demonstrates an 89% reduction in dataset size while maintaining a mean absolute error of less than 0.25%.", "venue": "IEEE Cloud Computing", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2017-04-26", "journal": {"name": "IEEE Cloud Computing", "pages": "54-62", "volume": "4"}, "authors": [{"authorId": "2528759", "name": "Matthew Malensek"}, {"authorId": "145069202", "name": "S. Pallickara"}, {"authorId": "1747019", "name": "S. Pallickara"}], "citations": [{"paperId": "a6c0f117aa2b6d79add428bd9d87e31eab07cda9", "title": "A Framework for Profiling Spatial Variability in the Performance of Classification Models"}, {"paperId": "f50b807f3b0bc2021c2c91c3b6e58f5a98ef84ec", "title": "Rubiks: Rapid Explorations and Summarization over High Dimensional Spatiotemporal Datasets"}, {"paperId": "d616d3c97aa0c7fbc71fa200aad263a6561766e1", "title": "Unlocking Insights in IoT-Based Patient Monitoring: Methods for Encompassing Large-Data Challenges"}, {"paperId": "bd1a795f93b203e2c8b8c5c5a08a790c7875445b", "title": "ARGUS: Rapid Wildfire Tracking Using Satellite Data Collections"}, {"paperId": "be57df9316465671db55a6ae0629bbf21be6479c", "title": "SEA-LEAP: Self-Adaptive and Locality-Aware Edge Analytics Placement"}, {"paperId": "dcc2a1ffc5f47284392a6485eec253ee9731c5ac", "title": "Living on the Edge"}, {"paperId": "a180de1985eb11d51452085ace4a89a04b859a6b", "title": "A Low-Cost Two-Tier Fog Computing Testbed for Streaming IoT-Based Applications"}, {"paperId": "1f5577eea0916f20a3512aed0fccb2ea1de0ff8e", "title": "A Lightweight Location-Aware Fog Framework (LAFF) for QoS in Internet of Things Paradigm"}, {"paperId": "2b4418e80f49b10b0a9e9073c129c3d17166c644", "title": "TorqueDB: Distributed Querying of Time-Series Data from Edge-local Storage"}, {"paperId": "da37fc55c6a28279701893f1f6418c9948dea51f", "title": "SFDDM: A Secure Distributed Database Management in Combined Fog-to-Cloud Systems"}, {"paperId": "ab308e53c81a74e37f34ba81dd41bde03625e6aa", "title": "IoT enabled Smart Fog Computing for Vehicular Traffic Control"}, {"paperId": "3e4388586eb2538657a24ca1ace3c6877ec2235b", "title": "All One Needs to Know about Fog Computing and Related Edge Computing Paradigms: A Complete Survey"}, {"paperId": "0097cfe572f941ff45704609e3478b60e45db60e", "title": "POStCODE Middleware for Post-Market Surveillance of Medical Devices for Cyber Security in Medical and Healthcare Sector in Australia"}, {"paperId": "7f39b5c90857b64a93221c68a8d318b8f178c5b3", "title": "PATH2iot: A Holistic, Distributed Stream Processing System"}, {"paperId": "ccde6c760c2c1c51b94b783609ca7bc09a60e8c9", "title": "A Comprehensive Survey on Fog Computing: State-of-the-Art and Research Challenges"}, {"paperId": "b192e48ffcee08913703a3903710758438295458", "title": "Living on the Edge: Data Transmission, Storage, and Analytics in Continuous Sensing Environments"}, {"paperId": "0880ff34e70081b88afe34a13832d534f6790275", "title": "Adaptive learning-based resource management strategy in fog-to-cloud"}, {"paperId": "e0dff5f27ae278eccde8b722347c4d5dcabe8769", "title": "All One Needs to Know about Fog Computing and Related Edge Computing Paradigms"}, {"paperId": "640247cb448f9079ddc00a2bcf0728ec81078196", "title": "On the Planning and Design Problem of Fog Networks"}, {"paperId": "a6dd6b45e49792cbe3f43613228660baef2f71fd", "title": "LEVERAGING STREAM PROCESSING ENGINES IN SUPPORT OF PHYSIOLOGICAL DATA PROCESSING Submitted"}, {"paperId": "1e71d9591b2051c1b43b819fafc480fcd8436039", "title": "Implications of storage subsystem interactions on processing efficiency in data intensive computing"}]}
