{"paperId": "8fbd3cbaeb8067cbc8021754d50039692d8a10fd", "publicationVenue": {"id": "9448f839-459b-45f3-8573-5eff3f032334", "name": "USENIX Annual Technical Conference", "type": "conference", "alternate_names": ["USENIX Annu Tech Conf", "USENIX", "USENIX ATC"], "url": "https://www.usenix.org/conferences/byname/131"}, "title": "Apache Nemo: A Framework for Building Distributed Dataflow Optimization Policies", "abstract": "Optimizing scheduling and communication of distributed data processing for resource and data characteristics is crucial for achieving high performance. Existing approaches to such optimizations largely fall into two categories. First, distributed runtimes provide low-level policy interfaces to apply the optimizations, but do not ensure the maintenance of correct application semantics and thus often require significant effort to use. Second, policy interfaces that extend a high-level application programming model ensure correctness, but do not provide sufficient fine control. We describe Apache Nemo, an optimization framework for distributed dataflow processing that provides fine control for high performance, and also ensures correctness for ease of use. We combine several techniques to achieve this, including an intermediate representation, optimization passes, and runtime extensions. Our evaluation results show that Nemo enables composable and reusable optimizations that bring performance improvements on par with existing specialized runtimes tailored for a specific deployment scenario.", "venue": "USENIX Annual Technical Conference", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": null, "journal": {"pages": "177-190"}, "authors": [{"authorId": "1927364", "name": "Youngseok Yang"}, {"authorId": "46258720", "name": "Jeongyoon Eo"}, {"authorId": "144662807", "name": "Geon‐Woo Kim"}, {"authorId": "2110130682", "name": "J. Kim"}, {"authorId": "2108143050", "name": "Sanha Lee"}, {"authorId": "2111452394", "name": "J. Seo"}, {"authorId": "31948265", "name": "Won Wook Song"}, {"authorId": "1704157", "name": "Byung-Gon Chun"}], "citations": [{"paperId": "bc8ef065af71f238f3c8a5c27252136967532668", "title": "Rethinking Storage Management for Data Processing Pipelines in Cloud Data Centers"}, {"paperId": "8d839e860ad07c918414a78c68eebbbb2ff06757", "title": "SWAN: WAN-aware stream processing on geographically-distributed clusters"}, {"paperId": "b399c3491d902ca32be41fd7d5d4cb34bea75744", "title": "AutoMon: Automatic Distributed Monitoring for Arbitrary Multivariate Functions"}, {"paperId": "c6b8f30299e2ca3216d0df0653cdf93599f10e8a", "title": "Jumpgate: automating integration of network connected accelerators"}, {"paperId": "8909c3274f53a58e8d177c7e8c29796817c4e1e4", "title": "Flexible Executor Allocation without Latency Increase for Stream Processing in Apache Spark"}, {"paperId": "c2fa234572e8968b6e809d8d5c338183c2893a75", "title": "Apache Nemo: A Framework for Optimizing Distributed Data Processing"}, {"paperId": "8be12333935a4a2ad7fecfbfa9a8f45328dde22d", "title": "A framework to support multi-cloud collaboration"}, {"paperId": "5e8aa2fdfdc6839c629441a5f2a8ceb3399a04ee", "title": "Sponge: Fast Reactive Scaling for Stream Processing with Serverless Frameworks"}, {"paperId": "c05af9286bd306bf148818428f7502edcdaa1aa7", "title": "Blaze: Holistic Caching for Iterative Data Processing"}]}
