{"paperId": "8fc7eb02cbba2eee5df0f69ecd65233f59f0c8f8", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Towards Energy Efficiency in Data Centers: An Industrial Experience Based on Reuse and Layout Changes", "abstract": "Data centers are widely recognized for demanding many energy resources. The greater the computational demand, the greater the use of resources operating together. Consequently, the greater the heat, the greater the need for cooling power, and the greater the energy consumption. In this context, this article aims to report an industrial experience of achieving energy efficiency in a data center through a new layout proposal, reuse of previously existing resources, and air conditioning. We used the primary resource to adopt a cold corridor confinement, the increase of the raised floor’s height, and a better direction of the cold airflow for the aspiration at the servers’ entrance. We reused the three legacy refrigeration machines from the old data center, and no new ones were purchased. In addition to 346 existing devices, 80 new pieces of equipment were added (between servers and network assets) as a load to be cooled. Even with the increase in the amount of equipment, the implementations contributed to energy efficiency compared to the old data center, still reducing approximately 41% of the temperature and, consequently, energy-saving.", "venue": "Applied Sciences", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-05-21", "journal": {"name": "Applied Sciences", "pages": "4719", "volume": "11"}, "authors": [{"authorId": "2121364887", "name": "Romulos da S. Machado"}, {"authorId": "2064442688", "name": "F. S. Pires"}, {"authorId": "31235647", "name": "G. R. Caldeira"}, {"authorId": "25867812", "name": "F. Giuntini"}, {"authorId": "2151132888", "name": "F. Santos"}, {"authorId": "2061152552", "name": "Paulo Fonseca"}], "citations": [{"paperId": "153aa90a6238b2d0d347001c89467e7408e85ea6", "title": "Energy efficient resource optimization algorithm for cloud infrastructure"}, {"paperId": "f322336af4b55ff65525222fe2b2fe6110120ab3", "title": "AMANDA: A Middleware for Automatic Migration between Different Database Paradigms"}, {"paperId": "7199b23f9e2d8a121bfea6bec5cd030f453e9106", "title": "International Journal of Electrical and Computer Engineering (IJECE)"}]}
