{"paperId": "8fc9be0da3ca7dc3ca7e95e2b5b7babbaf8bcde3", "publicationVenue": null, "title": "Evaluation of Load Prediction Techniques for Distributed Stream Processing", "abstract": "Distributed Stream Processing (DSP) systems enable processing large streams of continuous data to produce results in near to real time. They are an essential part of many data-intensive applications and analytics platforms. The rate at which events arrive at DSP systems can vary considerably over time, which may be due to trends, cyclic, and seasonal patterns within the data streams. A priori knowledge of incoming workloads enables proactive approaches to resource management and optimization tasks such as dynamic scaling, live migration of resources, and the tuning of configuration parameters during run-times, thus leading to a potentially better Quality of Service. In this paper we conduct a comprehensive evaluation of different load prediction techniques for DSP jobs. We identify three use-cases and formulate requirements for making load predictions specific to DSP jobs. Automatically optimized classical and Deep Learning methods are being evaluated on nine different datasets from typical DSP domains, i.e. the IoT, Web 2.0, and cluster monitoring. We compare model performance with respect to overall accuracy and training duration. Our results show that the Deep Learning methods provide the most accurate load predictions for the majority of the evaluated datasets.", "venue": "2021 IEEE International Conference on Cloud Engineering (IC2E)", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-08-10", "journal": {"name": "2021 IEEE International Conference on Cloud Engineering (IC2E)", "pages": "91-98"}, "authors": [{"authorId": "2079393610", "name": "Kordian Gontarska"}, {"authorId": "88355634", "name": "Morgan K. Geldenhuys"}, {"authorId": "2051551482", "name": "Dominik Scheinert"}, {"authorId": "2077225987", "name": "Philipp Wiesner"}, {"authorId": "1749599", "name": "A. Polze"}, {"authorId": "2294791", "name": "L. Thamsen"}], "citations": [{"paperId": "4e0ad1a7e02d5ace850ad3dce7816424cd42cecc", "title": "Demeter: Resource-Efficient Distributed Stream Processing under Dynamic Loads with Multi-Configuration Optimization"}, {"paperId": "d55d57ec10332532d085993b152da83bfa5ce422", "title": "Daedalus: Self-Adaptive Horizontal Autoscaling for Resource Efficiency of Distributed Stream Processing Systems"}, {"paperId": "5fcfdd3f3ab766ce53d5f51212c7db0f0ef3a4df", "title": "Practical Storage-Compute Elasticity for Stream Data Processing"}, {"paperId": "e42283730684b5c55d51ca7af30f375f4b54e4d7", "title": "Evaluation of Data Enrichment Methods for Distributed Stream Processing Systems"}, {"paperId": "16e89ebfa497af0d39dead48d66a784558698a06", "title": "Cucumber: Renewable-Aware Admission Control for Delay-Tolerant Cloud and Edge Workloads"}, {"paperId": "4e1871f2ed189c10b3ed30e4989485fd1218aa4a", "title": "Let's wait awhile: how temporal workload shifting can reduce carbon emissions in the cloud"}, {"paperId": "6f16bc772c8b298ee1d0f3efe6ccec571d3b6c30", "title": "The Methods of Cloud Computing"}]}
