{"paperId": "8fd1e607ff3f4d26efd32c3a7258d10b9cd4165a", "publicationVenue": {"id": "8c456f98-9892-42ac-9b16-418755f01550", "name": "Frontiers in Computational Neuroscience", "type": "journal", "alternate_names": ["Front Comput Neurosci"], "issn": "1662-5188", "url": "http://www.frontiersin.org/computational_neuroscience", "alternate_urls": ["http://www.frontiersin.org/computationalneuroscience/", "https://www.frontiersin.org/journals/computational-neuroscience"]}, "title": "BrainOS: A Novel Artificial Brain-Alike Automatic Machine Learning Framework", "abstract": "Human intelligence is constituted by a multitude of cognitive functions activated either directly or indirectly by external stimuli of various kinds. Computational approaches to the cognitive sciences and to neuroscience are partly premised on the idea that computational simulations of such cognitive functions and brain operations suspected to correspond to them can help to further uncover knowledge about those functions and operations, specifically, how they might work together. These approaches are also partly premised on the idea that empirical neuroscience research, whether following on from such a simulation (as indeed simulation and empirical research are complementary) or otherwise, could help us build better artificially intelligent systems. This is based on the assumption that principles by which the brain seemingly operate, to the extent that it can be understood as computational, should at least be tested as principles for the operation of artificial systems. This paper explores some of the principles of the brain that seem to be responsible for its autonomous, problem-adaptive nature. The brain operating system (BrainOS) explicated here is an introduction to ongoing work aiming to create a robust, integrated model, combining the connectionist paradigm underlying neural networks and the symbolic paradigm underlying much else of AI. BrainOS is an automatic approach that selects the most appropriate model based on the (a) input at hand, (b) prior experience (a history of results of prior problem solving attempts), and (c) world knowledge (represented in the symbolic way and used as a means to explain its approach). It is able to accept diverse and mixed input data types, process histories and objectives, extract knowledge and infer a situational context. BrainOS is designed to be efficient through its ability to not only choose the most suitable learning model but to effectively calibrate it based on the task at hand.", "venue": "Frontiers in Computational Neuroscience", "year": 2020, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-03-03", "journal": {"name": "Frontiers in Computational Neuroscience", "volume": "14"}, "authors": [{"authorId": "145147388", "name": "N. Howard"}, {"authorId": "2440017", "name": "Naima Chouikhi"}, {"authorId": "2064500", "name": "A. Adeel"}, {"authorId": "80763601", "name": "K. Dial"}, {"authorId": "2047132579", "name": "Adam Howard"}, {"authorId": "144664815", "name": "A. Hussain"}], "citations": [{"paperId": "938efc51d28d5813cf302cd3d2c1ea75e74d48cd", "title": "Comparative evaluation of automated machine learning techniques for breast cancer diagnosis"}, {"paperId": "f3700f89aa1af1580a0729be74f7d65846c7faf7", "title": "Web-based Automatic Deep Learning Service Generation System by Ontology Technologies"}, {"paperId": "ae3888dabae879c2a87d16c3698709ccb324f168", "title": "Novel single and multi-layer echo-state recurrent autoencoders for representation learning"}, {"paperId": "5bdbadc741ce13762b7c914c1514124404c46211", "title": "An Augmented Artificial Intelligence Approach for Chronic Diseases Prediction"}]}
