{"paperId": "8fe024e8ce4a11b8deab79f4e50cc1c42952572d", "publicationVenue": {"id": "4e5cb97d-ea4b-4096-a3a7-7e57677a366d", "name": "IEEE Transactions on Learning Technologies", "type": "journal", "alternate_names": ["IEEE Trans Learn Technol"], "issn": "1939-1382", "url": "https://www.computer.org/web/tlt/about-tlt", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=4620076", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4620076"]}, "title": "Students' Online Laboratory Work Assessment Based on Learning Task Lists and Behavior Data", "abstract": "In conventional laboratories, engineering students must attend in person to conduct experiments with real equipment in a physical place, where their work is mainly assessed through self-reports and attendance records. By comparison, online labs can record and analyze students' activities and behaviors automatically. Thus, this article proposes a novel method for assessing students' online laboratory work. The assessment method has two key components. The first component considers the scores provided by a task learning system, with progressive task lists set to guide students to finish the experiments. After each subtask, the completeness and quality are verified, and the system automatically records the corresponding score according to checking rules executed through JavaScript codes. The second part analyzes the behavior data, and student performance during the online experiments is analyzed using a fuzzy inference method. This work also presents a case study based on practical teaching at Wuhan University, where students in the courses Classical Control Theory and System Identification use the networked control system laboratory for their laboratory courses. The results show that the proposed assessment method can be applied to effectively and automatically evaluate students' laboratory work.", "venue": "IEEE Transactions on Learning Technologies", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-04-01", "journal": {"name": "IEEE Transactions on Learning Technologies", "pages": "266-277", "volume": "16"}, "authors": [{"authorId": "2114239138", "name": "Hui Xiao"}, {"authorId": "1833938", "name": "Wenshan Hu"}, {"authorId": "1755522", "name": "Guoping Liu"}], "citations": []}
