{"paperId": "8ff5a81b35bd6a36fe91284dacc2e433d438f274", "publicationVenue": null, "title": "Fast demand response with datacenter loads: a green dimension of big data", "abstract": "Demand response is one of the critical technologies necessary for allowing largescale penetration of intermittent renewable energy sources in the electric grid. Data centers are especially attractive candidates for providing flexible, real-time demand response services to the grid because they are capable of fast power ramp-rates, large dynamic range, and finely-controllable power consumption. This thesis makes a contribution toward implementing load shaping with server clusters through a detailed experimental investigation of three broadly-applicable datacenter workload scenarios. We experimentally demonstrate the eminent feasibility of datacenter demand response with a distributed video transcoding application and a simple distributed power controller. We also show that while some software power capping interfaces performed better than others, all the interfaces we investigated had the high dynamic range and low power variance required to achieve high quality power tracking. Our next investigation presents an empirical performance evaluation of algorithms that replace arithmetic operations with low-level bit operations for power-aware Big Data processing. Specifically, we compare two different data structures in terms of execution time and power efficiency: (a) a baseline design using arrays, and (b) a design using bitslice indexing (BSI) and distributed BSI arithmetic. Across three different datasets and three popular queries, we show that the bit-slicing queries consistently outperform the array algorithm in both power efficiency and execution time. In the context of datacenter power shaping, this performance optimization enables additional power", "venue": "", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": null, "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "32672937", "name": "J. McClurg"}], "citations": [{"paperId": "e2eabefb1b1e9f094f1e037ee1de5b8f256b94a6", "title": "Potential of data centers for fast frequency response services in synchronously isolated power systems"}, {"paperId": "d5c0b6b6b2190272b449d8c4d700e1af8f9e7a35", "title": "Assessments of data centers for provision of frequency regulation"}]}
