{"paperId": "90155fc7899a39549e3da12eb3d9540cf360e123", "publicationVenue": {"id": "21c6370a-197c-4b1e-8fce-fc7d70822347", "name": "Moravian Geographical Reports", "type": "journal", "alternate_names": ["Morav Geogr Rep"], "issn": "1210-8812", "url": "https://www.degruyter.com/view/j/mgr", "alternate_urls": ["http://www.degruyter.com/view/j/mgr?result=1&rskey=8Jby9O"]}, "title": "Consumer perception of food value: A comparative study of global supermarkets and local farmers' markets in Slovakia", "abstract": "Abstract The paper explores how Slovak consumers perceive the value of food, sold by different retail formats (especially farmers’ markets and supermarkets), in terms of the quality, price, and healthiness. The aim of this paper is to evaluate consumer perceptions regarding global and local types of retail stores where they buy food most frequently. In the study, the segmentation of consumers by generation, income, and type of residence is provided. From the methodological point of view, Mann-Whitney U and Kruskal-Wallis tests are used to test hypotheses. According to the sample of respondents (n = 1,004), large-scale stores do not offer healthier and higher-quality food. This perception, however, varies based on the income of the consumer groups. On the other hand, respondents perceive that food sold at farmers’ markets is healthier and of higher quality than food in conventional stores. They do not perceive that food sold at farmers’ markets is cheaper than food in conventional stores.", "venue": "Moravian Geographical Reports", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-01", "journal": {"name": "Moravian Geographical Reports", "pages": "184 - 193", "volume": "31"}, "authors": [{"authorId": "101675957", "name": "F. Križan"}, {"authorId": "101661361", "name": "Kristína Bilková"}, {"authorId": "90793719", "name": "M. Novotná"}, {"authorId": "92680686", "name": "J. Kunc"}, {"authorId": "2102350452", "name": "Petra Hencelová"}], "citations": []}
