{"paperId": "901f8476b593118d2b522138b9b87c3fb5615f17", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "The Analysis of Music Emotion and Visualization Fusing Long Short-Term Memory Networks Under the Internet of Things", "abstract": "This paper aims to provide an automatic analysis of music emotion, enhancing users’ ability to perceive and comprehend the emotional nuances conveyed in music intuitively. It first reviews the limitations of traditional music emotion analysis methods, and highlights the transformative potential of Internet of Things (IoT) technology in addressing these limitations. Subsequently, the paper employs the Long Short-Term Memory (LSTM) network to model time series data in music, integrating it with the Sequence-to-Sequence (STS) framework to construct an advanced music emotion analysis model. Finally, several machine learning algorithms are adopted to train and evaluate the system. The findings underscore the efficacy of the music emotion analysis model based on the LSTM network fused with STS, demonstrating notable success in the task of music emotion prediction. Specifically, the fusion model achieves an average absolute error of Arousal value of 0.921, a root mean square error (RMSE) of 0.534, and an R square of 0.498. The average absolute error in the Valence value is 0.902, the RMSE is 0.575, and the R square is 0.478. This paper holds significant implications for a deeper understanding of music emotion and provides guidance for music recommendation and creation.", "venue": "IEEE Access", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "141192-141204", "volume": "11"}, "authors": [{"authorId": "2242325523", "name": "Yujing Cao"}, {"authorId": "2242231444", "name": "Jinwan Park"}], "citations": []}
