{"paperId": "9020ec7be375f139e51cb20641dbe08a453e6ab7", "publicationVenue": {"id": "55cfe77c-5a32-4904-8db5-8025cd9e1bd7", "name": "Applied Mathematics and Nonlinear Sciences", "alternate_names": ["Appl Math Nonlinear Sci"], "issn": "2444-8656", "url": "https://content.sciendo.com/view/journals/amns/amns-overview.xml", "alternate_urls": ["http://journals.up4sciences.org/applied_mathematics_and_nonlinear_sciences.html"]}, "title": "Research on the Application of KNN Algorithm Incorporating Gaussian Functions in Precision Marketing Classification of E-commerce Platforms", "abstract": "Abstract The technology can fully explore the user’s consumption behavior habits and help the e-commerce platform formulate more precise marketing strategies in a targeted manner. This paper firstly analyzes the optimization of marketing strategy based on the 3R marketing theory, gives the design process of the precise marketing strategy of an e-commerce platform, and analyzes the personalized service based on consumer classification. Secondly, for the shortcomings of the KNN algorithm in the process of accurate classification, the Gaussian function is introduced to weight the optimization of the algorithm, which further realizes the construction of the G-KNN algorithm. Finally, the testing and application analysis of the algorithm model was carried out using the actual user consumption data of the e-commerce platform. The results show that the classification accuracy of the G-KNN algorithm has been maintained at about 95% when the K value exceeds 800, and the F1 composite value of this paper’s algorithm fluctuates around 56% when the K value exceeds 1000. On the e-commerce platform, except for the electrical appliances category classification test, the fit and accuracy of other categories basically match. Using the KNN algorithm incorporating the Gaussian function can effectively realize the accurate classification of user characteristics on the e-commerce platform and provide data support for the e-commerce platform to formulate accurate marketing strategies based on consumer preferences.", "venue": "Applied Mathematics and Nonlinear Sciences", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-09", "journal": {"name": "Applied Mathematics and Nonlinear Sciences", "volume": "0"}, "authors": [{"authorId": "2233870335", "name": "Guorui Wang"}], "citations": []}
