{"paperId": "9026acfec2b40a0e12a857f9d2a347d611f8eeb8", "publicationVenue": {"id": "8bc59e8b-e251-4201-839a-ec83ae78859d", "name": "Complex", "type": "conference", "alternate_names": ["Int Conf Complex Sci", "International Conference on Complex Sciences"], "issn": "0806-1912", "alternate_issns": ["1538-6848"], "url": "http://wo.uio.no/as/WebObjects/nettlogg.woa/1/wa/logg?logg=5904", "alternate_urls": ["http://www.wikicfp.com/cfp/program?id=545", "https://www.complex.com/"]}, "title": "Review of the Complexity of Managing Big Data of the Internet of Things", "abstract": "There is a growing awareness that the complexity of managing Big Data is one of the main challenges in the developing field of the Internet of Things (IoT). Complexity arises from several aspects of the Big Data life cycle, such as gathering data, storing them onto cloud servers, cleaning and integrating the data, a process involving the last advances in ontologies, such as Extensible Markup Language (XML) and Resource Description Framework (RDF), and the application of machine learning methods to carry out classifications, predictions, and visualizations. In this review, the state of the art of all the aforementioned aspects of Big Data in the context of the Internet of Things is exposed. The most novel technologies in machine learning, deep learning, and data mining on Big Data are discussed as well. Finally, we also point the reader to the state-of-the-art literature for further in-depth studies, and we present the major trends for the future.", "venue": "Complex", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2019-02-03", "journal": {"name": "Complex.", "pages": "4592902:1-4592902:12", "volume": "2019"}, "authors": [{"authorId": "146493028", "name": "David Gil"}, {"authorId": "34893565", "name": "Magnus Johnsson"}, {"authorId": "3144590", "name": "H. Mora"}, {"authorId": "31611204", "name": "J. Szymański"}], "citations": [{"paperId": "f08b90907443020a7f99253000f1d3a79b40a5a0", "title": "IGO_CM: An Improved Grey-Wolf Optimization Based Classification Model for Cyber Crime Data Analysis Using Machine Learning"}, {"paperId": "d4e52f63a52f7b3ee61e1fbafa4e40e60490dbb3", "title": "Machine Learning for Healthcare-IoT Security: A Review and Risk Mitigation"}, {"paperId": "50b58a7c3f47d1305d920f6dfd61071f3294b005", "title": "Comparing the influence of big data resources on medical knowledge recall for staff with and without medical collaboration platform"}, {"paperId": "9c810955e5a146d2576c474441d3b117017e6ca6", "title": "Predictive Maintenance in Industry 4.0 for the SMEs: A Decision Support System Case Study Using Open-Source Software"}, {"paperId": "cecba1a7dc72a40e740d2c9d9e17f915c709c6c2", "title": "A comprehensive survey on authentication and secure key management in internet of things: Challenges, countermeasures, and future directions"}, {"paperId": "ca05607e5412a0684d59fea4d81ccd0c0c3d0205", "title": "Construction of a Safety Management System for University Laboratories Based on Artificial Intelligence and IoT Technology"}, {"paperId": "f49eaeff339878627df61a817f7f0e1b285b37e6", "title": "Impact of big data resources on clinicians’ activation of prior medical knowledge"}, {"paperId": "a9b1aefbb44316728d1bf1f07241d3b5ef1f03ee", "title": "Room-Temperature Fabricated Multilevel Nonvolatile Lead-Free Cesium Halide Memristors for Reconfigurable In-Memory Computing."}, {"paperId": "336ff6e77b9f72821c87517be8297cddbe8f13f4", "title": "Elastic net feature selected multivariate discriminant mapreduce classification"}, {"paperId": "ab5bea9d1b9e602b5ddc5184c328c361bada4832", "title": "Security and privacy issues in smart cities/industries: technologies, applications, and challenges"}, {"paperId": "6ef4db81231ebe835b0b37935dfddfc14e8ac971", "title": "Fog Big Data Analysis for IoT Sensor Application Using Fusion Deep Learning"}, {"paperId": "8c28dd644219ec009890531672f938516b9b4bd9", "title": "CBO-IE: A Data Mining Approach for Healthcare IoT Dataset Using Chaotic Biogeography-Based Optimization and Information Entropy"}, {"paperId": "00b76c6ff3f977ff650851403b177e2b4d8b878f", "title": "IoT and artificial intelligence implementations for remote healthcare monitoring systems: A survey"}, {"paperId": "189103b4cec604c1f4e58c27ef707dd4708e6adf", "title": "The precursors of acceptance for a prosumer-led transition to a future smart grid"}, {"paperId": "4eb834fde99372872d53dcba96625866fe8ee226", "title": "IoT Technologies for Livestock Management: A Review of Present Status, Opportunities, and Future Trends"}, {"paperId": "dbb597c2805ed7b85dbe987767b7ea234d7c8ca8", "title": "Mitigating the Impact of IoT Routing Attacks on Power Consumption in IoT Healthcare Environment using Convolutional Neural Network"}, {"paperId": "76790fd6c00acdce3690a7cfa76c8447643159bf", "title": "Intelligent Resource Scheduling with Neutrosophic Knowledge and Optimized Cache Management Using Cuckoo Search Method in Cloud Computing"}, {"paperId": "ae85111c365fb851a9e9c87732ac62e75dd28417", "title": "Developing Big Data Projects in Open University Engineering Courses: Lessons Learned"}, {"paperId": "a1990e28e501bf865acddfa62c2bd4332e5e0931", "title": "Classification and Big Data Usages for Industrial Applications"}, {"paperId": "468b82fafb069f4f47bc651bc5c0f55175193874", "title": "The State-of-the-Art of Sensors and Environmental Monitoring Technologies in Buildings"}, {"paperId": "4c3da25835c000ee0b080a9e62322607b34673fe", "title": "A Comparative Study on Big Data Analytics Frameworks, Data Resources and Challenges"}, {"paperId": "041cc9220cec996f3af2c08e0ed48fe3aab4e9d7", "title": "Intelligent data-driven condition monitoring of power electronics systems using smart edge–cloud framework"}, {"paperId": "143709f68498d1751d56d86f113f4b9e77c549f9", "title": "An intelligent data capturing framework to improve condition monitoring and anomaly detection for industrial machines"}, {"paperId": "6f242860be9cde603eede4e5b9d8aee47b1d0300", "title": "Neural-Network-Optimized Vehicle Classification Using Clustered Image and Fiber-Sensor Datasets"}, {"paperId": "2b75478afae209103e8beddf353abe677e84c9ba", "title": "Comprehensive Review on Development of Smart Cities Using Industry 4.0 Technologies"}, {"paperId": "63d339078c24a2ce467580cf58f285a4ede34b6f", "title": "Logistic Regression and Predictive Analysis For AI Strategies in Public Services"}, {"paperId": "e473eb3d6c2415421fb6b98cdb697d0aa38e66fa", "title": "Data Analysis in Context-Based Statistical Modeling in Predictive Analytics"}, {"paperId": "b351632f24f5f7417fa96119893e24c587c0333d", "title": "IoT and Big Data Applications in Smart Cities: Recent Advances, Challenges, and Critical Issues"}, {"paperId": "5d12cba9fcddff285a0a6a7b9328f8aea140be21", "title": "Hierarchical Factor Analysis Methodology for Intelligent Manufacturing"}]}
