{"paperId": "9033b3cbdce5a76b4988ba840fd1ea5aa327066f", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Performance Prediction of Students in Higher Education Using Multi-Model Ensemble Approach", "abstract": "Many stakeholders including students, teachers, and educational institutions, benefit from accurately predicting student performance and facilitating data-driven policies. In this field, providing users with accurate and understandable predictions is challenging, but equally important. The goals of this study are multifaceted: to identify students at-risk; to identify differences in assessment across different environments; methods for assessing students; and to determine the relationship between teacher employment status and student achievement. This study performs an empirical comparison of the performance and efficiency of ensemble classification methods based on bagging, boosting, stacking, and voting for successful predictions. An ensemble model is developed and validated using double, triple, and quadruple combinations of classification algorithms using Naive Bayes, J48 decision trees, Adaboost, logistics, and multilayer perceptron. This study uses primary quantitative data from the learning management system of a university in Pakistan to analyze the performance of these models. The boosted tree detection method outperforms bagged trees when the standard deviation is higher and the data size is large, while stacking is best for smaller datasets. Based on behavioral analysis results of students, academic advice can be given for selected case studies. These will help educational administrators and policymakers working in education to introduce new policies and curricula accordingly.", "venue": "IEEE Access", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "136091-136108", "volume": "11"}, "authors": [{"authorId": "2112692", "name": "N. Butt"}, {"authorId": "2057054859", "name": "Z. Mahmood"}, {"authorId": "2268522418", "name": "Khawar Shakeel"}, {"authorId": "3434768", "name": "Sultan Alfarhood"}, {"authorId": "40596592", "name": "Mejdl S. Safran"}, {"authorId": "2157582207", "name": "Imran Ashraf"}], "citations": []}
