{"paperId": "903597d27895136502b0ac84c9ff20def059a52f", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Service Deployment of C4ISR Based on Genetic Simulated Annealing Algorithm", "abstract": "This study considers a service-deployment problem of C4ISR(Command, Control, Communication, Computer, Intelligence, Surveillance and Reconnaissance) system under service-oriented architecture. In order to make C4ISR sufficiently agile to meet the challenges brought by diverse combat missions and highly adversarial combat processes, this paper adopts a distributed deployment method to deploy the service processes that constitute C4ISR in multiple data centers. Considering the service information requirements and the location of specific data, a deployment constraint for a service is proposed. Further, in order to improve resource utilization and reduce communication overhead, this paper establishes a distributed service deployment model facing the characteristics of C4ISR. For the large search space and complex constraints of the optimal problem, a multi-objective genetic simulated annealing algorithm is proposed by designing the neighboring individual generation rules and combining the simulated annealing mechanism and the genetic algorithm to enhance the ability of both local search and global search. The simulation results show that this method can produce a high-quality C4ISR service-deployment scheme effectively.", "venue": "IEEE Access", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "65498-65512", "volume": "8"}, "authors": [{"authorId": "2629696", "name": "Zhiqiang Jiao"}, {"authorId": "9402972", "name": "Jieyong Zhang"}, {"authorId": "3042571", "name": "Peiyang Yao"}, {"authorId": "70587668", "name": "Lujun Wan"}, {"authorId": "47695782", "name": "Lei Ni"}], "citations": [{"paperId": "f458655848baa1a364a7b7933346b9c93372ea0f", "title": "Joint Deployment and Request Routing for Microservice Call Graphs in Data Centers"}, {"paperId": "b7ead04b6b5d5626e4b671970f23680fefceaa60", "title": "Multi-User Dynamic Computation Offloading and Resource Allocation in 5G MEC Heterogeneous Networks With Static and Dynamic Subchannels"}, {"paperId": "2f95e47751bf7824b3eef66e299d9951ba740168", "title": "Cost-minimized and Multi-plant Scheduling in Distributed Industrial Systems"}, {"paperId": "c4f97f88fc6ca078a09ae2842768ebb73df34a3f", "title": "A Novel Coverage Optimization Strategy Based on Grey Wolf Algorithm Optimized by Simulated Annealing for Wireless Sensor Networks"}]}
