{"paperId": "903e418bae110ffccdb8ff143508b7d821ee2ec1", "publicationVenue": {"id": "2f5b84b3-aa20-451e-9579-e25d1e750644", "name": "International Conference on Robotics and Artificial Intelligence", "type": "conference", "alternate_names": ["ICRAI", "Int Conf Robot Artif Intell", "International Conference Robotics and Artificial Intelligence"]}, "title": "Intelligent Transportation Systems in Smart City: A Systematic Survey", "abstract": "The idea of Smart Cities (SCs) was developed to digitize conventional urban living areas and redevelop using digital equipment to enhance lifestyle and resident security. Smart cities cover a wide range of applications such as smart government, smart energy, smart transportation, smart health, and smart education. In this paper, we have examined the mobility-related application e.g., smart transportation. We have focused on related to smart transportation like traffic safety, passenger and driver safety, obstacle detection, accident prevention, crime prevention, and detection, and more importantly smart vehicles like UAVs which played a key role in making these gadgets easy to use in urban environments. For a brief overview, 63 academic publications are examined in the field of ITS and SC technologies. Furthermore, we have provided possible solutions in terms of security in the smart transportation system.", "venue": "International Conference on Robotics and Artificial Intelligence", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference", "Review"], "publicationDate": "2023-03-03", "journal": {"name": "2023 International Conference on Robotics and Automation in Industry (ICRAI)", "pages": "1-9"}, "authors": [{"authorId": "2114796519", "name": "Muhammad Abul Hassan"}, {"authorId": "2213871828", "name": "Roofia Javed"}, {"authorId": "2203683187", "name": "Farhatullah"}, {"authorId": "1690349", "name": "F. Granelli"}, {"authorId": "2213877164", "name": "Xin Gen"}, {"authorId": "2213603503", "name": "Muhammad Rizwan"}, {"authorId": "2115825564", "name": "Syed Haider Ali"}, {"authorId": "2037047402", "name": "Hazrat Junaid"}, {"authorId": "2202288196", "name": "Sana Ullah"}], "citations": [{"paperId": "ed7fce7e828f8e26e3b1ce8c225e208a181a6735", "title": "DVFNet: A deep feature fusion-based model for the multiclassification of skin cancer utilizing dermoscopy images"}, {"paperId": "6e5a43c926bb83665bef1b9ffa8c273ba0864ad2", "title": "A Survey of Generative AI for Intelligent Transportation Systems"}, {"paperId": "377c548fb977b37c3452dbbd00c8e55b6235a933", "title": "Role of Blockchain in Higher Education Industries: A Survey"}, {"paperId": "bc6871fd275e0942c4a51a7a99b079d3d623efec", "title": "Enhancing Cricket Match Analysis through Deep Learning Techniques for Digital Spin"}, {"paperId": "2fdfc72758f7e0995b17a88ef39cdeae444f1b5c", "title": "Research on construction and management strategy of carbon neutral stadiums based on CNN-QRLSTM model combined with dynamic attention mechanism"}, {"paperId": "dc7ad1a0754902e5288e575fe62beb245ec31856", "title": "Roadside IoT Sensor-Based Crack Detection for Smart Roads"}, {"paperId": "1be75e16ba01d15b6a0df6ce6dae9b8019b75f51", "title": "Secure and Privacy-Preserving Intrusion Detection and Prevention in the Internet of Unmanned Aerial Vehicles"}, {"paperId": "8736dec3e72fcc2425694dd8975babeeea6f61b5", "title": "A Cuckoo Search-Based Trained Artificial Neural Network for Symmetric Flow Problems"}, {"paperId": "435484f0da10cce8fa517ecb6adbd97155b53c1b", "title": "Deep Transfer Learning-Based Foot No-Ball Detection in Live Cricket Match"}]}
