{"paperId": "903e61e27431cc86920345ce5d3ca252843138ed", "publicationVenue": {"id": "c6e41e66-b383-46d5-ae0e-fc3f68d71d8e", "name": "Em Questão", "alternate_names": ["Em Quest"], "issn": "1807-8893", "url": "http://www.emquestao.ufrgs.br/", "alternate_urls": ["http://www.seer.ufrgs.br/index.php/EmQuestao", "https://dialnet.unirioja.es/servlet/revista?codigo=25352"]}, "title": "Uso de deep learning para a construção de um modelo de recuperação da informação aplicado para o setor de mineração no Brasil", "abstract": "Resumo Diante do crescimento exponencial de dados e informações, proporcionado por sensores e mídias sociais, um ecossistema composto por novas infraestruturas de armazenamento e processamento, denominado Big Data, foi desenvolvido. Todo esse desenvolvimento redundou em uma nova área do conhecimento, denominada Ciência de Dados. Apesar de haver um ecossistema e uma área do conhecimento para tratar esse bloco massivo de dados e informação, o incomodo da superabundância de dados ainda permanece, e se torna mais expressivo quando as empresas tomam consciência que podem usar zetabytes de dados e informações para direcionarem a estratégia e as operações. Baseado nisso, essa pesquisa buscou desenvolver um método para resumir as notícias do setor de mineração do Brasil, identificando o efeito da similaridade semântica na análise, possibilitando a recuperação da informação e uso em processos de compreensão do setor. Nesse método foi aplicado o transformer BERTSUM para sumarizar as notícias, e após sumarizadas o transformer BERT foi aplicado para medir a similaridade entre as notícias. O método permitiu reduzir em 75% todo o bloco de texto, retirar notícias com o mesmo teor semântico, e deduzir que há um padrão no discurso das notícias relacionadas ao setor de mineração.", "venue": "Em Questão", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "Em Questão"}, "authors": [{"authorId": "2143016061", "name": "Luander Cipriano de Jesus Falcão"}, {"authorId": "2056644253", "name": "Brenner Lopes"}, {"authorId": "35167540", "name": "R. R. Souza"}, {"authorId": "2113808070", "name": "Ricardo Victor Rodrigues Barbosa"}], "citations": []}
