{"paperId": "9041ab957c818c4acae58586e538095452ae4800", "publicationVenue": {"id": "02a4454a-84c8-471c-9b40-cc045d4f3223", "name": "Security and Communication Networks", "type": "journal", "alternate_names": ["Secur Commun Netw"], "issn": "1939-0122", "url": "https://www.hindawi.com/journals/scn/", "alternate_urls": ["http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1939-0122", "http://www.interscience.wiley.com/journal/security"]}, "title": "Design and Application of Intelligent Management Platform Based on Big Data", "abstract": "Big data technology has greatly promoted the construction of intelligent administrative management and improved the decision-making ability continuously. Data mining also lays a solid foundation for the construction of administrative management platform and reflects the potential value of data. In this study, an intelligent management platform based on big data is designed and implemented. First, the problems of the intellectualization of administrative management are discussed, and the big data platform and functional framework of administrative management are introduced. Second, in order to apply data mining to administrative management, the object of data mining in administrative management is defined, and a data mining system is designed. Finally, the application of machine learning methods such as cluster analysis in administrative management is analyzed in detail. The research results show that the application of intelligent management platform based on big data can promote the construction of intelligent administration and lay a good foundation for the development of more perfect intelligent administrative management.", "venue": "Security and Communication Networks", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-10-11", "journal": {"name": "Security and Communication Networks"}, "authors": [{"authorId": "2218205250", "name": "Yunuo Su"}, {"authorId": "2187730217", "name": "Minhui Dai"}, {"authorId": "2153072262", "name": "Haoyu Zhou"}], "citations": [{"paperId": "50d4c9fc5fb3931104f7188ec026f5632b3d1539", "title": "Retracted: Design and Application of Intelligent Management Platform Based on Big Data"}, {"paperId": "ff07f7f84fbaa91e8af55b6bfae5192fb40502b9", "title": "Systematic review of mixing technology for recycling waste tailings as cemented paste backfill in mines in China"}]}
