{"paperId": "9050f42d1269e6c7c170c579134f79f50c661762", "publicationVenue": {"id": "5dfdcc5e-f28b-42bd-9832-bf3894169b1c", "name": "International Conference on Information Control Systems & Technologies", "type": "conference", "alternate_names": ["Int Conf Softw Test Verification Valid", "International Conference on Software Testing, Verification, and Validation", "Int Conf Inf Control Syst  Technol", "Int Conf Sens Technol", "International Conferences on Sensing Technology", "International Conference on Sensing Technology", "ICST"], "url": "http://www.wikicfp.com/cfp/program?id=1483"}, "title": "Maturity Assessment and Strategy to Improve Master Data Management of Geospatial Data Case Study: Statistics Indonesia", "abstract": "Geospatial data is important in supporting census and survey in Statistics Indonesia. Some problems exist about it are inaccurate maps, the existence of incomplete data attribute, and there are many versions exist in silo systems. They can impact the result of census or survey data quality. Improvement applied to overcome problems is managing geospatial data by adopting geodatabase. To improve the application in the future, it needs to be evaluated. By the reason, this research aims to measure the maturity level of master data management of geospatial data and arrange strategy to improve master data management of geospatial data in the future. This research used Master Data Management Maturity Model to measure the level of maturity and mapped the result to reference and master data management activity of Data Management Body of Knowledge. The result is Statistics Indonesia has not achieved any level yet for geospatial master data management and must concern to apply five activities for improvement in the future namely are to understand reference and master data integration needs, to identify reference and master data sources and contributors, to define and maintain the data integration architecture, to define and maintain match rules, and to establish golden record.", "venue": "International Conference on Information Control Systems & Technologies", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference", "Review"], "publicationDate": "2019-07-01", "journal": {"name": "2019 5th International Conference on Science and Technology (ICST)", "pages": "1-6", "volume": "1"}, "authors": [{"authorId": "1491637663", "name": "Peny Rishartati"}, {"authorId": "1885346260", "name": "Nia Dwi Rahayuningtyas"}, {"authorId": "1396355255", "name": "J. Maulina"}, {"authorId": "1491637166", "name": "Aisha Adetia"}, {"authorId": "9298128", "name": "Y. Ruldeviyani"}], "citations": [{"paperId": "690b4ffdd9be14a5058a53bb98f507bebc7c2109", "title": "Improvement Master Data Management : Case Study Of The Directorate General Of The Religious Courts Of The Supreme Court Of The Republic Of Indonesia"}, {"paperId": "1d89028e8ad0285370b7988f5bec8b8f89d53a1a", "title": "Penilaian Kematangan Master Data Management: Studi Kasus Perusahaan XYZ"}, {"paperId": "24e02b15f4bbe18aabcf0dd0494f788e2b078931", "title": "Improving Data Quality and Data Governance Using Master Data Management: A Review"}]}
