{"paperId": "9050a4bc6a14df974954ab8d152e09c1a87ccd97", "publicationVenue": {"id": "56001f1b-2484-49f2-8919-c3b70164f58e", "name": "Artificial Intelligence and Symbolic Computation", "type": "conference", "alternate_names": ["Artif Intell Symb Comput", "Australasian Information Security Conference", "AISC", "Australas Inf Secur Conf"], "url": "http://www.wikicfp.com/cfp/program?id=127"}, "title": "Incorporating Deep Learning Methodologies into the Creation of Healthcare Systems", "abstract": "Healthcare is an essential part of the medical field in the modern digital age. When it comes to illness prediction and other healthcare-related tasks, a healthcare system needs to examine massive amounts of patient data. A smart system would be able to analyse a patient's social life, medical history, and other lifestyle factors to forecast the likelihood of a health problem. The HRS, or health recommender system, is rapidly expanding in significance as a healthcare service delivery mechanism. In this setting, health intelligent systems have established themselves as critical components of healthcare delivery decision making. Their primary focus is guaranteeing the high quality, reliability, authenticity, and privacy of information at all times so that it may be used when it is most useful. The health recommender system is crucial for deriving outputs like proposing diagnoses, health insurance, clinical pathway-based treatment techniques, and alternative medications based on the patient's health profile as more and more individuals rely on social networks to learn about their health.In order to minimize the time and money spent on healthcare, recent studies have focused on using vast amounts of medical data by merging multimodal data from many sources. When it comes to making decisions about a patient's health, big data analytics with recommender systems play a crucial part in the healthcare industry. This article suggests a LeNET Convolution neural network (CNN) that sheds light on the application of big data analysis to the development of a useful health recommendation systems and shows how the healthcare sector can benefit from shifting from a standard model to a more individualized one in the context of telemedicine. The suggested method yields lower error rates than competing methods by taking both the Root Squared Mean Error (RSME) and Average Absolute Error (AAE) into account.", "venue": "Artificial Intelligence and Symbolic Computation", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-01-27", "journal": {"name": "2023 International Conference on Artificial Intelligence and Smart Communication (AISC)", "pages": "994-998"}, "authors": [{"authorId": "2152490091", "name": "Shakir Khan"}, {"authorId": "2176926305", "name": "Viswanathasarma Ch"}, {"authorId": "145132114", "name": "K.Guna sekaran"}, {"authorId": "2053408806", "name": "K. Joshi"}, {"authorId": "2082446060", "name": "C. Roy"}, {"authorId": "2074227904", "name": "M. Tiwari"}], "citations": [{"paperId": "cdd53c2e8eda37b684615389509e11a109d9a0b2", "title": "Turbulence Modeling Through Deep Learning: An In-Depth Study of Wasserstein GANs"}, {"paperId": "8d16d441346af90ef674f74612bc445a330fdbdd", "title": "A Novel Approach to Grover's Quantum Algorithm Simulation: Cloud-Based Parallel Computing Enhancements"}, {"paperId": "5d4a823424616ceb305c367cd5bb1f07d69748c0", "title": "Hybrid Majority Voting: Prediction and Classification Model for Obesity"}, {"paperId": "36886558e935efc822fe3b87f3fcf59d12ed75fe", "title": "Bridged-U-Net-ASPP-EVO and Deep Learning Optimization for Brain Tumor Segmentation"}]}
