{"paperId": "9059d77712fae9de156b798252df1143068c275a", "publicationVenue": {"id": "1620da87-4387-4b9a-9bf4-22fdf74d4dc3", "name": "Symmetry", "type": "journal", "issn": "2073-8994", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172134", "alternate_urls": ["https://www.mdpi.com/journal/symmetry", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172134"]}, "title": "A Q-Learning-Based Approach for Deploying Dynamic Service Function Chains", "abstract": "As the size and service requirements of today’s networks gradually increase, large numbers of proprietary devices are deployed, which leads to network complexity, information security crises and makes network service and service provider management increasingly difficult. Network function virtualization (NFV) technology is one solution to this problem. NFV separates network functions from hardware and deploys them as software on a common server. NFV can be used to improve service flexibility and isolate the services provided for each user, thus guaranteeing the security of user data. Therefore, the use of NFV technology includes many problems worth studying. For example, when there is a free choice of network path, one problem is how to choose a service function chain (SFC) that both meets the requirements and offers the service provider maximum profit. Most existing solutions are heuristic algorithms with high time efficiency, or integer linear programming (ILP) algorithms with high accuracy. It’s necessary to design an algorithm that symmetrically considers both time efficiency and accuracy. In this paper, we propose the Q-learning Framework Hybrid Module algorithm (QLFHM), which includes reinforcement learning to solve this SFC deployment problem in dynamic networks. The reinforcement learning module in QLFHM is responsible for the output of alternative paths, while the load balancing module in QLFHM is responsible for picking the optimal solution from them. The results of a comparison simulation experiment on a dynamic network topology show that the proposed algorithm can output the approximate optimal solution in a relatively short time while also considering the network load balance. Thus, it achieves the goal of maximizing the benefit to the service provider.", "venue": "Symmetry", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-11-16", "journal": {"name": "Symmetry", "pages": "646", "volume": "10"}, "authors": [{"authorId": null, "name": "Jian Sun"}, {"authorId": "2115500989", "name": "Guanhua Huang"}, {"authorId": "143847421", "name": "Gang Sun"}, {"authorId": "2484540", "name": "Hong-Fang Yu"}, {"authorId": "3097765", "name": "A. K. Sangaiah"}, {"authorId": "2964485", "name": "Victor Chang"}], "citations": [{"paperId": "da2a8b292f977df90d872b272cf1daf0a088eecc", "title": "Smart Service Function Chain System for Dynamic Traffic Steering using Reinforcement Learning (CHRL)"}, {"paperId": "8562952aa9f360a678915cf8e1831eb99a184b62", "title": "An Approach to Network Service Placement Reconciling Optimality and Scalability"}, {"paperId": "eaa7cc1a101b9bd5d7d6ac27259bb3e249f0ff35", "title": "A decentralized adaptation of model-free Q-learning for thermal-aware energy-efficient virtual machine placement in cloud data centers"}, {"paperId": "e0e05b8b34166ee25d7a0e58393523f1ce88deda", "title": "DSPVR: dynamic SFC placement with VNF reuse in Fog-Cloud Computing using Deep Reinforcement Learning"}, {"paperId": "6b79ec27a0ea89975b024fdb7c5e2a22f2170518", "title": "An Optimal SDN-Based Wavelength Allocation and Routing Method for 5G Network"}, {"paperId": "41d0865a16d0f2ca17c06d67e968e3de0d02389f", "title": "Knowledge defined networks on the edge for service function chaining and reactive traffic steering"}, {"paperId": "5099df8a8c59b57c179e0bad234777dde729ab22", "title": "Optimization of 5G/6G Telecommunication Infrastructure through an NFV-Based Element Management System"}, {"paperId": "7cd61d828a2feebc938a551bc8cabdeb037ba35b", "title": "Efficient instance reuse approach for service function chain placement in mobile edge computing"}, {"paperId": "b6682681e9adeed55afe02101536e575e461e18e", "title": "An Approach to Network Service Placement using Intelligent Search Strategies over Branch-and-Bound"}, {"paperId": "21f93d3874f1186b69af08f4b3ea678ba98f41e1", "title": "A survey of VNF forwarding graph embedding in B5G/6G networks"}, {"paperId": "30feb4d2f186730bcd99db482ae0bafebf1826f5", "title": "DRL-QOR: Deep Reinforcement Learning-Based QoS/QoE-Aware Adaptive Online Orchestration in NFV-Enabled Networks"}, {"paperId": "81d0a71431f0d8717634d9449f9ecfbbfa8ed170", "title": "A Cross-Domain Service Function Chain Deployment Scheme Based on Bargaining Game"}, {"paperId": "4ef543b815bf612a52c558693c8469c2f570bb0c", "title": "Environment Aware Adaptive Q-Learning to Deploy SFC on Edge Computing"}, {"paperId": "07a43a99506abc6f506c70da80dabd8098b955d2", "title": "Towards AI-enabled Microservice Architecture for Network Function Virtualization"}, {"paperId": "ece701dce1f505632a23df01eaeaf264b5331d5b", "title": "Service Function Chaining and Traffic Steering in SDN using Graph Neural Network"}, {"paperId": "ae625e00c77adfd4d45a8c1717e036b7f12178d5", "title": "An Enhanced Reinforcement Learning Approach for Dynamic Placement of Virtual Network Functions"}, {"paperId": "e402547a3cfa9ec455055def2c2add46634a130e", "title": "Symmetry-Adapted Machine Learning for Information Security"}, {"paperId": "a0194ad270bd415548b9f8ee111563d80255f1fe", "title": "A Novel Approach for Service Function Chain Dynamic Orchestration in Edge Clouds"}, {"paperId": "6225c929a65c927d26eb191ec11cec06e0593968", "title": "Depth-Optimized Delay-Aware Tree (DO-DAT) for Virtual Network Function Placement"}, {"paperId": "00d7ae07d3d9e0c556f2b8b2a6498a5f3af96076", "title": "Optimizing NFV Chain Deployment in Software-Defined Cellular Core"}, {"paperId": "410c6454989ff651f65fa0935994aa74526994a3", "title": "Machine Learning for Performance-Aware Virtual Network Function Placement"}, {"paperId": "d98f834035e84e3bea23dce12642ca0537d7f27d", "title": "Path Mapping Approach for Network Function Virtualization Resource Allocation with Network Function Decomposition Support"}, {"paperId": "b80d7b38da2a5ecba659e10e73a091efea858aee", "title": "Reinforcement Learning Approach to Design Practical Adaptive Control for a Small-Scale Intelligent Vehicle"}, {"paperId": "498af447846ed7428d808d227ecc4f60684e6163", "title": "The Softwarised Network Data Zoo"}, {"paperId": "3bb23e5a4b897d43cfa2af40369ef79805c08234", "title": "Traffic flow guidance algorithm in intelligent transportation systems considering the effect of non-floating vehicle"}, {"paperId": "ccc50985a0b12445b04af2ba0167328dec0b08dd", "title": "Enhancing development and deployment of softwarised network services"}, {"paperId": "145f0953c70448aa1632b3faaaeb6172eecadea5", "title": "Network Slicing: Recent Advances, Taxonomy, Requirements, and Open Research Challenges"}, {"paperId": "79152897350079faae3b65ac15000f38bab7e209", "title": "A Hybrid Learning Framework for Service Function Chaining Across Geo-Distributed Data Centers"}, {"paperId": "c9de77ae62a3ef1b6afa0b247c3ec5d083ca5e12", "title": "P4SC: A High Performance and Flexible Framework for Service Function Chain"}]}
