{"paperId": "906f58b34ae379513c9d001247520cf676c0e808", "publicationVenue": {"id": "8506a01a-40b8-4e6f-bbb8-ce2492139c15", "name": "International Journal of Molecular Sciences", "type": "journal", "alternate_names": ["Int J Mol Sci"], "issn": "1422-0067", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-157693", "alternate_urls": ["https://www.mdpi.com/journal/ijms", "http://www.mdpi.com/journal/ijms/", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-157693"]}, "title": "Autoinflammatory Diseases and Cytokine Storms—Imbalances of Innate and Adaptative Immunity", "abstract": "Innate and adaptive immune responses have a well-known link and represent the distinctive origins of several diseases, many of which may be the consequence of the loss of balance between these two responses. Indeed, autoinflammation and autoimmunity represent the two extremes of a continuous spectrum of pathologic conditions with numerous overlaps in different pathologies. A common characteristic of these dysregulations is represented by hyperinflammation, which is an exaggerated response of the immune system, especially involving white blood cells, macrophages, and inflammasome activation with the hyperproduction of cytokines in response to various triggering stimuli. Moreover, hyperinflammation is of great interest, as it is one of the main manifestations of COVID-19 infection, and the cytokine storm and its most important components are the targets of the pharmacological treatments used to combat COVID-19 damage. In this context, the purpose of our review is to provide a focus on the pathogenesis of autoinflammation and, in particular, of hyperinflammation in order to generate insights for the identification of new therapeutic targets and strategies.", "venue": "International Journal of Molecular Sciences", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2021-10-01", "journal": {"name": "International Journal of Molecular Sciences", "volume": "22"}, "authors": [{"authorId": "5384617", "name": "A. Marcuzzi"}, {"authorId": "49058963", "name": "E. Melloni"}, {"authorId": "4754758", "name": "G. Zauli"}, {"authorId": "153317048", "name": "Arianna Romani"}, {"authorId": "3786421", "name": "P. Secchiero"}, {"authorId": "144814226", "name": "N. Maximova"}, {"authorId": "49393484", "name": "E. Rimondi"}], "citations": [{"paperId": "b59c172638fde3a98c2763de0754d9c762798142", "title": "Inflammation propagation modeled as a reaction-diffusion wave."}, {"paperId": "33e2f62854645e40e83d3d223576ce42d2dbe993", "title": "Nutrients, herbal bioactive derivatives and commensal microbiota as tools to lower the risk of SARS-CoV-2 infection"}, {"paperId": "c85fe1e30b0bd530322ab2e3b2f0e8d8a99a580c", "title": "Mucosal immunization with Lactiplantibacillus plantarum-displaying recombinant SARS-CoV-2 epitopes on the surface induces humoral and mucosal immune responses in mice"}, {"paperId": "2db613b0df3eb612e34376879b0f8cf661f43044", "title": "SGLT-2 Inhibitors and the Inflammasome: What’s Next in the 21st Century?"}, {"paperId": "f98bff5535a98c2f3ce698fc13bd3b55a969883e", "title": "Relación entre COVID-19 con el desarrollo de enfermedades autoinmunes"}, {"paperId": "1bd2683978f8030c09e6190b9dbd0984d63b740a", "title": "From Pathogens to Cancer: Are Cancer Cells Evolved Mitochondrial Super Cells?"}, {"paperId": "0f8c91221e2dc23d9e4709aa416b4a8651628aaa", "title": "Antiviral Innate Immune Responses in Autoimmunity: Receptors, Pathways, and Therapeutic Targeting"}, {"paperId": "f6aabf321eee188f7a9f07a1c7b4c5f306f62512", "title": "Interferon in systemic lupus erythematosus—A halfway between monogenic autoinflammatory and autoimmune disease"}, {"paperId": "cdb07c2fbcc30064b18142b27b7ac6627a467079", "title": "Relationship Between Monocyte-to-Lymphocyte Ratio as Well as Other Leukocyte-Derived Ratios and Carotid Plaques in Patients with Coronary Heart Disease: A RCSCD-TCM Study"}, {"paperId": "2f198a4eba6a63c5a2556e9a1939720667842edc", "title": "Central nervous system manifestations of monogenic autoinflammatory disorders and the neurotropic features of SARS-CoV-2: Drawing the parallels"}, {"paperId": "5a0e2b581ef3c8fed0f8f05068da81462ec7c672", "title": "Anti‐inflammatory effects of cannabidiol against lipopolysaccharides in cardiac sodium channels"}, {"paperId": "0b3c8f31dd9bb85873dac040c2b72e03fd62400f", "title": "Role of Sodium-Glucose Co-Transporter 2 Inhibitors in the Regulation of Inflammatory Processes in Animal Models"}, {"paperId": "eed9b56a52e4d8b37acdb9389e364ebcb3eb9d09", "title": "Boosting Vaccine-Elicited Respiratory Mucosal and Systemic COVID-19 Immunity in Mice With the Oral Lactobacillus plantarum"}]}
