{"paperId": "90701bc77eae73acc8fbff26fc2efa36c4d04e6e", "publicationVenue": {"id": "2a2d0af7-b79a-42c9-bb97-232702c18c02", "name": "International Conference on Operations Research and Enterprise Systems", "type": "conference", "alternate_names": ["Int Conf Oper Res Enterp Syst", "ICORES"], "url": "http://www.icores.org/"}, "title": "Multi-Objective Task Assignment Solution for Parked Vehicular Computing", "abstract": ": With signiﬁcant advances in recent technology, computational power must meet new demands. As a result, Multi-access Edge Computing (MEC) is a new networking paradigm that has received a surge in interest from both academia and industry. MEC aims to push powerful computing and storage capabilities from remote cloud servers to up-close edge servers. Vehicular Edge Computing (VEC), a subﬁeld of MEC, has been introduced to speciﬁcally increase the computing capacity of vehicular networks, an essential component for the development of Intelligent Transportation Systems (ITS). A problem in the current development of VEC is the high cost of installing enough edge servers to compute all ofﬂoaded tasks at peak hours. However, we have observed that parked vehicles (PVs) are a rich reserve of underutilized computing resources, and their incorporation into the VEC network could lead to a solution to the aforementioned problem. This paper proposes a task ofﬂoading system with an assumed parking time estimation mechanism. Then, a novel formulation of the task ofﬂoading problem is presented that minimizes both task delay and wireless channel load. Finally, a matching based heuristic is proposed and evaluated at various conﬁgurations of the VEC environment.", "venue": "International Conference on Operations Research and Enterprise Systems", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"pages": "193-202"}, "authors": [{"authorId": "2152149810", "name": "Jia He Sun"}, {"authorId": "2270150", "name": "Salimur Choudhury"}, {"authorId": "1731315", "name": "K. Salomaa"}], "citations": []}
