{"paperId": "907e03db3471d6d22815d786fba2b71b91c946bf", "publicationVenue": {"id": "6b9982c4-b772-466f-a442-15ccbb7ac6e3", "name": "International Journal of Computer Networks And Applications", "type": "journal", "alternate_names": ["Int J Comput Netw Appl"], "issn": "2395-0455", "url": "https://www.ijcna.org/"}, "title": "An Interoperability Framework for Enhanced Security of Handheld Devices Using IoT-Based Secure Energy Efficient Firefly Optimization Algorithm", "abstract": "– Security is a major challenge in the Internet of Things (IoT) domain as it plays a crucial role in a safe and uninterrupted data transmission, across various hand-held devices connected to the network. Establishing a secure Routing Protocol for Low power and lossy networks (RPL) is necessary and crucial, as it is the standard RPL network in IoT that helps to remove malicious nodes from the network. The existing researches focused on developing energy-saving techniques, malicious node detection techniques, as well as security-enhancing techniques, but neglected energy efficiency, and other trust-related considerations. This resulted in reduced confidentiality and unauthorized access to user data. To overcome these limitations, a Secure Energy Efficient Firefly Optimization Algorithm in RPL (SEEFOA-RPL) is proposed in this research for establishing a reliable and energy-efficient routing path by using Destination-Oriented Directed Acyclic Graph (DODAG) architecture. The proposed algorithm improves security measures in handheld devices such as smartphones, wearable watches, digital cameras, portable media players, and tablets. Initially, a trust model for the RPL network is established to calculate the trust parameters that help in building a secure routing in the network. The SEEFOA is capable of solving complex optimization problems, and finds the best optimum solution for a secure-energy efficient routing path. The proposed SEEFOA-RPL delivers a high-level performance in terms of Detection Rate (DR), False Negative Rate (FNR), and False Positive Rate (FPR), respectively measured at 99%, 12%, and 17% in an attack interval 4, and Packet Drop Ratio (PDR) measured at 82% in an attack interval of 1.5.", "venue": "International Journal of Computer Networks And Applications", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-10-01", "journal": {"name": "International Journal of Computer Networks and Applications"}, "authors": [{"authorId": "2237720757", "name": "G. S. Sapna"}, {"authorId": "2237720543", "name": "Shashikumar Dandinashivara Revanna"}], "citations": []}
