{"paperId": "908dcac708566e6a825cb1b9f6c0644ff49fa703", "publicationVenue": {"id": "fcbcaf18-8ab1-43e1-a973-604bbc7e344e", "name": "Proceedings of the VLDB Endowment", "type": "journal", "alternate_names": ["Proceedings of The Vldb Endowment", "Proc VLDB Endow", "Proc Vldb Endow"], "issn": "2150-8097", "url": "http://dl.acm.org/toc.cfm?id=J1174", "alternate_urls": ["http://portal.acm.org/toc.cfm?CFID=21632689&CFTOKEN=99329904&WantType=Affiliated%20Organizations&coll=ACM&dl=ACM&id=J1174&idx=J1174&part=affil&title=VLDB%20Endowment&type=periodical"]}, "title": "Rumble: Data Independence for Large Messy Data Sets", "abstract": "This paper introduces Rumble, a query execution engine for large, heterogeneous, and nested collections of JSON objects built on top of Apache Spark. While data sets of this type are more and more wide-spread, most existing tools are built around a tabular data model, creating an impedance mismatch for both the engine and the query interface. In contrast, Rumble uses JSONiq, a standardized language specifically designed for querying JSON documents. The key challenge in the design and implementation of Rumble is mapping the recursive structure of JSON documents and JSONiq queries onto Spark's execution primitives based on tabular data frames. Our solution is to translate a JSONiq expression into a tree of iterators that dynamically switch between local and distributed execution modes depending on the nesting level. By overcoming the impedance mismatch in the engine, Rumble frees the user from solving the same problem for every single query, thus increasing their productivity considerably. As we show in extensive experiments, Rumble is able to scale to large and complex data sets in the terabyte range with a similar or better performance than other engines. The results also illustrate that Codd's concept of data independence makes as much sense for heterogeneous, nested data sets as it does on highly structured tables.", "venue": "Proceedings of the VLDB Endowment", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-10-20", "journal": {"name": "Proc. VLDB Endow.", "pages": "498-506", "volume": "14"}, "authors": [{"authorId": "2068635149", "name": "Ingo Müller"}, {"authorId": "2702548", "name": "G. Fourny"}, {"authorId": "102599465", "name": "S. Irimescu"}, {"authorId": "1387971934", "name": "Can Berker Cikis"}, {"authorId": "144641551", "name": "G. Alonso"}], "citations": [{"paperId": "6a311b25886058dd7cca582a49495f83faa2d779", "title": "GIO: Generating Efficient Matrix and Frame Readers for Custom Data Formats by Example"}, {"paperId": "eeb6ab9707eda33fa08c18b786597b3869eccb07", "title": "Fast JSON parser using metaprogramming on GPU"}, {"paperId": "0323f7f26a7a6c994f4e34c4661e5e471765ada8", "title": "RumbleML: program the lakehouse with JSONiq"}, {"paperId": "916f6aa78aeb78ed3cf4976e1f8c67b634f3fc95", "title": "Evaluating query languages and systems for high-energy physics data"}, {"paperId": "6e4dcf9494fa82aef0980eb87fc5eaa04fe8f5ce", "title": "Data on the existence ratio and social utility of Nash equilibria and of the Perfectly Transparent Equilibrium"}, {"paperId": "770911d314dd7866153f2be235607c0eb32255bf", "title": "Rhyme: A Data-Centric Expressive Query Language for Nested Data Structures"}, {"paperId": "470fe6f6c2f18a0ae0828db8a41e62b960e11446", "title": "A JSON Document Algebra for Query Optimization"}, {"paperId": "20e8d184b4f22104374fdfaf72fbbd35ee59aa59", "title": "TraNCE: Transforming Nested Collections Efficiently"}]}
