{"paperId": "909d848b9634f2dd335beeeaa9e61bf246255fe2", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Anomaly-Based Intrusion on IoT Networks Using AIGAN-a Generative Adversarial Network", "abstract": "Adversarial attacks have threatened the credibility of machine learning models and cast doubts over the integrity of data. The attacks have created much harm in the fields of computer vision, and natural language processing. In this paper, we focus on the adversarial attack, in particular the poisoning attack, against the network intrusion detection system (NIDS), which is often viewed as the first line of defense against cyber threats. We develop a generative adversarial network (GAN) in AIGAN, which uses deep learning techniques to generate adversarial data and to conduct an anomaly attack on IoT networks. To evaluate the effectiveness of our generator, we measure the similarities between real and fake data using the Jaccard similarity index, in addition comparing the F1-scores from four generic algorithms: multilayer perception, logistic regression, decision tree, random forest. We contrast the performance of ten machine learning classifiers experimented on two real IoT datasets and their fake adversarial samples. Our work highlights a vulnerable side of NIDS created by machine learning when attacked with adversarial perturbation.", "venue": "IEEE Access", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "91116-91132", "volume": "11"}, "authors": [{"authorId": "2154721414", "name": "Zhipeng Liu"}, {"authorId": "2107760029", "name": "Junyi Hu"}, {"authorId": "2233858010", "name": "Yang Liu"}, {"authorId": "2061563075", "name": "K. Roy"}, {"authorId": "2151461275", "name": "Xiaohong Yuan"}, {"authorId": "3180423", "name": "Jinsheng Xu"}], "citations": []}
