{"paperId": "909feb5968e291c92cd1ed0cf2985fb11924ae92", "publicationVenue": {"id": "64c0e3be-ec7c-424d-bf61-495e56d9da6d", "name": "Proceedings of the International Conference on Industrial Engineering and Operations Management", "alternate_names": ["Proc Int Conf Ind Eng Oper Manag"], "issn": "2169-8767", "url": "http://ieomsociety.org/ieom2017/"}, "title": "Developing Performance Measurement Tool for Slow-Onset Humanitarian Supply Chain Operation", "abstract": "The aim of this paper is to propose a conceptual performance measurement framework that can efficiently assess and evaluate the supply chain operation of school-meal programs (i.e. one of the focused slow-onset humanitarian aid operations by large humanitarian organizations). Such framework is derived from the well-known Supply Chain Operational Reference (SCOR) model. Numerous studies have applied the SCOR models to evaluate and enhance the performances of sudden-onset humanitarian relief operations, while application of the SCOR model on slow-onset humanitarian supply chain operation is scarce. Since the designs for operations of the sudden-onset and slow-onset disasters differ from one another, the SCOR application needs to be adapted. This paper is among the first to explore the applicability of the SCOR model on slow-onset humanitarian supply chains. The proposed conceptual framework identifies the scope and content of the school-meal supply chain. It also visualizes process configuration, where different stakeholders, processes, and flows are comprised. The conceptual framework serves as an initial stage of our full development of the SCOR model and its detailed performance metrics to evaluate the school-meal supply chain. Over the long-run, we aim at delivering a practical performance measurement tool to assist humanitarian logisticians in improving their supply chains.", "venue": "Proceedings of the International Conference on Industrial Engineering and Operations Management", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2021-03-07", "journal": {"name": "Proceedings of the International Conference on Industrial Engineering and Operations Management"}, "authors": [{"authorId": "68982465", "name": "Narath Bhusiri"}, {"authorId": "2266628003", "name": "Huay Ling Tay"}], "citations": [{"paperId": "657cb01ffc07fb4a53c3fe8e64029e2af830c6ad", "title": "A systematic review of humanitarian supply chains performance measurement literature from 2007 to 2021"}]}
