{"paperId": "90bdf017887beb3744b0af508b598a9d74601f4e", "publicationVenue": {"id": "e2742a49-1b55-4a31-b319-7455fa5e12d4", "name": "IEEE Transactions on Services Computing", "type": "journal", "alternate_names": ["IEEE Trans Serv Comput"], "issn": "1939-1374", "url": "http://www.computer.org/tsc", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=4629386"]}, "title": "MapReduce Task Scheduling in Heterogeneous Geo-Distributed Data Centers", "abstract": "Different data transmission times, processing times which are difficult to predict and node-dependent access times make MapReduce task scheduling rather complex. In this article, we consider the problem of scheduling MapReduce tasks to heterogeneous geo-distributed data centers to minimize the total tardiness. A new architecture is constructed to analyze data in the considered scenario. We model distinct data transmission levels, inter- and intra- data centers and heterogeneity of nodes mathematically. An algorithm framework is proposed to schedule MapReduce tasks to heterogeneous nodes in geographically distributed data centers. The proposed algorithm is suitable for both Hadoop MRv1 and MRv2. In terms of the number of idle containers detected in each heartbeat, the same number of tasks are selected from a sorted job sequence. For the map and reduce phases, two measurements are developed with data locality and completion time, respectively, based on which the classical Hungarian algorithm is adopted to optimally assign selected tasks to corresponding idle containers. Components and parameters of the proposal are statistically calibrated over a large set of random instances. A comparison of the proposed algorithm to existing methods for similar problems is carried out. Experimental results demonstrate the proposal is effective for the considered problem.", "venue": "IEEE Transactions on Services Computing", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-11-01", "journal": {"name": "IEEE Transactions on Services Computing", "pages": "3317-3329", "volume": "15"}, "authors": [{"authorId": "121856658", "name": "Xiaoping Li"}, {"authorId": "2130405439", "name": "Fuchao Chen"}, {"authorId": "144463671", "name": "Rubén Ruiz"}, {"authorId": "40062217", "name": "Jie Zhu"}], "citations": [{"paperId": "645e3aa86cbe7202cb24be15e7d3e330f869fe3e", "title": "Cost-aware optimal resource provisioning Map-Reduce scheduler for hadoop framework"}, {"paperId": "e56a946316a616cdfe3ba3e333e6452c4a4f4fd7", "title": "Design of an Efficient Multidomain Augmented Data Aggregation Model to Solve Heterogeneity Issues for IoT Deployments"}, {"paperId": "8faa343c0ceb426ecc0c45b4ca0ae7e2ceebf1ec", "title": "Cost-Aware Resource Recommendation for DAG-Based Big Data Workflows: An Apache Spark Case Study"}, {"paperId": "ab1f8c4a5c05b26159ac7a9a63f7ea32ff81232e", "title": "Improving MapReduce heterogeneous performance using KNN fair share scheduling"}]}
