{"paperId": "90c2fea01f8f5ff8ddf630d68fe1b5b8a7b8d452", "publicationVenue": {"id": "da18ef0b-933e-4678-b2fa-4290baf6970a", "name": "International Conference on Communication, Computing & Security", "type": "conference", "alternate_names": ["Int Conf Commun Comput  Secur", "International Conference Communication and Computing Systems", "ICCCS", "International Conference on Computer and Communication Systems", "Int Conf Comput Commun Syst", "Int Conf Commun Comput Syst"]}, "title": "A Segmented D2D Caching Strategy Based on User Preferences and Overall Popularity", "abstract": "To reduce the burden on the core network, a technique for putting cached files in several geographic locations is being implemented and is developing into Mobile Edge Caching technology. In this paper, the mobile edge caching problem with device mobility and user preferences for D2D content-sharing scenarios is studied. First, we construct a Markov chain-based device mobility model and a user preferences prediction model based on social proximity, file topic classification, and user historical request records. Then we design a caching policy that combines user preferences and overall popularity by dividing the user cache space into two segments, caching files from the library sorted by overall popularity and the library sorted by user preferences, respectively. Furthermore, we maximize the system cache hit probability and prove that it is a non-convex nonlinear problem. Consequently, a particle swarm optimization with adaptive inertia weights is presented to discover the optimal segmentation point of the file library and user cache space. The convergence speed of this algorithm has been significantly increased. The simulation results demonstrate that the caching strategy outperforms even traditional caching strategies.", "venue": "International Conference on Communication, Computing & Security", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-04-21", "journal": {"name": "2023 8th International Conference on Computer and Communication Systems (ICCCS)", "pages": "239-246"}, "authors": [{"authorId": "1944476496", "name": "Qunying Wu"}, {"authorId": "116421557", "name": "Pei-Jan Huang"}, {"authorId": "1491095729", "name": "Qiaoe Zheng"}, {"authorId": "1410107399", "name": "Hui Song"}], "citations": []}
