{"paperId": "90cc7c0aec287ecbf98ba8a60eb701264e700d79", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "A Generalized Enhanced Quantum Fuzzy Approach for Efficient Data Clustering", "abstract": "Data clustering is a challenging task to gain insights into data in various fields. In this paper, an Enhanced Quantum-Inspired Evolutionary Fuzzy C-Means (EQIE-FCM) algorithm is proposed for data clustering. In the EQIE-FCM, quantum computing concept is utilized in combination with the FCM algorithm to improve the clustering process by evolving the clustering parameters. The improvement in the clustering process leads to improvement in the quality of clustering results. To validate the quality of clustering results achieved by the proposed EQIE-FCM approach, its performance is compared with the other quantum-based fuzzy clustering approaches and also with other evolutionary clustering approaches. To evaluate the performance of these approaches, extensive experiments are being carried out on various benchmark datasets and on the protein database that comprises of four superfamilies. The results indicate that the proposed EQIE-FCM approach finds the optimal value of fitness function and the fuzzifier parameter for the reported datasets. In addition to this, the proposed EQIE-FCM approach also finds the optimal number of clusters and more accurate location of initial cluster centers for these benchmark datasets. Thus, it can be regarded as a more efficient approach for data clustering.", "venue": "IEEE Access", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "50347-50361", "volume": "7"}, "authors": [{"authorId": "1815524", "name": "Neha Bharill"}, {"authorId": "39832205", "name": "O. Patel"}, {"authorId": "39656615", "name": "Aruna Tiwari"}, {"authorId": "2054767894", "name": "Lifeng Mu"}, {"authorId": "2286591", "name": "Dong-Lin Li"}, {"authorId": "9910377", "name": "M. Mohanty"}, {"authorId": "3025665", "name": "Omprakash Kaiwartya"}, {"authorId": "145499331", "name": "M. Prasad"}], "citations": [{"paperId": "dd5360ae2218ea5f8a8ee343d5454d254f74ac18", "title": "Quantum Machine Learning for Security Assessment in the Internet of Medical Things (IoMT)"}, {"paperId": "eb47121da239d4801ce8ee4d1c03022cf9a750b0", "title": "Investigating the components of fintech ecosystem for distributed energy investments with an integrated quantum spherical decision support system"}, {"paperId": "bf6e9aa97bf7d67f6f74e13ff5071c60e88539e4", "title": "A review of recent advances in quantum-inspired metaheuristics"}, {"paperId": "3c8ebf1dc619c3fd6d521d1b56b7fa3ee241c184", "title": "Dental Fluorosis Segmentation Using Enhanced Quantum-Inspired Fuzzy Clustering Algorithm"}, {"paperId": "bef0846612d3b9d9e007a9af94bd0ef41c8c7f89", "title": "A novel quantum inspired genetic algorithm to initialize cluster centers in fuzzy C-means"}, {"paperId": "3e0d81b6e748dd269841dac2db276b6eb7c3b3f1", "title": "Fuzzy Logic on Quantum Annealers"}, {"paperId": "9ce4f622e7a43e8a0b30b382946b3e2a3a0a1e16", "title": "Optimizing the prototypes with a novel data weighting algorithm for enhancing the classification performance of fuzzy clustering"}, {"paperId": "74abd31f29b5adad0c8c16c7035b259b781ee17d", "title": "Quantile Context-Aware Social IoT Service Big Data Recommendation With D2D Communication"}, {"paperId": "f43a1fdf0d53c73a1f8ea7573f099f07d6e1de6c", "title": "Deep neural network based Rider-Cuckoo Search Algorithm for plant disease detection"}, {"paperId": "bf451e174f4293ba0bede97005eb05498b5ba0bf", "title": "CO2 emissions integrated fuzzy model: A case of seven emerging economies"}, {"paperId": "bcbc43b9bb28462ac79285a35cd21e14d5ac5a58", "title": "An improved quantum clustering algorithm with weighted distance based on PSO and research on the prediction of electrical power demand"}]}
