{"paperId": "90ec62473dea5641fc78ecfd07e3870114d9cc21", "publicationVenue": {"id": "ca07bf14-5b42-44fa-8fe3-58eb49d74e32", "name": "Irish Conference on Artificial Intelligence and Cognitive Science", "type": "conference", "alternate_names": ["AICS", "Ir Conf Artif Intell Cogn Sci"]}, "title": "Towards Improving Clinical Practice Guidelines Through Named Entity Recognition: Model Development and Evaluation", "abstract": "This paper addresses the development of models designed to assist medical professionals in extracting Named Entities, with the goal of enhancing the creation of Clinical Prac-tice Guidelines (CPGs) for informed medical decision-making. Named Entity Recognition is a pivotal technique for managing Information Overload, enabling the extraction of pertinent details from natural language texts like medical research findings and clinical reports, which serve as vital evidence sources for CPG development. The paper presents an introduction to the subject, establishes the context, delves into the current state of the art, and outlines the existing challenges within the realm of CPGs. Furthermore, it proposes a comprehensive set of models, meticu-lously crafted through an in-depth review of pertinent literature and extensive discussions. Subsequently, the paper reports on the evaluation of these models, conducted through expert-led Cognitive Walkthrough sessions involving diverse field experts. Finally, it concludes with a concise summary and conclusions drawn from this research endeavor.", "venue": "Irish Conference on Artificial Intelligence and Cognitive Science", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference", "Review"], "publicationDate": "2023-12-07", "journal": {"name": "2023 31st Irish Conference on Artificial Intelligence and Cognitive Science (AICS)", "pages": "1-8"}, "authors": [{"authorId": "2292321800", "name": "Florian Freund"}, {"authorId": "24050739", "name": "Philippe Tamla"}, {"authorId": "2292321623", "name": "Matthias Hemmje"}], "citations": []}
