{"paperId": "90f835903936fd8971ccd21b9d95b208fd36bb10", "publicationVenue": {"id": "6b6df2de-21bc-4137-9859-3fcef46f6a21", "name": "Mobile Information Systems", "type": "journal", "alternate_names": ["Mob Inf Syst"], "issn": "1574-017X", "url": "https://www.hindawi.com/journals/misy/", "alternate_urls": ["https://www.iospress.nl/journal/mobile-information-systems/", "https://www.iospress.nl/html/1574017x.php", "http://content.iospress.com/journals/mobile-information-systems"]}, "title": "Design and Implementation of Enterprise Financial Risk Control Information Management System Based on Big Data of Internet of Things", "abstract": "The Internet of Things is a huge network. It is a combination of massive sensing devices and the Internet. In the Internet of Things, a large number of sensing devices are continuously collecting data and sending it to the data center. Data present massive characteristics, forming the big data of the Internet of Things. With the rapid development of informatization and network technology, almost all domestic enterprises have paid more and more attention to the research of enterprise network, informatization, and interactive experience. Under the background of the rapid development of e-commerce, the enterprise financial risk control information management system is bound to become the trend of information development. In the process of system analysis, this paper considers the sustainable development needs of the actual business of the enterprise financial risk control information management system and makes an in-depth study on the management and technology of the system development in strict accordance with the business process optimization and principles of the enterprise financial risk control information management system. This paper proposes to introduce the technology of Internet of Things into the enterprise financial risk control information management system, build the application mode framework of Internet of Things for enterprise asset management, and focus on the in-depth study of key technologies such as data collection and information transmission. The experimental results show that the time cost of sensor clustering is 1% of hierarchical clustering. In the worst case, the time cost of sensor clustering only accounts for 1/14 of hierarchical clustering.", "venue": "Mobile Information Systems", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-08-13", "journal": {"name": "Mobile Information Systems"}, "authors": [{"authorId": "2573691", "name": "Daowen Ren"}, {"authorId": "2149165095", "name": "Haiyan Wu"}], "citations": []}
