{"paperId": "90f81e901b18612d528aad6c891a435ce098e70c", "publicationVenue": {"id": "e7c556b0-162f-4c48-9d25-fe3c141f984e", "name": "Big Data and Cognitive Computing", "alternate_names": ["Big Data Cogn Comput"], "issn": "2504-2289", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-1077183", "alternate_urls": ["https://www.mdpi.com/journal/BDCC", "https://www.mdpi.com/journal/BDCC/about", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-1077183"]}, "title": "Enhancing Digital Health Services with Big Data Analytics", "abstract": "Medicine is constantly generating new imaging data, including data from basic research, clinical research, and epidemiology, from health administration and insurance organizations, public health services, and non-conventional data sources such as social media, Internet applications, etc. Healthcare professionals have gained from the integration of big data in many ways, including new tools for decision support, improved clinical research methodologies, treatment efficacy, and personalized care. Finally, there are significant advantages in saving resources and reallocating them to increase productivity and rationalization. In this paper, we will explore how big data can be applied to the field of digital health. We will explain the features of health data, its particularities, and the tools available to use it. In addition, a particular focus is placed on the latest research work that addresses big data analysis in the health domain, as well as the technical and organizational challenges that have been discussed. Finally, we propose a general strategy for medical organizations looking to adopt or leverage big data analytics. Through this study, healthcare organizations and institutions considering the use of big data analytics technology, as well as those already using it, can gain a thorough and comprehensive understanding of the potential use, effective targeting, and expected impact.", "venue": "Big Data and Cognitive Computing", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-03-30", "journal": {"name": "Big Data Cogn. Comput.", "pages": "64", "volume": "7"}, "authors": [{"authorId": "2213383063", "name": "Nisrine Berros"}, {"authorId": "2176330151", "name": "Fatna El Mendili"}, {"authorId": "2213175078", "name": "Youness Filaly"}, {"authorId": "143726013", "name": "Y. Idrissi"}], "citations": [{"paperId": "f7eabaa77a2982f68e35b20d9770f2e402f55839", "title": "Smart Solutions for Diet-Related Disease Management: Connected Care, Remote Health Monitoring Systems, and Integrated Insights for Advanced Evaluation"}, {"paperId": "9d8d0b6bb5453f6fd12f0810d8bf4c329c6321eb", "title": "Understanding Medical 4.0 implementation through enablers: An integrated multi-criteria decision-making approach"}, {"paperId": "b1369153a8c3e2ee070f3b7805c1d12318f58dd5", "title": "A descriptive analytics of the COVID-19 pandemic in a middle-income country with forward-looking insights"}, {"paperId": "52ec8dccb701f731a0fcfb904d9cdd3bd1d48a41", "title": "Developing a Smart Healthy City Using Twitter Big Data by Modified Deep Belief Network"}, {"paperId": "b911112d584053d12a56aea86eabf04ffaeeb43d", "title": "Hybrid Encryption Algorithm for Information Security in Hadoop"}, {"paperId": "0646075ba258b88e19bde408a54834e3add55e99", "title": "Perspectives on Big Data, Cloud-Based Data Analysis and Machine Learning Systems"}]}
