{"paperId": "90fd6dea7284da2d06bc823e89627734ac1f8698", "publicationVenue": {"id": "228761ec-c40a-479b-8309-9dcbe9851bcd", "name": "IEEE Internet of Things Journal", "type": "journal", "alternate_names": ["IEEE Internet Thing J"], "issn": "2327-4662", "url": "https://www.ieee.org/membership-catalog/productdetail/showProductDetailPage.html?product=PER288-ELE", "alternate_urls": ["https://ieeexplore.ieee.org/servlet/opac?punumber=6488907", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6488907", "http://ieee-iotj.org/#"]}, "title": "Online Reconfiguration of Latency-Aware IoT Services in Edge Networks", "abstract": "With the proliferation of I nternet o f T hings (IoT) devices deployed in edge networks, the functionalities of IoT devices are typically encapsulated in terms of IoT services. Their collaboration is mostly achieved through the composition of functionally complementary and geographically contiguous IoT services, to achieve complex requests. Considering the capacity constraints of IoT devices, newly incoming requests may hardly be satisfied partially (or completely), since these devices are implementing subtasks of previous requests at this moment. Therefore, candidate IoT devices may have no enough remaining capacity to co-host subtasks of these new requests concurrently. To solve this problem, this article proposes a novel r esource a llocation and s ervice co-placement (RaSP) algorithm to address latency-aware online service reconfiguration problem. Specifically, IoT services are reconfigured upon IoT devices in an optimal manner, such that certain IoT services corresponding to subtasks in previous requests should be migrated online from their hosting IoT devices to neighboring ones, and constraints of these requests are still satisfiable. These released resources can be adopted to implement subtasks (or IoT services) of newly incoming requests. A prototype is implemented using an EdgeSim simulator. The experimental results show that our RaSP algorithm performs better than the state of the art’s techniques in satisfying the latency of newly incoming and previous requests simultaneously, and reducing the energy consumption of edge networks.", "venue": "IEEE Internet of Things Journal", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-09-15", "journal": {"name": "IEEE Internet of Things Journal", "pages": "17035-17046", "volume": "9"}, "authors": [{"authorId": "50079999", "name": "Xiaocui Li"}, {"authorId": "8525897", "name": "Zhangbing Zhou"}, {"authorId": "1915738", "name": "Chunsheng Zhu"}, {"authorId": "2072173488", "name": "Lei Shu"}, {"authorId": "1709431", "name": "Jiehan Zhou"}], "citations": [{"paperId": "482a624ca0b186c9581b0b9a4425bb38e1816476", "title": "How to Share: Balancing Layer and Chain Sharing in Industrial Microservice Deployment"}, {"paperId": "c6b0b663bfa05132482b93cf4adb5f9ef53c0074", "title": "Microservice Dynamic Migration based on Age of Service for Edge Computing"}, {"paperId": "3f8bffe34f1cbc83bc3d967f66520a1731bff6c8", "title": "B-Scale: Bottleneck-aware VNF Scaling and Flow Routing in Edge Clouds"}, {"paperId": "60d8af1b05f9d3a684b70533b19bc7d5df7c50e8", "title": "A Latency-Aware Ofﬂoading Strategy over Fiber-Wireless (FiWi) Infrastructures for Tactile Internet Services"}]}
