{"paperId": "910332479bf258faef38bf081fd787638d152e8c", "publicationVenue": {"id": "1bbe62b5-6321-4644-a043-c05b37f8259f", "name": "International Journal of Computing and Digital Systems", "type": "journal", "alternate_names": ["Int J Comput Digit Syst"], "issn": "2210-142X", "url": "http://journals.uob.edu.bh/ijcds"}, "title": "Revolutionizing Cloud-Based Task Scheduling: A Novel Hybrid\nAlgorithm for Optimal Resource Allocation and Efficiency in\nContemporary Networked Systems", "abstract": ": The need for cloud computing has increased in the age of contemporary networked systems, driving the pursuit of optimal resource allocation and data processing. It is imperative in essential fields where security, such as transportation systems, depends on computing performance. Even after much research has been done on managing resources in cloud computing, finding algorithms that maximize job completion, minimize costs, and maximize resource consumption has remained a top priority. However, existing techniques have shown limitations, which calls for new ways. Our work shows the novel hybrid approach that has the potential to change the game completely. The Neural Network Task Classification (N2TC) is the result of merging neural networks with genetic algorithms. This ground-breaking method skillfully applies the Genetic Algorithm Task Assignment (GATA) for resource allocation while utilizing neural networks for task categorization. Notably, our algorithm carefully considers execution time, response time, costs, and system e ffi ciency to promote fairness, a defense against resource scarcity. Our method achieves a remarkable 13.3% cost reduction, a stunning 12.1% increase in response time, and a 3.2% increase in execution time. These strong indicators act as a wake-up call, announcing our hybrid algorithm’s power and revolutionary potential in transforming the paradigms around cloud-based task scheduling. This work represents a turning point in cloud computing, demonstrating an innovative combination of algorithms that not only overcomes current constraints but also ushers in a new era of e ffi cacy and e ffi ciency with far-reaching implications outside the domain of transportation systems", "venue": "International Journal of Computing and Digital Systems", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-04-01", "journal": {"name": "International Journal of Computing and Digital Systems"}, "authors": [{"authorId": "2292990279", "name": "Punit Mittal"}, {"authorId": "2293137083", "name": "Satender Kumar"}, {"authorId": "2293133778", "name": "Swati Sharma"}], "citations": []}
