{"paperId": "9107399cad62156dbe67047546f1f382042e791b", "publicationVenue": {"id": "1124d164-490d-4da9-b0c2-ce8a8dc98202", "name": "BigData Congress [Services Society]", "type": "conference", "alternate_names": ["BigData", "Bigdata Congr [services Soc", "IEEE Int Conf Big Data", "IEEE International Conference on Big Data", "Int Congr Big Data", "International Congress on Big Data", "Bigdata Congr", "BigData Congress"]}, "title": "Proximal Policy Optimization based computations offloading for delay optimization in UAV-assisted mobile edge computing", "abstract": "UAVs have the potential to enhance wireless systems by improving range and quality, and this can be achieved by utilising the Mobile Edge Computing provided by the unmanned aerial vehicle. In this system, the MEC server mounted on the unmanned aerial vehicle can offer offload services to all the User Equipment in a given space. By offloading some proportion of its tasks to unmanned aerial vehicle for computation, the UE can perform the remaining tasks locally. The objective of this study is to minimize the maximum processing delay in the whole process by optimizing on four parameters, scheduling of the user equipment, portion of the task that has to be offloaded, angle of flight for the UAV, and speed of flight of the UAV, taking into account discrete variables and power constraints. However, due to the nonconvexity, the state space’s high dimension, and action’s space continuous nature of this problem, we are proposing a Proximal Policy optimization algorithm which is based on boosting the policy gradient. Further we will do a comparative analysis of PPO algorithm with other popular Reinforcement Learning algorithms, particularly the Deep Deterministic Policy Gradient algorithm. PPO algorithm can quickly achieve the optimal policy for offloading computation in a dynamic environment. The results obtained implies that the both PPO and DDPG algorithm converges quickly, and the processing delay is minimizd. However, our proposed PPO algorithm has shown significant improvement in minimizing the processing delay. Our model also performs way better compared to basic algorithm such as Deep Q Network (DQN).", "venue": "BigData Congress [Services Society]", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-12-15", "journal": {"name": "2023 IEEE International Conference on Big Data (BigData)", "pages": "3355-3364"}, "authors": [{"authorId": "2280922664", "name": "Praveen Kumar"}, {"authorId": "2280590535", "name": "Priyadarshni"}, {"authorId": "2280477831", "name": "Shivani Tripathi"}, {"authorId": "39274551", "name": "R. Misra"}], "citations": []}
