{"paperId": "912764814cd7aa8f37f1213e02cd968864b6a30c", "publicationVenue": null, "title": "A survey on energy‐efficient workflow scheduling algorithms in cloud computing", "abstract": "The advancements in computing and storage capabilities of machines and their fusion with new technologies like the Internet of Thing (IoT), 5G networks, and artificial intelligence, to name a few, has resulted in a paradigm shift in the way computing is done in a cloud environment. In addition, the ever‐increasing user demand for cloud services and resources has resulted in cloud service providers (CSPs) expanding the scale of their data center facilities. This has increased energy consumption leading to more carbon dioxide emission levels. Hence, it becomes all the more important to design scheduling algorithms that optimize the use of cloud resources with minimum energy consumption. This paper surveys state‐of‐the‐art algorithms for scheduling workflow tasks to cloud resources with a focus on reducing energy consumption. For this, we categorize different workflow scheduling algorithms based on the scheduling approaches used and provide an analytical discussion of the algorithms covered in the paper. Further, we provide a detailed classification of different energy‐efficient strategies used by CSPs for energy saving in data centers. Finally, we describe some of the popular real‐world workflow applications as well as highlight important emerging trends and open issues in cloud computing for future research directions.", "venue": "Software: Practice and Experience", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-12-03", "journal": {"name": "Software: Practice and Experience"}, "authors": [{"authorId": "2269932033", "name": "Prateek Verma"}, {"authorId": "2268068954", "name": "Ashish Kumar Maurya"}, {"authorId": "2397297", "name": "R. S. Yadav"}], "citations": [{"paperId": "a53cbc105dc900f66924fafed33416255dc302b7", "title": "Research on Multi-DAG Satellite Network Task Scheduling Algorithm Based on Cache-Composite Priority"}, {"paperId": "69aab3175552d5810d20338fa074c0005c8d4341", "title": "Preserving Performance and Reducing Energy Consumption: A Two-Phase Scheduling Approach in Cloud Computing Environments"}]}
