{"paperId": "912f8fdc74051c9b1c804f80582d66724e9f3917", "publicationVenue": {"id": "1db2368e-5986-4b06-9137-e63c1aa4f5e1", "name": "Symposium on Computer Architecture and High Performance Computing", "type": "conference", "alternate_names": ["SBAC-PAD", "Symp Comput Archit High Perform Comput"]}, "title": "AI Gauge: Runtime Estimation for Deep Learning in the Cloud", "abstract": "Major cloud providers, including IBM Cloud, Amazon Web Services, Microsoft Azure, and Google Cloud, offer services to train, debug, store, and deploy machine learning models at scale. For enhanced user experience in SLA-driven control, cost effective budgeting, elastic scaling, and efficient operations, estimating the runtime of training a machine learning model is important. We present AI Gauge, a cloud service to estimate runtime and cost for training deep learning models under different configuration options on the cloud. AI Gauge is designed using micro-service architecture and performs estimations based on machine learning models calibrated by an extensive and continuously populated job trace data-set. We show that AI Gauge can accurately predict the remaining time of running jobs based on its runtime progress (< 10% relative error) and can accurately predict the total runtime for a job before it starts with 7-8% relative error on average.", "venue": "Symposium on Computer Architecture and High Performance Computing", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-10-01", "journal": {"name": "2019 31st International Symposium on Computer Architecture and High Performance Computing (SBAC-PAD)", "pages": "160-167"}, "authors": [{"authorId": "144795538", "name": "Parijat Dube"}, {"authorId": "2129213", "name": "Tonghoon Suk"}, {"authorId": "40614781", "name": "Chen Wang"}], "citations": [{"paperId": "5a5b2354ef6cb004fdc1473b8f1188a0c8fbe250", "title": "Recent applications of AI to environmental disciplines: A review."}, {"paperId": "225ebfcc85eccd523d02eb96a2fb1a58d86d9820", "title": "Federated learning vulnerabilities, threats and defenses: A systematic review and future directions"}, {"paperId": "3db181baf32d33704d2fb64510a192d9fae15efd", "title": "Runtime Prediction of Machine Learning Algorithms in Automl Systems"}, {"paperId": "6764cde98b09b35ed212e4bd01483176eac2787f", "title": "Predicting the Performance-Cost Trade-off of Applications Across Multiple Systems"}, {"paperId": "217a7bb1e6d418c65549866d6e934cec417cbfc2", "title": "An online workflow scheduling algorithm considering license limitation in heterogeneous environment"}, {"paperId": "c8aeb41965f0536c6d4b1d11aea7990d3eff82fa", "title": "STSyn: Speeding Up Local SGD with Straggler-Tolerant Synchronization"}, {"paperId": "82eed40bf760a1fac01c99281ab86a6ce185a72e", "title": "PROFET: PROFiling-based CNN Training Latency ProphET for GPU Cloud Instances"}, {"paperId": "d03c1b3b30b16fa635d4a7a1dfcea18387c9a9de", "title": "Application of Federated Machine Learning in Manufacturing"}, {"paperId": "63038fc985332903328fc0a5fffb9ec885701954", "title": "Performance prediction of deep learning applications training in GPU as a service systems"}, {"paperId": "8b67d9535efd60194d37f6c76b67d53bd8015be5", "title": "Horus: Interference-Aware and Prediction-Based Scheduling in Deep Learning Systems"}, {"paperId": "53ec46e17af3009033a7b62d3f4b77371bb406fd", "title": "A Survey on Federated Learning: The Journey From Centralized to Distributed On-Site Learning and Beyond"}]}
