{"paperId": "9131b358782574132915d307e26484dd9655a27e", "publicationVenue": {"id": "49f8ba44-ceca-4e39-93cd-71a3236d5581", "name": "FEMS Microbiology Reviews", "type": "journal", "alternate_names": ["Fems Microbiol Rev", "Fems Microbiology Reviews", "FEMS Microbiol Rev"], "issn": "0168-6445", "url": "https://academic.oup.com/femsre/issue"}, "title": "Machine learning and applications in microbiology", "abstract": "ABSTRACT To understand the intricacies of microorganisms at the molecular level requires making sense of copious volumes of data such that it may now be humanly impossible to detect insightful data patterns without an artificial intelligence application called machine learning. Applying machine learning to address biological problems is expected to grow at an unprecedented rate, yet it is perceived by the uninitiated as a mysterious and daunting entity entrusted to the domain of mathematicians and computer scientists. The aim of this review is to identify key points required to start the journey of becoming an effective machine learning practitioner. These key points are further reinforced with an evaluation of how machine learning has been applied so far in a broad scope of real-life microbiology examples. This includes predicting drug targets or vaccine candidates, diagnosing microorganisms causing infectious diseases, classifying drug resistance against antimicrobial medicines, predicting disease outbreaks and exploring microbial interactions. Our hope is to inspire microbiologists and other related researchers to join the emerging machine learning revolution.", "venue": "FEMS Microbiology Reviews", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-03-16", "journal": {"name": "FEMS Microbiology Reviews", "volume": "45"}, "authors": [{"authorId": "2328110", "name": "Stephen J. Goodswen"}, {"authorId": "32854470", "name": "Joel L. N. Barratt"}, {"authorId": "145688205", "name": "Paul J. Kennedy"}, {"authorId": "46991525", "name": "A. Kaufer"}, {"authorId": "51227054", "name": "Larissa Calarco"}, {"authorId": "2257217640", "name": "John T. Ellis"}], "citations": [{"paperId": "9d4fe1b065310fef21b3f50b7d09f01673fa0e01", "title": "Global prediction of soil microbial growth rates and carbon use efficiency based on the metabolic theory of ecology"}, {"paperId": "2effc696a6afe2b90f002b9468046799a2f7daab", "title": "U2-Net and ResNet50-Based Automatic Pipeline for Bacterial Colony Counting"}, {"paperId": "2261cc64c359cb3473722e1773731c534d1fd0d6", "title": "Machine Learning Mediated Advanced Phage and Antimicrobial Therapy- A Futuristic Approach"}, {"paperId": "d074ed296a05ba7f60e45236ef53e1113471dd58", "title": "Effluent quality prediction of the sewage treatment based on a hybrid neural network model: Comparison and application."}, {"paperId": "c079f11353a1396233eb86104df0d1f4c13f7b9f", "title": "A novel system for assessing paraquat toxicity using Desmodesmus maximus as a potential bio-indicator and deep learning-based approach"}, {"paperId": "b993baf2bc89e31fcf51c641a04b23e22c6defa3", "title": "Explainable artificial intelligence and machine learning: novel approaches to face infectious diseases challenges"}, {"paperId": "ca030cfe39315e7d23a916874d1606e58b9d7e55", "title": "A toolbox of machine learning software to support microbiome analysis"}, {"paperId": "a8a4d59df418c2d583e607e8b68db3299cd28419", "title": "Machine learning for microbiologists."}, {"paperId": "6e63d7d16c041957092d999e435bcd91c7c05133", "title": "A review on machine learning–powered fluorescent and colorimetric sensor arrays for bacteria identification"}, {"paperId": "3711449e842277c0ee7005b7eac3c487293bb7c9", "title": "Infection Prevention in Remote or Resource-Limited Settings: Deploying Technology While Preserving the Human Touch"}, {"paperId": "ba324d0fad77a1d7e55cfb2631137ef27d768fb0", "title": "m5U-GEPred: prediction of RNA 5-methyluridine sites based on sequence-derived and graph embedding features"}, {"paperId": "7486abedf3590bf945223d1df3427091406bc0ca", "title": "Predicting and Evaluating Different Pretreatment Methods on Methane Production from Sludge Anaerobic Digestion via Automated Machine Learning with Ensembled Semisupervised Learning"}, {"paperId": "591a9d38ca6171c9cb5a7d65729026a9e1f08794", "title": "Introducing AI-supported Research Highlights"}, {"paperId": "bb163458f276cca1f4c16bc81b7ac60b33cd903c", "title": "A spacer design strategy for CRISPR‐Cas12f1 with single‐nucleotide polymorphism mutation resolution capability and its application in the mutations diagnosis of pathogens"}, {"paperId": "bef05c774cf1ba570ed09973aa126f2beca6a8bb", "title": "Developing diagnostic tools for canine periodontitis: combining molecular techniques and machine learning models"}, {"paperId": "87f1c89098517ee61b27d74a72f0f0c1bebb2190", "title": "Discrimination between hypervirulent and non-hypervirulent ribotypes of Clostridioides difficile by MALDI-TOF mass spectrometry and machine learning"}, {"paperId": "f32f338849da4aa04991268c1f873d5898ad6330", "title": "A weakly supervised pairwise comparison learning approach for bearing health quantitative evaluation and remaining useful life prediction"}, {"paperId": "dd6c8fb3249aacd75923cefe047e03dfc8e0006c", "title": "Microbial Reprogramming in Obsessive–Compulsive Disorders: A Review of Gut–Brain Communication and Emerging Evidence"}, {"paperId": "deea009776fed1a49572a1d8b62c018a2e9f8b1b", "title": "Artificial intelligence in cardiovascular diseases: diagnostic and therapeutic perspectives"}, {"paperId": "c745f6d178c58730552755cb4c37f89008cc6515", "title": "Microbiologically influenced corrosion—more than just microorganisms"}, {"paperId": "87f8682cb0c9556e85089e15f6c907001f545f5f", "title": "Applications of Machine Learning in Supercritical Fluids Research"}, {"paperId": "59d80c2db359febddcb2f003d0fa8748e4167900", "title": "Comprehensive insights on environmental adaptation strategies in Antarctic bacteria and biotechnological applications of cold adapted molecules"}, {"paperId": "5352c7d1752e457e91c79bcb609c002d276c3b3b", "title": "From genotype to phenotype: computational approaches for inferring microbial traits relevant to the food industry"}, {"paperId": "ba555ec85a217d2f7847c6caa9acb4e65104bd2e", "title": "Multinomial logistic regression based on neural networks reveals inherent differences among dairy farms depending on the differential exposure to Fasciola hepatica and Ostertagia ostertagi."}, {"paperId": "3a024e0474da350843b24e6e1fc652c0b9196663", "title": "Metabolic modeling of synthetic microbial communities for bioremediation"}, {"paperId": "54f602d32f4c44982c28a85e0e430d52e254af7c", "title": "Food systems microbiome‐related educational needs"}, {"paperId": "b3449deb9bbd28c2b4b30afe698f5d368e3f66a8", "title": "A 2-Year Audit on Antibiotic Resistance Patterns from a Urology Department in Greece"}, {"paperId": "4c80d91627e8a5938e165d2c9ca429bc4bb20203", "title": "Molecular detection and characterization of foodborne bacteria: Recent progresses and remaining challenges."}, {"paperId": "09fef5140f8cad895471f33079ed9a1c5b0530d0", "title": "Infrared analysis in the aqueous humor of patients with uveitis: Preliminary results."}, {"paperId": "0bba4f22928f4269a8fcb896e96f7afb7f369bb7", "title": "Unlocking the microbial studies through computational approaches: how far have we reached?"}, {"paperId": "d9f286e64c25144e16be324e5eae0b50ee65c4b6", "title": "Identification of the mitophagy-related diagnostic biomarkers in hepatocellular carcinoma based on machine learning algorithm and construction of prognostic model"}, {"paperId": "a8c340265bf97a2075573e96e132cd173784f16e", "title": "Gut Microbes Meet Machine Learning: The Next Step towards Advancing Our Understanding of the Gut Microbiome in Health and Disease"}, {"paperId": "52eae55351048271139449b7af209a700e04f016", "title": "The emerging applications and advancements of Raman spectroscopy in pediatric cancers"}, {"paperId": "457771801d4d6d1ff5033fdb5fdb9724e970d61e", "title": "Artificial Intelligence in microbiomes analysis: A review of applications in dermatology"}, {"paperId": "6ed16bffb614e327a4e04c7dafcb54a584429699", "title": "Matrix-assisted laser desorption/ionization time-of-flight mass spectrometry for differential identification of adult Schistosoma worms"}, {"paperId": "26d432f52b9635a661a67dfa76f956feab7af0dd", "title": "Recent advances of machine learning applications in human gut microbiota study: from observational analysis toward causal inference and clinical intervention."}, {"paperId": "69c45528e7b0de33641c54267ac13506b7d81da7", "title": "Trends in digital image processing of isolated microalgae by incorporating classification algorithm."}, {"paperId": "756339c7ae6f327acf126f8850fbd82b99103337", "title": "Integrating computational skills in undergraduate Microbiology curricula in developing countries"}, {"paperId": "27720be2260684cb3ba7618dd511d91968a26f32", "title": "Evaluation Of Random Forest Model on Influenza Like Illness ILI Surveillance Based on Patients Attending Fever OPD During COVID 19 Pandemic at Tertiary Care Hospital In Raigad District Maharashtra India"}, {"paperId": "e93d6da2a7cb1f5012ac16340a624b4fd888f268", "title": "Rapid classification of micro-particles using multi-angle dynamic light scatting and machine learning approach"}, {"paperId": "215a2303079d4c1add7613237c92ef5f2f447b9e", "title": "IMPLANTAÇÃO DE NEURÔNIOS ARTIFICIAIS NO CÓRTEX PRÉ-FRONTAL"}, {"paperId": "45765b47a2a7610667b8807671ce762281508daf", "title": "A Computer Aided Technique for Classification of Patients with Diabetes"}, {"paperId": "99956bd068980a192ddd8fec64a812638f3c8b00", "title": "Lactic Acid Bacteria as Potential Agents for Biocontrol of Aflatoxigenic and Ochratoxigenic Fungi"}, {"paperId": "1471452f0ebe3df726613d1d9e3bf3b5bd74e203", "title": "Application of combined CRISPR screening for genetic and chemical-genetic interaction profiling in Mycobacterium tuberculosis"}, {"paperId": "a7f8f142b2c0401b6fbaeaa067330c5adfe42775", "title": "Development of a Prediction Method of Cell Density in Autotrophic/Heterotrophic Microorganism Mixtures by Machine Learning Using Absorbance Spectrum Data"}, {"paperId": "667a58b316e78c2725a43b7f2c3a9779b3115785", "title": "Detecting states of ion channels on the cell membrane using neural networks"}, {"paperId": "70bf5dbc2acf3078643450a02dfbb31f69943dc0", "title": "Detecting states of ion channels on the cell membrane using neural networks"}, {"paperId": "ba4a0f1f1a63dd10f4f284248940863638c8fc44", "title": "Clinical microbiology in detection and identification of emerging microbial pathogens: past, present and future"}, {"paperId": "a202163a02c02fc8a2b8d0ae5dce8c8d4279d16a", "title": "Spatio-temporal spread and evolution of influenza A (H7N9) viruses"}, {"paperId": "92bb6c56e7e3cea2f3e49e77973f94d40f621019", "title": "Identification of the Diagnostic Biomarker VIPR1 in Hepatocellular Carcinoma Based on Machine Learning Algorithm"}, {"paperId": "c53b79623ca514f6697687fe5afec1ac5d164c59", "title": "Application of machine learning to predict the yield of alginate lyase solid-state fermentation by Cunninghamella echinulata: artificial neural networks and support vector machine"}, {"paperId": "c336129da9de5e380b0bd6db639d408bf3d9ce11", "title": "Phenogenomics of Mycobacterium abscessus"}, {"paperId": "b207b569ecef971b442b1216825337061a537820", "title": "Editorial: Extremophiles: Microbial genomics and taxogenomics"}, {"paperId": "7b39a4db029df823b2dc29a14910a6cd3ea2cfe7", "title": "Evaluation of various distance computation methods for construction of haplotype-based phylogenies from large MLST datasets"}, {"paperId": "66d1a65d11273657a7dde985f84a08b818695ab1", "title": "Understanding of the interrelationship between methane production and microorganisms in high-solid anaerobic co-digestion using microbial analysis and machine learning"}, {"paperId": "9c4bb0b38d0da8280a17aabadedecbf3e4d2eeb2", "title": "ScanGrow: Deep Learning-Based Live Tracking of Bacterial Growth in Broth"}, {"paperId": "07fb2802e0451c7801d0292ba32d5c857baa8396", "title": "Using machine learning techniques to predict antimicrobial resistance in stone disease patients"}, {"paperId": "225611b6d29c3622bb0c6509186f243c94dedb39", "title": "Mapping Microbial Abundance and Prevalence to Changing Oxygen Concentration in Deep-Sea Sediments Using Machine Learning and Differential Abundance"}, {"paperId": "d09a3ff089361d08334e3a312e32bee999563b52", "title": "Machine Learning and Its Applications for Protozoal Pathogens and Protozoal Infectious Diseases"}, {"paperId": "02985d7761d664c5f00b96530ebbfaf494738d29", "title": "Interfacing Machine Learning and Microbial Omics: A Promising Means to Address Environmental Challenges"}, {"paperId": "c6500636d2d54e7c6624205fff291e5856b01d83", "title": "Dental Calculus Reveals Life History of Decedents in Forensic Cases: An Anthropological Perspective on Human Identification"}, {"paperId": "b6bd863867bcd3017232be689d5c18b7cbde9085", "title": "Machine learning prediction of SCOBY cellulose yield from Kombucha tea fermentation"}, {"paperId": "95fa42389174ad2fe0efb7e55699fbbc00b78813", "title": "Combination of MALDI-TOF Mass Spectrometry and Machine Learning for Rapid Antimicrobial Resistance Screening: The Case of Campylobacter spp."}, {"paperId": "79a582e64978ce594bc826678c8af0e901f92c7c", "title": "LIM Tracker: a software package for cell tracking and analysis with advanced interactivity"}, {"paperId": "36ff90ee823a31b81f35f837fcfb1fba6350643d", "title": "Recent advances in microbial community analysis from machine learning of multiparametric flow cytometry data."}, {"paperId": "087c4b3fcc8d5ab39ac62b21d172743efb756a62", "title": "Big Data: Historic Advances and Emerging Trends in Biomedical Research"}, {"paperId": "0149d4ecf9921d69ed4577e031acc447719378f7", "title": "DeepBacs: Bacterial image analysis using open-source deep learning approaches"}, {"paperId": "b5b1b40362e71cb3bda2bec93a53e4b93bf05c9e", "title": "Accuracy of mutual predictions of plant and microbial communities vary along a successional gradient in an alpine glacier forefield"}, {"paperId": "ab44333e1479e1689e209d3ee6cbfcb33e8c4c74", "title": "BowSaw: Inferring Higher-Order Trait Interactions Associated With Complex Biological Phenotypes"}]}
