{"paperId": "9139855da904f717be8f6f86346ab2f9f546a39e", "publicationVenue": {"id": "7b2adce0-d53f-49d6-8784-b0645604fe62", "name": "ACM Computing Surveys", "type": "journal", "alternate_names": ["ACM Comput Surv"], "issn": "0360-0300", "url": "http://www.acm.org/pubs/surveys/", "alternate_urls": ["http://portal.acm.org/csur", "https://csur.acm.org/", "http://csur.acm.org/"]}, "title": "A Survey of Sampling Method for Social Media Embeddedness Relationship", "abstract": "Social media embeddedness relationships consist of online social networks formed by self-organized individual actors and significantly affect many aspects of our lives. Since the high cost and inefficiency of using population networks generated by social media embeddedness relationships to study practical issues, sampling techniques have become increasingly important than ever. Our work consists of three parts. We first comprehensively analyze current sampling selection methods, evaluation indexes, and evaluation methods in terms of technological evolution. In the second part, we systematically conduct sampling tests using representative large-scale social media datasets. The test results indicate that unequal-probability sampling methods can construct similar sample networks at the macroscale and microscale and outperform the equal-probability methods. However, non-negligible sampling errors at the mesoscale seriously affect the sampling reliability and validity. MANOVA tests show that the direct cause of sampling errors is the low in-degree nodes with medium-high betweenness located between the core and periphery, and current sampling methods cannot accurately sample such complex interconnected structures. In the third part, we summarize the pros and cons of current sampling methods and provide suggestions for future work.", "venue": "ACM Computing Surveys", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-03-30", "journal": {"name": "ACM Computing Surveys", "pages": "1 - 39", "volume": "55"}, "authors": [{"authorId": "2766166", "name": "Yingan Cui"}, {"authorId": "2116384662", "name": "Xue Li"}, {"authorId": "3060099", "name": "Junhuai Li"}, {"authorId": "48016463", "name": "Huaijun Wang"}, {"authorId": "2116081181", "name": "Xiaogang Chen"}], "citations": [{"paperId": "dac5a11688c8fc46f58499a65ce269defe0fe40f", "title": "SsAG\n : Summarization and Sparsification of Attributed Graphs"}, {"paperId": "edaccafe1222d3d1b38ef6d10d4ed4775afd2bf5", "title": "Sampling hypergraphs via joint unbiased random walk"}, {"paperId": "51a72559c6ccdda3757c0eec1e2ea782a151d1b6", "title": "Sampling unknown large networks restricted by low sampling rates"}, {"paperId": "b490207b853670c4760776ae67a83e10ae9e4395", "title": "Uncovering the Largest Community in Social Networks at Scale"}, {"paperId": "b1f8d7e2bcc04b5f8145412a8a17b77c79c4f044", "title": "A Review: Random Walk in Graph Sampling"}, {"paperId": "3d78d50e885ddd6f1631a6b94872401125c67211", "title": "Random walk on node cliques for high-quality samples to estimate large graphs with high accuracies and low costs"}]}
