{"paperId": "913bdcd38bf69b06e12c922f2ebb4f2a70ba759d", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Towards Privacy Preservation using Clustering based Anonymization: Recent Advances and Future Research Outlook", "abstract": "With the continuous increase in avenues of personal data generation, privacy protection has become a hot research topic resulting in various proposed mechanisms to address this social issue. The main technical solutions for guaranteeing a user’s privacy are encryption, pseudonymization, anonymization, differential privacy (DP), and obfuscation. Despite the success of other solutions, anonymization has been widely used in commercial settings for privacy preservation because of its algorithmic simplicity and low computing overhead. It facilitates unconstrained analysis of published data that DP and the other latest techniques cannot offer, and it is a mainstream solution for responsible data science. In this paper, we present a comprehensive analysis of clustering-based anonymization mechanisms (CAMs) that have been recently proposed to preserve both privacy and utility in data publishing. We systematically categorize the existing CAMs based on heterogeneous types of data (tables, graphs, matrixes, etc.), and we present an up-to-date, extensive review of existing CAMs and the metrics used for their evaluation. We discuss the superiority and effectiveness of CAMs over traditional anonymization mechanisms. We highlight the significance of CAMs in different computing paradigms, such as social networks, the internet of things, cloud computing, AI, and location-based systems with regard to privacy preservation. Furthermore, we present various proposed representative CAMs that compromise individual privacy, rather than safeguarding it. Finally, we discuss the technical challenges of applying CAMs, and we suggest promising opportunities for future research. To the best of our knowledge, this is the first work to systematically cover current CAMs involving different data types and computing paradigms.", "venue": "IEEE Access", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "1-1", "volume": "PP"}, "authors": [{"authorId": "2147166872", "name": "Abdul Majeed"}, {"authorId": "121349884", "name": "Safiullah Khan"}, {"authorId": "1786498", "name": "S. Hwang"}], "citations": [{"paperId": "c8aa76df7f79b70684fa6f3d1dfbeb5fe716c455", "title": "Method for creating privacy-preserving information using Probabilistic Latent Semantic Analysis"}, {"paperId": "103bc9b45348a9f55d70357685b32879e411301a", "title": "Privacy-preserving Continual Federated Clustering via Adaptive Resonance Theory"}, {"paperId": "e36eba6e5da5dbff60d5f59c99b4fb72a65e4670", "title": "Guardians of Privacy: Understanding the European Union's Framework for Biometric Data Protection"}, {"paperId": "8552c5e19f535a8ad29131667b4ea0dd9e900e00", "title": "Improved angelization technique against background knowledge attack for 1:M microdata"}, {"paperId": "8fdf4dfbe783e9b2d1e0ec2b853734d182ca9958", "title": "Rank-Label Anonymization for the Privacy-Preserving Publication of a Hypergraph Structure"}]}
