{"paperId": "91467fee6964d59cf9b5a7f133048eb139f67dcf", "publicationVenue": null, "title": "Hummingbird: efficient performance prediction for executing genomic applications in the cloud", "abstract": "MOTIVATION\nA major drawback of executing genomic applications on cloud computing facilities is the lack of tools to predict which instance type is the most appropriate, often resulting in an over- or under- matching of resources. Determining the right configuration before actually running the applications will save money and time. Here, we introduce Hummingbird, a tool for predicting performance of computing instances with varying memory and CPU on multiple cloud platforms.\n\n\nRESULTS\nOur experiments on three major genomic data pipelines, including GATK HaplotypeCaller, GATK MuTect2, and ENCODE ATAC-seq, showed that Hummingbird was able to address applications in command line specified in JSON format or workflow description language (WDL) format, and accurately predicted the fastest, the cheapest, and the most cost-efficient compute instances in an economic manner.\n\n\nAVAILABILITY\nHummingbird is available as an open source tool at: https://github.com/StanfordBioinformatics/Hummingbird.\n\n\nSUPPLEMENTARY INFORMATION\nSupplementary data are available at Bioinformatics online.", "venue": "Bioinform.", "year": 2021, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-03-08", "journal": {"name": "Bioinformatics"}, "authors": [{"authorId": "2332985", "name": "Amir Bahmani"}, {"authorId": "2052614064", "name": "Ziye Xing"}, {"authorId": "40455585", "name": "V. Krishnan"}, {"authorId": "2122958294", "name": "Utsab Ray"}, {"authorId": "145637373", "name": "F. Mueller"}, {"authorId": "2117232175", "name": "Amir Alavi"}, {"authorId": "2054083541", "name": "P. Tsao"}, {"authorId": "2067559069", "name": "Michael P. Snyder"}, {"authorId": "6865219", "name": "Cuiping Pan"}], "citations": [{"paperId": "cfc3325ab4267dd82b330df989635554b428b6d6", "title": "Proteogenomics in Cancer: Then and Now."}]}
