{"paperId": "914ccd3436d9adbc559276f09baac7a0c3281263", "publicationVenue": {"id": "99fb912c-384c-4d69-92e4-8be397aa3df2", "name": "International journal of mathematical, engineering and management sciences", "type": "journal", "alternate_names": ["Int j math eng manag sci"], "issn": "2455-7749", "url": "http://ijmems.in/"}, "title": "Diabetic Retinopathy Binary Image Classification Using Pyspark", "abstract": "Diabetic Retinopathy is a significant complication of diabetes, caused by a high blood sugar level, which damages the retina. In its earliest stages, diabetic retinopathy is asymptomatic and can lead to blindness if not discovered and treated promptly. As a result, there is a need for a reliable screening method. According to studies, this problem affects a large section of the population, and it is thus linked to Big Data. There are several obstacles and issues with Big Data, but Deep Learning is providing solutions to these issues. As a result, academics are extremely interested in Big Data with Deep Learning. It has been our goal in this study to employ effective preprocessing and Deep Learning approaches to accomplish binary classification of Diabetic Retinopathy. The experiment is done out using a dataset from Kaggle that was collected from India. The peculiarity of the paper is that the work is implemented on the Spark platform, and the performance of three models, InceptionV3, Xception, and VGG19 with the Logistic Regression classifier is compared. The accuracy of the models is used as a comparison criterion. Based on the results of the trial, the accuracy of InceptionV3 is 95 percent, the accuracy of Xception is 92.50 percent, and the accuracy of VGG19 is 89.94 percent. Consequently, InceptionV3 outperforms the other two models.", "venue": "International journal of mathematical, engineering and management sciences", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-10-01", "journal": {"name": "International Journal of Mathematical, Engineering and Management Sciences"}, "authors": [{"authorId": "1821003", "name": "B. Kotiyal"}, {"authorId": "3147914", "name": "H. Pathak"}], "citations": []}
