{"paperId": "91501c98a18cd9e95b87bde7b634482b4737ce25", "publicationVenue": null, "title": "IndexIt: Enhancing Data Locating Services for Parallel File Systems", "abstract": "While the ability to access a small fraction of data records from a large volume of scientific datasets is vital to accelerate scientific discovery, existing parallel file systems face serious challenges in managing scientific big data since data services have traditionally been decoupled from file systems. In this paper, we present IndexIt, an in-situ index and query middleware that aims to enhance record locating services for parallel file systems. When applications are writing data to parallel file systems, IndexIt allows users to index data while they are still in memory and bypass the performance bottleneck between memory and disks. By applying lightweight Bitmap-Range index and organizing the index as key-value pairs, IndexIt accelerates index building efficiently. Moreover, we propose a two-level query processing framework to process query requests. We build a prototype and evaluate its performance with real scientific datasets. Compared with existing data management tools, the index building time can be reduced dramatically. The proposed two-level query processing achieves up to 3 orders of magnitude speed-up than scanning the entire dataset and shows up to 1.35x speed-up than an existing tool.", "venue": "2019 IEEE 21st International Conference on High Performance Computing and Communications; IEEE 17th International Conference on Smart City; IEEE 5th International Conference on Data Science and Systems (HPCC/SmartCity/DSS)", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-08-01", "journal": {"name": "2019 IEEE 21st International Conference on High Performance Computing and Communications; IEEE 17th International Conference on Smart City; IEEE 5th International Conference on Data Science and Systems (HPCC/SmartCity/DSS)", "pages": "1011-1019"}, "authors": [{"authorId": "153719842", "name": "Peng Cheng"}, {"authorId": "2153954122", "name": "Yong Wang"}, {"authorId": "35150586", "name": "Yutong Lu"}, {"authorId": "143757289", "name": "Yunfei Du"}, {"authorId": "7711823", "name": "Zhiguang Chen"}], "citations": [{"paperId": "19fb5fcfbd3f2bce5bb254c71518fffd30ea552f", "title": "Design and Implementation of the Tianhe-2 Data Storage and Management System"}]}
