{"paperId": "915198ca2e1b0e4477d97ac6dd061bd6491b5e7c", "publicationVenue": {"id": "42af0896-7bcc-4002-8d09-63fd18f13f53", "name": "Journal of Internet Services and Applications", "type": "journal", "alternate_names": ["J Internet Serv Appl"], "issn": "1867-4828", "url": "http://www.jisajournal.com/", "alternate_urls": ["http://www.springer.com/computer/communication+networks/journal/13174", "http://link.springer.com/journal/volumesAndIssues/13174"]}, "title": "Service Provisioning in Edge-Cloud Continuum: Emerging Applications for Mobile Devices", "abstract": "Disruptive applications for mobile devices can be enhanced by edge computing facilities. In this context, Edge Computing (EC) is a proposed architecture to meet the mobility requirements imposed by these applications in a wide range of domains, such as the Internet of Things, Immersive Media, and Connected and Autonomous Vehicles. EC architecture aims to introduce computing capabilities in the path between the user and the Cloud to execute tasks closer to where they are consumed, thus mitigating issues related to latency, context awareness, and mobility support. In this survey, we describe which are the leading technologies to support the deployment of EC infrastructure. Thereafter, we discuss the applications that can take advantage of EC and how they were proposed in the literature. Finally, after examining enabling technologies and related applications, we identify some open challenges to fully achieve the potential of EC, and also research opportunities on upcoming paradigms for service provisioning. This survey is a guide to comprehend the recent advances on the provisioning of mobile applications, as well as foresee the expected next stages of evolution for these applications.", "venue": "Journal of Internet Services and Applications", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-06-20", "journal": {"name": "J. Internet Serv. Appl.", "pages": "47-83", "volume": "14"}, "authors": [{"authorId": "29382149", "name": "D. O. Rodrigues"}, {"authorId": "1886588", "name": "A. M. Souza"}, {"authorId": "145199028", "name": "T. Braun"}, {"authorId": "144677354", "name": "Guilherme Maia"}, {"authorId": "1757448", "name": "A. Loureiro"}, {"authorId": "145809763", "name": "L. Villas"}], "citations": [{"paperId": "aeb9e5d34b4549a10198e68171a7d5033befb1b4", "title": "Distributed Learning in the IoT–Edge–Cloud Continuum"}, {"paperId": "05b3dcc2aa9ea46f2144639ebdb68567ab3f83ee", "title": "O impacto dos algoritmos de controle de congestionamento em aplicações Edge-Cloud Continuum"}]}
