{"paperId": "916227d0ba290591c30d78b7c0f4a7f076289bc4", "publicationVenue": {"id": "63a4a093-d699-4e16-b83e-8e54a1a86bda", "name": "Facilities", "type": "journal", "issn": "0263-2772", "url": "https://www.emerald.com/insight/publication/issn/0263-2772"}, "title": "Bibliometric and content analyses of research on technology use in real estate facilities management", "abstract": "\nPurpose\nTechnological change drives transformation in most sectors of the economy. Industry 4.0 technologies have been applied at different stages of a building’s lifecycle. However, limited studies exist on their application in real estate facilities management (REFM). This study aims to assess the existing knowledge on the topic to suggest further research directions.\n\n\nDesign/methodology/approach\nScopus-indexed literature from 2013 to 2023 was examined and visualised using VOSviewer software to output quantitative (descriptive) results. Content analysis was used to complement the quantitative findings.\n\n\nFindings\nFindings indicated a concentration of research in China, Norway and Italy. The knowledge areas included three clusters: lifecycle integration and management, data curation and management and organisational and management capabilities. The benefits, challenges and support strategies were highlighted.\n\n\nResearch limitations/implications\nMore collaboration is needed across countries and territories on technology integration in REFM. Future research using alternative methodologies is recommended, with a focus on adopting and non-adopting REFM organisations. Further, implications for facility managers, employees, technology suppliers or vendors, training, organisations and management exist.\n\n\nPractical implications\nFurther, implications for facility managers, employees, technology suppliers or vendors, training, organisations and management exist.\n\n\nOriginality/value\nThe study reveals the knowledge base on technology use in REFM. It adds to the evidence base on innovation and technology adoption in REFM.\n", "venue": "Facilities", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-07", "journal": {"name": "Facilities"}, "authors": [{"authorId": "2238373576", "name": "Chioma Okoro"}], "citations": []}
