{"paperId": "9167e0d156fbc0dd7a30f66ff3bfe65ec53f0047", "publicationVenue": {"id": "69951de1-74d3-4924-8e43-73f48a3d006a", "name": "IEEE Congress on Evolutionary Computation", "type": "conference", "alternate_names": ["Congress on Evolutionary Computation", "IEEE Congr Evol Comput", "CEC", "Congr Evol Comput"], "url": "https://en.wikipedia.org/wiki/IEEE_Congress_on_Evolutionary_Computation"}, "title": "Evolving Better Rerouting Surrogate Travel Costs with Grammar-Guided Genetic Programming", "abstract": "The number of drivers using on-board systems to navigate through urban areas is increasing. Drivers get real time information regarding traffic conditions and change their routes accordingly. Adapting a route clearly enables drivers to avoid closed roads or circumvent major hotspots. However, given the non-linearity of the traffic dynamics in urban environments, choosing a route based only on current traffic load or current average vehicle speed is not a guaranty of a lower overall travel time. In this work, we design an evolutionary system to search for better surrogate travel cost that drivers could optimise in their rerouting to achieve better overall travel times. Our system uses the Grammar-Guided Genetic Programming algorithm to evolve surrogate travel cost expressions and evaluate their performances on a micro traffic simulator. Our system is able to evolve different expressions that meet characteristics of specific urban environments instead of a one size fits all expression. We have seen in our experimental study on a traffic scenario representing Dublin city centre that our system is able to evolve surrogate travel cost expressions with ~34% and ~10% improvements in average travel time over the no rerouting and the average travel speed based rerouting algorithms.", "venue": "IEEE Congress on Evolutionary Computation", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-07-01", "journal": {"name": "2020 IEEE Congress on Evolutionary Computation (CEC)", "pages": "1-8"}, "authors": [{"authorId": "2588256", "name": "Takfarinas Saber"}, {"authorId": "2151226349", "name": "Shen Wang"}], "citations": [{"paperId": "ca90f73d94bc48607e60d777f97a7fea7088f437", "title": "Program Synthesis with Generative Pre-trained Transformers and Grammar-Guided Genetic Programming Grammar"}, {"paperId": "6f9c1d4db0f76a0ef3ea47dc86f120973c513c72", "title": "Many-objective Grammar-guided Genetic Programming with Code Similarity Measurement for Program Synthesis"}, {"paperId": "746b6108a72b2b1bd78f70d4b1a211cdebfd8f49", "title": "Multi-objective Grammar-guided Genetic Programming with Code Similarity Measurement for Program Synthesis"}, {"paperId": "20d23315a20c2290388ef26cab2cfc5c3b6bf937", "title": "Investigating Multi-Feature Selection and Ensembling for Audio Classification"}, {"paperId": "71c951764edbccf99719fbcfa95f5ffbedcfa794", "title": "Analysis of Urban Traffic Incidents Through Road Network Features"}, {"paperId": "2bbf08f5faa74ccee4d9e6576f3e106f91011490", "title": "RONIN: a SUMO Interoperable Mesoscopic Urban Traffic Simulator"}, {"paperId": "2b9c73aba3be79f9f4d7de0e60a9087300056e7c", "title": "Hierarchical Grammar-Guided Genetic Programming Techniques for Scheduling in Heterogeneous Networks"}]}
