{"paperId": "9169aa7a9c8a0c6e6224af0f8519ff32402793a9", "publicationVenue": null, "title": "Leveraging Google Earth Engine (GEE) for determining land use and land cover changes around Tasik Chini Malaysia.", "abstract": "This study explores the capability of Google Earth Engine in determining land use and land cover changes around Tasik Chini Malaysia which is one of the tourism areas severely affected by landscape changes. Two Landsat satellite composite data spanning ten years of difference and Machine Learning Approach algorithm namely Random Forest (RF) and Support Vector machine (SVM) are used to create landuse land cover changes (LULCC) map of the area. GEE is capable of processing time series data as well as performing temporal aggregation. In our case median metrics is used in creating many different alternatives of image composites for creating the LULC map with ease but accurate result. It is an excellent alternative for geospatial and big data analysts for both advance and novice users in processing long term EO dataset especially in dealing with many imageries. The best classification accuracy with the highest Overall Accuracy (OA) is by using Random Forest classifier with 81.58% for the year 2010 and 83.59% for 2020. The Kappa coefficient of both years are 0.75 and 0.78. It is found using this technique, Tasik Chini lost about 6600 hectares of forest area and an increase of bareland and develop area especially around the Tasik Chini lake due to the reported increase of mining activities for the past few years.", "venue": "IOP Conference Series: Earth and Environment", "year": 2023, "fieldsOfStudy": ["Physics"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-09-01", "journal": {"name": "IOP Conference Series: Earth and Environmental Science", "volume": "1240"}, "authors": [{"authorId": "2242216996", "name": "Nurul Syazna Mat Akhir"}, {"authorId": "6589213", "name": "P. Salim"}, {"authorId": "9329468", "name": "Z. Yusoff"}], "citations": []}
