{"paperId": "91902c020625060ece719022de28790cebb38f43", "publicationVenue": {"id": "0846f41f-c23f-4c3e-9237-673180f1c44d", "name": "International Conference on e-Health Networking, Applications and Services", "type": "conference", "alternate_names": ["HealthCom", "International Conference on E-health Networking, Application & Services", "Int Conf E-health Netw Appl  Serv", "Healthcom", "Int Conf e-health Netw Appl Serv"]}, "title": "OpenAI ChatGPT: A Potential Medical Application", "abstract": "Recent breakthroughs in artificial intelligence (AI) and deep learning have supported the emergence of innovative applications, among them OpenAI ChatGPT, a chatbot built on natural language processing. ChatGPT swiftly gained worldwide recognition thanks to its exceptional conversational prowess. This paper presents an in-depth examination of the inception and development of the chatbot and highlights its potential applicability within the medical field. Based on the ramifications of implementing ChatGPT in healthcare, the study provides novel solutions that guide future trends. The comprehensive analysis and insights presented in this research contribute to a nuanced understanding of the capabilities and prospective benefits offered by AI-powered chatbots in the medical field. Furthermore, this research emphasizes the importance of maintaining a human-centric approach in healthcare. Although AI chatbots can provide valuable assistance, they should not replace the role of medical professionals. Instead, they should be designed as complementary tools to support and enhance human decision-making processes. The findings facilitate informed decision-making, provide a basis for further investigation, and foster advancements in this promising area of research. Given the transformative potential of Chat-GPT, it is essential for medical professionals and researchers to understand the underlying concepts, challenges, and possibilities associated with the integration of AI chatbots into healthcare systems.", "venue": "International Conference on e-Health Networking, Applications and Services", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-12-15", "journal": {"name": "2023 IEEE International Conference on E-health Networking, Application & Services (Healthcom)", "pages": "210-215"}, "authors": [{"authorId": "2275606211", "name": "Ahmad Chaddad"}, {"authorId": "2284929414", "name": "Yuchen Jiang"}, {"authorId": "2284836949", "name": "Changhong He"}], "citations": []}
