{"paperId": "9198d6ab8ad1c6f1527a7d4adf06809848bf23c7", "publicationVenue": {"id": "89097a03-8be6-4e2d-ae2c-a6df64c77a06", "name": "Frontiers in Psychology", "type": "journal", "alternate_names": ["Front Psychol"], "issn": "1664-1078", "url": "http://www.frontiersin.org/Cultural_Psychology", "alternate_urls": ["http://frontiersin.org/psychology/", "https://www.frontiersin.org/journals/psychology", "http://journal.frontiersin.org/journal/psychology", "http://www.frontiersin.org/psychology"]}, "title": "Challenges and Future Directions of Big Data and Artificial Intelligence in Education", "abstract": "We discuss the new challenges and directions facing the use of big data and artificial intelligence (AI) in education research, policy-making, and industry. In recent years, applications of big data and AI in education have made significant headways. This highlights a novel trend in leading-edge educational research. The convenience and embeddedness of data collection within educational technologies, paired with computational techniques have made the analyses of big data a reality. We are moving beyond proof-of-concept demonstrations and applications of techniques, and are beginning to see substantial adoption in many areas of education. The key research trends in the domains of big data and AI are associated with assessment, individualized learning, and precision education. Model-driven data analytics approaches will grow quickly to guide the development, interpretation, and validation of the algorithms. However, conclusions from educational analytics should, of course, be applied with caution. At the education policy level, the government should be devoted to supporting lifelong learning, offering teacher education programs, and protecting personal data. With regard to the education industry, reciprocal and mutually beneficial relationships should be developed in order to enhance academia-industry collaboration. Furthermore, it is important to make sure that technologies are guided by relevant theoretical frameworks and are empirically tested. Lastly, in this paper we advocate an in-depth dialog between supporters of “cold” technology and “warm” humanity so that it can lead to greater understanding among teachers and students about how technology, and specifically, the big data explosion and AI revolution can bring new opportunities (and challenges) that can be best leveraged for pedagogical practices and learning.", "venue": "Frontiers in Psychology", "year": 2020, "fieldsOfStudy": ["Psychology", "Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2020-10-19", "journal": {"name": "Frontiers in Psychology", "volume": "11"}, "authors": [{"authorId": "48803731", "name": "Hui Luan"}, {"authorId": "1804075", "name": "P. Géczy"}, {"authorId": "3307051", "name": "H. Lai"}, {"authorId": "145620991", "name": "J. Gobert"}, {"authorId": "153909377", "name": "Stephen J. H. Yang"}, {"authorId": "35043342", "name": "H. Ogata"}, {"authorId": "1802882", "name": "J. Baltes"}, {"authorId": "2055050266", "name": "R. Guerra"}, {"authorId": "2158235850", "name": "Ping Li"}, {"authorId": "2250062", "name": "Chin-Chung Tsai"}], "citations": [{"paperId": "1121ce4e5a3842f0a21482ff5565d5c45c09fba5", "title": "Integrating AI in education: Opportunities, challenges, and ethical considerations"}, {"paperId": "9544de54619cc0a6972781af15f751d6d1dae227", "title": "Approaches in higher education in Ukraine: trends and prospects"}, {"paperId": "c60aff65e41d842a14cffc5be39f9c704539be85", "title": "Onscreen presence of instructors in video lectures affects learners’ neural synchrony and visual attention during multimedia learning"}, {"paperId": "c7987b83607efa1fe7667e0a711ddca5af2c1a0c", "title": "Berbagi Praktek Baik Dalam Menyusun Karya Ilmiah Berbasis Artificial Intelligence Melalui Webinar Nasional"}, {"paperId": "f75ee61150609577b85dc60dc345320ffe323663", "title": "Perceptions of Senior Pharmacy Students Towards the Impact of Artificial Intelligence on University Education and Scientific Writing: A Qualitative Study"}, {"paperId": "fbb0b1cc4f2cd79b25ec84f2f8ea07ca8789c7ab", "title": "Does AI‐assisted creation of polyphonic music increase academic motivation? The DeepBach graphical model and its use in music education"}, {"paperId": "475b092d79c179e1737e2e9ace9dadc02c4a7c1b", "title": "Artificial intelligence in entrepreneurship education: a scoping review"}, {"paperId": "d9d82ee15cc1f7711d8843ffada53aae2887f160", "title": "Implications of Artificial Intelligence for Teaching and Learning"}, {"paperId": "e130066936f20fb610a70c130abba4f8270236e4", "title": "The effect of AI-powered chatbots in social studies education"}, {"paperId": "e68b0066d0d6ecd72015ebea451a929d38cd2974", "title": "Reduction of Losses and Wastage in Seafoods: The Role of Smart Tools and Biosensors Based on Artificial Intelligence"}, {"paperId": "015f43fb0a2d6a33ba4e0b525934efec420cf2c4", "title": "From Traditionalism to Algorithms: Embracing Artificial Intelligence for Effective University Teaching and Learning"}, {"paperId": "c9e7b8e75654af93d9e823e8f301613d059ca54d", "title": "Understanding the University Student Experience Through Big Data Analytics"}, {"paperId": "fc2342dd6462a95db0cd121e660be305859de860", "title": "Pre-Service English Teachers’ Lived Experience in Using AI in Teaching Preparation"}, {"paperId": "e87c1ffc27ff336417ae3e70489ac2dd29028d44", "title": "The role of AI in individualizing learning and creating personalized programs"}, {"paperId": "538f0cfe309220b2a09d71039be7ef514bc36cf9", "title": "Biological big-data sources, problems of storage, computational issues, and applications: a comprehensive review"}, {"paperId": "6052123b9ff0b618958a75087db55eeca6306bfe", "title": "Grammar enhancement in EFL instruction: a reflection on the effects of self-evaluation, teacher support, and L2 grit"}, {"paperId": "6a67b7963a30d4ea9650d45a1bc2e2f89a60727c", "title": "Vocational Technology Education Innovation: Building a Generation of Experts in the Digital Age"}, {"paperId": "11d6872e3838a6a43a5a745a7168d778a19af7ae", "title": "May I come in? A probe into the contributions of self-esteem, teacher support, and critical thinking to anxiety and shyness in language classes"}, {"paperId": "49ba831dd799405ebca87887caa168aeac1fe5c2", "title": "Artificial intelligence (AI), conversational agents, and generative AI: implications for adult education practice and research"}, {"paperId": "67e5dccb9111c5687e1e9288d0d6fc09af3c00e8", "title": "Harnessing Artificial Intelligence for Personalized Learning: A Systematic Review"}, {"paperId": "4d449feedc61fb08dac833209c7ed4d2ba78707f", "title": "Big Data Analytics and AI for Green Supply Chain Integration and Sustainability in Hospitals"}, {"paperId": "70c8bab357c45a2a0b7f0ae38b205f6f51141c1a", "title": "Logistics 4.0: Exploring Artificial Intelligence Trends in Efficient Supply Chain Management"}, {"paperId": "ca08e2bb38651fcf68132a046dc8a3dbc761f521", "title": "Leveraging Computer-Aided Education for Enhanced Learning: Innovations, Benefits, and Challenges in the Medical Sector"}, {"paperId": "f00e5debe2cd69aeb62f642be13cb530d7b4d9e7", "title": "Predictive Analysis in Education: Using Artificial Intelligence Models to Identify Learning Difficulties Early"}, {"paperId": "814e4264dfabd9df811958dba9b4497ef8b0f81c", "title": "Using an Artificial-Intelligence-Generated Program for Positive Efficiency in Filmmaking Education: Insights from Experts and Students"}, {"paperId": "3cb3f8beef59d5ee7dafe9bab7c44f230e69f6e2", "title": "The Impact of Generative Artificial Intelligence-based Formative Feedback on the Mathematical Motivation of Chinese Grade 4 Students: a Case Study"}, {"paperId": "8276c5352f6447dbccb09ee425264eb20c6c653e", "title": "A teaching management system for physical education in colleges and universities using the theory of multiple intelligences and SVM"}, {"paperId": "56532c1585fef720f9392463d21c8fc29e8a9c11", "title": "Navigating the future of property professionals: an AI-enabled paradigm"}, {"paperId": "eed5c04f6d7cee9f6967be153760811e88373377", "title": "AI and BDA impact on Stakeholders' Responses to Education Technology Adoption"}, {"paperId": "69d556419eefcd05dbf21a6b666568a2825f4c71", "title": "Artificial intelligence in language instruction: impact on English learning achievement, L2 motivation, and self-regulated learning"}, {"paperId": "3d20d039906ae8f342d2288df210e5b94839e36a", "title": "The Role of Big Data in Intelligent Educational Platform: A Functional Architecture"}, {"paperId": "191c4b23edb895695b1d1f23daf4baecc3ef93ee", "title": "Reducing dropout rate through a deep learning model for sustainable education: long-term tracking of learning outcomes of an undergraduate cohort from 2018 to 2021"}, {"paperId": "f4be003343c1c1512caacefcc2cc7b294be81438", "title": "Artificial intelligence in higher education: a bibliometric analysis and topic modeling approach"}, {"paperId": "110598c80683c6726ce860aa888f61d090d68cc9", "title": "EXPLORING PROJECT-BASED LEARNING FOR YOUNG LEARNERS IN ENGLISH EDUCATION"}, {"paperId": "edbb34de7fd2b8014422a11dea1ce2d5d502e857", "title": "Artificial intelligence in science education: A bibliometric review"}, {"paperId": "8c916c3db8aa0862209edb657f46baebd148090e", "title": "Integrasi Teknologi Artificial Intelligence Dalam Sistem Akuntansi Modern"}, {"paperId": "38a752920a7ef311f8b445e2b3bbdbbfb0e3e58d", "title": "Articles on Education and Artificial Intelligence: A Bibliometric Analysis"}, {"paperId": "9b88214867f1c996efc17873dba98d199fab8686", "title": "Perceptions and Acceptance of Artificial Intelligence: A Multi-Dimensional Study"}, {"paperId": "e76de24692fe808f7dd8f52ccab5a775cd0c896f", "title": "Yapay Zekâ Kullanımının Muhasebe Mesleğine Etkileri: İstanbul Serbest Muhasebeci Mali Müşavirler Odası Üyeleri Üzerine Bir Araştırma"}, {"paperId": "f468af724a9a269172e5e617830c8aa6ac40e99d", "title": "Integration of Artificial Intelligence in Education: Opportunities, Challenges, Threats and Obstacles. A Literature Review."}, {"paperId": "528e9d59b134c6f9b9291c7ceb5f6d4d2509d5b4", "title": "Artificial Intelligence in Education: Literature Review on The Role of Conversational Agents in Improving Learning Experience"}, {"paperId": "7328e203ed834eba49ab850e4380ff6b8f743f13", "title": "Decoding the data economy: a literature review of its impact on business, society and digital transformation"}, {"paperId": "4dd7c66e3d0989d18764cfb3f01af8ae230332d0", "title": "Analysis of Psychological Factors Influencing Mathematical Achievement and Machine Learning Classification"}, {"paperId": "149dc74d9a5d8802f73784d57ccdfd34e6375280", "title": "Fintech Agents: Technologies and Theories"}, {"paperId": "98fa7d64993746f7b5a81d9aecb6a91453513bff", "title": "Big Data and Artificial Intelligence in Education: A Bibliometrics Study from 2010 to 2023"}, {"paperId": "c456d3f7f647307f251fb06c423cd7f2e7431a2c", "title": "Pillars of Cloud‐Based Earth Observation Science Education"}, {"paperId": "04647896200e3627dfe71fd5698d63d0f3841ad6", "title": "Exploring factors associated with higher education students’ learning outcomes in emergency remote teaching environments during the COVID-19 pandemic: General patterns and individual differences"}, {"paperId": "d093cf0e07d0c4e4bf7b0bc71ab6367356c389ab", "title": "We Have Big Data, But Do We Need Big Theory? Review-Based Remarks on an Emerging Problem in the Social Sciences"}, {"paperId": "0d208ba4a043296f5f25b566851d9e4ab18de9ae", "title": "AI in Medical Education: Global situation, effects and challenges"}, {"paperId": "7af37252acb6baa92c18accd878f14f84abe1586", "title": "Deep learning solutions for service-enabled systems and applications in Internet of Things"}, {"paperId": "61d972222e86cf5dbf9f7159c78074717e02bae1", "title": "An innovative method for log diameter measurements based on deep learning"}, {"paperId": "0a6100ef3f8cb8c5b2d9fe8507e76421e0abf02a", "title": "Primary Teachers’ Perspectives on Using Artificial Intelligence Technology in English as a Second Language Teaching and Learning: A Systematic Review"}, {"paperId": "f67b222246961627f11aef752e8ec823b82b309b", "title": "AI in Student as Manager Model-Future Directions of Business Studies"}, {"paperId": "a3a39a4dcaf358add87bba8d6d2b4642b7f718c6", "title": "Let's talk evidence – The case for combining inquiry-based and direct instruction"}, {"paperId": "781cfd3b72b3bc690b15433cbbc012487d5553dd", "title": "A comprehensive AI policy education framework for university teaching and learning"}, {"paperId": "5a20a640410c02a53c9afded75a395c328dadad7", "title": "A systematic literature review of machine learning applications in IoT"}, {"paperId": "63253332758852daa0b302d2ff3ba15f0afcffd1", "title": "Leading Edge or Bleeding Edge: Designing a Framework for the Adoption of AI Technology in an Educational Organization"}, {"paperId": "bc460c747be0e4afa41b2d6742433dedc1bc6cd3", "title": "Artificial Intelligence and Education"}, {"paperId": "7b9860fde4f90b3b5ac2128be447d0299472e1c2", "title": "Preparing for AI-enhanced education: Conceptualizing and empirically examining teachers' AI readiness"}, {"paperId": "cfa037313ab4498d391edd55e4a62e692eee8052", "title": "Visual Analysis of Precision Teaching Research Based on VOS Viewer in Data-Driven Perspective"}, {"paperId": "afdfae9bf54f220d41f375b4210eaf93ea305033", "title": "Semi-supervised Learning in Distributed Split Learning Architecture and IoT Applications"}, {"paperId": "1ee2829ac3e28681ed2304457072c0bceead3ecb", "title": "A Review of Big Data’s Role on Higher Education"}, {"paperId": "1fc3a53d9665a639eeb6d7645a7f95965d2b1fb1", "title": "Teachers’ AI digital competencies and twenty-first century skills in the post-pandemic world"}, {"paperId": "53db2ee4582d0fd0a49c9c1926a1e25e9afc70fe", "title": "AIRBNB Price Prediction Using Machine Learning"}, {"paperId": "7385eaf066ba20d7529b883a55156b455147b26f", "title": "Six Human-Centered Artificial Intelligence Grand Challenges"}, {"paperId": "8134151cf368e88856f2f0a225eb5ee243aba11c", "title": "Learning assessment in the age of big data: Learning analytics in higher education"}, {"paperId": "4fe9cb959875eca665910f896d828fb0a062ff85", "title": "An effective veracity management for sentiment analysis in social media using crowdsourcing and multi‐set feature learning"}, {"paperId": "957cadc564ad3722d25b76c99f763acc05344efa", "title": "The Benefits of ICT Application on the Successful Implementation of Formal Education"}, {"paperId": "6fb5ca0ff6821a92b080d0654d245d2407484701", "title": "The Roles of Personality Traits, AI Anxiety, and Demographic Factors in Attitudes toward Artificial Intelligence"}, {"paperId": "c16a349918b057352469716f7aac15900a763052", "title": "A Bibliometric Study : Recommendation based on Artificial Intelligence for iLearning Education"}, {"paperId": "623b0dc052c7a6968f20e963d202de628a9eea86", "title": "The effectiveness of artificial intelligence-based automated grading and training system in education of manual detection of diabetic retinopathy"}, {"paperId": "d35463912a584913516ff4532164453d32d6a4d5", "title": "Enhancing Computational Thinking Skills Through Artificial Intelligence Education at a STEAM High School"}, {"paperId": "07cc52ca234853ae5946d7f2a8c4b48b200cd93b", "title": "Design and Implementation of Continuing Education Online Training System Based on Artificial Intelligence Algorithm"}, {"paperId": "c14545f7538a79ea095bcc9e7273e76562e4a045", "title": "Special aspects of using Big Data in the learning process"}, {"paperId": "9aae57ea166c81fb901de9380beb4a2fa9137b54", "title": "L2 education in the digital era: post-pandemic prospects"}, {"paperId": "4e66397c4a7e2df2f1e489a8618af68b06a24ded", "title": "Research Status, Hotspots, and Evolutionary Trends of Intelligent Education from the Perspective of Knowledge Graph"}, {"paperId": "6624236a5ab39d57d2463fca646e15973a5a6a55", "title": "Challenges and Benefits of 7 ways Artificial Intelligence in Education Sector"}, {"paperId": "187decfef0b1fa036bdf23d31e962688982a20ac", "title": "Towards Intelligent-TPACK: An empirical study on teachers' professional knowledge to ethically integrate artificial intelligence (AI)-based tools into education"}, {"paperId": "0f6259b79812e096e19beaa5cb0bb2a494aa88b5", "title": "Using a Virtual Patient via an Artificial Intelligence Chatbot to Develop Dental Students’ Diagnostic Skills"}, {"paperId": "ba473392456e4fbdd33b9b6585fb1e6e0e9bb458", "title": "Data Ethics Framework for Artificial Intelligence in Education (AIED)"}, {"paperId": "b1fece39e21dd8d91c681a772a55b20a7bf464de", "title": "Performance and Configuration of Artificial Intelligence in Educational Settings. Introducing a New Reliability Concept Based on Content Analysis"}, {"paperId": "1b65985e53b427d095d4349815b5e21ca70a493c", "title": "Influence of Teachers’ Competencies on ICT Implementation in Kenyan Universities"}, {"paperId": "ea034e1e72c70a183728369576650c0fb94ec43b", "title": "Exploration and Strategy Analysis of Mental Health Education for Students in Sports Majors in the Era of Artificial Intelligence"}, {"paperId": "7a6745e233b53e269499f3772cfef13f7ec10103", "title": "Self-Esteem at University: Proposal of an Artificial Neural Network Based on Resilience, Stress, and Sociodemographic Variables"}, {"paperId": "f51679a0f9df72a62b2e7a6d15e3a29a662de9d2", "title": "Artificial Intelligence and Big Data: The Advent of New Pedagogy in the Adaptive E-Learning System in the Higher Educational Institutions of Saudi Arabia"}, {"paperId": "c28c63251ca49dda62b5f13c312cc7e2970f6f39", "title": "Pilot Study on Concerns of Teachers of Using Artificial Intelligence in Learning and Teaching"}, {"paperId": "d6d70f5e30182f28df4061f614a97bce0174873c", "title": "Data‐driven decision‐making model based on artificial intelligence in higher education system of colleges and universities"}, {"paperId": "0046f6a7094c91adf6c22b255bfd5f8aa1a6d360", "title": "Harnessing the power of promising technologies to transform science education: prospects and challenges to promote adaptive epistemic beliefs in science learning"}, {"paperId": "81a1d3e028861f91d3d325ac91cb33b73492650d", "title": "The impact of big data analytics on organizational sustainability: The influencing factors of autonomous research and development and absorptive capacity"}, {"paperId": "d9a34ce248ded179ac52592830449cc58881a81b", "title": "The Implementation of Artificial Intelligence in STEM-Based Creative Learning in the Society 5.0 Era"}, {"paperId": "b0813472fb2b719585aca05417a23d1de3bb4134", "title": "Big data analytics opportunities for applications in process engineering"}, {"paperId": "30bfee5ffcc13cdfc07f4c7b2e11b4e8da5e3a53", "title": "Analysis of AI Precision Education Strategy for Small Private Online Courses"}, {"paperId": "b07c10b7b19bfb420496cf6dabe4ea8678596a9d", "title": "Understanding the Interaction between Technology and the Learner: The Case of DLL"}, {"paperId": "ee8a03d3b8399be77296c9068a97ae3dff6732ab", "title": "An active human role is essential in big data-led decisions and data-intensive science"}, {"paperId": "dc64d7e5ff2f6ee518d83429fe49087b09920751", "title": "Cultivating The Cognitive-Toolkit Online: Emerging Digital Technologies for Interdisciplinary Studies"}, {"paperId": "365fffeaff2bdd9509fd51270d7f7fc5810472dc", "title": "The Teaching Design Methods Under Educational Psychology Based on Deep Learning and Artificial Intelligence"}, {"paperId": "029dabbfa31814e1bd1065e5c0affb82a62d80a9", "title": "Artificial intelligence in history education. Linguistic content and complexity analyses of student writings in the CAHisT project (Computational assessment of historical thinking)"}, {"paperId": "7552bbb7106125615ddf13a60f72ab2db6a4b610", "title": "The larger picture of engaged learning"}, {"paperId": "5409220742083da04c52a2b3c6dfb7b3d9f0f9c7", "title": "Digital Language Learning (DLL): Insights from Behavior, Cognition, and the Brain"}, {"paperId": "7fcf84631c0b5f719e948db91d7eb72d276d3cba", "title": "Learning analytics on structured and unstructured heterogeneous data sources: Perspectives from procrastination, help-seeking, and machine-learning defined cognitive engagement"}, {"paperId": "d6b72df712903789a29fc0afb1beeb57e753b348", "title": "Integrated Survival Analysis and Frequent Pattern Mining for Course Failure-Based Prediction of Student Dropout"}, {"paperId": "a12104f2f184f078acefe33ec3c7946f9aeb8690", "title": "TRENDS IN THE DEVELOPMENT OF CONTINUING PROFESSIONAL EDUCATION"}, {"paperId": "361319cf7d148b0a355b76270f528ff5effd6d00", "title": "Beyond BERT: Exploring the Efficacy of RoBERTa and ALBERT in Supervised Multiclass Text Classification"}, {"paperId": "48fe4d607e7bd3183bce490bcc00ae427d82c3fe", "title": "Looking Back to the Future: A Glimpse at Twenty Years of Data Science"}, {"paperId": "d8daa82c201f6953b4b8632a87256896816f2dd5", "title": "Digital capability, digital learning, and sustainable behaviour among university students in Taiwan: A comparison design of integrated mediation-moderation models"}, {"paperId": "df79a5e57f4c720bc85591f2a3fa7d4bae0935dc", "title": "The impact of adopting AI educational technologies on projected course satisfaction in university students"}, {"paperId": "9e85fc83bdf8d380743935253ef979fd151b5c42", "title": "A comprehensive overview of artificial intelligence and machine learning in education pedagogy: 21 Years (2000–2021) of research indexed in the scopus database"}, {"paperId": "78398bf57f4c7211c42cb55fd5f1fd89982cf454", "title": "Universities in an Age of Uncertainty 44 Propositions on the Future of Universities"}, {"paperId": "5561bd2903d518a54c8056d398e515a6b49eba41", "title": "Digital Language Learning (DLL): Insights from Behavior, Cognition, and the Brain"}, {"paperId": "fad9310c447ea8d47a93115c5f4703305fed5e34", "title": "Analysis on the Possibilities of AI in Education"}, {"paperId": "eaeacbe4bd3ad7cd69de170f714fc83afca4b80d", "title": "Artificial Intelligence (AI) in Accounting & Auditing: A Literature Review"}, {"paperId": "df743a467c5ffa5fa9c1dcac31d30f3ff18d1ff9", "title": "Final Degree Project Biomedical Engineering Degree Coronary artery segmentation using Transformer Neural Networks"}, {"paperId": "f173d8cef03c8959bd4bb1c12f11fceb6d8b579d", "title": "The dynamics of an online learning community in a hybrid statistics classroom over time: Implications for the question-oriented problem-solving course design with the social network analysis approach"}, {"paperId": "96c95a512d43d0acc84e457d59361717da978033", "title": "Relative Strengths of Teachers and Smart Machines: Towards an Augmented Task Sharing"}, {"paperId": "813dfe8c2df36b691fd8900981d0c3c877f2c613", "title": "Influential Factors on Technology-Based Learning in Science, Mathematics, and Engineering (SME): A Case-Analysis from 305 Studies"}, {"paperId": "10a7622f7b63ff24c9df30953cb9847d7b618c19", "title": "Examining the relationship between cognitive flexibility and attitudes towards artificial intelligence technologies among students studying sports sciences"}, {"paperId": "a2d0bc2cd9958b9f9e700b9132aeee0d8c0d5713", "title": "Future Managers for Digital Transformation: Integrating ERP/CRM Systems and Organizational …"}, {"paperId": "73e9e641971e26cb21bb2d6ee0b0905928f9e314", "title": "AI in education: A review of personalized learning and educational technology"}]}
