{"paperId": "919a58ea7ec73db460b0ba4c56a3c570487657cf", "publicationVenue": {"id": "1df1928c-d75e-4d86-89bc-5a1be8a503d3", "name": "IEEE International Conference on Network Protocols", "type": "conference", "alternate_names": ["ICNP", "International Conference on Network Protocols", "Int Conf Netw Protoc", "IEEE Int Conf Netw Protoc"], "url": "http://www.ieee-icnp.org/"}, "title": "Bifrost: Extending RoCE for Long Distance Inter-DC Links", "abstract": "RDMA over Converged Ethernet (RoCEv2) has been widely deployed to data centers (DCs) for its better compatibility with Ethernet/IP than Infiniband (IB). As cross-DC applications emerge, they also demand high throughput, low latency, and lossless network for cross-DC data transmission. However, RoCEv2's underlying lossless mechanism Priority-based Flow Control (PFC) cannot fit into the long-haul transmission scenario and degrades the performance of RoCEv2. PFC is myopic and only considers queue length to pause upstream senders, which leads to large queueing delay. This paper proposes Bifrost, a downstream-driven lossless flow control that supports long distance cross-DC data transmission. Bifrost uses virtual incoming packets, which indicates the upper bound of in-flight packets, together with buffered packets to control the flow rate. It minimizes the buffer space requirement to one-hop bandwidth delay product (BDP) and achieves low one-way latency. Real-world experiments are conducted with prototype switches and 80 kilometers cables. Evaluations demonstrate that compared to PFC, Bifrost reduces average/tail flow completion time (FCT) of inter-DC flows by up to 22.5%/42.0%, respectively. Bifrost is compatible with existing infrastructure and can support distance of thousands of kilometers.", "venue": "IEEE International Conference on Network Protocols", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-10-10", "journal": {"name": "2023 IEEE 31st International Conference on Network Protocols (ICNP)", "pages": "1-12"}, "authors": [{"authorId": "2275735782", "name": "Peiwen Yu"}, {"authorId": "2275609247", "name": "Feiyang Xue"}, {"authorId": "2248207548", "name": "Chen Tian"}, {"authorId": "2237120214", "name": "Xiaoliang Wang"}, {"authorId": "2120450800", "name": "Yanqing Chen"}, {"authorId": "2275770858", "name": "Tao Wu"}, {"authorId": "2276058231", "name": "Lei Han"}, {"authorId": "2275819874", "name": "Zifa Han"}, {"authorId": "2275825457", "name": "Bingquan Wang"}, {"authorId": "2152012881", "name": "Xiangyu Gong"}, {"authorId": "2269632313", "name": "Wanchun Dou"}, {"authorId": "2144043665", "name": "Guihai Chen"}], "citations": []}
