{"paperId": "919ea0a7dffa53799dc25e2ac235ed02fee65b8e", "publicationVenue": null, "title": "A Case Study on Periodic Spatio- Temporal Hotspot Detection in Azure Traffic Data", "abstract": "Given a spatio-temporal event framework E and a collection of time-stamped events A (over E), the goal of the periodic spatio-temporal hotspot detection (PST-Hotspot) problem is to determine spatial regions which show high “intensity” of events at certain periodic intervals. The output of the PST-Hotspot detection problem consists of the following: (a) a col-lection of spatial regions (which show high intensity of events) and, (b) their respective time intervals of high activity and periodicity values (e.g., daily, weekday-only, etc). PST-Hotspot detection poses significant challenge for designing a suitable interest measure. The aim over here is to design a mathematical representation of a PST-Hotspot such that it can differentiate interesting periodic patterns from trivial persistent patterns in the dataset. The current state of the art in the area of spatial and spatio-temporal hotspot detection focus on non-periodic patterns. In contrast, our proposed approach is able to determine periodic hotspots. We experimentally evaluated our proposed algorithm using real Azure traffic dataset from the Indian region.", "venue": "2022 IEEE International Conference on Data Mining Workshops (ICDMW)", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-11-01", "journal": {"name": "2022 IEEE International Conference on Data Mining Workshops (ICDMW)", "pages": "1037-1044"}, "authors": [{"authorId": "144551709", "name": "Venkata M. V. Gunturi"}, {"authorId": "2204840037", "name": "Rakesh Rajeev"}, {"authorId": "2204844479", "name": "Vipul Bondre"}, {"authorId": "2204852689", "name": "Aaditya Barnwal"}, {"authorId": "2204964776", "name": "Samir Jain"}, {"authorId": "2204869235", "name": "Ashank Anshuman"}, {"authorId": "2204827334", "name": "Manish Gupta"}], "citations": []}
