{"paperId": "91a5faea1d3b41457cdefb3e3ef0ac64e46a6758", "publicationVenue": {"id": "75298332-e3d9-44ab-af5e-03b23d7bd4e6", "name": "International Journal of Computer Network and Information Security", "type": "journal", "alternate_names": ["Int J Comput Netw Inf Secur"], "issn": "2074-9090", "url": "http://www.mecs-press.org/ijcnis/"}, "title": "Sensitive Data Identification and Security Assurance in Cloud and IoT based Networks", "abstract": "Sensitive data identification is a vital strategy in any distributed system. However, in the case of non-appropriate utilization of the system, sensitive data security can be at risk. Therefore, sensitive data identification and its security validation are mandatory. The paper primarily focuses on novel sensitive data recognition methodologies. Further, the sensitivity score of the attributes distinguishes non-sensitive attributes, and domain expert plays an important role in this process. The designing of the security assurance Algo and their corresponding decision tables make the system more robust and reliable. The result section is validated with the help of graphical representation, which clearly makes the authenticity of the research work. In summary, the authors may say that the sensitive data identification and security assurance of the proposed system is automated and work optimally in a cloud-based system.", "venue": "International Journal of Computer Network and Information Security", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-10-08", "journal": {"name": "International Journal of Computer Network and Information Security"}, "authors": [{"authorId": "2072403301", "name": "Soumya Ray"}, {"authorId": "34338913", "name": "Kamta Nath Mishra"}, {"authorId": "144806656", "name": "S. Dutta"}], "citations": [{"paperId": "9b93865444729d9dd7b3ca008328229b29ce85b2", "title": "UP-SDCG: A Method of Sensitive Data Classification for Collaborative Edge Computing in Financial Cloud Environment"}, {"paperId": "4ddb0e5b104f5c6451d2c1c37fdb8b2281157521", "title": "Model of Smart Locating Application for Small Businesses"}, {"paperId": "0b3cfd8d7baf2efbf8cb5bcf5a8c11542be97ecb", "title": "Enhancing Data Space Semantic Interoperability through Machine Learning: a Visionary Perspective"}, {"paperId": "4250e0cac330e813887900004af076d3896e8df6", "title": "Energy Saving Optimization Technique-Based Routing Protocol in Mobile Ad-Hoc Network with IoT Environment"}, {"paperId": "9a6f02a6e2e31eaddecdaa042926099e9724696b", "title": "Susceptible data classification and security reassurance in cloud-IoT based computing environment"}]}
