{"paperId": "91bc4ae4331665db1111b579acd5257810da445f", "publicationVenue": {"id": "6440d316-9f88-4ca6-b7c1-91ba23c64a67", "name": "Workshop on Semantic Web Applications and Tools for Life Sciences", "type": "conference", "alternate_names": ["Workshop Semantic Web Appl Tool Life Sci", "Semantic Web Appl Tool Life Sci", "Semantic Web Applications and Tools for Life Sciences", "SWAT4LS"]}, "title": "Scaling Out Federated Queries for Life Sciences Data in Production", "abstract": "There exists an abundance of Linked Data storage solutions, but only few meet the requirements of a production environment with interlinked life sciences data. In such environments, a triple store has to support complex SPARQL queries and handle large datasets with hundreds of millions of triples. The Ontoforce platform DISQOVER offers federated search for life sciences, relying on complex federated queries over open life science data. The queries correspond to user actions in its exploratory search interface. Different state-of-the-art approaches for scaling out are compared, both in terms of their ability to execute the queries as in terms of performance. This paper analyzes and discusses the features of the datasets and query mixes. An in-depth analysis is provided showing the features of the most challenging queries.", "venue": "Workshop on Semantic Web Applications and Tools for Life Sciences", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "", "pages": "1-10", "volume": ""}, "authors": [{"authorId": "2529173", "name": "D. Witte"}, {"authorId": "2925775", "name": "Laurens De Vocht"}, {"authorId": "47278203", "name": "F. Pattyn"}, {"authorId": "3416691", "name": "H. Constandt"}, {"authorId": "1691320", "name": "E. Mannens"}, {"authorId": "1723397", "name": "R. Verborgh"}], "citations": [{"paperId": "97fcde4345b968cc8a7e6c0f225bda7c42640be6", "title": "A More Decentralized Vision for Linked Data"}, {"paperId": "d224068c0242863cdbaa2ad5be2871a1fd14d130", "title": "Enabling Web-scale data integration in biomedicine through Linked Open Data"}, {"paperId": "878e81aa22ae1c3729205c235b46d9704e71561b", "title": "Reply to: Soils need to be considered when assessing the impacts of land-use change on carbon sequestration"}]}
