{"paperId": "91be4b53c13a1aa13f725bf0fe01367f092d7e57", "publicationVenue": {"id": "d80d58be-58fc-4181-a397-5ac6fd976a47", "name": "ACM Symposium on Applied Computing", "type": "conference", "alternate_names": ["Sel Area Cryptogr", "Int Conf Sel area Cryptogr", "International Conference on Selected areas in Cryptography", "ACM Symp Appl Comput", "Selected Areas in Cryptography", "Symposium on Applied Computing", "SAC", "Symp Appl Comput"], "url": "https://www.acm.org/publications", "alternate_urls": ["http://sacworkshop.org/"]}, "title": "Towards a FAIR Dataset for non-functional requirements", "abstract": "In the last years, the application of supervised Machine Learning (ML) algorithms in Requirements Engineering (RE) has allowed increasing the performance (e.g. accuracy, precision) and scalability of automatic requirements classification. However, the lack of publicly labeled datasets is still one concern when conducting ML experiments. Few publicly labeled datasets for non-functional requirements classification are available, and even less in the Spanish language. Moreover, most of the available datasets present some limitations, such as imbalanced classes (e.g. PROMISE NFR). This study aims to generate a FAIR dataset of non-functional requirements in the Spanish language for facilitating reuse in ML classification experiments. 109 non-functional requirements were collected from final degree projects from the University of A Coruña. We conducted a pilot quasi-experiment for non-functional requirements labeling in the categories and subcategories of the ISO/IEC 25010 quality model. The labeling process was accomplished by 7 annotators. The inter-annotator agreement using a Fleiss' Kappa test obtained a substantial agreement in the category level (0.78) and a moderate agreement (0.48) when the classification is per subcategory.", "venue": "ACM Symposium on Applied Computing", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2023-03-27", "journal": {"name": "Proceedings of the 38th ACM/SIGAPP Symposium on Applied Computing"}, "authors": [{"authorId": "2207958349", "name": "Maria-Isabel Limaylla-Lunarejo"}, {"authorId": "1402993957", "name": "Nelly Condori-Fernández"}, {"authorId": "1736139", "name": "M. R. Luaces"}], "citations": []}
