{"paperId": "91c70fb1e4fe9a4e5a505a3001784e5db1029a27", "publicationVenue": {"id": "8506a01a-40b8-4e6f-bbb8-ce2492139c15", "name": "International Journal of Molecular Sciences", "type": "journal", "alternate_names": ["Int J Mol Sci"], "issn": "1422-0067", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-157693", "alternate_urls": ["https://www.mdpi.com/journal/ijms", "http://www.mdpi.com/journal/ijms/", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-157693"]}, "title": "Mathematical Model of Intrinsic Drug Resistance in Lung Cancer", "abstract": "Drug resistance is a bottleneck in cancer treatment. Commonly, a molecular treatment for cancer leads to the emergence of drug resistance in the long term. Thus, some drugs, despite their initial excellent response, are withdrawn from the market. Lung cancer is one of the most mutated cancers, leading to dozens of targeted therapeutics available against it. Here, we have developed a mechanistic mathematical model describing sensitization to nine groups of targeted therapeutics and the emergence of intrinsic drug resistance. As we focus only on intrinsic drug resistance, we perform the computer simulations of the model only until clinical diagnosis. We have utilized, for model calibration, the whole-exome sequencing data combined with clinical information from over 1000 non-small-cell lung cancer patients. Next, the model has been applied to find an answer to the following questions: When does intrinsic drug resistance emerge? And how long does it take for early-stage lung cancer to grow to an advanced stage? The results show that drug resistance is inevitable at diagnosis but not always detectable and that the time interval between early and advanced-stage tumors depends on the selection advantage of cancer cells.", "venue": "International Journal of Molecular Sciences", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-10-31", "journal": {"name": "International Journal of Molecular Sciences", "volume": "24"}, "authors": [{"authorId": "39445283", "name": "Emilia Kozłowska"}, {"authorId": "2239113111", "name": "Andrzej Swierniak"}], "citations": []}
