{"paperId": "91dc3389c5da4b5914109e461721adf378452132", "publicationVenue": {"id": "2a7ac430-c70b-4147-b72a-237f8cba9f27", "name": "USENIX Conference on File and Storage Technologies", "type": "conference", "alternate_names": ["File Storage Technol", "Form Asp Secur Trust", "USENIX Conf File Storage Technol", "FAST", "File and Storage Technologies", "Formal Aspects in Security and Trust"], "url": "http://www.wikicfp.com/cfp/program?id=1011", "alternate_urls": ["http://www.dsi.unive.it/IFIPWG1_7/index.html"]}, "title": "FusionFS: Fusing I/O Operations using CISCOps in Firmware File Systems", "abstract": "We present FusionFS, a direct-access firmware-level instorage filesystem that exploits near-storage computational capability for fast I/O and data processing, consequently reducing I/O bottlenecks. In FusionFS, we introduce a new abstraction, CISCOps, which combines multiple I/O and data processing operations into one fused operation and offloads them for near-storage processing. By offloading, CISCOps significantly reduces dominant I/O overheads such as system calls, data movement, communication, and other software overheads. Further, to enhance the use of CISCOps, we introduce MicroTx, a fine-grained crash consistency and fast (automatic) recovery mechanism for both I/O and data processing operations. Finally, we explore efficient and fair use of instorage compute resources by proposing a novel Completely Fair Scheduler (CFS) for in-storage compute and memory resources across tenants. Evaluation of FusionFS against the state-of-the-art user-level, kernel-level, and firmware-level file systems using microbenchmarks, macrobenchmarks, and real-world applications shows up to 6.12X, 5.09X, and 2.07X performance gains, and 2.65X faster recovery.", "venue": "USENIX Conference on File and Storage Technologies", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": null, "journal": {"pages": "297-312"}, "authors": [{"authorId": "2155127396", "name": "Jian Zhang"}, {"authorId": "2109978142", "name": "Yujie Ren"}, {"authorId": "33383407", "name": "Sudarsun Kannan"}], "citations": [{"paperId": "bcf81485e661b1375b2cb9e509577a8dd9e8e7a9", "title": "Retina: Cross-Layered Key-Value Store for Computational Storage"}, {"paperId": "deaafd832d6bd7851b99060fa0eb44c91c12f87d", "title": "RadarSSD: A Computational Storage for Radar Signal Processing"}, {"paperId": "67ddac719eba7adbab3e4da6fb7c207e0fd64190", "title": "Horae: A Hybrid I/O Request Scheduling Technique for Near-Data Processing-Based SSD"}, {"paperId": "1ff479f070f0941276e09107bb75e66936bedd72", "title": "High fusion computers: The IoTs, edges, data centers, and humans-in-the-loop as a computer"}]}
