{"paperId": "91dd4e7f212ebf3ce11b3468367578da10a70008", "publicationVenue": {"id": "d5b215f3-f737-45b2-875b-df309ce14c43", "name": "Scientific Programming", "type": "journal", "alternate_names": ["Sci Program"], "issn": "1058-9244", "url": "https://www.hindawi.com/journals/sp/", "alternate_urls": ["https://www.iospress.nl/html/10589244.php", "https://www.wiley.com/legacy/compbooks/compjournals/sciprog.html", "http://content.iospress.com/journals/scientific-programming"]}, "title": "A New Big Data Feature Selection Approach for Text Classification", "abstract": "Feature selection (FS) is a fundamental task for text classification problems. Text feature selection aims to represent documents using the most relevant features. This process can reduce the size of datasets and improve the performance of the machine learning algorithms. Many researchers have focused on elaborating efficient FS techniques. However, most of the proposed approaches are evaluated for small datasets and validated using single machines. As textual data dimensionality becomes higher, traditional FS methods must be improved and parallelized to handle textual big data. This paper proposes a distributed approach for feature selection based on mutual information (MI) method, which is widely applied in pattern recognition and machine learning. A drawback of MI is that it ignores the frequency of the terms during the selection of features. The proposal introduces a distributed FS method, namely, Maximum Term Frequency-Mutual Information (MTF-MI), based on term frequency and mutual information techniques to improve the quality of the selected features. The proposed approach is implemented on Hadoop using the MapReduce programming model. The effectiveness of MTF-MI is demonstrated through several text classification experiments using the multinomial Naïve Bayes classifier on three datasets. Through a series of tests, the results reveal that the proposed MTF-MI method improves the classification results compared with four state-of-the-art methods in terms of macro-F1 and micro-F1 measures.", "venue": "Scientific Programming", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-04-19", "journal": {"name": "Sci. Program.", "pages": "6645345:1-6645345:10", "volume": "2021"}, "authors": [{"authorId": "73931286", "name": "Houda Amazal"}, {"authorId": "1866438", "name": "M. Kissi"}], "citations": [{"paperId": "f8f7a1611d17b2c41bb864c19c80f0e13e7a211c", "title": "Comparative performance analysis of Boruta, SHAP, and Borutashap for disease diagnosis: A study with multiple machine learning algorithms."}, {"paperId": "7318e84f1e1b1301758493021f64d0b16227ff11", "title": "A Systematic Review of the Sarcasm Detection in the Twitter Dataset"}, {"paperId": "14bb9e42eae9f2e4ca63c1b1b5d7507b15d50aeb", "title": "A strategy for predicting waste production and planning recycling paths in e-logistics based on improved EMD-LSTM."}, {"paperId": "f43559d8037a00cc49c0a8d1d130c65318bda0e2", "title": "An integrated approach for depression diagnosis using 3S feature embeddings and G-BLS with T-pHBGO optimizer"}, {"paperId": "1216718b112db9f973b1e7fb1b94b796995a0a6d", "title": "Filter feature selection methods for text classification: a review"}, {"paperId": "a6dff8f97d20263c096ce972f009a3badd81798f", "title": "Sentiment Analysis on Airline Service Reviews using Data Mining based Classification Techniques"}, {"paperId": "f6df596f51e9a9b5b01eb7b8ca6af4209fea2bf0", "title": "Text Classification Based on Machine Learning and Natural Language Processing Algorithms"}, {"paperId": "819a1c317ace34418c7df5950df06760c76b722e", "title": "An Enhanced Ant Colony Optimization Mechanism for the Classification of Depressive Disorders"}, {"paperId": "b0aa86accdf0645997b51faa50bace3f04a28892", "title": "Parallel Classification Algorithm Design of Human Resource Big Data Based on Spark Platform"}, {"paperId": "d7b325ea271298d68fad4badc32f2737445c8c61", "title": "Research on the Text Classification of Legal Consultation Based on Deep Learning"}]}
