{"paperId": "91eaf25ee742ad0c19ad9dc65e92615dc2bbfaea", "publicationVenue": {"id": "290335d6-cddc-465d-87f1-807e86d8efee", "name": "IEEE Geoscience and Remote Sensing Letters", "type": "journal", "alternate_names": ["IEEE Geosci Remote Sens Lett"], "issn": "1545-598X", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=8859", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=8859"]}, "title": "Cloud Implementation of Extreme Learning Machine for Hyperspectral Image Classification", "abstract": "Classifying remotely sensed hyperspectral images (HSIs) became a computationally demanding task given the extensive information contained throughout the spectral dimension. Furthermore, burgeoning data volumes compound inherent computational and storage challenges for data processing and classification purposes. Given their distributed processing capabilities, cloud environments have emerged as feasible solutions to handle these hurdles. This encourages the development of innovative distributed classification algorithms that take full advantage of the processing capabilities of such environments. Recently, computational-efficient methods have been implemented to boost network convergence by reducing the required training calculations. This letter develops a novel cloud-based distributed implementation of the extreme learning machine (CC-ELM) algorithm for efficient HSI classification. The proposal implements a fault-tolerant and scalable computing design while avoiding traditional batch-based backpropagation. CC-ELM has been evaluated over state-of-the-art HSI classification benchmarks, yielding promising results and proving the feasibility of cloud environments for large remote sensing and HSI data volumes processing. The code available at https://github.com/mhaut/scalable-ELM-HSI.", "venue": "IEEE Geoscience and Remote Sensing Letters", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Geoscience and Remote Sensing Letters", "pages": "1-5", "volume": "20"}, "authors": [{"authorId": "21248079", "name": "J. M. Haut"}, {"authorId": "1405206662", "name": "S. Moreno-Álvarez"}, {"authorId": "2224253029", "name": "Enrique Moreno-Ávila"}, {"authorId": "1894970", "name": "V. Ayma"}, {"authorId": "1405628745", "name": "R. Pastor-Vargas"}, {"authorId": "31715636", "name": "Mercedes Eugenia Paoletti"}], "citations": []}
