{"paperId": "920bf06829379bba6e7ee83a6a4841157ec935e5", "publicationVenue": {"id": "f51b8132-f142-4bab-913a-705ac6f05107", "name": "Technologies", "type": "journal", "alternate_names": ["Technol (basel", "Technologies (Basel)"], "issn": "2227-7080", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-318028", "alternate_urls": ["https://www.mdpi.com/journal/technologies", "https://pub.uni-bielefeld.de/publication/2932656", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-318028"]}, "title": "Towards a Secure and Scalable IoT Infrastructure: A Pilot Deployment for a Smart Water Monitoring System", "abstract": "Recent growth in the Internet of Things (IoT) looks promising for realizing a smart environment of the future. However, concerns about the security of IoT devices are escalating as they are inherently constrained by limited resources, heterogeneity, and lack of standard security controls or protocols. Due to their inability to support state-of-the-art secure network protocols and defense mechanisms, standard security solutions are unsuitable for dynamic IoT environments that require large and smart IoT infrastructure deployments. At present, the IoT based smart environment deployments predominantly use cloud-centric approaches to enable continuous and on-demand data exchange that leads to further security and privacy risks. While standard security protocols, such as Virtual Private Networks (VPNs), have been explored for certain IoT environments recently, the implementation models reported have several variations and are not practically scalable for any dynamically scalable IoT deployment. This paper addresses current drawbacks in providing the required flexibility, interoperability, scalability, and low-cost practical viability of a secure IoT infrastructure. We propose an adaptive end-to-end security model that supports the defense requirements for a scalable IoT infrastructure. With low-cost embedded controllers, such as the Raspberry Pi, allowing for the convergence of more sophisticated networking protocols to be embedded at the IoT monitoring interface, we propose a scalable IoT security model integrating both the IoT devices and the controller as one embedded device. Our approach is unique, with a focus on the integration of a security protocol at the embedded interface. In addition, we demonstrate a prototype implementation of our IoT security model for a smart water monitoring system. We believe that our modest first step would instill future research interests in this direction.", "venue": "Technologies", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2020-09-26", "journal": {"name": "Technologies"}, "authors": [{"authorId": "9142678", "name": "A. Overmars"}, {"authorId": "145710905", "name": "S. Venkatraman"}], "citations": [{"paperId": "c3de3c183379e03badff2b7269e1986fcf96e001", "title": "Review of smart water management: IoT and AI in water and wastewater treatment"}, {"paperId": "49681b365a9f61e0d2ced70a00f17377948f90a1", "title": "Architectural Model and Modified Long Range Wide Area Network (LoRaWAN) for Boat Traffic Monitoring and Transport Detection Systems in Shallow Waters"}, {"paperId": "875098fc481569e78477a6b4d2d42f82c6259bad", "title": "Smart Water Level Monitoring System Using Internet of Things (IoT)"}, {"paperId": "fb03111932762615c25ee42b792aa76970d3b950", "title": "An end-to-end real-time pollutants spilling recognition in wastewater based on the IoT-ready SENSIPLUS platform"}, {"paperId": "0af951b354f6e236b5c164084d344bb14077898b", "title": "Smart Anti-Theft Water Metering System"}, {"paperId": "4e5b49b8d5c951edc7277be1a0a12d58ddd34f0c", "title": "Smart Home Automation - Use Cases of a Secure and Integrated Voice-Control System"}, {"paperId": "17fd16b416894cc4bcaea8290e670e3214dc7a1a", "title": "Big Data and Personalisation for Non-Intrusive Smart Home Automation"}]}
