{"paperId": "92143c8f2c0f1490d92b4c03f5aa02c2bdadd83b", "publicationVenue": null, "title": "Intentional Data Placement Policy for Improving OLAP Cube Construction on Hadoop Clusters", "abstract": "In the recent past, we have witnessed dramatic increases in the volume of data literally in every area: business, science, and daily life to name a few. The Hadoop framework-an open source project based on the MapReduce paradigm-is a popular choice for big data analytics. However, the performance gained from Hadoop's features is currently limited by its default block placement policy, which does not take any data characteristics into account. Indeed, the efficiency of many operations can be improved by a careful data placement , including indexing, grouping, aggregation and joins. In our work we propose a data warehouse partitioning strategy to improve query gain performances. We investigate the performance gain for OLAP cube construction with and without data organization on a Hadoop cluster. And this, by varying the number of nodes and data warehouse size. Our experiments suggest that a good data placement on a cluster during the implementation of the data warehouse can significantly increase the OLAP cube construction and querying performances. In the next step, we will extend the experiments to study the effects of other configuration parameters on collocation data in the context of parallel data warehousing, such as partitions size, replication factor and OLAP query complexity. We plan also to study an intelligent system for warehouses data placement on clusters by integrating Multi-Agent System (MAS) and Intelligent Agents to the process.", "venue": "", "year": 2014, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2014-10-14", "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "1769989", "name": "Billel Arres"}, {"authorId": "1774419", "name": "N. Kabachi"}, {"authorId": "9421445", "name": "O. Boussaid"}], "citations": []}
