{"paperId": "921508244edbe1decf3e3036ef4df93a8a74fd58", "publicationVenue": {"id": "8e1bd4b5-d5b2-4e22-ba0a-01fe5568d472", "name": "Remote Sensing", "type": "journal", "alternate_names": ["Remote Sens"], "issn": "2315-4675", "alternate_issns": ["2072-4292"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169233", "alternate_urls": ["https://www.mdpi.com/journal/remotesensing", "http://www.mdpi.com/journal/remotesensing", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169233"]}, "title": "Neuro-Fuzzy-AHP (NFAHP) Technique for Copper Exploration Using Advanced Spaceborne Thermal Emission and Reflection Radiometer (ASTER) and Geological Datasets in the Sahlabad Mining Area, East Iran", "abstract": "Fusion and analysis of thematic information layers using machine learning algorithms provide an important step toward achieving accurate mineral potential maps in the reconnaissance stage of mineral exploration. This study developed the Neuro-Fuzzy-AHP (NFAHP) technique for fusing remote sensing (i.e., ASTER alteration mineral image-maps) and geological datasets (i.e., lithological map, geochronological map, structural map, and geochemical map) to identify high potential zones of volcanic massive sulfide (VMS) copper mineralization in the Sahlabad mining area, east Iran. Argillic, phyllic, propylitic and gossan alteration zones were identified in the study area using band ratio and Selective Principal Components Analysis (SPCA) methods implemented to ASTER VNIR and SWIR bands. For each of the copper deposits, old mines and mineralization indices in the study area, information related to exploration factors such as ore mineralization, host-rock lithology, alterations, geochronological, geochemistry, and distance from high intensity lineament factor communities were investigated. Subsequently, the predictive power of these factors in identifying copper occurrences was evaluated using Back Propagation Neural Network (BPNN) technique. The BPNN results demonstrated that using the exploration factors, copper mineralizations in Sahlabad mining area could be identified with high accuracy. Lastly, using the Fuzzy-Analytic Hierarchy Process (Fuzzy-AHP) method, information layers were weighted and fused. As a result, a potential map of copper mineralization was generated, which pinpointed several high potential zones in the study area. For verification of the results, the documented copper deposits, old mines, and mineralization indices in the study area were plotted on the potential map, which is particularly appearing in high favorability parts of the potential map. In conclusion, the Neuro-Fuzzy-AHP (NFAHP) technique shows great reliability for copper exploration in the Sahlabad mining area, and it can be extrapolated to other metallogenic provinces in Iran and other regions for the reconnaissance stage of mineral exploration.", "venue": "Remote Sensing", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-11-04", "journal": {"name": "Remote. Sens.", "pages": "5562", "volume": "14"}, "authors": [{"authorId": "81603883", "name": "A. Shirazi"}, {"authorId": "3299524", "name": "A. Hezarkhani"}, {"authorId": "1637440515", "name": "Amin Beiranvand Pour"}, {"authorId": "79176982", "name": "Adel Shirazy"}, {"authorId": "48650673", "name": "M. Hashim"}], "citations": [{"paperId": "55aa7ef157a12896d405bac3f48fe69dc7a2667c", "title": "Three-dimensional prospectivity modeling based on fuzzy logic and geometric average: a case study from Sansong district, Yongyu apatite deposit, DPR Korea"}, {"paperId": "ae2c8f9c5759feeb3071a60e3a63194a5bbad895", "title": "Machine Learning-Based Lithological Mapping from ASTER Remote-Sensing Imagery"}, {"paperId": "4adea9c772e51d879beea280e08024edc3f54d8e", "title": "PRISMA hyperspectral imagery for mapping alteration zones associated with Kuhpanj porphyry copper deposit, Southern Iran"}, {"paperId": "b5c94f9d5987740297b9d39f18133c4236ed9a1a", "title": "Selection of Landsat-8 Operational Land Imager (OLI) Optimal Band Combinations for Mapping Alteration Zones"}, {"paperId": "931a4a1c40c31ec666e44e025f2e2281a98bf8c7", "title": "A New Vector for Mapping Gold Mineralization Potential and Proposed Pathways in Highly Weathered Basement Rocks using Multispectral, Radar, and Magnetic Data in Random Forest Algorithm"}, {"paperId": "119016087034feef25bc9ff54141560517e272ff", "title": "Combine Landsat 8 OLI/TIRS sensors/SRTM image processing and field observations for geological mapping of the Nlonako ring complex (South West of Cameroon Line) under dense forest vegetation and humid climate"}, {"paperId": "d7935223058f6bc0b0f34e09d528b590f5dc76fb", "title": "Assessment on water cycle health in the Central Plains Urban cluster based on the DSWU NWU SWS NWS A — WCHI model"}, {"paperId": "fc700718de2569ead8057efc72e0cf1bc1394106", "title": "Editorial for the Special Issue Entitled Hyperspectral Remote Sensing from Spaceborne and Low-Altitude Aerial/Drone-Based Platforms - Differences in Approaches, Data Processing Methods, and Applications"}, {"paperId": "681cb033bbea7c07d4c8b21a93fbf9e05e2b61c4", "title": "Remote Sensing, Petrological and Geochemical Data for Lithological Mapping in Wadi Kid, Southeast Sinai, Egypt"}, {"paperId": "f669cc5172414962c75ff139f7ca968a753d9b35", "title": "Geochemical Modeling of Copper Mineralization Using Geostatistical and Machine Learning Algorithms in the Sahlabad Area, Iran"}, {"paperId": "e8cdaf562bc8064d546c09ccf7564456da5a1904", "title": "Information Fusion and Metallogenic Prognosis of Gold Deposits in the Qixia Area, Northern Shandong Province, China"}, {"paperId": "0ea3789cd3313a67be56cb621af0bd17974a8fb5", "title": "Mapping hydrothermal alteration of the Pulang porphyry copper deposit, SW China, using ASTER and ZY1-02D satellite data"}, {"paperId": "cdd26315207aaa55f3a64ce4c72245bf7b88b7b0", "title": "Characterization of ASTER spectral bands for mapping of Pyrophyllite of hydrothermal alteration zones in and around Tikamgarh, Madhya Pradesh"}, {"paperId": "8fc9d208e385876127a86c5ad650698e1adb9976", "title": "Evaluating the Performance of Machine Learning and Deep Learning Techniques to HyMap Imagery for Lithological Mapping in a Semi-Arid Region: Case Study from Western Anti-Atlas, Morocco"}, {"paperId": "c3188fa5e6b9a658a0ac95d69442e7b191034c2f", "title": "Mapping alteration zones in the Southern section of Yulong copper belt, Tibet using multi-source remote sensing data"}, {"paperId": "b2fc7f6c333d9ed8f17e4b9940666cdc49d18944", "title": "Towards better delineation of hydrothermal alterations via multi-sensor remote sensing and airborne geophysical data"}, {"paperId": "bf0f1a89dd210edc98e003b4ba460301ca330b8d", "title": "Ore Genesis of the Abu Ghalaga Ferro-Ilmenite Ore Associated with Neoproterozoic Massive-Type Gabbros, South-Eastern Desert of Egypt: Evidence from Texture and Mineral Chemistry"}, {"paperId": "1cd87664a1accddea21407066ad341331be5118f", "title": "Classification of Alteration Zones Based on Drill Core Hyperspectral Data Using Semi-Supervised Adversarial Autoencoder: A Case Study in Pulang Porphyry Copper Deposit, China"}, {"paperId": "fe747e7e4e14d607a7c690379a297ac66f2fef20", "title": "A New Strategy to Fuse Remote Sensing Data and Geochemical Data with Different Machine Learning Methods"}, {"paperId": "5d54410a9948be71a621b2a3b2e202b64bbd3cba", "title": "Intuitionistic Fuzzy Deep Neural Network"}, {"paperId": "8317d2cd92670f50a729d33286e73f1ee37183d2", "title": "Editorial for the Special Issue: “Multispectral Remote Sensing Satellite Data for Mineral and Hydrocarbon Exploration: Big Data Processing and Deep Fusion Learning Techniques”"}, {"paperId": "a9216c00d95cee5dd92908cfd8f83acdab6266fa", "title": "Geochemical relations among elements in stream sediment samples from Siojan Prospecting Area, Iran using geostatistical methods"}, {"paperId": "9f29bcda6cc12bdaed1d0bbedaa2009290c7829d", "title": "In Situ Skin Friction Capacity Modeling with Advanced Neuro-Fuzzy Optimized by Metaheuristic Algorithms"}, {"paperId": "f393f8737e86fdf0650e874bb2ddd0529e1809d0", "title": "Fusion of Remote Sensing, Magnetometric, and Geological Data to Identify Polymetallic Mineral Potential Zones in Chakchak Region, Yazd, Iran"}]}
