{"paperId": "921b4742b1b41f60cd7f6698350d41e514bd19f9", "publicationVenue": {"id": "6175efe8-6f8e-4cbe-8cee-d154f4e78627", "name": "Mathematics", "issn": "2227-7390", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-283014", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-283014", "https://www.mdpi.com/journal/mathematics"]}, "title": "An Evolutionary Algorithm for Task Clustering and Scheduling in IoT Edge Computing", "abstract": "The Internet of Things (IoT) edge is an emerging technology of sensors and devices that communicate real-time data to a network. IoT edge computing was introduced to handle the latency concerns related to cloud computing data management, as the data are processed closer to their point of origin. Clustering and scheduling tasks on IoT edge computing are considered a challenging problem due to the diverse nature of task and resource characteristics. Metaheuristics and optimization methods are widely used in IoT edge task clustering and scheduling. This paper introduced a new task clustering and scheduling mechanism using differential evolution optimization on IoT edge computing. The proposed mechanism aims to optimize task clustering and scheduling to find optimal execution times for submitted tasks. The proposed mechanism for task clustering is based on the degree of similarity of task characteristics. The proposed mechanisms use an evolutionary mechanism to distribute system tasks across suitable IoT edge resources. The clustering tasks process categorizes tasks with similar requirements and then maps them to appropriate resources. To evaluate the proposed differential evolution mechanism for IoT edge task clustering and scheduling, this study conducted several simulation experiments against two established mechanisms: the Firefly Algorithm (FA) and Particle Swarm Optimization (PSO). The simulation configuration was carefully created to mimic real-world IoT edge computing settings to ensure the proposed mechanism’s applicability and the simulation results’ relevance. In the heavyweight workload scenario, the proposed DE mechanism started with an execution time of 916.61 milliseconds, compared to FA’s 1092 milliseconds and PSO’s 1026.09 milliseconds. By the 50th iteration, the proposed DE mechanism had reduced its execution time significantly to around 821.27 milliseconds, whereas FA and PSO showed lesser improvements, with FA at approximately 1053.06 milliseconds and PSO stabilizing at 956.12 milliseconds. The simulation results revealed that the proposed differential evolution mechanism for edge task clustering and scheduling outperforms FA and PSO regarding system efficiency and stability, significantly reducing execution time and having minimal variation across simulation iterations.", "venue": "Mathematics", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-01-15", "journal": {"name": "Mathematics"}, "authors": [{"authorId": "2260748835", "name": "Adil Yousif"}, {"authorId": "1874430", "name": "M. Bashir"}, {"authorId": "2112230081", "name": "Awad Ali"}], "citations": [{"paperId": "dc9e1328551fc0e0c92ef09713f21ca5c264011e", "title": "Formal Modeling and Verification of Embedded Real-Time Systems: An Approach and Practical Tool Based on Constraint Time Petri Nets"}]}
