{"paperId": "922789a5535cb0b3c4aaada6508acc37e35ffc29", "publicationVenue": {"id": "4ab1e1bf-98e8-4e0c-a53a-7a00e37e44e2", "name": "The International Archives of the Photogrammetry, Remote Sensing and Spatial Information Sciences", "type": "journal", "alternate_names": ["Int Arch Photogramm Remote Sens Spat Inf Sci"], "issn": "1682-1750", "url": "https://www.isprs.org/publications/archives.aspx"}, "title": "K-NEAREST NEIGHBOUR QUERY PERFORMANCE ANALYSES ON A LARGE SCALE TAXI DATASET: POSTGRESQL VS. MONGODB", "abstract": "Abstract. The increasing volume of transport network data necessitates the use of a DataBase Management System (DBMS) to store, query and analyse data. There are two main types of DBMS: relational and non-relational. Many different DBMS are available on the market but only some of them could handle spatial data. Therefore, determining which DBMS to use for operational purposes is of interest to researchers and analysts working in spatial information science. One of the commonly used spatial queries in GIS is the k-Nearest Neighbour (kNN) of a given point. This paper analyses the performance of the kNN query in PostgreSQL and MongoDB, both being a representative of relational and NoSQL DBMS respectively. Two different metrics have been investigated to determine the performance: i) spatial accuracy and ii) run time. Haversine and Vincenty formulas are used to calculate the distance between the point and the determined neighbours, which are then used to determine the spatial accuracy of the DBMS. Sensitivity analysis have been carried out by varying the k value and the execution times are recorded. The experiments are carried out on New York City’s openly available taxi dataset consisting of millions of taxi pickup and dropoff points. The results indicate that MongoDB outperforms Postgres both in terms of execution time and spatial accuracy regardless the value of k. In order to facilitate reproducibility of the results, the developed software is shared on GitHub.\n", "venue": "The International Archives of the Photogrammetry, Remote Sensing and Spatial Information Sciences", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2019-06-05", "journal": {"name": "The International Archives of the Photogrammetry, Remote Sensing and Spatial Information Sciences"}, "authors": [{"authorId": "2085621419", "name": "I. Coşkun"}, {"authorId": "148136551", "name": "S. Sertok"}, {"authorId": "3056896", "name": "B. Anbaroğlu"}], "citations": [{"paperId": "5bfc098c1ffde9c9fe2315b21c413f038383511b", "title": "COMPARATIVE ANALYSIS OF VINCENTY AND GEODESIC METHOD APPROACHES IN MEASURING THE DISTANCE BETWEEN SUBDISTRICT OFFICES IN SALATIGA CITY"}, {"paperId": "6e7314f3629979c2d3e3ce2df6389f9b73e80a28", "title": "PERFORMANCE MATTERS ON IDENTIFICATION OF ORIGIN-DESTINATION MATRIX ON BIG GEOSPATIAL DATA"}, {"paperId": "e500efbe603168b22849336e525d23b3b0a58e61", "title": "Spatial Query Performance Analyses on a Big Taxi Trip Origin–Destination Dataset"}]}
