{"paperId": "9232bd68bd205f68c2f700316a302cbec878696c", "publicationVenue": {"id": "94e3a15e-0237-4d49-b070-b3b5d5f4d813", "name": "Telemedicine Reports", "type": "journal", "alternate_names": ["Telemed Rep"], "issn": "2692-4366", "url": "https://www.liebertpub.com/tmr"}, "title": "Comparing the Discussion of Telehealth in Two Social Media Platforms: Social Listening Analysis", "abstract": "Background: Social media is used as a source of information and platform to discuss health care; however, there is little research on discussion of telehealth in social media. Past research has looked at individual platforms, but a comparison of discussion on two platforms (Reddit and Twitter) has not been performed. Understanding telehealth-related social media discourse and the differences between platforms may provide insights into how telehealth is characterized online and which platforms provide patient perspectives. The COVID-19 pandemic provides a unique case study to examine how social media users approached both Reddit and Twitter during an international health crisis. This study used natural language processing tools and two social media platforms to (1) characterize and contrast each platform's telehealth-related posts according to themes and (2) assess the frequency of telehealth and telehealth-related terms posts before and during the onset of the COVID-19 pandemic. Methods: We collected 6 years (2016 through 2021) of social media posts from Twitter and Reddit. The themes of the corpus were extracted using hashtags, subreddits, and Latent Dirichlet Allocation (LDA) and were analyzed using descriptive statistics. Results: Both Twitter and Reddit showed exponential growth in the use of the term “telehealth” and telehealth-related terms in early 2020. The use of telehealth-related terms and discussion of COVID-19 coincided in both social media sites; however, other themes were discussed, including how to use telehealth. Reddit LDA clusters showed greatest usage of “telehealth” when associated with using or suggesting telehealth for receiving therapy, counseling, or psychoanalysis while Twitter focused on sharing telehealth news, products, and services. Discussion: Twitter and Reddit had extensive growth in the use of telehealth-related terms after the COVID-19 pandemic. Twitter and Reddit showed themes connecting COVID-19 to telehealth, especially in reference to services, therapy, and counseling, however, Reddit had more discussion suggesting use of telehealth services or requesting peer insights into how to use telehealth as compared with Twitter, which appeared more focused on telehealth as a business or product.", "venue": "Telemedicine Reports", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-01", "journal": {"name": "Telemedicine Reports", "pages": "236 - 248", "volume": "4"}, "authors": [{"authorId": "14901507", "name": "Catherine C. Shoults"}, {"authorId": "2043856", "name": "Leah C. Dawson"}, {"authorId": "7157535", "name": "C. Hayes"}, {"authorId": "3342078", "name": "H. Eswaran"}], "citations": [{"paperId": "d64be9ce1aa63589a5279a19612de320e0f29c41", "title": "Use of #NutritionFacts to promote evidence-based nutrition information: X (formerly Twitter) hashtag analysis study"}]}
