{"paperId": "923692622baae0ddc32978c2b73327db22df09ec", "publicationVenue": {"id": "5545566b-c0b8-418c-83a5-a986a4657572", "name": "ACM-SIAM Symposium on Discrete Algorithms", "type": "conference", "alternate_names": ["Symposium on Discrete Algorithms", "ACM-SIAM Symp Discret Algorithm", "Symp Discret Algorithm", "SODA"], "url": "https://en.wikipedia.org/wiki/Symposium_on_Discrete_Algorithms"}, "title": "Massively-Parallel Similarity Join, Edge-Isoperimetry, and Distance Correlations on the Hypercube", "abstract": "We study distributed protocols for finding all pairs of similar vectors in a large dataset. Our results pertain to a variety of discrete metrics, and we give concrete instantiations for Hamming distance. In particular, we give improved upper bounds on the overhead required for similarity defined by Hamming distance r > 1 and prove a lower bound showing qualitative optimality of the overhead required for similarity over any Hamming distance r. Our main conceptual contribution is a connection between similarity search algorithms and certain graph-theoretic quantities. For our upper bounds, we exhibit a general method for designing one-round protocols using edge-isoperimetric shapes in similarity graphs. For our lower bounds, we define a new combinatorial optimization problem, which can be stated in purely graph-theoretic terms yet also captures the core of the analysis in previous theoretical work on distributed similarity joins. As one of our main technical results, we prove new bounds on distance correlations in subsets of the Hamming cube.", "venue": "ACM-SIAM Symposium on Discrete Algorithms", "year": 2016, "fieldsOfStudy": ["Computer Science", "Mathematics"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2016-11-15", "journal": {"pages": "289-306"}, "authors": [{"authorId": "1791374", "name": "P. Beame"}, {"authorId": "3125805", "name": "Cyrus Rashtchian"}], "citations": [{"paperId": "5d9c7faf4a1cd3348afe0d771b7913cda8ca5c0c", "title": "Sparse Hashing for Scalable Approximate Model Counting: Theory and Practice"}, {"paperId": "a24b020309d38654e9f90693e099970c6c845839", "title": "An Industrial Dynamic Skyline Based Similarity Joins For Multidimensional Big Data Applications"}, {"paperId": "a3a393554bb9e33f8b4a9b17ac93f0b34feb5ab5", "title": "LSF-Join: Locality Sensitive Filtering for Distributed All-Pairs Set Similarity Under Skew"}, {"paperId": "2ee4a2790bbb5d46a33b96475f56819e461769b0", "title": "Edge Isoperimetric Inequalities for Powers of the Hypercube"}, {"paperId": "202a266dab247429cbd634be703df5bff1ab96ad", "title": "New Algorithmic Tools for Distributed Similarity Search and Edge Estimation"}]}
