{"paperId": "9242c43c3b67f528df88ac342ea7db709cceec7b", "publicationVenue": {"id": "1268cf6f-971e-46d2-aaef-1621574eacf6", "name": "International Conference on Computer Science and Information Technologies", "type": "conference", "alternate_names": ["IEEE Int Conf Comput Sci Inf Technol", "International Conference on Computer Science and Information Technology", "ICCSIT", "IEEE International Conference on Computer Science and Information Technology", "CSIT", "Int Conf Comput Sci Inf Technol"], "url": "https://csit.ieee.org.ua/"}, "title": "Information Technologies of Internet Devices and BigData in the “Smart Cities” Projects", "abstract": "The authors offer the innovative approach to the use of information technologies of Internet devices and BigData in the implementation of the “Smart cities” projects. A description of the designed information-technology platform for telemetry accounting of water, heat, gas and electricity consumption aimed at the implementation in the “Smart cities” projects is presented. The basic version of the offered platform uses several generations of digital devices for transmiting telemetry data with the ability of Internet connection by means of network interfaces (LANs) and mobile networks. It is suggested to combine the technology of Internet devices and BigData in order to analyze and process a large number of data sets collected from heterogeneous sources, which in turn are characterized by weak structuring and high speed of updating.", "venue": "International Conference on Computer Science and Information Technologies", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2018-09-01", "journal": {"name": "2018 IEEE 13th International Scientific and Technical Conference on Computer Sciences and Information Technologies (CSIT)", "pages": "72-75", "volume": "2"}, "authors": [{"authorId": "51930110", "name": "Duda Oleksii"}, {"authorId": "51933926", "name": "M. Oleksandr"}, {"authorId": "2097548736", "name": "Karpinski Mikolaj"}, {"authorId": "2098407381", "name": "Veretennikova Nataliia"}, {"authorId": "51897300", "name": "Kunanets Nataliia"}, {"authorId": "143620085", "name": "P. Volodymyr"}], "citations": [{"paperId": "96c961edef823096644d2451a9943fbf3e5380a1", "title": "Big Data Approach towards Networking, Data Transfer, IOT and Security: A Review"}, {"paperId": "b7026666dfa595417ebd5be9df396c7037b93c4f", "title": "Selection of Effective Methods of Big Data Analytical Processing in Information Systems of Smart Cities"}]}
