{"paperId": "924987c789739249de4a9fc54c9f17cbf5ad2a6c", "publicationVenue": null, "title": "QoE-Driven Joint Resource Allocation for Content Delivery in Fog Computing Environment", "abstract": "In the era of information, the services of fog computing environment with content delivery are expected to offer users the better satisfaction of Quality-of- Experience (QoE) than that in a conventional environment. Nevertheless, the dataflow and new demands from users increase along with the promising of content-centric computing system in fog computing environment. Therefore, the satisfaction of QoE will become the major challenge. In this article, to enhance the satisfaction of QoE, we propose QoE models to evaluate the quality of service in fog computing environment concerning both system and users. The value of QoE does not only refer to the system cost, but also the Mean Opinion Score (MOS) of users. Therefore, our models could capture influential factors from system cost based on system states and services for users. Specially, we mainly focus on issues of cache allocation and transmission rate. Under this fog computing environment, aiming to the capacity of cache allocation among fog nodes and handle transmission rates under a constrained total system cost and MOS, we devote our efforts to the following two aspects. First, we formulate the QoE as a joint resource allocation problem under different transmission rates to acquire best QoE. Then, we propose a dynamic algorithm based on shortest path tree (SPT), which is suitable for fog computing environment with content delivery frequently. Simulation results reveal that the benefit for using the dynamic allocation (DA) method to allocate resource can achieve high QoE performance.", "venue": "2018 IEEE International Conference on Communications (ICC)", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2018-05-01", "journal": {"name": "2018 IEEE International Conference on Communications (ICC)", "pages": "1-6"}, "authors": [{"authorId": "1443722910", "name": "Xiaoming He"}, {"authorId": "28014924", "name": "Kun Wang"}, {"authorId": "21941206", "name": "Huawei Huang"}, {"authorId": "1718215", "name": "T. Miyazaki"}, {"authorId": "2125059237", "name": "Yixuan Wang"}, {"authorId": "1759469", "name": "Yanfei Sun"}], "citations": [{"paperId": "783a2dc47f92a76f89e06cd9db3b3d4e26b3ff78", "title": "QoE-aware budgeted edge data caching online: A primal-dual approach"}, {"paperId": "1661ffa37ee569591bbda7f7f17c2d5fc33e3ece", "title": "Efficient Orchestration of Service Chains in Fog Computing for Immersive Media"}, {"paperId": "d7cb8183e2ae56eb40d1c70b29c8eb9aace9b067", "title": "A Comprehensive Study of Caching Effects on Fog Computing Performance"}, {"paperId": "9f3dc5541be601da93c6aac57a8688151c5230a9", "title": "On the classification of fog computing applications: A machine learning perspective"}, {"paperId": "33cb916f17f1124e0e749830a850f8998dbd2eac", "title": "Edge QoE: Computation Offloading With Deep Reinforcement Learning for Internet of Things"}, {"paperId": "dc8cec943bbe66e807a54d2ddc0b260418270fdf", "title": "Quality of Experience for Streaming Services: Measurements, Challenges and Insights"}, {"paperId": "d2b5eec036d9b5094a1e242e0d9a7c3e26c00d4b", "title": "Blockchain for smart communities: Applications, challenges and opportunities"}, {"paperId": "381236f5cdff415c13446637f47029fd3fbb1b06", "title": "Performance Analysis for D2D-Enabled Cellular Networks With Mobile Edge Computing"}, {"paperId": "23cb57e169bff4082a66556a38769d4c3e726f45", "title": "Data-Driven QoE Measurement"}]}
