{"paperId": "924b001e3f571da357c052ce9ea1213234dc2f65", "publicationVenue": {"id": "dc6419f3-98b3-4718-bba0-6b6d6c3d192b", "name": "JMIR Medical Informatics", "type": "journal", "alternate_names": ["JMIR med informatics", "JMIR medical informatics", "JMIR Med Informatics"], "issn": "2291-9694", "url": "https://medinform.jmir.org/"}, "title": "An Extract-Transform-Load Process Design for the Incremental Loading of German Real-World Data Based on FHIR and OMOP CDM: Algorithm Development and Validation", "abstract": "Background In the Medical Informatics in Research and Care in University Medicine (MIRACUM) consortium, an IT-based clinical trial recruitment support system was developed based on the Observational Medical Outcomes Partnership (OMOP) Common Data Model (CDM). Currently, OMOP CDM is populated with German Fast Healthcare Interoperability Resources (FHIR) using an Extract-Transform-Load (ETL) process, which was designed as a bulk load. However, the computational effort that comes with an everyday full load is not efficient for daily recruitment. Objective The aim of this study is to extend our existing ETL process with the option of incremental loading to efficiently support daily updated data. Methods Based on our existing bulk ETL process, we performed an analysis to determine the requirements of incremental loading. Furthermore, a literature review was conducted to identify adaptable approaches. Based on this, we implemented three methods to integrate incremental loading into our ETL process. Lastly, a test suite was defined to evaluate the incremental loading for data correctness and performance compared to bulk loading. Results The resulting ETL process supports bulk and incremental loading. Performance tests show that the incremental load took 87.5% less execution time than the bulk load (2.12 min compared to 17.07 min) related to changes of 1 day, while no data differences occurred in OMOP CDM. Conclusions Since incremental loading is more efficient than a daily bulk load and both loading options result in the same amount of data, we recommend using bulk load for an initial load and switching to incremental load for daily updates. The resulting incremental ETL logic can be applied internationally since it is not restricted to German FHIR profiles.", "venue": "JMIR Medical Informatics", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-03-15", "journal": {"name": "JMIR Medical Informatics", "volume": "11"}, "authors": [{"authorId": "2165167041", "name": "Elisa Henke"}, {"authorId": "2111034571", "name": "Yuan Peng"}, {"authorId": "1753568937", "name": "Ines Reinecke"}, {"authorId": "2105883365", "name": "Michéle Zoch"}, {"authorId": "1739980", "name": "M. Sedlmayr"}, {"authorId": "1753718045", "name": "Franziska Bathelt"}], "citations": [{"paperId": "c64016bd83f0613eb562210ceb23471af5510731", "title": "Use of Metadata-Driven Approaches for Data Harmonization in the Medical Domain: Scoping Review"}]}
