{"paperId": "9267e85866f80de6c252faad50d7f41ba6654dc6", "publicationVenue": null, "title": "Enabling versatile analysis of large scale traffic video data with deep learning and HiveQL", "abstract": "While monocular roadside cameras have been widely deployed and used to monitor traffic conditions across the United States, the analysis of those video data are commonly implemented either manually or through commercial applications tailor-made for specific tasks. The goal of this project is to develop an efficient system that can meet dynamic content based video analysis needs and scale to large scale traffic camera video data. The proposed system utilizes deep learning methods to recognize objects in the video data. That information can then be processed and analyzed through an analysis layer implemented using Spark and Hive. The analysis layer supports HiveQL, which enables end users to conduct sophisticated analysis with customized queries. In this paper, we present the implementation of this prototype application in details. The application can utilize both GPU and multiple CPUs to accelerate its computation. We evaluated its performance and scalability with different hardware and parameter settings, including Intel Knights Landing, Intel Skylake, Nvidia K40 GPU, and Nvidia P100 GPU, for object recognition. To demonstrate its versatile, we show two practical use case examples: counting moving vehicles and identifying scenes including pedestrians and vehicles. We show the accuracy of the system by comparing vehicular counts produced by the analysis with manually annotated results. The comparison shows our methods can achieve over eighty percent accuracy comparing to manual results.", "venue": "2017 IEEE International Conference on Big Data (Big Data)", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2017-12-01", "journal": {"name": "2017 IEEE International Conference on Big Data (Big Data)", "pages": "1153-1162"}, "authors": [{"authorId": "2143626960", "name": "Lei Huang"}, {"authorId": "2783434", "name": "Weijia Xu"}, {"authorId": "2108637324", "name": "Si Liu"}, {"authorId": "35444489", "name": "Venktesh Pandey"}, {"authorId": "1405836287", "name": "Natalia Ruiz-Juri"}], "citations": [{"paperId": "69cacea49eca4be9783cbe4b5e64a32458ea72d1", "title": "Deep Learning for Video Application in Cooperative Vehicle-Infrastructure System: A Comprehensive Survey"}, {"paperId": "963a8ca7cce4261c5545e2815fb1dc8bfeffd431", "title": "Traffic Behavior Recognition from Traffic Videos under Occlusion Condition: A Kalman Filter Approach"}, {"paperId": "c98f6c0ea6efa1c93eb4bb1f5a694be1bcbaccd0", "title": "Moving vehicle detection and tracking at roundabouts using deep learning with trajectory union"}, {"paperId": "5e16f11f658aa683afb078bdd92d3c64e5784182", "title": "Recognition and Co-Analysis of Pedestrian Activities in Different Parts of Road using Traffic Camera Video"}, {"paperId": "5a55694aa7a7f439f3e100ab8119dc0b3a9bbee5", "title": "Smart Cities and Ethical Policies: The Challenges of Public Cameras and AI"}, {"paperId": "9607b80f12f4e930e1b8ce5229627efc225286f1", "title": "Detecting Pedestrian Crossing Events in Large Video Data from Traffic Monitoring Cameras"}, {"paperId": "b8a2690b755c74d165344cae39c3fcae6deee079", "title": "SIAT: A Distributed Video Analytics Framework for Intelligent Video Surveillance"}, {"paperId": "c7d2251961c33d95de9483f5b761da03ef16eaff", "title": "Automated pedestrian safety analysis using data from traffic monitoring cameras"}, {"paperId": "ee0099f3484b43fb2d0840dcdcb579e3d7c37a9d", "title": "Video Processing using Deep learning Techniques: A Systematic Literature Review"}, {"paperId": "f0ef7d15ced8ef16002651808b8fb037be1e0f27", "title": "Deep Learning Methods to Leverage Traffic Monitoring Cameras for Pedestrian Data Applications"}, {"paperId": "f294029bd8742437130e10c7cb875e9271352358", "title": "Video Analytics for Vision Zero Task 2017-07 FINAL REPORT"}]}
