{"paperId": "927109699896587bb0dc39dcd265d99d69eba442", "publicationVenue": {"id": "d2e8d0bf-7826-466b-ad3a-2235a606c74a", "name": "Ingeniería y Competitividad", "type": "journal", "alternate_names": ["Ing Compet"], "issn": "0123-3033", "alternate_issns": ["2027-8284"], "url": "http://www.scielo.org.co/scielo.php?lng=en&pid=0123-3033&script=sci_serial"}, "title": "Risks and security solutions existing in the Internet of things (IoT) in relation to Big Data", "abstract": "The technological advance of the new era has led to the interconnection of devices, applications, people and data, giving way to the generation of the Internet of Things (IoT). The multiple data collected is so voluminous and variable that it must be stored in Big Data architectures. This evolution has provided the opportunity to have better access, quality and analysis of information, but at the same time, there is a challenge to prevent and mitigate the security risks associated with the relationship between IoT and Big Data, endangering the information collected and the user’ sensitive data, among others. The purpose of this document is to carry out a literature review to collect the security risks found between the relationship of Big Data and IoT, as well as evaluate the current solutions implemented and conclude if they cover the needs for prevention and mitigation of the risk.", "venue": "Ingeniería y Competitividad", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2020-09-28", "journal": {"name": "INGENIERÍA Y COMPETITIVIDAD"}, "authors": [{"authorId": "2126458382", "name": "Yigliana Alvarez Mendoza"}, {"authorId": "2126458573", "name": "Tania J. Londoño Gomez"}, {"authorId": "2126441195", "name": "Miguel Angel Leguizamón Páez"}], "citations": [{"paperId": "b7f9a382e9bf3d7f83d4fd4b470c3f2ebebaf72a", "title": "A Novel IoT Trust Model Leveraging Fully Distributed Behavioral Fingerprinting and Secure Delegation"}, {"paperId": "1b4f35063d2d1a66ed2c4ce7e5e47718c7f07ea9", "title": "Enhancement of Big Data Security in Cloud Computing Using RSA Algorithm"}, {"paperId": "0cb1408a191e23da467e7d46a7a99a2c86bcc439", "title": "An Overview on Emerging Security Threats in Big Data Clusters and their Defenses"}, {"paperId": "01c54916e1362c7dc67ea4380435863425d8cf73", "title": "Do desire, anxiety and personal innovativeness impact the adoption of IoT devices?"}, {"paperId": "5e867416618d01ee823dd3ed1f20045c1c957cae", "title": "Information Security Monitoring and Management Method Based on Big Data in the Internet of Things Environment"}, {"paperId": "40612d5f49e1785f97eb7e6c3618aa324e292a9e", "title": "Theory and application of artificial intelligence in financial industry"}, {"paperId": "c0c33e8b4614d6dee355c451de145a14a27042a7", "title": "EFFICIENT IOT-BASED CLOUD COMPUTING FRAMEWORK FOR SECURE DATA STORAGE USING MACHINE LEARNING ALGORITHM"}]}
