{"paperId": "9272e4fc1bd92e7ebcbafeea8dbb5d31bcf4bcd4", "publicationVenue": {"id": "6a06ac59-cbd4-49c9-8d1f-4b1faa88080e", "name": "IJCI. International Journal of Computers and Information", "type": "journal", "alternate_names": ["IJCI Int J Comput Inf"], "issn": "1687-7853"}, "title": "Detecting the Behaviour of COVID-19 Based On Parallel Approach of Sequential Rule Mining Algorithm", "abstract": "The COVID-19 (Coronavirus) is a catastrophic disease, as it causes a global health crisis. Due to the nature of COVID-19, it spreads quickly among humans and infects millions of people within a few periods in the world. It is critical to detect the behaviour of COVID-19 and the speed of its mutating rapidly for better improvement of medications and assists patients in preventing the progression of the disease. This paper examines the discovery of additional information and interest patterns in COVID-19 genome sequences. An enhanced non-redundant sequential rule algorithm is mined from frequent closed dynamic bit vector and sequential generator patterns simultaneously. It speedily discovers nucleotide rules and predicts the next one after eliminating un-candidates' sequential patterns early. Almost all genotyping tests are partial, time-consuming, and involve multi-step processes. So, an efficient parallel approach is implemented by utilizing multicore processor architecture to produce the sequential rules in less time required. The experimental results show that; the proposed Parallel Non-Redundant Dynamic closed generator (PNRD-CloGen) algorithm performs well in terms of execution time, computational cost, and scalability. It has better performance, especially for large datasets and low minimum support values, as it takes around half the time as the competing algorithm. So, it helps to monitor the strain progression of COVID-19 sequentially and enhance clinical management.", "venue": "IJCI. International Journal of Computers and Information", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-11-04", "journal": {"name": "IJCI. International Journal of Computers and Information"}, "authors": [{"authorId": "2004355870", "name": "Nesma Youssef"}, {"authorId": "2074777935", "name": "Hatem Abdulkader"}, {"authorId": "46387298", "name": "A. Abdelwahab"}], "citations": []}
