{"paperId": "927a1e97d4314cfad45866b40058115d2afd116a", "publicationVenue": null, "title": "13 Design and Run-time aspects of Secure Cyber Physical Systems", "abstract": ": Cyber Physical Systems (CPS) combine computational and physical components enabling real world interaction. Digitization, decentralization and high connectivity as well as incorporation of various enabling technologies raise various security issues. These security concerns may affect safety, endangering assets and even human lives. This is especially true for CPS utilization in different sectors of great significance, including manufacturing or critical infrastructures, creating a need for efficiently handling relevant security issues. Including security as part of a software intensive technical system (i.e the CPS) that can be distributed and highly resilient highlights the need for appropriate security methodologies to be applied on the CPS from the engineering stage during CPS design. The efficient security related processes that are implemented at design time, have an impact on security monitoring during the CPS operational phase (at run time). Efficient and accurate security monitoring that follows security-by-design principles can be a potent tool in the hands of the CPS manager for detecting and mitigating cyber threats. Monitoring traffic and activity at the system boundaries, detecting changes to device status and configuration, detecting suspicious activity indicating attacks, detecting unauthorized activity that is suspicious or violates security policies, timely responding to security incidents and recovering from them, are issues that need to be efficiently tackled with by security monitoring. In the present chapter, we are exploring the various CPS cybersecurity threats and discus how adding security as a parameter at the CPS design phase can provide a well-structured and efficient approach on providing strong security CPS foundations. New technologies on CPS security Design are presented and emerging security directions are discussed. Furthermore, in the chapter, the different aspects of security monitoring are presented with a special emphasis on CPSs, discussing the various existing monitoring approaches that are followed in order to detect security issues at run time. Specific use-cases of CPSs in the manufacturing domain and with reference to critical infrastructures are also detailed and", "venue": "", "year": 2019, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "1744641", "name": "A. Fournaris"}, {"authorId": "2652308", "name": "A. Komninos"}, {"authorId": "46599973", "name": "Aris S. Lalos"}, {"authorId": "2281565", "name": "A. Kalogeras"}, {"authorId": "31528219", "name": "C. Koulamas"}, {"authorId": "1757088", "name": "D. Serpanos"}, {"authorId": "2078663743", "name": "Apostolos P. Fournaris0F"}, {"authorId": "2288835150", "name": "Andreas Komninos1"}, {"authorId": "2288831168", "name": "Aris Lalos1"}, {"authorId": "2288833996", "name": "Athanasios P. Kalogeras1"}, {"authorId": "2288829427", "name": "Christos Koulamas1"}, {"authorId": "2288835167", "name": "Dimitrios Serpanos1"}], "citations": []}
