{"paperId": "92819901221ac8eb4927978ba1ade3e971276992", "publicationVenue": null, "title": "Lightweight fog based solution for privacy-preserving in IoT using blockchain", "abstract": "Internet of things (IoT) mainly depends on clouds to process and store their data. Clouds cannot handle the volume and velocity of data generated by IoT. IoT is delay-sensitive and resources limited. Fog computing proposed endorsing the internet of things (IoT) demands. Fog computing extends the cloud computing service to the edge of the network. Fog utilization reduces response time and network overhead while maintaining security aspects. isolation and operating system (OS) dependency achieved by using virtualization. Blockchain proposed to solve the security and privacy of fog computing. Blockchain is a decentralized, immutable ledger. fog computing with blockchain proposed as an IoT infrastructure. Fog computing adopted with lightweight blockchain in this proposed work. This adaptation endorses the IoT demands for low response time with limited resources. This paper explores system applicability. Varies from other papers that focus on one factor such as privacy or security—applicability of the proposed model achieved by concentration different IoT needs and limits. Response time and ram usage with 1000 transactions did not encroach 100s and 300MiB in the proposed model.", "venue": "2020 International Congress on Human-Computer Interaction, Optimization and Robotic Applications (HORA)", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2020-06-01", "journal": {"name": "2020 International Congress on Human-Computer Interaction, Optimization and Robotic Applications (HORA)", "pages": "1-10"}, "authors": [{"authorId": "1854376750", "name": "Ali Haleem Alkhazaali"}, {"authorId": "1768519434", "name": "Oğuz Ata"}], "citations": [{"paperId": "f8fa528a380fb4864f039a6bbca4393f9b14352a", "title": "Blockchain consensus mechanisms comparison in fog computing: A systematic review"}, {"paperId": "89f142abcc3c99f0f8a288fb84429b3666ced368", "title": "Ensemble Machine Learning Based Blockchain Model for Privacy Preserving of Medical data in Fog Computing"}, {"paperId": "77654ff2fb3ed4ab90966580d224f92520994755", "title": "Blockchain-Fog Computing Integration Applications: A Systematic Review"}, {"paperId": "0c9b7128e5024e14f22e80e2529c71bd0db4dcf9", "title": "Lightweight blockchain solutions: Taxonomy, research progress, and comprehensive review"}, {"paperId": "7111296c81ca7824c4652cded145dc9a8836d62e", "title": "A systematic review of the purposes of Blockchain and fog computing integration: classification and open issues"}, {"paperId": "b37a26601da130115ddf101574b7d1e72b57253f", "title": "Analysis of the Consensus Protocols used in Blockchain Networks – An overview"}, {"paperId": "4210329ba11a49c5b781ddd89e004c584345e59d", "title": "Delegated Proof of Accessibility (DPoAC): A Novel Consensus Protocol for Blockchain Systems"}, {"paperId": "f34c81b571d4bfaa1d61c42fb55d9e7278e463c9", "title": "A blockchain security scheme to support fog-based internet of things"}, {"paperId": "5516aef888bcd583171553b7946b28403cd63649", "title": "Smart Fog-Based Video Surveillance with Privacy Preservation based on Blockchain"}, {"paperId": "dcee98a1278bc8c5a0650aac57ce21958d2aadf0", "title": "Privacy challenges of IoT-based blockchain: a systematic review"}, {"paperId": "4be907dbde12c286f5ae85d16cfaf7afb7a9bdf4", "title": "A Systematic Literature Review of Lightweight Blockchain for IoT"}, {"paperId": "76f379922e710743d52b59c9c501618e29c85387", "title": "MBCP: Performance Analysis of Large Scale Mainstream Blockchain Consensus Protocols"}]}
