{"paperId": "9283b8c7e6ad6ae86be059a26595de0d7a427a10", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Talk like a Graph: Encoding Graphs for Large Language Models", "abstract": "Graphs are a powerful tool for representing and analyzing complex relationships in real-world applications such as social networks, recommender systems, and computational finance. Reasoning on graphs is essential for drawing inferences about the relationships between entities in a complex system, and to identify hidden patterns and trends. Despite the remarkable progress in automated reasoning with natural text, reasoning on graphs with large language models (LLMs) remains an understudied problem. In this work, we perform the first comprehensive study of encoding graph-structured data as text for consumption by LLMs. We show that LLM performance on graph reasoning tasks varies on three fundamental levels: (1) the graph encoding method, (2) the nature of the graph task itself, and (3) interestingly, the very structure of the graph considered. These novel results provide valuable insight on strategies for encoding graphs as text. Using these insights we illustrate how the correct choice of encoders can boost performance on graph reasoning tasks inside LLMs by 4.8% to 61.8%, depending on the task.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-10-06", "journal": {"name": "ArXiv", "volume": "abs/2310.04560"}, "authors": [{"authorId": "3422551", "name": "Bahare Fatemi"}, {"authorId": "101461191", "name": "Jonathan Halcrow"}, {"authorId": "2271808", "name": "Bryan Perozzi"}], "citations": [{"paperId": "feca496290013a250adb2c72ecd20c8d5fd30f24", "title": "OpenGraph: Towards Open Graph Foundation Models"}, {"paperId": "a78d39d6599a86a8d927fd2f564b48475d63ab15", "title": "GraphWiz: An Instruction-Following Language Model for Graph Problems"}, {"paperId": "7ef730e97d3fffd7603fc008431b4c35e06fea8f", "title": "HiGPT: Heterogeneous Graph Language Model"}, {"paperId": "efa27ad1f502c66afb0cad0fe4ec5339f192de67", "title": "Microstructures and Accuracy of Graph Recall by Large Language Models"}, {"paperId": "e785b33b3367015db69657f37f98402f27a198df", "title": "Towards Versatile Graph Learning Approach: from the Perspective of Large Language Models"}, {"paperId": "0fa9b8a28cf379360ad56b7c778ce7ffc43bea5e", "title": "LLaGA: Large Language and Graph Assistant"}, {"paperId": "a41d4a3b005c8ec4f821e6ee96672d930ca9596c", "title": "G-Retriever: Retrieval-Augmented Generation for Textual Graph Understanding and Question Answering"}, {"paperId": "19c29bd4888a9a376842ce8b5f862a10ade19a25", "title": "Let Your Graph Do the Talking: Encoding Structured Data for LLMs"}, {"paperId": "8679575a82d9a2ba5970a96fcc5ac461aecbc90e", "title": "Graph-enhanced Large Language Models in Asynchronous Plan Reasoning"}, {"paperId": "7c9fb2be8b091e89e7edefe6e3f999fc896e1bae", "title": "Rendering Graphs for Graph Reasoning in Multimodal Large Language Models"}, {"paperId": "286031d281da2bbecd4621c45db0aa94b228e62f", "title": "Graph Foundation Models"}, {"paperId": "eff9d7ed06f30f121d30ee13802a11f172ef66f4", "title": "Demystifying Chains, Trees, and Graphs of Thoughts"}, {"paperId": "1308ffbeea4f6cfc9d01c32ce14b77f23438174d", "title": "New Kids on the Block: On the impact of information retrieval on contextual resource integration patterns"}, {"paperId": "67239d6e9c2c5f8a6d19cb35154e5aa7eaa00f51", "title": "Large Language Models on Graphs: A Comprehensive Survey"}, {"paperId": "9ad4911a7923e19df9fb36cd03de5a63cb86ba63", "title": "Graph Prompt Learning: A Comprehensive Survey and Beyond"}, {"paperId": "54630cd92c0c6696a422c3b2aa986c1f75df70b3", "title": "A Survey of Graph Meets Large Language Model: Progress and Future Directions"}, {"paperId": "55f2ca0ef62b74b5343b096f6c769d3ba220458f", "title": "Cost-Efficient Prompt Engineering for Unsupervised Entity Resolution"}]}
