{"paperId": "9299c65c51760e94115b3587836f88b8a00ae4df", "publicationVenue": null, "title": "Optimization of PBFT Algorithm Based on Improved C4.5", "abstract": "Aiming at the problems of PBFT algorithm of consortium blockchain, such as high communication overhead, low consensus efficiency, and random selection of leader nodes, an optimized algorithm of PBFT is proposed. Firstly, the algorithm improves C4.5 and introduces weighted average information gain to overcome the mutual influence between conditional attributes and improve the classification accuracy. Then classify the nodes with improved C4.5, and select the ones with a high trust level to form the main consensus group. Finally, the integral voting mechanism is introduced to determine the leader node. Experimental results show that compared with traditional PBFT algorithm, the communication times of the improved PBFT algorithm are reduced greatly, which effectively alleviates the problem that the number of nodes in traditional PBFT  algorithm increases and the traffic volume is too large, and significantly reduces the probability of the leader node doing evil and improves the consensus efficiency.", "venue": "", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-03-03", "journal": {"name": "Mathematical Problems in Engineering", "pages": "1-7", "volume": "2021"}, "authors": [{"authorId": "2152198880", "name": "Xiandong Zheng"}, {"authorId": "2422665", "name": "W. Feng"}, {"authorId": "145612373", "name": "Mengxing Huang"}, {"authorId": "3073247", "name": "Siling Feng"}], "citations": [{"paperId": "ee9b760ca4d221fa7c90f30e6f9f34464cde7c24", "title": "CG-PBFT: an efficient PBFT algorithm based on credit grouping"}, {"paperId": "8f36eda5a7fbc298b746864c6d4be3304498cf43", "title": "Multimaster Node Byzantine Fault-Tolerant Consensus Algorithm Based on Consistent Hash Algorithm"}, {"paperId": "f5e03f32709bd31e8cdf7ea0890f9068ccce7b14", "title": "Simulation Of Optimized Cluster Based PBFT Blockchain Validation Process"}, {"paperId": "ac6e25c835dfcc14175e22fc6e1890066e0b8ea5", "title": "Anti-Counterfeiting and Traceability Consensus Algorithm Based on Weightage to Contributors in a Food Supply Chain of Industry 4.0"}, {"paperId": "3d97d90ab7e7df893ec615989fb44884e1303f87", "title": "PBFT consensus optimization algorithm based on group reputation"}, {"paperId": "eab1d781feff1d7dcabc4c70d4d3974a73ffce2c", "title": "Rural regional economic data management based on blockchain technology"}, {"paperId": "229e6ccee57741ca99f479c961f3db407f7ab396", "title": "Blockchain-based reliable image copyright protection"}, {"paperId": "ba87959300ce8a2a1ecde87aaf91358f29086a37", "title": "A New Double-Layer Decentralized Consistency Algorithm for the Multi-Satellite Autonomous Mission Allocation Based on a Block-Chain"}, {"paperId": "c54a217dc025319684b0f3d50164b28f4d3ef4e9", "title": "Improved Method of Blockchain Cross-Chain Consensus Algorithm Based on Weighted PBFT"}, {"paperId": "6e8669b52f1aafe325382611f4bb1b91bdf30f85", "title": "Improvement of Delegated Proof of Stake Consensus Mechanism Based on Vague Set and Node Impact Factor"}, {"paperId": "d42cc5b7528ad6edb44b9a958fb20918cdf0d0d7", "title": "Environmental Quality Optimization of Sustainable Rural Revitalization Strategy Based on Improved Genetic Algorithm"}, {"paperId": "ce057d3a041878528a861877757346f3e8a2e35f", "title": "Intelligent Campus Resource Sharing System Based on Data Fusion Sensor"}, {"paperId": "8a7914dfdda4f76f0a2c8231ea95242e8a3dce0e", "title": "STEB: A secure service trading ecosystem based on blockchain"}, {"paperId": "1f6de1db5ddd7fdc71f822a3bab2026a2216a3c2", "title": "A High Performance Blockchain PGPBFT Consensus Algorithm in Integrated Circuit Protection Applications"}, {"paperId": "31d4fe3d24a1f95cb539e773afbe1d359438251c", "title": "A Novel Semifragile Consensus Algorithm Based on Credit Space for Consortium Blockchain"}, {"paperId": "7cc231d29da4e156b5c8297fa1dcd991d13037f9", "title": "SG-PBFT: A secure and highly efficient distributed blockchain PBFT consensus algorithm for intelligent Internet of vehicles"}, {"paperId": "1cbd0f3b5929f48b77545661d0632114f0b7f6a9", "title": "Research on Resource Carbon Emission Allocation Efficiency Based on Blockchain Consensus Algorithm"}, {"paperId": "fe8699e1a4c559a11d601e573936d577d3f59eb6", "title": "Improve PBFT Based on Hash Ring"}, {"paperId": "aa76912b26fd053ddccf04f29d175c99d9bbe27b", "title": "Improved PBFT Consensus Algorithm Based on Node Role Division"}, {"paperId": "7005498f95b79b920cb159f29c730ec259722863", "title": "Financial risk analysis system and supervision based on big data and blockchain technology"}, {"paperId": "09072ce5f2eab1ef9dada8e0e94d09c2db427b98", "title": "Improved PBFT Algorithm Based on K-Means Clustering for Emergency Scenario Swarm Robotic Systems"}, {"paperId": "14032d98a8eda78d6209bda9f117d1b01dcb791a", "title": "Improved Fault-Tolerant Consensus Based on the PBFT Algorithm"}, {"paperId": "f2b2421c028bf878bcd55098af3bfd7359b6fe64", "title": "OPTIMIZED PRACTICAL BYZANTINE FAULT TOLERANCE (O-PBFT) ALGORITHM USING GROUPING METHOD FOR CONSORTIUM BLOCKCHAIN"}]}
