{"paperId": "92a2fcb701aefd066de721168f81840f07f5aa71", "publicationVenue": {"id": "b189dec0-41d0-4cea-a906-7c5186895904", "name": "Global Communications Conference", "type": "conference", "alternate_names": ["GLOBECOM", "Glob Commun Conf"], "url": "http://www.ieee-globecom.org/"}, "title": "Vehicle Mobility-Based Geographical Migration of Fog Resource for Satellite-Enabled Smart Cities", "abstract": "The diverse applications and high-quality services in satellite-enabled smart cities have led to geographical unbalance of computation requirements. Traditional centralized cloud services and massive migration of computing tasks result in the increase of network delay and the aggravation of network congestion. Deploying fog nodes at the network edge has become a way to improve the quality of service (QoS). However, the dynamic requirements and application in various scenarios still challenge the network, resulting in geographical unbalance of computing resource demands. Nowadays, computing resources of on-board computers and devices in the Internet of Vehicles (IoV) are abundant enough to mitigate the geographical unbalances in computing power demand. Efficient usage of the natural mobility of constantly moving vehicles to solve the problems above remains an urgent need. In this paper, vehicle mobility-based geographical migration model of vehicular computing resource is established for satellite-enabled smart cities. By using the road- status-awareness of fog nodes, the status of roads is precisely quantified as the basis for vehicle mobility- based resource migration. An incentive scheme that affects the vehicle path selection through resource pricing is proposed to balance the resource requirements and to geographically allocate computing resources. Simulation results indicate that the advantages and efficiency of the proposed scheme are significant.", "venue": "Global Communications Conference", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2018-12-01", "journal": {"name": "2018 IEEE Global Communications Conference (GLOBECOM)", "pages": "1-6"}, "authors": [{"authorId": "5901589", "name": "Siyi Liao"}, {"authorId": "1714082", "name": "M. Dong"}, {"authorId": "144705313", "name": "K. Ota"}, {"authorId": "2146665894", "name": "Jun Wu"}, {"authorId": "49298335", "name": "Jianhua Li"}, {"authorId": "2545296", "name": "Tianpeng Ye"}], "citations": [{"paperId": "0778f2f1a83eafdfe2bb85e6d7e85476eea781f9", "title": "Collaborative-Filtering Privacy-Preserving Vehicular Edge Computation Offloading in Green Smart Cities"}, {"paperId": "e0ec1e44f5801682ff98726a89b9dc36c444544f", "title": "Fog computing approaches in IoT-enabled smart cities"}, {"paperId": "a2396be8ac34081f93cf38da7964bcabb1f08439", "title": "Leveraging Fog Computing for Geographically Distributed Smart Cities"}, {"paperId": "ce34c5b94bc4d1389accf33be6f6cf7f2722ab3d", "title": "A Dynamic Predictive VM Resource Scaling Strategy in Satellite-Ground Computing Networks"}, {"paperId": "a5078b5a4296d921113d01045254e222e07989c1", "title": "A Dynamic Service Reconfiguration Method for Satellite-Terrestrial Integrated Networks"}, {"paperId": "b3acfe37d61deb9d8b933f71d285a979f80578f5", "title": "Research on hybrid network Communication scheme of high and low orbit satellites for power application"}, {"paperId": "befe585e679c7fdf2f9df84b87fcbdc289bb14b2", "title": "Fog Computing Approaches in Smart Cities: A State-of-the-Art Review"}, {"paperId": "4fc40b048cd97feec104e9af7ac1d7a3e43447d3", "title": "A Convex-based Computation Offloading Mechanism in Vehicular Edge Computing"}, {"paperId": "a14aa1cd8a7f7b4f4f8859a0a3115e21aff1ec46", "title": "Fog Computing for Smart Cities' Big Data Management and Analytics: A Review"}, {"paperId": "b7165b845afbcabcb24b15652f2b0c97d5262bdc", "title": "Space Edge Cloud Enabling Service Migration for On-Orbit Service"}, {"paperId": "91639af3634050725908ae5498eff56a1c247668", "title": "SCEH: Smart Customized E-Health Framework for Countryside Using Edge AI and Body Sensor Networks"}, {"paperId": "a86a41754107d5d65b10cf3487b03f44bb8c02d3", "title": "Energy Efficient Cooperative Edge Computing with Multi-Source Multi-Relay Devices"}, {"paperId": "43fa46668545447bd276e162748cef27329b4b40", "title": "Rank based mobility-aware scheduling in Fog computing"}]}
