{"paperId": "92a67f2cc881dfc0ddaf364424203ee1fc170a8e", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Robust Localization for Cognitive IoT via the Mobile Anchor Node Based on the Diameter-Varying Spiral Line", "abstract": "Research on IoT that merely aims at connecting and communicating is about to past. Thereafter, general objects should have the capability to learn, think, and understand both physical and social areas by themselves. Cognitive Internet of Things (CIoT) attempts to empower the current IoT with a “brain” for high-level intelligence, requiring networks to have the ability to bridge the physical and social worlds. This attempt means matching equipment and resources with people and their behavior. Therefore, accurate location information is crucial for equipment connecting to CIoT. This endeavor sets a higher requirement for the localization technology of wireless sensor networks in terms of accuracy, energy, and efficiency compared with that in the past. In this paper, we propose an efficient and accurate mobile anchor node assisted localization algorithm for WSNs based on diameter-varying spiral line (LDVSL), which broadcasts coordinates of the anchor node to assist localizing unknown sensor nodes. The proposed algorithm has two main innovations. First, we obtain the mobile anchor node position through a time and angle mechanism instead of GPS, given the unique characteristics of the diameter-varying spiral line. Second, the linear fitting method is adapted to select the key virtual node, which has the real maximum received signal strength indicator. Simulations indicate that the proposed LDVSL algorithm outperforms other similar algorithms in terms of average localization error and positionable node ratio. The simulations also show that the LDVSL is not affected by obstacles seriously and has good robustness. The LDVSL has a wide prospect of application in CIoT.", "venue": "IEEE Access", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "28487-28497", "volume": "7"}, "authors": [{"authorId": "2153689886", "name": "Xin Wang"}, {"authorId": "2637166", "name": "Z. Qian"}, {"authorId": "144867946", "name": "Xue Wang"}, {"authorId": "2119228727", "name": "Lan Huang"}], "citations": [{"paperId": "6c5d3343aa363fdb2afe017117683171ce853765", "title": "Cluster-Based JRPCA Algorithm for Wi-Fi Fingerprint Localization"}, {"paperId": "7dc1a672ef5d60277d2a44fba4140601962e6aae", "title": "A Joint-Norm Robust Principal Component Analysis Model for Fingerprint Indoor Localization"}, {"paperId": "1428d659acff686e7a00c2518ba81d3ebc98fa96", "title": "A Novel Single Anchor Localization Method for Wireless Sensors in 5G Satellite-Terrestrial Network"}, {"paperId": "8aa15a046dc3abff4fdafc8297e21e1cf1514be0", "title": "RETRACTED ARTICLE: Cooperative spectrum sensing in wireless sensor networks using forager bee’s intelligence"}, {"paperId": "d656f7f481e04e6aec50bc65c4f1c5ff32ae9ad5", "title": "TILoc: Improving the Robustness and Accuracy for Fingerprint-Based Indoor Localization"}, {"paperId": "3c5a7159b1c6b3742b044fdc5b68c5c18ddadde3", "title": "Localization in Ultra Narrow Band IoT Networks: Design Guidelines and Tradeoffs"}]}
