{"paperId": "92ae989af0eb8aa49a3459fc74574180d1fd4dff", "publicationVenue": {"id": "aa2288b7-f151-4e26-93a7-512c123c6754", "name": "Global Knowledge Memory and Communication", "alternate_names": ["Glob Knowl Mem Commun"], "issn": "2514-9342", "url": "http://www.emeraldgrouppublishing.com/products/journals/journals.htm?id=gkmc"}, "title": "iStage: a deep learning based framework to determine the stage of disaster management cycle from a social media message", "abstract": "\nPurpose\nThis study aims to propose iStage, i.e. an intelligent hybrid deep learning (DL)-based framework to determine the stage of the disaster to make the right decisions at the right time.\n\n\nDesign/methodology/approach\niStage acquires data from the Twitter platform and identifies the social media message as pre, during, post-disaster or irrelevant. To demonstrate the effectiveness of iStage, it is applied on cyclonic and COVID-19 disasters. The considered disaster data sets are cyclone Fani, cyclone Titli, cyclone Amphan, cyclone Nisarga and COVID-19.\n\n\nFindings\nThe experimental results demonstrate that the iStage outperforms Long Short-Term Memory Network and Convolutional Neural Network models. The proposed approach returns the best possible solution among existing research studies considering different evaluation metrics – accuracy, precision, recall, f-score, the area under receiver operating characteristic curve and the area under precision-recall curve.\n\n\nOriginality/value\niStage is built using the hybrid architecture of DL models. It is effective in decision-making. The research study helps coordinate disaster activities in a more targeted and timely manner.\n", "venue": "Global Knowledge Memory and Communication", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": null, "publicationDate": "2023-03-07", "journal": {"name": "Global Knowledge, Memory and Communication"}, "authors": [{"authorId": "66499416", "name": "A. Singla"}, {"authorId": "3287625", "name": "R. Agrawal"}], "citations": []}
