{"paperId": "92aefe0088ad1a3e90a7b6746010ab7d3ef764bd", "publicationVenue": {"id": "228761ec-c40a-479b-8309-9dcbe9851bcd", "name": "IEEE Internet of Things Journal", "type": "journal", "alternate_names": ["IEEE Internet Thing J"], "issn": "2327-4662", "url": "https://www.ieee.org/membership-catalog/productdetail/showProductDetailPage.html?product=PER288-ELE", "alternate_urls": ["https://ieeexplore.ieee.org/servlet/opac?punumber=6488907", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6488907", "http://ieee-iotj.org/#"]}, "title": "Social-Aware Decentralized Cooperative Caching for Internet of Vehicles", "abstract": "As the industry related to intelligent vehicles becomes increasingly mature, emerging in-vehicle applications and services are mushrooming. They have strict requirements on service response delay and network bandwidth. In the face of the dynamic environment in the Internet of Vehicles (IoV), how to design an adaptive edge caching strategy becomes a challenge. To cope with this challenge, some researchers have introduced optimization methods based on learning algorithms in cooperative caching. However, general learning algorithms tend to waste bandwidth and computing resources on repetitive task. To this end, we make full use of the idle resources in the road to build a cooperative caching system and propose a social-aware decentralized cooperative caching (SADC) for IoV. This strategy uses the federated learning framework to train the collaborative caching algorithm based on deep reinforcement learning (DRL). Among them, the road-side unit (RSU) is responsible for the training and updating of the global model, and vehicles use local data to provide local updates to the RSU, which then averages the updates provided by all vehicles to improve the shared model. In addition, we use the social network of vehicle users to obtain vehicle contact rates in different areas. The SADC strategy can reduce the content transmission latency and response time, thereby improving the experience quality of vehicle users. Compared with traditional caching strategies, this strategy reduces the average content access delay by about 20%. We also demonstrate the effectiveness of this strategy using an extensive set of experiments.", "venue": "IEEE Internet of Things Journal", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-15", "journal": {"name": "IEEE Internet of Things Journal", "pages": "14834-14845", "volume": "10"}, "authors": [{"authorId": "1701208", "name": "Honghai Wu"}, {"authorId": "2152196193", "name": "Yizheng Fan"}, {"authorId": "2214952669", "name": "Jichong Jin"}, {"authorId": "3174389", "name": "Huahong Ma"}, {"authorId": "2053892440", "name": "Ling Xing"}], "citations": []}
