{"paperId": "92d07465153ce96c2bf5b52d88374e485322d759", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Mobile Apps Meet the Smart Energy Grid: A Survey on Consumer Engagement and Machine Learning Applications", "abstract": "Consumers lie at the epicenter of smart grids, since their activities account for a large portion of the total energy demand. Therefore, utility companies, governmental agencies, and various other entities with environmental concerns aim at lowering and shaping energy consumption patterns to achieve peak load reduction, load smoothing, and hence carbon emission curtailment. In this survey paper, we present an overview of approaches for engaging smart grid consumers and for providing them with information, motivation, and recommendations for energy efficiency through mobile apps. Our focus is to bring machine learning approaches closer to smart grid mobile apps so as to optimally manage consumer flexibility and enhance energy savings through detailed consumer profiling and modeling, since an increasing amount of energy consumer data is becoming available. A novel survey and analysis of prior work in the area is conducted in order to identify gaps from this perspective. We consider both recent research project outputs and commercial products and we discuss various aspects of the designs, such as state-of-the-art technologies, extrinsic and intrinsic motivation techniques, gamification, consumer profiling, and the role of machine learning and recommender systems in this context. Furthermore, different mobile apps are presented and compared based on the most important features that affect consumer energy efficiency and sustainability, such as data visualization, gamification, flexibility, consumer profiling methods, feedback mechanisms, recommendations, social media, and machine learning integration. The main goal of this work is to identify how mobile apps incorporate these features to engage energy consumers in energy-efficient behavior, assess the current state-of-the-art in the area, and highlight future research directions.", "venue": "IEEE Access", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "219632-219655", "volume": "8"}, "authors": [{"authorId": "2038537910", "name": "Spiros Chadoulos"}, {"authorId": "1775763", "name": "I. Koutsopoulos"}, {"authorId": "1720651", "name": "George C. Polyzos"}], "citations": [{"paperId": "6eeeac160cb9ff288a02beee0cd46d7bd43e8499", "title": "Machine Learning Applications for Smart Building Energy Utilization: A Survey"}, {"paperId": "243efde00a0080173f159bff57c7e7172e7ef4a8", "title": "Machine Learning in Gamification and Gamification in Machine Learning: A Systematic Literature Mapping"}, {"paperId": "2692c8e4b541ed15b0e93ff38f91dffa8d07df92", "title": "Artificial Intelligence Applications and Prospects for The Smart Grid"}, {"paperId": "f9f8173210d9c6d74e9f0177d6e93032cce9f4e1", "title": "Deep4Ener: Energy Demand forecasting for Unseen Consumers with Scarce Data Using a Single Deep Learning Model"}, {"paperId": "042ada5a38d498c6e9b7e96997ad7871287a788d", "title": "Supply-Demand Matching Strategies for Smart Grid Congestion Management"}, {"paperId": "d7149e021ddc1398086688bd9b265705a6481f0b", "title": "Human Decision Making During Eco-feedback Intervention in Smart and Connected Energy-aware Communities"}, {"paperId": "cc5029798ecad9c533c2e76cbd9a18f68340cc23", "title": "Edge Intelligence in Smart Grids: A Survey on Architectures, Offloading Models, Cyber Security Measures, and Challenges"}, {"paperId": "913cf7a36dd2c0ed90dfbfe372a2bdcb3737b9be", "title": "MySmartE – An eco-feedback and gaming platform to promote energy conserving thermostat-adjustment behaviors in multi-unit residential buildings"}, {"paperId": "c607531fe8d2a08857cfd9aa0e3278e9295a7347", "title": "Energy demand and its temporal flexibility: Approaches, criticalities and ways forward"}, {"paperId": "94b804734a43551a9af4ac9edc13e1876559c803", "title": "The Issue of Proxies and Choice Architectures. Why EU Law Matters for Recommender Systems"}, {"paperId": "e78a66a3dd7027f2cd54d62fc84db556c615eb9d", "title": "Reliable Internet of Things: Challenges and Future Trends"}, {"paperId": "25b808dffc37f23184bd63b57c58fbc13eded0e5", "title": "One model fits all: Individualized household energy demand forecasting with a single deep learning model"}, {"paperId": "d70015cbfa98817dcc74f55cd88fc4b9dfc7e36e", "title": "Digital Twins for Smart Home Gadget Threat Prediction using Deep Convolution Neural Network"}]}
