{"paperId": "92e06fcd90873d67094a29101cb554b1f604f981", "publicationVenue": null, "title": "A Generic and Extensible Core and Prototype of Consistent, Distributed, and Resilient LIS", "abstract": "The majority of the existing land information systems (LIS) are centralized, transaction processing systems based on object-relational database management systems for data storage, management, and retrieval. These traditional database management systems are dominantly based on a share-everything or share disk architecture and face challenges in meeting the performance and scalability requirements of distributed, data-intensive systems, including LIS. They support vertical, rather than horizontal scalability, which is of particular importance in distributed systems. In some cases, due to legal, administrative, or infrastructure constraints, LIS need to be distributed rather than centralized systems. Distributed computing systems and share-nothing architecture have become very popular, including new data processing platforms and frameworks with horizontal scalability and fault tolerance capabilities. In this paper, we present cdrLIS—a generic and extensible core of LIS based on relevant international standards and the NewSQL database management system (DBMS) that enables the implementation of consistent, distributed, highly-available, and resilient LIS. A generic core is implemented in the Go programming language and can be easily extended and adopted towards the implementation of a specific country profile. cdrLIS can be deployed either on a computer cluster or on cloud computing platforms and thus support the design and building of a new generation of distributed and resilient data-intensive applications and information systems in the land administration domain.", "venue": "ISPRS Int. J. Geo Inf.", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-07-13", "journal": {"name": "ISPRS Int. J. Geo Inf.", "pages": "437", "volume": "9"}, "authors": [{"authorId": "2395318", "name": "Zdravko Galić"}, {"authorId": "1840416471", "name": "Mario Vuzem"}], "citations": [{"paperId": "7894ed0ee48fe622db08f10d6b10bb2a9e245380", "title": "Frontier Technologies for Securing Tenure"}]}
