{"paperId": "92e57d149c6fadad48a8bcbb7837172f4d94c0ba", "publicationVenue": null, "title": "Vehicular Edge Computing Meets Cache: An Access Control Scheme for Content Delivery", "abstract": "Vehicular Edge Computing (VEC) is an integration of Mobile Edge Computing with traditional vehicular networks, which aims to shift computing, communication, and storage resources to the edge of networks and is more close to vehicles. Due to the high mobility of vehicles, connection interruption and network changes may frequently occur. To tackle this issue, cache-based content delivery is regarded as a promising solution to achieve efficient data sharing in VEC. However, privacy-preserving access control and fair incentive distribution are rarely taken into account in prior VEC-oriented studies. In this paper, we propose an efficient and secure access control scheme for providing cache-based content delivery in VEC. Specifically, we construct two layer access control to enable flexible access control and fair incentive distribution with the assistance of edge nodes. Moreover, we construct a group signature-based scheme to achieve anonymous authentication and conditional revocation. The performance analysis shows that our secure scheme has an acceptable effect on network performance.", "venue": "ICC 2020 - 2020 IEEE International Conference on Communications (ICC)", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-06-01", "journal": {"name": "ICC 2020 - 2020 IEEE International Conference on Communications (ICC)", "pages": "1-6"}, "authors": [{"authorId": "2492138", "name": "Shunrong Jiang"}, {"authorId": "48211952", "name": "Jianqing Liu"}, {"authorId": "3176172", "name": "Longxia Huang"}, {"authorId": "3381104", "name": "Haiqin Wu"}, {"authorId": "2145492478", "name": "Yong Zhou"}], "citations": [{"paperId": "9967c6e98ddd21ef4f46d03b9b897e4da654a48d", "title": "AC-SDVN: An Access Control Protocol for Video Multicast in Software Defined Vehicular Networks"}, {"paperId": "f6905ddbf918814e90e004273867b89222cc53bb", "title": "Mobility-Aware Cooperative Caching in Vehicular Edge Computing Based on Asynchronous Federated and Deep Reinforcement Learning"}]}
