{"paperId": "92eef0e6db533a80874e5db37fdb7763fc9ba0f5", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "A Methodology for the Design and Engineering of Smart Product Service Systems: An Application in the Manufacturing Sector", "abstract": "The combination of servitization and digitalization is increasingly changing the economy and society at the global level towards sustainability goals. Companies are shifting their business models, typically oriented to selling products, towards providing bundles of products and services and integrating them with technologies enabling data collection and analysis, resulting in the so-called smart Product Service Systems (PSS). Different approaches and techniques have been put forth to design PSS and, more recently, smart PSS, but they continue to primarily concentrate on establishing value propositions and ignore the question of what sort of operational data can be gathered and used to deliver the PSS solution. Therefore, manufacturing companies willing to expand their portfolio with new advanced services nowadays still face multiple challenges. To address this gap, this study proposes the Service Engineering Methodology for the engineering of smart PSS (SEEM-Smart), which takes into account the trade-off between customer satisfaction and internal efficiency with a focus on data gathering and information flow. The methodology is then applied in a real-world setting. The case study shows the application of the SEEM-Smart for engineering a new data-driven service offering enabled by a cloud-based platform supporting the service provision.", "venue": "Sustainability", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-12-21", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "2187587167", "name": "Veronica Arioli"}, {"authorId": "2074684291", "name": "Giovanni Ruggeri"}, {"authorId": "2056998026", "name": "Roberto Sala"}, {"authorId": "2479720", "name": "F. Pirola"}, {"authorId": "2985562", "name": "G. Pezzotta"}], "citations": [{"paperId": "284a17ce595df1b9a049337f9585f895052d6779", "title": "An Exploratory Analysis of the Current Status and Potential of Service-Oriented and Data-Driven Business Models within the Sheet Metal Working Sector: Insights from Interview-Based Research in Small and Medium-Sized Enterprises"}, {"paperId": "7c2f9d8db2cd1cb4b72266995281bc630db17f71", "title": "A Literature Review on the Development and Creation of Digital Twins, Cyber-Physical Systems, and Product-Service Systems"}, {"paperId": "7191ac9fc9124d6e2d34b57837441ab3eafbabdc", "title": "Framework for the Strategic Adoption of Industry 4.0: A Focus on Intelligent Systems"}, {"paperId": "c0137210c42d026b2a2cdd3e477f21dba3ab3f9f", "title": "Research on the Impact of Digital Economy on Manufacturing Total Factor Productivity"}]}
