{"paperId": "92f3de601115a7419e79cb3af33a3c8d59392e62", "publicationVenue": {"id": "f32b7322-b69c-4e63-801d-8f50784ef778", "name": "Computational Intelligence and Neuroscience", "type": "journal", "alternate_names": ["Comput Intell Neurosci"], "issn": "1687-5265", "url": "https://www.hindawi.com/journals/cin/"}, "title": "A Research on the Realization Algorithm of Internet of Things Function for Smart Education", "abstract": "The traditional teaching mode is to use a point-to-point mode or a computer-aided system for teaching, but this limits students' enthusiasm and interest in learning. The Internet of Things (IoT) technology is a technology that integrates sensors, the Internet, and terminals to transmit information in real time. The smart education based on the Internet of Things can realize remote teaching and actual scene teaching, and students can freely choose the learning location and time, which can greatly improve students learning interest and learning efficiency, which is a development trend of a new teaching method. Smart IoT teaching is a teaching method that combines IoT technology and artificial intelligence technology. This paper mainly studies the research and analysis of the smart education model based on the IoT in remote teaching. In this paper, sensor technologies such as cameras will be used to collect students' expressions, speech, and other actions in class from different regions. These data features will be processed by the terminal's intelligent algorithm, and the desired knowledge will be obtained according to the students' behavior information. The information processed by the intelligent algorithm will be transmitted to the terminal system where the teacher is located, such as computer and mobile phone. This paper focuses on analyzing the reliability and accuracy of the intelligent algorithm of the IoT smart education terminal. The results show that the prediction error of the student behavior information is within 3% and the correlation coefficient reaches 0.99.", "venue": "Computational Intelligence and Neuroscience", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-04-29", "journal": {"name": "Computational Intelligence and Neuroscience", "volume": "2022"}, "authors": [{"authorId": "2163922939", "name": "Kuiliang Fu"}], "citations": [{"paperId": "aa533c5c098bb5b10a806e12ed8e13ea8c0acae5", "title": "Enriching Learning and Streamlining Efficiency: How Cloud IoT is Advancing Education"}, {"paperId": "09130af0ad3f3cd73b9be2df50cedfc885cf07b1", "title": "Retracted: A Research on the Realization Algorithm of Internet of Things Function for Smart Education"}, {"paperId": "56af523e7c9c2d07d2a2f9c2a98c493d4ca045cb", "title": "Remote Big Data Management Tools, Sensing and Computing Technologies, and Visual Perception and Environment Mapping Algorithms in the Internet of Robotic Things"}, {"paperId": "a279edc9ff0984464b56f15ce72d93423e2d514c", "title": "Survey for Smart and Adaptative Education"}]}
