{"paperId": "92f776ef44695f47014918bfd89e0efb7ea50ca4", "publicationVenue": {"id": "17c52c4d-2a56-4ef5-b23f-54d989ef66c6", "name": "ACM Transactions on Modeling and Performance Evaluation of Computing Systems", "alternate_names": ["ACM Trans Model Perform Evaluation Comput Syst"], "issn": "2376-3639", "url": "https://dl.acm.org/citation.cfm?id=J1525"}, "title": "Performance Health Index for Complex Cyber Infrastructures", "abstract": "Most IT systems depend on a set of configuration variables (CVs), expressed as a name/value pair that collectively defines the resource allocation for the system. While the ill effects of misconfiguration or improper resource allocation are well-known, there are no effective a priori metrics to quantify the impact of the configuration on the desired system attributes such as performance, availability, etc. In this paper, we propose a Configuration Health Index (CHI) framework specifically attuned to the performance attribute to capture the influence of CVs on the performance aspects of the system. We show how CHI, which is defined as a configuration scoring system, can take advantage of the domain knowledge and the available (but rather limited) performance data to produce important insights into the configuration settings. We compare the CHI with both well-advertised segmented non-linear models and state-of-the-art data-driven models, and show that the CHI not only consistently provides better results but also avoids the dangers of a pure data drive approach which may predict incorrect behavior or eliminate some essential configuration variables from consideration.", "venue": "ACM Transactions on Modeling and Performance Evaluation of Computing Systems", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-09-03", "journal": {"name": "ACM Transactions on Modeling and Performance Evaluation of Computing Systems", "pages": "1 - 32", "volume": "7"}, "authors": [{"authorId": "32219380", "name": "Sanjeev Sondur"}, {"authorId": "1716613", "name": "K. Kant"}], "citations": [{"paperId": "e43046131307b2f9d8e88301f49f5da20c293ac0", "title": "Secure Task Distribution With Verifiable Re-Encryption in Mobile-Crowdsensing-Assisted Emergency IoT System"}, {"paperId": "275375e4a265378000613cc304ca68efba74bcfe", "title": "Improving System Configurations Using Domain Knowledge Assisted Semi-Supervised Learning"}, {"paperId": "22d24cf93681e769a5a6a6e9af536df5df1f812e", "title": "Automated Configuration for Agile Software Environments"}]}
