{"paperId": "92feeab27e6a820075917ca8b74336e5f75718d5", "publicationVenue": {"id": "6e711cd9-3352-43d0-8dd7-635d69959f97", "name": "International Journal of Enterprise Information Systems", "type": "journal", "alternate_names": ["Int J Enterp Inf Syst"], "issn": "1548-1115", "url": "http://www.idea-group.com/journals/details.asp?id=4292", "alternate_urls": ["https://www.igi-global.com/journal/international-journal-enterprise-information-systems/1086"]}, "title": "Geographic Information System and Big Spatial Data: A Review and Challenges", "abstract": "Geographic information system (GIS) is designed to generate maps, manage spatial datasets, perform sophisticated “what if” spatial analyses, visualize multiple spatial datasets simultaneously, and solve location-based queries. The impact of big data is in every industry, including the GIS. The location-based big data also known as big spatial data has significant implications as it forces the industry to contemplate how to acquire and leverage spatial information. In this study, a comprehensive taxonomy is created to provide a better understanding of the uses of GIS and big spatial data. The taxonomy is made up of big data technologies, GIS data sources, tools, analytics, and applications. The authors look into the importance of big spatial data and its implications, review the data sources, and GIS analytics, applications, and GIS tools. Furthermore, in order to guide researchers interested in GIS, the challenges that require substantial research efforts are taken into account. Lastly, open issues in GIS that require further observation are summarized.", "venue": "International Journal of Enterprise Information Systems", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2020-10-01", "journal": {"name": "Int. J. Enterp. Inf. Syst.", "pages": "101-145", "volume": "16"}, "authors": [{"authorId": "8917234", "name": "Raja Sher Afgun Usmani"}, {"authorId": "145963904", "name": "I. A. T. Hashem"}, {"authorId": "36840081", "name": "T. Pillai"}, {"authorId": "27295514", "name": "Anum Saeed"}, {"authorId": "114227952", "name": "Akibu Mahmoud Abdullahi"}], "citations": [{"paperId": "8db22eb9307f86789e52bd980a3acd85a9df6759", "title": "A Systematic Review of Machine Learning Applications in Land Use Land Cover Change Detection using Remote Sensing"}, {"paperId": "ea5f039de471a53a98ee857ddb0696cbf3b25704", "title": "Perturb and optimize users’ location privacy using geo-indistinguishability and location semantics"}, {"paperId": "4ca928e311522876c1c0983bcde939d8af66b9d0", "title": "EBSS: A secure blockchain-based sharing scheme for real estate financial credentials"}, {"paperId": "2a365507e514c10f75a45aa029ff46e6b3021f6a", "title": "Implementation of Building Information Modelling for Road Rehabilitation and Reconstruction Project: Liquefaction Disaster of Palu Area"}, {"paperId": "039ce40b88ddcb1a6772c3fdb2e5055596b40f4e", "title": "The Role of UAS–GIS in Digital Era Governance. A Systematic Literature Review"}, {"paperId": "4a4776b9e44f9e49a90d1a4e4253bc92791d7312", "title": "Applying Low-Cost Air-Pollution Sensors’ Information to Explore PM2.5 Concentration With an Emphasis on Spatial and Temporal Analysis: A Case in Chiayi City"}, {"paperId": "50b357ee1630c2763f20b66df97f2e2363dc89bd", "title": "Building Resilient Future: Information Technology and Disaster Management- A Malaysian Perspective"}, {"paperId": "2332d1f066bebc4f968bc79d8e05adc86266895a", "title": "Role of ICT for Community in Education During COVID-19"}, {"paperId": "968facd5033d9226cc3e454a7c181c90277954f1", "title": "An Optimized Artificial Neural Network Model using Genetic Algorithm for Prediction of Traffic Emission Concentrations"}, {"paperId": "47227d1dcdb0e16aa8e1ed7cf23aa666b2acfff5", "title": "A Hybrid Model to Profile and Evaluate Soft Skills of Computing Graduates for Employment"}]}
