{"paperId": "931422e53d13c1fc2c67a27a1afe7a44cd921437", "publicationVenue": null, "title": "Upscaling Fog Computing in Oceans for Underwater Pervasive Data Science Using Low-Cost Micro-Clouds", "abstract": "Underwater environments are emerging as a new frontier for data science thanks to an increase in deployments of underwater sensor technology. Challenges in operating computing underwater combined with a lack of high-speed communication technology covering most aquatic areas means that there is a significant delay between the collection and analysis of data. This in turn limits the scale and complexity of the applications that can operate based on these data. In this article, we develop underwater fog computing support using low-cost micro-clouds and demonstrate how they can be used to deliver cost-effective support for data-heavy underwater applications. We develop a proof-of-concept micro-cloud prototype and use it to perform extensive benchmarks that evaluate the suitability of underwater micro-clouds for diverse underwater data science scenarios. We conduct rigorous tests in both controlled and field deployments, using river and sea waters. We also address technical challenges in enabling underwater fogs, evaluating the performance of different communication interfaces and demonstrating how accelerometers can be used to detect the likelihood of communication failures and determine which communication interface to use. Our work offers a cost-effective way to increase the scale and complexity of underwater data science applications, and demonstrates how off-the-shelf devices can be adopted for this purpose.", "venue": "ACM Trans. Internet Things", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-12-08", "journal": {"name": "ACM Transactions on Internet of Things", "pages": "1 - 29", "volume": "4"}, "authors": [{"authorId": "143766453", "name": "Farooq Dar"}, {"authorId": "37576887", "name": "M. Liyanage"}, {"authorId": "3040328", "name": "Marko Radeta"}, {"authorId": "2159272123", "name": "Zhigang Yin"}, {"authorId": "144477128", "name": "Agustin Zuniga"}, {"authorId": "2756005", "name": "Sokol Kosta"}, {"authorId": "1759241", "name": "Sasu Tarkoma"}, {"authorId": "2583077", "name": "Petteri Nurmi"}, {"authorId": "2533364", "name": "Huber Flores"}], "citations": [{"paperId": "1d8ecc8d6ff0032d66c8b847e285f7671e32ca26", "title": "Ocean warming events resilience capability in underwater computing platforms"}, {"paperId": "103f712343f1d785131850699e4de46589ba8ee6", "title": "An Underwater Network for Mini-Submarine Underwater Observatory"}, {"paperId": "3f7260752cc551ef5d11d73dfb863fdb6d77918e", "title": "Lost in the Deep?"}]}
