{"paperId": "931dc63d4fe0f23ec280634d512e8a4ac23e3076", "publicationVenue": {"id": "228761ec-c40a-479b-8309-9dcbe9851bcd", "name": "IEEE Internet of Things Journal", "type": "journal", "alternate_names": ["IEEE Internet Thing J"], "issn": "2327-4662", "url": "https://www.ieee.org/membership-catalog/productdetail/showProductDetailPage.html?product=PER288-ELE", "alternate_urls": ["https://ieeexplore.ieee.org/servlet/opac?punumber=6488907", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6488907", "http://ieee-iotj.org/#"]}, "title": "Contrastive Learning Over Random Fourier Features for IoT Network Intrusion Detection", "abstract": "IoT networks connect dispersed and heterogeneous devices with high economic impact, making them an important cybersecurity target. The changing nature of cybersecurity attacks requires intrusion detectors with the ability to detect new attacks. Our proposed model is a network intrusion detector created specifically for the needs of IoT networks with the aim of detecting previously unseen attacks. It is based on a shallow neural network (NN) architecture following a novel contrastive learning scheme. In this scheme, both the network features and the labels are projected into a common representation (embedding) space where a similarity score is defined. The labels act as a prototype for each type of traffic in embedding space, and classification is based on the proximity of samples to these class prototypes. The dimensionality and structure of the embedding space are critical. In this work, we explore the advantages of having an embedding space with expanded dimensionality using a kernel approximation technique (Random Fourier Features) that is integrated and learned within the NN. To avoid overfitting, we investigate the importance of various regularization techniques (L2 and contractive). The resulting model is tested against three network intrusion detection data sets to assess its ability to detect known and unknown attacks (zero-shot learning). The experimental results show a higher ability of the proposed model to detect unknown attacks than similar models and alternative machine learning models, in the literature.", "venue": "IEEE Internet of Things Journal", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-15", "journal": {"name": "IEEE Internet of Things Journal", "pages": "8505-8513", "volume": "10"}, "authors": [{"authorId": "1410357594", "name": "Manuel Lopez-Martin"}, {"authorId": "1402965549", "name": "Antonio J. Sánchez-Esguevillas"}, {"authorId": "2086920428", "name": "J. I. Arribas"}, {"authorId": "2367163", "name": "B. Carro"}], "citations": [{"paperId": "3a83336cfc68eb68a9cb90c85d247ac36428df1e", "title": "AOC-IDS: Autonomous Online Framework with Contrastive Learning for Intrusion Detection"}, {"paperId": "7cb30866357d211eb72ce3322f62d22143a8c09b", "title": "An Effective Method for Detecting Unknown Types of Attacks Based on Log-Cosh Variational Autoencoder"}, {"paperId": "73b6aa1d9a4915738dd3e1ac18ccf1f83b99a866", "title": "Malicious Encrypted Network Traffic Detection Using Deep Auto-Encoder with a Custom Reconstruction Loss"}, {"paperId": "a0e4a3dc5d269ad8afcb38fdcfc1b87c478cdcb0", "title": "Overview on Intrusion Detection Systems Design Exploiting Machine Learning for Networking Cybersecurity"}]}
