{"paperId": "931e380c55daca21a4ef61a950012da40436e45b", "publicationVenue": {"id": "23f24704-1359-4644-be68-ab8e1f36ad92", "name": "Computer Assisted Language Learning", "type": "journal", "alternate_names": ["Comput Assist Lang Learn"], "issn": "0958-8221", "url": "http://www.tandfonline.com/loi/ncal20"}, "title": "Uncovering university students’ device usage patterns in a Korean online learning context using learning analytics", "abstract": "Abstract The present study investigates South Korean university students’ personal computer (PC) and smartphone usage patterns on an online Test of English for International Communication (TOEIC) website using learning analytics. A total of 107 students taking a College TOEIC course participated during one academic semester and records of their online behaviors were analyzed. The results revealed that nearly 30% of the participants used only one device to access the website. Around 70% of the participants used both devices and about 71% of them favored smartphones over PCs. For task types, students preferred a particular device to its counterpart: (a) when watching videos, more students chose smartphones than PCs; (b) when completing homework, they also preferred smartphones to PCs; (c) however, PCs were chosen more often for test-taking practice. Smartphone users were quite active during the daytime and their usage sharply increased between 9:00 pm and 11:00 pm, whereas PC users were usually active between 9:00 pm and 11:00 pm. Students most often visited the website on Mondays and Sundays. Students’ choices in device type did not have an influence on their learning gains. Implications offer practical information on online teaching and pre-service teacher training as well as online material development.", "venue": "Computer Assisted Language Learning", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-04-06", "journal": {"name": "Computer Assisted Language Learning", "pages": "2563 - 2592", "volume": "35"}, "authors": [{"authorId": "5336152", "name": "M. Ko"}], "citations": [{"paperId": "0ecd3ca9381d284bd8cd41a8cb3d0e51bb0bfd9d", "title": "Early warning mechanism of interactive learning process based on temporal memory enhancement model"}, {"paperId": "cb678b4bc31730e328e4792b49ba3de5ff4e444c", "title": "When industry meets Education 4.0: What do Computer Science companies need from Higher Education?"}, {"paperId": "ed21ae0e70bcb3a05e153894618d7cbb3bc638d6", "title": "Automated writing evaluation (AWE) feedback: a systematic investigation of college students’ acceptance"}]}
