{"paperId": "93296c2592f0c754dcc49d7001a99f0d18e8fa74", "publicationVenue": {"id": "1731ace8-70f6-4064-8538-13662f667669", "name": "Multidisciplinary Journal for Education, Social and Technological Sciences", "type": "journal", "alternate_names": ["Multidiscip J Educ Soc Technol Sci"], "issn": "2341-2593", "url": "https://dialnet.unirioja.es/servlet/revista?codigo=23830", "alternate_urls": ["https://polipapers.upv.es/index.php/MUSE/index"]}, "title": "Adoption of E-Learning at Higher Education Institutions: A Systematic Literature Review", "abstract": "The concept of e-learning offers a number of benefits, however, the effective adoption of e-learning systems at HEIs is a relatively new concept and thus a challenging task. The comprehensive review of extant literature on the topic of adoption of e-learning systems at HEIs is provided. Using PRISMA search technique, relevant articles published from 2005 to 2020 owing to the widespread adoption of e-learning since 2005 were selected. The paper identifies and puts forward the level of compatibility and readiness of students and teachers in adopting e-learning, factors that motivate and hinder the adoption of e-learning respectively, benefits of adopting an e-learning system, and the strategies for the effective implementation of e-learning at the higher education institutions. In this realm of COVID-19 and e-learning, this paper also envisage different strategies, policies and recommendations for implementing e-learning in an effective way at HEIs.", "venue": "Multidisciplinary Journal for Education, Social and Technological Sciences", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review"], "publicationDate": "2021-10-06", "journal": {"name": "Multidisciplinary Journal for Education, Social and Technological Sciences"}, "authors": [{"authorId": "2132964839", "name": "Rushna Khalil Awan"}, {"authorId": "12499486", "name": "G. Afshan"}, {"authorId": "2014731", "name": "A. Memon"}], "citations": [{"paperId": "8d36e700a54a48d739d0e2c8187b950cb49a5f9a", "title": "Digital transformation in higher education: A comprehensive review of e-learning adoption"}, {"paperId": "831617ca67c4cf53225396a84b8c20c13970b4b3", "title": "A Systematic Analysis of New Approaches to Digital Economic Education Based on the Use of AI Technologies"}, {"paperId": "5daf98ed6bd49c4063cc0a226ab79f6a2e06a344", "title": "Analysis of the optimization of resources with Learning Analytics techniques"}, {"paperId": "5748fb7cbfbe5421d226811240e146bfaa72df0e", "title": "The Use of E-learning During COVID-19 Pandemic Era"}, {"paperId": "6b6418ede06ee9b81d8601ab9a121e869a367a94", "title": "Exploratory analysis of an e-learning course based on micro-videos to improve the preparation of the undergraduate dissertation in Spanish context"}, {"paperId": "179795009ee17cfc8afb5dbd72bffbd92e93f0a3", "title": "Technodiversity—An E-Learning Tool as an Additional Offer for the Master’s Degree and In-Company Training"}, {"paperId": "b1e52792a5b0ea80196329976549fb018c43d8ba", "title": "The Significance of Adopting E-Learning in Institutions of Higher Learning during the COVID-19 Pandemic and Beyond"}, {"paperId": "6d57e7df9ed26c64993038dd2d7d5aa3ea16ba06", "title": "The perception of engineering students and instructors in a Saudi University toward E‐learning"}, {"paperId": "0b845211f8361b91f3b3836caa30f3e127c3f464", "title": "Doctoral Education in Ukraine: the Application of Digital Tools and Services by Doctoral Students under COVID-19 Pandemic"}, {"paperId": "99811bcce981627dadc3b8a46215af98c492107f", "title": "Technical university students’ feedback on studying English online under the COVID-19"}, {"paperId": "21c50ae88e8237b815f40074956274e81ea91c9c", "title": "A reflective e-learning approach for reading, thinking, and behavioral engagement"}]}
