{"paperId": "9333a312a5d47b922a76b72bb0cf21e60ebe4307", "publicationVenue": null, "title": "Role of Big Data in Agriculture", "abstract": "Big Data analytics in the agricultural sector has huge potential to cater to requirements of food production. This review highlights the role of Big Data in pertinent data acquisition from factors affecting the agriculture such as weather, soil, diseases, remote sensing and the prospects of agricultural data analysis towards smart farming. Incorporating modern technologies in farming practices continuously monitor the environment, thus producing large quantity of data. Hence there arises the need for advanced practical and systematic strategies to correlate the different factors driving the agriculture to derive valuable information out of it. Big Data can be a promising aspect for the future of food production and sustainability of agriculture. Leveraging big data in the agricultural sector can provide insights in farming practices, helps in making real-time decisions and motivates in incorporating new methods of farming operations. The main objective of this paper is to provide insights into different factors that contribute to making timely recommendations to farmers with regard to smart agricultural techniques.", "venue": "International Journal of Innovative Technology and Exploring Engineering", "year": 2019, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2019-12-10", "journal": {"name": "International Journal of Innovative Technology and Exploring Engineering"}, "authors": [], "citations": [{"paperId": "ac83de7a349e574093f27ef64efa80dedb6dd72a", "title": "Harnessing the Power of Big Data: Revolutionizing Agriculture"}, {"paperId": "4d1e8d007288823d2fdca8caae152330e8f56ed4", "title": "APPLICATION OF BIG DATA TECHNOLOGIES TO ASSESS THE NATURAL MOISTURE OF THE TERRITORY"}, {"paperId": "a076bfe0b67f13925e037e20231ae12c0b631ba7", "title": "FORMATION OF INFORMATION SUPPORT SYSTEM FOR THE MANAGEMENT OF AGRICULTURAL ENTERPRISES"}, {"paperId": "8946e0130a112aa162edb22eaaea86e2715d52f2", "title": "A Statistical Analysis Model of Big Data for Precise Poverty Alleviation Based on Multisource Data Fusion"}, {"paperId": "ac29310f933dc216e88cb352f5fba92a3aefbda4", "title": "A review on the methods for big data analysis in agriculture"}]}
