{"paperId": "93399eb3eefca171db3d055e7d4b650a96e6592a", "publicationVenue": null, "title": "Klink: Progress-Aware Scheduling for Streaming Data Systems", "abstract": "Modern stream processing engines (SPEs) process large volumes of events propagated at high velocity through multiple queries. To improve performance, existing SPEs generally aim to minimize query output latency by minimizing, in turn, the propagation delay of events in query pipelines. However, for queries containing commonly used blocking operators such as windows, this scheduling approach can be inefficient. Watermarks are events popularly utilized by SPEs to correctly process window operators. Watermarks are injected into the stream to signify that no events preceding their timestamp should be further expected. Through the design and development of Klink, we leverage these watermarks to robustly infer stream progress based on window deadlines and network delay, and to schedule query pipeline execution that reflects stream progress. Klink aims to unblock window operators and to rapidly propagate events to output operators while performing judicious memory management. We integrate Klink into the popular open source SPE Apache Flink and demonstrate that Klink delivers significant performance gains over existing scheduling policies on benchmark workloads for both scale-up and scale-out deployments.", "venue": "SIGMOD Conference", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2021-06-09", "journal": {"name": "Proceedings of the 2021 International Conference on Management of Data"}, "authors": [{"authorId": "49738882", "name": "Omar Farhat"}, {"authorId": "2176381", "name": "Khuzaima S. Daudjee"}, {"authorId": "1775963", "name": "Leonardo Querzoni"}], "citations": [{"paperId": "651f977c463bb135b1661690de5815e0c9df4cef", "title": "PaVM: A Parallel Virtual Machine for Smart Contract Execution and Validation"}, {"paperId": "5f2836eeb933b1ea3bc133ac993d8d7d8527cdc6", "title": "Proactive Resource Management to Optimize Distributed Workflow Executions"}, {"paperId": "d52ba3b8b67bb05a9fdb1def113a8d7a75546b10", "title": "ContTune: Continuous Tuning by Conservative Bayesian Optimization for Distributed Stream Data Processing Systems"}, {"paperId": "79c180ef5d3e00a7c9b2dc4a7d398f5242e70465", "title": "BottleMod: Modeling Data Flows and Tasks for Fast Bottleneck Analysis"}, {"paperId": "2a6baff0ce9f752f43691687cfdcff5cf6eb048f", "title": "Runtime Adaptation of Data Stream Processing Systems: The State of the Art"}, {"paperId": "21da1ee785c91c832f68a9f18e4d7eda41c1cbd6", "title": "A Survey on the Evolution of Stream Processing Systems"}, {"paperId": "a6a7e3a8290348b967eb4f39fc51351f847989ed", "title": "An Experimental Analysis of Quantile Sketches over Data Streams"}]}
