{"paperId": "93447f90e45ac1fdc729c4f9c0a2dd52ae84b188", "publicationVenue": {"id": "abcfade0-4cdd-4b9f-bac3-fa13022b0a51", "name": "International Workshop on Ant Colony Optimization and Swarm Intelligence", "type": "conference", "alternate_names": ["Ant Algorithm", "Ant Algorithms", "Int Workshop Ant Colony Optim Swarm Intell", "IEEE Int Conf Adv Netw Telecommun Syst", "Algorithmic Number Theory Symp", "Ant Colony Optimization and Swarm Intelligence", "Int Conf Adv Netw Telecommuncations Syst", "ANTS", "Ant Colony Optim Swarm Intell", "Algorithmic Number Theory Symposium", "International Conference on Advanced Networks and Telecommuncations Systems", "IEEE International Conference on Advanced Networks and Telecommunications Systems"], "url": "http://www.wikicfp.com/cfp/program?id=184", "alternate_urls": ["http://iridia.ulb.ac.be/~ants/", "http://www.wikicfp.com/cfp/program?id=182"]}, "title": "Energy Efficient Workflow Scheduling Algorithm for Latency-Sensitive Applications using Cloud-Fog Collaboration", "abstract": "The objectives of most studies are aimed at employing fog computing (FC) as an effective support to cloud computing (CC) in order to monitor sensor data and their associated necessities via the rapid advancements in Internet of Things (IoT). FC is completely dedicated to IoT sensor systems and delivers CC based computing, networking, and storage services. The cloud-Fog Collaboration (CFC) Environment will be more suitable for real-time IoT data sensing and workflow applications where fast and reliable internet connectivity is available. Workflow Scheduling means efficiently assigning the interdependent tasks to available computing resources. The workflow scheduling techniques play a significant role in minimizing the latency in Heterogeneous Computing systems (HCS). In this paper, we present a novel Hybrid-metaheuristics Multi-objective based Workflow Scheduling Algorithm (HMWSA) by combining Harmony Search (HS) and Genetic Algorithm (GA) for optimizing workflow scheduling in heterogeneous CFC. The proposed minimization objective function takes into account goals like makespan, energy usage, and cost. To preserve the precedence relationship among tasks, a topologically sorted execution sequence is constructed. Extensive testing results show that our proposed approach yields substantially better cost-makespan trade-offs while significantly reducing energy consumption than other existing algorithms.", "venue": "International Workshop on Ant Colony Optimization and Swarm Intelligence", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-12-17", "journal": {"name": "2023 IEEE International Conference on Advanced Networks and Telecommunications Systems (ANTS)", "pages": "252-257"}, "authors": [{"authorId": "2269684859", "name": "Prashant Shukla"}, {"authorId": "2269736597", "name": "Sudhakar Pandey"}], "citations": []}
