{"paperId": "934cc80bd8c41ceedeacc58e47267a5508572323", "publicationVenue": {"id": "83b61ff8-462d-4e1d-b43b-5d96fcc87766", "name": "IEEE Transactions on Network Science and Engineering", "type": "journal", "alternate_names": ["IEEE Trans Netw Sci Eng"], "issn": "2327-4697", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=6488902"}, "title": "On System Stability in Multitier Roadside Computing Toward an Intelligent Transportation", "abstract": "Owing to the heterogeneity and massiveness of data generated by connected vehicles, multitier roadside computing (MRC) plays a key role in an intelligent transportation system (ITS). MRC provides a localized cloudization capability in close proximity to the connected vehicles. Because the massive data correspondingly necessitate a high computing energy consumption, stable workload processing with respect to energy efficiency is a crucial problem of MRC. To address this problem, we propose an energy-efficient workload (E2W) scheduling algorithm for flexibly handling the random offloading traffic from connected vehicles. In our E2W algorithm, an MRC is transformed into a multitier queuing system, where the workload arrived from the vehicles and the computing capability of the roadside units are considered to be arrival and departure processes, respectively. The departure rate that closely impinges on the computing energy consumption is supervised using the Lyapunov drift-plus-penalty policy to achieve efficient energy reduction while maintaining service satisfaction. In addition, the deterministic upper bound of the Lyapunov optimization provides the MRC system with stable operation. Simulation results demonstrate that the E2W algorithm outperforms existing optimization strategies in terms of energy efficiency and system stability.", "venue": "IEEE Transactions on Network Science and Engineering", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-05-01", "journal": {"name": "IEEE Transactions on Network Science and Engineering", "pages": "1128-1138", "volume": "9"}, "authors": [{"authorId": "38118110", "name": "Nhu-Ngoc Dao"}, {"authorId": "40989740", "name": "Duc-Nghia Vu"}, {"authorId": "1557396390", "name": "Anh-Tien Tran"}, {"authorId": "2144677942", "name": "Trung V. Phan"}, {"authorId": "1691109", "name": "S. Dustdar"}, {"authorId": "51453730", "name": "Sungrae Cho"}], "citations": []}
