{"paperId": "936b38a98cd38ff468b5624abef157f8617e8a4e", "publicationVenue": {"id": "4bd3e650-c3ff-43c3-99dd-282feeb24693", "name": "Reviews in the Neurosciences", "type": "journal", "alternate_names": ["Reviews in The Neurosciences", "Rev Neurosci"], "issn": "0334-1763", "url": "https://www.degruyter.com/view/j/revneuro"}, "title": "A review of neuroimaging-based data-driven approach for Alzheimer’s disease heterogeneity analysis", "abstract": "Abstract Alzheimer’s disease (AD) is a complex form of dementia and due to its high phenotypic variability, its diagnosis and monitoring can be quite challenging. Biomarkers play a crucial role in AD diagnosis and monitoring, but interpreting these biomarkers can be problematic due to their spatial and temporal heterogeneity. Therefore, researchers are increasingly turning to imaging-based biomarkers that employ data-driven computational approaches to examine the heterogeneity of AD. In this comprehensive review article, we aim to provide health professionals with a comprehensive view of past applications of data-driven computational approaches in studying AD heterogeneity and planning future research directions. We first define and offer basic insights into different categories of heterogeneity analysis, including spatial heterogeneity, temporal heterogeneity, and spatial-temporal heterogeneity. Then, we scrutinize 22 articles relating to spatial heterogeneity, 14 articles relating to temporal heterogeneity, and five articles relating to spatial-temporal heterogeneity, highlighting the strengths and limitations of these strategies. Furthermore, we discuss the importance of understanding spatial heterogeneity in AD subtypes and their clinical manifestations, biomarkers for abnormal orderings and AD stages, the recent advancements in spatial-temporal heterogeneity analysis for AD, and the emerging role of omics data integration in advancing personalized diagnosis and treatment for AD patients. By emphasizing the significance of understanding AD heterogeneity, we hope to stimulate further research in this field to facilitate the development of personalized interventions for AD patients.", "venue": "Reviews in the Neurosciences", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2023-07-10", "journal": {"name": "Reviews in the Neurosciences", "volume": "0"}, "authors": [{"authorId": "2177923146", "name": "Lingyu Liu"}, {"authorId": "2107175154", "name": "Shen Sun"}, {"authorId": "2147131951", "name": "Wenjie Kang"}, {"authorId": "1867355", "name": "Shuicai Wu"}, {"authorId": "144625424", "name": "Lan Lin"}], "citations": [{"paperId": "5845152960d82ff813af47c223b107ae88f37c2f", "title": "Elucidating Multimodal Imaging Patterns in Accelerated Brain Aging: Heterogeneity through a Discriminant Analysis Approach Using the UK Biobank Dataset"}, {"paperId": "4a796c7e76c8d892e57f644da985e0803be369f4", "title": "Exploring Successful Cognitive Aging: Insights Regarding Brain Structure, Function, and Demographics"}]}
