{"paperId": "937139e568f5d7806193ad0ee5c79b028a484e07", "publicationVenue": {"id": "6074c5b3-c475-4bf4-8d8d-50600ad06d20", "name": "Earth Science Informatics", "type": "journal", "alternate_names": ["Earth Sci Informatics"], "issn": "1865-0473", "url": "https://link.springer.com/journal/12145"}, "title": "Landslide identification using machine learning techniques: Review, motivation, and future prospects", "abstract": null, "venue": "Earth Science Informatics", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-11-03", "journal": {"name": "Earth Science Informatics", "pages": "2063 - 2090", "volume": "15"}, "authors": [{"authorId": "2289607647", "name": "Sreelakshmi S."}, {"authorId": "1574497258", "name": "V. S. S."}, {"authorId": "101622285", "name": "E. Shaji"}], "citations": [{"paperId": "b72f4f29290adff48fa85610e3417d20c3df8b74", "title": "Integrating Machine Learning Ensembles for Landslide Susceptibility Mapping in Northern Pakistan"}, {"paperId": "3cbfefac860181efd347d577dd5673147fb82a65", "title": "A novel deep learning framework for landslide susceptibility assessment using improved deep belief networks with the intelligent optimization algorithm"}, {"paperId": "7b4df59af2dd2f35947395812d6dd48225778743", "title": "Pixel-based classification method for earthquake-induced landslide mapping using remotely sensed imagery, geospatial data and temporal change information"}, {"paperId": "019e7f568046f30cada8c0f2f2c96a65214bd442", "title": "A landslide monitoring method using data from unmanned aerial vehicle and terrestrial laser scanning with insufficient and inaccurate ground control points"}, {"paperId": "0e7a9c2596d6420cb0d33e7c2462dd4f6eae9657", "title": "Landslide susceptibility analysis in the Bhilangana Basin (India) using GIS-based machine learning methods"}, {"paperId": "c87634af8f56eb81e5e2d71568694b554d7693d6", "title": "Advancements, Challenges, and Future Directions in Rainfall-Induced Landslide Prediction: A Comprehensive Review"}, {"paperId": "4a78fa1be80e9a06cfa645c3c5d313139ef449dc", "title": "Automatic identification of active landslides over wide areas from time-series InSAR measurements using Faster RCNN"}, {"paperId": "08a8b2868e04b9c9c432e4c7a9df6b1653bec444", "title": "Transforming ground disaster response: Recent technological advances, challenges, and future trends for rapid and accurate real-world applications of survivor detection"}, {"paperId": "20c369a131c438d9700d368471b0bead7a9aa826", "title": "Indicative Effect of Excess Topography on Potential Risk Location of Giant Ancient Landslides—A Case Study in Lengqu River Section"}, {"paperId": "98b8157e7850d511c40a2f2dbe56f41ecd51bfab", "title": "Identification of Landslides From Remote Sensing Satellite Imagery Using YOLOv7"}, {"paperId": "128d2dfd1de4d20b5c0387d022773c07f06dc0be", "title": "Editorial: Rock landslide risk assessment, stability analysis and monitoring for the development of early warning systems and reinforcement measures"}, {"paperId": "75d6d821e554c240bcf8a79b754f66b1824f21ac", "title": "Machine-learning based landslide susceptibility modelling with emphasis on uncertainty analysis"}, {"paperId": "c6526d2abf77e5f73d7821bdde9fbe3eff38d05a", "title": "Landslide Forecast in Taiwan Based on Machine Learning in the Landslide Forecast in Taiwan Based on Machine Learning in the GIS field GIS field"}]}
