{"paperId": "9371f4f2c43211c5df3a0b7a291f65996851a150", "publicationVenue": {"id": "4a7ec53f-818f-47e7-ae80-f753d236f8d1", "name": "Applied Biosciences", "alternate_names": ["Appl Biosci"], "issn": "2545-2215", "alternate_issns": ["2813-0464"], "url": "http://appbiosciences.org/index.php/Applied"}, "title": "An Event-Driven Architecture for Genomics-Based Diagnostic Data Processing", "abstract": "Genomics-based diagnostic data (GBDD) are becoming increasingly important for laboratory diagnostics. Due to the large quantity of data and their heterogeneity, GBDD poses a big data challenge. Current analysis tools for GBDD are primarily designed for research and do not meet the requirements of laboratory diagnostics for automation, reliability, transparency, reproducibility, robustness, and accessibility. This makes it difficult for laboratories to use these tools in tests that need to be validated according to regulatory frameworks and to execute tests in a time- and cost-efficient manner. In order to better address these requirements, we propose an event-driven workflow-based architecture as the basis for a processing platform that is highly scalable using container technologies and microservices. A prototype implementation of this approach, called GenomicInsights, has been developed and evaluated to demonstrate its feasibility and suitability for laboratory diagnostics.", "venue": "Applied Biosciences", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-02", "journal": {"name": "Applied Biosciences"}, "authors": [{"authorId": "48548479", "name": "Thomas Krause"}, {"authorId": "2219523039", "name": "Mike Zickfeld"}, {"authorId": "2098809838", "name": "Sebastian Bruchhaus"}, {"authorId": "148234271", "name": "Thoralf Reis"}, {"authorId": "3405635", "name": "M. X. Bornschlegl"}, {"authorId": "2118285", "name": "P. Buono"}, {"authorId": "2150261613", "name": "Michael Kramer"}, {"authorId": "147817750", "name": "Paul Mc Kevitt"}, {"authorId": "1799848", "name": "M. Hemmje"}], "citations": [{"paperId": "90ec62473dea5641fc78ecfd07e3870114d9cc21", "title": "Towards Improving Clinical Practice Guidelines Through Named Entity Recognition: Model Development and Evaluation"}]}
