{"paperId": "938ff51b43f95921c6071bf7f85ccb358da23951", "publicationVenue": null, "title": "End-to-end Optimization of Machine Learning Prediction Queries", "abstract": "Prediction queries are widely used across industries to perform advanced analytics and draw insights from data. They include a data processing part (e.g., for joining, filtering, cleaning, featurizing the datasets) and a machine learning (ML) part invoking one or more trained models to perform predictions. These parts have so far been optimized in isolation, leaving significant opportunities for optimization unexplored. We present Raven, a production-ready system for optimizing prediction queries. Raven follows the enterprise architectural trend of collocating data and ML runtimes. It relies on a unified intermediate representation that captures both data and ML operators in a single graph structure to unlock two families of optimizations. First, it employs logical optimizations that pass information between the data part (and the properties of the underlying data) and the ML part to optimize each other. Second, it introduces logical-to-physical transformations that allow operators to be executed on different run-times (relational, ML, and DNN) and hardware (CPU, GPU). Novel data-driven optimizations determine the runtime to be used for each part of the query to achieve optimal performance. Our evaluation shows that Raven is able to improve performance of prediction queries on Apache Spark and SQL Server by up to 13.1x and 330x, respectively. Finally, for complex models where GPU acceleration is beneficial, Raven provides up to 8× speedup compared to state-of-the-art systems.", "venue": "SIGMOD Conference", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2022-05-31", "journal": {"name": "Proceedings of the 2022 International Conference on Management of Data"}, "authors": [{"authorId": "2116811298", "name": "Kwanghyun Park"}, {"authorId": "35064289", "name": "Karla Saur"}, {"authorId": "150963621", "name": "Dalitso Banda"}, {"authorId": "3133317", "name": "Rathijit Sen"}, {"authorId": "2192580", "name": "Matteo Interlandi"}, {"authorId": "2687553", "name": "Konstantinos Karanasos"}], "citations": [{"paperId": "75a783109a95eaaf996a2ca9ddd9d9293196dece", "title": "Towards Unified Data Ingestion and Transfer for the Computing Continuum"}, {"paperId": "6e1c9dd92d74bf6f44924b0a153f46b99f4fc344", "title": "GFS: Graph-based Feature Synthesis for Prediction over Relational Databases"}, {"paperId": "5b886ab54f5283096da0c42c48ec2befdf288dbe", "title": "Low-Latency ML Inference by Grouping Correlated Data Objects and Computation"}, {"paperId": "a72c5ff8bb28397049dfd49831d3208ed94fe4c2", "title": "Architecting Intermediate Layers for Efficient Composition of Data Management and Machine Learning Systems"}, {"paperId": "546f3a2c905116d6f9f15ed9b6fbab84c36dd47d", "title": "A Comparison of End-to-End Decision Forest Inference Pipelines"}, {"paperId": "41c5e8eeafde70bdfc51aef5ea4a3e66b7572ccc", "title": "Serving Deep Learning Model in Relational Databases"}, {"paperId": "ecb4dff5160be86c97f27d9be1c0b74472af127b", "title": "Sniffer: A Novel Model Type Detection System against Machine-Learning-as-a-Service Platforms"}, {"paperId": "c2338fe39fc8bac80914520022b6354c6cd0feb1", "title": "Future-Time Temporal Path Queries"}, {"paperId": "2926d28109772a00b4b7eba099746e1997c20daf", "title": "P2D: A Transpiler Framework for Optimizing Data Science Pipelines"}, {"paperId": "255f28a73d9e5e93a4b87e04d5de4fca2fd70567", "title": "EVA: An End-to-End Exploratory Video Analytics System"}, {"paperId": "6ae19fb6eae020951aeccbed884e04f3824bf518", "title": "Accelerating Machine Learning Queries with Linear Algebra Query Processing"}, {"paperId": "fba5b4a7f1f9e1cfb2c3922b08b33bf58959aadf", "title": "Automating and Optimizing Data-Centric What-If Analyses on Native Machine Learning Pipelines"}, {"paperId": "5a594238ddeea258b00fa5c4d85051d42f2554b9", "title": "Auto-Differentiation of Relational Computations for Very Large Scale Machine Learning"}, {"paperId": "6b26641d12fd99bd3a32aa2fe610a1fc00ce9ae9", "title": "Kitana: Efficient Data Augmentation Search for AutoML"}, {"paperId": "a2b993c36c238ac3d33cd1e5269c0eb2acac5224", "title": "Pushing ML Predictions Into DBMSs"}, {"paperId": "cb685d6bcb50e7d59d24bdcc9fd82a12943cdd57", "title": "Implementation Roadmap for Neural Networks in Array Databases"}, {"paperId": "127b7ef160f82226cc1020cc0f2e34080bc33ed4", "title": "The Tensor Data Platform: Towards an AI-centric Database System"}, {"paperId": "f0c4c922fb7c7be75d8147de950a1ee00bf5286d", "title": "Share the Tensor Tea: How Databases can Leverage the Machine Learning Ecosystem"}, {"paperId": "6c8c4503e3f50848d35deaf080ae4086dd4f60c1", "title": "Containerized Execution of UDFs: An Experimental Evaluation"}, {"paperId": "300823792f3854a857c452259455fe4b162c3104", "title": "Query Processing on Tensor Computation Runtimes"}, {"paperId": "8e51f65e05dca6a74576ae896ca39eeea2264bad", "title": "Exploration of Approaches for In-Database ML"}, {"paperId": "d67b7d43e04cda818bdcae7a28b342c41c860339", "title": "Post-Moore's Law Fusion: High-Bandwidth Memory, Accelerators, and Native Half-Precision Processing for CPU-Local Analytics"}, {"paperId": "b388f4defbd159f237a0dcd67089ef01c67b5930", "title": "Integrating Deep Learning Frameworks into Main-Memory Databases"}, {"paperId": "d191b22dccaf9d639ae9dd06a345d21ebf4fd0ed", "title": "This paper is included in the Proceedings of the 20th USENIX Symposium on Networked Systems Design and Implementation."}]}
