{"paperId": "9390f48427f7ac752ecb48a6f6233cace363c124", "publicationVenue": {"id": "629a1bf8-92eb-4398-9ee1-58bb04e3365a", "name": "Journal of Manufacturing Technology Management", "type": "journal", "alternate_names": ["J Manuf Technol Manag"], "issn": "1741-038X", "url": "https://www.emerald.com/insight/publication/issn/1741-038X"}, "title": "Data-based decision-making in maintenance service delivery: the D3M framework", "abstract": "PurposeThis paper aims to present a dual-perspective framework for maintenance service delivery that should be used by manufacturing companies to structure and manage their maintenance service delivery process, using aggregated historical and real-time data to improve operational decision-making. The framework, built for continuous improvement, allows the exploitation of maintenance data to improve the knowledge of service processes and machines.Design/methodology/approachThe Dual-perspective, data-based decision-making process for maintenance delivery (D3M) framework development and test followed a qualitative approach based on literature reviews and semi-structured interviews. The pool of companies interviewed was expanded from the development to the test stage to increase its applicability and present additional perspectives.FindingsThe interviews confirmed that manufacturing companies are interested in exploiting the data generated in the use phase to improve operational decision-making in maintenance service delivery. Feedback to improve the framework methods and tools was collected, as well as suggestions for the introduction of new ones according to the companies' necessities.Originality/valueThe paper presents a novel framework addressing the data-based decision-making process for maintenance service delivery. The D3M framework can be used by manufacturing companies to structure their maintenance service delivery process and improve their knowledge of machines and service processes.", "venue": "Journal of Manufacturing Technology Management", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2021-04-29", "journal": {"name": "Journal of Manufacturing Technology Management", "pages": "122-141", "volume": "32"}, "authors": [{"authorId": "2056998026", "name": "Roberto Sala"}, {"authorId": "143773482", "name": "M. Bertoni"}, {"authorId": "2479720", "name": "F. Pirola"}, {"authorId": "2985562", "name": "G. Pezzotta"}], "citations": [{"paperId": "181a971239459600c17dcdc73f3a67dcadbce055", "title": "Simulation-based Hyperheuristic Approach for the Operative Service Delivery Planning in the Context of Product-service Systems"}, {"paperId": "94ee5c78054e8f2484315ab3f071335647c05389", "title": "Modeling and Simulation for the Operative Service Delivery Planning in the Context of Product-Service Systems"}, {"paperId": "f94d7eda1439fa38d9b0244a13124733385e1874", "title": "Improvement of maintenance-based Product-Service System offering through field data: a case study"}, {"paperId": "e41a3595df8d368584dd508250d3fe5a12aef4d8", "title": "A Synergistic Operation And Maintenance Service Method Of Complex Products Based On Knowledge Graph"}, {"paperId": "c91c1b0888a5c2797c339e5f48bf72cf2c26d39c", "title": "A dynamic multi-layer maintenance service network evolution and decision-making method for service-oriented complex equipment"}, {"paperId": "8acc1fcc2e54ed85c905c71c2e52db71a59e80ae", "title": "A deep attention based approach for predictive maintenance applications in IoT scenarios"}, {"paperId": "6ea98a8c6b027aa49794899893e7370e965521ab", "title": "Assessment on The Maintenance Service Delivery Characteristics (MSDCs): Case Study of The Public Schools in Perak, Malaysia"}, {"paperId": "8c81b9933a2855d75393d0169b1c5ba97a14f531", "title": "Data-Driven Decision Making in Maintenance Service Delivery Process: A Case Study"}, {"paperId": "27e55c09af41acd362b1307bbf6b8cf30fa629f1", "title": "Circular production and maintenance of automotive parts: An Internet of Things (IoT) data framework and practice review"}, {"paperId": "ad49aebe82bcb7114eb1001be4abc0f17fd4d928", "title": "A personalised operation and maintenance approach for complex products based on equipment portrait of product-service system"}, {"paperId": "b027a73742b51e6ede689dece1101a48f28b6dad", "title": "Norm-based data labelling in supervised learning for fault detection and diagnostics of rotating elements towards maintenance servitisation"}, {"paperId": "c8d2d7fb3817214b8cec654c6fb4230a7f9755f2", "title": "Improving Maintenance Service Delivery Through Data and Skill-Based Task Allocation"}]}
