{"paperId": "93943611771184657883f8689670f021579836a1", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Efficient Proximity Computation Techniques Using ZIP Code Data for Smart Cities †", "abstract": "In this paper, we are interested in computing ZIP code proximity from two perspectives, proximity between two ZIP codes (Ad-Hoc) and neighborhood proximity (Top-K). Such a computation can be used for ZIP code-based target marketing as one of the smart city applications. A naïve approach to this computation is the usage of the distance between ZIP codes. We redefine a distance metric combining the centroid distance with the intersecting road network between ZIP codes by using a weighted sum method. Furthermore, we prove that the results of our combined approach conform to the characteristics of distance measurement. We have proposed a general and heuristic approach for computing Ad-Hoc proximity, while for computing Top-K proximity, we have proposed a general approach only. Our experimental results indicate that our approaches are verifiable and effective in reducing the execution time and search space.", "venue": "Italian National Conference on Sensors", "year": 2018, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-03-24", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "18"}, "authors": [{"authorId": "2095621260", "name": "M. H. Murdani"}, {"authorId": "1756023", "name": "Joonho Kwon"}, {"authorId": "2111228072", "name": "Yoon-Ho Choi"}, {"authorId": "24302099", "name": "B. Hong"}], "citations": [{"paperId": "50b193c407a899bb1af4eb554b4fb0f2d7f85937", "title": "Effective Maps, Easily Done: Visualizing Geo-Psychological Differences Using Distance Weights"}, {"paperId": "06fd560f87bb8c8c696708036c9024757fe44b0a", "title": "Are Regional Differences in Psychological Characteristics and Their Correlates Robust? Applying Spatial-Analysis Techniques to Examine Regional Variation in Personality"}]}
