{"paperId": "93ad1ddc7a1f2babb5143c03221c17d59d92dea1", "publicationVenue": null, "title": "An Integrated Framework for Location Based Security in Cloud Environment using Multi Objective Optimization (ILBS-MOO)", "abstract": "Cloud computing is a nascent paradigm in the field of data technology and computer science which is predicated on the use of the Internet, often known as the World Wide Web. One of the prominent concerns within this field is the security aspects of cloud computing. Contrarily, ensuring the preservation of access to the protection of sensitive and confidential information inside financial organizations, banks and other pertinent enterprises holds significant significance. This holds significant relevance. The efficacy of the security measures in providing assurance is not infallible and can be compromised by malevolent entities. In the current study, our objective is to examine the study about the security measures through the use of a novel methodology. The primary objective of this research is to investigate the subject of data access in the realm of cloud computing, with a particular emphasis on its ramifications for corporations and other pertinent organizations. The implementation of locationbased encryption facilitates the determination of accurate geographical coordinates. In experiment apply Integrated Location Based Security using Multi objective Optimization (ILBS-MOO) on different workflows and improve performance metrics significantly. Time delay averagely approximates improvement 6-7%, storage 10-12% and security 8-10%.", "venue": "2023 IEEE 3rd Mysore Sub Section International Conference (MysuruCon)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-12-01", "journal": {"name": "2023 IEEE 3rd Mysore Sub Section International Conference (MysuruCon)", "pages": "1-9"}, "authors": [{"authorId": "2170218650", "name": "Deepika"}, {"authorId": "2281413312", "name": "Rajneesh Kumar"}, {"authorId": "70828458", "name": "Dalip"}], "citations": []}
