{"paperId": "93bac5ea15c321ffc95916be872207ae5cea05cf", "publicationVenue": {"id": "acb0d6ae-0245-43d4-9630-2e2904f50c9d", "name": "IEEE International Symposium on Distributed Simulation and Real-Time Applications", "type": "conference", "alternate_names": ["ISDSRTA", "Distributed Simulation and Real-Time Applications", "DS-RT", "IEEE int symp Distrib Simul Real-time Appl", "IEEE Int Symp Distrib Simul Real-time Appl", "Distrib Simul Real-time Appl", "IEEE international symposium on Distributed Simulation and Real-Time Applications"], "url": "http://www.wikicfp.com/cfp/program?id=771"}, "title": "Collision Avoidance Proposal in a MEC based VANET environment", "abstract": "Mobile Edge Computing (MEC) is a new network paradigm that allows resource management and IT services at the edge of a communication network and, so, closer to the devices guaranteeing low latency and high bandwidth requirements. This characteristic makes MEC paradigm suitable for critical communication services used in collaboration with container-based virtualization and with 5G networks. In this paper, an implementation of a collision avoidance system based on MEC in a VANET environment is proposed. This system makes use of cloud and edge computing and it is able to switch communication from edge to cloud server and vice versa when possible, trying to guarantee the required constraints and balancing the communication among the servers avoiding of overloading edge layer. The simulation results have proved how, in some cases, the MEC-5G combination is the best solution for avoiding collisions in a VANET environment.", "venue": "IEEE International Symposium on Distributed Simulation and Real-Time Applications", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-09-01", "journal": {"name": "2020 IEEE/ACM 24th International Symposium on Distributed Simulation and Real Time Applications (DS-RT)", "pages": "1-7"}, "authors": [{"authorId": "1841069040", "name": "Nicolas Nevigato"}, {"authorId": "1805281", "name": "M. Tropea"}, {"authorId": "1721408", "name": "F. Rango"}], "citations": [{"paperId": "44e529af8ea40a76df45b4e58bb8c9ffbebada19", "title": "A Comprehensive Survey Exploring the Multifaceted Interplay between Mobile Edge Computing and Vehicular Networks"}, {"paperId": "83a8719572383d318493845c5605f8c4d9a2ea65", "title": "An Adaptive Traffic-Flow Management System with a Cooperative Transitional Maneuver for Vehicular Platoons"}, {"paperId": "6ec8d1afa1c9a53d26ea1fecffb1b5e8fb81b723", "title": "5G-enabled V2X communications for vulnerable road users safety applications: a review"}]}
