{"paperId": "93c47b6f5c145ecd3264d1bd3633ec7ef032cdc9", "publicationVenue": {"id": "094f3ff3-fb67-4573-9f00-0852f0409d13", "name": "International Conference on Smart Cloud", "type": "conference", "alternate_names": ["SmartCloud", "Int Conf Smart Cloud"]}, "title": "TDH: An Efficient One-stop Enterprise-level Big Data Platform", "abstract": "Big data technology is rapidly changing IT industry. Among those technologies, Hadoop is the best-known one and keeps growing its popularity. Transwarp Data Hub (shortened to TDH) is an enterprise-level big data platform developed by Transwarp Technology (Shanghai) Co., Ltd. The last five years have witnessed rapid development in its growth, and it has gained experience from the deployment and implementation in the fields such as postal service, transportation, and finance. Moreover, the company has been engaged in the exploration of the newborn big data technology. Transwarp Data Hub provides five major products: Analytical Database (Transwarp Inceptor and Transwarp ArgoDB), Real-time Streaming Engine (Transwarp Slipstream), Knowledge Database (Transwarp Search and Transwarp StellarDB), Operational Database (Transwarp Hyperbase), and Data Science Platform (Transwarp Discover). Enterprises can leverage data to build core business systems more effectively and accelerate business innovation by deploying, installing, and using TDH.", "venue": "International Conference on Smart Cloud", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-10-01", "journal": {"name": "2022 IEEE 7th International Conference on Smart Cloud (SmartCloud)", "pages": "218-223"}, "authors": [{"authorId": "2108705468", "name": "Yuanhao Sun"}, {"authorId": "2190846404", "name": "Cheng Lv"}, {"authorId": "2190934321", "name": "Xi Liu"}, {"authorId": "1734483668", "name": "Tianyang Lei"}, {"authorId": "2190962177", "name": "Zhuoyi Guo"}, {"authorId": "2190932135", "name": "Ning Li"}, {"authorId": "103485470", "name": "Hongshan Yang"}], "citations": []}
