{"paperId": "93c7b211734ff968e17efcf3737248ad618833d4", "publicationVenue": null, "title": "Seamless Handover Scheme for MEC/SDN-Based Vehicular Networks", "abstract": "With the recent advances in the fifth-generation cellular system (5G), enabling vehicular communications has become a demand. The vehicular ad hoc network (VANET) is a promising paradigm that enables the communication and interaction between vehicles and other surrounding devices, e.g., vehicle-to-vehicle (V2V) and vehicle-to-everything (V2X) communications. However, enabling such networks faces many challenges due to the mobility of vehicles. One of these challenges is the design of handover schemes that manage the communications at the intersection of coverage regions. To this end, this work considers developing a novel seamless and efficient handover scheme for V2X-based networks. The developed scheme manages the handover process while vehicles move between two neighboring roadside units (RSU). The developed mechanism is introduced for multilane bidirectional roads. The developed scheme is implemented by multiple-access edge computing (MEC) units connected to the RSUs to improve the implementation time and make the handover process faster. The considered MEC platform deploys an MEC controller that implements a control scheme of the software-defined networking (SDN) controller that manages the network. The SDN paradigm is introduced to make the handover process seamless; however, implementing such a controlling scheme by the introduction of an MEC controller achieves the process faster than going through the core network. The developed handover scheme was evaluated over the reliable platform of NS-3, and the results validated the developed scheme. The results obtained are presented and discussed.", "venue": "J. Sens. Actuator Networks", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-01-27", "journal": {"name": "J. Sens. Actuator Networks", "pages": "9", "volume": "11"}, "authors": [{"authorId": "2151655966", "name": "Nirmin Monir"}, {"authorId": "2151656592", "name": "Maha M. Toraya"}, {"authorId": "144117283", "name": "A. Vladyko"}, {"authorId": "2450423", "name": "A. Muthanna"}, {"authorId": "2598074", "name": "Mohamed A. Torad"}, {"authorId": "1384090654", "name": "F. E. El-Samie"}, {"authorId": "17854263", "name": "Abdelhamied A. Ateya"}], "citations": [{"paperId": "7e934b5cd52b909d46101bbdbe4760ce188641bd", "title": "D4: Dynamic, Decentralized, Distributed, Delegation-Based Network Control and Its Applications to Autonomous Vehicles"}, {"paperId": "d439f3d621d6feeda3bb9f2113da78129874c111", "title": "Sdn based emergency message dissemination protocol for IoV-Fog networks"}, {"paperId": "4c3dd0aac27b347d5046cfa72b954b89b009a873", "title": "Mobility Management Enhancement in Smart Cities using Software Defined Networks"}, {"paperId": "958e5dd4a03dacdd7a7f3a95a41d4b4c3f7e43fe", "title": "Efficient MIH/SDN-Based Vertical Handover for 5G HetNets"}, {"paperId": "e5ff776f6f432f48aeefe83e2490449ba0113cb6", "title": "Energy Efficient Offloading Policies in Multi-Access Edge Computing Systems with Task Handover"}, {"paperId": "1dbc782e10802cae31ce6b0f2accd4f3af509834", "title": "Coexistence of Railway and Road Services by Sharing Telecommunication Infrastructure Using SDN-Based Slicing: A Tutorial"}, {"paperId": "252be13d8f2e63d8b7390b86d81d25dd5787a846", "title": "Multi-Access Edge Computing Handover Strategies, Management, and Challenges: A Review"}, {"paperId": "beb026114bb4229d6508d4483c7a8e40732253d1", "title": "A Comprehensive Survey on Vehicular Networking: Communications, Applications, Challenges, and Upcoming Research Directions"}, {"paperId": "da17e4c68d94bcb72b062df913315e7fddd249e7", "title": "A Survey of Multi-Access Edge Computing and Vehicular Networking"}]}
