{"paperId": "93caac295ecf4f2d4f373903f4af224bbfe8b50a", "publicationVenue": {"id": "5353d583-6f50-4967-ab34-74338b908b90", "name": "ACM/IEEE International Conference on Model Driven Engineering Languages and Systems", "type": "conference", "alternate_names": ["Model Driven Eng Lang Syst", "ACM/IEEE Int Conf Model Driven Eng Lang Syst", "Model Driven Engineering Languages and Systems", "MoDELS"], "url": "https://dl.acm.org/conference/models"}, "title": "Model-Driven Prompt Engineering", "abstract": "Generative artificial intelligence (AI) systems are capable of synthesizing complex content such as text, source code or images according to the instructions described in a natural language prompt. The quality of the output depends on crafting a suitable prompt. This has given rise to prompt engineering, the process of designing natural language prompts to best take advantage of the capabilities of generative AI systems.Through experimentation, the creative and research communities have created guidelines and strategies for creating good prompts. However, even for the same task, these best practices vary depending on the particular system receiving the prompt. Moreover, some systems offer additional features using a custom platform-specific syntax, e.g., assigning a degree of relevance to specific concepts within the prompt.In this paper, we propose applying model-driven engineering to support the prompt engineering process. Using a domain-specific language (DSL), we define platform-independent prompts that can later be adapted to provide good quality outputs in a target AI system. The DSL also facilitates managing prompts by providing mechanisms for prompt versioning and prompt chaining. Tool support is available thanks to a Langium-based Visual Studio Code plugin.", "venue": "ACM/IEEE International Conference on Model Driven Engineering Languages and Systems", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-10-01", "journal": {"name": "2023 ACM/IEEE 26th International Conference on Model Driven Engineering Languages and Systems (MODELS)", "pages": "47-54"}, "authors": [{"authorId": "1761959", "name": "R. Clarisó"}, {"authorId": "2253872677", "name": "Jordi Cabot"}], "citations": []}
