{"paperId": "93dbd399b2c3d67754ee363250f8976850deef69", "publicationVenue": {"id": "0942fb86-c16f-4084-9902-10ddcfe18180", "name": "Micro", "type": "conference", "alternate_names": ["Int Symp Microarchitecture", "MICRO", "International Symposium on Microarchitecture", "Annual IEEE/ACM International Symposium on Microarchitecture", "Annu IEEE/ACM Int Symp Microarchitecture"], "issn": "0271-9002", "alternate_issns": ["2151-4143", "2673-8023"], "url": "http://www.microarch.org/"}, "title": "GenASM: A High-Performance, Low-Power Approximate String Matching Acceleration Framework for Genome Sequence Analysis", "abstract": "Genome sequence analysis has enabled significant advancements in medical and scientific areas such as personalized medicine, outbreak tracing, and the understanding of evolution. To perform genome sequencing, devices extract small random fragments of an organism’s DNA sequence (known as reads). The first step of genome sequence analysis is a computational process known as read mapping. In read mapping, each fragment is matched to its potential location in the reference genome with the goal of identifying the original location of each read in the genome. Unfortunately, rapid genome sequencing is currently bottlenecked by the computational power and memory bandwidth limitations of existing systems, as many of the steps in genome sequence analysis must process a large amount of data. A major contributor to this bottleneck is approximate string matching (ASM), which is used at multiple points during the mapping process. ASM enables read mapping to account for sequencing errors and genetic variations in the reads.We propose GenASM, the first ASM acceleration framework for genome sequence analysis. GenASM performs bitvectorbased ASM, which can efficiently accelerate multiple steps of genome sequence analysis. We modify the underlying ASM algorithm (Bitap) to significantly increase its parallelism and reduce its memory footprint. Using this modified algorithm, we design the first hardware accelerator for Bitap. Our hardware accelerator consists of specialized systolic-array-based compute units and on-chip SRAMs that are designed to match the rate of computation with memory capacity and bandwidth, resulting in an efficient design whose performance scales linearly as we increase the number of compute units working in parallel.We demonstrate that GenASM provides significant performance and power benefits for three different use cases in genome sequence analysis. First, GenASM accelerates read alignment for both long reads and short reads. For long reads, GenASM outperforms state-of-the-art software and hardware accelerators by 116× and 3.9×, respectively, while reducing power consumption by 37× and 2.7×. For short reads, GenASM outperforms state-of-the-art software and hardware accelerators by 111× and 1.9×. Second, GenASM accelerates pre-alignment filtering for short reads, with 3.7× the performance of a state-of-the-art pre-alignment filter, while reducing power consumption by 1.7× and significantly improving the filtering accuracy. Third, GenASM accelerates edit distance calculation, with 22–12501× and 9.3–400× speedups over the state-of-the-art software library and FPGA-based accelerator, respectively, while reducing power consumption by 548–582× and 67×. We conclude that GenASM is a flexible, high-performance, and low-power framework, and we briefly discuss four other use cases that can benefit from GenASM.", "venue": "Micro", "year": 2020, "fieldsOfStudy": ["Computer Science", "Biology"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-09-16", "journal": {"name": "2020 53rd Annual IEEE/ACM International Symposium on Microarchitecture (MICRO)", "pages": "951-966"}, "authors": [{"authorId": "70029851", "name": "Damla Senol Cali"}, {"authorId": "120578447", "name": "G. Kalsi"}, {"authorId": "118143162", "name": "Z. Bingöl"}, {"authorId": "3432690", "name": "Can Firtina"}, {"authorId": "35164008", "name": "Lavanya Subramanian"}, {"authorId": "17766732", "name": "Jeremie S. Kim"}, {"authorId": "1999972", "name": "Rachata Ausavarungnirun"}, {"authorId": "3387282", "name": "M. Alser"}, {"authorId": "1388812849", "name": "Juan Gómez-Luna"}, {"authorId": "2675748", "name": "Amirali Boroumand"}, {"authorId": "50811700", "name": "Anant V. Nori"}, {"authorId": "1945875059", "name": "Allison Scibisz"}, {"authorId": "1706165", "name": "S. Subramoney"}, {"authorId": "2178851", "name": "C. Alkan"}, {"authorId": "33801185", "name": "Saugata Ghose"}, {"authorId": "145929920", "name": "O. Mutlu"}], "citations": [{"paperId": "cbb505aafe497d6d3da167c18e2984fc31edf61e", "title": "PUMA: Efficient and Low-Cost Memory Allocation and Alignment Support for Processing-Using-Memory Architectures"}, {"paperId": "438497a8fe2a387aeabf4c182a92a154aa480385", "title": "Data Motion Acceleration: Chaining Cross-Domain Multi Accelerators"}, {"paperId": "c71a15e4f867ff315193b64f4f448ec9491e8bcf", "title": "TALCO: Tiling Genome Sequence Alignment Using Convergence of Traceback Pointers"}, {"paperId": "c9edf92c1f762c52a90cc0cb45eb06d4eed82110", "title": "MIMDRAM: An End-to-End Processing-Using-DRAM System for High-Throughput, Energy-Efficient and Programmer-Transparent Multiple-Instruction Multiple-Data Computing"}, {"paperId": "d5f2e95be45d3e003655a9a84e0adda9468b0838", "title": "MIMDRAM: An End-to-End Processing-Using-DRAM System for High-Throughput, Energy-Efficient and Programmer-Transparent Multiple-Instruction Multiple-Data Processing"}, {"paperId": "6630205a2903ef105b517b1098077766de9b3a89", "title": "Accelerating Seed Location Filtering in DNA Read Mapping Using a Commercial Compute-in-SRAM Architecture"}, {"paperId": "3c8e4b14e3b08c692c11c0ba58c55ec4ce59385d", "title": "GEM: Ultra-Efficient Near-Memory Reconfigurable Acceleration for Read Mapping by Dividing and Predictive Scattering"}, {"paperId": "1c9d23d21d748fcabe2ff316301d21545c54c08e", "title": "Integer Point Enumeration in Multi-Dimensional Geometric Objects with FPGA Acceleration"}, {"paperId": "a0413c0576f73867d21777a07ed668410e73615a", "title": "Abakus: Accelerating k-mer Counting With Storage Technology"}, {"paperId": "e82e950aca92ed94f5ff5901c557cae2453396ad", "title": "MetaStore: High-Performance Metagenomic Analysis via In-Storage Computing"}, {"paperId": "a9f8da4e8a26fca3afa1f940db40f91d9d354aa8", "title": "An In-Memory Architecture for High-Performance Long-Read Pre-Alignment Filtering"}, {"paperId": "c75daf38ec84d306179277d08904101bc5f68d60", "title": "Swordfish: A Framework for Evaluating Deep Neural Network-based Basecalling using Computation-In-Memory with Non-Ideal Memristors"}, {"paperId": "87411e3dc48b89cc8a1f4138f80977b4f60301c2", "title": "GateSeeder: Near-memory CPU-FPGA Acceleration of Short and Long Read Mapping"}, {"paperId": "cde17e4c091d90d8edf9175358ac2973586fd1a1", "title": "WFAsic: A High-Performance ASIC Accelerator for DNA Sequence Alignment on a RISC-V SoC"}, {"paperId": "fe3777cd7170b60a8c44a0fc1a30b9535c0266b6", "title": "MeG2: In-Memory Acceleration for Genome Graphs Analysis"}, {"paperId": "21dec6c4b232750ddb06a90262dbe73db8b2fb8d", "title": "Profile-Driven Banded Smith-Waterman acceleration for Short Read Alignment"}, {"paperId": "c7b9b356015d2b3c23900fe927043f29e069acb7", "title": "WFA-FPGA: An efficient accelerator of the wavefront algorithm for short and long read genomics alignment"}, {"paperId": "38ec4e01e32edd3ee504cd267dbad41fa6e67d11", "title": "SieveMem: A Computation-in-Memory Architecture for Fast and Accurate Pre-Alignment"}, {"paperId": "7dec8a25543921c1d00cd0a9003ce0d4038bea22", "title": "GenDP: A Framework of Dynamic Programming Acceleration for Genome Sequencing Analysis"}, {"paperId": "dbda8fa088891551b2df5ae4ed60c10db08b267c", "title": "Using FPGA-based content-addressable memory for mnemonics instruction searching in assembler design"}, {"paperId": "03cc4c5afac8a0c311fdfa3ac0926a0d0e028bad", "title": "Invited: Accelerating Genome Analysis via Algorithm-Architecture Co-Design"}, {"paperId": "957261ddc91cef0d32e5b430a4d512eba7270aab", "title": "Space Efficient Sequence Alignment for SRAM-Based Computing: X-Drop on the Graphcore IPU"}, {"paperId": "f0206e82d279ad4d9ae4eaf17273b7e20edafd46", "title": "Porting and Optimizing BWA-MEM2 Using the Fujitsu A64FX Processor"}, {"paperId": "4d2be7d4f3f797a32805362de585e572ec36a1bb", "title": "TransPimLib: A Library for Efficient Transcendental Functions on Processing-in-Memory Systems"}, {"paperId": "e2b920c623dd1b00577fee7f081c13b047025141", "title": "TransPimLib: Efficient Transcendental Functions for Processing-in-Memory Systems"}, {"paperId": "06444c5756a513124b35300d1374f0e34df12990", "title": "Evaluating Machine LearningWorkloads on Memory-Centric Computing Systems"}, {"paperId": "c3040e07190f43b51b992213fc04436d7e5da12f", "title": "ABNDP: Co-optimizing Data Access and Load Balance in Near-Data Processing"}, {"paperId": "c2f514ff25750897e4e86ea5ade2187f064fd5fd", "title": "ISMatch: A real-time hardware accelerator for inexact string matching of DNA sequences on FPGA"}, {"paperId": "cf68cd9a6668ce1205a4bc3d4a8a969ef21c6a46", "title": "ASMCap: An Approximate String Matching Accelerator for Genome Sequence Analysis Based on Capacitive Content Addressable Memory"}, {"paperId": "68a4d283ce7d73fa811c9d2fddf1c9b77c2c140b", "title": "NvWa: Enhancing Sequence Alignment Accelerator Throughput via Hardware Scheduling"}, {"paperId": "f75e5d8cb6d3c10cf15c5011870e436320af59c6", "title": "RawHash: enabling fast and accurate real-time analysis of raw nanopore signals for large genomes"}, {"paperId": "d6d4ca3a7af898732aee6ed32a26eef6f3dc04e3", "title": "ALP: Alleviating CPU-Memory Data Movement Overheads in Memory-Centric Systems"}, {"paperId": "fad8f862216ddadb49e4bc03f36e1c5a4bc9404e", "title": "Genome-on-Diet: Taming Large-Scale Genomic Analyses via Sparsified Genomics"}, {"paperId": "26f749e31baa1d47f7cf2cc88d0c21884f8819e1", "title": "RAPIDx: High-Performance ReRAM Processing In-Memory Accelerator for Sequence Alignment"}, {"paperId": "0c7607f8da3936420c778a6418e2ea5d89f7775c", "title": "DRAM Bender: An Extensible and Versatile FPGA-Based Infrastructure to Easily Test State-of-the-Art DRAM Chips"}, {"paperId": "5be7859c83248307d0efaad13874cba9c8880fce", "title": "Accelerating Time Series Analysis via Processing using Non-Volatile Memories"}, {"paperId": "f3ca050b426215404dfb1042332265bb2649eac0", "title": "GANDAFL: Dataflow Acceleration for Short Read Alignment on NGS Data"}, {"paperId": "dda5728ddca81df3721744f1441ee8302c075456", "title": "Accelerating Neural Network Inference With Processing-in-DRAM: From the Edge to the Cloud"}, {"paperId": "204ec35646fcea9223a1f8f5b93da3586f46690a", "title": "GenPIP: In-Memory Acceleration of Genome Analysis via Tight Integration of Basecalling and Read Mapping"}, {"paperId": "3a2548a8286a15e0141dba6008f0eae2ac1ad724", "title": "Flash-Cosmos: In-Flash Bulk Bitwise Operations Using Inherent Computation Capability of NAND Flash Memory"}, {"paperId": "101f3046a38037529dbf584d5255634b0a463568", "title": "BWA-MEM-SCALE: Accelerating Genome Sequence Mapping on Commodity Servers"}, {"paperId": "425a24794315ce83c53025d513059eaeffd44f2f", "title": "Scrooge: a fast and memory-frugal genomic sequence aligner for CPUs, GPUs, and ASICs"}, {"paperId": "a4a80e375b3acc4ea7b09bd7c9c3b3e02e3fbb54", "title": "A framework for high-throughput sequence alignment using real processing-in-memory systems"}, {"paperId": "6445ef7945bbc2d231176e959b9cadce04acef23", "title": "ApHMM: Accelerating Profile Hidden Markov Models for Fast and Energy-Efficient Genome Analysis"}, {"paperId": "e827a686216beadd08a5d2840c24ed470e521a94", "title": "An Experimental Evaluation of Machine Learning Training on a Real Processing-in-Memory System"}, {"paperId": "e8a69aeec395ec60f1c0f9dd2a1128c728a641d9", "title": "ReSMA: accelerating approximate string matching using ReRAM-based content addressable memory"}, {"paperId": "e46c832bc1ef770bfff2d26f068df74f2c682107", "title": "ALPHA: A Novel Algorithm-Hardware Co-Design for Accelerating DNA Seed Location Filtering"}, {"paperId": "d2d3436259017029bbf084e01626a488b304fe53", "title": "GenStore: In-Storage Filtering of Genomic Data for High-Performance and Energy-Efficient Genome Analysis"}, {"paperId": "2aee1899e87c3bc8cd9af32001d1550abc373551", "title": "SparseP: Efficient Sparse Matrix Vector Multiplication on Real Processing-In-Memory Architectures"}, {"paperId": "22b5df8989a42e61f0c62bc704103d52415f2ca3", "title": "KrakenOnMem: a memristor-augmented HW/SW framework for taxonomic profiling"}, {"paperId": "6b8f75393b932d0f51ee0c0213f05b2fef3861af", "title": "BioHD: an efficient genome sequence search platform using HyperDimensional memorization"}, {"paperId": "35592c445d2e6adeb1c43ed5b25700b544188954", "title": "Exploiting Near-Data Processing to Accelerate Time Series Analysis"}, {"paperId": "2106b4aa6b61168c317dccd94f8ded96bbae10b8", "title": "PiDRAM: An FPGA-based Framework for End-to-end Evaluation of Processing-in-DRAM Techniques"}, {"paperId": "67b1e1eeb5d7af8ea7d880cd561b81d85d89144b", "title": "Heterogeneous Data-Centric Architectures for Modern Data-Intensive Applications: Case Studies in Machine Learning and Databases"}, {"paperId": "b83439573935033e7af5a8eb6a561e813e3b2839", "title": "Methodologies, Workloads, and Tools for Processing-in-Memory: Enabling the Adoption of Data-Centric Architectures"}, {"paperId": "8f40e2a30ed2954877f879554df058e4f743d0ba", "title": "Going From Molecules to Genomic Variations to Scientific Discovery: Intelligent Algorithms and Architectures for Intelligent Genome Analysis"}, {"paperId": "5695f14582e4cef36d3fc41d4a52da4b2ffbcafa", "title": "SeGraM: a universal hardware accelerator for genomic sequence-to-graph and sequence-to-sequence mapping"}, {"paperId": "4eac0fca0e861e56f502f348c3c0e024e0960c42", "title": "Polynesia: Enabling High-Performance and Energy-Efficient Hybrid Transactional/Analytical Databases with Hardware/Software Co-Design"}, {"paperId": "4024f2497f1096ad9b44c782db15cdd2320253d0", "title": "RTRBench: A Benchmark Suite for Real-Time Robotics"}, {"paperId": "39f74f26853ccc34bfe5485e4d78219ed317d0e6", "title": "Enabling High-Performance and Energy-Efficient Hybrid Transactional/Analytical Databases with Hardware/Software Cooperation"}, {"paperId": "544fcc668dd0d8d16fe303229a5b5fab5485105f", "title": "Near LLC versus near main memory processing"}, {"paperId": "b7670b3b4963b2e0b77e8c5f52cb31df980c1972", "title": "Near-Stream Computing: General and Transparent Near-Cache Acceleration"}, {"paperId": "e3bfd8cdc03b610cbd959adb360e09b1aa1fc436", "title": "Algorithmic Improvement and GPU Acceleration of the GenASM Algorithm"}, {"paperId": "729e8ed4e3356cded9b1a465f72a76813bac62a1", "title": "GenStore: a high-performance in-storage processing system for genome sequence analysis"}, {"paperId": "4d3fb0382d679483570650e091c89a086a585c07", "title": "GenStore: A High-Performance and Energy-Efficient In-Storage Computing System for Genome Sequence Analysis"}, {"paperId": "b1777d08e3848e47bf68e69164f24338b5b9f78b", "title": "EcoFlow: Efficient Convolutional Dataflows for Low-Power Neural Network Accelerators"}, {"paperId": "ef58a34c000f5f7cc4329d03641481342b830a84", "title": "SparseP: Towards Efficient Sparse Matrix Vector Multiplication on Real Processing-In-Memory Systems"}, {"paperId": "2d96f79f33af42a75a9e6d8b6eb0dfc675b914e3", "title": "Casper: Accelerating Stencil Computations Using Near-Cache Processing"}, {"paperId": "46d657297da65cd6105ac837ad24ec7fd651f3b1", "title": "BLEND: a fast, memory-efficient and accurate mechanism to find fuzzy seed matches in genome analysis"}, {"paperId": "aa97d9f856e51f27ea59751a37bf5aca5fa59a5b", "title": "Energy-Efficient Deflection-based On-chip Networks: Topology, Routing, Flow Control"}, {"paperId": "361b14bbd0345f404c3be486464fb3cb6c78aad4", "title": "PiDRAM: A Holistic End-to-end FPGA-based Framework for Processing-in-DRAM"}, {"paperId": "7b78d629c823f6345343cce85a11f3d95aa4ac3e", "title": "Benchmarking Memory-Centric Computing Systems: Analysis of Real Processing-In-Memory Hardware"}, {"paperId": "6604a29489fab65cc9b61a369759d96c781d2861", "title": "Sextans: A Streaming Accelerator for General-Purpose Sparse-Matrix Dense-Matrix Multiplication"}, {"paperId": "bf4d924117b141c3ce044efb86096ef422227a55", "title": "An FPGA Based Energy-Efficient Read Mapper With Parallel Filtering and In-Situ Verification"}, {"paperId": "e4a109f37137d8bc73954ecb808aee70522f8691", "title": "Survey on Near-Data Processing: Applications and Architectures"}, {"paperId": "ce29efed938f6397ef643dbace5f7fcdf2fb9a0f", "title": "SquiggleFilter: An Accelerator for Portable Virus Detection"}, {"paperId": "2a47d481636a67bf1edbd2bcd73d823e69bc4c75", "title": "Accelerating Weather Prediction Using Near-Memory Reconfigurable Fabric"}, {"paperId": "893a75dabd6f69070b15ffd20ba2273d81f7bf8c", "title": "FPGA-Based Near-Memory Acceleration of Modern Data-Intensive Applications"}, {"paperId": "b6399dc015a38f68f36aa04843a5985bc94ed312", "title": "Accelerated Seeding for Genome Sequence Alignment with Enumerated Radix Trees"}, {"paperId": "12aac691cfdcd8fae14bda71ca93076009101bab", "title": "SIMDRAM: An End-to-End Framework for Bit-Serial SIMD Computing in DRAM"}, {"paperId": "8e87c31c9174c254b824910e28b5bf66f274650e", "title": "Benchmarking a New Paradigm: An Experimental Analysis of a Real Processing-in-Memory Architecture"}, {"paperId": "8e85281351edfd13081f1175fb102836ccc4baca", "title": "DAMOV: A New Methodology and Benchmark Suite for Evaluating Data Movement Bottlenecks"}, {"paperId": "63a77243ccf7ae22fd545ebba64866e352782f50", "title": "SIMDRAM: a framework for bit-serial SIMD processing using DRAM"}, {"paperId": "7a210280d4775b1dfb36401a1007ac57602ab1e5", "title": "pLUTo: Enabling Massively Parallel Computation in DRAM via Lookup Tables"}, {"paperId": "312606937a7445dc593e2155b46ffd42dfa5afd0", "title": "GateKeeper-GPU: Fast and Accurate Pre-Alignment Filtering in Short Read Mapping"}, {"paperId": "9817bf0f78047452761e950c02a1a56f59a1e593", "title": "SynCron: Efficient Synchronization Support for Near-Data-Processing Architectures"}, {"paperId": "f58babc873f629090f213499f3dee18a2c507329", "title": "Intelligent Architectures for Intelligent Computing Systems"}, {"paperId": "6ee7cc7835b9244b739e7f5be518effa1996e83f", "title": "SIMDRAM: A Framework for Bit-Serial SIMD Processing Using DRAM"}, {"paperId": "7bb6015f45457fdbe3bb39e17dc9cb0786ecd688", "title": "A Modern Primer on Processing in Memory"}, {"paperId": "32d38f648589122251448cca59873e827f4bebd1", "title": "Nanopore base calling on the edge"}, {"paperId": "f90f526b101cb8a0260f5165a3875928c58ae48a", "title": "NATSA: A Near-Data Processing Accelerator for Time Series Analysis"}, {"paperId": "432e0f6e0f8122d535e0c650458c210dcad30499", "title": "Technology dictates algorithms: recent developments in read alignment"}, {"paperId": "83faa0dcb8d054f1df2a42c844ce4161c808d0a7", "title": "SneakySnake: A Fast and Accurate Universal Genome Pre-Alignment Filter for CPUs, GPUs, and FPGAs"}, {"paperId": "084809bcb66911c8cef94879311beb96d11bc6a6", "title": "Benchmarking a New Paradigm: Experimental Analysis and Characterization of a Real Processing-in-Memory System"}, {"paperId": "2573aeb28d0ae2fcf9a680e76ba51574532ed759", "title": "FPGA Acceleration of Pre-Alignment Filters for Short Read Mapping With HLS"}, {"paperId": "e804e5bfe114715af9d77ed27a009b7a894a7ed0", "title": "Taming Large-Scale Genomic Analyses via Sparsified Genomics"}, {"paperId": "bc728fe8477fdecfb4b9bebf4043ffb195a92a3a", "title": "An FPGA-based Accelerated Mutation Detection System for the Tumor Suppressor Gene"}]}
