{"paperId": "93e64e090c5d51ae70df240b918401c13642aeb0", "publicationVenue": {"id": "e16082f9-390d-423d-a448-883b5a4fa88f", "name": "Journal of Cybersecurity and Privacy", "type": "journal", "alternate_names": ["J Cybersecur Priv"], "issn": "2624-800X", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-1444919", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-1444919"]}, "title": "Functionality-Preserving Adversarial Machine Learning for Robust Classification in Cybersecurity and Intrusion Detection Domains: A Survey", "abstract": "Machine learning has become widely adopted as a strategy for dealing with a variety of cybersecurity issues, ranging from insider threat detection to intrusion and malware detection. However, by their very nature, machine learning systems can introduce vulnerabilities to a security defence whereby a learnt model is unaware of so-called adversarial examples that may intentionally result in mis-classification and therefore bypass a system. Adversarial machine learning has been a research topic for over a decade and is now an accepted but open problem. Much of the early research on adversarial examples has addressed issues related to computer vision, yet as machine learning continues to be adopted in other domains, then likewise it is important to assess the potential vulnerabilities that may occur. A key part of transferring to new domains relates to functionality-preservation, such that any crafted attack can still execute the original intended functionality when inspected by a human and/or a machine. In this literature survey, our main objective is to address the domain of adversarial machine learning attacks and examine the robustness of machine learning models in the cybersecurity and intrusion detection domains. We identify the key trends in current work observed in the literature, and explore how these relate to the research challenges that remain open for future works. Inclusion criteria were: articles related to functionality-preservation in adversarial machine learning for cybersecurity or intrusion detection with insight into robust classification. Generally, we excluded works that are not yet peer-reviewed; however, we included some significant papers that make a clear contribution to the domain. There is a risk of subjective bias in the selection of non-peer reviewed articles; however, this was mitigated by co-author review. We selected the following databases with a sizeable computer science element to search and retrieve literature: IEEE Xplore, ACM Digital Library, ScienceDirect, Scopus, SpringerLink, and Google Scholar. The literature search was conducted up to January 2022. We have striven to ensure a comprehensive coverage of the domain to the best of our knowledge. We have performed systematic searches of the literature, noting our search terms and results, and following up on all materials that appear relevant and fit within the topic domains of this review. This research was funded by the Partnership PhD scheme at the University of the West of England in collaboration with Techmodal Ltd.", "venue": "Journal of Cybersecurity and Privacy", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-03-17", "journal": {"name": "J. Cybersecur. Priv.", "pages": "154-190", "volume": "2"}, "authors": [{"authorId": "2059622328", "name": "Andrew McCarthy"}, {"authorId": "2155386", "name": "Essam Ghadafi"}, {"authorId": "1749393", "name": "Panagiotis Andriotis"}, {"authorId": "32735793", "name": "Phil Legg"}], "citations": [{"paperId": "b54ff61fc8f7c3ddb064e02a246c27c9f1972c91", "title": "Reliable Feature Selection for Adversarially Robust Cyber-Attack Detection"}, {"paperId": "477f16fd1d6bd476b6a8f582525fcc65863d5421", "title": "A Comprehensive Survey on Cyber Deception Techniques to Improve Honeypot Performance"}, {"paperId": "d55f9df4c0dc2dd4c057af2fa52c1c4ba7883534", "title": "An Adversarial Robustness Benchmark for Enterprise Network Intrusion Detection"}, {"paperId": "a9a00983957df67e15a9673446e6bed86dd8737f", "title": "DDoS attack detection in SDN: Enhancing entropy‐based detection with machine learning"}, {"paperId": "eac0ae22df2ae5d991f2b90d49db637293eb0f95", "title": "Navigating the Cyber Threat Landscape: A Comprehensive Analysis of Attacks and Security in the Digital Age"}, {"paperId": "e5a1c38db5e2281308cf0d6aca521beeb723d692", "title": "Performance evaluation of botnet detection using machine learning techniques"}, {"paperId": "b4ab4f94d8a6d884cf1142082a657cc9c9cf28c9", "title": "Adversarial examples: A survey of attacks and defenses in deep learning-enabled cybersecurity systems"}, {"paperId": "9721704f0355d1d86c7dd220f18712ff8a494c9e", "title": "A Multi-Agent Intrusion Detection System Optimized by a Deep Reinforcement Learning Approach with a Dataset Enlarged Using a Generative Model to Reduce the Bias Effect"}, {"paperId": "f97f26b66ddce0ce40798fde2af057fcda02b23b", "title": "Artificial Intelligence to Improve Antibiotic Prescribing: A Systematic Review"}, {"paperId": "cf2ea29edaab9ceb9af40fca8f647c1552c296bc", "title": "GPMT: Generating practical malicious traffic based on adversarial attacks with little prior knowledge"}, {"paperId": "7472fdedf4a8fd33d61f3bfa9ee1eb4049d4054b", "title": "Review on the Feasibility of Adversarial Evasion Attacks and Defenses for Network Intrusion Detection Systems"}, {"paperId": "a56fef56f4d14a8d78e7c7920e28d1e1c356348f", "title": "Adv-Bot: Realistic Adversarial Botnet Attacks against Network Intrusion Detection Systems"}, {"paperId": "7f6fd89488926ee7638751cb8641a80ce7fec927", "title": "i-2NIDS Novel Intelligent Intrusion Detection Approach for a Strong Network Security"}, {"paperId": "3f1dc7ce0e83931b93fa16d999cbb3a70ef4cd75", "title": "Defending against adversarial machine learning attacks using hierarchical learning: A case study on network traffic attack classification"}, {"paperId": "08c152c12d83088cadbbf767a145e7cf2ff811d7", "title": "Artificial Intelligence for Cybersecurity: Offensive Tactics, Mitigation Techniques and Future Directions"}, {"paperId": "67baab5b3dda21caae3ab3f4d50c99d6ae16748b", "title": "Deep Reinforcement Learning based Evasion Generative Adversarial Network for Botnet Detection"}, {"paperId": "b69bbcb8798b676a5f2a737f320797b0f22ac7a7", "title": "Feature Subset Selection Hybrid Deep Belief Network Based Cybersecurity Intrusion Detection Model"}, {"paperId": "c2bc94cd97ace026d3c055546922f49b721220ab", "title": "Relational Deep Learning Detection with Multi-Sequence Representation for Insider Threats"}]}
