{"paperId": "93f82117efb487699b216eb26e5483bb5a77b3cc", "publicationVenue": {"id": "d286fdd0-3b6c-433c-afee-87228d8e9f93", "name": "IEEE Transactions on Dependable and Secure Computing", "type": "journal", "alternate_names": ["IEEE Trans Dependable Secur Comput"], "issn": "1545-5971", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=8858"}, "title": "Gotham Testbed: A Reproducible IoT Testbed for Security Experiments and Dataset Generation", "abstract": "The growing adoption of the Internet of Things (IoT) has brought a significant increase in attacks targeting those devices. Machine learning (ML) methods have shown promising results for intrusion detection; however, the scarcity of IoT datasets remains a limiting factor in developing ML-based security systems for IoT scenarios. Static datasets get outdated due to evolving IoT architectures and threat landscape; meanwhile, the testbeds used to generate them are rarely published. This article presents the Gotham testbed, a reproducible and flexible security testbed extendable to accommodate new emulated devices, services or attackers. Gotham is used to build an IoT scenario composed of 100 emulated devices communicating via MQTT, CoAP and RTSP protocols, among others, in a topology composed of 30 switches and 10 routers. The scenario presents three threat actors, including the entire Mirai botnet lifecycle and additional red-teaming tools performing DoS, scanning, and attacks targeting IoT protocols. The testbed has many purposes, including a cyber range, testing security solutions, and capturing network and application data to generate datasets. We hope that researchers can leverage and adapt Gotham to include other devices, state-of-the-art attacks and topologies to share scenarios and datasets that reflect the current IoT settings and threat landscape.", "venue": "IEEE Transactions on Dependable and Secure Computing", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-07-28", "journal": {"name": "IEEE Transactions on Dependable and Secure Computing", "pages": "186-203", "volume": "21"}, "authors": [{"authorId": "2253596421", "name": "Xabier Sáez-de-Cámara"}, {"authorId": "2052272176", "name": "J. L. Flores"}, {"authorId": "40654653", "name": "Cristóbal Arellano"}, {"authorId": "144673269", "name": "A. Urbieta"}, {"authorId": "3245508", "name": "Urko Zurutuza"}], "citations": [{"paperId": "2cc736664c6d1d25650fd669c8dc549987420d96", "title": "A novel framework for analyzing internet of things datasets for machine learning and deep learning-based intrusion detection systems"}, {"paperId": "13934324e5d1978e03efa8699b8339884d11afe3", "title": "From DDoSim to DDoSimQ: Enhancing DDoS Attack Simulations Through Full System Emulation"}, {"paperId": "141f46f4926f3761f95b93c4b293d3d5d484d587", "title": "Federated Explainability for Network Anomaly Characterization"}, {"paperId": "ebbc14dad887ab8181cde8cf24022ed2d7250f0a", "title": "VetIoT: On Vetting IoT Defenses Enforcing Policies at Runtime"}, {"paperId": "c59a6971c5a6e32e7f402bb50b29a43f834abf72", "title": "A Scalable Cyber Security Framework for the Experimentation of DDoS Attacks of Things"}, {"paperId": "f2d46013acbf53a5248fc850329247cb42980e6c", "title": "Clustered Federated Learning Architecture for Network Anomaly Detection in Large Scale Heterogeneous IoT Networks"}]}
