{"paperId": "9409fd743dfb0689dac45544d05fc59e0395487c", "publicationVenue": {"id": "2d100ae4-a9ef-4c13-b34e-1829f6aca016", "name": "Biomimetics", "type": "journal", "issn": "1059-0153", "alternate_issns": ["2313-7673"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-981712", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-981712", "https://www.mdpi.com/journal/biomimetics"]}, "title": "An Improved Harris Hawks Optimization Algorithm and Its Application in Grid Map Path Planning", "abstract": "Aimed at the problems of the Harris Hawks Optimization (HHO) algorithm, including the non-origin symmetric interval update position out-of-bounds rate, low search efficiency, slow convergence speed, and low precision, an Improved Harris Hawks Optimization (IHHO) algorithm is proposed. In this algorithm, a circle map was added to replace the pseudo-random initial population, and the population boundary number was reduced to improve the efficiency of the location update. By introducing a random-oriented strategy, the information exchange between populations was increased and the out-of-bounds position update was reduced. At the same time, the improved sine-trend search strategy was introduced to improve the search performance and reduce the out-of-bound rate. Then, a nonlinear jump strength combining escape energy and jump strength was proposed to improve the convergence accuracy of the algorithm. Finally, the simulation experiment was carried out on the test function and the path planning application of a 2D grid map. The results show that the Improved Harris Hawks Optimization algorithm is more competitive in solving accuracy, convergence speed, and non-origin symmetric interval search efficiency, and verifies the feasibility and effectiveness of the Improved Harris Hawks Optimization in the path planning of a grid map.", "venue": "Biomimetics", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-01", "journal": {"name": "Biomimetics", "volume": "8"}, "authors": [{"authorId": "2244138679", "name": "Lin Huang"}, {"authorId": "2244070866", "name": "Qiang Fu"}, {"authorId": "48770567", "name": "Nan Tong"}], "citations": [{"paperId": "0ab0fae5d99a9748dc9a835b3fe67dc1916c39e0", "title": "Forecasting regional water demand using multi-fidelity data and harris hawks optimization of generalized regression neural network models – A case study of Heilongjiang Province, China"}, {"paperId": "0c613ccf095285bb4a7bc64c94001e2f3cf3421f", "title": "A Hybrid HHO-AVOA for Path Planning of a Differential Wheeled Mobile Robot in Static and Dynamic Environments"}]}
