{"paperId": "9409ab924e5b8857ff9a179bf2d8e3c1e8e963dc", "publicationVenue": null, "title": "Measuring Ideological Spectrum Through NLP", "abstract": "In the evolving landscape of online communities, the dispute between social integration and fragmentation has sparked ongoing debates. With the advent of technologically mediated social networks, understanding the structure of these communities remains a challenge. This study introduces a fresh, text-based technique to quantify the alignment of online communities along social dimensions. Through the analysis of historical Reddit data, community representations are generated from Reddit posts and projected onto ideological-partisan axes. This approach successfully scores communities, effectively situating them on the political-ideological spectrum. Our approach rests on the premise that the language, topics, parlance, and discourse style employed by communities offer insights into their ideological leanings. We found that using posts’ text we can build a very similar and correlated partisan-ness ranking to the one inferred through user interactions, which reinforces our premise. This text-based approach also enables the analysis of books, news, blogs, and other sources that were not possible with previous approaches. Our results underscore the advantages of transformer-based embeddings when compared to skip-gram embeddings trained on the same dataset. This work contributes to the understanding of online community structures and their ideological foundations.", "venue": "NL4AI@AI*IA", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": null, "authors": [{"authorId": "2271552734", "name": "Franco Demarco"}, {"authorId": "2271265514", "name": "Juan Manuel Ortiz de Zarate"}, {"authorId": "2272015140", "name": "Esteban Feuerstein"}], "citations": [{"paperId": "377bcfbd06d38a2b487cf7cc9072d48100e053e4", "title": "NL4AI 2023: Overview of the Seventh Workshop on Natural Language for Artificial Intelligence (NL4AI 2023)"}]}
