{"paperId": "940a4aea9d48fb2e88998f9bbb3537920a37f69a", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Service Management for IoT: Requirements, Taxonomy, Recent Advances and Open Research Challenges", "abstract": "The exponential growth in the number of smart devices connected to the Internet of Things (IoT), and associated with various IoT-based smart applications and services, raises interoperability challenges which could affect the sustainability of IoT services. IoT software applications are built using different software platforms and embedded in diverse types of terminals and sensing devices. Aiming to offer smart services over a range of network technologies that use different communication protocols. The concept of Web service with service-oriented solutions was introduced to cope with the heterogeneity of hardware and software, and to tackle issues of interoperability, flexibility and scalability. The main step of this solution was the integration of Web of Things technologies into smart device networks, with the utilization of IoT gateways. Service management is a crucial factor in sustaining service-oriented solutions in dynamic and highly scalable IoT systems, and is concerned with several issues associated with service provisioning, orchestration, composition and adaption. This work was motivated by the need for robust and flexible service management systems that can meet the requirements for the rapid scalability and heterogeneity associated with the exponential growth of IoT systems. In the literature there is no survey of service management issues and associated research efforts in the field of IoT. In this article, we identify the key requirements for managing IoT services as well as common service management platforms for IoT. We provide a thematic taxonomy based on the important factors, and investigate recent advances in service management for IoT systems. Finally, the major challenges that remain open are presented as a guide for future research directions.", "venue": "IEEE Access", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2019-10-17", "journal": {"name": "IEEE Access", "pages": "155472-155488", "volume": "7"}, "authors": [{"authorId": "118331125", "name": "Abdelmuttlib Ibrahim Abdalla Ahmed"}, {"authorId": "143930319", "name": "A. Gani"}, {"authorId": "46187855", "name": "Siti Hafizah Ab Hamid"}, {"authorId": "3100952", "name": "Abdelzahir Abdelmaboud"}, {"authorId": "10067603", "name": "Hassan Jamil Syed"}, {"authorId": "1403570206", "name": "Riyaz Ahamed Ariyaluran Habeeb Mohamed"}, {"authorId": "2096342291", "name": "Ihsan Ali"}], "citations": [{"paperId": "a2a33ccdd4577f0c9bdbe798e72e9093bc23cfcd", "title": "Towards a taxonomy of privacy requirements based on the LGPD and ISO/IEC 29100"}, {"paperId": "6c397130d38b281d3c5d47371195ce3d460bc6d1", "title": "An Advanced Strategy for Addressing Heterogeneity in SDN-IoT Networks for Ensuring QoS"}, {"paperId": "964e6ebc3082a299f0c24078b7ed01bff73f88a2", "title": "embServe: Embedded Services for Constrained Devices"}, {"paperId": "40f1893c1d0562b85b72f19811a7d9004a017c38", "title": "The Future of the Internet of Things (IoT) and IoT Authentication"}, {"paperId": "db97dc5f0c57a4653f8285395136712d1ced7a06", "title": "Microservice security: a systematic literature review"}, {"paperId": "462e013ffe27d3d88fed10e5dc3686e5d3184add", "title": "The Internet of Drones: Requirements, Taxonomy, Recent Advances, and Challenges of Research Trends"}, {"paperId": "e0ae1bab4b7ece653fcd3f6e3f6c1f1d042b5179", "title": "Integrated Service Composition Approach Based on Transparent Access to Heterogeneous IoT Networks Using Multiple Service Providers"}, {"paperId": "b19e3fac0ba56e1c907fb16943c780bbddbb2611", "title": "A Technology Tree for Internet of Things"}, {"paperId": "c336977958de1772b4f1af9efdee5e9fd23a4577", "title": "IoT Based Foot Neuropathy Analysis and Remote Monitoring of Foot Pressure and Temperature"}, {"paperId": "fc013c2c1332c50f6874a850f4c86adf1ae06a21", "title": "AI4SAFE-IoT: an AI-powered secure architecture for edge layer of Internet of things"}, {"paperId": "13840dbb11859f8f4b3e76858e98fe9156578e5f", "title": "A Research Roadmap for Trustworthy Dynamic Systems of Systems – Motivation , Challenges and Research Directions"}, {"paperId": "566979c45713beda02270fa7f7f492b4eb3e063f", "title": "An Enhanced Authentication Protocol for RFID Systems"}, {"paperId": "d2569e29386db02237f51f2775722e4d8d49f518", "title": "Dynamic Meta-Information Management for IoT-based Applications"}]}
