{"paperId": "9435bdb2cb67145ff4e45f24ad8d3c8164c58ba1", "publicationVenue": {"id": "018dbcc4-52fa-4865-9b2f-6af96b2ca317", "name": "International Conference on Engineering, Technology and Innovation", "type": "conference", "alternate_names": ["ICE/ITMC", "Int Conf Eng Technol Innov"]}, "title": "Real-Time Monitoring of Road Traffic Using Data Stream Mining", "abstract": "The development of applications for advanced Intelligent Transportation Systems (ITS), is a growing research area, pushed especially by the need to mitigate problems related to transportation inefficiency, overuse and pollution, mainly caused by the increasing of traffic congestions in big cities. Nowadays, traffic related data coming from the road infrastructure, user's cars or mobile phones, is generated in unprecedent volume and speed. Therefore, ITS face new challenges, with respect to growing demand to process large volumes of traffic data in real-time, and extract value that can be immediately used for decision making. The work presented here, proposes a scalable architecture supported by Big Data technologies, capable of processing real-time traffic data captured from 349 inductive loop counters, placed in Slovenian road network. The main goal is to propose an approach which can be adopted by national road operators, capable of monitoring, in real-time, the current status of the road network. Traffic events need to be detected in real-time and require the collection of data from several fixed sensors. To deal with data volume and velocity challenges, a data stream management system was used, able to collect traffic data that arrives and process it on a continuous (24×7) basis. Results achieved, suggest that there's a great advantage in the adoption of a data stream management system, with respect to traditional database management systems, illustrated by practical examples, providing quantitative metrics about data processing performance.", "venue": "International Conference on Engineering, Technology and Innovation", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2018-06-01", "journal": {"name": "2018 IEEE International Conference on Engineering, Technology and Innovation (ICE/ITMC)", "pages": "1-8"}, "authors": [{"authorId": "144239323", "name": "Paulo Figueiras"}, {"authorId": "23633694", "name": "Zala Herga"}, {"authorId": "8396625", "name": "G. Guerreiro"}, {"authorId": "2064455066", "name": "Antonio Rosa"}, {"authorId": "50531199", "name": "R. Costa"}, {"authorId": "1398998656", "name": "R. Jardim-Gonçalves"}], "citations": [{"paperId": "7ad82d2176f1e58678d3c35ef122c8c0f8a04443", "title": "Traffic Monitoring Using IoT And Lambda Architecture"}, {"paperId": "8881b10d3c8280c960d3f9b11fb5f1a40d478589", "title": "A crowd-AI dynamic neural network hyperparameter optimization approach for image-driven social sensing applications"}, {"paperId": "1bc92a9818138d249bcee22dd078137c1fd4ec0f", "title": "A data–information–knowledge cycle for modeling driving behavior"}, {"paperId": "d6e6ec1cde1b61908f6a9c9bf7ff6f9a6ba89fba", "title": "StreamCollab: A Streaming Crowd-AI Collaborative System to Smart Urban Infrastructure Monitoring in Social Sensing"}, {"paperId": "247167e6e1c051c8e479976580738e7ad6266800", "title": "BIG MOBILITY DATA ANALYTICS FOR TRAFFIC MONITORING AND CONTROL"}, {"paperId": "674e847e429c242dc363ba5e75288c4dafa76d5d", "title": "Real-Time Vehicle Traffic Analysis using Long Short Term Memory Networks in Apache Spark"}, {"paperId": "15f8e31d3b3397d94db4dd1539ad91084630e1df", "title": "Design of Smart Roads - A Vision on Indian Smart Infrastructure Development"}, {"paperId": "8ff2f157245b7402387995b27bc43d1eaa2b48df", "title": "Büyük Veri Perspektifinden Trafik Tahmini Traffic Prediction Based on Big Data Perspective"}, {"paperId": "37d22dd9a85fcd1405107c8821946a487e9c5e28", "title": "Design of Traffic Emergency Response System Based on Internet of Things and Data Mining in Emergencies"}, {"paperId": "04124883b3e21b2f6990cdcca05b6fd0d48f1d92", "title": "Industrial Parameters Monitoring System based on Embedded Web Server"}, {"paperId": "6e51011538462394f6798ae67a7ef3d2950516da", "title": "Analysing Public Transport data through the use of Big Data tecnhologies for urban mobility"}, {"paperId": "cb333404735f1484789fda41c4792d5ac5a72d22", "title": "Real Time Road Monitoring System"}, {"paperId": "279d7641503fbc94d95a4aa94815ef0cc1adf04b", "title": "INTELLIGENT SYSTEM FOR DRIVER SUPPORT USING TWO CLASSIFIERS FOR SIMULATION"}]}
