{"paperId": "943e04e8740e9d4a76146134ca71a33ffba6a984", "publicationVenue": null, "title": "Stochastic Block Partition Graph Challenge-draft -", "abstract": "A challenging and important objective for analyzing real-world graphs is to achieve scalable performance on large graphs. Competitive benchmarks and challenges have proven to be an effective means to advance state-of-the-art performance and foster community collaboration. Past graph challenges such as Graph500 address problems such as search and path-finding with subquadratic complexity. However, some analyses on graphs with real-world applications are NP-hard. Graph partition is a well-known example. Although graph partition, as a combinatorial problem, is NP-hard, existing relaxation methods provide good approximate solutions with subquadratic complexity and hence can scale to large graphs. This paper describes a graph partition challenge with a baseline partition algorithm that has such desired properties. Furthermore, the algorithm employs rigorous Bayesian inferential methods based on a statistical model that captures characteristics of the real-world graphs. This strong foundation enables the algorithm to address limitations of well-known graph partition approaches such as modularity maximization. This paper describes various aspects of the challenge including: (1) the data sets and graph generator, (2) the baseline partition algorithm with pseudocode, (3) an argument for the correctness of parallelizing the Bayesian updates, (4) different parallel computation strategies such as node-based parallelism and matrix-based parallelism, (5) evaluation metrics for both partition correctness and computational requirements, (6) preliminary timing of a Python-based demonstration code and the open source C++ code, and (7) considerations for partitioning the graph in a streaming fashion. Data sets and source code for the algorithm as well as metrics, with detailed documentation are available at GraphChallenge.org.", "venue": "", "year": 2017, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "2186219", "name": "E. Kao"}, {"authorId": "74882299", "name": "V. Gadepally"}, {"authorId": "31005667", "name": "M. Hurley"}, {"authorId": "2111328084", "name": "Michael Jones"}, {"authorId": "3257323", "name": "J. Kepner"}, {"authorId": "31702440", "name": "S. Mohindra"}, {"authorId": "23974945", "name": "P. Monticciolo"}, {"authorId": "2097629", "name": "A. Reuther"}, {"authorId": "2331418", "name": "S. Samsi"}, {"authorId": "2110880613", "name": "William S. Song"}, {"authorId": "3013472", "name": "D. Staheli"}, {"authorId": "2111051933", "name": "S. Smith"}], "citations": []}
