{"paperId": "9444adfd7ceb1dd1f64b88684968243e72b39192", "publicationVenue": null, "title": "The Digital Revolution and Sustainable Development: Opportunities and Challenges - Report prepared by The World in 2050 initiative", "abstract": "The Digital Revolution, including technologies such as virtual and augmented reality, additive manufacturing or 3D Printing, (general purpose) artificial intelligence, or the Internet of Things, has entered the public discourse in many countries. Looking back, it is almost impossible to believe that digitalization is barely featured in the 2030 Agenda or the Paris Agreement. It is increasingly clear that digital changes, we refer to them as the Digital Revolution, are becoming a key driving force in societal transformation. The transformation towards sustainability for all must be harmonized with the threats, opportunities and dynamics of the Digital Revolution, the goals of the 2030 Agenda and the Paris Agreement. At the same time, the digital transformation will radically alter all dimensions of global societies and economies and will therefore change the interpretation of the sustainability paradigm itself. Digitalization is not only an ‘instrument’ to resolve sustainability challenges, it is also fundamental as a driver of disruptive change. This report that focuses on the Digital Revolution is the second one by The World in 2050 (TWI2050) that was established by the International Institute for Applied Systems Analysis (IIASA) and other partners to provide scientific foundations for the 2030 Agenda. This report is based on the voluntary and collaborative effort of 45 authors and contributors from about 20 institutions, and some 100 independent experts from academia, business, government, intergovernmental and non-governmental organizations from all the regions of the world, who met four times at IIASA to develop science-based strategies and pathways toward achieving the Sustainable Development Goals (SDGs). Presentations of the TWI2050 approach and work have been made at many international meetings such as the United Nations Science, Technology and Innovation Forums and the United Nations High-level Political Forums. In 2018, the first report by TWI2050 on Transformations to Achieve the Sustainable Development Goals identified Six Exemplary Transformations needed to achieve the SDGs and long-term sustainability to 2050 and beyond: i) Human Capacity & Demography; ii) Consumption & Production; iii) Decarbonization & Energy, iv) Food, Biosphere & Water; v) Smart Cities and vi) Digital Revolution. The focus of this report is the Sixth Transformation, The Digital Revolution. Although it is arguably the single greatest enabler of sustainable development, it has, in the past, helped create many negative externalities like transgression of planetary boundaries. Progress on the SDGs will be facilitated if we can build and implement detailed science, technology and innovation (STI) roadmaps at all levels that range from local to global. STI is a forceful driver of change connected to all 17 SDGs. The Digital Revolution provides entirely new and enhanced capacities and thus serves as a major force in shaping both the systemic context of transformative change and future solutions; at the same time it potentially carries strong societal disruptive power if not handled with caution, care and innovativeness. This report assesses all the positive potential benefits digitalization brings to sustainable development for all. It also highlights the potential negative impacts and challenges going forward, particularly for those impacted by the “digital divide” that excludes primarily people left behind during the Industrial Revolution like the billion that go hungry every night and the billion who do not have access to electricity. The report outlines the necessary preconditions for a successful digital transformation, including prosperity, social inclusion, environmental sustainability and good governance. Importantly it outlines some of the dramatic social implications associated with an increasingly digital future. It also covers a topic that so far has not been sufficiently dealt with in the cross-over discussions between sustainability and the Digital Revolution, that is, the considerations about related governance aspects.", "venue": "", "year": 2019, "fieldsOfStudy": ["Political Science"], "publicationTypes": null, "publicationDate": "2019-07-11", "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "40256250", "name": "Dirk Messner"}, {"authorId": "2338789", "name": "N. Nakicenovic"}, {"authorId": "116866038", "name": "C. Zimm"}, {"authorId": "143994877", "name": "G. Clarke"}, {"authorId": "50393319", "name": "J. Rockström"}, {"authorId": "144725107", "name": "A. Aguiar"}, {"authorId": "1403825683", "name": "Benigna Boza-Kiss"}, {"authorId": "52153001", "name": "L. Campagnolo"}, {"authorId": "7776037", "name": "I. Chabay"}, {"authorId": "51209752", "name": "David Collste"}, {"authorId": "2447413", "name": "L. Comolli"}, {"authorId": "1404859098", "name": "L. Gómez-Echeverri"}, {"authorId": "88521185", "name": "A. Goujon"}, {"authorId": "145291647", "name": "A. Grubler"}, {"authorId": "2058435710", "name": "Reiner Jung"}, {"authorId": "100621486", "name": "Miho Kamei"}, {"authorId": "101683950", "name": "George Kamiya"}, {"authorId": "2304547", "name": "E. Kriegler"}, {"authorId": "2066555150", "name": "Michael Kuhn"}, {"authorId": "91874317", "name": "Julia Leininger"}, {"authorId": "1403946676", "name": "Charles P. Martin-Shields"}, {"authorId": "1417808210", "name": "Beatriz Mayor-Rodriguez"}, {"authorId": "2109508923", "name": "Jerry Miller"}, {"authorId": "95457328", "name": "A. Miola"}, {"authorId": "3491432", "name": "K. Riahi"}, {"authorId": "7359965", "name": "Maria Schewenius"}, {"authorId": "2149995914", "name": "Jörn O Schmidt"}, {"authorId": "98824056", "name": "Kristina Skierka"}, {"authorId": "100623552", "name": "O. Selomane"}, {"authorId": "3761483", "name": "U. Svedin"}, {"authorId": "12945805", "name": "P. Yillia"}], "citations": [{"paperId": "b8a5d457ce14bec697318dad121da5df38997436", "title": "Sustainable product development in aeroengine manufacturing: challenges, opportunities and experiences from GKN Aerospace Engine System"}, {"paperId": "8223dfb9681128bd60317f78191a9328b449613b", "title": "Assessment of Technical and Economic Potential of Urban Rooftop Solar Photovoltaic Systems in Lithuania"}, {"paperId": "9b00cc9527c6a01944486285cb3564bc89d3757f", "title": "The nexus between digitalization and sustainability: A scientometrics analysis"}, {"paperId": "0afbfca5631dbb0d0acfbc40ee5fd8280336c7fd", "title": "Evolution of BIM to DTs: A Paradigm Shift for the Post-Pandemic AECO Industry"}, {"paperId": "ae4029020840db40b9bfc248f68b5ae63c128109", "title": "The role of digital transformation in improving customer satisfaction: An empirical study on Egyptian hotels"}, {"paperId": "281b72009c2b31c58a71259dfe545a990e759983", "title": "Detection of Cause-Effect Relationships in Life Cycle Sustainability Assessment Based on an Engineering Graph"}, {"paperId": "01cf7479d97e5058f29f708001ce836b231fada2", "title": "Waste Landscape: Urban Regeneration Process for Shared Scenarios"}, {"paperId": "654c297d178d7aeb6ca75cf7155bdd4bd3f49a64", "title": "Increased Digital Resource Consumption in Higher Educational Institutions and the Artificial Intelligence Role in Informing Decisions Related to Student Performance"}, {"paperId": "e64f33b60dde7f299ccec6a21b0fcdf9a9baaf0e", "title": "Assessment of the Impact of Cloud Technologies on Social Life in the Era of Digitalization"}, {"paperId": "aeb4e001ce36a426026226bcbbc30e031a726d51", "title": "Carbon Lock-In and Contradictions—Applied Guide to Academic Teaching of Mexico’s Energy Transition"}, {"paperId": "ed40d693b95c0d5e146569b51ae55badbb19e850", "title": "Digital solutions for continued operation of WRRFs during pandemics and other interruptions"}, {"paperId": "5e7ba33042c3c38b641858bc920ac79b86dbbfe9", "title": "SUSTAINABILITY THROUGH THE DIGITALIZATION: EXPLORING POTENTIALS AND DESIGNING VALUE CO-CREATION ARCHITECTURES FOR PRODUCT-SERVICE-SYSTEMS"}, {"paperId": "85fc2cf4af8017e3e22256ad1ae37499be359fd1", "title": "Carbon Lock-in and Contradictions – Teaching Mexico’s Energy Transition"}, {"paperId": "f4bd25011bdff2613f4f01bc2a157b53a1d2501f", "title": "Fostering sustainable development through the European Digital Single Market"}, {"paperId": "cb551bfce708acdd2eee62e9671e363a01fa221f", "title": "The role of sustainability in media and communication studies’ curricula throughout Europe"}, {"paperId": "cce8d2204c422eba5d77f6b823baf4e5402bd63c", "title": "Energy Consumption in Central and Eastern Europe (CEE) Households in the Platform Economics"}, {"paperId": "8e3dd6e8b851d5cecf6ec37abc347f8e0c8044d7", "title": "The Need for New Product Development Capabilities from Digitalization, Sustainability, and Servitization Trends"}, {"paperId": "916e1141e550e9eb95cad0b961a4f8d8c402db8f", "title": "On the Advanced Methodology of Risk-Based System Resilience Analysis"}, {"paperId": "8a8d15436819037b1201491ea377f12981694e10", "title": "Water research in support of the Sustainable Development Goal 6: A case study in Belgium"}, {"paperId": "c2838142c8513111a50a7820e1151659dc5c34a5", "title": "COVID-19 and the role of information processing"}, {"paperId": "425f02e4896ef4b8c396cfcdb5e726c1c6489201", "title": "B.S. Daya Sagar, Qiuming Cheng and Frits Agterberg: Handbook of Mathematical Geosciences: Fifty Years of IAMG"}, {"paperId": "1bebb3e3578d0056c74b1140d80238e2e6816f70", "title": "The Routledge Handbook of Smart Technologies An Economic and Social Perspective"}, {"paperId": "09ec5e55a4ba4826a1ce9527606fe1744188b4ab", "title": "Strategy of Overall Social Development: The Challenge of Sustainability"}, {"paperId": "7c5d810e8063172f7dbfad0a8749a8529c87007b", "title": "Digital Transformation and the 2030 Sustainable Development Agenda"}, {"paperId": "e67e0244a1c4809b44d62e95c1f0e17b69699591", "title": "Emissions Gap Report 2018"}]}
