{"paperId": "9448ec75af74cfcf446729daf97fe8d5a2daeebf", "publicationVenue": {"id": "1a5858d9-edfe-4a1b-ae39-60020748678f", "name": "ACM Transactions on Architecture and Code Optimization (TACO)", "type": "journal", "alternate_names": ["ACM Transactions on Architecture and Code Optimization", "ACM Trans Archit Code Optim", "ACM Trans Archit Code Optim (TACO"], "issn": "1544-3566", "url": "http://www.acm.org/taco", "alternate_urls": ["http://portal.acm.org/taco/", "https://taco.acm.org/"]}, "title": "ECS", "abstract": "Emerging nonvolatile memories (NVMs) suffer from low write endurance, resulting in early cell failures (hard errors), which reduce memory lifetime. It was recognized early on that conventional error-correcting codes (ECCs), which are designed for soft errors, are a poor choice for addressing hard errors in NVMs. This led to the evolution of hard error correction schemes like dynamically replicated memory (DRM), error-correcting pointers (ECPs), SAFER, FREE-p, PAYG, and Zombie memory to improve NVM lifetime. Whereas these approaches made significant inroads in addressing hard errors and low memory lifetime in NVMs, overcoming the challenges of underutilization of error-correcting resources and/or implementation overhead (e.g., codec latency, hardware support) remain areas of active research and development. This article proposes error-correcting strings (ECSs) as a high-utilization, low-latency solution for hard error correction in single-/multi-/triple-level cell (SLC/MLC/TLC) NVMs. At its core, ECS adopts a base-offset approach to store pointers to the failed memory cells; in this work, base is the address of the first failed cell in a memory block and offsets are the distances between successive failed cells in that memory block. Unlike ECP, which uses fixed-length pointers, ECS uses variable-length offsets to point to the failed cells, thereby realizing more pointers to tolerate more hard errors per memory block. Further, this article proposes eXtended-ECS (XECS), a page-level error correction architecture, which employs dynamic on-demand ECS allocation and opportunistic pattern-based data compression to improve NVM lifetime by 2× over ECP-6 for comparable overhead and negligible impact to system performance. Finally, this article demonstrates that ECS is a drop-in replacement for ECP to extend the lifetime of state-of-the-art ECP-based techniques like PAYG and Zombie memory; ECS is also compatible with MLC/TLC NVMs, where it complements drift-induced soft error reduction techniques like ECC and incomplete data mapping to simultaneously extend NVM lifetime.", "venue": "ACM Transactions on Architecture and Code Optimization (TACO)", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2017-12-13", "journal": {"name": "ACM Transactions on Architecture and Code Optimization (TACO)", "pages": "1 - 29", "volume": "14"}, "authors": [{"authorId": "13988650", "name": "S. Swami"}, {"authorId": "3025529", "name": "Poovaiah M. Palangappa"}, {"authorId": "1725437", "name": "K. Mohanram"}], "citations": [{"paperId": "46244f815c428642cb72c8c78169cf588d459193", "title": "A survey on techniques for improving Phase Change Memory (PCM) lifetime"}, {"paperId": "b17bd08744886622c8a2fbae6ea1acc9a43b7747", "title": "IRO: Integrity and Reliability Enhanced Ring ORAM"}, {"paperId": "699f489ac62e3b22fe1d047d83ff4754838e1ec4", "title": "Binary Star: Coordinated Reliability in Heterogeneous Memory Systems for High Performance and Scalability"}, {"paperId": "57f81a5bbda92f0ddf8101d9f4d2512f3c609ef8", "title": "Storage Class Memory: Principles, Problems, and Possibilities"}, {"paperId": "2af32e426428f724f33557e95423156982bff4e6", "title": "ASSET: Architectures for Smart Security of Non-Volatile Memories"}, {"paperId": "337e89c579c0f49dfcb5588942dcd1b83362dce2", "title": "EFFICIENT SECURITY IN EMERGING MEMORIES"}]}
