{"paperId": "944d104537eda8f14614d3a5722cc71a274919bf", "publicationVenue": {"id": "29df4b17-9a16-4a4c-94a6-002f52e628b4", "name": "International Conference on Parallel Processing", "type": "conference", "alternate_names": ["ICPP", "Int Conf Parallel Process", "IEEE Int Conf Pulsed Power", "IEEE International Conference on Pulsed Power"], "url": "http://www.wikicfp.com/cfp/program?id=1447"}, "title": "Joint Optimization of MapReduce Scheduling and Network Policy in Hierarchical Clouds", "abstract": "As MapReduce is becoming increasingly popular in large-scale data analysis, there is a growing need for moving MapReduce into multi-tenant clouds. However, there is an important challenge that the performance of MapReduce applications can be significantly influenced by the time-varying network bandwidth in a shared cluster. Although a few recent studies improve MapReduce performance by dynamic scheduling to reduce the shuffle traffic, most of them do not consider the impact by widely existing hierarchical network architectures in data centers. In this paper, we propose and design a Hierarchical topology (Hit) aware MapReduce scheduler to minimize overall data traffic cost and hence to reduce job execution time. We first formulate the problem as a Topology Aware Assignment (TAA) optimization problem while considering dynamic computing and communication resources in the cloud with hierarchical network architecture. We further develop a synergistic strategy to solve the TAA problem by using the stable matching theory, which ensures the preference of both individual tasks and hosting machines. Finally, we implement the proposed scheduler as a pluggable module on Hadoop YARN and evaluate its performance by testbed experiments and simulations. The experimental results show Hit-scheduler can improve job completion time by 28% and 11% compared to Capacity Scheduler and Probabilistic Network-Aware scheduler, respectively. Our simulations further demonstrate that Hit-scheduler can gain the traffic cost by 38% at most and improve the average shuffle flow traffic time by 32% compared to Capacity scheduler.", "venue": "International Conference on Parallel Processing", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2018-08-13", "journal": {"name": "Proceedings of the 47th International Conference on Parallel Processing"}, "authors": [{"authorId": "2007708782", "name": "Donglin Yang"}, {"authorId": "39164201", "name": "Wei Rang"}, {"authorId": "1778706", "name": "Dazhao Cheng"}], "citations": [{"paperId": "1f5898d64da5ec368d4482d99c5df16c4df49713", "title": "Dynamic Resource Provisioning for Iterative Workloads on Apache Spark"}, {"paperId": "cb63e4b11eaa6963e05f548203af5414ee7a9da4", "title": "Data Life Aware Model Updating Strategy for Stream-based Online Deep Learning"}, {"paperId": "d8ff47706f6807c28907d64e2ed66eb554a041f5", "title": "Elastic Executor Provisioning for Iterative Workloads on Apache Spark"}, {"paperId": "eeffdd21dc8f96f28fe49b5e8082346e6cde3f18", "title": "A Network-aware and Partition-based Resource Management Scheme for Data Stream Processing"}, {"paperId": "7f20f3c8f9636480f65814620bd983952654ac91", "title": "Delay-Optimal Traffic Engineering through Multi-agent Reinforcement Learning"}]}
