{"paperId": "94592dbddf3130e6950cb5b7c238f796ae1cecae", "publicationVenue": {"id": "89a4440a-b3bf-478d-b47e-c567826fae48", "name": "Accident Analysis and Prevention", "type": "journal", "alternate_names": ["Accident Analysis & Prevention", "Accid Anal  Prev", "Accid Anal Prev"], "issn": "0001-4575", "url": "http://www.elsevier.com/wps/find/journaldescription.cws_home/336/description", "alternate_urls": ["http://www.sciencedirect.com/science/journal/00014575"]}, "title": "Review on big data applications in safety research of intelligent transportation systems and connected/automated vehicles.", "abstract": null, "venue": "Accident Analysis and Prevention", "year": 2020, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2020-09-04", "journal": {"name": "Accident; analysis and prevention", "pages": "\n          105711\n        ", "volume": "146"}, "authors": [{"authorId": "1931636390", "name": "Yanqi Lian"}, {"authorId": "2116725810", "name": "Guoqing Zhang"}, {"authorId": "2108382647", "name": "Jaeyoung Lee"}, {"authorId": "2562840", "name": "Helai Huang"}], "citations": [{"paperId": "2d1233264e1f0255336ad5e61c4bab03c0504acd", "title": "From sky to road: Incorporating the satellite imagery into analysis of freight truck-related crash factors."}, {"paperId": "d40220cc2c63d7bd5e582fce1cf4c352dd72d191", "title": "Reinforcement learning approach to develop variable speed limit strategy using vehicle data and simulations"}, {"paperId": "cc790e5ba40fbe52321193dbfac34e804ab85b83", "title": "Reference Tracking Optimization With Obstacle Avoidance via Task Prioritization for Automated Driving"}, {"paperId": "a4b5a6a0b8b38bb73c7fc16b9420c32a25b25fe3", "title": "Research on speed predictive control system of intelligent connected vehicle based on V2X"}, {"paperId": "3a2c00c091f744618444b88d5ae86639b009e7d5", "title": "Understanding integration issues in intelligent transportation systems with IoT platforms, cloud computing, and connected vehicles"}, {"paperId": "e73ca79ac66340ffae48eda8a533fc1c40992e32", "title": "What Road Elements are More Important than Others for Safe Driving on Urban Roads?"}, {"paperId": "fcef34ed79688daed8681a0b07a3724c67c94569", "title": "MSND: Modified Standard Normal Deviate Incident Detection Algorithm for Connected Autonomous and Human-Driven Vehicles in Mixed Traffic"}, {"paperId": "aa8a557c8f4d63e166517dcfd11718c1de98bea4", "title": "Big Data Analytics architecture for intelligent transportation systems: A tunisian case study"}, {"paperId": "87edeebb292a7d8bbdc0cfb2d6d7ee806d04cbb2", "title": "Real-Time Cargo Loading Identification Based on Self-Powered Camera"}, {"paperId": "603639a88fb24e9d96c414c1d2151f7539553cc0", "title": "Cybersecurity regulatory challenges for connected and automated vehicles – State-of-the-art and future directions"}, {"paperId": "18bcd6e82e3413cea600c2d32015e7fc8e6227f9", "title": "Data-driven crash prediction by injury severity using a recurrent neural network model based on Keras framework"}, {"paperId": "baf1f22145300ebb334c73a139b73f8860edc176", "title": "A Natural Lane Changing Decision Model For Mixed Traffic Flow Based On Extreme Value Theory"}, {"paperId": "d51181bc7ff8ce57d019f221727ee41ec2d565c4", "title": "Modelling cybersecurity regulations for automated vehicles."}, {"paperId": "bee828052c52781d30910471e56f21c267e31f0e", "title": "Applications of Big Data technology in Intelligent Transportation System"}, {"paperId": "02bb2c73c3564509c21414cbe6618d3f96ba4e1a", "title": "Fuzzy logic and deep Q learning based control for traffic lights"}, {"paperId": "be642e5b6bc81660f34104646407293ad142fcc3", "title": "Quantifying the Impact of Deployments of Autonomous Vehicles and Intelligent Roads on Road Safety in China: A Country-Level Modeling Study"}, {"paperId": "27d7d96b62ecf5808fc960214b036d56eeeec47a", "title": "Data-driven approaches for road safety: A comprehensive systematic literature review"}, {"paperId": "1b426b1199c481fc5ab5dfe00a2697d33b958e3d", "title": "External benefits of a road transportation system with vehicle-to-everything communications"}, {"paperId": "0c64ed5a290be6707bb7a4b6a1dde54f8af529e7", "title": "Crash harm before and during the COVID-19 pandemic: Evidence for spatial heterogeneity in Tennessee"}, {"paperId": "bdff1062f1748de04a8a5c9e6401233c95a37e96", "title": "A Framework to Analyze Function Domains of Autonomous Transportation Systems Based on Text Analysis"}, {"paperId": "125cf98eb5e84c7f709749005b504d8fa7705681", "title": "A safety analysis method based on hazard pattern mining for single pilot operations air-ground task collaboration in commercial aircraft"}, {"paperId": "9ede362300628414f44270d2c37dc5742e4ef1ba", "title": "Media Influence, Trust, and the Public Adoption of Automated Vehicles"}, {"paperId": "af236ca78d17d790b180370bf8609c3254a75b5e", "title": "Review of Research on Road Traffic Operation Risk Prevention and Control"}, {"paperId": "fcae4db1c1b6f9f14683b064e1d68651191165ef", "title": "Fortifying Smart Transportation Security Through Public Blockchain"}, {"paperId": "6e7dc8d32dbb2a5c1eeb152329304608a2360221", "title": "Microscopic traffic models, accidents, and insurance losses"}, {"paperId": "2c85d230680de5d6b269c6ccaabe8bdf66498328", "title": "The Real-World Effects of Route Familiarity on Drivers’ Eye Fixations at Urban Intersections in Changsha, China"}, {"paperId": "cbad3ec971f5e2e7421006cb443e5d8520d4ec57", "title": "Human injury-based safety decision of automated vehicles"}, {"paperId": "7cf42c8505cf080bfba37c8356dfb4959cccf64c", "title": "Applications of Big Data Analytics in Traffic Management in Intelligent Transportation Systems"}, {"paperId": "da45004fda863e7ff41f7af527bdaf869fd94193", "title": "BDESF-ITS: Blockchain-Based Secure Data Exchange and Storage Framework for Intelligent Transportation System"}, {"paperId": "c1146e1ac39a22b92ca498ba43570e1880fc41d2", "title": "Comprehensive driver behaviour review: Taxonomy, issues and challenges, motivations and research direction towards achieving a smart transportation environment"}, {"paperId": "efe88fab0b778b0d971ec1c55ef921fd7ee789c7", "title": "Accurate road information warning framework for intelligent vehicles based on resource allocation"}, {"paperId": "66d8cddb9de298c6e9936625eabf423de44ee3e8", "title": "Highlighting the Challenges of Big Data Analytics Implementation in Mainstream Industries"}, {"paperId": "1d52dc8223ee30ef7eb106840127511568b4bf48", "title": "Road safety under the environment of intelligent connected vehicles."}, {"paperId": "fd8a17ce1711e8ecbdf27dd83a49aedeb7f56f34", "title": "A review on supervised machine learning for accident risk analysis: Challenges in Malaysia"}, {"paperId": "e14895f95fd7d37e2877b9b18a969e0853ffaa9e", "title": "RETRACTED ARTICLE: Modular input processing scheme for object detection using computer vision in intelligent transportations"}, {"paperId": "83ef023a6651ab60fe115223dbbb6cc83f75dc67", "title": "The derived demand for advertising expenses and implications on sustainability: a comparative study using deep learning and traditional machine learning methods"}, {"paperId": "210239ef09ca99045e9574fd87c2167d66fa466d", "title": "Understanding the potential of emerging digital technologies for improving road safety."}, {"paperId": "ec9aff54ff329d24bbeff92e06f331ea5f8e908e", "title": "A conceptual system dynamics model for cybersecurity assessment of connected and autonomous vehicles."}, {"paperId": "e76578aae919707a95daa82c5364d617b7567919", "title": "Improving graph neural network via complex-network-based anchor structure"}, {"paperId": "b9c29785747b20e8eefaf209eed7d0039bcc9083", "title": "Big data in safety management: An overview"}, {"paperId": "be05eaeed59131e1211aa0229019b316328a9143", "title": "Simulation of Autoregressive Integrated Moving Average- Generalized Autoregressive Conditional Heteroscedasticity (ARIMA-GARCH) to Forecast Traffic Flow"}, {"paperId": "017324b274bb0e0338484723e4fdde85e7b5c0f1", "title": "A Comparative Study of MongoDB, ArangoDB and CouchDB for Big Data Storage"}, {"paperId": "485bd31c18895a7d6bb62427ab394f63749f41c2", "title": "Machine Learning-Aided Management of Motorway Facilities Using Single-Vehicle Accident Data"}, {"paperId": "0e984f2ca72e870fe7af4c0ae5d558bd9d38144c", "title": "Urban Food Takeaway Vitality: A New Technique to Assess Urban Vitality"}, {"paperId": "d1782e2de91040fadb6d3fa333dc71e0919521c8", "title": "Stated acceptance and behavioral responses of drivers towards innovative connected vehicle applications."}, {"paperId": "4283c4dcac0b1639efc66653e524e495a89cb46e", "title": "A data-driven feature learning approach based on Copula-Bayesian Network and its application in comparative investigation on risky lane-changing and car-following maneuvers."}, {"paperId": "1af0330e29d45ca5f3c0fe2fbc14146e32a876ee", "title": "Finding Pluto: An Analytics-Based Approach to Safety Data Ecosystems"}, {"paperId": "68f8ca9a402628a5d0134ce760771534bdbf2ff0", "title": "Development of a robust hybrid framework for evaluating and ranking smartification measures for sustainable mobility: A case study of Sicilian roadways, Southern Italy"}, {"paperId": "c16c98668834fd383131a6e7cbb342af2f75f42e", "title": "2023 A Trafﬁc Risk Avoidance Method For Mixed Trafﬁc Flow Based On Extreme Value Theory"}, {"paperId": "7d179a8cd33fc1d0f74f478eed75ef7172ee664e", "title": "Deep Reinforcement Learning Modeling of a V2V Communication-Based Bike Avoidance Protocol for Increased Vehicular Flow"}, {"paperId": "5e2d8c7514082360c9ef90c9b5a28193a458d959", "title": "Intelligent Transport System using IoT-V2X: Communication Technologies, Security Issues, Challenges and Countermeasures"}, {"paperId": "d3dc7a09fe4fa9e594602c2906f661dad06a52be", "title": "Distributed Formation Control for Managing CAV Overtaking and Intersection Maneuvers"}, {"paperId": "ee7587284bf0c75f2a1cc3fe0c1033c3b9d4291d", "title": "Self-Adaptable Infrastructure Management for Analyzing the Efficiency of Big Data Stores"}, {"paperId": "9c15be088011cbb458e4dfaa11dc0c8e65b78b40", "title": "Big Data Analytics and Intelligent Transportation Systems"}]}
