{"paperId": "945daaf2994015468ef7c4ed54e60ee53f8f6dbe", "publicationVenue": {"id": "696243a5-4e9a-411c-bcf5-13467acc4901", "name": "Hydrology and Earth System Sciences", "type": "journal", "alternate_names": ["Hydrol Earth Syst Sci"], "issn": "1027-5606", "url": "https://www.hydrology-and-earth-system-sciences.net/", "alternate_urls": ["http://www.copernicus.org/EGS/hess/hess.html"]}, "title": "Assessment of simulated soil moisture from WRF Noah, Noah-MP, and CLM land surface schemes for landslide hazard application", "abstract": "Abstract. This study assesses the usability of Weather Research and Forecasting (WRF)\nmodel simulated soil moisture for landslide monitoring in the Emilia Romagna region, northern Italy, during the 10-year period between 2006 and 2015. In particular, three advanced land surface model (LSM) schemes (i.e. Noah, Noah-MP, and CLM4) integrated with the WRF are used to provide detailed multi-layer soil moisture information. Through the temporal evaluation with the single-point in situ soil moisture observations, Noah-MP is the only scheme that is able to simulate the large soil drying phenomenon close to the observations during the dry season, and it also has the highest correlation coefficient and the lowest RMSE at most soil layers. It is also demonstrated that a single soil moisture sensor located in a plain area has a high correlation with a significant proportion of the study area (even in the mountainous region 141 km away, based on the WRF-simulated spatial soil moisture information). The evaluation of the WRF rainfall estimation shows there is no distinct difference among the three LSMs, and their performances are in line with a published study for the central USA. Each simulated soil moisture product from the three LSM schemes is then used to build a landslide prediction model, and within each model, 17 different exceedance probability levels from 1 % to 50 % are adopted to determine the optimal threshold scenario (in total there are 612 scenarios). Slope degree information is also used to separate the study region into different groups. The threshold evaluation performance is based on the landslide forecasting accuracy using 45 selected rainfall events between 2014 and 2015. Contingency tables, statistical indicators, and receiver operating characteristic analysis for different threshold scenarios are explored. The results have shown that, for landslide monitoring, Noah-MP at the surface soil layer with 30 % exceedance probability provides the best landslide monitoring performance, with its hit rate at 0.769 and its false alarm rate at 0.289.\n", "venue": "Hydrology and Earth System Sciences", "year": 2019, "fieldsOfStudy": ["Environmental Science"], "publicationTypes": null, "publicationDate": "2019-03-22", "journal": {"name": "Hydrology and Earth System Sciences"}, "authors": [{"authorId": "4448033", "name": "L. Zhuo"}, {"authorId": "48382167", "name": "Q. Dai"}, {"authorId": "2658132", "name": "Dawei Han"}, {"authorId": "9101036", "name": "N. Chen"}, {"authorId": "1848092", "name": "Binru Zhao"}], "citations": [{"paperId": "ffeb033628b7875b5a703a66aaac790780bb3ae7", "title": "Analysis of Effects of Spatial Distributed Soil Properties and Soil Moisture Behavior on Hourly Streamflow Estimate through the Integration of SWAT and LSM"}, {"paperId": "9498eda53dc6e7c400c69f93a2bb31eabfc2dbf8", "title": "Downscaled GRACE/GRACE-FO observations for spatial and temporal monitoring of groundwater storage variations at the local scale using machine learning"}, {"paperId": "e070c62375181c425d9f8742666c997dd232faa6", "title": "High-resolution WRF forecasts in the SmartAQ system: Evaluation of the meteorological forcing used for PMCAMx predictions in an urban area"}, {"paperId": "1f9d3dea37746090489208f824da3b4c5f2116cc", "title": "Modernizing the open-source community Noah with multi-parameterization options (Noah-MP) land surface model (version 5.0) with enhanced modularity, interoperability, and applicability"}, {"paperId": "22ee2af14e34f1cdc36d5a06dafd13c99eddd085", "title": "Impact of alternative soil data sources on the uncertainties in simulated land-atmosphere interactions"}, {"paperId": "53e93183345981cfdb077ade450e47d3c9436c66", "title": "Assessing the numerical weather prediction (NWP) model in estimating extreme rainfall events: A case study for severe floods in the southwest Mediterranean region, Turkey"}, {"paperId": "17df88b86930db8f7ee1e0faacdc61e5ecf26eba", "title": "Recent advancements of landslide hydrology"}, {"paperId": "1b0f6b6fff3526449775db4dd196778b395dc198", "title": "Performance of the WRF model in simulating convective rainfall events in the humid subtropical monsoon climate region—Poyang Lake basin"}, {"paperId": "ff608cfc76254cca4a95321764a6e8f28e927dc4", "title": "From empirically to physically based early warning predictions of rainfall-induced landslides in silty volcanic soils: the Lattari Mountains case study"}, {"paperId": "3332f869ec83622b34b226ee7bf3f296ed634d46", "title": "Assessment of Land Surface Schemes from the WRF-Chem for Atmospheric Modeling in the Andean Region of Ecuador"}, {"paperId": "2c5401b23e22a0b239b12c127a4227d3c5d3efeb", "title": "Assessing the maximum potential cooling benefits of irrigation in Australia during the “Angry Summer” of 2012/2013"}, {"paperId": "fe797e537f0bfe48fafc1148ec07a9736c4d2876", "title": "Performance of Seven Land Surface Schemes in the WRFv4.3 Model for Simulating Precipitation in the Record‐Breaking Meiyu Season Over the Yangtze–Huaihe River Valley in China"}, {"paperId": "9221ffcc9aa6cfdffb89c0dd1075ab734791f506", "title": "Developing spin-up time framework for WRF extreme precipitation simulations"}, {"paperId": "bfec2332cb54a72518f273893542f06aa3355b39", "title": "Prototype of an IoT-Based Low-Cost Sensor Network for the Hydrological Monitoring of Landslide-Prone Areas"}, {"paperId": "4fd6a348a523d47201b4d2e3af495716a13a0cef", "title": "Introducing Narclim1.5: Evaluation and Projection of Climate Extremes for Southeast Australia"}, {"paperId": "0f8bdc88a7be7a2417556d06d76b46398cf2783d", "title": "The effects of soil representation in WRF/CLM on the atmospheric moisture budget"}, {"paperId": "34cf3aeadbb7aee82dd80854784272f4eeeb4d16", "title": "7 February Chamoli (Uttarakhand, India) Rock-Ice Avalanche Disaster: Model-Simulated Prevailing Meteorological Conditions"}, {"paperId": "8ece8569809a8e35716d9d16afbac438f053a443", "title": "Global Evaluation of the Noah‐MP Land Surface Model and Suggestions for Selecting Parameterization Schemes"}, {"paperId": "5c5b9a7181155db42d26ae29054b5868fb8cfa5a", "title": "Prediction of soil moisture and rainfall induced landslides: A comparison of several PBL parameters in the WRF model"}, {"paperId": "2e373e5e4bb8bff9bb4c2f56e4e0a8e1a3da1605", "title": "Impact of Noah-LSM Parameterizations on WRF Mesoscale Simulations: Case Study of Prevailing Summer Atmospheric Conditions over a Typical Semi-Arid Region in Eastern Spain"}, {"paperId": "1928b9b58b09dd3a0a6eaab6a6dde76bfefa4a67", "title": "An assessment of statistical interpolation methods suited for gridded rainfall datasets"}, {"paperId": "16a23fb61ea55e00ce3ddcfbb4184a4639222777", "title": "iHydroSlide3D v1.0: an advanced hydrological-geotechnical model for hydrological simulation and three-dimensional landslide prediction"}, {"paperId": "3afebc44b53e26b292834b537b92f6148beee6bd", "title": "Simulated or measured soil moisture: Which one is adding more value to regional landslide early warning?"}, {"paperId": "10f3c06aeda75aa22157f5270ed48acdda95fbf8", "title": "WRF v.3.9 sensitivity to land surface model and horizontal resolution changes over North America"}, {"paperId": "147a452800e0c5b69a252d477c545e62a308754c", "title": "Reanalysis of Soil Moisture Used for Rainfall Thresholds for Rainfall-Induced Landslides: The Italian Case Study"}, {"paperId": "09b748a42ab209b5672f1c27d85db05f66cce07a", "title": "Atmospheric triggering conditions and climatic disposition of landslides in Kyrgyzstan and Tajikistan at the beginning of the 21st century"}, {"paperId": "659d36392cdd433823ded63d3c37268e05f97535", "title": "Assessing the potential of different satellite soil moisture products in landslide hazard assessment"}, {"paperId": "104dcbb5a5400252b62b622f57bc1040b1f432cb", "title": "Improve the Performance of the Noah‐MP‐Crop Model by Jointly Assimilating Soil Moisture and Vegetation Phenology Data"}, {"paperId": "e98fbdccffcc74c81a369726a13c899894ef2867", "title": "Impacts of climate change on terrestrial hydrological components and crop water use in the Chesapeake Bay watershed"}, {"paperId": "b522ea493448d7a487595edcbbfb8f87dd214baa", "title": "An inverse dielectric mixing model at 50 MHz that considers soil organic carbon"}, {"paperId": "db96511bd9d81920e40cc3630aa883f0d9df8d3a", "title": "To develop a progressive multimetric configuration optimisation method for WRF simulations of extreme rainfall events over Egypt"}, {"paperId": "a05bf03632ddfa486e94f00a987f8a5b43e9e9c0", "title": "A Retrospective and Prospective Examination of the 1960s U.S. Northeast Drought"}, {"paperId": "3a0ea4bddda044a099f63ccffc8dca69cd51ff6a", "title": "The Role of Soil Texture in Local Land Surface–Atmosphere Coupling and Regional Climate"}, {"paperId": "c82bb3b836d216a151666dcbfaba13ed0c227af4", "title": "Definition of 3D rainfall thresholds to increase operative landslide early warning system performances"}, {"paperId": "9b7a2aa10404e5ad509b1b5b6d2e7f7b456a7cb3", "title": "Quantifying Contributions of Uncertainties in Physical Parameterization Schemes and Model Parameters to Overall Errors in Noah‐MP Dynamic Vegetation Modeling"}, {"paperId": "b2bc5a8a2a03b2025e3de5e6b5e6b03328080423", "title": "Modeling of Heavy Rainfall Triggering Landslide Using WRF Model"}, {"paperId": "d55f4a0be5d1febba67ed32166a570241b20f46d", "title": "Soil moisture sensor network design for hydrological applications"}, {"paperId": "31ea02a3fc27b462905c35547e0f09e7190a8b50", "title": "Atmospheric triggering conditions and climatic disposition of landslides in Kyrgyzstan and Tajikistan at the beginning of the 21st century"}, {"paperId": "463bf664fd29bb7217b2aedc008191314b20848c", "title": "Evaluating Changes in Terrestrial Hydrological Components Due to Climate Change in the Chesapeake Bay Watershed"}]}
