{"paperId": "946f0f21fc154b7f65ffa7d6ed2c5e71e5b1e9eb", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Bee System-Based Self Configurable Optimized Resource Allocation Technique in Device-to-Device (D2D) Communication Networks", "abstract": "With the exponential growth of mobile devices and high capabilities of intelligence, global communication network traffic is expected to experience remarkable growth in the next few years, as it leads us to poor network experience. The Device-to-Device (D2D) is a prominent solution to further expand the user experience and network performance. To improve it many nature-inspired computing algorithms are widely used. In line with this, we use swarm-based algorithms for network performance improvement. In this paper, we propose a swarm optimization-based resource allocation methodology for D2D communication, especially since we are focusing on the bee fly pattern to optimize the resource available resources within the network’s proximity area. Where all bees are working together to find the best optimal availability of the network’s services, hereafter mobile users get served with a respective set of resources. If the performance is not up to the pre-defined threshold value then the system adds another set of available network resources and relay nodes. It leads to relay-assisted D2D pair communication based on the bee fly pattern. It improves the D2D mobile pair’s user experience in terms of energy, delay, and mobility support. To validate our results we compare our outcome with state-of-the-art works and provide detailed observations subject to various listed parameters.", "venue": "IEEE Access", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "3039-3053", "volume": "12"}, "authors": [{"authorId": "2156723841", "name": "Wisam Hayder Mahdi"}, {"authorId": "3097858", "name": "N. Tașpinar"}], "citations": [{"paperId": "a5bc898a09b0f63b84427df46ffd462d6feed068", "title": "Interference Management Based on Meta-Heuristic Algorithms in 5G Device-to-Device Communications"}]}
