{"paperId": "948643af0d1677b51bae2035c7a73c100ddcc525", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Grand Challenges of Resilience: Autonomous System Resilience through Design and Runtime Measures", "abstract": "A set of about 80 researchers, practitioners, and federal agency program managers participated in the NSF-sponsored Grand Challenges in Resilience Workshop held on Purdue campus on March 19-21, 2019. The workshop was divided into three themes: resilience in cyber, cyber-physical, and socio-technical systems. About 30 attendees in all participated in the discussions of cyber resilience. This article brings out the substantive parts of the challenges and solution approaches that were identified in the cyber resilience theme. In this article, we put forward the substantial challenges in cyber resilience in a few representative application domains and outline foundational solutions to address these challenges. These solutions fall into two broad themes: resilience-by-design and resilience-by-reaction. We use examples of autonomous systems as the application drivers motivating cyber resilience. We focus on some autonomous systems in the near horizon (autonomous ground and aerial vehicles) and also a little more distant (autonomous rescue and relief). \nFor resilience-by-design, we focus on design methods in software that are needed for our cyber systems to be resilient. In contrast, for resilience-by-reaction, we discuss how to make systems resilient by responding, reconfiguring, or recovering at runtime when failures happen. We also discuss the notion of adaptive execution to improve resilience, execution transparently and adaptively among available execution platforms (mobile/embedded, edge, and cloud). For each of the two themes, we survey the current state, and the desired state and ways to get there. We conclude the paper by looking at the research challenges we will have to solve in the short and the mid-term to make the vision of resilient autonomous systems a reality.", "venue": "arXiv.org", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2019-12-25", "journal": {"name": "ArXiv", "volume": "abs/1912.11598"}, "authors": [{"authorId": "1679009", "name": "S. Bagchi"}, {"authorId": "1732805", "name": "V. Aggarwal"}, {"authorId": "2228303", "name": "S. Chaterji"}, {"authorId": "1782350", "name": "F. Douglis"}, {"authorId": "2418564", "name": "A. E. Gamal"}, {"authorId": "2111759643", "name": "Jiawei Han"}, {"authorId": "2190870", "name": "B. Henz"}, {"authorId": "1918783480", "name": "Henry Hoffmann"}, {"authorId": "39400201", "name": "S. Jana"}, {"authorId": "48460781", "name": "Milind Kulkarni"}, {"authorId": "1774176", "name": "F. Lin"}, {"authorId": "2072212", "name": "K. Marais"}, {"authorId": "143615345", "name": "Prateek Mittal"}, {"authorId": "1891624", "name": "Shaoshuai Mou"}, {"authorId": "2948429", "name": "Xiaokang Qiu"}, {"authorId": "1690788", "name": "G. Scutari"}], "citations": [{"paperId": "0acd6d5dfdb0f89fdbaed0505e1830f73d926de8", "title": "JANUS: Benchmarking Commercial and Open-Source Cloud and Edge Platforms for Object and Anomaly Detection Workloads"}]}
