{"paperId": "9492e21b3c91754ab0b285d2c1ffcc2d95f42675", "publicationVenue": {"id": "1ee52b4c-8c57-4d60-aead-d9ef4255f1e9", "name": "IEEE Transactions on Automation Science and Engineering", "type": "journal", "alternate_names": ["IEEE Trans Autom Sci Eng"], "issn": "1545-5955", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=8856"}, "title": "Classification-Based Diverse Workflows Scheduling in Clouds", "abstract": "Cloud workflow scheduling is a typical combinatorial optimization problem and becomes more challenging due to the increasing diversity of workflows. However, current research employs the same scheduling strategy on diverse workflows. In fact, a scheduling strategy may perform well on one workflow but poorly on other workflows owning to the unique characteristics of each workflow. Therefore, in practical applications, selecting suitable scheduling strategies for diverse workflows is a critical issue. To solve it, this paper investigates a diverse workflows scheduling problem and presents a classification-based workflow scheduling framework, which includes workflow parser, workflow classifier, workflow scheduler, resource manager and workflow status tracker, to manage and schedule diverse workflows using suitable strategies. Based on the framework, we propose a classification-based workflow scheduling algorithm (CWSA) to optimize the economic cost of workflow execution under deadline constraints. We conduct the experiments using diverse workflow instances randomly generated from five types of real-world workflows to evaluate the proposed CWSA approach. The results demonstrate the superiority of CWSA compared with the state-of-the-art approaches. Note to Practitioners—Diverse workflows (i.e., many workflows with various types, such as Montage, LIGO and Cybernetics) in clouds are widespread. How to efficiently schedule them in cloud is very important. This paper formulates the diverse workflows scheduling problem and proposes a CWSA to solve it. The basic idea of CWSA is to select a suitable scheduling strategy for each workflow. Specifically, in CWSA, we design a classification neural network architecture that consists of a graph neural network and a fully connected neural network to classify each workflow to its suitable deadline distribute strategy by its characteristics and deadline constraint. Then CWSA obtains the sub-deadlines of tasks and assigns tasks to appropriate VMs (Virtual Machines). Furthermore, as an important factor in workflow scheduling, the transmission time between dependent tasks is introduced into the graph neural network, which improves the classification accuracy.", "venue": "IEEE Transactions on Automation Science and Engineering", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-01-01", "journal": {"name": "IEEE Transactions on Automation Science and Engineering", "pages": "630-641", "volume": "21"}, "authors": [{"authorId": "2129716517", "name": "Liwen Yang"}, {"authorId": "2152311358", "name": "Yuanqing Xia"}, {"authorId": "9782040", "name": "Xiaopu Zhang"}, {"authorId": "2111919700", "name": "Lingjuan Ye"}, {"authorId": "3311244", "name": "Yufeng Zhan"}], "citations": []}
