{"paperId": "949d3bd13d8ef2463c9369b7ed8a66c3f7b59955", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "A Robust Feature Extraction Model for Human Activity Characterization Using 3-Axis Accelerometer and Gyroscope Data", "abstract": "Human Activity Recognition (HAR) using embedded sensors in smartphones and smartwatch has gained popularity in extensive applications in health care monitoring of elderly people, security purpose, robotics, monitoring employees in the industry, and others. However, human behavior analysis using the accelerometer and gyroscope data are typically grounded on supervised classification techniques, where models are showing sub-optimal performance for qualitative and quantitative features. Considering this factor, this paper proposes an efficient and reduce dimension feature extraction model for human activity recognition. In this feature extraction technique, the Enveloped Power Spectrum (EPS) is used for extracting impulse components of the signal using frequency domain analysis which is more robust and noise insensitive. The Linear Discriminant Analysis (LDA) is used as dimensionality reduction procedure to extract the minimum number of discriminant features from envelop spectrum for human activity recognition (HAR). The extracted features are used for human activity recognition using Multi-class Support Vector Machine (MCSVM). The proposed model was evaluated by using two benchmark datasets, i.e., the UCI-HAR and DU-MD datasets. This model is compared with other state-of-the-art methods and the model is outperformed.", "venue": "Italian National Conference on Sensors", "year": 2020, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-12-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "20"}, "authors": [{"authorId": "35726521", "name": "R. Bhuiyan"}, {"authorId": "2034214843", "name": "Nadeem Ahmed"}, {"authorId": "2034243073", "name": "Md. Amiruzzaman"}, {"authorId": "2588057", "name": "Md. Rashedul Islam"}], "citations": [{"paperId": "03bb4eefe0fe012870fe058f101cefbe7a9fbb39", "title": "A multi-channel hybrid deep learning framework for multi-sensor fusion enabled human activity recognition"}, {"paperId": "b24da292daead130d1b901e00f213e7b27dcb9bb", "title": "Subsampled Randomized Hadamard Transformation-based Ensemble Extreme Learning Machine for Human Activity Recognition"}, {"paperId": "1c7389c7b2990acf6649052427b64d8ea7fbb9c1", "title": "A Generic Framework for Enhancing Autonomous Driving Accuracy through Multimodal Data Fusion"}, {"paperId": "0f3b7757ccb9004ddce3f9e9e12bc82d3b51f8e7", "title": "Activity recognition in rehabilitation training based on ensemble stochastic configuration networks"}, {"paperId": "95485b4bba676267a3b53fd480eb35fc3b1d9290", "title": "A novel optimized parametric hyperbolic tangent swish activation function for 1D-CNN: application of sensor-based human activity recognition and anomaly detection"}, {"paperId": "45c375853c33e9ee111dbd202dd37b7f232ed818", "title": "Smart Suspenders With Sensors and Machine Learning for Human Activity Monitoring"}, {"paperId": "37ec4e436591571738e3d7763ed1b2413bf2e72f", "title": "Human Activity Recognition Based on an Efficient Neural Architecture Search Framework Using Evolutionary Multi-Objective Surrogate-Assisted Algorithms"}, {"paperId": "38848f4ccf5edf4d9e447e8a6479566dccdcfd0e", "title": "Determination of Waste Management Workers’ Physical and Psychological Load: A Cross-Sectional Study Using Biometric Data"}, {"paperId": "4d02e382c3b8669c4c02e6d49cd3bbb95f5b5524", "title": "Studi Literatur Human Activity Recognition (HAR) Menggunakan Sensor Inersia"}, {"paperId": "fe63ade9983a92a451854164866f36009c690b2b", "title": "Toward Modeling Psychomotor Performance in Karate Combats Using Computer Vision Pose Estimation"}, {"paperId": "58601262aeb5416c8361ae2332d3d701e1de9dca", "title": "Human Action Recognition: A Paradigm of Best Deep Learning Features Selection and Serial Based Extended Fusion"}, {"paperId": "3612307052a580d66aec7ff2fe01b94cd16ca8df", "title": "Human Behavior Recognition Model Based on Feature and Classifier Selection"}, {"paperId": "14db48a5b51bbe7c69d3b97aaf2c33735550670e", "title": "Enhanced bag-of-words representation for human activity recognition using mobile sensor data"}, {"paperId": "9bd48d23554c61fc67c4a80cac1aac2a135662cb", "title": "Smart Management System for Hazardous Chemicals Park"}, {"paperId": "d79f88b915c42e607f0c9a2a69f2a96aea89c59c", "title": "A Real-Time 3-Dimensional Object Detection Based Human Action Recognition Model"}]}
