{"paperId": "94a4cbac4331ccde26ca796df31e3015f3212278", "publicationVenue": {"id": "13925159-5423-4d57-9ac9-3a05a713e0ef", "name": "ACM Transactions on Embedded Computing Systems", "type": "journal", "alternate_names": ["ACM Transactions in Embedded Computing Systems", "ACM Trans Embed Comput Syst"], "issn": "1539-9087", "url": "http://www.acm.org/pubs/contents/journals/tecs/", "alternate_urls": ["http://www.acm.org/tecs/", "http://portal.acm.org/tecs"]}, "title": "Edge Intelligence: Concepts, Architectures, Applications, and Future Directions", "abstract": "The name edge intelligence, also known as Edge AI, is a recent term used in the past few years to refer to the confluence of machine learning, or broadly speaking artificial intelligence, with edge computing. In this article, we revise the concepts regarding edge intelligence, such as cloud, edge, and fog computing, the motivation to use edge intelligence, and compare current approaches and analyze application scenarios. To provide a complete review of this technology, previous frameworks and platforms for edge computing have been discussed in this work to provide the general view of the basis for Edge AI. Similarly, the emerging techniques to deploy deep learning models at the network edge, as well as specialized platforms and frameworks to do so, are review in this article. These devices, techniques, and frameworks are analyzed based on relevant criteria at the network edge, such as latency, energy consumption, and accuracy of the models, to determine the current state of the art as well as current limitations of the proposed technologies. Because of this, it is possible to understand the current possibilities to efficiently deploy state-of-the-art deep learning models at the network edge based on technologies such as artificial intelligence accelerators, tensor processing units, and techniques that include federated learning and gossip training. Finally, the challenges of Edge AI are discussed in the work, as well as the future directions that can be extracted from the evolution of the edge computing and Internet of Things approaches.", "venue": "ACM Transactions on Embedded Computing Systems", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-01-26", "journal": {"name": "ACM Transactions on Embedded Computing Systems (TECS)", "pages": "1 - 41", "volume": "21"}, "authors": [{"authorId": "2056805608", "name": "Javier Mendez"}, {"authorId": "2088931510", "name": "Kay Bierzynski"}, {"authorId": "2246647479", "name": "Manuel P. Cuéllar"}, {"authorId": "50632332", "name": "D. Morales"}], "citations": [{"paperId": "a653ed9937bedfd2130f110359758045b6079237", "title": "Exploring Computing Paradigms for Electric Vehicles: From Cloud to Edge Intelligence, Challenges and Future Directions"}, {"paperId": "91b3cc4de146395ef0213994276eee78da77ae1e", "title": "From Cyber–Physical Convergence to Digital Twins: A Review on Edge Computing Use Case Designs"}, {"paperId": "c55e276e00a0246cd3f07664232a9c1f34feede2", "title": "A Deep Neural Network Translator for Edge Site Implementation"}, {"paperId": "2335a086c67594baa10e9fbb23e60af332a06305", "title": "An Edge-Cloud Collaboration Framework for Graph Processing in Smart Society"}, {"paperId": "552708dafe00a8f5b49ae8547ea371ddd05098ab", "title": "Enabling Resource-Efficient AIoT System With Cross-Level Optimization: A Survey"}, {"paperId": "9eb0ea29146840484ec89323152cf10b731f87ee", "title": "Edge AI-Assisted IoV Application for Aggressive Driver Monitoring: A Case Study on Public Transport Buses"}, {"paperId": "170dc4a563f78149629cf31095b001c89985df58", "title": "Opportunistic Digital Twin: an Edge Intelligence enabler for Smart City"}, {"paperId": "f115ac0a19c837eac433219b0a7afb820c9bca72", "title": "A framework for AI-based self-adaptive cyber-physical process systems"}, {"paperId": "c2a5a170f002d83cc7f16127f601d5a7c5e29aaf", "title": "Neural information coding for efficient spike-based image denoising"}, {"paperId": "41227e58a4fe545bebabbf0675d946b50e1132b2", "title": "Trainable quantization for Speedy Spiking Neural Networks"}, {"paperId": "8988bfcaa3b0af622331b3d6a98b959b8e3ebed0", "title": "Disclosing Edge Intelligence: A Systematic Meta-Survey"}, {"paperId": "c1b8aff36f6ee3d91a0f1f5085367fdfa4fd408e", "title": "Autonomous Vehicles Enabled by the Integration of IoT, Edge Intelligence, 5G, and Blockchain"}, {"paperId": "e568d4a4de021854c3ad239aa03f6872b2822531", "title": "Real-Time Finger-Writing Character Recognition via ToF Sensors on Edge Deep Learning"}, {"paperId": "071de7472b63d03dacb51eb239ca1e2f219584e2", "title": "Unlocking Metaverse-as-a-Service The three pillars to watch: Privacy and Security, Edge Computing, and Blockchain"}, {"paperId": "7ddca34f2a33afebdf49ad5ffa1b477992c0aadb", "title": "When machine learning meets Network Management and Orchestration in Edge-based networking paradigms"}, {"paperId": "6c756f75ad9e83b9dc85018de790f59f5b7a4c4e", "title": "Employing Edge Computing to Enhance Self-Defense Capabilities of IoT Devices"}, {"paperId": "fcd8db11a5b093584c1b047029485c9469a72266", "title": "An Investigation Into the Advancements of Edge-AI Capabilities for Structural Health Monitoring"}, {"paperId": "70e506c217050a502facdf1bd8e722be8b8c6a64", "title": "A Lightweight Deep Neural Network Using a Mixer-Type Nonlinear Vector Autoregression"}, {"paperId": "c456eaa5d0973c15fcec11be535b91a5b800f634", "title": "The Many Faces of Edge Intelligence"}]}
