{"paperId": "94ac4e435563cd38ad1174313c54dc56abee9cb5", "publicationVenue": {"id": "d80d58be-58fc-4181-a397-5ac6fd976a47", "name": "ACM Symposium on Applied Computing", "type": "conference", "alternate_names": ["Sel Area Cryptogr", "Int Conf Sel area Cryptogr", "International Conference on Selected areas in Cryptography", "ACM Symp Appl Comput", "Selected Areas in Cryptography", "Symposium on Applied Computing", "SAC", "Symp Appl Comput"], "url": "https://www.acm.org/publications", "alternate_urls": ["http://sacworkshop.org/"]}, "title": "Transformer based Early Classification for Real-time Human Activity Recognition in Smart Homes", "abstract": "Human activity recognition (HAR) plays a key role in intelligent systems. Ambient sensors are utilized to avoid privacy concerns and to collect data streams in a less intrusive manner in smart homes. In scenarios requiring immediate intervention, the systems must perform HAR in real-time. Since it is difficult to segment the exact transition point in real-time, data unrelated to the target activity can appear at the beginning of the time series, which we call unrefined data. It leads us to a new challenge that the HAR model recognizes a user's activity as early as possible with unrefined data. To explore the impact of unrefined data on real-time HAR, we design an experimental system that consists of a Transformer-based filtering network and an LSTM-based early classifier. We evaluate the experimental system with 3 public datasets collected on testbeds with ambient sensors installed. Our results reveal that unrefined data degrade HAR performance in terms of accuracy and earliness, and the use of the filtering network that filters out unrefined data improves recognition performance.", "venue": "ACM Symposium on Applied Computing", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2023-03-27", "journal": {"name": "Proceedings of the 38th ACM/SIGAPP Symposium on Applied Computing"}, "authors": [{"authorId": "2219707202", "name": "Tae-Hoon Lee"}, {"authorId": "2109873097", "name": "Hyunju Kim"}, {"authorId": "2205020306", "name": "Dongman Lee"}], "citations": [{"paperId": "a1df38c8bebe576f12d7a6df92cf5866d5bb6f30", "title": "DOO-RE: A dataset of ambient sensors in a meeting room for activity recognition"}, {"paperId": "076bcda20599f8ad9e71af8cc8b21a04ebb8d259", "title": "Empowering Participatory Research in Urban Health: Wearable Biometric and Environmental Sensors for Activity Recognition"}]}
