{"paperId": "94d2feb188eaca7cc312394143f05b9515ae65a3", "publicationVenue": null, "title": "Sensor data modeling with Bayesian networks", "abstract": "This research aims to extract knowledge of sensors behavior resorting to Bayesian networks (BNs) and dynamic Bayesian networks (DBNs), a time-based BN version. These two types of models belong to the group of probabilistic graphical models (PGMs). These graphical models can be very useful to get insights from data in order to improve sensor capabilities in the industry of fire detection systems, since it can provide the conditional dependence structure among various sensor variables. Relevant sensors with fire alerts were selected and studied at device level. We conduct a data fusion analysis since we deal with heterogeneous data sources, Remote Alert (RA) with sensor states and Condition Monitoring (CM) with numerical data. To achieve an accurate fusion of the data, a pipeline was designed to align both sources of data in a regular time interval. Furthermore, a change point detection (CPD) method was used to discretize the numerical variables. In addition, one-hot encoding was used to create binarized datasets and combine all data (RA+CM). Our modeling helps understanding the dependencies among the sensor variables, highlighting that individual devices of the same type can have a very different probabilistic behavior along the time, probably due to be installed in distinct regions. Moreover, the models helped capturing strange probabilistic sensor behavior such as a low probability of a NORMAL state happening given that states FIRE, WARNING and TROUBLE did not happen.", "venue": "2022 IEEE International Conference on Industry 4.0, Artificial Intelligence, and Communications Technology (IAICT)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-07-28", "journal": {"name": "2022 IEEE International Conference on Industry 4.0, Artificial Intelligence, and Communications Technology (IAICT)", "pages": "261-267"}, "authors": [{"authorId": "2185261037", "name": "Carla Silva"}, {"authorId": "144840600", "name": "A. Rodrigues"}, {"authorId": "1772839", "name": "A. Jorge"}, {"authorId": "31092126", "name": "I. Dutra"}], "citations": []}
