{"paperId": "94d32890506c418c336c8cdc7634c72c3474bc95", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Two-Stage Privacy-Preserving Mechanism for a Crowdsensing-Based VSN", "abstract": "Vehicular social networks (VSNs) are moving from infancy to maturity. However, the characteristics of wireless channel availability and the high mobility of vehicles in the VSNs create new challenges for privacy preservation; the corresponding solutions require a combination of technologies. A common theme in this paper is the combination of crowdsensing (CS) and the VSNs. We first design a three-layer CS-based VSN architecture that includes a CS layer, mobile management layer, and core control layer. Then, we propose a two-stage privacy-preserving (TSPP) algorithm to protect identity and location privacy for the CS-based VSN. In TSPP algorithm, to protect identity privacy, we design a way of identity management. Simultaneously, by correlation analysis, we design a suppression strategy to satisfy  $\\varepsilon $ -privacy with no information loss for location privacy protection. The simulation results show that our proposed TSPP algorithm better protects identity and location privacy than current algorithms. The results are based on four metrics: average processing time, identity privacy, location privacy, and information loss.", "venue": "IEEE Access", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "40682-40695", "volume": "6"}, "authors": [{"authorId": null, "name": "Hui Li"}, {"authorId": "50281324", "name": "D. Liao"}, {"authorId": "143847421", "name": "Gang Sun"}, {"authorId": "2118541065", "name": "Ming Zhang"}, {"authorId": "2145170", "name": "Du Xu"}, {"authorId": "51176798", "name": "Zuijiao Han"}], "citations": [{"paperId": "0d808356474346e16615c78c5e4880d0dcd26ac6", "title": "P2AE: Preserving Privacy, Accuracy, and Efficiency in Location-Dependent Mobile Crowdsensing"}, {"paperId": "c90020174e36a35fe738699cc156b30d2f0a4347", "title": "Trends for Mobile IoT Crowdsourcing Privacy and Security in the Big Data Era"}, {"paperId": "4337e52201a9d53d92278e5105c18bfeb419196d", "title": "A privacy‐preserving mechanism for social mobile crowdsensing using game theory"}, {"paperId": "f07cdb20ced9517a30819e91e1471697bd89fdcb", "title": "A general location-authentication based secure participant recruitment scheme for vehicular crowdsensing"}, {"paperId": "39ada15e545bdec3ec1812db4df25e0126cbde41", "title": "Simulation of Trust-Based Mechanism for Enhancing User Confidence in Mobile Crowdsensing Systems"}, {"paperId": "209953ad826750c3c7b81a395cf3d307d977de60", "title": "Blockchain Meets VANET: An Architecture for Identity and Location Privacy Protection in VANET"}, {"paperId": "402ea637a17a92268d182d8a58859c5cfbb3fc28", "title": "Data Quality in Human-Centric Sensing-Based Next-Generation IoT Systems: A Comprehensive Survey of Models, Issues, and Challenges"}, {"paperId": "76abe355542fe962f9792fbe72c074efd5003f30", "title": "Privacy-Preserving Trust-Aware Group-Based Framework in Mobile Crowdsensing"}, {"paperId": "d6c3251367b34f03ac1c7b15ef8181fd3d865d8d", "title": "A Survey of Location Privacy Preservation in Social Internet of Vehicles"}]}
