{"paperId": "94d3d053cced6ed151d0b2d29ed7cea7cce0080f", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Reducing False Arrhythmia Alarms Using Different Methods of Probability and Class Assignment in Random Forest Learning Methods", "abstract": "The literature indicates that 90% of clinical alarms in intensive care units might be false. This high percentage negatively impacts both patients and clinical staff. In patients, false alarms significantly increase stress levels, which is especially dangerous for cardiac patients. In clinical staff, alarm overload might lead to desensitization and could result in true alarms being ignored. In this work, we applied the random forest method to reduce false arrhythmia alarms and specifically explored different methods of probability and class assignment, as these affect the classification accuracy of the ensemble classifiers. Due to the complex nature of the problem, i.e., five types of arrhythmia and several methods to determine probability and the alarm class, a synthetic measure based on the ranks was proposed. The novelty of this contribution is the design of a synthetic measure that helps to leverage classification results in an ensemble model that indicates a decision path leading to the best result in terms of the area under the curve (AUC) measure or the global accuracy (score). The results of the research are promising. The best performance in terms of the AUC was 100% accuracy for extreme tachycardia, whereas the poorest results were for ventricular tachycardia at 87%. Similarly, in terms of the accuracy, the best results were observed for extreme tachycardia (91%), whereas ventricular tachycardia alarms were the most difficult to detect, with an accuracy of only 51%.", "venue": "Italian National Conference on Sensors", "year": 2019, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-04-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "19"}, "authors": [{"authorId": "3078609", "name": "Krzysztof Gajowniczek"}, {"authorId": "9430922", "name": "Iga Grzegorczyk"}, {"authorId": "2397797", "name": "Tomasz S. Zabkowski"}], "citations": [{"paperId": "faeceba8375fe13c8aec5c1784dab516ffc6d33b", "title": "Lower Limb Activity Recognition using sEMG Signals via Weighted Random Forest"}, {"paperId": "f7d2da7d7067264990595e52a0fda2fec323a206", "title": "Recognizing protein-metal ion ligands binding residues by random forest algorithm with adding orthogonal properties"}, {"paperId": "6615811c19efd874a1a46012e9feafac29c652e0", "title": "Clinician Preimplementation Perspectives of a Decision-Support Tool for the Prediction of Cardiac Arrhythmia Based on Machine Learning: Near-Live Feasibility and Qualitative Study"}, {"paperId": "48294b11871f095e861d0b814ebae849f72462ff", "title": "A Hybrid Approach: Dynamic Diagnostic Rules for Sensor Systems in Industry 4.0 Generated by Online Hyperparameter Tuned Random Forest"}, {"paperId": "6d18f808db7d75c0612e733876ca5cd2dd8b4034", "title": "Blind Source Separation for the Aggregation of Machine Learning Algorithms: An Arrhythmia Classification Case"}, {"paperId": "426673b34de486402058cd39c8e711b52b38b017", "title": "Weighted Random Forests to Improve Arrhythmia Classification"}, {"paperId": "5166a88e32cf0599b19bdc25f3c45a72821d7d82", "title": "Single-modal and multi-modal false arrhythmia alarm reduction using attention-based convolutional and recurrent neural networks"}, {"paperId": "76ac57f714fbbd3166447f082f077181cdae9a13", "title": "Development of a short-term water quality prediction model for urban rivers using real-time water quality data"}, {"paperId": "1fd1203a2848d26b5ae789a7ccb7399b04eb3574", "title": "BUILDING FACADE INSPECTION: A SYSTEM BASED ON AUTOMATED DATA ACQUISITION, MACHINE LEARNING, AND DEEP LEARNING IMAGE CLASSIFICATION METHODS"}]}
