{"paperId": "94df0e45e0ab950bdde2b1211dd5b3b9e442983b", "publicationVenue": {"id": "b63861a6-ab0a-47a4-9f6c-accf03b5a180", "name": "Iberian Conference on Information Systems and Technologies", "type": "conference", "alternate_names": ["CISTI", "Iber Conf Inf Syst Technol"]}, "title": "A proposal of Machine Learning model to improve learning process and reduce dropout rate at technical training institutes", "abstract": "The main purpose of this research work is to predict the academic performance of students from the Public Technological Higher Education Institute \"Manuel Nuñez Butron\" (IESTP MNB) located in the Juliaca city in the Department of Puno, Peru. The data of the academic process from the first semester will be used in this proposal, considering that it is very important for an Institution to know previously the possible academic performance of its students and reduce their desertion. That is to say, good or bad academic performance in the first semester at the institution, which will subsequently redound in future semesters. The prediction will help us to project strategies that together with the institution, teachers, students, and parents can improve their activities of the teaching-learning process. To achieve the purpose of prediction, Machine Learning will be used, specifically, classification techniques to design a predictive model that allows to determine the academic performance of students and reduce their desertion, likewise to determine the best predictive algorithm.", "venue": "Iberian Conference on Information Systems and Technologies", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2021-06-23", "journal": {"name": "2021 16th Iberian Conference on Information Systems and Technologies (CISTI)", "pages": "1-4"}, "authors": [{"authorId": "2120315087", "name": "Libia Aurora Ventura Apaza"}, {"authorId": "49360369", "name": "J. Huamaní"}, {"authorId": "98819288", "name": "J. Bernedo"}, {"authorId": "2120333711", "name": "Abraham Gerardo Zamudio Chauca"}], "citations": []}
