{"paperId": "94f1c54c3b9af873c097b422dbbbf66a5adf0da7", "publicationVenue": {"id": "e2acdbdd-8665-4181-be7e-b7d710482fe5", "name": "International Journal of Cloud Applications and Computing", "type": "journal", "alternate_names": ["Int J Cloud Appl Comput"], "issn": "2156-1834", "url": "http://www.igi-global.com/ijcac"}, "title": "RDF Query Path Optimization Using Hybrid Genetic Algorithms: Semantic Web vs. Data-Intensive Cloud Computing", "abstract": "Resource Description Framework (RDF) inherently supports data mergers from various resources into a single federated graph that can become very large even for an application of modest size. This results in severe performance degradation in the execution of RDF queries. As every RDF query essentially traverses a graph to find the output of the Query, an efficient path traversal reduces the execution time of RDF queries. Hence, query path optimization is required to reduce the execution time as well as the cost of a query. Query path optimization is an NP-hard problem that cannot be solved in polynomial time. Genetic algorithms have proven to be very useful in optimization problems. We propose a hybrid genetic algorithm for query path optimization. The proposed algorithm selects an initial population using iterative improvement thus reducing the initial solution space for the genetic algorithm. The proposed algorithm makes significant improvements in the overall performance. We show that the overall number of joins for complex queries is reduced considerably, resulting in reduced cost.", "venue": "International Journal of Cloud Applications and Computing", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-01-01", "journal": {"name": "Int. J. Cloud Appl. Comput.", "pages": "1-16", "volume": "12"}, "authors": [{"authorId": "3358995", "name": "Qazi Mudassar Ilyas"}, {"authorId": "2110093338", "name": "Muneer Ahmad"}, {"authorId": "2137435884", "name": "Sonia Rauf"}, {"authorId": "2257157352", "name": "Danish Irfan"}], "citations": [{"paperId": "6fe1b2c2e6e4a18ec752a7a292ea723c393f4085", "title": "Affective Prompt-Tuning-Based Language Model for Semantic-Based Emotional Text Generation"}, {"paperId": "9e6de93dfba7d411088475a4a4b42b731f473229", "title": "Semantic Web-Based Structural Equation Modeling and Mediating Effects Are Used to Investigate Key Factors"}, {"paperId": "5b8a636b6f573976abe78633b8f0728db917823d", "title": "Intelligent Systems in Motion: A Comprehensive Review on Multi-Sensor Fusion and Information Processing From Sensing to Navigation in Path Planning"}, {"paperId": "5f932a88d144ce74de94790f5b3611618e5a806b", "title": "Design of Intelligent Information Classification System for Automobile Industry Platform Based on Genetic Optimization Algorithm"}, {"paperId": "63dea65e4e1418cdee4d448c04660a9db657a793", "title": "A systematic overview of data federation systems"}, {"paperId": "256f770e53844744b8e6dfec567e0c0b03be6a10", "title": "Modular Information Fusion Model of Urban Landscape Design Based on Genetic Algorithm"}, {"paperId": "eda4ea18576bcf1b69f457dff4a3bd0a3bfb5767", "title": "Enhancing Healthcare Efficacy Through IoT-Edge Fusion: A Novel Approach for Smart Health Monitoring and Diagnosis"}]}
