{"paperId": "94f5ebbc0b595c10aa4b1afe3a69e1e9192bc008", "publicationVenue": {"id": "3235a2bb-118f-4abc-9046-80342279a154", "name": "Industrial management & data systems", "type": "journal", "alternate_names": ["Industrial Management and Data Systems", "Ind manag  data syst", "Ind Manag Data Syst"], "issn": "0263-5577", "url": "https://www.emerald.com/insight/publication/issn/0263-5577"}, "title": "Implementation of information and communication technologies in fruit and vegetable supply chain: a systematic literature review", "abstract": "PurposeInformation and communication technology (ICT) implementation has demonstrated usefulness in supply chain coordination and efficiency optimization in various industries and sectors. This study investigates the extent of ICT deployment in fruits and vegetable supply chains (FVSC) from “farm-to-fork” to ensure food security.Design/methodology/approachThis paper employs a systematic literature review (SLR) methodology and identified a total of 99 journal articles ranging from 2001 to April 2023 for analysis. The reviewed articles have been classified based on the framework proposed from the perspective of food security. Bibliometric and content analysis is carried out with the final list of articles to extract useful insights.FindingsThe findings reveal that ICT implementation in FVSC is a relatively new research area; researchers have started investigating several aspects of ICT in FVSC through varied research methodologies. Experimental research aimed at addressing food safety and condition monitoring of fruits and vegetables (FV) has started to gain traction while theory building is yet to gain traction in the literature reviewed. Findings indicate further research is required on technologies like blockchain (BCT), artificial intelligence (AI) and machine learning (ML), especially on key objectives such as food security, and the triple-bottom-line approach of sustainability. It also indicates that implementing relevant ICTs in FVSC can help delay, if not avert, the food crisis predicted by Malthusian theory.Research limitations/implicationsThis study used only well-established databases to ensure quality of the studies examined. There is a possibility of missing out on articles from other sources not considered. As a result, future SLR studies may employ additional databases, such as Springer Link, Taylor and Francis, Emerald Insight and Google Scholar. Other methodologies such as expert interviews and extra empirical methodologies may also be employed to give a more balanced picture and insights into ICTs implementation in FVSC.Practical implicationsThis study offers a summative detail of the status of ICT implementation in FVSC and can serve as a reference guide for stakeholders in developing strategies for efficient FVSC management. This research work highlights the impact of ICT implementation in FVSC on the four pillars of food security which include improved availability, accessibility, utilization and stability.Originality/valueThis study focuses on ICT implementation for food security in FVSC. The SLR highlights the gaps and proffers potential solutions that enhance global efforts on food security through ICT-enabled reduction in food waste and food loss in FVSC.", "venue": "Industrial management & data systems", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-08-08", "journal": {"name": "Ind. Manag. Data Syst.", "pages": "2349-2377", "volume": "123"}, "authors": [{"authorId": "66070272", "name": "M. Yuvaraj"}, {"authorId": "2239588155", "name": "R. Basu"}, {"authorId": "144212968", "name": "M. Abdulrahman"}, {"authorId": "2239593507", "name": "C. G. Kumar"}], "citations": [{"paperId": "95892bba5233f13e6d20d2c8359671e989ee60d3", "title": "Digital Technologies for Food Loss and Waste in Food Supply Chain Management"}]}
