{"paperId": "950e00dc1565638b8dc64aee8e9ac9eaed648483", "publicationVenue": null, "title": "A Conceptual Predictive Analytics Model for the Identification of at-risk students in VLE using Machine Learning Techniques", "abstract": "With the rapid growth and enhancement in technology-based learning platforms, students generate abundant digital footprints that are useful to mine and analyse their learning behaviours through Learning Analytics techniques. Student dropout is a pressing issue that many universities are currently facing, and it is increasing especially in e-learning systems. The prediction of at-risk students as early as possible is the recent phenomenon in the fields of LA and Educational Data Mining (EDM). Predicting failing students in Virtual Learning Environment (VLE) can benefit institutions and instructors in making data-driven decisions as well as enhancing their pedagogical methods. In this study, a predictive analytics model is proposed using Machine Learning (ML) clustering techniques to identify at-risk students in the Open University (OU). This research aims to evaluate whether unsupervised ML approaches can predict students at-risk with higher accuracy than supervised ML. The model also addresses the current research gaps based on the recent literature.", "venue": "2022 14th International Conference on Mathematics, Actuarial Science, Computer Science and Statistics (MACS)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-11-12", "journal": {"name": "2022 14th International Conference on Mathematics, Actuarial Science, Computer Science and Statistics (MACS)", "pages": "1-8"}, "authors": [{"authorId": "101857110", "name": "Dalia Abdulkareem Shafiq"}, {"authorId": "38085614", "name": "Mohsen Marjani"}, {"authorId": "96997078", "name": "Riyaz Ahamed Ariyaluran Habeeb"}, {"authorId": "2032417", "name": "D. Asirvatham"}], "citations": [{"paperId": "7122ded0258f6b2c8ace76d31229dbb1544acad7", "title": "Predicting and Analysing University Dropout Rates using Machine Learning Methods"}]}
