{"paperId": "9518d377479c1388af901783259ad696952ac0a1", "publicationVenue": {"id": "57f970eb-366a-4bfa-aa06-2ff70d834806", "name": "IEEE/ACM International Symposium on Cluster, Cloud and Internet Computing", "type": "conference", "alternate_names": ["Clust Comput Grid", "CCGRID", "IEEE/ACM Int Symp Clust Cloud Grid Comput", "IEEE/ACM International Symposium Cluster, Cloud and Grid Computing", "Cluster Computing and the Grid", "IEEE/ACM Int Symp Clust Cloud Internet Comput"], "url": "http://www.buyya.com/ccgrid/"}, "title": "Enabling Fast, Effective Visualization of Voluminous Gridded Spatial Datasets", "abstract": "Gridded spatial datasets arise naturally in environmental, climatic, meteorological, and ecological settings. Each grid point encapsulates a vector of variables representing different measures of interest. Gridded datasets tend to be voluminous since they encapsulate observations for long timescales. Visualizing such datasets poses significant challenges stemming from the need to preserve interactivity, manage I/O overheads, and cope with data volumes. Here we present our methodology to significantly alleviate I/O requirements by leveraging deep neural network-based models and a distributed, in-memory cache to facilitate interactive visualizations. Our benchmarks demonstrate that deploying our lightweight models coupled with back-end caching and prefetching schemes can reduce the client's query response time by 92.3% while maintaining a high perceptual quality with a PSNR (peak signal-to-noise ratio) of 38.7 dB.", "venue": "IEEE/ACM International Symposium on Cluster, Cloud and Internet Computing", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-01", "journal": {"name": "2023 IEEE/ACM 23rd International Symposium on Cluster, Cloud and Internet Computing (CCGrid)", "pages": "592-604"}, "authors": [{"authorId": "1404303168", "name": "Paahuni Khandelwal"}, {"authorId": "51262762", "name": "M. Warushavithana"}, {"authorId": "145069202", "name": "S. Pallickara"}, {"authorId": "1747019", "name": "S. Pallickara"}], "citations": [{"paperId": "580435c1452d6df6c82b2f6ede63c3c4d4e4f474", "title": "Deep Learning based Approach for Fast, Effective Visualization of Voluminous Gridded Spatial Observations"}]}
