{"paperId": "951b2ec83bfaf2d90076c02acaf2b14aa86a72d6", "publicationVenue": {"id": "c0ded351-0e49-473e-816e-23b84c9f8dd3", "name": "Frontiers in Environmental Science", "type": "journal", "alternate_names": ["Front Environ Sci"], "issn": "2296-665X", "url": "http://www.frontiersin.org/Environmental_Science", "alternate_urls": ["https://www.frontiersin.org/journals/environmental-science"]}, "title": "Can the Natural Resources Capitalization Contribute to the Achievement of Carbon Neutrality? A Pilot Experiment Evidence From China", "abstract": "There has been renewed interest in assessing the pilot scheme for compiling the natural resources capitalization (NRC). A growing body of evidence highlights the good effects that the policy of NRC has on the construction of ecological civilization. No known empirical research has focused on exploring relationships between the policy of NRC and carbon emissions reduction. This paper employs the NRC as the ecological civilization policy to investigate whether the implementation of NRC has contributed to the carbon emissions reduction with a difference-in-differences (DID) method. The results showed that different variables of carbon emissions in four pilot cities can be effectively affected by the implementation of NRC. There were significant negative correlations between the carbon emissions per GDP (Gross Domestic Product) and the policy for Hulun Buir, Huzhou and Loudi cities, and a significant increase of carbon sequestration was found in Yan’an city. This research provides a timely and necessary study that the NRC policy could be a contributing factor to carbon emissions reduction. As a result of these investigations, suggestions were identified for future research. Further research should be undertaken to investigate the collaborative effects of multi-policies on environmental issues.", "venue": "Frontiers in Environmental Science", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-02-04", "journal": {"volume": "10"}, "authors": [{"authorId": "101624920", "name": "Penghao Ye"}, {"authorId": "101109410", "name": "S. Xia"}, {"authorId": "145704810", "name": "Yu Xiong"}, {"authorId": "2110465675", "name": "Yanan Li"}, {"authorId": "2146072192", "name": "Lei Chen"}], "citations": [{"paperId": "22dd2d4d1590c6e6612323a59c5a7b0dacd008d3", "title": "The way to induce asset‐backed securities participation in eco‐compensation"}, {"paperId": "9dfaf13ba29bfbfa20bc38d6c31c2a514d76b334", "title": "A spatiotemporal analysis of the association between carbon productivity, socioeconomics, medical resources and cardiovascular diseases in southeast rural China"}, {"paperId": "9c08d9a6c8ef790da0f09c8ed6ba29764df9f47d", "title": "Asymmetric influence of digital finance, and renewable energy technology innovations on green growth in China"}, {"paperId": "2f4ffcf8ccc2dd3633c14b291bf9a72e507a1996", "title": "Carbon emissions trading policy and green transformation of China’s manufacturing industry: Mechanism assessment and policy implications"}, {"paperId": "1768a3df7de2133629bf67fafb0efa182417c970", "title": "The impact of FDI quality characteristics on carbon emission intensity: Evidence from China"}]}
