{"paperId": "953dc887b741b874f466ba19a92060fb19e3b3fe", "publicationVenue": {"id": "38a8edf0-2998-4daf-93f7-16f34689e228", "name": "IEEE Systems Journal", "type": "journal", "alternate_names": ["IEEE Syst J"], "issn": "1932-8184", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=4267003", "alternate_urls": ["http://www.systemsjournal.org/"]}, "title": "Ensuring the Security and Performance of IoT Communication by Improving Encryption and Decryption With the Lightweight Cipher uBlock", "abstract": "Internet of Things (IoT) devices expect a secure communication method or protocol with communication performance that matches the network bandwidth in a public network. With the advancement of network bandwidths, such as through wireless technology 5G, encryption and decryption throughput can be the performance bottleneck of IoT communication security, as IoT devices have limited computing power. As a result, it is a challenge for IoT devices to obtain the required level of security and communication performance. In this article, we improve the encryption and decryption performance with a lightweight cipher algorithm called uBlock for IoT devices. By using sequential circuits, the encryption and decryption throughput can reach the 1 Gb/s level with 90 nm technology in our simulation environment. We can expect a more than two fold improvement in the performance with better nanotechnology from hardware vendors. Our proposed solution can achieve the required level of security and communication performance with a little power consumption.", "venue": "IEEE Systems Journal", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-12-01", "journal": {"name": "IEEE Systems Journal", "pages": "5489-5500", "volume": "16"}, "authors": [{"authorId": "1992359", "name": "Chengjian Liu"}, {"authorId": "2108139158", "name": "Yiwei Zhang"}, {"authorId": "2144296576", "name": "Jiajun Xu"}, {"authorId": null, "name": "Jian Zhao"}, {"authorId": "2056271004", "name": "Shaohua Xiang"}], "citations": [{"paperId": "84c4313caaa4187b992405ca64fa998045211221", "title": "AIS for Malware Detection in a Realistic IoT System: Challenges and Opportunities"}, {"paperId": "c1ccdc82966165639da78882167d80aef7eaa3e7", "title": "Deep Learning for Enhanced Security in the Internet of Nano Things: A Study on Data Classification for Normal and Abnormal Behavior"}, {"paperId": "7fbf28f2432ba822bdd2654aa003526bb29c4996", "title": "Enhancing IoT Security through a Green and Sustainable Federated Learning Platform: Leveraging Efficient Encryption and the Quondam Signature Algorithm"}, {"paperId": "7d0d2960f6cfac03c0253ebebc2d8e0404c7241e", "title": "Ensuring of Secure Data Transmission by Modified Encryption and Decryption Method in IoT"}, {"paperId": "c6d4686a091e32a295e3b23562f7f5818e19c268", "title": "IVLBC: An Involutive Lightweight Block Cipher for Internet of Things"}, {"paperId": "aee9c112ae71af5574964a190abb1c9879c16764", "title": "Keyless Lightweight Encipher using Homomorphic and Binomial Coefficients for Smart Computing Applications"}, {"paperId": "271d27cab14d3564ef28c21c417755f367d5f443", "title": "Novel secure data protection scheme using Martino homomorphic encryption"}, {"paperId": "546b32159ac938371de2e43fbfa31412d3101939", "title": "Light Weight Deep Learning Algorithm for Voice Call Quality of Services (Qos) in Cellular Communication"}]}
