{"paperId": "9560c642653a6514d9429681861255fd66421b9e", "publicationVenue": {"id": "69eb0845-348f-4911-86c6-dd7adcfe1508", "name": "Journal of Database Management", "type": "journal", "alternate_names": ["J Database Manag"], "issn": "1063-8016", "url": "https://www.igi-global.com/journal/journal-database-management-jdm/1072", "alternate_urls": ["http://www.metapress.com/", "http://www.igi-pub.com/journals/details.asp?id=198"]}, "title": "The Rise of NoSQL Systems: Research and Pedagogy", "abstract": "Transaction processing systems are primarily based on the relational model of data and offer the advantages of decades of research and experience in enforcing data quality through integrity constraints, allowing concurrent access and supporting recoverability. From a performance standpoint, they offer joins-based query optimization and data structures to promote fast reads and writes, but are usually vertically scalable from a hardware standpoint. NoSQL (Not Only SQL) systems follow different data representation formats than relations, such as key-value pairs, graphs, documents or column-families. They offer a flexible data representation format as well as horizontal hardware scalability so that Big Data can be processed in real time. In this review article, we review recent research on each type of system, and then discuss how teaching of NoSQL may be incorporated into traditional undergraduate database courses in information systems curricula.", "venue": "Journal of Database Management", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2020-07-01", "journal": {"name": "J. Database Manag.", "pages": "67-82", "volume": "31"}, "authors": [{"authorId": "5601394", "name": "A. Bajaj"}, {"authorId": "1819985155", "name": "Wade Bick"}], "citations": [{"paperId": "1e18ba9c34179b33de3f4d33d15728166ab9bb71", "title": "Development of an adaptive graphic web interface model for editing XML data"}, {"paperId": "9b101f6aa55d2541de403b1f610739d6317c36ed", "title": "Comparative Study Between the MySQL Relational Database and the MongoDB NoSQL Database"}, {"paperId": "8e9bd5d2139b41fe10f4cdba3fcbb9bb5abff876", "title": "DEVELOPMENT OF A METHOD FOR DETERMINING THE POSITION OF AN OBJECT USING A TYPICAL FORM OF ITS IMAGE (p. 6–12)"}, {"paperId": "0ef22742e925f93c70f797762652591b4bfb8c4e", "title": "An Efficient NoSQL-Based Storage Schema for Large-Scale Time Series Data"}]}
