{"paperId": "95713c4269ade150ef8bac2e2088ce9fdb3f8133", "publicationVenue": {"id": "f7fec013-9dd8-45f8-956f-b5aa91c0580a", "name": "International Journal of Qualitative Methods", "type": "journal", "alternate_names": ["Int J Qual Method", "The International Journal of Qualitative Methods"], "issn": "1609-4069", "url": "http://ejournals.library.ualberta.ca/index.php/IJQM/index", "alternate_urls": ["https://journals.library.ualberta.ca/ijqm/index.php/IJQM/index", "http://ijq.sagepub.com/", "https://journals.sagepub.com/home/ijqa", "https://journals.sagepub.com/home/ijq"]}, "title": "The Use of Case Study Design in Learning Management System Research: A Label of Convenience?", "abstract": "Case study design is often characterized as a poorly applied and understood approach to conduct research into information systems. This literature review examined 28 empirical studies of Learning Management Systems (LMS) that were self-declared as case studies. This paper’s main aim was to establish whether these studies actually applied case study techniques or simply utilized the term “case study” as a label of convenience. Alarmingly, more than one-third of the examined articles contained little or no justification for adopting a case study design and did not meet the established criteria for identification as a case study as outlined in this review. The lack of an appropriate discussion on the characteristics and applicability of the case study approach to empirical discovery brings into question the robustness of a study’s stated methodology. It is not sufficient to assume that the label “case study” by itself will portray a universal understanding of the research design of an empirical LMS study. This paper proposes that a robust description of what constitutes a case study in a LMS context will assist in ensuring that future studies on LMS (or other information systems) research that intend to adopt a case study approach, adequately present appropriate justifications for adopting this methodology. It is hoped that our definition and description of LMS case study methodology will serve to inspire further reflection on the characteristics of this robust research approach that might lead to a set of guidelines for applying this methodology to information systems research.", "venue": "International Journal of Qualitative Methods", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-01-01", "journal": {"name": "International Journal of Qualitative Methods", "volume": "20"}, "authors": [{"authorId": "1657795422", "name": "Darren Turnbull"}, {"authorId": "3016660", "name": "Ritesh Chugh"}, {"authorId": "145110724", "name": "Jo-Anne Luck"}], "citations": [{"paperId": "3b92406b3e5e8bec357c6e77ec9762da46235eb9", "title": "Transforming informal communication in the urgent shift to teleworking: a case study in Japan"}, {"paperId": "a73fc7d8c28282e01eb48aa823cfc3a29a035d96", "title": "APPLICATION OF PROBLEM CASES: ADVANTAGES AND DISADVANTAGES"}, {"paperId": "b70853155557bff21d795ad739b287f20e88366b", "title": "Modern Multidisciplinary Education: Challenges and Opportunities of Modern Learning Pedagogy"}, {"paperId": "d81a720e6567567f7ed4f4d4ef58b991cde9cbe0", "title": "The Impact of Virtual Society on Social Capital Formation: A Comparative Analysis of Facebook and WhatsApp"}, {"paperId": "6198ceb4d3ba32dc682e61d08af6a704b625712f", "title": "Organizational Analysis in Preparation for LMS Change: a Narrative Case Study"}, {"paperId": "25d1288aefc93ba46e426e2e2dcb14a166a3f9c9", "title": "Whether to flip Extreme Apprenticeship: which is more effective in programming instruction?"}, {"paperId": "bbc7799aa216a1562739a53a65b850aa3fb472f3", "title": "Factors influencing graduate students’ behavioral intention to use Google Classroom: Case study-mixed methods research"}, {"paperId": "04424c142c6d1a8c2170301383aa31f329ec487f", "title": "The Qualitative Case Study Research Strategy as Applied on a Rural Enterprise Development Doctoral Research Project"}, {"paperId": "64e4b875322e8d91b4886bf8c882f7e42e9934cd", "title": "Systematic-narrative hybrid literature review: A strategy for integrating a concise methodology into a manuscript"}, {"paperId": "f6056fb28fd758af94a01b8ca5be85134fb219f6", "title": "Knowledge Sharing Between Higher Educational Institutions: Evaluation of a Transfer Platform"}, {"paperId": "6fa238e29e61fe00d840c62ca80fdcdd0ec8b78e", "title": "Facilitating the Decentralisation of Software Development Projects from a Project Management Perspective: A Literature Review"}, {"paperId": "02d382172984ff2d37b681a89dae265793a70147", "title": "Study on the Role of Learning Management System to support the Distance Education in Bangladesh during Covid-19: The Case of Bangladesh University of Professionals and Bangladesh Open University"}, {"paperId": "f5632f71fa6a5edde1950a5e4624a7c2452ee7ae", "title": "ODU Digital Commons ODU Digital Commons"}, {"paperId": "42f3bfddf3c5ba1884cde3a920792daa1c58a926", "title": "Factors Influencing the Usage Behavior of Digitalized Innovation Environments in Companies: A Qualitative in-Depth Analysis"}, {"paperId": "2b102234a198dba5f88c4e682ac88d9cad5a7f46", "title": "International Review of Research in Open and Distributed Learning Scrutinizing Learning Management Systems in Practice: An Applied Time Series Research in Higher Education"}]}
