{"paperId": "9574a9b5248743fd558572e80967b81ba4728c51", "publicationVenue": {"id": "fc0a208c-acb7-47dc-a0d4-af8190e21d29", "name": "International Conference on Machine Learning", "type": "conference", "alternate_names": ["ICML", "Int Conf Mach Learn"], "url": "https://icml.cc/"}, "title": "Comparison of meta-learners for estimating multi-valued treatment heterogeneous effects", "abstract": "Conditional Average Treatment Effects (CATE) estimation is one of the main challenges in causal inference with observational data. In addition to Machine Learning based-models, nonparametric estimators called meta-learners have been developed to estimate the CATE with the main advantage of not restraining the estimation to a specific supervised learning method. This task becomes, however, more complicated when the treatment is not binary as some limitations of the naive extensions emerge. This paper looks into meta-learners for estimating the heterogeneous effects of multi-valued treatments. We consider different meta-learners, and we carry out a theoretical analysis of their error upper bounds as functions of important parameters such as the number of treatment levels, showing that the naive extensions do not always provide satisfactory results. We introduce and discuss meta-learners that perform well as the number of treatments increases. We empirically confirm the strengths and weaknesses of those methods with synthetic and semi-synthetic datasets.", "venue": "International Conference on Machine Learning", "year": 2022, "fieldsOfStudy": ["Mathematics", "Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-05-29", "journal": {"pages": "91-132"}, "authors": [{"authorId": "2110708322", "name": "Naoufal Acharki"}, {"authorId": "2167026276", "name": "Ramiro Lugo"}, {"authorId": "14743510", "name": "A. Bertoncello"}, {"authorId": "98911259", "name": "J. Garnier"}], "citations": [{"paperId": "19ad2b266fe014b432950bd2d6bd88c0f88ab548", "title": "Estimating individualized treatment effects using an individual participant data meta-analysis"}, {"paperId": "e0e656b16d307644f3db850b1258eb6fc553314b", "title": "Analysis of Stochastic Cooperative Intelligent Interactions"}]}
