{"paperId": "957470622aba3ba879ad6b4937243b64513b3536", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Internet of Medical Things Privacy and Security: Challenges, Solutions, and Future Trends from a New Perspective", "abstract": "The Internet of Medical Things (IoMT), an application of the Internet of Things (IoT) in the medical domain, allows data to be transmitted across communication networks. In particular, IoMT can help improve the quality of life of citizens and older people by monitoring and managing the body’s vital signs, including blood pressure, temperature, heart rate, and others. Since IoMT has become the main platform for information exchange and making high-level decisions, it is necessary to guarantee its reliability and security. The growth of IoMT in recent decades has attracted the interest of many experts. This study provides an in-depth analysis of IoT and IoMT by focusing on security concerns from different points of view, making this comprehensive survey unique compared to other existing studies. A total of 187 articles from 2010 to 2022 are collected and categorized according to the type of applications, year of publications, variety of applications, and other novel perspectives. We compare the current studies based on the above criteria and provide a comprehensive analysis to pave the way for researchers working in this area. In addition, we highlight the trends and future work. We have found that blockchain, as a key technology, has solved many problems of security, authentication, and maintenance of IoT systems due to the decentralized nature of the blockchain. In the current study, this technology is examined from the application fields’ points of view, especially in the health sector, due to its additional importance compared to other fields.", "venue": "Sustainability", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2023-02-10", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "32231986", "name": "F. Kamalov"}, {"authorId": "27012208", "name": "Behrouz Pourghebleh"}, {"authorId": "2191006441", "name": "Mehdi Gheisari"}, {"authorId": "2152803950", "name": "Yang Liu"}, {"authorId": "48369051", "name": "S. Moussa"}], "citations": [{"paperId": "cf707cf718078e6bbdcb86b97f7a9805e0d51293", "title": "A Systematic Review on Privacy-Aware IoT Personal Data Stores"}, {"paperId": "02650fe20a650d62437ff96db3dd7b556bb61f80", "title": "Cloud-integrated robotics: transforming healthcare and rehabilitation for individuals with disabilities"}, {"paperId": "f45336cef87c411ccdebe4cd41054552bcc49352", "title": "Efficient data management in Internet of Things: A survey of data aggregation techniques"}, {"paperId": "e65d867fcc59d6393bea8b7a5e8c61f743649a03", "title": "Incentive approaches for cloud computing: challenges and solutions"}, {"paperId": "f5abf0bbe4522bade0fc98af985085233b0964eb", "title": "CAPPAD: a privacy-preservation solution for autonomous vehicles using SDN, differential privacy and data aggregation"}, {"paperId": "e558b2eb4c6dd618c7d0364b65e8e89d8f50b69a", "title": "Machine learning methods in civil engineering: a systematic review"}, {"paperId": "d905470ef29f3b4025b43b42c661f5010af1f6e3", "title": "Privacy and Security Issues in Mobile Communication Systems"}, {"paperId": "8322dbc99844bb3144484d78a4fefbacc2a20e17", "title": "A new QoS-aware service discovery technique in the Internet of Things using whale optimization and genetic algorithms"}, {"paperId": "5b81bb842a1ea73b26bf8a822b82438fc6ff43f5", "title": "Differential Privacy Based Federated Learning Techniques in IoMT: A Review"}, {"paperId": "323799a4c3a70f54bf1df21ec494883a4d0411f0", "title": "Intrusion Detection System for Defending against DoS Attacks in the IoMT Ecosystem"}, {"paperId": "65c548c607066579396b8d1842413e0f80ed1b57", "title": "QoS-aware resource allocation method for the internet of things using triplet and heterogeneous earliest finish time algorithms"}, {"paperId": "fc6218e6afeeb46526ce1fda5651b320598d020a", "title": "Integration of AI, Digital Twin and Internet of Medical Things (IoMT) For Healthcare 5.0: A Bibliometric Analysis"}, {"paperId": "eb5a0a2361cd828af159dfb68984f90fc1140c56", "title": "Blockchain-Enabled Communication Network Transforms Information Technologies: A Thematic Analysis"}, {"paperId": "9a9b91f293ba100f0a0f0970724073507741b36c", "title": "Digital Twin and Blockchain Extension in Smart Buildings Platform as Cyber-Physical Systems"}, {"paperId": "5f8f45daab717344fa2f0e79b4afaf3bd0607db8", "title": "Real-Time Distant Healthcare Monitoring IoT System Secured by Light Weight Cryptography"}, {"paperId": "c5b9b00a53a42c04d77c8e276af2719e0aac592c", "title": "An Adaptive Intrusion Detection System in the Internet of Medical Things Using Fuzzy-Based Learning"}, {"paperId": "7503f93882936b4ad6f75c33b8b2db5883a8e653", "title": "The Impact of Student Engagement and Motivation in the Statistics Learning Process"}, {"paperId": "95916a311803b952cdb89a14e8edc850f9f35785", "title": "DH-AES Cryptographic Scheme for Securing Medical IoT Devices"}, {"paperId": "d4a1dc6746c8ba568bc37824b11095bf841144b1", "title": "Deep Learning Techniques in Mobile Edge Computing for Internet of Medical Things"}, {"paperId": "51c6f99a2cb6f1ed97ee32c93657374c543ce826", "title": "Risk and Threat Mitigation Techniques in Internet of Things (IoT) Environments: A Survey"}, {"paperId": "874fd44b02110b74792a3e2afd9186cd1aa6edf6", "title": "Machine learning methods in analysis of concrete: a state-of-the-art review"}, {"paperId": "7e98a455c417262e8309124bb7d37d5541aa0070", "title": "Revolutionary of secure lightweight energy efficient routing protocol for internet of medical things: a review"}, {"paperId": "52cf7ee9c741b9cfbe0cc901a04c9254b3a03660", "title": "Cybersecurity in Internet of Medical Vehicles: State-of-the-Art Analysis, Research Challenges and Future Perspectives"}, {"paperId": "b4bb0cd13da3975befcd84aef8fb3c985caaf429", "title": "A new QoS-aware service composition technique in cloud computing using capuchin search algorithm"}, {"paperId": "26f8c5f71642c7942ef64e1c267dcc57b99792da", "title": "Integrating blockchain technology and cloud services in healthcare: a security and privacy perspective"}, {"paperId": "cec3efde39b069d13eaea3821115b13d1dbaf32a", "title": "Insights into Internet of Medical Things (IoMT): Data fusion, security issues and potential solutions"}, {"paperId": "c82b641e137ba9c44589921b133bab510cfbd7de", "title": "Integration of Internet of Things and blockchain technology in healthcare domain: A systematic literature review"}, {"paperId": "5f28fde0019680254acd3c8ccf2b517728254357", "title": "Load balancing in virtual machines of cloud environments using two-level particle swarm optimization algorithm"}, {"paperId": "24f591695fa7d5e4badb2da4a865afec47bb9b7d", "title": "The usage of internet of things in healthcare: A review of mechanisms, platforms, and opportunities from a new perspective"}, {"paperId": "d6dd026b1b2e70ed8ad655a7b30295d8133d24c2", "title": "Task scheduling in the internet of things: challenges, solutions, and future trends"}, {"paperId": "ccc4bc50d9200d5f61a12438a9414b3af51ede42", "title": "IoMT healthcare emerging technologies and implementation challenges: A brief review"}, {"paperId": "a243904b2ca219aa8b6381c86c3d88642661bba3", "title": "Federated Learning Approach for Breast Cancer Detection Based on DCNN"}, {"paperId": "543345350f4b3949e39cf6e1b1a9a0c4ad6c66f9", "title": "A Novel Method for Anomaly Detection in the Internet of Things using Whale Optimization Algorithm"}, {"paperId": "a89ef926b6fdaac64035e8eafad82fb25d51c2e6", "title": "Deadline-aware Task Scheduling for Cloud Computing using Firefly Optimization Algorithm"}, {"paperId": "e59e9e3e38abac78d5e99eacabaf8176f5d2aa9d", "title": "An Energy‐Aware Technique for Task Allocation in the Internet of Things using Krill Herd Algorithm"}, {"paperId": "a750e1f480b4b0fca82ea08963dfbd4a49f140c7", "title": "A Novel Data Aggregation Method for Underwater Wireless Sensor Networks using Ant Colony Optimization Algorithm"}, {"paperId": "60fa7791e12ad77045bbe9217f33553dc0ba9948", "title": "Cloud Task Scheduling using the Squirrel Search Algorithm and Improved Genetic Algorithm"}, {"paperId": "b5192b2c7b703d9af5b3bc3393bd75b7bcc00e62", "title": "A New Task Scheduling Framework for Internet of Things based on Agile VNFs On-demand Service Model and Deep Reinforcement Learning Method"}, {"paperId": "7b9cea99f6c0a3ee86961b3b1b6f3365f2c85ace", "title": "A Cloud and IoT-enabled Workload-aware Healthcare Framework using Ant Colony Optimization Algorithm"}, {"paperId": "504ddc196981a1bfd5e4ea9d41f328c076bf8e87", "title": "A Hybrid Method Based on Gravitational Search and Genetic Algorithms for Task Scheduling in Cloud Computing"}, {"paperId": "df5faed24ce8a4be0f249cdb8067c18569dbd7fc", "title": "Clustering Based on Gray Wolf Optimization Algorithm for Internet of Things over Wireless Nodes"}, {"paperId": "2d9e949ed3b8e26bccef1ffd1fa142a708a7979a", "title": "A Roadmap Towards Optimal Resource Allocation Approaches in the Internet of Things"}, {"paperId": "20ac4989779dac65f63c516dcbcfab9b323f2c7e", "title": "A Novel Internet of Things-enabled Approach to Monitor Patients’ Health Statistics"}, {"paperId": "a824d666a4bcf0d6749e56ed09de8774e3f0b7fc", "title": "A Comprehensive Review of Fault-Tolerant Routing Mechanisms for the Internet of Things"}, {"paperId": "8e83b88d17b96a4128ca38cb1902259cc74ed2f6", "title": "DeepShield: A Hybrid Deep Learning Approach for Effective Network Intrusion Detection"}, {"paperId": "d4eb994e2a697a0eca8b1a60640a1ccf91028b5c", "title": "A QoS-Aware Resource Allocation Method for Internet of Things using Ant Colony Optimization Algorithm and Tabu Search"}, {"paperId": "aa5191cf10db7b2cf293c336321cfce2410ae68b", "title": "Enhancing Decision-Making with Data Science in the Internet of Things Environments"}, {"paperId": "d1bbf5ce48ab7ecff55eb30d2cd1ce961bb6425e", "title": "Machine Learning for Smart Cities: A Comprehensive Review of Applications and Opportunities"}, {"paperId": "167840556d8298e5c0514f26599cfb907817e2db", "title": "Routing Strategies and Protocols for Efficient Data Transmission in the Internet of Vehicles: A Comprehensive Review"}, {"paperId": "8ebe7f1a53a4f7c63889b966f02f9a3d70e4a2f2", "title": "Whale Optimization Algorithm for Energy-Efficient Task Allocation in the Internet of Things"}, {"paperId": "5bba1401faeafb4f4d40fe8d0aa96e2fcd24ff44", "title": "QoS and Energy-aware Resource Allocation in Cloud Computing Data Centers using Particle Swarm Optimization Algorithm and Fuzzy Logic System"}, {"paperId": "5581a75049c6a031e66da6090552b5a36c90dd1c", "title": "Energy-Aware Clustering in the Internet of Things using Tabu Search and Ant Colony Optimization Algorithms"}]}
