{"paperId": "958707b17c04896932e0de461ef1abfe608a2412", "publicationVenue": {"id": "6553ce9d-f705-4922-a815-f2812f0f8978", "name": "International Symposium on Spatial and Temporal Databases", "type": "conference", "alternate_names": ["SSTD", "Symposium on Large Spatial Databases", "Int Symp Spat Temporal Database", "Symp Large Spat Database"], "url": "https://link.springer.com/conference/ssd"}, "title": "Exposing Points of Interest as Linked Geospatial Data", "abstract": "Point of Interest (POI) data is widely used in many modern applications and services related to navigation, tourism, social networking, logistics, and many more. In this paper, we propose a comprehensive and vendor-agnostic data model to represent multi-faceted and enriched POI profiles. Harnessing the versatility of Linked Data technologies, this semantically rich ontology accommodates and extends existing POI formats for assembling and managing POI data from heterogeneous sources. Furthermore, we have developed the open-source software TripleGeo, which can effectively transform POI data from diverse sources and formats (geographical files, databases, and semi-structured data) to their RDF representations and vice versa. Thus, it is possible to import POI data from various existing systems and products, transfer and address the data integration challenges in the Linked Data domain, and export back the results. Our empirical study confirms the validity and efficiency of this framework for a variety of real-world POI assets and formats, underscoring its robustness to cope with scalable data volumes.", "venue": "International Symposium on Spatial and Temporal Databases", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2019-08-19", "journal": {"name": "Proceedings of the 16th International Symposium on Spatial and Temporal Databases"}, "authors": [{"authorId": "1762083", "name": "Kostas Patroumpas"}, {"authorId": "1807115", "name": "Dimitrios Skoutas"}, {"authorId": "1381453916", "name": "G. Mandilaras"}, {"authorId": "40397337", "name": "G. Giannopoulos"}, {"authorId": "2587884", "name": "Spiros Athanasiou"}], "citations": [{"paperId": "e5ee9b0e254283e9ad5c1a7deb301bb6bbc8e52e", "title": "Semantic data integration and querying: a survey and challenges"}, {"paperId": "100af889fa84594405fb49e645233e0859323810", "title": "Construct and Query A Fine-Grained Geospatial Knowledge Graph"}, {"paperId": "7efe32267ee1fdefb5e33b84a0b7b94eacbdf389", "title": "Generating Semantic Definitions and Visualization of POI Data"}, {"paperId": "aa293f214db7f0d830e26543a4af6c69e8088c2f", "title": "WISK: A Workload-aware Learned Index for Spatial Keyword Queries"}, {"paperId": "2f4922a58d2018ef729ad8b6cef5a3aec0ac5ce0", "title": "Enhanced-Sweep: Communication Cost Efficient Top-K Best Region Search"}, {"paperId": "540a5245b2bd49edd30de67c2a991614fd6eba4f", "title": "Automatic generation of sailing holiday itineraries using vessel density data and semantic technologies"}, {"paperId": "e573fb2bcd849ba04fe467c1728da8681c5d4916", "title": "An Efficient RDF Converter and SPARQL Endpoint for the Complete OpenStreetMap Data"}, {"paperId": "abee4c581441f959f2d795b6f8ae537f7cad3fd5", "title": "Assessment and Visualization of OSM Consistency for European Cities"}, {"paperId": "cd3f376ff266d6d98d5165ee2fcba8343931f2a1", "title": "SLIPO: Scalable Data Integration for Points of Interest"}, {"paperId": "39133a5593ab309d5b900c4e3ecef278cb23d87b", "title": "Scalable Transformation of Big Geospatial Data into Linked Data"}]}
