{"paperId": "95870e516fc160ca5879466c89d12fa64d73599a", "publicationVenue": {"id": "fcbcaf18-8ab1-43e1-a973-604bbc7e344e", "name": "Proceedings of the VLDB Endowment", "type": "journal", "alternate_names": ["Proceedings of The Vldb Endowment", "Proc VLDB Endow", "Proc Vldb Endow"], "issn": "2150-8097", "url": "http://dl.acm.org/toc.cfm?id=J1174", "alternate_urls": ["http://portal.acm.org/toc.cfm?CFID=21632689&CFTOKEN=99329904&WantType=Affiliated%20Organizations&coll=ACM&dl=ACM&id=J1174&idx=J1174&part=affil&title=VLDB%20Endowment&type=periodical"]}, "title": "CheetahVIS", "abstract": "Recently, the spatial-temporal data of urban moving objects, e.g., cars and buses, are collected and widely used in urban trajectory exploratory analysis. Urban bus service is one of the most common public transportation services. Urban bus data analysis plays an important role in smart city applications. For example, data analysts in bus companies use the urban bus data to optimize their bus scheduling plan. Map services providers, e.g., Google map, Ten-cent map, take urban bus data into account to improve their service quality (e.g., broadcast road update instantly). Unlike urban moving cars or pedestrians, urban buses travel on known bus routes. The operating buses form the \"bus flows\" in a city. Efficient analyzing urban bus flows has many challenges, e.g., how to analyze the dynamics of given bus routes? How to help users to identify traffic flow of interests easily? In this work, we present CheetahVIS, a visual analytical system for efficient massive urban bus data analysis. CheetahVIS builds upon Spark and provides a visual analytical platform for the stakeholders (e.g., city planner, data analysts in bus company) to conduct effective and efficient analytical tasks. In the demonstration, demo visitors will be invited to experience our proposed CheetahVIS system with different urban bus data analytical functions, e.g., bus route analysis, public bus flow overview, multiple region analysis, in a real-world dataset. We also will present a case study, which compares different regions in a city, to demonstrate the effectiveness of CheetahVIS.", "venue": "Proceedings of the VLDB Endowment", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2020-08-01", "journal": {"name": "Proceedings of the VLDB Endowment", "pages": "2805 - 2808", "volume": "13"}, "authors": [{"authorId": "1942884880", "name": "Wentao Ning"}, {"authorId": "1931444857", "name": "Qiandong Tang"}, {"authorId": "2109916977", "name": "Yi Zhao"}, {"authorId": "2109362364", "name": "Chuan Yang"}, {"authorId": "2108505996", "name": "Xiaofeng Wang"}, {"authorId": "1865225867", "name": "Teng Wang"}, {"authorId": "2143856694", "name": "Haotian Liu"}, {"authorId": "1931691545", "name": "Chaozu Zhang"}, {"authorId": "2176158725", "name": "Zhiyuan Zhou"}, {"authorId": "2647686", "name": "Qiaomu Shen"}, {"authorId": "1410395554", "name": "Bo Tang"}], "citations": [{"paperId": "b94d5abcf6f175e389f8879c292135463e3b1308", "title": "MaaS system visualization"}]}
