{"paperId": "958a7bfd8cd1f94684bfaea825e8e3f67e948a1b", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Data Valuation for Vertical Federated Learning: An Information-Theoretic Approach", "abstract": "Federated learning (FL) is a promising machine learning paradigm that enables cross-party data collaboration for real-world AI applications in a privacy-preserving and law-regulated way. How to valuate parties’ data is a critical but challenging FL issue. In the literature, data valuation either relies on running speciﬁc models for a given task or is just task irrelevant; however, it is often requisite for party selection given a speciﬁc task when FL models have not been determined yet. This work thus ﬁlls the gap and proposes FedValue , to our best knowledge, the ﬁrst privacy-preserving, task-speciﬁc but model-free data valuation method for vertical FL tasks. Speciﬁcally, FedValue incorporates a novel information-theoretic metric termed Shapley-CMI to assess data values of multiple parties from a game-theoretic perspective. Moreover, a novel server-aided federated computation mechanism is designed to compute Shapley-CMI and meanwhile protects each party from data leakage. We also propose several techniques to accelerate Shapley-CMI computation in practice. Extensive experiments on six open datasets validate the eﬀectiveness and eﬃciency of FedValue for data valuation of vertical FL tasks. In particular, Shapley-CMI as a model-free metric performs comparably with the measures that depend on running an ensemble of well-performing models.", "venue": "arXiv.org", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "ArXiv", "volume": "abs/2112.08364"}, "authors": [{"authorId": "2118233331", "name": "Xiao Han"}, {"authorId": "2143500842", "name": "Leye Wang"}, {"authorId": "2146669226", "name": "Junjie Wu"}], "citations": [{"paperId": "60a68540b62b46afabb592fa8e2d575897d73fdf", "title": "VertiBench: Advancing Feature Distribution Diversity in Vertical Federated Learning Benchmarks"}, {"paperId": "d6deb73f81c3c74519382ac97c9db73276ff5c16", "title": "Beyond model splitting: Preventing label inference attacks in vertical federated learning with dispersed training"}, {"paperId": "f13f014f51dd425661e3202067c5ef5052fe4d6a", "title": "Vertical Federated Learning"}, {"paperId": "17c88fab4e678443c132a2c8e06ba2e6a3a52380", "title": "Game of Privacy: Towards Better Federated Platform Collaboration under Privacy Restriction"}, {"paperId": "2f11e998e9ac38eca2a55a6e9b2dfa74e35a551e", "title": "Fair and efficient contribution valuation for vertical federated learning"}, {"paperId": "7d76acadc9712d229687c91cbd752ccb86d6c2f4", "title": "Mining Distributed Data using Vertical Federated Learning Review"}]}
