{"paperId": "95949c27c2296d945582d491b9648a6ecfee1688", "publicationVenue": {"id": "0942fb86-c16f-4084-9902-10ddcfe18180", "name": "Micro", "type": "conference", "alternate_names": ["Int Symp Microarchitecture", "MICRO", "International Symposium on Microarchitecture", "Annual IEEE/ACM International Symposium on Microarchitecture", "Annu IEEE/ACM Int Symp Microarchitecture"], "issn": "0271-9002", "alternate_issns": ["2151-4143", "2673-8023"], "url": "http://www.microarch.org/"}, "title": "How to Kill the Second Bird with One ECC: The Pursuit of Row Hammer Resilient DRAM", "abstract": "Error-correcting code (ECC) has been widely used in DRAM-based memory systems to address the exacerbating random errors following the fabrication process scaling. However, ECCs including the strong form of Chipkill have not been so effective against Row Hammer (RH), which incurs bursts of errors discretely corrupting the whole row beyond the ECC correction capability.We propose Cube, a novel chip-wise physical to DRAM address randomization scheme that leverages the abundant detection capability of on-die-ECC (OECC) and correction capability of Chipkill against RH. Cube allows for synergistic cooperation between ECC, probabilistic RH-protection schemes, and the system with minimal to no modification for each. First, Cube scrambles the rows of each chip using a boot-time key in a way that distributes RH victims to multiple Chipkill codewords. Second, Cube utilizes the newly observed distinct RH error characteristics from real DRAM chips, to swiftly diagnose the RH victim rows using the error profile from OECC scrubbing, and even correct it leveraging Chipkill. When combined, Cube decreases the failure probability of PARA and a state-of-the-art RH protection scheme SRS by up to 10−25. At a target failure probability of 10−10 per year on a DDR5 rank under the RH threshold of 2K, Cube reduces the performance and table size overhead of SRS by up to 24.3% and 39.9%, respectively.CCS CONCEPTS• Security and privacy → Security in hardware.", "venue": "Micro", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2023-10-28", "journal": {"name": "2023 56th IEEE/ACM International Symposium on Microarchitecture (MICRO)", "pages": "986-1001"}, "authors": [{"authorId": "2110079781", "name": "M. Kim"}, {"authorId": "2128606266", "name": "Minbok Wi"}, {"authorId": "2149167983", "name": "Jaehyun Park"}, {"authorId": "2068130258", "name": "Seoyoung Ko"}, {"authorId": "2272647700", "name": "Jaeyoung Choi"}, {"authorId": "2271508265", "name": "Hwayoung Nam"}, {"authorId": "2220629681", "name": "Nan Sung Kim"}, {"authorId": "2575874", "name": "Jung Ho Ahn"}, {"authorId": "7266659", "name": "Eojin Lee"}], "citations": []}
