{"paperId": "95a7e4b4d535a9c61a6f466a090a4004ef151b50", "publicationVenue": {"id": "764e3630-ddac-4c21-af4b-9d32ffef082e", "name": "IEEE International Conference on Data Engineering", "type": "conference", "alternate_names": ["ICDE", "Int Conf Data Eng", "IEEE Int Conf Data Eng", "International Conference on Data Engineering"], "url": "http://www.wikicfp.com/cfp/program?id=1331"}, "title": "Machine Learning for Data Management: A System View", "abstract": "Machine learning techniques have been proposed to optimize data management in recent years. Compared with traditional empirical data management, learning-based methods extract knowledge from historical tasks, generalize the extracted knowledge to similar new tasks, and can achieve better performance in many scenarios (e.g., knob tuning, cardinality estimation). However, data management systems require to handle various and dynamic workloads in different scenarios, and there are some challenges in applying machine learning techniques for data management systems. First, with various workloads and hundreds of system metrics, how to select and characterize effective features for data management problems? Second, with diversified machine learning models, how to design the proper models? Third, with various data management requirements, how to validate whether the machine learning models can meet the requirements? In this tutorial, we discuss existing learning-based data management studies and how they solve the above challenges, and provide some future research directions.", "venue": "IEEE International Conference on Data Engineering", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference", "Review"], "publicationDate": "2022-05-01", "journal": {"name": "2022 IEEE 38th International Conference on Data Engineering (ICDE)", "pages": "3198-3201"}, "authors": [{"authorId": "2242412700", "name": "Guoliang Li"}, {"authorId": "50177381", "name": "Xuanhe Zhou"}], "citations": [{"paperId": "ac0270e7af0b2b013156c888050be082c673c3cf", "title": "A Survey of Learned Indexes for the Multi-dimensional Space"}, {"paperId": "dba0c993eb176b495e7c5fb46e5198bb059beef9", "title": "Equitable Data Valuation Meets the Right to Be Forgotten in Model Markets"}, {"paperId": "c2338fe39fc8bac80914520022b6354c6cd0feb1", "title": "Future-Time Temporal Path Queries"}, {"paperId": "6c4939564ba3d47fd4e54ff6084128f21ddb8037", "title": "AutoCE: An Accurate and Efficient Model Advisor for Learned Cardinality Estimation"}, {"paperId": "49f04a0fadf6c6cf833555fe15fd3c32d6f46eae", "title": "AutoIndex: An Incremental Index Management System for Dynamic Workloads"}, {"paperId": "eadd8551b68b67c6b4feb7b46f0e3d7b63199999", "title": "Ontario DataBase Day – Program"}]}
