{"paperId": "95aba584548d75708d5e2c4166a665d73efe182c", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Should I send this notification? Optimizing push notifications decision making by modeling the future", "abstract": "Most recommender systems are myopic, that is they optimize based on the immediate response of the user. This may be misaligned with the true objective, such as creating long term user satisfaction. In this work we focus on mobile push notifications, where the long term effects of recommender system decisions can be particularly strong. For example, sending too many or irrelevant notifications may annoy a user and cause them to disable notifications. However, a myopic system will always choose to send a notification since negative effects occur in the future. This is typically mitigated using heuristics. However, heuristics can be hard to reason about or improve, require retuning each time the system is changed, and may be suboptimal. To counter these drawbacks, there is significant interest in recommender systems that optimize directly for long-term value (LTV). Here, we describe a method for maximising LTV by using model-based reinforcement learning (RL) to make decisions about whether to send push notifications. We model the effects of sending a notification on the user's future behavior. Much of the prior work applying RL to maximise LTV in recommender systems has focused on session-based optimization, while the time horizon for notification decision making in this work extends over several days. We test this approach in an A/B test on a major social network. We show that by optimizing decisions about push notifications we are able to send less notifications and obtain a higher open rate than the baseline system, while generating the same level of user engagement on the platform as the existing, heuristic-based, system.", "venue": "arXiv.org", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-02-17", "journal": {"name": "ArXiv", "volume": "abs/2202.08812"}, "authors": [{"authorId": "2125180703", "name": "Conor O'Brien"}, {"authorId": "3031125", "name": "Huasen Wu"}, {"authorId": "2632199", "name": "Shaodan Zhai"}, {"authorId": "27031083", "name": "Dalin Guo"}, {"authorId": "46810836", "name": "Wenzhe Shi"}, {"authorId": "2140273953", "name": "Jonathan J. Hunt"}], "citations": [{"paperId": "47de9bd8f74f8e03ef450078cbed6edfaf25e680", "title": "Multiagent Simulators for Social Networks"}, {"paperId": "ef5a07a1eb8fa48f7df84557425adb20bb4adf3f", "title": "Smart Notifications – An ML-based Framework to Boost User Engagement"}, {"paperId": "30a2a170b95c4600f7452286d40618158bd820f6", "title": "Fair Notification Optimization: An Auction Approach"}]}
