{"paperId": "95ad80fc3c0d0cfbbdf5b90f1eed1c92eda4b6b9", "publicationVenue": {"id": "6230dc6a-4e53-4bd5-b28f-289bf8938a6c", "name": "International Symposium on Intelligent Signal Processing and Communication Systems", "type": "conference", "alternate_names": ["ISPACS", "Int Symp Intell Signal Process Commun Syst"]}, "title": "Efficient protocol design for device-to-device communication in ultra dense networks", "abstract": "Focused on the requirement of Gigabit level throughput of 5G networks, two typical backhaul solutions in ultra-dense networks architectures are investigated. Moreover, an efficient protocol scheme was designed for device-to-device communication in ultra-dense networks on the basis of the two backhaul network architectures. The different devices can implement communication directly through multi-hop relay without macro base stations forwarding. Additionally, according to the characteristics of millimeter-wave coverage in ultra-dense networks, the paper presents the millimeter-wave dynamic bandwidth improvement mechanism of multi-user communication. Simulation results show that the effectiveness of the proposed scheme and correctness of the protocol analysis compared with the traditional mechanism, which can be seen that the proposed scheme improve the bit error rate (BER) performance effectively.", "venue": "International Symposium on Intelligent Signal Processing and Communication Systems", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2017-11-01", "journal": {"name": "2017 International Symposium on Intelligent Signal Processing and Communication Systems (ISPACS)", "pages": "861-865"}, "authors": [{"authorId": "2166312", "name": "Baofeng Ji"}, {"authorId": "2108024302", "name": "Yidan Wang"}, {"authorId": "40475557", "name": "Bingbing Xing"}, {"authorId": "144739761", "name": "Yi Wang"}, {"authorId": "2024360166", "name": "Kang Song"}, {"authorId": "1726286", "name": "Chunguo Li"}, {"authorId": "143960630", "name": "Rui Zhao"}], "citations": [{"paperId": "e82100a0cbb05440564f33c384fef43cb52d0b48", "title": "Employing non-orthogonal multiple access scheme in UAV-based wireless networks"}, {"paperId": "bdd4ebfb3bcab9526bf8d38fb9df85c85210af14", "title": "UAV Relaying Enabled NOMA Network With Hybrid Duplexing and Multiple Antennas"}, {"paperId": "ef4bba479ed4c51960686ea37894184ece6b1d14", "title": "Performance Analysis of UAV Relay Assisted IoT Communication Network Enhanced With Energy Harvesting"}, {"paperId": "dde0b3f9f3801f65d941ddb017a8b93b5c1e10c5", "title": "Efficient Transmitter Placement for User-to-User Communication in Green Smart Cloud"}]}
