{"paperId": "95b4fc8bfb3081bd0e9f15ff9f5ceda56df24eac", "publicationVenue": {"id": "a00fde74-d8df-4613-b825-0fff9f531d3f", "name": "IEEE Transactions on Network and Service Management", "type": "journal", "alternate_names": ["IEEE Trans Netw Serv Manag"], "issn": "1932-4537", "url": "http://ejournals.ebsco.com/direct.asp?JournalID=714200", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4275028", "http://ieeexplore.ieee.org/servlet/opac?punumber=4275028"]}, "title": "GMTA: A Geo-Aware Multi-Agent Task Allocation Approach for Scientific Workflows in Container-Based Cloud", "abstract": "Scientific workflow scheduling is one of the most challenging problems in cloud computing because of the large-scale computing tasks and massive data volumes involved. A cloud system is a distributed system that follows the on-demand resource provisioning and pay-per-use billing model. Therefore, practical scheduling approaches are essential for good workflow performance and low overheads. This paper proposes a novel workflow allocation approach, the Geo-aware Multiagent Task Allocation Approach (GMTA), which aims to optimize large-scale scientific workflow execution in container-based clouds. GMTA is an agent-based workflow allocation method that includes a market-like agent negotiation mechanism and a dynamic workflow restructuring strategy. It decreases workflow makespans and traffic overheads by reasonable task replications. Furthermore, the performance of GMTA is verified on real scientific workflows in the CloudSim environment.", "venue": "IEEE Transactions on Network and Service Management", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-05-21", "journal": {"name": "IEEE Transactions on Network and Service Management", "pages": "1568-1581", "volume": "17"}, "authors": [{"authorId": "2057069402", "name": "Meng Niu"}, {"authorId": "145828249", "name": "B. Cheng"}, {"authorId": "1443774174", "name": "Yimeng Feng"}, {"authorId": "2260825576", "name": "Junliang Chen"}], "citations": [{"paperId": "8e35ff23c3b782b921de35c0a2c36d28ed341be2", "title": "Hybrid fault tolerant cost aware mechanism for scientific workflow in cloud computing"}, {"paperId": "b894477fb0b5ad0e2eccca372317f1eeb4348115", "title": "RCoCo: Contrastive Collective Link Prediction across Multiplex Network in Riemannian Space"}, {"paperId": "bc683ce874b11ed932c3556aaf9d1f869d77ae52", "title": "NFLCS: An Service Function Chain Path Optimization Strategy Based on Network-Functional Layout Clustering"}, {"paperId": "3d12c7099efed95ef8ee28711207d7d8df0a6023", "title": "Data Security Aware and Effective Task Offloading Strategy in Mobile Edge Computing"}, {"paperId": "bb445f22a4f3275666d335ee44225a1941313bbf", "title": "Cooperative Resource Allocation for Computation-Intensive IIoT Applications in Aerial Computing"}, {"paperId": "012fbd3a947ff9786c8fdd3bbd9b156b032c35ea", "title": "Layer-Aware Containerized Service Orchestration in Edge Networks"}, {"paperId": "750029291303439c6f5e89c399fd1263f07d3db3", "title": "Multi-agent Systems for Resource Allocation in Cloud Computing"}, {"paperId": "b28a66af9ec9edd8c03dce4f8849184e282aba47", "title": "A collaborative scheduling method for cloud computing heterogeneous workflows based on deep reinforcement learning"}, {"paperId": "1f3bc41f19490074a43afe5d9c7de5c9d3988e02", "title": "Secure Industrial IoT Task Containerization With Deadline Constraint: A Stackelberg Game Approach"}, {"paperId": "bd4b78b572d4acc8944966de58bf5d331a399306", "title": "Multiagent Reinforcement Learning-Based Signal Planning for Resisting Congestion Attack in Green Transportation"}, {"paperId": "59025155db3556fdbdbcd16889df32c24ce2880a", "title": "Consensus enhancement for multi-agent systems with rotating-segmentation perception"}, {"paperId": "4de800c4034d773260b964559c10a7432b0d9945", "title": "Multi-objective Optimization of Clustering-based Scheduling for Multi-workflow On Clouds Considering Fairness"}, {"paperId": "66b13ee3f222a6aed1e9b0aab0b847197aeefb14", "title": "A comprehensive survey on container resource allocation approaches in cloud computing: State-of-the-art and research challenges"}, {"paperId": "7048872ca353356bf53828c0b32fdb332111607f", "title": "Survey on Astroturfing Detection and Analysis from an Information Technology Perspective"}, {"paperId": "51c890c4b885dedb5b92c18b35c3d207edd9673b", "title": "Magnetic Sensor-Based Multi-Vehicle Data Association"}, {"paperId": "a3ca3bcfa3a1c5397f31f8f23895fccb90de8c67", "title": "Weighted double deep Q-network based reinforcement learning for bi-objective multi-workflow scheduling in the cloud"}, {"paperId": "58d9dd3350d5513f1843e0b62e0fe48fc0be2f9a", "title": "Adaptive Resource Provisioning and Scheduling Algorithm for Scientific Workflows on IaaS Cloud"}, {"paperId": "f3e7f77999c1ff364f59e2c93f30f6934347c867", "title": "GPSO: A Graph-based Heuristic Algorithm for Service Function Chain Placement in Data Center Networks"}, {"paperId": "b348c865f66514afb123e19c90e8c5ad91d71feb", "title": "TSFCC: high availability service function chain composition approach in mobile network"}]}
