{"paperId": "95b419b20eba5e21731a5d6f85e34ebd19814038", "publicationVenue": null, "title": "Ukraine higher education based on data-driven decision making (DDDM)", "abstract": "This article presents a theoretical review and empirical study of the assessment of the quality of BA and MA online education during the Russian military invasion of Ukraine in 2022. A qualitative theoretical analysis and comparison are made with a study of higher education quality assessment across Ukraine during the war in 2022 (\\textit{N} = 12019). The article analyzes the tools and structure of student feedback on the evaluation of the educational process. The undergraduate and graduate programs are modified based on the analysis of this data. In the Ukrainian higher education space, the National Qualifications Framework requirements for each specialty have been under development since 2014. The National Qualifications Framework developed a list of interdisciplinary competencies that should be transferred to academic courses. According to the Ukrainian higher education standard, universities must provide empirical evidence that their students actually acquire these competencies. Baseline data on the assessment of the quality of online education by student teachers during the war in Ukraine is presented using the case study of the Kriviy Rih State Pedagogical University (\\textit{N} = 688). Further modifications of the questionnaire to assess the quality of teaching in order to improve data-driven decision-making and testing ethics are proposed.", "venue": "CoSinE", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-03-21", "journal": {"pages": "53-72"}, "authors": [{"authorId": "2142726131", "name": "K. Bondar"}, {"authorId": "1573399763", "name": "O. Shestopalova"}, {"authorId": "1657696131", "name": "V. Hamaniuk"}, {"authorId": "2219513805", "name": "Vyacheslav Tursky"}], "citations": [{"paperId": "21a9be2e411aecbe3bd33bba9f48ca720890e1a4", "title": "ACNS Conference on Cloud and Immersive Technologies in Education: Report"}, {"paperId": "83dddcfd9973f3ef851e15e93e2494ccc5307592", "title": "Revolutionizing education: using computer simulation and cloud-based smart technology to facilitate successful open learning"}]}
