{"paperId": "95bcb67ec106a75f3b4b06006845537a4159f898", "publicationVenue": {"id": "f32b7322-b69c-4e63-801d-8f50784ef778", "name": "Computational Intelligence and Neuroscience", "type": "journal", "alternate_names": ["Comput Intell Neurosci"], "issn": "1687-5265", "url": "https://www.hindawi.com/journals/cin/"}, "title": "Design and Development of a Big Data Platform for Disease Burden Based on the Spark Engine", "abstract": "Objective This study attempts to build a big data platform for disease burden that can realize the deep coupling of artificial intelligence and public health. This is a highly open and shared intelligent platform, including big data collection, analysis, and result visualization. Methods Based on data mining theory and technology, the current situation of multisource data on disease burden was analyzed. Putting forward the disease burden big data management model, functional modules, and technical framework, Kafka technology is used to optimize the transmission efficiency of the underlying data. This will be an efficient and highly scalable data analysis platform through embedding embedded Sparkmlib in the Hadoop ecosystem. Results With the concept of “Internet + medical integration,” the overall architecture design of the big data platform for disease burden management was proposed based on the Spark engine and Python language. The main system composition and application scenarios are given at four levels: multisource data collection, data processing, data analysis, and the application layer, according to application scenarios and use requirements. Conclusion The big data platform of disease burden management helps to promote the multisource convergence of disease burden data and provides a new path for the standardized paradigm of disease burden measurement. Provide methods and ideas for the deep integration of medical big data and the formation of a broader standard paradigm.", "venue": "Computational Intelligence and Neuroscience", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-02-06", "journal": {"name": "Computational Intelligence and Neuroscience", "volume": "2023"}, "authors": [{"authorId": "2204746662", "name": "Chengcheng Li"}, {"authorId": "2115555917", "name": "Jing Gao"}, {"authorId": "2204818296", "name": "Qingwei Pan"}, {"authorId": "98392961", "name": "Z. Zhou"}, {"authorId": "2118065047", "name": "Yue Yang"}, {"authorId": "7523347", "name": "Shangcheng Zhou"}], "citations": []}
