{"paperId": "95c3f86f2f3a010b584e1650fd44fa0323b2976e", "publicationVenue": {"id": "fcbcaf18-8ab1-43e1-a973-604bbc7e344e", "name": "Proceedings of the VLDB Endowment", "type": "journal", "alternate_names": ["Proceedings of The Vldb Endowment", "Proc VLDB Endow", "Proc Vldb Endow"], "issn": "2150-8097", "url": "http://dl.acm.org/toc.cfm?id=J1174", "alternate_urls": ["http://portal.acm.org/toc.cfm?CFID=21632689&CFTOKEN=99329904&WantType=Affiliated%20Organizations&coll=ACM&dl=ACM&id=J1174&idx=J1174&part=affil&title=VLDB%20Endowment&type=periodical"]}, "title": "OctopusFS in Action: Tiered Storage Management for Data Intensive Computing", "abstract": "The continuous improvements in memory, storage devices, and network technologies of commodity hardware introduce new challenges and opportunities in tiered storage management. Whereas past work is exploiting storage tiers in pairs or for specific applications, OctopusFS---a novel distributed file system that is aware of the underlying storage media---offers a comprehensive solution to managing multiple storage tiers in a distributed setting. OctopusFS contains auto-mated data-driven policies for managing the placement and retrieval of data across the nodes and storage tiers of the cluster. It also exposes the network locations and storage tiers of the data in order to allow higher-level systems to make locality-aware and tier-aware decisions. This demonstration will showcase the web interface of OctopusFS, which enables users to (i) view detailed utilization information for the various storage tiers and nodes, (ii) browse the directory namespace and perform file-related actions, and (iii) execute caching-related operations while observing their performance impact on MapReduce and Spark workloads.", "venue": "Proceedings of the VLDB Endowment", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-08-01", "journal": {"name": "Proc. VLDB Endow.", "pages": "1914-1917", "volume": "11"}, "authors": [{"authorId": "1732624", "name": "E. Kakoulli"}, {"authorId": "2100308633", "name": "Nikolaos Karmiris"}, {"authorId": "2013116", "name": "H. Herodotou"}], "citations": [{"paperId": "c6062810bc407f8e38f5fe1bba57a2cc8e316358", "title": "HintStor: A Framework to Study I/O Hints in Heterogeneous Storage"}]}
