{"paperId": "95e251f44794acb5dc02ac2409a3f093e1121aa6", "publicationVenue": {"id": "5640d101-aca5-4a94-b2ae-56233ede88fa", "name": "International Journal of Evaluation and Research in Education (IJERE)", "type": "journal", "alternate_names": ["Int J Evaluation Res Educ", "Int J Evaluation Res Educ (IJERE", "International Journal of Evaluation and Research in Education"], "issn": "2252-8822", "url": "http://iaesjournal.com/online/index.php/IJERE"}, "title": "Artificial intelligent based teaching and learning approaches: A comprehensive review", "abstract": "The goal of this study is to investigate the potential effects that Artificial intelligence (AI) could have on education. The narrative and framework for investigating AI that emerged from the preliminary research served as the basis for the study’s emphasis, which was narrowed down to the use of AI and its effects on administration, instruction, and student learning. According to the findings, artificial intelligence has seen widespread adoption and use in education, particularly by educational institutions and in various contexts and applications. The development of AI began with computers and technologies related to computers; it then progressed to web-based and online intelligent education systems; and finally, it applied embedded computer systems in conjunction with other technologies, humanoid robots, and web-based chatbots to execute instructor tasks and functions either independently or in partnership with instructors. By utilizing these platforms, educators have been able to accomplish a variety of administrative tasks. In addition, because the systems rely on machine learning and flexibility, the curriculum and content have been modified to match the needs of students. This has led to improved learning outcomes in the form of higher uptake and retention rates.", "venue": "International Journal of Evaluation and Research in Education (IJERE)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-12-01", "journal": {"name": "International Journal of Evaluation and Research in Education (IJERE)"}, "authors": [{"authorId": "2263560458", "name": "Thuong TK. Nguyen"}, {"authorId": "2264185132", "name": "Minh T. Nguyen"}, {"authorId": "49160776", "name": "Hoa T. Tran"}], "citations": [{"paperId": "8fc2263e6a3ba1ba33226454ec8242ce008bda80", "title": "Bibliometric review on teaching methods with artificial intelligence in education"}, {"paperId": "a196b9c85702330df6cc4e0a0b2fe1edf251ac3e", "title": "Integrating Artificial Intelligence (AI) in Teaching and Learning"}, {"paperId": "9e38c554a2d681ba0e81bfca7762f4a5e4b1895b", "title": "Unveiling Insights: A Bibliometric Analysis of Artificial Intelligence in Teaching"}]}
