{"paperId": "95eaf447add28a193124e298a5f7ba4dafee509e", "publicationVenue": {"id": "eed1ae5e-6152-44eb-8c1c-eda80eb227dc", "name": "IEEE PES Innovative Smart Grid Technologies Conference", "type": "conference", "alternate_names": ["IEEE PE Innov Smart Grid Technol Conf", "ISGT"]}, "title": "VAC: A Software Approach to Resilient SCADA Automation", "abstract": "To better secure critical infrastructure, especially power systems, this paper introduces a virtual SCADA automation controller. The automation controller is a gateway into a power subsystem, making it a valuable target for cyber-attacks that could cut it off from the control center and cause a loss of view and control. To prevent this, the Virtual Automation Controller (VAC) is a backup device that mirrors the capabilities of the physical controller. It can communicate via Modbus and DNP3 and is containerized so it can be deployed on a variety of platforms. Furthermore, it utilizes software-defined networking to quickly disconnect a failed automation controller and preserve its state for forensics. The VAC gives system operators time to replace the failed controller and prevents dangerous and costly damage to power systems. The VAC is compared against the SEL 3505-3 RTAC and shown to have the necessary features to act as a failover controller.", "venue": "IEEE PES Innovative Smart Grid Technologies Conference", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-04-24", "journal": {"name": "2022 IEEE Power & Energy Society Innovative Smart Grid Technologies Conference (ISGT)", "pages": "1-5"}, "authors": [{"authorId": "1994377201", "name": "Jordan Johnson"}, {"authorId": "2057135705", "name": "Brian Weber"}, {"authorId": "2119124529", "name": "Jared Smith"}, {"authorId": "2852203", "name": "Chris Hathhorn"}, {"authorId": "3366231", "name": "P. Irminger"}, {"authorId": "2142732750", "name": "Savannah Norem"}, {"authorId": "2176082769", "name": "Jennifer Guerra"}, {"authorId": "122737187", "name": "Joel Dawson"}, {"authorId": "2106296182", "name": "Tyler McDaniel"}], "citations": []}
