{"paperId": "95f6817ffe852133e3f166a4e949e602b23a7008", "publicationVenue": {"id": "657a4bec-9a11-40fb-acfe-243d7fb993ae", "name": "Frontiers in Earth Science", "type": "journal", "alternate_names": ["Frontiers of Earth Science", "Frontiers in Earth Sciences", "Front Earth Sci"], "issn": "2296-6463", "alternate_issns": ["1863-4621", "2095-0195"], "url": "http://www.frontiersin.org/Earth_Science", "alternate_urls": ["http://journal.hep.com.cn/fesci/EN/2095-0195/current.shtml", "http://www.frontiersin.org/Journal/Archive.aspx?artId=0&f=19&name=Earth_Science", "https://www.frontiersin.org/journals/earth-science", "https://www.springer.com/series/7066"]}, "title": "Adsorption mechanism of shell powders on heavy metal ions Pb2+/Cd2+ and the purification efficiency for contaminated soils", "abstract": "The adsorption capacity of oyster shell powders (SPs) and the adsorption mechanism of heavy metal ions (HMs; i.e., cadmium ions Cd2+ and lead ions Pb2+) on SPs are discussed by means of adsorption kinetics tests, adsorption-desorption tests, scanning electron microscopy and Fourier transform infrared spectroscopy. The influences of seepage velocity, heavy metal types, and SP addition amount/concentration on the adsorption effect of SPs in the treatment of HMs in laterite as well as quartz sand were analyzed. Studies have shown that i) the adsorption of HMs on SPs can be divided into three stages, i.e., the surface adsorption stage, the internal pore diffusion stage, and the equilibrium stage; ii) with the increase in seepage velocity, the effluent concentration of HMs will slightly increase, and the residual amounts at each section of the column generally decrease rapidly with the increase in migration distance; iii) the increase in the concentration of SP solution provides more adsorption points for the adsorption of HMs, and finally, the amount of HMs desorbed from quartz sand is reduced, which also reduces the concentration of HMs in the effluent. Overall, SPs possess high purification efficiency for the HMs of contaminated soils.", "venue": "Frontiers in Earth Science", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-01-12", "journal": {"volume": "10"}, "authors": [{"authorId": "2064458298", "name": "Bing Bai"}, {"authorId": "47706965", "name": "F. Bai"}, {"authorId": "2216208081", "name": "Chenmiao Sun"}, {"authorId": "12970912", "name": "Qingke Nie"}, {"authorId": "25484824", "name": "Shuo Sun"}], "citations": [{"paperId": "471aa5fe92153fbc3c26840272b7e78e20f17dc3", "title": "Vertical migration behavior simulation and prediction of Pb and Cd in co-contaminated soil around Pb-Zn smelting slag site."}, {"paperId": "5365d85b222be8d49fcbfdb26dfac576f4c75185", "title": "Investigating the Potential of Untreated and Treated Waste Cooking Oil for Rejuvenation of Aged Asphalt Binder"}, {"paperId": "66763b04c87187c7fe98cdc0b5152f83cbfa7035", "title": "Oyster shell-modified lignite composite in globular shape as a low-cost adsorbent for the removal of Pb2+ and Cd2+ from AMD: Evaluation of adsorption properties and exploration of potential mechanisms"}, {"paperId": "e6277b72da6ce7ac29a9edd490e235b8dfc61eea", "title": "Experimental Investigation and Proposal of Artificial Neural Network Models of Lead and Cadmium Heavy Metal Ion Removal from Water Using Porous Nanomaterials"}, {"paperId": "794bf7ca201badef11430569ad609b7c49ac0cb9", "title": "Use of different food wastes as green biosorbent: isotherm, kinetic, and thermodynamic studies of Pb^2+"}, {"paperId": "bf073bb51a95a08142f9f5afc5b0e2bc61f459eb", "title": "Effects of vitamins A, C, and D and zinc on urinary tract infections"}, {"paperId": "b6675b435ed91bc8aeb87eec30e494fb788c1da3", "title": "Iron-modified biochar improves plant physiology, soil nutritional status and mitigates Pb and Cd-hazard in wheat (Triticum aestivum L.)"}, {"paperId": "9100935ffd2e93985e83c2f17476b8515b635441", "title": "A review on radionuclide pollution in global soils with environmental and health hazards evaluation"}, {"paperId": "490a6afb63336e6c37a571a375b1829df6c427ca", "title": "Soil water stress alters differentially relative metabolic pathways affecting growth performance and metal uptake efficiency in a cadmium hyperaccumulator ecotype of Sedum alfredii"}, {"paperId": "0ac4ac43ad9b033553792d38d2fd75a48ca945fc", "title": "The ability of zinc oxide nanostructures for removal of Pb2+, Cu2+, Ag2+ and Cd2+ ions from wastewater: computational perspective"}, {"paperId": "31658728910450f41eee12aa4a9f0bac34ea5bea", "title": "Evaluation of heavy metals contamination in cereals, vegetables and fruits with probabilistic health hazard in a highly polluted megacity"}, {"paperId": "2b599e03748b313a7972cc16e66d535dc62d8c1a", "title": "Evaluating gas breakthrough pressure and gas permeability in a landfill cover layer for mitigation of hazardous gas emissions."}, {"paperId": "0e74cdecfacd902aa12c6e40f57f496e77178c8c", "title": "The concentration of Lithium in water resources: A systematic review, meta-analysis and health risk assessment"}, {"paperId": "5a940ec438e9bf5f0346e5d5ea4952f3ac2f8b30", "title": "Effects of UV-irradiation on Cd<mml:math xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" display=\"inline\" id=\"d1e435\" altimg=\"si131.svg\"><mml:msup><mml:mrow /><mml:mrow><mml:mn>2</mml:mn><mml:mo>+</mml:mo></mml:mrow></mml:msup></mml:math> and Pb<mml:math xmlns:mml=\"http://www.w3.org/1998/Math/MathML\""}, {"paperId": "110324092b1f5a80873a6d4e9186b86b07256582", "title": "Evaluating the emerging adsorbents for water production potential and thermodynamic limits of adsorption-based atmospheric water harvesting systems"}, {"paperId": "7d3bb1a30080fba2c9a645a6b230cf6207852ffe", "title": "AlC3 monolayer as an efficient adsorbent for removal of edifenphos molecule: a density functional theory study"}, {"paperId": "84ba3724b83c7cca63f0a27f9e5d73cbb7a8239a", "title": "Highly reusable bentonite clay@biochar@Fe_3O_4 nanocomposite for Hg(II) removal from synthetic and real wastewater"}, {"paperId": "12da389756ee780c3ddc080d9773e1e9be137a48", "title": "Seepage Migration Process of Soluble Contaminants in Porous Medium considering Adsorption History"}, {"paperId": "3a6228050359aa51c14148b7f3850f0ed33b7236", "title": "Advancements in Wastewater Treatment: A Computational Analysis of Adsorption Characteristics of Cationic Dyes Pollutants on Amide Functionalized-MOF Nanostructure MIL-53 (Al) Surfaces"}, {"paperId": "002718a108f662311276081eeab35239dbdbc37e", "title": "Transition Metal-Functionalized Porphyrin-Like C70 Fullerenes as Sensors and Adsorbents of Formaldehyde- DFT, NBO, and QTAIM study"}, {"paperId": "6e8111bda51ab1533bf65e0dc9fb2212a20ec535", "title": "Ce(ΙΙΙ) and La(ΙΙΙ) ions adsorption through Amberlite XAD-7 resin impregnated via CYANEX-272 extractant"}, {"paperId": "6860acbe2cd83c2bad818f76e6b3dd1e7d5ec1c8", "title": "Potential toxic elements in costal sediment of the Persian Gulf: a systematic review-meta-analysis, non-dietary risk assessment and ecological risk assessment"}, {"paperId": "db21be9357c32587791a852d57ef110b5cffb21b", "title": "Chitosan dendron-cultivated magnetic graphene oxide as novel glycodendrimer for adsorptive removal of sunset yellow from aqueous solutions"}, {"paperId": "10e23a820d79a89053a543552cbe8b0a3bba9752", "title": "Synthesis of semiconductor ZnO nanostructures using Arctostaphylos pungens extract applicated in the photodegradation of water pollutions"}, {"paperId": "4d5923b3784416375c428e6dc2c731d5ae2ede30", "title": "Synthesis and Characterization of Biodegradable Poly(vinyl alcohol)-Chitosan/Cellulose Hydrogel Beads for Efficient Removal of Pb(II), Cd(II), Zn(II), and Co(II) from Water"}, {"paperId": "ae66754c8661965fa65c60f2149c5d8e1dd10fd1", "title": "Groundwater spring potential prediction using a deep-learning algorithm"}, {"paperId": "1f2ca70cbbe4620fa3584bb7c35e5702af2e70e9", "title": "Study on Gas Flow Parameters and Fractional Removal Efficiency of Ultrafine Particulate Matter in Newly Developed Electro Cyclone-Filter"}, {"paperId": "21b0bf6d2cf41425f94eaeaaa6a6683262450077", "title": "Investigation of the viable role of oil sludge-derived activated carbon for oily wastewater remediation"}, {"paperId": "7823dc9ea29687ddc433d40ac0ef3288cf89ed66", "title": "A high-strength red mud–fly ash geopolymer and the implications of curing temperature"}, {"paperId": "ef46078958fc9aa0a99fcfb3cb032f591327e91e", "title": "Unveiling the Role of Dissolved Organic Matter on the Hg Phytoavailability in Biochar-Amended Soils"}, {"paperId": "68d076e619a913718a8b064eff94e069f769e683", "title": "Removal of chromium (VI) from aqueous environments using composites of polyaniline-cherry leaves."}, {"paperId": "91310a672c4f7145da1c07a27e7c5d1e8da354a0", "title": "The elimination and extraction of organosulfur compounds from real water and soil samples using metal organic framework/graphene oxide as a novel and efficient nanocomposite."}, {"paperId": "27b82639916bf3b8f4175cbe6c6c1e4f28ff8415", "title": "The shells of edible freshwater snails as a biosorbent for multi-metal ions from wastewater: Implication in effluent purification and waste valorisation"}]}
