{"paperId": "95f7114b45b9d0fc617cc5c85a55249b4504cfd4", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Spatiotemporal Trends and Driving Factors of Urban Livability in the Yangtze River Delta Agglomeration", "abstract": "With the development of cities, the relationship between cities is becoming closer, and the study of urban livability based on a single city can no longer meet the guidelines and suggestions for urban agglomerations. A scientific evaluation of livability in urban agglomerations can better help cities to recognize the advantages and disadvantages. However, most studies on urban livability focus on its connotation and history and neglect simulations and analyses of the future. Based on the Yangtze River Delta agglomeration, this paper establishes an index system using data from 2011 to 2019 to simulate urban livability from 2020 to 2025 through the ARIMA model and analyzes the historical and future data by using GIS methods. The results show the following: (1) The ARIMA model has good simulation accuracy when applied to urban livability analysis and can provide a reference for future urban livability development. (2) The urban livability of the Yangtze River Delta agglomeration has obviously changed both on the whole and in subsystems. Cities in the upper ranking of livability have developed rapidly, and the difference in urban livability has increased. (3) The spatial autocorrelation of urban livability in the Yangtze River Delta agglomeration is obvious both on the whole and in subsystems. (4) The influencing factors of urban livability development are diverse. The general public budget expenditure for social security and employment, fixed assets investment in municipal public facilities, total retail sales of consumer goods, and education and medical expenditures have positive effects on the development of urban livability, while industrial SO2 emissions have a negative effect. The results show that cities should strengthen inter-city relationships, promote the coordinated development of inter-regional cities, and formulate relevant policies to improve the level of urban environmental governance in the region.", "venue": "Sustainability", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-11-27", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "2108652023", "name": "Yichen Yang"}, {"authorId": "2322472", "name": "S. Fang"}, {"authorId": "2149181770", "name": "Hua Wu"}, {"authorId": "1783288", "name": "Jiaqiang Du"}, {"authorId": "2142862122", "name": "Haomiao Tu"}, {"authorId": "2000585847", "name": "Wei He"}], "citations": [{"paperId": "acb2e84c3434fbc8b8b37b5f46dbbb8832010ecc", "title": "Does Urban Livability Lead to Place Attachment and Behavioural Intentions? Case Study: Isfahan City"}, {"paperId": "bea8248f25c454ccaddcee57d83bda073ed435f3", "title": "EVALUATION OF URBAN LIVABILITY BASED ON SPATIAL DISTRIBUTION AND FUNCTIONAL RADIUS OF LAND USES"}, {"paperId": "fa06e02da8330f1791ecf06ae9686e0f187da371", "title": "Spatial and temporal characteristics of rural livability and its influencing factors: implications for the development of rural revitalization strategy"}, {"paperId": "c65997b0e2320bbe56851a13d09216c84fe4995e", "title": "A county-scale assessment of ecosystem health in the Three Gorges Reservoir area based on catastrophe theory"}, {"paperId": "76d2d04b2844b836cff016816d8fe603e58fa165", "title": "Prediction and empirical research on the evolution trend of individual opinions in knowledge collaboration"}, {"paperId": "cfcc854be16c4f43acaf15aa7181bfd6c6ed8326", "title": "Study on coupling coordination of the human settlement environment and tourism industry in the yellow river basin"}, {"paperId": "4014e21c7d6f049a0f6fd8beba48454ae31b10e4", "title": "Analysis of the coupling coordinated development and evolutionary trend of digital economy and ecological environment"}]}
