{"paperId": "95fa0bbcd164d2f77f82687dda728c9b8c6bd1fc", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "SGF-MD: Behavior Rule Specification-Based Distributed Misbehavior Detection of Embedded IoT Devices in a Closed-Loop Smart Greenhouse Farming System", "abstract": "Smart farming is rapidly revolutionizing the agricultural sector where embedded Internet of Things (IoT) devices are integrated into the field to maintain or improve the quality of products as well as increase food production. Despite the tremendous benefits, various cybersecurity threats of IoT can also be inherited by the sector. In this paper, we propose a lightweight specification-based distributed detection to identify the misbehavior of heterogeneous embedded IoT nodes efficiently and effectively in a closed-loop smart greenhouse farming system. To expand the monitoring space of a node, we exploited the Kalman-filter algorithm and simple statistical operations to obtain estimates of data. Accordingly, this enables a monitoring node to assess a target node that has distinct physical characteristics and access to natural phenomena. Along with this, we derive the behavior-rules that are specific to the target system and carefully translate these rules into a state machine diagram. Besides, we formally verify the functional correctness of the monitoring processes as well as ensure that the behavior specifications are completely covered by using the model checker tool UPPAAL. Through extensive experimental simulation using Proteus, we verify its applicability to resource-constrained embedded devices, e.g., Arduino-Uno, as well as show high accuracy in detecting misbehaving nodes while having low false alarms.", "venue": "IEEE Access", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-10-15", "journal": {"name": "IEEE Access", "pages": "196235-196252", "volume": "8"}, "authors": [{"authorId": "72315400", "name": "P. Astillo"}, {"authorId": "107728201", "name": "Jiyoon Kim"}, {"authorId": "144582540", "name": "Vishal Sharma"}, {"authorId": "144026287", "name": "I. You"}], "citations": [{"paperId": "3cdc968324be044f57c45e7ea4ae72e81c47781b", "title": "Prediction of DDoS attacks in agriculture 4.0 with the help of prairie dog optimization algorithm with IDSNet"}, {"paperId": "4a8122f343052f2565b3fb0400392e85a83874ba", "title": "IoT based agriculture (Ag-IoT): A detailed study on architecture, security and forensics"}, {"paperId": "7acc8a5c49149332ca3abd9c8e1e5766ef5eca97", "title": "Monitoring and prediction of smart farming in fog-based IoT environment using a correlation based ensemble model"}, {"paperId": "0b2e4715c70c5f79eeaffad6a9774cb0392babd0", "title": "A Critical Cybersecurity Analysis and Future Research Directions for the Internet of Things: A Comprehensive Review"}, {"paperId": "63ee8b7c7cb9110511524a6ec839eb92ef7aa7a7", "title": "Novel Framework for Secure Data Aggregation in Precision Agriculture with Extensive Energy Efficiency"}, {"paperId": "03733d673229983e780b43729c985bb70e94f166", "title": "Technologies Driving the Shift to Smart Farming: A Review"}, {"paperId": "e09c37d67e8251a859582f40919608f3296c90b2", "title": "SGM: Strategic Game Model for Resisting Node Misbehaviour in IoT-Cloud Ecosystem"}, {"paperId": "1cbcf0f00841268b31307a9e714924594e4316d9", "title": "Threats and Corrective Measures for IoT Security with Observance of Cybercrime: A Survey"}, {"paperId": "5a897c74e5ab8da93a1bd2bad64e2fd8bc5e042b", "title": "Developing a Modern Greenhouse Scientific Research Facility—A Case Study"}, {"paperId": "52a39b952483d95d7ad566c4f7f66af185da9e52", "title": "Novel Secure Scheme for On-Field Sensors for Data Aggregation in Precision Agriculture"}, {"paperId": "e37d3e37d664686dc76a16c7c05a77f10cc99cd9", "title": "IoT Based Smart Greenhouse Framework and Control Strategies for Sustainable Agriculture"}, {"paperId": "cf46b4aff74cd03ebade6ecc389f54137927027d", "title": "Security of The Embedded and IoT Systems: Threats, Attacks, and Countermeasures"}, {"paperId": "bf4f05239e355b563facb875bd4f6750a7087e53", "title": "SMDAps: A Specification-based Misbehavior Detection System for Implantable Devices in Artificial Pancreas System"}]}
