{"paperId": "95fdd2ff52e9a22a049ff55d7330db3e16e46318", "publicationVenue": {"id": "05479075-64ee-4b95-b9a7-023afff1b556", "name": "Minerals", "type": "journal", "issn": "2075-163X", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-225448", "alternate_urls": ["https://www.mdpi.com/2075-163X/7/7/121", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-225448", "https://www.mdpi.com/journal/minerals"]}, "title": "Roof Subsidence and Movement Law of Composite Strata Mining: Insights from Physical and Numerical Modeling", "abstract": "Sinking and horizontal movements are necessary parameters for assessing the potential impacts of surface subsidence in mining activities. Based on similarity criteria, the surface subsidence mechanism was studied using a physical model composed of similar materials such as sand, cement, and gypsum. With constant field geological parameters maintained in two angles of a coal seam, models of roof subsidence of composite rock were compared for different mining configurations. In accordance with observations from the physical model, it was concluded that subsidence and horizontal movement of strata near to and far from the coal seams were different and divided into five zones. The zone above a mined-out area underwent greater total subsidence compared to unexploited regions on both sides. Correlations between a subsidence curve and the height of a caving zone and the mining dip angle were obtained and verified from numerical model results. According to the roof’s position relative to the goaf, the area above the goaf of the composite rock layer was divided into three regions: a curving zone, a water-conducting fracture zone, and a falling zone, to which the subsidence and movement characteristics of each area could be proposed. Compared with the subsidence and movement characteristics observed from the physical and numerical model, the acquisition of subsidence characteristics and parameters in different areas can provide an idea for improvement, innovation or proposal of a theoretical formula for subsidence prediction of composite rock formations.", "venue": "Minerals", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-12-21", "journal": {"name": "Minerals"}, "authors": [{"authorId": "2154822526", "name": "Yongqian Wang"}, {"authorId": "2108319853", "name": "Xuan Wang"}, {"authorId": "49051287", "name": "Jiasheng Zhang"}, {"authorId": "46772881", "name": "Xiao-bin Chen"}, {"authorId": "2108863565", "name": "W. Zhu"}, {"authorId": "2153637932", "name": "Yu Zhang"}], "citations": [{"paperId": "7bc680e0982b08b324147fd7f41d803df156d229", "title": "Gas Migration Law and Precision Extraction in Close Distance Coal Seam Goaf: A Case Study"}, {"paperId": "8e676f5aeea75abb6e85f840793aab691b1033ac", "title": "A Study on the Instability Mechanisms of Coal Pillars in Shallow Coal Seams Group Mining"}, {"paperId": "e26c619467614c955fe18bc5ba75d22d8a76ffec", "title": "Supporting optimization of thick seam roadway with top coal based on orthogonal matrix analysis"}]}
