{"paperId": "9607b80f12f4e930e1b8ce5229627efc225286f1", "publicationVenue": null, "title": "Detecting Pedestrian Crossing Events in Large Video Data from Traffic Monitoring Cameras", "abstract": "Pedestrian safety on the road is a priority for transportation system managers and operators. While there are a number of treatments and technologies to effectively improve pedestrian safety, identifying the location where these are most needed remains a challenge. Mid-block locations, where safety countermeasures are often needed the most, are typically harder to monitor. Current practice often requires manual observation of candidate locations for limited time periods, leading to an identification process that is often time consuming, lags behind traffic pattern changes over time, and lacks scalability. As a result, target locations are often selected reactively, after serious traffic incidents reveal an underlying safety issue. We propose an approach to use data collected by existing traffic monitoring cameras to automatically identify pedestrian activities on the road. We propose an algorithm to detect pedestrian crossing events based on the detection of individuals on individual video frames using a deep neural network model. Resulting pedestrian locations and movement trajectories can be visualized on a background image, which is automatically extracted at the analyzed location from the video. We demonstrate and evaluate our approach with a real-world use case. The case study considered in this work uses cameras owned by the City of Austin, Texas to study pedestrian road use before and after the deployment of a pedestrian-hybrid beacon. We explore qualitative and quantitative metrics to describe pedestrian activity and corresponding changes, which may be used to prioritize the deployment of pedestrian safety solutions, or evaluate their performance. We compared the number of crossing events detected per hour with manually reviewed results from a selected day. The result shows 67 percent overall accuracy, although we observe significant variability across times-of-day. Despite observed limitations, our work illustrates how the value of existing traffic camera networks can be augmented beyond everyday traffic monitoring, and used to collect valuable information on road usage by pedestrians.", "venue": "2019 IEEE International Conference on Big Data (Big Data)", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference", "Review"], "publicationDate": "2019-12-01", "journal": {"name": "2019 IEEE International Conference on Big Data (Big Data)", "pages": "3824-3831"}, "authors": [{"authorId": "48721583", "name": "Weijia Xu"}, {"authorId": "1405836287", "name": "Natalia Ruiz-Juri"}, {"authorId": "77625791", "name": "Kelly A. Pierce"}, {"authorId": "34446751", "name": "Ruizhu Huang"}, {"authorId": "20172843", "name": "Joel Meyer"}, {"authorId": "48435011", "name": "J. Duthie"}], "citations": [{"paperId": "7cd395a2f0aa899afeea9455c70d7bbbb430852d", "title": "Towards the Robustness of Multiple Object Tracking Systems"}, {"paperId": "3a9c17f7bf7d7efddcf1857eb7273a0a6f45c45c", "title": "Design, Implementation and Experimental Investigation of a Pedestrian Street Crossing Assistance System Based on Visible Light Communications"}, {"paperId": "963a8ca7cce4261c5545e2815fb1dc8bfeffd431", "title": "Traffic Behavior Recognition from Traffic Videos under Occlusion Condition: A Kalman Filter Approach"}, {"paperId": "5e16f11f658aa683afb078bdd92d3c64e5784182", "title": "Recognition and Co-Analysis of Pedestrian Activities in Different Parts of Road using Traffic Camera Video"}, {"paperId": "dcb07f3899c967e84067a8ac588ad56beffa20ff", "title": "STI-GAN: Multimodal Pedestrian Trajectory Prediction Using Spatiotemporal Interactions and a Generative Adversarial Network"}]}
