{"paperId": "962d941842606a95315bd0913756fabdeef782b9", "publicationVenue": {"id": "6f421b8a-b3d7-4896-b511-c96194fcc59e", "name": "Internet Reference Services Quarterly", "type": "journal", "alternate_names": ["Internet Ref Serv Q"], "issn": "1087-5301", "url": "http://www.routledge.com/", "alternate_urls": ["http://www.tandfonline.com/loi/wirs20"]}, "title": "Exploring the Potential of Big Data Analytics in Improving Library Management in Indonesia: Challenges, Opportunities, and Best Practice", "abstract": "Abstract This column aims to explore the potential of big data analytics in improving library management in Indonesia and identify the challenges, opportunities, and best practices for libraries when applying big data analytics. Using of literature review of published studies, this column examines the current state of big data analytics in library management in Indonesia and provides recommendations, including a SWOT analysis, for implementing big data analytics in operations. It also highlighted several challenges such as limited resources, limited access to technology and digital literacy among librarians, and limited data security measures which could put sensitive patron data at risk.", "venue": "Internet Reference Services Quarterly", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2023-03-22", "journal": {"name": "Internet Reference Services Quarterly", "pages": "111 - 120", "volume": "27"}, "authors": [{"authorId": "2196475583", "name": "Nurul Islam"}, {"authorId": "2092032623", "name": "Khairul Islam"}, {"authorId": "2212835222", "name": "Monulirul Islam"}], "citations": [{"paperId": "9731bec92a7e2f76285bcead96b705ec72b5591e", "title": "Knowledge Conversion Abilities and Innovative Work Behavior of Indonesian Academic Librarians"}, {"paperId": "bb81eb58d09f62533f7dbe0d7cdcbcb0636c6a50", "title": "Developing a big data analytics platform using Apache Hadoop Ecosystem for delivering big data services in libraries"}, {"paperId": "26088629d6d6ce61e86f61d8b706ecfb0974073a", "title": "Big Data Analytics Artefact for Outcome-Based Funding Prediction in South African Public Universities"}]}
