{"paperId": "963a8d189a4b1041aa67b3cc0925d21bfa39da79", "publicationVenue": null, "title": "Developing the Raster Big Data Benchmark: A Comparison of Raster Analysis on Big Data Platforms", "abstract": "Technologies around the world produce and interact with geospatial data instantaneously, from mobile web applications to satellite imagery that is collected and processed across the globe daily. Big raster data allow researchers to integrate and uncover new knowledge about geospatial patterns and processes. However, we are at a critical moment, as we have an ever-growing number of big data platforms that are being co-opted to support spatial analysis. A gap in the literature is the lack of a robust assessment comparing the efficiency of raster data analysis on big data platforms. This research begins to address this issue by establishing a raster data benchmark that employs freely accessible datasets to provide a comprehensive performance evaluation and comparison of raster operations on big data platforms. The benchmark is critical for evaluating the performance of spatial operations on big data platforms. The benchmarking datasets and operations are applied to three big data platforms. We report computing times and performance bottlenecks so that GIScientists can make informed choices regarding the performance of each platform. Each platform is evaluated for five raster operations: pixel count, reclassification, raster add, focal averaging, and zonal statistics using three raster different datasets.", "venue": "ISPRS Int. J. Geo Inf.", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-11-19", "journal": {"name": "ISPRS Int. J. Geo Inf.", "pages": "690", "volume": "9"}, "authors": [{"authorId": "152228658", "name": "D. Haynes"}, {"authorId": "2116734528", "name": "Philip Mitchell"}, {"authorId": "2922516", "name": "Eric Shook"}], "citations": [{"paperId": "0da0e9d58416ff0b7228cb1fa34677a22d03071d", "title": "Spatiotemporal Analysis for Rainfall Prediction Using Extreme Learning Machine Cluster"}, {"paperId": "9ac958bf97952df71aba710353cb1a7ee8a5d7b1", "title": "High resolution photovoltaic power generation potential assessments of rooftop in China"}, {"paperId": "244279783ab15423992e446b9da855b363a367ef", "title": "A Survey on Spatio-temporal Data Analytics Systems"}, {"paperId": "defdcb80d36fbd59a51b977d07a648951d39d8b0", "title": "Spatiotemporal convolutional LSTM with attention mechanism for monthly rainfall prediction"}]}
