{"paperId": "9640686a3b1fc26722ff53be90ad566ac7690b80", "publicationVenue": {"id": "5e1f6444-5d03-48c7-b202-7f47d492aeae", "name": "IEEE Transactions on Visualization and Computer Graphics", "type": "journal", "alternate_names": ["IEEE Trans Vis Comput Graph"], "issn": "1077-2626", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=2945"}, "title": "A Structured Review of Data Management Technology for Interactive Visualization and Analysis", "abstract": "In the last two decades, interactive visualization and analysis have become a central tool in data-driven decision making. Concurrently to the contributions in data visualization, research in data management has produced technology that directly benefits interactive analysis. Here, we contribute a systematic review of 30 years of work in this adjacent field, and highlight techniques and principles we believe to be underappreciated in visualization work. We structure our review along two axes. First, we use task taxonomies from the visualization literature to structure the space of interactions in usual systems. Second, we created a categorization of data management work that strikes a balance between specificity and generality. Concretely, we contribute a characterization of 131 research papers along these two axes. We find that five notions in data management venues fit interactive visualization systems well: materialized views, approximate query processing, user modeling and query prediction, muiti-query optimization, lineage techniques, and indexing techniques. In addition, we find a preponderance of work in materialized views and approximate query processing, most targeting a limited subset of the interaction tasks in the taxonomy we used. This suggests natural avenues of future research both in visualization and data management. Our categorization both changes how we visualization researchers design and build our systems, and highlights where future work is necessary.", "venue": "IEEE Transactions on Visualization and Computer Graphics", "year": 2020, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2020-10-08", "journal": {"name": "IEEE Transactions on Visualization and Computer Graphics", "pages": "1128-1138", "volume": "27"}, "authors": [{"authorId": "2230578", "name": "L. Battle"}, {"authorId": "1786183", "name": "C. Scheidegger"}], "citations": [{"paperId": "32ba448e90bca6c22c8b90082869d89b7417767b", "title": "Optimizing Dataflow Systems for Scalable Interactive Visualization"}, {"paperId": "f3fa9c91a0ad9385c06b039a064b024a7839fd2a", "title": "How Does User Behavior Evolve During Exploratory Visual Analysis?"}, {"paperId": "5a2fe35ae481b9b524ef82754b04b904e778b6bd", "title": "Mosaic: An Architecture for Scalable & Interoperable Data Views"}, {"paperId": "2e5baf90063d9523ae026a8f2b64cc72cbb35e2a", "title": "Workload Evaluation to Create Data Visualization Using ChatGPT"}, {"paperId": "1f50ae271d4a77e7151de0556d7bac7f6d839589", "title": "Construction of Digital Multimedia Visualization Model Based on Artificial Intelligence Technology"}, {"paperId": "a07b3433005759433f77f738962d61d14efb29ea", "title": "DashQL - Complete Analysis Workflows with SQL"}, {"paperId": "76761db1dfcfeb286281b507cd989cf05c1d9419", "title": "GVQA: Learning to Answer Questions about Graphs with Visualizations via Knowledge Base"}, {"paperId": "cdcb4af157c70db2d6697aa65ae3b02595d7cf8b", "title": "Exploring the role of conscientiousness on visualization-supported decision-making"}, {"paperId": "853c2c781bbd0308860e78e957df230d28229523", "title": "The Application of Multimedia Visualization Platform in Business Management from the Perspective of Supply Chain Management"}, {"paperId": "6e5553c5c8397d283953d514d536a4a0b54e00c0", "title": "What Do We Mean When We Say \"Insight\"? A Formal Synthesis of Existing Theory."}, {"paperId": "308c00b498da2a2afe00de692b21a8a173386f51", "title": "Demonstration of VegaPlus: Optimizing Declarative Visualization Languages"}, {"paperId": "d4a313494333f759a1af1a59cc736bba2e9e2a34", "title": "A Grammar‐Based Approach for Applying Visualization Taxonomies to Interaction Logs"}, {"paperId": "1ca938e6ee602731c91a97c23884251478ab608a", "title": "A Critical Reflection on Visualization Research: Where Do Decision Making Tasks Hide?"}, {"paperId": "096618aba19bce1d917df488a04891ab239cffdd", "title": "Towards Natural Language Interfaces for Data Visualization: A Survey"}, {"paperId": "b645ede48c4929913e55313a4bd5084096cdd1de", "title": "Threshold Queries in Theory and in the Wild"}, {"paperId": "104e836db4d8a3ddfba30646339ca04fa86eb3ca", "title": "A Programmatic Approach to Applying Visualization Taxonomies to Interaction Logs"}, {"paperId": "f41fa8d7bc560552f390427563bcab80711e1424", "title": "Scalable Vega: Optimizing Declarative Visualization Languages"}, {"paperId": "8b66afe7168366a9797fd1be2d831158b1e2662c", "title": "A Grammar-Based Approach for Applying Vis Taxonomies to Interaction Logs"}, {"paperId": "860b603b33e7373f9d29fbe1079f0342bc8c0694", "title": "Toward an Interaction-Driven Framework for Modeling Big Data Visualization Systems"}, {"paperId": "6fe60b96d4455788ccb6433af8b95abae6860b7e", "title": "Intelligent Data Visualization Analysis Techniques: A Survey"}]}
