{"paperId": "964ee45721eb3401ed89e0183ed98db77725904e", "publicationVenue": {"id": "18cb41bf-d23d-4c47-a30d-3f1ef6abfb1b", "name": "IoT", "issn": "2624-831X", "url": "https://www.mdpi.com/journal/IoT"}, "title": "Double Deep Q-Learning Networks for Energy-Efficient IoT Task Offloading in D2D MEC Environments", "abstract": "The evolution of the Internet of Things (IoT) has instigated a dramatic surge in interconnected devices, leading to the generation of substantial data. This immense data exchange poses significant challenges to traditional cloud computing models due to latency, network congestion, and energy constraints. Device-to-device (D2D) communication offers a more efficient alternative for direct data transfer, while Mobile Edge Computing (MEC) emerges as a promising solution for handling IoT-generated data by enabling computation at the network's edge, significantly reducing latency. However, making the right task offloading decision – determining where to process IoT tasks, either at the device or the MEC server – becomes critical. To address this, our study introduces a novel approach to IoT task offloading using Double Deep Q-Learning Networks (DDQN). This strategy optimizes the offloading decision to strike a balance between system performance and resource utilization in D2D MEC environments. According to our simulation results, the DDQN strategy yields remarkable improvements, reducing energy consumption and cost by approximately 8.9% and 10.8% respectively, and improving latency by about 5.5% compared to other methods. This significant enhancement illustrates the DDQN's potential for efficient IoT ecosystem management, emphasizing its role in optimizing IoT task offloading in D2D MEC settings.", "venue": "IoT", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-10-25", "journal": {"name": "2023 7th International Conference on Internet of Things and Applications (IoT)", "pages": "1-6"}, "authors": [{"authorId": "2219617251", "name": "Komeil Moghaddasi"}, {"authorId": "2219617225", "name": "Shakiba Rajabi"}], "citations": [{"paperId": "bddfd25adc47024cd0127c44e073c1a4dc76210a", "title": "Blockchain-Enhanced Offloading in Mobile Edge Computing: A Systematic Review and Survey of Current Trends and Future Directions"}, {"paperId": "e41df6f1fb0782782ef999fa9a327af2098ccc23", "title": "Multi-Objective Secure Task Offloading Strategy for Blockchain-Enabled IoV-MEC Systems: A Double Deep Q-Network Approach"}]}
