{"paperId": "964f13aea964640563021f025b187fc4566ef512", "publicationVenue": {"id": "dc33e63b-969f-4ae3-92a3-a6f70c42cff2", "name": "Journal of Discrete Mathematical Sciences and Cryptography", "type": "journal", "alternate_names": ["J Discret Math Sci Cryptogr"], "issn": "0972-0529", "url": "http://ejournals.ebsco.com/direct.asp?JournalID=714493", "alternate_urls": ["http://www.tandfonline.com/loi/tdmc20", "http://www.tarupublications.com/journals/jdmsc/scope-of%20the-journal.htm"]}, "title": "Intelligent mobile crowdsensing for secure data integration : A blockchain based approach", "abstract": "Abstract Data integration is very important in real-time data-driven applications, crowdsensing is used all over the world. At a cheap cost, crowdsensing may collect sensing data from smart devices (such as smart phones, smart watches, etc.). There are certain fundamental concerns to consider, such as data security and protection, data privacy, and data cost-effectiveness or incentive. Because some existing platform-based systems fail to regulate the concerns, data leakage in crowdsensing applications. For crowdsensing data integration, some approaches include cost-effectiveness and data quality challenges. This study proposes a unique crowdsensing architecture that combines blockchain technology with a decentralized crowdsensing framework. This framework aids in the security of data, the resolution of data privacy issues, and the protection of data from unwanted attacks in crowdsensing. The study also includes a hybrid system that ensures data quality and cost-effectiveness variables by combining monetary and reputation-based approaches. This framework is appropriate since the crowdsensing user will encourage data detection while discouraging malicious behaviors. The proposed innovative framework’s efficacy was confirmed by the combined effect of the framework design theory. The simulation results suggest that the proposed framework is reliable, and it would be effective to use it for crowdsensing data integration.", "venue": "Journal of Discrete Mathematical Sciences and Cryptography", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-11-17", "journal": {"name": "Journal of Discrete Mathematical Sciences and Cryptography", "pages": "2155 - 2170", "volume": "24"}, "authors": [{"authorId": "5660610", "name": "Saurabh Anand"}, {"authorId": "144367195", "name": "A. Ram"}, {"authorId": "3297232", "name": "Manas Kumar Mishra"}], "citations": [{"paperId": "6f9355bb31525414ec9f59ff19d0105d29aebf43", "title": "Effect of using Internet of Things for personalized advertisements on consumer buying behaviour"}]}
