{"paperId": "9653f7cac90d43ba640e6a2972b471941052d7d4", "publicationVenue": null, "title": "Spatial-temporal assessment of soil erosion using the RUSLE model in the upstream Inaouène watershed, Northern Morocco.", "abstract": ": This study was conducted in the upstream Inaouène watershed, one of the largest tributaries of the Sebou River in Morocco. The aim of the study is to assess the risk of rain-induced erosion at two different periods (1984 and 2022) to better understand the trend of this phenomenon in the study area. The Revised Universal Soil Loss Equation (RUSLE) was employed to evaluate the soil loss rate, specifically concerning sheet erosion. To carry out this work, various factors of the equation (Rainfall erosivity \"R,\" Soil erodibility \"K,\" Vegetative cover \"C,\" Topography \"LS,\" and Anti-erosion practices \"P\") were incorporated into a Geographic Information System (GIS) and spatial remote sensing. By overlaying these factors, a quantitative map of soil losses in our watershed was obtained. The results of this study show that the upstream Inaouène experienced a significant erosion dynamic during both 1985 (T1) and 2022 (T2), with a notable decrease in the amount of soil loss over the last year. Soil degradation at T1 averaged about 68 (T/ha/year), with maximum and minimum losses between 2162 and 0.067 T/ha/year. In contrast, losses at T2 recorded an average of 52.4 (T/ha/year), with a maximum of 1850 (T/ha/year). The study area thus represents very high soil loss quantities in both periods compared to several studies conducted on this issue. This is attributed to the fact that the study area is located in a region characterized by very favorable natural and human conditions and factors for recording significant soil losses. These include concentrated and intense thunderstorms, the predominance of fragile rocks, steep slopes, low vegetative cover, and irrational human interference in the area.… .", "venue": "", "year": null, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "2278883730", "name": "Chakir Hamouch"}, {"authorId": "2121864562", "name": "Jamal Chaaouan"}, {"authorId": "2209929297", "name": "Charaf Bouiss"}], "citations": []}
