{"paperId": "9653e1af0491dbfec6ecab5133fb182156298dad", "publicationVenue": {"id": "a36dc29e-4ea1-4567-b0fe-1c06daf8bee8", "name": "International Conference on Software Engineering", "type": "conference", "alternate_names": ["Int Conf Softw Eng", "ICSE"], "url": "http://www.icse-conferences.org/"}, "title": "Test Selection for Unified Regression Testing", "abstract": "Today's software failures have two dominating root causes: code bugs and misconfigurations. To combat failure-inducing software changes, unified regression testing (URT) is needed to synergistically test the changed code and all changed production configurations for deployment reliability. However, URT could incur high cost, as it needs to run a large number of tests under multiple configurations. Regression test selection (RTS) can reduce regression testing cost. Unfortunately, no existing RTS technique reasons about code and configuration changes collectively. We introduce Unified Regression Test Selection (uRTS) to effectively reduce the cost of URT. uRTS supports project changes on 1) code only, 2) configurations only, and 3) both code and configurations. It selects regular tests and configuration tests with a unified selection algorithm. The uRTS algorithm analyzes code and configuration dependencies of each test across runs and across configurations. uRTS provides the same safety guarantee as the state-of-the-art RTS while selecting fewer tests and, more importantly, reducing the end-to-end testing time. We implemented uRTS on top of Ekstazi (a RTS tool for code changes) and Ctest (a configuration testing framework). We evaluate uRTS on hundreds of code revisions and dozens of configurations of five large projects. The results show that uRTS reduces the end-to-end testing time, on average, by 3.64X compared to executing all tests and 1.87X compared to a competitive reference solution that directly extends RTS for URT.", "venue": "International Conference on Software Engineering", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-05-01", "journal": {"name": "2023 IEEE/ACM 45th International Conference on Software Engineering (ICSE)", "pages": "1687-1699"}, "authors": [{"authorId": "2146514698", "name": "Shuai Wang"}, {"authorId": "24319210", "name": "Xinyu Lian"}, {"authorId": "1718171", "name": "D. Marinov"}, {"authorId": "2152009085", "name": "Tianyi Xu"}], "citations": [{"paperId": "5edd96e34703b9a2654976f47f7249e3a0a10d5c", "title": "Acto: Automatic End-to-End Testing for Operation Correctness of Cloud System Management"}, {"paperId": "e21899907bc9f861b5997f67965a6b136285aad6", "title": "Configuration Validation with Large Language Models"}, {"paperId": "a5ac6688eca64feeaffd61f6a6bca1bd07f3687c", "title": "Virtual Device Farms for Mobile App Testing at Scale: A Pursuit for Fidelity, Efficiency, and Accessibility"}]}
