{"paperId": "9665b717f28bdb23ede44c21e5971e8589e1d686", "publicationVenue": null, "title": "A statistics-based performance testing methodology for cloud applications", "abstract": "The low cost of resource ownership and flexibility have led users to increasingly port their applications to the clouds. To fully realize the cost benefits of cloud services, users usually need to reliably know the execution performance of their applications. However, due to the random performance fluctuations experienced by cloud applications, the black box nature of public clouds and the cloud usage costs, testing on clouds to acquire accurate performance results is extremely difficult. In this paper, we present a novel cloud performance testing methodology called PT4Cloud. By employing non-parametric statistical approaches of likelihood theory and the bootstrap method, PT4Cloud provides reliable stop conditions to obtain highly accurate performance distributions with confidence bands. These statistical approaches also allow users to specify intuitive accuracy goals and easily trade between accuracy and testing cost. We evaluated PT4Cloud with 33 benchmark configurations on Amazon Web Service and Chameleon clouds. When compared with performance data obtained from extensive performance tests, PT4Cloud provides testing results with 95.4% accuracy on average while reducing the number of test runs by 62%. We also propose two test execution reduction techniques for PT4Cloud, which can reduce the number of test runs by 90.1% while retaining an average accuracy of 91%. We compared our technique to three other techniques and found that our results are much more accurate.", "venue": "ESEC/SIGSOFT FSE", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2019-08-12", "journal": {"name": "Proceedings of the 2019 27th ACM Joint Meeting on European Software Engineering Conference and Symposium on the Foundations of Software Engineering"}, "authors": [{"authorId": "2112463596", "name": "Sen He"}, {"authorId": "151488802", "name": "Glenna Manns"}, {"authorId": "2059101060", "name": "John Saunders"}, {"authorId": "39253519", "name": "Wei Wang"}, {"authorId": "1699934", "name": "L. Pollock"}, {"authorId": "1749399", "name": "M. Soffa"}], "citations": [{"paperId": "e47c9293a3a546b8c7ef5c1e28711936fadf7658", "title": "The Early Microbenchmark Catches the Bug - Studying Performance Issues Using Micro- and Application Benchmarks"}, {"paperId": "2d406284296499409247c706756343efd18e926d", "title": "Vicious Cycles in Distributed Software Systems"}, {"paperId": "9446bc7f530398172c2fd96672e363e934c310a8", "title": "A multi‐faceted analysis of the performance variability of virtual machines"}, {"paperId": "f659f235a54468fc194d5beb7e7d9de8bdd6765f", "title": "Statistical Application Training for Students for Thesis Preparation"}, {"paperId": "5628f2291308a3da68caa8508b77958f75b97a3a", "title": "Exploring nonintrusive measurements of spatio‐temporal portrait of microservices"}, {"paperId": "28317f0b7c644d3497f316dcacb9cb9f97160acf", "title": "SuperFlow: Performance Testing for Serverless Computing"}, {"paperId": "521a1e6ae144c2cdf94a261f68727ce82d0aa0b8", "title": "Revisiting the Performance of Serverless Computing: An Analysis of Variance"}, {"paperId": "06ff2e93ff5000794066c83de6d3635bd24c7ab6", "title": "A Study of Java Microbenchmark Tail Latencies"}, {"paperId": "2d36dba4761044fa72ef91cae4d2cc084044e79c", "title": "When Database Meets New Storage Devices: Understanding and Exposing Performance Mismatches via Configurations"}, {"paperId": "76b4fce023fbc6cdb92cf97f5b962fe6fdfc0278", "title": "FOCloud: Feature Model Guided Performance Prediction and Explanation for Deployment Configurable Cloud Applications"}, {"paperId": "fde0535d71e2e9e9273e09d3b4e3bc0591e1607e", "title": "Using Microbenchmark Suites to Detect Application Performance Changes"}, {"paperId": "05bdebea16f0c93cc59db07bb3007b3c3b44de23", "title": "Automated Identification of Performance Changes at Code Level"}, {"paperId": "5ee89136a095a0dca4b20443af20db797fb8c8ca", "title": "Nonintrusive Measurement on Temporal and Spatial Features of Microservice Inferences"}, {"paperId": "4a3c215805db716f731dc574e3407fcd3270dcc6", "title": "Evaluating Search-Based Software Microbenchmark Prioritization"}, {"paperId": "23a6e0bd5ef9e9deeb0b939b1521b97dc54a0707", "title": "Ruya: Memory-Aware Iterative Optimization of Cluster Configurations for Big Data Processing"}, {"paperId": "50cbbe028a73e7cd2e57c09449875be8798ed87d", "title": "DBMS-Benchmarker: Benchmark and Evaluate DBMS in Python"}, {"paperId": "13374de64aa511567867d9f8e2fb8f1010ee019a", "title": "Towards effective assessment of steady state performance in Java software: are we there yet?"}, {"paperId": "6017c63c56c9f20cede1236f79d768bcc21b5e8d", "title": "A configurable method for benchmarking scalability of cloud-native applications"}, {"paperId": "7d434537cce3fd903e1ba09e694895fbe3628cbc", "title": "Get Your Memory Right: The Crispy Resource Allocation Assistant for Large-Scale Data Processing"}, {"paperId": "759785be6da465bf63527bfefdd2eb469fe2a912", "title": "Machine learning aplicado al análisis del rendimiento de desarrollos de software"}, {"paperId": "2f65e60dfd8a05f6dfeec8a237507b029386b1eb", "title": "Performance Testing for Cloud Computing with Dependent Data Bootstrapping"}, {"paperId": "25a6a38bb83c26fe0f26ec106af53e32735dc296", "title": "Applying test case prioritization to software microbenchmarks"}, {"paperId": "92f776ef44695f47014918bfd89e0efb7ea50ca4", "title": "Performance Health Index for Complex Cyber Infrastructures"}, {"paperId": "f4d5113aeb8809dedfefda001242b8a7cf9c469d", "title": "Effective low capacity status prediction for cloud systems"}, {"paperId": "26acbf461e61cf95255ed858e98b11bf928f26b0", "title": "Predicting unstable software benchmarks using static source code features"}, {"paperId": "00d89b54dd9f8197cf0ce40ca720cadc53e60ec8", "title": "An Empirical Analysis of VM Startup Times in Public IaaS Clouds"}, {"paperId": "060680fbeffbef60b4a730a578622579f7597bb2", "title": "Using application benchmark call graphs to quantify and improve the practical relevance of microbenchmark suites"}, {"paperId": "99212fef59fad7b709e4cf8906be557b8b811dd6", "title": "Dynamically reconfiguring software microbenchmarks: reducing execution time without sacrificing result quality"}, {"paperId": "a005c15e7628da11e8e20035ac26f300309d109f", "title": "Modelling VM Latent Characteristics and Predicting Application Performance using Semi-supervised Non-negative Matrix Factorization"}, {"paperId": "0efdd284df4ae7c75b5055999a207f68b360f228", "title": "Towards reducing the time needed for load testing"}, {"paperId": "17583f3e18a2a33a954a9aa55e932acb3f13cc2c", "title": "Guaranteeing Performance SLAs of Cloud Applications Under Resource Storms"}, {"paperId": "bb739718f25378b7626857a7fc0f265df5fb5c38", "title": "Microservices: A Performance Tester's Dream or Nightmare?"}, {"paperId": "9bbf3ec10f2a693010a1639769082c51794a629a", "title": "The Limit of Horizontal Scaling in Public Clouds"}, {"paperId": "0512a6a26efea1e91992b408e4ed3e0140cf3bc2", "title": "Duet Benchmarking: Improving Measurement Accuracy in the Cloud"}, {"paperId": "069057288ddc41197c981771fa9c82e252ae41e3", "title": "Computing and Information Sciences AUTOMATION OF PERFORMANCE TESTING: A REVIEW"}, {"paperId": "a14d3b8a1e94a3f4e4dafd889595decd5e07636f", "title": "Threat Modeling of Cloud based Implementation of Homomorphic Encryption"}, {"paperId": "1c677b884a1d89377f47e2f86b8165669cb67bdd", "title": "Inferring Performance from Code: A Review"}]}
