{"paperId": "9666ed2240ce3c73cd3c9dc40df9fc3dafcc2154", "publicationVenue": {"id": "969f39c1-0d68-4ada-a88b-a685d4164873", "name": "International Journal of Geographical Information Science", "type": "journal", "alternate_names": ["Int J Geogr Inf Sci"], "issn": "1365-8816", "alternate_issns": ["1365-8824"], "url": "http://www.tandfonline.com/action/aboutThisJournal?journalCode=tgis20"}, "title": "Network-constrained bivariate clustering method for detecting urban black holes and volcanoes", "abstract": "ABSTRACT Urban black holes and volcanoes are typical traffic anomalies that are useful for optimizing urban planning and maintaining public safety. It is still challenging to detect arbitrarily shaped urban black holes and volcanoes considering the network constraints with less prior knowledge. This study models urban black holes and volcanoes as bivariate spatial clusters and develops a network-constrained bivariate clustering method for detecting statistically significant urban black holes and volcanoes with irregular shapes. First, an edge-expansion strategy is proposed to construct the network-constrained neighborhoods without the time-consuming calculation of the network distance between each pair of objects. Then, a network-constrained spatial scan statistic is constructed to detect urban black holes and volcanoes, and a multidirectional optimization method is developed to identify arbitrarily shaped urban black holes and volcanoes. Finally, the statistical significance of multiscale urban black holes and volcanoes is evaluated using Monte Carlo simulation. The proposed method is compared with three state-of-the-art methods using both simulated data and Beijing taxicab spatial trajectory data. The comparison shows that the proposed method can detect urban black holes and volcanoes more accurately and completely and is useful for detecting spatiotemporal variations of traffic anomalies.", "venue": "International Journal of Geographical Information Science", "year": 2020, "fieldsOfStudy": ["Computer Science", "Geology"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-02-27", "journal": {"name": "International Journal of Geographical Information Science", "pages": "1903 - 1929", "volume": "34"}, "authors": [{"authorId": "3228724", "name": "Qiliang Liu"}, {"authorId": "2146254288", "name": "Zhihui Wu"}, {"authorId": "46397265", "name": "M. Deng"}, {"authorId": "2109542939", "name": "Wenkai Liu"}, {"authorId": "9485328", "name": "Yaolin Liu"}], "citations": [{"paperId": "e5c79101f0c9dab1b4a7058c15a8d43da9a4d16b", "title": "Incorporation of Spatially Heterogeneous Area Partitioning into Vector-Based Cellular Automata for Simulating Urban Land-Use Changes"}, {"paperId": "280fd9d5f4a66e743fa71ba66c94fece937b0e56", "title": "Sensing Travel Source-Sink Spatiotemporal Ranges Using Dockless Bicycle Trajectory via Density-Based Adaptive Clustering"}, {"paperId": "081e298cd2282c3910b9cc57cefcd677396fd5c2", "title": "Spatial hotspot detection in the presence of global spatial autocorrelation"}, {"paperId": "9e594f6ba0798eb17daa0f34d10afc0e8f789506", "title": "Spatiotemporal Flow L-function: a new method for identifying spatiotemporal clusters in geographical flow data"}, {"paperId": "768b2398fa32ecb3becf40bb3eec1cfbb8ac41eb", "title": "BiFlowAMOEBA for the identification of arbitrarily shaped clusters in bivariate flow data"}, {"paperId": "4e928cb6ed50ace4cf11264f85c6826444720e7c", "title": "Ripley’s K‐function for Network‐Constrained Flow Data"}, {"paperId": "ac3a7e5ef24be861f28e4570fd348f5a4e90249c", "title": "Detecting anomalous spatial interaction patterns by maximizing urban population carrying capacity"}, {"paperId": "a2cab8ed93d9cb975d804a7edd1c09aea11f3a39", "title": "SNN_flow: a shared nearest-neighbor-based clustering method for inhomogeneous origin-destination flows"}, {"paperId": "3a6fdbdbce3473f7f6f85f5c256617385f66900c", "title": "A Spatial Scan Statistic to Detect Spatial Communities of Vehicle Movements on Urban Road Networks"}, {"paperId": "48e1486a35db20aa13e0c549130e76cc912eca6c", "title": "A dual spatial clustering method in the presence of heterogeneity and noise"}]}
