{"paperId": "966aa9bda37d995f702f644b9b149498e4eafd5b", "publicationVenue": null, "title": "Koral: A Glass Box Profiling System for Individual Components of Distributed RDF Stores", "abstract": ". In the last years, scalable RDF stores in the cloud have been developed increasing the complexity of RDF stores running on a single computer. In order to gain a deeper understanding how, e.g., the data placement or the distributed query execution strategies affect the performance, we have developed the modular glass box proﬁling system Koral. With its help, it is possible to test the behaviour of already existing or newly created strategies tackling the challenges caused by the distribution in a realistic distributed RDF store. Thereby, the design goal of Koral is that only the evaluated component needs to be exchanged and the adaptation of other components is aimed to be minimal. The wide variety of measurements allow for an in-depth investigation of the performance. With Koral we analyse the impact of the three most commonly used data placement strategies and found out that balancing query workload reduces the query execution time more than reducing the data transfer.", "venue": "BLINK/NLIWoD3@ISWC", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2017-09-21", "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "31451368", "name": "Daniel Janke"}, {"authorId": "1752093", "name": "Steffen Staab"}, {"authorId": "1802957", "name": "Matthias Thimm"}], "citations": [{"paperId": "07679278169720ce0385a169801a58cc704a3163", "title": "smart-KG: Partition-Based Linked Data Fragments for querying knowledge graphs"}, {"paperId": "c76a7dd95022ff807c97254907bf3b4b8e951cce", "title": "Efficient RDF Knowledge Graph Partitioning Using Querying Workload"}, {"paperId": "037891f3cec1f81bfb2fec10e9b294bb25845384", "title": "A survey of RDF stores & SPARQL engines for querying knowledge graphs"}, {"paperId": "c9bcda1c2063e1573d579fd2c0a6ac761d925de8", "title": "Storage, Indexing, Query Processing, and Benchmarking in Centralized and Distributed RDF Engines: A Survey"}, {"paperId": "6812eea4c1bce5d5021506fe441e751dfa4bbc65", "title": "An Empirical Evaluation of RDF Graph Partitioning Techniques"}, {"paperId": "625cdff95b10c2a8f2891158699de74fb9c8ac95", "title": "Distributed Query Optimization Master’s Thesis"}, {"paperId": "d346bfc14f75ee112758502bbc7af5cbf9eab7cd", "title": "RDF Graph Partitioning: Techniques and Empirical Evaluation"}, {"paperId": "074cb96fa79835261dafb7cf54d4f7f5d1ff5348", "title": "A logic dimension on RDF partitioning, technical report"}]}
