{"paperId": "9673328b91289df6b4032057b573288b24fe2548", "publicationVenue": null, "title": "Design & Implementation of Solar Powered Automatic Weather Station based on ESP32 and GPRS Module", "abstract": "The fundamental aim of this project is to develop a solar-powered automatic weather station (AWS), which can be accessed via the website. Users can find out the weather changes in an area without needing to come to the area and can do an analysis of irrigation water needs. This design uses ESP32 as main processor. The measure weather parameters include temperature and humidity using HDC1080 sensor, wind speed using an anemometer sensor, wind direction using a wind vane sensor, air pressure using BME280, rainfall using a tipping bucket sensor, and the last small solar panel for irradiance sensor. AWS has two working modes, normal and maintenance mode. During maintenance mode, sensor data will be displayed on a local website that can be accessed via a wifi network broadcasted by ESP32. In normal mode, the ESP32 will send sensor data to the cloud using SIM800L GPRS Module. The system proposed is also designed to have a feature to log sensor data locally in SD card. Watchdog timer circuit uses timer 555 implemented in this project for the recovery system from the failure process. Power sources are limited, so the system must be put into deep-sleep mode state when not processing data. Data transmission is carried out periodically with an interval of 5-6 minutes. Test results show that the sending of sensor data can be received by the cloud with an acceptance rate of up to 98%.", "venue": "", "year": 2021, "fieldsOfStudy": ["Physics", "Environmental Science"], "publicationTypes": null, "publicationDate": null, "journal": {"name": "Journal of Physics: Conference Series", "volume": "1737"}, "authors": [{"authorId": "102142346", "name": "A. S. Priambodo"}, {"authorId": "1453693259", "name": "A. P. Nugroho"}], "citations": [{"paperId": "a654c5c9eb83fc7a803d737c0f25a1aa53ac4ab9", "title": "Implementation of the Electricity Load Monitoring Trainer and Internet of Things-based Power Factor Improvement"}, {"paperId": "2f222c06e3940c64fca644e4934422f9c674e8ee", "title": "Prediction Method of Government Economic Situation based on Big Data Analysis"}, {"paperId": "c68aa1bb2ebab5b8c3161df831c733c6330deb02", "title": "Exploring Cloud Assisted Tiny Machine Learning Application Patterns for PHM Scenarios"}]}
