{"paperId": "9673dfe730e19c1284be9c11c8d9a4fc81457a05", "publicationVenue": {"id": "cf108eec-9069-4527-acc4-234c620bd276", "name": "Mugla Journal of Science and Technology", "type": "journal", "alternate_names": ["Mugla J Sci Technol", "Muğla J Sci Technol", "Muğla Journal of Science and Technology"], "issn": "2149-3596", "url": "http://dergipark.ulakbim.gov.tr/muglajsci/"}, "title": "BÜYÜK VERİLER İÇİN HADOOP İŞ ÇİZELGELEME ALGORİTMALARINA GENEL BAKIŞ", "abstract": "Rapid advancements in Big data systems have occurred over the last several decades. The significant element for attaining high performance is \"Job Scheduling\" in Big data systems which requires more utmost attention to resolve some challenges of scheduling. To obtain higher performance when processing the big data, proper scheduling is required. Apache Hadoop is most commonly used to manage immense data volumes in an efficient way and also proficient in handling the issues associated with job scheduling. To improve performance of big data systems, we significantly analyzed various Hadoop job scheduling algorithms. To get an overall idea about the scheduling algorithm, this paper presents a rigorous background. This paper made an overview on the fundamental architecture of Hadoop Big data framework, job scheduling and its issues, then reviewed and compared the most important and fundamental Hadoop job scheduling algorithms. In addition, this paper includes a review of other improved algorithms. The primary objective is to present an overview of various scheduling algorithms to improve performance when analyzing big data. This study will also provide appropriate direction in terms of job scheduling algorithm to the researcher according to which characteristics are most significant", "venue": "Mugla Journal of Science and Technology", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-10-11", "journal": {"name": "Mugla Journal of Science and Technology"}, "authors": [{"authorId": "2188188496", "name": "Akhtari Zameel"}, {"authorId": "46965169", "name": "Ahmet Zengi̇n"}], "citations": []}
