{"paperId": "968812d5eb21400a5cc981eaef3f92addbd1bac6", "publicationVenue": {"id": "ecd69639-52a0-4d29-af57-21bca9e0a66b", "name": "IEEE International Conference on Industrial Engineering and Engineering Management", "type": "conference", "alternate_names": ["IEEM", "Ind Eng Eng Manag", "IEEE Int Conf Ind Eng Eng Manag", "Industrial Engineering and Engineering Management"], "issn": "2157-3611", "alternate_issns": ["2157-362X"], "url": "http://ieeexplore.ieee.org/xpl/conhome.jsp?punumber=1001598"}, "title": "Efficient Compression and Preprocessing for Facilitating Large Scale Spatiotemporal Data Mining - A Case Study based on Automatic Identification System Data", "abstract": "The large scale deployment of sensor, Global Positioning System (GPS) and other mobile devices generates large volumes of spatiotemporal data, which facilitates the understandings of objects' movement trajectories and activities. However, it is very challenging to store, transfer and load such a large volume of data into system memory for processing and analysis. In this study, we look into a study case that processes the large scale of Automatic Identification System (AIS) data in the maritime sector, and propose a computational framework to efficiently compress, transfer and acquire necessary information for further data analysis. The framework is composed of two parts: The first is a lossless compression algorithm that compresses the AIS data into binary form for efficient storage, speedy loading and easy transfer across networks and systems within the organization; the second is an aggregation algorithm which derives movement and activity information of vessels grouped by grid and/or time window from the compressed binary files, therefore improves data accessibility and reduces storage demand. The proposed framework has been applied to extract vessel movement information within Singapore port with high compression rate and fast access speed, and it can be extensively applied for other data processing applications.", "venue": "IEEE International Conference on Industrial Engineering and Engineering Management", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-12-01", "journal": {"name": "2019 IEEE International Conference on Industrial Engineering and Engineering Management (IEEM)", "pages": "354-358"}, "authors": [{"authorId": "47995703", "name": "Haiyan Xu"}, {"authorId": "144650134", "name": "Vasundhara Jayaraman"}, {"authorId": "9429983", "name": "Xiuju FU"}, {"authorId": "2170005", "name": "N. Othman"}, {"authorId": "27864813", "name": "Wanbing Zhang"}, {"authorId": "2107220241", "name": "Xiaofeng Yin"}, {"authorId": "7425827", "name": "Deqing Zhai"}, {"authorId": "1729436", "name": "R. Goh"}], "citations": [{"paperId": "77f49934a4735a312e493bde320c4b8509e76d4d", "title": "Maritime Disruption Impact Evaluation Using Simulation and Big Data Analytics"}, {"paperId": "2510163f4e20e8f7439ae1f66026521ec34880bd", "title": "MARITIME INFORMATICS TECHNOLOGY"}, {"paperId": "72941dbe6f763ad26f878d4f6b620f24d6a98c7a", "title": "AIS Data Analytics for Intelligent Maritime Surveillance Systems"}]}
