{"paperId": "968eb882cd1a666e572c6466a3e252721b2a9d93", "publicationVenue": null, "title": "Computational intelligence tools and databases in bioinformatics", "abstract": "Bioinformatics is overgrowing and has found many new applications which its progress caused the interaction with other fields. Thus presently, the Computational Intelligence based on Internet of Things in bioinformatics is used to archive, search, display, analysis and interpret biological data. Development of bioinformatics and growing need for actuarial science, computer, and programming result in the growth of new Computational Intelligence methods, tools, computer algorithms, and programming solutions. This study confers an extensive survey of the Computational Intelligence (CI) methods based on Big Data and IoT in bioinformatics and reviews some tools and databases of Computational Intelligence for bioinformatics issues such as DNA Sequence Analysis Tools, Analyze & Model 3D Structure, Phylogenetic Analysis, Protein Function Assignment, and Protein Sequence & Structure.", "venue": "2017 4th IEEE International Conference on Engineering Technologies and Applied Sciences (ICETAS)", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference", "Review"], "publicationDate": "2017-11-01", "journal": {"name": "2017 4th IEEE International Conference on Engineering Technologies and Applied Sciences (ICETAS)", "pages": "1-6"}, "authors": [{"authorId": "8455913", "name": "Z. Alansari"}, {"authorId": "1940692", "name": "N. B. Anuar"}, {"authorId": "1692419", "name": "A. Kamsin"}, {"authorId": "1716759", "name": "S. Soomro"}, {"authorId": "8229829", "name": "M. R. Belgaum"}], "citations": [{"paperId": "1f0f3e0a614c4b7d5b0dbafa1534182ba9d4e838", "title": "Role of Big Data Analytics in the Internet of Things: A Comprehensive Survey"}, {"paperId": "06856439daeae2371039affa93e09f5320df5607", "title": "Computational tools for modern vaccine development"}, {"paperId": "f10f663c46c0076874e7c0be544cc53ccfb1da1a", "title": "Challenges of Internet of Things and Big Data Integration"}]}
