{"paperId": "968e6c2d67447a6ac9665f2a2909fbe0d22e99ab", "publicationVenue": {"id": "d13e941e-4cac-4f1d-bdca-77d927e31f1b", "name": "ACM Symposium on Cloud Computing", "type": "conference", "alternate_names": ["System-on-Chip Conference", "ACM Symp Cloud Comput", "Syst Conf", "Symp Cloud Comput", "Annual IEEE International System-on-Chip Conference", "Symposium on Cloud Computing", "Annu IEEE Int Syst Conf", "SoCC"], "url": "http://www.ieee-socc.org/"}, "title": "Acorn: Aggressive Result Caching in Distributed Data Processing Frameworks", "abstract": "Result caching is crucial to the performance of data processing systems, but two trends complicate its use. First, immutable datasets make it difficult to efficiently employ powerful result caching techniques like predicate analysis, since predicate analysis typically requires optimized query plans but generating those plans can be costly with data immutability. Second, increased support for user-defined functions (UDFs), which are treated as black boxes by query engines, hinders aggressive result caching. This paper overcomes these problems by introducing 1) a judicious adaptation of predicate analysis on analyzed query plans that avoids unnecessary query optimization, and 2) a UDF translator that transparently compiles UDFs from general purpose languages into native equivalents. We then present Acorn, a concrete implementation of these techniques in Spark SQL that provides speedups of up to 5x across multiple benchmark and real Spark graph processing workloads.", "venue": "ACM Symposium on Cloud Computing", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2019-11-20", "journal": {"name": "Proceedings of the ACM Symposium on Cloud Computing"}, "authors": [{"authorId": "1404355981", "name": "Lana Ramjit"}, {"authorId": "2192580", "name": "Matteo Interlandi"}, {"authorId": "48144872", "name": "Eugene Wu"}, {"authorId": "2846332", "name": "R. Netravali"}], "citations": [{"paperId": "28cb991b7e0714b78908704204987b4230da3e2c", "title": "Veer: Verifying Equivalence of Workflow Versions in Iterative Data Analytics"}, {"paperId": "6227875f920dce6fa868df56e2757eccef634328", "title": "Veer: Verifying Equivalence of Dataflow Versions in Iterative Data Analytics (Extended Version)"}, {"paperId": "1940b31e5df81eccfc8f40de8843cae4db8c2609", "title": "Raven: Accelerating Execution of Iterative Data Analytics by Reusing Results of Previous Equivalent Versions"}, {"paperId": "2ceaa9671c736a669b6286a63419a3d37420257f", "title": "How I stopped worrying about training data bugs and started complaining"}, {"paperId": "ae492e7cb34e0c2630575516d87fde3276242d32", "title": "EVA: A Symbolic Approach to Accelerating Exploratory Video Analytics with Materialized Views"}, {"paperId": null, "title": "Cachew: Machine Learning Input Data Processing as a Service"}, {"paperId": "41d293f730da7e81448d3e75aec54d6ae0138c13", "title": "Cachew: Machine Learning Input Data Processing as a Service"}, {"paperId": "3797db0472220535fb16d0b6f213cce6d5f3da42", "title": "From Cleaning before ML to Cleaning for ML"}, {"paperId": "5815f70e6d8ecc42c7d4bca071e940673b4d8ebb", "title": "This paper is included in the Proceedings of the 2022 USENIX Annual Technical Conference."}]}
