{"paperId": "96a0b9b1ae939af6dbcc0fdc166f1df75497dc89", "publicationVenue": {"id": "3416dd37-f45d-40ed-b04e-875fcff8fa2f", "name": "Nutrients", "type": "journal", "issn": "2072-6643", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169249", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169249", "http://www.mdpi.com/journal/nutrients/", "https://www.mdpi.com/journal/nutrients"]}, "title": "Dietary Patterns Associated with Abnormal Glucose Tolerance following Gestational Diabetes Mellitus: The MyNutritype Study", "abstract": "Abnormal glucose tolerance (AGT), which includes type 2 diabetes and pre-diabetes, is highly prevalent in women post gestational diabetes mellitus (post-GDM). Dietary patterns have been associated with the risk of developing AGT in women post-GDM, but evidence in Asian populations is sparse. This study aimed to determine the association between a posteriori dietary patterns and AGT in women post-GDM. This cross-sectional study recruited 157 women post-GDM (mean age 34.8 years) from Seri Kembangan Health Clinic and Universiti Putra Malaysia. AGT was diagnosed according to the Malaysian Clinical Practice Guidelines using a 75 g 2 h oral glucose tolerance test or HbA1c. Food intake was assessed using the 2014 Malaysian Adult Nutrition Survey food frequency questionnaire. Five dietary patterns were derived using principal component analysis: ‘Unhealthy’, ‘Fish-eggs-fruits-vegetables’, ‘Cereals-confectionaries’, ‘Legumes-dairy’, and ‘Meat-sugar-sweetened-beverages’. After adjusting for sociodemographic characteristics and total energy intake, the ‘Cereals-confectionaries’ dietary pattern was significantly associated with AGT (adjusted odds ratio 1.536, p = 0.049). Targeted lifestyle modification, including dietary intervention, for women post-GDM is warranted to reduce their risk of AGT and its complications.", "venue": "Nutrients", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-06-01", "journal": {"name": "Nutrients", "volume": "15"}, "authors": [{"authorId": "1403579336", "name": "F. Y. Hasbullah"}, {"authorId": "5995733", "name": "Barakatun Nisak Mohd Yusof"}, {"authorId": "145615902", "name": "S. Shyam"}, {"authorId": "8426760", "name": "R. Abdul Ghani"}, {"authorId": "2144611926", "name": "Hannah Izzati Mohamed Khir"}], "citations": []}
