{"paperId": "96b06de775fbfb947347ce2b82be3010a27266c5", "publicationVenue": {"id": "764e3630-ddac-4c21-af4b-9d32ffef082e", "name": "IEEE International Conference on Data Engineering", "type": "conference", "alternate_names": ["ICDE", "Int Conf Data Eng", "IEEE Int Conf Data Eng", "International Conference on Data Engineering"], "url": "http://www.wikicfp.com/cfp/program?id=1331"}, "title": "LHist: Towards Learning Multi-dimensional Histogram for Massive Spatial Data", "abstract": "Data synopsis is widely adopted to speed-up query processing over large spatial databases. As one of the most popular spatial data synopses, multi-dimensional histograms (MH) have been studied and adopted by modern DBMS and analytical systems for decades. However, existing MH construction techniques highly rely on expert knowledge and statistical assumptions, making them hard to achieve consistently satisfactory performance across different datasets. Inspired by the emerging learned index techniques where the widely used index structures like B-tree can be further improved by integrating simple machine learning models, in this paper, we propose a learned data synopsis technique named Learned Multi-dimensional Histogram (LHist). Compared with the traditional data synopsis techniques, LHist is fully data-driven, easy-to-implement, and has the potential to achieve better storage-accuracy trade-off. On the typical task of range COUNT query estimation, the extensive experimental studies on large-scale real-world datasets and synthetic benchmarks reveal that LHist can outperform the existing synopsis structures in terms of storage cost, query processing efficiency, and estimation accuracy.", "venue": "IEEE International Conference on Data Engineering", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-04-01", "journal": {"name": "2021 IEEE 37th International Conference on Data Engineering (ICDE)", "pages": "1188-1199"}, "authors": [{"authorId": "2112215527", "name": "Qiyu Liu"}, {"authorId": "2923152", "name": "Yanyan Shen"}, {"authorId": "38050793", "name": "Lei Chen"}], "citations": [{"paperId": "bc94474c789dfd29a6b4788072b3a648c8bf773d", "title": "Kernel Density Visualization for Big Geospatial Data: Algorithms and Applications"}, {"paperId": "27390493145c7b3e2131a9d7ad8a60de292db7cb", "title": "Accurate and Efficient Trajectory-based Contact Tracing with Secure Computation and Geo-Indistinguishability"}, {"paperId": "b78e18ec906482eaf3e14c413d79da3f4a7c3c11", "title": "Efficient and Accurate Range Counting on Privacy-preserving Spatial Data Federation [Technical Report]"}, {"paperId": "6d1814d08f240d0efde960e12d027b6bede3405d", "title": "FactorJoin: A New Cardinality Estimation Framework for Join Queries"}, {"paperId": "c0164cb0a5f210ac820cf79491053b1f727c81c0", "title": "Learned k-NN distance estimation"}, {"paperId": "060a1452047de3cf0d680945719b1526a7eadb58", "title": "Machine Learning Meets Big Spatial Data (Revised)"}, {"paperId": "e1b5b8c10e2a2491184e54ad6e2d29c03d20ccd6", "title": "A Performance Study of One-dimensional Learned Cardinality Estimation"}]}
