{"paperId": "96c20f5a20685bfa7b4c22c231f0faa2d8f0d010", "publicationVenue": {"id": "d52887a9-5c2d-4c59-9a9d-0aa97608fcbf", "name": "Gazi Üniversitesi Mühendislik-Mimarlık Fakültesi Dergisi", "type": "journal", "alternate_names": ["J Fac Eng Archit Gazi Univ", "Journal of The Faculty of Engineering and Architecture of Gazi University", "Gazi Üniversitesi Mühendislik-mimarlık Fakültesi Derg"], "issn": "1300-1884"}, "title": "A new lattice based artificial bee colony algorithm for EEG noise minimization", "abstract": "Geçtiğimiz yıllar büyük veri olarak adlandırılan yeni bir kavramla başlayan değişimlere tanıklık etmiştir. Bu yeni kavram ve özellikleri gerçek hayat optimizasyon problemlerinin tanımlarını değiştirmiş ve daha önce önerilen çözüm tekniklerinin performanslarının incelenmesi ve büyük veri kavramının özelliklerini dikkate alarak yeni yöntemlerin geliştirilmesi kritik hale gelmiştir. Arıların yiyecek arama davranışlarındaki zekilikten ilham alan Yapay Arı Koloni (Artificial Bee Colony, ABC) algoritması sürü zekası temelli tekniklerinin en başarıları arasındadır. Bu çalışmada, ABC algoritmasının görevli ve gözcü arı fazları elektroensefalografi (EEG) sinyallerinde gürültü minimizasyonunu gerektiren büyük veri optimizasyon probleminin çözümü için düzenlenmiş ve kafes tabanlı (lattice based) ABC algoritması (LBABC) tanıtılmıştır. Önerilen yöntemin çözüm kapasitesinin analizi için farklı problem örneklerini içeren bir dizi uygulama gerçekleştirilmiştir. Elde edilen sonuçlar önce ABC algoritmasının yaygın kullanılan beş varyantı tarafından bulunmuş sonuçlar ile karşılaştırılmıştır. Sonuçlar ayrıca Diferansiyel Gelişim (Differential Evolution, DE) algoritması, Genetik algoritma (Genetic algorithm, GA), Ateş böceği algoritması (Firefly algorithm, FA), Havai fişek algoritması (Fireworks algorithm, FW), Parçacık Sürü Optimizasyon algoritması (Particle Swarm Optimization, PSO) ve Faz Optimizasyon algoritması (Phase based Optimization, PBO) temelli yöntemler tarafından elde edilen sonuçlar ile de kıyaslanmıştır. Karşılaştırma sonuçlarından ABC referans alarak geliştirilen yeni yönteminin test problemlerinin tamamına yakınında bahsedilen tekniklerden daha iyi ya da oldukça yakın çözümlere ulaşabildiği anlaşılmıştır.", "venue": "Gazi Üniversitesi Mühendislik-Mimarlık Fakültesi Dergisi", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-01-12", "journal": {"name": "Gazi Üniversitesi Mühendislik-Mimarlık Fakültesi Dergisi"}, "authors": [{"authorId": "9709385", "name": "Sibel Arslan"}, {"authorId": "34786158", "name": "Selçuk Aslan"}], "citations": [{"paperId": "25e01c6a2a60036305b7298f041f0558a18a2c77", "title": "Genghis Khan shark optimizer: A novel nature-inspired algorithm for engineering optimization"}, {"paperId": "2bf15d60848eeaab8dbc327be3746ad33d3f060e", "title": "Chaotic golden ratio guided local search for big data optimization"}, {"paperId": "790d433930b2ecc58dcd9de2d01eb97942bd6588", "title": "An adaptive balance optimization algorithm and its engineering application"}, {"paperId": "675c557c776e188890ac8a2f74589171c11c970c", "title": "Analysis and price prediction of secondhand vehicles in Türkiye with big data and machine learning techniques"}]}
