{"paperId": "96c77f9d01d61fa14c6f08cecc0ea7af46f9f3c6", "publicationVenue": {"id": "657a4bec-9a11-40fb-acfe-243d7fb993ae", "name": "Frontiers in Earth Science", "type": "journal", "alternate_names": ["Frontiers of Earth Science", "Frontiers in Earth Sciences", "Front Earth Sci"], "issn": "2296-6463", "alternate_issns": ["1863-4621", "2095-0195"], "url": "http://www.frontiersin.org/Earth_Science", "alternate_urls": ["http://journal.hep.com.cn/fesci/EN/2095-0195/current.shtml", "http://www.frontiersin.org/Journal/Archive.aspx?artId=0&f=19&name=Earth_Science", "https://www.frontiersin.org/journals/earth-science", "https://www.springer.com/series/7066"]}, "title": "The deformation evolution law and stability evaluation of the high-filled slope in the cutting hills to backfill ditches project", "abstract": "The cutting hills to back ditches (CHBD) project has been widely implemented since urbanization in hilly areas is steadily rising. The stability of the high-filled slope and the problem of foundation settlement deformation has become one of the vital issues for safe construction. This paper focused on the deformation evolution law and stability assessment of the high-filled deposit slope composed of the soil-rock mixture (S-RM) in the CHBD project, in Shiyan City, Hubei Province as examples. First, large-scale direct shear tests of S-RM with different rock block proportions (RBPs) under different various normal stresses were carried out, and its mechanical properties were analyzed. Next, the finite element method was used to simulate the processes of the step-by-step filling, and the deformation evolution law was analyzed. Then, the limited equilibrium method (LEM) was used to obtain the potential sliding surfaces and the corresponding safety factors of the high-filled slope, and the safety of the construction was assessed. Finally, automated monitoring of the step-by-step settlement and deep soil deformation was computerized for the typical locations, and the long-term stability of the high-filled slope was studied. The results demonstrate that the first layer of backfill in the F area contains the largest incremental settlement displacement in the y-direction, whereas the value in the G area occurs at the site of the fill layer close to the slope surface at each filling timestep. The displacement response value steadily declines with the increasing filling depth and horizontal displacement, presenting a clear spatial influence range, with the site of maximum incremental displacement as the center. After filling, the safety factors of the potential sliding surface in the F and G areas are 2.531 and 1.118, respectively, and the slope is in a stable state. The monitoring data show that the deformation mostly takes place within 10 m of the surface. The study’s findings are thought to offer technical and practical knowledge for the slope risks.", "venue": "Frontiers in Earth Science", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-03-08", "journal": {"volume": "11"}, "authors": [{"authorId": "2117230101", "name": "Jun Hu"}, {"authorId": "2114108008", "name": "Wei-min Yuan"}, {"authorId": "50034848", "name": "X. Fu"}, {"authorId": "15793194", "name": "Zhenping Zhang"}, {"authorId": "46433237", "name": "Yongqiang Zhou"}, {"authorId": "2124692905", "name": "Shaobo Chai"}, {"authorId": "2109716239", "name": "Yongliang Cheng"}, {"authorId": "46630364", "name": "Q. Sheng"}], "citations": []}
