{"paperId": "96cb2f1ac6f6010313f2e72552e1aedd91e89817", "publicationVenue": null, "title": "WebScalding: A Framework for Big Data Web Services", "abstract": "CareerBuilder (CB) currently has 50 million active resumes and 2 million active job postings. Our team has been working to provide the most relevant jobs for job seekers and resumes for employers and recruiters. These goals often lead to Big Data problems. In this paper, we introduce WebScalding, a Big Data framework designed and developed to solve some of the common large scale data challenges at CB. The WebScalding framework raises the level of abstraction of Twitter's Scalding framework to adapt to CB's unique challenges. The WebScalding framework helps users by ensuring that: 1) All internal web services are available as cascading pipe operations, 2) These pipe operations can read from our common data sources and create a pipe assembly and, 3) The pipe assembly such created can be executed in the CB Hadoop cluster as well as local machines without making any changes. We describe WebScalding using three case studies taken from actual internal projects that explain how data scientists at CB not well versed in Big Data tools and methodologies leverage WebScalding to design, implement, and test Big Data applications. We also compare the execution time of a WebScalding program with its sequential Python counterpart to illustrate the super linear speed up of WebScalding programs.", "venue": "2015 IEEE First International Conference on Big Data Computing Service and Applications", "year": 2015, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2015-03-30", "journal": {"name": "2015 IEEE First International Conference on Big Data Computing Service and Applications", "pages": "493-498"}, "authors": [{"authorId": "40606126", "name": "Ferosh Jacob"}, {"authorId": "2115786520", "name": "Aaron Johnson"}, {"authorId": "2228581", "name": "F. Javed"}, {"authorId": "2116695102", "name": "Meng Zhao"}, {"authorId": "2551613", "name": "Matt McNair"}], "citations": [{"paperId": "24393e9e8c0c308f2c13daa059d63ca7534c861e", "title": "Cascading Workflow of Healthcare Services"}, {"paperId": "ad3e23bbac51d2c053305aedd9864676c88210ae", "title": "I-HASTREAM: Density-Based Hierarchical Clustering of Big Data Streams and Its Application to Big Graph Analytics Tools"}, {"paperId": "496d94f52b1745406db12e7ab60096d19950236e", "title": "An Effective and Efficient MapReduce Algorithm for Computing BFS-Based Traversals of Large-Scale RDF Graphs"}, {"paperId": "60e2cb8aff24cff5222ca0346e41dc0bd1f18769", "title": "Macau: Large-scale skill sense disambiguation in the online recruitment domain"}]}
