{"paperId": "96e345f9ba63383a60b7c520ef2906f165f3b173", "publicationVenue": {"id": "cd492924-29c4-496b-9535-082805f228d8", "name": "International Conference on Performance Engineering", "type": "conference", "alternate_names": ["Int Conf Perform Eng", "ICPE"], "url": "http://www.wikicfp.com/cfp/program?id=1445"}, "title": "The Performance of Distributed Applications: A Traffic Shaping Perspective", "abstract": "Widely used in datacenters and clouds, network traffic shaping is a performance influencing factor that is often overlooked when benchmarking or simply deploying distributed applications. While in theory traffic shaping should allow for a fairer sharing of network resources, in practice it also introduces new problems: performance (measurement) inconsistency and long tails. In this paper we investigate the effects of traffic shaping mechanisms on common distributed applications. We characterize the performance of a distributed key-value store, big data workloads, and high-performance computing under state-of-the-art benchmarks, while the underlying network's traffic is shaped using state-of-the-art mechanisms such as token-buckets or priority queues. Our results show that the impact of traffic shaping needs to be taken into account when benchmarking or deploying distributed applications. To help researchers, practitioners, and application developers we uncover several practical implications and make recommendations on how certain applications are to be deployed so that performance is least impacted by the shaping protocols.", "venue": "International Conference on Performance Engineering", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2023-04-15", "journal": {"name": "Proceedings of the 2023 ACM/SPEC International Conference on Performance Engineering"}, "authors": [{"authorId": "2188805328", "name": "Jasper A. Hasenoot"}, {"authorId": "2342602", "name": "Jan S. Rellermeyer"}, {"authorId": "2860260", "name": "Alexandru Uta"}], "citations": []}
