{"paperId": "96e614f3dd764ede22f32d8c7e41a3ff0d41b2ab", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "CodeAgent: Collaborative Agents for Software Engineering", "abstract": "Code review is a heavily collaborative process, which aims at ensuring the overall quality and reliability of software. While it provides massive benefits, the implementation of code review in an organization faces several challenges that make its automation appealing. Automated code review tools have been around for a while and are now improving thanks to the adoption of novel AI models, which help can learn about standard practices and systematically check that the reviewed code adheres to them. Unfortunately, existing methods fall short: they often target a single input-output generative model, which cannot simulate the collaboration interactions in code review to account for various perspectives; they are also sub-performing on various critical code review sub-tasks. In this paper, we advance the state of the art in code review automation by introducing CodeAgent, a novel multi-agent-based system for code review. Fundamentally, CodeAgent is steered by QA-Checker (short for\"Question-Answer Checking\"), a supervision agent, designed specifically to ensure that all agents' contributions remain relevant to the initial review question. CodeAgent is autonomous, multi-agent, and Large language model-driven. To demonstrate the effectiveness of CodeAgent, we performed experiments to assess its capabilities in various tasks including 1) detection of inconsistencies between code changes and commit messages, 2) detection of vulnerability introduction by commits, and 3) validation of adherence to code style. Our website is accessed in \\url{https://code-agent-new.vercel.app/index.html}.", "venue": "arXiv.org", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2024-02-03", "journal": {"name": "ArXiv", "volume": "abs/2402.02172"}, "authors": [{"authorId": "2282530681", "name": "Daniel Tang"}, {"authorId": "2256463164", "name": "Zhenghan Chen"}, {"authorId": "2269490397", "name": "Kisub Kim"}, {"authorId": "2210387237", "name": "Yewei Song"}, {"authorId": "2069990130", "name": "Haoye Tian"}, {"authorId": "40800531", "name": "Saad Ezzini"}, {"authorId": "2283159053", "name": "Yongfeng Huang"}, {"authorId": "2257181768", "name": "Jacques Klein"}, {"authorId": "3023999", "name": "Tegawendé F. Bissyandé"}], "citations": []}
