{"paperId": "96f1d2319f95e586215330d139fba6d04908bf00", "publicationVenue": {"id": "7777247e-fef1-4bb2-a34c-442bdcbc9b7b", "name": "IEEE Open Journal of the Computer Society", "type": "journal", "alternate_names": ["IEEE Open J Comput Soc"], "issn": "2644-1268", "url": "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=8782664"}, "title": "Towards Efficient and Delay-Aware NFV-Enabled Unicasting With Adjustable Service Function Chains", "abstract": "Network Function Virtualization (NFV) has becoming an emerging technology for ensuring the reliability, security and scalability of data flows. The Virtual Network Function (VNF) embedding problem, which tries to minimize the embedding cost and link connection cost toward customers or maximize network throughput for a given set of NFV-enabled requests, has attracted extensive interests recently. However, the existing works always assume the fixed execution order of VNFs, which limits their application. Thus, we investigate the VNF embedding problem without such limitations in this paper. Firstly, we propose a general transformation framework for the NFV-enabled unicast routing problem with arbitrary order of service function chains, and an optimal algorithm is proposed for the unicast VNF embedding problem without delay constraint. Secondly, an efficient algorithm with theoretical guarantee is also proposed for such a problem with delay constraint. Thirdly, the throughput maximization problem where there exists a set of unicast requests with delay constraints is also investigated, and an efficient algorithm is also proposed to maximize the number of admitted requests while the total traffic delivery cost is minimized. Finally, we evaluate the proposed algorithms via extensive simulations, which demonstrates the high efficiency of the proposed algorithms.", "venue": "IEEE Open Journal of the Computer Society", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Open Journal of the Computer Society", "pages": "281-294", "volume": "3"}, "authors": [{"authorId": "2155357033", "name": "Long Li"}, {"authorId": "2190538819", "name": "Pengxin Zheng"}, {"authorId": "145922563", "name": "Q. Chen"}, {"authorId": "72259333", "name": "Tao Wang"}, {"authorId": "2185114942", "name": "Feng Wang"}, {"authorId": "9200450", "name": "Yongchao Tao"}, {"authorId": "2190576349", "name": "Jizhou Sun"}], "citations": []}
