{"paperId": "96f5938a6a01693168b8858c8ab5f0787d98b7f7", "publicationVenue": {"id": "3c27e831-750f-45bc-9914-2148a5259eba", "name": "IEEE Transactions on Artificial Intelligence", "type": "journal", "alternate_names": ["IEEE Trans Artif Intell"], "issn": "2691-4581", "url": "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=9078688"}, "title": "A Practical Recipe for Federated Learning Under Statistical Heterogeneity Experimental Design", "abstract": "Federated Learning (FL) has been an area of active research in recent years. There have been numerous studies in FL to make it more successful in the presence of data heterogeneity. However, despite the existence of many publications, the state of progress in the field is unknown. Many of the works use inconsistent experimental settings and there are no comprehensive studies on the effect of FL-specific experimental variables on the results and practical insights for a more comparable and consistent FL experimental setup. Furthermore, the existence of several benchmarks and confounding variables has further complicated the issue of inconsistency and ambiguity. In this work, we present the first comprehensive study on the effect of FL-specific experimental variables in relation to each other and performance results, bringing several insights and recommendations for designing a meaningful and well-incentivized FL experimental setup. We further aid the community by releasing FedZoo-Bench, an open-source library based on PyTorch with pre-implementation of 22 state-of-the-art methods, and a broad set of standardized and customizable features available at https://github.com/MMorafah/FedZoo-Bench. We also provide a comprehensive comparison of several state-of-the-art (SOTA) methods to better understand the current state of the field and existing limitations.", "venue": "IEEE Transactions on Artificial Intelligence", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-07-28", "journal": {"name": "ArXiv", "volume": "abs/2307.15245"}, "authors": [{"authorId": "2133450768", "name": "Mahdi Morafah"}, {"authorId": "2108301315", "name": "Weijia Wang"}, {"authorId": "2068280690", "name": "Bill Lin"}], "citations": []}
