{"paperId": "971064d03f05db7d37c7553625af827d3e67f173", "publicationVenue": {"id": "d5b215f3-f737-45b2-875b-df309ce14c43", "name": "Scientific Programming", "type": "journal", "alternate_names": ["Sci Program"], "issn": "1058-9244", "url": "https://www.hindawi.com/journals/sp/", "alternate_urls": ["https://www.iospress.nl/html/10589244.php", "https://www.wiley.com/legacy/compbooks/compjournals/sciprog.html", "http://content.iospress.com/journals/scientific-programming"]}, "title": "Survey of Scientific Programming Techniques for the Management of Data-Intensive Engineering Environments", "abstract": "The present paper introduces and reviews existing technology and research works in the field of scientific programming methods and techniques in data-intensive engineering environments. More specifically, this survey aims to collect those relevant approaches that have faced the challenge of delivering more advanced and intelligent methods taking advantage of the existing large datasets. Although existing tools and techniques have demonstrated their ability to manage complex engineering processes for the development and operation of safety-critical systems, there is an emerging need to know how existing computational science methods will behave to manage large amounts of data. That is why, authors review both existing open issues in the context of engineering with special focus on scientific programming techniques and hybrid approaches. 1193 journal papers have been found as the representative in these areas screening 935 to finally make a full review of 122. Afterwards, a comprehensive mapping between techniques and engineering and nonengineering domains has been conducted to classify and perform a meta-analysis of the current state of the art. As the main result of this work, a set of 10 challenges for future data-intensive engineering environments have been outlined.", "venue": "Scientific Programming", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2018-10-30", "journal": {"name": "Sci. Program.", "pages": "8467413:1-8467413:21", "volume": "2018"}, "authors": [{"authorId": "144712358", "name": "J. Rodríguez"}, {"authorId": "1397382854", "name": "G. Alor-Hernández"}, {"authorId": "144576715", "name": "J. Mejía"}], "citations": [{"paperId": "c2f75677c1dd67d8730c7f2bc28c91c6d952b2d1", "title": "Cooperative Business Intelligence Model Using a Multiagent Platform"}, {"paperId": "0e4b76d88fac02b11b91103dfbe0e395bab98adc", "title": "Research and Implementation of Efficient Parallel Processing of Big Data at TELBE User Facility"}, {"paperId": "40964cabce85a480fec8ad64dab64aa9e9c9cc52", "title": "Challenges and opportunities in the integration of the Systems Engineering process and the AI/ML model lifecycle"}]}
