{"paperId": "9715c6b78976d282c6cd091f9c53585431ac0f86", "publicationVenue": {"id": "e574da12-4e4c-4b78-a203-ae3719c0c4f7", "name": "Annual International Computer Software and Applications Conference", "type": "conference", "alternate_names": ["Comput Softw Appl Conf", "Annu Int Comput Softw Appl Conf", "COMPSAC Work", "Computer Software and Applications Conference", "COMPSAC Workshops", "COMPSAC"], "url": "http://www.wikicfp.com/cfp/program?id=548"}, "title": "Smart-Power: A Smart Cyber-Physical System to Detect IoT Security Threat through Behavioral Power Profiling", "abstract": "Recently, the security of heterogeneous Internet of Things (IoT) devices has become a major concern of every Wireless Sensor Network (WSN). Efficient power measurement in smart IoT devices has become one of the key research topics. Power optimization of current IoT technology allows the development of many IoT-based applications. In this paper, we design and develop a Cyber-Physical System (CPS) to detect IoT security threats via behavioral power profiling of a heterogeneous wireless sensor device using a smartphone. Experimentation and verification have been conducted on a sample of smart IoT devices with different test scenarios including the device in an Idle state, Active state, Idle, and Active with distributed denial-of-service (DDoS) attack, Idle, and Active with a man-in-the-middle (MitM) attack. We propose to use the device power consumption rate with and without attack to predict and detect a security threat using logistic regression techniques. The proposed system can detect a potential security threat with an average accuracy of 74% and a device high of 85%.", "venue": "Annual International Computer Software and Applications Conference", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-07-01", "journal": {"name": "2020 IEEE 44th Annual Computers, Software, and Applications Conference (COMPSAC)", "pages": "1041-1049"}, "authors": [{"authorId": "2286662750", "name": "Akm Jahangir Majumder"}, {"authorId": "1965850923", "name": "Jared D. Miller"}, {"authorId": "1965937200", "name": "Charles B. Veilleux"}, {"authorId": "144762771", "name": "Amir A. Asif"}], "citations": [{"paperId": "b5a8bf67dd8226459cc7230ab5d72a04e23750c7", "title": "The Security and Privacy of Mobile-Edge Computing: An Artificial Intelligence Perspective"}, {"paperId": "eecb87a6a4a71ea7ca1a554c95d6fd54a5ca40e9", "title": "A Cyber-Physical System to Detect IoT Security Threats of a Smart Home Heterogeneous Wireless Sensor Node"}]}
