{"paperId": "971d6cfc91757fb59c6ec36804ce3b6041c4e8c1", "publicationVenue": {"id": "3416dd37-f45d-40ed-b04e-875fcff8fa2f", "name": "Nutrients", "type": "journal", "issn": "2072-6643", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169249", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169249", "http://www.mdpi.com/journal/nutrients/", "https://www.mdpi.com/journal/nutrients"]}, "title": "Association between Dietary Patterns and the Risk of Hyperemesis Gravidarum", "abstract": "(1) Background: Although studies have suggested that dietary interventions may have potential benefits over conventional medical treatments, research on the association between dietary patterns and hyperemesis gravidarum (HG) in pregnant women is scarce. (2) Methods: To explore the relationship between dietary patterns and the risk of HG, a cross-sectional study was conducted in Xi’an, China from April 2021 to September 2022. Dietary intake was assessed by a semi-quantitative food-frequency questionnaire, and then factor analysis was used to derive dietary patterns. HG was defined as persistent and severe nausea and vomiting with weight loss ≥ 5%, pregnancy-unique quantification of emesis (PUQE) score ≥ 13, or hospitalization due to vomiting. Logistic regression models were used to estimate ORs and 95% CIs for HG according to dietary pattern scores. Stratified analyses and tests for interaction were performed by potential confounders. (3) Results: Of the 3122 pregnant women enrolled, 2515 individuals (mean age: 31.2 ± 3.4 years) were included in the final analysis. In total, 226 (8.9%) pregnant women were identified as having HG. Five dietary patterns were identified. After adjusting for covariates, the highest quartile of the “fish, shrimp and meat” and “egg, milk and water drinking” patterns was associated with a 37% and 58% lower risk of HG compared with the lowest quartile, respectively (p-trend < 0.05). Conversely, the highest quartile of the “beverage” pattern was associated with a 64% higher risk of HG compared with the lowest quartile (p-trend = 0.02). Furthermore, significant interactions were observed between the “egg, milk and water drinking” pattern and parity, employment status and nutritional supplement use (p-interaction < 0.05). (4) Conclusions: A diet rich in eggs, milk, seafood and unprocessed poultry and animal meat may be a protective factor against HG, while a diet high in beverages may be detrimental to HG. These associations may vary by parity, employment status and nutritional supplement use.", "venue": "Nutrients", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-07-25", "journal": {"name": "Nutrients", "volume": "15"}, "authors": [{"authorId": "82715209", "name": "W. Cheng"}, {"authorId": "2174505102", "name": "Lintian Li"}, {"authorId": "2225255758", "name": "Zhaoqing Long"}, {"authorId": "9549604", "name": "Xiuxiu Ma"}, {"authorId": "6896702", "name": "Fangyao Chen"}, {"authorId": "47687339", "name": "Le Ma"}, {"authorId": "2108060915", "name": "Shunming Zhang"}, {"authorId": "2118746897", "name": "Jing Lin"}], "citations": []}
