{"paperId": "9741764a42588e0d46d27a89fccb584086fe06d0", "publicationVenue": {"id": "97a677bb-0fa7-4c1d-a54e-24db1fb98dd5", "name": "International Conference on Computational Intelligence and Communication Networks", "type": "conference", "alternate_names": ["CICN", "Int Conf Comput Intell Commun Netw"]}, "title": "Performance Evaluation of Machine Learning Models on Apache Spark: An Empirical Study", "abstract": "Artificial intelligence (AI) and machine learning significantly improve many sectors, such as education, healthcare, and industry. Machine learning techniques mainly depend on the volume and diversity of training data. With the digital transformation we live in, an abundant amount of data can be collected from different sources. However, the problem that needs to be addressed is how this amount of data can be processed and where it can be stored. Cloud services and distributed file systems (DFSs) help address this issue. Many DFSs such as Hadoop, Quantcast, and Apache Spark differ in many aspects, including scheduling algorithms, data management protocol, throughput, and runtime. Some DFSs may be better for working with specific applications than others. Apache Spark is capable of handling iterative operations like machine learning operations as well as it provides an integrated library of different machine learning algorithms called MLlib. In this paper, we evaluated the use of Spark using two machine learning algorithms, namely Logistic Regression (LR) and Random Forests (RF). We investigated the effect of varying the memory allocation configuration and the use of GPU. We concluded that the use of Spark greatly improves the runtime and memory consumption. However, its use has to be justifiable and needed for the size of the data due to different factors that affect the machine learning model's accuracy. The memory allocation should be kept to the minimum needed, and GPU should only be used when the machine learning algorithm used supports parallelization.", "venue": "International Conference on Computational Intelligence and Communication Networks", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-12-04", "journal": {"name": "2022 14th International Conference on Computational Intelligence and Communication Networks (CICN)", "pages": "498-504"}, "authors": [{"authorId": "121125062", "name": "Asma Z. Yamani"}, {"authorId": "122831629", "name": "Shikah J. Alsunaidi"}, {"authorId": "6564447", "name": "Imane Boudellioua"}], "citations": []}
