{"paperId": "974623835ac5dc9f562c2d4128ee68d0eee6a9fa", "publicationVenue": {"id": "0a05a451-a2de-4e8e-bade-704b9857926a", "name": "Distributed Event-Based Systems", "type": "conference", "alternate_names": ["DEBS", "Distrib Event-based Syst"], "url": "https://en.wikipedia.org/wiki/Distributed_Event-Based_Systems"}, "title": "FogStore: A Geo-Distributed Key-Value Store Guaranteeing Low Latency for Strongly Consistent Access", "abstract": "We design Fogstore, a key-value store for event-based systems, that exploits the concept of relevance to guarantee low-latency access to relevant data with strong consistency guarantees, while providing tolerance from geographically correlated failures. Distributed event-based processing pipelines are envisioned to utilize the resources of densely geo-distributed infrastructures for low-latency responses - enabling real-time applications. Increasing complexity of such applications results in higher dependence on state, which has driven the incorporation of state-management as a core functionality of contemporary stream processing engines a la Apache Flink and Samza. Processing components executing under the same context (like location) often produce information that may be relevant to others, thereby necessitating shared state and an out-of-band globally-accessible data-store. Efficient access to application state is critical for overall performance, thus centralized data-stores are not a viable option due to the high-latency of network traversals. On the other hand, a highly geo-distributed datastore with low-latency implemented with current key-value stores would necessitate degrading client expectation of consistency as per the PACELC theorem. In this paper we exploit the notion of contextual relevance of events (data) in situation-awareness applications - and offer differential consistency guarantees for clients based on their context. We highlight important systems concerns that may arise with a highly geo-distributed system and show how Fogstore's design tackles them. We present, in detail, a prototype implementation of Fogstore's mechanisms on Apache Cassandra and a performance evaluation. Our evaluations show that Fogstore is able to achieve the throughput of eventually consistent configurations while serving data with strong consistency to the contextually relevant clients.", "venue": "Distributed Event-Based Systems", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2018-06-25", "journal": {"name": "Proceedings of the 12th ACM International Conference on Distributed and Event-based Systems"}, "authors": [{"authorId": "34174423", "name": "Harshit Gupta"}, {"authorId": "1751741", "name": "U. Ramachandran"}], "citations": [{"paperId": "07e4f2a49e002033e7272ca3525610a125125cdd", "title": "Eventually Consistent Configuration Management in Fog Systems With CRDTs"}, {"paperId": "915198ca2e1b0e4477d97ac6dd061bd6491b5e7c", "title": "Service Provisioning in Edge-Cloud Continuum: Emerging Applications for Mobile Devices"}, {"paperId": "e6d0eb88ebabda26cdf3f078af42c22817e7997c", "title": "Fog System Configuration Management with CRDTs"}, {"paperId": "d4559c56dbd00ccaf9e6ce42d0f4777c0ec3ffc9", "title": "Data Management for mobile applications dependent on geo-located data"}, {"paperId": "a27196cd95cea12c628080e4a59885846c8d56da", "title": "Resilient Cloud Control System: Realizing resilient cloud-based optimal control for cyber-physical systems"}, {"paperId": "179ef9a2575bd30b7e49bc07bd79a96d61fa710d", "title": "Managing data replication and distribution in the fog with FReD"}, {"paperId": "979524b45dee0b1d829b45eb6cc316ae4dfb8316", "title": "CCECGP: causal consistency model of edge–cloud collaborative based on grouping protocol"}, {"paperId": "a2cc116bc41043fea245b78c972193739aa5e48b", "title": "A new adaptive causal consistency approach in Edge Computing Environment"}, {"paperId": "36bc65b6d660bff6efef097800f25d90445c3ba0", "title": "Privacy-Preserving Storage in the Fog"}, {"paperId": "d5b337b3fa55fb93e62f0ef69d2ef2fa6f702bc8", "title": "The SPEC-RG Reference Architecture for The Compute Continuum"}, {"paperId": "407934174e1646fc09aea8b07fc9abb294865347", "title": "A geographical-aware state deployment service for Fog Computing"}, {"paperId": "ce2876617d90fd291fc816590eb68462c5fb908f", "title": "Engage: Session Guarantees for the Edge"}, {"paperId": "68dfe31d04e4a6c4a6b19062c2737feacf985098", "title": "Design and Implementation of an Efficient Key-Value Storage Engine for Mobile Edge Computing"}, {"paperId": "5e124ff0ec8a6fcc1395dffb40b4c42091269576", "title": "Workload-optimized sensor data store for industrial IoT gateways"}, {"paperId": "f6e7549dfe136c96831b319174f2d62a95cb5386", "title": "PGCE: A Distributed Storage Causal Consistency Model Based on Partial Geo-replication and Cloud-Edge Collaboration Architecture"}, {"paperId": "54c3380cee48669a2e77c2c86ee29b9247f9f4bb", "title": "Rocky: Replicating Block Devices for Tamper and Failure Resistant Edge-based Virtualized Desktop Infrastructure"}, {"paperId": "1c0a3b2773dac98043622ff38e9151cfe04e9b43", "title": "LEGOStore: A Linearizable Geo-Distributed Store Combining Replication and Erasure Coding"}, {"paperId": "0c97a9820d45ba145fb1de920844f70e5a198ba0", "title": "Portkey: Adaptive Key-Value Placement over Dynamic Edge Networks"}, {"paperId": "fc2596773df8b2a804783a8615b784986bbf6d47", "title": "Platforms for Edge Computing and Internet of Things applications: A survey"}, {"paperId": "c0f81ab57db5cfd9005898011a46144b9a66aa03", "title": "Managing the Cloud Continuum: Lessons Learnt from a Real Fog-to-Cloud Deployment"}, {"paperId": "d6993d2acfcfc6bde47fca65a8e18cffdc0e1df2", "title": "Topic allocation method on edge servers for latency‐sensitive notification service"}, {"paperId": "550673eca1d962ff3e5100041046fbb6020b3b3c", "title": "Service Placement for Collaborative Edge Applications"}, {"paperId": "d4b97f8019298355d9b05df332fe321981561229", "title": "A Case for Elevating the Edge to be a Peer of the Cloud"}, {"paperId": "e701ec7cf5ad4a342c89be1458d3f2e018e09376", "title": "Griffin: A Storage Service for Granular Edge Applications"}, {"paperId": "6b2e7d29c6f6ca705b2f4f048d5ae63bb5f19480", "title": "Combining High Throughput and Low Migration Latency for Consistent Data Storage on the Edge"}, {"paperId": "4768ae92eb6765d3c69daf4fd16ab4691695aa20", "title": "EdgeKV: Distributed Key-Value Store for the Network Edge"}, {"paperId": "90024260139f27a0f498c7ab4247b1ae2eeb876b", "title": "EdgeKV: Decentralized, scalable, and consistent storage for the edge"}, {"paperId": "38d7f1176e446db2a1fd9dcbc8bfe268b564a220", "title": "Sharing and Caring of Data at the Edge"}, {"paperId": "31d8a93d0974da910020a7bba0f9e2b6326445b0", "title": "Layer-Integrated Edge Distributed Data Store for Real-time and Stateful Services"}, {"paperId": "a05eb8c3c12327aeb17da10a91f792bf2b5e79f6", "title": "Towards a replication service for data-intensive fog applications"}, {"paperId": "de77f6aeb720ffab575e7d53310004d227c1bac7", "title": "Challenges in designing edge-based middlewares for the Internet of Things: A survey"}, {"paperId": "531d28f17b4d37bd4eced799fa4761b81af91290", "title": "FBase: A Replication Service for Data-Intensive Fog Applications"}, {"paperId": "e933b790b0f4c8de8014117ac4adee21f3352446", "title": "SML4C: Fully Automatic Classification of State Machine Models for Model Inspection in Education"}, {"paperId": "39aa570546a915da53cda713ac0643c7afcab4cd", "title": "Elevating the Edge to Be a Peer of the Cloud"}, {"paperId": "9ea8e37ffbe376b3f96fe633f6c8ce5bf9b63080", "title": "A comparative analysis of adaptive consistency approaches in cloud storage"}, {"paperId": "ffbc474c34ce1eccd7ba3a522cbb5f75c24ba95d", "title": "Optimization policy for file replica placement in fog domains"}, {"paperId": "801fcc286640a280680f06f46985e352dece56a9", "title": "Distributed Key-Value Storage for Edge Computing and its Explicit Data Distribution Method"}, {"paperId": "3e4388586eb2538657a24ca1ace3c6877ec2235b", "title": "All One Needs to Know about Fog Computing and Related Edge Computing Paradigms: A Complete Survey"}, {"paperId": "3d5cdda18e916b4a5ea88e3c10778d637d3400c2", "title": "Towards MRAM Byte-Addressable Persistent Memory in Edge Database Systems"}, {"paperId": "2170e97a8f296e124f257fd13f366def53d05bef", "title": "The SPEC-RG Reference Architecture for the Edge Continuum"}, {"paperId": "a3053d7bb331a21cd7b2ad6e29c4b308947db9ca", "title": "A Privacy-Preserving Storage Service for the Fog"}, {"paperId": "390f3611daf0dbefef5642575c6936ac5110011b", "title": "E NGAGE : Session Guaranties for the Edge"}, {"paperId": "32fee3aa290aff501bde533f920f7ea4a20fb890", "title": "Foundations of Composite Event Recognition (Dagstuhl Seminar 20071)"}, {"paperId": "89ad04546c3ff4767bf3e0dcfd8bb0afc0b0a9bc", "title": "Approach to Testing Many State Machine Models in Education"}, {"paperId": "e0dff5f27ae278eccde8b722347c4d5dcabe8769", "title": "All One Needs to Know about Fog Computing and Related Edge Computing Paradigms"}]}
