{"paperId": "9748f318ad833ec509195f798688c83c0f8513a8", "publicationVenue": null, "title": "INTEGRASI KEBIJAKAN PERTAHANAN DAN RESPON BENCANA DIINDONESIA", "abstract": "Indonesia menghadapi bahaya alam seperti gempa bumi, tsunami, dan banjir, sehingga memerlukan kesiapsiagaan bencana dan tindakan tanggap yang efektif. Namun, kebijakan pertahanan dan koordinasi antar lembaga masih belum dieksplorasi. Penelitian ini mengkaji integrasi kebijakan pertahanan Indonesia antara langkah-langkah kesiapsiagaan dan tanggap bencana, dampak koordinasi antar lembaga dan pertahanan sipil, tantangan-tantangan akibat pemisahan kebijakan, dan mengusulkan strategi perbaikan. Penelitian ini akan menggunakan pendekatan penelitian kualitatif, menganalisis sumber data sekunder seperti laporan pemerintah, artikel akademis, dokumen kebijakan, dan kerangka kerja serta pedoman internasional mengenai kebijakan pertahanan dan manajemen bencana di Indonesia. Temuan-temuan penelitian ini akan menjelaskan tingkat integrasi yang ada antara kebijakan pertahanan dan langkah[1]langkah kesiapsiagaan dan tanggap bencana di Indonesia. Laporan ini akan mengungkap dampak koordinasi antara Lembaga pertahanan dan entitas pertahanan sipil terhadap upaya penanggulangan bencana. Selanjutnya, tantangan-tantangan yang timbul dari pemisahan kebijakan pertahanan dan sistem manajemen bencana akan diidentifikasi. Pada akhirnya, strategi-strategi akan diusulkan untuk meningkatkan integrasi antara kebijakan pertahanan dan kesiapsiagaan dan tanggap bencana di Indonesia. Penelitian ini akan membahas kebijakan pertahanan Indonesia yang melibatkan kesiapsiagaan bencana dan langkah-langkah tanggap, menekankan koordinasi antara lembaga-lembaga dan pertahanan sipil, mengatasi tantangan pemisahan, dan mengusulkan strategi untuk meningkatkan integrasi.", "venue": "JISIP UNJA (Jurnal Ilmu Sosial Ilmu Politik Universitas Jambi)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-11-20", "journal": {"name": "JISIP UNJA (Jurnal Ilmu Sosial Ilmu Politik Universitas Jambi)"}, "authors": [{"authorId": "2079467490", "name": "A. Sarjito"}], "citations": []}
