{"paperId": "975a424c9b55838a43f3ab6d32f1180b00fbc23a", "publicationVenue": {"id": "6175efe8-6f8e-4cbe-8cee-d154f4e78627", "name": "Mathematics", "issn": "2227-7390", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-283014", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-283014", "https://www.mdpi.com/journal/mathematics"]}, "title": "A Survey on High-Dimensional Subspace Clustering", "abstract": "With the rapid development of science and technology, high-dimensional data have been widely used in various fields. Due to the complex characteristics of high-dimensional data, it is usually distributed in the union of several low-dimensional subspaces. In the past several decades, subspace clustering (SC) methods have been widely studied as they can restore the underlying subspace of high-dimensional data and perform fast clustering with the help of the data self-expressiveness property. The SC methods aim to construct an affinity matrix by the self-representation coefficient of high-dimensional data and then obtain the clustering results using the spectral clustering method. The key is how to design a self-expressiveness model that can reveal the real subspace structure of data. In this survey, we focus on the development of SC methods in the past two decades and present a new classification criterion to divide them into three categories based on the purpose of clustering, i.e., low-rank sparse SC, local structure preserving SC, and kernel SC. We further divide them into subcategories according to the strategy of constructing the representation coefficient. In addition, the applications of SC methods in face recognition, motion segmentation, handwritten digits recognition, and speech emotion recognition are introduced. Finally, we have discussed several interesting and meaningful future research directions.", "venue": "Mathematics", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2023-01-13", "journal": {"name": "Mathematics"}, "authors": [{"authorId": "2135392890", "name": "Wentao Qu"}, {"authorId": "4451697", "name": "Xianchao Xiu"}, {"authorId": "2145302366", "name": "Huangyue Chen"}, {"authorId": "1714297", "name": "Lingchen Kong"}], "citations": [{"paperId": "cbddf41f690f8bd69fffdfd4185fd9baf48efc93", "title": "Veri Madenciliğinde Kümeleme Teknikleri: Yöntemler, Zorluklar ve Uygulamalar Üzerine Bir Araştırma"}, {"paperId": "12f84a94695495013dad9f66a78c5376ae9f58a1", "title": "Dimensionality Reduced Clustered Data and Order Partition and Stepwise Dimensionality Increasing Indices"}, {"paperId": "e330ad7c87fd3c86cff98055118e6b87691051ed", "title": "Constrained Hard-Soft Subspace Clustering"}, {"paperId": "f408825c823a4241c88bce443aa48387383be2a3", "title": "Semi-supervised Projected Subspace Clustering"}, {"paperId": "44360f774327b4eeadadf4cadce58978504c1019", "title": "Learning Arithmetic Formulas in the Presence of Noise: A General Framework and Applications to Unsupervised Learning"}, {"paperId": "127dc6025def86df5dc72abc72e1a00b7e8e6dc9", "title": "Marginalized Graph Autoencoder with Subspace Structure Preserving"}, {"paperId": "62872a4ea61a31864b43c0a19f368579b5fa5836", "title": "Multi-view subspace clustering for learning joint representation via low-rank sparse representation"}, {"paperId": "255ca9f687c0e08c2be47039cff8a060ed43719f", "title": "An Enhanced Regularized Clustering Method With Adaptive Spurious Connection Detection"}]}
