{"paperId": "975a2ff83e207340385d07499a2c9414fec7d3b2", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Waiting for Q: An Exploration of QAnon Users' Online Migration to Poal in the Wake of Voat's Demise", "abstract": "Controversial and hateful online communities often face bans on mainstream social networks as part of moderation efforts. Reddit has implemented such measures by banning various communities and users in recent years. Although banning these communities eliminates the problem on one platform, the dispersal of users to other social networks, often with more lenient policies and moderation, remains a challenge. Voat, a Reddit-like platform, provided a haven for sharing controversial and hateful discourse that experienced significant growth and popularity with every Reddit ban until its eventual shutdown in December 2020. This study examines the migration patterns of QAnon adherents across Reddit, Voat, and Poal following the sudden Reddit bans and the announced Voat shutdown. We perform a large-scale measurement of the migrations, including Poal's influx following the Voat shutdown, which has not been studied before under this lens. We observe, among other things, that Reddit users suspected the imminent bans, so they suggested Voat as an alternative. However, after their most used subreddit, r/CBTS_Stream, was banned, users moved to r/greatawakening instead. It was only after the banning of both subreddits that users migrated to Voat. Similarly, Voat users proposed Poal as an alternative after Voat announced its shutdown, but their migration primarily occurred on the last day of Voat, resulting in approximately half of Voat's QAnon user base moving to Poal. This represents a significantly higher percentage compared to the migration from Reddit to Voat (9.7%), indicating that a warning with little time left, can aid towards an effective coordination among the community users. Lastly, our research uncovers evidence suggesting that discussions and planning related to the January 6th attack on the US Capitol emerged predominantly among Poal users, many of whom were Voat migrants.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-02-02", "journal": {"name": "ArXiv", "volume": "abs/2302.01397"}, "authors": [{"authorId": "9207147", "name": "Antonis Papasavva"}, {"authorId": "3378428", "name": "Enrico Mariconti"}], "citations": [{"paperId": "88f9846169202a993fa94cd55a437a8067c7648e", "title": "How Language, Culture, and Geography shape Online Dialogue: Insights from Koo"}, {"paperId": "3dddc0f7d839d4a7dd0aa220a2772896ea2c7414", "title": "No Easy Way Out: The Effectiveness of Deplatforming an Extremist Forum to Suppress Hate and Harassment"}]}
