{"paperId": "9762ee359f05a14fc405aa795e7286621f630dbe", "publicationVenue": {"id": "18cb41bf-d23d-4c47-a30d-3f1ef6abfb1b", "name": "IoT", "issn": "2624-831X", "url": "https://www.mdpi.com/journal/IoT"}, "title": "A Way Ahead Towards Efficient Big Data Analytics: Prime Utilization in Businesses Moving Towards Cloud", "abstract": "Nowadays Businesses have greatly benefited from data analytics. Companies analyze data from various activities like fraud, sales, risk management, marketing, inventory optimization, and customer support to improve their strategic and tactical business decisions. However, analyticsis powerful enough to work with big data which is too complex, expensive, difficult for computation and resource-intensive for smaller companies to use. However, all these businesses have not been able to benefit from high powered analytics and therefore cannot make the most out of their information. Big data administration generally require more no of IT staff. It also uses many expensive servers with high configuration and includes software that is very difficult to set up and maintain. Organizations require innovative technology or systems that should be able to handle complex data to get the appropriate output. Smaller companies are facing trouble in finding employees capable of working with big analytics. This field deals with advanced and complex technology and new area of technology growing rapidly. All above mentioned factors made big data analytics fitted only to the large organizations. The above requirements are accomplished by proposing a system which performs adopting cloud as a platform to work with big data, which will help to make big analytic easier to handle the analytics and provides on demand cost efficient platform with great horizontal scalability. This computational methodology and algorithm for big data in the cloud environment make their platform more accessible. This new paradigm will play a leading role in the near future.", "venue": "IoT", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2016-07-19", "journal": {"name": "", "pages": "14-17", "volume": ""}, "authors": [{"authorId": "35224065", "name": "R. Sathe"}, {"authorId": "49031887", "name": "Sandeep Raskar"}], "citations": []}
