{"paperId": "97642abd1a72d532d7f6d306a9e0b7ad3252b87b", "publicationVenue": {"id": "070a8b94-9234-4a39-bff0-23e0c6b74464", "name": "International Conference on Statistical and Scientific Database Management", "type": "conference", "alternate_names": ["Stat Sci Database Manag", "SSDBM", "Statistical and Scientific Database Management", "Int Conf Stat Sci Database Manag"], "url": "http://www.ssdbm.org/"}, "title": "Multidimensional Clustering over Big Data: Models, Issues, Analysis, Emerging Trends", "abstract": "Clustering is an essential task of the whole pattern recognition process, and it can serve under several roles, for instance in terms of data pre-processing tool for better (i.e., more accurate) pattern recognition analysis and mining. In this vest, a critical applicative setting is represented by applying pattern recognition tools over emerging big data. Here, clustering specially plays a challenging role within the context of this conceptual mining framework, and, under a larger vision, it can act as pre-processing task for general big data clustering problems. In this paper, we first focus on state-of-the-art solutions for big data clustering in the specific pattern recognition context, by highlighting benefits and limitations. Then, we focus the attention on the problem of effectively and efficiently clustering big data via innovative multidimensional metaphors, thus achieving the definition of so-called multidimensional clustering over big data. In this so-delineated research setting, based on the well-known challenges of big data management (e.g., volume, velocity, variety, and veracity), we provide critical review and discussion, complemented by a rich set of research directions, development perspectives and emerging trends of the investigated topics, as contextualized in the reference big-data-analytics scientific area.", "venue": "International Conference on Statistical and Scientific Database Management", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference", "Review"], "publicationDate": "2020-07-07", "journal": {"name": "Proceedings of the 32nd International Conference on Scientific and Statistical Database Management"}, "authors": [{"authorId": "145046124", "name": "A. Cuzzocrea"}], "citations": [{"paperId": "860a1408187d85181196113c107d4ca40c418a71", "title": "Analysis of multi-dimensional Industrial IoT (IIoT) data in Edge-Fog-Cloud based architectural frameworks : A survey on current state and research challenges"}, {"paperId": "4b1454a70e5d3dc7f29b0a1acba7280566d4fa67", "title": "Issues of building an intelligent water transport management system"}]}
