{"paperId": "976fc76133f863f0bcaa37004818117a0952af6f", "publicationVenue": {"id": "bb21160f-0f31-4e34-abab-715b95a870a2", "name": "Indonesian Journal of Electrical Engineering and Computer Science", "type": "journal", "alternate_names": ["Indones J Electr Eng Comput Sci"], "issn": "2502-4752", "url": "http://www.iaescore.com/journals/index.php/IJEECS"}, "title": "Classification of deep learning convolutional neural network feature extraction for student graduation prediction", "abstract": "One indicator of a university’s educational quality is the proportion of enrolled students who actually graduate within four years. This proportion is typically fewer than the number of students that enroll in a given year. A low graduation rate can have a negative impact on both the university’s reputation and its accreditation because it indicates that fewer students are completing their degrees. Student activity, economic, and other issues all play a role in why some students are unable to complete their degrees on time. As a result, stakeholders need a model that can predict whether or not students will graduate on time as a means of evaluating and giving a basis for policy actions. This research proposes a model for converting textual data into an image format using a deep learning convolutional neural network (CNN), and then classifying the extracted features using a variety of machine learning classification algorithms like the decision tree, random forest, Naive Bayes, support vector machine (SVM), and k-nearest neighbor (K-NN). The classification model trained on feature extraction data had a 96.1% accuracy rate, while the classification model trained on the original data achieved a 71.2% accuracy rate.", "venue": "Indonesian Journal of Electrical Engineering and Computer Science", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-10-01", "journal": {"name": "Indonesian Journal of Electrical Engineering and Computer Science"}, "authors": [{"authorId": "80707873", "name": "A. Salam"}, {"authorId": "2102919399", "name": "Junta Zeniarja"}], "citations": []}
