{"paperId": "977901d4751feae118c0ad5d0092eaf89d851e38", "publicationVenue": {"id": "0b391b14-8353-4d09-be78-077ce8a257f7", "name": "Energy-Efficient Computing and Networking", "type": "conference", "alternate_names": ["Energy-efficient Comput Netw", "E-Energy", "e-Energy"], "url": "http://www.energyware.org/"}, "title": "Energon: A Data Acquisition System for Portable Building Analytics", "abstract": "Emerging building analytics rely on data-driven machine learning algorithms. However, writing these analytics is still challenging---developers not only need to know what data are required by the analytics but also how to reach the data in each individual building, despite the existing solutions to standardizing data and resource management in buildings. To bridge the gap between analytics development and the specific details of reaching the actual data in each building, we present Energon, an open-source system that enables portable building analytics. The core of Energon is a new data organization of building data, as well as the tools that can effectively manage building data and support building analytics development. More specifically, we propose a new \"logic partition\" of data resources in buildings, and this abstraction universally applies to all buildings. We develop a declarative query language to find data resources in this new logic views with high-level queries, thus substantially reducing development efforts. We also develop a query engine with automatic data extraction by traversing building ontology that widely exists in buildings. In this way, Energon enables analytics requirements to be mapped to building resources in a building-agnostic manner. Using four types of real-world building analytics, we demonstrate the use of Energon as well as its effectiveness in reducing development efforts.", "venue": "Energy-Efficient Computing and Networking", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2021-06-22", "journal": {"name": "Proceedings of the Twelfth ACM International Conference on Future Energy Systems"}, "authors": [{"authorId": "2065070339", "name": "Fang He"}, {"authorId": "2000174166", "name": "Yang Deng"}, {"authorId": "2027650169", "name": "Yanhui Xu"}, {"authorId": "2153078666", "name": "Cheng Xu"}, {"authorId": "2505157", "name": "Dezhi Hong"}, {"authorId": "2155682657", "name": "Dan Wang"}], "citations": [{"paperId": "59bffac4e4ea2e1ac8e4c146f11bd162fec38c88", "title": "Enabling portable demand flexibility control applications in virtual and real buildings"}, {"paperId": "d1b39e3f611f002431b8147097fd48aee0d2be20", "title": "SeeQ: A Programming Model for Portable Data-Driven Building Applications"}, {"paperId": "f369be0d14ec29ad40a2202a5cfc56c6d86ca539", "title": "Development and application of brick schema based multi-sources data integration for smart building energy management"}, {"paperId": "0e9736c8f4b88904381d918b4a1dec20e8252ff1", "title": "Enabling scalable deployment of data-driven applications across building portfolios"}, {"paperId": "308347b6a0f51770ff1b25e1e00ba169352eb545", "title": "A semantics-driven framework for scalable demand flexibility control applications"}, {"paperId": "f83afef9e3518912da0b90a6ed5f8cf109dfee63", "title": "A Programming Model for Portable Fault Detection and Diagnosis"}, {"paperId": "72e9842ce47f2f4455908eaa123492f04813d55c", "title": "Application-driven creation of building metadata models with semantic sufficiency"}, {"paperId": "dc204b9c87be33cdad246af58e09e512dded088c", "title": "Cloze: a building metadata model generation system based on information extraction"}]}
