{"paperId": "978067cc784e7668aad5d21361a2be540ca3da27", "publicationVenue": {"id": "bb932c0d-92c2-4dd8-b715-cd3405612170", "name": "Journal of Computer and Communications", "type": "journal", "alternate_names": ["J Comput Commun", "Journal of Computer-Mediated Communication"], "issn": "2327-5219", "alternate_issns": ["1083-6101"], "url": "http://www.scirp.org/journal/jcc", "alternate_urls": ["http://onlinelibrary.wiley.com/journal/10.1111/%28ISSN%291083-6101", "http://ow.ly/A3R7T", "http://jcmc.indiana.edu/index.html", "http://onlinelibrary.wiley.com/journal/10.1111/(ISSN)1083-6101"]}, "title": "Hybrid Warehouse Model and Solutions for Climate Data Analysis", "abstract": "Recently, due to the rapid growth increment of data sensors, a massive volume of data is generated from different sources. The way of administering such data in a sense storing, managing, analyzing, and extracting insightful information from the massive volume of data is a challenging task. Big data analytics is becoming a vital research area in domains such as climate data analysis which demands fast access to data. Nowadays, an open-source platform namely MapReduce which is a distributed computing framework is widely used in many domains of big data analysis. In our work, we have developed a conceptual framework of data modeling essentially useful for the implementation of a hybrid data warehouse model to store the features of National Climatic Data Center (NCDC) climate data. The hybrid data warehouse model for climate big data enables for the identification of weather patterns that would be applicable in agricultural and other similar climate change-related studies that will play a major role in recommending actions to be taken by domain experts and make contingency plans over extreme cases of weather variability.", "venue": "Journal of Computer and Communications", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2020-10-22", "journal": {"name": "Journal of Computer and Communications"}, "authors": [{"authorId": "98039568", "name": "Hasan Hashim"}], "citations": [{"paperId": "1ef43b4dbbeb811ca5d8c21110f49bd059e64430", "title": "Using Big Data and Hadoop in the Student Learning Process - Enhancing the Educational Process through Real Experience"}, {"paperId": "643b4e54c685fde2f1d3adb36eed77a47c0c7ef5", "title": "Data Warehousing and Mining for Climate Change: Application to the Maghreb Region"}]}
