{"paperId": "978088b8d3f3868092770a4b3bb13e13fd4fe5c6", "publicationVenue": null, "title": "RECONNOITERING SECURITY ALGORITHMS PERFORMANCE IN THE CLOUD: SYSTEMATIC LITERATURE REVIEW BASED ON THE PRISMA ARCHETYPE", "abstract": "Industries and academia have embraced cloud computing for their day-to-day activities. A lot of studies have been done to unpin variants of cryptographic algorithms used to secure the cloud. This survey aims to unravel recent studies of the most employed cryptographic scheme used to secure the cloud, the type of cryptographic algorithms used, the execution time trend of the cryptographic algorithms (Linear time / Non-Linear time), the aims of these cryptographic algorithms, and identify some of the security concerns in cloud computing. The study considered published studies from 2015 to 2022 from well-known databases such as Taylor and Francis, Scopus, Research Gate, Web of Science, IEEE Xplore, Science Direct, Hindawi, Google Scholar, and ACM. A total of 72 published articles were considered to respond to the various specific objectives using the Prisma framework. The systematic literature review has revealed the usage of encryption schemes as the most employed cryptographic approach and data security and cloud security as the most researched security challenge. The security challenges that were identified are data integrity and preservation, intrusion detection, and privacy and confidentiality. It has been revealed that from 2015 to 2022, 90% of encryption algorithms depict linear time complexity. The systematic literature review has proven little usage of symmetric stream cipher algorithms to ensure the privacy and confidentiality of cloud data.", "venue": "", "year": null, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": null, "journal": null, "authors": [{"authorId": "2261045437", "name": "John Kwao Dawson"}, {"authorId": "2261041205", "name": "DR. Twum Frimpong"}, {"authorId": "2261045564", "name": "PROF. James Benjamin"}, {"authorId": "2261046636", "name": "Hayfron Acquah"}, {"authorId": "2261040089", "name": "DR. Yaw"}, {"authorId": "2261046260", "name": "Marfo Missah"}], "citations": []}
