{"paperId": "978232700c2428fc1296c8d7246b085ef4a16188", "publicationVenue": {"id": "99db3270-3deb-4e55-91ee-b248735ea59b", "name": "Confluence", "type": "journal", "alternate_names": ["Confluence: The Journal of Graduate Liberal Studies", "International Conference - Cloud System and Big Data Engineering", "Conflu J Grad Lib Stud", "Int Conf  Cloud Syst Big Data Eng"], "issn": "1933-0057", "url": "http://www.confluence.ou.edu/"}, "title": "National Information Visualization Dashboard for Indian Regions Using ML Approach", "abstract": "National Information Visualization Dashboard for Indian Regions using ML Approach uses data analysis, visualisation, and machine learning models to forecast region wise information. All of these techniques are combined and shown on a web application. The dashboard includes carefully considered details that has been made available by trusted government websites and sources, defining the various parameters used in this paper for the various states and districts in India as well as characteristics that contribute to the current conditions of a particular area. Numerical libraries like Scikit-learn and NumPy, which are open-source modules with a variety of functions such data visualisation and analysis, are used in data analysis using Tableau. Neural networks and regression models are used to make predictions. In order to predict future unknown values, regression algorithms use a set of statistical procedures. The best model has been identified after performing a comparative analysis of the accuracies of the developed Machine Learning models like ANN, LSTM, Time Series Prediction.", "venue": "Confluence", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-01-19", "journal": {"name": "2023 13th International Conference on Cloud Computing, Data Science & Engineering (Confluence)", "pages": "93-98"}, "authors": [{"authorId": "2072060768", "name": "Shivangi S. Pathak"}, {"authorId": "2209225397", "name": "Shambhavi Lau"}, {"authorId": "2209212494", "name": "Nikita Lakhanpal"}, {"authorId": "2209219278", "name": "Rajni Sehgal Kaushik"}], "citations": []}
