{"paperId": "9798a6df61a818f84d0eb610ebb8a8e7d8a4bc6a", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Exploiting Ontology Recommendation Using Text Categorization Approach", "abstract": "Semantic Web is considered as the backbone of web 3.0 and ontologies are an integral part of the Semantic Web. Though an increase of ontologies in different domains is reported due to various benefits which include data heterogeneity, automated information analysis, and reusability, however, finding an appropriate ontology according to user requirement remains cumbersome task due to time and efforts required, context-awareness, and computational complexity. To overcome these issues, an ontology recommendation framework is proposed. The Proposed framework employs text categorization and unsupervised learning techniques. The benefits of the proposed framework are twofold: 1) ontology organization according to the opinion of domain experts and 2) ontology recommendation with respect to user requirement. Moreover, an evaluation model is also proposed to assess the effectiveness of the proposed framework in terms of ontologies organization and recommendation. The main consequences of the proposed framework are 1) ontologies of a corpus can be organized effectively, 2) no effort and time are required to select an appropriate ontology, 3) computational complexity is only limited to the use of unsupervised learning techniques, and 4) due to no requirement of context awareness, the proposed framework can be effective for any corpus or online libraries of ontologies.", "venue": "IEEE Access", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "27304-27322", "volume": "9"}, "authors": [{"authorId": "29860788", "name": "M. A. Sarwar"}, {"authorId": "50307408", "name": "Mansoor Ahmed"}, {"authorId": "3094692", "name": "Asad Habib"}, {"authorId": "153392913", "name": "Muhammad Khalid"}, {"authorId": "143859607", "name": "M. A. Ali"}, {"authorId": "2052717052", "name": "M. Raza"}, {"authorId": "2047163904", "name": "Shahid Hussain"}, {"authorId": "49095450", "name": "Ghufran Ahmed"}], "citations": [{"paperId": "053a9b25aa49902785009a9aa90af2a2958ea74f", "title": "A Personalized Ontology Recommendation System to Effectively Support Ontology Development by Reuse"}, {"paperId": "ece781f664daaa9aa52aee9a6158415e6bb14388", "title": "MR-AMFO-CNN: An intelligent recommendation system using optimized deep learning classifications"}, {"paperId": "5501ed0ce2df474b0bf57428116ffbaf5676b05a", "title": "A Review Text-based Recommendation System in Text Mining"}, {"paperId": "16822f3a1807f0cfbbff7e406f84140750d31ab0", "title": "Application Optimization of NLP System under Deep Learning Technology in Text Semantics and Text Classification"}, {"paperId": "a545cbcf1a2fb2e1cd9905e461d5c043904d38f7", "title": "Development and Evaluation of an Intelligence and Learning System in Jurisprudence Text Mining in the Field of Competition Defense"}, {"paperId": "56b50002abdc81ff1a442479403afa752f5f5704", "title": "Web Page Ranking using Web Mining Techniques: A comprehensive survey"}, {"paperId": "47d3fb8ac243480651a6b6c5d364ad66432be478", "title": "LOV-ES: Guiding the Ontology Selection to Structure Textual Data using Topic Modeling"}]}
