{"paperId": "97a00582625e4c8a8a40f2f4c19998af3f0695b1", "publicationVenue": {"id": "2216cafa-e724-48f0-a497-f46a99605f1e", "name": "Land", "type": "journal", "issn": "2073-445X", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-321184", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-321184", "https://www.mdpi.com/journal/land"]}, "title": "System Cognition and Analytic Technology of Cultivated Land Quality from a Data Perspective", "abstract": "As cultivated land quality has been paid more and more scientific attention, its connotation generalization and cognitive bias are widespread, bringing many challenges to the investigation and evaluation of regional cultivated land quality and its data analysis and mining. Establishing a systematic and interdisciplinary cognitive approach to cultivated land quality is urgent and necessary. Therefore, we explored and developed a conceptual framework of the model for the cultivated land quality analysis from the data perspective, including cultivated land quality ontology, mapping, correlation, and decision models. We identified the primary content of cultivated land quality perceptions and four cognitive mechanisms. We built vital technologies, such as the collaborative perception of the quality of cultivated land, intelligent treatment, diagnostic evaluation, and simulation prediction. Applying this analysis framework, we sorted out the frequency of indicators that characterize the function of cultivated land according to the literature in recent years and have built the cognitive system of cultivated land quality in the black soil region of Northeast China. The system’s central component was production capacity and it had three components: a foundation, a guarantee, and an effect. The black soil region cultivated land quality evaluation system has seven purposes involving 20–31 key indicators: production supply, threat control, farmland infrastructure regulation, cultivated land ecological maintenance, economics, social culture, and environmental protection. In various application contexts, the system had many critical supporting technologies. The results demonstrate that the framework has strong adaptability, efficiency, and scalability, which might offer a theoretical direction for further studies on the evaluation of the quality of cultivated land in the area. The analysis framework established in this study is helpful to deepen the understanding of cultivated land quality systems from the perspective of big data. Taking the big data of cultivated land quality as the driving force, combined with the technical methods of cultivated land quality analysis, the evaluation results of cultivated land quality under different scenarios and different objectives are optimized. In addition, the framework can serve the practice of farmland management and engineering improvement, adapt to the management needs of different objects and different scales, and achieve the combination of theory and practice.", "venue": "Land", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-01-12", "journal": {"name": "Land"}, "authors": [{"authorId": "51434333", "name": "Huaizhi Tang"}, {"authorId": "153328808", "name": "Jiacheng Niu"}, {"authorId": "2165242122", "name": "Zibing Niu"}, {"authorId": "50384171", "name": "Qi Liu"}, {"authorId": "2079368", "name": "Yuanfang Huang"}, {"authorId": "2426245", "name": "Wenju Yun"}, {"authorId": "34523645", "name": "Chongyang Shen"}, {"authorId": "2200800588", "name": "Zejun Huo"}], "citations": [{"paperId": "48db6a3feaad1e65f6099f560fed368b6a72aa71", "title": "Spatio-temporal Evaluation of Multi-scales Cultivated Land System Resilience in Black Soil Region from 2000 to 2019: A Case Study of Liaoning Province, Northeast China"}, {"paperId": "0c009c9432e35137e8658b5f68d36353c1c4a7a2", "title": "Assessment of the cultivated land quality in the black soil region of Northeast China based on the field scale"}, {"paperId": "79e99d090742fe109f111af40e56407c08b5ff37", "title": "Assessing the Influence of Water Conservancy Projects on China’s Reserve Resources for Cultivated Land"}, {"paperId": "d2ffea8e9848a075aa8789ab5a35f9e5c3691ddd", "title": "Evaluation of Spatiotemporal Changes in Cropland Quantity and Quality with Multi-Source Remote Sensing"}, {"paperId": "64f5fc1e6bea6785b5171c6c8b02a453405d9362", "title": "Can We Prevent Irreversible Decline? A Comprehensive Analysis of Natural Conditions and Quality Factor Thresholds of Cultivated Land in China"}, {"paperId": "0942d6f37d0fc102ebd2fa63f85807114a655874", "title": "Quota and Space Allocations of New Urban Land Supported by Urban Growth Simulations: A Case Study of Guangzhou City, China"}, {"paperId": "a53ce23eb05ef5485f4f9fbb6f965f004335baea", "title": "Exploring differentiated improvement strategies of cultivated land quality in China"}]}
