{"paperId": "97a10005e3ef47064657f15a42000586cdfe84e8", "publicationVenue": {"id": "87cb948e-d56a-4a64-b6ea-becc47526ec2", "name": "Behavioral Science", "alternate_names": ["Behav Sci", "Behavioral Sciences"], "issn": "0005-7940", "alternate_issns": ["2076-328X"], "url": "http://proquest.umi.com/pqdweb?RQT=318&pmid=28006", "alternate_urls": ["https://www.mdpi.com/journal/behavsci", "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217981", "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1099-1743", "http://www3.interscience.wiley.com/journal/117946258/grouphome/home.html", "https://onlinelibrary.wiley.com/journal/10991743a", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217981"]}, "title": "Predicting and Comparing Students’ Online and Offline Academic Performance Using Machine Learning Algorithms", "abstract": "Due to COVID-19, the researching of educational data and the improvement of related systems have become increasingly important in recent years. Educational institutions seek more information about their students to find ways to utilize their talents and address their weaknesses. With the emergence of e-learning, researchers and programmers aim to find ways to maintain students’ attention and improve their chances of achieving a higher grade point average (GPA) to gain admission to their desired colleges. In this paper, we predict, test, and provide reasons for declining student performance using various machine learning algorithms, including support vector machine with different kernels, decision tree, random forest, and k-nearest neighbors algorithms. Additionally, we compare two databases, one with data related to online learning and another with data on relevant offline learning properties, to compare predicted weaknesses with metrics such as F1 score and accuracy. However, before applying the algorithms, the databases need normalization to meet the prediction format. Ultimately, we find that success in school is related to habits such as sleep, study time, and screen time. More details regarding the results are provided in this paper.", "venue": "Behavioral Science", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-03-28", "journal": {"name": "Behavioral Sciences", "volume": "13"}, "authors": [{"authorId": "2212966360", "name": "Barnabás Holicza"}, {"authorId": "2117539569", "name": "A. Kiss"}], "citations": [{"paperId": "ffead43f77d2600244201dcc5fbbee87cd3a9fb1", "title": "Boltzmann stacked classification data mining model for the student performance improvement in academic performance"}, {"paperId": "64f478899e51b80c00b5b94174abb572508dc2b2", "title": "Predicting Student Grade Point Average: Comparison of Machine Learning Regression Algorithms"}, {"paperId": "393d60b347ba72d277b22e931854c3592d54f4d7", "title": "K-Fold Cross-Validation Analysis for Student Status Prediction Using Classification Models"}, {"paperId": "411aa392a5eaff95f2cacf2a697b1ecd9d546c27", "title": "Comprehensive analysis of factors influencing the real-world application of machine learning for student success rate calculation and their impacts on student achievement & educational institutions"}, {"paperId": "ffe7a6c8e69a5b5e3f89255c3b761ec1e246c764", "title": "Portrait of College Students’ Online Learning Behavior Based on Artificial Intelligence Technology"}]}
