{"paperId": "97a5caf166a8764944160beb6c86e5766881d8da", "publicationVenue": {"id": "443b907e-306a-41c3-bca4-b35f1da4bb38", "name": "International Conference on Cloud Computing Technologies and Applications", "type": "conference", "alternate_names": ["Cloudtech", "Int Conf Cloud Comput Technol Appl"]}, "title": "Big Data Architectures Benchmark for Forecasting Electricity Consumption", "abstract": "Now a day, educational institutions present one of the highest power consuming sector due to their new activities and occupancy pattern. This enormous amount of energy consumption at the university need a huge effort to reduce it. Smart grid is among the efficient solution to save energy and balance supply and demand. For the same purpose, the National School of Applied Sciences of El Jadida-Morocco wants take advantage from smart grid to maintain the balance between energy production and consumption. Despite of all added value of this smart grid solution for the school, it has the issue of managing energy production surplus, because it cannot inject it into Moroccan electrical infrastructure neither store it using storage devices. So, to overcome this challenge the system need to predict electrical consumption to be able to produce exactly the same value. Recently, Big Data contributed very well in analysing electrical consumption data using many tools and advanced techniques. It process, interprets and analyzes huge quantity of data to make it more profitable and valuable. For that reason, the school will take refuge in Big data technology to implement a custom system to predict electrical energy consumption by analyze all factors that influence electrical energy use. In this paper, we propose a benchmark of the main Big Data architectures in the field and that will cover all electrical energy data processing from data collection, data storage, data analytic and data visualization. The aim of this benchmark is to choose the optimal architecture in term of fault tolerance, resource management, data storage and data modelling to forecast electricity consumption in educational institutions.", "venue": "International Conference on Cloud Computing Technologies and Applications", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-11-24", "journal": {"name": "2020 5th International Conference on Cloud Computing and Artificial Intelligence: Technologies and Applications (CloudTech)", "pages": "1-6"}, "authors": [{"authorId": "9742942", "name": "Houda Daki"}, {"authorId": "9733933", "name": "A. Hannani"}, {"authorId": "8690491", "name": "H. Ouahmane"}], "citations": []}
