{"paperId": "97a6bb25aa2479897d8958a84f37d38701dd82b1", "publicationVenue": {"id": "2bb72c7d-9f2f-43e4-a1cd-0b54e607a52d", "name": "Policing and Society: An International Journal of Research and Policy", "type": "journal", "alternate_names": ["Policing & Society", "Polic  Soc", "Polic Soc Int J Res Policy"], "issn": "1043-9463", "url": "http://www.tandfonline.com/loi/gpas20"}, "title": "Big Data applied to criminal investigations: expectations of professionals of police cooperation in the European Union", "abstract": "ABSTRACT Big Data is seen as an increasingly important tool to support policing activities, define security governance policies and assist criminal investigations. Although significant literature has explored the predictive capabilities of Big Data, there has been less focus on the uses of Big Data in criminal investigations, focused on detection and apprehension that occur after a crime has been committed. This article aims to fill this gap through the lens of expectations of professionals involved in police cooperation in the European Union. Based upon a set of qualitative interviews, our analysis explores these professionals’ expectations for the application of Big Data techniques in criminal investigations by using DNA data held in national criminal DNA databases and, therefore, potentially increasing the interoperability between genetic and non-genetic data. Our results reveal a flexible repertoire of interpretation of the expectations for the uses of Big Data in criminal investigations and its associated potential risks and benefits. The perceived benefits relate to expectations for Big Data’s potential to advance cold cases and strengthen the interoperability of multiple datasets in ways that produce intelligence valuable for criminal investigations. Perceived risks concern the difficulties associated with investigating large sets of data, the potential for enforcing genetic discrimination, and threatening privacy and human rights.", "venue": "Policing and Society: An International Journal of Research and Policy", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-01-30", "journal": {"name": "Policing and Society", "pages": "1167 - 1179", "volume": "32"}, "authors": [{"authorId": "2151822576", "name": "Laura Neiva"}, {"authorId": "49984118", "name": "Rafaela Granja"}, {"authorId": "144809236", "name": "H. Machado"}], "citations": [{"paperId": "ccb0def1d3488a48156f4bdbd9ee37ba68fa81f1", "title": "Big Data technologies in criminal investigations: The frames of the members of Judiciary Police in Portugal"}, {"paperId": "134f85204a10c6cc7118be5cc54d1682d4e79e67", "title": "The views about Big Data among professionals of police forces: A scoping review of empirical studies"}]}
