{"paperId": "97b2a4430df3b9fe6b16000897348ebf1994bcae", "publicationVenue": null, "title": "The Impact of Digital Transformation on Business Models and Competitive Advantage", "abstract": "Digital transformation has become a dominant trend in the business world in recent years. The rapid development of information and communication technology has enabled organisations to change the way they operate, interact with customers, and compete in the market. This research aims to analyse the impact of digital transformation on business models and competitive advantage. This research is a literature review that uses a qualitative approach, which implies that data will be analysed and interpreted using information and text obtained from various sources. The study results show that in the ongoing era of digital transformation, its impact on business models and competitive advantage is an aspect that cannot be ignored. This digital transformation has changed the fundamentals of how organisations operate and interact with customers, and how they can win the competition in an increasingly fierce market. Digital transformation has brought about a significant business paradigm shift. Today, more organisations are integrating digital technology as an integral part of their business model. It is no longer an option, but a necessity to maintain relevance and competitiveness in the market.", "venue": "Technology and Society Perspectives (TACIT)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-10-03", "journal": {"name": "Technology and Society Perspectives (TACIT)"}, "authors": [{"authorId": "2253805146", "name": "Kresnawidiansyah Agustian"}, {"authorId": "123612107", "name": "E. S. Mubarok"}, {"authorId": "2164528858", "name": "Agustian Zen"}, {"authorId": "2089923784", "name": "Wiwin Wiwin"}, {"authorId": "2164458512", "name": "Aulia Januar Malik"}], "citations": [{"paperId": "4295fefe1d2b248eba43101898e0fed7ad52e489", "title": "The impact of adopting the digital strategy on the competitive advantage: A moderating role of employee satisfaction in the Jordanian banking sector"}, {"paperId": "8ee3284c9bfd94727a99764b3dce039c81049a15", "title": "Implications of Technological Evolution on Human Resource Management Strategies and Legal Compliance"}, {"paperId": "bd9830c936e347a18dd78417316197007953e78d", "title": "Strategic Engineering of Human Resources Development (HRD) to Respond to the Digital Transformation Era in the Context of Business Information Systems"}, {"paperId": "d9c40ef7379b4c106cdf87a2e2fba43ac2573dc6", "title": "The Role of Digital Marketing in Enhancing the Attractiveness of Tourism Destinations on New Year's Eve"}, {"paperId": "8adc1a4602bb57724595542e57ff09edfd9d1707", "title": "Performance Optimisation through Education and Knowledge Management Synergy: An Innovative Business Organisation Strategy"}, {"paperId": "80a5bbac3f626a445257337bf752b2bb0352fc3c", "title": "Analysing the Role of Visual Content in Increasing Attraction and Conversion in MSME Digital Marketing"}, {"paperId": "32df58a0350a4476fddbfb804b4ea371aab07902", "title": "Sustainable Digital Marketing Strategy for Long-Term Growth of MSMEs"}, {"paperId": "f588e4ae775d2b276628d3a90d41e623e28581f7", "title": "Product and Service Innovation Strategies to Expand MSME Markets"}, {"paperId": "22cfca56c45769c0410b4a7b39d81f1a9ae1c039", "title": "The Importance of Creativity in Human Resource Management to Achieve Effective Administration"}, {"paperId": "d0b98fcdce18ae481bbc9a0a1dcb5a8bca45887b", "title": "Human Resource Development Strategies to Achieve Digital Transformation in Businesses"}]}
