{"paperId": "97be5a1373e89f29609e792e9dec1ac493a86cef", "publicationVenue": {"id": "aa746a02-d187-42c2-bdf9-df6a5d4e648c", "name": "Computer/law journal", "type": "journal", "alternate_names": ["Computer journal", "The Computer Journal", "Comput j", "Comput J"], "issn": "0164-8756", "alternate_issns": ["0010-4620"], "url": "https://repository.jmls.edu/jitpl/all_issues.html", "alternate_urls": ["http://comjnl.oxfordjournals.org/"]}, "title": "Toward a Novel RESTFUL Big Data-Based Urban Traffic Incident Data Web Service for Connected Vehicles", "abstract": "\n Connected vehicles (CVs) are an emerging technology in intelligent transportation systems. Currently, many data-driven intelligent transportation systems (D2ITS) use CV data. Unfortunately, these D2ITS still need serious improvement before they meet higher-level visualization needs. Thus, we aim to develop a new, intelligent data-driven transportation system framework. We focus on visualizing real-time CV data using a big data analytic system in urban areas. In response, we first propose an effective real-time data distribution approach within the Vehicular Ad-hoc NETwork. Second, we develop novel strategies for aggregating, extracting and ingesting data. We provide scalable and fault-tolerant delivery methods without interruption or delay. Finally, we proposed a novel visualization REpresentational State Transfer (REST) web service. We used Simulation of Urban MObility, OMNET++ and Veins to simulate a traffic incident dataset. Then, we tested the Basic Safety Messages in an experimental big data cluster. We used NIFI, Kafka and Cassandra for ingestion, distribution, delivery and storage. The results show accurate performance for packet loss, packet delivery and communication delay. Also, it indicates high throughput and low latency for distributed data delivery systems. Additionally, we obtained the smallest response time for the RESTFUL visualization web service.", "venue": "Computer/law journal", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-02-24", "journal": {"name": "Comput. J.", "pages": "557-580", "volume": "67"}, "authors": [{"authorId": "2289953359", "name": "Hireche Samia"}, {"authorId": "1729539190", "name": "Dennai Abdeslem"}, {"authorId": "46739682", "name": "B. Kadri"}], "citations": [{"paperId": "e6593d5b410ffd7511a5ad442e8c73de9b09cdc6", "title": "Investigation of Data Quality Assurance across IoT Protocol Stack for V2I Interactions"}, {"paperId": "b819cb63bb6e7a4338aa974ceae3fac2260b28ca", "title": "A Novel Authentication and Communication Protocol for Urban Traffic Monitoring in VANETs Based on Cluster Management"}]}
