{"paperId": "97bf84ae70066516f0d09475b53df042dc2d7543", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Antecedents of Big Data Analytic Adoption and Impacts on Performance: Contingent Effect", "abstract": "The adoption of big data analytics (BDA) is increasing pace both in practice and in theory, owing to the prospects and its potential advantages. Numerous researchers believe that BDA could provide significant advantages, despite constant battles with the constraints that limit its implementation. Here, we suggest an incorporated model to investigate the drivers and impacts of BDA adoption in the Jordanian hotel industry based on the technology–organisation–environment framework and the resource-based view theory. The suggested model incorporates both the adoption and performance components of BDA into a single model. For data collection, in this study, we used an online questionnaire survey. The research model was verified based on responses from 119 Jordanian hotels. This study yielded two significant findings. First, we discovered that relative advantage, organizational readiness, top management support, and government regulations have a major impact on BDA adoption. The study results also reveal a strong and favourable association between BDA adoption and firm performance. Finally, information sharing was found to have a moderating effect on the association between BDA adoption and firm performance. The data revealed how businesses might increase their BDA adoption for improved firm performance. The present study adds to the limited but growing body of literature investigating the drivers and consequences of technology acceptance. The findings of this study can serve as a resource for scholars and practitioners interested in big data adoption in emerging nations.", "venue": "Sustainability", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-11-22", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "1885047399", "name": "Abdalwali Lutfi"}, {"authorId": "1402847932", "name": "Akif Al-Khasawneh"}, {"authorId": "3251080", "name": "Mohammed Amin Almaiah"}, {"authorId": "1413130835", "name": "A. Alshira’h"}, {"authorId": "1395241743", "name": "M. Alshirah"}, {"authorId": "50858498", "name": "Adi Alsyouf"}, {"authorId": "2153883249", "name": "Mahmaod Alrawad"}, {"authorId": "1405599940", "name": "Ahmad Al-Khasawneh"}, {"authorId": "1380923842", "name": "M. Saad"}, {"authorId": "2157144508", "name": "R. A. Ali"}], "citations": [{"paperId": "8f9e5696935ce687e63e00d226af6e15d1a6b955", "title": "Forensic accounting, socio-economic factors and value added tax evasion in emerging economies: evidence from Jordan"}, {"paperId": "98a25baff33361f46c4c8e120cc56abb2d991c74", "title": "Improving Environmental Performance Through Innovative Academic Citizenship Behaviour: Green Training And Development, Green Recruitment And Selection As Antecedents In Jordanian Government University"}, {"paperId": "827aa4f53afab4aa7fbb3aebdb80735f0e35068f", "title": "Analyzing the role of big data and its effects on the retail industry"}, {"paperId": "a203051739dac53cc6827c6b4a11bcca5437acce", "title": "Exploring the role of workforce agility on digital transformation: a systematic literature review"}, {"paperId": "90aa26c63347c5c95fb8e2b4ee430b01c30c962c", "title": "The impact of empowering internal auditors on the quality of electronic internal audits: A case of Jordanian listed services companies"}, {"paperId": "d558b82b557192a3f8c756d13555d7fdc5ade9d1", "title": "The Impact of Developments in the Modern Business Environment on the Methods of Managerial Accounting"}, {"paperId": "2ddf11a5c59442e90309f0092ca94a6e04c0ae73", "title": "Examining the critical factors of internal audit effectiveness from internal auditors’ perspective: Moderating role of extrinsic rewards"}, {"paperId": "1525e86cafc2bee8c25f537edf6f67339e8ffe9f", "title": "The influence of artificial intelligence on the AISs efficiency: Moderating effect of the cyber security"}, {"paperId": "5c00800283bf1aea31e2106e490249ca127c6b02", "title": "Antecedents of big data analytics (BDA) adoption in private firms: a sequential explanatory approach"}, {"paperId": "b35cc70210b087737ad223f8ec64e9fedb1cbfd2", "title": "How can value added tax compliance be incentivized? An experimental examination of trust in government and tax compliance costs"}, {"paperId": "e8af4ce282dca0312f8302a847402b1992a25ba6", "title": "The Moderation of Organizational Readiness on the Relationship Between Toe Factors and Fintech Adoption and Financial Performance"}, {"paperId": "7ddd821ee5dcd47c03979f8ccccba71a40ce42e6", "title": "Green Environmental Management System to Support Environmental Performance: What Factors Influence SMEs to Adopt Green Innovations?"}, {"paperId": "f24b1e86797c8cdede332c1e68a2e56ba0fffad3", "title": "Enhancing VAT Compliance in the Retail Industry: The Role of Socio-Economic Determinants and Tax Knowledge Moderation"}, {"paperId": "12055baadcee770252ea76e2237c40c95376a7a2", "title": "Determining the Factors Influencing Business Analytics Adoption at Organizational Level: A Systematic Literature Review"}, {"paperId": "e25fe3f1d9ed7c806dfc419ced5c19b485bd650b", "title": "Harnessing Big Data Analytics to Accelerate Innovation: An Empirical Study on Sport-Based Entrepreneurs"}, {"paperId": "4d1542797e573de43a187c6ec52eaf97df55c9d0", "title": "A Novel Framework of Public Risk Assessment Using an Integrated Approach Based on AHP and Psychometric Paradigm"}, {"paperId": "496201e6b8f075a9e184de7d0c561baf1e19f9bb", "title": "Investigating the Role of Perceived Risk, Perceived Security and Perceived Trust on Smart m-Banking Application Using SEM"}, {"paperId": "47460b90b6ef8d6d99187c0e8bbf4153946646c2", "title": "A Study on the Impact of Big Data Management on Business Agility—The Moderating Role of Corporate Strategy and Environmental Uncertainty"}, {"paperId": "3f626c209ba83db284acb2eaab057a35f1745843", "title": "The influence of accounting information system adoption on business performance amid COVID-19"}, {"paperId": "bb4d26de3bc5db891b4c146c3c487a2ed59aa88f", "title": "The Use of a Technology Acceptance Model (TAM) to Predict Patients’ Usage of a Personal Health Record System: The Role of Security, Privacy, and Usability"}, {"paperId": "398be2549736232c269d5def3f42edd9356312a3", "title": "The Role of E-Accounting Adoption on Business Performance: The Moderating Role of COVID-19"}, {"paperId": "720b33c50ce5e015b3edec57856403bcfe7d566c", "title": "Assessing the Intention to Adopt Cloud Accounting during COVID-19"}, {"paperId": "ccab6699fdf7cb775213c0c022c5244dab1c8e3c", "title": "Enhancing cyber governance in Islamic banks: The influence of artificial intelligence and the moderating effect of Covid-19 pandemic"}, {"paperId": "ac9f6df1ace0a4a621f53d79d3f27226822b2394", "title": "Navigating digital transformation in accounting system: Challenges and opportunities"}, {"paperId": "6ceb59f87270ed11de9527f585a4d69fbad33415", "title": "The effect of strategic orientation on operational performance: The mediating role of operational sustainability"}, {"paperId": "ed76dac2c61b3002273cccc6d43c7a1296ffe16a", "title": "Antecedents of Business Analytics Adoption and Impacts on Banks’ Performance: The Perspective of the TOE Framework and Resource-Based View"}, {"paperId": "b7fa3067985775797943bdcd99bfc4929456374f", "title": "THE EFFECT OF STRATEGIC ORIENTATION ON OPERATIONAL PERFORMANCE: THE MEDIATING ROLE OF OPERATIONAL SUSTAINABILITY"}]}
