{"paperId": "97c4b190949e3cf0273a6f2433e5e4f130507b77", "publicationVenue": {"id": "a03dd819-cbf4-4e9e-9fb7-2435d554824a", "name": "IEEE International Workshop on Computer Aided Modeling and Design of Communication Links and Networks", "type": "conference", "alternate_names": ["Comput Aided Model Des Commun Links Netw", "CAMAD", "IEEE Int Workshop Comput Aided Model Des Commun Links Netw", "Computer Aided Modeling and Design of Communication Links and Networks"], "url": "http://www.wikicfp.com/cfp/program?id=352"}, "title": "Edge AI Inference in Heterogeneous Constrained Computing: Feasibility and Opportunities", "abstract": "The network edge’s role in Artificial Intelligence (AI) inference processing is rapidly expanding, driven by a plethora of applications seeking computational advantages. These applications strive for data-driven efficiency, leveraging robust AI capabilities and prioritizing real-time responsiveness. However, as demand grows, so does system complexity. The proliferation of AI inference accelerators showcases innovation but also underscores challenges, particularly the varied software and hardware configurations of these devices. This diversity, while advantageous for certain tasks, introduces hurdles in device integration and coordination. In this paper, our objectives are three-fold. Firstly, we outline the requirements and components of a framework that accommodates hardware diversity. Next, we assess the impact of device heterogeneity on AI inference performance, identifying strategies to optimize outcomes without compromising service quality. Lastly, we shed light on the prevailing challenges and opportunities in this domain, offering insights for both the research community and industry stakeholders.", "venue": "IEEE International Workshop on Computer Aided Modeling and Design of Communication Links and Networks", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-10-27", "journal": {"name": "2023 IEEE 28th International Workshop on Computer Aided Modeling and Design of Communication Links and Networks (CAMAD)", "pages": "225-232"}, "authors": [{"authorId": "2237987309", "name": "Roberto Morabito"}, {"authorId": "2265578185", "name": "Mallik Tatipamula"}, {"authorId": "1759241", "name": "Sasu Tarkoma"}, {"authorId": "2265579214", "name": "Mung Chiang"}], "citations": []}
