{"paperId": "97cdc47c635aecdc63cbbf66fc59513182be4e25", "publicationVenue": null, "title": "Multi-Model Security and Social Media Analytics of the Digital Twin", "abstract": "Article history: Received: 28 August, 2020 Accepted: 28 October, 2020 Online: 10 November, 2020 Digital twins act through application programming interfaces to their physical counterparts to monitor, model, and control them. Beyond these traditional functions of digital twins, they must also act to secure their physical counterparts. A multi-model scheme is presented to help digital twins towards the task of securing the physical system. Additionally, this work includes an analysis of more than four hundred thousand tweets each relating to digital twin technology and cybersecurity which were collected during June and July in 2020. Of the first corpus of tweets collected by searching for #digitaltwin during the research period, only a small population of 10% reference security concepts. In the second and larger corpus of collected tweets, the top mentioned industries were health, education, and public. A naïve Bayes model reached a 70.3% accuracy at differentiating tweets that were either related to cybersecurity or the internet of things. The study also indicates that cybersecurity tweets are consistently more negative in many areas of sentiment when compared to tweets about the internet of things. The sentiment findings of cybersecurity tweets will reinforce the need to address culture in cybersecurity posture while the security multi-model schema contributes to the state of the art.", "venue": "", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": null, "journal": {"name": "Advances in Science, Technology and Engineering Systems Journal", "pages": "323-330", "volume": "5"}, "authors": [{"authorId": "1392689860", "name": "Jim A. Scheibmeir"}, {"authorId": "2923336", "name": "Y. Malaiya"}], "citations": [{"paperId": "fd2756a41953d73882af70e8522fa42527b9a78f", "title": "Social media analytics of the Internet of Things"}, {"paperId": "c09963b243cc76ee5612919b84e4a27ed01e0a17", "title": "Social Media Perspectives on Digital Twins and the Digital Twins Maturity Model"}]}
