{"paperId": "97d57115dc3eb8554bd20acbddd0842b27ffb629", "publicationVenue": {"id": "8270cfe1-3713-4325-a7bd-c6a87eed889e", "name": "Entropy", "type": "journal", "issn": "1099-4300", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-155606", "alternate_urls": ["http://www.mdpi.com/journal/entropy/", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-155606", "https://www.mdpi.com/journal/entropy"]}, "title": "Divergence-Based Locally Weighted Ensemble Clustering with Dictionary Learning and L2,1-Norm", "abstract": "Accurate clustering is a challenging task with unlabeled data. Ensemble clustering aims to combine sets of base clusterings to obtain a better and more stable clustering and has shown its ability to improve clustering accuracy. Dense representation ensemble clustering (DREC) and entropy-based locally weighted ensemble clustering (ELWEC) are two typical methods for ensemble clustering. However, DREC treats each microcluster equally and hence, ignores the differences between each microcluster, while ELWEC conducts clustering on clusters rather than microclusters and ignores the sample–cluster relationship. To address these issues, a divergence-based locally weighted ensemble clustering with dictionary learning (DLWECDL) is proposed in this paper. Specifically, the DLWECDL consists of four phases. First, the clusters from the base clustering are used to generate microclusters. Second, a Kullback–Leibler divergence-based ensemble-driven cluster index is used to measure the weight of each microcluster. With these weights, an ensemble clustering algorithm with dictionary learning and the L2,1-norm is employed in the third phase. Meanwhile, the objective function is resolved by optimizing four subproblems and a similarity matrix is learned. Finally, a normalized cut (Ncut) is used to partition the similarity matrix and the ensemble clustering results are obtained. In this study, the proposed DLWECDL was validated on 20 widely used datasets and compared to some other state-of-the-art ensemble clustering methods. The experimental results demonstrated that the proposed DLWECDL is a very promising method for ensemble clustering.", "venue": "Entropy", "year": 2022, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-09-21", "journal": {"name": "Entropy", "volume": "24"}, "authors": [{"authorId": "2139101108", "name": "Jiaxuan Xu"}, {"authorId": "2115690980", "name": "Jiang Wu"}, {"authorId": "2775350", "name": "Taiyong Li"}, {"authorId": "2185872675", "name": "Yang Nan"}], "citations": [{"paperId": "66acc67eb38cfd0d89d9e4048bccdd31d3e14ab4", "title": "Recent Advances in Statistical Theory and Applications"}, {"paperId": "e2ce13534785a4dc737be620db42812787848996", "title": "Ensemble clustering with low-rank optimal Laplacian matrix learning"}, {"paperId": "db7e73fda57b6ddd402760989cc6a71a24dda69b", "title": "Ensemble clustering via fusing global and local structure information"}, {"paperId": "b8d047c7b56143cfd4416f9241cda5e3a8778f32", "title": "Fuzzy Divergence Weighted Ensemble Clustering With Spectral Learning Based on Random Projections for Big Data"}]}
