{"paperId": "97dcd6b1966735bf8371ef5e7f8852b7c8746e7a", "publicationVenue": {"id": "890beb40-ba59-4681-9bb6-88ed97b7decb", "name": "Journal of Theoretical and Applied Electronic Commerce Research", "type": "journal", "alternate_names": ["J Theor Appl Electron Commer Res"], "issn": "0718-1876", "url": "http://www.scielo.cl/scielo.php?lng=en&pid=0718-1876&script=sci_serial", "alternate_urls": ["http://www.jtaer.com/"]}, "title": "Internet of Things (IoT) Technology Research in Business and Management Literature: Results from a Co-Citation Analysis", "abstract": "In coherence with the progressive digitalization of all areas of life, the Internet of Things (IoT) is a flourishing concept in both research and practice. Due to the increasing scholarly attention, the literature landscape has become scattered and fragmented. With a focus on the commercial application of the IoT and corresponding research, we employ a co-citation analysis and literature review to structure the field. We find and describe 19 research themes. To consolidate the extant research, we propose a research framework, which is based on a theoretical implementation process of IoT as a concept, specific IoT applications, or architectures integrated in an adapted input–process–output model. The main variables of the model are an initial definition and conceptualization of an IoT concept (input), which goes through an evaluation process (process), before it is implemented and can have an impact in practice (output). The paper contributes to interdisciplinary research relating to a business and management perspective on IoT by providing a holistic overview of predominant research themes and an integrative research framework.", "venue": "Journal of Theoretical and Applied Electronic Commerce Research", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-08-17", "journal": {"name": "J. Theor. Appl. Electron. Commer. Res.", "pages": "2073-2090", "volume": "16"}, "authors": [{"authorId": "2132363425", "name": "Andreas Korte"}, {"authorId": "103017633", "name": "V. Tiberius"}, {"authorId": "40653746", "name": "A. Brem"}], "citations": [{"paperId": "74fed33b73c812d3ea0dd86a128675badb3d55cf", "title": "The Future of Electronic Commerce in the IoT Environment"}, {"paperId": "31107fb74c4b4f182d761e3d775ca3ff16d233d5", "title": "Factors influencing the adoption of industrial internet of things for the manufacturing and production small and medium enterprises in developing countries"}, {"paperId": "12093402d7108dcbe47bba1e3a7e20011b75b5e5", "title": "Comprehensive Evaluation Model for Competitiveness of Mass Media Companies in the IoT Sensor Networks"}, {"paperId": "987620bfb8e91405a414eac790a9a4bc39dd6ef9", "title": "Business and Management Research on the Motion Picture Industry: A Bibliometric Analysis"}, {"paperId": "b0f87b87f99f08912ee6dcc578644f82baba53f0", "title": "Worldwide research productivity on transformational learning: a scientometric study"}, {"paperId": "727fd8a225ed6e869d9e8d464ff4449f18379fb6", "title": "Trends, Influential Authors and Emerging Themes in Intelligent Personal Assistants: A Bibliometric Analysis"}, {"paperId": "870098a8b2e624a1071c211afb26956670b31396", "title": "Consumer Acceptance of Fintech App Payment Services: A Systematic Literature Review and Future Research Agenda"}, {"paperId": "8baf091097e90426e061d4e2b31c77343f4d68d6", "title": "The Power of Internet of Things (IoT): Connecting the Dots with Cloud, Edge, and Fog Computing"}, {"paperId": "eb04c862f6f3dfbf3e3b286f481ec2cf3d0015c2", "title": "Wisdom Management: A Semantic Analysis"}, {"paperId": "b76ec9ec8fb6998c8be75b5f3521faf5d7120604", "title": "From Knowledge to Wisdom: Looking beyond the Knowledge Hierarchy"}, {"paperId": "fa59d8d416d8aa7b12e31f2a1d373b1f1654ef4a", "title": "The role of digitalization in business and management: a systematic literature review"}, {"paperId": "f6698fcc6541c9c2fcff608c97ebe7e58d8af4ce", "title": "Bibliometric Analysis of Corporate Social Responsibility in Tourism"}, {"paperId": "51f32ec4113328c728c09fe8cc84563f0f29800d", "title": "Operational strategies for IoT-enabled Brick-and-Mortar retailers in a competitive market"}, {"paperId": "5c2322acf95fcbe072dd45a21ec51512077987a7", "title": "CLUSTER ANALYSIS OF RISKS AND VULNERABILITIES FOR ENVIRONMENT SUSTAINABLE MANAGEMENT"}, {"paperId": "e1bbb7dfa1cf699673a1e372db0b444c4a1a1d12", "title": "Tackling uncertain future scenarios with real options: A review and research framework"}, {"paperId": "ad000d79e0e18b4b1623d3fef4739eb5b5390286", "title": "Adopting wearables to customize health insurance contributions: a ranking-type Delphi"}, {"paperId": "9bc0cd94f32ead96e1cb0978e8186708aba1be1e", "title": "Digital Transformation Strategies Enabled by Internet of Things and Big Data Analytics: The Use-Case of Telecommunication Companies in Greece"}, {"paperId": "ef968aae9d3bc6adff569af0ea667548f27b8b8c", "title": "It takes two to tango: technological and non-technological factors of Industry 4.0 implementation in manufacturing firms"}, {"paperId": "383e796e7505dfa49bd309a7ce93d6d5335401b7", "title": "An Approach to Assessing Shopper Acceptance of Beacon Triggered Promotions in Smart Retail"}, {"paperId": "c2e7867d7bf448132c0b4c522ab5e64fff1bf359", "title": "Analysis and Estimation of Economic Influence of IoT and Telecommunication in Regional Media Based on Evolution and Electronic Markets in Romania"}, {"paperId": "54aafb89c2ee0f88232558a45db3940743068bc5", "title": "The Impact of Internet of Things in Manufacturing Management"}, {"paperId": "5bc329647fe4bd51e15923ac3eb9794adc68fcb3", "title": "Big data analytics in smart cities’ transportation infrastructure modernization"}]}
