{"paperId": "97f1cb6371a7bcab5346a882b6bce68391eae544", "publicationVenue": null, "title": "Broadband Wireless Networking in the Era of Big Data", "abstract": "Organizations accumulate huge amounts of data from various systems but more often than not the data is stored but not organized or analyzed by the organizations. When certain characteristics define this data such as volume refers to a large quantity of data received and stored; velocity refers to a high speed of receiving data from different data streams; variety involves the ever-changing data formats from new services, and new data types that are being captured; and finally that this data is valuable. Any data characterized by the aforementioned characteristics is articulated as big data and the systems managing such data is referred to as Big Data Systems (BDSs). Mobile service providers (MSPs) in their efforts to provide more efficient heterogeneous networks (HetNets) deal daily with data characterized by the same features. The successful implementation of a BDS involves having the required infrastructure in place to process the data. There are three key areas involved with a big data infrastructure which includes data acquisition, data organization, and data analysis. Since big data involves higher velocity, volume, and variety an organization must have the ability to capture this data. MSPs need to employ a system to actually extract and analyze network utilization big data to determine if it brings value to them and their customers. This work discusses the design, implementation and utilization aspects of a Hadoop system that can help MSPs to delve deep into their big data stores to analyze the potential of adding value to the organization. A Hadoop system would allow an entity to organize and process their big data. A system architecture for the BDS supporting the HetNet operations will be proposed together with the recommendations of an analytics framework. The BDS architecture together with the analytics framework aims at helping the MSPs in forecasting the network traffic. The results of the traffic big data analytics and the network load forecasting can be used to adjust different network operating parameters. These adjustments can definitely enhance the HetNet performance. The proposed big data architecture and the analytics framework proposed in this study will be used as a decision support system component in an educational and research pilot project that aims at introducing the role of big data analytics in guiding the self-healing process used in cellular self-organized networks.", "venue": "", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2016-06-26", "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "47171227", "name": "Tamer R. Omar"}, {"authorId": "73638269", "name": "S. A. Hardy"}], "citations": [{"paperId": "6a1ef5fd081073941edba4d7c8402f69f8df65ab", "title": "Implementation of Big Data Lab for Broadband Wireless Networks Intelligent Traffic Management System: Evaluation and Challenges"}, {"paperId": "9ed38e0813867bcba15e55e45bfad07019d36e92", "title": "Interpolation based pilot-aided channel estimation for STBC spatial modulation and performance analysis under imperfect CSI"}]}
