{"paperId": "981710b92e09af639d26eef7297afde1dd434d23", "publicationVenue": {"id": "657a4bec-9a11-40fb-acfe-243d7fb993ae", "name": "Frontiers in Earth Science", "type": "journal", "alternate_names": ["Frontiers of Earth Science", "Frontiers in Earth Sciences", "Front Earth Sci"], "issn": "2296-6463", "alternate_issns": ["1863-4621", "2095-0195"], "url": "http://www.frontiersin.org/Earth_Science", "alternate_urls": ["http://journal.hep.com.cn/fesci/EN/2095-0195/current.shtml", "http://www.frontiersin.org/Journal/Archive.aspx?artId=0&f=19&name=Earth_Science", "https://www.frontiersin.org/journals/earth-science", "https://www.springer.com/series/7066"]}, "title": "Seismic response of a mid-story-isolated structure considering soil–Structure interaction in sloping ground under three-dimensional earthquakes", "abstract": "A mid-story-isolated structure is developed from a base-isolated structure. Mid-story-isolated structures located in sloping ground have become a research hotspot in recent years. It is important to consider the soil–structure interaction (SSI) effects and multi-dimensional earthquakes on these structures. This paper established a model of the mid-story-isolated structure considering SSI in sloping ground. An elastic–plastic time history analysis was carried out under the one-dimensional (1D), two-dimensional (2D), and three-dimensional (3D) earthquakes. Under 3D earthquakes, the traditional 2D isolated bearing has limited damping capacity. Therefore, two kinds of 3D isolated bearings were designed. Results show that the seismic response of the mid-story-isolated structure considering SSI in sloping ground can be amplified compared with that of the mid-story-isolated structure without considering SSI. The seismic response of the structure under 3D earthquakes is more significant than that under 2D earthquakes and 1D earthquakes. For the two kinds of 3D isolated bearings, the minimum reduction rate of tensile and compressive stress is about 46% compared with that of the traditional 2D isolated bearings. When the 3D isolated bearings are used, the stress of the soil foundation decreases, which is more conducive to the stability of the soil foundation.", "venue": "Frontiers in Earth Science", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-01-05", "journal": {"volume": "10"}, "authors": [{"authorId": "2164452463", "name": "Feng Wan"}, {"authorId": "2133092486", "name": "Cheng Li"}, {"authorId": "1897190", "name": "Haiyang Li"}, {"authorId": "2112390505", "name": "De-wen Liu"}, {"authorId": "108327025", "name": "Shunzhong Yao"}, {"authorId": "2005941518", "name": "Min Lei"}], "citations": [{"paperId": "593cd3562261b94e1095a4d6fc2ace421c88a5d2", "title": "Key technologies research on of soil-structure interaction base story isolated structure response in 3D seismic zone"}]}
