{"paperId": "981e6625d11ce14e0a8ef0455592f90b0082604d", "publicationVenue": {"id": "228761ec-c40a-479b-8309-9dcbe9851bcd", "name": "IEEE Internet of Things Journal", "type": "journal", "alternate_names": ["IEEE Internet Thing J"], "issn": "2327-4662", "url": "https://www.ieee.org/membership-catalog/productdetail/showProductDetailPage.html?product=PER288-ELE", "alternate_urls": ["https://ieeexplore.ieee.org/servlet/opac?punumber=6488907", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6488907", "http://ieee-iotj.org/#"]}, "title": "Towards a Practical Crowdsensing System for Road Surface Conditions Monitoring", "abstract": "The Internet of Things (IoT) infrastructure, systems, and applications demonstrate potential in serving smart city development. Crowdsensing approaches for road surface conditions monitoring can benefit smart city road information services. Deteriorated roads induce vehicle damage, traffic congestion, and driver discomfort which influence traffic management. In this paper, we propose a framework for monitoring road surface anomalies. We analyze the common road surface types and irregularities as well as their impact on vehicle motion. In addition to the traditional use of sensors available in smart devices, we utilize the vehicle motion sensors (accelerometers and gyroscopes) presently available in most land vehicles. Various land vehicles were used in this paper, spanning different sizes, and year model for extensive road experiments. These trajectories were used to collect and build multiple labeled data sets that were used in the system structure. In order to enhance the performance of the sensor measurements, wavelet packet de-noising is used in this paper to enable efficient classification of road surface anomalies. We adopt statistical, time domain, and frequency domain features to distinguish different road anomalies. The descriptive data sets collected in this paper are used to build, train, and test a system classifier through machine learning techniques to detect and categorize multiple road anomalies with different severity levels. Furthermore, we analyze and assess the capabilities of the smart devices and the other vehicle motion sensors to accurately geo-reference the road surface anomalies. Several road test experiments examine the benefits and assess the performance of the proposed architecture.", "venue": "IEEE Internet of Things Journal", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-02-19", "journal": {"name": "IEEE Internet of Things Journal", "pages": "4672-4685", "volume": "5"}, "authors": [{"authorId": "1403864503", "name": "Amr S. El-Wakeel"}, {"authorId": "2118399384", "name": "Jin Li"}, {"authorId": "153052913", "name": "A. Noureldin"}, {"authorId": "35725657", "name": "H. Hassanein"}, {"authorId": "144533481", "name": "N. Zorba"}], "citations": [{"paperId": "dd24a5d86f374c6c195c52b0cb4dd77cd5e9b426", "title": "Unsupervised constrained discord detection in IoT-based online crane monitoring"}, {"paperId": "9abde84ef9a66eb67f42d883fd0c93788e612d0a", "title": "Trusted Location Sharing on Enhanced Privacy-Protection IoT Without Trusted Center"}, {"paperId": "6c5d5c187c9a4a76b87e4553d25697c5196b7c59", "title": "RRFL: A rational and reliable federated learning incentive framework for mobile crowdsensing"}, {"paperId": "e422bd6c7943092e7b12dbd77ee4ca832052350e", "title": "Vision Based Open Manhole Detection for Viually Impaired Person"}, {"paperId": "4bbeae251e64b5ea43f0a0d2afaac0d9a7485a4d", "title": "GMP: Goal-Based Multimodal Motion Prediction for Automated Vehicles"}, {"paperId": "9a8819369283adcb40280dda3528ba0ff39d6247", "title": "Dual Stream Meta Learning for Road Surface Classification and Riding Event Detection on Shared Bikes"}, {"paperId": "3d7fad175cafefcbb3f355d17e28c46d7540bd11", "title": "Road Surface Monitoring System Using Semi-Supervised Machine Learning Ensemble Models"}, {"paperId": "b64e1dcb88968a38e10f39c9520705de1526d264", "title": "Road Surface Monitoring System Through Machine Learning Ensemble Models"}, {"paperId": "31a1443c8a4f36eebbfb47627e1c66854b1a72fd", "title": "Design Challenges for the Implementation of Smart Homes"}, {"paperId": "9bcef3f8b2d19081e49251091738f90d1c9f98ef", "title": "A review on the impacts of connected vehicles on pavement management systems"}, {"paperId": "ac7bace3dbbb74c5afdb42c0d38a6546db816a1b", "title": "CrowdFL: Privacy-Preserving Mobile Crowdsensing System Via Federated Learning"}, {"paperId": "9ad0a0fa5c792b88b3bfe8a2ea782626518cc0b7", "title": "A comprehensive survey on mobile crowdsensing systems"}, {"paperId": "78f31caa1d6f228740ec40f43491dc79dfbb04cd", "title": "Road Crack and Road Quality Checking Mechanism"}, {"paperId": "2a44d566786b0c1e962a4cdc33a960ef4671c646", "title": "Personalized Location Privacy Trading in Double Auction for Mobile Crowdsensing"}, {"paperId": "8c11752fd8f3d750e6c08e743bf6a244ef5d08cc", "title": "Deep learning based speed bumps detection and characterization using smartphone sensors"}, {"paperId": "3c73b81e01418877ff8b143fafc1beb131bcff5a", "title": "Sustainable Road Pothole Detection: A Crowdsourcing Based Multi-Sensors Fusion Approach"}, {"paperId": "f53221e090126ffc85f1e75c7647706d122cab25", "title": "CMNN-RADC: A Crowdsensing Convolutional-based Mixer Neural Network Road Anomalies Detector and Classifier"}, {"paperId": "072f94e92b7e29196966ab7b7649d5890bcae780", "title": "PAMDI: Privacy aware missing data inference scheme for sparse mobile crowd sensing"}, {"paperId": "8f00e5ffbd57f83407afb3766247dbc4ec5f49b6", "title": "Dimensionality-reducing classifiers for Spanish winter maintenance of roadways"}, {"paperId": "1031fdd67f3753f5657d670344307f973b1d7507", "title": "Towards the Implementation of Smart Homes"}, {"paperId": "c50f58b3b6f786e3643ebff4a6bbbc6597cb9b40", "title": "Detecting sources of ride roughness by ensemble-connected vehicle signals"}, {"paperId": "29d3c9c4e1aa2f80ee2517e2a98bcaa9ba0f54a9", "title": "DDoS Attacks Detection in ‘Internet of Medical Things’ Using Machine Learning Techniques"}, {"paperId": "96e736ea05a15960d5d2bb2b330235f6c199633a", "title": "Road condition monitoring using unsupervised learning based bus trajectory processing"}, {"paperId": "440215abe4e6272b0901d12b01b4c56a9ba0f4cf", "title": "Road surface data acquisition system with Fog Computing V2I Networks in Smart Cities"}, {"paperId": "296303f0b6d4a3143cc98d2fd5258df6fb7c04d6", "title": "Road Surface recognition by using Quantile Transformation and ML Algorithms"}, {"paperId": "3a0a73daaecccdb0d1b2404ab9b101dd584a7b9e", "title": "A Review of Road Surface Anomaly Detection and Classification Systems Based on Vibration-Based Techniques"}, {"paperId": "339cefec6076e4bcb50b2ffc5fa6bd5dc2a788e2", "title": "An intelligent tyre system for road condition perception"}, {"paperId": "8e06e2b35517dd848b1146f1c20c307bb81732ad", "title": "IoV-fog-cloud framework for road anomalies detection using SVM-nAVDD approach"}, {"paperId": "e695424a5f996a26f0d1fdd29f7f6c7297b5d4bc", "title": "Smartphone-based road manhole cover detection and classification"}, {"paperId": "8194439f99cf88ce83f4a2334c9b427a158bd35b", "title": "Achieving Participatory Smart Cities by Making Social Networks Safer"}, {"paperId": "f8028c997a6ff801737b833e37671f6e8da481b3", "title": "Integrating IoT-Sensing and Crowdsensing with Privacy: Privacy-Preserving Hybrid Sensing for Smart Cities"}, {"paperId": "e336b89d502f9422e4b674ef7f31fd86c0652579", "title": "A Battery-free Pavement Roughness Estimation System Based on Kinetic Energy Harvesting"}, {"paperId": "2bed3b01846b7d82decf0205a50b5b638e0e978f", "title": "Robust Data-Driven Framework for Driver Behavior Profiling Using Supervised Machine Learning"}, {"paperId": "0a417e865ca03719d8b69045cc35c504199c5496", "title": "Toward Integrated Large-Scale Environmental Monitoring Using WSN/UAV/Crowdsensing: A Review of Applications, Signal Processing, and Future Perspectives"}, {"paperId": "85b472d78138bd6a3fc376b9df3e9fbc2bb39d99", "title": "A scalable, self‐supervised calibration and confounder removal model for opportunistic monitoring of road degradation"}, {"paperId": "35df04d4c05fefcba63fc0c0631351fde9d521dd", "title": "Visualizing Street Pavement Anomalies through Fog Computing V2I Networks and Machine Learning"}, {"paperId": "d7576b09f882435079bd58011cf3c6b5bc100bf1", "title": "MOBILE CROWDSENSING FRAMEWORK FOR ROAD SURFACE QUALITY DETECTION."}, {"paperId": "505067717f1bf64554afbe078f83ff456d669273", "title": "When Intelligent Transportation Systems Sensing Meets Edge Computing: Vision and Challenges"}, {"paperId": "b944f50bf8a5cfbb440adce701b949baf25dcaf3", "title": "Augmenting Driver’s Situational Awareness using Smartphones in VANETs"}, {"paperId": "236fd4aefcf8d5cb1cd751369cc97d19e4eeac58", "title": "Fool Proof Ticketing System management for Railway"}, {"paperId": "14bf455e90558b7f78d2d85a4c3b1a2de746525b", "title": "Road Roughness Estimation Using Machine Learning"}, {"paperId": "bb7abf911e9ab5653aa4c1d048de1c06ede0868a", "title": "SenseMag: Enabling Low-Cost Traffic Monitoring Using Noninvasive Magnetic Sensing"}, {"paperId": "d26538b870f1dc3971cae8124d5d8c78647780ba", "title": "From Centralized Management to Edge Collaboration: A Privacy-Preserving Task Assignment Framework for Mobile Crowdsensing"}, {"paperId": "7fa1724d09213fd879370b65cc4832ca584c5a14", "title": "A Vehicular Crowd-sensing Incentive Mechanism for Temporal Coverage"}, {"paperId": "41645c46dd3e0ab17ed581ddc2e6753f0f921652", "title": "Vehicular Perception Based on Inertial Sensing: A Structured Mapping of Approaches and Methods"}, {"paperId": "d7228dce89fb251a577e690cf4b317a39a16cfa7", "title": "OCD: Online Crowdsourced Delivery for On-Demand Food"}, {"paperId": "96dff814763195ba666d803c233b2eefec7f14cd", "title": "Development of a crowdsourcing-based system for computing the international roughness index"}, {"paperId": "4c66c777e1ee58a9f78001719b27de86239ee2aa", "title": "Incentive Mechanism for Vehicular Crowdsensing with Budget Constrains"}, {"paperId": "76dacb1850b768ae396339d06b15b34a624f1d5b", "title": "Crowdsensing-Based Personalized Dynamic Route Planning for Smart Vehicles"}, {"paperId": "37c098aa5fab82786cee08d38e48c0a6a78a1d63", "title": "Detecting Vehicles’ Relative Position on Two-Lane Highways Through a Smartphone-Based Video Overtaking Aid Application"}, {"paperId": "c2a3a97a5f080207ba698c16373619108eb4e0c0", "title": "Robust Positioning for Road Information Services in Challenging Environments"}, {"paperId": "42f3ab52919539bfc2a5ca43e3b43e499e620e0e", "title": "Applications of Internet of Things (IoT) – An Overview"}, {"paperId": "65ac2c012850ef2dafaca78acb5d1b35a82a3119", "title": "Internet of Medical Things (IoMT) - An overview"}, {"paperId": "4543a2cf0af0e0f155f7a88223939ad517ab4b90", "title": "Accuracy Enhancement of Anomaly Localization with Participatory Sensing Vehicles"}, {"paperId": "9fc9f11f7030ec900e8bd627b2ac567975a6afb8", "title": "Enhancement of signals from connected vehicles to detect roadway and railway anomalies"}, {"paperId": "eac1bd0020f70f0ece3b8217027fcac2de373e96", "title": "Enabling real-time road anomaly detection via mobile edge computing"}, {"paperId": "97c59f8e6c5625d6593b8723091d052489a9e3ad", "title": "CPDM: An Efficient Crowdsensing-Based Pothole Detection and Measurement System Design"}, {"paperId": "f5d8144a480eea05f501f5457651a620c38cf87b", "title": "Machine learning in the Internet of Things: Designed techniques for smart cities"}, {"paperId": "5dfa5a654ba4e743bf0a70427299c734f1b8c1ec", "title": "Situational Awareness with Ubiquitous Sensing: Towards Real-time Event Detection & Classification"}, {"paperId": "1a3191d54e8f67e51ed9ff90c895171d363b1858", "title": "A Framework for Adaptive Resolution Geo-Referencing in Intelligent Vehicular Services"}, {"paperId": "d314a1f15c16b0d4e450363ac32df1a8102b7371", "title": "Situational Awareness with Ubiquitous Sensing: The Case of Robust Detection and Classification of Targets in Close Proximity"}, {"paperId": "5d951181fe1f6587140ec7b7a2812ca3ba73bc66", "title": "An Incentive Mechanism Design for Socially Aware Crowdsensing Services with Incomplete Information"}, {"paperId": "288b12ee725930ced61b42036716fd8e41496f12", "title": "Fast Local Laplacian-Based Steerable and Sobel Filters Integrated with Adaptive Boosting Classification Tree for Automatic Recognition of Asphalt Pavement Cracks"}, {"paperId": "89e5c6cdf1453e44fb5bfb16b1208ff710cc0ce0", "title": "iDriveSense: Dynamic Route Planning Involving Roads Quality Information"}, {"paperId": "0ec31a418f98e5f4e9a93a67fa0879ca0df45dcb", "title": "Small Data in IoT: An MCS Perspective"}, {"paperId": "f0a56e444728e37c9b3eb8cc42d546692b0096ec", "title": "The Internet of Things: Secure Distributed Inference"}, {"paperId": "39afaaed6f8e7941f54ab515f98810b3b25d7a95", "title": "Utilization of Wavelet Packet Sensor De-noising for Accurate Positioning in Intelligent Road Services"}, {"paperId": "a751b59024cfc21c11ee359fe51c3c0c948f44a3", "title": "Enhancing GNSS Positioning Accuracy for Road Monitoring Systems: A Factor Graph Optimization Approach Aided by Geospatial Information"}, {"paperId": "59096a4c14d0fdc61081d2a17f46c7c3c3657393", "title": "Crowdsensing for Road Pavement Condition Monitoring: Trends, Limitations, and Opportunities"}, {"paperId": "7d2a5b8107486c805e752cd6ddf00259e37fa70e", "title": "An introduction and systematic review on machine learning for smart environments/cities: An IoT approach"}, {"paperId": "41d03a566246f5e120a6e8a943e4f1184ab432ab", "title": "How Many Bumps in Your City? Personalized Bump Seeker With Mobile Crowdsensing"}, {"paperId": "4f528eb89d2cf472b80ad8c03b633d34a5df44e6", "title": "A Platform-Based Incentive Mechanism for Autonomous Vehicle Crowdsensing"}, {"paperId": "a34a15bdc5c1ac5faf061bfd38818d8713e216b3", "title": "The Role of Artificial Intelligence in Smart Cities: Systematic Literature Review"}, {"paperId": "ab95cd0d7ca34456f7f2485a7657bdc2b20e84ce", "title": "A secure road condition monitoring scheme in cloud based VANET"}, {"paperId": "eaa7d8359f754c70f4197fa9be70cb2abc830376", "title": "Data Mining Algorithms for Smart Cities: A Bibliometric Analysis"}, {"paperId": "e60f18a582aa346ae625047faf9589dc34b82b98", "title": "Machine Learning and Internet of Things for Smart Living: A Comprehensive Review and Analysis"}, {"paperId": "04da07ecb6ca8c18095bbb8d3e539cd1cd71dba6", "title": "A survey on smart phone-based road condition detection systems"}, {"paperId": "f310771f5e167bc981c74ad980db486b2de07f4e", "title": "Detecting the relative position of vehicles on two-lane highways in a smartphone-based video overtaking aid application"}, {"paperId": "38f21da08337bfe17e0b3e603202110535cb6f81", "title": "Crowdsourcing from the True crowd: Device, vehicle, road-surface and driving independent road profiling from smartphone sensors"}, {"paperId": "bd7a8f21ff9652ae22d30c76c14a821c6e1b01e4", "title": "QDetect: Time Series Querying Based Road Anomaly Detection"}, {"paperId": "2ade60664ea74168e40c750290a2f210c615f357", "title": "INTELLIGENT ANDROID APPLICATION FOR SENSING ROAD CONDITIONS USING ACCELEROMETER AND GYROSCOPE"}, {"paperId": "26fb1474f1c40e320333e00eafe3342db08dedcb", "title": "Precise Survey Assistance for Civil Structures Using Survey Assist"}, {"paperId": "1719d31d57c89e9663570de15b89ff61b03ac52a", "title": "Data analytics for Cooperative Intelligent Transport Systems"}, {"paperId": "4a6fc2364978ff929125930c1312fd0f392ad055", "title": "Toward Practical Crowdsourcing-Based Road Anomaly Detection With Scale-Invariant Feature"}, {"paperId": "70a7cacb679c7e10fc103900b9250f9245eac901", "title": "ACCEPTED FROM OPEN CALL"}]}
