{"paperId": "98292a8d5014f04fb32c81cde95a552ebad4b111", "publicationVenue": {"id": "c4e8c108-4bf0-47d8-845f-c7db28eefc29", "name": "Spine", "type": "journal", "issn": "0362-2436", "url": "http://www.spinejournal.com/", "alternate_urls": ["http://abstracts.spinejournal.com/"]}, "title": "Deep Learning Application in Spinal Implant Identification.", "abstract": "STUDY DESIGN\nRetrospective observational study.\n\n\nOBJECTIVE\nTo demonstrate the clinical usefulness of deep learning by identifying previous spinal implants through application of deep learning.\n\n\nSUMMARY OF BACKGROUND DATA\nDeep learning has recently been actively applied to medical images. However, despite many attempts to apply deep learning to medical images, the application has rarely been successful. We aimed to demonstrate the effectiveness and usefulness of deep learning in the medical field. The goal of this study was to demonstrate the clinical usefulness of deep learning by identifying previous spinal implants through application of deep learning.\n\n\nMETHODS\nFor deep learning algorithm development, radiographs were retrospectively obtained from clinical cases in which the patients had lumbar spine one-segment instrument surgery. A total of 2894 lumbar spine anteroposterior (AP: 1446 cases) and lateral (1448 cases) radiographs were collected. Labeling work was conducted for five different implants. We conducted experiments using three deep learning algorithms. The traditional deep neural network model built by coding the transfer learning algorithm, Google AutoML, and Apple Create ML. Recall (sensitivity) and precision (specificity) were measured after training.\n\n\nRESULTS\nOverall, each model performed well in identifying each pedicle screw implant. In conventional transfer learning, AP radiography showed 97.0% precision and 96.7% recall. Lateral radiography showed 98.7% precision and 98.2% recall. In Google AutoML, AP radiography showed 91.4% precision and 87.4% recall; lateral radiography showed 97.9% precision and 98.4% recall. In Apple Create ML, AP radiography showed 76.0% precision and 73.0% recall; lateral radiography showed 89.0% precision and 87.0% recall. In all deep learning algorithms, precision and recall were higher in lateral than in AP radiography.\n\n\nCONCLUSION\nThe deep learning application is effective for spinal implant identification. This demonstrates that clinicians can use ML-based deep learning applications to improve clinical practice and patient care.Level of Evidence: 3.", "venue": "Spine", "year": 2020, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-12-08", "journal": {"name": "Spine"}, "authors": [{"authorId": "6281890", "name": "Hee-Seok Yang"}, {"authorId": "1828775138", "name": "Kwang-Ryeol Kim"}, {"authorId": "2109657932", "name": "Sungjun Kim"}, {"authorId": "46979239", "name": "Jeong-Yoon Park"}], "citations": [{"paperId": "965eb4ff8e1837807546946451498a9caed1df24", "title": "Deep Learning Detection of Aneurysm Clips for Magnetic Resonance Imaging Safety"}, {"paperId": "493ad53f7b7be5a65200ab249c035f87701ad4c6", "title": "Differentiating Types of Spinal Curvatures Using AlexNet and ResNet-50 Models"}, {"paperId": "49cead645696934a8128b1286b6536486de24d7d", "title": "A computer vision approach to identifying the manufacturer of posterior thoracolumbar instrumentation systems."}, {"paperId": "b0d0f2a4eb97fb36198672ff5d4307bb48057b01", "title": "Code-free machine learning for object detection in surgical video: a benchmarking, feasibility, and cost study."}, {"paperId": "24b3fc8d73d0277983c1edd20d5abd897a1ed3b5", "title": "An Evolution Gaining Momentum—The Growing Role of Artificial Intelligence in the Diagnosis and Treatment of Spinal Diseases"}, {"paperId": "30676f14b9ae9ff5e07fa2baefefe3b38fc77afd", "title": "Evaluation of Deep Learning-Based Automated Detection of Primary Spine Tumors on MRI Using the Turing Test"}, {"paperId": "4d17a8b23d1b441f3d27f50332ed956e9a155596", "title": "Exploring the Learning Psychology Mobilization of Music Majors Through Innovative Teaching Methods Under the Background of New Curriculum Reform"}, {"paperId": "e6d2a0a8ef58025ac8d97a28c824245bf4d66b84", "title": "Artificial intelligence in orthopedic implant model classification: a systematic review"}, {"paperId": "5f38e20f57ec1eb7d6ecf3c4f90240054654ccc3", "title": "AI MSK clinical applications: orthopedic implants"}, {"paperId": "e4ef52184491506b0b16e7d891e327798dac0c1e", "title": "Audio Style Conversion Based on AutoML and Big Data Analysis"}]}
