{"paperId": "982e89d667938da32fa2cf067f40d299901f8b54", "publicationVenue": {"id": "c1adbce3-ec94-4afa-90a8-ebb027eb2da3", "name": "International Conference on Virtual Execution Environments", "type": "conference", "alternate_names": ["Virtual Execution Environments", "VEE", "Int Conf Virtual Execution Environ", "Virtual Execution Environ"], "url": "https://dl.acm.org/conference/vee/proceedings"}, "title": "Transparent and lightweight object placement for managed workloads atop hybrid memories", "abstract": "Managed workloads show strong demand for large memory capacity, which can be satisfied by a hybrid memory sub-system composed of traditional DRAM and the emerging non-volatile memory (NVM) technology. Nevertheless, NVM devices are limited by deficiencies like write endurance and asymmetric bandwidth, which threatens managed applications’ performance and reliability. Prior work has proposed different object placement mechanisms to mitigate problems introduced by NVM, but they require domain-specific knowledge on applications or significant change on managed runtime. By analyzing the performance of representative data-intensive workloads atop NVM, this paper finds that reducing write operations is key for performance and wear-leveling. To this end, this paper proposes GCMove, a transparent and efficient object placement mechanism for hybrid memories. GCMove embraces a lightweight write barrier for write detection and relies on garbage collections (GC) to copy objects into different devices according to their write-related behaviors. Compared with prior work, GCMove does not require significant changes in heap layout and thus can be easily integrated with mainstream copy-based garbage collection. The evaluation on various managed workloads shows that GCMove can eliminate 99.8% of NVM write operations on average and improve the performance by up to 19.81× compared with the NVM-only version.", "venue": "International Conference on Virtual Execution Environments", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2022-02-25", "journal": {"name": "Proceedings of the 18th ACM SIGPLAN/SIGOPS International Conference on Virtual Execution Environments"}, "authors": [{"authorId": "2144242232", "name": "Zhe Li"}, {"authorId": "3790459", "name": "Mingyu Wu"}], "citations": [{"paperId": "1506235176dc60271b51df7757e6afaf28bcb8b3", "title": "Toward CXL-Native Memory Tiering via Device-Side Profiling"}, {"paperId": "455667c13187917e8930255dc6ceb8c9bca43007", "title": "MEMTIS: Efficient Memory Tiering with Dynamic Page Classification and Page Size Determination"}, {"paperId": "c0501daf0f01738320040f69d1ede6f83bf8c38c", "title": "Pointer Analysis for Programs on Hybrid DRAM-PM Memory Systems"}, {"paperId": "e2f710714ba9c28972269b7aeed95acd98434404", "title": "Adjacent LSTM-Based Page Scheduling for Hybrid DRAM/NVM Memory Systems"}, {"paperId": "d0318568a178786b17e903f932cb9ee5be85f85f", "title": "14th Workshop on Parallel Programming and Run-Time Management Techniques for Many-Core Architectures and 12th Workshop on Design Tools and Architectures for Multicore Embedded Computing Platforms, PARMA-DITAM 2023, January 17, 2023, Toulouse, France"}]}
