{"paperId": "98334c32d1ac052182b128532ae815a91f68455b", "publicationVenue": {"id": "373ee421-9890-40bc-87d7-59518033a715", "name": "Environmental Research Letters", "type": "journal", "alternate_names": ["Environ Res Lett"], "issn": "1748-9326", "url": "http://www.iop.org/EJ/toc/1748-9326", "alternate_urls": ["http://iopscience.org/erl", "http://iopscience.iop.org/1748-9326/", "https://iopscience.iop.org/journal/1748-9326"]}, "title": "Social vulnerability in a multi-hazard context: a systematic review", "abstract": "The interacting effects of multiple hazards pose a substantial challenge to poverty reduction and national development. Yet, social vulnerability to multiple hazards is a relatively understudied, though growing concern. The impacts of climate hazards in particular, leave increasingly large populations becoming more exposed and susceptible to the devastating effects of repeat, chronic and sequential natural hazards. Multi-hazard research has focused on the physical aspects of natural hazards, giving less attention to the social facets of human-hazard interaction. Further, there is no single conceptualization of ‘multi-hazard’. This systematic review utilizes correlations and hierarchical clustering to determine how social vulnerability is assessed in the context of the three most common classifications of ‘multi-hazard’: aggregate, cascading and compound. Results reveal these classifications of ‘multi-hazard’ each focus on different aspects of social vulnerability. Studies in the aggregate classification of multi-hazard were more likely to represent social vulnerability as an outcome of hazard events, while those in the cascading and compound classifications more often addressed social vulnerability as a preexisting condition. Further, knowledge of social vulnerability to multi-hazards comes mainly from the aggregate classification and the mitigation phase of the disaster cycle. The difference in perspectives of social vulnerability covered, and limited context in which multi-hazard studies of social vulnerability have been applied, mean a full understanding of social vulnerability remains elusive. We argue that research should focus on the cascading and compound classifications of multi-hazards, which are more suited to interrogating how human-(multi)hazard interactions shape social vulnerability.", "venue": "Environmental Research Letters", "year": 2022, "fieldsOfStudy": ["Physics"], "publicationTypes": ["Review"], "publicationDate": "2022-02-02", "journal": {"name": "Environmental Research Letters", "volume": "17"}, "authors": [{"authorId": "2044671757", "name": "O. Drakes"}, {"authorId": "1980612", "name": "Eric Tate"}], "citations": [{"paperId": "0edbe058de5b5395536cddec469096a42ddac638", "title": "Power System Resilience: The Role of Electric Vehicles and Social Disparities in Mitigating the US Power Outages"}, {"paperId": "65d219c7fb921b87ff84818e3950f18d3f6d8047", "title": "Climate change and health: rethinking public health messaging for wildfire smoke and extreme heat co-exposures"}, {"paperId": "0a3f544449b655dd4df7e0d8df3f8ca297947308", "title": "Contribution and compatibility of public open space in disaster management: Perception and experience from Kathmandu Metropolitan"}, {"paperId": "32cecfe762970d549fc8accabd24030dd382bc4a", "title": "A systematic scoping review of the Social Vulnerability Index as applied to natural hazards"}, {"paperId": "6952d9460a3cb24dbaa5d385a3fa3c71b8206aff", "title": "Identifying disaster risk factors and hotspots in Africa from spatiotemporal decadal analyses using INFORM data for risk reduction and sustainable development"}, {"paperId": "1414e897aa1f5e22893905ab646090c04404fef3", "title": "Research progresses and prospects of multi-sphere compound extremes from the Earth System perspective"}, {"paperId": "5b76648abf7b4fdb011a887afe86755c46d04994", "title": "Resilience in complex disasters: Florida's hurricane preparedness, response, and recovery amid COVID-19"}, {"paperId": "4fcb4e46649387c5b99f0f13e3976d3f961e57a4", "title": "Identifying the interfaces between perceived multi-hazards and socio-ecological risks to strengthen local adaptations."}, {"paperId": "06f3913eea6ed6ee8ec5e34f4eaf5084c6d32881", "title": "Exploring interactions between socioeconomic context and natural hazards on human population displacement"}, {"paperId": "45e197a4a351e3b06d2d7f461c5b7807acc7fb9d", "title": "Three-dimensional analyses of China's marine disaster management policies (1990–2022): With implications for carbon neutrality"}, {"paperId": "8fa6a50151dbf2759c134b2be42342d6d66379f6", "title": "Hazard experiences, concerns and responses in coastal municipalities and communities: insights from Nova Scotia, Canada"}, {"paperId": "30ef4c8967301d5d9d7a8dd9fe22c21faff5d919", "title": "Socioeconomic vulnerability assessment of coastal villages and buildings along Andhra Pradesh East Coast of India"}, {"paperId": "9c5b13826a98495e172b8020cff231e320ef979d", "title": "An Index-Based Approach to Assess Social Vulnerability for Hamburg, Germany"}, {"paperId": "4c73ccfe07166775674b257fafc264d453f37fdd", "title": "Measuring Social Vulnerability to Climate Change at the Coast: Embracing Complexity and Context for More Accurate and Equitable Analysis"}, {"paperId": "4266fb8295595a6788672958529d20bc4e0e9e74", "title": "Multiscale GIS based-model to assess urban social vulnerability and associated risk: Evidence from 146 urban centers of Eastern India"}, {"paperId": "7b453da5981354e608574d8ab9c8882fe78b5f10", "title": "Integrating equity, climate risks, and population growth for targeting conservation planning"}, {"paperId": "a2fd467c4c3140db7e8e22d8e63dcde21b0bc7de", "title": "Machine learning-enabled regional multi-hazards risk assessment considering social vulnerability"}, {"paperId": "482a61879112538c90af42592fa2fce2098a4846", "title": "Constructing a social vulnerability index for flooding: insights from a municipality in Sweden"}, {"paperId": "943c4c12c8d219837e2f66648f541c4fe5a9b73a", "title": "Stakeholder Perceptions about Incorporating Externalities and Vulnerability into Benefit–Cost Analysis Tools for Watershed Flood Risk Mitigation"}, {"paperId": "f5b8f7ad474851bb881c93e2e23a9bc7cdd9f2ab", "title": "Global shocks, cascading disruptions, and (re-)connections: viewing the COVID-19 pandemic as concurrent natural experiments to understand land system dynamics"}, {"paperId": "b6eec037595e49e0c9d4ad96ee06a31cf89cb8a3", "title": "Transformative service research methodologies for vulnerable participants"}, {"paperId": "423a6ce391b1759f845ff3b3c9fbe0116e3a5372", "title": "Local-Level Flood Hazard Management in Canada: An Assessment of Institutional Structure and Community Engagement in the Red River Valley of Manitoba"}, {"paperId": "f86ec2d6e01a678a34a72aed825b2728d4718e99", "title": "Compound droughts and hot extremes: Characteristics, drivers, changes, and impacts"}, {"paperId": "7df19b158c2bd3ad51354fa717b448d1d638fb4e", "title": "The challenges of dynamic vulnerability and how to assess it"}, {"paperId": "2888e933c34e3f919693bd9768a908683ce5d787", "title": "An Interpretable Index of Social Vulnerability to Environmental Hazards (Short Paper)"}]}
