{"paperId": "98344938603907f90e002d7f7647486e7d626836", "publicationVenue": null, "title": "Using Innovative Technologies In Medical Education Of Ukraine Under Martial Law", "abstract": "Annotation. Reforming medical education, changing the paradigm towards ensuring the quality of professional training of future doctors, forming a modern educational space and harmonization with international standards on innovative technologies was interrupted by the Covid-19 pandemic and Russian military aggression. The relevance of the conducted research is called by determination of the directions of educational innovation, implemented by medical institutions of higher education in wartime conditions. The methodological base of the research is the methods of scientific acknowledgement, structural and logical analysis. The scientific novelty of the issue lies in the comprehensive study of the peculiarities of organizing the training of higher medical education applicants through the prism of innovative educational technologies and interactive teaching methods use. Based on the results of the research it is recommended to use a number of modern innovative technologies that are not yet sufficiently known to the general educational community. Among such we may note «flipped classroom», gamification, brainstorming, quest-task, training based education, STEM education. However, the implementation of the specified technologies and methods should be selected according to the individual capabilities and conditions for study of medical education applicants. The research also determines the peculiarities of knowledge assessment of higher medical education applicants in the conditions of innovative education and the change of the teacher's role in the educational process. The practical significance of the work lies in the possibility to organize the training of medical students in accordance with the tasks of training professionals of the new era.", "venue": "", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "47489686", "name": "I. Skrypnyk"}, {"authorId": "84002994", "name": "H. Maslova"}, {"authorId": "83291837", "name": "O. Shaposhnyk"}, {"authorId": "2174231648", "name": "Tetyana S. Shevchenko"}, {"authorId": "1557390359", "name": "S. Sorokina"}, {"authorId": "1394587242", "name": "I. Kudria"}, {"authorId": "2067039969", "name": "Olha Honchar"}], "citations": []}
