{"paperId": "985be72aceab512f76b8dd5ad8ad570e9793a12a", "publicationVenue": {"id": "28df6cf4-b335-41eb-acc6-50eb3c965e5a", "name": "IEEE Transactions on Computational Social Systems", "type": "journal", "alternate_names": ["IEEE Trans Comput Soc Syst"], "issn": "2329-924X", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=6570650", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/aboutJournal.jsp?punumber=6570650"]}, "title": "Discovering Density-Based Clustering Structures Using Neighborhood Distance Entropy Consistency", "abstract": "Traditional clustering algorithms model the clustering problem as an optimization task, in which the objective is defined based on minimizing specific metrics. These algorithms are limited to find clusters with convex polytopes. In contrast, density-based clustering algorithms aim at overcoming this limitation and try to partition data objects into meaningful groups that have relatively high density separated by low-density regions. This work describes and evaluates a new density-based clustering algorithm, called neighborhood distance entropy consistency (NDEC), which is able to not only detect clusters of arbitrary size, shape, and density, but also identify outliers. To this end, both local and global densities are considered simultaneously to accurately discover the intrinsic clustering structure. In addition, the consistency of neighborhood distance entropy is used as an important criterion to merge potential subclusters. Experiments on synthetic and real benchmark clustering data sets have demonstrated the efficiency and effectiveness of the NDEC method. Comparisons with ${k}$ -means, DBSCAN, OPTICS, and density peaks clustering algorithms further show that NDEC can successfully discover natural clusters. Additionally, the utility of NDEC is demonstrated with its application on two real-world problems including brain white matter tracts segmentation using diffusion tensor imaging and characterizing motor unit potential trains extracted from electromyographic signals.", "venue": "IEEE Transactions on Computational Social Systems", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-08-01", "journal": {"name": "IEEE Transactions on Computational Social Systems", "pages": "1069-1080", "volume": "7"}, "authors": [{"authorId": "4297264", "name": "T. Kamali"}, {"authorId": "1691156", "name": "D. Stashuk"}], "citations": [{"paperId": "7cad6cc25f42120b8751aa31e5978fccd0804268", "title": "Enforced Block Diagonal Graph Learning for Multikernel Clustering"}, {"paperId": "de155b8f2fd68ef26f441da41bdfc71773b4ea38", "title": "AMRDB: Design of an automatic analytical model for density-based clustering using augmented rule mining"}, {"paperId": "3d7940a236be8fc5ad542974d59ed75582b5fa84", "title": "Review of Clustering Technology and Its Application in Coordinating Vehicle Subsystems"}, {"paperId": "e0f57ffa7df03fd6ec71a3fcf789e2cc984c3129", "title": "Evaluation and Spatial–Temporal Difference Analysis of Urban Water Resource Utilization Efficiency Based on Two-Stage DEA Model"}, {"paperId": "52afa8ebcfc406a8f6a1cade322a99a6418e75a1", "title": "Cognitive Impairment Analysis of Myotonic Dystrophy via Weakly Supervised Classification of Neuropsychological Features"}, {"paperId": "d61049e3cdd1d5cee794e860c6007082fd5da8a0", "title": "Online Trajectory Estimation Based on a Network-Wide Cellular Fingerprint Map"}, {"paperId": "b41798cc8eb15a247fd82e56764c9b5a2b90b6e2", "title": "Online Active Learning Framework for Data Stream Classification With Density-Peaks Recognition"}, {"paperId": "670fef8c5a4d08637995a85120dfd7b7a0b022da", "title": "K-Means Clustering Machine Learning Concept to Enable Social Distancing in Public Places"}]}
