{"paperId": "98691dbdd724177345bdbb600f0d143dcbd9c0b1", "publicationVenue": null, "title": "Prediction of Maintenance Time and IoT Device Failures using Artificial Intelligence", "abstract": "The real-time mechatronic system is critical in today's industry for increasing productivity and product quality to meet consumer demands. The quality of a product is largely determined by the quality of the machines employed in the manufacturing process. The reliability prediction model's accuracy is improved by sorting the submodules systematically and feeding the qualitative and quantitative fault data acquired into it. Fault detection and reliability forecasting modules are included in this model. Predictive maintenance aims to reduce equipment downtime and lessen the impact of failures by scheduling maintenance activities prior to the commencement of failures. This hastened the implementation of Genetic algorithms based on artificial intelligence and machine learning to predict equipment problems. For software fault prediction, a Bayes Decision classifier is used in this study to find error probabilities and integrals using feature and classifier data, this work explains how to make basic predictions about software errors. Chernoff Bound and Bhattacharyya Bound are also discussed in the suggested software error prediction using fault-predictable zone. Software errors can be predicted using a new Bayesian decision procedure that incorporates error probabilities and integrals from a machine learning model.", "venue": "2022 Second International Conference on Advances in Electrical, Computing, Communication and Sustainable Technologies (ICAECT)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-04-21", "journal": {"name": "2022 Second International Conference on Advances in Electrical, Computing, Communication and Sustainable Technologies (ICAECT)", "pages": "1-5"}, "authors": [{"authorId": "33134912", "name": "A. Shanmuga Sundaram Devi"}, {"authorId": "152792266", "name": "A. T"}, {"authorId": "52516185", "name": "R. Satpathy"}, {"authorId": "2174388005", "name": "Malabika Nayak"}, {"authorId": "2174389291", "name": "M. Reka"}, {"authorId": "2174389716", "name": "Prakash Kumar Mohapatra"}], "citations": []}
