{"paperId": "987444dc5ca17f4e99b1a9119b79373c7abe905c", "publicationVenue": null, "title": "A Study on a Matching Algorithm for Urban Underground Pipelines", "abstract": "Urban underground pipelines are known as “urban blood vessels”. To detect changes in integrated pipelines and professional pipelines, the matching of same-name spatial objects is critical. Existing algorithms used for vector network matching were analyzed to develop an improved matching algorithm that can adapt to underground pipeline networks. Our algorithm improves the holistic matching of pipeline strokes, and also a partial matching algorithm is provided. In this study, appropriate geometric measures were selected to calculate the geometric similarity between pipeline strokes in their holistic matching. Existing methods for evaluating similarities in spatial scene structures in partial underground pipeline networks were improved. A method of partial matching of strokes was additionally investigated, and it compensates for the deficiencies of holistic stroke matching. Experiments showed that the matching performance was good, and the operation efficiency was high.", "venue": "ISPRS Int. J. Geo Inf.", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-08-10", "journal": {"name": "ISPRS Int. J. Geo Inf.", "pages": "352", "volume": "8"}, "authors": [{"authorId": "2118512353", "name": "Shuai Wang"}, {"authorId": "2976155", "name": "Q. Guo"}, {"authorId": "101246506", "name": "X. Xu"}, {"authorId": "152428333", "name": "Yuwu Xie"}], "citations": [{"paperId": "993d2e80ec2af18cb7e15014f5e7520bafdcfef7", "title": "Multi-Scale Road Matching Based on the Summation Product of Orientation and Distance and Shape Descriptors"}, {"paperId": "be0c34dc722a38107e95e800a18d1dada5a7997b", "title": "A NEW GEOGRAPHIC CONTEXT MEASURE TO SIMILARITY ASSESSMENT BASED ON THE SHAPE CONTEXT DESCRIPTOR"}, {"paperId": "440d7e75d770a16987ee91b675948e9e00c725db", "title": "A PRAXIS ON DATA QUALITY EVALUATION OF UNDERGROUND PIPELINE"}, {"paperId": "aa259dd17cb95e24ead1b1b7fd71379bd5b80605", "title": "Combined Matching Approach of Road Networks Under Different Scales Considering Constraints of Cartographic Generalization"}, {"paperId": "3d1831df198e8f0f063efbfe6bf4ad1b5976a95e", "title": "Importance Assessment of Water Supply Networks Considering Multi Features"}]}
