{"paperId": "9892557c49d2c6d8b1bfe7f969b9c3c5f6a27a2a", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Mobile Edge Computing Task Offloading Strategy Based on Parking Cooperation in the Internet of Vehicles", "abstract": "Due to the limited computing capacity of onboard devices, they can no longer meet a large number of computing requirements. Therefore, mobile edge computing (MEC) provides more computing and storage capabilities for vehicles. Inspired by a large number of roadside parking vehicles, this paper takes the roadside parking vehicles with idle computing resources as the task offloading platform and proposes a mobile edge computing task offloading strategy based on roadside parking cooperation. The resource sharing and mutual utilization among roadside vehicles, roadside units (RSU), and cloud servers (cloud servers) were established, and the collaborative offloading problem of computing tasks was transformed into a constraint problem. The hybrid genetic algorithm (HHGA) with a mountain-climbing operator was used to solve the multi-constraint problem, to reduce the delay and energy consumption of computing tasks. The simulation results show that when the number of tasks is 25, the delay and energy consumption of the HHGA algorithm is improved by 24.1% and 11.9%, respectively, compared with Tradition. When the task size is 1.0 MB, the HHGA algorithm reduces the system overhead by 7.9% compared with Tradition. Therefore, the proposed scheme can effectively reduce the total system cost during task offloading.", "venue": "Italian National Conference on Sensors", "year": 2022, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-06-30", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "22"}, "authors": [{"authorId": "30430920", "name": "Xianhao Shen"}, {"authorId": "2052169647", "name": "Zhao Chang"}, {"authorId": "2142822078", "name": "Shao-zhang Niu"}], "citations": [{"paperId": "9da03b3fb1891a6d5175d6efa41fce2425c76e4f", "title": "Metaheuristic algorithms for 6G wireless communications: Recent advances and applications"}, {"paperId": "3022acc41f0674333568817c5572450405084c1a", "title": "Parking Cooperation-Based Mobile Edge Computing Using Task Offloading Strategy"}, {"paperId": "8c5d9a73352a1948e25cf4605ca372353fb2eaa8", "title": "Point Cloud Clustering System with DBSCAN Algorithm for Low-Resolution LiDAR"}, {"paperId": "d8dd6da511a8b4028cba2a22e5541c5f02af3c71", "title": "Multi-mobile vehicles task offloading for vehicle-edge-cloud collaboration: A dependency-aware and deep reinforcement learning approach"}, {"paperId": "700039f4ad13827ca52742993f29d8619ff25cb7", "title": "Research on Offloading Strategy for Mobile Edge Computing Based on Improved Grey Wolf Optimization Algorithm"}, {"paperId": "144b4a25c443335a37ee8a6a0897c42edc5a0621", "title": "Research on Cloud-Edge-End Collaborative Computing Offloading Strategy in the Internet of Vehicles Based on the M-TSA Algorithm"}, {"paperId": "faba9723aa1100dcf83523cbcfbfed8ca8fcb550", "title": "Computing Offloading Decision Based on Adaptive Estimation of Distribution Algorithm in Internet of Vehicles"}]}
