{"paperId": "9892f385faacd53bd71025c8baaebc2e90b770b9", "publicationVenue": {"id": "41c7b0a9-1ac8-4102-a922-b05715a0cd12", "name": "Journal of Mechanical Engineering Science and Technology", "type": "journal", "alternate_names": ["J Mech Eng Sci Technol"], "issn": "2580-0817", "url": "http://journal2.um.ac.id/index.php/jmest/index"}, "title": "Study on Predictive Maintenance of V-Belt in Milling Machines Using Machine Learning", "abstract": "Towards industry 4.0, monitoring the degradation of machine tools’ components becomes a key feature so that smooth productivity is achieved. To preserve the functionality and performance of the machine tools, proper maintenance activities must be planned and carried out. V-belt is important component in machine tools that transmits power from the electric motor spindle in order to machine to work and cut desired material properly. The purpose of this research is to develop a predictive maintenance system for v-belt milling machine Krisbow 31N2F using machine learning. The machine learning algorithm models using multiple and simple linear regression algorithm was developed in an open-source program. The test results show that the machine learning model has a high accuracy value in both the training data and the testing data. The multiple linear regression model has MSE value of 5.8830x10-6 and MAE value of 0.002. The Simple linear regression model has an MSE value of 0.0004x10-6 and MAE value of 0.162. The results shows that the use of the linear regression algorithm as a support for determining the prediction of RUL v-belt milling machine model 31N2F (BS) is successfully carried out.", "venue": "Journal of Mechanical Engineering Science and Technology", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-11-15", "journal": {"name": "Journal of Mechanical Engineering Science and Technology (JMEST)"}, "authors": [{"authorId": "120197895", "name": "R. Rahman"}, {"authorId": "2191486893", "name": "Mohammad Faishol Erikyatna"}, {"authorId": "118089587", "name": "A. F. H. Soegiharto"}], "citations": []}
