{"paperId": "9894989da0b3e067db429133c140c01f683caf14", "publicationVenue": null, "title": "Aplicações de técnicas de machine learning nas áreas da Engenharia de Produção: uma revisão sistemática em eventos nacionais", "abstract": "As aplicações de técnicas de mineração de dados e de machine learning têm sido cada vez mais presentes em trabalhos acadêmicos e artigos científicos. Diversas áreas do conhecimento vêm sendo exploradas a partir de técnicas desta natureza, inclusive a Engenharia de Produção (EP). Esta pesquisa realizou uma revisão sistemática da literatura a partir das bases de artigos dos principais eventos da Engenharia da Produção no Brasil, no período de 2015 a 2020. Foi elaborado um protocolo de revisão e critérios de elegibilidade, resultando em 71 trabalhos qualificados e que foram analisados e discutidos. Os itens avaliados foram: frequência de publicações; instituições e rede de cooperação; autores; áreas mais exploradas da Engenharia da Produção; tarefas da mineração de dados; técnicas de machine learning e palavras mais frequentes. Como resultado, verificou-se que as áreas da EP mais exploradas em aplicações de machine learning são Gestão da Qualidade e Engenharia Econômica, com maior ênfase em tarefas de classificação e uso da técnica de Redes Neurais Artificiais.", "venue": "", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-10-30", "journal": null, "authors": [{"authorId": "2140303803", "name": "Edmilson Homma Junior"}, {"authorId": "2088151357", "name": "Marlon Alves Bomfim"}, {"authorId": "147902426", "name": "Ricardo Franco De Almeida Filho"}, {"authorId": "2035612449", "name": "A. D. Silva"}, {"authorId": "144597094", "name": "Bruno Samways dos Santos"}], "citations": []}
