{"paperId": "989763374e18665a84f3fe3311950788c30bf6a8", "publicationVenue": null, "title": "Improved regional frequency analysis of rainfall data", "abstract": "regional frequency analysis. The performance of our clustering algorithm is assessed on a detailed experimental design based on the extended Generalized Pareto distribution. Sensitivity to the number of clusters is carefully analyzed. We apply our clustering algorithm on Switzerland daily precipitation measured at 191 sites. The found homogeneous regions are consistent with local orography and our approach outperforms the classical regional frequency analysis based on normalized elevation and coordinates as covariates. To complete our analysis of Swiss rainfall, we propose three models based on our clustering outputs. A comparison between our local, semi-regional and regional models indicates that a relatively simple model with two clusters and a spatially varying scale parameter can compete very well against complex models.", "venue": "", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "123552862", "name": "P. L. Gall"}, {"authorId": "39392363", "name": "A. Favre"}, {"authorId": "2676940", "name": "P. Naveau"}, {"authorId": "24978807", "name": "C. Prieur"}], "citations": [{"paperId": "9ea5999b5449806e05f9ede98c20e697f2ba1970", "title": "Assessment of non-linear models based on regional frequency analysis for estimation of hydrological quantiles at ungauged sites in South Korea"}, {"paperId": "469c533f6c021c8560a68f629662636a4fceaee2", "title": "Estimation of Intensity‐Duration‐Area‐Frequency Relationships Based on the Full Range of Non‐Zero Precipitation From Radar‐Reanalysis Data"}, {"paperId": "47e3a87b3a251125fd05ac7573f9f43a218d33f4", "title": "Modeling Intensity‐Duration‐Frequency Curves for the Whole Range of Non‐Zero Precipitation: A Comparison of Models"}, {"paperId": "85a558326219f93f28d3531262f8baf796377660", "title": "Modelling of discrete extremes through extended versions of discrete generalized Pareto distribution"}, {"paperId": "e5065c5155f8ee465b0bbd8c9e1c14fa0ee21044", "title": "High return level estimates of daily ERA-5 precipitation in Europe estimated using regionalized extreme value distributions"}, {"paperId": "2619d2480e2d1bbe94e19fb3d34b128bac69b864", "title": "Performance-based comparison of regionalization methods to improve the at-site estimates of daily precipitation"}, {"paperId": "e96754b4127d0cddae6553c0ab7c043ef7539221", "title": "Non-parametric multimodel Regional Frequency Analysis applied to climate change detection and attribution"}]}
