{"paperId": "98a666e1fa13041268c6c21b3669057b4d68aee7", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Creating Knowledge Graphs Subsets using Shape Expressions", "abstract": "The initial adoption of knowledge graphs by Google and later by big companies has increased their adoption and popularity. In this paper we present a formal model for three different types of knowledge graphs which we call RDF-based graphs, property graphs and wikibase graphs. In order to increase the quality of Knowledge Graphs, several approaches have appeared to describe and validate their contents. Shape Expressions (ShEx) has been proposed as concise language for RDF validation. We give a brief introduction to ShEx and present two extensions that can also be used to describe and validate property graphs (PShEx) and wikibase graphs (WShEx). One problem of knowledge graphs is the large amount of data they contain, which jeopardizes their practical application. In order to palliate this problem, one approach is to create subsets of those knowledge graphs for some domains. We propose the following approaches to generate those subsets: Entity-matching, simple matching, ShEx matching, ShEx plus Slurp and ShEx plus Pregel which are based on declaratively defining the subsets by either matching some content or by Shape Expressions. The last approach is based on a novel validation algorithm for ShEx based on the Pregel algorithm that can handle big data graphs and has been implemented on Apache Spark GraphX.", "venue": "arXiv.org", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-10-22", "journal": {"name": "ArXiv", "volume": "abs/2110.11709"}, "authors": [{"authorId": "1729679", "name": "Jose Emilio Labra Gayo"}], "citations": [{"paperId": "6fe1b9a02e22730ab8b95fbb4bac490414b2d473", "title": "Wikidata subsetting: Approaches, tools, and evaluation"}, {"paperId": "572a3a656cbbc2f33707202e7af833cdfd1376d1", "title": "WShEx: A language to describe and validate Wikibase entities"}, {"paperId": "53d26eadb549c5c2b092a341a51c3607a00f5b3b", "title": "Shape Fragments"}, {"paperId": "08fb590b5e223195eca1a1c51565489b5635605d", "title": "Data Provenance for SHACL"}]}
