{"paperId": "98a904cf49e4383d4de954b2d776d19ff54e9068", "publicationVenue": {"id": "5857d727-45eb-4f03-9c71-889349e363a7", "name": "Geomatics, Natural Hazards & Risk", "type": "journal", "alternate_names": ["Geomatics, Natural Hazards and Risk", "Geomatics Nat Hazard  Risk", "Geomatics Nat Hazard Risk"], "issn": "1947-5705", "url": "http://www.informaworld.com/smpp/title~content=t913444127~db=all", "alternate_urls": ["https://www.tandfonline.com/toc/tgnh20/current", "http://www.tandfonline.com/TGNH"]}, "title": "Spatial and temporal evolution of post-disaster data for damage assessment of civil infrastructure systems", "abstract": "Abstract Assessing damage to civil infrastructure is a resource-intensive process that is critical during the response to a disaster. Various datasets facilitate this process but are often collected on an individual ad hoc basis by multiple separate entities. Consequently, there is a lack of a coordinated approach when collecting disaster data, which prevents effective data interoperability. Rather than viewing datasets individually, this paper provides a comprehensive analysis of post-disaster damage data to demonstrate the merits of a dynamic data collection process accounting for both spatial and temporal variations. Specifically, datasets from Hurricane Maria and the Indios Earthquake in Puerto Rico are used to illustrate the entities involved, resources used, and resulting datasets for this purpose. The paper analyzes the evolution of key metadata features as a function of time, including data availability, coverage, and resolution. The results show distinct stages of the data collection process and reveal challenges in collaboration between entities and a lack of data integration for disaster response. The findings also lead to recommendations about the essential metadata for increased shareability. With these outcomes, entities in the field can improve the quality of information extracted and facilitate interoperability and information integration across datasets for damage assessment.", "venue": "Geomatics, Natural Hazards & Risk", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-25", "journal": {"name": "Geomatics, Natural Hazards and Risk", "volume": "14"}, "authors": [{"authorId": "41222366", "name": "Jorge-Mario Lozano"}, {"authorId": "2138950808", "name": "Elliot Nichols"}, {"authorId": "121156930", "name": "J. Frost"}, {"authorId": "1957629", "name": "I. Tien"}], "citations": [{"paperId": "008e6d9e0d45f54cbc61405eeddc5c8da96e9472", "title": "Automated building damage assessment and large‐scale mapping by integrating satellite imagery, GIS, and deep learning"}]}
