{"paperId": "98aa2d61761cf190e8c0947fde8d6022923bd548", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Computational Sarcasm Analysis on Social Media: A Systematic Review", "abstract": "Sarcasm can be defined as saying or writing the opposite of what one truly wants to express, usually to insult, irritate, or amuse someone. Because of the obscure nature of sarcasm in textual data, detecting it is difficult and of great interest to the sentiment analysis research community. Though the research in sarcasm detection spans more than a decade, some significant advancements have been made recently, including employing unsupervised pre-trained transformers in multimodal environments and integrating context to identify sarcasm. In this study, we aim to provide a brief overview of recent advancements and trends in computational sarcasm research for the English language. We describe relevant datasets, methodologies, trends, issues, challenges, and tasks relating to sarcasm that are beyond detection. Our study provides well-summarized tables of sarcasm datasets, sarcastic features and their extraction methods, and performance analysis of various approaches which can help researchers in related domains understand current state-of-the-art practices in sarcasm detection.", "venue": "arXiv.org", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-09-13", "journal": {"name": "ArXiv", "volume": "abs/2209.06170"}, "authors": [{"authorId": "2184725449", "name": "Faria Binte Kader"}, {"authorId": "2184725240", "name": "Nafisa Hossain Nujat"}, {"authorId": "2184725427", "name": "Tasmia Binte Sogir"}, {"authorId": "2055992598", "name": "Mohsinul Kabir"}, {"authorId": "144453624", "name": "H. Mahmud"}, {"authorId": "2152077725", "name": "Md. Kamrul Hasan"}], "citations": [{"paperId": "4a7b2fb3bd06b3a992b50dc3d9faa92f5005b8bd", "title": "Detecting Sarcasm in Reddit Comments: A Comparative Analysis"}, {"paperId": "482f6d809a2691d7c0a97c2033af3b44bc98082d", "title": "Text-based Sarcasm Detection on Social Networks: A Systematic Review"}]}
