{"paperId": "98ac6ab21def7f6e1b80c0be62ccfc0b594bfc57", "publicationVenue": {"id": "28a83bf1-b6e5-416f-8c5a-fdc53e54f3a1", "name": "International Conference on Automation and Computing", "type": "conference", "alternate_names": ["IEEE International Conference on Autonomic Computing", "IEEE Int Conf Auton Comput", "Int Conf Autom Comput", "ICAC", "International Conference on Autonomic Computing", "Int Conf Auton Comput"], "url": "http://www.wikicfp.com/cfp/program?id=1269", "alternate_urls": ["https://acsos.github.io/"]}, "title": "Network-Adaptive Scheduling of Data-Intensive Parallel Jobs with Dependencies in Clusters", "abstract": "The performance of data-intensive parallel jobs is often constrained by the cluster's hard-to-scale network bisection bandwidth. Previous solutions do not consider inter-job data dependencies and schedule jobs independently from one another. In this work, we find that aggregating and co-locating the data and tasks of dependent jobs offers an extra opportunity of data locality that can help to greatly enhance the performance of clusters and jobs. We propose and design Dawn, a network-adaptive scheduler that includes an online plan and an adaptive task scheduler for jobs with dependencies. The online plan, taking job dependencies into consideration, determines preferred locations (e.g., racks) for tasks to proactively aggregate dependent data. The task scheduler, based on the output of online plan and dynamic network bandwidth status, adaptively schedule tasks to co-locate with the dependent data in order to take advantage of data locality. We implement Dawn on Apache Yarn and evaluate it on clusters using various benchmark workloads. Results show that Dawn effectively improves system throughput by 42-51% and 21-28% compared to Fair Scheduler and ShuffleWatcher, respectively.", "venue": "International Conference on Automation and Computing", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2017-07-01", "journal": {"name": "2017 IEEE International Conference on Autonomic Computing (ICAC)", "pages": "155-160"}, "authors": [{"authorId": "1891284", "name": "Shaoqi Wang"}, {"authorId": "46224002", "name": "Xiaobo Zhou"}, {"authorId": "2108910966", "name": "Liqiang Zhang"}, {"authorId": "145181317", "name": "Changjun Jiang"}], "citations": [{"paperId": "02c6926a190df8dbd0d8f7403e0ef8b0f7c59a40", "title": "Diktyo: Network-Aware Scheduling in Container-Based Clouds"}, {"paperId": "c170deb79a0df6579f1497234adcf901d993db0f", "title": "Overlapping Communication With Computation in Parameter Server for Scalable DL Training"}, {"paperId": "8c03332288c663ac80162dcccdd6ec4985ed44e2", "title": "Dependency-Aware Network Adaptive Scheduling of Data-Intensive Parallel Jobs"}, {"paperId": "b85206105603a65b3108f84ca92067f928951aca", "title": "Reference-distance Eviction and Prefetching for Cache Management in Spark"}, {"paperId": "a6e9f6173da2fa22b8e01009da3389dc9a75f44c", "title": "Baran"}]}
