{"paperId": "98b7c9fd42e0260c922428d40e369737fd62e26e", "publicationVenue": {"id": "89097a03-8be6-4e2d-ae2c-a6df64c77a06", "name": "Frontiers in Psychology", "type": "journal", "alternate_names": ["Front Psychol"], "issn": "1664-1078", "url": "http://www.frontiersin.org/Cultural_Psychology", "alternate_urls": ["http://frontiersin.org/psychology/", "https://www.frontiersin.org/journals/psychology", "http://journal.frontiersin.org/journal/psychology", "http://www.frontiersin.org/psychology"]}, "title": "Constructing a Hierarchical Framework for Assessing the Application of Big Data Technology in Entrepreneurship Education", "abstract": "The emergence of big data technology continues to innovate and change the world, bringing opportunities and challenges to all walks of life. Against the background of this era, traditional entrepreneurship education requires reform and innovation. This research attempts to explore the ways and practices of applying big data technology to entrepreneurship education so as to improve and perfect traditional entrepreneurship education and achieve its sustainable development. Based on classic theories, such as entrepreneurial theory, strategic management theory, and leadership theory, this paper develops a relatively systematic attribute system of entrepreneurship education under big data technology, comprehensively uses Fuzzy-DEMATEL and ISM methods to explore the relationship between different attributes and their importance, and finally constructs a hierarchical framework for the application of big data technology in entrepreneurship education. The results show that the attributes of entrepreneurship education under big data technology can be divided into four levels, each with different priorities and degrees of importance, and there are complex interactions and constraints among them. This study provides important guidance and suggestions for the development of entrepreneurship education and multiattribute decision-making management under the given resources, which is conducive to the sustainable development of entrepreneurs and new ventures.", "venue": "Frontiers in Psychology", "year": 2020, "fieldsOfStudy": ["Medicine", "Psychology"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-09-11", "journal": {"name": "Frontiers in Psychology", "volume": "11"}, "authors": [{"authorId": "81975324", "name": "Hongjia Ma"}, {"authorId": "2055383668", "name": "Chunting Lang"}, {"authorId": "2152797815", "name": "Yang Liu"}, {"authorId": "1491072071", "name": "Yang Gao"}], "citations": [{"paperId": "4b27ebde8496e4efe4a2eb4201e84e54caea3591", "title": "Innate green propensity: Precursors of ecopreneurial intentions among Indonesian Education Human Resources University"}, {"paperId": "475b092d79c179e1737e2e9ace9dadc02c4a7c1b", "title": "Artificial intelligence in entrepreneurship education: a scoping review"}, {"paperId": "3bd6f4dfe4855199f00ce80298591d5122880e0e", "title": "ChatGPT for Founding Teams: An Entrepreneurial Pedagogical Innovation"}, {"paperId": "08c4f47ee5d7b41dafa05426119b6c39bbf22d80", "title": "Exploring the Path of Teacher Team Building for Innovation and Entrepreneurship in Colleges and Universities in the Information Age"}, {"paperId": "0ec99ccdd4b55905403c6087a3d79f0890d7dba0", "title": "Construction and Implementation of Innovation and Entrepreneurship Education System in Colleges and Universities in the Internet Era"}, {"paperId": "33549ace6c47c5b12e6e6bed175910ae6f469018", "title": "Exploring the Methods and Paths of Integrating Entrepreneurship and Innovation Education into Applied Undergraduate Education"}, {"paperId": "78eff4ffd31e4917650905333f6db6919d74cbd6", "title": "Research on the Construction of University Cultural Brand IP Driven by Network Cloud Platform Technology"}, {"paperId": "54440b41f1e658e1ed607bb2820b5c20ef8734e7", "title": "The construction of a new model for the development of innovation and entrepreneurship education in economic and management colleges and universities under the Kruskal algorithm of numerical analysis"}, {"paperId": "a8efa623bc835d52e3e298e2c854996b0fc2d265", "title": "The role of transformational leadership and institutional entrepreneurship in organizational change in Indian public organizations"}, {"paperId": "314f00ccc657041e2b4ef868a46efbb36d60d496", "title": "How do entrepreneurs perform digital marketing across the customer journey? A review and discussion of the main uses"}, {"paperId": "84e49d646d8d32ab92a396cfa5ac1b5ae9f9a7ca", "title": "The Potential of Big Data Application in Mathematics Education in Malaysia"}, {"paperId": "239c13d81f934bd199eb9803dc5d71152924dfac", "title": "The Impact of Entrepreneurship Education of Entrepreneurs on the Entrepreneurial Psychology of Sports Majors From the Perspective of Pedagogy"}, {"paperId": "450a615cd464c9fd1367986c4c0c809b502744b8", "title": "EMBEDDING ENTREPRENEURIAL VALUES IN NON-ENTREPRENEURIAL SUBJECTS"}]}
