{"paperId": "98bbcd969d7d18265acdec72b22987676bbf10f4", "publicationVenue": null, "title": "Computation Offloading in Mobile Edge Computing for Next Generation Networks: A deep reinforcement learning approach", "abstract": "The next generation network 5G and beyond will provide higher speed, greater capability and lower latency for high-end technologies like augmented reality, online gaming, robotic arm surgery, high-quality video streaming, etc. Mobile Edge Computing (MEC) brings computing, storage and networking resources closer to the end user to host the compute-intensive and latency-sensitive applications at the edge of the network. Presently, the UAV-equipped Mobile Edge Computing (MEC) system provides computation services to mobile devices on the ground. However, the issue of processing delay and energy consumption in the task offloading process needs to be addressed. In the present paper, a novel Deep Deterministic Policy Gradient (DDPG) based approach is proposed that shall reduce the processing time by simultaneously improving user scheduling, resource allotment and UAV maneuverability, and formulating computation offloading problem as a high non-convex objective function. The performance of the suggested approach is demonstrated by simulation results using real-world parameters and the obtained results are compared to state-of-the-art algorithms.", "venue": "2023 International Conference for Advancement in Technology (ICONAT)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-01-24", "journal": {"name": "2023 International Conference for Advancement in Technology (ICONAT)", "pages": "1-8"}, "authors": [{"authorId": "2213547351", "name": "Shrey Dhiman"}, {"authorId": "2186201176", "name": "Amita Chauhan"}, {"authorId": "2213542423", "name": "Sakshi Kasuhal"}, {"authorId": "2286123931", "name": "H. Kumar"}], "citations": [{"paperId": "6c01d8dd0d79b6ff06a14e7ae9673e86382a6f27", "title": "Task Offloading Strategy for Unmanned Aerial Vehicle Power Inspection Based on Deep Reinforcement Learning"}]}
