{"paperId": "98c5ddb9f58f749bbbb42c5c1fe7e5d572761bff", "publicationVenue": {"id": "76da9cc5-c5a7-42b4-a250-3e708c5f4980", "name": "BMC Medical Informatics and Decision Making", "type": "journal", "alternate_names": ["BMC Med Informatics Decis Mak"], "issn": "1472-6947", "url": "http://www.biomedcentral.com/bmcmedinformdecismak/", "alternate_urls": ["https://bmcmedinformdecismak.biomedcentral.com/", "https://link.springer.com/journal/12911", "http://www.pubmedcentral.nih.gov/tocrender.fcgi?journal=42"]}, "title": "HealtheDataLab – a cloud computing solution for data science and advanced analytics in healthcare with application to predicting multi-center pediatric readmissions", "abstract": null, "venue": "BMC Medical Informatics and Decision Making", "year": 2020, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-06-19", "journal": {"name": "BMC Medical Informatics and Decision Making", "volume": "20"}, "authors": [{"authorId": "1822571", "name": "L. Ehwerhemuepha"}, {"authorId": "1752901866", "name": "Gary Gasperino"}, {"authorId": "1752900858", "name": "Nathaniel Bischoff"}, {"authorId": "16162495", "name": "S. Taraman"}, {"authorId": "1498522681", "name": "Anthony Chang"}, {"authorId": "12608598", "name": "W. Feaster"}], "citations": [{"paperId": "0f77879ca41441275f0c420c3e72ef1a117ff6dc", "title": "Machine learning for hospital readmission prediction in pediatric population."}, {"paperId": "90caf5e5b043a2a92e7204cf8366a71804ce25bb", "title": "Diabetes prediction using Shapley additive explanations and DSaaS over machine learning classifiers: a novel healthcare paradigm"}, {"paperId": "26404241ab4505624f8bf40492b36148c2572315", "title": "Chronic Cough: Characterizing and Quantifying Burden in Adults Using a Nationwide Electronic Health Records Database"}, {"paperId": "e29558ec1b5d6fa330e57b983a5d4a181608530e", "title": "Association rule mining of real-world data: Uncovering links between race, glycemic control, lipid profiles, and suicide attempts in individuals with diabetes"}, {"paperId": "44815f53990732191cd53ae0ca989a7933cdcfe1", "title": "Chronic Neurological Disorders and Predisposition to Severe COVID-19 in Pediatric Patients in the United States."}, {"paperId": "3583c216ce74876f2e8c02f469bec35faab4a9a6", "title": "Controller therapy attenuates asthma exacerbations associated with prior SARS-CoV-2 infection in children"}, {"paperId": "327b7e77fe4e78d1cd55189eaeea21c7617f4379", "title": "Quantifying care delivery team influences on the hospitalization outcomes of patients with multimorbidity: Implications for clinical informatics"}, {"paperId": "afe8409b7364345d1f4129bf96039dcfe8d10158", "title": "An Overview on the Challenges and Limitations Using Cloud Computing in Healthcare Corporations"}, {"paperId": "d03277c9458312a88f2c6233cc9c6210c7964467", "title": "Prediction of readmissions in hospitalized children and adolescents by machine learning"}, {"paperId": "ad882d83584a5985e30c04caccfb9767fa3fce48", "title": "A Methodology for a Scalable, Collaborative, and Resource-Efficient Platform, MERLIN, to Facilitate Healthcare AI Research"}, {"paperId": "f2efbe86482a46b7093966e19e41e7a35f8c50fd", "title": "Predicting suicide attempts among people with diabetes using a large multicenter electronic health records dataset"}, {"paperId": "7ec8dfcd41a5c6d38a24aeea0dff8816711ca86f", "title": "On the building of efficient self-adaptable health data science services by using dynamic patterns"}, {"paperId": "cdb5e1ddd8e60ae239d98d1c91e7d6f453d54e83", "title": "Systematic analysis of healthcare big data analytics for efficient care and disease diagnosing"}, {"paperId": "0852f2618b4073659b852128a1bb86a7c24815d7", "title": "Impact of diabetes status and related factors on COVID-19-associated hospitalization: A nationwide retrospective cohort study of 116,370 adults with SARS-CoV-2 infection"}, {"paperId": "1dcdf9b32615deea98d53cb67922ad3b3978bf2a", "title": "Birth Weight and Gestational Age as Modifiers of Rehospitalization after Neonatal Intensive Care Unit Admission"}, {"paperId": "02469b0598feb79acbbb55d1521ea1df3eba2073", "title": "Security enhancement of the cloud paradigm using a novel optimized crypto mechanism"}, {"paperId": "49a4d8dd01bb1159328cc5c1b190f6b1dae3ac2d", "title": "Timely orchiopexy by 18 months of age: Are we meeting the standards defined by the 2014 AUA guidelines?"}, {"paperId": "0c0925c6f5082ba2f392bb6fc48973bddc293120", "title": "Evolutionary Trends in Progressive Cloud Computing based Healthcare: Ideas, Enablers, and Barriers"}, {"paperId": "62c3d958c97785c0fb1106f2131041813038cded", "title": "Association of Congenital and Acquired Cardiovascular Conditions With COVID-19 Severity Among Pediatric Patients in the US"}, {"paperId": "1faeccc93aa4fe24ad2b0c624b98401c8c0f790a", "title": "COVID-19 infection may trigger poor asthma control in children"}, {"paperId": "ba3e96f5d69e2527302044b6bfda7beda5cea580", "title": "Cerner real-world data (CRWD) - A de-identified multicenter electronic health records database"}, {"paperId": "f045d175103939b74b8976de1e4989917c9e4756", "title": "Five Cases of Charcot-Marie-Tooth Disease With Positive COVID-19 Infection Reported Using Cerner Real-World Data™."}, {"paperId": "3b503ce808b30a6b2e9660822d7099fa22c6c281", "title": "Applicability of predictive models for 30-day unplanned hospital readmission risk in paediatrics: a systematic review"}, {"paperId": "d5c74646d175564cdbde48bf728a551554519ecd", "title": "Coronavirus Disease 2019 (COVID-19) Disease Severity: Pregnant vs Nonpregnant Women at 82 Facilities."}, {"paperId": "d630fb39d1eadfd694935c08fc7e2b38da811d18", "title": "Standardized Health data and Research Exchange (SHaRE): promoting a learning health system"}, {"paperId": "89c506eb1c9a4ac860e7e2b434db46b64c7b4cfe", "title": "A Methodology for a Scalable, Collaborative, and Resource-Efficient Platform to Facilitate Healthcare AI Research"}, {"paperId": "beb49d9b0abcb6fcb8846d030a47c514577561cc", "title": "Electronic Health Record Network Research in Infectious Diseases"}, {"paperId": "7d20a74b15c6d817f75336932bdabede463d1115", "title": "Targeted Clinical Interventions for Reducing Pediatric Readmissions."}, {"paperId": "b279f2624a4646e17ac1deb4a6a9b56aa7cf2c4b", "title": "Cloud-based genomics pipelines for ophthalmology: reviewed from research to clinical practice"}, {"paperId": "a5b631e82d68e4e3c8a9b57c7c5eaa817cedb8e7", "title": "Long-term effects of malnutrition on severity of COVID-19"}, {"paperId": "fbb15c69188aa34c93694a15d39a1ef9d15a4f08", "title": "Development of an application concerning fast healthcare interoperability resources based on standardized structured medical information exchange version 2 data"}, {"paperId": "d52919f791db6ba48a0f580b83a453d6f85ac609", "title": "Opioid use disorder and health service utilization among COVID-19 patients in the US: A nationwide cohort from the Cerner Real-World Data"}, {"paperId": "ee99341707e0d0d88c062fc8daa12241d07b4e76", "title": "A Cerner Real-World Data Study of Spinal Muscular Atrophy Patients With Positive COVID-19 Infection."}, {"paperId": "11078ceb33352f73a577baa4b8fffa84043c3fa6", "title": "Racial disparities in COVID-19 outcomes exist despite comparable Elixhauser comorbidity indices between Blacks, Hispanics, Native Americans, and Whites"}, {"paperId": "187e7fb6277652fc27d1b7b8a83b8cb185067016", "title": "Development and validation of an early warning tool for sepsis and decompensation in children during emergency department triage"}, {"paperId": "fa97e8ce59566f203c5a4c8c2cf0c44914f6c49c", "title": "The risk of clinical complications and death among pregnant women with COVID-19 in the Cerner COVID-19 cohort: a retrospective analysis"}, {"paperId": "9518537d31b61693929a0a6f3ac900125db8fbaf", "title": "Medication Use Among Patients With COVID‐19 in a Large, National Dataset: Cerner Real‐World Data™"}, {"paperId": "4856ff82ddeed14d57fc9bda0c4fb820e4a7d65e", "title": "Smart Wearables for Cardiac Monitoring—Real-World Use beyond Atrial Fibrillation"}, {"paperId": "c4828ac5a106d377757ed4e7f207b072a07bca79", "title": "A super learner ensemble of 14 statistical learning models for predicting COVID-19 severity among patients with cardiovascular conditions"}, {"paperId": "9dcf605fc3d25de98b832c87949a6a076befcd68", "title": "Impact of COVID- 19 Infection Among Hospitalized Amyotrophic Lateral Sclerosis Patients"}, {"paperId": "459429a24a63e9587f80986d5cf90c32a565cb03", "title": "Multicenter study of risk factors of unplanned 30‐day readmissions in pediatric oncology"}, {"paperId": "5068091ad5da131cbdc447851675b941b6b15b0b", "title": "Validity of the LACE index for identifying frequent early readmissions after hospital discharge in children"}, {"paperId": "29a667498af6ea37c22618944c94ac7b7074b317", "title": "Health Services and Mortality Among Opioid Use Disorder Patients Diagnosed with COVID-19"}, {"paperId": "8344e4280c574df3a73f9a665e3ba0e8fa3efdf4", "title": "Predictors of pediatric readmissions among patients with neurological conditions"}, {"paperId": "6189bda32ca48252241f46be8b8609f92ee5efdb", "title": "Next-generation Blockchain-Enabled Virtualized Cloud Security Solutions: Review and Open Challenges"}, {"paperId": "7f956d643c6fd7401dcc2986097ec29517834f3a", "title": "Race, Ethnicity, and Insurance: the Association with Opioid Use in a Pediatric Hospital Setting"}, {"paperId": "1a1520254a0c72ea4de1c8b88eeb8c6456d938a3", "title": "A Nested Mixed Effects Multicenter Model Examining the Risk Factors for Pediatric Trauma Return Visits Within 72 h."}, {"paperId": "909ebf31f9e96f29348c42dd980603ff7fe9259c", "title": "Collaborative Cloud Computing Framework for Health Data with Open Source Technologies"}, {"paperId": "6e9cae7cb9109ccf489e02e8bc459b34c48f586e", "title": "How AI Analytical Models Can Use FHIR (Fast Healthcare Interoperability Resources) Data"}, {"paperId": "6bdfcd742ff2c71f2167b53fb30518db18d65655", "title": "Emerging Technologies for Next Generation Remote Health Care and Assisted Living"}]}
