{"paperId": "98c75c5c3c7290b0a086403bc48e317cd6513cc4", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Toward an Integrated Disaster Management Approach: How Artificial Intelligence Can Boost Disaster Management", "abstract": "Technical and methodological enhancement of hazards and disaster research is identified as a critical question in disaster management. Artificial intelligence (AI) applications, such as tracking and mapping, geospatial analysis, remote sensing techniques, robotics, drone technology, machine learning, telecom and network services, accident and hot spot analysis, smart city urban planning, transportation planning, and environmental impact analysis, are the technological components of societal change, having significant implications for research on the societal response to hazards and disasters. Social science researchers have used various technologies and methods to examine hazards and disasters through disciplinary, multidisciplinary, and interdisciplinary lenses. They have employed both quantitative and qualitative data collection and data analysis strategies. This study provides an overview of the current applications of AI in disaster management during its four phases and how AI is vital to all disaster management phases, leading to a faster, more concise, equipped response. Integrating a geographic information system (GIS) and remote sensing (RS) into disaster management enables higher planning, analysis, situational awareness, and recovery operations. GIS and RS are commonly recognized as key support tools for disaster management. Visualization capabilities, satellite images, and artificial intelligence analysis can assist governments in making quick decisions after natural disasters.", "venue": "Sustainability", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2021-11-13", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "16057932", "name": "S. K. Abid"}, {"authorId": "81932865", "name": "N. Sulaiman"}, {"authorId": "2107302144", "name": "S. Chan"}, {"authorId": "2067217350", "name": "U. Nazir"}, {"authorId": "2144922283", "name": "Muhammad Abid"}, {"authorId": "144910498", "name": "Heesup Han"}, {"authorId": "1402063673", "name": "Antonio Ariza-Montes"}, {"authorId": "1410685426", "name": "Alejandro Vega-Muñoz"}], "citations": [{"paperId": "c04bc55f7ce0614fa9775499509ad08f37bcc436", "title": "Exploring Innovative Techniques for Damage Control During Natural Disasters"}, {"paperId": "c4d7c84b470be9ef31b6571a0267d1f3162c58f6", "title": "Flood, fires, and drought: Do we have the tools to risk-assess for environmental management of extreme climatic events?"}, {"paperId": "8e5464c73ef9fc26c00c9bb4b39c3b7bae1a8797", "title": "Towards optimal decision making in mass casualty incidents management through ICT: A systematic review"}, {"paperId": "be9b3d441ecfc414afebff2e381cd11b1536ba44", "title": "Because Life Matters- A Disaster Management Web Application"}, {"paperId": "1976b10f49fadd45fb109cec9403bfafee07a42c", "title": "Mapping Industrial Influences on Earth's Ecology"}, {"paperId": "2f6e493daf88e83007ab1f0abd45b80e04fa8d87", "title": "Landslide Disaster Assessment with Integration of Seismic, Social Media and Remote Sensing Data"}, {"paperId": "53ad00ac02f6b9f0d1c5deb7e3d458efa599a171", "title": "Disaster management ‘deeds’ in the context of April 2022 KwaZulu-Natal floods: A scoping review"}, {"paperId": "8e91d40f09451d60889eac91184cf643354b8603", "title": "Applications and challenges of artificial intelligence in the field of disaster prevention, reduction, and relief"}, {"paperId": "7edc8eae969700caeb480ae3c124bb84d10700bb", "title": "Deciphering Academicians' Usage of Artificial Intelligence among Academicians in Higher Education Institutions"}, {"paperId": "7f8df8fee3093e718619e3a184c3ed6497d9255d", "title": "Remote Sensing applications for effective fire disaster management plans: A review"}, {"paperId": "2b06cdff83139e25159292a88b75c55c4bbd65a9", "title": "Precipitation forecasting: from geophysical aspects to machine learning applications"}, {"paperId": "93c73e5dde158165260a8ba003247b7597eded52", "title": "Present and Future of Artificial Intelligence in Disaster Management"}, {"paperId": "efdee222c217c27c342550b04af37bcdf847d660", "title": "On the emergence of geospatial cloud-based platforms for disaster risk management: A global scientometric review of google earth engine applications"}, {"paperId": "08a8b2868e04b9c9c432e4c7a9df6b1653bec444", "title": "Transforming ground disaster response: Recent technological advances, challenges, and future trends for rapid and accurate real-world applications of survivor detection"}, {"paperId": "86b0b0c13954f5126f22eb1e74dbdfea930fddbd", "title": "Predicting Unmet Healthcare Needs in Post-Disaster: A Machine Learning Approach"}, {"paperId": "93755ff5d2bdbba726f2f6c7840ddafce6810fda", "title": "Technological Innovations for Enhancing Disaster Resilience in Smart Cities: A Comprehensive Urban Scholar’s Analysis"}, {"paperId": "9eb4ba62c47a8cc9748538554bff2bed03e63a5a", "title": "Acceptance of Mobile Application on Disaster Preparedness: Towards Decision Intelligence in Disaster Management"}, {"paperId": "c08ee4397d44f71b3ebb8d51a96e701e7b90c4c6", "title": "An Enhanced Framework for Disaster-Related Tweet Classification using Machine Learning Techniques"}, {"paperId": "a046acb7d0f8e0d74f68edc819d2f864cdf85c62", "title": "Multi-Scale and Context-Aware Framework for Flood Segmentation in Post-Disaster High Resolution Aerial Images"}, {"paperId": "d3b7dd1ebf5230503482afea2a255b14333e6c16", "title": "Artificial Intelligence, Machine Learning and Deep Learning in Advanced Robotics, A Review"}, {"paperId": "31b8602590c897ac4177c2faef8e9ce0031ff9bf", "title": "Algorithmic Urban Planning for Smart and Sustainable Development: Systematic Review of the Literature"}, {"paperId": "aaaeed6262ae30df9fb6ebcc94a35f3aa06b402c", "title": "An Adaptive Deep Q-Learning Strategy for Routing Schemes in SDN-Based Data Centre Networks"}, {"paperId": "74bed3470a13822e68324fc84a5f7a97e431a65f", "title": "Manufacturing strategy 4.0: a framework to usher towards industry 4.0 implementation for digital transformation"}, {"paperId": "f420745802d74cab07171ab07b6c4bd71cf58d3a", "title": "Medical informatics and climate change: a framework for modeling green healthcare solutions"}, {"paperId": "c49c79092e685525ce6ad528a6b29914e9542076", "title": "AI Augmentation to Remote Sensing Imagery in Forestry Conservation & Restoration for Increased Responsive Capabilities"}, {"paperId": "65db60a8626283df3e11db9dab43f107f600638d", "title": "The mediating role of green innovation and green culture in the relationship between green human resource management and environmental performance"}, {"paperId": "33144f373c9916ee817a316d94805f2b99eed5cf", "title": "State of the art in risk sensitive urban development: A systematic literature review."}, {"paperId": "b0dfc7de78fedbda12887e73ff0f5d07d428c3f4", "title": "Sustainability Model to Select Optimal Site Location for Temporary Housing Units: Combining GIS and the MIVES–Knapsack Model"}, {"paperId": "1c13b8b4678231c48d85428e8afc7571c584e2db", "title": "A systematic review of the flood vulnerability using geographic information system"}, {"paperId": "4e9bce76d80fb76945a092af4a3f42669476e487", "title": "Comparison of EO4Agri Recommendations With In-Depth Literature Review"}, {"paperId": "7d4974ab9363efdaf836e3491a975352838e4af8", "title": "Leadership Strategies to Closing the Critical Skills Gap: A Review"}, {"paperId": "d1bbf5ce48ab7ecff55eb30d2cd1ce961bb6425e", "title": "Machine Learning for Smart Cities: A Comprehensive Review of Applications and Opportunities"}, {"paperId": "aeb9d06a038baa69630d1e597d6ddf63fe606151", "title": "Evaluation and Prediction Method of System Security Situational Awareness Index Based on HMM Model"}, {"paperId": "0f29363b0cda333630842204fa89fd6a47420cc0", "title": "Natural Disasters and Artificial Intelligence"}, {"paperId": "a363310af6f7e808136927a305eacf53ae9f6c57", "title": "International Journal of Disaster Risk Reduction"}, {"paperId": "da633798ec451d7fae28f7b909e0b3c3aaf64fdf", "title": "Review of Artificial Intelligence Applications in the Geomatics Field"}]}
