{"paperId": "98cfe786cf7829c6177b00ec052eebe260d4df63", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Farmers’ Transition to Climate-Smart Agriculture: A Systematic Review of the Decision-Making Factors Affecting Adoption", "abstract": "Agriculture is currently facing major challenges related to ensuring the food security of a rising population and climate change with extreme weather patterns. At the same time, agriculture is a cause of environmental degradation, pollution and biodiversity loss. Climate-smart agriculture (CSA) is proposed as an approach that provides a roadmap to sustainable agricultural development. Despite this, farmer adoption rates of CSA practices and technologies in Europe remain low. This paper seeks to systematically review and synthesize the factors that facilitate or hinder farmers’ uptake of CSA in Europe. Out of the 2827 articles identified in the Web of Science and Scopus databases, a total of 137 research articles were included for analysis following the PRISMA methodology. The factors are categorized into seven categories, namely socio-demographics, psychological, farm characteristics, practice/technology-related attributes, biotic/abiotic, systemic and policy factors, with the majority of the studies focusing on the first four categories, while systemic and policy factors are relatively understudied. The results highlight for the first time that the adoption of CSA does not depend solely on farmer characteristics but also on the food systems and structures in which farmers operate, as well as the interactions with other value chain actors. To promote the adoption of CSA practices, extension and advisory services along with access to timely and reliable information, play a vital role in increasing awareness and in the provision of training and the encouragement of farmers’ behavioral shifts towards sustainable practices. From a technological point of view, adapting technologies to be easy to use, compatible with current farming objectives and cost-efficient will render them less risky investments for farmers and will foster adoption rates. Finally, support from the government in terms of financial support, subsidies and reduced bureaucratic procedures is crucial for motivating CSA adoption.", "venue": "Sustainability", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2024-03-28", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "117940472", "name": "Marilena Gemtou"}, {"authorId": "2278947846", "name": "Konstantina Kakkavou"}, {"authorId": "152939956", "name": "E. Anastasiou"}, {"authorId": "15315211", "name": "S. Fountas"}, {"authorId": "2237265317", "name": "Soren Marcus Pedersen"}, {"authorId": "121470179", "name": "Gohar Isakhanyan"}, {"authorId": "2244377387", "name": "Kassa Tarekegn Erekalo"}, {"authorId": "2095611478", "name": "Serafin Pazos-Vidal"}], "citations": []}
