{"paperId": "98d198f56e35a4c56d0af27381cf8e516bac78cb", "publicationVenue": {"id": "ba7de444-00de-47dc-a1f2-03e69cd83604", "name": "Engineering Management Journal", "type": "journal", "alternate_names": ["Eng Manag J"], "issn": "1042-9247", "url": "http://www.tandfonline.com/loi/uemj20"}, "title": "Readiness and Maturity of Smart and Sustainable Supply Chains: A Model Proposal", "abstract": "Abstract Many companies embrace Industry 4.0 technologies to enable operational sustainability against increasing climate change effects, decreasing natural resources, and raising consumer awareness of environmental issues. Even though readiness and maturity assessment of smartness and sustainability concepts are nested, no study simultaneously focuses on these concepts. As pioneering research, we propose a novel model titled “Smart and Sustainable Supply chain Readiness and Maturity model (S3RM)” and validate it by conducting a case study in the automotive industry. We design our model upon the triple-bottom-line (TBL) approach consisting of smartness and sustainability dimensions. Our study introduces the TBL of smartness covering availability, integrity, and adaptability sub-dimension. TBL of sustainability includes social, environmental, and economic sub-dimensions. The proposed model calculates the Smart and Sustainable Readiness and Maturity Index by averaging sustainability scores’ summation and smartness scores’ multiplication. Each sub-dimension consists of items measured by a readiness and maturity scale. The findings suggest how smartness and sustainability items create strengths, weaknesses, opportunities, and threats for the supply chain operations. Our model provides managerial implications in assessing the readiness and maturity of Industry 4.0 tools and sustainability indicators. This study offers a road map to managers on smart and sustainable supply chains’ defined target areas.", "venue": "Engineering Management Journal", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-03-24", "journal": {"name": "Engineering Management Journal", "pages": "181 - 206", "volume": "35"}, "authors": [{"authorId": "32159325", "name": "Sercan Demir"}, {"authorId": "2137423817", "name": "Mehmet Akif Gunduz"}, {"authorId": "2926883", "name": "Yasanur Kayikci"}, {"authorId": "2626951", "name": "T. Paksoy"}], "citations": [{"paperId": "417c9a091aa3076a1f9723207516ea5c919fc0c0", "title": "Combining digitalization and sustainability: unveiling the relationship of digital maturity degree, sustainable supply chain management practices and performance"}, {"paperId": "fec4da71fe0a40b0fbda371378d343f3a4f8053c", "title": "Industry 4.0 Driven Green Supply Chain Management in Renewable Energy Sector: A Critical Systematic Literature Review"}, {"paperId": "89b01f439cf85283cb3cffb15a67d2740cb1a141", "title": "Trends and Recommendations for Enhancing Maturity Models in Supply Chain Management and Logistics"}, {"paperId": "a4f8a8492dbc60ac793d593b365030557395f463", "title": "A decision support system for classifying supplier selection criteria using machine learning and random forest approach"}, {"paperId": "24e40697d521c8e7c60ff2cc734f57df6494823b", "title": "Exploring Lean Practices’ Importance in Sustainable Supply Chain Management Trends: An Empirical Study in Canadian Construction Industry"}]}
