{"paperId": "98e06be97dafb39b8d05bc1a17e52dd4e449fe89", "publicationVenue": null, "title": "Real-Time Analysis of Students’ Activities on an E-Learning Platform based on Apache Spark", "abstract": "Real time analytics is the capacity to extract valuables insights from data that comes continuously from activities on the web or network sensors. It is largely used in web based business to drive decisions based on user’s experiences, such dynamic pricing and personalized advertising. Many universities have adopted web based learning in their learning process. They use data-mining techniques to better understand students’ behavior, and most of the tools developed are based on historical and stored data, and do not allow real time reactivity. Online activities of learners generate at high speed a huge amount of data in form of users’ interactions which have all characteristics to be considered as Big data. Deal with volume and velocity of these data in order to inform and enable decisions-makers to act at right time lead us to use new methods to capture E-Learning data, and process it in real time.\nThis paper focuses on the design and implementation of modern and hybrid real time data pipeline architecture using Apache Flume to collect data, Apache Spark as an unified engine computation for performing analytics on students’ activities data and Apache Hive as a data warehouse for storing the processed data and for use by various reporting tools. To conceive this platform we conduct an experiment on Moodle database source.", "venue": "", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": null, "journal": {"name": "International Journal of Advanced Computer Science and Applications", "volume": "8"}, "authors": [{"authorId": "2018954", "name": "Abdelmajid Chaffai"}, {"authorId": "21637154", "name": "L. Hassouni"}, {"authorId": "3434413", "name": "H. Anoun"}], "citations": [{"paperId": "752da8e93d8da7941eab2ead37ebbed6462c2453", "title": "A study on computing and e-learning in the perspective of distributed models"}, {"paperId": "d883476f6a4be6f07184ba49c2b55fbcdda2d923", "title": "Development of Mathematics Web-based Learning on Table Set-Up Activities"}, {"paperId": "d69a129e2e3b1b93ec2ff4d013d9855a916119e8", "title": "Nature inspired clustering and indexing of learning objects based on learners cognitive skills"}]}
