{"paperId": "98e6c589a1a5648e8851c3567320709351d7cd73", "publicationVenue": null, "title": "Privacy-preserving federated learning with various computer-vision tasks for security applications", "abstract": "Federated learning (FL) is a hot research topic enabling training on databases of multiple organizations while preserving the privacy of people whose personal data is stored in the databases. FL supports the sharing of trained machine-learning (ML) models between different organizations without sharing personal data. This is important for many security applications – including video surveillance and document authentication – because access to more data leads to better performance. Over the last years, many papers proposed FL frameworks, but most lack at least one of the following aspects: open-source availability, flexibility in decentralized topology, flexibility in using ML frameworks (e.g., PyTorch), real deployment (not only simulation), and results on multiple computer-vision (CV) tasks. In this paper, we give an overview of existing FL frameworks to assess these aspects. Furthermore, we implemented various CV tasks in a federated way and describe the implementation in the paper. This does not only include a small-scale image classification task, but also more challenging CV tasks, such as object detection, semantic segmentation, and person re-identification. Experiments were performed and the results show that models that are trained with privacy-preserving FL perform much better than the baseline with access to only a subset of the data and reach performance close to the upper limit with access to all data.", "venue": "Security + Defence", "year": 2023, "fieldsOfStudy": ["Engineering"], "publicationTypes": ["Review"], "publicationDate": "2023-10-17", "journal": {"pages": "1274205 - 1274205-13", "volume": "12742"}, "authors": [{"authorId": "2133630658", "name": "Sabina B. van Rooij"}, {"authorId": "2260503391", "name": "Muriel van der Spek"}, {"authorId": "1997958409", "name": "A. van Rooijen"}, {"authorId": "2260481694", "name": "Henri Bouma"}], "citations": []}
