{"paperId": "99016bc147399e86cdd0775bf7d7031de223570b", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "A Taxonomy for Classification and Comparison of Dataflows for GNN Accelerators", "abstract": "—Recently, Graph Neural Networks (GNNs) have received a lot of interest because of their success in learning representations from graph structured data. However, GNNs exhibit different compute and memory characteristics compared to traditional Deep Neural Networks (DNNs). Graph convolutions require feature aggregations from neighboring nodes (known as the aggregation phase ), which leads to highly irregular data accesses. GNNs also have a very regular compute phase that can be broken down to matrix multiplications (known as the combination phase ). All recently proposed GNN accelerators utilize different dataﬂows and microarchitecture optimizations for these two phases. Different communication strategies between the two phases have been also used. However, as more custom GNN accelerators are proposed, the harder it is to qualitatively classify them and quantitatively contrast them. In this work, we present a taxonomy to describe several diverse dataﬂows for running GNN inference on accelerators. This provides a structured way to describe and compare the design-space of GNN accelerators.", "venue": "arXiv.org", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-03-01", "journal": {"name": "ArXiv", "volume": "abs/2103.07977"}, "authors": [{"authorId": "1576639159", "name": "Raveesh Garg"}, {"authorId": "30667828", "name": "Eric Qin"}, {"authorId": "2065682867", "name": "Francisco Muñoz-Martínez"}, {"authorId": "1443435337", "name": "Robert Guirado"}, {"authorId": "145620360", "name": "Akshay Jain"}, {"authorId": "3136801", "name": "S. Abadal"}, {"authorId": "40370923", "name": "José L. Abellán"}, {"authorId": "1748058", "name": "M. Acacio"}, {"authorId": "1741769", "name": "E. Alarcón"}, {"authorId": "1750699", "name": "S. Rajamanickam"}, {"authorId": "145984583", "name": "T. Krishna"}], "citations": [{"paperId": "460fc460695bce86e66da0f1e4f7a7a7a3b1481a", "title": "GPT4AIGChip: Towards Next-Generation AI Accelerator Design Automation via Large Language Models"}, {"paperId": "7a27e0c728b16b49ddc9a2c53a55db4ae356b5b5", "title": "Anomaly detection analysis based on correlation of features in graph neural network"}, {"paperId": "b9b42330eeb0dddfa1e89156f872485503428249", "title": "FusedGCN: A Systolic Three-Matrix Multiplication Architecture for Graph Convolutional Networks"}, {"paperId": "b30ede4a8c8cec9bbd7c4f7fdd8edfdb6c66442f", "title": "GCoD: Graph Convolutional Network Acceleration via Dedicated Algorithm and Accelerator Co-Design"}, {"paperId": "a94fd3ea065fb218a64cf52bacb4ef8123690f0a", "title": "Point-X: A Spatial-Locality-Aware Architecture for Energy-Efficient Graph-Based Point-Cloud Deep Learning"}, {"paperId": "703beb96bf664cc78c937345c96abe049bbc17f4", "title": "G-CoS: GNN-Accelerator Co-Search Towards Both Better Accuracy and Efficiency"}, {"paperId": "2e92728e393538304555e48a8d7532daf5ebabd4", "title": "Computing Graph Neural Networks: A Survey from Algorithms to Accelerators"}]}
