{"paperId": "990501f48725bf6f8e0a90f215e7426ced576317", "publicationVenue": {"id": "4879f97c-d826-4e0b-9f9e-a06785bf0f8d", "name": "Journal of Engineering Science", "type": "journal", "alternate_names": ["Journal of engineering science", "Journal of engineering and science", "J eng sci", "Journal of engineering sciences", "Journal of Engineering and Science", "J Eng Sci"], "issn": "1823-3430", "alternate_issns": ["2075-4914", "2456-5288", "2078-6174", "2828-805X", "0377-9254"], "url": "https://www2.kuet.ac.bd/JES/"}, "title": "DECENTRALISED AUTONOMOUS SOCIETY THROUGH LARGE LANGUAGE MODELS’ BASED AGENTS: A PATHWAY TO EMPOWER SMALL COMMUNITIES", "abstract": "This paper explores the concept of Decentralized Autonomous Society through the lens of Large Language Models focusing on the transformative potential of integrating these technologies. The paper on the role of Large Language Models based agents in providing a versatile, responsive, and contextually intelligent resource within a Decentralized Autonomous Society, fostering intellectual exploration, assisting in complex tasks, and aiding real-time problem solving. One delves into their integration with Decentralized Autonomous Society infrastructures, including robotic and automated systems. While promising, the integration of Large Language Models and their agents into a Decentralized Autonomous Society poses several challenges, including infrastructure and connectivity limitations, information accuracy, artificial intelligence bias, privacy and data security, and ethical concerns. This paper critically discusses these issues and proposes potential solutions. Through the lens of the Decentralized Autonomous Society construct, the paper considers the future possibilities and implications of artificial intelligence, where self-sustaining, digitally-empowered communities leverage artificial intelligence as a cornerstone of their collective intelligence.", "venue": "Journal of Engineering Science", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-11-02", "journal": {"name": "Journal of Engineering Science"}, "authors": [{"authorId": "2265171264", "name": "Vasili Braga"}], "citations": [{"paperId": "43ff3632d6e14891d1591a93c0c294cf3016e1c0", "title": "Test-Driven Development for Code Generation"}]}
