{"paperId": "990bc8a0ccfc1a375492e3282a0d688c8a0542e5", "publicationVenue": {"id": "011e0c39-7f47-401e-98d2-ee08fdf206a3", "name": "Library hi tech", "type": "journal", "alternate_names": ["Libr Hi Tech", "Library Hi Tech", "Libr hi tech"], "issn": "0737-8831", "url": "https://www.emerald.com/insight/publication/issn/0737-8831"}, "title": "Adoption of big data analytics for sustainability of library services in academic libraries of Pakistan", "abstract": "PurposeThis paper aims to measure the adoption of big data analytics (BDA) to achieve sustainability in services being offered in university libraries in Pakistan.Design/methodology/approachThe study applied a unified theory of acceptance and use of technology (UTAUT) as a framework and used quantitative data collection and analysis method. In total, 246 university library professionals were surveyed using a questionnaire consisting of UTAUT factors. The gathered data were analyzed using partial least structural equation modeling (PLS-SEM).FindingsThe results showed that performance expectancy (PE), effort expectancy (EE) and social influence (SI) significantly impacted the behavioral intention (BI) to adopt BDA. Facilitating conditions (FCs) have a statistically significant influence on the adoption of big data in libraries, while BDA has a statistical influence on the sustainability of library services (SLS).Practical implicationsBDA assists libraries in making better decisions about demand-driven collection creation, library space management, usage tracking, and quality maintenance in routine and repetitive library tasks such as cataloging, indexing, archiving, administration, preservation and representation. BDA supports libraries in making more cost-effective, innovative, user-oriented services, resource transferring, social identity, resource utilization, healthier user experience, strategic planning, informed decision-making and state-of-the-art infrastructure.Originality/valueThe foundation of this study is based on information gathered from various sources and university libraries in Punjab to better understand the challenges associated with using BDA for the SLS in Pakistan.", "venue": "Library hi tech", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-04-18", "journal": {"name": "Library Hi Tech"}, "authors": [{"authorId": "1572092728", "name": "M. Azam"}, {"authorId": "50754699", "name": "K. Ahmad"}], "citations": [{"paperId": "2d5bf1c744c739f6bc5ec35bf534642c8cf7d339", "title": "Factors affecting librarians’ intentions to engage in virtual storytimes"}, {"paperId": "b8c99d8da6156ff0d9a4689d64d8d5ab9c122844", "title": "Marketing analytics acceptance: using the UTAUT, perceived trust, personal innovativeness in information technology and user attitude"}, {"paperId": "bb81eb58d09f62533f7dbe0d7cdcbcb0636c6a50", "title": "Developing a big data analytics platform using Apache Hadoop Ecosystem for delivering big data services in libraries"}, {"paperId": "a58d4c60914ad99046e15abdf27227159062260a", "title": "From traditional to emerging technologies in supporting smart libraries. A bibliometric and thematic approach from 2013 to 2022"}]}
