{"paperId": "9911f321e39910431a67e29e5af955b0265dd54c", "publicationVenue": {"id": "79c5a18d-0295-432c-aaa5-961d73de6d88", "name": "IEEE Transactions on Neural Networks and Learning Systems", "alternate_names": ["IEEE Trans Neural Netw Learn Syst"], "issn": "2162-237X", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=5962385", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=5962385"]}, "title": "A Survey on Federated Recommendation Systems", "abstract": "Federated learning has recently been applied to recommendation systems to protect user privacy. In federated learning settings, recommendation systems can train recommendation models by collecting the intermediate parameters instead of the real user data, which greatly enhances user privacy. In addition, federated recommendation systems (FedRSs) can cooperate with other data platforms to improve recommendation performance while meeting the regulation and privacy constraints. However, FedRSs face many new challenges such as privacy, security, heterogeneity, and communication costs. While significant research has been conducted in these areas, gaps in the surveying literature still exist. In this article, we: 1) summarize some common privacy mechanisms used in FedRSs and discuss the advantages and limitations of each mechanism; 2) review several novel attacks and defenses against security; 3) summarize some approaches to address heterogeneity and communication costs problems; 4) introduce some realistic applications and public benchmark datasets for FedRSs; and 5) present some prospective research directions in the future. This article can guide researchers and practitioners understand the research progress in these areas.", "venue": "IEEE Transactions on Neural Networks and Learning Systems", "year": 2022, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-12-27", "journal": {"name": "IEEE transactions on neural networks and learning systems", "volume": "PP"}, "authors": [{"authorId": "2109745229", "name": "Zehua Sun"}, {"authorId": "2146648924", "name": "Yonghui Xu"}, {"authorId": "1679704", "name": "Y. Liu"}, {"authorId": "2153476351", "name": "Weiliang He"}, {"authorId": "51015805", "name": "Y. Jiang"}, {"authorId": "2397264", "name": "Fangzhao Wu"}, {"authorId": "101457473", "name": "Li-zhen Cui"}], "citations": [{"paperId": "a4c0f12d4217b31d8dd8217bc6083381929740e2", "title": "Poisoning Decentralized Collaborative Recommender System and Its Countermeasures"}, {"paperId": "24c406a66842b5e7d7ec1c2c6e5150d688c62b0f", "title": "Robust Federated Contrastive Recommender System against Model Poisoning Attack"}, {"paperId": "79307a8f1290c3160246d8566a75721ea3014882", "title": "Poisoning Federated Recommender Systems with Fake Users"}, {"paperId": "92c361d02caa966769b6888d4eff1080929e9dbb", "title": "LLM-based Federated Recommendation"}, {"paperId": "17df9cf8c61578be5bfeb8059780331de0c5adb2", "title": "Towards Personalized Privacy: User-Governed Data Contribution for Federated Recommendation"}, {"paperId": "0d4eeccd938cedf7852f608e6e8ac430accb2ab3", "title": "On-Device Recommender Systems: A Comprehensive Survey"}, {"paperId": "cf8030deece6d896c882e5ead57edc4d3e983ead", "title": "Progress in Privacy Protection: A Review of Privacy Preserving Techniques in Recommender Systems, Edge Computing, and Cloud Computing"}, {"paperId": "75c71251149947a5e3d9ac2e42b3dff466af4ab0", "title": "Hide Your Model: A Parameter Transmission-free Federated Recommender System"}, {"paperId": "df1a03528ae96055452535864f1aabf23e59821f", "title": "RAIFLE: Reconstruction Attacks on Interaction-based Federated Learning with Active Data Manipulation"}, {"paperId": "188bf41601c753a286fafb6f3caaaadbce603345", "title": "Advocating for the Silent: Enhancing Federated Generalization for Non-Participating Clients"}, {"paperId": "f076df7265c41f457d185ff4f3a8909c16a0e27c", "title": "FedRec+: Enhancing Privacy and Addressing Heterogeneity in Federated Recommendation Systems"}, {"paperId": "806b914d5c00d7ab2d4a9b065d95423871c37ecd", "title": "A Sequential Recommendation Model Combining Contrastive Learning and Self-Attention"}, {"paperId": "4b1bc95030c8f35886aec4b27bdfc48ad1bb3b45", "title": "HeteFedRec: Federated Recommender Systems with Model Heterogeneity"}, {"paperId": "bc309d6fca1ef63f5ae99e3413adfd743be3577b", "title": "Manipulating Visually-aware Federated Recommender Systems and Its Countermeasures"}, {"paperId": "f7833d272af3614923e300bfedc51ace83587428", "title": "PerFedRec++: Enhancing Personalized Federated Recommendation with Self-Supervised Pre-Training"}, {"paperId": "4b27b56478c7b1214e12b16c576553d5c9fe000a", "title": "Advancements in Federated Learning: Models, Methods, and Privacy"}, {"paperId": "54508c658be1701d099d2c93fded701761d7bd48", "title": "Federated Recommendation with Additive Personalization"}, {"paperId": "3b05205f9fb459997add86442d015b90ba725c22", "title": "Cali3F: Calibrated Fast Fair Federated Recommendation System"}]}
