{"paperId": "99147f83a92e5e3f8d5ee5aabda2e641e7dec4a0", "publicationVenue": {"id": "3b8ad848-3e85-4325-989f-d77440777eca", "name": "International Conference on Fog and Edge Computing", "type": "conference", "alternate_names": ["ICFEC", "Int Conf Fog Edge Comput"]}, "title": "When IoT Data Meets Streaming in the Fog", "abstract": "IoT and video streaming are the main driving applications for digital data generation today. The traditional way of storing and processing data in the Cloud cannot satisfy many latency critical applications. This is why Fog computing emerged as a continuum infrastructure from the Cloud to end-user devices. Misplacing data in such an infrastructure results in high latency, and consequently increases the penalty for Internet Service Providers (ISPs) incurred by violating the service level agreement (SLA). In past studies, two issues have been investigated separately: the IoT data placement and the streaming cache placement. However, both placements rely on the same Fog distributed storage system. In this paper, we address those issues in a unique model with the aim to minimize the penalty for ISPs incurred by the SLA violation and maximize storage resources usage. We subdivided each Fog node storage space into a storage part and a cache part. First, our model consists in placing IoT data in the storage part of Fog nodes, and then placing streaming data in the cache part of these nodes. The novelty of our model is the flexibility it offers for managing the cache volume, which can, adaptively, spill on the free part dedicated to IoT data. Experiments show that using our model makes it possible to reduce the streaming data penalty of the ISP’s SLA violation by more than 47% on average.", "venue": "International Conference on Fog and Edge Computing", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-05-01", "journal": {"name": "2022 IEEE 6th International Conference on Fog and Edge Computing (ICFEC)", "pages": "50-57"}, "authors": [{"authorId": "2171747545", "name": "Lydia Ait-Oucheggou"}, {"authorId": "47820129", "name": "Mohammed Islam Naas"}, {"authorId": "1761002", "name": "Yassine Hadjadj Aoul"}, {"authorId": "2537219", "name": "Jalil Boukhobza"}], "citations": [{"paperId": "4458dd0448b93ae5dc5a06cf3481a5ec71b25413", "title": "Investigating Multi-Tier and QoS-Aware Caching Based on ARC"}]}
