{"paperId": "99158f7f5c23a599d77fa2d7ce2d171cd214eb65", "publicationVenue": {"id": "ccd8e532-73c6-414f-bc91-271bbb2933e2", "name": "Electronics", "type": "journal", "issn": "1450-5843", "alternate_issns": ["2079-9292", "0883-4989"], "url": "http://www.electronics.etfbl.net/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-247562", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-247562", "https://www.mdpi.com/journal/electronics"]}, "title": "Computational Resources Allocation and Vehicular Application Offloading in VEC Networks", "abstract": "With the advances in wireless communications and the Internet of Things (IoT), various vehicular applications such as image-aided navigation and autonomous driving are emerging. These vehicular applications require a significant number of computation resources and a lower processing delay. However, these resource-limited and power-constrained vehicles may not meet the requirements of processing these vehicular applications. By offloading these vehicular applications to the edge cloud, vehicular edge computing (VEC) is deemed a novel paradigm for improving vehicular performance. However, how to optimize the allocation of computation resources of both vehicles and VEC servers to reduce the energy and delay is a challenging issue when deploying the VEC systems. In this article, we try to address this issue and propose a vehicular application offloading and computational resources allocation strategy. We formulate an optimization problem and present an efficient offloading scheme for vehicular applications. Extensive simulation results are offered to analyze the performances of the proposed scheme. In comparison with the benchmark schemes, the proposed scheme can outperform them in terms of computation cost.", "venue": "Electronics", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-07-07", "journal": {"name": "Electronics"}, "authors": [{"authorId": "1443780727", "name": "Fan Gu"}, {"authorId": "48520755", "name": "Xiaoying Yang"}, {"authorId": null, "name": "Xianwei Li"}, {"authorId": "2175369364", "name": "Haiquan Deng"}], "citations": [{"paperId": "942fb0df711f4b1a2f6f6b89c4e19653bd96512b", "title": "Task Classification for Optimal Offloading and Resource Allocation in Vehicular Edge Computing"}, {"paperId": "8b7b9a7cee26c1010378f3b8cb0f551d75305951", "title": "Internet of Intelligent Vehicles (IoIV): An Intelligent VANET Based Computing via Predictive Modeling"}]}
