{"paperId": "99187ffdc65c4a4ecff825a32f55a955b09c7956", "publicationVenue": {"id": "a71ca720-16ee-4930-9112-7e88084f2312", "name": "International Journal of Cancer", "type": "journal", "alternate_names": ["Int J Cancer"], "issn": "0020-7136", "url": "http://www.interscience.wiley.com/jpages/0020-7136/", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/10970215", "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1097-0215"]}, "title": "Feasibility of deep learning‐based fully automated classification of microsatellite instability in tissue slides of colorectal cancer", "abstract": "High levels of microsatellite instability (MSI‐H) occurs in about 15% of sporadic colorectal cancer (CRC) and is an important predictive marker for response to immune checkpoint inhibitors. To test the feasibility of a deep learning (DL)‐based classifier as a screening tool for MSI status, we built a fully automated DL‐based MSI classifier using pathology whole‐slide images (WSIs) of CRCs. On small image patches of The Cancer Genome Atlas (TCGA) CRC WSI dataset, tissue/non‐tissue, normal/tumor and MSS/MSI‐H classifiers were applied sequentially for the fully automated prediction of the MSI status. The classifiers were also tested on an independent cohort. Furthermore, to test how the expansion of the training data affects the performance of the DL‐based classifier, additional classifier trained on both TCGA and external datasets was tested. The areas under the receiver operating characteristic curves were 0.892 and 0.972 for the TCGA and external datasets, respectively, by a classifier trained on both datasets. The performance of the DL‐based classifier was much better than that of previously reported histomorphology‐based methods. We speculated that about 40% of CRC slides could be screened for MSI status without molecular testing by the DL‐based classifier. These results demonstrated that the DL‐based method has potential as a screening tool to discriminate molecular alteration in tissue slides.", "venue": "International Journal of Cancer", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-04-13", "journal": {"name": "International Journal of Cancer", "pages": "728 - 740", "volume": "149"}, "authors": [{"authorId": "1459934591", "name": "Sung Hak Lee"}, {"authorId": "3721553", "name": "I. Song"}, {"authorId": "87933862", "name": "Hyun-Jong Jang"}], "citations": [{"paperId": "e9399c69ca0fcfab6ef0139d43aa9121dfa48e4c", "title": "Predicting Mismatch Repair Deficiency Status in Endometrial Cancer through Multi-Resolution Ensemble Learning in Digital Pathology."}, {"paperId": "8a4ae4c29452b7e3024a0ac5759f82ef7d64f3bc", "title": "Detecting microsatellite instability in colorectal cancer using Transformer-based colonoscopy image classification and retrieval"}, {"paperId": "7f7d3399017bbbf212df79436868949e41d63055", "title": "Artificial Intelligence in Predicting Microsatellite Instability and KRAS, BRAF Mutations from Whole-Slide Images in Colorectal Cancer: A Systematic Review"}, {"paperId": "eb8d5d2433673e7492ec15f22f1871097ebe8491", "title": "Deep Learning for the Pathologic Diagnosis of Hepatocellular Carcinoma, Cholangiocarcinoma, and Metastatic Colorectal Cancer"}, {"paperId": "bca569136647417dea524d3c7a2d19d57aa112f7", "title": "Transformer-based biomarker prediction from colorectal cancer histology: A large-scale multicentric study"}, {"paperId": "a1593901e4d10134d29e5fc10b7b29546cc15c42", "title": "Immune Biomarkers in Triple-Negative Breast Cancer: Improving the Predictivity of Current Testing Methods"}, {"paperId": "54ae504ebad01daaa92d3655fe7bcc2c79568551", "title": "Recent Advancements, Limitations, and Future Perspectives of the use of Personalized Medicine in Treatment of Colon Cancer"}, {"paperId": "47801421ac052c7bef4ad6dce8396b69df32474e", "title": "Modeling the survival of colorectal cancer patients based on colonoscopic features in a feature ensemble vision transformer"}, {"paperId": "9ccd42dbde7f1025e711a953d2316f064e6c83d2", "title": "Deep learning-based methods for classification of microsatellite instability in endometrial cancer from HE-stained pathological images"}, {"paperId": "f0301c7057c96d1450b411a56b2965295af56284", "title": "Prediction of Microsatellite Instability in Colorectal Cancer Using a Machine Learning Model Based on PET/CT Radiomics"}, {"paperId": "a15647157eeb209c9510721c68d89305865847cb", "title": "Generalizable biomarker prediction from cancer pathology slides with self-supervised deep learning: A retrospective multi-centric study"}, {"paperId": "3994996a202f0127a58f57b259324a5283a1ba27", "title": "Predicting microsatellite instability and key biomarkers in colorectal cancer from H&E‐stained images: achieving state‐of‐the‐art predictive performance with fewer data using Swin Transformer"}, {"paperId": "51da642c4236e7da9a2bab0725f70a5479b3a658", "title": "Deep learning in digital pathology for personalized treatment plans of cancer patients."}, {"paperId": "efaf25d7185927dfb37f9d7d85756cdb702f58dd", "title": "Fully transformer-based biomarker prediction from colorectal cancer histology: a large-scale multicentric study"}, {"paperId": "0a6c9cfd230e7698d1366e3444c142babe503c2e", "title": "Tumour-infiltrating lymphocytes: from prognosis to treatment selection"}, {"paperId": "d5d686664710b0d36c824d33ce69d2fa7d916ed2", "title": "Classification of IHC Images of NATs With ResNet-FRP-LSTM for Predicting Survival Rates of Rectal Cancer Patients"}, {"paperId": "d93e65619d27ddf3aaca449a4d1fe7b215f568ea", "title": "Artificial Intelligence-Based Prediction of Recurrence after Curative Resection for Colorectal Cancer from Digital Pathological Images"}, {"paperId": "1823af97b8f362583fdbfff8a63f11c78fe702d9", "title": "Prediction of microsatellite instability of colorectal cancer using multi-scale pathological images based on deep learning"}, {"paperId": "b45f86e6d331dadfdc27665b3c19b04c9bb521ba", "title": "Galactic swarm optimization with deep transfer learning driven colorectal cancer classification for image guided intervention"}, {"paperId": "90e7a1436c6e6ad681b1632f121622ffa971b7c1", "title": "Role of AI and digital pathology for colorectal immuno-oncology"}, {"paperId": "7769675e4cac72f560ef4008d8e765405f93cb48", "title": "Identification of technology frontiers of artificial intelligence-assisted pathology based on patent citation network"}, {"paperId": "9bbbaa12f49c65d0bf6ae4fc615a35f4b1828791", "title": "Predicting microsatellite instability and key biomarkers in colorectal cancer from H&E-stained images: Achieving SOTA predictive performance with fewer data using Swin Transformer"}, {"paperId": "d6d5896615adae74751c8c361f41847ceae833b3", "title": "Deep learning captures selective features for discrimination of microsatellite instability from pathologic tissue slides of gastric cancer"}, {"paperId": "74b5ecbfade54d64568aa5b7c5b2fdc07075e768", "title": "The evolving role of morphology in endometrial cancer diagnostics: From histopathology and molecular testing towards integrative data analysis by deep learning"}, {"paperId": "2656bb15e85af9746c8c15b7060c00409eb9c066", "title": "Identify Representative Samples by Conditional Random Field of Cancer Histology Images"}, {"paperId": "19fcf5dbefd64f1e2d3d1d89d5bda67ae50602ee", "title": "PPsNet: An improved deep learning model for microsatellite instability high prediction in colorectal cancer from whole slide images"}, {"paperId": "20e3311c91165a6aab0339e4dfe60e8fda597a94", "title": "Clinical actionability of triaging DNA mismatch repair deficient colorectal cancer from biopsy samples using deep learning"}, {"paperId": "82e551076e6c6213ee7104416dc61193972f5e70", "title": "Recent Applications of Artificial Intelligence from Histopathologic Image-Based Prediction of Microsatellite Instability in Solid Cancers: A Systematic Review"}, {"paperId": "189ac1523f6bb6247eefb62b9c032275d4975e43", "title": "Deep learning-based prediction of molecular cancer biomarkers from tissue slides: A new tool for precision oncology"}, {"paperId": "0de121c1425f7f7a6b83f663499abd9dcd83e1e7", "title": "Area under the curve may hide poor generalisation to external datasets"}, {"paperId": "5aa3760a3000b6966f01850f4535c166f7ebda5e", "title": "Deep Learning on Histopathological Images for Colorectal Cancer Diagnosis: A Systematic Review"}, {"paperId": "3a05433552f69bbfd7d867bc1e186e5d0f30cd5c", "title": "Artificial intelligence to identify genetic alterations in conventional histopathology"}, {"paperId": "3a301447428b8d4d9732068a9c9b7af8098f42f4", "title": "Artificial Intelligence for Predicting Microsatellite Instability Based on Tumor Histomorphology: A Systematic Review"}, {"paperId": "05e98ad346f011c6236ab57dd0bfe8e773c002d0", "title": "A synopsis of modern - day colorectal cancer: Where we stand."}, {"paperId": "63d850690ecf42101d2f53f15342a1686bddff3a", "title": "Deep Learning for the detection of microsatellite instability from histology images in colorectal cancer: a systematic literature review"}, {"paperId": "c4ffd0b1d072bf33287ac69157cde58429a12008", "title": "xDEEP-MSI: Explainable Bias-Rejecting Microsatellite Instability Deep Learning System in Colorectal Cancer"}, {"paperId": "825346ccf6143fa5ba7e0fcdd952fea21af80bcd", "title": "Self supervised learning improves dMMR/MSI detection from histology slides across multiple cancers"}, {"paperId": "a4501f5909097c131a6c0238818ab3296a32ed85", "title": "Deep Learning of Histopathological Features for the Prediction of Tumour Molecular Genetics"}, {"paperId": "6b78aa7f096265080daf604805d9bc051a9fa800", "title": "Deep Learning for Automatic Subclassification of Gastric Carcinoma Using Whole-Slide Histopathology Images"}, {"paperId": "f1249b1973ec2e3af27a95aeed576c5e89e9b65c", "title": "Predicting microsatellite instability and key biomarkers in colorectal cancer from H&E-stained images: Achieving SOTA with Less Data using Swin Transformer"}]}
