{"paperId": "991f186869aff0e30f2fab7197c37392b514d6d5", "publicationVenue": {"id": "312ca99c-9149-490d-813e-c60d5e949f65", "name": "Concurrency and Computation", "type": "journal", "alternate_names": ["Concurr Comput Pract Exp", "Concurrency and Computation: Practice and Experience", "Concurr Comput"], "issn": "1532-0626", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/77004395?CRETRY=1&SRETRY=0", "alternate_urls": ["http://www3.interscience.wiley.com/cgi-bin/jtoc?ID=77004395", "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1532-0634"]}, "title": "Uncertainty‐aware scheduling of real‐time workflows under deadline constraints on multi‐cloud systems", "abstract": "The elasticity and pay‐as‐you‐go features of cloud computing are popular with customers, and more and more workflow applications are migrating to cloud platforms. Many workflow scheduling algorithms aim to obtain minimal rental costs. However, most of the existing research assumes that task execution time is deterministic. In fact, due to the performance fluctuations of VMs, the task execution time is uncertain before scheduling. Furthermore, many works ignore the cost savings given by multi‐cloud systems. To this end, this paper provides a scheduling framework for real‐time workflows. The framework includes four main components: the workflow analyzer, task pool, task allocation controller, and resource manager. Then based on the framework, we propose the RWSMC heuristic algorithm. The algorithm's goal is to minimize the total rental cost while satisfying the deadline constraints and ensuring the reliability of task execution. The RWSMC algorithm reduces the cost by selecting the appropriate billing mechanism based on the task's execution time and mitigates the impact of uncertain execution time by scheduling the task to the VM with the shortest predicted start time. Simulation experiments demonstrate that our proposed algorithm outperforms three recent state‐of‐the‐art scheduling algorithms in the total rental cost, deadline violation rate, and VM resource utilization.", "venue": "Concurrency and Computation", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-12-20", "journal": {"name": "Concurrency and Computation: Practice and Experience", "volume": "35"}, "authors": [{"authorId": "2143805938", "name": "Jin Xu"}, {"authorId": "1808851", "name": "Huiqun Yu"}, {"authorId": "13795313", "name": "Guisheng Fan"}, {"authorId": "2184393391", "name": "Jiayin Zhang"}], "citations": [{"paperId": "e470f6611792bd2deae88772076431b8120a98a7", "title": "A Dual-Agent Scheduler for Distributed Deep Learning Jobs on Public Cloud via Reinforcement Learning"}]}
