{"paperId": "9921ffbbbe426aaabd99dbeaec063feedb800ee4", "publicationVenue": {"id": "5fa953d3-b0a2-4414-a607-768d4d754ced", "name": "Journal of Manufacturing and Materials Processing", "type": "journal", "alternate_names": ["J Manuf Mater Process"], "issn": "2504-4494", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-1047916", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-1047916", "https://www.mdpi.com/journal/jmmp"]}, "title": "Machine Learning Application Using Cost-Effective Components for Predictive Maintenance in Industry: A Tube Filling Machine Case Study", "abstract": "Maintenance is an activity that cannot be separated from the context of product manufacturing. It is carried out to maintain the components’ or machines’ function so that no failure can reduce the machine’s productivity. One type of maintenance that can mitigate total machine failure is predictive maintenance. Predictive maintenance, along with the times, no longer relies on visuals or other senses but can be combined into automated observations using machine learning methods. It can be applied to a toothpaste factory with a tube filling machine by combining the results of sensor observations with machine learning methods. This research aims to increase the Overall equipment effectiveness (OEE) to 10% by predicting the components that will be damaged. The machine learning methods tested in this study are random forest regression and linear regression. This study indicates that the prediction accuracy of machine learning with the random forest regression method for PHM predictive is 88%of the actual data, and linear regression has an accuracy of 59% of the actual data. After implementing the system on the machine for three months, the OEE value increased by 13.10%, and unplanned machine failure decreased by 62.38% in the observed part. Implementation of the system can significantly reduce the failure factor of unplanned machines.", "venue": "Journal of Manufacturing and Materials Processing", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-09-27", "journal": {"name": "Journal of Manufacturing and Materials Processing"}, "authors": [{"authorId": "2186513188", "name": "David Natanael"}, {"authorId": "1791759215", "name": "H. Sutanto"}], "citations": [{"paperId": "25f7d749a072312ba005ebf3aac3d2d72fc18cd6", "title": "Predictive maintenance in Industry 4.0: A systematic multi-sector mapping"}, {"paperId": "1400c56d400e31bddfb37bcb8258714bd6e11863", "title": "A Critical Insight and Evaluation of AI Models for Predictive Maintenance under Industry 4.0"}, {"paperId": "8d6abb019fb0424a6a66f4da88227e2b9dd741b6", "title": "Predicting the performance of an industrial furnace using Gaussian process and linear regression: A comparison"}, {"paperId": "6cf243312f7ea243658ed7c37ae2e6b09a88873c", "title": "Integrating TPM and Industry 4.0 to Increase the Availability of Industrial Assets: A Case Study on a Conveyor Belt"}]}
