{"paperId": "99212fef59fad7b709e4cf8906be557b8b811dd6", "publicationVenue": null, "title": "Dynamically reconfiguring software microbenchmarks: reducing execution time without sacrificing result quality", "abstract": "Executing software microbenchmarks, a form of small-scale performance tests predominantly used for libraries and frameworks, is a costly endeavor. Full benchmark suites take up to multiple hours or days to execute, rendering frequent checks, e.g., as part of continuous integration (CI), infeasible. However, altering benchmark configurations to reduce execution time without considering the impact on result quality can lead to benchmark results that are not representative of the software’s true performance. We propose the first technique to dynamically stop software microbenchmark executions when their results are sufficiently stable. Our approach implements three statistical stoppage criteria and is capable of reducing Java Microbenchmark Harness (JMH) suite execution times by 48.4% to 86.0%. At the same time it retains the same result quality for 78.8% to 87.6% of the benchmarks, compared to executing the suite for the default duration. The proposed approach does not require developers to manually craft custom benchmark configurations; instead, it provides automated mechanisms for dynamic reconfiguration. Hence, making dynamic reconfiguration highly effective and efficient, potentially paving the way to inclusion of JMH microbenchmarks in CI.", "venue": "ESEC/SIGSOFT FSE", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2020-11-07", "journal": {"name": "Proceedings of the 28th ACM Joint Meeting on European Software Engineering Conference and Symposium on the Foundations of Software Engineering"}, "authors": [{"authorId": "10420961", "name": "Christoph Laaber"}, {"authorId": "2008294892", "name": "Stefan Würsten"}, {"authorId": "50355692", "name": "H. Gall"}, {"authorId": "1910406", "name": "P. Leitner"}], "citations": [{"paperId": "5e3a35560d403334db97b5084d32665c38386be3", "title": "Towards Continuous Performance Assessment of Java Applications With PerfBot"}, {"paperId": "06ff2e93ff5000794066c83de6d3635bd24c7ab6", "title": "A Study of Java Microbenchmark Tail Latencies"}, {"paperId": "e2a74f46fe140f1e0ecae0c62094290ed1325f4a", "title": "Software Mining -- Investigating Correlation between Source Code Features and Michrobenchmark's Steady State"}, {"paperId": "51846c78d14b485ba37d6c4ac8422e606e6b0d4c", "title": "Automated Generation and Evaluation of JMH Microbenchmark Suites From Unit Tests"}, {"paperId": "fde0535d71e2e9e9273e09d3b4e3bc0591e1607e", "title": "Using Microbenchmark Suites to Detect Application Performance Changes"}, {"paperId": "4a3c215805db716f731dc574e3407fcd3270dcc6", "title": "Evaluating Search-Based Software Microbenchmark Prioritization"}, {"paperId": "13374de64aa511567867d9f8e2fb8f1010ee019a", "title": "Towards effective assessment of steady state performance in Java software: are we there yet?"}, {"paperId": "380e3d7670fcd6d3c4b1672aee4fdef7c4f9e38e", "title": "Exploring Performance Assurance Practices and Challenges in Agile Software Development: An Ethnographic Study"}, {"paperId": "1cf21c21d793526caee2e584bab66b1715a577be", "title": "How Software Refactoring Impacts Execution Time"}, {"paperId": "2f65e60dfd8a05f6dfeec8a237507b029386b1eb", "title": "Performance Testing for Cloud Computing with Dependent Data Bootstrapping"}, {"paperId": "25a6a38bb83c26fe0f26ec106af53e32735dc296", "title": "Applying test case prioritization to software microbenchmarks"}, {"paperId": "26acbf461e61cf95255ed858e98b11bf928f26b0", "title": "Predicting unstable software benchmarks using static source code features"}, {"paperId": "060680fbeffbef60b4a730a578622579f7597bb2", "title": "Using application benchmark call graphs to quantify and improve the practical relevance of microbenchmark suites"}, {"paperId": "7c13b5de4413330afe311aaeca15000ce61672c2", "title": "An Exploratory Study of the Impact of Parameterization on JMH Measurement Results in Open-Source Projects"}]}
