{"paperId": "992dbba88ad98b4af26ac6af3ba68ccdb1009615", "publicationVenue": null, "title": "IOT System Model,Challenges and Threats", "abstract": ": IOT (Internet of things) have emerged incredibly since its beginning and today one can easily make use of extensive applications that have entered into real world may it be smart monitoring systems, smart buildings, smart wearable accessories to smart healthcare services, smart grids etc. It connects people sitting at home or working at office to any application or service that is to be done through internet. Yet there is much vulnerability related to issues of security and privacy and this adds to challenges of IOT that need to overcome to make it further promising technology. So this paper discusses about the architecture or model if IOT as well as challenges seen by researchers like data mining challenge, privacy challenge. Also various security attacks present at various levels have been overviewed. Furthermore, comparative analysis of various security models has been discussed along with the technique used. Security issues at the application layer has been presented constituting sniffing attack, access control attack etc.", "venue": "", "year": 2020, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": null, "journal": null, "authors": [{"authorId": "70038348", "name": "Bhawna Ahlawat"}, {"authorId": "74687641", "name": "Anil Sangwan"}, {"authorId": "41124801", "name": "V. Sindhu"}], "citations": [{"paperId": "fab29172ca448b2616e24e0fef4e2155c296dc97", "title": "Building Trust in the IoT: A Comprehensive Review of Device Authentication Approaches"}, {"paperId": "3a33eda3dd82976c0d3341cb537a1a057abe3424", "title": "Introspection of Availability in Service Based Smart Systems Using Internet of Things (IoT)"}, {"paperId": "755607e65510565e62f4092500216a7efbcf8bce", "title": "Smart home security: challenges, issues and solutions at different IoT layers"}, {"paperId": "09f3f60a63a03b11c0135cb5fa5aa82365180a4f", "title": "Internet of Things Applications, Security Challenges, Attacks, Intrusion Detection, and Future Visions: A Systematic Review"}, {"paperId": "c34d42b60a9ff944e9f4a7cebd77dde5e578eac7", "title": "CLASSIFICATION OF SECURITY ISSUES AND CYBER ATTACKS IN LAYERED INTERNET OF THINGS"}]}
