{"paperId": "9955c37b8b755928032c302ba4985d7e8cdecabd", "publicationVenue": {"id": "74b08738-109e-45e9-b689-13368a2fca8b", "name": "Cybernetics and systems", "type": "journal", "alternate_names": ["Cybern Syst", "Cybernetics and Systems", "Cybern syst"], "issn": "0196-9722", "url": "http://www.catchword.com/rpsv/catchword/tandf/01969722/contp1-1.htm", "alternate_urls": ["http://www.tandfonline.com/loi/ucbs20", "http://www.informaworld.com/openurl?genre=journal&issn=0196-9722", "http://figaro.catchword.com/rpsv/catchword/tandf/01969722/contp1-1.htm", "http://www.tandfonline.com/action/aboutThisJournal?journalCode=ucbs20", "http://www.metapress.com/openurl.asp?genre=journal&issn=0196-9722"]}, "title": "Machine Learning Techniques and Big Data Analysis for Internet of Things Applications: A Review Study", "abstract": "Abstract In recent years, the rapid growth of the Internet of Things (IoT) has made it possible to communicate and interact with various devices. In this regard, IoT data has tremendous volume, veracity, variety and velocity known as big data. Due to the complexity and heterogeneity of this data, classical data analysis approaches to compatibility with IoT applications are not valid at all levels. Although the cloud can temporarily store big data to reduce the complexity of the analysis process, but problems such as security and latency persist. Machine learning techniques have shown promising results in previous studies for IoT data processing. Big data analytics methods can also be used to improve the performance of IoT applications and related challenges. Therefore, the use of machine learning techniques and big data technologies can achieve better performance and management of IoT applications. The purpose of this paper is to review machine learning techniques and recent advances in big data analytics that can be used to develop IoT applications. This study seeks to achieve this purpose by reviewing published articles on IoT-based machine learning and IoT-based big data between 2010 and 2021. There are several challenges and solutions in the literature for these fields, so that 32 articles have been reviewed to address these issues. These articles are reviewed in four general categories: platform, framework, applications and model to be the starting point for future research.", "venue": "Cybernetics and systems", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-07-23", "journal": {"name": "Cybernetics and Systems", "pages": "1 - 41", "volume": "55"}, "authors": [{"authorId": "1682816", "name": "Fei Wang"}, {"authorId": "2180334144", "name": "Hongxia Wang"}, {"authorId": "2179139101", "name": "Omid Ranjbar Dehghan"}], "citations": [{"paperId": "13b326f5a8869bf72b368fbcdabcb3736f77531c", "title": "Big Data Management Algorithms, Deep Learning-Based Object Detection Technologies, and Geospatial Simulation and Sensor Fusion Tools in the Internet of Robotic Things"}, {"paperId": "4990712ff5540b4310db1b62c023d42b9d8c6dbc", "title": "The Big Data for WSN Nodes: Leveraging Scalable Architecture"}]}
