{"paperId": "9960fe930b53e08673fe764ae4a79c16f9379cc0", "publicationVenue": {"id": "bb21160f-0f31-4e34-abab-715b95a870a2", "name": "Indonesian Journal of Electrical Engineering and Computer Science", "type": "journal", "alternate_names": ["Indones J Electr Eng Comput Sci"], "issn": "2502-4752", "url": "http://www.iaescore.com/journals/index.php/IJEECS"}, "title": "Predictive analytics of heart disease presence with feature importance based on machine learning algorithms", "abstract": "Heart failure disease is a complex clinical issue which has more impact on life of human begins. Hospitals and cardiac centers frequently employ electrocardiogram (ECG) tool to assess and to identify heart failure at early stages. Healthcare professionals are very concerned about the early identification of heart disease. In this research paper we have focused on predictive analysis of cardiac disease by using machine learning algorithms. We have developed python-based software for healthcare research in this paper. This research has more significant work for tracking and establishing numerous health monitoring apps. We have demonstrated information handling that requires adjusting clear-cut portions and working with absolute factors. A quick overview of the various machine learning technologies based on heart disease diagnosis is described clearly in this research. A more reliable way for diagnosing cardiac problems is the random forest classification algorithm. This application needs data analysis, which is crucial owing to its about 95% accuracy rate across training data. We have discussed the tests and findings of the random forest classifier method, which improves the accuracy of heart disease research diagnosis.", "venue": "Indonesian Journal of Electrical Engineering and Computer Science", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-11-01", "journal": {"name": "Indonesian Journal of Electrical Engineering and Computer Science"}, "authors": [{"authorId": "2246098628", "name": "Nitalaksheswara Rao Kolukula"}, {"authorId": "2246049888", "name": "Prathap Nayudu Pothineni"}, {"authorId": "2246048636", "name": "Venkata Murali Krishna Chinta"}, {"authorId": "89120359", "name": "Venugopal Boppana"}, {"authorId": "134648503", "name": "Rajendra Prasad Kalapala"}, {"authorId": "2097227103", "name": "Soujanya Duvvi"}], "citations": [{"paperId": "f2860b2855e2e6a19586e80389e37af90def66ff", "title": "A new framework to enhance healthcare monitoring using patient-centric predictive analysis"}]}
