{"paperId": "996e54148ad07daa439f02dd1c1f6ff2c8ee5e9a", "publicationVenue": {"id": "a00fde74-d8df-4613-b825-0fff9f531d3f", "name": "IEEE Transactions on Network and Service Management", "type": "journal", "alternate_names": ["IEEE Trans Netw Serv Manag"], "issn": "1932-4537", "url": "http://ejournals.ebsco.com/direct.asp?JournalID=714200", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4275028", "http://ieeexplore.ieee.org/servlet/opac?punumber=4275028"]}, "title": "Cost-Efficient Fault-Tolerant Workflow Scheduling for Deadline-Constrained Microservice-Based Applications in Clouds", "abstract": "Microservices are becoming increasingly popular in the construction of cloud applications. On the basis of containers, microservice instances can be implemented with high scalability and maintainability. Due to the need of ensuring various quality of service (QoS) requirements and the two-layer resource structure of containers and virtual machines (VMs), microservice workflow scheduling in clouds is a challenging problem to address. This paper proposes a heuristic algorithm GSMS to minimize execution cost of a microservice-based workflow application while satisfying deadline and reliability constraints. GSMS adopts a greedy fault-tolerant scheduling strategy for replicas of each task to select appropriate resources that meet the sub-deadline and minimize the cost until the sub-reliability is guaranteed. Furthermore, a resource adjustment strategy is incorporated into GSMS to further improve resource utilization. By conducting extensive experiments with several realistic workflow applications, in comparison with existing algorithms, the effectiveness and efficiency of GSMS in achieving lower execution cost and meeting deadline and reliability requirements are validated.", "venue": "IEEE Transactions on Network and Service Management", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-01", "journal": {"name": "IEEE Transactions on Network and Service Management", "pages": "3220-3232", "volume": "20"}, "authors": [{"authorId": "46947067", "name": "Zengpeng Li"}, {"authorId": "1808851", "name": "Huiqun Yu"}, {"authorId": "13795313", "name": "Guisheng Fan"}, {"authorId": "2184393391", "name": "Jiayin Zhang"}], "citations": [{"paperId": "223116045a4807b941f95ce68b8161ac8f8d039d", "title": "Workflow Scheduling Scheme for Optimized Reliability and End-to-End Delay Control in Cloud Computing Using AI-Based Modeling"}, {"paperId": "aa12bdaf53ba5044f2afb68b89698435c3d4ff54", "title": "Design-Time Analysis of Time-Critical and Fault-Tolerance Constraints in Cloud Services"}]}
