{"paperId": "996e1746adbd6c67c0581147b6caddc62a2c9761", "publicationVenue": {"id": "95d0dda7-5d58-4afd-b59f-315447b81992", "name": "IEEE Communications Surveys and Tutorials", "type": "journal", "alternate_names": ["IEEE Commun Surv Tutor"], "issn": "1553-877X", "url": "http://www.comsoc.org/cst", "alternate_urls": ["http://www.comsoc.org/livepubs/surveys/index.html", "https://ieeexplore.ieee.org/servlet/opac?punumber=7041148", "http://ieeexplore.ieee.org/servlet/opac?punumber=9739"]}, "title": "A Survey on In-Network Computing: Programmable Data Plane and Technology Specific Applications", "abstract": "In comparison with cloud computing, edge computing offers processing at locations closer to end devices and reduces the user experienced latency. The new recent paradigm of in-network computing employs programmable network elements to compute on the path and prior to traffic reaching the edge or cloud servers. It advances common edge/cloud server based computing through proposing line rate processing capabilities at closer locations to the end devices. This paper discusses use cases, enabler technologies and protocols for in-network computing. According to our study, considering programmable data plane as an enabler technology, potential in-network computing applications are in-network analytics, in-network caching, in-network security, and in-network coordination. There are also technology specific applications of in-network computing in the scopes of cloud computing, edge computing, 5G/6G, and NFV. In this survey, the state of the art, in the framework of the proposed categorization, is reviewed. Furthermore, comparisons are provided in terms of a set of proposed criteria which assess the methods from the aspects of methodology, main results, as well as application-specific criteria. Finally, we discuss lessons learned and highlight some potential research directions.", "venue": "IEEE Communications Surveys and Tutorials", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Communications Surveys & Tutorials", "pages": "701-761", "volume": "25"}, "authors": [{"authorId": "2709856", "name": "Somayeh Kianpisheh"}, {"authorId": "1682312", "name": "T. Taleb"}], "citations": [{"paperId": "8d484e415d3193e7776bf91a85303c222c6be393", "title": "Graph neural network for in-network placement of real-time metaverse tasks in next-generation network"}, {"paperId": "36f9e2e2987d82f2b02020dd652d21d1523089f1", "title": "A survey on integrated computing, caching, and communication in the cloud-to-edge continuum"}, {"paperId": "600e599f13d9af4f53270512a6c7ffcae8b349c7", "title": "Joint Network Slicing, Routing, and In-Network Computing for Energy-Efficient 6G"}, {"paperId": "ffb7fcaff64a402185bd18b822ad28411ee836c7", "title": "Synchronizing DDoS detection and mitigation based graph learning with programmable data plane, SDN"}, {"paperId": "3c2a5244e38f17892b4132654a62647d3f0ad9e2", "title": "SPARQ: SYN protection using acyclic redundancy check and quartile range on P4 switches"}, {"paperId": "bfaa1a197bf1604cd0b1419c34d80a96a0567e7b", "title": "P4toNFV: Offloading from P4 switches to NFV in programmable data planes"}, {"paperId": "dda878f151af7bf4beddb97779fa348a227c48c7", "title": "Fast In-Network Functionality Embedding in Software-Defined Service-Centric Networking"}, {"paperId": "bd40f7e1e41b18e14eca0a425df81497faf7b2d9", "title": "A Traffic Prioritization Framework For Smart Home IoT Networks using Programmable Data Planes"}, {"paperId": "bdb88c0556f31afe674c7a5e299cfd0cebbe13a1", "title": "Source-Coded Multicast for Efficient Content Delivery"}, {"paperId": "de0a016152d7cc93036287963495ffe4c6cf9a8d", "title": "Enhancing Cache Robustness in Information-Centric Networks: Per-Face Popularity Approaches"}, {"paperId": "63b7b4af081cb4cfc3e6a2014fd6000e78fa393a", "title": "The potential of high-performance computing for the Internet of Sounds"}, {"paperId": "a2de6eddde5fdea934d8aee6941f4188f51dd192", "title": "An Intelligent Blockchain-based Secure Link Failure Recovery Framework for Software-defined Internet-of-Things"}, {"paperId": "ff7545ec1fbc0a45a57e038da4ea0a245bad8221", "title": "Towards a Novel Model for Availability as a Service"}, {"paperId": "a90fa98026e738b89affc06c067130c6d05a18dd", "title": "Double Deep Q-Learning-Based Path Selection and Service Placement for Latency-Sensitive Beyond 5G Applications"}, {"paperId": "7174d83f43a237f3420510180fb203a28de38dd6", "title": "QoS-Aware Service Prediction and Orchestration in Cloud-Network Integrated Beyond 5G"}, {"paperId": "86301b047e1db32d5e72d335f28898116383cb87", "title": "A Sketch-Based Algorithm for Network-Flow Entropy Estimation on Programmable Switches Using P4"}, {"paperId": "9553aab223fe8689970bcda713077087dc1c36bb", "title": "A streaming algorithm and hardware accelerator to estimate the empirical entropy of network flows"}, {"paperId": "eb20d9c17acf1ee528bc540d1dd11aad2a1c7671", "title": "A Review of the In-Network Computing and Its Role in the Edge-Cloud Continuum"}, {"paperId": "599fdacf3f215b19f09824ca531cfbde481eac9f", "title": "Programmable Data Plane Applications in 5G and Beyond Architectures: A Systematic Review"}, {"paperId": "0d276fdb97d3ac0e5d47270f044fbcbcd1a4a572", "title": "Deep Reinforcement Learning-Based Task Offloading Over In-Network Computing and Multi-Access Edge Computing"}, {"paperId": "55167e2e83e8661ee6e6d31f44eb33d300dbedca", "title": "Network Programmability for Smart Factory Mobile Robotics: the SmartEdge Project Approach"}, {"paperId": "58aa39b1389fb7d3d35c3ec2fcad81eb479e77ee", "title": "Performance analysis of general P4 forwarding devices with controller feedback: Single- and multi-data plane cases"}, {"paperId": "61bf7f2fe4d252baff83edd92c39102ffb7825e5", "title": "Toward 6G-Based Metaverse: Supporting Highly-Dynamic Deterministic Multi-User Extended Reality Services"}, {"paperId": "0b8c9c6c74bca6d8c5a424798880553cc71bee05", "title": "Industrial Knee-jerk: In-Network Simultaneous Planning and Control on a TSN Switch"}, {"paperId": "95448a0a598b5ac31f518dacea27d9c02da51373", "title": "An Intelligent User Plane to Support In-Network Computing in 6G Networks"}, {"paperId": "ab9a0e834c536721d0035d62bad0a836aa5f9d8f", "title": "Multi-user edge service orchestration based on Deep Reinforcement Learning"}, {"paperId": "d584f1ebe3652c5209fffa8ebdea1a4966f0cbab", "title": "Selective Content Retrieval in Information-Centric Networking"}, {"paperId": "3bb9088085b153c8e90294ae9511a46e3ffa57a7", "title": "P4 Cybersecurity Solutions: Taxonomy and Open Challenges"}, {"paperId": "31d3c657987119aaa1e0b8306c0abbe84bf35222", "title": "A Survey on Scheduling Techniques in Computing and Network Convergence"}, {"paperId": "f3ea45b2b8f89cfb36653fd3179a81aa8ac2148e", "title": "Desafios para a Computação Energeticamente Eficiente"}]}
