{"paperId": "9980dd79718b5432b4f8080ba6ad89f30da91b57", "publicationVenue": {"id": "334fe43b-8712-418a-80a4-064bf088c79e", "name": "Computer Science Symposium in Russia", "type": "conference", "alternate_names": ["CSR", "Corporate Social Responsibility & Sustainable Development", "Corp Soc Responsib  Sustain Dev", "Int Conf Cyber Secur Resil", "Comput Sci Symp Russ", "International Conference on Cyber Security and Resilience"], "url": "http://www.wikicfp.com/cfp/program?id=610"}, "title": "Secure Communication in Smart Meters using Elliptic Curve Cryptography and Digital Signature Algorithm", "abstract": "With the advancement in the growth of Internet-of-Things (IoT), its number of applications has also increased such as in healthcare, smart cities, vehicles, industries, household appliances, and Smart Grids (SG). One of the major applications of IoT is the SG and smart meter which consists of a large number of internet-connected sensors and can communicate bi-directionally in real-time. The SG network involves smart meters, data collectors, generators, and sensors connected with the internet. SG networks involve the generation, distribution, transmission, and consumption of electrical power supplies. It consists of Household Area Network (HAN), and Neighborhood Area Network (NAN) for communication. Smart meters can communicate bidirectionally with consumers and provide real-time information to utility offices. But this communication channel is a wide-open network for data transmission. Therefore, it makes the SG network and smart meter vulnerable to outside hacker and various Cyber-Physical System (CPS) attacks such as False Data Injection (FDI), inserting malicious data, erroneous data, manipulating the sensor reading values. Here cryptography techniques can play a major role along with the private blockchain model for secure data transmission in smart meters. Hence, to overcome these existing issues and challenges in smart meter communication we have proposed a blockchain-based system model for secure communication along with a novel Advanced Elliptic Curve Cryptography Digital Signature (AECCDS) algorithm in Fog Computing (FC) environment. Here FC nodes will work as miners at the edge of smart meters for secure and real-time communication. The algorithm is implemented using iFogSim, Geth version 1.9.25, Ganache, Truffle for compiling smart contracts, Anaconda (Python editor), and ATOM as language editor for the smart contracts.", "venue": "Computer Science Symposium in Russia", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-07-26", "journal": {"name": "2021 IEEE International Conference on Cyber Security and Resilience (CSR)", "pages": "261-266"}, "authors": [{"authorId": "2150905424", "name": "Saurabh Shukla"}, {"authorId": "3128638", "name": "S. Thakur"}, {"authorId": "1707342", "name": "J. Breslin"}], "citations": [{"paperId": "a1607ed43cf5fa0089d18672b37f7ad7ffe20df5", "title": "Modeling arithmetic systems of elliptic curve cryptography using Microsoft Excel VBA"}, {"paperId": "cd94ecb31b3b74126b77c4514c7aa15a40913270", "title": "Development and Improving Energy Management System in Smart Grid through Integration with Renewable Energy System with AI and Internet of Things"}, {"paperId": "8ab1cea92b6ec94f67b748a5b567939c1fdae658", "title": "Secure Data Transmission using Cryptography for Internet of Things and Sensor Networks Applications"}, {"paperId": "716221d02276e893bd85616429f65d33b6c85e70", "title": "An Overview of Privacy Dimensions on Industrial Internet of Things (IIoT)"}, {"paperId": "c3c3249bda1c1e41b562c8ce3e43358c094f3ab3", "title": "A model for evaluating the impediments to secure and trustworthy IoT environment: a software industry study"}, {"paperId": "7bbe730606d9638bbeabd0ba828a348612d50355", "title": "Predicting Trends and Research Patterns of Smart Cities: A Semi-Automatic Review Using Latent Dirichlet Allocation (LDA)"}, {"paperId": "3873b78bb3379b23a6d344e78ed6fd8d61228af8", "title": "Identification of False Stealthy Data Injection Attacks in Smart Meters Using Machine Learning and Blockchain"}]}
