{"paperId": "99867ddb1918178b18546b496d3601054a163d51", "publicationVenue": {"id": "13925159-5423-4d57-9ac9-3a05a713e0ef", "name": "ACM Transactions on Embedded Computing Systems", "type": "journal", "alternate_names": ["ACM Transactions in Embedded Computing Systems", "ACM Trans Embed Comput Syst"], "issn": "1539-9087", "url": "http://www.acm.org/pubs/contents/journals/tecs/", "alternate_urls": ["http://www.acm.org/tecs/", "http://portal.acm.org/tecs"]}, "title": "A Multi-tenant Key-value SSD with Secondary Index for Search Query Processing and Analysis", "abstract": "Key-value SSDs (KVSSDs) introduced so far are limited in their use as an alternative to the key-value store running on the host due to the following technical limitations. First, they were designed only for a single tenant, limiting the use of multiple tenants. Second, they mainly focused on designing indexes for primary key-based searches, without supporting various queries using a combination of primary key and non-primary attribute-based searches. This article proposes Cerberus, a Log Structured Merged (LSM) tree-based KVSSD armed with (1) namespace and performance isolation for multiple tenants in a multi-tenant environment and (2) capability for processing non-primary attribute-based search queries. Specifically, Cerberus identifies the tenant’s namespace and splits a single large LSM-tree into namespace-specific LSM-tree indexes for tenants. Cerberus also manages secondary LSM-tree indexes to enable non-primary attribute-based data access and fast search query processing. With the SSD-internal CPU/DRAM resources, Cerberus supports non-primary attribute-based search queries and handles complex queries that are combined with search and computing operations. We prototyped Cerberus on the Cosmos+ OpenSSD platform. When there are multiple tenants, Cerberus exhibits up to 2.9× higher read throughput and negligible write overhead compared to existing KVSSD. Cerberus also shows lower latency by up to 9.31× for non-primary attribute-based queries.", "venue": "ACM Transactions on Embedded Computing Systems", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-04-11", "journal": {"name": "ACM Transactions on Embedded Computing Systems", "pages": "1 - 27", "volume": "22"}, "authors": [{"authorId": "52198647", "name": "Donghyun Min"}, {"authorId": "2203547419", "name": "Kihyun Kim"}, {"authorId": "2214148996", "name": "Chaewon Moon"}, {"authorId": "144392776", "name": "Awais Khan"}, {"authorId": "2108155266", "name": "Seungjin Lee"}, {"authorId": "2213980141", "name": "Changhwan Yun"}, {"authorId": "6891319", "name": "Woosuk Chung"}, {"authorId": "46254372", "name": "Youngjae Kim"}], "citations": []}
