{"paperId": "9991395c928243acf18b86a5033d62569011cea8", "publicationVenue": {"id": "011e0c39-7f47-401e-98d2-ee08fdf206a3", "name": "Library hi tech", "type": "journal", "alternate_names": ["Libr Hi Tech", "Library Hi Tech", "Libr hi tech"], "issn": "0737-8831", "url": "https://www.emerald.com/insight/publication/issn/0737-8831"}, "title": "Advancing elderly healthcare: adapting UTAUT2 with inhibitors for wearable device continuance", "abstract": "PurposeWearable health devices (WHDs) have demonstrated significant potential in assisting elderly adults with proactive health management by utilizing sensors to record and monitor various aspects of their health, including physical activity, heart rate, etc. However, limited research has systematically explored older adults’ continued usage intention toward WHD. By utilizing the extended unified theory of acceptance and use of technology (UTAUT2), this paper aims to probe the precursors of elderly adults’ continuance intention to use WHD from an enabler–inhibitor perspective.Design/methodology/approachThe research model was developed based on UTAUT2 and examined utilizing the partial least squares technique (PLS). The research data were collected through in-person meetings with older people (n = 272) in four cities in China.FindingsResults reveal that performance expectancy, effort expectancy, social influence, facilitating conditions, hedonic values and perceived complexity are the positive predictors of elderly adults’ continuance intention to use WHDs. Technology-related anxiety and usage cost negatively influence the formation of older people’s continuance intention.Originality/valueThis work is an original empirical investigation that draws on several theories as guiding frameworks. It adds to the existing literature on the usage of wearable technologies and offers insights into how the elderly’s intentions to continue using WHDs can be developed. This study broadens the scope of the UTAUT2 application and presents an alternative theoretical framework that can be utilized in future research on the usage behavior of wearable devices by individuals.", "venue": "Library hi tech", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-03-22", "journal": {"name": "Library Hi Tech"}, "authors": [{"authorId": "2292852330", "name": "Ruo-yu Liang"}, {"authorId": "2292784511", "name": "Yin Li"}, {"authorId": "2292920063", "name": "Wei Wei"}], "citations": []}
