{"paperId": "999c7fc5bd5c255bf5117a1a9b80ca9793e4058d", "publicationVenue": null, "title": "Trust in Sociotechnical Systems: The Case of Aluminum Packaging Process", "abstract": "In today’s digitized business environment, cybersecurity becomes essential for risk analysis, value chain, and situational awareness. While attackers seek novel tactics and strategies for exploiting a plethora of technologies and software systems, it is crucial to anticipate and mitigate such attempts. The confluence of technologies such as the Internet of Things (IoT), Machine Learning (ML), and Digital Twins (DTs) are playing a significant role in addressing cybersecurity issues. However, due to implicit interaction with physical and digital space, DTs are vulnerable to data adulteration at the input data sources. Ensuring the integrity of input data requires cross-checking, either by using simple observation comparisons of multiple sensors or more advanced algorithms pre-trained on datasets. Considering the aluminum packaging sub-process modeled as a DT, we propose a framework called TRust In sOcio-technical systems (TRIO) that aims to explore how ML algorithms can be used for detecting and preventing irregularities and malicious activities against digital representations of physical assets and, therefore, enhancing trust in sociotechnical systems. TRIO framework supports manufacturing industries to fully benefit from DTs’ predictive maintenance and resource optimization potentials by ensuring the integrity of input data streams. To validate our framework, we implement a Microsoft Azure Digital Twin (ADT)based prototype by integrating ML algorithms that detects and removes data irregularities from sensor-based data. Results show feasibility as the TRIO framework ensures the integrity of data streams inputted to DTs.", "venue": "2023 IEEE Smart World Congress (SWC)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-08-28", "journal": {"name": "2023 IEEE Smart World Congress (SWC)", "pages": "1-8"}, "authors": [{"authorId": "2288587977", "name": "Florian Jauernig"}, {"authorId": "2202085835", "name": "Maryia Falaleyeva"}, {"authorId": "2288591060", "name": "Siola Cevani"}, {"authorId": "2288584601", "name": "Martin Hrabovec"}, {"authorId": "2288584124", "name": "Dmitrii Matveev"}, {"authorId": "2275774857", "name": "Mubashar Iqbal"}, {"authorId": "2288591820", "name": "Sabah Suhail"}], "citations": []}
