{"paperId": "99a9ca8950616b84fe8003459e712a87a0d3e24c", "publicationVenue": null, "title": "Real-Time Implementation of Model Predictive Control in a Low-Cost Embedded Device", "abstract": "This document presents a general description of the implementation of a low-cost system for flow control. A preconditioning of the signal coming from the process to be controlled is carried out and, through Arduino UNO, data is acquired. Using this data in the embedded board Raspberry Pi 3, a predictive control by model (MPC) has been implemented in real time. The plant model is obtained using the identification tool of the MATLAB software. The design of the controller which are in the latest version of this software, has been developed in Simulink using the new complements made for this board. The experimental results show that despite the technical limitations and the high computational cost that this controller represents, both devices can work together and present high performance, robustness and good response in the presence of disturbances.", "venue": "", "year": 2018, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "145293731", "name": "J. Espinoza"}], "citations": [{"paperId": "107bc857bc8eb8395e6273be059021488d257d3b", "title": "A Comparative Study of Several pH Control Laws Implemented to a Smart Hydroponics Farm"}, {"paperId": "e6a0a0e9f831a734de43d411f82b3dbcb4a8790b", "title": "Optimization of Model Predictive Control Weights for Control of Permanent Magnet Synchronous Motor by Using the Multi Objective Bees Algorithm"}, {"paperId": "b766934b6b585dc656b75b3bd16100f5d16bd32e", "title": "Real-Time Model Predictive Control of an Industrial Internet Platform"}, {"paperId": "2a10be9889a69a94fc77403a3099252c1ec0e0cf", "title": "Model based predictive control strategy for water saving drip irrigation"}, {"paperId": "088cc578ebc4e743b79a2965d721f6196bc3bf8b", "title": "Stabilize Nonlinear Interactive Process by Predictive Method on Receding Horizon"}]}
