{"paperId": "99b3ef8a399d60bd683414f75961b82913abff7e", "publicationVenue": {"id": "0471222d-7141-46cf-8bf3-e7e1676553d1", "name": "IEEE International Symposium on Software Reliability Engineering", "type": "conference", "alternate_names": ["IEEE Int Symp Softw Reliab Eng", "Int Symp Softw Reliab Eng", "International Symposium on Software Reliability Engineering", "ISSRE"], "url": "http://www.wikicfp.com/cfp/program?id=1756"}, "title": "Graceful ECC-uncorrectable Error Handling in the Operating System Kernel", "abstract": "Memory errors that can be detected but cannot be fixed by ECC modules, called ECC-uncorrectable errors, have a serious impact on the operating system (OS) kernel, the primary software layer to control hardware and applications. When an ECC-uncorrectable error corrupts the OS kernel's memory contents and causes the OS kernel to stop, all of the running applications also stop because they are no longer scheduled. The standard means of recovery from ECC-uncorrectable errors in the OS kernel is to reboot the kernel itself. Such a reboot involves rebooting all the running applications whose memory contents are not damaged; in turn, this triggers restoration of their running states, which is non-trivial in modern big-memory applications. This paper presents Ev6, an OS kernel that survives ECC-uncorrectable errors in the kernel memory space. Ev6 prunes its in-memory objects damaged by ECC-uncorrectable errors and reconstructs its internal structures to keep the OS kernel running as long as possible. We prototyped Ev6 on xv6 and conducted several experiments. The experimental results show that Ev6 gracefully handles our fault injections with trivial runtime and memory space overheads.", "venue": "IEEE International Symposium on Software Reliability Engineering", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-10-01", "journal": {"name": "2022 IEEE 33rd International Symposium on Software Reliability Engineering (ISSRE)", "pages": "109-120"}, "authors": [{"authorId": "2197597395", "name": "Takumi Iguchi"}, {"authorId": "2149654730", "name": "Hiroshi Yamada"}], "citations": []}
