{"paperId": "99b6577a962574de904c75dc977232fedabfa533", "publicationVenue": null, "title": "Fault Detection and Diagnosis of Air Handling Units Based On Adversarial Multi-task Learning", "abstract": "Thanks to the development of sensor networks and Artificial Intelligence algorithms, modern smart buildings have adopted advanced computer technology to integrate various building control and functional modules to achieve fast and accurate responses to occupancy needs. However, The smart buildings system is complex, and the connection between various outer environmental conditions and inner interactions has not been adequately addressed, resulting in low FDD efficiency. In this paper, we proposed an Adversarial Multi-task Learning-based Fault Detection and Diagnosis (AML-FDD) framework to benefit the learning process by mining data collected under different environmental conditions via a unified model. The proposed AML-FDD adopted multi-task learning principles for collaboratively mining hidden knowledge among various FDD tasks to obtain better FDD effects. The framework-wise common features were utilized for training all tasks, and the task-wise specific features were used to train each task privately. Besides, we adopted an adversarial training manner with orthogonal regulations to guarantee the discrimination between task-shared and task-specific feature embedding. We conducted various experiments in the ASHRAE Research Project 1312 (RP-1312) and ASHRAE Research Project 1020 (RP-1020), and experimental results showed that AML-FDD outperformed state-of-the-art multi-task-based and single-task-based FDD.", "venue": "2023 IEEE International Conference on Data Mining Workshops (ICDMW)", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-12-04", "journal": {"name": "2023 IEEE International Conference on Data Mining Workshops (ICDMW)", "pages": "89-98"}, "authors": [{"authorId": "2283442576", "name": "Jingwen Tan"}, {"authorId": "2283314255", "name": "Dan Li"}, {"authorId": "2283261402", "name": "Zibin Zheng"}, {"authorId": "2282411712", "name": "See-Kiong Ng"}], "citations": []}
