{"paperId": "99bc301737445b538fd008284ae729385951e064", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Conceptual Model for Determining the Statistical Significance of Predictive Indicators for Bus Transit Demand Forecasting", "abstract": "This article addresses the possibility of improving the traditional bus passenger demand forecasting models by leveraging additional data from relevant big data systems and proposes a conceptual framework for developing big data-based forecasting models. Based on the data extracted from available big data systems, the authors have developed a conceptual procedural framework for determining the significance of statistical indicators that can potentially be used as predictor variables for forecasting future passenger demand. At the first stage of the proposed framework, the statistical significance of partial linear correlations between observed statistical indicators and bus ridership demand are determined. All statistical indicators identified as potentially significant are further tested for multicollinearity, homoscedasticity, autocorrelation and multivariate normality to determine the suitability of their inclusion in the final equation of the prediction model. The final formulation of the predictive model was developed using stepwise regression. The R programming language was used to implement the proposed procedural framework to develop a model suitable for predicting passenger demand on the Prizren-Zagreb international bus route. Two predictor variables identified as the most statistically significant are the population of Kosovo and the annual number of Kosovo citizens crossing the Croatian border by bus.", "venue": "Sustainability", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-12-31", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "50711879", "name": "B. Jovanović"}, {"authorId": "101345312", "name": "Kamer Shabanaj"}, {"authorId": "3260384", "name": "M. Ševrović"}], "citations": []}
