{"paperId": "99c0f6aceab8662229cfd507dd3b6a3a508d066e", "publicationVenue": {"id": "2dc4386c-f418-4a62-a2c3-6b89b06981be", "name": "Journal of Intelligent & Fuzzy Systems", "type": "journal", "alternate_names": ["Journal of Intelligent and Fuzzy Systems", "J Intell  Fuzzy Syst", "J Intell Fuzzy Syst"], "issn": "1064-1246", "url": "http://content.iospress.com/journals/journal-of-intelligent-and-fuzzy-systems/", "alternate_urls": ["http://www.iospress.nl/journal-of-intelligent-fuzzy-systems/", "https://www.iospress.nl/html/10641246.php"]}, "title": "An early discovery of intrusion attack using novel optimized deep learning for internet of things", "abstract": "In the past couple of years, neural networks have gained widespread use in network security analysis. This type of analysis is usually performed in a nonlinear and highly correlated manner. Due to the immense amount of data traffic, the current models are prone to false alarms and poor detection. Deep-learning models can help security researchers identify and extract data features that are related to an attack. They can also minimize the data’s dimensionality and detect intrusions. Unfortunately, the complexity of the network structure and hidden neurons of a deep-learning model can be set by error-prone procedures. In order to improve the performance of deep learning models, a new algorithm is proposed. This method combines a gradient boost regression and particle swarm optimization. The proposes a method called the Spark-DBN-SVM-GBR algorithm. The simulations conducted proposed algorithm revealed that it has a better accuracy rate than other deep learning models and the experiments conducted on the PSO-GBR algorithm revealed that it performed better than the current optimization technique when detecting unauthorized attack activities.", "venue": "Journal of Intelligent & Fuzzy Systems", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-29", "journal": {"name": "J. Intell. Fuzzy Syst.", "pages": "5455-5463", "volume": "46"}, "authors": [{"authorId": "2292122820", "name": "M. A. Kumar"}, {"authorId": "2292041750", "name": "M. S. Priya"}, {"authorId": "2249385738", "name": "R. Arunprakash"}], "citations": []}
