{"paperId": "99c1888146ba51274ae23157dde72d30f3a13141", "publicationVenue": {"id": "d5b215f3-f737-45b2-875b-df309ce14c43", "name": "Scientific Programming", "type": "journal", "alternate_names": ["Sci Program"], "issn": "1058-9244", "url": "https://www.hindawi.com/journals/sp/", "alternate_urls": ["https://www.iospress.nl/html/10589244.php", "https://www.wiley.com/legacy/compbooks/compjournals/sciprog.html", "http://content.iospress.com/journals/scientific-programming"]}, "title": "Spring Festival Holiday Tourism Data Mining Based on the Deep Learning Model", "abstract": "With the advent of the era of big data, people have entered a situation of information overload, how do users filter out the information they need from a large amount of information. When users browse the website, they will record their search or click behavior, and the recommendation system will mine the data based on these data, and recommend the information they need for each user. With the birth of the recommender system, it has indeed changed the way people obtain information. Instead of relying solely on search engines to obtain information, it can obtain the information they want without people’s “consciousness.” This shift has made it easier for people to access information. This paper conducts research on travel recommendation during the Spring Festival holiday. The paper introduces deep learning model and data mining technology, proposes that the recommendation system has three important modules, and obtains the corresponding flowchart. The recommendation system was optimized, and a comparison chart of coverage before and after optimization was obtained. Before optimization, the coverage rate of cities and scenic spots was 45.52% and 21.25%, respectively, and reached 55.65% and 49.81% after optimization.", "venue": "Scientific Programming", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-06-18", "journal": {"name": "Scientific Programming"}, "authors": [{"authorId": "2108762116", "name": "Ruijun Wang"}], "citations": [{"paperId": "9ea8582b878dbe2fe5ce7003b48ddb829d3b703e", "title": "Developing an MQ-LSTM-Based Cultural Tourism Accelerator with Database Security"}]}
