{"paperId": "99c46cac8b4a0b9e91176f7651855ff0a8ff5347", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Classification of Alzheimer’s Disease Based on White Matter Connectivity Network", "abstract": "Alzheimer’s disease (AD) is one of the most common irreversible brain diseases in the elderly. Mild cognitive impairment (MCI) is an early symptom of AD, and the early intervention of MCI may slow down the progress of AD. However, due to the subtle neuroimaging differences between MCI and normal control (NC), the clinical diagnosis is subjective and easy to misdiagnose. Machine learning can extract depth features from neural images, and analyze and label them to assist the diagnosis of diseases. This paper combines diffusion tensor imaging (DTI) and support vector machine (SVM) to classify AD, MCI, and NC. First, the white matter connectivity network was constructed based on DTI. Second, the nodes with significant differences between groups were screened out by the two-sample t-test. Third, the optimal feature subset was selected as the classification feature by recursive feature elimination (RFE). Finally, the Gaussian kernel support vector machine was used for classification. The experiment tested and verified the data downloaded from the Alzheimer’s Disease Neuroimaging Initiative (ADNI) database, and the area under the curve (AUC) of AD/MCI and MCI/NC are 0.94 and 0.95, respectively, which have certain competitive advantages compared with other methods.", "venue": "Applied Sciences", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-11-04", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "2112091744", "name": "Xiaoli Yang"}, {"authorId": "2261716575", "name": "Yuxin Xia"}, {"authorId": "2109661174", "name": "Zhenwei Li"}, {"authorId": "2261684070", "name": "Lipei Liu"}, {"authorId": "2261678284", "name": "Zhipeng Fan"}, {"authorId": "2261698720", "name": "Jiayi Zhou"}], "citations": [{"paperId": "a568dbfcb735d933c00734cd5e89f59fb75171fb", "title": "Sparse Deep Neural Network for Encoding and Decoding the Structural Connectome"}]}
