{"paperId": "99e568d08ad43f1dc9e9ad3fe138e90e6d5bcefe", "publicationVenue": {"id": "7c9d091e-015e-4e5d-a11f-9bc369fcf414", "name": "IEEE Transactions on Parallel and Distributed Systems", "type": "journal", "alternate_names": ["IEEE Trans Parallel Distrib Syst"], "issn": "1045-9219", "url": "http://www.computer.org/tpds", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=71"]}, "title": "Wukong+G: Fast and Concurrent RDF Query Processing Using RDMA-assisted GPU Graph Exploration", "abstract": "With the increasing scale of RDF graphs and the concurrency level of SPARQL queries, current RDF systems are confronted with inefficient concurrent query processing on massive data parallelism. The situation becomes more severe in the face of data-intensive queries (aka heavy query), which usually lead to suboptimal response time (latency) as well as throughput collapse. In this article, we present Wukong+G, the first graph-based distributed RDF query processing system that efficiently exploits the hybrid parallelism of CPU and GPU. Wukong+G is made fast and concurrent with four key designs. First, Wukong+G tames massive random memory accesses in graph exploration by efficiently mapping data between CPU and GPU for latency hiding, including a set of techniques like query-aware prefetching, pattern-aware pipelining and fine-grained swapping. Second, Wukong+G scales up by introducing a GPU-friendly RDF store to support RDF graphs exceeding GPU memory size, by using techniques like predicate-based grouping, pairwise caching and look-ahead replacing to narrow the gap between host and device memory scale. Third, Wukong+G scales out through a communication layer that decouples the transferring process for query metadata and intermediate results, and further leverages both native and GPUDirect RDMA to enable efficient communication on a CPU/GPU cluster. Finally, Wukong+G simultaneously runs multiple queries on a single GPU to improve overall throughput and fully exploits hardware heterogeneity (CPU/GPU) by scheduling a single query on CPU and GPU adaptively. We have implemented Wukong+G by extending a state-of-the-art distributed RDF store (i.e., Wukong) with distributed GPU support. Evaluation on a heterogeneous CPU/GPU cluster with RDMA-capable network shows that Wukong+G outperforms Wukong by up to 9.0 (from 2.3) and scales well on 10 GPU cards for heavy queries. Wukong+G can also improve both latency and throughput by more than one order of magnitude when facing hybrid workloads", "venue": "IEEE Transactions on Parallel and Distributed Systems", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Transactions on Parallel and Distributed Systems", "pages": "1-1", "volume": "PP"}, "authors": [{"authorId": "2080044695", "name": "Zihang Yao"}, {"authorId": "144593763", "name": "Rong Chen"}, {"authorId": "7274044", "name": "B. Zang"}, {"authorId": "2118438836", "name": "Haibo Chen"}], "citations": [{"paperId": "3276adb3586c27c84cba87730d8dd1674c0ca29c", "title": "An efficient and scalable SPARQL query processing framework for big data using MapReduce and hybrid optimum load balancing"}, {"paperId": "906cf158fd277f40ce43bf654c0ac4c81d513ce1", "title": "JQPro:Join Query Processing in a Distributed System for Big RDF Data Using the Hash-Merge Join Technique"}, {"paperId": "571ca2c05615af75a392f36a00e1ddc838c83678", "title": "Co-Concurrency Mechanism for Multi-GPUs in Distributed Heterogeneous Environments"}, {"paperId": "7c69773a3fc298ffb1cd09ec713739a672401e25", "title": "Concurrent Graph Queries on the Lucata Pathfinder"}, {"paperId": "04391402cd9b4cf5794a7778e5d1ec320806dbfd", "title": "ShaderNet: graph-based shader code analysis to accelerate GPU's performance improvement"}, {"paperId": "2145129c795c7b7b36fb98c7aa3b91ccd2d398b8", "title": "This paper is included in the Proceedings of the 2022 USENIX Annual Technical Conference."}]}
