{"paperId": "99f99ea361cafedb2d2a60eae5de0b92f04f7dcc", "publicationVenue": {"id": "fe526af8-da0b-4a52-925c-e0e345537a7e", "name": "International Conference on Wireless Communications and Signal Processing", "type": "conference", "alternate_names": ["Int Conf Wirel Commun Signal Process", "WCSP"], "url": "http://www.ic-wcsp.org/"}, "title": "Asynchronous Federated Learning Based Mobility-aware Caching in Vehicular Edge Computing", "abstract": "Vehicular edge computing (VEC) is a promising technology to support real-time applications through caching the contents in the roadside units (RSUs), thus vehicles can fetch the contents requested by vehicular users (VUs) from the RSU within short time. The capacity of the RSU is limited and the contents requested by VUs change frequently due to the high-mobility characteristics of vehicles, thus it is essential to predict the most popular contents and cache them in the RSU in advance. The RSU can train model based on the VUs' data to effectively predict the popular contents. However, VU s are often reluctant to share their data with others due to the personal privacy. Federated learning (FL) allows each vehicle to train the local model based on VUs' data, and upload the local model to the RSU instead of data to update the global model, and thus VUs' privacy information can be protected. The traditional synchronous FL must wait all vehicles to complete training and upload their local models for global model updating, which would cause a long time to train global model. The asynchronous FL updates the global model in time once a vehicle's local model is received. However, the vehicles with different staying time have different impacts to achieve the accurate global model. In this paper, we consider the vehicle mobility and propose an Asynchronous FL based Mobility-aware Edge Caching (AFMC) scheme to obtain an accurate global model, and then propose an algorithm to predict the popular contents based on the global model. Experimental results show that AFMC outperforms other baseline caching schemes.", "venue": "International Conference on Wireless Communications and Signal Processing", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-08-02", "journal": {"name": "2022 14th International Conference on Wireless Communications and Signal Processing (WCSP)", "pages": "1-5"}, "authors": [{"authorId": "2180533675", "name": "Wenhua Wang"}, {"authorId": "2110260409", "name": "Yu Zhao"}, {"authorId": "145575667", "name": "Qiong Wu"}, {"authorId": "39110928", "name": "Q. Fan"}, {"authorId": "2111386542", "name": "Cui Zhang"}, {"authorId": "49969614", "name": "Zhengquan Li"}], "citations": [{"paperId": "d4995643bd21f3d45d80dc0f1883421ce246fcd1", "title": "Cooperative Edge Caching Based on Elastic Federated and Multi-Agent Deep Reinforcement Learning in Next-Generation Network"}]}
