{"paperId": "9a06a9335effdd50879fb9793cf2319009b91148", "publicationVenue": {"id": "949c1b01-6a8c-4610-a5df-ba163cfa2242", "name": "Géosciences", "alternate_names": ["Geosciences", "Géosciences"], "issn": "1772-094X", "alternate_issns": ["2076-3263", "2163-1697", "2163-1719"], "url": "https://www.brgm.fr/decouverte/ouvrages-cartes-brgm-editions/geosciences-revue-brgm-terre-durable", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-225432", "http://www.sapub.org/journal/archive.aspx?journalid=1016", "http://journal.sapub.org/geo", "http://www.sapub.org/journal/aimsandscope.aspx?journalid=1016", "https://www.mdpi.com/journal/geosciences", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-225432", "https://www.mdpi.com/journal/geosciences/about", "http://editions.brgm.fr/publication/pubGeoscience.jsp?cook=1394185329771&pageActive=0"]}, "title": "Flood-Prone Zones of Meandering Rivers: Machine Learning Approach and Considering the Role of Morphology (Kashkan River, Western Iran)", "abstract": "We utilized the random forest (RF) machine learning algorithm, along with nine topographical/morphological factors, namely aspect, slope, geomorphons, plan curvature, profile curvature, terrain roughness index, surface texture, topographic wetness index (TWI), and elevation. Our objective was to identify flood-prone areas along the meandering Kashkan River and investigate the role of topography in riverbank inundation. To validate the flood susceptibility map generated by the random forest algorithm, we employed Sentinel-1 GRDH SAR imagery from the March 2019 flooding event in the Kashkan river. The SNAP software and the OTSU thresholding method were utilized to extract the flooded/inundated areas from the SAR imagery. The results showed that the random forest model accurately pinpointed areas with a “very high” and “high” risk of flooding. Through analysis of the cross-sections and SAR-based flood maps, we discovered that the topographical confinement of the meander played a crucial role in the extent of inundation along the meandering path. Moreover, the findings indicated that the inner banks along the Kashkan river were more prone to flooding compared to the outer banks.", "venue": "Géosciences", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-03", "journal": {"name": "Geosciences"}, "authors": [{"authorId": "108471100", "name": "K. Ghahraman"}, {"authorId": "2237832644", "name": "Balázs Nagy"}, {"authorId": "2237932679", "name": "Fatemeh Nooshin Nokhandan"}], "citations": []}
