{"paperId": "9a06964b5168500f2b1a3887a7b7e2d267117094", "publicationVenue": {"id": "f8af72e3-2292-432f-9dc3-b181aeea2e70", "name": "Journal of Geography and Cartography", "type": "journal", "alternate_names": ["J Geogr Cartogr"], "issn": "2578-1979", "url": "https://systems.enpress-publisher.com/index.php/JGC"}, "title": "Digital twins and 3D information modeling in a smart city for traffic controlling: A review", "abstract": "The idea of a smart city has evolved in recent years from limiting the city’s physical growth to a comprehensive idea that includes physical, social, information, and knowledge infrastructure. As of right now, many studies indicate the potential advantages of smart cities in the fields of education, transportation, and entertainment to achieve more sustainability, efficiency, optimization, collaboration, and creativity. So, it is necessary to survey some technical knowledge and technology to establish the smart city and digitize its services. Traffic and transportation management, together with other subsystems, is one of the key components of creating a smart city. We specify this research by exploring digital twin (DT) technologies and 3D model information in the context of traffic management as well as the need to acquire them in the modern world. Despite the abundance of research in this field, the majority of them concentrate on the technical aspects of its design in diverse sectors. More details are required on the application of DTs in the creation of intelligent transportation systems. Results from the literature indicate that implementing the Internet of Things (IoT) to the scope of traffic addresses the traffic management issues in densely populated cities and somewhat affects the air pollution reduction caused by transportation systems. Leading countries are moving towards integrated systems and platforms using Building Information Modelling (BIM), IoT, and Spatial Data Infrastructure (SDI) to make cities smarter. There has been limited research on the application of digital twin technology in traffic control. One reason for this could be the complexity of the traffic system, which involves multiple variables and interactions between different components. Developing an accurate digital twin model for traffic control would require a significant amount of data collection and analysis, as well as advanced modeling techniques to account for the dynamic nature of traffic flow. We explore the requirements for the implementation of the digital twin in the traffic control industry and a proper architecture based on 6 main layers is investigated for the deployment of this system. In addition, an emphasis on the particular function of DT in simulating high traffic flow, keeping track of accidents, and choosing the optimal path for vehicles has been reviewed. Furthermore, incorporating user-generated content and volunteered geographic information (VGI), considering the idea of the human as a sensor, together with IoT can be a future direction to provide a more accurate and up-to-date representation of the physical environment, especially for traffic control, according to the literature review. The results show there are some limitations in digital twins for traffic control. The current digital twins are only a 3D representation of the real world. The difficulty of synchronizing real and virtual world information is another challenge. Eventually, in order to employ this technology as effectively as feasible in urban management, the researchers must address these drawbacks.", "venue": "Journal of Geography and Cartography", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-01-04", "journal": {"name": "Journal of Geography and Cartography"}, "authors": [{"authorId": "2221025298", "name": "Zahra Rezaei"}, {"authorId": "2751790", "name": "Mohammad H. Vahidnia"}, {"authorId": "31962068", "name": "H. Aghamohammadi"}, {"authorId": "2199034343", "name": "Zahra Azizi"}, {"authorId": null, "name": "Saeed Behzadi"}], "citations": [{"paperId": "7993e74f5a55cba4c36e57ff0c421b649aedf4c9", "title": "Towards efficient traffic crash detection based on macro and micro data fusion on expressways: A digital twin framework"}, {"paperId": "ec713809efe8bc289e37e0301825556843b49e3a", "title": "Robust watermarking algorithm based on mahalanobis distance and ISS feature point for 3D point cloud data"}]}
