{"paperId": "9a0be4187a5b45374f6b0b6dad24182c71604d39", "publicationVenue": {"id": "aa746a02-d187-42c2-bdf9-df6a5d4e648c", "name": "Computer/law journal", "type": "journal", "alternate_names": ["Computer journal", "The Computer Journal", "Comput j", "Comput J"], "issn": "0164-8756", "alternate_issns": ["0010-4620"], "url": "https://repository.jmls.edu/jitpl/all_issues.html", "alternate_urls": ["http://comjnl.oxfordjournals.org/"]}, "title": "A Federated Learning Approach for Privacy Protection in Context-Aware Recommender Systems", "abstract": "\n Privacy protection is one of the key concerns of users in recommender system-based consumer markets. Popular recommendation frameworks such as collaborative filtering (CF) suffer from several privacy issues. Federated learning has emerged as an optimistic approach for collaborative and privacy-preserved learning. Users in a federated learning environment train a local model on a self-maintained item log and collaboratively train a global model by exchanging model parameters instead of personalized preferences. In this research, we proposed a federated learning-based privacy-preserving CF model for context-aware recommender systems that work with a user-defined collaboration protocol to ensure users’ privacy. Instead of crawling users’ personal information into a central server, the whole data are divided into two disjoint parts, i.e. user data and sharable item information. The inbuilt power of federated architecture ensures the users’ privacy concerns while providing considerably accurate recommendations. We evaluated the performance of the proposed algorithm with two publicly available datasets through both the prediction and ranking perspectives. Despite the federated cost and lack of open collaboration, the overall performance achieved through the proposed technique is comparable with popular recommendation models and satisfactory while providing significant privacy guarantees.", "venue": "Computer/law journal", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-04-30", "journal": {"name": "Comput. J.", "pages": "1016-1027", "volume": "64"}, "authors": [{"authorId": "50041680", "name": "Waqar Ali"}, {"authorId": "47654405", "name": "Rajesh Kumar"}, {"authorId": "2075351260", "name": "Zhiyi Deng"}, {"authorId": "2130353001", "name": "Yansong Wang"}, {"authorId": "145496509", "name": "Jie Shao"}], "citations": [{"paperId": "0c6290aba17c0aebd9cb9784df6453378e0f38d4", "title": "Communication-Efficient Federated Neural Collaborative Filtering with Multi-Armed Bandits"}, {"paperId": "4afb2b50659f13f376fac3b913cba9070b7ebdf8", "title": "Deep learning-based privacy-preserving recommendations in federated learning"}, {"paperId": "2badf00f3c09d3ac14d911018e4657430f217858", "title": "Federated recommender systems based on deep learning: The experimental comparisons of deep learning algorithms and federated learning aggregation strategies"}, {"paperId": "b519d7f7d84c68ff6ff276a55482ed180af1eb72", "title": "CSFL: Cooperative Security Aware Federated Learning Model Using The Blockchain"}, {"paperId": "f1b8bd9a3862a88c6004ca3da7310c4c3968e053", "title": "Fairness and Privacy-Preserving in Federated Learning: A Survey"}, {"paperId": "86e11c64f8730fd0d019cab82470384b81e879be", "title": "A systematic review of privacy techniques in recommendation systems"}, {"paperId": "e377192c8e7bd70e6ce435ababc23642d4d6d83b", "title": "A Comprehensive Survey on Privacy-Preserving Techniques in Federated Recommendation Systems"}, {"paperId": "f7833d272af3614923e300bfedc51ace83587428", "title": "PerFedRec++: Enhancing Personalized Federated Recommendation with Self-Supervised Pre-Training"}, {"paperId": "373dbd7ac3844622a511b6936ab166b77e367747", "title": "Dynamic context management in context-aware recommender systems"}, {"paperId": "ddfd9568d69e20fa33b3ec8ec9573b18d38ffacb", "title": "CAML: Contextual augmented meta-learning for cold-start recommendation"}, {"paperId": "3bbcc04340d2e4c4b405551d3ed699adaefa6f3c", "title": "Detecting Group Shilling Attacks In Recommender Systems Based On User Multi-dimensional Features And Collusive Behaviour Analysis"}, {"paperId": "51e7c5941e55489260cf56540a0ab7af059a7e27", "title": "Personalized Federated Recommendation via Joint Representation Learning, User Clustering, and Model Adaptation"}, {"paperId": "c5eae4a4c9da6919951b6822f3881dbd4f95974d", "title": "ReFRS: Resource-efficient Federated Recommender System for Dynamic and Diversified User Preferences"}, {"paperId": "87f80c887f1291ceb82aa995311e1cd2a4fa3a80", "title": "Federated recommenders: methods, challenges and future"}, {"paperId": "7fdd157c31fa39d07562ccfa6a03f2be4cbdb9bf", "title": "Inferring context with reliable collaborators: a novel similarity estimation method for recommender systems"}, {"paperId": "6610da81d2d7dcb8ef72a937404564ca308df04d", "title": "Privacy-preserving federated learning framework in multimedia courses recommendation"}, {"paperId": "3b6a6007125857c1cc276f315552dc9b76acb77b", "title": "A Comparative Analysis of Machine Learning and Grey Models"}, {"paperId": "bbd008d65869295c65a3ad4109c957c59bdb8f68", "title": "An Adaptive Approach for Preserving Privacy in Context Aware Applications for Smartphones in Cloud Computing Platform"}, {"paperId": "9957c22fbeeb57e6bc9d3b601613f24f5a785101", "title": "Federated Learning as an Analytical Framework for Personal Data Management - a proposition paper"}, {"paperId": "b67a22f875e0c5ff52cdc26b01668e7343fff6d6", "title": "Empirical performance analysis of classification methods on cultural heritage database"}, {"paperId": "928d8442c4e6ab0ab06ba8e4c464c691c837fb14", "title": "Privacy-preserving Multimedia Data Analysis"}]}
