{"paperId": "9a11f0853c965b46e766492b4fd156a7804240fb", "publicationVenue": {"id": "501c1070-b5d2-4ff0-ad6f-8769a0a1e13f", "name": "Wireless Communications and Mobile Computing", "type": "journal", "alternate_names": ["Wirel Commun Mob Comput"], "issn": "1530-8669", "url": "https://www.hindawi.com/journals/wcmc/", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/15308677", "http://www.interscience.wiley.com/jpages/1530-8669/"]}, "title": "SensIoT: An Extensible and General Internet of Things Monitoring Framework", "abstract": "SensIoT is an open-source sensor monitoring framework for the Internet of Things, which utilizes proven technologies to enable easy deployment and maintenance while staying flexible and scalable. It closes the gap between highly specialized and, therefore, inflexible sensor monitoring solutions, which are only adjusted to a specific context, and the development of every other solution from scratch. Our framework fits a variety of use cases by providing an easy to set up, extensible, and affordable solution. The development is based on our former published framework MonTreAL, whose goal is to offer an environmental monitoring solution for libraries to guarantee cultural heritage to be conserved and prevented from serious damage, for example, from mold formation in closed stocks. It is a solution with virtualized microservices delivered by a famous container technology called Docker that is solely executable on one or more single board computers like the Raspberry Pi by providing automatic scaling and resilience of all sensor services. For SensIoT we extended the capability of MonTreAL to integrate commodity servers into the cluster to enhance the ease of setup and maintainability on already existing infrastructures. Therefore, we followed the paradigm to distribute microservices on small computing nodes first, thus not utilizing well-known cloud computing concepts. To achieve resilience and fault tolerance we also based our system on a microservice architecture, where the service orchestration is solved by Docker Swarm. As proof of concept, we are able to present our current data collection of the University of Bamberg’s Library that runs our system since autumn 2017. To make our system even better we are working on the integration of other sensor types and better performance management of SD-cards in Raspberry Pis.", "venue": "Wireless Communications and Mobile Computing", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-03-07", "journal": {"name": "Wirel. Commun. Mob. Comput.", "pages": "4260359:1-4260359:15", "volume": "2019"}, "authors": [{"authorId": "145106717", "name": "Marcel Großmann"}, {"authorId": "39418515", "name": "Steffen Illig"}, {"authorId": "24023677", "name": "Cornelius Matejka"}], "citations": [{"paperId": "8c6bc3d1c1f43f277866ac4e5022cf8478e290c2", "title": "Sensors on Internet of Things Systems for the Sustainable Development of Smart Cities: A Systematic Literature Review"}, {"paperId": "232f92c3eec121557833d2ea2d1d5184ae6586d2", "title": "Applicability of Serverless Computing in Fog Computing Environments for IoT Scenarios"}, {"paperId": "ffb4437916e9564c0ba41fce60e637cd21035849", "title": "A Fog Computing Architecture to Share Sensor Data by Means of Blockchain Functionality"}, {"paperId": "92bd4b02ee33b9f017b1fd8e1fa6db5d14ae65f2", "title": "A Design Approach to IoT Endpoint Security for Production Machinery Monitoring"}, {"paperId": "ba11222a22ab547ca28e5e4f56e72dace8fd6689", "title": "Implementasi Golang dan New Simple Queue pada Sistem Sandbox Pihak Ketiga Berbasis REST API"}]}
