{"paperId": "9a168f5bbd5110a375b664c2c8e7d432d2146956", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Kudu: An Efficient and Scalable Distributed Graph Pattern Mining Engine", "abstract": "This paper proposes Kudu, a distributed execution engine with a well-defined abstraction that can be integrated with existing single-machine graph pattern mining (GPM) systems to provide efficiency and scalability at the same time. The key novelty is the extendable embedding abstraction which can express pattern enumeration algorithms, allow fine-grained task scheduling, and enable low-cost GPM-specific data reuse to reduce communication cost. The effective BFS-DFS hybrid exploration generates sufficient concurrent tasks for communication-computation overlapping with bounded memory consumption. Two scalable distributed GPM systems are implemented by porting Automine and GraphPi on Kudu. Our evaluation shows that Kudu based systems significantly outperform state-of-the-art distributed GPM systems with partitioned graphs by up to 75 . 5 × (on average 19 . 0 × ), achieve similar or even better performance compared with the fastest distributed GPM systems with replicated graph, and scale to massive graphs with more than one hundred billion edges with a commodity cluster. ,", "venue": "arXiv.org", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-05-08", "journal": {"name": "ArXiv", "volume": "abs/2105.03789"}, "authors": [{"authorId": "2108536872", "name": "Jingji Chen"}, {"authorId": "2288203548", "name": "Xuehai Qian"}], "citations": [{"paperId": "ebc06a22fa91e03648bc38e3a02cf444d8d3785e", "title": "CUTTANA: Scalable Graph Partitioning for Faster Distributed Graph Databases and Analytics"}, {"paperId": "1bb10600aa2ebc639a878fde3b0c75471abd0da5", "title": "Shogun: A Task Scheduling Framework for Graph Mining Accelerators"}, {"paperId": "17f3d9b84c21cfc313d5c11f9efba37605cade94", "title": "Software Systems Implementation and Domain-Specific Architectures towards Graph Analytics"}, {"paperId": "1dc9626062182372d4a97e245a64fcabadbe49ca", "title": "Efficient and Scalable Graph Pattern Mining on GPUs"}]}
