{"paperId": "9a374c2aa04d0428a3bc8d6e8526a9c19ed7e44e", "publicationVenue": {"id": "7b2adce0-d53f-49d6-8784-b0645604fe62", "name": "ACM Computing Surveys", "type": "journal", "alternate_names": ["ACM Comput Surv"], "issn": "0360-0300", "url": "http://www.acm.org/pubs/surveys/", "alternate_urls": ["http://portal.acm.org/csur", "https://csur.acm.org/", "http://csur.acm.org/"]}, "title": "The Serverless Computing Survey: A Technical Primer for Design Architecture", "abstract": "The development of cloud infrastructures inspires the emergence of cloud-native computing. As the most promising architecture for deploying microservices, serverless computing has recently attracted more and more attention in both industry and academia. Due to its inherent scalability and flexibility, serverless computing becomes attractive and more pervasive for ever-growing Internet services. Despite the momentum in the cloud-native community, the existing challenges and compromises still wait for more advanced research and solutions to further explore the potential of the serverless computing model. As a contribution to this knowledge, this article surveys and elaborates the research domains in the serverless context by decoupling the architecture into four stack layers: Virtualization, Encapsule, System Orchestration, and System Coordination. Inspired by the security model, we highlight the key implications and limitations of these works in each layer, and make suggestions for potential challenges to the field of future serverless computing.", "venue": "ACM Computing Surveys", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-12-24", "journal": {"name": "ACM Computing Surveys (CSUR)", "pages": "1 - 34", "volume": "54"}, "authors": [{"authorId": "2118275662", "name": "Zijun Li"}, {"authorId": "9221797", "name": "Linsong Guo"}, {"authorId": "2149023479", "name": "Jiagan Cheng"}, {"authorId": "1596812259", "name": "Quan Chen"}, {"authorId": "143824511", "name": "Bingsheng He"}, {"authorId": "1697293", "name": "M. Guo"}], "citations": [{"paperId": "2bc83301600ff07acebc27eaa710d1ad231581ed", "title": "Joint Optimization of Parallelism and Resource Configuration for Serverless Function Steps"}, {"paperId": "9fdad4289301e42a2ae644e793c6e201961555e6", "title": "FSD-Inference: Fully Serverless Distributed Inference with Scalable Cloud Communication"}, {"paperId": "c966abb3ed515ade2f73f5c774705072c387534c", "title": "SMSS: Stateful Model Serving in Metaverse With Serverless Computing and GPU Sharing"}, {"paperId": "b7462464d6929bffd35ff3d3ec2e933417951312", "title": "Cold Start Latency Mitigation Mechanisms in Serverless Computing: Taxonomy, Review, and Future Directions"}, {"paperId": "59877dc00faf12035ebe02ebf71d2a6eeada04fa", "title": "Optimizing serverless computing: A comparative analysis of multi-output regression models for predictive function invocations"}, {"paperId": "b70d208065f45f1984b03322663ab0cf8b2dde4b", "title": "Optimizing Completion Time of Requests in Serverless Computing"}, {"paperId": "48e0ee57c78267f05fb6df6815e9d2938da9bdad", "title": "A survey on the scheduling mechanisms in serverless computing: a taxonomy, challenges, and trends"}, {"paperId": "0f1f02eb82628479284a6a0baad5af4535ff46e5", "title": "Microservices and serverless functions – lifecycle, performance, and resource utilisation of edge based real-time IoT analytics"}, {"paperId": "9f71c0968322585d41aa1523f896eb6f62d2860e", "title": "QoS-aware offloading policies for serverless functions in the Cloud-to-Edge continuum"}, {"paperId": "da90d67c3f442ca4048858e79e39264bd222c765", "title": "Challenges and Solutions in Network Security for Serverless Computing"}, {"paperId": "6ceacbc115f5c3f7ce3aa3e46dc5f1fe316c6214", "title": "Microless: Cost-Efficient Hybrid Deployment of Microservices on IaaS VMs and Serverless"}, {"paperId": "1ecdf0add6e2d139c1afc970d427d7b34a8e6cf3", "title": "Online Function Caching in Serverless Edge Computing"}, {"paperId": "9e2c482748168a5807fe2b4f9c44239a8b38253b", "title": "Toward Competitive Serverless Deep Learning"}, {"paperId": "912764814cd7aa8f37f1213e02cd968864b6a30c", "title": "A survey on energy‐efficient workflow scheduling algorithms in cloud computing"}, {"paperId": "0a42f3a9c11d0095c0dad37e31a92f5eedd48abb", "title": "GUARDIAN: A Hardware-Assisted Distributed Framework to Enhance Deep Learning Security"}, {"paperId": "286cff915ebe79dbc6b013d70f9e68ac9a71303b", "title": "XFaaS: Hyperscale and Low Cost Serverless Functions at Meta"}, {"paperId": "8049a85cb3db9a091c730798f454a0ccea55b752", "title": "Cold Start Latency in Serverless Computing: A Systematic Review, Taxonomy, and Future Directions"}, {"paperId": "d92e447a76cf69367fc38939135c26fbd3a700b4", "title": "A Review of Deep Reinforcement Learning in Serverless Computing: Function Scheduling and Resource Auto-Scaling"}, {"paperId": "b70d0245f6d7ae37b57e1b071d6f7ef121d919de", "title": "Exploring the Potential of Distributed Computing Continuum Systems"}, {"paperId": "61647407437f3f62a281ee656dbc3b4ed2791f0f", "title": "A probabilistic modeling and evolutionary optimization approach for serverless workflow configuration"}, {"paperId": "96fc80ed4693ccefecf9bef99e6eb7bb819e8d17", "title": "Scalable Model-Based Decentralized Applications in the Cloud Using Certificates and Blockchains"}, {"paperId": "c01e5d63f3dfa3213053df8b872a0ee911768372", "title": "Serverless Computing: What It Is, and What It Is Not?"}, {"paperId": "f1914f4264d8e1051a53759120504b8a425d4b8e", "title": "Building a Serverless Data Lakehouse from Spare Parts"}, {"paperId": "1f4078a51d9b313c07fbb8f9d6254f02798b6ad7", "title": "BeeFlow: Behavior Tree-based Serverless Workflow Modeling and Scheduling for Resource-Constrained Edge Clusters"}, {"paperId": "08f19fce7186010d7f6f6cf6dd4e6ca9ab05d1d3", "title": "An Alternative to FaaS Cold Start Latency of Low Request Frequency Applications"}, {"paperId": "77404ff42f1390d74a68c0146750f634902b745a", "title": "A Structured Literature Review Approach to Define Serverless Computing and Function as a Service"}, {"paperId": "2311e0ff2f949a7b2b8c5af1f2b7c12b5b0c2407", "title": "A Generic Efficient Scientific Workflow Engine for the Optimizations of Run-Time Execution"}, {"paperId": "cfaa41867cf453e1ff4fadda2a9f677a2e4422b8", "title": "DFlow: Efficient Dataflow-based Invocation Workflow Execution for Function-as-a-Service"}, {"paperId": "92a6db4f9aae1c78cddca57560475a17a422129f", "title": "Software Architecture Design of a Serverless System"}, {"paperId": "eaa75704962e4d6f72a513598e78c7edd2d3e8cc", "title": "Serverless Edge Computing—Where We Are and What Lies Ahead"}, {"paperId": "3101ce811198e24de826c963d39804edfeae6911", "title": "FIRST: Exploiting the Multi-Dimensional Attributes of Functions for Power-Aware Serverless Computing"}, {"paperId": "cad20cc32827262128e73bf06846483413f3d60a", "title": "Workflow aware analytical model to predict performance and cost of serverless execution"}, {"paperId": "af17ff4dc88173760092f0a0b22da3ddfef24f08", "title": "The Metaverse: Survey, Trends, Novel Pipeline Ecosystem & Future Directions"}, {"paperId": "ec773548104296a3f924fd7f2f439fa79a359ceb", "title": "DataFlower: Exploiting the Data-flow Paradigm for Serverless Workflow Orchestration"}, {"paperId": "813e351d5c6a44fe6db94ee37f65bafa076f751f", "title": "Executable Models and Instance Tracking for Decentralized Applications on Blockchains and Cloud Platforms - Metamodel and Implementation"}, {"paperId": "25d46335750a98ac3ec54507111bb02e28ed06ae", "title": "Serverledge: Decentralized Function-as-a-Service for the Edge-Cloud Continuum"}, {"paperId": "17367cc267ab136a12b473c27d53b122b066a167", "title": "Fine-Grained Performance and Cost Modeling and Optimization for FaaS Applications"}, {"paperId": "cdb6250a24254e8b3652197ada08dd5fd5f88678", "title": "Workflow Sensitive Access Management in Serverless Computing"}, {"paperId": "601011178c174bfc9b1c36220032ce8fb198530d", "title": "Kubernetes as a Standard Container Orchestrator - A Bibliometric Analysis"}, {"paperId": "fd213141353ad2988269b3db06c5847e826449dc", "title": "WoS Bibliometric-based Review on Serverless Computing model"}, {"paperId": "01eabd4040f26838263e5e3d21e9abdd920f1a02", "title": "Towards isolated execution at the machine level"}, {"paperId": "8c60956c116400cec9dff46a0325b7cc24f76550", "title": "Implementing ChaCha based crypto primitives on programmable SmartNICs"}, {"paperId": "a07540f7eebc8ece865f967fead9c9edcca96395", "title": "Resource optimization in performance modeling for serverless application"}, {"paperId": "8107c91e309c8ff37074196bfc906bfbe00bb336", "title": "A Fully Decentralized Architecture for Access Control Verification in Serverless Environments"}, {"paperId": "73707ba12435d7c41ebc24fc14573331e75abd78", "title": "Locality-aware Load-Balancing For Serverless Clusters"}, {"paperId": "e5617de21e517ac5b6dcb1b041710dbd2c755ffc", "title": "Rise of the Planet of Serverless Computing: A Systematic Review"}, {"paperId": "d11e5c5c08af88ee8abb9ebaa166b1d6fd198501", "title": "Kubernetes Scheduling: Taxonomy, Ongoing Issues and Challenges"}, {"paperId": "4d1a9ea0368aad53975e2fe34dc62528f9f5822e", "title": "FaaSFlow: enable efficient workflow execution for function-as-a-service"}, {"paperId": "0697791b674f77ec094d7f56786e078229dc3454", "title": "Efficiency in the serverless cloud paradigm: A survey on the reusing and approximation aspects"}, {"paperId": "31d3c657987119aaa1e0b8306c0abbe84bf35222", "title": "A Survey on Scheduling Techniques in Computing and Network Convergence"}, {"paperId": "16844b1f6c5c2c772be2e14999c65dc32b14580d", "title": "Serverless Computing: New Trends and Research Directions"}, {"paperId": "0894814ae9f32ceca0a7dedebd0abcc4891789d2", "title": "UnFaaSener: Latency and Cost Aware Offloading of Functions from Serverless Platforms"}, {"paperId": "f6cf95456b67e99a55f3a628e6cb7a2ae36401d0", "title": "BriskChain: Decentralized Function Composition for High-performance Serverless Computing"}, {"paperId": "1e14c45a3d4f7d2af452ea0d362d8955849e354c", "title": "SPSC : Stream Processing Framework atop Serverless Computing for Industrial Big Data"}, {"paperId": "3aa0fe9d05af104ec56dd0edc09d716919f7275a", "title": "A Literature Review on Serverless Computing"}, {"paperId": null, "title": "Help Rather Than Recycle: Alleviating Cold Startup in Serverless Computing Through Inter-Function Container Sharing"}, {"paperId": "944cf362c4e421ce3775eb9689c2f4e8504d41d6", "title": "RunD: A Lightweight Secure Container Runtime for High-density Deployment and High-concurrency Startup in Serverless Computing"}, {"paperId": "31289ab1bd4f940de68510e70e6513879c67ceaf", "title": "A Framework for Migration of Microservices based Applications to Serverless Platform with Eﬃcient Cold Start Latency"}, {"paperId": "aa482167fba7f8ad9cf01fcc2af5c34e32dace00", "title": "require-Serverless Computing: What It Is, and What It Is Not?"}, {"paperId": "2145129c795c7b7b36fb98c7aa3b91ccd2d398b8", "title": "This paper is included in the Proceedings of the 2022 USENIX Annual Technical Conference."}]}
