{"paperId": "9a3a237a25434cff96c2e56b9420f932a578e3c2", "publicationVenue": {"id": "cdd7667c-05b7-4d41-83f6-3dadd7d418c7", "name": "USENIX Workshop on Hot Topics in Storage and File Systems", "type": "conference", "alternate_names": ["HotStorage", "USENIX conf Hot top storage file syst", "USENIX conference on Hot topics in storage and file systems", "USENIX Workshop Hot Top Storage File Syst"]}, "title": "In support of workload-aware streaming state management", "abstract": "Modern distributed stream processors predominantly rely on LSM-based key-value stores to manage the state of longrunning computations. We question the suitability of such general-purpose stores for streaming workloads and argue that they incur unnecessary overheads in exchange for state management capabilities. Since streaming operators are instantiated once and are long-running, state types, sizes, and access patterns, can either be inferred at compile time or learned during execution. This paper surfaces the limitations of established practices for streaming state management and advocates for configurable streaming backends, tailored to the state requirements of each operator. Using workload-aware state management, we achieve an order of magnitude improvement in p99 latency and 2x higher throughput.", "venue": "USENIX Workshop on Hot Topics in Storage and File Systems", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "1993949", "name": "Vasiliki Kalavri"}, {"authorId": "2551316", "name": "J. Liagouris"}], "citations": [{"paperId": "c44b23f6b060f3004b5b243c4afbf7c1cb778f52", "title": "Dirigo: Self-scaling Stateful Actors For Serverless Real-time Data Processing"}, {"paperId": "442cce72a508316afb174365d9ad7dc57fe30052", "title": "On Improving Streaming System Autoscaler Behaviour using Windowing and Weighting Methods"}, {"paperId": "edb0c0907548a72220ca375aeda8fe9d2cceea61", "title": "FlowKV: A Semantic-Aware Store for Large-Scale State Management of Stream Processing Engines"}, {"paperId": "915cff5c3f1f1b10a71a91afd2acfc61faeac3d4", "title": "A new benchmark harness for systematic and robust evaluation of streaming state stores"}, {"paperId": "19dc742f583a37aa91c28c473db9dc4e32041758", "title": "LMStream: When Distributed Micro-Batch Stream Processing Systems Meet GPU"}, {"paperId": "1de7fd32bdcd1f204e7572d8450b9cfad95cd058", "title": "Scabbard: Single-Node Fault-Tolerant Stream Processing"}, {"paperId": "21da1ee785c91c832f68a9f18e4d7eda41c1cbd6", "title": "A Survey on the Evolution of Stream Processing Systems"}, {"paperId": "d1b9738ca93a6f5579744ae5278c02d3996dea45", "title": "Darwin: Scale-In Stream Processing"}, {"paperId": "8bec48b9686429d95c31ef6bd658e72d641573c9", "title": "Toward Workload-Aware State Management in Streaming Systems"}, {"paperId": "25b658bc26a6023acc48626feb2ff4317283815e", "title": "PaRallel OUtlier Detection for streams in Spark Structured Streaming"}]}
