{"paperId": "9a3d85d80b061b7c50707b0295bb19d11b186693", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "A Distributed Big Data Analytics Architecture for Vehicle Sensor Data", "abstract": "The unceasingly increasing needs for data acquisition, storage and analysis in transportation systems have led to the adoption of new technologies and methods in order to provide efficient and reliable solutions. Both highways and vehicles, nowadays, host a vast variety of sensors collecting different types of highly fluctuating data such as speed, acceleration, direction, and so on. From the vast volume and variety of these data emerges the need for the employment of big data techniques and analytics in the context of state-of-the-art intelligent transportation systems (ITS). Moreover, the scalability needs of fleet and traffic management systems point to the direction of designing and deploying distributed architecture solutions that can be expanded in order to avoid technological and/or technical entrapments. Based on the needs and gaps detected in the literature as well as the available technologies for data gathering, storage and analysis for ITS, the aim of this study is to provide a distributed architecture platform to address these deficiencies. The architectural design of the system proposed, engages big data frameworks and tools (e.g., NoSQL Mongo DB, Apache Hadoop, etc.) as well as analytics tools (e.g., Apache Spark). The main contribution of this study is the introduction of a holistic platform that can be used for the needs of the ITS domain offering continuous collection, storage and data analysis capabilities. To achieve that, different modules of state-of-the-art methods and tools were utilized and combined in a unified platform that supports the entire cycle of data acquisition, storage and analysis in a single point. This leads to a complete solution for ITS applications which lifts the limitations imposed in legacy and current systems by the vast amounts of rapidly changing data, while offering a reliable system for acquisition, storage as well as timely analysis and reporting capabilities of these data.", "venue": "Italian National Conference on Sensors", "year": 2022, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-12-29", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "23"}, "authors": [{"authorId": "2026072768", "name": "T. Alexakis"}, {"authorId": "2006673379", "name": "N. Peppes"}, {"authorId": "1732839", "name": "K. Demestichas"}, {"authorId": "1713209", "name": "Evgenia F. Adamopoulou"}], "citations": [{"paperId": "a4b5a6a0b8b38bb73c7fc16b9420c32a25b25fe3", "title": "Research on speed predictive control system of intelligent connected vehicle based on V2X"}, {"paperId": "ee458947aeeb958ee0026bfa6f7b24b86e444546", "title": "Dynamic Anomaly Detection in Gantry Transactions Using Graph Convolutional Network-Gate Recurrent Unit with Adaptive Attention"}, {"paperId": "60bd8ad9d3e4307c8bf6ce16a2b37c550d4370fe", "title": "How to combine issues related to autonomous vehicles - a proposal with a literature review"}, {"paperId": "5d1a6ee20c569a410101845177d019a0820d6ce2", "title": "Lane-Level Map Generation and Management Framework Using Connected Car Data"}, {"paperId": "a0e4cba1bdf1e8b8a90a02c73180dc33bba1aa9f", "title": "An overview of Hadoop applications in transportation big data"}, {"paperId": "454c42979a52cb4c7a2da883bed14d4074130bd7", "title": "Applications and Technologies of Big Data in the Aerospace Domain"}, {"paperId": "33ab4de7852e3a02b44b9f8f6cc20be13924a94a", "title": "Computational Framework for Analytical Operation in Intelligent Transportation System using Big Data"}]}
