{"paperId": "9a406e0673b6aa7ca9d14c3f777c72a29ed4816f", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "EvoX: A Distributed GPU-accelerated Library towards Scalable Evolutionary Computation", "abstract": "—During the past decades, evolutionary computation (EC) has demonstrated promising potential in solving various complex optimization problems of relatively small scales. Nowa- days, however, ongoing developments in modern science and engineering are bringing increasingly grave challenges to the con- ventional EC paradigm in terms of scalability. As problem scales increase, on the one hand, the encoding spaces (i.e., dimensions of the decision vectors) are intrinsically larger; on the other hand, EC algorithms often require growing numbers of function evaluations (and probably larger population sizes as well) to work properly. To meet such emerging challenges, not only does it require delicate algorithm designs, but more importantly, a high-performance computing framework is indispensable. Hence, we develop a distributed GPU-accelerated algorithm library — EvoX . First, we propose a generalized workﬂow for implementing general EC algorithms. Second, we design a scalable computing framework for running EC algorithms on distributed GPU devices. Third, we provide user-friendly interfaces to both researchers and practitioners for benchmark studies as well as extended real-world applications. To comprehensively assess the performance of EvoX , we conduct a series of experiments, including: (i) scalability test via numerical optimization benchmarks with problem dimensions/population sizes up to millions; (ii) acceleration test via a neuroevolution task with multiple GPU nodes; (iii) extensibility demonstration via the application to reinforcement learning tasks on the OpenAI Gym. The code of EvoX is available at https://github.com/EMI-Group/EvoX.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "ArXiv", "volume": "abs/2301.12457"}, "authors": [{"authorId": "2203359436", "name": "Beichen Huang"}, {"authorId": "39336044", "name": "Ran Cheng"}, {"authorId": "2257387639", "name": "Yaochu Jin"}, {"authorId": "2257371230", "name": "Kay Chen Tan"}], "citations": [{"paperId": "4bb9f478cb464049100abafc77b6491b6e5b731a", "title": "Evolutionary Reinforcement Learning: A Survey"}, {"paperId": "3b27fe0d6599e708fe4f36eccfea3810f13e95c9", "title": "EvoTorch: Scalable Evolutionary Computation in Python"}]}
