{"paperId": "9a4404b4bb2e8f0908eb7ab3a483bb6dca1893d0", "publicationVenue": {"id": "83b61ff8-462d-4e1d-b43b-5d96fcc87766", "name": "IEEE Transactions on Network Science and Engineering", "type": "journal", "alternate_names": ["IEEE Trans Netw Sci Eng"], "issn": "2327-4697", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=6488902"}, "title": "An Efficient Online Auction for Placing and Pricing Cloud Container Clusters", "abstract": "Containers are more lightweight and agile, which are merging as an alternative to virtual machines to provide efficient cloud computing services. For cloud service providers, there are two main challenges for provisioning container clusters: i) Design an optimal placement scheme while considering the communication between containers; ii) Flexible pricing mechanism, which not only meets the market demand but also maximizes the social welfare or provider's profit. To solve the above challenges, this paper proposes an efficient auction that achieves truthfulness and computational efficiency, targeting social welfare and provider's profit maximization. We first model the problem into a non-conventional integer linear program (ILP), considering both inter-container traffic flow and resources consumed in containers. We then introduce auxiliary variables and reformulate them to a classical packing-type ILP. Second, we apply the primal-dual technique to design an effective online auction algorithm, based on the number of consumed resources to ensure the flexible supply of resources while obtaining maximum social welfare. Third, we use a randomized reduction algorithm to convert the optimization objective to the provider's profit maximization. We prove that the competitive ratio of the two auctions are $\\ln \\lambda$ and $O(\\ln \\lambda +\\log _{2}\\kappa)$, and verify that our auctions perform well in various settings through simulations.", "venue": "IEEE Transactions on Network Science and Engineering", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-07-01", "journal": {"name": "IEEE Transactions on Network Science and Engineering", "pages": "2168-2179", "volume": "10"}, "authors": [{"authorId": "2115714717", "name": "Renli Zhang"}, {"authorId": "2369646", "name": "Ruiting Zhou"}], "citations": [{"paperId": "8058e1026f7ffef543316e6223eda4c307932149", "title": "Detection of quality of service degradation on multi-tenant containerized services"}, {"paperId": "ce858057e39c228aa1e6717e57c1637e61a10d80", "title": "Hybrid Form of Differential Evolutionary and Gray Wolf Algorithm for Multi-AUV Task Allocation in Target Search"}]}
