{"paperId": "9a4c95c8f2b828e2bb9e150164f56246c8755c8f", "publicationVenue": {"id": "3416dd37-f45d-40ed-b04e-875fcff8fa2f", "name": "Nutrients", "type": "journal", "issn": "2072-6643", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169249", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169249", "http://www.mdpi.com/journal/nutrients/", "https://www.mdpi.com/journal/nutrients"]}, "title": "Social Factors of Dietary Risk Behavior in Older German Adults: Results of a Multivariable Analysis", "abstract": "With this analysis, we aimed to examine the associations between social factors and dietary risk behavior in older adults. Data were collected through a full-population postal survey of German adults aged 65 years or older (n = 1687, 33% response proportion, 52% female, mean age = 76 years). Using principal component analysis (PCA), a data-driven Dietary Risk Behavior Index (DRB) was computed. Dietary risk behavior was defined as consumption frequencies of vegetables/fruit, whole grains, and dairy products below national dietary recommendations. By performing a multiple linear regression, we analyzed associations between sociodemographic, socioeconomic, psychosocial, and behavioral factors and dietary risk behavior. Physical activity, female gender, socioeconomic status, social support, and age (in the male sample) were negatively associated with dietary risk behavior. Alcohol consumption and smoking were positively associated with dietary risk behavior. A group-specific analysis revealed a higher goodness-of-fit for the low socioeconomic status group, older adults aged 65–79 years, and women. A comprehensive understanding of the relationships between social factors and dietary risk behavior in older adults assists the group-specific targeting of dietary-related interventions. Demand-oriented dietary interventions should account for underlying social conditions to reduce inequity in dietary risk behavior among older adults. The results of this work may be transferable to municipalities in high-income European countries.", "venue": "Nutrients", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-03-01", "journal": {"name": "Nutrients", "volume": "14"}, "authors": [{"authorId": "2157648368", "name": "C. Geigl"}, {"authorId": "2047568866", "name": "J. Loss"}, {"authorId": "6293556", "name": "M. Leitzmann"}, {"authorId": "39241184", "name": "C. Janssen"}], "citations": [{"paperId": "c646076ab36071a73f68803a2ef8f6ee728f2707", "title": "Healthy, inclusive, and sustainable metropolises: New strategies for transdisciplinary dialogues in Munich, Germany"}, {"paperId": "ff34d45c451f1082c506ea0d228bcb12dd41acf0", "title": "Social factors of health-related quality of life in older adults: a multivariable analysis"}]}
