{"paperId": "9a4cf2645a3f5b853c8be12f9f15b72cde9d4b13", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "An End-to-End Framework for Marketing Effectiveness Optimization under Budget Constraint", "abstract": "Online platforms often incentivize consumers to improve user engagement and platform revenue. Since different consumers might respond differently to incentives, individual-level budget allocation is an essential task in marketing campaigns. Recent advances in this field often address the budget allocation problem using a two-stage paradigm: the first stage estimates the individual-level treatment effects using causal inference algorithms, and the second stage invokes integer programming techniques to find the optimal budget allocation solution. Since the objectives of these two stages might not be perfectly aligned, such a two-stage paradigm could hurt the overall marketing effectiveness. In this paper, we propose a novel end-to-end framework to directly optimize the business goal under budget constraints. Our core idea is to construct a regularizer to represent the marketing goal and optimize it efficiently using gradient estimation techniques. As such, the obtained models can learn to maximize the marketing goal directly and precisely. We extensively evaluate our proposed method in both offline and online experiments, and experimental results demonstrate that our method outperforms current state-of-the-art methods. Our proposed method is currently deployed to allocate marketing budgets for hundreds of millions of users on a short video platform and achieves significant business goal improvements. Our code will be publicly available.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-02-09", "journal": {"name": "ArXiv", "volume": "abs/2302.04477"}, "authors": [{"authorId": "3451543", "name": "Ziang Yan"}, {"authorId": "145940973", "name": "Shusen Wang"}, {"authorId": "9330280", "name": "Guorui Zhou"}, {"authorId": "3275601", "name": "Jingjian Lin"}, {"authorId": "2184336926", "name": "Peng Jiang"}], "citations": [{"paperId": "0dfaaaa791f52b0ed9b99a42b36b1090b818b54c", "title": "Maximizing the Success Probability of Policy Allocations in Online Systems"}, {"paperId": "6fdc38cad2499b0fc43f6ed0ef0a0952279d5e6c", "title": "Uplift Modeling: From Causal Inference to Personalization"}, {"paperId": "54101015ed95794ee3cb4dc0bd8df71ab4891910", "title": "Incremental Profit per Conversion: a Response Transformation for Uplift Modeling in E-Commerce Promotions"}]}
