{"paperId": "9a51eb2a3c2a9e2479c705575637c0c87a2a7bfd", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "The incel lexicon: Deciphering the emergent cryptolect of a global misogynistic community", "abstract": "Evolving out of a gender-neutral framing of an involuntary celibate identity, the concept of `incels' has come to refer to an online community of men who bear antipathy towards themselves, women, and society-at-large for their perceived inability to find and maintain sexual relationships. By exploring incel language use on Reddit, a global online message board, we contextualize the incel community's online expressions of misogyny and real-world acts of violence perpetrated against women. After assembling around three million comments from incel-themed Reddit channels, we analyze the temporal dynamics of a data driven rank ordering of the glossary of phrases belonging to an emergent incel lexicon. Our study reveals the generation and normalization of an extensive coded misogynist vocabulary in service of the group's identity.", "venue": "arXiv.org", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-05-25", "journal": {"name": "ArXiv", "volume": "abs/2105.12006"}, "authors": [{"authorId": "1485310967", "name": "Kelly Gothard"}, {"authorId": "17845906", "name": "D. R. Dewhurst"}, {"authorId": "147115675", "name": "J. Minot"}, {"authorId": "2116149176", "name": "J. L. Adams"}, {"authorId": "2310860", "name": "C. Danforth"}, {"authorId": "2660575", "name": "P. Dodds"}], "citations": [{"paperId": "00645f3e8ccd1397745235d924e4853100e2bcfa", "title": "Ressentiment in the Manosphere: Conceptions of Morality and Avenues for Resistance in the Incel Hatred Pipeline"}, {"paperId": "dc46858801274f6dcb0162db5ee45a0f9f200f1a", "title": "A Lexicon for Studying Radicalization in Incel Communities"}, {"paperId": "bbb6fc7e67f0cf8a16d58b6e274a88ae766ab1e6", "title": "Well-Being, Self-Esteem and Temporal Perspective in Incels: An Italian Study"}, {"paperId": "cc8533946595fb00ed241598b7d57fbcf1a922d1", "title": "Identity Construction in a Misogynist Incels Forum"}, {"paperId": "7f5801f8036e71658a12d16203617b2ab25ef14f", "title": "Discovering Differences in the Representation of People using Contextualized Semantic Axes"}, {"paperId": "728d06e06fb1c1117ba01341e6b17ddead8ac368", "title": "Race and the language of incels"}, {"paperId": "563d9985190d13530e516aa5ca38e0bb786ed2d1", "title": "Characterizing, Detecting, and Predicting Online Ban Evasion"}, {"paperId": "9afd434304a24928c3d4f13083a4a1e0df2321b5", "title": "Allotaxonometry and rank-turbulence divergence: a universal instrument for comparing complex systems"}]}
