{"paperId": "9a542890bee10b021550e4ab5029560b90c746ff", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Fog-Enabled Vehicle as a Service for Computing Geographical Migration in Smart Cities", "abstract": "The diverse applications and high-quality services in smart cities have led to the geographical unbalance of computation requirements. Traditional centralized cloud computing services and the massive migration of computing tasks result in the increase of network delay and the aggravation of network congestion. Deploying fog nodes at the network edge has become an effective way to improve the quality of service. However, the dynamic requirements and application in various scenarios still challenge the network, resulting in the geographical unbalance of computing resource demands. Nowadays, the computing resources of on-board computers and devices in the Internet of Vehicles are abundant enough to mitigate the geographical unbalance in computing power demand. The efficient usage of the natural mobility of constantly moving vehicles to solve the above-mentioned problems remains an urgent need. In this paper, a vehicle mobility-based geographical migration model of the vehicular computing resource is established for the fog computing-enabled smart cities. The vehicle as a service framework takes the full advantage of the unbalance and randomness of vehicular computing resource and improves the flexibility of traditional cloud computing architecture. An incentive scheme that affects the vehicle path selection through resource pricing is proposed to balance the resource requirements and to geographically allocate computing resources. The simulation results indicate that the advantages and efficiency of the proposed scheme are significant.", "venue": "IEEE Access", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "8726-8736", "volume": "7"}, "authors": [{"authorId": "5901589", "name": "Siyi Liao"}, {"authorId": "49298335", "name": "Jianhua Li"}, {"authorId": "2146665894", "name": "Jun Wu"}, {"authorId": "2109520603", "name": "Wu Yang"}, {"authorId": "33030045", "name": "Zhitao Guan"}], "citations": [{"paperId": "0d792da2ea1d68f996b5f5c5df7fc858128643f3", "title": "Connecting the Indispensable Roles of IoT and Artificial Intelligence in Smart Cities: A Survey"}, {"paperId": "23adb09699a6eaf16711f317e4d1a849e365fed7", "title": "Smart and efficient EV charging navigation scheme in vehicular edge computing networks"}, {"paperId": "640d237a180b1823b8554dfa7cf71dca0b575944", "title": "Big data analytics and smart cities: applications, challenges, and opportunities"}, {"paperId": "f9a16392a6fc7e85909c68918f0de7072830bd66", "title": "Vehicle as a Service (VaaS): Leverage Vehicles to Build Service Networks and Capabilities for Smart Cities"}, {"paperId": "e0ec1e44f5801682ff98726a89b9dc36c444544f", "title": "Fog computing approaches in IoT-enabled smart cities"}, {"paperId": "c70f0f72cac496763c11e18a0364b8fe25bc7a66", "title": "GSS-VF: A Game-Theoretic Approach for Service Discovery in Fog Network of Vehicles"}, {"paperId": "28a960a69be93b4cbace374917b5250673014248", "title": "Flying through the secure fog: A complete study on UAV‐Fog in heterogeneous networks"}, {"paperId": "22f54b40c9906fbbc18cb4f1523e8e35a2a64ab1", "title": "Service Migration in Edge Computing Environments for Connected Autonomous Vehicles"}, {"paperId": "2be3548f1b70b864af7b5f48f56e07bd3a6e9686", "title": "Resource Allocation for Edge Computing-Based Vehicle Platoon on Freeway: A Contract-Optimization Approach"}, {"paperId": "befe585e679c7fdf2f9df84b87fcbdc289bb14b2", "title": "Fog Computing Approaches in Smart Cities: A State-of-the-Art Review"}, {"paperId": "60fc178573c884057677cce6d2f4a3257b03e941", "title": "Smart Parking Utilizing IoT Embedding Fog Computing Based on Smart Parking Architecture"}, {"paperId": "e334feb84c8c15d411dc7e9ef6433c719aa32b07", "title": "Energy Scheduling and Computation Offloading for Building Operator using Parked Electric Vehicles"}, {"paperId": "1dbf15a18394fdd237948983d7afd0be6828bf09", "title": "Multi-Agent Deep Reinforcement Learning enabled Computation Resource Allocation in a Vehicular Cloud Network"}, {"paperId": "4165a146b9e88188a72303a213640eae5c8de8ff", "title": "Service Migration for Connected Autonomous Vehicles"}, {"paperId": "d6bc29a897fd85e7187dc33c3c974b8879462237", "title": "BloCkEd: Blockchain-Based Secure Data Processing Framework in Edge Envisioned V2X Environment"}, {"paperId": "5e89c3804611ec0bd42f7a6c1d75a193635dee1d", "title": "Mobility aware autonomic approach for the migration of application modules in fog computing environment"}, {"paperId": "682c682f56e2cbfdd29377945aa68b21d20cb275", "title": "Energy Management in Smart Sectors Using Fog Based Environment and Meta-Heuristic Algorithms"}, {"paperId": "bff71f63c6cd50c87a84785d81dd2150f9156721", "title": "Fog Computing based traffic Safety for Connected Vulnerable Road Users"}, {"paperId": "eed55eac6a94c72ddcfd1cadddc438dba90de531", "title": "A Cloud and Fog based Architecture for Energy Management of Smart City by using Meta-heuristic Techniques"}, {"paperId": "9cfff9f07a3ee54be2084845bfc1ecccd13f2867", "title": "Emergent LBS: If GNSS Fails, How Can 5G-enabled Vehicles Get Locations Using Fogs?"}, {"paperId": "11581cdd14332b4031132a4a07e35f47423fb67f", "title": "Vehicle-to-Cloudlet: Game-Based Computation Demand Response for Mobile Edge Computing through Vehicles"}, {"paperId": "7335c668600d7fea117d206b3a5de9d2df558062", "title": "A Decade Review on Smart Cities: Paradigms, Challenges and Opportunities"}, {"paperId": "49a4be47999f435c24bc3419a0b983cb123f86b4", "title": "A Secure and Privacy-Preserving Machine Learning Model Sharing Scheme for Edge-Enabled IoT"}, {"paperId": "f15c014f84334ad8372fe5287cd50ce9ac127885", "title": "oneVFC—A Vehicular Fog Computation Platform for Artificial Intelligence in Internet of Vehicles"}, {"paperId": "e8264fafab255112ecdf567517a52c2eb5ec9e76", "title": "System Architecture of Fog Radio Access Networks"}]}
