{"paperId": "9a574e5d6884d6f9f58905a429e10762ab325d78", "publicationVenue": {"id": "c2eeb1be-38e9-4a0a-a89d-957f4fd71ea1", "name": "IEEE Transactions on Intelligent Vehicles", "alternate_names": ["IEEE Trans Intell Veh"], "issn": "2379-8858", "url": "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=7274857"}, "title": "FAIR: Towards Impartial Resource Allocation for Intelligent Vehicles With Automotive Edge Computing", "abstract": "The emerging vehicular connected applications, such as cooperative automated driving and intersection collision warning, show great potentials to improve the driving safety, where vehicles can share the data collected by a variety of on-board sensors with surrounding vehicles and roadside infrastructures. Transmitting and processing this huge amount of sensory data introduces new challenges for automotive edge computing with traditional wireless communication networks. In this work, we address the problem of traditional asymmetrical network resource allocation for uplink and downlink connections that can significantly degrade the performance of vehicular connected applications. An end-to-end automotive edge networking system, <italic>FAIR</italic>, is proposed to provide <underline>f</underline>ast, sc<underline>a</underline>lable, and <underline>i</underline>mpa<underline>r</underline>tial connected services for intelligent vehicles with edge computing, which can be applied to any traffic scenes and road topology. The core of <italic>FAIR</italic> is our proposed symmetrical network resource allocation algorithm deployed at edge servers and service adaptation algorithm equipped on intelligent vehicles. Extensive simulations are conducted to validate our proposed <italic>FAIR</italic> by leveraging real-world traffic dataset. Simulation results demonstrate that <italic>FAIR</italic> outperforms existing solutions in a variety of traffic scenes and road topology.", "venue": "IEEE Transactions on Intelligent Vehicles", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-12-25", "journal": {"name": "IEEE Transactions on Intelligent Vehicles", "pages": "1971-1982", "volume": "8"}, "authors": [{"authorId": "49528900", "name": "Haoxin Wang"}, {"authorId": "1766625", "name": "Jiang Xie"}, {"authorId": "2542254", "name": "M. Muslam"}], "citations": [{"paperId": "9f9fe1d9bb98906b1a16b78848c00307f0a20c01", "title": "MCVCO: Multi-MEC Cooperative Vehicular Computation Offloading"}, {"paperId": "c60d94d0899714ad0bd77b3b04d361d600e80a8e", "title": "Federated Learning for Connected and Automated Vehicles: A Survey of Existing Approaches and Challenges"}, {"paperId": "d2721fb6b0a865dbef778f01df95513866a75cd5", "title": "Direct Self-Position Awareness Based on Array-Sensing Multiple Source Data Fitting"}]}
