{"paperId": "9a571b1a721369a1eee1bb50e047cd98f2e036ad", "publicationVenue": {"id": "9704c32e-4051-4155-95f8-dcb3c01abc51", "name": "Interactive Learning Environments", "type": "journal", "alternate_names": ["Interact Learn Environ"], "issn": "1049-4820", "url": "http://www.informaworld.com/1744-5191", "alternate_urls": ["http://www.tandfonline.com/loi/nile20"]}, "title": "Interaction recognition and intervention based on context feature fusion of learning behaviors in interactive learning environments", "abstract": "ABSTRACT Interactive learning environments can generate massive learning behavior data and the support of learning behavior big data can ensure the completeness of data analysis and robustness of relationship verification. In this study, learning behaviors are divided into training set and testing set, BP neural network and recurrent Elman network are integrated. Through the training set, the recursive multi-layer feedback neural network model based on the fusion of context features is constructed. The recognition algorithm is designed. From relative standard deviation (RSD) and prediction accuracy (P.A), the model and algorithm designed in this study are more suitable for the recognition and prediction of learning behavior data. Furthermore, the key topological path and interaction process equation of learning behaviors are designed, three kinds of intervention optimization strategies are constructed to serve the daily teaching processes of three courses. After two semesters of learning behavior feature recognition and relationship analysis, learners’ interest, assessment pass rate, or excellence rate have improved significantly. So the intervention optimization strategies of learning behaviors based on the analysis results of models and algorithms can influence the feature distribution and behavior trend.", "venue": "Interactive Learning Environments", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-01-17", "journal": {"name": "Interactive Learning Environments", "pages": "2033 - 2050", "volume": "31"}, "authors": [{"authorId": "1807986", "name": "Xiaona Xia"}], "citations": [{"paperId": "0983a36da068244f76db5f8c62b4fe9feee7e0c0", "title": "Driving STEM learning effectiveness: dropout prediction and intervention in MOOCs based on one novel behavioral data analysis approach"}, {"paperId": "04f8284b9c8bb5d811d768bab953cf35121b6d0e", "title": "One improved learning analytics of interest transfer in interactive learning activities"}, {"paperId": "35a7e6e151fcaf1400868c3fcf1d8a51c6366590", "title": "How big data applications and digital learning change students’ sustainable behaviours – the moderating roles of hard and soft skills"}, {"paperId": "d55ad64bf783f8a00b9a5dd9f9965665b9c70afe", "title": "Student Learning Behavior Recognition Incorporating Data Augmentation with Learning Feature Representation in Smart Classrooms"}, {"paperId": "e034f95d618203ded410755293fde3525deedb2e", "title": "Dropout prediction and decision feedback supported by multi temporal sequences of learning behavior in MOOCs"}, {"paperId": "d43000e9421505e6760d63876555524b7bc7e710", "title": "Interpretable early warning recommendations in interactive learning environments: a deep-neural network approach based on learning behavior knowledge graph"}, {"paperId": "a99d6defd26ad84f6091b4cbc2ed96d378527b7e", "title": "The Study of Hierarchical Learning Behaviors and Interactive Cooperation Based on Feature Clusters"}, {"paperId": "2ef3fb3e2160fa54a269f532a612ecd9e64b5b03", "title": "Learning Behavior Interest Propagation Strategy of MOOCs Based on Multi Entity Knowledge Graph"}, {"paperId": "0e0a9bdea987ce1b1f6f48abd8527fc2e1075788", "title": "Using interactive teaching methods in English lessons"}, {"paperId": "ba87afe587e0ac466774fce0555dff2082c6db72", "title": "Multi Objective Evaluation Between Learning Behavior and Learning Achievement"}, {"paperId": "0ecd3ca9381d284bd8cd41a8cb3d0e51bb0bfd9d", "title": "Early warning mechanism of interactive learning process based on temporal memory enhancement model"}, {"paperId": "f1a9c628affeacf298d664f8c56bbf399ae81044", "title": "Comparing the Effectiveness of Instructional Video Types: An In-Depth Analysis on Pre-Service Teachers for Online Learning"}, {"paperId": "62a617811751085067abda38d8e18ec8e12deea1", "title": "Diversion inference model of learning effectiveness supported by differential evolution strategy"}, {"paperId": "0fe42856ce2d5dbae0c4206d3f1677e71fedcd93", "title": "Application Technology on Collaborative Training of Interactive Learning Activities and Tendency Preference Diversion"}, {"paperId": "eb16c7e1f9b38097a215219734cf70a6fc38dc20", "title": "Temporal tracking and early warning of multi semantic features of learning behavior"}, {"paperId": "d2aaa72bd98aa1515b35167f45607de48803ac4d", "title": "Sparse learning strategy and key feature selection in interactive learning environment"}, {"paperId": "b7d6e7655844dc54740c154f92714a15a65bf409", "title": "Using Virtual Learning Environment Data for the Development of Institutional Educational Policies"}, {"paperId": "17fe0ece4c9f198a76c9ece53551c0362a666693", "title": "Improved Probabilistic Frequent Itemset Analysis Strategy of Learning Behaviors Based on Eclat Framework"}, {"paperId": "b46901708287c21011e140b90742bb6ec55f95ce", "title": "Decision application mechanism of regression analysis of multi-category learning behaviors in interactive learning environment"}, {"paperId": "bfdff4779cbe5e3dc2fcd7d89f508e3f05d4960f", "title": "Could the Use of AI in Higher Education Hinder Students With Disabilities? A Scoping Review"}, {"paperId": "7c181d91202c51ef85923e4d03edf15b0c804653", "title": "Enhancing interactive environment with applied of scenario based approach via EDpuzzle adoption"}, {"paperId": "d6b24855fa51c0c3e85b51ccc4fb15e391ccbf83", "title": "Evaluation of Women’s Entrepreneurship Education Based on BP Neural Network"}]}
