{"paperId": "9a5c3d04cde121acd808b8a7d6ef7a4014b2cb72", "publicationVenue": {"id": "29e6e722-a307-4196-958e-46e585f2fc47", "name": "IEEE Transactions on Reliability", "type": "journal", "alternate_names": ["IEEE Trans Reliab"], "issn": "0018-9529", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=24", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=24"]}, "title": "Dependability Analysis of Data Storage Systems in Presence of Soft Errors", "abstract": "In recent years, high availability and reliability of data storage systems (DSS) have been significantly threatened by soft errors occurring in storage controllers. Due to their specific functionality and hardware–software stack, error propagation and manifestation in DSS is quite different from general-purpose computing architectures. To the best of our knowledge, no previous study has examined the system-level effects of soft errors on the availability and reliability of DSS. In this paper, we first analyze the effects of soft errors occurring in the server processors of storage controllers on the entire storage system dependability. To this end, we implement the major functions of a typical data storage system controller, running on a full stack of storage system operating system, and develop a framework to perform fault injection experiments using a full system simulator. We then propose a new metric, storage system vulnerability factor (SSVF), to accurately capture the impact of soft errors in storage systems. By conducting extensive experiment, it is revealed that depending on the controller configuration, up to 40% of cache memory contains end-user data in which any unrecoverable soft errors will result in data loss (DL) in an irreversible manner. However, soft errors in the rest of cache memory filled by operating system and storage applications will result in data unavailability (DU) at the storage system level. Our analysis also shows that detectable unrecoverable errors on the cache data field are the major cause of DU in storage systems, while silent data corruptions in the cache tag and data fields are mainly the cause of DL in storage systems.", "venue": "IEEE Transactions on Reliability", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-01-15", "journal": {"name": "IEEE Transactions on Reliability", "pages": "201-215", "volume": "68"}, "authors": [{"authorId": "2868307", "name": "Mostafa Kishani"}, {"authorId": "1702395", "name": "M. Tahoori"}, {"authorId": "144394335", "name": "H. Asadi"}], "citations": [{"paperId": "26ab4f67c08cd5832986bccef442bab2fd3ae9a4", "title": "An integrated approach to estimate storage reliability with masked data from series system"}, {"paperId": "d75d5e8a65c65a17ba8b16d1b6758c71048e14b5", "title": "Locating Critical-Reliability Gates for Sequential Circuits based on the Time Window Graph Model"}, {"paperId": "588000e694f5d7596c03d405381ae04109c5edc3", "title": "Efficient parallel derivation of short distinguishing sequences for nondeterministic finite state machines using MapReduce"}, {"paperId": "d23f289655fa9d1ccfe5193db4135553a6dd7d5a", "title": "PADSA: Priority-Aware Block Data Storage Architecture for Edge Cloud Serving Autonomous Vehicles"}, {"paperId": "1828df9ece545999069554ecf0bc77fb87b6c044", "title": "Big data-driven scheduling optimization algorithm for Cyber-Physical Systems based on a cloud platform"}, {"paperId": "36d5fd96481b1c211bb5d00f11fd5314184a7be8", "title": "Failure prediction by regularized fuzzy learning with intelligent parameters selection"}, {"paperId": "cf11a0ed193df2aa00573737136e6f9c98e2c820", "title": "A System-Level Framework for Analytical and Empirical Reliability Exploration of STT-MRAM Caches"}, {"paperId": "e62f23a6474a2dea29d4497767de0fc38c26ab37", "title": "A Modeling Framework for Reliability of Erasure Codes in SSD Arrays"}, {"paperId": "bc216a693f1c6a6a80ef78288740c428f612aa3f", "title": "Design and Implementation of Virtual Private Storage Framework Using Internet of Things Local Networks"}, {"paperId": "fc6955ef2530d59f20ce7ea40148beeb6d1766a1", "title": "STAIR: High Reliable STT-MRAM Aware Multi-Level I/O Cache Architecture by Adaptive ECC Allocation"}, {"paperId": "317c62040880e4e0ee0c6d03e698d8d1cb0c5e9c", "title": "Computational storage: an efficient and scalable platform for big data and HPC applications"}, {"paperId": "201355b2271258ea9b65f9f04f5e4b99fdd5d35f", "title": "Automatic Implementation of Control Flow Error Detection Techniques"}, {"paperId": "3aedc5997c36befdbecd4b225588e7f404638b45", "title": "LBICA: A Load Balancer for I/O Cache Architectures"}, {"paperId": "80cb079eadb5710ad5bb8029bce49218b46d21f2", "title": "A Methodology to Assess Output Vulnerability Factors for Detecting Silent Data Corruption"}]}
