{"paperId": "9a7990771bd933436585da32b2fd993e4fe8653b", "publicationVenue": {"id": "6175efe8-6f8e-4cbe-8cee-d154f4e78627", "name": "Mathematics", "issn": "2227-7390", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-283014", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-283014", "https://www.mdpi.com/journal/mathematics"]}, "title": "Dynamic Analysis and FPGA Implementation of a New, Simple 5D Memristive Hyperchaotic Sprott-C System", "abstract": "In this paper, we first present a simple seven-term 4D hyperchaotic system based on the classical Sprott-C 3D chaotic system. This novel system is inspired by the simple 4D hyperchaotic system based on Sprott-B proposed by A. T. Sheet (2022). We discuss the phenomenon of premature divergence brought about by the improper choice of coupling parameters in that paper and describe the basic properties of the new system with phase diagrams, Lyapunov exponential spectra and bifurcation diagrams. Then, we find that the dynamical behaviors of the system suffer from the limitation of the control parameters and cannot represent the process of motion in detail. To improve the system, we expand the dimensionality and add the control parameters and memristors. A 5D memristive hyperchaotic system with hidden attractors is proposed, and the basic dynamical properties of the system, such as its dissipation, equilibrium point, stability, Lyapunov exponential spectra and bifurcation diagram, are analyzed. Finally, the hardware circuits of the 4D Sprott-C system and the 5D memristive hyperchaotic system were realized by a field programmable gate array (FPGA) and verified by an experiment. The experimental results are consistent with the numerical simulation results obtained in MATLAB, which demonstrates the feasibility and potential of the system.", "venue": "Mathematics", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-01-30", "journal": {"name": "Mathematics"}, "authors": [{"authorId": "40471592", "name": "Fei Yu"}, {"authorId": "2203734548", "name": "Wuxiong Zhang"}, {"authorId": "152496559", "name": "X. Xiao"}, {"authorId": "2114975896", "name": "Wei Yao"}, {"authorId": "3286418", "name": "Shuo Cai"}, {"authorId": "2201822785", "name": "Jin Zhang"}, {"authorId": "2116116108", "name": "Chunhua Wang"}, {"authorId": "2153685183", "name": "Yi Li"}], "citations": [{"paperId": "6b8d115e9900142cb7c73bacb68ecc164b1579ad", "title": "Dynamical behavior of a new jerk system inspired from chaotic memory oscillators"}, {"paperId": "63360e8f80c4732c0b7d203e3bd3ed738bddd48a", "title": "Editorial: Advances in nonlinear systems and networks, volume II"}, {"paperId": "f913957c72640627c38742d9e1a50c6c2ac8b190", "title": "Efficient Color Image Steganography Based on New Adapted Chaotic Dynamical System with Discrete Orthogonal Moment Transforms"}, {"paperId": "f81db4a3a9505f982db1c83df1178264b4412a80", "title": "Dynamic analysis and FPGA implementation of a 5D multi-wing fractional-order memristive chaotic system with hidden attractors"}, {"paperId": "acf5366f322e4ef85218569b37f3966b48bfb2e9", "title": "Modeling and hardware implementation of a class of Hamiltonian conservative chaotic systems with transient quasi-period and multistability"}, {"paperId": "33b8cc9f0f456ed05af9588ef3691cbed026fc54", "title": "Dynamics analysis and hardware implementation of multi-scroll hyperchaotic hidden attractors based on locally active memristive Hopfield neural network"}, {"paperId": "809592b6e97a4fd7c5fe0e1ca6b9b89696fd4cec", "title": "Secure Communications in the Presence of Disturbances Based on Lyapunov Theory"}, {"paperId": "1d6b104acf0449a811bafaca142c46f74f08de68", "title": "Hyperchaos-Based Secure Communication Using Lyapunov Theory"}, {"paperId": "05ec4be7a3ec9dc2714f23f7921b31e3fece6c98", "title": "Dynamic Analysis and FPGA Implementation of a New Fractional-Order Hopfield Neural Network System under Electromagnetic Radiation"}, {"paperId": "1f35efe79613f936be01dcdeb572817c2e2cded9", "title": "Dynamics, circuit design, feedback control of a new hyperchaotic system and its application in audio encryption"}, {"paperId": "c21ff4feacfea1142ef0e6059e4bbc9d19c88baa", "title": "Chaotic color multi-image compression-encryption/ LSB data type steganography scheme for NFT transaction security"}, {"paperId": "4c69d4ae4ab67d8f3e07ac6164c1a5e1bb7f48f5", "title": "Minimal underactuated synchronization with applications to secure communication"}, {"paperId": "24dcea23ef82acc221678521ffff68e99355439f", "title": "The Intricacies of Sprott-B System with Fractional-Order Derivatives: Dynamical Analysis, Synchronization, and Circuit Implementation"}, {"paperId": "62964b15c6401f11a69d2d0c7ef67fd96c2fd599", "title": "Design and DSP implementation of a hyperchaotic map with infinite coexisting attractors and intermittent chaos based on a novel locally active memcapacitor"}, {"paperId": "f45c89cf4d0d9e25f1dd28aaa0828ad61b63b21f", "title": "Current mode multi scroll chaotic oscillator based on CDTA"}, {"paperId": "c0ce76c7fe00a53edf6c61a63f000e3480ea75e3", "title": "A Fast Hyperchaotic Image Encryption Scheme"}, {"paperId": "5bd99c997148f0bb8d93a4f105c0290c3d8ea259", "title": "Editorial: Advances in non-linear systems and networks"}, {"paperId": "e496b52c403116a990767c6760626db7d10229e5", "title": "A Review of Chaotic Systems Based on Memristive Hopfield Neural Networks"}, {"paperId": "cbe9b9d30907fbfec5b29eac88579f8c835bfa32", "title": "Building Fixed Point-Free Maps with Memristor"}, {"paperId": "e1e5b76fba68c2baa5cd5704b0fd31ad402403ae", "title": "A Chaotic Image Encryption Method Based on the Artificial Fish Swarms Algorithm and the DNA Coding"}]}
