{"paperId": "9a7c039cb0fe8dde7cb53d7bac13790e4e92de40", "publicationVenue": {"id": "f4784c7b-6592-49eb-a116-7290e0398868", "name": "Journal of Advances in Information Technology", "type": "journal", "alternate_names": ["J Adv Inf Technol"], "issn": "1798-2340", "url": "http://academypublisher.com/jait/index.html", "alternate_urls": ["http://www.jait.us/"]}, "title": "Integrating Dependability Concepts while Selecting Cloud Service for Big Data", "abstract": "—The increased use of the Cloud to process Big Data has impacted the growth of its services. These various services have made tedious the choice of the suitable Cloud. Moreover, the sources of Big Data generate increasingly voluminous data with various levels of confidence. If the data are not available, reliable, secure, and maintainable, the resulting decisions are likely to be biased. Therefore, to fully and correctly use these Big Data, we should take into consideration their dependability requirements in the Cloud Service selection process. In this paper, we present a new approach for selecting Cloud Services based on a multi-criteria decision method called Fuzzy Analytic Hierarchy Process. Our contribution aims to integrate dependability concepts into the process of selecting the cloud service adapted to Big Data. This approach represents a good interest for end-users, by providing them the ability to specify their priorities in terms of dependability requirements of Big Data. To validate our approach, we implement a system to automate the Cloud selection process. Then we applied our proposal to a case study to demonstrate its feasibility and efficacy.", "venue": "Journal of Advances in Information Technology", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": {"name": "Journal of Advances in Information Technology"}, "authors": [{"authorId": "1399114759", "name": "Fatima Ezzahra Mdarbi"}, {"authorId": "2647396", "name": "Nadia Afifi"}, {"authorId": "2636119", "name": "Imane Hilal"}], "citations": []}
