{"paperId": "9a91890329b65d43d91b0d83399d68949bd85ad5", "publicationVenue": null, "title": "Speeding Up End-to-end Query Execution via Learning-based Progressive Cardinality Estimation", "abstract": "Fast query execution requires learning-based cardinality estimators to have short inference time (as model inference time adds to end-to-end query execution time) and high estimation accuracy (which is crucial for finding good execution plan). However, existing estimators cannot meet both requirements due to the inherent tension between model complexity and estimation accuracy. We propose a novel Learning-based Progressive Cardinality Estimator (LPCE), which adopts a query re-optimization methodology. In particular, LPCE consists of an initial model (LPCE-I), which estimates cardinality before query execution, and a refinement model (LPCE-R), which progressively refines the cardinality estimations using the actual cardinalities of the executed operators. During query execution, re-optimization is triggered if the estimations of LPCE-I are found to have large errors, and more efficient execution plans are selected for the remaining operators using the refined estimations provided by LPCE-R. Both LPCE-I and LPCE-R are light-weight query-driven estimators but they achieve both good efficiency and high accuracy when used jointly. Besides designing the models for LPCE-I and LPCE-R, we also integrate re-optimization and LPCE into PostgreSQL, a popular database engine. Extensive experiments show that LPCE yields shorter end-to-end query execution time than state-of-the-art learning-based estimators.", "venue": "Proc. ACM Manag. Data", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-30", "journal": {"name": "Proceedings of the ACM on Management of Data", "pages": "1 - 25", "volume": "1"}, "authors": [{"authorId": "7572514", "name": "Fang Wang"}, {"authorId": "145837716", "name": "Xiao Yan"}, {"authorId": "1722082", "name": "Man Lung Yiu"}, {"authorId": "2059078144", "name": "LI Shuai"}, {"authorId": "2169798543", "name": "Zunyao Mao"}, {"authorId": "2065093887", "name": "Bo Tang"}], "citations": [{"paperId": "0e818290e64b44a79406c4dabc2c8a96f334d0ff", "title": "Towards a Flexible Scale-out Framework for Efficient Visual Data Query Processing"}, {"paperId": "302bbba2f61082f63f99c8dd0269d047f7efb837", "title": "Advanced Dataset Discovery: When Multi-Query-Dataset Cardinality Estimation Matters"}, {"paperId": "47da72a952b4d9e724242e45f6d3a9402479ce27", "title": "Towards Building The Next Generation Computation Engine"}]}
