{"paperId": "9a9733bc44cd3f168ad97113f9a34e48a299bd80", "publicationVenue": null, "title": "Selfish Node detection based on GA and Learning Automata in IoT", "abstract": "\n It is critical to increasing the network throughput on the internet of things with short-range nodes. Nodes prevent to cooperate with other nodes in the network are known as selfish nodes. Previous studies have done on the selfish nodes detection that leads to increase throughput and reduce the end to end delay. The proposed method for discovering the selfish node is based on genetic algorithm and learning automata. It consists of three phases of setup and clustering, the best routing selection based on genetic algorithm, and finally, the learning and update phase. For appropriate network performance, the clustering algorithm implemented in the first phase. Nodes are working together to send the data packet to the destination in the second phase, and the neighbor node selected for forwarding the data packet in which that node has a high value of fitness function, among others. In the third phase, each node monitors the performance of its neighbor nodes in forwarding the data packet and uses the learning automata system to identify the selfish nodes. By preventing to cooperate selfish nodes and decreasing the probability selection of selfish nodes, it increases the throughput in the network. The results of the simulation show that the detection accuracy of selfish nodes in comparison with the existing methods average 12%, and the false positive rate has decreased by 5%.", "venue": "", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2020-05-07", "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "69847591", "name": "Solmaz Nobahary"}, {"authorId": "7142057", "name": "Hossein Gharaee Garakani"}, {"authorId": "9457170", "name": "A. Khademzadeh"}, {"authorId": "144902225", "name": "A. Rahmani"}], "citations": [{"paperId": "61f61a8bc99ace1d6b0d281cfeedf0eb0f71ca3d", "title": "Comparative Analysis of Various Techniques used for Selfish Node Detection in DTN"}]}
