{"paperId": "9aa7c47db195cc412a67a76b2d2f19d092c9dd74", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "A Review on the Application of Internet of Medical Things in Wearable Personal Health Monitoring: A Cloud-Edge Artificial Intelligence Approach", "abstract": "The advent of the fifth-generation mobile communication technology (5G) era has catalyzed significant advancements in medical diagnosis delivery, primarily driven by the surge in medical data from wearable Internet of Medical Things (IoMT) devices. Nonetheless, the IoMT paradigm grapples with challenges related to data security, privacy, constrained computational capabilities at the edge, and an inadequate architecture for handling traditionally error-prone data. In this context, our research offers: (1) an exhaustive review of large-scale medical data propelled by IoMT, (2) an exploration of the prevailing cloud-edge Artificial Intelligence (AI) framework tailored for IoMT, and (3) an insight into the application of Edge Federated Learning (EFL) in bolstering medical big data analytics to yield secure and superior diagnostic outcomes. We place a particular emphasis on the proliferation of IoMT wearable devices that incessantly stream medical data, either from patients or healthcare institutions, to centralized repositories. Furthermore, we introduce a federated cloud-edge AI blueprint designed to position computational resources proximate to the edge network, facilitating real-time diagnostic feedback to patients. We conclude by delineating prospective research trajectories in enhancing IoMT through AI integration.", "venue": "IEEE Access", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "21437-21452", "volume": "12"}, "authors": [{"authorId": "9282843", "name": "Karisma Trinanda Putra"}, {"authorId": "2222913238", "name": "Ahmad Zaki Arrayyan"}, {"authorId": "2201745511", "name": "Nur Hayati"}, {"authorId": "2284086582", "name": ".. Firdaus"}, {"authorId": "35347609", "name": "Cahya Damarjati"}, {"authorId": "2281479301", "name": "Abu Bakar"}, {"authorId": "2145278540", "name": "Hsing-Chung Chen"}], "citations": []}
