{"paperId": "9aaa896c495293d0519e8ccdbf3c49cf833a8656", "publicationVenue": {"id": "d13e941e-4cac-4f1d-bdca-77d927e31f1b", "name": "ACM Symposium on Cloud Computing", "type": "conference", "alternate_names": ["System-on-Chip Conference", "ACM Symp Cloud Comput", "Syst Conf", "Symp Cloud Comput", "Annual IEEE International System-on-Chip Conference", "Symposium on Cloud Computing", "Annu IEEE Int Syst Conf", "SoCC"], "url": "http://www.ieee-socc.org/"}, "title": "Trisk: Task-Centric Data Stream Reconfiguration", "abstract": "Due to the long-run and unpredictable nature of stream processing, any statically configuredexecution of stream jobs fails to process data in a timely and efficient manner. To achieve performance requirements, stream jobs need to be reconfigured dynamically. In this paper, we present Trisk, a control plane that support versatile reconfigurations while keeping high efficiency with easy-to-use programming APIs. Trisk enables versatile reconfigurations with usability based on a task-centric abstraction, and encapsulates primitive operations such that reconfigurations can be described by compositing the primitive operations on the abstraction. Trisk adopts a partial pause-and-resume design for efficiency, through which synchronization mechanisms in the native stream systems can further be leveraged. We implement Trisk on Apache Flink and demonstrate its usage and performance under realistic application scenarios. We show that Trisk executes reconfigurations with shorter completion time and comparable latency compared to a state-of-the-art fluid mechanism for state management.", "venue": "ACM Symposium on Cloud Computing", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2021-11-01", "journal": {"name": "Proceedings of the ACM Symposium on Cloud Computing"}, "authors": [{"authorId": "2152119732", "name": "Yancan Mao"}, {"authorId": "2115593188", "name": "Yuan Huang"}, {"authorId": "2135901356", "name": "Runxin Tian"}, {"authorId": "2153687572", "name": "Xin Wang"}, {"authorId": "144030168", "name": "Richard T. B. Ma"}], "citations": [{"paperId": "d52ba3b8b67bb05a9fdb1def113a8d7a75546b10", "title": "ContTune: Continuous Tuning by Conservative Bayesian Optimization for Distributed Stream Data Processing Systems"}, {"paperId": "c44b23f6b060f3004b5b243c4afbf7c1cb778f52", "title": "Dirigo: Self-scaling Stateful Actors For Serverless Real-time Data Processing"}, {"paperId": "b4a7c65ae255ffd2acc44c38fa1f3b6d85b12bc9", "title": "StreamOps: Cloud-Native Runtime Management for Streaming Services in ByteDance"}, {"paperId": "088934e7ff5690180db5932e55bf97b982100902", "title": "Latency-Oriented Elastic Memory Management at Task-Granularity for Stateful Streaming Processing"}, {"paperId": "b4258742a640151fa863092bed7f35d25dd92ab5", "title": "Shepherd: Seamless Stream Processing on the Edge"}, {"paperId": "161411caa8e894c255ec2080050a0c8bb657fb57", "title": "Colocating Real-time Storage and Processing: An Analysis of Pull-based versus Push-based Streaming"}, {"paperId": "7298d0ec9f5e039879b5f72fd5e1127ea2e02b5e", "title": "Fries: Fast and Consistent Runtime Reconfiguration in Dataflow Systems with Transactional Guarantees"}]}
