{"paperId": "9ab98c9d0442a174ee11c44db956ba4fac6cb8c8", "publicationVenue": {"id": "79ca3e12-1e1d-4da8-9915-54a393e8c512", "name": "International Journal of Electrical and Computer Engineering (IJECE)", "type": "journal", "alternate_names": ["Int J Electr Comput Eng", "Int J Electr Comput Eng (IJECE", "International Journal of Electrical and Computer Engineering"], "issn": "2088-8708", "url": "http://iaesjournal.com/online/index.php/IJECE/issue/archive"}, "title": "Emergent situations for smart cities: A survey", "abstract": "A smart city is a community that uses communication and information technology to improve sustainability, livability, and feasibility. As any community, there are always unexpected emergencies, which must be treated to preserve the regular order. However, a smart system is needed to be able to respond effectively to these emergent situations. The contribution made in this survey is twofold. Firstly, it provides a comprehensive exhaustive and categorized overview of the existing surveys for smart cities.  The categorization is based on several criteria such as structures, benefits, advantages, applications, challenges, issues, and future directions. Secondly, it aims to analyze several studies with respect to emergent situations and management to smart cities. The analysis is based on several factors such as the challenges and issues discussed, the solutions proposed, and opportunities for future research. The challenges include security, privacy, reliability, performance, scalability, heterogeneity, scheduling, resource management, and latency. Few studies have investigated the emergent situations of smart cities and despite the importance of latency factor for smart city applications, it is rarely discussed.", "venue": "International Journal of Electrical and Computer Engineering (IJECE)", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2019-12-01", "journal": {"name": "International Journal of Electrical and Computer Engineering (IJECE)"}, "authors": [{"authorId": "2078205870", "name": "A. Al-Smadi"}, {"authorId": "1888937", "name": "M. Alsmadi"}, {"authorId": "7822276", "name": "A. Baareh"}, {"authorId": "3412968", "name": "Ibrahim Almarashdeh"}, {"authorId": "1453744761", "name": "Hayam Abouelmagd"}, {"authorId": "2172470814", "name": "Osman Saad Shidwan Ahmed"}], "citations": [{"paperId": "f7a4a7b745b91267213e62a6d10262450010cffe", "title": "Acceptance of IoT Edge-Computing-Based Sensors in Smart Cities for Universal Design Purposes"}, {"paperId": "e3b513f30238a9a794429be584b2d96dee73a8d1", "title": "Leveraging Deep Learning Model for Emergency Situations Detection On Urban Road Using Images From CCTV Cameras"}, {"paperId": "695181970b1517e97853f4968319b009b1924b2e", "title": "The big picture on the internet of things and the smart city: a review of what we know and what we need to know"}, {"paperId": "50fa21ebe474dcff3f6d5b4c16fab75c55a9b2c5", "title": "LoRa based intelligent soil and weather condition monitoring with internet of things for precision agriculture in smart cities"}, {"paperId": "8fda92cb8ebe2bc0337c52ef8f854ea9d4a3dfd7", "title": "Long-range real-time monitoring strategy for Precision Irrigation in urban and rural farming in society 5.0"}, {"paperId": "d214cce4eb9bbca70c56c4e9f2e5dcd65a5e6ffe", "title": "Smart Cities in Indonesia: A Retrospective of the Publication Journey"}, {"paperId": "46520220d8d5ce0d3d9287d053bf7371754cc2ff", "title": "Smart city information processing under internet of things and cloud computing"}, {"paperId": "298d95bcc008a9e2fa0a2d4df8e8b56867487f47", "title": "Fog computing scheduling algorithm for smart city"}, {"paperId": "572b6913ec90fdc2188339a06db91c74829cc2f8", "title": "A review on orchestration distributed systems for IoT smart services in fog computing"}, {"paperId": "17c746a2a2e34f3d482c8296749340bbd573513f", "title": "Role of IoT-Cloud Ecosystem in Smart Cities : Review and Challenges"}, {"paperId": "5f239812701add50a50b14ba58b09626746d0483", "title": "28 GHz balanced pHEMT VCO with low phase noise and high output power performance for 5G mm-Wave systems"}, {"paperId": "99adebd3591f7f324c489c3ac9ba293f17ca7c1b", "title": "Assessing Resources Management for Sharing Economy in Urban Logistics"}, {"paperId": "f3fd9da167e69863d1fff4fa9fedbdeb69ff93de", "title": "Design and Develop a Web-application for Providing Pharmaceutical Product Leaflets Information"}, {"paperId": "e42a14ab531bfab1bb0f87018e7b6d7492fda4c9", "title": "Designing and Developing A Web Application for Tourism"}, {"paperId": "5c4b6bfe4828bb611b64c61562d2151845327e76", "title": "Developing an Effective e-Learning Platform"}, {"paperId": "765b6fb94a8172645f352edfb0e5f3fb6b9822c9", "title": "Designing and Developing A Smart Application for Improving the Communication Between the Deaf, Dumb People and Society"}, {"paperId": "8206d8c8de6e935920eb21aa409451fb71408db6", "title": "E-Sharing : Developing a Web Based Online Donation System"}, {"paperId": "3a6a662eacf10f25d04ea5f59f49b412d29ddc79", "title": "Developing a Platform for Chronic Diseases Awareness"}, {"paperId": "49979f15fe2f50e95ae96468523dc161eda2b186", "title": "Developing and Implementing a Website for Sports Clubs"}, {"paperId": "9aa0f47b630658632a71586706e90aa04e32f2f8", "title": "Developing and Implementing an Online Learning Platform for Children with Autism"}, {"paperId": "df98864154824e4eab5248ffa516475f87ecc1da", "title": "Developing a Smart Nursery Application for Monitoring and Babies Care"}, {"paperId": "20200efe356f35f84fe0c59ab859f27dfe834561", "title": "Developing and Implementing a Web-Based educational platform for Children with Special Needs"}, {"paperId": "e267e08e2baa36b2a7b07d824c9cb2c12f3fdd72", "title": "Designing and Developing of E-Commerce Website for Unused New Goods Shopping"}, {"paperId": "48467d85d2f05c958e061c9b5c3e26f1464350ab", "title": "The Combination of IoT-Sensors in Appliances and block-chain Technology in Smart Cities Energy Solutions"}, {"paperId": "1312440a95e6f076724e77c62407a257a580acf4", "title": "Point of Sale (POS) Network with Embedded Fingerprint Biometric Authentication"}, {"paperId": "f41d62fb01e791f4cee4fe020e33ffcdc943f25a", "title": "Novel Hybrid Architecture of Infotainment for Streaming Signals in Vehicular Network"}, {"paperId": "ef8c1b4c2dba2e0af03b39f98c5acb16cd245d0f", "title": "SAM-SoS: A Stochastic Software Architecture Modeling and Verification Approach for Complex System-of-Systems"}]}
