{"paperId": "9ac6ccdadfd00521fd1759d1f21eeb171d9a8a15", "publicationVenue": {"id": "55cfe77c-5a32-4904-8db5-8025cd9e1bd7", "name": "Applied Mathematics and Nonlinear Sciences", "alternate_names": ["Appl Math Nonlinear Sci"], "issn": "2444-8656", "url": "https://content.sciendo.com/view/journals/amns/amns-overview.xml", "alternate_urls": ["http://journals.up4sciences.org/applied_mathematics_and_nonlinear_sciences.html"]}, "title": "Combined application of ideological and political education and big data Internet technology in the context of education reform", "abstract": "Abstract In the course of today’s socio-political and economic development, along with the advent of the era of big data and the internet, various ideas have emerged and more ideological content and political ideas have continued to emerge. In order to cope with this situation, education reform is constantly innovating, among which the ideological education is particularly important. Various ideological education applications have appeared one after another in the Internet, which allows ideological education to see a new direction of development. The article develops a rigorous computational analysis of the combination of Civic Education and Big Data Internet, applied to the development of a new system. Using decision tree classification algorithm, ID3 algorithm, Bayesian classification algorithm, cohesive hierarchical clustering method for a large number of experimental data processing, the system was completed to build a framework for the combination of big data and Civic Education application. Through data analysis and comparison, it is found that the application of these big data algorithms in the field of Civic Education not only provides more detailed information on Civic Education reform, but also provides objective and comprehensive feedback on the dissemination and learning of Civic Education. In the relevant feedback information, the use of Internet applications for Civic Education reached 100%, Excel was 84%, and all the learning levels of the fixed-point test could reach over 60 points. The above data shows that people have also been able to improve their learning level in Civic Education to a great extent with the Internet technology.", "venue": "Applied Mathematics and Nonlinear Sciences", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-03", "journal": {"name": "Applied Mathematics and Nonlinear Sciences", "volume": "0"}, "authors": [{"authorId": "2108062872", "name": "Xinhua Wang"}], "citations": []}
