{"paperId": "9ad85300333719c71bfb71bffed36edf5264af39", "publicationVenue": {"id": "d3dd5449-daa1-4d57-9412-9add6037584f", "name": "Frontiers in Public Health", "type": "journal", "alternate_names": ["Front Public Health"], "issn": "2296-2565", "url": "https://www.frontiersin.org/journals/public-health", "alternate_urls": ["http://journal.frontiersin.org/journal/public-health", "http://www.frontiersin.org/Public_Health", "http://www.frontiersin.org/Public_Health/about"]}, "title": "Health Informatics: Engaging Modern Healthcare Units: A Brief Overview", "abstract": "In the current scenario, with a large amount of unstructured data, Health Informatics is gaining traction, allowing Healthcare Units to leverage and make meaningful insights for doctors and decision-makers with relevant information to scale operations and predict the future view of treatments via Information Systems Communication. Now, around the world, massive amounts of data are being collected and analyzed for better patient diagnosis and treatment, improving public health systems and assisting government agencies in designing and implementing public health policies, instilling confidence in future generations who want to use better public health systems. This article provides an overview of the HL7 FHIR Architecture, including the workflow state, linkages, and various informatics approaches used in healthcare units. The article discusses future trends and directions in Health Informatics for successful application to provide public health safety. With the advancement of technology, healthcare units face new issues that must be addressed with appropriate adoption policies and standards.", "venue": "Frontiers in Public Health", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2022-04-29", "journal": {"name": "Frontiers in Public Health", "volume": "10"}, "authors": [{"authorId": "2877927", "name": "M. Yogesh"}, {"authorId": "50234236", "name": "J. Karthikeyan"}], "citations": [{"paperId": "3afdf6346637176f6d66a09b05a13c6c6194742c", "title": "Latest developments, obstacles, and upcoming patterns in the realm of eHealth informatics: Review"}, {"paperId": "00824bc89b0b131ec1600b6dd707bf67071b10ed", "title": "A Review of Optimization Studies for System Appointment Scheduling"}, {"paperId": "f85df207b7794a22b38fd95a3c2df8b9b4d82ce1", "title": "Analysis of Hospital management information systems using cobit 5 framework case study \"Saraswati Dental and Oral Hospital in Denpasar”"}, {"paperId": "003c4548865a5968e3e0f678e3bf553f4964736f", "title": "Leveraging Data and Technology to Enhance Interdisciplinary Collaboration and Health Outcomes"}, {"paperId": "d6dcd51d23905b4d3f8abe7969e4d6ebf1ff8d4f", "title": "Evaluation of nutritional status and clinical depression classification using an explainable machine learning method"}, {"paperId": "a7399298ed45932efef64c9951d9322aa6408e1b", "title": "Exploring the topic structure and evolutionary trends of health informatics research in library and information science"}]}
