{"paperId": "9ada59fd4676d4cd81f4c86bc787f24b1d43da9e", "publicationVenue": {"id": "902c5c93-f5c4-4087-918a-e454e8250d10", "name": "ACM Transactions on Social Computing", "alternate_names": ["ACM Trans Soc Comput"], "issn": "2469-7818", "url": "https://dl.acm.org/citation.cfm?id=J1546"}, "title": "Competition Dynamics in the Meme Ecosystem", "abstract": "Creating and sharing memes is a common modality of online social interaction. Because of the prevalence of memes, an abundance of research focuses on understanding how memes are shared and perceived within their online social environment and in what ways they differ from other modalities of online communication. In the present work, we present findings that suggest a relationship between how memes are introduced, shared, and diminish in online social systems and the behavior of biological species within an ecosystem. Framed by this perspective, we borrow ecological methodologies and concepts like resource availability, speciation, and competition to study human attention, creativity, and sharing dynamics (respectively) over a large collection of memes shared on Reddit. Specifically, we find that the population of memes has scaled almost exactly with the total amount of content created over the past decade. We find a consequence of limited human attention in the face of a growing number of memes is that the diversity of memes has decreased at the community level, albeit slightly, in the same period. A further consequence is that the average life span of memes has decreased dramatically, which is further evidence of an increase in competition and a decrease in a meme species’ primary resource: human attention. From this work, we have found reasonable preliminary support for linking memes to species and, thus, meme research to ecological research. We believe that future research should work to strengthen this relationship and transfer more methodologies to meme and information research from ecology.", "venue": "ACM Transactions on Social Computing", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-02-08", "journal": {"name": "ACM Transactions on Social Computing", "pages": "1 - 19", "volume": "6"}, "authors": [{"authorId": "2069772011", "name": "Trenton W. Ford"}, {"authorId": "72048244", "name": "Rachel Krohn"}, {"authorId": "1714166", "name": "Tim Weninger"}], "citations": [{"paperId": "b885c6f00ae216fc730955a49dc606f0799c2b20", "title": "The Impact of Network Structure on Knowledge Adoption: A Network Text Analysis on Knowledge-Sharing Platforms"}, {"paperId": "e405ea9ea79030ecd0e77b53dad0e9f20a5fbecb", "title": "Time pressure reduces misinformation discrimination ability but does not alter response bias"}, {"paperId": "4f5d52d4c71a94279f99e9da36fc73bf725f0231", "title": "Subreddit Links Drive Community Creation and User Engagement on Reddit"}, {"paperId": "a3827e0691d7b8a371fb47aa6f686cc7f246bd47", "title": "Successive cohorts of Twitter users show increasing activity and shrinking content horizons"}, {"paperId": "d130d3372c0c4cdb080e7ab0e5db8356927c8536", "title": "Overview of Shared Task on Multitask Meme Classification - Unraveling Misogynistic and Trolls in Online Memes"}]}
