{"paperId": "9adf0f7b4c8568593ad5774b92fb5e332f93da30", "publicationVenue": null, "title": "RESEARCH ARTICLE Using KMeans Clustering to Evaluate and Alert for Deviations of Linac Photon Beam Parameters", "abstract": "Objective: To analyse the daily measured Dosimetric Quality Assurance (QA) parameters of linear accelerator (linac) using Unsupervised Machine Learning (ML) Algorithm thereby evaluating the current machine status and to highlight the probable cause of the ‘out-of-range’ measured parameter. Methods: Five Parameters measured using PTW QuickCheckwebline device in a linac is subjected to KMeans clustering technique. The measured parameters comprise of Central Axis Dose (CAX), Beam Flatness, SymmetryLR, SymmetryGT and Beam Quality (BQF). Data from Varian with 55-and 107-day’s measurements and from Elekta with 75 days measurements from 2 beam matched linacs were used in this clustering technique. Results: This evaluation is used to review the current linac status and obtain 1) Upper and lower limits of each parameter (CAX, Flatness, Symmetry, Beam Quality), 2) Frequency of the days when the linac parameters are closer to the target value and when they deviate from the target value. 3) The date when these parameters deviate from the estimated limits. 4) The probable reason for the deviation and 5) Finally if the machine requires maintenance. This methodology ensures that the machine is always closest to the target value, thus providing quality radiation treatment for the cancer patients. Moreover, the performance of the linac is studied meticulously and the need for maintenance is alerted before the linac beam shows marked deviation from the base value. Conclusion: KMeans clustering is a very simple and easy to use ML tool. With quick computation time and with lesser data it can arrive at the actual limits of the linac parameters and help to determine if the linac needs maintenance well in advance.", "venue": "", "year": null, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": null, "journal": null, "authors": [{"authorId": "2281811330", "name": "Narmada Chinnakannan"}, {"authorId": "98888129", "name": "Punithavelan Nallamuthu"}], "citations": []}
