{"paperId": "9aecc6c472129bc53f934124b8657c20482d3182", "publicationVenue": {"id": "9cc701cf-1f49-4121-8ea9-11bac24d61ad", "name": "IEEE Transactions on Big Data", "type": "journal", "alternate_names": ["IEEE Trans Big Data"], "issn": "2332-7790", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=6687317", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6687317", "https://ieeexplore.ieee.org/xpl/aboutJournal.jsp?punumber=6687317"]}, "title": "Efficient Interactive Global Cellular Signal Strength Visualization", "abstract": "Cellular Signal Strength (CSS), defined as the signal power received by mobile phones, is an important aspect of geographic information flow analysis, because the density of such information can reflect the urbanization variables such as population, gross domestic product, built-up area, electric power consumption, etc. Despite the importance, the real-time analysis of global CSS distribution remains a challenging problem due to the large data scale. In this article, a Display-driven Computing (DisDC) technique is designed and applied to provide efficient large scale interactive CSS visualization, generating results by calculating the value of each pixel that directly for display. Specifically, we present an efficient CSS measurement algorithm, which introduces spatial indexes and a corresponding query strategy; besides, an optimized parallel computing architecture is proposed to ensure the ability of real-time visualization. Experiments show that our approach obviously outperforms traditional methods and is capable of handling more than 40 million base stations in real-time. Moreover, an online demonstration is provided at https://github.com/MemoryMmy/CSSMap.", "venue": "IEEE Transactions on Big Data", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-10-01", "journal": {"name": "IEEE Transactions on Big Data", "pages": "1209-1219", "volume": "8"}, "authors": [{"authorId": "9427535", "name": "Mengyu Ma"}, {"authorId": "2115384754", "name": "Luo Chen"}, {"authorId": "2247145167", "name": "Ouyang Xue"}, {"authorId": "144429536", "name": "Xiaoran Liu"}, {"authorId": "2152748132", "name": "Jun Li"}, {"authorId": "2935231", "name": "N. Jing"}], "citations": [{"paperId": "5ca5076976074c1ad6d216585de8a227cf8fb279", "title": "HiVecMap: A parallel tool for real-time geovisualization of massive geographic vector data"}]}
