{"paperId": "9af115a0bba289ca381080905dae31df22aac136", "publicationVenue": {"id": "2d100ae4-a9ef-4c13-b34e-1829f6aca016", "name": "Biomimetics", "type": "journal", "issn": "1059-0153", "alternate_issns": ["2313-7673"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-981712", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-981712", "https://www.mdpi.com/journal/biomimetics"]}, "title": "A New Hybrid Particle Swarm Optimization–Teaching–Learning-Based Optimization for Solving Optimization Problems", "abstract": "This research paper develops a novel hybrid approach, called hybrid particle swarm optimization–teaching–learning-based optimization (hPSO-TLBO), by combining two metaheuristic algorithms to solve optimization problems. The main idea in hPSO-TLBO design is to integrate the exploitation ability of PSO with the exploration ability of TLBO. The meaning of “exploitation capabilities of PSO” is the ability of PSO to manage local search with the aim of obtaining possible better solutions near the obtained solutions and promising areas of the problem-solving space. Also, “exploration abilities of TLBO” means the ability of TLBO to manage the global search with the aim of preventing the algorithm from getting stuck in inappropriate local optima. hPSO-TLBO design methodology is such that in the first step, the teacher phase in TLBO is combined with the speed equation in PSO. Then, in the second step, the learning phase of TLBO is improved based on each student learning from a selected better student that has a better value for the objective function against the corresponding student. The algorithm is presented in detail, accompanied by a comprehensive mathematical model. A group of benchmarks is used to evaluate the effectiveness of hPSO-TLBO, covering various types such as unimodal, high-dimensional multimodal, and fixed-dimensional multimodal. In addition, CEC 2017 benchmark problems are also utilized for evaluation purposes. The optimization results clearly demonstrate that hPSO-TLBO performs remarkably well in addressing the benchmark functions. It exhibits a remarkable ability to explore and exploit the search space while maintaining a balanced approach throughout the optimization process. Furthermore, a comparative analysis is conducted to evaluate the performance of hPSO-TLBO against twelve widely recognized metaheuristic algorithms. The evaluation of the experimental findings illustrates that hPSO-TLBO consistently outperforms the competing algorithms across various benchmark functions, showcasing its superior performance. The successful deployment of hPSO-TLBO in addressing four engineering challenges highlights its effectiveness in tackling real-world applications.", "venue": "Biomimetics", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-25", "journal": {"name": "Biomimetics", "volume": "9"}, "authors": [{"authorId": "3453865", "name": "Š. Hubálovský"}, {"authorId": "3454074", "name": "M. Hubálovská"}, {"authorId": "2276547776", "name": "Ivana Matoušová"}], "citations": []}
