{"paperId": "9af55eb18dd4961257a3e8bf8cdb6784f004cfa9", "publicationVenue": {"id": "95d0dda7-5d58-4afd-b59f-315447b81992", "name": "IEEE Communications Surveys and Tutorials", "type": "journal", "alternate_names": ["IEEE Commun Surv Tutor"], "issn": "1553-877X", "url": "http://www.comsoc.org/cst", "alternate_urls": ["http://www.comsoc.org/livepubs/surveys/index.html", "https://ieeexplore.ieee.org/servlet/opac?punumber=7041148", "http://ieeexplore.ieee.org/servlet/opac?punumber=9739"]}, "title": "A Survey on Digital Twin for Industrial Internet of Things: Applications, Technologies and Tools", "abstract": "Digital twin for the industrial Internet of Things (DT-IIoT) creates a high-fidelity, fine-grained, low-cost digital replica of the cyber-physical integrated Internet for industry. Powered by artificial intelligence (AI) and security technologies, DT-IIoT provides advanced features such as real-time monitoring, predictive maintenance, remote diagnostics, and rapid response for smart IIoT systems. A systematic review of key enabling technologies such as digital twin, AI, and blockchain is essential to develop DT-IIoT and reveal pitfalls. This paper reviews the preliminaries, real-world applications, architectures and models of digital twin-driven IIoT. In addition, advanced technologies for intelligent and secure DT-IIoT are investigated, including state-of-the-art AI solutions such as transfer learning and federated learning, as well as blockchain-based security solutions. Moreover, software tools for high-fidelity digital twin modeling are proposed. A case study on reinforcement learning-based integrated-control, communication, and computing (3C) design is developed to demonstrate the AI-driven intelligent DT-IIoT. Finally, this paper outlines the prospective applications, challenges, and integrations with ABCDE (i.e., AI, Blockchain, cloud computing, big data, edge computing) as the future directions.", "venue": "IEEE Communications Surveys and Tutorials", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Communications Surveys & Tutorials", "pages": "2569-2598", "volume": "25"}, "authors": [{"authorId": "2654644", "name": "Hansong Xu"}, {"authorId": "2146668655", "name": "Jun Wu"}, {"authorId": "2005966545", "name": "Qianqian Pan"}, {"authorId": "2212806401", "name": "Xinping Guan"}, {"authorId": "2065439840", "name": "M. Guizani"}], "citations": [{"paperId": "fcaae7f8f18a5991eb1f154a974680db809a6a7f", "title": "Hierarchical Digital Twin for Efficient 6G Network Orchestration via Adaptive Attribute Selection and Scalable Network Modeling"}, {"paperId": "f632f9c2c2dda107657bab21db7e165eb2def613", "title": "AI-enhanced blockchain technology: A review of advancements and opportunities"}, {"paperId": "7970144eeaa2102646f673f476b9938bdbc9a82e", "title": "IoT-Based SHM Using Digital Twins for Interoperable and Scalable Decentralized Smart Sensing Systems"}, {"paperId": "3346508d1a73afb728fa881e61279db23dbf8e73", "title": "Fault Detection in Active Magnetic Bearings Using Digital Twin Technology"}, {"paperId": "d4626c37e22e6b352e2c76409605482af32586a6", "title": "Digital twin: Data exploration, architecture, implementation and future"}, {"paperId": "76b81291239d2df0ded5e214056e59ca2dbeb2a4", "title": "Chaotic and Transfer Function-Assisted Grey Wolf Optimizer for IoT Task Scheduling in Cloud-of Things"}, {"paperId": "d13efe23f296c155868fbd06c6e7135a12cb6e4e", "title": "Intelligent Computation Offloading Based on Digital Twin-Enabled 6G Industrial IoT"}, {"paperId": "6a9984c3f86863e9a485ce7283930807db70ab3c", "title": "Low-cost Digital Twin Design for Power Electronics using Deep Neural Networks"}, {"paperId": "bb0a4e63439bd635a0ec63c58e3d10703e188b1c", "title": "Unveiling the Synergy: IoT and Digital Twins in Transforming Industries"}, {"paperId": "5fec91abb869a9bf7b96fda1e59c56cddfc0b13e", "title": "Cyber-Physical Power System Implementation using HYPERSIM and EXata to Examine the Impact of Cyber-Attack on Microgrid Controller"}, {"paperId": "8814b38aa6bc71f3bb69e92592705c88576c91cf", "title": "Blockchain-Enabled Lightweight Fine-Grained Searchable Knowledge Sharing for Intelligent IoT"}, {"paperId": "0ab1714babbe80e04539cbbfa988aa14d1067ca4", "title": "Hierarchical Federated Transfer learning and Digital Twin Enhanced Secure Cooperative Smart Farming"}, {"paperId": "46bfaea28d156a0c9bcac08de5539da9ccb04b7c", "title": "Digital Twin and DRL-Driven Semantic Dissemination for 6G Autonomous Driving Service"}, {"paperId": "c278dc342fe65a3f7fecefea9697f6fd04ea223d", "title": "An intelligent optimization framework to predict the vulnerable range of tumor cells using Internet of things"}]}
