{"paperId": "9aff657650f34c6e6d3c457728b3ef52912dc501", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "An Integrated Optimization-Based Algorithm for Energy Efficiency and Resource Allocation in Heterogeneous Cloud Computing Centers", "abstract": "At a significant moment in the rapid development of cloud technology, large-scale cloud computing centers have emerged. With the emergence of the internet and artificial intelligence, enormous computing resources are required to process data and train machine learning models. The architecture of cloud computing centers involves millions of computing resources, and improper management of these resources can increase operating costs and exert tremendous pressure on the environment. This study proposes an optimized computing resource and energy management algorithm for computing centers with heterogeneous computing resources from the perspective of Green IT. Specifically, this study models the energy consumption at each point in time and the relationship between tasks and also considers the calculation of data backup. This approach will be expanded to optimize decisions for all computing tasks in computing centers based on the sequence of tasks and energy consumption while considering heterogeneous computing resources, energy efficiency, task scheduling, and execution time. By modeling this issue as a highly nonlinear optimization problem and utilizing mathematical programming and Lagrangian relaxation, we propose an optimized energy management algorithm to effectively manage computing resources and create cloud computing centers with high performance and low energy consumption.", "venue": "IEEE Access", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "53418-53428", "volume": "11"}, "authors": [{"authorId": "80366759", "name": "Kuang-Yen Tai"}, {"authorId": "2113697999", "name": "Frank Yeong-Sung Lin"}, {"authorId": "3244323", "name": "Chiu-Han Hsiao"}], "citations": [{"paperId": "db387839ddc6468f1ba0c0e06e4af3302eda030c", "title": "Improving the Efficiency and Reliability of Renewable Energy Systems: A Study of Parallel and Distributed Architectures for Integrated Wind and Solar Power Generation"}]}
