{"paperId": "9b053eb2293bb3658b8da029bb1911f077cd954b", "publicationVenue": {"id": "9cb29d4c-aff5-4a8d-8ae4-6a2cd440519d", "name": "International Conference on Advanced Communication Technology", "type": "conference", "alternate_names": ["Int Conf Adv Commun Technol", "ICACT"]}, "title": "ICT Enabling Technologies for Smart Cities", "abstract": "A smart city adjusts its social, business, and natural needs, improving the assets it has accessible. Information and Communications Technology (ICT) for shrewd urban areas is to give city answers for encourage an improvement and manageability of a city for the advantage of its population, its economy, and the greater ecosystem in the city. It is to gauge a keen city as far as the enhancements in personal satisfaction and monetary prosperity that are accomplished through applying ICT innovations to design, outline, fabricate, and work the city foundation. In smart city applications, the initial phase in the information's voyage through the application is its gathering by the diverse advancements conveyed all through the city. This paper surveys data acquisition technologies such as Sensor Networks, MANETs, Unmanned Aerial Vehicles (UAVs), Vehicular Ad hoc Networks (VANETs), Internet of Things (IoT), Software-Defined Networking(SDN), Network Functions Virtualization (NFV), 5G. Next, it demonstrates information processing technologies, for example, Cloud Platform, IoT Platform, Big Data Platform, Machine Learning, Deep Learning, and IoT Analytics. Encouraging data spread between various nodes is vital to savvy city acknowledgment. Last, because of the presence of various types of end users (e.g., residents, organizations, government offices, and so forth.) requiring distinctive levels of nature of management, the paper exhibits a proposed testbed solution and recent associated experiments.", "venue": "International Conference on Advanced Communication Technology", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference", "Review"], "publicationDate": "2018-02-01", "journal": {"name": "2020 22nd International Conference on Advanced Communication Technology (ICACT)", "pages": "1180-1192"}, "authors": [{"authorId": "2159499187", "name": "D. Dinh"}, {"authorId": "1797273", "name": "B. Yoon"}, {"authorId": "34769240", "name": "Hung Ngoc Le"}, {"authorId": "40797067", "name": "Uy Quoc Nguyen"}, {"authorId": "46310324", "name": "K. D. Phan"}, {"authorId": "2148704131", "name": "L. D. Pham"}], "citations": [{"paperId": "dbfbfb337f20eb797a34bb2814b14d4c3c59df3a", "title": "State-of-the-Art and Emerging Trends in Internet of Things for Smart Cities"}, {"paperId": "ce070cd045a4887b18e0c03a0d6d74991def8ae9", "title": "METU Smart Campus Project (iEAST)"}, {"paperId": "36645bc294798a239dd9b742bb90b0e4f3d5cb3b", "title": "Hm2Sc: Human Movement Model for Post Disaster Scenario in Smart City"}]}
