{"paperId": "9b12485d8e05fe3f1ce3fd15acde4efc0adb3bb7", "publicationVenue": {"id": "d392378e-e07b-4fcd-a272-7172dbbd9570", "name": "IEEE International Symposium on On-Line Testing and Robust System Design", "type": "conference", "alternate_names": ["International On-Line Testing Symposium", "IOLTS", "IEEE Int Symp On-line Test Robust Syst Des", "Int On-line Test Symp"], "url": "https://ieeexplore.ieee.org/xpl/conhome/1000517/all-proceedings"}, "title": "Silent Data Corruptions: The Stealthy Saboteurs of Digital Integrity", "abstract": "Silent Data Corruptions (SDCs) pose a significant threat to the integrity of digital systems. These stealthy saboteurs silently corrupt data, remaining undetected by traditional error handling mechanisms. The silent nature of SDCs makes them challenging to trace at the hardware level, as they evade error reporting systems. Instead, their effects manifest at the application level, potentially causing data loss and system-wide issues. Detecting and measuring SDCs present unique challenges. Their low occurrence rates, dependence on hardware structure and software workloads, and correlation to environmental factors make accurate measurement complex. Addressing SDCs requires proactive measures to prevent data corruption and ensure digital integrity. Software redundancy methods provide a means to tolerate SDCs by introducing duplication or triplication of application resources. However, these methods come with their own limitations, including increased code size, altered execution patterns, and potential vulnerability to other types of failures. Understanding the nature of SDCs and developing effective mitigation strategies are crucial for maintaining digital integrity in large-scale infrastructure services. This paper sheds light on the stealthy saboteurs that silently corrupt data, emphasizes the need for comprehensive measurement techniques, and explores the limitations of existing mitigation approaches. By addressing the challenges posed by SDCs, we can fortify digital systems against these hidden threats and ensure the reliability and integrity of our digital infrastructure.", "venue": "IEEE International Symposium on On-Line Testing and Robust System Design", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-07-03", "journal": {"name": "2023 IEEE 29th International Symposium on On-Line Testing and Robust System Design (IOLTS)", "pages": "1-7"}, "authors": [{"authorId": "145223775", "name": "G. Papadimitriou"}, {"authorId": "1718647", "name": "D. Gizopoulos"}, {"authorId": "51129719", "name": "H. Dixit"}, {"authorId": "3060271", "name": "S. Sankar"}], "citations": [{"paperId": "7a2a706dcd9db8090f06299a660fd01175e4f3ba", "title": "Gem5-MARVEL: Microarchitecture-Level Resilience Analysis of Heterogeneous SoC Architectures"}, {"paperId": "812dde6fb608ac4a4a86f166eb00142f14e8a295", "title": "Microarchitecturally Exploring Fault-Tolerance and Timing on Silicon on Chip"}, {"paperId": "5cfb2c46da6e4f5a399e96075b001fac81bcbb7d", "title": "Estimating the Failures and Silent Errors Rates of CPUs Across ISAs and Microarchitectures"}]}
