{"paperId": "9b13284ef0a4f87eb343a3c517332048b9025fef", "publicationVenue": {"id": "9448f839-459b-45f3-8573-5eff3f032334", "name": "USENIX Annual Technical Conference", "type": "conference", "alternate_names": ["USENIX Annu Tech Conf", "USENIX", "USENIX ATC"], "url": "https://www.usenix.org/conferences/byname/131"}, "title": "cHash: Detection of Redundant Compilations via AST Hashing", "abstract": "Software projects that use a compiled language are built hundreds of thousands of times during their lifespan. Hence, the compiler is invoked over and over again on an incrementally changing source base. As previous work has shown, up to 97 percent of these invocations are redundant and do not lead to an altered compilation result. In order to avoid such redundant builds, many developers use caching tools that are based on textual hashing of the source files. However, these tools fail in the presence of modifications that leave the compilation result unchanged. Especially for C projects, where module-interface definitions are imported textually with the C preprocessor, modifications to header files lead to many redundant compilations. \n \nIn this paper, we present the cHash approach and compiler extension to quickly detect modifications on the language level that will not lead to a changed compilation result. By calculating a hash over the abstract syntax tree, we achieve a high precision at comparatively low costs. While cHash is light-weight and build system agnostic, it can cancel 80 percent of all compiler invocations early and reduce the build-time of incremental builds by up to 51 percent. In comparison to the state-of-the-art CCache tool, cHash is at least 30 percent more precise in detecting redundant compilations.", "venue": "USENIX Annual Technical Conference", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2017-07-12", "journal": {"pages": "527-538"}, "authors": [{"authorId": "144185846", "name": "Christian J. Dietrich"}, {"authorId": "3161837", "name": "Valentin Rothberg"}, {"authorId": "20551316", "name": "Ludwig Füracker"}, {"authorId": "145714056", "name": "Andreas Ziegler"}, {"authorId": "36548921", "name": "Daniel Lohmann"}], "citations": [{"paperId": "27011931951b21d1b75d82265f78a97d4da9914f", "title": "Enabling Fine-Grained Incremental Builds by Making Compiler Stateful"}, {"paperId": "e87c67ba2787bde2ae00f9bc23fb8e135c4d9508", "title": "Odin: on-demand instrumentation with on-the-fly recompilation"}, {"paperId": "758f7d363d171e18036ba01da7ed501d9c1ce402", "title": "Hashing modulo alpha-equivalence"}, {"paperId": "d0e21b5fd7c4dcb173e4c1f9e539eacfc3e468df", "title": "Native Build System for Unity Builds with Sophisticated Bundle Strategies"}, {"paperId": "00d5140f1d9863d749f0bbc2afa080591f34fa90", "title": "SPEED: Accelerating Enclave Applications Via Secure Deduplication"}, {"paperId": "7ece3adead4e331be3105a3d10d2ddc9fff6f0c0", "title": "To unify or not to unify: a case study on unified builds (in WebKit)"}, {"paperId": "d16912549812053a3bbfecf3d84ab4d8832382c0", "title": "TASTING: Reuse Test-case Execution by Global AST Hashing"}]}
