{"paperId": "9b161df91184ee82a071ee01d6f43173bd5a0326", "publicationVenue": {"id": "2ca4279c-8ed7-4280-8022-09e577923a09", "name": "Frontiers in Neuroscience", "type": "journal", "alternate_names": ["Front Neurosci"], "issn": "1662-453X", "url": "https://www.frontiersin.org/journals/neuroscience", "alternate_urls": ["http://journal.frontiersin.org/journal/neuroscience", "http://www.frontiersin.org/neuroscience/"]}, "title": "Novel Machine-Learning Based Framework Using Electroretinography Data for the Detection of Early-Stage Glaucoma", "abstract": "Purpose Early-stage glaucoma diagnosis has been a challenging problem in ophthalmology. The current state-of-the-art glaucoma diagnosis techniques do not completely leverage the functional measures' such as electroretinogram's immense potential; instead, focus is on structural measures like optical coherence tomography. The current study aims to take a foundational step toward the development of a novel and reliable predictive framework for early detection of glaucoma using machine-learning-based algorithm capable of leveraging medically relevant information that ERG signals contain. Methods ERG signals from 60 eyes of DBA/2 mice were grouped for binary classification based on age. The signals were also grouped based on intraocular pressure (IOP) for multiclass classification. Statistical and wavelet-based features were engineered and extracted. Important predictors (ERG tests and features) were determined, and the performance of five machine learning-based methods were evaluated. Results Random forest (bagged trees) ensemble classifier provided the best performance in both binary and multiclass classification of ERG signals. An accuracy of 91.7 and 80% was achieved for binary and multiclass classification, respectively, suggesting that machine-learning-based models can detect subtle changes in ERG signals if trained using advanced features such as those based on wavelet analyses. Conclusions The present study describes a novel, machine-learning-based method to analyze ERG signals providing additional information that may be used to detect early-stage glaucoma. Based on promising performance metrics obtained using the proposed machine-learning-based framework leveraging an established ERG data set, we conclude that the novel framework allows for detection of functional deficits of early/various stages of glaucoma in mice.", "venue": "Frontiers in Neuroscience", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-05-04", "journal": {"name": "Frontiers in Neuroscience", "volume": "16"}, "authors": [{"authorId": "2112929614", "name": "M. Gajendran"}, {"authorId": "8479825", "name": "Landon J. Rohowetz"}, {"authorId": "5609910", "name": "P. Koulen"}, {"authorId": "7934154", "name": "A. Mehdizadeh"}], "citations": [{"paperId": "5b9c9083fbc9cbcae79ef48f1368ee36f4bd579e", "title": "Artificial intelligence in glaucoma: opportunities, challenges, and future directions"}, {"paperId": "ef9533aa3205d0fc999fa12e703d43899f09191b", "title": "Machine Learning-Based Approach to Wind Turbine Wake Prediction under Yawed Conditions"}, {"paperId": "0904037710213bbb609464dfbcae3172e9989ef9", "title": "Enhancing Electroretinogram Classification with Multi-Wavelet Analysis and Visual Transformer"}, {"paperId": "92786c2b8c525802a7f46bc2d2d074ff3fa644c8", "title": "The Value of Electroretinography in Identifying Candidate Genes for Inherited Retinal Dystrophies: A Diagnostic Guide"}, {"paperId": "b55fd33922ceaadc44bb56a1ac73574329ccad0a", "title": "Retinal electrophysiology in central nervous system disorders. A review of human and mouse studies"}, {"paperId": "fab2cbd6db6d4ab4ff7c675b054aa1bc7f31885d", "title": "Cryogenic carbon capture using efficacious exchange of waste heat energy from flue gas with waste cold energy from LNG"}, {"paperId": "dc3bd464a2ddc9b11ff78e94f66bd1cf4f94d3ec", "title": "Artificial intelligence in ophthalmology. Do we need risk calculators for glaucoma development and progression?"}, {"paperId": "19ee6a6d1be9024c7e2d5348b06fefa6dcd78f63", "title": "Visual electrophysiology and “the potential of the potentials”"}, {"paperId": "a22f45aecabfc68f7e2a6df079ff514c59f19d46", "title": "Novel Machine-Learning-Based Stall Delay Correction Model for Improving Blade Element Momentum Analysis in Wind Turbine Performance Prediction"}, {"paperId": "2f572e337166d1f285f0e7f88402ed3432d1a2ba", "title": "Discrete Wavelet Transform Analysis of the Electroretinogram in Autism Spectrum Disorder and Attention Deficit Hyperactivity Disorder"}]}
