{"paperId": "9b1cfd821fa539ae069b7bea0bc9112bb7fcf610", "publicationVenue": {"id": "c56116d3-225c-47c9-a4d9-f935e32f846c", "name": "IEEE Vehicular Technology Conference", "type": "conference", "alternate_names": ["IEEE Veh Technol Conf", "Veh Technol Conf", "VTC", "Vehicular Technology Conference"], "url": "http://vtsociety.org/"}, "title": "Towards Implementation of Neural Networks for Non-Coherent Detection MIMO systems", "abstract": "In this paper, we propose the use of quantized neural networks (NNs) to perform non coherent MIMO detector in sub-TeraHertz (THz) communications. Implementing NNs is challenging because operations are performed using a high number of bits. This results in slow and energy consuming computations. Then, quantization appears to be essential to consider low latency and energy efficient communication systems. Specifically, in this work, we propose quantizing our designed NN performing demapping operation. We employ VSORA’s digital signal processor (DSP) architecture to perform the quantization. We observe the impact of quantization on the bit error rate. Moreover, we also evaluate the power computation of the proposed DSP regarding our NN. Our simulation results show that we can quantize the weights of the NN to only 6-bits with neglectable degradation on the performance. Besides, we expect achieving high throughput (> 1Gbps), with a peak power consumption of only 0.58W. Thus, the proposed quantization scheme and DSP design allow to achieve high throughput and high energy efficiency.", "venue": "IEEE Vehicular Technology Conference", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-09-01", "journal": {"name": "2022 IEEE 96th Vehicular Technology Conference (VTC2022-Fall)", "pages": "1-5"}, "authors": [{"authorId": "2117571322", "name": "Alexis Falempin"}, {"authorId": "2201637226", "name": "Julien Schmitt"}, {"authorId": "2216194551", "name": "T. D. Nguyen"}, {"authorId": "2154107276", "name": "Jean-Baptiste Doré"}], "citations": [{"paperId": "acebf78a8f2d76ae8273ef3e83c1dbb79c371d50", "title": "Emerging Technologies for 6G Communication Networks: Machine Learning Approaches"}]}
