{"paperId": "9b32f1b56da9b31816e237e17324beca35c15cce", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "ED-FAITH: Evaluating Dialogue Summarization on Faithfulness", "abstract": "Abstractive summarization models typically generate content unfaithful to the input, thus highlighting the significance of evaluating the faithfulness of generated summaries. Most faithfulness metrics are only evaluated on news domain, can they be transferred to other summarization tasks? In this work, we first present a systematic study of faithfulness metrics for dialogue summarization. We evaluate common faithfulness metrics on dialogue datasets and observe that most metrics correlate poorly with human judgements despite performing well on news datasets. Given these findings, to improve existing metrics' performance on dialogue summarization, we first finetune on in-domain dataset, then apply unlikelihood training on negative samples, and show that they can successfully improve metric performance on dialogue data. Inspired by the strong zero-shot performance of the T0 language model, we further propose T0-Score -- a new metric for faithfulness evaluation, which shows consistent improvement against baseline metrics across multiple domains.", "venue": "arXiv.org", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-11-15", "journal": {"name": "ArXiv", "volume": "abs/2211.08464"}, "authors": [{"authorId": "50178985", "name": "Sicong Huang"}, {"authorId": "1709797", "name": "Asli Celikyilmaz"}, {"authorId": "2145539790", "name": "Haoran Li"}], "citations": [{"paperId": "685702489e51af70a60f5a24a9ca58f4c0f77840", "title": "A Survey of Factual Consistency in Summarization from 2021 to 2023"}, {"paperId": "e96348576b682e709b2ee06ea28cd81f8bfa102b", "title": "Exploring the Factual Consistency in Dialogue Comprehension of Large Language Models"}]}
