{"paperId": "9b4f0dfe97a0563fc147aa290a6e2331c3716d0a", "publicationVenue": {"id": "187dde4a-2b59-491b-b6cf-1a8618878cdc", "name": "International Conference on Mobile Data Management", "type": "conference", "alternate_names": ["Int Conf Mob Data Manag", "MDM", "Mobile Data Management", "Mob Data Manag"]}, "title": "A multi-view anomalous co-location detection framework considering both intra- and inter-feature couplings", "abstract": "Co-location is one of the most fundamental spatial associations in spatial data. Previous anomalous co-location detections only aim to detect abnormal inter-feature co-locations on bivariate datasets, while the abnormal intra-feature co-locations are lost, which may have limits to applications. Thus, we propose a novel multi-view anomalous co-location detection framework (MACDF). Two kinds of relationships are captured by two proposed couplings, that is, intra-feature coupling and inter-feature coupling (intra-coupling and inter-coupling for short). Moreover, the neighboring concept in co-location relationships is redefined with a mixture-considered inter-coupling for point-like instances, inspired by the concept for polygonal instances, and a concreted algorithm, i.e. multi-view low-rank analysis with direction for anomalous co-location detection (MLAD-ACD), is designed to discover the anomalous co-locations, on not only bivariate datasets but also multivariate datasets. Experiments show the instantiated algorithm MLAD-ACD can detect anomalous co-locations effectively and efficiently on spatial datasets. Specifically, MLAD-ACD obtains at least a 71% higher AUC score than the state-of-the-art algorithms in an acceptable time.", "venue": "International Conference on Mobile Data Management", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-07-01", "journal": {"name": "2023 24th IEEE International Conference on Mobile Data Management (MDM)", "pages": "132-137"}, "authors": [{"authorId": "2759320", "name": "Xiwen Jiang"}, {"authorId": "151502331", "name": "Lizhen Wang"}, {"authorId": "2233434795", "name": "Junyi Li"}, {"authorId": "49177911", "name": "Hongmei Chen"}, {"authorId": "32284834", "name": "Vanha Tran"}], "citations": []}
