{"paperId": "9b521a43698d5cca58680a6fb0982270bac192d7", "publicationVenue": null, "title": "Augmentation of Body-in-White Dimensional Quality Systems through Artificial Intelligence", "abstract": "Reducing the dimensional variability of the body-in-white (BIW) in automotive manufacturing is perhaps the most difficult quality control problem due to complex interdependencies amongst the multiple assembly stations that a BIW must pass through in a bodyshop. As increasing quantities of dimensional data are generated in factories, manufacturers face the challenge and opportunity to derive value from the data by enabling advanced quality control methods that can realize greater dimensional stability. As the BIW moves through the bodyshop, dimensional deviations propagate and amplify to downstream stations affecting final vehicle fit-and-finish and visible quality aesthetics potentially influencing a customers’ purchase decision. Current BIW quality approaches rely on univariate statistical process control (SPC) charts. With the large amounts of complex data produced, such charts often fail to detect quality patterns that may exist in hyper-dimensional spaces. As a stop-gap measure, manufacturers attempt to remediate quality issues by assigning operators in final vehicle assembly to visually identify and manually fix apparent deviations. This paper illustrates the application of artificial intelligence (AI) to develop a real-time monitoring system that seeks to predict and detect early dimensional quality issues and eliminate the need for costly downstream corrective actions. Moreover, beyond early detection and prediction, the proposed system also facilitates diagnosis of root causes and understanding the true nature of quality issues.", "venue": "2021 IEEE International Conference on Big Data (Big Data)", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-12-15", "journal": {"name": "2021 IEEE International Conference on Big Data (Big Data)", "pages": "1611-1618"}, "authors": [{"authorId": "80637166", "name": "Carlos A. Escobar"}, {"authorId": "3065388", "name": "D. Chakraborty"}, {"authorId": "1738846", "name": "J. Arinez"}, {"authorId": "1398478541", "name": "R. Morales-Menéndez"}], "citations": [{"paperId": "c7b4820486f22ed04308a59cc916f3175080642d", "title": "Quality 4.0 – an evolution of Six Sigma DMAIC"}]}
