{"paperId": "9b5b47127f6430c6c818b7a3e3933af90c4490c4", "publicationVenue": {"id": "b584320a-9e3c-4c68-a677-a15f68472cb6", "name": "Alimentary Pharmacology and Therapeutics", "type": "journal", "alternate_names": ["Aliment Pharmacol Ther", "Aliment Pharmacol  Ther", "Alimentary Pharmacology & Therapeutics"], "issn": "0269-2813", "url": "http://www3.interscience.wiley.com/journal/117987555/home", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/13652036"]}, "title": "Editorial: early and persistent biological treatment and its impact on long term surgical outcomes in inflammatory bowel disease", "abstract": "Since the introduction of the first biological treatment over two decades ago to treat inflammatory bowel disease (IBD) the range of these agents has steadily expanded. Landmark trials have amply demonstrated their efficacy in mucosal healing in the short term but longterm data about their ability to prevent disease progression, bowel damage and need for surgery is scarcer. For these agents to modify disease course it is hypothesised that their use needs to be early and sustained. In routine clinical practice, constraints on health care provision may prevent early initiation and loss of response or intolerance and may hamper sustained use. Using the Danish National Registry, Zhao et al have usefully highlighted the increasing use of biologics and the association with surgical outcomes. In 2018, 10% and 15% of individuals with ulcerative colitis (UC) and Crohn's disease (CD) respectively received biologics, double that of a decade earlier.1 Antitumour necrosis factor (antiTNF) therapy accounted almost all firstline biologic use. In keeping with others,2 treatment persistence, a surrogate of biologic efficacy and tolerability, halved after one year and was a third after 3 years. A reduced risk of IBDrelated surgery was independently associated with duration of biologic treatment but not early use, within 2years of diagnosis. A multivariable analysis revealed rates of surgery for UC, but not CD, fell significantly in the decade of study. In contrast, an interrupted timeseries analysis from Canada found no evidence for a fall in IBDrelated surgery over the same time period.3 Zhao et al did not distinguish between emergency and elective surgery. Over the same decade, rates of colectomy in the UK fell by 15% during acute admissions a quarter in the following 12 months, concurrent with a fourfold increase in the use of antiTNF therapy during acute UC admissions.4", "venue": "Alimentary Pharmacology and Therapeutics", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Editorial"], "publicationDate": "2022-01-17", "journal": {"name": "Alimentary Pharmacology & Therapeutics", "volume": "55"}, "authors": [{"authorId": "3786642", "name": "R. Pollok"}, {"authorId": "52373836", "name": "N. Jayasooriya"}], "citations": []}
