{"paperId": "9b5f98178aa7198e26f65f3a6e610a5841cba4dc", "publicationVenue": {"id": "fcbcaf18-8ab1-43e1-a973-604bbc7e344e", "name": "Proceedings of the VLDB Endowment", "type": "journal", "alternate_names": ["Proceedings of The Vldb Endowment", "Proc VLDB Endow", "Proc Vldb Endow"], "issn": "2150-8097", "url": "http://dl.acm.org/toc.cfm?id=J1174", "alternate_urls": ["http://portal.acm.org/toc.cfm?CFID=21632689&CFTOKEN=99329904&WantType=Affiliated%20Organizations&coll=ACM&dl=ACM&id=J1174&idx=J1174&part=affil&title=VLDB%20Endowment&type=periodical"]}, "title": "Accelerating Exact Constrained Shortest Paths on GPUs", "abstract": "The recently emerging applications such as software-defined networks and autonomous vehicles require efficient and exact solutions for constrained shortest paths (CSP), which finds the shortest path in a graph while satisfying some user-defined constraints. Compared with the common shortest path problems without constraints, CSP queries have a significantly larger number of subproblems. The most widely used labeling algorithm becomes prohibitively slow and impractical. Other existing approaches tend to find approximate solutions and build costly indices on graphs for fast query processing, which are not suitable for emerging applications with the requirement of exact solutions. A natural question is whether and how we can efficiently find the exact solution for CSP.\n \n In this paper, we propose\n Vine\n , a framework that parallelizes the labeling algorithm to efficiently find the exact CSP solution using GPUs. The major challenge addressed in Vine is how to deal with a large number of subproblems that are mostly unpromising but require a significant amount of memory and computational resources. Our solution is twofold. First, we develop a two-level pruning approach to eliminate the subproblems by making good use of the GPU's hierarchical memory. Second, we propose an adaptive parallelism control model based on the observations that the degree of parallelism (DOP) is the key to performance optimization with the given amount of computational resources. Extensive experiments show that Vine achieves 18× speedup on average over the widely adopted CPU-based solution running on 40 CPU threads. Vine also has over 5× speedup compared with a GPU approach that statically controls the DOP. Compared to the state-of-the-art approximate solution with preprocessed indices, Vine provides exact results with competitive or even better performance.\n", "venue": "Proceedings of the VLDB Endowment", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-12-01", "journal": {"name": "Proc. VLDB Endow.", "pages": "547-559", "volume": "14"}, "authors": [{"authorId": "48834718", "name": "Shengliang Lu"}, {"authorId": "143824511", "name": "Bingsheng He"}, {"authorId": "1823512389", "name": "Yuchen Li"}, {"authorId": "144371174", "name": "Hao Fu"}], "citations": [{"paperId": "ca463c82e5faf3e675b6b5cf9a237a2e1e6d26b0", "title": "Accelerating Biclique Counting on GPU"}, {"paperId": "8d95e56e4ef6a625489752579706fcd624936ab2", "title": "A Low-Memory Community Detection Algorithm With Hybrid Sparse Structure and Structural Information for Large-Scale Networks"}, {"paperId": "0c150be8add0d4869821fd912685219ef7372e00", "title": "PathWise: a flexible, open-source library for the Resource Constrained Shortest Path"}, {"paperId": "db63bd49a343b0b61c8617fca29b4b5ae00403d5", "title": "ClipSim: A GPU-friendly Parallel Framework for Single-Source SimRank with Accuracy Guarantee"}, {"paperId": "33e5f2fc4a93fe6d65a6ae59894d99ee20be321d", "title": "Global Routing Optimization In Road Networks"}, {"paperId": "140408bdb39b1b5da6ead0fc651638efadd13da7", "title": "Efficient Navigation for Constrained Shortest Path with Adaptive Expansion Control"}, {"paperId": "5c03e7f2146a80d9917c9761e8337b810a467e99", "title": "Optimizing Random Access to Hierarchically-Compressed Data on GPU"}, {"paperId": "f3fba9c3cd255e74973b9abe2ee1c5917cc3fa83", "title": "A Multi-Threading Algorithm for Constrained Path Optimization Problem on Road Networks"}, {"paperId": "7ee91acd17ee6d9362531d1680cbff9d2f2e2a20", "title": "FHL-Cube: Multi-Constraint Shortest Path Querying with Flexible Combination of Constraints"}, {"paperId": "68ec4cf80fe0b9347f9fad2ca5d51e746663af22", "title": "Most relevant point query on road networks"}, {"paperId": "8102f8c109604c51d310dc6e8f33e65adf03532c", "title": "Constrained Path Search with Submodular Function Maximization"}, {"paperId": "19ca71996772969492a595728ec03b65cfa22488", "title": "GPU-Accelerated Graph Label Propagation for Real-Time Fraud Detection"}, {"paperId": "e5d878e57f4ffff999abe5a69a0abd7a6c418dbb", "title": "Self-adaptive Graph Traversal on GPUs"}]}
