{"paperId": "9b624fa6c6be9f0347e7d319248778843abf6a64", "publicationVenue": {"id": "9bc219ae-a4dc-4241-8e1a-0552f9ee9ef7", "name": "International Symposium on Circuits and Systems", "type": "conference", "alternate_names": ["ISCAS", "Int Symp Circuit Syst"]}, "title": "A Non-conventional Sum-and-Max based Neural Network layer for Low Power Classification", "abstract": "The increasing need for small and low-power Deep Neural Networks (DNNs) for edge computing applications involves the investigation of new architectures that allow good performance on low-resources/mobile devices. To this aim, many different structures have been proposed in the literature, mainly targeting the reduction in the costs introduced by the Multiply and Accumulate (MAC) primitive. In this work, a DNN layer based on the novel Sum and Max (SAM) paradigm is proposed. It does not require either the use of multiplications or the insertion of complex non-linear operations. Furthermore, it is especially prone to aggressive pruning, thus needing a very low number of parameters to work. The layer is tested on a simple classification task and its cost is compared with a classic DNN layer with equivalent accuracy based on the MAC primitive, in order to assess the reduction of resources that the use of this new structure could introduce.", "venue": "International Symposium on Circuits and Systems", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-05-28", "journal": {"name": "2022 IEEE International Symposium on Circuits and Systems (ISCAS)", "pages": "712-716"}, "authors": [{"authorId": "151438227", "name": "Luciano Prono"}, {"authorId": "1685605", "name": "Mauro Mangia"}, {"authorId": "1827025", "name": "F. Pareschi"}, {"authorId": "1728694", "name": "R. Rovatti"}, {"authorId": "1731098", "name": "G. Setti"}], "citations": [{"paperId": "e29521f9a20bcbe4063e5ebbba18badf2b73fd97", "title": "Aggressively prunable MAM²-based Deep Neural Oracle for ECG acquisition by Compressed Sensing"}]}
