{"paperId": "9b6a769a8562674bd4d126d0e810f97172f147c0", "publicationVenue": null, "title": "Paying Attention to the Algorithm Behind the Curtain: Bringing Transparency to YouTube's Demonetization Algorithms", "abstract": "YouTube has long been a top-choice destination for independent video content creators to share their work. A large part of YouTube's appeal is owed to its practice of sharing advertising revenue with qualifying content creators through the YouTube Partner Program (YPP). In recent years, changes to the monetization policies and the introduction of algorithmic systems for making monetization decisions have been a source of controversy and tension between content creators and the platform. There have been numerous accusations suggesting that the underlying monetization algorithms engage in preferential treatment of larger channels and effectively censor minority voices by demonetizing their content. In this paper, we conduct a measurement of the YouTube monetization algorithms. We begin by measuring the incidence rates of different monetization decisions and the time taken to reach them. Next, we analyze the relationships between video content, channel popularity and these decisions. Finally, we explore the relationship between demonetization and a channel's view growth rate. Taken all together, our work suggests that demonetization after a video is publicly listed is not a common occurrence, the characteristics of the process are associated with channel size and (in unexplainable ways) video topic, and demonetization appears to have a harsh influence on the growth rate of smaller channels. We also highlight the challenges associated with conducting large-scale algorithm audits such as ours and make an argument for more transparency in algorithmic decision-making.", "venue": "Proc. ACM Hum. Comput. Interact.", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-11-07", "journal": {"name": "Proceedings of the ACM on Human-Computer Interaction", "pages": "1 - 31", "volume": "6"}, "authors": [{"authorId": "51194693", "name": "Arun Dunna"}, {"authorId": "145137850", "name": "Katherine A. Keith"}, {"authorId": "1398192285", "name": "Narseo Vallina-Rodriguez"}, {"authorId": "2405355", "name": "Rishab Nithyanand"}, {"authorId": "153724741", "name": "Brendan T. O'Connor"}], "citations": [{"paperId": "3345be951ec5183821502cf2a0f7aa5e1ffe8d0b", "title": "Cruising Queer HCI on the DL: A Literature Review of LGBTQ+ People in HCI"}, {"paperId": "3604797e3a6316f1be9649fe62ddeef762f718b3", "title": "On the relevance of APIs facing fairwashed audits"}, {"paperId": "8a82bb5c5a769d2d524d08ecd37220e1ef6713be", "title": "How Auditing Methodologies Can Impact Our Understanding of YouTube's Recommendation Systems"}, {"paperId": "b2ed3dded487ab8b1d8f0ca078b834fedffbcc80", "title": "Understanding the (In)Effectiveness of Content Moderation: A Case Study of Facebook in the Context of the U.S. Capitol Riot"}, {"paperId": "6e63212def0783609b76727282ac0545dc00a6c6", "title": "SoK: Content Moderation in Social Media, from Guidelines to Enforcement, and Research to Practice"}]}
