{"paperId": "9b6ee797edb4e35dba6c0df08759e09564fc1879", "publicationVenue": {"id": "e2acdbdd-8665-4181-be7e-b7d710482fe5", "name": "International Journal of Cloud Applications and Computing", "type": "journal", "alternate_names": ["Int J Cloud Appl Comput"], "issn": "2156-1834", "url": "http://www.igi-global.com/ijcac"}, "title": "A Comprehensive Survey on Cloud Computing: Architecture, Tools, Technologies, and Open Issues", "abstract": "Cloud computing is one of the most spectacular technological achievements of the 21st century, allowing users to access various on-demand services (e.g., storage, servers, networks, apps, and services) from anywhere. All advanced technologies such as internet of things (IoT), smart cities, smart grid, system automation, 5G, and logistics systems require services offered by cloud computing. This paper provides a complete architectural tutorial on cloud computing, focusing on various service and deployment models, architectures, inter-clouds concepts, and multiple merits of cloud computing in artificial intelligence, fog computing, edge computing, and IoT. It also discusses different quality-of-service (QoS) parameters that are helpful for the consumers to decide upon the service quality offered by any cloud provider. A comparative study of the hypervisor and container-based virtualization technologies has been discussed. Finally, simulation tools and various open research issues of cloud computing are presented, appealing for the researchers to decide on future research directions.", "venue": "International Journal of Cloud Applications and Computing", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-01-01", "journal": {"name": "Int. J. Cloud Appl. Comput.", "pages": "1-33", "volume": "12"}, "authors": [{"authorId": "2184904363", "name": "Md Saquib Jawed"}, {"authorId": "2148382537", "name": "Mohammad Sajid"}], "citations": [{"paperId": "94cbc7427b2e0f38c3847b6723e3c411c5c4c160", "title": "LSDedup: Layered Secure Deduplication for Cloud Storage"}, {"paperId": "429e8e1f91bf87397b461f7b6400b41f475c3abd", "title": "Enhancing the cryptographic key using sample entropy and whale optimization algorithm"}, {"paperId": "9a831da4a0f0293bf4cf8057eaab2b5f6c21063a", "title": "Salp Swarm Algorithm to solve Cryptographic Key Generation problem for Cloud computing"}, {"paperId": "39bd88660bfc8ad34b31cb5a4b978c01f8e4c7b4", "title": "Towards Workflow Allocation using Dragonfly Algorithm in Cloud Computing Environment"}, {"paperId": "7ece9e10906fd9385a3e2d7f4ab06a6403ebf372", "title": "Comparative Analysis of LFSR and NLFSR based Lightweight Stream Ciphers for Use in IoT"}, {"paperId": "98195d11995ac71aa665cc16ba6087494c8b6ed7", "title": "Cryptanalysis of Lightweight Block Ciphers using Metaheuristic Algorithms in Cloud of Things (CoT)"}, {"paperId": "283f8a1a3626c1006b3a7df15875a4d22b25135e", "title": "Hunger Games Search: A Scheduler for Cloud Computing"}, {"paperId": "f6cec0d2cf814068034799c50c37f303585c8bb2", "title": "Blockchain Technology: Opportunities & Challenges"}, {"paperId": "22e02b3e717bb9ab973a13186c910e953ed830ea", "title": "XECryptoGA: a metaheuristic algorithm-based block cipher to enhance the security goals"}, {"paperId": "bfd5f4bc11603321a46cf2bf25f752207c700940", "title": "Multi Objective Prioritized Workflow Scheduling Using Deep Reinforcement Based Learning in Cloud Computing"}]}
