{"paperId": "9b773bfdebafcf363a4cad234130a61b438f8429", "publicationVenue": null, "title": "Revisiting the internet of things: New trends, opportunities and grand challenges", "abstract": "The Internet of Things (IoT) has brought the dream of ubiquitous data access from physical environments into reality. IoT embeds sensors and actuators in physical objects so that they can communicate and exchange data between themselves to improve efficiency along with enabling real-time intelligent services and offering better quality of life to people. The number of deployed IoT devices has rapidly grown in the past five years in a way that makes IoT the most disruptive technology in recent history. In this paper, we reevaluate the position of IoT in our life and provide deep insights on its enabling technologies, applications, rising trends and grand challenges. The paper also highlights the role of artificial intelligence to make IoT the top transformative technology that has been ever developed in human history.", "venue": "Frontiers in The Internet of Things", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-11-14", "journal": {"volume": "1"}, "authors": [{"authorId": "3080067", "name": "Khalid Elgazzar"}, {"authorId": "2123026695", "name": "Haytham Khalil"}, {"authorId": "2093844461", "name": "Taghreed Alghamdi"}, {"authorId": "144227277", "name": "Ahmed Badr"}, {"authorId": "1996183300", "name": "Ghadeer Abdelkader"}, {"authorId": "101413371", "name": "Abdelrahman Elewah"}, {"authorId": "1709598", "name": "R. Buyya"}], "citations": [{"paperId": "d70f4529b2434c191525cd61bad45eaeb69227ec", "title": "Augmenting context with power information for green context-awareness in smart environments"}, {"paperId": "2ce003e0023a8097b4311e0493f717f5595140c7", "title": "Unlocking the potential: A comprehensive meta-synthesis of Internet of Things in the sports industry"}, {"paperId": "147a811d9a34c9265a71818de9bc0249fbcab9f4", "title": "Efficient Packet Handling Mechanism In MQTT During Emergency Message Dissemination In Internet of Vehicles"}, {"paperId": "6ca59381e6811a6f5a2df6c2b3bd1a1128c92185", "title": "Enhancing IOT based software defect prediction in analytical data management using war strategy optimization and Kernel ELM"}, {"paperId": "2236cbcf701692ec148e5f5a9bed9959b28cd4cb", "title": "Key parameters linking cyber-physical trust anchors with embedded internet of things systems"}, {"paperId": "babf9178ea8f8d094dc730906e13b273a6f65ed2", "title": "Enabling Extremely Energy-Efficient End-to-End Secure Communications for Smart Metering Internet of Things Applications Using Static Context Header Compression"}, {"paperId": "b472563367eaf76f11330d655a9aa289cd683539", "title": "Operability of Smart Spaces in Urban Environments: A Systematic Review on Enhancing Functionality and User Experience"}, {"paperId": "ffe72742350147b1c7e09b06945bbf707272ccc6", "title": "Parametrical T-Gate for Joint Processing of Quantum and Classic Optoelectronic Signals"}, {"paperId": "ec0d11cb4bea898838e58db7402f658ca777a58a", "title": "A hybrid deep learning-based intrusion detection system for IoT networks."}, {"paperId": "b102f73680309aee30ec4e20d192ce2f918423d5", "title": "A comparative analysis of recurrent neural network and support vector machine for binary classification of spam short message service"}, {"paperId": "4eeac8c49a2558368c763e21d800e77902f61327", "title": "Matching audio/video app features with young user preferences: An integrated approach"}, {"paperId": "47274da4fca424ab35fa8f2847446d0d4022f47d", "title": "Data Verification in the Agent, Combining Blockchain and Quantum Keys by Means of Multiple-Valued Logic"}, {"paperId": "24928b0eb962e9f3389482923df3c415e6e57dd7", "title": "Analysis of Application-Level Load Balancing Algorithms"}, {"paperId": "51afb885df1672d3b63aa71d2733e905a7047f5a", "title": "An Edge Computing-based Handgun and Knife Detection Method in IoT Video Surveillance Systems"}]}
