{"paperId": "9b8aabefe970826aa3c9e5ea21586ebb45748c0e", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Enabling Deep Learning for All-in EDGE paradigm", "abstract": "Deep Learning-based models have been widely investigated, and they have demonstrated significant performance on non-trivial tasks such as speech recognition, image processing, and natural language understanding. However, this is at the cost of substantial data requirements. Considering the widespread proliferation of edge devices ( e.g. , Internet of Things devices) over the last decade, Deep Learning in the edge paradigm, such as device-cloud integrated platforms, is required to leverage its superior performance. Moreover, it is suitable from the data requirements perspective in the edge paradigm because the proliferation of edge devices has resulted in an explosion in the volume of generated and collected data. However, there are difficulties due to other requirements such as high computation, high latency, and high bandwidth caused by Deep Learning applications in real-world scenarios. In this regard, this survey paper investigates Deep Learning at the edge, its architecture, enabling technologies, and model adaption techniques, where edge servers and edge devices participate in deep learning training and inference. For simplicity, we call this paradigm the All-in EDGE paradigm. Besides, this paper presents the key performance metrics for Deep Learning at the All-in EDGE paradigm to evaluate various deep learning techniques and choose a suitable design. Moreover, various open challenges arising from the deployment of Deep Learning at the All-in EDGE paradigm are identified and discussed.", "venue": "arXiv.org", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "ArXiv", "volume": "abs/2204.03326"}, "authors": [{"authorId": "2196055", "name": "Praveen Joshi"}, {"authorId": "2474496", "name": "Haithem Afli"}, {"authorId": "144231505", "name": "Mohammed Hasanuzzaman"}, {"authorId": "2134602630", "name": "Chandra Thapa"}, {"authorId": "145372809", "name": "T. Scully"}], "citations": [{"paperId": "552708dafe00a8f5b49ae8547ea371ddd05098ab", "title": "Enabling Resource-Efficient AIoT System With Cross-Level Optimization: A Survey"}, {"paperId": "b4a78b53f1ce36d9ed8e3acd6f92e63d8f092d34", "title": "Real-world Machine Learning Systems: A survey from a Data-Oriented Architecture Perspective"}, {"paperId": "6e40fec60d3b13571323c333999931fd1b9cbcc9", "title": "Bolt: Fast Inference for Random Forests"}, {"paperId": "8c382e97c543853e4cdc73a81a200116f11b0599", "title": "Facilitating Deep Learning for Edge Computing: A Case Study on Data Classification"}]}
