{"paperId": "9b8abf4467fb0b316ebdbf627bcf8aa8d5b004c4", "publicationVenue": {"id": "bb76d4ad-9e60-461c-86ff-2cb86e1ebd34", "name": "Journal of Scientometric Research", "type": "journal", "alternate_names": ["J Scientometr Res"], "issn": "2320-0057", "url": "http://www.jscires.org/"}, "title": "Machine Learning-based Predictive Systems in Higher Education: A Bibliometric Analysis", "abstract": "This paper aims to comprehensively review the present state and research trends in predictive systems in higher education. It also addresses the research contribution of countries in Machine Learning-based predictive systems in higher education to depict the research landscape given the growing number of related publications. A bibliometric analysis of publications on predictive systems in education published in the Scopus Database from 2015 to 2022 was conducted. The dataset obtained covered the contribution of authors, affiliations, countries, themes and trends in the field of Machine Learning-based predictive systems in higher education. A total of 72 publications with 3408 cited references were collected from Scopus for the bibliometric analysis. The technique used for the bibliometric analysis included performance analysis and science mapping. Research on Machine Learning-based predictive systems has been widely published from 2020 to 2022. Researchers in China, Belgium, Spain, India, and Korea were most active in researching Machine Learning-based predictive systems in education. However, international collaborations have remained infrequent except for the few involving Australia, Belgium, and Canada. There is a lack of research in the subject area in Africa. This study illustrates the intellectual landscape of Machine Learning-based predictive systems in higher education and the field's evolution and emerging trends. The findings highlight the area of research concentration and the most recent developments and suggest future research collaborations on a larger scale as well as additional research on the implementation of", "venue": "Journal of Scientometric Research", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-08-06", "journal": {"name": "Journal of Scientometric Research"}, "authors": [{"authorId": "95653380", "name": "Fati Tahiru"}, {"authorId": "73980979", "name": "Steven. Parbanath"}, {"authorId": "113682416", "name": "Samuel Agbesi"}], "citations": []}
