{"paperId": "9ba542a8bb010f99aa772c71049729f473684450", "publicationVenue": {"id": "99e98681-158c-48ca-8f86-386d75770b50", "name": "IEEE/ACM International Symposium on Modeling, Analysis, and Simulation On Computer and Telecommunication Systems", "type": "conference", "alternate_names": ["IEEE/ACM Int Symp Model Anal Simul Comput Telecommun Syst", "Model Anal Simul Comput Telecommun Syst", "Modeling, Analysis, and Simulation On Computer and Telecommunication Systems", "MASCOTS"], "url": "http://www.mascots-conference.org/"}, "title": "Just-in-Time Aggregation for Federated Learning", "abstract": "The increasing number and scale of federated learning (FL) jobs necessitates resource efficient scheduling and management of aggregation to make the economics of cloud-hosted aggregation work. Existing FL research has focused on the design of FL algorithms and optimization, and less on aggregation efficacy. In this paper, we propose a new FL aggregation paradigm - “just-in-time” (JIT) aggregation that leverages unique properties of FL jobs, especially the periodicity of model updates, to defer aggregation as much as possible and free compute resources for other FL jobs or other datacenter workloads. We describe a novel way to prioritize FL jobs for aggregation, and demonstrate using multiple datasets, models and FL aggregation algorithms that our techniques can reduce resource usage by 60+% when compared to eager aggregation used in existing FL platforms. We demonstrate that using JIT aggregation has negligible overhead and impact on the latency of the FL job.", "venue": "IEEE/ACM International Symposium on Modeling, Analysis, and Simulation On Computer and Telecommunication Systems", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-08-20", "journal": {"name": "2022 30th International Symposium on Modeling, Analysis, and Simulation of Computer and Telecommunication Systems (MASCOTS)", "pages": "1-8"}, "authors": [{"authorId": "143863352", "name": "K. R. Jayaram"}, {"authorId": "2152638957", "name": "Ashish Verma"}, {"authorId": "18730445", "name": "Gegi Thomas"}, {"authorId": "46761645", "name": "Vinod Muthusamy"}], "citations": [{"paperId": "e5da8360b38ae1f06d403f56d09da2c10c119a31", "title": "A Tutorial on Federated Learning from Theory to Practice: Foundations, Software Frameworks, Exemplary Use Cases, and Selected Trends"}, {"paperId": "8221357325c0ea1cc45c825e264a77ba220d2f83", "title": "FLIPS: Federated Learning using Intelligent Participant Selection"}, {"paperId": "70210227462b7b3df498b32a30fd75dc7bb61dbd", "title": "FedLesScan: Mitigating Stragglers in Serverless Federated Learning"}]}
