{"paperId": "9baca6173941d5c799820773453d93b88b4d98f2", "publicationVenue": {"id": "d3dd5449-daa1-4d57-9412-9add6037584f", "name": "Frontiers in Public Health", "type": "journal", "alternate_names": ["Front Public Health"], "issn": "2296-2565", "url": "https://www.frontiersin.org/journals/public-health", "alternate_urls": ["http://journal.frontiersin.org/journal/public-health", "http://www.frontiersin.org/Public_Health", "http://www.frontiersin.org/Public_Health/about"]}, "title": "Simulation and forecasting models of COVID-19 taking into account spatio-temporal dynamic characteristics: A review", "abstract": "The COVID-19 epidemic has caused more than 6.4 million deaths to date and has become a hot topic of interest in different disciplines. According to bibliometric analysis, more than 340,000 articles have been published on the COVID-19 epidemic from the beginning of the epidemic until recently. Modeling infectious diseases can provide critical planning and analytical tools for outbreak control and public health research, especially from a spatio-temporal perspective. However, there has not been a comprehensive review of the developing process of spatio-temporal dynamic models. Therefore, the aim of this study is to provide a comprehensive review of these spatio-temporal dynamic models for dealing with COVID-19, focusing on the different model scales. We first summarized several data used in the spatio-temporal modeling of the COVID-19, and then, through literature review and summary, we found that the existing COVID-19 spatio-temporal models can be divided into two categories: macro-dynamic models and micro-dynamic models. Typical representatives of these two types of models are compartmental and metapopulation models, cellular automata (CA), and agent-based models (ABM). Our results show that the modeling results are not accurate enough due to the unavailability of the fine-grained dataset of COVID-19. Furthermore, although many models have been developed, many of them focus on short-term prediction of disease outbreaks and lack medium- and long-term predictions. Therefore, future research needs to integrate macroscopic and microscopic models to build adaptive spatio-temporal dynamic simulation models for the medium and long term (from months to years) and to make sound inferences and recommendations about epidemic development in the context of medical discoveries, which will be the next phase of new challenges and trends to be addressed. In addition, there is still a gap in research on collecting fine-grained spatial-temporal big data based on cloud platforms and crowdsourcing technologies to establishing world model to battle the epidemic.", "venue": "Frontiers in Public Health", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2022-10-18", "journal": {"name": "Frontiers in Public Health", "volume": "10"}, "authors": [{"authorId": "2118951980", "name": "Peipei Wang"}, {"authorId": "2286510101", "name": "Xin-qi Zheng"}, {"authorId": "2115376503", "name": "Haiyan Liu"}], "citations": [{"paperId": "ab5029f1426ab94e3c3a22de58b8ad963e2a2162", "title": "Modeling COVID-19 spread using multi-agent simulation with small-world network approach"}, {"paperId": "ecfd37f44d748f2ead4212b17fd4b86246daaaa3", "title": "Towards development of functional climate-driven early warning systems for climate-sensitive infectious disease: Statistical models and recommendations."}, {"paperId": "b473277da02509b7cabb6637a6e48ab2664954eb", "title": "The unintended consequences of inconsistent closure policies and mobility restrictions during epidemics"}, {"paperId": "3a2e6378d2c69ada69d19d655e12981fe595ca32", "title": "Inference on spatiotemporal dynamics for networks of biological populations (preprint)"}, {"paperId": "aac669b9229fee346858b828fca3543a3ef61597", "title": "Amazing aspects of inequality indices (Gini and Kolkata Index) of COVID-19 confirmed cases in India"}, {"paperId": "b04bcb2572788ab9a91abce111e3d2d9452158b7", "title": "Geoepidemiological perspective on COVID-19 pandemic review, an insight into the global impact"}, {"paperId": "645cbedd0f5782ee465c2376f496c4a9ab8f1b7b", "title": "Prediction of Daily New COVID-19 Cases - Difficulties and Possible Solutions"}, {"paperId": "efb7cc698889d4a86c7cae2c4a439bc430a43626", "title": "Modeling Consequences of COVID-19 and Assessing Its Epidemiological Parameters: A System Dynamics Approach"}, {"paperId": "016fc937b476effba56d89212a69df328e0638eb", "title": "On the spread of charitable behavior in a social network: a model based on game theory"}]}
