{"paperId": "9bbf3ec10f2a693010a1639769082c51794a629a", "publicationVenue": {"id": "17c52c4d-2a56-4ef5-b23f-54d989ef66c6", "name": "ACM Transactions on Modeling and Performance Evaluation of Computing Systems", "alternate_names": ["ACM Trans Model Perform Evaluation Comput Syst"], "issn": "2376-3639", "url": "https://dl.acm.org/citation.cfm?id=J1525"}, "title": "The Limit of Horizontal Scaling in Public Clouds", "abstract": "Public cloud users are educated to practice horizontal scaling at the application level, with the assumption that more processing capacity can be achieved by adding nodes into the server fleet. In reality, however, applications—even those specifically designed to be horizontally scalable—often face unpredictable scalability issues when running at scale. In this article, we study the limit of horizontal scaling in public clouds by identifying sources of such limitations and quantitatively measuring their impact on processing capacity. To this end, we develop ScaleBench as a distributed and parallel cloud-scale testing framework and propose a capacity degradation index (CDI) to describe the level of capacity degradation observed in our benchmark studies. We have conducted extensive experiments in four real public clouds to identify possible bottlenecks in compute, block storage, networking, and object storage. Further, we carry out large-scale experiments with a real-life video transcoding application on worker fleets with up to 3200 vCPU cores. Our experimental results provide the quantitative evidence on the limit of horizontal scaling in public clouds. This helps cloud users make better design decisions on horizontally scalable applications.", "venue": "ACM Transactions on Modeling and Performance Evaluation of Computing Systems", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-02-04", "journal": {"name": "ACM Transactions on Modeling and Performance Evaluation of Computing Systems (TOMPECS)", "pages": "1 - 22", "volume": "5"}, "authors": [{"authorId": "2414974", "name": "Qingye Jiang"}, {"authorId": "2116463677", "name": "Young Choon Lee"}, {"authorId": "9392149", "name": "Albert Y. Zomaya"}], "citations": [{"paperId": "79e245eb83cd500721bf4ebc61bb33493c556750", "title": "Challenges and Specificities of Adopting Continuous Integration within Scalable Cloud Environments"}, {"paperId": "6db85bab2de7521add8238e12da67614c78a3da1", "title": "SLO Script: A Novel Language for Implementing Complex Cloud-Native Elasticity-Driven SLOs"}, {"paperId": "257aefd81da93e0f878d5b00645a5d1076d86e2b", "title": "A Novel Middleware for Efficiently Implementing Complex Cloud-Native SLOs"}, {"paperId": "edda9aafde5d8de7b1cc472fbc6070e45f6673c8", "title": "SLOC: Service Level Objectives for Next Generation Cloud Computing"}]}
