{"paperId": "9bc8483bb11a19f9ee47931760d030c42788adc5", "publicationVenue": {"id": "c0ded351-0e49-473e-816e-23b84c9f8dd3", "name": "Frontiers in Environmental Science", "type": "journal", "alternate_names": ["Front Environ Sci"], "issn": "2296-665X", "url": "http://www.frontiersin.org/Environmental_Science", "alternate_urls": ["https://www.frontiersin.org/journals/environmental-science"]}, "title": "Spatial distribution and influencing factors of mountainous geological disasters in southwest China: A fine-scale multi-type assessment", "abstract": "Abstract: Geological disasters have long been a constant threat to socioeconomic development and human life and property. Many studies focus on the occurred geological disasters and ignore the potential risk events. Fine-scale multi-type analysis of Potential Geological Disasters Spots (PGDSs) is a necessary but insufficiently explored research field in China’s mountainous areas. Taking Meigu County (Sichuan Province, Southwest China), a typical disaster-prone region, as the study area. Average nearest neighbor (ANN), standard deviational ellipse (SDE), kernel density estimation (KDE), and ordinary least squares (OLS) regression are used to assess the spatial distribution of potential geological disasters spots and their influencing factors. The findings show that: potential geological disasters spots have a significant spatial heterogeneity and exhibited a prominent clustering characteristic. They were distributed in an elevation range of 1,500–2000 m, which receives an average monthly rainfall of more than 240 mm, as well as in highly foliated (0.6 < Normalized Difference Vegetation Index (NDVI) < 0.8), west-facing (247.5–292.5°), and slopes of 10–20°. In addition, slope, aspect, population density, and rainfall were found as the main influencing factors. The results provide practical rural development measures with support for potential geological disasters spots avoidance and preparedness.", "venue": "Frontiers in Environmental Science", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-11-24", "journal": {"volume": "10"}, "authors": [{"authorId": "1398402106", "name": "Bo Shu"}, {"authorId": "2155645988", "name": "Yang Chen"}, {"authorId": "1405115868", "name": "Majid Amani-Beni"}, {"authorId": "2110012231", "name": "Ruizhi Zhang"}], "citations": [{"paperId": "8997425746c06fb1b868e9a3d6ead2b397e2a5d6", "title": "Temporal and spatial pattern analysis and susceptibility assessment of geological hazards in Hunan Province of China from 2015 to 2022"}, {"paperId": "6c2306ea4aa022076656067e0b80f820abe5b83b", "title": "Spatial vulnerability assessment of rural settlements in hilly areas using BP neural network algorithm"}, {"paperId": "04514aff2da57178b6433dca7aeb06a682f020e9", "title": "Joint optimization of parcel delivery periodic location-routing and prepositioning disaster response facilities"}, {"paperId": "35e4269e4dc84f3ec1036c323e885ca4043a7ecb", "title": "Determination of hydraulic parameters of non-linear consolidation clay layers by type curve method"}]}
