{"paperId": "9bd2e0fc988f8978452ca9952437e01ef96dd949", "publicationVenue": {"id": "593344cb-eda4-42fe-aed3-468969e4a676", "name": "International Conference on Software Engineering Research and Applications", "type": "conference", "alternate_names": ["Int Conf Softw Eng Res Appl", "Software Engineering Research and Applications", "Softw Eng Res Appl", "SERA"], "url": "http://www.acisinternational.org/"}, "title": "Named Data Networking (NDN) for Data Collection of Digital Twins-based IoT Systems", "abstract": "With the rise and growing attention on Digital Twins (DT) as a way to provide integration between the Internet of Things (IoT) and data analytics, so does the need to consider how to address its challenges. To deal with these challenges, Named Data Networking (NDN) can be a possible solution. NDN has been rising in popularity due to its advancements over the traditional TCP/IP Internet architecture. In this paper, our approach begins with the framework that leverages an NDN-based DT architecture for data management. We then design two scenarios that focus on the performance of data querying in a small and large-scale simulated NDN-based DT architecture. Based on the designed scenarios, we conduct the performance evaluation of data query and DT performance to investigate the performance gap and determine whether an action needs to be taken.", "venue": "International Conference on Software Engineering Research and Applications", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-05-23", "journal": {"name": "2023 IEEE/ACIS 21st International Conference on Software Engineering Research, Management and Applications (SERA)", "pages": "122-127"}, "authors": [{"authorId": "152461712", "name": "Hengshuo Liang"}, {"authorId": "2055414574", "name": "Cheng Qian"}, {"authorId": "2110141589", "name": "Chao Lu"}, {"authorId": "2148600978", "name": "Lauren Burgess"}, {"authorId": "2227701002", "name": "John Mulo"}, {"authorId": "144323104", "name": "Wei Yu"}], "citations": []}
