{"paperId": "9be10bd46386757db09dbee64ce07908fcaeb105", "publicationVenue": {"id": "1b767051-ba1f-457e-bd23-1b483c7029c7", "name": "E3S Web of Conferences", "alternate_names": ["E3S Web Conf"], "issn": "2267-1242", "url": "https://web.archive.org/web/*/http:/www.e3s-conferences.org/", "alternate_urls": ["https://www.e3s-conferences.org/"]}, "title": "Distributed storage optimization using multi-agent systems in Hadoop", "abstract": "Understanding data and extracting information from it are the main objectives of data science, especially when it comes to big data. To achieve these goals, it is necessary to collect and process massive data sets, arriving at the system in different formats at great velocity. The Big Data era has brought us new challenges in data storage and management, and existing state-ofthe-art data storage and processing tools are poised to meet the challenges while posing challenges to the next generation of data. Big Data storage optimization is essential for improving the overall efficiency of Big Data systems by maximizing the use of storage resources. It also reduces the energy consumption of Big Data systems, resulting in financial savings, environmental protection, and improved system performance. Hadoop provides a solution for storing and analysing large quantities of data. However, Hadoop can encounter storage management problems due to its distributed nature and the management of large volumes of data. In order to meet future challenges, the system needs to intelligently manage its storage system. The use of a multi-agent system presents a promising approach for efficiently managing hot and cold data in HDFS. These systems offer a flexible, distributed solution for solving complex problems. This work proposes an approach based on a multi-agent system capable of gathering information on data access activity in the HDFS cluster. Using this information, it classifies data according to its temperature (hot or cold) and makes decisions about data replication based on its classification. In addition, it compresses unused data to manage resources efficiently and reduce storage space usage.", "venue": "E3S Web of Conferences", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": null, "journal": {"name": "E3S Web of Conferences"}, "authors": [{"authorId": "2167782804", "name": "Manar Sais"}, {"authorId": "2376074", "name": "N. Rafalia"}, {"authorId": "2232308929", "name": "Rabie Mahdaoui"}, {"authorId": "2290947", "name": "J. Abouchabaka"}], "citations": [{"paperId": "558b22abb4b09b24c552691f234d565ee74fa100", "title": "Enhancing Hadoop distributed storage efficiency using multi-agent systems"}]}
