{"paperId": "9be52e3dd6b181b96b8dccecf415df9c378c9e98", "publicationVenue": {"id": "c6840156-ee10-4d78-8832-7f8909811576", "name": "IEEE Transactions on Knowledge and Data Engineering", "type": "journal", "alternate_names": ["IEEE Trans Knowl Data Eng"], "issn": "1041-4347", "url": "https://www.computer.org/web/tkde", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=69"]}, "title": "Erasable Virtual HyperLogLog for Approximating Cumulative Distribution over Data Streams", "abstract": "Many real-world datasets are given in the stream of entity-identifier pairs, and measuring data distribution on these datasets is fundamental for applications such as privacy protection. In this paper, we study the problem of computing the cumulative distribution for different cardinalities (i.e., the number of distinct entities owning the same identifier). However, previous sketch-based methods cost large memory space especially when there are a large number of identifiers, and sampling-based methods require much time for cardinality estimation. A recent work KHyperLogLog combines both sketch and sampling methods but it is wasteful to separately build a HyperLogLog sketch of large size for identifiers with small cardinalities. To address these challenges, we propose a memory-efficient method EV-HLL, which designs a shared structure to store all sampled identifiers and their entities and utilizes additional sketches to track value updates during the sampling procedure. Meanwhile, EV-HLL provides real-time unbiased estimations according to value changes whenever a new entity-identifier pair arrives. We evaluate the performance of EV-HLL and other state-of-the-arts on real-world available datasets. Experimental results demonstrate that comparing to other methods, EV-HLL effectively reduces their memory usage with the same estimation accuracy and has higher accuracy with the same memory usage.", "venue": "IEEE Transactions on Knowledge and Data Engineering", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-01-19", "journal": {"name": "IEEE Transactions on Knowledge and Data Engineering", "pages": "5336-5350", "volume": "34"}, "authors": [{"authorId": "2059664599", "name": "Peng Jia"}, {"authorId": "2152206172", "name": "Pinghui Wang"}, {"authorId": "1805899", "name": "Junzhou Zhao"}, {"authorId": "145533683", "name": "Jing Tao"}, {"authorId": "2130403581", "name": "Ye Yuan"}, {"authorId": "143923928", "name": "X. Guan"}], "citations": [{"paperId": "53962258e7ad58c3261e7d38aa10ef2743d64da3", "title": "A generic sketch for estimating super-spreaders and per-flow cardinality distribution in high-speed data streams"}, {"paperId": "429f34ea357e1720abfafe75030894eb7b15fcf3", "title": "Towards Accurate and Efficient Super Spreader Detection with Sketching"}, {"paperId": "a1f92462d06656fcab2083f2661bf3afa9fbc71f", "title": "Analytical Confidence Intervals for the Number of Different Objects in Data Streams"}]}
