{"paperId": "9be90309470b8d6eef44182c093bc28c2d643b9c", "publicationVenue": {"id": "22466e99-8720-4629-9169-4469e385e4d8", "name": "IEEE International Conference on Emerging Technologies and Factory Automation", "type": "conference", "alternate_names": ["Emerg Technol Fact Autom", "IEEE Int Conf Emerg Technol Fact Autom", "ETFA", "Emerging Technologies and Factory Automation"], "url": "http://www.wikicfp.com/cfp/program?id=937"}, "title": "Applying Runtime Monitoring to the Industrial Internet of Things", "abstract": "In the context of the Industrial Internet of Things safety and robustness play a crucial role as autonomous and emergent behavior increase the complexity of Cyber-Physical Production Systems. Given the intractability of exhaustively verifying distributed production systems, testing and runtime monitoring seem to be two promising methods used to verify correctness in the digitally networked factory. External runtime monitoring is an efficient and lightweight technique that bridges the gap between testing and verification.This paper describes a framework for on-the-fly monitor generation using a state-of-the-art monitoring algorithm for proving properties of a distributed production system relying on the Amazon Web Services Internet of Things architecture and the use of the digital shadow. The feasibility of the proposed architecture is evaluated using an industrial case study.", "venue": "IEEE International Conference on Emerging Technologies and Factory Automation", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-09-01", "journal": {"name": "2019 24th IEEE International Conference on Emerging Technologies and Factory Automation (ETFA)", "pages": "348-355"}, "authors": [{"authorId": "72101120", "name": "Marco Grochowski"}, {"authorId": "1713709", "name": "S. Kowalewski"}, {"authorId": "31980552", "name": "Melanie Buchsbaum"}, {"authorId": "1735841", "name": "C. Brecher"}], "citations": [{"paperId": "46e72e0db249cd98f7ff6234efb63336eb1965f1", "title": "Enhancing Throughput for TTEthernet via Co-optimizing Routing and Scheduling: An Online Time-Varying Graph-based Method"}, {"paperId": "dc72dfeceede3ded62af26e922cd091bf5f023bc", "title": "Edge-Based Runtime Verification for the Internet of Things"}, {"paperId": "e7835d0f2f1fca993a7a21ef32ce993b465de6b6", "title": "Collaboration is not Evil: A Systematic Look at Security Research for Industrial Use"}, {"paperId": "742ea417cec1dc69e5157e8c1712b8296388c609", "title": "Edge-Based Runtime Verification for the Internet of Things"}, {"paperId": "dd22d0a9d4b124e1fca0991f6bc90b560390441d", "title": "A Survey of Software Log Instrumentation"}, {"paperId": "2f179bfc7e2a92044e3d5a2b57bb9087bf926663", "title": "Applying Passive Testing to an Industrial Internet of Things Plant"}]}
