{"paperId": "9bea5d8ec354bf2ed130786883c0794bd79ac7a8", "publicationVenue": {"id": "098d941f-120e-4f86-8969-40004d31e9ec", "name": "Biomaterials Science", "type": "journal", "alternate_names": ["Biomater Sci"], "issn": "2047-4830", "url": "https://www.rsc.org/journals-books-databases/about-journals/biomaterials-science/", "alternate_urls": ["http://pubs.rsc.org/en/journals/journal/bm", "https://pubs.rsc.org/en/Journals/JournalIssues/bm#!recentarticles&all"]}, "title": "Therapeutic effect of indirubin-loaded bovine serum albumin nanoparticules on ulcerative colitis.", "abstract": "Indirubin is considered to have promising potential in the treatment of ulcerative colitis (UC). However, poor aqueous solubility and low bioavailability limit its clinical application. We produced indirubin-loaded bovine serum albumin nanoparticles (INPs) and characterized their drug encapsulation efficiency, drug-loading capacity, capacity to release indirubin in vitro and short-term physical stability. We also investigated the pharmacokinetics of INPs in mice. We then compared the curative effects of INPs and indirubin against dextran sulfate sodium-induced colitis in mice and 3D cultured biopsies from patients with UC. In the mouse model, the outcomes of INP treatment, including the disease activity index and serous levels of interleukin (IL)-1β and IL-10, were significantly different from those of indirubin treatment. Similarly, when we administered INPs and indirubin to the ex vivo colonic tissues of patients with UC, the effect of INPs was stronger than that of indirubin for most antioxidant and anti-inflammatory biomarkers. The results of both the animal trial and ex vivo experiment indicate that the therapeutic effect of indirubin was further enhanced by the carrier system, making it a highly promising medical candidate for UC.", "venue": "Biomaterials Science", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-03-24", "journal": {"name": "Biomaterials science"}, "authors": [{"authorId": "120354028", "name": "Guang-Min Yu"}, {"authorId": "2141315603", "name": "Li-feng Zhou"}, {"authorId": "2155378796", "name": "Xiaoming Liu"}, {"authorId": "47655556", "name": "Bin Liu"}, {"authorId": "2159718799", "name": "Xue-Ying Lai"}, {"authorId": "15170372", "name": "Chunxia Xu"}, {"authorId": "2159720297", "name": "Ming-Yi Long"}, {"authorId": "2160292673", "name": "Yan-Ming Zhu"}, {"authorId": "2110250779", "name": "Jide Wang"}, {"authorId": "5256308", "name": "Ming-Song Li"}], "citations": [{"paperId": "a53467612c558563c0fe329ab8323f3b92379c20", "title": "Hyaluronic acid/inulin-based nanocrystals with an optimized ratio of indigo and indirubin for combined ulcerative colitis therapy via immune and intestinal flora regulation."}]}
