{"paperId": "9bf1c83af51fcd22d860a296d63ceb5200ce18cb", "publicationVenue": {"id": "8d301aac-f75f-40d6-8403-6e17cfe4d59a", "name": "Canadian journal of public health", "type": "journal", "alternate_names": ["Canadian Journal of Public Health-revue Canadienne De Sante Publique", "Can j public health", "Can J Public Heal Can Sante Publique"], "issn": "0008-4263", "url": "http://www.springer.com/gp/products/journals", "alternate_urls": ["https://www.jstor.org/journal/canajpublheal", "http://www.jstor.org/action/showPublication?journalCode=canajpublheal"]}, "title": "How to carry out participatory research that takes account of sex and gender issues: a scoping review of guidelines targeting health inequities", "abstract": "Objectif Les recherches participatives (RP) visant l’amélioration de la santé doivent tenir compte de rapports de pouvoir inéquitables, incluant ceux liés au sexe/genre (S/G). Cela peut s’avérer difficile vu les compétences requises et la rareté de recommandations. Notre objectif consistait à réaliser une revue de portée menant à une typologie des recommandations existantes pour les chercheurs.euses sur l’intégration du S/G en contexte de RP en santé publique, particulièrement en santé environnementale ou au travail. Méthodologie Un comité d’encadrement a participé à chaque étape de l’étude. Nous avons retenu 19 documents parmi 513 références identifiées dans neuf bases de données scientifiques et la littérature grise (2000–2020). L’extraction et le codage qualitatif des recommandations a mené à une analyse de clusters basée sur les similitudes identifiant quatre types centrés sur : 1) pouvoir d’agir; 2) actions concrètes; 3) macro-système; et 4) parties prenantes. Synthèse Plusieurs sources indiquaient comment intégrer le S/G pendant la collecte/analyse des données ou la diffusion des résultats. Peu de recommandations touchaient l’aspect S/G au niveau des partenariats avec des parties prenantes ou des transformations sociopolitiques durables. Les recommandations en santé au travail étaient moins similaires aux autres sous-domaines de santé publique. Les relations de pouvoir en milieu de travail engendrent des obstacles spécifiques liés à l’intégration du S/G et nécessitent une attention particulière. L’intersectionnalité et les pratiques réflexives sont apparues comme des thèmes primordiaux. Conclusion Les recommandations repérées aideront des chercheurs.euses à différents stades de leur parcours d’intégration du S/G dans une RP en cours, allant de la familiarisation à l’anticipation de difficultés. Objective Conducting participatory research (PR) aimed at improving health implies considering inequitable power relations, including those related to sex/gender (S/G). This necessitates specific skills and methods and may be challenging especially since guidelines are scarce. Our objective was to perform a scoping review to provide a typology of existing guidelines for researchers on how to take account of S/G in the context of PR in public health, with a focus on occupational and environmental health. Methods All steps of the research were conducted with the collaboration of an advisory committee, following PR principles. Nineteen documents were retained from 513 references identified in nine scientific databases and grey literature between 2000 and 2020. Data on recommendations were extracted and coded qualitatively. Cluster analysis based on similarities in recommendations proposed in the documents identified four types: (1) empowerment-centered; (2) concrete action-centered; (3) macrosystem-centered; and (4) stakeholder-centered. Synthesis Many sources gave pointers on how to include S/G during data collection and analysis or during the dissemination of findings, but there was a dearth of suggestions for building partnerships with stakeholders and producing sustainable S/G sociopolitical transformations. Occupational health PR showed less similarities with other public health subfields including environmental health PR. Power relationships with workplace stakeholders generated specific obstacles related to S/G integration that require further attention. Intersectionality and reflexive practices emerged as overarching themes. Conclusion This review provides helpful guidelines to researchers at different stages of planning PR, ranging from familiarizing themselves with S/G approaches to anticipating difficulties in their ongoing S/G-transformative PR.", "venue": "Canadian journal of public health", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-02-08", "journal": {"name": "Canadian Journal of Public Health", "pages": "404-421", "volume": "114"}, "authors": [{"authorId": "2097891879", "name": "Mélanie Lefrançois"}, {"authorId": "1402233128", "name": "H. Sultan-Taïeb"}, {"authorId": "37807084", "name": "Jena Webb"}, {"authorId": "120450967", "name": "Mathieu-Joel Gervais"}, {"authorId": "3914977", "name": "K. Messing"}, {"authorId": "1413634482", "name": "Vanessa Blanchette-Luong"}, {"authorId": "6552856", "name": "Jessica Riel"}, {"authorId": "1403062133", "name": "Johanne Saint-Charles"}, {"authorId": "144750861", "name": "Rachel Faust"}, {"authorId": "5381697", "name": "C. Vaillancourt"}, {"authorId": "38607230", "name": "M. Fillion"}, {"authorId": "77391771", "name": "M. Laberge"}], "citations": []}
