{"paperId": "9bf2a39fa4d13a95a65e8e2516441baa5d23bf47", "publicationVenue": {"id": "6401bb05-050b-4beb-8824-066cb2938eb4", "name": "Mathematical Problems in Engineering", "type": "journal", "alternate_names": ["Math Probl Eng"], "issn": "1024-123X", "url": "http://www.gbhap-us.com/journals/238/238-top.htm", "alternate_urls": ["https://www.hindawi.com/journals/mpe/"]}, "title": "Vocal Music Teaching Brands Recommendation Based on Review Mining and Multicriteria Decision-Making", "abstract": "In the process of continuous improvement in the quality of vocal music teaching, new opportunities and challenges are ushered in. Teachers need to actively develop innovative and creative teaching activities in line with the teaching objectives and tasks of the new curriculum reform, enhance students’ application and mastery of knowledge points, and provide a boost to students’ high-quality practical learning activities. This paper proposes a method for recommending vocal teaching brands based on review mining and multicriteria decision-making. Firstly, a large number of student reviews are crawled from various university platforms in China, matching student views to lexical combinations of course opinions. The weight of each opinion indicator was calculated by using hierarchical analysis in multicriteria decision-making, and 35 teachers and students were asked to do paired comparison and scoring for the indicators. The results of the experiment suggest improvements to the recommended vocal teaching brands, with practical implications for the design and improvement of vocal music teaching.", "venue": "Mathematical Problems in Engineering", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-08-18", "journal": {"name": "Mathematical Problems in Engineering"}, "authors": [{"authorId": "2178945880", "name": "Zhenming Yu"}], "citations": [{"paperId": "ff55cf725c845ff9476ee85ad558c68424b52d59", "title": "Exploring T-spherical fuzzy sets for enhanced evaluation of vocal music classroom teaching"}]}
