{"paperId": "9bfe3af132079ac8dba8d8805e55bd226bca7783", "publicationVenue": {"id": "200954ca-a7ab-4707-a9a8-ee93513d6e74", "name": "Social Media + Society", "type": "journal", "alternate_names": ["Social media and society", "Soc Media + Soc", "Soc media soc"], "issn": "2056-3051", "url": "https://journals.sagepub.com/home/sms", "alternate_urls": ["http://sms.sagepub.com/", "http://www.uk.sagepub.com/journals/Journal202332"]}, "title": "The Ethics of Publicly Available Data Research: A Situated Ethics Framework for Reddit", "abstract": "Using user-generated content from open-access platforms such as Reddit for research raises ethical questions and challenges. Research projects involving publicly available data can qualify for an exemption from human research ethics review. However, when the exemption is granted, some scholars move to the data collection phase without attending further to ethical considerations. This does not always result from negligence but can be driven by the lack of coherent guidelines or limitations of procedural ethics. Despite receiving an exemption from ethics review, researchers can still engage with ethical concerns throughout the project. This article argues that a “situated ethics approach” to researching publicly available online data, which pays attention to flexibility, reflexivity, and complexity of research ethics, should be applied to projects working with data from user-led platforms—Reddit or others. Using a reflexive process and drawing iteratively on learnings, this article describes and analyses a situated ethics framework applied to a case study of doctoral research about youth health discussions on Reddit. Through a focus on three key areas: digital context, users’ views, and project specificity, the framework inspired a set of ethical questions that can assist with applying situated ethics to other studies. This paper advocates that a “situated ethics approach” to researching publicly available online data can usefully advance debates and practice in research on user-led platforms with public data, such as Reddit.", "venue": "Social Media + Society", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-07-01", "journal": {"name": "Social Media + Society"}, "authors": [{"authorId": "2096069186", "name": "Martyna Gliniecka"}], "citations": [{"paperId": "e3be5dbb48491a1131bcdcd69f1a32315b5427fc", "title": "Constructing ambivalent masculinity and constant femininity in interracial families: Media representations of African-Chinese marriage on Xiaohongshu"}]}
