{"paperId": "9c01ac10cc9c235d706e1914eb75f83718eddd7a", "publicationVenue": null, "title": "The Real Time Big Data Processing Framework Advantages and Limitations", "abstract": "--- Big data is a blanket term for the non-traditional strategies and technologies needed to gather, organize, process, and gather insights from large datasets. While the problem of working with data that exceeds the computing power or storage of a single computer is not new, the pervasiveness, scale, and value of this type of computing have greatly expanded in recent years. In this paper, we will take a look at one of the essential components of a big data system: processing frameworks. Processing frameworks compute over the data in the system, either by reading from non-volatile storage or as it is ingested into the system. Computing over data is the process of extracting information and insight from large quantities of individual data points.", "venue": "", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2017-12-31", "journal": {"name": "", "pages": "305-312", "volume": "5"}, "authors": [{"authorId": "72110578", "name": "V. Gurusamy"}, {"authorId": "2057701176", "name": "S. Kannan"}, {"authorId": "1381862871", "name": "K. Nandhini"}], "citations": [{"paperId": "9c253252ee881dffc531431e75b67610030bb51f", "title": "A comparative study of big data use in Egyptian agriculture"}, {"paperId": "2e13475a8a9ebc557b326626ab4261a7a901526a", "title": "A Real-Time Analysis of Human Performance in Interactive and Adaptive Mixed-Reality Simulation"}, {"paperId": "ea694e085574ed931eddf0c5b6f37802eb6b5118", "title": "Spatiotemporal Analysis of Urban Green Spatial Vitality and the Corresponding Influencing Factors: A Case Study of Chengdu, China"}, {"paperId": "ba0c5d2ebb1c7daa8e58238bc1582e70d8b2fa1d", "title": "Integrating Heterogeneous Stream and Historical Data Sources using SQL"}, {"paperId": "2729f086dcc2e2b29e874285b3113a3096c8c5b0", "title": "Migration of Batch Processing Systems in Financial Sectors to Near Real-Time Processing"}, {"paperId": "fb294c1a30ed274387227158dc7df608a63291a4", "title": "Building an IoT Platform Based on Service Containerisation"}, {"paperId": "cfd5063808f3a1c6b4b9da598c10b094fb753153", "title": "Evaluative Review of Streaming Analytics: Tools and Technologies in Real-Time Data Processing"}, {"paperId": "97a5caf166a8764944160beb6c86e5766881d8da", "title": "Big Data Architectures Benchmark for Forecasting Electricity Consumption"}, {"paperId": "a61fe0641a91b970e73b55ce9bb1fe32af7f978c", "title": "STREAMER: A Powerful Framework for Continuous Learning in Data Streams"}, {"paperId": "ce13b0a6d585eaa7a61095238b11ba9ac75d364c", "title": "Big Data Analytics: Importance, Challenges, Categories, Techniques, and Tools"}, {"paperId": "10a69285d0b888346550cf93b9f40c8503d067e0", "title": "A stream processing architecture for heterogeneous data sources in the Internet of Things"}, {"paperId": "dffff132ce21d084198bba27b6de684aaf1c128c", "title": "Big Data Architecture: Designing the Right Solution for Social Network Analysis"}, {"paperId": "3c450f9c7e6d14c325fb0ddb7e9e4e2055a03840", "title": "Review of Big Data and Processing Frameworks for Disaster Response Applications"}, {"paperId": "bd614828640a412eeae2efa16385ca1aba52a0d9", "title": "SCoTv2: Large Scale Data Acquisition, Processing, and Visualization Platform"}, {"paperId": "d5a3833314d915d5578a1f873578a648a311db0e", "title": "Design and engineering of system for large-scale Internet Traffic Visualisation"}, {"paperId": "d8fc4594108b02c8f6325dd26dd67168a50791d6", "title": "Comparative and Analytical Study of Big Data Technologies: A Survey"}, {"paperId": "6f28796198874fa3c5c5c596e06d4af76699048f", "title": "Predictive Maintenance System for Efficiency Improvement of Heating Equipment"}, {"paperId": "1fff771460f608cf5a3a613827ecda516caa01ef", "title": "The ACDF Algorithm in the Stream Data Analysis for the Bank Telemarketing Campaign"}, {"paperId": "a041863a8dda699c1e3d36e281b4d0572085b778", "title": "Webalyt: Implemetation of architecture for capturing web user behaviours with feedback propagation"}, {"paperId": "6e169a43654062738f646f2f03dcd83c96f40438", "title": "Performance analysis of ensemble learning for artificial and real time data streams - Research directions"}, {"paperId": "f30219e52292825430aed684acf7fb47365ca0ff", "title": "A Conceptual Framework for using Big Data in Egyptian Agriculture"}, {"paperId": "7254eda3938c217a93230c06ad14156f6a6ca4c1", "title": "Building a Personalized Fitness Recommendation Application based on Sequential Information"}, {"paperId": "68c4799301cf80d9b3de5c4756adf36ede0f1296", "title": "Doctoral Symposium: Pre-processing and Data Validation in IoT Data Streams"}, {"paperId": "961aba48e832d6b9414dc323d20ffa40bffbf78e", "title": "Big Data Streaming Platforms to Support Real-time Analytics"}, {"paperId": "ec69edb09731e03506b7696e4a1db53aba901141", "title": "Modern Federated Database Systems: An Overview"}, {"paperId": "66225703f66eda04525e8c39497cc981915f39dc", "title": "Equipamentos de Climatização Predictive Maintenance Mechanisms for Heating Equipment"}]}
