{"paperId": "9c042c2c64c2abc926d0d31668bc3ba10b19bc1d", "publicationVenue": {"id": "af7fd4f4-27e8-413c-b3e7-4c145913de95", "name": "International Conference on Applied and Theoretical Computing and Communication Technology", "type": "conference", "alternate_names": ["iCATccT", "Int Conf Appl Theor Comput Commun Technol"]}, "title": "Big Data Strategies – A Review and Survey", "abstract": "Big data is primarily defined by the volume of a data set - generally measuring tens of terabytes and sometimes crossing the threshold of petabytes. The process of extracting useful information by analyzing different types of big data sets is called Big data analytics. Big data analytics helps organizational decision making by discovering hidden patterns, market trends and consumer preferences. This is done by following several steps and technologies involved in big data analytics. The selection of one of these technologies is based on various parameters and this selection varies from project to project as requirements and nature of projects changes. This review paper therefore aims at finding most common strategies of big data such as scalability, Programming Language Support, Latency etc. and their current state in computing world. This paper also discusses public perception on the parameters selected.", "venue": "International Conference on Applied and Theoretical Computing and Communication Technology", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference", "Review"], "publicationDate": "2018-09-01", "journal": {"name": "2018 4th International Conference on Applied and Theoretical Computing and Communication Technology (iCATccT)", "pages": "287-293"}, "authors": [{"authorId": "1500650699", "name": "Riya Bakhtiani"}, {"authorId": "2055426358", "name": "M. Gandhi"}, {"authorId": "9348833", "name": "Prathamesh P. Churi"}, {"authorId": "152906205", "name": "Poonam Gupta"}], "citations": [{"paperId": "5c0d159258baebce69d4a137f09a8db82203295c", "title": "Data Strategy Development: A Taxonomy for Data Strategy Tools and Methodologies in the Economy"}]}
