{"paperId": "9c089444e05399d256bb33ac7ac62df55da3696b", "publicationVenue": {"id": "c0ec137d-a370-425d-9cf0-766fd7f536dd", "name": "Journal of Applied Security Research", "type": "journal", "alternate_names": ["J Appl Secur Res"], "issn": "1936-1610", "url": "http://www.tandfonline.com/loi/wasr20", "alternate_urls": ["http://www.tandfonline.com/toc/wasr20/current"]}, "title": "Data Science Applied to Crime Analysis Based on Brazilian Open Government Data", "abstract": "Abstract Context: The criminality phenomenon affects the quality of life, the economic growth and the reputation of a nation. Each year, governments spend millions of dollars fighting violence, and consequently, crime prevention and control are highly concerning issues to the public safety agencies. Objective: Applying Data Science fundamentals to analyze open government data on the crimes that occurred in the Brazilian States. Method: We have conducted a controlled experiment to discover the association rules (AR) between the crimes and the States. Additionally, we have developed a ranking of the most dangerous States. Results: From a general viewpoint, with weights for all available crimes, Paraná was the most dangerous local during all the assessed years, followed by Rio de Janeiro. From the single perspective of murders, in 2019, the States of Roraima, Rio Grande do Norte, Sergipe, Acre and Pernambuco were ranked as the ten most violent ones, being Pernambuco and Acre among the most dangerous States from the two perspectives (weighted average and murders). Conclusion: The Data Science enables the execution of more precise diagnoses. The year of 2019 presented a general drop in the crime rates, with special emphasis on Paraíba, Goiás, Rio Grande do Norte and Ceará.", "venue": "Journal of Applied Security Research", "year": 2021, "fieldsOfStudy": ["Political Science"], "publicationTypes": null, "publicationDate": "2021-01-27", "journal": {"name": "Journal of Applied Security Research", "pages": "18 - 61", "volume": "17"}, "authors": [{"authorId": "1861909880", "name": "Kleber Henrique de Jesus Prado"}, {"authorId": "2125663859", "name": "Methanias Colaço Júnior"}], "citations": []}
