{"paperId": "9c101403691505e6423122f185d55a26b7d74a81", "publicationVenue": null, "title": "Scalable and Declarative Information Extraction in a Parallel Data Analytics System", "abstract": "In recent years, the size of unstructured data has grown tremendously and the complexity of the analysis of such data has increased significantly. In many domains, information extraction (IE) is an important technique to turn unstructured texts into structured fact databases, but systematically applying IE techniques to very large inputs requires highly complex, adaptable, and scalable systems. Although a number of tools for different IE tasks exist, their seamless, extensible, and scalable combination into a large-scale end-to-end text analytics system still is a true challenge. This thesis addresses exactly this problem, i.e., we research and develop a querybased IE system that is accurate, configurable towards concrete application domains, and scalable to Terabyte-scale text collections inside a parallel data analytics system. Within this topic, we conduct four consecutive research tasks: First, we introduce a set of domain-independent, algebraic operators, which address all fundamental tasks in IE and web text analytics (WA) and which can be used to express complex IE tasks in form of queries inside the declarative data flow language Meteor. Such queries are parsed into algebraic data flows, which are logically and physically optimized, translated into parallel data flow programs, and executed with the parallel processing system Stratosphere. We characterize all operators with physical, algebraic, and runtime properties to highlight both the potential and importance of optimizing the execution order nonrelational, user-defined data flow operators (UDFs). Second, we survey the state-of-theart in optimization techniques for data flows with UDFs, which are applied at different stages of the optimization process in parallel data analytics systems. We provide a comprehensive overview on declarative data flow languages for parallel data analytics systems from the perspective of their build-in optimization techniques and conclude that comprehensive optimization of UDFs and non-relational operators still is a true challenge for many systems. Third, we introduce a semantics-aware and extensible logical optimizer for data flows with UDFs based on this observation. Our optimizer builds on a concise set of properties for describing the UDF’s semantics and combines automated analysis of UDFs with manual annotations to enable comprehensive data flow optimization. We show that our approach is capable of reordering data flows of arbitrary shape from different application domains, leading to considerable runtime improvements and clearly outperforming plans found by other techniques. Fourth, we study the real-life applicability of our system to Terabyte-scale text collections in a challenging setting to compare the \"web view\" on health-related topics with that derived from a controlled scientific corpus. We systematically evaluate scalability, quality, and robustness of the employed methods and tools and also pinpoint the most critical challenges in building such a system.", "venue": "", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2017-07-06", "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "1924232", "name": "Astrid Rheinländer"}], "citations": []}
