{"paperId": "9c113ed503de68c6cae256dc250170ab4a39b7fe", "publicationVenue": null, "title": "A neural network expert system that allows assessing the quality of the algorithm for choosing the parameters of optimal removal of low-frequency noise from seismograms using the fingerprint method", "abstract": "The article summarizes the results of research on the application of the fingerprint method in seismology. This method can be successfully used in solving various practical problems. We have used it as an effective tool for a thorough analysis of noisy seismograms of regional explosions and earthquakes in order to select the optimal filtering frequency. The cut-off frequency selected with the help of fingerprints will allow you to design an optimal filter that not only reliably suppresses low-frequency noise, but also carefully preserves the signal it hides. Moreover, the method works well when the noise intensity exceeds the signal intensity many times over and under conditions of partial overlap of their frequency ranges. Fundamental is the initial orientation of the method towards automatic implementation with minimal use of additional information. In conclusion, this article proposes to use a neural network expert system that allows you to evaluate the quality of the fingerprint algorithm. To create such a system, we needed to explore current trends in seismology regarding the use of artificial neural networks. Based on extensive worldwide experience, it has been shown that there is a clear renewed interest in the use of small, lowcost networks. The principle on which they are based lies in their perception as training and input data of compact, complexly structured parameters of a high degree of transformation of primary seismograms. It is these parameters that include the characteristics taken from fingerprints using the algorithms we propose. So our experience in creating a neural network expert system naturally turned out to be successful. The reliability of the estimates obtained turned out to be very close to the practical limit of the fingerprint method.", "venue": "Russian Journal of Seismology", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-26", "journal": {"name": "Russian Journal of Seismology"}, "authors": [{"authorId": "108245877", "name": "K. Silkin"}], "citations": []}
