{"paperId": "9c1bf627171b80ec194c28b15cccece42774fc36", "publicationVenue": {"id": "589ed020-784b-47ac-884d-9c6ae29fd509", "name": "International Conference Intelligent Computing and Control Systems", "type": "conference", "alternate_names": ["ICICCS", "Int Conf Intell Comput Control Syst"]}, "title": "Security threats and solutions to IoT using Blockchain: A Review", "abstract": "Internet of Things (IoT) is an emerging technology and have a global network of “things” that can be physical as well as virtual that is connected to the internet. IoT has so many applications as it is used in industry, smart homes, smart health care, smart irrigation and in many more places. Storing huge information that is generated from the sensors are major issues. Devices of IoT are dynamic, resource constraints, having less processing power which creates major security and privacy issues. Major challenges include identification, authentication, scalability, and data security. This paper is mainly focused on major security and privacy issues of IoT at different layers of IoT architecture. To solve these issues, this paper proposes Blockchain as a Solution. The integration of blockchain with IoT can be used to secure the IoT system. Blockchain is a chain of blocks and each block contains a number of transactions, that records event and maintains consistent records of data. It is having the potential to solve the issues faced by IoT. But because of the different nature of IoT and Blockchain it suffers from many limitations as well. This paper pointed out the challenges of the integration of blockchain with IoT along with some open issues are discussed which provides a ground for future research direction.", "venue": "International Conference Intelligent Computing and Control Systems", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Conference", "Review"], "publicationDate": "2021-05-06", "journal": {"name": "2021 5th International Conference on Intelligent Computing and Control Systems (ICICCS)", "pages": "268-273"}, "authors": [{"authorId": "2105732420", "name": "Shireen Rafat Alam"}, {"authorId": "51261622", "name": "Saurabh Jain"}, {"authorId": "3010152", "name": "Rajesh Doriya"}], "citations": [{"paperId": "871773e9a16d5d7087dc7356a35c44921f4c17c0", "title": "A Survey on Exploring the Effectiveness of IOT Based Home Security Systems"}, {"paperId": "f499b733d818be65e7e709afae29e75b1e7527ac", "title": "Smart Home Gateway Based on Integration of Deep Reinforcement Learning and Blockchain Framework"}, {"paperId": "82f8d62a1ce907c01dda2bfb87ef3b2fc83255f7", "title": "Improving IoT Security Using Elliptic Curve Integrated Encryption Scheme with Primary Structure-Based Block Chain Technology"}]}
