{"paperId": "9c1b979b8ba820a712e3198f5cede008a89acbbd", "publicationVenue": null, "title": "On the Potential of Execution Traces for Batch Processing Workload Optimization in Public Clouds", "abstract": "With the growing amount of data, data processing workloads and the management of their resource usage becomes increasingly important. Since managing a dedicated infrastructure is in many situations infeasible or uneconomical, users progressively execute their respective workloads in the cloud. As the configuration of workloads and resources is often challenging, various methods have been proposed that either quickly profile towards a good configuration or determine one based on data from previous runs. Still, performance data to train such methods is often lacking and must be costly collected.In this paper, we propose a collaborative approach for sharing anonymized workload execution traces among users, mining them for general patterns, and exploiting clusters of historical workloads for future optimizations. We evaluate our prototype implementation for mining workload execution graphs on a publicly available trace dataset and demonstrate the predictive value of workload clusters determined through traces only.", "venue": "2021 IEEE International Conference on Big Data (Big Data)", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-11-16", "journal": {"name": "2021 IEEE International Conference on Big Data (Big Data)", "pages": "3113-3118"}, "authors": [{"authorId": "2051551482", "name": "Dominik Scheinert"}, {"authorId": "2141030557", "name": "Alireza Alamgiralem"}, {"authorId": "2062906007", "name": "Jonathan Bader"}, {"authorId": "153294591", "name": "Jonathan Will"}, {"authorId": "1796288253", "name": "Thorsten Wittkopp"}, {"authorId": "2294791", "name": "L. Thamsen"}], "citations": [{"paperId": "35eec46b3e98391d64b75a510d69d5bb302202a9", "title": "Privacy-Preserving Sharing of Data Analytics Runtime Metrics for Performance Modeling"}, {"paperId": "7fbb73f3e61ed9ab1f18d0290082729a46ca36cd", "title": "Towards a Peer-to-Peer Data Distribution Layer for Efficient and Collaborative Resource Optimization of Distributed Dataflow Applications"}, {"paperId": "742b3ede9a93f166e695ebedfc1bb060b60457ff", "title": "Selecting Efficient Cluster Resources for Data Analytics: When and How to Allocate for In-Memory Processing?"}, {"paperId": "9a12d3e4ff66d59e594241e46abc213dd529088a", "title": "ReAssigner: A Plug-and-Play Virtual Machine Scheduling Intensifier for Heterogeneous Requests"}, {"paperId": "23a6e0bd5ef9e9deeb0b939b1521b97dc54a0707", "title": "Ruya: Memory-Aware Iterative Optimization of Cluster Configurations for Big Data Processing"}, {"paperId": "7d434537cce3fd903e1ba09e694895fbe3628cbc", "title": "Get Your Memory Right: The Crispy Resource Allocation Assistant for Large-Scale Data Processing"}, {"paperId": "38511a8a8d6ca24c4676c954fb05d578e444ec46", "title": "Collaborative Cluster Configuration for Distributed Data-Parallel Processing: A Research Overview"}, {"paperId": "fb345bbf62380e6cabbc358d7511d19b62566692", "title": "Lotaru: Locally Estimating Runtimes of Scientific Workflow Tasks in Heterogeneous Clusters"}, {"paperId": "b48a29b46994c409406ad9eb609e5b0f3d4b1edc", "title": "Training Data Reduction for Performance Models of Data Analytics Jobs in the Cloud"}]}
