{"paperId": "9c38d9f7db9c606384c122fe66c193aec399c0d1", "publicationVenue": null, "title": "Uso de big data e implementação do processo de EDA: um case de dados climáticos para gestão de agricultura", "abstract": "Com o surgimento da IoT, dispositivos com diversos sensores tem a habilidade de comunicar-se com outros dispositivos ou objetos, resultando em um grande volume de dados – isso trouxe a necessidade de solucoes de     tecnologia da informacao focadas no desempenho de armazenamento, consultas e, posteriormente, analises complexas: Big Data. A area de gestao de agricultura e um exemplo importante dessa nova realidade. Em face ao exposto, este trabalho tem como objetivo propor a infraestrutura para Big Data para a captura e armazenamento de dados meteorologicos bem como aplicacao, em termos de software, do processo de EDA, a fim de preparar tal contexto para futuras analises em Data Science. Tais analises podem permitir a obtencao de conhecimentos cientificos e insights de oportunidades em diferentes campos de negocios, em particular, na gestao da agricultura digital. Para atingir o objetivo deste trabalho, na primeira etapa, foi proposta uma infraestrutura de Big Data bem como dos sensores mais viaveis para uma futura implementacao em termos de hardware. Na segunda etapa foi feita a implementacao da infraestrutura para Big Data em termos de software bem como a aplicacao do processo de EDA para fins de captura e armazenamento de dados meteorologicos. Por fim, percebeu-se que o prototipo proposto e viavel para a aplicacao do processo de EDA com dados meteorologicos. Apos toda a extracao de dados e EDA, os dados foram armazenados para analises futuras. Entende-se, por fim, que os dados armazenados podem de fato contribuir para a gestao da agricultura.", "venue": "", "year": 2020, "fieldsOfStudy": ["Physics"], "publicationTypes": null, "publicationDate": "2020-09-29", "journal": {"name": "", "pages": "182-202", "volume": "4"}, "authors": [{"authorId": "2004542658", "name": "Anderson Henrique Potye Paula"}, {"authorId": "1665755249", "name": "J. Duque"}], "citations": []}
