{"paperId": "9c385ad7f0539a012466c95d9cc115340d160145", "publicationVenue": {"id": "12cf261e-f151-4062-8f3d-93679fa07009", "name": "Advanced Energy Materials", "type": "journal", "alternate_names": ["Adv Energy Mater"], "issn": "1614-6832", "url": "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1614-6840", "alternate_urls": ["https://onlinelibrary.wiley.com/page/journal/16146840/homepage/productinformation.html"]}, "title": "Self‐Powered Embedded‐Sensory Adjustment for Flow Batteries", "abstract": "Flow batteries (FBs) are one of the most promising strategies for large-scale energy storage, in which the ﬂow rates of electrolytes are critical to the redox reaction eﬃciency. However, low-power and energy-eﬃcient strategies to eﬀectively monitor and adjust the ﬂow rates of FBs are great challenges. Here, a liquid metal based thin-ﬁlm and self-powered triboelectric sensor (LM-TS) to monitor and adjust the real-time electrolyte ﬂow rates in FBs is developed. By integrating the LM-TS with a peristaltic pump (ﬂow rate control unit in FB), the ﬂow rates of electrolytes can be converted into readable electrical output signals. Furthermore, a logical and a control module are adopted to adjust the ﬂow rates of electrolytes automatically after receiving those electrical signals, which are available to guarantee the optimal working condition of FBs. Beneﬁting from the high conductivity and outstanding ductility of ultrathin LM ﬁlm, the self-powered LM-TS is endowed with high sensitivity, short response time (9.1 ms), and remarkable cyclic stability ( > 20000 cycles) without aﬀecting the normal operation of FBs. This is the ﬁrst prototype of self-powered adjustment sensor for FBs, which is readily extended to scaled-up FB equipment for intermediate trial and large-scale energy-storage demonstration.", "venue": "Advanced Energy Materials", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-13", "journal": {"name": "Advanced Energy Materials"}, "authors": [{"authorId": "2115569233", "name": "Yifei Wang"}, {"authorId": "1884785578", "name": "Zhizhao Xu"}, {"authorId": "2181177716", "name": "Ran Cao"}, {"authorId": "2112721054", "name": "Yao Xiong"}, {"authorId": "1477935142", "name": "Jiahong Yang"}, {"authorId": "47869874", "name": "Yanqiang Lei"}, {"authorId": "3554173", "name": "Mei Ding"}, {"authorId": "3604008", "name": "Chuankun Jia"}, {"authorId": "2145029518", "name": "Zhongqiang Wang"}, {"authorId": "14459723", "name": "Qijun Sun"}], "citations": [{"paperId": "fa01e517f7823e4b7b361861d15a303c27f2a6e7", "title": "Pursuing Superhydrophobic Flexible Strain Sensors: From Design to Applications"}, {"paperId": "e3a26ebf0e02d609636d9b63555d4658e555e1c8", "title": "Broad detection range of flexible capacitive sensor with 3D printed interwoven hollow dual-structured dielectric layer"}, {"paperId": "5e50195c91f6cd5a0d3e6bf2a9fa1cfbae4caa35", "title": "Tribotronic Vertical Field‐Effect Transistor Based on van der Waals Heterostructures"}, {"paperId": "4732c8a767c575f35399bdd4e868409f4242158f", "title": "Liquid metal-based triboelectric nanogenerators for energy harvesting and emerging applications"}]}
