{"paperId": "9c4537b203113177c1ee4e3661fa0e6604c1e3fd", "publicationVenue": {"id": "9ec189b3-db0f-41d8-9c82-21ef5fa9b87e", "name": "Frontiers in Genetics", "type": "journal", "alternate_names": ["Front Genet"], "issn": "1664-8021", "url": "http://www.frontiersin.org/genetics/", "alternate_urls": ["http://journal.frontiersin.org/journal/genetics", "https://www.frontiersin.org/journals/genetics"]}, "title": "Network Biology Approaches to Achieve Precision Medicine in Inflammatory Bowel Disease", "abstract": "Inflammatory bowel disease (IBD) is a chronic immune-mediated condition arising due to complex interactions between multiple genetic and environmental factors. Despite recent advances, the pathogenesis of the condition is not fully understood and patients still experience suboptimal clinical outcomes. Over the past few years, investigators are increasingly capturing multi-omics data from patient cohorts to better characterise the disease. However, reaching clinically translatable endpoints from these complex multi-omics datasets is an arduous task. Network biology, a branch of systems biology that utilises mathematical graph theory to represent, integrate and analyse biological data through networks, will be key to addressing this challenge. In this narrative review, we provide an overview of various types of network biology approaches that have been utilised in IBD including protein-protein interaction networks, metabolic networks, gene regulatory networks and gene co-expression networks. We also include examples of multi-layered networks that have combined various network types to gain deeper insights into IBD pathogenesis. Finally, we discuss the need to incorporate other data sources including metabolomic, histopathological, and high-quality clinical meta-data. Together with more robust network data integration and analysis frameworks, such efforts have the potential to realise the key goal of precision medicine in IBD.", "venue": "Frontiers in Genetics", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2021-10-21", "journal": {"name": "Frontiers in Genetics", "volume": "12"}, "authors": [{"authorId": "103166491", "name": "John P. Thomas"}, {"authorId": "2723353", "name": "D. Módos"}, {"authorId": "2961601", "name": "T. Korcsmáros"}, {"authorId": "2120949179", "name": "J. Brooks-Warburton"}], "citations": [{"paperId": "f61a9bab919928c25c8e9e081458c7ba03037b9f", "title": "A personalized pathway activation inference method based on pathway structure for classification of inflammatory bowel disease"}, {"paperId": "e85dfbaf5f4af34d0b7a0b0ab43eeb1df327d472", "title": "Omics and Multi-Omics in IBD: No Integration, No Breakthroughs"}, {"paperId": "93735433bad7d27eab7b0d6ad73cfcc4927a94b1", "title": "Systems Biology and Cytokines Potential Role in Lung Cancer Immunotherapy Targeting Autophagic Axis"}, {"paperId": "a0b1baa9056ce91d0ad74eeccaa373c6f6b955dc", "title": "Integration and implementation of precision medicine in the multifaceted inflammatory bowel disease"}, {"paperId": "41733bf49ad7982290dc790ab9e9580d17577c16", "title": "Research hotspot and trend analysis in the diagnosis of inflammatory bowel disease: A machine learning bibliometric analysis from 2012 to 2021"}, {"paperId": "b814aaf7c9f1fda129e5791545e0108c3d77d20f", "title": "A systems genomics approach to uncover patient-specific pathogenic pathways and proteins in ulcerative colitis"}, {"paperId": "69a89b21240dac1f052ad6a5789377d30ada41f9", "title": "Systems Biology in Periodontitis"}, {"paperId": "7fc1732a5127257b85170bfa05ee63a6ccf9b2a5", "title": "An overview of technologies for MS-based proteomics-centric multi-omics"}, {"paperId": "a50f1eee7ff47b9448f358b4d419fa5947debb60", "title": "Analysing miRNA-Target Gene Networks in Inflammatory Bowel Disease and Other Complex Diseases Using Transcriptomic Data"}, {"paperId": "624af0398789300c1ebecd062ebeb3415696010c", "title": "World Journal of Gastroenterology"}]}
