{"paperId": "9c53d776d5742bdca24d1c692f96f1be48dd6793", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Resource Management in Converged Optical and Millimeter Wave Radio Networks: A Review", "abstract": "Three convergent processes are likely to shape the future of the internet beyond-5G: The convergence of optical and millimeter wave radio networks to boost mobile internet capacity, the convergence of machine learning solutions and communication technologies, and the convergence of virtualized and programmable network management mechanisms towards fully integrated autonomic network resource management. The integration of network virtualization technologies creates the incentive to customize and dynamically manage the resources of a network, making network functions, and storage capabilities at the edge key resources similar to the available bandwidth in network communication channels. Aiming to understand the relationship between resource management, virtualization, and the dense 5G access and fronthaul with an emphasis on converged radio and optical communications, this article presents a review of how resource management solutions have dealt with optimizing millimeter wave radio and optical resources from an autonomic network management perspective. A research agenda is also proposed by identifying current state-of-the-art solutions and the need to shift all the convergent issues towards building an advanced resource management mechanism for beyond-5G.", "venue": "Applied Sciences", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2021-12-27", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "2745956", "name": "Doruk Şahinel"}, {"authorId": "2088361", "name": "S. Rommel"}, {"authorId": "1757931", "name": "I. Monroy"}], "citations": [{"paperId": "663da7f7f880739ec73364b20672e988f45d2145", "title": "Network traffic reduction with spatially flexible optical networks using machine learning techniques"}, {"paperId": "d99fe377622f0b2153845c833ede6cf9c690e450", "title": "Transceiver Optimization for mmWave Line-of-Sight MIMO Systems Using Hybrid Arrays"}, {"paperId": "3fa550dd6cefd04b0ead1471c4e2621a9bd804f1", "title": "Artificial intelligence analysis in cyber domain: A review"}]}
