{"paperId": "9c628c49d97733895d48287f82c90442d2f7577a", "publicationVenue": {"id": "f3358047-5fa1-4315-9473-4bb4c19cb756", "name": "International Journal of Bifurcation and Chaos in Applied Sciences and Engineering", "type": "journal", "alternate_names": ["Int J Bifurc Chaos", "Int J Bifurc Chaos Appl Sci Eng", "International Journal of Bifurcation and Chaos"], "issn": "0218-1274", "url": "http://www.worldscinet.com/ijbc/ijbc.shtml", "alternate_urls": ["http://www.worldscinet.com/ijbc/mkt/archive.shtml"]}, "title": "A New Memristive System with Extreme Multistability and Hidden Chaotic Attractors and with Application to Image Encryption", "abstract": "Chaotic systems have proven highly beneficial in engineering applications. Pseudo-random numbers produced by chaotic systems have been used for secure communication, notably image encryption. Specific characteristics can increase the chaotic behavior of the system by adding complexity and nonlinearity. The three most well-known characteristics are memristive properties, multistability (coexisting attractors), and hidden attractors. These characteristics strengthen the produced time series’ unpredictability and randomness, strengthening an encryption algorithm’s resistance to many attacks. This study introduces a unique four-dimensional chaotic system with extreme multistability with respect to three initial conditions (including the memristor initial condition) and all previously known properties. It is rare to find an extreme multistable system like this. This system is coupled with a quadratic flux-controlled memristor based on the well-known Sprott J system. This system has a line of unstable equilibrium points with hidden attractors. The memristor displays the characteristic pinched hysteresis loops, where the area inside a loop and the voltage frequency are inversely related. A comprehensive dynamical analysis thoroughly examines all system characteristics and initial conditions. The numerical findings are carefully verified, and an analog circuit is successfully built and simulated. The chaotic sequences generated by this system are combined with deoxyribonucleic acid (DNA) operations and the global bit scrambling (GBS) technique to create an image encryption algorithm that has strong resistance to a variety of potential attacks, including noise, statistical, exhaustive, differential, and cropping attacks.", "venue": "International Journal of Bifurcation and Chaos in Applied Sciences and Engineering", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-01-01", "journal": {"name": "Int. J. Bifurc. Chaos", "pages": "2450010:1-2450010:25", "volume": "34"}, "authors": [{"authorId": "2283523162", "name": "Guangzhe Zhao"}, {"authorId": "2283437507", "name": "He Zhao"}, {"authorId": "2283357552", "name": "Yunzhen Zhang"}, {"authorId": "2283360951", "name": "Xinlei An"}], "citations": []}
