{"paperId": "9c6585655fec6cb65f711f95b390f1f40c272126", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "A Trust Management Model for IoT Devices and Services Based on the Multi-Criteria Decision-Making Approach and Deep Long Short-Term Memory Technique", "abstract": "Recently, Internet of Things (IoT) technology has emerged in many aspects of life, such as transportation, healthcare, and even education. IoT technology incorporates several tasks to achieve the goals for which it was developed through smart services. These services are intelligent activities that allow devices to interact with the physical world to provide suitable services to users anytime and anywhere. However, the remarkable advancement of this technology has increased the number and the mechanisms of attacks. Attackers often take advantage of the IoTs’ heterogeneity to cause trust problems and manipulate the behavior to delude devices’ reliability and the service provided through it. Consequently, trust is one of the security challenges that threatens IoT smart services. Trust management techniques have been widely used to identify untrusted behavior and isolate untrusted objects over the past few years. However, these techniques still have many limitations like ineffectiveness when dealing with a large amount of data and continuously changing behaviors. Therefore, this paper proposes a model for trust management in IoT devices and services based on the simple multi-attribute rating technique (SMART) and long short-term memory (LSTM) algorithm. The SMART is used for calculating the trust value, while LSTM is used for identifying changes in the behavior based on the trust threshold. The effectiveness of the proposed model is evaluated using accuracy, loss rate, precision, recall, and F-measure on different data samples with different sizes. Comparisons with existing deep learning and machine learning models show superior performance with a different number of iterations. With 100 iterations, the proposed model achieved 99.87% and 99.76% of accuracy and F-measure, respectively.", "venue": "Italian National Conference on Sensors", "year": 2022, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-01-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "22"}, "authors": [{"authorId": "2003577195", "name": "Yara Alghofaili"}, {"authorId": "35505984", "name": "Murad A. Rassam"}], "citations": [{"paperId": "72d4828a060f7ae0b86759a5f6e4db9cf4734c65", "title": "A Distrust Model to Detect Faulty Sensor in an IOT Network"}, {"paperId": "8814242650c6568cb4f4983e7dd937fd99eaf419", "title": "Multi-Network Latency Prediction for IoT and WSNs"}, {"paperId": "d86fda68e874868bbbc0389c4781eb9a0dc0f6b3", "title": "A Comprehensive Review of Multiple Criteria Decision-Making (MCDM) Methods: Advancements, Applications, and Future Directions"}, {"paperId": "3bbc9ad923cda38fe387099eb814bd232f3051ea", "title": "A multi-dimensional trust attestation solution in 5G-IoT"}, {"paperId": "fac4b3c61bc9c19472b112c7c207eaa09f8803f7", "title": "Trusted Federated Learning Framework for Attack Detection in Edge Industrial Internet of Things"}, {"paperId": "f92c889acf48e40fa8a44f61ad560e2a871511ae", "title": "Multi-Attribute Decision Making-based Trust Score Calculation in Trust Management in IoT"}, {"paperId": "8da26c7eb578c04f6fe9c40a54dced647ac608d2", "title": "Research on the security design of industrial control mobile terminal based on trusted software base"}, {"paperId": "b0675ae65c6677fc053968bb54e6151842bbb8a8", "title": "Reimagining multi-criterion decision making by data-driven methods based on machine learning: A literature review"}, {"paperId": "d3f87266ab01117f01404c8ccf507898733aca54", "title": "An efficient trust-based decision-making approach for WSNs: Machine learning oriented approach"}, {"paperId": "f152cec84d84f6ad78b46feeb013b37654dca536", "title": "Edge Intelligence for Real-Time IoT Service Trust Prediction"}, {"paperId": "457dbaeff4795d4d78646f607f78e52b02bb4b73", "title": "Detecting and Preventing for Performance Assessment of IoT Devices Under Dodag Information Solicitation (dis) Attacks"}, {"paperId": "3995c3b843d7b297a8ece311c60d8c7c98686dc1", "title": "An Analysis Of Anomaly Detection Techniques for IoT Devices: A Review"}, {"paperId": "a56f54edb4e11db93128bb21ff0a96d091759c18", "title": "IOT-BASED cyber security identification model through machine learning technique"}, {"paperId": "396621196428be934da146916476c0eefc60da64", "title": "A detailed study on trust management techniques for security and privacy in IoT: Challenges, trends, and research directions"}, {"paperId": "6cbb2687683aabd4ec0ecf7c369b2642f9704d4a", "title": "A Dynamic Trust-Related Attack Detection Model for IoT Devices and Services Based on the Deep Long Short-Term Memory Technique"}, {"paperId": "e60040ce2dcc3a1d968147485276aff4d8ad6403", "title": "IoT trust and reputation: a survey and taxonomy"}, {"paperId": "742d206b5d7580b4cfbdecbd16f3c6205862a5f3", "title": "A Comprehensive Literature Survey of Cryptography Algorithms for Improving the IoT Security"}, {"paperId": "b9b2275ecb36e12177b184cc82eaeddadea8eadd", "title": "A Decentralized Trust Establishment Protocol for Smart IoT Systems"}, {"paperId": "ff120ab1b94ec70b3f6495d64aea6af62932838f", "title": "Time series analysis and anomaly detection for trustworthy smart homes"}, {"paperId": "98064b9ce0c29a4a4943fd80d16018c99ab77f87", "title": "Bipolar Fuzzy PROMETHEE‐based Decision‐Making Trust Model for guaranteeing data dissemination reliability in Internet of Things"}, {"paperId": "35a2d5110f67ce65f5c4ed3cbec7e09acc77f880", "title": "Trust management for service migration in Multi-access Edge Computing environments"}, {"paperId": "1cdb671999cbb486f4eb75a03604b53909e32ba6", "title": "ShareTrust: Centralized trust management mechanism for trustworthy resource sharing in industrial Internet of Things"}, {"paperId": "20d4787af15e7b02670e798a450b526b14573c1a", "title": "Utilising Acknowledge for the Trust in Wireless Sensor Networks"}]}
