{"paperId": "9c713bf42d9cd4aa57b1a09b2e60e7405d8ed43d", "publicationVenue": {"id": "770f1d88-52c2-43dc-a897-6881e70b2f32", "name": "International Conference on Data Science and Advanced Analytics", "type": "conference", "alternate_names": ["Int Conf Data Sci Adv Anal", "IEEE International Conference on Data Science and Advanced Analytics", "IEEE Int Conf Data Sci Adv Anal", "DSAA"]}, "title": "To Personalize or Not To Personalize? Soft Personalization and the Ethics of ML for Health", "abstract": "Personalization is among the most promising outcomes of using Machine Learning models that can be trained on data representing a specific individual. Personalization is particularly promising in areas such as health and medicine, as several crucial aspects and determinants of health are individual. Yet additional ethical issues arise with increasingly personalized models, including privacy, acceptability, reliability and trade-offs. In this paper we discuss and propose ML models for health that can be personalized on individual users, while guaranteeing both their privacy and quality from an ethical and epistemic (knowledge-related) point of view. To achieve these goals, we argue that we need to control the learning and evolution of personalized models. We propose soft personalization as an ethically-informed framework to limit personalization and respect epistemic and ethical values that are specific for the health context, including representativity, quality, non-maleficence, beneficence, privacy. Based on an interdisciplinary approach combining the philosophical and computer science scholarship of our group, soft personalization is a way of developing different models that can be selected depending on their quality and safety. We characterize the approach theoretically and technically and make it concrete with a case study of glucose monitoring and anomaly detection through privacy-preserving ML. Our framework shows that, even when individual issues such as privacy can be mitigated, tradeoffs with other values remain and choices are necessary as to which values should be prioritized.", "venue": "International Conference on Data Science and Advanced Analytics", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-10-09", "journal": {"name": "2023 IEEE 10th International Conference on Data Science and Advanced Analytics (DSAA)", "pages": "1-10"}, "authors": [{"authorId": "119796696", "name": "Alessandro Falcetta"}, {"authorId": "2186556053", "name": "Massimo Pavan"}, {"authorId": "2265677732", "name": "Stefano Canali"}, {"authorId": "2226297", "name": "V. Schiaffonati"}, {"authorId": "2265680067", "name": "Manuel Roveri"}], "citations": []}
