{"paperId": "9c73476389940e8918a92f336c340ab6759062ce", "publicationVenue": {"id": "1b767051-ba1f-457e-bd23-1b483c7029c7", "name": "E3S Web of Conferences", "alternate_names": ["E3S Web Conf"], "issn": "2267-1242", "url": "https://web.archive.org/web/*/http:/www.e3s-conferences.org/", "alternate_urls": ["https://www.e3s-conferences.org/"]}, "title": "Complex for reception and real time processing of remote sensing data", "abstract": "The basic problems and trends in the development of modern systems for the reception, storage and real-time processing of satellite data are considered. Abrupt increase in the capability of satellite systems, significant increase in the amount of satellite information and its availability, the development of data processing and presentation technologies, and the use of web technologies are discussed. Data sources of modern remote sensing systems of the Earth and the features of their practical use are considered. It is concluded that the most effective way to obtain real-time information from meteorological satellites are satellite stations that receive data in the X-band at a frequency of 8 GHz. The performance characteristics and capabilities of the equipment of the new satellite receiving complex at Krasnoyarsk Science Center are given. Use of up-to-date computer equipment (high-performance servers and storage systems, local area network with a bandwidth of 10 Gbit/s) and logical separation into the stages of data conversion (data reception, primary and thematic processing) provide the construction of a modern scalable data-processing system for remote sensing data. The paper presents the results of the work on creation of specialized software for information and analytical systems for real-time satellite monitoring.", "venue": "E3S Web of Conferences", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": null, "journal": {"name": "E3S Web of Conferences"}, "authors": [{"authorId": "71829529", "name": "O. Yakubailik"}, {"authorId": "1581834168", "name": "V. Romas'ko"}, {"authorId": "81092953", "name": "E. Pavlichenko"}], "citations": [{"paperId": "05bcfa10a6f6594cbbd86cc5724631483c60b788", "title": "Experience in creating a centralized remote sensing data catalog \nfrom Russian satellites"}, {"paperId": "4c55f73346742ad83b4b1c030d21bddfdc46adf5", "title": "DETECTION AND MONITORING OF POTENTIALLY DANGEROUS FIRES ON THE TERRITORY OF UKRAINE USING THE DATA OF SATELLITE SCANNING"}, {"paperId": "69b7d3614c9451a3793c9e9de5b67d4cd97ffc17", "title": "Wildfires and the spread of smoke from forest fires in the Krasnoyarsk territory in summer 2019"}, {"paperId": "943d3a0124f9ad2e542aeebe4589754c2bf05226", "title": "Information and computing maintenance for the regional satellite operational monitoring system"}, {"paperId": "58f78483637cd6d1a5450bfa041f4a27d6866c54", "title": "Technologies and software for the regional catalog of Russian spacecraft satellite data"}, {"paperId": "3c1325c1a7c746add4a9d67c426cea611805988c", "title": "Hadoop Paradigm for Satellite Environmental Big Data Processing"}, {"paperId": "3cb60a75ab1269a168f17ff138b9f949a86ef937", "title": "The System of Operational Processing of Satellite Remote Sensing Data in Krasnoyarsk Science Center of Russian Academy of Sciences"}]}
