{"paperId": "9c79e2704ad72c8665e1d60e11e028903ca71a87", "publicationVenue": {"id": "f2c78b1b-6bcc-4700-859b-af9401c02941", "name": "Buildings", "type": "journal", "issn": "0007-3725", "alternate_issns": ["2075-5309"], "url": "https://www.buildings.com/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217973", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217973", "https://www.mdpi.com/journal/buildings"]}, "title": "Eco-Friendly Technology Derivation and Planning for Rooftop Greenhouse Smart Farm", "abstract": "Rooftop greenhouse-type smart farms are a promising solution to the climate and food crises because they can utilize waste heat and CO2 from buildings for plant growth and supply fresh produce to urban areas at a low price. However, legal and structural constraints make it difficult to expand existing rooftops to accommodate smart farms, and standardized glass greenhouses are often installed as is, which may not be the most efficient or eco-friendly approach. The purpose of this study is to present a plan for integrating eco-friendly technologies between buildings and smart farms. In the study, 214 eco-friendly and smart farm cases were collected, and a database was built from the perspective of the environment and eco-friendly technology for plant growth. Thirty experts from architects, professors, and greenhouse installation companies were evaluated to determine which eco-friendly technologies can be applied to smart farms. From a building integration perspective, eco-friendly technologies applicable to smart farms were derived from a plant growth perspective. Based on the derived eco-friendly elements, it can be used in planning a rooftop greenhouse-type smart farm.", "venue": "Buildings", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-02-01", "journal": {"name": "Buildings"}, "authors": [{"authorId": "2282702204", "name": "Jieun Lee"}, {"authorId": "2282681592", "name": "Eunteak Lim"}, {"authorId": "98808980", "name": "Nahyang Byun"}, {"authorId": "97942327", "name": "D. Shon"}], "citations": []}
