{"paperId": "9c7a67de81e055a60a76d6d753353867eb758634", "publicationVenue": {"id": "26f4faa2-1fc1-423d-bd5c-3a08fcadb65a", "name": "International Journal of Image and Data Fusion", "type": "journal", "alternate_names": ["Int J Image Data Fusion"], "issn": "1947-9832", "url": "http://www.informaworld.com/tidf", "alternate_urls": ["http://www.tandfonline.com/loi/.U6wHqBBZ7mg", "http://www.tandfonline.com/loi/tidf20"]}, "title": "Chinese address standardisation of POIs based on GRU and spatial correlation and applied in multi-source emergency events fusion", "abstract": "ABSTRACT A large number of users’ microblogs and various Points of Interest (POIs) of public service facilities in social media provide abundant data resources for the emergency events detection, fusion analysis and post-incident rescue. With the correlation analysis of these complex data resources based on the address information or location, people can instantly understand, rescue and make decisions for emergency events. This paper aims to propose an unsupervised method of multi-source POIs addresses segmentation and standardisation based on the Gated Recurrent Unit (GRU) neural network and spatial correlation. First, we use GRU neural network to automatically segment Chinese POIs addresses. Then, according to the spatial correlation between address elements, we can remove incorrect address elements, and construct a hierarchy address element map with the semantic relationship. Finally, the addresses of POIs or emergency events will be standardised by fuzzy matching, which uses the multi-source emergency events fusion of the first step. The propsed method is verified to a relatively high accuracy rate of address segment and standardisation, and it can be applied for the emergency event fusion and spatio-temporal analysis from multi-social media sites.", "venue": "International Journal of Image and Data Fusion", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-08-10", "journal": {"name": "International Journal of Image and Data Fusion", "pages": "319 - 334", "volume": "12"}, "authors": [{"authorId": "1843953", "name": "An Luo"}, {"authorId": "114462308", "name": "Jiping Liu"}, {"authorId": "2144890902", "name": "Pengpeng Li"}, {"authorId": "2153953468", "name": "Yong Wang"}, {"authorId": "47411439", "name": "Shenghua Xu"}], "citations": [{"paperId": "b3976531936e5b4c5e8db4e5d2ed60f2d254c95a", "title": "Deep learning in statistical downscaling for deriving high spatial resolution gridded meteorological data: A systematic review"}, {"paperId": "50dab98c7afd6d6038a20b04caec66ba92445eb8", "title": "Deep Learning Based Improvement in Overseas Manufacturer Address Quality Using Administrative District Data"}, {"paperId": "df76df8afcc82f5499718377ce24586f587b8b96", "title": "Deep Transfer Learning Model for Semantic Address Matching"}, {"paperId": "88a0bae45c8d2bb076cd45d718f2f6751c1cc515", "title": "Automatic Identification of Addresses: A Systematic Literature Review"}]}
