{"paperId": "9c939b6d9565b0219986650ef347dc41ac43972b", "publicationVenue": {"id": "42cd70f7-45f1-4f5a-9723-42d222d6c56e", "name": "IEEE transactions on computers", "type": "journal", "alternate_names": ["IEEE Transactions on Computers", "IEEE Trans Comput", "IEEE trans comput"], "issn": "0018-9340", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=12", "alternate_urls": ["http://www.computer.org/portal/web/tc"]}, "title": "SLA-Based Scheduling of Spark Jobs in Hybrid Cloud Computing Environments", "abstract": "Big data frameworks such as Apache Spark is becoming prominent to perform large-scale data analytics jobs in various domains. However, due to limited resource availability, the local or on-premise computing resources are often not sufficient to run these jobs. Therefore, public cloud resources can be hired on a pay-per-use basis from the cloud service providers to deploy a Spark cluster entirely on the cloud. Nevertheless, using only cloud resources can be costly. Hence, both local and cloud resources nowadays are used together to deploy a hybrid cloud computing cluster. However, scheduling jobs in a cluster deployed on hybrid clouds is challenging in the presence of various Service-Level Agreement (SLA) demands such as cost minimization and job deadline guarantee. Most of the existing works either consider a public or a locally deployed cluster and mainly focus on improving job performance in the cluster. In this article, we propose efficient scheduling algorithms that leverage from different VM instance pricing in a hybrid cloud deployed cluster to optimize the Virtual Machine (VM) usage cost for both local and cloud resources and maximize the job deadline met percentage. We have conducted extensive simulation-based experiments to compare our proposed algorithms with the baseline approaches. In addition, we have developed a prototype system on top of Apache Mesos cluster manager and performed real experiments to evaluate the applicability of our proposed approaches in a real platform with benchmark applications. The results show that our proposed algorithms are highly scalable and reduce the cost of VM usage of a hybrid cluster for up to 20 percent.", "venue": "IEEE transactions on computers", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-05-01", "journal": {"name": "IEEE Transactions on Computers", "pages": "1117-1132", "volume": "71"}, "authors": [{"authorId": "2103458821", "name": "Muhammed Tawfiqul"}, {"authorId": "1716948", "name": "Huaming Wu"}, {"authorId": "2098120763", "name": "Shanika"}, {"authorId": "2105459396", "name": "Karunasekera"}, {"authorId": "1709598", "name": "R. Buyya"}], "citations": [{"paperId": "13993c8153f09ec2cd3ec2fe0b6ebff707b5a299", "title": "A neural network framework for optimizing parallel computing in cloud servers"}, {"paperId": "969fdab9c72510659615e66d0a9ad183fba86784", "title": "MAS-Cloud+: A novel multi-agent architecture with reasoning models for resource management in multiple providers"}, {"paperId": "bd16465f1ef98c3c537e4acd1007d35df9235e0e", "title": "Cost-Efficient Scheduling of Streaming Applications in Apache Flink on Cloud"}, {"paperId": "7b03b28e7a7ad5328f1147a98a06ebcb7cb4f541", "title": "Cost-Aware Scheduling and Data Skew Alleviation for Big Data Processing in Heterogeneous Cloud Environment"}, {"paperId": "24e524885646f6f4cc838d2b012a86029b77c842", "title": "Proactive SLA-aware Application Placement in the Computing Continuum"}, {"paperId": "093c1d54b6627b6a1d0299b967623f033322c5ee", "title": "An Improved Genetic Algorithm with Swarm Intelligence for Security-Aware Task Scheduling in Hybrid Clouds"}, {"paperId": "2ae493c61342a3f647957e06a58355415ce06260", "title": "Energy-aware scheduling for spark job based on deep reinforcement learning in cloud"}, {"paperId": "56d16cb01d24816507548437f3303c3f55007b71", "title": "Optimizing computational costs of Spark for SARS‐CoV‐2 sequences comparisons on a commercial cloud"}, {"paperId": "77358ad92e0c0cf2f2904f3e9cac6c9e19023421", "title": "Face Mask and Helmet Facial Detection for ATM Security Using Image Processing in Cloud Computing"}, {"paperId": "cefd87ed57f88fadded23648333b96f0ace87dc4", "title": "DRL-based and Bsld-Aware Job Scheduling for Apache Spark Cluster in Hybrid Cloud Computing Environments"}, {"paperId": "e8a843dca64391e5c83ec35cd65c03734c5cb423", "title": "Task Scheduling for Spark Applications With Data Affinity on Heterogeneous Clusters"}]}
