{"paperId": "9c9a6a89396be6b1faa808df108b10f0bb2b65ec", "publicationVenue": {"id": "74f47cf8-2839-4a56-959a-524dd0ed9e3e", "name": "International Conference on Extending Database Technology", "type": "conference", "alternate_names": ["Int Conf Extending Database Technol", "Extending Database Technology", "Extending Database Technol", "EDBT"], "url": "http://www.edbt.org/"}, "title": "Predictive Price-Performance Optimization for Serverless Query Processing", "abstract": "We present an efficient, parametric modeling framework for predictive resource allocations, focusing on the amount of computational resources, that can optimize for a range of price-performance objectives for data analytics in serverless query processing settings. We discuss and evaluate in depth how our system, AutoExecutor, can use this framework to automatically select near-optimal executor and core counts for Spark SQL queries running on Azure Synapse. Our techniques improve upon Spark's in-built, reactive, dynamic executor allocation capabilities by substantially reducing the total executors allocated and executor occupancy while running queries, thereby freeing up executors that can potentially be used by other concurrent queries or in reducing the overall cluster provisioning needs. In contrast with post-execution analysis tools such as Sparklens, we predict resource allocations for queries before executing them and can also account for changes in input data sizes for predicting the desired allocations.", "venue": "International Conference on Extending Database Technology", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-12-16", "journal": {"pages": "118-130"}, "authors": [{"authorId": "3133317", "name": "Rathijit Sen"}, {"authorId": "2153931746", "name": "Abhishek Roy"}, {"authorId": "2153832", "name": "Alekh Jindal"}], "citations": [{"paperId": "7371ec00cf0b69db48069fc9dbc9c4bdaa3d6c6c", "title": "Resource Allocation in Serverless Query Processing"}, {"paperId": "a538810087c7d8b240bf512ae997144fcbea466f", "title": "Towards Optimal Resource Allocation for Big Data Analytics"}]}
