{"paperId": "9ca0f04c432d19de7db252e47a3b63d48944d9c3", "publicationVenue": {"id": "36e4bc17-266a-4715-9b27-2be27e1e994e", "name": "IEEE International Symposium on Workload Characterization", "type": "conference", "alternate_names": ["IISWC", "IEEE Int Symp Workload Charact"], "url": "http://www.iiswc.org/"}, "title": "UVM Discard: Eliminating Redundant Memory Transfers for Accelerators", "abstract": "An increasing number of applications benefit from heterogeneous hardware accelerators. Such accelerators often require the application to manually manage memory buffers on devices and transfer data between host and device buffers. A programming model that unifies the virtual address space across the host and devices is appealing because it enables automatic memory transfers and simplifies application-level programming. However, the automatic memory transfers can sometimes be redundant, which decreases performance. NVIDIA’s UVM (unified virtual memory) driver provides a unified virtual address space for CPU-GPU programming. This paper identifies redundant memory transfers (RMTs) as a common performance issue with UVM. To address this issue, this paper proposes a data discard directive, and evaluates two implementations of that directive, UvmDiscard and UvmDiscardLazy. This directive exploits application-level knowledge to avoid RMTs. The implementations were integrated with NVIDIA’s open-source UVM driver to demonstrate their usefulness on real-world CUDA UVM applications. For example, the use of the discard directive increases training throughput by 61.2% on a large deep learning application that oversubscribes GPU memory.", "venue": "IEEE International Symposium on Workload Characterization", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-11-01", "journal": {"name": "2022 IEEE International Symposium on Workload Characterization (IISWC)", "pages": "27-38"}, "authors": [{"authorId": "2653009", "name": "Weixi Zhu"}, {"authorId": "28981429", "name": "Guilherme Cox"}, {"authorId": "1629749335", "name": "J. Veselý"}, {"authorId": "52122208", "name": "Mark Hairgrove"}, {"authorId": "1779022", "name": "A. Cox"}, {"authorId": "1805158", "name": "S. Rixner"}], "citations": [{"paperId": "7a320a1c521be53de9df9f7ea1e1973f2897e5c9", "title": "Performance Implications of Async Memcpy and UVM: A Tale of Two Data Transfer Modes"}, {"paperId": "5aab15b637a7da94977393d2c14a53a5fa08d183", "title": "NextGen-Malloc: Giving Memory Allocator Its Own Room in the House"}]}
