{"paperId": "9cb00f873d963a18aa698d134548c74eb25e50f7", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Reliability and Risk Centered Maintenance: A Novel Method for Supporting Maintenance Management", "abstract": "Proper maintenance planning is critical for maintenance management to contribute to increasing availability, ensuring quality requirements, and controlling the safety and environmental risks associated with physical assets. As supporting tools for developing maintenance strategies, Reliability-Centered Maintenance (RCM) and Risk-Based Maintenance (RBM) methods are currently used in several organizations. Nevertheless, these strategies are often approached separately although they are complementary. In this context, this paper proposes a novel method that effectively integrates RCM and RBM by adapting the traditional RCM method to incorporate risk management into maintenance planning decision-making to support maintenance management. The proposed Reliability and Risk Centered Maintenance (RRCM) method allows organizations to determine maintenance plans that ensure the reliability of the physical assets while considering and prioritizing the risks associated with their potential functional failures. The proposed method was demonstrated through a case study considering the operational context of a hydroelectric power plant. The results show the ability of RRCM to assist in the development and implementation of maintenance plans oriented to reliability, risk, and cost.", "venue": "Applied Sciences", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-23", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "2128139880", "name": "R. F. da Silva"}, {"authorId": "30751989", "name": "Arthur H. A. Melani"}, {"authorId": "150222452", "name": "Miguel A. C. Michalski"}, {"authorId": "115977126", "name": "G. D. de Souza"}], "citations": [{"paperId": "d9340a5c82d58a35c83248d1d1f819107e89e79f", "title": "Improvement of Industrial Maintenance Plans through Assistance-Driven Reliability-Centered Maintenance and Case-Based Reasoning Design"}, {"paperId": "7d9cc1cf291e730ee6355d3ed8ca343e4363dc8b", "title": "Cake Breaker Conveyor Machine Maintenance System Analysis Using the Reliability-Centered Maintenance (RCM) Method"}]}
