{"paperId": "9cbadc4940ca547e9ff6e90a8782b65558d63098", "publicationVenue": {"id": "02c07c77-4178-40dc-9078-33103ee6bbe7", "name": "Intestinal Research", "type": "journal", "alternate_names": ["Intest Res"], "issn": "1598-9100", "url": "http://www.gut.or.kr/", "alternate_urls": ["https://www.irjournal.org/"]}, "title": "Artificial intelligence in inflammatory bowel disease: implications for clinical practice and future directions", "abstract": "Inflammatory bowel disease encompasses Crohn’s disease and ulcerative colitis and is characterized by uncontrolled, relapsing, and remitting course of inflammation in the gastrointestinal tract. Artificial intelligence represents a new era within the field of gastroenterology, and the amount of research surrounding artificial intelligence in patients with inflammatory bowel disease is on the rise. As clinical trial outcomes and treatment targets evolve in inflammatory bowel disease, artificial intelligence may prove as a valuable tool for providing accurate, consistent, and reproducible evaluations of endoscopic appearance and histologic activity, thereby optimizing the diagnosis process and identifying disease severity. Furthermore, as the applications of artificial intelligence for inflammatory bowel disease continue to expand, they may present an ideal opportunity for improving disease management by predicting treatment response to biologic therapies and for refining the standard of care by setting the basis for future treatment personalization and cost reduction. The purpose of this review is to provide an overview of the unmet needs in the management of inflammatory bowel disease in clinical practice and how artificial intelligence tools can address these gaps to transform patient care.", "venue": "Intestinal Research", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2023-04-20", "journal": {"name": "Intestinal Research", "pages": "283 - 294", "volume": "21"}, "authors": [{"authorId": "49494435", "name": "H. Ahmad"}, {"authorId": "144448214", "name": "J. East"}, {"authorId": "6591814", "name": "R. Panaccione"}, {"authorId": "144494185", "name": "S. Travis"}, {"authorId": "39757199", "name": "J. Canavan"}, {"authorId": "3588538", "name": "K. Usiskin"}, {"authorId": "2185156826", "name": "Michael F. Byrne"}], "citations": [{"paperId": "295a5d9198398ec1267cb775d676add7ee7a8fa5", "title": "Machine learning in the assessment and management of acute gastrointestinal bleeding"}, {"paperId": "93c0bdca2c22f1dd5f2aa86a7acce4484813535a", "title": "Could histologic healing be a new treatment target in patients with ulcerative colitis?"}, {"paperId": "34c5bf15c29cdc890a90e6552efd7c1ef673cbd9", "title": "The Histological Detection of Ulcerative Colitis Using a No-Code Artificial Intelligence Model."}, {"paperId": "f8ef29cfa418358ba353d151877afc71a55c6f84", "title": "Potential Oral Microbial Markers for Differential Diagnosis of Crohn’s Disease and Ulcerative Colitis Using Machine Learning Models"}]}
