{"paperId": "9cbff5a8730d547c7cf5c6239ab45aad32eb0564", "publicationVenue": null, "title": "An Experimental Research on the Use of Recurrent Neural Networks in Landslide Susceptibility Mapping", "abstract": "Natural hazards have a great number of influencing factors. Machine-learning approaches have been employed to understand the individual and joint relations of these factors. However, it is a challenging process for a machine learning algorithm to learn the relations of a large parameter space. In this circumstance, the success of the model is highly dependent on the applied parameter reduction procedure. As a state-of-the-art neural network model, representative learning assumes full responsibility of learning from feature extraction to prediction. In this study, a representative learning technique, recurrent neural network (RNN), was applied to a natural hazard problem. To that end, it aimed to assess the landslide problem by two objectives: Landslide susceptibility and inventory. Regarding the first objective, an empirical study was performed to explore the most convenient parameter set. In landslide inventory studies, the capability of the implemented RNN on predicting the subsequent landslides based on the events before a certain time was investigated respecting the resulting parameter set of the first objective. To evaluate the behavior of implemented neural models, receiver operating characteristic analysis was performed. Precision, recall, f-measure, and accuracy values were additionally measured by changing the classification threshold. Here, it was proposed that recall metric be utilized for an evaluation of landslide mapping. Results showed that the implemented RNN achieves a high estimation capability for landslide susceptibility. By increasing the network complexity, the model started to predict the exact label of the corresponding landslide initiation point instead of estimating the susceptibility level.", "venue": "ISPRS Int. J. Geo Inf.", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-12-11", "journal": {"name": "ISPRS Int. J. Geo Inf.", "pages": "578", "volume": "8"}, "authors": [{"authorId": "3268020", "name": "Begum Mutlu"}, {"authorId": "2819733", "name": "H. A. Nefeslioglu"}, {"authorId": "2096764", "name": "E. Sezer"}, {"authorId": "34658016", "name": "M. Akcayol"}, {"authorId": "2693451", "name": "C. Gokceoglu"}], "citations": [{"paperId": "5a5488fd5c0926ac598f702b5d796dd9669b1266", "title": "Information Cascade Prediction under Public Emergencies: A Survey"}, {"paperId": "641eadadc0ebd842ace1ce7017454da6a5c2aa97", "title": "Comparative analysis of the TabNet algorithm and traditional machine learning algorithms for landslide susceptibility assessment in the Wanzhou Region of China"}, {"paperId": "37739c4feb1e515f3856865741c2bc51949b72cf", "title": "Landslide spatial prediction using cluster analysis"}, {"paperId": "1601858bb60cb5b83dc0be73efca8dc06b19221c", "title": "A novel landslide susceptibility prediction framework based on contrastive loss"}, {"paperId": "9a97fa90caca83bed116455010c21116018e67b2", "title": "Landslide susceptibility prediction and mapping using the LD-BiLSTM model in seismically active mountainous regions"}, {"paperId": "52110af180fd667bb587adabade40fc71fe811e6", "title": "Landslide susceptibility assessment in Qinzhou based on rough set and semi-supervised support vector machine"}, {"paperId": "d5d3b9e88fc156e2ad9f89b33a02768359d36238", "title": "Riverside Landslide Susceptibility Overview: Leveraging Artificial Neural Networks and Machine Learning in Accordance with the United Nations (UN) Sustainable Development Goals"}, {"paperId": "e24119d6f41ae34bdd301157132eb1cd694e461a", "title": "Comparative Analysis of Tree-Based Ensemble Learning Algorithms for Landslide Susceptibility Mapping: A Case Study in Rize, Turkey"}, {"paperId": "f5c74425d4064954f225f3a21562117f0bbafc63", "title": "Wildfire Susceptibility Mapping Using Deep Learning Algorithms in Two Satellite Imagery Dataset"}, {"paperId": "3f9e3488c5a05bb4783cb03a90e695c5338919b1", "title": "A Deep-Learning-Facilitated, Detection-First Strategy for Operationally Monitoring Localized Deformation with Large-Scale InSAR"}, {"paperId": "4e94f7496deef4f632d5c1da8a32de664919fa1f", "title": "Landslide susceptibility mapping and dynamic response along the Sichuan-Tibet transportation corridor using deep learning algorithms"}, {"paperId": "e90e7667b26f05c64b3186c05357884d39e1b8d1", "title": "Machine learning based landslide susceptibility mapping models and GB-SAR based landslide deformation monitoring systems: Growth and evolution"}, {"paperId": "4330152358dc55bab8728a71d789d730306a73f7", "title": "Nonlinear Autoregressive Exogenous Neural Network for Earthquake Prediction in Indonesia"}, {"paperId": "737dfafa721ee0fe288d7ab3052885167189a466", "title": "Landslide Susceptibility Modeling Using a Deep Random Neural Network"}, {"paperId": "5cd2321da0a9c84db8aea08d239c8ae666e6566a", "title": "Using time series analysis and dual-stage attention-based recurrent neural network to predict landslide displacement"}, {"paperId": "ce401258c0f460b6b02eff20fa97174d14d5594f", "title": "An integrated approach based earthquake risk assessment of a seismically active and rapidly urbanizing area in Northern Pakistan"}, {"paperId": "cb742f027fc0b2ecdc20b3472ad51458440e1f32", "title": "Assessment of rainfall-induced landslide susceptibility in Artvin, Turkey using machine learning techniques"}, {"paperId": "010d1b055eae0ad3175ae379124a36d3c9c05e3c", "title": "Machine Learning in Disaster Management: Recent Developments in Methods and Applications"}, {"paperId": "96122897f7b8ddd0d3e10f900b2a22ea00b3eb16", "title": "Analysis of failure of high slope subjected to rainfall infiltration at Peringavu in Kerala, India"}, {"paperId": "0625452100ecbf0302cc0d2ad3a1bd5d43f08f73", "title": "Comparison of general kernel, multiple kernel, infinite ensemble and semi-supervised support vector machines for landslide susceptibility prediction"}, {"paperId": "5bdb2dcc682270526e00d1ec9dcb22b89babf7e3", "title": "A hybrid ensemble-based deep-learning framework for landslide susceptibility mapping"}, {"paperId": "95fdd2ff52e9a22a049ff55d7330db3e16e46318", "title": "Roof Subsidence and Movement Law of Composite Strata Mining: Insights from Physical and Numerical Modeling"}, {"paperId": "50fe7e4dc97a576427030a997068f7f03ce80399", "title": "Shared Blocks-Based Ensemble Deep Learning for Shallow Landslide Susceptibility Mapping"}, {"paperId": "065514d564d28e91295ce2aa7a3b7c5fe5ec13ac", "title": "Deep learning for geological hazards analysis: Data, models, applications, and opportunities"}, {"paperId": "7aeeb8d0e3c05acbeccd77c54597bd2d47d8bb0d", "title": "Stacking ensemble of deep learning methods for landslide susceptibility mapping in the Three Gorges Reservoir area, China"}, {"paperId": "7152371ff3913c6e87ecf1507883979fb1e3683f", "title": "A Comprehensive Assessment of XGBoost Algorithm for Landslide Susceptibility Mapping in the Upper Basin of Ataturk Dam, Turkey"}, {"paperId": "21d13680178235565ccf07350507541e024e2078", "title": "Infinite slope stability model and steady-state hydrology-based shallow landslide susceptibility evaluations: The Guneysu catchment area (Rize, Turkey)"}, {"paperId": "1f52c70ae2cacd893d63580b39dbf1f5f8f14e16", "title": "Evaluation of deep learning algorithms for national scale landslide susceptibility mapping of Iran"}, {"paperId": "39391ab293e3d557b3ac4fb85c010a54d9d475fc", "title": "Automatic Extraction of Seismic Landslides in Large Areas with Complex Environments Based on Deep Learning: An Example of the 2018 Iburi Earthquake, Japan"}, {"paperId": "ab719cb751f66e7bec0df4ee43d9bb0d272b4a50", "title": "Combining Evolutionary Algorithms and Machine Learning Models in Landslide Susceptibility Assessments"}, {"paperId": "fa8f8f7dcf04085ccc7913a405000e098b00508d", "title": "A comparative study of heterogeneous ensemble-learning techniques for landslide susceptibility mapping"}, {"paperId": "cbc2813c8011edc36b4ed6bf18556f13a202076d", "title": "Applications of artificial intelligence for disaster management"}, {"paperId": "8159dc7bce11fdb404b43b06fd6e33cb2f02b5e0", "title": "Simulation Analysis of Influencing Factors of Subsidence Based on Mining under Huge Loose Strata: A Case Study of Heze Mining Area, China"}, {"paperId": "d8cf7f6bc2f07fd0f27a36cdf63569b667a0b514", "title": "Integration of convolutional neural network and conventional machine learning classifiers for landslide susceptibility mapping"}, {"paperId": "dd3671347e1a59adf928e44edc6e6b891600acec", "title": "Comparative study of landslide susceptibility mapping with different recurrent neural networks"}, {"paperId": "57d391bbdc3bc2d0a4b66de6ce2e73eda74dfe2a", "title": "Landslide Susceptibility Prediction Based on Remote Sensing Images and GIS: Comparisons of Supervised and Unsupervised Machine Learning Models"}, {"paperId": "a7c82fb0091aaa4dcf898c36caafcfa4e5b77c34", "title": "LCFSTE: Landslide Conditioning Factors and Swin Transformer Ensemble for Landslide Susceptibility Assessment"}]}
