{"paperId": "9ce0134f13b9be55ce5c3f7348c17e9079eb31e8", "publicationVenue": {"id": "e8d05569-ee3c-416e-88fa-8ee27bedfe78", "name": "Electronic Journal of Graph Theory and Applications", "type": "journal", "alternate_names": ["Electron J Graph Theory Appl"], "issn": "2338-2287", "url": "http://www.ejgta.org/", "alternate_urls": ["https://www.ejgta.org/index.php/ejgta"]}, "title": "Evaluating topological ordering in directed acyclic graphs", "abstract": "Directed acyclic graphs are often used to model situations and problems in real life. If we consider the topological ordering of a graph as a process of arranging the vertices in the best possible way considering the constraints caused by the direction of edges, then it makes sense to try to optimize this process by minimizing the distances between vertices in the ordering. For this purpose, we define measures based on distances between vertices in the topological ordering that allow us to construct a graph with optimal topological ordering regarding a specific measure thus minimizing the complexity of the system represented by the graph. We explore minimal and maximal values of the defined measures and comment on the topology of graphs for which maximal and minimal values are obtained. Potentially, the proved bounds could be used to benchmark existing algorithms, devise new approximation algorithms or branch–and–bound schemas for some scheduling problems that are usually of hard computational complexity.", "venue": "Electronic Journal of Graph Theory and Applications", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-10-18", "journal": {"name": "Electron. J. Graph Theory Appl.", "pages": "567-580", "volume": "9"}, "authors": [{"authorId": "17745489", "name": "Suzana Antunovic"}, {"authorId": "102750776", "name": "D. Vukičević"}], "citations": [{"paperId": "e6993d45cddf227e1a5b2d7be83e52f455e0d39d", "title": "Artificial Intelligence for Web-based Educational Systems"}]}
