{"paperId": "9ce07d68770a82a0177ddb0f1a5dd4209091f91e", "publicationVenue": {"id": "52ee8f70-41d7-4479-a480-646299aafc28", "name": "Frontiers in Ecology and Evolution", "type": "journal", "alternate_names": ["Front Ecol Evol"], "issn": "2296-701X", "url": "http://www.frontiersin.org/Behavioral_and_Evolutionary_Ecology", "alternate_urls": ["http://www.frontiersin.org/ecology_and_evolution", "http://www.frontiersin.org/Ecology_and_Evolution/archive", "https://www.frontiersin.org/journals/ecology-and-evolution"]}, "title": "An animal movement track segmentation framework for forecasting range adaptation under global change", "abstract": "The methods used for predicting space use and geographic distribution adaptations of animals in response to global change have relied on fitting statistical and machine learning models to environmentally-contextualized movement and spatial distribution data. These predictions, however, are made at particular spatiotemporal scales (from home range to species distribution), but no comprehensive methods have been proposed for predicting how changes to subdiel segments of individual movement tracks may lead to emergent changes in the lifetime tracks of individuals, and hence in the redistribution of species under global change. In this article, we discuss in terms of a hierarchical movement track segmentation framework that, anchored by diel activity routines (DARs), how adaptions in the canonical activity modes (CAMs) of movement can be used to assess space use adaptations to landscape and climate change at scales ranging from subdiel movement segments to the lifetime tracks (LiTs) of individuals.", "venue": "Frontiers in Ecology and Evolution", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-29", "journal": {"volume": "11"}, "authors": [{"authorId": "1829415", "name": "W. Getz"}], "citations": [{"paperId": "68dec5d887c250f88cdb93f26b75a665d5e74901", "title": "An Information Theoretic Treatment of Animal Movement Tracks"}]}
