{"paperId": "9cebb65b748543ef263dc680c6ab8949335dc117", "publicationVenue": {"id": "228761ec-c40a-479b-8309-9dcbe9851bcd", "name": "IEEE Internet of Things Journal", "type": "journal", "alternate_names": ["IEEE Internet Thing J"], "issn": "2327-4662", "url": "https://www.ieee.org/membership-catalog/productdetail/showProductDetailPage.html?product=PER288-ELE", "alternate_urls": ["https://ieeexplore.ieee.org/servlet/opac?punumber=6488907", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6488907", "http://ieee-iotj.org/#"]}, "title": "HFSA: A Semi-Asynchronous Hierarchical Federated Recommendation System in Smart City", "abstract": "In modern society, recommendation systems (RSs) already become an indispensable component, especially in smart cities. Their recommendation performance is greatly affected by the available analyzing data, but centralized massive data can cause data privacy issues. Hence, federated learning is applied to achieve a higher recommendation accuracy without sharing raw data. To improve the performance and reliability of traditional federated RSs, we propose HFSA, a semi-asynchronous hierarchical federated RS. First, from the architecture perspective, an edge server layer is involved between the central server and clients, which alleviates the server’s communication pressure and enhances the recommendation model training by configuring the global aggregation frequency. Besides, a semi-asynchronous aggregation mechanism is designed. It collects local parameters as much as possible within the predefined aggregation cycle and allows the slow clients to contribute their model parameters asynchronously. The tolerate round and dynamic participation time weights shield the heterogeneity and instability of edge clients and ensure the convergence of the global model. Compared with several classical baselines, the experimental results show that HFSA can achieve a relatively better recommendation performance with high accuracy and less training time. In addition, the influential factors of HFSA are evaluated as well.", "venue": "IEEE Internet of Things Journal", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-11-01", "journal": {"name": "IEEE Internet of Things Journal", "pages": "18808-18820", "volume": "10"}, "authors": [{"authorId": "49034115", "name": "Youhuizi Li"}, {"authorId": "2221567621", "name": "Haitao Yu"}, {"authorId": "2156813551", "name": "Yan Zeng"}, {"authorId": "2005966545", "name": "Qianqian Pan"}], "citations": [{"paperId": "1884e7d15da4230b09971ef177ccae0a12647b3e", "title": "Horizontal Federated Recommender System: A Survey"}, {"paperId": "e84dc29b2c365bf8c643c3e3f697dd7f93bd6913", "title": "Model aggregation techniques in federated learning: A comprehensive survey"}]}
