{"paperId": "9cfff072dbc39c3ea465c97bf8940f4a608e62c4", "publicationVenue": {"id": "ebcbaf26-62a6-4cb2-b637-b29091ca04d6", "name": "European Signal Processing Conference", "type": "conference", "alternate_names": ["EUSIPCO", "Eur Signal Process Conf"], "issn": "2076-1465", "alternate_issns": ["2219-5491"], "url": "https://www.eurasip.org/index.php?Itemid=89&id=80&option=com_content&view=article", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/conhome/1801907/all-proceedings"]}, "title": "Contrastive learning for atrial fibrillation detection in challenging scenarios", "abstract": "In healthcare applications, retraining models for new users often require collecting many labeled data, which is challenging and expensive in these types of applications, such as atrial fibrillation detection. Unsupervised and self-supervised techniques have emerged as promising methods to deal with the scarcity of labeled data. Contrastive learning is a recent technique that aims to improve model accuracy by a pre-trained process with unlabelled data. In this work, we propose the implementation of contrastive learning to improve the performance of a CNN that classifies atrial fibrillation in scenarios with few labeled data, small models, and noisy data. The strategy was evaluated in the most extensive public ECG dataset. We present results regarding the F1-score for a different amount of unlabeled-labeled data and different model sizes. The results suggest that our strategy outperforms the baseline strategy up to 30% of the 10-fold mean F1-score compared to an improvement of 5.8% AUC in the state of the art.", "venue": "European Signal Processing Conference", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-08-29", "journal": {"name": "2022 30th European Signal Processing Conference (EUSIPCO)", "pages": "1218-1222"}, "authors": [{"authorId": "2188284630", "name": "Karen Fonseca"}, {"authorId": "2074637462", "name": "Sergio Osorio"}, {"authorId": "2147212508", "name": "Jeyson A. Castillo"}, {"authorId": "2188292542", "name": "Carlos Fajardo"}], "citations": [{"paperId": "cdab8d71fa03670e84ae131a3f423ceff358a77a", "title": "A Systematic Survey of Data Augmentation of ECG Signals for AI Applications"}]}
