{"paperId": "9d070671b49dabf988464779696aff75fe592878", "publicationVenue": {"id": "7dc964d5-49e6-4c37-b1c4-a7f0de1fa425", "name": "International Conference on Web and Social Media", "type": "conference", "alternate_names": ["Int Conf Weblogs Soc Media", "International Conference on Weblogs and Social Media", "Int Conf Web Soc Media", "ICWSM"], "url": "http://www.aaai.org/Library/ICWSM/icwsm-library.php"}, "title": "On Xing Tian and the Perseverance of Anti-China Sentiment Online", "abstract": "Sinophobia, anti-Chinese sentiment, has existed on the Web for a long time. The outbreak of COVID-19 and the extended quarantine has further amplified it. However, we lack a quantitative understanding of the cause of Sinophobia as well as how it evolves over time. In this paper, we conduct a largescale longitudinal measurement of Sinophobia, between 2016 and 2021, on two mainstream and fringe Web communities. By analyzing 8B posts from Reddit and 206M posts from 4chan’s /pol/, we investigate the origins, evolution, and content of Sinophobia. We find that, anti-Chinese content may be evoked by political events not directly related to China, e.g., the U.S. withdrawal from the Paris Agreement. And during the COVID-19 pandemic, daily usage of Sinophobic slurs has significantly increased even with the hate-speech ban policy. We also show that the semantic meaning of the words “China” and “Chinese” are shifting towards Sinophobic slurs with the rise of COVID-19 and remain the same in the pandemic period. We further use topic modeling to show the topics of Sinophobic discussion are pretty diverse and broad. We find that both Web communities share some common Sinophobic topics like ethnics, economics and commerce, weapons and military, foreign relations, etc. However, compared to 4chan’s /pol/, more daily life-related topics including food, game, and stock are found in Reddit. Our finding also reveals that the topics related to COVID-19 and blaming the Chinese government are more prevalent in the pandemic period. To the best of our knowledge, this paper is the longest quantitative measurement of Sinophobia.", "venue": "International Conference on Web and Social Media", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-04-19", "journal": {"name": "ArXiv", "volume": "abs/2204.08935"}, "authors": [{"authorId": "50457366", "name": "Xinyue Shen"}, {"authorId": "2116553732", "name": "Xinlei He"}, {"authorId": "152981628", "name": "M. Backes"}, {"authorId": "144728530", "name": "Jeremy Blackburn"}, {"authorId": "3447293", "name": "Savvas Zannettou"}, {"authorId": "2145956085", "name": "Yang Zhang"}], "citations": [{"paperId": "f568a7bf423121780a552d6819ca6623112578f7", "title": "Adversarial Nibbler: An Open Red-Teaming Method for Identifying Diverse Harms in Text-to-Image Generation"}, {"paperId": "4ec1b2273af190811644233ff20095524a8de66c", "title": "Comprehensive Assessment of Toxicity in ChatGPT"}, {"paperId": "de82c0e640646086a462b2fca99a82625c60cc1d", "title": "Sadness, Anger, or Anxiety: Twitter Users' Emotional Responses to Toxicity in Public Conversations"}, {"paperId": "6d5dd3afce1515543ea38faaac49cb956cf18186", "title": "You Only Prompt Once: On the Capabilities of Prompt Learning on Large Language Models to Tackle Toxic Content"}, {"paperId": "1104d766527dead44a40532e8a89444d9cef5c65", "title": "\"Do Anything Now\": Characterizing and Evaluating In-The-Wild Jailbreak Prompts on Large Language Models"}, {"paperId": "2da1e732b2b4c88a47816ebda2bdbef983d158be", "title": "A Data-driven Understanding of Left-Wing Extremists on Social Media"}, {"paperId": "c9e548d72f5ad72215025602be36f72042219baf", "title": "Unsafe Diffusion: On the Generation of Unsafe Images and Hateful Memes From Text-To-Image Models"}, {"paperId": "49bede1017b49226826901548806b6a770a78771", "title": "Understanding the Use of Images to Spread COVID-19 Misinformation on Twitter"}, {"paperId": "84d9b01fa0f00c304760c2d26a8ab73e8584e061", "title": "Platform-agnostic Model to Detect Sinophobia on Social Media"}, {"paperId": "fafd97e3f98d578aa4fe29dc3dfe69485376442a", "title": "Beyond Fish and Bicycles: Exploring the Varieties of Online Women’s Ideological Spaces"}, {"paperId": "c29e3d050612175023a7c4bbb166181208c1bd6d", "title": "On the Evolution of (Hateful) Memes by Means of Multimodal Contrastive Learning"}, {"paperId": "837b48612f62572e553bb9a008638c86eaa1d57d", "title": "How Much Hate with #china? A Preliminary Analysis on China-related Hateful Tweets Two Years After the Covid Pandemic Began"}, {"paperId": "f7ba053fe0704f8ecf4d89b5ce055a8fc8444722", "title": "Not All Asians are the Same: A Disaggregated Approach to Identifying Anti-Asian Racism in Social Media"}]}
