{"paperId": "9d10eac7b7a9010c27c8e55d33694a94c678b2a4", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Recent Advances on Federated Learning: A Systematic Survey", "abstract": "Federated learning has emerged as an effective paradigm to achieve privacy-preserving collaborative learning among different parties. Compared to traditional centralized learning that requires collecting data from each party, in federated learning, only the locally trained models or computed gradients are exchanged, without exposing any data information. As a result, it is able to protect privacy to some extent. In recent years, federated learning has become more and more prevalent and there have been many surveys for summarizing related methods in this hot research topic. However, most of them focus on a specific perspective or lack the latest research progress. In this paper, we provide a systematic survey on federated learning, aiming to review the recent advanced federated methods and applications from different aspects. Specifically, this paper includes four major contributions. First, we present a new taxonomy of federated learning in terms of the pipeline and challenges in federated scenarios. Second, we summarize federated learning methods into several categories and briefly introduce the state-of-the-art methods under these categories. Third, we overview some prevalent federated learning frameworks and introduce their features. Finally, some potential deficiencies of current methods and several future directions are discussed.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-01-03", "journal": {"name": "ArXiv", "volume": "abs/2301.01299"}, "authors": [{"authorId": "70633617", "name": "Bingyan Liu"}, {"authorId": "2199246944", "name": "Nuoyan Lv"}, {"authorId": "2199307789", "name": "Yuanchun Guo"}, {"authorId": "2185347291", "name": "Yawen Li"}], "citations": [{"paperId": "db4752eb75f948e23a7666bcaee3975c402f5789", "title": "Federated Learning for Healthcare Applications"}, {"paperId": "741cdf325e4a433dc5988d06b0c94fef857ebb8f", "title": "Federated learning enables 6 G communication technology: Requirements, applications, and integrated with intelligence framework"}, {"paperId": "e4231f8bd73ef782f0604dad80975ad5ea4f62da", "title": "Benchmarking Client Selection Methods in Non-IID Federated Learning Scenarios"}, {"paperId": "919aa15f4ec9b5fb11caf475de79c4214324a7b1", "title": "A review on client selection models in federated learning"}, {"paperId": "bff83319672f0042466599d81d902dee9394663b", "title": "Limitations and Future Aspects of Communication Costs in Federated Learning: A Survey"}, {"paperId": "6761dad88d2840d45929e0559042d7e990b1a849", "title": "FedAcc and FedAccSize: Aggregation Methods for Federated Learning Applications"}, {"paperId": "c38e5d98f8327970c4d1c3c7ca8a4db832a0da19", "title": "An Empirical Study of Federated Learning on IoT-Edge Devices: Resource Allocation and Heterogeneity"}, {"paperId": "92581154911d01ca88cc832aa5ff1807ec2c90b7", "title": "Beyond Fine-Tuning: Efficient and Effective Fed-Tuning for Mobile/Web Users"}]}
