{"paperId": "9d11391c6d0480b74151cf2236593b9a71c6f812", "publicationVenue": null, "title": "A Survey on Security of the Hadoop Framework in the Environment of Bigdata", "abstract": "The world is becoming increasingly digital at the moment. Every day, a significant amount of data is generated by everyone who uses the internet nowadays. The data are critical for carrying out day-to-day operations, as well as assisting corporate management in achieving their objectives and making the best judgments possible based on the information gathered. BigData is the process of merging many hardware and software solutions to deal with extremely huge amounts of data that surpass storage capability. It’s possible that large amounts of data will be generated. Hadoop systems are used in a variety of areas, including healthcare, finance, and government. insurance, and social media, in order to provide a quick and cost-effective big data solution. The Apache Hadoop is a framework for storing and processing data, managing, and distributing large amounts of information over a large number of server nodes. Here are some solutions that work on top of the Apache Hadoop stack to guarantee data security. To get a complete picture of the problem, we decided to conduct an investigation into existing security solutions for Apache Hadoop security in sensitive data which is stored on a huge data platform employing distributed computing on a cluster of commodity devices. The goal of this paper is to provide knowledge of security and Big Data issues.", "venue": "Journal of Physics: Conference Series", "year": 2021, "fieldsOfStudy": ["Physics"], "publicationTypes": ["Conference", "Review"], "publicationDate": "2021-11-01", "journal": {"name": "Journal of Physics: Conference Series", "volume": "2089"}, "authors": [{"authorId": "2132385901", "name": "Saritha Gattoju"}, {"authorId": "51289437", "name": "NagaLakshmi Vadlamani"}], "citations": [{"paperId": "9aefa036408720dd0eb1904a0edea839296e6046", "title": "Stacked multi‐layer security for Hadoop distributed file system using HSCT steganography"}, {"paperId": "3b094656c16bec50768adf23fbea83222f7bc1d8", "title": "Studying the Security and Privacy Issues of Big Data in the Saudi Medical Sector"}]}
