{"paperId": "9d2565ce5737211b18e16869cc0a8c1deb5cea7e", "publicationVenue": null, "title": "A Design Science Model for the Application of Data Mining and Machine Learning Models on Constrained Devices in Low Bandwidth Areas", "abstract": "The sale of commuter bus tickets by human ticket agents during peak periods can be stressful to the participants involved. The ticket agents need to select departure locations from a list of possible departures provided by the bus service. For each departure, there is then a list of possible destinations. The commuter bus service described in this research used Android devices with a large format screen along with a connected secure ticket printer. Many of the ticket vending stations were in rural areas catering for commuters who lived in rural areas and worked in urban areas. As such, the connectivity was often slow. The devices themselves were also constrained with many of them still running on Android Jelly Bean. This research looks at ways to increase the speed of individual ticket sales by using data mining and machine learning models on centralized servers, then publishing these models as small text files on REST servers. These small text files could then be downloaded by the Android devices each day at the start of business to assist in predicting departures and destinations to the ticket agents thereby decreasing the amount of time a customer and ticket agent needed to conduct a sale.", "venue": "2018 International Conference on Advances in Big Data, Computing and Data Communication Systems (icABCD)", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2018-08-01", "journal": {"name": "2018 International Conference on Advances in Big Data, Computing and Data Communication Systems (icABCD)", "pages": "1-7"}, "authors": [{"authorId": "3267664", "name": "L. Butgereit"}, {"authorId": "51292450", "name": "M. Niland"}, {"authorId": "2149399560", "name": "Jeroen Schmidt"}, {"authorId": "51303503", "name": "Wessel Rheeder"}], "citations": [{"paperId": "229ae8b2d2fde4701226d8622a1ce9286d451c34", "title": "Extending artificial intelligence research in the clinical domain: a theoretical perspective"}, {"paperId": "28863420e771168489ff03307737aeb25c296636", "title": "A Key 6G Challenge and Opportunity—Connecting the Base of the Pyramid: A Survey on Rural Connectivity"}, {"paperId": "1411cdafb6c49517198675208a9412ddb86760f9", "title": "A Key 6G Challenge and Opportunity - Connecting the Remaining 4 Billions: A Survey on Rural Connectivity"}]}
