{"paperId": "9d2cd84261b40aa90c06d8feaf8399e8458eac84", "publicationVenue": null, "title": "Smart Highway for Riders to Forecast Weather and Accidents", "abstract": "The development of the latest generation of smart highways has become one of the most discussed subjects in improving the effectiveness and security of transport networks. To obtain a comprehensive understanding of a roadway atmosphere, the majority of nations used highway imaging devices, millimeter-wave radar systems, etc. It also incorporates various communication techniques for sharing data among vehicles and installations. The future highway system's technical progress has made the smart highway an unavoidable development. Modern highway development and construction can be efficiently guided by its operational specification and structural evaluation, which also offers a smart transportation system with a solid basis. In general, unanticipated weather, collisions, and certain renovations can cause delay issues for drivers on metropolitan roads. People are going to struggle as a result of being forced to wait for an extended period. In this study, an approach was presented for informing upcoming road users with details regarding current events. In the beginning, the rain sensor for rainfall identification, the DHT11 Temperature and Humidity sensor for climate recognition, the vibration sensor for detecting accidents whenever they hits each other, accident recognition system utilizing the sound sensor records the sound of incidents and using the assistance of those it determines whether or not an accident has happened based on the pitch of sound, and ultrasonic sensor for identifying obstacles, i.e. to figure out if vehicles are addressing in the identical path improperly will be mounted on the vehicle. Using the ESP8266 device and an Arduino controller, the data are posted to the ThingSpeak Cloud collected by these sensors. In order to receive all of the aforementioned data regarding roadways while traveling, drivers need to download the customized web-based application on their smart phones or tablets.", "venue": "2023 International Conference on Self Sustainable Artificial Intelligence Systems (ICSSAS)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-10-18", "journal": {"name": "2023 International Conference on Self Sustainable Artificial Intelligence Systems (ICSSAS)", "pages": "840-846"}, "authors": [{"authorId": "2271495454", "name": "Sheher Banu S"}, {"authorId": "2270037247", "name": "Arun Francis G"}, {"authorId": "2213708734", "name": "S. R"}, {"authorId": "2104860179", "name": "Kottaimalai Ramaraj"}, {"authorId": "2235591602", "name": "Thilagaraj M"}, {"authorId": null, "name": "Sundar M"}], "citations": []}
