{"paperId": "9d3364477c96e60d350cd02bede12d048580573d", "publicationVenue": {"id": "55cfe77c-5a32-4904-8db5-8025cd9e1bd7", "name": "Applied Mathematics and Nonlinear Sciences", "alternate_names": ["Appl Math Nonlinear Sci"], "issn": "2444-8656", "url": "https://content.sciendo.com/view/journals/amns/amns-overview.xml", "alternate_urls": ["http://journals.up4sciences.org/applied_mathematics_and_nonlinear_sciences.html"]}, "title": "Analysis of media content recommendation in the new media era considering scene clustering algorithm", "abstract": "Abstract With the advent of the new media era, we face the problem of information overload every day, based on which this paper proposes a scenario-conscious clustering algorithm for recommending media content. The improved K-means algorithm is used to cluster the media content, an initial cluster center is randomly selected, and the remaining initial cluster centers are obtained by executing the improved algorithm to reduce the number of iterations and avoid neighboring situations. The clustering algorithm is then compared with content-based recommendation techniques, KNN recommendation algorithm, and collaborative filtering recommendation algorithm in terms of accuracy, recall, MAE value, and execution time. The clustering algorithm is significantly better than the other algorithms regarding accuracy and recall. The accuracy of the clustering algorithm is 0.4 when the recommendation sequence is 30, which is 0.4 higher than the collaborative filtering technique, 0.1 higher than the KNN, and 0.12 higher than the content recommendation method. In terms of MAE value, the clustering algorithm outperforms the other algorithms when the number of nearest neighbors is selected to be above 20. In terms of execution time, the longer the amount of data, the more obvious the advantage of the clustering algorithm. Therefore, the applicability and reliability of the model proposed in this paper for media content recommendation are verified in terms of accuracy, recall and execution time, which meet the design requirements.", "venue": "Applied Mathematics and Nonlinear Sciences", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-28", "journal": {"name": "Applied Mathematics and Nonlinear Sciences", "volume": "0"}, "authors": [{"authorId": "2193115082", "name": "Xueyong Yu"}, {"authorId": "39533001", "name": "Wei Wu"}], "citations": []}
