{"paperId": "9d54bf6000f4599439ee7d20a63ef6bc1e84e29d", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Dynamic Allocation of Manufacturing Resources in IoT Job Shop Considering Machine State Transfer and Carbon Emission", "abstract": "The optimal allocation of manufacturing resources plays an essential role in the production process. However, most of the existing resource allocation methods are designed for standard cases, lacking a dynamic optimal allocation framework for resources that can guide actual production. Therefore, this paper proposes a dynamic allocation method for discrete job shop resources in the Internet of Things (IoT), which considers the uncertainty of machine states, and carbon emission. First, a data-driven job shop resource status monitoring framework under the IoT environment is proposed, considering the real-time status of job shop manufacturing resources. A dynamic configuration mechanism of manufacturing resources based on the configuration threshold is proposed. Then, a real-time state-driven multi-objective manufacturing resource optimization allocation model is established, taking machine tool energy consumption and tool wear as carbon emission sources and combined with the maximum completion time. An improved imperialist competitive algorithm (I-ICA) is proposed to solve the model. Finally, taking an actual production process of a discrete job shop as an example, the proposed algorithm is compared with other low-carbon multi-objective optimization algorithms, and the results show that the proposed method is superior to similar methods in terms of completion time and carbon emissions. In addition, the practicability and effectiveness of the proposed dynamic resource allocation method are verified in a machine failure situation.", "venue": "Sustainability", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-12-04", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "122023039", "name": "X. Su"}, {"authorId": "37390241", "name": "Wenquan Dong"}, {"authorId": "2115405876", "name": "J. Lu"}, {"authorId": "50994378", "name": "Chen Chen"}, {"authorId": "2072611996", "name": "Weixi Ji"}], "citations": [{"paperId": "6998c77665087eca710b3ec5df1a408fc9e800d1", "title": "Performance Guarantee for Autonomous Robotic Missions using Resource Management: The PANORAMA Approach"}, {"paperId": "52d21caadbbc9e379a0c0f0c852e06ac751a0a24", "title": "Low-Carbon-Driven Product Life-Cycle Process Optimization Framework for Manufacturing Equipment"}]}
