{"paperId": "9d602a47f819c0d5a6676352b00788644fcf3c8a", "publicationVenue": {"id": "ffe5bb5c-04ed-488e-985d-d3a7b39542cf", "name": "IEEE International Conference on Distributed Computing Systems", "type": "conference", "alternate_names": ["International Conference on Distributed Computing Systems", "IEEE Int Conf Distrib Comput Syst", "Int Conf Device Circuit Syst", "ICDCS", "Int Conf Distrib Comput Syst", "International Conference on Devices, Circuits and Systems"], "url": "https://ieeexplore.ieee.org/xpl/conhome/1000213/all-proceedings"}, "title": "Enabling Wide Area Data Analytics with Collaborative Distributed Processing Pipelines (CDPPs)", "abstract": "Life without the Internet is no longer possible nor thinkable. Consider the effects of a prolonged Internet outage: In the least impactful way, most of our kids and peers just would no longer be able to interact with their peers. They might severely miss out on the quality of their leisure time activities which increasingly relies on social networks, online games, YouTube, and other online entertainment offers. This may be a nuisance but still is tolerable. More seriously and economically relevant, manufacturing and trade would no longer work as all interactions inside and among companies rely on a working Internet. Indeed, just-in-time ordering mechanisms and Internet of Things-enhanced production chains within the Industry 4.0 framework would no longer be operational as old-style communication means such as phone and faxes have completely been replaced. Indeed, neither of these alternative mechanisms—faxes, phone, and also messaging—would be available either as they also rely on Internet technology. Even worse, the control of critical infrastructures would also be affected severely as they increasingly rely on the Internet for gathering input data and propagating control information. Moreover, all big data analytic applications, including financial transactions, would fail as they can no longer gather and process their input data. Even worse, the fact that there is “no communication without energy” nowadays also means that the reciprocal statement applies that there is no “energy without communication.”", "venue": "IEEE International Conference on Distributed Computing Systems", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2017-06-05", "journal": {"name": "2017 IEEE 37th International Conference on Distributed Computing Systems (ICDCS)", "pages": "1915-1918"}, "authors": [{"authorId": "145401227", "name": "A. Feldmann"}, {"authorId": "1733076", "name": "M. Hauswirth"}, {"authorId": "1733290", "name": "V. Markl"}], "citations": [{"paperId": "10c70f3b25fe332de58f278aae0c78e580384399", "title": "Detecting Out-Of-Control Sensor Signals in Sheet Metal Forming using In-Network Computing"}, {"paperId": "6cd6d5c85c0b565ab2a5e5662a6f50b0606d3b5f", "title": "Big Stream Processing Systems"}]}
