{"paperId": "9d6d83dd0d9fa21ffe1a39054c81c5180c36a1fc", "publicationVenue": null, "title": "IoT: Systematic Review, Architecture, Applications and Dual Impact on Industries", "abstract": "The role of IoT in every aspect of human life is capacious. IoT being immensely popular technology, offers every possible solution to modernize life. Due to the omnipresence of internet, IoT offers substantial growth in almost all industrial domains. IoT is expected to make a remarkable difference in the revenue generated by various sectors, by combining it with other latest technologies. But this may also lead to unforeseen risks and challenges. A systematic review has been done, by conducting a survey of the detailed impact of IoT on various industrial domains. The research also explores a novel approach to integrate various technologies like fog and cloud with IoT. Various challenges encountered in the growth of IoT have also been analyzed, including security challenges and different methods to elucidate the issues have also been studied. Moreover, a standard generalized architecture of IoT technology has been presented which encompasses all the application domains. Lastly, different kinds of open issues and challenges have been discussed so that the researchers can work efficiently in future in various domains of IoT.", "venue": "IOP Conference Series: Materials Science and Engineering", "year": 2021, "fieldsOfStudy": ["Physics", "Computer Science"], "publicationTypes": ["Conference", "Review"], "publicationDate": "2021-01-19", "journal": {"name": "IOP Conference Series: Materials Science and Engineering", "volume": "1022"}, "authors": [{"authorId": "9239833", "name": "K. Kour"}, {"authorId": "47091650", "name": "Deepali Gupta"}, {"authorId": "122290169", "name": "K. Gupta"}, {"authorId": "30674653", "name": "Malvinder Singh Bali"}], "citations": [{"paperId": "3645518e13eab475c4a3e606ae1b8cdb01ae6b7f", "title": "ESSS: Energy Saver Smart Shoes for Energy Harvesting using Multi-Sensors Technique"}, {"paperId": "55c831ec982c57ed30e47857a7f554fa53fc92f9", "title": "IoT-Based Model for Saffron Cultivation and Growth Parameter Analysis and Monitoring by Using AquaCrop"}, {"paperId": "319c3cd6fd15389452fbd957fe048d95cefe0d04", "title": "Design of Sensor Based Walnut Cracking Device and By-Product Classification via K-Means"}, {"paperId": "779fb1d412b13ee21dac4b39853bcb4e54deb721", "title": "IoT and Fog Enabled Model for Saffron Cultivation in Precision Farming"}]}
