{"paperId": "9d6e1cc5e01e13ed5b50bcab13b364d4ac34828b", "publicationVenue": null, "title": "Preliminary Exploration on Node-To-Node Fault Tolerance Coordination in Distributed System", "abstract": "Internet of Things, edge computing devices, the widespread use of artificial intelligence and machine learning applications, and the extensive adoption of cloud computing pose significant challenges to maintaining fault tolerance in distributed systems. As the volume and complexity of systems continue to grow, the probability of system failures also grows, leading to downtime and poor performance. Fault tolerance is pivotal in modern computing systems by preventing downtime and service disruptions, even during failures. However, adopting fault tolerance comes with additional resource consumption, such as memory, CPU, disk, and network bandwidth usage, impacting system performance. Balancing fault tolerance with system performance is crucial to optimize resource utilization while minimizing the costs associated with detecting and recovering from faults. This paper introduces a node-to-node fault tolerance coordination mechanism for distributed systems to facilitate the tradeoff between fault tolerance and the cost of performance penalties and resource consumption. The proposed mechanism is preliminarily implemented on HDFS cluster. Our proposal enables opportunities to minimize the cost of the fault tolerance impact on performance and resource usage compared to the existing fault tolerance coordination mechanism.", "venue": "2023 IEEE International Conference on Computing (ICOCO)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-10-09", "journal": {"name": "2023 IEEE International Conference on Computing (ICOCO)", "pages": "219-224"}, "authors": [{"authorId": "1742456805", "name": "Muntadher Saadoon"}, {"authorId": "2267296681", "name": "Siti Hafizah Ab Hamid"}, {"authorId": "98376355", "name": "Hazrina Sofian"}, {"authorId": "2280949170", "name": "H. Altarturi"}, {"authorId": "2280949168", "name": "Nur Nasuha"}, {"authorId": "3183956", "name": "Z. Azizul"}, {"authorId": "31907999", "name": "Haqi Khalid"}], "citations": []}
