{"paperId": "9d7ac8166989007834b84b023161c90f253e6083", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Three Hierarchical Levels of Big-Data Market Model Over Multiple Data Sources for Internet of Things", "abstract": "This paper proposes three hierarchical levels of a competitive big-data market model. We consider that a service provider gathers data from multiple data sources and provides valuable information from refined data as a service to its customers. Under our approach, a service provider determines optimal data procurement from multiple data sources within its budget constraint. The multiple data sources follow the service provider’s action by independently submitting bidding prices to the service provider. Further, customers decide whether to subscribe or not based on the subscription fee, their willingness-to-pay, and the quality of the refined data. We study the economic benefits of such a market model by analyzing the hierarchical decision making procedures as a Stackelberg game. We show the existence and the uniqueness of the Nash equilibrium (NE), and the NE solution is given as a closed form. Finally, we reveal that the obtained unique equilibrium solution maximizes the payoff of all market participants.", "venue": "IEEE Access", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-06-07", "journal": {"name": "IEEE Access", "pages": "31269-31280", "volume": "6"}, "authors": [{"authorId": "8877893", "name": "Busik Jang"}, {"authorId": "2107883360", "name": "Sangdon Park"}, {"authorId": "2108413586", "name": "Joohyung Lee"}, {"authorId": "134719547", "name": "Sang-Geun Hahn"}], "citations": [{"paperId": "2513b1cb5d47558817af0ba5d8c94be7220131eb", "title": "Quantifying the Data Currency’s Impact on the Profit Made by Data Brokers in the Internet of Things Based Data Marketplace"}, {"paperId": "0f87558eb555bbbcf4b4fc31cf836a1f155c81e6", "title": "An ICN-Based Data Marketplace Model Based on a Game Theoretic Approach Using Quality-Data Discovery and Profit Optimization"}, {"paperId": "4cedfed86ec3e2b54402964f4d393f5da835e5b8", "title": "Growing Process of Communities on Data Platforms: Case Analysis of a COVID-19 Dataset"}, {"paperId": "d474ab264d459614183931297824d5769dc36adf", "title": "Auction-based Federated Learning using Software-defined Networking for resource efficiency"}, {"paperId": "94b73d27826536560e99dcb031ef20296e1ab68e", "title": "FedCCEA : A Practical Approach of Client Contribution Evaluation for Federated Learning"}, {"paperId": "f187ffee17beea6bd4d547ec73b75454a159f045", "title": "Business Data Sharing through Data Marketplaces: A Systematic Literature Review"}, {"paperId": "f603f08f036d9369bc342b3bae96922f9dc201a6", "title": "Market Analysis of Distributed Learning Resource Management for Internet of Things: A Game-Theoretic Approach"}, {"paperId": "a9c609283f78aaf204b2de4c8f20d7f9bad48a51", "title": "Competitive Data Trading Model With Privacy Valuation for Multiple Stakeholders in IoT Data Markets"}, {"paperId": "515193e0624c4b6583e48c098e16551cb7a12e0c", "title": "Data quality and the Internet of Things"}, {"paperId": "0985b3549486372622a1119d819005ff42074e14", "title": "A Decentralized Private Data Transaction Pricing and Quality Control Method"}, {"paperId": "b2defc11a1c4cc100f73bcfeb10e262202ae2d42", "title": "Trusted Data's Marketplace"}, {"paperId": "ead96305485fa382f2185d31d83f6cdb452d2667", "title": "Personal Data Trading Scheme for Data Brokers in IoT Data Marketplaces"}, {"paperId": "3cb491c2ce60785d9e90e0f6c28d44556745fef5", "title": "Deposit Decision Model for Data Brokers in Distributed Personal Data Markets Using Blockchain"}, {"paperId": "6a6df903de77067936c19e6329eba3adebf1c8d9", "title": "Big Data Analytics and Visualization for Food Health Status Determination Using Bigmart Data"}]}
