{"paperId": "9d81b46d73efb680ec25537a0d73a176529825ee", "publicationVenue": {"id": "7fca7065-fa6f-490b-923e-3ffc07857f1c", "name": "IEEE Transactions on Cloud Computing", "type": "journal", "alternate_names": ["IEEE Trans Cloud Comput"], "issn": "2168-7161", "url": "https://www.computer.org/web/tcc", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6245519"]}, "title": "MultiScaler: A Multi-Loop Auto-Scaling Approach for Cloud-Based Applications", "abstract": "Cloud computing offers a wide range of services through a pool of heterogeneous Physical Machines (PMs) hosted on cloud data centers, where each PM can host several Virtual Machines (VMs). Resource sharing among VMs comes with major benefits, but it can create technical challenges that have a detrimental effect on the performance. To ensure a specific service level requested by the cloud-based applications, there is a need for an approach to assign adequate resources to each VM. To this end, we present our novel Multi-Loop Control approach, called MultiScaler, to allocate resources to VMs based on the Service Level Agreement (SLA) requirements and the run-time conditions. MultiScaler is mainly composed of three different levels working closely with each other to achieve an optimal resource allocation. We propose a set of tailor-made controllers to monitor VMs and take actions accordingly to regulate contention among collocated VMs, to reallocate resources if required, and to migrate VMs from one PM to another. The evaluation in a VMware cluster have shown that the MultiScaler approach can meet applications performance goals and guarantee the SLA by assigning the exact resources that the applications require. Compared with sophisticated baselines, MultiScaler produces significantly better reaction to changes in workloads even under the presence of noisy neighbors.", "venue": "IEEE Transactions on Cloud Computing", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-10-16", "journal": {"name": "IEEE Transactions on Cloud Computing", "pages": "2769-2786", "volume": "10"}, "authors": [{"authorId": "1492127297", "name": "Auday Al-Dulaimy"}, {"authorId": "2383231", "name": "J. Taheri"}, {"authorId": "10281628", "name": "A. Kassler"}, {"authorId": "1988483", "name": "M. R. H. Farahabady"}, {"authorId": "145590434", "name": "Shuiguang Deng"}, {"authorId": "9392149", "name": "Albert Y. Zomaya"}], "citations": [{"paperId": "6d5c529f289109039df4a1a7b0495047b1d13288", "title": "Distributed Asynchronous Service Provisioning in the Edge-Cloud Multi-tier Network"}, {"paperId": "1ae28d2b3cd79893b8b5a9e6d0f78612b6bd3d27", "title": "Using Machine Learning to Predict the Exact Resource Usage of Microservice Chains"}, {"paperId": "267157d01e0ffee9d4d9f982151e3d0eb6fb3925", "title": "Dynamic Service Provisioning in the Edge-Cloud Continuum With Bounded Resources"}, {"paperId": "0493dc8bcc02f1f5b930e2f45904f8b4be210a07", "title": "Auto-scaling techniques in container-based cloud and edge/fog computing: Taxonomy and survey"}, {"paperId": "0381eaa750f58f3b047f634861864c5e010e44e1", "title": "ASM-based Formal Model for Analysing Cloud Auto-Scaling Mechanisms"}, {"paperId": "74abafe4960d6e6c594ff8f3b1bfdfcfc24a7576", "title": "K-AGRUED: A Container Autoscaling Technique for Cloud-based Web Applications in Kubernetes Using Attention-based GRU Encoder-Decoder"}, {"paperId": "afe9d8cdf578da9fccdd35804708c813dbdcfdef", "title": "PDIS: A Service Layer for Privacy and Detecting Intrusions in Cloud Computing"}, {"paperId": "4f9d6872a3880b237c9c2b2d81334267fca2bc11", "title": "Why Is It Not Solved Yet?: Challenges for Production-Ready Autoscaling"}, {"paperId": "4a6f54b6426b97f197c59f71d84d52f4b3710288", "title": "Web Auto Configuration for N-Tier in VM based Dynamic Environment by Reinforcement Learning Approach: A Study"}, {"paperId": "830f8e8b1ea0aa7017d88a59531a2b96a43ee4c7", "title": "Dynamic Service Provisioning in the Edge-cloud Continuum with Provable Guarantees"}, {"paperId": "08d9ea3d3b5cc5cf14e1e730e98e2cf06a4aaf6c", "title": "LOOPS: A Holistic Control Approach for Resource Management in Cloud Computing"}, {"paperId": "4674a65aa5756e17864052b4c6940c3d441371e6", "title": "Enhancing disk input output performance in consolidated virtualized cloud platforms using a randomized approximation scheme"}, {"paperId": "2e6320331a0fe4b51f70c9c6139ce1d93168ecef", "title": "Resource Scalability and Security Using Entropy Based Adaptive Krill Herd Optimization for Auto Scaling in Cloud"}, {"paperId": "c5b0789640be01dd2cfcc58b9417b7975f2dcf3c", "title": "Smart Futures Based Resource Trading and Coalition Formation for Real-Time Mobile Data Processing"}, {"paperId": "4fc811e34aa854beece86a03f8b95ca1e27e37e7", "title": "Workload Orchestration in Multi-Access Edge Computing Using Belief Rule-Based Approach"}]}
