{"paperId": "9d81943b1bb796db224be92ac3b715c8d2b5ab92", "publicationVenue": null, "title": "STO2Vec: A Multiscale Spatio-Temporal Object Representation Method for Association Analysis", "abstract": "Spatio-temporal association analysis has attracted attention in various fields, such as urban computing and crime analysis. The proliferation of positioning technology and location-based services has facilitated the expansion of association analysis across spatio-temporal scales. However, existing methods inadequately consider the scale differences among spatio-temporal objects during analysis, leading to suboptimal precision in association analysis results. To remedy this issue, we propose a multiscale spatio-temporal object representation method, STO2Vec, for association analysis. This method comprises of two parts: graph construction and embedding. For graph construction, we introduce an adaptive hierarchical discretization method to distinguish the varying scales of local features. Then, we merge the embedding method for spatio-temporal objects with that for discrete units, establishing a heterogeneous graph. For embedding, to enhance embedding quality for homogeneous and heterogeneous data, we use biased sampling and unsupervised models to capture the association strengths between spatio-temporal objects. Empirical results using real-world open-source datasets show that STO2Vec outperforms other models, improving accuracy by 16.25% on average across diverse applications. Further case studies indicate STO2Vec effectively detects association relationships between spatio-temporal objects in a range of scenarios and is applicable to tasks such as moving object behavior pattern mining and trajectory semantic annotation.", "venue": "ISPRS Int. J. Geo Inf.", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-21", "journal": {"name": "ISPRS Int. J. Geo Inf.", "pages": "207", "volume": "12"}, "authors": [{"authorId": "2118767987", "name": "Nanyu Chen"}, {"authorId": "2151781", "name": "Anran Yang"}, {"authorId": "2115384754", "name": "Luo Chen"}, {"authorId": "2055448528", "name": "W. Xiong"}, {"authorId": "47838875", "name": "Ning Jing"}], "citations": []}
