{"paperId": "9d84dad8aec5db9910aa5297e8090483c70c1911", "publicationVenue": {"id": "6806a4fd-e465-4e63-aa7f-b8151ddee3a4", "name": "Inflammatory Bowel Diseases", "type": "journal", "alternate_names": ["Inflamm Bowel Dis"], "issn": "1078-0998", "url": "http://onlinelibrary.wiley.com/journal/10.1002/(issn)1536-4844"}, "title": "IBD Systems Biology Is Here to Stay.", "abstract": "BACKGROUND\nSystems biology is a rapidly advancing field of science that allows us to look into disease mechanisms, patient diagnosis and stratification, and drug development in a completely new light. It is based on the utilization of unbiased computational systems free of the traditional experimental approaches based on personal choices of what is important and what select experiments should be performed to obtain the expected results.\n\n\nMETHODS\nSystems biology can be applied to inflammatory bowel disease (IBD) by learning basic concepts of omes and omics and how omics-derived \"big data\" can be integrated to discover the biological networks underlying highly complex diseases like IBD. Once these biological networks (interactomes) are identified, then the molecules controlling the disease network can be singled out and specific blockers developed.\n\n\nRESULTS\nThe field of systems biology in IBD is just emerging, and there is still limited information on how to best utilize its power to advance our understanding of Crohn disease and ulcerative colitis to develop novel therapeutic strategies. Few centers have embraced systems biology in IBD, but the creation of international consortia and large biobanks will make biosamples available to basic and clinical IBD investigators for further research studies.\n\n\nCONCLUSIONS\nThe implementation of systems biology is indispensable and unavoidable, and the patient and medical communities will both benefit immensely from what it will offer in the near future.", "venue": "Inflammatory Bowel Diseases", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-01-13", "journal": {"name": "Inflammatory bowel diseases"}, "authors": [{"authorId": "3119988", "name": "C. Fiocchi"}, {"authorId": "86899300", "name": "D. Iliopoulos"}], "citations": [{"paperId": "53d2b0c5fa2e3873e0229fef46adf3f0feb143c5", "title": "High-throughput omics technologies in inflammatory bowel disease."}, {"paperId": "39258d2f9665cb2058a2bdcfb11ac3c9bbc51e90", "title": "Inflammatory bowel disease biomarkers revealed by the human gut microbiome network"}, {"paperId": "ed6bd9a131bf0915a25eaec00701087f4e60c4fe", "title": "Modeling of Treatment Outcomes with Tofacitinib Maintenance Therapy in Patients with Ulcerative Colitis: A Post Hoc Analysis of Data from the OCTAVE Clinical Program."}, {"paperId": "57fea2b16921a1e454544cdd4604188de9951b0b", "title": "Clinical Value of Multiomics-Based Biomarker Signatures in Inflammatory Bowel Diseases: Challenges and Opportunities"}, {"paperId": "a83929b9766f23042e409bbd42b12aca7f7d144c", "title": "Personalized redox medicine in inflammatory bowel diseases: an emerging role for HIF-1α and NRF2 as therapeutic targets"}, {"paperId": "25f423091509b3be3adef127b5361063c2a2b07b", "title": "Sinomenine attenuated dextran sulfate sodium-induced inflammatory responses by promoting 14-3-3θ protein and inhibiting NF-κB signaling."}, {"paperId": "0e57c6fec27c62b2bcb17b111302ec9c3be8c1d3", "title": "Network analysis of a complex disease: the gut microbiota in the inflammatory bowel disease case"}, {"paperId": "d05e134fccb68e490bd77f9d82a33697a896919d", "title": "Network location and clustering of genetic mutations determine chronicity in a stylized model of genetic diseases"}, {"paperId": "94082d6b704fe816942be8dffa2859f4ce3864f8", "title": "Systems Biology of Gut Microbiota-Human Receptor Interactions: Toward Anti-inflammatory Probiotics"}, {"paperId": "1d1da654f7c167f39ea17925c884e06c77fedbd5", "title": "microRNAs and long non‐coding RNAs as biomarkers for polycystic ovary syndrome"}, {"paperId": "bf1525946e2d92b550a5811d667989080e204e82", "title": "Biomarker discovery for personalized therapy selection in inflammatory bowel diseases: Challenges and promises"}, {"paperId": "9c4537b203113177c1ee4e3661fa0e6604c1e3fd", "title": "Network Biology Approaches to Achieve Precision Medicine in Inflammatory Bowel Disease"}]}
