{"paperId": "9d91963cc151f010b01e92934a33ebf9bed43d65", "publicationVenue": {"id": "c7f172d9-d501-4df1-8a92-0f54f60b85d5", "name": "Jurnal Informatika Polinema", "alternate_names": ["J Inform Polinema"], "issn": "2407-070X", "url": "http://jip.polinema.ac.id/"}, "title": "ANALISIS QOS (QUALITY OF SERVICE) SISTEM MONITORING PINTAR MITIGASI PENULARAN COVID-19 BERBASIS IOT", "abstract": "Sistem monitoring pintar mitigasi COVID-19 adalah sistem monitoring berbasis teknologi IoT yang menggunakan beberapa sensor untuk merekam keadaan di sekitar lokasi pemantauan dan memberikan rekomendasi kepada pengguna berdasarkan data yang diambil disekitar area pemantauan. Salah satu aspek yang harus diperhatikan dalam membangun system monitoring berbasis IoT adalah kualitas layanan jaringan (Quality of Service). Kualitas layanan jaringan digunakan sebagai tolak ukur untuk memastikan perangkat IoT dapat berkomunikasi dengan baik didalam suatu jaringan nirkabel. Penelitian ini bertujuan untuk melakukan analisis kualitas layanan jaringan pada sistem monitoring pintar mitigasi penularan COVID-19 berbasis IoT. Adapun aspek yang diukur adalah delay, packet lost, jitter dan throughput, dimana pengukuran parameter ini berguna untuk mengetahui tingkat peforma sistem monitoring dalam menangani permintaan layanan API dari sensor node ke web server. Berdasarkan hasil pengujian yang telah dilakukan terhadap 2 perangkat sensor node menunjukkan bahwa kinerja QoS pada perangkat sensor node ESP8266 lebih baik dibandingkan dengan ESP32. Sedangkan parameter delay yang dihasilkan pada kedua perangkat sensor node jika bekerja secara bersamaan menunjukkan bahwa kedua perangkat sensor node yang diuji memiliki delay dengan kategori buruk.", "venue": "Jurnal Informatika Polinema", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-04-16", "journal": {"name": "Jurnal Informatika Polinema"}, "authors": [{"authorId": "2081766643", "name": "D. Enda"}, {"authorId": "66997918", "name": "Muhammad Asep Subandri"}, {"authorId": "2162747031", "name": "Supria"}], "citations": [{"paperId": "b6c672aed5d282fb272a4d610f681f6fb9b07adc", "title": "COMPARING THE PERFORMANCE OF OSPF AND OSPF-MPLS ROUTING PROTOCOL IN FORWARDING TCP AND UDP PACKET"}, {"paperId": "f585808575a9a06b8e1ddd30ac5404879d30aa60", "title": "Analytics of ESPCam on Arduino-Based Automatic Clothesline Protectors"}]}
