{"paperId": "9d9c1c340a6ada8cf562ab462eabdd7b8079374b", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Security in Internet of Things: A Review", "abstract": "Internet of Things (IoT) is the paramount virtual network that enables remote users to access connected multimedia devices. It has dragged the attention of the community because it encompasses real-world scenarios with implicit environs. Despite several beneficial aspects, IoT is surrounded by provocations for successful implementation, as data travels in different layers. One of the critical challenges is the security of the data in these layers. Researchers conducted numerous studies focusing on the level of security at a single technique, creating loopholes to address the entire scenario of securing an IoT network. This study aims to comprehensively review current security issues, wireless communication techniques, and technologies for securing IoT. This work’s utmost significance is addressing all the security perspectives at a glance. For this purpose, research contributions from the previous years are investigated for better understanding. Some countermeasures and snags from security perspectives have also been analyzed in detail concerning the current industry trends. Blockchain, machine learning, fog, and edge computing are possible solutions to secure IoT. After studying these techniques and their immunity to attacks, machine learning can become a hope if incorporated with end-to-end security. This comprehensive review will provide adequate understanding and knowledge in defining security lines of action for the successful implementation of IoT.", "venue": "IEEE Access", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "104649-104670", "volume": "10"}, "authors": [{"authorId": "153630687", "name": "N. Khan"}, {"authorId": "2872282", "name": "Azlan Awang"}, {"authorId": "102654673", "name": "Samsul Ariffin Abdul Karim"}], "citations": [{"paperId": "34ece5f762d50465ee187a51f45a810c8188c0ab", "title": "Framework to perform taint analysis and security assessment of IoT devices in smart cities"}, {"paperId": "94f2ad16da094b04e086a6688208ee3706cf7c83", "title": "A Systematic Literature Review of Cyber Security and Privacy in IoT Devices"}, {"paperId": "8f618dbb2c0fbbc6c8e29e7571b5b9580e164571", "title": "Security and Internet of Things: Benefits, Challenges, and Future Perspectives"}]}
