{"paperId": "9dc4c1b88482cf85ea079e7d57506dead5493e67", "publicationVenue": {"id": "3096eb5c-d18c-4877-94cd-28edd3a9c357", "name": "International Journal of Environmental Research and Public Health", "type": "journal", "alternate_names": ["Int J Environ Res Public Health"], "issn": "1660-4601", "url": "http://www.mdpi.com/journal/ijerph/"}, "title": "Analysis of Perception Accuracy of Roadside Millimeter-Wave Radar for Traffic Risk Assessment and Early Warning Systems", "abstract": "Millimeter-wave (MMW) radar is essential in roadside traffic perception scenarios and traffic safety control. For traffic risk assessment and early warning systems, MMW radar provides real-time position and velocity measurements as a crucial source of dynamic risk information. However, due to MMW radar’s measuring principle and hardware limitations, vehicle positioning errors are unavoidable, potentially causing misperception of the vehicle motion and interaction behavior. This paper analyzes the factors influencing the MMW radar positioning accuracy that are of major concern in the application of transportation systems. An analysis of the radar measuring principle and the distributions of the radar point cloud on the vehicle body under different scenarios are provided to determine the causes of the positioning error. Qualitative analyses of the radar positioning accuracy regarding radar installation height, radar sampling frequency, vehicle location, posture, and size are performed. The analyses are verified through simulated experiments. Based on the results, a general guideline for radar data processing in traffic risk assessment and early warning systems is proposed.", "venue": "International Journal of Environmental Research and Public Health", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-01-01", "journal": {"name": "International Journal of Environmental Research and Public Health", "volume": "20"}, "authors": [{"authorId": "2112446414", "name": "Cong Zhao"}, {"authorId": "2199566572", "name": "Delong Ding"}, {"authorId": "2183750027", "name": "Zhouyang Du"}, {"authorId": "2199617058", "name": "Yupeng Shi"}, {"authorId": "2058270772", "name": "Guimin Su"}, {"authorId": "144958138", "name": "Shanchuan Yu"}], "citations": [{"paperId": "74e03ec4d1cbd512b479a56f4513acc0de79e5a4", "title": "Target Tracking Algorithm Based on Adaptive Strong Tracking Extended Kalman Filter"}, {"paperId": "22106e99ac1b0c223e08ebc284c27e55a7244052", "title": "Development and experiment of an intelligent connected cooperative vehicle infrastructure system based on multiple V2I modes and BWM-IGR method"}, {"paperId": "fe75bd0b87f29fb50c7173a287595582bc2dd694", "title": "Human Movement Recognition Based on 3D Point Cloud Spatiotemporal Information from Millimeter-Wave Radar"}, {"paperId": "6682d726621d82c4177691ea3ffb2557a2fb85bd", "title": "Trustworthiness Assessment for Crowdsourcing-Based Citywide Parking Availability Sensing via Connected and Automated Vehicles"}, {"paperId": "e973d0f77ae1a139af46a8d190500e098c06118f", "title": "Ensuring resilience: Integrating IT disaster recovery planning and business continuity for sustainable information technology operations"}, {"paperId": "f0cb80a271fe46edad2874f1ab24051eca10ca54", "title": "Understanding traffic bottlenecks of long freeway tunnels based on a novel location-dependent lighting-related car-following model"}, {"paperId": "54f21067ebca808c375b6096205c6c8d99695c29", "title": "Modeling automatic pavement crack object detection and pixel-level segmentation"}, {"paperId": "b4880ec830c7c1d4d0c435a89f1c3efacab66b4b", "title": "Data-Driven Indoor Positioning Correction for Infrastructure-Enabled Autonomous Driving Systems: A Lifelong Framework"}, {"paperId": "7b0857e277b2776f61ea7285efaf2f91856f62b8", "title": "TriPField: A 3D Potential Field Model and Its Applications to Local Path Planning of Autonomous Vehicles"}, {"paperId": "3d740b73166acc4d2bb9ad0ff77a987ec84dfb74", "title": "A General Framework for Reconstructing Full-Sample Continuous Vehicle Trajectories Using Roadside Sensing Data"}, {"paperId": "5b2c6c42852ff4b779ce6812bfd04c92f80bf1ba", "title": "Safe, Efficient, and Comfortable Autonomous Driving Based on Cooperative Vehicle Infrastructure System"}]}
