{"paperId": "9dddc3fb60d048b42e76ed1e8ce711097688c515", "publicationVenue": {"id": "61b6d6d2-025c-4257-83a0-9a2f068c583d", "name": "Journal of Enterprise Information Management", "type": "journal", "alternate_names": ["J Enterp Inf Manag"], "issn": "1741-0398", "url": "https://www.emerald.com/insight/publication/issn/1741-0398"}, "title": "One decade of big data for firms' competitiveness: insights and a conceptual model from bibliometrics", "abstract": "PurposeUsing analytics for firms' competitiveness is a vital component of a company's strategic planning and management process. In recent years, organizations have started to capitalize on the significant use of big data for analyses to gain valuable insights to improve decision-making processes. In this regard, leveraging and unleashing the potential of big data has become a significant success factor for steering firms' competitiveness, and the related literature is increasing at a very high pace. Thus, the authors propose a bibliometric study to understand the most important insights from these studies and enrich existing conceptual models.Design/methodology/approachIn this study, the authors use a bibliometric review on articles related to the use of big data for firms' competitiveness. The authors examine the contributions of research constituents (authors, institutions, countries and journals) and their structural and thematic relationships (collaborations, co-citations networks, co-word networks, thematic trends and thematic map). The most important insights are used to enrich a conceptual model.FindingsBased on the performance analysis results, the authors found that China is by far the most productive country in this research field. However, in terms of influence (by the number of citations per article), the most influential countries are the UK, Australia and the USA, respectively. Based on the science mapping analysis results, the most important findings are projected in the common phases of competitive intelligence processes and include planning and directions concepts, data collection concepts, data analysis concepts, dissemination concepts and feedback concepts. This projection is supplemented by cross-cutting themes such as digital transformation, cloud computing, privacy, data science and competition law. Three main future research directions are identified: the broadening of the scope of application fields, the specific case of managing or anticipating the consequences of pandemics or high disruptive events such as COVID-19 and the improvement of connection between firms' competitiveness and innovation practices in a big data context.Research limitations/implicationsThe findings of this study show that the most important research axis in the existing literature on big data and firms' competitiveness are mostly related to common phases of competitive intelligence processes. However, concepts in these phases are strongly related to the most important dimensions intrinsic to big data. The use of a single database (Scopus) or the selected keywords can lead to bias in this study. Therefore, to address these limitations, future studies could combine different databases (i.e. Web of Science and Scopus) or different sets of keywords.Practical implicationsThis study can provide to practitioners the most important concepts and future directions to deal with for using big data analytics to improve their competitiveness.Social implicationsThis study can help researchers or practitioners to identify potential research collaborators or identify suitable sources of publications in the context of big data for firms' competitiveness.Originality/valueThe authors propose a conceptual model related to big data and firms' competitiveness from the outputs of a bibliometric study.", "venue": "Journal of Enterprise Information Management", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-07-19", "journal": {"name": "J. Enterp. Inf. Manag.", "pages": "1421-1453", "volume": "36"}, "authors": [{"authorId": "2082474532", "name": "Dieudonné Tchuente"}, {"authorId": "2492781", "name": "Anass El Haddadi"}], "citations": [{"paperId": "4f84a8c0cdef11fa36ff889cab4ea35d66652e57", "title": "Leveraging Business Intelligence Systems for Enhanced Corporate Competitiveness: Strategy and Evolution"}, {"paperId": "d90f03915b882c6e8d22415c30920079070ff592", "title": "Impact of artificial intelligence on aeronautics: An industry-wide review"}, {"paperId": "de1594cad0face20ac41075165e016f51741598f", "title": "Do knowledge sharing and big data analytics capabilities matter for green absorptive capacity and green entrepreneurship orientation? Implications for green innovation"}, {"paperId": "905ba361c618ef0707faa2f36029766d2b62d9d9", "title": "Big data analytics and market performance: the roles of customization and personalization strategies and competitive intensity"}]}
