{"paperId": "9dde49c2fd168fe7c74942e222667da75319c365", "publicationVenue": {"id": "bdc2e585-4e48-4e36-8af1-6d859763d405", "name": "AAAI Conference on Artificial Intelligence", "type": "conference", "alternate_names": ["National Conference on Artificial Intelligence", "National Conf Artif Intell", "AAAI Conf Artif Intell", "AAAI"], "url": "http://www.aaai.org/"}, "title": "Integer Is Enough: When Vertical Federated Learning Meets Rounding", "abstract": "Vertical Federated Learning (VFL) is a solution increasingly used by companies with the same user group but differing features, enabling them to collaboratively train a machine learning model. \nVFL ensures that clients exchange intermediate results extracted by their local models, without sharing raw data. \nHowever, in practice, VFL encounters several challenges, such as computational and communication overhead, privacy leakage risk, and adversarial attack. \nOur study reveals that the usage of floating-point (FP) numbers is a common factor causing these issues, as they can be redundant and contain too much information. \nTo address this, we propose a new architecture called rounding layer, which converts intermediate results to integers. \nOur theoretical analysis and empirical results demonstrate the benefits of the rounding layer in reducing computation and memory overhead, providing privacy protection, preserving model performance, and mitigating adversarial attacks. \nWe hope this paper inspires further research into novel architectures to address practical issues in VFL.", "venue": "AAAI Conference on Artificial Intelligence", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2024-03-24", "journal": {"pages": "14704-14712"}, "authors": [{"authorId": "144883941", "name": "Pengyu Qiu"}, {"authorId": "2184142286", "name": "Yuwen Pu"}, {"authorId": "2293567050", "name": "Yongchao Liu"}, {"authorId": "2293568847", "name": "Wenyan Liu"}, {"authorId": "2293457221", "name": "Yun Yue"}, {"authorId": "2293558137", "name": "Xiaowei Zhu"}, {"authorId": "2293445241", "name": "Lichun Li"}, {"authorId": "2276254110", "name": "Jinbao Li"}, {"authorId": "2293594032", "name": "Shouling Ji"}], "citations": []}
