{"paperId": "9deb7d4835e18034008e65e7e55c2578135b99a9", "publicationVenue": {"id": "22af107a-3e64-455e-92c6-82141a5a7e6a", "name": "IET Networks", "type": "conference", "alternate_names": ["IET Netw", "IET networks", "IET netw", "International Conference on Information and Emerging Technologies", "IET", "Int Conf Inf Emerg Technol"], "issn": "2047-4954", "url": "http://www.ietdl.org/IET-NET", "alternate_urls": ["https://digital-library.theiet.org/content/journals/iet-net"]}, "title": "Hadoop framework for efficient sentiment classification using trees", "abstract": "Due to the increase in the speed of generation of data, the authors are forced to handle a massive volume of data with the help of conventional machine learning algorithms. Big data is an enormous volume of data which is beyond the capacity of the traditional database software tool to collect, store, manage, and process within a stipulated time limit. Sentiment analysis is analysing the data by classifying the text on the basis of strength and polarity of opinion (positive/negative) words that define the text. While handling big data, Hadoop provides a platform for users to develop their own sentiment analysis with the help of a lexicon dictionary or available application programming interface (API) or external programs. The aim of classifying data is to analyse extensive data and develop an appropriate description or model for every organised class with the feature present in the data. In this work, the feature extraction based on term frequency-inverse document frequency is utilised and the Hadoop framework in attaining a useful classification with the help of random forest techniques.", "venue": "IET Networks", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-06-08", "journal": {"name": "IET Networks", "pages": "223-228", "volume": "9"}, "authors": [{"authorId": "153828816", "name": "K. Sridharan"}, {"authorId": "9154830", "name": "G Komarasamy"}, {"authorId": "144910817", "name": "S. Raja"}], "citations": [{"paperId": "bf008b7ab7224a6c5381d409af819e3df6b855d6", "title": "Replication-Based Query Management for Resource Allocation Using Hadoop and MapReduce over Big Data"}, {"paperId": "23ced2e48f55fc4d30fa3b0514a086870335560d", "title": "Harmony Gradient Boosting Random Forest Machine Learning Algorithms for Sentiment Classification"}, {"paperId": "9244f688d5ece00d1122539a11ef08b1ef6162fa", "title": "A Comparative Study Of Sentiment Analysis For Big Data On Hadoop"}, {"paperId": "8db6fb0c222c2e73e67252e21a1d735a69c28bc2", "title": "Design of college education evaluation based on accompanying data acquisition and mathematical analysis"}, {"paperId": "c9658fc1fb9a1c09884f39d0779118cabb2e7748", "title": "Otellere İlişkin Çevrimiçi Geribildirimlerin Makine Öğrenmesi Yöntemleriyle Duygu Analizi (Sentiment Analysis of Online Feedbacks on Hotels via Machine Learning Methods)"}, {"paperId": "528c5641f3a892069aca5336ac4fe8e06de7aebb", "title": "Distributed Singular Value Decomposition Method for Fast Data Processing in Recommendation Systems"}, {"paperId": "485369a6b907278b02c3c5b612d227eee18cdfdb", "title": "Sentiment Classification of Social Network Text Based on AT-BiLSTM Model in a Big Data Environment"}]}
