{"paperId": "9e17fcae79897b502fde27087ca419cf9af547ff", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Enhancing the Access Privacy of IDaaS System Using SAML Protocol in Fog Computing", "abstract": "Fog environment adoption rate is increasing day by day in the industry. Unauthorized accessing of data occurs due to the preservation of Identity and information of the users either at the endpoints or at the middleware. This paper proposes a methodology to protect and preserve the Identity during data transmission of the users. It uses fog computing for storage against security issues in the cloud and database environment. Cloud and database architectures failed to protect the data and Identity of users but the Fog computing based Identity management as a service (IDaaS) system can handle it with Security Assertion Mark-up Language (SAML) protocol and Pentatope based Elliptic Curve Crypto cipher. A detailed comparative study of the proposed and existing techniques is investigated by considering multi-authentication dialogue, security services, service providers, Identity, and access management.", "venue": "IEEE Access", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "168793-168801", "volume": "8"}, "authors": [{"authorId": "3071631", "name": "C. Rupa"}, {"authorId": "30626672", "name": "Rizwan Patan"}, {"authorId": "1410064789", "name": "F. Al-turjman"}, {"authorId": "2860068", "name": "L. Mostarda"}], "citations": [{"paperId": "aff5c8cf5702352167cba28ce1f50bd71bca47e4", "title": "Security, trust and privacy risks, responses, and solutions for high-speed smart cities networks: A systematic literature review"}, {"paperId": "554fc1f696960596e2740e8b3a87e56cc2a874a6", "title": "Security analysis of fog computing environment for ensuring the security and privacy of information"}, {"paperId": "0f73b850adfff4d1b86c5c8e544cb07e4f4b49f6", "title": "Analysis of Security Access Control Systems in Fog Computing Environment"}, {"paperId": "e59bbf7ad64a1360c66b15cd44bd1d8ab66d68e5", "title": "Single Identity System for Identification papers based on Blockchain"}, {"paperId": "dff20d0011d6059a26091fb7b210aa280b346903", "title": "Knowledge engineering-based DApp using blockchain technology for protract medical certificates privacy"}, {"paperId": "a2c98eafc434f214332d232442b45cd273e0e0b1", "title": "Sustainability 4.0 and its applications in the field of manufacturing"}, {"paperId": "378efacacb2ec4cb2ccd2b1102496469d9cc14af", "title": "Energy-efficient and secure mobile fog-based cloud for the Internet of Things"}, {"paperId": "d51922f80ecf53106af53909c434b3473f716438", "title": "TrustBuilder: A non-repudiation scheme for IoT cloud applications"}, {"paperId": "50d6db198820521c69bbe3d4df9b38a0e93e5407", "title": "Fog computing security and privacy issues, open challenges, and blockchain solution: An overview"}, {"paperId": "6cbf495efc30df1b9d3218bd07469ea0a562fefb", "title": "Blockchain technology as a Fog computing security and privacy solution: An overview"}, {"paperId": "010e128ab9df4983b461f96d705202b0709954ed", "title": "Microsoft Azure active directory for next level authentication to provide a seamless single sign-on experience"}, {"paperId": "8f85703ed897ac3c0e066a32056b7e9c46b6a962", "title": "Fog computing security and privacy for the Internet of Thing applications: State‐of‐the‐art"}, {"paperId": "309430827c2db82774d47c349a6f2c8091f274ed", "title": "Security Provision by Using Detection and Prevention Methods to Ensure Trust in Edge-Based Smart City Networks"}, {"paperId": "0e3e332825ff5fd83157e75dc080b31db7484208", "title": "FOG COMPUTING ARCHITECTURE, BENEFITS, SECURITY, AND PRIVACY, FOR THE INTERNET OF THING APPLICATIONS: AN OVERVIEW"}]}
