{"paperId": "9e1ebbf969d9b016493f9bb470906b565e9630fa", "publicationVenue": {"id": "d15de38e-624e-444b-b630-fd567d2d3ccd", "name": "Journal of Atmospheric and Oceanic Technology", "type": "journal", "alternate_names": ["J Atmospheric Ocean Technol"], "issn": "0739-0572", "url": "http://www.ametsoc.org/pubs/journals/jtech/", "alternate_urls": ["http://journals.ametsoc.org/toc/atot/current"]}, "title": "Argovis: A Web Application for Fast Delivery, Visualization, and Analysis of Argo Data", "abstract": "Since the mid-2000s, the Argo oceanographic observational network has provided near-real-time four-dimensional data for the global ocean for the first time in history. Internet (i.e., the “web”) applications that handle the more than two million Argo profiles of ocean temperature, salinity, and pressure are an active area of development. This paper introduces a new and efficient interactive Argo data visualization and delivery web application named Argovis that is built on a classic three-tier design consisting of a front end, back end, and database. Together these components allow users to navigate 4D data on a world map of Argo floats, with the option to select a custom region, depth range, and time period. Argovis’s back end sends data to users in a simple format, and the front end quickly renders web-quality figures. More advanced applications query Argovis from other programming environments, such as Python, R, and MATLAB. Our Argovis architecture allows expert data users to build their own functionality for specific applications, such as the creation of spatially gridded data for a given time and advanced time–frequency analysis for a space–time selection. Argovis is aimed to both scientists and the public, with tutorials and examples available on the website, describing how to use the Argovis data delivery system—for example, how to plot profiles in a region over time or to monitor profile metadata.", "venue": "Journal of Atmospheric and Oceanic Technology", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2019-03-01", "journal": {"name": "Journal of Atmospheric and Oceanic Technology"}, "authors": [{"authorId": "31818591", "name": "T. tucker"}, {"authorId": "104807608", "name": "D. Giglio"}, {"authorId": "98418008", "name": "M. Scanderbeg"}, {"authorId": "49516629", "name": "S. Shen"}], "citations": [{"paperId": "97116de1108af04c683c62a4c3735f4e0070d924", "title": "Argo Reveals the Scales and Provenance of Equatorial Island Upwelling Systems"}, {"paperId": "113789a205b7beb49afcb4de45afa9ad2bf1c50c", "title": "argodata: An R interface to oceanographic data from the International Argo Program"}, {"paperId": "21e1894b2f48626c3f007f96161dc2337f565448", "title": "argoFloats: An R Package for Analyzing Argo Data"}, {"paperId": "c98509aa4f4bb14b53d301a187d690e5b3f1a63e", "title": "4DVD visualization and delivery of the 20th century reanalysis data: methods and examples"}]}
