{"paperId": "9e21a6efb60948962b6e49088b701f91631ecfca", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Assessment of Landslide Susceptibility Combining Deep Learning with Semi-Supervised Learning in Jiaohe County, Jilin Province, China", "abstract": "Accurate and timely landslide susceptibility mapping (LSM) is essential to effectively reduce the risk of landslide. In recent years, deep learning has been successfully applied to landslide susceptibility assessment due to the strong ability of fitting. However, in actual applications, the number of labeled samples is usually not sufficient for the training component. In this paper, a deep neural network model based on semi-supervised learning (SSL-DNN) for landslide susceptibility is proposed, which makes full use of a large number of spatial information (unlabeled data) with limited labeled data in the region to train the mode. Taking Jiaohe County in Jilin Province, China as an example, the landslide inventory from 2000 to 2017 was collected and 12 metrological, geographical, and human explanatory factors were compiled. Meanwhile, supervised models such as deep neural network (DNN), support vector machine (SVM), and logistic regression (LR) were implemented for comparison. Then, the landslide susceptibility was plotted and a series of evaluation tools such as class accuracy, predictive rate curves (AUC), and information gain ratio (IGR) were calculated to compare the prediction of models and factors. Experimental results indicate that the proposed SSL-DNN model (AUC = 0.898) outperformed all the comparison models. Therefore, semi-supervised deep learning could be considered as a potential approach for LSM.", "venue": "Applied Sciences", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2020-08-14", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "1609247773", "name": "Jingyu Yao"}, {"authorId": "9215202", "name": "Shengwu Qin"}, {"authorId": "93441768", "name": "S. Qiao"}, {"authorId": "67007591", "name": "W. Che"}, {"authorId": "2144354544", "name": "Yang Chen"}, {"authorId": "2047193111", "name": "Gang Su"}, {"authorId": "2070107091", "name": "Qiang Miao"}], "citations": [{"paperId": "6a62bd0a2ed97749e18ed46fde20f618a7347bff", "title": "Semi-supervised deep learning based on label propagation algorithm for debris flow susceptibility assessment in few-label scenarios"}, {"paperId": "c689e305238f5b5583fd09ff86507b3b95994d46", "title": "Debris flow susceptibility assessment based on boosting ensemble learning techniques: a case study in the Tumen River basin, China"}, {"paperId": "764308a8c14326823cea06a00703f14c2bb12e32", "title": "Optimizing Geo-Hazard Response: LBE-YOLO’s Innovative Lightweight Framework for Enhanced Real-Time Landslide Detection and Risk Mitigation"}, {"paperId": "a696d5b24db5a5b0ad0cb39842353be74a667902", "title": "Landslide risk assessment integrating susceptibility, hazard, and vulnerability analysis in Northern Pakistan"}, {"paperId": "bfd22f0278b408272fdbcc0ec10aa0ab3b80c882", "title": "Landslide Hazard Risk Assessment Based\non Disaster Bearing Body: a Case Study\nof Heitai Landslide Group in Yongjing County,\nGansu Province"}, {"paperId": "baa9674b191887fadb838402edc12021a42891a1", "title": "Landslide susceptibility prediction by gray wolf optimized support vector machine model under different factor states"}, {"paperId": "2624a160957239aa8290b3510b82f72d67aafd95", "title": "A Novel Heterogeneous Ensemble Framework Based on Machine Learning Models for Shallow Landslide Susceptibility Mapping"}, {"paperId": "7658fd05216b4c9d11cfc35748b68fb6c2cc27d2", "title": "Debris flow susceptibility assessment based on information value and machine learning coupling method: from the perspective of sustainable development"}, {"paperId": "dbe741e2725ec74ac6a99b6562700c4e8cec2e75", "title": "Exploring Machine Learning Models for Soil Nutrient Properties Prediction: A Systematic Review"}, {"paperId": "b51eb90d395cf65c7989a5cb90936b7c2c73ae7f", "title": "Comparison of optimized data-driven models for landslide susceptibility mapping"}, {"paperId": "6ed9ed7a4fcd8683fd7c5d7378a8d93cc18a7315", "title": "Joint Effects and Spatiotemporal Characteristics of the Driving Factors of Landslides in Earthquake Areas"}, {"paperId": "4e94f7496deef4f632d5c1da8a32de664919fa1f", "title": "Landslide susceptibility mapping and dynamic response along the Sichuan-Tibet transportation corridor using deep learning algorithms"}, {"paperId": "34b08f06197819bac38ba46b25e718b9861b812c", "title": "Deep Learning-Based Speech Enhancement Algorithm Using Charlier Transform"}, {"paperId": "737dfafa721ee0fe288d7ab3052885167189a466", "title": "Landslide Susceptibility Modeling Using a Deep Random Neural Network"}, {"paperId": "4ba1def0f5ada61d2f1b9eb5aed6e6c9c77695ac", "title": "Implementation of free and open-source semi-automatic feature engineering tool in landslide susceptibility mapping using the machine-learning algorithms RF, SVM, and XGBoost"}, {"paperId": "6127b49440dbe685b681594a6fcd5d5eaa4b6e76", "title": "Improving Landslide Recognition on UAV Data through Transfer Learning"}, {"paperId": "93b149c9a08fb9a35b4d582cff1163de5188a813", "title": "Establishing a GIS-based evaluation method considering spatial heterogeneity for debris flow susceptibility mapping at the regional scale"}, {"paperId": "ac11e4d9065628b608516fb535dd009c96f26ba9", "title": "Landslide Susceptibility Prediction Based on High-Trust Non-Landslide Point Selection"}, {"paperId": "d64380b9c143788d0b225e880b4bfba38e222c09", "title": "Application of a two-step sampling strategy based on deep neural network for landslide susceptibility mapping"}, {"paperId": "87128e29376dec8391d3cb4ff47e3d1434e358ad", "title": "Convolutional neural network (CNN) with metaheuristic optimization algorithms for landslide susceptibility mapping in Icheon, South Korea."}, {"paperId": "df9e5cb184993505dab95db755872f09908fff04", "title": "Analysis of Changes in Landslide Susceptibility according to Land Use over 38 Years in Lixian County, China"}, {"paperId": "2694aa9c77b961986042f04d413c9f965ecc6327", "title": "Landslide Detection from Open Satellite Imagery Using Distant Domain Transfer Learning"}, {"paperId": "552275ac5d49ff4407c7f191e51a1eee99d621e1", "title": "Evaluation of landslide susceptibility of the Ya’an–Linzhi section of the Sichuan–Tibet Railway based on deep learning"}, {"paperId": "afb98b64888fdcbcb76f8a537ce771d03440f198", "title": "Measuring landslide vulnerability status of Chukha, Bhutan using deep learning algorithms"}, {"paperId": "29213c8cb7407662b1cb9b08dd6d0e6dbd04c2f3", "title": "Development of a region-partitioning method for debris flow susceptibility mapping"}, {"paperId": "25d13f411793f6fefac53403290dd6f930ddaf99", "title": "Exploring the impact of introducing a physical model into statistical methods on the evaluation of regional scale debris flow susceptibility"}, {"paperId": "ae53fd0939ced208aa50b6ec0be31816eabcef41", "title": "Predicting and Interpreting Students’ Grades in Distance Higher Education through a Semi-Regression Method"}, {"paperId": "670bcee2c2f8168a7afda550e4cfa057661bdfa7", "title": "Machine learning for power outage prediction during hurricanes: An extensive review"}]}
