{"paperId": "9e2f8c93961b93fa91b016079138b5e7a2db4857", "publicationVenue": {"id": "e95c8d18-09be-464f-a3cf-5b2637f0eff6", "name": "Algorithms", "type": "journal", "issn": "1999-4893", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-150910", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-150910", "http://www.mdpi.com/journal/algorithms", "http://www.mdpi.com/journal/algorithms/"]}, "title": "A Survey of Intellectual Property Rights Protection in Big Data Applications", "abstract": "Big Data applications have the potential to transform any digital business platform by enabling the analysis of vast amounts of data. However, the biggest problem with Big Data is breaking down the intellectual property barriers to using that data, especially for cross-database applications. It is a challenge to achieve this trade-off and overcome the difficulties of Big Data, even though intellectual property restrictions have been developed to limit misuse and regulate access to Big Data. This study examines the scope of intellectual property rights in Big Data applications with a security framework for protecting intellectual property rights, watermarking and fingerprinting algorithms. The emergence of Big Data necessitates the development of new conceptual frameworks, security standards, and laws. This study addresses the significant copyright difficulties on cross-database platforms and the paradigm shift from ownership to control of access to and use of Big Data, especially on such platforms. We provide a comprehensive overview of copyright applications for multimedia data and a summary of the main trends in the discussion of intellectual property protection, highlighting crucial issues and existing obstacles and identifying the three major findings for investigating the relationship between them.", "venue": "Algorithms", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-11-08", "journal": {"name": "Algorithms", "pages": "418", "volume": "15"}, "authors": [{"authorId": "32987340", "name": "Rafik Hamza"}, {"authorId": "10996256", "name": "Hilmil Pradana"}], "citations": [{"paperId": "bb28d1fa66fb3f826d3fec43508ce2065ec5814d", "title": "Homomorphic Encryption for AI-Based Applications: Challenges and Opportunities"}, {"paperId": "219fc98e32744aa45ba27993f00f8b5836a50196", "title": "Intellectual Property Protection of Digital Cultural Heritage"}, {"paperId": "371a703c2a02ef4543e1f93390ec80368482026f", "title": "Intellectual Property Protection in the Transformation of Plant Protection Research Achievements: Present Situation, Challenges and Prospects"}]}
