{"paperId": "9e38f9c3c12ba5ea0a728b08357551db4e137d14", "publicationVenue": null, "title": "WatchDog: Real-time Vehicle Tracking on Geo-distributed Edge Nodes", "abstract": "Vehicle tracking, a core application to smart city video analytics, is becoming more widely deployed than ever before thanks to the increasing number of traffic cameras and recent advances in computer vision and machine-learning. Due to the constraints of bandwidth, latency, and privacy concerns, tracking tasks are more preferable to run on edge devices sitting close to the cameras. However, edge devices are provisioned with a fixed amount of computing budget, making them incompetent to adapt to time-varying and imbalanced tracking workloads caused by traffic dynamics. In coping with this challenge, we propose WatchDog, a real-time vehicle tracking system that fully utilizes edge nodes across the road network. WatchDog leverages computer vision tasks with different resource-accuracy tradeoffs, and decomposes and schedules tracking tasks judiciously across edge devices based on the current workload to maximize the number of tasks while ensuring a provable response time-bound at each edge device. Extensive evaluations have been conducted using real-world city-wide vehicle trajectory datasets, achieving exceptional tracking performance with a real-time guarantee.", "venue": "ACM Trans. Internet Things", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-02-11", "journal": {"name": "ACM Transactions on Internet of Things", "pages": "1 - 23", "volume": "4"}, "authors": [{"authorId": "2114029272", "name": "Zheng Dong"}, {"authorId": "144299116", "name": "Yan Lu"}, {"authorId": "2195561", "name": "G. Tong"}, {"authorId": "39596641", "name": "Yuanchao Shu"}, {"authorId": "2155449113", "name": "Shuai Wang"}, {"authorId": "2154040016", "name": "Weisong Shi"}], "citations": [{"paperId": "be2880ca67d3a88ee9c1c2c0cfc8921598fedd8b", "title": "Collaborative Inference via Dynamic Composition of Tiny AI Accelerators on MCUs"}, {"paperId": "3af3302f61e8f0266d6a596ccbe5b524b57827f8", "title": "Collaborative Multi-task Learning for Multi-Object Tracking and Segmentation"}, {"paperId": "7746b54ebaca6a3ddd85b6b2a2b507aa3ea95389", "title": "WiCrew: Gait-Based Crew Identification for Cruise Ships Using Commodity WiFi"}, {"paperId": "9eb732b3e7cfea2d0258ee8c0f7eb1580274681a", "title": "PreActo: Efficient Cross-Camera Object Tracking System in Video Analytics Edge Computing"}, {"paperId": "8b4a2e572e555a2bab3abd92335ee75318038cf6", "title": "VisBLE: Vision-Enhanced BLE Device Tracking"}, {"paperId": "022b81f3d1b2f2e2b46c01186cc064a1a35c3c16", "title": "Characterization and Implication of Edge WebAssembly Runtimes"}]}
