{"paperId": "9e3ba600bd9a1ec9eca854b879df6b5c57591c69", "publicationVenue": {"id": "f8b7e518-b406-437e-84da-b0948622c1c9", "name": "Computer Networks", "type": "journal", "alternate_names": ["Comput Netw", "Comput  Netw", "Computer & Network"], "issn": "1389-1286", "url": "http://www.elsevier.com/wps/find/journaldescription.cws_home/505606/description#description", "alternate_urls": ["http://www.elsevier.com/wps/find/journaldescription.cws_home/505606/description", "http://www.sciencedirect.com/science/journal/13891286"]}, "title": "NetTiSA: Extended IP Flow with Time-series Features for Universal Bandwidth-constrained High-speed Network Traffic Classification", "abstract": "Network traffic monitoring based on IP Flows is a standard monitoring approach that can be deployed to various network infrastructures, even the large IPS-based networks connecting millions of people. Since flow records traditionally contain only limited information (addresses, transport ports, and amount of exchanged data), they are also commonly extended for additional features that enable network traffic analysis with high accuracy. Nevertheless, the flow extensions are often too large or hard to compute, which limits their deployment only to smaller-sized networks. This paper proposes a novel extended IP flow called NetTiSA (Network Time Series Analysed), which is based on the analysis of the time series of packet sizes. By thoroughly testing 25 different network classification tasks, we show the broad applicability and high usability of NetTiSA, which often outperforms the best-performing related works. For practical deployment, we also consider the sizes of flows extended for NetTiSA and evaluate the performance impacts of its computation in the flow exporter. The novel feature set proved universal and deployable to high-speed ISP networks with 100\\,Gbps lines; thus, it enables accurate and widespread network security protection.", "venue": "Computer Networks", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-10-09", "journal": {"name": "ArXiv", "volume": "abs/2310.05530"}, "authors": [{"authorId": "2193209734", "name": "Josef Koumar"}, {"authorId": "81741826", "name": "Karel Hynek"}, {"authorId": "2191903654", "name": "Jaroslav Pesek"}, {"authorId": "3239054", "name": "T. Čejka"}], "citations": []}
