{"paperId": "9e4d887b267b348c88ee09790c2d647b4f5f19b8", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "A Review of Multisensor Data Fusion Solutions in Smart Manufacturing: Systems and Trends", "abstract": "Manufacturing companies increasingly become “smarter” as a result of the Industry 4.0 revolution. Multiple sensors are used for industrial monitoring of machines and workers in order to detect events and consequently improve the manufacturing processes, lower the respective costs, and increase safety. Multisensor systems produce big amounts of heterogeneous data. Data fusion techniques address the issue of multimodality by combining data from different sources and improving the results of monitoring systems. The current paper presents a detailed review of state-of-the-art data fusion solutions, on data storage and indexing from various types of sensors, feature engineering, and multimodal data integration. The review aims to serve as a guide for the early stages of an analytic pipeline of manufacturing prognosis. The reviewed literature showed that in fusion and in preprocessing, the methods chosen to be applied in this sector are beyond the state-of-the-art. Existing weaknesses and gaps that lead to future research goals were also identified.", "venue": "Italian National Conference on Sensors", "year": 2022, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2022-02-23", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "22"}, "authors": [{"authorId": "2726885", "name": "A. Tsanousa"}, {"authorId": "2156335159", "name": "Evangelos Bektsis"}, {"authorId": "39182309", "name": "Constantine A. Kyriakopoulos"}, {"authorId": "2136403932", "name": "Ana Gómez-González"}, {"authorId": "152365173", "name": "Urko Leturiondo"}, {"authorId": "1988554", "name": "Ilias Gialampoukidis"}, {"authorId": "3278800", "name": "A. Karakostas"}, {"authorId": "3019137", "name": "S. Vrochidis"}, {"authorId": "1715604", "name": "Y. Kompatsiaris"}], "citations": [{"paperId": "eaf4c0400b4f3920634ba837be9a5ee79d935f0a", "title": "Multi-modal fusion approaches for tourism: A comprehensive survey of data-sets, fusion techniques, recent architectures, and future directions"}, {"paperId": "d922556635b2d41910ff41c827f42ecccce872df", "title": "Condition monitoring of Industrial machine’s transmission elements – MSDF feature extraction approach"}, {"paperId": "9dfc5fee7be0394a0e083695cf6a6dc95d78a144", "title": "Design of UAV flight state recognition and trajectory prediction system based on trajectory feature construction"}, {"paperId": "c72223f6920ed576713631859b6236c271964d67", "title": "Intelligent Research on Chinese and English Listening Teaching Based on Deep Learning"}, {"paperId": "040275611f62aebf3a452f9b577ebfba8e0d2e58", "title": "Material selection in sensor design for additive manufacturing"}, {"paperId": "8a2563f8fb3e4c685485b3b8b92964c9c2c9caa2", "title": "Multiview Fusion With the Labeled Multi-Bernoulli Densities in the Network Without Feedback"}, {"paperId": "13092274707ee77a5408ed9166b57b4113465c47", "title": "Multi Sensor Network System for Early Detection and Prediction of Forest Fires in Southeast Asia"}, {"paperId": "715572308a262a1533a30e107a60e05e2ff7c51f", "title": "A systematic review of data fusion techniques for optimized structural health monitoring"}, {"paperId": "8e02dd4fe440f40b897962cd088e80e1b2b5315a", "title": "Review on prognostics and health management in smart factory: From conventional to deep learning perspectives"}, {"paperId": "6ac6f3f9122bcb7a42dba31c021083ca8b5eed28", "title": "Electrochemical multisensor systems and arrays in the era of artificial intelligence"}, {"paperId": "8f920368dfed9c3b5a229ee0b182cba4fd783ecb", "title": "Optical Diffraction Spectral Device as an Information System in the Problems of Control of Physical and Technological Processes"}, {"paperId": "9eabe09de3699655bbe25e8511ac045d1344aa46", "title": "Gas Sensor-Based Nondestructive Testing for Jackfruit Ripeness Level"}, {"paperId": "c411e240bf4c9c67775fb490b1bda03954e468a8", "title": "Attention-stacked Generative Adversarial Network (AS-GAN)-empowered Sensor Data Augmentation for Online Monitoring of Manufacturing System"}, {"paperId": "aa266118f503891947aa10a3053612419236aca3", "title": "Robotics: Five Senses plus One - An Overview"}, {"paperId": "dc5a9f04211c12a35352bd8785103dd891a13a04", "title": "Adaptive Quality Diagnosis Framework for Production Lines in a Smart Manufacturing Environment"}, {"paperId": "e8c5d2fb59fb8cfad0a6c52480532deb4740cf7d", "title": "Effective Techniques for Multimodal Data Fusion: A Comparative Analysis"}, {"paperId": "d2376ef23379409a720c4b9d7091f28cdf6de177", "title": "Toward Better Food Security Using Concepts from Industry 5.0"}, {"paperId": "43529a958686d0b0222b45d322ed4c322a166a19", "title": "Multiagent-Based Data Presentation Mechanism for Multifaceted Analysis in Network Management Tasks"}, {"paperId": "b50c2d034578305d9cbc5276881bb7d0eabd0a8e", "title": "A Comprehensive Review on Big Data for Industries: Challenges and Opportunities"}]}
