{"paperId": "9e4e4d8e1c75763fc8e346d99d968825681baac6", "publicationVenue": {"id": "5f48a931-025e-4052-9bc1-26f59c1f5d79", "name": "International Journal of Computer Vision and Image Processing", "type": "journal", "alternate_names": ["Int J Comput Vis Image Process"], "issn": "2155-6989", "url": "https://www.igi-global.com/journal/international-journal-computer-vision-image/1181"}, "title": "A Review of Infrastructures to Process Big Multimedia Data", "abstract": "In the last years, the volume of information is growing faster than ever before, moving from small to huge, structured to unstructured datasets like text, image, audio and video. The purpose of processing the data is aimed to extract relevant information on trends, challenges and opportunities; all these studies with large volumes of data. The increase in the power of parallel computing enabled the use of Machine Learning (ML) techniques to take advantage of the processing capabilities offered by new architectures on large volumes of data. For this reason, it is necessary to find mechanisms that allow classify and organize them to facilitate to the users the extraction of the required information. The processing of these data requires the use of classification techniques that will be reviewed. This work analyzes different studies carried out on the use of ML for processing large volumes of data (Big Multimedia Data) and proposes a classification, using as criteria, the hardware infrastructures used in works of machine learning parallel approaches applied to large volumes of data.", "venue": "International Journal of Computer Vision and Image Processing", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2017-07-01", "journal": {"name": "Int. J. Comput. Vis. Image Process.", "pages": "54-64", "volume": "7"}, "authors": [{"authorId": "2056029467", "name": "Jaime Salvador"}, {"authorId": "38917023", "name": "Zoila Ruiz"}, {"authorId": "2117020529", "name": "J. G. Rodríguez"}], "citations": [{"paperId": "3414d38cbfe6649bf6210015e61bcf4ee04bdac2", "title": "Multimedia Drama Imaging Technology Based on Big Data Information System"}, {"paperId": "d74f2d67ab3b45a12f44e199dfa8ad874d8db6d5", "title": "Using Automatic Identification System (AIS) Data to Estimate Whale Watching Effort"}, {"paperId": "bdba72a6344bcb312fa8f8b9dee0e7d70066d796", "title": "Using big data to estimate whale watching effort"}]}
