{"paperId": "9e50e08f60997e049543749aeb0f4a5260165646", "publicationVenue": {"id": "7fe84005-586f-4604-98ee-fa60fe8ae618", "name": "Journal of Clinical Medicine", "type": "journal", "alternate_names": ["J Clin Med"], "issn": "2077-0383", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-321173", "alternate_urls": ["https://www.mdpi.com/journal/jcm", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-321173"]}, "title": "The Full Informational Spectral Analysis for Auditory Steady-State Responses in Human Brain Using the Combination of Canonical Correlation Analysis and Holo-Hilbert Spectral Analysis", "abstract": "Auditory steady-state response (ASSR) is a translational biomarker for several neurological and psychiatric disorders, such as hearing loss, schizophrenia, bipolar disorder, autism, etc. The ASSR is sinusoidal electroencephalography (EEG)/magnetoencephalography (MEG) responses induced by periodically presented auditory stimuli. Traditional frequency analysis assumes ASSR is a stationary response, which can be analyzed using linear analysis approaches, such as Fourier analysis or Wavelet. However, recent studies have reported that the human steady-state responses are dynamic and can be modulated by the subject’s attention, wakefulness state, mental load, and mental fatigue. The amplitude modulations on the measured oscillatory responses can result in the spectral broadening or frequency splitting on the Fourier spectrum, owing to the trigonometric product-to-sum formula. Accordingly, in this study, we analyzed the human ASSR by the combination of canonical correlation analysis (CCA) and Holo-Hilbert spectral analysis (HHSA). The CCA was used to extract ASSR-related signal features, and the HHSA was used to decompose the extracted ASSR responses into amplitude modulation (AM) components and frequency modulation (FM) components, in which the FM frequency represents the fast-changing intra-mode frequency and the AM frequency represents the slow-changing inter-mode frequency. In this paper, we aimed to study the AM and FM spectra of ASSR responses in a 37 Hz steady-state auditory stimulation. Twenty-five healthy subjects were recruited for this study, and each subject was requested to participate in two auditory stimulation sessions, including one right-ear and one left-ear monaural steady-state auditory stimulation. With the HHSA, both the 37 Hz (fundamental frequency) and the 74 Hz (first harmonic frequency) auditory responses were successfully extracted. Examining the AM spectra, the 37 Hz and the 74 Hz auditory responses were modulated by distinct AM spectra, each with at least three composite frequencies. In contrast to the results of traditional Fourier spectra, frequency splitting was seen at 37 Hz, and a spectral peak was obscured at 74 Hz in Fourier spectra. The proposed method effectively corrects the frequency splitting problem resulting from time-varying amplitude changes. Our results have validated the HHSA as a useful tool for steady-state response (SSR) studies so that the misleading or wrong interpretation caused by amplitude modulation in the traditional Fourier spectrum can be avoided.", "venue": "Journal of Clinical Medicine", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-07-01", "journal": {"name": "Journal of Clinical Medicine", "volume": "11"}, "authors": [{"authorId": "31048106", "name": "Po-Lei Lee"}, {"authorId": "2157988481", "name": "Te-Min Lee"}, {"authorId": "2158231670", "name": "Wei-Keung Lee"}, {"authorId": "2174886579", "name": "Narisa Nan Chu"}, {"authorId": "3433772", "name": "Y. Shelepin"}, {"authorId": "5972283", "name": "Hao-Teng Hsu"}, {"authorId": "2202466528", "name": "Hsiao-Huang Chang"}], "citations": [{"paperId": "b5c2d0678b8de43ab8d9d1756e0ea39352589d36", "title": "Saint Petersburg Branch of the Scientific Council of the Russian Academy of Sciences on the Methodology of Artificial Intelligence and Cognitive Research in 2022"}, {"paperId": "5a198d8dc33125447242a4eb1bd05d16fdec40a1", "title": "The Behavioral and Social Dimension of the Public Health System of European Countries: Descriptive, Canonical, and Factor Analysis"}]}
