{"paperId": "9e56a9355432c5f57a604f06394baf4137db2060", "publicationVenue": null, "title": "Application of Ensemble Learning and Expert Decision in Fuzzy Risk Assessment of Railway Signaling Safety", "abstract": "The effectiveness of traditional risk assessment methods greatly relies on the quantity and quality of expert knowledge, featuring strong human factor dependence. The failure modes of railway operation scenes are complex and volatile, causing a significantly different distribution of expert scoring data for decision-making. Focusing on railway signaling safety, this paper puts forward an ensemble learning algorithm (ELA), constructing a comprehensive risk assessment approach that can better use limited expert knowledge to achieve a high fuzziness level. This approach improves the fuzzy risk assessment based on the failure mode, effects, and criticality analysis framework. A risk evaluation algorithm is proposed to construct an ensemble model with different voting rules combined with the k-nearest neighbor, support vector machine, random forest, and other elementary classifiers. Further, the ELA is applied to a case study on a typical signaling apparatus. The results show that using this ensemble model for the risk evaluation can achieve 96.0% testing accuracy. The novel approach simplifies the on-site investigation while weakening the subjectivity of expert decision-making, presenting more advantages in high-speed railway signaling susceptible to intricate factors.", "venue": "2022 IEEE 25th International Conference on Intelligent Transportation Systems (ITSC)", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-10-08", "journal": {"name": "2022 IEEE 25th International Conference on Intelligent Transportation Systems (ITSC)", "pages": "3691-3697"}, "authors": [{"authorId": "2118484527", "name": "Chang Liu"}, {"authorId": "153909361", "name": "Shiwu Yang"}, {"authorId": "2147329703", "name": "Shaotong Chu"}, {"authorId": "2116638211", "name": "Cong Wang"}, {"authorId": "2194688173", "name": "Ruoshui Liu"}], "citations": [{"paperId": "06d1f8d5ed5375fae4f1254404015d0929d539b8", "title": "Reflection on methodology of the correlation between electromagnetic interference and safety in high-speed railways"}]}
