{"paperId": "9e60bb689182a753886fe40e6790cd7da7de7e3d", "publicationVenue": {"id": "e07422f9-c065-40c3-a37b-75e98dce79fe", "name": "The Web Conference", "type": "conference", "alternate_names": ["Web Conf", "WWW"], "url": "http://www.iw3c2.org/"}, "title": "A Large-scale Temporal Analysis of User Lifespan Durability on the Reddit Social Media Platform", "abstract": "Social media platforms thrive upon the intertwined combination of user-created content and social interaction between these users. In this paper, we aim to understand what early user activity patterns fuel an ultimately durable user lifespan. We do so by analyzing what behavior causes potentially durable contributors to abandon their “social career” at an early stage, despite a strong start. We use a uniquely processed temporal dataset of over 6 billion Reddit user interactions on covering over 14 years, which we make available together with this paper. The temporal data allows us to assess both user content creation activity and the way in which this content is perceived. We do so in three dimensions, being a user’s content a) engagement and perception, b) diversification, and c) contribution. Our experiments reveal that users who leave the platform quickly may initially receive good feedback on their posts, but in time experience a decrease in the perceived quality of their content. Concerning diversification, we find that early departing users focus on fewer content categories in total, but do “jump” between those content categories more frequently, perhaps in an (unsuccessful) search for recognition or a sense of belonging. Third, we see that users who stay with the platform for a more extended period gradually start contributing, whereas early departing users post their first comments relatively quickly. The findings from this paper may prove crucial for better understanding how social media platforms can in an early stage improve the overall user experience and feeling of belonging within the social ecosystem of the platform.", "venue": "The Web Conference", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2022-04-25", "journal": {"name": "Companion Proceedings of the Web Conference 2022"}, "authors": [{"authorId": "2163313042", "name": "Amirhossein Nadiri"}, {"authorId": "2131145555", "name": "F. Takes"}], "citations": [{"paperId": "7418519415c830d876d0059d59df718eeb0babdc", "title": "Applying Named Entity Recognition and Graph Networks to Extract Common Interests from Thematic Subfora on Reddit"}, {"paperId": "d755acd2392e0783fea21424c7f5024a6f92bc6a", "title": "Attention-grabbing news coverage: Violent images of the Black Lives Matter movement and how they attract user attention on Reddit"}, {"paperId": "5298c44e236fa58936cb40d55b11fa3f13dfa919", "title": "Temporal Graph Benchmark for Machine Learning on Temporal Graphs"}, {"paperId": "dc2898841ff5e3b78b11413662452f2e7d9757a8", "title": "Report on the 8th International Workshop on Mining Actionable Insights from Social Networks (MAISoN'22) - Special Edition on Mental Health and Social Media at TheWebConf 2022"}, {"paperId": "56d873109fc546dbef4336fdfa644d076cd85de0", "title": "The Age of Snippet Programming: Toward Understanding Developer Communities in Stack Overflow and Reddit"}, {"paperId": "292d335cbe07c8afe4f88e09fe0d440c2bd9735d", "title": "MAISoN’22: 8th International Workshop on Mining Actionable Insights from Social Networks Special Edition on Mental Health and Social Media"}, {"paperId": "5d65fdd73a52bf43e3a254b262f5dfc7e15d325a", "title": "CADENCE: Community-Aware Detection of Dynamic Network States"}]}
