{"paperId": "9e72622d4ea34f521f1bd378bde63fe4b669aa91", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "LUDA: Boost LSM Key Value Store Compactions with GPUs", "abstract": "Log-Structured-Merge (LSM) tree-based key value stores are facing critical challenges of fully leveraging the dramatic performance improvements of the underlying storage devices, which makes the compaction operations of LSM key value stores become CPU-bound, and slow compactions significantly degrade key value store performance. To address this issue, we propose LUDA, an LSM key value store with CUDA, which uses a GPU to accelerate compaction operations of LSM key value stores. How to efficiently parallelize compaction procedures as well as accommodate the optimal performance contract of the GPU architecture challenge LUDA. Specifically, LUDA overcomes these challenges by exploiting the data independence between compaction procedures and using cooperative sort mechanism and judicious data movements. Running on a commodity GPU under different levels of CPU overhead, evaluation results show that LUDA provides up to 2x higher throughput and 2x data processing speed, and achieves more stable 99th percentile latencies than LevelDB and RocksDB.", "venue": "arXiv.org", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-04-07", "journal": {"name": "ArXiv", "volume": "abs/2004.03054"}, "authors": [{"authorId": "2153915562", "name": "Peng Xu"}, {"authorId": "144768028", "name": "Ji-guang Wan"}, {"authorId": "9319921", "name": "Ping Huang"}, {"authorId": "2112080673", "name": "Xiaogang Yang"}, {"authorId": "50823339", "name": "Chenlei Tang"}, {"authorId": "144894847", "name": "Fei Wu"}, {"authorId": "2072948", "name": "C. Xie"}], "citations": [{"paperId": "5232b993f9fe1eefd49340415ef10d52c0da38eb", "title": "An Asynchronous Compaction Acceleration Scheme for Near-Data Processing-enabled LSM-Tree-based KV Stores"}, {"paperId": "aab7fbbc023f1854e185c4e79672e105715de4f8", "title": "RBC: A bandwidth controller to reduce write-stalls and tail latency"}, {"paperId": "fcdff973365a2ddd6ca9b6c0d65d15727b1d2ecc", "title": "Elevating Performance of LSM-Tree-Based Key-Value Stores with Gradient Data Hierarchy"}]}
