{"paperId": "9e76d6a75058ec558607bdb2662411476d9c4b0f", "publicationVenue": {"id": "aa8f57e2-d5cf-4f0d-afcb-8577fb02e10a", "name": "Kybernetes", "type": "journal", "issn": "0368-492X", "url": "https://www.emerald.com/insight/publication/issn/0368-492X", "alternate_urls": ["http://www.emeraldinsight.com/0368-492X.htm", "http://www.emeraldinsight.com/loi/k"]}, "title": "A new model for investigating the role of IT-based innovation in the pharmaceutical knowledge-sharing attitude: A study of marketing biotechnology firms", "abstract": "\nPurpose\nThe creation of partnerships among companies, governments and universities can improve innovation and the technological development of institutions. As innovation is a multidimensional concept, more nuanced research is needed to identify, which dimensions of innovation firms should focus on them. This paper aims to investigate the influence of attitude to knowledge sharing (KS) factors, learning organization and creativity on the innovation in marketing biotechnology firms. So, the purpose of this paper is to examine the influence of learning organization, attitude to KS, creativity, information technology (IT) acceptance, KS culture and trust on the innovation by presenting a new framework and a model.\n\n\nDesign/methodology/approach\nThe structural equation modeling technique is used to examine the reliability and validity of the measurement of the provided model. Data were collected by questionnaires. A case study was carried out in 100 marketing biotechnology firms in the Tehran of Iran. In this paper, smart partial least squares 2.0 was used to evaluate the measurement.\n\n\nFindings\nThe result showed that all hypotheses of this research are proved. Also, the results have shown that the attitude to KS, learning organization and creativity affect the innovation in marketing biotechnology firms. As an overall result, the managers should create an enhanced knowledge bank to increase and encourage the KS among employees, thus creating and enhancing innovation in organizations. Also, the results have shown that marketing shortages were mostly connected to access to human resources with related management and marketing experiences and were mainly felt by firms introducing discontinuous novelties.\n\n\nResearch limitations/implications\nThe main limitation of this paper is that the sample was retrieved from 384 employees in 100 marketing biotechnology institutions. The larger number of samples can yield better results. Next, even though the respondents’ profiles indicated a high probability of them being cognizant of their organization’s efforts in inter-firm KS, learning, creativity and innovation with three or four respondent from each organization answering all questions for such complicated issues always poses the risk of measurement bias and inaccuracy. An ideal situation for future studies would be to pool and compare multiple respondents from the same organization to obtain a more comprehensive firm-level measurement. In addition, this study only surveyed and sampled biotech marketing companies in Iran. Therefore, the model should be examined using samples from other countries because the varieties of culture could have an impact on employee apprehensions. So, future researchers can test the measurement instrument in different countries and/or conduct large multi-national comparisons.\n\n\nPractical implications\nSuccessful marketing strategies depend very much on an organization’s ability to implement them. This paper provides an excellent study about the future of pharmaceutical KS and shows that innovation paths are linked with local and temporary occasions. Also, the results of this study provide valuable information in formulating marketing biotechnology programs. It is essential to study both economics and innovation for students and academics. The results also suggested that policies to increase economic research will also increase innovation. They could contain the consolidation of the legal framework and institutional resources for public organizations to protect intellectual properties. In general, for successful implementation of strategies an organization has to integrate KS, processes and IT.\n\n\nSocial implications\nThe paper identifies the most critical factors in the innovation process of enterprizes in marketing biotechnology institutions. The implications derived from this study can shed new light upon policy-making both at the level of governance and in the management practice in Iran’s marketing biotechnology industry. Also, the paper increases understanding of the innovation process in Iran marketing biotechnology companies. This study contributes to innovating management research by offering a set of legal and dependable operational measures. These measures can help academics in theory analysis.\n\n\nOriginality/value\nThis is the first attempt examining the role of the learning organization, creativity and attitude to KS as a key contingency factor in innovation in Iran marketing biotechnology firms, an issue whose understanding is still developing in the literature. The paper adds to the body of knowledge by allowing better understanding the attitude toward KS and the influence of KS, learning and creativity on innovation. Previous studies did not investigate the KS in marketing biotechnology firms deeply, but, the present paper permits a more complete view on this topic. The guidelines are provided for the top directors to promote KS and innovation according to the research results. From a managerial point of view some critical elements, which are important for the success of KS and application of these elements for progressing institutional guidelines to develop KS, are considered. Theoretical foundations can be extracted from this study, and these foundations can be implemented to investigate connection in KS elements such as feasibilities processes and institution initiative abilities. So, the results could be suitable to managers when arranging an organization and shaping its culture to improve knowledge management.\n", "venue": "Kybernetes", "year": 2020, "fieldsOfStudy": ["Computer Science", "Business"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2020-04-17", "journal": {"name": "Kybernetes", "pages": "1095-1124", "volume": "50"}, "authors": [{"authorId": "2144427646", "name": "Dawei Liu"}, {"authorId": "1729371267", "name": "Sajjad Zeinaly"}], "citations": [{"paperId": "862bad83cd9252ed58f7c223c4fcc66fe57b4e0c", "title": "Application of Cloud-based Human Resource Management Information System and Women-Entrepreneurial Growth: A Conceptual Consideration"}, {"paperId": "1868543eb21e85597e1c2d8f73668e23f329ff65", "title": "The impact of a pandemic on knowledge sharing behavior: a COR perspective"}, {"paperId": "fc28225b4a6a09e942a69b45785239ef30ce8f55", "title": "A theoretical framework for identifying appropriate marketing approaches across the product development life cycle for biomedical science SMEs"}, {"paperId": "271a24ab54689954651e53a3385b17276b694cf3", "title": "Unleashing the mechanism between affect-based trust and employee creativity: a knowledge sharing perspective"}, {"paperId": "9dc3a846101526d2dfc8554f99cc01e4c8aa57d7", "title": "Moderating Role of IT Adoption and Mechanism of Dynamic Capabilities on Indonesian Pharmaceutical Firms Performance"}, {"paperId": "e45fb2d2e0dee51b73d889608c7dbe6415ec2d0c", "title": "Small-scale agricultural product marketing innovation through BUMDes and MSMEs empowerment in coastal areas"}]}
