{"paperId": "9e77e08601ddaf0c75e7a310aea20e01fd841012", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Privacy-Breaching Patterns in NoSQL Databases", "abstract": "NoSQL databases disrupted the database market when first introduced. Their contemporary relevance has increased further in the era of big data due to the demands placed on (real-time) analytics. NoSQL databases are well placed to meet these demands due to their performance, availability, scalability, and storage solutions. Unfortunately, to achieve these features, compromises have been made with respect to security and privacy. Growing community awareness and unease combined with increased legislative requirements around data privacy have made such compromises less palatable, risky, or downright unacceptable. And though there is a growing body of knowledge related to data privacy in NoSQL databases, it is diverse and fragmented, and does not adequately address the challenges arising from the current environment. This paper aims to systematically examine various privacy weaknesses of NoSQL databases in the form of patterns. The patterns are shown to manifest themselves in well-known NoSQL databases and this evaluation can be used for benchmarking purposes. Through a survey it is demonstrated that the patterns have been observed in practice and are perceived as relevant. The pattern collection forms a repository of knowledge that can serve as a starting point for future privacy-related research for NoSQL databases through its identification of key problems, trade-offs, existing solution mechanisms, and its provision of terminology.", "venue": "IEEE Access", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "35229-35239", "volume": "9"}, "authors": [{"authorId": "2631979", "name": "Kanika Goel"}, {"authorId": "143613819", "name": "A. Hofstede"}], "citations": [{"paperId": "5944efd46d66cc255afcdacfcaf475d50ad93089", "title": "Efficient Solution for NoSQL Database Security in Blockchain - Based Applications"}, {"paperId": "c329c2a812e7ab12bccdb94b5533f0f06bd8b80e", "title": "OWASP Framework-based Network Forensics to Analyze the SQLi Attacks on Web Servers"}, {"paperId": "843a638d43323c2edba88aa703e113ad44cff11f", "title": "Basis Data Awan Non-Relasional Firestore untuk Penyimpanan Data Pesan"}, {"paperId": "4b8f230d3640daa29b5580656ba9b3a7d3f2d366", "title": "NoSQL Cloud based Bigdata technologies for efficient performance evaluation in the modern era"}, {"paperId": "4b7198461ef3c135402fb0b696c129dc11e8cf87", "title": "Development a Teleconsultation Platform for Outpatients during the COVID-19 Pandemic based on Cloud Firestore and Realtime Databases"}, {"paperId": "c27620138e2dd34b68991f3236990886b5933fed", "title": "Securing Academic Student File Using Aes Algorithm For Cloud Storage Web-Based System"}, {"paperId": "e500967568830df4b5e731a83d30b2a028ce820d", "title": "Cloud based evaluation of databases for stock market data"}, {"paperId": "0a129ac454bb0ee0db54ff84b1b92bf5fd0c902b", "title": "NoSQL security: can my data-driven decision-making be affected from outside?"}]}
