{"paperId": "9e8426fa380dc6160360d693e3b94eba7660415f", "publicationVenue": {"id": "809b8bfe-b343-44e1-9866-38bf35f8b1fb", "name": "International Conference on Computer Science and Software Engineering", "type": "conference", "alternate_names": ["CSSE", "Int Conf Comput Sci Softw Eng", "Comput Sci Softw Eng", "Computer Science and Software Engineering"], "url": "http://www.wikicfp.com/cfp/program?id=611"}, "title": "DRMACert: Certification for Disaster Response Mobile Applications", "abstract": "As the scale of damage of natural disasters is increasing, it is required to have effective and secure disaster response mobile applications that collect disaster-related data, disseminate vital information about shelters, emergency personnel, and surrounding area, and generate escape routes. As we have seen in the recent disaster situations, the existing mobile applications do not fully address the needs to secure people's lives and properties. In this paper, we identify the problems on the existing application and derive the requirements for disaster response applications. To satisfy the requirements, we propose the DRMACert, a standard certificate that proves the effectiveness, security, and compliance of a disaster response application. In addition, we present its certification process that employs both an expert-based evaluation and a system-based evaluation for rapid and unbiased examination.", "venue": "International Conference on Computer Science and Software Engineering", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2021-10-22", "journal": {"name": "Proceedings of the 4th International Conference on Computer Science and Software Engineering"}, "authors": [{"authorId": "153362968", "name": "Youn-rak Jung"}, {"authorId": "2146404105", "name": "Tanner Mallari"}, {"authorId": "2146404006", "name": "Emily Hattman"}], "citations": [{"paperId": "32b5d2da28f83d7d93484bc9ae2171357b67837e", "title": "Autonomous and Sustainable Service Economies: Data-Driven Optimization of Design and Operations through Discovery of Multi-Perspective Parameters"}]}
