{"paperId": "9e88a6e3f1068fd4c265966167919d5de70feb55", "publicationVenue": {"id": "0730105a-4941-449f-9450-28cba8ae056b", "name": "ACM Transactions on Software Engineering and Methodology", "type": "journal", "alternate_names": ["ACM Trans Softw Eng Methodol"], "issn": "1049-331X", "url": "http://www.acm.org/pubs/contents/journals/tosem/", "alternate_urls": ["https://tosem.acm.org/", "http://tosem.acm.org/", "http://www.acm.org/pubs/tosem/", "http://portal.acm.org/tosem"]}, "title": "HybridCISave: A Combined Build and Test Selection Approach in Continuous Integration", "abstract": "Continuous Integration (CI) is a popular practice in modern software engineering. Unfortunately, it is also a high-cost practice—Google and Mozilla estimate their CI systems in millions of dollars. To reduce the computational cost in CI, researchers developed approaches to selectively execute builds or tests that are likely to fail (and skip those likely to pass). In this article, we present a novel hybrid technique (HybridCISave) to improve on the limitations of existing techniques: to provide higher cost savings and higher safety. To provide higher cost savings, HybridCISave combines techniques to predict and skip executions of both full builds that are predicted to pass and partial ones (only the tests in them predicted to pass). To provide higher safety, HybridCISave combines the predictions of multiple techniques to obtain stronger certainty before it decides to skip a build or test. We evaluated HybridCISave by comparing its effectiveness with the existing build selection techniques over 100 projects and found that it provided higher cost savings at the highest safety. We also evaluated each design decision in HybridCISave and found that skipping both full and partial builds increased its cost savings and that combining multiple test selection techniques made it safer.", "venue": "ACM Transactions on Software Engineering and Methodology", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-12-13", "journal": {"name": "ACM Transactions on Software Engineering and Methodology", "pages": "1 - 39", "volume": "32"}, "authors": [{"authorId": "47540780", "name": "Xianhao Jin"}, {"authorId": "2897094", "name": "Francisco Servant"}], "citations": [{"paperId": "2c9b85104ac4dddaba0f22a5749e0ef2a909a817", "title": "OneSpace: Detecting cross-language clones by learning a common embedding space"}, {"paperId": "b79c577ea0b3f1b3477e3268a19b06a50e9782d1", "title": "Accelerating Continuous Integration with Parallel Batch Testing"}, {"paperId": "e7378506ce1e96b6fd600c6c5ca4cc047dc0ea34", "title": "Understanding the Impact of Branch Edit Features for the Automatic Prediction of Merge Conflict Resolutions"}]}
