{"paperId": "9e8de821e47420b6e59ccf3ab73b8096d7626a4f", "publicationVenue": {"id": "e84bb5a1-8f79-42cc-8eb1-3a52f7c73d63", "name": "IEEE International Conference on Systems, Man and Cybernetics", "type": "conference", "alternate_names": ["Smoky Mountains Computational Sciences and Engineering Conference", "Smoky Mt Comput Sci Eng Conf", "IEEE Int Conf Syst Man Cybern", "SMC", "Syst Man Cybern", "Systems, Man and Cybernetics"]}, "title": "Topic detection based on similar networks", "abstract": "Social data from online social networks is expanding rapidly as the number of users and articles posted increases, making public opinion analysis a greater challenge. Real-time topic detection is a key part of public opinion analysis. The complex data processing involved in traditional clustering and text categorization can lead to time delays in topic detection. In this paper we construct similar networks and detect topics from similar communities that reduces the processing overhead in obtaining real-time topics. The similar communities consist of users with high similarity between them. We collect public topics from the microposts of delegates selected from each similar community. Selecting delegates can reduce the processing time of large amounts of redundant data during topic detection. Obtaining public opinion keywords in real time allows organizations to respond to public opinion security incidents in real time. Experiments showed that our scheme can find public topics faster and more effectively than two traditional algorithms.", "venue": "IEEE International Conference on Systems, Man and Cybernetics", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2017-10-01", "journal": {"name": "2017 IEEE International Conference on Systems, Man, and Cybernetics (SMC)", "pages": "188-193"}, "authors": [{"authorId": "2120099514", "name": "Xin Liu"}, {"authorId": "2145757452", "name": "Feng Wang"}, {"authorId": "1791160", "name": "Zhongwei Li"}, {"authorId": "2108238266", "name": "Weishan Zhang"}, {"authorId": "2072594046", "name": "Shuai Cao"}, {"authorId": "145044117", "name": "A. Helal"}, {"authorId": "1709431", "name": "Jiehan Zhou"}], "citations": [{"paperId": "5f547a7473a76480b54956103b9f1f854abd1140", "title": "Dot-Product Similarity based Centroid Clustering for Popular Topic Detection"}, {"paperId": "3a668d3cca86332751b48ffceac45ef2e703c8b1", "title": "Multilayer Social Network Overlapping Community Detection Algorithm Based on Trust Relationship"}]}
