{"paperId": "9e96696664536770a3c14c1da1dfda4bff328e92", "publicationVenue": null, "title": "analyzed Software tools and especially mobile applications as innovative means to support providing onboarding processes", "abstract": "interaction between the participants of the economic integration. findings. The authors suggest the theoretical and methodological provisions of the use of information technologies to ensure the information interaction of participants of integration entities. A model of a multi­agent information plane, based on a 4­tier open distribution information system, is presented. The role and tasks of interconnected subsystems in the economic and informa­ tion space are substantiated. Directions of influence through the formed information and communication corridors are clarified. The authors proved the need to accumulate information flows within the virtual integration plane based on the agents’ local infor­ mation systems. The multi­agent architecture of the virtual interaction environment for business entities within the integration plane is improved; the scheme of virtual agent interaction model based on the virtual plane is defined and the block diagram of the algorithm of interaction of economic agents within the virtual integration plane is improved. originality. Scientific priority of ensuring information interaction of participants of integration entities based on using informa­ tion technologies is enhanced. The authors revealed information and communication direction of the virtual integration plane. The process of formation of the virtual economic­information space of interaction of participants within the framework of a multi­ agent virtual information plane is specified, which allows accumulating, processing, distributing, and using the consolidated knowledge base with the purpose of information and communication support of cross­cutting business processes, support of the adoption of management decisions to provide virtual interaction of the agents. Practical value. The conducted research provides applied tools of modernization of the use of information technologies to ensure information interaction of participants of integration entities. A virtual integration plane is formed, which is the basis for managing the virtual integration interaction of business entities and implementing the concept of integration development. The results obtained during the research will allow providing informational support of managerial decision­making, implementing economic ties, monitoring the implementation of integration programs and strategies.", "venue": "", "year": 2020, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [], "citations": [{"paperId": "70eb21f1048035bbc052b908b26abdad6c9e3443", "title": "Enhancing accuracy of information processing in onboard subsystems of UAVs"}, {"paperId": "ef5c45951e47352c9736aa5cd46ba828f86f891c", "title": "Development of a multimodal (railroad-water) chain of grain supply by the agent-based simulation method"}, {"paperId": "656de487c6ce347d033efa6f6197fcbbd79cdf4e", "title": "Development of a method for modelling delay propagation in railway networks using epidemiological SIR models"}, {"paperId": "ab3be28b320a837e2e6569ddd942c72219462ab2", "title": "Idiversification approach to customer-oriented management of hotel and restaurant businesses"}, {"paperId": "bf771ea441feb7bcca8ca2f37ef3ac81db40903c", "title": "Simulation modeling of the distribution of rights and management systems of innovative development of personnel of enterprises under the influence of the factors of the COVID-19 pandemic"}]}
