{"paperId": "9ea9021f58635aabcdbe7f66f84b26f6af89ce64", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Quadrant-Based Minimum Bounding Rectangle-Tree Indexing Method for Similarity Queries over Big Spatial Data in HBase", "abstract": "With the rapid development of mobile devices and sensors, effective searching methods for big spatial data have recently received a significant amount of attention. Owing to their large size, many applications typically store recently generated spatial data in NoSQL databases such as HBase. As the index of HBase only supports a one-dimensional row keys, the spatial data is commonly enumerated using linearization techniques. However, the linearization techniques cannot completely guarantee the spatial proximity of data. Therefore, several studies have attempted to reduce false positives in spatial query processing by implementing a multi-dimensional indexing layer. In this paper, we propose a hierarchical indexing structure called a quadrant-based minimum bounding rectangle (QbMBR) tree for effective spatial query processing in HBase. In our method, spatial objects are grouped more precisely by using QbMBR and are indexed based on QbMBR. The QbMBR tree not only provides more selective query processing, but also reduces the storage space required for indexing. Based on the QbMBR tree index, two query-processing algorithms for range query and kNN query are also proposed in this paper. The algorithms significantly reduce query execution times by prefetching the necessary index nodes into memory while traversing the QbMBR tree. Experimental analysis demonstrates that our method significantly outperforms existing methods.", "venue": "Italian National Conference on Sensors", "year": 2018, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-09-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "18"}, "authors": [{"authorId": "2817163", "name": "Bumjoon Jo"}, {"authorId": "50187187", "name": "Sungwon Jung"}], "citations": [{"paperId": "49c66d1e635d7721905095063e88f7634f9a3563", "title": "SbMBR Tree—A Spatiotemporal Data Indexing and Compression Algorithm for Data Analysis and Mining"}, {"paperId": "5ede18253408120ea3690229450c6ac01fe5eb28", "title": "A Distributed Spatial Index With High Update Efficiency for Location-Based Real-Time Services"}, {"paperId": "265f78f2682e8cff424ee98d0b24579cb5918811", "title": "A Survey on Big IoT Data Indexing: Potential Solutions, Recent Advancements, and Open Issues"}, {"paperId": "7ee10aec47b18a61af516ac4796ee19a3b4cccb9", "title": "Advanced applications of chemo-responsive dyes based odor imaging technology for fast sensing food quality and safety: A review."}, {"paperId": "f6f2aea7858414e15d890f32ae3e45d25c40a3cf", "title": "An efficient indexing framework for data dissemination in wireless sensor networks"}, {"paperId": "87dc61d3a9bda20a5470b99d1cf21953f7346ac5", "title": "State-of-the-Art Geospatial Information Processing in NoSQL Databases"}, {"paperId": "ce4dbd8931cd51c5388c4e0b401f1178af535f3d", "title": "A survey on indexing techniques for mobility in Internet of Things': Challenges, performances, and perspectives"}, {"paperId": "0d14ac895147526298f11f250b5874e928455053", "title": "k‐nearest reliable neighbor search in crowdsourced LBSs"}, {"paperId": "0f3ebf5a3b059c4adccbe45007a58bb68496ebc9", "title": "Colorimetric Sensor Technology in Food"}]}
