{"paperId": "9eb0d566bc397f004ac424015ea7f288939e5eaa", "publicationVenue": {"id": "a642c56d-ef1d-4c35-aaed-ac875a9a431b", "name": "Ontology of Designing", "alternate_names": ["Ontol Des"], "issn": "2223-9537", "url": "http://agora.guru.ru/display.php?conf=scientific_journal&l=0"}, "title": "The concept of a set in the theory and practice of designing", "abstract": "The concept of a set is one of the key concepts in mathematics and not only. To further the discussion, assessments of the significance of sets in designing, generated by large language models, are given as a kind of generalized take on the importance of this concept. An analysis of the concepts of a set and a class in mathematics and engineering is provided. The multiplicity of their interpretations and the difference in various fields of application directly related to the concept of “element of the set”, are shown. In designing, the concept of a set is considered in various aspects and is filled with different content. First of all, it is a set of needs that continuously arise, and the design activity, accompanied by a multitude of design subjects participating in it, is aimed at satisfying them. It is also a set of precedents (already created artifacts), which are analogues and prototypes for the designer, but for one reason or another do not satisfy the emerging needs of the subjects. There are sets of: design parameters and design variables of the object being developed; criteria for evaluating a new artifact; background assumptions, data and conditions, including limitations; models describing the designed object; decision-making methods and, finally, a variety of design decisions. An objectively existing set of values of initial data and evaluation criteria in designing can be and is considered as an uncertainty (uncertain set), and as a given that must be revealed, narrowing the range of solutions and lowering the power of sets. In designing practice (removal of uncertainty, degeneration of the multiplicity of possible values of design parameters, etc.) one always strives for a singleton (a set with a single element), i.e. to the design solution that will be embodied in a design, technology or system.", "venue": "Ontology of Designing", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-14", "journal": {"name": "Ontology of designing"}, "authors": [{"authorId": "2237216963", "name": "Общие Вопросы"}, {"authorId": "2241316247", "name": "Формализации Проектирования"}, {"authorId": "2241316310", "name": "Онтологические Аспекты"}], "citations": []}
