{"paperId": "9edcb9ac257b934bc1088b8217e909c73c5e92de", "publicationVenue": {"id": "6be078fe-e448-4123-8096-25493e7a2502", "name": "ARES", "type": "conference", "alternate_names": ["Availability, Reliability and Security", "Availab Reliab Secur", "International Conference on Availability, Reliability and Security", "Int Conf Availab Reliab Secur"], "issn": "2554-2656", "url": "https://ares.hypotheses.org/", "alternate_urls": ["http://www.ares-conference.eu/"]}, "title": "An Investigation of PSA Certified", "abstract": "PSA (Platform Security Architecture) Certified is a security certification scheme for IoT hardware, software, and devices. The scheme is composed of security certification (PSA Certified Level 1/2/3) and functional API certification (PSA Certified Functional API). Up to now, this scheme has been adopted by many chip manufacturers, system/software developers, and OEMs (Original Equipment Manufacturers). In this paper, we investigate the PSA security certification and PSA functional API (Cryptography API, Storage API, and Attestation API) with its reference implementation. Also, we analyze the source code of the reference implementation by using Polyspace Bug Finder. Specifically, we found 1,385 coding defects in the PSA functional API reference implementation where high, medium, and low impact defects take up 44, 90, and 1,251, respectively. Then, we compare the PSA functional API and its reference implementation in several aspects. Throughout this paper, we explain the obtained analysis results and our findings in detail.", "venue": "ARES", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2022-08-23", "journal": {"name": "Proceedings of the 17th International Conference on Availability, Reliability and Security"}, "authors": [{"authorId": "1772270", "name": "Seonghan Shin"}, {"authorId": "2181819566", "name": "Tomoyuki Ogawa"}, {"authorId": "2054641609", "name": "Ryo Fujita"}, {"authorId": "2181816598", "name": "Mari Itoh"}, {"authorId": "2000729123", "name": "Hirotaka Yoshida"}], "citations": []}
