{"paperId": "9f23419969a811918a5eff25e76240d9654c1d2b", "publicationVenue": null, "title": "A Study of Cloud Based Solution for Data Analytics in Healthcare", "abstract": "The healthcare industry generates vast amounts of data that are crucial for improving patient outcomes and advancing medical research. However, traditional on premise solutions for data storage and analysis can become inadequate to handle the increasing volume, variety and velocity of healthcare data. The study aims to investigate the potential benefits and challenges of using cloud-based solutions for data analytics in healthcare. This paper reports about latest development and detailed role of using Artificial intelligence and capabilities of cloud Computing in health care sector/industry to foster innovative thinking, optimum wellbeing of the patient, focused medicinal support. This paper discusses various applications, algorithms and future of big data analytics with a focus on architecture, application and applicability of big data analytics using Hadoop and Cloud Computing in healthcare industry such as monitoring, prediction, performance, management etc including intensive care unit. many cloud platforms, like MMAP, are working in this field to provide a fast, reliable cost effective, efficient, and patient centric and solution to community health issues with capability of forecasting the health impact of various diseases on community for a given region or nation. Cloud computing framework, along with Artificial intelligence and Hadoop, aids healthcare management in completing analytical computations to identify logical, pertinent, and factual trends essential to strategize and enhanced readiness in event of catastrophes by facilitating data exchange among all stake holders.", "venue": "2023 6th International Conference on Information Systems and Computer Networks (ISCON)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-03-03", "journal": {"name": "2023 6th International Conference on Information Systems and Computer Networks (ISCON)", "pages": "1-6"}, "authors": [{"authorId": "2058888008", "name": "U. Gupta"}, {"authorId": "2149392177", "name": "Rohit Sharma"}], "citations": [{"paperId": "fa4e6691d216858d9f89007d08ceccd78027e849", "title": "A comprehensive review of data analytics in healthcare management: Leveraging big data for decision-making"}]}
