{"paperId": "9f35c25377f322d975527bfe070c535c1284e659", "publicationVenue": {"id": "29e6e722-a307-4196-958e-46e585f2fc47", "name": "IEEE Transactions on Reliability", "type": "journal", "alternate_names": ["IEEE Trans Reliab"], "issn": "0018-9529", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=24", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=24"]}, "title": "Modeling Impact of Human Errors on the Data Unavailability and Data Loss of Storage Systems", "abstract": "Data storage systems (DSSs) and their availability play a crucial role in contemporary datacenters. Despite using mechanisms such as automatic failover in datacenters, the role of human agents and consequently their destructive errors is inevitable. Due to very large number of disk drives used in exascale datacenters and their high failure rates, the disk subsystem in storage systems has become a major source of <italic>data unavailability</italic> (DU) and <italic>data loss</italic> (DL) initiated by human errors. In this paper, we investigate the effect of <italic>incorrect disk replacement service</italic> (IDRS) on the availability and reliability of DSSs. To this end, we analyze the consequences of IDRS in a disk array, and conduct Monte Carlo simulations to evaluate DU and DL during mission time. The proposed modeling framework can cope with different storage array configurations and <italic> data object survivability</italic>, representing the effect of system-level redundancies such as remote backups and mirrors. In the proposed framework, the model parameters are obtained from industrial and scientific reports alongside field data, which have been extracted from a datacenter operating with 70 storage racks. The results show that ignoring the impact of IDRS leads to unavailability underestimation by up to three orders of magnitude. Moreover, our study suggests that by considering the effect of human errors, the conventional beliefs about the dependability of different <italic>redundant array of independent disks</italic> (RAID) mechanisms should be revised. The results show that <inline-formula><tex-math notation=\"LaTeX\">$\\text{RAID}1$</tex-math></inline-formula> can result in lower availability compared to <inline-formula><tex-math notation=\"LaTeX\">$\\text{RAID}5$</tex-math></inline-formula> in the presence of human errors. The results also show that employing automatic fail-over policy (using hot spare disks) can reduce the drastic impacts of human errors by two orders of magnitude.", "venue": "IEEE Transactions on Reliability", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-05-26", "journal": {"name": "IEEE Transactions on Reliability", "pages": "1111-1127", "volume": "67"}, "authors": [{"authorId": "2868307", "name": "Mostafa Kishani"}, {"authorId": "144394335", "name": "H. Asadi"}], "citations": [{"paperId": "d23f289655fa9d1ccfe5193db4135553a6dd7d5a", "title": "PADSA: Priority-Aware Block Data Storage Architecture for Edge Cloud Serving Autonomous Vehicles"}, {"paperId": "3c8e12256d6da5904c6b21bf3da3c394b060cb12", "title": "Study on the file management method of data storage system for airborne radar"}, {"paperId": "f69e1c5cb1a264fa796e7fa8a83344f9efb37a02", "title": "On the Distribution Modeling of Heavy-Tailed Disk Failure Lifetime in Big Data Centers"}, {"paperId": "e62f23a6474a2dea29d4497767de0fc38c26ab37", "title": "A Modeling Framework for Reliability of Erasure Codes in SSD Arrays"}, {"paperId": "3f6431a8608db5de204ffabe7bc26682e486974d", "title": "Data consistency matrix based data processing model for efficient data storage in wireless sensor networks"}, {"paperId": "048791552d192f12063325ba5dc5de510ac095f4", "title": "Application of the Structure Function in the Evaluation of the Human Factor in Healthcare"}, {"paperId": "b6cf6d2799359b6af5a8d0648c58c25ef1aa8e32", "title": "A Data-Assisted Reliability Model for Carrier-Assisted Cold Data Storage Systems"}, {"paperId": "9a5c3d04cde121acd808b8a7d6ef7a4014b2cb72", "title": "Dependability Analysis of Data Storage Systems in Presence of Soft Errors"}, {"paperId": "8dc8ce191a565f665f2319b024baac9a7cbe521f", "title": "An Efficient Hybrid I/O Caching Architecture Using Heterogeneous SSDs"}, {"paperId": "3aedc5997c36befdbecd4b225588e7f404638b45", "title": "LBICA: A Load Balancer for I/O Cache Architectures"}]}
