{"paperId": "9f3703253051a95263bc2a882afe4e61b66fc9f9", "publicationVenue": null, "title": "Black or White? How to Develop an AutoTuner for Memory-based Analytics", "abstract": "There is a lot of interest today in building autonomous (or, self-driving) data processing systems. An emerging school of thought is to leverage AI-driven \"black box\" algorithms for this purpose. In this paper, we present a contrarian view. We study the problem of autotuning the memory allocation for applications running on modern distributed data processing systems. We show that an empirically-driven \"white-box\" algorithm, called RelM, that we have developed provides a close-to-optimal tuning at a fraction of the overheads compared to state-of-the-art AI-driven \"black box\" algorithms, namely, Bayesian Optimization (BO) and Deep Distributed Policy Gradient (DDPG). The main reason for RelM's superior performance is that the memory management in modern memory-based data analytics systems is an interplay of algorithms at multiple levels: (i) at the resource-management level across various containers allocated by resource managers like Kubernetes and YARN, (ii) at the container level among the OS, pods, and processes such as the Java Virtual Machine (JVM), (iii) at the application level for caching, aggregation, data shuffles, and application data structures, and (iv) at the JVM level across various pools such as the Young and Old Generation. RelM understands these interactions and uses them in building an analytical solution to autotune the memory management knobs. In another contribution, called Guided-BO (GBO), we use RelM's analytical models to speed up BO. Through an evaluation based on Apache Spark, we showcase that the RelM's recommendations are significantly better than what commonly-used Spark deployments provide, and are close to the ones obtained by brute-force exploration; while GBO provides optimality guarantees for a higher, but still significantly lower cost overhead compared to the state-of-the-art AI-driven policies.", "venue": "SIGMOD Conference", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2020-02-26", "journal": {"name": "Proceedings of the 2020 ACM SIGMOD International Conference on Management of Data"}, "authors": [{"authorId": "3094459", "name": "Mayuresh Kunjir"}, {"authorId": "145664618", "name": "S. Babu"}], "citations": [{"paperId": "263b0924f50444bbd7cdf5374638695e3eb56156", "title": "Automatic Database Knob Tuning: A Survey"}, {"paperId": "d9b6d17c46a48cddbff9ef900e393b745813b48e", "title": "PTSSBench: a performance evaluation platform in support of automated parameter tuning of software systems"}, {"paperId": "8ddb165278176f279ace760a8c14f5e0fcb652b0", "title": "GPTuner: A Manual-Reading Database Tuning System via GPT-Guided Bayesian Optimization"}, {"paperId": "4601707a5e77daa25c69314f13c89dda2a0713d2", "title": "An Efficient Transfer Learning Based Configuration Adviser for Database Tuning"}, {"paperId": "d930c396526bb5a7d6c4fdeb5abb23b7c5a97908", "title": "Optimizing Resource Allocation for Tumor Simulations over HPC Infrastructures"}, {"paperId": "d52ba3b8b67bb05a9fdb1def113a8d7a75546b10", "title": "ContTune: Continuous Tuning by Conservative Bayesian Optimization for Distributed Stream Data Processing Systems"}, {"paperId": "0f119b265c39f70db0b6965ed9a68a85959e1e3f", "title": "Towards General and Efficient Online Tuning for Spark"}, {"paperId": "d2c1744871529d90a02d7bda9129605a4eaed3f0", "title": "DBPA: A Benchmark for Transactional Database Performance Anomalies"}, {"paperId": "ebe7b4b3931d9df634b0e9667ec7686e1eac9c94", "title": "Grep: A Graph Learning Based Database Partitioning System"}, {"paperId": "57afd1f1fecd966f99fc37541cc30149d9041e41", "title": "Time and Cost-Efficient Cloud Data Transmission based on Serverless Computing Compression"}, {"paperId": "219af6ca8d476bd2d8ac0cf0eac3dc0297ce6c00", "title": "FASTune: Towards Fast and Stable Database Tuning System with Reinforcement Learning"}, {"paperId": "fc4e95185b9a669dab434c42fdcc5aa13c59c0bb", "title": "A Unified and Efficient Coordinating Framework for Autonomous DBMS Tuning"}, {"paperId": "84f60428f78964c0cb663ee36caf222e9f182b32", "title": "Rover: An Online Spark SQL Tuning Service via Generalized Transfer Learning"}, {"paperId": "adb91139a9d2d43abb0fb4bb0bdcc8ca53e00457", "title": "Survey on performance optimization for database systems"}, {"paperId": "a31dffc8d8a3099eb357f429d1bc9cdfbd609377", "title": "SparkCAD: Caching Anomalies Detector for Spark Applications"}, {"paperId": "a630e2526b37242864f8995c77f8af9bc86c9895", "title": "Blink: Lightweight Sample Runs for Cost Optimization of Big Data Applications"}, {"paperId": "957aed5b8b4660b021c5d72e9169f5a94dc9f593", "title": "Optimizing complex event forecasting"}, {"paperId": "a0da0fb1e2766506794489ec2f077cb63de4d699", "title": "Learning-Based Data Storage [Vision] (Technical Report)"}, {"paperId": "6397ec27b8f11072668c1d447dc6a5dc019050b7", "title": "Lightweight and Accurate Cardinality Estimation by Neural Network Gaussian Process"}, {"paperId": "dee8afd8dfa6c3c161542e337236dd41caa1f256", "title": "Juggler: Autonomous Cost Optimization and Performance Prediction of Big Data Applications"}, {"paperId": "d768710878f296ee8c3c9812d03dbe407a6f3759", "title": "Adaptive Code Learning for Spark Configuration Tuning"}, {"paperId": "95a7e4b4d535a9c61a6f466a090a4004ef151b50", "title": "Machine Learning for Data Management: A System View"}, {"paperId": "41eafea6256ab2af225617006eac763b2a420ccd", "title": "LOCAT: Low-Overhead Online Configuration Auto-Tuning of Spark SQL Applications"}, {"paperId": "c2f111fd378b0347eaf2f747f85c6b30c044a0da", "title": "Towards Dynamic and Safe Configuration Tuning for Cloud Databases"}, {"paperId": "8dbc554068e80aaf0e7647561eaed59e907318c1", "title": "Facilitating Database Tuning with Hyper-Parameter Optimization: A Comprehensive Experimental Evaluation"}, {"paperId": "b9804fed72a26751e2103007004944c01e6bc0e8", "title": "A Survey on Deep Reinforcement Learning for Data Processing and Analytics"}, {"paperId": "b1e762e4e70fceb0e95144e728c3cde99c4639d9", "title": "Uncertainty-aware Cardinality Estimation by Neural Network Gaussian Process"}, {"paperId": "505a3f848c17e8dd04abc3e77e164ce877f673de", "title": "Machine Learning for Databases"}, {"paperId": "a68555a8d702ad5add8ffacb8b5d654df5c2f30c", "title": "Towards instance-optimized data systems"}, {"paperId": "f3276547920f2fc816dbeb62af95741ba1dfc2bb", "title": "ResTune: Resource Oriented Tuning Boosted by Meta-Learning for Cloud Databases"}, {"paperId": "8e62ef5cb205677be8461ea2fda2fcd214e5391a", "title": "MB2: Decomposed Behavior Modeling for Self-Driving Database Management Systems"}, {"paperId": "9a3329514b1de66ef2839324a33bfaf3d91f2e2b", "title": "AI Meets Database: AI4DB and DB4AI"}, {"paperId": "288782f4cd97f73af114bdec83ca2c92acd3e4a8", "title": "An Inquiry into Machine Learning-based Automatic Configuration Tuning Services on Real-World Database Management Systems"}, {"paperId": "428887384e902437bb222665addba0c0f5661024", "title": "You Only Run Once: Spark Auto-Tuning From a Single Run"}, {"paperId": "b062366d9bcf3284c2a38be0b95765b1aac683bf", "title": "Eraser: Eliminating Performance Regression on Learned Query Optimizer"}, {"paperId": "0812522fc5ec2ad6d5549358a43c75755b4afef0", "title": "Comparing Black-Box Optimization Methods for Online DBMS Tuning"}, {"paperId": "3d5159c644841b0a0a9c726814b94d6004840726", "title": "Auto-tuning Spark with Bayesian optimisation"}, {"paperId": "5fdf58b7ae808ac0696af22617c95d0a035f4ba3", "title": "On Automatic Database Management System Tuning Using Machine Learning"}, {"paperId": "d3077a722238fe2b7b717d88549ed81252eff456", "title": "Database Meets AI: A Survey"}]}
