{"paperId": "9f380e87578599c49ed82b0e5717981614df896c", "publicationVenue": null, "title": "Aberrant High-Order Dependencies in Schizophrenia Resting-State Functional MRI Networks", "abstract": "The human brain has a complex, intricate functional architecture. While many studies primarily emphasize pairwise interactions, delving into high-order associations is crucial for a comprehensive understanding of how functional brain networks intricately interact beyond simple pairwise connections. Analyzing high-order statistics allows us to explore the nuanced and complex relationships across the brain, unraveling the heterogeneity and uncovering patterns of multilevel overlap on the psychosis continuum. Here, we employed high-order independent component analysis (ICA) plus multivariate information-theoretical metrics ($O$-information and $S$-information) to estimate high-order interaction to examine schizophrenia using resting-state fMRI. The results show that multiple brain regions networks may be altered in schizophrenia, such as temporal, subcortical, and higher-cognitive brain regions, and meanwhile, it also shows that revealed synergy gives more information than redundancy in diagnosing schizophrenia. All in all, we showed that high-order dependencies were altered in schizophrenia. Identification of these aberrant patterns will give us a new window to diagnose schizophrenia.", "venue": "", "year": 2023, "fieldsOfStudy": ["Biology"], "publicationTypes": null, "publicationDate": "2023-10-26", "journal": null, "authors": [{"authorId": "2262079317", "name": "Qiang Li"}, {"authorId": "2183622231", "name": "V. Calhoun"}, {"authorId": "2261740901", "name": "Adithya Ram Ballem"}, {"authorId": "2261911395", "name": "Shujian Yu"}, {"authorId": "2261740644", "name": "Jesus Malo"}, {"authorId": "2602754", "name": "A. Iraji"}], "citations": [{"paperId": "79bd61d6bc171bd010f7666d375ab8af49a5c98b", "title": "Visual Image Reconstructed Without Semantics from Human Brain Activity Using Linear Image Decoders and Nonlinear Noise Suppression"}, {"paperId": "1e25af185e1ac96db1f247db273d864d2e0bdc9e", "title": "A Telescopic Independent Component Analysis on Functional Magnetic Resonance Imaging Data Set"}, {"paperId": "dd558ef71778066d96dc9efc5d00025dc66cfda9", "title": "Exploring Nonlinear Dynamics In Brain Functionality Through Phase Portraits And Fuzzy Recurrence Plots"}, {"paperId": "4f11288956dddac97cee2b0a9362cea26bb8dd48", "title": "Revealing Complex Functional Topology Brain Network Correspondences Between Humans and Marmosets"}]}
