{"paperId": "9f3ac60895e09e812dadcd89bd87d4d9b6da41d3", "publicationVenue": null, "title": "Clustering pavement aggregate particles based on shape and texture properties", "abstract": "Aggregates are the major component of pavements. Physical characteristics of aggregates significantly affect the properties of pavements. Different pavement construction projects may require different characteristics of aggregate. Proper selection of aggregate with consistent shape properties ensures high performance of pavements. The available test methods for evaluating the aggregate physical properties and classifying them are laborious, time-consuming, and subjective. This study presents the development of an objective system which evaluates the shape properties of aggregate particles and classifies them into distinct groups regarding their sphericity, form, angularity and texture features. By using this system, the heterogeneity in an aggregate sample based on a given feature could be assessed. This system includes a laser scanner developed at the University of Texas at Austin to scan aggregate particles. Total of 1398 aggregate particles, from eight different quarries in the state of Texas, were scanned. The scanned data were analyzed using a MATLAB algorithm for measuring the sphericity, form, angularity, and texture of particles. All the measurements were stored in an Excel file and were imported to another algorithm developed in R software and OpenBUGS package to cluster the aggregate particles. Several methods of clustering were reviewed and finally, model-based clustering approach was selected. The model-based cluster analysis was applied to the measurements aiming to detect subclasses in aggregate particles based on each feature. This study shows how to use this clustering approach to group the particles based on their sphericity, form, angularity, and texture features.", "venue": "", "year": 2017, "fieldsOfStudy": ["Materials Science"], "publicationTypes": ["Review"], "publicationDate": "2017-12-06", "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "101018134", "name": "S. Kouchaki"}], "citations": []}
