{"paperId": "9f3c4fa503475e524b292447b1e51805a9f95e77", "publicationVenue": {"id": "38a8edf0-2998-4daf-93f7-16f34689e228", "name": "IEEE Systems Journal", "type": "journal", "alternate_names": ["IEEE Syst J"], "issn": "1932-8184", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=4267003", "alternate_urls": ["http://www.systemsjournal.org/"]}, "title": "Campus Edge Computing Network Based on IoT Street Lighting Nodes", "abstract": "This incredibly rapid adoption of Internet of Things (IoT) and e-learning technology, a smart campus provides many innovative applications, such as ubiquitous learning, smart energy, and security services to campus users via numerous IoT devices. However, as more and more IoT devices are integrated and imported, the inadequate campus network resource caused by the sensor data transport and video streaming is also a significant problem. This paper proposes a campus edge computing network in the hardware–software co-design process. The system employs street lighting as the IoT network communication node device. The campus platform integrates campus courses service, regulatory networks, mobile wireless networks, and other computing services. Neural network learning algorithms are employed to analyze the network and compute resource required by each network node operates as a whole network resource allocation service. Moreover, the learning algorithms will be adjusted as the bidirectional IoT communication to avoid inadequate resources with many IoTs service and data streams in the overall campus network service quality. The experimental results show that the proposed mechanism that the edge computing reduces the cloud loading and predicts and adjusts the distribution of the overall network can efficiently allocate resources and maintain load balance.", "venue": "IEEE Systems Journal", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-03-01", "journal": {"name": "IEEE Systems Journal", "pages": "164-171", "volume": "14"}, "authors": [{"authorId": "34358600", "name": "Yao-Chung Chang"}, {"authorId": "1753353", "name": "Ying-Hsun Lai"}], "citations": [{"paperId": "60a40d0aeeb204095835cddbbd9cb4eb490948af", "title": "A Multidimensional Data Collection and Edge Computing Analysis Method"}, {"paperId": "83e8af507697b73f6c0b7741d9af373ce332fa37", "title": "Smart Campus 4.0: Digitalization of University Campus with Assimilation of Industry 4.0 for Innovation and Sustainability"}, {"paperId": "8961012134d85af52c26f2850df573cd73184076", "title": "Learning Temporal and Spatial Features Jointly: A Unified Framework for Space-Time Data Prediction in Industrial IoT Networks"}, {"paperId": "eb2b957c1b1440167da45f066a4a5d3f016d2b46", "title": "EigenEdge: Real-Time Software Execution at the Edge with RISC-V and Hardware Accelerators"}, {"paperId": "5f1a9162ea7f89f02e29f8dee55f9e1cfcd3f4da", "title": "Distributed artificial intelligence: Taxonomy, review, framework, and reference architecture"}, {"paperId": "3c5c21341d4b974b91f5affa4824c90641b31ac4", "title": "Intelligent Street Lighting System using LoRa Network and Pizeoelectric Sensors"}, {"paperId": "3fe973271ab0c4c1bac2a017c4fc43fc5ddac4ec", "title": "Fog-DeepStream: A new approach combining LSTM and Concept Drift for data stream analytics on Fog computing"}, {"paperId": "20eec65d8c44f9315ece2a9164d896b47306d42f", "title": "Campus Network Security Research based on Random Forest Algorithm"}, {"paperId": "a51036fe0b498338d5812b71ea3d79797a3dc7e0", "title": "Smart City: Recent Advances in Intelligent Street Lighting Systems Based on IoT"}, {"paperId": "13bb596d9c971b6ba94f31a461b8583e0a693788", "title": "GreenEdge: Joint Green Energy Scheduling and Dynamic Task Offloading in Multi-Tier Edge Computing Systems"}, {"paperId": "534a20bd80cacaf8a4edc467f26be2bebc0ef488", "title": "IoT-Enabled Smart Agriculture: Architecture, Applications, and Challenges"}, {"paperId": "a10c517f805492db39374d55c03daea1092074b6", "title": "Motion Mode Recognition for Traffic Safety in Campus Guiding Application"}, {"paperId": "34e31c7d2cd969c24acf350077527c47f8149a4f", "title": "Development of a cloud platform for gathering, storing and analysis of video data"}, {"paperId": "3cbf0de56365c34ab0f7f2a2c96b36b8ac5e9dd2", "title": "A Review on Edge Computing in Smart Energy by means of a Systematic Mapping Study"}, {"paperId": "67555afd7f419828fddaa45ef7d5a119690b4a8a", "title": "Towards Next Generation Teaching, Learning, and Context-Aware Applications for Higher Education: A Review on Blockchain, IoT, Fog and Edge Computing Enabled Smart Campuses and Universities"}, {"paperId": "0ff909c5574e293cae3b6af376c8f030553d40fc", "title": "Design and Experimental Validation of a LoRaWAN Fog Computing Based Architecture for IoT Enabled Smart Campus Applications †"}, {"paperId": "4cd03cd34e7e94d1b1ee293d5dead8efc24c1a6d", "title": "Convergence of Edge Computing and Deep Learning: A Comprehensive Survey"}, {"paperId": "e80b502d0e7de809b3f8547ff2dc0195254eabb3", "title": "A Survey of Multi-Access Edge Computing in 5G and Beyond: Fundamentals, Technology Integration, and State-of-the-Art"}, {"paperId": "5064d4e5d86cc99c78edbbcc3dcafaed81ea8760", "title": "A Study on IoT based Smart Street Light Systems"}, {"paperId": "79d43cb9c1fd9a9bcf502985bc5a0428fd1391ec", "title": "Examining IoT-Based Smart Campus Adoption Model: An Investigation Using Two-Stage Analysis Comprising Structural Equation Modelling and Artificial Neural Network"}, {"paperId": "6abb72de350515e58cec3ba29b75865dbca3ff6b", "title": "Challenges and Solutions of Surveillance Systems in IoT-Enabled Smart Campus: A Survey"}, {"paperId": "82cb0aa03a54709010d323354e50e9503249d341", "title": "IoT Based Design of an Intelligent Light System Using CoAP"}, {"paperId": "12b3e5f854af95d3da98119ec14d59d15297f90a", "title": "Artificial Intelligence Applications on Edge"}]}
