{"paperId": "9f519ba59c0b3d0ecf40064b0ac987ade0a7c488", "publicationVenue": null, "title": "Multiple Nested Schema of HBase for Migration from SQL", "abstract": "With the development of web application, the demand of query performance and expansion becomes increasingly necessary. Relational database seems hardly handling with this, more and more applications choose migrating to NoSQL database such as HBase. The features of high reliability, high performance, column-oriented storage, high scalability, and real-time read and write, won favor from public. In this paper, we use two concepts Nested and Multiple Nested to describe join keys reference relationship between tables in relational database. Because HBase only support the column family nest the column qualifier, it is hard to deal with the situation of Multiple Nested after data migration from relational database meanwhile ensure high query performance in transformed HBase. We propose a novel HBase schema for migrating from relational database to HBase, which supports multiple nested. With this schema in HBase, query only once on one table for any query is needed to get the data, and query efficiency has been greatly improved, especially for join query. Additionally, index migration is available in this scheme, which supports faster query. Finally, this paper proposes a mapping algorithm to find column name corresponding to attribute in relational database.", "venue": "2014 Ninth International Conference on P2P, Parallel, Grid, Cloud and Internet Computing", "year": 2014, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2014-11-08", "journal": {"name": "2014 Ninth International Conference on P2P, Parallel, Grid, Cloud and Internet Computing", "pages": "338-343"}, "authors": [{"authorId": "8279129", "name": "Gansen Zhao"}, {"authorId": "2107923698", "name": "Libo Li"}, {"authorId": "2118274314", "name": "Zijing Li"}, {"authorId": "2114097758", "name": "Qiaoying Lin"}], "citations": [{"paperId": "72d605205c63d94eead320c8784dd595b6c0aa2b", "title": "Prediction of Process Quality Performance Using Statistical Analysis and Long Short-Term Memory"}, {"paperId": "ad4fedc5c6a29b56055dce2c0e693232fdb353c0", "title": "Schema design advisor model for RDBMS to NoSQL database migration"}, {"paperId": "efcbcf81aaace5516ac0eafcd59d0def9de34f14", "title": "Log Data Modeling and Acquisition in Supporting SaaS Software Performance Issue Diagnosis"}, {"paperId": "844f268fe4dc3c33ef19f14fdcf47640becc139d", "title": "Relational into Non-Relational Database Migration with Multiple-Nested Schema Methods on Academic Data"}, {"paperId": "9028d46721878995917bd0bd9c2e935a02915f79", "title": "Toward RDB to NoSQL: transforming data with metamorfose framework"}, {"paperId": "4eaf51ba1ce9fcfa65a82e16ba33526fe2508f4c", "title": "SQL to NoSQL : What to do and How"}, {"paperId": "eacfaac11e07972d0b2aff7f8f50decd8b56818b", "title": "Graph-Based Denormalization for Migrating Big Data from SQL Database to NoSQL Database"}, {"paperId": "01955a0b7ad559e173b48606f558cbbfdd9e0b83", "title": "Migrating from SQL to NOSQL Database: Practices and Analysis"}, {"paperId": "3adb340caaafdc388ecb5c97dc14de9fb456eeef", "title": "Developing Multiple Nested Schema to Reduce Data Redundancy in CONoSQLDB Schema"}, {"paperId": "18e05a88bf6c10dafacc2b324193727844003682", "title": "Techniques and guidelines for effective migration from RDBMS to NoSQL"}, {"paperId": "158c4da34ab921c991a17f254d877eb9871b37e0", "title": "Migration from relational to NoSQL database"}, {"paperId": "35c7916ca70a59b53dce8396eb37c97f5f3f867d", "title": "Enhanced Graph Transforming Algorithm to solve transitive dependency between vertices"}, {"paperId": "b6853a2d6086a84e2fbc85a7e4cfbcf11322321a", "title": "Hug the Elephant: Migrating a Legacy Data Analytics Application to Hadoop Ecosystem"}, {"paperId": "09873c8458a51c99424aa29d493bc6f106304a19", "title": "Relational Database to NoSQL Conversion by Schema Migration and Mapping"}, {"paperId": "a4c7eed69558ba96ea2d0e8cb2810fc359b43175", "title": "SQL-to-NoSQL Schema Denormalization and Migration: A Study on Content Management Systems"}, {"paperId": "0d48e520d116a2de46daf3cc13224a7685ccf9d3", "title": "Performance Analysis of Schema Design Approaches for Migration from RDBMS to NoSQL Databases"}, {"paperId": "fd50d603d64dd0bf98a7a5e64175fb79c5491acb", "title": "A NEW APPROACH FOR MIGRATION OF A RELATIONAL DATABASE INTO COLUMN-ORIENTED NOSQL DATABASE ON HADOOP"}, {"paperId": "c3d728c7cbefe1595032822385d93490f088fe22", "title": "Migration from RDBMS to Column-Oriented NoSQL: Lessons Learned and Open Problems"}, {"paperId": "e9d1785f75e11a13762737a2eb74402ad5cb044c", "title": "Appropches used in efficient migrption from Relptionpl Dptpbpse to NoSQL Dptpbpse"}, {"paperId": "9de3ecbf3cfe069b0ab0b89f836e6aa66216a63c", "title": "Distributed Web Crawlers using Hadoop"}, {"paperId": "41124a3206e85990b4dbf6f1bd1b85544e44c672", "title": "An Approach and DSL in support of Migration from relational to NoSQL Databases"}]}
