{"paperId": "9f54e7302c27fed02a6e43ce24128a44b85847b0", "publicationVenue": {"id": "2135230a-3b24-4b71-9583-60624389377a", "name": "IEEE Transactions on Industrial Informatics", "type": "journal", "alternate_names": ["IEEE Trans Ind Informatics"], "issn": "1551-3203", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=9424", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=9424"]}, "title": "TrustBlkSys: A Trusted and Blockchained Cybersecure System for IIoT", "abstract": "Industrial Internet of Things (IIoT) has emerged as a new paradigm in the era of smart systems where interactions and transmission of messages among various entities in an industrial ecosystem are done autonomously. This includes manufacturing of products, shipment process, storage of records, and counting the data, to name a few. However, the involvement of multiple cyber threats that accompany the smart devices may lead the organizations on a heavy risk of profits. Even though the number of cybersecurity approaches have been proposed to ensure a secure and efficient communication mechanism in IIoT systems, the identification of cybersecurity issues in IIoT applications while exchanging the data is still at its early stage. The aim of this article is to propose an efficient cybersecurity communication mechanism using the trust evaluation system of each device to make a correct decision during communication. In addition, the evaluated trust of each device is further analyzed and monitored through a blockchain-based mechanism. The proposed approach is validated against an existing scheme in terms of various security metrics, such as sensitivity of devices while communicating, convergence time of transmitting information and percentage, and probability of malicious devices in terms of data delivery rate, false authentication, and trust value computation.", "venue": "IEEE Transactions on Industrial Informatics", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-02-01", "journal": {"name": "IEEE Transactions on Industrial Informatics", "pages": "1592-1599", "volume": "19"}, "authors": [{"authorId": "2471373", "name": "Geetanjali Rathee"}, {"authorId": "9184919", "name": "C. A. Kerrache"}, {"authorId": "2855805", "name": "Mohamed Lahby"}], "citations": [{"paperId": "3ff8c603856a287d4fbef082e162400accf6d49d", "title": "Privacy-preserving trust management method based on blockchain for cross-domain industrial IoT"}, {"paperId": "5c1090858a73516bece7399227d51e6bcf76dc4e", "title": "Machine learning enabled Industrial IoT Security: Challenges, Trends and Solutions"}, {"paperId": "790a4fcec5ef76c1301c9f2852bd266b25598bb4", "title": "A production interface to enable legacy factories for industry 4.0"}, {"paperId": "a23db08111da5f166621323d42ac2ddf2e8098fd", "title": "Analysis of Recent IIoT Security Technology Trends in a Smart Factory Environment"}, {"paperId": "bd327c411d3a11cdec8136735caa20c506ebe6ff", "title": "Advancements in Security of Internet of Things Using Blockchains"}, {"paperId": "671e4aa47e2266b021c8662d44fb61bc7b7b8e25", "title": "A Blockchain-Based Intrusion Detection System Using Viterbi Algorithm and Indirect Trust for IIoT Systems"}, {"paperId": "f80ca60c896bb068f79a231edd7e5e2f09a777a2", "title": "An Ambient Intelligence approach to provide secure and trusted Pub/Sub messaging systems in IoT environments"}, {"paperId": "9613616b847f1dcc0057549b060c50d1c40b0523", "title": "IoT: Communication Protocols and Security Threats"}]}
