{"paperId": "9f5ac3c9ce8d8ea095e83dae2de29694148429d1", "publicationVenue": {"id": "1e33b3be-b2ab-46e9-96e8-d4eb4bad6e44", "name": "Annual Meeting of the Association for Computational Linguistics", "type": "conference", "alternate_names": ["Annu Meet Assoc Comput Linguistics", "Meeting of the Association for Computational Linguistics", "ACL", "Meet Assoc Comput Linguistics"], "url": "https://www.aclweb.org/anthology/venues/acl/"}, "title": "Your spouse needs professional help: Determining the Contextual Appropriateness of Messages through Modeling Social Relationships", "abstract": "Understanding interpersonal communication requires, in part, understanding the social context and norms in which a message is said. However, current methods for identifying offensive content in such communication largely operate independent of context, with only a few approaches considering community norms or prior conversation as context. Here, we introduce a new approach to identifying inappropriate communication by explicitly modeling the social relationship between the individuals. We introduce a new dataset of contextually-situated judgments of appropriateness and show that large language models can readily incorporate relationship information to accurately identify appropriateness in a given context. Using data from online conversations and movie dialogues, we provide insight into how the relationships themselves function as implicit norms and quantify the degree to which context-sensitivity is needed in different conversation settings. Further, we also demonstrate that contextual-appropriateness judgments are predictive of other social factors expressed in language such as condescension and politeness.", "venue": "Annual Meeting of the Association for Computational Linguistics", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-07-06", "journal": {"pages": "10994-11013"}, "authors": [{"authorId": "3046220", "name": "David Jurgens"}, {"authorId": "2261734475", "name": "Agrima Seth"}, {"authorId": "46804332", "name": "Jack E. Sargent"}, {"authorId": "2221227299", "name": "Athena Aghighi"}, {"authorId": "40405967", "name": "Michael Geraci"}], "citations": [{"paperId": "ca60cb73d770f7093100cdea12b19881e7610df1", "title": "DOSA: A Dataset of Social Artifacts from Different Indian Geographical Subcultures"}, {"paperId": "c1592c211f8b7791a55afd7162249c723b87c237", "title": "Do LLMs Understand Social Knowledge? Evaluating the Sociability of Large Language Models with SocKET Benchmark"}]}
