{"paperId": "9f5fbde5efc101fcc620b40d4c4f523833845c39", "publicationVenue": null, "title": "A Smart Disaster Management System for Future Cities Using Deep Learning, GPUs, and In-Memory Computing", "abstract": null, "venue": "Smart Infrastructure and Applications", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": null, "journal": {"name": "Smart Infrastructure and Applications"}, "authors": [{"authorId": "3121734", "name": "M. Aqib"}, {"authorId": "39799687", "name": "Rashid Mehmood"}, {"authorId": "103375638", "name": "Ahmed Alzahrani"}, {"authorId": "2574028", "name": "Iyad A. Katib"}], "citations": [{"paperId": "5caa4d4b15b2de2a671e99e33530305c7e5629c6", "title": "Shaping resilient buildings and cities: Climate change impacts, metrics, and strategies for mitigation and adaptation"}, {"paperId": "91e63282fd45eee29b57cf6e6ded6af2f2b0d888", "title": "A deep learning approach to improve built asset operations and disaster management in critical events: an integrative simulation model for quicker decision making"}, {"paperId": "ea1e710d0ec58e8cf9a5dd4fb4fbeb92b9230d26", "title": "Memoria y desastre socionatural. Una mirada global a los estudios sociales de la memoria y su relación con desastres socionaturales entre 2000 y 2020"}, {"paperId": "37334cc8664467c8ac1933d8270ec6220a4c3e40", "title": "Data Locality in High Performance Computing, Big Data, and Converged Systems: An Analysis of the Cutting Edge and a Future System Architecture"}, {"paperId": "d4b0338977c47a0ac27cef10ec181aae6978a297", "title": "A proof-of-concept and feasibility analysis of using social sensors in the context of causal machine learning-based emergency management"}, {"paperId": "26bcf9e4de43a6768f3ac6dc90b3c44840acf0b7", "title": "iResponse: An AI and IoT-Enabled Framework for Autonomous COVID-19 Pandemic Management"}, {"paperId": "d705f0071b80d54ec861e60ec62e532ba16ac4e3", "title": "Optimization Methods in Crises: Patterns and Practices"}, {"paperId": "3ef4b2ec1507df96be548110d4b7d139a546d96e", "title": "Application of IoT Products in Smart Cities of India"}, {"paperId": "d4157b40c134a907ee7286bafbbae3400c9a2320", "title": "Distributed Artificial Intelligence-as-a-Service (DAIaaS) for Smarter IoE and 6G Environments"}, {"paperId": "429b5b5125d7be95d32fa07e3f8948442fa694ee", "title": "DeepDist: A Deep-Learning-Based IoV Framework for Real-Time Objects and Distance Violation Detection"}, {"paperId": "f986edb93a6af37296efdafbe715657d49e04f2a", "title": "Can Building “Artificially Intelligent Cities” Safeguard Humanity from Natural Disasters, Pandemics, and Other Catastrophes? An Urban Scholar’s Perspective"}, {"paperId": "64f774def4018e096e9c9e2dee7dadbe2e698a9f", "title": "Cloud assisted big data information retrieval system for critical data supervision in disaster regions"}, {"paperId": "17f43a1a979d2d8d76229ba104a2367523496452", "title": "TAAWUN: a Decision Fusion and Feature Specific Road Detection Approach for Connected Autonomous Vehicles"}, {"paperId": "304944549ddc3c08c401ddd3c4b2faafc1c2d7e9", "title": "Rapid Transit Systems: Smarter Urban Planning Using Big Data, In-Memory Computing, Deep Learning, and GPUs"}, {"paperId": "cfe6aeccbcb946bc8ddc1aab0c2d7afa8ea7f29c", "title": "Predicting Stock Closing Prices in Emerging Markets with Transformer Neural Networks: The Saudi Stock Exchange Case"}, {"paperId": "39b055ef2460926ba0e1a3ef64d4da816ac5d93a", "title": "In-Memory Deep Learning Computations on GPUs for Prediction of Road Traffic Incidents Using Big Data Fusion"}]}
