{"paperId": "9f608425abddc7b79eb91db2ea80f6b4439338f2", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Sustainable Competitive Advantage Driven by Big Data Analytics and Innovation", "abstract": "Big data analytics (BDA) is one of the main pillars of Industry 4.0. It has become a promising tool for supporting the competitive advantages of firms by enhancing data-driven performance. Meanwhile, the scarcity of resources on a worldwide level has forced firms to consider sustainable-based performance as a critical issue. Additionally, the literature confirms that BDA and innovation can enhance firms’ performance, leading to competitive advantage. However, there is a lack of studies that examine whether or not BDA and innovation alone can sustain a firm’s competitive advantage. Drawing on previous studies and dynamic capability theory, this study proposes that big data analytics capabilities (BDAC), supported by a high level of data availability (DA), can improve innovation capabilities (IC) and, hence, lead to the development of a sustainable competitive advantage (SCA). This study examines the proposed hypotheses by surveying 117 manufacturing firms and analyzing responses via partial least squares–structural equation modeling (PLS-SEM) statistical software. Findings reveal that BDAC relies significantly on the degree of DA and has a significant role in increasing IC. Furthermore, the analysis confirms that IC has a significant and direct effect on a firm’s SCA, while BDAC has no direct effect on SCA. This study provides valuable insights for manufacturing firms to improve their sustainable business performance and theoretical and practical insights into BDA implementation issues in attaining sustainability in processes.", "venue": "Applied Sciences", "year": 2020, "fieldsOfStudy": ["Business"], "publicationTypes": ["Review"], "publicationDate": "2020-09-28", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "40446684", "name": "M. Ramadan"}, {"authorId": "119642536", "name": "H. Shuqqo"}, {"authorId": "2000840549", "name": "Layalee Qtaishat"}, {"authorId": "122868998", "name": "Heba Asmar"}, {"authorId": "2064177", "name": "B. Salah"}], "citations": [{"paperId": "83976bde6b619c3ac71069e0a0d04bdc5104f0a3", "title": "Big data driven supply chain innovative capability for sustainable competitive advantage in the food supply chain: Resource‐based view perspective"}, {"paperId": "ff5672775fec3afbeaa0af7e1b37ceeda4e47704", "title": "Optimal investment strategy on data analytics capabilities of startups via Markov decision analysis"}, {"paperId": "f799cbbc623ea5e01ac61dab2eb844cd9c617f46", "title": "Do reliable big and cloud data analytics capabilities in manufacturing firms' supply chain boosting unique comparative advantage? A moderated-mediation model of data-driven competitive sustainability, green product innovation and green process innovation at North Africa region"}, {"paperId": "15b814da56c19056da2157ce324cf025a99bc767", "title": "How big data analytics can create competitive advantage in high-stake decision forecasting? The mediating role of organizational innovation"}, {"paperId": "0f31aca1a081b023d8b76dff505d5ca410fc2171", "title": "How Can Big Data Analytics and Artificial Intelligence Improve Networked Enterprises’s Sustainability?"}, {"paperId": "6e3c05443579a9d4951bfe9e7f30d0902301abc8", "title": "Estrategias dinámicas para la ventaja competitiva en la era digital: Un modelo conceptual"}, {"paperId": "8fcc7c08e92789f7db3d3c9144d750f760333c1d", "title": "Examining The Role of Big Data Analytics and Data Availability on Sustainable Competitive Advantage and Business Performance: Mediating Role of Innovative Capabilities"}, {"paperId": "6da5ddb68924a7dded376af5635072576df7c6ee", "title": "Do digital technologies pay off? A meta-analytic review of the digital technologies/firm performance nexus"}, {"paperId": "97b45640a7c007689af0ebfc68b0286be7f58344", "title": "Big data analytics capabilities: Patchwork or progress? A systematic review of the status quo and implications for future research"}, {"paperId": "11b7d4841079bdb2d00c62c26a1fe41a485572e9", "title": "Fostering comparative advantage: the roles of data-driven competitive sustainability, green product innovation and green process innovation through moderated-mediation model"}, {"paperId": "6e993977bd90df7f2ecfd201b3bd5037e63cfba9", "title": "The impact of business intelligence, big data analytics capability, and green knowledge management on sustainability performance"}, {"paperId": "436cf000ab13a574d8fb8619583253d674ae80ff", "title": "Augmenting hotel performance in Malaysia through big data analytics capability and artificial intelligence capability"}, {"paperId": "40bc8c927b855fa66103e29abe1ba49aa8e979ab", "title": "Regional Big Data Application Capability and Firm Green Technology Innovation"}, {"paperId": "6da0fad1191d2b403bbcc2866242b32782b57ba1", "title": "Unlocking sustainable supply chain performance through dynamic data analytics: a multiple mediation model of sustainable innovation and supply chain resilience"}, {"paperId": "5ea3b6406bfcc30e2c41ecd77a56b7b53cd03658", "title": "Big Data Analytics Capability and Sustainability: A Systematic Literature Review"}, {"paperId": "48cae19e19303d35ea4cfa5f670afc4b537e809f", "title": "From Industry 4.0 adoption to innovation ambidexterity to firm performance: a MASEM analysis"}, {"paperId": "d66f2d1418ca1d3b26ea53e9fb30467f8ebcefed", "title": "Big Data Analytics and Competitive Advantage: Evidences from Healthcare Services Organistions in Lagos State, Nigeria"}, {"paperId": "0b06985107b70539b94c6c1723b8df346fd67f55", "title": "Analysis of EMC Factors on Electronic Devices Using PLS-SEM Method: A Case Study in Vietnam"}, {"paperId": "e77ae98480f8f2cf14751c9ff33d477266f812b6", "title": "Big data analytics capabilities and supply chain performance: testing a moderated mediation model using partial least squares approach"}, {"paperId": "fdd9789a344409eea518d9ea62c06dbac179eba3", "title": "IT Capabilities, Strategic Flexibility and Organizational Resilience in SMEs Post-COVID-19: A Mediating and Moderating Role of Big Data Analytics Capabilities"}, {"paperId": "210d97a6d567b9284ad7d726a87eaec731800888", "title": "A Framework to Build a Big Data Ecosystem Oriented to the Collaborative Networked Organization"}, {"paperId": "0650f7727e6be3dabcd9c419655e7d02cc445a3a", "title": "Digital transformation, smart technologies, and eco-innovation are paving the way toward sustainable supply chain performance"}, {"paperId": "70e3a0ede079983997ffd45d7aea8749145f3c9f", "title": "Green Intellectual Capital and Green Supply Chain Performance: Does Big Data Analytics Capabilities Matter?"}, {"paperId": "8191bb4823e04317d70356ef687d1c16daa54e1e", "title": "Can big data analytics capabilities promote a competitive advantage? Green radical innovation, green incremental innovation and data-driven culture in a moderated mediation model"}, {"paperId": "fdd6c0592e8118b2fb23df719fa88eea0bff0406", "title": "Impact of Business Model Innovation on Sustainable Performance of Processed Marine Food Product SMEs in Thailand—A PLS-SEM Approach"}, {"paperId": "eb7fc680f2b5c0736d9810d176a0fd0234ad3163", "title": "Big Data Capability and Sustainable Competitive Advantage: The Mediating Role of Ambidextrous Innovation Strategy"}, {"paperId": "fbef3eea233fe44b35e566ddf407826a12fd7f9e", "title": "What translates big data into business value? A meta-analysis of the impacts of business analytics on firm performance"}, {"paperId": "9a598a955068d5c6e7ec8ab65bca0747e9b00751", "title": "Can intellectual capital promote the competitive advantage? Service innovation and big data analytics capabilities in a moderated mediation model"}, {"paperId": "d428b4296cdff0cc624a51fb90e2427ecd4e53a4", "title": "Big Data and AI for Process Innovation in the Industry 4.0 Era"}, {"paperId": "78394fc0cac397f0cc6aabef416e07cb54c8b45d", "title": "Association of Big Data with Sustainable Competitive Advantage in Online Retail Segment: A Serial Mediation Model for Relating Big Data with Strategic Management Tools"}, {"paperId": "06826b1f2b976513c5aa9e2e5e2879c08faf98cc", "title": "Identifying the Key Big Data Analytics Capabilities in Bangladesh’s Healthcare Sector"}, {"paperId": "6d898100c3e758511942fc7e54aeb31114cb142e", "title": "Industry 4.0-driven operations and supply chains for the circular economy: a bibliometric analysis"}, {"paperId": "0fc268db2878eca39c090e16cfb16b529523bdcb", "title": "The Impact of Integration of Industry 4.0 and Internal Organizational Forces on Sustaining Competitive Advantages and Achieving Strategic Objectives"}, {"paperId": "1abc9db2e66ced1a88e53ebf77e00d5a759033db", "title": "A Comparative Analysis of Selected Predictive Algorithms in Control of Machine Processes"}, {"paperId": "3661efdba807f8af218f32e63454fc5d42844f7d", "title": "Intellectual capital and innovation performance: the moderating role of big data analytics: evidence from the banking sector in Jordan"}, {"paperId": "3d8676aff9dc53cad0611bad951e1e97f6b47816", "title": "The impact of sustainable development strategy on sustainable supply chain firm performance in the digital transformation era"}, {"paperId": "e48a2cb159579384f5e75ea86aca2e36339f6445", "title": "Using Big Data for Sustainability in Supply Chain Management"}, {"paperId": "d4438c3ef2a823caa9297d14d4133ef1898bb0d2", "title": "The Effect of Digital Transformation on Organizational Performance: A Dynamic Capability-Based Model"}, {"paperId": "9a146fc949b22ac3a10147b80a9bdf5217b105d9", "title": "The role of the social and technical factors in creating business value from big data analytics: A meta-analysis"}, {"paperId": "c39b2fb3b9a2500e624f5caea10c11b0b5860d93", "title": "EXPLORING THE RELATIONSHIP BETWEEN BIG DATA AND FIRM PERFORMANCE"}]}
