{"paperId": "9f74d4a015af7258a12588dc756fa6f6926b014e", "publicationVenue": null, "title": "Research Progress and Development Trend of Social Media Big Data (SMBD): Knowledge Mapping Analysis Based on CiteSpace", "abstract": "Social Media Big Data (SMBD) is widely used to serve the economic and social development of human beings. However, as a young research and practice field, the understanding of SMBD in academia is not enough and needs to be supplemented. This paper took Web of Science (WoS) core collection as the data source, and used traditional statistical methods and CiteSpace software to carry out the scientometrics analysis of SMBD, which showed the research status, hotspots and trends in this field. The results showed that: (1) More and more attention has been paid to SMBD research in academia, and the number of journals published has been increased in recent years, mainly in subjects such as Computer Science Engineering and Telecommunications. The results were published primarily in IEEE Access Sustainability and Future Generation Computer Systems the International Journal of eScience and so on; (2) In terms of contributions, China, the United States, the United Kingdom and other countries (regions) have published the most papers in SMBD, high-yield institutions also mainly from these countries (regions). There were already some excellent teams in the field, such as the Wanggen Wan team at Shanghai University and Haoran Xie team from City University of Hong Kong; (3) we studied the hotspots of SMBD in recent years, and realized the summary of the frontier of SMBD based on the keywords and co-citation literature, including the deep excavation and construction of social media technology, the reflection and concerns about the rapid development of social media, and the role of SMBD in solving human social development problems. These studies could provide values and references for SMBD researchers to understand the research status, hotspots and trends in this field.", "venue": "ISPRS Int. J. Geo Inf.", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-10-26", "journal": {"name": "ISPRS Int. J. Geo Inf.", "pages": "632", "volume": "9"}, "authors": [{"authorId": "1854056059", "name": "Ziyi Wang"}, {"authorId": "40363910", "name": "Debin Ma"}, {"authorId": "2142998190", "name": "Ru Pang"}, {"authorId": "50082442", "name": "Fan Xie"}, {"authorId": "2108084900", "name": "Jingxiang Zhang"}, {"authorId": "6491425", "name": "Dongqi Sun"}], "citations": [{"paperId": "5e9e02f1dc95c9fc684eec3201ed0fdcbea2bc44", "title": "Knowledge mapping and emerging trends of urban resilient infrastructure research in urban studies: Precedent work, current progress and future perspectives"}, {"paperId": "092796a6838095e599392678dddeb1319ac97706", "title": "Global trends and developments in mindfulness interventions for diabetes: a bibliometric study"}, {"paperId": "072eaa6601816dcaad30ebae81c237cf24077e57", "title": "Current perspectives and trends of the research on hypertensive nephropathy: a bibliometric analysis from 2000 to 2023"}, {"paperId": "d180dc6e209d0eebd502a20f842f70295202a676", "title": "Bibliometric analysis and global research trends of climate change and cities studies for 30 years (1990–2021)"}, {"paperId": "fcb9e7d1eb765814011bd34c5b179414d3a4f1c4", "title": "Research on Global Education Artificial Intelligence Hotspots from the Perspective of Knowledge Graph"}, {"paperId": "1245098480490a1831b86e302739818899b51f20", "title": "Research Status, Hotspots and Trends of Business English Writing in China: A Bibliometric Analysis Via Citespace"}, {"paperId": "38e07f196ddea099d9eb44ad020a32c2c0850ecd", "title": "A Bibliometric Analysis of English for Specific Purposes from 2011 to 2023 Using Citespace: Visualizing Status, Themes, Evolution, and Emerging Trends"}, {"paperId": "72f6e8ab9c16e2f2cf7bd42395f1fafb82784449", "title": "Global trends in indocyanine green fluorescence navigation in the field of gastric cancer: bibliometrics and knowledge atlas analysis"}, {"paperId": "bd6b70d9f0ea9095db44137ba1566b7b3c011da5", "title": "Study of the Effect of Intestinal Microbes on Obesity: A Bibliometric Analysis"}, {"paperId": "12afd650f0d294aaa6708403ca0b9a8a0f0384f4", "title": "Influence of online engagement of WeChat functions on tourist participation behaviour and leisure travel in Shanghai"}, {"paperId": "cf820dd892c825b05166b40e1b4a95256fc5d110", "title": "Bibliometric Analysis of the Use of Biodiesel Production from Essential Oils as Biofuels"}, {"paperId": "73cf4839bee7d2a92fc3cd04b611536bb012d1ba", "title": "Research on intelligent and efficient analysis and mining technology of power big data based on multi-source data filtering analysis"}, {"paperId": "f2a7311c0695e52566471728391b70d9826048f9", "title": "Visualization Analysis of Global Self-Regulated Learning Status, Hotspots, and Future Trends Based on Knowledge Graph"}, {"paperId": "efdb993fade96a4b4a87a7956e53fe2040ef041d", "title": "Artificial intelligence applicated in gastric cancer: A bibliometric and visual analysis via CiteSpace"}, {"paperId": "b9785b47062b20e7a5a91f247c4cdea0ae948321", "title": "A Bibliometric Review of Constituents, Themes, and Trends in Online Medical Consultation Research."}, {"paperId": "d06e379d837c6dce477c1278982d74ad8397e256", "title": "Landscape Ecological Concepts in Planning (LEP): Progress, Hotspots, and Prospects"}, {"paperId": "91809ff341380a07580e3d4855887240b13a30a4", "title": "Bibliometric and visual analysis of transcranial direct current stimulation in the web of science database from 2000 to 2022 via CiteSpace"}, {"paperId": "c53ee0c047d173a82399c7ba1bd1114c22d24c19", "title": "Social Media Data in Urban Design and Landscape Research: A Comprehensive Literature Review"}, {"paperId": "cf10e543cc8e998e900d577beb72a1090c52e233", "title": "Detecting the research structure and topic trends of social media using static and dynamic probabilistic topic models"}, {"paperId": "6297066d11881bd75b7e594735ce345558840424", "title": "Research Status, Hotspots, and Evolution Trend of Decision-Making in Marine Management Using VOSviewer and CiteSpace"}, {"paperId": "1df6f83bf66542baaec0f5250184323e831ba222", "title": "Multiscale geovisual analysis of knowledge innovation patterns using big scholarly data"}, {"paperId": "fa3eff2a74c921d357452d7e76bd6e7a0163c54e", "title": "Research Progress of Urban Floods under Climate Change and Urbanization: A Scientometric Analysis"}, {"paperId": "c408a0f962a697d615cd8ee2e2dfaa809bad060f", "title": "Analysis of Mapping Knowledge Domains for Privacy Issues in Data Ethics Research"}, {"paperId": "d70b7734f34ab6a76e2943a36398dbfb6d74185b", "title": "Spatial Distribution and Mechanism of Urban Occupation Mixture in Guangzhou: An Optimized GeoDetector-Based Index to Compare Individual and Interactive Effects"}, {"paperId": "d70914fdfa31259d1544cdccc93d80ade1661e13", "title": "Trends of global health literacy research (1995–2020): Analysis of mapping knowledge domains based on citation data mining"}, {"paperId": "4494fc5e6afe08cf18793141cf4891815f590495", "title": "Using Content Analysis to Probe the Cognitive Image of Intangible Cultural Heritage Tourism: An Exploration of Chinese Social Media"}, {"paperId": "293248817a29df8c6e61848bf7c8cc473ccb02d9", "title": "Research Status and Trend of Digital Twin: Visual Knowledge Mapping Analysis"}, {"paperId": "d7f64c75a95e73707abcaef9ede9d0d0a05e37a6", "title": "Visual Analysis of Literature Evolution on Gender Imbalance in Organization Leadership"}, {"paperId": "f58802ed9c4ae08874fcf1269960846c9a1a3594", "title": "A Comparative Analysis of the Current Status and Trends of Domestic and International Privacy Protection Research—CiteSpace-Based Bibliometric Study (1976-2022)"}, {"paperId": "2320ac68db11d752496c93aad06007f5fb67a4f1", "title": "A CiteSpace Analysis of the Hot Topics and Frontier Research of Toni Morrison"}, {"paperId": "30af6bb8872f8559b38f1d0f2cbaf812cf74c409", "title": "Research Progress and Development of Technology in Tourism Research: A Bibliometric Analysis"}, {"paperId": "04c3da7a89c0e59fff9af15ee016a56f9e033ac2", "title": "Bibliometric evaluation of research on political risks in construction projects"}]}
