{"paperId": "9f7a2fc4b215fd4d65b1b1375ecdd709df6242ad", "publicationVenue": null, "title": "HPSOGWO: A Hybrid Algorithm for Scientific Workflow Scheduling in Cloud Computing", "abstract": "Virtualization is one of the key features of cloud computing, where the physical machines are virtually divided into several virtual machines in the cloud. The user’s tasks are run on these virtual resources as per the requirements. When the user requests the services to the cloud, the user’s tasks are allotted to the virtual resources depending on their needs. An efficient scheduling mechanism is required for optimizing the involved parameters. Scientific workflows deals with a large amount of data with dependency constraints and is used to simplify the applications in the diverse scientific domains. Scheduling the workflow in cloud computing is a well-known NP-hard problem. Deploying such data- and compute-intensive workflow on the cloud needs an efficient scheduling algorithm. In this paper, we have proposed a multi-objective model based hybrid algorithm (HPSOGWO), which combines the desirable characteristics of two well-known algorithms, particle swarm optimization (PSO), and grey wolf optimization (GWO). The results are analyzed under complex real-world scientific workflows such as Montage, CyberShake, Inspiral, and Sipht. We have considered the two essential parameters: total execution time and total execution cost while working in the cloud environment. The simulation results show that the proposed algorithm performs well compared to other state-of-the-art algorithms such as round-robin (RR), ant colony optimization (ACO), heterogeneous earliest time first (HEFT), and particle swarm optimization (PSO).", "venue": "", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": null, "journal": {"name": "International Journal of Advanced Computer Science and Applications", "volume": "11"}, "authors": [{"authorId": "1574193293", "name": "Neeraj Arora"}, {"authorId": "145952744", "name": "R. K. Banyal"}], "citations": [{"paperId": "34bd4f1d067b81218416e7a2150649fc67e04f35", "title": "Best-worst northern goshawk optimizer: a new stochastic optimization method"}, {"paperId": "090b57268060d2aec6c1f572162d924bb25ae470", "title": "PPTS-PSO: a new hybrid scheduling algorithm for scientific workflow in cloud environment"}, {"paperId": "45abd9a7c87fb3289ee119acd409f515d296c6cd", "title": "MAA: multi-objective artificial algae algorithm for workflow scheduling in heterogeneous fog-cloud environment"}, {"paperId": "4b14bae53028b98710ebf8dd80f148561cf96bf2", "title": "Workflow Scheduling in Cloud Computing Environment by Combining Particle Swarm Optimization and Grey Wolf Optimization"}, {"paperId": "7d30485804beed4d80f58c2f3a8ada19d44c6beb", "title": "Multi-Objective Fault Tolerance Model for Scientific Workflow Scheduling on Cloud Computing"}, {"paperId": "acf516f8553b5df6dc7252a3813601fce476637f", "title": "Comparative Evaluation of the Firefly, PSO and FCFS Scheduling Algorithms for Energy Management in Computer Data Center"}, {"paperId": "a723eeb307a7a4f1d62de872ef5004e230b0026d", "title": "Constrained Quantum Optimization for Resource Distribution Management"}]}
