{"paperId": "9f7fb3526cd9af3880be9959625573a8caed80de", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Gaussian Processes for Signal Processing and Representation in Control Engineering", "abstract": "The Gaussian process is an increasingly well-known type of stochastic process, which is a generalization of the Gaussian probability distribution. It allows us to model complex functions thanks to its flexibility, which would not be possible with the use of other tools. Gaussian processes also have a couple of other features that are used in various branches of automation with positive results, ranging from industrial processes to image processing. There are also many ways of setting up the Gaussian processes, which required knowledge on the topic and depend on the presented problem. Considerations on these topics lead to the conclusion that the current state of practical usefulness of Gaussian processes increases significantly, therefore the deepening of knowledge about the ways of its use is highly suggested. In this review, we present selected technical applications of Gaussian Processes allowing an understanding of their broad applicability.", "venue": "Applied Sciences", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-05-13", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "1380991076", "name": "A. Dudek"}, {"authorId": "32560331", "name": "J. Baranowski"}], "citations": [{"paperId": "f81d2789b482740879947edac62e8f69e03b9e20", "title": "Optimization of Neuro-controller Application for Maximum Power Point Tracking Photovoltaic Systems Through Shannon’s Information Criteria"}, {"paperId": "b4400373c48a1f849d64e6e15966fe1a57ef8350", "title": "A data-driven simulation and Gaussian process regression model for hydraulic press condition diagnosis"}, {"paperId": "d013e1e992a03cfc527bc4d8f361293c3ed936ef", "title": "Freeze-thaw durability estimation for concrete through the Gaussian process regression with kernel convolution"}, {"paperId": "c5e44581ad1fe2664856bf470e2fbc45a0f0af5c", "title": "Chebyshev Polynomials for Efficient Gaussian Process Computation"}, {"paperId": "b2055df985ccd0fba7b4d1e47c68c0ced617a9c7", "title": "Active Learning for Adsorption Simulations: Evaluation, Criteria Analysis, and Recommendations for Metal–Organic Frameworks"}, {"paperId": "49b8c9ae3ae31a63b210b886af5606e5290ee58c", "title": "Triboinformatic modeling of the friction force and friction coefficient in a cam-follower contact using machine learning algorithms"}]}
