{"paperId": "9f8e7f27dfa3ce6aa1550335723d79bb5516c4a5", "publicationVenue": {"id": "2216cafa-e724-48f0-a497-f46a99605f1e", "name": "Land", "type": "journal", "issn": "2073-445X", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-321184", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-321184", "https://www.mdpi.com/journal/land"]}, "title": "Land Use and Land Cover Mapping in the Era of Big Data", "abstract": "We are currently living in the era of big data. The volume of collected or archived geospatial data for land use and land cover (LULC) mapping including remotely sensed satellite imagery and auxiliary geospatial datasets is increasing. Innovative machine learning, deep learning algorithms, and cutting-edge cloud computing have also recently been developed. While new opportunities are provided by these geospatial big data and advanced computer technologies for LULC mapping, challenges also emerge for LULC mapping from using these geospatial big data. This article summarizes the review studies and research progress in remote sensing, machine learning, deep learning, and geospatial big data for LULC mapping since 2015. We identified the opportunities, challenges, and future directions of using geospatial big data for LULC mapping. More research needs to be performed for improved LULC mapping at large scales.", "venue": "Land", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-09-30", "journal": {"name": "Land"}, "authors": [{"authorId": "1786663", "name": "Chuanrong Zhang"}, {"authorId": "2046964706", "name": "Xinba Li"}], "citations": [{"paperId": "049a4d6ed996d8010931c653f4afb084c3ccaf37", "title": "Crop type classification and spatial mapping in River Nile and Northern State, Sudan, using Sentinel-2 satellite data and field observation"}, {"paperId": "f9cd8c5fcd321bd260565a2da2819ce7e3ccd59f", "title": "Evaluación comparativa de los algoritmos de aprendizaje automático Support Vector Machine y Random Forest"}, {"paperId": "c907694fde9575b00ee2e92556d8f41a257b02d9", "title": "A review of regional and Global scale Land Use/Land Cover (LULC) mapping products generated from satellite remote sensing"}, {"paperId": "4c6142b171f24e497d29dbf5c422cd798362450b", "title": "GIS based method for mapping actual LULC by combining seasonal LULCs"}, {"paperId": "480a6019c9f0011f715ade112b54b682199f4470", "title": "Land Cover Classification Based on Airborne Lidar Point Cloud with Possibility Method and Multi-Classifier"}, {"paperId": "201295bbabcc8a7d6211bec7755753629fef8efa", "title": "Land cover and crop types mapping using different spatial resolution imagery in a Mediterranean irrigated area"}, {"paperId": "74e5a4a60df547bc25b60bcb5c60c9468b91220d", "title": "Enhancing Land Cover/Land Use (LCLU) classification through a comparative analysis of hyperparameters optimization approaches for deep neural network (DNN)"}, {"paperId": "ffbd1af5f3190208fe92c919c8fb43ea3fec7def", "title": "A cloud-based solution and platform for remote sensing big data applications: challenges and opportunities"}, {"paperId": "a2ef49fd07313908a3155a0eefe8833bdc2baca5", "title": "A landscape metrics-based sample weighting approach for forecasting land cover change with deep learning models"}, {"paperId": "8ae366bafa6165405605f6e25e368fa781645d1f", "title": "Pre-processing training data improves accuracy and generalisability of convolutional neural network based landscape semantic segmentation"}, {"paperId": "f0e0fe15b212d924f768b5c5739a10ff787e792a", "title": "Land Cover Mapping Using Sentinel-1 Time-Series Data and Machine-Learning Classifiers in Agricultural Sub-Saharan Landscape"}, {"paperId": "1622b8c8017baf9b82c294d210f57e5ef58bd73c", "title": "An Assessment of Object-based Classification Compared to Pixel-based Classification in Google Earth Engine Using Random Forest"}]}
