{"paperId": "9f92a67dea00771011c572662ac7531470bc942c", "publicationVenue": null, "title": "Privacy-Preserving Publishing and Visualization of Spatial-Temporal Information", "abstract": "Partially due to technological advancements as well as the availability of affordable global positioning system (GPS) and cellular devices, more spatio-temporal data can be generated and collected. The presence of spatial and temporal dimensions uniquely differentiate spatio-temporal data from classical data as spatio-temporal data points are structurally related in the context of space and time. In this paper, we present a solution for privacy-preserving publishing and visualization of spatiotemporal big data information. Specifically, it consists of a spatiotemporal hierarchy model (STHM) for some common big data management tasks such as visualization. Our data visualizer provides actionable insight to enhance data-driven decision making. It also enables the discovery of hidden patterns, clusters of events, and outliers. We design two different metrics to preprocess the spatio-temporal for data visualization. Although we demonstrate the usefulness of our solution in privacy-preserving publishing and visualization of spatio-temporal information by using big real-life parking data from two cities, our solution can be applicable for publishing and visualizing spatio-temporal information from many other big data.", "venue": "2021 IEEE International Conference on Big Data (Big Data)", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-12-15", "journal": {"name": "2021 IEEE International Conference on Big Data (Big Data)", "pages": "5420-5429"}, "authors": [{"authorId": "82875551", "name": "Anifat M. Olawoyin"}, {"authorId": "1726081", "name": "C. Leung"}, {"authorId": "145046124", "name": "A. Cuzzocrea"}], "citations": [{"paperId": "6ecb7a2a23802868fe6158ef569507fc9379d3b7", "title": "A Privacy-Preserving Semi-Decentralized Personalized Recommendation System"}, {"paperId": "0ab66313a4578c1538248e93daa5da35c07abf9e", "title": "Visualizing Algorithms: A Comprehensive Exploration of Sorting and Computational Problem-Solving"}, {"paperId": "6655d704aaa26b7727de6730875e86e9b3361b01", "title": "Privacy Preservation of Big Spatio-Temporal Co-occurrence Data"}, {"paperId": "f6e0f9877a4727b28b0f87b6191795ae0cd05128", "title": "Preserving Privacy Integration and Mining for Big Temporal Co-occurrence Patterns"}, {"paperId": "d2b096acef8b783147a2b34c251d5cb24c8705e9", "title": "Health Informatics on Big COVID-19 Pandemic Data via N-Shot Learning"}, {"paperId": "e8b4a0d4f5212bf51f6bc72b47aa6fb2b5d4b36a", "title": "A Big Data Science Solution for Transportation Analytics with Meteorological Data"}, {"paperId": "2d0a643701b63e060dc181f12b01be2900e7f13e", "title": "Trustworthy Explanations for Knowledge Discovered from E-Health Records"}, {"paperId": "b38235fd1746be6d89d10960549f2c78a9d263fb", "title": "Towards Trustworthy Artificial Intelligence in Healthcare"}, {"paperId": "e1abde48eb0d0477e7c367ed101aec5076c2889b", "title": "A Deep Learning Based Predictive Model for Healthcare Analytics"}]}
