{"paperId": "9f93b9402001bb87ca08a1652bd797a1c186d690", "publicationVenue": null, "title": "Multimodal magnetic resonance imaging for Alzheimer's disease diagnosis using hybrid features extraction and ensemble support vector machines", "abstract": "Magnetic resonance imaging (MRI) is increasingly used in the diagnosis of Alzheimer's disease (AD) in order to identify abnormalities in the brain. Indeed, cortical atrophy, a powerful biomarker for AD, can be detected using structural MRI (sMRI), but it cannot detect impairment in the integrity of the white matter (WM) preceding cortical atrophy. The early detection of these changes is made possible by the novel MRI modality known as diffusion tensor imaging (DTI). In this study, we integrate DTI and sMRI as complementary imaging modalities for the early detection of AD in order to create an effective computer‐assisted diagnosis tool. The fused Bag‐of‐Features (BoF) with Speeded‐Up Robust Features (SURF) and modified AlexNet convolutional neural network (CNN) are utilized to extract local and deep features. This is applied to DTI scalar metrics (fractional anisotropy and diffusivity metric) and segmented gray matter images from T1‐weighted MRI images. Then, the classification of local unimodal and deep multimodal features is first performed using support vector machine (SVM) classifiers. Then, the majority voting technique is adopted to predict the final decision from the ensemble SVMs. The study is directed toward the classification of AD versus mild cognitive impairment (MCI) versus cognitively normal (CN) subjects. Our proposed method achieved an accuracy of 98.42% and demonstrated the robustness of multimodality imaging fusion.", "venue": "International journal of imaging systems and technology (Print)", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-11-04", "journal": {"name": "International Journal of Imaging Systems and Technology", "pages": "610 - 621", "volume": "33"}, "authors": [{"authorId": "2155691554", "name": "Latifa Houria"}, {"authorId": "1990595818", "name": "Noureddine Belkhamsa"}, {"authorId": "31863383", "name": "Assia Cherfa"}, {"authorId": "2740255", "name": "Yazid Cherfa"}], "citations": [{"paperId": "9c6e09e241ffba594fa956c4f4cf822715e2b24f", "title": "A hybrid multimodal machine learning model for Detecting Alzheimer's disease."}, {"paperId": "1b2fc5ff8648359b185a5cbebea7046d76c23746", "title": "Hidden Markov Model based Predicting of Alzheimer's Disease with graph cut segmentation using MR Diffusion Tensor Imaging (DTI)"}, {"paperId": "0a76979202dcd6ab504812558aa5fd38a2135953", "title": "Accuracy Evaluation of Computer Intelligent Projection Technology in Medical Measurement"}, {"paperId": "4621d6da6aa0bab46de3bbe9c78fecc67dc186a8", "title": "Detection of different progression stages of Alzheimer’s disease using SURF"}, {"paperId": "01d6d69d95266c48a6751b3d1d75dc240a1131ce", "title": "A Research on Traditional Tangka Image Classification Based on Visual Features"}, {"paperId": "77e5d6cff7ae4a6bf0a704a999c20c98e9d880bd", "title": "Computing Model for Alzheimer Prediction Using Support Vector Machine Classifier"}]}
