{"paperId": "9f9f4608193f56b4a65a1ce008ac4d1028b67e5c", "publicationVenue": {"id": "1cd505d9-195d-4f99-b91c-169e872644d4", "name": "Energies", "type": "journal", "issn": "1996-1073", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-155563", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-155563", "https://www.mdpi.com/journal/energies", "http://www.mdpi.com/journal/energies"]}, "title": "Predicting Mining Areas Deformations under the Condition of High Strength and Depth of Cover", "abstract": "This paper presents an analysis of mining area deformations in the rock mass consisting of high depth and strength strata deposited in the cover. The analysis of land surveying results enabled the identification of the parameters required to predict subsidence, which differed from the typical parameters for the Upper Silesian Coal Basin. The parameters of the Budryk–Knothe theory were determined based on the results of geodetic measurements. The calculations of the final state of deformations for planned mining were made using the average and characteristics for the study area parameter values. Based on experience, it is known that the range of subsidence trough depends on the mechanical properties of the rock mass. This study shows that the presence of high-strength rocks also reduces the value of the coefficient of roof control. Subsequently, calculations were made by a computer simulation of longwall mining to determine the course of indices of deformation over time. The calculations were conducted twice: on the assumption that the impact was immediate and on the assumption of the parameter values typical for the basin, and formula expressing the course of subsidence over time with the parameter values based on the measurement results. The obtained distributions of deformation indicators were diametrically opposed to each other. The results of the calculations with the parameter values appropriate for the region indicate that it is possible to carry out a planned mining operation without creating a risk to objects on the surface.", "venue": "Energies", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-06-24", "journal": {"name": "Energies"}, "authors": [{"authorId": "1457125890", "name": "P. Strzałkowski"}], "citations": [{"paperId": "2de47697d44d29a5f15b8dd5c0dd9e5351bb2f12", "title": "A Dynamic Numerical Simulation on the Grouting Timing in Retained Rib of Pillarless Mining"}, {"paperId": "9219d8073f4065b4e6f348e95414970d9cda475e", "title": "Difference in Surface Damage between Deep and Shallow Mining of Underground Coal Resources in China"}]}
