{"paperId": "9fa2bbd621dd086731efa7a9cf9cca327ce21048", "publicationVenue": null, "title": "Scalable cyber-security analytics with a new summary-based approximate query engine", "abstract": "A growing need for scalable solutions for both machine learning and interactive analytics exists in the area of cyber-security. Machine learning aims at segmentation and classification of log events, which leads towards optimization of the threat monitoring processes. The tools for interactive analytics are required to resolve the uncertain cases, whereby machine learning algorithms are not able to provide a convincing outcome and human expertise is necessary. In this paper we focus on a case study of a security operations platform, whereby typical layers of information processing are integrated with a new database engine dedicated to approximate analytics. The engine makes it possible for the security experts to query massive log event data sets in a standard relational style. The query outputs are received orders of magnitude faster than any of the existing database solutions running with comparable resources and, in addition, they are sufficiently accurate to make the right decisions about suspicious corner cases. The engine internals are driven by the principles of information granulation and summary-based processing. They also refer to the ideas of data quantization, approximate computing, rough sets and probability propagation. In the paper we study how the engine's parameters can influence its performance within the considered environment. In addition to the results of experiments conducted on large data sets, we also discuss some of our high level design decisions including the choice of an approximate query result accuracy measure that should reflect the specifics of the considered threat monitoring operations.", "venue": "2017 IEEE International Conference on Big Data (Big Data)", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2017-12-01", "journal": {"name": "2017 IEEE International Conference on Big Data (Big Data)", "pages": "1840-1849"}, "authors": [{"authorId": "145514740", "name": "D. Ślęzak"}, {"authorId": "1409256143", "name": "Agnieszka Chadzynska-Krasowska"}, {"authorId": "49366058", "name": "Joel Holland"}, {"authorId": "1742332", "name": "P. Synak"}, {"authorId": "38800313", "name": "Rick Glick"}, {"authorId": "2053129147", "name": "Marcin Perkowski"}], "citations": [{"paperId": "8c344fdea6fbea115abf7ef53252fed88c883c3e", "title": "Collaborative Detection of Black Hole and Gray Hole Attacks for Secure Data Communication in VANETs"}, {"paperId": "b07e6823c2fd265d0f4f733e432fc72cd462bd71", "title": "Considering various aspects of models’ quality in the ML pipeline - application in the logistics sector"}, {"paperId": "01f04fd69cba1239ccd9951b555416adf76e4cd3", "title": "The future of Artificial Intelligence in Cybersecurity: A Comprehensive Survey"}, {"paperId": "0b2cfa6d219fedbbc5686b214168d6f2705acce3", "title": "A Systematic Mapping Study on Cyber Security Indicator Data"}, {"paperId": "ea5d16b4795176a167b8d6ed5566004f959fc558", "title": "Classifier Calibration: With Application to Threat Scores in Cybersecurity"}, {"paperId": "e7a8766a21fea913308d440515185943babfb92c", "title": "Reinventing Infobright’s Concept of Rough Calculations on Granulated Tables for the Purpose of Accelerating Modern Data Processing Frameworks"}, {"paperId": "4598f08116a1da9839800a060fba0a4e25a765ff", "title": "Approximate Decision Tree Induction over Approximately Engineered Data Features"}, {"paperId": "a181aaa4dfeb7b71addff3b2e3e5d08485eb5d7a", "title": "From Big Data to business analytics: The case study of churn prediction"}, {"paperId": "089f5be3e227743607e2dbf00a05b40557be7ae6", "title": "Automated event prioritization for security operation center using graph-based features and deep learning"}, {"paperId": "d97dd27e2edd473c3746b71a3d9d010910f5c18f", "title": "An Ensemble Approach for Suspicious Traffic Detection from High Recall Network Alerts"}, {"paperId": "ddf9bf72e6ff6f424b2c61ba4d4ffa7a48ebbd20", "title": "Automated Event Prioritization for Security Operation Center using Deep Learning"}, {"paperId": "03e96692521f89e374b1b74648cc6bd16aa48b36", "title": "IEEE BigData 2019 Cup: Suspicious Network Event Recognition"}, {"paperId": "f3f9f5af78c1483d4d13f96e026ac8fa2e97d1e9", "title": "Naive Transfer Learning Approaches for Suspicious Event Prediction"}, {"paperId": "e9da445cee0dffa517807755aaa02333c758e59a", "title": "Suspicious Network Event Recognition Leveraging on Machine Learning"}, {"paperId": "c3d05372d01138c5d78bdd5fa923462759ec992f", "title": "Models and Features with Covariate Shift Adaptation for Suspicious Network Event Recognition"}, {"paperId": "97ec585129aec6ca9069c2b9365e34e245d45797", "title": "An Approach for Scale Suspicious Network Events Detection"}, {"paperId": "ebe76cb458204bb54d076ea3bf24eed2bca70832", "title": "Application of XGBoost to the cyber-security problem of detecting suspicious network traffic events"}, {"paperId": "f36dfe914551d0357d4d4a0829c1e1201026f692", "title": "Identifying Truly Suspicious Events and False Alarms Based on Alert Graph"}, {"paperId": "5c6e0de47bc1401ff0544aafd42131662d538840", "title": "An Investigation of Information Granulation Techniques in Cybersecurity"}, {"paperId": "56f55108224b878da30146464b2d4cd53c46dd2f", "title": "Ranking Mutual Information Dependencies in a Summary-based Approximate Analytics Framework"}, {"paperId": "7b0d35e966f39e190708953261699bfc7f498a0d", "title": "Similarity-Based Accuracy Measures for Approximate Query Results"}, {"paperId": "3f3d26859a23e0b06061199ab41249bb0ab9b6d2", "title": "Toward Approximate Intelligence: Approximate Query Engines & Approximate Data Exploration"}, {"paperId": "427c808c63ea73ba52cec67c7c0a7e6be69cb2cc", "title": "Rough Sets: International Joint Conference, IJCRS 2020, Havana, Cuba, June 29 – July 3, 2020, Proceedings"}]}
