{"paperId": "9fcc02a305260789d6b8c516f3fa1588fed8f041", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "AI-News Personalization System Combining Complete Content Characterization and Full Term Interest Portrayal in the Big Data Era", "abstract": "In order to leverage the advantages of the large sample capacity in the era of big data and improve the performance of contemporary news recommendation methods, we have characterized complete information such as news textual details, explicit themes, and implicit themes, and thoroughly portrayed users’ mixed full term interest including long-term and short-term interests. As a result, we propose an artificial intelligence (AI)-News Personalization system that combines Complete news Content Characterization and user Full term interest portrayal, i.e., NP-3C-FIP. The NP-3C-FIP system first utilizes Latent Dirichlet Allocation (LDA) to extract the implicit theme distribution from the news textual content. Then, it learns the unified news characterizations based on the headline, summary, category, subcategory, and implicit themes. Using these news characterizations, the proposed method transforms the historical clicked news into the representation vectors. Subsequently, the obtained sequence of news representation vectors is fed into a Gate Recurrent Unit (GRU) network to capture the sequential interest features of the user. Furthermore, this paper introduces a personalized attention mechanism to model the stable tastes. Finally, the system concatenates the portrayals of the full term to obtain a unified user representation vector, and calculates the click probability for candidate articles using vector dot product. Experimental results demonstrate the effectiveness of the proposed method in improving news recommendation performance.", "venue": "IEEE Access", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "85086-85096", "volume": "11"}, "authors": [{"authorId": "2152126629", "name": "Wenwen Fu"}], "citations": []}
