{"paperId": "9fcdbfdf28245010c875ce85502351fe05c04b49", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Exploring Collaboration Mechanisms for LLM Agents: A Social Psychology View", "abstract": "As Natural Language Processing (NLP) systems are increasingly employed in intricate social environments, a pressing query emerges: Can these NLP systems mirror human-esque collaborative intelligence, in a multi-agent society consisting of multiple large language models (LLMs)? This paper probes the collaboration mechanisms among contemporary NLP systems by melding practical experiments with theoretical insights. We fabricate four unique `societies' comprised of LLM agents, where each agent is characterized by a specific `trait' (easy-going or overconfident) and engages in collaboration with a distinct `thinking pattern' (debate or reflection). Through evaluating these multi-agent societies on three benchmark datasets, we discern that certain collaborative strategies not only outshine previous top-tier approaches, but also optimize efficiency (using fewer API tokens). Moreover, our results further illustrate that LLM agents manifest human-like social behaviors, such as conformity and consensus reaching, mirroring foundational social psychology theories. In conclusion, we integrate insights from social psychology to contextualize the collaboration of LLM agents, inspiring further investigations into the collaboration mechanism for LLMs. We commit to sharing our code and datasets\\footnote{\\url{https://github.com/zjunlp/MachineSoM}.}, hoping to catalyze further research in this promising avenue.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-10-03", "journal": {"name": "ArXiv", "volume": "abs/2310.02124"}, "authors": [{"authorId": "2253784578", "name": "Jintian Zhang"}, {"authorId": "2152775219", "name": "Xin Xu"}, {"authorId": "2253472695", "name": "Shumin Deng"}], "citations": [{"paperId": "365f851cca8cd4ccfb3c6909c9dd72107ef1044d", "title": "Social Skill Training with Large Language Models"}, {"paperId": "811dd8b5367f7acbac2f2e14f6ad452db38b8bef", "title": "Your Co-Workers Matter: Evaluating Collaborative Capabilities of Language Models in Blocks World"}, {"paperId": "b78adeffd4ab17a690e537ada53ddb85940f1015", "title": "Depending on yourself when you should: Mentoring LLM with RL agents to become the master in cybersecurity games"}, {"paperId": "593d3c49cd654fa2b0879ba9ea9a71065e2b9559", "title": "A Picture Is Worth a Graph: Blueprint Debate on Graph for Multimodal Reasoning"}, {"paperId": "7c1adf2bcff5d7ed1cf330680a100060f278e2a3", "title": "Embodied LLM Agents Learn to Cooperate in Organized Teams"}, {"paperId": "8bb527c332b133e52bb7b6c5da84375888f41c05", "title": "Agent-FLAN: Designing Data and Methods of Effective Agent Tuning for Large Language Models"}, {"paperId": "39c74d913997285a376c0cf188627f0efe8a1132", "title": "Can LLM-Augmented autonomous agents cooperate?, An evaluation of their cooperative capabilities through Melting Pot"}, {"paperId": "f95d2c974e6aa2497b85342296b863d0d10c0892", "title": "Large Language Model for Participatory Urban Planning"}, {"paperId": "550676250271276becf5a400f072241daf734f4f", "title": "Determinants of LLM-assisted Decision-Making"}, {"paperId": "d42c94924fb0117e4fdb746c21071a950c2eb83a", "title": "The Wolf Within: Covert Injection of Malice into MLLM Societies via an MLLM Operative"}, {"paperId": "e9640cd4bdb0fa93a94151ec00259909b5e88d6d", "title": "Self-Alignment of Large Language Models via Monopolylogue-based Social Scene Simulation"}, {"paperId": "775e9844a13b518aeb0cde401ba6891ba3538611", "title": "Can Large Language Model Agents Simulate Human Trust Behaviors?"}, {"paperId": "6d1ef839db3d637977392f4a7046c26bfea37d46", "title": "LLM Multi-Agent Systems: Challenges and Open Problems"}, {"paperId": "6d8efe141ead5e397ca9a49814d049290292e974", "title": "More Agents Is All You Need"}, {"paperId": "503c85a9df91de5dace92d6c5ade8627701f08ac", "title": "Large language model empowered participatory urban planning"}, {"paperId": "8f070e301979732e0dd73f6aa6170309cf73aa7d", "title": "Large Language Model based Multi-Agents: A Survey of Progress and Challenges"}, {"paperId": "71491b7e8913f24d7d0f01bfd0a9814dc72f4675", "title": "Exploring the Frontiers of LLMs in Psychological Applications: A Comprehensive Review"}, {"paperId": "324f31a660b4bd3ebbd59b53b67f7edc061adbab", "title": "The Use of Multiple Conversational Agent Interlocutors in Learning"}, {"paperId": "592ac35991e583fc37c26ee6659d2deb85142ad9", "title": "Large Language Models Empowered Agent-based Modeling and Simulation: A Survey and Perspectives"}, {"paperId": "a577c17bf25f9a5c37a0500bcbf578c03c923726", "title": "From Text to Motion: Grounding GPT-4 in a Humanoid Robot \"Alter3\""}, {"paperId": "861983e9d43b1bda03f1b8e2ac8e1a6c004efeaa", "title": "Playing Large Games with Oracles and AI Debate"}, {"paperId": "4014253368133c01bfc0383660c518d11afccad2", "title": "Towards Reasoning in Large Language Models via Multi-Agent Peer Review Collaboration"}, {"paperId": "95dae66002ebe9e560c01f6aa1ad412d7362c15c", "title": "On the Discussion of Large Language Models: Symmetry of Agents and Interplay with Prompts"}, {"paperId": "03ac3aca5ae93b41f8f309c8c0201e8b5c667e8d", "title": "ALYMPICS: LLM Agents Meet Game Theory -- Exploring Strategic Decision-Making with AI Agents"}]}
