{"paperId": "9fd8e5cb7958c1b005096e95ba15d0d92cdfbbaa", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "THIA: Accelerating Video Analytics using Early Inference and Fine-Grained Query Planning", "abstract": "To efficiently process visual data at scale, researchers have proposed two techniques for lowering the computational overhead associated with the underlying deep learning models. The first approach consists of leveraging a specialized, lightweight model to directly answer the query. The second approach focuses on filtering irrelevant frames using a lightweight model and processing the filtered frames using a heavyweight model. These techniques suffer from two limitations. With the first approach, the specialized model is unable to provide accurate results for hard-to-detect events. With the second approach, the system is unable to accelerate queries focusing on frequently occurring events as the filter is unable to eliminate a significant fraction of frames in the video. In this paper, we present THIA, a video analytics system for tackling these limitations. The design of THIA is centered around three techniques. First, instead of using a cascade of models, it uses a single object detection model with multiple exit points for short-circuiting the inference. This early inference technique allows it to support a range of throughput-accuracy tradeoffs. Second, it adopts a fine-grained approach to planning and processes different chunks of the video using different exit points to meet the user's requirements. Lastly, it uses a lightweight technique for directly estimating the exit point for a chunk to lower the optimization time. We empirically show that these techniques enable THIA to outperform two state-of-the-art video analytics systems by up to 6.5X, while providing accurate results even on queries focusing on hard-to-detect events.", "venue": "arXiv.org", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-02-16", "journal": {"name": "ArXiv", "volume": "abs/2102.08481"}, "authors": [{"authorId": "35821903", "name": "Jiashen Cao"}, {"authorId": "32052175", "name": "Ramyad Hadidi"}, {"authorId": "145426241", "name": "Joy Arulraj"}, {"authorId": "8187053", "name": "Hyesoon Kim"}], "citations": [{"paperId": "2a57522a24304999c93f3e79625395055aa32d68", "title": "Resource-efficient In-orbit Detection of Earth Objects"}, {"paperId": "4057dac4f2369ee4b072854e219c71364c9d0d87", "title": "VQPy: An Object-Oriented Approach to Modern Video Analytics"}, {"paperId": "dd66f54fa721e3affa29e30e823e400c3e54a8f7", "title": "Automatic and Efficient Customization of Neural Networks for ML Applications"}, {"paperId": "3a29a9e6168cf1620fe76b3702e473de6f6fec67", "title": "Saturn: An Optimized Data System for Multi-Large-Model Deep Learning Workloads"}, {"paperId": "97e8e9ad3862629bacb28b994f2d5d52a2371c00", "title": "Extract-Transform-Load for Video Streams"}, {"paperId": "733ccf709ff18dda193566050d772c000cf5a534", "title": "Optimizing Machine Learning Inference Queries for Multiple Objectives"}, {"paperId": "aad2858a1fcb8c5f2d813d8cc25532b2ef5c4294", "title": "Kodan: Addressing the Computational Bottleneck in Space"}, {"paperId": "d202d2936b7495b1c493d94a744f3f4653f6f447", "title": "Edge Video Analytics: A Survey on Applications, Systems and Enabling Techniques"}, {"paperId": "1add047298154e27d8ef732e6c73c2f1c91eba23", "title": "Optimizing Video Analytics with Declarative Model Relationships"}, {"paperId": "25a32e5d0ba89ca6ab1ecf6a5e9cfc42f7323f06", "title": "Accelerating Video Analytics"}, {"paperId": "d8301d5fe61fb0479132c964f81c97a3be80067f", "title": "A Survey of Performance Optimization in Neural Network-Based Video Analytics Systems"}, {"paperId": "37347951fc754d67688dca9f60c300add1ff6ab4", "title": "Optimizing ML Inference Queries Under Constraints"}, {"paperId": "85106fc0a68a575166f0f18456fa755b7a2660a3", "title": "Deep Learning-Driven Edge Video Analytics: A Survey"}, {"paperId": "e1425a475060de79114019620a15cea40c57eb0f", "title": "This paper is included in the Proceedings of the 20th USENIX Symposium on Networked Systems Design and Implementation."}, {"paperId": "cfe67cae58393210279b095ddbedf1b5099e9a56", "title": "This paper is included in the Proceedings of the 2022 USENIX Annual Technical Conference."}]}
