{"paperId": "9fe332c2386889506d32c4b9e7a3ae652ad004d2", "publicationVenue": {"id": "b0ac96c7-d7dc-4933-ac56-4be6c43f9691", "name": "Journal of Design for Resilience in Architecture and Planning", "type": "journal", "alternate_names": ["J Des Resil Archit Plan"], "issn": "2757-6329", "url": "https://drarch.org/index.php/drarch"}, "title": "Linking space syntax and cluster analysis to design and plan temporary housing neighborhoods: A taxonomy of sites in Norcia", "abstract": "Building Back Better in disaster recovery and reconstruction requires the adoption of integrated and context-sensitive approaches to the design and planning of Temporary Housing (TH) sites. However, there is a lack of methods for enabling successful outcomes in housing assistance provision, e.g. via a quantitative evaluation of the social-spatial qualities of the sites, and supporting the negotiation of urban design changes and the development of a coherent end-of-life plan. The paper aims to uncover formal analogies between different TH sites’ layouts by linking Space Syntax and Clustering analysis within an unsupervised machine-learning pipeline, which can consider a virtually unlimited number of configurational qualities and how they vary across different scales. The potential benefits of the proposal are illustrated through its application to the study of 20 TH sites built in Norcia after the 2016-2017 Central Italy earthquakes. The results indicate the proposal enables distinguishing different types of spatial arrangements according to local strategic priorities and suggest the opportunity to extend the study in the future to set up rules of thumb for the design of site layout options. The paper ultimately aims to equip local administrations and contracted professionals with a much-needed tool to develop and rapidly audit proposals for temporary neighbourhoods oriented at enhancing the resilience of disaster-affected towns both in the medium and in the long term.", "venue": "Journal of Design for Resilience in Architecture and Planning", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-12-31", "journal": {"name": "Journal of Design for Resilience in Architecture and Planning"}, "authors": [{"authorId": "97475554", "name": "C. Pezzica"}, {"authorId": "2767602", "name": "V. Cutini"}], "citations": [{"paperId": "4181c47b52197b76982cc8ab3e6768228832ca30", "title": "Territorial Digital Twins: A key for increasing the community resilience of fragile mountain inner territories?"}, {"paperId": "503e265b1ebf218a069c942559fb8ff4e485c707", "title": "Digitalization and Spatial Documentation of Post-Earthquake Temporary Housing in Central Italy: An Integrated Geomatic Approach Involving UAV and a GIS-Based System"}, {"paperId": "f4e9a68c8affa40f66b2a9f041d28b1e05443bb5", "title": "The making of cities after disasters: Strategic planning and the Central Italy temporary housing process"}]}
