{"paperId": "9ffa0d2a4042bdc8e991999c8c1df1348eb60ca5", "publicationVenue": null, "title": "Redundancy Elimination in Distributed Matrix Computation", "abstract": "As matrix computation becomes increasingly prevalent in large-scale data analysis, distributed matrix computation solutions have emerged. These solutions support query interfaces of linear algebra expressions, which often contain redundant subexpressions, i.e., common and loop-constant subexpressions. Hence, existing compilers rewrite queries to eliminate such redundancy. However, due to the large search space, they fail to find all redundant subexpressions, especially for matrix multiplication chains. Furthermore, redundancy elimination may change the original execution order of operators, and have negative impacts. To reduce the large search space and avoid the negative impacts, we propose automatic elimination and adaptive elimination, respectively. In particular, automatic elimination adopts a block-wise search that exploits the properties of matrix computation for speed-up. Adaptive elimination employs a cost model and a dynamic programming-based method to generate efficient plans for redundancy elimination. Finally, we implement ReMac atop SystemDS, eliminating redundancy in distributed matrix computation. In our experiments, ReMac is able to generate efficient execution plans at affordable overhead costs, and outperforms state-of-the-art solutions by an order of magnitude.", "venue": "SIGMOD Conference", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2022-06-10", "journal": {"name": "Proceedings of the 2022 International Conference on Management of Data"}, "authors": [{"authorId": "2117099600", "name": "Zihao Chen"}, {"authorId": "2163787837", "name": "Baokun Han"}, {"authorId": "144282087", "name": "Chen Xu"}, {"authorId": "2172016", "name": "Weining Qian"}, {"authorId": "145031580", "name": "Aoying Zhou"}], "citations": [{"paperId": "d590ad6e83c9aa5d4fcdff11d514f38f5c560107", "title": "An Adaptive Elastic Multi-model Big Data Analysis and Information Extraction System"}, {"paperId": "86aa9fc0e9ec5003f2b9bd5b6dee060375bee8e2", "title": "ReMac: A Matrix Computation System with Redundancy Elimination"}]}
