{"paperId": "a005c15e7628da11e8e20035ac26f300309d109f", "publicationVenue": {"id": "406d9f60-417a-4dc5-a6b7-1fe4689a4ff7", "name": "IEEE International Conference on Cloud Computing", "type": "conference", "alternate_names": ["Int Conf Cloud Comput [services Soc", "CLOUD", "International Conference on Cloud Computing [Services Society]", "IEEE Int Conf Cloud Comput"]}, "title": "Modelling VM Latent Characteristics and Predicting Application Performance using Semi-supervised Non-negative Matrix Factorization", "abstract": "Selecting a suitable VM instance type for an application can be a difficult task because of the number of options and the variety of application requirements. Recent research takes a data-driven approach to model VM performance, but this requires carefully choosing a small set of relevant benchmarks as input. We propose a semi-supervised matrix-factorization-based latent variable approach to predict the performance of an unknown new application. This method allows to take a large set of benchmarks as input for VM performance modelling, and it uses the model and the performance measure of the new application on some of the target VMs to predict the performance on the rest of all VMs. We ran experiments with 373 micro-benchmarks from stress-ng and 37 AWS EC2 VMs to predict the scores of Geekbench accurately. Our initial results showed that the RMSE and STD of the predicted scores are 6.7 and 4.5 when sampling Geekbench on 5 VMs, and 10.0 and 2.8 when sampling 10.", "venue": "IEEE International Conference on Cloud Computing", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-10-01", "journal": {"name": "2020 IEEE 13th International Conference on Cloud Computing (CLOUD)", "pages": "470-474"}, "authors": [{"authorId": "2116262560", "name": "Yuhui Lin"}, {"authorId": "2445185", "name": "A. Barker"}, {"authorId": "153031524", "name": "John Thomson"}], "citations": [{"paperId": "6764cde98b09b35ed212e4bd01483176eac2787f", "title": "Predicting the Performance-Cost Trade-off of Applications Across Multiple Systems"}, {"paperId": "2f65e60dfd8a05f6dfeec8a237507b029386b1eb", "title": "Performance Testing for Cloud Computing with Dependent Data Bootstrapping"}, {"paperId": "1f46c904101fdb14dc0152b58877ad59a807a5e6", "title": "Hardware Usage Improvement for Small Data Problem Solving by Deep Learning Methods"}]}
