{"paperId": "a00847aeb5968c7f5fc0356965e910c44096a416", "publicationVenue": {"id": "764e3630-ddac-4c21-af4b-9d32ffef082e", "name": "IEEE International Conference on Data Engineering", "type": "conference", "alternate_names": ["ICDE", "Int Conf Data Eng", "IEEE Int Conf Data Eng", "International Conference on Data Engineering"], "url": "http://www.wikicfp.com/cfp/program?id=1331"}, "title": "Optimizing Error-Bounded Lossy Compression for Scientific Data by Dynamic Spline Interpolation", "abstract": "Today’s scientific simulations are producing vast volumes of data that cannot be stored and transferred efficiently because of limited storage capacity, parallel I/O bandwidth, and network bandwidth. The situation is getting worse over time because of the ever-increasing gap between relatively slow data transfer speed and fast-growing computation power in modern supercomputers. Error-bounded lossy compression is becoming one of the most critical techniques for resolving the big scientific data issue, in that it can significantly reduce the scientific data volume while guaranteeing that the reconstructed data is valid for users because of its compression-error-bounding feature. In this paper, we present a novel error-bounded lossy compressor based on a state-of-the-art prediction-based compression framework. Our solution exhibits substantially better compression quality than all of the existing error-bounded lossy compressors, with comparable compression speed. Specifically, our contribution is threefold. (1) We provide an in-depth analysis of why the best-existing prediction-based lossy compressor can only minimally improve the compression quality. (2) We propose a dynamic spline interpolation approach with a series of optimization strategies that can significantly improve the data prediction accuracy, substantially improving the compression quality in turn. (3) We perform a thorough evaluation using six real-world scientific simulation datasets across different science domains to evaluate our solution vs. all other related works. Experiments show that the compression ratio of our solution is higher than that of the second-best lossy compressor by 20% 460% with the same error bound in most of the cases. ∼", "venue": "IEEE International Conference on Data Engineering", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-04-01", "journal": {"name": "2021 IEEE 37th International Conference on Data Engineering (ICDE)", "pages": "1643-1654"}, "authors": [{"authorId": "2074107604", "name": "Kai Zhao"}, {"authorId": "1699598", "name": "S. Di"}, {"authorId": "144178153", "name": "M. Dmitriev"}, {"authorId": "67255083", "name": "T. Tonellot"}, {"authorId": "2117097570", "name": "Zizhong Chen"}, {"authorId": "1721552", "name": "F. Cappello"}], "citations": [{"paperId": "804b8e0cf349adbee13591038174b88255d1653a", "title": "A Survey on Error-Bounded Lossy Compression for Scientific Datasets"}, {"paperId": "ef0eb31c17a73ba36d6bb82061d1a332389a6c5b", "title": "Understanding The Effectiveness of Lossy Compression in Machine Learning Training Sets"}, {"paperId": "822536561477f6f894692c95b35db4c845d04ed7", "title": "Deep Dict: Deep Learning-based Lossy Time Series Compressor for IoT Data"}, {"paperId": "8cd0aa493488541bc85fc123aae22d8e3ab872df", "title": "Efficient Communication in Federated Learning Using Floating-Point Lossy Compression"}, {"paperId": "e5c76a4013642795b33c6526c7a4c8c3d1cf8903", "title": "SECRE: Surrogate-Based Error-Controlled Lossy Compression Ratio Estimation Framework"}, {"paperId": "b8f3f7d87465daaea8985aba5d9f6cc64e9113dd", "title": "Fast Algorithms for Scientific Data Compression"}, {"paperId": "21f95f296c038ec2d65a7324e50f120c3c906e5c", "title": "Characterization and Detection of Artifacts for Error-Controlled Lossy Compressors"}, {"paperId": "aa9988bd6073a0e35e0e1d620738726b57cc80cd", "title": "Scientific Error-bounded Lossy Compression with Super-resolution Neural Networks"}, {"paperId": "866f375a10cbaf91a72b24d3edabab37c409e9b7", "title": "Exploring Wavelet Transform Usages for Error-bounded Scientific Data Compression"}, {"paperId": "a4cc5c2e1aa50a9eff0cfcdd54fba81599c2c9c9", "title": "A Prediction-Traversal Approach for Compressing Scientific Data on Unstructured Meshes with Bounded Error"}, {"paperId": "a4a078e39b318d83162a7d49940dce960d40fe12", "title": "cuSZ-I: High-Fidelity Error-Bounded Lossy Compression for Scientific Data on GPUs"}, {"paperId": "886cf8a244e46ff8042e539354c510b7018da271", "title": "MOST: Model-Based Compression with Outlier Storage for Time Series Data"}, {"paperId": "cfa75f06ff02f821120af56cf2b5aebeb81f5bb7", "title": "Efficient Edge Data Management Framework for IIoT via Prediction-Based Data Reduction"}, {"paperId": "1a3a3e2bbd8cc7afb7e35d4f73d8057d46fe72f1", "title": "MGARD: A multigrid framework for high-performance, error-controlled data compression and refactoring"}, {"paperId": "3e95cd0f7bd892bd2b5b6031fac77afa10619c75", "title": "What Operations can be Performed Directly on Compressed Arrays, and with What Error?"}, {"paperId": "06b16b3b3b7a798247bf8b380529781e7efddfa7", "title": "Adaptive error bounded piecewise linear approximation for time-series representation"}, {"paperId": "dba1d057b907ae467760c6d138e6cb200ca3aa1b", "title": "An Efficient and Accurate Compression Ratio Estimation Model for SZx"}, {"paperId": "e27863d301a27610ba366acfa773da75f8ac4fc0", "title": "A Lightweight, Effective Compressibility Estimation Method for Error-bounded Lossy Compression"}, {"paperId": "fdb843e9f2620f38c76db8d8ffd574acaef7808c", "title": "Reverse Time Migration with Lossy and Lossless Wavefield Compression"}, {"paperId": "fbd07c0b0dbc366d1357ac6c4371e242ae3b48bb", "title": "Online and Scalable Data Compression Pipeline with Guarantees on Quantities of Interest"}, {"paperId": "2eae064500e0583ced8ad38589b7b537a7e49d6d", "title": "Spatiotemporally Adaptive Compression for Scientific Dataset with Feature Preservation – A Case Study on Simulation Data with Extreme Climate Events Analysis"}, {"paperId": "652bfbe2e9748388a829366e26a9203c72706e94", "title": "Analyzing Impact of Data Reduction Techniques on Visualization for AMR Applications Using AMReX Framework"}, {"paperId": "71b2230093380f9bdbf958510ca88c513ba5849c", "title": "TensorCodec: Compact Lossy Compression of Tensors without Strong Data Assumptions"}, {"paperId": "3b0160f1e4bc58ed761b86e3a96c5798a5ffcc02", "title": "Significant improvement of lossy compression rate and speed of HPC data using perceptron parallelized compression"}, {"paperId": "b52d268bb16af1d85d677d9a4fdbfa9c28b7697d", "title": "SRN-SZ: Deep Leaning-Based Scientific Error-bounded Lossy Compression with Super-resolution Neural Networks"}, {"paperId": "7bf653258684c78c7e2a3d2c4dec4ac6b92746a0", "title": "FFEINR: flow feature-enhanced implicit neural representation for spatiotemporal super-resolution"}, {"paperId": "4cc4a9c36f5be75ad6b72c73f19e84ee3a76c8a7", "title": "Adaptive Encoding Strategies for Erasing-Based Lossless Floating-Point Compression"}, {"paperId": "07a88475c2ecabb4605f3fc1e2000096cda5c349", "title": "Hierarchical Lowrank Arithmetic with Binary Compression"}, {"paperId": "6d8c69712c8a79903d52b9a7d01ab71130f4bfe9", "title": "Nonlinear-by-Linear: Guaranteeing Error Bounds in Compressive Autoencoders"}, {"paperId": "6331546cf846e69fd80436a28a29d3cc4823f089", "title": "Adaptively Placed Multi-Grid Scene Representation Networks for Large-Scale Data Visualization"}, {"paperId": "b7e29a38939ad4eb4e01a9de04717cf4792f6c35", "title": "AMRIC: A Novel In Situ Lossy Compression Framework for Efficient I/O in Adaptive Mesh Refinement Applications"}, {"paperId": "638c01f5bf9c25528260cb18bd69cb6eb551bd8f", "title": "Hierarchical Autoencoder-based Lossy Compression for Large-scale High-resolution Scientific Data"}, {"paperId": "a386f9bcd12f84dc098c5dab451d592e3afdb299", "title": "Optimizing Scientific Data Transfer on Globus with Error-Bounded Lossy Compression"}, {"paperId": "f0c29d08360328b21f1a50ec71b3d51452d2e38e", "title": "Erasing-based lossless compression method for streaming floating-point time series"}, {"paperId": "dc47f497e1aad383dcbcd15dac1617b14fb9d313", "title": "FAZ: A flexible auto-tuned modular error-bounded compression framework for scientific data"}, {"paperId": "6ff4ff8f8024915a8fe9521542ecea9dcd7ad48b", "title": "Lightweight Huffman Coding for Efficient GPU Compression"}, {"paperId": "254e968613015a8a58cef90305699cc358023b14", "title": "Hierarchical Residual Encoding for Multiresolution Time Series Compression"}, {"paperId": "17eec22508585fb007a9b6911e9ee771783438fb", "title": "Black-box statistical prediction of lossy compression ratios for scientific data"}, {"paperId": "548fdf0225f61ec1701ba1af38934e478a968a62", "title": "Discussion on “Saving Storage in Climate Ensembles: A Model-Based Stochastic Approach”"}, {"paperId": "d17bbb67c7bc31f336333ecfa34132bf51126aa0", "title": "Lossy Scientific Data Compression With SPERR"}, {"paperId": "f136fb209bf4a57402809a3d84f4a85bcc6b4683", "title": "Scalable Tracing of MPI Events and Performance Metrics"}, {"paperId": "750ce1e9566cb9ed0319b565d99dbbb6be3c2fd0", "title": "Towards Improving Reverse Time Migration Performance by High-speed Lossy Compression"}, {"paperId": "9cabe6240f0871eff6d449ec929ccc07a9a113fd", "title": "GPU-Accelerated Error-Bounded Compression Framework for Quantum Circuit Simulations"}, {"paperId": "660274ce93dcbd6270cce0bbd4774260b83c2d6c", "title": "TopoSZ: Preserving Topology in Error-Bounded Lossy Compression"}, {"paperId": "01786450d590f706c938df1bdfe1a871035cecbe", "title": "An Optimized Error-controlled MPI Collective Framework Integrated with Lossy Compression"}, {"paperId": "dfe37d06e8b2357d8590c23e7ecc8c0fe954d278", "title": "A Feature-Driven Fixed-Ratio Lossy Compression Framework for Real-World Scientific Datasets"}, {"paperId": "dd0ad9c96eba0edfcc3bea8d4d0f7243436ea084", "title": "Algorithm 1036: ATC, An Advanced Tucker Compression Library for Multidimensional Data"}, {"paperId": "1687f9770353b5281c0057f382d8760688a42dfd", "title": "Compression of seismic forward modeling wavefield using TuckerMPI"}, {"paperId": "0b2f0506803af99751f28a0ab0a3a07bb8008b9f", "title": "Elf: Erasing-based Lossless Floating-Point Compression"}, {"paperId": "c6f2569a0d03c832c775d7036c119996c966091d", "title": "TAC+: Optimizing Error-Bounded Lossy Compression for 3D AMR Simulations"}, {"paperId": "df9197a42bcdca21e58aeb0c300d24c29ad37a28", "title": "Scalable Hybrid Learning Techniques for Scientific Data Compression"}, {"paperId": "aef47090542fa0f9fd99394595f38b10a409d9d7", "title": "Toward Quantity-of-Interest Preserving Lossy Compression for Scientific Data"}, {"paperId": "dd29160effac3d7e4b87614923f287ba2916777d", "title": "Optimizing Error-Bounded Lossy Compression for Scientific Data With Diverse Constraints"}, {"paperId": "904d9212c35727a27b98b0f43449b9e2735e5304", "title": "An Algorithmic and Software Pipeline for Very Large Scale Scientific Data Compression with Error Guarantees"}, {"paperId": "42ed689971c9c4be6ac405e80537f19a91defe44", "title": "Understanding the Effects of Modern Compressors on the Community Earth Science Model"}, {"paperId": "04b10120caa2e0c81b8674adcfeff12a378de061", "title": "Dynamic Quality Metric Oriented Error Bounded Lossy Compression for Scientific Datasets"}, {"paperId": "15841c3323ccbef9407b72e6f599b0c39793f99f", "title": "Understanding Impact of Lossy Compression on Derivative-related Metrics in Scientific Datasets"}, {"paperId": "b4bbbed0c33a9e0335a17171914b3c98fba4e4d7", "title": "Spatial parquet: a column file format for geospatial data lakes"}, {"paperId": "2ac2b62c39409f6b0edff89f7ab38b3ecea8bfed", "title": "Region-adaptive, Error-controlled Scientific Data Compression using Multilevel Decomposition"}, {"paperId": "86f7f00172e9b01af04bae61099964857d9632f1", "title": "ROIBIN-SZ: Fast and Science-Preserving Compression for Serial Crystallography"}, {"paperId": "e48f8aed4997eaed9cff4d0ab06449ede6296ee3", "title": "MDZ: An Efficient Error-bounded Lossy Compressor for Molecular Dynamics"}, {"paperId": "cbd3c00b00c00d4efe859177b19872965fdb8042", "title": "TAC: Optimizing Error-Bounded Lossy Compression for Three-Dimensional Adaptive Mesh Refinement Simulations"}, {"paperId": "f1449bc76699f564ce52959956207cb2e213c0f0", "title": "Compressed Matrix Computations"}, {"paperId": "44972d40b6676a71ab67884864c66cdd31702a80", "title": "Optimizing Huffman Decoding for Error-Bounded Lossy Compression on GPUs"}, {"paperId": "bbbebe14b90dac0049a0795e5bc8b9b33a9f2ca7", "title": "Improving Lossy Compression for SZ by Exploring the Best-Fit Lossless Compression Techniques"}, {"paperId": "0269737a33cb3cde4ad061e06cfe6f276e72216b", "title": "Improving Prediction-Based Lossy Compression Dramatically via Ratio-Quality Modeling"}, {"paperId": "125e5cf6199dfdef770fe0f4b258aab01e5e8aa9", "title": "SZ3: A Modular Framework for Composing Prediction-Based Error-Bounded Lossy Compressors"}, {"paperId": "bc930f0dbf00d4a9d215bea151cafc6b73e727df", "title": "Multi-Dimensional Data Compression and Query Processing in Array Databases"}, {"paperId": "325b0758a5169e9352ae6589b2d78ec5ce8071d3", "title": "ATC: an Advanced Tucker Compression library for multidimensional data"}, {"paperId": "b77fe6f355d7e470468dbe25e35e00cba038f19e", "title": "Optimizing Error-Bounded Lossy Compression for Scientific Data on GPUs"}, {"paperId": "cf94f2818730752f199dd7a059c26bbc36762faa", "title": "Exploring Autoencoder-based Error-bounded Compression for Scientific Data"}, {"paperId": "483528d9a48626e71885f5b88d3810c2ff34548f", "title": "AMM: Adaptive Multilinear Meshes"}, {"paperId": "894a961fb567f0714ba1faae361a49230929abdf", "title": "Novel lossy compression method of noisy time series data with anomalies: Application to partial discharge monitoring in overhead power lines"}]}
