{"paperId": "a013c498b400a5f8c7593068a90a30a259a4e565", "publicationVenue": null, "title": "N-FedAvg: Novel Federated Average Algorithm Based on FedAvg", "abstract": "As a safe and efficient distributed machine learning technology, federated learning has been widely used in all walks of life. However, various problems in the traditional FedAvg algorithm have brought a lot of inconvenience to the implementation of federated learning in related industries. Therefore, this paper addresses related problems by proposing a novel federated learning algorithm (N-FedAvg) based on FedAvg. N-FedAvg selects clients in sequence before each epoch, reducing the randomness when selecting clients, so that all clients' data can have the opportunity to participate in federated learning, and prevent local data of some clients from participating in the federation with a low probability. Also, when using gradient descent to optimize the objective function and approaching the global minimum of the loss function value, the learning rate should be made smaller to get the model as close as possible to this point, and cosine annealing can be achieved by the cosine function and produces good results. Finally, the sparsity strategy is essentially a model compression method, which not only transmits a small number of parameters, but also reduces the network bandwidth between the server and the clients, and can also prevent the leakage of global model parameters. Through comparative experimental analysis, this paper finds that the N-FedAvg algorithm proposed by us is 1.34% more accurate than the traditional FedAvg algorithm on the CIFAR-10 dataset, and the loss function value is 2.77% lower.", "venue": "2022 14th International Conference on Communication Software and Networks (ICCSN)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-06-10", "journal": {"name": "2022 14th International Conference on Communication Software and Networks (ICCSN)", "pages": "187-196"}, "authors": [{"authorId": "2058041952", "name": "Shuai Xing"}, {"authorId": "21077282", "name": "Zhenhu Ning"}, {"authorId": "2155805238", "name": "Jin Zhou"}, {"authorId": "2176105796", "name": "Xue Liao"}, {"authorId": "2144295626", "name": "Jiawei Xu"}, {"authorId": "2227578187", "name": "W. Zou"}], "citations": [{"paperId": "910e4b7dbbc92b86eef3e82d1430cd760a64ad50", "title": "Decentralized Federated Deep Learning Image Recognition Models"}, {"paperId": "20eb0c562012eac4fcf83fe5ddfc47e7c8129e51", "title": "Privacy-Preserving Machine Learning for Snoring Detection"}]}
