{"paperId": "a019a5b85770ea834098b265454f6324e88e25b9", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Contributions of Machine Learning Models towards Student Academic Performance Prediction: A Systematic Review", "abstract": "Machine learning is emerging nowadays as an important tool for decision support in many areas of research. In the field of education, both educational organizations and students are the target beneficiaries. It facilitates the educational sector in predicting the student’s outcome at the end of their course and for the students in deciding to choose a suitable course for them based on their performances in previous exams and other behavioral features. In this study, a systematic literature review is performed to extract the algorithms and the features that have been used in the prediction studies. Based on the search criteria, 2700 articles were initially considered. Using specified inclusion and exclusion criteria, quality scores were provided, and up to 56 articles were filtered for further analysis. The utmost care was taken in studying the features utilized, database used, algorithms implemented, and the future directions as recommended by researchers. The features were classified as demographic, academic, and behavioral features, and finally, only 34 articles with these features were finalized, whose details of study are provided. Based on the results obtained from the systematic review, we conclude that the machine learning techniques have the ability to predict the students’ performance based on specified features as categorized and can be used by students as well as academic institutions. A specific machine learning model identification for the purpose of student academic performance prediction would not be feasible, since each paper taken for review involves different datasets and does not include benchmark datasets. However, the application of the machine learning techniques in educational mining is still limited, and a greater number of studies should be carried out in order to obtain well-formed and generalizable results. We provide future guidelines to practitioners and researchers based on the results obtained in this work.", "venue": "Applied Sciences", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2021-10-26", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "2066203352", "name": "P. Balaji"}, {"authorId": "2523108", "name": "Salem Alelyani"}, {"authorId": "46244363", "name": "Ayman Qahmash"}, {"authorId": "2122911175", "name": "Mohamed Mohana"}], "citations": [{"paperId": "bfcddb461bb7a5f17b6340c32c26524a29f57d1a", "title": "Predicting the impact of internet usage on students’ academic performance using machine learning techniques in Bangladesh perspective"}, {"paperId": "633bfebbe1ec151dabb00f1a102104d06f1fa03d", "title": "Predicting academic achievement from the collaborative influences of executive function, physical fitness, and demographic factors among primary school students in China: ensemble learning methods"}, {"paperId": "87dabd307ef62715f0b881b4670897063004823f", "title": "Predicting Academic Performance of University Students Using Machine Learning: A Case Study in the UK"}, {"paperId": "d082a803db02baf7fd5272b9c9dbfd4d8bd34435", "title": "Speaking of transparency: Are all Artificial Intelligence (AI) literature reviews in education transparent?"}, {"paperId": "97a10005e3ef47064657f15a42000586cdfe84e8", "title": "Predicting and Comparing Students’ Online and Offline Academic Performance Using Machine Learning Algorithms"}, {"paperId": "576a2238e33e7fc092247f95261d7195e57afc5b", "title": "Investigating Students’ Pre-University Admission Requirements and Their Correlation with Academic Performance for Medical Students: An Educational Data Mining Approach"}, {"paperId": "c0b5d4f3a33e4a33b51eb244d8d90bf8fa714cfd", "title": "A systematic review of the literature on machine learning application of determining the attributes influencing academic performance"}, {"paperId": "61fcf13d29463a3fda3209248a719d6d9514408a", "title": "Predicting academic performance associated with physical fitness of primary school students using machine learning methods."}, {"paperId": "72ca66e3d7ecf3b56f776c7d42771f0e59f4be20", "title": "Predicting E-learning Course Final Average-Grade using Machine Learning Techniques : A Case Study in Shaqra University"}, {"paperId": "45e858f8bbdffbeb844179d47267d897f0ab09fc", "title": "A Recommendation System for Selecting the Appropriate Undergraduate Program at Higher Education Institutions Using Graduate Student Data"}, {"paperId": "a4eb08d35e4eaf94c171a26d85e3921c9c298fed", "title": "Student Performance Prediction in Secondary School Education Using Machine Learning"}, {"paperId": "28d0c1f199dd4e79f10fbb252195374701cddfc0", "title": "A systematic review on machine learning models for online learning and examination systems"}, {"paperId": "97bbb35b0d2b8a2133f4053b6bbe35b3a9cae233", "title": "Multimodal Classification of Teaching Activities from University Lecture Recordings"}, {"paperId": "1ee437da17b190dc19134618b9d4174103db6f17", "title": "Automation Process for Learning Outcome Predictions"}]}
