{"paperId": "a035f321f24b9fc33d0ba1fe9c79d9d698be9526", "publicationVenue": {"id": "5604cd6c-f153-45e7-a8e5-d75d4ab2d8d3", "name": "International Workshop on Artificial Intelligence and Cognition", "type": "conference", "alternate_names": ["AIC", "Int Workshop Artif Intell Cogn"]}, "title": "Content Replica Placement Method for Fault Tolerance in Fog Computing Environment", "abstract": "An architecture known as fog computing employs edge devices to perform a significant amount of processing. The fog layer supporting the cloud computing paradigm helps to improve quality of services (QoS) in time-critical applications. The high dynamic and heterogeneous nature of devices at the cloud edge causes failures to be a popular event and therefore fault tolerance became indispensable. Fault tolerance is a significant concern in fog computing for reliable service delivery. Most early fault-tolerant methods did not highly consider time-sensitive requests. This paper proposes a novel file or content replica placement protocol for fault tolerance of fog computing network. The proposed consists of two steps. In first step, proposed method firstly classifies the failure risk of the fog servers available for cache placement based on data of their failure history. In the second step we have proposed replication-based fault tolerance method to replicate the content or file on the fog server, which is less prone to fail. For performance assessment we have used parameters such as recovery, availability, and bandwidth usage. Simulation results verify the efficacy of the proposed scheme is compared with random replica placement and replica-3 method. As a result, the proposed is providing better recoverability (approximately an average of 18% and 37%) and improved availability as compared to RREP and Replica-3 method, less bandwidth (approximately an average of 51%) than the Replica-3 method.", "venue": "International Workshop on Artificial Intelligence and Cognition", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-07-29", "journal": {"name": "2023 IEEE World Conference on Applied Intelligence and Computing (AIC)", "pages": "497-502"}, "authors": [{"authorId": "2248090907", "name": "Priti Kumari"}, {"authorId": "2253766240", "name": "Vandana Dubey"}, {"authorId": "2253573569", "name": "Sarika Shrivastava"}], "citations": []}
