{"paperId": "a040a1ac479118e31079e4e899775b29be87bd05", "publicationVenue": null, "title": "Exploring the Impact of (Not) Changing Default Settings in Algorithmic Crime Mapping - A Case Study of Milwaukee, Wisconsin", "abstract": "Policing decisions, allocations and outcomes are determined by mapping historical crime data geo-spatially using popular algorithms. In this extended abstract, we present early results from a mixed-methods study of the practices, policies, and perceptions of algorithmic crime mapping in the city of Milwaukee, Wisconsin. We investigate this differential by visualizing potential demographic biases from publicly available crime data over 12 years (2005-2016) and conducting semi-structured interviews of 19 city stakeholders and provide future research directions from this study.", "venue": "CSCW Companion", "year": 2019, "fieldsOfStudy": ["Sociology", "Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2019-11-09", "journal": {"name": "Companion Publication of the 2019 Conference on Computer Supported Cooperative Work and Social Computing"}, "authors": [{"authorId": "29880521", "name": "Md. Romael Haque"}, {"authorId": "1404329833", "name": "Katherine Weathington"}, {"authorId": "2345714", "name": "Shion Guha"}], "citations": [{"paperId": "34ff3baeb735ccf2e8df86572c421ca43e67c696", "title": "Are We Asking the Right Questions?: Designing for Community Stakeholders' Interactions with AI in Policing"}, {"paperId": "b2a1177cf52e69271c2c851c6deb9798df869f74", "title": "Uncovering Adverse Childhood Experiences (ACEs) from Clinical Narratives within the Electronic Health Record"}, {"paperId": "3ff45bd481b0898e00519cf18fc42afef2fcc701", "title": "Crowdsourcing Impacts: Exploring the Utility of Crowds for Anticipating Societal Impacts of Algorithmic Decision Making"}, {"paperId": "b43e2d429f6a2f52336c9749651f34d354062418", "title": "Understanding Machine Learning Practitioners' Data Documentation Perceptions, Needs, Challenges, and Desiderata"}, {"paperId": "cab1bbf451810291ae9a91824c3cd2b4a0ce4c7f", "title": "A Framework of High-Stakes Algorithmic Decision-Making for the Public Sector Developed through a Case Study of Child-Welfare"}, {"paperId": "e9cda8ac119f297c5dbb37f836b8bb3878ad2adf", "title": "Understanding Law Enforcement and Common Peoples' Perspectives on Designing Explainable Crime Mapping Algorithms"}, {"paperId": "bbbd3ffeee0b2e4bd8eb12dbf8147fa23605a28a", "title": "A Critical Study of Geospatial Algorithm Use in Crime Analysis and Predictive Policing"}]}
