{"paperId": "a0413c0576f73867d21777a07ed668410e73615a", "publicationVenue": {"id": "1a5858d9-edfe-4a1b-ae39-60020748678f", "name": "ACM Transactions on Architecture and Code Optimization (TACO)", "type": "journal", "alternate_names": ["ACM Transactions on Architecture and Code Optimization", "ACM Trans Archit Code Optim", "ACM Trans Archit Code Optim (TACO"], "issn": "1544-3566", "url": "http://www.acm.org/taco", "alternate_urls": ["http://portal.acm.org/taco/", "https://taco.acm.org/"]}, "title": "Abakus: Accelerating k-mer Counting With Storage Technology", "abstract": "This work seeks to leverage Processing-with-storage-technology (PWST) to accelerate a key bioinformatics kernel called k-mer counting, which involves processing large files of sequence data on the disk to build a histogram of fixed-size genome sequence substrings and thereby entails prohibitively high I/O overhead. In particular, this work proposes a set of accelerator designs called Abakus that offer varying degrees of tradeoffs in terms of performance, efficiency, and hardware implementation complexity. The key to these designs is a set of domain-specific hardware extensions to accelerate the key operations for k-mer counting at various levels of the SSD hierarchy, with the goal of enhancing the limited computing capabilities of conventional SSDs, while exploiting the parallelism of the multi-channel, multi-way SSDs. Our evaluation suggests that Abakus can achieve 8.42 ×, 6.91 ×, and 2.32 × speedup over the CPU-, GPU-, and near-data processing solutions.", "venue": "ACM Transactions on Architecture and Code Optimization (TACO)", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-11-21", "journal": {"name": "ACM Transactions on Architecture and Code Optimization"}, "authors": [{"authorId": "3218500", "name": "Lingxi Wu"}, {"authorId": "2245386983", "name": "Minxuan Zhou"}, {"authorId": "2139549579", "name": "Weihong Xu"}, {"authorId": "1735007", "name": "A. Venkat"}, {"authorId": "2268682077", "name": "Tajana Simunic"}, {"authorId": "2263944135", "name": "K. Skadron"}], "citations": []}
