{"paperId": "a046721fc1ed53757c011ed5fff2270f8b98867c", "publicationVenue": {"id": "89097a03-8be6-4e2d-ae2c-a6df64c77a06", "name": "Frontiers in Psychology", "type": "journal", "alternate_names": ["Front Psychol"], "issn": "1664-1078", "url": "http://www.frontiersin.org/Cultural_Psychology", "alternate_urls": ["http://frontiersin.org/psychology/", "https://www.frontiersin.org/journals/psychology", "http://journal.frontiersin.org/journal/psychology", "http://www.frontiersin.org/psychology"]}, "title": "Learning Beliefs, Time on Platform, and Academic Performance During the COVID-19 in University STEM Students", "abstract": "Due to the closure of universities worldwide because of the COVID-19 pandemic, teaching methods were suddenly transformed to an emergency remote teaching (ERT) modality. Due to the practical nature of STEM courses, students cannot participate in activities in which manipulating objects is necessary for accomplishing learning objectives. In this study, we analyze the relation among STEM students learning beliefs at the beginning of ERT (T1) with their Learning Management systems (LMS) time-on-task and their final academic performance (T2) during the first semester of ERT. We used a prospective longitudinal design. 2063 students (32.3% females) from a university in Chile participated, where the academic year starts in March and finishes in December 2020. We assessed their learning and performance beliefs through an online questionnaire answered at the beginning of the academic period (T1). Then, using learning analytics, time invested in the CANVAS LMS and the academic performance achieved by students at the end of the semester (T2) were assessed. The results show that students mainly stated negative beliefs about learning opportunities during ERT (n = 1,396; 67.7%). In addition, 48.5% (n = 1,000) of students stated beliefs of “medium” academic performance for the first semester (T1). Students with lower learning beliefs at T1 spent less time in the LMS during the semester and had a lower academic performance at T2 than students who had higher learning beliefs at T1. The implications of these findings on the role of instructors and institutions of higher education are discussed.", "venue": "Frontiers in Psychology", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-12-16", "journal": {"name": "Frontiers in Psychology", "volume": "12"}, "authors": [{"authorId": "2093862528", "name": "Karla Lobos"}, {"authorId": "2083843286", "name": "Fabiola Sáez-Delgado"}, {"authorId": "2098208071", "name": "Rubia Cobo-Rendón"}, {"authorId": "2145798075", "name": "Javier Mella Norambuena"}, {"authorId": "2067354529", "name": "Alejandra Maldonado Trapp"}, {"authorId": "2139636275", "name": "Nataly Cisternas San Martin"}, {"authorId": "2067354878", "name": "Carola Bruna Jofré"}], "citations": [{"paperId": "ee2c05c5f1dc91451bf92419f007d5e14ac0fed0", "title": "Exploring students’ beliefs about web-based collaborative learning and their practices: a qualitative case study of university English-as-a-foreign-language readers"}, {"paperId": "a076fd7516ecbe56c92cdc638cf7edad0d1fd6d6", "title": "Students’ Technology Preference and Computer Technology Applications in the Teaching and Learning of Physics Modules at the University Undergraduate Level in South Africa during the COVID-19 Pandemic"}, {"paperId": "314d5e9f880341ea68dbfbaa2274530685170c73", "title": "Self-Regulated Learning and Academic Performance in Chilean University Students in Virtual Mode During the Pandemic: Effect of the 4Planning App"}]}
