{"paperId": "a04ef2ce8f27abb416cdcc65408ee59409deb1f9", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "BIMp-Chart—A Global Decision Support System for Measuring BIM Implementation Level in Construction Organizations", "abstract": "Building Information Modeling (BIM) is recognized as one of the most significant technological breakthroughs in the Architecture, Engineering, and Construction (AEC) industry. The pace of implementation of BIM in AEC has increased during the past decade with an enhanced focus on sustainable construction. However, BIM implementation lags its potential because of several factors such as readiness issues, lack of previous experience in BIM, and lack of market demand for BIM. To evaluate and solve these issues, understanding the current BIM implementation in construction organizations is required. Motivated by this need, the main objective of this study is to propose a tool for the measurement of BIM implementation levels within an organization. Various sets of indexes are developed based on their pertinent Critical Success Factors (CSFs). A detailed literature review followed by a questionnaire survey involving 99 respondents is conducted, and results are analyzed to formulate a BIMp-Chart to calculate and visualize the BIM implementation level of an organization. Subsequently, the applicability of the BIMp-Chart is assessed by comparing and analyzing datasets of four organizations from different regions, including Qatar, Portugal, and Egypt, and a multinational organization to develop a global measurement tool. Through measuring and comparing BIM implementation levels, the BIMp-Chart can help the practitioners identify the implementation areas in an organization for proper BIM implementation. This study helps understand the fundamental elements of BIM implementation and provides a decision support system for construction organizations to devise proper strategies for the effectual management of the BIM implementation process.", "venue": "Sustainability", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2021-08-18", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "94669628", "name": "Qurratulain Malik"}, {"authorId": "52300923", "name": "Abdur Rehman Nasir"}, {"authorId": "92255565", "name": "R. Muhammad"}, {"authorId": "98324213", "name": "Muhammad Jamaluddin Thaheem"}, {"authorId": "48633912", "name": "Fahim Ullah"}, {"authorId": "29231933", "name": "Khurram Iqbal Ahmad Khan"}, {"authorId": "2148764333", "name": "M. Hassan"}], "citations": [{"paperId": "188865434602da77d0a7cc9fb67ce7e47803c355", "title": "Comprehensive analysis of BIM adoption: From narrow focus to holistic understanding"}, {"paperId": "6b99b9f90c7344e4764c3d168d0c33b93adcd7dc", "title": "Potential features of building information modeling (BIM) for application of project management knowledge areas in the construction industry"}, {"paperId": "ce8f27b1b34142f89c77196c4345f7ba78bfc94e", "title": "BIM critical factors and benefits for public sector"}, {"paperId": "31ea7b25c3485725bf19ec323677b80e93b1f98a", "title": "BIM Manager Role in the Integration and Coordination of Construction Projects"}, {"paperId": "42ed7a8e09b709b11aee7e077ef751e571ba78cd", "title": "BIM implementation model from the standpoint of concern-based adoption theory"}, {"paperId": "09f942c7e6e2514cf8f9428aa2bc74f62490159a", "title": "Optimization of the Load of Production Units of the Construction Company"}, {"paperId": "ecae01c1df1b5926d6aa09e4f6931534b7d9b828", "title": "BIM Roles and Responsibilities in Developing Countries: A Dedicated Matrix for Design-Bid-Build Projects"}, {"paperId": "2fda391e89366f484bc747d80122063545b7fc8b", "title": "Exploring the Role of BIM in Construction Safety in Developing Countries: Toward Automated Hazard Analysis"}, {"paperId": "aadcb31fa5a817f3a898bfbf2f5786ac8f666261", "title": "Quantitative and Qualitative Analysis of Applying Building Information Modeling (BIM) for Infrastructure Design Process"}, {"paperId": "97542046393c4f1ea1afd3397631f613f016521f", "title": "Modeling the Critical Success Factors for BIM Implementation in Developing Countries: Sampling the Turkish AEC Industry"}, {"paperId": "bf6b994a579b1a8b74dfd6d5ba3dc5888fd86188", "title": "Using Adaptive Sensors for Optimised Target Coverage in Wireless Sensor Networks"}, {"paperId": "dee33feec4428c1eddc67986de9d3ae647ef3a4d", "title": "A system dynamic model for assessing the level of BIM implementation in construction phase: a China case study"}, {"paperId": "9a541498e285a35443f08b5bdf165e95de394f19", "title": "Assessing Rainwater Harvesting Potential in Urban Areas: A Building Information Modelling (BIM) Approach"}, {"paperId": "b849d43236384e5222cdf6e1f1fb0a03e3d69a21", "title": "Facilitators and Barriers in Applying Building Information Modeling (BIM) for Construction Industry"}, {"paperId": "62078273e86d068074835e4cd3c0b895bf2e69b4", "title": "Intelligent decision support systems in construction engineering: An artificial intelligence and machine learning approaches"}]}
