{"paperId": "a067a95570c2563d424df7be643775cc5bb1752e", "publicationVenue": {"id": "228761ec-c40a-479b-8309-9dcbe9851bcd", "name": "IEEE Internet of Things Journal", "type": "journal", "alternate_names": ["IEEE Internet Thing J"], "issn": "2327-4662", "url": "https://www.ieee.org/membership-catalog/productdetail/showProductDetailPage.html?product=PER288-ELE", "alternate_urls": ["https://ieeexplore.ieee.org/servlet/opac?punumber=6488907", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6488907", "http://ieee-iotj.org/#"]}, "title": "Privacy-Preserving and Traceable Blockchain-Based Charging Payment Scheme for Electric Vehicles", "abstract": "With the rapid development of the global clean energy industry, the electric vehicle (EV) has gradually replaced the traditional fuel vehicle as a promising modern transportation tool due to its environmental friendliness and competitive prices. Its widespread adoption has led to a substantial increase in demand for subsidiary facilities, such as charging piles and stations. Despite the convenience and accessibility offered by charging services, the privacy of EV users may be compromised in the process, as malicious attackers can infer their true identities and consumption habits from service orders. Existing studies introduce blockchain technology into vehicle charging payment scenarios to protect the privacy of EV users. Unfortunately, it cannot achieve the desired full anonymity and may even hinder electricity regulators’ investigation of suspicious transactions and entities. Therefore, designing a vehicle charging payment scheme that simultaneously supports privacy protection and traceability is a challenge. To address these concerns, this article proposes a privacy-preserving and traceable blockchain-based charging payment (PTB-CP) scheme for EVs. It can protect users’ identity privacy and transaction unlinkability and track abnormal transactions or entities in exceptional circumstances. We conduct a comprehensive analysis of PTB-CP from both theoretical and experimental aspects. The analysis results demonstrate that our scheme can realize privacy protection, reliability and authentication, traceability, scalability, and high efficiency.", "venue": "IEEE Internet of Things Journal", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-15", "journal": {"name": "IEEE Internet of Things Journal", "pages": "21254-21265", "volume": "10"}, "authors": [{"authorId": "2145071927", "name": "Yan Wu"}, {"authorId": "145586191", "name": "Can Zhang"}, {"authorId": "1692039", "name": "Liehuang Zhu"}], "citations": [{"paperId": "680a02cdf1edb650a89001ae06059381c5820402", "title": "Blockchain Revolution: Empowering the Electric Vehicle Industry through Integration and Case Study Analysis"}]}
