{"paperId": "a06ce842985561ba9713daf387fc78fb68728709", "publicationVenue": {"id": "a70d4f6e-c912-4ffc-b15d-8313fbe2c464", "name": "International Conference on Advanced Communication Technologies and Networking", "type": "conference", "alternate_names": ["CommNet", "Int Conf Adv Commun Technol Netw"]}, "title": "IoT and Blockchain Integration Security", "abstract": "The Internet of Things (IoT) is already playing an important role in our daily lives by integrating smart devices. Whether it is smart homes, smart cities, or smart transportation, these devices communicate with each other to provide high-quality services to their customers These devices operate together to create a vast network that allows for the production, transmission, and sharing of enormous amounts of data. The fundamental issue is how to maintain the security and integrity of such a complicated network to guarantee the long-term viability and dependability of these Internet of Things-based solutions. Blockchain is an emerging technology from its decentralized properties, proving its distinctive features and capabilities for various problems and application areas, including IoT systems. In this paper, we present a review of blockchain adaptation in the context of the Internet of Things, and how it might address the integration and security issues of devices connected to IoT systems. Discuss IoT data security and the use of blockchain.", "venue": "International Conference on Advanced Communication Technologies and Networking", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference", "Review"], "publicationDate": "2023-12-11", "journal": {"name": "2023 6th International Conference on Advanced Communication Technologies and Networking (CommNet)", "pages": "1-9"}, "authors": [{"authorId": "2276025353", "name": "Amnah Hmoud"}, {"authorId": "2276026747", "name": "Ghada Ali"}, {"authorId": "2276022072", "name": "Rawabi Alanzi"}, {"authorId": "151205156", "name": "Salim Elkhediri"}], "citations": []}
