{"paperId": "a076bfe0b67f13925e037e20231ae12c0b631ba7", "publicationVenue": null, "title": "FORMATION OF INFORMATION SUPPORT SYSTEM FOR THE MANAGEMENT OF AGRICULTURAL ENTERPRISES", "abstract": "The purpose of the article is to generalize and present the peculiarities of the process of forming a system of information support for the management of agricultural enterprises in Ukraine. Methodology. General scientific (generalization, comparison, induction and deduction) and empirical and theoretical methods (analysis, synthesis) were used in the research. The use of system-structural analysis made it possible to identify the main features of the process of forming a system of information support for the management of agricultural enterprises in Ukraine. The results of the study showed that with the help of big data analysis in agriculture it is possible to remotely detect problems that can be used to identify nutrient deficiencies, diseases, lack or excess of water, pest and weed infestation, insect damage, etc. It is determined that the use of analytical tools based on the analysis of geographic information systems data is useful in modeling and mapping, which can be used to predict crop yields. Practical implications. The results of the study can be used in the management of agricultural enterprises in Ukraine. The obtained results can be directed to further research on the analysis of big data in agriculture in the management of agricultural enterprises. Value / originality. The scientific novelty of the results obtained is determined by the solution of an important scientific task, which is to develop theoretical provisions and practical recommendations for the formation of a system of information support for the management of agricultural enterprises in Ukraine. The work has further developed research on the use and analysis of big data in agriculture in the management of agricultural enterprises in Ukraine.", "venue": "Economics &amp; Education", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-11-30", "journal": {"name": "Economics &amp; Education"}, "authors": [{"authorId": "144554199", "name": "V. Vakulenko"}, {"authorId": "2280855910", "name": "Xiaowei Liu"}], "citations": []}
