{"paperId": "a080866fb9b2e2717cd2d8fc37cae5d6f4b4bb32", "publicationVenue": {"id": "7bb54772-a70c-44df-9b9d-9f3b5354c0e2", "name": "IEEE International Parallel and Distributed Processing Symposium", "type": "conference", "alternate_names": ["IEEE Int Parallel Distrib Process Symp", "International Parallel and Distributed Processing Symposium", "IPDPS", "Int Parallel Distrib Process Symp"], "url": "http://www.ipdps.org/"}, "title": "Swallow: Joint Online Scheduling and Coflow Compression in Datacenter Networks", "abstract": "Big data analytics in datacenters often involves scheduling of data-parallel job, which are bottlenecked by limited bandwidth of datacenter networks. To alleviate the shortage of bandwidth, some existing work has proposed traffic compression to reduce the amount of data transmitted over the network. However, their proposed traffic compression works in a coarse-grained manner at job level, leaving a large optimization space unexplored for further performance improvement. In this paper, we propose a flow-level traffic compression and scheduling system, called Swallow, to accelerate data-intensive applications. Specifically, we target on coflows, which is an elegant abstraction of parallel flows generated by big data jobs. With the objective of minimizing coflow completion time (CCT), we propose a heuristic algorithm called Fastest-Volume-Disposal-First (FVDV) and implement Swallow based on Spark. The results of both trace-driven simulations and real experiments show the superiority of our system, over existing algorithms. Swallow can reduce CCT and job completion time (JCT) by up to 1.47 × and 1.66 × on average, respectively, over the SEBF in Varys, one of the most efficient coflow scheduling algorithms so far. Moreover, with coflow compression, Swallow reduces data traffic by up to 48.41% on average.", "venue": "IEEE International Parallel and Distributed Processing Symposium", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-05-21", "journal": {"name": "2018 IEEE International Parallel and Distributed Processing Symposium (IPDPS)", "pages": "505-514"}, "authors": [{"authorId": "1993679419", "name": "Qihua Zhou"}, {"authorId": "143667002", "name": "Peng Li"}, {"authorId": "28014924", "name": "Kun Wang"}, {"authorId": "2288376751", "name": "Deze Zeng"}, {"authorId": "144123438", "name": "Song Guo"}, {"authorId": "1697293", "name": "M. Guo"}], "citations": [{"paperId": "c87696b49fa4f15f368baef845672bf8bc6f6dc6", "title": "Joint Request Updating and Elastic Resource Provisioning With QoS Guarantee in Clouds"}, {"paperId": "c9c7d1909949e7787b416ec68de3b8e15648097d", "title": "Flexible Cyclic Queuing and Forwarding for Time-Sensitive Software-Defined Networks"}, {"paperId": "0a783fc2ae61b367e70c0863d67b1b3f2cb1454e", "title": "Coflow scheduling with unknown prior knowledge based on traffic characteristics"}, {"paperId": "36462c2979252e6aeea17f3e4eaa6c1df862987e", "title": "Falcon: Addressing Stragglers in Heterogeneous Parameter Server Via Multiple Parallelism"}, {"paperId": "8ce0bf1b322e127e2b0c21c5476f9097843a4b91", "title": "Towards Mitigating Straggler with Deep Reinforcement Learning in Parameter Server"}, {"paperId": "e894918b103002753f810c0d22411d8aab9d1774", "title": "Shuffle Scheduling for MapReduce Jobs Based on Periodic Network Status"}, {"paperId": "3c2c2093a9211e0c17d291cfbeb9682fdaf4de76", "title": "Fast Coflow Scheduling via Traffic Compression and Stage Pipelining in Datacenter Networks"}, {"paperId": "47eea9d53b84ffbd127ff93f7996594a2444be6d", "title": "Topology-Aware Job Scheduling for Machine Learning Cluster"}, {"paperId": "6f6123de857180e38941d59d4f89701d8a2a7d07", "title": "A rewrite-based optimizer for Spark"}, {"paperId": "edd7da08668aab41409b073170de7789c8bd7a9f", "title": "Falcon: Towards Computation-Parallel Deep Learning in Heterogeneous Parameter Server"}, {"paperId": "f006a67c5b6b13a0862207e6db50d6d7d9d34363", "title": "Cluster Frameworks for Efficient Scheduling and Resource Allocation in Data Center Networks: A Survey"}]}
