{"paperId": "a0850b10ee890b9d42b000228e2a9139095bcf10", "publicationVenue": {"id": "3a6852ff-2407-4ed1-bbc2-0b398f5b4cea", "name": "European Conference on Pattern Languages of Programs", "type": "conference", "alternate_names": ["Eur Conf Pattern Lang Program", "European Conference on Pattern Languages of Program", "ECPLP", "EuroPLoP"], "url": "http://hillside.net/europlop/"}, "title": "BlockBD: a security pattern to incorporate blockchain in big data ecosystems", "abstract": "Big Data is changing the perspective on how to obtain valuable information from data stored by organizations of all kinds. By using these insights, companies can make better decisions and thus achieve their business goals. However, each new technology can create new security problems, and Big Data is no exception. One of the major security issues in a Big Data ecosystem is what level of trust in data and data sources stakeholders can have: without reliable data, the results of data analysis lose value. In this paper, we propose a security pattern to improve traceability and veracity of data through the use of Blockchain technologies. In this pattern, Blockchain will be used as a distributed ledger where all operations performed on the data will be registered. Therefore, the veracity of the data will increase, as will the confidence in the insights obtained from the analysis. The purpose of this paper is to help Chief Security Officer and Big Data architects incorporate this mechanism to improve the security of their environment.", "venue": "European Conference on Pattern Languages of Programs", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2019-07-03", "journal": {"name": "Proceedings of the 24th European Conference on Pattern Languages of Programs"}, "authors": [{"authorId": "152353447", "name": "Julio Moreno"}, {"authorId": "1745901", "name": "E. Fernández"}, {"authorId": "1398539214", "name": "E. Fernández-Medina"}, {"authorId": "144831784", "name": "M. Serrano"}], "citations": [{"paperId": "c983533c0be5cbb85d1d78758fb1a52253069e36", "title": "Design pattern recommendations for building decentralized healthcare applications"}, {"paperId": "81b6f9c78c7d43634544225c76477b8e4de967db", "title": "Revealing the role of values in developing a garden data ecosystem through a reflective participatory design approach"}, {"paperId": "85425d499116947d106508816c9e70c518adfc99", "title": "DLMetaChain: An IoT Data Lake Architecture Based on the Blockchain"}, {"paperId": "f8b8a831d833b631c37f85bf8af3c289d8dd6ade", "title": "Blockchain software patterns for the design of decentralized applications: A systematic literature review"}, {"paperId": "6b6cf038f274cfcb94b0f44c5e17ea69ab3175d2", "title": "A Pattern Sequence for Designing Blockchain-Based Healthcare Information Technology Systems"}, {"paperId": "9ab6dbd7ff0f54850403bbb6d29c5bbce1dfb2b5", "title": "A Survey on Blockchain for Big Data: Approaches, Opportunities, and Future Directions"}, {"paperId": "d5607ec0c5bbb0fcf5beba922a7a332f6249d239", "title": "A Catalog of Security Patterns"}]}
