{"paperId": "a08a2ed1a332f6e989f648ac9efb833026461d5f", "publicationVenue": {"id": "5440268e-4691-4fc0-8d0e-dcd6df18e77f", "name": "ACM/IEEE International Conference on Mobile Computing and Networking", "type": "conference", "alternate_names": ["MOBICOM", "MobiCom", "ACM/IEEE Int Conf Mob Comput Netw"], "url": "http://www.acm.org/sigs/sigmobile/"}, "title": "Experience: adopting indoor outdoor detection in on-demand food delivery business", "abstract": "This paper presents our experience in adopting recent research results of mobile phone based indoor/outdoor detection (IODetector) to support the real world business of on-demand food delivery. The real world deployment of the adopted IODetector involves three phases spanning 20 months, during which the deployment scales from a feasibility study across a few areas of interest to a city-wide trial in Shanghai, and eventually to nationwide deployment over 367 cities in China. Iterative development has been performed throughout different deployment phases to excel the IODetector. Large scale evaluation and comparative A/B testing suggest key value of adopting indoor/outdoor detection in the real world business. We also present the lessons learned from the deployment experience including real world know-hows, practical limits and constraints, as well as discussions on design alternatives. We believe this paper provides insights to guide future efforts in translating research results to industry adoptions.", "venue": "ACM/IEEE International Conference on Mobile Computing and Networking", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2022-10-14", "journal": {"name": "Proceedings of the 28th Annual International Conference on Mobile Computing And Networking"}, "authors": [{"authorId": "46842554", "name": "Pengfei Zhou"}, {"authorId": "97510715", "name": "Yi Ding"}, {"authorId": "98177814", "name": "Y. Li"}, {"authorId": "143641798", "name": "Mo Li"}, {"authorId": "3381568", "name": "G. Shen"}, {"authorId": "2055131498", "name": "Tian He"}], "citations": [{"paperId": "b5ecf201b27ee9e4f448c461f1522cc8367b65ba", "title": "The Wisdom of 1,170 Teams: Lessons and Experiences from a Large Indoor Localization Competition"}, {"paperId": "b3f5abcdcab64542182bcbdf6c8c50f12732da0b", "title": "Machine Learning-Enhanced Radio Tomographic Device for Energy Optimization in Smart Buildings"}, {"paperId": "969e625aa522f197eaca439763656c501d88dcbf", "title": "Experience: pushing indoor localization from laboratory to the wild"}]}
