{"paperId": "a08c4914a86b097eeec6322d097ef5b03ba4d891", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Model Compression in Practice: Lessons Learned from Practitioners Creating On-device Machine Learning Experiences", "abstract": "On-device machine learning (ML) promises to improve the privacy, responsiveness, and proliferation of new, intelligent user experiences by moving ML computation onto everyday personal devices. However, today's large ML models must be drastically compressed to run efficiently on-device, a hurtle that requires deep, yet currently niche expertise. To engage the broader human-centered ML community in on-device ML experiences, we present the results from an interview study with 30 experts at Apple that specialize in producing efficient models. We compile tacit knowledge that experts have developed through practical experience with model compression across different hardware platforms. Our findings offer pragmatic considerations missing from prior work, covering the design process, trade-offs, and technical strategies that go into creating efficient models. Finally, we distill design recommendations for tooling to help ease the difficulty of this work and bring on-device ML into to more widespread practice.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-10-06", "journal": {"name": "ArXiv", "volume": "abs/2310.04621"}, "authors": [{"authorId": "10735510", "name": "Fred Hohman"}, {"authorId": "2874726", "name": "Mary Beth Kery"}, {"authorId": "94002566", "name": "Donghao Ren"}, {"authorId": "2256987711", "name": "Dominik Moritz"}], "citations": [{"paperId": "e242bcf28ff0d196f8d88902e587b721101b46af", "title": "Mobile Fitting Room: On-device Virtual Try-on via Diffusion Models"}, {"paperId": "9c71f49f5bb6fb916423e36acd8be3155a6fddb6", "title": "Wordflow: Social Prompt Engineering for Large Language Models"}]}
