{"paperId": "a0a4b76b6c6e5baadd64516cb5f6df66a33da955", "publicationVenue": {"id": "a00fde74-d8df-4613-b825-0fff9f531d3f", "name": "IEEE Transactions on Network and Service Management", "type": "journal", "alternate_names": ["IEEE Trans Netw Serv Manag"], "issn": "1932-4537", "url": "http://ejournals.ebsco.com/direct.asp?JournalID=714200", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4275028", "http://ieeexplore.ieee.org/servlet/opac?punumber=4275028"]}, "title": "Anomaly Detection in Complex Real World Application Systems", "abstract": "The ability to understand application performance and pro-actively manage system state is becoming increasingly important as infrastructure services move toward commodisation models such as cloud computing. The complexity of systems being monitored in large corporations means that detailed component-by-component analysis and/or simulation of behaviour can be impractical. The key problem is to find practical systems management approaches that enable behavioural profiling and detection of anomalous events in complex real world systems. This paper details a system performance measurement method that enables slowdown event detection and characterisation of application behaviour. These measurement techniques can underpin IT service management frameworks such as the IT Infrastructure Library. This enables business to manage the stability and performance of the end-user experience in order to support productivity and effectiveness of business processes. This paper examines anomaly detection efficiency in two case studies using six detection models in a large Australian financial services organisation. The whole of service anomaly detection methodology proposed in this paper was found to be more efficient than alternative individual transaction and whole of service models.", "venue": "IEEE Transactions on Network and Service Management", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-03-01", "journal": {"name": "IEEE Transactions on Network and Service Management", "pages": "83-96", "volume": "15"}, "authors": [{"authorId": "3247461", "name": "Richard Gow"}, {"authorId": "10690836", "name": "F. Rabhi"}, {"authorId": "2291598", "name": "S. Venugopal"}], "citations": [{"paperId": "2f018a07a3a0d49c7b5fa9fe026c92fdc2689a5f", "title": "Detection of microservice‐based software anomalies based on OpenTracing in cloud"}, {"paperId": "4dc23cb4f48ab4ce72f90cb7a09c25ff2565b803", "title": "Workflow-Aware Automatic Fault Diagnosis for Microservice-Based Applications With Statistics"}, {"paperId": "04deb24455e327d6a094a5d96939a333a3034a66", "title": "Deep Transfer Learning for IoT Attack Detection"}, {"paperId": "9bd1a53a6a239aaa7b51e652144e2601154d9ea3", "title": "Detecting and Localizing Anomalies in Container Clusters Using Markov Models"}, {"paperId": "2002175e9f86db1924654a58fdc547f030814bfd", "title": "An Ensemble of Activation Functions in AutoEncoder Applied to IoT Anomaly Detection"}, {"paperId": "f432726a2d1b1824a2c01e2992d095bfcff9332a", "title": "Minimal Triangle Area Mahalanobis Distance for Stream Homogeneous Group-based DDoS Classification"}, {"paperId": "5ee494b2a8471629b9db9d6c746de40ac9eb9e3e", "title": "DNN Inference Acceleration with Partitioning and Early Exiting in Edge Computing"}, {"paperId": "b58b7db4e87553fab49103943e11345ef00d77e8", "title": "Intrusion Detection System Using WoSAD Method"}]}
