{"paperId": "a0b9f6bd6c59d024d1dbb3aa472c508359d66491", "publicationVenue": {"id": "d5b215f3-f737-45b2-875b-df309ce14c43", "name": "Scientific Programming", "type": "journal", "alternate_names": ["Sci Program"], "issn": "1058-9244", "url": "https://www.hindawi.com/journals/sp/", "alternate_urls": ["https://www.iospress.nl/html/10589244.php", "https://www.wiley.com/legacy/compbooks/compjournals/sciprog.html", "http://content.iospress.com/journals/scientific-programming"]}, "title": "RnkHEU: A Hybrid Feature Selection Method for Predicting Students' Performance", "abstract": "Predicting students’ performance is one of the most concerned issues in education data mining (EDM), which has received more and more attentions. Feature selection is the key step to build prediction model of students’ performance, which can improve the accuracy of prediction and help to identify factors that have significant impact on students’ performance. In this paper, a hybrid feature selection method named rank and heuristic (RnkHEU) was proposed. This novel feature selection method generates the set of candidate features by scoring and ranking firstly and then uses heuristic method to generate the final results. The experimental results show that the four major evaluation criteria have similar performance in predicting students’ performance, and the heuristic search strategy can significantly improve the accuracy of prediction compared with forward search method. Because the proposed RnkHEU integrates ranking-based forward and heuristic search, it can further improve the accuracy of predicting students’ performance with commonly used classifiers about 10% and improve the precision of predicting students’ academic failure by up to 45%.", "venue": "Scientific Programming", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-11-11", "journal": {"name": "Sci. Program.", "pages": "1670593:1-1670593:16", "volume": "2021"}, "authors": [{"authorId": "2090255888", "name": "Wen Xiao"}, {"authorId": "2001001182", "name": "Ping Ji"}, {"authorId": "2117230547", "name": "Juan Hu"}], "citations": [{"paperId": "245825c4c61dfa2508cd50ab92e60736214342b4", "title": "Hybrid Feature Extraction Model to Categorize Student Attention Pattern and Its Relationship with Learning"}, {"paperId": "b3ad93062574fed7c21d936467096173f94c5fa4", "title": "Hybrid feature selection based ScC and forward selection methods"}, {"paperId": "6de8c76c7ab32b91fc86f7dc5c56e0579e15031d", "title": "Finding Relevant Information in Big Datasets with ML"}, {"paperId": "7838f0370cd1b649a98e18d2e7b33a5ea1666db7", "title": "Enhancing the Intrusion Detection Efficiency using a Partitioning-based Recursive Feature Elimination in Big Cloud Environment"}, {"paperId": "70c24e59c41bc7a6971518b945b92914b1422615", "title": "Predicting Academic Performance of Low-Income Students in Public Ecuadorian Online Universities: An Educational Data Mining Approach"}, {"paperId": "426e2386a74381aafcf57a71d337c73361f696e8", "title": "Study on Feature Engineering and Ensemble Learning for Student Academic Performance Prediction"}]}
