{"paperId": "a0bd9856659592d50f63f12074be1cde41bbb63e", "publicationVenue": {"id": "96999166-7d47-4d87-b4f8-e11d11c7c45a", "name": "Sustainable cities and society", "type": "journal", "alternate_names": ["Sustain city soc", "Sustain City Soc", "Sustainable Cities and Society"], "issn": "2210-6707", "url": "https://www.journals.elsevier.com/sustainable-cities-and-society", "alternate_urls": ["http://www.sciencedirect.com/science/journal/22106707"]}, "title": "Using a digital twin to explore water infrastructure impacts during the COVID-19 pandemic", "abstract": null, "venue": "Sustainable cities and society", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-11-01", "journal": {"name": "Sustainable Cities and Society", "pages": "103520 - 103520", "volume": "77"}, "authors": [{"authorId": "151060061", "name": "Jorge E. Pesantez"}, {"authorId": "2133968190", "name": "Faisal Alghamdi"}, {"authorId": "2036574540", "name": "Shreya Sabu"}, {"authorId": "1777916", "name": "G. Mahinthakumar"}, {"authorId": "21614943", "name": "E. Berglund"}], "citations": [{"paperId": "399319ed1e2a687ebc51ff9c17c017c0dd64f91e", "title": "Social distancing, water demand changes, and quality of drinking water during the COVID-19 pandemic"}, {"paperId": "1d595af676f64f42b25bb6036a3dce957c7cffab", "title": "Analysis of carbon emissions from social water cycle in the pearl river delta of COVID-19: Perspectives from water-energy-carbon nexus"}, {"paperId": "50a658b0494cd75efac6a1604dafb14df7b3c9ec", "title": "State-of-the-Practice of Digital Twin Implementation in the Utility Sector"}, {"paperId": "a65baee9ccf9896324bd653ddebd01c802fbb955", "title": "Water insecurity tradeoffs: U.S. drinking water systems during the COVID-19 pandemic"}, {"paperId": "272146afa245c63b462e7ed55e924cd68417c6fa", "title": "Graph Neural Networks for Pressure Estimation in Water Distribution Systems"}, {"paperId": "4c9d486c1b73d5ba41f1762a17d78ee72eaffa5e", "title": "Digital Twin of a Hydraulic System with Leak Diagnosis Applications"}, {"paperId": "6f7a0f20f16a6286f0ee4066d35b17100b303989", "title": "The urban hydrosocial cycle: why should engineers care?"}, {"paperId": "e8ae6dfff744cccf319674cd542402e35a7ba795", "title": "Application and enabling technologies of digital twin in operation and maintenance stage of the AEC industry: A literature review"}, {"paperId": "1787c836d5f70c6e2cd6695a2ff53d67b1b829d9", "title": "From digital twin paradigm to digital water services"}, {"paperId": "bae50e5fa2b7d0411ee9922550f7b0559c029648", "title": "Four buildings and a flush: Lessons from degraded water quality and recommendations on building water management"}, {"paperId": "866ad37d6c802334cf51829424d97c0d49f7baf5", "title": "A critical review for the application of Cutting-edge Digital Visualisation Technologies for Effective Urban Flood Risk Management"}, {"paperId": "96547ed5ee172e98a1d542f34f4d27acb19ae857", "title": "Digital Twin assisted decision support system for quality regulation and leak localization task in large-scale water distribution networks"}, {"paperId": "e0f174054de61c65b89b79d659c35c6ebefa4429", "title": "Digital Twin for Water Distribution Systems Management—Towards a Paradigm Shift"}, {"paperId": "a7f7c72ebf46bc806ac35e1e947e08a1d41e9ebe", "title": "Toward the attainment of climate-smart PPP infrastructure projects: a critical review and recommendations"}, {"paperId": "2afbd11b26377ccdd67f12cbd71e7f20d879a885", "title": "Artificial-intelligence-led revolution of construction materials: From molecules to Industry 4.0"}, {"paperId": "314d8f498f44236ba4670273a868aa7d5a778022", "title": "Risk assessment of infrastructure REITs projects based on cloud model: a case study of China"}, {"paperId": "6c036c765305115190a7039ed2d31c441a25ccd6", "title": "Coupling Machine Learning and Agent-Based Modeling to Characterize Contamination Sources in Water Distribution Systems for Changing Demand Regimes"}, {"paperId": "bc0dba2ce7a863e4cee3b6eb1571246edc910554", "title": "Digital Twin Simulation Tools, Spatial Cognition Algorithms, and Multi-Sensor Fusion Technology in Sustainable Urban Governance Networks"}, {"paperId": "7f89f64858cececad46e93c0eb67b2c542f1322b", "title": "Spatiotemporal optimization of water quality degradation monitoring in water distribution systems supplied by surface sources: A chronological and critical review."}, {"paperId": "839a6303dc70d1dfaf36142cce9d27f44369d4f7", "title": "Are digital twins improving urban-water systems efficiency and sustainable development goals?"}, {"paperId": "d575f1f67fc2952ade97d9d5a2440a646406fd19", "title": "Digital Twins for Water Distribution Systems"}, {"paperId": "1befd2f6e10a44aa21fe8dc4363bf51212e5ef57", "title": "Customer complaint management and smart technology adoption by community water systems"}, {"paperId": "99eaaae705a6a9104c9ad371d30df11db72ba8e7", "title": "High Fidelity Digital Twin-Based Anomaly Detection and Localization for Smart Water Grid Operation Management"}, {"paperId": "7e289d82e28297473fb27b748b4451c850cc436e", "title": "Computational Tools for Supporting the Operation and Management of Water Distribution Systems towards Digital Transformation"}, {"paperId": "2bf9564d84c94d34385e70bb490672dd0d63cfc9", "title": "Application of “Behind the Barriers” Model at Neighbourhood Scale to Improve Water Management under Multi-Risks Scenarios: A Case Study in Lyon, France"}, {"paperId": "d8cca70598f85ef1dffd489c4d04a74a53cb9cd0", "title": "Digital twin-supported smart city: Status, challenges and future research directions"}, {"paperId": "213c9994cd9a939d78dec92905e6cc6b00ceaa1c", "title": "Progress and prospects in planning: A bibliometric review of literature in Urban Studies and Regional and Urban Planning, 1956–2022"}, {"paperId": "7b2ea0217647eb2e30125a2a7e1ae9145cb68e14", "title": "Three research priorities for just and sustainable urban systems: Now is the time to refocus"}, {"paperId": "36185a98b30d9c1677701bf3dc053df5c1a85de3", "title": "Social equity implications of advanced water metering infrastructure"}, {"paperId": "8daf74084712ec59965dcf205ccb8ef0937f1a93", "title": "CFD simulation and experimental study of the irrigation performance of new ebb-and-flow soilless cultivation troughs"}, {"paperId": "ab3523202e7d7040cc889dcfcdea52cd83b70e88", "title": "A Service-Oriented Digital Twins Framework for Smart Grid Management"}, {"paperId": "7a73a67e55c3482cc389b43865742b85d31818ed", "title": "An Agent-Based Model for Contamination Response in Water Distribution Systems during the COVID-19 Pandemic"}, {"paperId": "2e38a7d6efdf19f1abd63683177087fd8151395c", "title": "The role of deep learning in urban water management: A critical review."}, {"paperId": "c5cf40794e8a2cd02f593660b5523a4902183b23", "title": "Investigation of pre and post environmental impact of the lockdown (COVID-19) on the water quality of the Capibaribe and Tejipió rivers, Recife metropolitan region, Brazil"}, {"paperId": "60e5b895bf717090d5f6bfd08a11ce2313afe229", "title": "Modeling in the COVID-19 Pandemic: Overcoming the Water Sector’s Data Struggles to Realize the Potential of Hydraulic Models"}, {"paperId": "c77c0c49590b79363fd8f70dd8f45b6190f56301", "title": "Effects of the COVID-19 Pandemic on Water Utility Operations and Vulnerability"}, {"paperId": "772c3b63539bcf7c00ec707674e1a21ad7529b8b", "title": "Using advanced metering infrastructure data to evaluate consumer compliance with water advisories during a water service interruption."}, {"paperId": "641476568819b75d944e1071603fc3f021518a62", "title": "A Case Study of the Relationship Between Vegetation Coverage and Urban Heat Island in a Coastal City by Applying Digital Twins"}, {"paperId": "700945d7615bab2c6eaa9b153f6758ac5c9ca798", "title": "New Challenges towards Smart Systems’ Efficiency by Digital Twin in Water Distribution Networks"}, {"paperId": "679884bf55e81e802988aceac01488b7c55a1a7b", "title": "Toward the Next Generation of Digitalization in Agriculture Based on Digital Twin Paradigm"}, {"paperId": "ef070fa8b31ab7d56adff9b19abdbbded80bf38a", "title": "A review on recent developments of smart cities"}, {"paperId": "d7441d0dda191f325d9d6c70b358bec1a0a92c74", "title": "The Rise of Cyberinfrastructure for Environmental Applications Special Issue: DIGITAL WATER"}]}
