{"paperId": "a0da0fb1e2766506794489ec2f077cb63de4d699", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Learning-Based Data Storage [Vision] (Technical Report)", "abstract": "Deep neural network (DNN) and its variants have been extensively used for a wide spectrum of real-world applications such as image classification, face/speech recognition, fraud detection, and so on. In addition to many important machine learning tasks, as artificial networks emulating the way brain cells function, DNNs also show the capability of storing non-linear relationships between input and output data, which exhibits the potential of storing data via DNNs. We envision a new paradigm of data storage, “DNN-as-a-Database”, where data are encoded in well-trained machine learning models. Compared with conventional data storage that directly records data in raw formats, learning-based structures (e.g., DNNs) can implicitly encode data pairs of inputs and outputs and compute/materialize actual output data of different resolutions only if input data are provided. This new paradigm can greatly enhance the data security, allow flexible data privacy settings on different levels, achieve low space consumption and fast computation with the acceleration of new hardware (e.g., Diffractive Neural Networks or AI chips), and can be generalized to distributed DNN-based storage/computing. In this paper, we will propose this novel concept of learning-based data storage , which utilizes a learning structure called learning-based memory unit (LMU), to store, organize, and retrieve data. As a case study, we use DNNs as the engine in the LMU, and study the data capacity and accuracy of the DNN-based relational tables. Our preliminary experimental results show the feasibility of the learning-based data storage by achieving high (100%) accuracy of the stored data in the DNN. We also explore and design effective solutions to manage and query the DNN-based relational tables in LMU. Furthermore, we discuss how to generalize our solutions to other data types (e.g., graphs) and environments such as distributed DNN storage/computing.", "venue": "arXiv.org", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-06-12", "journal": {"name": "ArXiv", "volume": "abs/2206.05778"}, "authors": [{"authorId": "1800925", "name": "Xiang Lian"}, {"authorId": "2108168094", "name": "Xiaofei Zhang"}], "citations": []}
