{"paperId": "a0e6ebaaf7cc078fbd1fc8cd86b656d8b38c8037", "publicationVenue": {"id": "09916faa-74be-4dae-acbe-d754603787b9", "name": "Annals of the American Association of Geographers", "type": "journal", "alternate_names": ["Ann Am Assoc Geogr"], "issn": "2469-4452", "url": "http://www.tandfonline.com/RAAG"}, "title": "Understanding Social Inequality in Individual Perceived Exposures to Air Pollution in Residential and Visited Neighborhoods: A Study Using Association Rule Mining", "abstract": "Using individual-level data collected from two communities in Hong Kong, this study proposes a significant association rule mining method to identify the complex associations between individual socioeconomic characteristics and perceived air pollution in people’s daily life. It defines a measure, namely the rule inequality index, to assess the social inequality in perceived exposure to air pollution in both residential and visited neighborhoods. The results indicate that the associations between individual socioeconomic characteristics and perceived air pollution are not always consistent over communities, nor are the value ranges of perceived air pollution. Further, the tendency of different social groups to perceive high levels of air pollution can differ considerably depending on whether they are in their residential or visited neighborhoods. We also find that social groups based on different socioeconomic variables typically experience varying degrees of neighborhood effects on the associated social equalities. Our findings emphasize the importance of considering nonstationary associations and human mobility in research on social inequality related to mobility-dependent environmental exposure.", "venue": "Annals of the American Association of Geographers", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-29", "journal": {"name": "Annals of the American Association of Geographers", "pages": "2392 - 2416", "volume": "113"}, "authors": [{"authorId": "2237099223", "name": "Jiannan Cai"}, {"authorId": "1817124213", "name": "Mei‐Po Kwan"}], "citations": [{"paperId": "6b19d80e8558c65696c76c7b217af5eb6b63efbe", "title": "Investigating the neighborhood effect averaging problem (NEAP) in greenspace exposure: A study in Beijing"}, {"paperId": "91a80b455261518d63a22229006e50eca44a7e63", "title": "Does Green Infrastructure Affect Housing Prices via Extreme Heat and Air Pollution Mitigation? A Focus on Green and Climate Gentrification in Los Angeles County, 2000-2021."}]}
