{"paperId": "a0ec3b75cf17b8e40c48201bcb4fbbe96396bb04", "publicationVenue": {"id": "3b8ad848-3e85-4325-989f-d77440777eca", "name": "International Conference on Fog and Edge Computing", "type": "conference", "alternate_names": ["ICFEC", "Int Conf Fog Edge Comput"]}, "title": "CHANGE: Delay-Aware Service Function Chain Orchestration at the Edge", "abstract": "In Mobile Edge Computing (MEC), the network’s edge is equipped with computing and storage resources in order to reduce latency by minimizing communication with remote clouds. However, the available computing capacity at the edge is limited compared to that of remote clouds. A promising solution for efficient utilization of the limited capacity at the edge is fine-grained processing of user demands via Virtual Network Functions (VNFs). In this approach, user service demands are expressed as Service Function Chains (SFCs), which are composed of virtual network functions. Such service composition allows constituent VNFs to be flexibly deployed at the edge or in the cloud such that the service latency is minimized. The increasing number of users, however, challenges the scalability of system-managed SFC orchestration. To address this problem, we propose a user-managed online SFC orchestration framework at the edge of the network, called CHANGE, that minimizes service latency by jointly considering the effect of user mobility, edge capacity and service migration. We first present the theoretical foundations of CHANGE and then evaluate its performance via model-driven simulations and realistic Mininet-WiFi emulations. Our results show that CHANGE can improve latency performance by nearly 20% compared to other approaches.", "venue": "International Conference on Fog and Edge Computing", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-05-01", "journal": {"name": "2021 IEEE 5th International Conference on Fog and Edge Computing (ICFEC)", "pages": "19-28"}, "authors": [{"authorId": "2152511547", "name": "Lei Wang"}, {"authorId": "52454145", "name": "Mahdi Dolati"}, {"authorId": "145742290", "name": "Majid Ghaderi"}], "citations": [{"paperId": "6e6db54e0d2262803e8c08896e35762b43818e84", "title": "Relay-Assisted Online Service Function Chain Placement and Resource Allocation in 6G Network"}, {"paperId": "012fbd3a947ff9786c8fdd3bbd9b156b032c35ea", "title": "Layer-Aware Containerized Service Orchestration in Edge Networks"}, {"paperId": "1725096447b12922a67d8ae7e067bdebd03b9235", "title": "Multi-criteria Service Function Chaining Orchestration for Multi-user Virtual Reality Services"}, {"paperId": "a31232f9a3baf2886dcdcb7070eb74389799fa48", "title": "Dynamic UPF placement and chaining reconfiguration in 5G networks"}]}
