{"paperId": "a0fc65bfed2ca92d2081e00a85bb4d9496bc6a6e", "publicationVenue": {"id": "75d7a8c1-d871-42db-a8e4-7cf5146fdb62", "name": "Social Science Research Network", "type": "journal", "alternate_names": ["SSRN, Social Science Research Network (SSRN) home page", "SSRN Electronic Journal", "Soc Sci Res Netw", "SSRN", "SSRN Home Page", "SSRN Electron J", "Social Science Electronic Publishing presents Social Science Research Network"], "issn": "1556-5068", "url": "http://www.ssrn.com/", "alternate_urls": ["www.ssrn.com/", "https://fatcat.wiki/container/tol7woxlqjeg5bmzadeg6qrg3e", "https://www.wikidata.org/wiki/Q53949192", "www.ssrn.com/en", "http://www.ssrn.com/en/", "http://umlib.nl/ssrn", "umlib.nl/ssrn"]}, "title": "New Trends in the Global Digital Transformation Process of the Agri-Food Sector: An Exploratory Study Based on Twitter", "abstract": "CONTEXT The agri-food system is undergoing pervasive changes in business models, facilitated by the use of digital technologies. Although today it is almost inevitable for any business to adopt some level of digital transformation to strengthen their competitiveness, this transition in the agri-food sector could be more complex, given its characteristics. OBJECTIVE The aim of the study is to analyse worldwide the perceptions of new digital technologies in the agri-food sector expressed within social media platforms, identifying the differences that may exist between them regarding its objectives and social acceptance. METHODS This paper examines the information regarding digital transformation process in the agri-food sector disseminated worldwide on Twitter. For that purpose, Twitter API is used to gather tweets and descriptive and content analyses, including a sentiment analysis, are performed using R and MAXQDA software. RESULTS AND CONCLUSIONS We found that the digitalization of the agri-food sector is broadly discussed within Twitter. Different actors participate in these information flows, being companies and digital solution providers the most active users and academics and governmental institutions the most visible. Artificial Intelligence was the most mentioned technology, that together with the Internet of Things, Big Data, Machine Learning, and Cloud Computing, was related to improving production efficiencies, crop yield, or cost reduction. In the case of Blockchain Technology, it was closer to food supply chain actors, such as distribution companies and marketers. However, all these technologies are connected to the concept of sustainability. The sentiment analysis showed a generally positive tone, indicating social acceptance regarding the starting phase of the adoption of these technologies. The study also identified differences among countries, pointing to a stronger level of engagement with these technologies in developed regions. Moreover, the COVID-19 pandemic was seen as a chance to boost the digital transformation in the sector all over the world. SIGNIFICANCE Our results demonstrate that data harvested from Twitter provide useful insight into perceptions of digital transformation and different digital technologies in the agri-food value chain across different countries. Information that could be useful for researchers, but also for agricultural firms and policymakers.", "venue": "Social Science Research Network", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": null, "publicationDate": "2022-12-01", "journal": {"name": "SSRN Electronic Journal"}, "authors": [{"authorId": "4732322", "name": "María Ancín"}, {"authorId": "104872645", "name": "E. Pindado"}, {"authorId": "144860918", "name": "Mercedes Sánchez"}], "citations": [{"paperId": "a2e529b6c6e5b0eb708a63d8b99717a8c86f7f37", "title": "Social Life Cycle Assessment of Laser Weed Control System: A Case Study"}, {"paperId": "303f47b696e589e045772164c695a6fd4c8dfe86", "title": "Critical Factors Affecting Trust in the Wine Supply Chain in Greece: A Grey DEMATEL Approach"}, {"paperId": "ae4c3dffbf0cd9c9e989f5365dc22fd3dcb2430e", "title": "Science, technology, agri-food systems, health, and wellbeing: logic, dynamics, and relationships"}, {"paperId": "848bbafa27074d59fe3cc09af483f339824c3155", "title": "Assessing the digital transformation in agri-food cooperatives and its determinants"}, {"paperId": "625a5d5bb87652a433f4003d6d44219d92b71d30", "title": "Factors Influencing the Adoption of Artificial Intelligence Technologies in Agriculture, Livestock Farming and Aquaculture: A Systematic Literature Review Using PRISMA 2020"}, {"paperId": "2655f82366a194f2003803ff4e338f3e8a0003ea", "title": "Proposal for a framework to manage the barriers that hinder the development of agriculture 4.0 in the agricultural production chain"}, {"paperId": "532015d4880d73e0290754e1de0bfd04c8a754bd", "title": "Maximizing ERP Benefits with Enterprise Architecture: A Holistic Approach"}, {"paperId": "9e2979142aa8d0260e03fcb20009d182752f9700", "title": "Recent advances in the use of digital technologies in agri-food processing: a short review"}, {"paperId": "934f42510d85d672e3cea606c47f51bfe7c0dfa4", "title": "Supply Chain in the Digital Age: A Scientometric–Thematic Literature Review"}, {"paperId": "78f5f180473ab81fe4e9ed1dbc19e77bb5526d61", "title": "A digital divide in direct market farmers’ online sales and marketing: Early pandemic evidence from California"}, {"paperId": "e630e56fa19813f94cd830c75527a34a69333cf1", "title": "Is digital transformation a barrier to export reduction during COVID-19? The case of a developing country"}, {"paperId": "028dd72abc8577a958d6fd481022737042e13267", "title": "DIGITAL MARKETING MODEL OF INDOMIE ICE CREAM’S VIRAL MARKETING"}, {"paperId": "28beb11c6a480a7daa003afee51e460c87e36dfa", "title": "Agri-food 4.0: Drivers and links to innovation and eco-innovation"}, {"paperId": "271f825c074e08956587fd65e8df41b0535b310e", "title": "Social media branding in the food industry: comparing B2B and B2C companies’ use of sustainability messaging on Twitter"}, {"paperId": "1366ffe0f2b1582879a72aea2b8eef586f60bbce", "title": "The Role of Digital Transformation in the Relationship between Industrial Policies and Technological Innovation Performance: Evidence from the Listed Wind Power Enterprises in China"}, {"paperId": "020c3cd5ad2a639cc90bb422d43d1d385d1984e7", "title": "Understanding of Convolutional Neural Network (CNN): A Review"}, {"paperId": "1fb1babb77e7c7faf2bdeedb9ba7548d5e41bf84", "title": "Virtualization Development Trends: Scoping Review"}, {"paperId": "dc43f04cd48457f48d5801d489b066016b2d4b9d", "title": "Social Media Analysis using Sentiment Analysis on COVID-19 from Twitter"}, {"paperId": "03d4f66bd3a272e60442a11824089de9ab706739", "title": "Digital Agriculture: Mapping Knowledge Structure and Trends"}, {"paperId": "371a3054b45fa0254c3ecb1a3ce862d52ace0e02", "title": "Agriculture and International Organization in Indonesia: The Twitter Analysis of FAO Indonesia"}, {"paperId": "dcb54356b02c128b3dd1dad2155d4e6b1fee318c", "title": "Land property price dynamics during the COVID-19 pandemic"}]}
