{"paperId": "a106da34faf0f15e1d33622b52bc0816e37edca9", "publicationVenue": {"id": "e29f3ae1-4574-4fd4-9f5b-498495cb7952", "name": "USENIX Workshop on Hot Topics in Operating Systems", "type": "conference", "alternate_names": ["USENIX Workshop Hot Top Oper Syst", "Workshop on Hot Topics in Operating Systems", "HotOS", "Workshop Hot Top Oper Syst"], "url": "http://www.wikicfp.com/cfp/program?id=1213"}, "title": "Unleashing True Utility Computing with Quicksand", "abstract": "Today's clouds are inefficient: their utilization of resources like CPUs, GPUs, memory, and storage is low. This inefficiency occurs because applications consume resources at variable rates and ratios, while clouds offer resources at fixed rates and ratios. This mismatch of offering and consumption styles prevents fully realizing the utility computing vision. We advocate for fungible applications, that is, applications that can distribute, scale, and migrate their consumption of different resources independently while fitting their availability across different servers (e.g., memory at one server, CPU at another). Our goal is to make use of resources even if they are transiently available on a server for only a few milliseconds. We are developing a framework called Quicksand for building such applications and unleashing the utility computing vision. Initial results using Quicksand to implement a DNN training pipeline are promising: Quicksand saturates resources that are imbalanced across machines or rapidly shift in quantity.", "venue": "USENIX Workshop on Hot Topics in Operating Systems", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2023-06-22", "journal": {"name": "Proceedings of the 19th Workshop on Hot Topics in Operating Systems"}, "authors": [{"authorId": "23221554", "name": "Zhenyuan Ruan"}, {"authorId": "2117840880", "name": "Shihang Li"}, {"authorId": "2220400500", "name": "Kaiyan Fan"}, {"authorId": "145903865", "name": "M. Aguilera"}, {"authorId": "6427412", "name": "A. Belay"}, {"authorId": "46570278", "name": "S. Park"}, {"authorId": "1962485", "name": "Malte Schwarzkopf"}], "citations": [{"paperId": "2ec26b3f436c12511cd8deedd3cb0c1f13593a25", "title": "Lovelock: Towards Smart NIC-hosted Clusters"}, {"paperId": "0d63eda389d3a8353850507dd226da0f911581e8", "title": "xOS: The End Of The Process-Thread Duo Reign"}]}
