{"paperId": "a10d0e1977e6c51e6855ca60e0aca0dedf72eeac", "publicationVenue": {"id": "22d1db70-9ab0-44a4-ab3c-72560c6d550d", "name": "Digital Twin", "alternate_names": ["Digit Twin"], "issn": "2752-5783"}, "title": "Digital Twins along the product lifecycle: A systematic literature review of applications in manufacturing", "abstract": "Background: The evolution of product expectations in the era of mass customization implies an improvement and a better control of individualized creation and production processes throughout the product lifecycle. The application of the digital twin (DT) seems to be a favoured solution in this context, but its study during the lifecycle of a product has only been partially evoked in the literature. Methods: The purpose of this state-of-the-art article is to identify current trends of applications of the digital twin concept in the literature under two main dimensions: its nature regarding the interaction structure between digital and physical objects (defined as: Pre-Digital Twin, digital model, digital shadow, and digital twin), but also its applications, along the product lifecycle (Design, Production, Operation, Disposal). To achieve this analysis a systematic literature review was carried out. The publications selection was based on the presence in this of a case of application of a digital twin with a focus in the Manufacturing sector. Within this review, 188 scientific papers were compiled and analyzed. Results: Results showed that although the term digital twin is widely used, the deployment of DT technologies in manufacturing is still at an early stage as most of the digital twin applications were in fact prototypes focused on the real-time observability of the physical system, either for optimization or predictive maintenance. Moreover, regarding the product lifecycle, most of the applications have been focused on the production and operational phases whereas those at the design and disposal phases are still limited. Conclusions: This paper presents an original approach to the study of digital twins, not focusing on a single application area or lifecycle phase but which aims to establish future perspectives on the use of digital twins along the lifecycle.", "venue": "Digital Twin", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2023-03-21", "journal": {"name": "Digital Twin"}, "authors": [{"authorId": "10176527", "name": "G. Pronost"}, {"authorId": "37471739", "name": "Frédérique Mayer"}, {"authorId": "3046442", "name": "M. Camargo"}, {"authorId": "47211378", "name": "L. Dupont"}], "citations": []}
