{"paperId": "a12fffedae7db27b69d67e188f6d398528b0c8c4", "publicationVenue": {"id": "d65e8b4a-f9c2-45ae-9b87-090db7e872f1", "name": "International Conference on Parallel Architectures and Compilation Techniques", "type": "conference", "alternate_names": ["Int Conf Parallel Archit Compil Tech", "PACT", "Parallel Comput Technol", "Parallel Computing Technologies", "Pan African Conference Science, Computing and Telecommunications", "PaCT", "Pan Afr Conf Sci Comput Telecommun"], "url": "http://www.pactconf.org/", "alternate_urls": ["http://ssd.sscc.ru/en/conference"]}, "title": "Atributed consistent hashing for heterogeneous storage systems", "abstract": "Storage systems are critical building blocks of high-end computing systems and data centers. They demand the flexibility to distribute data effectively and provide high I/O performance. The consistent hashing algorithm is widely used in parallel/distributed file systems due to its decentralized design, scalability, and adaptability to node changes. However, it lacks efficiency in a heterogeneous environment where different storage devices, e.g. hard disk drives and solid state drives, co-exist. In this study, we propose an attributed consistent hashing (attributedCH), to overcome this deficiency. AttributedCH manages heterogeneous nodes on a consistent hashing ring and maintains attributes for each node to characterize distinct node features. It divides the hash ring into sectors and selects nodes from the sector with a comprehensive selection strategy. By considering different attributes, attributedCH achieves adaptive and efficient data placement for heterogeneous storage systems. We have carried out extensive evaluations and the evaluation results confirm that the attributedCH overcomes the deficiency of existing consistent hashing algorithms well and is particularly suitable for heterogeneous storage systems.", "venue": "International Conference on Parallel Architectures and Compilation Techniques", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2018-11-01", "journal": {"name": "Proceedings of the 27th International Conference on Parallel Architectures and Compilation Techniques"}, "authors": [{"authorId": "143900917", "name": "Jiang Zhou"}, {"authorId": "47557631", "name": "Yong Chen"}, {"authorId": "2134773275", "name": "Weiping Wang"}], "citations": [{"paperId": "c3cca374ab5114300a77d2e93679e7bad1713279", "title": "Beyond the Ring: Quantized Heterogeneous Consistent Hashing"}, {"paperId": "4db825cb66952f061d968d6977119403561a78cb", "title": "Characterization Research on I/O Improvements Targeting DISC and HPC Applications"}, {"paperId": "02a288e37a79e9c7a9b91f76582a4c7bc963f951", "title": "A Highly Reliable Metadata Service for Large-Scale Distributed File Systems"}, {"paperId": "c3ece8c466a94d88bb4d1355bfbc59f52a75aa44", "title": "Research Characterization on I/O Improvements of Storage Environments"}, {"paperId": "82a0ac5b31eb1d1fd428a99cac10dd9a1ff32288", "title": "RE-Store: Reliable and Efficient KV-Store with Erasure Coding and Replication"}, {"paperId": "fdf487264a94fc014098523252c83ac28311cb14", "title": "An efficient Serverless Architecture to support fine-grained coordination and state sharing for Stateful Applications"}]}
