{"paperId": "a12f0b45d306f50a42844bba0a7b1dbc8d023694", "publicationVenue": null, "title": "A Big Data Analytics System Based on a High Level Query Language Using Apache Spark", "abstract": "Big data analytics is one of the most active research areas today with a lot of challenges, both theoretical and practical. This thesis makes a contribution to the area of big data analytics by implementing the HIFUN language using the Apache Spark framework. HIFUN is a high level query language, proposed for expressing analytic queries over big data sets. This language makes a clear separation between the conceptual and the physical level. An analytic query and its answer are de ned at the conceptual level independently of the nature and location of data. The abstract de nitions are then mapped to lower level evaluation mechanisms, taking into account the nature and location of data, as well as other related aspects. In this thesis, we leverage this language to design and implement a system which allows a user to analyse, visualize and discover information useful for decision making, which is \"hidden\" in large-scale data sets. In the physical level, HIFUN queries are mapped to lower level evaluation mechanisms of the Apache Spark framework following the conceptual evaluation scheme proposed by HIFUN and supporting a big range of data set formats. In the conceptual level, we apply the query rewriting rules and create query execution plans, proposed by HIFUN. Our work shows that the HIFUN formal model is useful in practice and the experimental evaluation of the system proves that the model's approach to query rewriting and to the generation of query execution plans succeeds in reducing the computational costs regardless of the nature of the data.", "venue": "", "year": 2017, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "2105988901", "name": "Vassilis Glampedakis"}, {"authorId": "1705358", "name": "D. Plexousakis"}, {"authorId": "1801959", "name": "Yannis Tzitzikas"}, {"authorId": "1689415", "name": "Antonis A. Argyros"}], "citations": [{"paperId": "fdb7721f87d5eb0ed41aa9f72119340f51dd3ed2", "title": "Incremental Evaluation of Continuous Analytic Queries in a High-Level Query Language"}]}
