{"paperId": "a1393dc40c28f86afe96dcc7531a442507685533", "publicationVenue": null, "title": "Enabling and Emerging Sensing Technologies for Crowd Management in Public Transportation Systems: A Review", "abstract": "Management of crowd information in public transportation (PT) systems is crucial to foster sustainable mobility, by increasing the user’s comfort and satisfaction during normal operation, as well as to cope with emergency situations, such as pandemic crises, as recently experienced with COVID-19 limitations. This paper presents a taxonomy and review of sensing technologies based on Internet of Things (IoT) for real-time crowd analysis, which can be adopted in various segments of the PT system (buses/trams/trains, railway/subway stations, and bus stops). To discuss such technologies in a clear systematic perspective, we introduce a reference architecture for crowd management, which employs modern information and communication technologies (ICT) in order to: (i) monitor and predict crowding events; (ii) adapt in real-time PT system operations, by modifying service frequency, timetables, routes, and so on; (iii) inform in real-time the users of the crowding status of the PT system, by means of electronic displays installed inside vehicles or at bus stops/stations, and/or by mobile transport applications. It is envisioned that the innovative crowd management functionalities enabled by ICT/IoT sensing technologies can be incrementally implemented as an add-on to traditional intelligent transportation system (ITS) platforms, which are already in use by major PT companies operating in urban areas. Moreover, it is argued that, in this new framework, additional services can be delivered, such as, e.g., on-line ticketing, vehicle access control and reservation in severely crowded situations, and evolved crowd-aware route planning.", "venue": "", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review"], "publicationDate": "2021-12-10", "journal": null, "authors": [{"authorId": "1701049", "name": "D. Darsena"}, {"authorId": "1704217", "name": "G. Gelli"}, {"authorId": "9212556", "name": "I. Iudice"}, {"authorId": "145308326", "name": "F. Verde"}], "citations": [{"paperId": "34b3b341829bf1a1d8f94aeecbdd469e74b69f4b", "title": "COVID-19 effects on urban driving, walking, and transit usage trends: Evidence from Indian metropolitan cities"}]}
