{"paperId": "a145acae964f1af6ca0d9d6e16223639e1ec330f", "publicationVenue": {"id": "1b767051-ba1f-457e-bd23-1b483c7029c7", "name": "E3S Web of Conferences", "alternate_names": ["E3S Web Conf"], "issn": "2267-1242", "url": "https://web.archive.org/web/*/http:/www.e3s-conferences.org/", "alternate_urls": ["https://www.e3s-conferences.org/"]}, "title": "The principles of building a machine-learning-based service for converting sequential code into parallel code", "abstract": "This article presents a novel approach for automating the parallelization of programming code using machine learning. The approach centers on a two-phase algorithm, incorporating a training phase and a transformation phase. In the training phase, a neural network is trained using data in the form of Abstract Syntax Trees, with Word2Vec being employed as the primary model for converting the syntax tree into numerical arrays. The choice of Word2Vec is attributed to its efficacy in encoding words with less reliance on context, compared to other natural language processing models such as GloVe and FastText. During the transformation phase, the trained model is applied to new sequential code, transforming it into parallel programming code. The article discusses in detail the mechanisms behind the algorithm, the rationale for the selection of Word2Vec, and the subsequent processing of code data. This methodology introduces an intelligent, automated system capable of understanding and optimizing the syntactic and semantic structures of code for parallel computing environments. The article is relevant for researchers and practitioners seeking to enhance code optimization techniques through the integration of machine learning models.", "venue": "E3S Web of Conferences", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": null, "journal": {"name": "E3S Web of Conferences"}, "authors": [{"authorId": "2258391253", "name": "Ivan Viktorov"}, {"authorId": "2190247894", "name": "R. Gibadullin"}], "citations": [{"paperId": "056bbcb38ec96e5894018bb6d4e5b27e57b84c85", "title": "The principles of building a parallel program for steganographic file protection"}, {"paperId": "79578553a196590cd901f5ef89943af5cb8c466c", "title": "Development of the principles of parallelization of the symmetric AES encryption algorithm"}, {"paperId": "f0e625f1fb870fb0e0a5fab64bca984450cea420", "title": "Enterprise automation using artificial intelligence: Methods, technologies and prospects"}, {"paperId": "1f61c1b1ff8564cdabe63af91ae48c859d742d7a", "title": "Unlocking the potential of artificial intelligence for big data analytics"}, {"paperId": "de69433f46dd3bb326412bbb06576219bd101c20", "title": "Advancing parallel programming integrating artificial intelligence for enhanced efficiency and automation"}, {"paperId": "bd50b7230b583f95a119f1846af5a397f5862251", "title": "Integrating parallelism and asynchrony for high-performance software development"}, {"paperId": "c1042b34fe934a77f56e112fa1586196cc53e47e", "title": "Achieving new SQL query performance levels through parallel execution in SQL Server"}]}
