{"paperId": "a15153445326d51fb23dda8b83f1d124703b23f7", "publicationVenue": {"id": "f2c78b1b-6bcc-4700-859b-af9401c02941", "name": "Buildings", "type": "journal", "issn": "0007-3725", "alternate_issns": ["2075-5309"], "url": "https://www.buildings.com/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217973", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217973", "https://www.mdpi.com/journal/buildings"]}, "title": "Blockchain Design with Optimal Maintenance Planning", "abstract": "Rapid advancement of data management and sharing technology has urged organizations to develop effective maintenance management systems. This research, therefore, proposes and implements an Electronic Repair Records (ERR) system for the blockchain of maintenance planning and management. In ERR, this research develops two optimization models for scheduling and sequencing failure repairs from different types over multiple periods. Each failure repair is treated as a block, for which the data, current hash, and previous hash are obtained from failure repair parameters, resources availability information, and the optimal values of the start and finish times of the assigned failure repairs. The scheduling model assigns failure repairs to technicians and in maintenance shops on each scheduling period at a minimal total cost of delay, undertime, and overtime costs, while the sequencing model sequences the assigned failure repairs at minimal total overtime costs and minimum total repair start times. Once the blocks are confirmed, the blockchain is then shared through an electronic network among all maintenance departments. The developed ERR system was implemented to manage the repairs of 36 failures from different failures in six maintenance shops over a period of three days. The results showed that this system is found to be effective in managing optimal repairs and efficient in improving the utilization of available resources in maintenance shops. These advantages may result in significant savings in maintenance costs and better utilization of resources. In conclusion, the developed ERR system including the optimization models can provide in real-time assistance and de-centralized technology to planning engineers when managing maintenance activities over multiple periods in a wide range of business applications.", "venue": "Buildings", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-11-06", "journal": {"name": "Buildings"}, "authors": [{"authorId": "1399207229", "name": "A. Al-Refaie"}, {"authorId": "2042179712", "name": "Ahmad Al-Hawadi"}, {"authorId": "3124500", "name": "N. Lepkova"}], "citations": [{"paperId": "edf2e5048aeb6b2bdde0bef95857f61ec3e72f4e", "title": "A Proposed eFSR Blockchain System for Optimal Planning of Facility Services with Probabilistic Arrivals and Stochastic Service Durations"}]}
