{"paperId": "a159feab9558f80c27437512adac6c8211b4a590", "publicationVenue": {"id": "b765562b-b2f8-4514-a80c-e7e5521c3c1b", "name": "Stats", "issn": "2571-905X", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-1343736", "alternate_urls": ["https://www.mdpi.com/journal/stats", "https://nbn-resolving.org/urn/resolver.pl?urn=urn:nbn:ch:bel-1343736"]}, "title": "Detecting Regional Differences in Italian Health Services during Five COVID-19 Waves", "abstract": "During the waves of the COVID-19 pandemic, both national and/or territorial healthcare systems have been severely stressed in many countries. The availability (and complexity) of data requires proper comparisons for understanding differences in the performance of health services. With this aim, we propose a methodological approach to compare the performance of the Italian healthcare system at the territorial level, i.e., considering NUTS 2 regions. Our approach consists of three steps: the choice of a distance measure between available time series, the application of weighted multidimensional scaling (wMDS) based on this distance, and, finally, a cluster analysis on the MDS coordinates. We separately consider daily time series regarding the deceased, intensive care units, and ordinary hospitalizations of patients affected by COVID-19. The proposed procedure identifies four clusters apart from two outlier regions. Changes between the waves at a regional level emerge from the main results, allowing the pressure on territorial health services to be mapped between 2020 and 2022.", "venue": "Stats", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-04-15", "journal": {"name": "Stats"}, "authors": [{"authorId": "2005442282", "name": "Lucio Palazzo"}, {"authorId": "2096863473", "name": "Riccardo Ievoli"}], "citations": [{"paperId": "14e82b38461ea7ced060ea0e71eb12436e48af6c", "title": "Setting up and managing the largest COVID-19 mass vaccination center in Lombardy, Italy"}]}
