{"paperId": "a16ead70bbaf526f501e1495b19dbb547a5e9849", "publicationVenue": {"id": "40436a7b-37ac-46bc-8910-5875b95823bc", "name": "Systematic and Applied Acarology", "type": "journal", "alternate_names": ["Syst Appl Acarol", "Systematic & Applied Acarology", "Syst  Appl Acarol"], "issn": "1362-1971", "url": "https://www.bioone.org/journals/systematic-and-applied-acarology/issues", "alternate_urls": ["https://www.nhm.ac.uk/hosted_sites/acarology/saas/saa.html", "http://www.nhm.ac.uk/hosted_sites/acarology/saas/saa.html"]}, "title": "Abundance of ectoparasitic ticks and mites (Acari: Ixodida, Mesostigmata, Trombidiformes) on rodents in the Alamedin Gorge of Kyrgyz Range, Kyrgyzstan", "abstract": "Abstract The Alamedin Gorge is one of the famous resorts in Kyrgyzstan. There are more than 150 thousand vacationers and tourists visiting this gorge each year, and the visitors could be potential hosts for ectoparasites. Thus, the risk of epidemic diseases caused by ectoparasites could not be ignored. To monitor the abundance of parasitic arthropods and their hosts is very important for early warning and controlling the epidemic disease accurately. In this paper, rodents were captured with traps and ectoparasitic acarines were separated from them in the Alamedin Gorge in different seasons from 2019 to 2020. It showed that there were 33 species in 15 genera representing six families of ticks, gamasid mites and chigger mites parasitizing on five species of rodents. Neotrombicula (Neotrombicula) kharadovi, N. (N.) monticola and Ixodes crenulatus are dominant species. The species diversity of host rodent and parasitic acarines, the seasonal dynamic of communities of acarines, the distribution of acarines in different biotopes and elevation gradients were analysed. It is helpful for assessing the risk of the epidemic disease, and establish effective preventive measures by sanitary and epidemiological services in this area.", "venue": "Systematic and Applied Acarology", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-04-26", "journal": {"name": "Systematic and Applied Acarology", "pages": "1120 - 1131", "volume": "27"}, "authors": [{"authorId": "2166568306", "name": "Burulsun Akyshova"}, {"authorId": "2143408272", "name": "Yanna Chen"}, {"authorId": "2153417989", "name": "Jun Chen"}], "citations": [{"paperId": "c4c79635d1113485eafa110db7700c16b904a51d", "title": "First Molecular Evidence of Babesia vogeli, Babesia vulpes, and Theileria ovis in Dogs from Kyrgyzstan"}]}
