{"paperId": "a172591d42f536ecdeaae05ffd5c2f128970da5c", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Federated Learning Approach to Protect Healthcare Data over Big Data Scenario", "abstract": "The benefits and drawbacks of various technologies, as well as the scope of their application, are thoroughly discussed. The use of anonymity technology and differential privacy in data collection can aid in the prevention of attacks based on background knowledge gleaned from data integration and fusion. The majority of medical big data are stored on a cloud computing platform during the storage stage. To ensure the confidentiality and integrity of the information stored, encryption and auditing procedures are frequently used. Access control mechanisms are mostly used during the data sharing stage to regulate the objects that have access to the data. The privacy protection of medical and health big data is carried out under the supervision of machine learning during the data analysis stage. Finally, acceptable ideas are put forward from the management level as a result of the general privacy protection concerns that exist throughout the life cycle of medical big data throughout the industry.", "venue": "Sustainability", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-02-22", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "2145580165", "name": "G. Dhiman"}, {"authorId": null, "name": "Sapna Juneja"}, {"authorId": "143718224", "name": "H. Mohafez"}, {"authorId": "82522332", "name": "Ibrahim El-Bayoumy"}, {"authorId": "2156183099", "name": "Lokesh Sharma"}, {"authorId": "48912089", "name": "M. Hadizadeh"}, {"authorId": "2152536437", "name": "M. A. Islam"}, {"authorId": "2985029", "name": "W. Viriyasitavat"}, {"authorId": "49325478", "name": "Mayeen Uddin Khandaker"}], "citations": [{"paperId": "92072c56a4be28d89dcf271df8333a6e5f342717", "title": "A federated learning system with data fusion for healthcare using multi-party computation and additive secret sharing"}, {"paperId": "b50515dfb4d3474845e23e25c9e62e7ca1b3e8fb", "title": "FLIBD: A Federated Learning-Based IoT Big Data Management Approach for Privacy-Preserving over Apache Spark with FATE"}, {"paperId": "d93f825728cd7fd0d3e4fc61bff6cfd0e68793f4", "title": "A Systematic Review of Literature on Sustaining Decision-Making in Healthcare Organizations Amid Imperfect Information in the Big Data Era"}, {"paperId": "b6b60e778b7506b943e5ef9492fa0745148b12d4", "title": "Analisis Efektivitas Penggunaan Teknologi Big Data dalam Proses Audit: Studi Kasus pada Kantor Akuntan Publik di Indonesia"}, {"paperId": "2f569467989b94d0ba8d9d8a0f612f1e7f1d8463", "title": "Optimizing Network Classification Performance by Geometric Transformations on Delayed Enhancement Cardiac Magnetic Resonance Imaging"}, {"paperId": "e377192c8e7bd70e6ce435ababc23642d4d6d83b", "title": "A Comprehensive Survey on Privacy-Preserving Techniques in Federated Recommendation Systems"}, {"paperId": "052fedbfc3d21f3ce7323984b98acc083eafd62a", "title": "Securing and Visualizing Sensor Data on Private Blockchain"}, {"paperId": "92bf3b325d8ccb0b5223d7637ded11e560e9d448", "title": "Classification of skin cancer stages using a AHP fuzzy technique within the context of big data healthcare"}, {"paperId": "76ffcfed599a7052355eb378cf7e608e0af600e9", "title": "EHR privacy preservation using federated learning with DQRE-Scnet for healthcare application domains"}, {"paperId": "f1ac75d96c85121f4e0e52ff8c001ac7f3173f8b", "title": "Federated learning for secure IoMT-applications in smart healthcare systems: A comprehensive review"}, {"paperId": "d135ec27b06266dcc013431a7778fc37e5e79f70", "title": "Privacy-Enhancing Technologies in Federated Learning for the Internet of Healthcare Things: A Survey"}, {"paperId": "ff0b437753cdda254ce975b3175f3ffa844b64fb", "title": "Collecting, Processing and Secondary Using Personal and (Pseudo)Anonymized Data in Smart Cities"}, {"paperId": "dca2daea5f29daaa1983bd71b0acf526a66e116b", "title": "Environment Quality Assessment Web Application"}, {"paperId": "1cf647eee41cd65c2fe0d8861b798d0f4f4c1f37", "title": "Load balancing and service discovery using Docker Swarm for microservice based big data applications"}, {"paperId": "58802db038f1f3d2bf00908d139f5de56f319d59", "title": "Automated detection of cybersecurity attacks in healthcare systems with recursive feature elimination and multilayer perceptron optimization"}, {"paperId": "8446459c2948620a3f45b5dcae14841c4cb80798", "title": "Efficient Personalized Recommendation Based on Federated Learning with Similarity Ciphertext Calculation"}, {"paperId": "08d25ad98af24ea7f1f350e86916367c30b5fe32", "title": "Security of federated learning for cloud‐edge intelligence collaborative computing"}, {"paperId": "ab5484705ae96bd62805a87655d909a66e222ae1", "title": "An Enhanced Dynamic Nonlinear Polynomial Integrity-Based QHCP-ABE Framework for Big Data Privacy and Security"}, {"paperId": "ec3cd74e236c26932133ad13a2dc3d0d41e287a0", "title": "Privacy protection against attack scenario of federated learning using internet of things"}, {"paperId": "1c991db722989abd79686bbe358bc15481d5bade", "title": "Performance and Information Leakage in Splitfed Learning and Multi-Head Split Learning in Healthcare Data and Beyond"}, {"paperId": "7e4b366fa674f86e130b3f1adcd61e0e6ad06ff7", "title": "IoT-Based Technological Framework for Inhibiting the Spread of COVID-19: A Pandemic Using Machine Learning and Fuzzy-Based Processes"}, {"paperId": "ab807f7595b79e6d3b825ccb95975c1a0fc82df5", "title": "Influential Incremental Learning-Based Privacy Preservation for Social Network Information"}, {"paperId": "3bb55228e91a8d9788bd10ab34081812a2a88440", "title": "Trusted routing protocol for federated UAV ad hoc network"}, {"paperId": "7ab69d7c8a26f42b43d88e7a241a77ae2000fd74", "title": "Providing an Improved Resource Management Approach for Healthcare Big Data Processing in Cloud Computing Environment"}, {"paperId": "b28ba66261ddfda6ef10a016d4abb1100af773c3", "title": "Leveraging Big Data Analytics for Enhanced Clinical Decision-Making in Healthcare"}, {"paperId": "93cfac14e5242cfa4d5cb42efd53d36afbdb24e1", "title": "HYBRID PERSONALIZED RECOMMENDATION MODEL FOCUS ON IMPROVED COLLABORATIVE FILTERING"}]}
