{"paperId": "a17aadf1f3af6a3790c2ad091db814440a77940c", "publicationVenue": {"id": "42ba2c5a-a60c-4306-988d-ff0928f95afa", "name": "International Conference on Generative Programming: Concepts and Experiences", "type": "conference", "alternate_names": ["Generative Programming and Component Engineering", "Gener Program Compon Eng", "GPCE", "Int Conf Gener Program Concept Exp"], "url": "https://dl.acm.org/conference/gpce"}, "title": "Multi-Stage Vertex-Centric Programming for Agent-Based Simulations", "abstract": "In vertex-centric programming, users express a graph algorithm as a vertex program and specify the iterative behavior of a vertex in a compute function, which is executed by all vertices in a graph in parallel, synchronously in a sequence of supersteps. While this programming model is straightforward for simple algorithms where vertices behave the same in each superstep, for complex vertex programs where vertices have different behavior across supersteps, a vertex needs to frequently dispatch on the value of supersteps in compute, which suffers from unnecessary interpretation overhead and complicates the control flow. We address this using meta-programming: instead of branching on the value of a superstep, users separate instructions that should be executed in different supersteps via a staging-time wait() instruction. When a superstep starts, computations in a vertex program resume from the last execution point, and continue executing until the next wait(). We implement this in the programming model of an agent-based simulation framework CloudCity and show that avoiding the interpretation overhead caused by dispatching on the value of a superstep can improve the performance by up to 25% and lead to more robust performance.", "venue": "International Conference on Generative Programming: Concepts and Experiences", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2023-10-22", "journal": {"name": "Proceedings of the 22nd ACM SIGPLAN International Conference on Generative Programming: Concepts and Experiences"}, "authors": [{"authorId": "2069521408", "name": "Zilu Tian"}], "citations": []}
