{"paperId": "a18444925fade9cfaf9b28fb49c26d36f0933113", "publicationVenue": {"id": "4fed2ae2-bd9d-4eec-aa27-42b54fae81d4", "name": "International Journal of Information Technologies and Systems Approach", "type": "journal", "alternate_names": ["Int J Inf Technol Syst Approach"], "issn": "1935-570X", "url": "http://www.idea-group.com/", "alternate_urls": ["https://www.igi-global.com/journal/international-journal-information-technologies-systems/1098"]}, "title": "A Hierarchical Hadoop Framework to Handle Big Data in Geo-Distributed Computing Environments", "abstract": "Advances in the communication technologies, along with the birth of new communication paradigms leveraging on the power of the social, has fostered the production of huge amounts of data. Old-fashioned computing paradigms are unfit to handle the dimensions of the data daily produced by the countless, worldwide distributed sources of information. So far, the MapReduce has been able to keep the promise of speeding up the computation over Big Data within a cluster. This article focuses on scenarios of worldwide distributed Big Data. While stigmatizing the poor performance of the Hadoop framework when deployed in such scenarios, it proposes the definition of a Hierarchical Hadoop Framework (H2F) to cope with the issues arising when Big Data are scattered over geographically distant data centers. The article highlights the novelty introduced by the H2F with respect to other hierarchical approaches. Tests run on a software prototype are also reported to show the increase of performance that H2F is able to achieve in geographical scenarios over a plain Hadoop approach.", "venue": "International Journal of Information Technologies and Systems Approach", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "Int. J. Inf. Technol. Syst. Approach", "pages": "16-47", "volume": "11"}, "authors": [{"authorId": "1725309", "name": "O. Tomarchio"}, {"authorId": "144998586", "name": "G. Modica"}, {"authorId": "2065392598", "name": "Marco Cavallo"}, {"authorId": "38239174", "name": "Carmelo Polito"}], "citations": [{"paperId": "27ff0b7fd59a38c35e5f062007c4825b3008fa14", "title": "Cluster load based content distribution and speculative execution for geographically distributed cloud environment"}, {"paperId": "0d288ca565ea3daaa2c79ed16844ae628d91088a", "title": "MapReduce Join Across Geo-Distributed Data Centers"}, {"paperId": "8eb3a3b68f5a34f5bed11de06508b44f671ca98b", "title": "On the Cost of the Management of user Applications in a Multicloud Environment"}]}
