{"paperId": "a19c6fbfb1ea9746224b2e9ca89da72829943b68", "publicationVenue": null, "title": "Examining the impact of students’ attendance, sketching, visualization, and tutors experience on students’ performance: a case of building structures course in construction management", "abstract": "The aim of this paper is to examine students’ performance in a computation-based course by evaluating the effects of key factors including sketching, visualization resources provided to them during the lectures, their attendance and tutors’ experience. A systematic review was conducted including 192 articles published during January 2010 to December 2019. Further, a case study has been conducted in which 633 students from non-engineering backgrounds were taught a core course of construction over three-yearly sessions from 2017 to 2019. The performance has been assessed through two quizzes of 10% weight each, assignment of 40% weight and a final exam with 30% weight in 2017-18 and 40% weight in 2019 were utilized with an attendance criterion of below 75% as low attendance. The statistical result highlights that a clear difference of 14% overall marks exist between the students with less than 75% attendance and the ones with 75% and above in 2017 and a 10% gap in 2018. Students with high marks in sketching secured higher overall marks as compared to others highlighting that the sketching skill is useful to construction students. The findings contribute to the body of education knowledge by evaluating key influential factors and provide a useful benchmark to other educators in the field.", "venue": "", "year": 2020, "fieldsOfStudy": ["Psychology"], "publicationTypes": ["Review"], "publicationDate": "2020-09-03", "journal": {"name": "Australasian Journal of Construction Economics and Building", "volume": "20"}, "authors": [{"authorId": "2064382638", "name": "F. Ullah"}, {"authorId": "2003532406", "name": "Samad Sepasgozer"}, {"authorId": "97981825", "name": "F. Tahmasebinia"}, {"authorId": "2126498156", "name": "Saleh Mohammad Ebrahimzadeh Sepasgozar"}, {"authorId": "50705116", "name": "Steven Davis"}], "citations": [{"paperId": "bd99b5b8c71c5ab7d4dffd86431ed7f63d8771e8", "title": "Field Trips and Their Effect on Student Learning: A Comparison of Knowledge Assessment for Physical versus Virtual Field Trips in a Construction Management Course"}, {"paperId": "95fb2250d7aa23284b0cb3a6b8a50fdf3df6fcd7", "title": "Improving quantity surveying education through continually updating curriculum digitalisation to meet industry requirements"}, {"paperId": "03ef6825e12e3031e439d717751fbcafd09d8e28", "title": "Drivers of, and Barriers to, the Adoption of Mixed Reality in the Construction Industry of Developing Countries"}, {"paperId": "efccd5667fb9b3efcb486fc43d8baa388523f972", "title": "Revisão Sistemática da Literatura sobre Modelos de Visualizações Utilizados para Analisar Fenômenos Educacionais em Plataformas de LMS"}, {"paperId": "66619375a03bb9751dc86e2ec2654de67e2a0b7c", "title": "Automatic Target Detection from Satellite Imagery Using Machine Learning"}, {"paperId": "bf6b994a579b1a8b74dfd6d5ba3dc5888fd86188", "title": "Using Adaptive Sensors for Optimised Target Coverage in Wireless Sensor Networks"}, {"paperId": "c5a7552d525641b5698ed643e5493880dea13bfe", "title": "Managing smart cities through six sigma DMADICV method: A review-based conceptual framework"}, {"paperId": "8cdaa9ae87217adf849e95be18f2422024b51724", "title": "A Beginner’s Guide to Developing Review-Based Conceptual Frameworks in the Built Environment"}, {"paperId": "a04ef2ce8f27abb416cdcc65408ee59409deb1f9", "title": "BIMp-Chart—A Global Decision Support System for Measuring BIM Implementation Level in Construction Organizations"}, {"paperId": "8e0ffe5eb0b3ee55f5600e5d10900d335772220e", "title": "Blended pedagogical model for effective teaching of building measurement and estimating"}, {"paperId": "dc6c200711f7a0667d1dfd67cfa4199b9445ab03", "title": "UAVs in Disaster Management: Application of Integrated Aerial Imagery and Convolutional Neural Network for Flood Detection"}, {"paperId": "03d12d332eb793d032bca60c5dc702281d41115f", "title": "Risk management in sustainable smart cities governance: A TOE framework"}, {"paperId": "b045bed810823b2667c8325e015fb1bb6b1a459f", "title": "A conceptual framework for blockchain smart contract adoption to manage real estate deals in smart cities"}, {"paperId": "542083b37bbd4b89b6c8ec0d4e2e2735f76a99e0", "title": "Artificial Intelligence developments in medical education: a conceptual and practical framework"}, {"paperId": "9e57b80f98427da7a52c73f5ed97912711278014", "title": "Training New Professionals in Service Engineering: Towards a Transdisciplinary Curriculum for Sustainable Businesses"}, {"paperId": "09b17532657eeda785b0da1dbc5fded6ab31f859", "title": "Addressing disasters in smart cities through UAVs path planning and 5G communications: A systematic review"}]}
