{"paperId": "a1a852f90d90c3c84309a8bd048465cf31ea7fc8", "publicationVenue": null, "title": "Enabling Cyber-Physical Communication in 5G Cellular Networks: Challenges, Solutions and Applications", "abstract": "Cyber-physical systems (CPS) are expected to revolutionize the world through a myriad of applications in health-care, disaster event applications, environmental management, vehicular networks, industrial automation, and so on. The continuous explosive increase in wireless data traffic, driven by the global rise of smartphones, tablets, video streaming, and online social networking applications along with the anticipated wide massive sensors deployments, will create a set of challenges to network providers, especially that future fifth generation (5G) cellular networks will help facilitate the enabling of CPS communications over current network infrastructure. In this dissertation, we first provide an overview of CPS taxonomy along with its challenges from energy efficiency, security, and reliability. Then we present different tractable analytical solutions through different 5G technologies, such as device-todevice (D2D) communications, cell shrinking and offloading, in order to enable CPS traffic over cellular networks. These technologies also provide CPS with several benefits such as ubiquitous coverage, global connectivity, reliability and security. By tuning specific network parameters, the proposed solutions allow the achievement of balance and fairness in spectral efficiency and minimum achievable throughout among cellular users and CPS devices. To conclude, we present a CPS mobile-health application as a case study where security of the medical health cyber-physical space is discussed in details.", "venue": "", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2017-08-31", "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "3079694", "name": "R. Atat"}], "citations": [{"paperId": "8ac23b61c94890a1c2223787e3619409387d0848", "title": "SoK: Context and Risk Aware Access Control for Zero Trust Systems"}, {"paperId": "e311eab55d98e0624e39872b91aa17a065e65822", "title": "Big Data Meet Cyber-Physical Systems: A Panoramic Survey"}]}
