{"paperId": "a1bdaad21a43e1d323085704e3be7003fb991c9f", "publicationVenue": null, "title": "Energy Management of Data Centers Powered by Fuel Cells and Heterogeneous Energy Storage", "abstract": "Fuel cells are promising power sources for green data centers thanks to its high energy-efficiency, low greenhouse gas emissions and high reliability. However, fuel cells have a unique feature called limited load following, i.e., they are slow in adjusting power supply due to mechanical limitation of fuel delivery. When power demand of data centers suddenly grows, fuel cells would fail to provide sufficient power supply. On the other hand, fuel cells are slow to reduce its power supply when demand decreases, leading to energy waste. In this paper, we study to mitigate the impact of limited load following by associating a set of heterogeneous batteries with fuel cells. These batteries with different characteristics (e.g., capacity, charging and discharging rate) can power data centers when the energy supply of fuel cells is insufficient. They are charged by excessive power supply when demand decreases. Given future power demand, we formulate the energy management problem as a mixed-integer nonlinear programming. An online algorithm is designed to solve the problem without future knowledge. We conduct extensive simulations using real-world traces and results show that our proposed algorithm significantly outperforms existing solutions.", "venue": "2018 IEEE International Conference on Communications (ICC)", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2018-05-20", "journal": {"name": "2018 IEEE International Conference on Communications (ICC)", "pages": "1-6"}, "authors": [{"authorId": "50049890", "name": "Xiaoxuan Hu"}, {"authorId": "143667002", "name": "Peng Li"}, {"authorId": "28014924", "name": "Kun Wang"}, {"authorId": "1759469", "name": "Yanfei Sun"}, {"authorId": "2288376751", "name": "Deze Zeng"}, {"authorId": "144123438", "name": "Song Guo"}], "citations": [{"paperId": "a491be3b71a67ae3b6a7f4fb0470e4322a07b43f", "title": "A Deep Reinforcement Learning-Based Power Resource Management for Fuel Cell Powered Data Centers"}, {"paperId": "a29048c29a5824d21518653118da012c4a2ed90f", "title": "Review of Fuel Cell Technologies and Applications for Sustainable Microgrid Systems"}, {"paperId": "754fc4c7117906fe8d86414e69f663503938ec8d", "title": "An adaptive heuristic for managing energy consumption and overloaded hosts in a cloud data center"}]}
