{"paperId": "a1bd5624fffffe2eba78964fb3f04a11e002f683", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Analyzing and Evaluating Critical Challenges and Practices for Software Vendor Organizations to Secure Big Data on Cloud Computing: An AHP-Based Systematic Approach", "abstract": "Recently, its becomes easy to track down the data due to its availability in a large number. Although for data management, processing, and obtainability, cloud computing is considered a well-known approach for organizational development on the internet. Despite many advantages, cloud computing has still numerous security challenges that can affect the big-data usage on cloud computing. To find the security issues/challenges that are faced by software vendors’ organizations we conducted a systematic literature review (SLR) through which we have find out 103 relevant research publications by developing a search string that is inspired by the research questions. This relevant data was comprised from different databases e.g. Google Scholar, IEEE Explore, ScienceDirect, ACM Digital Library, and SpringerLink. Furthermore, for the detailed literature review, we have accomplished all the steps in SLR, for example, development of SLR protocol, Initials and final assortment of the relevant data, data extraction, data quality assessment, and data synthesis. We identified fifteen (15) critical security challenges which are: data secrecy, geographical data location, unauthorized data access, lack of control, lack of data management, network-level issues, data integrity, data recovery, lack of trust, data sharing, data availability, asset issues, legal amenabilities, lack of quality, and lack of consistency. Furthermore, sixty four (64) standard practices are identified for these critical security challenges using the proposed SLR that could help vendor organizations to overcome the security challenges for big data. The findings of our research study demonstrate the resemblances and divergences in the identified security challenges in different periods, continents, databases, and methods. The proposed SLR will also support software vendor organizations for securing big data on the cloud computing platforms. This paper has the following content: in Section II, we have describe the Literature review; in Section III, research methodology is specified; in Section IV, the findings of the SLR and the analysis of result are discussed; in Section V, the limitations of this research are given; in Section VI, we discussed our conclusions and future work.", "venue": "IEEE Access", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "107309-107332", "volume": "9"}, "authors": [{"authorId": "2125473601", "name": "Abudul Wahid Khan"}, {"authorId": "2151672087", "name": "Maseeh Ullah Khan"}, {"authorId": "2054423136", "name": "J. Khan"}, {"authorId": "2027023451", "name": "A. Ahmad"}, {"authorId": "2139262800", "name": "Khalil Khan"}, {"authorId": "2076105783", "name": "Muhammad Zamir"}, {"authorId": "2152204134", "name": "Wonjoon Kim"}, {"authorId": "48761825", "name": "M. Ijaz"}], "citations": [{"paperId": "249f92f2b2f1fb1d84cd3528aa6ea1c1a88e4a06", "title": "Prediksi Jumlah Penerimaan Mahasiswa Baru Dengan Metode Linear Regression dan Exponential Smoothing"}, {"paperId": "7fb8d533e038ce481dc763082b2b7e653f8bc5fa", "title": "A Survey on Sharing Cloud Data Securely with Encrypted Indexing and User Identity Verification"}, {"paperId": "d561e5fc2ee3b1899309fc6115941a292081b616", "title": "Live Migration of Containers in the Edge"}, {"paperId": "40baacde1d6147d76bdd618c2d2cff789ab3f722", "title": "Multilayer extreme learning machine: a systematic review"}, {"paperId": "c0637700cbc489affca23f6f843ce0d1eb964900", "title": "Enhancing vehicle re-identification via synthetic training datasets and re-ranking based on video-clips information"}, {"paperId": "933e09c867524f3ebf889a193c846a50e000b7ca", "title": "A 5G-Based Big Data Security Access Processing Method and Device"}, {"paperId": "cf727d38be8f71758c4a4de0333bfea2c42569ba", "title": "An efficient centralized DDoS attack detection approach for Software Defined Internet of Things"}, {"paperId": "90f6ecfe7d37d966fcf48fc35deb58322f27c623", "title": "Cloud Computing Network Empowered by Modern Topological Invariants"}, {"paperId": "6a1b230db855691d12b060ff4cb309442665352a", "title": "AHP-Based Systematic Approach to Analyzing and Evaluating Critical Success Factors and Practices for Component-Based Outsourcing Software Development"}, {"paperId": "cb603f2bf92774967443602ee8f95e484103fab7", "title": "A hybrid active contour image segmentation model with robust to initial contour position"}, {"paperId": "eab3cb20dbb1c72ea1715d2e0ef222f9d6a41255", "title": "Adaptive parallel applications: from shared memory architectures to fog computing (2002–2022)"}, {"paperId": "a8d392b93fc10001833bad02dd42d4ffdfaaffdd", "title": "MSPB: intelligent SAR despeckling using wavelet thresholding and bilateral filter for big visual radar data restoration and provisioning quality of experience in real-time remote sensing"}, {"paperId": "e5d47a3989459babee823674a104804f9d3e52fa", "title": "Set pair three-way overlapping community discovery algorithm for weighted social internet of things"}, {"paperId": "5ba46bd7084dfd41ce4f34deffd414e2e74cb973", "title": "Secure framework against cyber attacks on cyber-physical robotic systems"}, {"paperId": "f9a9e2ff1221ab0e7292df26b0c955475a0366a2", "title": "A quorum-based data consistency approach for non-relational database"}, {"paperId": "4ec87cf39cce89adf39219a49e93df3c756af56f", "title": "Improving wireless indoor non-intrusive load disaggregation using attention-based deep learning networks"}, {"paperId": "8275fc29ef578729529b0ae0bd361db2e67d356e", "title": "KGGCN: Knowledge-Guided Graph Convolutional Networks for Distantly Supervised Relation Extraction"}, {"paperId": "f60714034fc4d174f6b84893369722135bdd6fe9", "title": "Reliability of Hijacked Journal Detection Based on Scientometrics, Altmetric Tools and Web Informatics: A Case Report Using Google Scholar, Web of Science and Scopus"}, {"paperId": "828af36a1593b2f6ad0d7e965f1f5b6b2432f422", "title": "Big data for the comprehensive data analysis of IT organizations"}, {"paperId": "664471eb8ae5eecce09d4d72f5aad00b1d924e90", "title": "The Security Challenges in Healthcare Cloud Computing"}, {"paperId": "49a44858d657da860c20deaf650774a08d232af3", "title": "An Efﬁcient and Secure Big Data Storage in Cloud Environment by Using Triple Data Encryption Standard"}]}
