{"paperId": "a1c6bcc0bc42e30a9e2f3f081cb04ca86d923a9e", "publicationVenue": {"id": "8c36c300-10f5-4008-ae53-6371fcc3030d", "name": "International Conferences on Information Science and System", "type": "conference", "alternate_names": ["ICISS", "International Conference on Information Systems Security", "Int Conf Inf Syst Secur", "Int Conf Intell Sustain Syst", "International Conference Intelligent Sustainable Systems", "Int Conf Inf Sci Syst"], "url": "http://www.wikicfp.com/cfp/program?id=1400"}, "title": "Propositional Aspect between Apache Spark and Hadoop Map-Reduce for Stock Market Data", "abstract": "Big data analytics is becoming tremendously popular in every field today. Everyday lots of data are being generated and analyzed using big data analytics tools and technique. Here the technology used is apache spark and language used is Scala. So, in this paper study is being done on the behalf of research done in stock market data using apache spark technique. Here the nifty-50 data is taken to analyze the impact due to covid-19. As it is being seen that Covid-19 has affected almost everything around the globe, so the purpose is to analyze its effect on stock market. Thereafter comparison is done between the techniques used to analyze that massive volume of stock exchange data. Here the comparative analysis between Hadoop maps-reduce and apache spark on the behalf of some important parameter is being done. That concludes which technique is better for the analysis of the stock exchange data.", "venue": "International Conferences on Information Science and System", "year": 2020, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Conference"], "publicationDate": "2020-12-03", "journal": {"name": "2020 3rd International Conference on Intelligent Sustainable Systems (ICISS)", "pages": "479-483"}, "authors": [{"authorId": "50638186", "name": "Y. Gupta"}, {"authorId": "2047260212", "name": "Nidhi R. Sharma"}], "citations": [{"paperId": "5f1a85f3a1f039e677d3b34a343972c6a0ee3c9d", "title": "Stock Market Prediction Based On Political Impact Using Zasl-Ecc And Tlsaaf-Bilstm"}, {"paperId": "30d77109d1fdb2975db61e3265c8ecf315e7fadd", "title": "An Aggregator Framework for Transforming Big Data in Real-Time using PT-INDRNN"}]}
