{"paperId": "a1d490ad8f2bb86d723a0e6ce68556c6b8e8b1a5", "publicationVenue": {"id": "3b9c2af9-8503-4d14-a0de-af5ba0143ed2", "name": "PLoS Medicine", "type": "journal", "alternate_names": ["Plo Med", "PLOS Medicine", "PLO Med"], "issn": "1549-1277", "url": "https://journals.plos.org/plosmedicine/", "alternate_urls": ["http://www.plosmedicine.org/"]}, "title": "Association between primary or booster COVID-19 mRNA vaccination and Omicron lineage BA.1 SARS-CoV-2 infection in people with a prior SARS-CoV-2 infection: A test-negative case–control analysis", "abstract": "Background The benefit of primary and booster vaccination in people who experienced a prior Severe Acute Respiratory Syndrome Coronavirus 2 (SARS-CoV-2) infection remains unclear. The objective of this study was to estimate the effectiveness of primary (two-dose series) and booster (third dose) mRNA vaccination against Omicron (lineage BA.1) infection among people with a prior documented infection. Methods and findings We conducted a test-negative case–control study of reverse transcription PCRs (RT-PCRs) analyzed with the TaqPath (Thermo Fisher Scientific) assay and recorded in the Yale New Haven Health system from November 1, 2021, to April 30, 2022. Overall, 11,307 cases (positive TaqPath analyzed RT-PCRs with S-gene target failure [SGTF]) and 130,041 controls (negative TaqPath analyzed RT-PCRs) were included (median age: cases: 35 years, controls: 39 years). Among cases and controls, 5.9% and 8.1% had a documented prior infection (positive SARS-CoV-2 test record ≥90 days prior to the included test), respectively. We estimated the effectiveness of primary and booster vaccination relative to SGTF-defined Omicron (lineage BA.1) variant infection using a logistic regression adjusted for date of test, age, sex, race/ethnicity, insurance, comorbidities, social venerability index, municipality, and healthcare utilization. The effectiveness of primary vaccination 14 to 149 days after the second dose was 41.0% (95% confidence interval (CI): 14.1% to 59.4%, p 0.006) and 27.1% (95% CI: 18.7% to 34.6%, p < 0.001) for people with and without a documented prior infection, respectively. The effectiveness of booster vaccination (≥14 days after booster dose) was 47.1% (95% CI: 22.4% to 63.9%, p 0.001) and 54.1% (95% CI: 49.2% to 58.4%, p < 0.001) in people with and without a documented prior infection, respectively. To test whether booster vaccination reduced the risk of infection beyond that of the primary series, we compared the odds of infection among boosted (≥14 days after booster dose) and booster-eligible people (≥150 days after second dose). The odds ratio (OR) comparing boosted and booster-eligible people with a documented prior infection was 0.79 (95% CI: 0.54 to 1.16, p 0.222), whereas the OR comparing boosted and booster-eligible people without a documented prior infection was 0.54 (95% CI: 0.49 to 0.59, p < 0.001). This study’s limitations include the risk of residual confounding, the use of data from a single system, and the reliance on TaqPath analyzed RT-PCR results. Conclusions In this study, we observed that primary vaccination provided significant but limited protection against Omicron (lineage BA.1) infection among people with and without a documented prior infection. While booster vaccination was associated with additional protection against Omicron BA.1 infection in people without a documented prior infection, it was not found to be associated with additional protection among people with a documented prior infection. These findings support primary vaccination in people regardless of documented prior infection status but suggest that infection history may impact the relative benefit of booster doses.", "venue": "PLoS Medicine", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-12-01", "journal": {"name": "PLOS Medicine", "volume": "19"}, "authors": [{"authorId": "48452285", "name": "M. Lind"}, {"authorId": "2159214305", "name": "Alexander J Robertson"}, {"authorId": "49550381", "name": "Julio Silva"}, {"authorId": "2060154791", "name": "F. Warner"}, {"authorId": "38385690", "name": "A. Coppi"}, {"authorId": "1411393005", "name": "Nathan Price"}, {"authorId": "2191630949", "name": "Chelsea Duckwall"}, {"authorId": "2044985220", "name": "P. Sosensky"}, {"authorId": "2146942339", "name": "E. C. Di Giuseppe"}, {"authorId": "2075620820", "name": "R. Borg"}, {"authorId": "2271659", "name": "M. Fofana"}, {"authorId": "51118071", "name": "O. Ranzani"}, {"authorId": "40507322", "name": "N. Dean"}, {"authorId": "32253263", "name": "J. Andrews"}, {"authorId": "1636808200", "name": "J. Croda"}, {"authorId": "2249470", "name": "A. Iwasaki"}, {"authorId": "143836573", "name": "D. Cummings"}, {"authorId": "35471575", "name": "A. Ko"}, {"authorId": "4352029", "name": "M. Hitchings"}, {"authorId": "14677344", "name": "W. Schulz"}], "citations": [{"paperId": "8c9b8e1f8386043b9162f7fa87bb6cf4ca4af2b4", "title": "Vaccination and its impact on healthcare utilization in two groups of vaccinated and unvaccinated patients with COVID‐19: A cross‐sectional study in Iran between 2021 and 2022"}, {"paperId": "40a40698ed5ccc226a4473b2ab3976be38ac093e", "title": "Preexisting immunity restricts mucosal antibody recognition of SARS-CoV-2 and Fc profiles during breakthrough infections"}, {"paperId": "cb4e7aa79cc94b5f56aeefb4b771f95c3ac6a08a", "title": "Detection and isolation of infectious SARS-CoV-2 omicron subvariants collected from residential settings"}, {"paperId": "fbfc9728163e9bc07ed3884cdb564f7de0367acf", "title": "Design and Analysis Heterogeneity in Observational Studies of COVID-19 Booster Effectiveness: A Review and Case Study"}, {"paperId": "2f3928d6ac90e27d0aee25549e4d44bc4e8468a6", "title": "Lasting first impression: Pre-existing immunity restricts mucosal antibody responses during Omicron breakthrough"}]}
