{"paperId": "a1dafe5f661def685c5be3eacde0f0bb41892df2", "publicationVenue": {"id": "0ed0ece3-f3ec-4835-aaab-1d840a580c55", "name": "Computer systems science and engineering", "type": "journal", "alternate_names": ["Comput Syst Sci  Eng", "Computer Systems: Science & Engineering", "Comput syst sci eng"], "issn": "0267-6192"}, "title": "An Improved Method for Extractive Based Opinion Summarization Using Opinion Mining", "abstract": "Opinion summarization recapitulates the opinions about a common topic automatically. The primary motive of summarization is to preserve the properties of the text and is shortened in a way with no loss in the semantics of the text. The need of automatic summarization efficiently resulted in increased interest among communities of Natural Language Processing and Text Mining. This paper emphasis on building an extractive summarization system combining the features of principal component analysis for dimensionality reduction and bidirectional Recurrent Neural Networks and Long Short-Term Memory (RNN-LSTM) deep learning model for short and exact synopsis using seq2seq model. It presents a paradigm shift with regard to the way extractive summaries are generated. Novel algorithms for word extraction using assertions are proposed. The semantic framework is well-grounded in this research facilitating the correct decision making process after reviewing huge amount of online reviews, considering all its important features into account. The advantages of the proposed solution provides greater computational efficiency, better inferences from social media, data understanding, robustness and handling sparse data. Experiments on the different datasets also outperforms the previous researches and the accuracy is claimed to achieve more than the baselines, showing the efficiency and the novelty in the research paper. The comparisons are done by calculating accuracy with different baselines using Rouge tool.", "venue": "Computer systems science and engineering", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "Comput. Syst. Sci. Eng.", "pages": "779-794", "volume": "42"}, "authors": [{"authorId": "2147349647", "name": "Surbhi Bhatia"}, {"authorId": "2290845567", "name": "Mohammed Alojail"}], "citations": [{"paperId": "9bf2a39fa4d13a95a65e8e2516441baa5d23bf47", "title": "Vocal Music Teaching Brands Recommendation Based on Review Mining and Multicriteria Decision-Making"}]}
