{"paperId": "a1e027fd4837c2631e165689cf516a1bf4709ee6", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Benchmarking Object Detection Deep Learning Models in Embedded Devices", "abstract": "Object detection is an essential capability for performing complex tasks in robotic applications. Today, deep learning (DL) approaches are the basis of state-of-the-art solutions in computer vision, where they provide very high accuracy albeit with high computational costs. Due to the physical limitations of robotic platforms, embedded devices are not as powerful as desktop computers, and adjustments have to be made to deep learning models before transferring them to robotic applications. This work benchmarks deep learning object detection models in embedded devices. Furthermore, some hardware selection guidelines are included, together with a description of the most relevant features of the two boards selected for this benchmark. Embedded electronic devices integrate a powerful AI co-processor to accelerate DL applications. To take advantage of these co-processors, models must be converted to a specific embedded runtime format. Five quantization levels applied to a collection of DL models are considered; two of them allow the execution of models in the embedded general-purpose CPU and are used as the baseline to assess the improvements obtained when running the same models with the three remaining quantization levels in the AI co-processors. The benchmark procedure is explained in detail, and a comprehensive analysis of the collected data is presented. Finally, the feasibility and challenges of the implementation of embedded object detection applications are discussed.", "venue": "Italian National Conference on Sensors", "year": 2022, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-05-31", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "22"}, "authors": [{"authorId": "2167839167", "name": "David Cantero"}, {"authorId": "1411325826", "name": "Iker Esnaola-Gonzalez"}, {"authorId": "1399353550", "name": "J. Miguel-Alonso"}, {"authorId": "2630047", "name": "E. Jauregi"}], "citations": [{"paperId": "c3e0351af95289bc9cd6210dab91bee0e2f7cb73", "title": "Analysing Edge Computing Devices for the Deployment of Embedded AI"}, {"paperId": "605d4edfc2c386943a34db7270c55bab387076c1", "title": "Deep Learning-Based Object Detection Techniques for Self-Driving Cars: an in-Depth Analysis"}, {"paperId": "cf1eb25ae2848508a79c5736640d2990ccb5c938", "title": "Editorial for the Special Issue Recognition Robotics"}, {"paperId": "2dc07cbd1dc5109aef283dd350bbdfdb7aa896b3", "title": "Comparative Evaluation between Accelerated RISC- V and ARM AI Inference Machines"}, {"paperId": "36f71a602d0a4554f4ad2ae10fcb75ab9bba2726", "title": "Energy Profiling of DNN Accelerators"}, {"paperId": "102cf83d6034dacbfa5fc08cd46a10fab1793175", "title": "An Optimized DNN Model for Real-Time Inferencing on an Embedded Device"}]}
