{"paperId": "a1f2201375aa4183f444682977522199ba84eaa6", "publicationVenue": {"id": "cf25f885-7230-4882-89ab-019a94b92e90", "name": "Computer Science and Information Systems", "type": "journal", "alternate_names": ["Comput Sci Inf Syst"], "issn": "1820-0214", "url": "http://www.comsis.org/", "alternate_urls": ["http://www.comsis.org/index.php", "http://elib.mi.sanu.ac.rs/pages/browse_publication.php?db=csis", "http://www.comsis.org/archive.php"]}, "title": "ProRes: Proactive re-selection of materialized views", "abstract": "Materialized View Selection is one of the most studied problems in the\n database field, covering SQL and NoSQL technologies as well as different\n deployment infrastructures (centralized, parallel, cloud). This problem has\n become more complex with the arrival of data warehouses, being coupled with\n the physical de sign phase that aims at optimizing query performance.\n Selecting the best set of materialized views to optimize query performance\n is a challenging task. Given their importance and the complexity of their\n selection, several research efforts both from academia and industry have\n been conducted. Results are promising - some solutions are being\n implemented by commercial and open-source DBMSs -, but they do not factor in\n the following properties of nowadays analytical queries: (i) large scale\n queries, (ii) their dynamicity, and (iii) their high interaction. Studies to\n date fail to consider that complete set of properties. Considering the three\n properties simultaneously is crucial regarding today?s analytical\n requirements, which involve dynamic and interactive queries. In this paper,\n we first present a concise state of the art of the materialized view\n selection problem (VSP) by analyzing its ecosystem. Secondly, we propose a\n proactive re-selection approach that considers the three properties\n concurrently. It features twomain phases: offline and online. In the offline\n phase, we manage a set of the first queries based on a given threshold _ by\n selecting materialized views through a hypergraph structure. The second\n phase manages the addition of new queries by scheduling them, updates the\n structure of the hypergraph, and selects new views by eliminating the least\n beneficial ones. Finally, extensive experiments are conducted using the Star\n Schema Benchmark data set to evaluate the effectiveness and efficiency of\n our approach.", "venue": "Computer Science and Information Systems", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "Comput. Sci. Inf. Syst.", "pages": "735-762", "volume": "19"}, "authors": [{"authorId": "2092977739", "name": "M. Mouna"}, {"authorId": "1684379", "name": "Ladjel Bellatreche"}, {"authorId": "3019700", "name": "Boustia Narhimene"}], "citations": [{"paperId": "ecae0984c2fd08c8863bf18c16d3f6ac4d087ab7", "title": "Multi-Objective Genetic Algorithm for Materialized View Optimization in Data Warehouses"}, {"paperId": "849dbbb267f00c8857c052b2255a2870de2df30a", "title": "A Novel Hybrid Optimization Algorithm for Materialized View Selection from Data Warehouse Environments"}]}
