{"paperId": "a21833c77d6ecac458a2d29d229991724dc68d70", "publicationVenue": {"id": "deedf64a-dd5c-4b33-b345-ff83bfb93d71", "name": "International Symposium on Computer Architecture", "type": "conference", "alternate_names": ["Int Symp Comput Archit", "ISCA"], "url": "http://www.cs.wisc.edu/~arch/www/"}, "title": "SATORI: Efficient and Fair Resource Partitioning by Sacrificing Short-Term Benefits for Long-Term Gains*", "abstract": "Multi-core architectures have enabled data centers to increasingly co-locate multiple jobs to improve resource utilization and lower the operational cost. Unfortunately, naively co-locating multiple jobs may lead to only a modest increase in system throughput. Worse, some users may observe proportionally higher performance degradation compared to other users co-located on the same physical multi-core system. SATORI is a novel strategy to partition multi-core architectural resources to achieve two conflicting goals simultaneously: increasing system throughput and achieving fairness among the co-located jobs.", "venue": "International Symposium on Computer Architecture", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2021-06-01", "journal": {"name": "2021 ACM/IEEE 48th Annual International Symposium on Computer Architecture (ISCA)", "pages": "292-305"}, "authors": [{"authorId": "15723239", "name": "Rohan Basu Roy"}, {"authorId": "28293642", "name": "Tirthak Patel"}, {"authorId": "34966505", "name": "Devesh Tiwari"}], "citations": [{"paperId": "5e7e71000c3dcc69937d9c1026127032c60f7e81", "title": "Orchid: An Online Learning Based Resource Partitioning Framework for Job Colocation With Multiple Objectives"}, {"paperId": "ac80eaa856a9adecb33f0503c22dccc406667cc1", "title": "Divide&Content: A Fair OS-Level Resource Manager for Contention Balancing on NUMA Multicores"}, {"paperId": "5ef9a5e138ad6496aa95f277a7898b0d2b40a763", "title": "POBO: Safe and optimal resource management for cloud microservices"}, {"paperId": "f54b031f24df73a4616cc1673eaf78b279b5afed", "title": "CoTuner: A Hierarchical Learning Framework for Coordinately Optimizing Resource Partitioning and Parameter Tuning"}, {"paperId": "59f09a5b85ee248311cddb074c1c69ef8a6f075e", "title": "PAC: Preference-Aware Co-location Scheduling on Heterogeneous NUMA Architectures To Improve Resource Utilization"}, {"paperId": "74541907bc5c08a551f802d13f23a1e33e0dd00c", "title": "RAPID: Enabling Fast Online Policy Learning in Dynamic Public Cloud Environments"}, {"paperId": "3bb7558c0dd3c77c5129e66d377bf7b84d9f4f86", "title": "Harvesting L2 Caches in Server Processors"}, {"paperId": "9c3b022d391887865f6c52803d2a91235b70b951", "title": "QoS-Aware Resource Management for Multi-phase Serverless Workflows with Aquatope"}, {"paperId": "c24b9ba9fb10def76556ab4b2553f14e30184e7a", "title": "AQUATOPE: QoS-and-Uncertainty-Aware Resource Management for Multi-stage Serverless Workflows"}, {"paperId": "3abb6d7ecb4ad85e12badbe6d190a516477d67d5", "title": "Com-CAS: Effective Cache Apportioning under Compiler Guidance"}, {"paperId": "3b0d86d18460861b39fbd81d1b0c4c6ba5d6e692", "title": "Datamime: Generating Representative Benchmarks by Automatically Synthesizing Datasets"}, {"paperId": "7fde8fdbf666fb2a42a9ce4c579dd4cd1236e183", "title": "RIBBON: Cost-Effective and QoS-Aware Deep Learning Model Inference using a Diverse Pool of Cloud Computing Instances"}, {"paperId": "476a560c65038f0cd9744603ce83c484b1e9a7bf", "title": "Provisioning Differentiated Last-Level Cache Allocations to VMs in Public Clouds"}]}
