{"paperId": "a221f9990142024b4f1923bb3ab1b0fb405a0bb0", "publicationVenue": {"id": "764e3630-ddac-4c21-af4b-9d32ffef082e", "name": "IEEE International Conference on Data Engineering", "type": "conference", "alternate_names": ["ICDE", "Int Conf Data Eng", "IEEE Int Conf Data Eng", "International Conference on Data Engineering"], "url": "http://www.wikicfp.com/cfp/program?id=1331"}, "title": "Exploratory Data Analysis in SAP IQ Using Query-Time Sampling", "abstract": "As businesses continue to consume and produce ever-growing volumes of data, exploratory data analysis (EDA) is becoming an integral part of everyday operations. While online analytical processing (OLAP) systems in general – and column-oriented relational database management systems (RDBMS) in particular – are equipped with powerful tools to plough through petabytes of data, analytical queries may take seconds to execute, which is not always desirable in exploratory data analysis. Data scientists often need tools for fast visualization of data, and they are interested in identifying subsets of data that need further drilling-down before running computationally expensive analytical functions. In this paper, we describe our early work on extending SAP IQ (a disk-based columnar RDBMS) to support approximate query processing for exploratory data analysis using a technique known as query-time sampling. Specifically, we introduce two classes of novel samplers: (i) a stratified sampler with randomized row access to address the early-row bias problem in sampling, and (ii) hash-based equi-join samplers that are outlier-aware. We demonstrate how SAP IQ’s polymorphic table function (PTF) technology can be utilized to implement these samplers as new query plan operators.", "venue": "IEEE International Conference on Data Engineering", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-04-01", "journal": {"name": "2021 IEEE 37th International Conference on Data Engineering (ICDE)", "pages": "2381-2386"}, "authors": [{"authorId": "98269290", "name": "Xiaomin Meng"}, {"authorId": "3215781", "name": "Günes Aluç"}], "citations": []}
