{"paperId": "a221a4e6d0aeefe6ccfc5f7f37a24dda67675ee3", "publicationVenue": {"id": "ff159887-5591-495e-8a29-710e87e64127", "name": "International Journal of Production Research", "type": "journal", "alternate_names": ["Int J Prod Res"], "issn": "0020-7543", "url": "http://www.tandfonline.com/loi/tprs20"}, "title": "Exploring the transition from techno centric industry 4.0 towards value centric industry 5.0: a systematic literature review", "abstract": "This systematic literature review synthesises the literature on human centric IN 4.0 and IN 5.0 while exploring driving forces behind the transition from technocentric IN 4.0 to value centric IN 5.0 using the principles of the multiple level perspective (MLP). Works that discuss contextual, regime and niche level factors which impact on the transition were explored. The Covid- 19 pandemic and Climate change are identified as key contextual, ‘Landscape’, factors impacting the transition while Trust, Mass personalisation and Autonomy are highlighted as key Regime factors. In terms of Niche innovations, Advanced Extended reality technologies, Cobots/ Advanced Robotics, and Advanced AI are often connected with landscape or regime issues. Drawing on MLP theory, the study demonstrates that the transition from IN 4.0 towards IN 5.0 is occurring through a reconfiguration pattern. The paper further emphasises aspects that both practitioners and academics need to be cognisant of in order to affect a transition from IN 4.0 to IN 5.0.", "venue": "International Journal of Production Research", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-06-26", "journal": {"name": "International Journal of Production Research", "pages": "7866 - 7902", "volume": "61"}, "authors": [{"authorId": "123045895", "name": "Etieno Enang"}, {"authorId": "1715505", "name": "M. Bashiri"}, {"authorId": "145265484", "name": "D. Jarvis"}], "citations": [{"paperId": "022e43e283717a993c1e07d889a76cbbc70da0ee", "title": "Practice With Less AI Makes Perfect: Partially Automated AI During Training Leads to Better Worker Motivation, Engagement, and Skill Acquisition"}, {"paperId": "2e5e38000d38e53f1024af79a0ad48c013eaba3e", "title": "Industry 5.0 use cases development framework"}, {"paperId": "639aca00bd0506d02212b7636d1255e1947e9f01", "title": "Towards industry 5.0: evolving the product-process matrix in the new paradigm"}, {"paperId": "2209cf7cdebaf1a7e424bc05f040d6ce4926e64d", "title": "Rethinking innovation through industry and society 5.0 paradigms: a multileveled approach for management and policy-making"}, {"paperId": "abb35f7aa9a536d67341e2768e30e3711c8339fe", "title": "Human work in the shift to Industry 4.0: a road map to the management of technological changes in manufacturing"}, {"paperId": "469aadf396bb44f58e1c1c4998fa799c72989e5b", "title": "A systematic literature review exploring and linking circular economy and sustainable development goals in the past three decades (1991-2022)"}, {"paperId": "49408127c8777683b45cad9f2b9ad7751f518fb3", "title": "Human-centric production and logistics system design and management: transitioning from Industry 4.0 to Industry 5.0"}, {"paperId": "d7fa1bc987f1ccc5ae2411141e106ef209ce5551", "title": "Putting Digital Technologies at the Forefront of Industry 5.0 for the Implementation of a Circular Economy in Manufacturing Industries"}]}
