{"paperId": "a225fb82cec15153deaf42b4d104891a9acd6c15", "publicationVenue": {"id": "c83872c8-8037-4ef1-8ced-abb2233a2886", "name": "IEEE Transactions on Green Communications and Networking", "alternate_names": ["IEEE Trans Green Commun Netw"], "issn": "2473-2400", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=7511293", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=7511293"]}, "title": "Optimal Radius for Enhanced Lifetime in IoT Using Hybridization of Rider and Grey Wolf Optimization", "abstract": "Connecting all devices through the Internet is now practical via the Internet of Things (IoT). IoT is characterized by using smart and self-configuring objects that can interact with each other via global network infrastructure. Clustering is the promising technique that effectively works on the enhancement of network lifetime. This paper intends to introduce a new clustering technique, where the selection of cluster head is done by a new hybrid algorithm termed Over taker Assisted Wolf Update (OA-WU), which hybrids the concept of Rider Optimization Algorithm (ROA) and Grey Wolf Optimization algorithm (GWO). This cluster head selection has been dealt with certain constraints like (i) Energy (ii) Distance and (iii) Cluster Radius. The proposed OA-WU performance is compared with the traditional methods with respect to alive node analysis, cost function analysis and energy analysis. The results demonstrate that the proposed OA-WU algorithm adequately improves the energy conservation and convergence rate in a minuscule period.", "venue": "IEEE Transactions on Green Communications and Networking", "year": 2021, "fieldsOfStudy": ["Physics", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-06-01", "journal": {"name": "IEEE Transactions on Green Communications and Networking", "pages": "635-644", "volume": "5"}, "authors": [{"authorId": "1845870613", "name": "K. Dev"}, {"authorId": "2162791", "name": "Ravi Kumar Poluru"}, {"authorId": "2106367000", "name": "Lokesh Kumar Ramasamy"}, {"authorId": "29919430", "name": "Praveen Kumar Reddy Maddikunta"}, {"authorId": "10779576", "name": "Sunder Ali Khowaja"}], "citations": [{"paperId": "916da226be9f01ee5dce157f51bee5c27872969f", "title": "A Systematic Review of Applying Grey Wolf Optimizer, its Variants, and its Developments in Different Internet of Things Applications"}, {"paperId": "7b35676afc9acccbbf560b09a91bcfc7278b2d00", "title": "Optimal Location of Facts Devices for Power Loss Reduction and Voltage Improvement in Deregulated Power System Using Rider Optimization Algorithm"}, {"paperId": "91a78c8a35e6317fc7204af404b801a5e7565950", "title": "An opportunistic energy‐efficient dynamic self‐configuration clustering algorithm in WSN‐based IoT networks"}, {"paperId": "488ffa680b0ca0a5d7a3e02fa681c6b0050aacd4", "title": "Multibiosensor Data Sampling and Transmission Reduction With Decision-Making for Remote Patient Monitoring in IoMT Networks"}, {"paperId": "48c1bd82cdea2d5f2b87ed44cebfe7470845140b", "title": "The HSGWO-MPIO algorithm based on improved search capability"}, {"paperId": "a3b49871b9e4ff9d090e3ae10cc0c5024d04807e", "title": "NEAT: A Resilient Deep Representational Learning for Fault Detection Using Acoustic Signals in IIoT Environment"}, {"paperId": "020dd938adf8a50e748c684ca45f69182d78caf6", "title": "QEGWO: Energy-Efficient Clustering Approach for Industrial Wireless Sensor Networks Using Quantum-Related Bioinspired Optimization"}, {"paperId": "7bf81adcd786038b007540a1a26f13d9f7a5aa9b", "title": "A Novel Localization Method of Wireless Covert Communication Entity for Post-Steganalysis"}, {"paperId": "e6deb4a9aea5ba21b3a37b679b45ae7ba2fa7412", "title": "Machine learning-enabled MIMO-FBMC communication channel parameter estimation in IIoT: A distributed CS approach"}, {"paperId": "eb56c2f969b3be55f335bfc513c0429342bfa8a6", "title": "Dingo Optimization Based Cluster Based Routing in Internet of Things"}, {"paperId": "9e62ac9817130b2b70b259b580cadf9b4d6372ca", "title": "Quantifying Location Privacy for Navigation Services in Sustainable Vehicular Networks"}, {"paperId": "75a10b8aa81e9e31b466484173af313cc409902e", "title": "Multiobjectives for Optimal Geographic Routing in IoT Health Care System"}, {"paperId": "73e12d0fcee99edf1877043c36c31fe7329a55ec", "title": "A survey on Zero touch network and Service Management (ZSM) for 5G and beyond networks"}, {"paperId": "eb48b9eae47e10e7668dfd41cfb7502ffeac55b0", "title": "A survey on energy efficiency in underwater wireless communications"}, {"paperId": "4f4e7575e4998e6aead86d40a6e701a637a266a0", "title": "Optimized Fuzzy Logic Based Energy-Efficient Geographical Data Routing in Internet of Things"}]}
