{"paperId": "a22bac3ef0af6772da0449b7da4ba1e39ddc4ba7", "publicationVenue": null, "title": "Digital Twin as a Proxy for Industrial Cyber-Physical Systems", "abstract": "Digital twins (DTs) in industrial cyber-physical systems (ICPSs) are an essential concept for Industry 4.0. In recent years, DT architectures and frameworks for industry have been the focus of several research initiatives regarding analytics, predictive maintenance, virtual evaluation & verification, and fault detection & diagnosis. However, the resource constraint and battery-driven devices in an ICPS environment are facing challenges such as short life spans due to high energy consumption, lower availability of the services, and low security capabilities. To meet these challenges, this paper identifies some critical properties for DTs, including energy efficiency, high availability & state persistence, remote & contention control, and security. To provide services in ICPSs, we define the concept of a DT as a proxy (DTaaP) and a four-layer architectural model for the DTaaP that enables meeting the identified properties. We present a generic proof of concept (PoC) implementation by using Eclipse Ditto, which is an open-source digital twin framework. We evaluate our artifact against the listed properties through an experimental scenario. We show that the DTaaP improves energy efficiency, that the DT can serve as an anchor point for security, and that the DTaaP provides availability and persistence for duty cycling devices. We also identify some limitations of Eclipse Ditto for PoC DTaaP implementation, which can be a focus for future research.", "venue": "icWCSN", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2023-01-06", "journal": {"name": "Proceedings of the 2023 10th International Conference on Wireless Communication and Sensor Networks"}, "authors": [{"authorId": "2078375400", "name": "Abdullah Aziz"}, {"authorId": "2509535", "name": "O. Schelén"}, {"authorId": "1730906", "name": "Ulf Bodin"}], "citations": [{"paperId": "61d3b506a2a511de95a5bbd168452f6ac15452e8", "title": "Automated Management of Attribute-Based Policies for Access Control Using Tag-Matching"}, {"paperId": "6ee405505e0ed83cd02db1dd5b8ee991de5e3194", "title": "Empowering The Eclipse Arrowhead Framework with a Digital Twin as a Proxy Service"}, {"paperId": "290246920c531884766172fe6bd572055cf0fcbe", "title": "Distributed Digital Twins as Proxies-Unlocking Composability and Flexibility for Purpose-Oriented Digital Twins"}]}
