{"paperId": "a23f34fdf002626d90f2053b924d3ebd45c495d3", "publicationVenue": {"id": "f276563a-4ccc-47fc-b959-9658e1434dfd", "name": "International Conference Inventive Communication and Computational Technologies", "type": "conference", "alternate_names": ["Int Conf Inven Commun Comput Technol", "International Conference Intelligent Computing and Communication Technologies", "ICICCT", "Int Conf Intell Comput Commun Technol"]}, "title": "The Future of India Creeping up in Building a Smart City: Intelligent Traffic Analysis Platform", "abstract": "The integration of various embedded technological devices makes our environment to enable IoT. Internet of things plays a major role in bringing out the smartness into the culture. The smart transportation system is one such example that mainly focuses on to provide safety, efficient usage and reliable transportation this in turn is known in the form of smartness, and sustainable environment that is established for the public. To provide intelligent transportation System (ITS) there exist many problems in supply of the resources such as controlling of air pollution, reduce traffic congestion and the continuous growth of population. Therefore a deep analysis is required to control the trajectory data. These data have to analyzed and predicted using Big Data Analytics techniques. To solve the congestion in traffic a proper Data mining methodology is to be adapted that provides/paves way for the prioritized vehicles or it can make the congested payment to be free. These technologies will provide proper guidance to the public sector in enabling a healthier environment. The use of GPS sensor and analyzing the data is being done on the trajectory big data which will enable us to generate a Smarter Environment. This paper has discussed about the various technological implementations that have been carried out in prior to develop a smart intelligent transportation and it also has pointed out the different mechanism in executing this system effectively.", "venue": "International Conference Inventive Communication and Computational Technologies", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2018-04-20", "journal": {"name": "2018 Second International Conference on Inventive Communication and Computational Technologies (ICICCT)", "pages": "518-523"}, "authors": [{"authorId": "145028813", "name": "S. Balamurugan"}, {"authorId": "51427102", "name": "J. F. Lilian"}, {"authorId": "144500365", "name": "S. Sasikala"}], "citations": [{"paperId": "2f6cc0dc97de4980448930f701398e90b48a436c", "title": "A Federated Deep Learning Empowered Resource Management Method to Optimize 5G and 6G Quality of Services (QoS)"}, {"paperId": "7f44160d71e1dd3d31490acd13de44f43ff82ba8", "title": "DRL-Based Intelligent Resource Allocation for Diverse QoS in 5G and toward 6G Vehicular Networks: A Comprehensive Survey"}, {"paperId": "b87c88a9a34896b77790bca590edcf8ce9c095ec", "title": "A Hyperconnected Smart City Framework: Digital Resources Using Enhanced Pedagogical Techniques"}, {"paperId": "dafbdafe483df61ef0883e09eddc4db3ddeccc0e", "title": "Car Park Occupancy Rates Forecasting based on Cluster Analysis and kNN in Smart Cities"}, {"paperId": "3308ba0ec1fba959dc813c622bd41f07d0579ef5", "title": "The Collection of Road Tra(cid:30)c Incidents in Bangkok from Twitter Data based on Deep Learning Algorithm"}]}
