{"paperId": "a23fac1deaa89aebe659ac69255243d7435516db", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "A Comprehensive Tensor Framework for the Clustering of Hyperspectral Paper Data With an Application to Forensic Document Analysis", "abstract": "In forensic document analysis, the authenticity of a document must be properly checked in the context of suspected forgery. Hyperspectral Imaging (HSI) is a non-invasive way of detecting fraudulent papers in a multipage document. The occurrence of a forged paper in a multi-page document may have a substantial difference from rest of the papers in its age, type, color, texture, and so on. Each pixel in an HSI data can be used as the material fingerprint for the spatial point it corresponds to. Hence, hyperspectral data of paper samples made of the same substance have similar characteristics and can be grouped into a single cluster. Similarly, paper samples made of different substances have different spectral properties. This paper relies on this heuristic and proposes a tensor based clustering framework for hyperspectral paper data, with an application to detect the forged papers in multi-page documents. Information embedded in the hyperspectral patches of the papers to be clustered is arranged into individual lateral slices of a third-order tensor in this framework. Further, this work employs the self-expressiveness property of submodules and an objective function is formulated to extract self-expressive representation tensor with low multirank and f-diagonal structure. Objective function of the proposed method incorporates $l_{\\frac {1}{2}}$ -induced Tensor Nuclear Norm (TNN) and $l_{\\frac {1}{2}}$ regularization to impart better low rankness and f-diagonal structure to the representation tensor. Experimental results of the proposed method were compared to the state-of-the-art subspace clustering approaches. The results demonstrate improved performance of the proposed method over the existing clustering algorithms.", "venue": "IEEE Access", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "6194-6207", "volume": "10"}, "authors": [{"authorId": "2067906778", "name": "Jobin Francis"}, {"authorId": "8767801", "name": "Baburaj Madathil"}, {"authorId": "2288329277", "name": "S. N. George"}, {"authorId": "144883951", "name": "S. George"}], "citations": [{"paperId": "180a5a0a084185a818a774b6890567a5fedc1fa6", "title": "Distributed Intelligent Scheduling Algorithm for Wireless Communication Network Link Resources Based on Data Analysis"}, {"paperId": "25ae7392954c5e0ca444e5b0ef2621d617f4cdcb", "title": "A Tensor Non-Convex Low Rank And Sparse Constrained Band Selection Scheme For Clustering Of Hyperspectral Paper Data"}]}
