{"paperId": "a2447f6097854aaa5773026dfbeaa02920bd5570", "publicationVenue": {"id": "9af0c4a9-9d20-428b-b002-352f06623d40", "name": "International Conference on Cloud Computing and Big Data", "type": "conference", "alternate_names": ["Int Conf Cloud Comput Big Data", "CCBD", "CloudCom-Asia"]}, "title": "Index-Based OLAP Aggregation for In-Memory Cluster Computing", "abstract": "In this paper, we present an OLAP aggregation approach based on key-value index to build the OLAP engine on the in-memory cluster computing environment. First, we generate binary code for each dimension attribute value and mask code for each dimension attribute. Then key-value indexes are constructed where the binary surrogate key is encoded by compounding the binary code of attribute values and the value is the list of matched fact table row ids. In our implementation, we choose Spark, which provides resilient distributed dataset(RDD) that enables users persist intermediate results in memory locally. We execute query filtering on key-value indexes by RDDs transformation and get satisfied fact row ids by intersect results of different RDDs. Through this way, we avoid complex join operations and multiple fact table scan, and further improve respond time by transforming RDDs in local machine memory. Different aggregations can be calculated on fact table only one pass. Finally, we experiment proposed OLAP prototype and two other open source ROLAP engines with TPC-DS benchmark data set. Experimental results demonstrate our OLAP prototype outperforms Shark and Hive.", "venue": "International Conference on Cloud Computing and Big Data", "year": 2014, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2014-11-01", "journal": {"name": "2014 International Conference on Cloud Computing and Big Data", "pages": "148-151"}, "authors": [{"authorId": "46396571", "name": "Yang Wang"}, {"authorId": "3314604", "name": "Xiaojun Ye"}], "citations": [{"paperId": "2af224afb39cc64edb2148eb089900f63cd84fe1", "title": "Timo: In-Memory Temporal Query Processing for Big Temporal Data"}, {"paperId": "ba61e1cac770b2e04d475b34b84647b905dada77", "title": "Analyzing Time Interval Data"}]}
