{"paperId": "a24afe1b70cdfcbed237a212f705ff5c651c5597", "publicationVenue": null, "title": "Transforming ML Predictive Pipelines into SQL with MASQ", "abstract": "Inference of Machine Learning (ML) models, i.e. the process of obtaining predictions from trained models, is often an overlooked problem. Model inference is however one of the main contributors of both technical debt in ML applications and infrastructure complexity. MASQ is a framework able to run inference of ML models directly on DBMSs. MASQ not only averts expensive data movements for those predictive scenarios where data resides on a database, but it also naturally exploits all the \"Enterprise-grade\" features such as governance, security and auditability which make DBMSs the cornerstone of many businesses. MASQ compiles trained models and ML pipelines implemented in scikit-learn directly into standard SQL: no UDFs nor vendor-specific syntax are used, and therefore queries can be readily executed on any DBMS. In this demo, we will showcase MASQ's capabilities through a GUI allowing attendees to: (1) train ML pipelines composed of data featurizers and ML models; (2) compile the trained pipelines into SQL, and deploy them on different DBMSs (MySQL and SQLServer in the demo); and (3) compare the related performance under different configurations (e.g., the original pipeline on the ML framework against the SQL implementations).", "venue": "SIGMOD Conference", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2021-06-09", "journal": {"name": "Proceedings of the 2021 International Conference on Management of Data"}, "authors": [{"authorId": "2047379784", "name": "Francesco Del Buono"}, {"authorId": "153660158", "name": "Matteo Paganelli"}, {"authorId": "49245285", "name": "Paolo Sottovia"}, {"authorId": "2192580", "name": "Matteo Interlandi"}, {"authorId": "145020779", "name": "F. Guerra"}], "citations": [{"paperId": "45dd012e19b7ab81e5fd3d9d71c40e78b58cbed8", "title": "TensorTable: Extending PyTorch for mixed relational and linear algebra pipelines"}, {"paperId": "a24c8ad1a21bb735a327051d2b193d90669dff7d", "title": "MaskSearch: Querying Image Masks at Scale"}, {"paperId": "a2b993c36c238ac3d33cd1e5269c0eb2acac5224", "title": "Pushing ML Predictions Into DBMSs"}, {"paperId": "127b7ef160f82226cc1020cc0f2e34080bc33ed4", "title": "The Tensor Data Platform: Towards an AI-centric Database System"}, {"paperId": "300823792f3854a857c452259455fe4b162c3104", "title": "Query Processing on Tensor Computation Runtimes"}, {"paperId": "8e51f65e05dca6a74576ae896ca39eeea2264bad", "title": "Exploration of Approaches for In-Database ML"}]}
