{"paperId": "a24a4b47d69f63f4923500c27e8aa01ca4371b87", "publicationVenue": {"id": "62a0df02-79f9-4bba-8524-48ec1a6d0185", "name": "International Conference on Big Data Research", "type": "conference", "alternate_names": ["Int Conf Big Data Res", "International Conference Big Data Research", "ICBDR"]}, "title": "Data Migration: Cloudsim Extension", "abstract": "With the constantly growing volume of data in the context of cloud applications deployed in geographically distributed systems, the issue of data management has turned to be an essential study to evaluate the performance of the cloud system. Beside the classic task scheduling activity, handling input data for tasks becomes one of the most challenges towards intensive-data applications. In fact, input data should normally be gathered on the same datacenter where the task is scheduled for execution. So, to meet that, migration strategies are required for distant data and should be as efficient as possible. Data migration strategies consist on moving data across geographically distributed data centers in order to execute tasks in the cloud. Therefore, we need to know statistics about the entire mechanism, which has led us to extend Cloudsim, a popular simulation toolkit for large scale cloud computing infrastructures and application services. In this paper, we show how Cloudsim can be investigated to provide a scalable module able to simulate and perform data migration in cloud applications. In order to illustrate our module, different simulation scenarios are suggested to make explicit description for the implemented strategies and to prove the significance of our tool.", "venue": "International Conference on Big Data Research", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2019-11-20", "journal": {"name": "Proceedings of the 3rd International Conference on Big Data Research"}, "authors": [{"authorId": "1490680802", "name": "L. Bouhouch"}, {"authorId": "3386300", "name": "M. Zbakh"}, {"authorId": "49481182", "name": "C. Tadonki"}], "citations": [{"paperId": "c41c30be6c7a3f69daa5cc32eb4bd4a10592486f", "title": "Dynamic data replication and placement strategy in geographically distributed data centers"}, {"paperId": "6051200b77699dbc3009ac8d2317928ec11fb17c", "title": "High Availability Services of Client in Large-scale Cluster System"}, {"paperId": "ff2f584ea2732e0d2eb4aca6c69e693235f65320", "title": "A Big Data Placement Strategy in Geographically Distributed Datacenters"}]}
