{"paperId": "a24b020309d38654e9f90693e099970c6c845839", "publicationVenue": {"id": "2135230a-3b24-4b71-9583-60624389377a", "name": "IEEE Transactions on Industrial Informatics", "type": "journal", "alternate_names": ["IEEE Trans Ind Informatics"], "issn": "1551-3203", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=9424", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=9424"]}, "title": "An Industrial Dynamic Skyline Based Similarity Joins For Multidimensional Big Data Applications", "abstract": "In the era of data deluge, data analysis has become a key task for many industrial applications, e.g., master data management, and data integration. In particular, similarity join is an important primitive operator to support data analysis, which is to find similar pairs based on similarity functions and thresholds. In this article, we first propose a new similarity join operation called the dynamic skyline join without having to specify any similarity function or similarity threshold, which measures the similarity through multicriteria optimization. The dynamic skyline join operator makes the similarity join more flexible to support different criteria in multidimensional space. However, it is nontrivial to achieve dynamic skyline joins as both join operations and dynamic skyline queries are computationally complex in the increasing volume of real-world data. Therefore, we further propose Grid-SkyJoin, a framework to enable efficient parallel dynamic skyline joins on a shared-nothing cluster. Specifically, we use a grid partitioning to facilitate the data filtering and grouping strategies to provide load balancing and reduce the number of replicas. We also propose a multilevel filtering scheme to prune away a large fraction of unpromising points that do not fit into join results without actual join operations. Extensive experiments using benchmark datasets demonstrate that our filtering scheme can greatly reduce the number of data points to be joined, and our approach is about two times faster compared with the straightforward method in average.", "venue": "IEEE Transactions on Industrial Informatics", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-04-01", "journal": {"name": "IEEE Transactions on Industrial Informatics", "pages": "2520-2532", "volume": "16"}, "authors": [{"authorId": "2055464291", "name": "Bo Yin"}, {"authorId": "144312519", "name": "Xuetao Wei"}, {"authorId": "2143716755", "name": "Jin Wang"}, {"authorId": "145826495", "name": "N. Xiong"}, {"authorId": "2058325987", "name": "Ke Gu"}], "citations": [{"paperId": "d3d9cd5c6fb84da79e631677aa38ebd4df349039", "title": "A new approach for quality prediction and control of multistage production and manufacturing process based on Big Data analysis and Neural Networks"}, {"paperId": "112a63ec956805f3286a10d3bfb7b8caada49646", "title": "Forecasting model of electricity market prosperity index based on multidimensional big data"}, {"paperId": "a8591ae3920f66b839176bb2e0aecd0496630425", "title": "Towards a Redundant Response Avoidance for Intelligent Chatbot"}, {"paperId": "28eb2879c96a1fa1c7fe6bf474b24382d75e3f69", "title": "Design and Analysis of a Prediction System About Influenza-Like Illness From the Latent Temporal and Spatial Information"}, {"paperId": "30f325526e4da2f7a5c791ebbe7adffab4ecb8cc", "title": "Forecast and Analysis of Coal Traffic in Daqin Railway Based on the SARIMA-Markov Model"}, {"paperId": "0ebf9c0f574fb0ccd6046864deb7be52dd002af5", "title": "Skylines and Other Dominance-Based Queries"}, {"paperId": "a7a2cb1ae0467b9d853f098c310471e480c38698", "title": "A Systematic Scheme for Non-parametric Spatio-Temporal Trend Analysis about Aridity Index"}, {"paperId": "be9089ce40c65790d65ffe226b1217371d956df6", "title": "The improved image inpainting algorithm via encoder and similarity constraint"}, {"paperId": "f30b8d4823a67c023df676ad3bf67ec3b1de20ca", "title": "Density Peaks Clustering by Zero-Pointed Samples of Regional Group Borders"}, {"paperId": "ccde60dfa948242488cc2246eb0c2ecb11b02781", "title": "Experimenting and Assessing a Distributed Privacy-Preserving OLAP over Big Data Framework: Principles, Practice, and Experiences"}, {"paperId": "5e054d1ba33751bf4f3fba6357fb722bc43ec3b1", "title": "StegoPNet: Image Steganography With Generalization Ability Based on Pyramid Pooling Module"}, {"paperId": "1764210e3e774afcd440cdf146e23304957478b7", "title": "ForecastandAnalysisofCoalTraffic inDaqinRailwayBasedonthe SARIMA-Markov Model"}]}
