{"paperId": "a25a105436359081fdaa9b02eaca1953b4a4662b", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "The Role of IoT in Woman’s Safety: A Systematic Literature Review", "abstract": "Women’s safety has been highlighted as one of the major concerns of any society where several women are dealing with various safety issues like harassment, rape, molestation, and domestic violence due to different social or cultural reasons. Internet of Things (IoT) is becoming a promising technology to support day-to-day concerns and provide support in handling various affairs. Many IoT-based devices have been introduced by the community to help women deal with their potential safety threats. This study presents a systematic literature review of research studies exhibiting the IoT devices for women’s safety, the main features these devices offer as well as the wearable, sensors used, and the machine learning algorithms used. The review is carried out by carefully examining and synthesizing the research articles published between 2016 to 2022 in well-reputed research venues. The results revealed that different types of sensors are used to capture the state of women undergoing safety issues where the pulse-rate, and pressure sensors are most commonly used sensors in these devices. In addition, the devices used different technology to transmit the alerts including global positing system (GPS), global system for mobile communication (GSM), and Raspberry pi. Furthermore, several machine learning algorithms such as logistic regression, hidden Markov, and decision trees are used to identify the potential under threat women and help prevent the undesirable situation for women beforehand. It was identified that despite producing notable research in the underlying domain the systems emphasizing auto-activation of alert generation with lesser human interaction and improved accuracies are required to be developed for effectively addressing the concern. In addition to reviewing the literature, this study suggests a taxonomy posing different techniques, features, wearables, and sensors used in IoT-based women safety devices. Furthermore, the gaps and challenges pertaining to the IoT devices and their usability for women’s safety have also been highlighted. In addition, this work proposes an architectural model that presents prominent components necessary to develop IoT-based women’s safety devices. Lastly, this study emphasizes the use of combinations of sensors to get multiple types of input data that could lead to determining the possibility of threat with better accuracies and precisions.", "venue": "IEEE Access", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "69807-69825", "volume": "11"}, "authors": [{"authorId": "145248713", "name": "M. Farooq"}, {"authorId": "2210872291", "name": "Ayesha Masooma"}, {"authorId": "2005516012", "name": "Uzma Omer"}, {"authorId": "74386190", "name": "Rabia Tehseen"}, {"authorId": "103530264", "name": "S. A. M. Gilani"}, {"authorId": "2169848895", "name": "Zabihullah Atal"}], "citations": [{"paperId": "80e79f66a1cefec938fb91ea65ad4aac30e789b3", "title": "A Survey for Women Safety Alert System with Location-Based Notification and Community Awareness"}, {"paperId": "1562bb0b19f48658129006ee190da421b9674e80", "title": "Hope – An Arduino Based Safety device"}]}
