{"paperId": "a268738711f2d2a8f9e1b4e22884dd6ed42ad688", "publicationVenue": {"id": "5334d34c-deab-4ef6-8460-abd4cd569f74", "name": "International Journal of Advanced Trends in Computer Science and Engineering", "type": "journal", "alternate_names": ["Int J Adv Trends Comput Sci Eng"], "issn": "2278-3091", "url": "http://warse.org/ijatcse_current.html"}, "title": "Natural Disaster Risk Prediction in Indonesia: H-WEMA Approach", "abstract": "Natural disaster is defined as any hazards caused by the meteorological and earth forces, with no human interference and involvement. Due to the huge social and economic impacts it can give, the threat pose by the natural disaster should not be taken lightly. Indonesia, as one of the countries in the ring of fire belt, had recorded almost half of the global death from natural disasters in 2018. Three out of ten deadliest disaster events happened in Indonesia in that year. Therefore, in this study, the natural disaster risk prediction in Indonesia will be conducted using a time series forecasting method, namely H-WEMA method. It was first introduced in 2016 and has been applied to numerous cases. From the forecasting results, three out of ten categories of natural disasters in Indonesia can be properly predicted by using H-WEMA. There is a declining trend in natural disaster events for those three categories, at least for a few future years ahead.", "venue": "International Journal of Advanced Trends in Computer Science and Engineering", "year": 2020, "fieldsOfStudy": ["Business"], "publicationTypes": null, "publicationDate": "2020-04-25", "journal": {"name": "International Journal of Advanced Trends in Computer Science and Engineering"}, "authors": [{"authorId": "9126458", "name": "S. Hansun"}], "citations": [{"paperId": "2abb66c7cac9c4892fe314f4e499280b1ee78dd3", "title": "Local wisdom as a part of disaster communication: a study on the local storytelling in disaster mitigation"}, {"paperId": "a2eac37827bebcfafd01f6b061b02a1168c9f8d2", "title": "PREDICTION OF JAKARTA CITY AIR QUALITY INDEX: MODIFIED DOUBLE EXPONENTIAL SMOOTHING APPROACHES"}]}
