{"paperId": "a26bca8d2a23967a5a7c1133f054658428f74145", "publicationVenue": {"id": "7c9d091e-015e-4e5d-a11f-9bc369fcf414", "name": "IEEE Transactions on Parallel and Distributed Systems", "type": "journal", "alternate_names": ["IEEE Trans Parallel Distrib Syst"], "issn": "1045-9219", "url": "http://www.computer.org/tpds", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=71"]}, "title": "SmartVM: A Smart Contract Virtual Machine for Fast on-Chain DNN Computations", "abstract": "Blockchain-based artificial intelligence (BC-AI) has been applied for protecting deep neural network (DNN) data from being tampered with, which is expected to further boost trusted distributed AI applications in many fields. However, due to smart contract execution environment architectural defects, it is challenging for previous BC-AI systems to support computing-intensive tasks on-chain performing such as DNN convolution operations. They have to offload computations and a large amount of data from blockchain to off-chain platforms to execute smart contracts as native code. This failure to take advantage of data locality has become one of the major critical performance bottlenecks in BC-AI system. To this end, in this paper, we propose SmartVM with optimization methods to support on-chain DNN inference for BC-AI system. The key idea is to design and optimize the computing mechanism and storage structure of smart contract execution environment according to the characteristics of DNN such as high computational parallelism and large data volume. We decompose SmartVM into three components: 1) a compact DNN-oriented instruction set to describe computations in a short number of instructions to reduce interpretation time. 2) a memory management mechanism to make SmartVM memory dynamic free/allocated according to the size of DNN feature maps. 3) a block-based weight prefetching and parallel computing method to organize each layer's computing and weights prefetching in a pipelined manner. We perform the typical image classification in a private Ethereum blockchain testbed to evaluate SmartVM performance. Experimental results highlight that SmartVM can support DNN inference on-chain with roughly the same efficiency against the native code execution. Compared with the traditional off-chain computing, SmartVM can speed up the overall execution by 70×, 16×, 11×, and 12× over LeNet5, AlexNet, ResNet18, and MobileNet, respectively. The memory footprint can be reduced by 84%, 90.8%, 94.3%, and 93.7% over the above four models, while offering the same level model accuracy. This paper sheds light on the design space of the smart contract virtual machine for DNN computation and is promising to further boost BC-AI applications.", "venue": "IEEE Transactions on Parallel and Distributed Systems", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Transactions on Parallel and Distributed Systems", "pages": "1-1", "volume": "PP"}, "authors": [{"authorId": "2149201032", "name": "Tao Li"}, {"authorId": "2008740288", "name": "Yaozheng Fang"}, {"authorId": "2115686269", "name": "Ye Lu"}, {"authorId": "1999448107", "name": "Jinni Yang"}, {"authorId": "2041827266", "name": "Zhaolong Jian"}, {"authorId": "2166257158", "name": "Zhiguo Wan"}, {"authorId": "2672579", "name": "Yusen Li"}], "citations": [{"paperId": "0a03ae688ee9c92bce7b71120a2936f720ab615b", "title": "opML: Optimistic Machine Learning on Blockchain"}, {"paperId": "651f977c463bb135b1661690de5815e0c9df4cef", "title": "PaVM: A Parallel Virtual Machine for Smart Contract Execution and Validation"}, {"paperId": "a154e57850df3ea4f9c983e9fe9f4e51d7f03e42", "title": "VdaBSC: A Novel Vulnerability Detection Approach for Blockchain Smart Contract by Dynamic Analysis"}, {"paperId": "9fca6759b0e00019a3f0c2d5fef1964a2f6a902c", "title": "Blockchain Assisted Cloud Storage For Electronic Health Records"}, {"paperId": "ec1aac4b7382c515ae3fb9e9fd40f345bb23f51f", "title": "Social Metaverse: Challenges and Solutions"}, {"paperId": "43840530053078c5564059c9c86cc5b852d9a3c9", "title": "Trusted Outsourced Computing Framework for Smart Contract of Permissioned Blockchain"}, {"paperId": "70a7cacb679c7e10fc103900b9250f9245eac901", "title": "ACCEPTED FROM OPEN CALL"}]}
