{"paperId": "a291bb8a1412c499608e05eddfa3585bbb2c537e", "publicationVenue": null, "title": "This paper is included in the Proceedings of the 14th USENIX Symposium on Operating Systems Design and Implementation", "abstract": "Cluster managers like Kubernetes and OpenStack are notoriously hard to develop, given that they routinely grapple with hard combinatorial optimization problems like load balancing, placement, scheduling, and conﬁguration. Today, cluster manager developers tackle these problems by developing system-speciﬁc best effort heuristics, which achieve scalability by signiﬁcantly sacriﬁcing the cluster manager’s decision quality, feature set, and extensibility over time. This is proving untenable, as solutions for cluster management problems are routinely developed from scratch in the industry to solve largely similar problems across different settings. We propose DCM, a radically different architecture where developers specify the cluster manager’s behavior declaratively, using SQL queries over cluster state stored in a relational database. From the SQL speciﬁcation, the DCM compiler synthesizes a program that, at runtime, can be invoked to compute policy-compliant cluster management decisions given the latest cluster state. Under the covers, the generated program efﬁciently encodes the cluster state as an optimization problem that can be solved using off-the-shelf solvers, freeing developers from having to design ad-hoc heuristics. We show that DCM signiﬁcantly lowers the barrier to building scalable and extensible cluster managers. We validate our claim by powering three production-grade systems with it: a Kubernetes scheduler, a virtual machine management solu-tion, and a distributed transactional datastore.", "venue": "", "year": null, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "2258740767", "name": "Systems Design"}, {"authorId": "49060428", "name": "L. Suresh"}, {"authorId": "2279802", "name": "João Loff"}, {"authorId": "2285057327", "name": "Sangeetha Abdu"}, {"authorId": "2285065760", "name": "UC Irvine Jyothi"}, {"authorId": "2701535", "name": "Nina Narodytska"}, {"authorId": "3150866", "name": "L. Ryzhyk"}, {"authorId": "145953481", "name": "Sahan Gamage"}, {"authorId": "1724602", "name": "B. Oki"}, {"authorId": "2294740445", "name": "Pranshu Jain"}, {"authorId": "2037726405", "name": "Michael Gasch"}, {"authorId": "2295264935", "name": "VMware"}, {"authorId": "8124005", "name": "Faria Kalim"}, {"authorId": "37541666", "name": "S. Jyothi"}, {"authorId": "2295262680", "name": "Michael Gasch VMware"}], "citations": [{"paperId": "5edd96e34703b9a2654976f47f7249e3a0a10d5c", "title": "Acto: Automatic End-to-End Testing for Operation Correctness of Cloud System Management"}, {"paperId": "0d7b27efa885fbc5804ab84f23eca4b774fb32e5", "title": "Solver-In-The-Loop Cluster Resource Management for Database-as-a-Service"}, {"paperId": "89e3ad36f6de0b211504322232f7311e24e3f099", "title": "Meta-Migration: Reducing Switch Migration Tail Latency Through Competition"}, {"paperId": "3da9ab4c73021e3d9eee8f6a126037ec3eea957a", "title": "Scaling a Declarative Cluster Manager Architecture with Query Optimization Techniques"}, {"paperId": "710a291c72b067f189d9b71faa133405f31a9fd5", "title": "ESCHER: expressive scheduling with ephemeral resources"}, {"paperId": "93a8ebf88d1c346c3276d604994e794aa7ab25d1", "title": "Shard Manager: A Generic Shard Management Framework for Geo-distributed Applications"}, {"paperId": "4047054936ac60b7562b28d2551319ab76ce7364", "title": "RAS: Continuously Optimized Region-Wide Datacenter Resource Allocation"}, {"paperId": "9788be8e79cc5977a52c826fae4d3335b3804ded", "title": "Solving Large-Scale Granular Resource Allocation Problems Efficiently with POP"}, {"paperId": "bd1b4081cfc2d703f93088482bd526be24f6178c", "title": "TACC: A Full-stack Cloud Computing Infrastructure for Machine Learning Tasks"}, {"paperId": "5d5cadb079587ce7222dd7b16997f102e9fdc942", "title": "DBOS: A DBMS-oriented Operating System"}, {"paperId": "a3b5b602dbc0f9947539485137c705bde49b2344", "title": "Don't Give Up on Large Optimization Problems; POP Them!"}, {"paperId": "05ad5e6c697f33dea3f614606bc4cb6e5bcac14d", "title": "Scaling a Declarative Cluster Manager Architecture with Query Optimization Techniques (Technical Report)"}, {"paperId": "82a211b414d73a36fb399dbc8bae43ec6316af8d", "title": "A Progress Report on DBOS: A Database-oriented Operating System"}, {"paperId": "1f06b2874b0ade64aa3b2dbb5619affac45bb9d9", "title": "This paper is included in the Proceedings of the 17th USENIX Symposium on Operating Systems Design and Implementation."}]}
