{"paperId": "a2b7d4c790e27c90c79e5e905b2ffdbd400b97bc", "publicationVenue": {"id": "0730105a-4941-449f-9450-28cba8ae056b", "name": "ACM Transactions on Software Engineering and Methodology", "type": "journal", "alternate_names": ["ACM Trans Softw Eng Methodol"], "issn": "1049-331X", "url": "http://www.acm.org/pubs/contents/journals/tosem/", "alternate_urls": ["https://tosem.acm.org/", "http://tosem.acm.org/", "http://www.acm.org/pubs/tosem/", "http://portal.acm.org/tosem"]}, "title": "Visualizing Distributed System Executions", "abstract": "Distributed systems pose unique challenges for software developers. Understanding the system’s communication topology and reasoning about concurrent activities of system hosts can be difficult. The standard approach, analyzing system logs, can be a tedious and complex process that involves reconstructing a system log from multiple hosts’ logs, reconciling timestamps among hosts with non-synchronized clocks, and understanding what took place during the execution encoded by the log. This article presents a novel approach for tackling three tasks frequently performed during analysis of distributed system executions: (1) understanding the relative ordering of events, (2) searching for specific patterns of interaction between hosts, and (3) identifying structural similarities and differences between pairs of executions. Our approach consists of XVector, which instruments distributed systems to capture partial ordering information that encodes the happens-before relation between events, and ShiViz, which processes the resulting logs and presents distributed system executions as interactive time-space diagrams. Two user studies with a total of 109 students and a case study with 2 developers showed that our method was effective, helping participants answer statistically significantly more system-comprehension questions correctly, with a very large effect size.", "venue": "ACM Transactions on Software Engineering and Methodology", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-03-04", "journal": {"name": "ACM Transactions on Software Engineering and Methodology (TOSEM)", "pages": "1 - 38", "volume": "29"}, "authors": [{"authorId": "2637596", "name": "Ivan Beschastnikh"}, {"authorId": "2158327015", "name": "P. Liu"}, {"authorId": "2079770192", "name": "Albert Xing"}, {"authorId": "49830789", "name": "Patty Wang"}, {"authorId": "2932798", "name": "Yuriy Brun"}, {"authorId": "6698059", "name": "Michael D. Ernst"}], "citations": [{"paperId": "c0ec3daa6dde2885ffadb2953a98e98facef974e", "title": "Development of a Visualization for Developers of a Distributed System Including Idle Computers"}, {"paperId": "d910f6afe9448a3138e182fcba84a7e9f317a63e", "title": "ServiceAnomaly: An anomaly detection approach in microservices using distributed traces and profiling metrics"}, {"paperId": "6259ad4d0992252b72b0e6af0d19b03ddcba6d9e", "title": "Blueprint: A Toolchain for Highly-Reconfigurable Microservice Applications"}, {"paperId": "049134632809f2272efa514f31455445c0dd719e", "title": "Visualizing Kubernetes Distributed Systems: An Exploratory Study"}, {"paperId": "4c406487a08e0b30f5b99b051359f1dcc5003c60", "title": "Adonis: Practical and Efficient Control Flow Recovery through OS-Level Traces"}, {"paperId": "cf2279dd7fad7118600ea4c2a0dd85073a15ac2d", "title": "Cyclic Code Word Embedding and Chi-Squared Test-Based Attention Mechanism for Deep Learning-Based Server Fault Detection*"}, {"paperId": "3a98bd9252da2e69aa6ffea40f01e2d5bd30e621", "title": "Greybox Fuzzing of Distributed Systems"}, {"paperId": "7ca921521cbc8f5875450b5ea873fd0e6d70320b", "title": "Enhancing Trace Visualizations for Microservices Performance Analysis"}, {"paperId": "4fcc9b8fc6ad6b9ea4075c9b96b8007a69f6be54", "title": "An interview study about the use of logs in embedded software engineering"}, {"paperId": "c5336395d3e30c3328c4300d5f4ad5ff7fd1cccc", "title": "A Qualitative Interview Study of Distributed Tracing Visualisation: A Characterisation of Challenges and Opportunities."}, {"paperId": "1af61c85a4e7da5db54e11c5713c1f2fb0cf9cf2", "title": "Compiling Distributed System Models with PGo"}, {"paperId": "6339aba25847afe9934c5c3e76ca40e0bac635f8", "title": "See it to believe it?: the role of visualisation in systems research"}, {"paperId": "10bb7aa962cc77922299b49b22f2deff57b2cb03", "title": "Web-Based Tracing for Model-Driven Applications"}, {"paperId": "72523e63926167be4e9ff30c55a03ab43d51e920", "title": "DeLag: Using Multi-Objective Optimization to Enhance the Detection of Latency Degradation Patterns in Service-Based Systems"}, {"paperId": "d91aad4815479df3ec2f96ad7b6bfbad8af8c0e3", "title": "Visual Analysis of Hyperproperties for Understanding Model Checking Results"}, {"paperId": "998cd4d8e9e9cf21adc983a042feaaab53389df8", "title": "Horus: Non-Intrusive Causal Analysis of Distributed Systems Logs"}, {"paperId": "46d96223dd5fdcbb1b370a20b794efea41e73367", "title": "An Interview Study of how Developers use Execution Logs in Embedded Software Engineering"}, {"paperId": "172d00e6bffdb249b816286ed49906672bfb5ffa", "title": "Daisen: A Framework for Visualizing Detailed GPU Execution"}, {"paperId": "22ea3cd56bfbad81e7a7f8d024e710d06f2a2e5d", "title": "Blindspots in Python and Java APIs Result in Vulnerable Code"}, {"paperId": "84fd2ad315d61688baf5c6b81d9b1b9d9bf8d467", "title": "Fault Injection Analytics: A Novel Approach to Discover Failure Modes in Cloud-Computing Systems"}, {"paperId": "bf8bda70ec2fd657d0d253c3fbfd43d54825c357", "title": "Better state pictures facilitating state machine characteristic conjecture"}, {"paperId": "ceed446b05eb95785578ed7407d34a5e7ec8b2c8", "title": "Detecting Latency Degradation Patterns in Service-based Systems"}, {"paperId": "5934c71087282dd94f15baafedbb6465a5009bb9", "title": "Distributed System Fuzzing"}, {"paperId": "1e1632d37b540082211dd54978640b1408e131ea", "title": "An Interactive Evaluation Framework for Graph-based Decision Procedures in Directed Dynamic Networks"}, {"paperId": "b2447d034028c2d6967d39cba849c485519ba7af", "title": "Distributed Computer Function Assisted Evaluation Based on Virtual Reality"}, {"paperId": "52b68a7fa23802360b3a327d0aaa5f6fefc217dc", "title": "Cronista: A multi-database automated provenance collection system for runtime-models"}, {"paperId": "2e4879061db4d8eec2f3937306d8654e32589989", "title": "I Don’t Know What You Did Last Summer: The Missing Role of Humans in Systems Research"}, {"paperId": "b225d6f98ab2fd83f1b254ed15df10f9a521c7a4", "title": "Dara the explorer : coverage based exploration for model checking of distributed systems in Go"}, {"paperId": "41eecd8a852c227e45f0b5f287ca0b0c7041ef0d", "title": "A Visual Formalisation of Verilog"}]}
