{"paperId": "a2b923f1af0b14f2512515e74ea23c7c591f89e3", "publicationVenue": {"id": "094f3ff3-fb67-4573-9f00-0852f0409d13", "name": "International Conference on Smart Cloud", "type": "conference", "alternate_names": ["SmartCloud", "Int Conf Smart Cloud"]}, "title": "A Versatile Event-Driven Data Model in HBase Database for Multi-source Data of Power Grid", "abstract": "As a column-oriented, distributed and high fault-tolerant database, HBase is gradually adopted by manufactory industry due to its huge capacity, fast random read and bulk processing performance. Power grid usually generates huge amount of data from multi-sources with hundreds of complicated data types. However, JOIN operation performance is low in HBase since it was not designed to serve relational queries as classic relational database. How to store the data to ensure a sufficient performance of JOIN operation and random read is the critical problem that must to be solved in HBase applications. In this paper, we proposed an event-driven HBase data model to resolve this problem. In our data model, each record of data is defined as a unique event that happened in power grid. Any type of data from any data sources can be distinguished in database. Therefore our data model can store multi-source data generated by power grid devices. In addition, JOIN operation is integrated in our data model, which improves the performance of reading data from multiple data sources. This is realized by designing a specific RowKey in tables. We also proposed a schema including a novel Virtual ColumnFamily, which resolves the compatibility problem of storing data from multi-sources. Virtual ColumnFamily is realized by designing specific qualifiers. To verify the effectiveness of our data model, we conducted empirical experiments on a Hadoop platform to compare our optimized schema and original schema. Experimental results showed that our data model ensures that our optimized schema performs better than the original schema based on original data model.", "venue": "International Conference on Smart Cloud", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2016-11-01", "journal": {"name": "2016 IEEE International Conference on Smart Cloud (SmartCloud)", "pages": "208-213"}, "authors": [{"authorId": null, "name": "Bin Liu"}, {"authorId": "2116511169", "name": "Yongxin Zhu"}, {"authorId": "2146409955", "name": "Chang Wang"}, {"authorId": "2109122440", "name": "Yufeng Chen"}, {"authorId": "2109026285", "name": "Tian Huang"}, {"authorId": "33816325", "name": "Weiwei Shi"}, {"authorId": "2145680138", "name": "Mengjun Li"}, {"authorId": "2761864", "name": "Yishu Mao"}], "citations": [{"paperId": "76bdc9dd875694307a8b6040e97ab96fa2de9fdc", "title": "Automatic SQL to HQL-NoSQL Querying using PostgreSQL and Integrated Hive-Hbase"}, {"paperId": "05d7630f93f8f7322a7f565e0aa45e87ec91ba14", "title": "A Novel Architecture to Integrate Multi-Source Data into Distributed Environment using Big Data Infrastructure"}, {"paperId": "a4772b7a5d7f27abb8bfde030df6488e535dad9d", "title": "High Performance Secondary Index Design for Complex Queries in Smart Grid System"}, {"paperId": "b3d6f2caaf9a1712188c2e5695f4b852f5daeb8e", "title": "A Dependable Time Series Analytic Framework for Cyber-Physical Systems of IoT-based Smart Grid"}, {"paperId": "607866aa2572df5b14488484704ff4ec10b0a8eb", "title": "A Performance-Improved and Storage-Efficient Secondary Index for Big Data Processing"}, {"paperId": "a6b2732d37d7215729380b5751e33b0d03eca1a3", "title": "An Interface for User-Centred Process and Correlation Between Large Datasets"}, {"paperId": "dae818c2cc2d2c7861b8997b1ac144010cf7d793", "title": "Big Data Storage Tools Using NoSQL Databases and Their Applications in Various Domains: A Systematic Review"}]}
