{"paperId": "a2b993c36c238ac3d33cd1e5269c0eb2acac5224", "publicationVenue": {"id": "c6840156-ee10-4d78-8832-7f8909811576", "name": "IEEE Transactions on Knowledge and Data Engineering", "type": "journal", "alternate_names": ["IEEE Trans Knowl Data Eng"], "issn": "1041-4347", "url": "https://www.computer.org/web/tkde", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=69"]}, "title": "Pushing ML Predictions Into DBMSs", "abstract": "In the past decade, many approaches have been suggested to execute ML workloads on a DBMS. However, most of them have looked at in-DBMS ML from a training perspective, whereas ML inference has been largely overlooked. We think that this is an important gap to fill for two main reasons: (1) in the near future, every application will be infused with some sort of ML capability; (2) behind every web page, application, and enterprise there is a DBMS, whereby in-DBMS inference is an appealing solution both for efficiency (e.g., less data movement), performance (e.g., cross-optimizations between relational operators and ML) and governance. In this article, we study whether DBMSs are a good fit for prediction serving. We introduce a technique for translating trained ML pipelines containing both featurizers (e.g., one-hot encoding) and models (e.g., linear and tree-based models) into SQL queries, and we compare in-DBMS performance against popular ML frameworks such as Sklearn and ml.net. Our experiments show that, when pushed inside a DBMS, trained ML pipelines can have performance comparable to ML frameworks in several scenarios, while they perform quite poorly on text featurization and over (even simple) neural networks.", "venue": "IEEE Transactions on Knowledge and Data Engineering", "year": 2023, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-04-24", "journal": {"name": "Ieee Transactions on Knowledge and Data Engineering", "pages": "10295 - 10308", "volume": "35"}, "authors": [{"authorId": "153660158", "name": "Matteo Paganelli"}, {"authorId": "49245285", "name": "Paolo Sottovia"}, {"authorId": "2149885883", "name": "Kwanghyun Park"}, {"authorId": "2192580", "name": "Matteo Interlandi"}, {"authorId": "2165249842", "name": "Francesco Guerra"}], "citations": [{"paperId": "49beab6faf0126d47e19fb781e1677742c150d9c", "title": "The Duck's Brain: Training and Inference of Neural Networks in Modern Database Engines"}]}
