{"paperId": "a2bd37c8595efc5c605b330d2f5b3efead7f1cef", "publicationVenue": {"id": "3096eb5c-d18c-4877-94cd-28edd3a9c357", "name": "International Journal of Environmental Research and Public Health", "type": "journal", "alternate_names": ["Int J Environ Res Public Health"], "issn": "1660-4601", "url": "http://www.mdpi.com/journal/ijerph/"}, "title": "Detection of COVID-19 in Chest X-ray Images: A Big Data Enabled Deep Learning Approach", "abstract": "Coronavirus disease (COVID-19) spreads from one person to another rapidly. A recently discovered coronavirus causes it. COVID-19 has proven to be challenging to detect and cure at an early stage all over the world. Patients showing symptoms of COVID-19 are resulting in hospitals becoming overcrowded, which is becoming a significant challenge. Deep learning’s contribution to big data medical research has been enormously beneficial, offering new avenues and possibilities for illness diagnosis techniques. To counteract the COVID-19 outbreak, researchers must create a classifier distinguishing between positive and negative corona-positive X-ray pictures. In this paper, the Apache Spark system has been utilized as an extensive data framework and applied a Deep Transfer Learning (DTL) method using Convolutional Neural Network (CNN) three architectures —InceptionV3, ResNet50, and VGG19—on COVID-19 chest X-ray images. The three models are evaluated in two classes, COVID-19 and normal X-ray images, with 100 percent accuracy. But in COVID/Normal/pneumonia, detection accuracy was 97 percent for the inceptionV3 model, 98.55 percent for the ResNet50 Model, and 98.55 percent for the VGG19 model, respectively.", "venue": "International Journal of Environmental Research and Public Health", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-09-27", "journal": {"name": "International Journal of Environmental Research and Public Health", "volume": "18"}, "authors": [{"authorId": "1476819061", "name": "Mazhar Javed Awan"}, {"authorId": "144769156", "name": "M. Bilal"}, {"authorId": "2090326025", "name": "Awais Yasin"}, {"authorId": "94514899", "name": "Haitham Nobanee"}, {"authorId": "35694486", "name": "N. Khan"}, {"authorId": "1768864", "name": "A. Zain"}], "citations": [{"paperId": "ee5fb7813ab5b87a3e7dc6de7c9a73172aa6e28b", "title": "Adventures in data analysis: a systematic review of Deep Learning techniques for pattern recognition in cyber-physical-social systems"}, {"paperId": "52388bf7554fdaa2ea92c9e530e4bafbe48bacc4", "title": "The use of artificial intelligence for delivery of essential health services across WHO regions: a scoping review"}, {"paperId": "abf12dbc20dda669bd4bce08077094a9dd2b98b7", "title": "HQDCNet: Hybrid Quantum Dilated Convolution Neural Network for detecting covid-19 in the context of Big Data Analytics"}, {"paperId": "275ea94f0bf9263e1fe60c71ee4d0c3d919ff2cc", "title": "Influential Factors, Enablers, and Barriers to Adopting Smart Technology in Rural Regions: A Literature Review"}, {"paperId": "c09e8bec9681718bc2deef88b08546ec209ce36a", "title": "Managing and Optimizing Big Data Workloads for On-Demand User Centric Reports"}, {"paperId": "8549f6e6ec5ef145cff82c064ef7598e85bb93ac", "title": "A Systematic Literature Review and Future Perspectives for Handling Big Data Analytics in COVID-19 Diagnosis"}, {"paperId": "8b1e9281dc7b0d164206a8a1f0a0514867449554", "title": "Medical Big Data and Artificial Intelligence for Healthcare"}, {"paperId": "f08454908fe1d0855549e85ab61c851944e32185", "title": "A Review: Image Processing Techniques’ Roles towards Energy-Efficient and Secure IoT"}, {"paperId": "8077ec7aad3bad27b63a79960ed8ee982c391ce9", "title": "DTLCx: An Improved ResNet Architecture to Classify Normal and Conventional Pneumonia Cases from COVID-19 Instances with Grad-CAM-Based Superimposed Visualization Utilizing Chest X-ray Images"}, {"paperId": "ef39a43316f41cc38ed132cca7182b03eddc70e3", "title": "An End-to-End Data-Adaptive Pancreas Segmentation System with an Image Quality Control Toolbox"}, {"paperId": "d14ea4dc28b100eddc8f5a9c2b2bb91208b83aea", "title": "Comparison of diagnostic accuracy of the artificial intelligence system with human readers in the diagnosis of portable chest x-rays during the COVID-19 pandemic"}, {"paperId": "c0daac4c45edc08e4df0a0b5d665d11bdc269530", "title": "Chest X-Ray Images to Differentiate COVID-19 from Pneumonia with Artificial Intelligence Techniques"}, {"paperId": "56aeff5eab25ea155f029c6d3d01f7410214fe85", "title": "Spatial–Temporal Synchronous Graph Transformer network (STSGT) for COVID-19 forecasting"}, {"paperId": "b68bc59f3381673aeea14087cb37209c9968cd63", "title": "Application of artificial intelligence in diagnosing COVID-19 disease symptoms on chest X-rays: A systematic review"}, {"paperId": "052759d2afe32e251036546f5d29c5ffe26e7a3a", "title": "Performance Evaluation of Data Augmentation for Object Detection in XView Dataset"}, {"paperId": "da84ab9890d9156c71e23f6d81ab0cd501047588", "title": "Utility of an Automated Artificial Intelligence Echocardiography Software in Risk Stratification of Hospitalized COVID-19 Patients"}, {"paperId": "a54248656390ff64fa6080d2252c9997265fef75", "title": "Real-Time Facemask Detection for Preventing COVID-19 Spread Using Transfer Learning Based Deep Neural Network"}, {"paperId": "29fc9a3528fde6a93da7f9c39f9f4c3f83d0a3c0", "title": "Performance Analysis for COVID-19 Diagnosis Using Custom and State-of-the-Art Deep Learning Models"}, {"paperId": "0c6eee61b8bbd7073546e2edbde3b7d8f61f6263", "title": "Chest X-ray and CT Scan Classification using Ensemble Learning through Transfer Learning"}, {"paperId": "41e0737402fff56e1dd8ce9a946e1aac32e93081", "title": "Threat Analysis and Distributed Denial of Service (DDoS) Attack Recognition in the Internet of Things (IoT)"}, {"paperId": "49fa61815059bd0104ab6803f80803fe6addb6b9", "title": "Automated Knee MR Images Segmentation of Anterior Cruciate Ligament Tears"}, {"paperId": "d6cf6a018e0abcb094235f3b809aa5dc1a01f599", "title": "Harris Hawks Sparse Auto-Encoder Networks for Automatic Speech Recognition System"}, {"paperId": "fb83d83e70455a4f2c401be2682a83df9586c20d", "title": "Big Data COVID-19 Systematic Literature Review: Pandemic Crisis"}, {"paperId": "1f03a9639111ebbde9c9e14b861610f15213a903", "title": "A Dual-Stage Vocabulary of Features (VoF)-Based Technique for COVID-19 Variants’ Classification"}, {"paperId": "b8a4a9d1cbae8d38751f573fd02cb1f266337aec", "title": "Blockchain-Based IoT Devices in Supply Chain Management: A Systematic Literature Review"}, {"paperId": "5a41a32b3d4f0036d3dfe67cd0e51baa3afeb5a3", "title": "Improved Deep Convolutional Neural Network to Classify Osteoarthritis from Anterior Cruciate Ligament Tear Using Magnetic Resonance Imaging"}, {"paperId": "148ccc25a3c24feb63235bc7011fb6593d486d99", "title": "Image-Based Malware Classification Using VGG19 Network and Spatial Convolutional Attention"}, {"paperId": "2a54de90a1241ac58eba3825e56e82bb00943905", "title": "Suicide Bomb Attack Identification and Analytics through Data Mining Techniques"}, {"paperId": "f2e273e6d000fc640e8af109e3e8102eb81a130b", "title": "Real-Time DDoS Attack Detection System Using Big Data Approach"}, {"paperId": "09c4bd6d6e0b0509869b9d0cbdd6f5e886b3e8e3", "title": "UTILITY OF AN AUTOMATED ARTIFICIAL INTELLIGENCE ECHOCARDIOGRAPHY SOFTWARE IN RISK STRATIFICATION OF HOSPITALIZED COVID-19 PATIENTS"}, {"paperId": "be88b9326b18bb804b53a9ae9abac638c192dab1", "title": "Journal Pre-proof Spatial–temporal synchronous graph transformer network (STSGT) for COVID-19 forecasting"}]}
