{"paperId": "a2da5c3b847bebf43cb286876eb386145a244034", "publicationVenue": null, "title": "Structural and functional model of the digital monitoring system for the enterprise in Industry 4.0", "abstract": "The conditions for doing business in Russia are characterized by a significant level of uncertainty, volatility and general instability in the context of the transition to the sixth technological order and the development of Industry 4.0. This business environment makes it difficult to solve the problem of the availability of reliable information that can be used to make management decisions. In such situation, the results can be achieved using the principles of end-to-end, unified management of the entire industrial enterprise. These principles make it possible to optimize the available resources and achieve the planned results using digital monitoring systems of industrial enterprises. This makes relevant the research in the field of their development. The purpose of this work is to develop the structural and functional model of a digital monitoring system for an enterprise in Industry 4.0. The paper gives the definition of the digital monitoring system. This work also identifies the goals of industrial enterprises that can be achieved through the introduction of digital production monitoring systems. Based on the identified tasks, the characteristics of the digital monitoring system have been determined. The structural and functional model of the digital monitoring system has been developed. The assessment of the impact of the digital monitoring system on improving the efficiency of the enterprise has been carried out. The work was based on the materials of the practical industrial conference \"Effective Production 4.0\", which was held online in 2021 and attracted the leaders of the industrial industry. The research materials can be used in practice and are especially relevant for the Chief Data Officer. The area for further research is the analysis of real cases of implementing a digital monitoring system in industry 4.0 and the assess of their effectiveness.", "venue": "3rd International Scientific Conference on Innovations in Digital Economy", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Book", "Conference"], "publicationDate": "2021-10-14", "journal": {"name": "Proceedings of the 3rd International Scientific Conference on Innovations in Digital Economy"}, "authors": [{"authorId": "2100919821", "name": "Alexander Babkin"}, {"authorId": "2075006799", "name": "N. Alekseeva"}, {"authorId": "65955859", "name": "E. Shkarupeta"}, {"authorId": "2052012378", "name": "Guljakhon Makhmudova"}], "citations": [{"paperId": "3da535ebfdd72aadb14f0897f76257f0095ad6df", "title": "SPECIFICS IN THE FUNCTIONING OF A DIGITAL ENTERPRISE"}]}
