{"paperId": "a2eb0453f64f4ea97ffc0ba4dde53888762b768d", "publicationVenue": {"id": "1e33b3be-b2ab-46e9-96e8-d4eb4bad6e44", "name": "Annual Meeting of the Association for Computational Linguistics", "type": "conference", "alternate_names": ["Annu Meet Assoc Comput Linguistics", "Meeting of the Association for Computational Linguistics", "ACL", "Meet Assoc Comput Linguistics"], "url": "https://www.aclweb.org/anthology/venues/acl/"}, "title": "Improving the Detection of Multilingual Online Attacks with Rich Social Media Data from Singapore", "abstract": "Toxic content is a global problem, but most resources for detecting toxic content are in English. When datasets are created in other languages, they often focus exclusively on one language or dialect. In many cultural and geographical settings, however, it is common to code-mix languages, combining and interchanging them throughout conversations. To shine a light on this practice, and enable more research into code-mixed toxic content, we introduce SOA, a new multilingual dataset of online attacks. Using the multilingual city-state of Singapore as a starting point, we collect a large corpus of Reddit comments in Indonesian, Malay, Singlish, and other languages, and provide fine-grained hierarchical labels for online attacks. We publish the corpus with rich metadata, as well as additional unlabelled data for domain adaptation. We share comprehensive baseline results, show how the metadata can be used for granular error analysis, and demonstrate the benefits of domain adaptation for detecting multilingual online attacks.", "venue": "Annual Meeting of the Association for Computational Linguistics", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": null, "journal": {"pages": "12705-12721"}, "authors": [{"authorId": "134167565", "name": "J. Haber"}, {"authorId": "2737827", "name": "Bertie Vidgen"}, {"authorId": "2167794537", "name": "M. Chapman"}, {"authorId": "153758068", "name": "Vibhor Agarwal"}, {"authorId": "38656724", "name": "R. Lee"}, {"authorId": "1742123174", "name": "Yong Keong Yap"}, {"authorId": "2043232919", "name": "Paul Röttger"}], "citations": []}
