{"paperId": "a2f0971b7f4d7c7d58e00492284985d2ac6c0d03", "publicationVenue": {"id": "d13e941e-4cac-4f1d-bdca-77d927e31f1b", "name": "ACM Symposium on Cloud Computing", "type": "conference", "alternate_names": ["System-on-Chip Conference", "ACM Symp Cloud Comput", "Syst Conf", "Symp Cloud Comput", "Annual IEEE International System-on-Chip Conference", "Symposium on Cloud Computing", "Annu IEEE Int Syst Conf", "SoCC"], "url": "http://www.ieee-socc.org/"}, "title": "Multi-Query Optimization in Wide-Area Streaming Analytics", "abstract": "Wide-area data analytics has gained much attention in recent years due to the increasing need for analyzing data that are geographically distributed. Many of such queries often require real-time analysis on data streams that are continuously being generated across multiple locations. Yet, analyzing these geo-distributed data streams in a timely manner is very challenging due to the highly heterogeneous and limited bandwidth availability of the wide-area network (WAN). This paper examines the opportunity of applying multi-query optimization in the context of wide-area streaming analytics, with the goal of utilizing WAN bandwidth efficiently while achieving high throughput and low latency execution. Our approach is based on the insight that many streaming analytics queries often exhibit common executions, whether in consuming a common set of input data or performing the same data processing. In this work, we study different types of sharing opportunities and propose a practical online algorithm that allows streaming analytics queries to share their common executions incrementally. We further address the importance of WAN awareness in applying multi-query optimization. Without WAN awareness, sharing executions in a wide-area environment may lead to performance degradation. We have implemented our WAN-aware multi-query optimization in a prototype implementation based on Apache Flink. Experimental evaluation using Twitter traces on a real wide-area system deployment across geo-distributed EC2 data centers shows that our technique is able to achieve 21% higher throughput while saving WAN bandwidth consumption by 33% compared to a WAN-aware, sharing-agnostic system.", "venue": "ACM Symposium on Cloud Computing", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2018-10-11", "journal": {"name": "Proceedings of the ACM Symposium on Cloud Computing"}, "authors": [{"authorId": "3418111", "name": "A. Jonathan"}, {"authorId": "144114650", "name": "A. Chandra"}, {"authorId": "1750436", "name": "J. Weissman"}], "citations": [{"paperId": "63bf88c36592e02afc0dfbd3f78c8558bf75d7f8", "title": "Decaffe: DHT Tree-Based Online Federated Fake News Detection"}, {"paperId": "b06e2791108cd160b9d0a244e086c9dff1ad97ce", "title": "Plexus: Optimizing Join Approximation for Geo-Distributed Data Analytics"}, {"paperId": "e25a4ece79160c9817a38e80f77d729ca7487d48", "title": "GeaFlow: A Graph Extended and Accelerated Dataflow System"}, {"paperId": "fe81557cb5e2d67303528f0139f75daf300334ba", "title": "AggFirstJoin: Optimizing Geo-Distributed Joins using Aggregation-Based Transformations"}, {"paperId": "e826268209f603e176688ea91e2200ad0252c19b", "title": "Query Latency Optimization by Resource-Aware Task Placement in Fog"}, {"paperId": "4b800119b57bf66a66873765e621c94c92a93c93", "title": "Delay-Resistant Geo-Distributed Analytics"}, {"paperId": "955442a721a0c324c2cbf379de030653c6376938", "title": "A survey on Automatic Query Optimization Approaches in Multi Store Systems for Big Data Analytics"}, {"paperId": "dc13954d35376f499301dd8545a6599ed513756a", "title": "Network-aware worker placement for wide-area streaming analytics"}, {"paperId": "c6002247dee39ff91db2b646d8f2dd375cbb0a43", "title": "Towards WAN-aware join sampling over geo-distributed data"}, {"paperId": "6adf085a118f2a1291667b308d5c42564e2362e6", "title": "Jarvis: Large-scale Server Monitoring with Adaptive Near-data Processing"}, {"paperId": "79df48329759ad250b348f6e97a6c6b0d5703cda", "title": "A reliable concurrent multicast algorithm for content distribution"}, {"paperId": "8f1acde3b9d7f3983c8d928a36a85776b0d33ad6", "title": "AggNet: Cost-Aware Aggregation Networks for Geo-distributed Streaming Analytics"}, {"paperId": "7ca28f9045a5cbfe98cd945a5958a50af1556f76", "title": "A Survey of IoT Stream Query Execution Latency Optimization within Edge and Cloud"}, {"paperId": "8c68ba842187073049e5f81001f65725ca5383a2", "title": "On the Future of Cloud Engineering"}, {"paperId": "d0137f41e2388ba5b01c61d31ecedbc2e4a73963", "title": "Hone: Mitigating Stragglers in Distributed Stream Processing With Tuple Scheduling"}, {"paperId": "92fd7d63a3d5993e645ceb284606782b54d12b18", "title": "A Unified Approach to Spatial Proximity Query Processing in Dynamic Spatial Networks"}, {"paperId": "6cb589df0a67ae1d91a71bd6c8a37d95a0d0cf6e", "title": "Model-based Stream Processing Auto-scaling in Geo-Distributed Environments"}, {"paperId": "9ead5d36c42398ed41d33dcc330114fd1cb8664b", "title": "Optimizing Multiple Multi-Way Stream Joins"}, {"paperId": "ea4e321de6163db57106757119c90c308a51c5e0", "title": "A survey on bandwidth-aware geo-distributed frameworks for big-data analytics"}, {"paperId": "e583b9c586b8b8be97600dd4295c7ed608cf0b83", "title": "WASP: Wide-area Adaptive Stream Processing"}, {"paperId": "910ce01a561d5d0346a4305a80ca45ccfcab7f21", "title": "Poster: Data-Aware Edge Sampling for Aggregate Query Approximation"}, {"paperId": "134785fbfd860dda6573c23978d535cceb1386c1", "title": "Shared Execution Techniques for Business Data Analytics over Big Data Streams"}, {"paperId": "9295fc01d09d39f6e012059fb2213d1a06fdf56e", "title": "DLion: Decentralized Distributed Deep Learning in Micro-Clouds"}, {"paperId": "aaf6e32084f2344319c37e7de79825de33e5cabf", "title": "GeoClone: Online Task Replication and Scheduling for Geo-Distributed Analytics under Uncertainties"}, {"paperId": "d7b26530dca02416d386c9523996d55157943203", "title": "Deadline-Aware Fast One-to-Many Bulk Transfers over Inter-Datacenter Networks"}, {"paperId": "5e426575b42bc9e180cde926cc6e1874866c6152", "title": "Task Scheduling for Streaming Applications in a Cloud-Edge System"}, {"paperId": "9c073d3579173fc923ee6f0bfeb669c784af9969", "title": "Query-Driven Descriptive Analytics for IoT and Edge Computing"}, {"paperId": "205eefb8ae07cf81fc28daf3ceae0e440665ca95", "title": "A TTL-based Approach for Data Aggregation in Geo-distributed Streaming Analytics"}, {"paperId": "5ae6c13cfeda6c15f0c26d2d66af734e9a21d188", "title": "A TTL-based Approach for Data Aggregation in Geo-distributed Streaming Analytics"}, {"paperId": "e140ff9bc1bd92c3b107c228ebf6accfcd9b643d", "title": "A Hybrid Multi-Query Optimization Technique Combining Sub-Expression and Materialized View Reuse"}, {"paperId": "1b70fda3d7457311b7bcdf869298f3f0b50e6cc4", "title": "Research on Indexing and KNN Query of Moving Objects in Road Network Environment"}, {"paperId": "9649d31f4d3bc740c95400e11be9759b259b2083", "title": "Group Processing of Multiple k-Farthest Neighbor Queries in Road Networks"}, {"paperId": "eceac70cfd6ed56eccb0c113a043e10116e80ff1", "title": "DeCaf: Iterative Collaborative Processing over the Edge"}, {"paperId": "03b4091fd8d01561d004ee19893fb99e7bde9473", "title": "Measuring the Amazon Web Services (AWS) WAN Infrastructure"}, {"paperId": "4ce94150229fc638c2cedecdc10bff425a07f530", "title": "DLion : Decentralized Distributed Deep Learning in Micro-Clouds Rankyung Hong University of Minnesota"}]}
