{"paperId": "a30259926120393ee08378ab58ab1bc2f562b6fb", "publicationVenue": {"id": "7c9d091e-015e-4e5d-a11f-9bc369fcf414", "name": "IEEE Transactions on Parallel and Distributed Systems", "type": "journal", "alternate_names": ["IEEE Trans Parallel Distrib Syst"], "issn": "1045-9219", "url": "http://www.computer.org/tpds", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=71"]}, "title": "Silhouette: Efficient Cloud Configuration Exploration for Large-Scale Analytics", "abstract": "Choosing the best cloud configuration for large-scale data analytics jobs deployed in the cloud can substantially improve their performance and reduce costs. However, current cloud providers offer a wide variety of instance types and customized cluster sizes, making it both time-consuming and costly to pinpoint the optimal cloud configuration. This article presents the design, implementation, and evaluation of Silhouette, a cloud configuration selection framework based on performance models for various large-scale analytics jobs with minimal training overhead. The essence of Silhouette is to build performance prediction models with carefully selected small-scale experiments on small subsets of input data to estimate the performance with entire input data on larger cluster sizes. To reduce the training time and cost, Silhouette incorporates new statistical techniques to select those experiments that yield the best possible information for performance prediction. Moreover, we develop a novel model transformer to convert a prediction model built on one instance type to a different instance type with only one extra experiment, which significantly reduces the training overhead. We evaluate Silhouette with an extensive array of large-scale data analytics jobs on Amazon EC2. Our experimental results have shown convincing evidence that Silhouette is effective in optimizing cloud configuration while saving both training time and costs compared with existing solutions.", "venue": "IEEE Transactions on Parallel and Distributed Systems", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-08-01", "journal": {"name": "IEEE Transactions on Parallel and Distributed Systems", "pages": "2049-2061", "volume": "32"}, "authors": [{"authorId": "1684546", "name": "Yanjiao Chen"}, {"authorId": "2111062900", "name": "Long Lin"}, {"authorId": "91269142", "name": "Baochun Li"}, {"authorId": "2155616270", "name": "Qian Wang"}, {"authorId": "2145946371", "name": "Qian Zhang"}], "citations": [{"paperId": "7fbb73f3e61ed9ab1f18d0290082729a46ca36cd", "title": "Towards a Peer-to-Peer Data Distribution Layer for Efficient and Collaborative Resource Optimization of Distributed Dataflow Applications"}, {"paperId": "0f3b97eb980a9d4f07d606d5f483055e1ca178bd", "title": "Karasu: A Collaborative Approach to Efficient Cluster Configuration for Big Data Analytics"}, {"paperId": "742b3ede9a93f166e695ebedfc1bb060b60457ff", "title": "Selecting Efficient Cluster Resources for Data Analytics: When and How to Allocate for In-Memory Processing?"}, {"paperId": "6764cde98b09b35ed212e4bd01483176eac2787f", "title": "Predicting the Performance-Cost Trade-off of Applications Across Multiple Systems"}, {"paperId": "be85aacbd95d7b19ec5d274a6f65c89be4fdf16c", "title": "Legacy Data Center Network (DCN) Reviewed: considering Big Data Stream Mobile Computing (BDSMC) applications"}, {"paperId": "6a9bfc08af212ca74c6546e3fa57efa7a0bd8d43", "title": "Perona: Robust Infrastructure Fingerprinting for Resource-Efficient Big Data Analytics"}, {"paperId": "23a6e0bd5ef9e9deeb0b939b1521b97dc54a0707", "title": "Ruya: Memory-Aware Iterative Optimization of Cluster Configurations for Big Data Processing"}, {"paperId": "f39f58a1d77880e372907763f502931b7b0cc2f1", "title": "Efficient and Automated Deployment Architecture for OpenStack in TianHe SuperComputing Environment"}, {"paperId": "7d434537cce3fd903e1ba09e694895fbe3628cbc", "title": "Get Your Memory Right: The Crispy Resource Allocation Assistant for Large-Scale Data Processing"}, {"paperId": "e03ea5c2a595596ab1eec6452e10277b60886df8", "title": "Cloud Object Storage Synchronization: Design, Analysis, and Implementation"}]}
