{"paperId": "a3076cd3b4fd4795b46bc44816fe3adb9ec0abe1", "publicationVenue": {"id": "8dce23a9-44e0-4381-a39e-2acc1edff700", "name": "Annual International ACM SIGIR Conference on Research and Development in Information Retrieval", "type": "conference", "alternate_names": ["International ACM SIGIR Conference on Research and Development in Information Retrieval", "Int ACM SIGIR Conf Res Dev Inf Retr", "SIGIR", "Annu Int ACM SIGIR Conf Res Dev Inf Retr"], "url": "http://www.acm.org/sigir/"}, "title": "Efficient Graph Query Processing over Geo-Distributed Datacenters", "abstract": "Graph queries have emerged as one of the fundamental techniques to support modern search services, such as PageRank web search, social networking search and knowledge graph search. As such graphs are maintained globally and very huge (e.g., billions of nodes), we need to efficiently process graph queries across multiple geographically distributed datacenters, running geo-distributed graph queries. Existing graph computing frameworks may not work well for geographically distributed datacenters, because they implement a Bulk Synchronous Parallel model that requires excessive inter-datacenter transfers, thereby introducing extremely large latency for query processing. In this paper, we propose GeoGraph --a universal framework to support efficient geo-distributed graph query processing based on clustering datacenters and meta-graph, while reducing the inter-datacenter communication. Our new framework can be applied to many types of graph algorithms without any modification. The framework is developed on the top of Apache Giraph. The experiments were conducted by applying four important graph queries, i.e., shortest path, graph keyword search, subgraph isomorphism and PageRank. The evaluation results show that our proposed framework can achieve up to 82% faster convergence, 42% lower WAN bandwidth usage, and 45% less total monetary cost for the four graph queries, with input graphs stored across ten geo-distributed datacenters.", "venue": "Annual International ACM SIGIR Conference on Research and Development in Information Retrieval", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2020-07-25", "journal": {"name": "Proceedings of the 43rd International ACM SIGIR Conference on Research and Development in Information Retrieval"}, "authors": [{"authorId": "14886336", "name": "Ye Yuan"}, {"authorId": "13280872", "name": "Delong Ma"}, {"authorId": "1788122", "name": "Z. Wen"}, {"authorId": "150350246", "name": "Yuliang Ma"}, {"authorId": "8349792", "name": "Guoren Wang"}, {"authorId": "49330176", "name": "Lei Chen"}], "citations": [{"paperId": "28046efa97f66923b4e24072dc614333b99aeea6", "title": "RAGraph: A Region-Aware Framework for Geo-Distributed Graph Processing"}, {"paperId": "5539b450970872e1d2dc838252cf30a2f6526e22", "title": "HSCFC: High-dimensional streaming data clustering algorithm based on feedback control system"}, {"paperId": "9cf78f7e256600e94e6a12a693f88e6514d769af", "title": "PGPregel: an end-to-end system for privacy-preserving graph processing in geo-distributed data centers"}, {"paperId": "1f7649b2850ae7a0af02a14bc476185d5b02eda2", "title": "Unrestricted multi-hop reasoning network for interpretable question answering over knowledge graph"}, {"paperId": "58fd0178da20aca3fa16bcff3e0015722a995136", "title": "A parameter-free approach to lossless summarization of fully dynamic graphs"}, {"paperId": "49063d8fae4dd7375ed7679d9e2ee3f9a0e3cc62", "title": "Partition-Aware Graph Pattern Based Node Matching With Updates"}]}
