{"paperId": "a3186ecb8f7d1558b67baf1e37deca70bb043d3f", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Artificial Intelligence for Digital Agriculture at Scale: Techniques, Policies, and Challenges", "abstract": "Digital agriculture has the promise to transform agricultural throughput. It can do this by applying data science and engineering for mapping input factors to crop throughput, while bounding the available resources. In addition, as the data volumes and varieties increase with the increase in sensor deployment in agricultural fields, data engineering techniques will also be instrumental in collection of distributed data as well as distributed processing of the data. These have to be done such that the latency requirements of the end users and applications are satisfied. Understanding how farm technology and big data can improve farm productivity can significantly increase the world's food production by 2050 in the face of constrained arable land and with the water levels receding. While much has been written about digital agriculture's potential, little is known about the economic costs and benefits of these emergent systems. In particular, the on-farm decision making processes, both in terms of adoption and optimal implementation, have not been adequately addressed. For example, if some algorithm needs data from multiple data owners to be pooled together, that raises the question of data ownership. This paper is the first one to bring together the important questions that will guide the end-to-end pipeline for the evolution of a new generation of digital agricultural solutions, driving the next revolution in agriculture and sustainability under one umbrella.", "venue": "arXiv.org", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-01-21", "journal": {"name": "ArXiv", "volume": "abs/2001.09786"}, "authors": [{"authorId": "2228303", "name": "S. Chaterji"}, {"authorId": "122374645", "name": "Nathan D. DeLay"}, {"authorId": "2110280625", "name": "John V. Evans"}, {"authorId": "2093791429", "name": "Nathan Mosier"}, {"authorId": "48910269", "name": "B. Engel"}, {"authorId": "144144772", "name": "D. Buckmaster"}, {"authorId": "39403445", "name": "Ranveer Chandra"}], "citations": [{"paperId": "f67b9e4ceae91a5d38c2354c2d3fb36ea816bee2", "title": "The Application of Wireless Underground Sensor Networks to Monitor Seepage inside an Earth Dam"}, {"paperId": "d81432175109a5849500f130f258409001db3d62", "title": "Quantifying the Income-Increasing Effect of Digital Agriculture: Take the New Agricultural Tools of Smartphone as an Example"}, {"paperId": "1099e12b2b60a9082fe395658302d68f2dc37751", "title": "Systematic Literature Review: An overview of Digital Agriculture for Food Sustainability"}, {"paperId": "8eefa3a017f238699b56abfe6a1d03f26e9a917d", "title": "A functional framework based on big data analytics for smart farming"}, {"paperId": "2d87d98c726e90f7eb84c74339d341ffb20da082", "title": "Design and Evaluation of a Crowdsourcing Precision Agriculture Mobile Application for Lambsquarters, Mission LQ"}, {"paperId": "4f4ca209d99fd9ffe4f997900c1b5eb9c8303cec", "title": "Evaluation of water status of wheat genotypes to aid prediction of yield on sodic soils using UAV-thermal imaging and machine learning"}, {"paperId": "fbc3fced70e757119b1943738cf611aa51ab86cc", "title": "Trust-Based Opportunistic Network Offloaders for Smart Agriculture"}, {"paperId": "3832c79a7fca13a768a17c4d3766f4e0699e2e57", "title": "ApproxDet: content and contention-aware approximate object detection for mobiles"}, {"paperId": "0acd6d5dfdb0f89fdbaed0505e1830f73d926de8", "title": "JANUS: Benchmarking Commercial and Open-Source Cloud and Edge Platforms for Object and Anomaly Detection Workloads"}, {"paperId": "e04aec1e4fb0997cf0d9d89b925a8a33eaee0b0a", "title": "Early Development and Design of Crowdsourcing Agriculture Mobile Application for Lambsquarters"}, {"paperId": "52f9346aa9a83c24cdd84edbde7e6fc571a9ae5a", "title": "Hybrid Low-Power Wide-Area Mesh Network for IoT Applications"}, {"paperId": "4b0cec708ea29fbd2cf687bb9efc44fe6332f6b7", "title": "Indonesian Journal of Electrical Engineering and Computer Science"}, {"paperId": "3aecbf5dc447add5a51beadca372834a6a277af2", "title": "AgriFusion: An Architecture for IoT and Emerging Technologies Based on a Precision Agriculture Survey"}, {"paperId": "39a85de7cd0787d73c60bd6532b8cc7934a63c95", "title": "Systematic Literature"}]}
