{"paperId": "a33844af3ab5f75aae0c85a2c50dfd9a4b3a07fd", "publicationVenue": {"id": "e7c556b0-162f-4c48-9d25-fe3c141f984e", "name": "Big Data and Cognitive Computing", "alternate_names": ["Big Data Cogn Comput"], "issn": "2504-2289", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-1077183", "alternate_urls": ["https://www.mdpi.com/journal/BDCC", "https://www.mdpi.com/journal/BDCC/about", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-1077183"]}, "title": "Efficient Method for Continuous IoT Data Stream Indexing in the Fog-Cloud Computing Level", "abstract": "Internet of Things (IoT) systems include many smart devices that continuously generate massive spatio-temporal data, which can be difficult to process. These continuous data streams need to be stored smartly so that query searches are efficient. In this work, we propose an efficient method, in the fog-cloud computing architecture, to index continuous and heterogeneous data streams in metric space. This method divides the fog layer into three levels: clustering, clusters processing and indexing. The Density-Based Spatial Clustering of Applications with Noise (DBSCAN) algorithm is used to group the data from each stream into homogeneous clusters at the clustering fog level. Each cluster in the first data stream is stored in the clusters processing fog level and indexed directly in the indexing fog level in a Binary tree with Hyperplane (BH tree). The indexing of clusters in the subsequent data stream is determined by the coefficient of variation (CV) value of the union of the new cluster with the existing clusters in the cluster processing fog layer. An analysis and comparison of our experimental results with other results in the literature demonstrated the effectiveness of the CV method in reducing energy consumption during BH tree construction, as well as reducing the search time and energy consumption during a k Nearest Neighbor (kNN) parallel query search.", "venue": "Big Data and Cognitive Computing", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-14", "journal": {"name": "Big Data Cogn. Comput.", "pages": "119", "volume": "7"}, "authors": [{"authorId": "2133216105", "name": "K. Khettabi"}, {"authorId": "1888434", "name": "Zineddine Kouahla"}, {"authorId": "2044690", "name": "Brahim Farou"}, {"authorId": "1392623159", "name": "Hamid Seridi"}, {"authorId": "2864573", "name": "M. Ferrag"}], "citations": [{"paperId": "3b555269e653d061c51413fb61fac3c702c12309", "title": "E FFICIENT S TORAGE OF E TEROGENEOUS I O I D ATA IN A B LOCKCHAIN U SING AN I NDEXING M ETHOD IN M ETRIC S PACE"}]}
