{"paperId": "a347a37cedcfdc1e4b082d9a24c5e910b4f6716a", "publicationVenue": {"id": "c926b15f-075f-4a91-b367-74dab1ca709a", "name": "Jurnal Telekomunikasi dan Komputer", "alternate_names": ["J Telekomun dan Kompʹût"], "issn": "2085-4811", "url": "https://publikasi.mercubuana.ac.id/index.php/Incomtech"}, "title": "Implementasi Metode CNN Computer Vision Dalam Identifikasi Tipe Kerusakan Pohon Berbasis FHM", "abstract": "Identifikasi tipe kerusakan pohon pada Forest Health Monitoring hingga saat ini masih bersifat manual, yaitu menggunakan penglihatan manusia dalam penerapannya. Teknologi Informasi yang kini berkembang pesat dapat di rasakan hingga ke berbagai media penerapan ilmu pengetahuan, dengan demikian terciptalah salah satu solusi dalam memecahkan masalah penelitian kasus identifikasi tipe kerusakan pohon yaitu dengan penggunaan metode computer vision dalam upaya memudahkan pekerjaan dalam ilmu kehutanan. Tujuan penelitian ini adalah untuk menerapkan computer vision dalam mengidentifikasi tipe kerusakan pohon berbasis Forest Health Monitoring. Tahapan penelitian yang dilakukan dalam penelitian ini adalah pengumpulan dataset, proses preprocessing, pembagian dataset, pelatihan model, pengujian model dan terakhir adalah evaluasi model. Hasil penelitian ini berupa model (prototype) identifikasi tipe kerusakan pohon dalam 4 kategori yaitu, LeNet-5 Colab, LeNet-5 Tesla, MobileNet Colab, dan MobileNet Tesla. Persentase identifikasi model bervariasi, dimana pada kelas tertentu model dapat mengidentifikasi dengan benar dan dikelas lainnya masih ada beberapa identifikasi model yang kurang optimal, disebabkan oleh kemiripan beberapa bentuk dataset dalam segi visual komputer. Penelitian penerapan computer vision dalam identifikasi kerusakan pohon berbasis Forest Health Monitoring berhasil dilakukan dengan menghasilkan dua model (prototype) dalam identifikasi kerusakan pohon yang nilai akurasinya mencapai angka 89.99% pada model LeNet-5 dan 99.06% pada model MobileNet dengan tools yang digunakan adalah Jupyter notebook pada Nvidia Tesla K20 (offline) dan Google Colab (online).", "venue": "Jurnal Telekomunikasi dan Komputer", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-04-30", "journal": {"name": "InComTech : Jurnal Telekomunikasi dan Komputer"}, "authors": [{"authorId": "2089467359", "name": "Rahmat Safe’i"}, {"authorId": "2213236966", "name": "Zuhri Nopriyanto"}, {"authorId": "66287759", "name": "Rico Andrian"}, {"authorId": "2664276", "name": "Kurnia Muludi"}], "citations": [{"paperId": "ab5febcb0941c5146dbce445a9294473f39f87ff", "title": "Perancangan Aplikasi Konversi RGB CMYK berbasis Python"}]}
