{"paperId": "a34947a3c8c22131c82a5f96bc1cf51bf13b0763", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Enabling Artificial Intelligent Virtual Sensors in an IoT Environment", "abstract": "The demands for a large number of sensors increase as the proliferation of Internet of Things (IoT) and smart cities applications are continuing at a rapid pace. This also increases the cost of the infrastructure and the installation and maintenance overhead and creates significant performance degradation in the end-to-end communication, monitoring, and orchestration of the various connected devices. In order to solve the problem of increasing sensor demands, this paper suggests replacing physical sensors with machine learning (ML) models. These software-based artificial intelligence models are called virtual sensors. Extensive research and simulation comparisons between fourteen ML models provide a solid ground decision when it comes to the selection of the most accurate model to replace physical sensors, such as temperature and humidity sensors. In this problem at hand, the virtual and physical sensors are designed to be scattered in a smart home, while being connected and run on the same IoT platform. Thus, this paper also introduces a custom lightweight IoT platform that runs on a Raspberry Pi equipped with physical temperature and humidity sensors, which may also execute the virtual sensors. The evaluation results of the devised virtual sensors in a smart home scenario are promising and corroborate the applicability of the proposed methodology.", "venue": "Italian National Conference on Sensors", "year": 2023, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-01-24", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "23"}, "authors": [{"authorId": "2287157216", "name": "Georgios Stavropoulos"}, {"authorId": "2573061", "name": "John Violos"}, {"authorId": "91917010", "name": "Stylianos Tsanakas"}, {"authorId": "2386836", "name": "Aris Leivadeas"}], "citations": [{"paperId": "a488ec9d53d410945c9e63da120da5b6f3d095e6", "title": "A Survey of AI Techniques in IoT Applications with Use Case Investigations in the Smart Environmental Monitoring and Analytics in Real-Time IoT Platform"}, {"paperId": "b4400373c48a1f849d64e6e15966fe1a57ef8350", "title": "A data-driven simulation and Gaussian process regression model for hydraulic press condition diagnosis"}, {"paperId": "2bd525f2cf37c95e568598465a5551b838278a6a", "title": "Enhancing Virtual Sensors to deal with Missing Values and Low Sampling Rates"}, {"paperId": "ab8284ae46b4cfff06857e749245d8a147343fad", "title": "Development of a Platform for Monitoring the Levels of Dispersed Oxygen in River Components of a Water Supply Micro Basin Using Programmable Microcontrollers"}, {"paperId": "a02b98d7ab479d103f62dce700888c8350d8dc7b", "title": "In Situ IoT Development and Application for Continuous Water Monitoring in a Lentic Ecosystem in South Brazil"}]}
