{"paperId": "a352ebd90b578ec1edd46e4b2f49d21e7f2ec44e", "publicationVenue": {"id": "ccd6a358-7326-42a7-95e5-bd515c9b5e6c", "name": "Management Decision", "type": "journal", "alternate_names": ["Manag Decis"], "issn": "0025-1747", "url": "http://emeraldgrouppublishing.com/products/journals/journals.htm?id=jmh", "alternate_urls": ["https://www.emeraldinsight.com/loi/md", "http://www.emeraldinsight.com/0025-1747.htm"]}, "title": "Developing an effective data-led strategy: managing the enablers", "abstract": "PurposeDespite that a transformational shift has occurred in many organisations towards data-driven management, many organisations struggle to harness and translate new technology, such as “big data” into a competitive advantage. This study aims to undertake an empirical investigation into the enabling factors which lead to the practice of formulating an effective data-led strategy (EDLS). Leveraging the theoretical lenses of the resource-based view, absorptive capacity and attention-focus view, a range of various factors are hypothesised to influence EDLS.Design/methodology/approachThe study takes place in South Africa and is based on primary survey data focused on the Fin-tech industry sector where the need to formulate and implement an EDLS has become urgent considering the move to technology enabled banking solutions. Partial Least Squares Structural Equation Modelling (PLS-SEM) is used to test the hypotheses.FindingsResults highlight that several factors are related to EDLS as significant predictors, which include the data platform, technical skills, knowledge management, transformation and focus-alignment. This latter factor has the largest influence on EDLS, which suggests that the alignment of focus across multiple firm divisions both vertically and horizontally significantly enables an EDLS.Practical implicationsManagers need to appreciate the intricacy of the range of factors involved in enabling an EDLS. Managers are advised to grow their organisational knowledge regarding which enablers offer the best pathway towards the development of a more robust framework when putting an EDLS into practice.Originality/valueThe article offers new insights into better understanding the relevant antecedents which enable the successful practice of an EDLS from an African emerging market perspective.", "venue": "Management Decision", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2024-01-05", "journal": {"name": "Management Decision"}, "authors": [{"authorId": "2266204181", "name": "Boris Urban"}, {"authorId": "2277805470", "name": "Jefferson Chen"}, {"authorId": "2277797980", "name": "Gavin Reuben"}], "citations": []}
