{"paperId": "a356de27c5089b38df0a9298b48b74a02b46c267", "publicationVenue": {"id": "b24455f0-c8b2-4062-8397-1dc279bf6407", "name": "International Conference on Evaluation & Assessment in Software Engineering", "type": "conference", "alternate_names": ["Int Conf Evaluation  Assess Softw Eng", "EASE", "Evaluation Assess Softw Eng", "Evaluation and Assessment in Software Engineering"]}, "title": "SIOT-RIMM: Towards Secure IOT-Requirement Implementation Maturity Model", "abstract": "It is very crucial for an organization to encapsulate the requirements in its early stage when they are intending to build a novel system such as the internet of things (IoT), particularly when it comes to capturing privacy and security requirements to gain the public confidence. The proposed research is focused to develop a secure IoT-requirement implementation maturity model (SIOT-RIMM). The proposed model will assist the software development organizations to improve and modify their requirement engineering processes in terms of security and privacy of IoT. The SIOT-RIMM model will be developed based on the existing IoT literature pertaining to security and privacy, industrial empirical study and understanding of the challenges that could negatively influence the implementation of security and privacy in IoT. To develop the maturity levels of SIOT-RIMM, we will consider the concepts of existing maturity models of other software engineering domains. In this preliminary study, 19 challenges were identified using the SLR approach that might have a negative impact on the IoT requirements engineering process. The identified challenges will contribute to the development of SIOT-RIMM maturity levels.", "venue": "International Conference on Evaluation & Assessment in Software Engineering", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2020-04-15", "journal": {"name": "Proceedings of the 24th International Conference on Evaluation and Assessment in Software Engineering"}, "authors": [{"authorId": "1675236978", "name": "Muhammad Hamza"}, {"authorId": "2118877905", "name": "Haibo Hu"}, {"authorId": "32584448", "name": "M. Akbar"}, {"authorId": "50220237", "name": "F. Mehmood"}, {"authorId": "48377962", "name": "Yasir Hussain"}, {"authorId": "102390074", "name": "A. Baddour"}], "citations": [{"paperId": "2ee36a809f416f9206db98a5310751d9b8ce8022", "title": "A Responsive Framework for Research Portals Data using Semantic Web Technology"}, {"paperId": "5addd8cbef2cf5282e5905c5d4ea70fdecfd979c", "title": "Toward a secure global contact tracing app for Covid-19"}, {"paperId": "a12e91a45e67bf989188d6560ca8095c219e9397", "title": "Security Threat and Vulnerability Assessment and Measurement in Secure Software Development"}, {"paperId": "9cdf7d841c540ca9675c08162279f50a062495af", "title": "A Review on VANET Research: Perspective of Recent Emerging Technologies"}, {"paperId": "4614c5a83e2c4a0d96e4072d264b07824dc69846", "title": "A Multicriteria Decision Making Taxonomy of IOT Security Challenging Factors"}, {"paperId": "bdb6ea82ea25ada809254c02d7020a232bcf539c", "title": "Driving Business Innovation and Sustainability through Internet of Things and Data Analytics: An Innovation Stage Model"}]}
