{"paperId": "a378674107132963014ec2ae86c390d2c7d70105", "publicationVenue": {"id": "47c47088-7640-441b-85ba-375fe8f5c3a4", "name": "International Conference on Computing Communication and Networking Technologies", "type": "conference", "alternate_names": ["Int Conf Comput Commun Netw Technol", "International Conference on Computing, Communication and Networking Technologies", "ICCCNT"]}, "title": "Implementation and Performance Comparison of Partitioning Techniques in Apache Spark", "abstract": "Apache spark is one of the most demanded frameworks for High performance computing of Big Data. Data is growing day by day to such a large extent that the power of existing analytical tool is not sufficient. The degree of parallelism achieved directly impacts the performance of the framework. Parallelism can be achieved only when there is a proper division among the dataset. Partitioning helps in this division of work. Appropriate number of partitions and related data in partition will ensure the proper storage and faster access of data. Spark provides the inbuilt libraries and also flexibility to mould the available methods of partitioning according to convenience. In this paper we discus about the architecture of storage structure in spark, implementation of various partitioning techniques and performance comparison of those techniques.", "venue": "International Conference on Computing Communication and Networking Technologies", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-07-01", "journal": {"name": "2019 10th International Conference on Computing, Communication and Networking Technologies (ICCCNT)", "pages": "1-5"}, "authors": [{"authorId": "143820196", "name": "J. Geetha"}, {"authorId": "1474585383", "name": "N. Harshit"}], "citations": [{"paperId": "64e6643834a24176337352102e568221ded4169d", "title": "﻿SparkEC: speeding up alignment-based DNA error correction tools"}, {"paperId": "872d2bc78badebb1a24a2948230838fc977dbf05", "title": "A Cluster-Based Partition Method of Remote Sensing Data for Efficient Distributed Image Processing"}]}
