{"paperId": "a37fde45e2726343d043ec2b2d84cfa5864a235e", "publicationVenue": {"id": "d2e111a6-dd60-474c-ae8a-2b5773cca07d", "name": "International Conference on Parallel and Distributed Systems", "type": "conference", "alternate_names": ["Int Conf Parallel Distrib Syst", "ICPADS"], "url": "http://www.wikicfp.com/cfp/program?id=1443"}, "title": "A Latency Guaranteed Scheduling Strategy under Performance Constraints in Big Data Stream Computing Environments", "abstract": "Efficient utilization of computing resources in a stream computing environment is crucial for system performance. Existing scheduling strategies can hardly guarantee latency under performance constraints, let alone accounting for the communication cost incurred by scheduling itself. To address these issues, we propose Lg-Stream, a latency guaranteed scheduling strategy under performance constraints. This paper discusses the Lg-Stream strategy from the following aspects: (1) We model the topology as a queuing network to evaluate the system latency; (2) For scenarios with limited resources and latency constraints, we ensure that each executor-to-component allocation optimizes the system's processing latency to the maximum, consequently altering the components’ parallelism; (3) We place executors that communicate with each other on the same node as much as possible. Experimental results demonstrated that in comparison to existing state-of-the-art scheduling strategies, it reduces the average system latency up to 30%.", "venue": "International Conference on Parallel and Distributed Systems", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-12-17", "journal": {"name": "2023 IEEE 29th International Conference on Parallel and Distributed Systems (ICPADS)", "pages": "2730-2733"}, "authors": [{"authorId": "2286490425", "name": "Dawei Sun"}, {"authorId": "2293635886", "name": "Chengjun Guan"}, {"authorId": "2293772372", "name": "Yinuo Fan"}, {"authorId": "2293635003", "name": "Jia Rung"}, {"authorId": "2112310850", "name": "Shang Gao"}], "citations": []}
