{"paperId": "a3865c042d55a8f7660a1906d4eb367ca78b8471", "publicationVenue": {"id": "87a9041d-3fcb-4c5a-b22c-4a99beca7888", "name": "IEEE Vehicular Networking Conference", "type": "conference", "alternate_names": ["Vehicular Networking Conference", "Veh Netw Conf", "VNC", "IEEE Veh Netw Conf"], "url": "http://www.ieee-vnc.org/"}, "title": "Edge-Assisted Service Allocation and Delivery for Connected Vehicles with Variable Velocities", "abstract": "Edge computing can support many services, such as driving assistance, autonomous driving, high-definition mapping, and entertainment, to connected vehicles. Compared with cloud computing, edge computing provides lower latency and better locality, but its more distributed architecture needs a delicate design to deliver services to moving vehicles at the right time and at the right place. In this paper, we focus on service allocation and delivery at edge servers, featuring vehicles with variable but bounded velocities as well as shared services with timing and freshness constraints. To solve the problem, we propose two types of diagrams to encode the timing when services should be allocated to edge servers to satisfy the requests generated by vehicles. We then develop an approach that iteratively selects requests, allocates services, updates the status of requests, and refines solutions. One novel feature of the approach is that, if there is no feasible solution, the approach computes and suggests the velocities of vehicles so that vehicles can follow the suggestions to slow down and guarantee to receive the services. Experimental results demonstrate the effectiveness and the real-time applicability of the proposed approach.", "venue": "IEEE Vehicular Networking Conference", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-04-26", "journal": {"name": "2023 IEEE Vehicular Networking Conference (VNC)", "pages": "112-119"}, "authors": [{"authorId": "2219391313", "name": "Yi Hung"}, {"authorId": "2219400500", "name": "Liang-Kuan Chou"}, {"authorId": "2219461392", "name": "Hsu-Huai Tsai"}, {"authorId": "2218902624", "name": "Hsi-Chuang Wang"}, {"authorId": "49044591", "name": "Chung-Wei Lin"}, {"authorId": "73098055", "name": "Baek-Hyeon Kim"}], "citations": []}
