{"paperId": "a397b4eba1b1b68eabb19facc324a3c7a6f8369b", "publicationVenue": null, "title": "A Multiple Instance Learning Approach to Electrophysiological Muscle Classification for Diagnosing Neuromuscular Disorders Using Quantitative EMG", "abstract": "Neuromuscular disorder is a broad term that refers to diseases that impair muscle functionality either by affecting any part of the nerve or muscle. Electrodiagnosis of most neuromuscular disorders is based on the electrophysiological classification of involved muscles which in turn, is performed by inferring the structure and function of the muscles by analyzing electromyographic (EMG) signals recorded during low to moderate levels of contraction. The functional unit of muscle contraction is called a motor unit (MU). The morphology and physiology of the MUs of an examined muscle are inferred by extracting motor unit potentials (MUPs) from the EMG signals detected from the muscle. As such, electrophysiological muscle classification is performed by first characterizing extracted MUPs and then aggregating these characterizations. The task of classifying muscles can be represented as an instance of a multiple instance learning (MIL) problem. In the MIL paradigm a bag of instances shares a label and the instance labels are hidden, contrary to standard supervised learning, where each training instance is labeled. In MIL-based muscle classification, the instances are the MUPs extracted from the EMG signals of the analyzed muscle and the bag is the muscle. Detecting and counting the MUPs indicating a specific category of neuromuscular disorder can result in accurately classifying the examined muscle. As such, three major issues usually arise: how to infer MUP labels without full supervision; how the cardinality relationships between MUP labels contribute to predict the muscle label; and how the muscle as a whole entity is classified. In this thesis, these three challenges are addressed. To this end, an MIL-based muscle classification system is proposed that has five major steps: 1) MUPs are represented using morphological, stability, and novel near fiber parameters as well as spectral features extracted from wavelet coefficients. This representation helps to analyze MUPs from a variety of aspects. 2) MUP feature selection using unsupervised similarity preserving Laplacian score which is independent of any learning algorithm. Hence, the features selected in this work can be used in other electrophysiological muscle classification systems. 3) MUP clustering using a novel clustering algorithm", "venue": "", "year": 2018, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": null, "publicationDate": "2018-09-21", "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "4297264", "name": "T. Kamali"}], "citations": [{"paperId": "016229bd1304654f8429c69e1570cb513d005381", "title": "A Novel Application of Deep Learning (Convolutional Neural Network) for Traumatic Spinal Cord Injury Classification Using Automatically Learned Features of EMG Signal"}]}
