{"paperId": "a3a7194a42006350a6afff178dd6a19f7cf0f27c", "publicationVenue": {"id": "801703f5-a310-442a-a58a-41bb05ae1f68", "name": "International Conference on Wirtschaftsinformatik", "type": "conference", "alternate_names": ["WI", "Int Conf Wirtsch", "Web Intell", "IEEE/WIC/ACM Int Conf Web Intell", "IEEE/WIC/ACM International Conference on Web Intelligence", "Web Intelligence"], "url": "https://aisel.aisnet.org/wi/", "alternate_urls": ["http://www.wikicfp.com/cfp/program?id=3061"]}, "title": "FLICM clustering with matrix factorization based course recommendation in an E-learning platform", "abstract": "Technology-enabled learning has progressively grown for research areas with wide application of information and communication technologies for numerous standard-compliant Learning and Open Educational Resources. This provides formidable support to users for the selection of courses when they want to develop the course with available learning materials. But selecting a course via searching learning objects is an inherently complex operation having various repositories. In an E-learning Platform, many complexities arise due to various software tools and specification formats that hinder the success of the course. In this paper, many obstacles in the E-learning platform are eradicated by utilizing Fuzzy Local Information C-Means (FLICM) clustering with matrix factorization for the selection of courses. The dataset utilized in this work is E-Khool review data, from which an agglomerative matrix is generated. Here, the agglomerative matrix consists of the learner series matrix and course series matrix along with their binary matrix. After this process, course grouping is carried out by FLICM clustering with matrix factorization. Moreover, group course bilevel matching, followed by relevant learner retrieval and group user is done by Minkowski and Chebyshev distance. From this learner’s preferred course is retrieved and then a recommendation using matrix factorization is carried out. Finally, the course is recommended for the user based on maximum rating. Furthermore, the performance of developed FLICM_matrix factorization is achieved by performance metrics, like precision, recall, and f-measure with values 0.915, 0.850, and 0.882, accordingly.", "venue": "International Conference on Wirtschaftsinformatik", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-05-25", "journal": {"name": "Web Intelligence"}, "authors": [{"authorId": "119920102", "name": "A. Madhavi"}, {"authorId": "2079186550", "name": "A. Nagesh"}, {"authorId": "145095796", "name": "A. Govardhan"}], "citations": []}
