{"paperId": "a3b163d384eb50459133b6a2e67d911122e6a32f", "publicationVenue": {"id": "7c9d091e-015e-4e5d-a11f-9bc369fcf414", "name": "IEEE Transactions on Parallel and Distributed Systems", "type": "journal", "alternate_names": ["IEEE Trans Parallel Distrib Syst"], "issn": "1045-9219", "url": "http://www.computer.org/tpds", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=71"]}, "title": "An Efficient Parallel Reinforcement Learning Approach to Cross-Layer Defense Mechanism in Industrial Control Systems", "abstract": "The ongoing digitalization enables stable control processes and smooth operations of Industrial Control Systems (ICSs). A direct consequence of the highly interconnected architecture of ICSs is the introduced cyber vulnerability and increasing cyber security threats to ICSs. Numerous researches pay attention to the security problem of ICSs. However, most current studies face two challenges. First, the interaction problem between the cyber layer and the physical layer of ICSs may result in incorrect attack response strategies. Second, ICSs are real-time systems, but existing defense decision algorithms based on game theory or reinforcement learning techniques have high computational complexity, which prevents them from making decisions quickly. In this paper, we design a new multi-attribute based method for quantifying rewards and propose a multi-attribute based Q-learning algorithm to resolve the interaction problem. In addition, to overcome the limitation of slow convergence, we develop an effective parallel Q-learning (PQL) algorithm to quickly find the optimal strategy. The experimental results show the effectiveness of the PQL algorithm. Compared with the Q-learning algorithm (QL) and the deep Q-network (DQN) algorithm, our proposed solution can reduce the average completion time by 12.5 to 37 percent.", "venue": "IEEE Transactions on Parallel and Distributed Systems", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-11-01", "journal": {"name": "IEEE Transactions on Parallel and Distributed Systems", "pages": "2979-2990", "volume": "33"}, "authors": [{"authorId": "2061446386", "name": "Kai Zhong"}, {"authorId": "50109298", "name": "Zhibang Yang"}, {"authorId": "34688451", "name": "Guoqing Xiao"}, {"authorId": "9277408", "name": "Xingpei Li"}, {"authorId": "1729226", "name": "Wangdong Yang"}, {"authorId": "145730774", "name": "Kenli Li"}], "citations": [{"paperId": "052dbcbb0f2b5cf41144966527eace7ad1cea1e4", "title": "Bridging Both Worlds in Semantics and Time: Domain Knowledge Based Analysis and Correlation of Industrial Process"}, {"paperId": "e2839627ac44cb3e1111bba176bad65bfec228f9", "title": "Topology-aware Multi-task Learning Framework for Civil Case Judgment Prediction"}, {"paperId": "2de6cb834f04a0e8f2db229649290de22304b770", "title": "A Distributed and Privacy-Aware High-Throughput Transaction Scheduling Approach for Scaling Blockchain"}, {"paperId": "1b94c812a605f96898eff82ab31088a43546e9cb", "title": "Dichotomy value iteration with parallel learning design towards discrete-time zero-sum games"}, {"paperId": "b0675ae65c6677fc053968bb54e6151842bbb8a8", "title": "Reimagining multi-criterion decision making by data-driven methods based on machine learning: A literature review"}, {"paperId": "6dc204f0761934598d67bf2ed271800b7dfa70a0", "title": "Applying Deep Reinforcement Learning for Detection of Internet-of- Things Cyber Attacks"}, {"paperId": "d77ec728e45f2a0feb80ddf1e2e6226170ac56e2", "title": "Recent Trends in Task and Motion Planning for Robotics: A Survey"}, {"paperId": "598e071a9315896816c72be67ec642cea3f380d0", "title": "Scaphy: Detecting Modern ICS Attacks by Correlating Behaviors in SCADA and PHYsical"}, {"paperId": "c895bc824ad9f481b888f833378159774c39718c", "title": "Reinforcement learning method for machining deformation control based on meta-invariant feature space"}, {"paperId": "69936b5a68ffdc41fdd0719f1a66d96484030d6a", "title": "Reinforcement learning based energy-neutral operation for hybrid EH powered TBAN"}, {"paperId": "407ac2b40afa443506532b153f41e1163d3eab2a", "title": "Online Cyber-Attack Detection in the Industrial Control System: A Deep Reinforcement Learning Approach"}, {"paperId": "a1ac9492e2f3151aa8c862cddc369a1332cc9f5a", "title": "Modeling Nonlinear Dynamics in Human–Machine Interaction"}]}
