{"paperId": "a3bb48baa95badc2fb71323311ec367ea4e4ab71", "publicationVenue": null, "title": "A Systematic Review of Questionnaire-Based Quantitative Research on MOOCs", "abstract": "Massive open online courses (MOOCs) have attracted much interest from educational researchers and practitioners around the world. There has been an increase in empirical studies about MOOCs in recent years, most of which used questionnaire surveys and quantitative methods to collect and analyze data. This study explored the research topics and paradigms of questionnaire-based quantitative research on MOOCs by reviewing 126 articles available in the Science Citation Index (SCI) and Social Sciences Citation Index (SSCI) databases from January 2015 to August 2020. This comprehensive overview showed that: (a) the top three MOOC research topics were the factors influencing learners’ performance, dropout rates and continuance intention to use MOOCs, and assessing MOOCs; (b) for these three topics, many studies designed questionnaires by adding new factors or adjustments to extant theoretical models or survey instruments; and (c) most researchers used descriptive statistics to analyze data, followed by the structural equation model, and reliability and validity analysis. This study elaborated on the relationship of research topics and key factors in the research models by building factors-goals (F-G) graphs. Finally, we proposed some directions and recommendations for future research on MOOCs.", "venue": "", "year": 2021, "fieldsOfStudy": ["Psychology"], "publicationTypes": ["Review"], "publicationDate": "2021-01-22", "journal": {"name": "The International Review of Research in Open and Distributed Learning", "pages": "285-313", "volume": "22"}, "authors": [{"authorId": "8858397", "name": "Mingxiao Lu"}, {"authorId": "2139677623", "name": "Tianyi Cui"}, {"authorId": "47272004", "name": "Zhenyu Huang"}, {"authorId": "49453247", "name": "Hongge Zhao"}, {"authorId": "1840553660", "name": "Tao Li"}, {"authorId": "73019850", "name": "Kai Wang"}], "citations": [{"paperId": "ae7c6dca375fdeba39a1da20a2c004b15a05e04a", "title": "Understanding the Continuance Intention of College Students toward New E-Learning Spaces Based on an Integrated Model of the TAM and TTF"}, {"paperId": "c69df33d707a76441d51a23498efe4142c02a763", "title": "Influence of self-directed learning on learning outcomes in MOOCs: A meta-analysis"}, {"paperId": "41ac5ec34b5bdb86504e24edba73b2e36ba43980", "title": "Factors of dropout from MOOCs: a bibliometric review"}, {"paperId": "6c0918ff653cf656649c40eafefe5ac0613663b7", "title": "Online quantitative research methods: A scoping review on education, psychological factors in e-learning, and working from home"}]}
