{"paperId": "a3ed5635db1727e5c07b44fa05b895a7d79595ce", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "A Holistic Review of Cybersecurity and Reliability Perspectives in Smart Airports", "abstract": "Advances in the Internet of Things (IoT) and aviation sector have resulted in the emergence of smart airports. Services and systems powered by the IoT enable smart airports to have enhanced robustness, efficiency and control, governed by real-time monitoring and analytics. Smart sensors control the environmental conditions inside the airport, automate passenger-related actions and support airport security. However, these augmentations and automation introduce security threats to network systems of smart airports. Cyber-attackers demonstrated the susceptibility of IoT systems and networks to Advanced Persistent Threats (APT), due to hardware constraints, software flaws or IoT misconfigurations. With the increasing complexity of attacks, it is imperative to safeguard IoT networks of smart airports and ensure reliability of services, as cyber-attacks can have tremendous consequences such as disrupting networks, cancelling travel, or stealing sensitive information. There is a need to adopt and develop new Artificial Intelligence (AI)-enabled cyber-defence techniques for smart airports, which will address the challenges brought about by the incorporation of IoT systems to the airport business processes, and the constantly evolving nature of contemporary cyber-attacks. In this study, we present a holistic review of existing smart airport applications and services enabled by IoT sensors and systems. Additionally, we investigate several types of cyber defence tools including AI and data mining techniques, and analyse their strengths and weaknesses in the context of smart airports. Furthermore, we provide a classification of smart airport sub-systems based on their purpose and criticality and address cyber threats that can affect the security of smart airport’s networks.", "venue": "IEEE Access", "year": 2020, "fieldsOfStudy": ["Computer Science", "Engineering"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "209802-209834", "volume": "8"}, "authors": [{"authorId": "38986974", "name": "Nickolaos Koroniotis"}, {"authorId": "3193106", "name": "Nour Moustafa"}, {"authorId": "51229946", "name": "F. Schiliro"}, {"authorId": "1680674", "name": "Praveen Gauravaram"}, {"authorId": "1757757", "name": "H. Janicke"}], "citations": [{"paperId": "daa6d9e6ac95715cc1934d36b1d31d97cfda586c", "title": "Embracing the Generative AI Revolution: Advancing Tertiary Education in Cybersecurity with GPT"}, {"paperId": "7167b75273e75a67f211199cb9b32326630564b6", "title": "Enhancing IoT Security Through Resource-Efficient Feature Engineering"}, {"paperId": "55e57740dc92e4a79db8289dc54d6ac5d29a52f5", "title": "Network Intrusion Detection for IoT Devices Using Deep Learning"}, {"paperId": "17e005386b229c9cfe0242c8c739093120771ed9", "title": "Enhancing Air Travel with IoT: Smart Airports and Passenger Experience"}, {"paperId": "84c4313caaa4187b992405ca64fa998045211221", "title": "AIS for Malware Detection in a Realistic IoT System: Challenges and Opportunities"}, {"paperId": "7de1977a314e02885d9d905c09c8af7047db2973", "title": "Cloud and IoT Cybersecurity Applied to Environmental Science in Critical National Infrastructure"}, {"paperId": "a76dce42fdf2611dde544149e917f0250630f8c7", "title": "Exploring the Mutual Influence Relationships of International Airport Resilience Factors from the Perspective of Aviation Safety: Using Fermatean Fuzzy DEMATEL Approach"}, {"paperId": "f824bce83ccb5361db6c0b7ac1320819c5a4dfbb", "title": "A Hybrid Genetic Algorithm-Based Random Forest Model for Intrusion Detection Approach in Internet of Medical Things"}, {"paperId": "c0e50595354cc13b6a86272533edcf8a13f05794", "title": "Next-generation cyber attack prediction for IoT systems: leveraging multi-class SVM and optimized CHAID decision tree"}, {"paperId": "b56f9beccfd820b35d4f03ad3f7103eecd9e9c52", "title": "A Survey: Threat Hunting for the OT Systems"}, {"paperId": "38ba662e7583ec48af2edd2d9873b72cdb62f97c", "title": "Malicious Traffic Identification with Self-Supervised Contrastive Learning"}, {"paperId": "b86cf81682655b5c5f5ddd7e8600f7784cf4d11d", "title": "IoT-based entrepreneurial opportunities in smart transportation: a multidimensional framework"}, {"paperId": "a1d99448126c838181a3cf91aadafee843fa09dd", "title": "A hybrid machine learning model for detecting cybersecurity threats in IoT applications"}, {"paperId": "e2506fb646aca320b561ec4717ba2834a08bc167", "title": "Internet of things and aviation: a bibliometric and visualization analysis"}, {"paperId": "147ff6bd033bf7ddb17f7281326dc3739ce63b81", "title": "DeepCog: A Trustworthy Deep Learning-Based Human Cognitive Privacy Framework in Industrial Policing"}, {"paperId": "a509b6b1af0e5515a33b1242fd5c7beb182f25b7", "title": "Differentially-Private Federated Intrusion Detection via Knowledge Distillation in Third-party IoT Systems of Smart Airports"}, {"paperId": "518661f0b2ee3eda9837ec9587fe766fccc4201a", "title": "Deep Learning Approach for Intrusion Detection and Mitigation in IoT Environment: A Comprehensive Study"}, {"paperId": "bdca5bd198983fecec41bd0038d49fe2481ad0b1", "title": "Passengers satisfaction with the technologies used in smart airports: An empirical study from a gender perspective"}, {"paperId": "7606c5529e5302bc3d490b72c5199f5f86e8a242", "title": "Knowledge Mapping Analysis of Intelligent Ports: Research Facing Global Value Chain Challenges"}, {"paperId": "b74dd373074a87e6be73dd2968dcc2055a0198ba", "title": "The SAir-IIoT Cyber Testbed as a Service: A Novel Cybertwins Architecture in IIoT-Based Smart Airports"}, {"paperId": "118491d1d6735b735d3104427f72c88eff0d13b7", "title": "THE WORLD AIRPORT AWARDS AS A QUALITY DISTINCTIVE AND MARKETING TOOL FOR AIRPORTS"}, {"paperId": "49708064207e99ab20c362b5d3bbcaaded546d2b", "title": "Intrusion Detection in IoT Using Deep Learning"}, {"paperId": "6e49f09e157536c5c7f8b5579faa7f5ebdb474f9", "title": "A novel fully convolutional neural network approach for detection and classification of attacks on industrial IoT devices in smart manufacturing systems"}, {"paperId": "80c3d2e6b05fd3f51b8e554a437e05a9b74cde03", "title": "Challenges and Opportunities of Integrating, and Securing IoT technology in public places"}, {"paperId": "eaad7c323be63d848b808d0bd8c8151657e8a308", "title": "Una revisión de la revolución industrial 4.0 y sus métodos de implementación en las nuevas industrias"}, {"paperId": "85e53f718759723a4b38cd106bbd3c0f7fb0f423", "title": "A GPU-based machine learning approach for detection of botnet attacks"}, {"paperId": "bd1573b0627a1544251b10c1fb140e4dbd5542f4", "title": "A Comparative Study on the Impact of Adversarial Machine Learning Attacks on Contemporary Intrusion Detection Datasets"}, {"paperId": "827982ddac90fd443e2b187384390974b251c5dc", "title": "A Blockchain-Enabled Secure Digital Twin Framework for Early Botnet Detection in IIoT Environment"}, {"paperId": "83e90cab39810adc2f8750ae7ae3d840e6ad091b", "title": "The Impact of COVID-19 on the Cybersecurity in Civil Aviation: Review and Analysis"}, {"paperId": "818305f6c8c967deec8f6790c0ba393129aeac91", "title": "Exploration of Mobile Device Behavior for Mitigating Advanced Persistent Threats (APT): A Systematic Literature Review and Conceptual Framework"}, {"paperId": "b17a4f5c19a1b154fb06317ac8e53d78c2d1550a", "title": "An Efficient Framework for Detection and Classification of IoT Botnet Traffic"}, {"paperId": "7f5286992a71607940170e91654cb1526b1a14b9", "title": "Perspectives of cybersecurity for ameliorative Industry 4.0 era: a review-based framework"}, {"paperId": "ad17dfe165dbe0bbc3332cf27e73f3e78017a2c3", "title": "CoAP-DoS: An IoT Network Intrusion Data Set"}, {"paperId": "5bdc94269f5de0f4ca5124d3c115faf07f542f6e", "title": "Málaga Costa del Sol airport and its new conceptualization of hinterland"}, {"paperId": "b59b1351ad6803a3dfc40ff2a86d345d153c6f65", "title": "A Deep Learning-based Penetration Testing Framework for Vulnerability Identification in Internet of Things Environments"}, {"paperId": "07374415a0c5fd0c97fa07c4f8a1f460ee75bf2a", "title": "Cyber-Security Challenges in Aviation Industry: A Review of Current and Future Trends"}, {"paperId": "630f2a777736413c4359a919687aad432ab3f8da", "title": "Application of IoT in Healthcare: Keys to Implementation of the Sustainable Development Goals"}, {"paperId": "82f305d3cb1a82fb6d4a5fcabb4fda40cb2b05e0", "title": "Federated Deep Learning for Cyber Security in the Internet of Things: Concepts, Applications, and Experimental Analysis"}, {"paperId": "6ff331cc9f4f543236ad396bac7a9e91df9a4438", "title": "A holistic review of cybersecurity and reliability perspectives in A holistic review of cybersecurity and reliability perspectives in smart airports smart airports"}]}
