{"paperId": "a409d10f693b73910727d8e42a8564a51a9c37be", "publicationVenue": {"id": "aa8f57e2-d5cf-4f0d-afcb-8577fb02e10a", "name": "Kybernetes", "type": "journal", "issn": "0368-492X", "url": "https://www.emerald.com/insight/publication/issn/0368-492X", "alternate_urls": ["http://www.emeraldinsight.com/0368-492X.htm", "http://www.emeraldinsight.com/loi/k"]}, "title": "A review on social segregation research: insights from bibliometric analysis", "abstract": "PurposeUsing bibliometrics, this study aims to explore the intellectual structure of social segregation research, key contributors, thematic areas and hotspot topics.Design/methodology/approachA bibliometric analysis was performed for more than 15,000 research papers listed in one of the famous, rich and widely used scientific databases: Web of Science (WoS). This review approach was used to identify social research hotspots on segregation, intellectual structure, borders and development trends. VOSviewer and Gephi software were employed for mapping and analysis.FindingsThe study indicates a marked increase in segregation research, particularly from a spatial/urban perspective. The study reveals the interrelationship between segregation and many other social concepts, such as social equality, cohesion, integration and inclusion. In conclusion, addressing the ramifications resulting from the multiple forms of segregation will help in implementing social policies and evaluating their impact on achieving inclusive social development in general and the 2030 agenda of Sustainable Development Goals (SDGs) in specific.Research limitations/implicationsThis study remains limited to the precision and thoroughness of the bibliographic data gained from WoS.Originality/valueThis study is valuable for readers to gain rich insights into the state of research on social segregation. It also provides ideas for future research that prospective authors and interested research and academic institutions can investigate.", "venue": "Kybernetes", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-10-10", "journal": {"name": "Kybernetes"}, "authors": [{"authorId": "1402519509", "name": "N. Zeini"}, {"authorId": "144641726", "name": "A. Okasha"}, {"authorId": "2238319036", "name": "Amal S. Soliman"}], "citations": [{"paperId": "5c55f1b54bdb9c2f02f31ee1d315abf551463819", "title": "Adaptation to climate change: state of art technologies"}]}
