{"paperId": "a41ba3b5fec34ac5c21b4c411cd596f76ad7bf00", "publicationVenue": {"id": "ea38228f-6ed3-4222-a3ce-d963d8cc9516", "name": "Web Search and Data Mining", "type": "conference", "alternate_names": ["Web Search Data Min", "WSDM"], "url": "http://www.wikicfp.com/cfp/program?id=3158"}, "title": "Proxy-based Item Representation for Attribute and Context-aware Recommendation", "abstract": "Neural network approaches in recommender systems have shown remarkable success by representing a large set of items as a learnable vector embedding table. However, infrequent items may suffer from inadequate training opportunities, making it difficult to learn meaningful representations. We examine that in attribute and context-aware settings, the poorly learned embeddings of infrequent items impair the recommendation accuracy. To address such an issue, we propose a proxy-based item representation that allows each item to be expressed as a weighted sum of learnable proxy embeddings. Here, the proxy weight is determined by the attributes and context of each item and may incorporate bias terms in case of frequent items to further reflect collaborative signals. The proxy-based method calculates the item representations compositionally, ensuring each representation resides inside a well-trained simplex and, thus, acquires guaranteed quality. Additionally, that the proxy embeddings are shared across all items allows the infrequent items to borrow training signals of frequent items in a unified model structure and end-to-end manner. Our proposed method is a plug-and-play model that can replace the item encoding layer of any neural network-based recommendation model, while consistently improving the recommendation performance with much smaller parameter usage. Experiments conducted on real-world recommendation benchmark datasets demonstrate that our proposed model outperforms state-of-the-art models in terms of recommendation accuracy by up to 17% while using only 10% of the parameters.", "venue": "Web Search and Data Mining", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-11", "journal": {"name": "ArXiv", "volume": "abs/2312.06145"}, "authors": [{"authorId": "24074715", "name": "Jinseok Seol"}, {"authorId": "2273565084", "name": "Minseok Gang"}, {"authorId": "2273561287", "name": "Sang-goo Lee"}, {"authorId": "2052729", "name": "Jaehui Park"}], "citations": []}
