{"paperId": "a422da6a32c919df0ac41f60d41442f16d1e64a6", "publicationVenue": {"id": "18f15bae-00af-45bc-9a7d-bfeb404c3ce8", "name": "GI-Fachtagung Informatik und Schule", "type": "conference", "alternate_names": ["INFOS", "International Conference on Informatics and Systems", "Gi-fachtagung Inform Sch", "Int Conf Informatics Syst"], "url": "https://dl.acm.org/conference/infos/"}, "title": "JOMR: Multi-join optimizer technique to enhance map-reduce job", "abstract": "Map-Reduce is a programming model and execution an environment developed by Google to process very large amounts of data. Query optimizer is needed to find more efficient plans for declarative SQL query. In classic database: join algorithms are optimized to execute the entire query result, but they ignore the importance of tables order especially in multi-join query. But we can see that the orders for tables are an important factor to get the best performance of a query plan and will be very effective in performance when join tables content huge number of rows in addition to more than one join operation. In this paper we proposed a new technique called JOMR (Join Order In Map-Reduce) that optimizes and enhances Map-Reduce job. This technique uses enhanced parallel Travel Salesman Problem (TSP) using Map-Reduce for improving the performance of query plans according to change the order for join tables. Also we build a cost model that supports our algorithm to find best join order. We will focus on Hive especially multi-join query and our experiments result for JOMR algorithm proving the effectiveness of our query optimizer and this performance is improved more when increasing the number of join and size of data.", "venue": "GI-Fachtagung Informatik und Schule", "year": 2014, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2014-12-01", "journal": {"name": "2014 9th International Conference on Informatics and Systems", "pages": "PDC-80-PDC-87"}, "authors": [{"authorId": "9206465", "name": "Mina Samir Shanoda"}, {"authorId": "1950288", "name": "S. Senbel"}, {"authorId": "39023607", "name": "M. Khafagy"}], "citations": [{"paperId": "15bfc384fc8ef43c2c4f3d43a4905f5e690406e6", "title": "Exploiting Sharing Join Opportunities in Big Data Multiquery Optimization with Flink"}, {"paperId": "458e8b4402d8297c64147ae41775da8d118c6d9b", "title": "Deterministic Dynamic Network-Based Just-in-Time Delivery for Distributed Edge Computing"}, {"paperId": "457ba1932bcbc3412923f11892f965b0d6450ed4", "title": "Real-Time Attacks Detection Model And Platform Using Big Data And Machine Learning"}, {"paperId": "41d1f3c0abac716b0b5b55a30e26c3030c0963b2", "title": "Hybrid-Key Stream Cipher Mechanism for Hadoop Distributed File System Security"}, {"paperId": "3340708082b9b78a0509df4ffb0e83ecfeeba908", "title": "The Relation between the Learner Characteristics and Adaptation Techniques in the Adaptive E-Learning Systems"}, {"paperId": "af8d33bb9feb8a9a0a18040ee380824e4cdb8ae8", "title": "Smurf Detector: a Detection technique of criminal entities involved in Money Laundering"}, {"paperId": "62e721c657aca3d335eb260b912949400c7edc08", "title": "Recommender Systems Challenges and Solutions Survey"}, {"paperId": "ec792871ec063f794e4983fe4ce469b4c2a6a2ae", "title": "Optimizing Join in HIVE Star Schema Using Key/Facts Indexing"}, {"paperId": "bac214fcaaf0dc42b8327afa219bf6ee102c9214", "title": "From Two-Way to Multi-Way: A Comparative Study for Map-Reduce Join Algorithms"}, {"paperId": "95e5bfdb5397600779d7d511f75506e91012033d", "title": "Advanced SQL Query To Flink Translator"}, {"paperId": "1b395330d84411d6b23e9922fdfaa27b6a34e106", "title": "Sparse learning of maximum likelihood model for optimization of complex loss function"}, {"paperId": "74f2fcbe4466723a185f40cafd22010b6f248f5f", "title": "Hash semi cascade join for joining multi-way map reduce"}, {"paperId": "cd236bbaa0517aeb85309c5bd32462ecd79200dd", "title": "Dynamic Replication Policy on HDFS Based on Machine Learning Clustering"}, {"paperId": "503c2c34d74013662a040000cf7c029bd14fdaea", "title": "Arabic Semantic Similarity Approach for Farmers’ Complaints"}, {"paperId": "095082bf0f96e9e3d352b66fe95daefd9bfde94a", "title": "MUSIC RECOMMENDATION SYSTEM USED EMOTIONS TO TRACK AND CHANGE NEGATIVE USERS’ MOOD"}, {"paperId": "dda50d63543d509f37da827f54fe52c38d1ea08b", "title": "Case Study: Spark GPU-Enabled Framework to Control \nCOVID-19 Spread Using Cell-Phone Spatio-Temporal Data"}, {"paperId": "a84f09d4e7cc382d56ebd0685b9e0faa9ee0f365", "title": "JOUM: An Indexing Methodology for Improving Join in Hive Star schema"}, {"paperId": "a6b7332090aee09de924254f48703290ad6bdbce", "title": "Indexed Map-Reduce Join Algorithm"}, {"paperId": "a75eea3d3145c4120bb39d45dbfe8336d61eaee4", "title": "JOUM: An Indexing Methodology for Improving Join in Hive Star schema"}, {"paperId": "c60a392e82b6bba17efae422443a8ad0dc2b847b", "title": "IMPROVE SALES USING DATA MINING APRIORI ALGORITHM TO EXTRACT HIDDEN PATTERN"}, {"paperId": "97156b87ab1ad428f31c64953cc9653a2f5c7455", "title": "BIG DATA CHALLENGES: PRESERVING TECHNIQUES FOR PRIVACY VIOLATIONS"}, {"paperId": "9df8c7d4ee81f396f74a7963b97209a73abc1a44", "title": "PROPOSED APPROACH FOR ACADEMIC PAPER RANKING BASED ON BIG DATA AND GRAPH ANALYTICS"}]}
