{"paperId": "a42693fe4679b7f4288d9648c79260fc92870b49", "publicationVenue": {"id": "939ba3df-4270-4ba0-ad98-ffe889f3546e", "name": "Processes", "issn": "2227-9717", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-317995", "alternate_urls": ["https://www.mdpi.com/journal/processes", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-317995"]}, "title": "Performance Evaluation of Chiller Fault Detection and Diagnosis Using Only Field-Installed Sensors", "abstract": "Owing to the rapid expansion of data science, data-driven methods have emerged as a dominant trend in chiller fault detection and diagnosis (FDD). Most of these methods prioritize feature selection to achieve optimal diagnostic performance. However, on-site research indicates a common installation of a limited number of sensors, coupled with a necessity to minimize diagnostic costs. This discrepancy between existing research’s feature selection principles and the current on-site sensor installation status presents a significant challenge. To facilitate the practical implementation of data-driven methods in real chiller units, this study addresses a critical question: under the constraint of limited on-site sensor installations, what is the optimal performance achievable by data-driven methods and their improved versions? To answer this, only features derived from commonly installed sensors on field chillers are chosen as indicators for typical chiller faults. The FDD performance of six frequently used data-driven methods, namely, back-propagation neural network, convolutional neural network, support vector machine, support vector data description, Bayesian network, and random forest, along with their improved versions, is comprehensively evaluated and validated using experimental data, considering four evaluation metrics. The conclusions drawn in this paper provide valuable insights for users/manufacturers with limited or no budget, detailing the best achievable diagnostic performance for each typical fault and offering guidance for those aiming to further enhance FDD performance.", "venue": "Processes", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-11-26", "journal": {"name": "Processes"}, "authors": [{"authorId": "2265255628", "name": "Zhanwei Wang"}, {"authorId": "2227937722", "name": "Jingjing Guo"}, {"authorId": "2268633540", "name": "Sai Zhou"}, {"authorId": "2268537024", "name": "Penghua Xia"}], "citations": []}
