{"paperId": "a4260807cf0147f608451feb153ec72f625e0a49", "publicationVenue": null, "title": "FedEval: A Holistic Evaluation Framework for Federated Learning", "abstract": "—Federated Learning (FL) has been widely accepted as the solution for privacy-preserving machine learning without collecting raw data. While new technologies proposed in the past few years do evolve the FL area, unfortunately, the evaluation results presented in these works fall short in integrity and are hardly comparable because of the inconsistent evaluation metrics and experimental settings. In this paper, we propose a holistic evaluation framework for FL called FedEval, and present a benchmarking study on seven state-of-the-art FL algorithms. Speciﬁcally, we ﬁrst introduce the core evaluation taxonomy model, called FedEval-Core, which covers four essential evaluation aspects for FL: Privacy, Robustness, Effectiveness, and Efﬁciency, with various well-deﬁned metrics and experimental settings. Based on the FedEval-Core, we further develop an FL evaluation platform with standardized evaluation settings and easy-to-use interfaces. We then provide an in-depth benchmarking study between the seven well-known FL algorithms, including FedSGD [1], FedAvg [1], FedProx [2], FedOpt [3], FedSTC [4], SecAgg [5], and HEAgg [6, 7]. We comprehensively analyze the advantages and disadvantages of these algorithms and further identify the suitable practical scenarios for different algorithms, which is rarely done by prior work. Lastly, we excavate a set of take-away insights and future research directions, which are very helpful for researchers in the FL area.", "venue": "", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2020-11-19", "journal": null, "authors": [{"authorId": "2064208321", "name": "Di Chai"}, {"authorId": "2143500842", "name": "Leye Wang"}, {"authorId": "2145494870", "name": "Liu Yang"}, {"authorId": "1908497", "name": "Junxue Zhang"}, {"authorId": "2157740727", "name": "Kai Chen"}, {"authorId": "144286907", "name": "Qian Yang"}], "citations": [{"paperId": "177d76faa7081c5ed87614777b4a1bc55441a814", "title": "PFLlib: Personalized Federated Learning Algorithm Library"}, {"paperId": "e2eb612e812a2b9fcadeb8e6bb7cb52b206aedcd", "title": "Federated Short-Term Load Forecasting with Personalization Layers for Heterogeneous Clients"}, {"paperId": "7e555856fc97b669379b0989a8c50097e4f607ed", "title": "A Survey for Federated Learning Evaluations: Goals and Measures"}, {"paperId": "e2628754de142e2a9733f5889124fef540b58005", "title": "Heterogeneous Federated Learning: State-of-the-art and Research Challenges"}, {"paperId": "ef55d2d64802f652265385c4976e7bf2a005ba73", "title": "Collaborative Worker Safety Prediction Mechanism Using Federated Learning Assisted Edge Intelligence in Outdoor Construction Environment"}]}
