{"paperId": "a451e17c40561848976b410ff64063741aaa23e4", "publicationVenue": null, "title": "A Social-Aware Recommender System Based on User's Personal Smart Devices", "abstract": "Providing recommendations in cold start situations is one of the most challenging problems for collaborative filtering based recommender systems (RSs). Although user social context information has largely contributed to the cold start problem, most of the RSs still suffer from the lack of initial social links for newcomers. For this study, we are going to address this issue using a proposed user similarity detection engine (USDE). Utilizing users’ personal smart devices enables the proposed USDE to automatically extract real-world social interactions between users. Moreover, the proposed USDE uses user clustering algorithm that includes contextual information for identifying similar users based on their profiles. The dynamically updated contextual information for the user profiles helps with user similarity clustering and provides more personalized recommendations. The proposed RS is evaluated using movie recommendations as a case study. The results show that the proposed RS can improve the accuracy and personalization level of recommendations as compared to two other widely applied collaborative filtering RSs. In addition, the performance of the USDE is evaluated in different scenarios. The conducted experimental results on USDE show that the proposed USDE outperforms widely applied similarity measures in cold start and data sparsity situations.", "venue": "ISPRS Int. J. Geo Inf.", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-08-30", "journal": {"name": "ISPRS Int. J. Geo Inf.", "pages": "519", "volume": "9"}, "authors": [{"authorId": "66335507", "name": "S. Ojagh"}, {"authorId": "37483471", "name": "M. Malek"}, {"authorId": "1978579", "name": "S. Saeedi"}], "citations": [{"paperId": "cc28859caf8791f1cb51828fe5d8840c3b449eba", "title": "Recommendation-based trust computation and rating prediction model for security enhancement in cloud computing systems"}, {"paperId": "1ca45998c06585dbce6178b6169fa764137c731b", "title": "Suspiciousness and Fast and Slow Thinking Impact on Trust in Recommender Systems"}, {"paperId": "619571202e36f2eb5f9dddb74f7ee52e3a9587c2", "title": "The Influence of Social Stratification on Trust in Recommender Systems"}, {"paperId": "1f63b40b91c25cdfff5886c115ceb8e35d79f130", "title": "Beyond the Big Five personality traits for music recommendation systems"}, {"paperId": "cbbec5cf4cfe9bc018a775143ce8b2b0d66963b9", "title": "Computational Model of Recommender System Intervention"}, {"paperId": "52fc1157f5b2f7fbfaa9320aa6c43ac49d15ea74", "title": "Toward Preference and Context-Aware Hybrid Tourist Recommender System Based on Machine Learning Techniques"}, {"paperId": "49ec548636267e3c100d93fcc1487d9eee62522b", "title": "Approaches and algorithms to mitigate cold start problems in recommender systems: a systematic literature review"}, {"paperId": "6364a9a437d2b42eeda11d322af47e49eabef604", "title": "A social hybrid recommendation system using LSTM and CNN"}, {"paperId": "18572abe82729461ef278977104322dba030b154", "title": "A study on the role of uninterested items in group recommendations"}, {"paperId": "8c2d239b982caf18e38b1ba5af9a5b7fa7d54335", "title": "A Two-Stage Neural Network-Based Cold Start Item Recommender"}, {"paperId": "68cc95fc519ad11a095b66805fc1b289c5b04d9d", "title": "User Profiling in Travel Recommender System using Hybridization and Collaborative Method"}, {"paperId": "123d34204e49e17f797686df22a13bc408761459", "title": "An Interoperable Architecture for the Internet of COVID-19 Things (IoCT) Using Open Geospatial Standards—Case Study: Workplace Reopening"}, {"paperId": "47e739acbf1c1d590670a902827e26e792c54039", "title": "A Person-to-Person and Person-to-Place COVID-19 Contact Tracing System Based on OGC IndoorGML"}, {"paperId": "8432826a1b0daad99108b801ca195b3d9f629233", "title": "Social Media and E-mail Marketing Campaigns: Symmetry versus Convergence"}]}
