{"paperId": "a4563ed728a5ae36c2f01643aaad33527a9cc331", "publicationVenue": null, "title": "BIGMAT: A Distributed Affinity-Preserving Random Walk Strategy for Instance Matching on Knowledge Graphs", "abstract": "Instance Matching (IM) is the process of matching instances that refer to the same real-world object (e.g., the same person) across different independent Knowledge Bases (KBs). This process is considered as a key step, for instance, in the integration of KBs. In this paper, we propose BIGMAT, a novel approach for the IM problem based on Markov random walks. Our approach bears in mind the local and global information mutually calculated from a pairwise similarity graph. Precisely, we first build an expanded association graph consisting of pairs of IM candidates. Then, we rank each candidate pair through the stationary distribution computed from the Markov random walk on the association graph. We provide a scalable distributed implementation on top of the Spark framework and we evaluate it on benchmark datasets from the instance track of the Ontology Alignment Evaluation Initiative (OAEI). The experiments show the efficiency and scalability of our approach compared to several state-of-the-art IM approaches.", "venue": "2019 IEEE International Conference on Big Data (Big Data)", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-12-01", "journal": {"name": "2019 IEEE International Conference on Big Data (Big Data)", "pages": "1028-1033"}, "authors": [{"authorId": "1505577159", "name": "A. Assi"}, {"authorId": "3138293", "name": "H. Mcheick"}, {"authorId": "1781560", "name": "Wajdi Dhifli"}], "citations": [{"paperId": "3fff46dfed75b687a4370b7b6d192b41e42585d9", "title": "An analysis of one-to-one matching algorithms for entity resolution"}, {"paperId": "0d5cb9e255191837ff053a8335f5d6e041f87b3e", "title": "Bipartite Graph Matching Algorithms for Clean-Clean Entity Resolution: An Empirical Evaluation"}, {"paperId": "b959e3527c34753955282e6049a64400e9cdecc5", "title": "FTRLIM: Distributed Instance Matching Framework for Large-Scale Knowledge Graph Fusion"}, {"paperId": "666841b135322dba64d685fa659d54d821f0b4af", "title": "Instance Matching in Knowledge Graphs through random walks and semantics"}, {"paperId": "9894b57a6512784a4ce2cc0730727885225363a4", "title": "Instance Matching in Knowledge Graphs Through Dynamic, Distributed and Affinity-Preserving Random Walk"}, {"paperId": "d1f5f86d975e050ef9a7ca48a2c6b73758702472", "title": "Data linking over RDF knowledge graphs: A survey"}, {"paperId": null, "title": "[Experiments & Analysis] Bipartite Graph Matching Algorithms for blueClean-Clean Entity Resolution: An Empirical Evaluation"}]}
