{"paperId": "a462a41e2794dbcddd4aba19d12413c9ce4fa673", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Modyn: A Platform for Model Training on Dynamic Datasets With Sample-Level Data Selection", "abstract": "Machine learning training data is often dynamic in real-world use cases, i.e., data is added or removed and may experience distribution shifts over time. Models must incorporate this evolving training data to improve generalization, adapt to potential distribution shifts, and adhere to privacy regulations. However, the cost of model (re)training is proportional to how often the model trains and on how much data it trains on. While ML research explores these topics in isolation, there is no end-to-end open-source platform to facilitate the exploration of model retraining and data selection policies and the deployment these algorithms efficiently at scale. We present Modyn, a platform for model training on dynamic datasets that enables sample-level data selection and triggering policies. Modyn orchestrates continuous training pipelines while optimizing the underlying system infrastructure to support fast access to arbitrary data samples for efficient data selection. Modyn's extensible architecture allows users to run training pipelines without modifying the platform code, and enables researchers to effortlessly extend the system. We evaluate Modyn's training throughput, showing that even in memory-bound recommendation systems workloads, Modyn is able to reach 80 to 100 % of the throughput compared to loading big chunks of data locally without sample-level data selection. Additionally, we showcase Modyn's functionality with three different data selection policies.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science", "Mathematics"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-11", "journal": {"name": "ArXiv", "volume": "abs/2312.06254"}, "authors": [{"authorId": "1914072014", "name": "Maximilian Böther"}, {"authorId": "2151250902", "name": "Viktor Gsteiger"}, {"authorId": "2037883066", "name": "Ties Robroek"}, {"authorId": "2285439911", "name": "Ana Klimovic"}], "citations": [{"paperId": "d7c8466f87d747764264d80081a8ecc8a249e3ba", "title": "On Distributed Larger-Than-Memory Subset Selection With Pairwise Submodular Functions"}]}
