{"paperId": "a463af06e3ad07058e65d22da82c4e0728fc7e08", "publicationVenue": null, "title": "Customer Behavior Analysis Using Data Mining Techniques", "abstract": "Buying behavior is considered a critical role in organizations' marketing management. Analyzing accurate buying behavior helps entrepreneurs to adopt production plan and marketing effectively. This research proposes an enhanced approach to analyzing buying behavior of targeted customers to acquire their high dimensional data on buying product patterns. The method is divided into three stages: First stage is clustering purchase of products based on type of customers by using K-Means and selecting the appropriate clusters by using Elbow method. The outcome from this stage was the similar purchased product items, which were individually categorized; in the second stage analyzing buying behavior using Apriori Algorithm. Then in ARA-1 we specify threshold 2 values. They are support and confidence not less than 10% and 70%, respectively and ARA-2 is adding the Lift values to the threshold not less than 1. The outcomes from these stages were buying patterns of the individual group. And the third stage is the accuracy of buying product patterns were evaluated by experts. In this study, the finding was trialed using purchasing data from a retail store in Thailand, revealing that the proposed method was likely to effectively analyze buying behavior with dimensional data. The accuracy of buying behavior analysis ARA-2 was higher than 88% and higher than ARA-1 38%. Interestingly, the approach revealed new buying behavior not previously reported.", "venue": "2018 International Seminar on Application for Technology of Information and Communication", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2018-09-01", "journal": {"name": "2018 International Seminar on Application for Technology of Information and Communication", "pages": "549-554"}, "authors": [{"authorId": "52212682", "name": "Patcharin Ponyiam"}, {"authorId": "1400138132", "name": "S. Arch-int"}], "citations": [{"paperId": "c831cde3098b27f4b775232762c2e9ee3690ca7c", "title": "Decision Support Method for Product Replacement in Coin-Less Vending Machine Using Data Mining Techniques and Product Segmentation"}]}
