{"paperId": "a46a97abd5c5c38ac099aca26a34e50603575294", "publicationVenue": null, "title": "PENERAPAN KURSUS LEARNING MANAGEMENT SYSTEM (LMS) BAGI PENINGKATAN KOMPETENSI GURU DAN TENAGA KEPENDIDIKAN PAUD", "abstract": "Developments The world is currently faced with the phenomenon of digital disruption, which is a situation indicated by the movement of the industrial world or job competition that is no longer linear. In the field of courses, currently there has also been an online course service that can be accessed via the web/page. One is a Learning Management Systems (LMS) based course that allows instructors and/or students to share material, submit and return assignments, and communicate online. The research method used is research and development using the product development concept from ADDIE which consists of 5 stages, namely (1) analysis, (2) design, (3) development, (4) implementation, and (5) evaluation. The results of research and development of a Learning Management System (LMS)-based computer course model that has been tested on PAUD teachers and education staff show that the practicality of this model is very well implemented by instructors and can be applied by course organizers. The results of the course learning in the trial can improve the skills of PAUD teachers and education personnel in the office application computer course program.", "venue": "TEMATIK: Jurnal Pemikiran dan Penelitian Pendidikan Anak Usia Dini", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-06-20", "journal": {"name": "TEMATIK: Jurnal Pemikiran dan Penelitian Pendidikan Anak Usia Dini"}, "authors": [{"authorId": "2129359827", "name": "Jamaluddin Andi Katutui"}, {"authorId": "83943283", "name": "Arie Martuty"}, {"authorId": "2112606249", "name": "M. Abdullah"}], "citations": [{"paperId": "dc30bd8ddd383a8e7b1dff88fbb4741ddcf8cb11", "title": "Development of an information system for organizing and managing the educational process based on smart technologies"}]}
