{"paperId": "a46b6112792f0c297b7999b5ecaf782e99198534", "publicationVenue": {"id": "e7273f5c-e432-4640-9794-73e3278100db", "name": "SEISENSE Business Review", "alternate_names": ["SEISENSE Bus Rev"], "issn": "2788-7561", "url": "https://journal.seisense.com/index.php/sbr"}, "title": "Does Big Data Drive Innovation In E-Commerce: A Global Perspective?", "abstract": "Objective: Literature indicates big data is a competitive edge, which boasts a firm’s overall performance. With the rise of big data (BD), e-commerce firms are using the tools to engage more with customers, offer better products, and innovate more to gain a competitive advantage. Nevertheless, past empirical studies have shown conflicting results.\nDesign: Building on the capital-based perspective and the firm’s inertia concept, we created a model to explore how BD and BD analytics capability impact innovation results in e-commerce businesses. We carried out a two-year empirical investigation project to secure empirical data on 1703 data-driven innovation tasks from USA and Asia.\nFindings: We showed that there is a tradeoff between BD and BD analytics capability, in which the optimum balance of BD depends on the amount of BD analytics ability. BD analytics ability exerts a good moderating impact, that is, the better this capability is, the higher the effect of BD on gross margin and sales growth. For U.S. innovation tasks, BD has an inverted U-shaped relationship with sales innovation. For Asian innovation tasks, when major data capital is minimal, promoting big data analytics capability improves sales innovation and disgusting margin up to a specific point.\nPolicy Implications: Establishing BD analytics capability over that time could prevent innovation efficiency. Our findings offer guidance to e-commerce firms on producing strategic choices about source allocations for BD and BD analytics ability.\nOriginality: A limited research has been carried out to show the impact of using BD analytics tools to drive innovation. This is one of the first articles that dive into using BD to foster innovation in the e-commerce business.", "venue": "SEISENSE Business Review", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-06-30", "journal": {"name": "SEISENSE Business Review"}, "authors": [{"authorId": "2165360940", "name": "M. Sazu"}], "citations": [{"paperId": "5d7323563c934d6b0f47bf46ded3a4fe031a1bcf", "title": "Consumer Buying Behavior and ML: How Machine Learning and Analytics can Utilize Consumer Behavior Data for Better Customer Service?"}, {"paperId": "d473e4f84d89ba9d235a02e9eb2b6255bffcde01", "title": "Can Analytics Improve Manufacturing in Heavy Machinery Industry? Studies from Mexico"}, {"paperId": "d17d04f1583884853a456b875070952fc0cfd181", "title": "Data Driven Decision Making in Manufacturing Businesses in China and Asia Pacific"}, {"paperId": "40338f8f33a2aa16c8a877340ab8447e2f9e50f5", "title": "What makes Small and Medium Enterprises successful: A Study"}, {"paperId": "df026abc5df7039422f06f827284a6acdac31dfd", "title": "Role of Analytics and Accounting Information Systems in Profitability"}, {"paperId": "8f4890396450a854823577435722b60bb928ee65", "title": "How Data Analytics Drives Business Performance: A Study"}, {"paperId": "d50bafd50f70d8ad12f60b9478142d5964846cf8", "title": "How Credit Risk Management in Australia Can Affect Financial Institutions Growth: A Study"}, {"paperId": "63d9be945f6049a2a59b4a8369a5e7802bf32d8a", "title": "Big data in relation with business intelligence capabilities and e-commerce during COVID-19 pandemic in accountant’s perspective"}, {"paperId": "e2dbfcea3fecb5cb957644c4d07035e8962185d2", "title": "Decision-Making & Data Science: How Large Businesses Can Use Analytics to Shape Decisions"}, {"paperId": "478dd1ec3a18032243a519ecb8e78c70d6f3c73f", "title": "How to increase customer satisfaction in FMCG industry using social media analytics"}, {"paperId": "f7c4c764c8168ae5c25f923be9524ed31f359a60", "title": "Large-scale manufacturing in North America: How machine learning and analytics improve efficiency"}, {"paperId": "b5c43c35b07bf1431049cdbb736b771cb8ee237a", "title": "Digital healthcare in Europe and efficient patient care: role of analytics"}, {"paperId": "c532bbaa2880f476f474565eee9f8a02855d7612", "title": "Financial innovation at large financial services businesses: Evidence from Eastern Europe"}, {"paperId": "1170c818c75982c347797ffad40d32cc64c84cca", "title": "How the dairy industry in North America is leveraging analytics for increased efficiency"}, {"paperId": "f1bba37dbaffd60be899ec272f35e9e8aff68db5", "title": "Analytics and innovation management: Does big data play any role?"}, {"paperId": "a56b41eeb156f0072cfd1df82d8ff10e3b443f90", "title": "Intelligent manufacturing with machine learning: A perspective of European home goods industry"}, {"paperId": "fd04de088613c4e096c78aba14707ed7c70abbed", "title": "A NALYTICS AND L OCALIZED M ANUFACTURING : H OW M ACHINE L EARNING CAN H ELP I MPROVE E FFICIENCY"}, {"paperId": "804e362d66bba3674bd060f42926e451cfb708d6", "title": "How analytics drive business performance and profitability"}, {"paperId": null, "title": "To analyze the choices of Big Health Data • To identify Big Data analytical strategies and technologies in healthcare"}, {"paperId": "b4f4a88b878ff391a008086f9af24873c37b2961", "title": "Retail analytics and firm profitability: How analytics can help retail companies be successful"}, {"paperId": "7b1c09d75bec5a9081d2748d700737ada539f279", "title": "Role of analytics in driving innovation in the insurance industry in developing countries"}, {"paperId": "5eef402535cc2b5cb8b482a00f6c0823c23e4b4d", "title": "Detecting banking frauds with analytics and machine learning"}, {"paperId": "971a953baa6e892545501b408087053d07321c1a", "title": "The Role of E-commerce as an Innovative Solutions in the Development of the Saudi Economy"}, {"paperId": "c8db268a9a0d28f580ecbba24087ffc1dde396fb", "title": "How Innovation Plays a Role in Banking and Increases Profitability"}, {"paperId": "9c4a4ba1c01290cdcb8f49b916285ea545ab749a", "title": "Implementation of Big Data Analytics in Electronics Manufacturing Industry: Impact and Profitability"}, {"paperId": "08567b2372657e5b2653eb5fa13bb4d95b83eddf", "title": "Automotive Manufacturing Firms and Their Usage of Machine Learning to Drive Efficiency in Asia"}, {"paperId": "bcba0fa10f1224098cd4bca83b92ed8e811448f1", "title": "Decision-making in large corporations - role of big data analytics & data mining"}, {"paperId": "49ee95975e2019b0fd9846024f6a092edc4d325e", "title": "Firm level strategic decision-making with data science & analytics"}, {"paperId": "24fe0e62841fcf3a80b120e696d076e4cca6d8c0", "title": "Impact of social media analytics on digital innovation"}, {"paperId": "81191740b715705b947dbeaa19c17c7cec3611dc", "title": "Business performance analytics & firm performance: an Indian case study"}, {"paperId": "be0846f463a22b06c9a562265dec51fc80c5cf20", "title": "How healthcare industry in Arabs can use data science for sustainable healthcare practices"}, {"paperId": "77bb54027f54f16e585272cda07a1eed0568e864", "title": "Relationship between analytics and innovation in software based firms in Europe"}, {"paperId": "daf32bd5cc03c0fa61cdba9b574aac056d4bf753", "title": "Impact of analytics on supply chain management"}, {"paperId": "9184c92f5096c40fa1ccb35421a9447d706e2b7a", "title": "Big data analytics and its impact on efficient banking in Europe-Asia"}, {"paperId": "c8e4dfd2cad9b7a3194d1818ce80dc6dca6a7e22", "title": "Big data and its role on fostering innovation in Asia"}, {"paperId": "f1baf7faae9f9b1246028af23ad5bf8be6aec5a4", "title": "Role of IT & analytics on business performance"}, {"paperId": "72b714ace596c334104ac02d72250c24b91c3ac6", "title": "Role of big data analytics & it in sustainable healthcare services across Europe"}, {"paperId": "5b2185d9a96f9ddf596d75b0f52855909a2bfaa1", "title": "Impact of data analytics in transforming the decision-making process"}, {"paperId": "02389959b3ad535a44093e21645841d54cc93e34", "title": "How analytics is driving the supply chain innovation in North America"}, {"paperId": "80c579ad09cb75f361da92e38fb5aa6070b4ceec", "title": "How analytics can impact firm performance in Japanese software companies"}, {"paperId": "eb27b31089b9e72153e60bdb71a16ed07fa5c69f", "title": "Impact of big data analytics & machine learning on innovation of manufacturing companies"}, {"paperId": "1826c4791e0ae5533931d2d58889702c842c04dc", "title": "H EALTHCARE A NALYTICS IN N ON - PROFITS : E VIDENCE FROM N ORTH A MERICA"}, {"paperId": "a4ba1b7fbd805ceee7de19095bcbcd4904ac06dd", "title": "B USINESSES I NNOVATION & AI-H OW AI AND A NALYTICS CAN E NCOURAGE I NNOVATION"}]}
