{"paperId": "a47590b511aec87e705efd7ab5162b57d5fca218", "publicationVenue": {"id": "9846de51-dadf-4086-9e40-62466a7e2c87", "name": "International Conference on Fog and Mobile Edge Computing", "type": "conference", "alternate_names": ["FMEC", "Int Conf Fog Mob Edge Comput"]}, "title": "IESF: Interval Event Streaming Format for the Data Lake of Production", "abstract": "The Industrial Internet of Things (IIoT) collects data from heterogeneous sensor networks, individual instruments, machine controls, and other interconnected devices. The transmission of data to a central repository, such as a data lake, and its aggregation is considered one of the prerequisites for Industry 4.0 and the Internet of Production (IoP). In the vast majority of cases, data collected by IIoT systems is transmitted as continuous stream of time-stamped measurement data. However, for the analysis and optimization of industrial processes, data needs to be aggregated and transformed into process-centric data models that represent the process as a discrete sequence of events. Established protocols such as OPC UA or XES support only one perspective each: that of the machines or that of the process. Our aim therefore is, to develop a unified data streaming message format that enables IIoT systems to collect and transmit machine-centric time series data enriched with process-centric temporal structuring. This is achieved by defining a set of six data streaming message types that are capable of communicating data linked to instants, time intervals and sets of time intervals. We validate the capabilities of the proposed format by applying it to the discontinuous, cyclic High-Pressure Die Casting (HPDC) process. We demonstrate that the introduction of the interface facilitates efficient transmission of process data and reduced effort in data retrieval, preparation and analysis.", "venue": "International Conference on Fog and Mobile Edge Computing", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-09-18", "journal": {"name": "2023 Eighth International Conference on Fog and Mobile Edge Computing (FMEC)", "pages": "159-166"}, "authors": [{"authorId": "2265671021", "name": "Michael Zeng"}, {"authorId": "151490847", "name": "Maximilian Rudack"}, {"authorId": "2238690193", "name": "Mario Moser"}, {"authorId": "2188867019", "name": "Sebastian Ulrich"}, {"authorId": "2020710550", "name": "Aymen Gannouni"}, {"authorId": "2238960686", "name": "Anas Abdelrazeq"}, {"authorId": "2265671207", "name": "A. Bührig-Polaczek"}, {"authorId": "2238591843", "name": "Robert H. Schmitt"}], "citations": []}
