{"paperId": "a48a466be411ca807ebb37c19818c21557a3c3ad", "publicationVenue": {"id": "bb40a041-3875-45d5-afd4-e1c75f896fa6", "name": "IEEE Transactions on Wireless Communications", "type": "journal", "alternate_names": ["IEEE Trans Wirel Commun"], "issn": "1536-1276", "url": "http://www.comsoc.org/twc/", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=7693", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=7693&year=2005"]}, "title": "Energy-Efficient Cooperative Offloading for Edge Computing-Enabled Vehicular Networks", "abstract": "Edge computing technology has great potential to improve various computation-intensive applications in vehicular networks by providing sufficient computation resources for vehicles. However, inappropriate task offloading to roadside units (RSUs) can lead to large energy consumption, which will result in negative economic, environmental, and performance impacts. Therefore, in this paper, we develop the energy-efficient cooperative offloading scheme for edge computing-enabled vehicular networks. We first establish a novel cooperative offloading model to multiple RSUs for given batch of moving vehicles, different from existing works that consider single vehicle only or static users. Then, we consider the total energy minimization by optimizing the task splitting ratio, computation resource, and communication resource, which is a challenging non-convex problem, and provide optimal solutions for multi-vehicle case and single-vehicle case, respectively. Furthermore, we extend our proposed scheme to the one for a more realistic scenario (i.e., online scenario), where batches of vehicles sequentially approach the RSUs. Finally, through numerical results, the impact of network parameters on the total energy consumption is analyzed, and we verify that our proposed solution consumes lower energy than baseline schemes.", "venue": "IEEE Transactions on Wireless Communications", "year": 2021, "fieldsOfStudy": ["Engineering", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-11-01", "journal": {"name": "IEEE Transactions on Wireless Communications", "pages": "10709-10723", "volume": "21"}, "authors": [{"authorId": "46260698", "name": "Hewon Cho"}, {"authorId": "145289769", "name": "Ying Cui"}, {"authorId": "1730102", "name": "Jemin Lee"}], "citations": [{"paperId": "58c1e3226233ed34f01da3518cdd49c59bb180b0", "title": "UEE–Delay Balanced Online Resource Optimization for Cooperative MEC-Enabled Task Offloading in Dynamic Vehicular Networks"}, {"paperId": "9839a923aae266dd74f7b90fda159faa588d6533", "title": "Cost-effective task partial offloading and resource allocation for multi-vehicle and multi-MEC on B5G/6G edge networks"}, {"paperId": "2dfea5d93cdf623ab6769f7c2f498506b2545ef6", "title": "A communication link lifetime prediction-supported V2V partial computation offloading scheme for autonomous driving"}, {"paperId": "3ee0c5efdf0cf3b9118e673eac23d4c882cc8425", "title": "PPO-Based Energy-Efficient Power Control and Spectrum Allocation in In-Vehicle HetNets"}, {"paperId": "85c81e6c8d75344a9e41581598bb3e97a77cd288", "title": "Partial Replication-Enabled Cooperative Transmission for Distributed Edge Computing"}, {"paperId": "acaf63bb6b7897a5fc2e87a543b3d7c960e7e95a", "title": "Joint Task Offloading and Dispatching for MEC With Rational Mobile Devices and Edge Nodes"}, {"paperId": "953515a513bd9e14576e84eadd7a64e2efed554d", "title": "A game theory-based COVID-19 close contact detecting method with edge computing collaboration"}, {"paperId": "024ca4501c0b7f6d911bbc810eec63e2866e6589", "title": "An energy-efficient resource allocation strategy in massive MIMO-enabled vehicular edge computing networks"}]}
