{"paperId": "a4a80e375b3acc4ea7b09bd7c9c3b3e02e3fbb54", "publicationVenue": null, "title": "A framework for high-throughput sequence alignment using real processing-in-memory systems", "abstract": "Abstract Motivation Sequence alignment is a memory bound computation whose performance in modern systems is limited by the memory bandwidth bottleneck. Processing-in-memory (PIM) architectures alleviate this bottleneck by providing the memory with computing competencies. We propose Alignment-in-Memory (AIM), a framework for high-throughput sequence alignment using PIM, and evaluate it on UPMEM, the first publicly available general-purpose programmable PIM system. Results Our evaluation shows that a real PIM system can substantially outperform server-grade multi-threaded CPU systems running at full-scale when performing sequence alignment for a variety of algorithms, read lengths, and edit distance thresholds. We hope that our findings inspire more work on creating and accelerating bioinformatics algorithms for such real PIM systems. Availability and implementation Our code is available at https://github.com/safaad/aim.", "venue": "Bioinform.", "year": 2022, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-08-02", "journal": {"name": "Bioinformatics", "volume": "39"}, "authors": [{"authorId": "2096162793", "name": "Safaa Diab"}, {"authorId": "2161432189", "name": "Amir Nassereldine"}, {"authorId": "3387282", "name": "M. Alser"}, {"authorId": "2167029308", "name": "Juan G'omez-Luna"}, {"authorId": "145929920", "name": "O. Mutlu"}, {"authorId": "3077499", "name": "I. E. Hajj"}], "citations": [{"paperId": "c9edf92c1f762c52a90cc0cb45eb06d4eed82110", "title": "MIMDRAM: An End-to-End Processing-Using-DRAM System for High-Throughput, Energy-Efficient and Programmer-Transparent Multiple-Instruction Multiple-Data Computing"}, {"paperId": "d5f2e95be45d3e003655a9a84e0adda9468b0838", "title": "MIMDRAM: An End-to-End Processing-Using-DRAM System for High-Throughput, Energy-Efficient and Programmer-Transparent Multiple-Instruction Multiple-Data Processing"}, {"paperId": "9e98cd878653b68710d89248881433f95da35b4b", "title": "Accelerating Graph Neural Networks on Real Processing-In-Memory Systems"}, {"paperId": "f18efe8584a289459120db7e3247269a560a9db8", "title": "Accelerating Multiple Sequence Alignments Using Parallel Computing"}, {"paperId": "a2bd05bf3b3e37701bde5e71518bb35b3bcf6960", "title": "PIM-STM: Software Transactional Memory for Processing-In-Memory Systems"}, {"paperId": "72eeab8ea86b4a3ebc6a029e0f3a932b59469679", "title": "SequenceLab: A Comprehensive Benchmark of Computational Methods for Comparing Genomic Sequences"}, {"paperId": "fa1fffe6de081eba28cae5f29eca810834cdbb6d", "title": "TSUNAMI: A GPU Implementation of the WFA Algorithm"}, {"paperId": "711910e69879e512fde3f591eca5447a46625e00", "title": "SimplePIM: A Software Framework for Productive and Efficient Processing-in-Memory"}, {"paperId": "87411e3dc48b89cc8a1f4138f80977b4f60301c2", "title": "GateSeeder: Near-memory CPU-FPGA Acceleration of Short and Long Read Mapping"}, {"paperId": "4e268759f57e64f59febafb0250071dee4a8cffe", "title": "Evaluating Homomorphic Operations on a Real-World Processing-In-Memory System"}, {"paperId": "dc582ed585c8e99f40089877e03dc9412a92d93a", "title": "GAPiM: Discovering Genetic Variations on a Real Processing-in-Memory System"}, {"paperId": "7a391064a366fb8dfb550ea29ed3a4e292a1c207", "title": "Lightning Talk: Memory-Centric Computing"}, {"paperId": "56b85672e02fb1800c2f7a529c756f8e4ce4e40a", "title": "Memory-Centric Computing"}, {"paperId": "03cc4c5afac8a0c311fdfa3ac0926a0d0e028bad", "title": "Invited: Accelerating Genome Analysis via Algorithm-Architecture Co-Design"}, {"paperId": "f0206e82d279ad4d9ae4eaf17273b7e20edafd46", "title": "Porting and Optimizing BWA-MEM2 Using the Fujitsu A64FX Processor"}, {"paperId": "4d2be7d4f3f797a32805362de585e572ec36a1bb", "title": "TransPimLib: A Library for Efficient Transcendental Functions on Processing-in-Memory Systems"}, {"paperId": "e2b920c623dd1b00577fee7f081c13b047025141", "title": "TransPimLib: Efficient Transcendental Functions for Processing-in-Memory Systems"}, {"paperId": "f75e5d8cb6d3c10cf15c5011870e436320af59c6", "title": "RawHash: enabling fast and accurate real-time analysis of raw nanopore signals for large genomes"}, {"paperId": "204ec35646fcea9223a1f8f5b93da3586f46690a", "title": "GenPIP: In-Memory Acceleration of Genome Analysis via Tight Integration of Basecalling and Read Mapping"}, {"paperId": "0358743aa728c8913b08247731668cb201d9f8d8", "title": "SwiftRL: Towards Efficient Reinforcement Learning on Real Processing-In-Memory Systems"}]}
