{"paperId": "a4b706b3c607f37f28e5e6396ba560e1964b9401", "publicationVenue": {"id": "e82485bc-2195-4cf5-9f9a-012501918b2f", "name": "Annual Conference on Innovation and Technology in Computer Science Education", "type": "conference", "alternate_names": ["Integrating Technology into Computer Science Education", "Integrating Technol Comput Sci Educ", "Annu Conf Innov Technol Comput Sci Educ", "ITiCSE"], "url": "https://sigcse.org/sigcse/events/iticse/"}, "title": "Seamless Integration of NoSQL class into the Database Curriculum", "abstract": "Since NoSQL emerged a decade ago, it has rapidly gained popularity and has been actively incorporated into data management solutions for big data. This phenomenon brings positive challenges to accommodate NoSQL topics in the database curriculum. This paper presents our experience of teaching a NoSQL class over the last three years. The course uses a comprehensive teaching methodology that combines lectures, hands-on assignments, projects, and research-based approaches. The methodology aims at both students' in-depth learning and seamless integration of NoSQL topics into the database curriculum. The teaching methodology and course contents are detailed. Student evaluations of teaching, assessment results, success stories, and challenges and lessons learned are presented.", "venue": "Annual Conference on Innovation and Technology in Computer Science Education", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2020-06-02", "journal": {"name": "Proceedings of the 2020 ACM Conference on Innovation and Technology in Computer Science Education"}, "authors": [{"authorId": "2888183", "name": "Suneuy Kim"}], "citations": [{"paperId": "30b82de7458fcbe1e6409a1260c71ed4c1025bcd", "title": "Towards a Validated Self-Efficacy Scale for Data Management"}, {"paperId": "c69306aa1b9d115584d3a58c2b35656cd58e6a5e", "title": "Teaching about Data and Databases"}, {"paperId": "baf58cd968d169e4b1356462bd6aad162ffb978f", "title": "RDeF: Prosuming Interactive Stories to Train RDF and SPARQL"}, {"paperId": "d7b5a9b30868a8cedb86292bde8f57b33c53ecdd", "title": "SQL2X: Learning SQL, NoSQL, and MapReduce via Translation"}, {"paperId": "6600cb170741c233229ce357cb17bbed34d01352", "title": "One DB Does Not Fit It All: Teaching the Differences in Advanced Database Systems"}, {"paperId": "218827ade57e6691a314c2c54b43bdaed22019de", "title": "Introduction to Distributed Nearest Hash: On Further Optimizing Cloud Based Distributed kNN Variant"}]}
