{"paperId": "a4be3d63aa5fc23169c8fbb8620d1bb2b950b0b4", "publicationVenue": {"id": "228761ec-c40a-479b-8309-9dcbe9851bcd", "name": "IEEE Internet of Things Journal", "type": "journal", "alternate_names": ["IEEE Internet Thing J"], "issn": "2327-4662", "url": "https://www.ieee.org/membership-catalog/productdetail/showProductDetailPage.html?product=PER288-ELE", "alternate_urls": ["https://ieeexplore.ieee.org/servlet/opac?punumber=6488907", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6488907", "http://ieee-iotj.org/#"]}, "title": "A Decentralized Intrusion Detection System for Security of Generation Control", "abstract": "Recently, several incidents have been reported relating to security breaches in the power system network. As the operation of the automatic generation control (AGC) system fully depends on communication technologies, any compromise in its functionality could lead to total system collapse. For example, the intruders may target the communication network of the legacy grid by launching deception and data-availability attacks, which have the potential to manipulate the crucial telemetered quantities, such as wide-area sensor measurements and (or) the control signals. Despite significant work on AGC security, most of the past studies were limited to the detection of intrusions in sensor measurements, and less emphasis is given to addressing the impact of attacks on control signals. To this end, this article proposes a decentralized intrusion detection system (IDS) that jointly identifies data anomalies in the sensor measurement and the control signals. The IDS is powered by a novel machine learning (ML) classifier, which we call cluster-driven ensemble learning (CDEL) algorithm. The proposed CDEL is based on the ensemble principle that combines the predictive power of multiple support vector machines and the $K$ -means clustering algorithm. Experimental results reveal the supremacy of CDEL over existing state-of-the-art ML techniques.", "venue": "IEEE Internet of Things Journal", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-10-01", "journal": {"name": "IEEE Internet of Things Journal", "pages": "18924-18933", "volume": "9"}, "authors": [{"authorId": "1641464666", "name": "S. Roy"}, {"authorId": "9219688", "name": "S. Debbarma"}, {"authorId": "2055756259", "name": "Adnan Iqbal"}], "citations": [{"paperId": "822eac0ceaafe20c29b30fac910bd5c9d46b3916", "title": "Joint contribution of RTEM and AGC system for frequency stabilisation in renewable energy integrated power system"}, {"paperId": "9623c2ed5bf3a8d209952b26431562c0eb90ecc7", "title": "Blockchain for secure and decentralized artificial intelligence in cybersecurity: A comprehensive review"}, {"paperId": "599e6e1ed05345076e2f8d352aafb8894d2d1977", "title": "A Reinforcement Learning Approach to Undetectable Attacks Against Automatic Generation Control"}, {"paperId": "be6898790d6e35218495c80a5829884103ecbe7a", "title": "Quantum walks-based classification model with resistance for cloud computing attacks"}, {"paperId": "e619714d55e3e8b6324c0098461f10d4cc067a42", "title": "Distributed cyber-physical intrusion detection using stacking learning for wide-area protection system"}, {"paperId": "d8b47c38fd5810a9140f3e1433d566a84595c34b", "title": "Cyber-Physical GNN-Based Intrusion Detection in Smart Power Grids"}, {"paperId": "fc4ff284cd15b915c55519becc615f5eef2804b4", "title": "Comparative Analysis of Various Controllers used for Automatic Generation Control in Electrical Power Systems"}, {"paperId": "1c0c1863275d2653f644a39db8f929fe7fece045", "title": "A Non-Iterative Model-Based Intrusion Detection System for AGC System"}, {"paperId": "166fea54f05c8577022ae730950474e2aa4e205d", "title": "Integration of AGC and Real-Time Energy Market Model in Power Systems for Dynamic Performance Analysis"}, {"paperId": "562c7885b30fd1dacfbf1653b47c115a739c61a3", "title": "An Intelligent Cyber Threat Classification System"}, {"paperId": "de2549588e3675ac82121f11d0b78f52fb100342", "title": "Detection and Localization of Data Forgery Attacks in Automatic Generation Control"}]}
