{"paperId": "a4bfb2d0d8bc15d81be92a6bcba183803d7cd134", "publicationVenue": {"id": "6175efe8-6f8e-4cbe-8cee-d154f4e78627", "name": "Mathematics", "issn": "2227-7390", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-283014", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-283014", "https://www.mdpi.com/journal/mathematics"]}, "title": "A Reliable Prediction Algorithm Based on Genre2Vec for Item-Side Cold-Start Problems in Recommender Systems with Smart Contracts", "abstract": "Personalized recommender systems are used not only in e-commerce companies but also in various web applications. These systems conventionally use collaborative filtering (CF) and content-based filtering approaches. CF operates using memory-based or model-based methods; both methods use a user-item matrix that considers user preferences as items. This matrix denotes information on user preferences, which refers to the user ratings for items. The model-based method exploits the fact that the input matrix is factorized. CF approaches can effectively provide personalized recommendation results to users; however, cold-start problems arise because both these methods depend on the users’ ratings for items to predict users’ preferences. We proposed an approach to alleviate the cold-start problem along with a methodology for utilizing blockchain that can enhance the reliability of the processes of the recommendations. We attempted to predict an average rating for a new item to alleviate item-side cold-start problems. First, we applied the concept of word2vec, treating each user’s item-selection history as a sentence. Then, we derived genre2Vec based on the skip-gram technique and predicted an average rating for a new item by utilizing the vectors and category ratings. We experimentally demonstrated that our approach could generate more accurate results than conventional CF approaches could. We also designed the processes of the recommendation based on the concept of blockchain addressing the smart contract. Based on our approach, we proposed a system that can secure reliability as well as alleviate the cold-start problems in recommender systems.", "venue": "Mathematics", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-07-03", "journal": {"name": "Mathematics"}, "authors": [{"authorId": "2222353538", "name": "Yong Eui Kim"}, {"authorId": "2108733719", "name": "Sang-Min Choi"}, {"authorId": "2200086720", "name": "Dongwoo Lee"}, {"authorId": "2221864679", "name": "Yeong Geon Seo"}, {"authorId": "2191873521", "name": "Suwon Lee"}], "citations": [{"paperId": "6154f50ca524d3b7a7104f8e1025c803089255e2", "title": "GSRec: A Graph-Sequence Recommendation System Based on Reverse-Order Graph and User Embedding"}]}
