{"paperId": "a4c2131a637b85fbc5286c5ce96c8b7ab05e376a", "publicationVenue": {"id": "3007ca7d-dbd5-4f0b-a656-b65018773a61", "name": "International Symposium on High-capacity Optical Networks and Enabling Technologies", "type": "conference", "alternate_names": ["HONET", "Int Symp High-capacity Opt Netw Enabling Technol"]}, "title": "VDAG: A vehicle-to-vehicle opportunistic resource sharing framework for dependent tasks", "abstract": "Internet of Vehicles (IOV) has emerged as a promising paradigm with the recent advancements in vehicular networks. Vehicle-to-vehicle (V2V) communication is proven to be an exceptionally effective communication mechanism for delay-sensitive information exchange. The IoT enabled smart vehicles to support many new applications to facilitate end-users. Most of these applications required near real-time computation for delay-sensitive applications. However, the smart vehicles are resource-constrained especially to deal with multilevel Directed Acyclic Graph (DAG) tasks. Therefore, to better utilize the available resources nearby, the resource-constrained vehicles can offload the tasks to under-utilize vehicles. In this paper, we present a task offloading framework in a vehicle-to-vehicle environment by exploring the idle resources nearby. The proposed work focuses on sub-tasks offloading along with the early start time, this can help the vehicle to better schedule the offloaded tasks. The source vehicle can acquire an execution slot on the remote vehicle to optimize the incoming DAG task. The proposed system is compared with the traditional approach in terms of queue length, and efficiency with variable task and vehicle arrival rate.", "venue": "International Symposium on High-capacity Optical Networks and Enabling Technologies", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-12-19", "journal": {"name": "2022 IEEE 19th International Conference on Smart Communities: Improving Quality of Life Using ICT, IoT and AI (HONET)", "pages": "069-074"}, "authors": [{"authorId": "2202405068", "name": "Areeba Iftikhar"}, {"authorId": "31144325", "name": "A. Malik"}, {"authorId": "31321802", "name": "A. U. Rahman"}, {"authorId": "1740261", "name": "S. Khan"}], "citations": []}
