{"paperId": "a4d894dc43b7335c3ed00adb9918caa185e246c4", "publicationVenue": {"id": "c545d136-74ba-4905-8ed9-b9ec76a5e444", "name": "Sistemi Evoluti per Basi di Dati", "type": "conference", "alternate_names": ["SEBD", "Sist Evol Basi Dati"], "url": "http://www.sebd.org/"}, "title": "An Approach to Trade-off Privacy and Classification Accuracy in Machine Learning Processes", "abstract": "Machine learning techniques applied to large and distributed data archives might result in the disclosure of sensitive information. Data often contain sensitive identifiable information, and even if these are protected, the excessive processing capabilities of current machine learning techniques might facilitate the identification of individuals. This discussion paper presents a decision-support framework for data anonymization. The latter relies on a novel approach that exploits data correlations, expressed in terms of relaxed functional dependencies (rfds), to identify data anonymization strategies for providing suitable trade-offs between privacy and data utility. It also permits to generate anonymization strategies leveraging multiple data correlations simultaneously to increase the utility of anonymized datasets. In addition, our framework provides support in the selection of the anonymization strategies by enabling an understanding of the trade-offs between privacy and data utility offered by the obtained strategies. Experiments on real-life datasets show that our approach achieves promising results in data utility while guaranteeing the desired privacy level. Additionally, it allows data owners to select anonymization strategies balancing their privacy and data utility requirements.", "venue": "Sistemi Evoluti per Basi di Dati", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"pages": "420-429"}, "authors": [{"authorId": "3053303", "name": "Loredana Caruccio"}, {"authorId": "51220758", "name": "Domenico Desiato"}, {"authorId": "1745736", "name": "G. Polese"}, {"authorId": "1695827", "name": "G. Tortora"}, {"authorId": "2259192077", "name": "Nicola Zannone"}], "citations": []}
