{"paperId": "a4f5adc6e82e0ab1b5233d81304b41a409c3b765", "publicationVenue": {"id": "9bc219ae-a4dc-4241-8e1a-0552f9ee9ef7", "name": "International Symposium on Circuits and Systems", "type": "conference", "alternate_names": ["ISCAS", "Int Symp Circuit Syst"]}, "title": "Event-based Classification with Recurrent Spiking Neural Networks on Low-end Micro-Controller Units", "abstract": "Due to its intrinsic sparsity both in time and space, event-based data is optimally suited for edge-computing applications that require low power and low latency. Time varying signals encoded with this data representation are best processed with Spiking Neural Networks (SNN). In particular, recurrent SNNs (RSNNs) can solve temporal tasks using a relatively low number of parameters, and therefore support their hardware implementation in resource-constrained computing architectures. These premises propel the need of exploring the properties of these kinds of structures on low-power processing systems to test their limits both in terms of computational accuracy and resource consumption, without having to resort to full-custom implementations. In this work, we implemented an RSNN model on a low-end, resource-constrained ARM-Cortex-M4-based Micro Controller Unit (MCU). We trained it on a down-sampled version of the N-MNIST event-based dataset for digit recognition as an example to assess its performance in the inference phase. With an accuracy of 97.2%, the implementation has an average energy consumption as low as $4.1\\ \\mu\\mathrm{J}$ and a worst-case computational time of $150.4\\ \\mu\\mathrm{s}$ per time-step with an operating frequency of 180 MHz, so the deployment of RSNNs on MCU devices is a feasible option for small image vision real-time tasks.", "venue": "International Symposium on Circuits and Systems", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-21", "journal": {"name": "2023 IEEE International Symposium on Circuits and Systems (ISCAS)", "pages": "1-5"}, "authors": [{"authorId": "2141212127", "name": "Chiara Boretti"}, {"authorId": "151438227", "name": "Luciano Prono"}, {"authorId": "38613620", "name": "C. Frenkel"}, {"authorId": "1721210", "name": "G. Indiveri"}, {"authorId": "1827025", "name": "F. Pareschi"}, {"authorId": "1685605", "name": "Mauro Mangia"}, {"authorId": "1728694", "name": "R. Rovatti"}, {"authorId": "1731098", "name": "G. Setti"}], "citations": [{"paperId": "9db443afa22bc2c02ec286683ca0b5f184c24d82", "title": "Magnetic Field Gated and Current Controlled Spintronic Mem-transistor Neuron -based Spiking Neural Networks"}]}
