{"paperId": "a50bb0d8b08235b03d813134712f4c33a7651a69", "publicationVenue": {"id": "2662565c-90e7-4514-bda8-3f77dd60f848", "name": "Journal of Business and Management Sciences", "type": "journal", "alternate_names": ["Journal of business & management sciences", "J Bus Manag Sci", "J bus  manag sci"], "issn": "2333-4533", "alternate_issns": ["2220-9220"], "url": "http://www.sciepub.com/journal/JBMS", "alternate_urls": ["https://www.iiu.edu.pk/?page_id=7536"]}, "title": "Artificial Intelligence Inclusion and Performance of Sensor Management System in Nairobi-City Water and Sewerage Company, Kenya", "abstract": "Performance has always been the most important and pressing problem for any firm worldwide. The research aimed at determining the inclusion of Artificial Intelligence such as fault detection, data mining, information inference and pattern recognition on the performance of sensor management system. The research was anchored on Technology Acceptance Model whereby descriptive and exploratory research design was adopted. The study target population was 360 and the sample size of 108 respondents were selected which represented the 30% of the target population. The researcher personally administered the questionnaire to the respondents, drop and pick method was adopted. Data were analysed by the use of descriptive, rational and inferential analysis. It can be revealed that the inclusion of artificial intelligence enables fault detection to be completed quickly, increasing user efficiency. In addition, the management system and procedures are done effectively with the inclusion of artificial intelligence. For effective data analysts to make decisions in real time, data mining is crucial. Since pattern recognition generates more value for a business, it is widely known that the sensor management system's effectiveness partially rely on data inferencing. According to the study, Nairobi City Water and Sewerage Company should regularly train their employees on the newest addition of artificial intelligence trends. To increase effectiveness, the sensor management system should be integrated. Create new competitive strategies and increase technology investments in pattern recognition.", "venue": "Journal of Business and Management Sciences", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-07", "journal": {"name": "Journal of Business and Management Sciences"}, "authors": [{"authorId": "2223018004", "name": "Roger Kibet Kiplagat"}, {"authorId": "122459237", "name": "M. Mutuku"}], "citations": [{"paperId": "82dfe65ec0595c833c9fb71d49e6cb574d5623d5", "title": "Advancing Urban Wastewater Management: Optimizing Sewer Performance through Innovative Material Selection for the Armlet with a Wet Circuit Measurement System"}]}
