{"paperId": "a50b0793b3438f187e7f01ac4a8c6d5297053f01", "publicationVenue": {"id": "8e1bd4b5-d5b2-4e22-ba0a-01fe5568d472", "name": "Remote Sensing", "type": "journal", "alternate_names": ["Remote Sens"], "issn": "2315-4675", "alternate_issns": ["2072-4292"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169233", "alternate_urls": ["https://www.mdpi.com/journal/remotesensing", "http://www.mdpi.com/journal/remotesensing", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169233"]}, "title": "Hierarchical Sparse Subspace Clustering (HESSC): An Automatic Approach for Hyperspectral Image Analysis", "abstract": "Hyperspectral imaging techniques are becoming one of the most important tools to remotely acquire fine spectral information on different objects. However, hyperspectral images (HSIs) require dedicated processing for most applications. Therefore, several machine learning techniques were proposed in the last decades. Among the proposed machine learning techniques, unsupervised learning techniques have become popular as they do not need any prior knowledge. Specifically, sparse subspace-based clustering algorithms have drawn special attention to cluster the HSI into meaningful groups since such algorithms are able to handle high dimensional and highly mixed data, as is the case in real-world applications. Nonetheless, sparse subspace-based clustering algorithms usually tend to demand high computational power and can be time-consuming. In addition, the number of clusters is usually predefined. In this paper, we propose a new hierarchical sparse subspace-based clustering algorithm (HESSC), which handles the aforementioned problems in a robust and fast manner and estimates the number of clusters automatically. In the experiment, HESSC is applied to three real drill-core samples and one well-known rural benchmark (i.e., Trento) HSI datasets. In order to evaluate the performance of HESSC, the performance of the new proposed algorithm is quantitatively and qualitatively compared to the state-of-the-art sparse subspace-based algorithms. In addition, in order to have a comparison with conventional clustering algorithms, HESSC’s performance is compared with K-means and FCM. The obtained clustering results demonstrate that HESSC performs well when clustering HSIs compared to the other applied clustering algorithms.", "venue": "Remote Sensing", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-07-28", "journal": {"name": "Remote. Sens.", "pages": "2421", "volume": "12"}, "authors": [{"authorId": "152394440", "name": "Kasra Rafiezadeh Shahi"}, {"authorId": "1876308", "name": "M. Khodadadzadeh"}, {"authorId": "80717876", "name": "Laura Tusa"}, {"authorId": "2370080", "name": "Pedram Ghamisi"}, {"authorId": "1402012203", "name": "R. Tolosana-Delgado"}, {"authorId": "2971695", "name": "R. Gloaguen"}], "citations": [{"paperId": "66d0ea43841a2052c831c161a94e9c2ac6b36fb6", "title": "Principle Component Trees and Their Persistent Homology"}, {"paperId": "38994f7778a5406f9eaf513f1e1d94c4e5bda7ca", "title": "Structured-Anchor Projected Clustering for Hyperspectral Images"}, {"paperId": "24f7ccf2a26b6538aed90ed1a4132fadfd6d998c", "title": "Spatial Granule based Clustering Technique for Hyperspectral Images"}, {"paperId": "c7117614b3b18dbc6d93f35752a6f16e591942e8", "title": "An Application of Hyperspectral Image Clustering Based on Texture-Aware Superpixel Technique in Deep Sea"}, {"paperId": "d5f178a5d55c1df5fdfe568d0661556b249b189c", "title": "AAE-Dpeak-SC: A Novel Unsupervised Clustering Method for Space Target ISAR Images Based on Adversarial Autoencoder and Density Peak-Spectral Clustering"}, {"paperId": "05efbfe5e3eed58ec9eeca384063d41d595473e2", "title": "Affinity Propagation Based on Structural Similarity Index and Local Outlier Factor for Hyperspectral Image Clustering"}, {"paperId": "5dd3e0e7f1da307d5a7c8cda460f3aa3845e1b3c", "title": "Large-Scale Hyperspectral Image Clustering Using Contrastive Learning"}, {"paperId": "2e01c8a8ca2a34589314c4eb7cfc141945e11f3f", "title": "Data Fusion Using a Multi-Sensor Sparse-Based Clustering Algorithm"}, {"paperId": "6dcbdf2ccde5683d34ac047d1b8362c02a418852", "title": "Graph-Based Structural Deep Spectral-Spatial Clustering for Hyperspectral Image"}, {"paperId": "2f7fd65d581295cf238e17c4aafd163fde591ae5", "title": "Spectral-Spatial Superpixel Anchor Graph-Based Clustering for Hyperspectral Imagery"}, {"paperId": "bea953475a157da1f571525407ac098f2873f1a0", "title": "MS$^{2}$A-Net: Multiscale Spectral–Spatial Association Network for Hyperspectral Image Clustering"}, {"paperId": "8cedf5589ebc5aee84348a400d1a4c24dab2f173", "title": "Superpixel Contracted Neighborhood Contrastive Subspace Clustering Network for Hyperspectral Images"}, {"paperId": "7d1ee7779faeefa4fdec847f634e0270bc651d24", "title": "Research on Disease and Pest Prediction Model Based on Sparse Clustering Algorithm"}, {"paperId": "5485d4844ac6b19861f6427184abcfb604dc81b6", "title": "A Resource Optimization Algorithm for Collaborative and Cognitive Systems Based on Sparse Clustering Algorithm"}, {"paperId": "8cffeb1ed581788ec8fd1e08e7bc09c9f6f9b9b6", "title": "Hyperspectral Imaging Algorithms and Applications: A Review"}]}
