{"paperId": "a510578d1de1abc11b80a43db798eeecc7c355b0", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "System-Level Performance Analysis of Cooperative Multiple Unmanned Aerial Vehicles for Wildfire Surveillance Using Agent-Based Modeling", "abstract": "In this paper, we propose an agent-based approach for the evaluation of Multiple Unmanned Autonomous Vehicle (MUAV) wildfire monitoring systems for remote and hard-to-reach areas. Emerging environmental factors are causing a higher number of wildfires and keeping these fires in check is becoming a global challenge. MUAV deployment for the monitoring and surveillance of potential fires has already been established. However, most of the scholarly work is still focused on MUAV operations details. In wildfire surveillance and monitoring, evaluations of the system-level performance in terms of the analysis of the effects of individual behavior on system surveillance has yet to be established. Especially in an MUAV system, the individual and cooperative behaviors of the team affect the overall performance of the system. Such systems are dynamic and stochastic because of an ever-changing environment. Quantifying the emergent system behavior and general performance measures of such a system by analytical methods is challenging. In our work, we present an agent-based model for MUAV surveillance missions. This paper focuses on the overall system performance of cooperative UAVs performing forest fire surveillance. The principal theme is to present the effects of three behaviors on overall performance: (1) the area allocation and (2) dynamic coverage, and (3) the effects of forest density on team allocation. For area allocation, three behaviors are simulated: (1) randomized, (2) two-layer barrier sweep coverage, and (3) full sweep coverage. For dynamic coverage, the effects of communication and resource unavailability during the mission are studied by analyzing the agent’s downtime spent on refueling. Last, an extensive simulation is carried out on wildfire models with varying forest density. It is found that cooperative complete sweep coverage strategies perform better than the rest and the performance of the team is greatly affected by the forest density.", "venue": "Sustainability", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-05-13", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "49987458", "name": "A. Maqbool"}, {"authorId": "2060667987", "name": "Alina Mirza"}, {"authorId": "2119339427", "name": "Farkhanda Afzal"}, {"authorId": "2165426863", "name": "Tajammul Shah"}, {"authorId": "27421950", "name": "Wazir Zada Khan"}, {"authorId": "2954393", "name": "Y. B. Zikria"}, {"authorId": "2152670668", "name": "Sung Won Kim"}], "citations": [{"paperId": "bc2202f4dd299de01590b04cc0eae3227be8f19b", "title": "Using Explainable Artificial Intelligence (XAI) to Predict the Influence of Weather on the Thermal Soaring Capabilities of Sailplanes for Smart City Applications"}, {"paperId": "1ff6492ec2f8a3ee65bb894d04719dccd302bad0", "title": "Accuracy Assessment of Drone Real-Time Open Burning Imagery Detection for Early Wildfire Surveillance"}, {"paperId": "cf61c91163e8f862ffce494be31dfe12e7ec4215", "title": "Detection of Growth Change of Young Forest Based on UAV RGB Images at Single-Tree Level"}]}
