{"paperId": "a517575328ca3b8289fa95bd9f71669e1cf7127a", "publicationVenue": {"id": "8de18c35-6785-4e54-99f2-21ee961302c6", "name": "Conference of the European Chapter of the Association for Computational Linguistics", "type": "conference", "alternate_names": ["Conf Eur Chapter Assoc Comput Linguistics", "EACL"], "url": "https://www.aclweb.org/anthology/venues/eacl/"}, "title": "SIB-200: A Simple, Inclusive, and Big Evaluation Dataset for Topic Classification in 200+ Languages and Dialects", "abstract": "Despite the progress in building multilingual language models, evaluation is often limited to a few languages with available datasets which excludes a large number of low-resource languages. In this paper, we create SIB-200—a large-scale open-sourced benchmark dataset for topic classification in 205 languages and dialects to address the lack of evaluation dataset for Natural Language Understanding (NLU). For many of the languages covered in SIB-200, this is the first publicly available evaluation dataset for NLU. The dataset is based on Flores-200 machine translation corpus. We annotated the English portion of the dataset and extended the sentence-level annotation to the remaining 204 languages covered in the corpus. Despite the simplicity of this task, our evaluation in full-supervised setting, cross-lingual transfer setting and prompting of large language model setting show that there is still a large gap between the performance of high-resource and low-resource languages when multilingual evaluation is scaled to numerous world languages. We found that languages unseen during the pre-training of multilingual language models, languages from under-represented families (like Nilotic and Altantic-Congo), and languages from the regions of Africa, Americas, Oceania and South East Asia, often have the lowest performance on our topic classification dataset. We hope our dataset %will encourages a more inclusive evaluation of multilingual language models on a more diverse set of languages.", "venue": "Conference of the European Chapter of the Association for Computational Linguistics", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-09-14", "journal": {"pages": "226-245"}, "authors": [{"authorId": "2518906", "name": "David Ifeoluwa Adelani"}, {"authorId": "2240783638", "name": "Hannah Liu"}, {"authorId": "2240598941", "name": "Xiaoyu Shen"}, {"authorId": "2240523498", "name": "Nikita Vassilyev"}, {"authorId": "122367036", "name": "Jesujoba Oluwadara Alabi"}, {"authorId": "2240607447", "name": "Yanke Mao"}, {"authorId": "2240717465", "name": "Haonan Gao"}, {"authorId": "2240524331", "name": "Annie En-Shiun Lee"}], "citations": [{"paperId": "8327bfb2454c6cab8867acf88188dd757f049ca4", "title": "Forget NLI, Use a Dictionary: Zero-Shot Topic Classification for Low-Resource Languages with Application to Luxembourgish"}, {"paperId": "14023dc6bb8ebf7319013aa31d01bbe6a9c7cafe", "title": "ANGOFA: Leveraging OFA Embedding Initialization and Synthetic Data for Angolan Language Model"}, {"paperId": "1252e3710696bb4c1a56161ecce0093a55a75d26", "title": "AAdaM at SemEval-2024 Task 1: Augmentation and Adaptation for Multilingual Semantic Textual Relatedness"}, {"paperId": "07c53cf78f0ec5b95e89dd4fc4f5774ab486c4b5", "title": "DIALECTBENCH: A NLP Benchmark for Dialects, Varieties, and Closely-Related Languages"}, {"paperId": "49672006290b125aea958d1bae5d07c8e48ce8bb", "title": "LexC-Gen: Generating Data for Extremely Low-Resource Languages with Large Language Models and Bilingual Lexicons"}, {"paperId": "787d669be19a38e61eab2d012afecea6220c3b43", "title": "Soft Prompt Tuning for Cross-Lingual Transfer: When Less is More"}, {"paperId": "de643836277d108e1f8410ea85b0c3ed0e686163", "title": "MaLA-500: Massive Language Adaptation of Large Language Models"}, {"paperId": "4512e3f8a8543fdf4379da5df187613e78a791b3", "title": "Exploring the Maze of Multilingual Modeling"}]}
