{"paperId": "a52063092fcb963928fa7a11f3ca5a4c112b16a8", "publicationVenue": {"id": "4d899b46-b5c8-436e-8ce3-084673ea8905", "name": "Big Data & Society", "type": "journal", "alternate_names": ["Big Data  Soc"], "issn": "2053-9517", "url": "http://bds.sagepub.com/", "alternate_urls": ["https://journals.sagepub.com/home/bds"]}, "title": "Based and confused: Tracing the political connotations of a memetic phrase across the web", "abstract": "Current research on the weaponisation of far-right discourse online has mostly focused on the dangers of normalising hate speech. However, this often operates on questionable assumptions about how far-right terms retain problematic meanings over time and across different platforms. Yet contextual meaning-change, we argue, is key to assessing the normalisation of problematic but fuzzy terms as they spread across the Web. To redress this, our article traces the changing meaning of the term based, a word that was appropriated from Black Twitter to become a staple of online far-right slang in the mid-2010s. Through a quali-quantitative cross-platform approach, we analyse the evolution of the term between 2010 and 2021 on Twitter, Reddit and 4chan. We find that while the far right meaning of based partially survived, its meaning changed and was rendered diffuse as it was adopted by other communities, afforded by a repurposable kernel of meaning to based as ‘not caring about what other people think’ and ‘being true to yourself’ to which different (political) connotations were attached. This challenges the understanding of far-right memes and hate speech as carrying a single and persistent problematic message, and instead emphasises their varied meanings and subcultural functions within specific online communities.", "venue": "Big Data & Society", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-01-01", "journal": {"name": "Big Data & Society", "volume": "10"}, "authors": [{"authorId": "120414940", "name": "S. Hagen"}, {"authorId": "51909652", "name": "D. de Zeeuw"}], "citations": [{"paperId": "c9e5a91398d0e9410376d40cc919e0058d1d7d35", "title": "Memecry: Tracing the Repetition-with-Variation of Formulas on 4chan/pol/"}]}
