{"paperId": "a53798dcd55b8d2dbbbf9e63af94d827c77eb523", "publicationVenue": {"id": "5640d101-aca5-4a94-b2ae-56233ede88fa", "name": "International Journal of Evaluation and Research in Education (IJERE)", "type": "journal", "alternate_names": ["Int J Evaluation Res Educ", "Int J Evaluation Res Educ (IJERE", "International Journal of Evaluation and Research in Education"], "issn": "2252-8822", "url": "http://iaesjournal.com/online/index.php/IJERE"}, "title": "Teachers’ acceptance of technology as predictors of the use of Google Classroom analytical learning", "abstract": "The upsurge in Malaysia’s Industrial Revolution 4.0 (4IR) is in line with the changes in the global education environment. One of the latest approaches in the education field is learning analytics (LA). The use of LA in Google Classroom (GC) as the learning platform that measures, collects, analyses data and reports information about students to help teachers improve teaching and learning (T&L). This study aimed to determine the factors of teachers’ technology acceptance as the predictor for use LA in GC among the teachers in secondary schools. It is done by observing 304 teachers in daily secondary schools in the Federal Territory of Kuala Lumpur. The research instrument used was online questionnaire using Google Form, which data were collected and analyses by using IBM SPSS Statistics Version 26.0. The findings from this study show that the use of GC, teachers’ perceived usefulness and behavioral intention were the predictors that influenced the performance of LA in GC. This study hoped to provide a description and contribute a required alternative for the Ministry of Education (MOE) Malaysia and the schools in designing an effective strategy that can help teachers monitor the suitability of using LA in GC during teaching and learning.", "venue": "International Journal of Evaluation and Research in Education (IJERE)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-01", "journal": {"name": "International Journal of Evaluation and Research in Education (IJERE)"}, "authors": [{"authorId": "2225359672", "name": "Ellie Esterina Mohd Fasiah"}, {"authorId": "9088801", "name": "Ahmad Fauzi Mohd Ayub"}, {"authorId": "2264174796", "name": "Nurul Nadwa Zulkifli"}], "citations": []}
