{"paperId": "a5389bc77bb342192f84eb721c6a880d5283f110", "publicationVenue": {"id": "6336131c-2f71-4f61-bc3b-1bf31ec9fa3d", "name": "International Conference on Computing for Sustainable Global Development", "type": "conference", "alternate_names": ["INDIACom", "Int Conf Comput Sustain Glob Dev"]}, "title": "Blockchain-enabled Dynamic Document Ownership Verification", "abstract": "With the advent of blockchain technology, many government bodies and industries are beginning to regulate blockchain technology in many areas of supply chain, taxation, and legal aspects. These areas heavily rely on the documents and their ownership. In the existing systems, maintaining documents while ensuring their integrity and authenticity is a cumbersome process. Therefore, in this research, we proposed a blockchain-based dynamic document ownership verification system that can effectively mitigate problems through - (1) unique mapping of the document with the actual owner via smart contract technology, (2) storing and retrieving the crucial documents in a decentralized manner utilizing the InterPlanetary File System (IPFS), and (3) record keeping of the document changes and version history via blockchain ledger technology. This system makes the process of validating ownership resilient and decreases the cases of forgery in the process. The applicability of this system in numerous real-world scenarios serves as our point of conclusion for this work.", "venue": "International Conference on Computing for Sustainable Global Development", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-03-15", "journal": {"name": "2023 10th International Conference on Computing for Sustainable Global Development (INDIACom)", "pages": "734-739"}, "authors": [{"authorId": "2216339223", "name": "Dhruvil Lathiya"}, {"authorId": "2216334223", "name": "Naimish Lukhi"}, {"authorId": "40107537", "name": "Kaushal A. Shah"}], "citations": [{"paperId": "d0d7e3c35fcfe6ff80d5d3ab682d003d8c07d6fa", "title": "A Blockchain Based Scalable Framework for Academic Document Verification"}, {"paperId": "14b50262a975a461c5d9690cd950ada8b2578ad7", "title": "Blockchain-Enabled DNS: Enhancing Security and Mitigating Attacks in Domain Name Systems"}]}
