{"paperId": "a5459a0dd87e6046eab55421a5fdf0f57a8dfc75", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Machine Learning for Industry 4.0: A Systematic Review Using Deep Learning-Based Topic Modelling", "abstract": "Machine learning (ML) has a well-established reputation for successfully enabling automation through its scalable predictive power. Industry 4.0 encapsulates a new stage of industrial processes and value chains driven by smart connection and automation. Large-scale problems within these industrial settings are a prime example of an environment that can benefit from ML. However, a clear view of how ML currently intersects with industry 4.0 is difficult to grasp without reading an infeasible number of papers. This systematic review strives to provide such a view by gathering a collection of 45,783 relevant papers from Scopus and Web of Science and analysing it with BERTopic. We analyse the key topics to understand what industry applications receive the most attention and which ML methods are used the most. Moreover, we manually reviewed 17 white papers of consulting firms to compare the academic landscape to an industry perspective. We found that security and predictive maintenance were the most common topics, CNNs were the most used ML method and industry companies, at the moment, generally focus more on enabling successful adoption rather than building better ML models. The academic topics are meaningful and relevant but technology focused on making ML adoption easier deserves more attention.", "venue": "Italian National Conference on Sensors", "year": 2022, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2022-11-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "22"}, "authors": [{"authorId": "34573296", "name": "D. Mazzei"}, {"authorId": "1671688149", "name": "Reshawn Ramjattan"}], "citations": [{"paperId": "7fb8003e5c5e26246697b605c62519fbd217d3eb", "title": "Leveraging blockchain for industry funding: a social media analysis"}, {"paperId": "92670f65c4389513b0dbbc43cdab4718c8dba287", "title": "Investigating the Key Aspects of a Smart City through Topic Modeling and Thematic Analysis"}, {"paperId": "360a0f67c0dd7b5383779586897a357a62c16859", "title": "Natural Language Processing Reveals Research Trends and Topics in The Spine Journal Over Two Decades: A Topic Modeling Study."}, {"paperId": "81e635df75b343ab899d392b600e540afab7d900", "title": "Towards Realistic Evaluation of Industrial Continual Learning Scenarios with an Emphasis on Energy Consumption and Computational Footprint"}, {"paperId": "2e862497ddd20eb29e65439875c7c09c053fb2be", "title": "A survey of topic models: From a whole-cycle perspective"}, {"paperId": "d37a8bdc32e2ae0e4c624c3f8b03058cf5874729", "title": "Data-Driven Insights through Industrial Retrofitting: An Anonymized Dataset with Machine Learning Use Cases"}, {"paperId": "c016222542acc77f3e25c1b970b8aa239b0bd504", "title": "Exploring the challenges of the COVID-19 vaccine supply chain using social media analytics: a global perspective"}, {"paperId": "8c4ee99f765a785028e690f4224ab7338a485b6c", "title": "Extended Fuzzy-Based Models of Production Data Analysis within AI-Based Industry 4.0 Paradigm"}, {"paperId": "5de66e6a07ae8cc7c3513d25104905206a66b133", "title": "Data Science Methods and Tools for Industry 4.0: A Systematic Literature Review and Taxonomy"}, {"paperId": "c2d4048b4b51e08853f2d252bfdd4c3b70d85a1a", "title": "Machine learning for prognostics and health management of industrial mechanical systems and equipment: A systematic literature review"}]}
