{"paperId": "a574474d0083cc0c9efab1dfba1d6388573ec7a2", "publicationVenue": null, "title": "Examining Evaluativity in Legal Discourse: A Comparative Corpus-Linguistic Study of Thick Concepts", "abstract": "How evaluative are legal texts? Do legal scholars and jurists speak a more descriptive or perhaps a more evaluative language? In this paper, we present the results of a corpus study in which we examined the use of evaluative language in both the legal domain as well as public discourse. For this purpose, we created two corpora. Our legal professional corpus is based on court opinions from the U.S. Courts of Appeals. We compared this professional corpus to a public corpus, which is based on blog discussions on the internet forum Reddit. While many linguistic phenomena can give insights into evaluativity, we investigated the use of a wide selection of evaluative adjectives (more specifically, thick adjectives) to gain a more comprehensive picture of the degree of evaluativity in the legal domain. Our analysis shows that legal professionals use thick terms less evaluatively than laypeople, which suggests that legal texts are less evaluative than ordinary discussions. This result, more generally, supports the philosophical idea that thick concepts may vary in their evaluative intensity.", "venue": "", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-10-23", "journal": null, "authors": [{"authorId": "37522363", "name": "P. Willemsen"}, {"authorId": "2135114773", "name": "L. Baumgartner"}, {"authorId": "2135442282", "name": "Severin Frohofer"}, {"authorId": "39729435", "name": "K. Reuter"}], "citations": [{"paperId": "0558e656296fd4d9c6725b6cc417fa6263903731", "title": "The polarity effect of evaluative language"}, {"paperId": "ead1444a55151e4d2b9610c2598adb1aab4eb7d6", "title": "The Meaning of ‘Reasonable’: Evidence From a Corpus-Linguistic Study"}, {"paperId": "6d155098df9b902106487c54100020583e9ea47f", "title": "Conspiracy Theories Are Not Theories"}, {"paperId": "61fd8a3cbd2f0533aad73eb2002228fcfb3178b9", "title": "Ordinary Meaning and Consilience of Evidence 1"}, {"paperId": "f5a9d02f824497383d7768c6309823eae7641462", "title": "Normativity and Concepts of Bodily Sensations"}]}
