{"paperId": "a5807e24d7f90f398e7ad8afe221f8edaf4e74e3", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Understanding and Improving the Latency of DRAM-Based Memory Systems", "abstract": "Over the past two decades, the storage capacity and access bandwidth of main memory have improved tremendously, by 128x and 20x, respectively. These improvements are mainly due to the continuous technology scaling of DRAM (dynamic random-access memory), which has been used as the physical substrate for main memory. In stark contrast with capacity and bandwidth, DRAM latency has remained almost constant, reducing by only 1.3x in the same time frame. Therefore, long DRAM latency continues to be a critical performance bottleneck in modern systems. Increasing core counts, and the emergence of increasingly more data-intensive and latency-critical applications further stress the importance of providing low-latency memory access. \nIn this dissertation, we identify three main problems that contribute significantly to long latency of DRAM accesses. To address these problems, we present a series of new techniques. Our new techniques significantly improve both system performance and energy efficiency. We also examine the critical relationship between supply voltage and latency in modern DRAM chips and develop new mechanisms that exploit this voltage-latency trade-off to improve energy efficiency. \nThe key conclusion of this dissertation is that augmenting DRAM architecture with simple and low-cost features, and developing a better understanding of manufactured DRAM chips together lead to significant memory latency reduction as well as energy efficiency improvement. We hope and believe that the proposed architectural techniques and the detailed experimental data and observations on real commodity DRAM chips presented in this dissertation will enable development of other new mechanisms to improve the performance, energy efficiency, or reliability of future memory systems.", "venue": "arXiv.org", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2017-12-22", "journal": {"name": "ArXiv", "volume": "abs/1712.08304"}, "authors": [{"authorId": "2289261", "name": "K. Chang"}], "citations": [{"paperId": "8c5ef03e9118253ec019965bf142d1be7998a453", "title": "Functionally-Complete Boolean Logic in Real DRAM Chips: Experimental Characterization and Analysis"}, {"paperId": "b173f464ef74f8bfa424e51e4ae43ec000eb67ad", "title": "Unity ECC: Unified Memory Protection Against Bit and Chip Errors"}, {"paperId": "25ddcf00c6ce86506887a936b0a09dbed2f1177a", "title": "Improved Computation of Database Operators via Vector Processing Near-Data"}, {"paperId": "04451924968ce6565b1f2c733546d71a0fde9850", "title": "Machine Learning-Based Rowhammer Mitigation"}, {"paperId": "b42734a9ef73e4b6064ba89e92e2796d1e932285", "title": "PIMFlow: Compiler and Runtime Support for CNN Models on Processing-in-Memory DRAM"}, {"paperId": "95284b2b5fbd9d6a14edab5a1070de604637df19", "title": "SAPIVe: Simple AVX to PIM Vectorizer"}, {"paperId": "0c7607f8da3936420c778a6418e2ea5d89f7775c", "title": "DRAM Bender: An Extensible and Versatile FPGA-Based Infrastructure to Easily Test State-of-the-Art DRAM Chips"}, {"paperId": "827cb39c3ec17eebb7370a6922f46185eb7973b2", "title": "On the SPEC-CPU 2017 opportunities for dynamic vectorization possibilities on PIM architectures"}, {"paperId": "2106b4aa6b61168c317dccd94f8ded96bbae10b8", "title": "PiDRAM: An FPGA-based Framework for End-to-end Evaluation of Processing-in-DRAM Techniques"}, {"paperId": "40b261c056da0e26f598b75000a6bccafffd09fd", "title": "A Case for Transparent Reliability in DRAM Systems"}, {"paperId": "a889bcd405ae356dc3e04c8109a3373df72c470a", "title": "Proposta de conversão automática em hardware de instruções para execução em memória"}, {"paperId": "d0e452f841649e4dc50edfff3287fb2ea9be3f04", "title": "Extending Memory Capacity in Consumer Devices with Emerging Non-Volatile Memory: An Experimental Study"}, {"paperId": "361b14bbd0345f404c3be486464fb3cb6c78aad4", "title": "PiDRAM: A Holistic End-to-end FPGA-based Framework for Processing-in-DRAM"}, {"paperId": "10cac1ea2fbf8aa65b8404d667d00389e83fbb15", "title": "Cuckoo Trie: Exploiting Memory-Level Parallelism for Efficient DRAM Indexing"}, {"paperId": "d441e66baa101273fc5323a1fb05f5141f5a8a51", "title": "QUAC-TRNG: High-Throughput True Random Number Generation Using Quadruple Row Activation in Commodity DRAM Chips"}, {"paperId": "8e85281351edfd13081f1175fb102836ccc4baca", "title": "DAMOV: A New Methodology and Benchmark Suite for Evaluating Data Movement Bottlenecks"}, {"paperId": "7bb6015f45457fdbe3bb39e17dc9cb0786ecd688", "title": "A Modern Primer on Processing in Memory"}, {"paperId": "ae02979799f44b1262559b30efb0d302ce640c1d", "title": "Integer Codes Correcting Single Errors and Detecting Burst Errors Within a Byte"}, {"paperId": "b9af9c8d66115da46aff535fa16047a6f3a47e0d", "title": "Impact of the Array Shape and Memory Bandwidth on the Execution Time of CNN Systolic Arrays"}, {"paperId": "acdfe34aab867d1a0101c88dba299a56274388d8", "title": "CLR-DRAM: A Low-Cost DRAM Architecture Enabling Dynamic Capacity-Latency Trade-Off"}, {"paperId": "ec6ca596b8a74e2a2c6a525fb9ccd3476c20eb3e", "title": "Revisiting RowHammer: An Experimental Analysis of Modern DRAM Devices and Mitigation Techniques"}, {"paperId": "64de7c5a2434e8293c86dcc223283280a584604c", "title": "Demystifying Complex Workload-DRAM Interactions"}, {"paperId": "cec19034ff17fea31f46b8a23ebe56139b239824", "title": "Acelerando requisições de prováveis cache misses com requisições em paralelo cache/DRAM"}, {"paperId": "ae216775f6d86773da7eeac27d361de019f386bb", "title": "EDEN: Enabling Energy-Efficient, High-Performance Deep Neural Network Inference Using Approximate DRAM"}, {"paperId": "de0c0e2df937e6a126f2322ea07d3e36080ed991", "title": "Understanding and Modeling On-Die Error Correction in Modern DRAM: An Experimental Study Using Real Devices"}, {"paperId": "066d4969831b1c568b893fab45775397fc9390d0", "title": "INVITED: Enabling Practical Processing in and near Memory for Data-Intensive Computing"}, {"paperId": "4f17bd15a6f86730ac2207167ccf36ec9e6c2391", "title": "Processing Data Where It Makes Sense: Enabling In-Memory Computation"}, {"paperId": "680daccbd4b662ea8ccba859bd42e4b9df97d27d", "title": "Understanding the Interactions of Workloads and DRAM Types: A Comprehensive Experimental Study"}, {"paperId": "4746be9f3fa6d5816438b5a32a2d6db2966d6ee3", "title": "Large Scale Studies of Memory, Storage, and Network Failures in a Modern Data Center"}, {"paperId": "1db96a6892246f7e56f7390621a48a02a605d0d7", "title": "Evaluating Dead Line Predictors Efficiency with Drowsy Technique"}, {"paperId": "0432542bfe41c65130dd59c5af7823d12a9e93f4", "title": "Evaluating Dead Line Predictors Efficiency with Drowsy Technique"}, {"paperId": "6fd3cf784f9608f57a4f9c26ad63d09f1e8419c5", "title": "Solar-DRAM: Reducing DRAM Access Latency by Exploiting the Variation in Local Bitlines"}, {"paperId": "b5d8306cb9f648b5567b934124010849ba752816", "title": "Reducing DRAM Latency via Charge-Level-Aware Look-Ahead Partial Restoration"}, {"paperId": "cdad60e87ca1cccf77dda08147007768798c3b77", "title": "Introducing Drowsy Technique to Cache Line Usage Predictors"}, {"paperId": "0a3dd16af1e98459a854b309b33dda53b332e348", "title": "The Processing-in-Memory Paradigm: Mechanisms to Enable Adoption"}, {"paperId": "5535fec7822abc2edc8e4a45df5432426b45e138", "title": "D-RaNGe: Using Commodity DRAM Devices to Generate True Random Numbers with Low Latency and High Throughput"}, {"paperId": "67cd6da17d4f51951d4dbfb3429c82fc77df7c52", "title": "Architectural Techniques for Improving NAND Flash Memory Reliability"}, {"paperId": "cc1eff4ad90308ced3d2a89e1d1150ce6bf83a4c", "title": "What Your DRAM Power Models Are Not Telling You"}, {"paperId": "65fec44db0d1b425fd46a8f01a35ea767dc36337", "title": "Improving 3D NAND Flash Memory Lifetime by Tolerating Early Retention Loss and Process Variation"}, {"paperId": "76ed7e41fabd91a86f5e5dc58688a58f329d31db", "title": "Recent Advances in DRAM and Flash Memory Architectures"}, {"paperId": "462a6f3c20d55e251b007a8f8f3d84ad4086e6bd", "title": "Recent Advances in Overcoming Bottlenecks in Memory Systems and Managing Memory Resources in GPU Systems"}, {"paperId": "6d3fd6c1f6b59c3f041a3bb416dfeb05f80a697e", "title": "Experimental Characterization, Optimization, and Recovery of Data Retention Errors in MLC NAND Flash Memory"}, {"paperId": "305dea0339faabadcd591a31a6ad31e495f5f7d9", "title": "Flexible-Latency DRAM: Understanding and Exploiting Latency Variation in Modern DRAM Chips"}, {"paperId": "12b68cb06efdab086a80c638d21a2927e8d82f59", "title": "SoftMC: Practical DRAM Characterization Using an FPGA-Based Infrastructure"}, {"paperId": "ed43aed792ce705ee7911d94dcabf72d7ce073f1", "title": "Exploiting Row-Level Temporal Locality in DRAM to Reduce the Memory Access Latency"}, {"paperId": "dda7c10868d398a61d113a0671491422b57f9f93", "title": "Characterizing, Exploiting, and Mitigating Vulnerabilities in MLC NAND Flash Memory Programming"}, {"paperId": "77835f0049433f7f0d1c6c4fb9dbbeebf31b82d0", "title": "Adaptive-Latency DRAM: Reducing DRAM Latency by Exploiting Timing Margins"}, {"paperId": "0cc9f0cf9fb45e57cdfea47f84b20474df4b9c61", "title": "Tiered-Latency DRAM: Enabling Low-Latency Main Memory at Low Cost"}, {"paperId": "342ebf89fb87bd271ae3abc4512129f8db4e258d", "title": "The DRAM Latency PUF: Quickly Evaluating Physical Unclonable Functions by Exploiting the Latency-Reliability Tradeoff in Modern Commodity DRAM Devices"}, {"paperId": "0c4fe1f1a8043e8f4175b21faca1b72bff8033e6", "title": "Enabling the Adoption of Processing-in-Memory: Challenges, Mechanisms, Future Research Directions"}, {"paperId": "ade903df1e67fb59069b51a0a8fc227853a4a8dc", "title": "Errors in Flash-Memory-Based Solid-State Drives: Analysis, Mitigation, and Recovery"}, {"paperId": "a5d63bcc1ff5dcd305a556edd3e329d6784b161c", "title": "GRIM-Filter: Fast seed location filtering in DNA read mapping using processing-in-memory technologies"}, {"paperId": "4d23b5d9225f86efb56b0241c3a00349a6f51136", "title": "Detecting and Mitigating Data-Dependent DRAM Failures by Exploiting Current Memory Content"}, {"paperId": "4828a11ee5221ad6f7d97ae0c8ffec8c62c65fa8", "title": "Concurrent Data Structures for Near-Memory Computing"}, {"paperId": "ea4c3cda2f27cc9428789321363ba46304635b80", "title": "Error Characterization, Mitigation, and Recovery in Flash-Memory-Based Solid-State Drives"}, {"paperId": "0baee7d0bf986ddf9445dedb2bfb17ffb0c26c44", "title": "The reach profiler (REAPER): Enabling the mitigation of DRAM retention failures via profiling at aggressive conditions"}, {"paperId": "77f62bda59b101b598846a71256b4941b4d4b163", "title": "Design-Induced Latency Variation in Modern DRAM Chips"}, {"paperId": "b74fbb8d5063711f4377ec4c80fd41c527f78422", "title": "Understanding Reduced-Voltage Operation in Modern DRAM Devices"}, {"paperId": "5c478e5c774eb3cf71e446e2c9eb2166ca032b28", "title": "Understanding and Exploiting Design-Induced Latency Variation in Modern DRAM Chips"}, {"paperId": "0f41b9c0900b1c17b63d3d59bd4c334f7cf736af", "title": "Rethinking Memory System Design"}, {"paperId": "0855d63e5f68930cafd99b8e01472f196829d929", "title": "Heterogeneous-Reliability Memory: Exploiting Application-Level Memory Error Tolerance"}, {"paperId": "30e469c369af4a4ddc6490d1bd2760c1c70ff57d", "title": "Extending Memory Capacity in Modern Consumer Systems With Emerging Non-Volatile Memory: Experimental Analysis and Characterization Using the Intel Optane SSD"}, {"paperId": "2b712003b9c57637a0b4f4f13f7c6d6afb7702cd", "title": "Improving performance of BWA alignment of short sequences with coroutines"}, {"paperId": "8e46cf6a16eb1419b808ba3dda39f764508c62fa", "title": "Reliability Issues in Flash-Memory-Based Solid-State Drives: Experimental Analysis, Mitigation, Recovery"}, {"paperId": "5219b25edc5eb64b279fd7e69c49556032e80c22", "title": "Guest Editor"}]}
