{"paperId": "a58d4c60914ad99046e15abdf27227159062260a", "publicationVenue": {"id": "011e0c39-7f47-401e-98d2-ee08fdf206a3", "name": "Library hi tech", "type": "journal", "alternate_names": ["Libr Hi Tech", "Library Hi Tech", "Libr hi tech"], "issn": "0737-8831", "url": "https://www.emerald.com/insight/publication/issn/0737-8831"}, "title": "From traditional to emerging technologies in supporting smart libraries. A bibliometric and thematic approach from 2013 to 2022", "abstract": "PurposeThe evolution from emerging technologies to smart libraries is thoroughly analyzed thematically and bibliometrically in this research study, spanning 2013 through 2022. Finding and analyzing the significant changes, patterns and trends in the subject as they are represented in academic papers is the goal of this research.Design/methodology/approachUsing bibliometric methodologies, this study gathered and examined a large corpus of research papers, conference papers and related material from several academic databases.FindingsStarting with Artificial Intelligence (AI), the Internet of Things (IoT), Big Data (BD), Augmentation Reality/Virtual Reality and Blockchain Technology (BT), the study discusses the advent of new technologies and their effects on libraries. Using bibliometric analysis, this study looks at the evolution of publications over time, the geographic distribution of research and the most active institutions and writers in the area. A thematic analysis is also carried out to pinpoint the critical areas of study and trends in emerging technologies and smart libraries. Some emerging themes are information retrieval, personalized recommendations, intelligent data analytics, connected library spaces, real-time information access, augmented reality/virtual reality applications in libraries and strategies, digital literacy and inclusivity.Originality/valueThis study offers a thorough overview of the research environment by combining bibliometric and thematic analysis, illustrating the development of theories and concepts during the last ten years. The results of this study helps in understanding the trends and future research directions in emerging technologies and smart libraries. This study is an excellent source of information for academics, practitioners and policymakers involved in developing and applying cutting-edge technology in library environments.", "venue": "Library hi tech", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-12-26", "journal": {"name": "Library Hi Tech"}, "authors": [{"authorId": "2275537537", "name": "Asad Ullah Khan"}, {"authorId": "2238992715", "name": "Zhiqiang Ma"}, {"authorId": "2257965079", "name": "Mingxing Li"}, {"authorId": "2276557415", "name": "Liangze Zhi"}, {"authorId": "1576470569", "name": "Weijun Hu"}, {"authorId": "2276578753", "name": "Xia Yang"}], "citations": [{"paperId": "e5c4840be124ab27af9d351a09d0b76bf3961d3e", "title": "Editorial: Special selection on current bibliometrics and reviews"}]}
