{"paperId": "a5a4ad07fdde0120a4d0016317e2229139009efb", "publicationVenue": {"id": "02a4454a-84c8-471c-9b40-cc045d4f3223", "name": "Security and Communication Networks", "type": "journal", "alternate_names": ["Secur Commun Netw"], "issn": "1939-0122", "url": "https://www.hindawi.com/journals/scn/", "alternate_urls": ["http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1939-0122", "http://www.interscience.wiley.com/journal/security"]}, "title": "A Lightweight Proxy Re-Encryption Approach with Certificate-Based and Incremental Cryptography for Fog-Enabled E-Healthcare", "abstract": "Cloud computing aims to provide reliable, customized, and quality of service (QoS) guaranteed dynamic computing environments for end-users. However, there are applications such as e-health and emergency response monitoring that require quick response and low latency. Delays caused by transferring data over the cloud can seriously affect the performance and reliability of real-time applications. Before outsourcing e-health care data to the cloud, the user needs to perform encryption on these sensitive data to ensure its confidentiality. Conventionally, any modification to the user data requires encrypting the entire data and calculating the hash of the data from scratch. This data modification mechanism increases communication and computation costs over the cloud. The distributed environment of fog computing is used to overcome the limitations of cloud computing. This paper proposed a certificate-based incremental proxy re-encryption scheme (CB-PReS) for e-health data sharing in fog computing. The proposed scheme improves the file modification operations, i.e., updation, deletion, and insertion. The proposed scheme is tested on the iFogSim simulator. The iFogSim simulator facilitates the development of models for fog and IoT environments, and it also measures the impact of resource management techniques regarding network congestion and latency. Experiments depict that the proposed scheme is better than the existing schemes based on expensive bilinear pairing and elliptic curve techniques. The proposed scheme shows significant improvement in key generation and file modification time.", "venue": "Security and Communication Networks", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-11-19", "journal": {"name": "Security and Communication Networks"}, "authors": [{"authorId": "2141542801", "name": "Junaid Hassan"}, {"authorId": "2154544945", "name": "Danish Shehzad"}, {"authorId": "72426080", "name": "Insaf Ullah"}, {"authorId": "1859619", "name": "F. Algarni"}, {"authorId": "32593111", "name": "Muhammad Umar Aftab"}, {"authorId": "2046780399", "name": "Muhammad Asghar Khan"}, {"authorId": "1717097509", "name": "M. I. Uddin"}], "citations": [{"paperId": "b259c30f402c70029ff182a9fb57479b5debd67e", "title": "Retracted: A Lightweight Proxy Re-Encryption Approach with Certificate-Based and Incremental Cryptography for Fog-Enabled E-Healthcare"}, {"paperId": "83ba208647bd3eb539f105e8dcfa37b013178134", "title": "A certificate-based proxy re-encryption plus scheme for secure medical data sharing"}, {"paperId": "742d206b5d7580b4cfbdecbd16f3c6205862a5f3", "title": "A Comprehensive Literature Survey of Cryptography Algorithms for Improving the IoT Security"}, {"paperId": "7b6554b29f54827ed4a11acbc832143adcef7260", "title": "The Rise of Cloud Computing: Data Protection, Privacy, and Open Research Challenges—A Systematic Literature Review (SLR)"}, {"paperId": "cc6b15d64f40379bdabda6afd8f4c0a6d412eca2", "title": "Traditional and Hybrid Access Control Models: A Detailed Survey"}]}
