{"paperId": "a5c2cae793390ffacfa13f9157ac95ea4fddbece", "publicationVenue": null, "title": "Use of Predictive Weather Uncertainties in an Irrigation Scheduling Tool Part I: A Review of Metrics and Adjoint Methods", "abstract": "Irrigation management consists of many components. In this work we review and recommend rainfall forecast performance metrics and adjoint methodologies for the use of predictive weather data within the Colorado State University Water Irrigation Scheduler for Efficient Application (WISE). WISE estimates crop water uses to optimize irrigation scheduling. WISE and its components, input requirements, and related software design issues are discussed. The use of predictive weather allows WISE to consider economic opportunity‐costs of decisions to defer water application if rainfall is forecast. These capabilities require an assessment of the system uncertainties and use of weather prediction performance probabilities. Rainfall forecasts and verification performance metrics are reviewed. In addition, model data assimilation methods and adjoint sensitivity concepts are introduced. These assimilation methods make use of observational uncertainties and can link performance metrics to space and time considerations. We conclude with implementation guidance, summaries of available data sources, and recommend a novel adjoint method to address the complex physical linkages and model sensitivities between space and time within the irrigation scheduling physics as a function of soil depth. Such tool improvements can then be used to improve water management decision performance to better conserve and utilize limited water resources for productive use. Editor’s note: This paper is part of the featured series on Optimizing Ogallala Aquifer Water Use to Sustain Food Systems. See the February 2019 issue for the introduction and background to the series.", "venue": "JAWRA Journal of the American Water Resources Association", "year": 2019, "fieldsOfStudy": ["Environmental Science"], "publicationTypes": ["Review"], "publicationDate": "2019-11-13", "journal": {"name": "JAWRA Journal of the American Water Resources Association", "pages": "187 - 200", "volume": "56"}, "authors": [{"authorId": "144640025", "name": "Andrew S. Jones"}, {"authorId": "9645110", "name": "A. Andales"}, {"authorId": "144926130", "name": "J. L. Chávez"}, {"authorId": "39854151", "name": "Cullen McGovern"}, {"authorId": "1483737225", "name": "G. E. Smith"}, {"authorId": "145217894", "name": "O. David"}, {"authorId": "144500442", "name": "S. Fletcher"}], "citations": [{"paperId": "e66a4fe2a3ba236fd68af6ad57438832ff9f8289", "title": "Use of Predictive Weather Uncertainties in an Irrigation Scheduling Tool Part II: An Application of Metrics and Adjoints"}, {"paperId": "c5c2a0ac11b6c8ea8f3b932c8a2b79c111a0dc45", "title": "Irrigation Scheduling for Agriculture in the United States: The Progress Made and the Path Forward"}]}
