{"paperId": "a5c32fc4ebbc9bc8d14bbe92e0488661302668d7", "publicationVenue": {"id": "57ef36b3-e71f-44ca-ab80-f893afce2ede", "name": "International Conference on Cloud and Big Data Computing", "type": "conference", "alternate_names": ["Int Conf Cloud Big Data Comput", "International Conference Cloud and Big Data Computing", "ICCBDC"]}, "title": "Component Profiling and Prediction Models for QoS-Aware Self-Adapting DSMS Framework", "abstract": "Quality of Service (QoS) has been identified as an important attribute of system performance of Data Stream Management Systems (DSMS). A DSMS should have the ability to allocate physical computing resources between different submitted queries and fulfil QoS specifications in a fair and square manner. System scheduling strategies need to be adjusted dynamically to utilise available physical resources to guarantee the end-to-end quality of service levels. In this paper, we present a proactive method that utilises a multi-level component profiling approach to build prediction models that anticipate several QoS violations and performance degradations. The models are constructed using several incremental machine learning algorithms that are enhanced with ensemble learning and abnormal detection techniques. The approach performs accurate predictions in near real-time with accuracy up to 85% and with abnormal detection techniques, the accuracy reaches 100%. This is a major component within a proposed QoS-Aware Self-Adapting Data Stream Management Framework.", "venue": "International Conference on Cloud and Big Data Computing", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2021-08-13", "journal": {"name": "Proceedings of the 2021 5th International Conference on Cloud and Big Data Computing"}, "authors": [{"authorId": "2142145243", "name": "Tarjana Yagnik"}, {"authorId": "144180429", "name": "F. Chen"}, {"authorId": "3483756", "name": "Laleh Kasraian"}], "citations": []}
