{"paperId": "a5c3e58d58141725ab3acae4959eb8e57aff067a", "publicationVenue": {"id": "8e1bd4b5-d5b2-4e22-ba0a-01fe5568d472", "name": "Remote Sensing", "type": "journal", "alternate_names": ["Remote Sens"], "issn": "2315-4675", "alternate_issns": ["2072-4292"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169233", "alternate_urls": ["https://www.mdpi.com/journal/remotesensing", "http://www.mdpi.com/journal/remotesensing", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169233"]}, "title": "Automatic Semantic Segmentation of Benthic Habitats Using Images from Towed Underwater Camera in a Complex Shallow Water Environment", "abstract": "Underwater image segmentation is useful for benthic habitat mapping and monitoring; however, manual annotation is time-consuming and tedious. We propose automated segmentation of benthic habitats using unsupervised semantic algorithms. Four such algorithms––Fast and Robust Fuzzy C-Means (FR), Superpixel-Based Fast Fuzzy C-Means (FF), Otsu clustering (OS), and K-means segmentation (KM)––were tested for accuracy for segmentation. Further, YCbCr and the Commission Internationale de l’Éclairage (CIE) LAB color spaces were evaluated to correct variations in image illumination and shadow effects. Benthic habitat field data from a geo-located high-resolution towed camera were used to evaluate proposed algorithms. The Shiraho study area, located off Ishigaki Island, Japan, was used, and six benthic habitats were classified. These categories were corals (Acropora and Porites), blue corals (Heliopora coerulea), brown algae, other algae, sediments, and seagrass (Thalassia hemprichii). Analysis showed that the K-means clustering algorithm yielded the highest overall accuracy. However, the differences between the KM and OS overall accuracies were statistically insignificant at the 5% level. Findings showed the importance of eliminating underwater illumination variations and outperformance of the red difference chrominance values (Cr) in the YCbCr color space for habitat segmentation. The proposed framework enhanced the automation of benthic habitat classification processes.", "venue": "Remote Sensing", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-04-09", "journal": {"name": "Remote. Sens.", "pages": "1818", "volume": "14"}, "authors": [{"authorId": "145078833", "name": "H. Mohamed"}, {"authorId": "1716772", "name": "K. Nadaoka"}, {"authorId": "2122815601", "name": "Takashi Nakamura"}], "citations": [{"paperId": "4e3d7d48dc202425d87052f836740f707c3258fc", "title": "An enhanced large-scale benthic reflectance retrieval model for the remote sensing of submerged ecosystems in optically shallow waters"}, {"paperId": "bce879404edfd3338824e1005b5f8a13b28e9102", "title": "An efficient segmentation method based on semi-supervised learning for seafloor monitoring in Pujada Bay, Philippines"}, {"paperId": "0f08d70cdb34d204912d84c98a198d6a4fcd3592", "title": "Semantic Segmentation of seafloor images in Philippines based on semi-supervised learning"}, {"paperId": "7113d7ce1dc064458046ac62648792ddd5b28aba", "title": "(Bio)sensors applied to coral reefs’ health monitoring: a critical overview"}, {"paperId": "e922be9008369d61b0515dae5bf3745d40c2c071", "title": "High-resolution 3D mapping of cold-water coral reefs using machine learning"}, {"paperId": "bf418a51942d0b167a9c1b3f0325b4a49d7aaae6", "title": "Density estimation of the main structuring sessile species in underwater marine caves with a deep learning approach"}]}
