{"paperId": "a5d575993e2afb3f4d5f6e5eaf6c85273c9b971f", "publicationVenue": {"id": "3b4e0d11-3211-4ead-848c-99928b5ef30e", "name": "IEEE Network", "type": "journal", "alternate_names": ["IEEE Netw"], "issn": "0890-8044", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=65"}, "title": "Trust-Enhanced Content Delivery in Blockchain-Based Information-Centric Networking", "abstract": "With the fast-growing demands for efficient and scalable content distribution, information-centric networking (ICN) can be a promising candidate for future networks. ICN promises direct retrieval of the content using its unique, persistent, and location-independent name. In ICN, all nodes work together to scale up content delivery, but security issues caused by malicious behaviors of ICN nodes cannot be avoided. To this end, in this article we develop a trust-enhanced blockchain based ICN (BICN) architecture for content delivery. In our proposed architecture, the whole process of content delivery is first traced in an implicitly trusted way by exploiting the excellent properties of the blockchain, so that the malicious ICN nodes can be located. Second, we leverage transactions to record the mapping between human-readable name and self-certifying name in BICN, which supports convenient and trusted alteration for users' requirements. Moreover, we present a case study in BICN based smart grid for energy data delivery, where we perform security analysis and conduct experiments. Numerical results show the superior performance of our proposal. Finally, we present open issues for future work.", "venue": "IEEE Network", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-04-11", "journal": {"name": "IEEE Network", "pages": "183-189", "volume": "33"}, "authors": [{"authorId": "46382453", "name": "Huining Li"}, {"authorId": "28014924", "name": "Kun Wang"}, {"authorId": "1718215", "name": "T. Miyazaki"}, {"authorId": "3431949", "name": "Chenhan Xu"}, {"authorId": "144123438", "name": "Song Guo"}, {"authorId": "1759469", "name": "Yanfei Sun"}], "citations": [{"paperId": "121b11ce09c7e2b74970a4ae0960eddbdf944331", "title": "HPCchain: A Consortium Blockchain System Based on CPU-FPGA Hybrid-PUF for Industrial Internet of Things"}, {"paperId": "5f37350d1dd454022bbb79bf3a2bdefd24514b3e", "title": "Blockchain-based key management system in named data networking: A survey"}, {"paperId": "cc85d5e725872651212d55fa3715399bfc704774", "title": "Security Bootstrapping for Securing Data Plane and Control Plane in Named Data Networking"}, {"paperId": "c461d5e6186c27e505551f3f6715e6f5e02fe9b6", "title": "Fine-Grained Benchmarking and Targeted Optimization: Enabling Green IoT-Oriented Blockchain in the 6G Era"}, {"paperId": "4df945632602d7b476e53d0c31842d33368ce297", "title": "Leveraging ICN and SDN for Future Internet Architecture: A Survey"}, {"paperId": "02f5be9a443bca0d5174f86fe48b4b79b53aecf8", "title": "Blockchain-enabled solution for secure and scalable V2V video content dissemination"}, {"paperId": "376e087a6d75e5984bc60290f1769e102ae5020c", "title": "A Survey of Blockchain Technology: Architecture, Applied Domains, Platforms, and Security Threats"}, {"paperId": "4ecf257175c2ea67604cae73219659e073b2fef2", "title": "BCadvisor: Enabling Green Blockchain Systems Through Resource-Oriented Benchmarking"}, {"paperId": "8ca4cd2bd3813aa22d926cf7e007dc561db5c90a", "title": "A Secured Blockchain-based Information-Centric Network"}, {"paperId": "e62f5333177df0369147b8a460417e5362fdc13d", "title": "Blockchain-Based Authentication with Optional Privacy Preservation for Internet of Vehicles"}, {"paperId": "cf02635993caca98c8756c4b0fa476d3c2b7b68a", "title": "A survey on blockchain‐enabled smart grids: Advances, applications and challenges"}, {"paperId": "dff7e6a0fa2667803ff4e1dff77ff9ea4c7ed436", "title": "Dilated Transaction Access and Retrieval: Improving the Information Retrieval of Blockchain-Assimilated Internet of Things Transactions"}, {"paperId": "be57ef1156ce01083ccd9c5873844a16d5c8cd87", "title": "ATM: An Active-Detection Trust Mechanism for VANETs Based on Blockchain"}, {"paperId": "3761ea7d6ae1136df774a0c942df7371becd63a0", "title": "Blockchain technology in Named Data Networks: A detailed survey"}, {"paperId": "902735a34d532a34f2f697c322e2e0294f15409e", "title": "Blockchain and AI Empowered Trust-Information-Centric Network for Beyond 5G"}, {"paperId": "5a204f1fe66ebb34ce633d2249b81596ae082e9c", "title": "Proof of Data Distribution Based on Trusted Hardware"}, {"paperId": "1f1d6e1cc8af47f994ef2d3017de0d7d6bd0d9d9", "title": "Green Fog: Cost Efficient Real Time Power Management Service for Green Community"}, {"paperId": "1ab808983da69128f7db195984df0733731ff593", "title": "Spacechain: A Three-Dimensional Blockchain Architecture for IoT Security"}, {"paperId": "5fbef05959e520f561501944abd834a471e94345", "title": "Blockchain Technology in Data Management"}, {"paperId": "1243d958f1dcadfe1cdfc29664a59be7382248a0", "title": "Blockchain-Based Hierarchical Trust Networking for JointCloud"}, {"paperId": "fb5a0e611b105b470f664735bc31381c88f469b8", "title": "Caching Data Protection Scheme for Information-Centric Wireless Sensor Networks"}, {"paperId": "7b083c936f1af18dab27d47198ee3dcdc16feb86", "title": "Tornado: Enabling Blockchain in Heterogeneous Internet of Things Through a Space-Structured Approach"}, {"paperId": "28fd6c98445bfa2d66b0112b6dc843a845d76faa", "title": "An Associated Behavior Sequence Based User Authentication Approach in M2M Mobile Terminals"}, {"paperId": "861bfa8568d93fc95b733ff10780fbebee1efb4c", "title": "BlockAuth: BlockChain based distributed producer authentication in ICN"}, {"paperId": "4f5fd034a6d1447e99dd0cb68229613ebef2e4e0", "title": "An Ethereum-Based Data Synchronization Platform for Distributed Networks"}, {"paperId": "025c22bb171f266e2e07832d0e66792954850f53", "title": "Blockchain-Assisted Public-Key Encryption with Keyword Search Against Keyword Guessing Attacks for Cloud Storage"}, {"paperId": "5d6340e8c13c8213b812a51fb031218ebe10fd2f", "title": "$\\mathsf{LightChain}$: A Lightweight Blockchain System for Industrial Internet of Things"}, {"paperId": "a5b306fa16339bcccfe410938f76db1e9c5ddefe", "title": "Integration of ICN and MEC in 5G and Beyond Networks: Mutual Benefits, Use Cases, Challenges, Standardization, and Future Research"}, {"paperId": "1b4f1028473ac7b1d6ea2645733d905bc6a5c4b5", "title": "Social and Economic Contribution of 5G and Blockchain With Green Computing: Taxonomy, Challenges, and Opportunities"}, {"paperId": "a4cb4c1fa319f9b21665365a2a86a8c265f83711", "title": "Trusted computing in power distribution IoT: A fuzzy set theory based analysis"}, {"paperId": "728bab80124c20954a2cdbb70fe6965bb9b1de62", "title": "Internet of Vehicles. Technologies and Services Toward Smart Cities: 6th International Conference, IOV 2019, Kaohsiung, Taiwan, November 18–21, 2019, Proceedings"}, {"paperId": "4d430f54a4bc4a2d05cfcb7d4248ef49fdb8845b", "title": "A Survey of Using Blockchain Aspects in Information Centric Networks"}, {"paperId": "9f1390eb97a2d12ee9e6240f079773a06ccdf1e4", "title": "Performance Benchmarking and Optimization for IIoT-oriented Blockchain"}, {"paperId": "0e516e9fd5e8452ce41c77af722aab3edb61ea82", "title": "Proof-of-Reputation Based-Consortium Blockchain for Trust Resource Sharing in Internet of Vehicles"}]}
