{"paperId": "a5dfa7997ae26fd3bdc34d156861e8a8bc1de63d", "publicationVenue": {"id": "ff26af0c-844b-47a0-acb5-f7668367e453", "name": "International Journal of Digital Multimedia Broadcasting", "type": "journal", "alternate_names": ["Int J Digit Multimedia Broadcast"], "issn": "1687-7578", "url": "https://www.hindawi.com/journals/ijdmb/", "alternate_urls": ["http://www.hindawi.com/journals/ijdmb/"]}, "title": "Development and Implementation of an FPGA-Embedded Multimedia Remote Monitoring System for Information Technology Server Room Management", "abstract": "Conventional data acquisition systems face challenges in achieving high acquisition speeds and rapid storage of large data volumes using microcontrollers. In contrast, field-programmable gate arrays (FPGAs) offer numerous advantages, including high clock frequencies, minimal internal delays, fast operational speeds, abundant internal RAM resources, and simplified control of complex peripheral circuits. This study presents the design of an FPGA-based multimedia remote monitoring system for information technology server rooms. The proposed system utilizes an FPGA as the primary controller and incorporates environmental sensors, electrical energy sensors, carbon monoxide sensors, smoke sensors, and A/D converter modules to monitor multiple locations within the server room. Simultaneously, the FPGA transmits the collected data from each monitoring point via a serial port to an LCD serial screen for display. An alarm is triggered if any environmental anomalies are detected, indicating abnormal statuses. Additionally, the system employs the fast Fourier transform algorithm and butterfly operations to derive voltage and current AC quantities, while utilizing relative temperature differences to identify equipment faults within the server room. The system is evaluated in terms of functionality, user-friendliness, and reliability. Experimental results demonstrate that all performance measures align with expectations, fulfilling the initial design objectives and highlighting the potential applicability and relevance of FPGA technology in the monitoring field. In addition, a comparison between FPGA and traditional microcontroller systems is performed, showcasing the superior processing speed and performance of the FPGA-based system. This comparative analysis further validates the advantages of using FPGA technology in high-speed data acquisition and monitoring applications.", "venue": "International Journal of Digital Multimedia Broadcasting", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-03-07", "journal": {"name": "International Journal of Digital Multimedia Broadcasting"}, "authors": [{"authorId": "2290873608", "name": "Yongqin Zhu"}, {"authorId": "2290730298", "name": "Kaiwen Hou"}], "citations": []}
