{"paperId": "a5e1f32c97082262a01865fcc4e8997227fbac47", "publicationVenue": null, "title": "Optimized Multi-Core Parallel Tracking for Big Data Streaming Applications", "abstract": "Article history: Received: 12 December, 2020 Accepted: 19 March, 2021 Online: 28 May, 2021 Efficient real-time clustering is a relevant topic in big data streams. Data stream clustering needs necessarily a short time execution frame with bounded memory utilizing a one-scan process. Because of the massive volumes and dynamics of data streams, parallel clustering solutions are urgent. This paper presents a new approach for this trend, with advantages to overcome the main challenges of huge data streams, time, and memory resources. A framework is proposed reliant on a data clustering parallel implementation that divides most recent incoming data streams within a sliding window mechanism to distribute them across a multi-core structure for processing. Every core is responsible for the processing and generation of intermediate micro-clusters for one data partition. The resulting micro clusters are consolidated utilizing the additive property of the micro-cluster data structure to merge those parallel clusters and obtain the final clusters. The proposed approach has been tested on two sorts of datasets: KDD-CUP’99 and KDD-CUP’98. The results show that the proposed optimized parallel window-based clustering approach is efficient for online cluster generation for big data streaming with regard to the performance measures processing time and scheduling delay. The processing time is 1.5 times faster, and the scheduling delay is approximately between 1.3 to 1.7 times less than the sequential implementation. Most important is that the clustering quality is equal to that of the nonparallel implementation.", "venue": "", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-05-01", "journal": {"name": "Advances in Science, Technology and Engineering Systems Journal", "pages": "286-295", "volume": "6"}, "authors": [{"authorId": "1573497241", "name": "D. Sayed"}, {"authorId": "2876715", "name": "S. Rady"}, {"authorId": "9160196", "name": "M. Aref"}], "citations": []}
