{"paperId": "a5e3710b8d9e644670b6bf9635d34cc71eaebc95", "publicationVenue": {"id": "a0edb93b-1e95-4128-a295-6b1659149cef", "name": "Knowledge Discovery and Data Mining", "type": "conference", "alternate_names": ["KDD", "Knowl Discov Data Min"], "url": "http://www.acm.org/sigkdd/"}, "title": "UA-FedRec: Untargeted Attack on Federated News Recommendation", "abstract": "News recommendation is essential for personalized news distribution. Federated news recommendation, which enables collaborative model learning from multiple clients without sharing their raw data, is a promising approach for preserving users' privacy. However, the security of federated news recommendation is still unclear. In this paper, we study this problem by proposing an untargeted attack on federated news recommendation called UA-FedRec. By exploiting the prior knowledge of news recommendation and federated learning, UA-FedRec can effectively degrade the model performance with a small percentage of malicious clients. First, the effectiveness of news recommendation highly depends on user modeling and news modeling. We design a news similarity perturbation method to make representations of similar news farther and those of dissimilar news closer to interrupt news modeling, and propose a user model perturbation method to make malicious user updates in opposite directions of benign updates to interrupt user modeling. Second, updates from different clients are typically aggregated with a weighted average based on their sample sizes. We propose a quantity perturbation method to enlarge sample sizes of malicious clients in a reasonable range to amplify the impact of malicious updates. Extensive experiments on two real-world datasets show that UA-FedRec can effectively degrade the accuracy of existing federated news recommendation methods, even when defense is applied. Our study reveals a critical security issue in existing federated news recommendation systems and calls for research efforts to address the issue. Our code is available at https://github.com/yjw1029/UA-FedRec.", "venue": "Knowledge Discovery and Data Mining", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2022-02-14", "journal": {"name": "Proceedings of the 29th ACM SIGKDD Conference on Knowledge Discovery and Data Mining"}, "authors": [{"authorId": "2087122322", "name": "Jingwei Yi"}, {"authorId": "2397264", "name": "Fangzhao Wu"}, {"authorId": "2118251261", "name": "Bin Zhu"}, {"authorId": "2110071312", "name": "Jing Yao"}, {"authorId": "9168351", "name": "Zhulin Tao"}, {"authorId": "39109247", "name": "Guangzhong Sun"}, {"authorId": "2149195520", "name": "Xing Xie"}], "citations": [{"paperId": "e7b9f75e088372bf5cfb50ca00d548e7b6946d2a", "title": "Federated Knowledge Graph Unlearning via Diffusion Model"}, {"paperId": "e5a1d2a4622bef28ea2936efce2de78230e1d53a", "title": "Poisoning Attacks against Recommender Systems: A Survey"}, {"paperId": "d0055875a633413b7029a710fcb1e82874990880", "title": "Poisoning Attacks Against Contrastive Recommender Systems"}, {"paperId": "f6c4ab71098b36124ced28f9adb01998a3bebbb8", "title": "RecAD: Towards A Unified Library for Recommender Attack and Defense"}, {"paperId": "df49485b692986e67a74da78f62d1f87c8b5824f", "title": "Federated Unlearning for On-Device Recommendation"}]}
