{"paperId": "a5e57795e1fa2904ded67492065fa559cd432113", "publicationVenue": null, "title": "The Aruna Object Storage A Distributed Multi Cloud Object Storage System for Scientific Data Management", "abstract": "The exponential growth of scientific data has led to an increasing demand for effective data management and storage solutions. Academic computing infrastructures are often fragmented, which can make it challenging for researchers to leverage cloud-native principles and modern data analysis tools. To address this challenge, a new distributed storage platform called Aruna Object Storage (AOS) was developed. AOS is a cloud-native, scalable, and domain-agnostic object storage system that provides an S3-compatible interface for a variety of data analysis tools like Apache Spark, TensorFlow, and Pandas. The system uses an underlying distributed NewSQL database to manage detailed information about its resources and can be deployed across multiple data centers for geo-redundancy. AOS is designed to support modern DataOps practices, including the adoption of FAIR principles. Resources in AOS are organized into Objects, Datasets, Collections and Projects, which represent relations of data objects. Additionally, these can be further annotated with key-value pairs called Labels and Hooks to provide additional information about the data. The system's event-driven architecture makes it easy to automate actions and enforce data validation checks, significantly improving accessibility and reproducibility of scientific results. AOS is open source and freely available via https://aruna-storage.org.", "venue": "CoRDI", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-07", "journal": {"name": "Proceedings of the Conference on Research Data Infrastructure"}, "authors": [{"authorId": "2077490670", "name": "M. Dieckmann"}, {"authorId": "2092037812", "name": "Sebastian Beyvers"}, {"authorId": "2238653983", "name": "Jannis Hochmuth"}, {"authorId": "2238652437", "name": "Anna Rehm"}, {"authorId": "2238605383", "name": "Frank Förster"}, {"authorId": "2238642832", "name": "Alexander Goesmann"}], "citations": [{"paperId": "d07411b895efbc1d08bfb690b83cb887f1059b5d", "title": "On the Design and Implementation of Easy Access to External Spatiotemporal Datasets in NFDI"}]}
