{"paperId": "a5f7be7cd0dd5893a19b7c96b82d33ea79743d9d", "publicationVenue": {"id": "53653d01-4a98-4784-a0e2-0a0e2d3104b2", "name": "Ekonomika preduzeca", "alternate_names": ["Ekon preduzeca"], "issn": "0353-443X", "url": "http://scindeks.ceon.rs/journalDetails.aspx?issn=0353-443X", "alternate_urls": ["http://www.ses.org.rs/srp/ekonomika_preduzeca.php"]}, "title": "Analysis of accountants' attitudes on regulation using data mining", "abstract": "The subject of this research is evaluation of legal and international accounting regulations in terms of major deficiencies from the perspective of their users. Identification of the shortcomings of the current accounting regulations is important for improvement of laws governing accounting and audit practices, as they are in the process of public debate in the Republic of Serbia. The research was conducted to provide answers to the following research questions: What are the main deficiencies of regulations as considered by accountants? How do accountants get information on accounting regulations? And are the two research questions related? The targeted population comprises accountants and auditors employed in the private sector. Data collection was carried throughout the period of six months, during which we collected 338 fully completed questionnaires for the purposes of the study. Collected data was analysed using clustering data mining technique. Clustering algorithms enabled segmentation of surveyed accountants into well-separated and homogeneous groups of similar accountants. Analysis of the resulting clusters gave insights into the opinion and stance of accountants who exhibit similar characteristics. These insights form a solid basis for drawing conclusions on deficiencies of accounting regulations perceived by accountants in Serbia, which they are dealing with in day-to-day business.", "venue": "Ekonomika preduzeca", "year": 2020, "fieldsOfStudy": ["Business"], "publicationTypes": ["Review"], "publicationDate": null, "journal": {"name": "Ekonomika preduzeca"}, "authors": [{"authorId": "108640256", "name": "Sunčica Milutinović"}, {"authorId": "2821695", "name": "O. Grljević"}], "citations": []}
