{"paperId": "a627da50f8a792a4b07853b86c592d5bb6eafa91", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "A Traceable and Authenticated IoTs Trigger Event of Private Security Record Based on Blockchain", "abstract": "Recently, private security services have become increasingly needed by the public. The proposed scheme involves blockchain technology with a smart contract. When a private security company signs a contract with a client, they install an Internet of Things (IoTs) device in the client’s house and connect it with the IoT main controller; then, the IoT main controller connects to the security control center (SCC). Once there is an event triggered (e.g., a break-in or fire incident) by the IoTs device, the controller sends a message to the SCC. The SCC allocates a security guard (SG) to the incident scene immediately. After the task is accomplished, the SG sends a message to the SCC. All of these record the messages and events chained in the blockchain center. The proposed scheme makes security event records have the following characteristics: authenticated, traceable, and integral. The proposed scheme is proved by a security analysis with mutual authentication, traceability, integrity, and non-repudiation. The known attacks (e.g., man-in-the-middle attack, replay attack, forgery attack) are avoided by message encryption and a signing mechanism. Threat models in the communication phase can also be avoided. Finally, computation cost, communication performance, and comparison with related works are also discussed to prove its applicability. We also provide an arbitration mechanism, so that the proposed scheme can reduce disputes between private security companies and the client.", "venue": "Applied Sciences", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-03-22", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "2347199", "name": "Chin-Ling Chen"}, {"authorId": "11179024", "name": "Zi-Yi Lim"}, {"authorId": "2234226", "name": "Hsien-Chou Liao"}, {"authorId": "25030062", "name": "Yong-Yuan Deng"}], "citations": [{"paperId": "6a4cf421fa45709e3db1259cebb5f5cf396ec27f", "title": "A review of IoT security and privacy using decentralized blockchain techniques"}, {"paperId": "a0a462237c688087317f78b3fc11592438885f9f", "title": "Framework of Multiparty Computation for Higher Non-Repudiation in Internet-of-Things (IoT)"}]}
