{"paperId": "a62f65f2b3dd6b90224fbf6f000021c4781ef7fc", "publicationVenue": {"id": "0fa5fb50-57a4-4633-aa8f-91804e20ac17", "name": "JOIV: International Journal on Informatics Visualization", "type": "journal", "alternate_names": ["JOIV Int J Informatics Vis"], "issn": "2549-9610", "url": "http://joiv.org/"}, "title": "Data Mining Techniques for Pandemic Outbreak in Healthcare", "abstract": "Pandemic outbreaks such as SARS-CoV, MERS-CoV and Covid-19 have attracted worldwide attention since these viruses have affected many countries and become a global public health issue. In 2019, Covid-19 was announced as a pandemic disease and categorized as a public health emergency globally. It is ranked as the sixth most serious pandemic internationally. This pandemic tracking and analysis require an appropriate method that gives better performance in terms of accuracy, precision and recall that defines its pattern since it involves huge and complicated datasets from the pandemic. Pattern identification is currently applied in many instances due to the rapid growth of data besides having the   potential to generate a knowledge-rich environment which can help to significantly improve the quality of clinical decisions and identify the relationships between data items. Therefore, there is a need to review the techniques in data mining on the pandemic outbreak that focuses on healthcare. The goal of this study was to analyze the algorithms from the data mining method that had been implemented for pandemic outbreaks in past research such as SARS-CoV, MERS-CoV and Covid-19. The result shows that 2 main algorithms, namely Naïve Bayes and Decision Tree, from the classification method, are appropriate algorithms and give more than 90% accuracy in both the pandemic and healthcare. This will be further considered and investigated for future analysis on large datasets of Covid-19 which can help researchers and healthcare practitioners in controlling the infection of the coronavirus using the data mining technique discussed.", "venue": "JOIV: International Journal on Informatics Visualization", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2021-05-08", "journal": {"name": "JOIV : International Journal on Informatics Visualization"}, "authors": [{"authorId": "2292862945", "name": "Nur Izyan Suraya Abdul Satar"}, {"authorId": "144199974", "name": "A. Mohamed"}, {"authorId": "19285116", "name": "Azliza Mohd Ali"}], "citations": [{"paperId": "e4a520a40d60715eb856762c4589d81102f15a0b", "title": "Data Mining Techniques for Ensuring Security in Large Datasets"}, {"paperId": "fba5d6b958b58eb99be873ac6525369e7b2a6e3e", "title": "A Multi-Agent K-Means Algorithm for Improved Parallel Data Clustering"}]}
