{"paperId": "a630e2526b37242864f8995c77f8af9bc86c9895", "publicationVenue": {"id": "23b8d7ac-6e6f-4fe1-9f7e-dc7042815a44", "name": "Symposium on Advances in Databases and Information Systems", "type": "conference", "alternate_names": ["Symp Adv Database Inf Syst", "Advances in Databases and Information Systems", "ADBIS", "Adv Database Inf Syst"], "url": "http://www.ipi.ac.ru/sigmod/"}, "title": "Blink: Lightweight Sample Runs for Cost Optimization of Big Data Applications", "abstract": "Distributed in-memory data processing engines accelerate iterative applications by caching substantial datasets in memory rather than recomputing them in each iteration. Selecting a suitable cluster size for caching these datasets plays an essential role in achieving optimal performance. In practice, this is a tedious and hard task for end users, who are typically not aware of cluster specifications, workload semantics and sizes of intermediate data. We present Blink, an autonomous sampling-based framework, which predicts sizes of cached datasets and selects optimal cluster size without relying on historical runs. We evaluate Blink on a variety of iterative, real-world, machine learning applications. With an average sample runs cost of 4.6% compared to the cost of optimal runs, Blink selects the optimal cluster size in 15 out of 16 cases, saving up to 47.4% of execution cost compared to average costs.", "venue": "Symposium on Advances in Databases and Information Systems", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-07-05", "journal": {"pages": "144-154"}, "authors": [{"authorId": "1410629137", "name": "Hani Al-Sayeh"}, {"authorId": "1703869388", "name": "M. Jibril"}, {"authorId": "2059708", "name": "Bunjamin Memishi"}, {"authorId": "1716839", "name": "K. Sattler"}], "citations": [{"paperId": "0f3b97eb980a9d4f07d606d5f483055e1ca178bd", "title": "Karasu: A Collaborative Approach to Efficient Cluster Configuration for Big Data Analytics"}, {"paperId": "742b3ede9a93f166e695ebedfc1bb060b60457ff", "title": "Selecting Efficient Cluster Resources for Data Analytics: When and How to Allocate for In-Memory Processing?"}, {"paperId": "23a6e0bd5ef9e9deeb0b939b1521b97dc54a0707", "title": "Ruya: Memory-Aware Iterative Optimization of Cluster Configurations for Big Data Processing"}, {"paperId": "a31dffc8d8a3099eb357f429d1bc9cdfbd609377", "title": "SparkCAD: Caching Anomalies Detector for Spark Applications"}]}
