{"paperId": "a65f2e3472f573ab315e146f3e8f2c437a3bdd71", "publicationVenue": {"id": "74f72915-6d78-48b3-85dc-5f79881ab60b", "name": "International Conference on Data Science in Cyberspace", "type": "conference", "alternate_names": ["DSC", "Int Conf Data Sci Sp", "IEEE Conference Dependable and Secure Computing", "IEEE Conference on Dependable and Secure Computing", "IEEE Conf Dependable Secur Comput", "IEEE International Conference on Data Science in Cyberspace", "IEEE Int Conf Data Sci Sp"]}, "title": "MSDB: A Massive Sensor Data Processing Middleware for HBase", "abstract": "With rapid development and extensive usage of sensors technology, large volumes of sensor data are generated. How to effectively store and process sensor data has been widely concerned. However, with the characteristics of chronological order, large volume and high concurrency, there are a number of difficulties, in particular, hot spot problem, data scatter problem and high concurrent transaction processing. In this paper, we proposed a data processing middleware, namely MSDB, to solve issues discussed above when HBase is used as the data storage medium. A pre-split strategy is designed to deal with hot spot problem and a new design of HBase table is employed to solve data scatter problem. In order to handle high concurrency transactions, a buffer mechanism and a node mapping mechanism are also designed for data caching. Experimental results demonstrate that the MSDB overcomes issues discussed above and performs stably when process massive real scene sensor data using HBase.", "venue": "International Conference on Data Science in Cyberspace", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2017-06-01", "journal": {"name": "2017 IEEE Second International Conference on Data Science in Cyberspace (DSC)", "pages": "450-456"}, "authors": [{"authorId": "7648091", "name": "Bowei Liu"}, {"authorId": "37972247", "name": "Ruizhang Huang"}, {"authorId": "145953753", "name": "Ting Huang"}, {"authorId": "2115249198", "name": "Yingying Yan"}], "citations": [{"paperId": "b71ae9746238173a90304e24c8427016ae429f5c", "title": "An Intelligent Service Middleware Based on Sensors in IoT Environments"}, {"paperId": "8d9e557b3750b25741e8b29a0df7c2cc4dc74f81", "title": "Research on Real-Time Storage Technology of UAV Freight Stream Data"}]}
