{"paperId": "a667cc4e3bcff34af64da48c5ab8c4da87739f8d", "publicationVenue": {"id": "764e3630-ddac-4c21-af4b-9d32ffef082e", "name": "IEEE International Conference on Data Engineering", "type": "conference", "alternate_names": ["ICDE", "Int Conf Data Eng", "IEEE Int Conf Data Eng", "International Conference on Data Engineering"], "url": "http://www.wikicfp.com/cfp/program?id=1331"}, "title": "Turbocharging Geospatial Visualization Dashboards via a Materialized Sampling Cube Approach", "abstract": "In this paper, we present a middleware framework that runs on top of a SQL data system with the purpose of increasing the interactivity of geospatial visualization dashboards. The proposed system adopts a sampling cube approach that stores pre-materialized spatial samples and allows users to define their own accuracy loss function such that the produced samples can be used for various user-defined visualization tasks. The system ensures that the difference between the sample fed into the visualization dashboard and the raw query answer never exceeds the user-specified loss threshold. To reduce the number of cells in the sampling cube and hence mitigate the initialization time and memory utilization, the system employs two main strategies: (1) a partially materialized cube to only materialize local samples of those queries for which the global sample (the sample drawn from the entire dataset) exceeds the required accuracy loss threshold. (2) a sample selection technique that finds similarities between different local samples and only persists a few representative samples. Based on the extensive experimental evaluation, Tabula can bring down the total data-to-visualization time (including both data-system and visualization times) of a heat map generated over 700 million taxi rides to 600 milliseconds with 250 meters user-defined accuracy loss. Besides, Tabula costs up to two orders of magnitude less memory footprint (e.g., only 800 MB for the running example) and one order of magnitude less initialization time than the fully materialized sampling cube.", "venue": "IEEE International Conference on Data Engineering", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-04-01", "journal": {"name": "2020 IEEE 36th International Conference on Data Engineering (ICDE)", "pages": "1165-1176"}, "authors": [{"authorId": "97583810", "name": "Jia Yu"}, {"authorId": "1769421", "name": "Mohamed Sarwat"}], "citations": [{"paperId": "e8f578b5b022333489758b47025a1edbd36dc94a", "title": "An efficient visual exploration approach of geospatial vector big data on the web map"}, {"paperId": "9f7ba00450f463e98e7d2eea94e38de9acbe824b", "title": "BlinkViz: Fast and Scalable Approximate Visualization on Very Large Datasets using Neural-Enhanced Mixed Sum-Product Networks"}, {"paperId": "de574b869523901ead78a19d0f548ba028101b07", "title": "GSViz: progressive visualization of geospatial influences in social networks"}, {"paperId": "d3ecc804d926580721a19a06b0f418b5a3a2f2e6", "title": "A Machine Learning-Aware Data Re-partitioning Framework for Spatial Datasets"}, {"paperId": "26cd4987ac08bfe43865b05f7cd22f1d7488e45e", "title": "GeoMapViz: a framework for distributed management and geospatial data visualization based on massive spatiotemporal data streams"}, {"paperId": "179dac326d74d14a53a75884e865c0df48dfeac5", "title": "Beast: Scalable Exploratory Analytics on Spatio-temporal Data"}, {"paperId": "9b56937bbd2a361802c352333b3126778768af87", "title": "GeoSparkViz: a cluster computing system for visualizing massive-scale geospatial data"}, {"paperId": "37ec44f5380f934e1e04bc13cfbbd27a2df1bce6", "title": "Tabula in action"}, {"paperId": "6fe60b96d4455788ccb6433af8b95abae6860b7e", "title": "Intelligent Data Visualization Analysis Techniques: A Survey"}]}
