{"paperId": "a670fbcd67a520c3a3637f91f632ecad27568258", "publicationVenue": {"id": "5b924e1a-30f3-4275-bdb8-5a15517c0fde", "name": "Asia-Pacific Signal and Information Processing Association Annual Summit and Conference", "type": "conference", "alternate_names": ["Asia-pacific Signal Inf Process Assoc Annu Summit Conf", "APSIPA"]}, "title": "Investigate Bidirectional Functional Brain Networks Using Directed Information", "abstract": "Perception processing in the human brain is medi-ated by functional connectivity among brain areas. To a certain extent, functional connectivity builds a communication channel among brain regions and even supports our perception and consciousness functions. However, the flow of information doesn't always go in the same direction between different parts of the brain, and it also uses bidirectional exchanges of information. The role of bidirected functional connectivity in the brain is still not well explored so far. More narrowly, we want to know how bidirectional communication regions in the different brain areas help with information processing. To do this, we used directed information to quantify information exchange from simulation neural signals and real neural data that includes each part of the visual cortex region, and it showed that directed information can discover causal effects in both simulation and real experiments. All in all, in this study, we tried to understand information processes with bidirected functional connectivity and explored both feedforward and feedback information flow in the brain regions. On the one hand, we discovered feedback functional connectivity between visual regions, such as LRSC, LLOC, LOPA, and RPPA. Biologically speaking, this makes sense because natural images, such as objects, places, or more complex images, are typically represented in high-level visual regions. On the other hand, we also found that there is information flow between the scene-selective areas, e.g., OPA, PPA, RSC, and object-selective regions, e.g., LOC. As a result, we can gain a better understanding of how information is shared and communicated from an information-theoretical perspective with directed information.", "venue": "Asia-Pacific Signal and Information Processing Association Annual Summit and Conference", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-11-07", "journal": {"name": "2022 Asia-Pacific Signal and Information Processing Association Annual Summit and Conference (APSIPA ASC)", "pages": "109-116"}, "authors": [{"authorId": "2146262430", "name": "Qiang Li"}], "citations": [{"paperId": "79bd61d6bc171bd010f7666d375ab8af49a5c98b", "title": "Visual Image Reconstructed Without Semantics from Human Brain Activity Using Linear Image Decoders and Nonlinear Noise Suppression"}, {"paperId": "dd558ef71778066d96dc9efc5d00025dc66cfda9", "title": "Exploring Nonlinear Dynamics In Brain Functionality Through Phase Portraits And Fuzzy Recurrence Plots"}, {"paperId": "cacc4b203f76292179385aa9c7320c5798cfa085", "title": "Visual Image Reconstruction from Human Brain Activity using Linear Image Decoders plus Nonlinear Noise Suppression"}]}
