{"paperId": "a686814dcc2defff91575bdc243f5c63f75487b5", "publicationVenue": {"id": "a4f30d5d-eda9-47ef-adc5-accd6c401486", "name": "International Conference Electronic Systems, Signal Processing and Computing Technologies [ICESC-]", "type": "conference", "alternate_names": ["ICESC", "Int Conf Electron Syst Signal Process Comput Technol [ICESC"]}, "title": "Plan of Block-chain Enabled Confirmed Key Management Protocol for Internet of Medical Things Development", "abstract": "With the emergence and influence of the Internet on the healthcare industry, it necessitates the need to preserve, access, and update medical records from anywhere and at any time. Medical discrepancies associated with Electronic Health Records (EHR) must be addressed, as it has privacy and security issues. The lack of consistency was certainly the most critical issue, but it is far from the only issue with EHR. Decentralized cloud models based on blockchain platforms have previously been proposed and deployed to address interoperability and privacy concerns. Other issues, though, remain. Three of the most critical concerns are scalability, usability, and accessibility. This research study presents a Secure eHealth Framework (SeFra) based on a progressive temporal blockchain method to overcome the aforementioned concerns. Context-based Merkle Tree (CBMT) and Context-Based Access Control (CBAC) are two of SeFra's core building blocks that are specifically focused on establishing security, increased integrity checking, and access control approaches. Interoperability and scalability issues are also handled through the use of temporal characteristics in conjunction with HL7 protocols, as well as data management using the Interplanetary File System (IPFS). The results show that temporal shadow concepts and context-based features have an impact on the proposed framework's capacity to safely manage the Personalised Micro Ledger (PML). It also aids in the collection of medical data in text format with temporal aspects and its dissemination to all other peers in line with the restrictions set in the context-based smart contract.", "venue": "International Conference Electronic Systems, Signal Processing and Computing Technologies [ICESC-]", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-08-17", "journal": {"name": "2022 3rd International Conference on Electronics and Sustainable Communication Systems (ICESC)", "pages": "668-673"}, "authors": [{"authorId": "47584037", "name": "R. Jayasri"}, {"authorId": "72089735", "name": "D. Jayakumar"}, {"authorId": "2185623371", "name": "S. Joshila Roselin"}, {"authorId": "1388810094", "name": "M. Ramkumar"}], "citations": []}
