{"paperId": "a6a074055eb378ba78ba499adb46286397074d42", "publicationVenue": null, "title": "Multi-objective clustering algorithm using particle swarm optimization with crowding distance (MCPSO-CD)", "abstract": "Clustering, an unsupervised method of grouping sets of data, is used as a solution technique in various ﬁelds to divide and restructure data to become more signiﬁcant and transform them into more useful information. Generally, clustering is difﬁcult and complex phenomenon, where the appropriate numbers of clusters are always unknown, comes with a large number of potential solutions, and as well the datasets are unsupervised. These problems can be addressed by the Multi-Objective Particle Swarm Optimization (MOPSO) approach, which is commonly used in addressing optimization problems. However, MOPSO algorithm produces a group of non-dominated solutions which make the selection of an “appropriate” Pareto optimal or non-dominated solution more difficult. According to the literature, crowding distance is one of the most efficient algorithms that was developed based on density measures to treat the problem of selection mechanism for archive updates. In an attempt to address this problem, the clustering-based method that utilizes crowding distance (CD) technique to balance the optimality of the objectives in Pareto optimal solution search is proposed. The approach is based on the dominance concept and crowding distances mechanism to guarantee survival of the best solution. Furthermore, we used the Pareto dominance concept after calculating the value of crowding degree for each solution. The proposed method was evaluated against five clustering approaches that have succeeded in optimization that comprises of K-means Clustering, MCPSO, IMCPSO, Spectral clustering, Birch, and average-link algorithms. The results of the evaluation show that the proposed approach exemplified the state-of-the-art method with significant differences in most of the datasets tested.", "venue": "", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2020-03-31", "journal": {"name": "International Journal of Advances in Intelligent Informatics", "pages": "72-81", "volume": "6"}, "authors": [{"authorId": "1658525638", "name": "Alwatben Batoul Rashed"}, {"authorId": "2392987", "name": "H. Hamdan"}, {"authorId": "2437081", "name": "N. Sharef"}, {"authorId": "1398440197", "name": "Nasir Sulaiman"}, {"authorId": "2590630", "name": "R. Yaakob"}, {"authorId": "40178679", "name": "M. Abubakar"}], "citations": [{"paperId": "91bbab871b3d5df5935ca81f49830d44b43e00d8", "title": "A multi-objective vibrating particle system algorithm for data clustering"}, {"paperId": "97ec5990fa8d4e649cef822cd9995f68c47e9f6c", "title": "Directionally-Enhanced Binary Multi-Objective Particle Swarm Optimisation for Load Balancing in Software Defined Networks"}, {"paperId": "a2aef3455c77a994075ca7d907535d036aadd263", "title": "A survey of nature-inspired algorithm for partitional data clustering"}]}
