{"paperId": "a6ada9d54ed27eeae6a4a7ec6daf62fecfaaae62", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Multistep Wind Power Prediction Using Time-Varying Filtered Empirical Modal Decomposition and Improved Adaptive Sparrow Search Algorithm-Optimized Phase Space Reconstruction–Echo State Network", "abstract": "Accurate wind power prediction is vital for improving grid stability. In order to improve the accuracy of wind power prediction, in this study, a hybrid prediction model combining time-varying filtered empirical modal decomposition (TVFEMD), improved adaptive sparrow search algorithm (IASSA)-optimized phase space reconstruction (PSR) and echo state network (ESN) methods was proposed. First, the wind power data were decomposed into a set of subsequences by using TVFEMD. Next, PSR was used to construct the corresponding phase space matrix for sequences, which were then divided into training sets, validation sets, and testing sets. Then, ESN was used for subsequence prediction. Finally, the predicted values of all the subseries were used to determine the final predicted power. To enhance the model performance, the sparrow search algorithm was improved in terms of the discoverer position update strategy, the follower position update strategy, and the population structure. IASSA was employed to synchronously optimize multiple parameters of PSR-ESN. The results revealed that the proposed model has higher applicability and prediction accuracy than existing models.", "venue": "Sustainability", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-05", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "2111728732", "name": "Chao Tan"}, {"authorId": "1978029564", "name": "Wenrui Tan"}, {"authorId": "2190394398", "name": "Yanjun Shen"}, {"authorId": "2184211843", "name": "Long Yang"}], "citations": [{"paperId": "fbfad89c59e051ba97fcf078f0ff57a2127916ff", "title": "A short-term wind power prediction approach based on an improved dung beetle optimizer algorithm, variational modal decomposition, and deep learning"}, {"paperId": "d0869dbff172fb9c0ada02eebea0d4a10d29454e", "title": "Stocks price prediction based on optimized echo state network by sparrow search algorithm"}, {"paperId": "a3f0d01b629eb705f04084b7ea38f660a90706e0", "title": "A hybrid model with combined feature selection based on optimized VMD and improved multi-objective coati optimization algorithm for short-term wind power prediction"}, {"paperId": "c13437d24c80e9525774f5f9e9c77516218b2ee7", "title": "White shark optimizer with optimal deep learning based effective unmanned aerial vehicles communication and scene classification"}, {"paperId": "ae662d01b49b5c98a06081a14e40590a04591d6a", "title": "Hybrid Hunter–Prey Optimization with Deep Learning-Based Fintech for Predicting Financial Crises in the Economy and Society"}]}
