{"paperId": "a6c811356dd155bc7a8c7c50a0f42fe44bf3f410", "publicationVenue": {"id": "e2742a49-1b55-4a31-b319-7455fa5e12d4", "name": "IEEE Transactions on Services Computing", "type": "journal", "alternate_names": ["IEEE Trans Serv Comput"], "issn": "1939-1374", "url": "http://www.computer.org/tsc", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=4629386"]}, "title": "A Blockchain-Based Model for Cloud Service Quality Monitoring", "abstract": "This paper introduces a novel blockchain-based decentralized federation model that embodies quality verification for cloud providers who lease computing resources from each other. The blockchain structure removes the barriers of a traditional centralized federation and offers a fully distributed and transparent administration by enforcing the involved agents to maintain consensus on the data. For a blockchain-based federation, it is vital to avoid blind-trust on the claimed SLA guarantees and monitor the quality of service which is highly desirable considering the multi-tenancy characteristic of cloud services. Due to the fact that the blockchain network is unable to access the outside world, it cannot handle, by its own, providers misbehavior in terms of SLA violations. Thus, we introduce oracle as a verifier agent to monitor the quality of the service and report to the smart contract agents deployed on the blockchain. Oracle is a trusted third-party agent who can communicate with the outside world of the blockchain network. The interaction between cloud service providers (either providing a service or requesting it from another provider) and the oracle through smart contracts comprises a system of autonomous and utility maximizer agents. Cloud requesters seek to receive high quality services with constant monitoring at cheap prices or even with no charge, while cloud providers aim to have a balanced work-load with less preserved capacity, and the oracle tends to charge higher for their monitoring services. Therefore, to model this conflicting situation, we formulate a dynamic Stackelberg differential game to optimize the cost of using the oracle and maximize the profit of the agents with the role of provider agent as a leader, and the requester and verifier agents as followers. Our designed Stackelberg differential game can seize the dynamicity of users’ demand and resource provisioning in a competitive cloud market. We implemented our proposed decentralized model using the Solidity language in the remix IDE on the Ethereum network. We further evaluated the optimal controls and agents’ profit with real-world data simulated for three concrete cloud providers. The results revealed that the requester agent initiates most of the quality verification requests at the beginning to the middle time of the contract. Thus, the provider agent could reserve less computing resources considering the fact that it could share the workload among other customers’ computing resources during the peak-time. Moreover, imposing a higher penalty on the provider agent increased the capacity and decreased the number of requests for quality verification at the equilibrium. The evaluation also disclosed that the impact of timing in the dynamic pricing strategy of the verifier agent is very minimal, and the provisioning capacity of the provider is strongly correlated with the monitoring price.", "venue": "IEEE Transactions on Services Computing", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-03-01", "journal": {"name": "IEEE Transactions on Services Computing", "pages": "276-288", "volume": "13"}, "authors": [{"authorId": "1809761", "name": "M. Taghavi"}, {"authorId": "1812107", "name": "J. Bentahar"}, {"authorId": "1718596", "name": "Hadi Otrok"}, {"authorId": "1759238", "name": "Kaveh Bakhtiyari"}], "citations": [{"paperId": "6581965cd9af997b2a641caea4adbf533d573bca", "title": "A Blockchain System for QoS Monitoring in Decentralized Edge Computing"}, {"paperId": "bbfcd0e3c8d0442afa9a3f37eb12b4028dcb2e6c", "title": "A Blockchain-Based Hedonic Game Scheme for Reputable Fog Federations"}, {"paperId": "12b29ba78d91ad8a1ab463130d4316a5429fac5f", "title": "Blockchain based resource allocation in cloud and distributed edge computing: A survey"}, {"paperId": "c588e77203ae0a985c816683abaaf5bdb4909704", "title": "EduChain: A Blockchain-based Education Data Management System"}, {"paperId": "4dff6d48e7b7b3ff956433a685601d39227ae5aa", "title": "Traces: Inkling Blockchain for Distributed Storage in Constrained IIoT Environments"}, {"paperId": "247ee45df4c36840a7f6ad86e828dbe45b2f2c1c", "title": "A reinforcement learning model for the reliability of blockchain oracles"}, {"paperId": "e427d954bd7af42b72b254264c14c35469cf879d", "title": "Overview of Blockchain Oracle Research"}, {"paperId": "ef475fe3e499f094e2d07def65e5819f8baf1cd0", "title": "On-chain behavior prediction Machine Learning model for blockchain-based crowdsourcing"}, {"paperId": "2aac2347fb6a0649abd5ce4c8506c5c2c0dff9f2", "title": "PackChain: Toward a Blockchain-based Management Platform for Last-mile Delivery"}, {"paperId": "633359f9d516507ad7a680d2a9ccff362ecdd0f8", "title": "A survey of application research based on blockchain smart contract"}, {"paperId": "95230c121e23d6468ba5e385ab893838b674b84e", "title": "A Multiple-Blockchains based Service Monitoring Framework in Edge-Cloud Computing"}, {"paperId": "e06a1f73f748c85340f740d9507dfde0e252c9aa", "title": "Combining Blockchain Multi Authority and Botnet to Create a Hybrid Adaptive Crypto Cloud Framework"}, {"paperId": "bdcdcd7513509bda6b3a63442f78e4baf50b0ca6", "title": "Blockchain-enabled real-time SLA monitoring for cloud-hosted services"}, {"paperId": "c868b5686e107fa7ba4db91d938d0335f7e353f9", "title": "SAIaaS: A Blockchain-Based Solution for Secure Artificial Intelligence as-a-Service"}, {"paperId": "fcd821653c3d9edb9b1a2351996ef5670231229f", "title": "A Bytecode-based Approach for Smart Contract Classification"}, {"paperId": "1b0ed1acdb66fa4bc3718e825cf79995651d6858", "title": "RDIC: A blockchain-based remote data integrity checking scheme for IoT in 5G networks"}, {"paperId": "c6e1bc70b75bed27d8727b712db3fa01061fbd64", "title": "Escalonamento de máquinas virtuais baseado em custo e tolerante a anomalias de tráfego de rede para Dados-como-Serviço"}, {"paperId": "b815f782662787e121611e5a74b59047feca7efd", "title": "Integration of Blockchain and Cloud of Things: Architecture, Applications and Challenges"}, {"paperId": "652c0e8bcdcbcd9afa314c45c4265eb4735d5b83", "title": "A Mapping Review on Cyber-Physical Smart Contracts: Architectures, Platforms, and Challenges"}, {"paperId": "5fc7da9d626d4512acab6bc511a7f20f024b87e2", "title": "HLF-Kubed: Blockchain-Based Resource Monitoring for Edge Clusters"}, {"paperId": "05f0611ad67cb8a99fe688d0f82629d11c277353", "title": "Blockchain incentivized data forwarding in MANETs: Strategies and challenges"}, {"paperId": "c256feba3d9390d4b036dd68977fccb28f2f918b", "title": "Who Is Contributing to Academic Research on Blockchain Oracles? A Bibliometric Analysis"}]}
