{"paperId": "a6cf3a835a673417a086ecae405b34b15d59c7ca", "publicationVenue": null, "title": "You’ve never been welcome here: exploring the relationship between exclusivity and incivility in online forums", "abstract": "ABSTRACT This paper investigates the underexplored relationship between norms of inclusivity and civility. It asks whether, in the context of online forums, groups with more exclusionary language in their rules statements will generate more uncivil comments, and whether political orientation of the most exclusive forums will affect incivility in comments. Sidebar data and one month’s worth of comments spanning between June and July of 2020 (n = 4,413,646) were collected from 71 political forums on Reddit. A sample of these comments was analyzed using Google’s Perspective API to assess their toxic incivility. Fitting a multilevel regression model that respects the hierarchical structure of the data shows no significant association between inclusivity and incivility. However, depth of the comment in the reply structure and length of the comment were found to be significant predictors of toxic incivility when controlling for political alignment of the subreddit, with comments at a deeper level being, on average, slightly less toxic. In addition, toxic incivility was found to be associated with an increase in a comment’s upvotes. These results suggest that toxic incivility varies significantly between and within subreddits, submissions, and top-level comments, and that inclusionary language is not a reliable predictor of toxic incivility.", "venue": "Journal of Information Technology &amp; Politics", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-05-03", "journal": {"name": "Journal of Information Technology & Politics", "pages": "139 - 153", "volume": "20"}, "authors": [{"authorId": "2164529461", "name": "Russell W. Hansen"}], "citations": [{"paperId": "a26cc93cbc4dc93c98ff8f07b9c878a177556b3d", "title": "Incivility in COVID-19 Vaccine Mandate Discourse and Moral Foundations: Natural Language Processing Approach"}]}
