{"paperId": "a6d1716dfe1d5d34371b9d0b8bb6783533d21114", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "DV-ARPA: Data Variety Aware Resource Provisioning for Big Data Processing in Accumulative Applications", "abstract": "In Cloud Computing, the resource provisioning approach used has a great impact on the processing cost, especially when it is used for Big Data processing. Due to data variety, the performance of virtual machines (VM) may differ based on the contents of the data blocks. Data variety-oblivious allocation causes a reduction in the performance of VMs and increases the processing cost. Thus, it is possible to reduce the total cost of the job by matching the VMs with the given data blocks. We use a data-variety-aware resource allocation approach to reduce the processing cost of the considered job. For this issue, we divide the input data into some data blocks. We define the significance of each data block and based on it we choose the appropriate VMs to reduce the cost. For detecting the significance of each data portion, we use a specific sampling method. This approach is applicable to accumulative applications. We use some well-known benchmarks and configured servers for our evaluations. Based on the results, our provisioning approach improves the processing cost, up to 35% compared to other approaches.", "venue": "arXiv.org", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-08-11", "journal": {"name": "ArXiv", "volume": "abs/2008.04674"}, "authors": [{"authorId": "2084846760", "name": "Hossein Ahmadvand"}, {"authorId": "80784428", "name": "Fouzhan Foroutan"}], "citations": [{"paperId": "432bd28c0dc03277fdf9cfb544babf4699176d1e", "title": "DV-DVFS: merging data variety and DVFS technique to manage the energy consumption of big data processing"}, {"paperId": "07bd823ce910a7918ec92fdf25fa940f93c2dd24", "title": "Data Imputation Techniques Applied to the Smart Grids Environment"}, {"paperId": "6bfd88b8d69ad74bd8e110d4400f2d3ac6730794", "title": "Load Balancing in Cloud Environment: A State-of-the-Art Review"}]}
