{"paperId": "a6dbe3b73ea426a80a7e9e8ae99c14c1ed82fe18", "publicationVenue": {"id": "c6840156-ee10-4d78-8832-7f8909811576", "name": "IEEE Transactions on Knowledge and Data Engineering", "type": "journal", "alternate_names": ["IEEE Trans Knowl Data Eng"], "issn": "1041-4347", "url": "https://www.computer.org/web/tkde", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=69"]}, "title": "Efficient Distributed Clustering Algorithms on Star-Schema Heterogeneous Graphs", "abstract": "Many datasets including social media data and bibliographic data can be modeled as graphs. Clustering such graphs is able to provide useful insights into the structure of the data. To improve the quality of clustering, node attributes can be taken into account, resulting in attributed graphs. Existing attributed graph clustering methods generally consider attribute similarity and structural similarity separately. In this paper, we represent attributed graphs as star-schema heterogeneous graphs, where attributes are modeled as different types of graph nodes. This enables the use of personalized pagerank (PPR) as a unified distance measure that captures both structural and attribute similarities. We employ DBSCAN for clustering, and we update edge weights iteratively to balance the importance of different attributes. The rapidly growing volume of data nowadays challenges traditional clustering algorithms, and thus, a distributed method is required. Hence, we adopt a popular distributed graph computing system Blogel, based on which, we develop four exact and approximate approaches that enable efficient PPR score computation when edge weights are updated. To improve the effectiveness of the clustering, we propose a simple yet effective edge weight update strategy based on entropy. In addition, we present a game theory based method that enables trading efficiency for result quality. Extensive experiments on real-life datasets offer insights into the effectiveness and efficiency of our proposals.", "venue": "IEEE Transactions on Knowledge and Data Engineering", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-12-28", "journal": {"name": "IEEE Transactions on Knowledge and Data Engineering", "pages": "4781-4796", "volume": "34"}, "authors": [{"authorId": "2115384591", "name": "Lu Chen"}, {"authorId": "1409828392", "name": "Yunjun Gao"}, {"authorId": "2152664616", "name": "Xin Huang"}, {"authorId": "145917501", "name": "Christian S. Jensen"}, {"authorId": "133730578", "name": "Bolong Zheng"}], "citations": [{"paperId": "009f3b3ac635cc50e94cc5fd09ff0d2bcabfdd99", "title": "Flexible Tensor Learning for Multi-View Clustering With Markov Chain"}, {"paperId": "cb104ada69faee029c83b69afff002bad0bf8464", "title": "Detecting communities with multiple topics in attributed networks via self-supervised adaptive graph convolutional network"}, {"paperId": "5dd2e1428728af659a241d6c20235611d517bab0", "title": "Batch Hop-Constrained s-t Simple Path Query Processing in Large Graphs"}, {"paperId": "5ee6238fa1ab42d3352e9b1b78e41c873d804f50", "title": "An Inverse-Free Block-SOR Method With Randomly Sampling for Temporal Multiplex PageRank Problems"}, {"paperId": "ac10d22a7ad3802ac37d34e9f4565e896a7b7779", "title": "Multiple Topics Community Detection in Attributed Networks"}]}
