{"paperId": "a6e21417ebf4d156875a7d028cfad9512adf4125", "publicationVenue": {"id": "939ba3df-4270-4ba0-ad98-ffe889f3546e", "name": "Processes", "issn": "2227-9717", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-317995", "alternate_urls": ["https://www.mdpi.com/journal/processes", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-317995"]}, "title": "Waterwheel Plant Algorithm: A Novel Metaheuristic Optimization Method", "abstract": "Attempting to address optimization problems in various scientific disciplines is a fundamental and significant difficulty requiring optimization. This study presents the waterwheel plant technique (WWPA), a novel stochastic optimization technique motivated by natural systems. The proposed WWPA’s basic concept is based on modeling the waterwheel plant’s natural behavior while on a hunting expedition. To find prey, WWPA uses plants as search agents. We present WWPA’s mathematical model for use in addressing optimization problems. Twenty-three objective functions of varying unimodal and multimodal types were used to assess WWPA’s performance. The results of optimizing unimodal functions demonstrate WWPA’s strong exploitation ability to get close to the optimal solution, while the results of optimizing multimodal functions show WWPA’s strong exploration ability to zero in on the major optimal region of the search space. Three engineering design problems were also used to gauge WWPA’s potential for improving practical programs. The effectiveness of WWPA in optimization was evaluated by comparing its results with those of seven widely used metaheuristic algorithms. When compared with eight competing algorithms, the simulation results and analyses demonstrate that WWPA outperformed them by finding a more proportionate balance between exploration and exploitation.", "venue": "Processes", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-15", "journal": {"name": "Processes"}, "authors": [{"authorId": "2056491743", "name": "Abdelaziz A. Abdelhamid"}, {"authorId": "2213155699", "name": "S. Towfek"}, {"authorId": "1396403182", "name": "Nima Khodadadi"}, {"authorId": "3436873", "name": "A. Alhussan"}, {"authorId": "2143345744", "name": "D. S. Khafaga"}, {"authorId": "1967835", "name": "M. Eid"}, {"authorId": "116674046", "name": "A. Ibrahim"}], "citations": [{"paperId": "e25813c59dd5396a6c4f806bd40afb85ded86e8b", "title": "Chaos-Enhanced Archimede Algorithm for Global Optimization of Real-World Engineering Problems and Signal Feature Extraction"}, {"paperId": "fa3b0677d736185e5283038ef4c6c957ee834c7a", "title": "Application of supervised random forest paradigms based on optimization and post-hoc explanation in underground stope stability prediction"}, {"paperId": "74bfdb2a9c3291a665fb5bde43084cdbd5718653", "title": "Wolf-Bird Optimizer (WBO): A Novel Metaheuristic Algorithm for Building Information Modeling-based Resource Tradeoff"}, {"paperId": "6659073efedd4e1a0020656ae3931835ddb75479", "title": "Electrical power output prediction of combined cycle power plants using a recurrent neural network optimized by waterwheel plant algorithm"}, {"paperId": "4f0d92e029398d9d7724a41883a4a145e23551ca", "title": "A Novel Artificial-Intelligence-Based Approach for Classification of Parkinson’s Disease Using Complex and Large Vocal Features"}, {"paperId": "74e3b4fad32ea364aab104940d775c54726c67b0", "title": "Diagnosis of Monkeypox Disease Using Transfer Learning and Binary Advanced Dipper Throated Optimization Algorithm"}, {"paperId": "91c3294e19c4f7dd95b50b5a28c2ddf281b2b5c4", "title": "Optimizing Truss Structures Using Composite Materials under Natural Frequency Constraints with a New Hybrid Algorithm Based on Cuckoo Search and Stochastic Paint Optimizer (CSSPO)"}, {"paperId": "6ee848dcf034c508d70f926817151a05f723ce83", "title": "BAOA: Binary Arithmetic Optimization Algorithm With K-Nearest Neighbor Classifier for Feature Selection"}, {"paperId": "983db9cc43bbc3798d7a9a96aa2e168197856fa8", "title": "A Binary Waterwheel Plant Optimization Algorithm for Feature Selection"}, {"paperId": "6783dbfc792d2babf80287694fbd01f711acc9a0", "title": "The Mountain Gazelle Optimizer for truss structures optimization"}, {"paperId": "af550d8de7d6fa5bbe9f79084592117897a23b8d", "title": "A Recommendation System for Electric Vehicles Users Based on Restricted Boltzmann Machine and WaterWheel Plant Algorithms"}]}
