{"paperId": "a6e7a80322197d16a5d2c4804cfd0489adc90f7d", "publicationVenue": {"id": "e1ce0fed-d655-40bd-b678-9adc73f2e582", "name": "International Symposium on High Performance Computing Systems and Applications", "type": "conference", "alternate_names": ["International Conference on High Performance Computing and Simulation", "Int Conf High Perform Comput  Simul", "Int Symp High Perform Comput Syst Appl", "High Performance Computing Systems and Applications", "High Perform Comput Syst Appl", "Int Conf High Perform Comput Simul", "HPCS", "International Conference on High Performance Computing & Simulation"]}, "title": "Bridging a Data-Flow Execution Model to a Lightweight Programming Model", "abstract": "Starting from a Data-Flow execution model called “DF-Threads”, we defined a minimalistic API to enable an efficient implementation in the hardware of the distribution of the threads across the cores of a single multi-core system and across the remote cores of a cluster. We aim at proposing this API as a simple programming model in C language that can potentially permit an easy interface between DF-Threads and generic programming models. Clusters are typically programmed with MPI, therefore we evaluated our approach against OpenMPI. If we consider the delivered GFLOPS per core, DF-Threads are also competitive in respect to CUDA. In the basic examples, that we used in this initial investigation, DF-Threads achieve better performance-per-core compared to OpenMPI and CUDA. In particular, OpenMPI has a large portion of OS-kernel activity, which is slowing down its performance.", "venue": "International Symposium on High Performance Computing Systems and Applications", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-07-01", "journal": {"name": "2019 International Conference on High Performance Computing & Simulation (HPCS)", "pages": "165-168"}, "authors": [{"authorId": "1816975", "name": "R. Giorgi"}, {"authorId": "88727757", "name": "Marco Procaccini"}], "citations": [{"paperId": "d5941acfaa0e49260aad12ad81f5aecbec3a7883", "title": "Distributed large-scale graph processing on FPGAs"}, {"paperId": "2d32cf22dd7ee84fc71072fdf1acde634222cbff", "title": "Multi-Criteria Optimization of Real-Time DAGs on Heterogeneous Platforms under P-EDF"}, {"paperId": "18b9c299782b3e1afa1eab90fcbfb38aeedd07c0", "title": "DRT: A Lightweight Runtime for Developing Benchmarks for a Dataflow Execution Model"}, {"paperId": "c714b4c8863e16bff77308197fd692de7f41a439", "title": "A data-flow execution engine for scalable embedded computing"}]}
