{"paperId": "a6f48070535ff5ec65d0f28037a9becfac2d1903", "publicationVenue": {"id": "f4989ee4-e1d2-45b4-85ad-c43a8ffef177", "name": "ACM SIGACT-SIGMOD-SIGART Symposium on Principles of Database Systems", "type": "conference", "alternate_names": ["PODS", "Symp Princ Database Syst", "Symposium on Principles of Database Systems", "ACM SIGACT-SIGMOD-SIGART Symp Princ Database Syst"], "url": "http://www.acm.org/sigmod/pods/index.html"}, "title": "Tuple-Independent Representations of Infinite Probabilistic Databases", "abstract": "Probabilistic databases (PDBs) are probability spaces over database instances. They provide a framework for handling uncertainty in databases, as occurs due to data integration, noisy data, data from unreliable sources or randomized processes. Most of the existing theory literature investigated finite, tuple-independent PDBs (TI-PDBs) where the occurrences of tuples are independent events. Only recently, Grohe and Lindner (PODS '19) introduced independence assumptions for PDBs beyond the finite domain assumption. In the finite, a major argument for discussing the theoretical properties of TI-PDBs is that they can be used to represent any finite PDB via views. This is no longer the case once the number of tuples is countably infinite. In this paper, we systematically study the representability of infinite PDBs in terms of TI-PDBs and the related block-independent disjoint PDBs. The central question is which infinite PDBs are representable as first-order views over tuple-independent PDBs. We give a necessary condition for the representability of PDBs and provide a sufficient criterion for representability in terms of the probability distribution of a PDB. With various examples, we explore the limits of our criteria. We show that conditioning on first order properties yields no additional power in terms of expressivity. Finally, we discuss the relation between purely logical and arithmetic reasons for (non-)representability.", "venue": "ACM SIGACT-SIGMOD-SIGART Symposium on Principles of Database Systems", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2020-08-21", "journal": {"name": "Proceedings of the 40th ACM SIGMOD-SIGACT-SIGAI Symposium on Principles of Database Systems"}, "authors": [{"authorId": "3393481", "name": "Nofar Carmeli"}, {"authorId": "1744396", "name": "Martin Grohe"}, {"authorId": "1398932539", "name": "P. Lindner"}, {"authorId": "3360485", "name": "Christoph Standke"}], "citations": [{"paperId": "1f25df5e54f00f5d0383b33da6d013f6edda6b77", "title": "Querying Incomplete Numerical Data: Between Certain and Possibile Answers"}, {"paperId": "bad03fffafd3de750029e20c25d98dc6f6ce8fd7", "title": "Probabilistic Data with Continuous Distributions"}, {"paperId": "68c47eb738df2ed6c2781abe8af1d0303f4ad373", "title": "Independence in Infinite Probabilistic Databases"}, {"paperId": "ac97b83f030f84addfe748db11de5d894f95c260", "title": "Edinburgh Research Explorer Querying Incomplete Numerical Data: Between Certain and Possible Answers"}]}
