{"paperId": "a6f9d5ca6b5eb637d93e69af9d924f6491e94267", "publicationVenue": null, "title": "Learned Cardinality Estimation: An In-depth Study", "abstract": "Learned cardinality estimation (CE) has recently gained significant attention for replacing long-studied traditional CE with machine learning, especially for deep learning. However, these estimators were developed independently and have not been fairly or comprehensively compared in common settings. Most studies use a subset of IMDB data which is too simple to measure their limits and determine whether they are ready for real, complex data. Furthermore, they are regarded as black boxes, without a deep understanding of why large errors occur. In this paper, we first provide a taxonomy and a unified workflow of learned estimators for a better understanding of estimators. We next comprehensively compare recent learned CE methods that support joins, from a subset of tables to full IMDB and TPC-DS datasets. Under the experimental results, we then demystify the black-box models and analyze critical components that cause large errors. We also measure their impact on query optimization. Finally, based on the findings, we suggest realizable research opportunities. We believe that a deeper understanding of the behavior of existing methods can provide a more comprehensive and substantial framework for developing better estimators.", "venue": "SIGMOD Conference", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2022-06-10", "journal": {"name": "Proceedings of the 2022 International Conference on Management of Data"}, "authors": [{"authorId": "2117862355", "name": "Kyoungmin Kim"}, {"authorId": "2130912623", "name": "Jisung Jung"}, {"authorId": "2113614601", "name": "In Seo"}, {"authorId": "144422954", "name": "Wook-Shin Han"}, {"authorId": "2169885949", "name": "Kangwoo Choi"}, {"authorId": "2169797751", "name": "Jaehyok Chong"}], "citations": [{"paperId": "20aa90187af7dd6508fa32ab438ea243fee0f5fa", "title": "PACE: Poisoning Attacks on Learned Cardinality Estimation"}, {"paperId": "305612b49d1d43fa8fd70e0cc506d0ab51e8ba8f", "title": "ASM: Harmonizing Autoregressive Model, Sampling, and Multi-dimensional Statistics Merging for Cardinality Estimation"}, {"paperId": "756430d0c98735873f66ef887c441f5475afecbf", "title": "LearnedWMP: Workload Memory Prediction Using Distribution of Query Templates"}, {"paperId": "302bbba2f61082f63f99c8dd0269d047f7efb837", "title": "Advanced Dataset Discovery: When Multi-Query-Dataset Cardinality Estimation Matters"}, {"paperId": "afb1a80213f08a99bc39a38956ef76d5c3cd3cc7", "title": "Enhancing Computation Pushdown for Cloud OLAP Databases"}, {"paperId": "d13b3c9d4a7bd05133578e566657658dc531e29f", "title": "Adding Domain Knowledge to Query-Driven Learned Databases"}, {"paperId": "b76e903b9f1a9c7c51962a79eda10885efda1d35", "title": "Sample-Efficient Cardinality Estimation Using Geometric Deep Learning"}, {"paperId": "35a2cf25d8c38f52b9438e68246a4e46bef2b693", "title": "A Comparative Study and Component Analysis of Query Plan Representation Techniques in ML4DB Studies"}, {"paperId": "41c5e8eeafde70bdfc51aef5ea4a3e66b7572ccc", "title": "Serving Deep Learning Model in Relational Databases"}, {"paperId": "8add1ac7b254b259c038db8027990d44390bd5b3", "title": "Cardinality estimation using normalizing flow"}, {"paperId": "91c7ebb46a31c6b062533715d7d49614ffcfe6e9", "title": "AutoSteer: Learned Query Optimization for Any SQL Database"}, {"paperId": "75d7e643f1e1f071213a712fe407a73336d23465", "title": "Cardinality estimation of activity trajectory similarity queries using deep learning"}, {"paperId": "6baf29b7c66a866fe62456f312e8ad267ad08e99", "title": "Join Size Bounds using Lp-Norms on Degree Sequences"}, {"paperId": "ac08fa76038762f89a0f6c39ea38655422926408", "title": "Towards Building Autonomous Data Services on Azure"}, {"paperId": "81b9ebe4c6785351eafd0fc21d24851ce25f01ed", "title": "Efficient and Effective Cardinality Estimation for Skyline Family"}, {"paperId": "1c16af1a48b86c01bd4dea7ee873131fafefb6df", "title": "Kepler: Robust Learning for Parametric Query Optimization"}, {"paperId": "883ea41a62f0fdd8aeaf61656734bc319cdca4da", "title": "DotHash: Estimating Set Similarity Metrics for Link Prediction and Document Deduplication"}, {"paperId": "6c4939564ba3d47fd4e54ff6084128f21ddb8037", "title": "AutoCE: An Accurate and Efficient Model Advisor for Learned Cardinality Estimation"}, {"paperId": "23527b5012be0630f01a678b25f61119cd258810", "title": "Scardina: Scalable Join Cardinality Estimation by Multiple Density Estimators"}, {"paperId": "ab46b919ed09cf213467463541170c6ab7845087", "title": "Robust Query Driven Cardinality Estimation under Changing Workloads"}, {"paperId": "e89ab345ac30b6020dddc37fa5c5da5b4f590087", "title": "SafeBound: A Practical System for Generating Cardinality Bounds"}, {"paperId": "65567e231282623f2948489fa11ff1b304dd855b", "title": "Integrating Machine Learning Model Ensembles to the SAVIME Database System"}, {"paperId": "af0f3465dcd52f369873312cbc09e144c0891ea6", "title": "Serving Deep Learning Models from Relational Databases"}, {"paperId": "ad539d5e6e3ef7e6498b28e1937118e1856093d5", "title": "Batch Query Memory Prediction Using Deep Query Template Representations"}, {"paperId": "c88871a9fb4b3b363cea53007b09c0f73d2b47b6", "title": "Join Size Bounds using ℓ 𝑝 -Norms on Degree Sequences"}]}
