{"paperId": "a6ff42900f660427bb7c96cd2afff7ccd1d8e1e7", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "The DSA Transparency Database: Auditing Self-reported Moderation Actions by Social Media", "abstract": "Since September 2023, the Digital Services Act (DSA) obliges large online platforms to submit detailed data on each moderation action they take within the European Union (EU) to the DSA Transparency Database. From its inception, this centralized database has sparked scholarly interest as an unprecedented and potentially unique trove of data on real-world online moderation. Here, we thoroughly analyze all 353.12M records submitted by the eight largest social media platforms in the EU during the first 100 days of the database. Specifically, we conduct a platform-wise comparative study of their: volume of moderation actions, grounds for decision, types of applied restrictions, types of moderated content, timeliness in undertaking and submitting moderation actions, and use of automation. Furthermore, we systematically cross-check the contents of the database with the platforms' own transparency reports. Our analyses reveal that (i) the platforms adhered only in part to the philosophy and structure of the database, (ii) the structure of the database is partially inadequate for the platforms' reporting needs, (iii) the platforms exhibited substantial differences in their moderation actions, (iv) a remarkable fraction of the database data is inconsistent, (v) the platform X (formerly Twitter) presents the most inconsistencies. Our findings have far-reaching implications for policymakers and scholars across diverse disciplines. They offer guidance for future regulations that cater to the reporting needs of online platforms in general, but also highlight opportunities to improve and refine the database itself.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-16", "journal": {"name": "ArXiv", "volume": "abs/2312.10269"}, "authors": [{"authorId": "13159202", "name": "Amaury Trujillo"}, {"authorId": "2811629", "name": "T. Fagni"}, {"authorId": "40598011", "name": "S. Cresci"}], "citations": [{"paperId": "a53b0d670426f8cf59dacf576cb103670daf6a6d", "title": "Automated Transparency: A Legal and Empirical Analysis of the Digital Services Act Transparency Database"}, {"paperId": "6013c83c2a06602ae3fda25009519890a549f712", "title": "The Great Ban: Efficacy and Unintended Consequences of a Massive Deplatforming Operation on Reddit"}]}
