{"paperId": "a700762a9a53c0022212e412e188bcdf1d413ba3", "publicationVenue": {"id": "0aed7a40-85f3-4c66-9e1b-c1556c57001b", "name": "PLoS ONE", "type": "journal", "alternate_names": ["Plo ONE", "PLOS ONE", "PLO ONE"], "issn": "1932-6203", "url": "https://journals.plos.org/plosone/", "alternate_urls": ["http://www.plosone.org/"]}, "title": "The utility of clusters and a Hungarian clustering algorithm", "abstract": "Implicit in the k–means algorithm is a way to assign a value, or utility, to a cluster of points. It works by taking the centroid of the points and the value of the cluster is the sum of distances from the centroid to each point in the cluster. The aim in this paper is to introduce an alternative way to assign a value to a cluster. Motivation is provided. Moreover, whereas the k–means algorithm does not have a natural way to determine k if it is unknown, we can use our method of evaluating a cluster to find good clusters in a sequential manner. The idea uses optimizations over permutations and clusters are set by the cyclic groups; generated by the Hungarian algorithm.", "venue": "PLoS ONE", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-08-04", "journal": {"name": "PLoS ONE", "volume": "16"}, "authors": [{"authorId": "2887387", "name": "A. Kume"}, {"authorId": "2822745", "name": "S. Walker"}], "citations": [{"paperId": "c2f7c0f15f1ff4c8a963addcb8fdf0867e3d17c0", "title": "PGGait: Gait Recognition Based on Millimeter-Wave Radar Spatio-Temporal Sensing of Multidimensional Point Clouds"}, {"paperId": "fca78a946e9de22ea7d82371344cb3a4da076a15", "title": "Optimization of Digital Management Path for Human Resource Performance Evaluation Based on Multiobjective Decision-Making Mathematical Model"}, {"paperId": "0f2c349d07f5284afa52b43a88139b2e2996228b", "title": "Using K-Means Clustering in Python with Periodic Boundary Conditions"}, {"paperId": "5e1099e4618f9ad3dbf85cfb5ba9543a01c12dd0", "title": "Bulletin of Electrical Engineering and Informatics"}]}
