{"paperId": "a70aa584321d21f994a91e66c865f8cbe1db61a6", "publicationVenue": {"id": "54b6f627-d525-4e72-84fd-f44110472f71", "name": "Asia-Pacific Symposium on Internetware", "type": "conference", "alternate_names": ["APSI", "Asia-pacific Symp Internetware", "Internetware"]}, "title": "A Time Window based Reinforcement Learning Reward for Test Case Prioritization in Continuous Integration", "abstract": "Continuous integration refers to the practice of merging the working copies of all developers into the mainline frequently. Regression testing for each mergence is characterized by continually changing test suite, limited execution time, and fast feedback, which demands new test optimization techniques. Reinforcement learning is introduced for test case prioritization to save computing resources in continuous integration environment, where a reasonable reward function is highly important for learning strategy, since the process of reinforcement learning is a reward-guided behavior. In this paper, APHFW, a novel reward function is proposed by using partial historical information of test cases effectively for fast feedback and cost reduction. The experiments are based on three open-source data sets, and the results show that the proposed reward function is more cost-effect than other reinforcement learning rewards in continuous integration environment.", "venue": "Asia-Pacific Symposium on Internetware", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2019-10-28", "journal": {"name": "Proceedings of the 11th Asia-Pacific Symposium on Internetware"}, "authors": [{"authorId": "2109667775", "name": "Zhaolin Wu"}, {"authorId": "2152283242", "name": "Yang Yang"}, {"authorId": "93591357", "name": "Zheng Li"}, {"authorId": "2701910", "name": "Ruilian Zhao"}], "citations": [{"paperId": "862527514e2d4c4c907e10ab9fc6489309477cbb", "title": "A Self-attention Agent of Reinforcement Learning in Continuous Integration Testing"}, {"paperId": "3f06dcb2a0a153658dd894adfa8f1a2c5b598012", "title": "Systematic Literature Review on Application of Machine Learning in Continuous Integration"}, {"paperId": "47789ae4698b57aa0d7c7a9406d56fc198cbcf4b", "title": "State of Practical Applicability of Regression Testing Research: A Live Systematic Literature Review"}, {"paperId": "795dc16672cfa04729ce9bbc61c893d588e48dc7", "title": "TCP-Net: Test Case Prioritization using End-to-End Deep Neural Networks"}, {"paperId": "a7f1a09ae2fa90bda26374a1bc72a5d7bf4c77dc", "title": "A Taxonomy of Information Attributes for Test Case Prioritisation: Applicability, Machine Learning"}, {"paperId": "87cfa078bbb74de8b14e59120246b5d385aa3f96", "title": "Sparse reward for reinforcement learning‐based continuous integration testing"}, {"paperId": "c635a498f3dddb5d040f23772064b6c91af60398", "title": "Neural Network Embeddings for Test Case Prioritization"}, {"paperId": "58920d84d3cf404191f39c6b2abc47a159dc28ee", "title": "Reinforcement Learning for Test Case Prioritization"}, {"paperId": "7eb3af19caf37e77ae3197489de59eab415bba8f", "title": "A systematic study of reward for reinforcement learning based continuous integration testing"}, {"paperId": "3ecd4ccceb6175ff42024d11822241c64df923b4", "title": "Dynamic Time Window based Reward for Reinforcement Learning in Continuous Integration Testing"}, {"paperId": "ddb9e85a13fd930308559a3090ef4794b216b4bb", "title": "Neural Network Classification for Improving Continuous Regression Testing"}, {"paperId": "b1c453771873bedfa5f2f1442a0803dd2a54dc7f", "title": "Software Regression Testing in Industrial Settings: Preliminary Findings from a Literature Review"}, {"paperId": "78192fe077eaad20e6cf856de3e77f63b5766b4c", "title": "Adaptive Reward Computation in Reinforcement Learning-Based Continuous Integration Testing"}, {"paperId": "e1c9ec3ef33448c72f6f3a88e995a310c002481f", "title": "Trend Application of Machine Learning in Test Case Prioritization: A Review on Techniques"}]}
