{"paperId": "a71121bdae024ff40530b04634594a5c439b8ede", "publicationVenue": {"id": "0d6aa4dc-612c-4eab-bf70-0920fd59bd3f", "name": "Cybernetics and Information Technologies", "type": "journal", "alternate_names": ["Cybern Inf Technol"], "issn": "1311-9702", "url": "http://www.cit.iit.bas.bg/", "alternate_urls": ["http://www.degruyter.com/view/j/cait", "http://www.degruyter.com/view/j/cait?format=INT&result=24&rskey=BGbzfE"]}, "title": "Integration Approaches for Heterogeneous Big Data: A Survey", "abstract": "\n Modern organizations are currently wrestling with strenuous challenges relating to the management of heterogeneous big data, which combines data from various sources and varies in type, format, and content. The heterogeneity of the data makes it difficult to analyze and integrate. This paper presents big data warehousing and federation as viable approaches for handling big data complexity. It discusses their respective advantages and disadvantages as strategies for integrating, managing, and analyzing heterogeneous big data. Data integration is crucial for organizations to manipulate organizational data. Organizations have to weigh the benefits and drawbacks of both data integration approaches to identify the one that responds to their organizational needs and objectives. This paper aw well presents an adequate analysis of these two data integration approaches and identifies challenges associated with the selection of either approach. Thorough understanding and awareness of the merits and demits of these two approaches are crucial for practitioners, researchers, and decision-makers to select the approach that enables them to handle complex data, boost their decision-making process, and best align with their needs and expectations.", "venue": "Cybernetics and Information Technologies", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2024-03-01", "journal": {"name": "Cybernetics and Information Technologies"}, "authors": [{"authorId": "1403808600", "name": "W. Alma’aitah"}, {"authorId": "2293208451", "name": "Addy Quraan"}, {"authorId": "2293208175", "name": "Fatima N. AL-Aswadi"}, {"authorId": "1901151", "name": "Rami Suleiman Alkhawaldeh"}, {"authorId": "2268000", "name": "M. Alazab"}, {"authorId": "1835089", "name": "A. Awajan"}], "citations": []}
