{"paperId": "a71213fd3c6bd8fddd2de71e625e6b332714f10c", "publicationVenue": {"id": "312ca99c-9149-490d-813e-c60d5e949f65", "name": "Concurrency and Computation", "type": "journal", "alternate_names": ["Concurr Comput Pract Exp", "Concurrency and Computation: Practice and Experience", "Concurr Comput"], "issn": "1532-0626", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/77004395?CRETRY=1&SRETRY=0", "alternate_urls": ["http://www3.interscience.wiley.com/cgi-bin/jtoc?ID=77004395", "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1532-0634"]}, "title": "Traffic prediction using MSSBiLS with self‐attention model", "abstract": "Due to gathering and examining a tremendous amount of traffic stream data, traffic blockage is the most important issue in the intelligent transportation framework. The main aim of this research work is “to find the appropriate deep learning time series models, to predict the future traffic of Denmark Aarhus city.” In this article, multivariate sequential stacked bidirectional LSTM with self‐attention model (MSSBiLS‐SA) is proposed to prevent the long term dependencies and also to reduce the error rate. Based on the traffic state, the high, medium, and low range of traffic is predicted to give the best route to the users, and visualization is performed with the help of the Android application. The proposed MSSBiLS‐SA attains higher accuracy 94.56% and 95.36%, sensitivity 88.74% and 92.5%, specificity 93.5% and 94.5%, precision 94.23% and 95.5%, F‐score 94.5% and 94.5%, and lower time complexity 10.19% and 12.43% shows better performance when compared with the existing methods, such as prediction and classification of traffic location analysis using optimized graph convolutional recurrent neural network and prediction and classification of traffic location analysis based multilayer perceptron network using long short term memory. Finally, the proposed method predicts and classifies the traffic location very accurately.", "venue": "Concurrency and Computation", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-03-22", "journal": {"name": "Concurrency and Computation: Practice and Experience", "volume": "34"}, "authors": [{"authorId": "2159751140", "name": "Suvitha D"}, {"authorId": "2134587582", "name": "V. M"}], "citations": []}
