{"paperId": "a71a28ab43daa81e248ea379e3079456b8458416", "publicationVenue": {"id": "228761ec-c40a-479b-8309-9dcbe9851bcd", "name": "IEEE Internet of Things Journal", "type": "journal", "alternate_names": ["IEEE Internet Thing J"], "issn": "2327-4662", "url": "https://www.ieee.org/membership-catalog/productdetail/showProductDetailPage.html?product=PER288-ELE", "alternate_urls": ["https://ieeexplore.ieee.org/servlet/opac?punumber=6488907", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6488907", "http://ieee-iotj.org/#"]}, "title": "Securing Operating Systems Through Fine-Grained Kernel Access Limitation for IoT Systems", "abstract": "With the development of Internet of Things (IoT), it is gaining a lot of attention. It is important to secure the embedded systems with low overhead. The Linux Seccomp is widely used by developers to secure the kernels by blocking the access of unused syscalls, which introduces less overhead. However, there are no systematic Seccomp configuration approaches for IoT applications without the help of developers. In addition, the existing Seccomp configuration approaches are coarse-grained, which cannot analyze and limit the syscall arguments. In this article, a novel static dependent syscall analysis approach for embedded applications is proposed, which can obtain all of the possible dependent syscalls and the corresponding arguments of the target applications. So, a fine-grained kernel access limitation can be performed for the IoT applications. To this end, the mappings between dynamic library APIs and syscalls according with their arguments are built, by analyzing the control flow graphs and the data dependency relationships of the dynamic libraries. To the best of our knowledge, this is the first work to generate the fine-grained Seccomp profile for embedded applications.", "venue": "IEEE Internet of Things Journal", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-03-15", "journal": {"name": "IEEE Internet of Things Journal", "pages": "5378-5392", "volume": "10"}, "authors": [{"authorId": "3431709", "name": "D. Zhan"}, {"authorId": "2116804819", "name": "Zhao Yu"}, {"authorId": "7933066", "name": "Xiangzhan Yu"}, {"authorId": "2120474949", "name": "Hongli Zhang"}, {"authorId": "2153503340", "name": "Lin Ye"}, {"authorId": "2109291872", "name": "Likun Liu"}], "citations": [{"paperId": "c69cf9892e8209620e64cb6276013df8fa748292", "title": "SysXCHG: Refining Privilege with Adaptive System Call Filters"}]}
