{"paperId": "a71b3ed5323e39925c86cbb52ff4a4a3ab0d7a4e", "publicationVenue": null, "title": "TiSEFE: Time Series Evolving Fuzzy Engine for Network Traffic Classification", "abstract": "Monitoring and analyzing network traffic are very crucial in discriminating the malicious attack. As the network traffic is becoming big, heterogeneous, and very fast, traffic analysis could be considered as big data analytic task. Recent research in big data analytic filed has produces several novel large-scale data processing systems. However, there is a need for a comprehensive data processing system to extract valuable insights from network traffic big data and learn the normal and attack network situations. This paper proposes a novel evolving fuzzy system to discriminate anomalies by inspecting the network traffic. After capturing traffic data, the system analyzes it to establish a model of normal network situation. The normal situation is a time series data of an ordered sequence of traffic information variable values at equally spaced time intervals. The performance has been analyzed by carrying out several experiments on real-world traffic dataset and under extreme difficult situation of high-speed networks. The results have proved the appropriateness of time series evolving fuzzy engine for network classification.", "venue": "Int. J. Commun. Networks Inf. Secur.", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-04-17", "journal": {"name": "Int. J. Commun. Networks Inf. Secur.", "volume": "10"}, "authors": [{"authorId": "2599636", "name": "Shubair A. Abdulla"}, {"authorId": "41131729", "name": "Amaal Saleh Al Hashimy"}], "citations": [{"paperId": "483bed07b51f1c4cf5aa900c7698ce297db0607e", "title": "A Comprehensive Survey on Knowledge-Defined Networking"}, {"paperId": "3b0021a1f929b94942c011aa7873794b8efb674c", "title": "Abordagem Fuzzy Valorada Intervalarmente para Classificação de Tráfego de Streaming de Vídeo"}, {"paperId": "73e2b0d8e821b41bc36f4b633da450ef7551f0a6", "title": "Towards Interval-Valued Fuzzy Approach to Video Streaming Traffic Classification"}, {"paperId": "c7b2a314720e07f7108d662e72ecb9cd5d3f0dc4", "title": "Temporal anomaly detection on IIoT-enabled manufacturing"}, {"paperId": "f5b9562a1e578eaccd6a38d10986d97ad741bf51", "title": "An Artificial Deep Neural Network for the Binary Classification of Network Traffic"}]}
