{"paperId": "a72e8f72852a4fdff730c90388a224555df9ad4e", "publicationVenue": null, "title": "Design of Adaptive Training Control in Dispatcher Training Simulators", "abstract": "With the expansion of power systems and the development of smart grids, power system operations become increasingly complex and critical, calling for skilled and experienced dispatchers. The dispatcher training simulator (DTS) has been widely used as an effective training tool for decades, providing a realistic simulation of the dispatching environment. Efforts have been made to improve the simulation of DTS, while there is a research gap in improving the training module of DTS. Currently, DTS does not consider trainees’ learning states and preferences, and therefore cannot provide customized training services for different trainees, limiting its training effectiveness. Referring to learning analytics and adaptive learning systems, this paper investigates the training process control of DTS based on trainees’ learning states. A data-driven adaptive training control framework is proposed, including three stages: learning state monitoring, learning state assessment, and learning process control. The presented adaptive training control framework allows the DTS system to provide personalized and targeted training services to dispatcher trainees, promoting the intelligence and automation of the DTS system.", "venue": "2023 8th Asia Conference on Power and Electrical Engineering (ACPEE)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-04-01", "journal": {"name": "2023 8th Asia Conference on Power and Electrical Engineering (ACPEE)", "pages": "1885-1891"}, "authors": [{"authorId": "2052110629", "name": "Xinyi Lai"}, {"authorId": "2554158", "name": "Hongfu Chen"}, {"authorId": "2200274058", "name": "Ao Dong"}, {"authorId": "47533040", "name": "Changnian Lin"}, {"authorId": "2151509909", "name": "Wei Jin"}, {"authorId": "2143324828", "name": "Mengyu Ruan"}, {"authorId": "80452699", "name": "Nimrah Saeed"}, {"authorId": "2219057102", "name": "Zheng Han"}], "citations": []}
