{"paperId": "a7369e084d461c01498ec3b3c12dc9c298ed1343", "publicationVenue": {"id": "a36dc29e-4ea1-4567-b0fe-1c06daf8bee8", "name": "International Conference on Software Engineering", "type": "conference", "alternate_names": ["Int Conf Softw Eng", "ICSE"], "url": "http://www.icse-conferences.org/"}, "title": "Learning to Boost Disjunctive Static Bug-Finders", "abstract": "We present a new learning-based approach for accel-erating disjunctive static bug-finders. Industrial static bug-finders usually perform disjunctive analysis, differentiating program states along different execution paths of a program. Such path-sensitivity is essential for reducing false positives but it also increases analysis costs exponentially. Therefore, practical bug-finders use a state-selection heuristic to keep track of a small number of beneficial states only. However, designing a good heuristic for real-world programs is challenging; as a result, modern static bug-finders still suffer from low cost/bug-finding efficiency. In this paper, we aim to address this problem by learning effective state-selection heuristics from data. To this end, we present a novel data-driven technique that efficiently collects alarm-triggering traces, learns multiple candidate models, and adaptively chooses the best model tailored for each target program. We evaluate our approach with Infer and show that our technique significantly improves Infer's bug-finding efficiency for a range of open-source C programs.", "venue": "International Conference on Software Engineering", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-05-01", "journal": {"name": "2023 IEEE/ACM 45th International Conference on Software Engineering (ICSE)", "pages": "1097-1109"}, "authors": [{"authorId": "2186231", "name": "Yoonseok Ko"}, {"authorId": "39476651", "name": "Hakjoo Oh"}], "citations": [{"paperId": "0885556b71b24a641b4ffe139afd4d2712228cff", "title": "Beware of the Unexpected: Bimodal Taint Analysis"}]}
