{"paperId": "a749af20bd0f2271eab3f7f6fd96373e638d174e", "publicationVenue": {"id": "b827eced-82ea-44e6-b6d3-e8dfd4d8f000", "name": "Bulletin of Electrical Engineering and Informatics", "type": "journal", "alternate_names": ["Bull Electr Eng Informatics"], "issn": "2089-3191", "alternate_issns": ["2302-9285"], "url": "https://web.archive.org/web/20180818122233/http:/portalgaruda.org/portalgaruda/journals/index.php/EEI/issue/archive", "alternate_urls": ["http://beei.org/index.php/EEI"]}, "title": "An overview of big data analysis", "abstract": "Big data represents one of the most profound and most pervasive evolutions in the digital world. Examples of big data come from Internet of Things (IoT) devices, as well as smart cars, but also the use of social networks, industries, and so on. The sources of data are numerous and continuously increasing, and, therefore, what characterizes big data is not only the volume but also the complexity due to the heterogeneity of information that can be obtained. The fastest growth in spending on big data technologies is happening within banking, healthcare, insurance, securities and investment services, and telecommunications. Remarkably, three of those industries lie within the financial sector, which has many particularly serviceable use cases for big data analytics, such as fraud detection, risk management, and customer service optimization. In fact, the definition of big data analysis refers to the process that encompasses the gathering and analysis of big data to obtain useful information for the business. This paper focuses on delivering a short review concerning the current technologies, future perspectives, and the evaluation of some use cased associated with the analysis of big data.", "venue": "Bulletin of Electrical Engineering and Informatics", "year": 2020, "fieldsOfStudy": ["Business"], "publicationTypes": ["Review"], "publicationDate": "2020-08-01", "journal": {"name": "Bulletin of Electrical Engineering and Informatics"}, "authors": [{"authorId": "153660505", "name": "Fabio Arena"}, {"authorId": "1702366", "name": "G. Pau"}], "citations": [{"paperId": "4640b4f6a1350cd4604acf93b4731592f01b16ec", "title": "Using big data for optimizing advertising campaigns in social networks"}, {"paperId": "5c5f2ea87d565873b858c166f7c24b40b7c53f2f", "title": "ODTT: Optimized Dynamic Taxonomy Tree with Differential Privacy"}, {"paperId": "bd793880472e140ca4eefdbfdbca918d0d7af2d5", "title": "Application of SHAP on CatBoost classification for identification of variabels characterizing food insecurity occurrences in Aceh Province households"}, {"paperId": "3a3bc416a4b21912f2a2ae02a9b9cc3ba450f9e7", "title": "Linking the Intrinsic Electrical Response of Ferroelectric Devices to Material Properties by Means of Impedance Spectroscopy"}, {"paperId": "ef59d38a6218f1ff9db2ed1a32a398562e7ae2fe", "title": "FedWNS: Data Distribution-Wise Node Selection in Federated Learning via Reinforcement Learning"}, {"paperId": "d066e77d4e19e371f4e5c6880c924618039b417a", "title": "The Role of Defects and Interface Degradation on Ferroelectric HZO Capacitors Aging"}, {"paperId": "ed6486c8d9d65926fb68a9367aca5f02baad2daa", "title": "Fraud Analytics: A Decade of Research - Organizing Challenges and Solutions in the Field"}, {"paperId": "f6e21cdbd34ff8c1c7bfa460adb85a6d22bed796", "title": "Big Data Analysis Application in News Service Mode Based on Genetic Algorithm"}, {"paperId": "71471028eb98e0a14745694e81158c249504232c", "title": "Financial Data Analysis and Application Based on Big Data Mining Technology"}, {"paperId": "3b976e6fbb519e914f391f57ef371849a6383f7b", "title": "V’s of BIG DATA and DATA ANALYTICS"}, {"paperId": "97269cb99fbcfa64c8ff4b739f0d32140522e7bc", "title": "Business-making supported via the application of big data to achieve economic sustainability"}, {"paperId": "d100aaa4e4a482936986a8ec89ab031195d84710", "title": "High-Efficiency Multihomed Multimedia Transmission in Wireless Sensors"}, {"paperId": "90a03f138f8cece47b28934b8b421ea6fb764739", "title": "A Novel Power-Efficient Data Aggregation Scheme for Cloud-Based Sensor Networks"}, {"paperId": "8bf33c434ecc7ed2a3ad75466e9725ff62818b47", "title": "Information Reliability Assessment and Filtering for Decision Making. Case Study of Lithuanian and China Students' Life Goals Survey Data"}, {"paperId": "d9fe7fe1a7f6b9b509086bfa3ddbb95cbae2c910", "title": "Detection roasting level of Lintong coffee beans by using euclidean distance"}, {"paperId": "0c1a10365de440547c7ec9566a6608546a380ec5", "title": "Transforming data-centric eXtensible markup language into relational databases using hybrid approach"}, {"paperId": "d7f7b51f62a36905574339c03010fa0ad0be594b", "title": "The security of RC4 algorithm using keys generation depending on user's retina"}, {"paperId": "1d1d690edc0225ff7ca21bc381f42a0cea5ac055", "title": "WiMesh: leveraging mesh networking for disaster communication in resource-constrained settings"}, {"paperId": "b96e827329332a2672b5518fa72c7dd2d108ca4d", "title": "Artificial Intelligence Evolution in Smart Buildings for Energy Efficiency"}, {"paperId": "91cd2decab39db4b7099c9ac5d6f4ba24dd10f79", "title": "An IoE and Big Multimedia Data Approach for Urban Transport System Resilience Management in Smart Cities"}, {"paperId": "1f431b8d62e0bf4326a65c925dd11d5f23486474", "title": "Indonesian Journal of Electrical Engineering and Computer Science"}, {"paperId": "9a96973f9c2fc4a23e6aece90ea670f3dcf7ab5f", "title": "Indonesian Journal of Electrical Engineering and Computer Science"}, {"paperId": "15d77eeffd976c558665ec4c88cdb444b66af2b7", "title": "BIG DATA ANALYSIS"}, {"paperId": "1fac45198bc03bcec684f37e10a13e4c05a67ff9", "title": "Indonesian Journal of Electrical Engineering and Computer Science"}, {"paperId": "2a172551e32e8b9c07222b45210f37577dc84c98", "title": "Analysis of electromagnetic pollution by means of geographic information system"}]}
