{"paperId": "a74a6fcab584490a2590962833fe933b1a4512c2", "publicationVenue": {"id": "011e0c39-7f47-401e-98d2-ee08fdf206a3", "name": "Library hi tech", "type": "journal", "alternate_names": ["Libr Hi Tech", "Library Hi Tech", "Libr hi tech"], "issn": "0737-8831", "url": "https://www.emerald.com/insight/publication/issn/0737-8831"}, "title": "Mobile visual search model for Dunhuang murals in the smart library", "abstract": "PurposeThe purpose of this paper is to build a mobile visual search service system for the protection of Dunhuang cultural heritage in the smart library. A novel mobile visual search model for Dunhuang murals is proposed to help users acquire rich knowledge and services conveniently.Design/methodology/approachFirst, local and global features of images are extracted, and the visual dictionary is generated by the k-means clustering. Second, the mobile visual search model based on the bag-of-words (BOW) and multiple semantic associations is constructed. Third, the mobile visual search service system of the smart library is designed in the cloud environment. Furthermore, Dunhuang mural images are collected to verify this model.FindingsThe findings reveal that the BOW_SIFT_HSV_MSA model has better search performance for Dunhuang mural images when the scale-invariant feature transform (SIFT) and the hue, saturation and value (HSV) are used to extract local and global features of the images. Compared with different methods, this model is the most effective way to search images with the semantic association in the topic, time and space dimensions.Research limitations/implicationsDunhuang mural image set is a part of the vast resources stored in the smart library, and the fine-grained semantic labels could be applied to meet diverse search needs.Originality/valueThe mobile visual search service system is constructed to provide users with Dunhuang cultural services in the smart library. A novel mobile visual search model based on BOW and multiple semantic associations is proposed. This study can also provide references for the protection and utilization of other cultural heritages.", "venue": "Library hi tech", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-01-26", "journal": {"name": "Libr. Hi Tech", "pages": "1796-1818", "volume": "40"}, "authors": [{"authorId": "31156287", "name": "Ziming Zeng"}, {"authorId": "2142947693", "name": "Shouqiang Sun"}, {"authorId": "2118550272", "name": "Tingting Li"}, {"authorId": "2111612900", "name": "Jie Yin"}, {"authorId": "2152571606", "name": "Yueyan Shen"}], "citations": [{"paperId": "c1d96efbf3b786bb2920ec9f029756eb46c9d3ed", "title": "Application of cultural elements of dunhuang murals in landscape design based on mean shift algorithm extraction"}, {"paperId": "e5c4840be124ab27af9d351a09d0b76bf3961d3e", "title": "Editorial: Special selection on current bibliometrics and reviews"}, {"paperId": "41c4d436f497ea6493e0b38ee35ce0f439156832", "title": "Multimedia information retrieval using content-based image retrieval and context link for Chinese cultural artifacts"}, {"paperId": "a58d4c60914ad99046e15abdf27227159062260a", "title": "From traditional to emerging technologies in supporting smart libraries. A bibliometric and thematic approach from 2013 to 2022"}, {"paperId": "b182b130a4717d777abea1e854d71843319971cf", "title": "Library book recommendation with CNN-FM deep learning approach"}, {"paperId": "b8b7ade565287a6ab340b56e4eefa209303d2a9a", "title": "Editorial: 40th anniversary: contemporary library research"}, {"paperId": "554e82d115b37a8735f5c94910c729c7afce2035", "title": "Construction of a Smart Library Subject Precise Service Platform Based on User Needs"}, {"paperId": "acc1f69b96e7c86c6168ce34219e21691cf286c9", "title": "A Survey on Artificial Intelligence Aided Internet-of-Things Technologies in Emerging Smart Libraries"}]}
