{"paperId": "a74cb9186eee3bddd1f0bb7f526c0e3cb625669c", "publicationVenue": {"id": "159aed30-148b-4b50-99a4-372b0af958d9", "name": "International Symposium on Computers and Communications", "type": "conference", "alternate_names": ["ISCC", "Int Symp Comput Commun"], "url": "https://ieeexplore.ieee.org/xpl/conhome/1000156/all-proceedings"}, "title": "Efficient spark-based framework for big geospatial data query processing and analysis", "abstract": "The exponential amount of geospatial data that has been accumulated in an accelerated pace has inevitably motivated the scientific community to examine novel parallel technologies for tuning the performance of spatial queries. Managing spatial data for an optimized query performance is particularly a challenging task. This is due to the growing complexity of geometric computations involved in querying spatial data, where traditional systems failed to beneficially expand. However, the use of large-scale and parallel-based computing infrastructures based on cost-effective commodity clusters and cloud computing environments introduces new management challenges to avoid bottlenecks such as overloading scarce computing resources, which may be caused by an unbalanced loading of parallel tasks. In this paper, we aim to fill those gaps by introducing a generic framework for optimizing the performance of big spatial data queries on top of Apache Spark. Our framework also supports advanced management functions including a unique self-adaptable load-balancing service to self-tune framework execution. Our experimental evaluation shows that our framework is scalable and efficient for querying massive amounts of real spatial datasets.", "venue": "International Symposium on Computers and Communications", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2017-07-01", "journal": {"name": "2017 IEEE Symposium on Computers and Communications (ISCC)", "pages": "851-856"}, "authors": [{"authorId": "24363286", "name": "I. M. Aljawarneh"}, {"authorId": "1740127", "name": "P. Bellavista"}, {"authorId": "144765161", "name": "Antonio Corradi"}, {"authorId": "1713456", "name": "R. Montanari"}, {"authorId": "1748978", "name": "L. Foschini"}, {"authorId": "2076698663", "name": "Andrea Zanotti"}], "citations": [{"paperId": "6cfe3f77f08f1e7679e00085a67b29413d99f0c2", "title": "Efficient Geospatial Analytics on Time Series Big Data"}, {"paperId": "4100e67536b89244b8c85355c32ac65b75760b0f", "title": "Efficient Group K Nearest-Neighbor Spatial Query Processing in Apache Spark"}, {"paperId": "bb65087238adf9cbb0eb024b0cfcf88293f546f3", "title": "Efficiently Integrating Mobility and Environment Data for Climate Change Analytics"}, {"paperId": "6a6c2d991aed70a5f2fe342b41a6fe198cef5a66", "title": "QoS-Aware Approximate Query Processing for Smart Cities Spatial Data Streams"}, {"paperId": "86422321884438547fd2510577aadee7b058c501", "title": "Efficient QoS-Aware Spatial Join Processing for Scalable NoSQL Storage Frameworks"}, {"paperId": "08c05f86b4528144c1d90f49ef16149fe88562e7", "title": "Locality-Preserving Spatial Partitioning for Geo Big Data Analytics in Main Memory Frameworks"}, {"paperId": "034b54797b740c4bc8f986d8c7fb7b6dc2ebfb89", "title": "Spatially Representative Online Big Data Sampling for Smart Cities"}, {"paperId": "fd3259ecd1c94731f5d9bd9c0bf7417f2e147c71", "title": "Big Spatial Data Management for the Internet of Things: A Survey"}, {"paperId": "587405035803de40a3479b81c8cd29cc485e346a", "title": "Indexing of real time geospatial data by IoT enabled devices: Opportunities, challenges and design considerations"}, {"paperId": "db98690cb9a709d68a3683f3ebc6004f891a1c9c", "title": "Clustering of Spatial Data with DBSCAN: An Assessment of STARK"}, {"paperId": "8d60c1bb5fbf3d56a6b5168d3fe1f0c967a7f04d", "title": "Finding Frequent Routes From Taxi Trips With Time Windows: NYC Case"}, {"paperId": "fde5b7a709f705d3e279029ce0961bcbdbfe0c47", "title": "A Streaming Cloud Platform for Real-Time Video Processing on Embedded Devices"}, {"paperId": "01aaf3de33928df8866b88476cb9d5fa1fc86b5f", "title": "Spark Load Balancing Strategy Optimization Based on Internet of Things"}, {"paperId": "ed616b7f34e547900a71683ce7602d87f86ddef3", "title": "Clustering Big Data Based on Distributed Fuzzy K-Medoids: An Application to Geospatial Informatics"}, {"paperId": "7f9cbd80ba99afe92d05da82ae90a1933851b901", "title": "Load-balanced Range Query Workload Partitioning for Compressed Spatial Hierarchical Bitmap (cSHB) Indexes"}]}
