{"paperId": "a74c3f420504195176daa3f30165493643cb1a8c", "publicationVenue": {"id": "8e1bd4b5-d5b2-4e22-ba0a-01fe5568d472", "name": "Remote Sensing", "type": "journal", "alternate_names": ["Remote Sens"], "issn": "2315-4675", "alternate_issns": ["2072-4292"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169233", "alternate_urls": ["https://www.mdpi.com/journal/remotesensing", "http://www.mdpi.com/journal/remotesensing", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169233"]}, "title": "Deep Learning and Machine Learning Models for Landslide Susceptibility Mapping with Remote Sensing Data", "abstract": "Karakoram Highway (KKH) is an international route connecting South Asia with Central Asia and China that holds socio-economic and strategic significance. However, KKH has extreme geological conditions that make it prone and vulnerable to natural disasters, primarily landslides, posing a threat to its routine activities. In this context, the study provides an updated inventory of landslides in the area with precisely measured slope deformation (Vslope), utilizing the SBAS-InSAR (small baseline subset interferometric synthetic aperture radar) and PS-InSAR (persistent scatterer interferometric synthetic aperture radar) technology. By processing Sentinel-1 data from June 2021 to June 2023, utilizing the InSAR technique, a total of 571 landslides were identified and classified based on government reports and field investigations. A total of 24 new prospective landslides were identified, and some existing landslides were redefined. This updated landslide inventory was then utilized to create a landslide susceptibility model, which investigated the link between landslide occurrences and the causal variables. Deep learning (DL) and machine learning (ML) models, including convolutional neural networks (CNN 2D), recurrent neural networks (RNNs), random forest (RF), and extreme gradient boosting (XGBoost), are employed. The inventory was split into 70% for training and 30% for testing the models, and fifteen landslide causative factors were used for the susceptibility mapping. To compare the accuracy of the models, the area under the curve (AUC) of the receiver operating characteristic (ROC) was used. The CNN 2D technique demonstrated superior performance in creating the landslide susceptibility map (LSM) for KKH. The enhanced LSM provides a prospective modeling approach for hazard prevention and serves as a conceptual reference for routine management of the KKH for risk assessment and mitigation.", "venue": "Remote Sensing", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-26", "journal": {"name": "Remote. Sens.", "pages": "4703", "volume": "15"}, "authors": [{"authorId": "2069563913", "name": "M. A. Hussain"}, {"authorId": "2910556", "name": "Zhanlong Chen"}, {"authorId": "2163280419", "name": "Ying Zheng"}, {"authorId": "2248012169", "name": "Yulong Zhou"}, {"authorId": "2248316571", "name": "Hamza Daud"}], "citations": [{"paperId": "b72f4f29290adff48fa85610e3417d20c3df8b74", "title": "Integrating Machine Learning Ensembles for Landslide Susceptibility Mapping in Northern Pakistan"}, {"paperId": "5e83474cb6b3c52319d80f348cc56e828443cac9", "title": "Advancements in mapping landslide susceptibility in bafoussam and its surroundings area using multi-criteria decision analysis, statistical methods, and machine learning models"}]}
