{"paperId": "a7527f531fe4e6b6e40b3519f5c03ea2775fddb9", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Deep Neural Network-Based Prediction and Early Warning of Student Grades and Recommendations for Similar Learning Approaches", "abstract": "Studies reported that if teachers can accurately predict students’ follow-up learning effects via data mining and other means, as per their current performances, and explore the difficulty level of students’ mastery of future-related courses in advance, it will help improve students’ scores in future exams. Although educational data mining and learning analytics have experienced an increase in exploration and use, they are still difficult to precisely define. The usage of deep learning methods to predict academic performances and recommend optimal learning methods has not received considerable attention from researchers. This study aims to predict unknown course grades based on students’ previous learning situations and use clustering algorithms to identify similar learning situations, thereby improving students’ academic performance. In this study, the methods of linear regression, random forest, back-propagation neural network, and deep neural network are compared; the prediction and early warning of students’ academic performances based on deep neural network are proposed, in addition to the improved K-nearest neighbor clustering based on association rules (Pearson correlation coefficient). The algorithm performs a similar category clustering for early-warning students. Using the mean square error, standard deviation, mean absolute percentage error, and prediction of ups-and-downs accuracy as evaluation indicators, the proposed method achieves a steady improvement of 20% in the prediction of ups-and-downs accuracy, and demonstrates improved prediction results when compared under similar conditions.", "venue": "Applied Sciences", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-08-01", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "2116714298", "name": "Tao Tao"}, {"authorId": "2152166852", "name": "Chen Sun"}, {"authorId": "2109666777", "name": "Zhaoyang Wu"}, {"authorId": "2279867846", "name": "Jian Yang"}, {"authorId": "2152442534", "name": "J. Wang"}], "citations": [{"paperId": "c39633990c2dc48814e8316a4b6f0e3780c437b8", "title": "Predicting Student Performance in Online Learning: A Multidimensional Time-Series Data Analysis Approach"}, {"paperId": "c6d87c55122926c42f163608c6e500ad8f0f593e", "title": "Comparing Different Oversampling Methods in Predicting Multi-Class Educational Datasets Using Machine Learning Techniques"}, {"paperId": "588ff0e950454f5dd463d0aeefbb27de95a905a2", "title": "Analysis of educational data enabled by deep learning to increase student success"}, {"paperId": "e90f97c782052eebd4e86ee3bcbde1e8749f8385", "title": "Clustering of LMS Use Strategies with Autoencoders"}, {"paperId": "6e5416b006fbc8d7d9e7e56e59f1d28e72ddc84f", "title": "E-Learning Behavior Categories and Influencing Factors of STEM Courses: A Case Study of the Open University Learning Analysis Dataset (OULAD)"}]}
