{"paperId": "a75517aa968ba019abd11da8f0b9bb4fb2fabb83", "publicationVenue": null, "title": "Pioneering easy-to-use forestry data with Forest Explorer", "abstract": "Forest Explorer is a web tool that can be used to easily browse the contents of the Cross-Forest dataset, a Linked Open Data resource containing the forestry inventory and land cover map from Spain. The tool is purposed for domain experts and lay users to facilitate the exploration of forestry data. Since these two groups are not knowledgable on Semantic Web, the user interface is designed to hide the complexity of RDF, OWL or SPARQL. An interactive map is provided for this purpose, allowing users to navigate to the area of interest and presenting forestry data with different levels of detail according to the zoom level. Forest Explorer offers different filter controls and is localized to English and Spanish. All the data is retrieved from the Cross-Forest and DBpedia endpoints through the Data manager. This component feeds the different Feature managers with the data needed to be displayed in the map. The Data manager uses a reduced set of SPARQL templates to accommodate any data request of the Feature managers. Caching and smart geographic querying are employed to limit data exchanges with the endpoint. A live version of the tool is freely available for everybody that wants to try it – any device with a modern browser should be sufficient to test it. Since December 2019, more than 3,200 users have employed Forest Explorer and it has appeared 12 times in the Spanish media. Results from a user study with 28 participants (mainly domain experts) show that Forest Explorer can be used to easily navigate the contents of the Cross-Forest dataset. No important limitations were found, only feature requests such as the integration of new datasets from other countries that are part of our future work.", "venue": "Semantic Web", "year": 2021, "fieldsOfStudy": ["Computer Science", "Engineering"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-04-12", "journal": {"name": "Semantic Web", "pages": "147-162", "volume": "13"}, "authors": [{"authorId": "1401967715", "name": "Guillermo Vega-Gorgojo"}, {"authorId": "1404601303", "name": "José M. Giménez-García"}, {"authorId": "153301475", "name": "C. Ordóñez"}, {"authorId": "145371812", "name": "F. Bravo"}], "citations": [{"paperId": "7181a00dcd422ed3e9bbfc0d4030a691c2eed3f8", "title": "Cyberinfrastructure for sourcing and processing ecological data"}, {"paperId": "c84ca744ed05e89d6e9d2a5f881310fb3f04492d", "title": "Explorando datos abiertos forestales masivos con un navegador web"}, {"paperId": "f93c34835e7a766fc57c7068b44b789508b240b6", "title": "Optimized forest carbon sequestration&Better homeland"}, {"paperId": "c7ab4e938ca8009bc7f744be1aaaa5b939b9f712", "title": "Casual Learn: A linked data-based mobile application for learning about local Cultural Heritage"}, {"paperId": "48fb0ad30cb62da627e08c54697c2e566a3adb31", "title": "CRAFTS: Configurable REST APIs For Triple Stores"}, {"paperId": "1e398875de6db367733f2e28129e07ce3c694314", "title": "Casual Learn: A Semantic Mobile Application for Learning Local Cultural Heritage"}, {"paperId": "5ccba59b874e7c0e7494e11fa2b2e4e4a8ad7f6d", "title": "Educawood: A Socio-semantic Annotation System for Environmental Education"}]}
