{"paperId": "a75e4e1efeaacbbd6ce004634c3e16e1a0a00072", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Cross-layer based intermittent jamming schemes for securing energy-constraint networks", "abstract": "The Internet-of-Things (IoT) emerges as a paradigm to achieve ubiquitous connectivity via wireless communications between kinds of physical objects. Due to the wireless broadcasting nature and the energy constraint of physical objects, concerns on IoT security have triggered research on cooperative jamming based physical layer security. With the help of a cooperative jammer, existing solutions can effectively fight against eavesdroppers. However, these schemes are of high energy cost due to continuously transmitting jamming signals. To reduce the energy consumption, we propose a new idea of intermittent jamming and design five specific intermittent jamming schemes (IJSs). By taking the transmit frame formate into account, we optimize these IJSs from three aspects, including the jamming power, the jamming method, and the jamming positions. Then we analyze the applicability of the proposed IJSs according to different requirements on the synchronization, the available jamming energy and the jamming power constraints. Extensive MATLAB experiments are conducted on the basis of the WLAN Toolbox, which demonstrate the proposed IJSs can effectively degrade the reception of the eavesdropper and outperform the widespread continuous jamming scheme (CJS) when the available jamming energy is limited.", "venue": "arXiv.org", "year": 2021, "fieldsOfStudy": ["Computer Science", "Mathematics"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-03-24", "journal": {"name": "ArXiv", "volume": "abs/2103.13217"}, "authors": [{"authorId": "153657300", "name": "Qinghe Gao"}, {"authorId": "144201982", "name": "Yan Huo"}, {"authorId": "144045069", "name": "Tao Jing"}, {"authorId": "39135122", "name": "Liran Ma"}, {"authorId": "3391996", "name": "Jinlong Qian"}], "citations": []}
