{"paperId": "a76ed5d156a704cc6759a1528ba2e1940524b2b0", "publicationVenue": {"id": "06e7be4c-302d-4fd4-944e-a0a79fa0c69c", "name": "International Journal of Web Services Research", "type": "journal", "alternate_names": ["Int J Web Serv Res"], "issn": "1545-7362", "url": "http://www.idea-group.com/journals", "alternate_urls": ["http://www.idea-group.com/journals/details.asp?id=4138", "https://www.igi-global.com/gateway/journal/1079", "https://www.igi-global.com/journal/international-journal-web-services-research/1079"]}, "title": "Rider Chaotic Biography Optimization-driven Deep Stacked Auto-encoder for Big Data Classification Using Spark Architecture: Rider Chaotic Biography Optimization", "abstract": "The novelty in big data is rising day-by-day in such a way that the existing software tools face difficulty in supervision of big data. Furthermore, the rate of the imbalanced data in the huge datasets is a key constraint to the research industry. Thus, this paper proposes a novel technique for handling the big data using Spark framework. The proposed technique undergoes two steps for classifying the big data, which involves feature selection and classification, which is performed in the initial nodes of Spark architecture. The proposed optimization algorithm is named rider chaotic biography optimization (RCBO) algorithm, which is the integration of the rider optimization algorithm (ROA) and the standard chaotic biogeography-based optimisation (CBBO). The proposed RCBO deep-stacked auto-encoder using Spark framework effectively handles the big data for attaining effective big data classification. Here, the proposed RCBO is employed for selecting suitable features from the massive dataset.", "venue": "International Journal of Web Services Research", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "Int. J. Web Serv. Res.", "pages": "42-62", "volume": "18"}, "authors": [{"authorId": "73685652", "name": "A. Brahmane"}, {"authorId": "2064577227", "name": "C. Krishna"}], "citations": [{"paperId": "34438b93ae51a50c7ee7cf6758797f8591272cde", "title": "Enhancing Video Anomaly Detection Using Spatio-Temporal Autoencoders and Convolutional LSTM Networks"}, {"paperId": "7245c7fefe1a6af9c74650582c2fa84f87148bef", "title": "A classification and extraction method of attribute hybrid big data based on Naive Bayes algorithm"}, {"paperId": "6a63f0cd03e5b0f04af92e937da12e158442db45", "title": "Image analysis and pattern recognition method of three-dimensional process in physical education teaching based on big data"}, {"paperId": "afbb65c684d6cdbd0735d5ca43f0b05c2dd461d8", "title": "Computational intelligence based sustainable computing with classification model for big data visualization on map reduce environment"}, {"paperId": "8b737c31f397c288cde0bde1f04882bc73c1ea99", "title": "Research on the Application of Random Forest-based Feature Selection Algorithm in Data Mining Experiments"}, {"paperId": "b55e7045fde96b3af5dfce58e5f59960fce4187f", "title": "Magnetic Force Classifier: A Novel Method for Big Data Classification"}]}
