{"paperId": "a781d76988ec8756d73d988a3ca059529b88bc26", "publicationVenue": null, "title": "Design and Implementation of Wastewater Pollutant Data Analysis and Visualization System for Vessels", "abstract": "To monitor the discharge of water pollutants from vessels, a monitoring system for the discharge of water pollutants from vessels has been established on the Yangtze River. The system generates tens of thousands of ship wastewater pollutant data every day. The analysis and visualization of wastewater pollutant discharge data can help the monitoring department to grasp the discharge situation and improve the accuracy of supervision. This system extracts the data to the data warehouse in real-time based on the data extraction technology, improves the query efficiency based on the three-level storage architecture, makes real-time pollutant data statistics based on the stream computing technology, and realizes the visual display of the data based on the front-end and back end-separation technology. The system has been applied in the maritime supervision department to provide a data basis for vessel wastewater pollutant supervision and decision-making.", "venue": "Journal of Physics: Conference Series", "year": 2022, "fieldsOfStudy": ["Physics"], "publicationTypes": ["Conference"], "publicationDate": "2022-12-01", "journal": {"name": "Journal of Physics: Conference Series", "volume": "2400"}, "authors": [{"authorId": "66786559", "name": "Taizhi Lv"}, {"authorId": "1750957", "name": "P. Tang"}, {"authorId": "2191047839", "name": "Yujuan Zou"}], "citations": [{"paperId": "e883fded5162e9acbe0ab75273fbaf10831d0d1f", "title": "Research on real-time processing of vessel transportation risk based on stream computing"}, {"paperId": "b169f5c9fbc6146fc9f67b2790b5f13af97b7dd1", "title": "Research on educational big data analysis based on Hive and Spark"}, {"paperId": "c256a9c385a15141071c6c95a4e9cec63387e068", "title": "Research on ship data analysis based on Spark platform"}]}
