{"paperId": "a78f6bfd1776645e35d7338038e0caf082454971", "publicationVenue": {"id": "0eedef98-be10-4507-88ab-1d0a9dd75d1d", "name": "International Journal For Multidisciplinary Research", "type": "journal", "alternate_names": ["Int j multidiscip res", "Int J Multidiscip Res", "International journal of multidisciplinary research"], "issn": "2582-2160", "alternate_issns": ["1934-6840"], "url": "http://www.virginiaresearchinstitute.com/"}, "title": "Blockchain Integration in Artificial Intelligence: Benefits, Applications, Research Challenges", "abstract": "Now-a-days block chain and artificial intelligence are the two emerging technologies. Both strategies bring change to the market, but the level of creativity and complexity varies. Block chain is a decentralized and distributed ledger technology which is used for storing information in multiple locations without any centralized monitoring system. Artificial intelligence imitates the problem-solving capability of human mind and decision making abilities by using computers, data, and sometimes machines. When both technologies are merged, their formed new opportunities and possibilities from the advantages of both, like productivity gain and the security and transparency. The convergence of AI with blockchain technology can bring a wide change in businesses by securing data , transparent data, and making it overall efficient. One of the most useful concepts of the two technologies is in cybersecurity. The technologies, which combine the capabilities of AI with the block chain's dependable, scattered nature, may be utilized to enable management of recourses and decision making in areas such as education, impact on society, healthcare, agricultural production, urban planning, and others. Artificial intelligence (AI) is capable of helping detect and react to risks, whereas the integrity and security of information may be ensured using blockchain technology. A comprehensive survey of various applications of blockchain for AI has been completed. Evaluated various literature based on the technologies, and the new blockchain-based applications, mediums, and technological advances that target the AI sector were collected and summarized. In addition, Open research issues concerning the use of blockchain technology for AI are addressed.", "venue": "International Journal For Multidisciplinary Research", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-12-19", "journal": {"name": "International Journal For Multidisciplinary Research"}, "authors": [{"authorId": "2275691148", "name": "Amrutha Bk"}, {"authorId": "2275687351", "name": "B.GOMATHY"}], "citations": []}
