{"paperId": "a7b0807d1506048ba000889b121b3402eec0c29d", "publicationVenue": {"id": "a0edb93b-1e95-4128-a295-6b1659149cef", "name": "Knowledge Discovery and Data Mining", "type": "conference", "alternate_names": ["KDD", "Knowl Discov Data Min"], "url": "http://www.acm.org/sigkdd/"}, "title": "Lambda Learner: Fast Incremental Learning on Data Streams", "abstract": "One of the most well-established applications of machine learning is in deciding what content to show website visitors. When observation data comes from high-velocity, user-generated data streams, machine learning methods perform a balancing act between model complexity, training time, and computational costs. Furthermore, when model freshness is critical, the training of models becomes time-constrained. Parallelized batch offline training, although horizontally scalable, is often not time-considerate or cost-effective. In this paper, we propose Lambda Learner, a new framework for training models by incremental updates in response to mini-batches from data streams. We show that the resulting model of our framework closely estimates a periodically updated model trained on offline data and outperforms it when model updates are time-sensitive. We provide theoretical proof that the incremental learning updates improve the loss-function over a stale batch model. We present a large-scale deployment on the sponsored content platform for a large social network, serving hundreds of millions of users across different channels (e.g., desktop, mobile). We address challenges and complexities from both algorithms and infrastructure perspectives, illustrate the system details for computation, storage, stream processing training data, and open-source the system.", "venue": "Knowledge Discovery and Data Mining", "year": 2020, "fieldsOfStudy": ["Computer Science", "Mathematics"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2020-10-11", "journal": {"name": "Proceedings of the 27th ACM SIGKDD Conference on Knowledge Discovery & Data Mining"}, "authors": [{"authorId": "2051517", "name": "R. Ramanath"}, {"authorId": "2163660", "name": "Konstantin Salomatin"}, {"authorId": "1994074974", "name": "Jeffrey Gee"}, {"authorId": "1994180605", "name": "Kirill Talanine"}, {"authorId": "1980160", "name": "Onkar Dalal"}, {"authorId": "2767134", "name": "Gungor Polatkan"}, {"authorId": "97812530", "name": "S. Smoot"}, {"authorId": "2116414526", "name": "Deepak Kumar"}], "citations": [{"paperId": "bee34a65dbc28621c779e4fa6201414e318a8798", "title": "The multi-task transfer learning for multiple data streams with uncertain data"}, {"paperId": "fd7b1cdb3b67ba47922ec513fdf4e5f466e006bd", "title": "iETA: A Robust and Scalable Incremental Learning Framework for Time-of-Arrival Estimation"}, {"paperId": "765ad480e2c6f08decce773c288709fcc7471594", "title": "Generalized Deep Mixed Models"}, {"paperId": "0ddf327c941ee2b6018024c524a0a35f02f4c783", "title": "On the Adaptation to Concept Drift for CTR Prediction"}, {"paperId": "bafaf1e9471911c9b77e400cddff129b11f6f3f4", "title": "A Framework for Fast Polarity Labelling of Massive Data Streams"}, {"paperId": "73b1ca258d3440e7690ddf0db756e4ea08061705", "title": "Incremental Learning for Personalized Recommender Systems"}, {"paperId": "a2103003dc87bf52a973730449a58bb47c055f2d", "title": "Toward News Authenticity: Synthesizing Natural Language Processing and Human Expert Opinion to Evaluate News"}]}
