{"paperId": "a7b0751fedd33caf15e3322c7b2e384a5f07a048", "publicationVenue": {"id": "2135230a-3b24-4b71-9583-60624389377a", "name": "IEEE Transactions on Industrial Informatics", "type": "journal", "alternate_names": ["IEEE Trans Ind Informatics"], "issn": "1551-3203", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=9424", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=9424"]}, "title": "ASXC$^{2}$ Approach: A Service-X Cost Optimization Strategy Based on Edge Orchestration for IIoT", "abstract": "Most computation-intensive industry applications and servers encounter service-reliability challenges due to the limited resource capability of the edge. Achieving quality data fusion and accurate service reliability with optimized service-x execution cost is challenging. While existing systems have taken into account factors such as device service execution, residual resource ratio, and channel condition; the service execution time, cost, and utility ratios of requested services from devices and servers also have a significant impact on service execution cost. To enhance service quality and reliability, we design a 2-step adaptive service-X cost consolidation (ASXC2) approach. This approach is based on the node-centric Lyapunov method and distributed Markov mechanism, aiming to optimize the service execution error rate during offloading. The node-centric Lyapunov method incorporates cost and utility functions and node-centric features to estimate the service cost before offloading. Additionally, the Markov mechanism-inspired service latency prediction model design assists in mitigating the ratio of offload-service execution errors by establishing a mobility-correlation matrix between devices and servers. In addition, the non-linear programming multi-tenancy heuristic method design help to predict the service preferences for improving the resource utilisation ratio. The simulations show the effectiveness of our approach. The model performance is enhanced with 0.13% service offloading efficiency, 0.82% rate of service completion when transmitting data size is 400 kb, and 0.058% average service offloading efficiency with 40 CPU Megacycles when the vehicle moves 60 Km/h speed around the server communication range. Our model simulations indicate that our approach is highly effective and suitable for lightweight, complex environments.", "venue": "IEEE Transactions on Industrial Informatics", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-03-01", "journal": {"name": "IEEE Transactions on Industrial Informatics", "pages": "4347-4359", "volume": "20"}, "authors": [{"authorId": "34998193", "name": "M. Mekala"}, {"authorId": "2256875709", "name": "Gaurav Dhiman"}, {"authorId": "102769878", "name": "Ju H. Park"}, {"authorId": "2240269675", "name": "Ho-Youl Jung"}, {"authorId": "2985029", "name": "W. Viriyasitavat"}], "citations": []}
