{"paperId": "a7c1a691b7d0172010d1c339ce4bbcecc4c4350b", "publicationVenue": null, "title": "A preliminary study for selecting the appropriate AI-based forecasting model for hospital assets demand under disasters", "abstract": "PurposeHospitals recently search for more accurate forecasting systems, given the unpredictable demand and the increasing occurrence of disruptive incidents (mass casualty incidents, pandemics and natural disasters). Besides, the incorporation of automatic inventory and replenishment systems – that hospitals are undertaking – requires developed and accurate forecasting systems. Researchers propose different artificial intelligence (AI)-based forecasting models to predict hospital assets consumption (AC) for everyday activity case and prove that AI-based models generally outperform many forecasting models in this framework. The purpose of this paper is to identify the appropriate AI-based forecasting model(s) for predicting hospital AC under disruptive incidents to improve hospitals' response to disasters/pandemics situations.Design/methodology/approachThe authors select the appropriate AI-based forecasting models according to the deduced criteria from hospitals' framework analysis under disruptive incidents. Artificial neural network (ANN), recurrent neural network (RNN), adaptive neuro-fuzzy inference system (ANFIS) and learning-FIS (FIS with learning algorithms) are generally compliant with the criteria among many AI-based forecasting methods. Therefore, the authors evaluate their accuracy to predict a university hospital AC under a burn mass casualty incident.FindingsThe ANFIS model is the most compliant with the extracted criteria (autonomous learning capability, fast response, real-time control and interpretability) and provides the best accuracy (the average accuracy is 98.46%) comparing to the other models.Originality/valueThis work contributes to developing accurate forecasting systems for hospitals under disruptive incidents to improve their response to disasters/pandemics situations.", "venue": "", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-05-27", "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "8672006", "name": "Sara Jebbor"}, {"authorId": "2121091624", "name": "Chiheb Raddouane"}, {"authorId": "9427498", "name": "Abdellatif El Afia"}], "citations": [{"paperId": "a779f5dd28c8aaab0e1bdceeb6700f17d655c0a4", "title": "The Role of AI in Hospitals and Clinics: Transforming Healthcare in the 21st Century"}, {"paperId": "a33bf4f63911a2a4942cc6a3b306fa9595289477", "title": "A multi-MLP prediction for inventory management in manufacturing execution system"}, {"paperId": "09d257061fa23478155a9ec54ba08bd7df2e26fd", "title": "Demand Forecasting in Retail for Diabetes Medicine"}, {"paperId": "be6e6d5478bd73f2e11bbce379d2ce44b4c03783", "title": "Guest editorial: The COVID-19 impact on humanitarian operations: lessons for future disrupting events"}]}
