{"paperId": "a7c4692ce76f8f38d97392c837f8f35443040cfe", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "QoS-Aware Joint Task Scheduling and Resource Allocation in Vehicular Edge Computing", "abstract": "Vehicular edge computing (VEC) has emerged in the Internet of Vehicles (IoV) as a new paradigm that offloads computation tasks to Road Side Units (RSU), aiming to thereby reduce the processing delay and resource consumption of vehicles. Ideal computation offloading policies for VEC are expected to achieve both low latency and low energy consumption. Although existing works have made great contributions, they rarely consider the coordination of multiple RSUs and the individual Quality of Service (QoS) requirements of different applications, resulting in suboptimal offloading policies. In this paper we present FEVEC, a Fast and Energy-efficient VEC framework, with the objective of realizing an optimal offloading strategy that minimizes both delay and energy consumption. FEVEC coordinates multiple RSUs and considers the application-specific QoS requirements. We formalize the computation offloading problem as a multi-objective optimization problem by jointly optimizing offloading decisions and resource allocation, which is a mixed-integer nonlinear programming (MINLP) problem and NP-hard. We propose MOV, a Multi-Objective computing offloading method for VEC. First, vehicle prejudgment is proposed to meet the requirements of different applications by considering the maximum tolerance delay related to the current vehicle speed. Second, an improved Non-dominated Sorting Genetic Algorithm-II (NSGA-II) is adopted to obtain the Pareto-optimal solutions with low complexity. Finally, the optimal offloading strategy is selected for QoS maximization. Extensive evaluation results based on real and simulated vehicle trajectories verify that the average QoS value of MOV is improved by 20% compared with the state-of-the-art VEC mechanism.", "venue": "Italian National Conference on Sensors", "year": 2022, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-11-30", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "22"}, "authors": [{"authorId": "2615440", "name": "Chenhong Cao"}, {"authorId": "2193666705", "name": "Meijia Su"}, {"authorId": "48885599", "name": "Shengyu Duan"}, {"authorId": "2193705712", "name": "Miaoling Dai"}, {"authorId": "2118506461", "name": "Jiangtao Li"}, {"authorId": "2154875364", "name": "Yufeng Li"}], "citations": [{"paperId": "f4dc7717aa057965ed765fd5017919ef9e0991a5", "title": "Emerging Technologies in Edge Computing and Networking"}, {"paperId": "7447397d5072a868933c1f4ad074292e6b1fc5c9", "title": "A novel traffic load balancing approach for scheduling of optical transparent antennas (OTAs) on mobile terminals"}, {"paperId": "b4938647c77043550b4b6a43b445a770ed0a329b", "title": "Joint Optimization of Multi-User Partial Offloading Strategy and Resource Allocation Strategy in D2D-Enabled MEC"}]}
