{"paperId": "a7c82fb0091aaa4dcf898c36caafcfa4e5b77c34", "publicationVenue": {"id": "849b6687-df71-4d12-9c46-59f45d5ce951", "name": "IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing", "type": "journal", "alternate_names": ["IEEE J Sel Top Appl Earth Obs Remote Sens"], "issn": "1939-1404", "url": "https://ieeexplore.ieee.org/servlet/opac?punumber=4609443", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4609443"]}, "title": "LCFSTE: Landslide Conditioning Factors and Swin Transformer Ensemble for Landslide Susceptibility Assessment", "abstract": "Landslide susceptibility assessment (LSA) holds crucial importance in guiding regional disaster prevention and reduction efforts. However, current deep learning (DL) models for LSA encounter challenges like insufficient landslide data samples and uneven distribution. In this article, we develop a new hybrid framework named landslide conditioning factors and swin transformer ensemble (LCFSTE), which integrates landslide conditioning factors (LCFs) and swin transformer (swin-T) for LSA. With this framework, we fully leverage the powerful nonlinear feature extraction capability of swin-T to extract abstract features from both landslides and LCFs. This approach ultimately enhances the precision and reliability of LSA. To assess the performance of our newly proposed framework, we selected Jiuzhaigou County, China, as our study area. First, a dataset for LSA was constructed using historical landslide data and 11 multisource LCFs. Then, these factors were screened through a multicollinearity test and factor importance analysis using variance inflation factor, tolerance, and information gain rate. Subsequently, the dataset was divided into three subsets: 60% for training, 20% for validation, and 20% for testing. Then, the LSA results were compared with four DL models. Seven evaluation metrics (EMs) are chosen to quantitatively evaluate the performance of these five LSA models. The results demonstrated that, among these seven EMs, LCFSTE outperformed the others, achieving the highest score in six out of the seven considered EMs. This outcome highlights the promising applicability of LCFSTE in enhancing LSA accuracy.", "venue": "IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing", "pages": "6444-6454", "volume": "17"}, "authors": [{"authorId": "2250180570", "name": "Tao Chen"}, {"authorId": "2216304391", "name": "Qingye Wang"}, {"authorId": "2260916504", "name": "Zeyang Zhao"}, {"authorId": "2279111829", "name": "Gang Liu"}, {"authorId": "2204069471", "name": "Jie Dou"}, {"authorId": "2278921745", "name": "Antonio Plaza"}], "citations": []}
