{"paperId": "a7d047dd9f41d5f3e7eaa39e5ba8c97cccc7276d", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Reformatted Alignment", "abstract": "The quality of finetuning data is crucial for aligning large language models (LLMs) with human values. Current methods to improve data quality are either labor-intensive or prone to factual errors caused by LLM hallucinations. This paper explores elevating the quality of existing instruction data to better align with human values, introducing a simple and effective approach named ReAlign, which reformats the responses of instruction data into a format that better aligns with pre-established criteria and the collated evidence. This approach minimizes human annotation, hallucination, and the difficulty in scaling, remaining orthogonal to existing alignment techniques. Experimentally, ReAlign significantly boosts the general alignment ability, math reasoning, factuality, and readability of the LLMs. Encouragingly, without introducing any additional data or advanced training techniques, and merely by reformatting the response, LLaMA-2-13B's mathematical reasoning ability on GSM8K can be improved from 46.77% to 56.63% in accuracy. Additionally, a mere 5% of ReAlign data yields a 67% boost in general alignment ability measured by the Alpaca dataset. This work highlights the need for further research into the science and mechanistic interpretability of LLMs. We have made the associated code and data publicly accessible to support future studies at https://github.com/GAIR-NLP/ReAlign.", "venue": "arXiv.org", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-02-19", "journal": {"name": "ArXiv", "volume": "abs/2402.12219"}, "authors": [{"authorId": "1657674644", "name": "Run-Ze Fan"}, {"authorId": "2284732801", "name": "Xuefeng Li"}, {"authorId": "2284719949", "name": "Haoyang Zou"}, {"authorId": "2278801242", "name": "Junlong Li"}, {"authorId": "2152235390", "name": "Shwai He"}, {"authorId": "2273658317", "name": "Ethan Chern"}, {"authorId": "2284687872", "name": "Jiewen Hu"}, {"authorId": "2256991660", "name": "Pengfei Liu"}], "citations": [{"paperId": "3c2130e219528df234658b94810de33fe7b077dc", "title": "Are Large Language Models Good at Utility Judgments?"}]}
