{"paperId": "a816a2cadf122232d9a8489e1859c6a8d288ac87", "publicationVenue": null, "title": "A gap-filling method for room temperature data based on autoencoder neural networks", "abstract": "This study explores the applicability of a deep learning-based approach for reconstructing missing room temperature data from diﬀerent domains where relatively few training samples are available. For that purpose, the existing convolutional, long short-term memory (LSTM) and feed-forward autoencoders were combined with a suitable domain adaptation procedure. Eventually, the developed models were evaluated on data collected in four buildings with signiﬁ-cant diﬀerences in thermal mass, design and location. The ﬁndings pointed out that the domain adaptation can be conducted eﬃciently by using a small data sample from the target domain. Additionally, the re-sults showed that the proposed model can reconstruct up to 80 % of the missing daily room temperature inputs with RMSE accuracy of 0.6 ° C.", "venue": "Building Simulation Conference Proceedings", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2021-09-01", "journal": {"name": "Building Simulation Conference Proceedings"}, "authors": [{"authorId": "32396697", "name": "A. Liguori"}, {"authorId": "145180044", "name": "Romana Markovic"}, {"authorId": "145242475", "name": "J. Frisch"}, {"authorId": "2160823986", "name": "Andreas Wagner"}, {"authorId": "92095081", "name": "F. Causone"}], "citations": [{"paperId": "b735e9f54b1bb118ce27a7cdf3d8917c2aa2491f", "title": "Gap imputation in related multivariate time series through recurrent neural network-based denoising autoencoder1"}, {"paperId": "5b35b69310aee0a0167743580a3c88941f2b1be7", "title": "Digital twin-enhanced predictive maintenance for indoor climate: A parallel LSTM-autoencoder failure prediction approach"}, {"paperId": "85c443d44faf880572cec09437a41c96c8037266", "title": "Opening the Black Box: Towards inherently interpretable energy data imputation models using building physics insight"}, {"paperId": "115b8b3260dcc40aa5e049d48c85a7de294e9c87", "title": "Augmenting energy time-series for data-efficient imputation of missing values"}]}
