{"paperId": "a81dd5c9913d077615f43cf9d27ad73f0109eac7", "publicationVenue": {"id": "43893b55-fde6-4e2b-9d2e-c15a669a1f94", "name": "ACM Symposium on Parallelism in Algorithms and Architectures", "type": "conference", "alternate_names": ["SPAA", "ACM Symposium on Parallel Algorithms and Architectures", "ACM Symp Parallelism Algorithm Archit", "ACM Symp Parallel Algorithm Archit"], "url": "http://www.spaa-conference.org/"}, "title": "Graph Sparsification for Derandomizing Massively Parallel Computation with Low Space", "abstract": "Massively Parallel Computation (MPC) is an emerging model which distills core aspects of distributed and parallel computation. It was developed as a tool to solve (typically graph) problems in systems where input is distributed over many machines with limited space. Recent work has focused on the regime in which machines have sublinear (in n, number of nodes in the input graph) space, with randomized algorithms presented for the fundamental problems of Maximal Matching and Maximal Independent Set. There are, however, no prior corresponding deterministic algorithms. A major challenge in the sublinear space setting is that the local space of each machine may be too small to store all the edges incident to a single node. To overcome this barrier we introduce a new graph sparsification technique that deterministically computes a low-degree subgraph with additional desired properties: degrees in the subgraph are sufficiently small that nodes' neighborhoods can be stored on single machines, and solving the problem on the subgraph provides significant global progress towards solving the problem for the original input graph. Using this framework to derandomize the well-known randomized algorithm of Luby [SICOMP'86], we obtain O(log Δ+log log n)$-round deterministic MPC algorithms for solving the fundamental problems of Maximal Matching and Maximal Independent Set with O(nε) space on each machine for any constant ε > 0. Based on the recent work of Ghaffari et al. [FOCS'18], this additive O(log log n) factor is conditionally essential. These algorithms can also be shown to run in O(log Δ) rounds in the closely related model of CONGESTED CLIQUE, improving upon the state-of-the-art bound of O(log2 Δ) rounds by Censor-Hillel et al. [DISC'17].", "venue": "ACM Symposium on Parallelism in Algorithms and Architectures", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2020-07-06", "journal": {"name": "Proceedings of the 32nd ACM Symposium on Parallelism in Algorithms and Architectures"}, "authors": [{"authorId": "2285913844", "name": "Artur Czumaj"}, {"authorId": "152609310", "name": "Peter Davies"}, {"authorId": "2649618", "name": "M. Parter"}], "citations": [{"paperId": "9f897b9dd5e7e2f825c1df7d79e1295b7120fa6a", "title": "Efficient Deterministic Distributed Coloring with Small Bandwidth"}]}
