{"paperId": "a8242fa1f6deab01cf1216958691556f1474d2d9", "publicationVenue": {"id": "1a837836-21f5-48ef-98ae-6b40c9b5afc9", "name": "Journal of Global Information Management", "type": "journal", "alternate_names": ["J Glob Inf Manag"], "issn": "1062-7375", "url": "http://www.idea-group.com/journals/details.asp?id=99", "alternate_urls": ["https://www.igi-global.com/journal/journal-global-information-management-jgim/1070", "http://www.metapress.com/"]}, "title": "Popularity Prediction for Consumers' Product Recommendation Articles", "abstract": "Consumer product recommendation articles posted in Social Shopping Community (SSC) have become an important source of purchase information for other potential consumers. However, less effort has been put into understanding and predicting the popularity of such a distinctive form of consumer-generated content. In this study, we built a rich and comprehensive dataset comprising author-related features, article-related features, and engagement behavior information collected from post.smzdm.com. We constructed machine learning models to predict article popularity, and used the SHapley Additive exPlanations (SHAP) approach to visualize and explain feature importance in the prediction. The results show that with all identified features, LGBMClassifier gives best results with most evaluation metrics, and that the author-related feature set has better predictive capability than the article-related one. To the best of our knowledge, ours is the first study to investigate the popularity of consumers’ product recommendation articles in SSCs.", "venue": "Journal of Global Information Management", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-09-01", "journal": {"name": "J. Glob. Inf. Manag.", "pages": "1-16", "volume": "30"}, "authors": [{"authorId": null, "name": "Tao Wang"}, {"authorId": "49405654", "name": "Dongmei Han"}, {"authorId": "2850937", "name": "Yonghui Dai"}], "citations": []}
