{"paperId": "a829ba13242c9884138548ee652417b4794a15f6", "publicationVenue": null, "title": "Enhancing Network Security in SDNIoT Environments Through CNN-Based Attack Detection", "abstract": "The rapid proliferation of Internet of Things (IoT) devices connected to the internet has given rise to an increase in IoT-based attacks, thereby necessitating the development of effective intrusion detection systems. This research addresses the challenges posed by the evolving threat landscape in Software Defined Network (SDN)-assisted IoT (SDNIoT) environments. Traditional intrusion detection solutions encounter difficulties in coping with the coexistence of conventional and IoT protocols in a centralized network architecture. To mitigate this issue, a novel approach is proposed, utilizing Convolutional Neural Networks (CNNs) for accurate attack detection within SDNIoT networks. The approach involves employing CNN architectures, which possess the capability to learn complex hierarchical patterns, for intrusion detection. The performance of the CNN model is extensively evaluated on two distinct SDNIoT-focused datasets, encompassing both binary and multiclass classification scenarios. Furthermore, a detailed analysis of the architectural components of the model is introduced, offering insights into the visualization of learned features. The proposed CNN-based framework demonstrates impressive capabilities in identifying and categorizing network attacks in SDNIoT networks. Proposing a novel approach employing Convolutional Neural Networks (CNNs) for precise attack detection, the model is evaluated on two SDNIoT datasets. Results showcase the CNN's remarkable capabilities, achieving an accuracy of 99.75% and 99.80% on “NetworkFlow_X” and “NetAttack_Y” datasets, respectively. This research contributes to the field by harnessing advanced deep learning techniques to enhance network security, thereby addressing the challenges posed by IoT-based threats within the SDN framework.", "venue": "2023 International Conference on Self Sustainable Artificial Intelligence Systems (ICSSAS)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-10-18", "journal": {"name": "2023 International Conference on Self Sustainable Artificial Intelligence Systems (ICSSAS)", "pages": "1388-1394"}, "authors": [{"authorId": "2270002555", "name": "Virushabadoss. S"}, {"authorId": "2213604515", "name": "Anithaashri T. P"}], "citations": []}
