{"paperId": "a83d23f88c3c0fd8b76a3b469554d09597b4db04", "publicationVenue": null, "title": "Fossel: Efficient Latency Reduction in Approximating Streaming Sensor Data", "abstract": "The volume of streaming sensor data from various environmental sensors continues to increase rapidly due to wider deployments of IoT devices at much greater scales than ever before. This, in turn, causes massive increase in the fog, cloud network traffic which leads to heavily delayed network operations. In streaming data analytics, the ability to obtain real time data insight is crucial for computational sustainability for many IoT enabled applications such as environmental monitors, pollution and climate surveillance, traffic control or even E-commerce applications. However, such network delays prevent us from achieving high quality real-time data analytics of environmental information. In order to address this challenge, we propose the Fog Sampling Node Selector (Fossel) technique that can significantly reduce the IoT network and processing delays by algorithmically selecting an optimal subset of fog nodes to perform the sensor data sampling. In addition, our technique performs a simple type of query executions within the fog nodes in order to further reduce the network delays by processing the data near the data producing devices. Our extensive evaluations show that Fossel technique outperforms the state-of-the-art in terms of latency reduction as well as in bandwidth consumption, network usage and energy consumption.", "venue": "", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2020-12-05", "journal": {"name": "Sustainability", "pages": "10175", "volume": "12"}, "authors": [{"authorId": "2083374671", "name": "Fatima Abdullah"}, {"authorId": "40572483", "name": "Limei Peng"}, {"authorId": "144543382", "name": "Byungchul Tak"}], "citations": [{"paperId": "e826268209f603e176688ea91e2200ad0252c19b", "title": "Query Latency Optimization by Resource-Aware Task Placement in Fog"}, {"paperId": "abc8279c30e8e82ae48d377344f6a7df15c9c362", "title": "Towards Query Latency Optimization in the Fog"}, {"paperId": "7ca28f9045a5cbfe98cd945a5958a50af1556f76", "title": "A Survey of IoT Stream Query Execution Latency Optimization within Edge and Cloud"}]}
