{"paperId": "a83fae3174a2b9513a84af92d093c5cf24a2b015", "publicationVenue": {"id": "9181819e-530e-4408-9917-93c5f58d7fce", "name": "International Congress on Information and Communication Technology", "type": "conference", "alternate_names": ["Int Conf Inf Comput Technol", "International Conference on Inventive Computation Technologies", "ICICT", "Int Congr Inf Commun Technol", "Int Conf Inven Comput Technol", "International Conference on Issues and Challenges in Intelligent Computing Techniques", "International Conference on Information and Computer Technologies", "Int Conf Issue Chall Intell Comput Tech"]}, "title": "A Consistent Deep Neural Network to Diagnose Heart Disease", "abstract": "Modern life is permeated by machine learning's effects and the health care industry is no exception. It is possible to identify cardiac disease with the help of a decision support system that is based on machine learning by analyzing a patient's clinical data. This research study explores different machine learning methods and apply them to solve the challenges in cardiac disease detection, with particular attention to coronary artery disease. While developing a model, feature selection is crucial since reducing the total number of features helps keep the system simple and efficient. To tackle this problem, three hybrid feature selection algorithms—GARFE (genetic algorithm recursive feature elimination), CFGA (correlation feature selection genetic algorithm), and HPCBE (hybrid Pearson correlation with backward elimination)—have been proposed, and empirical evidence suggests that they outperform more traditional feature selection approaches. This research study has developed a consistent deep neural network model for cardiac disease detection and achieves 95.31% accuracy by using the Cleveland dataset. Lastly, a graphical user interface is developed to make the system more approachable, aiding medical practitioners in the screening and detection of cardiac diseases.", "venue": "International Congress on Information and Communication Technology", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-04-26", "journal": {"name": "2023 International Conference on Inventive Computation Technologies (ICICT)", "pages": "370-375"}, "authors": [{"authorId": "2286724695", "name": "M.Vijay"}, {"authorId": "2286482984", "name": "Sekhar Babu"}, {"authorId": "2286590056", "name": "Shafiqul Islam"}, {"authorId": "2055129249", "name": "Anuradha Jha"}, {"authorId": "2163055891", "name": "Sonali Gupta"}, {"authorId": "1380876436", "name": "Mukesh Soni"}, {"authorId": "2110636487", "name": "P. Singh"}], "citations": []}
