{"paperId": "a84cda77e9329d64526620b6ef9e869ec120c7f6", "publicationVenue": null, "title": "A Smart Healthcare Monitoring System Based on Fog Computing Architecture", "abstract": "Access to adequate medical care can be difficult in many countries, particularly in economically developing countries. There aren't enough medical professionals, such as doctors or nurses, and the nearest hospitals are too far away. Because there is such a severe shortage of resources, it is extremely challenging to provide preventative therapy to persons who are ill. As a direct consequence of this, even persons in good health are falling more behind in their surveillance of their fitness. It is crucial to have a plan in place to address this problem in order to guarantee that persons will not experience a disruption in their capacity to get necessary medical care in the event that this problem arises. Applications of the Internet of Things include ensuring public safety and improving operational efficiencies in transportation, municipal management, manufacturing, and physical activity (IoT). This study investigates its application in medical equipment and suggests an innovative approach to combining the ideas of fog computing and the Internet of Things. A poor health care system that focuses on clinics can be converted into a high-quality system that puts patients at the center with the help of the framework that has been proposed.", "venue": "2022 2nd International Conference on Technological Advancements in Computational Sciences (ICTACS)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-10-10", "journal": {"name": "2022 2nd International Conference on Technological Advancements in Computational Sciences (ICTACS)", "pages": "904-909"}, "authors": [{"authorId": "2190705089", "name": "Ajay Reddy Yeruva"}, {"authorId": "2198497730", "name": "C. S. L Vijaya Durga"}, {"authorId": "2198498620", "name": "Gokulavasan B"}, {"authorId": "37394540", "name": "Kumud Pant"}, {"authorId": "9415856", "name": "Prateek Chaturvedi"}, {"authorId": "92210280", "name": "A. Srivastava"}], "citations": [{"paperId": "91482c08d99cb466035a762e139215969339f2b3", "title": "Lung Cancer Diagnosis Using Artificial Neural Network with Different Optimizers"}, {"paperId": "971861a966ce7266e5caa90521f21378f0e1ed2e", "title": "Crop Yield Prediction Through Artificial Neural Networks"}, {"paperId": "a374d356544064176b0e4abdddbc28a4ff235db4", "title": "Systematic Cognitive Computing Framework Application Using Medical Information Processing"}, {"paperId": "fdba1fa98ed1cc09bdfe7c9a3a69665203f25a1d", "title": "Artificial Intelligence-Based Control Strategies for Unmanned Aerial Vehicles"}, {"paperId": "9c06f8be95c066f03110981758f57f9da4c0f277", "title": "Convolutional Neural Network Application for Detection & Classification of Brain Tumour"}, {"paperId": "9ee63c6a6be18fa8a87fdcde6f763cc823668dfe", "title": "Detection of Emotion Employing Deep Learning Modelling Approach"}, {"paperId": "3c639ec81e5d3bd61d2d6fe06acd38f3debecad0", "title": "Prediction of Concrete Strength with Artificial Neural Networks Enhanced by Nano-Silica"}, {"paperId": "7495b1c39d7edce48dc787482fc080590558f723", "title": "Geographical Visitor Locator"}, {"paperId": "f15117124be6a6a7ae31736fbb659f950b4dde4f", "title": "Object Detection in Images and Videos Using OpenCV: A Comparative Study of Deep Learning and Traditional Computer Vision Techniques"}, {"paperId": "b5c65242439cb77d497c90cef4abd6f54ec3fec7", "title": "Enhancing Network Security Algorithm Using Machine Learning"}, {"paperId": "f0a195df57e44ff6b941db282f355af95c1381d1", "title": "Stock Market Prediction using different Machine Learning Algorithms"}, {"paperId": "fa4a45d3f5462b341ec9252978567477100b3158", "title": "Weather Forecasting using Machine Learning"}, {"paperId": "6664374ae37fd178c9c07a74d69caef95c35064c", "title": "Reinforcement Learning for Multi-Robot Coordination and Cooperation in Manufacturing"}, {"paperId": "01e5ade8c147314000d905f16f21e4c47fc3e712", "title": "Artificial Intelligence Based Examination of the Field of Ophthalmology"}, {"paperId": "20e5c31cf088e53ca7ab63a1efc24e9640c5e6e8", "title": "Machine Learning Based Cardiovascular Detection Approach"}, {"paperId": "24b796f091decb7b7a6536157d166735a1e9fdd4", "title": "Remote Sensing: A Comprehensive Overview of Principles and Applications"}, {"paperId": "66133885fc160b490747c927c0f247513e6e0a5d", "title": "Development of multi-objective cognitive radio network with energy harvesting for medical data transmission"}, {"paperId": "a4eac6393455be79c11704108102eb221c36f426", "title": "The Future of Medicine: Harnessing the Power of AI for Revolutionizing Healthcare"}, {"paperId": "22bbf5170e5e0fb722d20e2582f8ef55379a4d70", "title": "Authentication of fog‐assisted IoT networks using Advanced Encryption credibility approach with modified Diffie–Hellman encryption"}, {"paperId": "a3e8fc7ea741842746472a26bc08c8b00d16008b", "title": "Impact of knowledge management, innovation and cloud computing on research"}, {"paperId": "a4dd1feea8b0b17a858b8f7671c5a9c5a0da5494", "title": "Table of Content"}]}
