{"paperId": "a862d582fbe6d7e7c3cd5163b2fdf2daead6cefd", "publicationVenue": {"id": "f2c78b1b-6bcc-4700-859b-af9401c02941", "name": "Buildings", "type": "journal", "issn": "0007-3725", "alternate_issns": ["2075-5309"], "url": "https://www.buildings.com/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217973", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217973", "https://www.mdpi.com/journal/buildings"]}, "title": "An Effective Fault Detection Method for HVAC Systems Using the LSTM-SVDD Algorithm", "abstract": "Fault detection in heating, ventilation and air-conditioning (HVAC) systems can effectively prevent equipment damage and system energy loss, and enhance the stability and reliability of system operation. However, existing fault detection strategies have not realized high effectiveness, mainly due to the time-delay characteristics of HVAC system faults and the lack of system-fault operation data. Therefore, aiming at the time delay of system faults and the lack of actual system-fault operation data, this paper proposes a fault detection method that combines a system simulation model and an intelligent detection algorithm. The method first uses the Modelica modeling language to build a scalable simulation model of the system to obtain fault data that are not easily accessible in practice. The long short-term memory-support vector data description (LSTM-SVDD) algorithm is then applied to detect faults in real time by dynamically adjusting the fault residuals according to the absolute difference between the predicted and actual values. The experimental results show that the LSTM-SVDD method improves the average detection accuracy by 9.675% and 9.85% over the classical LSTM network and the extreme gradient boosting (XGBoost) method, respectively, under different fault levels.", "venue": "Buildings", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-02-20", "journal": {"name": "Buildings"}, "authors": [{"authorId": "2115717960", "name": "Hui Zhu"}, {"authorId": "2144018211", "name": "Wen Yang"}, {"authorId": "2155911595", "name": "Shihong Li"}, {"authorId": "39544719", "name": "Aiping Pang"}], "citations": [{"paperId": "5afc1c668b801e96349e9152a51a98f28d701b0f", "title": "AI in HVAC fault detection and diagnosis: A systematic review"}, {"paperId": "73bda256d991273a3ccbe8ef82375725ee3d4322", "title": "Development of Virtual Sensor Based on LSTM-Autoencoder to Detect Faults in Supply Chilled Water Temperature Sensor"}, {"paperId": "cf967932df79bebfb4e103581f0567300a304699", "title": "Attention-empowered transfer learning method for HVAC sensor fault diagnosis in dynamic building environments"}, {"paperId": "b9c003376f68c42f639f0642a37d936017eaf429", "title": "Fault Diagnosis Based on Fusion of Residuals and Data for Chillers"}, {"paperId": "a6460bb8ca95f595a12135c73427970596c59d68", "title": "Digital Twin for Fault Detection and Diagnosis of Building Operations: A Systematic Review"}, {"paperId": "3b19e3ca1aa2236d36b763473bf790fa1ae6089e", "title": "Deep Learning-Driven Automated Fault Detection and Diagnostics Based on a Contextual Environment: A Case Study of HVAC System"}, {"paperId": "35aa144f11fcff61511c5e38f016d68494e2247f", "title": "A Review of Data-Driven Approaches and Techniques for Fault Detection and Diagnosis in HVAC Systems"}, {"paperId": "020b64bf2e6d9f0b56476058bcaa552b8ad569ea", "title": "Fault Detection and Diagnosis for Liquid Rocket Engines Based on Long Short-Term Memory and Generative Adversarial Networks"}, {"paperId": "8706f475ec0a70c6c333766b90ffc968719a692c", "title": "New Optimal Supply Air Temperature and Minimum Zone Air Flow Resetting Strategies for VAV Systems"}]}
