{"paperId": "a8639a6b719cf1cf6b1ab35714ab9b118031e121", "publicationVenue": null, "title": "Towards Supporting Security and Privacy for Social IoT Applications: A Network Virtualization Perspective", "abstract": "Network function virtualization (NFV) is a new way to provide services to users in a network. Different from dedicated hardware that realizes the network functions for an IoT application, the network function of an NFV network is executed on general servers, and in order to achieve complete network functions, service function chaining (SFC) chains virtual network functions to work together to support an IoT application. In this paper, we focus on a main challenge in this domain, i.e., resource efficient provisioning for social IoT application oriented SFC requests. We propose an online SFC deployment algorithm based on the layered strategies of physical networks and an evaluation of physical network nodes, which can efficiently reduce bandwidth resource consumption (OSFCD-LSEM) and support the security and privacy of social IoT applications. The results of our simulation show that our proposed algorithm improves the bandwidth carrying rate, time efficiency, and acceptance rate by 50%, 60%, and 15%, respectively.", "venue": "Secur. Commun. Networks", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-03-14", "journal": {"name": "Secur. Commun. Networks", "pages": "4074272:1-4074272:15", "volume": "2019"}, "authors": [{"authorId": null, "name": "Jian Sun"}, {"authorId": "2115500989", "name": "Guanhua Huang"}, {"authorId": "3097765", "name": "A. K. Sangaiah"}, {"authorId": "40963909", "name": "Guangyang Zhu"}, {"authorId": "144335971", "name": "Xiaojiang Du"}], "citations": [{"paperId": "d52d6d7dc25fe84bcbc5509ca2a2926939da8b60", "title": "Emerging IoT domains, current standings and open research challenges: a review"}, {"paperId": "ccd8c74bb22410911d8e907e90840e04a1ad171b", "title": "Setting Privacy \"by Default\" in Social IoT: Theorizing the Challenges and Directions in Big Data Research"}, {"paperId": "34813538d043e71f4f9522f79e27b6bca1dd0003", "title": "Big Data Research"}]}
