{"paperId": "a873933b2a7eeb38b64402131a1033556547ec6e", "publicationVenue": null, "title": "Uma comparação entre MapReduce e Tez para segmentação de imagens em ambientes de computação em nuvem", "abstract": "Driven mainly by the modern advances in the Earth Observation technology in the last years, the increase of the remote sensing data volume represents a new challenge. The current available image processing solutions fail to deliver the expected performance and scalability required to deal with this large volume of data. Aiming to face this problem, the authors proposed, in a recent work, a distributed strategy for region growing segmentation of arbitrarily large images. The presented strategy is able to perform in cloud-computing environments and most of the distributed architectures. The original implementation is based on the MapReduce model, which offers a highly scalable and reliable framework for storing and processing massive data in cloud computing environments. However, MapReduce is losing popularity lately and it is being slowly replaced by different engines that have been emerged. Since the distributed image segmentation is a method independent from its implementation, this paper aim to compare the original implementation using MapReduce to a new implementation using a different distributed framework. In this work, the new implementation is based on Apache Tez. Tez enhances the MapReduce paradigm by improving its speed while maintaining MapReduce's ability to scale to petabytes of data. The experiments carried out on a virtual cluster in a commercial cloudcomputing infrastructure demonstrated that both implementations present a potential scalable and efficient solution, with Tez achieving a better performance. Palavras-chave: remote sensing, image segmentation, distributed processing, cloud computing, sensoriamento remoto, segmentação de imagens, processamento distribuído, computação em nuvem. 1. Introdução A análise de dados de sensoriamento é de extrema importância para os pesquisadores em diversas áreas de aplicação, como agricultura, resposta a desastres, planejamento urbano e operações de mineração, entre outras. Os avanços recentes nas tecnologias de observação da Terra, bem como o aumento do número de sistemas aéreos e orbitais em atividade têm fornecido uma maior quantidade de insumo para este fim. Exemplos ilustrativos são o Sentinel-1 da ESA que produz em torno de 1,5 GB por dia (Grabak, 2014) e o projeto EOSDIS da NASA gera cerca de 16 TB por dia (NASA Earthdata, 2015). Adicionalmente, a redução considerável dos custos de aquisição de imagens junto a empresas privadas e o crescimento de conjuntos de dados de livre acesso difundidos nos últimos anos também contribuíram para o acesso a um volume maior de dados. Este cenário é pródigo em informações estratégicas que podem ser usadas pelos respectivos tomadores de decisão. Lidar com estes grandes volumes de dados, no entanto, representa um desafio principalmente quando estas informações devem ser obtidas em um curto prazo. De fato, este cenário revela grandes desafios para a comunidade de sensoriamento remoto relacionados principalmente à capacidade de processamento desse grande volume de dados (Lee et al., 2015). Há, portanto, uma demanda por ferramentas automáticas para interpretação de imagens altamente escaláveis. Neste sentido, a computação distribuída é uma alternativa comumente adotada quando se faz necessário o processamento de grandes conjuntos de dados. De forma mais específica, a computação em nuvem é uma tendência, pois pode fornecer uma infraestrutura escalável para suportar diferentes necessidades de processamento (Fernández et al., 2014). Além disso, a existência de diferentes provedores de infraestrutura de computação em nuvem que oferecem um modelo de pay-per-use proporciona grande poder de computação aos usuários ao mesmo tempo em que os livra de preocupações com a aquisição ou manutenção de um hardware complexo. Em um recente trabalho (Happ et al., 2016) foram apresentadas estratégias para segmentação por crescimento de regiões utilizando computação em nuvem. Estas soluções possibilitam o processamento distribuído de imagens muito grandes em um cluster físico ou virtual. As estratégias são baseadas na divisão da imagem em tiles e utilizam um mecanismo de indexação específico junto a um método de costura hierárquica para suprimir os artefatos que podem ser gerados ao longo das bordas. Experimentos conduzidos em uma implementação baseada no paradigma de programação distribuída MapReduce (Dean e Ghemawa, 2008) demonstraram um elevado potencial de escalabilidade. As estratégias mencionadas são independentes do modelo de programação adotado. Ao mesmo tempo, alternativas ao MapReduce em código aberto vêm sendo propostas, em particular o Apache Tez (Saha et al., 2015) tem atraído muita atenção recentemente. Trata-se de uma plataforma de código aberto para construção de processos dirigidos por fluxos de dados. O objetivo deste trabalho é comparar a eficiência computacional do MapReduce com o Apache Tez, tomando como base o algoritmo de segmentação distribuída supracitado. Uma das vantagens de utilizar Tez é a sua compatibilidade e integração com outras soluções consagradas como Pig (Olston, 2008) e Hive (Thusoo, 2009). Além disso, Tez tem sido considerado superior ao MapReduce por utilizar o sistema distribuído de arquivos de forma mais efetiva e processar várias fases de reduce sem a necessidade de fases de map, entre outros benefícios (Singh, 2016). O restante deste artigo está organizado da seguinte forma. Na próxima seção as estratégias de segmentação distribuída são descritas de forma breve. Na seção seguinte, define-se a arquitetura geral e uma implementação da solução apresentada. Na seção 4, apresentam-se a análise experimental e os resultados. Por fim, o trabalho é concluído na Seção 5 e possíveis trabalhos futuros são indicados. 2. Segmentação por Crescimento de Regiões na Nuvem Entre as etapas da análise de imagens, a segmentação geralmente é associada a um alto custo computacional. Apesar da existência de diversas soluções paralelas com a finalidade de acelerar esta tarefa, o problema recai sobre a capacidade de processar imagens muito grandes. A solução adotada neste artigo se baseia nas estratégias apresentadas por Happ et al. (2016), que consistem uma solução escalável e eficiente para processar imagens de grandes tamanhos em um ambiente em nuvem. Uma breve explicação dos métodos apresenta-se a seguir. O crescimento de regiões é um processo iterativo constituído de verificação constante de vizinhança e possui fortes dependências entre segmentos adjacentes. A divisão de imagens em tiles é uma solução potencial que requer algum mecanismo específico para lidar com os segmentos localizados nas bordas dos tiles. Em suma, a estratégia proposta por Happ et al. (2016) lida com o problema por meio de três etapas. Inicialmente a imagem é dividida em tiles de forma a gerar conjuntos de dados independentes passíveis de distribuição. Em seguida, o algoritmo de segmentação propriamente dito é executado em cada um dos tiles de forma independente. Por fim, um método de pós-processamento é utilizado para costurar os segmentos adjacentes que tocam as bordas de diferentes tiles com a finalidade de suprimir os artefatos gerados pelas segmentações independentes. Para o funcionamento correto destas etapas, pressupõe-se que os segmentos internos, os que não tocam nas bordas dos tiles, estão corretamente delineados, isto é, não sofrem com a divisão da imagem. Embora essa suposição não seja necessariamente verdadeira em todos os casos, ela faz sentido basicamente porque esses segmentos estão menos sujeitos à potencial influência de pixels em tiles adjacentes. Esta hipótese implica em uma quantidade muito menor de processamento durante o processo de costura, e permite que segmentos de tiles diferentes sejam agrupados sem problemas críticos de memória. Além disso, um eficiente esquema de indexação espacial com diferentes níveis hierárquicos é utilizado para determinar as extensões geográficas dos tiles de imagem e rotular os segmentos. Este esquema de indexação suporta o agrupamento de segmentos numa etapa de pós-processamento de acordo com a sua localização espacial, de modo que segmentos adjacentes façam parte da mesma distribuição de dados no pós-processamento. Três estratégias de pós-processamento são definidas no trabalho de Happ et al. (2016): Pós-Processamento Simples (SPP), Pós-Processamento Hierárquico (HPP) e PósProcessamento Hierárquico com Re-segmentação (HPPR). A primeira é a mais rápida, porém produz artefatos no resultado. Já a última consome mais tempo, mas fornece resultados sem artefatos. Neste trabalho, o interesse recai sobre a primeira estratégia, a SPP, que é utilizada para a execução dos experimentos. A SPP possui um único passo de pós-processamento, mas que é suficiente para permitir que segmentos de tiles adjacentes sejam fundidos. 3. Definição da Arquitetura e Implementação De maneira geral, pode-se definir uma arquitetura para a segmentação distribuída composta por três camadas em diferentes níveis de abstração (Figura 1). A primeira camada está relacionada com a definição das entradas e parâmetros de segmentação e configurações do ambiente distribuído. Por esta razão, é conhecida como camada de definição. A segunda camada é chamada de camada de segmentação e é organizada em uma estrutura de alto nível a fim de esconder a complexidade da programação distribuída propriamente dita. Esta camada permite incluir novos algoritmos de segmentação e outros métodos desejados, além de alterar o fluxo de execução. A terceira camada é a camada de distribuição. Por estar relacionada com o processamento distribuído de fato, somente programadores com habilidades de programação distribuída serão capazes de interagir com essa camada. A ligação entre as camadas de segmentação e de distribuição é definida por uma tradução, onde as instruções de alto nível são compiladas em código de processamento distribuído. Figura 1. Arquitetura da segmentação distribuída. 3.1 Implementação Original com MapReduce Tomando como base a arquitetura descri", "venue": "", "year": 2017, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2017-02-13", "journal": {"name": "", "pages": "60164", "volume": ""}, "authors": [{"authorId": "12712049", "name": "P. N. Happ"}, {"authorId": "151008301", "name": "G. Costa"}, {"authorId": "2066979023", "name": "Raul Queiroz Feitosa"}], "citations": []}
