{"paperId": "a87af8ec4686bd8fb9594271c3348a8a6ba57aa9", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "A Survey on Vertical Federated Learning: From a Layered Perspective", "abstract": "Vertical federated learning (VFL) is a promising category of federated learning for the scenario where data is vertically partitioned and distributed among parties. VFL enriches the description of samples using features from different parties to improve model capacity. Compared with horizontal federated learning, in most cases, VFL is applied in the commercial cooperation scenario of companies. Therefore, VFL contains tremendous business values. In the past few years, VFL has attracted more and more attention in both academia and industry. In this paper, we systematically investigate the current work of VFL from a layered perspective. From the hardware layer to the vertical federated system layer, researchers contribute to various aspects of VFL. Moreover, the application of VFL has covered a wide range of areas, e.g., finance, healthcare, etc. At each layer, we categorize the existing work and explore the challenges for the convenience of further research and development of VFL. Especially, we design a novel MOSP tree taxonomy to analyze the core component of VFL, i.e., secure vertical federated machine learning algorithm. Our taxonomy considers four dimensions, i.e., machine learning model (M), protection object (O), security model (S), and privacy-preserving protocol (P), and provides a comprehensive investigation.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-04-04", "journal": {"name": "ArXiv", "volume": "abs/2304.01829"}, "authors": [{"authorId": "2145494870", "name": "Liu Yang"}, {"authorId": "2064208321", "name": "Di Chai"}, {"authorId": "1908497", "name": "Junxue Zhang"}, {"authorId": "9372198", "name": "Yilun Jin"}, {"authorId": "2143500842", "name": "Leye Wang"}, {"authorId": "2143857796", "name": "Hao Liu"}, {"authorId": "2069991088", "name": "Han Tian"}, {"authorId": "2197563583", "name": "Qian Xu"}, {"authorId": "2157740727", "name": "Kai Chen"}], "citations": [{"paperId": "2c859754f05887fc03765a893e39f231fa7912b8", "title": "Computation and Communication Efficient Lightweighting Vertical Federated Learning"}, {"paperId": "a424e91e5127445cc7cd7cc0998395a6528890aa", "title": "A Survey of Privacy Threats and Defense in Vertical Federated Learning: From Model Life Cycle Perspective"}, {"paperId": "389e1de6c6a266509b89ac00c36a4cb56dee78e5", "title": "P3LS: Partial Least Squares under Privacy Preservation"}, {"paperId": "eea271aba368f87c481fea4b1e9aa67c64233409", "title": "Online Vertical Federated Learning for Cooperative Spectrum Sensing"}, {"paperId": "375862a2f19a32f33185f0dfbc7f6dcffa63a334", "title": "Eliminating Label Leakage in Tree-Based Vertical Federated Learning"}, {"paperId": "60a68540b62b46afabb592fa8e2d575897d73fdf", "title": "VertiBench: Advancing Feature Distribution Diversity in Vertical Federated Learning Benchmarks"}, {"paperId": "6b2d2a630cd32e3608922b166478b158fe5d0073", "title": "Hierarchical Federated Learning Incentivization for Gas Usage Estimation"}, {"paperId": "fc139a3fbe3b62988615330e2444d8c2dea59822", "title": "VERTICES: Efficient Two-Party Vertical Federated Linear Model with TTP-aided Secret Sharing"}, {"paperId": "7164a38c95c9336d3aec97ee247edda81ed9db50", "title": "ACCELERATING PRIVACY-PRESERVING MACHINE LEARNING WITH GENIBATCH"}]}
