{"paperId": "a882a848be7a4cb8e5e3fed27439481eda8e9878", "publicationVenue": null, "title": "Meta-heuristic-based FCM-UNet segmentation with multi-objective function and deep learning for brain tumour classification", "abstract": "ABSTRACT A technique of automated segmentation has been introduced in this paper, which makes the tumour segmentation out of MRI images, apart from improving the effectiveness of segmentation as well as classification. Once the dataset of MRI dataset is collected from different public sources, the pre-processing of the image is performed by the median filtering and contrast enhancement. The segmentation of brain tumour is the main contribution of this paper, which concentrates on developing the Adaptive Influence Factor-based Elephant Herding Optimisation (AIF-EHO)-based FCM-UNet fusion segmentation with multi-objective function. Then, the feature extraction is performed using Completed Local Binary Pattern (CLBP) and Local Gradient Pattern (LGP). These extracted features are further used in deep learning using Enhanced Recurrent Neural Network (RNN) for brain tumour classification. Results demonstrated on public benchmarks described that this method attains competitive accuracy than the conventional techniques while being computationally effective.", "venue": "Comput. methods Biomech. Biomed. Eng. Imaging Vis.", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-07-07", "journal": {"name": "Computer Methods in Biomechanics and Biomedical Engineering: Imaging & Visualization", "pages": "568 - 585", "volume": "11"}, "authors": [{"authorId": "2220129299", "name": "A. S. Kumar"}, {"authorId": "39059213", "name": "P. R. Kumar"}], "citations": [{"paperId": "ad3892ece0b75df5e3fe05e7f52993338ea4ad9e", "title": "Advance brain tumor segmentation using feature fusion methods with deep U-Net model with CNN for MRI data"}, {"paperId": "9b04f1f076c33ad3484adf726e6ad08464b9c6a8", "title": "Assertion of Low Bone Mass in Osteoporotic X-ray images using Deep Learning Technique"}]}
