{"paperId": "a88e445818229761d300f481abdfac223d62ef7e", "publicationVenue": {"id": "a00fde74-d8df-4613-b825-0fff9f531d3f", "name": "IEEE Transactions on Network and Service Management", "type": "journal", "alternate_names": ["IEEE Trans Netw Serv Manag"], "issn": "1932-4537", "url": "http://ejournals.ebsco.com/direct.asp?JournalID=714200", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4275028", "http://ieeexplore.ieee.org/servlet/opac?punumber=4275028"]}, "title": "TADRP: Toward Thermal-Aware Data Replica Placement in Data-Intensive Data Centers", "abstract": "With the mushrooming growth of data volumes, data replica placement plays a key role in promoting the energy efficiency and Quality-of-Service (QoS) of data-intensive data centers. The existing data placement strategies mainly focus on storage performance improvement or QoS enhancement in data centers, but ignore the indispensable factor - heat recirculation. To bridge this gap, we propose a thermal-aware data replica placement strategy called TADRP, aiming to improve cooling efficiency and minimize the total power consumption of data-intensive data centers. TADRP leverages an ant colony optimization (ACO) algorithm coupled with Laplacian probability distribution to find a quasi-optimal disk sequence (or Disk Sequence for short), which consists of disks selected from different rack servers to place data replicas. TADRP categorizes disks of Disk Sequence into active and inactive ones, by placing hot and cold replicas on active and inactive disks, respectively. We quantitatively evaluate TADRP in terms of cooling costs, total power consumption, number of power-state transitions, and execution time. We compare TADRP with four alternative solutions, namely, Random, Hadoop, SRS, and CDP-NSGAII. Experimental results show that TADRP can reduce the cooling costs and the total power of the existing solutions by 14.7% - 61.7% and 19.2%-55.1%, respectively, without undesirable I/O performance drops.", "venue": "IEEE Transactions on Network and Service Management", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-01", "journal": {"name": "IEEE Transactions on Network and Service Management", "pages": "4397-4415", "volume": "20"}, "authors": [{"authorId": "2155872191", "name": "Jie Li"}, {"authorId": "35143368", "name": "Yuhui Deng"}, {"authorId": "2044335124", "name": "Yi Zhou"}, {"authorId": "2146045399", "name": "Zhaorui Wu"}, {"authorId": "2100397414", "name": "Shujie Pang"}, {"authorId": "2165744386", "name": "Geyong Min"}], "citations": []}
