{"paperId": "a898980e211a36bb2b328934b6977645894fe3bb", "publicationVenue": null, "title": "Handling Data and Model Drift for World Application using Big Data", "abstract": "It's still unclear how to effectively extract the information concealed inside vast and massive amounts of data. The problem of “idea drift” in stream data flows is one of the difficulties. Random walk is a common issue in data analytics where the statistical features of the characteristics and the categories they are intended for change with time, decreasing the accuracy of the trained model. There are numerous approaches that have been put out for bulk data mining. A new generation of data mining methods called stream mining updates the model in a single pass whenever fresh data is received. Because of its inherent adaptability, this one-pass mechanism may be properly capable than its predecessors of coping with idea drift in data streams. In this study, we assess a group of algorithms for mining the data streams using decision trees. The collection of rules which can be derived from the induced model is the benefit of decision tree learning. The predicate logics that represent the extracted rules can then be applied in a variety of decision-supporting applications. Even in the face of concept drift, the induced decision tree has to be precise and condensed. When dealing with concept-drift data, we evaluate how well three common incremental decision tree methods (random forest, isolation forest, and forest tree) perform. In the experiment, drift data from both synthetic and actual environments are employed. It is discovered that optimization method with big data technique i.e., MapReduce yields better outcomes.", "venue": "2022 International Conference on Knowledge Engineering and Communication Systems (ICKES)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-12-28", "journal": {"name": "2022 International Conference on Knowledge Engineering and Communication Systems (ICKES)", "pages": "1-6"}, "authors": [{"authorId": "49121016", "name": "Rajesh Singh"}, {"authorId": "2225522723", "name": "India Dehradun"}, {"authorId": "9280578", "name": "Anita Gehlot"}, {"authorId": "2288180273", "name": "rd Finney"}, {"authorId": "2288169073", "name": "Daniel Shadrach"}, {"authorId": "153428520", "name": "S. Prabu"}, {"authorId": "2288169310", "name": "India Krishnankoil"}, {"authorId": "2288164116", "name": "V. S. Kumar"}], "citations": [{"paperId": "9e7be6e933221a9168aabfeba837f1783fb57eff", "title": "Smart Ration Distributor and Database Management"}]}
