{"paperId": "a89b19eb570f04e847c373d81b19738617f55b76", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Evaluation of Criteria for the Implementation of High-Performance Computing (HPC) in Danube Region Countries Using Fuzzy PIPRECIA Method", "abstract": "The use of computers with outstanding performance has become a real necessity in order to achieve greater efficiency and sustainability for the accomplishment of various tasks. Therefore, with the development of information technology and increasing dynamism in the business environment, it is expected that these computers will be more intensively deployed. In this paper, research was conducted in Danube region countries: Austria, Bosnia and Herzegovina, Bulgaria, Croatia, Czech Republic, Germany, Hungary, Moldova, Montenegro, Romania, Serbia, Slovakia, Slovenia, and Ukraine. The aim of the research was to determine what criteria are most significant for the introduction of high-performance computing and the real situation in each of the countries. In addition, the aim was to establish the infrastructure needed to implement such a system. In order to determine the partial significance of each criterion and thus the possibility of implementing high-performance computing, a multi-criteria model in a fuzzy environment was applied. The weights of criteria and their rankings were performed using the Fuzzy PIvot Pairwise RElative Criteria Importance Assessment—fuzzy PIPRECIA method. The results indicate different values depend on decision-makers (DMs) in the countries. Spearman’s and Pearson’s correlation coefficients were calculated to verify the results obtained.", "venue": "Sustainability", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2020-04-09", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "113697719", "name": "M. Tomasevic"}, {"authorId": "103757134", "name": "Lucija Lapuh"}, {"authorId": "52324480", "name": "Željko Stević"}, {"authorId": "2070196", "name": "D. Stanujkić"}, {"authorId": "3393181", "name": "D. Karabašević"}], "citations": [{"paperId": "b6b4b2ac6a4c9067c98ad23c8bbde677cd593fd9", "title": "Addressing the challenges of using autonomous robots for last-mile delivery"}, {"paperId": "ee7ec4641be8f9991303b3eb2aa397fcce0f3a11", "title": "Evaluation of TPM adoption factors in manufacturing organizations using fuzzy PIPRECIA method"}, {"paperId": "dca8578b58eace778c145d51f1cac28d9890af02", "title": "Optimizing the Analysis and Evaluation of Logic Simulation Workloads in HPC Systems"}, {"paperId": "e092ae2cef38367783b0c2b9068a9aac61bba5d8", "title": "Assessment actions for improving railway sector performance using intuitionistic fuzzy-rough multi-criteria decision-making model"}, {"paperId": "678c909e0b3b9d6809fe6fe603d00a596befcad9", "title": "ABCD Analysis of Industries Using High-Performance Computing"}, {"paperId": "7eba0951ba59b9074eb387a94160fef205c7e0f2", "title": "Blue Collar Personnel Selection for A Manufacturing Company with Fuzzy COPRAS Method Based on Fuzzy PIPRECIA"}, {"paperId": "1dbb759df8fd5fdad59d2d48ae73ede29a995519", "title": "EVALUATION OF TWO-LANE ROAD SECTIONS IN TERMS OF TRAFFIC RISK USING AN INTEGRATED MCDM MODEL"}, {"paperId": "c564b2a5ea22d908f36e139a56c77809be146401", "title": "DETERMINING CRITERIA WEIGHTS FOR VEHICLE TRACKING SYSTEM SELECTION USING PIPRECIA-S"}, {"paperId": "5685dd5e68f39c3a63fa5923cc6a0100d2f25701", "title": "An integrated decision making approach for selecting a sustainable waste water treatment technology."}, {"paperId": "15a6d7334d47709cd520e2e119911d27c85f7f41", "title": "An Integrated PIPRECIA and COPRAS Method under Fuzzy Environment: A Case of Truck Tractor Selection"}, {"paperId": "75d7d9d18f680988886cc21ce62ec9b7c851f526", "title": "Assessment of Site Selection Criteria for Medical Waste during COVID-19 Pandemic"}, {"paperId": "b1aedca3750ae19e80701d03bbdaeed318cc1d40", "title": "Assessing sustainable production under circular economy context using a novel rough-fuzzy MCDM model: a case of the forestry industry in the Eastern Black Sea region"}, {"paperId": "36c49899bdbc2aeb7121c84a03b0fd8620d7ad39", "title": "Vpliv uporabe visoko zmogljivega računalništva v oblaku na inoviranje poslovnih modelov"}, {"paperId": "f56ae01a07f6d9f58259d69497cc7900ed449528", "title": "AN INTEGRATED SWOT – FUZZY PIPRECIA MODEL FOR ANALYSIS OF COMPETITIVENESS IN ORDER TO IMPROVE LOGISTICS PERFORMANCES"}, {"paperId": "1da7d697bd56c09e8d13d48a67a8f7a4f7107d54", "title": "PRIORITIZATION of ROAD TRANSPORTATION RISKS: AN APPLICATION in GİRESUN PROVINCE"}, {"paperId": "71337c0ca9e4551ca96312b4985d07ab821f4320", "title": "A Novel Integrated PIPRECIA-Interval-Valued Triangular Fuzzy ARAS Model: E-Learning Course Selection"}, {"paperId": "d7e363ce1072f8ec2e72af885081c12c2cfd3ba2", "title": "Assessment of Causes of Delays in the Road Construction Projects in the Benin Republic Using Fuzzy PIPRECIA Method"}, {"paperId": "b4c53db923361489b9a80b50aa6540ffa1da8570", "title": "A New Grey Approach for Using SWARA and PIPRECIA Methods in a Group Decision-Making Environment"}, {"paperId": "f547866a1cf74a1d21dd73395d8c1938eacc1efb", "title": "REGIONAL AIRCRAFT SELECTION WITH FUZZY PIPRECIA AND FUZZY MARCOS: A CASE STUDY OF THE TURKISH AIRLINE INDUSTRY"}, {"paperId": "cb19ec42965f17a6e3dca16d54d85dc772d94101", "title": "A Piprecia-OCRA-G Decision-Making Approach to Selecting Sustainable Hotel Construction Projects"}]}
