{"paperId": "a8ae6618d8feff7631ea87a849a7c78b4d943569", "publicationVenue": {"id": "05528bac-d212-46a6-9c84-314d4bd77368", "name": "International Journal of Intelligent Systems", "type": "journal", "alternate_names": ["Int J Intell Syst"], "issn": "0884-8173", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/36062", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/1098111X"]}, "title": "LogBASA: Log Anomaly Detection Based on System Behavior Analysis and Global Semantic Awareness", "abstract": "System log anomaly detection is important for ensuring stable system operation and achieving rapid fault diagnosis. System log sequences include data on the execution paths and time stamps of system tasks in addition to a large amount of semantic information, which enhances the reliability and effectiveness of anomaly detection. At the same time, considering the correlation between system log sequences can effectively improve fault diagnosis efficiency. However, the existing system log anomaly detection methods mostly consider only the sequence patterns or semantic information on the logs, so their anomaly detection results show a high rate of missed and false alarms. To solve these problems, this paper proposed an unsupervised log anomaly detection model (LogBASA) based on the system behavior analysis and global semantic awareness, aiming to decrease the leakage rate and increase the log sequence anomaly detection accuracy. First, a system log knowledge graph was constructed based on massive, unstructured, and multilevel system log data to represent log sequence patterns, which facilitates subsequent anomaly detection and localization. Then, a self-attention encoder-decoder transformer model was developed for log spatiotemporal association analysis. This model combines semantic mapping and spatiotemporal features of log sequences to analyze system behavior and log semantics in multiple dimensions. Furthermore, a system log anomaly detection method that combines adaptive spatial boundary delineation and sequence reconstruction objective functions was proposed. This method uses special words to characterize the log sequence states, delineates anomaly boundaries automatically, and reconstructs log sequences through unsupervised training for anomaly detection. Finally, the proposed method was verified by numerous experiments on three real datasets. The results indicate that the proposed method can achieve an accuracy rate of 99.3%, 95.1%, and 97.2% on HDFS, BGL, and Thunderbird datasets, which proves the effectiveness and superiority of the LogBASA model.", "venue": "International Journal of Intelligent Systems", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-20", "journal": {"name": "International Journal of Intelligent Systems"}, "authors": [{"authorId": "1490932629", "name": "Liping Liao"}, {"authorId": "2244365291", "name": "Ke Zhu"}, {"authorId": "2119521", "name": "Jianzhen Luo"}, {"authorId": "2244598210", "name": "Jun Cai"}], "citations": []}
