{"paperId": "a8aef5a15dc2b486b3bf01205d2687a1140a41bb", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Conversational Health Agents: A Personalized LLM-Powered Agent Framework", "abstract": "Conversational Health Agents (CHAs) are interactive systems that provide healthcare services, such as assistance and diagnosis. Current CHAs, especially those utilizing Large Language Models (LLMs), primarily focus on conversation aspects. However, they offer limited agent capabilities, specifically lacking multi-step problem-solving, personalized conversations, and multimodal data analysis. Our aim is to overcome these limitations. We propose openCHA, an open-source LLM-powered framework, to empower conversational agents to generate a personalized response for users' healthcare queries. This framework enables developers to integrate external sources including data sources, knowledge bases, and analysis models, into their LLM-based solutions. openCHA includes an orchestrator to plan and execute actions for gathering information from external sources, essential for formulating responses to user inquiries. It facilitates knowledge acquisition, problem-solving capabilities, multilingual and multimodal conversations, and fosters interaction with various AI platforms. We illustrate the framework's proficiency in handling complex healthcare tasks via three demonstrations. Moreover, we release openCHA as open source available to the community via GitHub.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-10-03", "journal": {"name": "ArXiv", "volume": "abs/2310.02374"}, "authors": [{"authorId": "2182148069", "name": "Mahyar Abbasian"}, {"authorId": "2241201441", "name": "Iman Azimi"}, {"authorId": "2224892821", "name": "Amir M. Rahmani"}, {"authorId": "2244623565", "name": "Ramesh Jain"}], "citations": [{"paperId": "203574cdbb7ae35a44c40abeed414093a58b74bf", "title": "Prospect Personalized Recommendation on Large Language Model-based Agent Platform"}, {"paperId": "e53412b4f0f15330f8efa84e3c8f649bbe5e26f7", "title": "An Empirical Categorization of Prompting Techniques for Large Language Models: A Practitioner's Guide"}, {"paperId": "bba9e984f19c30977d678ead4d9c80a441310d8c", "title": "ChatDiet: Empowering Personalized Nutrition-Oriented Food Recommender Chatbots through an LLM-Augmented Framework"}, {"paperId": "b875206981c6c0a10e84f77d2c48cb7fc57fbfe6", "title": "Knowledge-Infused LLM-Powered Conversational Health Agent: A Case Study for Diabetes Patients"}, {"paperId": "f29e338a28c4e1d3f6c163bf45506ba4671d5fa7", "title": "Personalized Large Language Models"}, {"paperId": "2eff8cbb4b226575a2f6aa93c40804c163e463ac", "title": "From RAG to QA-RAG: Integrating Generative AI for Pharmaceutical Regulatory Compliance Process"}, {"paperId": "3721eb984e7e00a94dd9fc84e0183b2ab5991033", "title": "EHRAgent: Code Empowers Large Language Models for Few-shot Complex Tabular Reasoning on Electronic Health Records"}, {"paperId": "4fbf46125b56ff96f255927206ec565f0962159e", "title": "RoleCraft-GLM: Advancing Personalized Role-Playing in Large Language Models"}, {"paperId": "383c598625110e0a4c60da4db10a838ef822fbcf", "title": "A Survey on Large Language Model (LLM) Security and Privacy: The Good, the Bad, and the Ugly"}, {"paperId": "6e50162ff04f315e49e722a61f24f9a9c8ced67d", "title": "Towards Responsible Generative AI: A Reference Architecture for Designing Foundation Model based Agents"}, {"paperId": "38552c3f0f6afd651cc93b59ef7db6dafa405bf0", "title": "A Self-enhancement Approach for Domain-specific Chatbot Training via Knowledge Mining and Digest"}, {"paperId": "8d2709ed1788a67e64425fb410bb49f3ee49e088", "title": "Large Language Models Illuminate a Progressive Pathway to Artificial Healthcare Assistant: A Review"}]}
