{"paperId": "a8b66db0dbe7d05df899c0b93455a7e1ead3a635", "publicationVenue": {"id": "b877cd38-7f65-4f61-aa13-3413da5de430", "name": "MATEC Web of Conferences", "alternate_names": ["MATEC Web Conf"], "issn": "2261-236X", "url": "https://web.archive.org/web/*/http:/www.matec-conferences.org/", "alternate_urls": ["https://www.matec-conferences.org/"]}, "title": "Possibilities of forecasting bus average speed on city route", "abstract": "Average bus speed analysis plays a key role in transit operations planning. Such analysis makes it possible to perform forecasting more accurately, especially taking into account the possibility of automated monitoring of a large database. The paper offers a new approach to forecasting the average bus speed on the city route, taking into account the “skip-stop” method. For the convenience of data processing and comparison, four main time periods were selected. The corresponding array of data was organized for each of time periods in the software environment “Statistica”. The conducted analysis characterizes a significant difference in the values of the speed indicators. It has been established that the change in speed leads to non-compliance with traffic schedules and indicates difficult traffic conditions during peak hours. It was studied and compared the deviation of the speed from the average value during the day. It is proposed a new scenario for the operation of buses with skipping stops in the hour when the speed on the route is lower than the average value. According to the results of speed modeling in peak years, it shows the possibility of reducing the negative effects of speed on the schedule. This forecasting of the average buses speed will enable system operators to more accurately design traffic schedules and minimize disruptions in them.", "venue": "MATEC Web of Conferences", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": null, "journal": {"name": "MATEC Web of Conferences"}, "authors": [{"authorId": "2166321118", "name": "Mykola Zhuk"}, {"authorId": "100470750", "name": "V. Hilevych"}, {"authorId": "144630240", "name": "V. Kovalyshyn"}, {"authorId": "1582673535", "name": "Halyna Pivtorak"}], "citations": []}
