{"paperId": "a8b6fbdf2e7f0d081b994093a99bd90430429460", "publicationVenue": {"id": "7dc67430-38f4-4598-87e8-4ffba2e9f8ac", "name": "IET Intelligent Transport Systems", "type": "journal", "alternate_names": ["Iet Intelligent Transport Systems", "IET Intell Transp Syst", "Iet Intell Transp Syst"], "issn": "1751-956X", "url": "http://www.ietdl.org/IET-ITS", "alternate_urls": ["http://www.ietdl.org/IP-ITS"]}, "title": "Deep Learning Serves Traffic Safety Analysis: A Forward-looking Review", "abstract": "This paper explores Deep Learning (DL) methods that are used or have the potential to be used for traffic video analysis, emphasizing driving safety for both Autonomous Vehicles (AVs) and human-operated vehicles. We present a typical processing pipeline, which can be used to understand and interpret traffic videos by extracting operational safety metrics and providing general hints and guidelines to improve traffic safety. This processing framework includes several steps, including video enhancement, video stabilization, semantic and incident segmentation, object detection and classification, trajectory extraction, speed estimation, event analysis, modeling and anomaly detection. Our main goal is to guide traffic analysts to develop their own custom-built processing frameworks by selecting the best choices for each step and offering new designs for the lacking modules by providing a comparative analysis of the most successful conventional and DL-based algorithms proposed for each step. We also review existing open-source tools and public datasets that can help train DL models. To be more specific, we review exemplary traffic problems and mentioned requires steps for each problem. Besides, we investigate connections to the closely related research areas of drivers' cognition evaluation, Crowd-sourcing-based monitoring systems, Edge Computing in roadside infrastructures, Automated Driving Systems (ADS)-equipped vehicles, and highlight the missing gaps. Finally, we review commercial implementations of traffic monitoring systems, their future outlook, and open problems and remaining challenges for widespread use of such systems.", "venue": "IET Intelligent Transport Systems", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-03-07", "journal": {"name": "ArXiv", "volume": "abs/2203.10939"}, "authors": [{"authorId": "144705386", "name": "Abolfazl Razi"}, {"authorId": "2024833342", "name": "Xiwen Chen"}, {"authorId": "2144398138", "name": "Huayu Li"}, {"authorId": "11167587", "name": "Brendan J. Russo"}, {"authorId": "2144285720", "name": "Yan Chen"}, {"authorId": "2159636758", "name": "Hongbin Yu"}], "citations": [{"paperId": "f636022c2552305f6ecfa3b366b36ffaab85adfa", "title": "FedMIL: Federated-Multiple Instance Learning for Video Analysis with Optimized DPP Scheduling"}, {"paperId": "939785e7b37bfc08e9418bffbfd0cbf2b92f4662", "title": "Driving Towards Inclusion: Revisiting In-Vehicle Interaction in Autonomous Vehicles"}, {"paperId": "40244c4a8e08af53d286bf07c58bcd36f3f20481", "title": "Remote sensing traffic scene retrieval based on learning control algorithm for robot multimodal sensing information fusion and human-machine interaction and collaboration"}, {"paperId": "832c17d1b406593a6fe43da0c6c332e797101dd9", "title": "IC-GAN: An Improved Conditional Generative Adversarial Network for RGB-to-IR image translation with applications to forest fire monitoring"}, {"paperId": "933e3949a95d431b4b6b30e82fbfdf093f096bc8", "title": "Real-time detection of road manhole covers with a deep learning model"}, {"paperId": "51b8d9784fa13dc2dbadd8cad746e517eaae7af3", "title": "Vision-Based Traffic Accident Detection and Anticipation: A Survey"}, {"paperId": "c77f950cb330adac87bea5a79914bc50a9f43704", "title": "Ranking of Human Factors in the Incidence of Road Crashes Based on Fuzzy Decision-Making Technique (a Case Study in Southern Italy)"}, {"paperId": "5e02d0cfd9842f53dccd926167a5148078f4c30b", "title": "Diversity Maximized Scheduling in RoadSide Units for Traffic Monitoring Applications"}, {"paperId": "ea2989a420e45215e34eee0dc7d43dac8808fe05", "title": "LLM-based Smart Reply (LSR): Enhancing Collaborative Performance with ChatGPT-mediated Smart Reply System"}, {"paperId": "cb9bae7ae81e3054cd3aa66e8afa871ed274292a", "title": "Learning on Bandwidth Constrained Multi-Source Data with MIMO-inspired DPP MAP Inference"}, {"paperId": "66a3b3e0288ce854a509d5eaf64db56afe71c74a", "title": "METODY PŘEDZPRACOVÁNÍ OBRAZU PRO AUTOMATICKOU DETEKCI ÚČASTNÍKŮ SILNIČNÍHO PROVOZU"}, {"paperId": "58821990ff3cf3c8b85867469a3bb54e768f16e5", "title": "Fast Key Points Detection and Matching for Tree-Structured Images"}, {"paperId": "5816ff58cd5056a9753d159ac106bb5cc9e84d3b", "title": "Network-Level Safety Metrics for Overall Traffic Safety Assessment: A Case Study"}]}
