{"paperId": "a8befa1388c76ee1e05c8e28e4cc30d917a50072", "publicationVenue": {"id": "d024be26-06b0-4afe-8fa3-a297e04fe604", "name": "International Colloquium on Automata, Languages and Programming", "type": "conference", "alternate_names": ["Int Conf Arab Lang Process", "International Conference on Arabic Language Processing", "Int Colloq Autom Lang Program", "ICALP"], "url": "http://www.eatcs.org/"}, "title": "Triangle Counting with Local Edge Differential Privacy", "abstract": "Many deployments of differential privacy in industry are in the local model, where each party releases its private information via a differentially private randomizer. We study triangle counting in the noninteractive and interactive local model with edge differential privacy (that, intuitively, requires that the outputs of the algorithm on graphs that differ in one edge be indistinguishable). In this model, each party's local view consists of the adjacency list of one vertex. In the noninteractive model, we prove that additive $\\Omega(n^2)$ error is necessary, where $n$ is the number of nodes. This lower bound is our main technical contribution. It uses a reconstruction attack with a new class of linear queries and a novel mix-and-match strategy of running the local randomizers with different completions of their adjacency lists. It matches the additive error of the algorithm based on Randomized Response, proposed by Imola, Murakami and Chaudhuri (USENIX2021) and analyzed by Imola, Murakami and Chaudhuri (CCS2022) for constant $\\varepsilon$. We use a different postprocessing of Randomized Response and provide tight bounds on the variance of the resulting algorithm. In the interactive setting, we prove a lower bound of $\\Omega(n^{3/2})$ on the additive error. Previously, no hardness results were known for interactive, edge-private algorithms in the local model, except for those that follow trivially from the results for the central model. Our work significantly improves on the state of the art in differentially private graph analysis in the local model.", "venue": "International Colloquium on Automata, Languages and Programming", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-05-03", "journal": {"name": "ArXiv", "volume": "abs/2305.02263"}, "authors": [{"authorId": "27422922", "name": "T. Eden"}, {"authorId": "21234724", "name": "Quanquan C. Liu"}, {"authorId": "1797575", "name": "Sofya Raskhodnikova"}, {"authorId": "39765787", "name": "Adam D. Smith"}], "citations": [{"paperId": "fc5f7637b3532052d289402b8712eef0bb8858bb", "title": "Tighter Bounds for Local Differentially Private Core Decomposition and Densest Subgraph"}, {"paperId": "b5cad71149e18958c06fdc07d982d60b5b544c52", "title": "Communication Cost Reduction for Subgraph Counting under Local Differential Privacy via Hash Functions"}, {"paperId": "2f62405d730496d0d3cdd9ddb7ef8d2c0d634ca6", "title": "50th International Colloquium on Automata, Languages, and Programming, ICALP 2023, July 10-14, 2023, Paderborn, Germany"}]}
