{"paperId": "a8d2f8585e9e282f3caa0d4e72f1a47974a6d7a2", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Design and Development of Internet of Things-Driven Fault Detection of Indoor Thermal Comfort: HVAC System Problems Case Study", "abstract": "Controlling thermal comfort in the indoor environment demands research because it is fundamental to indicating occupants’ health, wellbeing, and performance in working productivity. A suitable thermal comfort must monitor and balance complex factors from heating, ventilation, air-conditioning systems (HVAC Systems) and outdoor and indoor environments based on advanced technology. It needs engineers and technicians to observe relevant factors on a physical site and to detect problems using their experience to fix them early and prevent them from worsening. However, it is a labor-intensive and time-consuming task, while experts are short on diagnosing and producing proactive plans and actions. This research addresses the limitations by proposing a new Internet of Things (IoT)-driven fault detection system for indoor thermal comfort. We focus on the well-known problem caused by an HVAC system that cannot transfer heat from the indoor to outdoor and needs engineers to diagnose such concerns. The IoT device is developed to observe perceptual information from the physical site as a system input. The prior knowledge from existing research and experts is encoded to help systems detect problems in the manner of human-like intelligence. Three standard categories of machine learning (ML) based on geometry, probability, and logical expression are applied to the system for learning HVAC system problems. The results report that the MLs could improve overall performance based on prior knowledge around 10% compared to perceptual information. Well-designed IoT devices with prior knowledge reduced false positives and false negatives in the predictive process that aids the system to reach satisfactory performance.", "venue": "Italian National Conference on Sensors", "year": 2022, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-03-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "22"}, "authors": [{"authorId": "40372233", "name": "Bukhoree Sahoh"}, {"authorId": "119188001", "name": "Mallika Kliangkhlao"}, {"authorId": "2999941", "name": "N. Kittiphattanabawon"}], "citations": [{"paperId": "3b19e3ca1aa2236d36b763473bf790fa1ae6089e", "title": "Deep Learning-Driven Automated Fault Detection and Diagnostics Based on a Contextual Environment: A Case Study of HVAC System"}, {"paperId": "f7b7b3d8bec7372b7648d739250c84421b317190", "title": "Causal AI-Powered Event Interpretation: A Cause-and-Effect Discovery for Indoor Thermal Comfort Measurements"}, {"paperId": "f53a0c17d4cc68d8726bdf2e2fe27804ca67d088", "title": "Radar Detection-Inspired Signal Retrieval from the Short-Time Fourier Transform"}, {"paperId": "8926b70755579ad411f2a8972ea1d88c648a5a7d", "title": "Physiological Signals-Driven Personal Thermal Comfort System Based on Environmental Intervention"}]}
