{"paperId": "a8d3c65ddc931578d37b78dc3b4b69a0a72b4fae", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "ATCS: Auto-Tuning Configurations of Big Data Frameworks Based on Generative Adversarial Nets", "abstract": "Big data processing frameworks (e.g., Spark, Storm) have been extensively used for massive data processing in the industry. To improve the performance and robustness of these frameworks, developers provide users with highly-configurable parameters. Due to the high-dimensional parameter space and complicated interactions of parameters, manual tuning of parameters is time-consuming and ineffective. Building performance-predicting models for big data frameworks is challenging for several reasons: (1) the significant time required to collect training data and (2) the poor accuracy of the prediction model when training data are limited. To meet this challenge, we proposes an <italic>auto-tuning configuration parameters system</italic> (ATCS), a new auto-tuning approach based on <italic>Generative Adversarial Nets</italic> (GAN). ATCS can build a performance prediction model with less training data and without sacrificing model accuracy. Moreover, an optimized <italic>Genetic Algorithm</italic> (GA) is used in ATCS to explore the parameter space for optimum solutions. To prove the effectiveness of ATCS, we select five frequently-used workloads in Spark, each of which runs on five different sized data sets. The results demonstrate that ATCS improves the performance of five frequently-used Spark workloads compared to the default configurations. We achieved a performance increase of <inline-formula> <tex-math notation=\"LaTeX\">$3.5\\times $ </tex-math></inline-formula> on average, with a maximum of <inline-formula> <tex-math notation=\"LaTeX\">$6.9\\times $ </tex-math></inline-formula>. To obtain similar model accuracy, experiment results also demonstrate that the quantity of ATCS training data is only 6% of <italic>Deep Neural Network</italic> (DNN) data, 13% of <italic>Support Vector Machine</italic> (SVM) data, 18% of <italic>Decision Tree</italic> (DT) data. Moreover, compared to other machine learning models, the average performance increase of ATCS is <inline-formula> <tex-math notation=\"LaTeX\">$1.7\\times $ </tex-math></inline-formula> that of DNN, <inline-formula> <tex-math notation=\"LaTeX\">$1.6\\times $ </tex-math></inline-formula> that of SVM, <inline-formula> <tex-math notation=\"LaTeX\">$1.7\\times $ </tex-math></inline-formula> that of DT on the five typical Spark programs.", "venue": "IEEE Access", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-03-10", "journal": {"name": "IEEE Access", "pages": "50485-50496", "volume": "8"}, "authors": [{"authorId": "2112146773", "name": "Mingyu Li"}, {"authorId": "2109076063", "name": "Zhiqiang Liu"}, {"authorId": "1678835", "name": "Xuanhua Shi"}, {"authorId": "145914256", "name": "Hai Jin"}], "citations": [{"paperId": "a21359673263d1de11f593fe396651554433c030", "title": "Deep Configuration Performance Learning: A Systematic Survey and Taxonomy"}, {"paperId": "daa2171619a5a00d478798f400dcece231b1706e", "title": "A comprehensive study and review of tuning the performance on database scalability in big data analytics"}, {"paperId": "e0917b7f212261e01194b6eb6e190f1b66ce002b", "title": "ATConf: auto-tuning high dimensional configuration parameters for big data processing frameworks"}, {"paperId": "ea0115694402d1cfb7e9a34cd44db6a0211c75a1", "title": "Approaches Involving Big Data Analytics (BDA) Using Machine Learning, Described"}, {"paperId": "c00b4d2800e313a9b75fd6aa4ed1c3e6e3e9f909", "title": "JointConf: Jointly autotuning configuration parameters for modularized graph databases"}, {"paperId": "d456a30f9d2f01d31cf81e41a1df56b9af4e35dc", "title": "Phronesis: Efficient Performance Modeling for High-dimensional Configuration Tuning"}, {"paperId": "c0610c75d58f9e7d19355f2b7cbabaf1483c5db9", "title": "Jespipe: A Plugin-Based, Open MPI Framework for Adversarial Machine Learning Analysis"}, {"paperId": "ae7dd75f3981574fd7d47caeeaa28d7e597f57ed", "title": "GML: Efficiently Auto-Tuning Flink's Configurations Via Guided Machine Learning"}, {"paperId": "ea6bc2c6165c2ae36dfa5949e72b5ae361013bbe", "title": "Determining a consistent experimental setup for benchmarking and optimizing databases"}, {"paperId": "c7d99b261443090f6fc97811d899200d09a79c06", "title": "Research on Comprehensive Evaluation of Data Source Quality in Big Data Environment"}, {"paperId": "b4126a406b291cfdcdd8b4d18291f3faa1e6ca1d", "title": "Autonomic Workload Performance Modeling for Large-Scale Databases and Data Warehouses Through Deep Belief Network With Data Augmentation Using Conditional Generative Adversarial Networks"}]}
