{"paperId": "a8d5992d068fd1cd92fa3f7be8d7f10d44bbcfc5", "publicationVenue": {"id": "1620da87-4387-4b9a-9bf4-22fdf74d4dc3", "name": "Symmetry", "type": "journal", "issn": "2073-8994", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172134", "alternate_urls": ["https://www.mdpi.com/journal/symmetry", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172134"]}, "title": "Choosing a Data Storage Format in the Apache Hadoop System Based on Experimental Evaluation Using Apache Spark", "abstract": "One of the most important tasks of any platform for big data processing is storing the data received. Different systems have different requirements for the storage formats of big data, which raises the problem of choosing the optimal data storage format to solve the current problem. This paper describes the five most popular formats for storing big data, presents an experimental evaluation of these formats and a methodology for choosing the format. The following data storage formats will be considered: avro, CSV, JSON, ORC, parquet. At the first stage, a comparative analysis of the main characteristics of the studied formats was carried out; at the second stage, an experimental evaluation of these formats was prepared and carried out. For the experiment, an experimental stand was deployed with tools for processing big data installed on it. The aim of the experiment was to find out characteristics of data storage formats, such as the volume and processing speed for different operations using the Apache Spark framework. In addition, within the study, an algorithm for choosing the optimal format from the presented alternatives was developed using tropical optimization methods. The result of the study is presented in the form of a technique for obtaining a vector of ratings of data storage formats for the Apache Hadoop system, based on an experimental assessment using Apache Spark.", "venue": "Symmetry", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-01-26", "journal": {"name": "Symmetry", "pages": "195", "volume": "13"}, "authors": [{"authorId": "35188328", "name": "V. Belov"}, {"authorId": "104314661", "name": "A. Tatarintsev"}, {"authorId": "2228832", "name": "E. Nikulchev"}], "citations": [{"paperId": "23b2cc23c2755fef91376f72093961019edb4664", "title": "Design and Application of Dance Teaching and Evaluation System Based on Big Data"}, {"paperId": "6d053ddb07a0a28b311afa1a5f407bf3c380cd56", "title": "Extremum in the problem of paired comparisons"}, {"paperId": "7e707fa95af9ced2d8055b20e258f95d8ac6d595", "title": "Tourist Attraction Recommendation Method Based on Megadata and Artificial Intelligence Algorithm"}, {"paperId": "5edeef78619eeb7031408d9362cac53586a50ac2", "title": "Storage method of multi-channel lidar data based on tree structure"}, {"paperId": "73cc5297488135c07d9f42a7d483dc28aafac507", "title": "Experimental Characteristics Study of Data Storage Formats for Data Marts Development within Data Lakes"}, {"paperId": "7f32e7443cb2939ee32ee3fa1f46ecf559a02209", "title": "Technology Stack Selection Model for Software Design of Digital Platforms"}, {"paperId": "1dfde2203be0dfa7a67124e462d6431d09ee14ac", "title": "A Novel Big Data Storage Reduction Model for Drill Down Search"}, {"paperId": "ad5bb1823b2d5ec3299d90a671f377208715daea", "title": "ParaDist-HMM: A Parallel Distributed Implementation of Hidden Markov Model for Big Data Analytics using Spark"}, {"paperId": "8dccc035d440fae48e469c8baba8d2bd2918eab2", "title": "Analysis of Big Data Storage Tools for Data Lakes based on Apache Hadoop Platform"}, {"paperId": "3ececca968ef820b0a6e1419389beb7b8121717a", "title": "Comparative Analysis of Hadoop MapReduce and Spark Based on People's Livelihood Appeal Data"}]}
