{"paperId": "a8da2c2a2d635f9601eb68ac2ee75ee781678e0b", "publicationVenue": {"id": "8d848812-c4dd-4524-a6ac-5f5822355b19", "name": "International journal of recent technology and engineering", "type": "journal", "alternate_names": ["Int j recent technol eng"], "issn": "2277-3878", "url": "https://www.ijrte.org/"}, "title": "Parallel Semi-Supervised Big Data Clustering Based on Mapreduce Technology", "abstract": "In the area of information technology, a speedy sensational technology is big data. Big data brings tremendous challenges to extract valuable hidden knowledge. Data mining techniques can be used over big data to extract valuable knowledge for decision making. Big data results in high heterogeneity because it consists of various inter-related kinds of objects such as audios, texts, and images. In addition to this, the inter-related kinds of objects carry different information. So, in this paper clustering techniques are introduced to separate objects into several clusters. It also reduces the computational complexity of classifiers. A Possibilistic c-Means (PCM) algorithm was introduced to group the objects in big data. PCM replicated the characteristic of each object to different clusters effectively and it had capability to avoid the corruption of noise in the clustering process. However, PCM is not more efficient for big data and it cannot confine the complex correlation over multiple modalities of the heterogeneous data objects. So, a Parallel Semi-supervised Multi-Ant Colonies Clustering (PSMACC) is introduced for big data clustering. Initially, the PSMACC splits the data into number of partitions and each partition is processed in mappers. Each mapper generates a diverse collection of three clustering components using the semisupervised ant colony clustering algorithm with various moving speeds. Then, a hyper graph model was used to combine three clustering components. Finally, two constraints such as MustLink (ML) and Cannot-Link (CL) are included to form a consensus clustering. Finally, the intermediate results of each mapper are combined in the reducer. However, the overhead of iteration in PSMACC is overwhelming which affects the performance of PSMACC. So, a Parallel Semi-supervised MultiImperialist Competitive Algorithm (PSMICA) is proposed to cluster the big data. In PSMICA, each mapper processes the ICA where initial population is called countries. Some of the best countries in the population chosen as the imperialists and the remaining countries form the colonies of these imperialists. The colonies move towards the imperialists based on the distance between them. The intermediate results of each mapper are combined in reducer to get the final clustering result.", "venue": "International journal of recent technology and engineering", "year": 2019, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2019-11-30", "journal": {"name": "International Journal of Recent Technology and Engineering"}, "authors": [{"authorId": "2289045248", "name": "Duraisamy Amsaveni M"}], "citations": [{"paperId": "42e25bf06371b7522adcb1d8edd5189f66e05a6b", "title": "Big Data Classification Based On Forest Deep Neural Network"}]}
