{"paperId": "a8e8632616a24ceacb33cbeb84431de8525de68d", "publicationVenue": null, "title": "Towards Sustainable IoT Ecosystem", "abstract": "As the world is moving towards industry 4.0, it is estimated that in the near future billions of IoT devices will be interconnected over the Internet. The open and heterogeneous nature of IoT environment makes it vulnerable to adversarial attacks. To maintain sustainability in IoT ecosystem, this paper evaluates some of the recent IoT schemes based on key security features i.e. authentication, confidentiality, trust etc. These schemes are classified according to three-layer IoT architecture. Based on our findings, some of these solutions are applicable at physical layer while others are at network, and application layers. However, none of these schemes can provide end-to-end solution for IoT environment. Therefore, our work provides a roadmap for future research directions in IoT domain to design robust security schemes for IoT environment, thus can achieve sustainability in IoT ecosystem.", "venue": "2020 2nd International Conference on Industrial Electrical and Electronics (ICIEE)", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2020-10-20", "journal": {"name": "2020 2nd International Conference on Industrial Electrical and Electronics (ICIEE)", "pages": "135-138"}, "authors": [{"authorId": "2034272520", "name": "Shafiq Ul Rehman"}, {"authorId": "144375186", "name": "Parminder Singh"}, {"authorId": "144720579", "name": "S. Manickam"}, {"authorId": "9459895", "name": "S. Praptodiyono"}], "citations": [{"paperId": "c7eb57da9f633a6d2eeb8ddeed27a3e9d417fd83", "title": "Challenges in promoting the Internet of Things Ecosystem for a government"}, {"paperId": "215b5329597b4a3ad711465dc125569596b5337d", "title": "Deep Learning in Security of Internet of Things"}, {"paperId": "435fb1c66104c2e415365f877646bae368ad4b75", "title": "Industrial Internet of Things on integrated preventive maintenance and enterprise-resource-planning systems: A case study of fastener forming manufacturing processes"}, {"paperId": "b918f87251a73bd983a454a59b8468ae80d71c7d", "title": "IoT Intrusion Detection Taxonomy, Reference Architecture, and Analyses"}]}
