{"paperId": "a8ec908e0304fbba71368a796cb15d7d4c0ff7ac", "publicationVenue": {"id": "8e1bd4b5-d5b2-4e22-ba0a-01fe5568d472", "name": "Remote Sensing", "type": "journal", "alternate_names": ["Remote Sens"], "issn": "2315-4675", "alternate_issns": ["2072-4292"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169233", "alternate_urls": ["https://www.mdpi.com/journal/remotesensing", "http://www.mdpi.com/journal/remotesensing", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169233"]}, "title": "Data-Driven Landslide Spatial Prediction and Deformation Monitoring: A Case Study of Shiyan City, China", "abstract": "Landslide susceptibility mapping (LSM) is significant for landslide risk assessment. However, there remains no consensus on which method is optimal for LSM. This study implements a dynamic approach to landslide hazard mapping by integrating spatio-temporal probability analysis with time-varying ground deformation velocity derived from the MT-InSAR (Multi-Temporal InSAR) method. Reliable landslide susceptibility maps (LSMs) can inform landslide risk managers and government officials. First, sixteen factors were selected to construct a causal factor system for LSM. Next, Pearson correlation analysis, multicollinearity analysis, information gain ratio, and GeoDetector methods were applied to remove the least important factors of STI, plan curvature, TRI, and slope length. Subsequently, information quantity (IQ), logistic regression (LR), frequency ratio (FR), artificial neural network (ANN), random forest (RF), support vector machine (SVM), and convolutional neural network (CNN) methods were performed to construct the LSM. The results showed that the distance to a river, slope angle, distance from structure, and engineering geological rock group were the main factors controlling landslide development. A comprehensive set of statistical indicators was employed to evaluate these methods’ effectiveness; sensitivity, F1-measure, and AUC (area under the curve) were calculated and subsequently compared to assess the performance of the methods. Machine learning methods’ training and prediction accuracy were higher than those of statistical methods. The AUC values of the IQ, FR, LR, BP-ANN, RBF-ANN, RF, SVM, and CNN methods were 0.810, 0.854, 0.828, 0.895, 0.916, 0.932, 0.948, and 0.957, respectively. Although the performance order varied for other statistical indicators, overall, the CNN method was the best, while the BP-ANN and RBF-ANN method was the worst among the five examined machine methods. Hence, adopting the CNN approach in this study can enhance LSM accuracy, catering to the needs of planners and government agencies responsible for managing landslide-prone areas and preventing landslide-induced disasters.", "venue": "Remote Sensing", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-11-06", "journal": {"name": "Remote. Sens.", "pages": "5256", "volume": "15"}, "authors": [{"authorId": "2053802956", "name": "Yifan Sheng"}, {"authorId": "2265727773", "name": "Guangli Xu"}, {"authorId": "2179339448", "name": "Bijing Jin"}, {"authorId": "2265714636", "name": "Chao Zhou"}, {"authorId": "30504085", "name": "Yuanyao Li"}, {"authorId": "2108921027", "name": "Weitao Chen"}], "citations": [{"paperId": "b72f4f29290adff48fa85610e3417d20c3df8b74", "title": "Integrating Machine Learning Ensembles for Landslide Susceptibility Mapping in Northern Pakistan"}, {"paperId": "13f50d25c4b0520f5d5484f6f67669da8c7f71ca", "title": "Surface Deformation Prediction Model of High and Steep Open-Pit Slope Based on APSO and TWSVM"}, {"paperId": "3a46f307794fae284ed485df5b0f021995d90674", "title": "Dynamic landslide susceptibility mapping based on the PS-InSAR deformation intensity."}, {"paperId": "0bcba4d57ba04b626d9839e673a1c104b84b36b8", "title": "Modelling landslide susceptibility prediction: A review and construction of semi-supervised imbalanced theory"}]}
