{"paperId": "a8fc3745ff459e938c3204c78ac09674ab743fc8", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Transformation vs Tradition: Artificial General Intelligence (AGI) for Arts and Humanities", "abstract": "Recent advances in artificial general intelligence (AGI), particularly large language models and creative image generation systems have demonstrated impressive capabilities on diverse tasks spanning the arts and humanities. However, the swift evolution of AGI has also raised critical questions about its responsible deployment in these culturally significant domains traditionally seen as profoundly human. This paper provides a comprehensive analysis of the applications and implications of AGI for text, graphics, audio, and video pertaining to arts and the humanities. We survey cutting-edge systems and their usage in areas ranging from poetry to history, marketing to film, and communication to classical art. We outline substantial concerns pertaining to factuality, toxicity, biases, and public safety in AGI systems, and propose mitigation strategies. The paper argues for multi-stakeholder collaboration to ensure AGI promotes creativity, knowledge, and cultural values without undermining truth or human dignity. Our timely contribution summarizes a rapidly developing field, highlighting promising directions while advocating for responsible progress centering on human flourishing. The analysis lays the groundwork for further research on aligning AGI's technological capacities with enduring social goods.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-10-30", "journal": {"name": "ArXiv", "volume": "abs/2310.19626"}, "authors": [{"authorId": "2145977326", "name": "Zheng Liu"}, {"authorId": "2257102397", "name": "Yiwei Li"}, {"authorId": "2263885289", "name": "Qian Cao"}, {"authorId": "2264382833", "name": "Junwen Chen"}, {"authorId": "2263682353", "name": "Tianze Yang"}, {"authorId": "2263593041", "name": "Zihao Wu"}, {"authorId": "2263705384", "name": "John Hale"}, {"authorId": "2263573166", "name": "John Gibbs"}, {"authorId": "2264167933", "name": "Khaled Rasheed"}, {"authorId": "2238404369", "name": "Ninghao Liu"}, {"authorId": "2240534117", "name": "Gengchen Mai"}, {"authorId": "2254792886", "name": "Tianming Liu"}], "citations": [{"paperId": "3d6197e4ab55a3a2785ce5934e48cfbe9fe9bf04", "title": "Revolutionizing Finance with LLMs: An Overview of Applications and Insights"}, {"paperId": "efc5e94635a850ede9c1f8dbce65d5dc536f3bfb", "title": "Understanding LLMs: A Comprehensive Overview from Training to Inference"}, {"paperId": "62f803b246355d5521a00ea44046a7f9b9b080c8", "title": "Exploration of Virtual Simulation Technology in Art and Design Education"}]}
