{"paperId": "a93ca4428eb1976d1fdefa0f21c2e41b5bdcf736", "publicationVenue": null, "title": "A SURVEY OF KEY DISTRIBUTION IN THE CONTEXT OF INTERNET OF THINGS", "abstract": "In recent years, with massive advancements in the Internet, the world is witnessing an evolution of smart environments facilitated by the deployment of the Internet of Things (IoT). IoT refers to a system of interrelated users and objects that are interconnected and have a significant impact on our lives. However, one of the most important challenges facing the ubiquitous adoption of IoT technology is security. In this regard, key distribution refers to the core process of setting up secure connection through a communication channel. This paper surveys the status of research until 2019 related to key distribution schemes in the context of IoT. Moreover, the classification of a key distribution is presented. In this study, we have conducted comparisons between different key distribution schemes in terms of memory storage, communication costs, and computation costs. Additionally, we propose a new taxonomy of symmetric key distribution while proposing a hybrid hierarchical architecture for the key distribution in the context of fog computing. Relevant observations and inferred recommendations are also given as one of the contribution of this paper. On the basis of these recommendations, a hybrid key distribution architecture is proposed to better enable new technologies of cloud and fog computing over IoT.", "venue": "", "year": 2019, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": null, "journal": null, "authors": [{"authorId": "114388844", "name": "Orieb Abualghanam"}, {"authorId": "3222259", "name": "Mohammad Qatawneh"}, {"authorId": "1921183", "name": "Wesam A. Almobaideen"}], "citations": [{"paperId": "238be6da11ff829f647624e7f089b4006875e724", "title": "A New Blockchain-Based Authentication Framework for Secure IoT Networks"}, {"paperId": "b0f9bb9a4dd3de39126b66c7c6137145ca924183", "title": "A Comprehensive Survey for IoT Security Datasets Taxonomy, Classification and Machine Learning Mechanisms"}, {"paperId": "23d5bfd879c016249f32bd96b6886926b4b2afb1", "title": "Use of blockchain in the internet of things: a survey"}, {"paperId": "3cd35d36a91700e5333ea6ed469b8b84d2e89770", "title": "A Systematic Literature Review on Symmetric and Asymmetric Encryption Comparison Key Size"}, {"paperId": "aecd2813546aa3f2dc3320c84d5fb64cd56952d0", "title": "Fusion-based anomaly detection system using modified isolation forest for internet of things"}, {"paperId": "a346f1ad1775f962022ad2edb146a4c3f2fc3474", "title": "An improved PIO feature selection algorithm for IoT network intrusion detection system based on ensemble learning"}, {"paperId": "a45d520cee2a716e3d0805ccb291f4bc9be2442a", "title": "A new hierarchical architecture and protocol for key distribution in the context of IoT-based smart cities"}, {"paperId": "6cbf495efc30df1b9d3218bd07469ea0a562fefb", "title": "Blockchain technology as a Fog computing security and privacy solution: An overview"}, {"paperId": "92d11174556d1cdd1ffa64c319a23d1eed35befc", "title": "Blockchain Technology for Preventing Counterfeit in Health Insurance"}, {"paperId": "e60878a0a546a471af3eaf744978a0b2daf26e2e", "title": "IMPLEMENTATION OF BLOM’S KEY PREDISTRIBUTION SCHEME BY USING ELLIPTIC CURVE CRYPTOGRAPHY"}, {"paperId": "e65d28c26273fb293e5c54a30a6e7238f7fb2c80", "title": "Object Authentication in the Context of the Internet of Things: A Survey"}, {"paperId": "0e3e332825ff5fd83157e75dc080b31db7484208", "title": "FOG COMPUTING ARCHITECTURE, BENEFITS, SECURITY, AND PRIVACY, FOR THE INTERNET OF THING APPLICATIONS: AN OVERVIEW"}, {"paperId": "ec9f55cecd48fd29e8b51acf06c61cfdff38f50a", "title": "A BLOCKCHAIN-BASED SYSTEM FOR PREVENTING DRUG COUNTERFEIT"}, {"paperId": "7305aa458629df9e4e3e466bee8fcd4438503153", "title": "A BLOCKCHAIN-BASED SYSTEM TOWARDS OVERCOMING FRAUD IN FINANCIAL INSTITUTIONS"}, {"paperId": "4c7a24c745e8abfe939876f5d9c252df7f73b3fa", "title": "BLOCKCHAIN-BASED E-VOTING SYSTEM FOR ELECTIONS IN JORDAN"}]}
