{"paperId": "a952f014fd103117aae580225b9f2dd8941b516a", "publicationVenue": {"id": "5308fbd2-d9e5-4271-a5ef-5f5e1f6ce1bf", "name": "IEEE European Test Symposium", "type": "conference", "alternate_names": ["ETS", "IEEE Eur Test Symp"], "url": "http://www.ieee-ets.org/"}, "title": "Impact of Atmospheric and Space Radiation on Sensitive Electronic Devices", "abstract": "Studying the radiation effects on electronic devices is essential for avionics and space systems. The shrinking technology nodes and increasing density of devices enhance the sensitivity of electronic systems to ionizing radiation. Due to their crucial role, memories and processors are the highest contributors to soft errors in systems, making them the best candidates for studying these effects. This work introduces the radiation environment in space and atmosphere and the main effects that the different types of ionizing particles that are present in these environments may produce on electronic devices. Furthermore, mainly focusing on Single-Event Effects (SEEs), it presents approaches and tools for modeling SEEs and their impact on memories and microprocessors. Additionally, experimental results targeting a Commercial-Off-The-Shelf self-refresh Dynamic RAM are presented. These experiments are based on radiation test campaigns in particle accelerators with neutrons and protons. Finally, an overview of issues and mitigation techniques for microprocessors is exposed.", "venue": "IEEE European Test Symposium", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-05-23", "journal": {"name": "2022 IEEE European Test Symposium (ETS)", "pages": "1-10"}, "authors": [{"authorId": "1379947696", "name": "Lucas Matana Luza"}, {"authorId": "2561706", "name": "F. Wrobel"}, {"authorId": "1730226", "name": "L. Entrena"}, {"authorId": "1746253", "name": "L. Dilillo"}], "citations": [{"paperId": "9d21005ff84fe3c50aa2f3ecf98cf1d20933ba53", "title": "Heavy Ion Energy Deposition and SEE Intercomparison Within the RADNEXT Irradiation Facility Network"}, {"paperId": "3eed9f6234c21acac6ba1024c3331901449d475e", "title": "Correlations Between Space Weather Parameters During Intense Geomagnetic Storms: Analytical Study"}]}
