{"paperId": "a962e873d92d86b4dbeb600af92a11c2c43d638f", "publicationVenue": {"id": "fcad2179-afdc-4360-ad8b-8b714f64dab3", "name": "AIMS Mathematics", "alternate_names": ["AIM Math"], "issn": "2473-6988", "url": "https://www.aimspress.com/journal/Math", "alternate_urls": ["https://www.aimspress.com/journal/Math/archive.html"]}, "title": "Big data security challenges and strategies", "abstract": "Big data, a recently popular term that refers to a massive collection of very large and complex data sets, is facing serious security and privacy challenges. Due to the typical characteristics of big data, namely velocity, volume and variety associated with large-scale cloud infrastructures and the Internet of Things (IoT), traditional security and privacy mechanisms are inadequate and unable to cope with the rapid data explosion in such a complex distributed computing environment. With big data analytics being widely used by businesses and government for decision making, security risk mitigation plays an important role in big data infrastructures worldwide. Traditional security mechanisms have failed to cope with the scalability, interoperability and adaptability of contemporary technologies that are required for big data. This paper takes an exploratory initial step using first principles to address this gap in literature. Firstly, we establish the current trends in big data comprehensively by identifying eleven Vs as important dimensions of big data, which form the contributing factors having an impact on the impending security problem. Next, we map the eleven Vs to the three phases of big data life cycle in order to unearth the major security and privacy challenges of big data. Finally, the paper provides four practical strategies adapted from contemporary technologies such as data provenance, encryption and access control, data mining and blockchain, identifying their associated real implementation examples. This work would pave way for future research investigations in this important big data security arena.", "venue": "AIMS Mathematics", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2019-07-01", "journal": {"name": "AIMS Mathematics"}, "authors": [{"authorId": "145710905", "name": "S. Venkatraman"}, {"authorId": "114793316", "name": "R. Venkatraman"}], "citations": [{"paperId": "09da8849fa67f59442bca6bf46c8f1d86b549ffc", "title": "Revolutionizing Telehealthcare: Cloud Computing as the Catalyst for a New Medical Frontier"}, {"paperId": "a09e87bee914bfe95fba631b08eb019ea7701a1f", "title": "Data Security Challenges in AI-Enabled Medical Device Software"}, {"paperId": "0164428bf84b04eff0997a24237aebd7784c2f26", "title": "Securing an Authenticated Privacy Preserving Protocol in a Group Signature Scheme Based on a Group Ring"}, {"paperId": "bc4b762e93ec8300e062fb6c26b60f87ced99255", "title": "Sustainable data governance in the era of global data security challenges in Nigeria: A narrative review"}, {"paperId": "933e09c867524f3ebf889a193c846a50e000b7ca", "title": "A 5G-Based Big Data Security Access Processing Method and Device"}, {"paperId": "5f6e20eef611ea5257db246a8cac11cce344e241", "title": "The Security Challenges of Big Data Analytics: A Systematic Literature Review"}, {"paperId": "1a3342e40695c8408d1190d6b947476fba6b7573", "title": "A key review on security and privacy of big data: issues, challenges, and future research directions"}, {"paperId": "895d6ccadeff647ee0bc86b79f01548cd586d5e1", "title": "Data Architectures’ Evolution and Protection"}, {"paperId": "3acaf0ef1181e5c61590f61b5bfb646164f967d6", "title": "Estate Surveyors and Valuers’ Perception of the Role of Big Data in Property Marketing in Lagos, Nigeria"}, {"paperId": "bf34de60adf2fd496435c6e4023081e077a58f52", "title": "An application of data mining algorithms for predicting factors affecting Big Data Analysis adoption readiness in SMEs."}, {"paperId": "4ce4d679f604bcf42b634fe7bc3b8f7969e93615", "title": "Conceptualizing customer value in data-driven services and smart PSS"}, {"paperId": "f33dcccc1a2034ebce3088b6f664f8a5280f68d1", "title": "Security policies by design in NoSQL document databases"}, {"paperId": "29054f092ca678a7c71c43dd1b1a201485970ee2", "title": "A Secure Experimentation Sandbox for the design and execution of trusted and secure analytics in the aviation domain"}, {"paperId": "3ad50910b934d5665c3358e90ef8dbb63643772e", "title": "A Proposed Framework for Secure Data Storage in a Big Data Environment Based on Blockchain and Mobile Agent"}, {"paperId": "2e50675439a2bf21e5f2b80be26af4b66d2d8fce", "title": "A Survey on RISC-V Security: Hardware and Architecture"}, {"paperId": "ae2fbb913c3b833c5c073c9f30042edf04277d42", "title": "Using Hadoop Technology to Overcome Big Data Problems by Choosing Proposed Cost-efficient Scheduler Algorithm for Heterogeneous Hadoop System (BD3)"}, {"paperId": "05b572626b467222d8610ab5a9d678854d505924", "title": "Analysis of the implementation of Blockchain as a mechanism for digital and transparent food traceability in Peruvian social programs"}, {"paperId": "eab4d0c7683e269153dd9c2e6c793f954544c838", "title": "Fifty-Six Big Data V’s Characteristics and Proposed Strategies to Overcome Security and Privacy Challenges (BD2)"}, {"paperId": "8966a93a7ad91cd1245e72aabc2d5911754cf23e", "title": "Observations on big data concerning storage and security management"}, {"paperId": "d777128797c07e10360b7ebbb69ec92ceb79b5da", "title": "New Blockchain Based Special Keys Security Model With Path Compression Algorithm for Big Data"}, {"paperId": "7571595523ff50524dd17ec5af99a80313e1e8fe", "title": "When Security Meets Velocity: Modeling Continuous Security for Cloud Applications using DevSecOps"}, {"paperId": "bac12b576fc695cc8736d32afafd9e58cd8c6e09", "title": "Big Data-Driven Privacy and Security Issues and Challenges"}, {"paperId": "8ac580c099c52fc80b0511f5ce91fcb9886a1850", "title": "Social Media Big Data Analytics: Security Vulnerabilities and Defenses"}]}
