{"paperId": "a96648f16b9704bc04764753e4145f3065659998", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "RINAS: Training with Dataset Shuffling Can Be General and Fast", "abstract": "Deep learning datasets are expanding at an unprecedented pace, creating new challenges for data processing in model training pipelines. A crucial aspect of these pipelines is dataset shuffling, which significantly improves unbiased learning and convergence accuracy by adhering to the principles of random sampling. However, loading shuffled data for large datasets incurs significant overhead in the deep learning pipeline and severely impacts the end-to-end training throughput. To mitigate this, current deep learning systems often resort to partial dataset shuffling, sacrificing global randomness to maintain acceptable training throughput on large datasets, still leaving global shuffling efficiency issues not fully explored. In this work, we present RINAS, a data loading framework that systematically addresses the performance bottleneck of loading global shuffled datasets. Our key contribution is to offer an intra-batch unordered data fetching approach, which unleashes unexplored parallelism of data loading. We implement RINAS under the PyTorch framework for common dataset libraries HuggingFace and TorchVision. Our experimental results show that RINAS improves the throughput of general language model training and vision model training by up to 59% and 89%, respectively.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-04", "journal": {"name": "ArXiv", "volume": "abs/2312.02368"}, "authors": [{"authorId": "2198488182", "name": "Tianle Zhong"}, {"authorId": "2269787853", "name": "Jiechen Zhao"}, {"authorId": "2269860276", "name": "Xindi Guo"}, {"authorId": "2269775613", "name": "Qiang Su"}, {"authorId": "2265384039", "name": "Geoffrey Fox"}], "citations": []}
