{"paperId": "a967c530bc46eab917f57f427b1efa14282499f1", "publicationVenue": null, "title": "Spark on entropy: A reliable & efficient scheduler for low-latency parallel jobs in heterogeneous cloud", "abstract": "In heterogeneous cloud, the provision of quality of service (QoS) guarantees for on-line parallel analysis jobs is much more challenging than off-line ones, mainly due to the many involved parameters, unstable resource performance, various job pattern and dynamic query workload. In this paper we propose an entropy-based scheduling strategy for running the on-line parallel analysis as a service more reliable and efficient, and implement the proposed idea in Spark. Entropy, as a measure of the degree of disorder in a system, is an indicator of a system's tendency to progress out of order and into a chaotic condition, and it can thus serve to measure a cloud resource's reliability for jobs scheduling. The key idea of our Entropy Scheduler is to construct the new resource entropy metric and schedule tasks according to the resources ranking with the help of the new metric so as to provide QoS guarantees for on-line Spark analysis jobs. Experiments demonstrate that our approach significantly reduces the average query response time by 15% - 20% and standard deviation by 30% - 45% compare with the native Fair Scheduler in Spark.", "venue": "2015 IEEE 40th Local Computer Networks Conference Workshops (LCN Workshops)", "year": 2015, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2015-10-26", "journal": {"name": "2015 IEEE 40th Local Computer Networks Conference Workshops (LCN Workshops)", "pages": "708-713"}, "authors": [{"authorId": "3030053", "name": "Huankai Chen"}, {"authorId": "2112315982", "name": "Frank Z. Wang"}], "citations": [{"paperId": "2f4445f19564770e5aa8426248b9c13e58ea244c", "title": "Optimization for resource management in heterogeneous spark clusters"}, {"paperId": "e6574f743373183bb37f1c778e780157da73c2a9", "title": "Multi-objective Virtual Machine Selection in Cloud Data Centers Using Optimized Scheduling"}, {"paperId": "3ea181189d400d5d9fec769df02fe8eeb589a5e0", "title": "A Comparative Study of Spark Schedulers' Performance"}, {"paperId": "f8e68d4d6f399a9ed1fea6cbeb96b6b510b547b9", "title": "An energy-aware scheduling algorithm for big data applications in Spark"}, {"paperId": "a6b1c6a8b4cca54d9c55fcac71d8769d646e3703", "title": "Data-Intensive Workflow Management: For Clouds and Data-Intensive and Scalable Computing Environments"}, {"paperId": "5a4e95148153102120de48ba689bb53068974dc3", "title": "SLA based healthcare big data analysis and computing in cloud network"}, {"paperId": "f115c7844e8c9b86e1d5e678d08856bbc1284bd5", "title": "Comparative Analysis of Energy-Efficient Scheduling Algorithms for Big Data Applications"}, {"paperId": "a7de419f5a6fbfa7c5579cf9499a168cf2077c14", "title": "Entropy4Cloud: Using Entropy-Based Complexity to Optimize Cloud Service Resource Management"}, {"paperId": "ab6891d27a050f8ae6e2f168e53b2bfb377ae193", "title": "Using information theory principles to schedule real-time tasks"}, {"paperId": "7c59c44c9b3ae96b56701502c33bfbbf886f5e68", "title": "Entropy-based resource management in complex cloud environment"}, {"paperId": "1c0d5712142090444a6adf39033c7b871343e027", "title": "A SLA-based Spark cluster scaling method in cloud environment"}, {"paperId": "177444a7447df048b13cd01dc1d7775577647b1c", "title": "Complexity Reduction: Local Activity Ranking by Resource Entropy for QoS-Aware Cloud Scheduling"}, {"paperId": "655d8bcffbd0f3351e70ba5ad197a8cb9b32e0c2", "title": "An overview on cloud computing platform spark for Human Genome mining"}, {"paperId": "45b092e4a04b57fd632ce43e9de56c8238646dc0", "title": "A Novel Task Provisioning Approach Fusing Reinforcement Learning for Big Data"}]}
