{"paperId": "a96eb32a48d2069fecffa775eb3423e0f646beb7", "publicationVenue": {"id": "501c1070-b5d2-4ff0-ad6f-8769a0a1e13f", "name": "Wireless Communications and Mobile Computing", "type": "journal", "alternate_names": ["Wirel Commun Mob Comput"], "issn": "1530-8669", "url": "https://www.hindawi.com/journals/wcmc/", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/15308677", "http://www.interscience.wiley.com/jpages/1530-8669/"]}, "title": "Implementation of Cloud Computing Protocol in E-Learning for Future Wireless Systems", "abstract": "Schooling system is rapidly shifting according to time. The 4G and 5G machineries are engineered to work flawlessly in heterogeneous platforms unlike 2G, 3G, and 4G wireless networks. New educational techniques are introduced for different environmental needs and E-learning, which is getting popular around the world, and wireless networking plays the vital role in it. E-learning is the requirement of every educational institute. There are a number of problems in the existing prototypes which need to be addressed and improved. This study provides the prototype for E-learning to make the higher education system more efficient. Especially, for the students who need distance learning and an online learning system, this research proposes a user-friendly cloud network infrastructure environment. Machine learning and cloud have strong relation in cloud computing; we store big amount of customer data but to analyze the data and create chatbots, we need machine learning algorithms. We need to enhance the existing prototype for the betterment of the higher education system in rural areas such a time of this COVID-19 pandemic. For this purpose, the existing prototype is critically examined. To achieve this factor why and how E-learning is familiar to the students of rural areas in developing countries, it was analyzed, as the method of education using a platform and interpreting the results. The researcher tried to discover the reason why E-learning is not being applied in higher education. Furthermore, attempts were made to change the existing model by adding the component “Cloud-based structure” that complements and fits the environment of the education system and benefits the long-term sustainability of higher education.", "venue": "Wireless Communications and Mobile Computing", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": null, "publicationDate": "2022-05-09", "journal": {"name": "Wireless Communications and Mobile Computing"}, "authors": [{"authorId": "47045525", "name": "Li-Yuan Hou"}, {"authorId": "2157149871", "name": "Qi Liu"}, {"authorId": "1829686", "name": "J. Nebhen"}, {"authorId": "37153708", "name": "Mueen Uddin"}, {"authorId": "2164780658", "name": "Atika Chaudhary"}], "citations": [{"paperId": "1973d01393ec1ae16ff6cbdb8a01c0359adb498c", "title": "Exploring Cloud Computing for Education in Rural Nepal: Possibilities, Challenges, and Prospect"}, {"paperId": "1ead55149e45d62a26682fc7c3a048bed794a777", "title": "Retracted: Implementation of Cloud Computing Protocol in E-Learning for Future Wireless Systems"}]}
