{"paperId": "a97e69222a5bd705b488c9fb884bfa0966913091", "publicationVenue": {"id": "228761ec-c40a-479b-8309-9dcbe9851bcd", "name": "IEEE Internet of Things Journal", "type": "journal", "alternate_names": ["IEEE Internet Thing J"], "issn": "2327-4662", "url": "https://www.ieee.org/membership-catalog/productdetail/showProductDetailPage.html?product=PER288-ELE", "alternate_urls": ["https://ieeexplore.ieee.org/servlet/opac?punumber=6488907", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6488907", "http://ieee-iotj.org/#"]}, "title": "Power Allocation, Channel Reuse, and Positioning of Flying Base Stations With Realistic Backhaul", "abstract": "While the integration of flying base stations (FlyBSs) into future mobile networks has received plenty of attention, a backhaul link (i.e., the link between a static base station and the FlyBS) is often either fully disregarded or oversimplified. However, the backhaul link and an access link between the FlyBS and users should be managed together to exploit radio resources efficiently. Thus, we introduce a novel framework considering the FlyBSs with a realistic backhaul to maximize the sum capacity of the users. First, we propose a scheme for an association of the users and a transmission power allocation. Thus, we derive a closed-form expression for the optimal allocation of the FlyBSs’ transmission power to individual users to utilize the radio resources at the backhaul and access links in an efficient way. Second, we develop an algorithm for a repositioning of the FlyBSs and a reallocation of the FlyBSs’ transmission power to further improve the overall sum capacity. Third, we design a scheme reusing the access links by multiple users in the coalitions to reduce the FlyBSs’ transmission power. The reduced transmission power allows to further increase the sum capacity of the users via an additional repositioning of the FlyBSs. Alternatively, the reduced transmission power also lowers the level of interference experienced by the underlying devices not communicating via the FlyBSs. Our proposal increases the sum capacity of the users by up to 60% while suppressing the interference to the underlying devices by up to 7.7 dB compared to the state-of-the-art schemes.", "venue": "IEEE Internet of Things Journal", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-02-01", "journal": {"name": "IEEE Internet of Things Journal", "pages": "1790-1805", "volume": "9"}, "authors": [{"authorId": "2073776747", "name": "Pavel Mach"}, {"authorId": "3324541", "name": "Zdenek Becvar"}, {"authorId": "26375479", "name": "Mehyar Najla"}], "citations": [{"paperId": "0618a90c034b18f4cab827e33700fd62f8294ed0", "title": "Joint Route Selection and Power Allocation in Multi-hop Cache-enabled Networks"}, {"paperId": "9fd316421d0b0b2ddca0ad071d185c6b390c6bcd", "title": "Double Deep Reinforcement Learning for Fairness-Aware Sum-Rate Optimization in UxV-Enabled Multi-User Communication Systems"}, {"paperId": "673932ad4758ff107504743ecdeef0a876afafc9", "title": "Channel Reuse for Backhaul in UAV Mobile Networks with User QoS Guarantee"}, {"paperId": "f9015e2c63c8704a6dc433c58ec158bf8be5beb3", "title": "Aerial Base Station Placement via Propagation Radio Maps"}, {"paperId": "09ebfebc4c3c1a0aa3be081ac9f33438b47dc543", "title": "Sum Capacity Maximization in Multi-Hop Mobile Networks with Flying Base Stations"}, {"paperId": "6ef52673e5663714c6e9f838610e3e1aac3c6edf", "title": "QoS-Aware Sum Capacity Maximization for Mobile Internet of Things Devices Served by UAVs"}]}
