{"paperId": "a987c884673086a05bfce40fe4b38e94cf950ed5", "publicationVenue": {"id": "289a8f5a-6cab-4e31-bb4b-821e781ac127", "name": "International Conference on Big Data and Internet of Things", "type": "conference", "alternate_names": ["BDIOT", "BDIoT", "International Conference Big Data and Internet Things", "Int Conf Big Data Internet Thing"]}, "title": "Application of Bluetooth Low Energy-Based Real-Time Location System for Indoor Environments", "abstract": "Current technology such as Bluetooth Low Energy (BLE) provides an efficient way for Real-Time Location System (RTLS). This study proposes a BLE-based Real-Time Location System that utilizes Smartphone and NoSQL database as gateway and data storage respectively. Firstly, we develop a smartphone-based tracking app to gather the location of employees. Secondly, the generated sensor data from gateway is then stored into NoSQL MongoDB. The proposed system was tested for monitoring the movement of employees in the workplace. The results showed that commercial versions of the BLE-based device and the proposed system are sufficiently efficient for RTLS. Furthermore, proposed system is capable of processing a massive input/output of sensor data efficiently when the number of BLE-based devices and users increases.", "venue": "International Conference on Big Data and Internet of Things", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2018-10-24", "journal": {"name": "Proceedings of the 2018 2nd International Conference on Big Data and Internet of Things"}, "authors": [{"authorId": "2913270", "name": "Muhammad Syafrudin"}, {"authorId": "97733731", "name": "Kee-Hee Lee"}, {"authorId": "3212733", "name": "Ganjar Alfian"}, {"authorId": "2108806643", "name": "Jaeho Lee"}, {"authorId": "3353468", "name": "J. Rhee"}], "citations": [{"paperId": "082751fbdf02f1cffd1d0348655b4ef46db69344", "title": "Two-Dimensional Cartesian Coordinate System Educational Toolkit: 2D-CACSET"}, {"paperId": "f4e0b65e263061e14f8d318b0fcb3493a10747ae", "title": "Uma Arquitetura Distribuída IoT para Gestão de Presença e Encontros de Pessoas em Ambientes Internos"}, {"paperId": "f55d3bb5f497ac80228975548af93dd4d9c92cec", "title": "RT-LoRa: A Medium Access Strategy to Support Real-Time Flows Over LoRa-Based Networks for Industrial IoT Applications"}, {"paperId": "550866de70f86d5bf7d18e134adca14b17e620d9", "title": "A Survey on Software-Defined Networks and Edge Computing over IoT"}, {"paperId": "54c14e4b08c6dacb38434be06e50bf12bdd820fb", "title": "Highlights of Practical Applications of Survivable Agents and Multi-Agent Systems. The PAAMS Collection"}]}
