{"paperId": "a9985a90ab0d5b3d0a72e32cec7493554dc194b3", "publicationVenue": {"id": "7806aa90-881a-423a-9faa-27f77bf00ea1", "name": "International Conference \"Information Technology and Interactions\"", "type": "conference", "alternate_names": ["IT&I", "Int Conf \"information Technol Interact"]}, "title": "IoT and GIS Data Platform Solutions in Agricultural", "abstract": "The research is focused on the multidisciplinary process of converting data into useful information. For the applicability of research into a wide range of scientific and research projects, which are focused on obtaining physical information from the surrounding environment, new methods are used to obtain large amounts of data using battery-powered sensors. For example, to use data in the field of precision agriculture, or within the framework of the Smart Building and Smart City management and their resulting presentation to users in a clear and easy to understand form. All using Internet of Things (IoT) and Geographic Information Systems (GIS) technologies. For the overall processing of the resulting and functional whole it is essential to focus on the following sub-disciplines in two basic areas. The first area is IoT, which is mainly concerned with measurement and sensor technology, data transmission, data processing, statistics-Big Data and Artificial Intelligence. And in the second area (GIS), these are primarily tools for real-time data processing, additional data layers, tools for user interface (UI) and user testing when working with UI / UX. It is also important to monitor the economic impact and contact with potential partners, in which some parts of the research could be directly applied in practice. This study outlines, inter alia, possible partners, particularly in the agricultural sector.", "venue": "International Conference \"Information Technology and Interactions\"", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"pages": "198-210"}, "authors": [{"authorId": "2058589920", "name": "Vojtech Novák"}, {"authorId": "1561517150", "name": "L. Kovár"}, {"authorId": "3279370", "name": "M. Stoces"}, {"authorId": "2258612355", "name": "Martin Havránek"}], "citations": []}
