{"paperId": "a9a689581a31175de5bbd8749bc66985e067710f", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Green Cloud Software Engineering for Big Data Processing", "abstract": "Internet of Things (IoT) coupled with big data analytics is emerging as the core of smart and sustainable systems which bolsters economic, environmental and social sustainability. Cloud-based data centers provide high performance computing power to analyze voluminous IoT data to provide invaluable insights to support decision making. However, multifarious servers in data centers appear to be the black hole of superfluous energy consumption that contributes to 23% of the global carbon dioxide (CO2) emissions in ICT (Information and Communication Technology) industry. IoT-related energy research focuses on low-power sensors and enhanced machine-to-machine communication performance. To date, cloud-based data centers still face energy–related challenges which are detrimental to the environment. Virtual machine (VM) consolidation is a well-known approach to affect energy-efficient cloud infrastructures. Although several research works demonstrate positive results for VM consolidation in simulated environments, there is a gap for investigations on real, physical cloud infrastructure for big data workloads. This research work addresses the gap of conducting real physical cloud infrastructure-based experiments. The primary goal of setting up a real physical cloud infrastructure is for the evaluation of dynamic VM consolidation approaches which include integrated algorithms from existing relevant research. An open source VM consolidation framework, Openstack NEAT is adopted and experiments are conducted on a Multi-node Openstack Cloud with Apache Spark as the big data platform. Open sourced Openstack has been deployed because it enables rapid innovation, and boosts scalability as well as resource utilization. Additionally, this research work investigates the performance based on service level agreement (SLA) metrics and energy usage of compute hosts. Relevant results concerning the best performing combination of algorithms are presented and discussed.", "venue": "Sustainability", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2020-11-07", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "49066882", "name": "M. Ganesan"}, {"authorId": "2551983", "name": "A. Kor"}, {"authorId": "2432330", "name": "C. Pattinson"}, {"authorId": "3959591", "name": "É. Rondeau"}], "citations": [{"paperId": "061b3076a9108feb69a0051d0a9eee1c1f173a33", "title": "Determinants of renewable energy consumption in the Fifth Technology Revolutions: Evidence from ASEAN countries"}, {"paperId": "4afe9e049c3012e828933c794f233e7d9d4deda1", "title": "Challenges and Opportunities for Sustainable Engineering: Products, Services, Technologies, and Social Inclusivity with a Gender Approach"}, {"paperId": "1edcc0c156941b14f6325a2e43a28525aa899100", "title": "Factors affecting Environmental Pollution for Green Economy: The Case of ASEAN countries"}, {"paperId": "45b84dc0afc3af45d281d0e0539a48fe7e6c119b", "title": "Exploring Software Development Waste and Lean Approach in Green Perspective"}, {"paperId": "5d5d5f748cf471053808170bcb0e0403ef1c7715", "title": "Digital transformation: exploring cornerstones for construction industry"}, {"paperId": "a400b7f5e1257e4342c910ecd2113b0a6e8f36ba", "title": "Nexus of Innovation, Renewable Consumption, FDI, Growth and CO2 Emissions: The Case of Vietnam"}, {"paperId": "e76015576a2720f731371c889f0e711b47c9d4f6", "title": "Exploring the Benefits of Virtual Reality Adoption for Successful Construction in a Developing Economy"}, {"paperId": "09bd6dfc48e357f5b9c81f88940465c99194f346", "title": "Energy-Efficiency in Cloud Datacenters: A Survey"}, {"paperId": "0cd890be73876e584541370ef1ef84c60f507f90", "title": "Exploring the Cloud Computing Implementation Drivers for Sustainable Construction Projects—A Structural Equation Modeling Approach"}, {"paperId": "21826d0ab7fea3c8f509ca58bd5013049096c223", "title": "Determinants of cloud computing deployment in South African construction organisations using structural equation modelling and machine learning technique"}, {"paperId": "786cfbe118a8ebf96cb60801fe17725c0f885ad6", "title": "Barriers to Digital Technology Deployment in Value Management Practice"}, {"paperId": "a499a8440bc373dce117e7fe421aa15196def05e", "title": "Adoption of cloud computing tools for sustainable construction: a structural equation modelling approach"}, {"paperId": "68b87a7743cb6a4f01d570eb2a519cfa6e7b1880", "title": "Barriers to the implementation of cloud computing for sustainable construction in a developing economy"}, {"paperId": "bcc3c2e53e4f409610778a4d3b9e0322859f50a6", "title": "Exploring the benefits of cloud computing for sustainable construction in Nigeria"}, {"paperId": "83665e6759280cef9aaace71d5e59b552191d49f", "title": "Assessment of Cloud Computing Success Factors for Sustainable Construction Industry: The Case of Nigeria"}]}
