{"paperId": "a9b3c946587a0fd7bd8e91fe4890086e5e7a223d", "publicationVenue": null, "title": "Unstructured Big Data Information Extraction Techniques Survey: Privacy Preservation Perspective", "abstract": "Big data analytics has given us the ability to analyze massive amounts of data, but it has also put privacy at a risk. Personal information may be present in data processed by big data analytics, which must be preserved. Existing privacy preservation strategies, such as anonymization, necessitate dividing a dataset into a set of sensitive, quasi-identifiers and non-sensitive properties. It may be conceivable to have such a distribution with structured data, but it is difficult to detect sensitive features and quasi-identifiers in unstructured data. Big data generates massive amounts of data that are heterogeneous in nature and includes a range of different sorts of data, including text, image, audio and video. Traditional data extraction technologies are ineffective in the context of this massive influx of unstructured big data. This paper present a survey of various information extraction techniques for unstructured big data analytics with a context of privacy preservation.", "venue": "2021 International Conference on Electrical, Computer, Communications and Mechatronics Engineering (ICECCME)", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Conference", "Review"], "publicationDate": "2021-10-07", "journal": {"name": "2021 International Conference on Electrical, Computer, Communications and Mechatronics Engineering (ICECCME)", "pages": "01-06"}, "authors": [{"authorId": "2067344203", "name": "Poonam S. Jadhav"}, {"authorId": "2139916377", "name": "Swarupa S. Bodhe"}, {"authorId": "2673018", "name": "G. Borkar"}, {"authorId": "2260832", "name": "A. Vidhate"}], "citations": [{"paperId": "a0217121bf636cedec07ab55f4fff91c81b3cec5", "title": "Systematic Literature Review of Information Extraction From Textual Data: Recent Methods, Applications, Trends, and Challenges"}]}
