{"paperId": "a9ba4f9c749d0c867d74ffc7b459f680f976a840", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "A Review of Automation and Sensors: Parameter Control of Thermal Treatments for Electrical Power Generation", "abstract": "This review delves into the critical role of automation and sensor technologies in optimizing parameters for thermal treatments within electrical power generation. The demand for efficient and sustainable power generation has led to a significant reliance on thermal treatments in power plants. However, ensuring precise control over these treatments remains challenging, necessitating the integration of advanced automation and sensor systems. This paper evaluates the pivotal aspects of automation, emphasizing its capacity to streamline operations, enhance safety, and optimize energy efficiency in thermal treatment processes. Additionally, it highlights the indispensable role of sensors in monitoring and regulating crucial parameters, such as temperature, pressure, and flow rates. These sensors enable real-time data acquisition, facilitating immediate adjustments to maintain optimal operating conditions and prevent system failures. It explores the recent technological advancements, including machine learning algorithms and IoT integration, which have revolutionized automation and sensor capabilities in thermal treatment control. Incorporating these innovations has significantly improved the precision and adaptability of control systems, resulting in heightened performance and reduced environmental impact. This review underscores the imperative nature of automation and sensor technologies in thermal treatments for electrical power generation, emphasizing their pivotal role in enhancing operational efficiency, ensuring reliability, and advancing sustainability in power generation processes.", "venue": "Italian National Conference on Sensors", "year": 2024, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2024-02-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "24"}, "authors": [{"authorId": "2101285511", "name": "William Gouvêa Buratto"}, {"authorId": "2244335094", "name": "Rafael Ninno Muniz"}, {"authorId": "2148323", "name": "A. Nied"}, {"authorId": "2282788501", "name": "Carlos Frederico de Oliveira Barros"}, {"authorId": "2185894546", "name": "Rodolfo Cardoso"}, {"authorId": "1660917903", "name": "G. V. González"}], "citations": []}
