{"paperId": "a9bd7c9e2b606dadee36dbbe0ca321ae6e83f9ce", "publicationVenue": null, "title": "Explaining automated environments: interrogating scripts, logs, and provenance using voice-assistants", "abstract": "The grand vision of pervasive computing and the Internet of Things (IoT) involves providing people with a range of seamless functionality, be it through automation, information delivery, etc. However, much of the IoT is opaque; it is often difficult for users to uncover and understand how and why particular functionality occurs, the sources of information, the entities involved, and so forth. We argue that automation scripts, as well as logs and provenance records could be leveraged to assist in illuminating the workings of connected and automated environments. This paper explores the use of voice assistants (an accessible, intuitive and increasingly common interface) as a means for allowing users to interrogate what is happening in the IoT systems that surround them. In presenting an exploratory Alexa 'Skill', we discuss several considerations for the implementation of such a system. This work represents a starting point for considering how such assistants could help people better understand---and indeed, evaluate, challenge, and accept---technology that is increasingly pervading our world.", "venue": "UbiComp/ISWC Adjunct", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2019-09-09", "journal": {"name": "Adjunct Proceedings of the 2019 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2019 ACM International Symposium on Wearable Computers"}, "authors": [{"authorId": "2232082", "name": "Chris Norval"}, {"authorId": "144857568", "name": "Jatinder Singh"}], "citations": [{"paperId": "577ea0c8081f53eb3ec39c54952b295b081f4635", "title": "A Room With an Overview: Toward Meaningful Transparency for the Consumer Internet of Things"}, {"paperId": "24ceb0bbd37c8f3d2477363cb758631145239eb0", "title": "Inhabiting Interconnected Spaces: How Users Shape and Appropriate Their Smart Home Ecosystems"}, {"paperId": "3b9d70cb21e2d1e215e90661ffa9aa3435d061b4", "title": "Workshop on Reviewable and Auditable Pervasive Systems (WRAPS)"}, {"paperId": "f856e920c38365475225efaabb5f331a3db4e084", "title": "Two Cases for Traces"}, {"paperId": "020ad58a46965e3394dedea005a25fec02393625", "title": "Towards an accountable Internet of Things: A call for 'reviewability'"}, {"paperId": "911c323ddb42b95f9122a1330116956d85e7de22", "title": "Intelligibility Issues Faced by Smart Speaker Enthusiasts in Understanding What Their Devices Do and Why"}, {"paperId": "634a2e5a5609b60b052ef559ca534829a236524f", "title": "Effectiveness of Using Voice Assistants in Learning: A Study at the Time of COVID-19"}, {"paperId": "2d3d5f9ea16c18fcc4da175d40abfe667cdfd05f", "title": "Designing the Expressivity of Multiple Smart Things for Intuitive and Unobtrusive Interactions"}, {"paperId": "a9900861f3ffe25eb89f696195703d0147fbe597", "title": "How does your Alexa behave?: Evaluating Voice Applications by Design Guidelines Using an Automatic Voice Crawler"}]}
