{"paperId": "a9da29b69c029087d45cb098acc83df942c8762f", "publicationVenue": {"id": "49bb481c-95dc-4e09-a921-95f6c7f78ab8", "name": "Conference of the Open Innovations Association", "type": "conference", "alternate_names": ["FRUCT", "Conf Open Innov Assoc"], "url": "http://fruct.org/"}, "title": "Artificial Intelligence in the IoT Era: A Review of Edge AI Hardware and Software", "abstract": "The modern trend of moving artificial intelligence computation near to the origin of data sources has increased the demand for new hardware and software suitable for such environments. We carried out a scoping study to find the current resources used when developing Edge AI applications. Due to the nature of the topic, the research combined scientific sources with product information and software project sources. The paper is structured as follows. In the first part, Edge AI applications are briefly discussed followed by hardware options and finally, the software used to develop AI models is described. There are various hardware products available, and we found as many as possible for this research to identify the best-known manufacturers. We describe the devices in the following categories: artificial intelligence accelerators and processors, field-programmable gate arrays, system-on-a-chip devices, system-on-modules, and full computers from development boards to servers. There seem to be three trends in Edge AI software development: neural network optimization, mobile device software and microcontroller software. We discussed these emerging fields and how the special challenges of low power consumption and machine learning computation are being taken into account. Our findings suggest that the Edge AI ecosystem is currently developing, and it has its own challenges to which vendors and developers are responding.", "venue": "Conference of the Open Innovations Association", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference", "Review"], "publicationDate": "2022-04-27", "journal": {"name": "2022 31st Conference of Open Innovations Association (FRUCT)", "pages": "320-331"}, "authors": [{"authorId": "2419156", "name": "T. Sipola"}, {"authorId": "68978054", "name": "Janne Alatalo"}, {"authorId": "34697213", "name": "T. Kokkonen"}, {"authorId": "2823680", "name": "M. Rantonen"}], "citations": [{"paperId": "915466578e856a9c670e775cb983bd3fd9d6aa0a", "title": "Enabling edge-driven Dataspace integration through convergence of distributed technologies"}, {"paperId": "da5a3378b9782a1532ffde968edacb83144caa22", "title": "Animal-borne soundscape logger as a system for edge classification of sound sources and data transmission for monitoring near-real-time underwater soundscape"}, {"paperId": "d3f1119d1f917f637d361fa306dc3ebf51eead49", "title": "Privacy-Focused Edge AI-on-IoT with Federated Learning"}, {"paperId": "36929b050d800ba8d250533a9a62765346cdcff6", "title": "Edge AI for Internet of Energy: Challenges and Perspectives"}, {"paperId": "09f6f6941c04859ea9fe955207cb68e43e261b36", "title": "Efficient Neural Networks for Tiny Machine Learning: A Comprehensive Review"}, {"paperId": "4ae95f6dcdf5d4e2269869f23b205b358f2b7b17", "title": "AI-native Interconnect Framework for Integration of Large Language Model Technologies in 6G Systems"}, {"paperId": "b7b6b538a85440e4bae0fc0f4fb6cb8c86f74287", "title": "Edge Artificial Intelligence in Large-Scale IoT Systems, Applications, and Big Data Infrastructures"}, {"paperId": "97c4b190949e3cf0273a6f2433e5e4f130507b77", "title": "Edge AI Inference in Heterogeneous Constrained Computing: Feasibility and Opportunities"}, {"paperId": "155ffb420d75c3c8ce87c87b4053ddbcb6195de9", "title": "Influence of Smart Sensors on Structural Health Monitoring Systems and Future Asset Management Practices"}, {"paperId": "28073c14d6fc448bdab956c9cd934b38cd9dbde1", "title": "Scalable and custom-precision floating-point hardware convolution core for using in AI edge processors"}, {"paperId": "a2176ec25cd5b5f1f8f248f15917bf7494004c79", "title": "Towards autonomous mapping in agriculture: A review of supportive technologies for ground robotics"}, {"paperId": "d8eda71a7333560c9a82466b64a8e0cc89cf7cd7", "title": "Deep Reinforcement Learning Based Multi-Task Automated Channel Pruning for DNNs"}, {"paperId": "cff5f1b5e0c38bc081d309d78befa29432ba6520", "title": "Internet of (Healthcare) Things Based Monitoring for COVID-19+ Quarantine/ Isolation Subjects Using Biomedical Sensors, A Lesson from the Recent Pandemic, and an Approach to the Future."}, {"paperId": "499ef580445c64a2cdca9fd03ec64f03d9559975", "title": "A Survey on Optimization Techniques for Edge Artificial Intelligence (AI)"}, {"paperId": "1f8fc623ba5a91d34717ea46740b135ae5855bf1", "title": "Quick continual kernel learning on bounded memory space based on balancing between adaptation and forgetting"}, {"paperId": "9422d796d39191b0dfc48f239b3e60ef91a7908d", "title": "Pre-Inpainting Convolutional Skip Triple Attention Segmentation Network for AGV Lane Detection in Overexposure Environment"}, {"paperId": "8e8b360b242647841953e6798d2f805e650788f9", "title": "Design, Implementation, and Practical Evaluation of a Voice Recognition Based IoT Home Automation System for Low-Resource Languages and Resource-Constrained Edge IoT Devices: A System for Galician and Mobile Opportunistic Scenarios"}, {"paperId": "c456eaa5d0973c15fcec11be535b91a5b800f634", "title": "The Many Faces of Edge Intelligence"}, {"paperId": "c8ee13f84b35b0555c0997a9d3f9da9535e26f87", "title": "Eﬀicient Neural Networks for Tiny Machine Learning: A Comprehensive Review"}, {"paperId": "255bb3d4b342e5cc8aca65a4ea9057ac3fa0d6b7", "title": "ON INFORMATICS VISUALIZATION"}]}
