{"paperId": "a9eb28e89518ed21e9b6d00cfcf1e064eece995f", "publicationVenue": {"id": "3edbd5e0-8799-420a-9ca8-b35c646c354f", "name": "IEEE Transactions on Instrumentation and Measurement", "type": "journal", "alternate_names": ["IEEE Trans Instrum Meas"], "issn": "0018-9456", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=19", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=19"]}, "title": "Miniature Mobile Robot Detection Using an Ultralow-Resolution Time-of-Flight Sensor", "abstract": "Miniature mobile robots in multirobotic systems require reliable environmental perception for successful navigation, especially when operating in a real-world environment. One of the sensors that have recently become accessible in microrobotics due to their size and cost-effectiveness is a multizone time-of-flight (ToF) sensor. In this research, object classification using a convolutional neural network (CNN) based on an ultralow-resolution ToF sensor is implemented on a miniature mobile robot to distinguish the robot from other objects. The main contribution of this work is an accurate classification system implemented on low-resolution, low-processing power, and low-power consumption hardware. The developed system consists of a VL53L5CX ToF sensor with an $8\\times8$ depth image and a low-power RP2040 microcontroller. The classification system is based on a customized CNN architecture to determine the presence of a miniature mobile robot within the observed terrain, primarily characterized by sand and rocks. The developed system trained on a custom dataset can detect a mobile robot with an accuracy of 91.8% when deployed on a microcontroller. The model implementation requires 7 kB of RAM, has an inference time of 34 ms, and an energy consumption during inference of 3.685 mJ.", "venue": "IEEE Transactions on Instrumentation and Measurement", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Transactions on Instrumentation and Measurement", "pages": "1-9", "volume": "72"}, "authors": [{"authorId": "2247787941", "name": "Jan Pleterski"}, {"authorId": "3483655", "name": "Gašper Škulj"}, {"authorId": "2247786224", "name": "Corentin Esnault"}, {"authorId": "2247778855", "name": "Jernej Puc"}, {"authorId": "9233217", "name": "Rok Vrabič"}, {"authorId": "1950360", "name": "P. Podržaj"}], "citations": []}
