{"paperId": "a9ef175caf475f3b9b90b0bcebc9be8af10f8a3d", "publicationVenue": {"id": "567a5f12-d8a9-49f7-962b-d78b5fc5a6ac", "name": "International Journal of Electrical and Electronic Engineering & Telecommunications", "type": "journal", "alternate_names": ["Int J Electr Electron Eng  Telecommun"], "issn": "2319-2518", "url": "http://ijeetc.com/"}, "title": "A Mobile Production Monitoring System Based on Internet of Thing (IoT) and Random Forest Classification", "abstract": "Production variations are crucial factors that cause the reduction of production efficiency. These variations are often unpredictable and difficult to be interpreted directly from the production activity of the working station. Automated diagnostic of the causes to variations is therefore the key to overcome the issue. The system should also detect and diagnose variations for all the machines which are placed in the same manufacturing line at the same instance to prevent misaligned of production volume. To achieve this, Internet of thing (IoT) technology is proposed. The technology enables automatic data transfer without the need of human intervention. Through IoT, manufacturers are able to keep track the production activity and resolve problems encountered immediately. In addition, a typical random forest classification model is developed to analyze the production patterns and subsequently identify the causes to the unwanted variations. To the best of authors’ knowledge, this paper presents a first-time work on implementation of a mobile production monitoring system based on IoT and random forest classification. The methodology and technical matter to realize the implementation are highlighted and discussed. Overall, the proposed system has been tested accordingly and visualized through a developed mobile application.", "venue": "International Journal of Electrical and Electronic Engineering & Telecommunications", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": {"name": "International Journal of Electrical and Electronic Engineering & Telecommunications"}, "authors": [{"authorId": "2135064084", "name": "Qiu Yu Wong"}, {"authorId": "2100484964", "name": "Yih Bing Chu"}], "citations": [{"paperId": "9dd8b08fa5ac05aca3d830da6bb450bb93ce182f", "title": "A BiLSTM-Based Method for Detecting Time Series Data Anomalies in Power IoT Sensing Terminals"}, {"paperId": "2fed30d94a5130f1cac4eae1f3293e18b8283921", "title": "Digital Twin Coal Mine Underground Substation Based on VR Technology"}, {"paperId": "d59789adf70d633c182febb95dfa7c19b78cdd12", "title": "Development of an efficient cement production monitoring system based on the improved random forest algorithm"}, {"paperId": "0b1be35f3a30f21bfc28142a9ff23a07238faa14", "title": "Design and Research of Distributed Data Acquisition System for Small Waste Incineration Power Plant"}, {"paperId": "fae275932f6f057bac13d39c59126297e2c877c5", "title": "Design and Development of Intelligent Substation Cluster Measurement and Control Device Based on Virtualization Technology"}, {"paperId": "04931eea0e48088d5c0948ef7296e7f4bca91273", "title": "IoT-Based Smart Wireless Communication System for Electronic Monitoring of Environmental Parameters with a Data-Logger"}]}
