{"paperId": "a9f671afcede538be94353a9487921cdbdee2578", "publicationVenue": {"id": "fcbcaf18-8ab1-43e1-a973-604bbc7e344e", "name": "Proceedings of the VLDB Endowment", "type": "journal", "alternate_names": ["Proceedings of The Vldb Endowment", "Proc VLDB Endow", "Proc Vldb Endow"], "issn": "2150-8097", "url": "http://dl.acm.org/toc.cfm?id=J1174", "alternate_urls": ["http://portal.acm.org/toc.cfm?CFID=21632689&CFTOKEN=99329904&WantType=Affiliated%20Organizations&coll=ACM&dl=ACM&id=J1174&idx=J1174&part=affil&title=VLDB%20Endowment&type=periodical"]}, "title": "Epoxy: ACID Transactions Across Diverse Data Stores", "abstract": "Developers are increasingly building applications that incorporate multiple data stores, for example to manage heterogeneous data. Often, these require transactional safety for operations across stores, but few systems support such guarantees. To solve this problem, we introduce Epoxy, a protocol for providing transactions across heterogeneous data stores. We make two contributions. First, we adapt multi-version concurrency control to a cross-data store setting, storing versioning information in record metadata and filtering reads with predicates on metadata so they only see record versions in a global transaction snapshot. Second, we show our design enables an atomic commit protocol that does not require data stores implement the participant protocol of two-phase commit, requiring only durable writes. We implement Epoxy for five data stores: Postgres, Elasticsearch, MongoDB, Google Cloud Storage, and MySQL. We evaluate it by adapting TPC-C and microservice workloads to a multi-data store environment. We find it has comparable performance to the distributed transaction protocol XA on TPC-C while providing stronger guarantees like isolation, and has overhead of <10% compared to a non-transactional baseline on read-mostly microservice workloads and 72% on write-heavy workloads.", "venue": "Proceedings of the VLDB Endowment", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-07-01", "journal": {"name": "Proc. VLDB Endow.", "pages": "2742-2754", "volume": "16"}, "authors": [{"authorId": "2068930056", "name": "Peter Kraft"}, {"authorId": "2117124989", "name": "Qian Li"}, {"authorId": "2157167104", "name": "Xinjing Zhou"}, {"authorId": "2740804", "name": "Peter D. Bailis"}, {"authorId": "145345023", "name": "M. Stonebraker"}, {"authorId": "3046907", "name": "Xiangyao Yu"}, {"authorId": "143834867", "name": "M. Zaharia"}], "citations": [{"paperId": "5b25e0dbd63485ba1ef9a12f7bcbf870509bdb2a", "title": "Ad Hoc Transactions through the Looking Glass: An Empirical Study of Application-Level Transactions in Web Applications"}]}
