{"paperId": "a9fdbc9d28c288efb24ba1d5e0886506cdc9f100", "publicationVenue": {"id": "deedf64a-dd5c-4b33-b345-ff83bfb93d71", "name": "International Symposium on Computer Architecture", "type": "conference", "alternate_names": ["Int Symp Comput Archit", "ISCA"], "url": "http://www.cs.wisc.edu/~arch/www/"}, "title": "Mystique: Enabling Accurate and Scalable Generation of Production AI Benchmarks", "abstract": "Building large AI fleets to support the rapidly growing DL workloads is an active research topic for modern cloud providers. Generating accurate benchmarks plays an essential role in designing the fast-paced software and hardware solutions in this space. Two fundamental challenges to make this scalable are (i) workload representativeness and (ii) the ability to quickly incorporate changes to the fleet into the benchmarks. To overcome these issues, we propose Mystique, an accurate and scalable framework for production AI benchmark generation. It leverages the PyTorch execution trace (ET), a new feature that captures the runtime information of AI models at the granularity of operators, in a graph format, together with their metadata. By sourcing fleet ETs, we can build AI benchmarks that are portable and representative. Mystique is scalable, due to its lightweight data collection, in terms of runtime overhead and instrumentation effort. It is also adaptive because ET composability allows flexible control on benchmark creation. We evaluate our methodology on several production AI models, and show that benchmarks generated with Mystique closely resemble original AI models, both in execution time and system-level metrics. We also showcase the portability of the generated benchmarks across platforms, and demonstrate several use cases enabled by the fine-grained composability of the execution trace.", "venue": "International Symposium on Computer Architecture", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2022-12-16", "journal": {"name": "Proceedings of the 50th Annual International Symposium on Computer Architecture"}, "authors": [{"authorId": "1733353473", "name": "Mingyu Liang"}, {"authorId": "2587709", "name": "Wenyin Fu"}, {"authorId": "2115955952", "name": "Louis Feng"}, {"authorId": "14628718", "name": "Zhongyi Lin"}, {"authorId": "16196567", "name": "P. Panakanti"}, {"authorId": "6396235", "name": "Shengbao Zheng"}, {"authorId": "145647399", "name": "Srinivas Sridharan"}, {"authorId": "3234334", "name": "Christina Delimitrou"}], "citations": [{"paperId": "051a855480c8bcf9c93d462fa4a63ef1d4cee674", "title": "Enabling In-Vitro Serverless Systems Research"}, {"paperId": "a399c4c0353cd05c81c25881d9e60cad9dc25721", "title": "MAD Max Beyond Single-Node: Enabling Large Machine Learning Model Acceleration on Distributed Systems"}, {"paperId": "12d85f6c705a7f395e28d5a673a12d3df15e3e3b", "title": "Chakra: Advancing Performance Benchmarking and Co-design using Standardized Execution Traces"}, {"paperId": "eec9df0cd5be9c8db42246f28ddf1cf2f1bc692d", "title": "Edinburgh Research Explorer Enabling In-Vitro Serverless Systems Research"}]}
