{"paperId": "aa10af7ea70da760541112981e960fa48f044208", "publicationVenue": {"id": "89097a03-8be6-4e2d-ae2c-a6df64c77a06", "name": "Frontiers in Psychology", "type": "journal", "alternate_names": ["Front Psychol"], "issn": "1664-1078", "url": "http://www.frontiersin.org/Cultural_Psychology", "alternate_urls": ["http://frontiersin.org/psychology/", "https://www.frontiersin.org/journals/psychology", "http://journal.frontiersin.org/journal/psychology", "http://www.frontiersin.org/psychology"]}, "title": "An Empirical Study on Drivers’ Willingness to Use Automatic Features of Intelligent Vehicles: A Psychological Empowerment Perspective", "abstract": "With the advancement in AI and related technologies, we are witnessing more remarkable use of intelligent vehicles. Intelligent vehicles use smart automatic features that make travel happier, safer, and efficient. However, not many studies examine their adoption or the influence of intelligent vehicles on user behavior. In this study, we specifically examine how intelligent vehicles’ sensing and acting abilities drive their adoption from the lens of psychological empowerment theory. We identify three dimensions of users’ perceived empowerment (perceived cognitive empowerment, perceived emotional empowerment, and perceived behavioral empowerment). Based on this theory, we argue that product features (sensing and acting in intelligent vehicles) empower users to use the product. Our proposed model is validated by an online survey of 312 car owners who are familiar with driving conditions, the results of this study reveal that driver’s perceived empowerment is vital for using automatic features of intelligent vehicles. Theoretically, this study combines the concept of empowerment with the intelligent-driving scenario and reasonably explains the mechanism of the intelligence of vehicles on users’ behavior intention.", "venue": "Frontiers in Psychology", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-12-16", "journal": {"name": "Frontiers in Psychology", "volume": "12"}, "authors": [{"authorId": "2157466052", "name": "Ting Li"}, {"authorId": "2539035", "name": "Sumeet Gupta"}, {"authorId": "2026446577", "name": "Hong-feng Zhou"}], "citations": [{"paperId": "b7d1e730e9d5e9047eca8c3f4e9e77b4c153005a", "title": "Influence of perceived safety in the technology acceptance model"}, {"paperId": "1877db76792d9e61cf470999b678c14f734a1338", "title": "Building a Better Future Workforce: Digital Dexterity and Psychological Empowerment"}, {"paperId": "0a175cf0f68966dee4fbe9eeedf3f17ba182a793", "title": "Motivation to interaction media: The impact of automation trust and self-determination theory on intention to use the new interaction technology in autonomous vehicles"}]}
