{"paperId": "aa21234fcf568452e265890d19a1a4002e6e1799", "publicationVenue": null, "title": "The learning behaviours of dropouts in MOOCs: A collective attention network perspective", "abstract": null, "venue": "Comput. Educ.", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-07-01", "journal": {"name": "Comput. Educ.", "pages": "104189", "volume": "167"}, "authors": [{"authorId": "71896477", "name": "Jingjing Zhang"}, {"authorId": "2061765404", "name": "M. Gao"}, {"authorId": "2108313906", "name": "Jiang Zhang"}], "citations": [{"paperId": "a10dca27ff168e9f46160899d785ba28efcd79c5", "title": "Data-driven analytics for student reviews in China’s higher vocational education MOOCs: A quality improvement perspective"}, {"paperId": "6f7c9da37c03a388787d4b44c064fd2e2f67398d", "title": "Dropout in online higher education: a systematic literature review"}, {"paperId": "2de003982c2cff7ade5317e28705447f06e15292", "title": "Exploring the Factors Affecting Massive Open Online Course Learning in Higher Education"}, {"paperId": "04e580d2077a67b84a0cddf246260b2c6d5c4bf8", "title": "Understanding College Students’ Behavioral Patterns in a Blended Learning Class"}, {"paperId": "971d9989d3368e6cd80f1fa9701cffaf9f51fa21", "title": "Research on the patterns of the organic growth knowledge production based on a dual perspective of content and behaviour"}, {"paperId": "9fd8e22acf60098837a8cd2dc54d838e6f54fbd6", "title": "Improving learning experience to teach FPGA design at scale"}, {"paperId": "56be7cd630f0822cbc69dd3f39f8d4d3d3ad444b", "title": "Predicting Dropout in Programming MOOCs through Demographic Insights"}, {"paperId": "02b886365bfe251060754c6ab129a567666d400d", "title": "Implementation of Software as a Service to Increase the Scalability of the Merdeka Belajar Policy in Indonesia"}, {"paperId": "40b2f69e466f145bdb675aca2a4b2278c9e725ea", "title": "A familiar peer improves students’ behavior patterns, attention, and performance when learning from video lectures"}, {"paperId": "a1b06f070f0d48eacf7e1d8e1e609c982625b273", "title": "CNN autoencoders and LSTM-based reduced order model for student dropout prediction"}, {"paperId": "bec263b099a0210c585593a6c9cdfa8f266fe323", "title": "Diversified resource access paths in MOOCs: Insights from network analysis"}, {"paperId": "c2aa4add42adb5e6b50f0b26d149a07c19923a4b", "title": "Difficulty level moderates the effects of another’s presence as spectator or co-actor on learning from video lectures"}, {"paperId": "6e050ac446cdd6300af695604345cc6738e6ef04", "title": "Where and what to improve? Design and application of a MOOC evaluation framework based on effective teaching practices"}, {"paperId": "b5b0320883989ee9b6c87903c34634f147b539cb", "title": "Using Learner Reviews to Inform Instructional Video Design in MOOCs"}, {"paperId": "465f2f54a77491266b6cbd063d92d609eca397e8", "title": "MOOCs 2012-2022: An overview"}, {"paperId": "c50c5d38aee6424b87e9e370706f234ff94ec1ec", "title": "Behavioral determinants of hand hygiene compliance among nurses in intensive care units in Hai’l, Saudi Arabia"}, {"paperId": "e9743111910d64d2a5a4f67ec1c4c058bbca1130", "title": "Investigating the Learner Perception on Massive Open Online Courses (MOOCs): A Case Study from Sri Lanka"}, {"paperId": "41ac5ec34b5bdb86504e24edba73b2e36ba43980", "title": "Factors of dropout from MOOCs: a bibliometric review"}, {"paperId": "1806877acbaedd89ede3ee216e8358aa29c07bbf", "title": "Quality Assurance in Distance Education through Data Mining"}, {"paperId": "0b96e7a8336298287329c2b2346b64ba4f4f2d14", "title": "From the learner's perspective: A systematic review of MOOC learner experiences (2008-2021)"}, {"paperId": "96f46d8f8414dcc460f61a095cbe54cfb29f2ac7", "title": "Smart MOOC integrated with intelligent tutoring: A system architecture and framework model proposal"}, {"paperId": "7c165c5ffcd7196e76f28cf042833c187ae08c9f", "title": "Rank biserial stochastic feature embed bivariate kernelized regressive bootstrap aggregative classifier for school student dropout prediction"}, {"paperId": "2fdd97cc9df5940fd18568153dcaf6277c7b6756", "title": "Providing recommendations for communities of learners in MOOCs ecosystems"}, {"paperId": "f8192d5f093369567e65f101d85319454bfbdd7f", "title": "Massive open online course adoption amongst newly graduated health care providers"}, {"paperId": "802d530cd334a3e49228af2d7a889aaaf163cd91", "title": "Video Features, Engagement, and Patterns of Collective Attention Allocation: An Open Flow Network Perspective"}, {"paperId": "afb5d89f8fe62041fabae84cb6b5e877fc6c2004", "title": "Barriers towards the continued usage of massive open online courses: A case study in India"}, {"paperId": "418c83de1484686f7a01f1d1aa4d843286368dee", "title": "Digitization bolstering self-directed learning for information literate adults–A systematic review"}, {"paperId": "4c268130586d315461152801708149ba0a402015", "title": "Personalized training model for organizing blended and lifelong distance learning courses and its effectiveness in Higher Education"}, {"paperId": "450e9c6a6e003d091b045f64eb851a78c80e74fd", "title": "What to Learn Next? Designing Personalized Learning Paths for Re-&Upskilling in Organizations"}, {"paperId": "1cc86e08702bdbdbb869412bb4b541df94368136", "title": "How to Detect At-Risk Learners in Professional Finance MOOCs: Step One"}, {"paperId": "3bb9b8699014c0686995ca79a4bec4a0792f5de2", "title": "Participation and Interaction Patterns of MOOC Learners with Different Learning Achievements: A Collective Attention Network Perspective"}, {"paperId": "8fba5f8f6eac00123d53f3d18d4cdd6eb937204f", "title": "Classmates Enhanced Diversity-Self-Attention Network for Dropout Prediction in MOOCs"}]}
