{"paperId": "aa338db0e5fb99c78a0307cbae11d6bd6d9d035d", "publicationVenue": null, "title": "DRS+: Load Shedding Meets Resource Auto-Scaling in Distributed Stream Processing", "abstract": "Distributed stream processing is nowadays a leading paradigm for managing massive streaming data and performing real-time analytics on such streams. Since data volume and distribution in the input streams often change over time, a dynamic resource scheduler is often employed to ensure that the system meets response time constraints while being cost effective in terms of resource usage. Currently, resource schedulers in distributed streaming systems generally assume that each input must be completely processed, and allocate resources accordingly. In practice, this assumption can often be relaxed, since many stream analytics tasks do not require exact outputs. To our knowledge, however, no existing resource scheduler takes this fact into consideration, leading to unnecessary over-provisioning of resources.This paper presents DRS+, a novel dynamic resource scheduler that integrates load shedding into resource auto-scaling strategies. DRS+ is based on a unified model that establishes the relationship between response time, result accuracy and resource consumption, given the current workload statistics. Using this model, DRS+ computes the best resource allocation plan and load shedding strategy, and executes them through an efficient protocol that minimizes the computation and communication overhead at each operator. We have implemented DRS+ based on Apache Storm, and evaluated it using real dataset. The results demonstrate that DRS+ achieves low resource consumption and high result utility, while satisfying real-time response constraints.", "venue": "2020 IEEE 22nd International Conference on High Performance Computing and Communications; IEEE 18th International Conference on Smart City; IEEE 6th International Conference on Data Science and Systems (HPCC/SmartCity/DSS)", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-12-01", "journal": {"name": "2020 IEEE 22nd International Conference on High Performance Computing and Communications; IEEE 18th International Conference on Smart City; IEEE 6th International Conference on Data Science and Systems (HPCC/SmartCity/DSS)", "pages": "292-301"}, "authors": [{"authorId": "1629522042", "name": "Kailin Tang"}, {"authorId": "2068654517", "name": "Zhifeng Hao"}, {"authorId": "1856374", "name": "Ruichu Cai"}, {"authorId": "1686139", "name": "T. Fu"}, {"authorId": "2118771474", "name": "Y. Yang"}, {"authorId": "2152719157", "name": "Li Wang"}, {"authorId": "145136558", "name": "M. Winslett"}, {"authorId": "2109512262", "name": "Zhenjie Zhang"}], "citations": [{"paperId": "3fc68135faa06cd7db5fd4e0ae99253e1e94db6d", "title": "TransScale: Combined-Approach Elasticity for Stream Processing in Fog Environments"}]}
