{"paperId": "aa481fe81175f166d3d90960e82f62ac550aa9ca", "publicationVenue": {"id": "fb4d95f0-46a7-4feb-b6fb-bffa7b98f19a", "name": "IET Software", "type": "journal", "alternate_names": ["IET Softw"], "issn": "1751-8806", "url": "http://www.ietdl.org/IET-SEN"}, "title": "Vulcont: A recommender system based on context history ontology", "abstract": "The use of recommender systems is already widespread. Everyday people are exposed to different items’ offering that infer their interest and anticipate decisions. The context information (such as location, goals, and entities around a context) plays a key role in the recommendation’s accuracy. Extending contexts snapshots into contexts histories enables that information to be exploit. It is possible to identify context’s sequences, similar contexts histories and even predict future contexts. In this work we present Vulcont, a recommender system based on a contexts history ontology. Vulcont merges the benefits of ontology reasoning with contexts histories in order to measure contexts history similarity, based on semantic and ontology’s properties provided by context’s domain. Vulcont considers synonymous and classes’ relations to measure similarity. After that, a collaborative filtering approach identifies sequences’ frequency to identify potential items for recommendation. We evaluated and discussed the Vulcont’s recommendation in four scenarios in an offline experiment, which presents Vulcont’s recommendation power, due the exploit of semantic value of contexts history.", "venue": "IET Software", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-07-11", "journal": {"name": "IET Softw.", "pages": "111-123", "volume": "16"}, "authors": [{"authorId": "1822611", "name": "Ismael M. G. Cardoso"}, {"authorId": "1405714188", "name": "Jorge L. V. Barbosa"}, {"authorId": "2060464433", "name": "Bruno Mota"}, {"authorId": "35290948", "name": "L. P. S. Dias"}, {"authorId": "48138611", "name": "L. Nesi"}], "citations": [{"paperId": "90204fe85490f71ec008253263f79a96685c3d12", "title": "Applying multi-factor Beta distribution-based trust for improving accuracy of recommender systems"}, {"paperId": "eba2f3f5375c310cb3fc0710babc01cc05f657f4", "title": "Two-Level Graph Path Reasoning for Conversational Recommendation with User Realistic Preference"}, {"paperId": "03190569e339d149808caad8cfd8732526aa7e16", "title": "Ontology-Based Reasoning for Educational Assistance in Noncommunicable Chronic Diseases"}, {"paperId": "e2ab22d5f55b549879133e7ea679f16069c30fe6", "title": "Machine Learning and IoT Applied to Cardiovascular Diseases Identification through Heart Sounds: A Literature Review"}]}
