{"paperId": "aa5611d02a8f52bf3562414f2269885a2f2b0c0f", "publicationVenue": {"id": "b02cf974-33be-46bd-9cbc-022db6cb7151", "name": "IEEE International Conference on Software Maintenance and Evolution", "type": "conference", "alternate_names": ["Int Conf Sci Manag Eng", "IEEE Int Conf Softw Maint Evol", "ICSME", "International Conference Science, Management, and Engineering"], "url": "http://conferences.computer.org/icsm/"}, "title": "Finding an Optimal Set of Static Analyzers To Detect Software Vulnerabilities", "abstract": "Software vulnerabilities are ubiquitous and costly. To detect vulnerabilities earlier during development, organizations deploy a set of static analyzers to locate and eventually fix these vulnerabilities before releasing their software. Due to the prohibitive cost of running all available analyzers, organizations must run only a subset of all possible analyzers on their codebases. Choosing this set deterministically leaves recognizable gaps of vulnerability coverage. To overcome these challenges, we present Randomized Best Response (RBR), a method that computes an optimal randomization over size-bounded sets of available static analyzers. RBR models the relationship between malicious users and organizations as a leader-follower Stackelberg security game. Our solution focuses on software vulnerabilities due to their security implications when exploited by malicious users. Using 8 static analyzers for C/C++ and 8 Common Weakness Enumeration (CWE) vulnerability types, we show that RBR outperforms a set of natural baselines by always picking analyzers that achieve a higher benefit to the defender. Through a case study of a large system at Oracle, we show how RBR may be used in a real-world scenario.", "venue": "IEEE International Conference on Software Maintenance and Evolution", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-10-01", "journal": {"name": "2023 IEEE International Conference on Software Maintenance and Evolution (ICSME)", "pages": "463-473"}, "authors": [{"authorId": "2233290876", "name": "Jiaqi He"}, {"authorId": "2030713966", "name": "Revan MacQueen"}, {"authorId": "2193802974", "name": "Natalie Bombardieri"}, {"authorId": "49975642", "name": "Karim Ali"}, {"authorId": "30782010", "name": "J. R. Wright"}, {"authorId": "144350187", "name": "C. Cifuentes"}], "citations": []}
