{"paperId": "aa646e0b86599ddf996ee69762453eda02d620a6", "publicationVenue": null, "title": "Smart data centre monitoring system based on Internet of Things (IoT) (study case: Pustipanda UIN Jakarta)", "abstract": "State Islamic University of Syarif Hidayatullah Jakarta as rapid growing university towards world-class university placed in The edge of Jakarta has a data center runs by its unit of organization called Pustipanda (The Center of Information Technology and Database). The team had made observations during the last one year and found that these data center lately had an incident occurred where its hardware was found defected caused by instability of voltage and current from power supply, several uninterrupted power supply installed that should covered this problem was also unable to answer cause the current provided was insufficient for powering up computers in period of time. Internet of Things, tt means by this technology the Internet used has been widely changed, from human to machine communication now also become machine-to-machine communications. By using this technology a small object or device is able to implement into electrical system in data center in order to monitor abnormality of voltage and current from electrical supply and also implemented in the surroundings in order to monitor the temperature condition. Object implemented in the data center system are able to monitor and send the data into monitoring system.", "venue": "2017 5th International Conference on Cyber and IT Service Management (CITSM)", "year": 2017, "fieldsOfStudy": ["Engineering"], "publicationTypes": ["Conference"], "publicationDate": "2017-08-01", "journal": {"name": "2017 5th International Conference on Cyber and IT Service Management (CITSM)", "pages": "1-9"}, "authors": [{"authorId": "9189194", "name": "Feri Fahrianto"}, {"authorId": "9072183", "name": "Nenny Anggraini"}, {"authorId": "2057265949", "name": "Hendra Bayu Suseno"}, {"authorId": "30806171", "name": "A. Shabrina"}, {"authorId": "30924375", "name": "Alfatta Reza"}], "citations": [{"paperId": "e4b2050a40edc9dcade1cf4187ba149edef7b555", "title": "Agile Methodologies Applied to the Development of Internet of Things (IoT)-Based Systems: A Review"}, {"paperId": "61b0731977545213714f25c7efc32b4a54e58d3d", "title": "Proposta de Monitoramento e Gerenciamento Inteligente de Temperatura em Datacenters"}]}
