{"paperId": "aa7400cda002b4d8da08fdcd4d4e340c4e139a76", "publicationVenue": {"id": "cb55f70b-f8f9-4ae0-8b67-0f0105672b4b", "name": "International Conference on Communications in Computing", "type": "conference", "alternate_names": ["Color Imaging Conf", "International Conference on Collaboration and Internet Computing", "CIC", "CDMA Int Conf", "CDMA International Conference", "Int Conf Commun Comput", "Int Conf Collab Internet Comput", "Color Imaging Conference"], "url": "http://www.imaging.org/"}, "title": "Urban Pollution Monitoring Based on Mobile Crowd Sensing: An Osmotic Computing Approach", "abstract": "Traditional urban pollution monitoring systems suffer of the sole presence of fixed stations. Data gathered from such devices are precise, thanks to the equipment quality and to established and robust measuring protocols, but these sampled data are located in very limited areas and collected by discontinuous monitoring campaigns. The spread of mobile technologies has fostered the development of new approaches like Mobile Crowd Sensing (MCS), offering the chance of using mobile devices, even personal ones, as sensors of urban data. Nevertheless, one of the open challenges is the management of the integration of heterogeneous data flows, different from types, technical specifications (e.g. diverse transmission protocols) and semantics. Osmotic computing aims at creating an abstract level between the mobile devices and the cloud, enabling opportunistic filtering and the addition of metadata for improving the data processing flow. This work focuses on the design and the development of the middleware which integrates data coming from mobile and IoT devices specifically deployed in urban contexts using the Osmotic Computing paradigm.", "venue": "International Conference on Communications in Computing", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2018-10-01", "journal": {"name": "2018 IEEE 4th International Conference on Collaboration and Internet Computing (CIC)", "pages": "380-387"}, "authors": [{"authorId": "29817501", "name": "A. Longo"}, {"authorId": "2832282", "name": "A. Matteis"}, {"authorId": "1713637", "name": "M. Zappatore"}], "citations": [{"paperId": "915198ca2e1b0e4477d97ac6dd061bd6491b5e7c", "title": "Service Provisioning in Edge-Cloud Continuum: Emerging Applications for Mobile Devices"}, {"paperId": "05c9cc866408b03c9312f3e15b0a9f49ce21514b", "title": "A Cloud-Edge Artificial Intelligence Framework for Sensor Networks"}, {"paperId": "04c57373c6111dc47810d5f01e8cbd1b2e47e86d", "title": "Osmotic Cloud-Edge Intelligence for IoT-Based Cyber-Physical Systems"}, {"paperId": "c50647619cdef658a645bbf1d412c172ce7b40eb", "title": "A Systematic Review on Osmotic Computing"}, {"paperId": "964f13aea964640563021f025b187fc4566ef512", "title": "Intelligent mobile crowdsensing for secure data integration : A blockchain based approach"}, {"paperId": "ac2b779f38a44e0859fa7fa39300b58668580ccd", "title": "An Osmotic Computing Enabled Domain Naming System (OCE-DNS) for distributed service relocation between cloud and edge"}, {"paperId": "1509d8498e09a449918790cc1d6a239a2aef049e", "title": "On the Applicability of Secret Share Algorithms for Osmotic Computing"}, {"paperId": "6f9d0b9bbec43810bff5d1aa5ce611e4ec74836e", "title": "A Blockchain-Based Hybrid Incentive Model for Crowdsensing"}]}
