{"paperId": "aa7749bfe8f036ed9fbbd1c4f142968d03a7151a", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "An Overview of Design Patterns for Self-Adaptive Systems in the Context of the Internet of Things", "abstract": "The Internet of Things (IoT) requires the integration of all available, highly specialized, and heterogeneous devices, ranging from embedded sensor nodes to servers in the cloud. The self-adaptive research domain provides adaptive capabilities that can support the integration in IoT systems. However, developing such systems is a challenging, error-prone, and time-consuming task. In this context, design patterns propose already used and optimized solutions to specific problems in various contexts. Applying design patterns might help to reuse existing knowledge about similar development issues. However, so far, there is a lack of taxonomies on design patterns for self-adaptive systems. To tackle this issue, in this paper, we provide a taxonomy on design patterns for self-adaptive systems that can be transferred to support adaptivity in IoT systems. Besides describing the taxonomy and the design patterns, we discuss their applicability in an Industrial IoT case study.", "venue": "IEEE Access", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "187384-187399", "volume": "8"}, "authors": [{"authorId": "2592027", "name": "Christian Krupitzer"}, {"authorId": "2003550905", "name": "Timur Temizer"}, {"authorId": "2003557403", "name": "Thomas Prantl"}, {"authorId": "1743172", "name": "C. Raibulet"}], "citations": [{"paperId": "46949af9d62a3ca2a9d741f6b86933d1adf643a3", "title": "KREATION: Kotlin Framework for Self-Adaptive IoHT Applications"}, {"paperId": "1946f6775ad6d575489b45f189d54efa4a806121", "title": "Control Action Types -Patterns of Applied Control for Self-adaptive Systems"}, {"paperId": "ced682cf630877855f21259fde01fdc94bbbd45e", "title": "Towards a Catalogue of Self-Sovereign Identity Design Patterns"}, {"paperId": "ae4df74c63a2847c1174a660550996e08d870eab", "title": "Formal Algebraic Model of an Edge Data Center with a Redundant Ring Topology"}, {"paperId": "5fe98e373c3d654989cad547565b8240a29b4252", "title": "Flat vs Skeuomorphic Design for Smart Home Devices: An Exploratory Eye-Tracking Study"}, {"paperId": "c896463fbf8621682cf6d15cb92e96652fa02ff1", "title": "Self-Adaptation in Industry: A Survey"}, {"paperId": "5367264d2dbeaf7f9d32096b2af804802df32963", "title": "An Experience Report on the Suitability of a Distributed Group Encryption Scheme for an IoT Use Case"}, {"paperId": "261ee54adc507005316b9f272d6c66350ea96340", "title": "The Malware Detection Approach in the Design of Mobile Applications"}, {"paperId": "f0646fe1f1a078361fbb27360bf30a62911799bf", "title": "Benchmarking of Pre- and Post-Quantum Group Encryption Schemes with Focus on IoT"}, {"paperId": "30527855be8a2c463edd55eacfbb3e1531d723ba", "title": "Towards a Group Encryption Scheme Benchmark: A View on Centralized Schemes with Focus on IoT"}, {"paperId": "38be4eb55a512789286b4d82d20e88e2e8926779", "title": "Emergency Locksmith: A Restricted Dynamic Device Authentication Design Pattern for the Healthcare IoT"}, {"paperId": "dbcd9ffc50eae8562a98ef52b4ebe4cf9e98b3da", "title": "Collective Intelligence using 5G: Concepts, Applications, and Challenges in Sociotechnical Environments"}]}
