{"paperId": "aa7911cd6fccf70e50b1328c2208c0e15296665d", "publicationVenue": null, "title": "Federated Learning for Seismic Data Denoising: Privacy-Preserving Paradigm", "abstract": "\n Federated Learning (FL) is a framework that empowers multiple clients to develop robust machine learning (ML) algorithms while safeguarding data privacy and security. This paper's primary goal is to investigate the capability of the FL framework in preserving privacy and to assess its efficacy for clients operating within the oil and gas industry. To demonstrate the practicality of this framework, we apply it to seismic denoising use cases incorporating data from clients with IID (independent & and identically distributed) and Non-IID (non-independent and non-identically distributed) or domain-shifted data distributions. The FL setup is implemented using the well-established Flower framework.\n The experiment involves injecting noise into 3D seismic data and subsequently employing various ML algorithms to eliminate this noise. All experiments were conducted using both IID and Non-IID data, employing both traditional and FL approaches, various tests considering different types of noise, noise factors, number of 2D seismic slices, diverse models, number of clients, and aggregations strategies.\n We tested different model aggregation strategies, such as FedAvg, FedProx, and Fedcyclic, alongside client selection strategies that consider model divergence, convergence trend similarity, and client weight analysis to improve the aggregation process. We also incorporated batch normalization into the network architecture to reduce data discrepancies among clients. The denoising process was evaluated using metrics like mean-square-error (MSE), signal-to-noise ratio (SNR), and peak signal-to-noise ratio (PSNR).\n A comparison between conventional methods and FL demonstrated that FL exhibited a reduced error rate, especially when dealing with larger datasets. Furthermore, FL harnessed the power of parallel computing, resulting in a notable 30% increase in processing speed, enhanced resource utilization, and a remarkable 99% reduction in communication costs. To sum it up, this study underscores the potential of FL in the context of seismic denoising, safeguarding data privacy, and enhancing overall performance. We addressed the associated challenges by experimenting with various approaches for client selection and aggregation within a privacy-preserving framework. Notably, among these aggregation strategies, FedCyclic stands out as it offers faster convergence, achieving performance levels comparable to FedAvg and FedProx with fewer training iterations.", "venue": "Day 2 Tue, February 13, 2024", "year": 2024, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2024-02-12", "journal": {"name": "Day 2 Tue, February 13, 2024"}, "authors": [{"authorId": "2289364999", "name": "Kamalesh Kumar Mandakolathur Guruprasad"}, {"authorId": "2289378410", "name": "Gayatri Sunil Ambulkar"}, {"authorId": "2253551293", "name": "Geetha Nair"}], "citations": []}
