{"paperId": "aa8a61d9976db75776ebdfb2d2360ebeeb4da54c", "publicationVenue": {"id": "f80ba4a3-7aed-4021-b4d8-e4f50668847a", "name": "IEEE International Joint Conference on Neural Network", "type": "conference", "alternate_names": ["IJCNN", "IEEE Int Jt Conf Neural Netw", "Int Jt Conf Neural Netw", "International Joint Conference on Neural Network"], "url": "http://www.wikicfp.com/cfp/program?id=1573"}, "title": "Predictive Analytics of COVID-19 with Neural Networks", "abstract": "Neural networks (NNs) have been applied in numerous real-life applications and services. These include the applications in disease and healthcare analytics, such as identification and predictive analytics of coronavirus disease 2019 (COVID-19). However, many existing NN-based solutions train the models based on data (e.g., computed tomography (CT) scan images, viral/molecular test results) that can be expensive to produce and/or not easily accessible. They also require large volumes of these data for training. However, partially due to privacy concerns and other factors, the volume of available COVID-19 data can be limited. Hence, in this paper, we present a solution for predictive analytics of COVID-19 with NNs. Our solution consists of three algorithms, which make good use of autoencoder and few-shot learning, to train the prediction model with only a few samples of more accessible and less expensive types of data (e.g., serology/antibody test results from blood samples). Evaluation results on a real-life Brazilian COVID-19 dataset demonstrate the effectiveness of our solution in predictive analytics of COVD-19 with NNs.", "venue": "IEEE International Joint Conference on Neural Network", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-07-18", "journal": {"name": "2021 International Joint Conference on Neural Networks (IJCNN)", "pages": "1-8"}, "authors": [{"authorId": "1907007491", "name": "Daryl L. X. Fung"}, {"authorId": "50815199", "name": "Calvin S. H. Hoi"}, {"authorId": "1726081", "name": "C. Leung"}, {"authorId": "1905681423", "name": "Christine Y. Zhang"}], "citations": [{"paperId": "b78baf42cab8011d464250b357cb93636c13bc80", "title": "Effectively and Efficiently Supporting Predictive Big Data Analytics over Open Big Data in the Transportation Sector: A Bayesian Network Framework"}, {"paperId": "2c6ecb584ddae3e2891bdbdf97dbd7c1e8e8d00f", "title": "A High-resolution Global-scale Model for COVID-19 Infection Rate"}, {"paperId": "38545e5ff642e6028550eb5e151de94eb2212427", "title": "Predictive Analytics to Support Health Informatics on COVID-19 Data"}, {"paperId": "765c70098cba9ce6b3f71501c0718b6fd05b6675", "title": "Efficient analysis of COVID-19 clinical data using machine learning models"}]}
