{"paperId": "aa8ee338ab9fa149c77afe39cf4ec4c7671e9d13", "publicationVenue": {"id": "3b4e0d11-3211-4ead-848c-99928b5ef30e", "name": "IEEE Network", "type": "journal", "alternate_names": ["IEEE Netw"], "issn": "0890-8044", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=65"}, "title": "Serverless Empowered Video Analytics for Ubiquitous Networked Cameras", "abstract": "Ubiquitous deployment of networked cameras has boosted the prevalence of video analytics. Leveraging machines to automatically analyze captured videos has become the driving force behind a variety of contemporary applications. However, it is known to be resource-hungry with highly dynamic demands, which mismatches the existing monolithic cloud service deployment with coarse-grained resource allocation. Recent advances in serverless computing, which offers ultra-fast and fine-grained autoscaling, would become a game-changer. This article closely examines the potential and challenges of serverless computing in building modern video analytics applications. We accordingly present an integrated framework with geo-distributed resources, and identify the critical design issues toward its implementation. We further discuss a series of promising research directions in this field.", "venue": "IEEE Network", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-11-01", "journal": {"name": "IEEE Network", "pages": "186-193", "volume": "35"}, "authors": [{"authorId": "2112175756", "name": "Miao Zhang"}, {"authorId": "144935272", "name": "Fangxin Wang"}, {"authorId": "46758486", "name": "Yifei Zhu"}, {"authorId": "1681457", "name": "Jiangchuan Liu"}, {"authorId": "143771569", "name": "Bo Li"}], "citations": [{"paperId": "f6c3f92e0102f831a6529df00234d4e447e4f8e4", "title": "CWASI: A WebAssembly Runtime Shim for Inter-Function Communication in the Serverless Edge-Cloud Continuum"}, {"paperId": "48028d71d0d808650ce437da8ea1faaf394ff87f", "title": "EAVS: Edge-assisted Adaptive Video Streaming with Fine-grained Serverless Pipelines"}, {"paperId": "1e14c45a3d4f7d2af452ea0d362d8955849e354c", "title": "SPSC : Stream Processing Framework atop Serverless Computing for Industrial Big Data"}, {"paperId": "6fe337a78c779f3bebdcb2404bd0d8565e1ba5fa", "title": "Taming Serverless Cold Start of Cloud Model Inference with Edge Computing"}]}
