{"paperId": "aa91b7ad3bc5c58197f4541ff416ff1a8a0f4833", "publicationVenue": {"id": "60160d35-5631-4ce5-b116-d7e951d4c29e", "name": "Migration Letters", "type": "journal", "alternate_names": ["Migr Lett"], "issn": "1741-8984", "alternate_issns": ["1741-8992"], "url": "https://www.ceeol.com/search/journal-detail?id=1513", "alternate_urls": ["http://www.migrationletters.com/", "http://www.tplondon.com/migrationletters"]}, "title": "Impact of New Technologies on Student Competencies in Higher Education", "abstract": "A documentary review was carried out on the production and publication of research papers related to the study of the variables New Technologies, Student Competencies, Higher Education as online resources within the different study methodologies at the university level. The purpose of the bibliometric analysis proposed in this document was to know the main characteristics of the volume of publications registered in the Scopus database during the period 2017-2022 by Latin American institutions. The information provided by this platform was organized through graphs and figures, categorizing the information by Year of Publication, Country of Origin, Area of Knowledge and Type of Publication. Once these characteristics have been described, the position of different authors on the proposed topic is referenced through a qualitative analysis. Among the main findings made through this research, it is found that Mexico, with 41 publications, was the Latin American country with the highest scientific production registered in the name of authors affiliated with institutions of that nation. The Area of Knowledge that made the greatest contribution to the construction of bibliographic material related to the study of the implementation of new technologies and their impact on student competencies in university education was Social Sciences with 48 published documents, and the Type of Publication that was most used during the period indicated above was the Journal Article, which represents 48% of the total scientific production.", "venue": "Migration Letters", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-08-10", "journal": {"name": "Migration Letters"}, "authors": [{"authorId": "2281878601", "name": "Manuel David Isín Vilema Riobamba"}, {"authorId": "2281879777", "name": "Manuel Denis Renato Sanchez Orellana"}, {"authorId": "2281876726", "name": "Verónika Alarcón"}, {"authorId": "2281877247", "name": "Maritza Ceballos-Saavedra"}], "citations": [{"paperId": "8e926274fd876daeb127ea7843148a460905b5f0", "title": "Digital and Information Literacy in Basic-Education Teachers: A Systematic Literature Review"}]}
