{"paperId": "aa953865833e3b8cbd3fcb8eae3ec49dd536d53a", "publicationVenue": null, "title": "A robust hybrid artificial neural network double frontier data envelopment analysis approach for assessing sustainability of power plants under uncertainty", "abstract": "To assess sustainability of power plants, this paper presents a novel hybrid method. To this end, self‐organizing map method of artificial neural networks is employed. Then, a double frontier data envelopment analysis is developed to rank power plants in each cluster of decision‐making units. Because outputs of power plants might be uncertain, a robust optimization approach is incorporated into proposed double frontier data envelopment analysis model to present ranks that are robust against different uncertainties. A case study is given to validate the proposed model. The case study shows that the proposed model can present improvement solutions that guide power plants towards efficient frontier and far from inefficient frontier. Given the results, decision makers can decide on which power plants should be closed and which power plants should be expanded.", "venue": "Expert Syst. J. Knowl. Eng.", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-06-23", "journal": {"name": "Expert Systems", "volume": "36"}, "authors": [{"authorId": "32048609", "name": "S. Yousefi"}, {"authorId": "2426182", "name": "R. Soltani"}, {"authorId": "35744899", "name": "A. B. Naeini"}, {"authorId": "1853527", "name": "R. F. Saen"}], "citations": [{"paperId": "0a530bb47efb7f85c6270679bcd0df7cf9c614b1", "title": "A breakthrough in circular economy: Using a closed-loop framework to assess the circularity of supply chains"}, {"paperId": "7d9af40975bfee93504de8c03c1cc71eadbe54da", "title": "Forecasting sustainability of healthcare supply chains using deep learning and network data envelopment analysis"}, {"paperId": "d06aa92f3d3ff863ccc9569c5c665a0b3ea4e9ad", "title": "How to improve the future efficiency of Covid-19 treatment centers? A hybrid framework combining artificial neural network and congestion approach of data envelopment analysis"}, {"paperId": "52095ea149587294c75f8bdb0c67c8e76ed11582", "title": "Analyzing online consumer purchase psychology through hybrid machine learning"}, {"paperId": "1bbd16aa9620f4615ff9f22162651354b3a1b54a", "title": "Generalized robust window data envelopment analysis approach for dynamic performance measurement under uncertain panel data"}, {"paperId": "eaf1411a19c9ff44bb1bfd38c0222b5bacb0f8c3", "title": "Predicting financial distress using the worst-practice-frontier data envelopment analysis model and artificial neural network"}, {"paperId": "bcd1bf2171d3860a8eb7d799bfc7363cfd039917", "title": "Forecasting sustainability of supply chains in the circular economy context: a dynamic network data envelopment analysis and artificial neural network approach"}, {"paperId": "bcca120e4c6558ef54e842fd41484e9c98a17174", "title": "Application of Hybrid Approach in Banking System: An Undesirable Operational Performance Modelling"}, {"paperId": "906f3f29a4706f25a1476609c9389a854a0907e8", "title": "Sustainability assessment using a fuzzy DEA aggregation approach: a healthcare application"}, {"paperId": "dff5290f0c58f25afbf7ba0ae3fcdaca99096b24", "title": "Optimization of a 660 MWe Supercritical Power Plant Performance—A Case of Industry 4.0 in the Data-Driven Operational Management Part 1. Thermal Efficiency"}, {"paperId": "99ab149a8289879563303332fdd84c0e90b2e65e", "title": "A novel two-phase robust portfolio selection and optimization approach under uncertainty: A case study of Tehran stock exchange"}, {"paperId": "3cf67b575246de25ee51df05c1d3afd2ba17063b", "title": "Sustainable clustering of customers using capacitive artificial neural networks: a case study in Pegah Distribution Company"}, {"paperId": "2e74cb469c2f12282c7102f16448d65bd6c506e9", "title": "Data envelopment analysis and robust optimization: A review"}, {"paperId": "b010db3587429b656cd40c16d08ff4c5fadf0b72", "title": "Chemometrics: a complementary tool to guide the isolation of pharmacologically active natural products."}, {"paperId": "806ec82c83abef88f938ccc6de6d4337335ac372", "title": "How to improve the future efficiency of Covid-19 treatment centers? A hybrid framework combining artificial neural network and congestion approach of data envelopment analysis"}]}
