{"paperId": "aa9988bf55a092f8050b11818ca3647543263351", "publicationVenue": {"id": "8113a511-e0d9-4231-a1bc-0bf5d0212a4e", "name": "Symposium on the Theory of Computing", "type": "conference", "alternate_names": ["Symp Theory Comput", "STOC"], "url": "http://acm-stoc.org/"}, "title": "Dynamic algorithms against an adaptive adversary: generic constructions and lower bounds", "abstract": "Given an input that undergoes a sequence of updates, a dynamic algorithm maintains a valid solution to some predefined problem at any point in time; the goal is to design an algorithm in which computing a solution to the updated input is done more efficiently than computing the solution from scratch. A dynamic algorithm against an adaptive adversary is required to be correct when the adversary chooses the next update after seeing the previous outputs of the algorithm. We obtain faster dynamic algorithms against an adaptive adversary and separation results between what is achievable in the oblivious vs. adaptive settings. To get these results we exploit techniques from differential privacy, cryptography, and adaptive data analysis. Our results are as follows. 1. We give a general reduction transforming a dynamic algorithm against an oblivious adversary to a dynamic algorithm robust against an adaptive adversary. This reduction maintains several copies of the oblivious algorithm and uses differential privacy to protect their random bits. Using this reduction we obtain dynamic algorithms against an adaptive adversary with improved update and query times for global minimum cut, all pairs distances, and all pairs effective resistance. 2. We further improve our update and query times by showing how to maintain a sparsifier over an expander decomposition that can be refreshed fast. This fast refresh enables it to be robust against what we call a blinking adversary that can observe the output of the algorithm only following refreshes. We believe that these techniques will prove useful for additional problems. 3. On the flip side, we specify dynamic problems that, assuming a random oracle, every dynamic algorithm that solves them against an adaptive adversary must be polynomially slower than a rather straightforward dynamic algorithm that solves them against an oblivious adversary. We first show a separation result for a search problem and then show a separation result for an estimation problem. In the latter case our separation result draws from lower bounds in adaptive data analysis.", "venue": "Symposium on the Theory of Computing", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2021-11-07", "journal": {"name": "Proceedings of the 54th Annual ACM SIGACT Symposium on Theory of Computing"}, "authors": [{"authorId": "1729686", "name": "A. Beimel"}, {"authorId": "145325898", "name": "Haim Kaplan"}, {"authorId": "144830983", "name": "Y. Mansour"}, {"authorId": "145725600", "name": "Kobbi Nissim"}, {"authorId": "2993556", "name": "Thatchaphol Saranurak"}, {"authorId": "2734576", "name": "Uri Stemmer"}], "citations": [{"paperId": "6bc3cbca5719b451d97868fc989a3baaa2cf24d5", "title": "On the adversarial robustness of Locality-Sensitive Hashing in Hamming space"}, {"paperId": "edb345fec9e9ce1c9b69c1b4581f3dfbcbfc892e", "title": "Adversarially Robust Distributed Count Tracking via Partial Differential Privacy"}, {"paperId": "aac8d79b81db48eacbc9eab790df65d78ebc8ccd", "title": "Near-Optimal Dynamic Rounding of Fractional Matchings in Bipartite Graphs"}, {"paperId": "7feee0515f59fc684c7bff17b6f0605d9c873c16", "title": "Adaptive Data Analysis in a Balanced Adversarial Model"}, {"paperId": "4ea62e293c2072e8ced8c22969e6df146b3053f6", "title": "Fully Dynamic Shortest Path Reporting Against an Adaptive Adversary"}, {"paperId": "d10e3ef7fa49e13915d0e93c0877f2f2a26cd97a", "title": "Robust Algorithms on Adaptive Inputs from Bounded Adversaries"}, {"paperId": "5259300e83a2a6b93c6ce3d72bf67b9a4ab5a967", "title": "Streaming Algorithms for Learning with Experts: Deterministic Versus Robust"}, {"paperId": "4d64cdb916562cbc556f25dc84035df1341b7a51", "title": "Near Optimal Memory-Regret Tradeoff for Online Learning"}, {"paperId": "53bf4fafae1fcfe1621e5b00b15139f521ea3bcf", "title": "Differentially Private L2-Heavy Hitters in the Sliding Window Model"}, {"paperId": "aaf703bcaea435ef224519f375fb4dc2f830c8b2", "title": "The Target-Charging Technique for Privacy Accounting across Interactive Computations"}, {"paperId": "0ea0ba298c8a8bf4e6b964c13601e7ff8811358c", "title": "Relaxed Models for Adversarial Streaming: The Advice Model and the Bounded Interruptions Model"}, {"paperId": "4af305a5152a1e839d5c0aff7f845e3688abb5b2", "title": "Worst-Case to Expander-Case Reductions"}, {"paperId": "90ce107ae3a0cfc136e650759cd65eaaf3add756", "title": "Sketching Meets Differential Privacy: Fast Algorithm for Dynamic Kronecker Projection Maintenance"}, {"paperId": "b8117de85f489571f56e87c262fa7ea5723715b3", "title": "Dynamic Tensor Product Regression"}, {"paperId": "fa0c5703b9229403da2f3ebdd37c80045e1eb4f1", "title": "Dynamic Matching with Better-than-2 Approximation in Polylogarithmic Update Time"}, {"paperId": "692e618c818bada620ed00d89867b0ff964fcf49", "title": "Tricking the Hashing Trick: A Tight Lower Bound on the Robustness of CountSketch to Adaptive Inputs"}, {"paperId": "f8b3a18c320a3d1396f7f6489448c2a389491a63", "title": "On the Robustness of CountSketch to Adaptive Inputs"}, {"paperId": "96b6f20dc542085b9493f3a03fed6feb253b0dcf", "title": "Adaptive Data Analysis with Correlated Observations"}, {"paperId": "71784d116ae6f32be8af67b1f3da224c15fce061", "title": "The Price of Differential Privacy under Continual Observation"}, {"paperId": "1ba7f93afb0ceb96e17fad88d90c83841873cd10", "title": "Faster maxflow via improved dynamic spectral vertex sparsifiers"}, {"paperId": "cb10d4d1d77dea5258598d7458f23e6caeed0980", "title": "On the power of adaptivity in statistical adversaries"}, {"paperId": "1fcef084e13b14bccbd0fd7b18864bd9b5f00719", "title": "Sublinear-Time Computation in the Presence of Online Erasures"}, {"paperId": "c3c424efea89be2401295fab842b149b81367c6a", "title": "A Framework for Adversarial Streaming via Differential Privacy and Difference Estimators"}, {"paperId": "ba2d21b86863861efe17ab4456842cb827cd9250", "title": "Fully-Dynamic Graph Sparsifiers Against an Adaptive Adversary"}]}
