{"paperId": "aa9b3352f7de6f6b6b3b684ddc3b01a55cfde186", "publicationVenue": null, "title": "Query sense disambiguation leveraging large scale user behavioral data", "abstract": "Term ambiguity - the challenge of having multiple potential meanings for a keyword or phrase - can be a major problem for search engines. Contextual information is essential for word sense disambiguation, but search queries are often limited to very few keywords, making the available textual context needed for disambiguation minimal or non-existent. In this paper we propose a novel system to identify and resolve term ambiguity in search queries using large-scale user behavioral data. The proposed system demonstrates that, despite the lack of context in most keyword queries, multiple potential senses of a keyword or phrase within a search query can be accurately identified, disambiguated, and expressed in order to maximize the likelihood of fulfilling a user's information need. The proposed system overcomes the immediate lack of context by leveraging large-scale user behavioral data from historical query logs. Unlike traditional word sense disambiguation methods that rely on knowledge sources or available textual corpora, our system is language-agnostic, is able to easily handle domain-specific terms and meanings, and is automatically generated so that it does not grow out of date or require manual updating as ambiguous terms emerge or undergo a shift in meaning. The system has been implemented using the Hadoop eco-system and integrated within CareerBuilder's semantic search engine.", "venue": "2015 IEEE International Conference on Big Data (Big Data)", "year": 2015, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2015-10-29", "journal": {"name": "2015 IEEE International Conference on Big Data (Big Data)", "pages": "1230-1237"}, "authors": [{"authorId": "34963860", "name": "M. Korayem"}, {"authorId": "2056889579", "name": "Camilo Ortiz"}, {"authorId": "7699509", "name": "Khalifeh AlJadda"}, {"authorId": "2320997", "name": "Trey Grainger"}], "citations": [{"paperId": "0460e688a98617517f636c824d16ad10422606c5", "title": "Prilagodba sadržaja mrežnih stranica za internetske tražilice pomoću strojnoga učenja i obrade prirodnoga jezika"}, {"paperId": "1825629e1ba38dc82dbc5324860527b027915dc0", "title": "A comprehensive methodology for discovering semantic relationships among geospatial vocabularies using oceanographic data discovery as an example"}, {"paperId": "c4f2bca1a36bef985798edaf1292ac122dc0a69d", "title": "Macro-Optimization of email Recommendation Response Rates Harnessing Individual Activity Levels and Group Affinity Trends"}, {"paperId": "c710190bbe0bb84e2b2c00718374a678695356f9", "title": "Entity Type Recognition Using an Ensemble of Distributional Semantic Models to Enhance Query Understanding"}, {"paperId": "265f2bf94d0cecfc956e1879172f57c56414e09c", "title": "Mining massive hierarchical data using a scalable probabilistic graphical model"}, {"paperId": "214522ffffc2dd429b7062adba3b5cd78e27d12d", "title": "Macro-optimization of email recommendation response rates harnessing individual activity levels and group affinity trends"}, {"paperId": "8c86c63f30891d716507e3d45527d98e3d6c66ce", "title": "Distributed Computing in Big Data Analytics"}, {"paperId": "4c290a36997002d4df96832a328dcde0e9ce6c98", "title": "Utilizing Big Data Analytics for Automatic Building of Language-agnostic Semantic Knowledge Bases"}, {"paperId": "f95c9a316d869c3b59de723a7c1730da361ac297", "title": "2016 Ieee International Conference on Big Data (big Data) Solving Cold-start Problem in Large-scale Recommendation Engines: a Deep Learning Approach"}]}
