{"paperId": "aaa3ee3fc24ca38b1556326bce5ca3975b53d592", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "A Finite Precision Implementation of an Image Encryption Scheme Based on DNA Encoding and Binarized Chaotic Cores", "abstract": "Under finite precision implementation, one dimensional (1D) chaotic maps suffer from limited number of control parameters and converged periodicity, making them unsuitable for hardware based ciphering systems despite their simple implementation and low hardware cost. This paper first discusses the limited periodicity of 1D maps under fixed point precision representation, then, presents an image encryption algorithm based on DNA encoding and two specially configured binarized chaotic cores. The function of both cores is to perform the confusion and diffusion stages of the image by generating pseudo random numbers with excellent cryptographic properties. DNA encoding adds an extra layer of security to the algorithm by converting both the image and the chaotic stream to DNA sequences using specific DNA encoding rule. Initial values of both chaotic cores are image dependent based on a calculated hamming distance. These initial condition and the utilized DNA rules composes the overall secret key of the system with a total length of 336 bits. On the condition that all calculations involved in the scheme are based on binary integer arithmetic, all performed security analysis subjected to the scheme proved that the system could withstand known attacks with excellent encryption properties.", "venue": "IEEE Access", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "136905-136916", "volume": "9"}, "authors": [{"authorId": "2103121389", "name": "Rania A. Elmanfaloty"}, {"authorId": "3447881", "name": "Abdullah M. Alnajim"}, {"authorId": "1410805046", "name": "E. Abou-Bakr"}], "citations": [{"paperId": "7c754d5a3b4c05b3766a530f092205a35ee36737", "title": "Integrated dual hyperchaotic and Josephus traversing based 3D confusion-diffusion pattern for image encryption"}, {"paperId": "4f0071bf52b258d9b185291e8de313aa2a3c5033", "title": "Hybrid Chaotic-Based PRNG for Secure Cryptography Applications"}, {"paperId": "aaf773eb44e5cbf1384c5086614027e17f9e5213", "title": "Robust image compression-encryption via scrambled block bernoulli sampling with diffusion noise"}, {"paperId": "a1e193f4f7c324f97f842ab398d0f05239bc6809", "title": "Design and Embedded Implementation of Secure Image Encryption Scheme Using DWT and 2D-LASM"}, {"paperId": "12fc0a25309f7c534d93df549940b6386158a989", "title": "A Novel and Fast Encryption System Based on Improved Josephus Scrambling and Chaotic Mapping"}]}
