{"paperId": "aaa510cce8bbfad0ea18e64d6e2e1e278b927554", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Data Integration from Heterogeneous Control Levels for the Purposes of Analysis within Industry 4.0 Concept", "abstract": "Small- and medium-sized manufacturing companies must adapt their production processes more quickly. The speed with which enterprises can apply a change in the context of data integration and historicization affects their business. This article presents the possibilities of implementing the integration of control processes using modern technologies that will enable the adaptation of production lines. Integration using an object-oriented approach is suitable for complex tasks. Another approach is data integration using the entity referred to as tagging (TAG). Tagging is essential to apply for fast adaptation and modification of the production process. The advantage is identification, easier modification, and generation of data structures where basic entities include attributes, topics, personalization, locale, and APIs. This research proposes a model for integrating manufacturing enterprise data from heterogeneous levels of management. As a result, the model and the design procedure for data integrating production lines can efficiently adapt production changes.", "venue": "Italian National Conference on Sensors", "year": 2022, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-12-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "22"}, "authors": [{"authorId": "48481066", "name": "Tibor Horák"}, {"authorId": "2088996837", "name": "P. Strelec"}, {"authorId": "3392888", "name": "M. Kebísek"}, {"authorId": "2848235", "name": "P. Tanuška"}, {"authorId": "51110268", "name": "A. Vaclavova"}], "citations": [{"paperId": "858460cea12027dc9566f15d2710e0a19226a2f4", "title": "Acquiring Automation and Control Data in The Manufacturing Industry: A Systematic Review"}]}
