{"paperId": "aab87d5d6f23069249b22a8f3b51ccfb25b402f6", "publicationVenue": {"id": "a8da62bb-605c-4638-8118-4041c9d6fdbc", "name": "Turkish Journal of Computer and Mathematics Education", "type": "journal", "alternate_names": ["Turk J Comput Math Educ"], "issn": "1309-4653", "url": "http://www.dergipark.gov.tr/turkbilmat"}, "title": "A Proposed Integration Architecture for University Research Data Repository to Support University and University Hospital on Medical Digital Image Management and Analytics using Hadoop", "abstract": "Big Data has been used in university and hospital due to its enormous potential in managing large volume and many types of data. However, university that also has hospitals may need to integrate their data repository to have a single site access for easier system administration and management. The needs of image analytics for both researchers in the university and physicians in the university hospital demand the need of Big Data platform such as Hadoop framework. Based on the literatures, there are no papers that describe in detail the integration of big data for university, which include its own teaching hospital. Therefore, this paper focuses on the proposed research data architecture for university and university hospital to support data repository for both with capability of image analytics using Hadoop technology.", "venue": "Turkish Journal of Computer and Mathematics Education", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-04-10", "journal": {"name": "Turkish Journal of Computer and Mathematics Education (TURCOMAT)"}, "authors": [{"authorId": "2100635470", "name": "Iskandar Ishak Et.al"}], "citations": [{"paperId": "be2750c87af23b86937a2269c6df2e2420edc506", "title": "Large-scale Information Management using Hadoop Platform"}, {"paperId": "3cdcc5130adecc9e5ecd111ef9a9458b76526df0", "title": "A middleware architecture to integrate and share health data from heterogeneous and diverse data sources"}, {"paperId": "836c44b5ddb7c903d1c2d2df9cae9044292b9dd9", "title": "Middleware to Integrate Patient Data from Heterogeneous Distributed Databases and Its Efficacy"}]}
