{"paperId": "aac8d79b81db48eacbc9eab790df65d78ebc8ccd", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Near-Optimal Dynamic Rounding of Fractional Matchings in Bipartite Graphs", "abstract": "We study dynamic $(1-\\epsilon)$-approximate rounding of fractional matchings -- a key ingredient in numerous breakthroughs in the dynamic graph algorithms literature. Our first contribution is a surprisingly simple deterministic rounding algorithm in bipartite graphs with amortized update time $O(\\epsilon^{-1} \\log^2 (\\epsilon^{-1} \\cdot n))$, matching an (unconditional) recourse lower bound of $\\Omega(\\epsilon^{-1})$ up to logarithmic factors. Moreover, this algorithm's update time improves provided the minimum (non-zero) weight in the fractional matching is lower bounded throughout. Combining this algorithm with novel dynamic \\emph{partial rounding} algorithms to increase this minimum weight, we obtain several algorithms that improve this dependence on $n$. For example, we give a high-probability randomized algorithm with $\\tilde{O}(\\epsilon^{-1}\\cdot (\\log\\log n)^2)$-update time against adaptive adversaries. (We use Soft-Oh notation, $\\tilde{O}$, to suppress polylogarithmic factors in the argument, i.e., $\\tilde{O}(f)=O(f\\cdot \\mathrm{poly}(\\log f))$.) Using our rounding algorithms, we also round known $(1-\\epsilon)$-decremental fractional bipartite matching algorithms with no asymptotic overhead, thus improving on state-of-the-art algorithms for the decremental bipartite matching problem. Further, we provide extensions of our results to general graphs and to maintaining almost-maximal matchings.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-20", "journal": {"name": "ArXiv", "volume": "abs/2306.11828"}, "authors": [{"authorId": "3074832", "name": "Sayan Bhattacharya"}, {"authorId": "2187429133", "name": "Peter Kiss"}, {"authorId": "2357926", "name": "Aaron Sidford"}, {"authorId": "1965693", "name": "David Wajc"}], "citations": [{"paperId": "becc37ec04b30a04573eb555fc43eead669ff574", "title": "On Approximate Fully-Dynamic Matching and Online Matrix-Vector Multiplication"}, {"paperId": "996f0411674a54b012addef06b996aa7d8bc555e", "title": "Optimal Dynamic Subset Sampling: Theory and Applications"}]}
