{"paperId": "aac8c3a209f85338326460a92c7595367f12a9bb", "publicationVenue": null, "title": "Network Information Resource Allocation under Big Data Technology", "abstract": "Established in the current era of rapid development of information technology, there are many shortcomings in the traditional Internet optimization methods for the allocation of information resources, such as low efficiency, long allocation time, and low demand satisfaction in the optimization process. However, under the current big data model, how to allocate the Internet information in a balanced way is one of the main problems to be faced at present. Therefore, in this paper, we propose a Nash equilibrium solution based on the network big data information resource allocation method. First, we describe the network phenomenon by establishing a non-cooperative game information resource allocation model, and prove the existence and uniqueness of the Nash equilibrium solution by solving the game model, and at the same time, we create a new big data information resource allocation method based on the Nash equilibrium solution The experimental results of the efficiency of the proposed information resource allocation method and the traditional information resource allocation method are compared, and the results show that the proposed information resource allocation method has the advantages of high efficiency and high utilization rate of network resources compared with the traditional method in terms of resource allocation efficiency, which can realize the rational use of network information resources with greater efficiency and The allocation of information resources can be reasonably optimized.", "venue": "2023 IEEE 2nd International Conference on Electrical Engineering, Big Data and Algorithms (EEBDA)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-02-24", "journal": {"name": "2023 IEEE 2nd International Conference on Electrical Engineering, Big Data and Algorithms (EEBDA)", "pages": "15-19"}, "authors": [{"authorId": "2214350885", "name": "Xiaoting Mou"}, {"authorId": "36620472", "name": "Hao Chen"}], "citations": []}
