{"paperId": "aad231048a9663b6030e2d825af53f3db7a65aca", "publicationVenue": null, "title": "Distributed SPARQL over Big RDF Data: A Comparative Analysis Using Presto and MapReduce", "abstract": "The processing of large volumes of RDF data require an efficient storage and query processing engine that can scale well with the volume of data. The initial attempts to address this issue focused on optimizing native RDF stores as well as conventional relational databases management systems. But as the volume of RDF data grew to exponential proportions, the limitations of these systems became apparent and researchers began to focus on using big data analysis tools, most notably Hadoop, to process RDF data. This paper presents a comparative analysis of performance of Presto (distributed SQL query engine) in processing big RDF data against Apache Hive. To evaluate the performance Presto for big RDF data processing, a map-reduce program and a compiler, based on Flex and Bison, were implemented. The map-reduce program loads RDF data into HDFS while the compiler translates SPARQL queries into a subset of SQL that Presto (and Hive) can understand.", "venue": "2015 IEEE International Congress on Big Data", "year": 2015, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2015-06-27", "journal": {"name": "2015 IEEE International Congress on Big Data", "pages": "33-40"}, "authors": [{"authorId": "1684190", "name": "M. Mammo"}, {"authorId": "1720381", "name": "S. Bansal"}], "citations": [{"paperId": "67d474beaf5f5afd8819129ac5404c8044488778", "title": "Analisis Data Kereta Api dan Stasiun pada Daerah Operasi VIII Surabaya Menggunakan SPARQL dengan Algoritma Betweenness Centrality"}, {"paperId": "95b1d05f70333bb154363bc82db3b74700da15e5", "title": "A new system for massive RDF data management using Big Data query languages Pig, Hive, and Spark"}, {"paperId": "c447884ff203380eea57c9072b36db5323b2c28e", "title": "Emergent models, frameworks, and hardware technologies for Big data analytics"}, {"paperId": "0293e8c58298d73d5864a35ba1af3ae063e7353c", "title": "MapReduce-Based Algorithms for Managing Big RDF Graphs: State-of-the-Art Analysis, Paradigms, and Future Directions"}, {"paperId": "485acaca3124855ea3db896f344025c3b7a5d23c", "title": "A Systematic Review of SQL-on-Hadoop by Using Compact Data Formats"}, {"paperId": "05848a8ff2a26e8df2b1fad7a2121835d18d47aa", "title": "2016 Ieee International Conference on Big Data (big Data) a Survey on Semantic Web and Big Data Technologies for Social Network Analysis"}]}
