{"paperId": "aad6b7e167bcbd7db335794a5448000862856458", "publicationVenue": null, "title": "A Hadoop-based visualization and diagnosis framework for earth science data", "abstract": "With rapidly growing computing power, ultra high-resolution Earth science simulations with a long period of time are feasible. However, it is still very challenging to distribute and analyze a huge amount of simulation results, which could be over 100TB. One key reason is that typical Earth science data are represented in NetCDF, which is not supported by the popular and powerful Hadoop Distribute File System (HDFS) and consequently cannot be analyzed with tools based on HDFS. In this paper, we propose a Hadoop-based visualization and diagnosis framework for visualizing and analyzing Earth science data. It has a data model to transform data from the format of NetCDF to CSV (Comma Separated Value) that is supported by HDFS. With this model, data can be processed with the operations such as maximize, sum, and subset through HIVE and Cloudera Impala and, therefore, typical diagnoses can be performed. In addition, the framework has a technique to visualize and diagnose HDFS-resident data with the popular visualization and diagnosis tool, IDL. To speed up this process, a concurrent reader is developed to obtain HDFS-resident data. Moreover, a dynamic reader to transfer data from a parallel file system (PFS) to HDFS is developed to efficiently visualize and diagnose PFS-resident data. The cloud resolve mode simulations are used for testing and evaluating this framework.", "venue": "2015 IEEE International Conference on Big Data (Big Data)", "year": 2015, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2015-10-29", "journal": {"name": "2015 IEEE International Conference on Big Data (Big Data)", "pages": "1972-1977"}, "authors": [{"authorId": "145012878", "name": "Shujia Zhou"}, {"authorId": "2115309158", "name": "Xi Yang"}, {"authorId": "2108855241", "name": "Xiaowen Li"}, {"authorId": "2614839", "name": "T. Matsui"}, {"authorId": "144977052", "name": "Si Liu"}, {"authorId": "1746991", "name": "Xian-He Sun"}, {"authorId": "143988966", "name": "W. Tao"}], "citations": [{"paperId": "1801d1114ae1a6d89a42cae81351d949f9ec84fa", "title": "A guide to creating an effective big data management framework"}, {"paperId": "0dd2d1793257a54868c7487ddb30479b456e7820", "title": "Hetero-GCD2RDF: An Interoperable Solution for Geospatial Climatic Data by Deploying Semantic Web Technologies"}, {"paperId": "5626adfc8102fe684c2d38ea73a32ba0b5e29e5f", "title": "SciDP: Support HPC and Big Data Applications via Integrated Scientific Data Processing"}, {"paperId": "7c8ef2cfc2a82d2e7653589191083d11af939eca", "title": "Towards Building a Distributed Data Management Architecture to Integrate Multi-Sources Remote Sensing Big Data"}, {"paperId": "0520a1d453006cfe1f1f5fa83bb495c4d8694d02", "title": "Visualization and Adaptive Subsetting of Earth Science Data in HDFS: A Novel Data Analysis Strategy with Hadoop and Spark"}, {"paperId": "ed43c8c30d66ed9f784ad9c4936ac0e046f11b6c", "title": "Using Big Data Analysis Instruments to Tackle the Problem of Simulation Results Visualization in Large Scale Gas Dynamics"}, {"paperId": "ebd14346d2341ed1682d58d0636416e41ba89622", "title": "Feature Extraction and Parallel Visualization for Large-Scale Scientific Data"}, {"paperId": "a4a6cd0983537a2e50d0fd829b9be5e6ad2cd88e", "title": "2016 Ieee International Conference on Big Data (big Data) Visualization and Diagnosis of Earth Science Data through Hadoop and Spark"}]}
