{"paperId": "aaf29ed16354118e84abb2428edf87ac63238f32", "publicationVenue": {"id": "2ca4a45f-1cc5-4cb1-9a27-d9779aebaad2", "name": "Computing and informatics", "type": "journal", "alternate_names": ["Computers and Informatics", "Comput informatics", "Comput Informatics"], "issn": "1335-9150", "alternate_issns": ["2757-8259"], "url": "http://www.cai.sk/ojs/index.php/cai"}, "title": "Object-Oriented Build Automation - A Case Study", "abstract": ". Fast and precise build and deployment automation is a fundamental task for every project oriented on rapidly appearing changes. As a rule of thumb, the tools used for this task work as procedural-declarative frameworks – often overlooking the extra requirements for large projects like easy parallelization, precise targeting of specific subsystem or general code readability. In this article we document our findings in build automation as we have abandoned the procedural-declarative approach to object-oriented perspective of our setup environment – all implemented in the .NET build automation framework Cake Frosting. Due to the clear separation of the various layers of our system and our codebase we are able to fire up our new build-deployment routines at ease and at specific part of our ecosystem. As the whole routine is written as a C# console application we can easily manage some aspects of parallel execution (i.e. number of threads) of some tasks which results in great drop of job execution time. To further improve the execution time, we introduce the concept of proof-of-work which is a file that stores the information about the last successful build. Together, all of our concepts resulted in a fast build-deployment routine – as in pessimistic scenario we managed to drop to about 30 % of the original time. We believe that others may benefit from our case study as the concepts proposed here can be easily incorporated to any other project written", "venue": "Computing and informatics", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "Comput. Informatics", "volume": "40"}, "authors": [{"authorId": "3395318", "name": "Maciej Penar"}, {"authorId": "2146159812", "name": "Wiktor Zychla"}], "citations": [{"paperId": "a024cff08a2af80ffa5d0636c94d9d944c60b5f8", "title": "Autoencoders Based on 2D Convolution Implemented for Reconstruction Point Clouds from Line Laser Sensors"}, {"paperId": "91b06d84d5b1db6365c0350119f9099101699f52", "title": "Preface to the Special Issue on Software Engineering"}]}
