{"paperId": "aaf98ad17d0c727f9e9282970fd21a9a7db5f209", "publicationVenue": {"id": "57a3bc59-9a65-4645-9e13-fe1b242ef2d7", "name": "International Conference on Industrial Internet", "type": "conference", "alternate_names": ["ICII", "International Conference Information Management and Industrial Engineering", "Int Conf Ind Internet", "Int Conf Inf Manag Ind Eng"]}, "title": "On the Effectiveness of Recurrent Neural Networks for Live Modeling of Cyber-Physical Systems", "abstract": "Attention to cyber security of cyber-physical systems (CPS) has led to the development of innovative cyber-resilient methodologies to ensure early detection and mitigation of cyber anomalies and threats. The concept of Digital Twin (DT) has recently emerged as one of the approaches to achieve the objective of resilience. In the approach using DT, a software-based live model of a target CPS is used to continuously monitor, surveil and verify the correctness of the target CPS operation. In this paper, we empirically study the effectiveness of Recurrent Neural Network (RNN)-based models as the basis of DT-based resilience. We uncover the important characteristics of an RNN-based solution with experimentation on a lab-scale Canal Lock CPS emulator with live validations and attack scenarios. For the first time, we demonstrate actual, real-time use of a RNN-based model as a DT for performing live analysis on an operational CPS. Based on the observed results, we highlight the importance of a DT model's training interval, prediction interval and CPS polling interval in the process of anomaly detection. We uncover the limitations in anomaly detection due to real-time synchronization needs of the RNN-based DT. We highlight this uncovered tug of war between synchronization and anomaly detection is inherent in any complex CPS that is monitored and synchronized by relying on the same sensor streams of ground truth for both synchronization as well as anomaly detection.", "venue": "International Conference on Industrial Internet", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-11-01", "journal": {"name": "2019 IEEE International Conference on Industrial Internet (ICII)", "pages": "309-317"}, "authors": [{"authorId": "2409037", "name": "Srikanth B. Yoginath"}, {"authorId": "51163842", "name": "Varisara Tansakul"}, {"authorId": "3416653", "name": "S. Chinthavali"}, {"authorId": "143960647", "name": "Curtis R. Taylor"}, {"authorId": "40227877", "name": "J. Hambrick"}, {"authorId": "3366231", "name": "P. Irminger"}, {"authorId": "1750770", "name": "K. Perumalla"}], "citations": [{"paperId": "7358f5b62e875aebbe0b566f11469648a75fa7e3", "title": "Emerging framework for attack detection in cyber-physical systems using heuristic-based optimization algorithm"}, {"paperId": "3d426bd19f0ec6f9f80d25a380281f8ac6a0958e", "title": "Digital-twin-based testing for cyber-physical systems: A systematic literature review"}, {"paperId": "abefa5253251092a447665b1dc860351be6a414a", "title": "Discussing resilience in the context of cyber physical systems"}, {"paperId": "dd4a87b7f6dd9a07f81275a3cfa318badf9e928d", "title": "Trust-but-Verify in Cyber-Physical Systems"}, {"paperId": "5afc52f13d5ef84a7a1ccfe32d9b699614fea77f", "title": "Enhancing Operational Resilience of Critical Infrastructure Processes Through Chaos Engineering"}, {"paperId": "baa9f87513fa17442deadbe42c90a351d4c70956", "title": "Automated Cyber Attack Prediction Workflow"}]}
