{"paperId": "aafc2c50a03651f6051bfb7cfcc3ce04d2151772", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Robust and IP-Protecting Vertical Federated Learning against Unexpected Quitting of Parties", "abstract": "Vertical federated learning (VFL) enables a service provider (i.e., active party) who owns labeled features to collaborate with passive parties who possess auxiliary features to improve model performance. Existing VFL approaches, however, have two major vulnerabilities when passive parties unexpectedly quit in the deployment phase of VFL - severe performance degradation and intellectual property (IP) leakage of the active party's labels. In this paper, we propose \\textbf{Party-wise Dropout} to improve the VFL model's robustness against the unexpected exit of passive parties and a defense method called \\textbf{DIMIP} to protect the active party's IP in the deployment phase. We evaluate our proposed methods on multiple datasets against different inference attacks. The results show that Party-wise Dropout effectively maintains model performance after the passive party quits, and DIMIP successfully disguises label information from the passive party's feature extractor, thereby mitigating IP leakage.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-03-28", "journal": {"name": "ArXiv", "volume": "abs/2303.18178"}, "authors": [{"authorId": "2156016815", "name": "Jingwei Sun"}, {"authorId": "2048018258", "name": "Zhixu Du"}, {"authorId": "2140083998", "name": "Anna Dai"}, {"authorId": "1411263189", "name": "Saleh Baghersalimi"}, {"authorId": "80821464", "name": "A. Amirshahi"}, {"authorId": "2064423745", "name": "D. Atienza"}, {"authorId": "2213153798", "name": "Yiran Chen"}], "citations": [{"paperId": "4c5b403859efbde6534d3d72277b85eabf792689", "title": "Complementary Knowledge Distillation for Robust and Privacy-Preserving Model Serving in Vertical Federated Learning"}, {"paperId": "a424e91e5127445cc7cd7cc0998395a6528890aa", "title": "A Survey of Privacy Threats and Defense in Vertical Federated Learning: From Model Life Cycle Perspective"}]}
