{"paperId": "ab013c9a479abfde2cd0cb0e557afe9ad69c8383", "publicationVenue": null, "title": "Self-Adaptive Threshold Clustering in Abnormal Cardiac Beat Detection on Lightweight Embedded Devices", "abstract": "Clustering is an important aspect of data mining and understanding signals. Reducing cost and processing time with high accuracy in cardiac disorder diagnosis based on clustering algorithms in electrocardiogram (ECG) signals is a critical research area. Currently, an automatic QRS complex clustering algorithm with high speed and accuracy is a challenge because of the morphological and temporal features of the ECG signals under different physical circumstances. This paper proposes a new beat clustering algorithm for ECG signals to handle these issues. Our approach utilizes the Pearson similarity and coefficient of variation that measures the dispersion of data. The strong point of our proposal employs a self-adaptive threshold for learning and detection instead of a manual threshold. We use the MIT-BIH database for testing and comparing the results. When automatically clustering, Se, Sp, and Ac values are higher than 1.52%, 7.36%, and 1.7%, respectively, compared to the previous study. We get 99.33% for specific and 99.75% for accuracy with the manual setup. Processing time for clustering is reduced by $7\\times$ and keeps the same time for the abnormal beat detection stage compared with the previous research. Therefore, the suggestion is efficient for real-time clustering and abnormal beat detection on embedded devices.", "venue": "2022 IEEE 8th International Conference on Smart Instrumentation, Measurement and Applications (ICSIMA)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-09-26", "journal": {"name": "2022 IEEE 8th International Conference on Smart Instrumentation, Measurement and Applications (ICSIMA)", "pages": "10-15"}, "authors": [{"authorId": "82402552", "name": "Thi Diem Tran"}, {"authorId": "2189145633", "name": "Ngoc Quoc Tran"}, {"authorId": "2189138367", "name": "Thi Thu Khiet Dang"}, {"authorId": "2189143638", "name": "An Dong Bui"}], "citations": []}
