{"paperId": "ab0ba8074f493f9778d1411dfa9ef2fcbc1a99fb", "publicationVenue": {"id": "0a05a451-a2de-4e8e-bade-704b9857926a", "name": "Distributed Event-Based Systems", "type": "conference", "alternate_names": ["DEBS", "Distrib Event-based Syst"], "url": "https://en.wikipedia.org/wiki/Distributed_Event-Based_Systems"}, "title": "Building an end-to-end BAD application", "abstract": "Traditional big data infrastructures are passive in nature, passively answering user requests to process and return data. In many applications however, users not only need to analyze data, but also to subscribe to and actively receive data of interest, based on their subscriptions. Their interest may include the incoming data's content as well as its relationships to other data. Moreover, data delivered to subscribers may need to be enriched with additional relevant and actionable information. To address this Big Active Data (BAD) challenge we have advocated the need for building scalable BAD systems that continuously and reliably capture big data while enabling timely and automatic delivery of relevant and possibly enriched information to a large pool of subscribers. In this demo we showcase how to build an end-to-end active application using a BAD system and a standard email broker for data delivery. This includes enabling users to register their interests with the bad system, ingesting and monitoring data, and producing customized results and delivering them to the appropriate subscribers. Through this example we demonstrate that even complex active data applications can be created easily and scale to many users, considerably limiting the effort of application developers, if a BAD approach is taken.", "venue": "Distributed Event-Based Systems", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2021-06-28", "journal": {"name": "Proceedings of the 15th ACM International Conference on Distributed and Event-based Systems"}, "authors": [{"authorId": "2112467299", "name": "Shahrzad Haji Amin Shirazi"}, {"authorId": "1703347", "name": "M. Carey"}, {"authorId": "1761528", "name": "V. Tsotras"}], "citations": []}
