{"paperId": "ab1bffdf1c3fd32a864eb50ea1fe636c0e7ae62e", "publicationVenue": {"id": "ccd8e532-73c6-414f-bc91-271bbb2933e2", "name": "Electronics", "type": "journal", "issn": "1450-5843", "alternate_issns": ["2079-9292", "0883-4989"], "url": "http://www.electronics.etfbl.net/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-247562", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-247562", "https://www.mdpi.com/journal/electronics"]}, "title": "Microphone Array for Speaker Localization and Identification in Shared Autonomous Vehicles", "abstract": "With the current technological transformation in the automotive industry, autonomous vehicles are getting closer to the Society of Automative Engineers (SAE) automation level 5. This level corresponds to the full vehicle automation, where the driving system autonomously monitors and navigates the environment. With SAE-level 5, the concept of a Shared Autonomous Vehicle (SAV) will soon become a reality and mainstream. The main purpose of an SAV is to allow unrelated passengers to share an autonomous vehicle without a driver/moderator inside the shared space. However, to ensure their safety and well-being until they reach their final destination, it is required an active monitoring of all passengers. In this context, this article presents a microphone-based sensor system that is able to localize sound events inside an SAV. The solution is composed of a Micro-Electro-Mechanical System (MEMS) microphone array with a circular geometry connected to an embedded processing platform that resorts to Field-Programmable Gate Array (FPGA) technology to successfully process in hardware the sound localization algorithms.", "venue": "Electronics", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-01-26", "journal": {"name": "Electronics"}, "authors": [{"authorId": "82140372", "name": "Ivo Marques"}, {"authorId": "144626155", "name": "J. Sousa"}, {"authorId": "9198879", "name": "Bruno Sá"}, {"authorId": "2070007349", "name": "Diogo Costa"}, {"authorId": "153736638", "name": "P. Sousa"}, {"authorId": "2151767790", "name": "Samuel Pereira"}, {"authorId": "2157847798", "name": "A. Santos"}, {"authorId": "2061259087", "name": "Carlos Lima"}, {"authorId": "2141905618", "name": "Niklas Hammerschmidt"}, {"authorId": "145210361", "name": "S. Pinto"}, {"authorId": "46309528", "name": "Tiago Gomes"}], "citations": [{"paperId": "d6dfba47a72c99efa30b058cbc628c964ac2a938", "title": "Exploring the Confluence of Technology and Driving: An Examination of Advanced Driver Assistance Systems"}, {"paperId": "5b24195fb669304bbc9fec7560a18b68d80f62b6", "title": "A review of sensory interactions between autonomous vehicles and drivers"}, {"paperId": "032b14ee53946228b132f2e3d9789edef40413f6", "title": "Hybrid Deep Convolutional Neural Network based Speaker Recognition for Noisy Speech Environments"}, {"paperId": "7eb539d23724fd43296a9337e476f7403b48d7b3", "title": "Research on multi-sound source localization performance based on leaf-shaped microphone array"}, {"paperId": "765eb51ad534e73caf4943f4ee8c6270e414eda8", "title": "Recent Trends in Structures and Interfaces of MEMS Transducers for Audio Applications: A Review"}, {"paperId": "ea7214157d1e96efeca332ebcaffab86e87d7709", "title": "Speaker identification and localization using shuffled MFCC features and deep learning"}, {"paperId": "a3d2ef5dfaf5412925aa77da948221caa64fa455", "title": "Implementation of Real-Time Sound Source Localization using TMS320C6713 Board with Interaural Time Difference Method"}]}
