{"paperId": "ab1c0062964a2df3d7f8d11da4a774530286b801", "publicationVenue": {"id": "911e7332-8ea8-4e9d-bc20-5572a2523f92", "name": "International Middleware Conference", "type": "conference", "alternate_names": ["Middleware", "ACM/IFIP/USENIX int conf Middlew", "ACM/IFIP/USENIX international conference on Middleware", "Int Middlew Conf"], "url": "https://dl.acm.org/conference/middleware/proceedings"}, "title": "Prebaking Functions to Warm the Serverless Cold Start", "abstract": "Function-as-service (FaaS) platforms promise a simpler programming model for cloud computing, in which the developers concentrate on writing its applications. In contrast, platform providers take care of resource management and administration. As FaaS users are billed based on the execution of the functions, platform providers have a natural incentive not to keep idle resources running at the platform's expense. However, this strategy may lead to the cold start issue, in which the execution of a function is delayed because there is no ready resource to host the execution. Cold starts can take hundreds of milliseconds to seconds and have been a prohibitive and painful disadvantage for some applications. This work describes and evaluates a technique to start functions, which restores snapshots from previously executed function processes. We developed a prototype of this technique based on the CRIU process checkpoint/restore Linux tool. We evaluate this prototype by running experiments that compare its start-up time against the standard Unix process creation/start-up procedure. We analyze the following three functions: i) a \"do-nothing\" function, ii) an Image Resizer function, and iii) a function that renders Markdown files. The results attained indicate that the technique can improve the start-up time of function replicas by 40% (in the worst case of a \"do-nothing\" function) and up to 71% for the Image Resizer one. Further analysis indicates that the runtime initialization is a key factor, and we confirmed it by performing a sensitivity analysis based on synthetically generated functions of different code sizes. These experiments demonstrate that it is critical to decide when to create a snapshot of a function. When one creates the snapshots of warm functions, the speed-up achieved by the prebaking technique is even higher: the speed-up increases from 127.45% to 403.96%, for a small, synthetic function; and for a bigger, synthetic function, this ratio increases from 121.07% to 1932.49%.", "venue": "International Middleware Conference", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2020-12-07", "journal": {"name": "Proceedings of the 21st International Middleware Conference"}, "authors": [{"authorId": "2110867199", "name": "Paulo Silva"}, {"authorId": "2189255", "name": "Daniel Fireman"}, {"authorId": "2256708", "name": "T. Pereira"}], "citations": [{"paperId": "2a85f343b47f3a54580d9845cc036703bccba67f", "title": "SPES: Towards Optimizing Performance-Resource Trade-Off for Serverless Functions"}, {"paperId": "bd519576e75063a1b249ada944411aba4ade7e32", "title": "PerOS: Personalized Self-Adapting Operating Systems in the Cloud"}, {"paperId": "b7462464d6929bffd35ff3d3ec2e933417951312", "title": "Cold Start Latency Mitigation Mechanisms in Serverless Computing: Taxonomy, Review, and Future Directions"}, {"paperId": "0f1f02eb82628479284a6a0baad5af4535ff46e5", "title": "Microservices and serverless functions – lifecycle, performance, and resource utilisation of edge based real-time IoT analytics"}, {"paperId": "a688d1f026bf2ab93f95bfc977004a7a8909934f", "title": "Software Resource Disaggregation for HPC with Serverless Computing"}, {"paperId": "eabc7e31bca6c59236e1b5e2a4aec2cfbde2e58d", "title": "Prebaking runtime environments to improve the FaaS cold start latency"}, {"paperId": "c464fb948e85908da3e33fc31868a5e9bd132838", "title": "FASE: fast deployment for dependent applications in serverless environments"}, {"paperId": "c64ff19a6abd8c8350972faf02464a4d561ac498", "title": "FaaSCom: Mitigate Cold Start Problem in FaaS via Function Community"}, {"paperId": "0de1399bcd8de33b199757f295ee7d5987fd2a10", "title": "SnapStore: A Snapshot Storage System for Serverless Systems"}, {"paperId": "37fd5b7b937bd866e4afec5dcc3cb34b084cf39e", "title": "EdgeSimPy: Python-based modeling and simulation of edge computing resource management policies"}, {"paperId": "4e29b6be114e2b98b522099ef1b231949aa6c48a", "title": "HealthFaaS: AI-Based Smart Healthcare System for Heart Patients Using Serverless Computing"}, {"paperId": "cdc442b852f0523be05fef51aa2d8f1c4c636167", "title": "Cryonics: Trustworthy Function-as-a-Service using Snapshot-based Enclaves"}, {"paperId": "8049a85cb3db9a091c730798f454a0ccea55b752", "title": "Cold Start Latency in Serverless Computing: A Systematic Review, Taxonomy, and Future Directions"}, {"paperId": "b2a8f13e22881f2a2c5916a63821abe038d0e6d6", "title": "Prediction-driven resource provisioning for serverless container runtimes"}, {"paperId": "c01e5d63f3dfa3213053df8b872a0ee911768372", "title": "Serverless Computing: What It Is, and What It Is Not?"}, {"paperId": "6841c0ba4196b4ea05ea8579cb615ef1035f03fa", "title": "A Deep Reinforcement Learning based Algorithm for Time and Cost Optimized Scaling of Serverless Applications"}, {"paperId": "6576b0ada586b40c9ed1fa032c66370c25b44534", "title": "Reinforcement Learning (RL) Augmented Cold Start Frequency Reduction in Serverless Computing"}, {"paperId": "6602a90aa14e17d8c12c267e5aee04f44b5ab88c", "title": "Ilúvatar: A Fast Control Plane for Serverless Computing"}, {"paperId": "0bf71472e055f6fe7d44fc8228f2a230364147b2", "title": "Latency and resource consumption analysis for serverless edge analytics"}, {"paperId": "08f19fce7186010d7f6f6cf6dd4e6ca9ab05d1d3", "title": "An Alternative to FaaS Cold Start Latency of Low Request Frequency Applications"}, {"paperId": "5a3bf0eaa5a3ec0b010ea357257894c471aa8079", "title": "A Novel Function Fusion Approach for Serverless Cold Start"}, {"paperId": "30690750983b87eacb299f36910a3c7a618a9f53", "title": "LOPO: An Out-of-order Layer Pulling Orchestration Strategy for Fast Microservice Startup"}, {"paperId": "c759119a1ea64f551a94b61947dca9316792bd81", "title": "ACPM: adaptive container provisioning model to mitigate serverless cold-start"}, {"paperId": "9ac81b28d293c66b869fe1df441be9efed9d8ab0", "title": "Always-On Recording Framework for Serverless Computations: Opportunities and Challenges"}, {"paperId": "6196dc056d221773139187d23d4eeae4559b6429", "title": "P4-assisted seamless migration of serverless applications towards the edge continuum"}, {"paperId": "4d880cca2d9944e3adfc489fc2aeb5403b14ef19", "title": "FaaSched: A Jitter-Aware Serverless Scheduler"}, {"paperId": "27cd21426fe51167dd6ac79d1c83db55a07a2046", "title": "Mitigating Cold Start Problem in Serverless Computing: A Reinforcement Learning Approach"}, {"paperId": "4b575282429d1306a042a83c51741c74a90b99ea", "title": "Serverless Computing: State-of-the-Art, Challenges and Opportunities"}, {"paperId": "d45518ce5741587c4c37ccbc5e74b3fcfd6f80f1", "title": "LCS : Alleviating Total Cold Start Latency in Serverless Applications with LRU Warm Container Approach"}, {"paperId": "05ab07f7b7f85769526550bd715d49a83c8e78db", "title": "Graalvisor: Virtualized Polyglot Runtime for Serverless Applications"}, {"paperId": "f5ce3fd9102f3567d0d11d61d6881a13e88b6fc3", "title": "The uphill journey of FaaS in the open-source community"}, {"paperId": "b99668ae35c4b6796b827657a318fe4b84a757ff", "title": "Mitigating Cold-Start Delay using Warm-Start Containers in Serverless Platform"}, {"paperId": "d4de9cb699d2ab2688117c764414b8f338cf5789", "title": "Cypress: input size-sensitive container provisioning and request scheduling for serverless platforms"}, {"paperId": "dfa329adfdf3bc21b4503a5237f4a55225a78d35", "title": "DayDream: Executing Dynamic Scientific Workflows on Serverless Platforms with Hot Starts"}, {"paperId": "f0f891888058853f8f291c51d09ce2d331dc8121", "title": "Canary: Fault-Tolerant FaaS for Stateful Time-Sensitive Applications"}, {"paperId": "b20b22f107d28fb8d72f8716f7f95e54aa340588", "title": "Colder Than the Warm Start and Warmer Than the Cold Start! Experience the Spawn Start in FaaS Providers"}, {"paperId": "e51a70eb7424aa9720742d987aed7d6713580033", "title": "FaaSLight: General Application-level Cold-start Latency Optimization for Function-as-a-Service in Serverless Computing"}, {"paperId": "2c8975d21ee737c44c1d17b27ee779d98d210d9f", "title": "xAFCL: Run Scalable Function Choreographies Across Multiple FaaS Systems"}, {"paperId": "71dfc5c13be1205941bfb32101bfa650adfc6c84", "title": "Groundhog: Efficient Request Isolation in FaaS"}, {"paperId": "e165e329d675b55c63b4c414700d8ed95cbb92bc", "title": "Topology-aware Serverless Function-Execution Scheduling"}, {"paperId": "e3fc9395545b4bf7a8aba73089f62c52a9fe0c7e", "title": "NEPTUNE: Network- and GPU-aware Management of Serverless Functions at the Edge"}, {"paperId": "414c6f8a55fe8a13feadb5808a0cc4d6147e6fe4", "title": "LatEst: Vertical elasticity for millisecond serverless execution"}, {"paperId": "4e61225f7673fe0c8343d93bc35e379669126b95", "title": "CASY: A CPU Cache Allocation System for FaaS Platform"}, {"paperId": "c24e13c30a1158b77a96d8da0aa52fc69e044042", "title": "Reducing response latency of composite functions-as-a-service through scheduling"}, {"paperId": "8617b86ee2dc2203d03dd47124dc1b991df13e78", "title": "IceBreaker: warming serverless functions better with heterogeneity"}, {"paperId": "36338d869d7589b01c3707d70bece8c320e439e2", "title": "Mitigating Cold Start Problem in Serverless Computing with Function Fusion"}, {"paperId": "0e7c1249f099df978789ee237e7d57a655240ae3", "title": "Kraken: Adaptive Container Provisioning for Deploying Dynamic DAGs in Serverless Platforms"}, {"paperId": "2c3f6003bd003821020ba5a9c3fc5822399b9edc", "title": "Kraken"}, {"paperId": "226c8c7457ed3581ddd7756717f15086ec29f200", "title": "Survey on serverless computing"}, {"paperId": "2b615aa4225cbabaf960bcdb59a647711e46e8d6", "title": "Defuse: A Dependency-Guided Function Scheduler to Mitigate Cold Starts on FaaS Platforms"}, {"paperId": "4955892e76505f8eeb6923eded098f41409542ba", "title": "Validation of a simulation model for FaaS performance benchmarking using predictive validation"}, {"paperId": "24b12c02cf6016274f82aabfe540e7e24c2e9a07", "title": "Performance Evaluation of Snapshot Methods to Warm the Serverless Cold Start"}, {"paperId": "77b25698414648aea2094b2a3e8564f73ea3ff8b", "title": "A Holistic View on Resource Management in Serverless Computing Environments: Taxonomy and Future Directions"}, {"paperId": "2f543827e91b46873307c11ccb11b9554cf7ad10", "title": "Serverless utilization in microservice e-learning platform"}, {"paperId": "cd8a0b69a94a4e326d66ee8c2111db98a9ed12d6", "title": "OS: A Step Forward Towards Enhancing Share and Reuse in Serverless Functions"}, {"paperId": "c3df7972c6db91e9e1efb5323647c31b6ef8bc30", "title": "Decentralized and Stateful Serverless Computing on the Internet Computer Blockchain"}, {"paperId": "238e0823b281f09eb5a96735218386d64dc4a2fe", "title": "rFaaS: Enabling High Performance Serverless with RDMA and Decentralization."}, {"paperId": "e7835393487f69ba96d080d584d55f60571ebaa6", "title": "Topology-aware Serverless Function-Execution Scheduling"}, {"paperId": "06e516f1f6656cea9085a24f7fa1168a076fdcc6", "title": "Process-as-a-Service: FaaSt Stateful Computing with Optimized Data Planes"}, {"paperId": "31582f9e4327b9ea195717b022560d776d122faf", "title": "Serverless on Machine Learning: A Systematic Mapping Study"}, {"paperId": "027e58ab56946d8fb7ed49b38b15824aca7451b0", "title": "Evaluation of Language Runtimes in Open-source Serverless Platforms"}, {"paperId": "323e05be906a771b1c90c492f630901427feb338", "title": "Custom Serverless Function Scheduling Policies: An APP Tutorial"}, {"paperId": "06ad695a3ea4fb62c9d8003bfe08956297874838", "title": "RFaaS: RDMA-Enabled FaaS Platform for Serverless High-Performance Computing"}, {"paperId": "7717a43059cecc8d40651f83187a77d8cf8089a5", "title": "Pronghorn: Effective Checkpoint Orchestration for Serverless Hot-Starts"}, {"paperId": "d872cd54e6fea60f040c4e280cafb806294cf919", "title": "RainbowCake : Mitigating Cold-starts in Serverless with Layer-wise Container Caching and Sharing"}, {"paperId": "89a338bbbe34ef316707452e899ce259ea57fef9", "title": "This paper is included in the Proceedings of the 16th USENIX Symposium on Operating Systems Design and Implementation."}, {"paperId": "aa482167fba7f8ad9cf01fcc2af5c34e32dace00", "title": "require-Serverless Computing: What It Is, and What It Is Not?"}, {"paperId": "6d1f51928c8d96befba2e8435c1b8355913e2739", "title": "Future Generation Computer Systems"}]}
