{"paperId": "ab414fb4b583b72886051f695fb0801ae42a27d7", "publicationVenue": {"id": "ede7e9cc-1657-47d5-bcf1-1ca3b056bf9d", "name": "Journal of Management Information Systems", "type": "journal", "alternate_names": ["J Manag Inf Syst"], "issn": "0742-1222", "url": "http://www.mesharpe.com/mall/results1.asp?ACR=MIS", "alternate_urls": ["http://www.metapress.com/openurl.asp?genre=journal&issn=0742-1222", "http://www.tandfonline.com/toc/mmis20/current", "http://www.tandfonline.com/loi/mmis", "http://www.jstor.org/journals/07421222.html", "https://www.jstor.org/journal/jmanainfosyst", "http://www.jmis-web.org/"]}, "title": "Effect of Crowd Voting on Participation in Crowdsourcing Contests", "abstract": "ABSTRACT While expert rating is still a dominant approach for selecting winners in contests for creative works, a few crowdsourcing platforms have recently used “crowd voting” for winner selection – that is, let users of the crowdsourcing community publicly vote for contest winners. We investigate how a contest’s reliance on crowd voting for winner selection, defined as the percentage of crowd-voted prizes to the total prize sum (in dollar amounts), affects contest participation. Drawing upon expectancy theory and tournament theory, we develop a theoretical understanding of this relationship. Using a novel dataset of contests employing both crowd voting and expert rating, we find that a contest’s reliance on crowd voting is positively associated with participation. Specifically, every 10% increase in the crowd-voting reliance can boost users’ odds of participation by about 7%. Moreover, crowd voting is more appealing to users whose expertise is not high and whose status in the crowdsourcing community is high.", "venue": "Journal of Management Information Systems", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-04-02", "journal": {"name": "Journal of Management Information Systems", "pages": "510 - 535", "volume": "37"}, "authors": [{"authorId": "2146034649", "name": "Liang Chen"}, {"authorId": "2089818994", "name": "Pei Xu"}, {"authorId": "2119027196", "name": "De Liu"}], "citations": [{"paperId": "4391b01d6e3857309cf7b3b70217357d9a6d3ec5", "title": "A Comprehensive Examination of Digital Privacy in Crowdsourcing Applications"}, {"paperId": "5077a25db12b3609587f6d858b0b144ab6cfa3bb", "title": "What drives users’ knowledge payment behaviour? The moderating role of knowledge expertise and social identity"}, {"paperId": "53b4b7aba0ac4a9f12f60664b3490869fe67d6d8", "title": "Optimal Information Acquisition and Sharing Decisions"}, {"paperId": "e2d02f9ce4a8edf404e4fb507c2814c83692ca0a", "title": "How do reward personalization options influence the public’s willingness to participate in innovation projects? Insights from crowdfunding in Industry 5.0"}, {"paperId": "ee0451ae565d2c9ab20162c3337eb760f752cdc4", "title": "Weeding out or picking winners in open innovation? Factors driving multi-stage crowd selection on LEGO ideas"}, {"paperId": "676731e46318eb3b0b902de30e371b0aaf67b79e", "title": "The AI‐augmented crowd: How human crowdvoters adopt AI (or not)"}, {"paperId": "60372ba9d6baac5bd6c0893e19612838d031f4d2", "title": "Do Experts and Laypersons Differ? Some Evidence from International Classical Music Competitions"}, {"paperId": "bf58a0895eefab924a5ca922c21f9631922d7747", "title": "Improving Convenience or Saving Face? An Empirical Analysis of the Use of Facial Recognition Payment Technology in Retail"}, {"paperId": "3fc11d8b7372b5d1c86b8b1e791b0cb4ec9876a9", "title": "Effect of linguistic disfluency on consumer satisfaction: Evidence from an online knowledge payment platform"}, {"paperId": "c99969ba33c01a5993a9d920b4b1f223f02b9f94", "title": "Does one rotten apple always spoil the barrel? The role of perceptions of empowerment when consumers observe destructive others in online co-creation activities"}, {"paperId": "d893e812507d11a56fa21e244cdc0d292cb5a5cd", "title": "Understanding the determinants of the intention to innovate with open government data among potential commercial innovators: a risk perspective"}, {"paperId": "96d6745af843f3e1191678f5c8dc0fdc42488281", "title": "L’impact du statut participant ou non-participant des consommateurs sur l’évaluation des stratégies d’empowerment"}, {"paperId": "ed78930d6cb71bfacddb3636ca6e42aef84a483b", "title": "The impact of consumers’ status - participant or nonparticipant - on the evaluation of empowerment strategies"}, {"paperId": "c180fc623f10346c26b14d728c05c0ac03541791", "title": "Applications of Majority Judgement for Winner Selection in Eurovision Song Contest"}, {"paperId": "cfff40630716e20ec3eee46f06002aba94c4db5e", "title": "Role of motivations, self-regulations, and perceived competitive intensity in solvers’ continuance intention in crowdsourcing contests"}, {"paperId": "9e2a7ab721140a7c78327e6bb8f505d04d868786", "title": "The role of expertise in herding behaviors: evidence from a crowdfunding market"}, {"paperId": "844f3a062055f30a59377324d64d0ea1601fc2d0", "title": "BargCrEx: A System for Bargaining Based Aggregation of Crowd and Expert Opinions in Crowdsourcing"}, {"paperId": "d38c0f0ebebd3c5a340f902d20fb0af4bb9336af", "title": "Motivating participation in crowdsourcing contests: The role of instruction-writing strategy"}, {"paperId": "2841f95243558b57d9dd15164ddd5456f8a8b646", "title": "Do Social Dominance-Based Faultlines Help or Hurt Team Performance in Crowdsourcing Tournaments?"}, {"paperId": "d3add9e24546dcce39b560dec7166ae67464f8e9", "title": "What makes the right OSS contributor tick? Treatments to motivate high-skilled developers"}, {"paperId": "f8ce7b436dec98443467b5606b33c76ac7411131", "title": "Seeker Exemplars and Quantitative Ideation Outcomes in Crowdsourcing Contests"}, {"paperId": "da49cff31cb1c2deced724e6e2b1697dc1fdfa96", "title": "Is self-knowledge the ultimate prize? A quantitative analysis of participation choice in online ideation crowdsourcing contests"}, {"paperId": "0dfb5c3974ac8649e92e2733ce32b729651fe233", "title": "Understanding consumers’ purchase intention towards online paid courses"}, {"paperId": "e120a948d67ac3272d242307262713ff127d5480", "title": "Understanding crowdsourcing projects: A review on the key design elements of a crowdsourcing initiative"}, {"paperId": "b06035a678eb5ae99a8ffad21987b27dcfe5fc76", "title": "Social mechanisms in crowdsourcing contests: a literature review"}, {"paperId": "751e8f8e0c552f587e02ffc7ffc9980995aa5cbd", "title": "How Information and Communication Technology Shapes the Influence of Culture on Innovation: A Country-level Analysis"}, {"paperId": "9231d23e669da3eacd4c15298c52e1adc581d0f0", "title": "CrEx-Wisdom Framework for Fusion of Crowd and Experts in Crowd Voting Environment - Machine Learning Approach"}, {"paperId": "cc1e9e8d298384337625949171847ff8401044cc", "title": "ADBIS, TPDL and EDA 2020 Common Workshops and Doctoral Consortium: International Workshops: DOING, MADEISD, SKG, BBIGAP, SIMPDA, AIMinScience 2020 and Doctoral Consortium, Lyon, France, August 25–27, 2020, Proceedings"}, {"paperId": "ecd61864f965c6169c23953720ce2f6d6b30ba5c", "title": "Two Sides of Collective Decision Making - Votes from Crowd and Knowledge from Experts"}, {"paperId": "378ac5eef4ddf5c89cdb56c1c54b22f86a20eb1b", "title": "Effective Governance Through Crowdsourcing: A Strategic Framework for Empowered Participation"}, {"paperId": "c70000f43d99786a0a8a65fe5fbc427a16439880", "title": "The development of university program recommendation system using crowd-vote method"}, {"paperId": "6626ebf18005203e2a11267225f60f3ba29716a8", "title": "Teaching Tip: Active Learning in the IS Classroom: A Student Crowdpolling Exercise for IS Courses"}, {"paperId": "9e93a8f89fea7121961e5892162a21978588dd95", "title": "Digital Platforms and Infobesity: A Research Agenda"}, {"paperId": "3ad9f5b584caad62f4370a788d01079ada2ae06e", "title": "Decolonization of Digital Platforms: A Research Agenda for GREAT Domains"}]}
