{"paperId": "ab461c399921779c752ccd48f10eb8534bb78426", "publicationVenue": {"id": "13925159-5423-4d57-9ac9-3a05a713e0ef", "name": "ACM Transactions on Embedded Computing Systems", "type": "journal", "alternate_names": ["ACM Transactions in Embedded Computing Systems", "ACM Trans Embed Comput Syst"], "issn": "1539-9087", "url": "http://www.acm.org/pubs/contents/journals/tecs/", "alternate_urls": ["http://www.acm.org/tecs/", "http://portal.acm.org/tecs"]}, "title": "DNN Is Not All You Need: Parallelizing Non-neural ML Algorithms on Ultra-low-power IoT Processors", "abstract": "Machine Learning (ML) functions are becoming ubiquitous in latency- and privacy-sensitive IoT applications, prompting a shift toward near-sensor processing at the extreme edge and the consequent increasing adoption of Parallel Ultra-low-power (PULP) IoT processors. These compute- and memory-constrained parallel architectures need to run efficiently a wide range of algorithms, including key Non-neural ML kernels that compete favorably with Deep Neural Networks in terms of accuracy under severe resource constraints. In this article, we focus on enabling efficient parallel execution of Non-neural ML algorithms on two RISCV-based PULP platforms, namely, GAP8, a commercial chip, and PULP-OPEN, a research platform running on an FPGA emulator. We optimized the parallel algorithms through a fine-grained analysis and intensive optimization to maximize the speedup, considering two alternative Floating-point (FP) emulation libraries on GAP8 and the native FPU support on PULP-OPEN. Experimental results show that a target-optimized emulation library can lead to an average 1.61× runtime improvement and 37% energy reduction compared to a standard emulation library, while the native FPU support reaches up to 32.09× and 99%, respectively. In terms of parallel speedup, our design improves the sequential execution by 7.04× on average on the targeted octa-core platforms leading to energy and latency decrease up to 87%. Last, we present a comparison with the ARM Cortex-M4 microcontroller, a widely adopted commercial solution for edge deployments, which is 12.87× slower than PULP-OPEN.", "venue": "ACM Transactions on Embedded Computing Systems", "year": 2021, "fieldsOfStudy": ["Computer Science", "Engineering"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-07-16", "journal": {"name": "ACM Transactions on Embedded Computing Systems", "pages": "1 - 33", "volume": "22"}, "authors": [{"authorId": "1854419868", "name": "Enrico Tabanelli"}, {"authorId": "2107962", "name": "Giuseppe Tagliavini"}, {"authorId": "1710649", "name": "L. Benini"}], "citations": [{"paperId": "f641b9d771427ad995359d9747ec613bafa4afe9", "title": "Leveraging pervasive computing for ambient intelligence: A survey on recent advancements, applications and open challenges"}, {"paperId": "fd910b0e4f6958826b58b2789fdb2fa60be87ff5", "title": "Memory-efficient Edge-based Non-Neural Face Recognition Algorithm on the Parallel Ultra-Low Power (PULP) Cluster"}, {"paperId": "64459f528a84896a6f29d594821658da3a64358e", "title": "Energy-Efficient Acceleration of Deep Learning based Facial Recognition on RISC-V Processor"}, {"paperId": "923a4c4d9aef86be7bdef2e2b90963234739f204", "title": "NanoSLAM: Enabling Fully Onboard SLAM for Tiny Robots"}, {"paperId": "c97a65788b014794d6d60b2570c1a01c05c5590f", "title": "An Open-Source ML-Based Full-Stack Optimization Framework for Machine Learning Accelerators"}, {"paperId": "64cb48b6992f847a4555c768ca29a0036e31b12d", "title": "Power, Performance and Reliability Evaluation of Multi-thread Machine Learning Inference Models Executing in Multicore Edge Devices"}, {"paperId": "2d60620d9e64fc2344a551ef253b13a0ea508b6e", "title": "Dynamic Decision Tree Ensembles for Energy-Efficient Inference on IoT Edge Nodes"}, {"paperId": "9690470d0f6e044881a4946a53cbeefcb0a733f1", "title": "Parallelizing Non-Neural ML Algorithm for Edge-based Face Recognition on Parallel Ultra-Low Power (PULP) Cluster"}, {"paperId": "5c05dc67c88193ba11f1a00f39a1dfd25ad9bf20", "title": "Energy-Sustainable IoT Connectivity: Vision, Technological Enablers, Challenges, and Future Directions"}, {"paperId": "73305d64c2ce84150459178479a00daeaec62537", "title": "Energy-efficient Hardware Acceleration of Shallow Machine Learning Applications"}, {"paperId": "b28d7493fe13e1a1a4a9e46e402e822897feb3cf", "title": "TinyML: Tools, Applications, Challenges, and Future Research Directions"}, {"paperId": "553a114bdf80f7ad999d1f8b5bfdf3a315f320a7", "title": "LightNILM: lightweight neural network methods for non-intrusive load monitoring"}, {"paperId": "829afc0500b7707e4e95940cc02f09d2381ccc56", "title": "Optimizing Random Forest-Based Inference on RISC-V MCUs at the Extreme Edge"}, {"paperId": "0597bc123d2b364948a22f063dc9de11abedea35", "title": "Physically Accurate Learning-based Performance Prediction of Hardware-accelerated ML Algorithms"}, {"paperId": "577129978a7061f6e45bd8d4a28a89e532fc7e3d", "title": "Energy-efﬁcient Hardware Acceleration of Shallow Machine Learning Applications"}]}
