{"paperId": "ab4817108dc2c52bb562f8846b3403d85aa82289", "publicationVenue": {"id": "bb21160f-0f31-4e34-abab-715b95a870a2", "name": "Indonesian Journal of Electrical Engineering and Computer Science", "type": "journal", "alternate_names": ["Indones J Electr Eng Comput Sci"], "issn": "2502-4752", "url": "http://www.iaescore.com/journals/index.php/IJEECS"}, "title": "Support vector regression-based state of charge estimation for batteries: cloud vs non-cloud", "abstract": "Embracing the potential of cloud technology in the field of electric vehicle advancements, this paper explores the application of support vector regression (SVR) for accurate state of charge (SOC) estimation of lithium-ion batteries in various computational landscapes. This study aims to scrutinize and compare the performance of SOC estimation, with a specific focus on precision, computational efficiency, and execution speed. The investigation is conducted across diverse environments, including a traditional non-cloud setup and two cloud-based platforms-a standard cloud environment employing Amazon web services (AWS) EC2 servers and an enhanced configuration utilizing the MATLAB production server. The investigation not only emphasizes the effectiveness of cloud integration but also provides valuable insights into the strengths and weaknesses of the proposed methodology. The experimental results contribute to a nuanced understanding of the methodology’s performance, shedding light on its potential implications for advancing electric vehicle technologies. This study thus extends its significance beyond technical considerations, providing a broader perspective on its relevance to global electrification initiatives.", "venue": "Indonesian Journal of Electrical Engineering and Computer Science", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-05-01", "journal": {"name": "Indonesian Journal of Electrical Engineering and Computer Science"}, "authors": [{"authorId": "2107866603", "name": "Mohamed Ben Youssef"}, {"authorId": "30537522", "name": "Imen Jarraya"}, {"authorId": "13319856", "name": "M. A. Zdiri"}, {"authorId": "49482549", "name": "F. B. Salem"}], "citations": []}
