{"paperId": "ab4d6672605058d0021b2fb81b52444e389d4647", "publicationVenue": {"id": "d17c802c-e89b-4bcd-81b1-22f8921283fe", "name": "International Conference on Signals and Electronic Systems", "type": "conference", "alternate_names": ["ICSES", "Int Conf Signal Electron Syst"]}, "title": "Detecting and Responding to Cloud Security Incidents based on AI and Forensic Approach", "abstract": "With the use of AI and digital forensics, this paper outlines a complete strategy for handling security incidents in the cloud. The research is meant to improve cloud-based security issue detection and response. The results indicate the promise of this integrated strategy, with AI models improving the accuracy of issue detection and digital forensics speeding incident triage. Improved cloud security, proactive threat detection, optimized resource allocation, and conformity with legal and regulatory standards are only some of the practical consequences discussed in the paper. Advanced AI models, automated incident response, human-machine cooperation, threat intelligence integration, adversarial machine learning, compliance and legal issues, and cross-cloud security are all areas the report suggests further investigation into. In sum, this study aids in developing a more proactive and resilient strategy for handling cloud security incidents in a dynamic digital environment", "venue": "International Conference on Signals and Electronic Systems", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-12-14", "journal": {"name": "2023 International Conference on Innovative Computing, Intelligent Communication and Smart Electrical Systems (ICSES)", "pages": "1-6"}, "authors": [{"authorId": "2292338434", "name": "Dr Kirti Mahajan"}, {"authorId": "2292339625", "name": "Dr.B.Madhavidevi"}, {"authorId": "2292337530", "name": "Dr. B. R. Supreeth"}, {"authorId": "2292278632", "name": "Dr. N. V. S. SreeRathna Lakshmi"}, {"authorId": "2292339070", "name": "Mr. Kireet Joshi"}, {"authorId": "2292338405", "name": "S.Bavankumar"}], "citations": []}
