{"paperId": "ab8a5f0b1195d9b48f7ba53da9f96048d2fdaa4c", "publicationVenue": {"id": "cbc4d7be-e64a-4b62-960b-3eaab7e77d51", "name": "IEEE VLSI Test Symposium", "type": "conference", "alternate_names": ["IEEE VLSI Test Symp", "VTS", "VLSI Test Symp", "VLSI Test Symposium"], "url": "http://www.tttc-vts.org/"}, "title": "Silent Data Errors: Sources, Detection, and Modeling", "abstract": "Chip manufacturers and hyperscalers are becoming increasingly aware of the problem posed by Silent Data Errors (SDE) and are taking steps to address it. Major computing facilities operators like Meta and Google have emphasized the critical role of SDEs in today’s microprocessors. Numerous studies in the literature have highlighted the severity of this issue, especially in datacenter applications operating at large scales. These errors can lead to data loss and require a significant amount of time and effort to resolve through debugging engineering efforts, which can take months to complete. In this paper, we provide an overview of the issue of SDEs, including an explanation of the problem and the current methods used to address it, as well as gaps that still exist in addressing the issue. We also discuss the different sources of SDEs, including post-manufacturing testing failures, voltage and timing marginalities, and hard-to-detect faults. The paper emphasizes the impact of timing marginalities as a significant source of SDEs. Finally, our spotlight points to the architecture and system dimensions of the problem: we describe the challenges of measuring the true (still unknown) rates of SDE from CPUs, and emphasize on the role of detailed microarchitectural simulation models for this purpose. We present data on the severity of SDEs and their predicted rates under various operating conditions, sources of faults, and technology fabrication nodes.", "venue": "IEEE VLSI Test Symposium", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-04-24", "journal": {"name": "2023 IEEE 41st VLSI Test Symposium (VTS)", "pages": "1-12"}, "authors": [{"authorId": "1399890859", "name": "A. Singh"}, {"authorId": "144634410", "name": "S. Chakravarty"}, {"authorId": "145223775", "name": "G. Papadimitriou"}, {"authorId": "1718647", "name": "D. Gizopoulos"}], "citations": [{"paperId": "7a2a706dcd9db8090f06299a660fd01175e4f3ba", "title": "Gem5-MARVEL: Microarchitecture-Level Resilience Analysis of Heterogeneous SoC Architectures"}, {"paperId": "e87a1308355358d8fbba94bf7ed69650f3df64d5", "title": "Impact of Voltage Scaling on Soft Errors Susceptibility of Multicore Server CPUs"}, {"paperId": "13146c8e8b76846116434594c3e057d3b3833b55", "title": "Understanding Silent Data Corruptions in a Large Production CPU Population"}, {"paperId": "5cfb2c46da6e4f5a399e96075b001fac81bcbb7d", "title": "Estimating the Failures and Silent Errors Rates of CPUs Across ISAs and Microarchitectures"}, {"paperId": "9b12485d8e05fe3f1ce3fd15acde4efc0adb3bb7", "title": "Silent Data Corruptions: The Stealthy Saboteurs of Digital Integrity"}]}
