{"paperId": "ab9a5c71542ce30ef877f49c47b832bb830f2018", "publicationVenue": {"id": "a36dc29e-4ea1-4567-b0fe-1c06daf8bee8", "name": "International Conference on Software Engineering", "type": "conference", "alternate_names": ["Int Conf Softw Eng", "ICSE"], "url": "http://www.icse-conferences.org/"}, "title": "Redefining Prioritization: Continuous Prioritization for Continuous Integration", "abstract": "Continuous integration (CI) development environments allow soft-ware engineers to frequently integrate and test their code. While CI environments provide advantages, they also utilize non-trivial amounts of time and resources. To address this issue, researchers have adapted techniques for test case prioritization (TCP) to CI environments. To date, however, the techniques considered have operated on test suites, and have not achieved substantial improvements. Moreover, they can be inappropriate to apply when system build costs are high. In this work we explore an alternative: prioritization of commits. We use a lightweight approach based on test suite failure and execution history that is highly effcient; our approach \"continuously\" prioritizes commits that are waiting for execution in response to the arrival of each new commit and the completion of each previously scheduled commit. We have evaluated our approach on three non-trivial CI data sets. Our results show that our approach can be more effective than prior techniques.", "venue": "International Conference on Software Engineering", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2018-05-27", "journal": {"name": "2018 IEEE/ACM 40th International Conference on Software Engineering (ICSE)", "pages": "688-698"}, "authors": [{"authorId": "153413206", "name": "Jingjing Liang"}, {"authorId": "143754832", "name": "Sebastian G. Elbaum"}, {"authorId": "1722304", "name": "G. Rothermel"}], "citations": [{"paperId": "636cb1d19992772265309a2b2c853272eca317e9", "title": "Resource Usage and Optimization Opportunities in Workflows of GitHub Actions"}, {"paperId": "1d0e18c304946f507ad446517bda07137ea91eee", "title": "Enhancing the Automotive Software Test Environment Using Continuous Integration and Validation Pipeline"}, {"paperId": "39bd108bac25cc26c0b8395ff7922fd917e37bb2", "title": "Revisiting Machine Learning based Test Case Prioritization for Continuous Integration"}, {"paperId": "bbf01ce7fea52987ae096b75328410019e5115a3", "title": "Semantic‐aware two‐phase test case prioritization for continuous integration"}, {"paperId": "cf318a978206d01ab0efde0b060c7fd1c18a2fb1", "title": "TCP-Net++: Test Case Prioritization Using End-to-End Deep Neural Networks - Deployment Analysis and Enhancements"}, {"paperId": "9291205b769264683fd33a3d1592331392bf1a4a", "title": "Learning Test-Mutant Relationship for Accurate Fault Localisation"}, {"paperId": "862527514e2d4c4c907e10ab9fc6489309477cbb", "title": "A Self-attention Agent of Reinforcement Learning in Continuous Integration Testing"}, {"paperId": "31b54e79b4af4b681ab88b5bf01a91d9ed0fd83a", "title": "Test Case Prioritization using Transfer Learning in Continuous Integration Environments"}, {"paperId": "9e88a6e3f1068fd4c265966167919d5de70feb55", "title": "HybridCISave: A Combined Build and Test Selection Approach in Continuous Integration"}, {"paperId": "4a3c215805db716f731dc574e3407fcd3270dcc6", "title": "Evaluating Search-Based Software Microbenchmark Prioritization"}, {"paperId": "24d251b4e81ef9937b7ae0c86c7ed6137b18d0b3", "title": "Some Seeds Are Strong: Seeding Strategies for Search-based Test Case Selection"}, {"paperId": "aa7f9c057804328d863244bf9c43d75cb00f5780", "title": "Simple techniques work surprisingly well for neural network test prioritization and active learning (replicability study)"}, {"paperId": "cf6230ed8b600c38d9ca4eaadde6e1ad6fac3e16", "title": "Preempting Flaky Tests via Non-Idempotent-Outcome Tests"}, {"paperId": "3c55e5d51a199e5f5db9d255c4cf9597e1dc0d5a", "title": "Learning to Rank for Test Case Prioritization"}, {"paperId": "795dc16672cfa04729ce9bbc61c893d588e48dc7", "title": "TCP-Net: Test Case Prioritization using End-to-End Deep Neural Networks"}, {"paperId": "197d83b1a11088a00d3bace219b80df234bbd749", "title": "Which builds are really safe to skip? Maximizing failure observation for build selection in continuous integration"}, {"paperId": "a7f1a09ae2fa90bda26374a1bc72a5d7bf4c77dc", "title": "A Taxonomy of Information Attributes for Test Case Prioritisation: Applicability, Machine Learning"}, {"paperId": "c9586365afd1962683029933152a159291d7e9c9", "title": "A Systematic Literature Review on Test Case Prioritization Techniques"}, {"paperId": "5543ce3cb95343ac3f0012adec71777beb062a62", "title": "Harvesting Production GraphQL Queries to Detect Schema Faults"}, {"paperId": "25a6a38bb83c26fe0f26ec106af53e32735dc296", "title": "Applying test case prioritization to software microbenchmarks"}, {"paperId": "d83974986a4c6fc986e03dfe3f3cb0a9e710fbd6", "title": "DeepOrder: Deep Learning for Test Case Prioritization in Continuous Integration Testing"}, {"paperId": "1fd17127fa6488ccd2d4e39dca8e566a82dc93c7", "title": "Reducing cost in continuous integration with a collection of build selection approaches"}, {"paperId": "91119319745c15d1d628b6dcb87251f981014c36", "title": "Continuous test suite failure prediction"}, {"paperId": "bdab29415be76e68d3c98defb72fc882d9daaf42", "title": "Empirically evaluating readily available information for regression test optimization in continuous integration"}, {"paperId": "8662f9190cd4ce160ce009b473812042fb5cc281", "title": "Weighted Reward for Reinforcement Learning based Test Case Prioritization in Continuous Integration Testing"}, {"paperId": "eb50504262be0e428df38f7b30a86663c33b942d", "title": "CIBench: A Dataset and Collection of Techniques for Build and Test Selection and Prioritization in Continuous Integration"}, {"paperId": "e6c8e50fc573b7e2e09da29cc269d97239f1650f", "title": "What Helped, and what did not? An Evaluation of the Strategies to Improve Continuous Integration"}, {"paperId": "c635a498f3dddb5d040f23772064b6c91af60398", "title": "Neural Network Embeddings for Test Case Prioritization"}, {"paperId": "58920d84d3cf404191f39c6b2abc47a159dc28ee", "title": "Reinforcement Learning for Test Case Prioritization"}, {"paperId": "7eb3af19caf37e77ae3197489de59eab415bba8f", "title": "A systematic study of reward for reinforcement learning based continuous integration testing"}, {"paperId": "3ecd4ccceb6175ff42024d11822241c64df923b4", "title": "Dynamic Time Window based Reward for Reinforcement Learning in Continuous Integration Testing"}, {"paperId": "d8c1df1b941de503cc73c12ae57822232edbbb1f", "title": "A dataset of regressions in web applications detected by end-to-end tests"}, {"paperId": "862a0bfe6593ec157e3ad7dfd0baee2b2a707b46", "title": "BUILDFAST: History-Aware Build Outcome Prediction for Fast Feedback and Reduced Cost in Continuous Integration"}, {"paperId": "ddb9e85a13fd930308559a3090ef4794b216b4bb", "title": "Neural Network Classification for Improving Continuous Regression Testing"}, {"paperId": "5295b553369efd37d93429c452328813b8d52d2c", "title": "Quality Requirements Elicitation by Ideation of Product Quality Risks with Design Thinking"}, {"paperId": "3123a7718438a64bf8157a28a46494bac57c635e", "title": "Dependent-test-aware regression testing techniques"}, {"paperId": "4f9a9a476b1cf8bd50cdce9cd9a445f38980a084", "title": "RTPTorrent"}, {"paperId": "7485ebfd250c34f30be63c03026fe6186db8f07e", "title": "A Cost-efficient Approach to Building in Continuous Integration"}, {"paperId": "c5ba064a0f1cc44e68148797ec4252bed1abea93", "title": "Test Case Prioritization in Continuous Integration environments: A systematic mapping study"}, {"paperId": "c534772510d9df8d5da5286a2fdf70ef32fc723b", "title": "RTPTorrent: An Open-source Dataset for Evaluating Regression Test Prioritization"}, {"paperId": "39e6f60a908e958f89c43601f7d301cc4a5e4f22", "title": "Trends in prioritization of test cases: 2017-2019"}, {"paperId": "a70aa584321d21f994a91e66c865f8cbe1db61a6", "title": "A Time Window based Reinforcement Learning Reward for Test Case Prioritization in Continuous Integration"}, {"paperId": "245b501c6594915141485eba55ae00c3cf010c5b", "title": "Searching for Better Test Case Prioritization Schemes: a Case Study of AI-assisted Systematic Literature Review"}, {"paperId": "537a4dd58babbe7f4612d08aeb091c539b19aa33", "title": "Improvements to test case prioritisation considering efficiency and effectiveness on real faults"}, {"paperId": "d87cc3c77807e9a3cdb63c008187a04aed387057", "title": "A conceptual replication of continuous integration pain points in the context of Travis CI"}, {"paperId": "ee46804877b7bda1a13678f0e587b2dd4668479c", "title": "Continuous software performance assessment: detecting performance problems of software libraries on every build"}, {"paperId": "d016861d0b14b7499e28f48cebc8207ff479eced", "title": "Artificial Intelligence helps making Quality Assurance processes leaner"}, {"paperId": "1ab0131b55aeea7f8be536b970de111fef786b5a", "title": "Assessing Transition-Based Test Selection Algorithms at Google"}, {"paperId": "12190efc83a7d39ec7dfdb78a9197ff2281b0da2", "title": "TERMINATOR: better automated UI test case prioritization"}, {"paperId": "495e2ac8b24b8c9a104946399f2e9dfbab139de0", "title": "An empirical study of the long duration of continuous integration builds"}, {"paperId": "1a2deee0992d800163c37f6493cd45843aca4ad0", "title": "Ahead of Time Mutation Based Fault Localisation using Statistical Inference"}, {"paperId": "add749dd8fceda010c72a0828d6845511e976a37", "title": "Amortising the Cost of Mutation Based Fault Localisation using Statistical Inference"}, {"paperId": "b3bca0bf111b8419c27dacbc3e5b6186684ceb2d", "title": "Assessing Test Case Prioritization on Real Faults and Mutants"}, {"paperId": "eea24a35352d7a80305f189064593dbe76708a40", "title": "Trade-Off Exploration for Acceleration of Continuous Integration"}, {"paperId": "0c5a9c9949d60fb63102dcf43d16d30dcc4fbe2c", "title": "A Theoretical Analysis of Random Regression Test Prioritization"}, {"paperId": "509a056ef19a114a49ed4777aaac4de21c0440b0", "title": "Mathematical Optimization for the Test Case Prioritization Problem"}]}
