{"paperId": "aba282d331b70f044f5da93f4df36de0bd4a4a52", "publicationVenue": {"id": "7431ff67-91dc-41fa-b322-1b1ca657025f", "name": "International Conference on Information and Knowledge Management", "type": "conference", "alternate_names": ["Conference on Information and Knowledge Management", "Conf Inf Knowl Manag", "Int Conf Inf Knowl Manag", "CIKM"], "url": "http://www.cikm.org/"}, "title": "Computing and Maintaining Provenance of Query Result Probabilities in Uncertain Knowledge Graphs", "abstract": "Knowledge graphs (KG) model relationships between entities as labeled edges (or facts). They are mostly constructed using a suite of automated extractors, thereby inherently leading to uncertainty in the extracted facts. Modeling the uncertainty as probabilistic confidence scores results in a probabilistic knowledge graph. Graph queries over such probabilistic KGs require answer computation along with the computation of result probabilities, i.e., probabilistic inference. We propose a system, HAPPI (How Provenance of Probabilistic Inference), to handle such query processing and inference. Complying with the standard provenance semiring model, we propose a novel commutative semiring to symbolically compute the probability of the result of a query. These provenance-polynomial-like symbolic expressions encode fine-grained information about the probability computation process. We leverage this encoding to efficiently compute as well as maintain probabilities of results even as the underlying KG changes. Focusing on conjunctive basic graph pattern queries, we observe that HAPPI is more efficient than knowledge compilation for answering commonly occurring queries with lower range of probability derivation complexity. We propose an adaptive system that leverages the strengths of both HAPPI and compilation based techniques, for not only to perform efficient probabilistic inference and compute their provenance, but also to incrementally maintain them.", "venue": "International Conference on Information and Knowledge Management", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2021-08-17", "journal": {"name": "Proceedings of the 30th ACM International Conference on Information & Knowledge Management"}, "authors": [{"authorId": "35051509", "name": "Garima Gaur"}, {"authorId": "51175000", "name": "Abhishek Dang"}, {"authorId": "145660316", "name": "Arnab Bhattacharya"}, {"authorId": "1751538", "name": "Srikanta J. Bedathur"}], "citations": [{"paperId": "527b1597fd1f517e72ff5b0d56c7d56cec17bfd4", "title": "Grier: graph repairing based on iterative embedding and rules"}]}
