{"paperId": "abaa0771c17504cc83eeb5168ece2b9b30bf2035", "publicationVenue": {"id": "9417c3df-a8da-4b0b-8ace-8096329a9ea9", "name": "Supply Chain Management", "type": "journal", "alternate_names": ["Supply Chain Manag", "Supply chain management", "Supply chain manag"], "issn": "1359-852X", "alternate_issns": ["2627-2938", "1359-8546"], "url": "https://www.emerald.com/insight/publication/issn/1359-8546", "alternate_urls": ["http://www.emeraldgrouppublishing.com/scm.htm"]}, "title": "Leveraging data-driven decisions: a framework for building intracompany capability for supply chain optimization and resilience", "abstract": "\nPurpose\nCompanies are turning to big data (BD) programs to help mitigate supply chain (SC) disruptions and risks that are increasing in frequency and severity. The purpose of this paper is to explore exactly how companies translate data into meaningful information used to manage SC risk and create economic value; an area not well researched. As companies are turning to big-data programs to help mitigate supply chain (SC) disruptions and risks that are increasing in frequency and severity, having the capability to internally integrate SC information is cited as the most critical risk to manage.\n\n\nDesign/methodology/approach\nInformation processing theory and resource-based view are applied to support capability development used to make value-based BD decisions. Semi-structured interviews were conducted with leaders in both the oil and gas industry and logistics SC partners to explore each companies’ BD transformation.\n\n\nFindings\nFindings illuminate how companies can build internal capability to more effectively manage SC risk, optimize operating assets and drive employee engagement.\n\n\nResearch limitations/implications\nThe oil and gas industry were early adopters of gathering BD; more studies addressing how companies translate data to create value and manage SC risk would be beneficial.\n\n\nPractical implications\nGuidance for senior leaders to proactively introduce BD to their company through a practical framework. Further, this study provides insight into where the maximum benefit may reside, as data intersects with other company resources to build an internal capability.\n\n\nOriginality/value\nThis study presents a framework highlighting best practices for introducing BD plus creating a culture capable of using that data to reduce risk during design, implementation and ongoing operations. The steps for producing the maximum benefit are laid out in this study.\n", "venue": "Supply Chain Management", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-15", "journal": {"name": "Supply Chain Management: An International Journal"}, "authors": [{"authorId": "123798653", "name": "Denise Chenger"}, {"authorId": "107692965", "name": "R. Pettigrew"}], "citations": [{"paperId": "43f5d7a7c8a5782f768d2dc50c9a1f9add2a90ab", "title": "Big textual data research for operations management: topic modelling with grounded theory"}, {"paperId": "653b1ce53927e7b3a68533a2549ccd1720181f30", "title": "Developing resilient and robust supply chains through data analytic capability"}]}
