{"paperId": "abab47e7f46c5fe17565873a08231a5fae72fe1e", "publicationVenue": {"id": "7dc964d5-49e6-4c37-b1c4-a7f0de1fa425", "name": "International Conference on Web and Social Media", "type": "conference", "alternate_names": ["Int Conf Weblogs Soc Media", "International Conference on Weblogs and Social Media", "Int Conf Web Soc Media", "ICWSM"], "url": "http://www.aaai.org/Library/ICWSM/icwsm-library.php"}, "title": "Adjusting for Confounders with Text: Challenges and an Empirical Evaluation Framework for Causal Inference", "abstract": "Causal inference studies using textual social media data can provide actionable insights on human behavior. Making accurate causal inferences with text requires controlling for confounding which could otherwise impart bias. Recently, many different methods for adjusting for confounders have been proposed, and we show that these existing methods disagree with one another on two datasets inspired by previous social media studies. Evaluating causal methods is challenging, as ground truth counterfactuals are almost never available. Presently, no empirical evaluation framework for causal methods using text exists, and as such, practitioners must select their methods without guidance. We contribute the first such framework, which consists of five tasks drawn from real world studies. Our framework enables the evaluation of any casual inference method using text. Across 648 experiments and two datasets, we evaluate every commonly used causal inference method and identify their strengths and weaknesses to inform social media researchers seeking to use such methods, and guide future improvements. We make all tasks, data, and models public to inform applications and encourage additional research.", "venue": "International Conference on Web and Social Media", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-09-21", "journal": {"name": "ArXiv", "volume": "abs/2009.09961"}, "authors": [{"authorId": "49687960", "name": "Galen Cassebeer Weld"}, {"authorId": "119659229", "name": "Peter West"}, {"authorId": "2046282", "name": "M. Glenski"}, {"authorId": "144004920", "name": "D. Arbour"}, {"authorId": "1862090", "name": "Ryan A. Rossi"}, {"authorId": "1745524", "name": "Tim Althoff"}], "citations": [{"paperId": "f6322504ac0140287dabc14463958366ecdd92e9", "title": "Causal Inference from Text: Unveiling Interactions between Variables"}, {"paperId": "fb6b446fc31a78462e8d80e53d2266910a4df91f", "title": "Stranger Danger! Cross-Community Interactions with Fringe Users Increase the Growth of Fringe Communities on Reddit"}, {"paperId": "894e8cf18cbec9251d7c911b9433cc85f7150d51", "title": "Natural language processing for mental health interventions: a systematic review and research framework"}, {"paperId": "f2410b3da60ba080031d50b6e2217003173c0eb0", "title": "RCT Rejection Sampling for Causal Estimation Evaluation"}, {"paperId": "9b417791b2e908d1e2a5486578642da19a0817b7", "title": "Effect of Feedback on Drug Consumption Disclosures on Social Media"}, {"paperId": "f9cfac7946c14e17f316d3b662e4acf65fc59cfc", "title": "Google the Gatekeeper: How Search Components Affect Clicks and Attention"}, {"paperId": "efed9ee3578c027bf52f41abaa167931698ebe26", "title": "A Causal View of Entity Bias in (Large) Language Models"}, {"paperId": "64c1ba56a32ed9a42f2cac010de56002380c2408", "title": "Zero-shot causal learning"}, {"paperId": "7506002827e43ba1f62283cd50fabf0766147c68", "title": "Estimating returns to special education: combining machine learning and text analysis to address confounding"}, {"paperId": "f289899130d960b40b9bdda91d7df5bd55db740a", "title": "Identifying Causal Influences on Publication Trends and Behavior: A Case Study of the Computational Linguistics Community"}, {"paperId": "130d432ccbc836380a212bea618f84ff094a6a52", "title": "Causal Inference in Natural Language Processing: Estimation, Prediction, Interpretation and Beyond"}, {"paperId": "9adc1a3307c05ff3c9b0ae595cb57b1de041713f", "title": "Generating Synthetic Text Data to Evaluate Causal Inference Methods"}, {"paperId": "5f35895246015f72c5260375eee2cb6be0ffd9e8", "title": "CoVaxNet: An Online-Offline Data Repository for COVID-19 Vaccine Research"}]}
