{"paperId": "abe136d0bc00e0c14122efc51a37af226e204b74", "publicationVenue": {"id": "d80d58be-58fc-4181-a397-5ac6fd976a47", "name": "ACM Symposium on Applied Computing", "type": "conference", "alternate_names": ["Sel Area Cryptogr", "Int Conf Sel area Cryptogr", "International Conference on Selected areas in Cryptography", "ACM Symp Appl Comput", "Selected Areas in Cryptography", "Symposium on Applied Computing", "SAC", "Symp Appl Comput"], "url": "https://www.acm.org/publications", "alternate_urls": ["http://sacworkshop.org/"]}, "title": "A federated fog-cloud framework for data processing and orchestration: a case study in smart cities", "abstract": "The fog computing paradigm has been proposed to alleviate the pressures on cloud platforms for data processing and enable computation-intensive and delay-sensitive applications in smart cities. However, state-of-the-art approaches mainly advocate either cloud-or fog-based data processing solutions, and they also lack a common framework for programming over the fog-cloud continuum. In this paper, we propose a distributed, fog-cloud data processing and orchestration framework, which is capable of exploiting the semantics of both fog platforms and the Cloud. Our framework can create on-demand process engine data flow (PEDF) spanning multiple device layers with various resource constraints. This will considerably help the developers rapidly develop and deploy data processing applications over the fog-cloud continuum. Our proposed framework is validated in a real-world scenario---IoT data streaming analytics for the smart green wall in a smart city---which demonstrates efficient resource usage and latency reduction.", "venue": "ACM Symposium on Applied Computing", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2021-03-22", "journal": {"name": "Proceedings of the 36th Annual ACM Symposium on Applied Computing"}, "authors": [{"authorId": "51043175", "name": "Dapeng Lan"}, {"authorId": "2146399382", "name": "Yu Liu"}, {"authorId": "2848485", "name": "Amirhosein Taherkordi"}, {"authorId": "1743900", "name": "F. Eliassen"}, {"authorId": "3253577", "name": "Stéphane Delbruel"}, {"authorId": "2150801768", "name": "Lei Liu"}], "citations": [{"paperId": "e0ec1e44f5801682ff98726a89b9dc36c444544f", "title": "Fog computing approaches in IoT-enabled smart cities"}, {"paperId": "83b223eded785344d98fd6e5f6f9494a8e3d5c1e", "title": "Integrated intelligent IOT forensic framework for data acquisition through open-source tools"}, {"paperId": "0f0d5b1b74605efbe6926beb10cf819847629b97", "title": "City Vertical Gardening"}]}
