{"paperId": "abe1b37a8bb0f76641732fd2cdb7d2da85eacb47", "publicationVenue": {"id": "9846de51-dadf-4086-9e40-62466a7e2c87", "name": "International Conference on Fog and Mobile Edge Computing", "type": "conference", "alternate_names": ["FMEC", "Int Conf Fog Mob Edge Comput"]}, "title": "Security Threats and Challenges to IoT and its Applications: A Review", "abstract": "The emergence and rapid growth of Internet of Things (IoT) with unlimited benefits, facilities and applications provided such as smart cities, smart home, intelligent transportation (ITS), smart health and smart grids impacts everyone's lives. However, IoT based systems and applications are vulnerable to various security threats and attacks due to their deployment and use of sensing devices. Moreover, the lack of standardization due to heterogeneity of devices and technologies implementing security in IoT is real challenge. The aim of this review paper is to highlight the various security threats, challenges and attacks faced by IoT enable applications.", "venue": "International Conference on Fog and Mobile Edge Computing", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference", "Review"], "publicationDate": "2020-04-01", "journal": {"name": "2020 Fifth International Conference on Fog and Mobile Edge Computing (FMEC)", "pages": "301-305"}, "authors": [{"authorId": "9296811", "name": "R. W. Anwar"}, {"authorId": "3095951", "name": "A. Zainal"}, {"authorId": "1712242063", "name": "Tariq Abdullah"}, {"authorId": "47379767", "name": "Saleem Iqbal"}], "citations": [{"paperId": "524da46bbd5e7f9ae5430c49e9d67f8a2b1d4d58", "title": "Real-Time Threat Detection and Countermeasures in IoT Environments"}, {"paperId": "ae8e99e9e09053314ef86aac9ea77d0d1898418e", "title": "Data Privacy, Conceptual Framework for IoT Based Devices in Healthcare: A Systematic Review"}, {"paperId": "989f9c7fffc820bd406197d0140f743ce19c6877", "title": "Privacy and Trust in IoT Ecosystems with Big Data: A Survey of Perspectives and Challenges"}, {"paperId": "066d613e850cb9d93a90c77248bd40b3139939b2", "title": "Role of IoT in Industry 4.0"}, {"paperId": "d984619ca7161175abfd2eb38b8ddc72df7fd194", "title": "Uncertainty and Its Role in IoT Risk Management"}]}
