{"paperId": "abe36ba626e26d781d4778df6c0b5e593629f3bf", "publicationVenue": {"id": "7b2adce0-d53f-49d6-8784-b0645604fe62", "name": "ACM Computing Surveys", "type": "journal", "alternate_names": ["ACM Comput Surv"], "issn": "0360-0300", "url": "http://www.acm.org/pubs/surveys/", "alternate_urls": ["http://portal.acm.org/csur", "https://csur.acm.org/", "http://csur.acm.org/"]}, "title": "A Survey of Approaches to Unobtrusive Sensing of Humans", "abstract": "The increasing amount of human-related and/or human-originated data in current systems is both an opportunity and a challenge. Nevertheless, despite relying on the processing of large amounts of data, most of the so-called smart systems that we have nowadays merely consider humans as sources of data, not as system beneficiaries or even active “components.” For truly smart systems, we need to create systems that are able to understand human actions and emotions, and take them into account when deciding on the system behavior. Naturally, in order to achieve this, we first have to empower systems with human sensing capabilities, possibly in ways that are as inconspicuous as possible. In this context, in this article we survey existing approaches to unobtrusive monitorization of human beings, namely, of their activity, vital signs, and emotional states. After setting a taxonomy for human sensing, we proceed to present and analyze existing solutions for unobtrusive sensing. Subsequently, we identify and discuss open issues and challenges in this area. Although there are surveys that address some of the concerned fields of research, such as healthcare, human monitorization, or even the use-specific techniques like channel state information or image recognition, as far as we know this is the first comprehensive survey on unobtrusive sensing of human beings.", "venue": "ACM Computing Surveys", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-01-18", "journal": {"name": "ACM Computing Surveys (CSUR)", "pages": "1 - 28", "volume": "55"}, "authors": [{"authorId": "1576108201", "name": "J. Fernandes"}, {"authorId": "41182282", "name": "J. Silva"}, {"authorId": "144814326", "name": "A. Rodrigues"}, {"authorId": "1687051", "name": "F. Boavida"}], "citations": [{"paperId": "dc37e4798b1372e9cb326edb7ace639c938a8f7d", "title": "Ambient health sensing on passive surfaces using metamaterials."}, {"paperId": "1e4c30b0e8a62bd281ed3284b0b8fdf890cef496", "title": "Non-contact Multimodal Indoor Human Monitoring Systems: A Survey"}, {"paperId": "a9fd5b7ccb1676f77c5e926b51adf6c4294add74", "title": "Utilising Emotion Monitoring for Developing Music Interventions for People with Dementia: A State-of-the-Art Review"}, {"paperId": "0832910fc389d510cd93739753782f92087df329", "title": "Machine Learning Sensors for Diagnosis of COVID-19 Disease Using Routine Blood Values for Internet of Things Application"}, {"paperId": "4f0d940a12083d96d4e8ec1ab9f4afe237f22020", "title": "Human Sensing by Using Radio Frequency Signals: A Survey on Occupancy and Activity Detection"}]}
