{"paperId": "abee8ca38e6941a96385e35e07b837acfaf63ad2", "publicationVenue": {"id": "036e4843-9039-4bf3-a12d-2ee5b12cdee8", "name": "International Conference on Trust, Privacy and Security in Intelligent Systems and Applications", "type": "conference", "alternate_names": ["TPS-ISA", "Int Conf Trust Priv Secur Intell Syst Appl"]}, "title": "ForensiBlock: A Provenance-Driven Blockchain Framework for Data Forensics and Auditability", "abstract": "Maintaining accurate provenance records is paramount in digital forensics, as they underpin evidence credibility and integrity, addressing essential aspects like accountability and reproducibility. Blockchains have several properties that can address these requirements. Previous systems utilized public blockchains, i.e., treated blockchain as a black box, and benefiting from the immutability property. However, the blockchain was accessible to everyone, giving rise to security concerns and moreover, efficient extraction of provenance faces challenges due to the enormous scale and complexity of digital data. This necessitates a tailored blockchain design for digital forensics. Our solution, Forensiblock has a novel design that automates investigation steps, ensures secure data access, traces data origins, preserves records, and expedites provenance extraction. Forensiblock incorporates Role-Based Access Control with Staged Authorization (RBAC-SA) and a distributed Merkle root for case tracking. These features support authorized resource access with an efficient retrieval of provenance records. Particularly, comparing two methods for extracting provenance records - off-chain storage retrieval with Merkle root verification and a brute-force search - the off-chain method is significantly better, especially as the blockchain size and number of cases increase. We also found that our distributed Merkle root creation slightly increases smart contract processing time but significantly improves history access. Overall, we show that Forensiblock offers secure, efficient, and reliable handling of digital forensic data.", "venue": "International Conference on Trust, Privacy and Security in Intelligent Systems and Applications", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-08-07", "journal": {"name": "2023 5th IEEE International Conference on Trust, Privacy and Security in Intelligent Systems and Applications (TPS-ISA)", "pages": "136-145"}, "authors": [{"authorId": "2212782438", "name": "Asma Jodeiri Akbarfam"}, {"authorId": "2230408670", "name": "Mahdieh Heidaripour"}, {"authorId": "47457316", "name": "Hoda Maleki"}, {"authorId": "51175297", "name": "Gokila Dorai"}, {"authorId": "145340303", "name": "G. Agrawal"}], "citations": [{"paperId": "2a4bf5983562f9f10e3968f4a68c1950f1cc67fc", "title": "Stable Blockchain Sharding under Adversarial Transaction Generation"}, {"paperId": "fa464709ebefff6c8a418c4c1b565756148b87d4", "title": "Deep Learning meets Blockchain for Automated and Secure Access Control"}, {"paperId": "3096144dad06e830d65b2aabfeb07b7bc62dc40a", "title": "GM-Ledger: Blockchain-Based Certificate Authentication for International Food Trade"}]}
