{"paperId": "abf1d20cc076dcf60693405a82eb2d8f7af5b57c", "publicationVenue": null, "title": "An l½ and Graph Regularized Subspace Clustering Method for Robust Image Segmentation", "abstract": "Segmenting meaningful visual structures from an image is a fundamental and most-addressed problem in image analysis algorithms. However, among factors such as diverse visual patterns, noise, complex backgrounds, and similar textures present in foreground and background, image segmentation still stands as a challenging research problem. In this article, the proposed method employs an unsupervised method that addresses image segmentation as subspace clustering of image feature vectors. Initially, an image is partitioned into a set of homogeneous regions called superpixels, from which Local Spectral Histogram features are computed. Subsequently, a feature data matrix is created whereupon subspace clustering methodology is applied. A single-stage optimization model is formulated with enhanced segmentation capabilities by the combined action of l½ and l2 norm minimization. Robustness of l½ regularization toward both the noise and overestimation of sparsity provides simultaneous noise robustness and better subspace selection, respectively. While l2 norm facilitates grouping effect. Hence, the designed optimization model ensures an improved sparse solution and a sparse representation matrix with an accurate block diagonal structure, which thereby favours getting properly segmented images. Then, experimental results of the proposed method are compared with the state-of-art algorithms. Results demonstrate the improved performance of our method over the state-of-art algorithms.", "venue": "ACM Trans. Multim. Comput. Commun. Appl.", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-02-16", "journal": {"name": "ACM Transactions on Multimedia Computing, Communications, and Applications (TOMM)", "pages": "1 - 24", "volume": "18"}, "authors": [{"authorId": "2067906778", "name": "Jobin Francis"}, {"authorId": "47145989", "name": "M. Baburaj"}, {"authorId": "2288329277", "name": "S. N. George"}], "citations": [{"paperId": "ca9a9268288bc200a3a0ff3db5242bf5b53bf357", "title": "A comprehensive review and new taxonomy on superpixel segmentation"}, {"paperId": "a51adf4e34240a422ecdb498ed291fe4e8f87568", "title": "Subspace Clustering via Adaptive Non-Negative Representation Learning and Its Application to Image Segmentation"}, {"paperId": "ea3a7a04d985cef9af111335e4e1b604112da12d", "title": "Projection-preserving block-diagonal low-rank representation for subspace clustering"}, {"paperId": "8b028419b40dfc6adc8c893f4bebba8d6b140d3c", "title": "Tensor-based multi-feature affinity graph learning for natural image segmentation"}, {"paperId": "975a424c9b55838a43f3ab6d32f1180b00fbc23a", "title": "A Survey on High-Dimensional Subspace Clustering"}, {"paperId": "f547415972507c9f62812518b5e0bf3538faced2", "title": "Leveraging spatio-temporal features using graph neural networks for human activity recognition"}]}
