{"paperId": "abf49c96f33b9d99c9f455374717391d1dab0908", "publicationVenue": {"id": "b4ddf99b-89f6-42b4-8bbc-9bde693530cf", "name": "International Journal of Information Management", "type": "journal", "alternate_names": ["Int J Inf Manag"], "issn": "0268-4012", "url": "http://www.elsevier.com/wps/find/journaldescription.cws_home/30434/description#description", "alternate_urls": ["https://www.journals.elsevier.com/international-journal-of-information-management", "http://www.sciencedirect.com/science/journal/02684012"]}, "title": "How can artificial intelligence enhance car manufacturing? A Delphi study-based identification and assessment of general use cases", "abstract": null, "venue": "International Journal of Information Management", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-06-01", "journal": {"name": "Int. J. Inf. Manag.", "pages": "102317", "volume": "58"}, "authors": [{"authorId": "1395911444", "name": "Quirin Demlehner"}, {"authorId": "2057867540", "name": "Daniel Schoemer"}, {"authorId": "1734224", "name": "Sven Laumer"}], "citations": [{"paperId": "647fd16d962c978d7b0b0987e7aba9aa1fa0c958", "title": "Exploring how to develop data-driven innovation capability of marketing within B2B firms: Toward a capability model and process-oriented approach"}, {"paperId": "7161c27b068f4c31ed1b93f30a8ebb9ab02cc50d", "title": "AI Health Counselor’s Self-Disclosure: Its Impact on User Responses Based on Individual and Cultural Variation"}, {"paperId": "0792b3776536d58968b5ae0112632a52bc8e975d", "title": "Analysis on the effects of global supply chain reconfiguration on China's high-end equipment manufacturing industry"}, {"paperId": "165670a5edd96f7462ed394110f18d643c752106", "title": "The era of business analytics: identifying and ranking the differences between business intelligence and data science from practitioners’ perspective using the Delphi method"}, {"paperId": "ce845fc088874266fe99739dceb3da042b5e9c91", "title": "How the Terminator might affect the car manufacturing industry: Examining the role of pre-announcement bias for AI-based IS adoptions"}, {"paperId": "46942e52c3c5ebcf784b139190abf5758c5fce22", "title": "Artificial intelligence - partner relationships management for climate management in B2B firms to achieve sustainable competitiveness"}, {"paperId": "31151440de26be69a7a1f3c9c87a9bd7c2c5e2d2", "title": "Advent of Artificial Intelligence in Automotive Engineering"}, {"paperId": "3f800681fad81f0d23db45666d46971beba23cfc", "title": "Can enterprise green technology innovation performance achieve “corner overtaking” by using artificial intelligence?—Evidence from Chinese manufacturing enterprises"}, {"paperId": "130ab91497c19742c0aec91dc4d764139737d45f", "title": "Disentangling Human-AI Hybrids"}, {"paperId": "9f3d5205b002a5eada8fad631f57a420e328622b", "title": "Analysis of cutting-edge technologies for enterprise information system and management"}, {"paperId": "6e22a91d9d7cf85e6dacf9536acddb828d73d522", "title": "Artificial intelligence and relocation of production activities: An empirical cross-national study"}, {"paperId": "b87904fb43e1c7cd99f441adf8cd2a0026ad253f", "title": "Advanced artificial intelligence system by intuitionistic fuzzy \n \n \n \n $$\\Gamma$$\n \n Γ\n \n -subring for automotive robotic manufacturing"}, {"paperId": "2cff9e8ed875270ac96c753e5667ad4a2116d805", "title": "Engineering AI-Enabled Computer Vision Systems: Lessons From Manufacturing"}, {"paperId": "6b04fbd815b60a3da46b8ca45712e74d858139a8", "title": "Scientific Research Management Helping the Development of Regional Cultural Industry from the Perspective of Artificial Intelligence"}, {"paperId": "152b616ffef6ae1d28398f3aadaed5e97502b2a8", "title": "Examining the Effects of Cognitive Assistive Agents on Team Coordination in Manufacturing Teams"}, {"paperId": "2b8e1e0e25467444d9b4777b70333d4a8b67016c", "title": "Structural Analysis of Monocoque Chassis with and without a B-Pillar"}, {"paperId": "6ae343cee0f295fc42f02e586a0c2a917475f8b2", "title": "Data intelligence and analytics: A bibliometric analysis of human–Artificial intelligence in public sector decision-making effectiveness"}, {"paperId": "c1d7fb919302525577793dc2f18280c08741a3e0", "title": "Mapping the Wave of Industry Digitalization by Co-Word Analysis: An Exploration of Four Disruptive Industries"}, {"paperId": "4091c28a7f946f21425d4e9a6d35a608b29a6491", "title": "Enablers and Inhibitors of AI-Powered Voice Assistants: A Dual-Factor Approach by Integrating the Status Quo Bias and Technology Acceptance Model"}, {"paperId": "f7fa52c859bdcf4a36e99d0323d339d23addef8c", "title": "Exploring Artificial Intelligence in Drug Discovery: A Comprehensive Review"}, {"paperId": "582b84738900fbfe093f3887b01215fb7f8bfe44", "title": "IMPACT OF ARTIFICIAL INTELLIGENCE AND SERVICE ROBOTS IN TOURISM AND HOSPITALITY SECTOR: CURRENT USE & FUTURE TRENDS"}, {"paperId": "022218cab1b3bc0009a5112aa57ff2abe595d8b8", "title": "Artificial intelligence as an enabler of B2B marketing: A dynamic capabilities micro-foundations approach"}, {"paperId": "c69d1bf4ba776d8b1ea913b4cbbb793b9e692a56", "title": "What impacts customer experience for B2B enterprises on using AI-enabled chatbots? Insights from Big data analytics"}, {"paperId": "31e7099ba50ce27d2f0a0cf6a9b864b4ec6a5cc3", "title": "Theorizing artificial intelligence acceptance and digital entrepreneurship model"}, {"paperId": "3f3de48cf2fc17041295c6036a23222cbefc17cd", "title": "Understanding AI adoption in manufacturing and production firms using an integrated TAM-TOE model"}, {"paperId": "40b8804d8a7ef98eb48c4b43063bd606f0a77720", "title": "The effect of AI-based CRM on organization performance and competitive advantage: An empirical analysis in the B2B context"}, {"paperId": "ea91741be094e01e7d749fecdd062da48a875c20", "title": "How to Build an AI Climate-Driven Service Analytics Capability for Innovation and Performance in Industrial Markets?"}, {"paperId": "1a5c409d07cccb0928de9988673482116b414048", "title": "Artificial intelligence implementation in manufacturing SMEs: A resource orchestration approach"}, {"paperId": "0e2eb39e0d76bdf0dbf608da08515f624cba897f", "title": "Use-Case-based Innovation for Artificial Intelligence - an Ontological Approach"}, {"paperId": "9b4bbfc7e31b1be501f34eac882d13cd0db0e919", "title": "Impact of artificial intelligence assimilation on firm performance: The mediating effects of organizational agility and customer agility"}, {"paperId": "7b1be133116185bba16077e265555909ee5413b6", "title": "Designing AI-based systems to last: Identifying the enablers and inhibitors for the AI usage intentions of automotive blue-collar workers"}, {"paperId": "f002119262d5e318cf91255930c1fc55706624c0", "title": "Improving a Manufacturing Process using Recursive Artificial Intelligence"}]}
