{"paperId": "abfc1905234674ffa10a3c92bb8765172c458b40", "publicationVenue": {"id": "d13e941e-4cac-4f1d-bdca-77d927e31f1b", "name": "ACM Symposium on Cloud Computing", "type": "conference", "alternate_names": ["System-on-Chip Conference", "ACM Symp Cloud Comput", "Syst Conf", "Symp Cloud Comput", "Annual IEEE International System-on-Chip Conference", "Symposium on Cloud Computing", "Annu IEEE Int Syst Conf", "SoCC"], "url": "http://www.ieee-socc.org/"}, "title": "Serving unseen deep learning models with near-optimal configurations: a fast adaptive search approach", "abstract": "Public clouds provide a bewildering choice of configurations for Deep Learning (DL) models, and the choice of configuration will significantly impact the performance and budget. However, it is an obvious challenge to recommend a near-optimal configuration for a particular DL model from a wide range of candidates. The huge search overhead of finding such a configuration is the notorious cold start problem in state-of-the-art efforts, and this problem becomes more severe when they are faced with unseen DL models. In this paper, we present Falcon, a novel configuration recommender system that can quickly adapt to unseen DL models. Through a large-scale evaluation, we find that there are some Key Operators (KOPs) that can be used to estimate the performance of DL models, and their resource sensitivity can be represented by four typical Key Operator Resource Curves (KOP-RCs). This work can effectively alleviate the cold start problem, because an unseen DL model can be characterized by its KOPs and corresponding KOP-RCs, and this characterization can be constructed as a tree structure in which near-optimal configurations can be searched quickly through a combination of Monte Carlo Tree Search and Bayesian optimization (MCTS-BO). Experiments show that Falcon can effectively reduce the search overhead for unseen DL models by up to 80% compared to state-of-the-art efforts.", "venue": "ACM Symposium on Cloud Computing", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2022-11-07", "journal": {"name": "Proceedings of the 13th Symposium on Cloud Computing"}, "authors": [{"authorId": "80611599", "name": "Yuewen Wu"}, {"authorId": "1471242321", "name": "Heng Wu"}, {"authorId": "2061549791", "name": "Diaohan Luo"}, {"authorId": "2125754544", "name": "Yuanjia Xu"}, {"authorId": "2149297481", "name": "Yi Hu"}, {"authorId": "2108185473", "name": "Wen-bo Zhang"}, {"authorId": "145901388", "name": "Hua Zhong"}], "citations": []}
