{"paperId": "ac01adc12cd2a1fd6381e57afbe77d20d8d8fe88", "publicationVenue": {"id": "9edb146e-1733-42d6-9ac6-91bced84ca22", "name": "Web Science Conference", "type": "conference", "alternate_names": ["Web Sci", "Web Science", "Web Sci Conf", "WebSci"]}, "title": "Understanding Online Migration Decisions Following the Banning of Radical Communities", "abstract": "The proliferation of radical online communities and their violent offshoots has sparked great societal concern. However, the current practice of banning such communities from mainstream platforms has unintended consequences: (i) the further radicalization of their members in fringe platforms where they migrate; and (ii) the spillover of harmful content from fringe back onto mainstream platforms. Here, in a large observational study on two banned subreddits, r/The_Donald and r/fatpeoplehate, we examine how factors associated with the RECRO radicalization framework relate to users’ migration decisions. Specifically, we quantify how these factors affect users’ decisions to post on fringe platforms and, for those who do, whether they continue posting on the mainstream platform. Our results show that individual-level factors, those relating to the behavior of users, are associated with the decision to post on the fringe platform. Whereas social-level factors, users’ connection with the radical community, only affect the propensity to be coactive on both platforms. Overall, our findings pave the way for evidence-based moderation policies, as the decisions to migrate and remain coactive amplify unintended consequences of community bans.", "venue": "Web Science Conference", "year": 2022, "fieldsOfStudy": ["Computer Science", "Physics", "Mathematics"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2022-12-09", "journal": {"name": "Proceedings of the 15th ACM Web Science Conference 2023"}, "authors": [{"authorId": "2057794776", "name": "Giuseppe Russo"}, {"authorId": "2164356774", "name": "Manoel Horta Ribeiro"}, {"authorId": "31796970", "name": "Giona Casiraghi"}, {"authorId": "51965804", "name": "Luca Verginer"}], "citations": [{"paperId": "43de11ef1ac04b3597a0a70011fd63ca3a05a972", "title": "Deplatforming Norm-Violating Influencers on Social Media Reduces Overall Online Attention Toward Them"}, {"paperId": "fb6b446fc31a78462e8d80e53d2266910a4df91f", "title": "Stranger Danger! Cross-Community Interactions with Fringe Users Increase the Growth of Fringe Communities on Reddit"}, {"paperId": "a012bae4cd4d13faff7ef018ae8601771ca80c07", "title": "UPB @ ACTI: Detecting Conspiracies using fine tuned Sentence Transformers"}, {"paperId": "18beeb4480203424024fffb606c7de07174cc96f", "title": "ACTI at EVALITA 2023: Automatic Conspiracy Theory Identification Task Overview (short paper)"}, {"paperId": "032962bfc563e2caf986d3b3746f3217303be1b0", "title": "Extracting Victim Counts from Text"}, {"paperId": "72e6298b30bdb79263a7bee428b2fae3b696c076", "title": "Spillover of Antisocial Behavior from Fringe Platforms: The Unintended Consequences of Community Banning"}, {"paperId": "d08e108fdad447c6b47240e6ed1dda23afd0ebbd", "title": "Helping a Friend or Supporting a Cause? Disentangling Active and Passive Cosponsorship in the U.S. Congress"}, {"paperId": "221296b014313e1dadd8ebcf95930a2f1343ac7c", "title": "ACTI at EVALITA 2023: Overview of the Conspiracy Theory Identification Task"}, {"paperId": "b58a3e10e6e52594591f99d08839868e57072ed5", "title": "ACTI Task Report – Transformer-basedConspiracy Theory Identification"}, {"paperId": "4d712576a83f1613a01ee0736ae8ac420e64bbbd", "title": "sCambiaMenti at ACTI: Ensemble model with majority voting for Automatic Conspiracy Detection (short paper)"}, {"paperId": "068793b5878f09e3237a06ba3f6aab8fc04c08e3", "title": "Cicognini at ACTI: Analysis of techniques for conspiracies individuation in Italian (short paper)"}, {"paperId": "360c24b7424cf469f4648f8d0a262c130c6663c2", "title": "UPB at ACTI: Detecting Conspiracies using fine tuned Sentence Transformers (short paper)"}, {"paperId": "379d8b414a80e72de6cbbfe10f98691308af7a35", "title": "Giobergia at Multi-Task Transformer Tuning for Joint Conspiracy Theory Detection and Classification"}, {"paperId": "f2c7438917190883cc5f81abb7773dccca674994", "title": "Vitali at ACTI - Transformer-based Conspiracy Theory Identification"}]}
