{"paperId": "ac033877465cc14939327cff1dd51573c3f92ef1", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Enhancing Spatial Debris Material Classifying through a Hierarchical Clustering-Fuzzy C-Means Integration Approach", "abstract": "This paper presents a novel approach for clustering spectral polarization data acquired from space debris using a fuzzy C-means (FCM) algorithm model based on hierarchical agglomerative clustering (HAC). The effectiveness of the proposed algorithm is verified using the Kosko subset measure formula. By extracting characteristic parameters representing spectral polarization from laboratory test data of space debris samples, a characteristic matrix for clustering is determined. The clustering algorithm’s parameters are determined through a random selection of points in the external field. The resulting algorithm is applied to pixel-level clustering processing of spectral polarization images, with the clustering results rendered in color. The experimental results on field spectral polarization images demonstrate a classification accuracy of 96.92% for six types of samples, highlighting the effectiveness of the proposed approach for space debris detection and identification. The innovation of this study lies in the combination of HAC and FCM algorithms, using the former for preliminary clustering, and providing a more stable initial state for the latter, thereby improving the effectiveness, adaptability, accuracy, and robustness of the algorithm. Overall, this work provides a promising foundation for space debris classification and other related applications.", "venue": "Applied Sciences", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-04-10", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "2065458027", "name": "Fengqi Guo"}, {"authorId": "3021549", "name": "Jingping Zhu"}, {"authorId": "47033227", "name": "Liqing Huang"}, {"authorId": "2145536726", "name": "Haoxiang Li"}, {"authorId": "34280137", "name": "Jinxin Deng"}, {"authorId": "2158157531", "name": "Huilin Jiang"}, {"authorId": "2214124587", "name": "Xun Hou"}], "citations": [{"paperId": "3c6e8fa8bd688a191329e1df4b7b79ba2102d5f3", "title": "Multi-Dimensional Fusion of Spectral and Polarimetric Images Followed by Pseudo-Color Algorithm Integration and Mapping in HSI Space"}]}
