{"paperId": "ac108937037131de59eb540e5e20f9468e2f0818", "publicationVenue": {"id": "7c9d091e-015e-4e5d-a11f-9bc369fcf414", "name": "IEEE Transactions on Parallel and Distributed Systems", "type": "journal", "alternate_names": ["IEEE Trans Parallel Distrib Syst"], "issn": "1045-9219", "url": "http://www.computer.org/tpds", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=71"]}, "title": "Turbo: Dynamic and Decentralized Global Analytics via Machine Learning", "abstract": "Big data analytics are practiced in many fields to extract insights from massive amounts of data. With exponential growth in both the volume and variety of data, analytic queries have expanded from those executed in a single datacenter to those requiring inputs from multiple datacenters that are geographically separate or even globally distributed. Unfortunately, the software stack that supports data analytics is designed originally for a cluster environment and is not tailored to execute global analytic queries, where resources such as inter-datacenter networks may vary on the fly. Existing optimization strategies that determine the query execution plan before its execution are not able to adapt to resource variations at query runtime. In this article, we present Turbo, a lightweight and non-intrusive global analytics system that can dynamically adjust query execution plans for geo-distributed analytics in the presence of time-varying resources and network bandwidth across datacenters. Turbo uses machine learning to accurately predict the time cost of a query execution plan so that dynamic adjustments can be made to it when necessary. Turbo is non-intrusive in the sense that it does not require modifications to the existing software stack for data analytics. We have implemented a real-world prototype of Turbo, and evaluated it on a cluster of 33 instances across eight regions in the Google Cloud Platform. Our experimental results have shown that Turbo can achieve an accuracy of 95 percent for estimating time costs, and can reduce the query completion time by 41 percent.", "venue": "IEEE Transactions on Parallel and Distributed Systems", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-01-07", "journal": {"name": "IEEE Transactions on Parallel and Distributed Systems", "pages": "1372-1386", "volume": "31"}, "authors": [{"authorId": "39483391", "name": "Hao Wang"}, {"authorId": "1714907", "name": "Di Niu"}, {"authorId": "91269142", "name": "Baochun Li"}], "citations": [{"paperId": "28046efa97f66923b4e24072dc614333b99aeea6", "title": "RAGraph: A Region-Aware Framework for Geo-Distributed Graph Processing"}, {"paperId": "bb6c2fa7bd6734d9a94fd7e8d704240148c22abe", "title": "Multi-Stage Geo-Distributed Data Aggregation With Coordinated Computation and Communication in Edge Compute First Networking"}, {"paperId": "eb1a0733c9a9a18440ec1cf15fd5beecbbb1e2cf", "title": "Trading Cost and Throughput in Geo-Distributed Analytics With A Two Time Scale Approach"}, {"paperId": "b519498bfc1aa85510b2bb09cfc53f9330338b10", "title": "SDTP: Accelerating Wide-Area Data Analytics With Simultaneous Data Transfer and Processing"}, {"paperId": "3742cffab506ab6eb6e5e25e4a248ad13a9e74e2", "title": "Accelerating Gossip-Based Deep Learning in Heterogeneous Edge Computing Platforms"}]}
