{"paperId": "ac251e6deb8a964fbb3c514a97119e92f4500b68", "publicationVenue": {"id": "6401bb05-050b-4beb-8824-066cb2938eb4", "name": "Mathematical Problems in Engineering", "type": "journal", "alternate_names": ["Math Probl Eng"], "issn": "1024-123X", "url": "http://www.gbhap-us.com/journals/238/238-top.htm", "alternate_urls": ["https://www.hindawi.com/journals/mpe/"]}, "title": "An Improved Clustering Algorithm Based on Density Peak and Nearest Neighbors", "abstract": "Aiming at the problems that the initial cluster centers are randomly selected and the number of clusters is manually determined in traditional clustering algorithm, which results in unstable clustering results, we propose an improved clustering algorithm based on density peak and nearest neighbors. Firstly, an improved density peak clustering method is proposed to optimize the cutoff distance and local density of data points. It avoids that random selection of initial cluster centers is easy to fall into the local optimal solution. Furthermore, a K-value selection method is presented to choose the optimal number of clusters, which is determined by the sum of the squared errors within the clusters. Finally, we employ the idea of the K-nearest neighbors to carry out the assignment for outliers. Experiments on the UCI real data sets indicate that our proposed algorithm can achieve better clustering results compared with several known algorithms.", "venue": "Mathematical Problems in Engineering", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-08-10", "journal": {"name": "Mathematical Problems in Engineering"}, "authors": [{"authorId": "2109454940", "name": "Chaohua Zhao"}, {"authorId": "2109808306", "name": "Junchuan Yang"}, {"authorId": "2181342627", "name": "Kexin Wen"}], "citations": [{"paperId": "3699f28d2735654a31c44d41565b64ebf7c5b2b6", "title": "Nature inspired-based remora optimisation algorithm for enhancement of density peak clustering"}, {"paperId": "a3eacf8d74a74f081c7dafe4e2155aeab82ffd69", "title": "Enhanced Mean Load Based Clustering Technique On Dented Image Segments In Reconstruction Of Buildings"}]}
