{"paperId": "ac2c688844cd3aadaaa603f4b795592764f8f69a", "publicationVenue": {"id": "7c9d091e-015e-4e5d-a11f-9bc369fcf414", "name": "IEEE Transactions on Parallel and Distributed Systems", "type": "journal", "alternate_names": ["IEEE Trans Parallel Distrib Syst"], "issn": "1045-9219", "url": "http://www.computer.org/tpds", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=71"]}, "title": "Performance Analysis of Machine Learning Centered Workload Prediction Models for Cloud", "abstract": "The precise estimation of resource usage is a complex and challenging issue due to the high variability and dimensionality of heterogeneous service types and dynamic workloads. Over the last few years, the prediction of resource usage and traffic has received ample attention from the research community. Many machine learning-based workload forecasting models have been developed by exploiting their computational power and learning capabilities. This paper presents the first systematic survey cum performance analysis-based comparative study of diversified machine learning-driven cloud workload prediction models. The discussion initiates with the significance of predictive resource management followed by a schematic description, operational design, motivation, and challenges concerning these workload prediction models. Classification and taxonomy of different prediction approaches into five distinct categories are presented focusing on the theoretical concepts and mathematical functioning of the existing state-of-the-art workload prediction methods. The most prominent prediction approaches belonging to a distinct class of machine learning models are thoroughly surveyed and compared. All five classified machine learning-based workload prediction models are implemented on a common platform for systematic investigation and comparison using three distinct benchmark cloud workload traces via experimental analysis. The essential key performance indicators of state-of-the-art approaches are evaluated for comparison and the paper is concluded by discussing the trade-offs and notable remarks.", "venue": "IEEE Transactions on Parallel and Distributed Systems", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-02-05", "journal": {"name": "IEEE Transactions on Parallel and Distributed Systems", "pages": "1313-1330", "volume": "34"}, "authors": [{"authorId": "34761193", "name": "D. Saxena"}, {"authorId": "2069634094", "name": "J. Kumar"}, {"authorId": "2144287302", "name": "Ashutosh Kumar Singh"}, {"authorId": "2059467024", "name": "Stefan Schmid"}], "citations": [{"paperId": "199c8a838d7c926c663bbc628e4d7bb2dfafd3bf", "title": "ARIMA-Based and Multiapplication Workload Prediction With Wavelet Decomposition and Savitzky–Golay Filter in Clouds"}, {"paperId": "7d5bc5222d6a4aa9703de337afaba255fe531282", "title": "Statically Inferring Usage Bounds for Infrastructure as Code"}, {"paperId": "83d9d3fe08320ced9409bacec70512afb6bdd997", "title": "Leveraging Imbalance and Ensemble Learning Methods for Improved Load Prediction in Cloud Computing Systems"}, {"paperId": "61b8db2b09e56c551b9f2f091f02073e19e33602", "title": "Towards Workload Trend Time Series Probabilistic Prediction via Probabilistic Deep Learning"}, {"paperId": "51b97f34079acb1ca9edd151a357f18ee6a27b43", "title": "An AI-Driven VM Threat Prediction Model for Multi-Risks Analysis-Based Cloud Cybersecurity"}, {"paperId": "03709c368a67a567c249df0c96b2e2cedbfee9f5", "title": "Cryptography approach for Secure Outsourced Data Storage in Cloud Environment"}, {"paperId": "bab4a66f945c31addab71e6f2517cbce5e9811d3", "title": "Deep Learning-based Workload Prediction in Cloud Computing to Enhance the Performance"}, {"paperId": "6a759e2b4849e3fc973dc724c39229772ce33d41", "title": "A Review Of Fault-Tolerant Data Aggregation Schemes For Smart Grid Environment"}, {"paperId": "eccb5456ac7ae13435e211649b6e45eb2d553a79", "title": "A Comprehensive Survey on Sustainable Resource Management in Cloud Computing Environments"}]}
