{"paperId": "ac311200bfddc9b86e8908b2d0945e44d673cb8c", "publicationVenue": null, "title": "Evolving the Security Paradigm for Industrial IoT Environments", "abstract": "In recent years, IACS (Industrial Automation and Control Systems) have become more complex, due to the increasing number of interconnected devices. This IoT (internet of things)-centric IACS paradigm, which is at the core of the Industry 4.0 concept, expands the infrastructure boundaries beyond the aggregated-plant, mono-operator vision, being dispersed over a large geographic area. From a cybersecurity-centric perspective, the distributed nature of modern IACS makes it difficult not only to understand the nature of incidents but also to assess their progression and threat profile. Defending against those threats is becoming increasingly difficult, requiring orchestrated and collaborative distributed detection, evaluation, and reaction capabilities beyond the scope of a single entity. This chapter presents the Intrusion and Anomaly Detection System platform architecture that was designed and developed within the scope of the ATENA H2020 project, to address the specific needs of distributed IACS while providing (near) real-time cybersecurity awareness.", "venue": "", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": null, "journal": {"name": "", "pages": "69-90", "volume": ""}, "authors": [{"authorId": "36376468", "name": "Luís Rosa"}, {"authorId": "143630823", "name": "M. Freitas"}, {"authorId": "2065428448", "name": "Joao Henriques"}, {"authorId": "152816750", "name": "P. Quitério"}, {"authorId": "145106082", "name": "F. Caldeira"}, {"authorId": "144998879", "name": "T. Cruz"}, {"authorId": "17270557", "name": "P. Simões"}], "citations": [{"paperId": "20ceb28a0ebedd40146aa79f33bc6d888f28e6ef", "title": "A forensics and compliance auditing framework for critical infrastructure protection"}, {"paperId": "af88c2484670606b5c4e7a0829cd4292d778f555", "title": "A Blockchain-enabled Authentication Scheme for IoT Cybersecurity Infrastructure"}, {"paperId": "e8352326c7be0f73b7095f87d76b851e124cf529", "title": "Intrusion and Anomaly Detection in Industrial Automation and Control Systems"}, {"paperId": "f01780f79eb492e7477fb8a7b657b2bee78c6d1e", "title": "Intrusion and anomaly detection for the next-generation of industrial automation and control systems"}, {"paperId": "d1e2220f1236e220f4bfa08235f6dc216347d602", "title": "Fuzzy-Decision Algorithms for Cyber Security Analysis of Advanced SCADA and Remote Monitoring Systems"}]}
