{"paperId": "ac32a852a3107f0d867c928c20287313505c6196", "publicationVenue": {"id": "078381b1-ff74-45a2-9d2d-90cd374089e2", "name": "Journal of health communication", "type": "journal", "alternate_names": ["J Health Commun", "Journal of Health Communication", "J health commun"], "issn": "1081-0730", "url": "http://www.catchword.com/rpsv/cw/tandf/10810730/contp1.htm", "alternate_urls": ["http://www.tandfonline.com/toc/uhcm20/current", "http://www.metapress.com/link.asp?id=100673"]}, "title": "Community and Opinion Leadership Effects on Vaping Discourse: A Network Analysis of Online Reddit Threads", "abstract": "Reddit is a popular hub for discussing vaping. A deeper understanding of the factors that influence this online discourse could inform public health messaging efforts targeting this platform. Using a network analysis framework, we sought to investigate the role of opinion leaders and online communities in facilitating vaping discussions on Reddit. We collected Reddit submissions about vaping posted in May 2021 and used these submissions to generate subreddit-level (N=261) and thread-level (N=8,377) data sets. We coded subreddits into four community categories: 1) Vaping, 2) Substance use, 3) Cessation, and 4) Non-specific. We used sociometric in-degree centrality statistics to identify subreddit opinion leaders. We computed non-parametric ANOVAs and negative binomial regressions to test associations between opinion leadership and subreddit community category variables on subreddit network composition (comprised of subreddit-level network nodes and edges) and the number of commenters on Reddit threads about vaping (thread-level). Subreddit network composition was largely dependent on opinion leaders in Non-specific communities, and less so in Vaping and Substance use communities. At the thread-level, the rate of commenters was higher among threads initiated by opinion leaders than non-opinion leaders (adjusted rate ratio [aRR]=4.84). Furthermore, threads posted in Vaping (aRR=1.64), Substance use (aRR=1.92), and Cessation (aRR=1.21) communities had higher commenter rates than those posted in Non-specific communities. Communities and opinion leaders play a key role in the composition and reach of vaping discussions on Reddit. These findings provide a foundation for public health campaigns and interventions targeting Reddit and perhaps other social media platforms.", "venue": "Journal of health communication", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-21", "journal": {"name": "Journal of Health Communication", "pages": "487 - 497", "volume": "28"}, "authors": [{"authorId": "2220330543", "name": "Jacob A. Rohde"}, {"authorId": "46700410", "name": "Jessica Liu"}, {"authorId": "3817943", "name": "V. Rees"}], "citations": []}
