{"paperId": "ac6c2121c7c2a902979b09eaa8b232dfe7d580c3", "publicationVenue": {"id": "8e1bd4b5-d5b2-4e22-ba0a-01fe5568d472", "name": "Remote Sensing", "type": "journal", "alternate_names": ["Remote Sens"], "issn": "2315-4675", "alternate_issns": ["2072-4292"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169233", "alternate_urls": ["https://www.mdpi.com/journal/remotesensing", "http://www.mdpi.com/journal/remotesensing", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169233"]}, "title": "A Strategy of Parallel Seed-Based Image Segmentation Algorithms for Handling Massive Image Tiles over the Spark Platform", "abstract": "The volume of remote sensing images continues to grow as image sources become more diversified and with increasing spatial and spectral resolution. The handling of such large-volume datasets, which exceed available CPU memory, in a timely and efficient manner is becoming a challenge for single machines. The distributed cluster provides an effective solution with strong calculation power. There has been an increasing number of big data technologies that have been adopted to deal with large images using mature parallel technology. However, since most commercial big data platforms are not specifically developed for the remote sensing field, two main issues exist in processing large images with big data platforms using a distributed cluster. On the one hand, the quantities and categories of official algorithms used to process remote sensing images in big data platforms are limited compared to large amounts of sequential algorithms. On the other hand, the sequential algorithms employed directly to process large images in parallel over a distributed cluster may lead to incomplete objects in the tile edges and the generation of large communication volumes at the shuffle stage. It is, therefore, necessary to explore the distributed strategy and adapt the sequential algorithms over the distributed cluster. In this research, we employed two seed-based image segmentation algorithms to construct a distributed strategy based on the Spark platform. The proposed strategy focuses on modifying the incomplete objects by processing border areas and reducing the communication volume to a reasonable size by limiting the auxiliary bands and the buffer size to a small range during the shuffle stage. We calculated the F-measure and execution time to evaluate the accuracy and execution efficiency. The statistical data reveal that both segmentation algorithms maintained high accuracy, as achieved in the reference image segmented in the sequential way. Moreover, generally the strategy took less execution time compared to significantly larger auxiliary bands and buffer sizes. The proposed strategy can modify incomplete objects, with execution time being twice as fast as the strategies that do not employ communication volume reduction in the distributed cluster.", "venue": "Remote Sensing", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-05-18", "journal": {"name": "Remote. Sens.", "pages": "1969", "volume": "13"}, "authors": [{"authorId": "31811316", "name": "Fangxiao Chen"}, {"authorId": "2152170475", "name": "Ning Wang"}, {"authorId": "49828592", "name": "Bo Yu"}, {"authorId": "1831555", "name": "Yuchu Qin"}, {"authorId": "2152511790", "name": "Lei Wang"}], "citations": [{"paperId": "bd3eab725035b289d4311240c3e34c9ff4f20d3e", "title": "State of the Art: High-Performance and High-Throughput Computing for Remote Sensing Big Data"}, {"paperId": "872d2bc78badebb1a24a2948230838fc977dbf05", "title": "A Cluster-Based Partition Method of Remote Sensing Data for Efficient Distributed Image Processing"}, {"paperId": "6d1dca23598a96efa3804b7e0a7b6050c263851a", "title": "Research on Recommendation of Big Data for Higher Education Based on Deep Learning"}, {"paperId": "bde6baa4bf3b0ab0f8b5ff6af44440ad2b475781", "title": "A Strategy of Parallel SLIC Superpixels for Handling Large-Scale Images over Apache Spark"}, {"paperId": "b64a8e2d150494b08b68e1ca5114caba171c7107", "title": "An improved coverage-oriented retrieval algorithm for large-area remote sensing data"}, {"paperId": "51d13210c51bdfe50aca0e2346cf03834522f5c4", "title": "A Fast Large-Scale Path Planning Method on Lunar DEM Using Distributed Tile Pyramid Strategy"}]}
