{"paperId": "ac6fe8f2f47d6d007f519ae44833b65fb507e033", "publicationVenue": {"id": "a658f37d-f6a7-4848-ad22-b2488e5ba84e", "name": "Engineering Construction and Architectural Management", "type": "journal", "alternate_names": ["Eng Constr Archit Manag", "Engineering, Construction and Architectural Management"], "issn": "0969-9988", "url": "http://www.blackwell-synergy.com/member/institutions/issuelist.asp?journal=eca", "alternate_urls": ["https://www.emerald.com/insight/publication/issn/0969-9988"]}, "title": "A systematic review of artificial intelligence in managing climate risks of PPP infrastructure projects", "abstract": "PurposeRecent United Nations Climate Change Conferences recognise extreme climate change of heatwaves, floods and droughts as threatening risks to the resilience and success of public–private partnership (PPP) infrastructure projects. Such conferences together with available project reports and empirical studies recommend project managers and practitioners to adopt smart technologies and develop robust measures to tackle climate risk exposure. Comparatively, artificial intelligence (AI) risk management tools are better to mitigate climate risk, but it has been inadequately explored in the PPP sector. Thus, this study aims to explore the tools and roles of AI in climate risk management of PPP infrastructure projects.Design/methodology/approachSystematically, this study compiles and analyses 36 peer-reviewed journal articles sourced from Scopus, Web of Science, Google Scholar and PubMed.FindingsThe results demonstrate deep learning, building information modelling, robotic automations, remote sensors and fuzzy logic as major key AI-based risk models (tools) for PPP infrastructures. The roles of AI in climate risk management of PPPs include risk detection, analysis, controls and prediction.Research limitations/implicationsFor researchers, the findings provide relevant guide for further investigations into AI and climate risks within the PPP research domain.Practical implicationsThis article highlights the AI tools in mitigating climate crisis in PPP infrastructure management.Originality/valueThis article provides strong arguments for the utilisation of AI in understanding and managing numerous challenges related to climate change in PPP infrastructure projects.", "venue": "Engineering Construction and Architectural Management", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-12-25", "journal": {"name": "Engineering, Construction and Architectural Management"}, "authors": [{"authorId": "1422920673", "name": "I. Akomea-Frimpong"}, {"authorId": "2276160556", "name": "Jacinta Rejoice Ama Delali Dzagli"}, {"authorId": "2276166415", "name": "Kenneth Eluerkeh"}, {"authorId": "2276162936", "name": "Franklina Boakyewaa Bonsu"}, {"authorId": "2276171079", "name": "Sabastina Opoku-Brafi"}, {"authorId": "2276163675", "name": "Samuel Gyimah"}, {"authorId": "2276154167", "name": "Nana Ama Sika Asuming"}, {"authorId": "2276163216", "name": "David Wireko Atibila"}, {"authorId": "100955881", "name": "A. S. Kukah"}], "citations": []}
