{"paperId": "ac827fd8217c3f349b3f787359081cc15eece9a1", "publicationVenue": {"id": "757ec547-4fbf-4010-b6ae-c6b833ccd3a4", "name": "Frontiers in Energy Research", "type": "journal", "alternate_names": ["Front Energy Res"], "issn": "2296-598X", "url": "http://www.frontiersin.org/Energy_Research", "alternate_urls": ["https://www.frontiersin.org/journals/energy-research", "http://www.frontiersin.org/Energy_Research/archive"]}, "title": "Wind power interval prediction based on variational mode decomposition and the fast gate recurrent unit", "abstract": "Large-scale wind power integration is difficult due to the uncertainty of wind power, and therefore the use of conventional point prediction of wind power cannot meet the needs of power grid planning. In contrast, interval prediction is playing an increasingly important role as an effective approach because the interval can describe the uncertainty of wind power. In this study, a wind interval prediction model based on Variational Mode Decomposition (VMD) and the Fast Gate Recurrent Unit (F-GRU) optimized with an improved whale optimization algorithm (IWOA) is proposed. Firstly, the wind power series was decomposed using VMD to obtain several Intrinsic Mode Function (IMF) components. Secondly, an interval prediction model was constructed based on the lower upper bound estimation. Finally, according to the fitness function, the F-GRU parameters were optimized by IWOA, and thefinal prediction interval was obtained. Actual examples show that the method can be employed to improve the interval coverage and reduce the interval bandwidth and thus has strong practical significance.", "venue": "Frontiers in Energy Research", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-01-11", "journal": {"volume": "10"}, "authors": [{"authorId": "30832752", "name": "Dewang Zhang"}, {"authorId": "2128666850", "name": "Zhichao Zhang"}, {"authorId": "2111377025", "name": "Zhigeng Chen"}, {"authorId": "2110633167", "name": "Yu Zhou"}, {"authorId": "9129969", "name": "Fuyun Li"}, {"authorId": "115088019", "name": "Chengquan Chi"}], "citations": [{"paperId": "03ff613079d5f67ba4203ed0640fbd8ba7143af6", "title": "Partial Discharge Signal Denoising Algorithm Based on Aquila Optimizer–Variational Mode Decomposition and K-Singular Value Decomposition"}, {"paperId": "68783221696d832060aef1b17138065f71c676a3", "title": "Wind Power Interval Prediction Based on CGAN and KELM under Extreme Weather Scenarios"}]}
