{"paperId": "ac83de7a349e574093f27ef64efa80dedb6dd72a", "publicationVenue": {"id": "cfc6e6bd-b401-4d36-a3b3-a0178a605858", "name": "Current Journal of Applied Science and Technology", "type": "journal", "alternate_names": ["Curr J Appl Sci Technol"], "issn": "2457-1024", "url": "http://www.sciencedomain.org/journal/70", "alternate_urls": ["http://www.journalcjast.com/index.php/CJAST"]}, "title": "Harnessing the Power of Big Data: Revolutionizing Agriculture", "abstract": "Now a day, the latest digital technologies are involved in agriculture field i.e. Big Data. Big Data plays a crucial role in the advancement of smart farming by boosting the productivity of individual farms and removing the risk of a global food crisis by collection and analysis process of Big Data. With the increasing global population and the growing demand for sustainable food production, the agriculture industry leaders and policymakers faces numerous challenges. Fortunately, advancements in technology, particularly in the field of big data analytics, have paved the way for innovative solutions in agriculture, such as smart farming. Smart farming leverages big data to optimize agriculture farming practices i.e. irrigation, fertilization, pest management and crop selection, helps in making real time decisions, improve efficiency, improve operations, boost productivity and increase yields while minimizing resource consumption and environmental impact (such as weather, soil, diseases). Big Data’s help to farmers is by suggesting pesticides the quantity they could use. Hence there arises the need for advanced practical and systematic strategies to correlate the different factors driving the agriculture to derive valuable information out of it. The Big Data has power to develop technologies to achieve the aim of sustainable and smart agriculture with smart farming to enhanced precision farming, predictive analytics, and real time monitoring in agriculture. Smart farming involves the collection and sharing of sensitive information, ranging from crop yields and livestock health to financial data. Safeguarding this data from unauthorized access and maintaining privacy while still allowing for valuable analytics poses a complex ethical and legal dilemma. This digital revolution in agriculture is very promising and will enable the agriculture sector to move to the next level of farm productivity and profitability. This transformation process is not reversible and poised to revolutionize both agriculture and food sector.", "venue": "Current Journal of Applied Science and Technology", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-05", "journal": {"name": "Current Journal of Applied Science and Technology"}, "authors": [{"authorId": "2076031305", "name": "Laxmi Choudhary"}, {"authorId": "9321553", "name": "Shashank Swami"}], "citations": []}
