{"paperId": "ac832992e1e35f3ca90ede44903fe41a18e82f56", "publicationVenue": null, "title": "High-Performance Visualization for Ocean Modeling", "abstract": "Real-time sea experiments often involve large computational costs and software development associated with running numerical ocean simulations. Effective visualization tools that interpret the results of these simulations are therefore a necessity, and must overcome the challenges of plotting large, high-resolution, three-dimensional, time-dependent, and probabilistic ocean fields and associated quantities in real-time. Although disparate visualization tools aimed at ocean forecasting exist, a complete, integrated visualization suite that is efficient, interactive, and has 3D capabilities is still needed. In this work, we present the MSEAS high-performance visualization suite for real-time sea experiments. It processes multidisciplinary oceanographic fields in a computationally efficient manner and creates easy-to-use, portable, and interactive visualizations. The suite includes static visualization tools based on NCAR Graphics and MATLAB; the interactive web-based tool 2DSeaVizKit built using leaflet and D3.js for interactive 2D visualization on the world map; and 3DSeaVizKit, a browser-based, interactive 3D visualization tool built using Plotly and WebGL for exploratory 3D analysis of ocean forecasts. It can provide standard 2D cross-sections for scalar-valued data; quiver plots, pathlines, and streamtubes for vector-valued data; Lagrangian products (such as trajectories, Lagrangian Coherent Structures, etc.); isosurfaces for 3D data; and an interactive graphical user interface for selecting the quantities, times, and sub-domains of interest. We showcase applications of the visualization suite during three recent exercises that took place in the Gulf of Mexico, the Clarion-Clipperton Fracture Zone in the Pacific Ocean, and the Balearic sea.", "venue": "OCEANS 2022, Hampton Roads", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-10-17", "journal": {"name": "OCEANS 2022, Hampton Roads", "pages": "1-10"}, "authors": [{"authorId": "40283653", "name": "W. Ali"}, {"authorId": "2109357633", "name": "Youran Gao"}, {"authorId": "114083919", "name": "C. Foucart"}, {"authorId": "1490776454", "name": "M. Doshi"}, {"authorId": "2534934", "name": "C. Mirabito"}, {"authorId": "1904489", "name": "P. Haley"}, {"authorId": "144233576", "name": "Pierre FJ Lermusiaux"}], "citations": []}
