{"paperId": "ac869bc7156cbd975c7d322dc4e5785b7f59a623", "publicationVenue": null, "title": "NexGuard: Industrial Cyber-Physical System Défense Using Ensemble Feature Selection and Explainable Deep Learning Techniques", "abstract": "In recent years, industrial cyber-physical systems (ICPS) have advanced rapidly, resulting in sophisticated and intelligent networks of industrial devices and systems. These networks, while offering increased efficiency and interconnectivity, have become susceptible to sophisticated cyber threats. Traditional intrusion detection systems (IDS) fall short of effectively identifying and mitigating these challenges due to the multifaceted nature of modern attacks and the complexity of ICPS. This paper introduces an explainable AI-based intrusion detection system (XAI-IDS), specifically designed to enhance security in ICPS. The purpose of this study is to propose an ensemble-based filter feature selection method (EFFS) for selecting the most relevant features and then use Shapley additive explanations (SHAP) to evaluate the impact of the different features on the prediction. Additionally, we utilise an optimised classifier based on GRULSTM to determine intrusions into the ICPS network and classify attacks efficiently. We use Bayesian optimisation as the hyperparameter optimizer to fine-tune the GRU-LSTM model. Furthermore, our approach improves previous systems in attack detection accuracy, false-positive rate, and computational complexity.", "venue": "2023 2nd International Conference on Futuristic Technologies (INCOFT)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-11-24", "journal": {"name": "2023 2nd International Conference on Futuristic Technologies (INCOFT)", "pages": "1-10"}, "authors": [{"authorId": "2285509176", "name": "S. Krishnaveni"}, {"authorId": "70988752", "name": "S. Sivamohan"}, {"authorId": "2268634035", "name": "Thomas M. Chen"}, {"authorId": "3124299", "name": "Mithileysh Sathiyanarayanan"}], "citations": []}
