{"paperId": "ac892f955e7e420b49a4d0aaff68810d3db9f5fb", "publicationVenue": {"id": "fe7d0c6c-e5de-4dd3-8a8d-ffe64e0943c8", "name": "WSEAS Transactions on Information Science and Applications", "alternate_names": ["WSEAS Trans Inf Sci Appl"], "issn": "1790-0832", "url": "http://www.worldses.org/journals/index.html", "alternate_urls": ["http://www.worldses.org/journals/information/"]}, "title": "Statistical Significance and Utility of Data-Driven Functional Dependencies of Wine Quality Data of Numerical Attributes", "abstract": "There has been a lot of research work to find out functional dependencies algorithmically from databases. But, when the databases consist of numerical attributes, some of the found functional dependencies might not be real functional dependencies, because numerical attributes can have a variety of values. On the other hand, regression analysis is an analysis method in which a model of the observed continuous or numerical variables is obtained and the degree of fit is measured. In this paper, we show how we can determine whether the found functional dependencies of numerical attributes have explanatory power by doing multivariate linear regression tests. We can check their explanatory power by way of adjusted R-squared, as well as other statistics like multicollinearity, the Durbin-Watson test for independence, and the F value for suitability of the regression models. For the experiment, we used the wine quality data set of Vinho Verde in the UCI machine learning library, and we found out that only 48.7% and 30.7% of functional dependencies found by the algorithm called FDtool have explanatory power for the red wine and white wine data set respectively. So, we can conclude that we should be careful when we want to apply the functional dependencies found by the algorithm. In addition, as a possible application of the found functional dependencies in the conditional attributes of the data sets, we have generated a series of random forests by dropping redundant attributes that appear on the right-hand side of the explanatory functional dependencies and acquired good results. So, we can also conclude that we may reduce our efforts by not collecting the data of the redundant attribute to check the wine quality because we can use samples with as few attribute values as possible in mass-produced wines like Vinho Verde.", "venue": "WSEAS Transactions on Information Science and Applications", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-10-10", "journal": {"name": "WSEAS TRANSACTIONS ON INFORMATION SCIENCE AND APPLICATIONS"}, "authors": [{"authorId": "1773932", "name": "Hyontai Sug"}], "citations": []}
