{"paperId": "ac8a0786bd97ca11b6a170de39d7d1ad9f97ffcd", "publicationVenue": null, "title": "Break it, Fix it: Attack and Defense for “Add-on” Access Control Solutions in Distributed Data Analytics Platforms", "abstract": "Distributed data analytics platforms (i.e., Apache Spark, Hadoop) enable cost-effective storage and processing by distributing data and computation to multiple nodes. Since these frameworks’ design was primarily motivated by performance and usability, most were assumed to operate in non-malicious settings. Hence, they allow users to execute arbitrary code to analyze the data. To make the situation worse, they do not support ﬁne-grained access control inherently or offer any plugin mechanism to enable it – which makes them risky to be used in multi-tier organizational settings. There have been attempts to build “add-on” solutions to enable ﬁne-grained access control for distributed data analytics platforms. In this paper, we show that by knowing the nature of the solution, an attacker can evade the access control by maliciously using the platform-provided APIs. Speciﬁcally, we crafted several attack vectors to evade such solutions. Next, we systematically analyze the threats and potentially risky APIs and propose a two-layered (i.e., proactive and reactive ) defense to protect against those attacks. Our proactive security layer utilizes state-of-the-art program analysis to detect potentially malicious user code. The reactive security layer consists of binary integrity checking, instrumentation-based runtime checks, and sandboxed execution. Finally, Using this solution, we provide a secure implementation of a new framework-agnostic ﬁne-grained attribute-based access control framework named S ECURE DL for Apache Spark. To the best of our knowledge, this is the ﬁrst work that provides secure ﬁne-grained attribute-based access control distributed data analytics platforms that allow arbitrary code execution. Performance evaluation showed that the overhead due to added security is low", "venue": "", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "3398057", "name": "Fahad Shaon"}, {"authorId": "40242722", "name": "Sazzadur Rahaman"}, {"authorId": "2269048681", "name": "Murat Kantarcioglu"}], "citations": []}
