{"paperId": "ac93b4757559b1c0eab8e5c4a0496428ac29cd7d", "publicationVenue": {"id": "b6c4c4a1-bdf3-4d49-99f5-6f6feded373c", "name": "International Conference on Geoinformatics and Data Analysis", "type": "conference", "alternate_names": ["Int Conf Gas Disch Their Appl", "ICGDA", "International Conference on Gas Discharges and Their Applications", "International Conference Geoinformatics and Data Analysis", "Int Conf Geoinformatics Data Anal"]}, "title": "Clustering Algorithms for Spatial Data Mining", "abstract": "With the advances in mobile and wireless technologies, there has been a rise in applications that track and share the users' geospatial data. People use several social networking sites such as Twitter, Facebook and Flickr, where they share their status updates. With the integration of Global Positioning System (GPS) with mobile phones, it is now possible to share one's locations on these social networks. GPS allows us to record and track a person's movement along with the timestamp. The data set obtained from these GPS logs is vast and is widely used to analyze the users' movement patterns. Specifically, we can find out significant locations based on the number of users present at that location and the time spent by them at such places. Once significant places have been identified, it is also possible to identify the semantic importance of these locations. This paper presents an overview of the clustering techniques used to find important places of interest using large GPS based mobility datasets. Four clustering algorithms, K-Means, DBSCAN, OPTICS and Hierarchical, are implemented, and performance is tested using real-time data of 50 users collected over 2--5 years. Performance summary depicts that K-Means and DBSCAN perform well for spatial data.", "venue": "International Conference on Geoinformatics and Data Analysis", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Review"], "publicationDate": "2020-04-15", "journal": {"name": "Proceedings of the 2020 3rd International Conference on Geoinformatics and Data Analysis"}, "authors": [{"authorId": "51310104", "name": "Chetashri Bhadane"}, {"authorId": "145230422", "name": "K. Shah"}], "citations": [{"paperId": "e38fa25d804d5e54fb904e014d56e060ff03c890", "title": "Public Transport Commuting Analytics: A Longitudinal Study Based on GPS Tracking and Unsupervised Learning"}, {"paperId": "c2f9b129dd592ea2e401e53c27e62094e4dd7c40", "title": "The impact of COVID-19 pandemic on public transport usage and route choice: Evidences from a long-term tracking study in urban area"}, {"paperId": "934e5e9b2acfce400bf1acc9616a3455b5ca1a5e", "title": "Context-aware next location prediction using data mining and metaheuristics"}, {"paperId": "ae65804f060c13fc47eefa5d2eaabef5e9bfec04", "title": "Taxi Passenger Hot Spot Mining Based on a Refined K-Means++ Algorithm"}, {"paperId": "07e660bc6e884dcc3b80b751c6ecb7d386a75574", "title": "Mining geosocial data from Flickr to explore tourism patterns: The case study of Athens"}]}
