{"paperId": "ac959f7537b4ac311f70167961550d093931417e", "publicationVenue": {"id": "fb4d95f0-46a7-4feb-b6fb-bffa7b98f19a", "name": "IET Software", "type": "journal", "alternate_names": ["IET Softw"], "issn": "1751-8806", "url": "http://www.ietdl.org/IET-SEN"}, "title": "Effective convolution method for privacy preserving in cloud over big data using map reduce framework", "abstract": "Cloud computing is used to connect several number of remote servers through Internet to accumulate and recover large data anywhere and anytime. As of the conventional privacy defending process, there is a possibility for malevolent assault on the sensitive information accumulated in the cloud. In this research, the authors have proposed a competent large data convert among privacy defending by Hadoop map reduce in the cloud. The procedure exploits fuzzy C-means clustering (FCM) algorithm grouping the data. For dimensionality reduction, map reduce framework will be used. In evaluation module, the recommended technique performed with the aid of K-nearest neighbour (KNN) classification algorithm in this phase using KNN technique to check the convolution process based on the threshold value, which is improving the utility of the privacy data. The consequence acquired illustrates that authors' proposed scheme has enhanced the clustering exactness and also accomplishes the effectual convolution procedure to improve the privacy. From the experimental results, the proposed research achieved an effective clustering accuracy 76.07% and the existing K-means approach gets the clustering accuracy of 73.5% which is minimum value when compared to the proposed researches. The suggested technique is implemented in JAVA with Cloud Sim platform.", "venue": "IET Software", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-06-17", "journal": {"name": "IET Softw.", "pages": "187-194", "volume": "13"}, "authors": [{"authorId": "152680040", "name": "K. Sudhakar"}, {"authorId": "2168068", "name": "M. Farquad"}, {"authorId": "73175530", "name": "G. Narshimha"}], "citations": [{"paperId": "e4fefcc8a5042265609a7821329f5fcfb9bb8de1", "title": "Design of Updating Encryption Algorithm for Privacy Big Data Based on Consortium Blockchain Technology"}, {"paperId": "b2d0da9186c9ce862f9a527dc0dfd4acf5300f52", "title": "Challenges and Issues in Cloud Security for WBAN applications - A Systematic Survey"}, {"paperId": "2daa29c3752860a45282003f636a97f9972ff94a", "title": "Attribute based honey encryption algorithm for securing big data: Hadoop distributed file system perspective"}]}
