{"paperId": "ac9fc0c70280f17d5d5cca1873fd61e4a5bd1dd2", "publicationVenue": {"id": "8ecc7f6b-513e-420d-9531-255b48a99a8a", "name": "Micromachines", "type": "journal", "issn": "2072-666X", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-165882", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-165882", "https://www.mdpi.com/journal/micromachines"]}, "title": "Improvement of the Airflow Energy Harvester Based on the New Diamagnetic Levitation Structure", "abstract": "This paper presents an improved solution for the airflow energy harvester based on the push–pull diamagnetic levitation structure. A four-notch rotor is adopted to eliminate the offset of the floating rotor and substantially increase the energy conversion rate. The new rotor is a centrally symmetrical-shaped magnet, which ensures that it is not subjected to cyclically varying unbalanced radial forces, thus avoiding the rotor’s offset. Considering the output voltage and power of several types of rotors, the four-notch rotor was found to be optimal. Furthermore, with the four-notch rotor, the overall average increase in axial magnetic spring stiffness is 9.666% and the average increase in maximum monostable levitation space is 1.67%, but the horizontal recovery force is reduced by 3.97%. The experimental results show that at an airflow rate of 3000 sccm, the peak voltage and rotation speed of the four-notch rotor are 2.709 V and 21,367 rpm, respectively, which are 40.80% and 5.99% higher compared to the three-notch rotor. The experimental results were consistent with the analytical simulation. Based on the improvement, the energy conversion factor of the airflow energy harvester increased to 0.127 mV/rpm, the output power increased to 138.47 mW and the energy conversion rate increased to 58.14%, while the trend of the levitation characteristics also matched the simulation results. In summary, the solution proposed in this paper significantly improves the performance of the airflow energy harvester.", "venue": "Micromachines", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-07-01", "journal": {"name": "Micromachines", "volume": "14"}, "authors": [{"authorId": "2218001731", "name": "Long Zhang"}, {"authorId": "2214949139", "name": "Hang Shao"}, {"authorId": "2144129724", "name": "Jiaxiang Zhang"}, {"authorId": "6501190", "name": "Deping Liu"}, {"authorId": "2280653", "name": "K. Aw"}, {"authorId": "3077686", "name": "Yufeng Su"}], "citations": [{"paperId": "3caf5e379b993ab5cd582fbadfd244e2dc07983e", "title": "Energy Harvesters and Self-Powered Sensors for Smart Electronics, 2nd Edition"}]}
