{"paperId": "aca34fa3f9d2b780bac526e62fd227026647e1ce", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Energy Analysis-Based Cyber Attack Detection by IoT with Artificial Intelligence in a Sustainable Smart City", "abstract": "Cybersecurity continues to be a major issue for all industries engaged in digital activity given the cyclical surge in security incidents. Since more Internet of Things (IoT) devices are being used in homes, offices, transportation, healthcare, and other venues, malicious attacks are happening more frequently. Since distance between IoT as well as fog devices is closer than distance between IoT devices as well as the cloud, attacks can be quickly detected by integrating fog computing into IoT. Due to the vast amount of data produced by IoT devices, ML is commonly employed for attack detection. This research proposes novel technique in cybersecurity-based network traffic analysis and malicious attack detection using IoT artificial intelligence techniques for a sustainable smart city. A traffic analysis has been carried out using a kernel quadratic vector discriminant machine which enhances the data transmission by reducing network traffic. This enhances energy efficiency with reduced traffic. Then, the malicious attack detection is carried out using adversarial Bayesian belief networks. The experimental analysis has been carried out in terms of throughput, data traffic analysis, end-end delay, packet delivery ratio, energy efficiency, and QoS. The proposed technique attained a throughput of 98%, data traffic analysis of 74%, end-end delay of 45%, packet delivery ratio of 92%, energy efficiency of 92%, and QoS of 79%.", "venue": "Sustainability", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-03-30", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "16718951", "name": "D. Prabakar"}, {"authorId": "2146146459", "name": "M. Sundarrajan"}, {"authorId": "145911873", "name": "R. Manikandan"}, {"authorId": "3218095", "name": "Noor Zaman Jhanjhi"}, {"authorId": "144314447", "name": "Mehedi Masud"}, {"authorId": "2268328371", "name": "Abdulmajeed Alqhatani"}], "citations": [{"paperId": "2c23696bdea7483bcf2714fc08206fae4d1a723b", "title": "Integrating Smart Technologies and Mobile Applications to Enhance Shopping Mall Parking Experience"}, {"paperId": "c23d527b882c94ccf7f9ee52735d39c9b3a6e054", "title": "Research Trends in the Use of the Internet of Things in Sustainability Practices: A Systematic Review"}, {"paperId": "6c581dfcf0c7c710db1b635b017188128482f180", "title": "A Deep Learning Approach for Securing IoT Infrastructure with Emphasis on Smart Vertical Networks"}]}
