{"paperId": "aca4cb8d935af2840ff4f579d19c64da43027401", "publicationVenue": null, "title": "DCTCADM: Data-Centric Cognitive Agent Decision Making Based an Effective Handoff for Heterogeneous Wireless Communication", "abstract": "An effective handover decision-making methodology mainly concentrates on minimal handover drop and quick handoff process between two various networks. DCCAD algorithm combination of the Cognitive Congestion Control Artificial Immune System (CoCAI), signal and velocity threshold algorithm (SVT), and Optimized Smart Communication Card (SCom Card) technique. DCCAD and the CoCAI approach aim to enhance the efficiency of network selection and maintain high call connectivity rates to facilitate seamless communication, even for mobile users navigating challenging mobility management systems within diverse wireless networks. The CoCAI method is responsible for overseeing and managing the selection of optimal networks while keeping connected mobile nodes connected. Additionally, this method monitors unnecessary handovers, considering user acceptance and the Received Signal Strength (RSS) level. Both DCCAD and CoCAI analyze the velocity and direction of mobile nodes by leveraging sequential Received Signal Strength Signal (SRSS) measurements. Moreover, CoCAI acquires details about the nearest networks using a nearest neighboring concept with the SVT ratio algorithm. An optimization technique, referred to as AHO, dynamically adjusts the threshold levels for node speed, load, and quality expectations based on received signal strength and user preferences. SCom Card provides a unique ID while starting communication. Though the ID master station has all the information about the sender all networks will perform the handover with a unique SCom Card ID only no other factors are required for the handover process. Due to this Card will reduce the handover time maximum. DCCAD method provides good results with all types of handovers. Especially for vertical hard handover and vertical soft handover.", "venue": "2023 6th International Conference on Recent Trends in Advance Computing (ICRTAC)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-12-14", "journal": {"name": "2023 6th International Conference on Recent Trends in Advance Computing (ICRTAC)", "pages": "441-446"}, "authors": [{"authorId": "2294761967", "name": "S. Muthulingam"}, {"authorId": "2294759799", "name": "V. Pandiyaraju"}, {"authorId": "2294760551", "name": "K. Malar"}, {"authorId": "71339968", "name": "U. S. Ebenezar"}, {"authorId": "1413119747", "name": "N. Manjunathan"}, {"authorId": "2084157365", "name": "Goutham Elumalai"}], "citations": []}
