{"paperId": "acaad3a614c7f788c8340a3fd096e5b3b5cdfd76", "publicationVenue": {"id": "3da56ce6-4a70-402c-a8b0-7dd39a3273d3", "name": "Software, Practice & Experience", "type": "journal", "alternate_names": ["Softw  Pract Exp", "Softw Pract  Exp", "Software - Practice and Experience"], "issn": "0038-0644", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/1752", "alternate_urls": ["http://www.interscience.wiley.com/jpages/0038-0644/", "https://onlinelibrary.wiley.com/journal/1097024X"]}, "title": "DACA: Distributed adaptive grid decision graph based clustering algorithm", "abstract": "Clustering algorithms play a very important role in machine learning. With the development of big‐data artificial intelligence, distributed parallel algorithms have become an important research field. To reduce the computational complexity and running time of large‐scale datasets in the clustering process, this study proposes a distributed clustering algorithm DACA (distributed adaptive grid decision graph based clustering algorithm). In a distributed environment, DACA uses relative entropy to adaptively mesh the data to form an obvious sparse grid and dense grid. Then, the decision graph is used to determine the cluster center mesh object. Finally, the KD‐tree is used to accelerate the determination of the cluster center of sparse points to complete clustering. The algorithm is implemented using the popular Apache Spark computing framework, compared with other distributed clustering algorithms, DACA can adaptively divide the grid according to the data distribution to obtain better clustering effect. At the same time, KD tree algorithm is used to speed up the decision‐making of clustering center. Numerous experiments show that the DACA algorithm has excellent performance and accuracy on six standard datasets and real GPS trajectory datasets.", "venue": "Software, Practice & Experience", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-12-29", "journal": {"name": "Software: Practice and Experience", "pages": "1199 - 1215", "volume": "52"}, "authors": [{"authorId": "2158100312", "name": "Jing He"}, {"authorId": "2151553622", "name": "Jun Zhou"}, {"authorId": "2109571768", "name": "Haoyu Wang"}, {"authorId": "1805943082", "name": "Lini Cai"}], "citations": [{"paperId": "181292cff4bc3e38b5c267220d39a1a92b6d9677", "title": "SRG: a clustering algorithm based on scale division and region growing"}]}
