{"paperId": "acb7501782f9578919c117e47090ae4cec1dd545", "publicationVenue": {"id": "657a4bec-9a11-40fb-acfe-243d7fb993ae", "name": "Frontiers in Earth Science", "type": "journal", "alternate_names": ["Frontiers of Earth Science", "Frontiers in Earth Sciences", "Front Earth Sci"], "issn": "2296-6463", "alternate_issns": ["1863-4621", "2095-0195"], "url": "http://www.frontiersin.org/Earth_Science", "alternate_urls": ["http://journal.hep.com.cn/fesci/EN/2095-0195/current.shtml", "http://www.frontiersin.org/Journal/Archive.aspx?artId=0&f=19&name=Earth_Science", "https://www.frontiersin.org/journals/earth-science", "https://www.springer.com/series/7066"]}, "title": "Study on the corrosion resistance of composite modified anti-corrosion mortar under the action of bio-organic water", "abstract": "The concrete structure will be seriously eroded in a sewage environment, causing substantial economic losses. Therefore, it is of great significance to repair the existing corrosion structure. In order to quickly restore the mechanical properties and enhance the durability performance of eroded concrete structures, this paper develops a new composite high-durability mortar by adding polypropylene fibers, basalt fibers and impermeable agents, which can achieve the dual requirements of structural repair and protection. For the new material, this test set up a total of five groups of mixing ratios. This test analyzed the water absorption, mass loss rate, compressive strength and other performance indicators of the test block in the corrosive environment, and scanned and studied the microstructure of each mortar test block after corrosion. It was found that the new anti-corrosion mortar has relatively less crystallization, dense internal structure, and significantly lighter erosion. From the mechanical properties, the strength of ordinary polymer mortar after erosion decreased by 6%; high-durability mortar instead improved the strength by nearly 20%, showing better resistance to erosion. Taken together, the use of mineral dopants and water repellents can effectively enhance the strength and corrosion resistance of mortar, and the cost is low, with good prospects for engineering applications.", "venue": "Frontiers in Earth Science", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-02-17", "journal": {"volume": "11"}, "authors": [{"authorId": "46297141", "name": "Jun Wei"}, {"authorId": "2108043047", "name": "Zhenshan Wang"}, {"authorId": "2192330774", "name": "Jibin Xu"}, {"authorId": "2146502084", "name": "Hai-Shen Jia"}], "citations": []}
