{"paperId": "acb9cb50436c71180ca4d9857300f1f505438a63", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "QUEST: An Efficient Query Evaluation Scheme Towards Scan-Intensive Cross-Model Analysis", "abstract": "Modern data-driven applications require that databases support fast cross-model analytical queries. Achieving fast analytical queries in a database system is challenging since they are usually scan-intensive (i.e., they need to intensively scan over a large number of records) which results in huge I/O and memory costs. And it becomes tougher when the analytical queries are cross-model. It is hard to accelerate cross-model analytical queries in existing databases due to the lack of appropriate storage layout and efficient query processing techniques. In this paper, we present QUEST (QUery Evaluation Scheme Towards scan-intensive cross-model analysis) to push scan-intensive queries down to unified columnar storage layout and seamlessly deliver payloads across different data models. QUEST employs a columnar data layout to unify the representation of multi-model data. Then, a novel index structure named Skip-Tree is developed for QUEST to enable the query evaluation more efficient. With the help of two pairwise bitset-based operations coupled with Skip-Tree, the scan of most irrelevant instances can be pruned so as to avoid the giant intermediate result, thus reducing query response latency and saving the computational resources significantly when evaluating scan-intensive cross-model analysis. The proposed methods are implemented on an open-source platform. Through comprehensive theoretical analysis and extensive experiments, we demonstrate that QUEST improves the performance by 3.7x - 178.2x compared to state-of-the-art multi-model databases when evaluating scan-intensive cross-model analytical queries.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-21", "journal": {"name": "ArXiv", "volume": "abs/2309.11860"}, "authors": [{"authorId": "2244010129", "name": "Jianfeng Huang"}, {"authorId": "2243333806", "name": "Dongjing Miao"}, {"authorId": "2243447726", "name": "Xin Liu"}], "citations": []}
