{"paperId": "acc6e7bdac0cd6ac9a9f9356c97f9bd9759532d3", "publicationVenue": {"id": "472adb76-f5bd-4ad0-a989-08c3a9ccf86e", "name": "Journal of Environmental and Public Health", "type": "journal", "alternate_names": ["J Environ Public Health"], "issn": "1687-9805", "url": "https://www.hindawi.com/journals/jeph/"}, "title": "Monitoring and Sharing of Music Teaching Environment Resources Using Big Data Technology", "abstract": "The teaching materials for different music courses in schools are getting more and more plentiful as education continues to become more and more digitised. This paper develops a resource monitoring and recommendation algorithm for the music teaching environment based on big data analysis technology, achieves the unified management and parallel retrieval of large music teaching resources, and completes the construction and sharing of music teaching resources with the goal of promoting online music teaching courses and increasing the efficiency of instruction. According to the experimental findings, the algorithm's recall and precision may both approach 95.84% and 95.19%, respectively. This demonstrates the benefits of this strategy. With the ability to analyse and retrieve large teaching resources and data quickly and accurately, this model can offer an advantageous solution for the storage and sharing of existing and future massive teaching resources. In order to effectively integrate music curriculum materials into our lessons, music teachers need to have a thorough awareness of not just the knowledge found in textbooks but also the adaptable use of music resources both within and outside of the classroom.", "venue": "Journal of Environmental and Public Health", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-10-08", "journal": {"name": "Journal of Environmental and Public Health", "volume": "2022"}, "authors": [{"authorId": "2187274031", "name": "Caifen Yang"}], "citations": [{"paperId": "6b3eee6b984d82f6f20a9cc6a2b820606791dc68", "title": "Analysis for Online Music Education Under Internet and Big Data Environment"}, {"paperId": "e22b7d74d2045ac10030483be963bbe4e483a6d5", "title": "Retracted: Monitoring and Sharing of Music Teaching Environment Resources Using Big Data Technology"}]}
