{"paperId": "acc88a35bb0ab01fee70afe2cd978ad03b13dd62", "publicationVenue": null, "title": "Parallel blocking for entity resolution in the context of semi-structured data.", "abstract": "A tarefa de Resolucao de Entidades (RE) surge como um passo fundamental para integrar multiplas bases de conhecimento ou identificar semelhancas entre os dados (entidades). Para evitar o custo quadratico da tarefa de Resolucao de Entidades, tecnicas de blocagem (ou indexacao) sao amplamente aplicadas como uma etapa de pre processamento. Neste contexto, dados semi estruturados e grandes fontes de dados (Big Data) emergem como os principais desafios enfrentados pelas tecnicas de blocagem. No que diz respeito aos dados semiestruturados, o desafio esta relacionado ao fato de que tais dados nao compartilham um mesmo esquema, inviabilizando a aplicacao de tecnicas tradicionais de blocagem. Neste contexto, tecnicas agnosticas de blocagem sao aplicadas. Em relacao as grandes fontes de dados (Big Data), tecnicas de blocagem e computacao distribuida devem ser aplicadas com o intuito de melhorar a eficiencia da tarefa de RE. Nesse sentido, este trabalho propoe um modelo de execucao distribuida para blocagem de dados semiestruturados no contexto grandes fontes de dados, capaz de atende as diferentes necessidades dos perfis de aplicacao enfrentados pela tarefa de RE. Esses perfis de aplicacao estao relacionados as necessidades e caracteristicas inerentes a cada aplicacao, tais como a forma como os dados sao recebidos (i.e.,em lotes ou streaming), qualidade dos dados e priorizacao da eficacia/eficiencia da blocagem.Alem disso, o presente trabalho tambem propoe novas tecnicas de blocagem que podem ser acopladas ao modelo proposto.Tais tecnicas de blocagem enderecam desafios em aberto segundo a literatura, como tecnicas agnosticas de blocagemem paralelo, processamento incremental e blocagem de dados em streaming. As tecnicas de blocagem foram avaliadas experimentalmente com o objetivo de mensurar a eficiencia e eficacia em relacao as tecnicas de blocagem do estado da arte, utilizando fontes de dados reais. Com base nos resultados experimentais, e possivel destacar que as novas tecnicas de blocagem apresentaram resultados mais promissores, podendo ser acopladas ao modelo de execucao distribuida proposto,de maneira a atender as diferentes necessidades inerentes aos perfis de aplicacao.", "venue": "", "year": 2020, "fieldsOfStudy": ["Physics"], "publicationTypes": null, "publicationDate": "2020-02-19", "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "2248408206", "name": "Tiago Brasileiro AraúJo"}, {"authorId": "2170212395", "name": "Carlos Eduardo Santos Pires"}, {"authorId": "2248408206", "name": "Tiago Brasileiro AraúJo"}, {"authorId": "2248455557", "name": "Tese Aprovada"}, {"authorId": "2248020509", "name": "Em"}, {"authorId": "2256722270", "name": "Carlos Eduardo Santos"}], "citations": []}
