{"paperId": "acca54af6ae6392e6b1a55729d880df5988e1076", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Federated Compressed Learning Edge Computing Framework with Ensuring Data Privacy for PM2.5 Prediction in Smart City Sensing Applications", "abstract": "The sparse data in PM2.5 air quality monitoring systems is frequently happened on large-scale smart city sensing applications, which is collected via massive sensors. Moreover, it could be affected by inefficient node deployment, insufficient communication, and fragmented records, which is the main challenge of the high-resolution prediction system. In addition, data privacy in the existing centralized air quality prediction system cannot be ensured because the data which are mined from end sensory nodes constantly exposed to the network. Therefore, this paper proposes a novel edge computing framework, named Federated Compressed Learning (FCL), which provides efficient data generation while ensuring data privacy for PM2.5 predictions in the application of smart city sensing. The proposed scheme inherits the basic ideas of the compression technique, regional joint learning, and considers a secure data exchange. Thus, it could reduce the data quantity while preserving data privacy. This study would like to develop a green energy-based wireless sensing network system by using FCL edge computing framework. It is also one of key technologies of software and hardware co-design for reconfigurable and customized sensing devices application. Consequently, the prototypes are developed in order to validate the performances of the proposed framework. The results show that the data consumption is reduced by more than 95% with an error rate below 5%. Finally, the prediction results based on the FCL will generate slightly lower accuracy compared with centralized training. However, the data could be heavily compacted and securely transmitted in WSNs.", "venue": "Italian National Conference on Sensors", "year": 2021, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-07-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "21"}, "authors": [{"authorId": "9282843", "name": "Karisma Trinanda Putra"}, {"authorId": "2145278540", "name": "Hsing-Chung Chen"}, {"authorId": "92392968", "name": "Prayitno"}, {"authorId": "1790345", "name": "M. Ogiela"}, {"authorId": "3202243", "name": "Chao-Lung Chou"}, {"authorId": "2075347977", "name": "Chien-Erh Weng"}, {"authorId": "1903303", "name": "Zon-Yin Shae"}], "citations": [{"paperId": "105d05bf31bc5accbbde21998e5ad2521d658e68", "title": "Integrated Portable and Stationary Health Impact-Monitoring System for Firefighters"}, {"paperId": "927cae5ff0092a3c7aeca043d48fff077ccd164b", "title": "Semar IoT Server Framework: Architecture and Technologies"}, {"paperId": "fc2470f8c18f80ba5bf3d07460af3b03ecbdd197", "title": "Methods of Measuring Air Pollution in Cities and Correlation of Air Pollutant Concentrations"}, {"paperId": "716b3e32f3e887c0e6d7164d87f28e2bf072aff0", "title": "Towards Federated Learning and Multi-Access Edge Computing for Air Quality Monitoring: Literature Review and Assessment"}, {"paperId": "89262adde35021f5ae6ed67f48b4ca085ccb93aa", "title": "A novel framework for optimizing the edge network node for wearable devices"}, {"paperId": "30d64411a257878704529a7b7bd2be37c564465d", "title": "AI-Based Computer Vision Techniques and Expert Systems"}, {"paperId": "00044a527a0642b08f385cda845331f0fc8cbbfd", "title": "At the Confluence of Artificial Intelligence and Edge Computing in IoT-Based Applications: A Review and New Perspectives"}, {"paperId": "b75bf3633a8fe46a0974cc23b859d85ae5528176", "title": "Communication-Efficient Federated Learning Based on Chained Secure Multiparty Computing and Compressed Sensing"}, {"paperId": "69651f2a25c7b68db3ae3767cd639c804a1e1963", "title": "Insights into Multi-Model Federated Learning: An Advanced Approach for Air Quality Index Forecasting"}, {"paperId": "2ff3039fad2edc812467f6dbcd07f0d6e5edd124", "title": "A survey on federated learning: challenges and applications"}, {"paperId": "e2b2a7840919c9fd536e9b9e59793939be2ae79e", "title": "Electrical Load Forecasting on A 500/150 kV Substation Based on Historical Daily Records Using Multivariate LSTM Network"}, {"paperId": "e1b87cba9084290afd4c7abc26e54ad8025d208a", "title": "Federated Learning for Air Quality Index Prediction: An Overview"}, {"paperId": "c591c36f4d415dbe776746f843c8069cff773054", "title": "Information Extraction and Data Planning of Smart City Based on Internet of Things"}, {"paperId": "076743a18d82286c92bcfa8798902a60657b0a82", "title": "Design and Implementation of SEMAR IoT Server Platform with Applications"}, {"paperId": "3fb31c7a8b35cf47c680ebbf7bd5439df1c00bd4", "title": "An Implementation of Trust Chain Framework with Hierarchical Content Identifier Mechanism by Using Blockchain Technology"}, {"paperId": "cf9a9bf2467ddf7c0f3a212fbe544f8573d32580", "title": "A Differential Privacy Strategy Based on Local Features of Non-Gaussian Noise in Federated Learning"}, {"paperId": "76ac203cdb0bae7617e13fe297ccf9c026aa4a96", "title": "Pulse-line intersection method with unboxed artificial intelligence for hesitant pulse wave classification"}, {"paperId": "b1666a1378f45550f9a979f7248ef8c236b6fbc2", "title": "Week-Wise Student Performance Early Prediction in Virtual Learning Environment Using a Deep Explainable Artificial Intelligence"}, {"paperId": "79a24dbac169a5040df84f0d5ce9945d9cb3a7e7", "title": "A Survey of Compressive Data Gathering in WSNs for IoTs"}, {"paperId": "fa0da04732601042c703deb288f7f3461049bce5", "title": "A Systematic Review of Federated Learning in the Healthcare Area: From the Perspective of Data Properties and Applications"}, {"paperId": "d49a9c457e9522ec3f440a167081dd0ba1faa195", "title": "Classification of images containing sensitive and non-sensitive information using the convolutional neural network"}]}
