{"paperId": "accf5437881ff0873da299be8098f73853a92885", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "ZAKI+: A Machine Learning Based Process Mapping Tool for SpMV Computations on Distributed Memory Architectures", "abstract": "Smart cities and other cyber-physical systems (CPSs) rely on various scientific, engineering, business, and social applications that provide timely intelligence for their design, operations, and management. Many of these scientific and analytics applications require the solution of sparse linear equation systems, where sparse matrix-vector (SpMV) product is a key computing operation. Several factors determine the performance of parallel SpMV computations, including matrix characteristics, storage formats, and the rising complexity and heterogeneity of computer systems. There is a pressing need for new ways of exploiting parallelism, and mapping data and applications to the computing resources. We propose here ZAKI+, a data-driven machine-learning approach, allowing users to automatically, effortlessly, and speedily obtain the best configuration (the data distribution, the optimal number of processes, and mapping strategy) and performance for the execution of the parallel SpMV computations on distributed memory machines. We train and test the tool using three machine learning methods—decision trees, random forest, and Xtreme boosting—and nearly 2000 real-world matrices obtained from 45 application domains, including computer vision and robotics. ZAKI+ provides optimal process mapping and outperforms the MPI default mapping policy by a factor of 4.24. This is the first work where the sparsity structure of matrices has been exploited to predict the optimal mapping of processes and data in distributed-memory environments by using different base and ensemble machine learning methods. Various CPSs comprise compute-intensive machine learning applications, such as the SpMV, and hence, the process and data mapping contributions of this paper would be of paramount impact for the CPSs.", "venue": "IEEE Access", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "81279-81296", "volume": "7"}, "authors": [{"authorId": "150309972", "name": "Sardar Usman"}, {"authorId": "39799687", "name": "Rashid Mehmood"}, {"authorId": "2574028", "name": "Iyad A. Katib"}, {"authorId": "2784328", "name": "A. Albeshri"}], "citations": [{"paperId": "5f1a9162ea7f89f02e29f8dee55f9e1cfcd3f4da", "title": "Distributed artificial intelligence: Taxonomy, review, framework, and reference architecture"}, {"paperId": "37334cc8664467c8ac1933d8270ec6220a4c3e40", "title": "Data Locality in High Performance Computing, Big Data, and Converged Systems: An Analysis of the Cutting Edge and a Future System Architecture"}, {"paperId": "a04b6b6a98e318132b9c289303b290b2a9bd3416", "title": "Performance Enhancement Strategies for Sparse Matrix-Vector Multiplication (SpMV) and Iterative Linear Solvers"}, {"paperId": "d287614ac14a57401678fb7b88cddb6f5ae20fdd", "title": "Iktishaf+: A Big Data Tool with Automatic Labeling for Road Traffic Social Sensing and Event Detection Using Distributed Machine Learning"}, {"paperId": "305f8124ff6f443057e513239ead4b5d55c22e9a", "title": "COVID-19: Detecting Government Pandemic Measures and Public Concerns from Twitter Arabic Data Using Distributed Machine Learning"}, {"paperId": "fe0865836f8033695ce35de91edcbc65f1a33600", "title": "DIESEL: A novel deep learning-based tool for SpMV computations and solving sparse linear equation systems"}, {"paperId": "53217556ff3864d830d1131df84a946dfb7d81d5", "title": "Performance Analysis of Sparse Matrix-Vector Multiplication (SpMV) on Graphics Processing Units (GPUs)"}, {"paperId": "d2338b95a050ac393958415a5080dc96f2daa1c5", "title": "UbiPriSEQ—Deep Reinforcement Learning to Manage Privacy, Security, Energy, and QoS in 5G IoT HetNets"}, {"paperId": "d4157b40c134a907ee7286bafbbae3400c9a2320", "title": "Distributed Artificial Intelligence-as-a-Service (DAIaaS) for Smarter IoE and 6G Environments"}, {"paperId": "ef7130b8bca7d998ff1438d10f033917ee0c9ee2", "title": "Iktishaf: a Big Data Road-Traffic Event Detection Tool Using Twitter and Spark Machine Learning"}, {"paperId": "f986edb93a6af37296efdafbe715657d49e04f2a", "title": "Can Building “Artificially Intelligent Cities” Safeguard Humanity from Natural Disasters, Pandemics, and Other Catastrophes? An Urban Scholar’s Perspective"}, {"paperId": "84f96cce054369e53bde15524414d148b56902e8", "title": "Sehaa: A Big Data Analytics Tool for Healthcare Symptoms and Diseases Detection Using Twitter, Apache Spark, and Machine Learning"}, {"paperId": "67167bdb7b700fa92cba1add4bcc50c4aec90b44", "title": "Dynamic machine learning-based heuristic energy optimization approach on multicore architecture"}, {"paperId": "10b3f119cd8d7488f0795fa420a2d4b4370cb247", "title": "Performance Optimization of SpMV on Spark"}, {"paperId": "eece4d67b36030d3cdddbb954baa0840d0d15a14", "title": "reinforcement learning to manage privacy, security, energy, and QoS in"}]}
