{"paperId": "acd038a3dad7ea759d2cd26f47dbd34706cf5b15", "publicationVenue": {"id": "a00a1a4f-16c6-4360-a8b3-a3f88d2fe78f", "name": "ACM-SIGPLAN Symposium on Programming Language Design and Implementation", "type": "conference", "alternate_names": ["ACM-SIGPLAN Symp Program Lang Des Implement", "Program Lang Des Implement", "Programming Language Design and Implementation", "PLDI"], "url": "http://portal.acm.org/proceedings/pldi/"}, "title": "Data-trace types for distributed stream processing systems", "abstract": "Distributed architectures for efficient processing of streaming data are increasingly critical to modern information processing systems. The goal of this paper is to develop type-based programming abstractions that facilitate correct and efficient deployment of a logical specification of the desired computation on such architectures. In the proposed model, each communication link has an associated type specifying tagged data items along with a dependency relation over tags that captures the logical partial ordering constraints over data items. The semantics of a (distributed) stream processing system is then a function from input data traces to output data traces, where a data trace is an equivalence class of sequences of data items induced by the dependency relation. This data-trace transduction model generalizes both acyclic synchronous data-flow and relational query processors, and can specify computations over data streams with a rich variety of partial ordering and synchronization characteristics. We then describe a set of programming templates for data-trace transductions: abstractions corresponding to common stream processing tasks. Our system automatically maps these high-level programs to a given topology on the distributed implementation platform Apache Storm while preserving the semantics. Our experimental evaluation shows that (1) while automatic parallelization deployed by existing systems may not preserve semantics, particularly when the computation is sensitive to the ordering of data items, our programming abstractions allow a natural specification of the query that contains a mix of ordering constraints while guaranteeing correct deployment, and (2) the throughput of the automatically compiled distributed code is comparable to that of hand-crafted distributed implementations.", "venue": "ACM-SIGPLAN Symposium on Programming Language Design and Implementation", "year": 2019, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2019-06-08", "journal": {"name": "Proceedings of the 40th ACM SIGPLAN Conference on Programming Language Design and Implementation"}, "authors": [{"authorId": "2121860", "name": "Konstantinos Mamouras"}, {"authorId": "20860470", "name": "C. Stanford"}, {"authorId": "1710176", "name": "R. Alur"}, {"authorId": "1804315", "name": "Z. Ives"}, {"authorId": "144879888", "name": "V. Tannen"}], "citations": [{"paperId": "ca4dac5abfe80563b1e1ae17b5c8c3eb157d1b69", "title": "Stream Types"}, {"paperId": "c9355c18f39b42c6aa786244dd84e9cd92c5d1b2", "title": "A Robust Theory of Series Parallel Graphs"}, {"paperId": "af0ca5070920bd4134206d7ca32b35017e0d7b8c", "title": "Cloudprofiler: TSC-based inter-node profiling and high-throughput data ingestion for cloud streaming workloads"}, {"paperId": "a73256c9c192344902d27248d29c0efec243518c", "title": "SPOT: Testing Stream Processing Programs with Symbolic Execution and Stream Synthesizing"}, {"paperId": "e53df886cdafebf17c5e31792e7c51c54636543d", "title": "Synchronization Schemas"}, {"paperId": "be0675c2d63559d4a4babfcf64b7dbdab1c798be", "title": "Stream processing with dependency-guided synchronization"}, {"paperId": "63ecae5dee4b02fac2bcf0c5ad1e730b76f789d1", "title": "An order-aware dataflow model for parallel Unix pipelines"}, {"paperId": "22e7e717583721415156f2a883a0515c455a1d3d", "title": "StreamQL: a query language for processing streaming time series"}, {"paperId": "5a35594dd9e5a820da6aab58f48f1b13c7e2601b", "title": "DiffStream: differential output testing for stream processing programs"}, {"paperId": "a200259fc0fde06d8e43239b9958a7c7ef780b02", "title": "Online Signal Monitoring With Bounded Lag"}, {"paperId": "1534a5716c1df08a24556a62dbf363e0375a4021", "title": "PaSh: light-touch data-parallel shell processing"}, {"paperId": "a0a089f9a3f61eb1957cbb8bf3af550485c0a35b", "title": "Semantic Foundations for Deterministic Dataflow and Stream Processing"}, {"paperId": "578fee35ad46149651763f1f73ffa662cf275d6a", "title": "Streamable Regular Transductions"}, {"paperId": "adf7135a4eaa4dc5457758808d5172d01c3bb188", "title": "DiSh: Dynamic Shell-Script Distribution"}, {"paperId": "46897d2e2fc310a1bfff677594d8936f999be2cc", "title": "Verified Online Monitoring for Metric Temporal Logic with Lattice-based Quantitative Semantics"}, {"paperId": "f71717006cdcb7182ba450e9e7a6e29f384eaa81", "title": "Correctness in Stream Processing: Challenges and Opportunities"}, {"paperId": "7fa6b4df1dff777255d1336e87a401bc1626ec6e", "title": "An Order-aware Dataflow Model for Extracting Shell Script Parallelism"}]}
