{"paperId": "acdbeba70cdfe90613027b1ffdf1ea2988ec80bb", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "IoT-Based Bee Swarm Activity Acoustic Classification Using Deep Neural Networks", "abstract": "Animal activity acoustic monitoring is becoming one of the necessary tools in agriculture, including beekeeping. It can assist in the control of beehives in remote locations. It is possible to classify bee swarm activity from audio signals using such approaches. A deep neural networks IoT-based acoustic swarm classification is proposed in this paper. Audio recordings were obtained from the Open Source Beehive project. Mel-frequency cepstral coefficients features were extracted from the audio signal. The lossless WAV and lossy MP3 audio formats were compared for IoT-based solutions. An analysis was made of the impact of the deep neural network parameters on the classification results. The best overall classification accuracy with uncompressed audio was 94.09%, but MP3 compression degraded the DNN accuracy by over 10%. The evaluation of the proposed deep neural networks IoT-based bee activity acoustic classification showed improved results if compared to the previous hidden Markov models system.", "venue": "Italian National Conference on Sensors", "year": 2021, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-01-20", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "21"}, "authors": [{"authorId": "1969787", "name": "Andrej Zgank"}], "citations": [{"paperId": "6b4a186cfe1eef76f40a0dda413db0688ceb5e38", "title": "BeeOpen—An Open Data Sharing Ecosystem for Apiculture"}, {"paperId": "369f2a1f28782ed4ae1da2fe991760bf371b3fc9", "title": "Emerging artificial intelligence applications: metaverse, IoT, cybersecurity, healthcare - an overview"}, {"paperId": "b4f4b1768692aa27ec11a479e79e0c0dd693e039", "title": "Downstream Task Performance of Pre-Trained Model For Outdoor Audio Event Classification"}, {"paperId": "b46d3d32a3a9365c7b0e008f9f2ea5394304a22b", "title": "MSPB: a longitudinal multi-sensor dataset with phenotypic trait measurements from honey bees"}, {"paperId": "afd1073ce898748d459552f323b52f4501457d3e", "title": "Aquisição e Classificação da Intensidade da Colmeia usando Características Cepstrais"}, {"paperId": "387dffd76647a052c904758311ff9beea29452eb", "title": "A deep learning-based approach for bee sound identification"}, {"paperId": "f70d3cf025414aa6edbb50dd6245505279224f8d", "title": "Signal Preprocessing Towards IoT Acoustic Data for Farm Pest Detection"}, {"paperId": "171077f55df399ff3381c468bf7b4055972416b2", "title": "The Design and Optimization of an Acoustic and Ambient Sensing AIoT Platform for Agricultural Applications"}, {"paperId": "edecb12ff1edbe699232f539e9a8c515e9488432", "title": "Multiplierless In-filter Computing for tinyML Platforms"}, {"paperId": "63f61b5cd4e3b07e4bb1b57fe3fb92ecda7c71ee", "title": "A Review of Successes and Impeding Challenges of IoT-Based Insect Pest Detection Systems for Estimating Agroecosystem Health and Productivity of Cotton"}, {"paperId": "602ce19e4cb4b8c2eb80fb19d1ae99b65f832ca4", "title": "NeuralBee - A Beehive Health Monitoring System"}, {"paperId": "b5525bc89de97c7fbfd9667e6f1160d3465b5f50", "title": "A Low-Cost, Low-Power, Multisensory Device and Multivariable Time Series Prediction for Beehive Health Monitoring"}, {"paperId": "8a701a4694806cc9ec0fe34b4a947f16d07b3d9f", "title": "Comparative Study of Machine Learning Models for Bee Colony Acoustic Pattern Classification on Low Computational Resources"}, {"paperId": "8a68bd27bc2b1a1f1b3f1325db1b9c87ee07a4f3", "title": "SEGBEE: Mobile Application for Honey Segmentation in Apiary Boards"}, {"paperId": "989739de3b3e4bf6ef0116535219819d4c487083", "title": "A Framework for Better Sensor-Based Beehive Health Monitoring"}, {"paperId": "3d1b39a388523c02d3fd0e153ab2334f8296ab65", "title": "A Review of Automated Bioacoustics and General Acoustics Classification Research"}, {"paperId": "457dad9cf7fc083611225685c2271be380a80c05", "title": "Investigation on new Mel frequency cepstral coefficients features and hyper-parameters tuning technique for bee sound recognition"}, {"paperId": "848331da4639e7284c797833e1b4c62d3a8755a9", "title": "Improving Misfire Fault Diagnosis with Cascading Architectures via Acoustic Vehicle Characterization"}, {"paperId": "fed4fed03f50b917024a8dea1973e283cd8cc249", "title": "Bee Sound Detector: An Easy-to-Install, Low-Power, Low-Cost Beehive Conditions Monitoring System"}, {"paperId": "39dff23396ea26e46d41055a324531d26a13502f", "title": "Dynamic noise filtering for multi-class classification of beehive audio data"}, {"paperId": "2e0b7abc5ee30f935934d421119aec83882ed00e", "title": "Edge Computing in IoT–Enabled Honeybee Monitoring for the Detection of Varroa Destructor"}, {"paperId": "317aa8aa3690b0fb57c90bc9c9ab21cc904749fa", "title": "Identify The Beehive Sound Using Deep Learning"}, {"paperId": "0ff9121c0e5173264bb22ffe56abf8d04f013d2a", "title": "Construction of Music Intelligent Creation Model Based on Convolutional Neural Network"}, {"paperId": "ac82e00eb5e38b4e1396a858149030e5bbc34041", "title": "Reduced MFCC Feature Extraction Dimension for Acoustic Classification of Bee Swarm Activity"}, {"paperId": "4ca68353213029551bb1011c0e2209c1c1f0b616", "title": "The AI Mechanic: Acoustic Vehicle Characterization Neural Networks"}, {"paperId": "0bcb429b7aaf2164a2eec09b1ebeb5838378c3a1", "title": "Automated Beehive Acoustics Monitoring: A Comprehensive Review of the Literature and Recommendations for Future Work"}, {"paperId": "dbf9b4a71b2259fb11bdb1a89712d366d3df9956", "title": "MFCC-based descriptor for bee queen presence detection"}, {"paperId": "b3932ad9f6f97fe5e8a85e38adf78d46801ba65b", "title": "IoT Monitoring and Prediction Modeling of Honeybee Activity with Alarm"}, {"paperId": "4930bf690cfd3c89035533f2a46363ec23198084", "title": "Buzz-based honeybee colony fingerprint"}, {"paperId": "a7c832a4bce06fa1b89468bcaf1e5cc83ef495fb", "title": "Monitoring honeybees (Apis spp.) (Hymenoptera: Apidae) in climate-smart agriculture: A review"}, {"paperId": "1a25d614e8cc1bbe1e85f6369bc3bd0079e72969", "title": "Artificial Neural Networks to Solve the Singular Model with Neumann–Robin, Dirichlet and Neumann Boundary Conditions"}, {"paperId": "4dfb0aa3720c206729c7af39e9b55344ee387b8c", "title": "HyAdamC: A New Adam-Based Hybrid Optimization Algorithm for Convolution Neural Networks"}, {"paperId": "81ea99a1b60868fe60103fac658d14587e19dc5b", "title": "A Deep Learning Approach to classify the Honeybee Species and health Identification"}, {"paperId": "c9916e2f94e6d9e04e3c40712124308a170e2c42", "title": "IndoorPlant: A Model for Intelligent Services in Indoor Agriculture Based on Context Histories"}, {"paperId": "4eb834fde99372872d53dcba96625866fe8ee226", "title": "IoT Technologies for Livestock Management: A Review of Present Status, Opportunities, and Future Trends"}, {"paperId": "1ee6cfca56e9c154009b55f25c8da376b916bef7", "title": "Beyond Sensor Data Analysis: Unexpected Challenges in a Honeybee Monitoring Project"}]}
