{"paperId": "ace5d926b17dc1e4d12de21c9765b8e9af5cda1e", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Green IoT and Edge AI as Key Technological Enablers for a Sustainable Digital Transition towards a Smart Circular Economy: An Industry 5.0 Use Case", "abstract": "Internet of Things (IoT) can help to pave the way to the circular economy and to a more sustainable world by enabling the digitalization of many operations and processes, such as water distribution, preventive maintenance, or smart manufacturing. Paradoxically, IoT technologies and paradigms such as edge computing, although they have a huge potential for the digital transition towards sustainability, they are not yet contributing to the sustainable development of the IoT sector itself. In fact, such a sector has a significant carbon footprint due to the use of scarce raw materials and its energy consumption in manufacturing, operating, and recycling processes. To tackle these issues, the Green IoT (G-IoT) paradigm has emerged as a research area to reduce such carbon footprint; however, its sustainable vision collides directly with the advent of Edge Artificial Intelligence (Edge AI), which imposes the consumption of additional energy. This article deals with this problem by exploring the different aspects that impact the design and development of Edge-AI G-IoT systems. Moreover, it presents a practical Industry 5.0 use case that illustrates the different concepts analyzed throughout the article. Specifically, the proposed scenario consists in an Industry 5.0 smart workshop that looks for improving operator safety and operation tracking. Such an application case makes use of a mist computing architecture composed of AI-enabled IoT nodes. After describing the application case, it is evaluated its energy consumption and it is analyzed the impact on the carbon footprint that it may have on different countries. Overall, this article provides guidelines that will help future developers to face the challenges that will arise when creating the next generation of Edge-AI G-IoT systems.", "venue": "Italian National Conference on Sensors", "year": 2021, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-08-26", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "21"}, "authors": [{"authorId": "1401263185", "name": "Paula Fraga-Lamas"}, {"authorId": "20658169", "name": "S. I. Lopes"}, {"authorId": "1398907758", "name": "T. Fernández-Caramés"}], "citations": [{"paperId": "0488903e42e27ca582a273c2e04b21e160c3095b", "title": "Mapping the Research Landscape of Industry 5.0 from a Machine Learning and Big Data Analytics Perspective: A Bibliometric Approach"}, {"paperId": "3a5b0449f9bcfbe2c3711d6294ab4b360cac9cde", "title": "Change Management for the Sustainable Development of the Agrarian Economy of Artificial Intelligence"}, {"paperId": "331cb59ad51d0a5317d4278822072dad93d6732f", "title": "Forging the Industrial Metaverse - Where Industry 5.0, Augmented and Mixed Reality, IIoT, Opportunistic Edge Computing and Digital Twins Meet"}, {"paperId": "5323fc9286035800fef6328b4e6834362260daa5", "title": "Enhancing Nanocrystal Synthesis: A Comparative Study of Online Artificial Intelligence Optimization and Offline High-Throughput Experimentation in Chemical Material Discovery"}, {"paperId": "b0895f749dbe8aa9547247c01bb8845832ddd34a", "title": "Industry 5.0: Do risk assessment and risk management need to update? And if yes, how?"}, {"paperId": "cc124d15472440a66e0276ba93a75505039d9379", "title": "How Does Artificial Intelligence Impact Green Development? Evidence from China"}, {"paperId": "2679552f9be6c9498ef89f54cdae756a00c9593e", "title": "Harmonizing sustainability in industry 5.0 era: Transformative strategies for cleaner production and sustainable competitive advantage"}, {"paperId": "19800087fc78f594fcee4c136596bd923cc79fce", "title": "A Theoretical Framework for Exploring the Industry 5.0 and Sustainable Supply Chain Determinants"}, {"paperId": "e719be7fcdaf4316f5ef9aabb0b82429b1a02b0e", "title": "Non-Terrestrial Networks for Energy-Efficient Connectivity of Remote IoT Devices in the 6G Era: A Survey"}, {"paperId": "0536a9910da5dbcea480bb9a62aeff7e02ee1d46", "title": "Digital product passports as enablers of digital circular economy: a framework based on technological perspective"}, {"paperId": "06dc84bb5a5f61d197988977cf0337812972a7fd", "title": "Supervised Machine Learning Approaches for Predicting Key Pollutants and for the Sustainable Enhancement of Urban Air Quality: A Systematic Review"}, {"paperId": "5a3ccf5d3f2d28e697b59ca3d5afae7038030f86", "title": "DEVELOPMENT OF INTERACTIVE CONTENT IN WEBSITE LEARNING MEDIA TO ADDRESS STUDENT MISCONCEPTIONS ABOUT THE GREENHOUSE EFFECT"}, {"paperId": "3594f468b0875cd8f53ae5671c9c69583c69e88b", "title": "Quantification of the impact of innovations in industry and infrastructure for sustainable circular economy production and consumption"}, {"paperId": "0d792da2ea1d68f996b5f5c5df7fc858128643f3", "title": "Connecting the Indispensable Roles of IoT and Artificial Intelligence in Smart Cities: A Survey"}, {"paperId": "2452d2492cfc55d5d7ea8b42e0842a1e9b60d03b", "title": "An Effective Data Driven Approach to Predict Bike Rental Demand"}, {"paperId": "85059c622945e14889d03e66b470932987e10680", "title": "On the Definition, Assessment, and Enhancement of Circular Economy across Various Industrial Sectors: A Literature Review and Recent Findings"}, {"paperId": "7ab7c865b2b456e0ab68636548eee8ad7987e265", "title": "Communication and computational resource optimization for Industry 5.0 smart devices empowered by MEC"}, {"paperId": "be4bbe1f0b400d31714a87c151c5ad2421a08f3f", "title": "Towards defining industry 5.0 vision with intelligent and softwarized wireless network architectures and services: A survey"}, {"paperId": "e7ea6c1a8fb6cf25e0b76e086e16522a5798a59e", "title": "Revolutionizing the Garment Industry 5.0: Embracing Closed-Loop Design, E-Libraries, and Digital Twins"}, {"paperId": "4ef776bef3affc2b6e9abc3f315ca3a03079380e", "title": "Manufacturing System Design in Industry 5.0: Incorporating Sociotechnical Systems and Social Metabolism for Human-Centered, Sustainable, and Resilient Production"}, {"paperId": "eaa11a42f897865db7f51cdeab18cf755e5829ac", "title": "The Relationship between AI Adoption Intensity and Internal Control System and Accounting Information Quality"}, {"paperId": "d76c3fce2ca38222bd0ab91d514734d6ba7d26c7", "title": "Do industry 5.0 advantages address the sustainable development challenges of the renewable energy supply chain?"}, {"paperId": "b4ae064fc1b6ce636465909bfd04a5edce9f648c", "title": "A Metamodel for Designing Assessment Models to support transition of production systems towards Industry 5.0"}, {"paperId": "64ff2676b8745b672960dcbe800ba3e2dc1b7c97", "title": "A Review on the prospects and challenges of integrating IoT technologies in circular business models"}, {"paperId": "7dfcee1c15cb73905463cbb5fcd4998830abb6df", "title": "A Comprehensive Review of AI-enabled Unmanned Aerial Vehicle: Trends, Vision , and Challenges"}, {"paperId": "b1ad6d5dc1a5e22a19b6015145226d38c21b98b5", "title": "Modeling Analysis of the Contribution of Digital Technology to Economic Quality Development"}, {"paperId": "acd52c47d1956cc73334a5e79145adf79fe9b2b3", "title": "Study on the economic benefits of carbon-neutral digital platforms for sustainable development based on the GPT-QRCNN model"}, {"paperId": "f499d8b221b141cb4a0fc77475c2ac6ae37f6176", "title": "Selective Laser Melting and Spark Plasma Sintering: A Perspective on Functional Biomaterials"}, {"paperId": "7f3167862fe3220ae62f7b1f7e912cfa2d44085a", "title": "Green IoT for Sustainable Smart Vertical Farming: A Comprehensive Analysis"}, {"paperId": "42b048448b1ad503ad4269094ce718e6ce07c227", "title": "Revolutionizing supply chain and circular economy with edge computing: systematic review, research themes and future directions"}, {"paperId": "2b708129045ec83d882c44099060c7ec11a0dffb", "title": "Digital Democracy Political Participation Through Technology in the Modern Era"}, {"paperId": "c3fb70cd44d4aad6d63808c82b9bc752e5021aa5", "title": "Can green finance facilitate Industry 5.0 transition to achieve sustainability? A systematic review with future research directions"}, {"paperId": "8fc778b5c197ea918ffb548b82c48829f8c0e16d", "title": "Global Differentiation of Climate-digital Projects in Terms of Low-carbon Economy"}, {"paperId": "b799f6dc5812f2a7630a487bb1b2c7c80276f933", "title": "Green IoT Edge Computing Towards Sustainable and Distributed Data Processing"}, {"paperId": "46d8160c57c69e4ecd8958bc6de627d84264fd23", "title": "Towards the Cognitive Factory in Industry 5.0: From Concept to Implementation"}, {"paperId": "9c9f42afa00a4cb8cfbed82f2b31dfc53943a927", "title": "Anomaly Detection in 6G Networks Using Machine Learning Methods"}, {"paperId": "e3f349c2e1012702164a51c5457dea9420906be1", "title": "Promoting sustainable and human-centric industry 5.0: a thematic analysis of emerging research topics and opportunities"}, {"paperId": "50072069672d7a13b3098401e6f537d96b59d246", "title": "Neoindustrialization—Reflections on a New Paradigmatic Approach for the Industry: A Scoping Review on Industry 5.0"}, {"paperId": "c769b42617f2ce8881eb7ec4008a7fcf8ec63c67", "title": "The challenges in adoption of circular economy in SMEs – a research agenda and way forward"}, {"paperId": "bfde71e8742110563be7275d002d82137329a3f9", "title": "Effect of Artificial Intelligence on the Development of China’s Wholesale and Retail Trade"}, {"paperId": "cd587fed2529b6bddba94624308275c2b5403e0e", "title": "Enabling artificial intelligence for sustainable food grain supply chains: an agri 5.0 and circular economy perspective"}, {"paperId": "6cef1db0925db21870ba687e39bdb0085d5bfb67", "title": "Industry 5.0 implications for inclusive sustainable manufacturing: An evidence-knowledge-based strategic roadmap"}, {"paperId": "ab76ccb856f419ad84f550215e2052eac911dbfa", "title": "Characterizing Circular Supply Chain Practices in Industry 5.0 With Respect to Sustainable Manufacturing Operations"}, {"paperId": "e0ff01bb9b6528258df384bc163fe2084bb534c6", "title": "A System-Based Framework for Optimal Sensor Placement in Smart Grids"}, {"paperId": "a7320e4c330ffe56f196618715245052242e9a94", "title": "Artificial intelligence-based approaches for improving the diagnosis, triage, and prioritization of autism spectrum disorder: a systematic review of current trends and open issues"}, {"paperId": "4cfd475c972a7a8f9f35b24277199203afc47178", "title": "Contributions of artificial intelligence for circular economy transition leading toward sustainability: an explorative study in agriculture and food industries of Pakistan"}, {"paperId": "752c6698057258b2f65db8754b7b6c3c3d1e0ead", "title": "The adoption of digital technologies in the manufacturing world and their evaluation: A systematic review of real-life case studies and future research agenda"}, {"paperId": "0e9fecc6a9be6992d426a7801be5485a7a2e0725", "title": "Behind the definition of Industry 5.0: a systematic review of technologies, principles, components, and values"}, {"paperId": "804525cc5392bfe1225d0e9e1ffda3965ef84bff", "title": "On the development of a smart architecture for a sustainable manufacturing-remanufacturing system: A literature review approach"}, {"paperId": "6527377c7f6a40305e831364e3f52c551d2b4e3b", "title": "The sustainability impact of a digital circular economy"}, {"paperId": "59ce424b17b6be4e62118ceaa4bb9f5a1ac90013", "title": "Recent Advancements and Challenges of AIoT Application in Smart Agriculture: A Review"}, {"paperId": "c146b34d5be1ca3eb2d18e91e3dbeb13ae6b07be", "title": "Research and evidence-based standards paving the way for a digital and sustainable transformation of the built environment"}, {"paperId": "7f4555585452b6b5a24d33cd602ed22bed7162d3", "title": "Industry 5.0: Tracking Scientific Activity on the Most Influential Industries, Associated Topics, and Future Research Agenda"}, {"paperId": "6374aca027a7a0e7aa7fdc5d981525fb9eb89921", "title": "Analysing the alignment between circular economy and industry 4.0 nexus with industry 5.0 era: An integrative systematic literature review"}, {"paperId": "24298df4ea9ca55e8d704362c488c6ff5c558a2e", "title": "Opportunities and risks of internet of things (IoT) technologies for circular business models: A literature review."}, {"paperId": "58ff4815755430918a342489dd8c3c0adbf862dc", "title": "Improving cloud/edge sustainability through artificial intelligence: A systematic review"}, {"paperId": "65df3c90a774fb9bfb52904764e6a4cf816db47f", "title": "Wireless Sensing and Networking for the Internet of Things"}, {"paperId": "4a98355e240705ff6ebbcb5213b61e02cbc9c4a8", "title": "A systematic review of Green AI"}, {"paperId": "a425fb3e16acb05e8495f957279f011f6fce8c54", "title": "Digital Twins in Industry 5.0"}, {"paperId": "059b86654d3c8f45cd9f1790dd73a0132ce0b586", "title": "Sustainable Internet of Things (S-IoT) with 5G Smart Antennas for Smart Media Data Services"}, {"paperId": "08c2467a5f4c7916097d0a3a6b1d5e16d27061ab", "title": "Actions and approaches for enabling Industry 5.0‐driven sustainable industrial transformation: A strategy roadmap"}, {"paperId": "d96e45459604d7727ed8ae37aafc70475b570127", "title": "Supply Chain Quality Management and Industry 5.0 - A Literature Review and Analysis"}, {"paperId": "a7fb8ee177cda9560c615ac3984629abdf479ee8", "title": "Studying the interactions among Industry 5.0 and circular supply chain: Towards attaining sustainable development"}, {"paperId": "80d901cfae4793ef3e95e647fc0c62e384420a45", "title": "Blockchain-based trust mechanism for digital twin empowered Industrial Internet of Things"}, {"paperId": "ba888292f3757ba4940a1bb36b32e0527345ae78", "title": "Mist and Edge Computing Cyber-Physical Human-Centered Systems for Industry 5.0: A Cost-Effective IoT Thermal Imaging Safety System"}, {"paperId": "c9eae34bb46cc24384de3265983dfb39c35f326a", "title": "IoT and digital circular economy: Principles, applications, and challenges"}, {"paperId": "64c544d3d8a4314647956422f7cee4aea0cbf960", "title": "Real-Time Energy Data Acquisition, Anomaly Detection, and Monitoring System: Implementation of a Secured, Robust, and Integrated Global IIoT Infrastructure with Edge and Cloud AI"}, {"paperId": "1820bb3a9c45b3c1aec1a32da91595122f030ba6", "title": "A multi-layer guided reinforcement learning-based tasks offloading in edge computing"}, {"paperId": "fe3a8d571cddf919558cf3be5fa14a416c9eb0ef", "title": "Industry 5.0 Beyond Technology: An Analysis Through the Lens of Business and Operations Management Literature"}, {"paperId": "64eb7e19d4898c4ccbe09c9995a7239ed8319df2", "title": "A Bluetooth 5 Opportunistic Edge Computing System for Vehicular Scenarios"}, {"paperId": "1ed37062884b4e4d45be082a64f2f1a16765fd80", "title": "Practical Latency Analysis of a Bluetooth 5 Decentralized IoT Opportunistic Edge Computing System for Low-Cost SBCs"}, {"paperId": "ff64c4f9b6cbdae960b86e2418823a5c11cfef77", "title": "Perceptual Encryption-based Privacy-Preserving Deep Learning in Internet of Things Applications"}, {"paperId": "e579ba94e9d4a25003f66451672125e1a1f298d1", "title": "Evolutionary Game Analysis of Non-Governmental Organizations Participating in Garbage Management under the Background of Internet of Things"}, {"paperId": "d59ca79bbcf2783ffc731104b69b297122b4d1db", "title": "Integrated sustainable transportation modelling approaches for electronic passenger vehicle in the context of industry 5.0"}, {"paperId": "3e445486c9273447826454f0d53d4de7e150d3ac", "title": "The role of education and social policy in the development of responsible production and consumption in the AI economy"}, {"paperId": "75a03aa3b2106f82c2d7c4018135dd4440f7e3ba", "title": "Future of industry 5.0 in society: human-centric solutions, challenges and prospective research areas"}, {"paperId": "e8c84b644c8cfd4efec2152d9787fc9f0ccae605", "title": "Transformation of Industry Ecosystems in Cities and Regions: A Generic Pathway for Smart and Green Transition"}, {"paperId": "d18e495585139cdc3f26a0df18d8af0ea5efdabf", "title": "Identifying industry 5.0 contributions to sustainable development: A strategy roadmap for delivering sustainability values"}, {"paperId": "f5ac813671f19c185ead7df3f0bc09f3b0a63c3d", "title": "Environmental competitiveness of the economy: Opportunities for its improvement with the help of AI"}, {"paperId": "1e5aea4718fec3e18f7fad08971f92eca73b08f7", "title": "Applications of Sensor Networks and Remote Sensing in Environmental Sustainability: A Review"}, {"paperId": "b1a05313e172e34ed29f42d54715b38c624fb2dd", "title": "Industry 5.0 is Coming: A Survey on Intelligent NextG Wireless Networks as Technological Enablers"}, {"paperId": "242dd890041c7dfdd3242144e922086b98aabdc9", "title": "A 3D indicator for guiding AI applications in the energy sector"}, {"paperId": "7ea7c54d81f7df64744df060b0899a116b2b4fed", "title": "Moving from Industry 4.0 to Industry 5.0: What Are the Implications for Smart Logistics?"}, {"paperId": "596d56f70f678c91e84b6adc0d3b06ebd652bb34", "title": "Information technology investment and working capital management efficiency: evidence from India survey data"}, {"paperId": "1564fcb1e7265a1700e7827da8eccc5ceb431ed4", "title": "A framework of digital technologies for the circular economy: Digital functions and mechanisms"}, {"paperId": "3f9ead904f9671b39ffe46641343c88423016999", "title": "State of Industry 5.0—Analysis and Identification of Current Research Trends"}, {"paperId": "42d965df319de90770b223a773e5232c73faf073", "title": "Modeling an Edge Computing Arithmetic Framework for IoT Environments"}, {"paperId": "17bcd4032bdd542109ebdf6ef875a729240b52cd", "title": "Sustainability and the Digital transition: a literature review"}, {"paperId": "737eb2e894f2cca35900db44cb44757e262bab4f", "title": "Introductory Chapter: On the Convergence of Blockchain and Artificial Intelligence - Opportunities and Challenges"}, {"paperId": "b5340a637e497e6a3c147f4e80556e1352e5a44a", "title": "Modeling of a Generic Edge Computing Application Design"}, {"paperId": "d7fa1bc987f1ccc5ae2411141e106ef209ce5551", "title": "Putting Digital Technologies at the Forefront of Industry 5.0 for the Implementation of a Circular Economy in Manufacturing Industries"}, {"paperId": "e8266e52d3459e2e883c691a4ebe04ebb7c73daf", "title": "Higher education via the lens of industry 5.0: Strategy and perspective"}, {"paperId": "566bd0a8eda5ce2da2ad29479827cb01164ebb58", "title": "Remote Sensing for Agriculture in the Era of Industry 5.0—A Survey"}, {"paperId": "500befe8bfa6f3f8a2b16bf0a85b1af06df1ffa9", "title": "Greenhouse Gas Emission Reduction Architecture in Computer Science: A Systematic Review"}, {"paperId": "8e8b360b242647841953e6798d2f805e650788f9", "title": "Design, Implementation, and Practical Evaluation of a Voice Recognition Based IoT Home Automation System for Low-Resource Languages and Resource-Constrained Edge IoT Devices: A System for Galician and Mobile Opportunistic Scenarios"}, {"paperId": "637f7b7ffc69473dc8fc05a91a8f7ed77e9c3218", "title": "A Comprehensive Review of Green Computing: Past, Present, and Future Research"}, {"paperId": "ea67954ae314b563f8eb2c95eaf81e0607874e97", "title": "Introductory Chapter: Opportunities and Challenges on the Convergence of Blockchain and Artificial Intelligence"}, {"paperId": "d214eb305986613e399978d03c34aca90bfc9d74", "title": "Moving Towards Industry 5.0 in the Pharmaceutical Manufacturing Sector: Challenges and Solutions for Germany"}, {"paperId": "0a0ab6746ef5a2dc0df6d7d4f671029bb0245266", "title": "Retrofitting-based development of brownfield Industry 4.0 and Industry 5.0 solutions"}, {"paperId": null, "title": "Microsoft Word-6115962022148261conference 2022IEEE.docx"}]}
