{"paperId": "acec2b7f289c9e9b6454d8b48e0c41ad2c9e7061", "publicationVenue": {"id": "d9720b90-d60b-48bc-9df8-87a30b9a60dd", "name": "Neural Information Processing Systems", "type": "conference", "alternate_names": ["Neural Inf Process Syst", "NeurIPS", "NIPS"], "url": "http://neurips.cc/"}, "title": "MTNeuro: A Benchmark for Evaluating Representations of Brain Structure Across Multiple Levels of Abstraction", "abstract": "There are multiple scales of abstraction from which we can describe the same image, depending on whether we are focusing on fine-grained details or a more global attribute of the image. In brain mapping, learning to automatically parse images to build representations of both small-scale features (e.g., the presence of cells or blood vessels) and global properties of an image (e.g., which brain region the image comes from) is a crucial and open challenge. However, most existing datasets and benchmarks for neuroanatomy consider only a single downstream task at a time. To bridge this gap, we introduce a new dataset, annotations, and multiple downstream tasks that provide diverse ways to readout information about brain structure and architecture from the same image. Our multi-task neuroimaging benchmark (MTNeuro) is built on volumetric, micrometer-resolution X-ray microtomography images spanning a large thalamocortical section of mouse brain, encompassing multiple cortical and subcortical regions. We generated a number of different prediction challenges and evaluated several supervised and self-supervised models for brain-region prediction and pixel-level semantic segmentation of microstructures. Our experiments not only highlight the rich heterogeneity of this dataset, but also provide insights into how self-supervised approaches can be used to learn representations that capture multiple attributes of a single image and perform well on a variety of downstream tasks. Datasets, code, and pre-trained baseline models are provided at: https://mtneuro.github.io/.", "venue": "Neural Information Processing Systems", "year": 2023, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-01-01", "journal": {"name": "Advances in neural information processing systems", "pages": "\n          5299-5314\n        ", "volume": "35"}, "authors": [{"authorId": "143850430", "name": "Jorge Quesada"}, {"authorId": "2150914310", "name": "Lakshmi Sathidevi"}, {"authorId": "2112342083", "name": "Ran Liu"}, {"authorId": "2156836", "name": "Nauman Ahad"}, {"authorId": "2176117950", "name": "Joy M. Jackson"}, {"authorId": "2039962468", "name": "Mehdi Azabou"}, {"authorId": "31227090", "name": "Jingyun Xiao"}, {"authorId": "2176114642", "name": "Christopher Liding"}, {"authorId": "2170164083", "name": "Carolina Urzay"}, {"authorId": "1384052997", "name": "William Gray-Roncal"}, {"authorId": "2118693758", "name": "Erik C. Johnson"}, {"authorId": "1746363", "name": "Eva L. Dyer"}], "citations": [{"paperId": "60304c0b22e82b7d280631557ee0c3e0f4cf03c7", "title": "What a MESS: Multi-Domain Evaluation of Zero-Shot Semantic Segmentation"}, {"paperId": "d5e0c4bf2018e6ba59918878fe7e2b376c688b8d", "title": "WBCAtt: A White Blood Cell Dataset Annotated with Detailed Morphological Attributes"}]}
