{"paperId": "aceff6611e5645c8971c57035be5031db8e95d5e", "publicationVenue": {"id": "ede7e9cc-1657-47d5-bcf1-1ca3b056bf9d", "name": "Journal of Management Information Systems", "type": "journal", "alternate_names": ["J Manag Inf Syst"], "issn": "0742-1222", "url": "http://www.mesharpe.com/mall/results1.asp?ACR=MIS", "alternate_urls": ["http://www.metapress.com/openurl.asp?genre=journal&issn=0742-1222", "http://www.tandfonline.com/toc/mmis20/current", "http://www.tandfonline.com/loi/mmis", "http://www.jstor.org/journals/07421222.html", "https://www.jstor.org/journal/jmanainfosyst", "http://www.jmis-web.org/"]}, "title": "Stigmergy in Open Collaboration: An Empirical Investigation Based on Wikipedia", "abstract": "ABSTRACT Participants in open collaboration communities coproduce knowledge despite minimal explicit communication to coordinate the efforts. Studying how participants coordinate around the knowledge artifact and its impacts are critical for understanding the open knowledge production model. This study builds on the theory of stigmergy, wherein actions performed by a participant leave traces on a knowledge artifact and stimulate succeeding actions. We find that stigmergy involves two intertwined processes: collective modification and collective excitation. We propose a new measure of stigmergy based on the spatial and temporal clustering of contributions. By analyzing thousands of Wikipedia articles, we find that the degree of stigmergy is positively associated with community members’ participation and the quality of the knowledge produced. This study contributes to the understanding of open collaboration by characterizing the spatial-temporal clustering of contributions and providing new insights into the relationship between stigmergy and knowledge production outcomes. These findings can help practitioners increase user engagement in knowledge production processes in order to create more sustainable open collaboration communities.", "venue": "Journal of Management Information Systems", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-07-03", "journal": {"name": "Journal of Management Information Systems", "pages": "983 - 1008", "volume": "40"}, "authors": [{"authorId": "2233239462", "name": "Lei (Nico) Zheng"}, {"authorId": "39544108", "name": "Feng Mai"}, {"authorId": "2175411216", "name": "Bei Yan"}, {"authorId": "1766622", "name": "J. Nickerson"}], "citations": []}
