{"paperId": "acf77ab1c4256136a86ece59d06cdd60ad6dd971", "publicationVenue": {"id": "501c1070-b5d2-4ff0-ad6f-8769a0a1e13f", "name": "Wireless Communications and Mobile Computing", "type": "journal", "alternate_names": ["Wirel Commun Mob Comput"], "issn": "1530-8669", "url": "https://www.hindawi.com/journals/wcmc/", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/15308677", "http://www.interscience.wiley.com/jpages/1530-8669/"]}, "title": "A Novel Secure Authentication Protocol for IoT and Cloud Servers", "abstract": "The integration of IoT with the cloud infrastructure is essential for designing smart applications. However, such integration may lead to security issues. Authentication and session key establishment is an essential security requirement for secure communication between IoT devices and cloud servers. For evaluating authentication key agreement schemes, the extended Canetti–Krawczyk (eCK) adversary model is regarded to be a more strict and relevant adversary model. Many schemes for authenticated key exchange between IoT devices and cloud servers have been proposed in the literature but have been assessed under Dolev and Yoa (DY) adversary model. Recently, Rostampour et al. introduced an ECC-based approach for enabling authentication between IoT devices and cloud servers that is secure and robust to various attacks under the Dolev and Yoa adversary model. In this paper, a detailed review and the automated security verification of the Rostampour et al. scheme are carried out under the eCK adversary model using Scyther-Compromise. The validation indicates that the scheme is not secure and is susceptible to various attacks under the eCK adversary model. To overcome the limitation of the Rostampour et al. scheme, a design of an ECC-based scheme for authentication between IoT devices and cloud servers under the eCK adversary model is proposed. The Scyther verification indicates that the scheme is safe under the eCK adversary model. The soundness of the correctness of the proposed scheme has been analyzed using BAN logic. Comparative analysis indicates that the scheme is resilient under the eCK adversary model with an energy overhead of 278.16 mJ for a resource constraint IoT device and a communication overhead of 1,408 bits.", "venue": "Wireless Communications and Mobile Computing", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-03-03", "journal": {"name": "Wireless Communications and Mobile Computing"}, "authors": [{"authorId": "9189568", "name": "Ummer Iqbal"}, {"authorId": "9143407", "name": "Aditya Tandon"}, {"authorId": "2157672929", "name": "Sonali Gupta"}, {"authorId": "2080306489", "name": "Arvind R. Yadav"}, {"authorId": "51436958", "name": "Rahul Neware"}, {"authorId": "81224767", "name": "F. Gelana"}], "citations": [{"paperId": "3dbbf63cecb90c2bb72e3bd1ec9bd842d930df2f", "title": "ASAP-IIOT: An Anonymous Secure Authentication Protocol for Industrial Internet of Things"}, {"paperId": "d6bac6025f120b121aab14b476e0a56c69e89713", "title": "Deterministic Hash and Linear Congruential BlowFish Extreme Learning for User Authentication in Cloud Computing"}, {"paperId": "0a5c66820cea86b0f61ef4bb8920037c3aa63e7e", "title": "Collaborative-Based Dynamic Trust Model for Bring-Your-Own-Device Access Control Management in Cloud Environment"}, {"paperId": "90bb9646b4d1c71e1e6d0c3827ca51ba6729b3ad", "title": "A novel and provably secure mutual authentication protocol for cloud environment using elliptic curve cryptography and fuzzy verifier"}, {"paperId": "c62ad075d438ddd70584f75ff952aad481b4af27", "title": "A Lightweight Certificateless Authentication and Key Agreement Protocol for Cloud Environments"}, {"paperId": "5df50770fe7498d25f1f99bd501611f068f3f152", "title": "ECC-reliant secure authentication protocol for cloud server and smart devices in IoT"}, {"paperId": "bc086c4a0ee28a95b06dcd84ad5f00c1ccb49ae1", "title": "Key Agreement and Authentication Protocols in the Internet of Things: A Survey"}, {"paperId": "f0eabbfd8ebb7c84af5f8a29ef90c5d24d4aa3cf", "title": "SAKAP: SGX-Based Authentication Key Agreement Protocol in IoT-Enabled Cloud Computing"}, {"paperId": "98067d9958b6bc688257cd7211544ed3ca97696f", "title": "A Lightweight Approach (BL-DAC) to Secure Storage Sharing in Cloud-IoT Environments"}]}
