{"paperId": "acff2b6f2dcdeb5227b34aba02cc8345b155a059", "publicationVenue": {"id": "406d9f60-417a-4dc5-a6b7-1fe4689a4ff7", "name": "IEEE International Conference on Cloud Computing", "type": "conference", "alternate_names": ["Int Conf Cloud Comput [services Soc", "CLOUD", "International Conference on Cloud Computing [Services Society]", "IEEE Int Conf Cloud Comput"]}, "title": "Efficient Distributed Smith-Waterman Algorithm Based on Apache Spark", "abstract": "The Smith-Waterman algorithm, which produces the optimal local alignment between pairwise sequences, is universally used as a key component in bioinformatics fields. It is more sensitive than heuristic approaches, but also more time-consuming. To speed up the algorithm, Single-Instruction Multiple-Data (SIMD) instructions have been used to parallelize the algorithm by leveraging data parallel strategy. However, SIMD-based Smith-Waterman (SW) algorithms show limited scalability. Moreover, the recent next-generation sequencing machines generate sequences at an unprecedented rate, so faster implementations of the sequence alignment algorithms are needed to keep pace. In this paper, we present CloudSW, an efficient distributed Smith-Waterman algorithm which leverages Apache Spark and SIMD instructions to accelerate the algorithm. To facilitate easy integration of distributed Smith-Waterman algorithm into third-party software, we provide application programming interfaces (APIs) service in cloud. The experimental results demonstrate that 1) CloudSW has outstanding performance and achieves up to 3.29 times speedup over DSW and 621 times speedup over SparkSW. 2) CloudSW has excellent scalability and achieves up to 529 giga cell updates per second (GCUPS) in protein database search with 50 nodes in Aliyun Cloud, which is the highest performance that has been reported as far as we know.", "venue": "IEEE International Conference on Cloud Computing", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2017-06-25", "journal": {"name": "2017 IEEE 10th International Conference on Cloud Computing (CLOUD)", "pages": "608-615"}, "authors": [{"authorId": "2109511773", "name": "Bo Xu"}, {"authorId": "2826422", "name": "Changlong Li"}, {"authorId": "37626676", "name": "Hang Zhuang"}, {"authorId": "2109656815", "name": "Jiali Wang"}, {"authorId": "2144293213", "name": "Qingfeng Wang"}, {"authorId": "8453780", "name": "Xuehai Zhou"}], "citations": [{"paperId": "56d16cb01d24816507548437f3303c3f55007b71", "title": "Optimizing computational costs of Spark for SARS‐CoV‐2 sequences comparisons on a commercial cloud"}, {"paperId": "c4a2a2993f4e66a8266c7d621419b11935ef1b6c", "title": "A taxonomy of tools and approaches for distributed genomic analyses"}, {"paperId": "d7911947350361e2c65901ee09a86b72c0ee0dc0", "title": "Application of the Smith Waterman and Jukes Cantor Algorithm in the Arrangement of the SARS CoV-2 Virus"}, {"paperId": "50fd4794e59be6809eb7414f432c3e35c3185afd", "title": "BigFiRSt: A Software Program Using Big Data Technique for Mining Simple Sequence Repeats From Large-Scale Sequencing Data"}, {"paperId": "c2cccdc71114ed2e140ffee1e8fbd18851dd6e27", "title": "Towards Analyzing Computational Costs of Spark for SARS-CoV-2 Sequences Comparisons on a Commercial Cloud"}, {"paperId": "d3e9f636727b0b8f47a968c2b90435fe1c5aa9b2", "title": "Efficient Execution of Dynamic Programming Algorithms on Apache Spark"}, {"paperId": "349db8e5df3a07f52e51505fb1079ef1ffe81b11", "title": "High throughput BLAST algorithm using spark and cassandra"}, {"paperId": "30bc18b627c5cc0fb812da8df6f7ed12b1ecc4c0", "title": "Time Improvement of Smith-Waterman Algorithm Using OpenMP and SIMD"}, {"paperId": "069946e7b85aca71e8fdfdaa03bc3a84699c8d14", "title": "Development of Scalable On-Line Anomaly Detection System for Autonomous and Adaptive Manufacturing Processes"}, {"paperId": "e4b90913113111731def4b343bd2fe3c94b77c7b", "title": "An Improved Smith-Waterman Algorithm Based on Spark Parallelization"}, {"paperId": "ee6d4d4d90c2de8ecca853adad4420e986bb3abb", "title": "Opti-SW: An improved gene sequence alignment algorithm"}, {"paperId": "c2f1ba474f9332a5713983ddd85f4c34271ecfb9", "title": "Distributed MMAS for weapon target assignment based on Spark framework"}, {"paperId": "fc91e7527bacebff3e4c9ff3cdc626b6c0c2c024", "title": "Distributed gene clinical decision support system based on cloud computing"}, {"paperId": "8f5ddec220b57b07c52da7edf619d024de619e71", "title": "MapReduce Model Using FPGA Acceleration for Chromosome Y Sequence Mapping"}, {"paperId": "bc72ae884571e00da6c17d82f2d4640681f023cd", "title": "Identifying Polymorphic Malware Variants Using Biosequence Analysis Techniques"}, {"paperId": "7bf6731bdb20f5b4e69eb836457571dd9271cc69", "title": "Hybrid routing algorithm for improving path selection in sustainable network"}]}
