{"paperId": "ad0b6c22b8c1c82b22a4ee782c8ae4c00f2c4e60", "publicationVenue": {"id": "0ad7476a-20b9-4998-9360-48e3b9bd8d31", "name": "IEEE International Symposium on Defect and Fault Tolerance in VLSI and Nanotechnology Systems", "type": "conference", "alternate_names": ["DFT", "IEEE Int Symp Defect Fault Toler VLSI Nanotechnol Syst", "Defect and Fault Tolerance in VLSI and Nanotechnology Systems", "Defect Fault Toler VLSI Nanotechnol Syst"], "url": "http://www.wikicfp.com/cfp/program?id=702"}, "title": "Lifetime memory reliability data from the field", "abstract": "In order to provide high system resilience, it is important to understand the nature of the faults that occur in the field. This study analyzes fault rates from a production system that has been monitored for five years, capturing data for the entire operational lifetime of the system. The data show that devices in this system did not show any sign of aging during the monitoring period, suggesting that the lifetime of a system may be longer than five years. In DRAM, the relative incidence of fault modes changed insignificantly over the system's lifetime: the relative rate of each fault mode at the end of the system's lifetime was within 1.4 percentage point of the rate observed during the first year. SRAM caches in the system exhibited different fault modes including cache-way fault and single-bit faults. Overall, this study provides insights on how fault modes and types in a system evolve over the system's lifetime.", "venue": "IEEE International Symposium on Defect and Fault Tolerance in VLSI and Nanotechnology Systems", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2017-10-01", "journal": {"name": "2017 IEEE International Symposium on Defect and Fault Tolerance in VLSI and Nanotechnology Systems (DFT)", "pages": "1-6"}, "authors": [{"authorId": "1732313", "name": "Taniya Siddiqua"}, {"authorId": "145448804", "name": "Vilas Sridharan"}, {"authorId": "2823955", "name": "Steven E. Raasch"}, {"authorId": "1775855", "name": "Nathan Debardeleben"}, {"authorId": "1734561", "name": "Kurt B. Ferreira"}, {"authorId": "145919309", "name": "Scott Levy"}, {"authorId": "3470527", "name": "Elisabeth Baseman"}, {"authorId": "1764948", "name": "Qiang Guan"}], "citations": [{"paperId": "9b9829b9ee915fe8684818cd04fec23a4a32b738", "title": "Using Benford's Law to Identify Unusual Failure Regions"}, {"paperId": "b3858e03623303b23e3c81c71664932ca2fa896a", "title": "Structural Coding: A Low-Cost Scheme to Protect CNNs from Large-Granularity Memory Faults"}, {"paperId": "544d8ed5a31b817f5beff1f55e4700f67d770c61", "title": "Predicting Future-System Reliability with a Component-Level DRAM Fault Model"}, {"paperId": "4334b5b86b17342952d0221a3bf2542222e3a683", "title": "Quantitative Analysis of Sparsely Synchronized Fail-Safe Processors"}, {"paperId": "8453d235a8ba1273c0acf3d1051808a06a5a5c1c", "title": "Reducing the fault vulnerability of hard real-time systems"}, {"paperId": "f15b80ab5173a9cc3d7dd2353678e617e89bd54e", "title": "Self-Managing DRAM: A Low-Cost Framework for Enabling Autonomous and Efficient in-DRAM Operations"}, {"paperId": "ffa1a997cef4d5c2c5cde08538a8df5fb856f008", "title": "Understanding Memory Failures on a Petascale Arm System"}, {"paperId": "84b4c855318276c63c2a5a4e82164a7289dc04c8", "title": "Reliability, Availability, and Serviceability Challenges for Heterogeneous System Design"}, {"paperId": "611a687f13cc1e58108a20964b5dac6df4ca49dd", "title": "Open-source IP cores for space: A processor-level perspective on soft errors in the RISC-V era"}, {"paperId": "a1179f2709a6ba27d4785aa3a14cb9f9e692c7f6", "title": "A Methodology for Comparing the Reliability of GPU-Based and CPU-Based HPCs"}, {"paperId": "e6dfdb920fdbb9ac7d2748aa7ab82d6945ac0293", "title": "Characterizing and Understanding HPC Job Failures Over The 2K-Day Life of IBM BlueGene/Q System"}, {"paperId": "8da628b6f7fc323560981fd817329de40f07f852", "title": "Exploring Properties and Correlations of Fatal Events in a Large-Scale HPC System"}, {"paperId": "4746be9f3fa6d5816438b5a32a2d6db2966d6ee3", "title": "Large Scale Studies of Memory, Storage, and Network Failures in a Modern Data Center"}, {"paperId": "0d5ebe23a0aedb71c30bd2f855a1f0846e0321ab", "title": "Lessons Learned from Memory Errors Observed Over the Lifetime of Cielo"}]}
