{"paperId": "ad22d17bc81ae6da5e15804cc7ad8092966172d1", "publicationVenue": {"id": "1944b6e1-2c1d-4f42-88e3-9f8a52f57e47", "name": "Diagnostics", "issn": "2075-4418", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217965", "alternate_urls": ["https://www.mdpi.com/journal/diagnostics", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217965"]}, "title": "Artificial Intelligence in Dementia: A Bibliometric Study", "abstract": "The applications of artificial intelligence (AI) in dementia research have garnered significant attention, prompting the planning of various research endeavors in current and future studies. The objective of this study is to provide a comprehensive overview of the research landscape regarding AI and dementia within scholarly publications and to suggest further studies for this emerging research field. A search was conducted in the Web of Science database to collect all relevant and highly cited articles on AI-related dementia research published in English until 16 May 2023. Utilizing bibliometric indicators, a search strategy was developed to assess the eligibility of titles, utilizing abstracts and full texts as necessary. The Bibliometrix tool, a statistical package in R, was used to produce and visualize networks depicting the co-occurrence of authors, research institutions, countries, citations, and keywords. We obtained a total of 1094 relevant articles published between 1997 and 2023. The number of annual publications demonstrated an increasing trend over the past 27 years. Journal of Alzheimer’s Disease (39/1094, 3.56%), Frontiers in Aging Neuroscience (38/1094, 3.47%), and Scientific Reports (26/1094, 2.37%) were the most common journals for this domain. The United States (283/1094, 25.86%), China (222/1094, 20.29%), India (150/1094, 13.71%), and England (96/1094, 8.77%) were the most productive countries of origin. In terms of institutions, Boston University, Columbia University, and the University of Granada demonstrated the highest productivity. As for author contributions, Gorriz JM, Ramirez J, and Salas-Gonzalez D were the most active researchers. While the initial period saw a relatively low number of articles focusing on AI applications for dementia, there has been a noticeable upsurge in research within this domain in recent years (2018–2023). The present analysis sheds light on the key contributors in terms of researchers, institutions, countries, and trending topics that have propelled the advancement of AI in dementia research. These findings collectively underscore that the integration of AI with conventional treatment approaches enhances the effectiveness of dementia diagnosis, prediction, classification, and monitoring of treatment progress.", "venue": "Diagnostics", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-06-01", "journal": {"name": "Diagnostics", "volume": "13"}, "authors": [{"authorId": "3411562", "name": "Chieh-Chen Wu"}, {"authorId": "51060196", "name": "Chun-Hsien Su"}, {"authorId": "121633602", "name": "M. Islam"}, {"authorId": "115017867", "name": "Mao-Hung Liao"}], "citations": [{"paperId": "bb1a32715237fb0dc5bebe1ff5dd0ced97727d53", "title": "A comprehensive review on detection and classification of dementia using neuroimaging and machine learning"}]}
