{"paperId": "ad260718233acd4881cab6859ab4821cbdd8f84a", "publicationVenue": {"id": "6a1abd85-3eca-4491-ac76-0134749a10fc", "name": "International Workshop on Data Warehousing and OLAP", "type": "conference", "alternate_names": ["Data Warehousing and OLAP", "Int Workshop Data Warehous L", "DOLAP", "Data Warehous L"], "url": "http://www.wikicfp.com/cfp/program?id=748"}, "title": "Graph XAI: Graph-agumented AI with Accuracy, Depth, Explainability, and Velocity", "abstract": "Today's big data and AI frameworks face problems like questionable accuracy, shallow data processing depth, black-box in-explainability, and oftentimes low processing speed. This paper summarizes the work of Ultipa, introducing Graph XAI (Graph-augmented AI) and highlighting ADEV (Accuracy, Depth, Explainability, and Velocity). In contrast to many systems that sample data due to inability to traverse datasets thoroughly and quickly, particularly hindered by hotspot supernodes, Ultipa's graph system is designed from data structure and system architecture perspective to allow for ultra-low latency deep penetration, and accuracy is achieved with exhaustive traversal, which also allows for exponentially faster velocity. As graph data are ideally queried and processed using graph query languages and algorithms instead of the two-dimensional SQL and stored procedures, the intuitiveness and explainability are crucial in ensuring ADEV being fulfilled, this paper highlights how Ultipa's graph-native query language facilitates real-time recursive queries like path-finding, K-hopping, auto-networking, or identification of topological structures and communities works hand-in-hand with Ultipa's WebGL-powered graph manager to ensure end-to-end celerity and explainability.", "venue": "International Workshop on Data Warehousing and OLAP", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"pages": "55-62"}, "authors": [{"authorId": "2293774533", "name": "Ricky Sun"}, {"authorId": "2293726364", "name": "Yuri Simione"}, {"authorId": "2293766241", "name": "Jason Zhang"}, {"authorId": "2293731356", "name": "Victor Wang"}], "citations": []}
