{"paperId": "ad385dbd8721e3a87fffb3bdd04878200e4df917", "publicationVenue": {"id": "a608b572-eb7b-4233-8884-8abf9b59a3fc", "name": "International Journal of Religion", "type": "journal", "alternate_names": ["Int J Relig"], "issn": "2633-352X"}, "title": "The Semiotics of the Title in the Diwan (Qadas Jasad) By the writer: Mona Bint Mohammed", "abstract": "The title is considered an essential element of literary text; it is the first threshold through which the reader enters the text. The title has evolved in literary text to become an independent science itself, and the first way to decipher the text and interpret it. It is considered a sign among the semiotic signs that appear at the beginning of the text, indicating its content as a whole. It is like a key that refers to the world of the text and becomes a reference for it. Given the importance of the title in literary texts, my study is dedicated to discussing the semiotics of the title in the collection \"Qadas Jasad\" by the writer (Mona Bint Mohammed), in an attempt to answer the following questions: - What is the semiotics of the title? To what extent does the semiotic approach apply to the collection \"Qadas Jasad\"? -  What is the referential significance of the semiotics of the title in the collection? -  Has the semiotic approach achieved different literary critical results? Research Objectives: My research study aims to achieve a set of objectives, the most important of which are: - Clarifying the nature of semiotics and the principles of modern semiotic methodology. - Presenting the most important contemporary semiotic trends and their characteristics. -  Conducting a semiotic study of the title in the collection of poems \"Qadas Jasad\" and    explaining the important dimensions included in the titles of the collection. - Explaining the semantic structure of the title by presenting the structural and semantic aspects of the title and revealing the relationship between the titles of the poems and their contents. Research Literature: The idea of the project came to support the connection between literature and society, as specialized studies in Najrani literature are very few, including: -   The poetry movement in Najran during the Jahiliyyah and the early Islamic period, by Faiza Raddad Al-Otaibi, published by Najran Literary Club in 1430 AH (published master's thesis). - Games for boys in ancient Arabic poetry and their connection to games in the Najran region in modern times, Dr. Essam Mohammed Qubaisi, Dr. Zuhair bin Hassan Al-Amri, Journal of the Faculty of Dar Al-Uloom at Al-Fayoum University, 2014. -  Folk proverbs in the Najran region: An objective study, Dr. Zuhair bin Hassan Al-Amri, Journal of the Faculty of Dar Al-Uloom at Cairo University, 2016. - Yazid bin Abdul Madaan Al-Najrani: His political role and literary heritage between two eras, Dr. Awad bin Abdullah bin Nahi, Dr. Essam Mohammed Qubaisi, Journal of Bisha University for Humanities, 2022. Methodology of Research: In my research, I have adopted the semiotic approach; because the title is a semiotic sign that needs to be explored in terms of its dimensions and meanings; through: deconstruction, interpretation, and analysis. Therefore, I have relied on both: the analytical method in analyzing the structural and semantic composition of the title, and the inductive method in extracting the relationship between the content of the poem and the title. Research Plan: I have divided my study into: - The first topic: The nature of semiotic methodology, its direction, and its origin. - The first subtopic: Definition of semiotic methodology in language and terminology. - The second subtopic: Semiotic directions. -    The third subtopic: The emergence of semiotics in contemporary critical studies. - The second topic: The title and its functions. - The first subtopic: Definition of \"title\" in language and terminology. -  The second subtopic: The importance, types, and functions of the title. - The third topic: The semiotics of the title in the Diwan (Qadas Jasad). - The first subtopic: The structural organization of the title in the Diwan (Qadas Jasad). - The second subtopic: The semantic structure of the title in the Diwan (Qadas Jasad). -  Then the conclusion, which includes the most important results. Then the books and   references. -  The first topic: The nature of semiotic methodology, direction, and origin.", "venue": "International Journal of Religion", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-01-24", "journal": {"name": "International Journal of Religion"}, "authors": [{"authorId": "2281165647", "name": "Rasha Abdul Rauf Al-Habishi"}, {"authorId": "2281166098", "name": "Wafa Alayan Elias Al-Shudayfat"}], "citations": []}
