{"paperId": "ad3d7adf084ca9b213f4f830739b605f03062836", "publicationVenue": null, "title": "Correlation Aware Technique for SQL to NoSQL Transformation", "abstract": "For better efficiency of parallel and distributed computing, Apache Hadoop distributes the imported data randomly on data nodes. This mechanism provides some advantages for general data analysis. With the same concept Apache Sqoop separates each table into four parts and randomly distributes them on data nodes. However, there is still a database performance concern with this data placement mechanism. This paper proposes a Correlation Aware method on Sqoop (CA_Sqoop) to improve the data placement. By gathering related data as closer as it could be to reduce the data transformation cost on the network and improve the performance in terms of database usage. The CA_Sqoop also considers the table correlation and size for better data locality and query efficiency. Simulation results show that data locality of CA_Sqoop is two times better than that of original Apache Sqoop.", "venue": "2014 7th International Conference on Ubi-Media Computing and Workshops", "year": 2014, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2014-07-12", "journal": {"name": "2014 7th International Conference on Ubi-Media Computing and Workshops", "pages": "43-46"}, "authors": [{"authorId": "1879750", "name": "Jen-Chun Hsu"}, {"authorId": "145377105", "name": "Ching-Hsien Hsu"}, {"authorId": "50358415", "name": "Shih-Chang Chen"}, {"authorId": "2114033769", "name": "Yeh-Ching Chung"}], "citations": [{"paperId": "ec7355f47d3b2b085bb4b183f8260041a2d98093", "title": "SQL and NoSQL Database Software Architecture Performance Analysis and Assessments - A Systematic Literature Review"}, {"paperId": "76bdc9dd875694307a8b6040e97ab96fa2de9fdc", "title": "Automatic SQL to HQL-NoSQL Querying using PostgreSQL and Integrated Hive-Hbase"}, {"paperId": "a94d9604524e1bb947e4f326a9a7b10eb89ba332", "title": "Translating a Distributed Relational Database to a Document Database"}, {"paperId": "68ca3620b921ea04b0ea35eb10fd89e061c2a2e5", "title": "An Approach for Data Transformation In Homogeneous and Heterogeneous Information Systems"}, {"paperId": "a20e707395132f750fa958ebc0ea629b23b57bfe", "title": "An overview of graph databases and their applications in the biomedical domain"}, {"paperId": "f7d688d1d044bc1b864e5b66aecd80ef1c397759", "title": "A Method for Transforming Object-relational to Document-oriented Databases"}, {"paperId": "7c26ed2aec7d669688047fea5dabd617a9987b24", "title": "Survey of Data Locality in Apache Hadoop"}, {"paperId": "4eaf51ba1ce9fcfa65a82e16ba33526fe2508f4c", "title": "SQL to NoSQL : What to do and How"}, {"paperId": "eacfaac11e07972d0b2aff7f8f50decd8b56818b", "title": "Graph-Based Denormalization for Migrating Big Data from SQL Database to NoSQL Database"}, {"paperId": "5d4368a27f6d46d6584bb804a807f3bc6be05b14", "title": "Key based Deep Data Locality on Hadoop"}, {"paperId": "5f2184e8162255b6aaf9dd78d2fc0cf1f2c1807b", "title": "Designing a Framework for Data Migration of Odoo ERP PostgreSQL Database into NoSQL Database"}, {"paperId": "01592aea2e7ff0b11c33a5717171cf98cd49e796", "title": "An Approach of SQL to JSON Transformation For Handling Database Operations"}, {"paperId": "ad1dfcac3631addb3940a70fc45a42244b21ca6f", "title": "Leveraging Data Analytics by Transforming Relational Database Schema in to Big Data"}, {"paperId": "519dd7ec4432ce9fc70319e4d903ca5c7a950b21", "title": "Script-based Automation ETL Tool"}, {"paperId": "09873c8458a51c99424aa29d493bc6f106304a19", "title": "Relational Database to NoSQL Conversion by Schema Migration and Mapping"}, {"paperId": "a4c7eed69558ba96ea2d0e8cb2810fc359b43175", "title": "SQL-to-NoSQL Schema Denormalization and Migration: A Study on Content Management Systems"}, {"paperId": "9518b99e874d733759e8fc4b6d48493135d2daf6", "title": "Automatic SQL-to-NoSQL schema transformation over the MySQL and HBase databases"}, {"paperId": "8cdb6a229f36decb38b256888e11a8f93b439ba0", "title": "Use of Big Data in Aviation"}, {"paperId": "91c2c74704e5ffedfe2017af9bb7902540e8fab0", "title": "Deep Data Locality on Apache Hadoop"}, {"paperId": "5893a926e1af1b310c9e0c2ab2c362358b094231", "title": "Trends in Computer Science and Information Technology"}]}
