{"paperId": "ad4074e75ea30575c52c75899c27c24f7779573c", "publicationVenue": {"id": "0a05a451-a2de-4e8e-bade-704b9857926a", "name": "Distributed Event-Based Systems", "type": "conference", "alternate_names": ["DEBS", "Distrib Event-based Syst"], "url": "https://en.wikipedia.org/wiki/Distributed_Event-Based_Systems"}, "title": "Probabilistic Management of Late Arrival of Events", "abstract": "In a networked world, events are transmitted from multiple distributed sources into CEP systems, where events are related to one another along multiple dimensions, e.g., temporal and spatial, to create complex events. The big data era brought with it an increase in the scale and frequency of event reporting. Internet of Things adds another layer of complexity with multiple, continuously changing event sources, not all of which are perfectly reliable, often suffering from late arrivals. In this work we propose a probabilistic model to deal with the problem of reduced reliability of event arrival time. We use statistical theories to fit the distributions of inter-generation at the source and network delays per event type. Equipped with these distributions we propose a predictive method for determining whether an event belonging to a window has yet to arrive. Given some user-defined tolerance levels (on quality and timeliness), we propose an algorithm for dynamically determining the amount of time a complex event time-window should remain open. Using a thorough empirical analysis, we compare the proposed algorithm against state-of-the-art mechanisms for delayed arrival of events and show the superiority of our proposed method.", "venue": "Distributed Event-Based Systems", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2018-06-25", "journal": {"name": "Proceedings of the 12th ACM International Conference on Distributed and Event-based Systems"}, "authors": [{"authorId": "1737136", "name": "Nicolo Rivetti"}, {"authorId": "2125879", "name": "Nikos Zacheilas"}, {"authorId": "70189402", "name": "A. Gal"}, {"authorId": "1685532", "name": "V. Kalogeraki"}], "citations": [{"paperId": "dc72dfeceede3ded62af26e922cd091bf5f023bc", "title": "Edge-Based Runtime Verification for the Internet of Things"}, {"paperId": "742ea417cec1dc69e5157e8c1712b8296388c609", "title": "Edge-Based Runtime Verification for the Internet of Things"}, {"paperId": "93399eb3eefca171db3d055e7d4b650a96e6592a", "title": "Klink: Progress-Aware Scheduling for Streaming Data Systems"}, {"paperId": "549231e6daaf49df0c0a1b6a0624ef60d8cb20aa", "title": "Kairos: a self-configuring approach for short and accurate event timeouts in IoT"}, {"paperId": "36161a5b77f58e0f042fb07c219ace5ada35af1f", "title": "Leaving stragglers at the window: low-latency stream sampling with accuracy guarantees"}, {"paperId": "b35981a046153442cd38b2fbb516b91d7b63d95b", "title": "The role of event-time order in data streaming analysis"}, {"paperId": "24b095b3f87d58aec408e5ce18e754c49464fba0", "title": "Simplifying CPS Application Development through Fine-grained, Automatic Timeout Predictions"}, {"paperId": "fde5bc70cbee7b7cffca2448c81aa6238a424971", "title": "Leveraging Watermarks to Improve Performance of Streaming Systems"}, {"paperId": "f7a009555414e4ab2dbf2a0e78957c5c937a4460", "title": "Complex event recognition in the Big Data era: a survey"}, {"paperId": "931fc8eef7daee46644479039d00ed1f7d4259c5", "title": "Khronos: Middleware for Simplified Time Management in CPS"}, {"paperId": "a6a7e3a8290348b967eb4f39fc51351f847989ed", "title": "An Experimental Analysis of Quantile Sketches over Data Streams"}]}
