{"paperId": "ad43250e78f573213a217348c582e740b80720df", "publicationVenue": {"id": "8506a01a-40b8-4e6f-bbb8-ce2492139c15", "name": "International Journal of Molecular Sciences", "type": "journal", "alternate_names": ["Int J Mol Sci"], "issn": "1422-0067", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-157693", "alternate_urls": ["https://www.mdpi.com/journal/ijms", "http://www.mdpi.com/journal/ijms/", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-157693"]}, "title": "Big Data in Gastroenterology Research", "abstract": "Studying individual data types in isolation provides only limited and incomplete answers to complex biological questions and particularly falls short in revealing sufficient mechanistic and kinetic details. In contrast, multi-omics approaches to studying health and disease permit the generation and integration of multiple data types on a much larger scale, offering a comprehensive picture of biological and disease processes. Gastroenterology and hepatobiliary research are particularly well-suited to such analyses, given the unique position of the luminal gastrointestinal (GI) tract at the nexus between the gut (mucosa and luminal contents), brain, immune and endocrine systems, and GI microbiome. The generation of ‘big data’ from multi-omic, multi-site studies can enhance investigations into the connections between these organ systems and organisms and more broadly and accurately appraise the effects of dietary, pharmacological, and other therapeutic interventions. In this review, we describe a variety of useful omics approaches and how they can be integrated to provide a holistic depiction of the human and microbial genetic and proteomic changes underlying physiological and pathophysiological phenomena. We highlight the potential pitfalls and alternatives to help avoid the common errors in study design, execution, and analysis. We focus on the application, integration, and analysis of big data in gastroenterology and hepatobiliary research.", "venue": "International Journal of Molecular Sciences", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2023-01-27", "journal": {"name": "International Journal of Molecular Sciences", "volume": "24"}, "authors": [{"authorId": "120759901", "name": "Madeline Alizadeh"}, {"authorId": "50880105", "name": "Natalia Sampaio Moura"}, {"authorId": "2048181946", "name": "Alyssa Schledwitz"}, {"authorId": "4238464", "name": "Seema A. Patil"}, {"authorId": "144560858", "name": "J. Ravel"}, {"authorId": "49413788", "name": "J. Raufman"}], "citations": [{"paperId": "a9ea3fe0a2571752bcbf020df21dc58209cec6c9", "title": "Gastroenterology Fellowship and Postdoctoral Training in Omics and Statistics—Part I: Why Is It Needed?"}, {"paperId": "0cac13387f3653cd609be75a7b18a82e330d9f2d", "title": "Gastroenterology Fellowship and Postdoctoral Training in Omics and Statistics-Part II: How Can It Be Achieved?"}, {"paperId": "f7dd46ff58892650dfc1189ef38da814969fc993", "title": "GastroNet: A robust attention‐based deep learning and cosine similarity feature selection framework for gastrointestinal disease classification from endoscopic images"}]}
