{"paperId": "ad4a99ec00f79d167818783538258bd7969b59b1", "publicationVenue": {"id": "e7c556b0-162f-4c48-9d25-fe3c141f984e", "name": "Big Data and Cognitive Computing", "alternate_names": ["Big Data Cogn Comput"], "issn": "2504-2289", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-1077183", "alternate_urls": ["https://www.mdpi.com/journal/BDCC", "https://www.mdpi.com/journal/BDCC/about", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-1077183"]}, "title": "The Impact of Big Data Adoption on SMEs' Performance", "abstract": "\n The notion of Industry 4.0 encompasses the adoption of new information technologies that enable an enormous amount of information to be digitally collected, analysed, and exploited in organizations to make better decisions. Therefore, finding how organizations can adopt big data components to improve their performance became a relevant research area. This issue is becoming more pertinent for SMEs. This study investigates the impact of big data adoption on SMEs performance by obtaining the required data from experts. The quantitative investigation followed a mixed approach, including survey data from 224 managers from Iranian SMEs, and a SEM methodology for the data analysis. Results showed that 12 factors affected the BDA in SMEs. BDA can affect both operational performance and economic performance, there has been no support for the influence of BDA and economic performance on social performance. Finally, the study implications and findings are discussed alongside future research avenues and limitations.", "venue": "Big Data and Cognitive Computing", "year": 2020, "fieldsOfStudy": ["Computer Science", "Business"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2020-09-21", "journal": {"name": "Big Data Cogn. Comput.", "pages": "68", "volume": "5"}, "authors": [{"authorId": "79758881", "name": "M. Nasrollahi"}, {"authorId": "10312979", "name": "Javaneh Ramezani"}, {"authorId": "134467695", "name": "Mahmoud Sadraei"}], "citations": [{"paperId": "40048c283e450ec86bfe729c5fbb54b33c9045c2", "title": "Challenges and benefits for small and medium enterprises in the transformation to smart manufacturing: a systematic literature review and framework"}, {"paperId": "0f01767740531de5012bd8cad959247e0026ad2f", "title": "Big data applications in portfolio management: A review of techniques and strategies"}, {"paperId": "d4d2ed0076c45ec8ff69af13e87d2e1f7172bbaa", "title": "Machine Learning Applications and the use of Big Data to Manage the Operation of SMEs"}, {"paperId": "b262c9c5f48c93adf649ffc17d2b9bb0d0f40668", "title": "The Impact of Web Analytics Tools on the Performance of Small and Medium Enterprises"}, {"paperId": "6e993977bd90df7f2ecfd201b3bd5037e63cfba9", "title": "The impact of business intelligence, big data analytics capability, and green knowledge management on sustainability performance"}, {"paperId": "a530f79502487728d97453cf3298faddd47be987", "title": "A Study on Barriers to Data Science in Micro, Small, and Medium Enterprises"}, {"paperId": "f0bf6e08ed18863732d43c98085b3cfa199881c3", "title": "Adoption of Big Data and AI in UAE SMEs in Unpredictable Environment"}, {"paperId": "6d26057f202f3346785eec76e85ecd44d9a67c80", "title": "Factors for the implementation of the circular economy in Big Data environments in service companies in post pandemic times of COVID-19: The case of Colombia"}, {"paperId": "91a6858aa5969fb55eb2a12f6b86556b0acc76d0", "title": "Drivers and impact of big data analytic adoption in the retail industry: A quantitative investigation applying structural equation modeling"}, {"paperId": "97bf84ae70066516f0d09475b53df042dc2d7543", "title": "Antecedents of Big Data Analytic Adoption and Impacts on Performance: Contingent Effect"}, {"paperId": "676d143b70d111c2266d9ef7f6694f97545631ac", "title": "Industry 4.0 and micro and small enterprises: systematic literature review and analysis"}, {"paperId": "cb1c1fdb8464a409f05624d6247cfdf38e47de42", "title": "Factors Influencing the Adoption of Big Data Analytics in the Digital Transformation Era: Case Study of Jordanian SMEs"}, {"paperId": "c09635e3de72974667726ffed16e0c05e7fb84cd", "title": "BIG DATA ADOPTION: DOES IT HAVE A GREAT IMPACT ON CROWDFUNDING SUCCESS IN SMES?"}, {"paperId": "887298f5471bc7bb07ab7516431883882ff62cab", "title": "How to Improve Organizational Performance Using Big Data in the Hotels"}, {"paperId": "9a146fc949b22ac3a10147b80a9bdf5217b105d9", "title": "The role of the social and technical factors in creating business value from big data analytics: A meta-analysis"}]}
