{"paperId": "ad539d5e6e3ef7e6498b28e1937118e1856093d5", "publicationVenue": null, "title": "Batch Query Memory Prediction Using Deep Query Template Representations", "abstract": "Resource demand prediction is vital to many database optimization tasks such as admission control, database monitoring, query scheduling, resource management, and more [1], [2]. Current techniques are based on statistical models for each operator in the current processing query’s plan. Resource demands focus on estimating the demand of a single query in isolation, which often fails to capture the net resource demand of a batch of queries, denoted as a workload. Estimating the net resource demand of a collection of queries is a challenging task due to the difficulty of capturing the correlation between different queries [3]. We introduce the novel problem of workload memory prediction and formalize it as a distribution regression problem. A methodology for estimating the collective resource demand of a batch of queries, we call it LearnedWMP. Specifically, we focus on predicting the memory cost demand of a batch of queries. LearnedWMP makes use of existing components of the optimizer engine, such as the query plan. We group queries with similar query plan characteristics into a set of learned query templates. Ideally, these templates are pre-built such that each template represents a group of queries with similar resource demands. Thereafter, the system generates a histogram representation of the query templates in the workload. Lastly, a regressor uses the histogram representation of the workload to predict the resource demand(e.g., Memory cost) of the workload. In our experimental settings, we use three database benchmarks to demonstrate a 47.6% improvement of the memory estimation in comparison to the existing state-of-the-art. We also compare our approach to different machine and deep learning techniques, which learn the resource demand of individual queries.", "venue": "", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "2254599935", "name": "Nicolas Andres"}, {"authorId": "2254437034", "name": "Jaramillo Duran"}], "citations": []}
