{"paperId": "ad67e66f0c87d654c5e395717b966eedddf99d5e", "publicationVenue": null, "title": "Regression test selection for TizenRT", "abstract": "Regression testing - running tests after code modifications - is widely practiced in industry, including at Samsung. Regression Test Selection (RTS) optimizes regression testing by skipping tests that are not affected by recent code changes. Recent work has developed robust RTS tools, which mostly target managed languages, e.g., Java and C#, and thus are not applicable to large C projects, e.g., TizenRT, a lightweight RTOS-based platform. We present Selfection, an RTS tool for projects written in C; we discuss the key challenges to develop Selfection and our design decisions. Selfection uses the objdump and readelf tools to statically build a dependency graph of functions from binaries and detect modified code elements. We integrated Selfection in TizenRT and evaluated its benefits if tests are run in an emulator and on a supported hardware platform (ARTIK 053). We used the latest 150 revisions of TizenRT available on GitHub. We measured the benefits of Selfection as the reduction in the number of tests and reduction in test execution time over running all tests at each revision (i.e., RetestAll). Our results show that Selfection can reduce, on average, the number of tests to 4.95% and end-to-end execution time to 7.04% when tests are executed in the emulator, and to 5.74% and 26.82% when tests are executed on the actual hardware. Our results also show that the time taken to maintain the dependency graph and detect modified functions is negligible.", "venue": "ESEC/SIGSOFT FSE", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2018-10-26", "journal": {"name": "Proceedings of the 2018 26th ACM Joint Meeting on European Software Engineering Conference and Symposium on the Foundations of Software Engineering"}, "authors": [{"authorId": "145118978", "name": "Ahmet Çelik"}, {"authorId": "2109279037", "name": "Young-Chul Lee"}, {"authorId": "2020926", "name": "Miloš Gligorić"}], "citations": [{"paperId": "00cf787add0f7b31f5ddf41d8d9ece1eb4af46ca", "title": "More Precise Regression Test Selection via Reasoning about Semantics-Modifying Changes"}, {"paperId": "85b2d3db4f0c3f8b2d9097f7fd6eb6f2c3172f6c", "title": "An information retrieval-based regression test selection technique"}, {"paperId": "47789ae4698b57aa0d7c7a9406d56fc198cbcf4b", "title": "State of Practical Applicability of Regression Testing Research: A Live Systematic Literature Review"}, {"paperId": "b821a3defc52bafd2cb439e3696e12ca498d1029", "title": "An empirical comparison of four Java-based regression test selection techniques"}, {"paperId": "ddfaee63686d997938eb16938be2448cbd17e539", "title": "Mahtab: Phase-wise acceleration of regression testing for C"}, {"paperId": "68eb91188d4b34073224b5aadf214396fd2cfba5", "title": "Reflection-aware static regression test selection"}, {"paperId": "5f78eb9b389a591bc415cc43bd8202fec11ac30a", "title": "QADroid: regression event selection for Android applications"}]}
