{"paperId": "ad69c0c1596a80b58c1856446c0aabba2cac3918", "publicationVenue": {"id": "229ff272-1128-48a4-94eb-2ea4041eadff", "name": "International Conference on Cloud Computing and Services Science", "type": "conference", "alternate_names": ["CLOSER", "Int Conf Cloud Comput Serv Sci"], "url": "http://closer.scitevents.org/"}, "title": "A Platform for Interactive Data Science with Apache Spark for On-premises Infrastructure", "abstract": ": Various cloud providers offer integrated platforms for interactive development in notebooks for processing and analysis of Big Data on large compute clusters. Such platforms enable users to easily leverage frameworks like Apache Spark as well as to manage cluster resources. However, Data Scientists and Engineers are facing the lack of a similar holistic solution when working with on-premises infrastructure. Especially a central point of administration to access a notebooks’ UI, manage notebook kernels, allocate resources for frameworks like Apache Spark or monitor cluster workloads, in general, is currently missing for on-premises infrastructure. To overcome these issues and provide on-premises users with a platform for interactive development, we propose a cross-cluster architecture resulting from an extensive requirements engineering process. Based on open-source components, the designed platform provides an intuitive Web-UI that enables users to easily access notebooks, manage custom kernel-environments as well as monitor cluster resources and current workloads. Besides an admin panel for user restrictions, the platform provides isolation of user workloads and scalability by design. The designed platform is evaluated against prior solutions for on-premises as well as from a user perspective by utilizing the User Experience Questionnaire, an independent benchmark tool for interactive products.", "venue": "International Conference on Cloud Computing and Services Science", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"pages": "65-76"}, "authors": [{"authorId": "2106335591", "name": "Rafal Lokuciejewski"}, {"authorId": "2106335596", "name": "Dominik Schüssele"}, {"authorId": "1491360477", "name": "Florian Wilhelm"}, {"authorId": "145267753", "name": "Sven Groppe"}], "citations": []}
