{"paperId": "ad7089762a3226b057ae8ac4d2ece5b1e3aeca0b", "publicationVenue": {"id": "911e7332-8ea8-4e9d-bc20-5572a2523f92", "name": "International Middleware Conference", "type": "conference", "alternate_names": ["Middleware", "ACM/IFIP/USENIX int conf Middlew", "ACM/IFIP/USENIX international conference on Middleware", "Int Middlew Conf"], "url": "https://dl.acm.org/conference/middleware/proceedings"}, "title": "Magic-Pipe: self-optimizing video analytics pipelines", "abstract": "Microservices-based video analytics pipelines routinely use multiple deep convolutional neural networks. We observe that the best allocation of resources to deep learning engines (or microservices) in a pipeline, and the best configuration of parameters for each engine vary over time, often at a timescale of minutes or even seconds based on the dynamic content in the video. We leverage these observations to develop Magic-Pipe, a self-optimizing video analytic pipeline that leverages AI techniques to periodically self-optimize. First, we propose a new, adaptive resource allocation technique to dynamically balance the resource usage of different microservices, based on dynamic video content. Then, we propose an adaptive microservice parameter tuning technique to balance the accuracy and performance of a microservice, also based on video content. Finally, we propose two different approaches to reduce unnecessary computations due to unavoidable mismatch of independently designed, re-usable deep-learning engines: a deep learning approach to improve the feature extractor performance by filtering inputs for which no features can be extracted, and a low-overhead graph-theoretic approach to minimize redundant computations across frames. Our evaluation of Magic-Pipe shows that pipelines augmented with self-optimizing capability exhibit application response times that are an order of magnitude better than the original pipelines, while using the same hardware resources, and achieving similar high accuracy.", "venue": "International Middleware Conference", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2021-11-22", "journal": {"name": "Proceedings of the 22nd International Middleware Conference"}, "authors": [{"authorId": "3067277", "name": "G. Coviello"}, {"authorId": "2143687934", "name": "Yi Yang"}, {"authorId": "38170711", "name": "Kunal Rao"}, {"authorId": "1752242", "name": "S. Chakradhar"}], "citations": [{"paperId": "5f866afc767faf3d44d7d58f68874267f0f4f55e", "title": "AI Techniques in the Microservices Life-Cycle: A Survey"}, {"paperId": "261b90f6515035517956454441f52e58213c6142", "title": "DataX Allocator: Dynamic resource management for stream analytics at the Edge"}, {"paperId": "1b454103614b5a4147c1157e6748fd54cfc88526", "title": "AMESoS: a scalable and elastic framework for latency sensitive streaming pipelines"}]}
