{"paperId": "ad77742bb199f9c84f105b76c36a5e442e3413fc", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Toward Intent-Based Network Automation for Smart Environments: A Healthcare 4.0 Use Case", "abstract": "Today’s organizations have been embracing digital transformation to boost the quality of living within IoT-based smart-sustainable environments (e.g., healthcare, factories, vehicles, etc.). At the same time, augmenting the network infrastructure surface with billions of new devices accommodating myriad applications creates the need for network automation through different technologies, such as Software-Defined Networking (SDN), Network Function Virtualization (NFV), and Big Data Analytics (BDA). However, to devise an end-to-end self-driving and autonomous network, the manual configuration of network parameters and devices should be limited or even vanished. The recently emerged Intent-based Networking (IBN) paradigm introduces an additional building block enabling the network to adapt its settings automatically according to high-level user demands (intents) while hiding low-level details of the underlying infrastructure (e.g., configurations in millions of network devices). This paper initiates a deeper discussion regarding service automation over a Hospital 4.0 environment, from translating user requests to service profiling (unstructured intent refinement), deployment, and assurance. First, we discuss the design challenges of joining an intent-based framework as a convenient plane to an SDN-based platform. Following, we focus on an intelligent intent refinement system based on the Named Entity Recognition (NER) approach, an application of Natural Language Processing (NLP). This IBN-NER system deploys an extensible network policy model and the pre-trained Google’s BERT (Bidirectional Encoder Representations from Transformers) algorithm, fine-tuned with a Healthcare 4.0 dataset. The proposed intent refinement framework is evaluated via extensive simulations with an incremental number of heterogeneous intents. Our simulation results show promising performance with only one epoch for all dataset sizes and all policy model entities tested. For example, with 5000 intents, our system provides the highest accuracy with 86%; meanwhile, the well-known benchmarks in the NER problem, namely BiLSTM-CRF, BiLSTM, and LSTM, with ten epochs, provide 57%, 31%, and 26%, respectively.", "venue": "IEEE Access", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "136565-136576", "volume": "11"}, "authors": [{"authorId": "1809299848", "name": "Yosra Njah"}, {"authorId": "2386836", "name": "Aris Leivadeas"}, {"authorId": "2573061", "name": "John Violos"}, {"authorId": "144842210", "name": "M. Falkner"}], "citations": [{"paperId": "003fb9cba623bb285dde47732a73d39f0628a68d", "title": "Towards Intent-Based Network Management: Large Language Models for Intent Extraction in 5G Core Networks"}]}
