{"paperId": "ad79c0797bd42d5be4aeb71952559be8bbd5edef", "publicationVenue": {"id": "83b61ff8-462d-4e1d-b43b-5d96fcc87766", "name": "IEEE Transactions on Network Science and Engineering", "type": "journal", "alternate_names": ["IEEE Trans Netw Sci Eng"], "issn": "2327-4697", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=6488902"}, "title": "An Effective Early Message Ahead Join Adaptive Data Aggregation Scheme for Sustainable IoT", "abstract": "The rapid development of Internet of Things (IoT) can promote the establishment of the smart connected world by using numerous devices and sensors. Collecting the data perceived by sensing devices in a fast and energy-saving style is critical for building a stable network in IoT. In this paper, we propose an Early Message Ahead Join Adaptive Data Aggregation (E-ADA) scheme for IoT. Firstly, an advance notification mechanism based on early message is introduced to improve the probability of data aggregation, thus optimizing energy consumption and network lifetime. In this mechanism, the routing of early message is faster than that of the data packet. Nodes with data packet send an early message forward to notice, and other data packets which monitor the early message can wait for that to aggregate under the delay deadline constraints. Secondly, we propose a Delay-optimized Convergence Routing based E-ADA (DOCR-E-ADA) data collection scheme which combines advance notification mechanism and convergence routings. The duty cycle of nodes in convergence routing is adaptively adjusted, which greatly reduces transmission latency. Finally, extensive experimental results demonstrate that our DOCR-E-ADA outperforms the existing schemes in terms of network delay and lifetime.", "venue": "IEEE Transactions on Network Science and Engineering", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-01-01", "journal": {"name": "IEEE Transactions on Network Science and Engineering", "pages": "201-219", "volume": "8"}, "authors": [{"authorId": "2076164763", "name": "Ouyang Yan"}, {"authorId": "34389367", "name": "Anfeng Liu"}, {"authorId": "145826495", "name": "N. Xiong"}, {"authorId": "50819719", "name": "Tian Wang"}], "citations": [{"paperId": "982330e899a8cf1b839c78c83691d468b521fd36", "title": "AQND: An asymmetric quorum-based neighbor discovery protocol for reducing delay in sensor based systems"}, {"paperId": "f339f23ad5a36a9c0e9ce011e7e78ae690203cd1", "title": "DDSR: A delay differentiated services routing scheme to reduce deployment costs for the Internet of Things"}, {"paperId": "86377608eea4592cea585e15c92044e1b43e18a5", "title": "A novel chain‐based clustering for green communication in wireless sensor network"}, {"paperId": "a606f9fd89ccacaabe116de9d4ee8f64a824aa55", "title": "CluRMA: A cluster-based RSU-enabled message aggregation scheme for vehicular ad hoc networks"}, {"paperId": "df0bc2b2e680f76c6f868530a0c7e56089eb61ea", "title": "BTS: A Blockchain-Based Trust System to Deter Malicious Data Reporting in Intelligent Internet of Things"}, {"paperId": "af4d2c9d073f0e219ffe6c19bc020cf9191fdc0b", "title": "UWPEE: Using UAV and wavelet packet energy entropy to predict traffic-based attacks under limited communication, computing and caching for 6G wireless systems"}, {"paperId": "6aa738e984e1282c7e33fe6a7f755b200599f383", "title": "SCTD: A spatiotemporal correlation truth discovery scheme for security management of data platform"}, {"paperId": "fb95b711721307e98bbeef1032136f2e541730a0", "title": "Trust secure data aggregation in WSN-based IIoT with single mobile sink"}, {"paperId": "6450b2e8548b9440b145b08a8a7558294b2cedb4", "title": "A privacy-protected intelligent crowdsourcing application of IoT based on the reinforcement learning"}, {"paperId": "f7245b408716bf5ddbec687b3a3cc8801263fc35", "title": "A secure data collection strategy using mobile vehicles joint UAVs in smart city"}, {"paperId": "4d2239c4e449a1154538a12ff6fbfa676ec7c155", "title": "A lightweight verifiable trust based data collection approach for sensor-cloud systems"}, {"paperId": "473f444995fabe8a6e52b73b1e0327de08649667", "title": "STMTO: A smart and trust multi-UAV task offloading system"}, {"paperId": "095345812da12b2c414c0ef8505a8a9207eb3583", "title": "A parallel joint optimized relay selection protocol for wake-up radio enabled WSNs"}, {"paperId": "89949a84c317cc114230ff4e3d5df2dd744f834b", "title": "Deep reinforcement learning for computation offloading in mobile edge computing environment"}, {"paperId": "ef7a0afaca395fe601b7173324ca61d0b7871957", "title": "An Integral Data Gathering Framework for Supervisory Control and Data Acquisition Systems in Green IoT"}, {"paperId": "5998f8482b63a42235b24ffffc19c6ff3f4bc2fa", "title": "ATTDC: An Active and Traceable Trust Data Collection Scheme for Industrial Security in Smart Cities"}, {"paperId": "8f7e9af2e5ad33af05f7be357750b07eb311b98e", "title": "Trust based task offloading scheme in UAV-enhanced edge computing network"}, {"paperId": "2751aeb1032b2d3776759c001e9fb1b5e3ec77e6", "title": "(1 + ϵ)2-and Polynomial-Time Approximation Algorithms for Network Lifetime Maximization With Relay Hop Bounded Connected Target Coverage in WSNs"}, {"paperId": "8647a86abcc15da89001fe0fe6edbac6f2bff188", "title": "Parameter analysis and optimization of polling-based medium access control protocol for multi-sensor communication"}, {"paperId": "fa21c5925145c379dd0f339cdcaeb3e761f66683", "title": "Early Wake-Up Ahead Node for Fast Code Dissemination in Wireless Sensor Networks"}, {"paperId": "6a8a9f145aef34a599b622dbdc40d7511021666f", "title": "An Intelligent Collaboration Trust Interconnections System for Mobile Information Control in Ubiquitous 5G Networks"}, {"paperId": "4a306fcd6564691bbee7ecfd8a4ae58aecd5b665", "title": "Community Clustering Routing Algorithm Based on Information Entropy in Mobile Opportunity Network"}, {"paperId": "88c3432d290439ab1c36061ea7ab86a907e5647b", "title": "Adaptive Contention Window MAC Protocol in a Global View for Emerging Trends Networks"}, {"paperId": "17cbe929ac9b0a8a11e351ba85ee45307b893b94", "title": "An Efficient Data Aggregation Scheme Based on Differentiated Threshold Configuring Joint Optimal Relay Selection in WSNs"}, {"paperId": "9eed897f01a3d659b75b561c6d179a41dc918c38", "title": "Fast Multicast With Adjusting Transmission Power and Active Slots in Software Define IoT"}, {"paperId": "b8021db4fa843cb28c2610b8fc5ea67ff2b3da4e", "title": "An Incentive Mechanism Based on Bertrand Game for Opportunistic Edge Computing"}]}
