{"paperId": "ad847e6792897a57a2d23ccfa57cd808ce992f23", "publicationVenue": {"id": "764e3630-ddac-4c21-af4b-9d32ffef082e", "name": "IEEE International Conference on Data Engineering", "type": "conference", "alternate_names": ["ICDE", "Int Conf Data Eng", "IEEE Int Conf Data Eng", "International Conference on Data Engineering"], "url": "http://www.wikicfp.com/cfp/program?id=1331"}, "title": "Trillion-scale Graph Processing Simulation based on Top-Down Graph Upscaling", "abstract": "As the number of graph applications increases rapidly in many domains, new graph algorithms (or queries) have become more important than ever before. The current two-step approach to develop and test a graph algorithm is very expensive for trillion-scale graphs required in many industrial applications. In this paper, we propose a concept of graph processing simulation, a single-step approach that generates a graph and processes a graph algorithm simultaneously. It consists of a top-down graph upscaling method called V-Upscaler and a graph processing simulation method following the vertex-centric GAS model called T-GPS. Users can develop a graph algorithm and check its correctness and performance conveniently and cost-efficiently even for trillion-scale graphs. Through extensive experiments, we have demonstrated that our single-step approach of V-Upscaler and T-GPS significantly outperforms the conventional two-step approach, although ours uses only a single machine, while the conventional one uses a cluster of eleven machines.", "venue": "IEEE International Conference on Data Engineering", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-04-01", "journal": {"name": "2021 IEEE 37th International Conference on Data Engineering (ICDE)", "pages": "1512-1523"}, "authors": [{"authorId": "2021341", "name": "Himchan Park"}, {"authorId": "46590281", "name": "Jinjun Xiong"}, {"authorId": "2116504190", "name": "Min-Soo Kim"}], "citations": [{"paperId": "6b0e97a8a7c21b620f8bca7b8a2579b9b6800a1a", "title": "Simple and efficient four-cycle counting on sparse graphs"}]}
