{"paperId": "ad8aea7e9225f353a9d3f1ad6b22214e7e8cbee0", "publicationVenue": {"id": "8c7fd839-36e4-4261-a5c2-846c243dbbb5", "name": "International Conference on Pattern Analysis and Intelligent Systems", "type": "conference", "alternate_names": ["PAIS", "Int Conf Pattern Anal Intell Syst"]}, "title": "Heuristic approaches for hiding sensitive frequent itemsets in uncertain databases", "abstract": "Pattern mining is a core objective within data mining, involving the detection of frequent itemsets (collections of values) within databases. This process serves to extract valuable insights from the data, facilitating informed decision-making. In recent times, a range of algorithms has emerged to adapt this task to the realm of uncertain data.This has a wide range of applications, such as analyzing medical data to identify correlated symptoms based on their existential probabilities. However, pattern mining algorithms also pose the risk of revealing sensitive information. As far as we know, there is no existing solution that addresses the inadvertent disclosure of sensitive itemsets when pattern mining algorithms are employed on uncertain databases. This paper addresses this problem by proposing three heuristic approaches, which ensure that sensitive expected frequent itemsets are not discovered while minimizing undesirable side effects for other itemsets. The first heuristic approach (called aggregate) deletes some transactions from an uncertain database. The second approach (named disaggregate) removes some selected items from each transaction. And the third approach (called the hybrid approach) combines the two previous approaches, and deletes some selected items from some selected transactions. An experimental evaluation is presented to assess and compare the effectiveness of the three approaches.", "venue": "International Conference on Pattern Analysis and Intelligent Systems", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-10-25", "journal": {"name": "2023 5th International Conference on Pattern Analysis and Intelligent Systems (PAIS)", "pages": "1-8"}, "authors": [{"authorId": "1478404058", "name": "Mira Lefkir"}, {"authorId": "2267754140", "name": "Farid Nouioua"}, {"authorId": "2273328878", "name": "Philippe Fournier-Viger"}], "citations": []}
