{"paperId": "adac4cf40e2253cf8fe4fa75f7ea840c236013ec", "publicationVenue": {"id": "a00fde74-d8df-4613-b825-0fff9f531d3f", "name": "IEEE Transactions on Network and Service Management", "type": "journal", "alternate_names": ["IEEE Trans Netw Serv Manag"], "issn": "1932-4537", "url": "http://ejournals.ebsco.com/direct.asp?JournalID=714200", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4275028", "http://ieeexplore.ieee.org/servlet/opac?punumber=4275028"]}, "title": "Look-Ahead VNF-FG Embedding Framework for Latency-Sensitive Network Services", "abstract": "Dynamic and zero-touch management is expected to be the key feature of next-generation 6G networks. Network Function Virtualization (NFV) is one of the key technologies for realizing such management through software-based networks. Despite great benefits offered by NFV, deploying network services (NSs) in NFV ecosystems remains a challenge, especially for latency-sensitive NSs, as they demand stringent latency requirements and fast service provisioning. Specifically, service graphs should be embedded into an infrastructure such that these requirements are satisfied while optimizing network operator’s objectives. To cope with the scalability of optimization-based approaches, heuristic methods are known as promising alternatives to find a satisfactory solution within an acceptable execution time. However, existing VNF embedding heuristics still suffer from the so-called causality issue, which may degrade the embedding solution quality. The causality issue means that embedding decisions cannot be optimally determined before all neighboring dependencies are known. To this end, we introduce our ${h}$ -horizon sequential look-ahead greedy embedding framework, which provides efficient embedding and re-embedding strategies to alleviate the impact of the causality issue. The simulation results indicate that our proposed algorithm significantly improves embedding cost, compared to the existing heuristic algorithms while being much more scalable than an optimization-based approach.", "venue": "IEEE Transactions on Network and Service Management", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-01", "journal": {"name": "IEEE Transactions on Network and Service Management", "pages": "2682-2697", "volume": "20"}, "authors": [{"authorId": "51058920", "name": "Ákos Recse"}, {"authorId": "10379353", "name": "Nattakorn Promwongsa"}, {"authorId": "2770683", "name": "Amin Ebrahimzadeh"}, {"authorId": "134691496", "name": "Seyedeh Negar Afrasiabi"}, {"authorId": "2673320", "name": "Carla Mouradian"}, {"authorId": "2141385464", "name": "Wubin Li"}, {"authorId": "144571712", "name": "R. Szabó"}, {"authorId": "9315446", "name": "R. Glitho"}], "citations": [{"paperId": "a3b7b47c45138284498c26759fa642cba91468a6", "title": "Cost-Efficient Cluster Migration of VNFs for Service Function Chain Embedding"}, {"paperId": "856f9d00b35f6c997912162a68eb99779f962e5f", "title": "Joint VNF Decomposition and Migration for Cost-Efficient VNF Forwarding Graph Embedding"}, {"paperId": "0a5997f1ffcc708dc9d455160d6ad60d0df52a60", "title": "Cost-Aware Topological Decomposition of Virtual Network Function Forwarding Graphs"}, {"paperId": "5973a5144d6c9f25f064e0a1f0507df907f64daa", "title": "Forecast-Assisted Service Function Chain Dynamic Deployment for SDN/NFV-Enabled Cloud Management Systems"}]}
