{"paperId": "adb02469757a671ef9032b5bb9a5ea8c2eddeefa", "publicationVenue": {"id": "aa2288b7-f151-4e26-93a7-512c123c6754", "name": "Global Knowledge Memory and Communication", "alternate_names": ["Glob Knowl Mem Commun"], "issn": "2514-9342", "url": "http://www.emeraldgrouppublishing.com/products/journals/journals.htm?id=gkmc"}, "title": "The level of digital competencies for the provision of smart information service at academic libraries in Jordan", "abstract": "\nPurpose\nTechnological advancement has forced academic libraries to change their traditional services and routines by adopting emerging technologies to respond to the changing information needs of their users who are now more technologically inclined and prefer to access information remotely and in a timely manner. Smart technologies are the recent trends in academic libraries. This research aims to investigate the level of smart information service implementation at academic libraries in Jordan. It also aimed to investigate the correlation between the level of smart information services offered by the libraries and the level of digital competencies among the library staff.\n\n\nDesign/methodology/approach\nThis research is designed using survey design to collect comprehensive information from the study participants. A questionnaire was disseminated to 340 respondents, and 246 questionnaires were returned and were suitable for analysis with a response rate of 72.4%.\n\n\nFindings\nThe results indicated a moderate level of smart information service offered by academic libraries, as well as a moderate level of digital skills associated with the advocacy of smart information services. The results also indicated a strong and positive relationship between the level of smart information services at the investigated libraries and the level of digital competencies among the librarians.\n\n\nPractical implications\nThe findings will help other academic libraries understand how to respond to the emergent change in users’ information-seeking behavior by understanding their available human resources competencies and the requirement to undergo this emergent change.\n\n\nOriginality/value\nThis paper provides insights and practical solutions for academic libraries in response to global information trends based on users’ behaviors. This research was conducted in Jordan as one of the developing countries and hence it provides insights of the situation there. It will help academic libraries in Jordan and the region to handle and cope with the challenges associated with technology acceptance based on its staff level of digital competencies. The contribution of this research that it was done in a developing country where progress in the filed can be considered slow because of many factors, mainly economics, where institutions focus on essential library objectives, which are information resources development and databases subscriptions.\n", "venue": "Global Knowledge Memory and Communication", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2023-02-28", "journal": {"name": "Global Knowledge, Memory and Communication"}, "authors": [{"authorId": "29766721", "name": "Faten Hamad"}, {"authorId": "120565688", "name": "Maha Al-Fadel"}, {"authorId": "144491523", "name": "A. Shehata"}], "citations": [{"paperId": "d6a6c7b2fe4e1c2b7ef354fe096cf6883804c265", "title": "Artificial Intelligence Services at Academic Libraries in Tanzania: Awareness, Adoption and Prospects"}, {"paperId": "92230c3be08db9920e87001ba73193810bf16744", "title": "A Proposed Computer Vision-Based System for Managing the Self-borrowing and Returning Process in Libraries"}, {"paperId": "09eaf7260490a836451586c280a34fbdcad9e28a", "title": "Impact of digital capabilities of countries on the pedagogical transitions in business schools"}, {"paperId": "3b657ac8fe1ecc9c0d549524bcbc204c0bc0c069", "title": "Revolutionizing library access: exploring the potential of virtual positioning systems"}, {"paperId": "582704ccf75a0c4b4a58b56b13850f81cb73ed3b", "title": "FAVORITE BOOK PREDICTION SYSTEM USING MACHINE LEARNING ALGORITHMS"}]}
