{"paperId": "adbafeceb0121e58be90c99009f9d14da78ac857", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "New Feature Selection Algorithm Based on Feature Stability and Correlation", "abstract": "The analysis of a large amount of data with high dimensionality of rows and columns increases the load of machine learning algorithms. Such data are likely to have noise and consequently, obstruct the performance of machine learning algorithms. Feature selection (FS) is one of the most essential machine learning techniques that can solve the above-mentioned problem. It tries to identify and eliminate irrelevant information as much as possible and only maintain a minimum subset of appropriate features. It plays an important role in improving the accuracy of machine-learning algorithms. It also reduces computational complexity, run time, storage, and cost. In this paper, a new feature selection algorithm based on feature stability and correlation is proposed to select the effective minimum subset of appropriate features. The efficiency of the proposed algorithm was evaluated by comparing it with other state-of-the-art dimensionality reduction (DR) algorithms using benchmark datasets. The evaluation criteria included the size of the minimum subset, the classification accuracy, the F-measure, and the area under curve (AUC). The results showed that the proposed algorithm is the pioneer in reducing a given dataset with high predictive accuracy.", "venue": "IEEE Access", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "4699-4713", "volume": "10"}, "authors": [{"authorId": "1405561629", "name": "L. Al-Shalabi"}], "citations": [{"paperId": "410600aa74c2f85fa315aa0f03fdc15174747f4c", "title": "Genetic Algorithm based Feature Selection to Enhance Breast Cancer Classification"}, {"paperId": "071c881a7dea19f495957bf3f3e8ddee126f03b6", "title": "Robust classification and biomarker discovery of inherited metabolic diseases using GC-MS urinary metabolomics analysis combined with chemometrics"}, {"paperId": "816954033a2bf432deab0374c3656414592e9542", "title": "Evaluation of COVID-19 Vaccine Refusal among AOU Students in Kuwait and their Families and their Expected Inclination Towards the Acceptance or Refusal of the Vaccine"}, {"paperId": "e0ad362b07a582010d369e82db270a999be361bf", "title": "Feature selection techniques for microarray datasets: a comprehensive review, taxonomy, and future directions"}, {"paperId": "b3ad93062574fed7c21d936467096173f94c5fa4", "title": "Hybrid feature selection based ScC and forward selection methods"}, {"paperId": "81609a3950d0d6936f8ffe55bf211d4073456ca7", "title": "Enhancing Prostate Cancer Classification by Leveraging Key Radiomics Features and Using the Fine-Tuned Linear SVM Algorithm"}]}
