{"paperId": "adbb5d0a264772b32c8aaed9a1bf178afd7a3ec5", "publicationVenue": {"id": "deedf64a-dd5c-4b33-b345-ff83bfb93d71", "name": "International Symposium on Computer Architecture", "type": "conference", "alternate_names": ["Int Symp Comput Archit", "ISCA"], "url": "http://www.cs.wisc.edu/~arch/www/"}, "title": "NDMiner: accelerating graph pattern mining using near data processing", "abstract": "Graph Pattern Mining (GPM) algorithms mine structural patterns in graphs. The performance of GPM workloads is bottlenecked by control flow and memory stalls. This is because of data-dependent branches used in set intersection and difference operations that dominate the execution time. This paper first conducts a systematic GPM workload analysis and uncovers four new observations to inform the optimization effort. First, GPM workloads mostly fetch inputs of costly set operations from different memory banks. Second, to avoid redundant computation, modern GPM workloads employ symmetry breaking that discards several data reads, resulting in cache pollution and wasted DRAM bandwidth. Third, sparse pattern mining algorithms perform redundant memory reads and computations. Fourth, GPM workloads do not fully utilize the in-DRAM data parallelism. Based on these observations, this paper presents NDMiner, a Near Data Processing (NDP) architecture that improves the performance of GPM workloads. To reduce in-memory data transfer of fetching data from different memory banks, NDMiner integrates compute units to offload set operations in the buffer chip of DRAM. To alleviate the wasted memory bandwidth caused by symmetry breaking, NDMiner integrates a load elision unit in hardware that detects the satisfiability of symmetry breaking constraints and terminates unnecessary loads. To optimize the performance of sparse pattern mining, NDMiner employs compiler optimizations and maps reduced reads and composite computation to NDP hardware that improves algorithmic efficiency of sparse GPM. Finally, NDMiner proposes a new graph remapping scheme in memory and a hardware-based set operation reordering technique to best optimize bank, rank, and channel-level parallelism in DRAM. To orchestrate NDP computation, this paper presents design modifications at the host ISA, compiler, and memory controller. We compare the performance of NDMiner with state-of-the-art software and hardware baselines using a mix of dense and sparse GPM algorithms. Our evaluation shows that NDMiner significantly outperforms software and hardware baselines by 6.4X and 2.5X, on average, while incurring a negligible area overhead on CPU and DRAM.", "venue": "International Symposium on Computer Architecture", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2022-06-11", "journal": {"name": "Proceedings of the 49th Annual International Symposium on Computer Architecture"}, "authors": [{"authorId": "3120006", "name": "Nishil Talati"}, {"authorId": "2108652152", "name": "Yichen Yang"}, {"authorId": "113812913", "name": "Leul Wuletaw Belayneh"}, {"authorId": "1793651", "name": "R. Dreslinski"}], "citations": [{"paperId": "2318bdeea310b1ea524fa483f9276c4f3ef6c88f", "title": "GraphSet: High Performance Graph Mining through Equivalent Set Transformations"}, {"paperId": "966fa2d81dcf019d23c08f6e2309dfc53fb43496", "title": "A Tensor Marshaling Unit for Sparse Tensor Algebra on General-Purpose Processors"}, {"paperId": "478247d1e7526ce6fa94dbc710d49a01a6327c7a", "title": "Exploiting the Potential of Flexible Processing Units"}, {"paperId": "15d999fbb9779e1e0d791dbd22e08fadcd72b733", "title": "PSMiner: A Pattern-Aware Accelerator for High-Performance Streaming Graph Pattern Mining"}, {"paperId": "cb0d72d300e2042050f31877642caed84d54f3f8", "title": "PIMMiner: A High-performance PIM Architecture-aware Graph Mining Framework"}, {"paperId": "1bb10600aa2ebc639a878fde3b0c75471abd0da5", "title": "Shogun: A Task Scheduling Framework for Graph Mining Accelerators"}, {"paperId": "c3040e07190f43b51b992213fc04436d7e5da12f", "title": "ABNDP: Co-optimizing Data Access and Load Balance in Near-Data Processing"}, {"paperId": "249438ec45356dc02a324aa816bc69b1f80367e9", "title": "DIMM-Link: Enabling Efficient Inter-DIMM Communication for Near-Memory Processing"}, {"paperId": "17f3d9b84c21cfc313d5c11f9efba37605cade94", "title": "Software Systems Implementation and Domain-Specific Architectures towards Graph Analytics"}, {"paperId": "afa3dd52f1ac721d41e658be28ad8e45b1792023", "title": "Mint: An Accelerator For Mining Temporal Motifs"}, {"paperId": "6550a0af3586ba50f61c4b5f930924cc9318918b", "title": "Arya: Arbitrary Graph Pattern Mining with Decomposition-based Sampling"}]}
