{"paperId": "adc1fb147394d8df689f748bb06142ad6907f091", "publicationVenue": {"id": "7b2adce0-d53f-49d6-8784-b0645604fe62", "name": "ACM Computing Surveys", "type": "journal", "alternate_names": ["ACM Comput Surv"], "issn": "0360-0300", "url": "http://www.acm.org/pubs/surveys/", "alternate_urls": ["http://portal.acm.org/csur", "https://csur.acm.org/", "http://csur.acm.org/"]}, "title": "Conceptual Modeling: Topics, Themes, and Technology Trends", "abstract": "Conceptual modeling is an important part of information systems development and use that involves identifying and representing relevant aspects of reality. Although the past decades have experienced continuous digitalization of services and products that impact business and society, conceptual modeling efforts are still required to support new technologies as they emerge. This paper surveys research on conceptual modeling over the past five decades and shows how its topics and trends continue to evolve to accommodate emerging technologies, while remaining grounded in basic constructs. We survey over 5,300 papers that address conceptual modeling topics from the 1970s to the present, which are collected from 35 multidisciplinary journals and conferences, and use them as the basis from which to analyze the progression of conceptual modeling. The important role that conceptual modeling should play in our evolving digital world is discussed, and future research directions proposed.", "venue": "ACM Computing Surveys", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-03-30", "journal": {"name": "ACM Computing Surveys", "pages": "1 - 38", "volume": "55"}, "authors": [{"authorId": "1764975", "name": "V. Storey"}, {"authorId": "3026841", "name": "R. Lukyanenko"}, {"authorId": "2616045", "name": "A. Castellanos"}], "citations": [{"paperId": "3e01142b96ab1b50d0b4067e523e9f6e3b83aab6", "title": "Diagrams-as-Code for Conceptual Modeling in Computational Problem Solving"}]}
