{"paperId": "adc1b032d80cf3fb38151aebf46647b857e8c378", "publicationVenue": null, "title": "Towards the Development of Agenda 2063 Geo-Portal to Support Sustainable Development in Africa", "abstract": "The successful implementation of the African Union’s Agenda 2063 strategic development blueprint is critical for the attainment of economic development, social prosperity, political stability, protection, and regional integration in Africa. Agenda 2063 is a strategic and endogenous development plan that seeks to strategically and competitively reposition the African continent to ensure poverty eradication and equitable people-centric socio-economic and technological transformation. Its impact areas include wealth creation, shared prosperity, sustainable environment, and transformative capacities. Monitoring and evaluation systems play a critical role in collecting, recording, storing, integrating, and evaluating and tracking performance information in the implementation of longer-term strategic plans. The usage of the geographic information system (GIS) as a monitoring and evaluation tool has gained traction in the last few decades due to its ability to support the collection, integration, storage, analysis, output, and distribution of location-based data. The advent of web-based GIS provides a powerful online platform to collect, integrate, discover, use and share geospatial data, information, and services related to sustainable development. In this paper, we aim to describe the implementation, architectural structural design, and the functionality of the pilot Agenda 2063 geoportal. The live prototype internet-based geoportal is intended to facilitate data collection, management, integration, analysis, and visualization of Agenda 2063 development indicators. This geoportal is meant to support the planning, implementation, and monitoring of the Agenda 2063 goals at the continental, regional, and national levels. As our results show, we successfully demonstrated that a web-geoportal is a powerful interactive platform to upload, access, explore, visualize, analyse, and disseminate geospatial data related to the sustainable development of the African continent. Although in the pilot phase, the geoportal demonstrates the primary functionality of geoportals in terms of its capability to discover, analyse, share, and download geospatial datasets.", "venue": "ISPRS Int. J. Geo Inf.", "year": 2019, "fieldsOfStudy": ["Business", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-09-06", "journal": {"name": "ISPRS Int. J. Geo Inf.", "pages": "399", "volume": "8"}, "authors": [{"authorId": "90258145", "name": "P. Mhangara"}, {"authorId": "1393021816", "name": "A. Lamba"}, {"authorId": "70645452", "name": "W. Mapurisa"}, {"authorId": "104585042", "name": "N. Mudau"}], "citations": [{"paperId": "20aabda5d5523464d0c0d33f5482708ecf2aa999", "title": "Organic consumption as a means to achieve sustainable development goals and agenda 2063"}, {"paperId": "4ec1fb6a48a5766d228b758a69e6dc0e34b2cf70", "title": "Under-five Mortality: Comparative Study of Kenya and other three East-african Developing Countries"}, {"paperId": "4256dfd6af49f05d7f31c99196c4d488f1a65b28", "title": "Exports, finance, and economic growth: does financial development boost the impact of exports on economic growth in Sub-Saharan Africa?"}, {"paperId": "fc8bfaf95abb03b7e71c0aaf079e03df2abdc226", "title": "Mapping Land Use Land Cover Transitions at Different Spatiotemporal Scales in West Africa"}, {"paperId": "de62c7aee59c96d6601542925475862c4f31bc67", "title": "Sustainable cities: major challenges and trends"}, {"paperId": "7cf1833facdec88a62639da0eb667c39e53e9958", "title": "Principles of implementation of the ESG agenda as part of geoportals"}, {"paperId": "fe67370b2831eacca2ce777294ba5edcf8e327ed", "title": "Future Prospects of Sustainable Development in Africa"}]}
