{"paperId": "adc829ea230a1d884d91f2448841d324bf03e3d5", "publicationVenue": {"id": "bd93f51e-8207-47f7-b838-1e50382eded6", "name": "Journal of the Institution of Electronics and Telecommunication Engineers", "type": "journal", "alternate_names": ["J Inst Electron Telecommun Eng", "Iete Journal of Research", "Iete J Res"], "issn": "0377-2063", "url": "http://www.tandfonline.com/loi/tijr20"}, "title": "Solving Partially Observable Environments with Universal Search Using Dataflow Graph-Based Programming Model", "abstract": "Universal search allows one to create an asymptotically optimal intelligent agent, which can act in a wide range of computable environments. However combinatorial explosion is still lurking behind though its dependency shifted from problem size to solution size. To combat this scenario, we propose a dataflow graph-based functional programming model to be used in the universal search for solution program generation. We have justified the superiority of our proposed model compared to sequential token-based languages when used in universal search-based intelligent agents. We have shown how applying an equivalent program pruning strategy can handle the problem of semantically redundant program generation. An incremental learning strategy based on gradient ascent is also proposed for our designed agent. Experimental results positively reinforced the theoretical justifications. We used our agent to solve some partially observable environments and compared them with the current state of art methods and it reveals the exceptional performance of our agent.", "venue": "Journal of the Institution of Electronics and Telecommunication Engineers", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-12-01", "journal": {"name": "IETE Journal of Research", "pages": "6137 - 6151", "volume": "69"}, "authors": [{"authorId": "3231420", "name": "S. Paul"}, {"authorId": "2944593", "name": "Parama Bhaumik"}], "citations": [{"paperId": "1bbf508585f7ed655a449ba10c13f789257b70cc", "title": "Sequential Planning in Large Partially Observable Environments guided by LLMs"}]}
