{"paperId": "adcda3bfb7cf8b09ce06b93c7170801bf3d0bef6", "publicationVenue": null, "title": "A Comparison of HDFS Compact Data Formats: Avro Versus Parquet", "abstract": "In this paper, file formats like Avro and Parquet are compared with text formats to evaluate the performance of the data queries. Different data query patterns have been evaluated. Cloudera’s open-source Apache Hadoop distribution CDH 5.4 has been chosen for the experiments presented in this article. The results show that compact data formats (Avro and Parquet) take up less storage space when compared with plain text data formats because of binary data format and compression advantage. Furthermore, data queries from the column based data format Parquet are faster when compared with text data formats and Avro.", "venue": "", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2017-07-04", "journal": {"name": "Mokslas - Lietuvos Ateitis", "pages": "267-276", "volume": "9"}, "authors": [{"authorId": "31327689", "name": "Daiga Plase"}, {"authorId": "2047176", "name": "Laila Niedrite"}, {"authorId": "1944120", "name": "R. Taranovs"}], "citations": [{"paperId": "f6f370c5c6a5f4861f95bfe9638d749e5eee6086", "title": "Analysis of the Influence of Modeling, Data Format and Processing Tool on the Performance of Hadoop-Hive Based Data Warehouse"}, {"paperId": "73cc5297488135c07d9f42a7d483dc28aafac507", "title": "Experimental Characteristics Study of Data Storage Formats for Data Marts Development within Data Lakes"}, {"paperId": "a8d5992d068fd1cd92fa3f7be8d7f10d44bbcfc5", "title": "Choosing a Data Storage Format in the Apache Hadoop System Based on Experimental Evaluation Using Apache Spark"}, {"paperId": "92cc452e53bbf5d3bc2ea99865b7ed0737f687fc", "title": "A Big Data Architecture for Log Data Storage and Analysis"}, {"paperId": "0cfc1e28ee990579a686025612aa06a8d6f96c7d", "title": "Big Data Analytics – The Tools and Technology in Drug Discovery"}, {"paperId": "80c1bceba2932fa8f73d7dd64be6225a5c19287c", "title": "Integration of the Big Data Environment in a Financial Sector Entity to Optimize Products, Services and Decision-Making"}, {"paperId": "8dccc035d440fae48e469c8baba8d2bd2918eab2", "title": "Analysis of Big Data Storage Tools for Data Lakes based on Apache Hadoop Platform"}, {"paperId": "70d5ea1a8d2408dcdbdae3d713874f28d70bdd6a", "title": "HDFS File Formats: Study and Performance Comparison"}]}
