{"paperId": "adcfafee64a964e3053ef769a2bf653758292c50", "publicationVenue": null, "title": "A Survey on Various Methods and Algorithms of Scheduling in Fog Computing", "abstract": "The rapid deployment of IoT in different areas generates a massive amount of data transferred to the Cloud. To solve this challenge a new paradigm, called Fog Computing, is located at the edge of the network and close to the connected objects. Its main role is to extend the capacities of Cloud and improve the performance and the QoS required by the applications by the use of different methods and techniques based on scheduling algorithms. In this paper, we review various recent studies available in the literature that are interested in the scheduling methods and algorithms used in Fog computing. The use of fog layer, in solving optimization problem, is faced with serious challenges. Therefore, to help practitioners and researchers, we present an in-depth overview of Fog Computing studying various scheduling methods and algorithms. We analyze, compare and classify these different scheduling approaches according to the nature of the algorithm used in the scheduling, the QoS optimized by the proposed approach and the type of applications in order to show what is suitable for critical IoT (CIOT), massive IoT (MIOT) and Industry IoT (IIOT). Finally, we present a comparison of the different simulation tools used to evaluate these approaches to guide fog computing developers/researchers which tool is suitable and most flexible for simulating the application under consideration.", "venue": "Ingénierie des Systèmes d Inf.", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "Ingénierie des Systèmes d Inf.", "pages": "211-224", "volume": "26"}, "authors": [{"authorId": "9300898", "name": "Raouf Belmahdi"}, {"authorId": "2923660", "name": "D. Mechta"}, {"authorId": "1941697", "name": "S. Harous"}], "citations": [{"paperId": "3668613455cd4011c46cbede6fa0899a7361e0de", "title": "Task scheduling in fog environment - Challenges, tools & methodologies: A review"}, {"paperId": "e2b70f41a88b1ae1d9bd955cf20009cefeda249d", "title": "The Study of Learning System for Infant Cry Classification Using Discrete Wavelet Transform and Extreme Machine Learning"}, {"paperId": "1006252b20f661d815f3b161adc35995523d7e23", "title": "SQGA: Quantum Genetic Algorithm-based Workflow Scheduling in Fog-Cloud Computing"}, {"paperId": "9a1b0175bd444231bcd6907a985cfbc445fda5a7", "title": "Smart Resource Scheduling Model in Fog Computing"}, {"paperId": "053f26ead1f166b2a4bd7b374aa762203979382f", "title": "IoT Modes of Operations with Different Security Key Management Techniques: A Survey"}, {"paperId": "a7f8367aadce54a48481b81cb14053c7bd90606f", "title": "Tradeoff of Computation Bits and Computing Speed in an Edge Computing System for Sensor Networks"}, {"paperId": "8800c414655a827600b71e0351756f8bd7be86af", "title": "Investigating performance optimization through balanced task scheduling heuristics and DVFS in hybrid fog-cloud computing platforms"}]}
