{"paperId": "adcf93bec8e3306d5b0848b0231e5da1b5d9f2b6", "publicationVenue": null, "title": "A Lightweight Privacy-Preserving Solution for IoT: The Case of E-Health", "abstract": "E-health, as an IoT application, promises to improve the human daily life. It collects periodically biomedical data through intelligent sensors and transmits it for remote medical diagnostics. Due to the importance of exchanged medical data, privacy preserving is a huge issue. To this aim, several solutions were proposed. However, either they cannot provide a high level of privacy, or they incur an important overhead. Motivated by this observation, we introduce a privacy preserving E-health system including a novel cryptographic scheme called PKE-IBE. The proposed cryptographic scheme is based on Identity-Based Cryptography (IBC). It tackles the key escrow issue and ensures blind partial private key generation. A chosen ciphertext security variant is also introduced. Our detailed security and performance analysis reveals that our proposal not only overcomes various known attacks but also is efficient in comparison to existing approaches.", "venue": "2018 IEEE 20th International Conference on High Performance Computing and Communications; IEEE 16th International Conference on Smart City; IEEE 4th International Conference on Data Science and Systems (HPCC/SmartCity/DSS)", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2018-06-01", "journal": {"name": "2018 IEEE 20th International Conference on High Performance Computing and Communications; IEEE 16th International Conference on Smart City; IEEE 4th International Conference on Data Science and Systems (HPCC/SmartCity/DSS)", "pages": "555-562"}, "authors": [{"authorId": "5494564", "name": "Rihab Boussada"}, {"authorId": "3197293", "name": "Mohamed Elhoucine Elhdhili"}, {"authorId": "1809801", "name": "L. Saïdane"}], "citations": [{"paperId": "bad514ab8604b283410720605e04700190dcfb31", "title": "Role of machine learning and deep learning in securing 5G-driven industrial IoT applications"}, {"paperId": "e6aae605730cf6f16f995ee0d0c2bd4ec84b62c2", "title": "Sensor Initiated Healthcare Packet Priority in Congested IoT Networks"}, {"paperId": "8b58020d1c122692714ef9a4e5b1646014bd725a", "title": "Security in product lifecycle of IoT devices: A survey"}, {"paperId": "af0fad5b5b7783de8b0734c736127cb04542677e", "title": "Sensor Driven Priority Routing of Health Care Data Packet in IoT Network"}, {"paperId": "8f9e3cbe4276dc7a1baf60fbeac44b80c7847004", "title": "Prioritizing Health Care Data Traffic in a Congested IoT Cloud Network"}, {"paperId": "53fbb58d779f12bdbbfccaecc8ff6613ce979577", "title": "Privacy-Preservation Techniques for IoT Devices: A Systematic Mapping Study"}, {"paperId": "b22ee21f24d340125a9459bf616ad7ff4062e90c", "title": "A Descriptive Analysis of Data Preservation Concern and Objections in IoT-Enabled E-Health Applications"}, {"paperId": "38b5e106c32a37086e08560d90054428f12dfd33", "title": "Privacy-Preserving Identifiers for IoT: A Systematic Literature Review"}]}
