{"paperId": "add0c62f5ca696be51c6eee4381f85fdef7ea8d1", "publicationVenue": {"id": "228761ec-c40a-479b-8309-9dcbe9851bcd", "name": "IEEE Internet of Things Journal", "type": "journal", "alternate_names": ["IEEE Internet Thing J"], "issn": "2327-4662", "url": "https://www.ieee.org/membership-catalog/productdetail/showProductDetailPage.html?product=PER288-ELE", "alternate_urls": ["https://ieeexplore.ieee.org/servlet/opac?punumber=6488907", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6488907", "http://ieee-iotj.org/#"]}, "title": "Machine-Learning-Assisted Security and Privacy Provisioning for Edge Computing: A Survey", "abstract": "Edge computing (EC), is a technological game changer that has the ability to connect millions of sensors and provide services at the device end. The broad vision of EC integrates storage, processing, monitoring, and control of operations in the Edge of the network. Though EC provides end-to-end connectivity, speeds up operation, and reduces latency of data transfer, security is a major concern. The tremendous growth in the number of Edge Devices and the amount of sensitive information generated at the device and the cloud creates a broad surface of attack and therefore, the need to secure the static and mobile data is imperative. This article is a comprehensive survey that describes the security and privacy issues in various layers of the EC architecture that result from the networking of heterogeneous devices. Second, it discusses the wide range of machine learning and deep learning algorithms that are applied in EC use cases. Following this, this article broadly details the different types of attacks that the Edge network confronts, and the intrusion detection systems and the corresponding machine learning algorithms that overcome these security and privacy concerns. The details of machine learning and deep learning techniques for EC security are tabulated. Finally, the open issues in securing Edge networks and future research directions are provided.", "venue": "IEEE Internet of Things Journal", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-01-01", "journal": {"name": "IEEE Internet of Things Journal", "pages": "236-260", "volume": "9"}, "authors": [{"authorId": "2145892477", "name": "Shivani Singh"}, {"authorId": "144669902", "name": "R. Sulthana"}, {"authorId": "95345426", "name": "T. Shewale"}, {"authorId": "3185174", "name": "V. Chamola"}, {"authorId": "1794138", "name": "A. Benslimane"}, {"authorId": "48440849", "name": "B. Sikdar"}], "citations": [{"paperId": "9ea88e1d0196f57c5d681737384cb82ce0c27aee", "title": "IoT-Edge technology based cloud optimization using artificial neural networks"}, {"paperId": "dc31e534cc121884446593e83152402ecdecc816", "title": "TCP/IP stack transport layer performance, privacy, and security issues"}, {"paperId": "168db37a0d6fd9e9be843c34f4aa2c3be7bd65a1", "title": "Denial of service attacks in edge computing layers: Taxonomy, vulnerabilities, threats and solutions"}, {"paperId": "b5a8bf67dd8226459cc7230ab5d72a04e23750c7", "title": "The Security and Privacy of Mobile-Edge Computing: An Artificial Intelligence Perspective"}, {"paperId": "28940bef093ecf5b276d85d2197ac25e71cbc53d", "title": "Deep Q-network-based heuristic intrusion detection against edge-based SIoT zero-day attacks"}, {"paperId": "a69a7f2b0c099019129dcd109aced87754978ce4", "title": "Intelligent intrusion detection framework for multi-clouds – IoT environment using swarm-based deep learning classifier"}, {"paperId": "b06ed8367c150760e184f56673ea4eee3c8d8770", "title": "A Survey of DDoS Attacks Detection Schemes in SDN Environment"}, {"paperId": "5a6c22333f6b1d06a066b10a9a972c6378eda35e", "title": "Fortified-Edge 2.0: Machine Learning based Monitoring and Authentication of PUF-Integrated Secure Edge Data Center"}, {"paperId": "8465f5e9ce41f9dc170cb34919c67be0c51d8cbf", "title": "Blockchain and Machine Learning Security for the Internet of Things: A Bibliometric Analysis"}, {"paperId": "07d8a45309bbc3dacf7a93b4091dde8a1c65581f", "title": "Multi-Agent Reinforcement Learning based Secure Searching and Data Collection in AUV Swarms"}, {"paperId": "fd054986e43c9f722282bb0f2697b3993427efe2", "title": "A blockchain‐enabled security management framework for mobile edge computing"}, {"paperId": "55f12117154f301511c336668e6946444d0ab730", "title": "Communication-Aware DNN Pruning"}, {"paperId": "68152fc396161b54d0d1499f6cdf58d99c6163e9", "title": "SECHO: A deep reinforcement learning-based scheme for secure handover in mobile edge computing"}, {"paperId": "98f9d38fa5e6bc72068a68762ebe7291144320d2", "title": "A collaborative and adaptive cyber défense strategic assessment for healthcare networks using edge computing"}, {"paperId": "74b51455b144dacaaa31ec014351337732fe15ff", "title": "Interpretable intrusion detection for next generation of Internet of Things"}, {"paperId": "4b1f74cf82c2e3c0bb554381472352b4ab726a14", "title": "Swarmtrust: A swarm optimization-based approach to enhance trustworthiness in smart homes"}, {"paperId": "f6a1fb712d6b1837af567ba482b84cfab31c2cbb", "title": "Intelligent Intrusion Detection for Internet of Things Security: A Deep Convolutional Generative Adversarial Network-Enabled Approach"}, {"paperId": "69b37e215695510fabc008259704685d3ebbb081", "title": "Distinctive Measurement Scheme for Security and Privacy in Internet of Things Applications Using Machine Learning Algorithms"}, {"paperId": "263e6bb37051693c89a9ca77023bde60ed9f7e28", "title": "Analysis of Communicable Disease Symptoms Using Bag-of-Neural Network at Edge Networks"}, {"paperId": "5c51cc6bdf5bb21167b7b3dd70b8b45ca6c572f2", "title": "An SLR on Edge Computing Security and possible threat protection"}, {"paperId": "0d2fdc9a369dc55e80ec2f068ffead9c82d4cab7", "title": "Elastic Optimized Edge Federated Learning"}, {"paperId": "a7b39a31e50797f4019115abc8bc362bef8fcf6d", "title": "Federated Learning Approach Decouples Clients From Training a Local Model and With the Communication With the Server"}, {"paperId": "189485838a1b6222782ef025a53178f89795e5d3", "title": "A Novel and Secure Framework to Detect Unauthorized Access to an Optical Fog-Cloud Computing Network"}, {"paperId": "af16553ff0efc6fe6539fd255dfa7c9f5fd4d63e", "title": "DIDS:A deep neural network based real-time intrusion detection system for IoT"}, {"paperId": "31f42be573c81bf17f4db1bf33a314c1dd60dfd0", "title": "Blockchain-Based Federated Learning for Securing Internet of Things: A Comprehensive Survey"}, {"paperId": "53945286351127feab2bdfcb5ca6312633764db8", "title": "Edge Intelligence: Federated Learning-Based Privacy Protection Framework for Smart Healthcare Systems"}, {"paperId": "3f4b5c00040ee27b4518548434332efad081ecde", "title": "AI-Based Mean Field Game against Resource-Consuming Attacks in Edge Computing"}, {"paperId": "b508017ae490b6390ee42f21853eab2262dc4bbc", "title": "On Attack-Resilient Service Placement and Availability in Edge-Enabled IoV Networks"}, {"paperId": "ccbdc46ec188574ab7c23463c5551fec35f7f2bc", "title": "A Resource Allocation Scheme for Energy Demand Management in 6G-enabled Smart Grid"}, {"paperId": "bad514ab8604b283410720605e04700190dcfb31", "title": "Role of machine learning and deep learning in securing 5G-driven industrial IoT applications"}, {"paperId": "5cb08589010efcbdf0c58b63f3511ddd6369b1ea", "title": "5G Multi-Access Edge Computing: A Survey on Security, Dependability, and Performance"}, {"paperId": "8255328fe61dd66b9e82627c5e9fa3ec25b31415", "title": "Security and Privacy on 6G Network Edge: A Survey"}, {"paperId": "f86bb33d3656be142df0e4ffc4f31653951c38be", "title": "Incentivization and Aggregation Schemes for Federated Learning Applications"}, {"paperId": "0fd7cdea1f24efb0c0f3051555433417823bb392", "title": "A Comprehensive Survey on Artificial Intelligence for Unmanned Aerial Vehicles"}, {"paperId": "4e5cca3505cc48e85b072aa31b80db94c25e2bff", "title": "Misbehavior Detection for Position Falsification Attacks in VANETs Using Machine Learning"}, {"paperId": "11d0864082b7064adc5a4d0b715ce019f30f869b", "title": "Balancing QoS and Security in the Edge: Existing Practices, Challenges, and 6G Opportunities With Machine Learning"}, {"paperId": "b24d7a0afb252fdf8451de53504c03e6f42c627d", "title": "Blockchain-based Federated Learning for Securing Internet of Things: A Comprehensive Survey"}, {"paperId": "4373d78c0da407e4f447464881cf46c7d374aed6", "title": "Analysis of Edge Computing Systems-An AI Based Perspective"}]}
