{"paperId": "add1df78fee91ebc6e4514c202b796eb15592450", "publicationVenue": {"id": "7b2adce0-d53f-49d6-8784-b0645604fe62", "name": "ACM Computing Surveys", "type": "journal", "alternate_names": ["ACM Comput Surv"], "issn": "0360-0300", "url": "http://www.acm.org/pubs/surveys/", "alternate_urls": ["http://portal.acm.org/csur", "https://csur.acm.org/", "http://csur.acm.org/"]}, "title": "SLA Management for Big Data Analytical Applications in Clouds", "abstract": "Recent years have witnessed the booming of big data analytical applications (BDAAs). This trend provides unrivaled opportunities to reveal the latent patterns and correlations embedded in the data, and thus productive decisions may be made. This was previously a grand challenge due to the notoriously high dimensionality and scale of big data, whereas the quality of service offered by providers is the first priority. As BDAAs are routinely deployed on Clouds with great complexities and uncertainties, it is a critical task to manage the service level agreements (SLAs) so that a high quality of service can then be guaranteed. This study performs a systematic literature review of the state of the art of SLA-specific management for Cloud-hosted BDAAs. The review surveys the challenges and contemporary approaches along this direction centering on SLA. A research taxonomy is proposed to formulate the results of the systematic literature review. A new conceptual SLA model is defined and a multi-dimensional categorization scheme is proposed on its basis to apply the SLA metrics for an in-depth understanding of managing SLAs and the motivation of trends for future research.", "venue": "ACM Computing Surveys", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2020-06-12", "journal": {"name": "ACM Computing Surveys (CSUR)", "pages": "1 - 40", "volume": "53"}, "authors": [{"authorId": "1677563560", "name": "Xuezhi Zeng"}, {"authorId": "144901372", "name": "S. Garg"}, {"authorId": "116407422", "name": "M. Barika"}, {"authorId": "123160397", "name": "A. Zomaya"}, {"authorId": "2108594650", "name": "Lizhe Wang"}, {"authorId": "1809861", "name": "M. Villari"}, {"authorId": "70927127", "name": "Dan Chen"}, {"authorId": "144928956", "name": "R. Ranjan"}], "citations": [{"paperId": "c013020b8dc78b8e296ae97d7e5da3045d9348b9", "title": "Efficient fault tolerant cost optimized approach for scientific workflow via optimal replication technique within cloud computing ecosystem"}, {"paperId": "115efb6260148f95ac6b93438bd18cb4adfdc77d", "title": "Modern Computing: Vision and Challenges"}, {"paperId": "933d67b4c7c604e6f2d56d9270734f742f1a08f5", "title": "A Q-learning based auto-scaling approach for provisioning big data analysis services in cloud environments"}, {"paperId": "23bda784d71ad2bf3c8ea479ce596f571bb14c00", "title": "Optimization of Maritime Communication Workflow Execution with a Task-Oriented Scheduling Framework in Cloud Computing"}, {"paperId": "c6515027597b023ac17099c6cb4fa85cdfaacc25", "title": "Gaussian Adapted Markov Model with Overhauled Fluctuation Analysis-Based Big Data Streaming Model in Cloud."}, {"paperId": "30287839bf7a26f403a4ae2ffda963caa31effd0", "title": "An integrating computing framework based on edge-fog-cloud for internet of healthcare things applications"}, {"paperId": "39e58d2bada27f7784dc5e2f742fa7b5569504b4", "title": "Web service adaptation: A decade's overview"}, {"paperId": "50d643bdd732a67d6854594773e4e7938784f938", "title": "Big Data Assurance: An Approach Based on Service-Level Agreements"}, {"paperId": "e6949a07bacddba28eabf8acbbaa46d33b792a21", "title": "Network SLO-aware container scheduling in Kubernetes"}, {"paperId": "a783345d148059655477418bfc39a3f36e025353", "title": "Runtime Management of Service Level Agreements through Proactive Resource Provisioning for a Cloud Environment"}, {"paperId": "465edb61bd32ca126909bb40afb9fa6b1e419e08", "title": "Toward Building Edge Learning Pipelines"}, {"paperId": "b0c1e30e7b82a4bdc4cb85786a8b61d1a26fd36e", "title": "On the ICN-IoT with federated learning integration of communication: Concepts, security-privacy issues, applications, and future perspectives"}, {"paperId": "b1e1e8e566627d1d2d8c92f44cb935d0d0f285e5", "title": "Artificial Intelligence Applications and Self-Learning 6G Networks for Smart Cities Digital Ecosystems: Taxonomy, Challenges, and Future Directions"}, {"paperId": "a7505939dc1e1b8d418ef7a9a11d9fedfb583578", "title": "A DevSecOps-based Assurance Process for Big Data Analytics"}, {"paperId": "55e11dba7d52c4d55bbbe9514838f8f2a4e9bd16", "title": "Job scheduling for big data analytical applications in clouds: A taxonomy study"}, {"paperId": "f00195dda6b6f67889589f09aeddbb7a7a1566c9", "title": "Multimedia Information System (MIS) for Knowledge Generation and ICT Policy Framework in Education: Innovative Sustainable Educational Investment"}, {"paperId": "b1f3a0a6e73da401a52cb2ce15131c1182d5ad0f", "title": "A literature review of parameter tuning within the context of big data processing frameworks"}, {"paperId": "1651005bc52830a595d45302eb36813c4460fe72", "title": "Task Duplication-Based Scheduling Algorithm for Budget-Constrained Workflows in Cloud Computing"}, {"paperId": "35e8c10dce9d2782cf7091d6994158d02f2c6f40", "title": "Security by Design for Big Data Frameworks Over Cloud Computing"}, {"paperId": "3f600981032394329917dcfed71d479b2e4ae620", "title": "Management of Service Level Agreements for Big Data Analytics Applications in Cloud: A Layer-based Study"}, {"paperId": "875b54c7dec452aa4622835149299e8d0938fc9d", "title": "Efficient Fault Tolerant Cost Driven Mechanism For Scientific Workflow Through Optimal Replication Strategy In Cloud Computing Environment"}, {"paperId": "b02364ab877be7f412027c769eb368a8c4c10d35", "title": "Telematics and Informatics Reports"}]}
