{"paperId": "add330e246b1f4886c94e73cd53e1e95cae9dee3", "publicationVenue": {"id": "fcbcaf18-8ab1-43e1-a973-604bbc7e344e", "name": "Proceedings of the VLDB Endowment", "type": "journal", "alternate_names": ["Proceedings of The Vldb Endowment", "Proc VLDB Endow", "Proc Vldb Endow"], "issn": "2150-8097", "url": "http://dl.acm.org/toc.cfm?id=J1174", "alternate_urls": ["http://portal.acm.org/toc.cfm?CFID=21632689&CFTOKEN=99329904&WantType=Affiliated%20Organizations&coll=ACM&dl=ACM&id=J1174&idx=J1174&part=affil&title=VLDB%20Endowment&type=periodical"]}, "title": "STEED: An Analytical Database System for TrEE-structured Data", "abstract": "Tree-structured data formats, such as JSON and Protocol Buffers, are capable of expressing sophisticated data types, including nested, repeated, and missing values. While such expressing power contributes to their popularity in real-world applications, it presents a significant challenge for systems supporting tree-structured data. Existing systems have focused on general-purpose solutions either extending RDBMSs or designing native systems. However, the general-purpose approach often results in sophisticated data structures and algorithms, which may not reflect and optimize for the actual structure patterns in the real world. \n \nIn this demonstration, we showcase Steed, an analytical database Sy stem for t r ee -structured d ata. We use the insights gained by analyzing representative real-world tree structured data as guidelines in the design of Steed. Steed learns and extracts a schema tree for a data set and uses the schema tree to reduce the storage space and improve the efficiency of data field accesses. We observe that sub-structures in real world data are often simple, while the tree-structured data types can support very sophisticated structures. We optimize the storage structure, the column assembling algorithm, and the in-memory layout for the simple sub-structures (a.k.a. simple paths). Compared to representative state-of-the-art systems (i.e. PostgreSQL/JSON, MongoDB, and Hive+Parquet), Steed achieves orders of magnitude better performance for data analysis queries.", "venue": "Proceedings of the VLDB Endowment", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2017-08-01", "journal": {"name": "Proc. VLDB Endow.", "pages": "1897-1900", "volume": "10"}, "authors": [{"authorId": "2109045479", "name": "Zhiyi Wang"}, {"authorId": "46385760", "name": "Dongyan Zhou"}, {"authorId": "116038464", "name": "Shimin Chen"}], "citations": [{"paperId": "4b44c82b45eeb8c04f1f751ad13eb805c8067581", "title": "JSON Tiles: Fast Analytics on Semi-Structured Data"}, {"paperId": "0bd19e1c9a4b3c20a259a591f7f724575b0d6b8a", "title": "Native JSON datatype support"}, {"paperId": "50f807a33bf836a8d6e80dfa2ed6ff63a41ec463", "title": "An Implementation of Scalable High Throughput Data Platform for Logging Semiconductor Testing Results"}, {"paperId": "bc7edaf1ca7147aaabaa96b3475ca5c17a02b6a6", "title": "Design and Implementation of RDMA-based Database Operators"}, {"paperId": "3bc193c460dfced96569d0f629e6c430731a70cb", "title": "JSON Data Management in RDBMS"}]}
