{"paperId": "add3a51a63589d836bd35bba7f1f0510a3c7d690", "publicationVenue": {"id": "fcbcaf18-8ab1-43e1-a973-604bbc7e344e", "name": "Proceedings of the VLDB Endowment", "type": "journal", "alternate_names": ["Proceedings of The Vldb Endowment", "Proc VLDB Endow", "Proc Vldb Endow"], "issn": "2150-8097", "url": "http://dl.acm.org/toc.cfm?id=J1174", "alternate_urls": ["http://portal.acm.org/toc.cfm?CFID=21632689&CFTOKEN=99329904&WantType=Affiliated%20Organizations&coll=ACM&dl=ACM&id=J1174&idx=J1174&part=affil&title=VLDB%20Endowment&type=periodical"]}, "title": "XDB in Action: Decentralized Cross-Database Query Processing for Black-Box DBMSes", "abstract": "\n Data are naturally produced at different locations and hence stored on different DBMSes. To maximize the value of the collected data, today's users combine data from different sources. Research in data integration has proposed the Mediator-Wrapper (MW) architecture to enable ad-hoc querying processing over multiple sources. The MW approach is desirable for users, as they do not need to deal with heterogeneous data sources. However, from a query processing perspective, the MW approach is inefficient: First, one needs to provision the mediating execution engine with resources. Second, during query processing, data gets \"centralized\" within the mediating engine, which causes redundant data movement. Recently, we proposed\n in-situ cross-database query processing\n , a paradigm for federated query processing without a mediating engine. Our approach optimizes runtime performance and reduces data movement by leveraging existing systems, eliminating the need for an additional federated query engine. In this demonstration, we showcase XDB, our prototype for in-situ cross-database query processing. We demonstrate several aspects of XDB, i.e. the cross-database environment, our optimization techniques, and its decentralized execution phase.\n", "venue": "Proceedings of the VLDB Endowment", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-01", "journal": {"name": "Proc. VLDB Endow.", "pages": "4078-4081", "volume": "16"}, "authors": [{"authorId": "92265606", "name": "Haralampos Gavriilidis"}, {"authorId": "2225302674", "name": "Leonhard Rose"}, {"authorId": "2225299533", "name": "Joel Ziegler"}, {"authorId": "3091174", "name": "Kaustubh Beedkar"}, {"authorId": "1399355221", "name": "Jorge-Arnulfo Quiané-Ruiz"}, {"authorId": "1733290", "name": "V. Markl"}], "citations": []}
