{"paperId": "add43a62ca9fa0a0ddb972a1e4d7da125d586229", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Multi-Aircraft Formation Recognition Method of Over-the-Horizon Radar Based on Deep Transfer Learning", "abstract": "Over-the-horizon radar (OTHR) is an important equipment for the ultralong-range early warning in the military, but the use of constant false-alarm rate (CFAR), which is a traditional detection method, makes it difficult in multi-aircraft formation recognition. To solve this problem, a multi-aircraft formation recognition method based on deep transfer learning in OTHR is proposed. First, the range-Doppler images of aircraft formation in OTHR are simulated, which are composed of four categories of samples. Secondly, a recognition model based on Convolutional Neural Network (CNN) and CFAR detection technology is constructed, whose training method is designed as a two-step transfer. Finally, the trained model can well distinguish the spectral characteristics of aircraft formation, and then recognize the aircraft number of a formation. Experiments show that the proposed method is better than the traditional CFAR detection method, and can detect the number of aircraft more accurately in the formation with the same false alarm rate.", "venue": "IEEE Access", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "115411-115423", "volume": "10"}, "authors": [{"authorId": "2050221094", "name": "Futai Liang"}, {"authorId": "2150920486", "name": "Yan Zhou"}, {"authorId": "2157213156", "name": "Hui Li"}, {"authorId": "2112520725", "name": "Xun Feng"}, {"authorId": "2154735429", "name": "Junbiao Zhang"}], "citations": [{"paperId": "b7661f36d64b5b4282197dab8711cee74967978a", "title": "Ship Formation Identification with Spatial Features and Deep Learning for HFSWR"}]}
