{"paperId": "add749dd8fceda010c72a0828d6845511e976a37", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Amortising the Cost of Mutation Based Fault Localisation using Statistical Inference", "abstract": "Mutation analysis can effectively capture the dependency between source code and test results. This has been exploited by Mutation Based Fault Localisation (MBFL) techniques. However, MBFL techniques suffer from the need to expend the high cost of mutation analysis after the observation of failures, which may present a challenge for its practical adoption. We introduce SIMFL (Statistical Inference for Mutation-based Fault Localisation), an MBFL technique that allows users to perform the mutation analysis in advance against an earlier version of the system. SIMFL uses mutants as artificial faults and aims to learn the failure patterns among test cases against different locations of mutations. Once a failure is observed, SIMFL requires either almost no or very small additional cost for analysis, depending on the used inference model. An empirical evaluation of SIMFL using 355 faults in Defects4J shows that SIMFL can successfully localise up to 103 faults at the top, and 152 faults within the top five, on par with state-of-the-art alternatives. The cost of mutation analysis can be further reduced by mutation sampling: SIMFL retains over 80% of its localisation accuracy at the top rank when using only 10% of generated mutants, compared to results obtained without sampling.", "venue": "arXiv.org", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-02-26", "journal": {"name": "ArXiv", "volume": "abs/1902.09729"}, "authors": [{"authorId": "2116516016", "name": "Jinhan Kim"}, {"authorId": "144712289", "name": "Gabin An"}, {"authorId": "145278906", "name": "R. Feldt"}, {"authorId": "143828721", "name": "S. Yoo"}], "citations": [{"paperId": "665c7796967bdef5d5fcb09f4ccfdb1201526f85", "title": "HOTFUZ: Cost‐effective higher‐order mutation‐based fault localization"}, {"paperId": "dafad0fdedd2cb167084814f665a00350bbd331f", "title": "SMBFL: slice-based cost reduction of mutation-based fault localization"}, {"paperId": "f4cb211dee979600687eaf67854e7d72860bcd14", "title": "A Comparison Study of Two Well-known Fault Localization Methods"}]}
