{"paperId": "adfbeb48ca609f5cf74ae748d1a00c172c37b733", "publicationVenue": {"id": "6a94f1d5-0b70-4a95-bd5c-2d73cf0e0d9c", "name": "IFIP/IEEE Symposium on Integrated Network Management", "type": "conference", "alternate_names": ["IM", "Integrated Network Management", "Integr Netw Manag", "IFIP/IEEE Symp Integr Netw Manag"], "url": "https://ieeexplore.ieee.org/xpl/conhome/1000381/all-proceedings"}, "title": "Sensor Virtualization and Data Orchestration in Internet of Vehicles (IoV)", "abstract": "The idea of the Internet of Vehicles (IoV) has begun with the emergence of the Internet of things (IoT) and big data. This concept of IoV allows for information exchange between vehicles-to-anything (V2X), such as other vehicles, pedestrians, and mobile devices to enhance road safety and traffic management. However, network operation and management become more complex with an increase in the number of IoV devices. Although virtualization is a key enabler to providing flexible and automated network management and network resources optimization for vehicular services, a continuous information gathering from roadside infrastructure is greatly required. To this end, in this paper, a system is proposed to exploit the potential of Mobile Edge Computing (MEC) and virtualization technologies to maintain the status of the underlying network on the intermediate layer. This would lead to enhanced data processing performance as well as the availability of pre-processed or real-time data of the vehicular network to the newly introduced services despite the disconnection periods of vehicles.", "venue": "IFIP/IEEE Symposium on Integrated Network Management", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-05-17", "journal": {"name": "2021 IFIP/IEEE International Symposium on Integrated Network Management (IM)", "pages": "998-1003"}, "authors": [{"authorId": "2340570", "name": "Muhammad Afaq"}, {"authorId": "145116865", "name": "M. Saqib"}, {"authorId": "2151893", "name": "Wang-Cheol Song"}], "citations": [{"paperId": "8b98ab4bbd671b55deb31bfded827d806e6cad82", "title": "Moving Microgrid Hierarchical Control to an SDN-Based Kubernetes Cluster: A Framework for Reliable and Flexible Energy Distribution"}, {"paperId": "8d3ce7e2e774e5c51d6ee175ccacb7485f882823", "title": "Reinforcement Learning-based Virtual Sensors Provision in Internet of Vehicles (IoV)"}, {"paperId": "a383a34a1500d537d852c3a8d035cf575e3c020c", "title": "Fast Optimal Resource Allocation for Resilient Service Coordination in an NFV- Enabled Internet-of- Things System"}, {"paperId": "939d29aecf9db0f0494ff94bdeab07590b5dc014", "title": "The 5G-IANA platform: Bringing far-edge resources and ML potential to the disposal of automotive third parties"}, {"paperId": "9f85a196f82eb121340839ce011ec48f4d3d9abc", "title": "Optimizing Traffic Engineering for Resilient Services in NFV-Based Connected Autonomous Vehicles"}]}
