{"paperId": "ae2131b4c689f5ac9d9bc7256ce2f3daefe3212f", "publicationVenue": {"id": "e574da12-4e4c-4b78-a203-ae3719c0c4f7", "name": "Annual International Computer Software and Applications Conference", "type": "conference", "alternate_names": ["Comput Softw Appl Conf", "Annu Int Comput Softw Appl Conf", "COMPSAC Work", "Computer Software and Applications Conference", "COMPSAC Workshops", "COMPSAC"], "url": "http://www.wikicfp.com/cfp/program?id=548"}, "title": "BDViewer — A Web-Based Big Data Processing and Visualization Tool", "abstract": "The size of data sets being collected and analyzed in data science field is growing rapidly, making traditional big data processing solution prohibitively expensive. Especially when the data sets are too large, distributed techniques are inevitable even for simple embarrassing parallel jobs. However, distributed computing is still inaccessible to a large number of users. For example, many average users are still struggling with complex cluster management and configuration tools[24] even just for summing up a group of numbers in a large data file. In this paper, we present BDViewer, a web-based big data processing and visualizing tool. BDViewer uses JavaScript plugins to enable users to view, process and visualize their large data files just through a web browser. By just clicking a button, users can open a large data file online and view the file contents immediately no matter how large the file is. In the back-end, BDViewer is built on a virtual private cloud system. Users' operations in a web browser are converted into map-reduce jobs and MPI tasks that are executed on the cloud. At the end of this paper, some experiments are carried out, which demonstrate BDViewer's effectiveness and ease of use.", "venue": "Annual International Computer Software and Applications Conference", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2018-07-01", "journal": {"name": "2018 IEEE 42nd Annual Computer Software and Applications Conference (COMPSAC)", "pages": "522-527", "volume": "01"}, "authors": [{"authorId": "2152885395", "name": "Yan Li"}, {"authorId": "4955168", "name": "Junming Ma"}, {"authorId": "143706345", "name": "Bo An"}, {"authorId": "1761268", "name": "Donggang Cao"}], "citations": [{"paperId": "be733d2627b308247bd30112f18f0e796d65a363", "title": "Big Seismic Data Visualization on Cloud: A Case Study Collaborating with Industry"}, {"paperId": "04c74d0a8ace1f96260f1ffbb3feb3cb01c6988a", "title": "2018 IEEE 42nd Annual Computer Software and Applications Conference"}]}
