{"paperId": "ae29ee732e97479165d5f5ec9956272d0aab1209", "publicationVenue": {"id": "cbd94920-595d-438f-9d0b-17193b8fab85", "name": "Journal of Information Technology in Construction", "type": "journal", "alternate_names": ["J Inf Technol Constr"], "issn": "1874-4753", "url": "https://www.itcon.org/"}, "title": "Information and Communication Technologies applied to intelligent buildings: a review", "abstract": "In this paper an insight on innovative implementation strategies and operative Information and Communication Technologies (ICT) regarding Intelligent Buildings (IBs) is provided. Data-driven knowledge extraction and re-usage can be a valid source of information to study the whole building life-cycle as a process to optimize. Today, new challenges can be provided thanks to ICT and Internet of Things (IoT) paradigms that allow big data to be stored, processed and analysed. This approach is still not deeply applied in construction engineering fields. In order to analyse the related literature, first a framework to describe the IB technological environment is proposed. Second, the literature is reviewed according to this framework and focusing on ICT tools and implementation aspects for the whole building life-cycle. To the best of our knowledge, there isn't yet a survey focusing on innovative operative tools adopted in the development of the ICT technological layer of IB. The reviewed literature is discussed by identifying implemented technologies and related ICT tools and classifying applications in building life-cycle. Finally, critical aspects are singled out and opportunities for future developments in the field of IBs are outlined.", "venue": "Journal of Information Technology in Construction", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-07-26", "journal": {"name": "J. Inf. Technol. Constr.", "pages": "458-488", "volume": "26"}, "authors": [{"authorId": "1994525676", "name": "F. Parisi"}, {"authorId": "145223101", "name": "M. P. Fanti"}, {"authorId": "1780171", "name": "A. M. Mangini"}], "citations": [{"paperId": "c1f4d4bc2594791a18844e5c87970b732da1033b", "title": "Optimized machine learning models for prediction of effective stiffness of rectangular reinforced concrete column sections"}, {"paperId": "53f320918ca1cbae156fdccdee1b990528cd8c78", "title": "Influence of pre-processing methods on the automatic priority prediction of native-language end-users’ maintenance requests through machine learning methods"}, {"paperId": "31500b1467c5b35c4e2ccee71fe135ab54ca9b1d", "title": "Machine learning-based energy use prediction for the smart building energy management system"}, {"paperId": "c8d31a4f963c2776a296629ff4db42020d2f8b5a", "title": "A new concept for large additive manufacturing in construction: tower crane-based 3D printing controlled by deep reinforcement learning"}, {"paperId": "2e48cbbb48b64f89665e9aed1568e6dcd1de183a", "title": "Review of Big Data Integration in Construction Industry Digitalization"}, {"paperId": "92cadc4f17923aaca6282f9f4acd7b30f3696c76", "title": "SPECIAL ISSUE EDITORIAL: Next Generation ICTs - How distant is ubiquitous computing?"}, {"paperId": "ea9e191ecd2b93ba47662d24301e26ee53816b81", "title": "AI-driven image generation for enhancing design in digital fabrication: urban furnishings in historic city centres"}]}
