{"paperId": "ae503b3f824e5e237801705a313702ccef970600", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "A Taxonomy of Machine Learning Clustering Algorithms, Challenges, and Future Realms", "abstract": "In the field of data mining, clustering has shown to be an important technique. Numerous clustering methods have been devised and put into practice, and most of them locate high-quality or optimum clustering outcomes in the field of computer science, data science, statistics, pattern recognition, artificial intelligence, and machine learning. This research provides a modern, thorough review of both classic and cutting-edge clustering methods. The taxonomy of clustering is presented in this review from an applied angle and the compression of some hierarchical and partitional clustering algorithms with various parameters. We also discuss the open challenges in clustering such as computational complexity, refinement of clusters, speed of convergence, data dimensionality, effectiveness and scalability, data object representation, evaluation measures, data streams, and knowledge extraction; scientists and professionals alike will be able to use it as a benchmark as they strive to advance the state-of-the-art in clustering techniques.", "venue": "Applied Sciences", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2023-03-09", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "2166605407", "name": "Shahneela Pitafi"}, {"authorId": "2184688350", "name": "Toni Anwar"}, {"authorId": "152777137", "name": "Zubair Sharif"}], "citations": [{"paperId": "13bc7dcad6e7a1bb175565ff559ab940b7842102", "title": "Human Activity Recognition from Sensor Data using Machine Learning"}, {"paperId": "8e7cc545f04520aa08c096e74ef642126ca2cf57", "title": "Semi-supervised fuzzy C means based on membership integration mechanism and its application in brain infarction lesion segmentation in DWI images"}, {"paperId": "acc0e9e34da96aa381d20588b8c9a3935c473c57", "title": "Performance Evaluation and Comparison of Clustering Algorithms for Social Network Dataset"}, {"paperId": "1c3cbc675839c720507914e95716fecc2fda9f21", "title": "STPID-Model : A novel approach to Perimeter Intrusion Detection"}, {"paperId": "d4fff1aff46d313ae170fceeafbaeae186002b44", "title": "Low Power Consumption in Capacitive Touch Screen Panel by changing scanning rate using equation and AI based proposal"}, {"paperId": "790c436468e77f7d47e7b04f1d8de93e962dfb75", "title": "Anomaly Detection in Binary Time Series Data: An unsupervised Machine Learning Approach for Condition Monitoring"}, {"paperId": "6a5d05a5636ee8df95a5b8885e41def6bfb6363b", "title": "Revolutionizing Perimeter Intrusion Detection: A Machine Learning-Driven Approach With Curated Dataset Generation for Enhanced Security"}, {"paperId": "a6f4a2532ea6b2f3a6024134603a4baabb021349", "title": "Functional compounds rapid screening strategy for health food function-formula-component integrated quality control by syndrome correlation-network analysis"}]}
