{"paperId": "ae5343672af8a27213eb59c534e208625359beeb", "publicationVenue": {"id": "657a4bec-9a11-40fb-acfe-243d7fb993ae", "name": "Frontiers in Earth Science", "type": "journal", "alternate_names": ["Frontiers of Earth Science", "Frontiers in Earth Sciences", "Front Earth Sci"], "issn": "2296-6463", "alternate_issns": ["1863-4621", "2095-0195"], "url": "http://www.frontiersin.org/Earth_Science", "alternate_urls": ["http://journal.hep.com.cn/fesci/EN/2095-0195/current.shtml", "http://www.frontiersin.org/Journal/Archive.aspx?artId=0&f=19&name=Earth_Science", "https://www.frontiersin.org/journals/earth-science", "https://www.springer.com/series/7066"]}, "title": "Modeling rules of regional flash flood susceptibility prediction using different machine learning models", "abstract": "The prediction performance of several machine learning models for regional flash flood susceptibility is characterized by variability and regionality. Four typical machine learning models, including multilayer perceptron (MLP), logistic regression (LR), support vector machine (SVM), and random forest (RF), are proposed to carry out flash flood susceptibility modeling in order to investigate the modeling rules of different machine learning models in predicting flash flood susceptibility. The original data of 14 environmental factors, such as elevation, slope, aspect, gully density, and highway density, are chosen as input variables for the MLP, LR, SVM, and RF models in order to estimate and map the distribution of the flash flood susceptibility index in Longnan County, Jiangxi Province, China. Finally, the prediction performance of various models and modeling rules is evaluated using the ROC curve and the susceptibility index distribution features. The findings show that: 1) Machine learning models can accurately assess the region’s vulnerability to flash floods. The MLP, LR, SVM, and RF models all predict susceptibility very well. 2) The MLP (AUC=0.973, MV=0.1017, SD=0.2627) model has the best prediction performance for flash flood susceptibility, followed by the SVM (AUC=0.964, MV=0.1090, SD=0.2561) and RF (AUC=0.975, MV=0.2041, SD=0.1943) models, and the LR (AUC=0.882, MV=0.2613, SD=0.2913) model. 3) To a large extent, environmental factors such as elevation, gully density, and population density influence flash flood susceptibility.", "venue": "Frontiers in Earth Science", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-01-17", "journal": {"volume": "11"}, "authors": [{"authorId": "2109063636", "name": "Yuguo Chen"}, {"authorId": "2155543247", "name": "Xinyi Zhang"}, {"authorId": "4576608", "name": "Kejun Yang"}, {"authorId": "2200995266", "name": "Shiyi Zeng"}, {"authorId": "145215423", "name": "Anyu Hong"}], "citations": [{"paperId": "0c0f798e32cf325e347b3627c83d6a9b4397023c", "title": "Urban waterlogging susceptibility assessment based on hybrid ensemble machine learning models: A case study in the metropolitan area in Beijing, China"}, {"paperId": "0bb02dd1032ad3d45ec6004edc43a27c9ceb7bef", "title": "Modelling on assessment of flood risk susceptibility at the Jia Bharali River basin in Eastern Himalayas by integrating multicollinearity tests and geospatial techniques"}]}
