{"paperId": "ae5645fb9cbf0ee48e270cf415452a759be46394", "publicationVenue": {"id": "6401bb05-050b-4beb-8824-066cb2938eb4", "name": "Mathematical Problems in Engineering", "type": "journal", "alternate_names": ["Math Probl Eng"], "issn": "1024-123X", "url": "http://www.gbhap-us.com/journals/238/238-top.htm", "alternate_urls": ["https://www.hindawi.com/journals/mpe/"]}, "title": "Influence of the Inherent Safety Principles on Quantitative Risk in Process Industry: Application of Genetic Algorithm Process Optimization (GAPO)", "abstract": "Inherent safety (IS) refers to a set of measures that enhance the safety level of processes and equipment, rendering additional equipment and/or add-ons. The early design phase of processes is suited best for implementation of IS strategies as some of such strategies either are impossible to be implemented at the operation phase or substantially increase costs. The purpose of this study is to present a new approach called genetic algorithm process optimization (GAPO), by which processes can be made inherently safer even at the operation phase. This study simulates the IS principle, assessing its impact on quantitative risk and the possible consequences of process incidents identified by Hazard and Operation Study (HAZOP). The principle of intensification was simulated through GAPO, and feasibility of implementation was approved by HYSYS. Moreover, the integrated inherent safety index (I2SI) was used to evaluate and quantify the level of IS following implementation of GAPO compared to the initial design. Our result shows that GAPO substantially reduced the risk of consequences and quantitative risks and concomitantly improved the I2SI. The proposed GAPO can be applied to process operation as an approach to enhance IS at no cost and without decrease in production.", "venue": "Mathematical Problems in Engineering", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-05-07", "journal": {"name": "Mathematical Problems in Engineering", "pages": "1-11", "volume": "2021"}, "authors": [{"authorId": "35646912", "name": "M. Jahangiri"}, {"authorId": "2121783475", "name": "Abolfazl Moghadasi"}, {"authorId": "3722813", "name": "M. Kamalinia"}, {"authorId": "2121769617", "name": "Farid Sadeghianjahromi"}, {"authorId": "12933935", "name": "Sean Banaee"}], "citations": [{"paperId": "84116a9ce4f9de9b55cccac491e452da6292ef77", "title": "Application of Interactive Genetic Algorithm in Fractal Art Pattern Design System"}, {"paperId": "57ad6ee688fee4e6648e8dd91394a261b8de74f0", "title": "Time Series Optimal Capacity Determination Model of Regional Comprehensive Energy Considering Multi Energy Complementarity and Load Flexibility"}, {"paperId": "194b895673f8054fa60863c98e548d64cc27c584", "title": "Inherently safer process route ranking index (ISPRRI) for sustainable process design"}]}
