{"paperId": "ae7108dfd48ce065c20f74b6ef8221cb27bd27bb", "publicationVenue": {"id": "eedb1527-2aee-4def-bdb2-20fca9c12c3d", "name": "Risks", "issn": "2227-9091", "alternate_issns": ["2261-611X"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-317985", "alternate_urls": ["https://www.mdpi.com/journal/risks", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-317985", "https://risks.hypotheses.org/"]}, "title": "An Overview of Security Breach Probability Models", "abstract": "Cybersecurity breach probability functions describe how cybersecurity investments impact the actual vulnerability to cyberattacks through the probability of success of the attack. They essentially use mathematical models to make cyber-risk management choices. This paper provides an overview of the breach probability models that appear in the literature. For each of them, the form of the mathematical functions and their properties are described. The models exhibit a wide variety of functional relationships between breach probability and investments, including linear, concave, convex, and a mixture of the latter two. Each model describes a parametric family, with some models have a single parameter, and others have two. A sensitivity analysis completes the overview to identify the impact of the model parameters: the estimation of the parameters which have a larger influence on the breach probability is more critical and deserves greater attention.", "venue": "Risks", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-11-17", "journal": {"name": "Risks"}, "authors": [{"authorId": "66906223", "name": "A. Mazzoccoli"}, {"authorId": "1754126", "name": "M. Naldi"}], "citations": [{"paperId": "cebf12232450f7c143d76d22718a48500c339b25", "title": "Developing the Concept of Methodological Support for Designing and Assessing the Efficiency of Information Protection Systems of Standard Information Systems Considering Their Vulnerabilities"}, {"paperId": "235b3137a4353b2c7f6281c1fd1e6fbb22de26ff", "title": "Optimal Cyber Security Investment in a Mixed Risk Management Framework: Examining the Role of Cyber Insurance and Expenditure Analysis"}, {"paperId": "e55ac04e78488c3bbd0043879b05d355d54c8a7e", "title": "Pricing cyber-insurance for systems via maturity models"}]}
