{"paperId": "ae846b1ba5606d63faef3234ea2cd384a0bcbf93", "publicationVenue": {"id": "cdc83875-a82d-445c-b097-cbe91afe99a8", "name": "Conference on Fairness, Accountability and Transparency", "type": "conference", "alternate_names": ["FAccT", "Conf Fairness Account Transpar"], "url": "https://facctconference.org/"}, "title": "The Dimensions of Data Labor: A Road Map for Researchers, Activists, and Policymakers to Empower Data Producers", "abstract": "Many recent technological advances (e.g. ChatGPT and search engines) are possible only because of massive amounts of user-generated data produced through user interactions with computing systems or scraped from the web (e.g. behavior logs, user-generated content, and artwork). However, data producers have little say in what data is captured, how it is used, or who it benefits. Organizations with the ability to access and process this data, e.g. OpenAI and Google, possess immense power in shaping the technology landscape. By synthesizing related literature that reconceptualizes the production of data for computing as “data labor”, we outline opportunities for researchers, policymakers, and activists to empower data producers in their relationship with tech companies, e.g advocating for transparency about data reuse, creating feedback channels between data producers and companies, and potentially developing mechanisms to share data’s revenue more broadly. In doing so, we characterize data labor with six important dimensions - legibility, end-use awareness, collaboration requirement, openness, replaceability, and livelihood overlap - based on the parallels between data labor and various other types of labor in the computing literature.", "venue": "Conference on Fairness, Accountability and Transparency", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2023-05-22", "journal": {"name": "Proceedings of the 2023 ACM Conference on Fairness, Accountability, and Transparency"}, "authors": [{"authorId": "47892132", "name": "Hanlin Li"}, {"authorId": "2065694473", "name": "Nicholas Vincent"}, {"authorId": "2510840", "name": "Stevie Chancellor"}, {"authorId": "32980371", "name": "Brent J. Hecht"}], "citations": [{"paperId": "09e16dab5409759208319faa0799f20b9290d885", "title": "A Canary in the AI Coal Mine: American Jews May Be Disproportionately Harmed by Intellectual Property Dispossession in Large Language Model Training"}, {"paperId": "0dde3b48a6e99be4e533a80862a794ddf663df21", "title": "An Alternative to Regulation: The Case for Public AI"}, {"paperId": "3aaa6846d927a14b2aaeddccfef7c5419911fff7", "title": "Benefits and Harms of Large Language Models in Digital Mental Health"}, {"paperId": "7bd930c5be35c77362e3af1bd2b9817985aa582f", "title": "A Multidisciplinary Lens of Bias in Hate Speech"}, {"paperId": "95a4a3a4da6497858f11a251306f587eb130ea64", "title": "Decoding The Digital Fuku: Deciphering Colonial Legacies to Critically Assess ChatGPT in Dominican Education"}, {"paperId": "567dd229e4dbb24d5cca06b81cf132824b97d599", "title": "Are Large Language Models a Threat to Digital Public Goods? Evidence from Activity on Stack Overflow"}, {"paperId": "2c171fe79659f511f7ee7d1eea4750e159c2b110", "title": "Fair Allocation in Crowd-Sourced Systems"}]}
