{"paperId": "ae88d84b2fa96f6fc50b3d142f9cbb34023fdadb", "publicationVenue": {"id": "142bf32e-1d3a-4f1d-87f4-9ec614f5d132", "name": "Geomatics", "issn": "2673-7418", "url": "https://www.mdpi.com/journal/geomatics"}, "title": "GIS Open-Source Plugins Development: A 10-Year Bibliometric Analysis on Scientific Literature", "abstract": "The advent of Geographical Information Systems (GIS) has changed the way people think and interact with the world. The main objectives of this paper are: (i) to provide an overview of 10 years (2010–2020) regarding the creation/development of GIS open-source applications; and (ii) to evaluate the GIS open-source plugins for environmental science. In the first objective, we evaluate the publications regarding the development of GIS open-source geospatial software in the last 10 years, considering desktop, web GIS and mobile applications, so that we can analyze the impact of this type of application for different research areas. In the second objective, we analyze the development of GIS open-source applications in the field of environmental sciences (with more focus on QGIS plugins) in the last 10 years and discuss the applicability and usability of these GIS solutions in different environmental domains. A bibliometric analysis was performed using Web of Science database and VOSViewer software. We concluded that, in general, the development of GIS open-source applications has increased in the last 10 years, especially GIS mobile applications, since the big data and Internet of Things (IoT) era, which was expected given the new advanced technologies available in every area, especially in GIS.", "venue": "Geomatics", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2021-04-28", "journal": {"name": "Geomatics", "pages": "206-245", "volume": "1"}, "authors": [{"authorId": "145919100", "name": "L. Duarte"}, {"authorId": "2550370", "name": "A. Teodoro"}], "citations": [{"paperId": "d94fd8fbfa75bcb1772de921e40e97b5c68c8027", "title": "Introducing QAnnAGNPS - A QGIS plugin to facilitate the use of AnnAGNPS (Annualized Agricultural Nonpoint source model)"}, {"paperId": "0d81eb8ed061ad5235e6e57c9519bea7d681229f", "title": "MontObEO, Montesinho biodiversity observatory: an Earth observation tool for biodiversity conservation"}, {"paperId": "c2f63590974807e2eab9d8b1ffbcc67a2d182e84", "title": "QLSU (QGIS Linear Spectral Unmixing) Plugin: An open source linear spectral unmixing tool for hyperspectral & multispectral remote sensing imagery"}, {"paperId": "b7621173f0b9cdf09c6cc95c47f4eb9b5e7c1a6b", "title": "Space Time Cube analytics in QGIS and Python for hot spot detection"}, {"paperId": "0ed3d4c2ff2e320b1237c591d6789ac2e4f4c32a", "title": "MOBILE MAPPING SOLUTIONS FOR THE UPDATE AND MANAGEMENT OF TRAFFIC SIGNS IN A ROAD CADASTRE FREE OPEN-SOURCE GIS ARCHITECTURE"}, {"paperId": "9e794b037e48b250cbf9d90cfb195123929b2374", "title": "An extensible, plugin-based tool for modeling flow and reactive transport in water systems"}, {"paperId": "50c00632ecf2b7cdad05461f084e14b9ccae6825", "title": "Remote sensing and GIS applications in earth and environmental systems sciences"}, {"paperId": "35493a7ab4ebfba2790d37041ff08b6f6e9ea95a", "title": "An Implementation of Open Source-Based Software as a Service (SaaS) to Produce TOA and TOC Reflectance of High-Resolution KOMPSAT-3/3A Satellite Image"}, {"paperId": "ff8391596dd7eaf7a557f12189b2ea5749f879ae", "title": "Machine Learning and Pan-Sharpening of Sentinel-2 Data for Land Use Mapping in Arid Regions: A Case Study in Fayoum, Egypt"}, {"paperId": "84a390d63cc0dd840a599d77d34bc752084567ce", "title": "A collaborative GIS programming course using GitHub Classroom"}, {"paperId": "0a945821e984945fb44b409536b728a75f265479", "title": "Comparing Hydric Erosion Soil Loss Models in Rainy Mountainous and Dry Flat Regions in Portugal"}, {"paperId": "9653f7cac90d43ba640e6a2972b471941052d7d4", "title": "Spatial-temporal assessment of soil erosion using the RUSLE model in the upstream Inaouène watershed, Northern Morocco."}]}
