{"paperId": "ae92d807812cf060b349caeac0e0ca5eefd4d194", "publicationVenue": {"id": "501c1070-b5d2-4ff0-ad6f-8769a0a1e13f", "name": "Wireless Communications and Mobile Computing", "type": "journal", "alternate_names": ["Wirel Commun Mob Comput"], "issn": "1530-8669", "url": "https://www.hindawi.com/journals/wcmc/", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/15308677", "http://www.interscience.wiley.com/jpages/1530-8669/"]}, "title": "An Intelligent Energy Management Information System with Machine Learning Algorithms in Oil and Gas Industry", "abstract": "Oil and gas will continue to play an increasingly important role in global economy development and prosperity for the upcoming years. However, a fact which sometimes is ignored is that the oil and gas industry is an intensive energy-consumption industry and a major contributor to greenhouse gas emissions as well. Recently, with the arrival of the “double carbon” era, the energy-intensive production of oil and gas has caused people to pay more attention. Currently, big data technologies as well as the Internet of things (IoT) are developing at a rapid pace, and the metering infrastructure technology also shows huge advancement; oil and gas companies have built many information systems and developed many functions to acquire the energy consumption and oil production data for the aim of reducing the oil production cost via the emerging information technologies, and it turned out that these investments do improve the energy efficiency and lower oil production cost. Unfortunately, due to the different development standards, some systems store the same data with different values; so, therefore, there is a “data barrier” among these systems and somehow discount the share and analysis of these data resources. To this end, in our work, based on these rich data resources from the other information systems, we discussed an intelligent energy management information system with four machine learning algorithms to enhance the analysis of data resources over energy consumption and oil production. First, we presented the innovation of energy consumption data fusion with the method “Data Lake”; then, four different machine learning algorithms: Support Vector Machine (SVM), Linear Regression (LR), Extreme Learning Machine (ELM), and Artificial Neural Networks (ANN) are installed in the proposed system for predicting the oil and gas production and total energy consumption. In order to aggregate these data into dashboard views that help managers make decisions about operations, we also demonstrated the process of energy consumption data visualization with emerging open-source software tool ECharts. Finally, a real life application of the proposed system was summarized in case of total energy consumption prediction and the system output shows good prediction accuracy which proves the feasibility and benefits of the intelligent energy management information system.", "venue": "Wireless Communications and Mobile Computing", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-04-19", "journal": {"name": "Wireless Communications and Mobile Computing"}, "authors": [{"authorId": "2152750041", "name": "Jun Li"}, {"authorId": "2100556", "name": "Yidong Guo"}, {"authorId": "2152011242", "name": "Zhanbao Fu"}, {"authorId": "2156004731", "name": "X. Zhang"}, {"authorId": "2052211347", "name": "Fei Shen"}], "citations": [{"paperId": "befa621e947ba527648e7e349e9af06a5d9412d5", "title": "Data Science and Machine Learning Applications in Technology and Energy Management"}, {"paperId": "1fa8c86d1fe0649dad1b06c4ee93d293a18e5754", "title": "Intelligent Control System for Efficient Energy Management in the Oil and Gas Industry"}]}
