{"paperId": "aea7ac29e76b410662b4b34dc95775b9a97585c7", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Evaluation of User Reactions and Verification of the Authenticity of the User’s Identity during a Long Web Survey", "abstract": "Web surveys are very popular in the Internet space. Web surveys are widely incorporated for gathering customer opinion about Internet services, for sociological and psychological research, and as part of the knowledge testing systems in electronic learning. When conducting web surveys, one of the issues to consider is the respondents’ authenticity throughout the entire survey process. We took 20,000 responses to an online questionnaire as experimental data. The survey took about 45 min on average. We did not take into account the given answers; we only considered the response time to the first question on each page of the survey interface, that is, only the users’ reaction time was taken into account. Data analysis showed that respondents get used to the interface elements and want to finish a long survey as soon as possible, which leads to quicker reactions. Based on the data, we built two neural network models that identify the records in which the respondent’s authenticity was violated or the respondent acted as a random clicker. The amount of data allows us to conclude that the identified dependencies are widely applicable.", "venue": "Applied Sciences", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2021-11-22", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "2228832", "name": "E. Nikulchev"}, {"authorId": "2055686895", "name": "Alexander Gusev"}, {"authorId": "11660134", "name": "D. Ilin"}, {"authorId": "2141872593", "name": "Nurziya Gazanova"}, {"authorId": "2090956212", "name": "S. Malykh"}], "citations": [{"paperId": "0136e8e60d72de5b7a4dcb56303d5d764b6cba09", "title": "Engagement Assessment for the Educational Web-Service Based on Largest Lyapunov Exponent Calculation for User Reaction Time Series"}]}
