{"paperId": "aed5dfba5a1452bd59dc3327ff08cb3a436b5eb5", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "The Short Video Popularity Prediction Using Internet of Things and Deep Learning", "abstract": "In order to furnish valuable insights and solutions applicable to content creators, social media platforms, academic research, and general users, this investigation integrates the Internet of Things (IoT) with deep learning regression models to examine methodologies for predicting the popularity of short videos. Within the context of cross-cultural communication, a proposed Content Popularity Rank Prediction based on the Convolutional Neural Network (CPRP-CNN) model relies exclusively on the personal attributes of the publisher and the textual characteristics of short videos to anticipate the viewership levels of short videos promptly following their release. Through simulated experiments, the model’s performance is assessed, revealing that the utilization of the Rectified Linear Unit (Relu) activation function in the CPRP-CNN model enhances accuracy by 42.2% when contrasted with the use of the sigmoid function. This enhancement is coupled with a 37.8% reduction in cross-entropy loss. Furthermore, the proposed CPRP-CNN model attains a cross-entropy of 0.692 and an accuracy of 74.7%, exhibiting superior Mean Squared Error (MSE) and Mean Absolute Error (MAE) values of 2.728 and 1.751, respectively, when compared to alternative prediction models. These outcomes signify that the amalgamation of deep learning models with fused features within the IoT context significantly ameliorates the predictive efficacy of short video popularity. The research findings contribute to the enhancement of personalized and precise short video content recommendations.", "venue": "IEEE Access", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "47508-47517", "volume": "12"}, "authors": [{"authorId": "2294315419", "name": "Zichen He"}, {"authorId": "2294516474", "name": "Danian Li"}], "citations": []}
