{"paperId": "aedd805e7ce7ec115d0adf420af9303c210b39d8", "publicationVenue": {"id": "ccd8e532-73c6-414f-bc91-271bbb2933e2", "name": "Electronics", "type": "journal", "issn": "1450-5843", "alternate_issns": ["2079-9292", "0883-4989"], "url": "http://www.electronics.etfbl.net/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-247562", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-247562", "https://www.mdpi.com/journal/electronics"]}, "title": "Big-Data Platform for Performance Monitoring of Telecom-Service-Provider Networks", "abstract": "Large telecom-service-provider networks are typically based on complex communications infrastructures comprising millions of network devices. The performance monitoring of such networks is a very demanding and challenging task. A large amount of data is collected and processed during performance monitoring to obtain information that gives insights into the current network performance. Using the obtained information, providers can efficiently detect, locate, and troubleshoot weak spots in the network and improve the overall network performance. Furthermore, the extracted information can be used for planning future network expansions and to support the determination of business-strategy decisions. However, traditional methods for processing and storing data are not applicable because of the enormous amount of collected data. Thus, big-data technologies must be used. In this paper, a big-data platform for the performance monitoring of telecom-service-provider networks is proposed. The proposed platform is capable of collecting, storing, and processing data from millions of devices. Typical challenges and problems in the development and deployment process of the platform, as well as the solutions to overcome them, are presented. The proposed platform is adjusted to HFC (Hybrid Fiber-Coaxial) network and currently operates in the real HFC network, comprising millions of users and devices.", "venue": "Electronics", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-07-16", "journal": {"name": "Electronics"}, "authors": [{"authorId": "2141736104", "name": "Milan Simakovic"}, {"authorId": "47072695", "name": "Zoran Čiča"}, {"authorId": "32502738", "name": "D. Drajić"}], "citations": [{"paperId": "ace24378f189cf87b9d6ed29ba3d3077d36fd6b9", "title": "Classification and Prediction of Sustainable Quality of Experience of Telecommunication Service Users Using Machine Learning Models"}]}
