{"paperId": "aedf19fddf7e51e096e4008fa0af1db67ef8189b", "publicationVenue": {"id": "d286fdd0-3b6c-433c-afee-87228d8e9f93", "name": "IEEE Transactions on Dependable and Secure Computing", "type": "journal", "alternate_names": ["IEEE Trans Dependable Secur Comput"], "issn": "1545-5971", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=8858"}, "title": "An Automatic Attribute-Based Access Control Policy Extraction From Access Logs", "abstract": "With the rapid advances in computing and information technologies, traditional access control models have become inadequate in terms of capturing fine-grained, and expressive security requirements of newly emerging applications. An attribute-based access control (ABAC) model provides a more flexible approach to addressing the authorization needs of complex and dynamic systems. While organizations are interested in employing newer authorization models, migrating to such models pose as a significant challenge. Many large-scale businesses need to grant authorizations to their user populations that are potentially distributed across disparate and heterogeneous computing environments. Each of these computing environments may have its own access control model. The manual development of a single policy framework for an entire organization is tedious, costly, and error-prone. In this article, we present a methodology for automatically learning ABAC policy rules from access logs of a system to simplify the policy development process. The proposed approach employs an unsupervised learning-based algorithm for detecting patterns in access logs and extracting ABAC authorization rules from these patterns. In addition, we present two policy improvement algorithms, including rule pruning and policy refinement algorithms to generate a higher quality mined policy. Finally, we implement a prototype of the proposed approach to demonstrate its feasibility.", "venue": "IEEE Transactions on Dependable and Secure Computing", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-03-16", "journal": {"name": "IEEE Transactions on Dependable and Secure Computing", "pages": "2304-2317", "volume": "19"}, "authors": [{"authorId": "1391171722", "name": "Leila Karimi"}, {"authorId": "1396368346", "name": "Maryam Aldairi"}, {"authorId": "2056083684", "name": "J. Joshi"}, {"authorId": "3094373", "name": "Mai Abdelhakim"}], "citations": [{"paperId": "6b0c38b4938c5b9455af0e211a36431aa9881c76", "title": "ABAC policy mining method based on hierarchical clustering and relationship extraction"}, {"paperId": "40bd36ea0fbc1e4e53b7a9c8cfefa0074f3e3b08", "title": "ABAC Policy Mining through Affiliation Networks and Biclique Analysis"}, {"paperId": "6e15d3b2bb626e39a784e86e631362807525b5b8", "title": "Log2Policy: An Approach to Generate Fine-Grained Access Control Rules for Microservices from Scratch"}, {"paperId": "7d4b100b4536826a8dc52be0e2c3ae149f9c7f70", "title": "Peculiarity and Diversity Measures to Evaluate Attribute-Based Access Rules"}, {"paperId": "2d09963e6c39c34ec7ef83641ec0425fad68a6b6", "title": "Leaving the Business Security Burden to LiSEA: A Low-Intervention Security Embedding Architecture for Business APIs"}, {"paperId": "4e08caac7a4af73521024523ecc36af3b7f67f80", "title": "Dynamic and Flexible Access Control for IoT-Enabled Smart Healthcare"}, {"paperId": "d1d94ef02c718ac0298f7de1ad4caa17d8ad2bd0", "title": "Dynamic access control model based on attribute reachability"}, {"paperId": "714a7787b2139de65f40647d93da53e508abdebc", "title": "Exploring the Role of Machine Learning in Enhancing Access Control Systems: A Comprehensive Review"}, {"paperId": "0c54fc436ff4787e5eda770a23749888fded2174", "title": "Computable Access Control: Embedding Access Control Rules Into Euclidean Space"}, {"paperId": "3840b18c5780c176f0915625bf20092dd4c4342c", "title": "DACP: Enforcing a dynamic access control policy in cross-domain environments"}, {"paperId": "61f4c258615c7095461dacd34e5c84b9a2029bf7", "title": "Mitigating Privilege Misuse in Access Control through Anomaly Detection"}, {"paperId": "5a520bc9c12958a26989bd39b82f5c93c376fa0a", "title": "Overview of security access control mechanisms"}, {"paperId": "9ae33eb76ee1a3c5b9139a0402c60b1c5620203e", "title": "Attribute-based access control rules supported by biclique patterns"}, {"paperId": "916bd67ba16da23b5a40c36e05af17d650385089", "title": "A Secret and Traceable Approach for Cloud Data Sharing"}, {"paperId": "d2bf3ab2355cac36d48068a015d542dc894c3d7b", "title": "Enhanced Adaptable and Distributed Access Control Decision Making Model Based on Machine Learning for Policy Conflict Resolution in BYOD Environment"}, {"paperId": "04dcbff2298f0f8c935a1ddd183bd07a341e190e", "title": "RanSAM: Randomized Search for ABAC Policy Mining"}, {"paperId": "8a378ecbd795491ac333e5cf69002264f14721d3", "title": "Securing distributed systems: A survey on access control techniques for cloud, blockchain, IoT and SDN"}, {"paperId": "d57d4d38f434825397a05217e75f9088d2093667", "title": "A Brief Survey and Implementation on AI for Intent-Driven Network"}, {"paperId": "9d5e6188db0365ac576d97ae760912444fbc4849", "title": "Supervised Learning-Based Approach Mining ABAC Rules from Existing RBAC Enabled Systems"}, {"paperId": "b5b44fdfd1b22b8666c247f6f0676f3ed33f7fc9", "title": "Machine Learning in Access Control: A Taxonomy and Survey"}, {"paperId": "84f94e627de95f033943f7d91015f13f2b335c04", "title": "Data Leakage Free ABAC Policy Construction in Multi-Cloud Collaboration"}, {"paperId": "447f8897e5aae585ac0473b120a0ea2750f3ed9b", "title": "Contemporaneous Update and Enforcement of ABAC Policies"}, {"paperId": "203713619f9bbc081909587976c923c85d5d48e3", "title": "SmartABAC: Enabling Constrained IoT Devices to Make Complex Policy-Based Access Control Decisions"}, {"paperId": "b53b1683466e7f2556385e8218c19ecbdf9df432", "title": "Image security attribute annotation technology based on CAN and WordNet"}, {"paperId": "4e1e0e12dd30c932881e74c6afe0b232feca0a9f", "title": "A Lightware Attribute Based Access Control Mechanism in Software Defined Internet of Things"}, {"paperId": "f6591fa6ba676c00f9e88f2fee822c6d4b68ed4d", "title": "PAMMELA: Policy Administration Methodology using Machine Learning"}, {"paperId": "544a7dfebb5ec911f24e8e7ee3fb3a3f0ce254f5", "title": "Adaptive ABAC Policy Learning: A Reinforcement Learning Approach"}, {"paperId": "af96a30be0b493467a7d36a85fe53afcf0e4b564", "title": "Incremental Maintenance of ABAC Policies"}, {"paperId": "865c59a189de178e2bdacd4f92b34d530bc5883b", "title": "Research on Distributed Dynamic Trusted Access Control Based on Security Subsystem"}, {"paperId": "6c6f2354b940ca3170f6c3bfa68fa63178641754", "title": "Adversarial Attacks in Machine Learning Based Access Control"}, {"paperId": "77eba404a116f8d51050c324d166b86185214337", "title": "A Fine-grained Dynamic Access Control Method for Power IoT Based on Kformer"}, {"paperId": "327efbb6866a2be8f20efaed1295e069f0bbcb4f", "title": "Access Control Policy Generation from User Stories Using Machine Learning"}, {"paperId": "0766b4d4977e09769f797a43933914099c19f72c", "title": "Evolutionary Search for Authorization Vulnerabilities in Web Applications"}, {"paperId": "d035a96322f88b33c55c1bf2cf19d9d86fbcc47b", "title": "Mining Access Control Policies from Logs via Attribute-Based Categories"}]}
