{"paperId": "aef466c86f9822cc5734c5efb205cdeb2ae4efbe", "publicationVenue": {"id": "7cc3baec-aad9-4726-872c-48bbd0deb798", "name": "Frontiers in Nutrition", "type": "journal", "alternate_names": ["Front Nutr"], "issn": "2296-861X", "url": "https://www.frontiersin.org/journals/nutrition", "alternate_urls": ["http://journal.frontiersin.org/journal/nutrition", "http://www.frontiersin.org/nutrition"]}, "title": "Dietary Patterns in Adults Following the Christian Orthodox Fasting Regime in Greece", "abstract": "Objective The aim of the study was to identify and describe the dietary patterns seen in a carefully selected sample that follows the Christian Orthodox Church (COC) fasting regime in Greece. Methods A number of 361 individuals from Northern Greece participated in this cross-sectional study. A number of 176 subjects have been fasting according to the COC recommendations since childhood and 185 non-fasters acted as the control group. Dietary data from a validated food frequency questionnaire were used to derive dietary patterns by principal component analysis (PCA). Results Three distinct dietary patterns were identified in the fasting population, the “COC Fasting,” the “Western,” and the “Traditional” dietary pattern, whereas in the non-fasting population, two dietary patterns were found the “Western” and the “Traditional.” The dietary patterns in the fasting population were associated with healthier lifestyle choices, such as abstaining from alcohol and smoke and reduced red and processed meats consumption. Conclusion Findings from the study revealed that people who adhere to the COC fasting recommendations since childhood tend to follow this dietary pattern throughout the year. By gaining insights into the energy and nutrient intake of this unique dietary pattern, public health stakeholders could promote healthier eating behaviors to prevent non-communicable chronic diseases, such as obesity and metabolic syndrome.", "venue": "Frontiers in Nutrition", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-03-07", "journal": {"name": "Frontiers in Nutrition", "volume": "9"}, "authors": [{"authorId": "50883424", "name": "A. Kokkinopoulou"}, {"authorId": "2203825", "name": "I. Pagkalos"}, {"authorId": "3648596", "name": "M. Hassapidou"}, {"authorId": "50228893", "name": "A. Kafatos"}], "citations": [{"paperId": "eb8d03e68c92f9d98ae435d116bde3cbdac0903e", "title": "Christian Orthodox Fasting as a Traditional Diet with Low Content of Refined Carbohydrates That Promotes Human Health: A Review of the Current Clinical Evidence"}, {"paperId": "1db447d6030f8dbc720d92a693ed2a4b710ad210", "title": "Religious fasting and its impacts on individual, public, and planetary health: Fasting as a “religious health asset” for a healthier, more equitable, and sustainable society"}, {"paperId": "30a9a69e6ba653cedcf141ff9ce987f9f4f5f13f", "title": "Effect of periodic religious fasting on body composition and nutrient intake in menopausal women"}, {"paperId": "c82077a699009369d50e94e7393c7f1bbac27524", "title": "Associations between Christian Orthodox Church Fasting and Adherence to the World Cancer Research Fund’s Cancer Prevention Recommendations"}]}
