{"paperId": "aef88f0ae3a2b12043e05cc27d9659cefb16d929", "publicationVenue": {"id": "fcbcaf18-8ab1-43e1-a973-604bbc7e344e", "name": "Proceedings of the VLDB Endowment", "type": "journal", "alternate_names": ["Proceedings of The Vldb Endowment", "Proc VLDB Endow", "Proc Vldb Endow"], "issn": "2150-8097", "url": "http://dl.acm.org/toc.cfm?id=J1174", "alternate_urls": ["http://portal.acm.org/toc.cfm?CFID=21632689&CFTOKEN=99329904&WantType=Affiliated%20Organizations&coll=ACM&dl=ACM&id=J1174&idx=J1174&part=affil&title=VLDB%20Endowment&type=periodical"]}, "title": "Enabling Data Science for the Majority", "abstract": "Despite great strides in the generation, collection, and processing of data at scale, data science is still extremely inconvenient for the vast majority of the population. The driving goal of our research, over the past half decade, has been to make it easy for individuals and teams—regardless of programming or analysis expertise—manage, analyze, make sense of, and draw insights from large datasets. In this article, we reﬂect on a comprehensive suite of tools that we’ve been building to empower everyone to perform data science more efﬁciently and effortlessly, including D ATA S PREAD , a scalable sp-readsheet tool that combines the beneﬁts of spreadsheets and databases, and Z EN V ISAGE , a visual exploration tool that accelerates the discovery of trends or patterns. Our tools have been developed in collaboration with experts in various disciplines, including neuroscience, battery science, genomics, astrophysics, and ad analytics. We will discuss some of the key technical challenges underlying the development of these tools, and how we addressed them, drawing from ideas in multiple disciplines. In the process, we will outline a research agenda for tool development to empower every-one to tap into the hidden potential in their datasets at scale.", "venue": "Proceedings of the VLDB Endowment", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-08-01", "journal": {"name": "Proc. VLDB Endow.", "pages": "2309-2322", "volume": "12"}, "authors": [{"authorId": "145592539", "name": "Aditya G. Parameswaran"}], "citations": [{"paperId": "14d7f1f68c17c4fde68679f40d035cbb011cfc7c", "title": "Synthesizing analytical SQL queries from computation demonstration"}, {"paperId": "c5781928f86ea51ca3d1cf21fe437dc0fe7c0a5e", "title": "Semantics and Anomaly Preserving Sampling Strategy for Large-Scale Time Series Data"}, {"paperId": "4cb878fd829dc35b1c22840ad817ec1ca762f595", "title": "Self-Service Analytics and the Processing of Hydrocarbons"}, {"paperId": "8f9a53c8f9625e81fc74988ed8c3988c453e5645", "title": "Designing Interactive Transfer Learning Tools for ML Non-Experts"}, {"paperId": "cd0cf4b573a461ad70797b703ed04d6eb43e5053", "title": "Quantitative Evaluations on Saliency Methods: An Experimental Study"}, {"paperId": "77647c1c54cb0c8ae9ecf9f32c9b8c8806921998", "title": "Benchmarking Spreadsheet Systems"}, {"paperId": "a3008455cdfd1f18139d4357c1b95e24f3e2f272", "title": "Vertical Data Mining from Relational Data and Its Application to COVID-19 Data"}, {"paperId": "e7f7e5f9a31c301b42431b776902e95a9b76d5e7", "title": "Big Data Computing and Mining in a Smart World"}]}
