{"paperId": "af133cec689566543c78ebc15a0dd82f734d03c5", "publicationVenue": {"id": "e7c556b0-162f-4c48-9d25-fe3c141f984e", "name": "Big Data and Cognitive Computing", "alternate_names": ["Big Data Cogn Comput"], "issn": "2504-2289", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-1077183", "alternate_urls": ["https://www.mdpi.com/journal/BDCC", "https://www.mdpi.com/journal/BDCC/about", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-1077183"]}, "title": "Explore Big Data Analytics Applications and Opportunities: A Review", "abstract": "Big data applications and analytics are vital in proposing ultimate strategic decisions. The existing literature emphasizes that big data applications and analytics can empower those who apply Big Data Analytics during the COVID-19 pandemic. This paper reviews the existing literature specializing in big data applications pre and peri-COVID-19. A comparison between Pre and Peri of the pandemic for using Big Data applications is presented. The comparison is expanded to four highly recognized industry fields: Healthcare, Education, Transportation, and Banking. A discussion on the effectiveness of the four major types of data analytics across the mentioned industries is highlighted. Hence, this paper provides an illustrative description of the importance of big data applications in the era of COVID-19, as well as aligning the applications to their relevant big data analytics models. This review paper concludes that applying the ultimate big data applications and their associated data analytics models can harness the significant limitations faced by organizations during one of the most fateful pandemics worldwide. Future work will conduct a systematic literature review and a comparative analysis of the existing Big Data Systems and models. Moreover, future work will investigate the critical challenges of Big Data Analytics and applications during the COVID-19 pandemic.", "venue": "Big Data and Cognitive Computing", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-12-14", "journal": {"name": "Big Data Cogn. Comput.", "pages": "157", "volume": "6"}, "authors": [{"authorId": "1411240479", "name": "Zaher Ali Al-Sai"}, {"authorId": "145903026", "name": "M. Husin"}, {"authorId": "1402933401", "name": "Sharifah Mashita Syed-Mohamad"}, {"authorId": "2196547132", "name": "Rasha Moh’d Sadeq Abdin"}, {"authorId": "1410968589", "name": "N. Damer"}, {"authorId": "7833679", "name": "L. Abualigah"}, {"authorId": "2152274275", "name": "A. Gandomi"}], "citations": [{"paperId": "21d270db34128e44c61393c6ce05e59d6399d090", "title": "-Unveiling the Power of Big Data: A Comprehensive Review of its Role in the Banking Sector"}, {"paperId": "efa4d296e8b3fabe00714d24fbcb5eadb9961a43", "title": "Evolution toward intelligent communications: Impact of deep learning applications on the future of 6G technology"}, {"paperId": "e38281ae22546c84550c3e0ad7b4bc543b774a27", "title": "Data Visualization Analysis for Job Recruitment Based on Big Data"}, {"paperId": "22598eb2d4bb7db75a5e2c03d38fbd5d18829129", "title": "ВИКОРИСТАННЯ BIG DATA ДЛЯ ОПТИМІЗАЦІЇ ЕКОНОМІЧНИХ ПРОЦЕСІВ У ЦИФРОВУ ЕПОХУ"}, {"paperId": "bde6a203624a8b8ef731df19f69850d6798ce5a7", "title": "A New Big Data Processing Framework for the Online Roadshow"}, {"paperId": "90f81e901b18612d528aad6c891a435ce098e70c", "title": "Enhancing Digital Health Services with Big Data Analytics"}, {"paperId": "ea574c0c239da21eaa4bc2556cf3bf8320deaad1", "title": "Vietnamese enterprises’ considerations of big data and analytics implementation post-COVID-19 pandemic"}, {"paperId": "75f9104fb4458a04c18ffdb9ff0ad301750c56fb", "title": "Analysis of the feasibility and advantages of using big data technology for English translation"}, {"paperId": "e08c8cc0070235afa2ca98c123cdf45aaf550d21", "title": "Marketing Strategies in the Development of the Halal Products and Services Industry"}, {"paperId": "0646075ba258b88e19bde408a54834e3add55e99", "title": "Perspectives on Big Data, Cloud-Based Data Analysis and Machine Learning Systems"}, {"paperId": "d440187180db338813b1707849a6ba9b83a64135", "title": "USING BIG DATA TO OPTIMIZE ECONOMIC PROCESSES IN THE DIGITAL AGE"}, {"paperId": "f49d3d60ca4b4f586c79719b7cb6ff3b9532f6e9", "title": "An ML-extended conceptual framework for implementing temporal big data analytics in organizations to support their agility"}]}
