{"paperId": "af1a16c213d7637dcace4b843710cfd2b0896cea", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Spatial Computing Opportunities in Biomedical Decision Support: The Atlas-EHR Vision", "abstract": "We consider the problem of reducing the time needed by healthcare professionals to understand patient medical history via the next generation of biomedical decision support. This problem is societally important because it has the potential to improve healthcare quality and patient outcomes. However, navigating electronic health records is challenging due to the high patient-doctor ratios, potentially long medical histories, the urgency of treatment for some medical conditions, and patient variability. The current electronic health record systems provides only a longitudinal view of patient medical history, which is time-consuming to browse, and doctors often need to engage nurses, residents, and others for initial analysis. To overcome this limitation, we envision an alternative spatial representation of patients' histories (e.g., electronic health records (EHRs)) and other biomedical data in the form of Atlas-EHR. Just like Google Maps allows a global, national, regional, and local view, the Atlas-EHR may start with an overview of the patient's anatomy and history before drilling down to spatially anatomical sub-systems, their individual components, or sub-components. Atlas-EHR presents a compelling opportunity for spatial computing since healthcare is almost a fifth of the US economy. However, the traditional spatial computing designed for geographic use cases (e.g., navigation, land-surveys, mapping) faces many hurdles in the biomedical domain. This paper presents a number of open research questions under this theme in five broad areas of spatial computing.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-05-09", "journal": {"name": "ArXiv", "volume": "abs/2305.09675"}, "authors": [{"authorId": "1752816781", "name": "Majid Farhadloo"}, {"authorId": "2109374399", "name": "Arun Sharma"}, {"authorId": "145072875", "name": "S. Shekhar"}, {"authorId": "2080524", "name": "S. Markovic"}], "citations": [{"paperId": "9b565c4e872db8583100cc31d0ba8bb23e9bfe04", "title": "Towards Spatially-Lucid AI Classification in Non-Euclidean Space: An Application for MxIF Oncology Data"}, {"paperId": "d4d4b6525e8525d91ffb047f8ba9e80c08297a26", "title": "Spatial Computing: Concept, Applications, Challenges and Future Directions"}]}
