{"paperId": "af225b810dfc8a90eb07c8f225dbf530fbb7c1dd", "publicationVenue": {"id": "e7c556b0-162f-4c48-9d25-fe3c141f984e", "name": "Big Data and Cognitive Computing", "alternate_names": ["Big Data Cogn Comput"], "issn": "2504-2289", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-1077183", "alternate_urls": ["https://www.mdpi.com/journal/BDCC", "https://www.mdpi.com/journal/BDCC/about", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-1077183"]}, "title": "MOBDA: Microservice-Oriented Big Data Architecture for Smart City Transport Systems", "abstract": "Highly populated cities depend highly on intelligent transportation systems (ITSs) for reliable and efficient resource utilization and traffic management. Current transportation systems struggle to meet different stakeholder expectations while trying their best to optimize resources in providing various transport services. This paper proposes a Microservice-Oriented Big Data Architecture (MOBDA) incorporating data processing techniques, such as predictive modelling for achieving smart transportation and analytics microservices required towards smart cities of the future. We postulate key transportation metrics applied on various sources of transportation data to serve this objective. A novel hybrid architecture is proposed to combine stream processing and batch processing of big data for a smart computation of microservice-oriented transportation metrics that can serve the different needs of stakeholders. Development of such an architecture for smart transportation and analytics will improve the predictability of transport supply for transport providers and transport authority as well as enhance consumer satisfaction during peak periods.", "venue": "Big Data and Cognitive Computing", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-07-09", "journal": {"name": "Big Data Cogn. Comput.", "pages": "17", "volume": "4"}, "authors": [{"authorId": "1915210", "name": "S. P. R. Asaithambi"}, {"authorId": "114793316", "name": "R. Venkatraman"}, {"authorId": "145710905", "name": "S. Venkatraman"}], "citations": [{"paperId": "dacba3106e3219bc548ec04ab9d357a28c4f419d", "title": "Role of IoT technologies in big data management systems: A review and Smart Grid case study"}, {"paperId": "d93afed9d1867ac5618a45a0279591f349b166f6", "title": "Predicting Crowdedness Level of the Mass Rapid Transit (MRT) Platform Using Big Data Framework: A Case Study in Singapore"}, {"paperId": "e0be7273f7dfd13b143805225a0a6bca0bf4f778", "title": "A Network Synthesis and Analytics Pipeline with Applications to Sustainable Energy in Smart Grid"}, {"paperId": "55c5e24295ccb3898822cb3e65524e1ed0650c7c", "title": "CCIR: An Architecture for Collecting and Storing Connnected Corridor Infrastructure and Mobility Data"}, {"paperId": "19310a57ee8ec870c157dc3e2bf015d36216230b", "title": "Multi-graph Spatio-temporal Graph Convolutional Network for Traffic Flow Prediction"}, {"paperId": "336718b69a34a3e77bcf318135d930e9835d5b9b", "title": "Smart Mobility with Big Data: Approaches, Applications, and Challenges"}, {"paperId": "08ce91d76ced3560d4c5799c8400f36f96abc332", "title": "Modular and Extensible Pipelines for Residential Energy Demand Modeling and Simulation"}, {"paperId": "126c0bf491c774cb458cc15b6a7006ceae2d8aee", "title": "An Enhanced Cloud-Native Deep Learning Pipeline for Network Traffic Classification"}, {"paperId": "9bcb04e04c3015e915f68cebf63b83b17c4fbab4", "title": "Innovative On-demand Public Transportation in Sofia - an Overview of the Algorithmic Tasks"}, {"paperId": "1375336390e820ac0ea4ed2535c3384ac17fa030", "title": "Cloud assisted Internet of things intelligent transportation system and the traffic control system in the smart city"}, {"paperId": "0483eb8cca8c67b988b02e369d1998891f481a91", "title": "A Complete Software Stack for IoT Time-Series Analysis that Combines Semantics and Machine Learning—Lessons Learned from the Dyversify Project"}, {"paperId": "d807c8486e329f9e728f78332016110142d210fa", "title": "Big Data For Smart City: An Advance Analytical Review"}, {"paperId": "fe8defd9eae0f788d1210231e669fd0f95c4d922", "title": "Examining the Interplay Between Big Data and Microservices - A Bibliometric Review"}, {"paperId": "03d12d332eb793d032bca60c5dc702281d41115f", "title": "Risk management in sustainable smart cities governance: A TOE framework"}, {"paperId": "1b22608dc4071f0abc7a426fd40d09b6cf8ff3f4", "title": "A Containerized Integrated Fast IoT Platform for Low Energy Power Management"}, {"paperId": "508b40d99d5cdf1b81904200183734220152a845", "title": "An Adaptable Big Data Value Chain Framework for End-to-End Big Data Monetization"}, {"paperId": "94a299129bdaf9d3d3216ce7c731ed1c6875b47d", "title": "Construction of Analytical Models for Driving Energy Consumption of Electric Buses through Machine Learning"}, {"paperId": "33ab4de7852e3a02b44b9f8f6cc20be13924a94a", "title": "Computational Framework for Analytical Operation in Intelligent Transportation System using Big Data"}, {"paperId": "55ea4f08b3b2d5b82d47bb8b8512aebf0b30c676", "title": "A Big Data Stream-Driven Risk Recognition Approach for Hospital Accounting Management Systems"}, {"paperId": "7fb1f0bb7bf8f691fac99d03f998a07366565bea", "title": "Predicting Travel Times for On-demand Public Transport in Sofia"}, {"paperId": "09d38cd92ca68c4ccfd2985a3a31911d6e6b513a", "title": "Microservices for Data Analytics in IoT Applications: Current Solutions, Open Challenges, and Future Research Directions"}, {"paperId": "a3d6f329867cf45458ce64d8ec827550e083763c", "title": "MODULAR AND EXTENSIBLE PIPELINES FOR RESIDENTIAL ENERGY DEMAND MODELING"}, {"paperId": "fde4b7f89604563df50e7d1b164938eadbf78833", "title": "Phi: A Generic Microservices-Based Big Data Architecture"}]}
