{"paperId": "af34181ae916e01c72513f915f984a1d2c7febab", "publicationVenue": {"id": "b76366f5-0af9-45f3-8fe3-78fdb0114f67", "name": "Applied Informatics", "type": "conference", "alternate_names": ["Appl Informatics", "Advances Argumentation Artificial Intelligence", "AI", "Can Conf Artif Intell", "Adv Argum Artif Intell", "Canadian Conference on Artificial Intelligence"], "issn": "2196-0089", "alternate_issns": ["2673-2688"], "url": "http://cscsi.org/", "alternate_urls": ["https://link.springer.com/journal/40535", "http://www.applied-informatics-j.com/"]}, "title": "Augmented Behavioral Annotation Tools, with Application to Multimodal Datasets and Models: A Systematic Review", "abstract": "Annotation tools are an essential component in the creation of datasets for machine learning purposes. Annotation tools have evolved greatly since the turn of the century, and now commonly include collaborative features to divide labor efficiently, as well as automation employed to amplify human efforts. Recent developments in machine learning models, such as Transformers, allow for training upon very large and sophisticated multimodal datasets and enable generalization across domains of knowledge. These models also herald an increasing emphasis on prompt engineering to provide qualitative fine-tuning upon the model itself, adding a novel emerging layer of direct machine learning annotation. These capabilities enable machine intelligence to recognize, predict, and emulate human behavior with much greater accuracy and nuance, a noted shortfall of which have contributed to algorithmic injustice in previous techniques. However, the scale and complexity of training data required for multimodal models presents engineering challenges. Best practices for conducting annotation for large multimodal models in the most safe and ethical, yet efficient, manner have not been established. This paper presents a systematic literature review of crowd and machine learning augmented behavioral annotation methods to distill practices that may have value in multimodal implementations, cross-correlated across disciplines. Research questions were defined to provide an overview of the evolution of augmented behavioral annotation tools in the past, in relation to the present state of the art. (Contains five figures and four tables).", "venue": "Applied Informatics", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2023-01-28", "journal": {"name": "AI"}, "authors": [{"authorId": "2064858464", "name": "Eleanor Watson"}, {"authorId": "2181275291", "name": "Thiago Viana"}, {"authorId": "2203896423", "name": "Shujun Zhang"}], "citations": [{"paperId": "a67d104cfffea3db9e9c0446fc2ed211f75c6380", "title": "The role of chat generative pre-trained transformer in facilitating decision-making and the e-learning process in higher education"}, {"paperId": "c67f37780c2dc01f55aa5ddd3014fbbfb4bcd9b0", "title": "Research on smart grid management and security guarantee of sports stadiums based on GCNN-GRU and self-attention mechanism"}]}
