{"paperId": "af4afbf2465b3ff08ed9762e0c8810c101cb23d6", "publicationVenue": null, "title": "VizSciFlow: A Visually Guided Scripting Framework for Supporting Complex Scientific Data Analysis", "abstract": "Scientific workflow management systems such as Galaxy, Taverna and Workspace, have been developed to automate scientific workflow management and are increasingly being used to accelerate the specification, execution, visualization, and monitoring of data-intensive tasks. For example, the popular bioinformatics platform Galaxy is installed on over 168 servers around the world and the social networking space myExperiment shares almost 4,000 Galaxy scientific workflows among its 10,665 members. Most of these systems offer graphical interfaces for composing workflows. However, while graphical languages are considered easier to use, graphical workflow models are more difficult to comprehend and maintain as they become larger and more complex. Text-based languages are considered harder to use but have the potential to provide a clean and concise expression of workflow even for large and complex workflows. A recent study showed that some scientists prefer script/text-based environments to perform complex scientific analysis with workflows. Unfortunately, such environments are unable to meet the needs of scientists who prefer graphical workflows. In order to address the needs of both types of scientists and at the same time to have script-based workflow models because of their underlying benefits, we propose a visually guided workflow modeling framework that combines interactive graphical user interface elements in an integrated development environment with the power of a domain-specific language to compose independently developed and loosely coupled services into workflows. Our domain-specific language provides scientists with a clean, concise, and abstract view of workflow to better support workflow modeling. As a proof of concept, we developed VizSciFlow, a generalized scientific workflow management system that can be customized for use in a variety of scientific domains. As a first use case, we configured and customized VizSciFlow for the bioinformatics domain. We conducted three user studies to assess its usability, expressiveness, efficiency, and flexibility. Results are promising, and in particular, our user studies show that VizSciFlow is more desirable for users to use than either Python or Galaxy for solving complex scientific problems.", "venue": "Proc. ACM Hum. Comput. Interact.", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-06-18", "journal": {"name": "Proceedings of the ACM on Human-Computer Interaction", "pages": "1 - 37", "volume": "4"}, "authors": [{"authorId": "48923771", "name": "Muhammad M. Hossain"}, {"authorId": "50666808", "name": "B. Roy"}, {"authorId": "1738612", "name": "C. Roy"}, {"authorId": "38558513", "name": "Kevin A. Schneider"}], "citations": [{"paperId": "035b4b3c535c6ae2dd808bad26c8e90b9ad159d9", "title": "On the use of big data frameworks in big service management"}, {"paperId": "a704037af3d5d432cf087c9ed9d9756339c3fb4e", "title": "Reusability Challenges of Scientific Workflows: A Case Study for Galaxy"}, {"paperId": "bd4a63548ea95d3605d1d9e079f5c67568ca1ec9", "title": "A Domain-Specific Composition Environment for Provenance Query of Scientific Workflows"}, {"paperId": "67cb100c2863803db4b1d89e3c1ab3850954498c", "title": "Challenges of Provenance in Scientific Workflow Management Systems"}, {"paperId": "90fe2e9d0209704ea5b305a80d1e13281cbafdcf", "title": "Facilitating Asynchronous Collaboration in Scientific Workflow Composition Using Provenance"}, {"paperId": "a1220f5233aca198e6f67c24b8de127f6d2b924d", "title": "Usability Assessment in Scientific Data Analysis: A Literature Review"}]}
