{"paperId": "af61721c1bb9131055a878b728b95fe9f2f8032f", "publicationVenue": {"id": "658465d7-3c50-4d5d-b3ad-34b6fc978004", "name": "SAGE Open", "type": "journal", "issn": "2158-2440", "url": "https://journals.sagepub.com/home/sgoa", "alternate_urls": ["http://sgo.sagepub.com/", "http://sgo.sagepub.com/content/4/3/2158244014545971"]}, "title": "Deprivation and Importation Measures as Predictors of Bullying Perpetration in Young Correctional Institutions", "abstract": "Bullying is a perennial problem in correctional institutions. This study aims to investigate the prevalence of bullying perpetration in young correctional institutions, and to identify environmental and personal factors as predictors of bullying perpetration. A cross-sectional survey was carried out among 289 male and female young people from eight correctional institutions in Malaysia. The Direct and Indirect Prisoner Behavior Checklist (DIPC-SCALEDr) was used to measure both bullying perpetration and victimization. The study reported more than 90% of the participants engaged in at least one behavior indicative of bullying others during the 1 month period. Participants reported involvement across six bullying forms. Direct logistic regression analysis identified eight significant predictors of bullying perpetration i.e. time served in the institution, disciplinary punishment; gang membership, no self-injury, respect, bureaucratic legitimacy, fairness, and family contact. To conclude, this study confirms bullying perpetration is determined by both personal and environmental factors. Juvenile justice system can use these key findings to anchor future interventions to prevent bullying and other forms of violence in correctional institution. In the future, this study might include a focus on staff-offender bullying and protective factors for bulling perpetration in correctional institutions.", "venue": "SAGE Open", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-10-01", "journal": {"name": "SAGE Open"}, "authors": [{"authorId": "2261827056", "name": "Nazirah Hassan"}], "citations": []}
