{"paperId": "af871e18bfc324a2f499d039099729eef37e2c6a", "publicationVenue": null, "title": "INTEGRASI DATA MINING DAN ONLINE ANALYTICAL PROCESSING (OLAP) PADA DATA PERFORMA SISWA", "abstract": "Pertumbuhan teknologi membawa dampak terhadap peningkatan data untuk digunakan bagi setiap orang. Akumulasi data tersebut telah menciptakan pola data yang semakin banyak, namun perolehan informasi dari data tersebut masih minim. Oleh karena itu, saat ini diperlukan suatu teknik analisa data dalam mencari pola dari kumpulan data tersebut, salah satunya adalah data mining. Data mining merupakan proses pencarian informasi baru dari kumpulan data yang besar untuk menemukan informasi baru sebagai bahan pertimbangan dalam pengambilan keputusan di berbagai bidang, seperti bidang pendidikan. Dalam bidang pendidikan, banyak menghasilkan berbagai macam data, seperti data performa siswa dalam persiapan mengikuti ujian. Data tersebut dapat dianalisis dengan menggunakan metode On-Line Analytical Processing (OLAP) untuk menemukan pola dari data performa siswa tersebut. Penelitian ini berfokus pada proses integrasi data mining yang terdiri dari association, clustering, classification dan forecasting dengan kombinasi metode On-Line Analytical Processing (OLAP) pada data performa siswa. Penulis juga menggunakan bantuan tools Power OLAP untuk membantu analisa metode data mining. Hasil dari penelitian ini adalah penemuan pola baru dalam proses identifikasi kelompok data tersebut, seperti informasi mengenai rata-rata hasil ujian siswa berdasarkan persiapan ujian yang dilakukan dalam bentuk grafik sebagai alat pemodelan dari data, sehingga pengetahuan baru tersebut dapat membantu pihak universitas/sekolah untuk melalukan klasifikasi mengenai tingkat kelulusan dan dapat menetukan strategi dalam meningkatkan kelulusan siswa pada tahun - tahun berikutnya.", "venue": "", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2020-11-02", "journal": {"name": "", "pages": "400-406", "volume": "9"}, "authors": [{"authorId": "1393961303", "name": "Lydia - Liliana"}, {"authorId": "71000805", "name": "Henny Hartono"}, {"authorId": "113522249", "name": "Devi Yurisca Bernanda"}], "citations": []}
