{"paperId": "af9a7c9d65e60cbc98dbcb29c232ea41436269fb", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Cyber Threat Intelligence-Based Malicious URL Detection Model Using Ensemble Learning", "abstract": "Web applications have become ubiquitous for many business sectors due to their platform independence and low operation cost. Billions of users are visiting these applications to accomplish their daily tasks. However, many of these applications are either vulnerable to web defacement attacks or created and managed by hackers such as fraudulent and phishing websites. Detecting malicious websites is essential to prevent the spreading of malware and protect end-users from being victims. However, most existing solutions rely on extracting features from the website’s content which can be harmful to the detection machines themselves and subject to obfuscations. Detecting malicious Uniform Resource Locators (URLs) is safer and more efficient than content analysis. However, the detection of malicious URLs is still not well addressed due to insufficient features and inaccurate classification. This study aims at improving the detection accuracy of malicious URL detection by designing and developing a cyber threat intelligence-based malicious URL detection model using two-stage ensemble learning. The cyber threat intelligence-based features are extracted from web searches to improve detection accuracy. Cybersecurity analysts and users reports around the globe can provide important information regarding malicious websites. Therefore, cyber threat intelligence-based (CTI) features extracted from Google searches and Whois websites are used to improve detection performance. The study also proposed a two-stage ensemble learning model that combines the random forest (RF) algorithm for preclassification with multilayer perceptron (MLP) for final decision making. The trained MLP classifier has replaced the majority voting scheme of the three trained random forest classifiers for decision making. The probabilistic output of the weak classifiers of the random forest was aggregated and used as input for the MLP classifier for adequate classification. Results show that the extracted CTI-based features with the two-stage classification outperform other studies’ detection models. The proposed CTI-based detection model achieved a 7.8% accuracy improvement and 6.7% reduction in false-positive rates compared with the traditional URL-based model.", "venue": "Italian National Conference on Sensors", "year": 2022, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-04-28", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "22"}, "authors": [{"authorId": "2272279", "name": "Fuad A. Ghaleb"}, {"authorId": "2102357190", "name": "Mohammed Alsaedi"}, {"authorId": "1491585079", "name": "Faisal Saeed"}, {"authorId": "1684080504", "name": "Jawad Ahmad"}, {"authorId": "2103616464", "name": "Mohammed Alasli"}], "citations": [{"paperId": "c6881c0732386ff0ff3a69a475a4cae446efd008", "title": "New ensemble learning algorithm based on classification certainty and semantic correlation"}, {"paperId": "e1cf1ae5cb4d80189c1f7e42c10d4a0b442c8901", "title": "Agriculture 4.0 and Beyond: Evaluating Cyber Threat Intelligence Sources and Techniques in Smart Farming Ecosystems"}, {"paperId": "4fdd8f5c1883cf12ef55449e7cf0449ab62be12b", "title": "An efficient cyber threat prediction using a novel artificial intelligence technique"}, {"paperId": "18e86623c02eb8fbde6e4311979a760a549b1256", "title": "Political Optimization Algorithm with a Hybrid Deep Learning Assisted Malicious URL Detection Model"}, {"paperId": "b55c9476849e6ef114e2786d36f39f4f8eefb69d", "title": "A weighted ensemble model for phishing website detection using random forest and deep neural network"}, {"paperId": "4ee1a32f8bd11e8e71c4a2f8fa1972222a9039da", "title": "Machine Learning for the Exposure of Malicious URLs"}, {"paperId": "820e9504a9b403a924679d6c54190f5d8bcdbe5c", "title": "Identification and Classification of Malicious and Benign URL using Machine Learning Classifiers"}, {"paperId": "4cd2c991a19d51484f5d2b1a16aa2d060bf3d9c5", "title": "BERT-Based Approaches to Identifying Malicious URLs"}, {"paperId": "3402238db1871bf55f8fb0170160d960e39ab521", "title": "Investigating IPTV Malware in the Wild"}, {"paperId": "5cce8ed116bbe29b1c74daaac08de820ca01024d", "title": "A Model for Cyber Threat Intelligence for Organisations"}, {"paperId": "fc5dc50cabe03cbad89976ce8a32c4ca5f193871", "title": "Evaluation of Cyber Sabotage in Public Entities"}, {"paperId": "38c9fa153e53a74b275476cd75b1be88d52ff0e7", "title": "A Systematic Literature Review on Cyber Threat Intelligence for Organizational Cybersecurity Resilience"}, {"paperId": "8589bd025949a2f3fb90df4a3df0407c4950d851", "title": "Machine and Deep Learning-based XSS Detection Approaches: A Systematic Literature Review"}, {"paperId": "55a87d7fbc43d7ccc03268cd7e22befbbd655a98", "title": "Fraudulent URL and Credit Card Transaction Detection System Using Machine Learning"}, {"paperId": "1b9d97ff5e1876d39a07d4f9016250f8ace603c2", "title": "Suspicious Link Detection using AI"}, {"paperId": "92819232d8fba5998b04feaca78350c59d6fbf53", "title": "Malicious URL: Analysis and Detection using Machine Learning"}, {"paperId": "377fd63aa67e9ac1cab465ec6e7f1e2d3260c5ad", "title": "Developing and Evaluating an Artificial Intelligence Model for Malicious URL Detection"}, {"paperId": "8d9350616bfecdf7e66fd986909a725445f0f782", "title": "A Machine Learning Approach for Walking Classification in Elderly People with Gait Disorders"}, {"paperId": "83e5829b0cc7ddb44fcc86d250805118e00d96f3", "title": "SOLVING THE PROBLEM OF DETECTING PHISHING WEBSITES USING ENSEMBLE LEARNING MODELS"}, {"paperId": "eeb987b02cbd50c62170699b8077aae89359176f", "title": "Hybrid Approach for Phishing Website Detection Using Classification Algorithms"}, {"paperId": "1b6546f9ea25f1a43877147084adc509aa635246", "title": "Malicious Domain Detection using NLP Methods — A Review"}, {"paperId": "d9c38a97c56128af81b7bc2cbaeb863a3a6a85b2", "title": "Data Driven based Malicious URL Detection using Explainable AI"}, {"paperId": "841a7f99f1711d8bc45e933aada36338b33fd7f8", "title": "A Systematic Literature Review and Meta-Analysis of Studies on Online Fake News Detection"}, {"paperId": "fff42b1b567492820f01f90461f8d84674f8496f", "title": "Evolutionary Algorithm with Deep Auto Encoder Network Based Website Phishing Detection and Classification"}, {"paperId": "11142e7c6919e6829c0d124daa30c6748cf86134", "title": "Multi-Modal Features Representation-Based Convolutional Neural Network Model for Malicious Website Detection"}, {"paperId": "dd2427fdd5d9055273f1ba1a4dc7f2482d869e95", "title": "Malicious URL Identification Using Machine Learning - Brosafe"}, {"paperId": "58b2f82e5b382c8b714300248ede3574c2a9b878", "title": "Malicious Web Links Detection Using Ensemble Models"}]}
