{"paperId": "af9ac6a6f52f1609e5a86176f5301d3277219f38", "publicationVenue": {"id": "d4a4ccb5-7a26-4b5d-9596-49cbf2888620", "name": "International Multi Topic Conference on Wireless Networks, Information Processing and Systems", "type": "conference", "alternate_names": ["IMTIC", "Int Multi Top Conf Wirel Netw Inf Process Syst"], "url": "http://www.wikicfp.com/cfp/program?id=1594"}, "title": "A Comparative Study of the Performance of Real time databases and Big data Analytics Frameworks", "abstract": "The amelioration of information technology and the infiltration of it almost all the sectors of world have resulted in massive efflux of data. The rampant increase in the generation of data has introduced to a new term called, Big data. Big data is letting industry set the pace of future research and development. The need rose to further refine the data and get most out of it. Scientists and researchers performed analytic on the Big data to analyze it for patterns and behaviors hidden inside the data. Big data analytics aid in understanding the data through various tools, algorithms and frameworks. It allows stakeholders to make business plans and strategies according to the revelations from data. There are various tools and technologies available to perform analytics on the data. The most popular among scientists and researchers are real-time database and Big data analytics frameworks. In the paper, we evaluate the performance of the tools and technologies of Big data analytics. Mongodb and Firebase are real-time databases implemented in this study and Impala and Hive are the BDA frameworks. The parameter to perform the comparison is the query execution time. It is found out that Impala and Hive gave lesser execution time than Mongodb and Firebase. The query execution time of Impala on 50 mb dataset and 100 mb dataset was recorded to be 4 ms and 14 ms respectively. Hence, Big data Analytics Frameworks are better performing analytics tools for Big data Analytics.", "venue": "International Multi Topic Conference on Wireless Networks, Information Processing and Systems", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-05-10", "journal": {"name": "2023 7th International Multi-Topic ICT Conference (IMTIC)", "pages": "1-7"}, "authors": [{"authorId": "1665012203", "name": "S. Mustafa"}, {"authorId": "2055068910", "name": "Muhammad Umer Farooq"}, {"authorId": "1742022537", "name": "Syeda Sundus Zehra"}, {"authorId": "2223788078", "name": "Jospeh Peter Terenece Noronha"}], "citations": [{"paperId": "17a717deb466d682e1ebb3925169b190cb6daaea", "title": "Enhancing Analytical Select Statements Using Reference Aliases"}]}
