{"paperId": "afa026e9de09292d80a7f563dd6334713706634b", "publicationVenue": {"id": "1124d164-490d-4da9-b0c2-ce8a8dc98202", "name": "BigData Congress [Services Society]", "type": "conference", "alternate_names": ["BigData", "Bigdata Congr [services Soc", "IEEE Int Conf Big Data", "IEEE International Conference on Big Data", "Int Congr Big Data", "International Congress on Big Data", "Bigdata Congr", "BigData Congress"]}, "title": "QDrill: Query-Based Distributed Consumable Analytics for Big Data", "abstract": "Consumable analytics attempt to address the shortage of skilled data analysts in many organizations by offering analytic functionality in a form more familiar to in-house expertise. Providing consumable analytics for Big Data faces three main challenges. The first challenge is making the analytics algorithms run in a distributed fashion in order to analyze Big Data in a timely manner. The second challenge is providing an easy interface to allow in-house expertise to run these algorithms in a distributed fashion while minimizing the learning cycle and existing code rewrites. The third challenge is running the analytics on data of different formats stored on heterogeneous data stores. In this paper, we address these challenges in the proposed QDrill. We introduce the Analytics Adaptor extension for Apache Drill, a schema-free SQL query engine for non-relational storage. The Analytics Adaptor introduces the Distributed Analytics Query Language for invoking data mining algorithms from within the Drill standard SQL query statements. The adaptor allows using any sequential single-node data mining library (e.g. WEKA) and makes its algorithms run in a distributed fashion without having to rewrite them. We evaluate QDrill against Apache Mahout. The evaluation shows that QDrill outperforms Mahout in Updatable model training and scoring phase while almost keeping the same performance for Non-Updatable model training. QDrill is more scalable and offers an easier interface, no storage overhead and the whole algorithms repository of WEKA, with the ability to extend to use algorithms from other data mining libraries.", "venue": "BigData Congress [Services Society]", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2016-06-01", "journal": {"name": "2016 IEEE International Congress on Big Data (BigData Congress)", "pages": "117-124"}, "authors": [{"authorId": "3486475", "name": "Shadi Khalifa"}, {"authorId": "143878089", "name": "Patrick Martin"}, {"authorId": "2619115", "name": "Dan Rope"}, {"authorId": "47600931", "name": "Mike McRoberts"}, {"authorId": "2677407", "name": "Craig Statchuk"}], "citations": [{"paperId": "a612e53e2e49913c262b846ac54cb764ec58144e", "title": "Achieving Consumable Big Data Analytics by Distributing Data Mining Algorithms"}, {"paperId": "45f9f16d144998bfa4ed121e986fe3095f48a52e", "title": "The Six Pillars for Building Big Data Analytics Ecosystems"}]}
