{"paperId": "afa3dd52f1ac721d41e658be28ad8e45b1792023", "publicationVenue": {"id": "0942fb86-c16f-4084-9902-10ddcfe18180", "name": "Micro", "type": "conference", "alternate_names": ["Int Symp Microarchitecture", "MICRO", "International Symposium on Microarchitecture", "Annual IEEE/ACM International Symposium on Microarchitecture", "Annu IEEE/ACM Int Symp Microarchitecture"], "issn": "0271-9002", "alternate_issns": ["2151-4143", "2673-8023"], "url": "http://www.microarch.org/"}, "title": "Mint: An Accelerator For Mining Temporal Motifs", "abstract": "A variety of complex systems, including social and communication networks, financial markets, biology, and neuroscience are modeled using temporal graphs that contain a set of nodes and directed timestamped edges. Temporal motifs in temporal graphs are generalized from subgraph patterns in static graphs in that they also account for edge ordering and time duration, in addition to the graph structure. Mining temporal motifs is a fundamental problem used in several application domains. However, existing software frameworks offer suboptimal performance due to high algorithmic complexity and irregular memory accesses of temporal motif mining.This paper presents $\\mathsf{Mint}$—a novel accelerator architecture and a programming model for mining temporal motifs efficiently. We first divide this workload into three fundamental tasks: search, book-keeping, and backtracking. Based on this, we propose a task-centric programming model that enables decoupled, asynchronous execution. This model unlocks massive opportunities for parallelism, and allows storing task context information on-chip. To best utilize the proposed programming model, we design a domain-specific hardware accelerator using its data path and memory subsystem design to cater to the unique workload characteristics of temporal motif mining. To further improve performance, we propose a novel optimization called search index memoization that significantly reduces memory traffic. We comprehensively compare the performance of $\\mathsf{Mint}$ with state-of-the-art temporal motif mining software frameworks (both approximate and exact) running on both CPU and GPU, and show $9\\times-2576\\times$ benefit in performance.", "venue": "Micro", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-10-01", "journal": {"name": "2022 55th IEEE/ACM International Symposium on Microarchitecture (MICRO)", "pages": "1270-1287"}, "authors": [{"authorId": "3120006", "name": "Nishil Talati"}, {"authorId": "2111972340", "name": "Haojie Ye"}, {"authorId": "32204028", "name": "S. Vedula"}, {"authorId": "2110720794", "name": "Kuan-Yu Chen"}, {"authorId": "2183577021", "name": "Yuhan Chen"}, {"authorId": "2118823121", "name": "Daniel Liu"}, {"authorId": "48010007", "name": "Yichao Yuan"}, {"authorId": "1687117", "name": "D. Blaauw"}, {"authorId": "2075292263", "name": "Alex Bronstein"}, {"authorId": "1751516", "name": "T. Mudge"}, {"authorId": "1793651", "name": "R. Dreslinski"}], "citations": [{"paperId": "b0d3b8a37864a4ea348650064bd95a13c0f76386", "title": "Demystifying Graph Sparsification Algorithms in Graph Properties Preservation"}, {"paperId": "fedb7400904f0556cae3da07fdb0f286d82313c2", "title": "RACE: An Efficient Redundancy-aware Accelerator for Dynamic Graph Neural Network"}, {"paperId": "cb0d72d300e2042050f31877642caed84d54f3f8", "title": "PIMMiner: A High-performance PIM Architecture-aware Graph Mining Framework"}, {"paperId": "6550a0af3586ba50f61c4b5f930924cc9318918b", "title": "Arya: Arbitrary Graph Pattern Mining with Decomposition-based Sampling"}]}
