{"paperId": "afa5b53ae7726f084fa1ac150463c5edfd757131", "publicationVenue": null, "title": "Exploring the Use of Machine Learning for Edge and Line Detection in Digital Image processing", "abstract": "Line and part detection is an important vicinity of virtual image processing. It can be used for a ramification of functions, consisting of object recognition in photographs. Machine studying is a technique that may be used to improve the accuracy and performance of line and area detection. The basic approach for line and side detection is to first convert the photo into a one-dimensional signal. This sign can then be processed with sign processing techniques which include Fourier remodel or discrete cosine transform. Later on, algorithms may be used to detect neighborhood functions within the signal inclusive of modifications in depth or neighborhood maximums or minimums. This is used to become aware of edges and line obstacles. The use of system studying for line and part detection calls for the definition of the perfect learning undertaking. In most cases, this assignment involves the category of different line and edge segments as both a line and an aspect. That is usually executed by computing various feature vectors for each section after which using an algorithm to classify each phase as both a line and a part. One technique to characteristic extraction is to use a convolutional neural community (CNN) structure, that's a form of device mastering algorithm that can mechanically extract important capabilities from an image. The output of the CNN can then be used as enter to a classification.", "venue": "2023 International Conference on Power Energy, Environment & Intelligent Control (PEEIC)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-12-19", "journal": {"name": "2023 International Conference on Power Energy, Environment & Intelligent Control (PEEIC)", "pages": "1600-1606"}, "authors": [{"authorId": "2291040441", "name": "Purvi Makwana"}, {"authorId": "2291040828", "name": "Gayathri Band"}, {"authorId": "2189598473", "name": "Sheetal Vishal Deshmukh"}, {"authorId": "2291040899", "name": "Sreesurya Aitha"}, {"authorId": "2291040062", "name": "Prasanta Kumar Parida"}, {"authorId": "2291041360", "name": "Yogesh V. Deshpande"}], "citations": []}
