{"paperId": "afc44c380d8ed02ed08ff82214b7da642804923e", "publicationVenue": {"id": "e07422f9-c065-40c3-a37b-75e98dce79fe", "name": "The Web Conference", "type": "conference", "alternate_names": ["Web Conf", "WWW"], "url": "http://www.iw3c2.org/"}, "title": "Detecting Addiction, Anxiety, and Depression by Users Psychometric Profiles", "abstract": "Detecting and characterizing people with mental disorders is an important task that could help the work of different healthcare professionals. Sometimes, a diagnosis for specific mental disorders requires a long time, possibly causing problems because being diagnosed can give access to support groups, treatment programs, and medications that might help the patients. In this paper, we study the problem of exploiting supervised learning approaches, based on users’ psychometric profiles extracted from Reddit posts, to detect users dealing with Addiction, Anxiety, and Depression disorders. The empirical evaluation shows an excellent predictive power of the psychometric profile and that features capturing the post’s content are more effective for the classification task than features describing the user writing style. We achieve an accuracy of 96% using the entire psychometric profile and an accuracy of 95% when we exclude from the user profile linguistic features.", "venue": "The Web Conference", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2022-04-25", "journal": {"name": "Companion Proceedings of the Web Conference 2022"}, "authors": [{"authorId": "2296962", "name": "A. Monreale"}, {"authorId": "51295557", "name": "Benedetta Iavarone"}, {"authorId": "2060401978", "name": "Elena Rossetto"}, {"authorId": "2075793906", "name": "Andrea Beretta"}], "citations": [{"paperId": "b077d1c6e8b59f62eea6f3f3136fca5c0cdc3e76", "title": "Characterizing online social support for alcohol use disorder: A mixed-methods approach."}, {"paperId": "c484fd3c769e06df8c9015c51febb6ab6dee2208", "title": "Emotion fusion for mental illness detection from social media: A survey"}]}
