{"paperId": "afc4ef0f6cd14bf8c13e922c33461a0a2cecd945", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Evaluation Study on a Novel Structure CCHP System with a New Comprehensive Index Using Improved ALO Algorithm", "abstract": "The CCHP system is a reasonable and effective method to improve the current situation of energy use. Capacity allocation is of great significance in improving the performance of the CCHP system. Due to the particularity of chemical enterprises’ production process, the demand for cooling, heating, and power load is also relatively particular, which makes the dynamic loads challenging to be satisfied. Because of the above problems, the structure of the typical CCHP system is improved, embodied in the collocation of multi-stage lithium bromide chiller, and the use of various energy storage devices. Based on the improved ant lion intelligent optimization (ALO) algorithm, the comprehensive evaluation index coupled with energy benefit, economic benefit, and environmental benefit, is taken as the objective function, and the equipment capacity configuration of the CCHP system for chemical enterprises is studied. Considering winter, summer, and transition seasons, the results show that the system is better than the typical CCHP system. The annual cost savings of the new structural system are up to 13%, and the carbon dioxide emissions of the new structural system are reduced by up to 36.39%. The primary energy utilization rate of the new structure system is increased by 18%, and the comprehensive evaluation index also performs better. The optimal index can reach 0.814.", "venue": "Sustainability", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-11-20", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "50790836", "name": "Jie Ji"}, {"authorId": "46429233", "name": "Fucheng Wang"}, {"authorId": "2216406834", "name": "Mengxiong Zhou"}, {"authorId": "2114010663", "name": "Renwei Guo"}, {"authorId": "2128319393", "name": "Rundong Ji"}, {"authorId": "40586368", "name": "Hui Huang"}, {"authorId": "2128691096", "name": "Jiayu Zhang"}, {"authorId": "34747275", "name": "M. S. Nazir"}, {"authorId": "145194502", "name": "Tian Peng"}, {"authorId": "2206991929", "name": "Chu Zhang"}, {"authorId": "2191737943", "name": "Jiahui Huang"}, {"authorId": "2144277271", "name": "Yaodong Wang"}], "citations": [{"paperId": "d24d7d2b2766fbaaf85675e31bead52f804b560b", "title": "Performance analysis of the comprehensive energy system based on active energy storage-discharge technology under time-sharing electricity price operation strategy"}, {"paperId": "0a78b41c88dfd886b18353facf0832a4549c442e", "title": "Optimization of closing law of turbine guide vanes based on improved artificial ecosystem algorithm"}]}
