{"paperId": "afd2bdcb21825da52f3b5b021a0b8742efae014d", "publicationVenue": {"id": "aa2288b7-f151-4e26-93a7-512c123c6754", "name": "Global Knowledge Memory and Communication", "alternate_names": ["Glob Knowl Mem Commun"], "issn": "2514-9342", "url": "http://www.emeraldgrouppublishing.com/products/journals/journals.htm?id=gkmc"}, "title": "The next big thing: role of ChatGPT in personal knowledge management challenges and opportunities for knowledge workers across diverse disciplines", "abstract": "\nPurpose\nThe purpose of this paper is to embark on evaluating the role of Chat Generative-Trained Transformer (ChatGPT) in personal knowledge management (PKM) practices of individual knowledge workers across varied disciplines.\n\n\nDesign/methodology/approach\nThe methodology involves four steps, i.e. literature search, screening and selection of relevant data, data analysis and data synthesis related to KM, PKM and generative artificial intelligence (AI) with a focus on ChatGPT. The findings are then synthesized to develop a viewpoint on the challenges and opportunities brought by ChatGPT for individual knowledge workers in enhancing their PKM capability.\n\n\nFindings\nThis work highlights the prevailing challenges and opportunities experienced by knowledge workers while leveraging PKM through implying ChatGPT. It also encapsulates how some management theories back the cruciality of generative AI (specifically ChatGPT) for PKM.\n\n\nResearch limitations/implications\nThis study identifies the challenges and opportunities. from existing studies and does not imply empirical data/result. The authors believe that findings can be adjusted to diverse domains regarding knowledge workers’ PKM endeavors. This paper draws some conclusions and calls for further empirical research.\n\n\nOriginality/value\nChatGPT’s capability to accelerate organizational performance compelled scholars to focus in this domain. The linkage of ChatGPT to Knowledge Management is an under-explored area specifically the role of ChatGPT on PKM hasn't been given attention in the existing work. This is one of the earliest studies to explore this context.\n", "venue": "Global Knowledge Memory and Communication", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-22", "journal": {"name": "Global Knowledge, Memory and Communication"}, "authors": [{"authorId": "2275753607", "name": "Sumaira Nazeer"}, {"authorId": "2661598", "name": "M. S. Sumbal"}, {"authorId": "2275763795", "name": "Gang Liu"}, {"authorId": "2275731690", "name": "Hina Munir"}, {"authorId": "2238341686", "name": "Eric Tsui"}], "citations": []}
