{"paperId": "afe991043322dc7aa16213cea952e66b1a240feb", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Prediction of Scenarios for Routing in MANETs Based on Expanding Ring Search and Random Early Detection Parameters Using Machine Learning Techniques", "abstract": "Routing protocols in Mobile Ad Hoc Networks (MANETs) play a pivotal role in ensuring quality of service (QoS) and improving network performance. Selection of optimal routing protocol and suitable parameters for a given network scenario is a major task that ultimately affects the behavior of network. This work exploits machine learning (ML) techniques for the selection of adequate routing parameters and protocol by regression of parameters in given network scenario to ensure optimal performance. The network is trained based on parametric setup of expanding ring search mechanism (ERS) and random early detection (RED) technique to estimate network throughput, end to end (E2E) delay and packets delivery ratio (PDR) and is tested via wide-ranging simulations in varying network topologies. Both RED and ERS mechanisms are aimed to control link and node level congestion in the reactive routing protocols and our aim is to select the best suited parameters for given network topologies based on ERS and RED parametric setups and improve performance for ensuring QoS. ML algorithms are trained and tested for their performance in varying network topologies. We have exploited these models with best performance for ERS and RED based routing in given topological arrangements. The performance of the ML algorithms is evaluated on the basis of root mean squared error (RMSE) and mean absolute error (MAE) for regression settings. Prediction models with up to par RMSE and MAE out-turns are attained and exploited for selection of suitable ERS and RED parameters and routing protocols in order to ensure the QoS for given network scenario. Variants of standard routing protocols are devised based on their performance and the ML techniques are exploited for prediction of QoS parameters to decide on the optimal variant that attains significant improvement in performance. Results are shown to confirm that considerable improvement in QoS is attained.", "venue": "IEEE Access", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "47033-47047", "volume": "9"}, "authors": [{"authorId": "2066899887", "name": ".. Durr-e-Nayab"}, {"authorId": "32007238", "name": "M. H. Zafar"}, {"authorId": "9420664", "name": "Ali A. Altalbe"}], "citations": [{"paperId": "989b4984ba19e3e6f82255450584e554cf305680", "title": "Energy and Signal Strength based Reliable Route Prediction by Fuzzy Rules in MANET (ESRP)"}, {"paperId": "5e8764fcdd48390a143d5ecca7095bd659f56356", "title": "Performance Augmentation of Base Classifiers Using Adaptive Boosting Framework for Medical Datasets"}, {"paperId": "1c02888ff3c1a531a8884b3732a6963f6c0a7613", "title": "Analysis of Congestion Control Techniques for Improving QoS using Machine Learning Approach in MANET"}, {"paperId": "5c0ccc7bf569d6eb6a79a9b3666fb5f5b2acfe7e", "title": "Review of random early detection optimization for congestion control in vehicular ad hoc networks"}, {"paperId": "e896a93ede62fa1d84775ac39953bee3bfcb95d8", "title": "Reliable routing in MANET with mobility prediction via long short-term memory"}, {"paperId": "61dbd6673ee9ed4751c774b5d726972c8b3180a9", "title": "Analysis of SEA-based MANET routing protocol for Improved Firefly Energy Optimized Routing"}, {"paperId": "07ba6c6d7e741292b970cca04517058a1ec80b1a", "title": "IRDFPR-CMDNN: An energy efficient and reliable routing protocol for improved data transmission in MANET"}, {"paperId": "24457c9914fa6857007b3372e55b148168378f63", "title": "A novel congestion control approach for optimal routing in Wireless Adhoc Networks"}, {"paperId": "fa0037ce984f80366ebe6db1a84b966e99460442", "title": "A Study on the Optimal Design of PMa-SynRM for Electric Vehicles Combining Random Forest and Genetic Algorithm"}, {"paperId": "de48c84ea3d8997afc29106eed91c4859f9c97d2", "title": "Performance Analysis of Prophet Routing Protocol in Delay Tolerant Network by using Machine Learning Models"}, {"paperId": "fac510a6e6b43b48fad53364d43a87e7cdd3b1d3", "title": "Efficient Multimedia Content Transmission Model for Disaster Management using Delay Tolerant Mobile Adhoc Networks"}, {"paperId": "84259fb26d29711d333ba2d2082cbdc2360da17c", "title": "Region Centric GL Feature Approximation Based Secure Routing for Improved QoS in MANET"}, {"paperId": "54ecb79df93cfebf4ee9847d4c18cd07e4cae963", "title": "Performance Analysis of ERS Techniques for Next-Generation Opportunistic Networks"}]}
