{"paperId": "aff015266015d0041902724b2a91b8a4aea99868", "publicationVenue": null, "title": "A hybrid intelligent model for early validation of infectious diseases: An explorative study of machine learning approaches", "abstract": "Literature reports several infectious diseases news validation approaches, but none is economically effective for collecting and classifying information on different infectious diseases. This work presents a hybrid machine‐learning model that could predict the validity of the infectious disease's news spread on the media. The proposed hybrid machine learning (ML) model uses the Dynamic Classifier Selection (DCS) process to validate news. Several machine learning models, such as K‐Neighbors‐Neighbor (KNN), AdaBoost (AB), Decision Tree (DT), Random Forest (RF), SVC, Gaussian Naïve Base (GNB), and Logistic Regression (LR) are tested in the simulation process on benchmark dataset. The simulation employs three DCS process methods: overall Local Accuracy (OLA), Meta Dynamic ensemble selection (META‐DES), and Bagging. From seven ML classifiers, the AdaBoost with Bagging DCS method got a 97.45% high accuracy rate for training samples and a 97.56% high accuracy rate for testing samples. The second high accuracy was obtained at 96.12% for training and 96.45% for testing samples from AdaBoost with the Meta‐DES method. Overall, the AdaBoost with Bagging model obtained higher accuracy, AUC, sensitivity, and specificity rate with minimum FPR and FNR for validation.", "venue": "Microscopy research and technique (Print)", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-01-26", "journal": {"name": "Microscopy Research and Technique", "pages": "507 - 515", "volume": "86"}, "authors": [{"authorId": "2086773250", "name": "Saeed Ali Omer Bahaj"}], "citations": [{"paperId": "4c7cc35628bfef9b4c60878e8070769c7c6a3c1d", "title": "AdaBoost Regression Predicts the Ranking of College Students Using the Super Star Learning APP"}]}
