{"paperId": "aff1b9066f039a62f1a14309e5f29504de8bbd3e", "publicationVenue": null, "title": "Analysis on Different Optimization Methods, Applications, and Categories of Optical Fiber Networks: A Review", "abstract": "OFs (Optical Fibers) are broadly used for information broadcast systems due to their extensive information-carrying capability and dielectric environment. The OFs network architectures that use several WLs (wavelengths) per OFs connect thousands of users in central, urban, or large-scale applications with a wide range of transmission speeds and capabilities. This article defines a detailed introduction to optical fiber networks and general phases of communication of OF (Optical Fiber) procedure. The taxonomy may be based on optical fibers such as; (i) Structure, (ii) number of modes, (iii) refractive index profile, (iv) dispersion, (v) signal processing capacity (vi) Polarization. After that, it explains the merits and demerits of optical fiber networks. They studied optical wireless communications applications such as SMs (shopping malls), UW (underwater), industries, etc. Several analyses with different optimization methods such as Genetic Algorithm (GA), Ant Colony Optimization (ACO), and Particle-Swarm Optimization (PSO) algorithms. An effective resource-allocation method is required to reduce the issue of EE (energy-efficiency) and improve the presentation of quality-of-services of the ONs (Optical Networks).", "venue": "2023 International Conference on Intelligent Data Communication Technologies and Internet of Things (IDCIoT)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference", "Review"], "publicationDate": "2023-01-05", "journal": {"name": "2023 International Conference on Intelligent Data Communication Technologies and Internet of Things (IDCIoT)", "pages": "578-583"}, "authors": [{"authorId": "115745648", "name": "Arjun Dubey"}, {"authorId": "118181455", "name": "Harmeet Singh"}, {"authorId": "49876889", "name": "Simarpreet Kaur"}], "citations": [{"paperId": "2c57bd0f531644e4bd58655afc1623d2bffcd52a", "title": "Optimization of Bit-Rate for Underwater Fibre Optic Networks Using Bandwidth Analysis"}, {"paperId": "619d9e3a275e126285cf46c26e1b2a5b7176bd87", "title": "Maximum Bandwidth Allocation in Underwater Fibre Optic Networks"}, {"paperId": "d5604b4a27afc1705698dac15abad632474f412b", "title": "A Comprehensive analysis of the Efficiency of Dynamic Spectrum Allocation Methods in Optical Fiber Communications"}, {"paperId": "b8cd401ccbd47de64ef8a8584f89abd0b0795799", "title": "Maximum Bandwidth Allocation in Underwater Fibre Optic Networks"}, {"paperId": "663da7f7f880739ec73364b20672e988f45d2145", "title": "Network traffic reduction with spatially flexible optical networks using machine learning techniques"}]}
