{"paperId": "affce18be4ac0ddbeedfffbeaac9c88c4d7c6a10", "publicationVenue": {"id": "f32b7322-b69c-4e63-801d-8f50784ef778", "name": "Computational Intelligence and Neuroscience", "type": "journal", "alternate_names": ["Comput Intell Neurosci"], "issn": "1687-5265", "url": "https://www.hindawi.com/journals/cin/"}, "title": "Fair Transmission of Individual Signals and Formation of Mainstream Information: Evidence from Herd Behaviours in Emergencies", "abstract": "Risk society is full of emergencies, accompanied by uncertainties and losses. Under emergencies, controlling herd behaviour is challenging due to more interactions and changes among individuals. This research establishes Bayes conditional probability models to explain the fair transmission of individual signals and individual decision-making after receiving others' signals. The simulation shows the following conclusions: first, each individual has a fair chance to influence the mainstream information; second, the order in which individuals make decisions during an emergency affects the difficulties and likelihood of making a rational decision; third, the high authority of information can become mainstream and guide individual behaviour; and fourth, two individual characteristics, including risk appetite and personal experience, are important in the fair transmission of individual signals and formation of mainstream information. According to the findings, this research proposes two strategies, including interfering with information and controlling existing key opinion leaders to control the mainstream information within a group in emergencies. These two strategies are proved to be useful in detecting and preventing approaches to alleviate individual herd behaviour, which should be monitored and controlled in machine learning models for individual behaviour simulation and prediction. Compared to previous research that focuses on media and public opinion in emergencies, this research focuses on a specific type of information (i.e., individual decision-making and actions) on the individual level and its effects on herd behaviours within the group. This research complements the explanation of the micro-mechanism of how individuals receive information and make decisions and actions.", "venue": "Computational Intelligence and Neuroscience", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-08-24", "journal": {"name": "Computational Intelligence and Neuroscience", "volume": "2022"}, "authors": [{"authorId": "2044613930", "name": "Xintong Wu"}], "citations": []}
