{"paperId": "b000244a45189487be3ce94854bc53071065430e", "publicationVenue": {"id": "5f7bd029-71ca-4b45-8b68-d514258e75e7", "name": "International Journal of Information Systems in the Service Sector", "type": "journal", "alternate_names": ["Int J Inf Syst Serv Sect", "International Journal of Information Systems in The Service Sector"], "issn": "1935-5688", "url": "http://www.idea-group.com/Bookstore/TitleDetails.aspx?TitleId=1099", "alternate_urls": ["https://www.igi-global.com/journal/international-journal-information-systems-service/1099"]}, "title": "An Innovative Management Perspective for Organizations through a Reputation Intelligence Management Model", "abstract": "Banking companies aiming to maintain their sustainability in financial markets need to develop an integrated management based on the most important intangibles assets of relational capital. Decision- makers need to analyze and understand a huge volume of opinions continuously generated in digital ecosystems about emotions and feelings that their stakeholders associate with the performance and communication of the brand. Current tools of management fail to consider transversal and holistic models, which study the frequency and value of existing relationships between the relational capital and intangible assets. In this research, an innovative management model based on reputation intelligence is proposed. This model incorporates methodology from business intelligence models, through OLAP and data mining techniques, to analyses the complex relationships among intangible assets experience, emotion and attitude. The proposed model was applied to companies in the banking sector and the results obtained permit a conclusion about the kinds of relationships for these intangibles in each bank.", "venue": "International Journal of Information Systems in the Service Sector", "year": 2019, "fieldsOfStudy": ["Computer Science", "Business"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-10-01", "journal": {"name": "Int. J. Inf. Syst. Serv. Sect.", "pages": "1-20", "volume": "11"}, "authors": [{"authorId": "34828818", "name": "C. Ramos"}, {"authorId": "1413282956", "name": "Ana-María Casado-Molina"}, {"authorId": "1748829", "name": "J. I. Peláez"}], "citations": [{"paperId": "9ddb236b1f149b5da2f7e956d23b1ae1934b914f", "title": "Online reputation of agri-food companies and determining factors: an empirical investigation"}, {"paperId": "23337fe6bf7e0f137bf781eea6f0ebd748724a30", "title": "A Decision-Support System to Analyse Customer Satisfaction Applied to a Tourism Transport Service"}, {"paperId": "87b18365af8c08e444394d1a6fa2929662f27ac0", "title": "Sentiment analysis to support business decision-making. A bibliometric study"}, {"paperId": "d0b20c278ba9779f11b74362359bc87d21f0cac7", "title": "Online corporate reputation: A panel data approach and a reputation index proposal applied to the banking sector"}]}
