{"paperId": "b00b507037355823cacd33fbc557d56ed93c12ab", "publicationVenue": {"id": "0730105a-4941-449f-9450-28cba8ae056b", "name": "ACM Transactions on Software Engineering and Methodology", "type": "journal", "alternate_names": ["ACM Trans Softw Eng Methodol"], "issn": "1049-331X", "url": "http://www.acm.org/pubs/contents/journals/tosem/", "alternate_urls": ["https://tosem.acm.org/", "http://tosem.acm.org/", "http://www.acm.org/pubs/tosem/", "http://portal.acm.org/tosem"]}, "title": "Digital Twin-based Anomaly Detection with Curriculum Learning in Cyber-physical Systems", "abstract": "Anomaly detection is critical to ensure the security of cyber-physical systems (CPS). However, due to the increasing complexity of attacks and CPS themselves, anomaly detection in CPS is becoming more and more challenging. In our previous work, we proposed a digital twin-based anomaly detection method, called ATTAIN, which takes advantage of both historical and real-time data of CPS. However, such data vary significantly in terms of difficulty. Therefore, similar to human learning processes, deep learning models (e.g., ATTAIN) can benefit from an easy-to-difficult curriculum. To this end, in this paper, we present a novel approach, named digitaL twin-based Anomaly deTecTion wIth Curriculum lEarning (LATTICE), which extends ATTAIN by introducing curriculum learning to optimize its learning paradigm. LATTICE attributes each sample with a difficulty score, before being fed into a training scheduler. The training scheduler samples batches of training data based on these difficulty scores such that learning from easy to difficult data can be performed. To evaluate LATTICE, we use five publicly available datasets collected from five real-world CPS testbeds. We compare LATTICE with ATTAIN and two other state-of-the-art anomaly detectors. Evaluation results show that LATTICE outperforms the three baselines and ATTAIN by 0.906%-2.367% in terms of the F1 score. LATTICE also, on average, reduces the training time of ATTAIN by 4.2% on the five datasets and is on par with the baselines in terms of detection delay time.", "venue": "ACM Transactions on Software Engineering and Methodology", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-02-01", "journal": {"name": "ACM Transactions on Software Engineering and Methodology", "pages": "1 - 32", "volume": "32"}, "authors": [{"authorId": "2118221146", "name": "Qinghua Xu"}, {"authorId": "47495965", "name": "Sajid Ali"}, {"authorId": "145456500", "name": "T. Yue"}], "citations": [{"paperId": "7d5d7b8d99daa31f0eda58286527e18319b490c4", "title": "Anomaly diagnosis of connected autonomous vehicles: A survey"}, {"paperId": "0aba0318afd1a54906f6120e2bdb1e16b436ef4a", "title": "Model-based Digital Twins of Medicine Dispensers for Healthcare IoT Applications"}, {"paperId": "66cc691f8df669c16dc7bbdcc7e85d2432f18858", "title": "Security through Digital Twin-Based Intrusion Detection: A SWaT Dataset Analysis"}, {"paperId": "c3b3cce29fd7200a6ff0e9830b5a0b7d1f7ff51f", "title": "A Model-Driven Platform for Engineering Holistic Digital Twins"}, {"paperId": "bf847822a3f8c21228c8a43026736bd0c5f93049", "title": "Pretrain, Prompt, and Transfer: Evolving Digital Twins for Time-to-Event Analysis in Cyber-physical Systems"}, {"paperId": "eb6f92b6a6739a2563591e47c98d67b7298d4c04", "title": "Evolve the Model Universe of a System Universe"}, {"paperId": "bb7374cff7ff646e6db0c9f4e69368677dbe948e", "title": "KDDT: Knowledge Distillation-Empowered Digital Twin for Anomaly Detection"}, {"paperId": "e674addbf6f26d2d37133ee80aea0617599c5d1d", "title": "DevOps for Cyber-Physical Systems: Objectives, Results and Lessons Learned from the Adeptness H2020 Project"}, {"paperId": "75522e04f7e11321e0ceab380c4b8c6162e7fbf3", "title": "Systematic Literature Review: Digital Twins’ Role in Enhancing Security for Industry 4.0 Applications"}]}
