{"paperId": "b00c909746c83c66ddd350acb862276c9285ecbf", "publicationVenue": {"id": "593344cb-eda4-42fe-aed3-468969e4a676", "name": "International Conference on Software Engineering Research and Applications", "type": "conference", "alternate_names": ["Int Conf Softw Eng Res Appl", "Software Engineering Research and Applications", "Softw Eng Res Appl", "SERA"], "url": "http://www.acisinternational.org/"}, "title": "Orchestrating Apache NiFi/MiNiFi within a Spatial Data Pipeline", "abstract": "In many smart city projects, a common choice to capture spatial information is the inclusion of LiDAR data, but this decision will often invoke severe growing pains within the existing infrastructure. In this paper, we introduce a data pipeline that orchestrates Apache NiFi (NiFi), Apache MiNiFi (MiNiFi), and several other tools as an automated solution in order to relay and archive LiDAR data captured by deployed edge devices. The LiDAR sensors utilized within this workflow are Velodyne Ultra Pucks sensors that capture at a rate of 10 frames per second and produces 6-7 GB packet capture (PCAP) files per hour. By both compressing the file after capturing it and compressing the file in real-time, we discovered that gzip produced a file of 5 GB and saved about 5 minutes in transmission time to NiFi, as well as saving considerable CPU time when compressing the file in real-time. Alternatively, we chose XZ as the compression algorithm for the ingestion of LiDAR data onto an institution compute cluster due to its high compression ratio. In order to evaluate the capabilities of our system design, the features of this data pipeline were compared against existing third-party services, namely Globus and RSync.", "venue": "International Conference on Software Engineering Research and Applications", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-05-23", "journal": {"name": "2023 IEEE/ACIS 21st International Conference on Software Engineering Research, Management and Applications (SERA)", "pages": "366-371"}, "authors": [{"authorId": "3138002", "name": "Chase D. Carthen"}, {"authorId": "2227710835", "name": "Araam Zaremehrjardi"}, {"authorId": "144217530", "name": "Vinh D. Le"}, {"authorId": "2227719887", "name": "Carlos Cardillo"}, {"authorId": "39395844", "name": "S. Strachan"}, {"authorId": "144391600", "name": "A. Tavakkoli"}, {"authorId": "144914137", "name": "F. Harris"}, {"authorId": "1754449", "name": "S. Dascalu"}], "citations": []}
