{"paperId": "b00f836c62d0ea7678d0f20aeec3397138633060", "publicationVenue": {"id": "2baad992-2268-4c38-9120-e453622f2eeb", "name": "Journal of Medical Internet Research", "type": "journal", "alternate_names": ["J Med Internet Res"], "issn": "1438-8871", "url": "http://www.symposion.com/jmir/index.htm", "alternate_urls": ["http://www.jmir.org/", "https://www.jmir.org/"]}, "title": "Health Care and Precision Medicine Research: Analysis of a Scalable Data Science Platform", "abstract": "Background Health care data are increasing in volume and complexity. Storing and analyzing these data to implement precision medicine initiatives and data-driven research has exceeded the capabilities of traditional computer systems. Modern big data platforms must be adapted to the specific demands of health care and designed for scalability and growth. Objective The objectives of our study were to (1) demonstrate the implementation of a data science platform built on open source technology within a large, academic health care system and (2) describe 2 computational health care applications built on such a platform. Methods We deployed a data science platform based on several open source technologies to support real-time, big data workloads. We developed data-acquisition workflows for Apache Storm and NiFi in Java and Python to capture patient monitoring and laboratory data for downstream analytics. Results Emerging data management approaches, along with open source technologies such as Hadoop, can be used to create integrated data lakes to store large, real-time datasets. This infrastructure also provides a robust analytics platform where health care and biomedical research data can be analyzed in near real time for precision medicine and computational health care use cases. Conclusions The implementation and use of integrated data science platforms offer organizations the opportunity to combine traditional datasets, including data from the electronic health record, with emerging big data sources, such as continuous patient monitoring and real-time laboratory results. These platforms can enable cost-effective and scalable analytics for the information that will be key to the delivery of precision medicine initiatives. Organizations that can take advantage of the technical advances found in data science platforms will have the opportunity to provide comprehensive access to health care data for computational health care and precision medicine research.", "venue": "Journal of Medical Internet Research", "year": 2019, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-04-01", "journal": {"name": "Journal of Medical Internet Research", "volume": "21"}, "authors": [{"authorId": "51208883", "name": "J. McPadden"}, {"authorId": "48946116", "name": "T. Durant"}, {"authorId": "5328311", "name": "Dustin R. Bunch"}, {"authorId": "38385690", "name": "A. Coppi"}, {"authorId": "144696683", "name": "Nathaniel Price"}, {"authorId": "15671883", "name": "Kris Rodgerson"}, {"authorId": "51219288", "name": "C. Torre"}, {"authorId": "1412757151", "name": "William Byron"}, {"authorId": "2474559", "name": "A. Hsiao"}, {"authorId": "2467795", "name": "H. Krumholz"}, {"authorId": "14677344", "name": "W. Schulz"}], "citations": [{"paperId": "e9f1e0344134628dd4211b8576decdf712cc3248", "title": "Use of Electronic Health Records to Characterize Patients with Uncontrolled Hypertension in Two Large Health System Networks"}, {"paperId": "4cf4083fa28d1a892a179f9da0f1d978a4efdbd2", "title": "Enhancing the Healthcare Management System with National Identification: In the Bangladesh Perspective"}, {"paperId": "111284d38f77b819e454526e7915240862e6d5a4", "title": "Distributed Data Processing: A Scalable and Cost-Effective Approach"}, {"paperId": "0e214da4495e9eecf6d47e592aaa6a6d8808527c", "title": "Implementation of Modeling and Distribution of a Big Data Warehouse"}, {"paperId": "db5c97a2096eb7b93617e45228179ea3f4e102f8", "title": "Fuzzy Rule Based- Model for Proficient Heart Disease Prediction in Data Lake"}, {"paperId": "da72dd8c23a7d0c0f85324d4bb6ec1d43c3c53f0", "title": "Use of Electronic Health Records to Characterize Patients with Uncontrolled Hypertension in Two Large Health System Networks"}, {"paperId": "b57be6d084c81a7a7d1b88259c72d870a87f6a9b", "title": "Personalised Medicine—Implementation to the Healthcare System in Europe (Focus Group Discussions)"}, {"paperId": "95bcb67ec106a75f3b4b06006845537a4159f898", "title": "Design and Development of a Big Data Platform for Disease Burden Based on the Spark Engine"}, {"paperId": "b491d420eebdc8367cb0d8ab42a5652586dea375", "title": "Data Science to Enhance Research Capacity of a Research-Intensive Medical College"}, {"paperId": "a1d490ad8f2bb86d723a0e6ce68556c6b8e8b1a5", "title": "Association between primary or booster COVID-19 mRNA vaccination and Omicron lineage BA.1 SARS-CoV-2 infection in people with a prior SARS-CoV-2 infection: A test-negative case–control analysis"}, {"paperId": "ba207d731ef2d05ef03577735c41f25b34472439", "title": "A Precision Health Service for Chronic Diseases: Development and Cohort Study Using Wearable Device, Machine Learning, and Deep Learning"}, {"paperId": "9b161df91184ee82a071ee01d6f43173bd5a0326", "title": "Novel Machine-Learning Based Framework Using Electroretinography Data for the Detection of Early-Stage Glaucoma"}, {"paperId": "a944af193a8ae867d73fd3b984b5ac39efe8264a", "title": "Effectiveness of Primary and Booster COVID-19 mRNA Vaccination against Infection Caused by the SARS-CoV-2 Omicron Variant in People with a Prior SARS-CoV-2 Infection"}, {"paperId": "be489552483fe854cd7d1dc4cc794fb36facee97", "title": "A multicenter evaluation of computable phenotyping approaches for SARS-CoV-2 infection and COVID-19 hospitalizations"}, {"paperId": "2febd636f23c975ab95fd58682f8b0396e7c656b", "title": "Data Integration Challenges for Machine Learning in Precision Medicine"}, {"paperId": "3176a1dc10dece2621634e31b93c84e783ad0f7f", "title": "Vertical integration in healthcare: What does literature say about improvements on quality, access, efficiency, and costs containment?"}, {"paperId": "2c0f82fbdd6e12a42ff62524700b83768d473952", "title": "An artificial intelligence model for heart disease detection using machine learning algorithms"}, {"paperId": "c398dcf2ba888be4e85238ab61a166fb1f286747", "title": "Efficient Data Exchange Between Typical Data Lake and DWH Corporate Systems"}, {"paperId": "64cf27b3c6f73aa8b3b8641f355573407721f7b7", "title": "Visual Exploratory Data Analysis for Copy Number Variation Studies in Biomedical Research"}, {"paperId": "904052beaa2f124b506b56693d2444c0c6a7b2b6", "title": "Predictors of diagnostic transition from major depressive disorder to bipolar disorder: a retrospective observational network study"}, {"paperId": "35efec95598e8d0436a6893bc7e44c5c4a4d87dc", "title": "RETRACTED ARTICLE: Intelligent Big Data Analytics Model for Efficient Cardiac Disease Prediction with IoT Devices in WSN Using Fuzzy Rules"}, {"paperId": "8959e9653139b627d6dc5d53018df1051d107508", "title": "Feasibility of capturing real-world data from health information technology systems at multiple centers to assess cardiac ablation device outcomes: A fit-for-purpose informatics analysis report"}, {"paperId": "f053e49951cd8b737c313720dbcde30040d07cae", "title": "Social Determinants of Health and Cardiovascular Disease: Current State and Future Directions Towards Healthcare Equity"}, {"paperId": "10f8b6d736f5880eec41c2c73cfb8ee83f458743", "title": "Longitudinal Changes in COVID-19 Associated In-Hospital Mortality"}, {"paperId": "772e41111a1d99f1c1dbd4fb340b863ff4412348", "title": "Applications of Digital Microscopy and Densely Connected Convolutional Neural Networks for Automated Quantitation of Babesia-Infected Erythrocytes"}, {"paperId": "2d89a508be3bbb60aa4b5f1676fdba617a0f9d2d", "title": "Longitudinal Assessment of SARS-CoV-2 Anti-Nucleocapsid and anti-Spike-1-RBD Antibody Testing Following PCR-Detected SARS-CoV-2 Infection"}, {"paperId": "72a8db493253b9ae35174d9936de67fca0cdbc19", "title": "Accuracy of Computable Phenotyping Approaches for SARS-CoV-2 Infection and COVID-19 Hospitalizations from the Electronic Health Record"}, {"paperId": "2035481caf35df6268958853c0013297fe46de32", "title": "Neptune: An environment for the delivery of genomic medicine"}, {"paperId": "7576884eed0bbb25569a4c31e13831147be94408", "title": "Assessment of Inter-Institutional Post-Operative Hypoparathyroidism Status Using a Common Data Model"}, {"paperId": "d6510182993933494d8a76254bd2373b1809edde", "title": "Diverse Functional Autoantibodies in Patients with COVID-19"}, {"paperId": "c878e23ff19478e96b5dbb59b2df6757b8a9f262", "title": "Big Data in Healthcare: COVID-19, EHRs, Uses and Challenges"}, {"paperId": "e6f3584c3074375d8bae39d909cfa10596b0376c", "title": "A systematic literature review of data science, data analytics and machine learning applied to healthcare engineering systems"}, {"paperId": "1e215b8615b058df5b389fc0396682111f32b43c", "title": "Futures for Health Research Data Platforms From the Participants’ Perspectives"}, {"paperId": "23840c90749d4e39ea309e4addb802e5813c63ad", "title": "Democratizing EHR analyses with FIDDLE: a flexible data-driven preprocessing pipeline for structured clinical data"}, {"paperId": "05544cf65cb541fd135f021e36d26207c25a6d82", "title": "Big Data and Digital Solutions: Laying the Foundation for Cardiovascular Population Management CME."}, {"paperId": "ddfc6704e3cc4c99ca4a70d1aac5662014eca8c4", "title": "Association between coronary artery bypass graft center volume and year-to-year outcome variability: New York and California statewide analysis."}, {"paperId": "7bf524449a8896cc34cf8f0eca12c3cf6cbde748", "title": "Development and Validation of the Quick COVID-19 Severity Index: A Prognostic Tool for Early Clinical Decompensation"}, {"paperId": "b321d784a987065867df2d597b77841d4ebfeadc", "title": "Applying Cloud Based Machine Learning on Biosensors Streaming Data for Health Status Prediction"}, {"paperId": "d497180fb2023bdc8b3a7b633582a1c4b31e7545", "title": "Real-World Integration of a Sepsis Deep Learning Technology Into Routine Clinical Care: Implementation Study"}, {"paperId": "a85d2dff49abf7cc14453804a9b0a330441dd50e", "title": "The Promise of Big Data and Digital Solutions in Building a Cardiovascular Learning System: Opportunities and Barriers."}, {"paperId": "2da99d133d9f1f7917e6c29a2177e89bf97cd065", "title": "Publication Trends in Psychotherapy: Bibliometric Analysis of the Past 5 Decades."}, {"paperId": "4454571d59c042da45b3422e8dd1a804f1780981", "title": "Big Data in Healthcare: Technologies, Need, Advantages, and Disadvantages"}, {"paperId": "26799d6fae31e00570cb70bc93ef54fa9c7b82a2", "title": "Patient factors associated with SARS‐CoV‐2 in an admitted emergency department population"}, {"paperId": "dc03afc8992f9c53b540381a2688f6354fe5e506", "title": "Development and validation of the COVID-19 severity index (CSI): a prognostic tool for early respiratory decompensation"}, {"paperId": "5b9ea2abf1c5a04b3024367409284edceb741ef2", "title": "A new paradigm for accelerating clinical data science at Stanford Medicine"}, {"paperId": "b46af72bdbaeaaccdc49b9506208e6c103eead86", "title": "Agile Health Care Analytics: Enabling Real-Time Disease Surveillance With a Computational Health Platform"}, {"paperId": "d8a7b5c50cec40741c6cb441081ed8d2dc985edd", "title": "A practical approach to storage and retrieval of high-frequency physiological signals"}, {"paperId": "1ade772f489b4027b3fed3a5869988bc0ea56034", "title": "Desiderata for delivering NLP to accelerate healthcare AI advancement and a Mayo Clinic NLP-as-a-service implementation"}, {"paperId": "e2d2f3eb0ae0ad634d7ed1c064a523f9f081826d", "title": "Blood utilisation and transfusion reactions in adult patients transfused with conventional or pathogen‐reduced platelets"}, {"paperId": "906a30786a301d1c28981860b90250602fe39b89", "title": "Data Lakes in Healthcare: Applications and Benefits from the Perspective of Data Sources and Players"}, {"paperId": "c41d95fb7e8e55717926078ec09bcf8738fc93a8", "title": "Intelligent Decision Support System for Precision Medicine; Time Series Multi-variable Approach for Data Processing"}, {"paperId": "076ba027b576bc3287f706e6bc39c93d12399b2c", "title": "Tools, Technologies, and Methodologies to Support Data Science"}, {"paperId": "ad69c0c1596a80b58c1856446c0aabba2cac3918", "title": "A Platform for Interactive Data Science with Apache Spark for On-premises Infrastructure"}, {"paperId": "1cbfe825b4c6fb84477d84ebe1a2fe0ccb3e1491", "title": "BIG DATA ANALYTICS IN HEART DISEASES PREDICTION"}]}
