{"paperId": "b01542b5584a668b3634655b59532b104930611b", "publicationVenue": {"id": "89097a03-8be6-4e2d-ae2c-a6df64c77a06", "name": "Frontiers in Psychology", "type": "journal", "alternate_names": ["Front Psychol"], "issn": "1664-1078", "url": "http://www.frontiersin.org/Cultural_Psychology", "alternate_urls": ["http://frontiersin.org/psychology/", "https://www.frontiersin.org/journals/psychology", "http://journal.frontiersin.org/journal/psychology", "http://www.frontiersin.org/psychology"]}, "title": "The Teaching Strategy of Socio-Political Education by Deep Learning Under Educational Psychology", "abstract": "This study aims to optimize the teaching content of ideological and political courses and guide students to establish correct values. Inspired by Artificial Intelligence, the K-means clustering algorithm was applied to the neural collaborative filtering algorithm through temporal data. Besides, a deep learning algorithm was designed for the improved matrix factorization. The evaluation indicators were selected through experiments. The relevant data sets were used for simulation and testing. The test results indicated that the Root Mean Square Error of this scheme was 1.251, and the Mean Absolute Error was 0.625. These index measurement values were better than those of similar algorithms, indicating this model has better performance after optimization and can recommend suitable courses. The innovative algorithm designed to construct the classroom teaching model of social and political education can accurately recommend proper courses according to the students’ learning situation reflecting their psychological states. The research provides adaptive teaching for students, enables interaction between teachers and students, and helps students form correct values. It also has an important role in improving the teaching strategies.", "venue": "Frontiers in Psychology", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-02-07", "journal": {"name": "Frontiers in Psychology", "volume": "13"}, "authors": [{"authorId": "2117102370", "name": "Zhen Chen"}, {"authorId": "2114091839", "name": "Lan Wen"}, {"authorId": "2157770559", "name": "Xiaoqing He"}, {"authorId": "2158503140", "name": "Peiyao Chen"}, {"authorId": "2119107451", "name": "Huan Wu"}], "citations": [{"paperId": "6e504e9324d38b24171474e0307e26ad15574ab2", "title": "Ideological and Political Construction of the Course “Identification of Traditional Chinese Medicine and Practical Training of Prescriptions” under the Background of Three Comprehensive Education"}]}
