{"paperId": "b0160ffbfeeb2b8593e1f31fb149acde5d24b6b6", "publicationVenue": null, "title": "iTurboGraph: Scaling and Automating Incremental Graph Analytics", "abstract": "With the rise of streaming data for dynamic graphs, large-scale graph analytics meets a new requirement of Incremental Computation because the larger the graph, the higher the cost for updating the analytics results by re-execution. A dynamic graph consists of an initial graph G and graph mutation updates Δ G$ of edge insertions or deletions. Given a query Q, its results $Q(G)$, and updates for Δ G$ to G, incremental graph analytics computes updates Δ Q$ such that Q($G \\cup Δ G)$ = $Q(G)$ $\\cup$ Δ Q$ where $\\cup$ is a union operator. In this paper, we consider the problem of large-scale incremental neighbor-centric graph analytics (\\NGA ). We solve the limitations of previous systems: lack of usability due to the difficulties in programming incremental algorithms for \\NGA and limited scalability and efficiency due to the overheads in maintaining intermediate results for graph traversals in \\NGA. First, we propose a domain-specific language, ŁNGA, and develop its compiler for intuitive programming of \\NGA, automatic query incrementalization, and query optimizations. Second, we define Graph Streaming Algebra as a theoretical foundation for scalable processing of incremental \\NGA. We introduce a concept of Nested Graph Windows and model graph traversals as the generation of walk streams. Lastly, we present a system \\SystemName, which efficiently processes incremental \\NGA for large graphs. Comprehensive experiments show that it effectively avoids costly re-executions and efficiently updates the analytics results with reduced IO and computations.", "venue": "SIGMOD Conference", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2021-06-09", "journal": {"name": "Proceedings of the 2021 International Conference on Management of Data"}, "authors": [{"authorId": "3416182", "name": "Seongyun Ko"}, {"authorId": "2801206", "name": "Taesung Lee"}, {"authorId": "2067656204", "name": "Kijae Hong"}, {"authorId": "2148961350", "name": "Wonseok Lee"}, {"authorId": "2113614601", "name": "In Seo"}, {"authorId": "1491137873", "name": "Jiwon Seo"}, {"authorId": "144422954", "name": "Wook-Shin Han"}], "citations": [{"paperId": "457bbb0f64729dcfb15fe11be2b7fce91fcb1243", "title": "CompressGraph: Efficient Parallel Graph Analytics with Rule-Based Compression"}, {"paperId": "794cb4d569eb4eab91b7f7cb0c348f1c6f21ff9a", "title": "Fast Continuous Subgraph Matching over Streaming Graphs via Backtracking Reduction"}, {"paperId": "67a6f91179cc1fcc8408c26ab9b90e5c38ab0d7f", "title": "Layph: Making Change Propagation Constraint in Incremental Graph Processing by Layering Graph"}, {"paperId": "1603eb275f0873d806220060d6f25a3616b6705d", "title": "Optimizing Differentially-Maintained Recursive Queries on Dynamic Graphs"}, {"paperId": "0ea68e613393b930c97175c516459dbec5dfd238", "title": "Temporal graph patterns by timed automata"}]}
