{"paperId": "b01fe62c59670016a9eff22ed90088bda1ea28b8", "publicationVenue": {"id": "f0ce7adf-15fa-4cab-81ae-e0ed8fc48b3b", "name": "Iconics", "type": "journal", "alternate_names": ["Iconics"], "issn": "1345-4447"}, "title": "Predicting Students' Behavior Towards their Degree using Machine Learning Techniques", "abstract": "The phase of professional education is the most crucial part of a student’s life. One’s career might solely depend on how well the performance is. For better performance, a perfect attitude or behavior of the student is needed towards the degree. If a student is having a good mindset for the degree pursued, it will help them gain better results. In this paper, we are investigating the behavior of students toward their degrees. We conducted a survey and collected data from bachelors, masters, and doctorate students. To predict students’ behavior toward their degrees, we applied Machine Learning algorithms. We used a support vector machine, linear regression, k-nearest neighbor, naive bayes, and decision tree techniques to classify and predict the behaviors of students. Out of these techniques, the support vector machine performed well giving an accuracy of 59%. We applied the k-fold method to find the results. According to the results, 52.6% of students are optimistic about their degree, 40% consider it trustworthy, 3.5% think it is untrustworthy and 3.9% are pessimistic about their degree. Knowing the behavior or interest of students in their degree can help in boosting their productivity and increase their performance.", "venue": "Iconics", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference", "Review"], "publicationDate": "2022-12-14", "journal": {"name": "2022 3rd International Conference on Innovations in Computer Science & Software Engineering (ICONICS)", "pages": "1-6"}, "authors": [{"authorId": "72670937", "name": "K. Mahboob"}, {"authorId": "2309338", "name": "R. Asif"}, {"authorId": "1665012203", "name": "S. Mustafa"}, {"authorId": "2215039734", "name": "Humaira Rana"}], "citations": []}
