{"paperId": "b021383084dd7a1f7470c18534ba8f50d400d7ff", "publicationVenue": {"id": "200954ca-a7ab-4707-a9a8-ee93513d6e74", "name": "Social Media + Society", "type": "journal", "alternate_names": ["Social media and society", "Soc Media + Soc", "Soc media soc"], "issn": "2056-3051", "url": "https://journals.sagepub.com/home/sms", "alternate_urls": ["http://sms.sagepub.com/", "http://www.uk.sagepub.com/journals/Journal202332"]}, "title": "No Space for Reddit Spacing: Mapping the Reflexive Relationship Between Groups on 4chan and Reddit", "abstract": "4chan and Reddit have often been lumped together as similar home turfs for geeky, masculine-coded, problematic communities thriving under laissez-faire governance. However, stressing these similarities may overlook not only how the platforms have drifted apart in political-economic terms but also how their similarity encourages assertions of difference between its users. In dialogue with theories on ritual opposition and platform imaginaries, I interrogate this dialectic by tracing the relationship between groups on 4chan and Reddit. How has this relationship developed over time and between subgroups? What do the fractured, fluctuating cross-site associations teach us about the collectivity of both sites? By quantitatively mapping cross-mentions in large archives of Reddit, 4chan/b/, and 4chan/pol/, I identify a lopsided rivalry: 4channers consistently employed antagonistic phrases and stereotypes of Reddit, but 4chan’s relevance throughout Reddit is waning. I moreover find that a platform imaginary of 4chan as neutral, diverse, and unfiltered contradicts with the incessant discursive hostility of its users. The text thereby demonstrates how the collectivization of online subcultures is shaped by reflexive cross-site relations that feature a complex interplay between discursive boundary work, contrasting platform vernaculars, and political resentment.", "venue": "Social Media + Society", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-10-01", "journal": {"name": "Social Media + Society"}, "authors": [{"authorId": "2273377129", "name": "S. Hagen"}], "citations": []}
