{"paperId": "b02580bbd2d82a708ce81936ae6901d82e0ffac0", "publicationVenue": {"id": "3416dd37-f45d-40ed-b04e-875fcff8fa2f", "name": "Nutrients", "type": "journal", "issn": "2072-6643", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169249", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169249", "http://www.mdpi.com/journal/nutrients/", "https://www.mdpi.com/journal/nutrients"]}, "title": "Chinese Dietary Indices and Glioma: New Insights of a Case–Control Study in the Chinese Population", "abstract": "Identifying modifiable factors in primary prevention strategies is a typical goal of glioma epidemiology. Among many glioma risk factors, diet was always considered as one. Most of the relevant studies thus far were concentrated on the West. It was crucial to investigate the connection between the Chinese diet and gliomas given the stark variations between western and eastern diets. A food frequency questionnaire including 114 items was used to investigate the food intake of the study subjects. The Chinese Dietary Quality Index (CDQI), the Chinese Dietary Balance Index (CDBI), the Dietary Antioxidant Index (DAI), the Dietary Inflammation Index (DII), and the Chinese Healthy Eating Index (CHEI) were calculated based on the data provided by the food frequency questionnaire to evaluate dietary quality, dietary balance, dietary antioxidants, dietary inflammation and adherence to the Chinese dietary guidelines in 506 glioma patients and 506 controls, respectively. After adjusting covariates, CHEI (OR = 0.90, 95% CI: 0.88–0.93) and DAI (OR = 0.61, 95% CI: 0.54–0.70) were correlated to a reduced glioma risk, and CDBI-based undernutrition (OR = 1.08, 95% CI: 1.06–1.12) and overnutrition (OR = 1.14, 95% CI: 1.09–1.20) and DII (OR = 2.20, 95% CI: 1.81–2.68) were correlated to an elevated glioma risk. Moreover, restrictive cubic spline analysis showed that there were significant nonlinear dose–response relationships between CHEI, CDBI, DAI, DII, and glioma. Therefore, adhering to the Chinese dietary guidelines was connected with a lower glioma risk, and undernutrition and overnutrition in the Chinese diet were associated with an increased risk of glioma.", "venue": "Nutrients", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-01", "journal": {"name": "Nutrients", "volume": "15"}, "authors": [{"authorId": "1820901023", "name": "Weichunbai Zhang"}, {"authorId": "2145948687", "name": "Yongqi He"}, {"authorId": "2650184", "name": "F. Chen"}, {"authorId": "2109453995", "name": "Ce Wang"}, {"authorId": "50759278", "name": "xun kang"}, {"authorId": "2218841476", "name": "Yue Peng"}, {"authorId": "2143122133", "name": "Wenbin Li"}], "citations": []}
