{"paperId": "b027dcdff9540f6e88082d38fda6c4ab68d43d2c", "publicationVenue": {"id": "54cdc508-6fba-4c63-8523-bbcb668fc2ca", "name": "Applied System Innovation", "alternate_names": ["Appl Syst Innov"], "issn": "2571-5577", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-1109441", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-1109441", "https://www.mdpi.com/journal/asi"]}, "title": "Digital Twins Driven Supply Chain Visibility within Logistics: A New Paradigm for Future Logistics", "abstract": "The supply chains shaping their distribution networks become more diverse as companies respond to global markets’ stringent criteria. This is also counterproductive to the visibility of the supply chain within the company and can adversely affect the organization’s core business. This paper attempts to evaluate how organizations can benefit from introducing Digital Twins to enhance their logistics supply network visibility. Additionally, deployment issues and technologies supporting Digital Twins were reviewed. This study used ATLAS.ti 9 software tools to save, classify, and evaluate the data for this analysis to systematically review the literature. We reviewed, compiled, and sorted papers from 227 publications for this article and then recognized 104 as critical to the work scope; this analysis’ quest date was set from 2002 to 2021. This article represents the first attempt at dealing with the issue of supply chain visibility through the Digital Twins in the logistics field. The research outcomes found that Digital Twins would help companies develop predictive metrics, diagnostics, projections, and physical asset descriptions for their logistics. This study also suggested some steps to overcome the challenges in implementing a Digital Twins in the logistics industry. For researchers, this review offers the possibility to unify and expand existing solutions and to identify links and interfaces that are still needed. As for managerial implications, this study can be used to identify future strategies and technologies to fulfil certain logistics tasks and develop new technological solutions for current and future demands.", "venue": "Applied System Innovation", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2021-04-21", "journal": {"name": "Applied System Innovation", "pages": "29", "volume": "4"}, "authors": [{"authorId": "1749674880", "name": "T. Moshood"}, {"authorId": "98068419", "name": "G. Nawanir"}, {"authorId": "1919821", "name": "S. Sorooshian"}, {"authorId": "95790190", "name": "O. Okfalisa"}], "citations": [{"paperId": "0ae155cdb0bf475e621053c6c617764cdf917742", "title": "Infrastructure digital twin technology: A new paradigm for future construction industry"}, {"paperId": "012f2c984d3f70f74ddad1fc388c7e5574d128ea", "title": "Digital Twins and Industrial Internet of Things: Uncovering operational intelligence in industry 4.0"}, {"paperId": "bbbe18f06e9d2208779b74652311b00fc3b5b3af", "title": "The Impact of COVID-19 on supply chain analytics: A global review"}, {"paperId": "cb006c23c2512c5b8e0b3e1c080f79f5af6db75b", "title": "Organizational Processes for Adopting Breakthrough Technology: Text Mining of AI Perception among Japanese Firms"}, {"paperId": "56234b34ce8a8a89f95ba5bc9da4682e8051a211", "title": "Roles of digital twins on material performances and utilization on upstream industry (The case of automotive industry)"}, {"paperId": "95b482eeb4e2a863ae0a247761f3e10f60994ee7", "title": "Bibliometric survey of futuristic technologies for sustainable supply chain visibility"}, {"paperId": "67cfbcad5f82e3a7f58b1c4dca5d03eb4df96509", "title": "Digital Twins for Supply Chains: Main Functions, Existing Applications, and Research Opportunities"}, {"paperId": "1c57a72bb015811e4dbc3e5d3f71f4f56b0435ad", "title": "Digital Twins for Logistics and Supply Chain Systems: Literature Review, Conceptual Framework, Research Potential, and Practical Challenges"}, {"paperId": "79b9efaf8056e70faefcc756ab7d089d6540d74f", "title": "A framework for digital twins solutions for 5 PL operators"}, {"paperId": "082ad4ecae9088a48e75c0ae7173295684d521ec", "title": "Digital twin-based warehouse management system: a theoretical toolbox for future research and applications"}, {"paperId": "c6f1e8743b7c5b3f2ff1b4c7f4d779a278c6c07f", "title": "Chaîne logistique des PMEs de la sous-traitance électronique : comment améliorer les process logistiques grâce aux technologies digitales ?"}, {"paperId": "0ffabb6d7bdf6c8713c4d98058ac674c4b23ab79", "title": "Analyzing the Implementation of Digital Twins in the Agri-Food Supply Chain"}, {"paperId": "b6d38d1915e036784794cad480b92d852543e6ea", "title": "The impact of digital twins on the evolution of intelligent manufacturing and Industry 4.0"}, {"paperId": "238f78682a63fc2fde1bab8bc1ba65e7e3908191", "title": "Exploring Digital Twins in the Transport and Energy Fields: A Bibliometrics and Literature Review Approach"}, {"paperId": "232647fad818a5eddd099aee7aca464a773c4b45", "title": "Digital twin for smart manufacturing, A review"}, {"paperId": "8b830c915b038625df5fef591e80c434aff40d7e", "title": "Contractor payment delays: a systematic review of current trends and future directions"}, {"paperId": "571479314347b471787fb1b1d2eda142a34295d5", "title": "Feasibility of Digital Twins to Manage the Operational Risks in the Production of a Ready-Mix Concrete Plant"}, {"paperId": "2dc3039a38c68e6d00aabb72d1075162c7bae088", "title": "Digital twin applications in urban logistics: an overview"}, {"paperId": "39b39a42aebfb1e7429159fa0b93c0b72bc50d8a", "title": "Research on Real-Time Robust Optimization of Perishable Supply-Chain Systems Based on Digital Twins"}, {"paperId": "262310ce9885ad62d4bbdde3c7ed0e5217c2306d", "title": "Information Technology and Digital Sufficiency for Building the Sustainable Circular Economy"}, {"paperId": "a425fb3e16acb05e8495f957279f011f6fce8c54", "title": "Digital Twins in Industry 5.0"}, {"paperId": "ff77405c341bb85d6a75a521e1145ba3f089e372", "title": "The impact of using digital technologies on supply chain resilience and robustness: the role of memory under the covid-19 outbreak"}, {"paperId": "d173f20e07e6e125e1745c875191d9845b627dbc", "title": "Considering IT Trends for Modelling Investments in Supply Chains by Prioritising Digital Twins"}, {"paperId": "92130113af69870ebc5e85c7ced29e8f91e80fd9", "title": "Digital twin application for attach detection and mitigation of PV-based smart systems using fast and accurate hybrid machine learning algorithm"}, {"paperId": "beeff2465ebde45b38bdba59e2b184fe9dc510db", "title": "Digital Twin: Benefits, use cases, challenges, and opportunities"}, {"paperId": "b8021e2ba902445f2330648b3f617cd00f292591", "title": "A Modernized Framework for Transportation Decision-Making in a Hyper-Integrated Global Supply Chain Environment"}, {"paperId": "df62a27e575646e13e10e2f3b5fd337c892c16ef", "title": "Digitalization of Supply Chain Management with Industry 4.0 Enabling Technologies: A Sustainable Perspective"}, {"paperId": "7ff2f3ac4994c51c08b2dec0262087fe684313b2", "title": "A Generic Digital Twin Framework for Collaborative Supply Chain Development"}, {"paperId": "79b23e4e04bf79de087080192c26711beef72eb9", "title": "Digitalization strategies and evaluation of maritime container supply chains"}, {"paperId": "8c1f591ba0087e232f098d7606ca2f55a8da0612", "title": "Convergence of Distributed Ledger Technologies with Digital Twins, IoT, and AI for fresh food logistics: Challenges and opportunities"}, {"paperId": "5d17b21af0af0cd0c58137f424b5ceb39de219d0", "title": "Concept of a Business-Process-Related Digital Twin Based on Systems Theory and Operational Excellence"}, {"paperId": "388d9176fa2af78413ce969e478757e4ec847834", "title": "Applicability of Industry 4.0 Technologies in the Reverse Logistics: A Circular Economy Approach Based on COmprehensive Distance Based RAnking (COBRA) Method"}, {"paperId": "6db37b5495262323f148676a7e83e550da4a3df2", "title": "TEDARİK ZİNCİRİ GÖRÜNÜRLÜĞÜNÜ ETKİLEYEN FAKTÖRLER VE GÖRÜNÜRLÜĞÜN İŞLETME PERFORMANSIYLA İLİŞKİSİ: TÜRKİYE’DE SAHA ARAŞTIRMASI"}, {"paperId": "91965da16b9ab405006cbae3a01577afcb71f970", "title": "Evaluation of Production of Digital Twins Based on Blockchain Technology"}, {"paperId": "aa3757ca8559aa2bdaebc777e9f6e22d460c0cdf", "title": "Toward digital construction supply chain-based Industry 4.0 solutions: scientometric-thematic analysis"}, {"paperId": "be12d21c57c2637bab7c9937865ac159cd06eb09", "title": "Smart Energy Management System: Design of a Monitoring and Peak Load Forecasting System for an Experimental Open-Pit Mine"}, {"paperId": "b3d0f46f4d739294a8f794772ac4e6af79707ee9", "title": "Digital twin-driven smart supply chain"}, {"paperId": "b2ea06ac736c297e6fbb8d37fb18b4d99eb62a2f", "title": "Mapping the postharvest life of imported fruits from packhouse to retail stores using physics-based digital twins"}, {"paperId": "d6e87ff5f042daaf7620052490d4444746a0f662", "title": "Sustainability of biodegradable plastics: New problem or solution to solve the global plastic pollution?"}, {"paperId": "755735b9cb64db3b20680a9fe5616b984deee30d", "title": "3D Printing and Implementation of Digital Twins: Current Trends and Limitations"}, {"paperId": "c6acc0a6c96b921f65929462a2e68b5e3e0c6393", "title": "Digital Twin Framework for Large-Scale Optimization Problems in Supply Chains: A Case of Packing Problem"}, {"paperId": "dc465406318f65baa00400ab7e83b9d25b3b820c", "title": "Green and low carbon matters: A systematic review of the past, today, and future on sustainability supply chain management practices among manufacturing industry"}, {"paperId": "6db137480b8cbc71c4c955147f870f2b112e467f", "title": "Sustainable Development of Smart Manufacturing Driven by the Digital Twin Framework: A Statistical Analysis"}, {"paperId": "407413e470f955686d69705f169d1cbfa81899ae", "title": "Examining the Challenges and Opportunities of Managing Public Services in a Complex and Interconnected World"}, {"paperId": "10da241aa40ffd4633691d641eb0bb310ba96b54", "title": "Disorders, Vulnerabilities and Resilience in the Supply Chain in Pandemic Times"}, {"paperId": "abd4daf16be48cc1e6219b213f8b31ed18c02da7", "title": "Digital Twin-Enabled Smart Maritime Logistics Management in the Context of Industry 5.0"}, {"paperId": "144a0d1bcd4cfb02bc1b88fab857c42184d3b8ff", "title": "Effects of Supply Chain Visibility on Supply Chain Performance in Ghana Health Service: The Case of Kumasi Metro Health Directorate"}, {"paperId": "1c430c1211346e8244298bdf8e98958de3f011e2", "title": "Strategies for Achieving Pre-emptive Resilience in Military Supply Chains"}, {"paperId": "8e3ddc0b423317bcd74812a2ddcdfffdf3a0534f", "title": "Digital Twin for Inventory Planning of Fresh Produce"}, {"paperId": "d57fea611cbc994f1891b4b1ab590b3d825ba2e1", "title": "ArticleEvaluation for Product of Digital Twin Based on Blockchain TechnologyNada A. Nabeeh1"}, {"paperId": "81cb0a9b10e42055800cb5512af6f1e2b4100010", "title": "Warehouses Against Cyber-Attack Risks"}, {"paperId": "45f4d6b3caf00b0d89c5d4bf628037b889cef940", "title": "Digital Twins Application in The Post-Harvest Supply Chain of Fruits and Vegetables: A Systematic Review of the Literature"}, {"paperId": "aaf48e5a016359feb0b74d3d1b6dacf8f1f2c71e", "title": "DIAGNOSTICS IN THE LOGISTICS ACTIVITY MANAGEMENT SYSTEM OF THE ENTERPRISE"}]}
