{"paperId": "b0304566c7a1f0b1a0616e8dcdaaec148fbbf401", "publicationVenue": {"id": "7ce37084-a5ed-4b33-9ed2-773757579896", "name": "Jurnal Riset Informatika", "type": "journal", "alternate_names": ["J Ris Inform"], "issn": "2656-1735"}, "title": "K-Means Binary Search Centroid With Dynamic Cluster for Java Island Health Clustering", "abstract": "This study is focused on determining the health status of each district/city in Java using the K-means Binary Search Centroid and Dynamic Kmeans algorithms. The research data uses data on the health profile of Java Island in 2020. Comparative algorithms were tested using the Davies Bound Index and Calinski-Harabasz Index methods on the traditional k-means algorithm and dynamic binary search centroid k-means. Based on the test, 5 clusters were found in the distribution area, including 11 regions with very high health quality cluster 1, 24 regions with high health quality, 28 regions with moderate health quality, and 28 clusters 4 with low health quality, 45 regions, and cluster 5 with deficient health quality is 11 regions, with the best validation value of DBI 1.8175 and CHI 67.7868. Overall optimization of the dynamic k-means algorithm based on binary search centroid results in a better average cluster quality and a smaller number of iterations than the traditional k-means algorithm. The test results can be used as one of the best methods in evaluating the level of health in the Java Island area and a reference for decision-making in determining policies for related agencies", "venue": "Jurnal Riset Informatika", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-06", "journal": {"name": "Jurnal Riset Informatika"}, "authors": [{"authorId": "2222185617", "name": "Muhammad Andryan"}, {"authorId": "1570968095", "name": "Muhammad Faisal"}, {"authorId": "2075685575", "name": "Ririen Kusumawati"}], "citations": [{"paperId": "0a3c1f7ae33d6d027c1a2bf012b27c9066ce6aa2", "title": "Stunting Early Warning Application Using KNN Machine Learning Method"}]}
