{"paperId": "b031d1200101f78696f1521a8309c5328cbb9abc", "publicationVenue": {"id": "8e1bd4b5-d5b2-4e22-ba0a-01fe5568d472", "name": "Remote Sensing", "type": "journal", "alternate_names": ["Remote Sens"], "issn": "2315-4675", "alternate_issns": ["2072-4292"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169233", "alternate_urls": ["https://www.mdpi.com/journal/remotesensing", "http://www.mdpi.com/journal/remotesensing", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169233"]}, "title": "A Distributed N-FINDR Cloud Computing-Based Solution for Endmembers Extraction on Large-Scale Hyperspectral Remote Sensing Data", "abstract": "In this work, we introduce a novel, distributed version of the N-FINDR endmember extraction algorithm, which is able to exploit computer cluster resources in order to efficiently process large volumes of hyperspectral data. The implementation of the distributed algorithm was done by extending the InterCloud Data Mining Package, originally adopted for land cover classification, through the HyperCloud-RS framework, here adapted for endmember extraction, which can be executed on cloud computing environments, allowing users to elastically administer processing power and storage space for adequately handling very large datasets. The framework supports distributed execution, network communication, and fault tolerance, transparently and efficiently to the user. The experimental analysis addresses the performance issues, evaluating both accuracy and execution time, over the processing of different synthetic versions of the AVIRIS Cuprite hyperspectral dataset, with 3.1 Gb, 6.2 Gb, and 15.1Gb respectively, thus addressing the issue of dealing with large-scale hyperspectral data. As a further contribution of this work, we describe in detail how to extend the HyperCloud-RS framework by integrating other endmember extraction algorithms, thus enabling researchers to implement algorithms specifically designed for their own assessment.", "venue": "Remote Sensing", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-04-30", "journal": {"name": "Remote. Sens.", "pages": "2153", "volume": "14"}, "authors": [{"authorId": "31016870", "name": "V. A. A. Quirita"}, {"authorId": "144794424", "name": "G. Costa"}, {"authorId": "50413060", "name": "C. B. Castañón"}], "citations": [{"paperId": "82f35cf8c39cdcd3493ffdd272efe2e5038b8bc0", "title": "Analysis of Hyperspectral Data to Develop an Approach for Document Images"}, {"paperId": "bcdb567f229d1d383f0e2b0abe370312f487f3ee", "title": "Column-Spatial Correction Network for Remote Sensing Image Destriping"}, {"paperId": "7a533d4f3a7fc10fab239239dad458a09520e61b", "title": "Cloud-Based Analysis of Large-Scale Hyperspectral Imagery for Oil Spill Detection"}]}
