{"paperId": "b03198a66a5534d39bcc9c2f2d98d9817f3b1ee2", "publicationVenue": null, "title": "Evaluation of Factors Affecting Compressive Strength of Concrete using Machine Learning", "abstract": "Compressive strength of the concrete is important for analyzing the characteristics of the concrete. The compressive strength is necessary to know if the given mixture of concrete meets the specified requirements. For the sustainability of construction, the compressive strength must meet the required standards. Machine learning models have been really a handy tool for the analysis of a wide range of problems. Machine learning models can find the pattern or trends in the given data. The purpose of the paper is two folds. First, the evaluation of performance of different machine learning models (regression models) is done. In the second fold, the factors affecting compressive strength of the concrete are discussed. Different factors have different degrees of importance for various regressors. The importance of the factors is studied for different regressors and the conclusion is drawn regarding the importance of factors taken in the study.", "venue": "2020 Advanced Computing and Communication Technologies for High Performance Applications (ACCTHPA)", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2020-07-01", "journal": {"name": "2020 Advanced Computing and Communication Technologies for High Performance Applications (ACCTHPA)", "pages": "70-74"}, "authors": [{"authorId": "40303403", "name": "A. Jha"}, {"authorId": "1992911761", "name": "Surabhi Adhikari"}, {"authorId": "1978790638", "name": "Surendrabikram Thapa"}, {"authorId": "39107593", "name": "Abhay Kumar"}, {"authorId": "1992927477", "name": "Arunish Kumar"}, {"authorId": "1992816786", "name": "Sushruti Mishra"}], "citations": [{"paperId": "835a78460f8bbb0e5b04bd267180f35302a659b5", "title": "A comparative study of machine learning algorithms for the prediction of compressive strength of rice husk ash-based concrete"}, {"paperId": "b8de7a5c724834ecec9cdd55c00dd6edced29373", "title": "MLOps Spanning Whole Machine Learning Life Cycle: A Survey"}, {"paperId": "fd0f6e6de7c3952a58b2f7a7863996f52f117de1", "title": "Experimental validation of compressive strength prediction using machine learning algorithm"}, {"paperId": "9ed0d170fd559046a68ac8ab4916422ec198fade", "title": "Crack Detection of Structures using Deep Learning Framework"}, {"paperId": "f86ff52da3a20d85dde462d31e8bd2863102fa2f", "title": "Dog Breed Classifier for Facial Recognition using Convolutional Neural Networks"}, {"paperId": "677e544b48e82da26ac7d7dfb26dba9e43d348ea", "title": "AI and IoT Solutions for Tackling COVID-19 Pandemic"}, {"paperId": "6aeb2ebcd80c150a7497550dc59dbeb5e2197c1b", "title": "Accelerating Business Growth with Big Data and Artificial Intelligence"}, {"paperId": "fa0b9ed9cbf9243bf717997ce1c2dda42e5733ce", "title": "Parametric Assessment of Concrete Constituent Materials Using Machine Learning Techniques"}, {"paperId": "3d73bbe390f7b9a9590d2c05ef84a0c77380639f", "title": "A Study of Machine Learning Algorithms for Concrete Compressive Strength Prediction"}]}
