{"paperId": "b054f02ea2725e4145fec9369297657130f2824e", "publicationVenue": {"id": "ecc3036c-4c51-45be-8b2e-f5bb0ea3db40", "name": "International Conference on Autonomic Computing and Self-Organizing Systems", "type": "conference", "alternate_names": ["ACSOS", "Int Conf Auton Comput Self-organizing Syst"]}, "title": "SaVE: Self-aware Vehicular Edge Computing with Efficient Resource Allocation", "abstract": "Vehicular edge computing (VEC) generates an enormous amount of data, and the traditional approaches of task offloading lead to high energy consumption and latency. This paper addresses these challenges faced in VEC, focusing on vehicles’ self-awareness and optimizing edge resources. Therefore, we propose SaVE, which uses self-awareness for vehicles to better understand their internal states and external environments and employs an adapted Exponential Particle Swarm Optimization (ExPSO) for the VEC environment (VExPSO) to efficiently search for optimal edge servers for task offloading. SaVE optimizes energy consumption and latency by considering network conditions, vehicle states, and offloading only when necessary to the most suitable edge server. We further enhance VExPSO with a neighborhood-based topology, adaptive parameters, warm-start, and heuristic-guided exploration for improved search capabilities in the dynamic VEC environment. In addition, we employ a deep deterministic policy gradient (DDPG) algorithm and hierarchical federated learning (FL) for accurate perception of the vehicles’ internal states and external environments. Simulation results verified that SaVE serves as a self-aware solution for VEC, meeting anticipated performance benchmarks by significantly minimizing energy consumption by approximately 77.29%, and minimizing latency by approximately 73.42%, when the highest maximum tolerance time (MTT), 450ms, of applications is considered.", "venue": "International Conference on Autonomic Computing and Self-Organizing Systems", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-09-25", "journal": {"name": "2023 IEEE International Conference on Autonomic Computing and Self-Organizing Systems (ACSOS)", "pages": "157-162"}, "authors": [{"authorId": "31992763", "name": "Aamir Akbar"}, {"authorId": "102804035", "name": "S. Belhaouari"}], "citations": []}
