{"paperId": "b0694e2912041a0f92114b79d25567afb172bbc2", "publicationVenue": null, "title": "IIoT-based Predictive Maintenance for Oil and Gas Industry", "abstract": "The Industrial Internet of Things (IIoT) promises to provide an expanded awareness of field assets and equipment, access to data from across locations, and actionable insights for maximizing operational performance and safety of the oil and gas industry. Using automation and machine learning, with the application of predictive maintenance, efficiencies can be boosted and problems can be mitigated sooner and more effectively. The proposed system is mainly based on the data collection, processing, analysis, and modeling of an enormous number of historical and real-time data generated during the operation of the equipment on the edge side. The data-driven predictive maintenance used machine learning models and deep learning models to predict the remaining useful life (RUL). Bi-LSTM based prediction model has been trained on the cloud, and deployed onto the edge devices. The predictive maintenance process includes data acquisition, data processing, training of machine learning model, equipment health assessment, remaining useful life prediction, strategy formulation, and strategy execution. The predictive maintenance solution driven by the IIoT helps oil and gas companies make predictions before equipment failures have a significant impact on their company's safety level and profits to improve asset reliability and promote cost savings.", "venue": "EITCE", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2022-10-21", "journal": {"name": "Proceedings of the 2022 6th International Conference on Electronic Information Technology and Computer Engineering"}, "authors": [{"authorId": "2072782739", "name": "Zhiyang Jia"}, {"authorId": "48093604", "name": "Jihe Wang"}, {"authorId": "2189805556", "name": "Chengbo Deng"}], "citations": [{"paperId": "0f0208036750c8bca6a5c8e97006c10aaacdd612", "title": "Industrial Internet of Things (IIoT) and Other Industry 4.0 Technologies in Spare Parts Warehousing in the Oil and Gas Industry: A Systematic Literature Review"}, {"paperId": "4535ff9997bdc75389304e1077cf67840f548c8c", "title": "Advancements in predictive maintenance in the oil and gas industry: A review of AI and data science applications"}]}
