{"paperId": "b07e6823c2fd265d0f4f733e432fc72cd462bd71", "publicationVenue": {"id": "ef00f0de-a7e5-443a-9a2d-c78502a4b598", "name": "Conference on Computer Science and Information Systems", "type": "conference", "alternate_names": ["Fed Conf Comput Sci Inf Syst", "Conf Comput Sci Inf Syst", "FedCSIS", "Federated Conference on Computer Science and Information Systems"], "url": "https://fedcsis.org/"}, "title": "Considering various aspects of models’ quality in the ML pipeline - application in the logistics sector", "abstract": "The industrial machine learning applications today involve developing and deploying MLOps pipelines to ensure the versatile quality of forecasting models over an extended period, simultaneously assuring the model’s accuracy, stability, short training time, and resilience. In this study, we present the ML pipeline conforming to all the abovementioned aspects of models’ quality formulated as a constrained multi-objective optimization problem. We also provide the reference implementation on state-of-the-art methods for data preprocessing, feature extraction, dimensionality reduction, feature and instance selection, model fitting, and ensemble blending. The experimental study on the real data set from the logistics industry confirmed the qualities of the proposed approach, as the successful participation in an international data competition did.", "venue": "Conference on Computer Science and Information Systems", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-09-04", "journal": {"name": "2022 17th Conference on Computer Science and Intelligence Systems (FedCSIS)", "pages": "403-412"}, "authors": [{"authorId": "1994535649", "name": "Eyad Kannout"}, {"authorId": "2186685361", "name": "Michal Grodzki"}, {"authorId": "1749320", "name": "Marek Grzegorowski"}], "citations": [{"paperId": "1f6153d82e81d5b976c1e634d187d67acc4a9dbc", "title": "Tackling Variable-Length Sequences with High-Cardinality Features in Cyber-Attack Detection"}, {"paperId": "f31bdfd4855742602854cc01aa199443a0c30b1d", "title": "Tensor-based Approach to Big Data Processing and Machine Learning"}, {"paperId": "b872ac3245b5f2534530b9ddc8bca53e5b359f25", "title": "Towards addressing item cold-start problem in collaborative filtering by embedding agglomerative clustering and FP-growth into the recommendation system"}]}
