{"paperId": "b0a8e93f988d7bfae00e5ac8e0d9481a1b25c501", "publicationVenue": null, "title": "A Systematic Review on Big Data Analytics Frameworks for Higher Education - Tools and Algorithms", "abstract": "The development of Big Data applications in education has drawn much attention in the last few years due to the enormous benefits it brings to improving teaching and learning. The integration of these Big Data applications in education generates massive data that put new demands to available processing technologies of data and extraction of useful information. Primarily, several higher educational institutions depend on the knowledge mined from these vast volumes of data to optimise the teaching and learning environment. However, Big Data in the higher education context has relied on traditional data techniques and platforms that are less efficient. This paper, therefore, conducts a Systematic Literature Review (SLR) that examines Big Data framework technologies in higher education outlining gaps that need a solution in Big Educational Data Analytics. We achieved this by summarising the current knowledge on the topic and recommend areas where educational institutions could focus on exploring the potential of Big Data Analytics. To this end, we reviewed 55 related articles out of 1543 selected from Six (6) accessible Computer Science databases between the period of 2007 and 2018, focusing on the development of the Big Data framework and its applicability in education for academic purposes. Our results show that very few researchers have tried to address the integrative use of Big Data framework and learning analytics in higher education. The review further suggests that there is an emerging best practice in applying Big Data Analytics to improve teaching and learning. However, this information does not appear to have been thoroughly examined in higher education. Hence, there is the need for a complete investigation to come up with comprehensive Big Data frameworks that build effective learning systems for instructors, learners, course designers and educational administrators.", "venue": "EBIMCS", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Review"], "publicationDate": "2019-08-12", "journal": {"name": "Proceedings of the 2019 2nd International Conference on E-Business, Information Management and Computer Science"}, "authors": [{"authorId": "1450831109", "name": "David Otoo-Arthur"}, {"authorId": "2504228", "name": "Terence L van Zyl"}], "citations": [{"paperId": "c8cc6ca886011e63c64bc9ac03b5a7798734fcec", "title": "A meta systematic review of artificial intelligence in higher education: a call for increased ethics, collaboration, and rigour"}, {"paperId": "d8bd0069d783d038cf6b820501bf254ca5839a6f", "title": "Distributed Analytics For Big Data: A Survey"}, {"paperId": "19d18f201cc9721a7acb94ed4e1cbe327eaac7c9", "title": "Designing and evaluating a big data analytics approach for predicting students’ success factors"}, {"paperId": "ef60df59218ebb59dbacec605ec3a4bab2d67641", "title": "A Human-Centered Review of Algorithms in Decision-Making in Higher Education"}, {"paperId": "d972c9b980104422f0445a9798084f67b72d4848", "title": "Big Data and Education: using big data analytics in language learning"}, {"paperId": "6bcbaf45c1776f0bd88d99d5b6877a7f535bc8ce", "title": "Design of a DFS to Manage Big Data in Distance Education Environments"}, {"paperId": "ff905b895fcabb85ce0d300d80cb5cbcc62b05a5", "title": "An Assessment of Ghanaian Colleges of Education Readiness for e-Learning Given COVID-19 Pandemic"}, {"paperId": "25f56dff9bd80d8d04f0122b541c2a10f8965286", "title": "Applying Big Data Analytics in Higher Education: A Systematic Mapping Study"}, {"paperId": "f44597be5d25b02bcaae56fbda630d466c2eac87", "title": "A Scalable Heterogeneous Big Data Framework for e-Learning Systems"}]}
