{"paperId": "b0aa86accdf0645997b51faa50bace3f04a28892", "publicationVenue": {"id": "02a4454a-84c8-471c-9b40-cc045d4f3223", "name": "Security and Communication Networks", "type": "journal", "alternate_names": ["Secur Commun Netw"], "issn": "1939-0122", "url": "https://www.hindawi.com/journals/scn/", "alternate_urls": ["http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1939-0122", "http://www.interscience.wiley.com/journal/security"]}, "title": "Parallel Classification Algorithm Design of Human Resource Big Data Based on Spark Platform", "abstract": "In order to solve the problem of large data classification of human resources, a new parallel classification algorithm of large data of human resources based on the Spark platform is proposed in this study. According to the spark platform, it can complete the update and distance calculation of the human resource big data clustering center and design the big data clustering process. Based on this, the K-means clustering method is introduced to mine frequent itemsets of large data and optimize the aggregation degree of similar large data. A fuzzy genetic algorithm is used to identify the balance of big data. This study adopts the selective integration method to study the unbalanced human resource database classifier in the process of transmission, introduces the decision contour matrix to construct the anomaly support model of the set of unbalanced human resource data classifier, identifies the features of the big data of human resource in parallel, repairs the relevance of the big data of human resource, introduces the improved ant colony algorithm, and finally realizes the design of the parallel classification algorithm of the big data of human resource. The experimental results show that the proposed algorithm has a low time cost, good classification effect, and ideal parallel classification rule complexity.", "venue": "Security and Communication Networks", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-12-26", "journal": {"name": "Security and Communication Networks"}, "authors": [{"authorId": "2098508519", "name": "Wang Zhouhuo"}], "citations": [{"paperId": "2c1de8f3fe509f9abd3ab118b1fb0b0bb3374554", "title": "Retracted: Parallel Classification Algorithm Design of Human Resource Big Data Based on Spark Platform"}, {"paperId": "0288eadb31c4a1dec8e29ad4f552969d497caa92", "title": "Smart Grid Big Data Architecture Design based on Improved K-means Algorithm"}]}
