{"paperId": "b0b0ecad31a3f660b6d8fe24825d5849f3614e49", "publicationVenue": {"id": "28df6cf4-b335-41eb-acc6-50eb3c965e5a", "name": "IEEE Transactions on Computational Social Systems", "type": "journal", "alternate_names": ["IEEE Trans Comput Soc Syst"], "issn": "2329-924X", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=6570650", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/aboutJournal.jsp?punumber=6570650"]}, "title": "Hidden Gold for IT Professionals, Educators, and Students: Insights From Stack Overflow Survey", "abstract": "It is undeniable that technological advancements have taken significant changes in the nature of work, resulting in the loss of many jobs and the emergence of new ones. As a result, information technology (IT) job seekers and professionals must be aware of changes required in their respective fields. This study identified and ranked the most-used technologies, such as programming languages, databases, operating systems (OSs), and collaborative tools, specific to twenty-three (23) different IT roles. Furthermore, this study advocates that individuals focus on critical skills required in various domains to achieve career success. Similarly, individuals with a set of valued technical skills may decide whether to change jobs or roles if they are interested in a position that requires their current competence. The findings of this study can be helpful to career counselors, instructors, students, professionals, recruiters, curriculum designers, and decision-makers.", "venue": "IEEE Transactions on Computational Social Systems", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-04-01", "journal": {"name": "IEEE Transactions on Computational Social Systems", "pages": "795-806", "volume": "10"}, "authors": [{"authorId": "2059016395", "name": "O. A. Dada"}, {"authorId": "29378880", "name": "George Obaido"}, {"authorId": "31072906", "name": "I. T. Sanusi"}, {"authorId": "51135947", "name": "Kehinde D. Aruleba"}, {"authorId": "16261655", "name": "A. A. Yunusa"}], "citations": [{"paperId": "6f94bbca2342f224032ce03432d7684928c62134", "title": "The Gap between Higher Education and the Software Industry — A Case Study on Technology Differences"}]}
