{"paperId": "b0b1e941fb78225ae740e51e6f258cf31a21af87", "publicationVenue": null, "title": "Embedded Machine Learning: Towards a Low-Cost Intelligent IoT edge", "abstract": "Deploying Machine Learning algorithms at the network edge is an ongoing research goal for both industry and academic researchers. Owing to the ubiquitous nature of Internet of Things devices and smart environments in various domains, the availability of Machine learning and deep learning capabilities on edge devices is rapidly becoming a necessity to achieve full utilization of the large amounts of data produced by these devices. However, resource constrained low-cost embedded processors like microcontrollers are typically used as the edge devices, consequently limiting their computing capabilities and memory capacity, thereby making the implementation of typical Machine Learning algorithms that are generally computationally expensive on these constrained devices extremely challenging. Therefore, in this paper we adopt a proof-of-concept approach to demonstrate the deployment procedure of an anomaly detection algorithm on low-cost and low-power embedded devices for potential application in the healthcare and wellness domain.", "venue": "2022 7th International Conference on Smart and Sustainable Technologies (SpliTech)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-07-05", "journal": {"name": "2022 7th International Conference on Smart and Sustainable Technologies (SpliTech)", "pages": "1-6"}, "authors": [{"authorId": "89260460", "name": "A. Shumba"}, {"authorId": "3018189", "name": "Teodoro Montanaro"}, {"authorId": "2384354", "name": "Ilaria Sergi"}, {"authorId": "92258255", "name": "L. Fachechi"}, {"authorId": "2135161421", "name": "Massimo De Vittorio"}, {"authorId": "2313037", "name": "L. Patrono"}], "citations": [{"paperId": "229bbca81e2f20ecfdbe6ec46461df4a3a10ca6e", "title": "On the Adoption of Modern Technologies to Fight the COVID-19 Pandemic: A Technical Synthesis of Latest Developments"}, {"paperId": "ceefba3d6f3d53084e5b90c22ba05f7c8e881e26", "title": "Leveraging IoT-Aware Technologies and AI Techniques for Real-Time Critical Healthcare Applications"}]}
