{"paperId": "b0b3eecc7e3953547ae24a909d5967240c19f373", "publicationVenue": null, "title": "Adapting Performance Analytic Techniques in a Real-World Database-Centric System: An Industrial Experience Report", "abstract": "Database-centric architectures have been widely adopted in large-scale software systems in various domains to deal with the ever-increasing amount and complexity of data. Prior studies have proposed a wide range of performance analytic techniques aimed at assisting developers in pinpointing software performance inefficiencies and diagnosing performance issues. However, directly applying these existing techniques to large-scale database-centric systems can be challenging and may not perform well due to the unique nature of such systems. In particular, compared to typical database-based systems like online shopping systems, in database-centric systems, a majority of the business logic and calculations reside in the database instead of the application. As the calculations in the database typically use domain-specific languages such as SQL, the performance issues of such systems and their diagnosis may be significantly different from the systems dominated by traditional programming languages such as Java. In this paper, we share our experience of adapting performance analytic techniques in a large-scale database-centric system from our industrial collaborator. Our adapted performance analysis pays special attention to the database and the interactions between the database and the application with minimal reliance on expert knowledge and manual effort. Moreover, we document our encountered challenges and how they are addressed during the development and adoption of our solution in the industrial setting as well as the corresponding lessons learned. We also discuss the real-world performance issues detected by applying our analysis to the target database-centric system. We anticipate that our solution and the reported experience can be helpful for practitioners and researchers who would like to ensure and improve the performance of database-centric systems.", "venue": "ESEC/SIGSOFT FSE", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2023-11-30", "journal": {"name": "Proceedings of the 31st ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software Engineering"}, "authors": [{"authorId": "2053830598", "name": "Lizhi Liao"}, {"authorId": "2256594145", "name": "Heng Li"}, {"authorId": "2242624850", "name": "Weiyi Shang"}, {"authorId": "1387521427", "name": "Catalin Sporea"}, {"authorId": "2268775056", "name": "Andrei Toma"}, {"authorId": "2066105552", "name": "S. Sajedi"}], "citations": []}
