{"paperId": "b0de49a84377f607475e38f2268c6415a4a9e1c4", "publicationVenue": {"id": "e6d3a1c8-524c-44b6-a940-64e4c48841e3", "name": "International Journal of Fog Computing", "type": "journal", "alternate_names": ["Int J Fog Comput"], "issn": "2572-4894", "url": "https://www.igi-global.com/journal/international-journal-fog-computing-ijfc/175202", "alternate_urls": ["https://www.igi-global.com/journal/international-journal-fog-computing/175202"]}, "title": "Overview of Big Data-Intensive Storage and its Technologies for Cloud and Fog Computing", "abstract": "Computing systems are becoming increasingly data-intensive because of the explosion of data and the needs for processing the data, and subsequently storage management is critical to application performance in such data-intensive computing systems. However, if existing resource management frameworks in these systems lack the support for storage management, this would cause unpredictable performance degradation when applications are under input/output (I/O) contention. Storage management of data-intensive systems is a challenge. Big Data plays a most major role in storage systems for data-intensive computing. This article deals with these difficulties along with discussion of High Performance Computing (HPC) systems, background for storage systems for data-intensive applications, storage patterns and storage mechanisms for Big Data, the Top 10 Cloud Storage Systems for data-intensive computing in today's world, and the interface between Big Data Intensive Storage and Cloud/Fog Computing. Big Data storage and its server statistics and usage distributions for the Top 500 Supercomputers in the world are also presented graphically and discussed as data-intensive storage components that can be interfaced with Fog-to-cloud interactions and enabling protocols.", "venue": "International Journal of Fog Computing", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2019-01-01", "journal": {"name": "Int. J. Fog Comput.", "pages": "74-113", "volume": "2"}, "authors": [{"authorId": "3128073", "name": "R. Segall"}, {"authorId": "2265996240", "name": "Jeffrey S. Cook"}, {"authorId": "2265998088", "name": "Gao Niu"}], "citations": [{"paperId": "08fd655e842e6032569719d499974169db95a7a8", "title": "Cloud-integrated Fog Big Data Analytics for the Internet of Things Design"}, {"paperId": "5c856fbbd376c368bf88a2270303fb2c031bab2d", "title": "Peningkatan kesadaran pentingnya pengarsipan dan penyimpanan dokumen secara online bagi Siswa SMAN 2 Sungai Are Muara Dua Oku Selatan"}, {"paperId": "9a34d3a563914daf08d11d7e56fe63dd1f4f32d3", "title": "Performance modeling for I/O‐intensive applications on virtual machines"}, {"paperId": "1a0c30f5ef60fca0880f0f6999e57d529560a3d1", "title": "Review and State of Art of Fog Computing"}, {"paperId": "b1a72c60d298d97d913c7f827bb7d5947a888501", "title": "Big Data Analytics with Fog Computing in integrated Cloud Fog and IoT Architecture for Smart Devices"}, {"paperId": "4326180c6f354598f76c67f06aa9895815717c6f", "title": "Modeling of I/O-Intensive Applications in a virtualized Environments"}]}
