{"paperId": "b0e4ec6482d760235217bc579b0bbe3bcc55a46c", "publicationVenue": null, "title": "EXPERT: EXPloiting DRAM ERror Types to Improve the Effective Forecasting Coverage in the Field", "abstract": "DRAM failures, which are mostly caused by DRAM uncorrectable errors (UCEs), are one of the most critical factors for reliable services in computing systems. Prior work demonstrates the potential to utilize machine learning techniques for forecasting DRAM UCEs. However, they do not have the knowledge that different DRAM UCEs can be classified into different types. To this end, we obtain the first field dataset from a large datacenter of Alibaba Cloud, with the labels of different UCE types. Then, we propose EXPERT, a design to exploit such information to improve the effective forecasting coverage of DRAM UCEs. Finally, we evaluate the effectiveness of our approach against two state-of-the-art forecaster designs in the field, and the results show that EXPERT achieves up to 18.43% improvements on the effective coverage in terms of F1-Score.", "venue": "2023 53rd Annual IEEE/IFIP International Conference on Dependable Systems and Networks - Supplemental Volume (DSN-S)", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-06-01", "journal": {"name": "2023 53rd Annual IEEE/IFIP International Conference on Dependable Systems and Networks - Supplemental Volume (DSN-S)", "pages": "35-41"}, "authors": [{"authorId": "2182535673", "name": "Xiangjun Peng"}, {"authorId": "2229428406", "name": "Zheng Huang"}, {"authorId": "2228951262", "name": "Alex Cantrell"}, {"authorId": "1491240863", "name": "Bihua Shu"}, {"authorId": "2057746756", "name": "Kechao Xie"}, {"authorId": "2232052318", "name": "Yi Li"}, {"authorId": "2116611953", "name": "Yu Li"}, {"authorId": "2108810808", "name": "Li Jiang"}, {"authorId": "2149106315", "name": "Qiang Xu"}, {"authorId": "2005664", "name": "Ming-Chang Yang"}], "citations": []}
