{"paperId": "b0f5a538a7a08f82a53c1b2618a0ee0e44939cd3", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "p2pGNN: A Decentralized Graph Neural Network for Node Classification in Peer-to-Peer Networks", "abstract": "In this work, we aim to classify nodes of unstructured peer-to-peer networks with communication uncertainty, such as users of decentralized social networks. Graph Neural Networks (GNNs) are known to improve the accuracy of simple classifiers in centralized settings by leveraging naturally occurring network links, but graph convolutional layers are challenging to implement in decentralized settings when node neighbors are not constantly available. We address this problem by employing decoupled GNNs, where base classifier predictions and errors are diffused through graphs after training. For these, we deploy pre-trained and gossip-trained base classifiers and implement peer-to-peer graph diffusion under communication uncertainty. In particular, we develop an asynchronous decentralized formulation of diffusion that converges to centralized predictions in distribution and linearly with respect to communication rates. We experiment on three real-world graphs with node features and labels and simulate peer-to-peer networks with uniformly random communication frequencies; given a portion of known labels, our decentralized graph diffusion achieves comparable accuracy to centralized GNNs with minimal communication overhead (less than 3% of what gossip training already adds).", "venue": "IEEE Access", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-11-29", "journal": {"name": "IEEE Access", "pages": "34755-34765", "volume": "10"}, "authors": [{"authorId": "28075447", "name": "Emmanouil Krasanakis"}, {"authorId": "144178604", "name": "S. Papadopoulos"}, {"authorId": "119661806", "name": "I. Kompatsiaris"}], "citations": [{"paperId": "1884e7d15da4230b09971ef177ccae0a12647b3e", "title": "Horizontal Federated Recommender System: A Survey"}, {"paperId": "c093b28d06d21b62a59ebd3a162d9ee8e24a96db", "title": "Decentralized Graph Neural Network for Privacy-Preserving Recommendation"}, {"paperId": "0c5b2badd9a21d8f9dfa747ab7e7a04a60140576", "title": "Group-based Fraud Detection Network on e-Commerce Platforms"}, {"paperId": "6575af3b1fbb2b12335d521801cb3a894043fb7a", "title": "Implementation of Node Classification Algorithm Based on Graph Neural Network"}, {"paperId": "c54f940b99664bd29c1766a965d1f4c5af96fa8b", "title": "Semi-decentralized Inference in Heterogeneous Graph Neural Networks for Traffic Demand Forecasting: An Edge-Computing Approach"}, {"paperId": "369c33aab01f685df3776b838e4a410e503215b6", "title": "A Graph Diffusion Scheme for Decentralized Content Search based on Personalized PageRank"}, {"paperId": "167d35eeb225286b559e74ba7dd02483eef67b70", "title": "Helios.TALK: A decentralised messaging framework that preserves the privacy of users"}]}
