{"paperId": "b118deb1e0715a5aeec11e399321501ba09ce2c4", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "HAE-RAE Bench: Evaluation of Korean Knowledge in Language Models", "abstract": "Large language models (LLMs) trained on massive corpora demonstrate impressive capabilities in a wide range of tasks. While there are ongoing efforts to adapt these models to languages beyond English, the attention given to their evaluation methodologies remains limited. Current multilingual benchmarks often rely on back translations or re-implementations of English tests, limiting their capacity to capture unique cultural and linguistic nuances. To bridge this gap for the Korean language, we introduce the HAE-RAE Bench, a dataset curated to challenge models lacking Korean cultural and contextual depth. The dataset encompasses six downstream tasks across four domains: vocabulary, history, general knowledge, and reading comprehension. Unlike traditional evaluation suites focused on token and sequence classification or mathematical and logical reasoning, the HAE-RAE Bench emphasizes a model's aptitude for recalling Korean-specific knowledge and cultural contexts. Comparative analysis with prior Korean benchmarks indicates that the HAE-RAE Bench presents a greater challenge to non-Korean models by disturbing abilities and knowledge learned from English being transferred.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-06", "journal": {"name": "ArXiv", "volume": "abs/2309.02706"}, "authors": [{"authorId": "2146377319", "name": "Guijin Son"}, {"authorId": "2199862285", "name": "Hanwool Lee"}, {"authorId": "2238077140", "name": "Suwan Kim"}, {"authorId": "2238150266", "name": "Jaecheol Lee"}, {"authorId": "2237988947", "name": "Je Won Yeom"}, {"authorId": "2238162148", "name": "Jihyu Jung"}, {"authorId": "2238084627", "name": "Jung Woo Kim"}, {"authorId": "2238077154", "name": "Songseong Kim"}], "citations": [{"paperId": "8b57632b19df9ebd3e57e3adbef7fc6ec93bc506", "title": "HyperCLOVA X Technical Report"}, {"paperId": "6ee1964f089db48c9750c99ce658fe7f17a33477", "title": "CLIcK: A Benchmark Dataset of Cultural and Linguistic Intelligence in Korean"}, {"paperId": "4017baa6923912fd953c17d3bdd3d29ca8a79f47", "title": "KMMLU: Measuring Massive Multitask Language Understanding in Korean"}]}
