{"paperId": "b11a479502682941bc0a652d39f503bb13358e0c", "publicationVenue": {"id": "6175efe8-6f8e-4cbe-8cee-d154f4e78627", "name": "Mathematics", "issn": "2227-7390", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-283014", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-283014", "https://www.mdpi.com/journal/mathematics"]}, "title": "Malware Detection Based on the Feature Selection of a Correlation Information Decision Matrix", "abstract": "Smartphone apps are closely integrated with our daily lives, and mobile malware has brought about serious security issues. However, the features used in existing traffic-based malware detection techniques have a large amount of redundancy and useless information, wasting the computational resources of training detection models. To overcome this drawback, we propose a feature selection method; the core of the method involves choosing selected features based on high irrelevance, thereby removing redundant features. Furthermore, artificial intelligence has implemented malware detection and achieved outstanding detection ability. However, almost all malware detection models in deep learning include pooling operations, which lead to the loss of some local information and affect the robustness of the model. We also propose designing a malware detection model for malicious traffic identification based on a capsule network. The main difference between the capsule network and the neural network is that the neuron outputs a scalar, while the capsule outputs a vector. It is more conducive to saving local information. To verify the effectiveness of our method, we verify it from three aspects. First, we use four popular machine learning algorithms to prove the effectiveness of the proposed feature selection method. Second, we compare the capsule network with the convolutional neural network to prove the superiority of the capsule network. Finally, we compare our proposed method with another state-of-the-art malware detection technique; our accuracy and recall increased by 9.71% and 20.18%, respectively.", "venue": "Mathematics", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-02-13", "journal": {"name": "Mathematics"}, "authors": [{"authorId": "2206602653", "name": "Kai Lu"}, {"authorId": "1790103", "name": "Jieren Cheng"}, {"authorId": "119725888", "name": "Anli Yan"}], "citations": [{"paperId": "c250c5172d75377f08c660e7c8073481f7f214a7", "title": "Deep learning-powered malware detection in cyberspace: a contemporary review"}, {"paperId": "8689f26825091f987a233009960a3214eae61372", "title": "Explainable Machine Learning for Malware Detection on Android Applications"}, {"paperId": "c5f08e827444bda90eac7c75a797b2ab43f4a78f", "title": "Optimal control analysis of malware propagation in cloud environments."}, {"paperId": "349a87703e0f345d87f640fda18e124aa1a45a72", "title": "Malware Detection and Classification with Deep Learning Models"}]}
