{"paperId": "b122c36c504f7077b7628e31f8e0269732dc47a8", "publicationVenue": null, "title": "Challenges in the collaborative evolution of a proof language and its ecosystem. (Défis dans l'évolution collaborative d'un langage de preuve et de son écosystème)", "abstract": "In this thesis, I present the application of software engineering methods and knowledge to the development, maintenance, and evolution of Coq —an interactive proof assistant based on type theory— and its package ecosystem. Coq has been developed at Inria since 1984, but has only more recently seen a surge in its user base, which leads to greater concerns about its maintainability, and the involvement of external contributors in the evolution of both Coq and its ecosystem of plugins and libraries. \nRecent years have seen important changes in the development processes of Coq, of which I have been a witness and an actor (adoption of GitHub as a development platform, first for its pull request mechanism, then for its bug tracker, adoption of continuous integration, switch to shorter release cycles, increased involvement of external contributors in the open source development and maintenance process). The contributions of this thesis include a historical description of these changes, the refinement of existing processes, the design of new processes, the design and implementation of new tools to help the application of these processes, and the validation of these changes through rigorous empirical evaluation. \nInvolving external contributors is also very useful at the level of the package ecosystem. This thesis additionally contains an analysis of package distribution methods, and a focus on the problem of the long-term maintenance of single-maintainer packages.", "venue": "", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2019-12-12", "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "35031407", "name": "Théo Zimmermann"}], "citations": [{"paperId": "b7ce920dec6fdc0665117885787f710bcf02b668", "title": "The Advantages of Maintaining a Multitask, Project-Specific Bot: An Experience Report"}, {"paperId": "3f3630b178c99798c58a25b9553abf09ad61e5fe", "title": "Advantages of maintaining a multi-task project-specific bot: an experience report"}, {"paperId": "803ed84e90c711f228abf24636bce981ba9c2e90", "title": "Reliably Reproducing Machine-Checked Proofs with the Coq Platform"}, {"paperId": "388c7de070cacea148249f2d0583442049352e30", "title": "Automatic Test-Case Reduction in Proof Assistants: A Case Study in Coq"}, {"paperId": "c05900ce424b792bfc79ebd65bb75c9c8ae8002d", "title": "Extending the team with a project-specific bot"}, {"paperId": "9430b3815c8afcc23d36606d4322d56dfaa484b4", "title": "BreakBot: Analyzing the Impact of Breaking Changes to Assist Library Evolution"}, {"paperId": "9972a3c08a646b27e3da378c293e2b37085ca039", "title": "A grounded theory of community package maintenance organizations"}, {"paperId": "528fc49be307e51bb764deef56d129bff2bf393d", "title": "On the impact of release policies on bug handling activity: A case study of Eclipse"}, {"paperId": "2e3c66a8f147eac4c7a622350a520942a111b907", "title": "Hydras & Co.: Formalized mathematics in Coq for inspiration and entertainment"}, {"paperId": "db056f6a1ca52e9498f3804a01c1aa968355c3e5", "title": "Analyzing the Impact of Pull Requests to Guide Library Evolution"}]}
