{"paperId": "b127df5d7a2ef34ead38f60d0ec4f83586fea8e3", "publicationVenue": {"id": "74f47cf8-2839-4a56-959a-524dd0ed9e3e", "name": "International Conference on Extending Database Technology", "type": "conference", "alternate_names": ["Int Conf Extending Database Technol", "Extending Database Technology", "Extending Database Technol", "EDBT"], "url": "http://www.edbt.org/"}, "title": "Maliva: Using Machine Learning to Rewrite Visualization Queries Under Time Constraints", "abstract": "We consider data-visualization systems where a middleware layer translates a frontend request to a SQL query to a backend database to compute visual results. We study the problem of answering a visualization request within a limited time constraint due to the responsiveness requirement. We explore the optimization options of rewriting an original query by adding hints and/or doing approximations so that the total time is within the time constraint. We develop a novel middleware solution called Maliva based on machine learning (ML) techniques. It applies the Markov Decision Process (MDP) model to decide how to rewrite queries and uses training instances to learn an agent to make a sequence of decisions judiciously for an online request. We give a full specification of the technique, including how to construct an MDP model, how to train an agent, and how to use approximating rewrite options. Our experiments on both real and synthetic datasets show that Maliva performs significantly better than a baseline solution that does not do any rewriting, in terms of both the probability of serving requests interactively and query execution time.", "venue": "International Conference on Extending Database Technology", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-11-30", "journal": {"name": "ArXiv", "volume": "abs/2112.00182"}, "authors": [{"authorId": "2052614357", "name": "Qiushi Bai"}, {"authorId": "2142736086", "name": "Sadeem Alsudais"}, {"authorId": "49673417", "name": "Chen Li"}, {"authorId": "2145075264", "name": "Shuang Zhao"}], "citations": [{"paperId": "be87778d5791f129cc2165922922ba9024690689", "title": "Demo of QueryBooster: Supporting Middleware-based SQL Query Rewriting as a Service"}, {"paperId": "e0e6671d3af53ba7462f84b49140deb588cce77f", "title": "QueryBooster: Improving SQL Performance Using Middleware Services for Human-Centered Query Rewriting"}, {"paperId": "6fe60b96d4455788ccb6433af8b95abae6860b7e", "title": "Intelligent Data Visualization Analysis Techniques: A Survey"}]}
