{"paperId": "b129bfad1eeb708e43b681d9fd6d1e386afbcf1b", "publicationVenue": {"id": "c60f6e64-434b-4c82-931d-faefcb362d4c", "name": "IFIP International Information Security Conference", "type": "conference", "alternate_names": ["Symp Edge Comput", "Symposium on Edge Computing", "Inf Secur", "Information Security", "IFIP Int Inf Secur Conf", "SEC"], "url": "http://www.tc11.uni-frankfurt.de/", "alternate_urls": ["https://acm-ieee-sec.org"]}, "title": "Gemini: a Real-time Video Analytics System with Dual Computing Resource Control", "abstract": "Edge-side real-time video analytics systems recognize spatial or temporal events (e.g., vehicle counting) in a video stream. To meet the delay requirement, existing systems in smart edge cameras conduct video preprocessing to filter out unnecessary frames and model inference using appropriately selected neural network (NN) models. Video preprocessing is instruction-intensive computing (IIC) and executed by the CPU of the edge camera, and model inference is data-intensive computing (DIC) and executed by the GPU of the edge camera. In this paper, we show that the analytics accuracy of existing systems can largely vary in fields. The root cause is that video analytics applications have different contents, which result in dynamic IIC and DIC workloads. Unfortunately, intelligent cameras in fields have fixed CPU and GPU resources and cannot effectively adapt to workload dynamics. We develop Gemini, a new real-time video analytics system enhanced by a dual-image FPGA. The newly developed dual-image FPGAs can be pre-configured with two FPGA images with a key advantage of negligible image switching time. We thus pre-configure one CPU image and one GPU image and elastically multiplex the dual CPU-GPU resources in the time dimension. The Gemini system design requires both hardware and software revisions. We overcame a challenge that the application development on different dual-image FPGAs is hardware-dependent. We develop a new abstraction of hardware functions to make the Gemini system hardware-agnostic. It is also a challenge to adapt to the dynamic workloads and optimize video analytics accuracy. We develop a bandit learning approach to capture content dynamics and conduct dual computing resource control. We implement Gemini and show that Gemini can improve the analytics accuracy to 90.35 %. We further evaluate Gemini by a case study where we use Gemini to support an intrusion detection application, and Gemini shows consistent high analytics accuracy.", "venue": "IFIP International Information Security Conference", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-12-01", "journal": {"name": "2022 IEEE/ACM 7th Symposium on Edge Computing (SEC)", "pages": "162-174"}, "authors": [{"authorId": "2055871873", "name": "Rui Lu"}, {"authorId": "1491235249", "name": "Chuang Hu"}, {"authorId": "40562856", "name": "Dan Wang"}, {"authorId": "2145311313", "name": "Jin Zhang"}], "citations": [{"paperId": "177fb44f7e994eb1eb03c133d385ce1194a52867", "title": "Enabling Cross-Camera Collaboration for Video Analytics on Distributed Smart Cameras"}, {"paperId": "d202d2936b7495b1c493d94a744f3f4653f6f447", "title": "Edge Video Analytics: A Survey on Applications, Systems and Enabling Techniques"}, {"paperId": "85106fc0a68a575166f0f18456fa755b7a2660a3", "title": "Deep Learning-Driven Edge Video Analytics: A Survey"}]}
