{"paperId": "b13d4d943bf997d33fcc340f7a943e16ff563d1f", "publicationVenue": null, "title": "EvaCRC: Evaluating Code Review Comments", "abstract": "In code reviews, developers examine code changes authored by peers and provide feedback through comments. Despite the importance of these comments, no accepted approach currently exists for assessing their quality. Therefore, this study has two main objectives: (1) to devise a conceptual model for an explainable evaluation of review comment quality, and (2) to develop models for the automated evaluation of comments according to the conceptual model. To do so, we conduct mixed-method studies and propose a new approach: EvaCRC (Evaluating Code Review Comments). To achieve the first goal, we collect and synthesize quality attributes of review comments, by triangulating data from both authoritative documentation on code review standards and academic literature. We then validate these attributes using real-world instances. Finally, we establish mappings between quality attributes and grades by inquiring domain experts, thus defining our final explainable conceptual model. To achieve the second goal, EvaCRC leverages multi-label learning. To evaluate and refine EvaCRC, we conduct an industrial case study with a global ICT enterprise. The results indicate that EvaCRC can effectively evaluate review comments while offering reasons for the grades. Data and materials: https://doi.org/10.5281/zenodo.8297481", "venue": "ESEC/SIGSOFT FSE", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Review"], "publicationDate": "2023-11-30", "journal": {"name": "Proceedings of the 31st ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software Engineering"}, "authors": [{"authorId": "1677573258", "name": "Lanxin Yang"}, {"authorId": "2268797325", "name": "Jinwei Xu"}, {"authorId": "2268823130", "name": "Yifan Zhang"}, {"authorId": "2153528700", "name": "He Zhang"}, {"authorId": "2258059197", "name": "Alberto Bacchelli"}], "citations": []}
