{"paperId": "b14f3ea87fb9e7fc743af7b34a05de7ae69d79e1", "publicationVenue": null, "title": "Improved GRU prediction of paper pulp press variables using different pre-processing methods", "abstract": "ABSTRACT Predictive maintenance strategies are becoming increasingly more important with the increased needs for automation and digitalization within pulp and paper manufacturing sector.Hence, this study contributes to examine the most efficient pre-processing approaches for predicting sensory data trends based on Gated Recurrent Unit (GRU) neural networks. To validate the model, the data from two paper pulp presses with several pre-processing methods are utilized for predicting the units’ conditions. The results of validation criteria show that pre-processing data using a LOWESS in combination with the Elimination of discrepant data filter achieves more stable results, the prediction error decreases, and the predicted values are easier to interpret. The model can anticipate future values with MAPE, RMSE and MAE of 1.2, 0.27 and 0.30 respectively. The errors are below the significance level. Moreover, it is identified that the best hyperparameters found for each paper pulp press must be different.", "venue": "Production &amp; Manufacturing Research", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-12-23", "journal": {"name": "Production & Manufacturing Research", "volume": "11"}, "authors": [{"authorId": "2047707277", "name": "B. Mateus"}, {"authorId": "2054722931", "name": "Mateus Mendes"}, {"authorId": "2124244425", "name": "José Torres Farinha"}, {"authorId": "9331218", "name": "A. M. Marques Cardoso"}, {"authorId": "2198123056", "name": "Rui Assis"}, {"authorId": "90676848", "name": "Hamzeh Soltanali"}], "citations": [{"paperId": "f94d7eda1439fa38d9b0244a13124733385e1874", "title": "Improvement of maintenance-based Product-Service System offering through field data: a case study"}, {"paperId": "71a5bf4715c4260fa7b2ed37baa303dd419cea24", "title": "Research on an Ultrasonic Detection Method for Weld Defects Based on Neural Network Architecture Search"}, {"paperId": "8c9709ca51f00673082231f388999c6e2199c7e2", "title": "A survey of deep learning-driven architecture for predictive maintenance"}]}
