{"paperId": "b17b13fc404690c28c82df7100148361d1a0460f", "publicationVenue": {"id": "62a0df02-79f9-4bba-8524-48ec1a6d0185", "name": "International Conference on Big Data Research", "type": "conference", "alternate_names": ["Int Conf Big Data Res", "International Conference Big Data Research", "ICBDR"]}, "title": "ESTemd: A Distributed Processing Framework for Environmental Monitoring based on Apache Kafka Streaming Engine", "abstract": "Distributed networks and real-time systems are becoming the most important components for the new computer age – the Internet of Things (IoT), with huge data streams generated from sensors and data sets generated from existing legacy systems. The data generated offers the ability to measure, infer and understand environmental indicators, from delicate ecologies and natural resources to urban environments. This can be achieved through the analysis of the heterogeneous data sources (structured and unstructured). In this paper, we propose a distributed framework – Event STream Processing Engine for Environmental Monitoring Domain (ESTemd) for the application of stream processing on heterogeneous environmental data. Our work in this area demonstrates the useful role big data techniques can play in an environmental decision support system, early warning and forecasting systems. The proposed framework addresses the challenges of data heterogeneity from heterogeneous systems and offers real-time processing of huge environmental datasets through a publish/subscribe method via a unified data pipeline with the application of Apache Kafka for real-time analytics.", "venue": "International Conference on Big Data Research", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2020-11-27", "journal": {"name": "Proceedings of the 4th International Conference on Big Data Research"}, "authors": [{"authorId": "20525056", "name": "Adeyinka K. Akanbi"}], "citations": [{"paperId": "23860a13040892e549ec08d6d00779b0f3f2da32", "title": "A Blockchain-based Model for Securing Data Pipeline in a Heterogeneous Information System"}, {"paperId": "66b81c8f9e7366fd73692a8b976739967df859d2", "title": "A Scalable Semantic Framework for an Integrated Multi-Hazard Early Warning System"}, {"paperId": "16884aa1a953fe5349ed6dc39157fef9cdde4027", "title": "Optimizing Apache Kafka Deployments - Configuration customization is all you need"}, {"paperId": "78ee85ac29775aefed350a18500ecfb4c5182dd9", "title": "Distributed real-time ETL architecture for unstructured big data"}, {"paperId": "1b15cc50941fa28e78e5f5ccd2fb8abf4c12e812", "title": "Design Guidelines for Apache Kafka Driven Data Management and Distribution in Smart Cities"}, {"paperId": "d42ac2361b1ab529a9f878ba45e9a7895faec424", "title": "On Efficiently Partitioning a Topic in Apache Kafka"}, {"paperId": "eb45d21f2559271024771cdc1fbb457609a776f7", "title": "A Survey on Networked Data Streaming With Apache Kafka"}]}
