{"paperId": "b17cfb92afaa0071f83bdda971dad6d76bd6bda6", "publicationVenue": {"id": "5569dcfa-edb2-4fcf-a27c-11c8d58d0997", "name": "Fırat Üniversitesi Sosyal Bilimler Dergisi", "alternate_names": ["Fırat Üniversitesi Sos Bilim Derg"], "issn": "1300-9702", "url": "http://www.dergipark.ulakbim.gov.tr/firatsbed"}, "title": "Human Development Index Study With Two Stage Clustering In Data Mining", "abstract": "This study examines the level of development of countries with the Human Development Index and the Gender Development Index, which are indicators that measure socioeconomic development at national level and compare the differences between economies. Which variables are influential in the grouping of countries is being investigated through a two-stage clustering analysis, one of the data mining techniques All data used in the study are obtained from the United Nations Development Program (UNDP) Analyzes were conducted with 2268 observation for 189 countries published by UNDP for 2019 According to the results of the Human Development Index, countries are grouped into three groups: countries with high, medium and low development indexes According to the results of the Gender Development Index, countries are grouped into five groups: countries with high, high-medium, medium, medium-low and low development indexes. It has been determined that the number of groups determined for the Human Development Index is different from the number of groups announced in the UNDP report, and the number of groups for the Gender Development Index is the same as the report. In general, the results show that women live longer than men, the education level of men and women is almost the same, and men have a higher national income than women. Thus, the effect of the gender factor on the development index was revealed.", "venue": "Fırat Üniversitesi Sosyal Bilimler Dergisi", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-09-02", "journal": {"name": "Fırat Üniversitesi Sosyal Bilimler Dergisi"}, "authors": [{"authorId": "2184537105", "name": "Nursefa Yavuz"}, {"authorId": "2184536981", "name": "Mustafa Sevuktekin"}], "citations": [{"paperId": "2842ec69e9bfb8eb6c658df46859be845786e5ad", "title": "Calculation of Human Development Index Values Using Turkish Provinces and Human Development Evaluation of Turkey"}]}
