{"paperId": "b182b130a4717d777abea1e854d71843319971cf", "publicationVenue": {"id": "011e0c39-7f47-401e-98d2-ee08fdf206a3", "name": "Library hi tech", "type": "journal", "alternate_names": ["Libr Hi Tech", "Library Hi Tech", "Libr hi tech"], "issn": "0737-8831", "url": "https://www.emerald.com/insight/publication/issn/0737-8831"}, "title": "Library book recommendation with CNN-FM deep learning approach", "abstract": "PurposeTraditional library book recommendation methods are mainly based on association rules and user profiles. They may help to learn about students' interest in different types of books, e.g., students majoring in science and engineering tend to pay more attention to computer books. Nevertheless, most of them still need to identify users' interests accurately. To solve the problem, the authors propose a novel embedding-driven model called InFo, which refers to users' intrinsic interests and academic preferences to provide personalized library book recommendations.Design/methodology/approachThe authors analyze the characteristics and challenges in real library book recommendations and then propose a method considering feature interactions. Specifically, the authors leverage the attention unit to extract students' preferences for different categories of books from their borrowing history, after which we feed the unit into the Factorization Machine with other context-aware features to learn students' hybrid interests. The authors employ a convolution neural network to extract high-order correlations among feature maps which are obtained by the outer product between feature embeddings.FindingsThe authors evaluate the model by conducting experiments on a real-world dataset in one university. The results show that the model outperforms other state-of-the-art methods in terms of two metrics called Recall and NDCG.Research limitations/implicationsIt requires a specific data size to prevent overfitting during model training, and the proposed method may face the user/item cold-start challenge.Practical implicationsThe embedding-driven book recommendation model could be applied in real libraries to provide valuable recommendations based on readers' preferences.Originality/valueThe proposed method is a practical embedding-driven model that accurately captures diverse user preferences.", "venue": "Library hi tech", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-04-28", "journal": {"name": "Library Hi Tech"}, "authors": [{"authorId": "46692895", "name": "Xiaohua Shi"}, {"authorId": "2215550812", "name": "Chen Hao"}, {"authorId": "2064748646", "name": "Ding Yue"}, {"authorId": "2115864530", "name": "Hongtao Lu"}], "citations": [{"paperId": "e5c4840be124ab27af9d351a09d0b76bf3961d3e", "title": "Editorial: Special selection on current bibliometrics and reviews"}]}
