{"paperId": "b18f9096f93c64645bc2d13851561d7d80eb8f77", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Stochastic Buffer-Aided Relay-Assisted MEC in Time-Slotted Systems", "abstract": "Mobile Edge Computing (MEC) has attracted significant research efforts in the recent years. However, these works consider mostly the computation resources located at the cloud centers and wireless access nodes, ignoring the possibility of utilizing server-empowered relays to improve the performance. In this paper, we study stochastic relay-assisted MEC in systems with discrete transmission time-line and block fading wireless channels. In order to clearly identify and inspect the fundamental affecting factors, we investigate the building block of this architecture, namely a hierarchical network consisting of a source, a buffer-and-server-aided relay and another higher-level computing node. We provide a framework to take into account the effects of the fading channels, the task arrival dynamics as well as the queuing delays in both the transmission and computation buffers, which facilitates the derivation of the expression for the Average Response Time (ART). Based on that and the system average power consumption in each slot, we introduce the concept of Average Response Energy (ARE) as a novel metric to capture the energy efficiency in MEC while considering the stochastic nature of the system parameters. Accordingly, we propose two offloading schemes with their respective problem formulations, namely the Minimum ART (MART) and the Minimum ARE (MARE) schemes, to optimize the transmission power and task assignment probability while keeping the system queues stable. We demonstrate the difference of the formulated problems with the relevant problem in a recent work, analyze the properties of the problems and noting them, we propose effective solution methods. Using extensive simulations, we validate the presented analysis and show the effectiveness of the proposed schemes in comparison with various baseline methods adapting existing approaches.", "venue": "arXiv.org", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-03-27", "journal": {"name": "ArXiv", "volume": "abs/2105.09463"}, "authors": [{"authorId": "3332781", "name": "Javad Hajipour"}], "citations": []}
