{"paperId": "b192e48ffcee08913703a3903710758438295458", "publicationVenue": null, "title": "Living on the Edge: Data Transmission, Storage, and Analytics in Continuous Sensing Environments", "abstract": "Voluminous time-series data streams produced in continuous sensing environments (CSEs) impose challenges pertaining to ingestion, storage, and analytics. In this study, we present a holistic approach based on data sketching to address these issues. We propose a hyper-sketching algorithm which combines discretization and frequency-based sketching to produce compact representations of the multi-feature, time-series data streams. We generate an ensemble of data sketches to make effective use of capabilities at the resource-constrained edge devices, the links over which data are transmitted, and the server pool where this data must be stored. The data sketches can be queried to construct datasets that are amenable to processing using popular analytical engines. We include several performance benchmarks using real-world data from different domains to profile the suitability of our design decisions. The proposed methodology can achieve up to ∼ 13× and ∼ 2207× reduction in data transfer and energy consumption at edge devices. We observe up to a ∼ 50% improvement in analytical job completion times in addition to the significant improvements in disk and network I/O.", "venue": "", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "3438590", "name": "Thilina Buddhika"}, {"authorId": "2528759", "name": "Matthew Malensek"}, {"authorId": "1747019", "name": "S. Pallickara"}, {"authorId": "119603554", "name": "Sangmi"}, {"authorId": "2103084340", "name": "Lee Pallickara"}], "citations": [{"paperId": "822536561477f6f894692c95b35db4c845d04ed7", "title": "Deep Dict: Deep Learning-based Lossy Time Series Compressor for IoT Data"}, {"paperId": "f50b807f3b0bc2021c2c91c3b6e58f5a98ef84ec", "title": "Rubiks: Rapid Explorations and Summarization over High Dimensional Spatiotemporal Datasets"}, {"paperId": "e9c2b1d32ceef3b24bba1f9081018faabde83a19", "title": "Time Series Compression for IoT: A Systematic Literature Review"}, {"paperId": "b828b575d30156e44c9c1017d61adaf23d16de74", "title": "A Fault Detection Mechanism for Database Management Systems on Mobile Edge Computing"}, {"paperId": "58bab021f7fad6c96af100ee8807945907c572bd", "title": "S-Edge: heterogeneity-aware, light-weighted, and edge computing integrated adaptive traffic light control framework"}, {"paperId": "03c47c2c10a3d59535a356a52d3f2f1d37b93f4f", "title": "When Edge Computing Meets Compact Data Structures"}, {"paperId": "9d353ef9e607f61fdf26ac51f6b5aae009db58cf", "title": "Edge Computing Technology Enablers: A Systematic Lecture Study"}]}
