{"paperId": "b19e2dc22446a76c7c154026c2b8190dd0eb5608", "publicationVenue": {"id": "3416dd37-f45d-40ed-b04e-875fcff8fa2f", "name": "Nutrients", "type": "journal", "issn": "2072-6643", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169249", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169249", "http://www.mdpi.com/journal/nutrients/", "https://www.mdpi.com/journal/nutrients"]}, "title": "Processed Dietary Patterns during Pregnancy Are Associated with Low Birth Weight at Term among Women of Advanced and Non-Advanced Age", "abstract": "Inappropriate dietary intake during pregnancy is a key factor in low birth weight (LBW). This study compares LBW between healthy and processed dietary patterns by focusing on women of advanced maternal age. A cross-sectional survey was conducted with 327 postpartum women in Taiwan. The participants were assigned to two groups according to their age (≥35 years, n = 151; and 20–34 years, n = 176). An online questionnaire asked women how often they consumed 27 food items during their pregnancy. The prevalence of LBW was higher in the processed dietary pattern (79.3%) than in the healthy pattern (13.78%, p < 0.001). LBW was positively correlated with advanced maternal age (≥35 ages), low pre-pregnancy weight (BMI less than 18.5 kg/m2), insufficient gestational weight gain (GWG), and processed dietary patterns. Older mothers were 5.8 times more likely to have infants with LBW (odds ratio = 5.8; 95% confidence interval 2.0–16.6). A processed dietary pattern was 9.4 times more likely to result in LBW. Insufficient GWG was significantly positively associated with LBW (OR = 4.0; 95%CI 1.4–11.6). Maternal diet during pregnancy is an important modifiable factor for LBW. Prenatal advice should emphasize optimal nutrition, especially in older and underweight women.", "venue": "Nutrients", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-08-01", "journal": {"name": "Nutrients", "volume": "14"}, "authors": [{"authorId": "2110515249", "name": "Tzu-Ling Chen"}, {"authorId": "49400859", "name": "Su-Fen Cheng"}, {"authorId": "144630407", "name": "M. Gau"}, {"authorId": "2111439710", "name": "Li Lin"}], "citations": [{"paperId": "0980911367dbd20c869757e832d92bd65c94f82d", "title": "RISK FACTORS THAT INCREASE MATERNAL MORBIDITY IN PREGNANT WOMEN BETWEEN 30 TO 34 YEARS OF AGE."}]}
