{"paperId": "b1a05313e172e34ed29f42d54715b38c624fb2dd", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Industry 5.0 is Coming: A Survey on Intelligent NextG Wireless Networks as Technological Enablers", "abstract": "Industry 5.0 vision, a step toward the next industrial revolution and enhancement to Industry 4.0, envisioned the new goals of resilient, sustainable, and human-centric approaches in diverse emerging applications, e.g., factories-of-the-future, digital society. The vision seeks to leverage human intelligence and creativity in nexus with intelligent, efficient, and reliable cognitive collaborating robots (cobots) to achieve zero waste, zerodefect, and mass customization-based manufacturing solutions. However, the vision requires the merging of cyber-physical worlds through utilizing Industry 5.0 technological enablers, e.g., cognitive cobots, person-centric artificial intelligence (AI), cyberphysical systems, digital twins, hyperconverged data storage and computing, communication infrastructure, and others. In this regard, the convergence of the emerging computational intelligence (CI) paradigm and next-generation wireless networks (NGWNs) can fulfill the stringent communication and computation requirements of the technological enablers in the Industry 5.0 vision, which is the aim of this survey-based tutorial. In this article, we address this issue by reviewing and analyzing current emerging concepts and technologies, e.g., CI tools and frameworks, network-in-box architecture, open radio access networks, softwarized service architectures, potential enabling services, and others, essential for designing the objectives of CINGWNs to fulfill the Industry 5.0 vision requirements. Finally, we provide a list of lessons learned from our detailed review, research challenges, and open issues that should be addressed in CI-NGWNs to realize Industry 5.0.", "venue": "arXiv.org", "year": 2022, "fieldsOfStudy": ["Computer Science", "Engineering"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-05-18", "journal": {"name": "ArXiv", "volume": "abs/2205.09084"}, "authors": [{"authorId": "22627722", "name": "S. Zeb"}, {"authorId": "39981958", "name": "Aamir Mahmood"}, {"authorId": "10779576", "name": "Sunder Ali Khowaja"}, {"authorId": "1845870613", "name": "K. Dev"}, {"authorId": "1738972611", "name": "S. Hassan"}, {"authorId": "32991017", "name": "N. Qureshi"}, {"authorId": "1717389", "name": "M. Gidlund"}, {"authorId": "1740127", "name": "P. Bellavista"}], "citations": [{"paperId": "556e70e500ea6ab715eef784730dbfbf5ec0de2c", "title": "Slide-block: End-to-end amplified security to improve DevOps resilience through pattern-based authentication"}, {"paperId": "5f86f8cf220765d46ed9efe582545049685d2cd1", "title": "A Combined Approach of Industrial Edge Computing and Machine Learning for Predictive Maintenance"}, {"paperId": "68766522b860eb493676de2078e8d9ce3d487e72", "title": "Reviewing and Integrating AEC Practices into Industry 6.0: Strategies for Smart and Sustainable Future-Built Environments"}, {"paperId": "a50b4d03bb1aded80806afb8c6a161274f73331d", "title": "Review of Transition from Mining 4.0 to 5.0 in Fossil Energy Sources Production"}, {"paperId": "cc955695f551a6e93095dafabb8876dcc54467f2", "title": "The Human-Centric Metaverse: A Survey"}, {"paperId": "b945f38ffe892363651ef4217c2757622431868a", "title": "Evaluating eXplainable artificial intelligence tools for hard disk drive predictive maintenance"}, {"paperId": "7b552dd388de8d6a336287d8a42951a9b8ee417c", "title": "Deep RL-assisted Energy Harvesting in CR-NOMA Communications for NextG IoT Networks"}, {"paperId": "10521c53402a58b7f8ed543649e70ad284866baa", "title": "Adaptive mobile VR content delivery for industrial 5.0"}, {"paperId": "b99aee5cdefc6a7c947acf53c64a6ef437aba058", "title": "Blockchain-based Product Lifecycle Management using Supply Chain Management for Railcar Remanufacturing"}]}
