{"paperId": "b1a2ce46197a700d835657396915c133ae04b36b", "publicationVenue": {"id": "6336131c-2f71-4f61-bc3b-1bf31ec9fa3d", "name": "International Conference on Computing for Sustainable Global Development", "type": "conference", "alternate_names": ["INDIACom", "Int Conf Comput Sustain Glob Dev"]}, "title": "Application of Big Data Analytics to optimize the operations in the upstream petroleum industry", "abstract": "This paper focuses on increasing the efficiency of the E&P Companies in their extraction process with a new approach and methodology based on Big Data Analytics. This involves an approach in which the E & P companies could extract out the best of the results from the data which is being retrieved from their various data collecting sources like the RFID Sensors, SCADA Systems etc. and thus they could make out the best possible decisions. This approach is based on the predictive analysis of the past data defining the well activity. Thus with the help of the big data analytics companies could make more accurate decisions and better risk analysis and also reduce costs as compared to the traditional approaches like the GIS, Remote Sensing etc. and thus provide a new and efficient approach for the future of the Oil and Gas upstream industry. It also offers guidance on how big data can be used to gain valuable operational insight and to assist in decision-making.", "venue": "International Conference on Computing for Sustainable Global Development", "year": 2015, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2015-03-11", "journal": {"name": "2015 2nd International Conference on Computing for Sustainable Global Development (INDIACom)", "pages": "1074-1079"}, "authors": [{"authorId": "2108410150", "name": "S. Singh"}, {"authorId": "9407756", "name": "S. Pandey"}, {"authorId": "2057418964", "name": "R. Shankar"}, {"authorId": "152455377", "name": "A. Dumka"}], "citations": [{"paperId": "6046b1ad6859c608d87080f07845777b3859982d", "title": "Structuring Problem Cases Based on Constraints in the Drilling Control Infocommunications Routines"}, {"paperId": "7baae4f977b79c1888d71e6d6cf3d5dbe82d8c9c", "title": "Software Outlines for Decisions Making Support in Oil and Gas Engineering"}, {"paperId": "91028e204a2a81d3883594f3f2868c62f67235f5", "title": "Using big data technologies in petroleum industry"}]}
