{"paperId": "b1a418612aa4cdc59ef8c943861d43ae5b5f8943", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Synchronization in Digital Twins for Industrial Control Systems", "abstract": "Digital twins, which are a new concept in industrial control systems (ICS), play a key role in realizing the vision of a smart factory, and they can have different effective use cases. With digital twins, we have virtual replicas of physical systems so that they precisely mirror the internal behavior of the physical systems. Hence, synchronization is necessary to keep the states of digital twins in sync with those of their physical counterparts. Otherwise, their behavior may be different from each other, and it can lead to wrong decisions about the system that can have catastrophic consequences. In this paper, we propose three different architectures for digital twins, and then by investigating their ability to follow the physical system's behavior, we will determine the best architecture, whose output has the lowest error compared with the physical system's output.", "venue": "arXiv.org", "year": 2020, "fieldsOfStudy": ["Computer Science", "Engineering"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-06-05", "journal": {"name": "ArXiv", "volume": "abs/2006.03447"}, "authors": [{"authorId": "5985818", "name": "F. Akbarian"}, {"authorId": "1486191233", "name": "Emma Fitzgerald"}, {"authorId": "1683142", "name": "M. Kihl"}], "citations": [{"paperId": "07f25dd7d2c209dd0085fc320f6a7e0defde4c2f", "title": "State Synchronization for Dual Digital Twin of EV Batteries by Lyapunov Stability Condition and Contraction Analysis"}, {"paperId": "970d2b4b7cab059bf04a202dcc46ae50e37d6889", "title": "Synchronizing a collaborative arm’s digital twin in real-time"}, {"paperId": "3cc9701f94adc208000c4350be1fb72ee98b5e05", "title": "Online Control Method of DC Motor Based on Digital Twin Architecture in Network Environment"}, {"paperId": "f53776356e468f002a83a414a431777b156ecf35", "title": "TwinSync: A Digital Twin Synchronization Protocol for Bandwidth-Limited IoT Applications"}, {"paperId": "53258130a44bb612a2f8f3d4355611c2bb9e3cdc", "title": "Web-based digital twin online laboratories: Methodologies and implementation"}, {"paperId": "aee45700e2851258d331264be1fc26120c764d00", "title": "Knowledge Equivalence in Digital Twins of Intelligent Systems"}, {"paperId": "27ef778ac39674ea456f23259dedf1955422189a", "title": "Digital Twin-based Intrusion Detection for Industrial Control Systems"}, {"paperId": "326ed12ce37618dd171288986f4942a837a5e0cb", "title": "From Virtual Simulation to Digital Twins in Online Laboratories"}, {"paperId": "c3f4d8650ac7010ef89c880c4b704eb501376413", "title": "Intrusion Detection in Digital Twins for Industrial Control Systems"}, {"paperId": "b0e95009ea3aa50f37711d0ff866f77b348ba93b", "title": "Knowledge Driven Approach to Auto-Generate Digital Twins for Industrial Plants"}]}
