{"paperId": "b1b0d9452112713efdb163b507a9382938b57554", "publicationVenue": {"id": "b8b7e46a-b0b0-4e0c-a6ed-9c098005b185", "name": "Laboratory Investigation", "type": "journal", "alternate_names": ["Lab Investig"], "issn": "0023-6837", "url": "http://www.nature.com/labinvest/index.html"}, "title": "Artificial intelligence and computational pathology", "abstract": null, "venue": "Laboratory Investigation", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2021-01-16", "journal": {"name": "Laboratory Investigation; a Journal of Technical Methods and Pathology", "pages": "412 - 422", "volume": "101"}, "authors": [{"authorId": "48782124", "name": "M. Cui"}, {"authorId": "2116655978", "name": "David Zhang"}], "citations": [{"paperId": "09cca54bb354b0e9c438a69d25847e132980522a", "title": "Supporting Mitosis Detection AI Training with Inter-Observer Eye-Gaze Consistencies"}, {"paperId": "6a3fb292c6ecf6d29a83ff22a55eeb2c59eeaff8", "title": "Lung cancer diagnosis on virtual histologically stained tissue using weakly supervised learning"}, {"paperId": "6959e99d0863d654e58dc3b233b0df81c89f985f", "title": "DAX-Net: A dual-branch dual-task adaptive cross-weight feature fusion network for robust multi-class cancer classification in pathology images."}, {"paperId": "ce132be25916f10f29f1642ff39726602299aa92", "title": "Detailed Image Data Quality and Cleaning Practices for Artificial Intelligence Tools for Breast Cancer."}, {"paperId": "617bba30d385a7c86253ae999212e43cb36d7cf2", "title": "Feature Re-Embedding: Towards Foundation Model-Level Performance in Computational Pathology"}, {"paperId": "b8f07979a9e589942b84b2cb6bc252c04f01de20", "title": "Deep learning infers clinically relevant protein levels and drug response in breast cancer from unannotated pathology images"}, {"paperId": "f52b4725c65c8292b6aed51a4843c6aa77c430d5", "title": "Artificial intelligence’s impact on breast cancer pathology: a literature review"}, {"paperId": "23cb101e852f95bb24e4660a6ae7d0e591134857", "title": "Surrogate Biomarker Prediction from Whole-Slide Images for Evaluating Overall Survival in Lung Adenocarcinoma"}, {"paperId": "c8fb9c02463ca8e16539d0c838efccc9331f2a91", "title": "4T-Net: Multitask deep learning for nuclear analysis from pathology images"}, {"paperId": "a2954bce66d541bfbfabbe1dfc1a2a8a2892de1a", "title": "Standardizing digital biobanks: integrating imaging, genomic, and clinical data for precision medicine"}, {"paperId": "f911a68eeed59703997934a59ebc8b8862c65d0a", "title": "AI in Indian healthcare: From roadmap to reality"}, {"paperId": "89fa3e2974c93ddf36aa8f0ce34013f2f18b0eed", "title": "Survival Prediction via Deep Attention-Based Multiple-Instance Learning Networks with Instance Sampling"}, {"paperId": "022be0a1ff532e368259492d1c9bd72803015a19", "title": "Artificial Intelligence-Enabled Prostate Cancer Diagnosis and Prognosis: Current State and Future Implications."}, {"paperId": "11845bb5d4d4f032ba4e55a7af6b7bba875addd7", "title": "From Pixel to Slide image: Polarization Modality-based Pathological Diagnosis Using Representation Learning"}, {"paperId": "14b34a980dc4a9062c9b2eacbdf31d81f9adbd14", "title": "Intraoperative margin assessment for basal cell carcinoma with deep learning and histologic tumor mapping to surgical site"}, {"paperId": "8c89702c1e2560e763ec3982437c3914bdf9e355", "title": "Computational pathology: A survey review and the way forward"}, {"paperId": "d26c3547629ef05f7a796746e2fa21e252b6ca81", "title": "A Systematic Comparison of Task Adaptation Techniques for Digital Histopathology"}, {"paperId": "51ad1b326a2758692b9914b2f3b39a5424006cc7", "title": "BioMedInformatics, the Link between Biomedical Informatics, Biology and Computational Medicine"}, {"paperId": "9a383133c450958574e8b055cbaa4fc489fe6bd7", "title": "The Dawn of a New Era in Kidney Transplantation: Promises and Limitations of Artificial Intelligence for Precision Diagnostics"}, {"paperId": "b1721374889899950994f67029fe899de257c140", "title": "A Foundational Multimodal Vision Language AI Assistant for Human Pathology"}, {"paperId": "8bda54c813b7032e70ad5f6f0418ce20eb614408", "title": "Analysis of Intelligent Research and Development System of Power Communication Equipment Based on Artificial Intelligence Technology"}, {"paperId": "93c61d5e551d689b3a887e2adaf7910b4b5beefc", "title": "Synergies and Challenges in the Preclinical and Clinical Implementation of Pathology Artificial Intelligence Applications"}, {"paperId": "1d6434a9d70e149b4ee667c99b12e20959856a82", "title": "Use of Novel Open-Source Deep Learning Platform for Quantification of Ki-67 in Neuroendocrine Tumors – Analytical Validation"}, {"paperId": "53b306e8d1801ed7742fd2f5402bf161e8bbb081", "title": "Bridging bytes and biopsies: A comparative analysis of ChatGPT and histopathologists in pathology diagnosis and collaborative potential."}, {"paperId": "b8a125d8a7d6a3f2d78b4e80bef163e7ec7a2946", "title": "Artificial Intelligence in early detection of Adverse Drug Reaction for Anti-psychotic drugs"}, {"paperId": "65f0d8fc363fc73c64c1746b19a0d8cb8b0ab28d", "title": "A diagnostic strategy for pulmonary fat embolism based on routine H&E staining using computational pathology"}, {"paperId": "41a7f0bea84ff0fb0e423c7fae401bf8d9904ff9", "title": "Semi-supervised ViT knowledge distillation network with style transfer normalization for colorectal liver metastases survival prediction"}, {"paperId": "d8c01b2bc325a00ad237230507702cb9ee472a1d", "title": "Dual-channel Prototype Network for few-shot Classification of Pathological Images"}, {"paperId": "b438c35746629899818197c001a5b47426eefb6c", "title": "Stain Consistency Learning: Handling Stain Variation for Automatic Digital Pathology Segmentation"}, {"paperId": "8799a3d93966833a122588ffbe2bc83ee9a0c26d", "title": "Why do errors arise in artificial intelligence diagnostic tools in histopathology and how can we minimize them?"}, {"paperId": "18f00d33257f70f6eabf35cfc0724950dfe457a7", "title": "Computational pathology in the identification of HER2-low breast cancer: Opportunities and challenges"}, {"paperId": "6dc24c89d1396274791f05b464c5383357ce7bb9", "title": "Digital Pathology in Cardiac Transplant Diagnostics: From Biopsies to Algorithms."}, {"paperId": "b55b08bbf74f5c524a4d4bef60000ddb80237da6", "title": "Learning to predict prostate cancer recurrence from tissue images"}, {"paperId": "d35ba05ca3ea57ef884a3b4f4add8990059d9283", "title": "Investigating the impact of artificial intelligence on human resource functions in the health sector of China: A mediated moderation model"}, {"paperId": "d8b61a7b7853a79af02f7d0846895112470327a4", "title": "Assessing Knowledge, Acceptance, and Anticipated Impact of Telepathology in Saudi Arabia: Insights From Healthcare Workers and Patients"}, {"paperId": "4d0b9cc8b5b8797bce16212d22750d7cbd9932ea", "title": "Empowering sustainability in the built environment: A technological Lens on industry 4.0 Enablers"}, {"paperId": "ab0a2fd22cdcec1716c5651a65f91f542f19d773", "title": "ChatGPT as an aid for pathological diagnosis of cancer."}, {"paperId": "53afdd4a5f35f4bc08a40e792f4196be47ffe44e", "title": "Combined analytical approach empowers precise spectroscopic interpretation of subcellular components of pancreatic cancer cells"}, {"paperId": "56acad9a36a2e148d65e1c7a8f1a87d4766e77d4", "title": "Making AI’s Impact on Pathology Visible: Using Ethnographic Methods for Ethical and Epistemological Insights"}, {"paperId": "7c54d067006ed5670299feafb5c49478455e452e", "title": "Mixing Histopathology Prototypes into Robust Slide-Level Representations for Cancer Subtyping"}, {"paperId": "01331242e8089f4fd27b859ec075d374c7f4bac0", "title": "Overcoming diagnostic challenges of artificial intelligence in pathology and radiology: Innovative solutions and strategies"}, {"paperId": "a279720bd2e13d863a8eead99c3f8f3be225f3db", "title": "The Use of Artificial Intelligence in Lung Cancer Management"}, {"paperId": "0ea856e414315f2d77351e13b6c0d43b503c2da5", "title": "New Artificial Intelligence System Based on Information Processing Technology"}, {"paperId": "8a5d8cf9c292686d6a5e704951712b4aa66c409a", "title": "Application of multiple-finding segmentation utilizing Mask R-CNN-based deep learning in a rat model of drug-induced liver injury"}, {"paperId": "495f6fe67192b6cf20705b6efbbe587734c3b04b", "title": "Deep Learning Predicts Biomarker Status and Discovers Related Histomorphology Characteristics for Low-Grade Glioma"}, {"paperId": "922148ba55d6441051aa9ded2e5523bf13d0c27c", "title": "Introducing instance label correlation in multiple instance learning. Application to cancer detection on histopathological images"}, {"paperId": "e431d50418748a4f357df05316b978072ee0c65d", "title": "TADA: Temporal-aware Adversarial Domain Adaptation for patient outcomes forecasting"}, {"paperId": "ef22a071ebafba387d7b1c9a31e2a42b9bc1b3c2", "title": "MG-Trans: Multi-Scale Graph Transformer With Information Bottleneck for Whole Slide Image Classification"}, {"paperId": "9068fe7b25bf8ea38747046982144f08f5484543", "title": "Automating Ground Truth Annotations for Gland Segmentation Through Immunohistochemistry."}, {"paperId": "67c65fe5abb054e4a96bb5eb1163b48d9bca9015", "title": "Use of Artificial Intelligence for Analyzing Kidney Stone Composition: Are We There Yet?"}, {"paperId": "8e3d8d990e2eaf49090b2ca6eec130ce3a4038bc", "title": "Optimizing Storage and Computational Efficiency: An Efficient Algorithm for Whole Slide Image Size Reduction"}, {"paperId": "b6447d4c6c77e07a47c074d1a0c626424c5104c7", "title": "Computational immunohistochemical mapping adds immune context to histological phenotypes in mouse models of colitis"}, {"paperId": "09330e761c49d5bdd12f9100da3c4fb6e0ed0a76", "title": "Pathomic Features Reveal Immune and Molecular Evolution From Lung Preneoplasia to Invasive Adenocarcinoma"}, {"paperId": "d37e99c71ebb4836d13fcce4ed1d7e2972065076", "title": "Revolutionizing Digital Pathology with the Power of Generative Artificial Intelligence and Foundation Models."}, {"paperId": "572d5a1d1c95487b0b12ee7b10c2b8051b43c770", "title": "Detection and quantitative analysis of tumor-associated tertiary lymphoid structures"}, {"paperId": "4783219d2ab75955f580d10b387aeb38cc92330d", "title": "MoMA: Momentum Contrastive Learning with Multi-head Attention-based Knowledge Distillation for Histopathology Image Analysis"}, {"paperId": "016a13a94bdcedc620c61e880b4025721239d142", "title": "Artificial intelligence in general practice: An interview with ChatGPT"}, {"paperId": "d657254d617be610b7098a160a629cff91b78cdf", "title": "Artificial intelligence in clinical medicine: catalyzing a sustainable global healthcare paradigm"}, {"paperId": "5c450689ff32624d2fcc31f72493cac289b53752", "title": "Artificial Intelligence Engineering for Predictive Analytics"}, {"paperId": "3e736914151a2d7c695e034e978ffe68bd7c66eb", "title": "An Assessment of Contemporary Methods and Data-Enabled Approaches for Early Cataract Detection"}, {"paperId": "ad9ddaa824e4224197f93d41deb2eddd140a55e1", "title": "Design and implementation of push up action evaluation system based on Kinect"}, {"paperId": "68568e574824813ec0c7eea4eed4178d099d1719", "title": "Artificial Intelligence in pathology: current applications, limitations, and future directions"}, {"paperId": "65e4b93b37981cc974ea4abed325d80ecfd309af", "title": "NuInsSeg: A fully annotated dataset for nuclei instance segmentation in H&E-stained histological images"}, {"paperId": "d686071e3f0f7fb8cf394f8c9f519c862c9b22ea", "title": "Unleashing the potential of AI for pathology: challenges and recommendations"}, {"paperId": "3c2be95acf063bda0107d4ee2a5c6827cccf9fe6", "title": "CaMeL-Net: Centroid-aware metric learning for efficient multi-class cancer classification in pathology images"}, {"paperId": "e5ca6223d07a07a3314be0d724709f5a0422d914", "title": "Deep learning integrates histopathology and proteogenomics at a pan-cancer level"}, {"paperId": "a2efe3bbc051ad35a60819c8bc09ebd50e15425f", "title": "Computational pathology in cancer diagnosis, prognosis, and prediction – present day and prospects"}, {"paperId": "e43b43cd452550059c4d35c174901f62ec4d4567", "title": "Refining Liver Biopsy in Hepatocellular Carcinoma: An In-Depth Exploration of Shifting Diagnostic and Therapeutic Applications"}, {"paperId": "bfebf42c3dca0fb48b4ff641cb3a9a0f512f4cff", "title": "Advancing Patient Care: How Artificial Intelligence Is Transforming Healthcare"}, {"paperId": "5ae2015d083e99e798c032fdddbe89154e20e973", "title": "Vision Transformers for Computational Histopathology"}, {"paperId": "1eb28386605bad387a3315e18eda6ea9dd5d7877", "title": "Opportunities and challenges for deep learning in cell dynamics research."}, {"paperId": "f80ac1d904648ecf366cebfc737eee0128a8d142", "title": "The Role of Artificial Intelligence in Healthcare and Medical Negligence"}, {"paperId": "0900126a594d07ac519299b559b21b73d2e4ee5a", "title": "Artificial Intelligence for Drug Discovery: Are We There Yet?"}, {"paperId": "70a3603c4ad82d480fce266b3e7f7c289d5171b3", "title": "Ethics of Artificial Intelligence"}, {"paperId": "b6e47631203220237faf07adb42a44ecdf01f2b4", "title": "TCNN: A Transformer Convolutional Neural Network for artifact classification in whole slide images"}, {"paperId": "67a300b5e5785e9e266aca2129ef2d7279dc0133", "title": "Comparative Evaluation of Breast Ductal Carcinoma Grading: A Deep-Learning Model and General Pathologists’ Assessment Approach"}, {"paperId": "16a0f266a050938ab34b1e649df2b773b0d77e59", "title": "The State of Applying Artificial Intelligence to Tissue Imaging for Cancer Research and Early Detection"}, {"paperId": "623782c321ab152ffe12a05d6ed41e341cf88fc5", "title": "USE OF ARTIFICIAL INTELLIGENCE IN HISTOPATHOLOGICAL INTERPRETATION - A MINI REVIEW"}, {"paperId": "2151b74a57f4fb5d6e88f22c785e44de858f8d98", "title": "High-plex immunofluorescence imaging and traditional histology of the same tissue section for discovering image-based biomarkers"}, {"paperId": "7ac137705dc986aed53d0a1168706b34630d3ac7", "title": "A convolutional neural network STIFMap reveals associations between stromal stiffness and EMT in breast cancer"}, {"paperId": "7eddac2807fa24901625b680bf7f2eec650e555a", "title": "Machine learning in computational histopathology: Challenges and opportunities"}, {"paperId": "47b94b37bafc0ec9501f981b84dc5fdb851532d2", "title": "Artificial Intelligence-Aided Optical Imaging for Cancer Theranostics."}, {"paperId": "7c40c0d77b23d15bf31409f5d16f1e27daaf582e", "title": "Histopathological Image Deep Feature Representation for CBIR in Smart PACS"}, {"paperId": "2eb27761dd4276fb1242cab722e70afad0a15e18", "title": "Two-stage semantic segmentation in neural networks"}, {"paperId": "2d6cff47c7e82c9f8be9ac5edd737dbfab5b6ca1", "title": "Digitization of Pathology Labs: A Review of Lessons Learned"}, {"paperId": "1330ad5ae47025006943170b63d84efee49d69fb", "title": "Semi-supervised nuclei segmentation based on multi-edge features fusion attention network"}, {"paperId": "94ce0986bc1d58cd8154a48c13e7b70f72922373", "title": "Unlocking the Potential of Medical Imaging with ChatGPT's Intelligent Diagnostics"}, {"paperId": "902b699d9e1c008cbe6f2c20e2b850630e0d5625", "title": "Cascaded Cross-Attention Networks for Data-Efficient Whole-Slide Image Classification Using Transformers"}, {"paperId": "9ccd42dbde7f1025e711a953d2316f064e6c83d2", "title": "Deep learning-based methods for classification of microsatellite instability in endometrial cancer from HE-stained pathological images"}, {"paperId": "f717dfb790c0404026d549d25c3025031b454ba2", "title": "Unsupervised Mutual Transformer Learning for Multi-Gigapixel Whole Slide Image Classification"}, {"paperId": "d89390493ff5f9c09e50694ddeb6a43a4520a6ea", "title": "Artificial Intelligence in Clinical Oncology: From Data to Digital Pathology and Treatment."}, {"paperId": "540870d9f43ee30f8cf0d8ce5354b4497b2c765a", "title": "Deep learning in computational dermatopathology of melanoma: A technical systematic literature review"}, {"paperId": "513fc9d2500a0e532ddf17ed7f8ed4d1cfb727af", "title": "Generative models improve fairness of medical classifiers under distribution shifts"}, {"paperId": "98adae1da186b11df8fb0974e996ea3efb097d9d", "title": "Explainability and causability in digital pathology"}, {"paperId": "e5aaa558dd12efb295a456e39d65d818985f038e", "title": "The ethical aspects of exposome research: a systematic review"}, {"paperId": "e4ffbe2ad9f134f933855b036adba40c4797aaff", "title": "Accurate segmentation of nuclear instances using a double-stage neural network"}, {"paperId": "fe4b9562c542f5df1dea05bf1decca9dc3930e23", "title": "On the use of AI-based tools like ChatGPT to support management research"}, {"paperId": "fdd4c848e84d096cd5f920a10b09b3a371eceea5", "title": "Whole Slide Images in Artificial Intelligence Applications in Digital Pathology: Challenges and Pitfalls"}, {"paperId": "8d7409c45b23e220351199eba64a3f19fe15e44a", "title": "Machine learning based orthodontic treatment planning for mixed dentition borderline cases suffering from moderate to severe crowding: An experimental research study."}, {"paperId": "1f85c3d75164969a59999204c23a4f5cc7547bcb", "title": "The NCI Imaging Data Commons as a platform for reproducible research in computational pathology"}, {"paperId": "47fd5bf1b3354441b778d11e42a51f4862a1cb51", "title": "HiTAIC: hierarchical tumor artificial intelligence classifier traces tissue of origin and tumor type in primary and metastasized tumors using DNA methylation"}, {"paperId": "727eae02f50f44e09fa5adc6d2a96f34d47cd8ad", "title": "Deep Learning for Predicting Metastasis on Melanoma Wsis"}, {"paperId": "bc3f86a32f8093c9a3a55957093e176c65e9bf7d", "title": "Artificial Intelligence for Kidney Stone Spectra Analysis: Using Artificial Intelligence Algorithms for Quality Assurance in the Clinical Laboratory"}, {"paperId": "a49fe85ab8a1a8c25642509b323caa014f7ecf90", "title": "AI in Pathology: What could possibly go wrong?"}, {"paperId": "dcf966b2477640be087f6056591eabf6a3b12dae", "title": "Multi-modal digital pathology for colorectal cancer diagnosis by high-plex immunofluorescence imaging and traditional histology of the same tissue section"}, {"paperId": "61f754cf47788a68737d01734d330d71024d68c9", "title": "Exploring the Use of Artificial Intelligence in the Management of Prostate Cancer"}, {"paperId": "cd7986d403be52bf2ca0718d8e620804121a0c0f", "title": "From slides (through tiles) to pixels: an explainability framework for weakly supervised models in pre-clinical pathology"}, {"paperId": "226494bc772498395459f0ab3bb75028c5bb60d3", "title": "The status of digital pathology and associated infrastructure within Alzheimer’s Disease Centers"}, {"paperId": "dd6ecf30a51871212dbc3f1675f4ef7710649e5b", "title": "Multicenter automatic detection of invasive carcinoma on breast whole slide images"}, {"paperId": "72a5be4078278fa86fb6e7b45ed8f059c65b58ea", "title": "Knowledge Distillation in Histology Landscape by Multi-Layer Features Supervision"}, {"paperId": "51ef7e2118fa6f57f3ed328cf6e37deee0fb30cb", "title": "An emerging era of computational cytology"}, {"paperId": "d50109e48e56909e6a18657848fbbe9f32e34528", "title": "Digital cytology: Current status and future prospects"}, {"paperId": "806f8f896bff3c00bb3408768eaf5a6713e6b285", "title": "Recent advances in wearable electromechanical sensors—Moving towards machine learning-assisted wearable sensing systems"}, {"paperId": "157ae15194c58190f139fa3b09a9c36bb1376550", "title": "BestCyte® primary screening of 500 ThinPrep Pap Test thin-layers: 3 Cytologists’ Interobserver diagnostic concordance with predicate manual microscopy relative to Truth Reference diagnoses defining NILM, ASCUS+, LSIL+, and ASCH+ thresholds for specificity, sensitivity, and equivalency grading"}, {"paperId": "734b5fbc5bc816d502fdf76ea894b1caecfb3cc1", "title": "MarrowQuant 2.0: A Digital Pathology Workflow Assisting Bone Marrow Evaluation in Experimental and Clinical Hematology."}, {"paperId": "55fdd807a1a6f727acad36a7e22a54c17edfade3", "title": "General stain deconvolution of histopathology images with physics-guided deep learning"}, {"paperId": "bce58f288c46a6d331d3c6c9f1cbb5df702423db", "title": "Uncertainty-based Model Acceleration for Cancer Classification in Whole-Slide Images"}, {"paperId": "f81f1cfb92a89b8a25cda74db9f55dc79634f6d6", "title": "Accurate diagnostic tissue segmentation and concurrent disease subtyping with small datasets"}, {"paperId": "1652d0ab0b8f3707b572a592d1dc42333be0804c", "title": "An update on computational pathology tools for genitourinary pathology practice: A review paper from the Genitourinary Pathology Society (GUPS)"}, {"paperId": "318251bad4f6fa404be3dc2f0bc1611378c27dea", "title": "Machine learning does not outperform traditional statistical modelling for kidney allograft failure prediction."}, {"paperId": "fec4e46adf0f5aa50b2b8c331831ba4a046a34a8", "title": "Cellular senescence in cancer: clinical detection and prognostic implications"}, {"paperId": "abb4b6f5944df27c6999af859b9e2f97ba1bdef8", "title": "Breast Cancer Dataset, Classification and Detection Using Deep Learning"}, {"paperId": "39f10edab3dca3bf59c661c3c7e9de4593a237d7", "title": "Computational Pipeline for Glomerular Segmentation and Association of the Quantified Regions with Prognosis of Kidney Function in IgA Nephropathy"}, {"paperId": "c320e825a3be6fd86ccc70389146906cc4c055aa", "title": "Cross Department’s Elective Course Recommendation for University Students using Hybrid Filtering"}, {"paperId": "60da180d07daf4b5fd8c6c0b13afd91455dac632", "title": "Perspective on oxide-based three-terminal artificial synapses in physical neural networks"}, {"paperId": "874410c400266d7295753c653b52e6afa79a015b", "title": "Computer-Assisted Annotation of Digital H&E/SOX10 Dual Stains Generates High-Performing Convolutional Neural Network for Calculating Tumor Burden in H&E-Stained Cutaneous Melanoma"}, {"paperId": "80dedc07a35b48f92dbff3fe12a6e0361cdfcf4c", "title": "Computational pathology in renal disease: a comprehensive perspective"}, {"paperId": "2ca6193d811f127f45765ac97534324b94df5700", "title": "Artificial intelligence-augmented histopathologic review using image analysis to optimize DNA yield from formalin-fixed paraffin-embedded slides"}, {"paperId": "4b7ed26ac2ac5a1f05a64e91bfc5d90539ceb263", "title": "AI Based Diagnosis & Classification Of Lymph Node Fine Needle Aspiration Cytology (FNAC)"}, {"paperId": "d8d0e0230f72c407180e9fc39c3df20cd926f393", "title": "A hierarchical machine learning model based on Glioblastoma patients' clinical, biomedical, and image data to analyze their treatment plans"}, {"paperId": "0b7541393cbfd71e88f3aa90988be901e9daf05a", "title": "Artificial intelligence in hematological diagnostics: Game changer or gadget?"}, {"paperId": "759d7b3916b19905a8e97a17d95f970738a6bae4", "title": "Digital technology for improving health"}, {"paperId": "d9e71d4fd5cb35ef6d2996ef77ee3b5872994c2e", "title": "Energy System 4.0: Digitalization of the Energy Sector with Inclination towards Sustainability"}, {"paperId": "3811172f22edf3f37e676f50f1010b9773abee3a", "title": "Histology segmentation using active learning on regions of interest in oral cavity squamous cell carcinoma"}, {"paperId": "ea5d4ce946c3b1f16efa4d74be21ff06e9fd6374", "title": "A Novel Network Model for Artificial Intelligence Algorithms"}, {"paperId": "7769675e4cac72f560ef4008d8e765405f93cb48", "title": "Identification of technology frontiers of artificial intelligence-assisted pathology based on patent citation network"}, {"paperId": "c0b14c6b5b7137f2da2a43095ef79651cba085ee", "title": "Integrating artificial intelligence in pathology: a qualitative interview study of users’ experiences and expectations"}, {"paperId": "2742d7f72e9eb91ae5976b4f30caac027ff272b8", "title": "Artificial Intelligence-Assisted Renal Pathology: Advances and Prospects"}, {"paperId": "4d8711dd1195686b46af81e0321f833679aa5e24", "title": "Analysis of neuroendocrine clones in NSCLCs using an immuno-guided laser-capture microdissection-based approach"}, {"paperId": "887e21751b53af5f7624c35329a6820d0a4c94aa", "title": "Computational pathology in ovarian cancer"}, {"paperId": "002cbe30e89dc716070fe624625d573541eae428", "title": "The Significance of External Quality Assessment Schemes for Molecular Testing in Clinical Laboratories"}, {"paperId": "e1f3a428a976646b29f89610a9eed2792554319c", "title": "Automated histological classification for digital pathology images of colonoscopy specimen via deep learning"}, {"paperId": "8dd8c5aeee5a730d4e9c8585510c5a1be4ad9b02", "title": "Application and Thinking of Artificial Intelligence in Electrical Automation"}, {"paperId": "ccd17dbb2b9f02456b7f688b6ee56bdf99a277de", "title": "NormToRaw: A Style Transfer Based Self-supervised Learning Approach for Nuclei Segmentation"}, {"paperId": "46a05dc0f062abe34167031decb75af24c9b25a0", "title": "Inter‐ and intraobserver agreement in whole‐slide digital ThinPrep samples of low‐grade squamous lesions of the cervix uteri with known high‐risk HPV status: A multicentric international study"}, {"paperId": "2b969f4168102b58be61c5a7bbc930da7c4b8726", "title": "Lymphocytes in the neighborhood: good or bad for the kidney?"}, {"paperId": "f668e8040e59ed2c31827a2b833f6c84bfe99b91", "title": "Advantages of manual and automatic computer-aided compared to traditional histopathological diagnosis of melanoma: A pilot study."}, {"paperId": "b9e67f4b784b2b5c8a885dc6df2d3bac8cef9f47", "title": "CS-CO: A Hybrid Self-Supervised Visual Representation Learning Method for H&E-stained Histopathological Images"}, {"paperId": "c1aee15f569444c2ac53591f2da7930836b563b1", "title": "Pilot study to evaluate tools to collect pathologist annotations for validating machine learning algorithms"}, {"paperId": "ea1960b59de25482ba8e6ef39819e591c02241dd", "title": "Rethinking ImageNet Pre-training for Computational Histopathology"}, {"paperId": "b1ef7a10061c97c4771fc7da0ff1915dbeec06e2", "title": "H^2-MIL: Exploring Hierarchical Representation with Heterogeneous Multiple Instance Learning for Whole Slide Image Analysis"}, {"paperId": "6b05305be8e72ee4d7f7856bd7b987c59e79a249", "title": "Invasive Cancerous Area Detection in Non-Muscle Invasive Bladder Cancer Whole Slide Images"}, {"paperId": "74cc59a9e8334f529adc9fda88a2941c50cdd268", "title": "Weakly-supervised deep learning models in computational pathology"}, {"paperId": "b77f2e48d603e1f8d1fab8a2b09fbd001ef1e2ba", "title": "Development of a Fully Automated Method to Obtain Reproducible Lymphocyte Counts in Patients With Colorectal Cancer"}, {"paperId": "5187636d30aa5801b136bec5957f2990c0daa492", "title": "Establishment of a whole slide imaging-based frozen section service at a cancer center"}, {"paperId": "3bb16467274dd4ff97ef084babfcbad994f6cd79", "title": "Artificial Intelligence-Assisted Image Analysis of Acetaminophen-Induced Acute Hepatic Injury in Sprague-Dawley Rats"}, {"paperId": "3c687629ee8cfddc3073e7832e5aa7fcb68d725d", "title": "A review of machine learning approaches, challenges and prospects for computational tumor pathology"}, {"paperId": "0a12fc125cde470d81ac01f4fc8d9c55f034d597", "title": "The state of the art for artificial intelligence in lung digital pathology"}, {"paperId": "4940b23dcd960469c20a50b2ee61bf64ac9dfe24", "title": "ArcticAI: A Deep Learning Platform for Rapid and Accurate Histological Assessment of Intraoperative Tumor Margins"}, {"paperId": "3dfdd2ecb643f6f09051410638e0ed377c99d312", "title": "Artificial intelligence for COVID-19: A Short Article"}, {"paperId": "54db5ce7bdb27c7d36f955be2affa0cd30f874f8", "title": "Detection of Abnormality in Prostate Tissues Using Two-dimensional Photonic Crystal Tactile Sensor"}, {"paperId": "0d8936da7febd28a554bdb0836e46270726b7b49", "title": "Automated Cancer Diagnostics via Analysis of Optical and Chemical Images by Deep and Shallow Learning"}, {"paperId": "47e51488967adab0c28250c600607f6e2d1de742", "title": "BestCyte® Cell Sorter Imaging System: Primary and adjudicative whole slide image rescreening review times of 500 ThinPrep Pap test thin-layers - An intra-observer, time-surrogate analysis of diagnostic confidence potentialities"}, {"paperId": "f7c8c68b8dcfdbae1fd230a6f81af1749691f89c", "title": "An analysis of pathologists’ viewing processes as they diagnose whole slide digital images"}, {"paperId": "3f7b130f150955bd8a48b5556ab0e88099d1094b", "title": "Artificial intelligence significantly improves the diagnostic accuracy of deep myxoid soft tissue lesions in histology"}, {"paperId": "e5b73dc90610849e6027afedca6d2fda3380fcae", "title": "Developing image analysis methods for digital pathology"}, {"paperId": "e8de203b50b18c5a88a492e052ee6673c2aad9c4", "title": "Flap failure prediction in microvascular tissue reconstruction using machine learning algorithms"}, {"paperId": "37eee0739b8f46d0f215aa9725f531c4aa0fa9ea", "title": "Immunoexpression of oral brush biopsy enhances the accuracy of diagnosis for oral lichen planus and lichenoid lesions"}, {"paperId": "579b84ffbed6687b5aef224bc557c313ea285cb6", "title": "Artificial neural network in diagnostic cytology"}, {"paperId": "4439f01187c9de656d47c669d12af2f1823d1b16", "title": "Artificial intelligence in prostate cancer: Definitions, current research, and future directions."}, {"paperId": "9625f2f345ddbd81d281ec0dee714d71076a494b", "title": "Application and performance of artificial intelligence technology in cytopathology."}, {"paperId": "44ee3ff9e2e3f2822abce5b0e1c4361053f0d4f3", "title": "The explainability paradox: Challenges for xAI in digital pathology"}, {"paperId": "f5a44ef49a48e21760530c963150949973787f4d", "title": "Usual interstitial pneumonia: a clinically significant pattern, but not the final word"}, {"paperId": "1283d714ba2043aaecc18e61330e5978b3302e88", "title": "The Challenges and Opportunities of Translational Pathology"}, {"paperId": "f693ecb9bdf5d7332291eb4e072980bc2b1c64d2", "title": "Digital pathology in Latin America"}, {"paperId": "bbc16ce2fe630fb4f48081356a38ba528532f2b1", "title": "Assessment of deep learning algorithms to predict histopathological diagnosis of breast cancer: first Moroccan prospective study on a private dataset"}, {"paperId": "24e6b6c3aeb2f1581aa569d12b142a73c0cadcba", "title": "A promising deep learning-assistive algorithm for histopathological screening of colorectal cancer"}, {"paperId": "0ecefce95248a431443d1ff38613a16c139b57da", "title": "Applications of Machine Learning in Routine Laboratory Medicine: Current State and Future Directions."}, {"paperId": "f0712d6792f02db4f159cf45f9e38c81342f6035", "title": "Deeper sections reveal residual tumor cells in rectal cancer specimens diagnosed with pathological complete response following neoadjuvant treatment"}, {"paperId": "b5536a3b7c8b72e65f992dfe3238dc18efdae08f", "title": "Development of Planar Illumination Strategies for Solving Mysteries in the Sub-Cellular Realm"}, {"paperId": "5bb7ff3952f8009be14f262f2e2deb00e36db3ec", "title": "Histokt: Cross Knowledge Transfer in Computational Pathology"}, {"paperId": "59b474ed849f0d13d6725e7f270e64ebc24a97c9", "title": "Survey on the perceptions of UK gastroenterologists and endoscopists to artificial intelligence"}, {"paperId": "1586ab7ee340d9246daef16d03c1eeaca6d69b00", "title": "Improving feature extraction from histopathological images through a fine-tuning ImageNet model"}, {"paperId": "c5e605d17d5b14af85f3e98a7aa39aebecfcc029", "title": "Digital Dermatopathology and Its Application to Mohs Micrographic Surgery"}, {"paperId": "9c1af37997e7b7b0743a77d82e3b9bc54f81cc59", "title": "Digital Technology in Diagnostic Breast Pathology and Immunohistochemistry"}, {"paperId": "4dbf8e7a03c40b3a72767985487dd47392843dbc", "title": "Conventional histological and cytological staining with simultaneous immunohistochemistry enabled by invisible chromogens"}, {"paperId": "2e29db2c8fb984c23fe175948f0cee55a5b201ba", "title": "Towards Launching AI Algorithms for Cellular Pathology into Clinical & Pharmaceutical Orbits"}, {"paperId": "74af4391ac48e2d1935440d98c6500ea32194a50", "title": "Tree-based Focused Web Crawling with Reinforcement Learning"}, {"paperId": "d5bb7591d5ce51fef3dd787d0b13cafc7b1be707", "title": "Evaluating Generic Auto-ML Tools for Computational Pathology"}, {"paperId": "63d850690ecf42101d2f53f15342a1686bddff3a", "title": "Deep Learning for the detection of microsatellite instability from histology images in colorectal cancer: a systematic literature review"}, {"paperId": "02a8883f756f09327cc134970be71db4dd893843", "title": "BRACS: A Dataset for BReAst Carcinoma Subtyping in H&E Histology Images"}, {"paperId": "3eeeed70f82cee3eb4c1bc2f217b4c9dc3e79b9d", "title": "Cancer nanotechnology: current status and perspectives"}, {"paperId": "36cf7db7fec5ed007926762f9758d4e1233e868f", "title": "Best Practice Recommendations for the Implementation of a Digital Pathology Workflow in the Anatomic Pathology Laboratory by the European Society of Digital and Integrative Pathology (ESDIP)"}, {"paperId": "1774d75039f7953095ced35cfd9bcdef64eeaaec", "title": "Detecting and grading prostate cancer in radical prostatectomy specimens through deep learning techniques"}, {"paperId": "a0022ee86e99981f0cde48fb4258b8ae21b96c6e", "title": "Harnessing multimodal data integration to advance precision oncology"}, {"paperId": "ed4a88c4e43f0ca19497909258d7dc0228837b65", "title": "Development of a semi‐automated method for tumour budding assessment in colorectal cancer and comparison with manual methods"}, {"paperId": "1be16fd2828286b6bab8127afd646b542378f363", "title": "Grading of adult diffuse gliomas according to the 2021 WHO Classification of Tumors of the Central Nervous System"}, {"paperId": "6c34f52571b02b936c1b0009a71443b4c8dc7876", "title": "Synthetic biomarkers: a twenty-first century path to early cancer detection"}, {"paperId": "ac7ab7d8441f0e50f400f0414d60b7b9041efb77", "title": "Preference and Demand for Digital Pathology and Computer-Aided Diagnosis among Korean Pathologists: A Survey Study Focused on Prostate Needle Biopsy"}, {"paperId": "7471f86570ae78247cf66b81efdf0d3fd36030e6", "title": "Artificial intelligence in computational pathology - challenges and future directions"}, {"paperId": "dee6030a78cdc3ea066db5d2de5d0cf88df7399b", "title": "Tissue Multiplex Analyte Detection in Anatomic Pathology – Pathways to Clinical Implementation"}, {"paperId": "d2166df5c8a58c640b0424179bd23da11e89484b", "title": "Mapping research strands of ethics of artificial intelligence in healthcare: A bibliometric and content analysis"}, {"paperId": "dee0a95cb427a50f1d74d913d894cf61e2df2b9b", "title": "Recent technical advances in whole slide imaging instrumentation"}, {"paperId": "98db1a282f09615d8bbb21b69396f9065e7111fe", "title": "A Transfer Learning Architecture Based on a Support Vector Machine for Histopathology Image Classification"}, {"paperId": "e3fc502d807b7d2c53d8a2611dc4a5966aa40c96", "title": "Using a convolutional neural network for classification of squamous and non-squamous non-small cell lung cancer based on diagnostic histopathology HES images"}, {"paperId": "a66f4bf53bd660c6d3c26f3fffc2d3ccc66ee9e8", "title": "Keratoconus detection of changes using deep learning of colour-coded maps"}, {"paperId": "ff7f6a6f89a5120b1bce90ee8b9735f91d90c630", "title": "Development of a semi-automated method for tumor budding assessment in colorectal cancer and comparison with manual methods"}, {"paperId": "1da7ff998576775f5f369f33c6bf53b5cdae0a99", "title": "A Deep Learning Approach to Capture the Essence of Candida albicans Morphologies"}, {"paperId": "ee322b0441a770ff60c6fab6ac9e4a7ac947e4cc", "title": "Tertiary Lymphoid Structures as a Predictive Biomarker of Response to Cancer Immunotherapies"}, {"paperId": "e3e11f010812da3f321e90817c2201f15907c822", "title": "Tissue Segmentation from Whole-Slide Images Using Lightweight Neural Networks"}, {"paperId": "6fd7ecd6e160ff0742849a59fd58e8e35ed0e2ad", "title": "Errors in Physician-AI Collaboration: Insights From a Mixed-methods Study of Explainable AI and Trust in Clinical Decision-making"}, {"paperId": "8ded23a28fdeefe201f52c53e4f86871abc77784", "title": "Biomedical Signal Processing and Control"}, {"paperId": "018afa6d31cebca059b10b0f76a6086d60ddfea5", "title": "Aesthetic Research on Intelligent Automation Design Combined with Virtual Reality Under the Background of Green Environmental Protection"}, {"paperId": "110c3dd983374d45d09db40320bc8aa4623d9a61", "title": "Automatic Design of Microcontroller System Simulation Based on Artificial Intelligence Technology and Data Intelligence Analysis"}, {"paperId": "4305a1e6bfcab6f2252a6d078cc8aadd1f47618b", "title": "Federated contrastive learning models for prostate cancer diagnosis and Gleason grading"}, {"paperId": "5e0c28cb6b4109fad9102424c1c2028088491a79", "title": "Considerations for data acquisition and modeling strategies: Mitosis detection in computational pathology"}, {"paperId": "52ed15ce995eadf13ec54baf902b8aa054346727", "title": "Investigation of Training Multiple Instance Learning Networks with Instance Sampling"}, {"paperId": "ffacc281a8e578e81c1307f63cc23bc0b329e39e", "title": "Artificial intelligence for medical robotics"}, {"paperId": "7396296f6a87a6705130b88d3e3e24efe33d4802", "title": "Whole Slide Image Quality in Digital Pathology: Review and Perspectives"}]}
