{"paperId": "b1b73cf36cfa03aca381514e4e00e59473db9f03", "publicationVenue": null, "title": "MURS: Mitigating Memory Pressure in Data Processing Systems for Service", "abstract": "It has been shown that in-memory computing systems suffer from serious memory pressure. The memory pressure will affect all submitted jobs. Memory pressure comes from the running tasks as they produce massive long-living data objects in the limited memory space. The long-living objects incur significant memory and CPU overheads. Some tasks cause the heavy memory pressure because of the operations and dataset they process, which in turn affect all running tasks in the system. Our studies show that a task often call several API functions provided by the need to constant memory space, while some need the linear memory space. As different models have different impact on memory pressure, we propose a method of classifying the models that the tasks belong to. The method uses the memory usage rate as the classification criteria. Further, we design a scheduler called MURS to mitigate the memory pressure. We implement MURS in Spark and conduct the experiments to evaluate the performance of MURS. The results show that when comparing to Spark, our scheduler can 1) decrease the execution time of submitted jobs by up to 65.8%, 2) mitigate the memory pressure in the server by decreasing the garbage collection time by up to 81%, and 3) reduce the data spilling, and hence disk I/Os, by approximately 90%.", "venue": "", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2017-03-27", "journal": {"name": "arXiv: Distributed, Parallel, and Cluster Computing", "volume": ""}, "authors": [{"authorId": "1678835", "name": "Xuanhua Shi"}, {"authorId": "2143001039", "name": "Xiong Zhang"}, {"authorId": "1683219", "name": "Ligang He"}, {"authorId": "145914256", "name": "Hai Jin"}, {"authorId": "9929242", "name": "Zhixiang Ke"}, {"authorId": "2108819668", "name": "Song Wu"}], "citations": []}
