{"paperId": "b1b771e6ac48789de70479d103a79a4d1bdee97e", "publicationVenue": {"id": "3d58f8bf-fe41-4b9c-84c4-5c4299f3041e", "name": "IEEE Latin America Transactions", "type": "journal", "alternate_names": ["IEEE Lat Am Trans"], "issn": "1548-0992", "url": "https://www.ewh.ieee.org/reg/9/etrans/", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=9907", "http://ieeexplore.ieee.org/servlet/opac?punumber=9907"]}, "title": "Big Data Architectures for the Climate Change Analysis: A Systematic Mapping Study", "abstract": "Despite the volume of data generated, scientists cannot accurately predict how climate change will manifest itself locally and what measures should be applied to mitigate it effectively. On the other hand, Big Data is a new technology that faces the challenge of collecting, characterizing and analyzing a large amount of data, taking into account data from multiple sources, multiple variables and multiple scales with different spatial and temporal attributes. To do this, we review and synthesize the current state of research of Big Data architectures that help solve the problems caused by climate change in health (16%), agriculture(8%), biodiversity(16%), energy(8%), water resources(4%) and clima(48%). To achieve the objective, we have carried out a systematic mapping study, which includes four research questions, including 25 studies, published from 2013 to 2019. The architectures found have been classified according to their use, which can be for statistical analysis, monitoring and simulations; helping researchers to integrate knowledge into the practical use of Big Data in the context of climate change.", "venue": "IEEE Latin America Transactions", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2020-10-01", "journal": {"name": "IEEE Latin America Transactions", "pages": "1793-1806", "volume": "18"}, "authors": [{"authorId": "10677584", "name": "Ania Cravero"}, {"authorId": "2754341", "name": "S. Sepúlveda"}, {"authorId": "145371043", "name": "Lilia Muñoz"}], "citations": [{"paperId": "950785224d96bcbeb1b0e12fb870357ae1b02b06", "title": "RENOVATION OF MULTI-APARTMENT RESIDENTIAL BUILDINGS IN LATVIA"}]}
