{"paperId": "b1cadf4f8249ad5c9a34ff8d55ec50ce7fdad72e", "publicationVenue": {"id": "6be078fe-e448-4123-8096-25493e7a2502", "name": "ARES", "type": "conference", "alternate_names": ["Availability, Reliability and Security", "Availab Reliab Secur", "International Conference on Availability, Reliability and Security", "Int Conf Availab Reliab Secur"], "issn": "2554-2656", "url": "https://ares.hypotheses.org/", "alternate_urls": ["http://www.ares-conference.eu/"]}, "title": "Secure Matrix Multiplication with MapReduce", "abstract": "The MapReduce programming paradigm allows to process big data sets in parallel on a large cluster of commodity machines. The MapReduce users often outsource their data and computations to a public cloud provider. We focus on the fundamental problem of matrix multiplication, and address the inherent security and privacy concerns that occur when outsourcing to a public cloud. Our goal is to enhance the two state-of-the-art algorithms for MapReduce matrix multiplication with privacy guarantees such as: none of the nodes storing an input matrix can learn the other input matrix or the output matrix, and moreover, none of the nodes computing an intermediate result can learn the input or the output matrices. To achieve our goal, we rely on the well-known Paillier's cryptosystem and we use its partially homomorphic property to develop efficient algorithms that satisfy our problem statement. We develop two different approaches called Secure-Private (SP) and Collision-Resistant-Secure-Private (CRSP), and compare their trade-offs with respect to three fundamental criteria: computation cost, communication cost, and privacy guarantees. Finally, we give security proofs of our protocols.", "venue": "ARES", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2017-08-29", "journal": {"name": "Proceedings of the 12th International Conference on Availability, Reliability and Security"}, "authors": [{"authorId": "3399390", "name": "Xavier Bultel"}, {"authorId": "1850588", "name": "Radu Ciucanu"}, {"authorId": "153528762", "name": "Matthieu Giraud"}, {"authorId": "3438430", "name": "P. Lafourcade"}], "citations": [{"paperId": "e738423b1108972ef17276a8f2b206af148646fa", "title": "Efficient verification of parallel matrix multiplication in public cloud: the MapReduce case"}, {"paperId": "0b6774dcc108a5464a177c856c168bf612972138", "title": "Uplink Cost Adjustable Schemes in Secure Distributed Matrix Multiplication"}, {"paperId": "81b4328273f3468c9fdf3ff24159a072efb6bc9a", "title": "Uplink-Downlink Tradeoff in Secure Distributed Matrix Multiplication"}, {"paperId": "887e9d2f338b13d657e409d20bdb838b1c2b7ba2", "title": "Cross Subspace Alignment Codes for Coded Distributed Batch Matrix Multiplication"}, {"paperId": "5241c046b7cc86fe87b1365dd223fecceda5c6de", "title": "Secure Distributed MapReduce Protocols: How to have privacy-preserving cloud applications? (Protocoles distribués et sécurisés pour le paradigme MapReduce: Comment avoir des applications dans les nuages respectueuses de la vie privée ?)"}, {"paperId": "28018686d081897aebb21ab2918869d89cec2e4b", "title": "Secure Strassen-Winograd Matrix Multiplication with MapReduce"}, {"paperId": "273903cd8aec4fcaa792e4d5a4cc7ea0641239b6", "title": "Secure and Efficient Matrix Multiplication with MapReduce"}, {"paperId": "d9720b3a04dda7276300065d7e1bba2ce23f4a08", "title": "The Need for Alignment in Rate-Efficient Distributed Two-Sided Secure Matrix Computation"}, {"paperId": "6e2af901afe9f21644732c1db1f221323ecc46f5", "title": "On the Capacity and Straggler-Robustness of Distributed Secure Matrix Multiplication"}, {"paperId": "d03cb27b4bc5f6db83840d34b59c55ae2f826ec4", "title": "Secure Joins with MapReduce"}, {"paperId": "08e21de9e8a83ca182e763ff1bc4347b502ea7b3", "title": "Rate-Efficiency and Straggler-Robustness through Partition in Distributed Two-Sided Secure Matrix Computation"}, {"paperId": "5ef669af26dc1203c828078a72b6fdcc03a52750", "title": "Secure Grouping and Aggregation with MapReduce"}, {"paperId": "d75b98ecc8fc30f0566853586186907a84761e87", "title": "On the Capacity of Secure Distributed Matrix Multiplication"}, {"paperId": "9bfa61ed55deaa15e64b9f06bddb404690c8e742", "title": "E-Business and Telecommunications: 16th International Conference, ICETE 2019, Prague, Czech Republic, July 26–28, 2019, Revised Selected Papers"}]}
