{"paperId": "b1d8c868e1d6d4980ee2f8c50e6fc5e4e7027ca2", "publicationVenue": {"id": "6a470734-72c6-4809-a07d-d34dee0df4a1", "name": "SIGDIAL Conferences", "type": "conference", "alternate_names": ["SIGDIAL", "SIGDIAL Conf", "Annu Meet Spéc Interest Group Discourse Dialogue", "Annual Meeting of the Special Interest Group on Discourse and Dialogue"]}, "title": "Telling Stories through Multi-User Dialogue by Modeling Character Relations", "abstract": "This paper explores character-driven story continuation, in which the story emerges through characters’ first- and second-person narration as well as dialogue—requiring models to select language that is consistent with a character’s persona and their relationships with other characters while following and advancing the story. We hypothesize that a multi-task model that trains on character dialogue plus character relationship information improves transformer-based story continuation. To this end, we extend the Critical Role Dungeons and Dragons Dataset (Rameshkumar and Bailey, 2020)—consisting of dialogue transcripts of people collaboratively telling a story while playing the role-playing game Dungeons and Dragons—with automatically extracted relationships between each pair of interacting characters as well as their personas. A series of ablations lend evidence to our hypothesis, showing that our multi-task model using character relationships improves story continuation accuracy over strong baselines.", "venue": "SIGDIAL Conferences", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-05-31", "journal": {"name": "ArXiv", "volume": "abs/2105.15054"}, "authors": [{"authorId": "152258340", "name": "Waiman Si"}, {"authorId": "19179135", "name": "Prithviraj Ammanabrolu"}, {"authorId": "2757194", "name": "Mark O. Riedl"}], "citations": [{"paperId": "789c5dd71fb6085161931955339de2172539cdc8", "title": "Neeko: Leveraging Dynamic LoRA for Efficient Multi-Character Role-Playing Agent"}, {"paperId": "f182770276fb2b4212084be1324d8b18ae89bc8c", "title": "AntEval: Evaluation of Social Interaction Competencies in LLM-Driven Agents"}, {"paperId": "4dcbc14301d048545cd83ca4fd57f110fc995c48", "title": "Tachikuma: Understading Complex Interactions with Multi-Character and Novel Objects by Large Language Models"}, {"paperId": "6e0a9d9934a7c4385e8ab5b69c64186446351462", "title": "FIREBALL: A Dataset of Dungeons and Dragons Actual-Play with Structured Game State Information"}, {"paperId": "895efbee8fe665460c72c97737e34e0b822e39fb", "title": "Personalized Quest and Dialogue Generation in Role-Playing Games: A Knowledge Graph- and Language Model-based Approach"}, {"paperId": "76f54657eb0893a0b203da57dcf0b4fffeebfc2c", "title": "CoRRPUS: Code-based Structured Prompting for Neurosymbolic Story Understanding"}, {"paperId": "cfed20d73f727fc0ab78fd51ca9c33d9623ed304", "title": "I Cast Detect Thoughts: Learning to Converse and Guide with Intents and Theory-of-Mind in Dungeons and Dragons"}, {"paperId": "68f1b94bbc900d2b5c60192a7e9eea4b046dd18a", "title": "Ontologically Faithful Generation of Non-Player Character Dialogues"}, {"paperId": "684e0925aa11628a165a6faf2095e45447258769", "title": "Towards Inter-character Relationship-driven Story Generation"}, {"paperId": "0e1ae0bdcc8469db99a4f8008288e20f285f1c6d", "title": "Robust Preference Learning for Storytelling via Contrastive Reinforcement Learning"}, {"paperId": "f9b16559282e5bea0bb072f9e260a4f0af697f4a", "title": "Co-Writing Screenplays and Theatre Scripts with Language Models: Evaluation by Industry Professionals"}, {"paperId": "f48eddd478f317f117bf45ab8b1852d86b5f3e0e", "title": "C O RRPUS: Codex-Leveraged Structured Representations for Neurosymbolic Story Understanding"}, {"paperId": "9b93ebd7ff4d995ad92902096f6c55d9451c2239", "title": "An AI Dungeon Master's Guide: Learning to Converse and Guide with Intents and Theory-of-Mind in Dungeons and Dragons"}, {"paperId": "4bea09d4c897fb201c032b9eb605a943b1e70435", "title": "CORRPUS: Detecting Story Inconsistencies via Codex-Bootstrapped Neurosymbolic Reasoning"}]}
