{"paperId": "b1e161c1c788014ed68970b4865c6c18d2b78ca5", "publicationVenue": null, "title": "Effective Integration of Geotagged, Ancilliary Longitudinal Survey Datasets to Improve Adulthood Obesity Predictive Models", "abstract": "Obesity is a critical health issue world-wide and has been identified as a leading cause of chronic diseases such as cardiovascular disease, type-2 diabetes, stroke and certain types of cancer. In 2014, 1.9 billion adults were overweight and 600 million were obese. In this study, to facilitate early detection of childhood obesity, we present our methodology for effective data integration that allows modelers to import new attributes from auxiliary datasets using geospatial proximity, alongside the associated data uncertainty for each data point that is caused by the data aggregation process while estimating that attribute. We have used the data uncertainty estimate as input to various machine learning algorithms, to improve on the obesity prediction. As a case study, we have integrated the National Longitudinal Survey of Youth 1997 dataset with the US Census 2000 dataset and the 2000 CDC Growth Charts dataset to augment our prediction model with behavioral and environmental features. Compared to models with only biometric attributes, our empirical experiments show accuracy improvements when we incrementally consider behavioral aspects (8.9~10.2%), environmental aspects (12.1~12.3%) and data uncertainty estimates (18.3~25.6%).", "venue": "2018 17th IEEE International Conference On Trust, Security And Privacy In Computing And Communications/ 12th IEEE International Conference On Big Data Science And Engineering (TrustCom/BigDataSE)", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference", "Review"], "publicationDate": "2018-08-01", "journal": {"name": "2018 17th IEEE International Conference On Trust, Security And Privacy In Computing And Communications/ 12th IEEE International Conference On Big Data Science And Engineering (TrustCom/BigDataSE)", "pages": "1738-1746"}, "authors": [{"authorId": "50298753", "name": "Saptashwa Mitra"}, {"authorId": "2114968512", "name": "Yu Qiu"}, {"authorId": "81171426", "name": "Haley Moss"}, {"authorId": "4190216", "name": "Kaigang Li"}, {"authorId": "145069202", "name": "S. Pallickara"}], "citations": [{"paperId": "bd1a795f93b203e2c8b8c5c5a08a790c7875445b", "title": "ARGUS: Rapid Wildfire Tracking Using Satellite Data Collections"}, {"paperId": "34394756bce85939214c2d695f077effc1459532", "title": "Patient-Generated Data Analytics of Health Behaviors of People Living With Type 2 Diabetes: Scoping Review"}, {"paperId": "5dd1f9d96e1b5db53fde3c8b960cda034fca3062", "title": "Patient-generated data analytics of health behaviours of people living with T2D: A Scoping Review."}, {"paperId": "12bc6425a9c7b30855ce285400daf03ef1299d44", "title": "An Enhanced Decision Tree Ensemble Technique For Obesity Prediction"}, {"paperId": "87774347413df332e80efaed262929efa26ee6ae", "title": "Confluence: Adaptive Spatiotemporal Data Integration Using Distributed Query Relaxation over Heterogeneous Observational Datasets"}]}
