{"paperId": "b1f36c4566b796ff425b44472b1fd7a9d3947f7d", "publicationVenue": {"id": "3d733e72-3b81-451a-afa3-881218de20ae", "name": "Expert Opinion on Biological Therapy", "type": "journal", "alternate_names": ["Expert Opin Biological Ther"], "issn": "1471-2598", "url": "http://www.ashley-pub.com/loi/ebt", "alternate_urls": ["http://informahealthcare.com/journal/ebt", "http://www.tandfonline.com/action/journalInformation?show=aimsScope&journalCode=iebt20", "http://www.tandfonline.com/action/journalInformation?journalCode=iebt20&show=aimsScope", "https://www.tandfonline.com/toc/iebt20/current", "http://miranda.ashley-pub.com/vl=2623054/cl=18/nw=1/rpsv/journal/journal1_home.htm", "http://www.tandfonline.com/openurl?genre=journal&stitle=iebt20"]}, "title": "Use of real-world data to assess the effectiveness of ustekinumab in treating IBD patients: a retrospective linked database study in northwest London", "abstract": "ABSTRACT Background Data on the optimum positioning of biologics in the treatment of inflammatory bowel disease (IBD) are limited. Research design and methods This was a longitudinal retrospective study of linked health-care data from northwest London, UK, for adults who started ustekinumab for IBD from 1 April 20161 April 2016 to 1 April 20211 April 2021. We compared outcomes by line of therapy (1 vs. 2 or 3+) and age group (18‒59 years or ≥ 60 years). In an analysis of CD patients, we calculated risks of IBD-related hospitalization, IBD-related abdominal surgery, ustekinumab persistence, and switching by line of therapy. Results Of 163 patients screened, 149 were eligible. Age had no effect on outcomes. Elective all-cause hospital admissions were significantly higher when ustekinumab was used as second-line or third-line therapy compared with first-line treatment (p = 0.0048 and p = 0.001, respectively). In CD patients the numbers of hospital admissions were also higher with second-line or third-line therapy (p = 0.040 and p = 0.018, respectively). Use of ustekinumab as third-line therapy significantly increased the risk of IBD-related hospitalization (hazard ratio 2.5, 95% CI 1.1‒5.6, p = 0.029), IBD-related abdominal surgery (9.45, 1.2‒75.7, p = 0.03), and switching (14.6, 1.6‒131.0, p = 0.02). Drug persistence risks did not differ. Conclusions These findings support the use of ustekinumab as first-line therapy. Plain Language Summary Inflammatory bowel disease (IBD) refers to two long-term conditions, ulcerative colitis and Crohn’s disease. In both types, various areas in the digestive system (most often the intestines) become inflamed. Several treatments are available to control inflammation. However, there is no cure, not all drugs work in all patients and sometimes they lose effectiveness over time. Traditionally, treatments have been given in a set order, so for some patients it might take a long time to find a drug that works for them. Biologics are a group of drugs used to treat IBD. There are several different biologics and Ustekinumab is one of the relatively newly introduced ones. The effectiveness of Ustekinumab is established in clinical studies. A team of researchers in Northwest London, organized a project to assess the performance of Ustekinumab in real life. They used anonymous data from the health-care records of patients who had Crohn’s disease and had been given ustekinumab as a first, second, or third choice of drug. The study found that the earlier ustekinumab was used, the lower the rates were for disease-related hospital admissions and need for surgery and for having to change to another drug. These findings challenge the traditional order of drug prescribing and suggest that some patients could benefit from changing the drug sequence. More research into the field will allow better understanding of the optimum patient selection and allocation to different types of treatment.", "venue": "Expert Opinion on Biological Therapy", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-11-27", "journal": {"name": "Expert Opinion on Biological Therapy", "pages": "1317 - 1329", "volume": "23"}, "authors": [{"authorId": "2268384131", "name": "Nik Kamperidis"}, {"authorId": "2211844872", "name": "Moulesh Shah"}, {"authorId": "2268440981", "name": "Sophie Young"}, {"authorId": "50238827", "name": "E. Galimov"}, {"authorId": "2268383842", "name": "Shruti Sweeney"}, {"authorId": "5315742", "name": "N. Arebi"}], "citations": []}
