{"paperId": "b204979b34d20759530631883cbb2fd291d0e6f0", "publicationVenue": {"id": "6dc66c37-9e89-4095-af22-25677efd948d", "name": "International Journal of Web Information Systems", "type": "journal", "alternate_names": ["Int J Web Inf Syst"], "issn": "1744-0084", "url": "https://www.emerald.com/insight/publication/issn/1744-0084", "alternate_urls": ["http://www.troubador.co.uk/ijwis/"]}, "title": "Cost research of Internet of Things service architecture for random mobile users based on edge computing", "abstract": "\nPurpose\nIn order to solve the problem of how to reduce the service delay of edge computing, this paper proposes an edge cloud framework, which contains four groups under different locations between mobile edge nodes and users. A feasible cost scheme can be obtained by calculating the cost in different simulation groups. Furthermore, we give suggestions on how to deploy edge nodes at a reasonable cost for users effectively.\n\n\nDesign/methodology/approach\nThis paper is motivated by the IoT-Cloud framework; they are divided according to whether the nodes have templates required by users and the distance from users to distinguish various consumption levels and classify the testing result. Based on four different groups satisfying reasonable resource allocation, the cost was studied. The work focuses on the unpredictable movement within the test range. For assignment and scheduling of template tasks at each time slot, the Edge-Cloud scheme is proposed to reduce the cost.\n\n\nFindings\nAccording to the simulation results in this paper, the total cost of the four groups is lower when the closest node-set satisfies the user service directly. To improve the probability that the closest node-set can meet general requests of users and provide them with faster and more economical network services, increasing the number of edge nodes within the range of user activities is suggested.\n\n\nOriginality/value\nAn Edge-Cloud framework is constructed in four groups, and the conclusion of a feasible cost scheme came out.\n", "venue": "International Journal of Web Information Systems", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-07-08", "journal": {"name": "Int. J. Web Inf. Syst.", "pages": "217-235", "volume": "18"}, "authors": [{"authorId": "2116116361", "name": "Jianhua Liu"}, {"authorId": "28316200", "name": "Zibo Wu"}, {"authorId": "48211895", "name": "Jiajia Liu"}, {"authorId": "2113959891", "name": "Yao Zou"}], "citations": [{"paperId": "74327d0c5c899941ab5eed84dbd24442a30e3156", "title": "FedACQ: adaptive clustering quantization of model parameters in federated learning"}, {"paperId": "3d7c3ef3c426e1c015c4a0ab5369e205223e24eb", "title": "Healthcare Application of In-Shoe Motion Sensor for Older Adults: Frailty Assessment Using Foot Motion during Gait"}]}
