{"paperId": "b213d89e97c33775ea4e17fb1aed33e21b118724", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Access Control for IoT: A Survey of Existing Research, Dynamic Policies and Future Directions", "abstract": "Internet of Things (IoT) provides a wide range of services in domestic and industrial environments. Access control plays a crucial role in granting access rights to users and devices when an IoT device is connected to a network. However, many challenges exist in designing and implementing an ideal access control solution for the IoT due to the characteristics of the IoT including but not limited to the variety of the IoT devices, the resource constraints on the IoT devices, and the heterogeneous nature of the IoT. This paper conducts a comprehensive survey on access control in the IoT, including access control requirements, authorization architecture, access control models, access control policies, access control research challenges, and future directions. It identifies and summarizes key access control requirements in the IoT. The paper further evaluates the existing access control models to fulfill the access control requirements. Access control decisions are governed by access control policies. The existing approaches on dynamic policies’ specification are reviewed. The challenges faced by the existing solutions for policies’ specification are highlighted. Finally, the paper presents the research challenges and future directions of access control in the IoT. Due to the variety of IoT applications, there is no one-size-fits-all solution for access control in the IoT. Despite the challenges encountered in designing and implementing the access control in the IoT, it is desired to have an access control solution to meet all the identified requirements to secure the IoT.", "venue": "Italian National Conference on Sensors", "year": 2023, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2023-02-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "23"}, "authors": [{"authorId": "151079734", "name": "K. Ragothaman"}, {"authorId": "47905785", "name": "Y. Wang"}, {"authorId": "3407759", "name": "B. Rimal"}, {"authorId": "2204701026", "name": "Mark Lawrence"}], "citations": [{"paperId": "147a811d9a34c9265a71818de9bc0249fbcab9f4", "title": "Efficient Packet Handling Mechanism In MQTT During Emergency Message Dissemination In Internet of Vehicles"}, {"paperId": "0aaf30ea5bc3bbb4a13b399ad4756c77bb854c73", "title": "Assessment of the Effects of Access Control on Reducing Cybercrimes in the Selected Telecommunication Companies in Tanzania"}, {"paperId": "c6db291010635307943dc08497d7cb2227085209", "title": "Access control in Internet of Things: A survey"}, {"paperId": "9392f9f97dc16bf5c02e6aaafa8aa25538361086", "title": "Statement Recognition of Access Control Policies in IoT Networks"}, {"paperId": "fcc5e826394c02f687b0830d48641f3a9eddc084", "title": "A Survey on Industrial Internet of Things Security: Requirements, Attacks, AI-Based Solutions, and Edge Computing Opportunities"}, {"paperId": "a7042f376d97ad3af34be295275cd3b5fcb07633", "title": "ESCI-AKA: Enabling Secure Communication in an IoT-Enabled Smart Home Environment Using Authenticated Key Agreement Framework"}, {"paperId": "5a6cb7ead99d868a16224dc62de423cb847e1985", "title": "Unleashing the Power of IoT: A Comprehensive Review of IoT Applications and Future Prospects in Healthcare, Agriculture, Smart Homes, Smart Cities, and Industry 4.0"}, {"paperId": "a173eed71d7cc51d69be2cfdd8435fd9899318ed", "title": "Adopting IoT Solutions for the Functionality, Protection and Resilience of Critical Infrastructures"}, {"paperId": "c192b89e70f850c2a9eecdeed32fd246c1de6966", "title": "MARAS: Mutual Authentication and Role-Based Authorization Scheme for Lightweight Internet of Things Applications"}, {"paperId": "d6c2d06c8de345f2d56cc7e87ad94be041f4f4c3", "title": "An Access Control System Based on Blockchain with Zero-Knowledge Rollups in High-Traffic IoT Environments"}, {"paperId": "23fcd989a2b9116754c77824811c0525d9766e70", "title": "A Comprehensive Systematic Review of Access Control in IoT: Requirements, Technologies, and Evaluation Metrics"}, {"paperId": "3c5873281f5d3d869b4b9d7fc15588ce8b7e779d", "title": "Securing the Internet of Things in Artificial Intelligence Era: A Comprehensive Survey"}, {"paperId": "7993a65b42744a8db0e46cb9740d2e3e4e2839ba", "title": "SMART ENERGY EFFICIENT TECHNIQUES FOR IoT ENABLED WIRELESS NODE"}]}
