{"paperId": "b227c4da8f90a46cf3de28bf8c7dae43768a4a92", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "A Novel Method of Multitype Hybrid Rock Lithology Classification Based on Convolutional Neural Networks", "abstract": "Rock lithology recognition plays a fundamental role in geological survey research, mineral resource exploration, mining engineering, etc. However, the objectivity of researchers, rock variable natures, and tedious experimental processes make it difficult to ensure the accurate and effective identification of rock lithology. Additionally, multitype hybrid rock lithology identification is challenging, and few studies on this issue are available. In this paper, a novel multitype hybrid rock lithology detection method was proposed based on convolutional neural network (CNN), and neural network model compression technology was adopted to guarantee the model inference efficiency. Four fundamental single class rock datasets: sandstone, shale, monzogranite, and tuff were collected. At the same time, multitype hybrid rock lithologies datasets were obtained based on data augmentation method. The proposed model was then trained on multitype hybrid rock lithologies datasets. Besides, for comparison purposes, the other three algorithms, were trained and evaluated. Experimental results revealed that our method exhibited the best performance in terms of precision, recall, and efficiency compared with the other three algorithms. Furthermore, the inference time of the proposed model is twice as fast as the other three methods. It only needs 11 milliseconds for single image detection, making it possible to be applied to the industry by transforming the algorithm to an embedded hardware device or Android platform.", "venue": "Italian National Conference on Sensors", "year": 2022, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-02-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "22"}, "authors": [{"authorId": "46598941", "name": "Diyuan Li"}, {"authorId": "2145804581", "name": "Junjie Zhao"}, {"authorId": "2117942045", "name": "Zida Liu"}], "citations": [{"paperId": "76d54571d55cdd2be44e3b8bbbba6224aaca3973", "title": "A semi-supervised coarse-to-fine approach with bayesian optimization for lithology identification"}, {"paperId": "672535f86982343534a5c587aead87a159e0a93d", "title": "Deep learning implementations in mining applications: a compact critical review"}, {"paperId": "3c657395fd9a793dd677a967df17f2b1e215f7a2", "title": "Quantitative Identification of Mesoscopic Failure Mechanism in Granite by Deep Learning Method Based on SEM Images"}, {"paperId": "23cf6f5b9cba47b84fa021dcebf49be0d0c97d8f", "title": "Rock Thin Section Image Identification Based on Convolutional Neural Networks of Adaptive and Second-Order Pooling Methods"}, {"paperId": "ae79aadef52230c567cfaffe2f9dc50b78b89fd4", "title": "Soft ground tunnel lithology classification using clustering-guided light gradient boosting machine"}, {"paperId": "b835bf8ad443ccd93397bb110c1d2ffa9fde216a", "title": "Cross-Well Lithology Identification Based on Wavelet Transform and Adversarial Learning"}, {"paperId": "54b736e6681a2afdbe69f95a8dcbb8125029c5ff", "title": "Channel attention-based static-dynamic graph convolutional network for lithology identification with scarce labels"}, {"paperId": "f2323fcefbec4d039584dd6131e7796d19d4785a", "title": "Experimental Studies on Rock Thin-Section Image Classification by Deep Learning-Based Approaches"}]}
