{"paperId": "b22ef4eb9d6fdb464def68b9b1cc589bbf3a54d4", "publicationVenue": {"id": "6175efe8-6f8e-4cbe-8cee-d154f4e78627", "name": "Mathematics", "issn": "2227-7390", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-283014", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-283014", "https://www.mdpi.com/journal/mathematics"]}, "title": "A Double-Layer Indemnity Enhancement Using LSTM and HASH Function Technique for Intrusion Detection System", "abstract": "The Intrusion Detection System (IDS) is the most widely used network security mechanism for distinguishing between normal and malicious traffic network activities. It aids network security in that it may identify unforeseen hazards in network traffic. Several techniques have been put forth by different researchers for network intrusion detection. However, because network attacks have increased dramatically, making it difficult to execute precise detection rates quickly, the demand for effectively recognizing network incursion is growing. This research proposed an improved solution that uses Long Short-Term Memory (LSTM) and hash functions to construct a revolutionary double-layer security solution for IoT Network Intrusion Detection. The presented framework utilizes standard and well-known real-time IDS datasets such as KDDCUP99 and UNSWNB-15. In the presented framework, the dataset was pre-processed, and it employed the Shuffle Shepherd Optimization (SSO) algorithm for tracking the most informative attributes from the filtered database. Further, the designed model used the LSTM algorithm for classifying the normal and malicious network traffic precisely. Finally, a secure hash function SHA3-256 was utilized for countering the attacks. The intensive experimental assessment of the presented approach with the conventional algorithms emphasized the efficiency of the proposed framework in terms of accuracy, precision, recall, etc. The analysis showed that the presented model attained attack prediction accuracy of 99.92% and 99.91% for KDDCUP99 and UNSWNB-15, respectively.", "venue": "Mathematics", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-13", "journal": {"name": "Mathematics"}, "authors": [{"authorId": "2237085886", "name": "Abdullah Marish Ali"}, {"authorId": "52014291", "name": "Fahad A. Alqurashi"}, {"authorId": "2871600", "name": "F. Alsolami"}, {"authorId": "2240852202", "name": "Sana Qaiyum"}], "citations": []}
