{"paperId": "b234155d2bc8833d889b05b6901eccbf248e8955", "publicationVenue": {"id": "6336131c-2f71-4f61-bc3b-1bf31ec9fa3d", "name": "International Conference on Computing for Sustainable Global Development", "type": "conference", "alternate_names": ["INDIACom", "Int Conf Comput Sustain Glob Dev"]}, "title": "A Game Theory based Attacker Defender Model for IDS in Cloud Security", "abstract": "Cloud security has become a serious challenge due to increasing number of attacks day-by-day. Intrusion Detection System (IDS) requires an efficient security model for improving security in the cloud. This paper proposes a game theory based model, named as Game Theory Cloud Security Deep Neural Network (GT-CSDNN) for security in cloud. The proposed model works with the Deep Neural Network (DNN) for classification of attack and normal data. The performance of the proposed model is evaluated with CICIDS-2018 dataset. The dataset is normalized and optimal points about normal and attack data are evaluated based on the Improved Whale Algorithm (IWA). The simulation results show that the proposed model exhibits improved performance as compared with existing techniques in terms of accuracy, precision, F-score, area under the curve, False Positive Rate (FPR) and detection rate.", "venue": "International Conference on Computing for Sustainable Global Development", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-03-23", "journal": {"name": "2022 9th International Conference on Computing for Sustainable Global Development (INDIACom)", "pages": "190-194"}, "authors": [{"authorId": "2110526799", "name": "Ashima Jain"}, {"authorId": "2747987", "name": "K. Tripathi"}, {"authorId": "1843002", "name": "A. Jatain"}, {"authorId": "144798303", "name": "M. Chaudhary"}], "citations": [{"paperId": "27fc826988849445a8d994bd71ca543f7d3a2982", "title": "Biometric Authentication-Based Intrusion Detection Using Artificial Intelligence Internet of Things in Smart City"}, {"paperId": "797b3a41abb582dd3e079b35361d2cb8db045619", "title": "Comparing Exploration Methods in Partially Observable Stochastic Games"}]}
