{"paperId": "b237f91191e91ed88aa1f0da5e1e63aad6cbcbb1", "publicationVenue": {"id": "1e64d4b5-d887-4d31-9151-44820eaa2c91", "name": "Journal of Engineering For Gas Turbines and Power", "type": "journal", "alternate_names": ["J Eng Gas Turbine Power"], "issn": "0742-4795", "url": "http://gasturbinespower.asmedigitalcollection.asme.org/", "alternate_urls": ["http://gasturbinespower.asmedigitalcollection.asme.org/journal.aspx?journalid=120"]}, "title": "Structured Methodology for Clustering Gas Turbine Transients by Means of Multivariate Time Series", "abstract": "\n At present, the challenges related to energy market force gas turbine owners to improve the reliability and availability of gas turbine engines, especially in the ever competitive Oil and Gas sector. Gas turbine trip leads to business interruption and also reduces equipment remaining useful life. Thus, the identification of symptoms of trips allows the prediction of their occurrence and avoids further damages and costs. Gas turbine transients are tracked by gas turbine operators while they occur, but a database including the complete details of past events for many fleets of engines is not always available. Therefore, a methodology aimed at classifying transients into clusters that identify the type of event (e.g., normal shutdown or trip) is required. Clustering is a data mining technique that addresses the scope of partitioning multivariate time series (MTS) into a given number of homogeneous and separated groups. Thus, the multivariate time series belonging to the same cluster are expected to be very similar to each other. This paper presents a structured methodology composed of a subsequent matching algorithm, a featured-based clustering approach exploiting the unsupervised fuzzy C-means algorithm and a procedure that assigns a label to each cluster for classification purposes. The methodology is applied to a real-word case-study that includes transients acquired from a fleet of Siemens gas turbines in operation during 3 years. The results obtained by using heterogeneous datasets including six measured variables allowed values of Precision, Recall and Accuracy higher than 90% in almost all cases.", "venue": "Journal of Engineering For Gas Turbines and Power", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-02-10", "journal": {"name": "Journal of Engineering for Gas Turbines and Power"}, "authors": [{"authorId": "1394636266", "name": "E. Losi"}, {"authorId": "41207044", "name": "M. Venturini"}, {"authorId": "101740473", "name": "L. Manservigi"}, {"authorId": "69396624", "name": "G. Ceschini"}, {"authorId": "9265471", "name": "G. Bechini"}, {"authorId": "2232336", "name": "Giuseppe Cota"}, {"authorId": "1782541", "name": "Fabrizio Riguzzi"}], "citations": [{"paperId": "3f58b88b773f78976934731f02fc30352d5ea9ef", "title": "Exploring Diverse Clustering Methods for Analyzing Gas Turbine Emissions"}, {"paperId": "fb565fb71fa96c85b15232a958284b34a1f9c425", "title": "Influence of the trigger time window on the detection of gas turbine trip"}]}
