{"paperId": "b2570b7721e62e1041109db4c59b5424c87f79f6", "publicationVenue": {"id": "ccd8e532-73c6-414f-bc91-271bbb2933e2", "name": "Electronics", "type": "journal", "issn": "1450-5843", "alternate_issns": ["2079-9292", "0883-4989"], "url": "http://www.electronics.etfbl.net/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-247562", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-247562", "https://www.mdpi.com/journal/electronics"]}, "title": "Ethereum Smart Contract Vulnerability Detection Model Based on Triplet Loss and BiLSTM", "abstract": "The wide application of Ethereum smart contracts in the Internet of Things, finance, medical, and other fields is associated with security challenges. Traditional detection methods detect vulnerabilities by stacking hard rules, which are associated with the bottleneck of a high false-positive rate and low detection efficiency. To make up for the shortcomings of traditional methods, existing deep learning methods improve model performance by combining multiple models, resulting in complex structures. From the perspective of optimizing the model feature space, this study proposes a vulnerability detection scheme for Ethereum smart contracts based on metric learning and a bidirectional long short-term memory (BiLSTM) network. First, the source code of the Ethereum contract is preprocessed, and the word vector representation is used to extract features. Secondly, the representation is combined with metric learning and the BiLSTM model to optimize the feature space and realize the cohesion of similar contracts and the discreteness of heterogeneous contracts, improving the detection accuracy. In addition, an attention mechanism is introduced to screen key vulnerability features to enhance detection observability. The proposed method was evaluated on a large-scale dataset containing four types of vulnerabilities: arithmetic vulnerabilities, re-entrancy vulnerabilities, unchecked calls, and inconsistent access controls. The results show that the proposed scheme exhibits excellent detection performance. The accuracy rates reached 88.31%, 93.25%, 91.85%, and 90.59%, respectively.", "venue": "Electronics", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-22", "journal": {"name": "Electronics"}, "authors": [{"authorId": "50469060", "name": "Mei Wang"}, {"authorId": "2218744242", "name": "Zheyu Xie"}, {"authorId": "2219063689", "name": "Xuefan Wen"}, {"authorId": "2218420529", "name": "Jianmin Li"}, {"authorId": "3213888", "name": "Kuanjiu Zhou"}], "citations": [{"paperId": "fbd030aceb977304a72c1cd0c740c1984e07afee", "title": "Vulnerability detection in Java source code using a quantum convolutional neural network with self-attentive pooling, deep sequence, and graph-based hybrid feature extraction"}, {"paperId": "76fecac5b9e884bc894cfa9f8af706ef315a423e", "title": "Financial Anti-Fraud Based on Dual-Channel Graph Attention Network"}, {"paperId": "a154e57850df3ea4f9c983e9fe9f4e51d7f03e42", "title": "VdaBSC: A Novel Vulnerability Detection Approach for Blockchain Smart Contract by Dynamic Analysis"}]}
