{"paperId": "b277ca62b946aeddc4672316111ec0b6f60867c8", "publicationVenue": {"id": "c6840156-ee10-4d78-8832-7f8909811576", "name": "IEEE Transactions on Knowledge and Data Engineering", "type": "journal", "alternate_names": ["IEEE Trans Knowl Data Eng"], "issn": "1041-4347", "url": "https://www.computer.org/web/tkde", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=69"]}, "title": "An Effective Clustering Optimization Method for Unsupervised Linear Discriminant Analysis", "abstract": "The recent work Unsupervised Linear Discriminant Analysis (Un-LDA) completes its clustering process during the alternating optimization by converting equivalently the objective and finally using the K-means algorithm. However, the K-means algorithm has its inherent drawbacks. It is hard for the K-means algorithm to deal well with some complex clustering cases where there are too many real clusters or non-convex clusters. In this paper, a novel clustering optimization method is presented to accomplish the clustering process in Un-LDA and the resulting method can be named Un-LDA(CD). Specifically, instead of the K-means algorithm, an elaborately designed coordinate descent algorithm is adopted to obtain the clusters after the objective function goes through a series of simple but deft equivalent conversions. Extensive experiments have demonstrated that the coordinate descent clustering solution for Un-LDA can outperform the original K-means based solution on the tested data sets especially those complex data sets with a pretty large number of real clusters.", "venue": "IEEE Transactions on Knowledge and Data Engineering", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-04-01", "journal": {"name": "IEEE Transactions on Knowledge and Data Engineering", "pages": "3444-3457", "volume": "35"}, "authors": [{"authorId": "2140026688", "name": "Quan Wang"}, {"authorId": "2148956094", "name": "Fei Wang"}, {"authorId": "2056627941", "name": "Fuji Ren"}, {"authorId": "7718686", "name": "Zhongheng Li"}, {"authorId": "144962210", "name": "F. Nie"}], "citations": [{"paperId": "b6ae5395849ee1c6615310cd6d46f02943011dbe", "title": "Outliers Robust Unsupervised Feature Selection for Structured Sparse Subspace"}, {"paperId": "e06576e8ca9dcd454ad9d8c8642e007e3da6de2b", "title": "Industrial Data-Driven Processing Framework Combining Process Knowledge for Improved Decision Making—Part 1: Framework Development"}]}
