{"paperId": "b27fa1e839da15ff0989e209c5ac1a73faac77c8", "publicationVenue": {"id": "fcbcaf18-8ab1-43e1-a973-604bbc7e344e", "name": "Proceedings of the VLDB Endowment", "type": "journal", "alternate_names": ["Proceedings of The Vldb Endowment", "Proc VLDB Endow", "Proc Vldb Endow"], "issn": "2150-8097", "url": "http://dl.acm.org/toc.cfm?id=J1174", "alternate_urls": ["http://portal.acm.org/toc.cfm?CFID=21632689&CFTOKEN=99329904&WantType=Affiliated%20Organizations&coll=ACM&dl=ACM&id=J1174&idx=J1174&part=affil&title=VLDB%20Endowment&type=periodical"]}, "title": "Endure: A Robust Tuning Paradigm for LSM Trees Under Workload Uncertainty", "abstract": "\n Log-Structured Merge trees (LSM trees) are increasingly used as the storage engines behind several data systems, frequently deployed in the cloud. Similar to other database architectures, LSM trees consider information about the\n expected\n workload (e.g., reads vs. writes, point vs. range queries) to optimize their performance via tuning. However, operating in a shared infrastructure like the cloud comes with workload\n uncertainty\n due to the fast-evolving nature of modern applications. Systems with static tuning discount the variability of such hybrid workloads and hence provide an inconsistent and overall suboptimal performance.\n \n \n To address this problem, we introduce Endure - a new paradigm for tuning LSM trees in the presence of workload uncertainty. Specifically, we focus on the impact of the choice of compaction policies, size ratio, and memory allocation on the overall performance. Endure considers a robust formulation of the throughput maximization problem and recommends a tuning that maximizes the worst-case throughput over the\n neighborhood\n of each expected workload. Additionally, an uncertainty tuning parameter controls the size of this neighborhood, thereby allowing the output tunings to be conservative or optimistic. Through both model-based and extensive experimental evaluations of Endure in the state-of-the-art LSM-based storage engine, RocksDB, we show that the robust tuning methodology consistently outperforms classical tuning strategies. The robust tunings output by Endure lead up to a 5X improvement in throughput in the presence of uncertainty. On the flip side, Endure tunings have negligible performance loss when the observed workload exactly matches the expected one.\n", "venue": "Proceedings of the VLDB Endowment", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-10-26", "journal": {"name": "Proc. VLDB Endow.", "pages": "1605-1618", "volume": "15"}, "authors": [{"authorId": "36947327", "name": "Andrew Huynh"}, {"authorId": "35615080", "name": "Harshal A. Chaudhari"}, {"authorId": "1839624", "name": "Evimaria Terzi"}, {"authorId": "1840402", "name": "Manos Athanassoulis"}], "citations": [{"paperId": "eaa4ad703e9451e4c20ec500f7f2a85f5b7d8af1", "title": "Towards Flexibility and Robustness of LSM Trees"}, {"paperId": "eb11ed9b8208d3f8fe6e5fc9e5ede4c4ec7ac2d4", "title": "Learning to Optimize LSM-trees: Towards A Reinforcement Learning based Key-Value Store for Dynamic Workloads"}, {"paperId": "49527bc5a3bb8a097bf84e15825f654497b73206", "title": "The LSM Design Space and its Read Optimizations"}, {"paperId": "a312b4f5d864bf160a99d8a7945ec19d3a63bdce", "title": "Dissecting, Designing, and Optimizing LSM-based Data Stores"}, {"paperId": "1d3cb6ec9add734e5b6ec9bee4681abc63d3009d", "title": "Towards ﬂexibility and robustness of LSM trees"}]}
