{"paperId": "b2892c2b3f9567b2c34192eafeab6c9aad1da024", "publicationVenue": {"id": "e4f51561-5050-4b9c-87c2-c49957677fbf", "name": "European Conference on Computer Systems", "type": "conference", "alternate_names": ["Eur Conf Comput Syst", "EuroSys"], "url": "http://www.eurosys.org/"}, "title": "REFL: Resource-Efficient Federated Learning", "abstract": "Federated Learning (FL) enables distributed training by learners using local data, thereby enhancing privacy and reducing communication. However, it presents numerous challenges relating to the heterogeneity of the data distribution, device capabilities, and participant availability as deployments scale, which can impact both model convergence and bias. Existing FL schemes use random participant selection to improve the fairness of the selection process; however, this can result in inefficient use of resources and lower quality training. In this work, we systematically address the question of resource efficiency in FL, showing the benefits of intelligent participant selection, and incorporation of updates from straggling participants. We demonstrate how these factors enable resource efficiency while also improving trained model quality.", "venue": "European Conference on Computer Systems", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2021-11-01", "journal": {"name": "Proceedings of the Eighteenth European Conference on Computer Systems"}, "authors": [{"authorId": "2575987", "name": "A. Abdelmoniem"}, {"authorId": "133659851", "name": "Atal Narayan Sahu"}, {"authorId": "1709876", "name": "Marco Canini"}, {"authorId": "3450002", "name": "Suhaib A. Fahmy"}], "citations": [{"paperId": "848298d6f698678a07a7e468f194678ed8ed6b5a", "title": "Not All Federated Learning Algorithms Are Created Equal: A Performance Evaluation Study"}, {"paperId": "282b1d9ad93b596a957cae5dfb7ef1a59bb59e65", "title": "Security Threats and Promising Solutions Arising from the Intersection of AI and IoT: A Study of IoMT and IoET Applications"}, {"paperId": "16c55662fc2e9c67092b81a9d47b34180a348034", "title": "Flashback: Understanding and Mitigating Forgetting in Federated Learning"}, {"paperId": "ed623a59768ebb3e6d82306f7821ec8ad3f30afc", "title": "FairQ: Fair and Fast Rate Allocation in Data Centers"}, {"paperId": "8a656f2c091429ffac4b045df3aa5e055c0a5886", "title": "An Empirical Study of Efficiency and Privacy of Federated Learning Algorithms"}, {"paperId": "c52f4c794cf49cdff08628a508985fb6dee8e4b9", "title": "DAGC: Data-Volume-Aware Adaptive Sparsification Gradient Compression for Distributed Machine Learning in Mobile Computing"}, {"paperId": "9b2af048169aca491d807b43bcf4a2fc188cf832", "title": "A Differential Privacy Approach for Privacy-Preserving Multi-Modal Stress Detection"}, {"paperId": "316c08301b69e9702f1346616215d1aeffb037ec", "title": "Energy Efficiency Optimized Federated Learning Algorithm in Wireless Networks"}, {"paperId": "919aa15f4ec9b5fb11caf475de79c4214324a7b1", "title": "A review on client selection models in federated learning"}, {"paperId": "985aaa9a8db1ad7c6189cdffc7af998c87e41400", "title": "Federated Learning in IoT: a Survey from a Resource-Constrained Perspective"}, {"paperId": "9d7da876852eb7b7127bc3ece5169fcb6090095d", "title": "Leveraging The Edge-to-Cloud Continuum for Scalable Machine Learning on Decentralized Data"}, {"paperId": "cdfbf55a5ea0c3602c957f4c183bbc475e85ac9f", "title": "FedZero: Leveraging Renewable Excess Energy in Federated Learning"}, {"paperId": "8f5eee0ab94a613cb30722e6573585e44cdd5aee", "title": "Green Federated Learning"}, {"paperId": "71dc2168da884f56de3eee2c9a07ab868a531d31", "title": "Federated Momentum Contrastive Clustering"}, {"paperId": "2ca7e36901022fde6f0477088267cb1fa36a1668", "title": "A2FL: Availability-Aware Federated Learning in Heterogeneous Environments"}]}
