{"paperId": "b28ba66261ddfda6ef10a016d4abb1100af773c3", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Leveraging Big Data Analytics for Enhanced Clinical Decision-Making in Healthcare", "abstract": "Recently, the rate of data generation has reached unprecedented levels, leading to a huge amount of data volume. In addition, modern-day computing systems generate data in diverse formats, ranging from unstructured to structured and semi-structured. As technological advancements experience exponential growth, novel trends, and strategies are emerging in the field of Big Data to enhance data quality and derive valuable insights, particularly in industries like healthcare. The primary objective of this study is to investigate the challenges and applications of Big Data in healthcare, with a specific focus on improving clinical decision-making. By analyzing 185 papers published between 2012 and 2023, this review article aims to provide a comprehensive overview of the techniques and methods employed in utilizing Big Data Analytics in the healthcare domain. Furthermore, the article aspires to assist the research community in identifying suitable approaches and methodologies for their healthcare-related studies.", "venue": "IEEE Access", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "127817-127836", "volume": "11"}, "authors": [{"authorId": "2266534805", "name": "Fatima Hussain"}, {"authorId": "2062760417", "name": "Muhammad Nauman"}, {"authorId": "2004866427", "name": "Abdullah Alghuried"}, {"authorId": "2247853218", "name": "Adi Alhudhaif"}, {"authorId": "2113868333", "name": "Nadeem Akhtar"}], "citations": []}
