{"paperId": "b28c05377b68f1b291b8555507ea67fa5b33bcb4", "publicationVenue": null, "title": "Continuous User Authentication Using Machine Learning and Multi-finger Mobile Touch Dynamics with a Novel Dataset", "abstract": "As technology grows and evolves rapidly, it is increasingly clear that mobile devices are more commonly used for sensitive matters than ever before. A need to authenticate users continuously is sought after as a single-factor or multi-factor authentication may only initially validate a user, which doesn't help if an impostor can bypass this initial validation. The field of touch dynamics emerges as a clear way to non-intrusively collect data about a user and their behaviors in order to develop and make imperative security-related decisions in real time. In this paper we present a novel dataset consisting of tracking 25 users playing two mobile games - Snake.io and Minecraft - each for 10 minutes, along with their relevant gesture data. From this data, we ran machine learning binary classifiers - namely Random Forest and K-Nearest Neighbor - to attempt to authenticate whether a sample of a particular user's actions were genuine. Our strongest model returned an average accuracy of roughly 93% for both games, showing touch dynamics can differentiate users effectively and is a feasible consideration for authentication schemes. Our dataset can be observed at https://github.com/zderidder/MC-Snake-Results", "venue": "2022 9th International Conference on Soft Computing & Machine Intelligence (ISCMI)", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-07-27", "journal": {"name": "2022 9th International Conference on Soft Computing & Machine Intelligence (ISCMI)", "pages": "42-46"}, "authors": [{"authorId": "2179323022", "name": "Zachary Deridder"}, {"authorId": "2133144059", "name": "Nyle Siddiqui"}, {"authorId": "2151793650", "name": "Thomas Reither"}, {"authorId": "51288952", "name": "Rushit Dave"}, {"authorId": "2179325751", "name": "Brendan Pelto"}, {"authorId": "1809915", "name": "Naeem Seliya"}, {"authorId": "117565513", "name": "Mounika Vanamala"}], "citations": [{"paperId": "54e0a5eba5fa59b83122229f6ea3d83faa594648", "title": "Your device may know you better than you know yourself - continuous authentication on novel dataset using machine learning"}, {"paperId": "e2f5cb9b91fe6eacde5f0c588c5349b4cf4d7e62", "title": "Secure Arcade: A Gamified Defense Against Cyber Attacks"}, {"paperId": "10cbd4727312b96d58cb614bdb9bd81b0b4f2e4c", "title": "Recent Advancements In The Field Of Deepfake Detection"}, {"paperId": "f431aa80c4d902860087ef76e4fbced1075b4dc4", "title": "Your Identity is Your Behavior - Continuous User Authentication based on Machine Learning and Touch Dynamics"}, {"paperId": "5dcdf512fba332065b2800eea772c5aa89bb73e4", "title": "Hybrid Deepfake Detection Utilizing MLP and LSTM"}, {"paperId": "b03479191a3f6e5223475487af6ff4e88113f2d8", "title": "Leveraging Deep Learning Approaches for Deepfake Detection: A Review"}, {"paperId": "f7662ad3dce1c3ef71d55af37fcd22f0e261e5e2", "title": "Machine Learning Based Approach to Recommend MITRE ATT&CK Framework for Software Requirements and Design Specifications"}, {"paperId": "6fee8174351e1c7338704a0635c721f638c61639", "title": "Analysis of Gait Motion Sensor Mobile Authentication with Machine Learning"}, {"paperId": "a68d3fb055b63cf98abc9ff0da91f61483dece94", "title": "Article Title: From Clicks to Security: Investigating Continuous Authentication via Mouse Dynamics"}]}
