{"paperId": "b28ead3a0ceaa45394b713fd1c8efb0c4d5eb857", "publicationVenue": {"id": "9d83259d-8d79-4e98-a9e5-6237469bc057", "name": "IEEE International Conference on Networking, Architecture and Storages", "type": "conference", "alternate_names": ["Netw Archit Storage", "IEEE Int Conf Netw Archit Storage", "NAS", "Networking, Architecture and Storages"]}, "title": "Exploiting Virtual Metadata Servers to Provide Multi-Level Consistency for Key-Value Object-Based Data Store", "abstract": "Distributed data store is a fundamental building block for various Internet services. For large-scale distributed data store, the scalability and consistency of metadata services are prone to be the bottleneck. Various schemes are proposed to tackle the challenge of scalability and consistency within metadata services. While centralized single-node metadata services with low scalability provide low- overhead consistency maintenance, distributed metadata servers with high scalability often suffer complicated management and high-overhead consistency maintenance. As some key-value object-based storage systems locate and access an object by hashing function (e.g., consistent hashing table), there are no dedicated physical servers for metadata services. For key-value store without dedicated metadata servers, we exploited a scheme called virtual metadata servers (virtual MDS), which can create an opportunity to provide high performance and multi- level consistency. While conventional key-value data store distributes metadata across data nodes, our scheme uses proxy nodes, where virtual disks created, as virtual MDS to hold the metadata of virtual disks. Meanwhile, we also combine the characteristic of virtual disks and metadata services to implement a multi-level consistency strategy for the key-value object-based store without dedicated physical metadata servers. With virtual MDS, we use version information to update data asynchronously and check the version consistency periodically, then correct the stale entries properly. In this way, our virtual MDS can provide multi-level of consistency to cope with different read performance demand from users. The experiment results demonstrate that our scheme with relaxed consistency can enhance random write performance by 50% and improve random read performance by 16% compared with the standard storage system with strict consistency.", "venue": "IEEE International Conference on Networking, Architecture and Storages", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2017-08-01", "journal": {"name": "2017 International Conference on Networking, Architecture, and Storage (NAS)", "pages": "1-6"}, "authors": [{"authorId": "14708599", "name": "Xiaozhao Zhuang"}, {"authorId": "2624637", "name": "Xiaoyang Qu"}, {"authorId": "2107136686", "name": "Z. Lu"}, {"authorId": "144768028", "name": "Ji-guang Wan"}, {"authorId": "2072948", "name": "C. Xie"}], "citations": [{"paperId": "f024ec97f9f2be9c842f8b5df56ae26dc778f80b", "title": "A Survey on Large Scale Metadata Server for Big Data Storage"}]}
