{"paperId": "b2924c7fa876a711107a6cc1f72966839c456896", "publicationVenue": {"id": "eae0113a-6db7-4cde-be91-d33a2eed1d57", "name": "Iranian journal of finance", "type": "journal", "alternate_names": ["Iran j finance"], "issn": "2676-6337", "url": "http://www.ijfifsa.ir/"}, "title": "A Comparative Approach to Financial Clustering Models: (A Study of the Companies Listed on Tehran Stock Exchange)", "abstract": "Data mining is known as one of the powerful tools in generating information and knowledge from raw data, and Clustering as one of the standard methods in data mining is a suitable method for grouping data in different clusters that helps to understand and analyze relationships. It is one of the essential issues in the field of investment, so by using stock market clustering, helpful information can be obtained to predict changes in stock prices of different companies and then on how to decide the correct number and shares in the portfolio to private investors and financial professionals' help. The purpose of this study is to cluster the companies listed on the Tehran stock exchange using three methods of K-means Clustering, Hierarchical clustering, and Affinity propagation clustering and compare these three methods with each other. To conduct this research, the adjusted price of 50 listed companies for the period 2019-07-01 to 2020-09-29 has been used. The evaluation results show that the obtained silhouette coefficient for K-means Clustering is higher and, therefore, better than other methods for stock exchange data. In the continuation of the research, calculating the co-integration of stock pairs that have the same co-movement with each other were identified, and finally, clusters were compiled using the t-SNE method.", "venue": "Iranian journal of finance", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-10-01", "journal": {"name": "Iranian Journal of Finance"}, "authors": [{"authorId": "2154065238", "name": "Marziyeh Nourahmadi"}, {"authorId": "2190925586", "name": "Fatemeh Rasti"}, {"authorId": "2140914333", "name": "H. Sadeqi"}], "citations": [{"paperId": "c1300347cbf83e51c9e7064577cf5f81c06eb76b", "title": "Drivers Affecting Bitcoin Adoption as a Payment Mechanism in the Tourism Industry"}]}
