{"paperId": "b29512476685931bb1d9b8447ed42033b958e184", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Zgli: A Pipeline for Clustering by Compression with Application to Patient Stratification in Spondyloarthritis", "abstract": "The normalized compression distance (NCD) is a similarity measure between a pair of finite objects based on compression. Clustering methods usually use distances (e.g., Euclidean distance, Manhattan distance) to measure the similarity between objects. The NCD is yet another distance with particular characteristics that can be used to build the starting distance matrix for methods such as hierarchical clustering or K-medoids. In this work, we propose Zgli, a novel Python module that enables the user to compute the NCD between files inside a given folder. Inspired by the CompLearn Linux command line tool, this module iterates on it by providing new text file compressors, a new compression-by-column option for tabular data, such as CSV files, and an encoder for small files made up of categorical data. Our results demonstrate that compression by column can yield better results than previous methods in the literature when clustering tabular data. Additionally, the categorical encoder shows that it can augment categorical data, allowing the use of the NCD for new data types. One of the advantages is that using this new feature does not require knowledge or context of the data. Furthermore, the fact that the new proposed module is written in Python, one of the most popular programming languages for machine learning, potentiates its use by developers to tackle problems with a new approach based on compression. This pipeline was tested in clinical data and proved a promising computational strategy by providing patient stratification via clusters aiding in precision medicine.", "venue": "Italian National Conference on Sensors", "year": 2023, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-01-20", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "23"}, "authors": [{"authorId": "46648088", "name": "Diogo Azevedo"}, {"authorId": "2178842620", "name": "A. M. Rodrigues"}, {"authorId": "2610418", "name": "H. Canhão"}, {"authorId": "2108535211", "name": "Alexandra M. Carvalho"}, {"authorId": "2202678670", "name": "André Souto"}], "citations": [{"paperId": "7108c066461eb2355a34f9d39a51c32895381b68", "title": "A Universal Non-Parametric Approach For Improved Molecular Sequence Analysis"}, {"paperId": "0ec10eb38a72f60cac856d3341227a1a6be4cd98", "title": "Quantum Kolmogorov complexity and quantum correlations in deterministic-control quantum Turing machines"}, {"paperId": "545c43a64179f8057d08934b147a76052dba8bcf", "title": "Comparing Clustering Methods Applied to Tinnitus within a Bootstrapped and Diagnostic-Driven Semi-Supervised Framework"}]}
