{"paperId": "b2991f7eea7f8f033f4fb96117f104716d45ed4e", "publicationVenue": {"id": "a13f3cb8-2492-4ccb-9329-73a5ddcaab9b", "name": "Neural Networks", "type": "journal", "alternate_names": ["Neural Netw"], "issn": "0893-6080", "url": "http://www.elsevier.com/locate/neunet", "alternate_urls": ["http://www.elsevier.com/wps/find/journaldescription.cws_home/841/description", "http://www.sciencedirect.com/science/journal/08936080"]}, "title": "Preserving Specificity in Federated Graph Learning for fMRI-based Neurological Disorder Identification", "abstract": "Resting-state functional magnetic resonance imaging (rs-fMRI) offers a non-invasive approach to examining abnormal brain connectivity associated with brain disorders. Graph neural network (GNN) gains popularity in fMRI representation learning and brain disorder analysis with powerful graph representation capabilities. Training a general GNN often necessitates a large-scale dataset from multiple imaging centers/sites, but centralizing multi-site data generally faces inherent challenges related to data privacy, security, and storage burden. Federated Learning (FL) enables collaborative model training without centralized multi-site fMRI data. Unfortunately, previous FL approaches for fMRI analysis often ignore site-specificity, including demographic factors such as age, gender, and education level. To this end, we propose a specificity-aware federated graph learning (SFGL) framework for rs-fMRI analysis and automated brain disorder identification, with a server and multiple clients/sites for federated model aggregation and prediction. At each client, our model consists of a shared and a personalized branch, where parameters of the shared branch are sent to the server while those of the personalized branch remain local. This can facilitate knowledge sharing among sites and also helps preserve site specificity. In the shared branch, we employ a spatio-temporal attention graph isomorphism network to learn dynamic fMRI representations. In the personalized branch, we integrate vectorized demographic information (i.e., age, gender, and education years) and functional connectivity networks to preserve site-specific characteristics. Representations generated by the two branches are then fused for classification. Experimental results on two fMRI datasets with a total of 1218 subjects suggest that SFGL outperforms several state-of-the-art approaches.", "venue": "Neural Networks", "year": 2023, "fieldsOfStudy": ["Computer Science", "Biology", "Engineering", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-20", "journal": {"name": "Neural networks : the official journal of the International Neural Network Society", "pages": "\n          584-596\n        ", "volume": "169"}, "authors": [{"authorId": "2135718970", "name": "Junhao Zhang"}, {"authorId": "2135945234", "name": "Qianqian Wang"}, {"authorId": "2108388497", "name": "Xiaochuan Wang"}, {"authorId": "1697568", "name": "Lishan Qiao"}, {"authorId": "2128817641", "name": "Mingxia Liu"}], "citations": []}
