{"paperId": "b2a3510895d0fc1fe6b64a3a7a97483e38b80e46", "publicationVenue": {"id": "d286fdd0-3b6c-433c-afee-87228d8e9f93", "name": "IEEE Transactions on Dependable and Secure Computing", "type": "journal", "alternate_names": ["IEEE Trans Dependable Secur Comput"], "issn": "1545-5971", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=8858"}, "title": "ACA: Anonymous, Confidential and Auditable Transaction Systems for Blockchain", "abstract": "The rapid development and wide application of blockchain not only highlight the significance of privacy protection (including anonymity and confidentiality) but also the necessity of auditability. While several ingenious schemes such as MiniLedger and traceable Monero supporting both privacy protection and auditability have been proposed, they either provide incomplete privacy protection (only achieving anonymity within a small set or only providing confidentiality but not anonymity), or involve additional auditing conditions such as reaching threshold transaction volume or requiring permissioned nodes to serve as the manager, or restrict to specific blockchain types such as Monero. To mitigate these issues, this article proposes a generic anonymous, confidential, and auditable transaction system (named ACA), which is compatible with both UTXO-based permissionless and permissioned blockchains. Core technologies of ACA include designed traceable anonymous key generation and publicly verifiable authorization mechanisms from existing cryptographic tools (i.e., public key encryption, partially homomorphic encryption, and accumulator) as well as the meticulous designed signatures of knowledge and smart contract. To demonstrate the entity of our proposal, we first prove its security including authenticity, anonymity, confidentiality and soundness, and then provide an instantiation to evaluate its performance. The final implementation and benchmarks show that our proposal can still gain performance advantage even adding more functionalities.", "venue": "IEEE Transactions on Dependable and Secure Computing", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-11-01", "journal": {"name": "IEEE Transactions on Dependable and Secure Computing", "pages": "4536-4550", "volume": "20"}, "authors": [{"authorId": "2116719925", "name": "Chao Lin"}, {"authorId": "2152665272", "name": "Xinyi Huang"}, {"authorId": "2977540", "name": "Jianting Ning"}, {"authorId": "37960293", "name": "De-biao He"}], "citations": []}
