{"paperId": "b2a7df60f8fbe3fb5a6ac7cc43568e769db1e6af", "publicationVenue": {"id": "9385f7e3-862a-46f2-bdaf-b9679c6d3af7", "name": "International Computer Engineering Conference", "type": "conference", "alternate_names": ["ICENCO", "Int Comput Eng Conf"]}, "title": "A New Automated Big Data Partitioning Approach to Improve Condensation Methods Performance", "abstract": "The enormous amount of structured and unstructured data produced in many fields leads to the era of big data. These data make the existing mining algorithms ineffective to process it. Therefore, the data reduction techniques are principally utilized prior to applying data mining algorithms. The instance selection is one of the promising reduction techniques advocated to reduce the size-volume of training dataset via selecting most relevant instances. However, the traditional instance selection methods suffer from the scalability of data, due to memory limitations. Recent approaches proposed to partition the training dataset into subsets and apply instance selection methods to individual subsets. Most of these approaches are based on a random partitioning, which negatively affects the performance of the instance selection methods, especially for a high number of subsets. In this work, we propose a new partitioning approach called automated overlapped distance-based partitioning. Our approach assigns the instances to the subsets regarding the distance. The instances can be assigned to two subsets based on a defined threshold. We implement and test experimentally the proposed approach using six standard datasets and the CNN method, a standard instance-selection condensation method. The results demonstrate that our approach is better than current random approaches in terms of the reduction rate and effectiveness criteria. Moreover, our approach is able to maintain a high reduction rate and effectiveness results when the numbers of subsets is increasing.", "venue": "International Computer Engineering Conference", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2018-12-01", "journal": {"name": "2018 14th International Computer Engineering Conference (ICENCO)", "pages": "90-95"}, "authors": [{"authorId": "3074992", "name": "M. Malhat"}, {"authorId": "1396417227", "name": "M. El-Menshawy"}, {"authorId": "2417313", "name": "Hamdy M. Mousa"}, {"authorId": "3376828", "name": "A. El-Sisi"}], "citations": []}
