{"paperId": "b2bdd6ec5f9d7e714df8b04bde1e63b937aca0aa", "publicationVenue": null, "title": "The Concept, Project and Current Status of Virtual Power Plant: A Review", "abstract": "Due to technological advancements in recent years, distributed energy resources (DER) applications have become more prevalent in households and businesses, including various renewable energy applications. While the virtual power plant (VPP) can integrate energy storage, flexible loads and DER, etc., it can support the power grid operating stability and security. Therefore, more and more researchers give their attention to VPP and advise on their optimization. This paper states the VPP concept from other researchers’ studies and provides a detailed explanation. Meanwhile, some typical VPP projects worldwide are also presented. In addition, some potential challenges and future development advice in the VPP studies are also presented.", "venue": "Journal of Physics: Conference Series", "year": 2022, "fieldsOfStudy": ["Physics"], "publicationTypes": ["Conference", "Review"], "publicationDate": "2022-01-01", "journal": {"name": "Journal of Physics: Conference Series", "volume": "2152"}, "authors": [{"authorId": "2154485583", "name": "Jiatong Zhang"}], "citations": [{"paperId": "b2b3a1b8675a964cff40dc060ea5720e696a2e58", "title": "Internal electricity price formulation strategy and energy optimal scheduling of virtual power plant"}, {"paperId": "71ea822f5bfbc046c91791b8fbdb050623d896ad", "title": "Virtual power plant challenges, opportunities and targets analysis in the current electricity markets"}, {"paperId": "ba244ab27f8441864ecbc7cbeeb8980874189b10", "title": "Dynamic grid stability in low carbon power systems with minimum inertia"}, {"paperId": "2c7132a5dd8c203e2ca91e7488f27bba598b9c19", "title": "Modeling, Optimization, and Analysis of a Virtual Power Plant Demand Response Mechanism for the Internal Electricity Market Considering the Uncertainty of Renewable Energy Sources"}, {"paperId": "53aad3fcc21c1669b2f1b9fef49617084634c500", "title": "Unlocking the value of flexibility of behind-the-meter prosumers: An overview of mechanisms to esteemed trends"}]}
