{"paperId": "b2c39ec09efe8ee00766c80415c591fc869df5a3", "publicationVenue": {"id": "02a4454a-84c8-471c-9b40-cc045d4f3223", "name": "Security and Communication Networks", "type": "journal", "alternate_names": ["Secur Commun Netw"], "issn": "1939-0122", "url": "https://www.hindawi.com/journals/scn/", "alternate_urls": ["http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1939-0122", "http://www.interscience.wiley.com/journal/security"]}, "title": "Privacy-Preserving Vertical Collaborative Logistic Regression without Trusted Third-Party Coordinator", "abstract": "Collaborative learning is an emerging distributed learning paradigm, which enables multiple parties to jointly train a shared machine learning (ML) model without causing the disclosure of the raw data of each party. As one of the fundamental collaborative learning algorithms, privacy-preserving collaborative logistic regression has recently gained attention from industry and academia, which utilizes cryptographic techniques to securely train joint logistic regression models across data from multiple parties. However, existing schemes have high communication and computational overhead, lose the ability to deal with high-dimensional sparse samples, cut down the accuracy of the model, or exist the risk of leaking private information. To overcome these issues, considering vertically distributed data, we propose a privacy-preserving vertical collaborative logistic regression (\n \n \n \n P\n \n \n 2\n \n \n \n VCLR) based on approximate homomorphic encryption (HE), which enables two parties to jointly train a shared model without a trusted third-party coordinator. Our scheme utilizes batching method in approximate HE to encrypt multiple data into a single ciphertext and enable a parallel processing through single instruction multiple data (SIMD) manner. We evaluate our scheme by using three publicly available datasets, the experimental results indicate that our scheme outperforms existing schemes in terms of training time and model performance.", "venue": "Security and Communication Networks", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-10-12", "journal": {"name": "Security and Communication Networks"}, "authors": [{"authorId": "47166320", "name": "Xiaopeng Yu"}, {"authorId": "2152968598", "name": "Wei Zhao"}, {"authorId": "2562333", "name": "Dianhua Tang"}, {"authorId": "144883069", "name": "Kai Liang"}], "citations": [{"paperId": "591bff66762380414ea3db63d589971e1b67ea6a", "title": "Quadratic Functional Encryption for Secure Training in Vertical Federated Learning"}, {"paperId": "a87af8ec4686bd8fb9594271c3348a8a6ba57aa9", "title": "A Survey on Vertical Federated Learning: From a Layered Perspective"}]}
