{"paperId": "b2c4b6732ee10d9574815249455e58b1100b19d5", "publicationVenue": {"id": "6508bf86-8489-4605-8607-5c0f16ad4060", "name": "Brazilian Symposium on Collaborative Systems", "type": "conference", "alternate_names": ["SBSC", "Braz Symp Collab Syst"]}, "title": "Uma abordagem para viabilizar experimentos in silico colaborativos", "abstract": "A ciência é uma atividade colaborativa por definição. A pesquisa científica é geralmente realizada por vários cientistas trabalhando juntos, e esse comportamento tem sido intensificado nas últimas décadas. Além disso, os experimentos são cada vez mais realizados in silico, o que exige ferramentas de suporte adequadas. Apesar de algumas abordagens tratarem da elaboração e análise de experimentos de forma colaborativa, elas exigem que os cientistas usem sistemas de gerência de workflow, ignorando o fato de muitos cientistas utilizarem scripts nas suas pesquisas. As ferramentas para execução de experimentos baseados em scripts normalmente apresentam suporte muito limitado a colaboração. Sendo assim, alguns cientistas acabam utilizando ferramentas de versionamento para colaborar nesse contexto. Apesar das ferramentas de versionamento tratarem diversos aspectos colaborativos da construção de scripts, elas são ferramentas voltadas para o desenvolvimento de software e estão preocupadas somente com a fase de composição do script, não tratando problemas específicos da pesquisa científica. Nesse trabalho apresentamos um projeto de pesquisa que visa a apoiar o cientista na condução de experimentos in silico baseados em script de forma colaborativa.", "venue": "Brazilian Symposium on Collaborative Systems", "year": 2019, "fieldsOfStudy": ["Biology"], "publicationTypes": null, "publicationDate": "2019-09-26", "journal": {"name": "Anais do XV Simpósio Brasileiro de Sistemas Colaborativos (SBSC 2019)"}, "authors": [{"authorId": "2082905567", "name": "Eduardo Jandre"}, {"authorId": "2079989208", "name": "Bruna Diirr"}, {"authorId": "2066230263", "name": "Vanessa Braganholo"}], "citations": []}
