{"paperId": "b2cec2959c5759d7d83c75dad81092656a96ea31", "publicationVenue": {"id": "c83872c8-8037-4ef1-8ced-abb2233a2886", "name": "IEEE Transactions on Green Communications and Networking", "alternate_names": ["IEEE Trans Green Commun Netw"], "issn": "2473-2400", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=7511293", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=7511293"]}, "title": "A Smart Road Side Unit in a Microeolic Box to Provide Edge Computing for Vehicular Applications", "abstract": "Deployment of technologies for Intelligent Transportation Systems (ITS) involves the installation of Road Side Units (RSU) on the roadway and On-Board Units (OBU) inside vehicles. In this direction, 5G technologies will make a great impulse providing low latency communication and computation at the edge of the network. First, this paper defines VMEC-in-a-Box, a smart RSU combined with a MEC station, aimed at providing edge computing for vehicular applications by enabling job offloading from vehicles. VMEC-in-a-Box is equipped with a microeolic power generator to be autonomous and self-consistent even in presence of low levels of wind. The behavior of VMEC-in-a-Box is controlled by artificial intelligence to vary its computing capacity dynamically to pursue the best tradeoff between performance and power consumption, and to cooperate by offloading jobs to each other (horizontal offload) to improve performance and reliability of the system. Hence, the paper defines a Markov model to support decisions to optimize by means of Reinforcement Learning the system behavior according to two reward functions defined at the MEC and at the Vehicular Domains. To the best of our knowledge, this is the first work proposing an integrated framework to maximize reliability and performance at both Vehicular and MEC Domains.", "venue": "IEEE Transactions on Green Communications and Networking", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-03-01", "journal": {"name": "IEEE Transactions on Green Communications and Networking", "pages": "194-210", "volume": "7"}, "authors": [{"authorId": "1879104178", "name": "Fabio Busacca"}, {"authorId": "32833683", "name": "Christian Grasso"}, {"authorId": "1681089", "name": "S. Palazzo"}, {"authorId": "1997810", "name": "G. Schembra"}], "citations": [{"paperId": "03826584df8338d0320e5709dce5c8f4d1298d6d", "title": "MANTRA: an Edge-Computing Framework based on Multi-Armed Bandit for Latency- and Energy-aware Job Offloading in Vehicular Networks"}, {"paperId": "d718c786e9dbaccc81a5526f4bf1795f6fc1f838", "title": "To improve the performance on disk load balancing in a cloud environment using improved Lion optimization with min-max algorithm"}, {"paperId": "18846bd8fb3de7ffaf986a85dd366764a2f21294", "title": "Traffic Flow Prediction Based on Dynamic Graph Spatial-Temporal Neural Network"}, {"paperId": "3ae9a3fc767226405e3e0ed5d294da487e9331c4", "title": "Intrusion Detection Method for Internet of Vehicles Based on Parallel Analysis of Spatio-Temporal Features"}, {"paperId": "048e0a0e6c3b3578a22d8910c7647d9b7797196f", "title": "Stability and energy consumption of a double flow controlled two-lane traffic system with vehicle-to-infrastructure communication"}, {"paperId": "0966b8f2b5ac6c20892795a53d91084247ff26ee", "title": "Integration and Field Evaluation of an IoV System for Enhancing Road Safety"}, {"paperId": "2277099d3c53e13a54603bfc00957957cfa17166", "title": "Identity-based Secure and Efficient Intelligent Inference Framework for IoT-Cloud System"}, {"paperId": "fa91758d10c04616dae4719c36fc52684857c924", "title": "Computer Vision Aided mmWave Beam Alignment in V2X Communications"}, {"paperId": "c333b193528fec2fbabd2ad558c22fc8adcbf25a", "title": "Decentralized Multi-Agent DQN-Based Resource Allocation for Heterogeneous Traffic in V2X Communications"}]}
