{"paperId": "b2d400daa90932bb0f3e5e206a474f3bd57b1b03", "publicationVenue": {"id": "255a371e-2a0c-42d1-b4e7-c3cf3e21c89a", "name": "International Conference on Advances in Social Networks Analysis and Mining", "type": "conference", "alternate_names": ["Advances in Social Networks Analysis and Mining", "Int Conf Adv Soc Netw Anal Min", "ASONAM", "Adv Soc Netw Anal Min"], "url": "http://www.wikicfp.com/cfp/program?id=239"}, "title": "Social Network Mining for Recommendation of Friends Based on Music Interests", "abstract": "With the rapid development of technology and software, social media have become a necessity in our daily lives as it is a way for people to keep in touch with friends and share about current events. Some of the most popular social media and social networking sites that people use include Facebook, Instagram, Snapchat, and Twitter. Finding compatible persons to be friends on social media can be a challenge as many of the people recommended to the user by social media are people who are already friends with them or have been followed. However, when users are looking for friends, the real concern is whether they have common interests or hobbies with each other and whether they often interact with one another. In this paper, we propose friend recommendation algorithms revolving around music interests and interactions in social media.", "venue": "International Conference on Advances in Social Networks Analysis and Mining", "year": 2018, "fieldsOfStudy": ["Computer Science", "Sociology"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2018-08-01", "journal": {"name": "2018 IEEE/ACM International Conference on Advances in Social Networks Analysis and Mining (ASONAM)", "pages": "833-840"}, "authors": [{"authorId": "51410514", "name": "C. Fan"}, {"authorId": "78712129", "name": "Huizi Hao"}, {"authorId": "1726081", "name": "C. Leung"}, {"authorId": "77649232", "name": "Leslie Yu Sun"}, {"authorId": "2066786969", "name": "Jennifer Tran"}], "citations": [{"paperId": "19bd9edb52d7046b57ed58930c3496477e4884a6", "title": "Personalized privacy-preserving semi-centralized recommendation system in a social network"}, {"paperId": "f6e98933b402830441a999ee3e280727ed9179c0", "title": "Social network mining and analytics for quantitative patterns"}, {"paperId": "016565286c2118e0611279ef0b2e5403be938eea", "title": "A Real-Time Application for Road Conditions Detection based on the Internet of Things"}, {"paperId": "86bf854df0a9a7cbb210eecc2d551fbe92bd09ae", "title": "Development of a web application to share hobbies activities"}, {"paperId": "c63c19105f93b3ef3d02d1fc614023b00fa23e45", "title": "A mathematical model for friend discovery from dynamic social graphs"}, {"paperId": "1abc6533b133dad18ceb335a838570804a2b6822", "title": "Compressing and mining social network data"}, {"paperId": "e0f308de3c489f3a9f3176862e9a7c2cb6d2a294", "title": "A Theoretical Approach for Discovery of Friends from Directed Social Graphs"}, {"paperId": "d5d07d27edd87031a17b750db3248893a43cd41f", "title": "Compression for Very Sparse Big Social Data"}, {"paperId": "d3edd5733dede8044de3f2e596b925eca4319eff", "title": "Big Data Science on COVID-19 Data"}, {"paperId": "b0da5615d16b22564619d31f7e34cde2892647c1", "title": "Identifying the Right Person in Social Networks with Double Metaphone Codes"}, {"paperId": "5fec0c4df897eb6bae41618fc4badca2e79e6316", "title": "Explainable Machine Learning and Mining of Influential Patterns from Sparse Web"}, {"paperId": "c6954e33a2e85b2a743bb44f1afbed91787c2374", "title": "Understanding Professional Fashion Stylists’ Outfit Recommendation Process: A Qualitative Study"}, {"paperId": "b8167ee2f7df530d42defc5e5177978f767460be", "title": "Keeping up with the Influencers: Improving User Recommendation in Instagram using Visual Content"}, {"paperId": "e26c742d65dfcaa59c912b19406c9a39629b2972", "title": "Cognitive-Based Hybrid Collaborative Filtering with Rating Scaling on Entropy to Defend Shilling Influence"}, {"paperId": "8d2264781853259725f1be26441dc043723a180f", "title": "A Theoretical Approach to Discover Mutual Friendships from Social Graph Networks"}, {"paperId": "4ca7b9985fef2562200a4a7f2b3b7b1b0d7c139a", "title": "Big Data Analytics for Personalized Recommendation Systems"}, {"paperId": "1eaa5f38e94baf9621dd48dee04a5b40e0858c92", "title": "WeFreS: weighted frequent subgraph mining in a single large graph"}, {"paperId": "e7f7e5f9a31c301b42431b776902e95a9b76d5e7", "title": "Big Data Computing and Mining in a Smart World"}]}
