{"paperId": "b2d938e4d9aa7ad7caae82069139209e600f47f2", "publicationVenue": {"id": "fcbcaf18-8ab1-43e1-a973-604bbc7e344e", "name": "Proceedings of the VLDB Endowment", "type": "journal", "alternate_names": ["Proceedings of The Vldb Endowment", "Proc VLDB Endow", "Proc Vldb Endow"], "issn": "2150-8097", "url": "http://dl.acm.org/toc.cfm?id=J1174", "alternate_urls": ["http://portal.acm.org/toc.cfm?CFID=21632689&CFTOKEN=99329904&WantType=Affiliated%20Organizations&coll=ACM&dl=ACM&id=J1174&idx=J1174&part=affil&title=VLDB%20Endowment&type=periodical"]}, "title": "FACE: A Normalizing Flow based Cardinality Estimator", "abstract": "Cardinality estimation is one of the most important problems in query optimization. Recently, machine learning based techniques have been proposed to effectively estimate cardinality, which can be broadly classified into query-driven and data-driven approaches. Query-driven approaches learn a regression model from a query to its cardinality; while data-driven approaches learn a distribution of tuples, select some samples that satisfy a SQL query, and use the data distributions of these selected tuples to estimate the cardinality of the SQL query. As query-driven methods rely on training queries, the estimation quality is not reliable when there are no high-quality training queries; while data-driven methods have no such limitation and have high adaptivity.\n \n In this work, we focus on data-driven methods. A good data-driven model should achieve three optimization goals. First, the model needs to capture data dependencies between columns and support large domain sizes (achieving high accuracy). Second, the model should achieve high inference efficiency, because many data samples are needed to estimate the cardinality (achieving low inference latency). Third, the model should not be too large (achieving a small model size). However, existing data-driven methods cannot simultaneously optimize the three goals. To address the limitations, we propose a novel cardinality estimator FACE, which leverages the Normalizing Flow based model to learn a continuous joint distribution for relational data. FACE can transform a complex distribution over continuous random variables into a simple distribution (e.g., multivariate normal distribution), and use the probability density to estimate the cardinality. First, we design a dequantization method to make data more \"continuous\". Second, we propose encoding and indexing techniques to handle Like predicates for string data. Third, we propose a Monte Carlo method to efficiently estimate the cardinality. Experimental results show that our method significantly outperforms existing approaches in terms of\n estimation accuracy\n while keeping similar\n latency\n and\n model size.\n", "venue": "Proceedings of the VLDB Endowment", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-09-01", "journal": {"name": "Proc. VLDB Endow.", "pages": "72-84", "volume": "15"}, "authors": [{"authorId": "2155125051", "name": "Jiayi Wang"}, {"authorId": "1720852203", "name": "Chengliang Chai"}, {"authorId": "46701092", "name": "Jiabin Liu"}, {"authorId": "47949377", "name": "Guoliang Li"}], "citations": [{"paperId": "bfb2b0b0d0621ea4de93fb960d45a4c5bbabcc38", "title": "ByteCard: Enhancing ByteDance's Data Warehouse with Learned Cardinality Estimation"}, {"paperId": "20aa90187af7dd6508fa32ab438ea243fee0f5fa", "title": "PACE: Poisoning Attacks on Learned Cardinality Estimation"}, {"paperId": "305612b49d1d43fa8fd70e0cc506d0ab51e8ba8f", "title": "ASM: Harmonizing Autoregressive Model, Sampling, and Multi-dimensional Statistics Merging for Cardinality Estimation"}, {"paperId": "4083701d9d2e3d051ba2ed7c85d3b00822b4c2f1", "title": "Deep convolutional multi-informative metric correlation analysis with bottleneck attention module for face recognition in the wild"}, {"paperId": "258bca67f4ab6d5474ffac4b25b72804c40b8014", "title": "Selectivity Estimation for Queries Containing Predicates over Set-Valued Attributes"}, {"paperId": "263b0924f50444bbd7cdf5374638695e3eb56156", "title": "Automatic Database Knob Tuning: A Survey"}, {"paperId": "b53e3a987571564332cd0a40da2a8eb164cadb7d", "title": "ALECE: An Attention-based Learned Cardinality Estimator for SPJ Queries on Dynamic Workloads (Extended)"}, {"paperId": "9fadd417192a0337a4f3362a7b58b76688c66517", "title": "Ensemble Masked Autoencoder and Gaussian Mixture Models for Cardinality Estimation"}, {"paperId": "8add1ac7b254b259c038db8027990d44390bd5b3", "title": "Cardinality estimation using normalizing flow"}, {"paperId": "de020c6853b7a0d6345043b4bb8b8f1760615e1c", "title": "FEBench: A Benchmark for Real-Time Relational Data Feature Extraction"}, {"paperId": "c8071c6336bc0dbb3fbe9025c9ff2bb6c5d66f13", "title": "Duet: efficient and scalable hybriD neUral rElation undersTanding"}, {"paperId": "43974d7753da1acf1f70ad2f8f184971d5bdc2be", "title": "SQL Synthesis with Input-Output Example Based on Deep Learning"}, {"paperId": "8f9b7312d04c4287b201105ec50ce306dacd0c37", "title": "$\\mathtt {AutoView}$: An Autonomous Materialized View Management System With Encoder-Reducer"}, {"paperId": "b4ac6825a237beb0febd2abb9047da31f5e7cdf7", "title": "BitE : Accelerating Learned Query Optimization in a Mixed-Workload Environment"}, {"paperId": "40ad1ed296074aa05e87dcb89fb8f0ae3876940b", "title": "CommunityAF: An Example-based Community Search Method via Autoregressive Flow"}, {"paperId": "81b9ebe4c6785351eafd0fc21d24851ce25f01ed", "title": "Efficient and Effective Cardinality Estimation for Skyline Family"}, {"paperId": "9a91890329b65d43d91b0d83399d68949bd85ad5", "title": "Speeding Up End-to-end Query Execution via Learning-based Progressive Cardinality Estimation"}, {"paperId": "ebe7b4b3931d9df634b0e9667ec7686e1eac9c94", "title": "Grep: A Graph Learning Based Database Partitioning System"}, {"paperId": "365813bf05b108d1e5dbe6a5117c35dabbdd57e9", "title": "A Better Cardinality Estimator with Fewer Bits, Constant Update Time, and Mergeability"}, {"paperId": "c07802ed8a25998e9bd44ee1ddbcc63b7eb34060", "title": "Data Management for Machine Learning: A Survey"}, {"paperId": "f9bb72f8c2d92452ac98b8b715dedcc5926396f0", "title": "LEON: A New Framework for ML-Aided Query Optimization"}, {"paperId": "9f7ba00450f463e98e7d2eea94e38de9acbe824b", "title": "BlinkViz: Fast and Scalable Approximate Visualization on Very Large Datasets using Neural-Enhanced Mixed Sum-Product Networks"}, {"paperId": "52f13a92ac7a522a6307166dc9aa38b2bf952a32", "title": "Learned Index: A Comprehensive Experimental Evaluation"}, {"paperId": "6c4939564ba3d47fd4e54ff6084128f21ddb8037", "title": "AutoCE: An Accurate and Efficient Model Advisor for Learned Cardinality Estimation"}, {"paperId": "ebe9bb496402ef0e0db84d55fc2348b2af335050", "title": "Learned sketch for subgraph counting: a holistic approach"}, {"paperId": "6d1814d08f240d0efde960e12d027b6bede3405d", "title": "FactorJoin: A New Cardinality Estimation Framework for Join Queries"}, {"paperId": "e89ab345ac30b6020dddc37fa5c5da5b4f590087", "title": "SafeBound: A Practical System for Generating Cardinality Bounds"}, {"paperId": "597b7a7b27928c940e1895b4b489d0993683a30d", "title": "Coresets over Multiple Tables for Feature-rich and Data-efficient Machine Learning"}, {"paperId": "d5aa0efc065ac3073404aebbcc3a2ca3eb63db4b", "title": "Cost-based or Learning-based? A Hybrid Query Optimizer for Query Plan Selection"}, {"paperId": "96cd0d31b6188cae63cab75cbdc67141f158b11e", "title": "Fine-Grained Modeling and Optimization for Intelligent Resource Management in Big Data Processing"}, {"paperId": "d53ef63ada540f20ebbf28aa47072e36c8faf024", "title": "LearnedSQLGen: Constraint-aware SQL Generation using Reinforcement Learning"}, {"paperId": "95a7e4b4d535a9c61a6f466a090a4004ef151b50", "title": "Machine Learning for Data Management: A System View"}, {"paperId": "324617847cc591e3fb11f15cdcdfbc9374021b51", "title": "RW-Tree: A Learned Workload-aware Framework for R-tree Construction"}, {"paperId": "49f04a0fadf6c6cf833555fe15fd3c32d6f46eae", "title": "AutoIndex: An Incremental Index Management System for Dynamic Workloads"}, {"paperId": "1da2a0e8dac5db009cfadb96aa544ced9b1e4580", "title": "Selective Data Acquisition in the Wild for Model Charging"}, {"paperId": "f12c83f4a759971649a5ebc7cdddb5cab89e29fc", "title": "ConvMADE: Convolution Makes Cardinality Estimation Stronger"}, {"paperId": "45976c13ecc25922acadcefa41c5da01459cd725", "title": "Dynamic Materialized View Management using Graph Neural Network"}, {"paperId": "c0438c78d222f40c03b54a559fe642919fe12b4d", "title": "M4: A Framework for Per-Flow Quantile Estimation"}]}
