{"paperId": "b2dfa4c0e8a80585f3da8ff487bf408323d9f2d3", "publicationVenue": null, "title": "A Dialogue Dataset Containing Emotional Support for People in Distress", "abstract": "—Many people suffer from emotional distress due to many reasons, such as signiﬁcant life change, ﬁnancial crisis, or various physical and mental health conditions. Inability to regulate emotion can potentially lead to self-destructive behavior such as substance abuse, self-harm, or suicide. Even though many helplines and therapeutic consultations are available to assist such people in distress, most people do not reach for help due to the public and personal stigma associated with mental health. Even therapeutic consultations are limited and are not available 24/7 to support people going through a traumatic episode. Therefore, it is important to assess the ability of AI-driven chatbots to help people deal with emotional distress. One of the signiﬁcant limitations in developing such a chatbot is the lack of a large, curated dialogue dataset containing emotional support. This work curates a dataset containing two million emotional dialogues from Reddit and analyzes it at the lexical, sentiment, and emotional level. In this paper, we outline the data selection and curation process and the important observations made related to sentiment and emotion in speaker and listener turns of the resulting dataset. This dataset is expected to help build future chatbots that could offer emotional support for people in distress.", "venue": "", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "2118331518", "name": "Chun-Hung Yeh"}, {"authorId": "2193464985", "name": "Supervisor"}, {"authorId": "2114569700", "name": "K. Welivita"}], "citations": [{"paperId": "f77c114553bc851aab4fff535570a9e83a18227e", "title": "Building Emotional Support Chatbots in the Era of LLMs"}, {"paperId": "b237be8e1f48ecaac72dd9ef32f8e2cfd3b9be77", "title": "Generate Reflections and Paraphrases out of Distress Stories in Mental Health Forums"}, {"paperId": "0b47ede01cbebfcc5b5ec8d8bd5c0a018cc93ca5", "title": "What Makes a Conversation Satisfying and Engaging? — An Analysis on Reddit Distress Dialogues"}]}
