{"paperId": "b2df7b289fc2b4738b7a0b46aa338e0248df8354", "publicationVenue": {"id": "911e7332-8ea8-4e9d-bc20-5572a2523f92", "name": "International Middleware Conference", "type": "conference", "alternate_names": ["Middleware", "ACM/IFIP/USENIX int conf Middlew", "ACM/IFIP/USENIX international conference on Middleware", "Int Middlew Conf"], "url": "https://dl.acm.org/conference/middleware/proceedings"}, "title": "Pravega: A Tiered Storage System for Data Streams", "abstract": "The growing popularity of the data stream abstraction entails new challenging requirements when it comes to data ingestion and storage. Many organizations expect to retain data streams for extended periods of time and to store such stream data in a cost-effective manner. It is also crucial to reconcile apparently opposite properties, like data durability and consistency, along with high performance. Furthermore, data streams should not only deal with a high degree of parallelism, but also adapt to fluctuating workloads with little or no admin intervention. To our knowledge, no storage system for data streams fully copes with all these requirements. In this paper, we present Pravega: a distributed, tiered storage system for data streams. Pravega streams are unbounded by design and cost-effective, as the system automatically moves data to a long-term storage tier (e.g., S3, NFS) and transparently manages it for the user. Pravega guarantees no duplicate or missing events, as well as per routing-key event ordering, while providing high performance streaming IO and historical reads. As a unique feature, Pravega streams are elastic: they can automatically change their degree of parallelism based on the ingestion workload. We compared the performance of Pravega with Apache Kafka and Apache Pulsar on AWS. Our results certify that Pravega can deliver performance improvements over them in many scenarios.", "venue": "International Middleware Conference", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2023-11-27", "journal": {"name": "Proceedings of the 24th International Middleware Conference"}, "authors": [{"authorId": "1405605118", "name": "Raúl Gracia-Tinedo"}, {"authorId": "2267098096", "name": "Flavio Junqueira"}, {"authorId": "2268244224", "name": "Tom Kaitchuck"}, {"authorId": "2268248477", "name": "Sachin Joshi"}], "citations": [{"paperId": "161411caa8e894c255ec2080050a0c8bb657fb57", "title": "Colocating Real-time Storage and Processing: An Analysis of Pull-based versus Push-based Streaming"}]}
