{"paperId": "b2e4027f7d0949ddf0cfd6b60f4b73615ce6ee59", "publicationVenue": {"id": "3edbd5e0-8799-420a-9ca8-b35c646c354f", "name": "IEEE Transactions on Instrumentation and Measurement", "type": "journal", "alternate_names": ["IEEE Trans Instrum Meas"], "issn": "0018-9456", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=19", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=19"]}, "title": "Enhanced Visible Light Localization Based on Machine Learning and Optimized Fingerprinting in Wireless Sensor Networks", "abstract": "This article presents a robust visible light localization (VLL) technique for wireless sensor networks, with 2-D indoor positioning (IP) capabilities, based on embedded machine learning (ML) running on low-cost low-power microcontrollers. The implemented VLL technique uses four optical sources (i.e., LEDs), modulated at different frequencies. In particular, the received signal strengths (RSSs) of optical signals are evaluated by a microcontroller on board the sensor nodes via fast Fourier transform (FFT). RSSs are fed to four embedded ML regressors, aiming at estimating the target position within the workspace. The four neural networks (NNs), one per each possible triplet of LEDs, are trained by exploiting a novel technique to generate the training datasets. This method, called optimized fingerprinting (OF), allows for creating arbitrarily ample datasets by performing only few measurements in the field, avoiding time-consuming steps for collecting experimental data. The NNs are devised to be accurate yet lightweight facilitating their implementation and execution by the microcontroller. Furthermore, due to the presence of four NNs, four position estimates are obtained. This redundancy is exploited to detect and effectively manage situations of total or partial shading of one light source and to enhance the positioning accuracy under normal operating conditions (i.e., no obstacles), by averaging the four positions. Test results performed in a $1\\times1$ m workspace show an overall mean accuracy of about 1 cm with standard deviation below the centimeter and maximum error around 3 cm.", "venue": "IEEE Transactions on Instrumentation and Measurement", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Transactions on Instrumentation and Measurement", "pages": "1-10", "volume": "72"}, "authors": [{"authorId": "47036686", "name": "I. Cappelli"}, {"authorId": "2181159078", "name": "Federico Carli"}, {"authorId": "144960176", "name": "A. Fort"}, {"authorId": "1820803396", "name": "Matteo Intravaia"}, {"authorId": "2181153027", "name": "Federico Micheletti"}, {"authorId": "40532940", "name": "G. Peruzzi"}, {"authorId": "2380449", "name": "V. Vignoli"}], "citations": [{"paperId": "24082906449fe529033efd79c0c2de1cd6990a07", "title": "Design and Experimental Assessment of Real-Time Anomaly Detection Techniques for Automotive Cybersecurity"}, {"paperId": "6763b422d069c2ba15961714c0e78604276a15ab", "title": "Predictive Maintenance of Actuated Quarter-Turn Valves Using Artificial Intelligence"}, {"paperId": "5a676c786df88eeca4c932513c5f070540731c46", "title": "Prognostic Analysis of Switching Devices in DC-DC Converters"}, {"paperId": "f89731de791c6312efebed36ca130d04ada57578", "title": "Autoencoders for Hourly Load Profile Reconstruction in Renewable Energy Communities"}, {"paperId": "506fcacf1e51462e5b85f25aefafe156c4f4a1f1", "title": "Embedded Machine Learning for 3D Indoor Visible Light Positioning via Optimized Fingerprinting"}, {"paperId": "a5c2d5c864676c25e87f72f9539939b2061d70b4", "title": "A Novel Fingerprint Database Regeneration Method for Accurate Visible Light Positioning"}, {"paperId": "fe3622b0df3afb2b316365326b209522a46c1ee9", "title": "Study on the Carrier Lifetime of RGB Mini-Light-Emitting Diodes Based on Phase-Sensitive Detection"}, {"paperId": "8e626c14954489a37f9d9841301ff2f902691efd", "title": "Multifeature-Based Outdoor Fingerprint Localization With Accuracy Enhancement for Cellular Network"}]}
