{"paperId": "b2e79fbc0b8669e03c965f8e1c4d8467a4df53ce", "publicationVenue": {"id": "025921dd-ad9c-4efd-ae07-af56d72681e9", "name": "Journal of Intelligent Manufacturing and Special Equipment", "type": "journal", "alternate_names": ["J Intell Manuf Spéc Equip"], "issn": "2633-660X", "alternate_issns": ["2633-6596"], "url": "https://www.emeraldgrouppublishing.com/journal/jimse"}, "title": "A framework and method for analysis of feed-forward industrial and manufacturing lines", "abstract": "PurposeThis modeling facilitates the determination of control responses (or possibly reconfiguration) upon such events and the identification of which segments of the pipeline can continue to function uninterrupted. Based on this modeling, an algorithm is presented to implement the control responses and to establish this determination. In this work, the authors propose using Message Queuing Telemetry Transport (MQTT), which is an integrated method to perform the system-wide control based on message exchanging among local node controllers (agents) and the global controller (broker).Design/methodology/approachComplex manufacturing lines in industrial plants are designed to accomplish an overall task in an incremental mode. This typically consists of a sequence of smaller tasks organized as cascaded processing nodes with local controls, which must be coordinated and aided by a system-wide (global) controller. This work presents a logic modeling technique for such pipelines and a method for using its logic to determine the consequent effects of events where a node halts/fails on the overall operation.FindingsThe method uses a protocol for establishing communication of node events and the algorithm to determine the consequences of node events in order to produce global control directives, which are communicated back to node controllers over MQTT. The algorithm is simulated using a complex manufacturing line with arbitrary events to illustrate the sequence of events and the agents–broker message exchanging.Originality/valueThis approach (MQTT) is a relatively new concept in Cyber-Physical Systems. The proposed example of feed-forward is not new; however, for illustration purposes, it was suggested that a feed-forward be used. Future works will consider practical examples that are at the core of the manufacturing processes.", "venue": "Journal of Intelligent Manufacturing and Special Equipment", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-09-14", "journal": {"name": "Journal of Intelligent Manufacturing and Special Equipment"}, "authors": [{"authorId": "2910658", "name": "C. Koutsougeras"}, {"authorId": "46199901", "name": "M. Saadeh"}, {"authorId": "153616481", "name": "Ahmad Fayed"}], "citations": []}
