{"paperId": "b2f8399dc3423e4bac9300174b01a55ab1c81f85", "publicationVenue": {"id": "57cfa558-a4cd-4f6d-8f7e-9a3bd853b969", "name": "International Conference/Workshop on Automation of Software Test", "type": "conference", "alternate_names": ["Int Conf Autom Softw Test", "AST", "Automation of Software Test", "Autom Softw Test"]}, "title": "Comparing and Combining Analysis-Based and Learning-Based Regression Test Selection", "abstract": "Regression testing–rerunning tests on each code version to detect newly–broken functionality-is important and widely practiced. But, regression testing is costly due to the large number of tests and the high frequency of code changes. Regression test selection (RTS) optimizes regression testing by only rerunning a subset of tests that can be affected by changes. Researchers showed that RTS based on program analysis can save substantial testing time for (medium-sized) open-source projects. Practitioners also showed that RTS based on machine learning (ML) works well on very large code repositories, e.g., in Facebook’s monorepository. We combine analysis-based RTS and ML-based RTS by using the latter to choose a subset of tests selected by the former. We first train several novel ML models to learn the impact of code changes on test outcomes using a training dataset that we obtain via mutation analysis. Then, we evaluate the benefits of combining ML models with analysis-based RTS on 10 projects, compared with using each technique alone. Combining ML-based RTS with two analysis-based RTS techniques-Ekstazi and STARTS-selects 25.34% and 21.44% fewer tests, respectively. CCS CONCEPTS • Software and its engineering $\\rightarrow$Software testing and debugging.", "venue": "International Conference/Workshop on Automation of Software Test", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2022-05-01", "journal": {"name": "2022 IEEE/ACM International Conference on Automation of Software Test (AST)", "pages": "17-28"}, "authors": [{"authorId": "2107966746", "name": "Jiyang Zhang"}, {"authorId": "2146400313", "name": "Yu Liu"}, {"authorId": "2020926", "name": "Miloš Gligorić"}, {"authorId": "3023790", "name": "Owolabi Legunsen"}, {"authorId": "40128780", "name": "A. Shi"}], "citations": [{"paperId": "00cf787add0f7b31f5ddf41d8d9ece1eb4af46ca", "title": "More Precise Regression Test Selection via Reasoning about Semantics-Modifying Changes"}, {"paperId": "df849275049b6453252e6a25e5b9ed227fbd9213", "title": "Searching by Code: a New SearchBySnippet Dataset and SnippeR Retrieval Model for Searching by Code Snippets"}, {"paperId": "6cc9e567fab368ded8824901a0c8dedaeb338265", "title": "pytest-inline: An Inline Testing Tool for Python"}, {"paperId": "47789ae4698b57aa0d7c7a9406d56fc198cbcf4b", "title": "State of Practical Applicability of Regression Testing Research: A Live Systematic Literature Review"}]}
