{"paperId": "b3156132c5724995275a7f77f4442ff3f1f47c46", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "A Survey on Spark Ecosystem for Big Data Processing", "abstract": "With the explosive increase of big data in industry and academic fields, it is necessary to apply large-scale data processing systems to analysis Big Data. Arguably, Spark is state of the art in large-scale data computing systems nowadays, due to its good properties including generality, fault tolerance, high performance of in-memory data processing, and scalability. Spark adopts a flexible Resident Distributed Dataset (RDD) programming model with a set of provided transformation and action operators whose operating functions can be customized by users according to their applications. It is originally positioned as a fast and general data processing system. A large body of research efforts have been made to make it more efficient (faster) and general by considering various circumstances since its introduction. In this survey, we aim to have a thorough review of various kinds of optimization techniques on the generality and performance improvement of Spark. We introduce Spark programming model and computing system, discuss the pros and cons of Spark, and have an investigation and classification of various solving techniques in the literature. Moreover, we also introduce various data management and processing systems, machine learning algorithms and applications supported by Spark. Finally, we make a discussion on the open issues and challenges for large-scale in-memory data processing with Spark.", "venue": "arXiv.org", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2018-11-18", "journal": {"name": "ArXiv", "volume": "abs/1811.08834"}, "authors": [{"authorId": "39362451", "name": "Shanjian Tang"}, {"authorId": "143824511", "name": "Bingsheng He"}, {"authorId": "7530636", "name": "Ce Yu"}, {"authorId": "2672579", "name": "Yusen Li"}, {"authorId": "2118605883", "name": "Kun Li"}], "citations": [{"paperId": "5b3e69558b8317a851f516ff121f34fd13d2049f", "title": "Apache Spark-based scalable feature extraction approaches for protein sequence and their clustering performance analysis"}, {"paperId": "57261c81566323f021ec22d76625b11ab6c59f56", "title": "Performance Evaluation of Data-driven Intelligent Algorithms for Big data Ecosystem"}, {"paperId": "d28004bff3e3cee53c5b065f48f1f1b3834950e6", "title": "HPC enabled a Novel Deep Fuzzy Scalable Clustering Algorithm and its Application for Protein Data"}, {"paperId": "25670771a12c48ab10eae58a56ca41644762a972", "title": "A Novel Scalable Apache Spark Based Feature Extraction Approaches for Huge Protein Sequence and their Clustering Performance Analysis"}, {"paperId": "0d77c5578eca3ce256137850b49e3b652e2f3654", "title": "An adaptive geographic meshing and coding method for remote sensing data"}, {"paperId": "56e475e2c4a18a329e71f45c38820478476736a6", "title": "Large-Scale Network Embedding in Apache Spark"}, {"paperId": "d2e9ab9cea313408a2c941b95f1bf9ef3d5b59f2", "title": "Big data clustering techniques based on Spark: a literature review"}, {"paperId": "f94560e7eaa39afce898e176e9dbbb2375c49b93", "title": "Proposal for a universal nonvolatile logic device based on the phase change magnetic material"}, {"paperId": "f457cc6c2d4bfe6496587b3d170ef12bc27eecd4", "title": "Big data Predictive Analytics for Apache Spark using Machine Learning"}, {"paperId": "b8ab1d56050539865c2c4ea805435a92a6c4d2b4", "title": "A Modified Query Processing Algorithm Based on Dynamic Clustering for Big Data Applications"}, {"paperId": "e5b6c83d60448011d01602b71f9ee49142a62431", "title": "Analysing billion-objects catalogue interactively: ApacheSpark for physicists"}]}
