{"paperId": "b3191888801960c3b8178626902bb2468318bfe7", "publicationVenue": {"id": "5353d583-6f50-4967-ab34-74338b908b90", "name": "ACM/IEEE International Conference on Model Driven Engineering Languages and Systems", "type": "conference", "alternate_names": ["Model Driven Eng Lang Syst", "ACM/IEEE Int Conf Model Driven Eng Lang Syst", "Model Driven Engineering Languages and Systems", "MoDELS"], "url": "https://dl.acm.org/conference/models"}, "title": "ViMoTest: a low code approach to specify ViewModel-based tests with a projectional DSL using JetBrains MPS", "abstract": "Automated testing for software is a fundamental part of achieving high-quality software systems. In particular, the user interface (UI) is one suitable abstraction layer for automated tests. However, software test developers usually spend considerable effort writing automated UI tests in a maintainable way. Therefore, this work proposes a concept to design a low code approach using the ViewModel architectural pattern as an abstraction layer to develop automated UI tests. We use the Design Science Research method to design a projectional DSL as an artifact to refine our approach. As planned results, we aim to (1) develop a projectional DSL to specify ViewModel-based tests, (2) apply this novel approach in an industrial and an open-source project, and (3) perform empirical studies to get feedback for improving this approach w.r.t. creation, maintenance, and understandability of test suites. We conclude that a low code approach using a projectional DSL to specify automated tests based on ViewModels could have several benefits compared to similar approaches.", "venue": "ACM/IEEE International Conference on Model Driven Engineering Languages and Systems", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2022-10-23", "journal": {"name": "Proceedings of the 25th International Conference on Model Driven Engineering Languages and Systems: Companion Proceedings"}, "authors": [{"authorId": "2146595961", "name": "Mario Fuksa"}], "citations": [{"paperId": "58c3ae35371158671e5f518dceec85360596772d", "title": "Applicability of the ViMoTest Approach for Automated GUI Testing: A Field Study"}]}
