{"paperId": "b31e4669399e24c41c8026e1f8eb391c7d4da68d", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "ReGra: Accelerating Graph Traversal Applications Using ReRAM With Lower Communication Cost", "abstract": "There is a growing gap between data explosion speed and the improvement of graph processing systems on conventional architectures. The main reason lies in the large overhead of random access and data movement, as well as the unbalanced and unordered communication cost. The emerging metal-oxide resistive random access memory (ReRAM) has great potential to solve these in the context of processing-in-memory (PIM) technology. However, the unbalanced and irregular communication under different graph organizations is not well addressed. In this paper, we present a PIM graph traversal accelerator using ReRAM with a lower communication cost named ReGra. ReGra optimizes the graph organization and communication efficiency in graph traversal. Benefiting from high density and efficient access of ReRAM, graphs are organized compactly and partitioned into processing cubes by the proposed Interval-Block Hash Balance (IBHB) method to balance graph distribution. Moreover, remote cube updates in graph traversal are converged into batched messages and transferred in a concentrated period via the custom circular round communication phase. This eliminates irregular and unpredictable inter-cube communication and overlaps partial computation and communication. Comparative experiments with previous work like Tesseract and RPBFS show that ReGra achieves better performance and yields a speedup of up to $2.2\\times $ . Besides the communication cost is reduced by up to 76%. It also achieves an average reduction in energy consumption of 70%.", "venue": "IEEE Access", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "116605-116616", "volume": "8"}, "authors": [{"authorId": "2143857174", "name": "Haoqiang Liu"}, {"authorId": "46485180", "name": "Qiang-Sheng Hua"}, {"authorId": "145914256", "name": "Hai Jin"}, {"authorId": "9135861", "name": "Long Zheng"}], "citations": [{"paperId": "2b35225d24544b48131af4f93df1fad699a77c7f", "title": "GraphA: An efficient ReRAM-based architecture to accelerate large scale graph processing"}, {"paperId": "67b1e1eeb5d7af8ea7d880cd561b81d85d89144b", "title": "Heterogeneous Data-Centric Architectures for Modern Data-Intensive Applications: Case Studies in Machine Learning and Databases"}, {"paperId": "5984a0b6957b0e9ed8b030c3784f3ec367fbfd8c", "title": "SISA: Set-Centric Instruction Set Architecture for Graph Mining on Processing-in-Memory Systems"}]}
