{"paperId": "b32cb5c88b5e1e8e3238394b5deaac1871178fca", "publicationVenue": {"id": "a608b572-eb7b-4233-8884-8abf9b59a3fc", "name": "International Journal of Religion", "type": "journal", "alternate_names": ["Int J Relig"], "issn": "2633-352X"}, "title": "Types of Hadiths that have been Weak by Hadith Scholars in Terms of the Authenticity of the Chain of Transmission and the Correctness of the Meaning", "abstract": "The importance of the research lies in that it studies an innovative idea that will benefit both specialists and non-specialists, which is collecting the types of hadith contained in the words of scholars with refutation and explanation, in terms of the accuracy of the attribution to the Messenger of God, peace be upon him, or others. In terms of the validity of the meaning, for this reason, the research can be like an introduction to books on weak and fabricated (and false) hadiths. The research used the inductive and analytical method, and arrived at fifteen types, which can be summarized in the following points: 1- Weak and fabricated hadiths that are not authentically narrated from the Prophet, peace be upon him. Not all of them have a rejected meaning. Rather, some of them have a rejected meaning, and some have an acceptable meaning, either because the hadith agrees with the experiences and wisdom of nations, or agrees with other legal texts, or correct medicine, or Other than that. 2- The hadith in the words of the scholars may come across as completely weak, but they only mean part of the hadith. Because it came together in the text, and has two forms: The first form: The hadith consists of two parts, one of which is correct in its attribution to the Messenger of God, peace be upon him, and it is correct in meaning. The other part of it is refuted in its attribution and meaning. As for the second form: the hadith consists of two parts, one of which is correct in its ratio and meaning, and the other part of it is correct in meaning, but it is refuted by its attribution to the Messenger of God, peace be upon him. 3- The hadith may have a neutral meaning, that is, it is not described as being in accordance with the principles or contrary to it, but rather it adds a description of the unseen, or a new jurisprudential description. It is narrated with a weak chain of transmission or an abandoned narrator. For this hadith, the researcher only has the chain of transmission to verify it, and the meaning has no clear impact on knowing its authenticity or weakness. 4-    The hadith may be authentic, but it has another wording in which one word has been replaced, and the reader will find it in the books of weak hadiths, even though it is authentic without this replaced word. 5- The reader may find a hadith condemned to be refuted in the books of fabricated and weak ones, and it is authentic on the authority of the Prophet, peace be upon him, but they weaken it if it is based on the narration of a companion other than the companion for whom he is famous. 6- The reader may find a hadith condemned to be refuted in the books of fabricated and fabricated ones whose attribution to the Messenger of God, peace be upon him, is not correct, but it is correct to attribute it to one of the companions, with a chain of narrators attributed to it, or one of the followers. 7- The hadith may be authentic, and there is another hadith related to it that may be authentic, but it is not valid as a reason for the first hadith. 8-      Scholars may weaken the hadith, and do not mean its text, but rather they mean the narration in which it describes the sequence in it. ", "venue": "International Journal of Religion", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-01-26", "journal": {"name": "International Journal of Religion"}, "authors": [{"authorId": "2282072493", "name": "Abdul-Jabbar bin Hadi bin Abdullah Al-Marrani"}], "citations": []}
