{"paperId": "b333be37cc7e11ca5429a1ace443f244bd94d240", "publicationVenue": {"id": "7c9d091e-015e-4e5d-a11f-9bc369fcf414", "name": "IEEE Transactions on Parallel and Distributed Systems", "type": "journal", "alternate_names": ["IEEE Trans Parallel Distrib Syst"], "issn": "1045-9219", "url": "http://www.computer.org/tpds", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=71"]}, "title": "HitGraph: High-throughput Graph Processing Framework on FPGA", "abstract": "This paper presents, HitGraph, an FPGA framework to accelerate graph processing based on the edge-centric paradigm. HitGraph takes in an edge-centric graph algorithm and hardware resource constraints, determines design parameters and then generates a Register Transfer Level (RTL) FPGA design. This makes accelerator design for various graph analytics transparent and user-friendly by masking internal details of the accelerator design process. HitGraph enables increased data reuse and parallelism through novel algorithmic optimizations, including (1) an optimized data layout that reduces non-sequential external memory accesses, (2) an efficient update merging and filtering scheme to reduce the data communication between the FPGA and external memory, and (3) a partition skipping scheme to reduce redundant edge traversals for non-stationary graph algorithms. Based on our design methodology, we accelerate Sparse Matrix Vector Multiplication (SpMV), PageRank (PR), Single Source Shortest Path (SSSP), and Weakly Connected Component (WCC). Experimental results show that HitGraph sustains a high throughput of 2076 Million Traversed Edges Per Second (MTEPS) for SpMV, 2225 MTEPS for PR, 2916 MTEPS for SSSP, and 3493 MTEPS for WCC, respectively. Compared with highly-optimized multi-core implementations, HitGraph achieves up to 37.9× speedup. Compared with state-of-the-art FPGA frameworks, HitGraph achieves up to 50.7× throughput improvement.", "venue": "IEEE Transactions on Parallel and Distributed Systems", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-10-01", "journal": {"name": "IEEE Transactions on Parallel and Distributed Systems", "pages": "2249-2264", "volume": "30"}, "authors": [{"authorId": "2110990110", "name": "Shijie Zhou"}, {"authorId": "2286832947", "name": "R. Kannan"}, {"authorId": "1728271", "name": "V. Prasanna"}, {"authorId": "7691720", "name": "G. Seetharaman"}, {"authorId": "2245553048", "name": "Qing Wu"}], "citations": [{"paperId": "2e0dd10092f97567a74b9fafdd5df04412c4bd56", "title": "Efficient FPGA-Based Sparse Matrix–Vector Multiplication With Data Reuse-Aware Compression"}, {"paperId": "df3ead351a499f5aea248224ce65561ae860ef08", "title": "Accelerating GNN-Based SAR Automatic Target Recognition on HBM-Enabled FPGA"}, {"paperId": "fcf19209e7778105a84d306c90aed6dd6a1757d6", "title": "GraphScale: Scalable Processing on FPGAs for HBM and Large Graphs"}, {"paperId": "07abad323320b1368935b429379d1f581b720c0f", "title": "A Time-Domain Wavefront Computing Accelerator With a 32 × 32 Reconfigurable PE Array"}, {"paperId": "7ffeb727e56a7da531585f034183121f89236924", "title": "Entropy Maximization in Sparse Matrix by Vector Multiplication (maxESpMV)"}, {"paperId": "45466a6d4e2187192157cca46c84909333991615", "title": "Efficient GPU-Accelerated Subgraph Matching"}, {"paperId": "d5941acfaa0e49260aad12ad81f5aecbec3a7883", "title": "Distributed large-scale graph processing on FPGAs"}, {"paperId": "ecf3f48ca04bfcec3b74f772edab46770732da28", "title": "Modular and Lean Architecture with Elasticity for Sparse Matrix Vector Multiplication on FPGAs"}, {"paperId": "35f4fb2bbaa1139c077fcdaff76de945297bb47a", "title": "LightRW: FPGA Accelerated Graph Dynamic Random Walks"}, {"paperId": "0165cf24953cfae9337c8659d9d24968b60edf12", "title": "GNNBuilder: An Automated Framework for Generic Graph Neural Network Accelerator Generation, Simulation, and Optimization"}, {"paperId": "dfddc6943706ff367ae9c9536b70e6da3f2a318a", "title": "ACTS: A Near-Memory FPGA Graph Processing Framework"}, {"paperId": "229db0006e6f2ea8f45cf266dbdeeb720d38c2b3", "title": "GraphAGILE: An FPGA-Based Overlay Accelerator for Low-Latency GNN Inference"}, {"paperId": "2e24c192aa130183188b67f4ba4450605b6dbc6d", "title": "Software-hardware co-design for accelerating large-scale graph convolutional network inference on FPGA"}, {"paperId": "17f3d9b84c21cfc313d5c11f9efba37605cade94", "title": "Software Systems Implementation and Domain-Specific Architectures towards Graph Analytics"}, {"paperId": "75aa3317a7be7d66ab2562924565c9aeab27509d", "title": "Graph_CC: Accelerator of Connected Component Search in Graph Computing"}, {"paperId": "cb8cb369762fe8365c60713b681e7f0a46e1c30c", "title": "Mr_Kru: Accelerator of Kruskal’s Algorithm for Finding Root Node in Parallel"}, {"paperId": "0a9f7eee2f90382c23fa7a82bc3a94c8e8d77569", "title": "OverGen: Improving FPGA Usability through Domain-specific Overlay Generation"}, {"paperId": "9d0b6b233fe4cb1453263e89c3878681615b2a5f", "title": "A Data-Centric Accelerator for High-Performance Hypergraph Processing"}, {"paperId": "e57b662f537e900f1b8b1da85e604e7e1ff31a23", "title": "Edge-Connected Jaccard Similarity for Graph Link Prediction on FPGA"}, {"paperId": "3d20660aee036dac7ed46a78e838d1b8ccf15cb3", "title": "FPGA Acceleration of Probabilistic Sentential Decision Diagrams with High-level Synthesis"}, {"paperId": "d2ef7fa75124d0f892681ebd8071c9e354c38425", "title": "TAPA: A Scalable Task-parallel Dataflow Programming Framework for Modern FPGAs with Co-optimization of HLS and Physical Design"}, {"paperId": "4c5ade2bc12db4aa6b83f9cbfc134c9772fe9731", "title": "GraphScale: Scalable Bandwidth-Efficient Graph Processing on FPGAs"}, {"paperId": "1de8e605b7f1ba72e1e23ea7acc436aad495abff", "title": "Gearbox: a case for supporting accumulation dispatching and hybrid partitioning in PIM-based accelerators"}, {"paperId": "34d861c3786c85f848da57e9679b26eaa14ed881", "title": "FPGA HLS Today: Successes, Challenges, and Opportunities"}, {"paperId": "c8fc33e66ed4cb947fadf90bf3b7d6f7afef80c1", "title": "HLS-based High-throughput and Work-efficient Synthesizable Graph Processing Template Pipeline"}, {"paperId": "62b0eeb59158a59c564c41d1ee3d3d0c384d541c", "title": "GraphWave: A Highly-Parallel Compute-at-Memory Graph Processing Accelerator"}, {"paperId": "f572b8eba5c598c5c0edf13326ed590c42b671be", "title": "ThunderGP: Resource-Efficient Graph Processing Framework on FPGAs with HLS"}, {"paperId": "0de2f7c29a53ae19f5a6bc6b8a898fc770cb6e8f", "title": "ReGraph: Scaling Graph Processing on HBM-enabled FPGAs with Heterogeneous Pipelines"}, {"paperId": "1bb06b95afd5515eea1ca02d0e2685d573d48917", "title": "On The Design of a Light-weight FPGA Programming Framework for Graph Applications"}, {"paperId": "d3bb9e1c3fec528ed9a98fe427ba14b72214ec52", "title": "Programming and Synthesis for Software-defined FPGA Acceleration: Status and Future Prospects"}, {"paperId": "3bec8b4017541b9be679eb75836de9c713968e22", "title": "HP-GNN: Generating High Throughput GNN Training Implementation on CPU-FPGA Heterogeneous Platform"}, {"paperId": "c76142d04ba5da3e4470e08ef9ddb54b8f56f89c", "title": "Serpens: a high bandwidth memory based accelerator for general-purpose sparse matrix-vector multiplication"}, {"paperId": "1872ba071a8dd41ad7114770be03306e52e8c8d5", "title": "GraphLily: Accelerating Graph Linear Algebra on HBM-Equipped FPGAs"}, {"paperId": "506ac894aa94a8d43e85da8ea6861681086e7df7", "title": "PYXIS: An Open-Source Performance Dataset Of Sparse Accelerators"}, {"paperId": "19547c17e647e7d615f8e12b81c859be23ab0c73", "title": "A predictor circuit and a delay-aware algorithm for identifying data transfer pattern on NoC-based communication networks"}, {"paperId": "9d648b9e77a1c7e7a12b88c7c382c28b6ad650ce", "title": "FDGLib: A Communication Library for Efficient Large-Scale Graph Processing in FPGA-Accelerated Data Centers"}, {"paperId": "6604a29489fab65cc9b61a369759d96c781d2861", "title": "Sextans: A Streaming Accelerator for General-Purpose Sparse-Matrix Dense-Matrix Multiplication"}, {"paperId": "9076a0f3df67e65655415c1944b590d4d7d4af7b", "title": "Programmable FPGA-based Memory Controller"}, {"paperId": "4e3036000912f1c521119122c9b41e958857d145", "title": "A Streaming Accelerator for Heterogeneous CPU-FPGA Processing of Graph Applications"}, {"paperId": "a1f5f73db29ee6966091f700df44f88c5d017857", "title": "Large-Scale Graph Processing on FPGAs with Caches for Thousands of Simultaneous Misses"}, {"paperId": "394a3b11dbee1d5ce04e2f3e7f6cdd4ef81e38b1", "title": "Skew-Oblivious Data Routing for Data Intensive Applications on FPGAs with HLS"}, {"paperId": "cbcd6312f4bbaa32635ef92a62b453a005011878", "title": "Demystifying memory access patterns of FPGA-based graph processing accelerators"}, {"paperId": "13d38e22daa7e1b0844e785c4e51dd1789cadc14", "title": "ThunderGP: HLS-based Graph Processing Framework on FPGAs"}, {"paperId": "8c1931e9ae4e790504827db2274667444311ad58", "title": "GraSU: A Fast Graph Update Library for FPGA-based Dynamic Graph Processing"}, {"paperId": "c674139862eb662b674969413f2a9af5b02c5f14", "title": "BoostGCN: A Framework for Optimizing GCN Inference on FPGA"}, {"paperId": "c130448814f002df3d82df61533d7f8a1d434e68", "title": "DepGraph: A Dependency-Driven Accelerator for Efficient Iterative Graph Processing"}, {"paperId": "1b15a8fde662ef2d8fff82e2fc731715fefc9f65", "title": "Mining user–user communities for a weighted bipartite network using spark GraphFrames and Flink Gelly"}, {"paperId": "0f5bede8ed9412fecffbeafdc4581a7b51753e95", "title": "Exploring Memory Access Patterns for Graph Processing Accelerators"}, {"paperId": "997c887d8701d9e86e9ff9104c4c3e124d1641d8", "title": "Extending High-Level Synthesis for Task-Parallel Programs"}, {"paperId": "3d9bbeeba0e34494f15a92746323be3ec133cded", "title": "Balancing Graph Processing Workloads Using Work Stealing on Heterogeneous CPU-FPGA Systems"}, {"paperId": "c6dd76bf1bcede1666ac307d60fdc7bf811d7546", "title": "A Domain-Specific Architecture for Accelerating Sparse Matrix Vector Multiplication on FPGAs"}, {"paperId": "8cb35bbf013802218d1c3554051ac5425d91868a", "title": "Exploring FPGA Optimizations in OpenCL for Breadth-First Search on Sparse Graph Datasets"}, {"paperId": "d0ecffd78981d6bb85dec8b6ed27fc55a01179bf", "title": "Non-relational Databases on FPGAs: Survey, Design Decisions, Challenges"}, {"paperId": "ca0ffd3c87f875899223b38b636aca2861bd66fe", "title": "Hardware Acceleration of Large Scale GCN Inference"}, {"paperId": "79de77b2dae00b20270e0dabee12eb18f8cf1656", "title": "A Conflict-free Scheduler for High-performance Graph Processing on Multi-pipeline FPGAs"}, {"paperId": "f92a51c6185b29eae8dcb88fc6d92e43f45c18fa", "title": "Massively Simulating Adiabatic Bifurcations with FPGA to Solve Combinatorial Optimization"}, {"paperId": "e1584c7c593c5656e1e918fddca13f5a6d0672c8", "title": "FlowGNN: A Dataflow Architecture for Universal Graph Neural Network Inference via Multi-Queue Streaming"}, {"paperId": "4bf222cf2a30d8e9c811b31e6ac5eb5cfc373aab", "title": "Towards Engineering Computer Vision Systems: From the Web to FPGAs"}]}
