{"paperId": "b3355aaa7a0cb0ea26d5f0c6ac864f610ff50f0c", "publicationVenue": {"id": "b76366f5-0af9-45f3-8fe3-78fdb0114f67", "name": "Applied Informatics", "type": "conference", "alternate_names": ["Appl Informatics", "Advances Argumentation Artificial Intelligence", "AI", "Can Conf Artif Intell", "Adv Argum Artif Intell", "Canadian Conference on Artificial Intelligence"], "issn": "2196-0089", "alternate_issns": ["2673-2688"], "url": "http://cscsi.org/", "alternate_urls": ["https://link.springer.com/journal/40535", "http://www.applied-informatics-j.com/"]}, "title": "A Natural Language Interface to Relational Databases Using an Online Analytic Processing Hypercube", "abstract": "Structured Query Language (SQL) is commonly used in Relational Database Management Systems (RDBMS) and is currently one of the most popular data definition and manipulation languages. Its core functionality is implemented, with only some minor variations, throughout all RDBMS products. It is an effective tool in the process of managing and querying data in relational databases. This paper describes a method to effectively automate the conversion of a data query from a Natural Language Query (NLQ) to Structured Query Language (SQL) with Online Analytical Processing (OLAP) cube data warehouse objects. To obtain or manipulate the data from relational databases, the user must be familiar with SQL and must also write an appropriate and valid SQL statement. However, users who are not familiar with SQL are unable to obtain relevant data through relational databases. To address this, we propose a Natural Language Processing (NLP) model to convert an NLQ into an SQL query. This allows novice users to obtain the required data without having to know any complicated SQL details. The model is also capable of handling complex queries using the OLAP cube technique, which allows data to be pre-calculated and stored in a multi-dimensional and ready-to-use format. A multi-dimensional cube (hypercube) is used to connect with the NLP interface, thereby eliminating long-running data queries and enabling self-service business intelligence. The study demonstrated how the use of hypercube technology helps to increase the system response speed and the ability to process very complex query sentences. The system achieved impressive performance in terms of NLP and the accuracy of generating different query sentences. Using OLAP hypercube technology, the study achieved distinguished results compared to previous studies in terms of the speed of the response of the model to NLQ analysis, the generation of complex SQL statements, and the dynamic display of the results. As a plan for future work, it is recommended to use infinite-dimension (n-D) cubes instead of 4-D cubes to enable ingesting as much data as possible in a single object and to facilitate the execution of query statements that may be too complex in query interfaces running in a data warehouse. The study demonstrated how the use of hypercube technology helps to increase system response speed and process very complex query sentences.", "venue": "Applied Informatics", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-12-18", "journal": {"name": "AI"}, "authors": [{"authorId": "2146590919", "name": "Fadi H. Hazboun"}, {"authorId": "3445863", "name": "M. Owda"}, {"authorId": "23266995", "name": "A. Y. Owda"}], "citations": [{"paperId": "6effdd433f8442befdc2fcccb655e9b5f6f5f0dc", "title": "Natural Language Interface to Database Approach in the Task of Relational Databases Design"}]}
