{"paperId": "b336492cc1a8de095a57fe0684f142816f32d045", "publicationVenue": {"id": "7c9d091e-015e-4e5d-a11f-9bc369fcf414", "name": "IEEE Transactions on Parallel and Distributed Systems", "type": "journal", "alternate_names": ["IEEE Trans Parallel Distrib Syst"], "issn": "1045-9219", "url": "http://www.computer.org/tpds", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=71"]}, "title": "A Black-Box Fork-Join Latency Prediction Model for Data-Intensive Applications", "abstract": "The workflows of the predominant datacenter services are underlaid by various Fork-Join structures. Due to the lack of good understanding of the performance of Fork-Join structures in general, today's datacenters often operate under low resource utilization to meet stringent service level objectives (SLOs), e.g., in terms of tail and/or mean latency, for such services. Hence, to achieve high resource utilization, while meeting stringent SLOs, it is of paramount importance to be able to accurately predict the tail and/or mean latency for a broad range of Fork-Join structures of practical interests. In this article, we propose a black-box Fork-Join model that covers a wide range of Fork-Join structures for the prediction of tail and mean latency, called ForkTail and ForkMean, respectively. We derive highly computational effective, empirical expressions for tail and mean latency as functions of means and variances of task response times. Our extensive testing results based on model-based and trace-driven simulations, as well as a real-world case study in a cloud environment demonstrate that the models can consistently predict the tail and mean latency within 20 and 15 percent prediction errors at 80 and 90 percent load levels, respectively, for heavy-tailed workloads, and at any load levels for light-tailed workloads. Moreover, our sensitivity analysis demonstrates that such errors can be well compensated for with no more than 7 percent resource overprovisioning. Consequently, the proposed prediction model can be used as a powerful tool to aid the design of tail-and-mean-latency guaranteed job scheduling and resource provisioning, especially at high load, for datacenter applications.", "venue": "IEEE Transactions on Parallel and Distributed Systems", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-09-01", "journal": {"name": "IEEE Transactions on Parallel and Distributed Systems", "pages": "1983-2000", "volume": "31"}, "authors": [{"authorId": "2114751582", "name": "Minh Nguyen"}, {"authorId": "46214571", "name": "Sami Alesawi"}, {"authorId": "2120049019", "name": "Ning Li"}, {"authorId": "1922577", "name": "Hao Che"}, {"authorId": "144248618", "name": "Hong Jiang"}], "citations": [{"paperId": "6f40469983c7d1142ca66dd4d9fe4604151f818b", "title": "Investigation of the Fork–Join System with Markovian Arrival Process Arrivals and Phase-Type Service Time Distribution Using Machine Learning Methods"}, {"paperId": "acd0b07ba8848876188461c98d6ddc002d2384e5", "title": "Graph3PO: A Temporal Graph Data Processing Method for Latency QoS Guarantee in Object Cloud Storage System"}, {"paperId": "dd21e0b9bd40ca1e48a41389ddc2381edbdc85ed", "title": "Nonlinear approximation of characteristics of a fork-join queueing system with Pareto service as a model of parallel structure of data processing"}, {"paperId": "85e1a7dc8e760403a66befb2f1a7847db2ec7db2", "title": "The Delay Time Profile of Multistage Networks with Synchronization"}, {"paperId": "8faa343c0ceb426ecc0c45b4ca0ae7e2ceebf1ec", "title": "Cost-Aware Resource Recommendation for DAG-Based Big Data Workflows: An Apache Spark Case Study"}, {"paperId": "502d6baeddf6e9f6a39c6b9d4fdd5a0936715e9d", "title": "Tail Prediction for Heterogeneous Data Center Clusters"}, {"paperId": "1286ae805ca39ad54df91e2c3ecfad2c00049520", "title": "Fixed-Point Iteration Approach to Spark Scalable Performance Modeling and Evaluation"}, {"paperId": "f903cc0fc8c6556e6db3743a7204417177886117", "title": "A brief survey on big data: technologies, terminologies and data-intensive applications"}, {"paperId": "3cbd6c791f965d9036c23479b581e4ccfd51bec7", "title": "ForkMV: Mean-and-Variance Estimation of Fork-Join Queuing Networks for Datacenter Applications*"}, {"paperId": "4fb435fe5c3c84721e07653bafda3caadf2ebffb", "title": "A survey of domains in workflow scheduling in computing infrastructures: Community and keyword analysis, emerging trends, and taxonomies"}, {"paperId": "3e895d2ce666d2abc4da8869790f9e3e6db4d327", "title": "Status of Cloud Computing in Data Intensive Data Center"}]}
