{"paperId": "b339c09878455da211ac5dd19d6a181d9148baad", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Agricultural Big Data Architectures in the Context of Climate Change: A Systematic Literature Review", "abstract": "Climate change is currently one of agriculture’s main problems in achieving sustainability. It causes drought, increased rainfall, and increased diseases, causing a decrease in food production. In order to combat these problems, Agricultural Big Data contributes with tools that improve the understanding of complex, multivariate, and unpredictable agricultural ecosystems through the collection, storage, processing, and analysis of vast amounts of data from diverse heterogeneous sources. This research aims to discuss the advancement of technologies used in Agricultural Big Data architectures in the context of climate change. The study aims to highlight the tools used to process, analyze, and visualize the data, to discuss the use of the architectures in crop, water, climate, and soil management, and especially to analyze the context, whether it is in Resilience Mitigation or Adaptation. The PRISMA protocol guided the study, finding 33 relevant papers. However, despite advances in this line of research, few papers were found that mention architecture components, in addition to a lack of standards and the use of reference architectures that allow the proper development of Agricultural Big Data in the context of climate change.", "venue": "Sustainability", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-06-28", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "10677584", "name": "Ania Cravero"}, {"authorId": "2071331077", "name": "A. Bustamante"}, {"authorId": "2174242966", "name": "Marlene Negrier"}, {"authorId": "2174245182", "name": "Patricio Galeas"}], "citations": [{"paperId": "38b9705d71d6705e48a5ab8f55c9b43760ef1eb3", "title": "Agroclimatic and Phytosanitary Events and Emerging Technologies for Their Identification in Avocado Crops: A Systematic Literature Review"}]}
