{"paperId": "b351632f24f5f7417fa96119893e24c587c0333d", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "IoT and Big Data Applications in Smart Cities: Recent Advances, Challenges, and Critical Issues", "abstract": "The notion of smart cities has remained under evolution as its global implementations are challenged by numerous technological, economic, and governmental obstacles. Moreover, the synergy of the Internet of Things (IoT) and big data technologies could result in promising horizons in terms of smart city development which has not been explored yet. Thus, the current research aims to address the essence of smart cities. To this end, first, the concept of smart cities is briefly overviewed; then, their properties and specifications as well as generic architecture, compositions, and real-world implementations are addressed. Furthermore, possible challenges and opportunities in the field of smart cities are described. Numerous issues and challenges such as analytics and using big data in smart cities introduced in this study offers an enhancement in developing applications of the above-mentioned technologies. Hence, this study paves the way for future research on the issues and challenges of big data applications in smart cities.", "venue": "IEEE Access", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "55465-55484", "volume": "9"}, "authors": [{"authorId": "2027662453", "name": "Marieh Talebkhah"}, {"authorId": "32649968", "name": "A. Sali"}, {"authorId": "38085614", "name": "Mohsen Marjani"}, {"authorId": "46697581", "name": "M. Gordan"}, {"authorId": "145194679", "name": "S. Hashim"}, {"authorId": "3310398", "name": "F. Rokhani"}], "citations": [{"paperId": "92aa7e299a7b74d0637a9e33d01e973bf12dd192", "title": "Optical wireless communications with InGaN multiple-quantum-well photodiodes grown with the prestrained superlattice interlayer for light detection"}, {"paperId": "09e91cd8c85cc6cf6044f1282890fe3a732adfba", "title": "Intelligent Secured Traffic Optimization Model for Urban Sensing Applications With Software Defined Network"}, {"paperId": "51b78737b89e9d5afb599e64cc9da79a09a6a470", "title": "A Survey on-Advancing Urban Sustainability through Smart City Integration"}, {"paperId": "55650ca71b51587113f6386e5d9f4cc8c31e3b2e", "title": "TinyML Applications, Research Challenges, and Future Research Directions"}, {"paperId": "1ddd94286730c84cfc3f4d751005d0884eeef751", "title": "Towards an AI-Driven Data Reduction Framework for Smart City Applications"}, {"paperId": "0d792da2ea1d68f996b5f5c5df7fc858128643f3", "title": "Connecting the Indispensable Roles of IoT and Artificial Intelligence in Smart Cities: A Survey"}, {"paperId": "7f28070f247311f5f38bd1a907341abca62f544d", "title": "Challenges in big data adoption for Malaysian organizations: a review"}, {"paperId": "512f50853026e75457eaf3523bc10c1a22feaa8f", "title": "The Internet of Things-Enabled Smart City: An In-Depth Review of Its Domains and Applications"}, {"paperId": "7c3cf82c81ab66a52c9292f12fea5a105342c33e", "title": "Gaming-Based Education System for Children on Road Safety in Metaverse Towards Smart Cities"}, {"paperId": "1039c37d71a5fff7309f52159b8fa5a5a2dc53e9", "title": "Use of Internet of Things in the context of execution of smart city applications: a review"}, {"paperId": "2a6384df374abb7e6de671d2f3e9d876277c7fc8", "title": "A Damage Detection Approach in the Era of Industry 4.0 Using the Relationship between Circular Economy, Data Mining, and Artificial Intelligence"}, {"paperId": "67e41827c1bb934c1a9fec8ad3cb6404442e67da", "title": "Cyber-Physical Systems for Smart City Applications: A Comparative Study"}, {"paperId": "854ba1e5af4882288f63e6dc028cca9ea74f4268", "title": "Internet of Cross-Chains: Model-Driven Cross-Chain as a Service Platform for the Internet of Everything in Smart City"}, {"paperId": "068ba74eb4da88b3efbcf3f0d9014bed7f4f1dd2", "title": "A Framework for Smart City Implementation using IoT-Cloud Based System Architecture"}, {"paperId": "79d2256ee970978d659f0db0bb04919de8734aa1", "title": "A Novel IoT Framework and Device Architecture for Efficient Smart city Implementation"}, {"paperId": "199905137655521d2ea55738f59fe099d63058fa", "title": "Design and Implementation of a Futuristic EV Energy Trading System (FEETS) Connected with Buildings, PV, and ESS for a Carbon-Neutral Society"}, {"paperId": "aba93f864e95de978d3c85b61138d60826d9c8a7", "title": "Federated System for Transport Mode Detection"}, {"paperId": "4b8f230d3640daa29b5580656ba9b3a7d3f2d366", "title": "NoSQL Cloud based Bigdata technologies for efficient performance evaluation in the modern era"}, {"paperId": "a3b7cf9e7703649c2810322e3f16cec21a04a790", "title": "Usage and impact of the internet-of-things-based smart home technology: a quality-of-life perspective"}, {"paperId": "d0204aed871a3cdd0e23c763cea6dca5b28b61d0", "title": "Selection of IoT service provider for sustainable transport using q-rung orthopair fuzzy CRADIS and unknown weights"}, {"paperId": "05c495097300a3fcf3608949bca253a4275d7948", "title": "Artificial Intelligence-Based Recommendation and Application of Public Services in Smart Cities"}, {"paperId": "7b092d9ed4795f42de2fb3697dd87a9dbfe1bc8b", "title": "Enhanced Communications on Satellite-Based IoT Systems to Support Maritime Transportation Services"}, {"paperId": "ef9b3551e75730b618bb511b9c04103cd70eb78e", "title": "The Use of Big Data Combined with Artificial Intelligence Neural Network Technology in Urban Spatial Evaluation System"}, {"paperId": "7023af32da1423ca7c2cda926c27b9c135dd9fd9", "title": "From Cognitive Bias Toward Advanced Computational Intelligence for Smart Infrastructure Monitoring"}, {"paperId": "81b9b5cf6da6ccb45508ac5806d60973ea673653", "title": "RTID: On-demand real-time data processing for IoT network"}, {"paperId": "98e67ca2e26f8fa99ac1403cd4a8951433a3ba33", "title": "State-of-the-Art Review on Advancements of Data Mining in Structural Health Monitoring"}, {"paperId": "5923aed8a97355ff557d1885cc56a100c414d050", "title": "Innovation Trajectories for a Society 5.0"}, {"paperId": "96c19cf44c8708d6cbe9f5e63d91b9b5307be521", "title": "A Literature Review on the Development of Remote Sensing in Damage Detection of Civil Structures"}, {"paperId": "c382df518331c9ef7d0ce63c730158be7192e32a", "title": "IoT-based smart cities: a bibliometric analysis and literature review"}, {"paperId": "f75392984ec85f5375951eb34f633d884dca24f5", "title": "A New Framework for Centralized Coordinated Multi-Vehicle Dynamic Routing"}, {"paperId": "2b75478afae209103e8beddf353abe677e84c9ba", "title": "Comprehensive Review on Development of Smart Cities Using Industry 4.0 Technologies"}, {"paperId": "3b554595e0511bc19838171dc9c108b3a6993652", "title": "Internet of Things for Earthquake Early Warning Systems: A Performance Comparison Between Communication Protocols"}, {"paperId": "367d9769f7ab6b9fac39b54f227607dd15d3f226", "title": "The Fourth Industrial Revolution: A Technological Wave of Change"}, {"paperId": "f718a40ce9f7c823f01f2dcf32aab49a1bda96d5", "title": "Feature Drift Aware for Intrusion Detection System Using Developed Variable Length Particle Swarm Optimization in Data Stream"}]}
