{"paperId": "b35249403d91934de534a1192eb303f42f4772ad", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Causal Inference Based Single-branch Ensemble Trees For Uplift Modeling", "abstract": "In this manuscript (ms), we propose causal inference based single-branch ensemble trees for uplift modeling, namely CIET. Different from standard classification methods for predictive probability modeling, CIET aims to achieve the change in the predictive probability of outcome caused by an action or a treatment. According to our CIET, two partition criteria are specifically designed to maximize the difference in outcome distribution between the treatment and control groups. Next, a novel single-branch tree is built by taking a top-down node partition approach, and the remaining samples are censored since they are not covered by the upper node partition logic. Repeating the tree-building process on the censored data, single-branch ensemble trees with a set of inference rules are thus formed. Moreover, CIET is experimentally demonstrated to outperform previous approaches for uplift modeling in terms of both area under uplift curve (AUUC) and Qini coefficient significantly. At present, CIET has already been applied to online personal loans in a national financial holdings group in China. CIET will also be of use to analysts applying machine learning techniques to causal inference in broader business domains such as web advertising, medicine and economics.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-02-03", "journal": {"name": "ArXiv", "volume": "abs/2302.01563"}, "authors": [{"authorId": "2057492284", "name": "Fanglan Zheng"}, {"authorId": "34875471", "name": "Menghan Wang"}, {"authorId": "2115468917", "name": "Kun Li"}, {"authorId": "2136088478", "name": "Jiang Tian"}, {"authorId": "2392512", "name": "Xiaojia Xiang"}], "citations": []}
