{"paperId": "b36b61fefbb1cb9116069a91f758fb5b385d8bd7", "publicationVenue": {"id": "228761ec-c40a-479b-8309-9dcbe9851bcd", "name": "IEEE Internet of Things Journal", "type": "journal", "alternate_names": ["IEEE Internet Thing J"], "issn": "2327-4662", "url": "https://www.ieee.org/membership-catalog/productdetail/showProductDetailPage.html?product=PER288-ELE", "alternate_urls": ["https://ieeexplore.ieee.org/servlet/opac?punumber=6488907", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6488907", "http://ieee-iotj.org/#"]}, "title": "Easy Ensemble: Simple Deep Ensemble Learning for Sensor-Based Human Activity Recognition", "abstract": "Sensor-based human activity recognition (HAR) is a paramount technology in the Internet of Things services. HAR using representation learning, which automatically learns a feature representation from raw data, is the mainstream method because it is difficult to interpret relevant information from raw sensor data to design meaningful features. Ensemble learning is a robust approach to improve generalization performance; however, deep ensemble learning requires various procedures, such as data partitioning and training multiple models, which are time-consuming and computationally expensive. In this study, we propose an easy ensemble (EE) for HAR, which enables the easy implementation of deep ensemble learning in a single model. In addition, we propose various techniques (input variationer, stepwise ensemble, and channel shuffle) for the EE. Experiments on a benchmark data set for HAR demonstrated the effectiveness of EE and various techniques and their characteristics compared with conventional ensemble learning methods.", "venue": "IEEE Internet of Things Journal", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-03-08", "journal": {"name": "IEEE Internet of Things Journal", "pages": "5506-5518", "volume": "10"}, "authors": [{"authorId": "2078583", "name": "Tatsuhito Hasegawa"}, {"authorId": "1710209339", "name": "Kazuma Kondo"}], "citations": [{"paperId": "b3738428ee0c5c7b8f5408fcdabb18a5fd5b62ee", "title": "A physics-informed Bayesian optimization method for rapid development of electrical machines"}, {"paperId": "d748995420d9d748f66febd953e1c862bbeeb165", "title": "A Deep Ensemble model to Recognize Human Activities using inertial sensors on smartphones"}]}
