{"paperId": "b36e70fa8635f689a2b75e3f3a92c64eff93622c", "publicationVenue": null, "title": "LEGO, but with Servers: Creating the Building Blocks to Design and Simulate Datacenters", "abstract": "Tracking the rapidly growing consumption of cloud services, datacenters will likely increase in both number and capacity, and also improve their operational eﬃciency. Both of these developments will require numerous new datacenter designs. Because we are faced with a shortage of datacenter designers, it is important to make datacenter design accessible to a wider range of people, so that this growth may continue. To achieve this, we propose in this work to create datacenter designs with the use of pre-designed building blocks, or prefabs . We propose a hierarchical design for a data structure that allows for the representation of such building blocks. Additionally, we design the accompanying methods that enable us to perform operations on prefabs, when included in publicly available datacenter simulators such as OpenDC. We design a prototype to test the suitability of our designs, allowing us to carry out an implementation of prefabs into the codebase of OpenDC. We conduct small-scale but representative experiments based on the KLM method to assess the time taken to construct common datacenter layouts, and ﬁnd that the prefab-based approach reduces the required time by a factor of 3.4, over the conventional approach not based on prefabs. We conclude that the addition of prefabs allows for a signiﬁcant reduction in the number of interactions required to build datacenters in OpenDC. This reduction in interactions also thus leads to a reduction in the time taken to build datacenters in OpenDC. Our work enables a faster means of iteratively improving datacenter designs, while also enabling new users to get started with datacenter design much faster than they were previously able to.", "venue": "", "year": 2020, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "88726268", "name": "V. U. Amsterdam"}, {"authorId": "2122689905", "name": "Jacob Burley"}], "citations": []}
