{"paperId": "b37099da39d7bd25becaa29a4ef977f77414790f", "publicationVenue": {"id": "6c6fcaa9-fd25-488b-8050-995227ac671c", "name": "Symposium on Operating Systems Principles", "type": "conference", "alternate_names": ["Symp Oper Syst Princ", "SOSP"], "url": "http://sosp.org/"}, "title": "Taiji: managing global user traffic for large-scale internet services at the edge", "abstract": "We present Taiji, a new system for managing user traffic for large-scale Internet services that accomplishes two goals: 1) balancing the utilization of data centers and 2) minimizing network latency of user requests. Taiji models edge-to-datacenter traffic routing as an assignment problem---assigning traffic objects at the edge to the data centers to satisfy service-level objectives. Taiji uses a constraint optimization solver to generate an optimal routing table that specifies the fractions of traffic each edge node will distribute to different data centers. Taiji continuously adjusts the routing table to accommodate the dynamics of user traffic and failure events that reduce capacity. Taiji leverages connections among users to selectively route traffic of highly-connected users to the same data centers based on fractions in the routing table. This routing strategy, which we term connection-aware routing, allows us to reduce query load on our backend storage by 17%. Taiji has been used in production at Facebook for more than four years and routes global traffic in a user-aware manner for several large-scale product services across dozens of edge nodes and data centers.", "venue": "Symposium on Operating Systems Principles", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2019-10-27", "journal": {"name": "Proceedings of the 27th ACM Symposium on Operating Systems Principles"}, "authors": [{"authorId": "144699409", "name": "David Chou"}, {"authorId": "38127194", "name": "Tianyin Xu"}, {"authorId": "3199448", "name": "K. Veeraraghavan"}, {"authorId": "2072374716", "name": "Andrew Newell"}, {"authorId": "36895488", "name": "Sonia Margulis"}, {"authorId": "2149552052", "name": "Lin Xiao"}, {"authorId": "2053298674", "name": "Pol Mauri Ruiz"}, {"authorId": "144606145", "name": "Justin Meza"}, {"authorId": "47698815", "name": "Kiryong Ha"}, {"authorId": "2593764", "name": "Shruti Padmanabha"}, {"authorId": "152776444", "name": "Kevin Cole"}, {"authorId": "2228658", "name": "D. Perelman"}], "citations": [{"paperId": "d6019b279dc9cac41868c5992c411b19182456f3", "title": "Admission Control with Response Time Objectives for Low-latency Online Data Systems"}, {"paperId": "af574d8f87d6755fdfe5487137a68561b6f18e26", "title": "FLASH: Low-Latency Serverless Model Inference with Multi-Core Parallelism in Edge"}, {"paperId": "abe07197230e69fc5486336c6c40e9e1b5e36069", "title": "Switchboard: Efficient Resource Management for Conferencing Services"}, {"paperId": "ba186041f2f94eb7558349479345fd11022ed0e4", "title": "Modeling Sparse Store-and-Forward Bulk Data Transfers in Inter-Datacenter Networks With Multiple Congested Links"}, {"paperId": "be6685bc478a5e346fff422bc4228f54c41105d0", "title": "Characterizing and orchestrating VM reservation in geo-distributed clouds to improve the resource efficiency"}, {"paperId": "bed766d38c6495356618757fd44a55c4d22a17c3", "title": "Energy-Efficient Service Placement for Latency-Sensitive Applications in Edge Computing"}, {"paperId": "13290bdd12d617f04b26466f98fe20bb36a8b144", "title": "Comparative Analysis of Selected Open-Source Solutions for Traffic Balancing in Server Infrastructures Providing WWW Service"}, {"paperId": "ada332377bf3423badcf83f43585b35bf3b85af6", "title": "Using Distributed Tracing to Identify Inefficient Resources Composition in Cloud Applications"}, {"paperId": "4047054936ac60b7562b28d2551319ab76ce7364", "title": "RAS: Continuously Optimized Region-Wide Datacenter Resource Allocation"}, {"paperId": "2803a5ad7115969c7d150d35d5b3b398b85e8994", "title": "From cloud to edge: a first look at public edge platforms"}, {"paperId": "05a5067e57a476b72a5336be7fffd45dd1e156ff", "title": "Attaining Meta-self-awareness through Assessment of Quality-of-Knowledge"}, {"paperId": "52756eed6a3917b33705dc129707484ea2f4760e", "title": "Cost-effective Cloud Edge Traffic Engineering with Cascara"}, {"paperId": "395f8cc015903c5c22e918481ccc84afd5e92733", "title": "A Learning-based Dynamic Load Balancing Approach for Microservice Systems in Multi-cloud Environment"}, {"paperId": "667cec55a2c3056daa9e6f105684da49aec74949", "title": "Contracting Wide-area Network Topologies to Solve Flow Problems Quickly"}, {"paperId": "7a98d4825846fd218f0f8f7340a3f8d776851b2e", "title": "Concury: a fast and light-weight software cloud load balancer"}, {"paperId": "14583dbdf7954ccf7f641a8c68c2c069eaf6aac5", "title": "AAsclepius: Monitoring, Diagnosing, and Detouring at the Internet Peering Edge"}, {"paperId": "9c591228c47daeb326c2e8adeaa5e30307e92972", "title": "Characterization and analysis of cloud-to-user latency: The case of Azure and AWS"}, {"paperId": "1f06b2874b0ade64aa3b2dbb5619affac45bb9d9", "title": "This paper is included in the Proceedings of the 17th USENIX Symposium on Operating Systems Design and Implementation."}]}
