{"paperId": "b376de66e0b6401db88e6a95eaaf79a14377ed26", "publicationVenue": null, "title": "Networking Architecture and Key Technologies for Human Digital Twin in Personalized Healthcare: A Comprehensive Survey", "abstract": "—Digital twin (DT), referring to a promising technique to digitally and accurately represent actual physical entities, has attracted explosive interests from both academia and industry. One typical advantage of DT is that it can be used to not only virtually replicate a system’s detailed operations but also analyze the current condition, predict the future behavior, and reﬁne the control optimization. Although DT has been widely implemented in various ﬁelds, such as smart manufacturing and transportation, its conventional paradigm is limited to embody non-living entities, e.g., robots and vehicles. When adopted in human-centric systems, a novel concept, called human digital twin (HDT) has thus been proposed. Particularly, HDT allows in silico representation of individual human body with the ability to dynamically reﬂect molecular status, physiological status, emotional and psychological status, as well as lifestyle evolutions. These prompt the expected application of HDT in personalized healthcare (PH), which can facilitate the remote monitoring, diagnosis, prescription, surgery and rehabilitation, and hence signiﬁcantly alleviate the heavy burden on the traditional health-care system. However, despite the large potential, HDT faces substantial research challenges in different aspects, and becomes an increasingly popular topic recently. In this survey, with a speciﬁc focus on the networking architecture and key technologies for HDT in PH applications, we ﬁrst discuss the differences between HDT and the conventional DTs, followed by the universal framework and essential functions of HDT. We then analyze its design requirements and challenges in PH applications. After that, we provide an overview of the networking architecture of HDT, including data acquisition layer, data communication layer, computation layer, data management layer and data analysis and decision making layer. Besides reviewing the key technologies for implementing such networking architecture in detail, we conclude this survey by presenting future research directions of HDT.", "venue": "", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": null, "journal": null, "authors": [{"authorId": "2108327012", "name": "Jiayuan Chen"}, {"authorId": "2285883888", "name": "Member Ieee Changyan Yi"}, {"authorId": "2277008001", "name": "M. I. Samuel D. Okegbile"}, {"authorId": "2277011353", "name": "Senior Member Ieee Jun Cai"}, {"authorId": "2276424516", "name": "Fellow Ieee Sherman Shen"}, {"authorId": "2287612932", "name": "X. Shen"}], "citations": []}
