{"paperId": "b37f3cf718c119b36474b7776e6735ddbc7e38c9", "publicationVenue": null, "title": "Heter-Train: A Distributed Training Framework Based on Semi-Asynchronous Parallel Mechanism for Heterogeneous Intelligent Transportation Systems", "abstract": "Transportation big data (TBD) are increasingly combined with artificial intelligence to mine novel patterns and information due to the powerful representational capabilities of deep neural networks (DNNs), especially for anti-COVID19 applications. The distributed cloud-edge-vehicle training architecture has been applied to accelerate DNNs training while ensuring low latency and high privacy for TBD processing. However, multiple intelligent devices (e.g., intelligent vehicles, edge computing chips at base stations) and different networks in intelligent transportation systems lead to computing power and communication heterogeneity among distributed nodes. Existing parallel training mechanisms perform poorly on heterogeneous cloud-edge-vehicle clusters. The synchronous parallel mechanism may force fast workers to wait for the slowest worker for synchronization, thus wasting their computing power. The asynchronous mechanism has communication bottlenecks and can exacerbate the straggler problem, causing increased training iterations and even incorrect convergence. In this paper, we introduce a distributed training framework, Heter-Train. First, a communication-efficient semi-asynchronous parallel mechanism (SAP-SGD) is proposed, which can take full advantage of acceleration effect of asynchronous strategy on heterogeneous training and constrain the straggler problem by using global interval synchronization. Second, Considering the difference in node bandwidth, we design a solution for heterogeneous communication. Moreover, a novel weighted aggregation strategy is proposed to aggregate the model parameters with different versions. Finally, experimental results show that our proposed strategy can achieve up to $6.74 \\times $ speedups on training time, with almost no accuracy decrease.", "venue": "IEEE transactions on intelligent transportation systems (Print)", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-01-01", "journal": {"name": "IEEE Transactions on Intelligent Transportation Systems", "pages": "959-972", "volume": "25"}, "authors": [{"authorId": "2052582557", "name": "J. Geng"}, {"authorId": "2109908515", "name": "Jing Cao"}, {"authorId": "2113238065", "name": "Haipeng Jia"}, {"authorId": "3089860", "name": "Zongwei Zhu"}, {"authorId": "34156666", "name": "Haijie Fang"}, {"authorId": "2987436", "name": "Chengxi Gao"}, {"authorId": "2153008353", "name": "Cheng Ji"}, {"authorId": "1803557", "name": "Gangyong Jia"}, {"authorId": "2069677071", "name": "Guangjie Han"}, {"authorId": "8453780", "name": "Xuehai Zhou"}], "citations": []}
