{"paperId": "b3809b4ba35d882a95c7662d997fe2f577a62789", "publicationVenue": {"id": "6553ce9d-f705-4922-a815-f2812f0f8978", "name": "International Symposium on Spatial and Temporal Databases", "type": "conference", "alternate_names": ["SSTD", "Symposium on Large Spatial Databases", "Int Symp Spat Temporal Database", "Symp Large Spat Database"], "url": "https://link.springer.com/conference/ssd"}, "title": "Significant DBSCAN towards Statistically Robust Clustering", "abstract": "Given a collection of geo-distributed points, we aim to detect statistically significant clusters of varying shapes and densities. Spatial clustering has been widely used many important societal applications, including public health and safety, transportation, environment, etc. The problem is challenging because many application domains have low-tolerance to false positives (e.g., falsely claiming a crime cluster in a community can have serious negative impacts on the residents) and clusters often have irregular shapes. In related work, the spatial scan statistic is a popular technique that can detect significant clusters but it requires clusters to have certain predefined shapes (e.g., circles, rings). In contrast, density-based methods (e.g., DBSCAN) can find clusters of arbitrary shape efficiently but do not consider statistical significance, making them susceptible to spurious patterns. To address these limitations, we first propose a modeling of statistical significance in DBSCAN based clustering. Then, we propose a baseline Monte Carlo method to estimate the significance of clusters and a Dual-Convergence algorithm to accelerate the computation. Experiment results show that significant DBSCAN is very effective in removing chance patterns and the Dual-Convergence algorithm can greatly reduce execution time.", "venue": "International Symposium on Spatial and Temporal Databases", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2019-08-19", "journal": {"name": "Proceedings of the 16th International Symposium on Spatial and Temporal Databases"}, "authors": [{"authorId": "46269169", "name": "Yiqun Xie"}, {"authorId": "145072875", "name": "S. Shekhar"}], "citations": [{"paperId": "9ad43a9470d7198782a9eee8100c2805930acaf9", "title": "Defect detection of glassivation passivation parts wafer surface with random texture and different brightness"}, {"paperId": "8aa2000d11f56b2b4595de5de52fbfa04d40167c", "title": "Enhanced Robust Fuzzy K-Means Clustering joint ℓ0-norm constraint"}, {"paperId": "b1887f9635464eecb796904e10a75ea491bbb715", "title": "A Comparative Analysis of Machine Learning Techniques for Exploring Country Clustering Based on Life Expectancy"}, {"paperId": "2f99f6523a1f4e57555303118372d6a3accbe683", "title": "Towards Responsible Spatial Data Science and Geo-AI"}, {"paperId": "af1a16c213d7637dcace4b843710cfd2b0896cea", "title": "Spatial Computing Opportunities in Biomedical Decision Support: The Atlas-EHR Vision"}, {"paperId": "919ea0a7dffa53799dc25e2ac235ed02fee65b8e", "title": "A Case Study on Periodic Spatio- Temporal Hotspot Detection in Azure Traffic Data"}, {"paperId": "18b983c3cde54f42493edad09a1579b8b8534721", "title": "Most significant hotspot detection using improved particle swarm optimizers"}, {"paperId": "6721dc20caee8a62bb76ac19d78633987865f351", "title": "netANOVA: novel graph clustering technique with significance assessment via hierarchical ANOVA"}, {"paperId": "48981e6193d7fe2599c85359270b859007f5c0b4", "title": "Spatiotemporal Data Mining: A Survey"}, {"paperId": "1366937e67dc9253f4d971c28c2dcd4092bb96ed", "title": "Rapid surveillance of COVID-19 by timely detection of geographically robust, alive and emerging hotspots using Particle Swarm Optimizer"}, {"paperId": "f14cc5eee08ccff1e9e74430469426b7d985d58a", "title": "Density-Based Spatial Anomalous Window Discovery"}, {"paperId": "4a338ff98cf007c821bd253febe3d6195a49b0d4", "title": "Discovering Mixture-Based Best Regions of Arbitrary Shapes"}, {"paperId": "f1bf58afa87450c4af97634183b2de9fddaa5f16", "title": "Significant DBSCAN+: Statistically Robust Density-based Clustering"}, {"paperId": "04ab695a739c835d6a85656a2dc764c6b874b373", "title": "What is special about spatial data science and Geo-AI?"}, {"paperId": "4faf645c02aa4d53d8a0221f38ef6630f81ef039", "title": "Identification of the distribution village maturation: Village classification using Density-based spatial clustering of applications with noise"}, {"paperId": "c9c3f4400d091aba2a29c8b32d66291e3eb16779", "title": "Statistically-Robust Clustering Techniques for Mapping Spatial Hotspots: A Survey"}, {"paperId": "312f618c303b55a22f8b41b0fa22ae479ba80133", "title": "Discovering regions of anomalous spatial co-locations"}, {"paperId": "0ba21e27e0fc5f3f90136c0ad97620605bc6d605", "title": "Significant lagrangian linear hotspot discovery"}, {"paperId": "6f42753c66edcbe86e3fc2e9ddee2fc97e702943", "title": "Discovering Spatial Mixture Patterns of Interest"}, {"paperId": "47798e0e62f2de23ba6f5ebcc77c481b862cb781", "title": "COVID-GAN: Estimating Human Mobility Responses to COVID-19 Pandemic through Spatio-Temporal Conditional Generative Adversarial Networks"}, {"paperId": "bdf2d7fd01d4c3bc2fdd83d83c30c988bfc7801b", "title": "A Unified Framework for Robust and Efficient Hotspot Detection in Smart Cities"}, {"paperId": "4b00990c0ace35a7e5cb317b127506592b664e2d", "title": "OFFLINE HOTSPOT ANALYSIS OVER ROAD NETWORK TRAJECTORIES POSTGRADUATE"}, {"paperId": "a6662dd205f1e023ca1bda36998a22c7dde4a143", "title": "A Statistical Clustering Approach: Mapping Population Indicators Through Probabilistic Analysis in Aceh Province, Indonesia"}]}
