{"paperId": "b39770fc694fa2315056a05820ef95a7836bdb9b", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "A Virtual Reality Tool for Representing, Visualizing and Updating Deep Learning Models", "abstract": "Deep learning is ubiquitous, but its lack of transparency limits its impact on several potential application areas. We demonstrate a virtual reality tool for automating the process of assigning data inputs to different categories. A dataset is represented as a cloud of points in virtual space. The user explores the cloud through movement and uses hand gestures to categorise portions of the cloud. This triggers gradual movements in the cloud: points of the same category are attracted to each other, different groups are pushed apart, while points are globally distributed in a way that utilises the entire space. The space, time, and forces observed in virtual reality can be mapped to well-defined machine learning concepts, namely the latent space, the training epochs and the backpropagation. Our tool illustrates how the inner workings of deep neural networks can be made tangible and transparent. We expect this approach to accelerate the autonomous development of deep learning applications by end users in novel areas.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-24", "journal": {"name": "ArXiv", "volume": "abs/2305.15353"}, "authors": [{"authorId": "9627757", "name": "H. Kath"}, {"authorId": "2218814099", "name": "Bengt Luers"}, {"authorId": "2293439", "name": "Thiago S. Gouvêa"}, {"authorId": "1696663", "name": "Daniel Sonntag"}], "citations": [{"paperId": "49cef19082feb0ca8d281ea710c86447e5768d6c", "title": "Interactive Machine Learning Solutions for Acoustic Monitoring of Animal Wildlife in Biosphere Reserves"}, {"paperId": "59f0b37c09a906960ccd205705e85fbef1e59b1a", "title": "U SING A UGMENTED R EALITY I NTERFACES FOR A RTIFICIAL I NTELLIGENCE S YSTEMS"}]}
