{"paperId": "b398e384995488081cf6a92c33ef30150f00b439", "publicationVenue": {"id": "43893b55-fde6-4e2b-9d2e-c15a669a1f94", "name": "ACM Symposium on Parallelism in Algorithms and Architectures", "type": "conference", "alternate_names": ["SPAA", "ACM Symposium on Parallel Algorithms and Architectures", "ACM Symp Parallelism Algorithm Archit", "ACM Symp Parallel Algorithm Archit"], "url": "http://www.spaa-conference.org/"}, "title": "On Parallel k-Center Clustering", "abstract": "We consider the classic k-center problem in a parallel setting, on the low-local-space Massively Parallel Computation (MPC) model, with local space per machine of O (nδ), where δ ∈ (0,1) is an arbitrary constant. As a central clustering problem, the k-center problem has been studied extensively. Still, until very recently, all parallel MPC algorithms have been requiring Ω(k) or even Ω(knδ) local space per machine. While this setting covers the case of small values of k, for a large number of clusters these algorithms require large local memory, making them poorly scalable. The case of large k,k ≥ Ω(nδ), has been considered recently for the low-local-space MPC model by Bateni et al. (2021), who gave an O (log log n)-round MPC algorithm that produces k(1 + ο (1)) centers whose cost has multiplicative approximation of O (log log log n). In this paper we extend the algorithm of Bateni et al. and design a low-local-space MPC algorithm that in O (log log n) rounds returns a clustering with k(1 + ο(1)) clusters that is an O (log*n)-approximation for k-center.", "venue": "ACM Symposium on Parallelism in Algorithms and Architectures", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2023-04-12", "journal": {"name": "Proceedings of the 35th ACM Symposium on Parallelism in Algorithms and Architectures"}, "authors": [{"authorId": "8658641", "name": "Samantha R. Coy"}, {"authorId": "1717169", "name": "A. Czumaj"}, {"authorId": "29619928", "name": "Gopinath Mishra"}], "citations": [{"paperId": "bdcace7e81152f74997a8a295b7921242fa2e25d", "title": "Fully Scalable MPC Algorithms for Clustering in High Dimension"}, {"paperId": "9d41b2ec472a399bce45ad7fb567a4777cfc99ec", "title": "Massively Parallel Algorithms for the Stochastic Block Model"}]}
