{"paperId": "b39a789dadc9e755f7022c0b5dcb3d9230fdf9ab", "publicationVenue": {"id": "a0edb93b-1e95-4128-a295-6b1659149cef", "name": "Knowledge Discovery and Data Mining", "type": "conference", "alternate_names": ["KDD", "Knowl Discov Data Min"], "url": "http://www.acm.org/sigkdd/"}, "title": "Binary Classifier Evaluation on Unlabeled Segments using Inverse Distance Weighting with Distance Learning", "abstract": "Binary classification models are ubiquitous, and reliably measuring their performance is critical for their proper usage. Ideally, the performance of supervised models is measured using high-quality labeled datasets that are sufficiently large and representative of the population. However, obtaining labels for all segments of the population can be difficult, and model performance typically varies across different segments of the population (e.g., in different countries). In this work, we present a novel methodology to estimate the performance of a binary classifier in segments of the population where labels are unavailable. The main idea is that if two segments are \"similar,'' then the performance of the classifier in these two segments would also be \"similar.'' Specifically, we define a way to measure similarity between segments, and propose a statistical model that describes the performance of the model in unlabeled segments as a function of the performance in labeled segments. With extensive numerical experiments on synthetic and real-world datasets, we demonstrate that the proposed method substantially improves over existing methods in both estimation accuracy and computational efficiency. We also showcase the application of our method on the Instagram Adult Classifier to improve the geographic coverage and usability of the model.", "venue": "Knowledge Discovery and Data Mining", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2023-08-04", "journal": {"name": "Proceedings of the 29th ACM SIGKDD Conference on Knowledge Discovery and Data Mining"}, "authors": [{"authorId": "2227553842", "name": "Xu Chen"}, {"authorId": "3118420", "name": "Katerina Marazopoulou"}, {"authorId": "2227585865", "name": "Wesley Lee"}, {"authorId": "2227554497", "name": "Christine Agarwal"}, {"authorId": "2158658677", "name": "Jason Sukumaran"}, {"authorId": "2870302", "name": "A. Hofleitner"}], "citations": []}
