{"paperId": "b3a30530b68e0a413b21fd1412bd97b48597feea", "publicationVenue": {"id": "68728e39-569f-412d-9bb9-59150b16b45c", "name": "Proceedings of the Design Society", "alternate_names": ["Proc Des Soc"], "issn": "2732-527X"}, "title": "PARAMETRIC COST MODELLING OF COMPONENTS FOR TURBOMACHINES: PRELIMINARY STUDY", "abstract": "Abstract The ever-increasing competitiveness, due to the market globalisation, has forced the industries to modify their design and production strategies. Hence, it is crucial to estimate and optimise costs as early as possible since any following changes will negatively impact the redesign effort and lead time. This paper aims to compare different parametric cost estimation methods that can be used for analysing mechanical components. The current work presents a cost estimation methodology which uses non-historical data for the database population. The database is settled using should cost data obtained from analytical cost models implemented in a cost estimation software. Then, the paper compares different parametric cost modelling techniques (artificial neural networks, deep learning, random forest and linear regression) to define the best one for industrial components. Such methods have been tested on 9 axial compressor discs, different in dimensions. Then, by considering other materials and batch sizes, it was possible to reach a training dataset of 90 records. From the analysis carried out in this work, it is possible to conclude that the machine learning techniques are a valid alternative to the traditional linear regression ones.", "venue": "Proceedings of the Design Society", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-07-27", "journal": {"name": "Proceedings of the Design Society", "pages": "2379 - 2388", "volume": "1"}, "authors": [{"authorId": "101291285", "name": "F. Campi"}, {"authorId": "3064219", "name": "M. Mandolini"}, {"authorId": "2122139750", "name": "F. Santucci"}, {"authorId": "49542071", "name": "C. Favi"}, {"authorId": "2307803", "name": "M. Germani"}], "citations": [{"paperId": "7a626cbc1983657be5a67f61797e02c0aa02a12f", "title": "Advantages and Suitability of the Activity Based Costing Method. A Study from the Engineering Industry"}, {"paperId": "37dda0543197e3bb5e03cf2ce1ecfd416b7df30f", "title": "MACHINE LEARNING FOR PARAMETRIC COST ESTIMATION OF AXISYMMETRIC COMPONENTS"}, {"paperId": "cf55347ad01cc69937e8bdb379e5eca7e962910b", "title": "ADVANTAGES AND SUITABILITY OF ACTIVITY-BASED COSTING: A STUDY FROM ENGINEERING INDUSTRY"}]}
