{"paperId": "b3c32a70a1f650be6d9b6749145b8b985000b2b4", "publicationVenue": {"id": "25a655e4-17da-4bfc-a246-5cd20202068d", "name": "Frontiers in Microbiology", "type": "journal", "alternate_names": ["Front Microbiol"], "issn": "1664-302X", "url": "http://www.frontiersin.org/cellular_and_infection_microbiology/about", "alternate_urls": ["https://www.frontiersin.org/journals/microbiology", "http://www.frontiersin.org/microbiology", "http://journal.frontiersin.org/journal/microbiology"]}, "title": "Evaluation of MALDI–TOF Mass Spectrometry in Diagnostic and Environmental Surveillance of Legionella Species: A Comparison With Culture and Mip-Gene Sequencing Technique", "abstract": "Legionella spp. are widespread bacteria in aquatic environments with a growing impact on human health. Between the 61 species, Legionella pneumophila is the most prevalent in human diseases; on the contrary, Legionella non-pneumophila species are less detected in clinical diagnosis or during environmental surveillance due to their slow growth in culture and the absence of specific and rapid diagnostic/analytical tools. Reliable and rapid isolate identification is essential to estimate the source of infection, to undertake containment measures, and to determine clinical treatment. Matrix-assisted laser desorption ionization–time-of-flight mass spectrometry (MALDI–TOF MS), since its introduction into the routine diagnostics of laboratories, represents a widely accepted method for the identification of different bacteria species, described in a few studies on the Legionella clinical and environmental surveillance. The focus of this study was the improvement of MALDI–TOF MS on Legionella non-pneumophila species collected during Legionella nosocomial and community surveillance. Comparative analysis with cultural and mip-gene sequencing results was performed. Moreover, a phylogenetic analysis was carried out to estimate the correlations amongst isolates. MALDI–TOF MS achieved correct species-level identification for 45.0% of the isolates belonging to the Legionella anisa, Legionella rubrilucens, Legionella feeleii, and Legionella jordanis species, displaying a high concordance with the mip-gene sequencing results. In contrast, less reliable identification was found for the remaining 55.0% of the isolates, corresponding to the samples belonging to species not yet included in the database. The phylogenetic analysis showed relevant differences inside the species, regruped in three main clades; among the Legionella anisa clade, a subclade with a divergence of 3.3% from the main clade was observed. Moreover, one isolate, identified as Legionella quinlivanii, displayed a divergence of 3.8% from the corresponding reference strain. However, these findings require supplementary investigation. The results encourage the implementation of MALDI–TOF MS in routine diagnostics and environmental Legionella surveillance, as it displays a reliable and faster identification at the species level, as well as the potential to identify species that are not yet included in the database. Moreover, phylogenetic analysis is a relevant approach to correlate the isolates and to track their spread, especially in unconventional reservoirs, where Legionella prevention is still underestimated.", "venue": "Frontiers in Microbiology", "year": 2020, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-12-15", "journal": {"name": "Frontiers in Microbiology", "volume": "11"}, "authors": [{"authorId": "134450877", "name": "M. R. Pascale"}, {"authorId": "66208817", "name": "Marta Mazzotta"}, {"authorId": "153130513", "name": "Silvano Salaris"}, {"authorId": "66945189", "name": "Luna Girolamini"}, {"authorId": "5294945", "name": "A. Grottola"}, {"authorId": "39148285", "name": "M. L. Simone"}, {"authorId": "12127827", "name": "M. Cordovana"}, {"authorId": "10375470", "name": "F. Bisognin"}, {"authorId": "49411440", "name": "P. Dal Monte"}, {"authorId": "1909700649", "name": "M. A. Bucci Sabattini"}, {"authorId": "35998510", "name": "M. Viggiani"}, {"authorId": "7678687", "name": "S. Cristino"}], "citations": [{"paperId": "d4fb7e9328ac80625755c8ffe9296cdb9bd77257", "title": "Characterization of a Novel Species of Legionella Isolated from a Healthcare Facility: Legionella resiliens sp. nov"}, {"paperId": "0e5459c270651c2ac5224ff31d62ead473b69b6e", "title": "Evaluating Fourier-transform infrared spectroscopy with IR Biotyper as a faster and simpler method for investigating the sources of an outbreak of legionellosis."}, {"paperId": "99c3f203aa7c1586a0b92a4cde63702153f0bc28", "title": "Water Safety Plan, Monochloramine Disinfection and Extensive Environmental Sampling Effectively Control Legionella and Other Waterborne Pathogens in Nosocomial Settings: The Ten-Year Experience of an Italian Hospital"}, {"paperId": "27cbbfc901c5cc829040c2c49fc00ace377a83b3", "title": "First water safety plan approach applied to a Dental Clinic complex: identification of new risk factors associated with Legionella and P. aeruginosa contamination, using a novel sampling, maintenance and management program"}, {"paperId": "7d39ec210c3fd8738efdd61dd7b10d53627c140d", "title": "A multi-center validation study on the discrimination of Legionella pneumophila sg.1, Legionella pneumophila sg. 2-15 and Legionella non-pneumophila isolates from water by FT-IR spectroscopy"}, {"paperId": "409da2b4f35b3ee93abdb9eb1cfdea0fcffc2f41", "title": "Legionella anisa or Legionella bozemanii? Traditional and molecular techniques as support in the environmental surveillance of a hospital water network"}, {"paperId": "bf89b33306a2d69fb113d3c75e409370e3aa0574", "title": "Genomic characterization and assessment of pathogenic potential of Legionella spp. isolates from environmental monitoring"}, {"paperId": "0978ded7ecb222f121e6be59e1cb2f4e40a07665", "title": "Clinical and Laboratory Diagnosis of Legionella Pneumonia"}, {"paperId": "18620b1c676974f6eb19990acd3df24a891bcd76", "title": "Strain-Level Characterization of Legionella Environmental Isolates via MALDI-TOF-MS"}, {"paperId": "986724c98f893ff3e53a4dd53f883ae24bda6f3d", "title": "Recent Studies on Advance Spectroscopic Techniques for the Identification of Microorganisms: A Review"}, {"paperId": "d656dab5ffd34fec5e50ba98fa50b5c14581f1d6", "title": "“Omic” Approaches to Bacteria and Antibiotic Resistance Identification"}, {"paperId": "fb30ba823da3575f8ca992cde404f93463181d7e", "title": "Evaluation of a Most Probable Number Method for Detection and Quantification of Legionella pneumophila"}, {"paperId": "9b795dd546ee0e023496f5644098d2ada9cda2ee", "title": "Combining Traditional and Molecular Techniques Supports the Discovery of a Novel Legionella Species During Environmental Surveillance in a Healthcare Facility"}, {"paperId": "b645b399d133ff643bc195c2953e157c97c3426d", "title": "Use of Fourier-Transform Infrared Spectroscopy With IR Biotyper® System for Legionella pneumophila Serogroups Identification"}, {"paperId": "6dbaa85e0cf373166d99bf6928a4e0aff20b02e2", "title": "Application of MALDI-TOF MS for identification of environmental bacteria: A review."}, {"paperId": "c7e50d195278bb90eb383ef0a4a5b3fbb045232a", "title": "Sample preparation and culture condition effects on MALDI-TOF MS identification of bacteria: A review."}, {"paperId": "aaa0749a57c0fb2d0b170b1f5e575a3c8b4f8585", "title": "Assessing direct analysis in real‐time mass spectrometry for the identification and serotyping of Legionella pneumophila"}, {"paperId": "de3f018221ddc56e73bd9fb464ab5910372c424e", "title": "Legionella and other opportunistic pathogens in full-scale chloraminated municipal drinking water distribution systems."}, {"paperId": "80ffda19853c1f60b56920045fba33468fb46834", "title": "Modern Analytical Techniques for Detection of Bacteria in Surface and Wastewaters"}]}
