{"paperId": "b3c52c7906a3c5410aa17a6b911b6a214fb45f01", "publicationVenue": {"id": "e2acdbdd-8665-4181-be7e-b7d710482fe5", "name": "International Journal of Cloud Applications and Computing", "type": "journal", "alternate_names": ["Int J Cloud Appl Comput"], "issn": "2156-1834", "url": "http://www.igi-global.com/ijcac"}, "title": "A Novel Meta-Information Management System for SaaS", "abstract": "Cloud hosts numerous services with various underlying business logic and data stores. In this multifaceted and distributed environment locating or updating SaaS services is a crucial task. Researchers proposed various mechanism for this purpose, which involves accessing or altering the meta-information of the services, its underlying business logics. Thus, management of meta-information is crucial for SaaS services. It demands efficient categorization and cataloguing mechanism by preserving semantic-relationships among interrelated services, business processes and data sources. This article proposes a flexible and scalable meta-information management system for SaaS, capable of maintaining dependencies among various SaaS resources. It is useful towards identification of interrelated business processes, services and data sources and facilitates incremental update of meta-information. The proposed system is implemented using Hadoop and a series of experiments have been carried out, which shows that it can efficiently scale and effectively categorize and catalogue different SaaS resources.", "venue": "International Journal of Cloud Applications and Computing", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-07-01", "journal": {"name": "Int. J. Cloud Appl. Comput.", "pages": "1-21", "volume": "9"}, "authors": [{"authorId": "32955852", "name": "A. K. Mandal"}, {"authorId": "144341858", "name": "A. Sarkar"}], "citations": [{"paperId": "68d77a800f296f9b8dc2e25ffdbcafd210882738", "title": "SAAS parallel task scheduling based on cloud service flow load algorithm"}, {"paperId": "06365926913bbdc5d0b278f49e54cd63f1e4974d", "title": "Defense mechanisms against DDoS attack based on entropy in SDN-cloud using POX controller"}, {"paperId": "ed3a1f7516c912a1e557ac68db5f48bab3b22a31", "title": "A Framework for Providing Security for Cloud SaaS Model through an Enhanced Sea Lion Optimization Algorithm"}, {"paperId": "d2569e29386db02237f51f2775722e4d8d49f518", "title": "Dynamic Meta-Information Management for IoT-based Applications"}]}
