{"paperId": "b3cdc329a8516e4d3ddc6e63b439df64867faf8e", "publicationVenue": {"id": "7d930c15-deaf-4d79-bdc9-578536903860", "name": "Wirtschaftsinformatik", "type": "journal", "alternate_names": ["Wirtschaftsinformatik und Angewandte Informatik", "Wirtsch Angew Inform"], "issn": "0937-6429", "alternate_issns": ["1861-8936"], "url": "https://link.springer.com/journal/11576", "alternate_urls": ["http://www.bise-journal.org/"]}, "title": "Development of a Conceptual Framework for Machine Learning Applications in Brick-and-Mortar Stores", "abstract": ". The growing prevalence and impact of e-commerce puts traditional brick-and-mortar stores under pressure. More and more customers prefer the variety of goods, easily comparable prices, and personalized recommendations online to conventional shopping experiences in stationary retail. A major asset of online stores is their potential to collect, analyze, and interpret data. The collection and analysis of customer behavior and transaction data to improve website design, the assortment, and pricing strategies  so-called ‘ web analytics ’  are common practice in e-commerce for more than fifteen years already. Advancements in technologies and the ongoing digitalization of brick-and-mortar stores unveil the potential of Retail Analytics for conventional stores as well. Yet, a structured overview of diverse factors relevant for implementing Retail Analytics is missing. In light of this context, this article derives a conceptual framework harmonizing the relations between different technologies, collected data, analysis methods, method outputs, and application purposes.", "venue": "Wirtschaftsinformatik", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2020-03-09", "journal": {"pages": "225-241"}, "authors": [{"authorId": "143653849", "name": "J. Becker"}, {"authorId": "2113612538", "name": "K. Müller"}, {"authorId": "2078462363", "name": "Ann-Kristin Cordes"}, {"authorId": "2257872285", "name": "Max Patrick Hartmann"}, {"authorId": "1830387092", "name": "Lasse von Lojewski"}], "citations": []}
