{"paperId": "b3d7bb1706e6a254fad9e79c50277d7d621ebf77", "publicationVenue": {"id": "fe526af8-da0b-4a52-925c-e0e345537a7e", "name": "International Conference on Wireless Communications and Signal Processing", "type": "conference", "alternate_names": ["Int Conf Wirel Commun Signal Process", "WCSP"], "url": "http://www.ic-wcsp.org/"}, "title": "Aerial Computing Offloading by Distributed Deep Learning in Collaborative Satellite-terrestrial Networks", "abstract": "With the rapid development of the Internet of Things (IoT) and its derivative technologies such as Aerial IoT (AIoT), the number of smart devices and their computing requirements have exploded. It makes it difficult for the existing ground base stations to guarantee the user's computing requirements and low latency requirements. The edge computing architecture of orbiting satellites, which provides feasible solutions to the above challenges. In this paper, we design a computing offloading strategy for users to minimize the weighted sum of latency and energy consumption in the cloud-edge-ground three layers hybrid AIoT architecture. Tasks can be calculated locally, on the satellite side, or forwarded to the cloud computing center. Then, the collaborative satellite-terrestrial network distributed offloading algorithm(CNDO) is proposed based on parallel neural networks to give multiple optimal offloading decisions in AIoT. Experimental results show that this scheme has a better performance compared with other comparison schemes.", "venue": "International Conference on Wireless Communications and Signal Processing", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-10-20", "journal": {"name": "2021 13th International Conference on Wireless Communications and Signal Processing (WCSP)", "pages": "1-6"}, "authors": [{"authorId": "30841908", "name": "Haofei Li"}, {"authorId": "40590308", "name": "Chen Chen"}, {"authorId": "2144205950", "name": "Cong Li"}, {"authorId": "2150802003", "name": "Lei Liu"}, {"authorId": "152593447", "name": "Guan Gui"}], "citations": [{"paperId": "833509f68d2fbbc83f126d0129afc81652239b85", "title": "Applications of Distributed Machine Learning for the Internet-of-Things: A Comprehensive Survey"}, {"paperId": "7a262be88949aa158b77f303c7497ca9eee5c78c", "title": "Satellite-MEC Integration for 6G Internet of Things: Minimal Structures, Advances, and Prospects"}, {"paperId": "0037ac78cddaf88eb28ed1da88c9cc4fd9e39a89", "title": "A Comprehensive Survey on Orbital Edge Computing: Systems, Applications, and Algorithms"}, {"paperId": "dd0a1ca46bf24d4acb0971275cbbe34ea80bec7d", "title": "Revolutionizing Future Connectivity: A Contemporary Survey On AI-Empowered Satellite-Based Non-Terrestrial Networks in 6G"}, {"paperId": "b3ebb046e51383818679bfdea5f2ce5377cdee7d", "title": "Mobile Edge Computing in Space-Air-Ground Integrated Networks: Architectures, Key Technologies and Challenges"}, {"paperId": "23da8a6c1950e0a9b25a4bdee2d542780fb8c04e", "title": "Comparison of Ensemble and Federal Learning for Secure Data Collaboration in Satellite Networks"}, {"paperId": "3dcf91551e1ca4a2bb5ee8a3430891163cda45f0", "title": "A Tutorial on AI-Enabled Non-Terrestrial Networks in 6G"}]}
