{"paperId": "b3ec3d5694c45e5a665b1444d2125bcf8f06def6", "publicationVenue": {"id": "5e1f6444-5d03-48c7-b202-7f47d492aeae", "name": "IEEE Transactions on Visualization and Computer Graphics", "type": "journal", "alternate_names": ["IEEE Trans Vis Comput Graph"], "issn": "1077-2626", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=2945"}, "title": "A Visual Analytics System for Improving Attention-based Traffic Forecasting Models", "abstract": "With deep learning (DL) outperforming conventional methods for different tasks, much effort has been devoted to utilizing DL in various domains. Researchers and developers in the traffic domain have also designed and improved DL models for forecasting tasks such as estimation of traffic speed and time of arrival. However, there exist many challenges in analyzing DL models due to the black-box property of DL models and complexity of traffic data (i.e., spatio-temporal dependencies). Collaborating with domain experts, we design a visual analytics system, AttnAnalyzer, that enables users to explore how DL models make predictions by allowing effective spatio-temporal dependency analysis. The system incorporates dynamic time warping (DTW) and Granger causality tests for computational spatio-temporal dependency analysis while providing map, table, line chart, and pixel views to assist user to perform dependency and model behavior analysis. For the evaluation, we present three case studies showing how AttnAnalyzer can effectively explore model behaviors and improve model performance in two different road networks. We also provide domain expert feedback.", "venue": "IEEE Transactions on Visualization and Computer Graphics", "year": 2022, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-08-08", "journal": {"name": "IEEE Transactions on Visualization and Computer Graphics", "pages": "1102-1112", "volume": "29"}, "authors": [{"authorId": "2111028494", "name": "Seungmin Jin"}, {"authorId": "2115953420", "name": "Hyunwoo Lee"}, {"authorId": "10136905", "name": "Cheonbok Park"}, {"authorId": "2091518005", "name": "Hyeshin Chu"}, {"authorId": "1999198856", "name": "Yunwon Tae"}, {"authorId": "1795455", "name": "J. Choo"}, {"authorId": "39324835", "name": "Sungahn Ko"}], "citations": [{"paperId": "72fb18fffd852ecf5f2ea221e05e9555dae40046", "title": "TESTAM: A Time-Enhanced Spatio-Temporal Attention Model with Mixture of Experts"}, {"paperId": "71d4b2ab149ec489ea206de51be69aae0f91200f", "title": "Exploring Dynamic Time Warping for Network Traffic Analysis"}, {"paperId": "1d17e1446983f4264fbb448678de76d4ec21dd14", "title": "TCEVis: Visual analytics of traffic congestion influencing factors based on explainable machine learning"}, {"paperId": "5527b582c22a544b168abfa75d7bf02838523d3e", "title": "Cross-Domain Complementarity and Multi-Time Scale Fusion Based Resource Demand Prediction for Mobile Vehicles"}, {"paperId": "58b4c3fced4b117a35543bf1a49942d7652b232f", "title": "Visualizing the Carbon Intensity of Machine Learning Inference for Image Analysis on TensorFlow Hub"}, {"paperId": "9ba0e57a1d7b38a781d86d876aa294475800cc8a", "title": "ProtoExplorer: Interpretable Forensic Analysis of Deepfake Videos using Prototype Exploration and Refinement"}, {"paperId": "20528e7c9b637f07909878fd8d6610887c9b5aa3", "title": "Visual Analytics For Machine Learning: A Data Perspective Survey"}, {"paperId": "13e300f6ba79526a832c5e8a864e068a50e1da47", "title": "How Does Attention Work in Vision Transformers? A Visual Analytics Attempt"}, {"paperId": "746aaeb85a526e4ccf34c6fee5208ba444c16ab1", "title": "Navigating the Trade-Off Between Explainability and Privacy"}]}
