{"paperId": "b3efba6a16a72bb2df8b2cc440e003089053b47f", "publicationVenue": {"id": "c4d93587-fcb5-4ac5-945b-c9f2d8372753", "name": "Military Medicine", "type": "journal", "alternate_names": ["Mil Med", "Military medicine", "Military surgeon", "Mil surg", "Mil med"], "issn": "0096-6827", "alternate_issns": ["0026-4075", "2074-5044"], "url": "http://www.amsus.org/index.php/journal"}, "title": "Thematic Analysis of Military Medical Ethics Publications From 2000 to 2020—A Bibliometric Approach", "abstract": "ABSTRACT Introduction There has been external criticism of the compliance of military health personnel with internationally agreed principles in military medical ethics (MME). In response, a number of authors have called for clarity on the principles and topics within the domain of MME. This complements an increased acknowledgment of the need for education in MME for military health personnel. Our paper utilizes bibliometric techniques to identify key themes in MME to inform the development of a curriculum for this subject. Materials and Methods We designed a search strategy to find publications over the period January 1, 2000-December 31, 2020 in the domain of MME from the three databases, PubMed, Web of Science, and Scopus, using the search string (ethic* OR bioethics* OR moral*) AND military AND (medic* OR health*). We obtained a total of 1,115 publications after duplication removal. After exclusion based on topic, year, and study design, we analyzed a total of 633 publications using Scopus’s embedded analysis tool and the software VOSViewer. We generated a co-occurrence word map from the abstracts of each of the publications. We deduced themes of MME based on the clusters shown in the word map, and we categorized each publication into one of these themes to analyze the change of themes over time. Results We observed a 10-fold increase in annual publications on MME between 2000 and 2020. The majority of papers were written by U.S. (72%) and UK (13%) authors, although a total of 15 countries were represented. After using VOSViewer to identify co-occurring keywords in titles and abstracts from these publications, nine themes were identified: biomedical research, care to detained populations, disaster/triage, mental health, patient-focused foundations, technology, dual loyalty, education/training, and frameworks. The relative proportion of each of these themes changed over the study period, with mental health being dominant by the end. Conclusions This study has identified key themes that might inform the development of a curriculum for teaching MME. It is noticeable that the majority of themes cover MME from the perspective of professional practice on military operations; noting, the research and technology themes also pertain to the generation of knowledge for military operations. There were a limited number of publications covering practice in the non-deployed or garrison settings, and these were codified under the themes of “framework” and “dual loyalty”. The results are skewed toward English-speaking countries and exclude non-academic publications. Further work will search for other open-source information and non-English publications. To our knowledge, this exploratory bibliometric analysis on MME in the academic literature is the first of its kind. This article has demonstrated the use of bibliometric techniques to evaluate the evolution of knowledge in MME, including the identification of key themes. These will be used to support further work to develop a curriculum for the teaching of MME to military medical audiences.", "venue": "Military Medicine", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-07-31", "journal": {"name": "Military Medicine", "pages": "e837 - e845", "volume": "187"}, "authors": [{"authorId": "2121544953", "name": "Zachary Bailey"}, {"authorId": "119210984", "name": "Peter Mahoney"}, {"authorId": "119091735", "name": "Marina Miron"}, {"authorId": "143725711", "name": "M. Bricknell"}], "citations": [{"paperId": "d3951d5b14a22e0e3011c4de6ba116095904605e", "title": "Comprehensive analysis of research related to rehabilitation and COVID-19, hotspots, mapping, thematic evolution, trending topics, and future directions"}, {"paperId": "5073b5d2241b9eb92568603a3d7e031ea7512d1c", "title": "Military Healthcare Ethics: Making It Relevant to the Whole Military Care Team."}, {"paperId": "b275e88a974a8eb70db1b20e7ffb35a3104ed5a1", "title": "Non-combatant status of military medicine and contemporary warfare: old issues or new problems?"}, {"paperId": "3081f691805f3f8faa01ee715b3cbb02b01666b0", "title": "Innovation in education: the military medical ethics ‘playing cards’ and smartphone application"}, {"paperId": "49423bd7a71901013fa2de965bca295a8fc7bf92", "title": "FORMATION OF PSYCHOPHYSICAL READINESS OF CADETS DURING APPLIED EXERCISES."}]}
