{"paperId": "b4126a406b291cfdcdd8b4d18291f3faa1e6ca1d", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Autonomic Workload Performance Modeling for Large-Scale Databases and Data Warehouses Through Deep Belief Network With Data Augmentation Using Conditional Generative Adversarial Networks", "abstract": "Databases and warehouses are experiencing workload of different types such as Decision Support System (DSS), Online Transaction Processing (OLTP) and Mixed workloads. Handling variety of workload in autonomic systems is a critical task. After self-configuring the workload, the next challenge is workload performance tuning that motives towards self-predictive systems. Existing studies provide performance modeling solutions on small-scale data repositories of Database Management System (DBMS) and Data Warehouse (DWH) using either classical eager or lazy learning approaches. However, in real-world problems, we normally have to deal with large-scale data repositories. Therefore, there is a need to develop performance models that provide data augmentation to solve large-scale data repositories that are not publicly available. In this study, deep learning approaches have been investigated for performance tuning of large-scale data repositories. We propose a performance prediction model called Optimized GAN-based Deep Learning (OGDL) model. For data augmentation, Conditional Generative Adversarial Networks (CGAN) is applied. For autonomic perspective, we incorporated MAPE-K model to manage the workload autonomically. Different deep learning models are applied, and it was observed that Deep Belief Network (DBN) performed better as compared to other deep learning models such as Deep Neural Network (DNN). We performed a number of experiments and from results it is observed that deep learning models performed the best in comparison with classical machine learning and lazy learning and a $6-8\\%$ increase in accuracy is recorded in our experiments using DBN. The proposed OGDL model performed the best in workload performance predictions in an optimized way.", "venue": "IEEE Access", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "97603-97620", "volume": "9"}, "authors": [{"authorId": "2076357639", "name": "Nusrat Shaheen"}, {"authorId": "2846981", "name": "B. Raza"}, {"authorId": "2005415", "name": "A. R. Shahid"}, {"authorId": "145010235", "name": "Ahmad Kamran Malik"}], "citations": [{"paperId": "1a9f9c019c6ef064755ecc81fc5bea345ac9e957", "title": "Optimization of Data Warehouse Architecture to Improve Information System Performance"}]}
