{"paperId": "b4141c2d0036e94e7398748133c20348522e1896", "publicationVenue": {"id": "443b907e-306a-41c3-bca4-b35f1da4bb38", "name": "International Conference on Cloud Computing Technologies and Applications", "type": "conference", "alternate_names": ["Cloudtech", "Int Conf Cloud Comput Technol Appl"]}, "title": "TASMR: Towards advanced secure mapreduc framework across untrusted hybrid clouds", "abstract": "MapReduce has become increasingly popular as a programming system for distributed processing large-scale data. It is largely used daily around the world as an efficient distributed computation tool for data processing in different research areas. To deploy it as a data processing service, privacy and security of MapReduce computations and data are crucial concerns when the it is executed over hybrid clouds. To this end we must provide necessary security mechanisms to protect MapReduce data processing jobs. Thus authentication of mappers-reducers, client-user, confidentiality and integrity of data-computations and freshness of the outputs are obligatory. Fulfilling these requirements safeguard MapReduce computations and data from various types of attacks. In this paper, we discuss security challenges and requirements to shield the computations and data. Hence we present a new architecture to secure MapReduce computation upon the aforementioned challenges in a hybrid clouds. Because often the distribution is carried on public cloud the user don't have a visibility upon the infrastructure nor what is happening during the processing. In the other hand the cloud provider should secure its infrastructure against malicious users. Thus we propose a novel architecture that takes the best from SecureMR, vTPM and Semrod. The proposed architecture not only overcomes the flaws of the state-of-the-art proposed solutions, but also provides remarkable security guarantees that guard against insider and outsider threats. We also compare and analyze the security overhead and features of our model with the state-of-the-art architectures already present.", "venue": "International Conference on Cloud Computing Technologies and Applications", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2017-10-01", "journal": {"name": "2017 3rd International Conference of Cloud Computing Technologies and Applications (CloudTech)", "pages": "1-9"}, "authors": [{"authorId": "9156505", "name": "Amine Haouari"}, {"authorId": "3386300", "name": "M. Zbakh"}, {"authorId": "2947149", "name": "R. Cherkaoui"}, {"authorId": "9734962", "name": "Yassir Samadi"}, {"authorId": "30937191", "name": "Najlae Kasmi"}], "citations": [{"paperId": "34fb19dc7d7a0e57127032414c2b21ffc3a4ff9d", "title": "MATEE: multimodal attestation for trusted execution environments"}, {"paperId": "c9f40702096890f05826bd89f48cb97261a7a41a", "title": "Recent trends in applying TPM to cloud computing"}]}
