{"paperId": "b41fe36c840e200bcd1933c55d78f498f7a458fc", "publicationVenue": null, "title": "Towards a Modular Data Management System Framework", "abstract": "Today’s data management systems (DMSes) are implemented using monolithic architectures. This is explained by the fact that, historically, the DMS market was dominated by commercial solutions. However, with the advent of open source, lots of alternative DMSes and DMS components have emerged. Yet, they cannot be easily integrated because DMSes are still designed as monoliths. We pro-pose PolyDMS, our vision towards composable DMSes. The core idea of PolyDMS is to split up and wrap individual components with standardized interfaces, such that a Component Orchestrator can flexibly construct DMSes out of them. Users can compose new DMSes by writing small programs in our System Definition Language. PolyDMS allows them to quickly instantiate new DMSes according to their needs while giving them the opportunity to reuse existing components. Our proof-of-concept implementation shows that composing multiple components into a new DMS can yield additional functionality and better performance.", "venue": "CDMS@VLDB", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": null, "authors": [{"authorId": "92265606", "name": "Haralampos Gavriilidis"}, {"authorId": "2185529002", "name": "Lennart Behme"}, {"authorId": "27297406", "name": "Sokratis Papadopoulos"}, {"authorId": "48643170", "name": "S. Bortoli"}, {"authorId": "1399355221", "name": "Jorge-Arnulfo Quiané-Ruiz"}, {"authorId": "1733290", "name": "V. Markl"}], "citations": [{"paperId": "add3a51a63589d836bd35bba7f1f0510a3c7d690", "title": "XDB in Action: Decentralized Cross-Database Query Processing for Black-Box DBMSes"}, {"paperId": "2926d28109772a00b4b7eba099746e1997c20daf", "title": "P2D: A Transpiler Framework for Optimizing Data Science Pipelines"}, {"paperId": "d28df6acd26036102e74fbc4bc759ccf5c2c3eae", "title": "In-Situ Cross-Database Query Processing"}]}
