{"paperId": "b42eb18c7fb6e625e3878c92f085ef6ae8384b1c", "publicationVenue": {"id": "4293c8e8-8cd7-4be6-b8b2-69f2b4fa3259", "name": "Computer Applications in Engineering Education", "type": "journal", "alternate_names": ["Comput Appl Eng Educ"], "issn": "1061-3773", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/38664", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/10990542", "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1099-0542"]}, "title": "Quantifying deliberate practice using auto‐graded questions: Analyzing multiple metrics in a chemical engineering course", "abstract": "Interactive digital technologies provide a mechanism to capture big data for higher education faculty to monitor student progress in real‐time. By measuring both performance and perseverance using auto‐graded problems, this learning analytics research examines several tenets of deliberate practice. Specifically, online homework problems integrated into an interactive textbook for chemical engineering titled Material and Energy Balances zyBook were examined. Across three cohorts totaling over 250 students and 84,000 questions, the fraction correct, attempts before correct, and attempts after correct provided metrics to examine question type and order. Fraction correct and attempts before correct varied with statistical significance as a function of question type and order, including many differences having medium and large effect sizes. Multiple choice questions led to the highest fraction correct and the least number of attempts before correct, while questions requiring multiple numeric responses led to the lowest success and the largest number of attempts before correct. Next, multiple metrics were aggregated into a deliberate practice score, to broadly quantify problem difficulty. Fraction correct, modified correct, first quartile attempts before correct, and median attempts before correct were combined at different thresholds leading to a deliberate practice score between 0 and 8. Questions with higher deliberate practice scores were disproportionality used for practice (61% of attempts on 13% of questions); practice attempts do not receive course credit. Overall, combining metrics in a deliberate practice score exhibits the potential to optimize the length of homework assignments and give students more credit for solving more challenging auto‐graded problems.", "venue": "Computer Applications in Engineering Education", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-02-13", "journal": {"name": "Computer Applications in Engineering Education", "pages": "916 - 929", "volume": "31"}, "authors": [{"authorId": "1571849319", "name": "Kayla E. Chapman"}, {"authorId": "2196534763", "name": "Megan E. Davidson"}, {"authorId": "2206966273", "name": "Nneka Azuka"}, {"authorId": "31454678", "name": "M. Liberatore"}], "citations": [{"paperId": "f4f40b489c1f3182c28bdeaa45e23cfc84d2ba89", "title": "Reproducible High Reading Participation and Auto-Graded Homework Completion across Multiple Cohorts When Using an Interactive Textbook for Material and Energy Balances"}]}
