{"paperId": "b43117b36cf62a4821c516d72fb24949d4441001", "publicationVenue": {"id": "a00fde74-d8df-4613-b825-0fff9f531d3f", "name": "IEEE Transactions on Network and Service Management", "type": "journal", "alternate_names": ["IEEE Trans Netw Serv Manag"], "issn": "1932-4537", "url": "http://ejournals.ebsco.com/direct.asp?JournalID=714200", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4275028", "http://ieeexplore.ieee.org/servlet/opac?punumber=4275028"]}, "title": "Interpretable Feature Learning in Multivariate Big Data Analysis for Network Monitoring", "abstract": "There is an increasing interest in the development of new data-driven models useful to assess the performance of communication networks. For many applications, like network monitoring and troubleshooting, a data model is of little use if it cannot be interpreted by a human operator. In this paper, we present an extension of the Multivariate Big Data Analysis (MBDA) methodology, a recently proposed interpretable data analysis tool. In this extension, we propose a solution to the automatic derivation of features, a cornerstone step for the application of MBDA when the amount of data is massive. The resulting network monitoring approach allows us to detect and diagnose disparate network anomalies, with a data-analysis workflow that combines the advantages of interpretable and interactive models with the power of parallel processing. We apply the extended MBDA to two case studies: UGR'16, a benchmark flow-based real-traffic dataset for anomaly detection, and Dartmouth'18, the longest and largest Wi-Fi trace known to date.", "venue": "IEEE Transactions on Network and Service Management", "year": 2019, "fieldsOfStudy": ["Computer Science", "Mathematics"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-07-05", "journal": {"name": "IEEE Transactions on Network and Service Management"}, "authors": [{"authorId": "2055058495", "name": "J. Camacho"}, {"authorId": "1728410", "name": "K. Wasielewska"}, {"authorId": "144607960", "name": "R. Bro"}, {"authorId": "143980068", "name": "D. Kotz"}], "citations": [{"paperId": "6483cec9a20c637cad74cb6cce3292b4cbf31bfe", "title": "Generating a Mobility-Pattern Database for Urban Traffic Monitoring Using Distributed Acoustic Sensing"}]}
