{"paperId": "b457420de8383a6d2c5003ee9ba4c4345700c2da", "publicationVenue": {"id": "2baad992-2268-4c38-9120-e453622f2eeb", "name": "Journal of Medical Internet Research", "type": "journal", "alternate_names": ["J Med Internet Res"], "issn": "1438-8871", "url": "http://www.symposion.com/jmir/index.htm", "alternate_urls": ["http://www.jmir.org/", "https://www.jmir.org/"]}, "title": "Exploring Language Used in Posts on r/birthcontrol: Case Study Using Data From Reddit Posts and Natural Language Processing to Advance Contraception Research", "abstract": "Background Contraceptive choice is central to reproductive autonomy. The internet, including social networking sites like Reddit, is an important resource for people seeking contraceptive information and support. A subreddit dedicated to contraception, r/birthcontrol, provides a platform for people to post about contraception. Objective This study explored the use of r/birthcontrol, from the inception of the subreddit through the end of 2020. We describe the web-based community, identify distinctive interests and themes based upon the textual content of posts, and explore the content of posts with the most user engagement (ie, “popular” posts). Methods Data were obtained from the PushShift Reddit application programming interface from the establishment of r/birthcontrol to the start date of analysis (July 21, 2011, to December 31, 2020). User interactions within the subreddit were analyzed to describe community use over time, specifically the commonality of use based on the volume of posts, the length of posts (character count), and the proportion of posts with any and each flair applied. “Popular” posts on r/birthcontrol were determined based on the number of comments and “scores,” or upvotes minus downvotes; popular posts had 9 comments and a score of ≥3. Term Frequency-Inverse Document Frequency (TF-IDF) analyses were run on all posts with flairs applied, posts within each flair group, and popular posts within each flair group to characterize and compare the distinctive language used in each group. Results There were 105,485 posts to r/birthcontrol during the study period, with the volume of posts increasing over time. Within the time frame for which flairs were available on r/birthcontrol (after February 4, 2016), users applied flairs to 78% (n=73,426) of posts. Most posts contained exclusively textual content (n=66,071, 96%), had comments (n=59,189, 86%), and had a score (n=66,071, 96%). Posts averaged 731 characters in length (median 555). “SideEffects!?” was the most frequently used flair overall (n=27,530, 40%), while “Experience” (n=719, 31%) and “SideEffects!?” (n=672, 29%) were most common among popular posts. TF-IDF analyses of all posts showed interest in contraceptive methods, menstrual experiences, timing, feelings, and unprotected sex. While TF-IDF results for posts with each flair varied, the contraceptive pill, menstrual experiences, and timing were discussed across flair groups. Among popular posts, intrauterine devices and contraceptive use experiences were often discussed. Conclusions People commonly wrote about contraceptive side effects and experiences using methods, highlighting the value of r/birthcontrol as a space to post about aspects of contraceptive use that are not well addressed by clinical contraceptive counseling. The value of real-time, open-access data on contraceptive users’ interests is especially high given the shifting landscape of and increasing constraints on reproductive health care in the United States.", "venue": "Journal of Medical Internet Research", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-02-07", "journal": {"name": "Journal of Medical Internet Research", "volume": "25"}, "authors": [{"authorId": "1456177143", "name": "E. Pleasants"}, {"authorId": "51259369", "name": "Julia Ryan"}, {"authorId": "2064255361", "name": "Cheng Ren"}, {"authorId": "5485134", "name": "N. Prata"}, {"authorId": "30596924", "name": "A. Gomez"}, {"authorId": "40591948", "name": "Cassondra J Marshall"}], "citations": [{"paperId": "dc3ce3d07337b16ecd94056d6f5473212d17aca5", "title": "Prognostication of the Termination of Contraceptive Utilization: An In-depth Analysis"}]}
