{"paperId": "b46901708287c21011e140b90742bb6ec55f95ce", "publicationVenue": {"id": "9704c32e-4051-4155-95f8-dcb3c01abc51", "name": "Interactive Learning Environments", "type": "journal", "alternate_names": ["Interact Learn Environ"], "issn": "1049-4820", "url": "http://www.informaworld.com/1744-5191", "alternate_urls": ["http://www.tandfonline.com/loi/nile20"]}, "title": "Decision application mechanism of regression analysis of multi-category learning behaviors in interactive learning environment", "abstract": "ABSTRACT The research of multi-category learning behaviors is a hot issue in interactive learning environment, and there are many challenges in data statistics and relationship modeling. We select the massive learning behaviors data of multiple periods and courses and study the decision application of regression analysis. First, based on the definition of data structure and relationship features, the data are normalized; secondly, a multi-category learning behavior prediction process is designed, the results of the data analysis are effective; computer program and Geoda are used for decision analysis, and the multiple regression equation of learning behaviors is constructed, so as to achieve the feasible prediction direction and effective decision trend. The decision application mechanism is a useful method to study multi-category learning behaviors, which can be referenced by model design and technology application for interactive learning environment.", "venue": "Interactive Learning Environments", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-04-23", "journal": {"name": "Interactive Learning Environments", "pages": "3042 - 3054", "volume": "31"}, "authors": [{"authorId": "1807986", "name": "Xiaona Xia"}], "citations": [{"paperId": "0983a36da068244f76db5f8c62b4fe9feee7e0c0", "title": "Driving STEM learning effectiveness: dropout prediction and intervention in MOOCs based on one novel behavioral data analysis approach"}, {"paperId": "04f8284b9c8bb5d811d768bab953cf35121b6d0e", "title": "One improved learning analytics of interest transfer in interactive learning activities"}, {"paperId": "e034f95d618203ded410755293fde3525deedb2e", "title": "Dropout prediction and decision feedback supported by multi temporal sequences of learning behavior in MOOCs"}, {"paperId": "d43000e9421505e6760d63876555524b7bc7e710", "title": "Interpretable early warning recommendations in interactive learning environments: a deep-neural network approach based on learning behavior knowledge graph"}, {"paperId": "a99d6defd26ad84f6091b4cbc2ed96d378527b7e", "title": "The Study of Hierarchical Learning Behaviors and Interactive Cooperation Based on Feature Clusters"}, {"paperId": "ba87afe587e0ac466774fce0555dff2082c6db72", "title": "Multi Objective Evaluation Between Learning Behavior and Learning Achievement"}, {"paperId": "0ecd3ca9381d284bd8cd41a8cb3d0e51bb0bfd9d", "title": "Early warning mechanism of interactive learning process based on temporal memory enhancement model"}, {"paperId": "e16b046c6398a454d940174795c92fa3456db954", "title": "College education: Problem-solving creativity in an interactive learning environment"}, {"paperId": "62a617811751085067abda38d8e18ec8e12deea1", "title": "Diversion inference model of learning effectiveness supported by differential evolution strategy"}, {"paperId": "0fe42856ce2d5dbae0c4206d3f1677e71fedcd93", "title": "Application Technology on Collaborative Training of Interactive Learning Activities and Tendency Preference Diversion"}, {"paperId": "eb16c7e1f9b38097a215219734cf70a6fc38dc20", "title": "Temporal tracking and early warning of multi semantic features of learning behavior"}, {"paperId": "d2aaa72bd98aa1515b35167f45607de48803ac4d", "title": "Sparse learning strategy and key feature selection in interactive learning environment"}]}
