{"paperId": "b486115c8cd44fc8e1a43e80584cf1c5621c6db5", "publicationVenue": {"id": "1e3debb4-0f5e-4499-b93a-3fada31bd2b3", "name": "International Symposium on Applied Machine Intelligence and Informatics", "type": "conference", "alternate_names": ["SAMI", "Int Symp Appl Mach Intell Informatics"]}, "title": "A Baseline Assessment Method of UAV Swarm Resilience Based on Complex Networks*", "abstract": "Preliminary progress has been made in the assessment of unmanned aerial vehicle (UAV) swarm resilience based on complex networks. However, the evaluation results mostly use the initial performance state as the evaluation baseline, which is unreasonable. When UAV swarm performs a mission, as long as the network performance during the life cycle is sufficient to meet the mission requirements, it can be considered that UAV swarm has the resilience required to complete the mission. Therefore, a baseline assessment method of UAV swarm resilience based on complex networks is proposed in this paper. First, the baseline assessment method of UAV swarm resilience based on complex networks is characterized and investigated. Second, the effectiveness of the baseline assessment method is verified by simulation. The result shows that the baseline evaluation can effectively relax the evaluation result in a mission-oriented manner, and no longer use the initial state as the standard performance to measure the completion of the mission of UAV swarm. When UAV swarm performs a mission, it only needs to maintain or restore the resilience needed to complete the mission.", "venue": "International Symposium on Applied Machine Intelligence and Informatics", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-01-21", "journal": {"name": "2021 IEEE 19th World Symposium on Applied Machine Intelligence and Informatics (SAMI)", "pages": "000083-000086"}, "authors": [{"authorId": "2112548464", "name": "Qin Sun"}, {"authorId": "1785448797", "name": "Hongxu Li"}, {"authorId": "2108104789", "name": "Yingchao Zhang"}, {"authorId": "2118597250", "name": "Yuxian Xie"}, {"authorId": "2155881224", "name": "Chengyu Liu"}], "citations": [{"paperId": "846382919d0611420c40e1f3901cbf03beba3be4", "title": "Enhancing Security, Privacy, and Trust in Connected UAV Systems"}, {"paperId": "babbd3874793dc7db79b5b4d6cd7d39f448de28c", "title": "Decomposing FANET to Counter Massive UAV Swarm Based on Reinforcement Learning"}, {"paperId": "edf3f1484b393ecda373be7b9bd55e50ebe7e4bb", "title": "A soft resource optimization method for improving the resilience of UAV swarms under continuous attack"}, {"paperId": "d90207f27a7bb3d7eec1685dfe0b0f1582966ea2", "title": "Towards Resilient UAV Swarms—A Breakdown of Resiliency Requirements in UAV Swarms"}, {"paperId": "1194e04650b05e25a25c6227f2f8ddac9bd91936", "title": "Research progress of CPS resilience"}, {"paperId": "3de33038955452a4f5777e6d126e7b7db44cb283", "title": "Robustness Analysis and Modeling of UAV Cluster System Based on Complex Network"}, {"paperId": "7847ee3c1a5e5fa1e74616d066f5b9c62b635934", "title": "Cover"}, {"paperId": "cb18a82573f13c0b75d2dfea238a227f3da26df9", "title": "Detection and Identification of Low-Slow-Small Rotor Unmanned Aerial Vehicle Using Micro-Doppler Information"}]}
