{"paperId": "b48a29b46994c409406ad9eb609e5b0f3d4b1edc", "publicationVenue": null, "title": "Training Data Reduction for Performance Models of Data Analytics Jobs in the Cloud", "abstract": "Distributed dataflow systems like Apache Flink and Apache Spark simplify processing large amounts of data on clusters in a data-parallel manner. However, choosing suitable cluster resources for distributed dataflow jobs in both type and number is difficult, especially for users who do not have access to previous performance metrics. One approach to overcoming this issue is to have users share runtime metrics to train context-aware performance models that help find a suitable configuration for the job at hand. A problem when sharing runtime data instead of trained models or model parameters is that the data size can grow substantially over time.This paper examines several clustering techniques to minimize training data size while keeping the associated performance models accurate. Our results indicate that efficiency gains in data transfer, storage, and model training can be achieved through training data reduction. In the evaluation of our solution on a dataset of runtime data from 930 unique distributed dataflow jobs, we observed that, on average, a 75% data reduction only increases prediction errors by one percentage point.", "venue": "2021 IEEE International Conference on Big Data (Big Data)", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-11-15", "journal": {"name": "2021 IEEE International Conference on Big Data (Big Data)", "pages": "3141-3146"}, "authors": [{"authorId": "153294591", "name": "Jonathan Will"}, {"authorId": "84469483", "name": "Onur Arslan"}, {"authorId": "2062906007", "name": "Jonathan Bader"}, {"authorId": "2051551482", "name": "Dominik Scheinert"}, {"authorId": "2294791", "name": "L. Thamsen"}], "citations": [{"paperId": "7fbb73f3e61ed9ab1f18d0290082729a46ca36cd", "title": "Towards a Peer-to-Peer Data Distribution Layer for Efficient and Collaborative Resource Optimization of Distributed Dataflow Applications"}, {"paperId": "7d434537cce3fd903e1ba09e694895fbe3628cbc", "title": "Get Your Memory Right: The Crispy Resource Allocation Assistant for Large-Scale Data Processing"}, {"paperId": "38511a8a8d6ca24c4676c954fb05d578e444ec46", "title": "Collaborative Cluster Configuration for Distributed Data-Parallel Processing: A Research Overview"}, {"paperId": "9c1b979b8ba820a712e3198f5cede008a89acbbd", "title": "On the Potential of Execution Traces for Batch Processing Workload Optimization in Public Clouds"}]}
