{"paperId": "b49c4eda92154206abf2a442620dddd28ca7a231", "publicationVenue": {"id": "e35a87a3-a6c4-47bf-acca-3e615ddb9c58", "name": "ACM Transactions on Database Systems", "type": "journal", "alternate_names": ["ACM Trans Database Syst"], "issn": "0362-5915", "url": "http://www.acm.org/pubs/contents/journals/tods/", "alternate_urls": ["http://tods.acm.org/", "http://www.acm.org/tods/", "http://portal.acm.org/tods", "https://tods.acm.org/"]}, "title": "Robust and Efficient Sorting with Offset-value Coding", "abstract": "Sorting and searching are large parts of database query processing, e.g., in the forms of index creation, index maintenance, and index lookup, and comparing pairs of keys is a substantial part of the effort in sorting and searching. We have worked on simple, efficient implementations of decades-old, neglected, effective techniques for fast comparisons and fast sorting, in particular offset-value coding. In the process, we happened upon its mutually beneficial relationship with prefix truncation in run files as well as the duality of compression techniques in row- and column-format storage structures, namely prefix truncation and run-length encoding of leading key columns. We also found a beneficial relationship with consumers of sorted streams, e.g., merging parallel streams, in-stream aggregation, and merge join. We report on our implementation in the context of Google’s Napa and F1 Query systems as well as an experimental evaluation of performance and scalability.", "venue": "ACM Transactions on Database Systems", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-09-17", "journal": {"name": "ACM Transactions on Database Systems", "pages": "1 - 23", "volume": "48"}, "authors": [{"authorId": "145182862", "name": "Thanh Do"}, {"authorId": "1799376", "name": "G. Graefe"}], "citations": [{"paperId": "db2c0c49d9ae5abb54d3696797288e16e7717144", "title": "Optimizing Search and Sort Algorithms: Harnessing Parallel Programming for Efficient Processing of Large Datasets"}, {"paperId": "7871ac596b2f1a55cb5cdde919a02f52639b12f1", "title": "Offset-value coding in database query processing"}]}
