{"paperId": "b4c13653b64da43af3aba8d07908fc8cacad62c0", "publicationVenue": {"id": "60275282-b076-42f7-99dc-8757c2064681", "name": "Informatics", "type": "journal", "alternate_names": ["Informatics (basel", "Informatics (Basel)"], "issn": "2227-9709", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-390272", "alternate_urls": ["https://www.mdpi.com/journal/informatics", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-390272"]}, "title": "Systematic Review of Multimodal Human-Computer Interaction", "abstract": "This document presents a systematic review of Multimodal Human–Computer Interaction. It shows how different types of interaction technologies (virtual reality (VR) and augmented reality, force and vibration feedback devices (haptics), and tracking) are used in different domains (concepts, medicine, physics, human factors/user experience design, transportation, cultural heritage, and industry). A systematic literature search was conducted identifying 406 articles initially. From these articles, we selected 112 research works that we consider most relevant for the content of this article. The articles were analyzed in-depth from the viewpoint of temporal patterns, frequency of usage in types of technology in different domains, and cluster analysis. The analysis allowed us to answer relevant questions in searching for the next steps in work related to multimodal HCI. We looked at the typical technology type, how the technology type and frequency have changed in time over each domain, and how papers are grouped across metrics given their similarities. This analysis determined that VR and haptics are the most widely used in all domains. While VR is the most used, haptic interaction is presented in an increasing number of applications, suggesting future work on applications that configure VR and haptic together.", "venue": "Informatics", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-02-15", "journal": {"name": "Informatics", "pages": "13", "volume": "9"}, "authors": [{"authorId": "2154814266", "name": "Jose Daniel Azofeifa"}, {"authorId": "2543102", "name": "J. Noguez"}, {"authorId": "2154865028", "name": "Sergio Ruiz"}, {"authorId": "2123971897", "name": "J. Molina-Espinosa"}, {"authorId": "2221017", "name": "Alejandra J. Magana"}, {"authorId": "1788393", "name": "Bedrich Benes"}], "citations": [{"paperId": "acebe0479953116a41c1a1b80fca3cb0e7dd7f10", "title": "Characterization and classification of EEG signals evoked by different CAD models"}, {"paperId": "25099230b702ebf20a89b3f3fe8b17d446438699", "title": "SurgicalPart-SAM: Part-to-Whole Collaborative Prompting for Surgical Instrument Segmentation"}, {"paperId": "618cc881e6b1e28e46eb5055c920ecd50381e41d", "title": "Understanding virtual drilling perception using sound, and kinesthetic cues obtained with a mouse and keyboard"}, {"paperId": "b8e47f71ee4a0055992c6a918b0f1f4b16d5c743", "title": "Human Computer Interaction Design Practice in Poster Design"}, {"paperId": "a32e658b78028bfb5563c0de6a450e241b45951d", "title": "Fundamentals and issues of user experience in the process of designing consumer products"}, {"paperId": "f62625993da43d9bd0d8a2ebf9b3cb229fa98232", "title": "An overview of gesture recognition"}, {"paperId": "cd12ba8a001f2391b333d987326d3baeb195707b", "title": "Application of Multimodal Multimedia Information and Big Data Technology in Teaching Chinese as a Foreign Language Course"}, {"paperId": "dd3552eb3f5b2b588beb1af2da8c3c23a4577acc", "title": "Effect of Visual Augmented Reality in the Transportation Sector"}, {"paperId": "4f0e994577b4fc3387e994461bc6d5b3cadfc9cf", "title": "Toward the manipulation of time and space in extended reality: a preliminary study on multimodal Tau and Kappa illusions in the visual-tactile domain"}, {"paperId": "db9e7136a67e587c0396f5ebc1ca09629b3933f1", "title": "Urban air mobility infrastructure design: Using virtual reality to capture user experience within the world's first urban airport."}, {"paperId": "ce64640aac55ca395a162a81362d3ad4363c5370", "title": "Development and Application Trend of Human-Computer Interaction Based on Virtual Reality Technology in Military Drills"}]}
