{"paperId": "b4c9f49f726f87791768c37e0b29f5e7c8719f6d", "publicationVenue": {"id": "373ee421-9890-40bc-87d7-59518033a715", "name": "Environmental Research Letters", "type": "journal", "alternate_names": ["Environ Res Lett"], "issn": "1748-9326", "url": "http://www.iop.org/EJ/toc/1748-9326", "alternate_urls": ["http://iopscience.org/erl", "http://iopscience.iop.org/1748-9326/", "https://iopscience.iop.org/journal/1748-9326"]}, "title": "How can Big Data and machine learning benefit environment and water management: a survey of methods, applications, and future directions", "abstract": "Big Data and machine learning (ML) technologies have the potential to impact many facets of environment and water management (EWM). Big Data are information assets characterized by high volume, velocity, variety, and veracity. Fast advances in high-resolution remote sensing techniques, smart information and communication technologies, and social media have contributed to the proliferation of Big Data in many EWM fields, such as weather forecasting, disaster management, smart water and energy management systems, and remote sensing. Big Data brings about new opportunities for data-driven discovery in EWM, but it also requires new forms of information processing, storage, retrieval, as well as analytics. ML, a subdomain of artificial intelligence (AI), refers broadly to computer algorithms that can automatically learn from data. ML may help unlock the power of Big Data if properly integrated with data analytics. Recent breakthroughs in AI and computing infrastructure have led to the fast development of powerful deep learning (DL) algorithms that can extract hierarchical features from data, with better predictive performance and less human intervention. Collectively Big Data and ML techniques have shown great potential for data-driven decision making, scientific discovery, and process optimization. These technological advances may greatly benefit EWM, especially because (1) many EWM applications (e.g. early flood warning) require the capability to extract useful information from a large amount of data in autonomous manner and in real time, (2) EWM researches have become highly multidisciplinary, and handling the ever increasing data volume/types using the traditional workflow is simply not an option, and last but not least, (3) the current theoretical knowledge about many EWM processes is still incomplete, but which may now be complemented through data-driven discovery. A large number of applications on Big Data and ML have already appeared in the EWM literature in recent years. The purposes of this survey are to (1) examine the potential and benefits of data-driven research in EWM, (2) give a synopsis of key concepts and approaches in Big Data and ML, (3) provide a systematic review of current applications, and finally (4) discuss major issues and challenges, and recommend future research directions. EWM includes a broad range of research topics. Instead of attempting to survey each individual area, this review focuses on areas of nexus in EWM, with an emphasis on elucidating the potential benefits of increased data availability and predictive analytics to improving the EWM research.", "venue": "Environmental Research Letters", "year": 2019, "fieldsOfStudy": ["Computer Science", "Physics"], "publicationTypes": ["Review"], "publicationDate": "2019-07-01", "journal": {"name": "Environmental Research Letters", "volume": "14"}, "authors": [{"authorId": "48058966", "name": "A. Sun"}, {"authorId": "4944689", "name": "B. Scanlon"}], "citations": [{"paperId": "58073200eeefce4fd6a2a745669fa6ca89e7fd41", "title": "Analysis of heavy metal and polycyclic aromatic hydrocarbon pollution characteristics of a typical metal rolling industrial site based on data mining."}, {"paperId": "6207afee1592b063299322356058da210e2a65a2", "title": "Applications and interpretations of different machine learning models in runoff and sediment discharge simulations"}, {"paperId": "701e019714cf89da71444f6f77ec33fd54b0ae65", "title": "Application of machine learning approaches in supporting irrigation decision making: A review"}, {"paperId": "9c7cc3662fe1a9332808841f99196e627daf2e2c", "title": "Deep learning for water quality"}, {"paperId": "b3f69121651c66468911390cca51ba50e3526aa8", "title": "Advancements in drought using remote sensing: assessing progress, overcoming challenges, and exploring future opportunities"}, {"paperId": "59aeeba6611d99df37298820672c7d28702bf81e", "title": "Spatial, spectral and temporal insights: harnessing high-resolution satellite remote sensing and artificial intelligence for early monitoring of wood boring pests in forests"}, {"paperId": "c4773df2c0bb5ecf65afc3c875880b17dd91382e", "title": "Advances in machine learning and IoT for water quality monitoring: A comprehensive review"}, {"paperId": "0903bf804d905e3e99a0f456f504232dba45f291", "title": "A hierarchical Bayesian network-based semi-mechanistic model for handling data variabilities in dynamical process systems"}, {"paperId": "a71121bdae024ff40530b04634594a5c439b8ede", "title": "Integration Approaches for Heterogeneous Big Data: A Survey"}, {"paperId": "8f1212f32073b7cee588c3c3079ca5cdf44543bf", "title": "Integrated analytics and machine learning for water quality index assessment - Monitoring of industrial waste polluted stream"}, {"paperId": "9da1d0ff85f2d6236d1876ab1d2e132ee0d104c4", "title": "Long term analysis of international wetlands in Iran: Monitoring surface water area and water balance"}, {"paperId": "9a7a5d81a6027bc3606b17a4a5c5d999f85be6ad", "title": "Deep clustering framework review using multicriteria evaluation"}, {"paperId": "1ea60ce030761a3268d1b79b52d972c4524a4aec", "title": "Applying deep learning to manage urban ecosystems in arid Abha, Saudi Arabia: Remote sensing-based modelling for ecological condition assessment and decision-making"}, {"paperId": "3aaffd621bcd1bc171bc5c27288ee42ab66ac997", "title": "Sustainable AI-Based Production Agriculture: Exploring AI Applications and Implications in Agricultural Practices"}, {"paperId": "34f50e2eca831628469f33aed1bd380dc3a71b5f", "title": "Research on Water Resource Modeling Based on Machine Learning Technologies"}, {"paperId": "c297d50d5e4dd95f8fd0073f510d7fea08a2401d", "title": "A comprehensive review on artificial intelligence in water treatment for optimization. Clean water now and the future."}, {"paperId": "c3de3c183379e03badff2b7269e1986fcf96e001", "title": "Review of smart water management: IoT and AI in water and wastewater treatment"}, {"paperId": "1811b80d3a39a9a34736e61a84b5d4d63b2668d0", "title": "Identifying and Categorizing Bias in AI/ML for Earth Sciences"}, {"paperId": "b6534e8b2d89f0c9a65738d812819433efa6d854", "title": "Digital Prototyping and Simulation of a Humidity Control Robot for Tunnel Farming"}, {"paperId": "aaa6c31a6ec1dfd476d61cca6f710e11174c47fd", "title": "A spatially explicit interpretable machine-learning method to track dissolved inorganic nitrogen pollution in a coastal watershed"}, {"paperId": "cf0d20a584349f783b62a5bdd90945227d9f6268", "title": "Application and exploration of artificial intelligence technology in urban ecosystem-based disaster risk reduction: A scoping review"}, {"paperId": "fe91fa0b46ce880746eb5f0c551e0cdee717fbdc", "title": "Multiple spatio-temporal scale runoff forecasting and driving mechanism exploration by K-means optimized XGBoost and SHAP"}, {"paperId": "90711bca262742f29aaad22594b63893fe8af714", "title": "A Comparative Analysis of Artificial Neural Network (ANN) Architectures for Box Compression Strength Estimation"}, {"paperId": "dfaa3c42f1c1c985cf4f2787a7ee1ece8509338d", "title": "Hydrogeochemistry and prediction of arsenic contamination in groundwater of Vehari, Pakistan: comparison of artificial neural network, random forest and logistic regression models."}, {"paperId": "3f679c651769857b0e46bea09ce2b54aa9c52416", "title": "Application of Short Video Semantic Understanding Technology Based on Big Data Analysis in Education Management"}, {"paperId": "67789d690cc2a91dddf0428dbafd2cf1355a8e9b", "title": "Enhancing groundwater level prediction accuracy at a daily scale through combined machine learning and physics-based modeling"}, {"paperId": "1e7d09f534f622b47fc1602cbe0e8cf5cebc7327", "title": "A contrarian growth: The spatiotemporal dynamics of open-surface water bodies on the northern slope of Kunlun Mountains"}, {"paperId": "32a0d273e37d230cde5dcbd5cbe45f7b2233547c", "title": "Community-based watershed management (CBWM) for climate change adaptation and mitigation: Research trends, gaps, and factors assessment"}, {"paperId": "d3a90186dca86b80ae098f184004de3e5179a352", "title": "Does artificial intelligence technology enhance green transformation of enterprises: based on green innovation perspective"}, {"paperId": "a823d76924ea93d9d5a8e54782d6094602e874f5", "title": "Integrated Streamflow Forecasting System: A Step Towards Smart Flood Management"}, {"paperId": "418f5ef514045c179d0a07757b7afc3911ae3670", "title": "Big Data Analysis and Decision Support System Based on Deep Learning"}, {"paperId": "81bb122e722b634894c6f3d6c45f1c954902a491", "title": "Big Data, Data Science, and Artificial Intelligence for Project Management in the Architecture, Engineering, and Construction Industry: A Systematic Review"}, {"paperId": "316ab651249b164f97eb338d836090f791c6a315", "title": "Technological Innovations for Agricultural Production from an Environmental Perspective: A Review"}, {"paperId": "307126fd3c27060096ceb066a17be6e98d85977e", "title": "A Comprehensive Survey of Machine Learning Methodologies with Emphasis in Water Resources Management"}, {"paperId": "72afbd8c13253acd984c3b03526d8a4920b87741", "title": "On Leakage in Machine Learning Pipelines"}, {"paperId": "a5d10292cad1ad04aade841bd5ecdfbb47b14d2b", "title": "Drinking Water Resources Suitability Assessment Based on Pollution Index of Groundwater Using Improved Explainable Artificial Intelligence"}, {"paperId": "76f3d14c2d917a9005477f61b00afaaf52dcddea", "title": "A comprehensive review of artificial intelligence and machine learning applications in energy consumption and production"}, {"paperId": "5ce0d13cc607720a7d201e9fcd9ac0d6b8550294", "title": "Water Quality Estimation and Anomaly Detection: A Review"}, {"paperId": "895acabd3db7cb988b874f167cc77a01ba2925da", "title": "Water storage changes (2003–2020) in the Ordos Basin, China, explained by GRACE data and interpretable deep learning"}, {"paperId": "f3e830e632ff61fb67f26c305503e2f8d9f248fb", "title": "Customer Complaints-Based Water Quality Analysis"}, {"paperId": "1d3a27f1df6c93a6249c75e1c271c95c3dbc1625", "title": "Big Data analytics for mining geochemistry of gold mineralization: The Gandy Gold Deposit, the Toroud-Chah Shirin (TCS) belt, north Iran"}, {"paperId": "54769f4ac52dba1b1d9910684e0b6eba947d8a7c", "title": "A Review of Practical AI for Remote Sensing in Earth Sciences"}, {"paperId": "687ec5d1b946ba6f24c73103a879aef873979c90", "title": "Changes in groundwater irrigation withdrawals due to climate change in Kansas"}, {"paperId": "28ec23153b442aaf5d8a8d3f0c86418fff9fb947", "title": "Enhancing the reliability of particulate matter sensing by multivariate Tobit model using weather and air quality data"}, {"paperId": "de462fde42d264b4e1d1c0d4af9fb13c7530ae20", "title": "Simulation and Driving Factor Analysis of Satellite-Observed Terrestrial Water Storage Anomaly in the Pearl River Basin Using Deep Learning"}, {"paperId": "0834e33f16666d24c1003be0186b4216eefe742a", "title": "Interactive Internet Framework Proposal of WASPAS Method: A Computational Contribution for Decision-Making Analysis"}, {"paperId": "c846b97e65d627e99234dfb3aa0d65a72e203103", "title": "Guiding Questions for Water Resources Systems Analysis Research"}, {"paperId": "de517af828e928475cfd478e53956a47f4c3df91", "title": "Evaluation of shallow groundwater dynamics after water supplement in North China Plain based on Attention-GRU model"}, {"paperId": "9824a0a4b7fc5af9ba434e35c8475b36e83322d2", "title": "Long-term ecological research in freshwaters enabled by regional biodiversity collections, stable isotope analysis, and environmental informatics."}, {"paperId": "d34db87d13f6616b26b34e9c0abf2e9eead02a9b", "title": "Hybrid deep WaveNet-LSTM architecture for crop yield prediction"}, {"paperId": "3183ec5dd4b77c74dbdcc814e005be3559ec513a", "title": "Machine Learning Implementation in Membrane Bioreactor Systems: Progress, Challenges, and Future Perspectives: A Review"}, {"paperId": "593e9fa842eb6b8de03cdb045cb63f3b5efa32f8", "title": "A Brief Review of Machine Learning Algorithms in Forest Fires Science"}, {"paperId": "2e9b871a58be784dd5311a4a1e8d3776bccebe61", "title": "Iterative integration of deep learning in hybrid Earth surface system modelling"}, {"paperId": "ff6d7f798a31084915593ae4fa881d675466fca3", "title": "Navigating the future: exploring technological advancements and emerging trends in the sustainable ornamental industry"}, {"paperId": "8f9fca8282f8c9758e048d609188cdffaac29555", "title": "Assessing the impacts of dam/weir operation on streamflow predictions using LSTM across South Korea"}, {"paperId": "3d238f363ae0ccaf3020185c395a72728e0be764", "title": "Analysis of driving factors of water demand based on explainable artificial intelligence"}, {"paperId": "21fd8ecfd9bb3a763560b56adf5b930c2a1dcf97", "title": "Evolution of Cyber-Physical-Human Water Systems: Challenges and Gaps"}, {"paperId": "58804b44fd1a2f3fc7d8a7fb50a807e7eec4f1c2", "title": "A deep neural network for electrical resistance calibration of self-sensing carbon fiber polymer composites compatible with edge computing structural monitoring hardware electronics"}, {"paperId": "cda4596cf7bf14335df4d3a172ab423a7cc19ce2", "title": "Recent Advances and New Frontiers in Riverine and Coastal Flood Modeling"}, {"paperId": "f1fc436af36b623d343aeee5a773e16a3a8c5b95", "title": "Monitoring and Mapping Floods and Floodable Areas in the Mekong Delta (Vietnam) Using Time-Series Sentinel-1 Images, Convolutional Neural Network, Multi-Layer Perceptron, and Random Forest"}, {"paperId": "1631d43e2aa48115463a47d8d8e2c4070ca765f7", "title": "Adoption of data-as-a-service by water and wastewater utilities"}, {"paperId": "6d4559ab0d7f1271381b7bc68fa1f35b1a86cc19", "title": "Assessing Regional Ecosystem Conditions Using Geospatial Techniques—A Review"}, {"paperId": "2b60ee7ae451aad006ec3f240e1172a66bd435f9", "title": "Application of machine learning and deep learning methods for hydrated electron rate constant prediction."}, {"paperId": "6aa30124a833db8b2f87d1d9d028f1b80032362c", "title": "Meta-analysis of engineered nanoparticles dynamic aggregation in freshwater-like systems using machine learning techniques."}, {"paperId": "9a2ec496fe0d61b4ad2292820bd03a5015198535", "title": "Seabird surveillance: combining CCTV and artificial intelligence for monitoring and research"}, {"paperId": "42d10fd34c7de55ed47179f2792c248064c72e3c", "title": "Time Series Dataset Survey for Forecasting with Deep Learning"}, {"paperId": "c8ce5f453946378dcab235a3349d367100b63595", "title": "Machine Learning for Nutrient Recovery in the Smart City Circular Economy – A Review"}, {"paperId": "4052631c8ffc823a8d5888da256d2c6c8d4f5058", "title": "Large‐Domain Multisite Precipitation Generation: Operational Blueprint and Demonstration for 1,000 Sites"}, {"paperId": "c912f05e3abb87a820092907ccdd830bf1272b76", "title": "An Unmanned Aerial Vehicle (UAV) System for Disaster and Crisis Management in Smart Cities"}, {"paperId": "e3cdf11b7e7de1f8f5607fa1ab3696f1f062127a", "title": "Heavy Metal Removal from Aqueous Solutions Using Biomaterials and/or Functional Composites: Recent Advances and the Way Forward in Wastewater Treatment Using Digitalization"}, {"paperId": "d839271325642d9e9b2dd925408e5ab315b29331", "title": "Application of Solar Activity Time Series in Machine Learning Predictive Modeling of Precipitation-Induced Floods"}, {"paperId": "d58f666d5909e65f1ddbc3073ef6ebb088d5830e", "title": "Groundwater Levels Forecasting Using Machine Learning Models: A Case Study of the Groundwater Region 10 at Karst Belt, South Africa"}, {"paperId": "ef16e753724d283c7da07777d7ee58ba4082bc32", "title": "Applications of Machine Learning in Medicine: Current Trends and Prospects"}, {"paperId": "95ecf75911a94eaadcaa868868d466598a95145e", "title": "Spectral variability in fine-scale drone-based imaging spectroscopy does not impede detection of target invasive plant species"}, {"paperId": "37344cd23fb6fb067f9072b3bacf7a95844c6513", "title": "Presentation of DeMa (Decision Support Software and Database for Wellfield Management) and Its Application for the Wadi Al Arab Wellfield"}, {"paperId": "f157df823463f03a118f76b34bc3ff4d19164709", "title": "Approaching the upper boundary of driver-response relationships: identifying factors using a novel framework integrating quantile regression with interpretable machine learning"}, {"paperId": "e8d63aa44eaa1808b14f5bdf7c5b41bfa6974ca1", "title": "What is going on within google earth engine? A systematic review and meta-analysis"}, {"paperId": "7f10a6948f8acaab542256fb9a3f2af646b6bb9d", "title": "Collaborative Learning Assessment via Information and Communication Technology"}, {"paperId": "2d658f14e62af90dc13f9b54e3a100db1fcd8aa7", "title": "Does the face expression recognition model under the online entrepreneurial education model important for deep learning technologies and entrepreneurial emotions?"}, {"paperId": "9f29f57d91fad9da37fe3e8034b8cb500812905d", "title": "Data Management and Visual Information Processing using Machine Learning"}, {"paperId": "d629a6a6362dcce6424827f30ef97aa9fb4ee730", "title": "Assessment of Smart Transformation in the Manufacturing Process of Aerospace Components Through a Data-Driven Approach"}, {"paperId": "4780539615135b48efa6ce5acaa9ff88a860fcdc", "title": "Data Type and Data Sources for Agricultural Big Data and Machine Learning"}, {"paperId": "b76524b1859aea9f6f4a650e36eb782e40d15c63", "title": "Semantic Riverscapes: Perception and evaluation of linear landscapes from oblique imagery using computer vision"}, {"paperId": "452689b57e7aead4c1ce68f9eb932069cdee4151", "title": "Machine learning based downscaling of GRACE-estimated groundwater in Central Valley, California."}, {"paperId": "351ee5da747c9eba7b8b425058cab6c5a508306b", "title": "Feature importance measures to dissect the role of sub-basins in shaping the catchment hydrological response: a proof of concept"}, {"paperId": "719441d450d547cc4b0a392f2cde7636d797aa59", "title": "Unraveling the complexities of urban fluvial flood hydraulics through AI"}, {"paperId": "1713cbf1987a0b5d905f8532bf2bb5759bb7f60c", "title": "Assessment of groundwater potential modeling using support vector machine optimization based on Bayesian multi-objective hyperparameter algorithm"}, {"paperId": "c01fd31ebab5cd4b7398646726621690829ec805", "title": "Comparison and interpretation of data-driven models for simulating site-specific human-impacted groundwater dynamics in the North China Plain"}, {"paperId": "ed871531538769097350ca143a4b8c33fe124306", "title": "Big Data Healthcare in South Africa for IoT using Deep Learning"}, {"paperId": "5394f11e1b9349ea51e195b82ce260f9dae8374b", "title": "An automated prediction of remote sensing data of Queensland-Australia for flood and wildfire susceptibility using BISSOA-DBMLA scheme"}, {"paperId": "f17fabd53bccc1ee7360dbb72e050b4a347d4304", "title": "AI-big data analytics for building automation and management systems: a survey, actual challenges and future perspectives"}, {"paperId": "cc228fab0cfbac8d326bf1082f434ebf946b2f33", "title": "A graph neural network (GNN) approach to basin-scale river network learning: the role of physics-based connectivity and data fusion"}, {"paperId": "583c4fb0ee78ed5f4e8aa2e8258f361a2337679c", "title": "High Level Synthesis Acceleration of Change Detection in Multi-Temporal High Resolution Sentinel-2 Satellite Images"}, {"paperId": "bea9f2100177139ba8514040ca3abdc0c38363ee", "title": "A review of machine learning and big data applications in addressing ecosystem service research gaps"}, {"paperId": "792cc8923084a5d07eedfeeefdc0c90c7416e411", "title": "Flood mapping based on the combination of support vector regression and Heun’s scheme"}, {"paperId": "0706fb80608c1bccfa2922a283e88c738b4aea4d", "title": "Deep learning and machine learning for Malaria detection: overview, challenges and future directions"}, {"paperId": "b23579f68193655db85b06dc555a21d9942832b2", "title": "Spatial characteristics and driving factors of urban flooding in Chinese megacities"}, {"paperId": "036bf86c1634bb5430041bd9e5e83f533a166cbe", "title": "Summer precipitation prediction in eastern China based on machine learning"}, {"paperId": "36a906fd56f0aa5b188206821edfe66a26b2fa0b", "title": "Analysis of runoff generation driving factors based on hydrological model and interpretable machine learning method"}, {"paperId": "cee7496f430d5b1a1614bb61d1c24586282d6206", "title": "Water Quality Classification Using Machine Learning Algorithms"}, {"paperId": "af066c2e6560a96228a963ddd288bcaea37f68d2", "title": "Assessment of influencing factors on non-point source pollution critical source areas in an agricultural watershed"}, {"paperId": "8be210baf9485e1690787374a08443b95ea0a602", "title": "Decoding river pollution trends and their landscape determinants in an ecologically fragile karst basin using a machine learning model."}, {"paperId": "9060b6f3b6853720e7d5b71e1873d78117292d72", "title": "Geospatial Artificial Intelligence (GeoAI) in the Integrated Hydrological and Fluvial Systems Modeling: Review of Current Applications and Trends"}, {"paperId": "2d785991e82e9a857ac8a87d85fde8cb7c95620f", "title": "Change Detection Techniques with Synthetic Aperture Radar Images: Experiments with Random Forests and Sentinel-1 Observations"}, {"paperId": "a177d88570590d91e11518a69dbc2c7efb15ddc8", "title": "Prediction of Fault Occurrences in Smart City Water Distribution System Using Time-Series Forecasting Algorithm"}, {"paperId": "50a8eebd14d80e9093101d37e24b3c96821f221b", "title": "Digital Transformation in Water Organizations"}, {"paperId": "1414561f8b2037683e68a8fba0ac6a4463cd3fb2", "title": "Online Big Data Physical Education Classroom Based on Monitoring Network and Artificial Intelligence"}, {"paperId": "efd5aa18a8c17e36184008b439f947582b83ba10", "title": "A Review on Rainfall Measurement Based on Commercial Microwave Links in Wireless Cellular Networks"}, {"paperId": "84609462f46c69a0c4d1deecbc792edf14b2f783", "title": "Evaluation Model for Spatial Allocation Efficiency of Modern Educational Campus Building Using Big Data"}, {"paperId": "7a5c34a3f113a1600045b664d6674da380768f87", "title": "Decision-support systems for water management"}, {"paperId": "22e0ce11512796afb05ad17e99f018f9ce5fd0a4", "title": "Forward-Looking Roadmaps for Long-Term Continuous Water Quality Monitoring: Bottlenecks, Innovations, and Prospects in a Critical Review"}, {"paperId": "18dae930736e91994e877d55bd60589814ccaf4b", "title": "Exploring the type and strength of nonlinearity in water quality responses to nutrient loading reduction in shallow eutrophic water bodies: Insights from a large number of numerical simulations."}, {"paperId": "b5dbac364fb9959c99d8c199b878a09b5d714571", "title": "Can machine learning accelerate process understanding and decision‐relevant predictions of river water quality?"}, {"paperId": "3e44af63f0c79f46b40ac38668ad79f67fd4c383", "title": "Applications of machine learning and deep learning methods for climate change mitigation and adaptation"}, {"paperId": "8ef60c6452bcc9fb7117d5d80b92d987835e855b", "title": "Daily surface temperatures for 185,549 lakes in the conterminous United States estimated using deep learning (1980–2020)"}, {"paperId": "06131efc46cf94518fd2d592454c69cab6e994c6", "title": "Big Data Reality Check (BDRC) for public health: to what extent the environmental health and health services research did meet the ‘V’ criteria for big data? A study protocol"}, {"paperId": "d246d4fe27c91f01bc9279775b3a4987eeb0f3a5", "title": "Interpretative Machine Learning as a Key in Recognizing the Variability of Lakes Trophy Patterns"}, {"paperId": "e2ba5e5843ea6c9931c487f436733b24af16b42d", "title": "The Digital Revolution in the Urban Water Cycle and Its Ethical–Political Implications: A Critical Perspective"}, {"paperId": "7980b43184bb2920d9c3462ed2e9c6fa59d9223b", "title": "Artificial Intelligence for Cancer Detection Using Medical Image: Highlights and Limitations"}, {"paperId": "25945beaebaa44d16420d2f2633bae31e16661e2", "title": "Advanced Analytics Tools for Process Improvement: A Case Study in a Brewery"}, {"paperId": "1066be8a3abb94ae049776977de76b88342198a8", "title": "Big Data-Driven Hierarchical Local Area Network Security Risk Event Prediction Algorithm"}, {"paperId": "56ab2efd61bc7f8a4cba70b9b7f8284d315c236d", "title": "A Stormwater Management Framework for Predicting First Flush Intensity and Quantifying its Influential Factors"}, {"paperId": "e8ddf257ecb56216c53b92cc29052e755fe8901c", "title": "An Integrated First Principal and Deep Learning Approach for Modeling Nitrous Oxide Emissions from Wastewater Treatment Plants."}, {"paperId": "9fe331cc92fcc1038d6f06ad4a6d3848d2a762ac", "title": "Data-driven models for accurate groundwater level prediction and their practical significance in groundwater management"}, {"paperId": "405543ebd3d8313b1c5cd581b035b70d4a790040", "title": "High-frequency Sea-level analysis: Global distributions"}, {"paperId": "40eba3e8a5fadac263f01be979063dcc72d39c86", "title": "Human Intervention Will Stabilize Groundwater Storage Across the North China Plain"}, {"paperId": "a5470b2899cbe3d02022a1bef2e5f55244f4c0e4", "title": "Remote Sensing Big Data for Water Environment Monitoring: Current Status, Challenges, and Future Prospects"}, {"paperId": "7a165b7ea391ec0aecb59776d5f74c2b6972264d", "title": "Network-Based Topological Exploration of the Impact of Pollution Sources on Surface Water Bodies"}, {"paperId": "2005ce9aff5221ea6939de2dcc5881d41b82f323", "title": "Characterizing plant root parameters with deep learning-based heat pulse method"}, {"paperId": "15cdd21a2a0a76f588de1a75e89cd97f327e6abe", "title": "Integrated water-power system resiliency quantification, challenge and opportunity"}, {"paperId": "adb3371a565770b70790119966621f70b6efcdd4", "title": "A Hybrid Deep Learning Framework with Physical Process Description for Simulation of Evapotranspiration"}, {"paperId": "920e2870b6fe10802d5c2b2c9d73751c533c77b5", "title": "A review of machine learning methods for drought hazard monitoring and forecasting: Current research trends, challenges, and future research directions"}, {"paperId": "0c1d627ca4908ac0cd04293e6fc1476a877cc4e0", "title": "Prospects of an agricultural drought early warning system in South Africa"}, {"paperId": "837e9281f85b56dd22aaeab39ce2bfcdfb64cb7e", "title": "Explore Spatio‐Temporal Learning of Large Sample Hydrology Using Graph Neural Networks"}, {"paperId": "a32411b5dbbbbd216fcacc26dbbb9af3be8edbda", "title": "A deep learning model for predicting river flood depth and extent"}, {"paperId": "412dade158a984ff757ff33e7ff39830925707ce", "title": "A Topological Data Analysis approach for retrieving Local Climate Zones patterns in satellite data"}, {"paperId": "c831569d7634979d3a0345c68b8637d660f93464", "title": "Explainable AI reveals new hydroclimatic insights for ecosystem-centric groundwater management"}, {"paperId": "534b110a9b3bb4948cb5d69e044010b5c86098c2", "title": "Applications of Machine Learning in Public Security Information and Resource Management"}, {"paperId": "def89cfc2c2f0ca3ce580a16a6bf29b05ddc1256", "title": "Modeling, mapping and analysis of urban floods in India—a review on geospatial methodologies"}, {"paperId": "0e7a4b08979122cc23040d35c887f6f201c9de2f", "title": "Deep Learning to Estimate Permeability using Geophysical Data"}, {"paperId": "4b1fb5fd631aed2b2fc1e296f831fff9aa7a3aee", "title": "The fusion of physical mechanism and artificial intelligence – A case study of water-tightness estimation for geometrically imperfect cut-off walls"}, {"paperId": "fff288b064423bfebca1cacca87dd921d7db745c", "title": "Integration of Artificial Intelligence and Life Cycle Assessment Methods"}, {"paperId": "8f4e022521e0c4d711ff43c8ba1b33d27fad50f8", "title": "Review of urban computing in air quality management as smart city service: An integrated IoT, AI, and cloud technology perspective"}, {"paperId": "d32922082d599a68cef8d740dbae2d51b2d6755d", "title": "A Fully Automatic, Interpretable and Adaptive Machine Learning Approach to Map Burned Area from Remote Sensing"}, {"paperId": "2e8a6e398da7bc14d04bdc2ac91ec1eaa9cfc759", "title": "The challenges of predicting pipe failures in clean water networks: a view from current practice"}, {"paperId": "3a4738be5fa6c4d2749fd11386aa58c2e318fc73", "title": "Frontiers in the Solicitation of Machine Learning Approaches in Vegetable Science Research"}, {"paperId": "94933ddec856499c5bb5d76b9062eaef6dd0191a", "title": "Design of Internet of Things and big data analytics-based disaster risk management"}, {"paperId": "5fc70deaa07c5bf4c45bf9bf7a9f6acbeb6f9c49", "title": "Integrated urban environmental system of systems for weather ready cities in India"}, {"paperId": "89e1f9eef0e33f568c7c5208a3652fa9a73d6e82", "title": "The Digital Forest: Mapping a Decade of Knowledge on Technological Applications for Forest Ecosystems"}, {"paperId": "fff925386a486c52788878d22ffd70b0101724f1", "title": "Twenty-First Century Science Calls for Twenty-First Century Groundwater Use Law: A Retrospective Analysis of Transboundary Governance Weaknesses and Future Implications in the Laurentian Great Lakes Basin"}, {"paperId": "45d04e19bacf87d73604a9dde884f6bd3754de77", "title": "UAV & satellite synergies for optical remote sensing applications: A literature review"}, {"paperId": "b415e836d447ea9efb7629a1de67cd2a6f9e7ba8", "title": "Machine Learning in Agriculture: A Comprehensive Updated Review"}, {"paperId": "8904e57a4874b9e9f273cc78dcdd9d36c3b5e58e", "title": "Connected Sensors, Innovative Sensor Deployment, and Intelligent Data Analysis for Online Water Quality Monitoring"}, {"paperId": "9029189a767ba1f758bd1e241a23df22d4e565ef", "title": "Data Science for Geoscience: Recent Progress and Future Trends from the Perspective of a Data Life Cycle"}, {"paperId": "37ca74239ff5bbd9dfe4705edc1cc095ba9c2bc7", "title": "Efficient detection and prediction of flood severity using machine learning algorithm"}, {"paperId": "e047dd515299c8057a5ec298d1c66ade6f134a74", "title": "Advent of Big Data technology in environment and water management sector"}, {"paperId": "09cf66f5d212da452d9ab55d9b87563f9b2f5a9e", "title": "Machine learning in geography–Past, present, and future"}, {"paperId": "4f058a08b07aae3e3d08cb9949ba2c78ed9d4cc5", "title": "Transportable Automated HRMS Platform “MS2field” Enables Insights into Water-Quality Dynamics in Real Time"}, {"paperId": "24a2206a714de3a2b5573a0da41fb75e2475273f", "title": "Using Unlabeled Data Set for Mining Knowledge from DDB"}, {"paperId": "8742ca6db990338f95e976f4bea5b2af8558ce56", "title": "Applications of physics-informed scientific machine learning in subsurface science: A survey"}, {"paperId": "d5c27ee7ef055b02e015d71f3d5e712937ab51cc", "title": "Spatiotemporal data mining: a survey on challenges and open problems"}, {"paperId": "6b97c48d8f3730a6785ea793cb19a84d3926549f", "title": "Seascape ecology: identifying research priorities for an emerging ocean sustainability science"}, {"paperId": "adc372321e5af7154c1a9b958690988cde0f3019", "title": "COVID-19 Lockdown Disruptions on Water Resources, Wastewater, and Agriculture in India"}, {"paperId": "e2408e947a0a18930833dc8e9c31f2d5be7b860f", "title": "A machine learning approach to estimating the error in satellite sea surface temperature retrievals"}, {"paperId": "a526942013b67c9ab46455c0b76180561739bc3c", "title": "A review of machine learning in processing remote sensing data for mineral exploration"}, {"paperId": "d8a14559b71c5af7e9bcb2957190c16f92cafd31", "title": "Harnessing artificial intelligence technology and social media data to support Cultural Ecosystem Service assessments"}, {"paperId": "2e1040df8a6db4cec6d71096b4cbd297269cb67a", "title": "EdgeAI: How to Use AI to Collect Reliable and Relevant Watershed Data"}, {"paperId": "6b649fbbcb7b9ff29fbb1c1b033a8d5470b994de", "title": "Use and Adaptations of Machine Learning in Big Data—Applications in Real Cases in Agriculture"}, {"paperId": "78a649732e07fdeaf3fae874fc1ee0f6ace3113e", "title": "Toward Urban Water Security: Broadening the Use of Machine Learning Methods for Mitigating Urban Water Hazards"}, {"paperId": "90d38163f782e86ae2ed64857a248dfd49989d22", "title": "Changing climate drives future streamflow declines and challenges in meeting water demand across the southwestern United States"}, {"paperId": "cb019804845ee0e163b5bbace7ba5aa990d72fac", "title": "Short-term solar irradiance forecasting using convolutional neural networks and cloud imagery"}, {"paperId": "60c8b260c9f63a278c2555a8753488da36ecc800", "title": "Bayesian convolutional neural networks for predicting the terrestrial water storage anomalies during GRACE and GRACE-FO gap"}, {"paperId": "6bed8ee1647f815352d1a2acc058c9656915e8ba", "title": "Transportable Automated HRMS Platform Enables Insights into Water Quality Dynamics in Real Time"}, {"paperId": "ec36d72d37ba78e5c64323b81415ef250da89b40", "title": "Introduction to the special issue on a Shared Environmental Information System (SEIS) for evidence-based policymaking"}, {"paperId": "0a1caf38f0d7dce46286e8591dba4d0e54d5c2f7", "title": "Social water environment governance innovation in China driven by big data: Frontier trends, dilemma challenges and optimization paths"}, {"paperId": "b99d835f4981bb48b5883ac117d307a4a1164adc", "title": "Monitoring and modeling of water ecologic security in large river-lake systems"}, {"paperId": "81b9d09c2bae32f01ec535f5edbb4d1f86067bb2", "title": "Downscaling Satellite and Reanalysis Precipitation Products Using Attention-Based Deep Convolutional Neural Nets"}, {"paperId": "06c937662af8983cdc357bb15cf45b1a38040065", "title": "Enhancing Healthcare Decision-Making Process: Findings from Orthopaedic Field"}, {"paperId": "417236a2e4d6b3024045ae3b9454ae5e8dfbcd05", "title": "Approaching geoscientific inverse problems with vector-to-image domain transfer networks"}, {"paperId": "ee0b4d9f02f0f271f41976c9582daaaefb8e645a", "title": "Reconstruction of GRACE Total Water Storage Through Automated Machine Learning"}, {"paperId": "7e72a5eb893a3ef3ce53b84bff51699b8ea50218", "title": "AI Naturalists Might Hold the Key to Unlocking Biodiversity Data in Social Media Imagery"}, {"paperId": "05f6a48a44bb1ed8d11c9352c279fb35b64d157f", "title": "Coordinated river infrastructure decisions improve net social-ecological benefits"}, {"paperId": "aad6b22cbae6c7907d27332f6b636c1d18b3d2f2", "title": "Artificial intelligence in the water domain: Opportunities for responsible use"}, {"paperId": "8e80000f2af5bb6e0d986d09a6f86f01b6c8a30b", "title": "Modelling of ecological status of Polish lakes using deep learning techniques"}, {"paperId": "60778585451e8385c7267644c0b1c82bb8bca37b", "title": "Changing the Nature of Quantitative Biology Education: Data Science as a Driver"}, {"paperId": "d6913e4beaac330bd925c9aef0b2e4452cc86a00", "title": "Deep learning and principal–agent problems of algorithmic governance: The new materialism perspective"}, {"paperId": "e24e9050764d983616739f94e90bdd4012f0bade", "title": "Applications of Artificial Intelligence and Big Data Analytics in m-Health: A Healthcare System Perspective"}, {"paperId": "bba4102a2490fd388330675e7b031835687874af", "title": "Self‐Validating Deep Learning for Recovering Terrestrial Water Storage From Gravity and Altimetry Measurements"}, {"paperId": "7de51559658f3382487c1681ab8cfe422dfb4dd4", "title": "Using Long Short-Term Memory networks to connect water table depth anomalies to precipitation anomalies over Europe"}, {"paperId": "b681b89ac24a1c46bb036797ec903f1ec76b00ef", "title": "Mapping of Eucalyptus in Natura 2000 Areas Using Sentinel 2 Imagery and Artificial Neural Networks"}, {"paperId": "3307c819f60b6fbc0ac04d7ef2510f60a94eee5d", "title": "Improving AI System Awareness of Geoscience Knowledge: Symbiotic Integration of Physical Approaches and Deep Learning"}, {"paperId": "561f07f253461ce9be0d12df0f7d9309ff771686", "title": "Flood Prediction and Tracking Trapped"}, {"paperId": "1205a053b2975fe9a17cc587dfd5cf1084de980b", "title": "IoT-Enabled Flood Severity Prediction via Ensemble Machine Learning Models"}, {"paperId": "fc17072669b871db61d51b25f22ba9e85b89e907", "title": "DISRUPTIVE TECHNOLOGY THROUGH SATELLITE IMAGERY BIG DATA IN DISASTER RISK REDUCTION: OPPORTUNITY AND CHALLENGE"}, {"paperId": "699edee417ec213856a5b8830e1cc3852f920649", "title": "The fourth-revolution in the water sector encounters the digital revolution."}, {"paperId": "e841c7c4151ac61614bd9984230322571898462f", "title": "Estimating Ecosystem Respiration in the Grasslands of Northern China Using Machine Learning: Model Evaluation and Comparison"}, {"paperId": "b8f75b848b6cef0f2b5a1a11b794332ca9bccb45", "title": "A review of machine learning applications in wildfire science and management"}, {"paperId": "123120600adbcc6dd5282b3589ae28a650e3953d", "title": "Impact of deep learning-based dropout on shallow neural networks applied to stream temperature modelling"}, {"paperId": "a6ae6a5c995c9c80c619aaad59278d085a86f64a", "title": "Monitoring and detecting faults in wastewater treatment plants using deep learning"}, {"paperId": "aa92ea1088791bc59876731c9f6568c6b908ae1c", "title": "Legal Implications of the Use of Big Data in the Transboundary Water Context"}, {"paperId": "ee66885df569686624ed2a22da06039456156ca6", "title": "Use of soft computing techniques for tunneling optimization of tunnel boring machines"}, {"paperId": "bf8d013062fea0e5afc9ce1a977760213a469533", "title": "Approaching geoscientific inverse problems with adversarial vector-to-image domain transfer networks"}, {"paperId": "8564431a5ad8cb396d9f25034b6076fcdc6a6f06", "title": "A Framework for Deep Learning Emulation of Numerical Models With a Case Study in Satellite Remote Sensing"}, {"paperId": "a3bc25802cfaf65c924047e7dec25e1a3d959f3c", "title": "Parametrization of Stochastic Inputs Using Generative Adversarial Networks With Application in Geology"}, {"paperId": "10725b810fbb5529d246a977ecd2b76cc8147129", "title": "Non-Linear Associations Between the Urban Built Environment and Commuting Modal Split: A Random Forest Approach and SHAP Evaluation"}, {"paperId": "3062e8218944a1140b40913331f40f1f7aaedcb1", "title": "Scientific and Technical Advisory Committee: Knowledge Gaps, Uncertainties, and Opportunities Regarding the Response of the Chesapeake Bay Estuary to Restoration Efforts"}, {"paperId": "44fc9837d3c26e95ed79a493ba196d7f128189c1", "title": "The role of artificial intelligence and digital technologies in dam engineering: Narrative review and outlook"}, {"paperId": "c985254b146aca29cfe41b0a3118ece65feeaedc", "title": "Water Resource Management"}, {"paperId": "5db4574cfd9e09e9a0140814ca399409fdc7b167", "title": "A review on material analysis of food safety based on fluorescence spectrum combined with artificial neural network technology"}, {"paperId": "3f4d3ef87ab5db6cca90abb523a39e0f0fcbaf1e", "title": "Big Data Analytics Using Swarm-Based Long Short-Term Memory for Temperature Forecasting"}, {"paperId": "c17ed3a77305b035dee442d876e2a6752afedb64", "title": "Machine learning for understanding inland water quantity, quality, and ecology"}, {"paperId": "ca494d8fc91772993343e0f456f806bf9cdb7231", "title": "IoT-Enabled Water Distribution Systems—A Comparative Technological Review"}, {"paperId": "b701def3ec01bc8746a53b0679be56fb59ad9912", "title": "Community Segmentation and Inclusive Social Media Listening"}, {"paperId": "d37940ef154713fa0c76757055d7c969b340be4e", "title": "Bulletin of Electrical Engineering and Informatics"}, {"paperId": "e5d80697763bd7d67b82a0cfe2068900710015ca", "title": "A graph neural network approach to basin-scale river network learning: The role of physics-based connectivity and data fusion"}, {"paperId": "cc61550cf9fd44c478e3c6af9ea4711edacea5c8", "title": "Machine Learning for Big Data"}, {"paperId": "7dae6d51a3ca04516199f937abca26c976884a6e", "title": "Advanced flood severity detection using ensemble learning models"}, {"paperId": "7214d514f8be29cb246bb92c9fe013cf562057e0", "title": "Modes of Collaboration in Digital Transformation of Municipal Wastewater Management"}, {"paperId": "c9b457baa46fca521a49524f888b62f82285f71b", "title": "Big Data Interoperability Framework for Malaysian Public Open Data"}, {"paperId": "cb2dfcc426c48d2439bce37a9d3ad19b896354f9", "title": "Impact of Advancement of Technology, Competitive Pressure, User Expectation on Continuous Digital Disruption: Mediating Role of Perceive Ease of Use"}, {"paperId": "84b54e7744c2ac4956126b5849b1af70b6794325", "title": "Title: Bridging Multiscale Processes in Earth System Models with Physics-Guided Hierarchical Machine Learning"}, {"paperId": "81b0e543cbf13eef098bdaf5b06ee36ca7bcb059", "title": "Data-driven water distribution system analysis – exploring challenges and potentials from smart meters and beyond"}, {"paperId": "a59ffa3fa00effebef67382b59325aff46813d18", "title": "FLOOD DETECTION AND FORECAST BY IOT TECHNOLOGY"}]}
