{"paperId": "b4d0f436cf722c7f1857dda2865c157c2c4b01a3", "publicationVenue": null, "title": "Visualising the Invisible: Augmented Reality and Virtual Reality as Persuasive Technologies for Energy Feedback", "abstract": "In the last fifteen years, the outlook for engaging direct energy feedback as a method of effectively curtailing domestic energy consumption has grown more pessimistic. Continuing studies and reviews suggest the impact of such techniques on consumers is much less than the minimum ten percent reduction originally hoped. Persuasive technology research has demonstrated multiple successes in promoting resource conserving behaviours however, including in energy consumption related topics. One of the main obstacles with energy feedback is that making use of electricity is an 'invisible' process and doesn't produce any visible feedback to the consumer. This paper suggests harnessing Augmented Reality and Virtual Reality as persuasive technologies to visualise the 'invisible' consumption of domestic activities and promote energy conserving behaviours. A literature section provides short reviews of relevant topics, providing the justification and motivation for conducting this research while an overview of a methodology focusing on a user-centered approach discusses how to incorporate effective consumer feedback into the development process of appropriate energy feedback visualisations. Initial implementation methods for the visualisations are discussed and future work building upon this paper is outlined.", "venue": "2019 IEEE SmartWorld, Ubiquitous Intelligence & Computing, Advanced & Trusted Computing, Scalable Computing & Communications, Cloud & Big Data Computing, Internet of People and Smart City Innovation (SmartWorld/SCALCOM/UIC/ATC/CBDCom/IOP/SCI)", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2019-08-01", "journal": {"name": "2019 IEEE SmartWorld, Ubiquitous Intelligence & Computing, Advanced & Trusted Computing, Scalable Computing & Communications, Cloud & Big Data Computing, Internet of People and Smart City Innovation (SmartWorld/SCALCOM/UIC/ATC/CBDCom/IOP/SCI)", "pages": "1209-1212"}, "authors": [{"authorId": "1629403917", "name": "Alexander David Fredericks"}, {"authorId": "1520436833", "name": "Zhong Fan"}, {"authorId": "2240989", "name": "Sandra I. Woolley"}], "citations": [{"paperId": "f5237e6cae76629d2ee1cc4500d7df86e6f97373", "title": "Augmented-Reality Waste Accumulation Visualizations"}, {"paperId": "d652252cf0b616c3cdacce6e9af27aa3c7a665f7", "title": "Understanding Household Consumption Practices and their Motivations: Opportunities to Foster Sustainability Practices"}, {"paperId": "43c1554f70c5d6114f4d436ca27bf43781b62922", "title": "Exploring Augmented Reality Waste Data Representations for Eco Feedback."}, {"paperId": "4e030b73985e7403af1592a3c744cea0b35ac047", "title": "A Decade On, How Has the Visibility of Energy Changed? Energy Feedback Perceptions from UK Focus Groups"}]}
