{"paperId": "b4dabff4899b1c5474b348bbda7527f0958ce1fb", "publicationVenue": {"id": "f59013b0-24c0-47b0-a804-1dbcd309be0c", "name": "IEEE-NPSS Real-Time Conference", "type": "conference", "alternate_names": ["IEEE-NPSS Real-time Conf", "NATO ASI RTC", "RTC"]}, "title": "Image Processing for Detecting Botnet Attacks: A Novel Approach for Flexibility and Scalability", "abstract": "Continued adoption of the Internet of Things (IoT) redefines the paradigm of network architectures. Historically, network architectures relied on centralized resources and data centers. The introduction of the IoT challenges this notion by placing computing resources and observation at the edge of the network. As a result, decentralized approaches for information processing and gathering can be adopted and explored. However, this shift greatly expands the network footprint and shifts traffic away from the center of the network, where observation and cybersecurity monitoring tools are frequently located. Further, IoT devices are often computationally constrained, limiting their readiness to deal with cyber-threats. These security vulnerabilities make the IoT an easy target for hacking groups and lead to the proliferation of zombie networks of compromised devices. Frequently, zombie networks, otherwise known as botnets, are coordinated to attack targets and overload network resources through a Distributed Denial of Service (DDoS) attack. In order to crack down on these botnets, it is essential to develop new methods for quickly and efficiently detecting botnet activity. This study proposes a novel botnet detection technique that first pre-processes network data through computer vision and image processing. The processed dataset is then sent to a neural network for final classification. Two neural networks will be explored, a sequential model and an auto-encoder model. The application of image processing has two advantages over current methods. First, the image processing is simple enough to be completed at the edge of the network by the IoT devices. Second, preprocessing the data allows us to use a shallower network, decreasing detection time further. We will utilize the N-BaIoT dataset and compare our findings to their results.", "venue": "IEEE-NPSS Real-Time Conference", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-10-10", "journal": {"name": "2022 IEEE International Conference and Expo on Real Time Communications at IIT (RTC)", "pages": "8-12"}, "authors": [{"authorId": "2190900887", "name": "Aurelien Agniel"}, {"authorId": "2059453864", "name": "David Arnold"}, {"authorId": "1691321", "name": "J. Saniie"}], "citations": [{"paperId": "bc40b6156e147e65540369f053690535add4c8fc", "title": "Botnet Attacks Detection using Image Processing Approach: Sequential Neural Network and Feature Selection"}, {"paperId": "98e7f1c9a10b18d743ed901327127e6de707db77", "title": "Heterogeneity Tolerance in IoT Botnet Attack Classification"}, {"paperId": "b79322724af0ee7af9e512c7f573557fca948af8", "title": "Utilizing Computer Vision Algorithms to Detect and Classify Cyberattacks in IoT Environments in Real-Time"}]}
