{"paperId": "b4dbecb672bfce1bbe674030000c20d8cf12ac5e", "publicationVenue": null, "title": "Discovering Spatio-Temporal Co-Occurrence Patterns of Crimes with Uncertain Occurrence Time", "abstract": "The discovery of spatio-temporal co-occurrence patterns (STCPs) among multiple types of crimes whose events frequently co-occur in neighboring space and time is crucial to the joint prevention of crimes. However, the crime event occurrence time is often uncertain due to a lack of witnesses. This occurrence time uncertainty further results in the uncertainty of the spatio-temporal neighborhood relationships and STCPs. Existing methods have mostly modeled the uncertainty of events under the independent and identically distributed assumption and utilized one-sided distance information to measure the distance between uncertain events. As a result, STCPs detected from a dataset with occurrence time uncertainty (USTCPs) are likely to be erroneously assessed. Therefore, this paper proposes a probabilistic-distance-based USTCP discovery method. First, the temporal probability density functions of crime events with uncertain occurrence times are estimated by considering the temporal dependence. Second, the spatio-temporal neighborhood relationships are constructed based on the spatial Euclidean distance and the proposed temporal probabilistic distance. Finally, the prevalent USTCPs are identified. Experimental comparisons performed on twelve types of crimes from X City Public Security Bureau in China demonstrate that the proposed method can more objectively express the occurrence time of crimes and more reliably identify USTCPs.", "venue": "ISPRS Int. J. Geo Inf.", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-08-20", "journal": {"name": "ISPRS Int. J. Geo Inf.", "pages": "454", "volume": "11"}, "authors": [{"authorId": "50581316", "name": "Yuanfang Chen"}, {"authorId": "15996861", "name": "Jiannan Cai"}, {"authorId": "2054419042", "name": "M. Deng"}], "citations": [{"paperId": "132c488b38c8a11e895cdf0333f777c06635eab8", "title": "Mining significant local spatial association rules for multi-category point data"}]}
