{"paperId": "b4e9c0e9bbba7fe17ff8170a50a500af2db475eb", "publicationVenue": {"id": "fcbcaf18-8ab1-43e1-a973-604bbc7e344e", "name": "Proceedings of the VLDB Endowment", "type": "journal", "alternate_names": ["Proceedings of The Vldb Endowment", "Proc VLDB Endow", "Proc Vldb Endow"], "issn": "2150-8097", "url": "http://dl.acm.org/toc.cfm?id=J1174", "alternate_urls": ["http://portal.acm.org/toc.cfm?CFID=21632689&CFTOKEN=99329904&WantType=Affiliated%20Organizations&coll=ACM&dl=ACM&id=J1174&idx=J1174&part=affil&title=VLDB%20Endowment&type=periodical"]}, "title": "Railgun: managing large streaming windows under MAD requirements", "abstract": "Some mission critical systems, e.g., fraud detection, require accurate, real-time metrics over long time sliding windows on applications that demand high throughput and low latencies. As these applications need to run 'forever' and cope with large, spiky data loads, they further require to be run in a distributed setting. We are unaware of any streaming system that provides all those properties. Instead, existing systems take large simplifications, such as implementing sliding windows as a fixed set of overlapping windows, jeopardizing metric accuracy (violating regulatory rules) or latency (breaching service agreements). In this paper, we propose Railgun, a fault-tolerant, elastic, and distributed streaming system supporting real-time sliding windows for scenarios requiring high loads and millisecond-level latencies. We benchmarked an initial prototype of Railgun using real data, showing significant lower latency than Flink and low memory usage independent of window size. Further, we show that Railgun scales nearly linearly, respecting our msec-level latencies at high percentiles (<250ms @ 99.9%) even under a load of 1 million events per second.", "venue": "Proceedings of the VLDB Endowment", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-06-23", "journal": {"name": "Proc. VLDB Endow.", "pages": "3069-3082", "volume": "14"}, "authors": [{"authorId": "145481610", "name": "Ana Sofia Gomes"}, {"authorId": "3210157", "name": "João Oliveirinha"}, {"authorId": "2059047943", "name": "Pedro Cardoso"}, {"authorId": "2066184889", "name": "P. Bizarro"}], "citations": [{"paperId": "e25a4ece79160c9817a38e80f77d729ca7487d48", "title": "GeaFlow: A Graph Extended and Accelerated Dataflow System"}, {"paperId": "4edec259d9ddabbbfc30034d96751a1cadf1ae55", "title": "Study of Electrical and Mechanical Parameters of Electromagnetic Railgun"}, {"paperId": "5853ce4ea53fb25d7eaebe1297080cc8009bb6bc", "title": "Comparative Study of Linear Induction Motor Guns and Coil-Guns for Naval and Ground-Based Artillery"}]}
