{"paperId": "b4fae1d8013e7b003d6fb664decded5901f5b870", "publicationVenue": {"id": "5e1f6444-5d03-48c7-b202-7f47d492aeae", "name": "IEEE Transactions on Visualization and Computer Graphics", "type": "journal", "alternate_names": ["IEEE Trans Vis Comput Graph"], "issn": "1077-2626", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=2945"}, "title": "The Influence of Visual Provenance Representations on Strategies in a Collaborative Hand-off Data Analysis Scenario", "abstract": "Conducting data analysis tasks rarely occur in isolation. Especially in intelligence analysis scenarios where different experts contribute knowledge to a shared understanding, members must communicate how insights develop to establish common ground among collaborators. The use of provenance to communicate analytic sensemaking carries promise by describing the interactions and summarizing the steps taken to reach insights. Yet, no universal guidelines exist for communicating provenance in different settings. Our work focuses on the presentation of provenance information and the resulting conclusions reached and strategies used by new analysts. In an open-ended, 30-minute, textual exploration scenario, we qualitatively compare how adding different types of provenance information (specifically data coverage and interaction history) affects analysts' confidence in conclusions developed, propensity to repeat work, filtering of data, identification of relevant information, and typical investigation strategies. We see that data coverage (i.e., what was interacted with) provides provenance information without limiting individual investigation freedom. On the other hand, while interaction history (i.e., when something was interacted with) does not significantly encourage more mimicry, it does take more time to comfortably understand, as represented by less confident conclusions and less relevant information-gathering behaviors. Our results contribute empirical data towards understanding how provenance summarizations can influence analysis behaviors.", "venue": "IEEE Transactions on Visualization and Computer Graphics", "year": 2022, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-08-08", "journal": {"name": "IEEE Transactions on Visualization and Computer Graphics", "pages": "1113-1123", "volume": "29"}, "authors": [{"authorId": "31971221", "name": "Jeremy E. Block"}, {"authorId": "51904928", "name": "Shaghayegh Esmaeili"}, {"authorId": "1777991", "name": "E. Ragan"}, {"authorId": "1731908", "name": "J. Goodall"}, {"authorId": "145042500", "name": "G. D. Richardson"}], "citations": [{"paperId": "6031a2949b422c7cbae5aa83f029f394aba2941f", "title": "A Practical Approach to Provenance Capturing for Reproducible Visual Analytics at an Ocean Research Institute"}, {"paperId": "793d69ecc8fe11e0a41aad5e34e5764227552e24", "title": "Summary Cycles: Exploring the Impact of Prompt Engineering on Large Language Models’ Interaction with Interaction Log Information"}]}
