{"paperId": "b512b5d562d8ca328027e72af9ef1d02b6e26d51", "publicationVenue": {"id": "52d976ef-ee21-403d-b8f5-d61cee0e58fb", "name": "Journal of information science", "type": "journal", "alternate_names": ["J inf sci", "Journal of Information Science", "J Inf Sci"], "issn": "0165-5515", "alternate_issns": ["1352-7460", "2228-8457"], "url": "http://jis.sagepub.com/", "alternate_urls": ["https://journals.sagepub.com/home/jis", "https://tci-thaijo.org/index.php/jiskku/index"]}, "title": "Efficient indexing and retrieval of patient information from the big data using MapReduce framework and optimisation", "abstract": "Large and complex data becomes a valuable resource in biomedical discovery, which is highly facilitated to increase the scientific resources for retrieving the helpful information. However, indexing and retrieving the patient information from the disparate source of big data is challenging in biomedical research. Indexing and retrieving the patient information from big data is performed using the MapReduce framework. In this research, the indexing and retrieval of information are performed using the proposed Jaya-Sine Cosine Algorithm (Jaya–SCA)-based MapReduce framework. Initially, the input big data is forwarded to the mapper randomly. The average of each mapper data is calculated, and these data are forwarded to the reducer, where the representative data are stored. For each user query, the input query is matched with the reducer, and thereby, it switches over to the mapper for retrieving the matched best result. The bilevel matching is performed while retrieving the data from the mapper based on the distance between the query. The similarity measure is computed based on the parametric-enabled similarity measure (PESM), cosine similarity and the proposed Jaya–SCA, which is the integration of the Jaya algorithm and the SCA. Moreover, the proposed Jaya–SCA algorithm attained the maximum value of F-measure, recall and precision of 0.5323, 0.4400 and 0.6867, respectively, using the StatLog Heart Disease dataset.", "venue": "Journal of information science", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-05-24", "journal": {"name": "Journal of Information Science", "pages": "500 - 518", "volume": "49"}, "authors": [{"authorId": "123716136", "name": "N. Merlin"}, {"authorId": "2126247756", "name": "V. Prem M"}], "citations": [{"paperId": "e1347253d1d37cd839b128ba62f708a8720bf960", "title": "Foreign Language Anxiety of College English Teachers and Their Countermeasures"}, {"paperId": "6a4929a788a05e489a0c59401a5a5060a5a96867", "title": "SIGNIFICANCE OF ANALYTICS"}]}
