{"paperId": "b5147000320eab86f3b9b30fd3fee4d1b2ca4e57", "publicationVenue": {"id": "8dff82c6-607a-4f61-9efa-a66d43226f8f", "name": "International Conference on Communication Systems and Network Technologies", "type": "conference", "alternate_names": ["CSNT", "Int Conf Commun Syst Netw Technol"]}, "title": "Challenges of Big Data to Big Data Mining with their Processing Framework", "abstract": "Big data is an emerging trend and need of industries, sciences, and engineering area because all areas are having a lot of data and these data have given a result for a particular problem. This result is very helpful for taking a decision for growing to own area and this decision is taken by big data analysis and big data mining process. When any organization is performing big data mining process then it faces a lot of challenges and these challenges have given a lot of risks to take a decision. This paper presents big data and data mining concept with big data mining challenges which are related to data, process, and management. Data challenges are related to big data, Process challenges are related to data mining and Management challenges are related to the common factor of big data and data mining. In the last section, this paper proposed a conceptual big data mining process framework which is helpful for handling challenges and design big data mining algorithm.", "venue": "International Conference on Communication Systems and Network Technologies", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2018-11-01", "journal": {"name": "2018 8th International Conference on Communication Systems and Network Technologies (CSNT)", "pages": "89-94"}, "authors": [{"authorId": "152370045", "name": "K. Pandey"}, {"authorId": "2058003111", "name": "D. Shukla"}], "citations": [{"paperId": "672284e30ce77defd2e4e0fdf25f8e445091d908", "title": "PENERAPAN LIGHT GRADIENT BOOSTING DALAM PREDIKSI RASIO KLIK TAYANG"}, {"paperId": "146fd033714ab30c5bcee9da651fb84af0a0467c", "title": "Big Data Frameworks Issues, Challenges, and Needs"}, {"paperId": "f2c2b4b06b53bbbfecaebd02237d4425c55ebf39", "title": "Min–max kurtosis mean distance based k-means initial centroid initialization method for big genomic data clustering"}, {"paperId": "9bc04d038439f6f502504aaaaea2514b5d4ea0c8", "title": "An integrated model for evaluation of big data challenges and analytical methods in recommender systems"}, {"paperId": "f798669f81166e42b74b32d30fd90e713413ac0e", "title": "Big Data Analysis for Drilling and Blasting in a Mine in the Central Andes"}, {"paperId": "09f9fe4e26909f67c815b3fd0d458aab49d6553e", "title": "STRATIFIED REMAINDER LINEAR SYSTEMATIC SAMPLING"}]}
