{"paperId": "b519498bfc1aa85510b2bb09cfc53f9330338b10", "publicationVenue": {"id": "7fca7065-fa6f-490b-923e-3ffc07857f1c", "name": "IEEE Transactions on Cloud Computing", "type": "journal", "alternate_names": ["IEEE Trans Cloud Comput"], "issn": "2168-7161", "url": "https://www.computer.org/web/tcc", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6245519"]}, "title": "SDTP: Accelerating Wide-Area Data Analytics With Simultaneous Data Transfer and Processing", "abstract": "For the efficient analysis of geo-distributed datasets, cloud providers implement data-parallel jobs across geo-distributed sites (e.g., datacenters and edge clusters), which are generally interconnected by wide-area network links. However, current state-of-the-art geo-distributed data analytic methods fail to make full use of the available network and computing resources. The main reason is that such geo-distributed methods must wait for bottleneck sites to complete the corresponding transmission and computation in each phase. Furthermore, such geo-distributed methods may be impractical to the network bandwidth dynamicity and diverse job parallelism. To this end, we propose a Simultaneous Data Transfer and Processing (SDTP) mechanism to accelerate wide-area data analytics, with the joint consideration of network bandwidth dynamics and job parallelism. In the SDTP, a site can execute the computation, provided that it obtains the required input data. As a result, the input data loading, map, shuffle, and reduce phases at each site need not wait for the completion of the previous phases of other sites. We further improve the SDTP method by offering more accurate time estimation and generalizing the mechanism to dynamic situations. The trace-driven results demonstrate that SDTP can improve the wide-area analytic job response time by 19% to 72% compared to other methods.", "venue": "IEEE Transactions on Cloud Computing", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-10-01", "journal": {"name": "IEEE Transactions on Cloud Computing", "pages": "911-926", "volume": "11"}, "authors": [{"authorId": "2109060428", "name": "Yiting Chen"}, {"authorId": "3155249", "name": "Lailong Luo"}, {"authorId": "144233921", "name": "Deke Guo"}, {"authorId": "1702296", "name": "Ori Rottenstreich"}, {"authorId": "39006765", "name": "Jie Wu"}], "citations": [{"paperId": "7e18f02a7097b8a56182a44dbe243a10b11f95cf", "title": "DAG-Aware Optimization for Geo-Distributed Data Analytics"}, {"paperId": "4b800119b57bf66a66873765e621c94c92a93c93", "title": "Delay-Resistant Geo-Distributed Analytics"}, {"paperId": "393a02cd0d8cfb0f0a2ae26df71d0316d482beee", "title": "Geo-Distributed IoT Data Analytics With Deadline Constraints Across Network Edge"}]}
