{"paperId": "b523d2fc2bfa9f0c7c88ad679bc90027b41db4fb", "publicationVenue": {"id": "74f47cf8-2839-4a56-959a-524dd0ed9e3e", "name": "International Conference on Extending Database Technology", "type": "conference", "alternate_names": ["Int Conf Extending Database Technol", "Extending Database Technology", "Extending Database Technol", "EDBT"], "url": "http://www.edbt.org/"}, "title": "A Context-based Approach for Partitioning Big Data", "abstract": "In recent years, the amount of available data keeps growing at fast rate, and it is therefore crucial to be able to process them in an efficient way. The level of parallelism in tools such as Hadoop or Spark is determined, among other things, by the partitioning applied to the dataset. A common method is to split the data into chunks considering the number of bytes. While this approach may work well for text-based batch processing, there are a number of cases where the dataset contains structured information, such as the time or the spatial coordinates, and one may be interested in exploiting such a structure to improve the partitioning. This could have an impact on the processing time and increase the overall resource usage efficiency. This paper explores an approach based on the notion of context, such as temporal or spatial information, for partitioning the data. We design a context-based multi-dimensional partitioning technique that divides an n − dimensional space into splits by considering the distribution of the each contextual dimension in the dataset. We tested our approach on a dataset from a touristic scenario, and our experiments show that we are able to improve the efficiency of the resource usage.", "venue": "International Conference on Extending Database Technology", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": null, "journal": {"pages": "431-434"}, "authors": [{"authorId": "1711623", "name": "S. Migliorini"}, {"authorId": "2919717", "name": "A. Belussi"}, {"authorId": "2710276", "name": "E. Quintarelli"}, {"authorId": "143751888", "name": "D. Carra"}], "citations": [{"paperId": "3c9dce90b0db69f8fe34ef43000182ea58db24a5", "title": "A Context-Aware Method for Indexing Large-Scale SpatioTemporal Data"}, {"paperId": "15a8822b4b3927b3cf1a7fd5a24fb6a16ae5fe39", "title": "Distributed Spatiotemporal Trajectory Query Processing in SQL"}, {"paperId": "a33630380730e4c9302a2dc4dc6c1b4d18b7a441", "title": "CoPart: a context-based partitioning technique for big data"}, {"paperId": "eb47c334af7e65d2504d5bfb4563aa8f14e01e32", "title": "A Balanced Solution for the Partition-based Spatial Merge Join in MapReduce"}]}
