{"paperId": "b526b7617a7ac9e367bb244e080d52bed1993cab", "publicationVenue": {"id": "9ee7345a-5e9f-4002-9880-d6b27d275524", "name": "Transactions on Emerging Telecommunications Technologies", "type": "journal", "alternate_names": ["European Transactions on Telecommunications", "Eur Trans Telecommun", "TETT", "Trans Emerg Telecommun Technol"], "issn": "1120-3862", "alternate_issns": ["2161-3915", "1124-318X"], "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/104087069", "alternate_urls": ["http://eu.wiley.com/WileyCDA/WileyTitle/productCd-ETT.html", "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1541-8251", "https://onlinelibrary.wiley.com/journal/21613915", "https://onlinelibrary.wiley.com/journal/15418251"]}, "title": "A comprehensive study on managing strategies in the fog environments", "abstract": "Although cloud computing application is rising, some unanswered problems still exist because of its inner issues like untrustworthy inactivity, the absence of movement backing, and place awareness. Therefore, fog computing has appeared as a hopeful infrastructure to supply flexible resources at the edge of the network. Fog supplies processing, data, storing, and application amenities to ultimate operators. The management strategies have a great impact on fog computing, such as monitoring and optimizing, the correlated components for improving the performance, availability, security, and any fundamental operational requirement. However, as far as we know, no organized study exists about analyzing their importance in fog environments. This paper provides a detailed survey for covering the current state‐of‐the‐art in fog management. This paper classifies the management strategies into three main categories: data management, energy, and resource. We also presented a few prospects and problems like the suggestions for the upcoming studies in the associated methods requiring to be investigated in fog computing. Moreover, a new paradigm has been ensured by increasing fog functionality and resource consumption. In general, fog management strategies in computing environments still need improvements in the variety of its setting to convert to an on‐request method, decrease the associated overhead, and improve the performance. Therefore, proper management can maintain the least resource consumption, which will finish the extra decrease in energy usage. Therefore, we contribute to provide strong suggestions for future fog computing studies. This paper can handle the pace of publications and propose the outcomes of study and practice as an upcoming route for decision makers in healthcare. In principle, the increase of researchers, scientists and managers' awareness level would increase the managers' good and knowingly behavioral conduct on managing fog environments.", "venue": "Transactions on Emerging Telecommunications Technologies", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2019-12-11", "journal": {"name": "Transactions on Emerging Telecommunications Technologies", "volume": "31"}, "authors": [{"authorId": "144510053", "name": "Aiqun Wang"}, {"authorId": "2068884684", "name": "Panpan Yan"}, {"authorId": "9042698", "name": "K. Batiha"}], "citations": [{"paperId": "1bc164b6ccfcd360057b7399d8c00cb38a7e1165", "title": "Resource Scheduling Techniques for Optimal Quality of Service in Fog Computing Environment: A Review"}, {"paperId": "6f877fb3ac3429b499872dc346f25df85bb0262f", "title": "DAIP: a delay-efficient and availability-aware IoT application placement in fog environments"}, {"paperId": "51a405b9c7ff5479fae2ecc9523e4c701e8cb424", "title": "Resource Scheduling in Fog Environment Using Optimization Algorithms for 6G Networks"}, {"paperId": "24e834a2e1cd60cae1cd62edc2be3ce86b6dcb1a", "title": "SO‐VMEC: Service offloading in virtual mobile edge computing using deep reinforcement learning"}, {"paperId": "a3ed7ade79fde4a1c3ab64229175416ae212d903", "title": "Workflow Scheduling Using Optimization Algorithm in Fog Computing"}, {"paperId": "1f7f50cfd0071888565682d3c324d72b52192558", "title": "Analysis ofResource Scheduling algorithms for optimization in IoT-Fog-Cloud System"}]}
