{"paperId": "b53e1cf4c0837ee6f7dc3864e47be2d1c95d6a34", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Weighted Random Sampling over Joins", "abstract": "Joining records with all other records that meet a linkage condition can result in an astronomically large number of combinations due to many-to-many relationships. For such challenging (acyclic) joins, a random sample over the join result is a practical alternative to working with the oversized join result. Whereas prior works are limited to uniform join sampling where each join row is assigned the same probability, the scope is extended in this work to weighted sampling to support emerging applications such as scientific discovery in observational data and privacy-preserving query answering. Notwithstanding some naive methods, this work presents the first approach for weighted random sampling from join results. Due to a lack of baselines, experiments over various join types and real-world data sets are conducted to show substantial memory savings and competitive performance with main-memory index-based approaches in the equal-probability setting. In contrast to existing uniform sampling approaches that require prepared structures that occupy contested resources to squeeze out slightly faster query-times, the proposed approaches exhibit qualities that are urgently needed in practice, namely reduced memory footprint, streaming operation, support for selections, outer joins, semi joins and anti joins and unequal-probability sampling. All pertinent code and data can be found at: https://github.com/shekelyan/weightedjoinsampling", "venue": "arXiv.org", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-01-07", "journal": {"name": "ArXiv", "volume": "abs/2201.02670"}, "authors": [{"authorId": "2451992", "name": "Michael Shekelyan"}, {"authorId": "1709589", "name": "Graham Cormode"}, {"authorId": "1732298", "name": "P. Triantafillou"}, {"authorId": "2034659", "name": "A. Shanghooshabad"}, {"authorId": "2087919519", "name": "Qingzhi Ma"}], "citations": [{"paperId": "3dd82e0ab1e141e0e57f2807a5123458f6b1388e", "title": "ShadowAQP: Efficient Approximate Group-by and Join Query via Attribute-oriented Sample Size Allocation and Data Generation"}, {"paperId": "579d07bd7b9146c4ba9b586aebdf079360bbd8e3", "title": "An End-to-End Cardiac Arrhythmia Recognition Method with an Effective DenseNet Model on Imbalanced Datasets Using ECG Signal"}, {"paperId": "50bca53ff65a92e0776ed7f04ff692f87afaed85", "title": "Graphical Join: A New Physical Join Algorithm for RDBMSs"}, {"paperId": "6c47bfbab4d5ac95bcf3158e16e9471f92b7fb05", "title": "Model Joins: Enabling Analytics Over Joins of Absent Big Tables"}]}
