{"paperId": "b544a46ac06c5fd81bc4a4f2dd28fd5368b4fbee", "publicationVenue": {"id": "3416dd37-f45d-40ed-b04e-875fcff8fa2f", "name": "Nutrients", "type": "journal", "issn": "2072-6643", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169249", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169249", "http://www.mdpi.com/journal/nutrients/", "https://www.mdpi.com/journal/nutrients"]}, "title": "Applying the Adjusted Chinese Dietary Balance Index-16 to Assess the Dietary Quality of Chinese Postpartum Lactating Mothers", "abstract": "A balanced diet is considered necessary in maternal recovery and neonatal development; however, the dietary quality of lactating mothers in China has not been systematically evaluated in different regions and stages of lactation. In addition, the release of the Chinese Dietary Guidelines in 2022 implies that the dietary index method needs to be adjusted accordingly. In this study, the adjusted Chinese Dietary Balance Index-16 (DBI-16) was used to assess the dietary quality of lactating women, referred to as the Dietary Balance Index for lactating women (DBI-L). This study is part of the MUAI study, in which dietary intake and demographic characteristics of lactating mothers from six cities in China and at different stages of lactation were obtained through a self-administered questionnaire and a food frequency questionnaire; 2532 puerperal women were included. According to the DBI-L, 66.2% of participants had inadequate dietary intake (79.1% vegetables, 79.1% fruits, 86.7% dairy products, 39.7% soybeans, and 69.4% fish products, respectively), 57.8% had excessive intake (76.0% cereals, 64.4% meat, and 29.1% eggs, respectively) and 92.2% had unbalanced dietary consumption. Dietary quality was optimal for mothers in the first month after delivery, and the dietary quality of mothers in economically developed places such as Shanghai and Guangzhou was significantly better than that in less developed places such as Lanzhou and Changchun. The dietary quality of lactating women in China is imbalanced, with excessive and inadequate dietary intake. The country should strengthen nutritional interventions for lactating mothers, especially in economically underdeveloped regions.", "venue": "Nutrients", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-10-24", "journal": {"name": "Nutrients", "volume": "15"}, "authors": [{"authorId": "2261679506", "name": "Junyue Jiang"}, {"authorId": "2261672575", "name": "Jiating Huang"}, {"authorId": "2218233930", "name": "Yanyan Su"}, {"authorId": "2261524802", "name": "Yu Wang"}], "citations": []}
