{"paperId": "b548e404a093ae6a7f7007dc1b3b56471eca7965", "publicationVenue": null, "title": "Marviq: Quality-Aware Geospatial Visualization of Range-Selection Queries Using Materialization", "abstract": "We study the problem of efficient spatial visualization on a large data set stored in a database using SQL queries with ad-hoc range conditions on numerical attributes, for example, a spatial scatterplot of taxi pickup events in New York between 1/1/2015 and 3/10/2015. We present a novel middleware-based technique called Marviq. It divides the selection-attribute domain into intervals, and precomputes and stores a visualization for each interval. These results are called MVS and stored as tables in the database. We can compute an exact visualization for a request by accessing MVS and retrieving additional records from the base table. To further reduce the latter time, we present algorithms for using MVS to compute an approximate visualization that satisfies a user-specified similarity threshold. We show a family of functions with certain properties that can use this technique. We present an improvement by dividing the MVS intervals into smaller intervals and materializing low-resolution visualization for these intervals. We report the results of an extensive evaluation of Marviq, including a user study, and show its high performance in both space and time.", "venue": "SIGMOD Conference", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2020-05-29", "journal": {"name": "Proceedings of the 2020 ACM SIGMOD International Conference on Management of Data"}, "authors": [{"authorId": "2152288725", "name": "Liming Dong"}, {"authorId": "2052614357", "name": "Qiushi Bai"}, {"authorId": "2111180563", "name": "Taewoo Kim"}, {"authorId": "2157560755", "name": "Taiji Chen"}, {"authorId": "2109585667", "name": "Weidong Liu"}, {"authorId": "49673417", "name": "Chen Li"}], "citations": [{"paperId": "a998e0d770441967b52953797e5f7c52c3c61c37", "title": "SynopsisDB: Distributed Synopsis-based Data Processing System"}, {"paperId": "c0164cb0a5f210ac820cf79491053b1f727c81c0", "title": "Learned k-NN distance estimation"}, {"paperId": "b77a705565304067d3cd1db53a7016566d4f45c3", "title": "ILX: Intelligent \"Location+X\" Data Systems (Vision Paper)"}, {"paperId": "6a3f753404306624d3fad976d236d8bacb00b6a1", "title": "SAFE: A Share-and-Aggregate Bandwidth Exploration Framework for Kernel Density Visualization"}, {"paperId": "149780c06c96374734bc1b26b9d385a4c04ebd14", "title": "A Time-Windowed Data Structure for Spatial Density Maps"}, {"paperId": "6fe60b96d4455788ccb6433af8b95abae6860b7e", "title": "Intelligent Data Visualization Analysis Techniques: A Survey"}]}
