{"paperId": "b5584f90d18d945033bc46143bb5f35531519c9a", "publicationVenue": null, "title": "Analyse et évaluation de structures orientées document", "abstract": "De nos jours, des millions de sources de donnees differentes produisent une enorme quantite de donnees non structurees et semi-structurees qui changent constamment. Les systemes d'information doivent gerer ces donnees tout en assurant la scalabilite et la performance. En consequence, ils ont du s'adapter pour supporter des bases de donnees heterogenes, incluant des bases de donnees No-SQL. Ces bases de donnees proposent une structure de donnees sans schema avec une grande flexibilite, mais sans separation claire des couches logiques et physiques. Les donnees peuvent etre dupliquees, fragmentees et/ou incompletes, et ils peuvent aussi changer a mesure des besoins de metier.La flexibilite et l’absence de schema dans les systemes NoSQL orientes documents, telle que MongoDB, permettent d’explorer des nouvelles alternatives de structuration sans faire face aux contraintes. Le choix de la structuration reste important et critique parce qu’il y a plusieurs impacts a considerer et il faut choisir parmi des nombreuses d’options de structuration. Nous proposons donc de revenir sur une phase de conception dans laquelle des aspects de qualite et les impacts de la structure sont pris en compte afin de prendre une decision d’une maniere plus avertie.Dans ce cadre, nous proposons SCORUS, un systeme pour l’analyse et l’evaluation des structures orientes document qui vise a faciliter l’etude des possibilites de semi-structurations orientees document, telles que MongoDB, et a fournir des metriques objectives pour mieux faire ressortir les avantages et les inconvenients de chaque solution par rapport aux besoins des utilisateurs. Pour cela, une sequence de trois phases peut composer un processus de conception. Chaque phase peut etre aussi effectuee independamment a des fins d’analyse et de reglage. La strategie generale de SCORUS est composee par :1. Generation d’un ensemble d’alternatives de structuration : dans cette phase nous proposons de partir d’une modelisation UML des donnees et de produire automatiquement un large ensemble de variantes de structuration possibles pour ces donnees.2. Evaluation d’alternatives en utilisant un ensemble de metriques structurelles : cette evaluation prend un ensemble de variantes de structuration et calcule les metriques au regard des donnees modelisees.3. Analyse des alternatives evaluees : utilisation des metriques afin d’analyser l’interet des alternatives considerees et de choisir la ou les plus appropriees.", "venue": "", "year": 2018, "fieldsOfStudy": ["Political Science"], "publicationTypes": null, "publicationDate": "2018-12-13", "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "2074316848", "name": "P. Barreto"}], "citations": [{"paperId": "5d3c8e597a1283c0e3a5ff6c44143f8d37304752", "title": "Évaluation et comparaison de structures de données orientées document"}]}
