{"paperId": "b558f65ef269b76ae71e6a047963f55b5815b098", "publicationVenue": null, "title": "Customer - Churn Prediction Using Machine Learning", "abstract": "The gradual but consistent decrease in the number of customers retained over time is referred to as “customer churn,” and it is a word that is frequently used in the business and financial sectors. If a company can identify the customers who are most likely to leave, they are more likely to take preventative efforts to keep those customers as clients. It is to the bank's advantage to have knowledge about which customers are theoretically and practically most likely to switch banks in the relatively close future. This article explains how to use machine learning algorithms to identify banking customers who may be considering switching financial institutions. This article demonstrates how machine learning models such as Logistic Regression (LR) and Naive Bayes' (NB) can effectively forecast which customers are most likely to leave the bank in the future by using data such as age, location, gender, credit card information, balance, etc. The article also uses data such as age, location, gender, credit card information, balance, etc. In addition, this article demonstrates the probabilistic predictions that may be generated using machine learning models such as Logistic Regression (LR) and Naive Bayes (NB). The findings of this research ultimately point to the conclusion that NB is superior to LR.", "venue": "2022 2nd International Conference on Technological Advancements in Computational Sciences (ICTACS)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-10-10", "journal": {"name": "2022 2nd International Conference on Technological Advancements in Computational Sciences (ICTACS)", "pages": "893-899"}, "authors": [{"authorId": "30305919", "name": "V. Agarwal"}, {"authorId": "2198499083", "name": "Shwetkranti Taware"}, {"authorId": "46782702", "name": "S. Yadav"}, {"authorId": "50098979", "name": "Durgaprasad Gangodkar"}, {"authorId": "2198498660", "name": "A. Rao"}, {"authorId": "2198497597", "name": "V. Srivastav"}], "citations": [{"paperId": "201f7ab6571746bd22f620219c26860843eaf6c3", "title": "Predictive Analytics for Breast Cancer Survival Rates Using Random Forest"}, {"paperId": "3c639ec81e5d3bd61d2d6fe06acd38f3debecad0", "title": "Prediction of Concrete Strength with Artificial Neural Networks Enhanced by Nano-Silica"}, {"paperId": "971861a966ce7266e5caa90521f21378f0e1ed2e", "title": "Crop Yield Prediction Through Artificial Neural Networks"}, {"paperId": "b5c65242439cb77d497c90cef4abd6f54ec3fec7", "title": "Enhancing Network Security Algorithm Using Machine Learning"}, {"paperId": "f887c1ab268578715bfc10e3cd0ec5b47d128b9b", "title": "Early Detection of Pancreatic Cancer Using Ensemble Learning with Medical Imaging"}, {"paperId": "01e5ade8c147314000d905f16f21e4c47fc3e712", "title": "Artificial Intelligence Based Examination of the Field of Ophthalmology"}, {"paperId": "e43db3df9472f1a5b890ee9a339d23dd749ccd09", "title": "Leveraging Recurrent Neural Networks for Diabetes Progression Monitoring"}, {"paperId": "71836a1f1d121e92c646767f3316c114b408f994", "title": "Deep Learning Techniques for Autonomous Navigation of Underwater Robots"}, {"paperId": "147d2d0e260aa84017b6553bbe4a434f644e7d84", "title": "Machine Learning-based Characterization of COPD Progression from Spirometry Data"}, {"paperId": "02e4d3529c304c5a36d58a9f24c491b1989508f6", "title": "Application of Genetic Algorithms for Personalized Cancer Treatment Planning"}, {"paperId": "b799f6dc5812f2a7630a487bb1b2c7c80276f933", "title": "Green IoT Edge Computing Towards Sustainable and Distributed Data Processing"}]}
