{"paperId": "b56fe93b6e5985289b31dae7b3edb090973ab0b1", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Internet of Smart City Objects: A Distributed Framework for Service Discovery and Composition", "abstract": "Smart cities generally aim at efficiently organizing and managing city resources through a digital layer on top of the legacy infrastructure. As the digitalization trend goes on with an increasing pace and with the involvement of a diverse set of actors, proper management of this digital layer as well as the services deployed over it becomes ever more crucial. This paper presents our methodology of transforming the complex smart city concept and its digital layer into a structured model for creating a dynamic and adaptive service ecosystem in the digital cities of the future. An overview of the smart city concept and the three-tier architecture that emerges through the digitalization of cities is presented first, together with the main challenges in attaining coherent smart city service environments that can avoid fragmentation, ensure scalability, and allow reuse. The three major enablers that are identified in this direction are 1) a semantic functional description of city objects, representing physical devices or abstract services; 2) a distributed service directory that embodies available city services for service lookup and discovery; and 3) planning tools for selecting and chaining basic services to compose new complex services. For each of these, a high-level overview of the available tools and results from the research literature are provided as well as the relevant standards. This overview is complemented with our own approach and design choices in project ISCO (Internet of smart city objects). Through the implementation of two distinct use cases, this paper illustrates how ISCO components can jointly enrich service creation and consumption of various stakeholders in smart cities.", "venue": "IEEE Access", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "14434-14454", "volume": "7"}, "authors": [{"authorId": "2582015", "name": "F. Sivrikaya"}, {"authorId": "1410502367", "name": "Nizar Ben-Sassi"}, {"authorId": "7919123", "name": "Xuan-Thuy Dang"}, {"authorId": "46250039", "name": "O. Görür"}, {"authorId": "46408370", "name": "Christian Kuster"}], "citations": [{"paperId": "2c9cce0f3e20b0ccb11091008b3e5fc46fa7ced8", "title": "Knowledge-Graph-Based IoTs Entity Discovery Middleware for Nonsmart Sensor"}, {"paperId": "8baf091097e90426e061d4e2b31c77343f4d68d6", "title": "The Power of Internet of Things (IoT): Connecting the Dots with Cloud, Edge, and Fog Computing"}, {"paperId": "363e0dcbbf8827031f33b68173512988db8747cc", "title": "An Event and Service Mesh Architecture Supporting Service Integration in Society 5.0 enabled Smart Cities"}, {"paperId": "64ee44cf384988bafe45d944bd9cf5d1d67031fc", "title": "Interoperability Framework for Cyber-Physical Systems Based Capabilities"}, {"paperId": "7041f207321201d4557430d2dac49ed208141b27", "title": "INTERPRET: An INtegrated and adapTive framEwoRk to support Policy-makers in the urban EnvironmenT"}, {"paperId": "4e64291ab49251d8c72677fcee449e6698e4418e", "title": "Analysis of Standardization Activities for City Resilience From Research Projects"}, {"paperId": "7dc05d885af8777b47b34a9c520e8f89214ff28d", "title": "FloWare: a model-driven approach fostering reuse and customisation in IoT applications modelling and development"}, {"paperId": "2c709cfa94e81cf75ed4b2eb25300943078e00bc", "title": "Intelligent Traffic Light Control System with Priority Lane Intervention"}, {"paperId": "5546b8ff6dec490b365ba0f864c268452a40c306", "title": "Dynamic service composition framework for service‐oriented architectures based e‐government in Cameroon"}, {"paperId": "18ed8ad7610c49cbb4e998dcaa34cb4f23f53c41", "title": "Analysis of Terror Activities and Crimes in Smart Cities"}, {"paperId": "40fa7110100c481a9de8920b2f93d7d92dbb1519", "title": "Smart cities: Understanding policies, standards, applications and case studies"}, {"paperId": "5edcf09556d4b6d3ff274adaa2505add37e93d2c", "title": "A Framework for the Composition of IoT and CPS Capabilities"}, {"paperId": "025ecad164fb35caf0f71f2abbe3c41e7ac2b45a", "title": "Role of Smart Buildings in Smart City—Components, Technology, Indicators, Challenges, Future Research Opportunities"}, {"paperId": "55de3e6509cf99a7114ab80105800ad8c40ab476", "title": "Integrated Service Discovery and Placement in Information-Centric Vehicular Network Slices"}, {"paperId": "0e265f4650035783300ccc0346d2d6692644b7f0", "title": "Internet of Things-enabled Passive Contact Tracing in Smart Cities"}, {"paperId": "1969388b7bdbab7b34a3a90506a6b8557b590925", "title": "Federation Based on MQTT for Urban Humanitarian Assistance and Disaster Recovery Operations"}, {"paperId": "3132a79cbeafbc74c66697165831402f6b6da4d4", "title": "Design of IOT-Based Smart Laundry Applications Using Fuzzy Algorithms"}, {"paperId": "2cfdb42eea683f53c1223d24c768e3fd5915a21e", "title": "IoT-enabled Knowledge Extraction and Edge Device Sustainability in Smart Cities"}, {"paperId": "6a79fedd4fe80f049c337694a86321c836addf87", "title": "Future Trends and Current State of Smart City Concepts: A Survey"}, {"paperId": "4a717d64e590713567f2a07e8a1a7b1d7ef8eefa", "title": "Building Dynamic Communities of Interest for Internet of Things in Smart Cities"}, {"paperId": "ba82a8af05b51ee31298438bf399789ff7518889", "title": "UAV-Aided Edge/Fog Computing in Smart IoT Community for Social Augmented Reality"}, {"paperId": "f8d0a4dfb17fb08595529a2d2d935f308a39b05e", "title": "Embracing Modern Technologies and Urban Development Trends: Initial Evaluation of a Smart City Enterprise Architecture Frameworks"}, {"paperId": "a1ef121161c2bb029ba4269ccd03564773b5ef3f", "title": "Closing the Loop in Cyber-Physical Systems using Blockchain: Microgrid Frequency Control Example"}, {"paperId": "accadaea4b9d03a0c06861befd1b14b4f0f13566", "title": "UAV-aided Data Collection in Self Organized IoT Network for Social Augmented Reality"}, {"paperId": "b453ebe7cbdb859531fde0e548949093df72b56c", "title": "Towards a conceptual framework for African smart cities semantic data integration"}, {"paperId": "d392a155ed9747a43507f90185799bdd619fd8cd", "title": "Effect of Event-Based Sensing on IoT Node Power Efficiency. Case Study: Air Quality Monitoring in Smart Cities"}, {"paperId": "479cfc8bc50cf244612f2a680f25cdf57f4a196d", "title": "Seleção dinâmica de microsserviços para coreografias"}, {"paperId": "c83f803307db1d6a724e0e59faba03489c131b56", "title": "VICINITY Platform-based Load Scheduling Method by Considering Smart Parking and Smart Appliance"}, {"paperId": "606284168e8777903f117348ac22da61393bb2ec", "title": "IoT Capabilities Composition and Decomposition: A Systematic Review"}, {"paperId": "074badb16f9c90b8da007d479dc978fc7957e944", "title": "Integration of AI and IoT Approaches for Evaluating Cybersecurity Risk on Smart City"}, {"paperId": "7335c668600d7fea117d206b3a5de9d2df558062", "title": "A Decade Review on Smart Cities: Paradigms, Challenges and Opportunities"}, {"paperId": "6e94955753cc9b9369652bfab8b4f688cf0e53ee", "title": "Enabling Customizable Services for Multimodal Smart Mobility With City-Platforms"}, {"paperId": "761e5d6a169cb8e5140b320c13e2576c0bceb7e9", "title": "Design and Development of Smart City IoT Solution"}, {"paperId": "849276ee49b36c9bc574b06418e01eeab88e8558", "title": "Role of Semantics in Smart City Applications"}, {"paperId": "86b0999720c0f27d94799c7464c8f199279d94f1", "title": "Cybersecurity Risk of IoT on Smart Cities"}, {"paperId": "5c962929543b0df60ddd1484c21950d8c43f9bf1", "title": "Decision-Making Based on Risk Assessment on Smart Cities"}, {"paperId": "a8a18b2f56fdc6389268e6a5c13559745b7a3bb3", "title": "Service Relationship Orchestration: Lessons Learned From Running Large Scale Smart City Platforms on Kubernetes"}, {"paperId": "30ed001374174cc7798abd52db0402338091853d", "title": "bIoTope: Building an IoT Open Innovation Ecosystem for Smart Cities"}, {"paperId": "ce6425ba1b038f78d82878699f276ee8ed0b7ffa", "title": "A Comprehensive Study of the IoT Cybersecurity in Smart Cities"}]}
