{"paperId": "b572b5d2ffbfe797537665f456d9456ab0666d94", "publicationVenue": {"id": "e0dbf116-86aa-418d-859f-a49952d7e44a", "name": "Transactions of the Association for Computational Linguistics", "type": "journal", "alternate_names": ["Trans Assoc Comput Linguistics", "TACL"], "issn": "2307-387X", "url": "https://www.mitpressjournals.org/loi/tacl", "alternate_urls": ["http://www.transacl.org/"]}, "title": "Can Authorship Representation Learning Capture Stylistic Features?", "abstract": "Abstract Automatically disentangling an author’s style from the content of their writing is a longstanding and possibly insurmountable problem in computational linguistics. At the same time, the availability of large text corpora furnished with author labels has recently enabled learning authorship representations in a purely data-driven manner for authorship attribution, a task that ostensibly depends to a greater extent on encoding writing style than encoding content. However, success on this surrogate task does not ensure that such representations capture writing style since authorship could also be correlated with other latent variables, such as topic. In an effort to better understand the nature of the information these representations convey, and specifically to validate the hypothesis that they chiefly encode writing style, we systematically probe these representations through a series of targeted experiments. The results of these experiments suggest that representations learned for the surrogate authorship prediction task are indeed sensitive to writing style. As a consequence, authorship representations may be expected to be robust to certain kinds of data shift, such as topic drift over time. Additionally, our findings may open the door to downstream applications that require stylistic representations, such as style transfer.", "venue": "Transactions of the Association for Computational Linguistics", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-22", "journal": {"name": "Transactions of the Association for Computational Linguistics", "pages": "1416-1431", "volume": "11"}, "authors": [{"authorId": "2116558550", "name": "Andrew Wang"}, {"authorId": "25054334", "name": "Cristina Aggazzotti"}, {"authorId": "2217202891", "name": "R. Kotula"}, {"authorId": "145778410", "name": "Rafael A. Rivera Soto"}, {"authorId": "134363428", "name": "M. Bishop"}, {"authorId": "145580321", "name": "Nicholas Andrews"}], "citations": [{"paperId": "1d39c86425146b4b88a8dad8702e70bb1fa60fc6", "title": "Learning to Generate Text in Arbitrary Writing Styles"}, {"paperId": "311841075acf5a5b38d807c68fa9f55e4aa274bf", "title": "A Ship of Theseus: Curious Cases of Paraphrasing in LLM-Generated Texts"}, {"paperId": "ab00e0ab1bb84c4b1e1cee72125d8c8dec8d70bf", "title": "Can Authorship Attribution Models Distinguish Speakers in Speech Transcripts?"}]}
