{"paperId": "b574d69f36e73a485b8fda5464c789b29a8382af", "publicationVenue": {"id": "449b5e8b-cda2-4a8e-b27b-9b7917ded9eb", "name": "Journal of Computer Science", "type": "journal", "alternate_names": ["Journal of Computational Science", "J Comput Sci"], "issn": "1549-3636", "alternate_issns": ["1877-7503", "2362-0110"], "url": "https://thescipub.com/journals/jcs/", "alternate_urls": ["http://ansinet.org/sciencepub/c4p.php?j_id=jcs", "https://www.journals.elsevier.com/journal-of-computational-science", "http://journals.sjp.ac.lk/index.php/jcs", "http://www.sciencedirect.com/science/journal/18777503"]}, "title": "Smart Agriculture and Food Industry with Blockchain and Artificial Intelligence", "abstract": "Corresponding Authors: Nasurudeen Ahamed N Computer Science and Engineering, School of Engineering, Presidency University, Bengaluru, Karnataka, India Email: nasurudeenahamed@presidencyuniversity.in Abstract: Horticulture is one of the most major human exercises everywhere. Brilliant horticulture incorporates a bunch of advances, gadgets, conventions and computational ideal models to improve farming cycles. Blockchain, Big information, man-made consciousness, cloud and edge processing give capacities and answers for keeping, storing and investigating the huge information created by parts. The entry of a yield from the maker to the purchaser is followed by a cultivating store network. A reasonable stage that grants association individuals to the ranch together is a blockchain-based cultivating store network. This technique dispenses with the necessity for a unified confided in power, go-betweens and business narratives, developing creation and security through supporting outrageous trustworthiness, obligation and wellbeing. In, Industry 4.0 is one of the smart manufacturing methods in various industrial fields. It’s one to create the opportunity nowadays in mass production of the many industry fields. Such as Agricultural Industry, Food Industry, Automotive Industry, Textile Industry, Logistics, etc., In this 4.0 version, we have utilized the human workers more. even though such good technologies like Big Data, Cloud Computing, IoT, etc., To reduce the Human Work Efforts and Save their lives to enhance the technology, that is to turn Supply Chain Management 4.0 into Supply Chain Management 5.0. To, Testing and Creating the Driverless Vehicle for Transporting Using Distributed Ledger Technology. In, The Smart Contract we have to Implement the Face Recognition of Those who send the Agricultural Goods. When Consumer to Read the Smart Contract to satisfy the Face Recognition from the appropriate Producer. This one increases the trustworthiness of Relation between Producer and Consumer. Supply Chain Management 5.0 to Integrate the Emerging technologies in this study such as blockchain and Artificial Intelligence. In, this version to Collaborate the Human and Robot Working. Eventually, it create a Smart Manufacturing Technology in the agricultural food supply chain industry.", "venue": "Journal of Computer Science", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-01-01", "journal": {"name": "Journal of Computer Science"}, "authors": [{"authorId": "120130665", "name": "N Nasurudeen Ahamed"}, {"authorId": "2066079935", "name": "R. Vignesh"}], "citations": [{"paperId": "f05769699c45e7611f5eb9fc879c21f8e53f3887", "title": "Blockchain technology for society 4.0: a comprehensive review of key applications, requirement analysis, research trends, challenges and future avenues"}, {"paperId": "bb919478099641e686221702ecd4f2bc23d7864d", "title": "Integrated Service Architecture to Promote the Circular Economy in Agriculture 4.0"}, {"paperId": "15897ba1174bc1965f5a153a09422815a46887e8", "title": "Artificial Intelligence Innovations: Inception of new horizons in food processing sector"}, {"paperId": "3609971cf7bbf85dd3a8a3d597c2328c5ecba712", "title": "Mapping a Strategic Human Resource Information System for Society 5.0"}, {"paperId": "5e81db38492f7466e9daa2e6dc2486f11aa80488", "title": "Blockchain-Based Frameworks for Food Traceability: A Systematic Review"}, {"paperId": "4a0d90db169d5e770df3cc38cba1c7917edd24be", "title": "Artificial intelligence and new business models in agriculture: a structured literature review and future research agenda"}, {"paperId": "6b1f36f8c87d4b6a05f513fefe8dea5ad42df087", "title": "Open Innovation in Agribusiness: Barriers and Challenges in the Transition to Agriculture 4.0"}, {"paperId": "851ffba8830c745e8ab1db6d9c60fa855eca93d1", "title": "A critical analysis of the integration of blockchain and artificial intelligence for supply chain"}, {"paperId": "d96e45459604d7727ed8ae37aafc70475b570127", "title": "Supply Chain Quality Management and Industry 5.0 - A Literature Review and Analysis"}, {"paperId": "c4e0f948fbb943683f7b920e163aa7d24224c3b7", "title": "LOGISTICS 4.0 TOWARD CIRCULAR ECONOMY IN THE AGRI-FOOD SECTOR"}, {"paperId": "a33f15792fad7cffa12de073fe91ed8dba84564d", "title": "Survey on the Applications of Blockchain in Agriculture"}, {"paperId": "b160295a2e3c021e75fe7568e0720aef4e9cd0fd", "title": "Harnessing the power of blockchain in the agri-food sector: a meta-analysis of current research and best practices"}]}
