{"paperId": "b57be6d084c81a7a7d1b88259c72d870a87f6a9b", "publicationVenue": {"id": "721ed878-9136-408b-b2a3-dce27b9fa39e", "name": "Journal of Personalized Medicine", "type": "journal", "alternate_names": ["J Pers Med"], "issn": "2075-4426", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-225205", "alternate_urls": ["https://www.mdpi.com/journal/jpm", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-225205"]}, "title": "Personalised Medicine—Implementation to the Healthcare System in Europe (Focus Group Discussions)", "abstract": "Background: Personalized medicine (PM) is an approach based on understanding the differences between patients with the same disease and represents a change from the “one size fits all” concept. According to this concept, appropriate therapies should be selected for specific groups of patients. PM makes it possible to predict whether a particular therapy will be effective for a particular patient. PM will still have to overcome many challenges and barriers before it can be successfully implemented in healthcare systems. However, it is essential to remember that PM is not a medical revolution but an evolution. Methods: Three focus groups were conducted, to achieve the purpose of this study, which was to identify the barriers and facilitators existing to the implementation of PM and to highlight existing practices in European countries. Focus group discussions covered the areas of barriers and facilitators to the implementation of personalized medicine. Results: This section describes the results of the focus groups that covered the areas of barriers and facilitators of personalized medicine implementation. Conclusions: Personalized medicine faces many challenges and barriers before it can be successfully implemented in health systems. The translation of PM to European countries, differences in regulations, high costs of new technologies, and reimbursement are the reasons for the delay in PM implementation.", "venue": "Journal of Personalized Medicine", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-02-21", "journal": {"name": "Journal of Personalized Medicine", "volume": "13"}, "authors": [{"authorId": "2006780366", "name": "Dorota Stefanicka-Wojtas"}, {"authorId": "3774599", "name": "D. Kurpas"}], "citations": [{"paperId": "9896772a4fcae5168ab70ce051990e7b81fb600c", "title": "Joint Expedition: Exploring the Intersection of Digital Health and AI in Precision Medicine with Team Integration"}, {"paperId": "b90ac31e6b09b7095ac3626cb4e3eed49332344d", "title": "5 P consortium “Children’s Medicine”"}, {"paperId": "4bc8bea6082f6b0ecea329ad7c742f05f31d9545", "title": "Revolutionizing Kidney Transplantation: Connecting Machine Learning and Artificial Intelligence with Next-Generation Healthcare—From Algorithms to Allografts"}, {"paperId": "3660c08910733bc723b0248b48f08b45265b784f", "title": "Patient-centered precision care in anaesthesia – the PC-square (PC)2 approach"}, {"paperId": "6381dbb85242dff9177271013c776612956f7f3f", "title": "Emerging perspectives on RNA virus-mediated infections: from pathogenesis to therapeutic interventions"}, {"paperId": "ae69d50524cc3069c352809b8ea724a9802e5079", "title": "Editorial: Personalized medicine—Where do we stand regarding bench to bedside translation?"}]}
