{"paperId": "b587165627a09a90781ff0f816a2fc0b82a6b688", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Federated Learning in Edge Computing: A Systematic Survey", "abstract": "Edge Computing (EC) is a new architecture that extends Cloud Computing (CC) services closer to data sources. EC combined with Deep Learning (DL) is a promising technology and is widely used in several applications. However, in conventional DL architectures with EC enabled, data producers must frequently send and share data with third parties, edge or cloud servers, to train their models. This architecture is often impractical due to the high bandwidth requirements, legalization, and privacy vulnerabilities. The Federated Learning (FL) concept has recently emerged as a promising solution for mitigating the problems of unwanted bandwidth loss, data privacy, and legalization. FL can co-train models across distributed clients, such as mobile phones, automobiles, hospitals, and more, through a centralized server, while maintaining data localization. FL can therefore be viewed as a stimulating factor in the EC paradigm as it enables collaborative learning and model optimization. Although the existing surveys have taken into account applications of FL in EC environments, there has not been any systematic survey discussing FL implementation and challenges in the EC paradigm. This paper aims to provide a systematic survey of the literature on the implementation of FL in EC environments with a taxonomy to identify advanced solutions and other open problems. In this survey, we review the fundamentals of EC and FL, then we review the existing related works in FL in EC. Furthermore, we describe the protocols, architecture, framework, and hardware requirements for FL implementation in the EC environment. Moreover, we discuss the applications, challenges, and related existing solutions in the edge FL. Finally, we detail two relevant case studies of applying FL in EC, and we identify open issues and potential directions for future research. We believe this survey will help researchers better understand the connection between FL and EC enabling technologies and concepts.", "venue": "Italian National Conference on Sensors", "year": 2022, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2022-01-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "22"}, "authors": [{"authorId": "2058186136", "name": "Haftay Gebreslasie Abreha"}, {"authorId": "144060550", "name": "M. Hayajneh"}, {"authorId": "2394689", "name": "M. Serhani"}], "citations": [{"paperId": "a4fe0c4ab612d5a50423c4e1fbf1d7c184bb513e", "title": "Federated Computing -- Survey on Building Blocks, Extensions and Systems"}, {"paperId": "e85da6a8c542046a6222b64372ceb9913a756a7d", "title": "A collective AI via lifelong learning and sharing at the edge"}, {"paperId": "1d10aa5e7122d1df6d559999987c76de3a088f62", "title": "Training Machine Learning models at the Edge: A Survey"}, {"paperId": "d5f7f1b4a8cc0cd55d1e008e9f8362c09c00b6fd", "title": "Data Privacy Protection: A Novel Federated Transfer Learning Scheme for Bearing Fault Diagnosis"}, {"paperId": "3eecd574a03b566bb16bf6fb011faef32aa26ac8", "title": "Federated Learning for Iot/Edge/Fog Computing Systems"}, {"paperId": "4de608d7ba86913b3cea944fc42677457338aacd", "title": "Achieving Linear Speedup in Asynchronous Federated Learning with Heterogeneous Clients"}, {"paperId": "527a472221aac813c2bba193c672e366d6502fc6", "title": "Digital Twin-Assisted Federated Learning Service Provisioning Over Mobile Edge Networks"}, {"paperId": "f641b9d771427ad995359d9747ec613bafa4afe9", "title": "Leveraging pervasive computing for ambient intelligence: A survey on recent advancements, applications and open challenges"}, {"paperId": "a991763f32c363764f9b5e78bb0a62ff80b6053b", "title": "Collaborative Security in Wireless Networks and Vulnerabilities Assessment for Fintech E-payment Companies: A Bibliometric Analysis"}, {"paperId": "ffea42f3def4acf6c8e5c7c153b109b744db13d9", "title": "Quantum Variational Algorithms for the Allocation of Resources in a Cloud/Edge Architecture"}, {"paperId": "e54f63c5688cffeea55494e80ecadcfc7324bc24", "title": "Contrastive Learning in Distilled Models"}, {"paperId": "cf49053301ad903f13873906e6e7c6a050ae7783", "title": "Privacy preservation using optimized Federated Learning: A critical survey"}, {"paperId": "25991bfc1f65e222139274e22bd706ebb0e6a18a", "title": "Addressing Heterogeneity in Federated Learning with Client Selection via Submodular Optimization"}, {"paperId": "2256d66868f630eafc500239926620c517c89ec4", "title": "Cloud-Edge-End Collaboration Personalized Semi-supervised Federated Learning for Visual Localization"}, {"paperId": "20e1be590a1d8566ecf9dddb15d627b60efd1c14", "title": "Resource Sharing among Edge Service Providers: Modeling and Solution"}, {"paperId": "91b3cc4de146395ef0213994276eee78da77ae1e", "title": "From Cyber–Physical Convergence to Digital Twins: A Review on Edge Computing Use Case Designs"}, {"paperId": "2bc05a09e6aa691016f38e0d8dc6f245d29dc32f", "title": "Resource-Aware Federated Hybrid Profiling for Edge Node Selection in Federated Patient Similarity Network"}, {"paperId": "944a6f0306ccbec865c6d8168bab5518606c1ad0", "title": "Federated Learning on Raspberry Pi 4: A Comprehensive Power Consumption Analysis"}, {"paperId": "ab550af927459aaffe964f29d09a6fcac633fbbc", "title": "A state-of-the-art on federated learning for vehicular communications"}, {"paperId": "e0d0fbc9df6ed1c75471aecb648083f70c2dbb02", "title": "Federated Learning for Privacy-Preserving Prediction of Occupational Group Mobility Using Multi-Source Mobile Data"}, {"paperId": "2b14a7e4a2c6a4f9021eaa7a7b2ead5982f6fffa", "title": "Federated Learning for Resource Management in Edge Computing"}, {"paperId": "7621658bddb7e1cb30f0bd51ee44b721d3318575", "title": "FL-SERENADE: Federated Learning for SEmi-supeRvisEd Network Anomaly DEtection. A Case Study"}, {"paperId": "b50515dfb4d3474845e23e25c9e62e7ca1b3e8fb", "title": "FLIBD: A Federated Learning-Based IoT Big Data Management Approach for Privacy-Preserving over Apache Spark with FATE"}, {"paperId": "e45f0eb5853c6dd3ace175cc81345ace7045f401", "title": "A Review of Client Selection Methods in Federated Learning"}, {"paperId": "111ec99da6e2fb2e78620afdf85374a3018f39a5", "title": "Advancing Federated Learning through Verifiable Computations and Homomorphic Encryption"}, {"paperId": "db0950885c365456eda8d4e02a9e3d00e7acbba2", "title": "Preserving the Privacy in IoT Medical data in Edge Computing using Modified AES Model with Discrete-Time Alternating Quantum Walk"}, {"paperId": "58db50b76db95e8a8a9f4507c79eba452176735a", "title": "Role of federated learning in edge computing: A survey"}, {"paperId": "de8cae4966b60f8ded2ea5df86ed7e1158e10405", "title": "Edge assignment in edge federated learning"}, {"paperId": "9ccab66055c87291729113208a3cb7cdc5c1b4f2", "title": "FedMicro-IDA: A federated learning and microservices-based framework for IoT data analytics"}, {"paperId": "a9cfe368b83a64ff31ca00f2624ca25f5f471419", "title": "Medical Imaging Applications of Federated Learning"}, {"paperId": "1454f93f343473ad906cf4d491fe32ecbe11f281", "title": "Enabling Federated Learning at the edge through the IOTA Tangle"}, {"paperId": "0f5976b1f1dd76e168998ace915d9fd5079b9963", "title": "A comprehensive review on federated learning based models for healthcare applications"}, {"paperId": "872329214c517516a8ebf20784b0ef71733004a2", "title": "A Survey on Collaborative Learning for Intelligent Autonomous Systems"}, {"paperId": "c3d30774cce46b88bab691c03c01512a28eb5eb8", "title": "Improving Communication Systems Through Federated Learning: An Optimization of Decision-Making"}, {"paperId": "6c91ff414b916fa6650fd949a152e9c0ea9b16c4", "title": "On the Feasibility of Zero-Trust Architecture in Assuring Security in Metaverse"}, {"paperId": "9d71228f85f8ce1e793359b5090ef91d0e3cf8ad", "title": "FIDEL: Fog integrated federated learning framework to train neural networks"}, {"paperId": "919aa15f4ec9b5fb11caf475de79c4214324a7b1", "title": "A review on client selection models in federated learning"}, {"paperId": "816bc97d23454f27982e6d5e4043c936acdef977", "title": "Applying Toroidal k-ary Grids for Optimizing Edge Data Centers"}, {"paperId": "1879ede86d1450b150e821902a5a3493cd74181e", "title": "Enhancing QoS with LSTM-Based Prediction for Congestion-Aware Aggregation Scheduling in Edge Federated Learning"}, {"paperId": "bff83319672f0042466599d81d902dee9394663b", "title": "Limitations and Future Aspects of Communication Costs in Federated Learning: A Survey"}, {"paperId": "e9fa183bf0bb5d52b7cb4435f9850591cd734419", "title": "From Data Governance by design to Data Governance as a Service: A transformative human-centric data governance framework"}, {"paperId": "6261f312ddf4918c7261f782aad12f99d276664d", "title": "Federated Learning Over Wireless Networks: Challenges and Solutions"}, {"paperId": "8aa60a034da00db904d8eeac164718635bb0ae61", "title": "An Application for Federated Learning of XAI Models in Edge Computing Environments"}, {"paperId": "cbb6a4665dca1a9a61d39b5e62676b37e4e2822b", "title": "Heterogeneous Sensor Data Acquisition and Federated Learning for Resource Constrained IoT Devices—A Validation"}, {"paperId": "17132c235492b5496c3e88a365221d71ee929a05", "title": "EMI and IEMI Impacts on the Radio Communication Network of Electrified Railway Systems: A Critical Review"}, {"paperId": "8dfb23e5dd2c5376a47ac18e8bd5f9a3134641f0", "title": "Federated Transfer Learning Strategy: A Novel Cross-Device Fault Diagnosis Method Based on Repaired Data"}, {"paperId": "d8dafb41a12b90e9a96305b095cc07a694160ae7", "title": "FedFog - A federated learning based resource management framework in fog computing for zero touch networks"}, {"paperId": "e38aac8406dad18f5ff9f481a15b69db7c2e581d", "title": "Federated Edge Intelligence and Edge Caching Mechanisms"}, {"paperId": "b9cdd2a5fef52ef26ed5c2427e951f7a8b08704b", "title": "Federated Learning on Edge Devices in a Lunar Analogue Environment"}, {"paperId": "12f0a8244f730a3fa1fec001fc3e49fb5e64f4f7", "title": "A memory footprint optimization framework for Python applications targeting edge devices"}, {"paperId": "858bd4ed56012c1460f329ac7ad8f7ce4a208884", "title": "Empowering Patient Similarity Networks through Innovative Data-Quality-Aware Federated Profiling"}, {"paperId": "97dcb6e6f57d18f2b0138672b0c0fcabd0678991", "title": "Arithmetic Study about Efficiency in Network Topologies for Data Centers"}, {"paperId": "845b0e8108dc9973134ae1f9e1e1b9b0b92f5dab", "title": "A Systematic Literature Review on Client Selection in Federated Learning"}, {"paperId": "c1bb8b3e72775150f333070a00a3ec528073df98", "title": "Embedded federated learning over a LoRa mesh network"}, {"paperId": "563c265cb3d9904504ec6a7f58311b7f7036ddba", "title": "FedPredict: Combining Global and Local Parameters in the Prediction Step of Federated Learning"}, {"paperId": "a8d664656f6543754a6a2189d044fbc8959c40c7", "title": "WeiAvg: Federated Learning Model Aggregation Promoting Data Diversity"}, {"paperId": "e6e1d137304a0795b5f6c632b8f4216dca0976db", "title": "A Comparative Study on Cloud and Edgeb Computing: A Survey on Current Research Activities and Applications"}, {"paperId": "269b08aad182bb3d5f1b2e6f1f0c1ec5f1d3275b", "title": "A Docker-based federated learning framework design and deployment for multi-modal data stream classification"}, {"paperId": "910e4b7dbbc92b86eef3e82d1430cd760a64ad50", "title": "Decentralized Federated Deep Learning Image Recognition Models"}, {"paperId": "38aeb987e7f2bb75d9851ae291b2842b83d2574e", "title": "Collaborative Edge-Cloud AI for IoT Driven Secure Healthcare System"}, {"paperId": "c34ecc8fc9098e28d4d83ae4cb2b19bfc1022d3f", "title": "Efficient Federated Learning Method for Cloud-Edge Network Communication"}, {"paperId": "002019b0142b04acbc7afa17391949d518183f20", "title": "FedSDM: Federated learning based smart decision making module for ECG data in IoT integrated Edge-Fog-Cloud computing environments"}, {"paperId": "d8dcf5eb6dd4b242dfedb4535bc66fcb682bc194", "title": "Tactile internet of federated things: Toward fine-grained design of FL-based architecture to meet TIoT demands"}, {"paperId": "bdb671d3cb0a08ca9482b3cf6ac6612b859bbf27", "title": "Resource Management in Mobile Edge Computing: A Comprehensive Survey"}, {"paperId": "0f44eefae8b95c975e2abb0a1a22bf68efde0731", "title": "Federated reinforcement learning approach for detecting uncertain deceptive target using autonomous dual UAV system"}, {"paperId": "9212ba44efe8890f9825b7d91adb775ef13772e5", "title": "A Comprehensive Review and a Taxonomy of Edge Machine Learning: Requirements, Paradigms, and Techniques"}, {"paperId": "499ef580445c64a2cdca9fd03ec64f03d9559975", "title": "A Survey on Optimization Techniques for Edge Artificial Intelligence (AI)"}, {"paperId": "229bbca81e2f20ecfdbe6ec46461df4a3a10ca6e", "title": "On the Adoption of Modern Technologies to Fight the COVID-19 Pandemic: A Technical Synthesis of Latest Developments"}, {"paperId": "071de7472b63d03dacb51eb239ca1e2f219584e2", "title": "Unlocking Metaverse-as-a-Service The three pillars to watch: Privacy and Security, Edge Computing, and Blockchain"}, {"paperId": "08396be95594f4255a35887a63ec7ecbbbf7b11a", "title": "Characterization of the Global Bias Problem in Aerial Federated Learning"}, {"paperId": "0f8dea3cbd1ac39df7849b33bf9cc381f731524e", "title": "Federated Learning for Condition Monitoring of Industrial Processes: A Review on Fault Diagnosis Methods, Challenges, and Prospects"}, {"paperId": "8af463a4e9d861631c10ca5485e4b5e9c2279342", "title": "Federated learning in cloud-edge collaborative architecture: key technologies, applications and challenges"}, {"paperId": "aba93f864e95de978d3c85b61138d60826d9c8a7", "title": "Federated System for Transport Mode Detection"}, {"paperId": "deb15fc817313d56362404c297bd6be93141a00d", "title": "Federated Learning Algorithms with Heterogeneous Data Distributions: An Empirical Evaluation"}, {"paperId": "11fd6d34a3659ddb5cb4ff731830bbbe01b7605a", "title": "Federated Deep Reinforcement Learning-Based Caching and Bitrate Adaptation for VR Panoramic Video in Clustered MEC Networks"}, {"paperId": "ac38dd13d0bc9728532bb2227f906658be94edae", "title": "Smart and Sentient Retail High Streets"}, {"paperId": "7ab21cee65ffc2b04878f073844b6a709f84c64e", "title": "Mobile Communication landscape: From 1G to 4G and the interest of 5G in Pakistan"}, {"paperId": "8d772545f12ab6722064a4daae02c72230702334", "title": "Research on Open Innovation Intelligent Decision-Making of Cross-Border E-Commerce Based on Federated Learning"}, {"paperId": "e64662588f74b56355685a8e57afb240590312e4", "title": "Occupancy Prediction in Buildings: An approach leveraging LSTM and Federated Learning"}, {"paperId": "0719082b6cad16c8d434d78ddbd3f2e0769ce78c", "title": "Toward Collaborative Intelligence in IoV Systems: Recent Advances and Open Issues"}, {"paperId": "6ea4839e9a47b8b0248c5b4d14e2f8d6b6515530", "title": "Parameter-Efficient Federated Learning for Edge Computing with End Devices Resource Limitation"}, {"paperId": "5baf76f0d3608b867a7f87dc38adb7eef0ea744d", "title": "FedComm: Understanding Communication Protocols for Edge-based Federated Learning"}, {"paperId": "3a27cc3f676da202bef0f011316c3ab8baedaf7b", "title": "RCAD: Real-time Collaborative Anomaly Detection System for Mobile Broadband Networks"}, {"paperId": "2cd815c256f1370908f3b7bba15ec1b80b31d707", "title": "Reinforcement learning for intelligent online computation offloading in wireless powered edge networks"}, {"paperId": "b57859613cd062af5b71e724f068693c30b5bee7", "title": "Resource-Saving Customizable Pipeline Network Architecture for Multi-Signal Processing in Edge Devices"}, {"paperId": "87f80c887f1291ceb82aa995311e1cd2a4fa3a80", "title": "Federated recommenders: methods, challenges and future"}, {"paperId": "11c98d5d27db5859d069217ca6114a9d5f09d6dc", "title": "Edge-enabled Federated Learning for Vision based Product Quality Inspection"}, {"paperId": "d35e6ad6f3778efd965c1282170befc87bab25b0", "title": "Scaling distributed artificial intelligence/machine learning for decision dominance in all-domain operations"}, {"paperId": "07d144c4d003941e3735844cdb4c4b80cb94e21b", "title": "Quality-Aware Incentive Mechanism Design Based on Matching Game for Hierarchical Federated Learning"}, {"paperId": "d55812411833ed49c337099489ef0893390f7ed1", "title": "Deep Federated Adaptation: An Adaptative Residential Load Forecasting Approach with Federated Learning"}, {"paperId": "2c2f5702414f87d69771514bc624582979653fd5", "title": "A federated learning framework for cyberattack detection in vehicular sensor networks"}, {"paperId": "08f26fa138c957d0b519440e874d27ff6f544d50", "title": "Imaging With Deep Learning: Sharpening the Cutting Edge."}, {"paperId": "aadf105aa210cb108a957d2cb3fcafd794e0dd72", "title": "DACFL: Dynamic Average Consensus-Based Federated Learning in Decentralized Sensors Network"}, {"paperId": "1c0bcc0c5eee0fab9a41b7248e16f1103b52ed49", "title": "Review on Approaches of Federated Modeling in Anomaly-Based Intrusion Detection for IoT Devices"}, {"paperId": "9063881e0e50e15302b818b8abb19e770f0f618d", "title": "FTSDC: A novel federated transfer learning strategy for bearing cross-machine fault diagnosis based on dual-correction training"}, {"paperId": "261076769de03153610475bae0748308a5dd2fbc", "title": "Energy-Efficient Federated Learning With Resource Allocation for Green IoT Edge Intelligence in B5G"}, {"paperId": "2a19b9e3265bc862eb053df1fd6bd696f844b4b8", "title": "Experimental Evaluation and Analysis of Federated Learning in Edge Computing Environments"}, {"paperId": "3203a589155a01b30498a8bc46bebb25bfb2319a", "title": "Dynamic Data Sample Selection and Scheduling in Edge Federated Learning"}, {"paperId": "c3acc9fd01af3f2df1d31a1d1cc742f0a105d656", "title": "Federated Learning for edge computing: Real-Time Object Detection"}, {"paperId": "01404a50a3c0c065da3391c60dda49a0cab36251", "title": "A Review and a Taxonomy of Edge Machine Learning: Requirements, Paradigms, and Techniques"}, {"paperId": "78c44fdb009c296168f820f828bd7c6ffddf89c5", "title": "Hierarchical Federated Learning for Edge Intelligence through Average Consensus"}, {"paperId": "9b8aabefe970826aa3c9e5ea21586ebb45748c0e", "title": "Enabling Deep Learning for All-in EDGE paradigm"}, {"paperId": "65b1e3e9168611d82142fe0288738bedb5e366fd", "title": "A Two-Stage Incentive Mechanism Design for Quality Optimization of Hierarchical Federated Learning"}, {"paperId": "df5f9d63f5b9f43c09818f13066d819e8ba7b161", "title": "An eﬃcient architecture for edge data center networks"}, {"paperId": "60c00529b1ddfaf8af8ca900eb87f06d1d3ca995", "title": "Resource-Aware Federated Hybrid Proﬁling for Edge Node Selection in Federated Patient Similarity Network"}, {"paperId": "b037687e1a0b8f2a9b248ea66c8d96de98232696", "title": "Arithmetic Study about Efﬁciency in Network Topologies for Data Centers"}]}
