{"paperId": "b59b09ff3c7a27d06871389ae8d504492d2c597b", "publicationVenue": null, "title": "Predicting Study or Work From Home Satisfaction using Data Mining Technique: A Case Study in Malaysia", "abstract": "The COVID-19 pandemic has urged the government of Malaysia to implement Movement Control Order (MCO) which forces working people to work from home while students to study from home. People’s satisfaction on work from home is crucial in determining their work productivity and efficiency whereas student’s satisfaction on study from home is important for their learning effectiveness. There is no work has been done yet for exploring data mining techniques to build a model for predicting work or study from home satisfaction using Malaysia as a case study. This paper aimed to identify the best data mining model for predicting the work or study from home satisfaction. The prediction model is learned by analyzing the demographic, the personality traits, and the work from home experience collected from a group of Malaysia people. This study attempts to investigate four data mining techniques that are the decision tree, linear kernel support vector machine, polynomial support vector machine, and radial basis support vector machine. Experiment results show that the radial basis support vector machine outperformed other techniques in predicting the work or study from home satisfaction of Malaysia’s community.", "venue": "2022 International Conference on Green Energy, Computing and Sustainable Technology (GECOST)", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Conference"], "publicationDate": "2022-10-26", "journal": {"name": "2022 International Conference on Green Energy, Computing and Sustainable Technology (GECOST)", "pages": "458-461"}, "authors": [{"authorId": "3232593", "name": "F. Sia"}, {"authorId": "2200620194", "name": "Lim Hong Yao"}, {"authorId": "2200527893", "name": "Tuen Yong Hao"}, {"authorId": "2200553695", "name": "Peter Chin"}, {"authorId": "2200551078", "name": "Lim Min Xuan"}], "citations": []}
