{"paperId": "b5a80f7fd24a7286c2665f4bb485378b694885f8", "publicationVenue": null, "title": "Measuring the Impact of Machine Learning on Real-Time Data Analysis", "abstract": "Machine studying is unexpectedly revolutionizing the manner facts is analyzed and utilized in actual-time selections. with the aid of utilising effective algorithms, gadget gaining knowledge of can unlock effective insights from actual-time input statistics greater speedy and as it should be than traditional strategies. however, to make sure its fulfillment and effectiveness, there have to be a quantitative size procedure to assess how device studying algorithms are impacting the effectiveness of actual-time information evaluation. This paper pursuits to provide a comprehensive evaluation of the cutting-edge nation of device learning and its effect on actual-time facts analysis, as well as unique techniques to degree the effectiveness of device learning algorithms. specifically, the paper will observe the use of supervised studying fashions, unsupervised learning fashions, and reinforcement mastering strategies to create efficient and correct fashions that could quickly analyze and produce beneficial insights from real-time statistics. Additionally, this paper will talk various techniques that can be used to quantify the effectiveness of device gaining knowledge of fashions which includes predictive accuracy, records and function selection, and model interpretability. finally, the paper can even discuss challenges and destiny issues for measuring the authentic effect of machine studying on actual-time records analysis.", "venue": "2023 3rd International Conference on Smart Generation Computing, Communication and Networking (SMART GENCON)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-12-29", "journal": {"name": "2023 3rd International Conference on Smart Generation Computing, Communication and Networking (SMART GENCON)", "pages": "1-6"}, "authors": [{"authorId": "2283500577", "name": "A. Rengarajan"}, {"authorId": "2284927830", "name": "Rohit Kumar"}, {"authorId": "2284882538", "name": "Nitin N. Sakhare"}, {"authorId": "2281352267", "name": "N. Thangarasu"}, {"authorId": "2281344077", "name": "V. Mahalakshmi"}, {"authorId": "70283391", "name": "R. Bhimanpallewar"}], "citations": []}
