{"paperId": "b5b2504d262b142ddd9458bc24c2c3d044ffb852", "publicationVenue": {"id": "bea6dbb8-4367-4c35-8e28-e749f3ad107c", "name": "International Conference on Database Theory", "type": "conference", "alternate_names": ["Int Conf Database Theory", "ICDT"], "url": "http://alpha.luc.ac.be/~lucp1080/icdt/"}, "title": "Parallel-Correctness and Parallel-Boundedness for Datalog Programs", "abstract": "Recently, Ketsman et al. started the investigation of the parallel evaluation of recursive queries in the Massively Parallel Communication (MPC) model. Among other things, it was shown that parallel-correctness and parallel-boundedness for general Datalog programs is undecidable, by a reduction from the undecidable containment problem for Datalog. Furthermore, economic policies were introduced as a means to specify data distribution in a recursive setting. In this paper, we extend the latter framework to account for more general distributed evaluation strategies in terms of communication policies. We then show that the undecidability of parallel-correctness runs deeper: it already holds for fragments of Datalog, e.g., monadic and frontier-guarded Datalog, with a decidable containment problem, under relatively simple evaluation strategies. These simple evaluation strategies are deﬁned w.r.t. data-moving distribution constraints. We then investigate restrictions of economic policies that yield decidability. In particular, we show that parallel-correctness is 2EXPTIME-complete for monadic and frontier-guarded Datalog under hash-based economic policies. Next, we consider restrictions of data-moving constraints and show that parallel-correctness and parallel-boundedness are 2EXPTIME-complete for frontier-guarded Datalog. Interestingly, distributed evaluation no longer preserves the usual containment relationships between fragments of Datalog. Indeed, not every monadic Datalog program is equivalent to a frontier-guarded one in the distributed setting. We illustrate the latter by considering two alternative settings where in one of these parallel-correctness is decidable for frontier-guarded Datalog but undecidable for monadic Datalog.", "venue": "International Conference on Database Theory", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": null, "journal": {"pages": "14:1-14:19"}, "authors": [{"authorId": "1786248", "name": "F. Neven"}, {"authorId": "1736032", "name": "T. Schwentick"}, {"authorId": "3016009", "name": "Christopher Spinrath"}, {"authorId": "35740470", "name": "Brecht Vandevoort"}], "citations": [{"paperId": "01585939805c6d6655ea4f10cdf40d327b78665a", "title": "Distribution Constraints: The Chase for Distributed Data"}, {"paperId": "04a025146ce8c923cddc6cb951b960c35a96f6b3", "title": "Distribution Policies for Datalog"}, {"paperId": "3b60e042b789b2d661cb3325dcd7d95a6094b154", "title": "Optimization Problems on The Weighted Massively Parallel Computation Model: Hardness and Algorithms"}, {"paperId": "014b7990cf07c97f86bea6261589eafd0d228aea", "title": "Locality-Aware Distribution Schemes"}, {"paperId": "5db2b2e7618b01a342107764226c1ccb2fc97b69", "title": "23rd International Conference on Database Theory, ICDT 2020, March 30-April 2, 2020, Copenhagen, Denmark"}]}
