{"paperId": "b5b37272c03c84fe5411d756c1032d60599f6608", "publicationVenue": {"id": "bb8ef66c-6ae6-48bc-8837-2307ec09d39f", "name": "Education sciences", "type": "journal", "alternate_names": ["Educ Sci", "Education Sciences", "Educ sci"], "issn": "2063-9546", "alternate_issns": ["2227-7102"], "url": "http://nevelestudomany.elte.hu/", "alternate_urls": ["http://nevelestudomany.elte.hu/?lang=en", "https://www.mdpi.com/journal/education", "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-235892", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-235892"]}, "title": "Cost Analysis in Online Teaching Using an Activity Map", "abstract": "Virtual education has been associated, on some occasions, with economic models of scale that strengthen the mercantilist vision of teaching, thereby raising questions on the quality of the service. Some studies on educational costs associated with this modality simplify the analysis based on individual elements, such as the production of courses or the technological infrastructure, offering an incomplete and biased perspective. This study proposes to carry out a complete analysis of the costs of a virtual university using an Activity-Based Costing (ABC) model to determine the percentage of the budget consumed by each of the activities involved in the training process. The results show the significant influence that instructional design and teaching activities have on virtual modalities (62.5% of the set of activities), thus highlighting the importance of human resources in maintaining educational modalities mediated by technology. Understanding the importance of human capital and its contribution to offering a quality and innovative educational service is fundamental to consolidate a model that can improve access to education for populations with major difficulties.", "venue": "Education sciences", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-16", "journal": {"name": "Education Sciences"}, "authors": [{"authorId": "2090631578", "name": "Nuria Segovia-García"}, {"authorId": "2217788126", "name": "Ester Martín-Caro"}], "citations": []}
