{"paperId": "b5c2b952e0bd42086644cdf12d1f6910720a76dd", "publicationVenue": {"id": "4e46790b-e240-4236-9b8d-a70ed74f900a", "name": "IEEE Transactions on Mobile Computing", "type": "journal", "alternate_names": ["IEEE Trans Mob Comput"], "issn": "1536-1233", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=7755", "alternate_urls": ["http://www.computer.org/portal/web/tmc"]}, "title": "SecureSense: Defending Adversarial Attack for Secure Device-Free Human Activity Recognition", "abstract": "Deep neural networks have empowered accurate device-free human activity recognition, which has wide applications. Deep models can extract robust features from various sensors and generalize well even in challenging situations such as data-insufficient cases. However, these systems could be vulnerable to input perturbations, i.e., adversarial attacks. We empirically demonstrate that both black-box Gaussian attacks and modern adversarial white-box attacks can render their accuracies to plummet. In this paper, we first point out that such phenomenon can bring severe safety hazards to device-free sensing systems, and then propose a novel learning framework, SecureSense, to defend common attacks. SecureSense aims to achieve consistent predictions regardless of whether there exists an attack on its input or not, alleviating the negative effect of distribution perturbation caused by adversarial attacks. Extensive experiments demonstrate that our proposed method can significantly enhance the model robustness of existing deep models, overcoming possible attacks. The results validate that our method works well on wireless human activity recognition and person identification systems. To the best of our knowledge, this is the first work to investigate adversarial attacks and further develop a novel defense framework for wireless human activity recognition in mobile computing research.", "venue": "IEEE Transactions on Mobile Computing", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-04-04", "journal": {"name": "IEEE Transactions on Mobile Computing", "pages": "823-834", "volume": "23"}, "authors": [{"authorId": "2562263", "name": "Jianfei Yang"}, {"authorId": "145791406", "name": "Han Zou"}, {"authorId": "2152786430", "name": "Lihua Xie"}], "citations": [{"paperId": "7c00170d37fd470545b12afa0a5f3faaf958a8fb", "title": "WiSR: Wireless Domain Generalization Based on Style Randomization"}, {"paperId": "0cbc5deda01d8585ccbeb7db2f2aaa669dfd6cca", "title": "Generalizing Wireless Cross-Multiple-Factor Gesture Recognition to Unseen Domains"}, {"paperId": "b581807aaca8e795549ae374c8e0b2fbf0c8e717", "title": "MaskFi: Unsupervised Learning of WiFi and Vision Representations for Multimodal Human Activity Recognition"}, {"paperId": "d3df95d95d260ddf05604067110d54f56c7e143f", "title": "Privacy-preserving human activity sensing: A survey"}, {"paperId": "479850149c6a3d02ace45424b7b566ce78f596d5", "title": "Backdoor Attacks Against Deep Learning-Based Massive MIMO Localization"}, {"paperId": "a135798ae5435537062674ba4af96190d216d815", "title": "TENT: Connect Language Models with IoT Sensors for Zero-Shot Activity Recognition"}, {"paperId": "5cb7516734fcb757b0bdc18908594f80b932b547", "title": "Adversarial Human Context Recognition: Evasion Attacks and Defenses"}, {"paperId": "e939719b2a66bbaddd74ed139970e5a7e0b5f3cd", "title": "AirFi: Empowering WiFi-Based Passive Human Gesture Recognition to Unseen Environment via Domain Generalization"}, {"paperId": "3aadb6c7e584e4f4a281f7d9053b8d4a369c23f8", "title": "SenseFi: A library and benchmark on deep-learning-empowered WiFi human sensing"}, {"paperId": "2a1ea90a71131275685d815daa9c5c40208f9c9f", "title": "AutoFi: Toward Automatic Wi-Fi Human Sensing via Geometric Self-Supervised Learning"}]}
