{"paperId": "b5ca4973ee75cb01c9e90758fe39ae0b090f765e", "publicationVenue": null, "title": "ZQL: A Unified Middleware Bridging Both Relational and NoSQL Databases", "abstract": "A large amount of unstructured data are being continuously generated by mobile applications, e.g., Facebook, Twitter and Foursquare, due to the popularity of smart devices, e.g., iPad, iWatch and smartphone. These data are undoubtedly of great value but need to be first well stored and then analyzed. Nevertheless, traditional relational database management system (RDBMS) is not well qualified for this job. As a result, NoSQL databases are proposed and become very popular. Judging from the present situations, RDMBSs play a better role in managing relational data, and thus application developers have to face the situation of co-existence of both RDBMS and NoSQL databases, and knowing the details of the underlying data distributions and structures of different databases. To this end, in this paper, we aim to propose a unified, transparent query engine, as a middleware, called \"ZQL\", by using MySQL and Hive as underlying two exemplary databases, however its usage goes far beyond these two databases. ZQL aims to support application development by hiding the specific details of both NoSQL databases and RDBMS. Finally, extensive experimental results show the effectiveness and functionalities of the proposed and implemented ZQL middleware.", "venue": "2016 IEEE 14th Intl Conf on Dependable, Autonomic and Secure Computing, 14th Intl Conf on Pervasive Intelligence and Computing, 2nd Intl Conf on Big Data Intelligence and Computing and Cyber Science and Technology Congress(DASC/PiCom/DataCom/CyberSciTech)", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2016-08-01", "journal": {"name": "2016 IEEE 14th Intl Conf on Dependable, Autonomic and Secure Computing, 14th Intl Conf on Pervasive Intelligence and Computing, 2nd Intl Conf on Big Data Intelligence and Computing and Cyber Science and Technology Congress(DASC/PiCom/DataCom/CyberSciTech)", "pages": "730-737"}, "authors": [{"authorId": "2145754352", "name": "Jie Xu"}, {"authorId": "2113796756", "name": "Mengji Shi"}, {"authorId": "2145764956", "name": "Chao-Yuan Chen"}, {"authorId": "2116701774", "name": "Zhen Zhang"}, {"authorId": "3036636", "name": "Jigao Fu"}, {"authorId": "144212455", "name": "C. Liu"}], "citations": [{"paperId": "5715726cdab9faf3fd96025b4af728df3b033a96", "title": "Integration Model between Heterogeneous Data Services in a Cloud"}, {"paperId": "60c1af44d8b85a063571108d021ee81ee43bdcd4", "title": "A Formal OLAP Algebra for NoSQL based Data Warehouses"}, {"paperId": "4b44743253c48b328d33479b04598e01fe9e6d03", "title": "Bringing SQL databases to key-based NoSQL databases: a canonical approach"}, {"paperId": "1a5c333296ff1555e0dafc9a576c51b4d213b6df", "title": "Abordagem para integração automática de dados estruturados e não estruturados em um contexto Big Data"}, {"paperId": "1479006efe406902aa1207b5715260020ab00210", "title": "Interactive Big Data Analytics Platform for Healthcare and Clinical Services"}, {"paperId": "df9adf8f1045d837dad13b5a99d141fbdcdab10f", "title": "Simulations of Hadoop/MapReduce-Based Platform to Support its Usability of Big Data Analytics in Healthcare"}, {"paperId": "9ae6be0e71e03d3dcf3f9b48a838953a0f824580", "title": "Smart proxy: Generic cloud middleware framework for improving database performance"}, {"paperId": "8129feaa54170fd27452bcddfde5c06a670114fc", "title": "Interoperability Between SaaS and Data Layers: Enhancing the MIDAS Middleware"}, {"paperId": "866140fc8d971dafa8a12885b6739ad61c0224a4", "title": "Using Distributed Data over HBase in Big Data Analytics Platform for Clinical Services"}, {"paperId": "4a032551dd8d7474716606136ab2574d892f2479", "title": "Ontology driven query language for NoSQL databases"}, {"paperId": "521b8c0c5945507a27e1d8a2f8f63d34c3ab935c", "title": "Mobile Cloud Platform: Architecture, Deployment and Big Data Applications"}, {"paperId": "527fe1f96f1a51d46bdb0ab9b953cd1f9e4fc37d", "title": "Transparent Interoperability Middleware between Data and Service Cloud Layers"}, {"paperId": "fd50d603d64dd0bf98a7a5e64175fb79c5491acb", "title": "A NEW APPROACH FOR MIGRATION OF A RELATIONAL DATABASE INTO COLUMN-ORIENTED NOSQL DATABASE ON HADOOP"}, {"paperId": "e5cc614e425003eeb70c9051cbd4be2f12165c24", "title": "Operational Efficiencies and Simulated Performance of Big Data Analytics Platform over Billions of Patient Records of a Hospital System"}, {"paperId": "8f0f002b97df3bfab6330a35a1eea6654369ca31", "title": "Towards a big data analytics platform with Hadoop/MapReduce framework using simulated patient data of a hospital system"}]}
