{"paperId": "b5e0193c770fc4db7ec7aef8bccce6778a6ffdde", "publicationVenue": {"id": "f2c78b1b-6bcc-4700-859b-af9401c02941", "name": "Buildings", "type": "journal", "issn": "0007-3725", "alternate_issns": ["2075-5309"], "url": "https://www.buildings.com/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217973", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217973", "https://www.mdpi.com/journal/buildings"]}, "title": "Assessment Framework for BIM-Digital Twin Readiness in the Construction Industry", "abstract": "This study introduces a pioneering structural equation modeling (SEM)-based framework to assess BIM-DT adoption readiness in sustainable construction. The research’s approach delves into the intricate correlation between key success factors (KSFs) and sustainable parameters (SPs), fostering BIM-DT deployment. This interdisciplinary perspective provides a holistic understanding of the impact of KSFs on BIM-DT adoption. The research aims to identify KSFs and parameters, prioritize their relative weights for BIM-DT implementation, analyze KSFs and SPs correlations, and offer practical insights into the findings. The results revealed the importance of sustainability considerations in BIM-DT adoption, with cost optimization and resource management playing pivotal roles. The findings also revealed that the readiness of the organization to adopt the technology, availability of technology operators, availability of standards and codes for the new technology, availability of knowledge, skills, and competencies to adopt the technology, and availability of funds and financial investment are the top-ranked KSFs contributing to the successful adoption of BIM-DT.", "venue": "Buildings", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-01-18", "journal": {"name": "Buildings"}, "authors": [{"authorId": "2238289461", "name": "Aljawharah A. Alnaser"}, {"authorId": "2280826424", "name": "Ali Hassan Ali"}, {"authorId": "101242439", "name": "Haytham H. Elmousalami"}, {"authorId": "96351502", "name": "A. Elyamany"}, {"authorId": "2126625686", "name": "Ahmed Gouda Mohamed"}], "citations": [{"paperId": "cb16582b1582128180d4342eca7071764cb5ae1e", "title": "Application of Ginni’s mean analysis for identifying the stationary driver enhancing modular construction adoption in the building industry"}]}
