{"paperId": "b5ebeccbbb614299736346c920a7032f84f198bb", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Big Data Analytics Using Cloud Computing Based Frameworks for Power Management Systems: Status, Constraints, and Future Recommendations", "abstract": "Traditional parallel computing for power management systems has prime challenges such as execution time, computational complexity, and efficiency like process time and delays in power system condition monitoring, particularly consumer power consumption, weather data, and power generation for detecting and predicting data mining in the centralized parallel processing and diagnosis. Due to these constraints, data management has become a critical research consideration and bottleneck. To cope with these constraints, cloud computing-based methodologies have been introduced for managing data efficiently in power management systems. This paper reviews the concept of cloud computing architecture that can meet the multi-level real-time requirements to improve monitoring and performance which is designed for different application scenarios for power system monitoring. Then, cloud computing solutions are discussed under the background of big data, and emerging parallel programming models such as Hadoop, Spark, and Storm are briefly described to analyze the advancement, constraints, and innovations. The key performance metrics of cloud computing applications such as core data sampling, modeling, and analyzing the competitiveness of big data was modeled by applying related hypotheses. Finally, it introduces a new design concept with cloud computing and eventually some recommendations focusing on cloud computing infrastructure, and methods for managing real-time big data in the power management system that solve the data mining challenges.", "venue": "Italian National Conference on Sensors", "year": 2023, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2023-03-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "23"}, "authors": [{"authorId": "118694689", "name": "Ahmed Al-jumaili"}, {"authorId": "1838461", "name": "R. C. Muniyandi"}, {"authorId": "144134763", "name": "M Zahid Hasan"}, {"authorId": "31939030", "name": "J. Paw"}, {"authorId": "2187179224", "name": "Mandeep Jit Singh"}], "citations": [{"paperId": "31ac8de8ae88288fbe00f5033b392d542260555a", "title": "A hybrid prediction interval model for short-term electric load forecast using Holt-Winters and Gate Recurrent Unit"}, {"paperId": "3a7c593d25f7034984afd599e439626f495c5bae", "title": "Energy efficient reliable data transmission for optimizing IoT data transmission in smart city"}, {"paperId": "ab4817108dc2c52bb562f8846b3403d85aa82289", "title": "Support vector regression-based state of charge estimation for batteries: cloud vs non-cloud"}, {"paperId": "e281017429506929a371540dabf721cf8753bf6b", "title": "Real time pedestrian and objects detection using enhanced YOLO integrated with learning complexity-aware cascades"}, {"paperId": "4ac826e577c0ae6a67338b6d81af0cd7546fecd3", "title": "Sustainable optimizing WMN performance through meta-heuristic TDMA link scheduling and routing"}, {"paperId": "33f1045edbd2bd8e09b625598862e57cb2ceeeab", "title": "Parallel power load abnormalities detection using fast density peak clustering with a hybrid canopy-K-means algorithm"}, {"paperId": "c5e6da6ea2f85e864e0c3767af38516380a9a555", "title": "Decentralized asynchronous adaptive federated learning algorithm for securely prediction of distributed power data"}, {"paperId": "ed7d20df5d1bf7feca1302a506ca93c46e3a3dbf", "title": "Sustainable electronic document security: a comprehensive framework integrating encryption, digital signature and watermarking algorithms"}, {"paperId": "572b26f42e9d9de1bc8e155142f6115214cc2d6c", "title": "Real-Time Analytics with Big Data and Streaming Computation"}, {"paperId": "4ef776bef3affc2b6e9abc3f315ca3a03079380e", "title": "Manufacturing System Design in Industry 5.0: Incorporating Sociotechnical Systems and Social Metabolism for Human-Centered, Sustainable, and Resilient Production"}, {"paperId": "f16630fd0b305964b3b865fc6ee9df25c62c37bc", "title": "Advancements in intelligent cloud computing for power optimization and battery management in hybrid renewable energy systems: A comprehensive review"}, {"paperId": "3f521ac9f60f1f1d806495413cb20693c1112a96", "title": "Unleashing the Power of Big Data: A Comprehensive Analysis and Future Directions"}, {"paperId": "8b8fe786e2079ceb747e2ce90c464453f96e6fa5", "title": "Emerging Computational Micro‐Spectrometers — From Complex System Integration to Simple In Situ Modulation"}, {"paperId": "f78337de159719b093502015a11d0c37e0721850", "title": "Prevention of VM Timing side-channel attack in a cloud environment using randomized timing approach in AES – 128"}, {"paperId": "dc27cd18d1890e38a103b4762c1b60a8e3d21ca3", "title": "A Novel Approach to Strengthening Web-Based Cloud Services: Two-Factor Access Control"}, {"paperId": "853c13834f8192e5fdc689633d5d9d84afdea3a7", "title": "Enhanced Linear Regression Models for Resource Usage Prediction in Dynamic Cloud Environments"}, {"paperId": "00b51664f42d303814ede8d178d2057462218c13", "title": "Design and Optimization of an Intelligent Monitoring System for Overhead Lines Based on Common Information Model"}, {"paperId": "1f6f0035c447a924118662160bfadf548ac8ed75", "title": "Sports Prediction Model through Cloud Computing and Big Data Based on Artificial Intelligence Method"}, {"paperId": "24c028a76bb751479de8adb2abaee543a3448040", "title": "Framework for Organization of Medical Processes in Medical Institutions Based on Big Data Technologies"}, {"paperId": "224f70e319317f53c00d177e9cc2d90714afd5de", "title": "Multi-Task Learning for Electricity Price Forecasting and Resource Management in Cloud Based Industrial IoT Systems"}]}
