{"paperId": "b5ef3822c114edb982d0d5641fe555290473e25d", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Competencies Needed for Guiding the Digital Transition of Agriculture: Are Future Advisors Well-Equipped?", "abstract": "As the penetration of digital technologies in agriculture deepens, farm advisors have to cope with new roles, which generate the need for updating already possessed and developing new competencies. Although in-service advisors can build such skills through their involvement with the practice of digital agriculture, students of agronomy (and related) departments who will undertake the role of advisors in the future are expected to develop relevant competencies during their university education. Do current curricula supply them with such competencies? In pursuing this question, in the present study, we developed a theoretical scheme involving eight sets of competencies. After constructing a scale for each set, we collected data from students enrolled in an agronomy department of a Greek university. Our findings revealed that participants’ overall competency in dealing with digital agriculture was considerably low. Among the eight sets of competencies, the highest scores were observed for empathy and future orientation, while students had low levels of technology exploitation, technology integration, and transition facilitation competencies. A regression analysis indicated that the two last sets shape students’ overall competency. These results point out the need to integrate a farmer-centered philosophy in digitalization-related higher agronomic education and consider the critical role that social science can play in equipping future advisors with competencies needed to facilitate the digital agricultural transition.", "venue": "Sustainability", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-11-10", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "52584375", "name": "C. Charatsari"}, {"authorId": "2025627", "name": "A. Michailidis"}, {"authorId": "16090849", "name": "Evagelos D. Lioutas"}, {"authorId": "2808886", "name": "T. Bournaris"}, {"authorId": "2153696", "name": "E. Loizou"}, {"authorId": "2042500193", "name": "A. Paltaki"}, {"authorId": "4032057", "name": "D. Lazaridou"}], "citations": [{"paperId": "0c6a5fddc806a81306645e4b9f76f04281fd622d", "title": "Insight into the demand for digital skills at the workplaces of agricultural engineering graduates in Vietnam"}, {"paperId": "d378725763572a1aa53eac89bea4a65813aeba81", "title": "Do Agricultural Knowledge and Innovation Systems Have the Dynamic Capabilities to Guide the Digital Transition of Short Food Supply Chains?"}]}
