{"paperId": "b6067c140109b5eadbee61e0d758d54f68253dd5", "publicationVenue": null, "title": "A Homomorphic Encryption Framework for Privacy-Preserving Spiking Neural Networks", "abstract": "Machine learning (ML) is widely used today, especially through deep neural networks (DNNs); however, increasing computational load and resource requirements have led to cloud-based solutions. To address this problem, a new generation of networks has emerged called spiking neural networks (SNNs), which mimic the behavior of the human brain to improve efficiency and reduce energy consumption. These networks often process large amounts of sensitive information, such as confidential data, and thus privacy issues arise. Homomorphic encryption (HE) offers a solution, allowing calculations to be performed on encrypted data without decrypting them. This research compares traditional DNNs and SNNs using the Brakerski/Fan-Vercauteren (BFV) encryption scheme. The LeNet-5 and AlexNet models, widely-used convolutional architectures, are used for both DNN and SNN models based on their respective architectures, and the networks are trained and compared using the FashionMNIST dataset. The results show that SNNs using HE achieve up to 40% higher accuracy than DNNs for low values of the plaintext modulus t, although their execution time is longer due to their time-coding nature with multiple time steps.", "venue": "Inf.", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-10", "journal": {"name": "Inf.", "pages": "537", "volume": "14"}, "authors": [{"authorId": "104454124", "name": "F. Nikfam"}, {"authorId": "2229801846", "name": "Raffaele Casaburi"}, {"authorId": "51486203", "name": "Alberto Marchisio"}, {"authorId": "2165803795", "name": "Maurizio Martina"}, {"authorId": "2077523138", "name": "Muhammad Shafique"}], "citations": [{"paperId": "a37c236803455afd7da3dc027e7865a0414a5697", "title": "Embodied Neuromorphic Artificial Intelligence for Robotics: Perspectives, Challenges, and Research Development Stack"}, {"paperId": "887cc6cf7f4f5ed7c15d45bba5f7d70839dada30", "title": "Federated Learning with Anomaly Detection via Gradient and Reconstruction Analysis"}]}
