{"paperId": "b611251da0c7cecf2539a24fe862b8514e674dd6", "publicationVenue": {"id": "2c1c3a62-7d6e-44b9-b225-a9ddb7ebdb8d", "name": "International Conference on Medical Imaging with Deep Learning", "type": "conference", "alternate_names": ["MIDL", "Int Conf Med Imaging Deep Learn"], "url": "https://www.midl.io/"}, "title": "Personalized Prediction of Future Lesion Activity and Treatment Effect in Multiple Sclerosis from Baseline MRI", "abstract": "Precision medicine for chronic diseases such as multiple sclerosis (MS) involves choosing a treatment which best balances efficacy and side effects/preferences for individual patients. Making this choice as early as possible is important, as delays in finding an effective therapy can lead to irreversible disability accrual. To this end, we present the first deep neural network model for individualized treatment decisions from baseline magnetic resonance imaging (MRI) (with clinical information if available) for MS patients. Our model (a) predicts future new and enlarging T2 weighted (NE-T2) lesion counts on follow-up MRI on multiple treatments and (b) estimates the conditional average treatment effect (CATE), as defined by the predicted future suppression of NE-T2 lesions, between different treatment options relative to placebo. Our model is validated on a proprietary federated dataset of 1817 multi-sequence MRIs acquired from MS patients during four multi-centre randomized clinical trials. Our framework achieves high average precision in the binarized regression of future NE-T2 lesions on five different treatments, identifies heterogeneous treatment effects, and provides a personalized treatment recommendation that accounts for treatment-associated risk (e.g. side effects, patient preference, administration difficulties).", "venue": "International Conference on Medical Imaging with Deep Learning", "year": 2022, "fieldsOfStudy": ["Engineering", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-04-01", "journal": {"name": "ArXiv", "volume": "abs/2204.01702"}, "authors": [{"authorId": "1707936879", "name": "J. Durso-Finley"}, {"authorId": "11866454", "name": "J. Falet"}, {"authorId": "2051891988", "name": "B. Nichyporuk"}, {"authorId": "145427218", "name": "D. Arnold"}, {"authorId": "1699104", "name": "T. Arbel"}], "citations": [{"paperId": "647fd403143b050a1dced8b52117c35fcea81d31", "title": "Self-pruning Graph Neural Network for Predicting Inflammatory Disease Activity in Multiple Sclerosis from Brain MR Images"}, {"paperId": "5daf2620c2244bff9b740939ba55887d11f9d7e4", "title": "Improving Image-Based Precision Medicine with Uncertainty-Aware Causal Models"}, {"paperId": "21bf2b2da255beab747d14fffc98bf4f0f10302b", "title": "Estimating individual treatment effect on disability progression in multiple sclerosis using deep learning"}, {"paperId": "400e3625ccb6d0baafc59b24863dde18d571219a", "title": "Temporally Adjustable Longitudinal Fluid-Attenuated Inversion Recovery MRI Estimation / Synthesis for Multiple Sclerosis"}]}
