{"paperId": "b61bb90c27b24122cea0a1f287d77f304af5d7a9", "publicationVenue": null, "title": "An Open Source GIS Application for Spatial Assessment of Health Care Quality Indicators", "abstract": "Prevention quality indicators (PQIs) constitute a set of measures that can be combined with hospital inpatient data to identify the quality of care for ambulatory care sensitive conditions (ACSC). Geographical information system (GIS) web mapping and applications contribute to a better representation of PQI spatial distribution. Unlike many countries in the world, in Portugal, this type of application remains underdeveloped. The main objective of this work was to facilitate the assessment of geographical patterns and trends of health data in Portugal. Therefore, two innovative open source applications were developed. Leaflet Javascript Library, PostGIS, and GeoServer were used to create a web map application prototype. Python language was used to develop the GIS application. The geospatial assessment of geographical patterns of health data in Portugal can be obtained through a GIS application and a web map application. Both tools proposed allowed for an easy and intuitive assessment of geographical patterns and time trends of PQI values in Portugal, alongside other relevant health data, i.e., the location of health care facilities, which, in turn, showed some association between the location of facilities and quality of health care. However, in the future, more research is still required to map other relevant data, for more in-depth analyses.", "venue": "ISPRS Int. J. Geo Inf.", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-04-14", "journal": {"name": "ISPRS Int. J. Geo Inf.", "pages": "264", "volume": "10"}, "authors": [{"authorId": "145919100", "name": "L. Duarte"}, {"authorId": "2550370", "name": "A. Teodoro"}, {"authorId": "144206783", "name": "M. Lobo"}, {"authorId": "145685274", "name": "J. Viana"}, {"authorId": "2100771124", "name": "V. Pinheiro"}, {"authorId": "144303562", "name": "A. Freitas"}], "citations": [{"paperId": "ac04af63725d7dbcc318852068aed82245b8f4c2", "title": "Geospatial distribution of under-five mortality in Alexandria, Egypt: a cross-sectional survey"}, {"paperId": "b894c326b417506d9c03187c28ba344acf956785", "title": "Social Vulnerability of Brazilian Metropolitan Schools and Teachers’ Absence from Work Due to Vocal and Psychological Symptoms: A Multilevel Analysis"}, {"paperId": "c67b51fb1f95371409aa6fc2e69ad2a45110b3e2", "title": "Design and Implementation of a Web-GIS for the management of road infrastructure in Zimbabwe"}, {"paperId": "5c51ea2612dcae7abfd0907c4197695a4865e6a7", "title": "Conceptual model of cartographic monitoring field geophysical surveys and proposals for its implementation"}, {"paperId": "aa2cf87d4404c1ce001c12982c7f45f67d4757a0", "title": "Posyandu Application for Monitoring Children Under-Five: A 3-Year Data Quality Map in Indonesia"}]}
