{"paperId": "b61e2d1bb31c0d1c348926bf61d7d9f7cb1ab4b4", "publicationVenue": {"id": "1cb2de36-251d-439b-b464-86bb97907c14", "name": "Social science computer review", "type": "journal", "alternate_names": ["Social Science Computer Review", "Soc sci comput rev", "Soc Sci Comput Rev"], "issn": "0894-4393", "url": "http://www.sagepub.com/journals/Journal200948/title", "alternate_urls": ["https://journals.sagepub.com/home/ssc", "http://ssc.sagepub.com/"]}, "title": "Populist Supporters on Reddit: A Comparison of Content and Behavioral Patterns Within Publics of Supporters of Donald Trump and Hillary Clinton", "abstract": "The international rise of populism has been attributed, in part, to digital media. These media allow the backers of populists to share and distribute information independent of traditional media organizations or elites and offer communication spaces in which they can support each other and strengthen communal ties irrespective of their societal standing. Can we identify these functions in distinct usage patterns of digital media by supporters of populists? This could find expression through posting content that comports with the central tenets of populist ideology, higher activity levels, use of distinct vocabularies, and heightened levels of community building. We investigate differences along these dimensions on the online forum Reddit by comparing linguistic patterns and content of comments in two subreddits focusing on a populist, Donald Trump (/r/The_Donald), and a center-left politician, Hillary Clinton (/r/hillaryclinton), during the 2016 U.S. presidential election campaign. Contributors to /r/The_Donald expressed more strongly parts of the populist ideological package, specifically anti-elitism and exclusionism, but failed to express people-centrism; used the platform more intensively; used vocabularies different than those used in other partisan publics; and engaged more strongly in community building.", "venue": "Social science computer review", "year": 2021, "fieldsOfStudy": ["Political Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-03-03", "journal": {"name": "Social Science Computer Review", "pages": "809 - 830", "volume": "40"}, "authors": [{"authorId": "3060017", "name": "Andreas Jungherr"}, {"authorId": "3003460", "name": "Oliver Posegga"}, {"authorId": "2088546758", "name": "Jisun An"}], "citations": [{"paperId": "b4864026d69b218d79b10cde2703b47320b6c879", "title": "Conservative Anger and Police Misconduct: Exploring Conservative Discussion of Police on Social Media"}, {"paperId": "fbc249aa571c1341f842283e0046bd6a276c1e04", "title": "After the epistemological turn: A framework for studying populism as a knowledge phenomenon"}, {"paperId": "ebfd623f3da8ef49bbb73b89688921145caffa0f", "title": "Cyber anti-intellectualism and information seeking about SARS-CoV-2 variants"}, {"paperId": "c2182bea3b71279c2e7ce9c1d3bcc32ce2e29e0a", "title": "Modeling Political Activism around Gun Debate via Social Media"}, {"paperId": "fa7793e9c6ef4c83460c8269632a692405d9dc19", "title": "Make Reddit Great Again: Assessing Community Effects of Moderation Interventions on r/The_Donald"}]}
