{"paperId": "b61fef0923f3d203283c6de2d4fd1c87dccfe54e", "publicationVenue": null, "title": "A Multi-Attribute Data Mining Model for Rule Extraction with Applications in the Financial Services Industry", "abstract": "Purpose. Considering customers’ differences and similarities play a crucial role in recent years. Specifically, service industries have to develop numerous strategies for various types of customers found on their action to reach performance improvement and customer loyalty. This study aims to understand the behavioral pattern of customers in the banking industry by proposing a hybrid data mining and decision-making approach resulting in rule extraction and service operation benchmarking. Design/methodology/approach. We analyze customer data to identify the best customers using a modified Recency, Frequency, and Monetary (RFM) model and K-means clustering. The number of clusters is determined with a two-step K-means quality analysis based on the Silhouette, Davies-Bouldin, and Calinski-Harabasz indices and the Evaluation based on Distance from Average Solution (EDAS). The Best-Worst Method (BWM) and the Total Area based on Orthogonal Vectors (TAOV) are used next to sort the clusters. Finally, the associative rules and the Apriori algorithm are used to derive the customers’ behavior patterns. Findings. As a result of implementing the proposed approach in the financial service industry, customers were segmented and ranked into six clusters by analyzing 20,000 records. Furthermore, frequent customer financial behavior patterns were recognized based on demographic characteristics and financial transactions of customers. Thus, customer types were classified as highly loyal, loyal, high-interacting, high-interacting, low-interacting, and missing customers. Eventually, appropriate strategies for interacting with each customer type were proposed. Originality/Value. We propose a novel hybrid multi-attribute data mining approach for rule extraction and service operations benchmarking approach by combining data mining tools with a multi-layer decision-making approach. The proposed hybrid approach has been implemented in a large-scale problem in the financial services industry.", "venue": "", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "1995092", "name": "H. A. Mahdiraji"}, {"authorId": "1681115", "name": "M. Tavana"}, {"authorId": "2139132893", "name": "Pouya Mahdiani"}, {"authorId": "2288324861", "name": "Ali Asghar"}, {"authorId": "2288441240", "name": "Abbasi Kamardi"}], "citations": []}
