{"paperId": "b64935db3f37c01f9f7d66ff86e5b4196a2ab479", "publicationVenue": null, "title": "Traffic Locality as an Opportunity in the Data Center", "abstract": "In large scale data centers, network infrastructure is becoming a major cost component; as a result, operators are trying to reduce expenses, and in particular lower the amount of hardware needed to achieve their performance goals (or to improve the performance achieved for a given amount of hardware). In this thesis, we explore the use of locality in the data center to meet these demands. In particular, we leverage locality in two different projects: (1) VNTOR, which moves network virtualization from the server to the top-of-rack (ToR) switch, thereby reducing the server hardware needed to achieve a certain performance, and (2) CRISS-CROSS, which makes the network topology reconfigurable, thereby reducing the network hardware needed to switch typical data center workloads with a given level of performance. VNTOR exploits the locality of traffic flows as well as their power-law distribution in the design of a virtual flow table, which extends the hardware flow table of off-the-shelf top-ofrack switches. VNTOR uses this virtual flow table in a hybrid data plane which merges both hardware as well software components. This way it can (1) store tens or even hundreds of thousands of flows, (2) adapt to traffic-pattern changes, typically in less than one millisecond, and (3) uses only commodity switching hardware with a minimal amount of data path memory (4) without compromising latency or throughput. CRISS-CROSS is a hierarchical, reconfigurable topology for large-scale data centers. The locality in rack-level flows allows CRISS-CROSS to adjust its topology to the current traffic patterns. We show that CRISS-CROSS preserves many of the advantages of Clos topologies: (1) it maintains their hierarchy, (2) the simple routing algorithms, (3) their regular layout of connections for simple physical deployability, and (4) the compatibility to existing management approaches. We demonstrate that for a group-based communication pattern, CRISS-CROSS improves the average flow completion time by 5.5× and the 99th percentile by 6.3×. For a purely random point-to-point traffic pattern, it improves the flow completion time by 2.2× on average and 3× at the 99th percentile.", "venue": "", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": null, "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "14760821", "name": "J. Fietz"}], "citations": []}
