{"paperId": "b6499e33c4aea45812f4ecfa5efdff123e957d65", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Identification of Ancient Chinese Medical Prescriptions and Case Data Analysis Under Artificial Intelligence GPT Algorithm: A Case Study of Song Dynasty Medical Literature", "abstract": "This work aims to use the chatGPT algorithm to analyze and summarize cases in medical literature of the Song Dynasty, understand the clinical practice experience of ancient Chinese medicine, and provide historical reference for the clinical application and research of modern Chinese medicine. Firstly, the application of Artificial Intelligence (AI) in medicine is explained through literature research. Secondly, the prescription recognition technology related to AI is introduced, and a method combining supervised learning and semi-supervised learning for prescription entity recognition is proposed. Combined with chatGPT technology, medical data mining is carried out to obtain information and knowledge of medical research in the Song Dynasty. chatGPT is applied to the identification of ancient Chinese medical prescriptions and the analysis of case data. The results show that: 1) machine classifier performs well in classifying different flavor compounds, effective and ineffective prescriptions can be distinguished, and the accuracy increases with the increase of samples; 2) data mining reveals the differences in disease stages, the primary and secondary contradictions in patients’ bodies, and the primary and secondary differences in drug use; 3) frequency statistics show that warm drugs account for 45.46%, confirming that warm drugs are the main ones for treating phlegm. Therefore, it is recommended to use chatGPT as an auxiliary tool in medical-related analysis and combine it with professional medical knowledge and clinical practice for comprehensive judgment and decision-making. Ancient medical prescriptions can be better identified, and case data can be analyzed by combining chatGPT technology in AI. It can well support ancient medicine study and lay a solid foundation for developing modern medical information data warehouse.", "venue": "IEEE Access", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "131453-131464", "volume": "11"}, "authors": [{"authorId": "2265952763", "name": "Mengfei Li"}, {"authorId": "2265794390", "name": "Xiaohuan Zheng"}], "citations": [{"paperId": "7306e97d2fb5977572f47a90866323239ab1ccdc", "title": "Large Language Models in Biomedical and Health Informatics: A Bibliometric Review"}, {"paperId": "e89ccb98415901916c00f9ba744b79362bb20cf7", "title": "Revolutionizing ocular cancer management: a narrative review on exploring the potential role of ChatGPT"}]}
