{"paperId": "b64c199e9426ddd59cc979b33f7d479c47fb3aa5", "publicationVenue": {"id": "1cd505d9-195d-4f99-b91c-169e872644d4", "name": "Energies", "type": "journal", "issn": "1996-1073", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-155563", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-155563", "https://www.mdpi.com/journal/energies", "http://www.mdpi.com/journal/energies"]}, "title": "A Never-Ending Learning Method for Fault Diagnostics in Energy Systems Operating in Evolving Environments", "abstract": "Condition monitoring (CM) in the energy industry is limited by the lack of pre-classified data about the normal and/or abnormal plant states and the continuous evolution of its operational conditions. The objective is to develop a CM model able to: (1) Detect abnormal conditions and classify the type of anomaly; (2) recognize novel plant behaviors; (3) select representative examples of the novel classes for labeling by an expert; (4) automatically update the CM model. A CM model based on the never-ending learning paradigm is developed. It develops a dictionary containing labeled prototypical subsequences of signal values representing normal conditions and anomalies, which is continuously updated by using a dendrogram to identify groups of similar subsequences of novel classes and to select those subsequences to be labelled by an expert. A 1-nearest neighbor classifier is trained to online detect abnormal conditions and classify their types. The proposed CM model is applied to a synthetic case study and a real case study concerning the monitoring of the tank pressure of an aero derivative gas turbine lube oil system. The CM model provides satisfactory performances in terms of classification accuracy, while remarkably reducing the expert efforts for data labeling and model (periodic) updating.", "venue": "Energies", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2019-12-16", "journal": {"name": "Energies"}, "authors": [{"authorId": "1572109073", "name": "Maria Rosaria Termite"}, {"authorId": "12385923", "name": "P. Baraldi"}, {"authorId": "1400916654", "name": "S. Al-Dahidi"}, {"authorId": "38151370", "name": "L. Bellani"}, {"authorId": "2250069", "name": "M. Compare"}, {"authorId": "144027144", "name": "E. Zio"}], "citations": [{"paperId": "c0e2a9c21055dd30e9aa62588838037a4eec9b76", "title": "Incrementally Contrastive Learning of Homologous and Interclass Features for the Fault Diagnosis of Rolling Element Bearings"}, {"paperId": "aaac493e9c1c40fa0f7d4195ca37180b1a04bc0d", "title": "Chinese Brand Identity Management Based on Never-Ending Learning and Knowledge Graphs"}, {"paperId": "75f665e26134958abbf654b0eeab6fcd259cd5ae", "title": "Quantification of the value of condition monitoring system with time-varying monitoring performance in the context of risk-based inspection"}, {"paperId": "3c3c68130506c36e87352ccae5ee43fb22a5e017", "title": "A framework for predicting the remaining useful life of machinery working under time-varying operational conditions"}, {"paperId": "c1bf14d91662c811f9148d162c6e8bb24e49e47c", "title": "Gas path component fault diagnosis of an industrial gas turbine under different load condition using online sequential extreme learning machine"}, {"paperId": "68e963aeca4f8b7a3540620e682f17ce73693e57", "title": "Prognostics and health management: A review from the perspectives of design, development and decision"}, {"paperId": "6bf48c932a81dfbfac53509eb73c0b11b99c5fda", "title": "Metamodeling and On-Line Clustering for Loss-of-Flow Accident Precursors Identification in a Superconducting Magnet Cryogenic Cooling Circuit"}, {"paperId": "6fd251c16b7b0502fb2a32db31519f8c22c40827", "title": "Incremental Novelty Identification From Initially One-Class Learning to Unknown Abnormality Classification"}, {"paperId": "60c0dc0d0ff97df810455d0a2f3f42895f064b73", "title": "Wind Turbine Failure Prediction Model using SCADA-based Condition Monitoring System"}, {"paperId": "703774e8989a74d3da2d8b2c370fdea3bd36a49f", "title": "Addendum: Termite, M.R. et al. A Never-Ending Learning Method for Fault Diagnostics in Energy Systems Operating in Evolving Environments. Energies 2019, 12, 4802"}, {"paperId": "0764d208ae5e362abd2e8b4be408be34c19fcb55", "title": "A Coevolutionary Optimization Approach with Deep Sparse Autoencoder for the Extraction of Equipment Degradation Indicators"}]}
