{"paperId": "b6508d76a7d7584d1920775ffceaf8e93ada1b53", "publicationVenue": {"id": "a812fb6c-86bf-469b-83ab-2225a7383534", "name": "Meditari Accountancy Research", "type": "journal", "alternate_names": ["Meditari : Research Journal of the School of Accounting Sciences", "Meditari Account Res", "Meditari  Res J Sch Account Sci"], "issn": "1022-2529", "alternate_issns": ["2049-372X"], "url": "https://www.emerald.com/insight/publication/issn/1022-2529", "alternate_urls": ["https://www.emeraldinsight.com/journal/medar"]}, "title": "Museums creating value and developing intellectual capital by technology", "abstract": "\nPurposes\nThe aim of this study is to provide a conceptual framework to explain how museums sustain intellectual capital and promote value co-creation moving from designing virtual environments to introducing and managing Big Data.\n\n\nDesign/methodology/approach\nThis study is based on archival and qualitative data considering the literature related to the introduction of virtual environments and Big Data within museums.\n\n\nFindings\nMuseums contribute to sustaining intellectual capital and in promoting value co-creation developing a Big Data-driven strategy and innovation.\n\n\nPractical implications\nBy introducing and managing Big Data, museums contribute to creating a community by improving knowledge within cultural ecosystems while strengthening the users as active participants and the museum’s professionals as user-centred mediators.\n\n\nOriginality/value\nAs audience-driven and knowledge-oriented organisations moving from designing virtual environments to following a Big data-driven strategy, museums should select organisational and strategic choices for driving change.\n", "venue": "Meditari Accountancy Research", "year": 2018, "fieldsOfStudy": ["Business"], "publicationTypes": null, "publicationDate": "2018-07-30", "journal": {"name": "Meditari Accountancy Research"}, "authors": [{"authorId": "3402082", "name": "Mauro Romanelli"}], "citations": [{"paperId": "7581fc7ca079495581f0a66d241a1c76a7f2c027", "title": "Transforming museums with technology and digital innovations: a scoping review of research literature"}, {"paperId": "8f886019ba132196836fde0e562bd1f3e33370c6", "title": "New challenges for public value and accountability in the age of big data: a bibliometric analysis"}, {"paperId": "41284e3a7f405fd87ecd465a77b4cd4dff90d399", "title": "City museums in the age of datafication: could museums be meaningful sites of data practice in smart cities?"}, {"paperId": "6e68112299527d577e73f4fd6df924ffbe38eda0", "title": "A measurement framework for assessing the digital transformation of cultural institutions: the Italian case"}, {"paperId": "af2556d76bbdbdf3c4545238ad6be33e7abac432", "title": "Enhancing museums' attractiveness through digitization: An investigation of Italian medium and large‐sized museums and cultural institutions"}, {"paperId": "504a578a5f186fa9808e6ca46ec265ba934c494c", "title": "Assessment of the history and trends of “The Journal of Intellectual Capital”: a bibliometrics, altmetrics and text mining analysis"}, {"paperId": "4069746e19c8c08df61549c359894cbb60b77ac1", "title": "Digitalization in the cultural industry: evidence from Italian museums"}, {"paperId": "0e90b0beb70b6b350fb96e6233a3b3907103f24f", "title": "Using big data for co-innovation processes: Mapping the field of data-driven innovation, proposing theoretical developments and providing a research agenda"}, {"paperId": "6e6fac594af82932f25b27652cdbfe8e3a28613a", "title": "Value that matters: intellectual capital and big data to assess performance in healthcare. An empirical analysis on the European context"}, {"paperId": "eb4faac516819d317f71eee286538435e2a3f1f4", "title": "The big data-business strategy interconnection: a grand challenge for knowledge management. A review and future perspectives"}, {"paperId": "3b727f876e575ca1872ab76ab9cb3ec2ed57a954", "title": "Tourism demonstration system for large-scale museums based on 3D virtual simulation technology"}, {"paperId": "151f408e134b9245dc8b42423280b3372f4c7a59", "title": "Virtual Environments and Augmented Reality Applied to Heritage Education. An Evaluative Study"}, {"paperId": "ba83c17db6652537236e9c832946a62059e91836", "title": "Guest editorial"}, {"paperId": "650db4ee90d5fb731808ace621e8f0141cb52d19", "title": "Use of Technological Applications in Art Museums. The Case of Greece"}, {"paperId": "c2be9c938897e01949f6166992cd16d4fc2b364c", "title": "Big Data for Decision Making: Are Museums Ready?"}]}
