{"paperId": "b673a9e909cbbc42a6a917b9c615cf512750f621", "publicationVenue": {"id": "75d7a8c1-d871-42db-a8e4-7cf5146fdb62", "name": "Social Science Research Network", "type": "journal", "alternate_names": ["SSRN, Social Science Research Network (SSRN) home page", "SSRN Electronic Journal", "Soc Sci Res Netw", "SSRN", "SSRN Home Page", "SSRN Electron J", "Social Science Electronic Publishing presents Social Science Research Network"], "issn": "1556-5068", "url": "http://www.ssrn.com/", "alternate_urls": ["www.ssrn.com/", "https://fatcat.wiki/container/tol7woxlqjeg5bmzadeg6qrg3e", "https://www.wikidata.org/wiki/Q53949192", "www.ssrn.com/en", "http://www.ssrn.com/en/", "http://umlib.nl/ssrn", "umlib.nl/ssrn"]}, "title": "Deep Neural Newsvendor", "abstract": "We consider a data-driven newsvendor problem, where one has access to past demand data and the associated feature information. We solve the problem by estimating the target quantile function using a deep neural network (DNN). The remarkable representational power of DNN allows our framework to incorporate or approximate various extant data-driven models. We provide theoretical guarantees in terms of excess risk bounds for the DNN solution characterized by the network structure and sample size in a non-asymptotic manner, which justify the applicability of DNNs in the relevant contexts. Specifically, the convergence rate of the excess risk bound with respect to the sample size increases in the smoothness of the target quantile function but decreases in the dimension of feature variables. This rate can be further accelerated when the target function possesses a composite structure. Compared to other typical models, the nonparametric DNN method can effectively avoid or significantly reduce the model misspecification error. In particular, our theoretical framework can be extended to accommodate the data-dependent scenarios, where the data-generating process is time-dependent but not necessarily identical over time. Finally, we apply the DNN method to a real-world dataset obtained from a food supermarket. Our numerical experiments demonstrate that (1) the DNN method consistently outperforms other alternatives across a wide range of cost parameters, and (2) it also exhibits good performance when the sample size is either very large or relatively limited.", "venue": "Social Science Research Network", "year": 2023, "fieldsOfStudy": ["Mathematics"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-25", "journal": {"name": "SSRN Electronic Journal"}, "authors": [{"authorId": "2146364412", "name": "Jinhui Han"}, {"authorId": "50625628", "name": "Minghui Hu"}, {"authorId": "2052467888", "name": "Guohao Shen"}], "citations": []}
