{"paperId": "b67649ee173e95bfd1e8ee0d6b4b512d369bc72f", "publicationVenue": {"id": "cbc4d7be-e64a-4b62-960b-3eaab7e77d51", "name": "IEEE VLSI Test Symposium", "type": "conference", "alternate_names": ["IEEE VLSI Test Symp", "VTS", "VLSI Test Symp", "VLSI Test Symposium"], "url": "http://www.tttc-vts.org/"}, "title": "Special Session: Does Approximation Make Testing Harder (or Easier)?", "abstract": "Many important application domains, including machine learning, feature intrinsically noise tolerant algorithms. These algorithms process massive, yet noisy and redundant data, by probabilistic and often iterative techniques. As a result, there is a range of valid outputs rather than a single golden value. While this may translate into relaxed constraints for testing and verification of approximate systems, distinguishing actual design bugs from what is being approximated also becomes harder. In this paper, using representative case studies, we pose several challenges for the test and verification community as approximate computing becomes more prevalent as a design of choice in order to achieve performance gains, power or energy savings, improved reliability or reduced software and/or hardware complexity.", "venue": "IEEE VLSI Test Symposium", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-04-23", "journal": {"name": "2019 IEEE 37th VLSI Test Symposium (VTS)", "pages": "1-9"}, "authors": [{"authorId": "2265880159", "name": "R. Iris Bahar"}, {"authorId": "1695310", "name": "Ulya R. Karpuzcu"}, {"authorId": "1704478", "name": "Sasa Misailovic"}], "citations": [{"paperId": "7d6687ae9c106e12d8f89db2610c0a27936004ac", "title": "Special Session: How much quality is enough quality? A case for acceptability in approximate designs"}, {"paperId": "7552a08af45dc9429a7a9d0b75daba1ff21c1112", "title": "Testing Self-Adaptive Software With Probabilistic Guarantees on Performance Metrics: Extended and Comparative Results"}]}
