{"paperId": "b68cdc20d5bb067cb225108cf6a737ef99582dc6", "publicationVenue": null, "title": "Peri-Urban Organic Agriculture and Short Food Supply Chains as Drivers for Strengthening City/Region Food Systems—Two Case Studies in Andalucía, Spain", "abstract": "Discussions on food security in the Global North have raised questions about the capacity of peri-urban organic agriculture to provide sufficient healthy food for the urban market. Dealing with food security requires more attention to how to protect peri-urban organic farming systems from urban pressures while strengthening the sustainability of local food systems. Given that short food supply chains (SFSCs) have been proven to be effective at reconnecting people with food production, this study focuses on identifying the barriers that hinder their development and the opportunities derived from the comparative advantage provided by their urban proximity. This study is based on documentary and empirical research addressing food supply chain characteristics in the organic sector. This study is focused on Mediterranean peri-urban agriculture, where, historically, there have been close relationships between the city and the countryside. These relationships are based on the fact that many cities are traditionally located next to areas of high agricultural activity, where a wide variety of vegetables is produced almost continuously due to the relatively mild winter climate. This study deals with two medium-sized metropolitan areas in Andalucia in the south of the Iberian Peninsula—the coastal city of Malaga, which is of a tourist-residential nature, and the inland urban agglomeration of Granada. Our research shows, when compared with other studies, that the local organic food sector seems to have great potential to find innovative solutions based on a collective approach, local embeddedness, and collective knowledge and by prioritizing horizontal and sustainable processes at the local/regional scale.", "venue": "", "year": 2020, "fieldsOfStudy": ["Geography"], "publicationTypes": null, "publicationDate": "2020-06-01", "journal": {"name": "Land", "pages": "177", "volume": "9"}, "authors": [{"authorId": "2058325685", "name": "Carolina Yacamán Ochoa"}, {"authorId": "143956847", "name": "A. Ruiz"}, {"authorId": "2094155282", "name": "Rafael Mata Olmo"}, {"authorId": "1592166814", "name": "Á. Figueroa"}, {"authorId": "2110401350", "name": "Adolfo José Torres Rodríguez"}], "citations": [{"paperId": "f9f8a07b2b952230539139c794e360bb14b87c99", "title": "Assessing the Downstream and Upstream Preferences of Stakeholders for Sustainability Attributes in the Tomato Value Chain"}, {"paperId": "a760b10cf1c9176a993a4f1e8280393044b3ae81", "title": "Participative assessment of agroecological short food supply chains and proposals for improvement: a case study of Andalusia (Spain)"}, {"paperId": "72603b0f9f1a305dd1c6aa6eea368ed75f26ac7b", "title": "An insight into market and non-market alternative food networks in Czechia during Covid-19 and beyond"}, {"paperId": "310fb287c3c651152e2fe2b3222b9158b97e35b4", "title": "The ecosystem of vertical farms: A conceptual framework"}, {"paperId": "5fc040f6ea566968d97b47d44d61d3f678ba0ba5", "title": "Farmland expansion and intensification do not foster local food self-sufficiency. Insights from the Mediterranean area."}, {"paperId": "7a1d09190b8fcfb0e9cbf382826138434640522e", "title": "Business strategy pathways for short food supply chains: Sharing value between consumers and producers"}, {"paperId": "f8c28a9c0706f3c0c8ed3d6a0daa8e3e97628657", "title": "Enabling Conditions for Local Food Systems to Emerge in Predominately Rural Regions of Portugal—A Food Access Approach"}, {"paperId": "7a56cf65c6870d1b2d14e1681987f18e30c83a35", "title": "Mountain Food Products: A Cluster Analysis Based on Young Consumers’ Perceptions"}, {"paperId": "d049a5418850d27ddb47417c5e77fcea477e83c0", "title": "Short Food Supply Chains in Europe: Scientific Research Directions"}, {"paperId": "2d006b72d83453fc5cd6f1a4d6d6b101b4fd29d8", "title": "Issues and Challenges in Short Food Supply Chains: A Systematic Literature Review"}, {"paperId": "5bcfd55c9e5f054622dd85bf96b778fce46cd36a", "title": "INOVAÇÃO SOCIAL E AGRICULTURA: UMA ANÁLISE SOB A PERSPECTIVA DO DESENVOLVIMENTO LOCAL"}, {"paperId": "1eae78872e03a93127696699662833bd342daec6", "title": "Back to Nature With Fenceless Farms—Technology Opportunities to Reconnect People and Food"}, {"paperId": "d5e9dff934e59f6e70e1ec737d3427fd0d24654f", "title": "Do small food businesses enable small farms to connect to regional food systems? Evidence from 9 European regions"}, {"paperId": "72c90f9680d3f489efeb3bd3262539ccf11f429a", "title": "Green Infrastructure Planning in Metropolitan Regions to Improve the Connectivity of Agricultural Landscapes and Food Security"}]}
