{"paperId": "b6ba37cdf07eebde4aae7b520944b19c3f3d3ad4", "publicationVenue": {"id": "b147e0ad-dec8-401c-87b9-3ff4c341adf3", "name": "Software Language Engineering", "type": "conference", "alternate_names": ["SLE", "Softw Lang Eng"]}, "title": "There is more than one way to zen your Python", "abstract": "The popularity of Python can be at least partially attributed to the concept of pythonicity, loosely defined as a combination of good practices accepted within the community. Despite the popularity of both Python itself and the pythonicity of code written in it, this concept has not been studied that well, and the first attempts to define it formally are rather recent. In this paper, we take the next steps in exploring this topic by conducting an independent literature review in order to create a catalogue of pythonic idioms, reproduce the results of a recent paper on the usage of pythonic idioms, perform an external direct replication of it by reusing the same open source toolset and dataset, and extend the body of knowledge by also analysing how the use of pythonic idioms evolve over time in open source codebases.", "venue": "Software Language Engineering", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Review"], "publicationDate": "2021-10-17", "journal": {"name": "Proceedings of the 14th ACM SIGPLAN International Conference on Software Language Engineering"}, "authors": [{"authorId": "8940543", "name": "A. Farooq"}, {"authorId": "145543743", "name": "V. Zaytsev"}], "citations": [{"paperId": "9c388a6f3499975edc4dd8938c02a5b4a65a1bf4", "title": "Deriving modernity signatures of codebases with static analysis"}, {"paperId": "bac6fb0a0d6575f93395104b43d83f2e8bd1d9c1", "title": "RIdiom: Automatically Refactoring Non-Idiomatic Python Code with Pythonic Idioms"}, {"paperId": "35afb57a646592c3a471a4f010d00e1b13dd3c43", "title": "From Copilot to Pilot: Towards AI Supported Software Development"}, {"paperId": "a43fbf0ebc729dc43323c7c075f5dc460be950cc", "title": "Faster or Slower? Performance Mystery of Python Idioms Unveiled with Empirical Evidence"}, {"paperId": "bc2b3c0260abb8ef70be40e1af30ba5a4993d6be", "title": "Visualizing Contributor Code Competency for PyPI Libraries: Preliminary Results"}, {"paperId": "251972d6b9107283ce43beb3f3695ee7e905076b", "title": "Deriving Modernity Signatures for PHP Systems with Static Analysis"}, {"paperId": "cbc08096d1f8a3c6041c14b83d118499b2b768e5", "title": "Making Python code idiomatic by automatic refactoring non-idiomatic Python code with pythonic idioms"}, {"paperId": "09f8cda26cd5a5b6e616699dbe7194fb8c2c1e82", "title": "Does Coding in Pythonic Zen Peak Performance? Preliminary Experiments of Nine Pythonic Idioms at Scale"}]}
