{"paperId": "b6be3efdd82838e93cda957f8788e47240b17db9", "publicationVenue": {"id": "0319ff63-41c7-49ec-805f-5fcdd0dc34de", "name": "Vestnik of Saint Petersburg University Medicine", "alternate_names": ["Vestnik St Bg Univ Med"], "issn": "1818-2909", "url": "http://vestnik.spbu.ru/s11.html"}, "title": "Prediction of the fact and degree of coronary artery disease using the processing of clinical and instrumental data by artificial intelligence", "abstract": "Aim of the study was to analyze the possibility of using neural network analysis to predict the severity of coronary bed lesion. The study was also designated to determine the performance and accuracy of the trained neural network model receiving input as the structured data and EGG images with the parameters and leads positioning differ from the training sample, and also to compare the efficiency of detecting transient myocardial ischemia with traditional diagnostic methods, such as 24-hour Holter monitoring, treadmill test. Neural network analysis of the available clinical, laboratory and instrumentation data allow to configure the network parameters for further prediction of coronary artery disease. The results obtained in the form of an AUC score allow to consider this method to be effective in the coronary artery disease diagnosis using recorded ECG tape with parameters and lead positioning differ from initial training sample. The efficiency of transient myocardial ischemia detection on the training sample of the trained neural network is higher in comparison with traditional diagnostic methods, such as 24-hour Holter monitoring, treadmill test.", "venue": "Vestnik of Saint Petersburg University Medicine", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": {"name": "Vestnik of Saint Petersburg University. Medicine"}, "authors": [{"authorId": "2146160659", "name": "T. Abdualimov"}, {"authorId": "13195643", "name": "A. Obrezan"}], "citations": [{"paperId": "e985b8dd4e736f2adf22d10aec9d94094e23ed17", "title": "Determination of Coronary Artery Disease Risk Level of Individuals by Fuzzy Expert System Approach"}]}
