{"paperId": "b6c92fc88094dbf909bfd46309b16e1d7f04c1c7", "publicationVenue": {"id": "e2742a49-1b55-4a31-b319-7455fa5e12d4", "name": "IEEE Transactions on Services Computing", "type": "journal", "alternate_names": ["IEEE Trans Serv Comput"], "issn": "1939-1374", "url": "http://www.computer.org/tsc", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=4629386"]}, "title": "START: Straggler Prediction and Mitigation for Cloud Computing Environments Using Encoder LSTM Networks", "abstract": "Modern large-scale computing systems distribute jobs into multiple smaller tasks which execute in parallel to accelerate job completion rates and reduce energy consumption. However, a common performance problem in such systems is dealing with straggler tasks that are slow running instances that increase the overall response time. Such tasks can significantly impact the system’s Quality of Service (QoS) and the Service Level Agreements (SLA). To combat this issue, there is a need for automatic straggler detection and mitigation mechanisms that execute jobs without violating the SLA. Prior work typically builds reactive models that focus first on detection and then mitigation of straggler tasks, which leads to delays. Other works use prediction based proactive mechanisms, but ignore heterogeneous host or volatile task characteristics. In this paper, we propose a Straggler Prediction and Mitigation Technique (START) that is able to predict which tasks might be stragglers and dynamically adapt scheduling to achieve lower response times. Our technique analyzes all tasks and hosts based on compute and network resource consumption using an Encoder Long-Short-Term-Memory (LSTM) network. The output of this network is then used to predict and mitigate expected straggler tasks. This reduces the SLA violation rate and execution time without compromising QoS. Specifically, we use the CloudSim toolkit to simulate START in a cloud environment and compare it with state-of-the-art techniques (IGRU-SD, SGC, Dolly, GRASS, NearestFit and Wrangler) in terms of QoS parameters such as energy consumption, execution time, resource contention, CPU utilization and SLA violation rate. Experiments show that START reduces execution time, resource contention, energy and SLA violations by 13%, 11%, 16% and 19%, respectively, compared to the state-of-the-art approaches.", "venue": "IEEE Transactions on Services Computing", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-11-19", "journal": {"name": "IEEE Transactions on Services Computing", "pages": "615-627", "volume": "16"}, "authors": [{"authorId": "145780334", "name": "Shreshth Tuli"}, {"authorId": "31043248", "name": "S. S. Gill"}, {"authorId": "3052818", "name": "Peter Garraghan"}, {"authorId": "1709598", "name": "R. Buyya"}, {"authorId": "144805467", "name": "G. Casale"}, {"authorId": "144626042", "name": "N. Jennings"}], "citations": [{"paperId": "199c8a838d7c926c663bbc628e4d7bb2dfafd3bf", "title": "ARIMA-Based and Multiapplication Workload Prediction With Wavelet Decomposition and Savitzky–Golay Filter in Clouds"}, {"paperId": "4f531f0805843ca87700dfe97faca7f9412d8d8e", "title": "Distributed Learning based on 1-Bit Gradient Coding in the Presence of Stragglers"}, {"paperId": "d4cb71b4ba2469a8f6e601b7afd2da49083213fc", "title": "Survey on the scheme evaluation, opportunities and challenges of software defined-information centric network"}, {"paperId": "365ebb76ae1278c52bb2118545e09d3679bdf1d0", "title": "Machine Learning Based Resource Utilization Prediction in the Computing Continuum"}, {"paperId": "8cc39b989ccd4711df25b25563cd7c6443c808a7", "title": "Multi-swarm Genetic Gray Wolf Optimizer with Embedded Autoencoders for High-dimensional Expensive Problems"}, {"paperId": "64bc1ba6460af0ee34a4c76eaadfe6fdac5b087a", "title": "A novel prediction approach based on three-way decision for cloud datacenters"}, {"paperId": "ac2c688844cd3aadaaa603f4b795592764f8f69a", "title": "Performance Analysis of Machine Learning Centered Workload Prediction Models for Cloud"}, {"paperId": "b4b8286b866a17464a4133c5aa49a3737bdfa2ae", "title": "AI-based Fog and Edge Computing: A Systematic Review, Taxonomy and Future Directions"}, {"paperId": "bac79e1374a5fef6fcccf1ea48fbac64a0600b8e", "title": "AI Augmented Edge and Fog Computing: Trends and Challenges"}, {"paperId": "e02ff58265bd297d679011d7acfb7f282988c6aa", "title": "A classification framework for straggler mitigation and management in a heterogeneous Hadoop cluster: A state-of-art survey"}, {"paperId": "139700d30575f11bc4fae336b43b7b16962da506", "title": "MCDS: AI Augmented Workflow Scheduling in Mobile Edge Cloud Computing Systems"}, {"paperId": "0b262a0b4952ebc490a743db36a78355ed94a427", "title": "Internet of Things"}, {"paperId": "358e483e7f3be652793e420da09370d9146b0f92", "title": "Artiﬁcial Intelligence (AI) Augmented Edge and Fog Computing: Trends and Challenges"}]}
