{"paperId": "b6cdbc446ef31852e3f3400fbd6358da209c3721", "publicationVenue": null, "title": "HyperProv: Decentralized Resilient Data Provenance at the Edge with Blockchains", "abstract": "Data provenance and lineage are critical for ensuring integrity and reproducibility of information in research and application. This is particularly challenging for distributed scenarios, where data may be originating from decentralized sources without any central control by a single trusted entity. We present HyperProv, a general framework for data provenance based on the permissioned blockchain Hyperledger Fabric (HLF), and to the best of our knowledge, the first system that is ported to ARM based devices such as Raspberry Pi (RPi). HyperProv tracks the metadata, operation history and data lineage through a set of built-in queries using smart contracts, enabling lightweight retrieval of provenance data. HyperProv provides convenient integration through a NodeJS client library, and also includes off-chain storage through the SSH file system. We evaluate HyperProv's performance, throughput, resource consumption, and energy efficiency on x86-64 machines, as well as on RPi devices for IoT use cases at the edge.", "venue": "Middleware Demos/Posters", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2019-10-13", "journal": {"name": "Proceedings of the 20th International Middleware Conference Demos and Posters"}, "authors": [{"authorId": "1389566900", "name": "Petter Tunstad"}, {"authorId": "2480837", "name": "Amin M. Khan"}, {"authorId": "2347584", "name": "P. Ha"}], "citations": [{"paperId": "3bc17c444fbb952689e23bd12aafcb995cb1f367", "title": "Smart contracts in energy systems: A systematic review of fundamental approaches and implementations"}, {"paperId": "a16c8badd438043c1b85899b7c9511653a6b59e0", "title": "Renewable and Sustainable Energy Reviews"}, {"paperId": "c1f28a3a5cf27b64a654a58f3d15673ba153c373", "title": "M ỘT HƯỚ NG TI Ế P C ẬN TÍNH RIÊNG TƯ TRONG NHÀ THÔNG MINH S Ử D Ụ NG CÔNG NGH Ệ BLOCKCHAIN HYPERLEDGER FABRIC AN APPROACH TO PRIVACY IN SMART HOME USING HYPERLEDGER FABRIC BLOCKCHAIN TECHNOLOGY"}, {"paperId": "ca011ea9f2fe7f9f5b109596750c848cc37c545a", "title": "HyperProv"}]}
