{"paperId": "b6d96b88e92299ecb0045556e57831695a1b94f8", "publicationVenue": {"id": "fcbcaf18-8ab1-43e1-a973-604bbc7e344e", "name": "Proceedings of the VLDB Endowment", "type": "journal", "alternate_names": ["Proceedings of The Vldb Endowment", "Proc VLDB Endow", "Proc Vldb Endow"], "issn": "2150-8097", "url": "http://dl.acm.org/toc.cfm?id=J1174", "alternate_urls": ["http://portal.acm.org/toc.cfm?CFID=21632689&CFTOKEN=99329904&WantType=Affiliated%20Organizations&coll=ACM&dl=ACM&id=J1174&idx=J1174&part=affil&title=VLDB%20Endowment&type=periodical"]}, "title": "BASE: Bridging the Gap between Cost and Latency for Query Optimization", "abstract": "\n Some recent works have shown the advantages of reinforcement learning (RL) based learned query optimizers. These works often use the cost (i.e., the estimation of cost model) or the latency (i.e., execution time) as guidance signals for training their learned models. However, cost-based learning underperforms in latency and latency-based learning is time-intensive. In order to bypass such a dilemma, researchers attempt to transfer a learned value network from the cost domain to the latency domain. We recognize critical insights in cost/latency-based training, prompting us to transfer the reward function rather than the value network. Based on this idea, we propose a two-stage RL-based framework,\n BASE\n , to bridge the gap between cost and latency. After learning a policy based on cost signals in its first stage,\n BASE\n formulates transferring the reward function as a variant of inverse reinforcement learning. Intuitively,\n BASE\n learns to calibrate the reward function and updates the policy regarding the calibrated one in a mutually-improved manner. Extensive experiments exhibit the superiority of\n BASE\n on two benchmark datasets: Our optimizer outperforms traditional DBMS, using 30% less training time than SOTA methods. Meanwhile, our approach can enhance the efficiency of other learning-based optimizers.\n", "venue": "Proceedings of the VLDB Endowment", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-04-01", "journal": {"name": "Proc. VLDB Endow.", "pages": "1958-1966", "volume": "16"}, "authors": [{"authorId": "2118184098", "name": "Xu Chen"}, {"authorId": "2118452539", "name": "Zhen Wang"}, {"authorId": "1399920801", "name": "Shuncheng Liu"}, {"authorId": "2110479359", "name": "Yaliang Li"}, {"authorId": "1764347", "name": "Kai Zeng"}, {"authorId": "1696332", "name": "Bolin Ding"}, {"authorId": "1709595", "name": "Jingren Zhou"}, {"authorId": "2179615840", "name": "Han Su"}, {"authorId": "144297772", "name": "Kai Zheng"}], "citations": [{"paperId": "6b75ea3ff7cafabbeae3dab4366998808f678379", "title": "Efficient Cardinality and Cost Estimation with Bidirectional Compressor-based Ensemble Learning"}, {"paperId": "a397840de4303ca3346466632466892a6a69829a", "title": "PilotScope: Steering Databases with Machine Learning Drivers"}]}
