{"paperId": "b6e348285cf1670d326323fa1de870ec64271eed", "publicationVenue": {"id": "9f814bbe-0b77-43ab-b0b8-61ba1b86ca52", "name": "Journal of Biomolecular Structure and Dynamics", "type": "journal", "alternate_names": ["J Biomol Struct Dyn", "Journal of Biomolecular Structure & Dynamics", "J Biomol Struct  Dyn"], "issn": "0739-1102", "url": "http://www.adeninepress.com/jbsd/", "alternate_urls": ["http://www.jbsdonline.com/", "https://www.tandfonline.com/toc/tbsd20/current", "http://www.tandfonline.com/loi/tbsd20"]}, "title": "Intelligent deep learning-based disease monitoring system in 5G network using multi-disease big data.", "abstract": "Recently, real-world disease monitoring techniques designed based on wearable medical equipment efficiently minimize the mortality rate. Initially, the data are manually collected from the patients to predict five diseases using 5 G frameworks. Then, the collected data are pre-processed to obtain high-quality data using the techniques like contrast enhancement, median filtering, fill empty space, remove repeated value and stemming. The pre-processed data are taken for extracting the features using a One-Dimensional Convolutional Neural Network (1D-CNN) to obtain the deep features. The parameters like hidden neuron count and epoch are tuned by the proposed Modified Predator Presence Probability-based Squirrel Search-Glowworm Swarm Optimization (MPPP-SSGSO) algorithm to enhance the variance. Then, the extracted features acquired using the 1D-CNN are given to the ensemble boosting-based models for predicting the score, which is combined by comprising approaches like Adaptive Boosting (AdaBoost), eXtreme Gradient Boosting (XGBoost) and Category Boosting (CatBoost). Further, the predicted scores obtained from such models are concatenated and passed to the Ensemble Boosting Scores-based Fuzzy Classifier (EBS-FC) for classifying the five different diseases. Here, the membership function of the fuzzy is optimized by the same developed MPPP-SSGSO algorithm for enhancing accuracy. Experiments are conducted, and validation is performed, which showcased that the recommended framework achieved a better outcome rate than the conventional techniques. Finally, the suggested strategy outperforms the current state-of-the-art methods with an accuracy rate of 91.34%.Communicated by Ramaswamy H. Sarma.", "venue": "Journal of Biomolecular Structure and Dynamics", "year": 2024, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-02-09", "journal": {"name": "Journal of biomolecular structure & dynamics", "pages": "\n          1-26\n        "}, "authors": [{"authorId": "2283751591", "name": "Anupam Das"}], "citations": []}
