{"paperId": "b70183094e91b0e5f05a2d974c5681df2bdca5f0", "publicationVenue": null, "title": "Interpretable Mining of Influential Patterns from Sparse Web", "abstract": "Big data are everywhere. World Wide Web is an example of these big data. It has become a vast data production and consumption platform, at which threads of data evolve from multiple devices, by different human interactions, over worldwide locations, under divergent distributed settings. Embedded in these big web data is implicit, previously unknown and potentially useful information and knowledge that awaited to be discovered. This calls for web intelligence solutions, which make good use of data science and data mining (especially, web mining) to discover useful knowledge and important information from the web. As a web mining task, web structure mining aims to examine incoming and outgoing links on web pages and make recommendations of frequently referenced web pages to web surfers. As another web mining task, web usage mining aims to examine web surfer patterns and make recommendations of frequently visited pages to web surfers. While the size of the web is huge, the connection among all web pages may be sparse. In other words, the number of vertex nodes (i.e., web pages) on the web is huge, the number of directed edges (i.e., incoming and outgoing hyperlinks between web pages) may be small. This leads to a sparse web. In this paper, we present a solution for interpretable mining of influential patterns from sparse web. In particular, we represent web structure and usage information by bitmaps to capture connections to web pages. Due to the sparsity of the web, we compress the bitmaps, and use them in mining influential patterns (e.g., popular web pages). For explainability of the mining process, we ensure the compressed bitmaps are interpretable. Evaluation on real-life web data demonstrates the effectiveness, interpretability and practicality of our solution for interpretable mining of influential patterns from sparse web.", "venue": "WI/IAT", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2021-12-14", "journal": {"name": "IEEE/WIC/ACM International Conference on Web Intelligence and Intelligent Agent Technology"}, "authors": [{"authorId": "1911002339", "name": "Connor C. J. Hryhoruk"}, {"authorId": "1726081", "name": "C. Leung"}], "citations": [{"paperId": "e8b4a0d4f5212bf51f6bc72b47aa6fb2b5d4b36a", "title": "A Big Data Science Solution for Transportation Analytics with Meteorological Data"}, {"paperId": "97a433ee35c70caebea9951e0b8bd9bfaf877881", "title": "Web Mining from Interpretable Compressed Representation of Sparse Web"}, {"paperId": "2d0a643701b63e060dc181f12b01be2900e7f13e", "title": "Trustworthy Explanations for Knowledge Discovered from E-Health Records"}, {"paperId": "e1abde48eb0d0477e7c367ed101aec5076c2889b", "title": "A Deep Learning Based Predictive Model for Healthcare Analytics"}, {"paperId": "b38235fd1746be6d89d10960549f2c78a9d263fb", "title": "Towards Trustworthy Artificial Intelligence in Healthcare"}]}
