{"paperId": "b70b19f78fa706420034a4f5695eec98f5edcbf5", "publicationVenue": null, "title": "Seamless Sensor Data Acquisition for the Edge-to-Cloud Continuum", "abstract": "Modern computing is a continuum that runs from individual terminals and specialized embedded devices to the Cloud, passing through gateways and edge/fog computing nodes.A major challenge is the integration with the Internet of Things (IoT), especially with respect to sensor data acquisition, in an edge-to-cloud perspective. Despite novel approaches leveraging widely accepted standards have emerged for representing IoT objects and data, effective application-layer protocols for sensor data acquisition along the path from the edge to the cloud are missing. In this work, we propose SEAMDAP, an application-layer protocol enabling seamless sensor data acquisition for the edge-to-cloud continuum, based on standards for entity representations. We report the quantitative evaluation of a SEAMDAP-based system implementation, comprising an edge node and different IoT systems. The system was deployed in 2020 and thereafter has been supporting scalable sensor/satellite-driven services for wide-area Smart Farming applications.", "venue": "2022 IEEE Intl Conf on Dependable, Autonomic and Secure Computing, Intl Conf on Pervasive Intelligence and Computing, Intl Conf on Cloud and Big Data Computing, Intl Conf on Cyber Science and Technology Congress (DASC/PiCom/CBDCom/CyberSciTech)", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-09-12", "journal": {"name": "2022 IEEE Intl Conf on Dependable, Autonomic and Secure Computing, Intl Conf on Pervasive Intelligence and Computing, Intl Conf on Cloud and Big Data Computing, Intl Conf on Cyber Science and Technology Congress (DASC/PiCom/CBDCom/CyberSciTech)", "pages": "1-8"}, "authors": [{"authorId": "2023741479", "name": "Gabriele Penzotti"}, {"authorId": "2196951710", "name": "Davide Tarasconi"}, {"authorId": "46954165", "name": "S. Caselli"}, {"authorId": "1746877", "name": "M. Amoretti"}], "citations": [{"paperId": "954aa84d35a98f269debd35edb65c40a1be60c5b", "title": "Computers and Electronics in Agriculture"}]}
