{"paperId": "b70e402def4c4bd97e2e0e248caf46c797412126", "publicationVenue": {"id": "1c33551e-10c3-4d44-84d5-3be94805ee3e", "name": "Journal of Advanced Transportation", "type": "journal", "alternate_names": ["J Adv Transp"], "issn": "0197-6729", "url": "https://www.hindawi.com/journals/jat/", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/20423195", "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)2042-3195"]}, "title": "Vehicle Movement Analyses Considering Altitude Based on Modified Digital Elevation Model and Spherical Bilinear Interpolation Model: Evidence from GPS-Equipped Taxi Data in Sanya, Zhengzhou, and Liaoyang", "abstract": "Aggravating energy shortages and increasing labor costs have become global problems and have garnered special importance in recent years in the transportation sector, especially in taxi markets. Automatic vehicles have a bright future, however, there is an equal amount of skepticism and concern about safety for all the optimism. To unlock the potential of automatic vehicles in intelligent transportation systems, a lot more data and testing are required to promote safety level as far as possible and achieve the organizational aim of reducing accidents to zero tolerance. And it is vital to provide accurate models for vehicle movement analyses. In this study, Modified Digital Elevation (MDE) model and Spherical Bilinear Interpolation (SBI) model were proposed for vehicle movement analyses considering altitude. And the experimental data of 9,990 GPS-enabled taxis in Sanya, Zhengzhou, and Liaoyang were adopted to support comparisons. Measurement results showed that MDE model had over 99% less disparity with direct solution than original model and SBI model could further improve the effects. It indicated that the application of MDE model and SBI model could improve both accuracy and efficiency of vehicle movement analyses and it had a bright future in the field of automatic vehicles. Future directions could be improving models and expanding data.", "venue": "Journal of Advanced Transportation", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2020-01-20", "journal": {"name": "Journal of Advanced Transportation"}, "authors": [{"authorId": "34573163", "name": "J. Gui"}, {"authorId": "31354614", "name": "Qunqi Wu"}], "citations": [{"paperId": "91c747e8f7a87c9c4d7ac1fb583ef5e8e3c76cb4", "title": "A diagnostic classification of lung nodules using multiple-scale residual network"}, {"paperId": "64ac1708b1befd7f91650f9e76329f0c0148537a", "title": "A Crop Image Segmentation and Extraction Algorithm Based on Mask RCNN"}, {"paperId": "bb6578543009ef4f77bf9afb4880e2a1cfc5bc3e", "title": "E-mobility ecosystem innovation – impact on downstream supply chain management processes. Is India ready for inevitable change in auto sector?"}, {"paperId": "82dbb33da741f1678289f9c45fd63c4e9c98e376", "title": "Customized Bus Survey and Data Analysis Based on Round-Trip Data between Changchun and Tonghua"}, {"paperId": "8110b674819ec918187756463c12dbcc19634102", "title": "Innovation Exploration on the Integration of Comprehensive Transportation by Service Middleman"}, {"paperId": "45c07211b1d729c329370155876f96895d822afd", "title": "Multiple Utility Analyses for Sustainable Public Transport Planning and Management: Evidence from GPS-Equipped Taxi Data in Haikou"}, {"paperId": "0a750666635ad7f068695924aca178c01cd33ec1", "title": "Customized Passenger Transport Service Innovation for Intelligent Time: Evidence from Empirical Data in Siping"}]}
