{"paperId": "b73ffac529cb4bfe43675f50e170ac0efd106a35", "publicationVenue": {"id": "3b4e0d11-3211-4ead-848c-99928b5ef30e", "name": "IEEE Network", "type": "journal", "alternate_names": ["IEEE Netw"], "issn": "0890-8044", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=65"}, "title": "GCWCN: 6G-Based Global Coverage Wireless Communication Network Architecture", "abstract": "At present, the world is experiencing a significant transformation from the fifth generation (5G) wireless communication network to the sixth generation (6G) wireless communication network. An important goal is to achieve seamless global coverage of wireless signals. The combination of space network, air network, and ground network has been proved to be effective, but the maritime network has not been taken into account. Therefore, how to effectively achieve the global coverage of wireless networks is a challenging topic. This article first compares the performance of 5G and 6G, and analyzes the possibility of a wireless communication network with global coverage based on 6G technology. After that, we respectively analyze the typical characteristics of space network, air network, terrestrial network, and maritime network, and then lead to the key enabling technologies to combine them. Based on the typical characteristics of the above heterogeneous networks and combined with the enabling technologies, we try to propose a 6G-supported space-air-ground-sea integrated network (SAGSIN) architecture to achieve seamless global wireless signal coverage. In the end, we rationally analyze a series of challenges and difficulties that may be faced in implementing the architecture.", "venue": "IEEE Network", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-01", "journal": {"name": "IEEE Network", "pages": "218-223", "volume": "37"}, "authors": [{"authorId": "2144447082", "name": "Chao Wang"}, {"authorId": "40075749", "name": "Peiying Zhang"}, {"authorId": "31682744", "name": "Neeraj Kumar"}, {"authorId": "2150801835", "name": "Lei Liu"}, {"authorId": "2122813909", "name": "Tingting Yang"}], "citations": [{"paperId": "fbccfc77106df136eb46a56f49cfebd98fe4eb02", "title": "A Routing Strategy Based Genetic Algorithm Assisted by Ground Access Optimization for LEO Satellite Constellations"}, {"paperId": "445f8bc9926e96079673167981a77b7e72cbe999", "title": "Time-Division Based Integrated Sensing, Communication, and Computing in Integrated Satellite-Terrestrial Networks"}, {"paperId": "8eff2efedc11851a5dff31368757b173603e90dc", "title": "An improved CNN-LSTM network for modulation identification relying on periodic features of signal"}, {"paperId": "1fac8fdfdd8f12a4a9d906d890c60a43e3b59451", "title": "An Attention Mechanism-Based Microservice Placement Scheme for On-Star Edge Computing Nodes"}]}
