{"paperId": "b744f31c3d5801247912e748b48a9a2905cb83a9", "publicationVenue": {"id": "2670b208-aca8-45b3-8a07-dba73daff0bf", "name": "International Transactions on Electrical Energy Systems", "type": "journal", "alternate_names": ["Int Trans Electr Energy Syst"], "issn": "0939-3072", "alternate_issns": ["2050-7038"], "url": "https://onlinelibrary.wiley.com/journal/15463109", "alternate_urls": ["http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)2050-7038", "http://www3.interscience.wiley.com/cgi-bin/jtoc/106562716/all"]}, "title": "Design and Implementation of the Zero Trust Model in the Power Internet of Things", "abstract": "As a novel network security scheme, the zero trust model can effectively improve the traditional role-based access control model in the public network by continuous trust evaluation and dynamic authorization. As a private network for collecting the health status data of the power equipment, the terminals in the power Internet of Things (IoT) have the characteristics of fixed and controllable hardware, software, and users, and the main network security threat of the power IoT comes from the risk of terminals being damaged or forged. Therefore, based on the analysis of the key connotation of the zero trust and the security characteristics of the power IoT, this paper proposes a novel zero trust model and framework to synthetically evaluate the security status of the power IoT based on the behaviour and characteristics of the terminals. The analysis based on the stochastic Petri net and simulation results show that the proposed model can effectively address network security problems and significantly improve the level of security protection of the power IoT.", "venue": "International Transactions on Electrical Energy Systems", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-04-20", "journal": {"name": "International Transactions on Electrical Energy Systems"}, "authors": [{"authorId": "1697637", "name": "Kehe Wu"}, {"authorId": "32374968", "name": "Rui Cheng"}, {"authorId": "2213663903", "name": "Huiyan Xu"}, {"authorId": "2147340074", "name": "Jie Tong"}], "citations": [{"paperId": "cb9114e37494c9579fac3863dd2410d322d5be2f", "title": "Open Radio Access Networks for Smart IoT Systems: State of Art and Future Directions"}]}
