{"paperId": "b745870b9012dea7f98443e973b85cee69dfff73", "publicationVenue": {"id": "047958df-6384-459e-9864-63f946419551", "name": "International Conference on Computer Science and Application Engineering", "type": "conference", "alternate_names": ["Int Conf Comput Sci Appl Eng", "IEEE International Conference on Computer Science and Automation Engineering", "IEEE Int Conf Comput Sci Autom Eng", "CSAE"]}, "title": "Remaining Useful Life Prediction of Equipment Based on XGBoost", "abstract": "Remaining Useful Life (RUL) prediction is an essential task in the practice of predictive maintenance which aims at repairing equipment before it fails based on data received about it from sensors. Our simulation experiments use the Turbofan engine degradation dataset CMAPSS Data, which gained historical data to predict the remaining useful life and does not require participants to consider the underlying physical factors. RUL prediction is performed by machine learning methods including Decision Tree (DT), Random Forest (RF), Support Vector Regression (SVR), and XGBoost after data pre-processing and feature selection. XGboost is a kind of ensemble learning algorithm that can generate a series of weak learners by continuous training and then combine these weak learners to become a strong learner. Experimental results reveal that the performance of XGBoost based model is effective in such dataset comparing with the traditional machine learning models.", "venue": "International Conference on Computer Science and Application Engineering", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2021-10-19", "journal": {"name": "Proceedings of the 5th International Conference on Computer Science and Application Engineering"}, "authors": [{"authorId": "1871131", "name": "Zhiyang Jia"}, {"authorId": "1691608", "name": "Zhibo Xiao"}, {"authorId": "2118898400", "name": "Yijin Shi"}], "citations": [{"paperId": "47d040c6f1583e04c97824816872734557a2f880", "title": "Rolling Bearing Fault Prediction Based On Feature Fusion Of HI Curves And GRU Networks"}, {"paperId": "b0694e2912041a0f92114b79d25567afb172bbc2", "title": "IIoT-based Predictive Maintenance for Oil and Gas Industry"}]}
