{"paperId": "b74fbb8d5063711f4377ec4c80fd41c527f78422", "publicationVenue": {"id": "2194778f-4fb6-471e-b2ff-5ad194635f72", "name": "Measurement and Modeling of Computer Systems", "type": "conference", "alternate_names": ["Meas Model Comput Syst", "SIGMETRICS"], "url": "http://www.acm.org/sigmetrics/"}, "title": "Understanding Reduced-Voltage Operation in Modern DRAM Devices", "abstract": "The energy consumption of DRAM is a critical concern in modern computing systems. Improvements in manufacturing process technology have allowed DRAM vendors to lower the DRAM supply voltage conservatively, which reduces some of the DRAM energy consumption. We would like to reduce the DRAM supply voltage more aggressively, to further reduce energy. Aggressive supply voltage reduction requires a thorough understanding of the effect voltage scaling has on DRAM access latency and DRAM reliability. In this paper, we take a comprehensive approach to understanding and exploiting the latency and reliability characteristics of modern DRAM when the supply voltage is lowered below the nominal voltage level specified by DRAM standards. Using an FPGA-based testing platform, we perform an experimental study of 124 real DDR3L (low-voltage) DRAM chips manufactured recently by three major DRAM vendors. We find that reducing the supply voltage below a certain point introduces bit errors in the data, and we comprehensively characterize the behavior of these errors. We discover that these errors can be avoided by increasing the latency of three major DRAM operations (activation, restoration, and precharge). We perform detailed DRAM circuit simulations to validate and explain our experimental findings. We also characterize the various relationships between reduced supply voltage and error locations, stored data patterns, DRAM temperature, and data retention. Based on our observations, we propose a new DRAM energy reduction mechanism, called Voltron. The key idea of Voltron is to use a performance model to determine by how much we can reduce the supply voltage without introducing errors and without exceeding a user-specified threshold for performance loss. Our evaluations show that Voltron reduces the average DRAM and system energy consumption by 10.5% and 7.3%, respectively, while limiting the average system performance loss to only 1.8%, for a variety of memory-intensive quad-core workloads. We also show that Voltron significantly outperforms prior dynamic voltage and frequency scaling mechanisms for DRAM.", "venue": "Measurement and Modeling of Computer Systems", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2017-05-29", "journal": {"name": "Proceedings of the ACM on Measurement and Analysis of Computing Systems", "pages": "1 - 42", "volume": "1"}, "authors": [{"authorId": "2289261", "name": "K. Chang"}, {"authorId": "11827442", "name": "A. G. Yağlıkçı"}, {"authorId": "33801185", "name": "Saugata Ghose"}, {"authorId": "152917671", "name": "Aditya Agrawal"}, {"authorId": "48930807", "name": "Niladrish Chatterjee"}, {"authorId": "2080117084", "name": "Abhijith Kashyap"}, {"authorId": "48893570", "name": "Donghyuk Lee"}, {"authorId": "1397041984", "name": "Mike O'Connor"}, {"authorId": "40016363", "name": "Hasan Hassan"}, {"authorId": "145929920", "name": "O. Mutlu"}], "citations": [{"paperId": "8c5ef03e9118253ec019965bf142d1be7998a453", "title": "Functionally-Complete Boolean Logic in Real DRAM Chips: Experimental Characterization and Analysis"}, {"paperId": "6ba01138fcabdc9df56e8a69588a82fd91480a63", "title": "Spatial Variation-Aware Read Disturbance Defenses: Experimental Analysis of Real DRAM Chips and Implications on Future Solutions"}, {"paperId": "763488734b9b5f6f475838c43746cf16f3fe5b0a", "title": "Rethinking the Producer-Consumer Relationship in Modern DRAM-Based Systems"}, {"paperId": "1cfd2132c44343429cf6970e9a58956971aed0f1", "title": "Power-Aware Neuromorphic Architecture With Partial Voltage Scaling 3-D Stacking Synaptic Memory"}, {"paperId": "b173f464ef74f8bfa424e51e4ae43ec000eb67ad", "title": "Unity ECC: Unified Memory Protection Against Bit and Chip Errors"}, {"paperId": "3f42e18e10f251bd0e1ac25981f65451568ccc9b", "title": "CDAR-DRAM: Enabling Runtime DRAM Performance and Energy Optimization via In-Situ Charge Detection and Adaptive Data Restoration"}, {"paperId": "ddb783c5a134e52f4c09dfce054c0981acf4133a", "title": "CoolDRAM: An Energy-Efficient and Robust DRAM"}, {"paperId": "89b9a504d3d6d072c4c036720bd0d19b5b207875", "title": "Superconducting Hyperdimensional Associative Memory Circuit for Scalable Machine Learning"}, {"paperId": "84b33fee83c23b77751f08b97dc30436d036fc73", "title": "CorcPUM: Efficient Processing Using Cross-Point Memory via Cooperative Row-Column Access Pipelining and Adaptive Timing Optimization in Subarrays"}, {"paperId": "b5ace93de904d7ccebbc328d5fce45c2f8e671bb", "title": "Retrospective: RAIDR: Retention-Aware Intelligent DRAM Refresh"}, {"paperId": "70f2f94f9a2759eb86b0ed1079da0dce468e3f7c", "title": "Retrospective: An Experimental Study of Data Retention Behavior in Modern DRAM Devices: Implications for Retention Time Profiling Mechanisms"}, {"paperId": "fe445e21c5441f5e515fb40c22238277e679016d", "title": "Voltage Reduced Self Refresh (VRSR) for optimized energy savings in DRAM Memories"}, {"paperId": "e753dfd49ff4b286c1e5ec17bbe6e24fe2f402b3", "title": "AGNI: In-Situ, Iso-Latency Stochastic-to-Binary Number Conversion for In-DRAM Deep Learning"}, {"paperId": "4c5d837ac09025dd8d4c4a6db48bddb8841d4a08", "title": "TuRaN: True Random Number Generation Using Supply Voltage Underscaling in SRAMs"}, {"paperId": "0c7607f8da3936420c778a6418e2ea5d89f7775c", "title": "DRAM Bender: An Extensible and Versatile FPGA-Based Infrastructure to Easily Test State-of-the-Art DRAM Chips"}, {"paperId": "cd6d2890b95a8dd9537559358d4bead53870a429", "title": "HammerScope: Observing DRAM Power Consumption Using Rowhammer"}, {"paperId": "9c3af22b79cc7f577649d17a27f4fe3884ff143b", "title": "Approximate Memory with Protected Static Allocation"}, {"paperId": "7c9b615fe6fc7409b837e2a5cfda1be13e36ef93", "title": "SpyHammer: Using RowHammer to Remotely Spy on Temperature"}, {"paperId": "27b5c333fccd3674189f508327f5663af6f1e7cd", "title": "An Approximate Memory Based Defense Against Model Inversion Attacks to Neural Networks"}, {"paperId": "85331dc894818f26e416688ff3f0535335f8768c", "title": "HiRA: Hidden Row Activation for Reducing Refresh Latency of Off-the-Shelf DRAM Chips"}, {"paperId": "e3edc0c42f3c1068959cf127a66bd21d4fe4261e", "title": "Joint Undervolting and Overclocking Power Scaling Approximation on FPGAs"}, {"paperId": "ac6b94543492cc4cac95d72240179dcf018ff38d", "title": "EnforceSNN: Enabling resilient and energy-efficient spiking neural network inference considering approximate DRAMs for embedded systems"}, {"paperId": "f15b80ab5173a9cc3d7dd2353678e617e89bd54e", "title": "Self-Managing DRAM: A Low-Cost Framework for Enabling Autonomous and Efficient in-DRAM Operations"}, {"paperId": "aff8f3388ae7b89f2028286bc13b3ad01ff1d911", "title": "PIPF-DRAM: processing in precharge-free DRAM"}, {"paperId": "5f9ba66514be76868e2a2d1c540a858b38ef5000", "title": "Understanding RowHammer Under Reduced Wordline Voltage: An Experimental Study Using Real DRAM Devices"}, {"paperId": "2106b4aa6b61168c317dccd94f8ded96bbae10b8", "title": "PiDRAM: An FPGA-based Framework for End-to-end Evaluation of Processing-in-DRAM Techniques"}, {"paperId": "7e4c69f3e3889b614f75da42e56b49344a9e8047", "title": "AgilePkgC: An Agile System Idle State Architecture for Energy Proportional Datacenter Servers"}, {"paperId": "40b261c056da0e26f598b75000a6bccafffd09fd", "title": "A Case for Transparent Reliability in DRAM Systems"}, {"paperId": "80c90f6fdeb33481f6006575d96fdc0154916d70", "title": "CPU-GPU-Memory DVFS for Power-Efficient MPSoC in Mobile Cyber Physical Systems"}, {"paperId": "79210f66ba07cfcf3126c3d62d9d458aa6d57c28", "title": "AgileWatts: An Energy-Efficient CPU Core Idle-State Architecture for Latency-Sensitive Server Applications"}, {"paperId": "f5fc7450ddb9ee3b603db09608db3f9f53d84eeb", "title": "SmartApprox: Learning-based configuration of approximate memories for energy-efficient execution"}, {"paperId": "b08d9f91582a2c887f04e2a67265b837d96e6cf1", "title": "Enzian: an open, general, CPU/FPGA platform for systems software research"}, {"paperId": "39119e00b68becf15ae8128e938bd82ce19eab54", "title": "VAR-DRAM: Variation-Aware Framework for Efficient Dynamic Random Access Memory Design"}, {"paperId": "00c6c8b3ac452a6710af1fd33011f24da5eccce9", "title": "DR-STRaNGe: End-to-End System Design for DRAM-based True Random Number Generators"}, {"paperId": "45e57e636b4ea66962d1709bc5f6beab0544e521", "title": "FT-DeepNets: Fault-Tolerant Convolutional Neural Networks with Kernel-based Duplication"}, {"paperId": "d0e452f841649e4dc50edfff3287fb2ea9be3f04", "title": "Extending Memory Capacity in Consumer Devices with Emerging Non-Volatile Memory: An Experimental Study"}, {"paperId": "361b14bbd0345f404c3be486464fb3cb6c78aad4", "title": "PiDRAM: A Holistic End-to-end FPGA-based Framework for Processing-in-DRAM"}, {"paperId": "62bc74c87efc71004c8b0c7e29ecc40d51c68cfd", "title": "A Deeper Look into RowHammer’s Sensitivities: Experimental Analysis of Real DRAM Chips and Implications on Future Attacks and Defenses"}, {"paperId": "3e234d3c5aa3730c05986090b8c42121c90aa4e9", "title": "Uncovering In-DRAM RowHammer Protection Mechanisms:A New Methodology, Custom RowHammer Patterns, and Implications"}, {"paperId": "dfc3171f8b5f0fbb6d36f838a98ba0ffd0d605ee", "title": "MoRS: An Approximate Fault Modeling Framework for Reduced-Voltage SRAMs"}, {"paperId": "7b78d629c823f6345343cce85a11f3d95aa4ac3e", "title": "Benchmarking Memory-Centric Computing Systems: Analysis of Real Processing-In-Memory Hardware"}, {"paperId": "f77a451dcd82fb6a35f079ac50bda2dfe3ef31a7", "title": "HARP: Practically and Effectively Identifying Uncorrectable Errors in Memory Chips That Use On-Die Error-Correcting Codes"}, {"paperId": "55498b39456290025c43e26cd269b11b353fe281", "title": "ReSpawn: Energy-Efficient Fault-Tolerance for Spiking Neural Networks considering Unreliable Memories"}, {"paperId": "001eb5709572a014485bbcf1e983442351d05f80", "title": "Using Undervolting as an on-Device Defense Against Adversarial Machine Learning Attacks"}, {"paperId": "98820c023ded308084d49d05b4fc6f797014a15e", "title": "On the Impact of Device-Level Techniques on Energy-Efficiency of Neural Network Accelerators"}, {"paperId": "bf19a131074672a8bb8f823134dba1cf919e552d", "title": "PF-DRAM: A Precharge-Free DRAM Structure"}, {"paperId": "77c2faaf3f170822c3e37c4ecb4c8f13894b27ab", "title": "CODIC: A Low-Cost Substrate for Enabling Custom In-DRAM Functionalities and Optimizations"}, {"paperId": "d441e66baa101273fc5323a1fb05f5141f5a8a51", "title": "QUAC-TRNG: High-Throughput True Random Number Generation Using Quadruple Row Activation in Commodity DRAM Chips"}, {"paperId": "8e87c31c9174c254b824910e28b5bf66f274650e", "title": "Benchmarking a New Paradigm: An Experimental Analysis of a Real Processing-in-Memory Architecture"}, {"paperId": "8e85281351edfd13081f1175fb102836ccc4baca", "title": "DAMOV: A New Methodology and Benchmark Suite for Evaluating Data Movement Bottlenecks"}, {"paperId": "874f06ec7c78444087fca79ddeb2bfd1b72576a8", "title": "Random and Adversarial Bit Error Robustness: Energy-Efficient and Secure DNN Accelerators"}, {"paperId": "4dd219e477f063b1f0f65d43d3b0c36f65aa2e54", "title": "Towards Row Sensitive DRAM Refresh through Retention Awareness"}, {"paperId": "da1f6480600765aceae6ea79471002cee6e03588", "title": "Deep PUF: A Highly Reliable DRAM PUF-Based Authentication for IoT Networks Using Deep Convolutional Neural Networks"}, {"paperId": "b96a224c612b76de782ce4df646248642c9323fe", "title": "SparkXD: A Framework for Resilient and Energy-Efficient Spiking Neural Network Inference using Approximate DRAM"}, {"paperId": "304b971520976e3a060abfd23399108434a3308e", "title": "BlockHammer: Preventing RowHammer at Low Cost by Blacklisting Rapidly-Accessed DRAM Rows"}, {"paperId": "1f8fcb745ba964c7b73f5fba94601f457034372e", "title": "ParaDox: Eliminating Voltage Margins via Heterogeneous Fault Tolerance"}, {"paperId": "8dd6c84dce582389df1c0b72471d7ab1e0b9f27b", "title": "Understanding Power Consumption and Reliability of High-Bandwidth Memory with Voltage Underscaling"}, {"paperId": "f58babc873f629090f213499f3dee18a2c507329", "title": "Intelligent Architectures for Intelligent Computing Systems"}, {"paperId": "db2c7eb1bad3ff523d303cf34a16cfa90fec680d", "title": "Reducing solid-state drive read latency by optimizing read-retry"}, {"paperId": "9a70e291365d609d22aae399d3ac32dd69baace9", "title": "MIDAS: Model Inversion Defenses Using an Approximate Memory System"}, {"paperId": "7bb6015f45457fdbe3bb39e17dc9cb0786ecd688", "title": "A Modern Primer on Processing in Memory"}, {"paperId": "d0d3d93406c98311498807a894f4f9b8004f9e50", "title": "Aging-Aware Request Scheduling for Non-Volatile Main Memory"}, {"paperId": "a7dbaca35619275deebb72146a7ba559ec93b0dc", "title": "Revealing DRAM Operating GuardBands Through Workload-Aware Error Predictive Modeling"}, {"paperId": "95dd1f7f543c84f358975edc132f5aeac4051cda", "title": "Risk-5: Controlled Approximations for RISC-V"}, {"paperId": "9ba12148eaa522b270a1a7dbe9007137ebd60096", "title": "Graphene: Strong yet Lightweight Row Hammer Protection"}, {"paperId": "9e5140f40c2dc97eff173fefe9d73337f4a523fc", "title": "FIGARO: Improving System Performance via Fine-Grained In-DRAM Data Relocation and Caching"}, {"paperId": "6679cfabe152f418ea9d32efff4db874886fcfa8", "title": "Bit-Exact ECC Recovery (BEER): Determining DRAM On-Die ECC Functions by Exploiting DRAM Data Retention Characteristics"}, {"paperId": "e3852ead71a7c10c033f5f78e65dfc98d765e4cc", "title": "Mitigating the Latency-Area Tradeoffs for DRAM Design with Coarse-Grained Monolithic 3D (M3D) Integration"}, {"paperId": "04621c422475a040e7a661a79559c64531dacc25", "title": "Intelligent Architectures for Intelligent Machines"}, {"paperId": "dff4f9c2cab4b29dc0b219f64b358e3841598292", "title": "Intelligent Management of Mobile Systems through Computational Self-Awareness"}, {"paperId": "f89cb09ddc564ae13687e0c7d9a981363f2a5aa6", "title": "Energy Efficient Computing Systems: Architectures, Abstractions and Modeling to Techniques and Standards"}, {"paperId": "3382ae77438d629595e9ea28284d2dce02296aba", "title": "DStress: Automatic Synthesis of DRAM Reliability Stress Viruses using Genetic Algorithms"}, {"paperId": "e2e215ec97419f15de4027155bc7b7dc70d7fc98", "title": "Bit Error Robustness for Energy-Efficient DNN Accelerators"}, {"paperId": "a1db46169a8c6ab333ae36d1223c70cc7a1490b3", "title": "On Mitigating Random and Adversarial Bit Errors"}, {"paperId": "27a36a87f4d4e468f0c68ac88cdb0e6e03fafcf1", "title": "Generating Representative Test Sequences from Real Workload for Minimizing DRAM Verification Overhead"}, {"paperId": "a3d19dc7b3cbd9cfc2c08c5f555b82dd127e98fb", "title": "Improving phase change memory performance with data content aware access"}, {"paperId": "7574bf92b17321c93df3c5b398df12de64eb5e3f", "title": "Power and Accuracy of Multi-Layer Perceptrons (MLPs) under Reduced-voltage FPGA BRAMs Operation"}, {"paperId": "5f020fcab6635c5290d3609c419fb8b9bb63027e", "title": "An Experimental Study of Reduced-Voltage Operation in Modern FPGAs for Neural Network Acceleration"}, {"paperId": "ec6ca596b8a74e2a2c6a525fb9ccd3476c20eb3e", "title": "Revisiting RowHammer: An Experimental Analysis of Modern DRAM Devices and Mitigation Techniques"}, {"paperId": "acdfe34aab867d1a0101c88dba299a56274388d8", "title": "CLR-DRAM: A Low-Cost DRAM Architecture Enabling Dynamic Capacity-Latency Trade-Off"}, {"paperId": "3c8c28f979db20da445d9baf9fbf49522b19dff2", "title": "SysScale: Exploiting Multi-domain Dynamic Voltage and Frequency Scaling for Energy Efficient Mobile Processors"}, {"paperId": "6316e1473e478c5ff5099b3b3b77b529d36f9f77", "title": "TRRespass: Exploiting the Many Sides of Target Row Refresh"}, {"paperId": "afd0d496ec266f49049f95ea4e8898475004ce12", "title": "HaRMony: Heterogeneous-Reliability Memory and QoS-Aware Energy Management on Virtualized Servers"}, {"paperId": "a1761173a8aa15904dd361c99d738b7a2148ec26", "title": "Pods - A novel intelligent energy efficient and dynamic frequency scalings for multi-core embedded architectures in an IoT environment"}, {"paperId": "b4cc9b06df812bb87eb26078a8f92bf8b3d2c5d6", "title": "Techniques for Reducing the Connected-Standby Energy Consumption of Mobile Devices"}, {"paperId": "47a0ffedf83d3f9a9a998bd29bd40b015afb0613", "title": "On the Resilience of Deep Learning for Reduced-voltage FPGAs"}, {"paperId": "64de7c5a2434e8293c86dcc223283280a584604c", "title": "Demystifying Complex Workload-DRAM Interactions"}, {"paperId": "1cb4384fd0c37cdb8bc8e0a779a32cac8cd73ffe", "title": "Towards the Avoidance of Counterfeit Memory: Identifying the DRAM Origin"}, {"paperId": "2ca11e69ae23eb51cdbc35f9b6a2981b3f5fdc0c", "title": "Refresh Triggered Computation"}, {"paperId": "ae216775f6d86773da7eeac27d361de019f386bb", "title": "EDEN: Enabling Energy-Efficient, High-Performance Deep Neural Network Inference Using Approximate DRAM"}, {"paperId": "96bdc40b85b9e3dc112fafa6a74fa55422428ea2", "title": "Workload-Aware DRAM Error Prediction using Machine Learning"}, {"paperId": "49532cb16924c06454301f989e2c37c9accc6cd3", "title": "A Workload and Programming Ease Driven Perspective of Processing-in-Memory"}, {"paperId": "047238356ae93372a97be3b4cbd36ae6fee71ae5", "title": "Demystifying Complex Workload-DRAM Interactions: An Experimental Study"}, {"paperId": "964849dbdb9de928625a261f6b655bc8f7670d9c", "title": "Fault Tolerance Technique Offlining Faulty Blocks by Heap Memory Management"}, {"paperId": "de0c0e2df937e6a126f2322ea07d3e36080ed991", "title": "Understanding and Modeling On-Die Error Correction in Modern DRAM: An Experimental Study Using Real Devices"}, {"paperId": "9765611b5b8838816ee6975adc4dbf58c44a055b", "title": "SuDoku: Tolerating High-Rate of Transient Failures for Enabling Scalable STTRAM"}, {"paperId": "b0197170bd915f3d4060096e5ffd8eed5f14f61f", "title": "CROW: A Low-Cost Substrate for Improving DRAM Performance, Energy Efficiency, and Reliability"}, {"paperId": "91e028dd30c114f1a0af539cf6ac86c20eda9f73", "title": "In-DRAM Bulk Bitwise Execution Engine"}, {"paperId": "f835e54450463440d0f9e21b1c1874db086fc44c", "title": "RowHammer: A Retrospective"}, {"paperId": "4f17bd15a6f86730ac2207167ccf36ec9e6c2391", "title": "Processing Data Where It Makes Sense: Enabling In-Memory Computation"}, {"paperId": "f9b980cba2426e82b62371aa05350a108b203118", "title": "ITAP"}, {"paperId": "680daccbd4b662ea8ccba859bd42e4b9df97d27d", "title": "Understanding the Interactions of Workloads and DRAM Types: A Comprehensive Experimental Study"}, {"paperId": "54c945d17973276b8de3e75a3c12adc8b25adee6", "title": "Evaluating Built-In ECC of FPGA On-Chip Memories for the Mitigation of Undervolting Faults"}, {"paperId": "fa763196bc2c0abfd2f7d995a5e62726c93acbde", "title": "Some Like It Cold: Initial Testing Results for Cryogenic Computing Components"}, {"paperId": "4746be9f3fa6d5816438b5a32a2d6db2966d6ee3", "title": "Large Scale Studies of Memory, Storage, and Network Failures in a Modern Data Center"}, {"paperId": "2ac29bf314581ab18234a3fb7d04a7dd53bd5f3c", "title": "Shimmer: Implementing a Heterogeneous-Reliability DRAM Framework on a Commodity Server"}, {"paperId": "e904e504029271fda37da44a069dfd26eb0981fb", "title": "Impacts of Memory Address Mapping Scheme on Reducing DRAM Self-Refresh Power for Mobile Computing Devices"}, {"paperId": "ba825479d564496e664a9d7ec31145f1670da6d5", "title": "Aggressive undervolting of FPGAs : power & reliability trade-offs"}, {"paperId": "c24455fc319c2e24a5654d56ce4579c4c75c7bf6", "title": "Comprehensive Evaluation of Supply Voltage Underscaling in FPGA on-Chip Memories"}, {"paperId": "b5d8306cb9f648b5567b934124010849ba752816", "title": "Reducing DRAM Latency via Charge-Level-Aware Look-Ahead Partial Restoration"}, {"paperId": "6fd3cf784f9608f57a4f9c26ad63d09f1e8419c5", "title": "Solar-DRAM: Reducing DRAM Access Latency by Exploiting the Variation in Local Bitlines"}, {"paperId": "483d76f6760517c29d87d152de12a5102012a6df", "title": "Impact of Memory Approximation on Energy Efficiency"}, {"paperId": "0a3dd16af1e98459a854b309b33dda53b332e348", "title": "The Processing-in-Memory Paradigm: Mechanisms to Enable Adoption"}, {"paperId": "5535fec7822abc2edc8e4a45df5432426b45e138", "title": "D-RaNGe: Using Commodity DRAM Devices to Generate True Random Numbers with Low Latency and High Throughput"}, {"paperId": "67cd6da17d4f51951d4dbfb3429c82fc77df7c52", "title": "Architectural Techniques for Improving NAND Flash Memory Reliability"}, {"paperId": "0f6e64b74fb20adc53749ca2dfb02332aab3ff3f", "title": "PreLatPUF: Exploiting DRAM Latency Variations for Generating Robust Device Signatures"}, {"paperId": "900421076ef05b56ba843ebcf80d991840104dcb", "title": "Exploiting DRAM Latency Variations for Generating True Random Numbers"}, {"paperId": "2101f67da3205ab4af5d2ddf9f80a85d6e45f6b8", "title": "A Demo of FPGA Aggressive Voltage Downscaling: Power and Reliability Tradeoffs"}, {"paperId": "79b0f7e05f6e32fce0aac8d27925273c4390bc60", "title": "Fault Characterization Through FPGA Undervolting"}, {"paperId": "7c3b0fda8bda8a1236e27326f34625f0d111e678", "title": "On the Resilience of RTL NN Accelerators: Fault Characterization and Mitigation"}, {"paperId": "cc1eff4ad90308ced3d2a89e1d1150ce6bf83a4c", "title": "What Your DRAM Power Models Are Not Telling You"}, {"paperId": "65fec44db0d1b425fd46a8f01a35ea767dc36337", "title": "Improving 3D NAND Flash Memory Lifetime by Tolerating Early Retention Loss and Process Variation"}, {"paperId": "b2c3f631999857d26a9abc4895ca6a9531d54a8e", "title": "Analysis of DAWNBench, a Time-to-Accuracy Machine Learning Performance Benchmark"}, {"paperId": "08328e40bf7b914b979b2f8ca45c54eaeb32cbf7", "title": "Processing Data Where It Makes Sense in Modern Computing Systems: Enabling In-Memory Computation"}, {"paperId": "b6388aea4fff822b953a3961d2f0cdfc675a44b8", "title": "VRL-DRAM: Improving DRAM Performance via Variable Refresh Latency"}, {"paperId": "76ed7e41fabd91a86f5e5dc58688a58f329d31db", "title": "Recent Advances in DRAM and Flash Memory Architectures"}, {"paperId": "3b23c39f21156f9ea86ad8bb2ca53b2cf56b4181", "title": "Predictable Performance and Fairness Through Accurate Slowdown Estimation in Shared Main Memory Systems"}, {"paperId": "d2177743e33252be186e1fe131389d28fd1dddf9", "title": "Voltron: Understanding and Exploiting the Voltage-Latency-Reliability Trade-Offs in Modern DRAM Chips to Improve Energy Efficiency"}, {"paperId": "12b68cb06efdab086a80c638d21a2927e8d82f59", "title": "SoftMC: Practical DRAM Characterization Using an FPGA-Based Infrastructure"}, {"paperId": "305dea0339faabadcd591a31a6ad31e495f5f7d9", "title": "Flexible-Latency DRAM: Understanding and Exploiting Latency Variation in Modern DRAM Chips"}, {"paperId": "ed43aed792ce705ee7911d94dcabf72d7ce073f1", "title": "Exploiting Row-Level Temporal Locality in DRAM to Reduce the Memory Access Latency"}, {"paperId": "6d3fd6c1f6b59c3f041a3bb416dfeb05f80a697e", "title": "Experimental Characterization, Optimization, and Recovery of Data Retention Errors in MLC NAND Flash Memory"}, {"paperId": "dda7c10868d398a61d113a0671491422b57f9f93", "title": "Characterizing, Exploiting, and Mitigating Vulnerabilities in MLC NAND Flash Memory Programming"}, {"paperId": "84dfc3ef4cbb24cf1a42203b15397d36983c00df", "title": "LISA: Increasing Internal Connectivity in DRAM for Fast Data Movement and Low Latency"}, {"paperId": "01fb05cb6bff252f829ead807251c6329a5f8d0b", "title": "RowClone: Accelerating Data Movement and Initialization Using DRAM"}, {"paperId": "0cc9f0cf9fb45e57cdfea47f84b20474df4b9c61", "title": "Tiered-Latency DRAM: Enabling Low-Latency Main Memory at Low Cost"}, {"paperId": "df63fdb20669a8b7d3ba7dafebf75b9a94d7ba46", "title": "Exploiting the DRAM Microarchitecture to Increase Memory-Level Parallelism"}, {"paperId": "77835f0049433f7f0d1c6c4fb9dbbeebf31b82d0", "title": "Adaptive-Latency DRAM: Reducing DRAM Latency by Exploiting Timing Margins"}, {"paperId": "a0796edf402715d2f0aae5168c1554ab5ebc26f2", "title": "Reducing DRAM Refresh Overheads with Refresh-Access Parallelism"}, {"paperId": "1f1a3f97b43d7fa4c8ea23db36d4148c4285248f", "title": "Holistic Management of the GPGPU Memory Hierarchy to Manage Warp-level Latency Tolerance"}, {"paperId": "4ea33217f6d927f22331bc23eee8daef7038e01c", "title": "High-Performance and Energy-Effcient Memory Scheduler Design for Heterogeneous Systems"}, {"paperId": "b360dd90e9ef6604be0b205686b894514f2998a1", "title": "A Memory Controller with Row Buffer Locality Awareness for Hybrid Memory Systems"}, {"paperId": "d8629e7450f3dadbda1e40621fcec2850fe03fd5", "title": "SPECTR: Formal Supervisory Control and Coordination for Many-core Systems Resource Management"}, {"paperId": "d79366509f04b9188837657d586fbf50b032dd22", "title": "Techniques for Shared Resource Management in Systems with Throughput Processors"}, {"paperId": "342ebf89fb87bd271ae3abc4512129f8db4e258d", "title": "The DRAM Latency PUF: Quickly Evaluating Physical Unclonable Functions by Exploiting the Latency-Reliability Tradeoff in Modern Commodity DRAM Devices"}, {"paperId": "0c4fe1f1a8043e8f4175b21faca1b72bff8033e6", "title": "Enabling the Adoption of Processing-in-Memory: Challenges, Mechanisms, Future Research Directions"}, {"paperId": "bb1a62c0cfc04bf61404d3d3903f1ba0cabf5a02", "title": "Memory-Based Combination PUFs for Device Authentication in Embedded Systems"}, {"paperId": "ade903df1e67fb59069b51a0a8fc227853a4a8dc", "title": "Errors in Flash-Memory-Based Solid-State Drives: Analysis, Mitigation, and Recovery"}, {"paperId": "a5d63bcc1ff5dcd305a556edd3e329d6784b161c", "title": "GRIM-Filter: Fast seed location filtering in DNA read mapping using processing-in-memory technologies"}, {"paperId": "35334a700a26ca41464ede7f27763a51c21e1b46", "title": "Ambit: In-Memory Accelerator for Bulk Bitwise Operations Using Commodity DRAM Technology"}, {"paperId": "4d23b5d9225f86efb56b0241c3a00349a6f51136", "title": "Detecting and Mitigating Data-Dependent DRAM Failures by Exploiting Current Memory Content"}, {"paperId": "b5b6fb0acdae93fa23c7b4bb7d39c159385cd7bb", "title": "Utility-Based Hybrid Memory Management"}, {"paperId": "4828a11ee5221ad6f7d97ae0c8ffec8c62c65fa8", "title": "Concurrent Data Structures for Near-Memory Computing"}, {"paperId": "ea4c3cda2f27cc9428789321363ba46304635b80", "title": "Error Characterization, Mitigation, and Recovery in Flash-Memory-Based Solid-State Drives"}, {"paperId": "3d83961bab2a7293f643c6839f60862de1959336", "title": "Using ECC DRAM to Adaptively Increase Memory Capacity"}, {"paperId": "0baee7d0bf986ddf9445dedb2bfb17ffb0c26c44", "title": "The reach profiler (REAPER): Enabling the mitigation of DRAM retention failures via profiling at aggressive conditions"}, {"paperId": "77f62bda59b101b598846a71256b4941b4d4b163", "title": "Design-Induced Latency Variation in Modern DRAM Chips"}, {"paperId": "57f32185e2db8c373af40dcf643c81267a1a08c9", "title": "Architectural Techniques to Enable Reliable and Scalable Memory Systems"}, {"paperId": "7b52d7339cbb9fd635a9884b5c2736d3fb8f0d62", "title": "Banshee: Bandwidth-Efficient DRAM Caching via Software/Hardware Cooperation"}, {"paperId": "5c478e5c774eb3cf71e446e2c9eb2166ca032b28", "title": "Understanding and Exploiting Design-Induced Latency Variation in Modern DRAM Chips"}, {"paperId": "0f41b9c0900b1c17b63d3d59bd4c334f7cf736af", "title": "Rethinking Memory System Design"}, {"paperId": "0855d63e5f68930cafd99b8e01472f196829d929", "title": "Heterogeneous-Reliability Memory: Exploiting Application-Level Memory Error Tolerance"}, {"paperId": "a3c5f9558a34a2de680038013dc013d2f15df45f", "title": "Vertical Surrounding Gate Transistor for High Density and Low Voltage Operation in DRAM"}, {"paperId": "6eff535aaa0b344bbabd9f8b9928b3c14802e875", "title": "High-Performance and Power-Saving Mechanism for Page Activations Based on Full Independent DRAM Sub-Arrays in Multi-Core Systems"}, {"paperId": "30e469c369af4a4ddc6490d1bd2760c1c70ff57d", "title": "Extending Memory Capacity in Modern Consumer Systems With Emerging Non-Volatile Memory: Experimental Analysis and Characterization Using the Intel Optane SSD"}, {"paperId": "084809bcb66911c8cef94879311beb96d11bc6a6", "title": "Benchmarking a New Paradigm: Experimental Analysis and Characterization of a Real Processing-in-Memory System"}, {"paperId": "d1eb487fb036d05f5710f40d5217eb875a4b70e8", "title": "Sectored DRAM: An Energy-Efficient High-Throughput and Practical Fine-Grained DRAM Architecture"}, {"paperId": "d14b988a6b933884e55ea5247847b7f94eefa17e", "title": "OSM: Off-Chip Shared Memory for GPUs"}, {"paperId": "6f39824a7afda1d7c9bd220f92e9599a0cc399d0", "title": "Adaptive Resource Management for Mobile Multiprocessors through Computational Self-Awareness"}, {"paperId": "9651552657fd78c51a6a8f6ee79168cac774b5be", "title": "ITAP: Idle-Time-Aware Power Management for GPU Execution Units"}, {"paperId": "8e46cf6a16eb1419b808ba3dda39f764508c62fa", "title": "Reliability Issues in Flash-Memory-Based Solid-State Drives: Experimental Analysis, Mitigation, Recovery"}, {"paperId": "5219b25edc5eb64b279fd7e69c49556032e80c22", "title": "Guest Editor"}]}
