{"paperId": "b767fd238ed42aaba317312f9766e242b93e8a24", "publicationVenue": null, "title": "Evolutionary multi-objective customer segmentation approach based on descriptive and predictive behaviour of customers: application to the banking sector", "abstract": "ABSTRACT Customer segmentation is a challenging task in marketing that aims to build homogeneous segments of customers based on their similar characteristics and activities. This problem is considered multi-objective since it requires the evaluation of several variables including descriptive and predictive characteristics of customers. However, given that most exiting segmentation methods are based on the optimisation of a single-objective function, the identification of homogeneous customer segments in terms of both predictive and descriptive variables becomes a major issue. Descriptive and predictive characteristics are usually considered as two different and independent objectives, which cannot be optimised together. To deal with this problem, we propose a multi-objective segmentation approach based on three conceptual axes: descriptive, predictive, and quality-validation. In addition to the specificity of design of the multi-objective model, our proposed approach has the specificity of directly optimising the multi-objective problem using a customised genetic algorithm that directly approximates a set of Pareto-optimal solutions. We have applied and evaluated the proposed approach in an empirical study which aims to segment bank credit card customers using their descriptive characteristics and their predictive behaviour. Obtained results have shown the ability of the proposed approach to look for effective homogeneous segments and help decision-makers propose more tailored marketing strategies.", "venue": "Journal of experimental and theoretical artificial intelligence (Print)", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-11-17", "journal": {"name": "Journal of Experimental & Theoretical Artificial Intelligence", "pages": "1201 - 1223", "volume": "35"}, "authors": [{"authorId": "2058187038", "name": "Chiheb-Eddine Ben Ncir"}, {"authorId": "103158547", "name": "Mohamed Ben Mzoughia"}, {"authorId": "2307645", "name": "A. Qaffas"}, {"authorId": "2492324", "name": "Bouaguel Waad"}], "citations": [{"paperId": "a67dca5001a82ba761826beb69b7a1b6c3a349e6", "title": "Relative importance of neuromarketing in support of banking service users"}]}
