{"paperId": "b773b4327973ec8f9a02e1cf337e6cb7402d5ba6", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Assessing the Big Data Adoption Readiness Role in Healthcare between Technology Impact Factors and Intention to Adopt Big Data", "abstract": "Big data is quickly becoming a new area where administrative work can be improved. Even so, it is still in the early stages of being used in hospitals in countries with less technology. Therefore, there is an inadequate grasp of the evaluation of big data adoption preparedness in the healthcare sector as data-point-determined insights become crucially useful in healthcare institutions in underdeveloped nations. This process, called “digital transformation,” has a lot of benefits; for example, it helps healthcare organizations to create more efficient processes, offer different services, give better care, make more money, and cut costs. This paper aims to suggest and assess a conceptual framework that focuses on technological factors and can assist in determining the readiness of healthcare institutions in developing nations to utilize big data. Although the study can offer valuable perspectives on the advantages that can arise from adopting big data in the healthcare sector, it is important to highlight that leveraging big data analytics in healthcare has the potential to enhance the efficiency and effectiveness of healthcare services. This, in turn, can indirectly contribute to sustainability objectives by optimizing the allocation of resources, minimizing waste, and improving patient outcomes. A total of 328 healthcare workers from Malaysia were subjected to experimental testing of the model. The collected data were evaluated using the Smart PLS 3 program and the structural equation model (SEM). The study’s findings supported our hypotheses. The results showed that technological factors affected the participants’ perception of their readiness for big data, which ultimately influenced their interest in utilizing it. By concentrating on big data preparedness in the healthcare industry and ambition to utilize big data, this research provides an important theoretical contribution. Employees who are “big data ready” would benefit from the study’s results, as, through their recognition, said employees are more likely to increase the desire to use big data in Malaysia’s healthcare sectors.", "venue": "Sustainability", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-07-25", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "2047259780", "name": "E. A. Ghaleb"}, {"authorId": "144999002", "name": "P. Dominic"}, {"authorId": "48767456", "name": "N. Singh"}, {"authorId": "2006676932", "name": "G. Naji"}], "citations": [{"paperId": "26b51f19699ae3346a8429f7e0614cc1c3cf15ae", "title": "An Assessment of Big Data Analysis Technologies for Improved Information Delivery"}, {"paperId": "6615b74a2b95d0be0e9d5e75ff0bf865bafb99d4", "title": "Empowering Travelers with Airfare Comparison, Flight Tracking, and Real-Time Weather Forecasts on Android"}, {"paperId": "f2202ed2fb60e92840d7bbd703bd19f103f64a42", "title": "Assessing the Impact of Green Training on Sustainable Business Advantage: Exploring the Mediating Role of Green Supply Chain Practices"}, {"paperId": "f65b1099944af8f27ddfaf4922e09fd86c4bf7ea", "title": "Hotel room access control: an NFC approach ecotourism framework"}]}
