{"paperId": "b7aecb12fe3b0e6481183f76f0bea99e2ab5ea8a", "publicationVenue": {"id": "ea9bedc9-5db1-4a0c-b5e4-b35558e7de24", "name": "Chemosensors", "issn": "2227-9040", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-302961", "alternate_urls": ["https://www.mdpi.com/journal/chemosensors", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-302961"]}, "title": "Early Detection of Prostate Cancer: The Role of Scent", "abstract": "Prostate cancer (PCa) represents the cause of the second highest number of cancer-related deaths worldwide, and its clinical presentation can range from slow-growing to rapidly spreading metastatic disease. As the characteristics of most cases of PCa remains incompletely understood, it is crucial to identify new biomarkers that can aid in early detection. Despite the prostate-specific antigen serum (PSA) levels, prostate biopsy, and imaging representing the actual gold-standard for diagnosing PCa, analyzing volatile organic compounds (VOCs) has emerged as a promising new frontier. We and other authors have reported that highly trained dogs can recognize specific VOCs associated with PCa with high accuracy. However, using dogs in clinical practice has several limitations. To exploit the potential of VOCs, an electronic nose (eNose) that mimics the dog olfactory system and can potentially be used in clinical practice was designed. To explore the eNose as an alternative to dogs in diagnosing PCa, we conducted a systematic literature review and meta-analysis of available studies. PRISMA guidelines were used for the identification, screening, eligibility, and selection process. We included six studies that employed trained dogs and found that the pooled diagnostic sensitivity was 0.87 (95% CI 0.86–0.89; I2, 98.6%), the diagnostic specificity was 0.83 (95% CI 0.80–0.85; I2, 98.1%), and the area under the summary receiver operating characteristic curve (sROC) was 0.64 (standard error, 0.25). We also analyzed five studies that used an eNose to diagnose PCa and found that the pooled diagnostic sensitivity was 0.84 (95% CI, 0.80–0.88; I2, 57.1%), the diagnostic specificity was 0.88 (95% CI, 0.84–0.91; I2, 66%), and the area under the sROC was 0.93 (standard error, 0.03). These pooled results suggest that while highly trained dogs have the potentiality to diagnose PCa, the ability is primarily related to olfactory physiology and training methodology. The adoption of advanced analytical techniques, such as eNose, poses a significant challenge in the field of clinical practice due to their growing effectiveness. Nevertheless, the presence of limitations and the requirement for meticulous study design continue to present challenges when employing eNoses for the diagnosis of PCa.", "venue": "Chemosensors", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-06-25", "journal": {"name": "Chemosensors"}, "authors": [{"authorId": "5788147", "name": "F. Grizzi"}, {"authorId": "40361437", "name": "C. Bax"}, {"authorId": "65862218", "name": "Mohamed A. A. A. Hegazi"}, {"authorId": "1389969979", "name": "B. J. Lotesoriere"}, {"authorId": "39933556", "name": "M. Zanoni"}, {"authorId": "1836336656", "name": "P. Vota"}, {"authorId": "4873712", "name": "R. Hurle"}, {"authorId": "51474898", "name": "N. Buffi"}, {"authorId": "4483764", "name": "M. Lazzeri"}, {"authorId": "6665670", "name": "L. Tidu"}, {"authorId": "35120682", "name": "L. Capelli"}, {"authorId": "4862136", "name": "G. Taverna"}], "citations": [{"paperId": "8e43628e1ec348d4fcd7b9cc1ee7c9d2fda2857e", "title": "Prostate cancer risk stratification via eNose urine odor analysis: a preliminary report"}, {"paperId": "6f5dfb0eb60836df582bdf79161910b3f26026a4", "title": "Editorial: Reshaping the diagnostic process in oncology: science versus technology"}]}
