{"paperId": "b7b225d85ec06e617b23aeb59f20c85baabcd967", "publicationVenue": {"id": "2756e173-d599-4a50-8d52-df1b9492f924", "name": "Digital Signal Processing and Signal Processing Education Workshop", "type": "conference", "alternate_names": ["International Conference on Artificial Intelligence in Information and Communication", "ICAIIC", "Digit Signal Process Signal Process Educ Workshop", "Int Conf Artif Intell Inf Commun"]}, "title": "Graph-Powered Reinforcement Learning for Intelligent Task Offloading in Vehicular Networks", "abstract": "In vehicular edge computing, task offloading optimization is crucial for balancing computational demands with minimizing delays and costs. However, the dynamic nature of the vehicular environment, including vehicle mobility, network topology, and available computing resources, poses significant challenges. This paper presents a task offloading scheme that enables vehicles to dynamically decide between local task execution and offloading to nearby vehicles, edge servers, or the cloud. Our objective is to optimize task offloading by minimizing cost and delay. We integrate graph convolutional networks with deep reinforcement learning to optimize task offloading decisions and achieve our goal. The Graph Convolutional Network is integrated with Deep Reinforcement Learning to enhance network representation and decision efficiency of agent. The optimization problem is formally formulated within the framework of a Markov Decision Process. Simulation results demonstrate the superiority of proposed scheme, which achieves cost-efficiency by maximizing resource utilization, minimizing costs, and optimizing task offloading while reducing task rejection.", "venue": "Digital Signal Processing and Signal Processing Education Workshop", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2024-02-19", "journal": {"name": "2024 International Conference on Artificial Intelligence in Information and Communication (ICAIIC)", "pages": "337-342"}, "authors": [{"authorId": "2144373633", "name": "Ihsan Ullah"}, {"authorId": "144381932", "name": "Hyun-kyo Lim"}, {"authorId": "2192208213", "name": "Yeong-Jun Seok"}, {"authorId": "2294724966", "name": "Naeem Ul Islam"}, {"authorId": "2212613905", "name": "Chang-Hun Ji"}, {"authorId": "2152772803", "name": "Youn-Hee Han"}], "citations": []}
