{"paperId": "b7b544b622a5f5746b50a405864ad516b5aeba7b", "publicationVenue": null, "title": "The Vision of a HeterogeneRous Scheduler", "abstract": "Modern Big Data processing systems, scheduling platforms and cloud infrastructures employ specialized hardware accelerators such as GPUs, FPGAs, TPUs, ASICs, etc. to optimize the execution of resource intensive workloads such as Machine Learning, Artificial Intelligence or generic Data Analytics tasks. Nevertheless, this support is mostly a user-dependent, manual process that requires careful and educated decisions on both the amount and type of required resources to exploit the underlying hardware and achieve any user-defined higher level policies. In this work we present the initial design of the HeterogeneRous Scheduler (HRS), an intelligent scheduler that can make automated decisions on both how and where to map arbitrary data analytics tasks to underlying cloud hardware that may consist of a mix of hardware accelerators and clusters with general purpose CPUs. We experimentally evaluate the performance trade-offs between hardware accelerators and CPUs where we show that there are cases where one technology outperforms the other. We finally present an initial architecture of HRS where we depict its different components and their interactions with the Big Data framework and the cloud infrastructure.", "venue": "2018 IEEE International Conference on Cloud Computing Technology and Science (CloudCom)", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2018-12-01", "journal": {"name": "2018 IEEE International Conference on Cloud Computing Technology and Science (CloudCom)", "pages": "302-307"}, "authors": [{"authorId": "2677459", "name": "Ioannis Mytilinis"}, {"authorId": "67078377", "name": "C. Bitsakos"}, {"authorId": "1844396", "name": "Katerina Doka"}, {"authorId": "1505709769", "name": "I. Konstantinou"}, {"authorId": "1774783", "name": "N. Koziris"}], "citations": [{"paperId": "2b2821e63ab489ebbc2f311aef017effc52f1df3", "title": "A Big Data Software Paradigm for Heterogeneous Cloud Deployments"}]}
