{"paperId": "b7c24aae62d545946efb55e8fe1c9fdb4f594191", "publicationVenue": {"id": "1ee52b4c-8c57-4d60-aead-d9ef4255f1e9", "name": "IEEE Transactions on Automation Science and Engineering", "type": "journal", "alternate_names": ["IEEE Trans Autom Sci Eng"], "issn": "1545-5955", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=8856"}, "title": "Dynamic Scheduling Stochastic Multiworkflows With Deadline Constraints in Clouds", "abstract": "Nowadays, more and more workflows with different computing requirements are migrated to clouds and executed with cloud resources. In this work, we study the problem of stochastic multi-workflows scheduling in clouds and formalize this problem as an optimization problem that is NP-hard. To solve this problem, an efficient stochastic multi-workflows dynamic scheduling algorithm called SMWDSA is designed to schedule multi-workflows with deadline constraints for optimizing multi-workflows scheduling cost. The proposed SMWDSA consists of three stages including multi-workflows preprocessing, multi-workflow scheduling and scheduling feedback. In SMWDSA, a novel task sub-deadlines assignment stretagy is design to assign the task sub-deadlines to each task of multi-workflows for meeting workflow deadline constraints. Then, we propose a task scheduling method based on the minimal time slot availability to execution task for minimizing workflow scheduling cost while meetingt workflow deadlines. Finally, a scheduling feedback strategy is adopted to update the priorities and sub-deadlines of unscheduled tasks, for further minimizing workflow scheduling cost. We conduct the experiments using both synthetic data and real-world data to evaluate SMWDSA. The results demonstrate the superiority of SMWDSA as compared with the state-of-the-art algorithms. Note to Practitioners—Workflow scheduling in clouds is significantly challenging due to not only the large scale of workflows but also the elasticity and heterogeneity of cloud resources. Moreover, minimizing workflow scheduling cost and satisfying workflow deadlines are two critical issues in scheduling with cloud resources, especially the uncertainty of workflow arrive time and task execution time are considered. To meet workflow deadlines, it is an effective strategy to decompose workflow deadline constraints into task sub-deadline constraints. To minimize the workflow scheduling cost, each task in a workflow needs to be assigned to their most suitable VMs for execution. This article presents a novel workflow scheduling algorithm to schedule stochastic multi-workflows in clouds for optimizing multi-workflows scheduling cost and meeting workflows deadlines. This algorithm obtains the task sub-deadline constraints based on the characteristics of workflows for meeting the worklfow deadline constraint. Under the premise of meeting task deadlines, it schedules tasks to a VM with minimum the slot time, for minimizing the cost. Case studies based on well-known real-world workflows data sets suggest that it outperforms traditional ones in terms of success and cost of multi-workflows scheduling. It can thus aid the design and optimization of multi-workflows scheduling in a cloud environment. It can help practitioners better manage the scheduling cost and performance of real-world applications built upon cloud services.", "venue": "IEEE Transactions on Automation Science and Engineering", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-10-01", "journal": {"name": "IEEE Transactions on Automation Science and Engineering", "pages": "2594-2606", "volume": "20"}, "authors": [{"authorId": "2111919700", "name": "Lingjuan Ye"}, {"authorId": "2152311358", "name": "Yuanqing Xia"}, {"authorId": "2129716517", "name": "Liwen Yang"}, {"authorId": "3311244", "name": "Yufeng Zhan"}], "citations": [{"paperId": "dd093e8f7ee820a56cc8bf5a73b549903121c94d", "title": "A Min-Max Workload Scheduling Technique Using Soft-Computing Approach in Multi-Cloud Platform"}, {"paperId": "87482bf8500518fed52600186f44a67d22558bd3", "title": "A review on workflow scheduling and resource allocation algorithms in distributed mobile clouds"}]}
