{"paperId": "b7f4e175141f84a8a880ae34750ceb80c582bc41", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Embedded Intelligence: State-of-the-Art and Research Challenges", "abstract": "Recent years have seen deployments of increasingly complex artificial intelligent (AI) and machine learning techniques being implemented on cloud server architectures and embedded into edge computing devices for supporting Internet of Things (IoT) and mobile applications. It is important to note that these embedded intelligence (EI) deployments on edge devices and cloud servers have significant differences in terms of objectives, models, platforms and research challenges. This paper presents a comprehensive survey on EI from four aspects: (1) First, the state-of-the-art for EI using a set of evaluation criteria is proposed and reviewed; (2) Second, EI for both cloud server accelerators and low-complexity edge devices are discussed; (3) Third, the various techniques for EI are categorized and discussed from the system, algorithm, architecture and technology levels; and (4) The paper concludes with the lessons learned and the future prospects are discussed in terms of the key role EI is likely to play in emerging technologies and applications such as Industry 4.0. This paper aims to give useful insights and future prospects for the developments in this area of study and highlight the challenges for practical deployments.", "venue": "IEEE Access", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "1-1", "volume": "PP"}, "authors": [{"authorId": "9273662", "name": "K. Seng"}, {"authorId": "121252403", "name": "L. Ang"}], "citations": [{"paperId": "911d53bc45ce34c2d9e543dbc30ced3f380de064", "title": "Parallel Implementation of Lightweight Secure Hash Algorithm on CPU and GPU Environments"}, {"paperId": "555fbb9a691d7ade79eb339a32b9cb41946fa039", "title": "Implementation of a perception system for autonomous vehicles using a detection-segmentation network in SoC FPGA"}, {"paperId": "0417d6edaa2edd6a3b31dcbc6e8347016c472d25", "title": "Security Applications of Edge Intelligence"}, {"paperId": "9501e99de29bd3bc6db35cffaf3af6063da73ae3", "title": "Artificial neural network-based DTC of an induction machine with experimental implementation on FPGA"}, {"paperId": "8988bfcaa3b0af622331b3d6a98b959b8e3ebed0", "title": "Disclosing Edge Intelligence: A Systematic Meta-Survey"}, {"paperId": "992a16bc48f9eb8d27ace0240be6a8338c6d7cbd", "title": "Identity of AI"}]}
