{"paperId": "b802cd1d49558201cfb99265ca5c4b0b94375c48", "publicationVenue": null, "title": "Comparative analysis of soft computing approaches of zero-day-attack detection", "abstract": "The Internet of Things (IoT) is growing in fashion with the concept of connecting everything and connecting everything leads to the security issues and affect the performance. An intrusion detection system (IDS) is a system that scans the network traffic and gives notifications in case of any doubtful activity. To circumvent the challenges in the detection of zero-day-multi-class cyber-attack considering the resource constraint nature of IoT devices, a robust intelligent technique is required to identify zero-day vulnerabilities to create early detection and create patches. A novel framework is proposed that will give flexible, adaptive, cost-effective, scalable, and promising solutions. In this Paper comparative study of proposed solutions were discussed and evaluation of existing system specify that federated learning increases the performance in identification of zero-day-attack.", "venue": "2022 International Conference on Emerging Trends in Smart Technologies (ICETST)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-09-23", "journal": {"name": "2022 International Conference on Emerging Trends in Smart Technologies (ICETST)", "pages": "1-5"}, "authors": [{"authorId": "1665536510", "name": "Misbah Anwer"}, {"authorId": "49095450", "name": "Ghufran Ahmed"}, {"authorId": "2902894", "name": "Adnan Akhunzada"}, {"authorId": "2188554694", "name": "Shahid Hussain"}, {"authorId": "2188523079", "name": "Mubashir Khan"}], "citations": [{"paperId": "d6213c22f183079db55d89b8b91872ae758619ea", "title": "Zero-day attacks: review of the methods used based on intrusion detection and prevention systems"}, {"paperId": "8b7c9e0f5a54810e0819bc5b49c5a71852048b61", "title": "ShNP: Shielding Nuclear Plants from Cyber Attacks Using Artificial Intelligence Techniques"}, {"paperId": "5751aacfa31867c2d2721df721aef62a08f9dc8e", "title": "Few-Shot Network Intrusion Detection Based on Model-Agnostic Meta-Learning with L2F Method"}]}
