{"paperId": "b80a7663585123abc53c10f8aac9bd234eedf063", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "DialogBench: Evaluating LLMs as Human-like Dialogue Systems", "abstract": "Large language models (LLMs) have achieved remarkable breakthroughs in new dialogue capabilities by leveraging instruction tuning, which refreshes human impressions of dialogue systems. The long-standing goal of dialogue systems is to be human-like enough to establish long-term connections with users. Therefore, there has been an urgent need to evaluate LLMs as human-like dialogue systems. In this paper, we propose DialogBench, a dialogue evaluation benchmark that contains 12 dialogue tasks to probe the capabilities of LLMs as human-like dialogue systems should have. Specifically, we prompt GPT-4 to generate evaluation instances for each task. We first design the basic prompt based on widely used design principles and further mitigate the existing biases to generate higher-quality evaluation instances. Our extensive tests on English and Chinese DialogBench of 26 LLMs show that instruction tuning improves the human likeness of LLMs to a certain extent, but most LLMs still have much room for improvement as human-like dialogue systems. Interestingly, results also show that the positioning of assistant AI can make instruction tuning weaken the human emotional perception of LLMs and their mastery of information about human daily life.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-11-03", "journal": {"name": "ArXiv", "volume": "abs/2311.01677"}, "authors": [{"authorId": "2265383868", "name": "Jiao Ou"}, {"authorId": "2265386838", "name": "Junda Lu"}, {"authorId": "2257133304", "name": "Che Liu"}, {"authorId": "2152987610", "name": "Yihong Tang"}, {"authorId": "2257136363", "name": "Fuzheng Zhang"}, {"authorId": "2257381268", "name": "Di Zhang"}, {"authorId": "2257052464", "name": "Zhongyuan Wang"}, {"authorId": "2238953242", "name": "Kun Gai"}], "citations": [{"paperId": "2bff22264c1cbb5e0edc98100492531653ec299c", "title": "Enhancing Role-playing Systems through Aggressive Queries: Evaluation and Improvement"}]}
