{"paperId": "b80dd0d96eb0ba7d5223a69da529d7bd8505b187", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Software-Defined MANET Swarm for Mobile Monitoring in Hydropower Plants", "abstract": "The construction and running of hydropower plants does not merely involve hydropower generation itself but also facilities surveillance, water quality monitoring, harmful creatures tracking, etc., thus requiring mobile and collaborative monitoring capabilities. MANET (Mobile Ad Hoc Networks), with its mobility, flexibility, and robustness in volatile networking environment, is a competitive candidate to fulfill such tasks. Nevertheless its distributed structure prevents the effective collaboration between MANET nodes. SDN (Software-Defined Networking) provides the centralized control over the network underlay. This paper proposes the SDN-controlled IEEE 802.11 MANET swarm for mobile monitoring in hydropower plants. First, the MANET node is implemented by integrating Raspberry Pi with cameras, various sensors, etc., into the low-cost wheeled mobile hardware to enable sensibility and mobility. Then, multiple such MANET nodes are networked through ad hoc protocols, to construct a flexible and distributed MANET underlay; meanwhile, to implement centralized control over the MANET underlay, every MANET node is equipped with OpenFlow switch software (e.g., Open vSwitch) so that OpenFlow directives issued by the SDN controller can be understood and executed, hence the SDN overlay on top of the MANET underlay. Finally, OpenFlow is extended to offer physical actions such as mobility and sensibility manipulation, beyond pure data forwarding in traditional SDN applications, to achieve mobile monitoring in hydropower plants. The SDN-controlled MANET swarm features mobile and sensing capabilities, flexible networking through ad hoc protocols, and efficient and unified control by SDN. Experiment results prove the feasibility of this network architecture.", "venue": "IEEE Access", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-10-18", "journal": {"name": "IEEE Access", "pages": "152243-152257", "volume": "7"}, "authors": [{"authorId": "2145307591", "name": "Xi Chen"}, {"authorId": "2112377352", "name": "Tao Wu"}, {"authorId": "143847421", "name": "Gang Sun"}, {"authorId": "49514984", "name": "Hongfang Yu"}], "citations": [{"paperId": "52b434167617ff8f1b90bd6a014ea37b5ef72f1f", "title": "Node Mobility and Encounter Rate Metrics to Enhance Stability in MANET"}, {"paperId": "022f81ad2bf570ade38048e042b04ed1ff47f0a6", "title": "On the Implementation of a Cross-Layer SDN Architecture for 802.11 MANETs"}, {"paperId": "8b17b82e37f65a589726e28d705b224c2d5cda58", "title": "RANCE: A Randomly Centralized and On-Demand Clustering Protocol for Mobile Ad Hoc Networks"}, {"paperId": "86f8025226ce95cf144d8abf13c7d2b471175625", "title": "Hydropower technology as a renewable energy source of power generation and its effect on environment sustainability"}, {"paperId": "534cf055beb2efa3c6cd76d4b0daed390c4267c8", "title": "Execution of Multitarget Node Selection Scheme for Target Position Alteration Monitoring in MANET"}, {"paperId": "b88b884566f0fb5fbc47253839c46d182c05afe9", "title": "Software-Defined Networking in wireless ad hoc scenarios: Objectives and control architectures"}, {"paperId": "8f6b80236856a7c68d25e1b00f95a8c7ed363f2b", "title": "QoS-aware Routing Optimization Algorithm using Differential Search in SDN-based MANETs"}, {"paperId": "02d4286e694d05bd0362b2c74d6699ac758aaa6a", "title": "Ant Colony Based Node Disjoint Local Repair in Multipath Routing in MANET Network"}, {"paperId": "506751a40f85e2bad7c1e92d83f3007b7db137f8", "title": "Route manipulation aware Software-Defined Networks for effective routing in SDN controlled MANET by Disney Routing Protocol"}, {"paperId": "b97cbbf69e655ff73e7f536f9eb0db0b51ee91a7", "title": "Securing Dynamic Source Routing by Neighborhood Monitoring in Wireless Adhoc Network"}, {"paperId": "4a1719ebe0dfd5823111a29d5232580ac71104fb", "title": "Game Theory Analysis and Modeling of Sophisticated Multi-Collusion Attack in MANETs"}]}
