{"paperId": "b81f1db5dafc344b2d491fce3472e1c1fea15373", "publicationVenue": {"id": "621ec958-6aa9-44cf-8c1b-ceb4e6932bfd", "name": "Webology", "issn": "1735-188X", "url": "http://www.webology.itgo.com/", "alternate_urls": ["https://www.webology.org/", "http://www.webology.ir/", "http://www.webology.ir/index.html"]}, "title": "Analysis of End to End Internet Traffic in Education's Networks: A New Study", "abstract": "Network Traffic Monitoring and Analysis (NTMA) is the main element to network management, especially to correctly operate large-scale networks such as the Internet on which modern academic organizations heavily depend. Their traffic use increases significantly because students, staff members, and research labs use them to search information. It is necessary to analyze, measure, and classify this Internet traffic according to the need of different stakeholders such as Internet Service Providers and network administrators. Moreover, bandwidth congestions frequently occur, causing user dissatisfaction. This study tries to find different characterizations such as data over hosts, countries, cities, companies, top-level domains, and servers. In addition, this is a new study to find out different patterns and levels of analysis from the device to its international requests. Our findings show that the highest traffic use is on Mondays and Wednesdays. Web server and DNS server drop in response to fault tolerance. Social networks consume most of the bandwidth, such as 42% Facebook followed by 22% WhatsApp in peak hours. The second most accessed sites are search engines. Google is the most used one. About 59% of the host cities are outside Iraq, in particular USA and the UK. In Amara and Baghdad cities, the requested sites are 51% and 49% overseas. About 40% of the traffic is provided by EarthLink Ltd. Communication Internet services (Iraq), 14% EdgeCast. 12% level3, 9% Facebook, 7% Google, Akamai-as and Microsoft-corp-msn-as-block. This study gives guidelines for network administrators to improve their performance and bandwidth at the educational networks.", "venue": "Webology", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-01-20", "journal": {"name": "Webology"}, "authors": [{"authorId": "20485912", "name": "Wisam Dawood Abdullah"}, {"authorId": "2151562980", "name": "Ali Ali"}, {"authorId": "1729331462", "name": "L. Hazim"}], "citations": []}
