{"paperId": "b825e463655ecee7a895fad05f054dd966814caf", "publicationVenue": {"id": "a0edb93b-1e95-4128-a295-6b1659149cef", "name": "Knowledge Discovery and Data Mining", "type": "conference", "alternate_names": ["KDD", "Knowl Discov Data Min"], "url": "http://www.acm.org/sigkdd/"}, "title": "Device-cloud Collaborative Recommendation via Meta Controller", "abstract": "On-device machine learning enables the lightweight deployment of recommendation models in local clients, which reduces the burden of the cloud-based recommenders and simultaneously incorporates more real-time user features. Nevertheless, the cloud-based recommendation in the industry is still very important considering its powerful model capacity and the efficient candidate generation from the billion-scale item pool. Previous attempts to integrate the merits of both paradigms mainly resort to a sequential mechanism, which builds the on-device recommender on top of the cloud-based recommendation. However, such a design is inflexible when user interests dramatically change: the on-device model is stuck by the limited item cache while the cloud-based recommendation based on the large item pool do not respond without the new re-fresh feedback. To overcome this issue, we propose a meta controller to dynamically manage the collaboration between the on-device recommender and the cloud-based recommender, and introduce a novel efficient sample construction from the causal perspective to solve the dataset absence issue of meta controller. On the basis of the counterfactual samples and the extended training, extensive experiments in the industrial recommendation scenarios show the promise of meta controller in the device-cloud collaboration.", "venue": "Knowledge Discovery and Data Mining", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2022-07-07", "journal": {"name": "Proceedings of the 28th ACM SIGKDD Conference on Knowledge Discovery and Data Mining"}, "authors": [{"authorId": "2110069725", "name": "Jiangchao Yao"}, {"authorId": "2145756591", "name": "Feng Wang"}, {"authorId": "31639147", "name": "Xichen Ding"}, {"authorId": "2175298167", "name": "Shaohu Chen"}, {"authorId": "2116920367", "name": "Bo Han"}, {"authorId": "1709595", "name": "Jingren Zhou"}, {"authorId": "38385080", "name": "Hongxia Yang"}], "citations": [{"paperId": "a67f923f0ae0a3e5603608ad74ed94eebb5c42b1", "title": "Beyond the Content: Considering the Network for Online Video Recommendation"}, {"paperId": "2cc9813bf120895de8f8ae67f839da4ca3020ed3", "title": "Server-Client Collaborative Distillation for Federated Reinforcement Learning"}, {"paperId": "168e785ea1d721e6f32728498ec45deffd5c7f81", "title": "Personalized Elastic Embedding Learning for On-Device Recommendation"}, {"paperId": "6fe07722b4df42aac787fe93f6dd846afae9f37c", "title": "Edge-cloud Collaborative Learning with Federated and Centralized Features"}, {"paperId": "301b07ecba0864c5bad4039d6a0bc93687417443", "title": "A survey on causal inference for recommendation"}, {"paperId": "e2d606dc40aee95631f23f9a1cd2fab717f143d1", "title": "IDEAL: Toward High-efficiency Device-Cloud Collaborative and Dynamic Recommendation System"}, {"paperId": "34c82d8335459c887c860ab23a53ab585cf8e9ed", "title": "FedSkip: Combatting Statistical Heterogeneity with Federated Skip Aggregation"}, {"paperId": "d20773683ddbb5c516131bdfdf674a772714de50", "title": "A Comprehensive Survey on Trustworthy Recommender Systems"}, {"paperId": "af11f2f2fc5b9a8d3b8d03aedd2007af7731882c", "title": "DUET: A Tuning-Free Device-Cloud Collaborative Parameters Generation Framework for Efficient Device Model Generalization"}, {"paperId": "9d807a68c9e1c6455a1d1594c2e837a25e9532cc", "title": "MetaNetwork: A Task-agnostic Network Parameters Generation Framework for Improving Device Model Generalization"}]}
