{"paperId": "b82821632767c2f23c30dee3667ce4b2fe7a638c", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "A Scalable Data Science Platform for Healthcare and Precision Medicine Research", "abstract": "Objective: To (1) demonstrate the implementation of a data science platform built on open-source technology within a large, academic healthcare system and (2) describe two computational healthcare applications built on such a platform. Materials and Methods: A data science platform based on several open source technologies was deployed to support real-time, big data workloads. Data acquisition workflows for Apache Storm and NiFi were developed in Java and Python to capture patient monitoring and laboratory data for downstream analytics. Results: The use of emerging data management approaches along with open-source technologies such as Hadoop can be used to create integrated data lakes to store large, real-time data sets. This infrastructure also provides a robust analytics platform where healthcare and biomedical research data can be analyzed in near real-time for precision medicine and computational healthcare use cases. Discussion: The implementation and use of integrated data science platforms offer organizations the opportunity to combine traditional data sets, including data from the electronic health record, with emerging big data sources, such as continuous patient monitoring and real-time laboratory results. These platforms can enable cost-effective and scalable analytics for the information that will be key to the delivery of precision medicine initiatives. Conclusion: Organizations that can take advantage of the technical advances found in data science platforms will have the opportunity to provide comprehensive access to healthcare data for computational healthcare and precision medicine research.", "venue": "arXiv.org", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-08-14", "journal": {"name": "ArXiv", "volume": "abs/1808.04849"}, "authors": [{"authorId": "51208883", "name": "J. McPadden"}, {"authorId": "48946116", "name": "T. Durant"}, {"authorId": "5328311", "name": "Dustin R. Bunch"}, {"authorId": "38385690", "name": "A. Coppi"}, {"authorId": "1411393005", "name": "Nathan Price"}, {"authorId": "15671883", "name": "Kris Rodgerson"}, {"authorId": "51219288", "name": "C. Torre"}, {"authorId": "1412757151", "name": "William Byron"}, {"authorId": "145701467", "name": "H. P. Young"}, {"authorId": "2474559", "name": "A. Hsiao"}, {"authorId": "2467795", "name": "H. Krumholz"}, {"authorId": "14677344", "name": "W. Schulz"}], "citations": [{"paperId": "704069cced5415d524c1ea5385eff83d88658170", "title": "A Case Study of Enhancing the Data Science Capacity of an RCMI Program at a Historically Black Medical College"}, {"paperId": "ab17f8c278caefa82da7f5a9939544830819013d", "title": "Policy Preferences Regarding Health Data Sharing Among Patients With Cancer: Public Deliberations"}, {"paperId": "a1d490ad8f2bb86d723a0e6ce68556c6b8e8b1a5", "title": "Association between primary or booster COVID-19 mRNA vaccination and Omicron lineage BA.1 SARS-CoV-2 infection in people with a prior SARS-CoV-2 infection: A test-negative case–control analysis"}, {"paperId": "4193cb96f6e068389183b57373eb5b97aea9b83a", "title": "Data Engineering to Support Intelligence for Precision Medicine in Intensive Care"}, {"paperId": "b491d420eebdc8367cb0d8ab42a5652586dea375", "title": "Data Science to Enhance Research Capacity of a Research-Intensive Medical College"}, {"paperId": "c037658e4d5a53a0a4e47596769f1ca8686130b2", "title": "Lifting Hospital Electronic Health Record Data Treasures: Challenges and Opportunities"}, {"paperId": "52928639c95f090d4f4eacfc58f639d4987ffa66", "title": "A Formal Framework for Data Lakes Based on Category Theory"}, {"paperId": "2a40c878200647f1b8f77bd3918754dd6e2d9cc7", "title": "Medication Guideline Adherence Among Patients with Markedly Elevated Blood Pressure in A Real-World Setting"}, {"paperId": "be8d96d3b4f4ac7687ba9317024626d93de6d7ed", "title": "Big Data Analytics Strategy Framework: A Case of Crowd Management During the Hajj Pilgrimage, Mecca, Saudi Arabia"}, {"paperId": "772e41111a1d99f1c1dbd4fb340b863ff4412348", "title": "Applications of Digital Microscopy and Densely Connected Convolutional Neural Networks for Automated Quantitation of Babesia-Infected Erythrocytes"}, {"paperId": "b4e5bf0f048c1cc6e41d63894ec5eb040fcb9db0", "title": "Clinical characteristics and outcomes for 7,995 patients with SARS-CoV-2 infection"}, {"paperId": "6310548a6457b145f88ea9bf99b3d69ea399acab", "title": "Effect of Age on the Initiation of Biologic Agent Therapy in Patients With Inflammatory Bowel Disease: Korean Common Data Model Cohort Study"}, {"paperId": "9fa99d12fcdfb11616ca5b29fd5be1909894d9d3", "title": "Temporal relationship of computed and structured diagnoses in electronic health record data"}, {"paperId": "52d55314122351f740782d5945daa18653614a05", "title": "Tapping Into Underutilized Healthcare Data in Clinical Research."}, {"paperId": "770ce6649743d185b01565dd6857d0feabe20c23", "title": "Real-World Integration of a Sepsis Deep Learning Technology Into Routine Clinical Care: Implementation Study (Preprint)"}, {"paperId": "b6723c89911874c1ab67f8fa6224e3e3236ccb25", "title": "cohorts: A Python package for clinical ‘omics data management"}, {"paperId": "5ca2b6e43c7dd8a1b50a58882299b9f6b6412808", "title": "A monthly roundup of key articles in other journals"}, {"paperId": "15feca5ee353a2196689fc69fe494c1f3f83604a", "title": "Intellectual Structure and Evolutionary Trends of Precision Medicine Research: Coword Analysis"}, {"paperId": "3464ff90fdb31ae51a1755df2cbc34ed9f2c7bb8", "title": "A Scalable Data Science Platform built on Open Source Technologies with Application of Predictive Analytics on Acute Respiratory Distress Syndrome disease"}, {"paperId": "6c91068ee40394b4ae0da51a772b6782b5817e2f", "title": "Data Science Platform for Smart Diagnosis of Upper Limb Spasticity"}, {"paperId": "746857a3ef8a2516bffd1129421fc33b605b1293", "title": "Emerging Trends, Techniques and Open Issues of Containerization: A Review"}]}
