{"paperId": "b82c1b0512d25307e3c81bb8d9df1607267a7a52", "publicationVenue": {"id": "41bf9ed3-85b3-4c90-b015-150e31690253", "name": "Conference on Empirical Methods in Natural Language Processing", "type": "conference", "alternate_names": ["Empir Method Nat Lang Process", "Empirical Methods in Natural Language Processing", "Conf Empir Method Nat Lang Process", "EMNLP"], "url": "https://www.aclweb.org/portal/emnlp"}, "title": "MemeCap: A Dataset for Captioning and Interpreting Memes", "abstract": "Memes are a widely popular tool for web users to express their thoughts using visual metaphors. Understanding memes requires recognizing and interpreting visual metaphors with respect to the text inside or around the meme, often while employing background knowledge and reasoning abilities. We present the task of meme captioning and release a new dataset, MemeCap. Our dataset contains 6.3K memes along with the title of the post containing the meme, the meme captions, the literal image caption, and the visual metaphors. Despite the recent success of vision and language (VL) models on tasks such as image captioning and visual question answering, our extensive experiments using state-of-the-art VL models show that they still struggle with visual metaphors, and perform substantially worse than humans.", "venue": "Conference on Empirical Methods in Natural Language Processing", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-05-23", "journal": {"pages": "1433-1445"}, "authors": [{"authorId": "2165225814", "name": "EunJeong Hwang"}, {"authorId": "2121375800", "name": "V. Shwartz"}], "citations": [{"paperId": "95229117a0e30a3a74e3d8ae58d45e7bba907199", "title": "BCAmirs at SemEval-2024 Task 4: Beyond Words: A Multimodal and Multilingual Exploration of Persuasion in Memes"}, {"paperId": "53d629a5d43653ba76d51ae2161f121d033b363f", "title": "Modularized Networks for Few-shot Hateful Meme Detection"}, {"paperId": "5f58863dd6474d6f127be995b5871e7c60f2792f", "title": "Video Understanding with Large Language Models: A Survey"}, {"paperId": "0ef006f9900185ac6ede39352d1de1ddee7923b6", "title": "Let's Think Outside the Box: Exploring Leap-of-Thought in Large Language Models with Creative Humor Generation"}, {"paperId": "f26c2685000da2bb2acc647819ac65c8270d2089", "title": "Social Meme-ing: Measuring Linguistic Variation in Memes"}, {"paperId": "4c4d176c6e28f48041f215d563f6ee8633534cff", "title": "Valley: Video Assistant with Large Language model Enhanced abilitY"}, {"paperId": "cdb0e126f03caeb95ad947e13180d3219a2ffe04", "title": "I Spy a Metaphor: Large Language Models and Diffusion Models Co-Create Visual Metaphors"}]}
