{"paperId": "b82f6a99bf27c1e92f32502198a58bbf69990155", "publicationVenue": null, "title": "Computer Methods and Programs in Biomedicine", "abstract": "Background and objective: COVID-19 outbreak has become one of the most challenging problems for human being. It is a communicable disease caused by a new coronavirus strain, which infected over 375 million people already and caused almost 6 million deaths. This paper aims to develop and design a framework for early diagnosis and fast classiﬁcation of COVID-19 symptoms using multimodal Deep Learning techniques. Methods: we collected chest X-ray and cough sample data from open source datasets, Cohen and datasets and local hospitals. The features are extracted from the chest X-ray images are extracted from chest X-ray datasets. We also used cough audio datasets from Coswara project and local hospitals. The publicly available Coughvid DetectNow and Virufy datasets are used to evaluate COVID-19 detection based on speech sounds, respiratory, and cough. The collected audio data comprises slow and fast breathing, shallow and deep coughing, spoken digits, and phonation of sustained vowels. Gender, geographical location, age, pre-existing medical conditions, and current health status (COVID-19 and Non-COVID-19) are recorded. Results: The proposed framework uses the selection algorithm of the pre-trained network to determine the best fusion model characterized by the pre-trained chest X-ray and cough models. Third, deep chest X-ray fusion by discriminant correlation analysis is used to fuse discriminatory features from the two models. The proposed framework achieved recognition accuracy, speciﬁcity, and sensitivity of 98.91%, 96.25%, and 97.69%, respectively. With the fusion method we obtained 94.99% accuracy. Conclusion: This paper examines the effectiveness of well-known ML architectures on a joint collection of chest-X-rays and cough samples for early classiﬁcation of COVID-19. It shows that existing methods can effectively used for diagnosis and suggesting that the fusion learning paradigm could be a crucial asset in diagnosing future unknown illnesses. The proposed framework supports health informatics basis on early diagnosis, clinical decision support, and accurate prediction.", "venue": "", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "2275928379", "name": "Santosh Kumar"}, {"authorId": "145655298", "name": "M. K. Chaube"}, {"authorId": "2240902458", "name": "S. Alsamhi"}, {"authorId": "2276322143", "name": "Sachin Kumar Gupta"}, {"authorId": "2240203689", "name": "Mohsen Guizani"}, {"authorId": "1761227", "name": "Raffaele Gravina"}, {"authorId": "2266326006", "name": "Giancarlo Fortino"}], "citations": [{"paperId": "0012ee2d4ba7a8fdbb071fbe0d781f463528a0ce", "title": "Chest X-ray Images for Lung Disease Detection Using Deep Learning Techniques: A Comprehensive Survey"}, {"paperId": "7bceeb3a682c855df1e7efb7dbdfcdcd5d6cc802", "title": "RTNet: a residual t-shaped network for medical image segmentation"}, {"paperId": "dd2d08a0285b6dad4996f0b8e87bba0a3b5d4953", "title": "Machine Learning for Prediction of Cardiovascular Disease and Respiratory Disease: A Review"}, {"paperId": "b738971aa95f62e43589ae272bfe927ea0beb4b2", "title": "Harnessing the Power of Multimodal Data: Medical Fusion and Classification"}, {"paperId": "b6d2f0e22b4eeafc9871dfeb65872d1305cf1d4e", "title": "Impact of COVID-19 lockdown on hospital admissions for epistaxis in Germany"}, {"paperId": "769642256e3a972ec2df621b35c7e4a32c5b1852", "title": "Towards Graph-Based Semi-Supervised Learning on Audio Embeddings for Label Classification"}, {"paperId": "24ddfaa8a6b3242e09ff77cbd34def646f2e8e14", "title": "A novel multimodal framework for early diagnosis and classification of COPD based on CT scan images and multivariate pulmonary respiratory diseases"}, {"paperId": "1057a1559a3a1065bede7dc914a5d2e3cfdb64e4", "title": "Advancing Pandemic Preparedness in Healthcare 5.0: A Survey of Federated Learning Applications"}, {"paperId": "c5824b91ae93664c164783ad79f196f89b2cbbb9", "title": "An audio-based anger detection algorithm using a hybrid artificial neural network and fuzzy logic model"}, {"paperId": "a06c55dc15a75a9db80c3cb54729ea8ffe72e5a0", "title": "Exploring the State of Machine Learning and Deep Learning in Medicine: A Survey of the Italian Research Community"}, {"paperId": "daf62c9dc7bc37171045ed7a589fbfc96ebc1058", "title": "A Novel Framework for Detection of Digital Face Video Manipulation using Deep Learning"}, {"paperId": "1c2dfc44dc037dbc91318cf10a825dfc829d1bb3", "title": "Maize Plant Disease Prediction of UAV Images for Precision Agriculture Using Fusion of Multimodal"}, {"paperId": "31b4f130139ed2157bace345b59fb71836462168", "title": "A Distributed Ensemble of Diverse Deep Learning Models for Predicting COVID-19 Cases"}, {"paperId": "e5d31a57c28225eec753e2174fe8c3fbbeca20fa", "title": "Converting ECG Signals to Images for Efficient Image-text Retrieval via Encoding"}, {"paperId": "4f4448490ddce69e818613aa95ed6c85f18861dc", "title": "COVINet: A hybrid model for classification of COVID and Non-COVID pneumonia in CT and X-Ray imagery"}, {"paperId": "a38df49b22ec96cbfb8afbfd02a0523b07ccae0c", "title": "A Novel Framework for Constructing Multimodal Knowledge Graph from MuSe-CaR Video Reviews"}, {"paperId": "226cae9533b6ced66bc52e2eb60f7b957c07b041", "title": "TFRegNCI: Interpretable Noncovalent Interaction Correction Multimodal Based on Transformer Encoder Fusion"}, {"paperId": "f12bab32bebf98d706bc7f77edb4bd5f9d7b20ee", "title": "Multi-omics integration method based on attention deep learning network for biomedical data classification"}, {"paperId": "bbc6014867f9d07333aa8ee8072359d76da12c80", "title": "Boosting automatic COVID-19 detection performance with self-supervised learning and batch knowledge ensembling"}, {"paperId": "d8e278d59968422b860c66ca421317fe41048d6a", "title": "Multi-modal approach for COVID-19 detection using coughs and self-reported symptoms"}, {"paperId": "af5f082a873b8e9939f5c4b5f5e3b6c7d5f14609", "title": "Novel Framework for Alzheimer Early Diagnosis using Inductive Transfer Learning Techniques"}, {"paperId": "422a3d887d81af07020aebfaf074aec46fe1a94d", "title": "Predictors for adherent behavior in the COVID-19 pandemic: A cross-sectional telephone survey"}, {"paperId": "3f93778c11389da7ad153951259349fbaad4e533", "title": "Multimodal deep learning model for Covid-19 detection"}, {"paperId": "6eee4430babb065365186abea7b130858836dd44", "title": "Classification and detection of Covid-19 based on X-Ray and CT images using deep learning and machine learning techniques: A bibliometric analysis"}, {"paperId": "b05920da4955cb463f618162af8c4bae6af16266", "title": "Computers in Biology and Medicine"}]}
