{"paperId": "b835a26f28c295dc852dc276f4bea46b260f62bc", "publicationVenue": null, "title": "HexTile: A Hexagonal DGGS-Based Map Tile Algorithm for Visualizing Big Remote Sensing Data in Spark", "abstract": "The advent of the era of big remote sensing data has transformed traditional data management and analysis models, among which visualization analysis has gradually become an effective method, and map tiles for remote sensing data have always played an important role. However, in high-latitude regions, especially in polar regions, the deformation caused by map projection still exists, which lowers the accuracy of global or large-scale visual analysis, as well as the execution efficiency of big data. To solve the above problems, this paper proposes an algorithm called HexTile, which uses a hexagonal discrete global grid system (DGGS) model to effectively avoid problems caused by map projection and ensure global consistency. At the same time, the algorithm was implemented based on the Spark platform, which also has advantages in efficiency. Based on the DGGS model, hierarchical hexagon map tile construction and a visualization algorithm were designed, including hexagonal slicing, merging, and stitching. The above algorithms were parallelized in Spark to improve the big data execution efficiency. Experiments were carried out with Landsat-8, and the results show that the HexTile algorithm can not only guarantee the quality of global data, but also give full play to the advantages of the cluster in terms of efficiency. Additionally, the visualization was conducted with Cesium and OpenLayers to validate the integration and completeness of hexagon tiles. The scheme proposed in this paper could provide a reference for spatiotemporal big data visualization technology.", "venue": "ISPRS Int. J. Geo Inf.", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-02-23", "journal": {"name": "ISPRS Int. J. Geo Inf.", "pages": "89", "volume": "12"}, "authors": [{"authorId": "49602855", "name": "X. Yao"}, {"authorId": "2150702330", "name": "Guojiang Yu"}, {"authorId": "1775836", "name": "Guoqing Li"}, {"authorId": "2111617404", "name": "Shuai Yan"}, {"authorId": "2109091279", "name": "Long Zhao"}, {"authorId": "2411341", "name": "Dehai Zhu"}], "citations": [{"paperId": "a7f26d6e2aba753d10883fd66cdbe18c77eb924f", "title": "Rectification for Stitched Images with Deformable Meshes and Residual Networks"}, {"paperId": "622185476c195bd8bc0c5a67fd409fcf2905be0f", "title": "Encoding and operation scheme for the rhombic triacontahedron aperture 4 hexagonal discrete global grid system"}, {"paperId": "a9cc8e608a2a73b61a6e43473d0d079d5213bbeb", "title": "Map vector tile construction for arable land spatial connectivity analysis based on the Hadoop cloud platform"}, {"paperId": "255e768630a1bbe85bde5cf63d0ed35a883ff381", "title": "AN APPLICATION-ORIENTED IMPLEMENTATION OF HEXAGONAL ON-THE-FLY BINNING METRICS FOR CITY-SCALE GEOREFERENCED SOCIAL MEDIA DATA"}]}
