{"paperId": "b85776ac19ab0fc03ae6aa74b34a6798941aae6e", "publicationVenue": {"id": "d03a5bfe-db75-4dc9-95f3-ae92b081f42c", "name": "International Conference on Utility and Cloud Computing", "type": "conference", "alternate_names": ["IEEE/ACM Int Conf Util Cloud Comput", "Utility and Cloud Computing", "Int Conf Util Cloud Comput", "Util Cloud Comput", "UCC", "IEEE/ACM International Conference Utility and Cloud Computing"]}, "title": "A Self-stabilizing Control Plane for Fog Ecosystems", "abstract": "Fog Computing is now emerging as the dominating paradigm bridging the compute and connectivity gap between sensing devices and latency-sensitive services. However, as fog deployments scale by accumulating numerous devices interconnected over highly dynamic and volatile network fabrics, the need for self-healing in the presence of failures is more evident. Using the prevailing methodology of self-stabilization, we propose a fault-tolerant framework for control planes that enables fog services to cope and recover from a very broad fault model. Specifically, our model considers network uncertainties, packet drops, node fail-stops and violations of the assumptions according to which the system was designed to operate (e.g., system state corruption). Our self-stabilizing algorithms guarantee automatic recovery within a constant number of communication rounds without the need for external (human) intervention. To showcase the framework’s effectiveness, the correctness proof of the self-stabilizing algorithmic process is accompanied by a comprehensive evaluation featuring an open and reproducible testbed utilizing real-world data from the smart vehicle domain. Results show that our framework ensures a fog system recovers from faults in constant time, analytics are computed correctly, while the control plane overhead scales linearly towards the IoT load.", "venue": "International Conference on Utility and Cloud Computing", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-12-01", "journal": {"name": "2020 IEEE/ACM 13th International Conference on Utility and Cloud Computing (UCC)", "pages": "13-22"}, "authors": [{"authorId": "35700560", "name": "Z. Georgiou"}, {"authorId": "1686677", "name": "Chryssis Georgiou"}, {"authorId": "1777051", "name": "G. Pallis"}, {"authorId": "1804157", "name": "E. Schiller"}, {"authorId": "1755017", "name": "Demetris Trihinas"}], "citations": []}
