{"paperId": "b85b4ce011cc478e35b042f6b3f965b3b15804f9", "publicationVenue": {"id": "c56116d3-225c-47c9-a4d9-f935e32f846c", "name": "IEEE Vehicular Technology Conference", "type": "conference", "alternate_names": ["IEEE Veh Technol Conf", "Veh Technol Conf", "VTC", "Vehicular Technology Conference"], "url": "http://vtsociety.org/"}, "title": "Secure Multi-access Edge Computing Assisted Maneuver Control for Autonomous Vehicles", "abstract": "The sensing capabilities of smart vehicles are growing and enabling unprecedented functionalities that drive the future commercial adoption of autonomous vehicles. However, the real-time requirements of mission-critical vehicular applications are revealing the current limitation of Vehicular Ad-hoc Networks (VANETs). In this scenario, computing paradigms like Vehicular Edge Computing (VEC) are promising solutions to match low-latency requirements. However, there still exist security challenges that need to be addressed to assure safe and secure autonomous driving deployment. We propose in this paper a secure architecture based on the VEC cloud paradigm that enables the deployment of real-time and mission-critical autonomous driving applications at the edge of the network. We leverage the IOTA-VPKI vehicular security scheme to support the security lifecycle of vehicular applications. Furthermore, we describe a Cooperative Autonomous Driving Maneuver Control application to discuss the effectiveness of the proposed architecture in the cooperative lane change use case. We plan to extensively test this architecture in real environments located in Italy and Portugal and to contribute to the future successful deployment of autonomous vehicles.", "venue": "IEEE Vehicular Technology Conference", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-04-01", "journal": {"name": "2021 IEEE 93rd Vehicular Technology Conference (VTC2021-Spring)", "pages": "1-6"}, "authors": [{"authorId": "66541720", "name": "A. Tesei"}, {"authorId": "1788852", "name": "M. Luise"}, {"authorId": "152462810", "name": "P. Pagano"}, {"authorId": "144273493", "name": "J. Ferreira"}], "citations": [{"paperId": "fa1c4e0193cc24aeec6e0aec8f9bc1b238f0cb0e", "title": "Safeguarding Cooperative Maneuver Information with Practical Byzantine Fault Tolerance"}, {"paperId": "8b0daa27e777c4d84447e36c725e507dc3094d04", "title": "VERCO: A privacy and data-centric architecture for verifiable cooperative maneuvers"}, {"paperId": "330778041d364c282b5aa8d7da0c749d762e6ec1", "title": "A Transparent Distributed Ledger-based Certificate Revocation Scheme for VANETs"}, {"paperId": "770e20685213d44d4fff01cd41a09446da382657", "title": "On the Exploitation of 5G Multi-Access Edge Computing for Spatial Audio in Cultural Heritage Applications"}]}
