{"paperId": "b88676c703d2d5e7c21df8fc040a56b507106bc9", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Optimal Selection of Clustering Algorithm via Multi-Criteria Decision Analysis (MCDA) for Load Profiling Applications", "abstract": "Due to high implementation rates of smart meter systems, considerable amount of research is placed in machine learning tools for data handling and information retrieval. A key tool in load data processing is clustering. In recent years, a number of researches have proposed different clustering algorithms in the load profiling field. The present paper provides a methodology for addressing the aforementioned problem through Multi-Criteria Decision Analysis (MCDA) and namely, using the Technique for Order of Preference by Similarity to Ideal Solution (TOPSIS). A comparison of the algorithms is employed. Next, a single test case on the selection of an algorithm is examined. User specific weights are applied and based on these weight values, the optimal algorithm is drawn.", "venue": "Applied Sciences", "year": 2018, "fieldsOfStudy": ["Engineering"], "publicationTypes": null, "publicationDate": "2018-02-04", "journal": {"name": "Applied Sciences", "pages": "237", "volume": "8"}, "authors": [{"authorId": "1997450", "name": "I. Panapakidis"}, {"authorId": "34463837", "name": "Georgios C. Christoforidis"}], "citations": [{"paperId": "df6ac2176bbdaaa1ea86566c024f86356320d662", "title": "Energy Profile Characterization of Electric Vehicle Charging Stations Based on Clustering Techniques"}, {"paperId": "3aa12b21a942e71df0fd85b0b646ac1a7cc19668", "title": "METHODOLOGICAL APPROACH TO ASSESSING THE LEVEL OF DEVELOPMENT OF THE ECONOMIC SPACE OF THE REGIONS"}, {"paperId": "d508019a20bb1ada112c88ea5e45ce35ad341e58", "title": "Prescriptive maintenance technique for photovoltaic systems"}, {"paperId": "70472e02f720248f5fd3a535f5d91c5f2ad1e2b6", "title": "An Integrated 3-Phase Group Decision-Making Model for Supplier Selection in a Supply Chain Network"}, {"paperId": "d3e6e21b8decad9ad793412aad2a70a0a55ee26f", "title": "Methods for Weighting Decisions to Assist Modelers and Decision Analysists: A Review of Ratio Assignment and Approximate Techniques"}, {"paperId": "f0a4db71c44dac35bfccd8a3e431112eeac8f27b", "title": "Data mining cubes for buildings, a generic framework for multidimensional analytics of building performance data"}, {"paperId": "9f17fc527c07fcad8653b9972e260c4f316e591c", "title": "A multi-criteria and stochastic robustness analysis approach to compare nations sustainability"}, {"paperId": "684cfbaab632f8e85ac15e721f871261de745d42", "title": "Assessing partially ordered clustering in a multicriteria comparative context"}, {"paperId": "12477b98d87931203107f6cba4e9bf9154276a7e", "title": "Clustering commercial and industrial load patterns for long-term energy planning"}, {"paperId": "91e881110026ab0c070ebfbce45de4c79540e425", "title": "A data analytics-based tool for the detection and diagnosis of anomalous daily energy patterns in buildings"}, {"paperId": "02a00195ecccfcc97295fe8be6eb61a37f268f80", "title": "Data Analytics for Profiling Low-Voltage Customers with Smart Meter Readings"}, {"paperId": "8dd56ba2d5da2c4f4c1a0aa40ff6abb7d70a99d0", "title": "Developing a Multi-Criteria Decision Making approach to compare types of classroom furniture considering mismatches for anthropometric measures of university students"}, {"paperId": "0f50594a8df7c86aab3527161450b4768039eeea", "title": "A Robust Building Energy Pattern Mining Method and its Application to Demand Forecasting"}, {"paperId": "2ec12cd3b9365f43cb1771d9f921e829ad5b067b", "title": "Clustering Residential Electricity Consumption Data to Create Archetypes that Capture Household Behaviour in South Africa"}, {"paperId": "515d60b64a8e7c22cd0afd706ffc3d5ca47ca402", "title": "A data analytics-based tool for the detection and diagnosis of anomalous daily energy patterns in buildings"}, {"paperId": "bf264529916c75bce3f9eb6f75b5a9987dd95678", "title": "Fast Clustering With Co-Clustering Via Discrete Non-Negative Matrix Factorization for Image Identification"}, {"paperId": "2a678fb30a85d686004c3c9ffdb480f540c65470", "title": "Recognition and classification of typical load profiles in buildings with non-intrusive learning approach"}, {"paperId": "cfee3e6f60dd66fd017953705d90f4d4d1c65086", "title": "EnergyScope TD: A novel open-source model for regional energy systems"}, {"paperId": "3227dddc303348f6d5c18a1bf06f947012b7953c", "title": "Unsupervised extraction of patterns and trends within highway systems condition attributes data"}, {"paperId": "267dfdf7b7c693442c48193d5f18feba81eb704b", "title": "A Short Review on Data Mining Techniques for Electricity Customers Characterization"}, {"paperId": "5db86db844f3305434fe7e4d455de694793813f6", "title": "A shape-based clustering method for pattern recognition of residential electricity consumption"}, {"paperId": "95a797369cfcf416781a6159dcea66532588a423", "title": "Images Analysis by Using Fuzzy Clustering"}, {"paperId": "b138c588604d353f8069bfa0c4d3ef0e8584dd9b", "title": "Load Profiling Considering Shape Similarity Using Shape-Based Clustering"}, {"paperId": "08d82903ac1872bc64da00735d14610bdd960e69", "title": "A systematic review of data pre-processing methods and unsupervised mining methods used in profiling smart meter data"}, {"paperId": "53f8c005678ed8ee55dcab4ce5382cb11859f1dc", "title": "OVERVIEW ON KERNELS FOR LEAST-SQUARES SUPPORT-VECTOR-MACHINE-BASED CLUSTERING: EXPLAINING KERNEL SPECTRAL CLUSTERING"}]}
