{"paperId": "b88887023300b39f943e4ea8fbd13318600b3db0", "publicationVenue": {"id": "228761ec-c40a-479b-8309-9dcbe9851bcd", "name": "IEEE Internet of Things Journal", "type": "journal", "alternate_names": ["IEEE Internet Thing J"], "issn": "2327-4662", "url": "https://www.ieee.org/membership-catalog/productdetail/showProductDetailPage.html?product=PER288-ELE", "alternate_urls": ["https://ieeexplore.ieee.org/servlet/opac?punumber=6488907", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6488907", "http://ieee-iotj.org/#"]}, "title": "Energy Consumption and QoS-Aware Co-Offloading for Vehicular Edge Computing", "abstract": "By deploying computing, storage, and bandwidth resources at the user side, vehicular edge computing (VEC) provides low-delay services for vehicle users. However, due to the limited resources of edge servers, how to efficiently meet the Quality-of-Service (QoS) requirements of multiple tasks and save the total energy consumption in a dynamic environment is an important issue in VEC. In this article, we first propose an energy consumption and QoS-aware co-offloading model. Unlike most previous studies, our goal is to minimize the total energy consumption while guaranteeing the QoS constraints of tasks, thus avoiding the overallocation of resources and high energy consumption caused by the one-sided pursuit of delay minimization. Then, without the requirements for domain experts, we propose Bayesian optimization-based computation offloading (BOCO) method to find the optimal offloading decision. To the best of our knowledge, this work is the first to apply Bayesian optimization to computation offloading in VEC. Furthermore, we conduct a series of experiments and comparisons with other offloading methods to analyze the effectiveness and performance of the proposed algorithm. Experimental results verify that our proposed BOCO outperforms counterparts.", "venue": "IEEE Internet of Things Journal", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-03-15", "journal": {"name": "IEEE Internet of Things Journal", "pages": "5214-5225", "volume": "10"}, "authors": [{"authorId": "2151346290", "name": "Wenkai Lv"}, {"authorId": "49731702", "name": "Pengfei Yang"}, {"authorId": "144231374", "name": "Tianyang Zheng"}, {"authorId": "2154337938", "name": "Bijie Yi"}, {"authorId": "2155806295", "name": "Yunqing Ding"}, {"authorId": "2117949819", "name": "Quan Wang"}, {"authorId": "2054419637", "name": "Minwen Deng"}], "citations": [{"paperId": "5005bb59355758ec3cb616933343d4c134991ce6", "title": "Learning-Based Collaborative Computation Offloading in UAV-Assisted Multi-Access Edge Computing"}, {"paperId": "942fb0df711f4b1a2f6f6b89c4e19653bd96512b", "title": "Task Classification for Optimal Offloading and Resource Allocation in Vehicular Edge Computing"}, {"paperId": "6d0d08c69e6f082e0e845b2f3b38e2c4ab6f95e3", "title": "NeiLatS: Neighbor-Aware Latency-Sensitive Application Scheduling in Heterogeneous Cloud-Edge Environment"}, {"paperId": "8e6cd85cee45c1e3c3f233ea0e441220de4e24d4", "title": "Energy-Efficient and QoS-Aware Computation Offloading in GEO/LEO Hybrid Satellite Networks"}]}
