{"paperId": "b888611bf1084e811b8431079c53a4222a8e080b", "publicationVenue": {"id": "bf876fe0-7ad0-4242-9322-8b48c0d40b64", "name": "Journal of Advanced Computational Intelligence and Intelligent Informatics", "type": "journal", "alternate_names": ["J Adv Comput Intell Intell Informatics"], "issn": "1883-8014", "url": "http://www.fujipress.jp/JACIII/index.html"}, "title": "Gradient-Based Scheduler for Scientific Workflows in Cloud Computing", "abstract": "It is becoming increasingly attractive to execute workflows in the cloud, as the cloud environment enables scientific applications to utilize elastic computing resources on demand. However, despite being a key to efficiently managing application execution in the cloud, traditional workflow scheduling algorithms face significant challenges in the cloud environment. The gradient-based optimizer (GBO) is a newly proposed evolutionary algorithm with a search engine based on the Newton’s method. It employs a set of vectors to search in the solution space. This study designs a gradient-based scheduler by using GBO for workflow scheduling to minimize the usage costs of workflows under given deadline constraints. Extensive experiments are conducted on well-known scientific workflows of different sizes and types using WorkflowSim. The experimental results show that the proposed scheduling algorithm outperforms five other state-of-the-art algorithms in terms of both the constraint satisfiability and cost optimization, thereby verifying its advantages in addressing workflow scheduling problems.", "venue": "Journal of Advanced Computational Intelligence and Intelligent Informatics", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-01-20", "journal": {"name": "J. Adv. Comput. Intell. Intell. Informatics", "pages": "64-73", "volume": "27"}, "authors": [{"authorId": "2155682257", "name": "Danjing Wang"}, {"authorId": "2109156348", "name": "Huifang Li"}, {"authorId": "2108399009", "name": "Youwei Zhang"}, {"authorId": "2714722", "name": "Baihai Zhang"}], "citations": []}
