{"paperId": "b8880a62d365c113a8e3187a2b8bdec582294455", "publicationVenue": null, "title": "Scalable Data Analytics from Predevelopment to Large Scale Manufacturing", "abstract": "Data analytics provides a toolset to extract insights from large amounts of data. In order to stay competitive, companies of the manufacturing domain utilize data analytics to be more efficient and to increase quality of the production and product. Current methodologies for the application of data analytics and data mining techniques focus on finding correlations within data from existing systems and historic data. Therefore, data analytics is typically applied to solve existing problems within existing manufacturing systems. Since present brownfield production lines often provide insufficient data, new hardware has to be retrofitted to acquire the required data. Hence, valuable time for problem solving is lost. This paper presents an approach to proactively implement data analytics during early predevelopment phases in order to allow scalability of the approach to large scale manufacturing systems. The approach is implemented and evaluated within the context of high voltage battery manufacturing for electric vehicles.", "venue": "2019 Asia Pacific Conference on Research in Industrial and Systems Engineering (APCoRISE)", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-04-18", "journal": {"name": "2019 Asia Pacific Conference on Research in Industrial and Systems Engineering (APCoRISE)", "pages": "1-6"}, "authors": [{"authorId": "2679862", "name": "H. Heimes"}, {"authorId": "2448963", "name": "A. Kampker"}, {"authorId": "3230818", "name": "Ulrich Bührer"}, {"authorId": "2047249527", "name": "Anita Steinberger"}, {"authorId": "29415466", "name": "Joscha Eirich"}, {"authorId": "25687110", "name": "Stefan Krotil"}], "citations": [{"paperId": "fa453dcaed0a82d1bca1bdc8efa406e53622476e", "title": "RfX: A Design Study for the Interactive Exploration of a Random Forest to Enhance Testing Procedures for Electrical Engines"}]}
