{"paperId": "b88b94d0f5e092dfc43654c5a934f801932b19b8", "publicationVenue": {"id": "589ed020-784b-47ac-884d-9c6ae29fd509", "name": "International Conference Intelligent Computing and Control Systems", "type": "conference", "alternate_names": ["ICICCS", "Int Conf Intell Comput Control Syst"]}, "title": "Big Data Solution: Improvised Distributions Framework of Hadoop", "abstract": "Big data technology (synonymous with Apache Hadoop) is growing rapidly due to its low cost, scalable data processing capabilities, and high fault tolerance. After the release of Hadoop 1.0, the organizations started using this technology but faced some difficulties. At this stage, Hadoop Framework was premature in fulfilling the expectations of different organizations, which looked for an alternative of Apache Hadoop. Therefore, Hadoop vendors improvised the open source core Apache Hadoop release and made it enterprise ready. Hadoop Distributions presented a unified product: an added apache repository, new tools, security and central administration all together so that the organizations did not have to spend time assembling all these essentials into a single functional piece. The most accepted Hadoop Distributions existing in the market today are Cloudera CDH, Hortonworks HDP, and MapR M5. This paper discusses different features of these Hadoop vendor distributions and makes comparisons based on the functionality and contribution of each vendor in the big data market.", "venue": "International Conference Intelligent Computing and Control Systems", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2018-06-01", "journal": {"name": "2018 Second International Conference on Intelligent Computing and Control Systems (ICICCS)", "pages": "35-38"}, "authors": [{"authorId": "72603467", "name": "G. Bhathal"}, {"authorId": "37040274", "name": "A. Dhiman"}], "citations": [{"paperId": "d60d075d678f9d03bc54d424a00b1bb422df9a4d", "title": "Development of Fault Detection Systems: The Hadoop Ecosystem Implementation"}, {"paperId": "082cdd8235e2e7f358b8ce0a6ec581b0f6244eac", "title": "Automating Hadoop Cluster On Aws Cloud Using Terraform"}, {"paperId": "83c73fdce066529d3e13083aa5364bf1ce88ad5e", "title": "Research on Acceptance of Intelligent Substation Equipment Based on Secondary System Debugging Technology"}, {"paperId": "f20583abdc1ff0a3f4696afba164940da614715c", "title": "AN EFFICIENT APPROACH FOR BIGDATA SECURITY BASED ON HADOOP SYSTEM USING CRYPTOGRAPHIC TECHNIQUES"}, {"paperId": "d169bed5ba74fd938361b6421a0de535b53f1b7a", "title": "Research on parallel distributed clustering algorithm applied to cutting parameter optimization"}, {"paperId": "e279ae38a51a9ffa57a30893e656f5a9a655e988", "title": "Modelagem Hierárquica e Heterogênea para Avaliação de Disponibilidade de Aplicações Big Data na Nuvem Privada"}, {"paperId": "0261414ddc12cdd67e313efe38a17de2e2eb1693", "title": "Big Data Security Challenges and Solution of Distributed Computing in Hadoop Environment: A Security Framework"}, {"paperId": "d0d1a0e8c070f9b8a3badc22ec618a09c00804dd", "title": "Crime Analysis and Intelligence System Model Design using Big Data"}, {"paperId": "ca276d02050885977a73ae147f9107b1c072b31f", "title": "The Design and Implementation of Campus Network Streaming Media Live Video On-Demand System Based on Nginx and FFmpeg"}, {"paperId": "0cc27ec7c5c13b748f58c0e9ddbe6990f0f56b1c", "title": "Tolerância a Falhas em Computação Móvel na Cloud"}, {"paperId": "2087ff48c25e60fbf1b33720f5bdc71554e6a2a9", "title": "Residential Electricity Classification Method Based On Cloud Computing Platform and Random Forest"}, {"paperId": "3d974a54d70edc2449fc88ee9f69f0ec8b4ecb99", "title": "International Journal of Science and Business"}, {"paperId": "164cad425332142b149671e0c6622419e0fd40e3", "title": "Essential Learning Components from Big Data Case Studies"}, {"paperId": "caff213f6b2f22b60812c53d59c0105cc25a5066", "title": "Development and Evaluation of a Big Data Framework for Performance Management in Mobile Networks"}]}
