{"paperId": "b88cac3ad1e609b5734c3b16fe316e6b41a79a55", "publicationVenue": null, "title": "Graph IRs for Impure Higher-Order Languages: Making Aggressive Optimizations Affordable with Precise Effect Dependencies", "abstract": "Graph-based intermediate representations (IRs) are widely used for powerful compiler optimizations, either interprocedurally in pure functional languages, or intraprocedurally in imperative languages. Yet so far, no suitable graph IR exists for aggressive global optimizations in languages with both effects and higher-order functions: aliasing and indirect control transfers make it difficult to maintain sufficiently granular dependency information for optimizations to be effective. To close this long-standing gap, we propose a novel typed graph IR combining a notion of reachability types with an expressive effect system to compute precise and granular effect dependencies at an affordable cost while supporting local reasoning and separate compilation. Our high-level graph IR imposes lexical structure to represent structured control flow and nesting, enabling aggressive and yet inexpensive code motion and other optimizations for impure higher-order programs. We formalize the new graph IR based on a λ-calculus with a reachability type-and-effect system along with a specification of various optimizations. We present performance case studies for tensor loop fusion, CUDA kernel fusion, symbolic execution of LLVM IR, and SQL query compilation in the Scala LMS compiler framework using the new graph IR. We observe significant speedups of up to 21x.", "venue": "Proc. ACM Program. Lang.", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-10-16", "journal": {"name": "Proceedings of the ACM on Programming Languages", "pages": "400 - 430", "volume": "7"}, "authors": [{"authorId": "2086627", "name": "Oliver Bračevac"}, {"authorId": "2113006", "name": "Guannan Wei"}, {"authorId": "2242702445", "name": "Songlin Jia"}, {"authorId": "51428583", "name": "Supun Abeysinghe"}, {"authorId": "2170775479", "name": "Yuxuan Jiang"}, {"authorId": "2239105953", "name": "Yuyan Bao"}, {"authorId": "1712987", "name": "Tiark Rompf"}], "citations": [{"paperId": "95637d34079d3c4ca5bd35c57e0dc1c46ce8c493", "title": "Flan: An Expressive and Efficient Datalog Compiler for Program Analysis"}, {"paperId": "f64b0732d36b6df3fcd641f3de3aba19af3c70eb", "title": "Graph IRs for Impure Higher-Order Languages (Technical Report)"}, {"paperId": "1b23e36a0182757317d657a3b8348e8161f19f3a", "title": "Modeling Reachability Types with Logical Relations"}, {"paperId": "c48f064bedac2603bd80d3ce19f019d177658861", "title": "Polymorphic Reachability Types: Tracking Freshness, Aliasing, and Separation in Higher-Order Generic Programs"}, {"paperId": "770911d314dd7866153f2be235607c0eb32255bf", "title": "Rhyme: A Data-Centric Expressive Query Language for Nested Data Structures"}]}
