{"paperId": "b89389c77170604cae0a962cf8042cc5423707c1", "publicationVenue": null, "title": "An Advanced and Efficient Cluster Key Management Scheme for Agriculture Precision IoT Based Systems", "abstract": "░ ABSTRACT - Things that connect to other devices & systems via Internet or communication networks are called IoT. It can also be said as a network of wireless sensors connected to a cloud and controlled by embedded devices. Considering the large framework of IoT, it becomes a little difficult to maintain security at each sensor node especially with limited information regarding hardware and deployment capabilities. Therefore, management of keys has become a point of concern peculiarly taking account of node capturing attack. This paper proposes an advanced cluster key management scheme for agriculture precision which involves EBS constructor and Chinese remainder theorem together. Once the data is collected from the nodes and a list is created, it is sent from the Cluster Head to the Backend Server, which filters it for hostile IDs and ignore the unauthentic sensor, returning filtered list with preloaded keys, & an authentication code to Cluster Head for use. To ensure added security, in this scheme encryption of data is done twice. Upon comparing the proposed scheme with others, it has been observed that we have achieved higher delivery ratio and reduced the energy consumption and packet drop rate to a great extent.", "venue": "", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "2055635841", "name": "Sakshi Anand"}, {"authorId": "1641517645", "name": "Avinash Sharma"}], "citations": [{"paperId": "b7b6ec12ffea00c8f61b69faae7e3f2e2501e0e3", "title": "A Novel Hybrid Energy Efficient Model using Clustering in Wireless Sensor Networks"}, {"paperId": "eab901c099e0a50b3bc0080be83361b7a332ccc6", "title": "Comprehensive analysis of services towards enhancing security in IoT-based agriculture"}, {"paperId": "3babc3ea4fd4592ba8c65d8ad5f91a9530fd3045", "title": "AgroKy: An approach for enhancing security services in precision agriculture"}]}
