{"paperId": "b8b0cfc22914ce6df185f29e6bc4e75f6eaa17d9", "publicationVenue": {"id": "f32b7322-b69c-4e63-801d-8f50784ef778", "name": "Computational Intelligence and Neuroscience", "type": "journal", "alternate_names": ["Comput Intell Neurosci"], "issn": "1687-5265", "url": "https://www.hindawi.com/journals/cin/"}, "title": "Sports Economic Mining Algorithm Based on Association Analysis and Big Data Model", "abstract": "With the implementation of national strategies such as sports power and national fitness, the sports economy has become an important element of high-quality national development, and the demand for sports economy and management talents is greatly increased. Particularly in the new area with big data as the typical feature, the teaching content, teaching method, and teaching mode of sports economics and management majors have put forward new requirements. The continuous progress of storage and network technology has prompted the generation of massive multisource spatiotemporal data in various fields. The advantage of association analysis algorithms is that they are easy to code and implement. The relationships found by association analysis can take two forms: frequent itemsets or association rules. We use correlation analysis methods to perform correlation learning between sports economy and related big data and thus improve the development of sports economy. Mining and analyzing the relevant big data can precisely reveal the problems of sports economic development and can realize the fine management of sports, thus contributing to the healthy development of sports. Mastering the skills of acquiring, analyzing, and applying big data is the core content of sports economic analysis. The sports economy has refined and intelligent management means, and its adoption of virtual reality reflects the current situation and development trend of the sports business, which further highlights the status and role of multisource big data in the sports economy. Based on these, this paper proposed a sports economy mining algorithm in view of the correlation analysis and big data model. Then, we verified the effectiveness of the model through experiments, which laid the foundation for the development of the sports economy.", "venue": "Computational Intelligence and Neuroscience", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-05-23", "journal": {"name": "Computational Intelligence and Neuroscience", "volume": "2022"}, "authors": [{"authorId": "9123323", "name": "Fu-jian Zhou"}], "citations": [{"paperId": "bec7bba50e280ea8cb242eadcb257e559a9cf3b5", "title": "Retracted: Sports Economic Mining Algorithm Based on Association Analysis and Big Data Model"}, {"paperId": "6ce9e0eeff56b6320d53f71a26cdcd7300a8fcb6", "title": "Discriminating Feed Rate of Combine Harvester by Using Association Rule Mining"}, {"paperId": "1f4bd1aa158e2294eb2aa881940f9b54346a3f54", "title": "Research on Network Data Algorithm Based on Association Rules"}]}
