{"paperId": "b8b8ac9082fd5618788f272bfe7bf6972942cbe5", "publicationVenue": {"id": "6fa18ffd-a3c3-4260-9a9a-9da6896ec372", "name": "Critical reviews in microbiology", "type": "journal", "alternate_names": ["Critical Reviews in Microbiology", "Crit Rev Microbiol", "Crit rev microbiol"], "issn": "1040-841X", "url": "http://informahealthcare.com/loi/mby", "alternate_urls": ["http://www.tandfonline.com/loi/imby", "http://www.tandfonline.com/imby", "http://www.metapress.com/openurl.asp?genre=journal&issn=1040-841X"]}, "title": "Review on computer-assisted biosynthetic capacities elucidation to assess metabolic interactions and communication within microbial communities.", "abstract": "Microbial communities thrive through interactions and communication, which are challenging to study as most microorganisms are not cultivable. To address this challenge, researchers focus on the extracellular space where communication events occur. Exometabolomics and interactome analysis provide insights into the molecules involved in communication and the dynamics of their interactions. Advances in sequencing technologies and computational methods enable the reconstruction of taxonomic and functional profiles of microbial communities using high-throughput multi-omics data. Network-based approaches, including community flux balance analysis, aim to model molecular interactions within and between communities. Despite these advances, challenges remain in computer-assisted biosynthetic capacities elucidation, requiring continued innovation and collaboration among diverse scientists. This review provides insights into the current state and future directions of computer-assisted biosynthetic capacities elucidation in studying microbial communities.", "venue": "Critical reviews in microbiology", "year": 2024, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2024-01-25", "journal": {"name": "Critical reviews in microbiology", "pages": "\n          1-40\n        "}, "authors": [{"authorId": "2065914488", "name": "M. Zulfiqar"}, {"authorId": "2281119277", "name": "Vinay Singh"}, {"authorId": "2238683959", "name": "Christoph Steinbeck"}, {"authorId": "1609321402", "name": "Maria Sorokina"}], "citations": []}
