{"paperId": "b8c455fd434858572fc409b5b4fe0dc0a2ab9793", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "The Power of Big Data and Data Analytics for AMI Data: A Case Study", "abstract": "In recent years, there has been a transformation in the value chain of different industrial sectors, like the electricity networks, with the appearance of smart grids. Currently, the underlying knowledge in raw data coming from numerous devices can mark a significant competitive advantage for utilities. It is the case of the Advanced Metering Infrastructure (AMI). Such technology gets user consumption characteristics at levels of detail that were previously not possible. In this context, the terms big data and data analytics become relevant, which are tools that allow using large volumes of information and the generation of valuable knowledge from raw data that can support data-driven decisions for operating on the grid. This paper presents the results of the big data implementation and data analytics techniques in a case study with smart metering data from the city of London. Implemented big data and data analytic techniques to show how to understand user consumption patterns on a broader horizon, the relationships with seasonal variables identify behaviors related to specific events and atypical consumptions. This knowledge helps support decision making about improving demand response programs and, in general, the planning and operation of the Smart Grid.", "venue": "Italian National Conference on Sensors", "year": 2020, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-06-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "20"}, "authors": [{"authorId": "1747004657", "name": "J. S. Guerrero-Prado"}, {"authorId": "2865247", "name": "Wilfredo Alfonso"}, {"authorId": "2058050386", "name": "Eduardo Caicedo Bravo"}, {"authorId": "1404608624", "name": "B. Zayas-Pérez"}, {"authorId": "2982972", "name": "A. Reza"}], "citations": [{"paperId": "20d0a12ecb450ac945a79a759450c46c0f5338d0", "title": "Implementation of a dynamic planning algorithm in accounting information technology administration"}, {"paperId": "926efa2379c9034400d8dc3df866663b4aa8d13a", "title": "Demand Work Order Dispatching Method Based on Power Big Data and RNN"}, {"paperId": "a2dbca77777c52f5456f4fe55f7dfee1c9ae8c2e", "title": "SVM-based regression for forecasting building power energy consumption using smart meter data"}, {"paperId": "cf4a6d52fcefc392183ea5b6454075580734da52", "title": "Digital Transformation of Microgrids: A Review of Design, Operation, Optimization, and Cybersecurity"}, {"paperId": "772c3b63539bcf7c00ec707674e1a21ad7529b8b", "title": "Using advanced metering infrastructure data to evaluate consumer compliance with water advisories during a water service interruption."}, {"paperId": "6a63f0cd03e5b0f04af92e937da12e158442db45", "title": "Image analysis and pattern recognition method of three-dimensional process in physical education teaching based on big data"}, {"paperId": "c54312d1b27d9ed0d62f05b9affb21e26d4eb217", "title": "A hybrid model for forecasting the consumption of electrical energy in a smart grid"}, {"paperId": "3c797fdaf112663b5e119c873ac60bb513ca1647", "title": "Research on Badminton Player’s Step Training Model Based on Big Data and IoT Networks"}, {"paperId": "36a995854896f0b5452c07dd6f16864d7ad18c0b", "title": "FORECASTING OF ELECTRICAL ENERGY CONSUMPTION OF HOUSEHOLDS IN A SMART GRID"}, {"paperId": "983bf5e76e4669d93adf90442e4e405023fdc230", "title": "Advanced Metering Infrastructure—Towards a Reliable Network"}, {"paperId": "bdc6722f0b7a59c0d1f4445535a876374134b0df", "title": "A Data Analytics/Big Data Framework for Advanced Metering Infrastructure Data"}, {"paperId": "d39702c97d95f26acf316364b177cf225c49cf97", "title": "Data Management in Smart Grid"}, {"paperId": "8f0aa46afca7387377085d0a7cb7f7a1ca1149ef", "title": "A Comprehensive Review on Residential Demand Side Management Strategies in Smart Grid Environment"}, {"paperId": "83557d39593a75973ff5729996b37de2dbb13180", "title": "Time-series clustering and forecasting household electricity demand using smart meter data"}, {"paperId": "debb17b21aa40fe556aed6a7480d0477edcc33fa", "title": "THE IMPORTANCE OF THE TAM-SAM-SOM MODEL AND HOW BIG DATA AND AI HELP"}, {"paperId": "fd9f442153d1f3929f2b899b76469477b543a68a", "title": "Lowering Big Data Project Barriers: Identifying System Architecture Templates for Standard Use Cases in Big Data"}, {"paperId": "66d605c6d868943f74060e81393bdcf81ae1b3e4", "title": "A holistic review on Cyber-Physical Power System (CPPS) testbeds for secure and sustainable electric power grid – Part – I: Background on CPPS and necessity of CPPS testbeds"}, {"paperId": "08d82903ac1872bc64da00735d14610bdd960e69", "title": "A systematic review of data pre-processing methods and unsupervised mining methods used in profiling smart meter data"}, {"paperId": "db3971ff70b7b786df89b7192b4ea6cfe09090fd", "title": "INTEGRATING AMI WITH GIS FOR ELECTRIC DISTRIBUTION TRANSFORMER LOAD MANAGEMENT"}]}
