{"paperId": "b8fa674ecbf86b4be9edd7d0a4d0025a063d38f4", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Data Mining Algorithm for Cloud Network Information Based on Artificial Intelligence Decision Mechanism", "abstract": "Due to the rapid development of information technology and network technology, there is a lot of data, but the phenomenon of lack of knowledge is becoming more and more serious. Data mining technology has developed vigorously in this environment, and it has shown more and more vitality. Based on Spark programming model, this paper designs the parallel extension of fuzzy c-means. In order to enhance the performance of fuzzy c-means parallel expansion, the improvement strategy of k-means during the initialization phase is borrowed, and k-means// is extended to fuzzy c-means to obtain better clustering performance. Combined with Spark’s programming model, this paper can obtain extended parallel fuzzy c-means algorithm. Several experiments on the data set of the algorithm proposed in this paper have shown good scalability and parallelism, effectively expanding fuzzy c-means clustering to distributed applications, greatly increasing the scale of the data processed by the algorithm. This improves the robustness of the algorithm and the adaptability of the algorithm to the shape and structure of the data, so that the parallel and scalable clustering algorithm can more effectively perform cluster analysis on big data. Three algorithms were simulated on MATLAB platform. We use simple data sets and complex two-dimensional data sets, and compare with the traditional fuzzy c-means algorithm and fuzzy c-means algorithm based on fuzzy entropy. Experiments show that the scalable parallel fuzzy c-means algorithm not only greatly improves the anti-noise performance, but also improves the convergence speed, and it can automatically determine the optimal number of clusters.", "venue": "IEEE Access", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-03-18", "journal": {"name": "IEEE Access", "pages": "53394-53407", "volume": "8"}, "authors": [{"authorId": "2115593689", "name": "Yuan Huang"}, {"authorId": "144854341", "name": "Z. Cheng"}, {"authorId": "2116763188", "name": "Qianyu Zhou"}, {"authorId": "1596821594", "name": "Yuxing Xiang"}, {"authorId": "1596819238", "name": "Ruixiao Zhao"}], "citations": [{"paperId": "78b2fcc224299be692634b09fd4167e60dd7ef0f", "title": "Simulation of China’s urban tourism activity based on improved density clustering algorithm"}, {"paperId": "15db6c42152c6d67bb9fec7d71ba39818063210f", "title": "Research on Invasive Insect Image Recognition Based on Artificial Intelligence"}, {"paperId": "56cedd2c73ac72f805e46f14b24a24fbd68e3ecc", "title": "Network information data processing method based on artificial intelligence"}, {"paperId": "32ca1fd914f6f833e438172cd7de65b83a4cbda4", "title": "Pragmatic evaluation of data mining models based on quality assessment & metric analysis"}, {"paperId": "b1d93a3c802e71abf6a49c35cc77bd3ddef3ef5d", "title": "The application of artiﬁcial intelligence technology of 6G internet of things communication combined with drama language art"}]}
