{"paperId": "b904dcdbd7c7b33938583f2f57d05ca70e121ea9", "publicationVenue": {"id": "e7c556b0-162f-4c48-9d25-fe3c141f984e", "name": "Big Data and Cognitive Computing", "alternate_names": ["Big Data Cogn Comput"], "issn": "2504-2289", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-1077183", "alternate_urls": ["https://www.mdpi.com/journal/BDCC", "https://www.mdpi.com/journal/BDCC/about", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-1077183"]}, "title": "An Efficient and Secure Big Data Storage in Cloud Environment by Using Triple Data Encryption Standard", "abstract": "In recent decades, big data analysis has become the most important research topic. Hence, big data security offers Cloud application security and monitoring to host highly sensitive data to support Cloud platforms. However, the privacy and security of big data has become an emerging issue that restricts the organization to utilize Cloud services. The existing privacy preserving approaches showed several drawbacks such as a lack of data privacy and accurate data analysis, a lack of efficiency of performance, and completely rely on third party. In order to overcome such an issue, the Triple Data Encryption Standard (TDES) methodology is proposed to provide security for big data in the Cloud environment. The proposed TDES methodology provides a relatively simpler technique by increasing the sizes of keys in Data Encryption Standard (DES) to protect against attacks and defend the privacy of data. The experimental results showed that the proposed TDES method is effective in providing security and privacy to big healthcare data in the Cloud environment. The proposed TDES methodology showed less encryption and decryption time compared to the existing Intelligent Framework for Healthcare Data Security (IFHDS) method.", "venue": "Big Data and Cognitive Computing", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-09-26", "journal": {"name": "Big Data Cogn. Comput.", "pages": "101", "volume": "6"}, "authors": [{"authorId": "2186480691", "name": "Mohan Naik Ramachandra"}, {"authorId": "2200758545", "name": "Madala Srinivasa Rao"}, {"authorId": "2150706913", "name": "W. Lai"}, {"authorId": "65965701", "name": "P. Divakarachari"}, {"authorId": "2200528122", "name": "Jayachandra Ananda Babu"}, {"authorId": "2143272549", "name": "Hemalatha Kivudujogappa Lingappa"}], "citations": [{"paperId": "06371b35d10139adaef4a07d96fc7155c41aeac8", "title": "A Case Study of Big Data Processing in the Cloud Environments with Insights into Advantages, Tools, and Techniques"}, {"paperId": "5b22b7e6a6f137dd93e124259da4b221f4c82c00", "title": "A Novel Information Security Framework for Securing Big Data in Healthcare Environment Using Blockchain"}, {"paperId": "77896febf972f11e02e215545ab3c3f125203ec4", "title": "The Intelligent Securely Storing Data in Distributed Systems for Big Data"}, {"paperId": "7054df3afae1a68f09a262eda6a5e6ff9d7724a7", "title": "A data lake-based security transmission and storage scheme for streaming big data"}, {"paperId": "40b0ac3896b1c67854aeeb8b773cdd8b0fa0f384", "title": "Hough Transform based Deep Belief Network and Improved Homomorphic Encryption for Cloud Security based Intrusion Discovery"}, {"paperId": "8c230f47a7487ca5ca7f3f59fee174dfbfaca023", "title": "Research on Small and Medium-sized Enterprises Marketing Decision Support Systems Based on Cloud"}, {"paperId": "4b8a52f0df5b903f6f3eac1c657b84f5ece89aa3", "title": "Two-Stage Encryption for Strengthening Data Security in Web-Based Databases: AES-256 and RSA Integration"}, {"paperId": "f4c168e9d3510fb9f675533dc96fff8314bc90b6", "title": "Storage and Maintenance of Sensitive Data using Homomorphic Encryption"}, {"paperId": "d8e2739879e7f6e500caace79a6bfce1cde9e584", "title": "Efficient and secure medical big data management system using optimal map-reduce framework and deep learning"}, {"paperId": "28c47724fe63126ebb4af557d0c13115711c4532", "title": "Blockchain-Based Federated Learning-Convolutional Neural Network for Preserving Data Privacy and Security"}, {"paperId": "c88ade10312a20d4a540e476f2ae10727fc7f37b", "title": "Hierarchical Federated Learning-Based Method for privacy-preserving in the Healthcare Environment"}, {"paperId": "81dd30876a76548a1e42a8a3332efc0b12fd4468", "title": "Analysis of Optimization Strategies for Big Data Storage Management: A Study"}, {"paperId": "251889b36b4ceaba93f715e8c057119686406e85", "title": "A Novel Cloud Enabled Access Control Model for Preserving the Security and Privacy of Medical Big Data"}, {"paperId": "e294d5d4adabbe4b87b652e1909359426f450e12", "title": "PPSecS: Privacy-Preserving Secure Big Data Storage in a Cloud Environment"}, {"paperId": "454def0b566dcabcee8bf372361ce7bbbd21e56a", "title": "Advanced Privacy-Aware Protocol Placement in Cloud Security"}, {"paperId": "96131dadbbcd831062a2d53d710e879dec846949", "title": "Deep intelligent blockchain technology for securing IoT-based healthcare multimedia data"}, {"paperId": "0e1373f44ad8de4601bf67577962aeae0f857440", "title": "FPGA Implementation of Novel Triple Data Encryption Standard for High Speed Network Security Comparison with DES"}, {"paperId": "7314350a1bef6bda2dda209e933b6cc415951ac2", "title": "A Multi-objective Weight based Optimal Cluster Head Selection for Lifetime Augmentation in IoT based Heterogeneous Wireless Sensor Networks"}, {"paperId": "0096de5f24a81dcb2e21dd63652918dc930e5827", "title": "Churn Prediction in Financial Risk Management using Deep Learning Techniques"}, {"paperId": "fc98bc11fdd0656b554fb1b435e036ffbfebbad9", "title": "Detection of Leukemia from Histopathological Image using Deep Learning Techniques"}, {"paperId": "c89028459986570853f730eed4e111ef421e6bb3", "title": "A Novel Machine Learning-Based Artificial Voice Box"}, {"paperId": "bdc0bfba9a8ab8e0010b08cd5b6c0d6dfe4c091e", "title": "A Novel Transfer Learning Technique for Rice Leaf Disease Detection"}, {"paperId": "90eba8be482e270620f2d8a3ee393396d1a302ba", "title": "An Empirical Analysis on Detection and Recognition of Intra-Cranial Hemorrhage (ICH) using 3D Computed Tomography (CT) images"}, {"paperId": "3b094656c16bec50768adf23fbea83222f7bc1d8", "title": "Studying the Security and Privacy Issues of Big Data in the Saudi Medical Sector"}]}
