{"paperId": "b90ac31335d729e40bf17a96c0fd1c052dd4bb2d", "publicationVenue": {"id": "f6752838-f268-4a1b-87e7-c5f30a36713c", "name": "International Conference on Machine Learning and Applications", "type": "conference", "alternate_names": ["Int Conf Mach Learn Appl", "ICMLA"], "url": "http://www.icmla-conference.org/"}, "title": "TranSQL: A Transformer-based Model for Classifying SQL Queries", "abstract": "Domain-Specific Languages (DSL) are becoming popular in various fields as they enable domain experts to focus on domain-specific concepts rather than software-specific ones. Many domain experts usually reuse their previously-written scripts for writing new ones; however, to make this process straightforward, there is a need for techniques that can enable domain experts to find existing relevant scripts easily. One fundamental component of such a technique is a model for identifying similar DSL scripts. Nevertheless, the inherent nature of DSLs and lack of data makes building such a model challenging. Hence, in this work, we propose TRANSQL, a transformer-based model for classifying DSL scripts based on their similarities, considering their few-shot context. We build TRANSQL using BERT and GPT-3, two performant language models. Our experiments focus on SQL as one of the most commonly-used DSLs. The experiment results reveal that the BERT-based TRANSQL cannot perform well for DSLs since they need extensive data for the fine-tuning phase. However, the GPT-based TRANSQL gives markedly better and more promising results.", "venue": "International Conference on Machine Learning and Applications", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-12-01", "journal": {"name": "2022 21st IEEE International Conference on Machine Learning and Applications (ICMLA)", "pages": "788-793"}, "authors": [{"authorId": "1412505149", "name": "Shirin Tahmasebi"}, {"authorId": "1702571", "name": "A. H. Payberah"}, {"authorId": "153750193", "name": "A. Soylu"}, {"authorId": "66215591", "name": "D. Roman"}, {"authorId": "1709399", "name": "M. Matskin"}], "citations": [{"paperId": "8155ce12b69686d4ca406fecb024aa1fea63c73f", "title": "TRANSQLATION: TRANsformer-based SQL RecommendATION"}]}
