{"paperId": "b91731f53da675724f822d8e3468c046de3b4954", "publicationVenue": {"id": "987139ae-a65d-49bb-aaf6-fb764dc40b19", "name": "Expert systems with applications", "type": "journal", "alternate_names": ["Expert syst appl", "Expert Systems With Applications", "Expert Syst Appl"], "issn": "0957-4174", "url": "https://www.journals.elsevier.com/expert-systems-with-applications/", "alternate_urls": ["https://www.sciencedirect.com/journal/expert-systems-with-applications", "http://www.sciencedirect.com/science/journal/09574174"]}, "title": "CasSeqGCN: Combining Network Structure and Temporal Sequence to Predict Information Cascades", "abstract": "One important task in the study of information cascade is to predict the future recipients of a message given its past spreading trajectory. While the network structure serves as the backbone of the spreading, an accurate prediction can hardly be made without the knowledge of the dynamics on the network. The temporal information in the spreading sequence captures many hidden features, but predictions based on sequence alone have their limitations. Recent efforts start to explore the possibility of combining both the network structure and the temporal feature. Here, we propose a new end-to-end prediction method CasSeqGCN in which the structure and temporal feature are simultaneously taken into account. A cascade is divided into multiple snapshots which record the network topology and the state of nodes. The graph convolutional network (GCN) is used to learn the representation of a snapshot. A novel aggregation method based on dynamic routing is proposed to aggregate node representation and the long short-term memory (LSTM) model is used to extract temporal information. CasSeqGCN predicts the future cascade size more accurately compared with other state-of-art baseline methods. The ablation study demonstrates that the improvement mainly comes from the design of the input and the GCN layer. We explicitly design an experiment to show the quality of the cascade representation learned by our approach is better than other methods. Our work proposes a new approach to combine the structural and temporal features, which not only gives a useful baseline model for future studies of cascade prediction, but also brings new insights on a wide collection of problems related with dynamics on and of the network.", "venue": "Expert systems with applications", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-10-13", "journal": {"name": "ArXiv", "volume": "abs/2110.06836"}, "authors": [{"authorId": "2107986898", "name": "Yansong Wang"}, {"authorId": "47119090", "name": "Xiaomeng Wang"}, {"authorId": "1680311", "name": "Radosław Michalski"}, {"authorId": "1491395955", "name": "Yijun Ran"}, {"authorId": "49535929", "name": "Tao Jia"}], "citations": [{"paperId": "467425ddaebe6e9165b913711de3c4c6c086369b", "title": "Predicting Viral Rumors and Vulnerable Users for Infodemic Surveillance"}, {"paperId": "03ea26a45ff62e39fd26079e9aba06f6b5b30e98", "title": "Predicting viral rumors and vulnerable users with graph-based neural multi-task learning for infodemic surveillance"}, {"paperId": "5c7cd86ac0936110a3e9580ce9b49bbf57e83bdb", "title": "No Two Users Are Alike: Generating Audiences with Neural Clustering for Temporal Point Processes"}, {"paperId": "7ff7beeef552fe7b4fa01d2ffa24ca819797c19b", "title": "Transmission Line Fittings Defect Recognition Method Based on Knowledge Enhancement"}, {"paperId": "231507d27174dddf62b08625570ce528ee516f48", "title": "Persistence Augmented Graph Convolution Network for Information Popularity Prediction"}, {"paperId": "5efac92f2317c7971e3242f1ce087e3d14a8e9b5", "title": "Tempnet: A graph convolutional network for temperature field prediction of fire-damaged concrete"}, {"paperId": "4a71ecf9f44e1a7f7ac4c778d1705d26e211a43b", "title": "A performance characteristic curve for model evaluation: the application in information diffusion prediction"}, {"paperId": "a3fe74c2b13267e13b37face1177e9bebff4673a", "title": "Predicting information diffusion using the inter- and intra-path of influence transitivity"}, {"paperId": "4275a8b28412d5d8e4de54c3711a70b921dce323", "title": "A Survey of Information Dissemination Model, Datasets, and Insight"}, {"paperId": "7d164f130843492d14d2ded68c1a6b2be2ffd38e", "title": "A tale of two roles: exploring topic-specific susceptibility and influence in cascade prediction"}, {"paperId": "8f9b2595d946e150616ebc57c8c7de22ec01d686", "title": "CasTemporalGCN: early cascade growth prediction with considering temporal features based on graph convolutional networks"}, {"paperId": "d5c0228a464f9e05588e3a0ef047ebb053cd355d", "title": "CasCIFF: A Cross-Domain Information Fusion Framework Tailored for Cascade Prediction in Social Networks"}, {"paperId": "285f89a3dca7f015300fe4ac7e62e5237657d1df", "title": "Community-based Dynamic Graph Learning for Popularity Prediction"}, {"paperId": "d3543628b6b6c44beeda59ff8bf5a6d32201fe23", "title": "Information diffusion prediction based on cascade sequences and social topology"}, {"paperId": "eaf9cc149d0b42d6f42007f1f2d062f00f9ae5a9", "title": "CasTformer: A novel cascade transformer towards predicting information diffusion"}, {"paperId": "c3e86ec15f3fbcbeda23662fc227a992540cd304", "title": "Dynamic End-to-End Information Cascade Prediction Based on Neural Networks and Snapshot Capture"}, {"paperId": "cde0075f46f4565e7cb83b80ecb0ad3239e99905", "title": "Dynamic Link Prediction Using Graph Representation Learning with Enhanced Structure and Temporal Information"}, {"paperId": "abec54a051fcbbcfe9bd2781fff878c42a62b3b1", "title": "Explicit time embedding based cascade attention network for information popularity prediction"}, {"paperId": "73d6d9db9ffbbc566d1461186d3affa5c9c9bef9", "title": "Significant Ties Graph Neural Networks for Continuous-Time Temporal Networks Modeling"}, {"paperId": "149b29a56a4f7969386bf908bcee3d3c2dd483ee", "title": "Graph Representation Learning for Popularity Prediction Problem: A Survey"}, {"paperId": "9aa91aeb82a865ab678bfdde2fb409ce6edc995e", "title": "Multi‐scale graph capsule with influence attention for information cascades prediction"}, {"paperId": "a388e605fde608beacc7b72ea5e33407dae93d9f", "title": "CoarSAS2hvec: Heterogeneous Information Network Embedding with Balanced Network Sampling"}, {"paperId": "d382dd36c6af014bd70f3eaa21bb7d37f3d86af1", "title": "Joint Inference of Diffusion and Structure in Partially Observed Social Networks Using Coupled Matrix Factorization"}, {"paperId": "8f3ca3937df08955591f8aa5676dac0349374c75", "title": "Information diffusion analysis in online social networks based on deep representation learning"}]}
