{"paperId": "b918f87251a73bd983a454a59b8468ae80d71c7d", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "IoT Intrusion Detection Taxonomy, Reference Architecture, and Analyses", "abstract": "This paper surveys the deep learning (DL) approaches for intrusion-detection systems (IDSs) in Internet of Things (IoT) and the associated datasets toward identifying gaps, weaknesses, and a neutral reference architecture. A comparative study of IDSs is provided, with a review of anomaly-based IDSs on DL approaches, which include supervised, unsupervised, and hybrid methods. All techniques in these three categories have essentially been used in IoT environments. To date, only a few have been used in the anomaly-based IDS for IoT. For each of these anomaly-based IDSs, the implementation of the four categories of feature(s) extraction, classification, prediction, and regression were evaluated. We studied important performance metrics and benchmark detection rates, including the requisite efficiency of the various methods. Four machine learning algorithms were evaluated for classification purposes: Logistic Regression (LR), Support Vector Machine (SVM), Decision Tree (DT), and an Artificial Neural Network (ANN). Therefore, we compared each via the Receiver Operating Characteristic (ROC) curve. The study model exhibits promising outcomes for all classes of attacks. The scope of our analysis examines attacks targeting the IoT ecosystem using empirically based, simulation-generated datasets (namely the Bot-IoT and the IoTID20 datasets).", "venue": "Italian National Conference on Sensors", "year": 2021, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2021-09-26", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "21"}, "authors": [{"authorId": "1564565864", "name": "Khalid Albulayhi"}, {"authorId": "1500528508", "name": "A. A. Smadi"}, {"authorId": "1799186", "name": "Frederick T. Sheldon"}, {"authorId": "1780072", "name": "R. Abercrombie"}], "citations": [{"paperId": "b15615850bd65c9c4c0363ea122232e4a6770c2d", "title": "Machine Learning and Deep Learning Techniques for Internet of Things Network Anomaly Detection—Current Research Trends"}, {"paperId": "70bf37bf42687d93666f6f8dd4614347c08fc3c7", "title": "A Novel Data Preprocessing Model for Lightweight Sensory IoT Intrusion Detection"}, {"paperId": "62e834754cc4f9be967b7f86bf8b0c11f8d01a64", "title": "A Two-Layer Dimension Reduction and Two-Tier Classification Model for Anomaly-Based Intrusion Detection In IOT"}, {"paperId": "dfa23cf4be9ceaf8be19b847894ff48f90a45294", "title": "Intrusion detection system using metaheuristic fireworks optimization based feature selection with deep learning on Internet of Things environment"}, {"paperId": "262383ee7f358a2639002c05d3480bb90dc9772e", "title": "A lightweight intrusion detection method for IoT based on deep learning and dynamic quantization"}, {"paperId": "fb2436e4b74321c93981ff374285a925347250e1", "title": "A data-driven approach for intrusion and anomaly detection using automated machine learning for the Internet of Things"}, {"paperId": "562904da20b01b09400f08bf72a97f738db63262", "title": "Joined Bi-model RNN with spatial attention and GAN based IoT botnet attacks detection"}, {"paperId": "a3556277f7d5f24bf4d6cb843d44009ff4585d28", "title": "Is there a Trojan! : Literature survey and critical evaluation of the latest ML based modern intrusion detection systems in IoT environments"}, {"paperId": "eee2589ab49093b97db6544f0b201bdd7fbaf136", "title": "An Adaptive Ensemble Framework for Addressing Concept Drift in IoT Data Streams"}, {"paperId": "b0f9bb9a4dd3de39126b66c7c6137145ca924183", "title": "A Comprehensive Survey for IoT Security Datasets Taxonomy, Classification and Machine Learning Mechanisms"}, {"paperId": "2bca863eece1fc4c91dcf5c136e1564798b30132", "title": "Exploration of CNN with Node Centred Intrusion Detection Structure Plan for Green Cloud"}, {"paperId": "e9f466b8fb0fa58ff2960b1f54b2f9eb6446c6c0", "title": "Anomaly-based cyberattacks detection for smart homes: A systematic literature review"}, {"paperId": "251040caa0a9fde986a72e86348b4e10c71e4505", "title": "A Lightweight Double-Stage Scheme to Identify Malicious DNS over HTTPS Traffic Using a Hybrid Learning Approach"}, {"paperId": "7c36d16d82701e948d667feb1582c17037ff0bf2", "title": "Non-Contact and Non-Intrusive Add-on IoT Device for Wireless Remote Elevator Control"}, {"paperId": "540dd717459c38e320dace064dc8cfa5b674e2d7", "title": "A Systematic and Comprehensive Survey of Recent Advances in Intrusion Detection Systems Using Machine Learning: Deep Learning, Datasets, and Attack Taxonomy"}, {"paperId": "cea9b03698ae20b40b46b57e1529e2426a8eda41", "title": "IoT-Based Smart Air Conditioner as a Preventive in the Post-COVID-19 Era: A Review"}, {"paperId": "e1ddad8146267d97972a87d8d1948a80fb30a671", "title": "Spyware Identification for Android Systems Using Fine Trees"}, {"paperId": "6e66d4cb3be86d18d761de7e6491fb9f974933e4", "title": "MFTransNet: A Multi-Modal Fusion with CNN-Transformer Network for Semantic Segmentation of HSR Remote Sensing Images"}, {"paperId": "6c135086e8f44db29ab0586d4cb0c59335725e4c", "title": "Early-stage Malware and Ransomware Forecasting in the Short-Term Future Using Regression-based Neural Network Technique"}, {"paperId": "31af9763f1307ea5c04c9615e61e783defa3ddd7", "title": "An Intrusion Detection and Classification System for IoT Traffic with Improved Data Engineering"}, {"paperId": "b25f2f3b9472c3ad6c443f85a3c7e717d65dd45d", "title": "Framing Network Flow for Anomaly Detection Using Image Recognition and Federated Learning"}, {"paperId": "2ab69477993c32a219c813a4bd1ae35380f111c5", "title": "Evaluating Machine Learning Methods for Intrusion Detection in IoT"}, {"paperId": "2b4784a27c781d268923c769b501cb0536a60331", "title": "A Survey: Soft Computing for Anomaly Detection to Mitigate IoT Abuse"}, {"paperId": "57f80fb15184f732f6503f1e2bbddbed69ddeeb7", "title": "IoT Intrusion Detection Using Machine Learning with a Novel High Performing Feature Selection Method"}, {"paperId": "2f8d772848c2df9d5fa17fd84bcd274ba03b6c91", "title": "ELBA-IoT: An Ensemble Learning Model for Botnet Attack Detection in IoT Networks"}, {"paperId": "5370e8a28774178aac93658284ee552357133416", "title": "Multi-Aspect Based Approach to Attack Detection in IoT Clouds"}, {"paperId": "2a737dd8c5b31f49d9a1796f68705c961d4c3071", "title": "Machine-Learning-Based Darknet Traffic Detection System for IoT Applications"}, {"paperId": "4228be3804b4abd358c2a18ac1110368c37a64e2", "title": "IoT Security Challenges: Cloud and Blockchain, Postquantum Cryptography, and Evolutionary Techniques"}, {"paperId": "3aa50415fe6e4f084f0cbe001fb6a00c8ac8fa3a", "title": "Challenges of Malware Detection in the IoT and a Review of Artificial Immune System Approaches"}, {"paperId": "9562a5691fba4b2c2cc6a6435a33968ccf15fc58", "title": "Meticulously Intelligent Identification System for Smart Grid Network Stability to Optimize Risk Management"}, {"paperId": "f63f4c8308a24f7e184fa2e999292270a15ce461", "title": "AEWAE: An Efﬁcient Ensemble Framework for Concept Drift Adaptation in IoT Data Stream"}, {"paperId": "9288c01b5cf1d80f86c4dbaea0f4c8e68032215b", "title": "SDN Architecture for Smart Homes Security with Machine Learning and Deep Learning"}, {"paperId": "cd1e35135c998fdc46a786f2f74fc7d96793073a", "title": "A Data-Centric Anomaly-Based Detection System for Interactive Machine Learning Setups"}]}
