{"paperId": "b92278ee33a6147bbf78255ffdb7bc81cf38d0c1", "publicationVenue": {"id": "7f92b1d2-f2b3-454d-adbe-ff02c83fe404", "name": "IEEE Conference on Computer Communications", "type": "conference", "alternate_names": ["INFOCOM", "IEEE Conf Comput Commun"], "url": "http://www.ieee-infocom.org/"}, "title": "Adaptive Configuration for Heterogeneous Participants in Decentralized Federated Learning", "abstract": "Data generated at the network edge can be processed locally by leveraging the paradigm of edge computing (EC). Aided by EC, decentralized federated learning (DFL), which overcomes the single-point-of-failure problem in the parameter server (PS) based federated learning, is becoming a practical and popular approach for machine learning over distributed data. However, DFL faces two critical challenges, i.e., system heterogeneity and statistical heterogeneity introduced by edge devices. To ensure fast convergence with the existence of slow edge devices, we present an efficient DFL method, termed FedHP, which integrates adaptive control of both local updating frequency and network topology to better support the heterogeneous participants. We establish a theoretical relationship between local updating frequency and network topology regarding model training performance and obtain a convergence upper bound. Upon this, we propose an optimization algorithm, that adaptively determines local updating frequencies and constructs the network topology, so as to speed up convergence and improve the model accuracy. Evaluation results show that the proposed FedHP can reduce the completion time by about 51% and improve model accuracy by at least 5% in heterogeneous scenarios, compared with the baselines.", "venue": "IEEE Conference on Computer Communications", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-12-05", "journal": {"name": "IEEE INFOCOM 2023 - IEEE Conference on Computer Communications", "pages": "1-10"}, "authors": [{"authorId": "2174566804", "name": "Yunming Liao"}, {"authorId": "2129093616", "name": "Yang Xu"}, {"authorId": "1779748", "name": "Hongli Xu"}, {"authorId": "2153519138", "name": "Lun Wang"}, {"authorId": "2131370808", "name": "Chen Qian"}], "citations": [{"paperId": "ed821fc317debb8dae5258c2194b4594d8812e8d", "title": "FedLC: Accelerating Asynchronous Federated Learning in Edge Computing"}, {"paperId": "8e0bbdb1b3573bbec3034d473f04a03baef5024c", "title": "Adaptive Block-Wise Regularization and Knowledge Distillation for Enhancing Federated Learning"}, {"paperId": "c6c5c320b2fa9e91f96d6897a43fe0ce7c65901e", "title": "Federated Learning While Providing Model as a Service: Joint Training and Inference Optimization"}, {"paperId": "fc30e163a040c57378b37df5cade3c5b412abe49", "title": "FedCD: A Hybrid Centralized-Decentralized Architecture for Efficient Federated Learning"}, {"paperId": "407d375249fe628ee350665a82f7aa1b455f3e7c", "title": "Heroes: Lightweight Federated Learning with Neural Composition and Adaptive Local Update in Heterogeneous Edge Networks"}, {"paperId": "85db902984af83ecda5b38736f9ba190106bd2e5", "title": "MergeSFL: Split Federated Learning with Feature Merging and Batch Size Regulation"}, {"paperId": "5616304b89dd2fd9e906f4840bcf494fa563f731", "title": "Poster: Verifiable Blockchain-Based Decentralized Learning"}, {"paperId": "3b112cc32e11536672eebde30fa17711b3629755", "title": "Secure Decentralized Learning with Blockchain"}]}
