{"paperId": "b929f1589fc84e56bab6ca8021976ee83c71397a", "publicationVenue": {"id": "ca2cf7d7-0fd9-4338-b72f-48b0a5d6412c", "name": "Conference of the Centre for Advanced Studies on Collaborative Research", "type": "conference", "alternate_names": ["Conf Cent Adv Stud Collab Res", "CASCON"], "url": "http://cas.ibm.com/"}, "title": "A semi-automated framework for migrating web applications from SQL to document oriented NoSQL database", "abstract": "Non-relational databases, such as NoSQL , play a major role enabling web applications to manipulate flexible data. Non-relational databases have different strengths from relational databases and are optimized to scale dynamic data such as that used by posts by users in social media, producing terabytes of data. As businesses scale, they need to migrate legacy relational applications to use NoSQL techniques. There are two parts to the migration: the migration of the schema and data, and the migration of the application source code. In this paper, we present a semi-automated approach to solve the second part. We migrate and optimize the embedded SQL queries to interact with the new database API and change the application code to use the new queries.", "venue": "Conference of the Centre for Advanced Studies on Collaborative Research", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"pages": "44-53"}, "authors": [{"authorId": "1661041533", "name": "Rahma S. Al Mahruqi"}, {"authorId": "2613665", "name": "Manar H. Alalfi"}, {"authorId": "1716997", "name": "T. Dean"}], "citations": [{"paperId": "d871e6d937552c8ce1cda61f623642d287e1fc67", "title": "CRUD Operation on WordPress Database Using C# SQL Client"}, {"paperId": "6408b3b5285eaf33979cbadf35b4bea808e60d36", "title": "CRUD Operation on WordPress Database Using C# And REST API"}, {"paperId": "8784f88b5486830757d191b8a400e5e8f1117a09", "title": "Automated Tool for NoSQL to SQL Migration"}, {"paperId": "a94d9604524e1bb947e4f326a9a7b10eb89ba332", "title": "Translating a Distributed Relational Database to a Document Database"}, {"paperId": "a8ddddafba1cedc1130d1085fb6b55a74d6af44a", "title": "An Enhanced Entity Model for Converting Relational to Non-Relational Documents in Hospital Management System Based on Cloud Computing"}, {"paperId": "1d668da0667b41125cc682d8b09122321b5b43e3", "title": "Auto JSON: An Automatic Transformation Model for Converting Relational Database to Non-relational Documents"}, {"paperId": "cb85d94b09881406adca2ffa9e5d060d1daba503", "title": "FULLY AUTOMATED DATA WAREHOUSE FRAMEWORK USING ETL PROCESS FOR DECISION SUPPORT SYSTEM"}]}
