{"paperId": "b93169efcad272b4f473ac8c08ee76d3c9867c3b", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Semi-Supervised Transfer Learning Methodology for Fault Detection and Diagnosis in Air-Handling Units", "abstract": "Heating, ventilation and air-conditioning (HVAC) systems are the major energy consumers among buildings’ equipment. Reliable fault detection and diagnosis schemes can effectively reduce their energy consumption and maintenance costs. In this respect, data-driven approaches have shown impressive results, but their accuracy depends on the availability of representative data to train the models, which is not common in real applications. For this reason, transfer learning is attracting growing attention since it tackles the problem by leveraging the knowledge between datasets, increasing the representativeness of fault scenarios. However, to date, research on transfer learning for heating, ventilation and air-conditioning has mostly been focused on learning algorithmic, overlooking the importance of a proper domain similarity analysis over the available data. Thus, this study proposes the design of a transfer learning approach based on a specific data selection methodology to tackle dissimilarity issues. The procedure is supported by neural network models and the analysis of eventual prediction uncertainties resulting from the assessment of the target application samples. To verify the proposed methodology, it is applied to a semi-supervised transfer learning case study composed of two publicly available air-handling unit datasets containing some fault scenarios. Results emphasize the potential of the proposed domain dissimilarity analysis reaching a classification accuracy of 92% under a transfer learning framework, an increase of 37% in comparison to classical approaches.", "venue": "Applied Sciences", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-09-02", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "1416224624", "name": "Víctor Martínez-Viol"}, {"authorId": "123772228", "name": "E. Urbano"}, {"authorId": "2184437946", "name": "Jose E. Torres Rangel"}, {"authorId": "1405016925", "name": "M. Delgado-Prieto"}, {"authorId": "1738419", "name": "L. Romeral"}], "citations": [{"paperId": "5afc1c668b801e96349e9152a51a98f28d701b0f", "title": "AI in HVAC fault detection and diagnosis: A systematic review"}, {"paperId": "baf46c0e4112758da15442ef85b2b2f0ac9e6774", "title": "A Modified Transformer and Adapter-based Transfer Learning for Fault Detection and Diagnosis in HVAC systems"}, {"paperId": "a44a85720af19d92530cca25a695891022391b84", "title": "Transfer learning methodology for machine learning based fault detection and diagnostics applied to building services"}, {"paperId": "1eb1fef8dccecd9ecd17434f3d44a8479e978041", "title": "New Trends in Efficient Buildings"}, {"paperId": "5caba2858f375e8935027b42f03ff03b6c505ed6", "title": "A Comprehensive Review of the Applications of Machine Learning for HVAC"}, {"paperId": "46c2ee5f90589b03275c5f0df47aaf876144a860", "title": "Development of Anomaly Detectors for HVAC Systems Using Machine Learning"}]}
