{"paperId": "b9334268762fdce0d6471f431ea8da9c08ea24cc", "publicationVenue": {"id": "ba34b1d8-ab70-4f80-96b5-97a5b161f9df", "name": "AIP Advances", "type": "journal", "alternate_names": ["AIP Adv"], "issn": "2158-3226", "url": "http://aipadvances.aip.org/", "alternate_urls": ["http://aip.scitation.org/journal/adv/", "https://aip.scitation.org/journal/adv/"]}, "title": "Remaining useful life prediction for equipment based on RF-BiLSTM", "abstract": "The prediction technology of remaining useful life has received a lot attention to ensure the reliability and stability of complex mechanical equipment. Due to the large-scale, non-linear, and high-dimensional characteristics of monitoring data, machine learning does not need an exact physical model and prior expert knowledge. It has robust data processing ability, which shows a broad prospect in the field of life prediction of complex mechanical and electrical equipment. Therefore, a remaining useful life prediction algorithm based on Random Forest and Bi-directional Long Short-Term Memory (RF-BiLSTM) is proposed. In the RF-BiLSTM algorithm, RF is utilized to extract health indicators that reflect the life of the equipment. On this basis, a BiLSTM neural network is used to predict the residual life of the device. The effectiveness and advanced performance of RF-BiLSTM are verified in commercial modular aviation propulsion system datasets. The experimental results show that the RMSE of the RF-BiLSTM is 0.3892, which is 47.96%, 84.81%, 38.89%, and 86.53% lower than that of LSTM, SVR, XGBoost, and AdaBoost, respectively. It is verified that RF-BiLSTM can effectively improve the prediction accuracy of the remaining useful life of complex mechanical and electrical equipment, and it has certain application value.", "venue": "AIP Advances", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-11-01", "journal": {"name": "AIP Advances"}, "authors": [{"authorId": "2146254959", "name": "Zhiqiang Wu"}, {"authorId": "2108229359", "name": "Zhenxi Wang"}, {"authorId": "2152788815", "name": "Huihui Wei"}, {"authorId": "9031331", "name": "Jianji Ren"}, {"authorId": "31447870", "name": "Yongliang Yuan"}, {"authorId": "2190035447", "name": "Taijie Wang"}, {"authorId": "1379743514", "name": "Wenxian Duan"}, {"authorId": "2208580981", "name": "Hefan Wei"}, {"authorId": "2154701963", "name": "Shukai Wang"}], "citations": [{"paperId": "6ac95799c0f61b4694e8ab64b1c1cab4c6010239", "title": "Surface depression recognition of spring plate based on feature construction and improved AdaBoost algorithm"}, {"paperId": "11fa4f1aa0b7d83ee7822643cabf814baeb1ce69", "title": "Daily natural gas load prediction method based on APSO optimization and Attention-BiLSTM"}, {"paperId": "6f9b66e76310de60c66bb8dad6cfdf913ea51009", "title": "Remaining useful life prediction framework of equipment based on improved golden jackal algorithm assisted-LSTM"}, {"paperId": "e638679bc0550269b6f19cd0a80c270361dc31a9", "title": "Engine remaining useful life prediction based on PSO optimized multi-layer long short-term memory and multi-source information fusion"}, {"paperId": "af9bfe789a860ac0b877fa01c51595575b24dfbc", "title": "Stacking strategy-assisted random forest algorithm and its application"}]}
