{"paperId": "b93a7c0da5e1db4f38e6c02fc7bf9098cf4360ae", "publicationVenue": {"id": "ef7ffa98-c6c0-456e-b34e-89afdd3fa947", "name": "IEEE Internet of Things Magazine", "type": "journal", "alternate_names": ["IEEE Internet Thing Mag"], "issn": "2576-3180", "url": "https://www.comsoc.org/publications/magazines/ieee-internet-things-magazine", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=8548628", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=8548628&punumber=8548628"]}, "title": "Opportunistic Multi-Drone Networks: Filling the Spatiotemporal Holes of Collaborative and Distributed Applications", "abstract": "Opportunistic networks provide the underlying foundations to enable collaborative and distributed applications close to users. These applications exploit the temporal and spatial availability of proximal devices to share the execution of different tasks ranging from sensing to networking. A key limitation of these networks is its short life span and limited coverage. In this article, we present a research vision in which spatiotemporal holes between opportunistic networks are filled through the deployment of autonomous drones acting as intelligent proxies. By doing this, it is then possible to augment the coverage of these networks as well as to improve the availability of opportunities to find collaborators. Through a rigorous analysis that considers a dataset captured by a cellular operator, we demonstrate the feasibility of the vision and highlight a road map of research challenges that have to be fulfilled to achieve it. Our results suggest that while several opportunistic networks emerge during the day in different urban locations, these networks tend to be of small size and isolated. However, by using autonomous drones to interconnect these networks, it is possible to augment the surrounding availability of proximal devices by almost 3x times.", "venue": "IEEE Internet of Things Magazine", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-03-01", "journal": {"name": "IEEE Internet of Things Magazine", "pages": "94-100", "volume": "7"}, "authors": [{"authorId": "2280486952", "name": "Huber Flores"}], "citations": []}
