{"paperId": "b941ee5d061615354d6bfbda60da4066f4361dd4", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Resource Pricing Model Based on Two-Level Auction for the Cloudlet Federation", "abstract": "CloudLet Federation (CLF) is a new computing architecture that integrates multiple Cloudlet Service Providers (CSPs) and shares cloudlet resources between them. This architecture can reduce the cost of cloudlet deployment and management, and improve the cloudlet utilization rate and service quality. As a new service provider framework, CLF needs to maximize the overall profit while ensuring the interests of each member. Due to the differences in the number of users owned by each member and the number of resources that can be provided, the interests of CLF and users, as well as the interests of each member of CLF, should be taken into account when pricing resources. Therefore, we construct a resource pricing model based on two-level auction, aiming at maximizing the total profit of the cloudlet federation. Firstly, the user and its associated CSP will conduct an auction. If the user task fails to be auctioned successfully, the associated CSP will conduct a second-level auction with the other CSP of the federation. We design a dynamic quotation and price adjustment strategy, in which the cost and resource utilization rate are taken into account when determining the asking prices of the resource providers and the task budget and deadline are taken into account when determining the quotations of the resource demanders. The algorithm of TARPA (Resource Pricing Algorithm based on Two-level Auction) is proposed to solve this model. The simulation results show that TARPA has better performance than Uniform Pricing Algorithm (UPA) and Fixed Proportion Pricing Algorithm (FPPA) in terms of the total profit and resource utilization of cloudlet federation, and has obvious advantages than Game Pricing Approach (GPA) in terms of time cost.", "venue": "IEEE Access", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "42479-42489", "volume": "12"}, "authors": [{"authorId": "2291314583", "name": "Yihui Chen"}, {"authorId": "2868782", "name": "Hengzhou Ye"}, {"authorId": "2109281787", "name": "Xinxiao Li"}], "citations": []}
