{"paperId": "b943f6d3e38ca01f0bd89dc2eb79b2defe253567", "publicationVenue": null, "title": "QOMPLIANCE: Declarative Data-Centric Policy Compliance", "abstract": "Data compliance is essential in industry applications to ensure that organizations do not run afoul of data protection and privacy legislation. Geographically distributed data is an especially relevant topic because of recent developments in cross-border data protection agreements, e.g., between the United States and the European Union. We report our experience of designing and implementing QOMPLIANCE, a system for automated data-centric compliance evaluation in cloud environments. Our approach fills a gap in the research for higher-level data-centric compliance systems with a particular focus on geographically distributed data. Its declarative and extensible policy model allows for defining policies that can govern data movements across borders and is intended to be understandable without explicit knowledge of the governed data by employing a tag-based abstraction layer. The particular challenge is to automate data-centric policy compliance on data movements in a maintainable manner. QOMPLIANCE analyzes SQL-defined data movements to extract what data is being addressed and combines this information with additional attributes to statically match policies. Policies decide whether data movements are allowed and specify requirements on the query and the execution that should be enforced. We provide a qualitative comparison between our approach and related work, and we performed a performance analysis which shows that compliance evaluation can be done in seconds for large sets of policies.", "venue": "2023 IEEE Asia-Pacific Conference on Computer Science and Data Engineering (CSDE)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-12-04", "journal": {"name": "2023 IEEE Asia-Pacific Conference on Computer Science and Data Engineering (CSDE)", "pages": "01-08"}, "authors": [{"authorId": "2295146232", "name": "Daan Oudejans"}, {"authorId": "2295139394", "name": "Anton Zorin"}, {"authorId": "2295139365", "name": "Jan S. Rellermeyer"}], "citations": []}
