{"paperId": "b952a019af69d97324f021fa987a4f46804e486f", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Learners on Focus: Visualizing Analytics Through an Integrated Model for Learning Analytics in Adaptive Gamified E-Learning", "abstract": "During the Coronavirus pandemic, e-learning systems have proven to be an essential pillar for education. This raises to surface what many studies have addressed earlier; creating a platform that completes the traditional classroom work and maximizes the effectiveness of learning outcomes. Striving to achieve such platform, studies have considered gamifying and personalizing the educational resources for the adaptation of educational systems as per the intended learners through intensive learning analytics. But was the learner really a part of the adaptation process taking place? Learning analytics are usually designed to the course’s adaptation and solely for the teachers. Thus, learning analytics in gamified adaptive educational systems involving the course, teachers and learners together are still under investigation. In this study, the Personalized Adaptive Gamified E-learning (PAGE) model is introduced to extend MOOCs by providing new satisfactory levels of learning analytics and visualization in the rich e-learning process that supports the learner’s intervention in the resultant learning analytics. The proposed Learning analytics have been developed to make the necessary adaptation to the course and learner’s learning flow, as well as visualizing the process and adaptation decisions to the learners. Results show a positive potential towards learning adaptation and visualization, and a necessity to provide an additional focus for the gamification concept.", "venue": "IEEE Access", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "197597-197616", "volume": "8"}, "authors": [{"authorId": "2023655389", "name": "Yara Maher"}, {"authorId": "9224580", "name": "Sherin M. Moussa"}, {"authorId": "2288779906", "name": "Mohamed Essam Khalifa"}], "citations": [{"paperId": "715f64c763a8f791676f1c97f3188f6a6040781d", "title": "Approaches and game elements used to tailor digital gamification for learning: A systematic literature review"}, {"paperId": "e51fc648f98c9e0ee31356f6c1dda336f478e701", "title": "Gamification in MOOCs: A systematic literature review"}, {"paperId": "a4729bf3713c7db8ebc9832f66c3ec747ff1bd9d", "title": "FGPE+: The Mobile FGPE Environment and the Pareto-Optimized Gamified Programming Exercise Selection Model - An Empirical Evaluation"}, {"paperId": "5c4fbc04fc41871bccbc2f8d4c0b2932d81b96cb", "title": "Metode Systematic Literature Review Efektivitas Platform E-Learning Pada Mahasiswa"}, {"paperId": "b226a2f30bbbffae3828cbab1f885f8e385ae540", "title": "E-Learning Games Enjoyment to Pupils’ Learning Behaviors in Mathematics Classroom"}, {"paperId": "60e6a4cf004454891a52bfa1fb69e5487e9e1be6", "title": "Examining Parameters that Influence the Choice of Learners in Selecting Massive Open Online Courses"}, {"paperId": "b36c7ed2e2c8b12b53148ab753f4da07225d8221", "title": "A comparative analysis of different recommender systems for university major and career domain guidance"}, {"paperId": "30a6b37bf68fb67190bef8a90b698ca624212d7e", "title": "Learner Action Patterns in the Problem-Solving Process Related to Program Code Composition Based on Tracking System Activities"}, {"paperId": "7f1f91583aafb441a8318138419ee4c74a4c8ade", "title": "Establishing novel experimental operation teaching by a click-and-mortar environment"}, {"paperId": "de52162e1c90c7b6416e503b886d503a4cb2c762", "title": "Response of learning analytics to the online education challenges during pandemic: Opportunities and key examples in higher education"}, {"paperId": "6b8d178cda4c4afde741b297fc15ae8f6ce317ea", "title": "Establish a Digital Real-Time Learning System With Push Notifications"}, {"paperId": "afd83e66634ab8c56c2227356173f0169d96ae94", "title": "Assessing the Effects of Gamification on Enhancing Information Security Awareness Knowledge"}, {"paperId": "71e3057e3ac5752a9203b37e48a1f1e1342fc120", "title": "2016-2020 yılları arasında Öğrenme Analitiği ile ilgili Yapılmış SSCI İndeksli Makalelerin Sistematik Olarak İncelenmesi"}, {"paperId": "089f7f2c788d03dd21e111d0289706b14d8c0096", "title": "Learning Preferences Adaptation Based on The Personalized Adaptive Gamified E-Learning (PAGE) Model"}, {"paperId": "ec700321894560796309cd379210f2b1fd9a6632", "title": "Ideating and Developing a Visualization Dashboard to Support Teachers Using Educational Games in the Classroom"}, {"paperId": "f98c839e0a067ee79eac6b80471e031044ed26e7", "title": "Analysis of the Use of Videoconferencing in the Learning Process During the Pandemic at a University in Lima"}, {"paperId": "cd8eb6d0217f88a97ca214d443843f0f4a187c4a", "title": "Impact of Practical Skills on Academic Performance: A Data-Driven Analysis"}]}
