{"paperId": "b953a6b9b973cb42047ad82b1203025b5eb9d827", "publicationVenue": {"id": "3cccf752-9e73-4eaf-80d9-659f7dedc37a", "name": "SAE technical paper series", "alternate_names": ["SAE tech pap ser"], "issn": "0148-7191", "alternate_issns": ["0096-5170"], "url": "https://www.sae.org/publications/technical-papers"}, "title": "Digital-Twin-Based Approaches and Applications for Improving Automotive Cybersecurity in Different Lifecycle Stages", "abstract": "With the increasing connectivity and complexity of modern automobiles, cybersecurity has become one of the most important properties of a vehicle. Various strategies have been proposed to enhance automotive cybersecurity. Digital twin (DT), regarded as one of the top 10 strategic technology trends by Gartner in 2018 and 2019, establishes digital representations in a virtual world and raises new ideas to benefit real-life objects. In this paper, we explored the possibility of using digital twin technology to improve automotive cybersecurity. We designed two kinds of digital twin models, named mirror DT and autonomous DT, and corresponding environments to support cybersecurity design, development, and maintenance in an auto’s lifecycle, as well as technique training. The mirror DT, which displays the external behaviors of the physical object, collects, displays, and analyzes real-time data, for specific purposes like security analysis, anomaly detection, and so on. The autonomous DT models the internal logic of the real-world object, and is applicable for virtual design and debugging, system evaluation, and training in a purely virtual world. We proposed approaches for building the DT models, established a real-virtual interaction environment, and explored several feasible applications. Prototypes were developed to verify the effectiveness and expansibility of the proposed approaches and applications. In summary, DT technology helps engineers to improve work efficiency and effectiveness of cybersecurity design and management activities during the whole product lifecycle. Furthermore, the digital world is also ideal for professional training to help learners to better understand corresponding technics and do more exercises in the virtual world at a low cost.", "venue": "SAE technical paper series", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-04-11", "journal": {"name": "SAE Technical Paper Series"}, "authors": [{"authorId": "2151009997", "name": "Jing Yu"}, {"authorId": "2214031633", "name": "Zeru Lou"}, {"authorId": "49376164", "name": "Hongxing Hu"}, {"authorId": "4166714", "name": "G. Pu"}, {"authorId": "2134563054", "name": "Mingsong Chen"}], "citations": []}
