{"paperId": "b95b7602764486be2109a48902a9d39ed4cc9f2c", "publicationVenue": {"id": "c83b79cc-1dd2-4398-b7c0-7aa8dff254c0", "name": "International Conference on Geographical Information Systems Theory, Applications and Management", "type": "conference", "alternate_names": ["GISTAM", "Int Conf Geogr Inf Syst Theory Appl Manag"], "url": "http://www.gistam.org"}, "title": "An Integrated Environmental Monitoring Approach through the Development of Coal Mine, a GIS Open Source Application", "abstract": ": Coal related fires may occur in un-mined outcrops, during coal mining, in abandoned mines, during storage and transportation and in coal waste deposits. The self-burning of coal mobilizes large amounts of pollutants, for instance, particulate matter, organic compounds and toxic trace elements that can be emitted, released or leached to soils, waters and air of the surrounding environment. The S. Pedro da Cova (Porto, Portugal) coal mine was exploited between 1795 and 1972 and had an important role on the economic development of the region. Nowadays a waste pile of about 28,000 m2 is still deposited in the mine, suffering from self-combustion since 2005. Geographical Information System (GIS) and spatial databases are frequently used for monitoring this type of processes. The main objective of this work was to integrate, manipulate and combine the spatial information obtained in the field with other datasets (geospatial and alphanumerical) in a GIS open source application connected to a relational database (PostGIS), in order to monitor and assess environmental conditions in the S. Pedro da Cova coal mine. This is an ongoing project where some campaigns were conducted and some spatial information was obtained (thermal images, Digital Elevation Model) and also water and soil samples.", "venue": "International Conference on Geographical Information Systems Theory, Applications and Management", "year": 2020, "fieldsOfStudy": ["Environmental Science", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"pages": "286-293"}, "authors": [{"authorId": "145919100", "name": "L. Duarte"}, {"authorId": "2550370", "name": "A. Teodoro"}, {"authorId": "1409223396", "name": "J. Cardoso-Fernandes"}, {"authorId": "134601869", "name": "P. Santos"}, {"authorId": "34996082", "name": "D. Flores"}], "citations": [{"paperId": "40f25543ffefb01b00c7bd023cdb942dc56b7269", "title": "An Integrated Multi-Approach to Environmental Monitoring of a Self-Burning Coal Waste Pile: The São Pedro da Cova Mine (Porto, Portugal) Study Case"}, {"paperId": "977ccdde04bfe2eca02fb640ad8287b10a42fa2d", "title": "Monitoring of soil movement in a self-burning coal waste pile with UAV imagery"}]}
