{"paperId": "b968ede2b3aa9ea3acfafa514b9d91692bf6b2b8", "publicationVenue": {"id": "486f570e-83a7-4e50-975c-c0362754bbd9", "name": "Journal of Computacion y Sistemas", "type": "journal", "alternate_names": ["Comput Sist", "J Comput Sist", "Computación Y Sistemas"], "issn": "1405-5546", "alternate_issns": ["2007-9737"], "url": "http://www.scielo.org.mx/scielo.php?lng=en&pid=1405-5546&script=sci_serial"}, "title": "Performance Analysis of Distributed Computing Frameworks for Big Data Analytics: Hadoop Vs Spark", "abstract": "In the last one decade, the tremendous growth in data emphasizes big data storage and management issues with the highest priorities. For providing better support to software developers for dealing with big data problems, new programming platforms are continuously developing and Hadoop MapReduce is a big game-changer followed by Spark which sets the world of big data on fire with its processing speed and comfortable APIs. Hadoop framework emerged as a leading tool based on the MapReduce programming model with a distributed file system. Spark is on the other hand, recently developed big data analysis and management framework used to explore unlimited underlying features of Big Data. In this research work, a comparative analysis of Hadoop MapReduce and Spark has been presented on the basis of working principle, performance, cost, ease of use, compatibility, data processing, failure tolerance, and security. Experimental analysis has been performed to observe the performance of Hadoop MapReduce and Spark for establishing their suitability under different constraints of the distributed computing environment.", "venue": "Journal of Computacion y Sistemas", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-06-23", "journal": {"name": "Computación y Sistemas", "volume": "24"}, "authors": [{"authorId": "2884003", "name": "Shwet Ketu"}, {"authorId": "144250014", "name": "P. K. Mishra"}, {"authorId": "145092061", "name": "Sonali Agarwal"}], "citations": [{"paperId": "1e7d3ea4720901ababdaae25c2492015c33a6066", "title": "DAG-Based Formal Modeling of Spark Applications with MSVL"}, {"paperId": "172b9c0852681e528f04a421938180c6f56ce711", "title": "Spark-Based Label Diffusion and Label Selection Community Detection Algorithm for Metagenome Sequence Clustering"}, {"paperId": "2f849b9ead5fc104c620198cce6d74fcb82ad090", "title": "Big Data Analytics, Processing Models, Taxonomy of Tools, V’s, and Challenges: State-of-Art Review and Future Implications"}, {"paperId": "51f4a4c70ff96cb7cdd61d363cb3f4264bd63cdd", "title": "An Evaluation of NoSQL Databases Using the Analytical Hierarchy Process (AHP)"}, {"paperId": "5831029b68e60e27192a3c7a594ff0cb32b72a33", "title": "Evaluation of Open-Source Tools for Big Data Processing"}, {"paperId": "a258454b1366a75efd6ca07b16f995983e8d45d8", "title": "Pressure Test: Finding Appropriate Data Size for Practice in Data Science Education"}, {"paperId": "adec44041a02ef32ed59d033a16288e3f86a0255", "title": "Spatial Air Quality Index and Air Pollutant Concentration prediction using Linear Regression based Recursive Feature Elimination with Random Forest Regression (RFERF): a case study in India"}, {"paperId": "0c11fa22a2f5f97c07ef66441e25c96007245a21", "title": "An Information Fusion Technology for Statistical Analysis of Computer Professional Certificates"}, {"paperId": "9bf2ca7ad62807770275ef7895eb447d67d1200a", "title": "A Contemporary Survey on IoT Based Smart Cities: Architecture, Applications, and Open Issues"}, {"paperId": "6b058de401e205c37003471b4f19f5247530a021", "title": "Performance Comparison of Apache Hadoop and Apache Spark for COVID-19 data sets"}, {"paperId": "c46fe83b6b97d1f36b23a67d65f2065517bcdc11", "title": "An Intelligent Fuzzy Decision Tree Algorithm for English Machine Translation"}, {"paperId": "5c15346b4139bbf44c89dee3fdee556c120fbc61", "title": "Design of Intelligent Recognition English Translation Model based on Improved Apriori Algorithm"}, {"paperId": "fbc394dba195d10171daddda0127b2e539b54d7b", "title": "Application Analysis of Hadoop in Big Data Processing"}, {"paperId": "c0610c75d58f9e7d19355f2b7cbabaf1483c5db9", "title": "Jespipe: A Plugin-Based, Open MPI Framework for Adversarial Machine Learning Analysis"}, {"paperId": "7dc719acf5f48d6f3b7932f255b9d4d5b5bb4169", "title": "Internet of Healthcare Things: A contemporary survey"}, {"paperId": "e637941d64c4cd5dc31228391c3070d098be989b", "title": "Scalable kernel-based SVM classification algorithm on imbalance air quality data for proficient healthcare"}, {"paperId": "f1e93ca498a6507ba4dc738bd0959ffdbb1c035f", "title": "Ascendancy of MapReduce with Hadoop for Weather Data and Word Count Analytics"}, {"paperId": "ad260718233acd4881cab6859ab4821cbdd8f84a", "title": "Graph XAI: Graph-agumented AI with Accuracy, Depth, Explainability, and Velocity"}, {"paperId": "03c5f3a6d1d50da7bfc0f50be0f80e8b582f47e2", "title": "Aadhaar Data Analysis Comparison in MapReduce, Hive and Spark"}, {"paperId": "4a55e40b9ab28cdbd22c590fdd4386f0d56323cc", "title": "A MapReduce Algorithm for Minimum Vertex Cover Problems and Its Randomization"}]}
