{"paperId": "b9785b47062b20e7a5a91f247c4cdea0ae948321", "publicationVenue": {"id": "ea0d0233-5a4b-49be-9401-5c8323ae0f5a", "name": "Health Communication", "type": "journal", "alternate_names": ["Health Commun"], "issn": "1041-0236", "url": "http://ejournals.ebsco.com/Journal.asp?JournalID=102176", "alternate_urls": ["http://www.tandfonline.com/loi/hhth20", "https://www.erlbaum.com/shop/tek9.asp?pg=products&specific=1041-0236", "http://www.leaonline.com/loi/hc", "http://www.tandfonline.com/toc/hhth20/current"]}, "title": "A Bibliometric Review of Constituents, Themes, and Trends in Online Medical Consultation Research.", "abstract": "As an emerging form of health care with accelerated growth in recent years, online medical consultation (OMC) has received extensive attention worldwide. Although the number of studies on OMC has increased substantially, few provide a comprehensive and up-to-date review of OMC's research constituents, themes, and trends. This study, therefore, extracted 1,801 OMC-related articles published in English from the Web of Science (WoS) Core Collection database during the past 30 years and employed a bibliometric analysis of WoS and CiteSpace to examine major constituents' distribution, collaboration relationships, themes, and trends. The results indicate that the United States, England, and China contributed the most to the proliferation of OMC studies. The United States had the greatest academic influence and the most collaborative connections, while China demonstrated the sharpest increase and most active development in recent years. However, there is a lack of substantial and close collaboration between researchers worldwide. The main themes of OMC research were Internet hospitals, COVID-19, mixed methods, online health community, and information technology. Researchers have recently shifted their attention to social media, management, efficacy, word of mouth, mental health, and anxiety. This review paper provides researchers and practitioners with a holistic and clear understanding of the features and trends of OMC research. It also identifies potential areas for future OMC research and sheds light on OMC practices.", "venue": "Health Communication", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-12-29", "journal": {"name": "Health communication", "pages": "\n          1-15\n        "}, "authors": [{"authorId": "1740455046", "name": "Wenze Lu"}, {"authorId": "32176250", "name": "C. Ngai"}, {"authorId": "2113296963", "name": "Li Yi"}], "citations": [{"paperId": "e00c2083d93c68c80708cd4679194512ed6abdae", "title": "What is the next step of ICT development? The changes of ICT use in promoting elderly healthcare access: A systematic literature review"}]}
