{"paperId": "b981d111b27dc17b867439d79aff5cfe9c00c0dc", "publicationVenue": {"id": "bea6dbb8-4367-4c35-8e28-e749f3ad107c", "name": "International Conference on Database Theory", "type": "conference", "alternate_names": ["Int Conf Database Theory", "ICDT"], "url": "http://alpha.luc.ac.be/~lucp1080/icdt/"}, "title": "Privacy-Preserving Deep sigmoid NN Classification over Entropy based Cryptosystem in Cloud Environments", "abstract": "In recent years, privacy-preserving data mining has received a lot of attention. Signature creation methods, DNN categorization, and data mining with privacy are studied. Though there are various advantages to the existing privacy-preserving methods there will be some drawbacks too. To overcome the drawbacks in the existing methods, a novel efficient privacy-protection method called Deep NN classification protocol is preferable to an entropy-based signature cryptosystem is proposed for transferring the data kept in third-party CS. Initially, key creation is done and the outsourced data are encrypted, and a signature is generated. Based on the entropy, random numbers are selected. For that selected random numbers the helper value and entropy values are computed. To keep the data secure, an entropy-based signature is generated, and the ciphertext is shown without displaying the generated signature. To allow access to cloud-based data, the user needs to validate both the generated key and the entropy-based signature. The proposed technique protects database security. This approach outperforms other existing methods in terms of Cloud working mechanism time, Encryption, Decryption, Query-Encryption, and security, by the experimental results.", "venue": "International Conference on Database Theory", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-05-11", "journal": {"name": "2023 International Conference on Disruptive Technologies (ICDT)", "pages": "306-312"}, "authors": [{"authorId": "2220369197", "name": "Raghi K. R"}, {"authorId": "2087438922", "name": "A. Paramarthalingam"}], "citations": []}
