{"paperId": "b9865add30cb3c2603ec51b630797a856a7bfbb9", "publicationVenue": {"id": "312ca99c-9149-490d-813e-c60d5e949f65", "name": "Concurrency and Computation", "type": "journal", "alternate_names": ["Concurr Comput Pract Exp", "Concurrency and Computation: Practice and Experience", "Concurr Comput"], "issn": "1532-0626", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/77004395?CRETRY=1&SRETRY=0", "alternate_urls": ["http://www3.interscience.wiley.com/cgi-bin/jtoc?ID=77004395", "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1532-0634"]}, "title": "Scheduling energy‐conscious tasks in distributed heterogeneous computing systems", "abstract": "Distributed heterogeneous systems have been widely adopted in industrial applications by providing high scalability and performance while keeping complexity and energy consumption under control. However, along with the increase in the number of computing nodes, the energy consumption of distributed heterogeneous systems dramatically grows and is extremely hard to predict. Energy‐conscious task scheduling, which tries to assign appropriate priorities and processors to tasks such that the system energy requirement would be met, has received extensive attention in recent years. However, many approaches reduce energy consumption by extending the completion time. In this article, we focus on the scheduling problem of energy‐conscious tasks in distributed heterogeneous computing systems and provide an efficient approach to mitigate energy consumption while minimizing the overall makespan of parallel applications. First, based on the heterogeneous earliest finish time, a fitness function is proposed to balance the makespan and energy consumption. Then, by improving the crossover and mutation operations of the traditional genetic algorithm, we proposed an efficient scheduling approach named energy‐conscious genetic algorithm to optimize the priorities and processor allocation of tasks, with objectives of minimizing the system energy and makespan. Experiment results on real‐world applications and simulations with randomly generated task graphs demonstrate that the proposed approach outperforms in energy‐saving and makespan reducing.", "venue": "Concurrency and Computation", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-07-21", "journal": {"name": "Concurrency and Computation: Practice and Experience", "volume": "34"}, "authors": [{"authorId": "2108101159", "name": "Yifan Liu"}, {"authorId": "1815042", "name": "Chenglie Du"}, {"authorId": "2108304542", "name": "Jinchao Chen"}, {"authorId": "46993410", "name": "Xiaoyan Du"}], "citations": [{"paperId": "ff339b54419d2acc9afcea4ff36d1fff39b04159", "title": "A hybrid Particle Whale Optimization Algorithm with application to workflow scheduling in cloud-fog environment"}, {"paperId": "9e6146969693831aba497815671b7aabd4b0ff84", "title": "A Survey on Approximate Edge AI for Energy Efficient Autonomous Driving Services"}, {"paperId": "2223ba49e04fe6be340368ef9ec70af694599c9c", "title": "Ontology-Based Resource Modeling and Matching Framework in Avionics Systems"}, {"paperId": "3ecfd050ddc8a9b7c165492a05dedc55d74f3d1b", "title": "Time‐constrained and reliability aware energy minimization scheduling algorithm for heterogeneous multiprocessor environments"}, {"paperId": "a7974c3bb6ad9271fc2773be6fc7affb74b11d25", "title": "Energy-Saving Task Scheduling Based on Hard Reliability Requirements: A Novel Approach with Low Energy Consumption and High Reliability"}]}
