{"paperId": "b9877f1bfac2714bec9d7745bf198c044951ffb1", "publicationVenue": null, "title": "Memristive devices based hardware for unlabeled data processing", "abstract": "Unlabeled data processing is of great significance for artificial intelligence (AI), since well-structured labeled data are scarce in a majority of practical applications due to the high cost of human annotation of labeling data. Therefore, automatous analysis of unlabeled datasets is important, and relevant algorithms for processing unlabeled data, such as k-means clustering, restricted Boltzmann machine and locally competitive algorithms etc, play a critical role in the development of AI techniques. Memristive devices offer potential for power and time efficient implementation of unlabeled data processing due to their unique properties in neuromorphic and in-memory computing. This review provides an overview of the design principles and applications of memristive devices for various unlabeled data processing and cognitive AI tasks.", "venue": "Neuromorph. Comput. Eng.", "year": 2022, "fieldsOfStudy": ["Computer Science", "Physics"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-05-25", "journal": {"name": "Neuromorphic Computing and Engineering", "volume": "2"}, "authors": [{"authorId": "50479706", "name": "Zhuojian Xiao"}, {"authorId": "2036623", "name": "Bonan Yan"}, {"authorId": "2046744366", "name": "Teng Zhang"}, {"authorId": "2087894293", "name": "Ru Huang"}, {"authorId": "3566342", "name": "Yuchao Yang"}], "citations": [{"paperId": "e9de14821130e9153083bcbf7886f2aa64caede2", "title": "Unsupervised End-to-End Training with a Self-Defined Bio-Inspired Target"}, {"paperId": "1edeb9af06b4184bec9ed77e43ffacaf5281e0fe", "title": "Editorial: Focus issue on energy-efficient neuromorphic devices, systems and algorithms"}, {"paperId": "c5005384642c74c06e4be115dd176b5046ba0eab", "title": "Memristive dynamics enabled neuromorphic computing systems"}, {"paperId": "7d823cbd81eda49e0d296a990197960b0ba718a9", "title": "Parallel in-memory wireless computing"}, {"paperId": "a18ec16e39c3de516cebde6242f7c2045caf5ab4", "title": "Unsupervised character recognition with graphene memristive synapses"}]}
