{"paperId": "b98a270d83e6a4d20542f8709a5f7f27391462b3", "publicationVenue": null, "title": "FEAST: A Communication-efficient Federated Feature Selection Framework for Relational Data", "abstract": "Vertical federated learning (VFL) is an emerging paradigm for cross-silo organizations to build more accurate machine learning (ML) models. In this setting, multiple organizations (i.e., parties) hold the same set of samples with different features. However, different parties may have redundant or highly correlated features, leading to inefficient and ineffective VFL model training. Effective feature selection in VFL is therefore essential to mitigate such a problem and improve model effectiveness, as well as computation and communication efficiency. To this end, in this paper, we propose a federated feature selection framework, called FEAST, which leverages conditional mutual information (CMI) to select more informative features while having low redundancy. Furthermore, we design a communication-efficient method to reduce the information exchanged among the parties while protecting the parties' raw data. Extensive experiments on four real-world datasets demonstrate that the proposed framework achieves state-of-the-art performance in terms of accuracy, communication and computation costs.", "venue": "Proc. ACM Manag. Data", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-30", "journal": {"name": "Proceedings of the ACM on Management of Data", "pages": "1 - 28", "volume": "1"}, "authors": [{"authorId": "2218906462", "name": "Rui Fu"}, {"authorId": "2108407950", "name": "Yuncheng Wu"}, {"authorId": "2237081", "name": "Quanqing Xu"}, {"authorId": "1793178", "name": "Meihui Zhang"}], "citations": [{"paperId": "9398f1586a7a4bd03abe991d3026b5bfff6f048d", "title": "TablePuppet: A Generic Framework for Relational Federated Learning"}, {"paperId": "a1f2b0cc6c4ab9306c96c97c9ba7b27ca03dcfd8", "title": "Secure and Verifiable Data Collaboration with Low-Cost Zero-Knowledge Proofs"}, {"paperId": "7e555856fc97b669379b0989a8c50097e4f607ed", "title": "A Survey for Federated Learning Evaluations: Goals and Measures"}, {"paperId": "6f535151e5a84d5603b00ecdff76018dea6af511", "title": "Falcon: A Privacy-Preserving and Interpretable Vertical Federated Learning System"}, {"paperId": "f13f014f51dd425661e3202067c5ef5052fe4d6a", "title": "Vertical Federated Learning"}, {"paperId": "e43272b6d0cf8c6bb5931c226dc5dd47cf88b0df", "title": "The Metaverse Data Deluge: What Can We Do About It?"}]}
