{"paperId": "b9a43731c886ab9b5d2e5effbe1c295a568e06a7", "publicationVenue": null, "title": "Lived Experience Matters: Automatic Detection of Stigma on Social Media Toward People Who Use Substances", "abstract": "Stigma toward people who use substances (PWUS) is a leading barrier to seeking treatment.Further, those in treatment are more likely to drop out if they experience higher levels of stigmatization. While related concepts of hate speech and toxicity, including those targeted toward vulnerable populations, have been the focus of automatic content moderation research, stigma and, in particular, people who use substances have not. This paper explores stigma toward PWUS using a data set of roughly 5,000 public Reddit posts. We performed a crowd-sourced annotation task where workers are asked to annotate each post for the presence of stigma toward PWUS and answer a series of questions related to their experiences with substance use. Results show that workers who use substances or know someone with a substance use disorder are more likely to rate a post as stigmatizing. Building on this, we use a supervised machine learning framework that centers workers with lived substance use experience to label each Reddit post as stigmatizing. Modeling person-level demographics in addition to comment-level language results in a classification accuracy (as measured by AUC) of 0.69 -- a 17% increase over modeling language alone. Finally, we explore the linguist cues which distinguish stigmatizing content: PWUS substances and those who don't agree that language around othering (\"people\",\"they\") and terms like\"addict\"are stigmatizing, while PWUS (as opposed to those who do not) find discussions around specific substances more stigmatizing. Our findings offer insights into the nature of perceived stigma in substance use. Additionally, these results further establish the subjective nature of such machine learning tasks, highlighting the need for understanding their social contexts.", "venue": "", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2023-02-04", "journal": null, "authors": [{"authorId": "50360470", "name": "Salvatore Giorgi"}, {"authorId": "2153296961", "name": "Douglas Bellew"}, {"authorId": "2204578480", "name": "Daniel Roy Sadek Habib"}, {"authorId": "17010256", "name": "G. Sherman"}, {"authorId": "2662374", "name": "João Sedoc"}, {"authorId": "2159566153", "name": "Chase Smitterberg"}, {"authorId": "123830527", "name": "Amanda Devoto"}, {"authorId": "1920132119", "name": "McKenzie Himelein-Wachowiak"}, {"authorId": "2053093153", "name": "Brenda L. Curtis"}], "citations": [{"paperId": "a1ff5e96d693011230346969510c7727b6321c5e", "title": "A linguistic analysis of dehumanization toward substance use across three decades of news articles"}]}
