{"paperId": "b9be91244d02909d11fc8bd1b867ffba86d24e63", "publicationVenue": {"id": "6c2ef016-936e-4f16-bc1f-a931f0bd59a3", "name": "Datenbanksysteme für Business, Technologie und Web", "type": "conference", "alternate_names": ["BTW Workshops", "Datenbanksysteme Bus Technol Web", "BTW Work", "BTW"], "url": "https://fb-dbis.gi.de/btw-konferenz/vergangene-konferenzen/"}, "title": "Workload-Driven Data Placement for Tierless In-Memory Database Systems", "abstract": ": High main memory consumption is a significant cost factor for in-memory database systems. Tiering, i.e., placing parts of the data on memory or storage devices other than DRAM, reduces the main memory footprint. A controlled data placement can assign rarely accessed data to slow devices while frequently used data remains on fast devices, such as main memory, to maintain acceptable query latencies. We present an automatic data placement decision system for the in-memory database Hyrise. The system organizes the memory and storage devices in a tierless pool, with no fixed device class categorization or performance order. The system supports data placement use cases, such as minimizing end-to-end query latencies and making cost-optimal purchase recommendations in cloud environments. In this paper, we introduce an efficient calibration process to derive cost models for various storage devices. To determine data placements, we introduce a linear programming-based approach, which yields optimal configurations, and an efficient heuristic. With a set of main memory and SSD devices, we can reduce the main memory consumption for base table data of the TPC-DS benchmark by 74 percent when accepting a workload latency increase of 52 percent. In a comparison of data placement algorithms and cost models, we find that simplistic algorithms (e.g., greedy algorithms) can present viable alternatives to optimal linear programming algorithms, especially under cost prediction inaccuracies.", "venue": "Datenbanksysteme für Business, Technologie und Web", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"pages": "47-70"}, "authors": [{"authorId": "2089409084", "name": "Ben Hurdelhey"}, {"authorId": "1865719023", "name": "Marcel Weisgut"}, {"authorId": "29837843", "name": "Martin Boissier"}], "citations": []}
