{"paperId": "b9c1a0d4298ed3e67329a2020859460bafbb4c01", "publicationVenue": {"id": "6a8c0041-d0b7-4e32-b52c-33adef005c7e", "name": "Frontiers in Artificial Intelligence", "alternate_names": ["Front Artif Intell"], "issn": "2624-8212", "url": "https://www.frontiersin.org/journals/artificial-intelligence#"}, "title": "Applications of Learning Analytics in High Schools: A Systematic Literature Review", "abstract": "Learning analytics aims to analyze data from students and learning environments to support learning at different levels. Although learning analytics is a recent field, it reached a high level of maturity, especially in its applications for higher education. However, little of the research in learning analytics targets other educational levels, such as high school. This paper reports the results of a systematic literature review (SLR) focused on the adoption of learning analytics in high schools. More specifically, the SLR followed four steps: the search, selection of relevant studies, critical assessment, and the extraction of the relevant field, which included the main goals, approaches, techniques, and challenges of adopting learning analytics in high school. The results show that, in this context, learning analytics applications are focused on small-scale initiatives rather than institutional adoption. Based on the findings of this study, in combination with the literature, this paper proposes future directions of research and development in order to scale up learning analytics applications in high schools.", "venue": "Frontiers in Artificial Intelligence", "year": 2021, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-09-27", "journal": {"name": "Frontiers in Artificial Intelligence", "volume": "4"}, "authors": [{"authorId": "2128146574", "name": "Erverson B. G. de Sousa"}, {"authorId": "2209227462", "name": "Bruno Alexandre Barreiros Rosa"}, {"authorId": "49617318", "name": "R. F. Mello"}, {"authorId": "2249534", "name": "Taciana Pontual Falcão"}, {"authorId": "1895801", "name": "B. Vesin"}, {"authorId": "65953975", "name": "D. Gašević"}], "citations": [{"paperId": "cb6f6a6ca894810732b782b611acbec1a080289b", "title": "Unveiling Goods and Bads: A Critical Analysis of Machine Learning Predictions of Standardized Test Performance in Early Childhood Education"}, {"paperId": "a480660c34ed48d7151db577f0ae1f0bdef0b03d", "title": "Uncovering Engagement Profiles of Young Learners in K–8 Education through Learning Analytics"}, {"paperId": "483ab63e329eb602df22478e0c3da45bd38f354a", "title": "Assessing students’ handwritten text productions: A two-decades literature review"}, {"paperId": "b396d3fae270003d5bf22445c2e78280d818baea", "title": "Navigating Generative AI: The Teacher Librarian's Role in Cultivating Ethical and Critical Practices"}, {"paperId": "47c89fdbf81cc6c30caf416d8953badd416e9fc4", "title": "Statistical Analyses of Learning Metrics in High School: a Study for Personalized Feedback Purposes"}, {"paperId": "f9d421cfa6dfa3d54961bc4fb2d346f776a1d5e8", "title": "Learning analytics driven improvements in learning design in higher education: A systematic literature review"}, {"paperId": "977952546d2ac5efef6608239bf1e3d5ef93632b", "title": "Datafication and algorithmization of education: How do parents and students evaluate the appropriateness of learning analytics?"}, {"paperId": "a568bc05ed45a83c693d1a072547d900cf08fe5a", "title": "Prospers and Obstacles in Using Artificial Intelligence in Saudi Arabia Higher Education Institutions—The Potential of AI-Based Learning Outcomes"}, {"paperId": "7299f767794c2a7a5daa56d15a974a595ef15458", "title": "Measuring self-regulated learning in a junior high school mathematics classroom: Combining aptitude and event measures in digital learning materials"}, {"paperId": "de9e9209901f99ffffdb02d0eca328674c730c93", "title": "Intelligent techniques in e-learning: a literature review"}, {"paperId": "6b3682709a4b91cf0c0ab896de6c4b3b9eddd31e", "title": "Learning analytics for lifelong career development: a framework to support sustainable formative assessment and self-reflection in programs developing career self-efficacy"}, {"paperId": "657945f06cfc9659289274f4a26c547ef87d9384", "title": "Teachers’ data literacy for learning analytics: a central predictor for digital data use in upper secondary schools"}, {"paperId": "0d9df0616d4839d77b662436539307326a5e6776", "title": "The current state of using learning analytics to measure and support K-12 student engagement: A scoping review"}, {"paperId": "2af5f5372c4ba06a232af1cbc345e0a7e9031cfe", "title": "How Do Teachers Use Dashboards Enhanced with Data Storytelling Elements According to their Data Visualisation Literacy Skills?"}, {"paperId": "73ada5ce7d8b8c6f97fff8e47e3a43f794f396dd", "title": "Role of Educational Data Mining and Learning Analytics Techniques Used for Predictive Modeling"}, {"paperId": "6156fd3b4d9313232ef4444108e61d594d08daaa", "title": "Introducing Practicable Learning Analytics"}, {"paperId": "a2ad192fa3ee1ce464892c19d50d9c2ce95ed3c8", "title": "Learning Analytics Desconectada: Um Estudo de Caso em Análise de Produções Textuais"}, {"paperId": "a5aefac7c6592d8f41c247da6ac5d0405b28e196", "title": "Detecção Automática de Clímax em Produções de Textos Narrativos"}, {"paperId": "6a356be4cd5afadfc12ffc699edfb3cea73043cc", "title": "Aplicação de reconhecimento de entidades nomeadas para análise automática de textos narrativos em produções textuais do ensino fundamental"}, {"paperId": "a6143d91afaeef3b4ca6cb268eb7f587d8fdd297", "title": "Understanding Query Intention in Search Queries of Learners in Blended Learning Environments"}, {"paperId": "1d57bf6ce6c3e1812d4cdfe8b6e56f59b8282ef9", "title": "Personalisation methods in e‐learning‐A literature review"}, {"paperId": "b31855736089d627186792f489dbf39dea3f61a6", "title": "Implementing learning analytics in wiki-supported collaborative learning in secondary education: A framework-motivated empirical study"}, {"paperId": "1931bcf82f55f2da10ee4f3cda55066689d48725", "title": "Early Prediction of At-Risk Students in Secondary Education: A Countrywide K-12 Learning Analytics Initiative in Uruguay"}, {"paperId": "2118da68be35e15a1878b6838da2bf91700f05fd", "title": "A Penny for your Thoughts: Students and Instructors’ Expectations about Learning Analytics in Brazil"}, {"paperId": "7896eb25bed1ef9b6c4257eb701924b796adc8ff", "title": "Adaptive Assessment and Content Recommendation in Online Programming Courses: On the Use of Elo-rating"}, {"paperId": "c9903f6f8086ef2d69c584287aecad91b2831f61", "title": "Learning analytics to support teachers in the challenge of overcoming the learning gaps in K-12 students"}, {"paperId": "42c372a40ccc4dfc4cb3d723d28787cc8942bcf1", "title": "Learning Analytics for Teacher’s Dashboard in a Course Result System"}]}
