{"paperId": "b9d2ef1c527c80c699460b6fe940691c4c4ca2a9", "publicationVenue": {"id": "7bb54772-a70c-44df-9b9d-9f3b5354c0e2", "name": "IEEE International Parallel and Distributed Processing Symposium", "type": "conference", "alternate_names": ["IEEE Int Parallel Distrib Process Symp", "International Parallel and Distributed Processing Symposium", "IPDPS", "Int Parallel Distrib Process Symp"], "url": "http://www.ipdps.org/"}, "title": "In-Memory Indexed Caching for Distributed Data Processing", "abstract": "Powerful abstractions such as dataframes are only as efficient as their underlying runtime system. The de-facto distributed data processing framework, Apache Spark, is poorly suited for the modern cloud-based data-science workloads due to its outdated assumptions: static datasets analyzed using coarse-grained transformations. In this paper, we introduce the Indexed DataFrame, an in-memory cache that supports a dataframe abstraction which incorporates indexing capabilities to support fast lookup and join operations. Moreover, it supports appends with multi-version concurrency control. We implement the Indexed DataFrame as a lightweight, standalone library which can be integrated with minimum effort in existing Spark programs. We analyze the performance of the Indexed DataFrame in cluster and cloud deployments with real-world datasets and benchmarks using both Apache Spark and Databricks Runtime. In our evaluation, we show that the Indexed DataFrame significantly speeds-up query execution when compared to a non-indexed dataframe, incurring modest memory overhead.", "venue": "IEEE International Parallel and Distributed Processing Symposium", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-12-12", "journal": {"name": "2022 IEEE International Parallel and Distributed Processing Symposium (IPDPS)", "pages": "104-114"}, "authors": [{"authorId": "2860260", "name": "Alexandru Uta"}, {"authorId": "2038661", "name": "Bogdan Ghit"}, {"authorId": "2959744", "name": "Ankur Dave"}, {"authorId": "2342602", "name": "Jan S. Rellermeyer"}, {"authorId": "1687211", "name": "P. Boncz"}], "citations": []}
