{"paperId": "b9d45da04f17ec88a39c0d7a3851e5a215f926fd", "publicationVenue": {"id": "8c7a8c27-b625-4d2b-9aa8-de6f42e72b7e", "name": "Journal of Statistical Computation and Simulation", "type": "journal", "alternate_names": ["J Stat Comput Simul"], "issn": "0094-9655", "url": "https://www.tandfonline.com/action/journalInformation?journalCode=gscs20"}, "title": "A novel feature selection approach based on clustering algorithm", "abstract": "Clustering is one of the main methods of data mining. K-means algorithm is one of the most common clustering algorithms due to its efficiency and ease of use. In many data mining issues, the dataset contains a large number of fields and, therefore, the identification of the effective fields is an important issue. Appling the proposed algorithm, the important variables of the dataset would be identified. In the proposed method, the dataset is clustered in several stages and in each step the characteristics of the created clusters are examined and the features that transform the structure of clusters are introduced as effective features of the dataset. The proposed method was examined on 4 datasets and the results of this method were compared with other similar work and demonstrated that using this algorithm would eliminate redundant and unrelated features of the dataset and improve classification accuracy.", "venue": "Journal of Statistical Computation and Simulation", "year": 2020, "fieldsOfStudy": ["Mathematics"], "publicationTypes": null, "publicationDate": "2020-09-28", "journal": {"name": "Journal of Statistical Computation and Simulation", "pages": "581 - 604", "volume": "91"}, "authors": [{"authorId": "89615937", "name": "F. Moslehi"}, {"authorId": "34900201", "name": "A. Haeri"}], "citations": [{"paperId": "d0c88f6599db180d5dbf7c4865b3ca385138dcda", "title": "A non-intrusive method of industrial load disaggregation based on load operating states and improved grey wolf algorithm"}, {"paperId": "267af8d830bf16374358a145e35ac94c7bd158c6", "title": "Review of feature selection approaches based on grouping of features"}, {"paperId": "a6c59a6e2b05bcaf43ea807a51e90a4e8b2eb6ba", "title": "Enhancement of Kernel Clustering Based on Pigeon Optimization Algorithm"}, {"paperId": "6fe920a2ac9734717f50b5683bef43ec85ca3c47", "title": "Enhancement of K-means clustering in big data based on equilibrium optimizer algorithm"}, {"paperId": "9ee1381fcfb17fa88f09bd9b87ff233718bb6803", "title": "Implementation of Feature Selection to Reduce the Number of Features in Determining the Initial Centroid of K-Means Algorithm"}, {"paperId": "9c1dbcf400463818f8ac6b5929ce145b7d110c58", "title": "Understanding the influence of building characteristics on enhancing energy efficiency in residential buildings: A data mining based study"}, {"paperId": "90d6b65fca0beed13980ead3623584e6c4b4e25d", "title": "An Improved Machine Learning-Based Employees Attrition Prediction Framework with Emphasis on Feature Selection"}]}
