{"paperId": "b9e99a668deda0344268c432bd82eacd57d4987a", "publicationVenue": {"id": "eec60769-4238-493f-94a7-aef2343f1137", "name": "Aerospace", "alternate_names": ["Aerospace"], "issn": "0001-9321"}, "title": "Remaining Useful Life Prediction for Aero-Engines Based on Time-Series Decomposition Modeling and Similarity Comparisons", "abstract": "The aero-engine is the heart of an aircraft; its performance deteriorates rapidly due to the high temperature and high-pressure environment during flights. It is necessary to predict the remaining useful life (RUL) to improve the reliability of aero-engines and provide security for reliable flights. In previous flights, the sensors collected a lot of performance parameter data and formed a database regarding the aero-engine degradation process. These performance parameters cannot reflect the degradation process directly. In this paper, fuzzy clustering is applied to divide the degradation stages of the aero-engine, construct the health indicator, and describe the degradation process. Time-series decomposition modeling is applied to predict the degradation process of the health indicator. Based on the idea of similarity comparison, the RUL is predicted by comparing the similarity of time series through example learning. The method is verified and analyzed on the dataset published by National Aeronautics and Space Administration (NASA), and the mean square error (MSE) is 528. The result is better than the comparative method.", "venue": "Aerospace", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-10-16", "journal": {"name": "Aerospace"}, "authors": [{"authorId": "2166521270", "name": "Mingxian Wang"}, {"authorId": "2141786925", "name": "Hongyan Wang"}, {"authorId": "19257517", "name": "Langfu Cui"}, {"authorId": "46465569", "name": "Gang Xiang"}, {"authorId": null, "name": "Xiaoxuan Han"}, {"authorId": "2166289067", "name": "Qingzhen Zhang"}, {"authorId": "2188217448", "name": "Juan Chen"}], "citations": [{"paperId": "5740efbaac9adacc8da2a1a459d166bda3ef939f", "title": "Aircraft Engine Remaining Useful Life Prediction using neural networks and real-life engine operational data"}, {"paperId": "23303ccd6f9cee536d9b3e61689b1ff32753243f", "title": "Fault Prognostics for Machinery with Multi-Degradation Stage Based on Deep Residual Network and Multi-Task Learning"}, {"paperId": "763d8fa74bc0d80a6de7199d497b59eff0157114", "title": "A Novel Approach to Satellite Component Health Assessment Based on the Wasserstein Distance and Spectral Clustering"}, {"paperId": "e18074bd2ccf8cd0ebb79c801ce5b5f5ee093e90", "title": "Remaining useful life distribution prediction framework for lithium-ion battery fused prior knowledge and monitoring data"}, {"paperId": "5ad7ddda08f32eba106f6c732679ea14ed410d4d", "title": "A Method for Satellite Component Health Assessment Based on Multiparametric Data Distribution Characteristics"}]}
