{"paperId": "b9ea4a1b8c1972f2e953055d75624eab71f6ebb6", "publicationVenue": {"id": "657a4bec-9a11-40fb-acfe-243d7fb993ae", "name": "Frontiers in Earth Science", "type": "journal", "alternate_names": ["Frontiers of Earth Science", "Frontiers in Earth Sciences", "Front Earth Sci"], "issn": "2296-6463", "alternate_issns": ["1863-4621", "2095-0195"], "url": "http://www.frontiersin.org/Earth_Science", "alternate_urls": ["http://journal.hep.com.cn/fesci/EN/2095-0195/current.shtml", "http://www.frontiersin.org/Journal/Archive.aspx?artId=0&f=19&name=Earth_Science", "https://www.frontiersin.org/journals/earth-science", "https://www.springer.com/series/7066"]}, "title": "Study on the shock-absorbing effect of a new staggered story isolated structure under the long-period earthquake motion", "abstract": "The finite element model of a new staggered story isolated structure is established. Using the time-history analysis method, the dynamic response state of the structure at each time step is calculated by integrating the acceleration time-history data step-by-step. Three different types of seismic waves (ordinary seismic wave, near-fault impulse seismic wave, far-field quasi harmonic and long-period seismic wave) are input respectively for dynamic time history analysis. The result indicates that the new staggered story isolated structure has a good shock absorption effect under the action of three different types of seismic waves. There are certain differences in the shock absorption effect under the three kinds of ground motions. The seismic response under ordinary ground motions is minimal, but the seismic response of the structure increases in response to far-field quasi harmonic and long-period ground motions and the near-field fault pulse ground motions. Meanwhile, the inter-story shear force, inter story acceleration, inter-story displacement, damage, and the energy input are all increasing, However, compared with the aseismic structure, the inter-story shear force is reduced by 48%, the inter-story acceleration is reduced by 23%, the inter-story displacement is reduced by 48%, and the energy dissipation rate of the isolated layer is 65%. In addition, the isolated bearing is in good condition during occasional earthquakes under normal ground motion. However, the bearing exceeds the permissible range during near-fault impulse ground motion and far-field harmonic and long-period earthquakes. Therefore, special consideration should be given to the area where the far-field harmonic and long-period ground motion are involved.", "venue": "Frontiers in Earth Science", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-01-12", "journal": {"volume": "10"}, "authors": [{"authorId": "2059689322", "name": "Tong Shu"}, {"authorId": "2146240402", "name": "Qi Li"}, {"authorId": "2199960201", "name": "Taize Wang"}, {"authorId": "2217012264", "name": "Luwei Jiang"}, {"authorId": "2200066569", "name": "Zhongfa Guo"}, {"authorId": "2005941518", "name": "Min Lei"}, {"authorId": "48928787", "name": "Dewen Liu"}], "citations": [{"paperId": "04d0fd382badc5a7e7eabd4f162c1a10af31c78e", "title": "Seismic response analysis of connected dual-tower isolated structure under three-dimensional earthquakes"}, {"paperId": "422590be8c2c589e4d29226d80f56c90c7a406ce", "title": "Dynamic Responses of Concrete-Face Rockfill Dam to Different Site Conditions under Near-Fault Earthquake Excitation"}]}
