{"paperId": "ba1187ab1195206e1f77fefa7373c9e5418f2e8b", "publicationVenue": {"id": "6363ebc9-706a-4203-b804-148cbf8810ce", "name": "IEEE International Conference on Bioinformatics and Biomedicine", "type": "conference", "alternate_names": ["Bioinform Biomed", "BIBM", "IEEE Int Conf Bioinform Biomed", "Bioinformatics and Biomedicine"], "url": "http://www.wikicfp.com/cfp/program?id=283"}, "title": "Mining sequential patterns from uncertain big DNA in the spark framework", "abstract": "Big data has become ubiquitous as high volumes of wide varieties of valuable data of different veracities (e.g., precise, imprecise or uncertain data) are made available at a high velocity through fast throughput machines and techniques for data gathering and curation in many real life applications in various domains and application areas such as bioinformatics, biomedicine, finance, social networking, and weather forecasting. In bioinformatics, terabytes of deoxyribonucleic acid (DNA) sequences can now be generated within a few hours with the use of next generation sequencing (NGS) technologies such as Illumina HiSeq X and Illumina Genome Analyzer. Due to the nature of these NGS technologies, generated data are usually inherent with some noise or other forms of error. These uncertain data are embedded with a wealth of information in the form of frequent patterns. Mining frequently occurring patterns (e.g., motifs) from these big uncertain DNA sequences is a challenge in bioinformatics and biomedicine. Many existing algorithms are serial and mine DNA sequence motifs using precise data mining methods. Mining of motifs from big DNA sequences is a computationally intensive task because of the high volume and the associated uncertainty of these DNA sequences. In this paper, we propose a scalable algorithm for high performance computing on bioinformatics. Specifically, our parallel algorithm uses a fault-tolerant collection of resilient distributed datasets (RDDs) in Apache Spark computing framework to mine sequence motifs from uncertain big DNA data. Experimental results show that our algorithm extracts accurate motifs within a short time frame.", "venue": "IEEE International Conference on Bioinformatics and Biomedicine", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2016-12-01", "journal": {"name": "2016 IEEE International Conference on Bioinformatics and Biomedicine (BIBM)", "pages": "874-881"}, "authors": [{"authorId": "2069981213", "name": "Fan Jiang"}, {"authorId": "1726081", "name": "C. Leung"}, {"authorId": "8766696", "name": "O. Sarumi"}, {"authorId": "1905681423", "name": "Christine Y. Zhang"}], "citations": [{"paperId": "bfd294464559d951498eeb2d242b1be312c5151b", "title": "A Novel Deep Learning Approach for Breast Cancer Detection on Screening Mammography"}, {"paperId": "6655d704aaa26b7727de6730875e86e9b3361b01", "title": "Privacy Preservation of Big Spatio-Temporal Co-occurrence Data"}, {"paperId": "6201d2f202d8e45610721c7651982cfad114e9f5", "title": "Extracting sequential frequent itemsets from probabilistic sequences database"}, {"paperId": "f6e0f9877a4727b28b0f87b6191795ae0cd05128", "title": "Preserving Privacy Integration and Mining for Big Temporal Co-occurrence Patterns"}, {"paperId": "d2b096acef8b783147a2b34c251d5cb24c8705e9", "title": "Health Informatics on Big COVID-19 Pandemic Data via N-Shot Learning"}, {"paperId": "a6b8f5502a971e4f2229b0e3198494ceab27540b", "title": "SAX and Random Projection Algorithms for the Motif Discovery of Orbital Asteroid Resonance Using Big Data Platforms"}, {"paperId": "9f92a67dea00771011c572662ac7531470bc942c", "title": "Privacy-Preserving Publishing and Visualization of Spatial-Temporal Information"}, {"paperId": "71b05f36fcd400ce91c885f40ecf8654c711b459", "title": "Open Data Lake to Support Machine Learning on Arctic Big Data"}, {"paperId": "9a2460b247dda0b0e160ab4664b073919864a66e", "title": "Predictive analytics for economic crisis triggered depression risk level identification among some adults in Nigeria"}, {"paperId": "68e3ba074d6c381142ceea3c39ca1c3294dc4738", "title": "Predictive Analytics on Genomic Data with High-Performance Computing"}, {"paperId": "d3e9f636727b0b8f47a968c2b90435fe1c5aa9b2", "title": "Efficient Execution of Dynamic Programming Algorithms on Apache Spark"}, {"paperId": "634bf9def54cbf20659e1d897530125433468af4", "title": "A Cooperative Spectrum Sensing Architecture and Algorithm for Cloud- and Big Data-based Cognitive Radio Networks"}, {"paperId": "aca6d5f3866372a4506cf15773ae298f18c3f453", "title": "A comprehensive survey of anomaly detection techniques for high dimensional big data"}, {"paperId": "56185aae0d55289a3e229c2dae44f8745a03ddab", "title": "Exploiting Anti-Monotonic Constraints in Mining Palindromic Motifs from Big Genomic Data"}, {"paperId": "72b70f2acf9933a7c35ab39d186b3aa9d1d49589", "title": "An Innovative Framework for Supporting Frequent Pattern Mining Problems in IoT Environments"}, {"paperId": "9eea19567f33cbac0f7137b73cd89194f3c44ef4", "title": "MpBsmi: A new algorithm for the recognition of continuous biological sequence pattern based on index structure"}, {"paperId": "1c4cc67e7e7fa1491cdb73ff49b7b43cefd133cc", "title": "A Machine Learning Tool for Supporting Advanced Knowledge Discovery from Chess Game Data"}, {"paperId": "69bab2269abc1197382ecc791c45b574e9c63cf3", "title": "MapReduce-Based Complex Big Data Analytics over Uncertain and Imprecise Social Networks"}, {"paperId": "3e9cb0c598858a6e8d5177fd65f7f5c69ce09ba6", "title": "Constrained Frequent Pattern Mining from Big Data Via Crowdsourcing"}, {"paperId": "f61c4b280cc939bc6635dd1bb5935e364b01d5f5", "title": "Constrained Big Data Mining in an Edge Computing Environment"}, {"paperId": "a2431fe078287d44c924447101cc61d3811667cd", "title": "A Context-Sensitive Cloud-Based Data Analytic Mobile Alert and Optimal Route Discovery System for Rural and Urban ITS Penetration"}, {"paperId": "59a17139ae33fc33bf8715b54b31951e0bfbd825", "title": "Adaptive Machine Learning Algorithm and Analytics of Big Genomic Data for Gene Prediction"}, {"paperId": "54570473f71255c716dd228334a1ac29ed0e83cf", "title": "Data analytics on the board game Go for the discovery of interesting sequences of moves in joseki"}]}
