{"paperId": "ba207d731ef2d05ef03577735c41f25b34472439", "publicationVenue": {"id": "5b1ab359-1a03-4a1b-b41d-332a3fbfd5b3", "name": "IEEE Journal of Translational Engineering in Health and Medicine", "type": "journal", "alternate_names": ["IEEE J Transl Eng Health Med"], "issn": "2168-2372", "url": "http://health.embs.org/", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/aboutJournal.jsp?punumber=6221039", "http://ieeexplore.ieee.org/servlet/opac?punumber=6221039"]}, "title": "A Precision Health Service for Chronic Diseases: Development and Cohort Study Using Wearable Device, Machine Learning, and Deep Learning", "abstract": "This paper presents an integrated and scalable precision health service for health promotion and chronic disease prevention. Continuous real-time monitoring of lifestyle and environmental factors is implemented by integrating wearable devices, open environmental data, indoor air quality sensing devices, a location-based smartphone app, and an AI-assisted telecare platform. The AI-assisted telecare platform provided comprehensive insight into patients’ clinical, lifestyle, and environmental data, and generated reliable predictions of future acute exacerbation events. All data from 1,667 patients were collected prospectively during a 24-month follow-up period, resulting in the detection of 386 abnormal episodes. Machine learning algorithms and deep learning algorithms were used to train modular chronic disease models. The modular chronic disease prediction models that have passed external validation include obesity, panic disorder, and chronic obstructive pulmonary disease, with an average accuracy of 88.46%, a sensitivity of 75.6%, a specificity of 93.0%, and an F1 score of 79.8%. Compared with previous studies, we establish an effective way to collect lifestyle, life trajectory, and symptom records, as well as environmental factors, and improve the performance of the prediction model by adding objective comprehensive data and feature selection. Our results also demonstrate that lifestyle and environmental factors are highly correlated with patient health and have the potential to predict future abnormal events better than using only questionnaire data. Furthermore, we have constructed a cost-effective model that needs only a few features to support the prediction task, which is helpful for deploying real-world modular prediction models.", "venue": "IEEE Journal of Translational Engineering in Health and Medicine", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-09-19", "journal": {"name": "IEEE Journal of Translational Engineering in Health and Medicine", "volume": "10"}, "authors": [{"authorId": "2115395816", "name": "Chia-Tung Wu"}, {"authorId": "1576100014", "name": "Ssu-Ming Wang"}, {"authorId": "3053535", "name": "Yidan Su"}, {"authorId": "2136683846", "name": "Tsung-Ting Hsieh"}, {"authorId": "2144370103", "name": "Pei-Chen Chen"}, {"authorId": "2153511416", "name": "Yu-Chieh Cheng"}, {"authorId": "1382022476", "name": "T. Tseng"}, {"authorId": "2185615056", "name": "Wei-Sheng Chang"}, {"authorId": "2185470916", "name": "Chang-Shinn Su"}, {"authorId": "92886833", "name": "Lu-Cheng Kuo"}, {"authorId": "81518367", "name": "J. Chien"}, {"authorId": "2144990929", "name": "F. Lai"}], "citations": [{"paperId": "945fb780e637568de7e4dd53fa32b55d29fe023e", "title": "Health and economic burden avoided due to air pollution reduction during the COVID-19 Lockdown: Portugal case study"}, {"paperId": "6db587f5c9b3e10c7727e23e4f7896ff587a8a44", "title": "Leveraging Machine Learning for Disease Diagnoses Based on Wearable Devices: A Survey"}, {"paperId": "b35c46ca8c51682e0c02974484f5a517f10b72fb", "title": "Fog-Based Smart Contract Platform for Wearable IoT-Enabled Telemedicine"}, {"paperId": "1de174449503a88bab1add8df8f33e9be818690f", "title": "Machine Learning Techniques for Developing Remotely Monitored Central Nervous System Biomarkers Using Wearable Sensors: A Narrative Literature Review"}, {"paperId": "0470efbe77f1f91224b2d3f53be09dc4ea1dd8b3", "title": "Application of wearable devices for monitoring cardiometabolic dysfunction under the exposome paradigm"}]}
