{"paperId": "ba21f2388bb755530b0a4639d34fe8da082a9956", "publicationVenue": null, "title": "Task Allocation in Containerized Cloud Computing Environment", "abstract": "Containerization technology makes use of operating system-level virtualization to pack application that runs with required libraries and is isolated from other processes on the same host. The lightweight easy deployment of containers made them popular at many data centers. It has captured the market of virtual machines and emerged as lightweight technology that offers better microservices support. Many organizations are widely deploying container technology for handling their diverse and unexpected workload derived from modern applications such as Edge/ Fog computing, Big Data, and IoT in either proprietary clusters or public, private cloud data centers. In the cloud computing environment, scheduling plays a pivotal role. In the same way in container technology, scheduling also plays a critical role in achieving the optimum utilization of available resources. Designing an efficient scheduler is itself a challenging task. The challenges arise from various aspects like the diversity of computing resources and maintaining fairness among numerous tenants, sharing resources with each other as per their requirements, unexpected variation in resource demands and heterogeneity of jobs, etc. This survey provides a multi-perspective overview of container scheduling. Here, we have organized the container scheduling problem into four categories based on the type of optimization algorithm applied to get the linear programming Modeling, heuristic, meta-heuristic, machine learning, and artificial intelligence-based mathematical model. In the previous research work has been done on either Virtual machine placements to Physical Machines or Container instances to Physical machines. This leads to either underutilized PMs or over-utilized PMs. But in this paper, we try to combine both virtualization technology Containers as well as VMs. The primary aim is to optimize resource utilization in terms of CPU time. in this paper, we proposed a meta-heuristics algorithm named Sorted Task-based allocation. Simulation results show that the proposed Sorted TBA algorithm performs better than the Random and Unsorted TBA algorithms.", "venue": "2022 International Conference on Advancements in Smart, Secure and Intelligent Computing (ASSIC)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference", "Review"], "publicationDate": "2022-11-19", "journal": {"name": "2022 International Conference on Advancements in Smart, Secure and Intelligent Computing (ASSIC)", "pages": "1-5"}, "authors": [{"authorId": "2210255146", "name": "Md. Akram Khan"}, {"authorId": "2057093531", "name": "Sambit Kumar Mishra"}, {"authorId": "2005907034", "name": "Anisha Kumari"}, {"authorId": "2144869890", "name": "B. Sahoo"}], "citations": [{"paperId": "ad1592d176ab1e5e9a74720f3bfbe7185530f512", "title": "A comprehensive survey of energy-efficient computing to enable sustainable massive IoT networks"}]}
