{"paperId": "ba2770c990b740b6dfa4a122ac4ad719868796dd", "publicationVenue": null, "title": "An Empirical Study on Quality Issues of eBay's Big Data SQL Analytics Platform", "abstract": "Big data SQL analytics platform has evolved as the key infrastructure for business data analysis. Compared with traditional costly commercial RDBMS, scalable solutions with open-source projects, such as SQL-on-Hadoop, are more popular and attractive to enter-prises. In eBay, we build Carmel, a company-wide interactive SQL analytics platform based on Apache Spark. Carmel has been serving thousands of customers from hundreds of teams globally for more than 3 years. Meanwhile, despite the popularity of open-source based big data SQL analytics platforms, few empirical studies on service quality issues (e.g., job failure) were carried out for them. However, a deep understanding of service quality issues and taking right mitigation are significant to the ease of manual maintenance efforts. To fill this gap, we conduct a comprehensive empirical study on 1,884 real-word service quality issues from Carmel. We summa-rize the common symptoms and identify the root causes with typical cases. Stakeholders including system developers, researchers, and platform maintainers can benefit from our findings and implications. Furthermore, we also present lessons learned from critical cases in our daily practice, as well as insights to motivate automatic tool support and future research directions.", "venue": "2022 IEEE/ACM 44th International Conference on Software Engineering: Software Engineering in Practice (ICSE-SEIP)", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2022-05-01", "journal": {"name": "2022 IEEE/ACM 44th International Conference on Software Engineering: Software Engineering in Practice (ICSE-SEIP)", "pages": "33-42"}, "authors": [{"authorId": "2075368330", "name": "Feng Zhu"}, {"authorId": "46265474", "name": "Lijie Xu"}, {"authorId": "2068992476", "name": "Gang Ma"}, {"authorId": "3138197", "name": "Shuping Ji"}, {"authorId": "2146044108", "name": "Jie Wang"}, {"authorId": "2155614036", "name": "Gang Wang"}, {"authorId": "2155343898", "name": "Hongyi Zhang"}, {"authorId": "147266304", "name": "K. Wan"}, {"authorId": "2108930462", "name": "Ming-ming Wang"}, {"authorId": "2167740886", "name": "Xingchao Zhang"}, {"authorId": "2168583545", "name": "Yuming Wang"}, {"authorId": "2167743747", "name": "Jingpin Li"}], "citations": [{"paperId": "fe8966910272b7366500730ebaa2c52bcca497d0", "title": "Detection Is Better Than Cure: A Cloud Incidents Perspective"}, {"paperId": "813ee3df298675a940427ffdec529aea2cf9dcd3", "title": "How to fight production incidents?: an empirical study on a large-scale cloud service"}]}
