{"paperId": "ba2bbccbbce01cf47c6a6c589dd164f606ef79f5", "publicationVenue": {"id": "8bc59e8b-e251-4201-839a-ec83ae78859d", "name": "Complex", "type": "conference", "alternate_names": ["Int Conf Complex Sci", "International Conference on Complex Sciences"], "issn": "0806-1912", "alternate_issns": ["1538-6848"], "url": "http://wo.uio.no/as/WebObjects/nettlogg.woa/1/wa/logg?logg=5904", "alternate_urls": ["http://www.wikicfp.com/cfp/program?id=545", "https://www.complex.com/"]}, "title": "Artificial Intelligence Teaching System and Data Processing Method Based on Big Data", "abstract": "With the rapid development of big data, artificial intelligence teaching systems have gradually been developed extensively. The powerful artificial intelligence teaching systems have become a tool for teachers and students to learn independently in various universities. The characteristic of artificial intelligence teaching system is to get rid of the constraints of traditional teaching time and space and build a brand-new learning environment, which is the mainstream trend of future learning. As the carrier of students’ autonomous learning, the artificial intelligence teaching system provides a wealth of learning resources and learning tools on the one hand, and on the other hand, it gradually accumulates more and more learning behaviors, learning status, and other large amounts of data, which is an in-depth study of online learning and provides valuable and generative dynamic resources. Based on relevant researches on domestic and foreign related learning analysis and common big data analysis methods, combined with actual learning evaluation goals, this paper proposes an artificial intelligence teaching system using big data analysis methods and a modeling process framework for online learning evaluation and uses student data to carry out predictive evaluation modeling to evaluate student learning outcomes. The evaluation results can enable teachers to predict whether students can successfully complete the course of learning after a period of teaching. Through the final evaluation, students’ learning problems can be discovered in time based on the evaluation results, and targeted interventions can be made for students who are at risk. The scientific and objective learning evaluation obtained in this study through data analysis can not only provide teachers with relevant information and provide personalized guidance to students, but also improve the adaptive and personalized service functions of the learning platform of the artificial intelligence teaching system, greatly reducing teachers teaching burden. Artificial intelligence teaching evaluation can help educators understand the problems in teaching, adjust teaching strategies in time, and improve teaching results.", "venue": "Complex", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-05-05", "journal": {"name": "Complex.", "pages": "9919401:1-9919401:11", "volume": "2021"}, "authors": [{"authorId": "2112878547", "name": "Bo Xu"}], "citations": [{"paperId": "0087097a638a44d5796de87bbabccb19daeb5fd7", "title": "Constructing a teacher portrait for the artificial intelligence age based on the micro ecological system theory: A systematic review"}, {"paperId": "c1985fabacb43a2bbedea3b86653fae8f397b068", "title": "Retracted: Artificial Intelligence Teaching System and Data Processing Method Based on Big Data"}, {"paperId": "eed5c04f6d7cee9f6967be153760811e88373377", "title": "AI and BDA impact on Stakeholders' Responses to Education Technology Adoption"}, {"paperId": "5cc07d6c8ea07ac6f92ee728c2aa77c25a22ff75", "title": "An open-sharing platform for physical education course resources based on the MOOC network"}, {"paperId": "6dd6cad84974222295db9c240545e754a6a039db", "title": "Optimization of vocal singing training method based on intelligent big data technology"}, {"paperId": "dfd1d219c7e1993bef152f79b81204a828b77d21", "title": "Generative artificial intelligence empowers educational reform: current status, issues, and prospects"}, {"paperId": "d4916a1aa2fcaea415d056d7181ea4abe03cad07", "title": "Application Status, Problems and Future Prospects of Generative AI in Education"}, {"paperId": "1fc3a53d9665a639eeb6d7645a7f95965d2b1fb1", "title": "Teachers’ AI digital competencies and twenty-first century skills in the post-pandemic world"}, {"paperId": "ac5f460c06dca4612cd9ece02200117a3cc1e282", "title": "Effects of higher education institutes’ artificial intelligence capability on students' self-efficacy, creativity and learning performance"}, {"paperId": "09589e73a2db027c9ded3ba175cb4f5d63b31dd8", "title": "AI-Based Secure Construction of University Information Services Platform"}, {"paperId": "f51679a0f9df72a62b2e7a6d15e3a29a662de9d2", "title": "Artificial Intelligence and Big Data: The Advent of New Pedagogy in the Adaptive E-Learning System in the Higher Educational Institutions of Saudi Arabia"}, {"paperId": "cca410dc86ceb01c7ebd145405880d8d97342053", "title": "Industry iterative transformation based on big data intelligent platform"}, {"paperId": "6890318adf0df4b60fd48b9c064675f2b45c307d", "title": "I NTELLIGENT D ESIGN T ECHNIQUES T OWARDS I MPLICIT AND E XPLICIT L EARNING : A S YSTEMATIC R EVIEW"}]}
