{"paperId": "ba30893b6489a4b4d8e972e0e45c807e36f23555", "publicationVenue": {"id": "17c52c4d-2a56-4ef5-b23f-54d989ef66c6", "name": "ACM Transactions on Modeling and Performance Evaluation of Computing Systems", "alternate_names": ["ACM Trans Model Perform Evaluation Comput Syst"], "issn": "2376-3639", "url": "https://dl.acm.org/citation.cfm?id=J1525"}, "title": "Adaptive Performance Modeling of Data-intensive Workloads for Resource Provisioning in Virtualized Environment", "abstract": "The processing of data-intensive workloads is a challenging and time-consuming task that often requires massive infrastructure to ensure fast data analysis. The cloud platform is the most popular and powerful scale-out infrastructure to perform big data analytics and eliminate the need to maintain expensive and high-end computing resources at the user side. The performance and the cost of such infrastructure depend on the overall server configuration, such as processor, memory, network, and storage configurations. In addition to the cost of owning or maintaining the hardware, the heterogeneity in the server configuration further expands the selection space, leading to non-convergence. The challenge is further exacerbated by the dependency of the application’s performance on the underlying hardware. Despite an increasing interest in resource provisioning, few works have been done to develop accurate and practical models to proactively predict the performance of data-intensive applications corresponding to the server configuration and provision a cost-optimal configuration online. In this work, through a comprehensive real-system empirical analysis of performance, we address these challenges by introducing ProMLB: a proactive machine-learning-based methodology for resource provisioning. We first characterize diverse types of data-intensive workloads across different types of server architectures. The characterization aids in accurately capture applications’ behavior and train a model for prediction of their performance. Then, ProMLB builds a set of cross-platform performance models for each application. Based on the developed predictive model, ProMLB uses an optimization technique to distinguish close-to-optimal configuration to minimize the product of execution time and cost. Compared to the oracle scheduler, ProMLB achieves 91% accuracy in terms of application-resource matching. On average, ProMLB improves the performance and resource utilization by 42.6% and 41.1%, respectively, compared to baseline scheduler. Moreover, ProMLB improves the performance per cost by 2.5× on average.", "venue": "ACM Transactions on Modeling and Performance Evaluation of Computing Systems", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-03-09", "journal": {"name": "ACM Transactions on Modeling and Performance Evaluation of Computing Systems (TOMPECS)", "pages": "1 - 24", "volume": "5"}, "authors": [{"authorId": "30521811", "name": "Hosein Mohammadi Makrani"}, {"authorId": "34223410", "name": "H. Sayadi"}, {"authorId": "12539086", "name": "Najmeh Nazari"}, {"authorId": "2389278", "name": "Sai Manoj Pudukotai Dinakarrao"}, {"authorId": "1928425942", "name": "Avesta Sasan"}, {"authorId": "2393902", "name": "T. Mohsenin"}, {"authorId": "2951001", "name": "S. Rafatirad"}, {"authorId": "1747542", "name": "H. Homayoun"}], "citations": [{"paperId": "a21359673263d1de11f593fe396651554433c030", "title": "Deep Configuration Performance Learning: A Systematic Survey and Taxonomy"}, {"paperId": "23b2cc23c2755fef91376f72093961019edb4664", "title": "Design and Application of Dance Teaching and Evaluation System Based on Big Data"}, {"paperId": "e6b5529f8952dd4141f7eac76518bf4b78aeb07c", "title": "Adversarial Attacks Against Machine Learning-Based Resource Provisioning Systems"}, {"paperId": "1995aa999d5e320eeb49d542e883821a1471d2b5", "title": "Resource Management in Cloud and Cloud-influenced Technologies for Internet of Things Applications"}, {"paperId": "4261806fb7b934c697d928c83ec0c051d9b53c0a", "title": "Hadoop Map Reduce Techniques: Simplified Data Processing on Large Clusters with Data Mining"}, {"paperId": "fd49dffe9dd40b7665447418ffda759f286d262a", "title": "Breakthrough to Adaptive and Cost-Aware Hardware-Assisted Zero-Day Malware Detection: A Reinforcement Learning-Based Approach"}, {"paperId": "63e70a957463cb5c4d84b094e10be540bcf722e8", "title": "Deep Neural Network and Transfer Learning for Accurate Hardware-Based Zero-Day Malware Detection"}, {"paperId": "c9cfb98f07ac946edf681073bf09b5a6c9012d9d", "title": "Accelerated Machine Learning for On-Device Hardware-Assisted Cybersecurity in Edge Platforms"}, {"paperId": "92f776ef44695f47014918bfd89e0efb7ea50ca4", "title": "Performance Health Index for Complex Cyber Infrastructures"}, {"paperId": "9d353ef9e607f61fdf26ac51f6b5aae009db58cf", "title": "Edge Computing Technology Enablers: A Systematic Lecture Study"}, {"paperId": "18a8a9745b01453018786f565760083af21505bd", "title": "Security Threats in Cloud Rooted from Machine Learning-Based Resource Provisioning Systems"}]}
