{"paperId": "ba33621bf9663ddbef870a35e5ba9559f6eef165", "publicationVenue": {"id": "983b0731-eddf-4f05-9c9b-81059a9f9c51", "name": "IEEE Transactions on Vehicular Technology", "type": "journal", "alternate_names": ["IEEE Trans Veh Technol"], "issn": "0018-9545", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=25", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=25"]}, "title": "Mobile Edge Computing (MEC)-Enabled UAV Placement and Computation Efficiency Maximization in Disaster Scenario", "abstract": "Unmanned aerial vehicles (UAVs) are considered for disaster management to provide better coverage or help first responders provide advanced services. Furthermore, UAVs combined with mobile edge computing (MEC) capabilities, have recently emerged as a support for cloud computing by deploying UAV-assisted MEC at the network edge to reduce the latency and load of cloud computing data centers. We investigate the problem of maximizing the utility function by jointly optimizing the computing power, user associations, performance, duration, and location of user equipments (UEs) in UAV-assisted MEC networks in a disaster scenario. We considered several constraints including delay, quality of service, and coverage. The optimization problem is a mixed-integer non-linear programming problem. We propose a multi-stage offloading algorithm based on a learning algorithm and an interior-point method to obtain a viable solution. The simulation results obtained demonstrate the effectiveness of our proposed algorithm compared to existing schemes.", "venue": "IEEE Transactions on Vehicular Technology", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-10-01", "journal": {"name": "IEEE Transactions on Vehicular Technology", "pages": "13406-13416", "volume": "72"}, "authors": [{"authorId": "2163268063", "name": "Zaiba Shah"}, {"authorId": "1794132", "name": "U. Javed"}, {"authorId": "144712473", "name": "M. Naeem"}, {"authorId": "1706796", "name": "S. Zeadally"}, {"authorId": "1717608", "name": "W. Ejaz"}], "citations": [{"paperId": "05f73df2b8b23afb16b472f8f72c52d80c02d1fe", "title": "Trajectory-Aware Offloading Decision in UAV-Aided Edge Computing: A Comprehensive Survey"}, {"paperId": "836380e95dbe5071410d07965160dd2577add8ca", "title": "Empowering smart cities: High-altitude platforms based Mobile Edge Computing and Wireless Power Transfer for efficient IoT data processing"}, {"paperId": "e19965767c770ae672147c386de542af5c69bd8b", "title": "Multi-objective Resource Optimization in Space-Aerial-Ground-Sea Integrated Networks"}, {"paperId": "4aa72134b3e14f2d6d490f8c18963be7e948df5a", "title": "Dynamic Capacity Enhancement using Air Computing: An Earthquake Case"}]}
