{"paperId": "ba43bfa3e2165a9f97424738f4b3dc1e314f5f79", "publicationVenue": {"id": "d6a6ad38-f367-410f-b3e0-423df12cefa1", "name": "International Conference on Telecommunications", "type": "conference", "alternate_names": ["International Conference on Thermoelectrics", "Int Conf Thermoelectr", "ICT", "Int Conf Telecommun", "ConTEL"], "url": "http://www.wikicfp.com/cfp/program?id=1485"}, "title": "Distributed Data Platform for Automotive Industry: A Robust Solution for Tackling Big Challenges of Big Data in Transportation Science", "abstract": "Nowadays, large amounts of data are being generated from numerous sources. Such a trend is evident in many research fields where the number of data producers is constantly increasing. For example, fields of transportation science and automotive industry may consider each vehicle on the road as a separate data producer which can generate large amounts of data. In the literature, the big data is commonly used as an umbrella term when discussing research related to the following data challenges: volume, variety, velocity, veracity and value. Furthermore, it is a common approach to use a variety of programming tools and methods for different data processing phases, i.e., data collection, data storage, and data analysis. In this paper, we present a distributed data platform that addresses the aforementioned challenges by relying on a specific design choices for each of data processing phases. We argument how such the data platform supports robustness, scalability, fault tolerance, and reliability by showcasing the two real-world use-cases from the transportation/automotive domain: (i) collection, storage, and analysis of the data generated by electric cleaners fleet, and (ii) collection, storage, and analysis of transaction data from EV charging stations, which is further used to develop the EV charging infrastructure.", "venue": "International Conference on Telecommunications", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-07-03", "journal": {"name": "2019 15th International Conference on Telecommunications (ConTEL)", "pages": "1-8"}, "authors": [{"authorId": "8918501", "name": "Dario Pevec"}, {"authorId": "32574293", "name": "Hrvoje Vdovic"}, {"authorId": "151034176", "name": "Ivana Gace"}, {"authorId": "2090341664", "name": "Matea Sabolic"}, {"authorId": "2922237", "name": "Jurica Babic"}, {"authorId": "1740157", "name": "V. Podobnik"}], "citations": [{"paperId": "c178c1059e82d8cdda1850661e8e8ae40b8a7189", "title": "Employee perspectives on value realization from data within data-driven business models"}, {"paperId": "2deae11d8990f8387e92575ebad00686bb1bc9b6", "title": "Eco-efficient driving pattern evaluation for sustainable road transport based on contextually enriched automotive data"}, {"paperId": "740074fe5c5683251ab68696b5dcbee2d6dc0ea2", "title": "Specialized Vehicle CAN Bus Simulator: From Modelling to Validation"}, {"paperId": "dae818c2cc2d2c7861b8997b1ac144010cf7d793", "title": "Big Data Storage Tools Using NoSQL Databases and Their Applications in Various Domains: A Systematic Review"}, {"paperId": "29343c813065b40bab4087f2e38fc8c623abc003", "title": "Data Integration and Analysis Approaches in the Context of Automotive Events: A Case Study with Active Driver Assistance Systems"}, {"paperId": "25a1ba48f1d70ac1614927d32e6660074ca1310a", "title": "AN INTERACTIVE SYSTEM FOR ANALYZING MOVEMENT OF BUSES IN HAJJ"}]}
