{"paperId": "ba52d528728362c470f43729e84a50972837a017", "publicationVenue": {"id": "43893b55-fde6-4e2b-9d2e-c15a669a1f94", "name": "ACM Symposium on Parallelism in Algorithms and Architectures", "type": "conference", "alternate_names": ["SPAA", "ACM Symposium on Parallel Algorithms and Architectures", "ACM Symp Parallelism Algorithm Archit", "ACM Symp Parallel Algorithm Archit"], "url": "http://www.spaa-conference.org/"}, "title": "Unconditional Lower Bounds for Adaptive Massively Parallel Computation", "abstract": "We consider unconditional lower bounds in the Adaptive Massively Parallel Computation (AMPC) model introduced by Behnezhad et al. (SPAA 19), which is an adaptive variant of the Massively Parallel Computation (MPC) model. Our first contribution is an optimal lower bound on the round complexity of distinguishing whether an input graph is a cycle of length n or two cycles of length n/2. This problem, 1v2-CIRCLE, has emerged as a central problem in the study of modern massively parallel computation. We prove that any AMPC algorithm for the 1v2-CIRCLE problem with I/O capacity O(nε) per machine requires Ω(1/ε) rounds, matching the upper bound of Behnezhad et al. More generally, we develop an abstract framework for proving lower bounds in the AMPC model using techniques from Boolean function complexity. Our framework extends the polynomial method of Roughgarden et al. (JACM 18) for the MPC model in two dimensions: [o] Adaptivity, where machines can write to and adaptively read from shared memory throughout the execution of the computation. [o] Promise problems, where the algorithm only has to succeed on certain inputs. These inputs may have special structure that is of particular interest, or they may be representative of hard instances of the overall problem.", "venue": "ACM Symposium on Parallelism in Algorithms and Architectures", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2020-07-06", "journal": {"name": "Proceedings of the 32nd ACM Symposium on Parallelism in Algorithms and Architectures"}, "authors": [{"authorId": "1745732", "name": "M. Charikar"}, {"authorId": "2859161", "name": "Weiyun Ma"}, {"authorId": "145175555", "name": "Li-Yang Tan"}], "citations": [{"paperId": "1184fca17606e02554bd3ce2f8c330d829ecfa50", "title": "Adaptive Massively Parallel Connectivity in Optimal Space"}, {"paperId": "69e5bd4a63a5a5db0a720d2df64845c49750f718", "title": "Adaptive Massively Parallel Constant-round Tree Contraction"}, {"paperId": "204c748af70af16a41fa7a13f066d2452cb36e22", "title": "Massively Parallel Computation via Remote Memory Access"}, {"paperId": "259e42f8662ed40be75d5b01516371477ad2b0df", "title": "Time-Optimal Sublinear Algorithms for Matching and Vertex Cover"}, {"paperId": "ed0b5927bb01e0551f777eb9a8f0a70011bae3dd", "title": "Sample-and-Gather: Fast Ruling Set Algorithms in the Low-Memory MPC Model"}, {"paperId": "9572078983878d998369447dd80566363a9cdba6", "title": "Parallel graph algorithms in constant adaptive rounds"}, {"paperId": "24401e2e2b23b6814834f66c8432cb5f2e042701", "title": "Connectivity Lower Bounds in Broadcast Congested Clique"}, {"paperId": "1533cd0109bf6a2c55f2afa6f2754f46e770efbc", "title": "Lower bounds in MPC and AMPC models"}]}
