{"paperId": "ba54f632c4edf6aaa44bbdfc31d1942a379352c3", "publicationVenue": null, "title": "Asynchronous Deep Reinforcement Learning for Collaborative Task Computing and On-Demand Resource Allocation in Vehicular Edge Computing", "abstract": "Vehicular Edge Computing (VEC) is enjoying a surge in research interest due to the remarkable potential to reduce response delay and alleviate bandwidth pressure. Facing the ever-growing service applications in VEC, how to effectively aggregate and flexibly schedule ubiquitous network resources for implementing diverse tasks and meeting differentiated demands from numerous vehicular users remains haunting. Toward this end, we investigate collaborative task computing and on-demand resource allocation. The collaborative computing framework in VEC is provided to support deep collaboration and intelligent management of heterogeneous resources widely distributed in vehicles, edge servers and cloud. Based on this framework, the joint optimization problem of distributed task offloading and multi-resource management is formulated with the aim to maximize the system utility by making the optimal task and resource scheduling policy, the novelty of which lies in the exploration of available vehicle resources and the consideration of service migration. In view of the dynamics, randomness and time-variant of vehicular networks, the asynchronous deep reinforcement algorithm is leveraged to find the optimal solution. Extensive simulation experiments are implemented to demonstrate the superiority of our proposed algorithm in terms of response latency compared with full offloading and random offloading.", "venue": "IEEE transactions on intelligent transportation systems (Print)", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-01", "journal": {"name": "IEEE Transactions on Intelligent Transportation Systems", "pages": "15513-15526", "volume": "24"}, "authors": [{"authorId": "2150801768", "name": "Lei Liu"}, {"authorId": "2109020134", "name": "Jie Feng"}, {"authorId": "2210903640", "name": "Xuanyu Mu"}, {"authorId": "39718931", "name": "Qingqi Pei"}, {"authorId": "51043175", "name": "Dapeng Lan"}, {"authorId": "2099595799", "name": "Ming Xiao"}], "citations": [{"paperId": "0949a71fd5c0978914b73dc566aced4f6b512512", "title": "Reputation Management for Consensus Mechanism in Vehicular Edge Metaverse"}, {"paperId": "f75bc55cfa47fe9073fba4e28d8aa468a7d83685", "title": "Efficient Federated Learning for Metaverse via Dynamic User Selection, Gradient Quantization and Resource Allocation"}, {"paperId": "5826e6f73b28a004d4d5be15b18789e5d4e8d15e", "title": "MADDPG-Based Joint Service Placement and Task Offloading in MEC Empowered Air–Ground Integrated Networks"}, {"paperId": "7ece7c5de95970afaf190992ac321b5ed64b11a5", "title": "Adaptive Digital Twin Placement and Transfer in Wireless Computing Power Network"}, {"paperId": "270222a2f76768921e7ed952abc9152b9e6ea3f4", "title": "Multi-Objective Optimization Using Adaptive Distributed Reinforcement Learning"}, {"paperId": "345f8b80860af2aa7c48df292e8fa5e700f35ea4", "title": "NOMA-Enabled Multiuser Offloading in Multicell Edge Computing Networks: A Coalition Game Based Approach"}, {"paperId": "a125a094829f19c2e95b4acd5fdd1f10831053a6", "title": "Towards optimal edge resource utilization: Predictive analytics and reinforcement learning for task offloading"}, {"paperId": "66876d1b52f215ea76a0e5d0fae1c93c46cf4878", "title": "Latency-Aware Data Allocation Optimization for LEO Satellite IoT Networks with Federated Learning"}, {"paperId": "3dad49793aec1ebc9b8bd28776096c7ef24689c6", "title": "Accessible Distributed Hydrological Surveillance and Computing System with Integrated End-Edge-Cloud Architecture"}, {"paperId": "b7ead04b6b5d5626e4b671970f23680fefceaa60", "title": "Multi-User Dynamic Computation Offloading and Resource Allocation in 5G MEC Heterogeneous Networks With Static and Dynamic Subchannels"}, {"paperId": "0984ba5937b4e21cc67f4c253cad5b6d8075b5c8", "title": "Blockage-Based Cooperative Jamming for Secure Terahertz Transmissions in Indoor Networks"}, {"paperId": "58d07f8d2b795f7bd2389cfcaac16d43f2ad446f", "title": "On Vehicular Ad-Hoc Networks With Full-Duplex Radios: An End-to-End Delay Perspective"}, {"paperId": "8e80d2ebf88441bbda9650f3e5e712ea8125a8b9", "title": "Blockchain enabled task offloading based on edge cooperation in the digital twin vehicular edge network"}, {"paperId": "3b7cee84ef6bc349fc72a24c61cd710ea685bfa7", "title": "On-demand provisioning of computing resources in computing power network with mixed CPU and GPU"}, {"paperId": "8b551a84e9b5bef710bf2c40f7972af3589d1f2c", "title": "Multilevel Federated Learning-Based Intelligent Traffic Flow Forecasting for Transportation Network Management"}, {"paperId": "6a1c730c7b88df0965a97013e248d8c9d3814942", "title": "Computation Offloading for Edge Computing in RIS-Assisted Symbiotic Radio Systems"}, {"paperId": "4f08af4d674de72b3855ee57fa01f5e090208672", "title": "A Dual-Scale Transformer-Based Remaining Useful Life Prediction Model in Industrial Internet of Things"}, {"paperId": "8d88f0fb9b54d7b05d2421c5b487970f1518d742", "title": "Resilient Disaster Relief in Industrial IoT: UAV Trajectory Design and Resource Allocation in 6G Non-Terrestrial Networks"}, {"paperId": "5c89b55582eaf39b112dab3657f2788b3bea0438", "title": "Blockchain-Based Distributed Collaborative Computing for Vehicular Digital Twin Network"}, {"paperId": "d40448ac9bca61378eb6e6fa0cb084a8feca2370", "title": "NOMA-Assisted Secure Offloading for Vehicular Edge Computing Networks With Asynchronous Deep Reinforcement Learning"}, {"paperId": "62e9362ab52edaa1e64fed23e7da72794393b3b8", "title": "Multi-Agent Reinforcement Learning-Based Trading Decision-Making in Platooning-Assisted Vehicular Networks"}]}
