{"paperId": "ba6362863e1712f83a8b641e993d8da331a665c4", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Erasure-Coding-Based Storage and Recovery for Distributed Exascale Storage Systems", "abstract": "Various techniques have been used in distributed file systems for data availability and stability. Typically, a method for storing data in a replication technique-based distributed file system is used, but due to the problem of space efficiency, an erasure-coding (EC) technique has been utilized more recently. The EC technique improves the space efficiency problem more than the replication technique does. However, the EC technique has various performance degradation factors, such as encoding and decoding and input and output (I/O) degradation. Thus, this study proposes a buffering and combining technique in which various I/O requests that occurred during encoding in an EC-based distributed file system are combined into one and processed. In addition, it proposes four recovery measures (disk input/output load distribution, random block layout, multi-thread-based parallel recovery, and matrix recycle technique) to distribute the disk input/output loads generated during decoding.", "venue": "Applied Sciences", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-04-07", "journal": {"name": "Applied Sciences", "pages": "3298", "volume": "11"}, "authors": [{"authorId": "37518906", "name": "Jeong-Joon Kim"}], "citations": [{"paperId": "d711fe466c7c7f0fba39a858017f10a73af13641", "title": "Cache-Based Matrix Technology for Efficient Write and Recovery in Erasure Coding Distributed File Systems"}, {"paperId": "c8b8a0b8c151a0f3b69b5a8c750eaa61e33325c0", "title": "Data Integrity Check in Distributed Storage Systems"}, {"paperId": "ce99bf71ce998916627358f2f7d6a3c0eb73f912", "title": "Data Recovery Approach with Optimized Cauchy Coding in Distributed Storage System"}, {"paperId": "48227bf3283bc684418c534f35bd23a3ab0849d1", "title": "Evaluating Erasure Codes in Dicoogle PACS"}]}
