{"paperId": "ba9b91317ab5b7091726ca23dcd19533edae76b5", "publicationVenue": null, "title": "Selecting Machine Learning Models for Student Performance Prediction Aligned with Pedagogical Objectives", "abstract": "Machine learning classifiers emerge as productive tools to develop prediction models which forecast the final outcome of the students, in a course, and provide an opportunity to the instructor to take appropriate measures. A single prediction model may not be enough to achieve all the objectives of an instructor. The selection of appropriate prediction models is yet a challenging task. This paper proposes a novel framework that applies a set of machine learning classifiers over the training dataset of a course. Along with the training dataset, the instructor clarifies the prime of objective of the binary model whether it must focus over the identification of fail, pass, or both students. The framework recommends a convenient model to achieve the specific objectives of the instructor. This research concludes that models inclined to reduce misclassification of minority class are suitable if the primary objective of the institution is the correct identification of students who are struggling to achieve the minimum course requirements. Further, a model specialized solely in amplifying the correct classification of majority class instance is appropriate if the aim is to focus on the correct identification of excellent students. The empirical analysis in this research leads towards the fact that accuracy alone is not an adequate metric to assess the performance of a model and that systematic selection of evaluation metrics is required to develop constructive models.", "venue": "2023 IEEE International Conference on Computing (ICOCO)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-10-09", "journal": {"name": "2023 IEEE International Conference on Computing (ICOCO)", "pages": "402-407"}, "authors": [{"authorId": "2105582185", "name": "I. Khan"}, {"authorId": "2280947116", "name": "Mohammed Hazli Mohamed Zabil"}, {"authorId": "2117034518", "name": "Abdul Rahim Ahmad"}, {"authorId": "2066380", "name": "N. Jabeur"}], "citations": []}
