{"paperId": "baab1a6da0fcf6733b9f2defc5e2b709198eff4d", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "A Qualitative Study on the United States Internet of Energy: A Step Towards Computational Sustainability", "abstract": "The burgeoning growth of Big Data not only matures and improves the data management efficiency and useful information extraction techniques, but also motivates the computational science researchers to come up with a new method or solution that can be repurposed for problems across the domain. Computational Sustainability joins this movement for a transferrable computational technique for sustainable development and a better future. Internet-of-energy (IoE) – leveraging IoT to smart grids associated with advanced analytics – is one of the prominent efforts in this regard. This paper presents a qualitative analysis on the elements of the energy and power management ecosystem in the United States. This qualitative study includes the Grid Overview of the United States; Weather and Climate and its impact on the entire energy generation and consumption dynamics; Peak Load Forecasting and its techniques and burgeoning challenges; Variable Renewable Energy, its reliability challenges and how we can take advantage of this variability; Commodity Prices and its criticality; Energy Disaggregation and its impact on consumption-awareness; and Generation Expansion and Decision Analysis. Besides, IoE integration, associated trade-offs, challenges, research opportunities and transferable computational techniques are addressed in this communication. Furthermore, schematics and quantitative analysis are presented in support of this study.", "venue": "IEEE Access", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2020-04-07", "journal": {"name": "IEEE Access", "pages": "69003-69037", "volume": "8"}, "authors": [{"authorId": "2976993", "name": "N. Sakib"}, {"authorId": "8947956", "name": "Eklas Hossain"}, {"authorId": "1741081", "name": "Sheikh Iqbal Ahamed"}], "citations": [{"paperId": "7e41015a16032c493144268870c267e883ddfa0a", "title": "Internet of Things-Based Control of Induction Machines: Specifics of Electric Drives and Wind Energy Conversion Systems"}, {"paperId": "d4e4b81231b3d4025d2ffdc4ce1fefce9095d6de", "title": "Advancing Resilience in Green Energy Systems: Comprehensive Review of AI-based Data-driven Solutions for Security and Safety"}, {"paperId": "618c9480ce43017fa4ab035378441d87b022ab1e", "title": "Design of a Smart Energy Meter and Monitoring System for Industrial and Residential Use Based on the Internet of Things"}, {"paperId": "bf947b985ef5ec61cdf99d4791cdfe1f6ec1d34c", "title": "A Construction of Smart Grid Authentication and Key Agreement System Using ECC Cryptography"}, {"paperId": "49d8db4fef0893b5afafb538ac6e114f448e4bb8", "title": "The Claimed Functions of A Thyristor Voltage and Power Regulator Research"}, {"paperId": "1009e61bb4e618f98656666d756889c036022aab", "title": "IoT Based Real Time Energy Billing and Monitoring"}, {"paperId": "759a364ca032ddabdad4708708d41e6dd3074de7", "title": "Towards Feasible Solutions for Load Monitoring in Quebec Residences"}, {"paperId": "b55114e0205041b8b36fb6436cb60b1a29b72d38", "title": "Intelligent Management of the Electricity Distribution Network based on the Internet of Energy"}, {"paperId": "9a03b31986da88c593ff4d49e25996a66669057f", "title": "Design and Control of a Quasi-Z Source Multilevel Inverter Using a New Reaching Law-Based Sliding Mode Control"}, {"paperId": "e6fe9f28b92983a32ab83295dc927f44657b0de0", "title": "The Core of a Smart Grid: Internet of Energy and Machine Learning"}, {"paperId": "08606055dfdb3d51d668ccf7d56b2ee85e0195a8", "title": "An authentication and key agreement scheme for smart grid"}, {"paperId": "da61944c491ff963c9aa1bd5722e87e24084fc7f", "title": "A survey on internet of energy security: related fields, challenges, threats and emerging technologies"}, {"paperId": "7f23f347842e43538973de5e3588b767a8482e83", "title": "Causes of Delay in Smart and Complex Construction Projects"}, {"paperId": "dc2d76d9bd7ff8a84acf225fd5e597f705c2c7b5", "title": "Internet of Things-Based Smart Electricity Monitoring and Control System Using Usage Data"}, {"paperId": "6be48f8541939db468892ee6d3f1dc9301a44e8f", "title": "5G Wireless Networks in the Future Renewable Energy Systems"}, {"paperId": "21713a05339416bf738f1f88601e83535623e747", "title": "An Efficient Resource Management Scheme for Smart Grid Using GBO Algorithm"}, {"paperId": "ab8dcce11ff2f1a3bf7f37e8966a1a47fc6741f7", "title": "A Systematic Review on Cognitive Radio in Low Power Wide Area Network for Industrial IoT Applications"}, {"paperId": "f2f734b4fc0f85baa2398fe65e702b7a21a40220", "title": "TFBN: A Cost Effective High Performance Hierarchical Interconnection Network"}, {"paperId": "373d89b5ceff28bac75b749e5b4afbafadf03759", "title": "Date of publication xxxx 00, 0000, date of current version xxxx 00, 0000"}, {"paperId": "8a5ba47202cfe7df40307d1385eeb53be7eb38e8", "title": "HSIC Bottleneck Based Distributed Deep Learning Model for Load Forecasting in Smart Grid With a Comprehensive Survey"}]}
