{"paperId": "bab765aece0fe04aa6092057af57cf6d8492e38e", "publicationVenue": {"id": "7b6a98e2-3c5c-4a3c-a790-8b0256f0c569", "name": "International Universities Power Engineering Conference", "type": "conference", "alternate_names": ["UPEC", "Int Univ Power Eng Conf"]}, "title": "Overview of the Clustering Algorithms for the Formation of the Bidding Zones", "abstract": "This paper presents an overview of the concepts, features and methods used in model-based approaches for the determination of the bidding zones in multi-regional interconnected networks. The main aspects are discussed on the basis of a set of selected articles taken from the scientific literature. The solution schemes are mainly based on clustering algorithms. The main conclusions are that no prevailing solution emerges, and that further insights are needed, also with the incorporation of specific knowledge taken from the nature of the problem in the solution methods and indicators.", "venue": "International Universities Power Engineering Conference", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference", "Review"], "publicationDate": "2019-09-01", "journal": {"name": "2019 54th International Universities Power Engineering Conference (UPEC)", "pages": "1-6"}, "authors": [{"authorId": "1712403", "name": "G. Chicco"}, {"authorId": "146827462", "name": "Giuseppina Nuzzo"}, {"authorId": "1914015", "name": "P. Colella"}, {"authorId": "150903462", "name": "Andrea Griffone"}, {"authorId": "48058751", "name": "A. Russo"}, {"authorId": "1591132252", "name": "Yang Zhang"}, {"authorId": "31886793", "name": "E. Carlini"}, {"authorId": "3450559", "name": "M. Caprabianca"}, {"authorId": "1403760145", "name": "F. Quaglia"}, {"authorId": "1403634838", "name": "L. Luzi"}], "citations": [{"paperId": "c2da9a2076c91722900b703a76e0e078eeaed982", "title": "Advanced Model-based Approaches to be Applied in the Context of a Bidding Zone Review"}, {"paperId": "4a2d86f61f5b3b5c12fa9966a3a6827a49d7048d", "title": "Improved selection of critical network elements for flow-based market coupling based on congestion patterns"}, {"paperId": "cc4cb260bee68683399c801157803d8e16fdaca6", "title": "Optimal Computation of Network Indicators for Electricity Market Bidding Zones Configuration Considering Explicit N-1 Security Constraints"}, {"paperId": "b85f0790f18fc0af64db20390aa46daa480dc718", "title": "Reduced Grid Representation through Proper Orthogonal Decomposition"}, {"paperId": "5062ea5f43f1c13b9629835a3e790f2829266905", "title": "Model-Based Identification of Alternative Bidding Zones: Applications of Clustering Algorithms with Topology Constraints"}, {"paperId": "fab528c7e538cce3962b912b82707acead443b21", "title": "Frequency Stability of the European Interconnected Power System Under Grid Splitting in Market Zones"}, {"paperId": "d1fb862e392452913b4b9baabe63a479045d511d", "title": "Model-based Identification of Alternative Bidding Zone Configurations from Clustering Algorithms Applied on Locational Marginal Prices"}, {"paperId": "68d6b26ad5982cdec2a756d1c1663d9313f3697f", "title": "Optimal Computation of Network Indicators for Electricity Market Bidding Zones Configuration"}, {"paperId": "aee9f97fc04e557697d9c901c829bd8ed9c17739", "title": "Applications of Clustering Techniques to the Definition of the Bidding Zones"}, {"paperId": "042efee1e67dc38727158b82003d10e5b6760f7c", "title": "Creation of a computational framework for the European transmission grid with Power-to-Gas"}, {"paperId": "e0057f559c68bf0d08a21b02abe51029e8c92095", "title": "Review of the Mathematic Models to Calculate the Network Indicators to Define the Bidding Zones"}, {"paperId": "33df305931e6c4077349bd8c21ebe7396c57b287", "title": "Optimal Bidding Zone Configuration: Investigation on Model-based Algorithms and their Application to the Italian Power System"}]}
