{"paperId": "bac79e1374a5fef6fcccf1ea48fbac64a0600b8e", "publicationVenue": {"id": "bc946b89-5188-4a8f-b9b6-61b71dd9fccc", "name": "Journal of Network and Computer Applications", "type": "journal", "alternate_names": ["J Netw Comput Appl", "Journal of Network Computing and Applications"], "issn": "1084-8045", "alternate_issns": ["2371-9206"], "url": "http://www.elsevier.com/wps/find/journaldescription.cws_home/622893/description#description", "alternate_urls": ["https://www.journals.elsevier.com/journal-of-network-and-computer-applications", "http://www.clausiuspress.com/journal/JNCA/", "http://www.sciencedirect.com/science/journal/10848045"]}, "title": "AI Augmented Edge and Fog Computing: Trends and Challenges", "abstract": "In recent years, the landscape of computing paradigms has witnessed a gradual yet remarkable shift from monolithic computing to distributed and decentralized paradigms such as Internet of Things (IoT), Edge, Fog, Cloud, and Serverless. The frontiers of these computing technologies have been boosted by shift from manually encoded algorithms to Artificial Intelligence (AI)-driven autonomous systems for optimum and reliable management of distributed computing resources. Prior work focuses on improving existing systems using AI across a wide range of domains, such as efficient resource provisioning, application deployment, task placement, and service management. This survey reviews the evolution of data-driven AI-augmented technologies and their impact on computing systems. We demystify new techniques and draw key insights in Edge, Fog and Cloud resource management-related uses of AI methods and also look at how AI can innovate traditional applications for enhanced Quality of Service (QoS) in the presence of a continuum of resources. We present the latest trends and impact areas such as optimizing AI models that are deployed on or for computing systems. We layout a roadmap for future research directions in areas such as resource management for QoS optimization and service reliability. Finally, we discuss blue-sky ideas and envision this work as an anchor point for future research on AI-driven computing systems.", "venue": "Journal of Network and Computer Applications", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-08-01", "journal": {"name": "J. Netw. Comput. Appl.", "pages": "103648", "volume": "216"}, "authors": [{"authorId": "145780334", "name": "Shreshth Tuli"}, {"authorId": "70547270", "name": "Fatemeh Mirhakimi"}, {"authorId": "73461365", "name": "Samodha Pallewatta"}, {"authorId": "70272436", "name": "Syed Zawad"}, {"authorId": "144805467", "name": "G. Casale"}, {"authorId": "145762058", "name": "B. Javadi"}, {"authorId": "145552742", "name": "Feng Yan"}, {"authorId": "1709598", "name": "R. Buyya"}, {"authorId": "144626042", "name": "N. Jennings"}], "citations": [{"paperId": "ad1592d176ab1e5e9a74720f3bfbe7185530f512", "title": "A comprehensive survey of energy-efficient computing to enable sustainable massive IoT networks"}, {"paperId": "4b9c0f7c583fc86f1687bac38bdfbb92e870ff83", "title": "Autonomous Vehicles: Evolution of Artificial Intelligence and Learning Algorithms"}, {"paperId": "a20e09367bf3db30299dde38041d73d9d405038c", "title": "AI Lifecycle Zero-Touch Orchestration within the Edge-to-Cloud Continuum for Industry 5.0"}, {"paperId": "dd16c3280a974f2e73cd5b06696a0a3415978dbb", "title": "Performance Evaluation of Split Computing with TinyML on IoT Devices"}, {"paperId": "6d74f2b5dea2c9362930f1ed0a59fc1c11a62bbd", "title": "PoSiF: A Transient Content Caching and Replacement Scheme for ICN-IoT"}, {"paperId": "02c1625a9a8355e952e4a47bba47c6b5fec50317", "title": "GSC: Generalizable Service Coordination"}, {"paperId": "6fb4afe18f4e932cad91cadede132a4c66609c83", "title": "Intelligent Computing in Communication Networks: Challenges, Solutions, and Research Prospects"}, {"paperId": "b4d9ebea5bb1c930b76ba4c870deb27ac127bbdb", "title": "Physics-Informed Quantum Machine Learning: Solving nonlinear differential equations in latent spaces without costly grid evaluations"}, {"paperId": "f4a27c359931f6f13e6ead02580cb1b48849b609", "title": "DiffAR: Adaptive Conditional Diffusion Model for Temporal-augmented Human Activity Recognition"}, {"paperId": "0a9d26783ad131e59e08ca3855ecc133a51f5d42", "title": "OptIForest: Optimal Isolation Forest for Anomaly Detection"}, {"paperId": "f37044ff03a65cc713a3bc5b8835026cf7b1cca1", "title": "A Clustering-Based Routing Protocol Using Path Pattern Discovery Method to Minimize Delay in VANET"}, {"paperId": "46032071735b70b50990ac35c383aa9481309d92", "title": "Unsupervised Deep Subgraph Anomaly Detection"}, {"paperId": "2a29c14ea9470ad7fdbb977b16ed34f4bba8c3f9", "title": "Visual Transformer Meets CutMix for Improved Accuracy, Communication Efficiency, and Data Privacy in Split Learning"}, {"paperId": "15a00bd29b389117f387d9fb4514753e07e141a0", "title": "A multi-modal tourist trip planner integrating road and pedestrian networks"}, {"paperId": "f6d3fa985460a6fa226afea2ea81902f04b6d296", "title": "Security of Building Automation and Control Systems: Survey and Future Research Directions"}, {"paperId": "8665ea4d54dfab156f02c9d656d48dedbaef501e", "title": "Text File Privacy on the Cloud Based on Diagonal Fragmentation and Encryption"}, {"paperId": "0d2818f1070fa5a6cf5d14a87a5d71b4107b4d60", "title": "Anomaly detection with variational quantum generative adversarial networks"}, {"paperId": "a10992c9a5afa37b7986a2cae77ae14be9b04a60", "title": "Sustainability Measures: An Experimental Analysis of AI and Big Data Insights in Industry 5.0"}, {"paperId": "32b6cdfa9f35d37566a314b7bf3e2ad76ed56ee4", "title": "Augmented Reality and AI: An Experimental Study of Worker Productivity Enhancement"}, {"paperId": "68b4944b7e92a8705caa6cdc621dcae3b8a13cf4", "title": "A Systematic Literature Review of Offensive and Defensive Security Solutions With Software Defined Network"}, {"paperId": "5aab992ca10d5b031fc7fd96a5df5cd2c6d7bd9c", "title": "A Survey of Internet of Medical Things (IoMT) Applications, Architectures and Challenges in Smart Healthcare Systems"}, {"paperId": "3203a589155a01b30498a8bc46bebb25bfb2319a", "title": "Dynamic Data Sample Selection and Scheduling in Edge Federated Learning"}, {"paperId": "20f5313d1fbda40d4b093a6b1a8dce83f8d452ff", "title": "Three Level Heterogeneous Zonal Stable Election Protocol for Energy Efficiency in Wireless Sensor Networks"}]}
