{"paperId": "bacda157c572161a7081b8c920b4b9b473d1b16a", "publicationVenue": {"id": "983b0731-eddf-4f05-9c9b-81059a9f9c51", "name": "IEEE Transactions on Vehicular Technology", "type": "journal", "alternate_names": ["IEEE Trans Veh Technol"], "issn": "0018-9545", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=25", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=25"]}, "title": "Dynamic Network Slicing and Resource Allocation in Mobile Edge Computing Systems", "abstract": "The application of network slicing to mobile edge computing (MEC) systems has aroused great interests from both academia and industry. However, the optimization of network slicing and MEC in most existing research works only focuses on resource slicing, energy scheduling, and power allocation from the perspective of mobile devices, without considering the operator's revenue. In this paper, we propose a novel framework for network slicing in MEC systems, including slice request admission and a revenue model, to investigate the operator's revenue escalation problem while considering traffic variations. The revenue model is mainly composed of the longer-term revenue and short-term revenue. Particularly, we jointly optimize slice request admission in the long-term and resource allocation in the short-term to maximize the operator's average revenue. By employing the Lyapunov optimization technique, we develop an algorithm without requiring any prior-knowledge of traffic distributions, referred to as the DNSRA, to solve the problem. To reduce the computational complexity of directly solving the DNSRA, we decouple the optimization variables for efficient algorithm design. By this, the strategies for user association and CPU-cycle frequency are obtained in closed forms, respectively. Power allocation and subcarriers assignment are obtained by employing the successive convex approximation approach. Meanwhile, we develop a heuristic algorithm to obtain the dynamic slice request admission decision. Simulation results show that the proposed DNSRA can strike a flexible balance between the average revenue and the average delay, and can significantly increase the operator's revenue against existing schemes.", "venue": "IEEE Transactions on Vehicular Technology", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-05-06", "journal": {"name": "IEEE Transactions on Vehicular Technology", "pages": "7863-7878", "volume": "69"}, "authors": [{"authorId": "2109020134", "name": "Jie Feng"}, {"authorId": "39718931", "name": "Qingqi Pei"}, {"authorId": "2273653172", "name": "F. Richard Yu"}, {"authorId": "1680129", "name": "Xiaoli Chu"}, {"authorId": "2477880", "name": "Jianbo Du"}, {"authorId": "4096586", "name": "Li Zhu"}], "citations": [{"paperId": "5cd9d861a5568826e49346bd1ee9421d03f08a6f", "title": "Age-of-Information-Aware Distributed Task Offloading and Resource Allocation in Mobile Edge Computing Networks"}, {"paperId": "cd0a550d674e56b4291bfbbd799322ef49cb4801", "title": "Ultrareliable Low-Latency Slicing in Space–Air–Ground Multiaccess Edge Computing Networks for Next-Generation Internet of Things and Mobile Applications"}, {"paperId": "1147abfe3cd999e316c7fe46fd6b5d1fc4ad0d32", "title": "Multi-Agent Reinforcement Learning for Slicing Resource Allocation in Vehicular Networks"}, {"paperId": "0d3656df2693ca247688685f35a0fe42588d2283", "title": "Delay-Sensitive Resource Allocation for IoT Systems in 5G O-RAN Networks"}, {"paperId": "44b38458c09668fd09e3a0f217c081d919ed85eb", "title": "Multidimensional Resource Fragmentation-Aware Virtual Network Embedding for IoT Applications in MEC Networks"}, {"paperId": "b26a65d82cef14f4a7ae29b1dcc47748572ed051", "title": "Demand-Oriented Fog-RAN Slicing With Self-Adaptation via Deep Reinforcement Learning"}, {"paperId": "d1067860eeff01f6100b5837e2741615ef447435", "title": "Adaptive Resource Management for Edge Network Slicing using Incremental Multi-Agent Deep Reinforcement Learning"}, {"paperId": "740708f080148ef8e8a718d9f1f5edff07f167ee", "title": "Blockchain-Based Computing Resource Trading in Autonomous Multi-Access Edge Network Slicing: A Dueling Double Deep Q-Learning Approach"}, {"paperId": "96d6de909d436a09b4ba073e7cf08ec0138eae6c", "title": "Toward Resilient Network Slicing for Satellite–Terrestrial Edge Computing IoT"}, {"paperId": "37dfc03c6b74c2b1afb1e5d76c5a0ea62f513c59", "title": "Resource Allocation for Coupled Slices in Edge-Assisted Industrial IoT Systems"}, {"paperId": "af044fa38ce5e92e320eba29388b9d48d397baad", "title": "Reconfigurable Intelligent Surface Assisted MEC Offloading in NOMA-Enabled IoT Networks"}, {"paperId": "4e8fe2effddd32eaf3a1c5c6c1f11d7059824ec0", "title": "Dynamic Multi-Time Scale User Admission and Resource Allocation for Semantic Extraction in MEC Systems"}, {"paperId": "80d1dc83c4e1885459a796fb3f899c21ddf71d87", "title": "Joint Computing Offloading and Resource Allocation for Classification Intelligent Tasks in MEC Systems"}, {"paperId": "cd379aba97212ad191d0c08ec22b72c4dbc7f804", "title": "Hybrid Multiple Access for Network Slicing Aware Mobile Edge Computing"}, {"paperId": "221c217ac9c3aa3b8494ece4d64145e3f6228c35", "title": "Probabilistic-Assured Resource Provisioning With Customizable Hybrid Isolation for Vertical Industrial Slicing"}, {"paperId": "d8b7d0af78bcc09063f81b25349965a129ac7046", "title": "Revenue Maximization of a Slice Broker in the Presence of Byzantine Faults"}, {"paperId": "bdb671d3cb0a08ca9482b3cf6ac6612b859bbf27", "title": "Resource Management in Mobile Edge Computing: A Comprehensive Survey"}, {"paperId": "c33b430f427a1568bc857e5e24f39d707f8e47cb", "title": "Multidimensional Resource Fragmentation-Aware Virtual Network Embedding in MEC Systems Interconnected by Metro Optical Networks"}, {"paperId": "2497785ab10c2d9fa0728b502c8c2848474c16ff", "title": "Deep Q-Learning-Based Dynamic Network Slicing and Task Offloading in Edge Network"}, {"paperId": "029b760d2ec8b133ff8c076c8190998803d7cb04", "title": "Computing Offloading and Semantic Compression for Intelligent Computing Tasks in MEC Systems"}, {"paperId": "a0bc3a43ba60268a72e2a9ed0bc91c77755b24ae", "title": "Intelligent and survivable resource slicing for 6G-oriented UAV-assisted edge computing networks"}, {"paperId": "cf55d76b9c8ae8b75a75cf44e2f8cb721cec5e83", "title": "A Network Function Parallelism-Enabled MEC Framework for Supporting Low-Latency Services"}, {"paperId": "271c6515b897a7058c96f53ae71569d10a437533", "title": "Revenue-Model Learning for a Slice Broker in the Presence of Adversaries"}, {"paperId": "96b21336219d4e40e1d4cca8fd596730e660bce5", "title": "Computing Power Network: A Survey"}, {"paperId": "1fb280292e66adb9993929443087bd5435190ae9", "title": "PDRAS: Priority-Based Dynamic Resource Allocation Scheme in 5G Network Slicing"}, {"paperId": "ee0ddc77adfd6b45d5f316d480279f67c6d8c430", "title": "Utility Optimization for Resource Allocation in Multi-Access Edge Network Slicing: A Twin-Actor Deep Deterministic Policy Gradient Approach"}, {"paperId": "f99eade553055de1a953bbfc27ec5f0d751e7ca4", "title": "A Normalized Slicing-assigned Virtualization Method for 6G-based Wireless Communication Systems"}, {"paperId": "9f8e598e05b7efae4d3372cb62e0b4be720c24d7", "title": "Software-defined Dynamic 5G Network Slice Management for Industrial Internet of Things"}, {"paperId": "e161c7131d1ea6b13fe97a2458869d6720db393e", "title": "A DQN-based Joint Spectrum and Computing Resource Allocation Algorithm for Multi-Service MEC Networks"}, {"paperId": "12b8b38f598765af247a15dd19fa1b8551dcf832", "title": "Wireless Resource Allocation based on Multiplexing and Isolation in Sliced 5G Networks"}, {"paperId": "d340876099f043ad5c25a06b73cea87af35cd4ee", "title": "Stability-oriented RAN slicing based on joint communication and computation offloading"}, {"paperId": "782c9e41247931cbd25d3e48dcb4d9deebac3c19", "title": "Modeling and analysis of a cooperative service network"}, {"paperId": "0e97a2f2a9ccc735d0125089d075e43fdd42793f", "title": "A Resoure Allocation Framework for Network Slicing with Multi-service Coexistence"}, {"paperId": "24ddf4387359e4a1c285ba6e49c9f38af2d80481", "title": "Battery-constrained Federated Edge Learning in UAV-enabled IoT for B5G/6G Networks"}, {"paperId": "d79c866b19209130d462245afaae47bd18a636c3", "title": "Constrained Reinforcement Learning for Resource Allocation in Network Slicing"}, {"paperId": "84dfe09992573c57d312625f3d90b69a10ee3ea6", "title": "Delay Minimization in Sliced Multi-Cell Mobile Edge Computing (MEC) Systems"}, {"paperId": "30ad1f0688c39d74e0d06865c79b8fc5569b44ae", "title": "On Energy Efficiency Optimization for Network Slices in 5G Power Communication System"}, {"paperId": "5e2dfc37b41a3018f6574eca023813a59033b7c3", "title": "Deep Reinforcement Learning based Dynamic Edge/Fog Network Slicing"}, {"paperId": "812423d5e1b4f5885abcd074605eeb5d4359e661", "title": "Resource Management and Quality of Service Provisioning in 5G Cellular Networks"}, {"paperId": "e9260358464cbb2c22cb6b103d8c52732bb3c505", "title": "Research allocation in mobile volunteer computing system: Taxonomy, challenges and future work"}, {"paperId": "f0c8e36ffcab4953d258ae846631f3e3b1b5c2c8", "title": "Dynamic 5G Network Slice Management Middleware for Industrial Internet of Things: Industry Paper"}, {"paperId": "d378c1ac188e0f763988bec8083df6405466ea4f", "title": "Enabling Precision Medicine via Contemporary and Future Communication Technologies: A Survey"}, {"paperId": "e0559be6bf3cb7a33d569fa87e65719ec478858a", "title": "Organizational Resource Allocation by Mobile Edge Computing in the Context of the Internet of Things"}, {"paperId": "2ca91803f2fea54dd0a49ebc6c0d491268c4cb3c", "title": "Cloud-Native Network Slicing Using Software Defined Networking Based Multi-Access Edge Computing: A Survey"}, {"paperId": "ece442167dfce7458a15b1285f01082d82e6ca59", "title": "Integration of D2D, Network Slicing, and MEC in 5G Cellular Networks: Survey and Challenges"}, {"paperId": "127d9baa1ab2e658a38c6c1e8a715fee20c0cd68", "title": "Dynamic Resource Allocation Scheme and Deep Deterministic Policy Gradient-Based Mobile Edge Computing Slices System"}, {"paperId": "24394257b51c0502d2c4ebaa0fbc637de3fb18c5", "title": "Resource Allocation in Multi-access Edge Computing (MEC) Systems: Optimization and Machine Learning Algorithms"}, {"paperId": "1697b4a37ecc65bc5335117fe8f7826f2a8cbd47", "title": "Multi-Access Edge Computing: A Survey"}, {"paperId": "730f80dacc327d4e619ec026d46f672920df0214", "title": "Energy-Efﬁcient Resource Allocation for Slicing-enabled Multi-access Edge Computing"}]}
