{"paperId": "bad04562c4e3440b9304e0e59236247cafb6f628", "publicationVenue": {"id": "a608b572-eb7b-4233-8884-8abf9b59a3fc", "name": "International Journal of Religion", "type": "journal", "alternate_names": ["Int J Relig"], "issn": "2633-352X"}, "title": "Employing Characters in the (Shayout's Novel) By (Hatem Hussein Hatem): Study in Narrative Mechanism", "abstract": "The Arabic novel has witnessed great demand at the present time by readers, critics, and researchers. This is due to the importance of the novel; In that it was one of the most famous types of prose literary arts in absorbing reality and portraying it in a brilliant artistic manner. Given the remarkable development that the Saudi novel has witnessed and its prominent position in the Arab literary space; I devoted my studies to talking about a novel from Najran literature (Shayuot) by the writer (Hatem Hussein Hatem). In my research, I focused on the personality element. Its role in constructing the novel and presenting its events. It also focused on the mechanisms of recruiting the main characters in the novel, and the relationship of the character element to other narrative elements: (place, time, language, and plot). Based on the structural approach; In that it was the most appropriate method for analyzing and studying fictional works. In this study, I tried to answer the following problems: Mechanisms for the writer’s use of novel characters in his novel? How were the main characters embodied in the novel?  The extent to which the writer linked the main characters of the novel to the other artistic elements of the narrative, and how did that linking affect the pace of narration in the novel? Research goals:  Introduction to storytelling, and clarifying the elements of narrative in the Arabic novel.  The study of the character in the Arabic novel: its concept, its dimensions.  Extrapolation of the main characters in the novel (Shayout) by Hatem Hussein Hatem.  Clarification of the character's relationship - being an essential element of the narrative - to other narrative elements (place, language, events).  Revive the Najran environment by revealing the accent, and the Najran heritage of the main characters in the novel. Research literature: The idea of the project has come to support the link between literature and society, as the specialized studies in Najran literature are almost too few, including:   The Poetry Movement in Najran in Pre-Islamic times and the beginning of Islam, Fayza Raddad Al-Otaibi, published by the Najran Literary Club 1430 (published master’s thesis).  Boys' games in ancient Arabic poetry and the extent to which they are associated with Najran games in modern times, Dr. Essam Muhammad Qabisi, Dr. Zuhair bin Hassan al-Omari, Journal of the Faculty of Science of the University of Fayoum, 2014.             The Proverbs of Najran region: Objective study, Dr. Zuhair bin Hassan Al-Omari, Journal of the Faculty of Dar Al-Ulum, Cairo University, 2016.  Zaid bin Abdul Madan Al-Najrani: His political role and literary heritage between two times, Dr. Awad bin Abdullah bin Nahi, dr. Essam Muhammad Qabisi, Journal of the University of Pesha for Humanities, 2022. Research curriculum: In my study, I relied on the structural curriculum and the analytical curriculum; In clarifying the mechanisms for the recruitment of narrative elements, the character's relationship with other narrative elements, as well as the use of some other curricula, such as psychological curriculum and descriptive; who help reach the depths of the novelist's character and analyze it. Research Plan:   First topic, the concept of narrative, and the definition of its elements.  The second topic: Character concept, dimensions.  Third topic: The main characters, and their dimensions in Shyuot's novel.  Fourth topic: The relationship between characters and other narrative elements.  Fifth topic: Reviving the Najran environment in the Shyuot novel.  Then the conclusion: with the most important conclusions and recommendations, and then indexes.", "venue": "International Journal of Religion", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-01-24", "journal": {"name": "International Journal of Religion"}, "authors": [{"authorId": "2281165647", "name": "Rasha Abdul Rauf Al-Habishi"}, {"authorId": "2281166098", "name": "Wafa Alayan Elias Al-Shudayfat"}], "citations": []}
