{"paperId": "bad77e7c22eee42a23fba4f0e6fec82fe27c7c2a", "publicationVenue": {"id": "501c1070-b5d2-4ff0-ad6f-8769a0a1e13f", "name": "Wireless Communications and Mobile Computing", "type": "journal", "alternate_names": ["Wirel Commun Mob Comput"], "issn": "1530-8669", "url": "https://www.hindawi.com/journals/wcmc/", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/15308677", "http://www.interscience.wiley.com/jpages/1530-8669/"]}, "title": "DS-Harmonizer: A Harmonization Service on Spatiotemporal Data Stream in Edge Computing Environment", "abstract": "Abundant sensors in various types are widely used in modern cities to comprehend the current situations in real time. The raw data in open conditions is always in low quality and is hard to employ directly due to its imperfect or missing records. Traditional data preprocessing methods focus on the offline historical data and remain a dilemma between the efficiency and the overhead. In this paper, a data harmonization service DS-Harmonizer is proposed on spatiotemporal data stream in the edge computing environment. Through the online cleaning and complementing steps of the hierarchical service instances, the records’ validity and continuity can be guaranteed in an efficient way. On the simulated data in a practical project, the service shows high performance, low latency, and acceptable precision in extensive conditions.", "venue": "Wireless Communications and Mobile Computing", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-08-05", "journal": {"name": "Wirel. Commun. Mob. Comput.", "pages": "9354273:1-9354273:12", "volume": "2018"}, "authors": [{"authorId": "144906993", "name": "Weilong Ding"}, {"authorId": "1726448", "name": "Zhuofeng Zhao"}], "citations": [{"paperId": "13f2f3186dd2b5352bfa262bc11b1a4aefc0a5e5", "title": "STDA-Meta: A Meta-Learning Framework for Few-Shot Traffic Prediction"}, {"paperId": "4eb59de57a09bc58bc9e4b7715bb9fc4977e79ca", "title": "Phased Deep Spatio-temporal Learning for Highway Traffic Volume Prediction"}, {"paperId": "19310a57ee8ec870c157dc3e2bf015d36216230b", "title": "Multi-graph Spatio-temporal Graph Convolutional Network for Traffic Flow Prediction"}, {"paperId": "895592b503a89f722ae9e264a2021f9dc36fb765", "title": "A Higher-Order Motif-Based Spatiotemporal Graph Imputation Approach for Transportation Networks"}, {"paperId": "f19f47507bc757ed85149e9677ca505a0bac5789", "title": "A Graph Convolutional Method for Traffic Flow Prediction in Highway Network"}, {"paperId": "a5c936b143f3e693969024876dc6443eaf619cfc", "title": "Potential trend discovery for highway drivers on spatio‐temporal data"}, {"paperId": "83ecdb3ff9e0515fc39a714355647168f612790b", "title": "Task Allocation in Hybrid Big Data Analytics for Urban IoT Applications"}, {"paperId": "5ab9fab36a064af17c267e666ecd06c4fdf094bc", "title": "An ensemble-learning method for potential traffic hotspots detection on heterogeneous spatio-temporal data in highway domain"}, {"paperId": "e2ef0256e3282b0430d9532b67eb1b703fb73c52", "title": "CO-STAR: A collaborative prediction service for short-term trends on continuous spatio-temporal data"}, {"paperId": "c589d2787b57be095aab17e1708ecce50d69d117", "title": "Geographic and Temporal Deep Learning Method for Traffic Flow Prediction in Highway Network"}, {"paperId": "dca1c5a8146b1f4b74a3257de3b423292c018dce", "title": "An Efficient Interpolation Method Through Trends Prediction in Smart Power Grid"}, {"paperId": "e204578b56ab57b4769009bc281a7328308a3293", "title": "Trend Drift Discovery for Individual Highway Drivers through Ensemble Learning"}, {"paperId": "6bf2b266ab912600f6e11fc1f5658986ea42b5f6", "title": "An Initial Approach to a Multi-access Edge Computing Reference Architecture Implementation Using Kubernetes"}]}
