{"paperId": "bae184c5ca8a95d0e37af0036e7c46fba62fa855", "publicationVenue": null, "title": "The Use of Decision Support in Search and Rescue: A Systematic Literature Review", "abstract": "Whenever natural and human-made disasters strike, the proper response of the concerned authorities often relies on search and rescue services. Search and rescue services are complex multidisciplinary processes that involve several degrees of interdependent assignments. To handle such complexity, decision support systems are used for decision-making and execution of plans within search and rescue operations. Advances in data management solutions and artificial intelligence technologies have provided better opportunities to make more efficient and effective decisions that can lead to improved search and rescue operations. This paper provides findings from a bibliometric mapping and a systematic literature review performed to: (1) identify existing search and rescue processes that use decision support systems, data management solutions, and artificial intelligence technologies; (2) do a comprehensive analysis of existing solutions in terms of their research contributions to the investigated domain; and (3) investigate the potential for knowledge transfer between application areas. The main findings of this review are that non-conventional data management solutions are commonly used in land rescue operations and that geographical information systems have been integrated with various machine learning approaches for land rescue. However, there is a gap in the existing research on search and rescue decision support at sea, which can motivate future studies within this specific application area.", "venue": "ISPRS Int. J. Geo Inf.", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-04-25", "journal": {"name": "ISPRS Int. J. Geo Inf.", "pages": "182", "volume": "12"}, "authors": [{"authorId": "134869360", "name": "Wajeeha Nasar"}, {"authorId": "30907932", "name": "Ricardo da Silva Torres"}, {"authorId": "1709908", "name": "Odd Erik Gundersen"}, {"authorId": "35114912", "name": "Anniken Thoresen Karlsen"}], "citations": [{"paperId": "0ee18619cc0846687fcaf5deb87939b230d4b992", "title": "Methodologies and Handling Techniques of Large-Scale Information in Decision Support Systems for Complex Missions"}, {"paperId": "caa4c8d60d400c7ef5e7ff70b08f2d8862a60de3", "title": "Secure Integration of ioT-Enabled Sensors and Technologies: Engineering Applications for Humanitarian Impact"}]}
