{"paperId": "bae91df48c9107147042e55573c055360923e1df", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "A Comprehensive Survey on Vector Database: Storage and Retrieval Technique, Challenge", "abstract": "A vector database is used to store high-dimensional data that cannot be characterized by traditional DBMS. Although there are not many articles describing existing or introducing new vector database architectures, the approximate nearest neighbor search problem behind vector databases has been studied for a long time, and considerable related algorithmic articles can be found in the literature. This article attempts to comprehensively review relevant algorithms to provide a general understanding of this booming research area. The basis of our framework categorises these studies by the approach of solving ANNS problem, respectively hash-based, tree-based, graph-based and quantization-based approaches. Then we present an overview of existing challenges for vector databases. Lastly, we sketch how vector databases can be combined with large language models and provide new possibilities.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-10-18", "journal": {"name": "ArXiv", "volume": "abs/2310.11703"}, "authors": [{"authorId": "2260277757", "name": "Yikun Han"}, {"authorId": "2260828894", "name": "Chunjiang Liu"}, {"authorId": "2260285099", "name": "Pengfei Wang"}], "citations": [{"paperId": "49b95e7fe5d028494b3f624e16d0601c6ffc713f", "title": "Science Checker Reloaded: A Bidirectional Paradigm for Transparency and Logical Reasoning"}, {"paperId": "16c816201eb629a758676a3c1fa4cead50e5f412", "title": "When Large Language Models Meet Vector Databases: A Survey"}, {"paperId": "e781cc14d27af9d6cfd23d685a96ef96d6da2c60", "title": "A systematic review of geospatial location embedding approaches in large language models: A path to spatial AI systems"}, {"paperId": "e49a005eed92bbb8b797fb1bdc056e431f60f337", "title": "Vectorizing string entries for data processing on tables: when are larger language models better?"}, {"paperId": "ee3e676d716d0c7fac1b8ef9456677d8f24bad57", "title": "Translation Aligned Sentence Embeddings for Turkish Language"}]}
