{"paperId": "baeabbd0b0cf14de63782b4093dd8f63763f6e8c", "publicationVenue": {"id": "6175efe8-6f8e-4cbe-8cee-d154f4e78627", "name": "Mathematics", "issn": "2227-7390", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-283014", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-283014", "https://www.mdpi.com/journal/mathematics"]}, "title": "A Survey on Big Data Technologies and Their Applications to the Metaverse: Past, Current and Future", "abstract": "The development of big data technologies, which have been applied extensively in various areas, has become one of the key factors affecting modern society, especially in the virtual reality environment. This paper provides a comprehensive survey of the recent developments in big data technologies, and their applications to virtual reality worlds, such as the Metaverse, virtual humans, and digital twins. The purpose of this survey was to explore several cutting-edge big data and virtual human modelling technologies, and to raise the issue of future trends in big data technologies and the Metaverse. This survey investigated the applications of big data technologies in several key areas—including e-health, transportation, and business and finance—and the main technologies adopted in the fast-growing virtual world sector, i.e., the Metaverse.", "venue": "Mathematics", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-12-26", "journal": {"name": "Mathematics"}, "authors": [{"authorId": "2154930282", "name": "Haolan Zhang"}, {"authorId": "2144571120", "name": "Sanghyuk Lee"}, {"authorId": "48517893", "name": "Yifan Lu"}, {"authorId": "2174315129", "name": "Xin Yu"}, {"authorId": "3473563", "name": "Huanda Lu"}], "citations": [{"paperId": "84f49a22fdf40f8d7cb15b87a94d8b7001199946", "title": "Government in the metaverse: Requirements and suitability for providing digital public services"}, {"paperId": "7b8c6f33f6ce504c7ff535dd79db625f47036a90", "title": "Human-Centered Interaction in Virtual Worlds: A New Era of Generative Artificial Intelligence and Metaverse"}, {"paperId": "03a920c4a29ed05cab28ac87fff5900ca37bb6ec", "title": "Finite State Automata on Multi-Word Units for Efficient Text-Mining"}, {"paperId": "60553ad587370d9a374910fda4927a242e814a54", "title": "Medical Metaverse: A New Virtual Health Experience"}, {"paperId": "51ee5fd4140540857a6c00c5186d94223f4d0d84", "title": "A Review of the Factors Influencing Users' Perception of Metaverse Security and Trust"}, {"paperId": "6f7080729feae87d20c2520f2db362dd8b8dc2d8", "title": "Navigating the Metaverse of Big Data: A Bibliometric Journey"}, {"paperId": "8ea05bbb6983a722781dc897d186a3f95d9f240d", "title": "Exploring the Confluence of IoT and Metaverse: Future Opportunities and Challenges"}, {"paperId": "751457736b355013f6172eb81303a107e133e0ff", "title": "Remodeling a Mobile Educational Metaverse Using a Co-Design Approach: Challenges, Issues, and Expected Features"}, {"paperId": "2cfc17a35bde9af3339889bb834b70899d664a95", "title": "Toward Metaverse of everything: Opportunities, challenges, and future directions of the next generation of visual/virtual communications"}, {"paperId": "e2f6e28b12fc923a2b5fccb79b993e317d1adc64", "title": "Generative Artificial Intelligence in the Metaverse Era"}, {"paperId": "190d67671ef1882086e03ecd881aca3d716f144f", "title": "Harnessing Big Data Analytics for Healthcare: A Comprehensive Review of Frameworks, Implications, Applications, and Impacts"}, {"paperId": "e4f687e9c836b51a8878dd08b6317f9a461aa618", "title": "Toward Trustworthy Metaverse: Advancements and Challenges"}]}
