{"paperId": "baf3148ec75d561d7040a6da771a4795649529cd", "publicationVenue": null, "title": "Pipelined Parallel Join and Its FPGA-Based Acceleration", "abstract": "A huge amount of data is being generated and accumulated in data centers, which leads to an important increase in the required energy consumption to analyze these data. Thus, we must consider the redesign of current computer systems architectures to be more friendly to applications based on distributed algorithms that require a high data transfer rate.\n Novel computer architectures that introduce dedicated accelerators to enable near-data processing have been discussed and developed for high-speed big-data analysis. In this work, we propose a computer system with an FPGA-based accelerator, namely, interconnected-FPGAs, which offers two advantages: (1) direct data transmission and (2) offloading computation into data-flow in the FPGA. In this article, we demonstrate the capability of the proposed interconnected-FPGAs system to accelerate join operations in a relational database. We developed a new parallel join algorithm, PPJoin, targeted to big-data analysis in a shared-nothing architecture. PPJoin is an extended version of the NUMA-based parallel join algorithm, created by overlapping computation by multicore processors and data communication. The data communication between computational nodes can be accelerated by direct data transmission without passing through the main memory of the hosts. To confirm the performance of the PPJoin algorithm and its acceleration process using an interconnected-FPGA platform, we evaluated a simple query for large tables. Additionally, to support availability, we also evaluated the actual benchmark query. Our evaluation results confirm that the PPJoin algorithm is faster than a software-based query engine by 1.5--5 times. Moreover, we experimentally confirmed that the direct data transmission by interconnected FPGAs reduces computational time around 20% for PPJoin.", "venue": "TRETS", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2017-12-27", "journal": {"name": "ACM Trans. Reconfigurable Technol. Syst.", "pages": "28:1-28:28", "volume": "10"}, "authors": [{"authorId": "1690058", "name": "Masato Yoshimi"}, {"authorId": "3355159", "name": "Yasin Oge"}, {"authorId": "1682404", "name": "T. Yoshinaga"}], "citations": [{"paperId": "8566bfced9f3a5eab3e4cb7deebe6776c40937a9", "title": "Modular Pipeline Architecture for Accelerating Join Operation in RDBMS"}, {"paperId": "53b0b33de79d2f846915fec12877ef1a6041ca95", "title": "A Near-Data Processing Server Architecture and Its Impact on Data Center Applications"}, {"paperId": "9735e8a2681fc3badfb24748538c0ef6e748a86c", "title": "Exploring Portability and Performance of OpenCL FPGA Kernels on Intel HARPv2"}, {"paperId": "7718bbba237c1164cce73f5b08549e354ec34848", "title": "Column Scan Acceleration in Hybrid CPU-FPGA Systems"}]}
