{"paperId": "baf96bd6244ff5702a41f03b7d0343298b979b42", "publicationVenue": {"id": "064cbda6-2af7-40cb-9a07-22d7899d8f57", "name": "International Journal of Health Sciences", "type": "journal", "alternate_names": ["Int j health sci", "International Journal of Health Science", "International journal of health sciences", "Int J Health Sci", "International Journal Of Health Science"], "issn": "2710-2564", "alternate_issns": ["0924-2287", "2764-0159", "1791-4299", "1658-3639", "2827-9603", "2550-696X", "2550-6978"], "url": "https://interhealthjournal.page.tl/Home-IJHS.htm", "alternate_urls": ["http://www.ijhs.org.sa/", "https://www.ijhs.org.sa/index.php/journal", "http://sciencescholar.us/journal/index.php/ijhs"]}, "title": "Students career prediction", "abstract": "Choosing the right career is the most difficult decision in today's world. Numerous understudies today are uncertain about their future. They do have some skills, but they are unable to identify them or place them in a proper domain. Different people will suggest various career options, but the student must ultimately choose their career. Understudy vocation suggestion framework was proposed to help the understudies in concluding their abilities in which they are solid and feeble. It helps to overcome the deficiencies associated with the manual technique for ascertaining Students CGPA It evaluates the performance of student by grouping the grading into various classes using CGPA and their technical skills score. It additionally analysed the association of understudies in sports exercises and different expertise examinations for the understudies. The academic result, sports and extra academic activity are analysed for each student to recommend career opportunities using machine learning algorithm. Random Forest (RF) is a Supervised Artificial intelligence Algorithm that is utilized generally in Classification and Regression issues. It assembles choice trees on various examples and takes their greater part vote in favour of order and normal in the event of relapse and for further developing the expectation exactness.", "venue": "International Journal of Health Sciences", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-06-13", "journal": {"name": "International journal of health sciences"}, "authors": [{"authorId": "2171405371", "name": "R. Sadasivam"}, {"authorId": "2094564773", "name": "S. Paramasivam"}, {"authorId": "2171401724", "name": "N. Prakash raj"}, {"authorId": "2066098218", "name": "M. Saravanan"}], "citations": [{"paperId": "97600d6f5038effd93dd2f963fbd4157b000461d", "title": "Real-Time Crop Disease Detection and Remedial Suggestion through Deep Learning-based Smartphone Application"}]}
