{"paperId": "bafcd5455ac8f02b8ae0567344efef552022a785", "publicationVenue": null, "title": "Alpsoc Ant Lion * : Particle Swarm Optimized Hybrid K-Medoid Clustering", "abstract": "K-medoids clustering aims at partitioning a numerous data points into different K medoids based on the similarity distance between object pair. Cluster efficiency varies with respect to medoid initialization and may results in local optima traps. Various evolutionary swarm based approaches are adopted to obtain enhanced performance. Suitable combination of K-medoids with optimization technique does not operate well as expected while considering computational time. No such techniques are developed to solve entire clustering drawbacks. Assurance is not provided to any method in attaining success by solving the overall issues. Hence in this, an improved K-medoids integrated with Ant lion optimization and Particle swarm optimization algorithm commonly referred as ALPSOC is proposed to obtain optimized cluster centroid in which the computational complexity is preserved with better improvements in performance. Further the intra-cluster distance, F-measure, Rand Index, Adjusted Rand Index, Entropy and Normalized Mutual Information is evaluated for different datasets adopting the presented approach. The proposed algorithm is simulated on different datasets and is compared with different existing techniques based on above performance metric. From the observed results, it is shown that the proposed method functions better in all cases maintaining to solve clustering limitations.", "venue": "2020 International Conference on Smart Technologies in Computing, Electrical and Electronics (ICSTCEE)", "year": 2020, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2020-10-09", "journal": {"name": "2020 International Conference on Smart Technologies in Computing, Electrical and Electronics (ICSTCEE)", "pages": "145-150"}, "authors": [{"authorId": "2090921816", "name": "T. M. Murugan"}, {"authorId": "46593263", "name": "E. Baburaj"}], "citations": [{"paperId": "f1649eb079ba085c9351969421780b6b379d696f", "title": "K-Means-Based Nature-Inspired Metaheuristic Algorithms for Automatic Data Clustering Problems: Recent Advances and Future Directions"}]}
