{"paperId": "bafd07e997f900778c7942021e1129a41f891208", "publicationVenue": {"id": "d406a3f4-dc05-43be-b1f6-812f29de9c0e", "name": "IEEE Transactions on Information Forensics and Security", "type": "journal", "alternate_names": ["IEEE Trans Inf Forensics Secur"], "issn": "1556-6013", "url": "http://www.ieee.org/organizations/society/sp/tifs.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=10206", "http://www.signalprocessingsociety.org/publications/periodicals/forensics/"]}, "title": "Height and Punishment: Toward Accountable IoT Blockchain With Network Sanitization", "abstract": "A Blockchain network consists of a distributed ledger and a set of nodes participating in the network. The consistency in the ledger’s state is maintained by a Blockchain consensus mechanism. This property is essential since it is assumed that the participants in the network do not trust each other. Most Blockchain consensus algorithms are unsuitable for resource-constrained nodes due to their power consumption, storage, network overhead, and computation requirements. Furthermore, many consensus methods do not address the issue of data accountability, which guarantees that an entity will be judged on its performance or conduct concerning a duty they have taken. This study proposes a novel consensus mechanism termed Proof of Block Height (PoBH) that prioritizes accountability for reporting IoT data transactions and considers factors such as low computation cost and energy consumption. The approach relies on a pre-existing comparable deterministic value based on the height of the committed blocks. The model identifies a malicious intent using a set of predicates and consequently incurs a computation penalty to keep such nodes away from the network. As a preventive measure, the model also seeks to increment this penalty appropriately by making the network free from dishonest nodes for as long as possible, thus sanitizing the network. Importantly, the developed method does not augment the basic hierarchy of an IoT network. A formal analysis of the mechanism’s operation shows that the resource and time required to cheat the system grows exponentially with the number of faulty blocks a node tries to append to the shared ledger. The factors affecting the mechanism’s performance, scalability, and effort required (by malicious nodes) to stay within the network are also quantitatively evaluated.", "venue": "IEEE Transactions on Information Forensics and Security", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Transactions on Information Forensics and Security", "pages": "5665-5677", "volume": "18"}, "authors": [{"authorId": "2240887430", "name": "Varesh Mishra"}, {"authorId": "3408991", "name": "Debanjan Sadhya"}], "citations": []}
