{"paperId": "bafe5974518e12b56583df278f67b3cc79ff1ff4", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Review of Power Spatio-Temporal Big Data Technologies for Mobile Computing in Smart Grid", "abstract": "Mobile computing adds computing, storage, processing and other functions in wireless network ends to provide customized and differentiated services, so that it can be widely applied in the fields of internet of things, video, medical treatment, retail and so on. Recently, power spatio-temporal big data (PSTBD) technology of smart grid based on mobile computing has experienced explosive growth. This paper emphasizes the specific requirements, technologies, applications, and challenges of the current PSTBD for mobile computing in smart grid. Based on current development status of PSTBD companies in representative countries in the world, we introduce PSTBD technology based on the characteristics of mobile computing based smart grid, and conduct a comprehensive investigation and analysis of relevant articles in this field. After comparing the differences between the traditional and the PSTBD based platform in the aspects of important features, platform goal, and platform architecture, we describe the key technologies and algorithms of the current PSTBD in detail. Then, based on the requirements of each link and field of the power grid, the typical application of PSTBD technology in various aspects of smart grid application based on mobile computing is discussed. Finally, the development direction and challenges of PSTBD are given. Through data analysis and technical discussion, it hopes to provide technical support and decision support for relevant practitioners in the PSTBD field.", "venue": "IEEE Access", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "174612-174628", "volume": "7"}, "authors": [{"authorId": "2146276189", "name": "Ying Ma"}, {"authorId": "2110926605", "name": "Chao Huang"}, {"authorId": "2117103905", "name": "Yu Sun"}, {"authorId": "2111398845", "name": "Guang Zhao"}, {"authorId": "150349740", "name": "Yunjie Lei"}], "citations": [{"paperId": "aba36a5c9bacc59c596abbec7b9a2dc5650e4ced", "title": "An Investigation on Internet of Things: Smart Grid Technology Framework's"}, {"paperId": "933421b07036ce81970af578ada40c189bc9c754", "title": "Route planning based on 3D single model and power grid GISPlatform"}, {"paperId": "8be23d74624a792a7d18156bb7c39ff06e364ac1", "title": "Visualized Intelligent Management and Control Platform for Distribution Network"}, {"paperId": "a037c797f20fc3c07946fcc10a320936854f5abd", "title": "Power Supply Service Command Platform Based on Map Visualization"}, {"paperId": "3ff16cb6fe6559ab27ec3056627d4b25f0257877", "title": "Research on load forecasting model on power sensor net"}, {"paperId": "71e8112a256f5c6ea14cf2867ed98e8012e78e5d", "title": "Improving Analysis of Automatic Distribution Changes for Power Grid"}, {"paperId": "268d5f6f6480f120b338056b66430b276d0e435e", "title": "Study on Location and Sizing Programming of Regional Substation"}, {"paperId": "76a435bf40576602a4de5bb6c7451e2d22460ad2", "title": "Secure data analytics for smart grid systems in a sustainable smart city: Challenges, solutions, and future directions"}, {"paperId": "85c4e398e7ea3ba52ee1eb04e62be3957c2f54aa", "title": "A Novel Intelligent Method for Fault Diagnosis of Steam Turbines Based on T-SNE and XGBoost"}, {"paperId": "30fc3984a01b5a2cb3eafa974ea1fcb30ca2bb26", "title": "A Method for Cleaning Power Grid Operation Data Based on Spatiotemporal Correlation Constraints"}, {"paperId": "b49ed6288a848dd35574f496dd88df9f4270d0d1", "title": "Reliability Evaluation of Sensor Network Based on Information Entropy in Power Grid Planning"}]}
