{"paperId": "bb031c60f638f2cae712f907a7df5049bd366876", "publicationVenue": {"id": "764e3630-ddac-4c21-af4b-9d32ffef082e", "name": "IEEE International Conference on Data Engineering", "type": "conference", "alternate_names": ["ICDE", "Int Conf Data Eng", "IEEE Int Conf Data Eng", "International Conference on Data Engineering"], "url": "http://www.wikicfp.com/cfp/program?id=1331"}, "title": "Random Sampling for Group-By Queries", "abstract": "Random sampling has been widely used in approximate query processing on large databases, due to its potential to significantly reduce resource usage and response times, at the cost of a small approximation error. We consider random sampling for answering the ubiquitous class of group-by queries, which first group data according to one or more attributes, and then aggregate within each group after filtering through a predicate. The challenge with group-by queries is that a sampling method cannot focus on optimizing the quality of a single answer (e.g. the mean of selected data), but must simultaneously optimize the quality of a set of answers (one per group).We present CVOPT, a query- and data-driven sampling framework for a set of group-by queries. To evaluate the quality of a sample, CVOPT defines a metric based on the norm (e.g. ℓ2 or ℓ∞) of the coefficients of variation (CVs) of different answers, and constructs a stratified sample that provably optimizes the metric. CVOPT can handle group-by queries on data where groups have vastly different statistical characteristics, such as frequencies, means, or variances. CVOPT jointly optimizes for multiple aggregations and multiple group-by clauses, and provides a way to prioritize specific groups or aggregates. It can be tuned to cases when partial information about a query workload is known, such as a data warehouse where queries are run periodically.Our experimental results show that CVOPT outperforms the current state-of-the-art on sample quality and estimation accuracy for group-by queries. On a set of queries on two real-world data sets, CVOPT yields relative errors that are 5× smaller than competing approaches, under the same space budget.", "venue": "IEEE International Conference on Data Engineering", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-09-05", "journal": {"name": "2020 IEEE 36th International Conference on Data Engineering (ICDE)", "pages": "541-552"}, "authors": [{"authorId": "3400339", "name": "Trong Duc Nguyen"}, {"authorId": "38159019", "name": "Ming-Hung Shih"}, {"authorId": "153040932", "name": "Sai Sree Parvathaneni"}, {"authorId": "39719831", "name": "Bojian Xu"}, {"authorId": "145860176", "name": "D. Srivastava"}, {"authorId": "1679836", "name": "Srikanta Tirthapura"}], "citations": [{"paperId": "3dd82e0ab1e141e0e57f2807a5123458f6b1388e", "title": "ShadowAQP: Efficient Approximate Group-by and Join Query via Attribute-oriented Sample Size Allocation and Data Generation"}, {"paperId": "4cfb281b959f257374cb60f5a3e86893a7a938ca", "title": "Efficient Transmission and Reconstruction of Dependent Data Streams via Edge Sampling"}, {"paperId": "223d64c8f5a97186fc9628212f877ee6d812d3b2", "title": "Approximate Query Processing for Group-By Queries based on Conditional Generative Models"}, {"paperId": "68fa68c9020c9f744f02274813fbe5d5a12c3359", "title": "ICDE 2020 TOC"}, {"paperId": "e9c41e6cab99ec21598d5b0c755f75f866b910c3", "title": "Approximate query processing in a data warehouse using random sampling"}]}
