{"paperId": "bb2116bac9257c34f9f99e2a952139a2d4bb00b8", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Supercharging Distributed Computing Environments For High Performance Data Engineering", "abstract": "The data engineering and data science community has embraced the idea of using Python&R dataframes for regular applications. Driven by the big data revolution and artificial intelligence, these applications are now essential in order to process terabytes of data. They can easily exceed the capabilities of a single machine, but also demand significant developer time&effort. Therefore it is essential to design scalable dataframe solutions. There have been multiple attempts to tackle this problem, the most notable being the dataframe systems developed using distributed computing environments such as Dask and Ray. Even though Dask/Ray distributed computing features look very promising, we perceive that the Dask Dataframes/Ray Datasets still have room for optimization. In this paper, we present CylonFlow, an alternative distributed dataframe execution methodology that enables state-of-the-art performance and scalability on the same Dask/Ray infrastructure (thereby supercharging them!). To achieve this, we integrate a high performance dataframe system Cylon, which was originally based on an entirely different execution paradigm, into Dask and Ray. Our experiments show that on a pipeline of dataframe operators, CylonFlow achieves 30x more distributed performance than Dask Dataframes. Interestingly, it also enables superior sequential performance due to the native C++ execution of Cylon. We believe the success of Cylon&CylonFlow extends beyond the data engineering domain, and can be used to consolidate high performance computing and distributed computing ecosystems.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-01-19", "journal": {"name": "ArXiv", "volume": "abs/2301.07896"}, "authors": [{"authorId": "147698290", "name": "Niranda Perera"}, {"authorId": "2184722362", "name": "Kaiying Shan"}, {"authorId": "3122947", "name": "Supun Kamburugamuve"}, {"authorId": "2198488364", "name": "Thejaka Amíla Kanewela"}, {"authorId": "146448984", "name": "Chathura Widanage"}, {"authorId": "72620200", "name": "A. Sarker"}, {"authorId": "2202025523", "name": "Mills Staylor"}, {"authorId": "2198488182", "name": "Tianle Zhong"}, {"authorId": "51227181", "name": "V. Abeykoon"}, {"authorId": "50192176", "name": "Geoffrey Fox"}], "citations": [{"paperId": "feea3a2fc12915e6982b2a7774c0fb9a928bf230", "title": "Design and Implementation of an Analysis Pipeline for Heterogeneous Data"}, {"paperId": "2bd5aaf20b65cefe742b2ec86ca7c9b9061c836a", "title": "In-depth Analysis On Parallel Processing Patterns for High-Performance Dataframes"}]}
