{"paperId": "bb35dd676997238db56fa0346c77ed3e2d260a6d", "publicationVenue": {"id": "7fca7065-fa6f-490b-923e-3ffc07857f1c", "name": "IEEE Transactions on Cloud Computing", "type": "journal", "alternate_names": ["IEEE Trans Cloud Comput"], "issn": "2168-7161", "url": "https://www.computer.org/web/tcc", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6245519"]}, "title": "Multi-Framework Reliability Approach", "abstract": "Despite advances in making datacenters dependable, failures still happen. This is particularly onerous for long-running “big data” applications, where partial failures can lead to significant losses and lengthy recomputations. Big data processing frameworks like Hadoop MapReduce include fault tolerance (FT) mechanisms, but these are commonly targeted at specific system/failure models, and are often redundant between frameworks. This article proposes the paradigm of dependable resources: big data processing frameworks are typically built on top of resource management systems (RMSs), and proposing FT support at the level of such an RMS yields generic FT mechanisms, which can be provided with low overhead by leveraging constraints on resources. We demonstrate our concepts through Guardian, a robust RMS based on Mesos and YARN. Guardian allows frameworks to run their applications with individually configurable FT granularity and degree, with only minor changes to their implementation. We demonstrate the benefits of our approach by evaluating Hadoop, Tez, Spark and Pig on a prototype of Guardian running on Amazon-EC2, improving completion time by around 68 percent in the presence of failures, while maintaining around 6 percent overhead.", "venue": "IEEE Transactions on Cloud Computing", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-10-01", "journal": {"name": "IEEE Transactions on Cloud Computing", "pages": "2750-2768", "volume": "10"}, "authors": [{"authorId": "20745732", "name": "Bara Abusalah"}, {"authorId": "13059304", "name": "Derek Schatzlein"}, {"authorId": "2489328", "name": "J. Stephen"}, {"authorId": "3086775", "name": "Masoud Saeida Ardekani"}, {"authorId": "1697599", "name": "P. Eugster"}], "citations": []}
