{"paperId": "bb4b51ebc26869fee75b5bfc24e2a6cdcb403459", "publicationVenue": {"id": "27b93d96-c4b9-4a23-a3a0-061ad54deebc", "name": "IEEE International Symposium on High-Performance Parallel Distributed Computing", "type": "conference", "alternate_names": ["HPDC", "IEEE Int Symp High-performance Parallel Distrib Comput"], "url": "http://www.hpdc.org/"}, "title": "Libra: Harvesting Idle Resources Safely and Timely in Serverless Clusters", "abstract": "Serverless computing has been favored by users and infrastructure providers from various industries, including online services and scientific computing. Users enjoy its auto-scaling and ease-of-management, and providers own more control to optimize their service. However, existing serverless platforms still require users to pre-define resource allocations for their functions, leading to frequent misconfiguration by inexperienced users in practice. Besides, functions' varying input data further escalate the gap between their dynamic resource demands and static allocations, leaving functions either over-provisioned or under-provisioned. This paper presents Libra, a safe and timely resource harvesting framework for multi-node serverless clusters. Libra makes precise harvesting decisions to accelerate function invocations with harvested resources and jointly improve resource utilization by profiling dynamic resource demands and availability proactively. Experiments on OpenWhisk clusters with real-world workloads show that Libra reduces response latency by 39% and achieves 3X resource utilization compared to state-of-the-art solutions.", "venue": "IEEE International Symposium on High-Performance Parallel Distributed Computing", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2023-08-07", "journal": {"name": "Proceedings of the 32nd International Symposium on High-Performance Parallel and Distributed Computing"}, "authors": [{"authorId": "2019682283", "name": "Hanfei Yu"}, {"authorId": "2230103307", "name": "Christian Fontenot"}, {"authorId": "2221084102", "name": "Hao Wang"}, {"authorId": "2151965429", "name": "Jian Li"}, {"authorId": "2115562069", "name": "Xu Yuan"}, {"authorId": "2794114", "name": "Seung-Jong Park"}], "citations": [{"paperId": "90e7103859d65f2b4cba7755116121b36f01cfb5", "title": "Raptor: Distributed Scheduling for Serverless Functions"}, {"paperId": "5fd1ba8e9b9350772551539fee557cff3d9f0bcf", "title": "H-EYE: Holistic Resource Modeling and Management for Diversely Scaled Edge-Cloud Systems"}, {"paperId": "a688d1f026bf2ab93f95bfc977004a7a8909934f", "title": "Software Resource Disaggregation for HPC with Serverless Computing"}]}
