{"paperId": "bb4e12b4b6e4ce45301ae10b2515d935394049c5", "publicationVenue": null, "title": "Integrated Real-Time Data Stream Analysis and Sketch-Based Video Retrieval in Team Sports", "abstract": "Big data in sports comes with two closely related challenges: first, the online analysis of continuous data streams to identify characteristic events and second, advanced retrieval in video collections and/or event data that help game analysts to search for characteristic video scenes. For both challenges, dedicated big data stream processing and retrieval systems have been developed. However, there is no infrastructure yet that integrates retrieval and automatic online data stream analysis. In this paper, we close this gap by seamlessly combining STREAMTEAM, our real-time team sports analysis system, and SPORTSENSE, our team sports video retrieval system, to an integrated team sports analysis infrastructure that (i) automatically detects (collaborative) events and generates statistics in real-time based on a continuous stream of raw positions, (ii) visualizes the analysis results in real-time, (iii) stores the analysis results persistently for offline activities, and (iv) leverages the stored analysis results for intuitive sketch-based video retrieval.", "venue": "2018 IEEE International Conference on Big Data (Big Data)", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2018-12-01", "journal": {"name": "2018 IEEE International Conference on Big Data (Big Data)", "pages": "548-555"}, "authors": [{"authorId": "2373717", "name": "L. Probst"}, {"authorId": "37324269", "name": "Fabian Rauschenbach"}, {"authorId": "145717652", "name": "H. Schuldt"}, {"authorId": "7646680", "name": "Philipp Seidenschwarz"}, {"authorId": "6681168", "name": "M. Rumo"}], "citations": [{"paperId": "f8499e0a2152e316d124e51cda954d9e5adb6e5c", "title": "Ride With Me: Exploring Group Road Cycling Through Contextual Design"}, {"paperId": "1ff7ee5e4612ebdb62f12c7573306f2dc01060c6", "title": "Investigating the Sketchplan: A Novel Way of Identifying Tactical Behavior in Massive Soccer Datasets"}, {"paperId": "eebd8dc223d0dc6531d666445b50747d8f785e7f", "title": "A Dockerized big data architecture for sports analytics"}, {"paperId": "c6e7e331beefe7b86ede05b377c02562bd3c75af", "title": "Simulation of sports big data system based on Markov model and IoT system"}, {"paperId": "cfe36daa21ea8cb8e526c0db4c3036527e9f6e47", "title": "StreamTeam-Football: Analyzing Football Matches in Real-Time on the Basis of Position Streams"}, {"paperId": "515a634425f1f0ea26f8eb843de8fce3112d9fbd", "title": "Sports training effect simulation of embedded system based on FPGA"}, {"paperId": "f6e9711b02a9cb371a5111a7584fe5a02a4933fa", "title": "High-Level Tactical Performance Analysis with SportSense"}, {"paperId": "8d0a1571415781a251bab85deba680ea4549d8c0", "title": "The SportSense User Interface for Holistic Tactical Performance Analysis in Football"}, {"paperId": "a9c90e153683e39585ccac0fb219681ab6a4ffe2", "title": "Combining Qualitative and Quantitative Analysis in Football with SportSense"}, {"paperId": "29edf04a411bb96eabbd4f5d7f35b1dc84640b98", "title": "A Flexible Approach to Football Analytics: Assessment, Modeling and Implementation"}]}
