{"paperId": "bb4ff2ae24cac211d29a6be1553c60ab12745618", "publicationVenue": {"id": "b1aea3ab-edf0-430b-a9c2-cce5469f6b23", "name": "IEEE/ACM Transactions on Networking", "type": "journal", "alternate_names": ["IEEE ACM Trans Netw", "IEEE ACM Transactions on Networking", "IEEE/ACM Trans Netw"], "issn": "1063-6692", "url": "http://portal.acm.org/ton/", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=90", "https://ieeexplore.ieee.org/servlet/opac?punumber=90"]}, "title": "The Joint Optimization of Online Traffic Matrix Measurement and Traffic Engineering For Software-Defined Networks", "abstract": "Software-Defined Networking (SDN) provides programmable, flexible and fine-grained traffic control capability, which paves the way for realizing dynamic and high-performance traffic measurement and traffic engineering. In the SDN paradigm, the traffic forwarding and measurement strategies are realized through flow tables stored in the Tenantry Content Addressable Memories (TCAM) of SDN switches. However, the number of TCAM entries in SDN switches is limited. In this paper, we aim to jointly optimize the Traffic Matrix Measurement (TMM) and Traffic Engineering (TE) process under the TCAM capacity and flow aggregation constraints in software-defined networks. We first formulate the joint optimization problem as a Mixed Integer Linear Programming (MILP) model. Then to get an initial traffic matrix for the joint optimization problem, we propose a simple flow rule generation strategy named Maximum Load Rule First (MLRF) to efficiently generate feasible flow rules, which are used to provide direct measurements for the traffic matrix measurement problem. At last, to solve the joint optimization efficiently, we propose two efficient heuristic algorithms named Traffic Matrix Measurement First (TMMF) and Traffic Engineering First (TEF), respectively. TMMF and TEF can generate feasible flow rules for realizing TMM and TE strategies. Our evaluations on real network topologies and traffic traces verify that by jointly optimizing the TMM and TE strategies, both TMMF and TEF can significantly improve TMM accuracy and TE objective (i.e., load balancing) with limited TCAM resource.", "venue": "IEEE/ACM Transactions on Networking", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-02-01", "journal": {"name": "IEEE/ACM Transactions on Networking", "pages": "234-247", "volume": "28"}, "authors": [{"authorId": "48630713", "name": "Xiong Wang"}, {"authorId": "2056197929", "name": "Qi Deng"}, {"authorId": "2111470109", "name": "Jing Ren"}, {"authorId": "2621747", "name": "M. Malboubi"}, {"authorId": "41136118", "name": "Sheng Wang"}, {"authorId": "145311464", "name": "Shizhong Xu"}, {"authorId": "143880500", "name": "Chen-Nee Chuah"}], "citations": [{"paperId": "7a169c56cedd1981bba8c78f7766f68aeaa505fd", "title": "Enabling efficient routing for traffic engineering in SDN with Deep Reinforcement Learning"}, {"paperId": "6c5712b988bf5165ced1103c91177dc4fc6358bc", "title": "Traffic Engineering QoS-Driven Disjoint Path Routing Model Research"}, {"paperId": "130c8377f2cc6be06b316769aeeda2a3e06a9ce1", "title": "Solving Load Balancing Problems in Routing and Limiting Traffic at the Network Edge"}, {"paperId": "e2d2872389587f83f353570a43a78220c832ea9a", "title": "Traffic flow monitoring in software-defined network using modified recursive learning"}, {"paperId": "760232c168e95d5b83dc0767beaf8843e293b856", "title": "New approach to dynamic load balancing in software‐defined network‐based data centers"}, {"paperId": "f82d5f750d7f35a2ab78c8a01e8191fc79d27aac", "title": "Cor-ENTC:correlation with ensembled approach for network traffic classification using SDN technology for future networks"}, {"paperId": "005cd4a714fee6730356d4692d85c53caa8a86bb", "title": "A Study on Traffic Matrix Estimation Techniques in Software-Defined Networks"}, {"paperId": "d8e4c8756a569d11de8daeb496b57703e1c85d56", "title": "Traffic Engineering for Software-Defined LEO Constellations"}, {"paperId": "d7fce5288619c8073181cd7d45612d19b1fa4970", "title": "FlexMon: A flexible and fine-grained traffic monitor for programmable networks"}, {"paperId": "8f6b80236856a7c68d25e1b00f95a8c7ed363f2b", "title": "QoS-aware Routing Optimization Algorithm using Differential Search in SDN-based MANETs"}, {"paperId": "0c9727fda53eeae02bed1c538c058a38b7db5e46", "title": "Achieving Robust Performance for Traffic Classification Using Ensemble Learning in SDN Networks"}, {"paperId": "dcd5e5c27f37fe75b309439db58e6619456a4df8", "title": "Load balancing for software-defined network: a review"}, {"paperId": "506751a40f85e2bad7c1e92d83f3007b7db137f8", "title": "Route manipulation aware Software-Defined Networks for effective routing in SDN controlled MANET by Disney Routing Protocol"}, {"paperId": "841a95fe856a985bbfc5be669eeba0521ec815ca", "title": "Stability Analysis of Communication System Under Certain Session Arrival Rate"}]}
