{"paperId": "bb556016fc01d7736f60c89762630a2a83e9fe05", "publicationVenue": {"id": "f4989ee4-e1d2-45b4-85ad-c43a8ffef177", "name": "ACM SIGACT-SIGMOD-SIGART Symposium on Principles of Database Systems", "type": "conference", "alternate_names": ["PODS", "Symp Princ Database Syst", "Symposium on Principles of Database Systems", "ACM SIGACT-SIGMOD-SIGART Symp Princ Database Syst"], "url": "http://www.acm.org/sigmod/pods/index.html"}, "title": "Towards Theory for Real-World Data", "abstract": "Fundamental research on data manipulation languages is often motivated by the search for balance between desirable properties, such as expressiveness, robustness, compositionality, the existence of efficient algorithms, etc. Real-world data can be helpful for this search in many different respects. Data sets may exhibit common structures that efficient algorithms can exploit. Query logs and schemas can give us an idea of single features that are used very often, or groups of features that are frequently used together. In this sense, they can guide us towards features or fragments of data manipulation languages that are common in practice and may therefore be worthy of deeper study. In other cases, we may even get a glimpse on features that are not well-understood by users, which may inspire us to redesign them or develop tools that increase their ease-of-use. This tutorial aims to provide, first of all, an overview on several practical studies that have been conducted in the areas of tree-structured and graph-structured data, with a focus on cases with strong interaction between analysis of the data and fundamental research. Second, it aims to provide a set of lessons learned after the investigation of some large-scale logs consisting of more than 850 million queries.", "venue": "ACM SIGACT-SIGMOD-SIGART Symposium on Principles of Database Systems", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference", "Review"], "publicationDate": "2022-06-12", "journal": {"name": "Proceedings of the 41st ACM SIGMOD-SIGACT-SIGAI Symposium on Principles of Database Systems"}, "authors": [{"authorId": "144352362", "name": "W. Martens"}], "citations": [{"paperId": "c03aafc6b9178c1403b8ecf178d7bee4f6839fa6", "title": "Schema-Based Query Optimisation for Graph Databases"}, {"paperId": "997ed6b4617dfc51a727835f542d9fe1843cb387", "title": "Exploiting Structure in Regular Expression Queries"}, {"paperId": "a970a17e0688839c935e709273633ea1d2975637", "title": "A Taxonomy of Basic Graph Pattern Motifs for Understanding SPARQL Query Logs"}]}
