{"paperId": "bb583cb40cee47b332fed816bc4a223e71c825f9", "publicationVenue": null, "title": "Improved Red Deer Algorithm for Scientific Workflow Scheduling in Cloud Environment", "abstract": "One of the most difficult problems in the technological sector is the versatility of cloud computing, which can offer a flexible and responsive infrastructure in the realm of information technology. A significant problem in cloud computing that is addressed in recent research is workflow scheduling. With the quick advancement of cloud computing, scheduling the intricate scientific process on the cloud has grown to be an incredibly difficult task. It has been identified that one of the key challenges to optimizing the performance of cloud computing is scheduling workflow tasks so that it is processed by the most effective cloud network resources. Meta-heuristic optimization algorithms are frequently utilized to find a solution to effective task scheduling because of the intricacy of the problem and the extent of the search space. This research suggests a unique Improved Red Deer Algorithm (IRDA) to shorten execution time subject to a set budget. The performance of the proposed algorithm is evaluated against conventional optimization algorithms by applying it to scientific workflows including Montage and Epigenomics. The experimental results reveal that the proposed algorithm works better than other compared methods in reducing workflow task execution time and cost.", "venue": "2023 5th International Conference on Inventive Research in Computing Applications (ICIRCA)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-08-03", "journal": {"name": "2023 5th International Conference on Inventive Research in Computing Applications (ICIRCA)", "pages": "662-667"}, "authors": [{"authorId": "2235687819", "name": "Chandra Mouli Venkata Srinivas"}, {"authorId": "2235687994", "name": "Hajiyeva Rena"}, {"authorId": "2213503422", "name": "AR. Arunarani"}, {"authorId": "2128962877", "name": "S. Naitik"}, {"authorId": "2174885854", "name": "Mohammed Saleh Al Ansari"}, {"authorId": "2235687823", "name": "Ammar Younas"}], "citations": [{"paperId": "4f26b1113d6aa4c32de0c9ef0bf07697241395a9", "title": "Analysis of Preventions of Attacks on IOT Using Block Chain: Review"}]}
