{"paperId": "bb5daa5f6070e36c3d8efcef586bda14265d201a", "publicationVenue": {"id": "12606533-41e4-4917-b9d3-50941da6c739", "name": "Digital Library Perspectives", "alternate_names": ["Digit Libr Perspect"], "issn": "2059-5816", "url": "https://www.emerald.com/insight/publication/issn/2059-5816"}, "title": "Librarians’ views of the readiness of university libraries in Indonesia to adopt virtual and augmented reality", "abstract": "\nPurpose\nThis study aims to determine the extent of virtual reality (VR)/augmented reality (AR) adoption in university libraries in Indonesia and identify librarians’ views of library readiness. The assessment centers on two crucial dimensions: library readiness, gauged by commitment and efficacy, and librarian readiness, appraised through cognitive and affective aspects.\n\n\nDesign/methodology/approach\nThe research features a survey-based quantitative method. A sample of 259 librarians from university libraries, all members of the Indonesian Higher Education Library Forum, responded to the online survey.\n\n\nFindings\nIndonesian university libraries, especially in Central Java, express strong interest in VR/AR despite low current adoption. Librarians believe in their commitment and efficacy for adoption, with improvements needed in budget procurement and human resources. Librarians are optimistic about innovating academic activities with VR/AR, despite concerns about collaboration, data governance and human resource insecurity. The research underscores the simultaneous influence of librarians’ and libraries’ readiness on VR/AR adoption, emphasizing their interconnectedness and mutual support within library management.\n\n\nPractical implications\nThere are practical implications for library institutions in Indonesia in terms of understanding the attendant opportunities and challenges when preparing organizational ecosystems. These findings provide a broad overview of VR/AR adoption in university libraries in Indonesia and contribute to understanding the specific needs and interests of universities in Indonesia considering adopting VR/AR. In addition to preparing adequate infrastructure, libraries should ensure the availability of adequate human resources.\n\n\nOriginality/value\nIn the Indonesian context, this study, to the best of the authors’ knowledge, makes the first attempt to examine the librarian’s view as part of library management to face the dilemmas that may arise during the adoption of VR/AR despite university libraries’ commitment and efficacy to enable this technology. This research also identifies librarians’ cognitive and affective readiness as individual characteristics and resources able to influence adequate adoption.\n", "venue": "Digital Library Perspectives", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2024-02-14", "journal": {"name": "Digital Library Perspectives"}, "authors": [{"authorId": "134309814", "name": "Nina Mayesti"}, {"authorId": "2284032186", "name": "Chen Hao Huang"}, {"authorId": "2194002217", "name": "Aviazka Firdhaussi Azmir"}, {"authorId": "2283990427", "name": "Diah Melati Adzani"}], "citations": []}
