{"paperId": "bb65087238adf9cbb0eb024b0cfcf88293f546f3", "publicationVenue": {"id": "a03dd819-cbf4-4e9e-9fb7-2435d554824a", "name": "IEEE International Workshop on Computer Aided Modeling and Design of Communication Links and Networks", "type": "conference", "alternate_names": ["Comput Aided Model Des Commun Links Netw", "CAMAD", "IEEE Int Workshop Comput Aided Model Des Commun Links Netw", "Computer Aided Modeling and Design of Communication Links and Networks"], "url": "http://www.wikicfp.com/cfp/program?id=352"}, "title": "Efficiently Integrating Mobility and Environment Data for Climate Change Analytics", "abstract": "Recent research focuses on building Cloud-based solutions for big geospatial data analytics. Avalanches of georeferenced mobility data are being collected and processed daily. However, mobility data alone is not enough to unleash the opportunities for insightful analytics that may assist in mitigating the adverse effects of climate change. For example, answering complex queries such as follows: “what are the Top-3 neighborhoods in Buenos Aires in terms of vehicle mobility where the index of PM10 pollutant is greater than 40”. Similar queries are necessary for emergent health-aware smart city policies. For example, they can provide insights to municipality administrators so that they foster the design of future city infrastructure plans that feature citizen health as a priority. For example, building mobile maps for daily dwellers so that to inform them which routes to avoid passing-through during specific hours of a day to avoid being subjected to high-levels PM10. However, answering such a query would require joining real-time mobility and environment data. Stock versions of the current Cloud-based geospatial management systems do not include intrinsic solutions for such scenarios. In this paper, we report the design and implementation of a novel system MeteoMobil for the combined analytics of information representing mobility and environment. We have implemented our system atop Apache Spark for efficient operation over the Cloud. Our results show that MeteoMobil can be efficiently exploited for advanced climate change analytics.", "venue": "IEEE International Workshop on Computer Aided Modeling and Design of Communication Links and Networks", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-10-01", "journal": {"name": "2021 IEEE 26th International Workshop on Computer Aided Modeling and Design of Communication Links and Networks (CAMAD)", "pages": "1-5"}, "authors": [{"authorId": "1833407969", "name": "Isam Mashhour Al Jawarneh"}, {"authorId": "1740127", "name": "P. Bellavista"}, {"authorId": "144765161", "name": "Antonio Corradi"}, {"authorId": "1748978", "name": "L. Foschini"}, {"authorId": "1713456", "name": "R. Montanari"}], "citations": [{"paperId": "d06767b7fcb61507065066976bc9eb93cfd48088", "title": "SpatialSSJP: QoS-Aware Adaptive Approximate Stream-Static Spatial Join Processor"}, {"paperId": "7424e30c0d6f508c30691d5864a5da9a8c667cd6", "title": "Cost-Effective Approximate Aggregation Queries on Geospatial Big Data"}, {"paperId": "4dc40e5bf500b8bc891d5876ff76ddde78ec9328", "title": "Efficient Generation of Approximate Region-based Geo-maps from Big Geotagged Data"}, {"paperId": "34208ab137ad1b29effa0bef760b93a47e42bd2e", "title": "Polygon Simplification for the Efficient Approximate Analytics of Georeferenced Big Data"}, {"paperId": "6cfe3f77f08f1e7679e00085a67b29413d99f0c2", "title": "Efficient Geospatial Analytics on Time Series Big Data"}]}
