{"paperId": "bb702d3d1a5063f479518e1fcec7666266ebeaf2", "publicationVenue": null, "title": "Una generalización del algoritmo gravitacional de clústering utilizando funciones de overlap", "abstract": "En este trabajo consideramos una modificación del algoritmo de clúster gravitacional propuesto por Wright y utilizamos el concepto de función de overlap para mejorar su eficacia. Nuestra generalización recupera el algoritmo original. Comparamos los resultados de nuestra propuesta con los obtenidos con algoritmos usuales como el K-means o el FCM, con el objetivo de descubrir los puntos fuertes y las carencias de la nueva versión. Keywords—Clúster; overlap; fuerza gravitacional I. INTRODUCCIÓN La variedad en los problemas a tratar por las técnicas de clúster ha fomentado la aparición de decenas de algoritmos distintos, capaces de adaptarse a distintas situaciones y ofrecer resultados óptimos para cada caso [1]. Uno de estos algoritmos es el propuesto por W. E. Wright en 1977 [2]. Este algoritmo trata cada uno de los ejemplos sobre los que trabaja como una partícula que afecta al resto del sistema, según una adaptación de la ley de gravitación universal de Newton. Cada partícula compone inicialmente un clúster, que se van combinando a lo largo del tiempo hasta que solo queda uno. El objetivo de este trabajo es generalizar el algoritmo de Wright utilizando funciones de overlap [3].Nuestra generalización modifica la función fundamental que simula el movimiento de las partículas sustituyendo un término concreto por una función de overlap. Las funciones de overlap se introdujeron inicialmente en el campo difuso para tratar con el problema de determinar a cuál de dos conjuntos difusos pertenece en mayor medida una entrada dada. Sin embargo, desde sus orígenes se han aplicado con éxito en campos como los del procesamiento de imagen [4], la clasificación [5, 6] o la optimización [7]. En particular, en [7], una generalización muy competitiva del GSA, un algoritmo de optimización que también hace uso de la fuerza gravitacional, ver [8], fue propuesto, reemplazando el producto en la expresión de la fuerza por funciones de overlap (y otro tipo de funciones). La estructura del trabajo es la siguiente. En la Sección II presentamos algunos conceptos preliminares. En la Sección III, presentamos el algoritmo de clúster gravitacional original y nuestra propuesta de generalización. La Sección IV se dedica a un studio experimental de nuestra propuesta. Terminamos con algunas conclusions y referencias. II. PRELIMINARES A. Funciones de Agregación Definición. [9] Una función de agregación n-dimensional es una función M:[0,1]n→[0,1] que verifica las dos condiciones siguientes: • M es no decreciente en cada una de sus variables; • M(0, ..., 0) = 0 y M(1, ..., 1) = 1. Definición. Sea M:[0,1]n→[0,1] una función de agregación n-dimensional. • a  [0,1] es un aniquilador de M si M(x1, ..., xn) = a siempre que a  { x1, ..., xn }. • Si M no tiene aniquilador, M se dice estrictamente creciente si lo es en el dominio [0,1]n como función real de n variables. Si a es un aniquilador de M, si es estrictamente creciente en el dominio ([0, 1]\\{a})n. • M tiene divisores de cero si existen x1, ..., xn [0, 1] tales que M(x1, ..., xn) = 0. • M es idempotente si M(x1, ..., xn) = x para todo x  [0, 1]. Nos vamos a centrar en el caso de funciones de agregación en dimensión 2. Por ello, revisamos algunas propiedades que nos van a resultar de interés. Definición. Sea M una función de agregación de dos variables. • M es simétrica si M(x, y) = M(y, x) para cualesquiera x, y [0, 1]. • M es asociativa si M(M(x, y), z) = M(x, M(y, z)) para cualesquiera x, y, z [0, 1]. La asociatividad permite extender las funciones de agregación bidimensionales a dimensiones mayores de una manera “razonable”. En particular, es una de las propiedades fundamentales que se demandan en la construcción de normas triangulares (t-normas). XVIII Conferencia de la Asociación Española para la Inteligencia Artificial 406 Definición . Una norma triangular o t-norma es una función de agregación T:[0, 1]2 → [0, 1] asociativa y simétrica tal que T(1, x) = x para todo x [0, 1]. Las t-normas permiten modelar intersecciones entre conjuntos difusos. Ahora bien, si estamos trabajando con solo dos elementos, la asociatividad no es en principio una propiedad que deba ser requerida. Esta idea, la de poder representar la intersección sin necesariamente requerir la asociatividad nos lleva al concepto de función de solapamiento (función de overlap) que estudiamos a continuación. B. Funciones de Overlap En esta subsección recordamos algunos conceptos y resultados presentados en [3]. Definición Una función O:[0, 1]2 → [0, 1] es una función de solapamiento si", "venue": "", "year": 2018, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": {"name": "", "pages": "405-409", "volume": ""}, "authors": [{"authorId": "41210645", "name": "I. C. Rodríguez"}, {"authorId": "94401815", "name": "J. Aranguren"}, {"authorId": "81048481", "name": "J. Fernández"}, {"authorId": "2085416503", "name": "Humberto Bustince Sola"}, {"authorId": "50392521", "name": "J. Armentia"}], "citations": []}
