{"paperId": "bb739718f25378b7626857a7fc0f265df5fb5c38", "publicationVenue": {"id": "cd492924-29c4-496b-9535-082805f228d8", "name": "International Conference on Performance Engineering", "type": "conference", "alternate_names": ["Int Conf Perform Eng", "ICPE"], "url": "http://www.wikicfp.com/cfp/program?id=1445"}, "title": "Microservices: A Performance Tester's Dream or Nightmare?", "abstract": "In recent years, there has been a shift in software development towards microservice-based architectures, which consist of small services that focus on one particular functionality. Many companies are migrating their applications to such architectures to reap the benefits of microservices, such as increased flexibility, scalability and a smaller granularity of the offered functionality by a service. On the one hand, the benefits of microservices for functional testing are often praised, as the focus on one functionality and their smaller granularity allow for more targeted and more convenient testing. On the other hand, using microservices has their consequences (both positive and negative) on other types of testing, such as performance testing. Performance testing is traditionally done by establishing the baseline performance of a software version, which is then used to compare the performance testing results of later software versions. However, as we show in this paper, establishing such a baseline performance is challenging in microservice applications. In this paper, we discuss the benefits and challenges of microservices from a performance tester's point of view. Through a series of experiments on the TeaStore application, we demonstrate how microservices affect the performance testing process, and we demonstrate that it is not straightforward to achieve reliable performance testing results for a microservice application.", "venue": "International Conference on Performance Engineering", "year": 2020, "fieldsOfStudy": ["Computer Science", "Art"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2020-02-13", "journal": {"name": "Proceedings of the ACM/SPEC International Conference on Performance Engineering"}, "authors": [{"authorId": "40879589", "name": "Simon Eismann"}, {"authorId": "1755660", "name": "C. Bezemer"}, {"authorId": "39724619", "name": "Weiyi Shang"}, {"authorId": "2298047", "name": "Dusan Okanovic"}, {"authorId": "1781241", "name": "A. Hoorn"}], "citations": [{"paperId": "d3d07ce4e258c60c256c8cfa7db26884adfd77cd", "title": "The Distribution Is the Performance"}, {"paperId": "6259ad4d0992252b72b0e6af0d19b03ddcba6d9e", "title": "Blueprint: A Toolchain for Highly-Reconfigurable Microservice Applications"}, {"paperId": "46f9827e81e0d46d68f4a7d16cc62091ed1b2406", "title": "Lifting the Fog of Uncertainties: Dynamic Resource Orchestration for the Containerized Cloud"}, {"paperId": "ae0b1e3d0e82276387487d48d78efed1c344239b", "title": "A dependable and secure consensus algorithm for blockchain assisted microservice architecture"}, {"paperId": "cf206555bb0eb545921dcfcaac0f36ad0d4025f6", "title": "Exploring Logic Scoring of Preference for DoS Attack Detection in Microservice Applications"}, {"paperId": "320d1c1967825833bdecf4062d5c354cd1dbc1aa", "title": "A Grey Literature Review on Data Stream Processing applications testing"}, {"paperId": "87a5716082fe59052cc69d87ec545d3e7f618135", "title": "Lightweight Kubernetes Distributions: A Performance Comparison of MicroK8s, k3s, k0s, and Microshift"}, {"paperId": "b401ba09d37ec685b8bdd3c30af947324f1d998e", "title": "Locating Performance Regression Root Causes in the Field Operations of Web-Based Systems: An Experience Report"}, {"paperId": "05bdebea16f0c93cc59db07bb3007b3c3b44de23", "title": "Automated Identification of Performance Changes at Code Level"}, {"paperId": "84a9bfe015b5457709ae94981fe0aab3b3653a13", "title": "Framework for experimental evaluation of software solutions in a virtual environment"}, {"paperId": "97b7a1412a973b1baa2121ba7c473b95ba10170e", "title": "Performance Modeling of Serverless Computing Platforms"}, {"paperId": "8f68a1cbb3f81a806f955af764e7a424cf5105ff", "title": "Same, Same, but Dissimilar: Exploring Measurements for Workload Time-series Similarity"}, {"paperId": "fe7cb24836d24aa291ef42a118a29f99f6ffe79b", "title": "Performance Modeling of Metric-Based Serverless Computing Platforms"}, {"paperId": "b7b30079e0b4854c9b2df87cbc87c5b6b9ec5768", "title": "Automated test-based learning and verification of performance models for microservices systems"}, {"paperId": "72523e63926167be4e9ff30c55a03ab43d51e920", "title": "DeLag: Using Multi-Objective Optimization to Enhance the Detection of Latency Degradation Patterns in Service-Based Systems"}, {"paperId": "69763f0075accbd43ca31d2442c7511b866d4449", "title": "A Case Study on the Stability of Performance Tests for Serverless Applications"}, {"paperId": "1c892a1d366e0d788c441581c2c1625494b27529", "title": "Jindo: Smart Microservice Monitoring and Development Tool"}, {"paperId": "eb33fdb59a87db39620fe1e173edc29a5b4e37e2", "title": "SuanMing: Explainable Prediction of Performance Degradations in Microservice Applications"}, {"paperId": "7074bcaa1787b323369c562c4d54039a78ef662e", "title": "Collecting Service-Based Maintainability Metrics from RESTful API Descriptions: Static Analysis and Threshold Derivation"}, {"paperId": "ab12e3c825bb797619eb63cfcac2bb82d289f83a", "title": "Performance Engineering for Microservices and Serverless Applications: The RADON Approach"}, {"paperId": "80b1cfc81f7080c7532c49a912aca97c9f3a73bc", "title": "Research Opportunities in Microservices Quality Assessment: A Systematic Literature Review"}, {"paperId": "01ad06376cdfc11b6152adef9d082de09014181f", "title": "Blockchain Meets Secured Microservice Architecture: A Trustworthy Consensus Algorithm"}, {"paperId": "dbd263d4e854c42c4f78dc8e3919c841146aec4f", "title": "A Roadmap for Migration System-Architecture Decision by Neutrosophic-ANP and Benchmark for Enterprise Resource Planning Systems"}, {"paperId": "06c52cc6c6a396afb906219f925beb66142af5c8", "title": "Weighted Load Balancing Mechanisms over Streaming Big Data for Online Machine Learning"}, {"paperId": "9574474e2ab5de7f762064462a1d3a6aa58b136c", "title": "Reproducible Benchmarking of Cloud-Native Applications With the Kubernetes Operator Pattern"}, {"paperId": "55ed7a5b9247cff198777e0b2754222342546201", "title": "ContinuITy - automatisiertes Performance-Testen in der kontinuierlichen Softwareentwicklung : Abschlussbericht"}, {"paperId": "5e76690c5a171ff823b9f9adfd191b6883bf4b20", "title": "[Extended Abstract] Exploring the Feasibility of Performance Regression Testing for Serverless Applications"}, {"paperId": "889c4cd7a4627d29c746e986624f6407bbc67767", "title": "Rational decomposition and orchestration for serverless computing Deliverable 3.5"}]}
