{"paperId": "bb7bdcf77515d1d80e78a16f595a366914f238df", "publicationVenue": {"id": "e2742a49-1b55-4a31-b319-7455fa5e12d4", "name": "IEEE Transactions on Services Computing", "type": "journal", "alternate_names": ["IEEE Trans Serv Comput"], "issn": "1939-1374", "url": "http://www.computer.org/tsc", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=4629386"]}, "title": "Cost-Efficient Scheduling of Multicast Transfers With Deadline Guarantees Across Edge Datacenters", "abstract": "Moderate-scale datacenters are increasingly deployed at the network edge to support low-latency and high-bandwidth Internet of Things (IoT) and 5G applications. These applications usually have bulk data to transfer from one datacenter to several datacenters, which can cause a significant amount of bandwidth costs. Traffic engineering (TE) systems at the network edge must minimize the bandwidth costs of multicast transfers across edge datacenters. To avoid service quality degradation, TE should also guarantee transfer deadlines, which have received little attention in existing work. Due to the dynamic bandwidth pricing schemes, it is challenging to strike a good balance between minimizing costs and guaranteeing transfer deadlines. In this article, we present CDScheduler, a cost-efficient scheduling solution for multicast transfers with deadline guarantees. To reduce bandwidth costs, CDScheduler uses Steiner trees for forwarding and adaptive routing that considers bandwidth price variation and transfer demands. We formulate the cost-efficient multicast transfer scheduling problem and propose an algorithm based on linear program relaxation and randomized rounding to find a solution that guarantees timely completion and reduces cost. Extensive evaluations show that CDScheduler can reduce bandwidth cost significantly and outperforms the state-of-the-art solutions by cutting down up to 78% bandwidth cost.", "venue": "IEEE Transactions on Services Computing", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-01-01", "journal": {"name": "IEEE Transactions on Services Computing", "pages": "191-205", "volume": "16"}, "authors": [{"authorId": "2064538", "name": "Long Luo"}, {"authorId": "152558600", "name": "Qixuan Jin"}, {"authorId": "2153624301", "name": "Jingzhao Xie"}, {"authorId": "143847421", "name": "Gang Sun"}, {"authorId": "49514984", "name": "Hongfang Yu"}], "citations": [{"paperId": "3399801b8c5f50a617f359ccb280ef8b6b4effab", "title": "Flexible and Efficient Multicast Transfers in Inter-Datacenter Networks"}]}
