{"paperId": "bb7d0c49f4f7fb34db936049ccfd639f1a71d4ef", "publicationVenue": null, "title": "Desain dan Analisis Sistem CyberShare Menggunakan Four Node Interplanetary File System (IPFS)", "abstract": "Cybersecurity information sharing is a proactive and collaborative measure in enhancing organizational security by exchanging cybersecurity information using a centralized repository service. However, in practice, the use of centralized services poses a threat to distributed denial-of-service (DDoS) attacks which can result in system failure and cause single point of failure as well as man-in-the-middle (MITM) attacks which can result in modification of information and theft of exchanged information. This threat results in a lack of user confidence in the confidentiality, integrity, and availability of information. This study proposes the design of a secure cybersecurity information sharing (CyberShare) system using a private interplanetary file system (IPFS) network as a decentralized information storage. Unlike centralized storage which only has a single-node, CyberShare systems use four-node IPFS interconnected with swarm keys as authentication keys. This system allows users to store and share information from the sender to the recipient of information, avoiding dependence on a central server and reducing server load. The results of the analysis show that the proposed CyberShare system can guarantee the confidentiality, integrity, and availability of cyber security information. CyberShare systems can enhance the security of the information exchanged so that organizations can safely share and utilize cybersecurity information.", "venue": "Jurnal Informatika: Jurnal Pengembangan IT", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-20", "journal": {"name": "Jurnal Informatika: Jurnal Pengembangan IT"}, "authors": [{"authorId": "2240186080", "name": "Tony Haryanto"}, {"authorId": "39240932", "name": "Kalamullah Ramli"}], "citations": []}
