{"paperId": "bb7f84bebb5270094b8eceaef70591f3fd6fb667", "publicationVenue": {"id": "86c43745-31d9-4c1a-b33f-ce3aa0042dbb", "name": "USENIX Symposium on Operating Systems Design and Implementation", "type": "conference", "alternate_names": ["Oper Syst Des Implement", "Operating Systems Design and Implementation", "OSDI", "USENIX Symp Oper Syst Des Implement"]}, "title": "FAERY: An FPGA-accelerated Embedding-based Retrieval System", "abstract": "Embedding-based retrieval (EBR) is widely used in recommendation systems to retrieve thousands of relevant candidates from a large corpus with millions or more items. A good EBR system needs to achieve both high throughput and low latency, as high throughput usually means cost saving and low latency improves user experience. Unfortunately, the performance of existing CPU-and GPU-based EBR are far from optimal due to their inherent architectural limitations. In this paper, we ﬁrst study how an ideal yet practical EBR system works, and then design F AERY , an FPGA-accelerated EBR, which achieves the optimal performance of the practically ideal EBR system. F AERY is composed of three key components: It uses a high bandwidth HBM for memory bandwidth-intensive corpus scanning, a data parallelism approach for similarity calculation, and a pipeline-based approach for K-selection. To further reduce hardware resources, F AERY introduces a ﬁlter to early drop the non-Top-K items. Experiments show that the degraded F AERY with the same memory bandwidth of GPU still achieves 1 . 21 × -12 . 27 × lower latency and up to 4 . 29 × higher throughput under a latency target of 10 ms than GPU-based EBR.", "venue": "USENIX Symposium on Operating Systems Design and Implementation", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": null, "journal": {"pages": "841-856"}, "authors": [{"authorId": "1491239993", "name": "Chaoliang Zeng"}, {"authorId": null, "name": "Layong Luo"}, {"authorId": "2056085046", "name": "Qingsong Ning"}, {"authorId": null, "name": "Yaodong Han"}, {"authorId": null, "name": "Yuhang Jiang"}, {"authorId": "2295628673", "name": "Ding Tang"}, {"authorId": "2117425339", "name": "Zilong Wang"}, {"authorId": "2290242238", "name": "Kai Chen"}, {"authorId": null, "name": "Chuanxiong Guo"}], "citations": [{"paperId": "5ec909c6d8ce311b56be5ca169fa1e82e4a7d43e", "title": "Of Apples and Oranges: Fair Comparisons in Heterogenous Systems Evaluation"}, {"paperId": "2eba4705492c131c7ba53c84b7d0f91fac10d315", "title": "DF-GAS: a Distributed FPGA-as-a-Service Architecture towards Billion-Scale Graph-based Approximate Nearest Neighbor Search"}, {"paperId": "f163042aadc800489516f86475165543a62c88b1", "title": "Chameleon: a Heterogeneous and Disaggregated Accelerator System for Retrieval-Augmented Language Models"}, {"paperId": "117f6f1b8abae6a6a75e9c4816c9ef49ff7349f0", "title": "Demystifying CXL Memory with Genuine CXL-Ready Systems and Devices"}, {"paperId": "68bfd53fae324adfb027e0bdec03b38b9daba115", "title": "Rambda: RDMA-driven Acceleration Framework for Memory-intensive µs-scale Datacenter Applications"}, {"paperId": "a5e985829a7830b1f669568f31c96f13c3b09a24", "title": "FLASH: Towards a High-performance Hardware Acceleration Architecture for Cross-silo Federated Learning"}, {"paperId": "37df8888ea3faf6b12546204f6e3ac0e4fb595fb", "title": "This paper is"}]}
