{"paperId": "bb81eb58d09f62533f7dbe0d7cdcbcb0636c6a50", "publicationVenue": {"id": "12606533-41e4-4917-b9d3-50941da6c739", "name": "Digital Library Perspectives", "alternate_names": ["Digit Libr Perspect"], "issn": "2059-5816", "url": "https://www.emerald.com/insight/publication/issn/2059-5816"}, "title": "Developing a big data analytics platform using Apache Hadoop Ecosystem for delivering big data services in libraries", "abstract": "\nPurpose\nAlthough the challenges associated with big data are increasing, the question of the most suitable big data analytics (BDA) platform in libraries is always significant. The purpose of this study is to propose a solution to this problem.\n\n\nDesign/methodology/approach\nThe current study identifies relevant literature and provides a review of big data adoption in libraries. It also presents a step-by-step guide for the development of a BDA platform using the Apache Hadoop Ecosystem. To test the system, an analysis of library big data using Apache Pig, which is a tool from the Apache Hadoop Ecosystem, was performed. It establishes the effectiveness of Apache Hadoop Ecosystem as a powerful BDA solution in libraries.\n\n\nFindings\nIt can be inferred from the literature that libraries and librarians have not taken the possibility of big data services in libraries very seriously. Also, the literature suggests that there is no significant effort made to establish any BDA architecture in libraries. This study establishes the Apache Hadoop Ecosystem as a possible solution for delivering BDA services in libraries.\n\n\nResearch limitations/implications\nThe present work suggests adapting the idea of providing various big data services in a library by developing a BDA platform, for instance, providing assistance to the researchers in understanding the big data, cleaning and curation of big data by skilled and experienced data managers and providing the infrastructural support to store, process, manage, analyze and visualize the big data.\n\n\nPractical implications\nThe study concludes that Apache Hadoops’ Hadoop Distributed File System and MapReduce components significantly reduce the complexities of big data storage and processing, respectively, and Apache Pig, using Pig Latin scripting language, is very efficient in processing big data and responding to queries with a quick response time.\n\n\nOriginality/value\nAccording to the study, there are significantly fewer efforts made to analyze big data from libraries. Furthermore, it has been discovered that acceptance of the Apache Hadoop Ecosystem as a solution to big data problems in libraries are not widely discussed in the literature, although Apache Hadoop is regarded as one of the best frameworks for big data handling.\n", "venue": "Digital Library Perspectives", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2024-02-22", "journal": {"name": "Digital Library Perspectives"}, "authors": [{"authorId": "2287192321", "name": "Ranjeet Kumar Singh"}], "citations": []}
