{"paperId": "bb8fd4225778af9f5e6e97e8e66f45e5f1b8d5dd", "publicationVenue": null, "title": "Towards Transit‑Oriented Development for Sustainable Urban Mobility: Insights from a Central European City", "abstract": "Sustainable Development Goals require holistic actions, including activity at the intersection of urban planning and environmental engineering. Turning our cities towards transit‐oriented development might help in reducing pollut‐ ant emissions caused by individual transportation modes that rely on crude oil. This research presents how the use of geospatial network analysis can support local decision makers in the evaluation of potential public transport accessibil‐ ity by citizens in the case of a Central European city – Wrocław (Poland). The obtained results indicate differentiation in access to railway stations and stops, which results from pedestrian path networks and the number of entrances to railway stations. The visualization of serve area shows which parts of the city are excluded from comfortable access to public transport and in that way high‐ light where future actions should be taken.", "venue": "", "year": 2021, "fieldsOfStudy": ["Business"], "publicationTypes": null, "publicationDate": "2021-04-27", "journal": {"name": "Geomatics and Environmental Engineering", "pages": "39-53", "volume": "15"}, "authors": [{"authorId": "2106032971", "name": "Maksymilian Leśniewski"}, {"authorId": "51351658", "name": "M. Świąder"}, {"authorId": "26955412", "name": "I. Kaczmarek"}, {"authorId": "152607206", "name": "D. Castro"}, {"authorId": "48547245", "name": "J. Kamińska"}, {"authorId": "2093670543", "name": "T. Pilawka"}, {"authorId": "152447859", "name": "J. Kazak"}], "citations": [{"paperId": "1cb91e0259275f4c71623b2c1139958fd6ff2552", "title": "Development of Sustainable Integrated Transit Area in Gorontalo Province, Indonesia"}, {"paperId": "ae2c26214a9316aae8ee9d44efc16d589382c1dd", "title": "Land use regulations, transit investment, and commuting preferences"}, {"paperId": "8b454071f58e1262c62119fc98e44ed8f887dd8d", "title": "Electromobility infrastructure and vehicles in the context of Polish legislation"}, {"paperId": "452fe114b7b894ac8ebc3ae7d8e69eaa3cd8dd2d", "title": "Exposure of Pedestrians and Cyclist to Air Pollution in the City"}, {"paperId": "6f6f5af5b267d6690afc13e6217339802faf7505", "title": "Public Participation as a Tool for Solving Socio-Spatial Conflicts of Smart Cities and Smart Villages in the Sustainable Transport System"}, {"paperId": "1a5d0638898a3dbe3614c9f7035075d1ee5a8814", "title": "Has COVID-19 Lockdown Affected on Air Quality?—Different Time Scale Case Study in Wrocław, Poland"}]}
