{"paperId": "bb97e5e233d6f15f8b8644bed87b189a07f9f6eb", "publicationVenue": {"id": "40d9ed4d-6f8b-46bb-a613-9969f48c9c60", "name": "International Conference on Internet-of-Things Design and Implementation", "type": "conference", "alternate_names": ["IoTDI", "Int Conf Internet-of-things Des Implement"]}, "title": "On the Energy Costs of Post-Quantum KEMs in TLS-based Low-Power Secure IoT", "abstract": "Recent achievements in designing quantum computers place a serious threat on the security of state-of-the-art public key cryptography and on all communication that relies on it. Meanwhile, security is seen as one of the most critical issues of low-power IoT devices even with pre-quantum public key cryptography since IoT devices have strict energy constraints and limited computational power. Thus, state-of-the-art dedicated hardware accelerators have been deployed to facilitate secure and confidential communication with well established protocols on such devices. It is common belief that the complexity of the cryptographic computations are also the bottleneck of the new, quantum-resistant algorithms and that hardware accelerators are necessary to use them efficiently on energy constrained embedded devices. In this paper, we carried out an in-depth investigation of the application of potential Post-Quantum Cryptography algorithms, which were proposed in the associated US NIST process, to a representative TLS-based low-power IoT infrastructure. First, we show that the main contributor to the TLS handshake latency are the higher bandwidth requirements of post-quantum Key-Encapsulation Mechanisms rather than the cryptographic computations itself. Second, from the perspective of crypto-agility we show that edge devices with code-based, isogeny-based as well as lattice-based algorithms have low energy consumption, which enables long battery run times in typical IoT scenarios without dedicated hardware accelerators. Third, we increase the level of security further by combining pre-quantum and post-quantum algorithms to a hybrid key exchange, and quantify the overhead in energy consumption and latency of it.", "venue": "International Conference on Internet-of-Things Design and Implementation", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2021-05-18", "journal": {"name": "Proceedings of the International Conference on Internet-of-Things Design and Implementation"}, "authors": [{"authorId": "2094942177", "name": "Maximilian Schöffel"}, {"authorId": "103531025", "name": "F. Lauer"}, {"authorId": "2245502", "name": "C. Rheinländer"}, {"authorId": "1690688", "name": "N. Wehn"}], "citations": [{"paperId": "e3ba9a5db77c6b7a039207552340f15148ed8001", "title": "Post-Quantum Cryptography for Internet of Things: A Survey on Performance and Optimization"}, {"paperId": "0a3559e9bd10ea1ebe05a7a4bc196fe8f77e3839", "title": "High Throughput Acceleration of Scabbard Key Exchange and Key Encapsulation Mechanism Using Tensor Core on GPU for IoT Applications"}, {"paperId": "b3e7c6d9e3bb7be509921759f8619d4dc56515c3", "title": "Signature Split Method for a PQC-DSA Compliant with V2V Communication Standards"}, {"paperId": "2ffc6d13349e2fa5f89aaf18e69ce2044ecef4fe", "title": "Energy Consumption Evaluation of Post-Quantum TLS 1.3 for Resource-Constrained Embedded Devices"}, {"paperId": "e833ea56662a011ba014f9275b7e57ed34410e7a", "title": "Post-Quantum Cipher Power Analysis in Lightweight Devices"}, {"paperId": "4fd3c8019ecc940a2786286d3a1c2b3085168885", "title": "Secure IoT in the Era of Quantum Computers—Where Are the Bottlenecks?"}, {"paperId": "a3c8740343f0600a040cb933d43db5e806baf1ea", "title": "Evaluation of Performance, Energy, and Computation Costs of Quantum-Attack Resilient Encryption Algorithms for Embedded Devices"}]}
