{"paperId": "bba445e0035d040ea8d81be3ca6f60fac447c4c1", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Cost- and QoS-Efficient Serverless Cloud Computing", "abstract": "Cloud-based serverless computing systems, either public or privately provisioned, aim to provide the illusion of infinite resources and abstract users from details of the allocation decisions. With the goal of providing a low cost and a high QoS, the serverless computing paradigm offers opportunities that can be harnessed to attain the goals. Specifically, our strategy in this dissertation is to avoid redundant computing, in cases where independent task requests are similar to each other and for tasks that are pointless to process. We explore two main approaches to (A) reuse part of computation needed to process the services and (B) proactively pruning tasks with a low chance of success to improve the overall QoS of the system. For the first approach, we propose a mechanism to identify various types of \"mergeable\" tasks, which can benefit from computational reuse if they are executed together as a group. To evaluate the task merging configurations extensively, we quantify the resource-saving magnitude and then leveraging the experimental data to create a resource-saving predictor. We investigate multiple tasks merging approaches that suit different workload scenarios to determine when it is appropriate to aggregate tasks and how to allocate them so that the QoS of other tasks is minimally affected. For the second approach, we developed the mechanisms to skip tasks whose chance of completing on time is not worth pursuing by drop or defer them. We determined the minimum chance of success thresholds for tasks to pass to get scheduled and executed. We dynamically adjust such thresholds based on multiple characteristics of the arriving workload and the system's conditions. We employed approximate computing to reduce the pruning mechanism's computational overheads and ensure that the mechanism can be used practically.", "venue": "arXiv.org", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-11-23", "journal": {"name": "ArXiv", "volume": "abs/2011.11711"}, "authors": [{"authorId": "51436024", "name": "Chavit Denninnart"}], "citations": [{"paperId": "0697791b674f77ec094d7f56786e078229dc3454", "title": "Efficiency in the serverless cloud paradigm: A survey on the reusing and approximation aspects"}, {"paperId": "6606d53cd1c15ca64e24a918268d0ec5f035a582", "title": "Descriptive and Predictive Analysis of Aggregating Functions in Serverless Clouds: the Case of Video Streaming"}, {"paperId": "2e2f8a92074958abca7fe7b6a1690d46048b4c10", "title": "Efficiency in the Serverless Cloud Computing Paradigm: A Survey Study"}, {"paperId": "77168512aac2d4e9bc86fc242bfa06ee5215a54f", "title": "Enhancement of Computer Network Performance with VLAN"}]}
