{"paperId": "bbb021426c859e88dc317ab4f9544cd5d0d64785", "publicationVenue": {"id": "8744aace-7669-4461-ae98-a1af701679e7", "name": "Journal of Construction Engineering Management & Innovation", "type": "journal", "alternate_names": ["J Constr Eng Manag  Innov"], "issn": "2630-5771", "url": "https://www.goldenlightpublish.com/"}, "title": "Competitiveness in the construction industry: A contractor’s perspective on barriers to improving the construction industry performance", "abstract": "Competitiveness is a complex domain with multiple perspectives and a vast range of definitions, meanings, and measures. Therefore, it is challenging to create an appropriate framework to evaluate the competitiveness of an ever-changing and evolving construction industry. This study captures the contractor’s perspectives about the competitiveness of the Pakistani construction industry, underlines the key factors affecting its performance, and proposes a framework for enhancing competitiveness. The proposed framework identifies the areas for improvement and contributes to the development of strategies for adoption. To achieve this, a qualitative approach is adopted which captures the opinion of contractors about the competitiveness and its perception and analyzes it through the fuzzy approach. The results based on 25 expert interviews highlight that the recruitment of well-trained human resource and cutting-edge technologies, the collaboration between academia and industry, investment in R&D projects, and a stable business environment contribute to enhancing the competitiveness of the construction industry and should be adopted to enhance the current state of practice. The study has perks for both academia and industry and requires active participation from both counterparts as well as supply chain actors and regulatory bodies to achieve the holistic goals.", "venue": "Journal of Construction Engineering Management & Innovation", "year": 2020, "fieldsOfStudy": ["Business"], "publicationTypes": null, "publicationDate": "2020-09-30", "journal": {"name": "Journal of Construction Engineering, Management & Innovation"}, "authors": [{"authorId": "2000706428", "name": "M. Azeem"}, {"authorId": "48633912", "name": "Fahim Ullah"}, {"authorId": "98324213", "name": "Muhammad Jamaluddin Thaheem"}, {"authorId": "1657644010", "name": "S. Qayyum"}], "citations": [{"paperId": "1f526c507550fcb6e053675431743e2019516633", "title": "Critical Review to Evaluate Performance of Ready-Mix Concrete Production Plant"}, {"paperId": "42387957410d2d9f595c8181c09c88a99bf6a881", "title": "Implementation of Infrastructure Project Through Public-PrivatePartnership in the Southern Part of West Java Province"}, {"paperId": "1358aa4b08e18896c0b472bf8b7971ab7cdea151", "title": "Analyzing the Influence of Knowledge-Based Strategies of Chinese Multinational Contractors on the Performance of the Construction Industry in Southern African Countries"}, {"paperId": "c60014ec15dbd9cbddbcf1ff3208a9e82c618e61", "title": "Towards a Model That Sees Human Resources as a Key Element for Competitiveness in Construction Management"}, {"paperId": "70aa69e3f91f3dc2d086f90c49a448828a175e51", "title": "Quantification and benchmarking of construction waste and its impact on cost – a case of Pakistan"}, {"paperId": "66619375a03bb9751dc86e2ec2654de67e2a0b7c", "title": "Automatic Target Detection from Satellite Imagery Using Machine Learning"}, {"paperId": "bf6b994a579b1a8b74dfd6d5ba3dc5888fd86188", "title": "Using Adaptive Sensors for Optimised Target Coverage in Wireless Sensor Networks"}, {"paperId": "c72316c3a420fa955c8dc978659b8fa33863920f", "title": "A review on flood management technologies related to image processing and machine learning"}, {"paperId": "50c7acc719541fc8b33f1ef495111811634c925e", "title": "Quality Management Models of Project Management in the Construction Sector"}, {"paperId": "c5a7552d525641b5698ed643e5493880dea13bfe", "title": "Managing smart cities through six sigma DMADICV method: A review-based conceptual framework"}, {"paperId": "8cdaa9ae87217adf849e95be18f2422024b51724", "title": "A Beginner’s Guide to Developing Review-Based Conceptual Frameworks in the Built Environment"}, {"paperId": "a04ef2ce8f27abb416cdcc65408ee59409deb1f9", "title": "BIMp-Chart—A Global Decision Support System for Measuring BIM Implementation Level in Construction Organizations"}, {"paperId": "dc6c200711f7a0667d1dfd67cfa4199b9445ab03", "title": "UAVs in Disaster Management: Application of Integrated Aerial Imagery and Convolutional Neural Network for Flood Detection"}, {"paperId": "03d12d332eb793d032bca60c5dc702281d41115f", "title": "Risk management in sustainable smart cities governance: A TOE framework"}, {"paperId": "b045bed810823b2667c8325e015fb1bb6b1a459f", "title": "A conceptual framework for blockchain smart contract adoption to manage real estate deals in smart cities"}, {"paperId": "1947415351851d6936b155f38e3ae4b418006098", "title": "An observational assessment of the Indian construction industry use of total quality management"}, {"paperId": "3e5065a0cf380c31091c96b7d4f6b38ebba159b5", "title": "Determination of Contractor Strategies in Delivering Construction Projects in Oman"}, {"paperId": "5167b3a6653e839b415ba279720f47c0917cd8d9", "title": "Conceptual Framework for Innovation Product and Marketing Strategy at Precast Construction Company in Indonesia to Increase Competitiveness Using SWOT and Neural Network Model"}, {"paperId": "09b17532657eeda785b0da1dbc5fded6ab31f859", "title": "Addressing disasters in smart cities through UAVs path planning and 5G communications: A systematic review"}]}
