{"paperId": "bbb3d91243da9af523e63e74a769217de8a6d975", "publicationVenue": null, "title": "Comparative Analysis on Automated Testing of Web-based Application", "abstract": "One of the important stages of the Software Development Life Cycle is Software Testing. Currently, we perceive swift progression in web services which represents as a communication interface for several network applications. Several automation testing tools help the tester to do a test on web services or applications. On that point, a great deal of choices is available for testing tools to select. Straight off a day’s mobile and Web applications are developed the most and tested. Software developer and tester can easily automate the testing process by saving money, time and human resource. The primary aim of this theme is to offer a comparative study on commercial and open source web automation testing tools which will assist the developers to opt for the appropriate tools as per the demands.", "venue": "2018 International Conference on Advances in Computing, Communication Control and Networking (ICACCCN)", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2018-10-01", "journal": {"name": "2018 International Conference on Advances in Computing, Communication Control and Networking (ICACCCN)", "pages": "408-413"}, "authors": [{"authorId": "3399971", "name": "R. K. Lenka"}, {"authorId": "120279254", "name": "Utkalika Satapathy"}, {"authorId": "81091302", "name": "M. Dey"}], "citations": [{"paperId": "1139a258454315a7f5a86010ae2cb27ea16645e4", "title": "An Investigation Into the Efficacy of RANOREX Software Test Automation Tool"}, {"paperId": "0786affcf40d3cf57867bb3e8052a1f1543e2c53", "title": "Comparative Study Of Software Automation Tools: Selenium And Quick Test Professional"}, {"paperId": "687796ad636e42e4f9902f64ba09b7951198ee5c", "title": "Scriptless GUI Automation Testing Tool for Web Applications"}, {"paperId": "4dcf4c60cb4613e901638daeeace7e7f5465ee3a", "title": "Design and implementation of automated visual regression testing in a large software product"}, {"paperId": "9cb6632f5704a289f3c4dfa20cbfbdcace493115", "title": "IMPROVING THE USABILITY TESTING: FUZZY BASED EXPERT SYSTEM FOR TEST CASE GENERATION ON WEB GRAPHICAL USER INTERFACE"}]}
