{"paperId": "bbbd70b8457dc54935cb8d55f96857b73c00e0ca", "publicationVenue": {"id": "2ef3d692-67d8-4150-8e21-55b389e72376", "name": "Journal of computing and security", "type": "journal", "alternate_names": ["J comput secur", "Journal of Computer Security", "J Comput Secur"], "issn": "2322-4460", "alternate_issns": ["0926-227X"], "url": "http://jcomsec.org/", "alternate_urls": ["http://content.iospress.com/journals/journal-of-computer-security"]}, "title": "USBCaptchaIn: Preventing (Un)Conventional Attacks from Promiscuously Used USB Devices in Industrial Control Systems", "abstract": "Industrial Control Systems (ICS) are sensible targets for high profile attackers and advanced persistent threats, which are known to exploit USB thumb drives as an effective spreading vector. In ICSes, thumb drives are widely used to transfer files among disconnected systems and represent a serious security risks, since, they may be promiscuously used in both critical and regular systems. The threats come both from malware hidden in files stored in the thumb drives and from BadUSB attacks. BadUSB leverages the modification of firmware of USB devices in order to mimic the behaviour of a keyboard and send malicious commands to the host. We present a solution that allows a promiscuous use of USB thumbs drives while protecting critical machines from malware, that spreads by regular file infection or by firmware infection. The main component of the architecture we propose is an hardware, called USBCaptchaIn, intended to be in the middle between critical machines and connected USB devices. We do not require users to change the way they use thumb drives. To avoid human-errors, we do not require users to take any decision. The proposed approach is highly compatible with already deployed products of a ICS environment and proactively blocks malware before they reach their targets. We describe our solution, provide a thorough analysis of the security of our approach in the ICS context, and report the informal feedback of some experts regarding our first prototypes.", "venue": "Journal of computing and security", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-10-11", "journal": {"name": "ArXiv", "volume": "abs/1810.05005"}, "authors": [{"authorId": "8793559", "name": "F. Griscioli"}, {"authorId": "1721655", "name": "M. Pizzonia"}], "citations": []}
