{"paperId": "bbe192c04b8a97a67a0742b529efa14b6643716e", "publicationVenue": {"id": "fcbcaf18-8ab1-43e1-a973-604bbc7e344e", "name": "Proceedings of the VLDB Endowment", "type": "journal", "alternate_names": ["Proceedings of The Vldb Endowment", "Proc VLDB Endow", "Proc Vldb Endow"], "issn": "2150-8097", "url": "http://dl.acm.org/toc.cfm?id=J1174", "alternate_urls": ["http://portal.acm.org/toc.cfm?CFID=21632689&CFTOKEN=99329904&WantType=Affiliated%20Organizations&coll=ACM&dl=ACM&id=J1174&idx=J1174&part=affil&title=VLDB%20Endowment&type=periodical"]}, "title": "SageDB: An Instance-Optimized Data Analytics System", "abstract": "\n Modern data systems are typically both complex and general-purpose. They are complex because of the numerous internal knobs and parameters that users need to manually tune in order to achieve good performance; they are general-purpose because they are designed to handle diverse use cases, and therefore often do not achieve the best possible performance for any specific use case. A recent trend aims to tackle these pitfalls:\n instance-optimized\n systems are designed to automatically self-adjust in order to achieve the best performance for a specific use case, i.e., a dataset and query workload. Thus far, the research community has focused on creating instance-optimized database components, such as learned indexes and learned cardinality estimators, which are evaluated in isolation. However, to the best of our knowledge, there is no complete data system built with instance-optimization as a foundational design principle.\n \n In this paper, we present a progress report on SageDB, our effort towards building the first instance-optimized data system. SageDB synthesizes various instance-optimization techniques to automatically specialize for a given use case, while simultaneously exposing a simple user interface that places minimal technical burden on the user. Our prototype outperforms a commercial cloud-based analytics system by up to 3X on end-to-end query workloads and up to 250X on individual queries. SageDB is an ongoing research effort, and we highlight our lessons learned and key directions for future work.", "venue": "Proceedings of the VLDB Endowment", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-09-01", "journal": {"name": "Proc. VLDB Endow.", "pages": "4062-4078", "volume": "15"}, "authors": [{"authorId": "2647009", "name": "Jialin Ding"}, {"authorId": "40412858", "name": "Ryan Marcus"}, {"authorId": "1922104", "name": "Andreas Kipf"}, {"authorId": "2335477", "name": "Vikram Nathan"}, {"authorId": "1383116857", "name": "Aniruddha Nrusimha"}, {"authorId": "7188311", "name": "Kapil Vaidya"}, {"authorId": "46249201", "name": "Alexander van Renen"}, {"authorId": "1746961", "name": "Tim Kraska"}], "citations": [{"paperId": "bfb2b0b0d0621ea4de93fb960d45a4c5bbabcc38", "title": "ByteCard: Enhancing ByteDance's Data Warehouse with Learned Cardinality Estimation"}, {"paperId": "ac0270e7af0b2b013156c888050be082c673c3cf", "title": "A Survey of Learned Indexes for the Multi-dimensional Space"}, {"paperId": "ebe7b4b3931d9df634b0e9667ec7686e1eac9c94", "title": "Grep: A Graph Learning Based Database Partitioning System"}, {"paperId": "dff0e6b1b327ab13be7ef42bbb2567c94d551f95", "title": "Analytical Engines With Context-Rich Processing: Towards Efficient Next-Generation Analytics"}]}
