{"paperId": "bbe2f24d085d3872fe9564b4539ac1c3ee55271a", "publicationVenue": null, "title": "A Microservice Based Architecture Topology for Machine Learning Deployment", "abstract": "Smart solutions that make use of machine learning and data analyses are on the rise. Big Data analysis is attracting more and more developers and researchers, and at least five requirements (Velocity, Volume, Value, Variety, and Veracity) show challenges in deploying such solutions. Across the globe, many Smart City initiatives are using Big Data Analytics as a tool for doing predictive analytics which can be helpful to human well being. This work presents a generic architecture named Machine Learning in Microservices Architecture (MLMA) that provides design patterns to transform a monolithic architecture of machine learning pipelines in microservices with separate roles. We present two case studies deployed to a Smart City initiative, where we discuss how each component of the architecture applied in specific applications that use predictions with machine learning. Among the benefits of this architecture, we argue prediction performance, scalability, code maintenance and reusability makes such transition a natural trend in Big Data and machine learning applications.", "venue": "2019 IEEE International Smart Cities Conference (ISC2)", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-10-01", "journal": {"name": "2019 IEEE International Smart Cities Conference (ISC2)", "pages": "426-431"}, "authors": [{"authorId": "40588209", "name": "J. L. Ribeiro"}, {"authorId": "50283693", "name": "Mickael Figueredo"}, {"authorId": "153150005", "name": "A. Araújo"}, {"authorId": "1736197", "name": "N. Cacho"}, {"authorId": "145094992", "name": "Frederico Lopes"}], "citations": [{"paperId": "36190a3036de35d7380d3b4789806244fa9e1476", "title": "Towards green AI-based software systems: an architecture-centric approach (GAISSA)"}, {"paperId": "1fe9d458519b2605d8b933b550f7c9ebf9a60f44", "title": "The role of microservice approach in edge computing: Opportunities, challenges, and research directions"}, {"paperId": "514a96af287ab19a399479f91ae91a28b1593c5c", "title": "AI-Enabled Secure Microservices in Edge Computing: Opportunities and Challenges"}, {"paperId": "126c0bf491c774cb458cc15b6a7006ceae2d8aee", "title": "An Enhanced Cloud-Native Deep Learning Pipeline for Network Traffic Classification"}, {"paperId": "fe8defd9eae0f788d1210231e669fd0f95c4d922", "title": "Examining the Interplay Between Big Data and Microservices - A Bibliometric Review"}, {"paperId": "ac1bf77889bd5f16bbbf45ab9a8ccee931223962", "title": "Privacy-Preserving Microservices in Industrial Internet-of-Things-Driven Smart Applications"}, {"paperId": "0920312b76f1178f9f1b7c960cc53d4d224acce8", "title": "MLOPS and Microservices Frameworks in the Perspective of Smart Cities"}]}
