{"paperId": "bbe5c16830274dff1b644ef095a450c55c9ea727", "publicationVenue": null, "title": "Investigating The Content Validity of An Iot-Acceptance Survey Instrument in Higher Education: A Study in The Context of Sindh, Pakistan", "abstract": "\n\n\n\nIn the realm of educational research, this study embarks on a pivotal exploration into the acceptance of the Internet of Things (IoT) by students in their learning environment. Recognizing the indispensable role of content validity in ensuring the robustness of measurement tools, particularly in the context of questionnaire development, this research meticulously employed a systematic approach guided by evidence and best practices. Drawing inspiration from the Unified Theory of Acceptance and Use of Technology 2 (UTAUT 2) model, our aim was to bridge a critical gap in the existing body of knowledge. IoT, a cornerstone in Higher Education Institutes (HEIs), prompted the development of a sophisticated educational acceptance instrument. However, prior to embarking on the pilot study phase, our focus turned to the intricate process of content validation. Six esteemed experts were judiciously selected to form our expert panel, each bringing a wealth of experience and knowledge to the evaluation. Employing the Expert Panel Rating Chart (EPRC), their invaluable insights were systematically incorporated, utilizing both item-level Content Validity Index (I-CVI) and scale-level CVI (S-CVI). The outcomes not only met but exceeded the established thresholds of acceptability, affirming the content validity of our instrument. The significance of this meticulous content validation process cannot be overstated. It serves as the bedrock upon which the reliability and validity of our educational acceptance instrument rest. As latent variables and study items underwent meticulous scrutiny and refinement, the resultant instrument emerged as a beacon of precision, ready to navigate the uncharted waters of assessing students' acceptance levels of IoT in their academic journey. In essence, this research underscores the paramount importance of content validity in the development of assessment tools, offering a methodologically robust approach anchored in evidence and best practices. The validated UTAUT2-based acceptance instrument now stands poised to contribute significantly to future studies, unraveling the intricate dynamics of IoT acceptance and its applications in the realm of university education.\n\n\n\n", "venue": "The Asian Bulletin of Big Data Management", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2024-01-08", "journal": {"name": "The Asian Bulletin of Big Data Management"}, "authors": [{"authorId": "2293485466", "name": "Anees Muhammad Jamali"}, {"authorId": "145318913", "name": "Shahmurad Chandio"}, {"authorId": "2293484311", "name": "Mujeeb ur Rahman Maree"}], "citations": []}
