{"paperId": "bc028fc85efae92f8a3944741d83a86e7d520d15", "publicationVenue": {"id": "9232b9b1-e3db-417b-ab86-8c88ae769c1d", "name": "Brazilian Symposium on Information Systems", "type": "conference", "alternate_names": ["SBSI ", "Braz Symp Inf Syst"]}, "title": "Microservice Architecture for Multistore Database Using Canonical Data Model", "abstract": "In a microservice architecture, solutions are created by teams focused on specific domains and needs. They independently develop and deploy distributed services in the network. One characteristic of microservices is decentralized data management. Each microservice may use different data management technology which best fit its needs. Hence, it is an issue to integrate data of heterogenous microservices to come up with consolidate data views. Flexible and efficient solutions in this scenario are needed. This work is based on the use of a canonical data model as the mechanism for data integration in microservices. The canonical data model is the reference for query specifications and data integration. This work proposes and implements a microservice architecture based on this strategy and it is composed by nodes that intercommunicate through several mechanisms (e.g., SPARQL, GraphQL and JDBC queries, calls to REST services and proprietary APIs). The solution was analyzed in a proof of concept in a fictitious scenario but using real services available at DBPedia and Twitter. The evaluation goal was to qualitatively analyze the use of the architecture in the design, development and execution of microservices in order to identify the characteristics one should consider when using the canonical data model strategy. The evaluation employed the criteria of ISO/IEC 25010 model that most relate to the SOA challenges, which were: usability; performance; compatibility; and, maintainability. The identified advantages and disadvantages of using the architecture (i.e., the strategy) can be used by architects and developers to make their development decisions.", "venue": "Brazilian Symposium on Information Systems", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2020-10-20", "journal": {"name": "Proceedings of the XVI Brazilian Symposium on Information Systems"}, "authors": [{"authorId": "51039372", "name": "L. H. N. Villaça"}, {"authorId": "1785758", "name": "L. Azevedo"}, {"authorId": "7494930", "name": "S. Siqueira"}], "citations": [{"paperId": "06d6635aaf2276a74914d678ea8998cbd945b09f", "title": "A Polystore Architecture Using Knowledge Graphs to Support Queries on Heterogeneous Data Stores"}, {"paperId": "32c554b1922eb91e0a979c69153c7f6311de447b", "title": "METL: a modern ETL pipeline with a dynamic mapping matrix"}]}
