{"paperId": "bc079512ad2774440d7d13ff18f3d7e675b7144d", "publicationVenue": {"id": "758df734-9f07-4673-955f-a9003ce1b998", "name": "Journal of Humanitarian Logistics and Supply Chain Management", "type": "journal", "alternate_names": ["J Humanit Logist Supply Chain Manag"], "issn": "2042-6747", "url": "https://www.emerald.com/insight/publication/issn/2042-6747", "alternate_urls": ["http://www.emeraldinsight.com/products/journals/journals.htm?id=jhlscm"]}, "title": "A multi-objective optimization model for logistic planning in the crisis response phase", "abstract": "PurposeProper planning for the response phase of humanitarian relief can significantly prevent many financial and human losses. To this aim, a multi-objective optimization model is proposed in this paper that considers different types of injured people, different vehicles with determining capacities and multi-period logistic planning. This model can be updated based on new information about resources and newly identified injured people.Design/methodology/approachThe main objective function of the proposed model in this paper is minimizing the unsatisfied prioritized injured people in the network. Besides, the total transportation activities of different types of vehicles are considered as another objective function. Therefore, these objectives are optimized hierarchically in the proposed model using the Lexicographic method. This method finds the best value for the first objective function. Then, it tries to optimize transportation activities as the second objective function while maintaining the optimality of the first objective function.FindingsThe performances of the proposed model were analyzed in different cases and its robust approach for different problems was shown within the framework of a case study. Besides, the sensitivity analysis of results shows the logical behavior of the proposed model against various factors.Practical implicationsThe proposed methodology can be applied to find the best response plan for all crises.Originality/valueIn this paper, we have tried to use a multi-objective optimization model to guide and correct response programs to deal with the occurred crisis. This is important because it can help emergency managers to improve their plans.", "venue": "Journal of Humanitarian Logistics and Supply Chain Management", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-06-03", "journal": {"name": "Journal of Humanitarian Logistics and Supply Chain Management"}, "authors": [{"authorId": "1580096025", "name": "M. Ershadi"}, {"authorId": "73974456", "name": "H. Shemirani"}], "citations": [{"paperId": "597fbaeeb5cabe9dd551c0694b88993d945c70cb", "title": "Uncertain SEIAR system dynamics modeling for improved community health management of respiratory virus diseases: A COVID-19 case study"}, {"paperId": "09237269d1b22a5c05f6be665af96b934c2c9be0", "title": "A systematic survey of multicriteria models in humanitarian logistics"}, {"paperId": "f2898baea0ede68ed1fc7770d7c3108bc0be1e79", "title": "Big Data Swarm Intelligence Optimization Algorithm Application in the Intelligent Management of an E-Commerce Logistics Warehouse"}, {"paperId": "3dd3c7446a563378b6c1e7d6b8a02e970e38026d", "title": "The Impact of Quality Dimensions of Accounting Information System Success on the Effectiveness of During-Financial Crisis Management: The Mediating Role of System Usage in a Government Sector Context"}, {"paperId": "be6e6d5478bd73f2e11bbce379d2ce44b4c03783", "title": "Guest editorial: The COVID-19 impact on humanitarian operations: lessons for future disrupting events"}, {"paperId": "c1e5c215e65643a3fadbb447663e887979d4a84b", "title": "A hybrid relief procurement contract for humanitarian logistics"}, {"paperId": "ac6b78089eba8140a0a10b9eeb9b0904dab8f658", "title": "Scenario-based redesigning of a relief supply-chain network by considering humanitarian constraints, triage, and volunteers’ help"}, {"paperId": "870bcb867666c1725d913db447463d7cfe8b6826", "title": "The Association Between the Success of Information Systems and Crises Management (A Theoretical View and Proposed Framework)"}, {"paperId": "fd6b644a76e31f76e685dfe4f32497491349e495", "title": "Logistic planning for pharmaceutical supply chain using multi-objective optimization model"}]}
