{"paperId": "bc2b527473cde33cc186b481a71023fd53c99a9b", "publicationVenue": null, "title": "BIG DATA STRATEGY FOR THE OIL AND GAS INDUSTRY: GENERAL DIRECTIONS", "abstract": "Big Data technologies provide approaches and tools that are essential for the competitive development of the oil and gas industry. Interests of the oil and gas companies towards the Big Data are growing against the backdrop of the plummeting oil prices in the global energy market. An imperative prerequisite for the effective implementation on this steer is to establish a strategy organically correlated to the general corporate strategy. To this end, in this paper, we consider the development of Big Data strategy for the oil and gas industry. Moreover, the paper analyzes the potential of Big Data technology and Big Data sources in the oil and gas industry, Big Data application experience in oil and gas companies and the existing problems in the field of data management. We also define the general principles and direction of the formation and implementation of Big Data strategy.", "venue": "", "year": 2017, "fieldsOfStudy": ["Engineering"], "publicationTypes": null, "publicationDate": "2017-07-12", "journal": {"name": "", "pages": "31-42", "volume": "08"}, "authors": [{"authorId": "2708502", "name": "R. Aliguliyev"}, {"authorId": "3187888", "name": "Y. Imamverdiyev"}], "citations": [{"paperId": "040325108cf9dd8b727498e94bb4d7b8f3841320", "title": "Machine Learning Prediction Versus Decline Curve Prediction: A Niger Delta Case Study"}, {"paperId": "4f2c8db88ccb08bda390f2973fbbcc5892b0adc8", "title": "Accelerate Non-Metallic Seal Development for Downhole Applications by Applying a Big Data Method in Material Data"}, {"paperId": "dd4aaf035b887b57fd42e726901f9940d2a61a66", "title": "Predicting machine failure using recurrent neural network-gated recurrent unit (RNN-GRU) through time series data"}, {"paperId": "9ec2f929ee115b5c37b2b87f41e6965e5e41f175", "title": "Alarm Forecasting in Natural Gas Pipelines"}, {"paperId": "d629092eb7e754e58658a3211edd14401f381226", "title": "Discovery of Corrosion Patterns using Symbolic Time Series Representation and N-gram Model"}]}
