{"paperId": "bc3da3227643a15389715d306487d25cf9f2c1cd", "publicationVenue": {"id": "82ed09f6-6da3-4c61-8efe-660e533af49d", "name": "International Journal of Computers Communications & Control", "type": "journal", "alternate_names": ["Int J Comput Commun  Control"], "issn": "1841-9836", "url": "http://univagora.ro/jour/index.php/ijccc/", "alternate_urls": ["http://journal.univagora.ro/?page=home", "http://journal.univagora.ro/"]}, "title": "ESBL: Design and Implement A Cloud Integrated Framework for IoT Load Balancing", "abstract": "The continuous growth in wireless communication, the demand for sophisticated, simple and low-cost solutions are also increasing. The demand motivated the researchers to indulge into inventing suitable network solutions ranging from wireless sensor networks to wireless ad-hoc networks to Internet of Things (IoT). With the inventions coming from the researchers, the demand for further improvements into the existing researchers have also growth upbound. Initially the network protocols were the demand for research and further improvements. Nevertheless, the IoT devices are started getting used in various fields and started gathering a huge volume of data using complex application. This invites the demands for research on load balancing for IoT networks. Several research attempts were made to overcome the communication overheads caused by the heavy loads on the IoT networks. Theses research attempts proposed to manage the loads in the network by equally distributing the loads among the IoT nodes. Nonetheless, in the due course of time, the practitioners have decided to move the data collected by the IoT nodes and the applications processing those data in to the cloud. Hence, the challenge is to build an algorithm for cloud-based load balancer matching with the demands from the IoT network protocols. Hence, this work proposes a novel algorithm for managing the loads on cloud integrated IoT network frameworks. The proposed algorithm utilizes the analytics of loads on cloud computing environments driven by the physical host machines and the virtual environments. The major challenge addressed by this work is to design a load balancer considering the low availability of the energy and computational capabilities of IoT nodes but with the objective to improve the response time of the IoT network. The proposed algorithm for load balancer is designed considering the low effort integrations with existing IoT framework for making the wireless communication world a better place.", "venue": "International Journal of Computers Communications & Control", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-08-05", "journal": {"name": "Int. J. Comput. Commun. Control", "pages": "459-474", "volume": "14"}, "authors": [{"authorId": "70502084", "name": "G. Balakrishna"}, {"authorId": "51446994", "name": "Nageswara Rao Moparthi"}], "citations": [{"paperId": "06abd00fc363a3afc80916c545fe0865f0e90be9", "title": "An improved energy-efficient cloud-optimized load-balancing for IoT frameworks"}, {"paperId": "2ae1264dfbb251965b5d15b4d4bce0ba2fd46ee3", "title": "Industry 4.0: A Revolution in Healthcare Sector via Cloud, Fog Technologies"}, {"paperId": "c86600b1d93036bbc6fc8722b62a967e9cfe89dd", "title": "An Enhanced Load Balancing Approach for Dynamic Resource Allocation in Cloud Environments"}, {"paperId": "58f7f8179ae85e8500fc2137224d48f7f48bfaef", "title": "Water Conservation Control by using IoT Smart Meter"}, {"paperId": "dffd7b0205cc91f7296dc7020310571c49242095", "title": "The contribution of the Internet of Things and smart systems to agricultural practices: A survey"}, {"paperId": "873d2fb224e825e8a91cc90e3dd0042539b65836", "title": "A secure cloud service deployment framework for DevOps"}, {"paperId": "a86e34cc850b821866b5db372e79cc718b0c1ef0", "title": "Detecting Faults within a Cloud Using Machine Learning Techniques"}, {"paperId": "f7f1475b206ec321a6e9b77a44c2a820174de9bf", "title": "A Secured and Effective Load Monitoring and Scheduling Migration VM in Cloud Computing"}, {"paperId": "8157e53f689a9e421eb887fea387337ee92a1a9c", "title": "Hybrid gradient descent spider monkey optimization (HGDSMO) algorithm for efficient resource scheduling for big data processing in heterogenous environment"}, {"paperId": "dbb9b512f953e17d77acb828aab87cf2588e489e", "title": "Study report on Indian agriculture with IoT"}, {"paperId": "64378f09ac649c16a08172cc9fcce2f6f6eb4b6b", "title": "The Automatic Agricultural Crop Maintenance System using Runway Scheduling Algorithm: Fuzzyc-LR for IoT Networks"}]}
