{"paperId": "bc403590fcb9b6fbc6548af5b0b9cea639510156", "publicationVenue": null, "title": "A Robust Framework for Deep Learning Approaches to Facial Emotion Recognition and Evaluation", "abstract": "Facial emotion recognition (FER) is a vast and complex problem space within the domain of computer vision and thus requires a universally accepted baseline method with which to evaluate proposed models. While test datasets have served this purpose in the academic sphere, real-world application and testing of such models lacks any real comparison. Therefore, we propose a framework in which models developed for FER can be compared and contrasted against one another in a constant, standardized fashion. A lightweight convolutional neural network (CNN) is trained on the AffectNet dataset - a large, variable dataset for facial emotion recognition - and a web application is developed and deployed with our proposed framework as a proof of concept. The CNN is embedded into our application and is capable of instant, real-time facial emotion recognition. When tested on the AffectNet test set, this model achieves an accuracy of 55.09% for emotion classification of eight different emotions. Using our framework, the validity of this model and others can be properly tested by evaluating a model's efficacy not only based on its accuracy on a sample test dataset, but also on in-the-wild experiments. Additionally, our application is built with the ability to save and store any image captured or uploaded to it for emotion recognition, allowing for the curation of more quality and diverse facial emotion recognition datasets.", "venue": "2022 Asia Conference on Algorithms, Computing and Machine Learning (CACML)", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-01-30", "journal": {"name": "2022 Asia Conference on Algorithms, Computing and Machine Learning (CACML)", "pages": "68-73"}, "authors": [{"authorId": "2133144059", "name": "Nyle Siddiqui"}, {"authorId": "51288952", "name": "Rushit Dave"}, {"authorId": "2151795389", "name": "Tyler Bauer"}, {"authorId": "2151793650", "name": "Thomas Reither"}, {"authorId": "2151883673", "name": "Dylan Black"}, {"authorId": "2151793998", "name": "Mitchell Hanson"}], "citations": [{"paperId": "0fe409b88be203bd7d51fca713834440042dce94", "title": "Facial Emotion Images Recognition Based On Binarized Genetic Algorithm-Random Forest"}, {"paperId": "2da72b362798552f25895f1e03d788c65bc26852", "title": "Facial Emotion Recognition in Unconstrained Environments through Rank-Based Ensemble of Deep Learning Models using 1-Cycle Policy"}, {"paperId": "f2b23c434b6334c9fc3d3bbb78983a5557dc965a", "title": "Ensemble Convolution Neural Network for Robust Video Emotion Recognition Using Deep Semantics"}, {"paperId": "0905608d0a6f0adaba15a71e39e0180c22da9fb8", "title": "A Review on Face Emotion Recognition using EEG Features and Facial Features"}, {"paperId": "67ee28681b17ede63aae23433b779b9e7a96bb59", "title": "Facial Emotion Recognition using CNN and VGG-16"}, {"paperId": "8273f9295d6c6ae9d77ada4946520dc1738d4649", "title": "Multimodal Feature Extraction and Fusion for Emotional Reaction Intensity Estimation and Expression Classification in Videos with Transformers"}, {"paperId": "f033c9e2bfa81df46e4165d824edb9baf8d07cd7", "title": "Mitigating Presentation Attack using DCGAN and Deep CNN"}, {"paperId": "81e04590b372c21dd8a63a0c14c27eb8821fadb9", "title": "Evaluation of a User Authentication Schema Using Behavioral Biometrics and Machine Learning"}, {"paperId": "e2844bfc4900fdee4cb2fd17ba8a148e8c2d0098", "title": "Development of models for managing the population mass service system in a bank"}]}
