{"paperId": "bc46b6941c1ebfb66dfec38fbbd72c82d85f7949", "publicationVenue": {"id": "e1ce0fed-d655-40bd-b678-9adc73f2e582", "name": "International Symposium on High Performance Computing Systems and Applications", "type": "conference", "alternate_names": ["International Conference on High Performance Computing and Simulation", "Int Conf High Perform Comput  Simul", "Int Symp High Perform Comput Syst Appl", "High Performance Computing Systems and Applications", "High Perform Comput Syst Appl", "Int Conf High Perform Comput Simul", "HPCS", "International Conference on High Performance Computing & Simulation"]}, "title": "DP2: A Highly Parallel Range Join for Genome Analysis on Distributed Computing Platform", "abstract": "Rapid growth of the sheer amount of genome data and intense computation become great challenges for downstream genome analytics. Efficient parallel processing and distributed computing are the two effective schemes to address the analysis of big data. Range join is a widely used, effective, yet time-consuming operation that finds the overlap between two different sets of genome features. The current widely adopted BEDTools [6] pipeline adopts single-node binary tree approach, while the distributed GenAp scheme fails to exploit the massive parallel computation on modern throughput processors, such as GPU (Graphic Processing Unit). This paper proposes a novel Distributed Parallel P-ary search (DP2) that applies novel P-ary analysis to enable high parallelism at algorithmic level, and extensively utilize multiple GPUs at system and architecture level. Efficient computation allocation is implemented to leverage the distributed computing on clusters. The proposed framework can be well integrated with current BEDTools [6] pipeline, and achieves an average of 25x speedup for the actual range-join operation when compared with Binary tree approach of GenAp and a 13x end-to-end (total execution time) speedup in comparison to ADAM.", "venue": "International Symposium on High Performance Computing Systems and Applications", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-07-01", "journal": {"name": "2019 International Conference on High Performance Computing & Simulation (HPCS)", "pages": "358-362"}, "authors": [{"authorId": "2079871395", "name": "Aman Sinha"}, {"authorId": "145295257", "name": "B. Lai"}], "citations": []}
