{"paperId": "bc4ce192d4ac25fefc4ac386ddb0565e1d9eee29", "publicationVenue": {"id": "8e1bd4b5-d5b2-4e22-ba0a-01fe5568d472", "name": "Remote Sensing", "type": "journal", "alternate_names": ["Remote Sens"], "issn": "2315-4675", "alternate_issns": ["2072-4292"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169233", "alternate_urls": ["https://www.mdpi.com/journal/remotesensing", "http://www.mdpi.com/journal/remotesensing", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169233"]}, "title": "Comparison of Machine Learning Algorithms for Flood Susceptibility Mapping", "abstract": "Floods are one of the most destructive natural disasters, causing financial and human losses every year. As a result, reliable Flood Susceptibility Mapping (FSM) is required for effective flood management and reducing its harmful effects. In this study, a new machine learning model based on the Cascade Forest Model (CFM) was developed for FSM. Satellite imagery, historical reports, and field data were used to determine flood-inundated areas. The database included 21 flood-conditioning factors obtained from different sources. The performance of the proposed CFM was evaluated over two study areas, and the results were compared with those of other six machine learning methods, including Support Vector Machine (SVM), Decision Tree (DT), Random Forest (RF), Deep Neural Network (DNN), Light Gradient Boosting Machine (LightGBM), Extreme Gradient Boosting (XGBoost), and Categorical Boosting (CatBoost). The result showed CFM produced the highest accuracy compared to other models over both study areas. The Overall Accuracy (AC), Kappa Coefficient (KC), and Area Under the Receiver Operating Characteristic Curve (AUC) of the proposed model were more than 95%, 0.8, 0.95, respectively. Most of these models recognized the southwestern part of the Karun basin, northern and northwestern regions of the Gorganrud basin as susceptible areas.", "venue": "Remote Sensing", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-12-29", "journal": {"name": "Remote. Sens.", "pages": "192", "volume": "15"}, "authors": [{"authorId": "65814305", "name": "S. T. Seydi"}, {"authorId": "150349228", "name": "Y. Kanani-Sadat"}, {"authorId": "2343052", "name": "M. Hasanlou"}, {"authorId": "2198686393", "name": "R. Sahraei"}, {"authorId": "1744943", "name": "J. Chanussot"}, {"authorId": "3406473", "name": "M. Amani"}], "citations": [{"paperId": "6b953e903b0fe95f0fe507b4c2359526c2b64ccf", "title": "Enhancing flood prediction in Southern West Bengal, India using ensemble machine learning models optimized with symbiotic organisms search algorithm"}, {"paperId": "cb20d9b715e89d61175ee7c8b41e88d154b0ea12", "title": "Optimizing flood susceptibility assessment in semi-arid regions using ensemble algorithms: a case study of Moroccan High Atlas"}, {"paperId": "80dfb6776e66326b17de35aeaa6187c52f446318", "title": "A comparative spatial analysis of flood susceptibility mapping using boosting machine learning algorithms in Rathnapura, Sri Lanka"}, {"paperId": "27532ddf95068789b2d29d9ae7a91cc085196192", "title": "Machine learning models for gully erosion susceptibility assessment in the Tensift catchment, Haouz Plain, Morocco for sustainable development"}, {"paperId": "ade6fcefc5a4fa7cbc5b8be6c3c7a29f80dd00ad", "title": "Quantifying flood risk using InVEST-UFRM model and mitigation strategies: the case of Adama City, Ethiopia"}, {"paperId": "681dff4913f0aff04f7ce6f35f8c1249d5ab2e3d", "title": "Leveraging machine learning and open-source spatial datasets to enhance flood susceptibility mapping in transboundary river basin"}, {"paperId": "aa911ba1c3ca0502564053c851340c2c5eea4e30", "title": "Novel optimized deep learning algorithms and explainable artificial intelligence for storm surge susceptibility modeling and management in a flood-prone island"}, {"paperId": "b357b542a4f0815adc1c19ea6b171417180cc51e", "title": "Flood susceptibility mapping through geoinformatics and ensemble learning methods, with an emphasis on the AdaBoost-Decision Tree algorithm, in Mazandaran, Iran"}, {"paperId": "83820f8ca5453104333374a9bcf0d53e029d462d", "title": "Flood susceptibility assessment using machine learning approach in the Mohana-Khutiya River of Nepal"}, {"paperId": "c721f93e451e911639a5af5ff76d9be4a1751689", "title": "Flash Flood Susceptibility Mapping of North-east Depression of Bangladesh using Different GIS based Bivariate Statistical Models"}, {"paperId": "4e0df663f51b6bb2ea525091394da88f13cef222", "title": "An XGBoost-SHAP approach to quantifying morphological impact on urban flooding susceptibility"}, {"paperId": "2f1f9b56035f5ca475b266a6f97678eb472d33b5", "title": "Flood susceptibility mapping to improve models of species distributions"}, {"paperId": "9b9c8d8f4e53ed2a4ae1ccb8e8e18be117407b8d", "title": "Flood susceptibility prediction using MaxEnt and frequency ratio modeling for Kokcha River in Afghanistan"}, {"paperId": "a63c85554a9d1a87f0ba8e0ab30cb81753b25ea4", "title": "A Comparison of Machine Learning Models for Predicting Flood Susceptibility Based on the Enhanced NHAND Method"}, {"paperId": "f3cd9205f3b151e07aff546b5d495d523d872569", "title": "A hybrid of ensemble machine learning models with RFE and Boruta wrapper-based algorithms for flash flood susceptibility assessment"}, {"paperId": "57cfb4c8ce0ff6b618ace7a1c23bf981c36efc3e", "title": "Modeling and Mapping of Flood Susceptibility at Que Son District, Quang Nam Province, Vietnam using CatBoost"}, {"paperId": "0354cf9b1899c811cbc9d8a63b0c9b09c528b0e6", "title": "AI-enabled strategies for climate change adaptation: protecting communities, infrastructure, and businesses from the impacts of climate change"}, {"paperId": "d2c11abfcce502362cd95a13f71ef66dfd9600bc", "title": "Flood susceptibility modeling of the Karnali river basin of Nepal using different machine learning approaches"}, {"paperId": "137d94deeb9d8d6e14890b21b915fe3201ee919e", "title": "Enhancing flood risk assessment through integration of ensemble learning approaches and physical-based hydrological modeling"}, {"paperId": "8b8a7f139169302ffdd3e816a16e2247f716588c", "title": "Predicting the Average Composition of an AlFeNiTiVZr-Cr Alloy with Machine Learning and X-ray Spectroscopy"}, {"paperId": "065f100a931c7204d0c7309c7f33840d0bdcb026", "title": "Flood Susceptibility Mapping of the Famnat Watershed, Gilan Province"}]}
