{"paperId": "bc568398932e456817bacaa435614149d59da455", "publicationVenue": {"id": "4a707e29-5a29-4222-b3da-e51b9a3ac36e", "name": "Computers Materials & Continua", "alternate_names": ["Comput Mater  Contin"], "issn": "1546-2218", "url": "http://www.techscience.com/cmc/"}, "title": "Intrusion Detection System Using FKNN and Improved PSO", "abstract": ": Intrusion detection system (IDS) techniques are used in cybersecurity to protect and safeguard sensitive assets. The increasing network security risks can be mitigated by implementing effective IDS methods as a defense mechanism. The proposed research presents an IDS model based on the methodology of the adaptive fuzzy k-nearest neighbor (FKNN) algorithm. Using this method, two parameters, i.e., the neighborhood size (k) and fuzzy strength parameter (m) were characterized by implementing the particle swarm optimization (PSO). In addition to being used for FKNN parametric optimization, PSO is also used for selecting the conditional feature subsets for detection. To proficiently regulate the indigenous and comprehensive search skill of the PSO approach, two control parameters containing the time-varying inertia weight (TVIW) and time-varying acceleration coefficients (TVAC) were applied to the system. In addition, continuous and binary PSO algorithms were both executed on a multi-core platform. The proposed IDS model was compared with other state-of-the-art classifiers. The results of the proposed methodology are superior to the rest of the techniques in terms of the classification accuracy, precision, recall, and f-score. The results showed that the proposed methods gave the highest performance scores compared to the other conventional algorithms in detecting all the attack types in two datasets. More-over, the proposed method was able to obtain a large number of true positives and negatives, with minimal number of false positives and negatives.", "venue": "Computers Materials & Continua", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": null, "journal": {"name": "Computers, Materials & Continua"}, "authors": [{"authorId": "2213711", "name": "Raniyah Wazirali"}], "citations": [{"paperId": "da2887cd8450444c30b624dc9cc27b44bc790904", "title": "A survey on binary metaheuristic algorithms and their engineering applications"}, {"paperId": "bdfe66578b924a4a5f5c5c02ceb3725a612d0351", "title": "Bag of Features (BoF) Based Deep Learning Framework for Bleached Corals Detection"}, {"paperId": "249cd277f548e9a9a3d951f88a9813f093937e8b", "title": "Bulletin of Electrical Engineering and Informatics"}]}
