{"paperId": "bc6d519d134cb2cdc6dca5fa6e6bdb4f255c3e0e", "publicationVenue": null, "title": "HAR-GCNN: Deep Graph CNNs for Human Activity Recognition From Highly Unlabeled Mobile Sensor Data", "abstract": "The problem of human activity recognition from mobile sensor data applies to multiple domains, such as health monitoring, personal fitness, daily life logging, and senior care. A critical challenge for training human activity recognition models is data quality. Acquiring balanced datasets containing accurate activity labels requires humans to correctly annotate and potentially interfere with the subjects’ normal activities in real-time. Despite the likelihood of incorrect annotation or lack thereof, there is often an inherent chronology to human behavior. For example, we take a shower after we exercise. This implicit chronology can be used to learn unknown labels and classify future activities. In this work, we propose HAR-GCCN, a deep graph CNN model that leverages the correlation between chronologically adjacent sensor measurements to predict the correct labels for unclassified activities that have at least one activity label. We propose a new training strategy enforcing that the model predicts the missing activity labels by leveraging the known ones. HAR-GCCN shows superior performance relative to previously used baseline methods, improving classification accuracy by about 25% and up to 68% on different datasets.", "venue": "2022 IEEE International Conference on Pervasive Computing and Communications Workshops and other Affiliated Events (PerCom Workshops)", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-03-21", "journal": {"name": "2022 IEEE International Conference on Pervasive Computing and Communications Workshops and other Affiliated Events (PerCom Workshops)", "pages": "124-126"}, "authors": [{"authorId": "51210562", "name": "Abduallah A. Mohamed"}, {"authorId": "104608410", "name": "F. Lejarza"}, {"authorId": "2157861325", "name": "Stephanie Cahail"}, {"authorId": "1678595", "name": "C. Claudel"}, {"authorId": "39642711", "name": "Edison Thomaz"}], "citations": [{"paperId": "387cf1dd4eb72bc707372152b683b201741b42b1", "title": "Novel human activity recognition by graph engineered ensemble deep learning model"}, {"paperId": "bb90b2c6698b935dcc789faab546118be8717927", "title": "Robust human locomotion and localization activity recognition over multisensory"}, {"paperId": "5ff84a001fc37092f3b73381420563f259ebfa66", "title": "Detection and Validation of Macro-Activities in Human Inertial Signals Using Graph Link Prediction"}, {"paperId": "c8ac2bb2b996e7b7be2c36adaf5c53d80ee1504d", "title": "A Wearable Inertial Sensor Approach for Locomotion and Localization Recognition on Physical Activity"}, {"paperId": "5abac0e103251ab18dd10f881dbb719ed89ee45c", "title": "A multi-graph convolutional network based wearable human activity recognition method using multi-sensors"}, {"paperId": "6e8510cdfd9ecd8d75a8cc6b474b8be526134d26", "title": "Deep Learning in the Recognition of Activities of Daily Living Using Smartwatch Data"}, {"paperId": "9a34d75abdfc7910bb9560d7244fe0d7bf693b8b", "title": "Intelligent Localization and Deep Human Activity Recognition through IoT Devices"}, {"paperId": "02873215cb33f51de79692d04cb96c71a7efb20e", "title": "Human motion recognition based on passive RFID and multi-model fusion"}, {"paperId": "15f0ca10a1f968cf9ca9f963f8b6d21c04434f07", "title": "A Comprehensive Review of Automated Data Annotation Techniques in Human Activity Recognition"}, {"paperId": "025efb1c90436cecdb52fb8ebf86538c44536d6d", "title": "TinyGraphHAR: Enhancing Human Activity Recognition With Graph Neural Networks"}, {"paperId": "953d8a9b77da7d65fbc6465af691b72b0e567a38", "title": "Heterogeneous Hyper-Graph Neural Networks for Context-Aware Human Activity Recognition"}, {"paperId": "8268550cc90ec96a8c3643d22fa020465564cc5d", "title": "Simple Yet Surprisingly Effective Training Strategies for LSTMs in Sensor-Based Human Activity Recognition"}, {"paperId": "ac21a2caedb69b1949c67b9f77b388ebe2082893", "title": "MhaGNN: A Novel Framework for Wearable Sensor-Based Human Activity Recognition Combining Multi-Head Attention and Graph Neural Networks"}, {"paperId": "763f3cc0f7540c70a514227a6127242c4973b380", "title": "On Detecting COVID-Risky Behavior from Smartphones"}]}
