{"paperId": "bc728fe8477fdecfb4b9bebf4043ffb195a92a3a", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "An FPGA-based Accelerated Mutation Detection System for the Tumor Suppressor Gene", "abstract": "This paper proposes a novel fast mutation detection system that looks for mutations in the tumor suppressor gene, also known as TP53. Mutations are modifications in the nucleotide sequences of the human genome and may be caused by various factors, such as exposure to radiation, sunlight, smoking and replication errors. Mutations in TP53 are the most common cause of cancer and early detection may prevent cancer from happening. The proposed system utilizes the high matching speed of a logic-based content-addressable memory (CAM) for mutation detection along with a hamming distance calculator that specifies the exact location of the mutation. The proposed system implementation is carried on a Xilinx Virtex®-7 field-programmable gate array (FPGA) and demonstrates a low match time of 0.18 μs, which is much faster compared to the state-of-the-art systems.", "venue": "IEEE Access", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "1-1", "volume": "PP"}, "authors": [{"authorId": "2114816298", "name": "Muhammad Ibrahim"}, {"authorId": "51149298", "name": "O. Mujahid"}, {"authorId": "1486435269", "name": "N. Rehman"}, {"authorId": "31039646", "name": "Azhar Qazi"}, {"authorId": "48740398", "name": "Z. Ullah"}, {"authorId": "2872124", "name": "Tama Fouzder"}], "citations": [{"paperId": "dbda8fa088891551b2df5ae4ed60c10db08b267c", "title": "Using FPGA-based content-addressable memory for mnemonics instruction searching in assembler design"}]}
