{"paperId": "bc73bf7d1e08ebd600943dcee54688306b3d8cb2", "publicationVenue": {"id": "849b6687-df71-4d12-9c46-59f45d5ce951", "name": "IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing", "type": "journal", "alternate_names": ["IEEE J Sel Top Appl Earth Obs Remote Sens"], "issn": "1939-1404", "url": "https://ieeexplore.ieee.org/servlet/opac?punumber=4609443", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4609443"]}, "title": "Thaw Slump Susceptibility Mapping Based on Sample Optimization and Ensemble Learning Techniques in Qinghai-Tibet Railway Corridor", "abstract": "Thaw slump susceptibility mapping (TSSM) of Qinghai–Tibet railway corridor (QTRC) is the prerequisite and basis for disaster assessment and prevention of permafrost projects. The objective of this article is to construct ensemble learning models based on single classifier models to generate the TSSM of the QTRC, compare and verify the performance of the models, and further explore the relationship between the high susceptibility area and environmental factors of the QTRC. The collinearity analysis was carried out by selecting 14 thaw slump conditioning factors (TSCFs). We used the balance bagging method for sample optimization, and the dataset was divided into 70% training set and 30% verification set. Convolutional neural network, multilayer perceptron, support vector regression, random forest single classifiers were selected to construct blending and stacking ensemble learning models for the TSSM. The results showed that there was no collinearity among the 14 TSCFS. The comparison of model performance revealed that all models had good performance, but the constructed stacking and blending ensemble learning models had stable performance and high prediction accuracy for TSSM. The stacking ensemble learning model had the best effect, and the area under curve value of receiver operating characteristic curve reached 0.9607. It showed that the generated TSSM of QTRC based on stacking ensemble learning model had the highest reliability. The QTRC has local areas with high thaw slump susceptibility, mainly concentrated in the permafrost areas with high altitude, high slope, adjacent faults, sparse vegetation, ice and snow and the more cumulative precipitation.", "venue": "IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing", "pages": "5443-5459", "volume": "17"}, "authors": [{"authorId": "2145970171", "name": "Yi He"}, {"authorId": "2281103663", "name": "Tianbao Huo"}, {"authorId": "2210541287", "name": "Binghai Gao"}, {"authorId": "2287220793", "name": "Qing Zhu"}, {"authorId": "2287962868", "name": "Long Jin"}, {"authorId": "2287090841", "name": "Jian Chen"}, {"authorId": "2223304839", "name": "Qing Zhang"}, {"authorId": "2287915503", "name": "Jiapeng Tang"}], "citations": []}
