{"paperId": "bc77fa2e84a5b7099e7b3af1a07cca795784e804", "publicationVenue": {"id": "2dc4386c-f418-4a62-a2c3-6b89b06981be", "name": "Journal of Intelligent & Fuzzy Systems", "type": "journal", "alternate_names": ["Journal of Intelligent and Fuzzy Systems", "J Intell  Fuzzy Syst", "J Intell Fuzzy Syst"], "issn": "1064-1246", "url": "http://content.iospress.com/journals/journal-of-intelligent-and-fuzzy-systems/", "alternate_urls": ["http://www.iospress.nl/journal-of-intelligent-fuzzy-systems/", "https://www.iospress.nl/html/10641246.php"]}, "title": "An early warning method for abnormal behavior of college students based on multimodal fusion and improved decision tree", "abstract": "With the development of the Internet and the informatization construction of universities, the massive data accumulated by “campus big data” presents problems such as discreteness and sparseness. Students with abnormal behaviors have become an urgent problem to be solved in student behavior analysis. This paper proposes an early warning method for abnormal behaviour of college students based on multimodal fusion and an improved decision tree (EWMABCS-MFIDT). First, given the insufficient representation of student behavioral portraits and the problems of timeliness and dynamics in behavioral labels, a student behavioral portrait based on the multimodal fusion method is proposed. Second, aiming at the timeliness and backwardness of abnormal behavior prediction, based on student behavior classification prediction, this paper proposes an improved decision tree-based early warning method for abnormal student behavior. Finally, we design a student behavior analysis and early warning framework under the campus big data environment. Taking the abnormal early warning of students’ academic performance as an example, compared with other early warning algorithms, the EWMABCS-MFIDT method can improve the accuracy of early warning and make students’ educational work more targeted, personalized, and predictive.", "venue": "Journal of Intelligent & Fuzzy Systems", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-30", "journal": {"name": "J. Intell. Fuzzy Syst.", "pages": "8405-8427", "volume": "45"}, "authors": [{"authorId": "2115721431", "name": "Yubiao Wang"}, {"authorId": "2113342168", "name": "Junhao Wen"}, {"authorId": "2256662828", "name": "Wei Zhou"}, {"authorId": "153200036", "name": "Bamei Tao"}, {"authorId": "2237387557", "name": "Quanwang Wu"}, {"authorId": "2237581135", "name": "Chunlei Fu"}, {"authorId": "2193489917", "name": "Heng Li"}], "citations": []}
