{"paperId": "bc7e83528af7fd44b395cb54e856076dd405e48b", "publicationVenue": {"id": "79ca3e12-1e1d-4da8-9915-54a393e8c512", "name": "International Journal of Electrical and Computer Engineering (IJECE)", "type": "journal", "alternate_names": ["Int J Electr Comput Eng", "Int J Electr Comput Eng (IJECE", "International Journal of Electrical and Computer Engineering"], "issn": "2088-8708", "url": "http://iaesjournal.com/online/index.php/IJECE/issue/archive"}, "title": "k-dStHash tree for indexing big spatio-temporal datasets", "abstract": "Today’s era is witness of tremendous ever growing spatial, temporal and spatiotemporal data. The huge spatio-temporal data immensely pushes the need for design and development of novel methods tailored for indexing spatio-temporal data. In this research paper, we propose the design of a novel spatio-temporal data indexing method, named as k-dStHash. We have proposed the algorithm k-dStHashInsertion for inserting spatio-temporal objects and an algorithm k-dStHashSrchPlaceTime has been used to search for the objects at given location and time. It is able to handle datasets with duplicate keys which has been ignored in many research works. Though the algorithm k-dStHashInsertion takes 1.3-1.5 times longer time to insert data in k-dStHash data structure as it needs to find a specific location to organize data efficiently, but when it comes to search for required records it is even more than 90 times faster when analyzed in comparison to brute force method. It is generalized enough to organize any kind of k-dimensional data and time-based data also including object finding, fleet management, clustering, leader identification, nearest neighbor, human/animal tracking, path finding and many more.", "venue": "International Journal of Electrical and Computer Engineering (IJECE)", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-06-01", "journal": {"name": "International Journal of Electrical and Computer Engineering (IJECE)"}, "authors": [{"authorId": "2003362788", "name": "Meenakshi Hooda"}, {"authorId": "2295182740", "name": "Sumeet Gill"}], "citations": []}
