{"paperId": "bc963dcdf9994e46a8ce113be851bdffb4c66a4d", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Privacy-Preserving Federated Learning over Vertically and Horizontally Partitioned Data for Financial Anomaly Detection", "abstract": "The effective detection of evidence of financial anomalies requires collaboration among multiple entities who own a diverse set of data, such as a payment network system (PNS) and its partner banks. Trust among these financial institutions is limited by regulation and competition. Federated learning (FL) enables entities to collaboratively train a model when data is either vertically or horizontally partitioned across the entities. However, in real-world financial anomaly detection scenarios, the data is partitioned both vertically and horizontally and hence it is not possible to use existing FL approaches in a plug-and-play manner. Our novel solution, PV4FAD, combines fully homomorphic encryption (HE), secure multi-party computation (SMPC), differential privacy (DP), and randomization techniques to balance privacy and accuracy during training and to prevent inference threats at model deployment time. Our solution provides input privacy through HE and SMPC, and output privacy against inference time attacks through DP. Specifically, we show that, in the honest-but-curious threat model, banks do not learn any sensitive features about PNS transactions, and the PNS does not learn any information about the banks' dataset but only learns prediction labels. We also develop and analyze a DP mechanism to protect output privacy during inference. Our solution generates high-utility models by significantly reducing the per-bank noise level while satisfying distributed DP. To ensure high accuracy, our approach produces an ensemble model, in particular, a random forest. This enables us to take advantage of the well-known properties of ensembles to reduce variance and increase accuracy. Our solution won second prize in the first phase of the U.S. Privacy Enhancing Technologies (PETs) Prize Challenge.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-10-30", "journal": {"name": "ArXiv", "volume": "abs/2310.19304"}, "authors": [{"authorId": "1686542", "name": "S. Kadhe"}, {"authorId": "2263806009", "name": "Heiko Ludwig"}, {"authorId": "2478882", "name": "N. Baracaldo"}, {"authorId": "2263444622", "name": "Alan King"}, {"authorId": "2264562154", "name": "Yi Zhou"}, {"authorId": "2264047554", "name": "Keith Houck"}, {"authorId": "22261698", "name": "Ambrish Rawat"}, {"authorId": "2263866656", "name": "Mark Purcell"}, {"authorId": "2946928", "name": "N. Holohan"}, {"authorId": "2263863385", "name": "Mikio Takeuchi"}, {"authorId": "2060853632", "name": "Ryo Kawahara"}, {"authorId": "10815647", "name": "Nir Drucker"}, {"authorId": "2506227", "name": "Hayim Shaul"}, {"authorId": "2160537444", "name": "Eyal Kushnir"}, {"authorId": "2305402", "name": "Omri Soceanu"}], "citations": []}
