{"paperId": "bc9ef6ad0c80e64c04f8e915a30e83d21c98c482", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Privacy-Preserving Weighted Federated Learning Within the Secret Sharing Framework", "abstract": "This paper studies privacy-preserving weighted federated learning within the secret sharing framework, where individual private data is split into random shares which are distributed among a set of pre-defined computing servers. The contribution of this paper mainly comprises the following four-fold: •In the first fold, the relationship between federated learning (FL) and multi-party computation (MPC) as well as that of secure federated learning (SFL) and secure multi-party computation (SMPC) is investigated. We show that FL is a subset of MPC from the m-ary functionality point of view. Furthermore, if the underlying FL instance privately computes the defined m-ary functionality in the simulation-based framework, then the simulation-based FL solution is an instance of SMPC.•In the second fold, a new notion which we call weighted federated learning (wFL) is introduced and formalized. Then an oracle-aided SMPC for computing wFL is presented and analysed by decoupling the security of FL from that of MPC. Our decoupling formulation of wFL benefits FL developers selecting their best security practices from the state-of-the-art security tools.•In the third-fold, a concrete implementation of wFL leveraging the random splitting technique in the framework of the 3-party computation is presented and analysed. The security of our implementation is guaranteed by the security composition theorem within the secret share framework.•In the fourth-fold, a complement to MASCOT is introduced and formalized in the framework of SPDZ, where a novel solution to the Beaver triple generator is constructed from the standard El Gamal encryption. Our solution is formalized as a three-party computation and a generation of the Beaver triple requires roughly 5 invocations of the El Gamal encryptions. We are able to show that the proposed implementation is secure against honest-but-curious adversary assuming that the underlying El Gamal encryption is semantically secure.", "venue": "IEEE Access", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "198275-198284", "volume": "8"}, "authors": [{"authorId": "35242298", "name": "Huafei Zhu"}, {"authorId": "2023738101", "name": "Rick Siow Mong Goh"}, {"authorId": "2150369369", "name": "W. Ng"}], "citations": [{"paperId": "a73decebe28796cb4da93a2b93e949d436cea24a", "title": "How to Privately Tune Hyperparameters in Federated Learning? Insights from a Benchmark Study"}, {"paperId": "5c2058ae09e5d219bebadb49115c1479a0d6ca72", "title": "Secret sharing: A comprehensive survey, taxonomy and applications"}, {"paperId": "cf49053301ad903f13873906e6e7c6a050ae7783", "title": "Privacy preservation using optimized Federated Learning: A critical survey"}, {"paperId": "e84dc29b2c365bf8c643c3e3f697dd7f93bd6913", "title": "Model aggregation techniques in federated learning: A comprehensive survey"}, {"paperId": "4d1e880907ab20cad489c5b25166d80c12312fc2", "title": "Decentralized Reinforced Anonymous FLchain: a Secure Federated Learning Architecture for the Medical Industry"}, {"paperId": "b6231d264ed4765ca293b23c55ba80892e099323", "title": "Decentralized federated learning with privacy-preserving for recommendation systems"}, {"paperId": "436274f982423198aeb4df0d2d9c857afe48e12a", "title": "Robust privacy‐preserving federated learning framework for IoT devices"}, {"paperId": "2a299a5a6350686dee9d9969427e092c1983f6f3", "title": "SafeNet: The Unreasonable Effectiveness of Ensembles in Private Collaborative Learning"}, {"paperId": "8e00277d353b59e90190344c5c64a7e4b1ad8d2d", "title": "Privacy-Preserving Aggregation in Federated Learning: A Survey"}, {"paperId": "5988b775a41b2c550a826c11fcf2eb79c9eaa4d6", "title": "Cross-silo heterogeneous model federated multitask learning"}, {"paperId": "3573e6ff99d825329e0595712efc97e8425c74ba", "title": "Highly Scalable Beaver Triple Generator from Additive-only Homomorphic Encryption"}, {"paperId": "d349e54be0dcfa45856724e16694671ffde70a45", "title": "EFMVFL: An Efficient and Flexible Multi-party Vertical Federated Learning without a Third Party"}, {"paperId": "61259fe2cdb5e3e4a2a4d48314ef066130a23eba", "title": "Privacy-preserving blockchain-enabled federated learning for B5G-Driven edge computing"}, {"paperId": "5851559d0c3c0056b022f9178f140b438d11d577", "title": "Feature Engineering Framework based on Secure Multi-Party Computation in Federated Learning"}, {"paperId": "7ea8069cac5ef0edb2e8bb617e27ff4af0462b03", "title": "Secure Verifiable Aggregation for Blockchain-based Federated Averaging"}, {"paperId": "5a3576500db0543830657aaad4bfc17fb74cda2c", "title": "A Lightweight, Anonymous and Confidential Genomic Computing for Industrial Scale Deployment"}, {"paperId": "99f73bf6e4e8ac7d5c8be3fbf71000193e849b67", "title": "Towards Open and Expandable Cognitive AI Architectures for Large-Scale Multi-Agent Human-Robot Collaborative Learning"}, {"paperId": "b47975e8647de3a6cfe16d1ccae1e4d952f7d3e6", "title": "Visual Object Detection for Privacy-Preserving Federated Learning"}, {"paperId": "75e33b857fe2bf33acc2957c8d61309d4d89d716", "title": "Cybersecurity and Data Privacy in the Digital Age"}, {"paperId": "673ba001fb546bee88daf9e6994f93d5c6cbb109", "title": "CoFED: Cross-silo Heterogeneous Federated Multi-task Learning via Co-training"}, {"paperId": "18c478f3608b00185e5bbb0296f35edf5d130085", "title": "SafeNet: Mitigating Data Poisoning Attacks on Private Machine Learning"}, {"paperId": "64284b79ecd4daa6a346d411ce9e179e650de644", "title": "Privacy Protection in Prosumer Energy Management Based on Federated Learning"}]}
