{"paperId": "bca0bbd01ea917b7a9fe369288ea3ba03d3b1ff3", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "A Survey of Large Language Models in Medicine: Progress, Application, and Challenge", "abstract": "Large language models (LLMs), such as ChatGPT, have received substantial attention due to their capabilities for understanding and generating human language. While there has been a burgeoning trend in research focusing on the employment of LLMs in supporting different medical tasks (e.g., enhancing clinical diagnostics and providing medical education), a review of these efforts, particularly their development, practical applications, and outcomes in medicine, remains scarce. Therefore, this review aims to provide a detailed overview of the development and deployment of LLMs in medicine, including the challenges and opportunities they face. In terms of development, we provide a detailed introduction to the principles of existing medical LLMs, including their basic model structures, number of parameters, and sources and scales of data used for model development. It serves as a guide for practitioners in developing medical LLMs tailored to their specific needs. In terms of deployment, we offer a comparison of the performance of different LLMs across various medical tasks, and further compare them with state-of-the-art lightweight models, aiming to provide an understanding of the advantages and limitations of LLMs in medicine. Overall, in this review, we address the following questions: 1) What are the practices for developing medical LLMs 2) How to measure the medical task performance of LLMs in a medical setting? 3) How have medical LLMs been employed in real-world practice? 4) What challenges arise from the use of medical LLMs? and 5) How to more effectively develop and deploy medical LLMs? By answering these questions, this review aims to provide insights into the opportunities for LLMs in medicine and serve as a practical resource. We also maintain a regularly updated list of practical guides on medical LLMs at: https://github.com/AI-in-Health/MedLLMsPracticalGuide.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-11-09", "journal": {"name": "ArXiv", "volume": "abs/2311.05112"}, "authors": [{"authorId": "2265945051", "name": "Hongjian Zhou"}, {"authorId": "2265754434", "name": "Boyang Gu"}, {"authorId": "2265783554", "name": "Xinyu Zou"}, {"authorId": "2265924823", "name": "Yiru Li"}, {"authorId": "2265803524", "name": "Sam S. Chen"}, {"authorId": "1800462890", "name": "Peilin Zhou"}, {"authorId": "2218869839", "name": "Junling Liu"}, {"authorId": "2147311343", "name": "Y. Hua"}, {"authorId": "2265754569", "name": "Chengfeng Mao"}, {"authorId": "2269413539", "name": "Xian Wu"}, {"authorId": "2266043640", "name": "Zheng Li"}, {"authorId": "2218961178", "name": "Fenglin Liu"}], "citations": [{"paperId": "6c776ab9d309ca2541ad087d8af784819d13357b", "title": "Q-PEFT: Query-dependent Parameter Efficient Fine-tuning for Text Reranking with Large Language Models"}, {"paperId": "5168d3595acaf7528039ee542eb57d0dc3ad2fd8", "title": "How Easily do Irrelevant Inputs Skew the Responses of Large Language Models?"}, {"paperId": "5694a171cb93fe9b9932c236bcba1351c2d5af53", "title": "All You Need Is Context: Clinician Evaluations of various iterations of a Large Language Model-Based First Aid Decision Support Tool in Ghana"}, {"paperId": "f44c159e747599e5eadb82939a332a36103fd3bb", "title": "Aligning Large Language Models for Enhancing Psychiatric Interviews through Symptom Delineation and Summarization"}, {"paperId": "29bd27dce473f1a4735aa04f0f6682794d11d28c", "title": "Automatic Interactive Evaluation for Large Language Models with State Aware Patient Simulator"}, {"paperId": "ab8e6df5001dbb9b48445220099425aff536b3e8", "title": "Knowledge Conflicts for LLMs: A Survey"}, {"paperId": "589a3f34fcf839c279106c5b30a3b980c7b68bfc", "title": "Vision-Language Models for Medical Report Generation and Visual Question Answering: A Review"}, {"paperId": "bd15acc371153925bf86924cb2d13114ca6c95f8", "title": "AI Hospital: Interactive Evaluation and Collaboration of LLMs as Intern Doctors for Clinical Diagnosis"}, {"paperId": "3ac5871e38009553fd0f83138962a214899654c5", "title": "A Review of Deep Learning Methods for Photoplethysmography Data"}, {"paperId": "1b516059eee07c1f7dae4008d7109e0f6bff64bb", "title": "Large Language Models in Mental Health Care: a Scoping Review"}, {"paperId": "70a55b59314f79966e111d136a7b0f2bb272501a", "title": "Distilling Large Language Models for Matching Patients to Clinical Trials"}]}
