{"paperId": "bcba2958468aa021e0a30da27f187fcaa47e253d", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Neural Network Techniques for Detecting Intra-Domestic Water Leaks of Different Magnitude", "abstract": "Nowadays, water leak control at different levels is a necessary tool for sustainable water resource management. Research shows that more than one third of the world’s drinking water is lost during its transfer to users, and that leakages on users’ properties vary between 2 and 13% of total residential water demand, are very frequent and difficult to detect. Thanks to the advances in Internet of Things solutions for smart metering devices, it is possible to gather household water consumption information with high spatial and temporal resolution and to analyse them. This article applies several supervised Machine Learning (ML) techniques for the automatic detection of leakages of different magnitudes - even smaller than the meter sensitivity – in pipes within the dwelling, by using data collected by smart meters installed at the connection of users to the distribution network in an Italian town. The results obtained are compared with the performance of an “empirical algorithm” previously presented by the authors, able to automatically identify leakages by checking if the hourly flow rate is never zero during the whole day, but not able to distinguish the size of the leakages. Experimental results over about 40,500 records show that ML techniques significantly improve the detection performance both in discriminating between presence and absence of leakages and in discriminating different-size leakages.", "venue": "IEEE Access", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "126135-126147", "volume": "9"}, "authors": [{"authorId": "2637084", "name": "Riccardo Zese"}, {"authorId": "2372439", "name": "Elena Bellodi"}, {"authorId": "46831255", "name": "C. Luciani"}, {"authorId": "2099127", "name": "S. Alvisi"}], "citations": [{"paperId": "4416c59dc11546876f4949df8da4f79566b33462", "title": "Smart Buildings: Water Leakage Detection Using TinyML"}, {"paperId": "de237d343b9be8c7607f232dd5d68379e534132b", "title": "Arduino based Smart Water Management System for Water Loss Reduction"}, {"paperId": "0a8b28610949ce08f99910c9fc58f3f38cd3c4aa", "title": "Contribution of Internet of things in water supply chain management: A bibliometric and content analysis"}, {"paperId": "ac57746c5d3e96290bd83164318e85d1a13ee365", "title": "Adaptive Acoustic Leak Location of Long Buried Pipe via Transient Optimization Statistical Analysis"}, {"paperId": "402985854ba1621428b79a1a3224a05ecea333d9", "title": "Anomalous Water Use Detection Using Machine Learning"}]}
