{"paperId": "bccbd844008928afa496db07d6d6836dc0557287", "publicationVenue": null, "title": "Integration between technical indicators and artificial neural networks for the prediction of the exchange rate: Evidence from emerging economies", "abstract": "Abstract The study investigated the effectiveness of technical analysis indicators in trading spot exchange rates of emerging economies’ currencies under integration with artificial neural networks (ANN) and the quantitative testing of these indicators’ success in this matter with the goal of rationalizing decisions. The study period was from January 2012 to November 2022 for twenty-four currencies against the US dollar. Based on four technical indicators: the simple moving average (SMA), momentum, moving average convergence divergence (MACD), and relative strength index (RSI), with a total of 131 months. Of them, 51 months are for ANN construction (supervised learning), while 80 months are for hypothesis testing. The study used cross-sectional analysis and hierarchical multiple regression in addition to the Wilcoxon signed ranks test and Kruskal–Wallis test. The study found a significant improvement in the values predicted for exchange rates for emerging economies by artificial neural networks versus the values predicted by technical indicators alone. Finally, the study found a significant difference of gap between the values predicted for exchange rates for emerging economies by artificial neural networks and the actual values based on currency. It is possible to study the interpretation of this result according to the difference in each of the exchange rate regimes in emerging economies, in addition to the difference in structural imbalances between those economies.", "venue": "Cogent Economics &amp; Finance", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-15", "journal": {"name": "Cogent Economics & Finance", "volume": "11"}, "authors": [{"authorId": "98567928", "name": "Osama Wagdi"}, {"authorId": "2242610130", "name": "Eman Salman"}, {"authorId": "151408967", "name": "Hatem Albanna"}], "citations": [{"paperId": "89c5a23d08cfbd8f89a3c97c0e76f7661c1e405a", "title": "Forecasting Indian Goods and Services Tax revenue using TBATS, ETS, Neural Networks, and hybrid time series models"}, {"paperId": "70d82c10a31ce9e0999aeeea77ec9fcf5ecbbdd3", "title": "Petrodollar and De-dollarization: A Survey from OAPEC Countries"}]}
