{"paperId": "bce1b52e08d410bf360e594f740d7254235e6168", "publicationVenue": {"id": "04ccf60b-715a-4313-9666-97e48c7235ac", "name": "International Conference on Advances in Computational Tools for Engineering Applications", "type": "conference", "alternate_names": ["ACTEA", "Int Conf Adv Comput Tool Eng Appl"]}, "title": "Predictive Maintenance in the Industrial Sector: A CRISP-DM Approach for Developing Accurate Machine Failure Prediction Models", "abstract": "In production systems, avoiding repeated failures is crucial for reducing costs and preventing downtime. Industry 4.0 technologies have enabled companies to collect and analyze real-time data from machines, which helps in identifying and preventing potential problems. By using metrics like MTBF and MTTR and analyzing past failures, we can develop predictive models to prevent future failures. This paper explores the use of CRISP-DM methodology in the industrial sector to ensure the accurate prediction of machine failures. Specifically, we examine the application of this methodology in developing predictive models for cutting machines. The results demonstrate that CRISP-DM methodology is effective in developing models that can accurately predict potential failures and prevent them from occurring. The findings have implications for companies looking to implement predictive maintenance strategies in their production systems, highlighting the importance of using data-driven approaches to improve reliability and reduce downtime. Overall, our study highlights the importance of leveraging industry 4.0 technologies and CRISP-DM methodology for optimal performance of production systems in the industrial sector.", "venue": "International Conference on Advances in Computational Tools for Engineering Applications", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-07-05", "journal": {"name": "2023 Fifth International Conference on Advances in Computational Tools for Engineering Applications (ACTEA)", "pages": "223-227"}, "authors": [{"authorId": "2226518794", "name": "Salma Maataoui"}, {"authorId": "81646056", "name": "Ghita Bencheikh"}, {"authorId": "2894544", "name": "Ghizlane Bencheikh"}], "citations": []}
