{"paperId": "bcf49632f5c2eb359e95fb4caa3ea956337ac3fa", "publicationVenue": null, "title": "Improvement of non-negative matrix-factorization-based and Trust-based approach to collaborative filtering for recommender systems", "abstract": "Recommender systems are a subset of intelligent systems for information filtering systems that identify users' interests on the Internet. These systems provide appropriate and relevant suggestions related to the personal taste of the user by filtering the available information. Providing suggestions tailored to the needs and tastes of individuals and improving the efficiency of these systems increases users' trust in them. One of the most important challenges of recommender systems is the problem of data dispersion and cold start, that affects the performance of these systems. To confront these challenges, this paper uses a new method using trust information and combines it with negative matrix decomposition. In the proposed method, the use of collaborative filtering based on the negative analysis of the rank matrix enables us to compute a low rank approximation in order to manage large matrices. To solve the problem of cold start and data dispersion, the data of non-negative matrix decomposition algorithm and trust information has been used to improve the system of recommending to users. The results of experiments have been compared with state-of-the-art methods, which show the superiority of the proposed method in terms of accuracy and a computational complexity.", "venue": "2020 6th Iranian Conference on Signal Processing and Intelligent Systems (ICSPIS)", "year": 2020, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2020-12-23", "journal": {"name": "2020 6th Iranian Conference on Signal Processing and Intelligent Systems (ICSPIS)", "pages": "1-7"}, "authors": [{"authorId": "2051299929", "name": "Somayeh Moghaddam Zadeh Kashani"}, {"authorId": "2584839", "name": "J. Hamidzadeh"}], "citations": [{"paperId": "9355e2c5a0add5d71848db5e2b009f6586d360e6", "title": "Enhancing Context-Aware Recommendation Using Trust-Based Contextual Attentive Autoencoder"}, {"paperId": "cc92ab765a0e44fd45006a20e69fff624f37f0e0", "title": "MCRS-SAE: multi-criteria recommender system based on sparse autoencoder"}, {"paperId": "a6142ddfbb4ddebc720c51b68686cc8a788f32a0", "title": "GroupRec: Group Recommendation by Numerical Characteristics of Groups in Telegram"}, {"paperId": "59fb3071eb7432d5320c19bdafa615fe42dad271", "title": "A User-centric System for Improving Human-Computer Interaction through Fuzzy Logic-based Assistive Messages"}]}
