{"paperId": "bcf769660b4b5644e317eec62a6e12b106d2312e", "publicationVenue": {"id": "7a0ab88e-224a-475b-9ea6-e66a6b3448c8", "name": "Conference on Network and Service Management", "type": "conference", "alternate_names": ["Conf Netw Serv Manag", "CNSM"], "url": "http://www.cnsm-conf.org/"}, "title": "A Novel Cost-Aware Load Balancing Algorithm for Road Side Units in Internet of Vehicles", "abstract": "Vehicular ad-hoc networks formed in an Internet of Vehicles scenario can enable many useful applications and services. Many of these applications may generate a large amount of data, which needs to be processed within some deadline to be useful. Limited resources present in vehicles may not be sufficient for processing such data. The resources present in Road Side Units (RSUs) can be used for this purpose by running Virtual Machines (VMs) there on behalf of the vehicles. However, RSUs can also become overloaded in a dense vehicular scenario if all vehicles use the services of their nearby RSUs only. Also, use of RSUs may incur a cost. Hence the combined total resources of the RSUs need to be carefully managed to ensure that a large number of VMs complete within their deadline while incurring a lower cost. In this paper, we propose an algorithm called Cost Aware Load Balancing (CALB) algorithm that assigns and executes VMs in different RSUs in the total RSU pool. The proposed algorithm aims to maximize the number of VMs that complete execution within their deadline and also attempts to minimize the overall cost incurred by VMs for using RSUs’ resources. Performance of CALB is compared with several existing algorithms to show that it works better than the existing algorithms with respect to several performance metrics.", "venue": "Conference on Network and Service Management", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-10-31", "journal": {"name": "2022 18th International Conference on Network and Service Management (CNSM)", "pages": "359-363"}, "authors": [{"authorId": "2193210409", "name": "Shivank Thapa"}, {"authorId": "2056287903", "name": "S. Sahoo"}, {"authorId": "31085268", "name": "Moumita Patra"}, {"authorId": "2110046827", "name": "Arobinda Gupta"}], "citations": []}
