{"paperId": "bd059b74457f080edd802bb4d0802c642a3a79ca", "publicationVenue": null, "title": "Energy-Efficient Thermal-Aware Data Placement Strategy for Storage Clusters", "abstract": "The explosion of large-scale data has increased the scale and capacity of storage clusters for data centers, leading to colossal power consumption issues. In thermally managed storage clusters, the limited data placement approach has become a key factor affecting the overall power consumption of a data center. In this regard, we propose an energy-efficient thermal-aware data placement strategies called ETDP to reduce the overall power consumption of data centers. The principle of our proposed algorithm is to use a greedy algorithm to calculate the optimal disk sequence at the lowest overall power of a data center and then place the data in the optimal disk sequence. We implement this strategy in a cloud computing simulation platform based on CloudSim. Experimental results unveil that ETDP outperforms MinTin-G and MinTout-G in terms of the supplied temperature of CRAC, storage nodes power, cooling cost, and total power consumption. In particular, the ETDP algorithm can save about 10%-40% of the overall power consumption compared to MinTout-G and MinTin-G algorithms.", "venue": "2022 IEEE 24th Int Conf on High Performance Computing & Communications; 8th Int Conf on Data Science & Systems; 20th Int Conf on Smart City; 8th Int Conf on Dependability in Sensor, Cloud & Big Data Systems & Application (HPCC/DSS/SmartCity/DependSys)", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-12-01", "journal": {"name": "2022 IEEE 24th Int Conf on High Performance Computing & Communications; 8th Int Conf on Data Science & Systems; 20th Int Conf on Smart City; 8th Int Conf on Dependability in Sensor, Cloud & Big Data Systems & Application (HPCC/DSS/SmartCity/DependSys)", "pages": "1147-1152"}, "authors": [{"authorId": "1684133", "name": "J. Li"}, {"authorId": "35143368", "name": "Yuhui Deng"}, {"authorId": "2213326710", "name": "Zhifeng Fan"}, {"authorId": "2212647228", "name": "Zijie Zhong"}], "citations": []}
