{"paperId": "bd139c1b21a0c18e7d40c6d6c45eec09e3a84bee", "publicationVenue": {"id": "6175efe8-6f8e-4cbe-8cee-d154f4e78627", "name": "Mathematics", "issn": "2227-7390", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-283014", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-283014", "https://www.mdpi.com/journal/mathematics"]}, "title": "Deep Machine Learning Model-Based Cyber-Attacks Detection in Smart Power Systems", "abstract": "Modern intelligent energy grids enable energy supply and consumption to be efficiently managed while simultaneously avoiding a variety of security risks. System disturbances can be caused by both naturally occurring and human-made events. Operators should be aware of the different kinds and causes of disturbances in the energy systems to make informed decisions and respond accordingly. This study addresses this problem by proposing an attack detection model on the basis of deep learning for energy systems, which could be trained utilizing data and logs gathered through phasor measurement units (PMUs). Property or specification making is used to create features, and data are sent to various machine learning methods, of which random forest has been selected as the basic classifier of AdaBoost. Open-source simulated energy system data are used to test the model containing 37 energy system event case studies. In the end, the suggested model has been compared with other layouts according to various assessment metrics. The simulation outcomes showed that this model achieves a detection rate of 93.6% and an accuracy rate of 93.91%, which is greater compared to the existing methods.", "venue": "Mathematics", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-07-25", "journal": {"name": "Mathematics"}, "authors": [{"authorId": "150891348", "name": "Abdulaziz Almalaq"}, {"authorId": "2093539466", "name": "S. Albadran"}, {"authorId": "46564743", "name": "M. A. Mohamed"}], "citations": [{"paperId": "ca390fa8dfd2f9d3e53e059e117ce510bc40e77f", "title": "Correction: Almalaq et al. Deep Machine Learning Model-Based Cyber-Attacks Detection in Smart Power Systems. Mathematics 2022, 10, 2574"}, {"paperId": "e619714d55e3e8b6324c0098461f10d4cc067a42", "title": "Distributed cyber-physical intrusion detection using stacking learning for wide-area protection system"}, {"paperId": "2c95f158eceb09530ccbe83c8211aadcb63774b7", "title": "Machine Learning Solutions for Evolving Injection Attack Landscape"}, {"paperId": "c146bb2d9ee83d0eec2bb3f52765613128cde833", "title": "A Hybrid Approach for Alluring Ads Phishing Attack Detection Using Machine Learning"}, {"paperId": "75f562227079b27331a9f081bf7263ab2875ce3b", "title": "Hybrid Deep Learning Model for Cyber-Attack Detection"}, {"paperId": "84deb790c3365ecc84efcf0004cfbdd5be62f7f4", "title": "A Novel Model-Based Reinforcement Learning for Online Anomaly Detection in Smart Power Grid"}, {"paperId": "08c2437aeebf83061bf221d594d39ef8a46d8d47", "title": "Selection of Potential Regions for the Creation of Intelligent Transportation Systems Based on the Machine Learning Algorithm Random Forest"}, {"paperId": "308eb9398ac281fef793f7e719d36043b3c309e0", "title": "An evolutionary ensemble model based on GA for epidemic transmission prediction"}, {"paperId": "f3a155c2407253c626aa4fed404dc6c1325148a5", "title": "A Malware Attack Enabled an Online Energy Strategy for Dynamic Wireless EVs within Transportation Systems"}, {"paperId": "acefa604edd4573a132931ca77aa59cc929ce0a6", "title": "Preface to the Special Issue on Probability and Stochastic Processes with Applications to Communications, Systems and Networks"}, {"paperId": "f853fb04eda6e658436b7cdb7f5c6c2e61ceb4d6", "title": "Development of PMU-Based Transient Stability Detection Methods Using CNN-LSTM Considering Time Series Data Measurement"}, {"paperId": "e678b97ed7125163f58fed856119dfdbd485f4bb", "title": "Towards electric digital twin grid: Technology and framework review"}, {"paperId": "360723b6ef84847491b3ea7f8bcb68206a6c4c70", "title": "Switchgear Digitalization—Research Path, Status, and Future Work"}, {"paperId": "b7cc1f9238a674eaddd3e0da427c286dac628e37", "title": "An Effective Node-To-Edge Interdependent Network and Vulnerability Analysis for Digital Coupled Power Grids"}, {"paperId": "5db29c7c60a189071ba01cc9c5f76c54c70f6155", "title": "A Blockchain-Based Trust Model for Uploading Illegal Data Identification"}, {"paperId": "fb23abc01d4bb7c27ec5c6726dd0b8852773472c", "title": "A novel primary and backup relaying scheme considering internal and external faults in HVDC transmission lines"}, {"paperId": "37b10df2633b1c4685f76676e420c1f080a41687", "title": "Enhancing cybersecurity in smart grids: Deep black box adversarial attacks and quantum voting ensemble models for blockchain privacy-preserving storage"}, {"paperId": "426dc637f042562f20f2d14b8fa27e25a23aaa8e", "title": "Performance Analysis of Various Machine Learning based Algorithms on Cyber security Approaches"}]}
