{"paperId": "bd2055d944fa5c524b0fc8f881e19f19aab82edc", "publicationVenue": {"id": "e57466f0-6639-4b5d-9191-3ac5cc573fef", "name": "International Journal of Advanced Engineering Research and Science", "type": "journal", "alternate_names": ["Int J Adv Eng Res Sci"], "issn": "2456-1908", "alternate_issns": ["2349-6495"], "url": "https://ijaers.com/issues/"}, "title": "Comparison between Quantitative and Qualitative Theme-Feature Forest Biomass Estimation Models built over SAR Data", "abstract": "— International organizations are still in need for methodologies that accurately measures forests above ground biomass (AGB). Among the remote sensing technologies, those of Synthetic Aperture Radar (SAR) stands out in the modeling of forest biomass due to their ability to characterize the geometry of the imaged region. The semantic representation, through thematic maps, is one of the main means for the geospatial situational understanding. However, there is a gap of knowledge for models that are built by the analysis of quantitative and qualitative theme-feature in a complementary way. This article aims to develop and compare forest biomass estimation models, through an innovative methodology, over quantitative and qualitative theme-features. To this end, extracted SAR data and specific machine learning (ML) and feature selection techniques are applied for each case. The models developed are based into forest inventories with 128 plots located in two different Brazilian Amazon Forest areas and were built over 231 extracted independent variables. The methodology applied used techniques to categorize numeric data and, afterwards, comparatively evaluate numeric quantitative and categorized qualitative results. The constructions of the models were based on ML algorithms such as Multilayer Perceptron, Suport Vector Machine and Random Forest. The results showed that the different study areas had very different vegetation characteristics, significantly impacting the feature selection and ML algorithms. The different biomes of the Amazon Forest and their respective characteristics demanded specific models and techniques, not fitting into a single pattern.", "venue": "International Journal of Advanced Engineering Research and Science", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-07-31", "journal": {"name": "International Journal of Advanced Engineering Research and Science"}, "authors": [{"authorId": "1403725953", "name": "C. Castro-Filho"}, {"authorId": "103995449", "name": "E. Bias"}], "citations": [{"paperId": "513ff53b8c03f78d5967d4b2b203052eea2b49ec", "title": "Interpreting the Response of Forest Stock Volume with Dual Polarization SAR Images in Boreal Coniferous Planted Forest in the Non-Growing Season"}, {"paperId": "e94582d5cf8996371e516690e891795ffd22cdec", "title": "Categorization optimization in the construction of thematic products"}]}
