{"paperId": "bd4dea731f44aef957cf30d509a20249c154c64c", "publicationVenue": {"id": "95d0dda7-5d58-4afd-b59f-315447b81992", "name": "IEEE Communications Surveys and Tutorials", "type": "journal", "alternate_names": ["IEEE Commun Surv Tutor"], "issn": "1553-877X", "url": "http://www.comsoc.org/cst", "alternate_urls": ["http://www.comsoc.org/livepubs/surveys/index.html", "https://ieeexplore.ieee.org/servlet/opac?punumber=7041148", "http://ieeexplore.ieee.org/servlet/opac?punumber=9739"]}, "title": "How Machine Learning Changes the Nature of Cyberattacks on IoT Networks: A Survey", "abstract": "The Internet of Things (IoT) has continued gaining in popularity and importance in everyday life in recent years. However, this development does not only present advantages. Indeed, due to the number of sensitive and private data produced by IoT systems, they have become the new privileged targets for cyberattackers. At the same time, Machine Learning (ML) has gained a phenomenal success in various fields like telecommunications, transport or cybersecurity. Nonetheless, the application of ML can cause significant damage when put in the hands of an attacker. Contrary to many previous works, we do not focus on the potential contributions of ML in the IoT security systems. Indeed, this survey aims to provide a comprehensive overview of ML approaches to enable more effective and less detectable attacks. Thereby, the purpose of this article is to identify and discuss the advantages of the elaboration of ML attacks and the possible solutions already evoked in the literature. Firstly, we provide an identification of the main threats and potential attacks on IoT networks. Then, we investigate on cyberattacks integrating machine learning algorithms during the last few years and we provide future research directions, especially for jamming, side channel, false data injection and adversarial machine learning attacks.", "venue": "IEEE Communications Surveys and Tutorials", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Communications Surveys & Tutorials", "pages": "248-279", "volume": "24"}, "authors": [{"authorId": "1992915229", "name": "Emilie Bout"}, {"authorId": "1803713", "name": "V. Loscrí"}, {"authorId": "49958941", "name": "A. Gallais"}], "citations": [{"paperId": "472ff752d7576813f512bf4f2eb0495188b89ac0", "title": "Against Jamming Attack in Wireless Communication Networks: A Reinforcement Learning Approach"}, {"paperId": "1c7fa64f98bfae1e56ba884324153f7ac58115de", "title": "Threshold Switching Memristor-Based Radial-Based Spiking Neuron Circuit for Conversion-Based Spiking Neural Networks Adversarial Attack Improvement"}, {"paperId": "d6b5fd7a960cf90f151655e88ab3efffa76cfff8", "title": "Machine Learning Techniques for Cyberattack Prevention in IoT Systems: A Comparative Perspective of Cybersecurity and Cyberdefense in Colombia"}, {"paperId": "5abd9ff2b8951aee40fdbf9bccec3de1de73719b", "title": "Multi-aspect rule-based AI: Methods, taxonomy, challenges and directions towards automation, intelligence and transparent cybersecurity modeling for critical infrastructures"}, {"paperId": "e1ba19c3a819a79b5979cd57289011ba905bad70", "title": "Machine learning in cybersecurity: A review of threat detection and defense mechanisms"}, {"paperId": "f1d648aba867e40ebf2abdf3b540e16872cbc171", "title": "A Holistic Review of Machine Learning Adversarial Attacks in IoT Networks"}, {"paperId": "86a55b3a026beb41dd5da2ac77aefc9a6c17c1a4", "title": "Zero Trust Implementation in the Emerging Technologies Era: Survey"}, {"paperId": "cbd026346e9d38afdba206b63141731500cb7649", "title": "FS3: Few-Shot and Self-Supervised Framework for Efficient Intrusion Detection in Internet of Things Networks"}, {"paperId": "a351c22bb309e5ef7a5af9a51d25c5670a151b24", "title": "Industrial cyber-physical systems protection: A methodological review"}, {"paperId": "99e81348aae8e3a5f0b8b2c44fe698ba4fd1c5a9", "title": "A Deep Learning Algorithm for Music Information Retrieval Recommendation System"}, {"paperId": "78bf300edbd3b1f2a3162a94f29e20c20c951ea2", "title": "A Novel Intelligent Anti-Jamming Algorithm Based on Deep Reinforcement Learning Assisted by Meta-Learning for Wireless Communication Systems"}, {"paperId": "54ec2288561e2d080066b2aab68e28732fcd943f", "title": "Detecting Botnet Attacks in IoT Healthcare Systems through IoT Technology"}, {"paperId": "0c636f47368f9f69592ff4038eb8a6ec24e82ac8", "title": "Dynamic access control method for SDP-based network environments"}, {"paperId": "77cde812018fbbe801a7a7cde38fb3d4a057f835", "title": "A Modified Transformer Neural Network (MTNN) for Robust Intrusion Detection in IoT Networks"}, {"paperId": "47896552c47a992974a26b9433dc1754dde5765c", "title": "Offensive Artificial Intelligence: Current State of the Art and Future Directions"}, {"paperId": "cf5a7dd042674b15f8c47e6d9fc445b3540ff8ec", "title": "A deep learning approach for intrusion detection in Internet of Things using focal loss function"}, {"paperId": "0ea45579b648fdd427561e7d0c4e16ef0f7cb995", "title": "Anti-Jamming Communication Using Slotted Cross Q Learning"}, {"paperId": "ed26a748470e84999f16b136a1e0dc263d8e0d7c", "title": "An Analysis of Android Malware and IoT Attack Detection with Machine Learning"}, {"paperId": "9fa803bf4211a66c7e588b962be562725a524983", "title": "Securing Wireless Sensor Networks Using Machine Learning and Blockchain: A Review"}, {"paperId": "14fa3fe1b41a3fe96097aa3a0fb5b2e8e8aec7a3", "title": "Detection of Attacks in Smart Healthcare deploying Machine Learning Algorithms*"}, {"paperId": "799e6804a0cc090278949415f801963e15f12d69", "title": "Better Safe Than Never: A Survey on Adversarial Machine Learning Applications towards IoT Environment"}, {"paperId": "ba9b8a61257cfb8a8cd0799fd3dafe1d13192452", "title": "Deploying of Artificial Intelligence and Blockchain in Domain of Non-Fungible Token"}, {"paperId": "6e93020ef6dc433fe99d744ba6229bd3564a80e5", "title": "Ransomware Attack Detection in the Internet of Things using Machine Learning Approaches"}, {"paperId": "1cbcf58642ed06dcb06860ba9d66affd8270a210", "title": "LUFlow: Attack Detection in the Internet of Things Using Machine Learning Approaches"}, {"paperId": "57c905d3342d55f2e2e441adf55b247913727ab7", "title": "Pipelined Decision Trees for Online Traffic Classification on FPGAs"}, {"paperId": "927a136fddb57ad78aceea942926b1a6749ba525", "title": "Efficient intrusion detection toward IoT networks using cloud-edge collaboration"}, {"paperId": "b97fe5cf704936b5d5f10828451e25d104f63fe3", "title": "Challenges in the Design and Implementation of IoT Testbeds in Smart-Cities: A Systematic Review"}, {"paperId": "f22a8c43a494ffd438e8742f7c890f080b88b024", "title": "Evaluation and Analysis: Internet of Things using Machine Learning Algorithms for Detection of DDoS Attacks"}, {"paperId": "fc06e7e42a02a411aaa6cd47e03ef9a6ff21d079", "title": "Distributed Deep Neural-Network-Based Middleware for Cyber-Attacks Detection in Smart IoT Ecosystem: A Novel Framework and Performance Evaluation Approach"}, {"paperId": "73811b98ac44e6c8a76123279c590433bc9faae9", "title": "Artificial Intelligence Enabled Middleware for Distributed Cyberattacks Detection in IoT-based Smart Environments"}, {"paperId": "61dcc020c46f2d01888da4403a01d8647a2282a0", "title": "An Adaptable Module for Designing Jamming Attacks in WiFi Networks for ns-3"}, {"paperId": "8d0cf7cb6f5e99d99b053e0d510a390241570a35", "title": "HARPAGON: An Energy Management Framework for Attacks in IoT Networks"}, {"paperId": "1814944434626fa98d79e17b4732c2a5d5bb1151", "title": "The Role of Machine Learning in Cybersecurity"}, {"paperId": "a45578e7185f0ca35454f543846d39a63df6223f", "title": "Machine Learning for Zero- Touch Management in Heterogeneous Industrial Networks - A Review"}, {"paperId": "3cce23c3692d3625fe1ec7c08306bf4f65f6beab", "title": "A Survey on Machine Learning-Based Misbehavior Detection Systems for 5G and Beyond Vehicular Networks"}, {"paperId": "030193a3e09fe46b69c8b20a0413ceff1ca92120", "title": "Blockchain Systems, Technologies, and Applications: A Methodology Perspective"}, {"paperId": "0225914c43d5724c815f27e216b4e33f31f8df94", "title": "Multisource Heterogeneous Specific Emitter Identification Using Attention Mechanism-Based RFF Fusion Method"}, {"paperId": "40b0dcfcc08a54b3b08eff12cdf693b300d02cd1", "title": "A Survey on Threat Hunting in Enterprise Networks"}, {"paperId": "53424acb64e35f0c3b904f314a01a159e8a2ac9f", "title": "Nesnelerin İnterneti Cihazlarına Karşı Yapılan Makine Öğrenmesi Saldırıları"}, {"paperId": "877b2bb3d212e0dd33a60611a3b7c18cfe1b7ba5", "title": "Hardware-assisted Machine Learning in Resource-constrained IoT Environments for Security: Review and Future Prospective"}, {"paperId": "7c808d67ac4fdaf146edc9b8d6d3fb36b37eccd4", "title": "A Novel Architectural Framework on IoT Ecosystem, Security Aspects and Mechanisms: A Comprehensive Survey"}]}
