{"paperId": "bd57f4c0712ae08e9c69de7bac3d82f7e0a15f49", "publicationVenue": {"id": "45992d36-7a45-43cf-8b66-ff99604a5c85", "name": "Government Information Quarterly", "type": "journal", "alternate_names": ["Gov Inf Q"], "issn": "0740-624X", "url": "http://www.elsevier.com/wps/find/journaldescription.cws_home/620202/description#description", "alternate_urls": ["http://www.sciencedirect.com/science/journal/0740624X", "https://www.journals.elsevier.com/government-information-quarterly"]}, "title": "Rationality and politics of algorithms. Will the promise of big data survive the dynamics of public decision making?", "abstract": null, "venue": "Government Information Quarterly", "year": 2019, "fieldsOfStudy": ["Computer Science", "Business"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-01-01", "journal": {"name": "Gov. Inf. Q.", "pages": "27-38", "volume": "36"}, "authors": [{"authorId": "2678239", "name": "H. V. D. Voort"}, {"authorId": "74551311", "name": "A. J. Klievink"}, {"authorId": "145882791", "name": "M. Arnaboldi"}, {"authorId": "46679956", "name": "A. Meijer"}], "citations": [{"paperId": "417fddbd8e1c6389fa342da2f31c0f2d90200ff3", "title": "UNLOCKING THE POWER OF BIG DATA: DIGITAL TRANSFORMATION OF PUBLIC POLICY IN DPRD DKI JAKARTA"}, {"paperId": "5e175da59dbcd43438a638a38f4efb8dff8e7dcd", "title": "Security in Mobile Network: Issues, Challenges and Solutions"}, {"paperId": "da20d578bd08355e6c1b71d7151db25413704298", "title": "Requirements for Building a Business-Driven Reference Architecture for Implementation of Big Data Analytics by Public Sector Organizations: A Case Study of Uganda"}, {"paperId": "044ccdb5ac3792d93c7053bd27a13e4f4ac97aae", "title": "Exploring the Transformative Potential and the Challenges of Artificial Intelligence in Vauhini Vara’s The Immortal King Rao"}, {"paperId": "3cb553d1710034d5b662ed38438b5d6886924b08", "title": "AN EMPIRICAL ANALYSIS ON MAJORITY DECISION-MAKING CONDITIONS OF LEADERSHIP: A SPECIAL CONSIDERATION ON AMBIGUITY AND SHARED TASK REPRESENTATIONS"}, {"paperId": "8dedf99f9def88077196d0e70e9b083266b45e42", "title": "Big Data-Driven Public Policy Decisions: Transformation Toward Smart Governance"}, {"paperId": "2bb9ed37ecd9e1bcd1971cb71ff22fe952a6e636", "title": "Beyond federated data: a data commoning proposition for the EU’s citizen-centric digital strategy"}, {"paperId": "4267acb3f9964df297ef26e3ac4df014e55a06fd", "title": "Big data analytics and e-governance: Actors, opportunities, tensions, and applications"}, {"paperId": "20105296d1c7a5991f35f05c518b0138f55b8e72", "title": "To datafication and beyond: Digital transformation and accounting technologies in the healthcare sector"}, {"paperId": "bb541566950c8c31c30ce5dc10fc7bc5f95d8e3d", "title": "Introduction d’un outil numérique pour les évaluations de l’impact sur le développement durable au sein du gouvernement fédéral allemand : une perspective néo-institutionnelle"}, {"paperId": "1ee31744ca245b2850e1c26413b2cf4bf2ab96af", "title": "Sustainable Development of Business Economy Based on Big Data Algorithm under the Background of Low-Carbon Economy"}, {"paperId": "0e42a1abd05ba1d43d7f0a03f468573de837d613", "title": "Organisational culture and big data socio-technical systems on strategic decision making: Case of Saudi Arabian higher education"}, {"paperId": "1f746bf72f177d4b6dc44c7759ab4a78c6ebf5a4", "title": "Artificial intelligence algorithms applied in business and accounting"}, {"paperId": "612147d17f6635a07c944e207c60625a0a45becd", "title": "Public data primacy: the changing landscape of public service delivery as big data gets bigger"}, {"paperId": "9b73842eef5b10977f0786a75ae094b733437898", "title": "Artificial Intelligence and Public Human Resource Management: Questions for Research and Practice"}, {"paperId": "465c07725890bd7c911884e1fce644b619ee8eb4", "title": "Re-envisioning the Role of “Big Data” in the Nonprofit Sector: A Data Feminist Perspective"}, {"paperId": "41b4fd5b602e71c2961308cf6cecc5f5758ca7ab", "title": "Hypernudging in the changing European regulatory landscape for digital markets"}, {"paperId": "1106561b73010027815e8abdcc77a468e639f1b4", "title": "Using artificial intelligence to identify administrative errors in unemployment insurance"}, {"paperId": "2298eeb7e284c4d129c17384ea21e78f85fbf98d", "title": "The fate of accounting for public governance development"}, {"paperId": "6c182ac227cba953eee28231245ea8bde6fbd2c6", "title": "The Impact of Tax Reduction and Fee Reduction Based on Big Data Algorithm on the High-Quality Development of the Real Economy under the Action of Coupling Effect or Substitution Effect"}, {"paperId": "7d3d5c8121b19bc8188e7e6553d48fe42442b0c2", "title": "Hybrid Data Competencies for Municipal Civil Servants: An Empirical Analysis of the Required Competencies for Data-Driven Decision-Making"}, {"paperId": "5d559a2ff4b19dfb337ec9e09dac4f80510d0fc5", "title": "Ciencia de datos en la evaluación del impacto de las políticas públicas: Una revisión de la literatura"}, {"paperId": "276c43e73dd1b831eea3a94f64becacbda1c5668", "title": "More than a digital system: how AI is changing the role of bureaucrats in different organizational contexts"}, {"paperId": "5f36e2957c8167e8983ca993e2b8d96be3718ad2", "title": "Determinants of intention to adopt big data and outsourcing among SMEs: organisational and technological factors as moderators"}, {"paperId": "87fc091b51b6a0b7ca3c2787782bf4727b26a818", "title": "On humans, algorithms and data"}, {"paperId": "f5cb8ed94ef45d92051f21132786800b62e25af5", "title": "Promises and Pitfalls of Algorithm Use by State Authorities"}, {"paperId": "78551cae5a6f8d7a6ad42d5c197fe5411492b45f", "title": "Digitalization as a policy response to social acceleration: Comparing democratic problem solving in Denmark and the Netherlands"}, {"paperId": "b7e7277b80ed1049667c18d9cc33151d1fa9a01b", "title": "Technological frames, CIOs, and Artificial Intelligence in public administration: A socio-cognitive exploratory study in Spanish local governments"}, {"paperId": "ec7ff5fb64a0b77491238a71b47ee8c5745fa9d5", "title": "Big Data: The Engine to Future Cities—A Reflective Case Study in Urban Transport"}, {"paperId": "87ffeb54a7f4608f66a974e0ad74832c01d81b57", "title": "Co-designing algorithms for governance: Ensuring responsible and accountable algorithmic management of refugee camp supplies"}, {"paperId": "326433548ac9f9af4b25387e31795bf4667c83da", "title": "Pre-Crime Prediction: Does It Have Value? Is It Inherently Racist?"}, {"paperId": "d35fe9d4da87ae339b00d3f3c9d7374de67a455a", "title": "Citizen-centered data governance in the smart city: From ethics to accountability"}, {"paperId": "ef67e5c8e865d8c727920056bb4465685d4bff4e", "title": "Data science as knowledge creation a framework for synergies between data analysts and domain professionals"}, {"paperId": "c3fe11bc22219dd6566c439acd572359ff614ede", "title": "The credibility of finance committees and information usage: trustworthy to whom?"}, {"paperId": "4008ab900c73d349a419652af156cad724fb3fc0", "title": "The legitimacy gap of algorithmic decision-making in the public sector: Why it arises and how to address it"}, {"paperId": "9d69f2f918a87bc1e09fbe4ee34694d6cd0a7d5c", "title": "Introducing a digital tool for sustainability impact assessments within the German Federal Government: A neo-institutional perspective"}, {"paperId": "1202bb69f67a64445b9fe7185417b4733e3e3456", "title": "БОЛЬШИЕ ДАННЫЕ В ПРОЦЕССЕ ПРИНЯТИЯ ПОЛИТИЧЕСКИХ РЕШЕНИЙ: ОТ АНАЛИЗА ТЕОРИЙ К ОЦЕНКЕ ЭФФЕКТИВНОСТИ ПРАКТИК"}, {"paperId": "4bf997b84256a6febbe2bd571993d2ac7acc6a70", "title": "Mapping and contesting peer selection in digitalized public sector benchmarking"}, {"paperId": "d53d29a620383c28095f25c14dc4934a0b85665b", "title": "Digitalization, accounting and accountability: A literature review and reflections on future research in public services"}, {"paperId": "bf7ef30ec01f67988e6285f2543c2ecd9e0ed863", "title": "An evolution of performance data in higher education governance: a path towards a ‘big data’ era?"}, {"paperId": "5bca289253b735d9cfb9691803867aa153132399", "title": "Research themes in big data analytics for policymaking: Insights from a mixed‐methods systematic literature review"}, {"paperId": "d11217e882e54fc3dfe948fa102555f75d0c80bc", "title": "Hard Choices in Artificial Intelligence"}, {"paperId": "ffff337b1125f5242dca8cd4c88acc56c4dc1637", "title": "Policy formation, termination and the multiple streams framework: the case of introducing and abolishing automated university admission in France"}, {"paperId": "b5008025071a26745fc18e24d94c2ff268782595", "title": "Information Fusion Algorithm for Big Data in Digital Publishing Industry Chain"}, {"paperId": "0a3333b2d21d16896325f99c7146a9a80277ccbe", "title": "New Pythias of public administration: ambiguity and choice in AI systems as challenges for governance"}, {"paperId": "afe929b774c4c9bc9110bb2e0702d57fded7d7b0", "title": "A big data state of mind: Epistemological challenges to accountability and transparency in data-driven regulation"}, {"paperId": "c82604892e77c84b099829087c87289a7053170e", "title": "The Urgency of Policy Formulation: Dynamics of Covid-19 Handling and Big Data"}, {"paperId": "974a50c0d625344387b0b0561d1421798d970322", "title": "Uncertainty, risk and the use of algorithms in policy decisions: a case study on criminal justice in the USA"}, {"paperId": "92dae9f4db3778e1d9f02e5838535c4891877e51", "title": "Evaluating the evidence in algorithmic evidence-based decision-making: the case of US pretrial risk assessment tools"}, {"paperId": "72231efd545d8ca4fd100417181e1a81479e1023", "title": "A critical analysis of the study of gender and technology in government"}, {"paperId": "d2da0daaec833dc2ade35128bff40070edaaaa7d", "title": "Between technochauvinism and human-centrism: Can algorithms improve decision-making in democratic politics?"}, {"paperId": "942572b63d93b026178e00f23b0e3432185a9e57", "title": "Managing Algorithms for Public Value"}, {"paperId": "5c59fa20f9e87097ff43d8eb9dee1672d47c3ef6", "title": "Introduction to special issue algorithmic transparency in government: Towards a multi-level perspective"}, {"paperId": "f218bedba980aa25b6c24bc54355276a19dea194", "title": "The use of public sector data analytics in the Netherlands"}, {"paperId": "57cc632754fabaecec1b4188ef8db32b795bb5ec", "title": "Assessing the public policy-cycle framework in the age of artificial intelligence: From agenda-setting to policy evaluation"}, {"paperId": "c83d41810cc0087c6fe38a33a42d277b87d70d1a", "title": "Governments' strategic stance toward artificial intelligence: an interpretive display on Europe"}, {"paperId": "f6c0c29a07ba59c8442afae47157d07e88fbcd5c", "title": "Evaluating the impact of artificial intelligence technologies in public services: towards an assessment framework"}, {"paperId": "50084817f78b13c9c3610c510ac858f4b3bf0ffb", "title": "Opportunity for renewal or disruptive force? How artificial intelligence alters democratic politics"}, {"paperId": "d9847913762270b9ebcc0d81b50a1d690e55da95", "title": "Why Digital-Era Political Marketing is Not the Death Knell for Democracy: On the Importance of Placing Political Microtargeting in the Context of Party Competition"}, {"paperId": "19ee00ffce37dc6ba6e5f701e1054a007e0c07eb", "title": "From Big Data to Big Performance – Exploring the Potential of Big Data\n for Enhancing Public Organizations’ Performance. A Systematic Literature\n Review"}, {"paperId": "8d97a03a297594c2083f47eba09fd1bb49c771fa", "title": "Algorithms and values in justice and security"}, {"paperId": "7f5cd5b1340ac06ea38bd05373c30136a6f4c1ca", "title": "The value of Big Data in government: The case of ‘smart cities’"}, {"paperId": "2ba7b8407cdc698c190a22e3cd48de3127ba858d", "title": "Public value creation in digital government"}, {"paperId": "577ec15b51263db1db09dec3104720abca900155", "title": "Techno-optimism and policy-pessimism in the public sector big data debate"}, {"paperId": "2e75e6ef1fe105064e1a44a65bc707b63a9c0245", "title": "Prospectus and limitations of algorithmic governance: an ecological evaluation of algorithmic trends"}, {"paperId": "c55b0f75ecd0040d3fc0b626e8150572761adce9", "title": "The Long Road Toward Tracking the Trackers and De-biasing: A Consensus on Shaking the Black Box and Freeing From Bias"}, {"paperId": "3ea09e5d78672c9bcc3dcfc3f1257495579236ac", "title": "Integrating data, knowledge, and expertise for policy advice: understanding the practices of Dutch organized crime control professionals"}, {"paperId": "7bef81846c87272b21142d082ee602bade160d7a", "title": "Overview of the AnigeD Project and Potentials of Data Synthesis for Official Statistics and Research"}, {"paperId": "2a3154faa5b9da454f08fa6b0e8ff48704c90bba", "title": "Political Preferences and Role of Social Media Ahead of the 2024 General Elections in Central Kalimantan Province"}, {"paperId": "e16b547eea5f953326117f9652614fb08bde28aa", "title": "Overview of the AnigeD Project and Potentials of Dataset Synthetization for Official Statistics and Research"}, {"paperId": "f3e5d36bf2d0d3a8150ecb14f3e96c0d0afa27f2", "title": "Big Data Analytics and Performance Measurement in Public Sector Organization"}, {"paperId": "8e14d84c24c5a493b7052870362fae9786b08073", "title": "Electronic Government: 19th IFIP WG 8.5 International Conference, EGOV 2020, Linköping, Sweden, August 31 – September 2, 2020, Proceedings"}, {"paperId": "bf48011b11fab45f042d609921fa93dbce873889", "title": "Towards Data-Driven Policymaking for the Urban Heat Transition in The Netherlands: Barriers to the Collection and Use of Data"}, {"paperId": "98bd7b766d813afafc88ada34a63dd673d0ba3ce", "title": "ICT-Based Co-production: A Public Values Perspective"}, {"paperId": "4bb62981446e65fb1b133928e0495353c717958c", "title": "Algorithmic transparency and bureaucratic discretion: The case of SALER early warning system"}, {"paperId": "91398103e50488aaed1b7fd64fc5cd62b28141e0", "title": "Hybrid Data Competencies: Identifying required competencies for data-driven decisionmaking in local governments"}, {"paperId": "36ff3c88fc96fbfdf1cf27de93de3abbaa28e266", "title": "Legitimacy of Algorithmic Decision-Making: Six Threats and the Need for a Calibrated Institutional Response"}]}
