{"paperId": "bd71cfff1947fe75972695c0a110974ee48b5036", "publicationVenue": null, "title": "Adapted Convolutional Neural Networks and Long Short-Term Memory for Host Utilization prediction in Cloud Data Center", "abstract": "\n Infrastructure service model provides different kinds of virtual computing resources such as networking, storage service, and hardware as per user demands. Host load prediction is an important element in cloud computing for improvement in the resource allocation systems. Hosting initialization issues still exist in cloud computing due to this problem hardware resource allocation takes serval minutes of delay in the response process. To solve this issue prediction techniques are used for proper prediction in the cloud data center to dynamically scale the cloud in order for maintaining a high quality of services. Therefore in this paper, we propose a hybrid convolutional neural network long with short-term memory model for host prediction. In the proposed hybrid model, vector auto regression method is firstly used to input the data for analysis which filters the linear interdependencies among the multivariate data. Then the enduring data are computed and entered into the convolutional neural network layer that extracts complex features for each central processing unit and virtual machine usage components after that long short-term memory is used which is suitable for modeling temporal information of irregular trends in time series components. In all process, the main contribution is that we used scaled polynomial constant unit activation function which is most suitable for this kind of model. Due to the higher inconsistency in data center, accurate prediction is important in cloud systems. For this reason in this paper two real-world load traces were used to evaluate the performance. One is the load trace in the Google data center, while the other is in the traditional distributed system. The experiment results show that our proposed method achieves state-of-the-art performance with higher accuracy in both datasets as compared with ARIMA-LSTM, VAR-GRU, VAR-MLP, and CNN models.", "venue": "", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-07-09", "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "1500412906", "name": "Arif Ullah"}, {"authorId": "34744005", "name": "I. A. Abbasi"}, {"authorId": "90197827", "name": "M. Z. Rehman"}, {"authorId": "49164731", "name": "Tanweer Alam"}, {"authorId": "3388985", "name": "Hanane Aznaoui"}], "citations": []}
