{"paperId": "bd7129f1978db216b95247f526bcacbe8dc58c4e", "publicationVenue": {"id": "6401bb05-050b-4beb-8824-066cb2938eb4", "name": "Mathematical Problems in Engineering", "type": "journal", "alternate_names": ["Math Probl Eng"], "issn": "1024-123X", "url": "http://www.gbhap-us.com/journals/238/238-top.htm", "alternate_urls": ["https://www.hindawi.com/journals/mpe/"]}, "title": "Model-Driven Approach to Fading-Aware Wireless Network Planning Leveraging Multiobjective Optimization and Deep Learning", "abstract": "Efficient resource planning is recognized as one of the key enablers making the large-scale deployment of next-generation wireless networks available for mass usage. Modelling, planning, and software simulation tools reduce both the time needed and costs of their tuning and realization. In this paper, we propose a model-driven framework for proactive network planning relying on synergy of deep learning and multiobjective optimization. The predictions about service demand and energy consumption are taken into account. Also, the impact of degradations resulting from fading and cochannel interference (CCI) effects is also considered. The optimization task is treated as a component allocation problem (CAP) aiming to find the best possible base station allocation for the considered smart city locations with respect to performance and service demand constraints. The goal is to maximize Quality of Service (QoS) while keeping the costs and energy consumption as low as possible. The adoption of a model-driven approach in combination with model-to-model transformations and automated code generation does not only reduce the complexity, making experimentation more rapid and convenient at the same time, but also increase the overall reusability and expandability of the planning tool. According to the obtained results, the proposed solution seems to be promising not only due to achieved benefits but also regarding the execution time, which is shorter than that achieved in our previous works, especially for larger distances. Further, we adopt model-based representation of handover strategies within the planning tool, enabling examination of the dynamic behavior of user-created plan, which is not exploited in other similar works. The main contributions of the paper are (1) wireless network planning (WNP) metamodel, a modelling notation for network plans; (2) model-to-model transformation for conversion of WNP to generalized CAP metamodel; (3) prediction problem (PP) metamodel, high-level abstraction for representation of prediction-related regression and classification problems; (4) code generator that creates PyTorch neural network from PP representation; (5) service demand and energy consumption prediction modules performing regression; (6) multiobjective optimization model for base station allocation; (7) Handover Strategy (HS) metamodel used for description of dynamic aspects and adaptability relevant to network planning.", "venue": "Mathematical Problems in Engineering", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-04-08", "journal": {"name": "Mathematical Problems in Engineering"}, "authors": [{"authorId": "143854671", "name": "D. Krstić"}, {"authorId": "48257932", "name": "N. Petrovic"}, {"authorId": "1403899973", "name": "Issam Al-Azzoni"}], "citations": [{"paperId": "40f770be8ed01e13400e915aceaac0f79e4d929f", "title": "Leveraging Outage probability in system limited by BX fading and Co-channel interference for ChatGPT-enabled QoS adaptation"}, {"paperId": "bb63c591be4b91f70d3d4c316b62739b12fd6266", "title": "AI-Driven Approach for QoS Estimation Using LCR in 5G Network with Selection Combining in α-η-µ Fading and Co-Channel Interference Environment"}, {"paperId": "6a7c2d5622b8025cd2c0b26411e61e12a26b0cc2", "title": "ChatGPT-Aided QoS Estimation Le eraging Outage Probability of Mobile Networks Limited by α-η-µ Fading and α-η-µ Co-channel Interference"}, {"paperId": "e2a3a844866d62343756dd61b27c0ea06d3e4d5d", "title": "AI-Enabled Framework for Mobile Network Experimentation Leveraging ChatGPT: Case Study of Channel Capacity Calculation for η-µ Fading and Co-Channel Interference"}, {"paperId": "9cbd7f6df9386a9a13dcfbdcae656f9491551d13", "title": "Utilizing LCR of Wireless System with SC Receiver Weakened by Beaulieu-Xie Fading and κ-¼ Interference for Machine Learning-Based QoS Prediction"}, {"paperId": "bf94a7d90ecaa09366d6c1bb73b3891a0c272425", "title": "Approach to QoS Prediction Leveraging Impact of Beaulieu-Xie Fading and κ-µ Co-Channel Interference on SC Diversity Receiver Outage Probability"}, {"paperId": "551c094f4af95507e5b07206ef6c90ef4e8f98ee", "title": "Combining Receiver Damaged by Beaulieu-Xie Fading and Rician Co-Channel Interference with a Purpose of Machine Learning QoS Level Prediction"}, {"paperId": "bdeffec77ab4299c2eac0fa11e7fd9f1b2a1013e", "title": "Machine Learning Approach to QoS Adjustment Leveraging LCR in Mobile Networks Limited by Beaulieu-Xie Fading and Co-Channel Interference"}, {"paperId": "46cb2ebb14ae37d423c1d0b3341ee882ed7aec9d", "title": "Leveraging Outage Probability in Systems Limited by BX Fading and Nakagami-m Co-channel Interference for Classification-Based QoS Estimation"}, {"paperId": "8ac1686212ed5efd5692470e4399b9b86d7b55ea", "title": "Leveraging Channel Capacity of a Macro Diversity MIMO System in Gamma-Shadowed Nakagami-m Fading Channel for QoS estimation using Quantum Machine Learning"}, {"paperId": "2f947a0cd620685519e25dbc8ca230f59f95e40a", "title": "ABEP of a NFV-based 5G network with L-branch SC diversity under combined effects of η-µ fading and η-µ CCI"}, {"paperId": "bc3f8ad102efa0afc3a74a209a69acac29efa718", "title": "Quantum Machine Learning-Assisted Channel Capacity Analysis of L —branch SC Diversity Receiver in α — µ Fading and CCI Environment"}, {"paperId": "f5da527e5a5cd0129418eff4db530798ae2957b8", "title": "Determining the ABEP under the Influence of K -µ Fading and CCI with SC combining at L-branch Receiver Using Moment Generating Function"}, {"paperId": "9512af8990a66e628c0403153920db1b58b38395", "title": "Influence of Rayleigh Fading and Nakagami-m Cochannel Interference on Multi-branch SC Receiver Capacity Performance"}, {"paperId": "f26a889ddd422f59c356c3aedf308ac9aa135031", "title": "MGF Based Calculation and Simulation of ABEP for Multi-branch SC Receiver in an Environment under α-K-μ Fading and Co-channel Interference"}, {"paperId": "e36bcda1fe20b999e388e159391af9454309bba3", "title": "Base Station Anomaly Prediction Leveraging Model-Driven Framework for Classification in Neo4j"}, {"paperId": null, "title": "Using Level Crossing Rate of Selection Combining Receiver Damaged by Beaulieu-Xie Fading and Rician Co-Channel Interference with a Purpose of Machine Learning QoS"}, {"paperId": "4700e3b7e74f59a7de607f253c41d3506c23c53e", "title": "Performance simulation for LCR of MIMO Multi-branch SC Diversity System in α-µ fading and α-µ interference channel"}, {"paperId": "4cf8546f87bc835588cbac9dafd366faab672e09", "title": "Model-Driven Approach to Blockchain-Enabled MLOps"}]}
