{"paperId": "bd875588de47ea5ce0af947e2e4a06a2ab6e4522", "publicationVenue": {"id": "7fbf5fc7-3fd7-4c0a-bebd-fd82ef6ec9f3", "name": "Industrial Cyber-Physical Systems", "type": "conference", "alternate_names": ["International Conference on Pervasive Services", "IEEE Int Conf Power Syst", "IEEE International Conference on Power Systems", "Int Conf Pervasive Serv", "Ind Cyber-physical Syst", "ICPS"], "url": "http://www.wikicfp.com/cfp/program?id=1450"}, "title": "Investigating the Applicability of In-Network Computing to Industrial Scenarios", "abstract": "Moving computation functionality into the network and onto networking devices has recently shown great promise for performance improvements, e.g., by reducing path lengths and processing latencies, or by increasing bandwidth efficiency. Yet, In-Network Computing (INC) is challenged by the limitations of networking hardware which is generally not designed for complex calculations. Thus, while possible, developing INC approaches is a constant struggle between desired and available functionality. In this paper, we demonstrate the applicability of INC to industrial contexts by offloading a seemingly simple task from an industrial assembly scenario - coordinate transformations - to programmable switches and SmartNICs. We find that even such a task puts heavy demands on the devices, but that the right dose of approximation and diligent problem reformulation can enable the necessary operations on all platforms, thus setting the stage for improving latencies by significantly reducing communication paths. Yet, our results further indicate that these gains in latency come in hand with a trade-off regarding the achievable accuracy.", "venue": "Industrial Cyber-Physical Systems", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-05-10", "journal": {"name": "2021 4th IEEE International Conference on Industrial Cyber-Physical Systems (ICPS)", "pages": "334-340"}, "authors": [{"authorId": "20543442", "name": "Ike Kunze"}, {"authorId": "1839155", "name": "René Glebke"}, {"authorId": "2098640020", "name": "Jan Scheiper"}, {"authorId": "1991239289", "name": "M. Bodenbenner"}, {"authorId": "46253301", "name": "R. Schmitt"}, {"authorId": "1719689", "name": "Klaus Wehrle"}], "citations": [{"paperId": "36f9e2e2987d82f2b02020dd652d21d1523089f1", "title": "A survey on integrated computing, caching, and communication in the cloud-to-edge continuum"}, {"paperId": "5f990566cf8a923054113e960495c0fcb8a85589", "title": "Offloading Robotic and UAV Applications to the Network Using Programmable Data Planes"}, {"paperId": "0b8c9c6c74bca6d8c5a424798880553cc71bee05", "title": "Industrial Knee-jerk: In-Network Simultaneous Planning and Control on a TSN Switch"}, {"paperId": "95448a0a598b5ac31f518dacea27d9c02da51373", "title": "An Intelligent User Plane to Support In-Network Computing in 6G Networks"}, {"paperId": "2fedef0bd648b0ad0a5067a04b5b5f000bf59173", "title": "Evolving the Digital Industrial Infrastructure for Production: Steps Taken and the Road Ahead"}, {"paperId": "a25d20669c62ca8be6c4bff0c74b19869ade5b48", "title": "Accelerating Industrial IoT Acoustic Data Separation With In-Network Computing"}, {"paperId": "d8a3e76c6055a908c3ff8a0aea99f0a7211343ed", "title": "Deploying Hierarchical Mesh Networks for Supporting Distributed Computing in Industrial Internet of Things"}, {"paperId": "69cb3bf5e9b5136dc6723be2aa80859b1830e454", "title": "Towards an in-network GPU-accelerated packet processing framework"}, {"paperId": "ed4150bd2081b954a2c8d61951a29160f1936aae", "title": "A Computer Science Perspective on Digital Transformation in Production"}, {"paperId": "e7835d0f2f1fca993a7a21ef32ce993b465de6b6", "title": "Collaboration is not Evil: A Systematic Look at Security Research for Industrial Use"}, {"paperId": "734ec4a3d454f63dc19df5666034a7b2d349b6d1", "title": "Don't You Worry 'Bout a Packet: Unified Programming for In-Network Computing"}, {"paperId": "15b7377494cb0bfa5de8a763a618ccf35b3fc802", "title": "Programmable Data Planes as the Next Frontier for Networked Robotics Security: A ROS Use Case"}, {"paperId": "f48dea788ea389c873de1c7d90f04c7fb15acac8", "title": "The Road to Accountable and Dependable Manufacturing"}, {"paperId": "10c70f3b25fe332de58f278aae0c78e580384399", "title": "Detecting Out-Of-Control Sensor Signals in Sheet Metal Forming using In-Network Computing"}, {"paperId": "c1553e864ec182d96c3d1c2fe7a99f4a7c589039", "title": "Modular Control and Services to Operate Lineless Mobile Assembly Systems"}, {"paperId": "4c0a57a346da4904bbd9e739f82564e4f3fa05c3", "title": "Model-Based Controlling Approaches for Manufacturing Processes"}]}
