{"paperId": "bd8cc40f51b42dea2b48d6719ae4da34039597ec", "publicationVenue": {"id": "8affea11-6a75-4512-b5fc-84533f6c0650", "name": "Journées Bases de Données Avancées", "type": "conference", "alternate_names": ["Journées Base Données Av", "International Conference on Big Data Analytics", "BDA", "Int Conf Big Data Anal"], "url": "http://bdav.org/"}, "title": "Fusion of Multiple Arabic Social Media Streams for Traffic Events Detection", "abstract": "In recent years, several researcher have addressed the issue of detecting social events from social media streams. Such applications provide important benefits to smart cities . However, very few researchers worked on detecting traffic events. These works are either using single social media source or mainly for English data. In this paper, we propose a traffic event detection technique that fuses multiple Arabic social media sources. The fused Arabic social media posts are cleaned and then the traffic posts are identified. To extract locations from the cleaned traffic posts, a location recognizer is built into the proposed technique. In addition to identifying the official location names, we conceptualize a new type of locations, called user-defined locations. To extract the cause of a traffic event, the post is classified into one of the subclasses that represent different causes such as accidents, roadblocks, etc. A developed visualization tool shows the traffic events on a spatio-temporal dynamic map. We validated the results of detecting traffic events and their causes using real traffic data.", "venue": "Journées Bases de Données Avancées", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-03-04", "journal": {"name": "2022 7th International Conference on Big Data Analytics (ICBDA)", "pages": "231-235"}, "authors": [{"authorId": "46226751", "name": "Balsam Alkouz"}, {"authorId": "30091339", "name": "Z. Al Aghbari"}], "citations": []}
