{"paperId": "bd8dea812ddb1435c04433d668d9ee582d2fd117", "publicationVenue": null, "title": "TiGrid: A raster‐based method for time‐interval information representation with geotagged videos as an example", "abstract": "Spatiotemporal representation is one of the critical areas receiving ongoing interest in GIScience. The ever‐growing spatiotemporal big data, however, pose considerable challenges to temporal representation as existing methods predominantly use one‐dimensional chronological timeline representations. Aiming to represent the lifespans of spatiotemporal objects, a temporal interval grid (TiGrid) is proposed based on a raster structure in two‐dimensional space. The TiGrid is the lower‐triangular part of a square matrix of order N, in which the column and row represent the start time and end time, respectively. Using the graphical transformation method, the lower‐triangular matrix of the TiGrid is transformed to a rectangle matrix. The cells in a TiGrid can be converted into absolute world time using metadata such as the time resolution and start time. The TiGrid generating algorithm, the temporal topological relations, and the unary or binary operations in a TiGrid are defined. Furthermore, spatiotemporal constraint and snapshot retrieval methods are introduced based on the spatial semantics in the TiGrid. A prototype performed evaluation with the case of geotagged video retrieval. The experimental results show that a TiGrid with spatial indexing can efficiently retrieve mass objects with time‐interval information. The TiGrid has the potential to be a new way for spatiotemporal modeling and geovisualization.", "venue": "Trans. GIS", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-10-12", "journal": {"name": "Transactions in GIS", "pages": "362 - 384", "volume": "26"}, "authors": [{"authorId": "1708590", "name": "Zhigang Han"}, {"authorId": "40199339", "name": "Yunfeng Kong"}, {"authorId": "1891081", "name": "Caihui Cui"}, {"authorId": "2110272645", "name": "Jiayao Wang"}, {"authorId": "2146274948", "name": "Qian Li"}, {"authorId": "2143733903", "name": "Xiang Chen"}], "citations": []}
