{"paperId": "bd989e7f50590851854d07e96a8dcc52e48917f6", "publicationVenue": {"id": "0aed7a40-85f3-4c66-9e1b-c1556c57001b", "name": "PLoS ONE", "type": "journal", "alternate_names": ["Plo ONE", "PLOS ONE", "PLO ONE"], "issn": "1932-6203", "url": "https://journals.plos.org/plosone/", "alternate_urls": ["http://www.plosone.org/"]}, "title": "When resolution does matter: Modelling indirect contacts in dairy farms at different levels of detail", "abstract": "Animal exchanges are considered the major pathway for between-farm transmission of many livestock infectious diseases. Yet, vehicles and operators visiting several farms during routine activities can also contribute to disease spread. Indeed, if contaminated, they can act as mechanical vectors of fomites, generating indirect contacts between visited farms. While data on animal exchanges is often available in national databases, information about the daily itineraries of trucks and operators is rare because difficult to obtain. Thus, some unavoidable approximations have been frequently introduced in the description of indirect contacts in epidemic models. Here, we showed that the level of detail in such description can significantly affect the predictions on disease dynamics. Our analyses focused on the potential spread of a disease in a dairy farm system subject of a comprehensive data collection campaign on calf transportations. We developed two temporal multilayer networks to model between-farm contacts generated by either animal exchanges (direct contacts) and connections operated by trucks moving calves (indirect contacts). The complete model used the full knowledge of the daily trucks’ itineraries, while the partial informed one used only a subset of such available information. To account for various conditions of pathogen survival ability and effectiveness of cleaning operations, we performed a sensitivity analysis on trucks’ contamination period. An accurate description of indirect contacts was crucial both to correctly predict the final size of epidemics and to identify the seed farms responsible for generating the most severe outbreaks. The importance of detailed information emerged even more clearly in the case of short contamination periods. Our conclusions could be extended to between-farm contacts generated by other vehicles and operators. Overcoming these information gaps would be decisive for a deeper understanding of epidemic spread in livestock and to develop effective control plans.", "venue": "PLoS ONE", "year": 2019, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-10-17", "journal": {"name": "PLoS ONE", "volume": "14"}, "authors": [{"authorId": "150007202", "name": "Alba Bernini"}, {"authorId": "3278213", "name": "L. Bolzoni"}, {"authorId": "2703762", "name": "R. Casagrandi"}], "citations": [{"paperId": "2d4e92ef0f710b85dcdbf10e4fb9684f6efcac12", "title": "Global benefits and domestic costs of a cooperative surveillance strategy to control transboundary crop pathogens"}, {"paperId": "49433e4e94b98e8a1d63b4b0289402360d45da93", "title": "The role of vehicle movement in swine disease dissemination: Novel method accounting for pathogen stability and vehicle cleaning effectiveness uncertainties."}, {"paperId": "33d69cb1a3283c39f8b8413d7892ac3d6783826c", "title": "Multilayer network analysis of FMD transmission and containment among beef cattle farms"}, {"paperId": "e07af9025f0d4e91a9ff79cd0bed8b372948ebd0", "title": "Modelling and assessing additional transmission routes for porcine reproductive and respiratory syndrome virus: Vehicle movements and feed ingredients"}, {"paperId": "52bf47d884e9aa82027efe1bee9fe1d2a0b03913", "title": "Unravelling direct and indirect contact patterns between duck farms in France and their association with the 2016-2017 epidemic of Highly Pathogenic Avian Influenza (H5N8)."}, {"paperId": "d18a77f5cbc43212357eecc3011b6f74715d4e4f", "title": "Modelling porcine reproductive and respiratory syndrome virus dynamics to quantify the contribution of multiple modes of transmission: between-farm animal and vehicle movements, farm-to-farm proximity, feed ingredients, and re-break"}, {"paperId": "7bc0a1619d8d51906a0a18876e69cb0fe3ce27af", "title": "Development of a Computerized Automated System for Feed, Water and Sanitation Management in Animal Farms"}, {"paperId": "dc352300ad94153e2a843e808e1014d096882de2", "title": "Impact of truck contamination and information sharing on foot-and-mouth disease spreading in beef cattle production systems"}, {"paperId": "faa5e984eecaac4890ea710529a498ce2d328d9b", "title": "Illustration of Different Disease Transmission Routes in a Pig Trade Network by Monopartite and Bipartite Representation"}, {"paperId": "23e3fbd0410f7b6540811281e5285d5d8bd60e6c", "title": "Towards resilient beef cattle production systems: Impact of truck contamination and information sharing on foot-and-mouth disease spreading"}, {"paperId": "69265ed55be8b3102137d8c49d1a7ff1daf364d0", "title": "Multilayer network analysis unravels haulage vehicles as a hidden threat to the British swine industry."}, {"paperId": "ec4e9fcb900ed585265e213b7ff6467b7a233000", "title": "Role of vehicle movement in swine disease dissemination"}]}
