{"paperId": "bd9d21b37b4df9883928a455c06dae0628c37985", "publicationVenue": null, "title": "Artificial Intelligence in Dementia Diagnosis: Past, Present, and Future", "abstract": "Dear Editor, Dementia can be regarded as one of the biggest medical and health challenges in the last century. Paying attention to recent studies confirms this point. The age-standardized point prevalence of dementia was equal to 777.6 per 100 000 people in the Middle East region and North Africa in 2019, indicating a 3% growth compared to 1990. The point prevalence of the disease has grown during the last three decades,1 while the number of individuals affected by it is expected to reach 152 million worldwide by 2050.2 Dementia can be considered neurodegenerative changes in the brain accompanied by symptoms such as impairments in the process of memory, thought, language, functioning, and problem-solving ability.3 It can also disrupt patients’ daily functioning and lower their quality of life. Dementia contains several risk factors such as hypertension, obesity, diabetes, lack of physical activity, and alcohol consumption. It should be noted that in addition to the above factors, this category of disorder becomes more prevalent with age.2,4 Artificial intelligence and its algorithms, particularly machine learning (ML) have transformed medical service provision. Numerous studies have been conducted on using artificial intelligence in the fields of neuroimaging and its interpretation,5 cognitive assessment tests,6 movement tests,7 and speech and language tests8 to diagnose dementia disorders quickly and timely. Many diagnostic tests and modalities for this disease require the presence of trained and specialized staff and also spending a substantial amount of money and time for interpretation. Artificial intelligence can facilitate disease diagnosis, make healthcare service provision more effective with high quality, and make the use of limited financial resources more practical.9 Artificial intelligence can contribute to a wide range of diagnostic tests, which are shortly mentioned in the following.", "venue": "International Journal of Aging", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-07-05", "journal": {"name": "International Journal of Aging"}, "authors": [{"authorId": "48870253", "name": "M. Zarei"}, {"authorId": "2192014232", "name": "Milad Asheghi"}, {"authorId": "4183180", "name": "M. Zarei"}], "citations": [{"paperId": "f25e6554f002fb8b83cc348247d9e7fde8bc091f", "title": "The Advent of Artificial Intelligence in Anesthesiology and Pain Management: A Review Article"}]}
