{"paperId": "bda4ba8531648858b322d183c37d7e1d234e421e", "publicationVenue": {"id": "7dc964d5-49e6-4c37-b1c4-a7f0de1fa425", "name": "International Conference on Web and Social Media", "type": "conference", "alternate_names": ["Int Conf Weblogs Soc Media", "International Conference on Weblogs and Social Media", "Int Conf Web Soc Media", "ICWSM"], "url": "http://www.aaai.org/Library/ICWSM/icwsm-library.php"}, "title": "\"I Can't Keep It Up.\" A Dataset from the Defunct Voat.co News Aggregator", "abstract": "Voat.co was a news aggregator website that shut down on December 25, 2020. The site had a troubled history and was known for hosting various banned subreddits. This paper presents a dataset with over 2.3M submissions and 16.2M comments posted from 113K users in 7.1K subverses (the equivalent of subreddit for Voat). Our dataset covers the whole lifetime of Voat, from its developing period starting on November 8, 2013, the day it was founded, April 2014, up until the day it shut down (December 25, 2020).\n\nThis work presents the largest and most complete publicly available Voat dataset, to the best of our knowledge. Along with the release of this dataset, we present a preliminary analysis covering posting activity and daily user and subverse registration on the platform so that researchers interested in our dataset can know what to expect.\n\nOur data may prove helpful to false news dissemination studies as we analyze the links users share on the platform, finding that many communities rely on alternative news press, like Breitbart and GatewayPundit, for their daily discussions. In addition, we perform network analysis on user interactions finding that many users prefer not to interact with subverses outside their narrative interests, which could be helpful to researchers focusing on polarization and echo chambers. Also, since Voat was one of the platforms banned Reddit communities migrated to, we are confident our dataset will motivate and assist researchers studying deplatforming. Finally, many hateful and conspiratorial communities were very popular on Voat, which makes our work valuable for researchers focusing on toxicity, conspiracy theories, cross-platform studies of social networks, and natural language processing.", "venue": "International Conference on Web and Social Media", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-01-15", "journal": {"pages": "1302-1311"}, "authors": [{"authorId": "2279553027", "name": "Amin Mekacher"}, {"authorId": "9207147", "name": "Antonis Papasavva"}], "citations": [{"paperId": "2b20c6358bde280cd03993d5a01496ea9ad50f9d", "title": "Persistent interaction patterns across social media platforms and over time."}, {"paperId": "773bf27cf4321d7174c9ac9d18ae42ec4060bc5c", "title": "The Koo Dataset: An Indian Microblogging Platform With Global Ambitions"}, {"paperId": "5191e67484210c21eeefa6af23943b6f62f87584", "title": "The Conspiracy Money Machine: Uncovering Telegram's Conspiracy Channels and their Profit Model"}, {"paperId": "fe2f9ffc7f70bac83ba7c6eaa85eb9b96bdd5175", "title": "Measuring Centralization of Online Platforms Through Size and Interconnection of Communities"}, {"paperId": "2ce3253fa3892b1820b672437359b29ff1ca0bb4", "title": "Users volatility on Reddit and Voat"}, {"paperId": "ccc0f455efbe98a127f9084a93a559ac9f0d1d5c", "title": "Online conspiracy communities are more resilient to deplatforming"}, {"paperId": "975a2ff83e207340385d07499a2c9414fec7d3b2", "title": "Waiting for Q: An Exploration of QAnon Users' Online Migration to Poal in the Wake of Voat's Demise"}, {"paperId": "ac01adc12cd2a1fd6381e57afbe77d20d8d8fe88", "title": "Understanding Online Migration Decisions Following the Banning of Radical Communities"}]}
