{"paperId": "bdab29415be76e68d3c98defb72fc882d9daaf42", "publicationVenue": {"id": "289bfdda-eab3-4c9a-97be-ef1e0f9ddfc0", "name": "International Symposium on Software Testing and Analysis", "type": "conference", "alternate_names": ["ISSTA", "Int Symp Softw Test Anal"], "url": "https://dl.acm.org/conference/issta"}, "title": "Empirically evaluating readily available information for regression test optimization in continuous integration", "abstract": "Regression test selection (RTS) and prioritization (RTP) techniques aim to reduce testing efforts and developer feedback time after a change to the code base. Using various information sources, including test traces, build dependencies, version control data, and test histories, they have been shown to be effective. However, not all of these sources are guaranteed to be available and accessible for arbitrary continuous integration (CI) environments. In contrast, metadata from version control systems (VCSs) and CI systems are readily available and inexpensive. Yet, corresponding RTP and RTS techniques are scattered across research and often only evaluated on synthetic faults or in a specific industrial context. It is cumbersome for practitioners to identify insights that apply to their context, let alone to calibrate associated parameters for maximum cost-effectiveness. This paper consolidates existing work on RTP and unsafe RTS into an actionable methodology to build and evaluate such approaches that exclusively rely on CI and VCS metadata. To investigate how these approaches from prior research compare in heterogeneous settings, we apply the methodology in a large-scale empirical study on a set of 23 projects covering 37,000 CI logs and 76,000 VCS commits. We find that these approaches significantly outperform established RTP baselines and, while still triggering 90% of the failures, we show that practitioners can expect to save on average 84% of test execution time for unsafe RTS. We also find that it can be beneficial to limit training data, features from test history work better than change-based features, and, somewhat surprisingly, simple and well-known heuristics often outperform complex machine-learned models.", "venue": "International Symposium on Software Testing and Analysis", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2021-07-11", "journal": {"name": "Proceedings of the 30th ACM SIGSOFT International Symposium on Software Testing and Analysis"}, "authors": [{"authorId": "2064171309", "name": "Daniel Elsner"}, {"authorId": "2287987", "name": "Florian Hauer"}, {"authorId": "144658639", "name": "A. Pretschner"}, {"authorId": "25466001", "name": "Silke Reimer"}], "citations": [{"paperId": "8686805010697380c8ad1d908ce4074a99c924ab", "title": "PeaTMOSS: A Dataset and Initial Analysis of Pre-Trained Models in Open-Source Software"}, {"paperId": "5c276062eac554800b58475343983af8263cf146", "title": "Towards automatically identifying the co‐change of production and test code"}, {"paperId": "39bd108bac25cc26c0b8395ff7922fd917e37bb2", "title": "Revisiting Machine Learning based Test Case Prioritization for Continuous Integration"}, {"paperId": "bbf01ce7fea52987ae096b75328410019e5115a3", "title": "Semantic‐aware two‐phase test case prioritization for continuous integration"}, {"paperId": "00cf787add0f7b31f5ddf41d8d9ece1eb4af46ca", "title": "More Precise Regression Test Selection via Reasoning about Semantics-Modifying Changes"}, {"paperId": "3f06dcb2a0a153658dd894adfa8f1a2c5b598012", "title": "Systematic Literature Review on Application of Machine Learning in Continuous Integration"}, {"paperId": "07a58339b1eddc506b957cf91ea17462043876e5", "title": "AI for Agile development: a Meta-Analysis"}, {"paperId": "31b54e79b4af4b681ab88b5bf01a91d9ed0fd83a", "title": "Test Case Prioritization using Transfer Learning in Continuous Integration Environments"}, {"paperId": "9653e1af0491dbfec6ecab5133fb182156298dad", "title": "Test Selection for Unified Regression Testing"}, {"paperId": "5084a0d0bdebece0396027d9d886ddc3966ecea3", "title": "SoK: Machine Learning for Continuous Integration"}, {"paperId": "2763e1e28d2b8f57bc916d8f2858c4f13ff9cde8", "title": "Severity-Aware Prioritization of System-Level Regression Tests in Automotive Software"}, {"paperId": "ab7366f88da620a8b8677130ffdad06b9b656d58", "title": "BinaryRTS: Cross-language Regression Test Selection for C++ Binaries in CI"}, {"paperId": "517a4c10716f5f329e33abed7407b40ca67a8917", "title": "PTMTorrent: A Dataset for Mining Open-source Pre-trained Model Packages"}, {"paperId": "873aca9147f6121913afb5a4b10b74fc7e0af2f7", "title": "Industrial applications of software defect prediction using machine learning: A business-driven systematic literature review"}, {"paperId": "47789ae4698b57aa0d7c7a9406d56fc198cbcf4b", "title": "State of Practical Applicability of Regression Testing Research: A Live Systematic Literature Review"}, {"paperId": "9e88a6e3f1068fd4c265966167919d5de70feb55", "title": "HybridCISave: A Combined Build and Test Selection Approach in Continuous Integration"}, {"paperId": "4a3c215805db716f731dc574e3407fcd3270dcc6", "title": "Evaluating Search-Based Software Microbenchmark Prioritization"}, {"paperId": "6a6861493fd0c2fd0c1c9357694af8ca8d93a616", "title": "On the effectiveness of data balancing techniques in the context of ML-based test case prioritization"}, {"paperId": "e9a71e07318e4a27880aaaa5e9212332fe53877b", "title": "Evolution-aware detection of order-dependent flaky tests"}, {"paperId": "d66d45796f450ba72d787e3269a50c52fe97b045", "title": "Test Case Prioritization Using Partial Attention"}, {"paperId": "b971205103f9ae837813bdec890f6b57f590d5a0", "title": "Build System Aware Multi-language Regression Test Selection in Continuous Integration"}, {"paperId": "b29ef8ed3ff8c14ec5dec9a1d70a8de1eb5e170a", "title": "Probe-based Syscall Tracing for Efficient and Practical File-level Test Traces"}, {"paperId": "ed34d88092deb56d7694602d88da710018447313", "title": "Challenges in Regression Test Selection for End-to-End Testing of Microservice-based Software Systems"}, {"paperId": "b2f8399dc3423e4bac9300174b01a55ab1c81f85", "title": "Comparing and Combining Analysis-Based and Learning-Based Regression Test Selection"}, {"paperId": "6d159ed540e203d40fd3a6b458d088934819a9bc", "title": "TCTracer: Establishing test-to-code traceability links using dynamic and static techniques"}, {"paperId": "9e560e55c0d91a19581d038dfdb285f9d1047e05", "title": "Scalable and Accurate Test Case Prioritization in Continuous Integration Contexts"}, {"paperId": "0c5a9c9949d60fb63102dcf43d16d30dcc4fbe2c", "title": "A Theoretical Analysis of Random Regression Test Prioritization"}, {"paperId": "15c73cff6a30c818e66b16f9a0dd3ad9c96aaaf0", "title": "Cost of Flaky Tests in Continuous Integration: An Industrial Case Study"}]}
