{"paperId": "bdae46e4ce13a08680107382cccc5f225a6e1ee2", "publicationVenue": null, "title": "Optimal power management of DGS and DSTATCOM using improved Ali Baba and the forty thieves optimizer", "abstract": "In this study an improved Ali Baba and the forty thieves Optimizer (IAFT) is\n proposed and successfully adapted and applied to enhance the technical\n performances of radial distribution network (RDN). The standard AFT governed\n by two sensible parameters to balance the exploration and the exploitation\n stages. In the proposed variant a modification is introduced using sine and\n cosine functions to create flexible balance between Intensification and\n diversification during search process. The proposed variant namely IAFT\n applied to solve various single and combined objective functions such as the\n improvement of total power losses (TPL), the minimization of total voltage\n deviation and the maximization of the loading capacity (LC) under fixed load\n and considering the random aspect of loads. The exchange of active powers is\n elaborated by integration of multi distribution generation based\n photovoltaic systems (PV), otherwise the optimal management of reactive\n power is achieved by the installation of multi DSTATCOM. The efficiency and\n robustness of the proposed variant validated on two RDN, the 33-Bus and the\n 69-Bus. The qualities of objective functions achieved and the statistical\n analysis elaborated compared to results achieved using several recent\n metaheuristic methods demonstrate the competitive aspect of the proposed\n IAFT in solving with accuracy various practical problems related to optimal\n power management of RDN.", "venue": "Facta universitatis - series: Electronics and Energetics", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "Facta universitatis - series: Electronics and Energetics"}, "authors": [{"authorId": "2568170", "name": "B. Mahdad"}], "citations": []}
