{"paperId": "bdaf267bb93c34c17a7f48c25fcab6904378ea67", "publicationVenue": {"id": "1df1928c-d75e-4d86-89bc-5a1be8a503d3", "name": "IEEE International Conference on Network Protocols", "type": "conference", "alternate_names": ["ICNP", "International Conference on Network Protocols", "Int Conf Netw Protoc", "IEEE Int Conf Netw Protoc"], "url": "http://www.ieee-icnp.org/"}, "title": "On SDN-Enabled Online and Dynamic Bandwidth Allocation for Stream Analytics", "abstract": "Data communication in cloud-based distributed stream data analytics often involves a collection of parallel and pipelined TCP flows. As the standard TCP congestion control mechanism is designed for achieving \"fairness\" among competing flows and is agnostic to the application layer contexts, the bandwidth allocation among a set of TCP flows traversing bottleneck links often leads to sub-optimal application-layer performance measures, e.g., stream processing throughput or average tuple complete latency. Motivated by this and enabled by the rapid development of the Software-Defined Networking (SDN) techniques, in this paper, we re-investigate the design space of the bandwidth allocation problem and propose a cross-layer framework which utilizes the additional information obtained from the application layer and provides on-the-fly and dynamic bandwidth adjustment algorithms for helping the stream analytics applications achieving better performance during the runtime. We implement a prototype cross-layer bandwidth allocation framework based on a popular open-source distributed stream processing platform, Apache Storm, together with the OpenDaylight controller, and carry out extensive experiments with real-world analytical workloads on top of a local cluster consisting of 10 workstations interconnected by a SDN-enabled switch. The experiment results clearly validate the effectiveness and efficiency of our proposed framework and algorithms.", "venue": "IEEE International Conference on Network Protocols", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2018-09-01", "journal": {"name": "2018 IEEE 26th International Conference on Network Protocols (ICNP)", "pages": "209-219"}, "authors": [{"authorId": "1691813", "name": "Walid A. Y. Aljoby"}, {"authorId": "2153687572", "name": "Xin Wang"}, {"authorId": "1686139", "name": "T. Fu"}, {"authorId": "144030168", "name": "Richard T. B. Ma"}], "citations": [{"paperId": "7aae342f5d7f9c3c54276ba1ec32364e624175c9", "title": "StreamSwitch: Fulfilling Latency Service-Layer Agreement for Stateful Streaming"}, {"paperId": "7f4c99687f73c4cc9932dfd87e307f860dc92372", "title": "Machine Learning-based Approaches Comparison for Netfiix/DAZN Streaming and Real Traffic Prediction"}, {"paperId": "fa21800def85ba993398a9245775ad8a62510dc8", "title": "Revenue-Oriented Service Offloading through Fog-Cloud Collaboration in SD-WAN"}, {"paperId": "eb4f4c96430b41a81bd6a8be1ee3ee7d436d11e0", "title": "SDN-enabled Resource Provisioning Framework for Geo-Distributed Streaming Analytics"}, {"paperId": "0d28bb07b3ad8f26eb510cc4935a641545654e65", "title": "Fair and Efficient Distributed Edge Learning With Hybrid Multipath TCP"}, {"paperId": "2a6baff0ce9f752f43691687cfdcff5cf6eb048f", "title": "Runtime Adaptation of Data Stream Processing Systems: The State of the Art"}, {"paperId": "6747ff409cb04d146d50d9bd730bb8422d76371e", "title": "SDN-based fog and cloud interplay for stream processing"}, {"paperId": "9f100f633f4a70b33dde0373e3d6d2d6bff6385e", "title": "A Privacy-Preserving Incentive Mechanism for Data Offloading in Satellite-Terrestrial Crowdsensing"}, {"paperId": "ef009d722c96c30f4628d38f9396ce6364f219cb", "title": "HPDDRR: Optimized Scheduler Shaper for Bandwidth Management and Traffic Shaping in Internet Protocol Storage Area Networks"}, {"paperId": "d0137f41e2388ba5b01c61d31ecedbc2e4a73963", "title": "Hone: Mitigating Stragglers in Distributed Stream Processing With Tuple Scheduling"}, {"paperId": "ce4090ad705bee0cafeb66edeb1413dadd8d8ac9", "title": "Anomaly Detection and Bottleneck Identification of The Distributed Application in Cloud Data Center using Software–Defined Networking"}, {"paperId": "9a18c3c064d6392c6c650737a1944dbe5698927f", "title": "Improving Fairness for Distributed Interactive Applications in Software-Defined Networks"}, {"paperId": "b4071ebde8a81947619c20e85ab547629d0214d2", "title": "Poster Abstract: Fair and Efficient Dynamic Bandwidth Allocation with OpenFlow"}, {"paperId": "20e768f765c5fe3e15814416c022880ef01a32fc", "title": "On SDN-Enabled Online and Dynamic Bandwidth Allocation for Stream Analytics"}, {"paperId": "c242151aea70e2d7cb767a287e4c877effa2d9d8", "title": "Modeling and Control of Priority Queueing in Software Defined Networks via Machine Learning"}, {"paperId": "ef6bfa3f8ff88326792085456c55c8c088e5dd08", "title": "Detecting and Securing of IP Spoo f ing Attack by using SDN"}, {"paperId": "c390cc880922658765b17c5d846c07d07d932f85", "title": "Scheduling Solutions for Data Stream Processing Applications on Cloud-Edge Infrastructure. (Solutions de planification pour les applications de traitement de flux de données sur une infrastructure Cloud-Edge)"}]}
