{"paperId": "bdb3c4d928c83704a3702edc9a8b8f17b91e598f", "publicationVenue": {"id": "0aed7a40-85f3-4c66-9e1b-c1556c57001b", "name": "PLoS ONE", "type": "journal", "alternate_names": ["Plo ONE", "PLOS ONE", "PLO ONE"], "issn": "1932-6203", "url": "https://journals.plos.org/plosone/", "alternate_urls": ["http://www.plosone.org/"]}, "title": "Impact of the twin pandemics: COVID-19 and oil crash on Saudi exchange index", "abstract": "This study aims to explore the effects of COVID-19 indicators and the oil price crash on the Saudi Exchange (Tadawul) Trading Volume and Tadawul Index (TASI) for the period from January 1, 2020, to December 2, 2020. The independent variable is oil price, and the COVID-19 indicators are lockdown, first and second decreases of Repo and Reverse Repo rates, Saudi government response, and cumulative deceased cases. The study adopts two phases. In the first phase, linear regression is used to identify the most influential variables affecting Trading volume and TASI. According to the results, the trading volume model is significant with an adjusted R2 of 65.5% and a standard error of 81. The findings of this model indicate a positive effect of cumulative deceased cases and first decrease of Repo and Reverse Repo rates and a negative effect of oil prices on Trading Volume. The TASI model is significant with an adjusted R2 of 86% and a standard error of 270. The results of this model indicate that lockdown and first decrease of Repo and Reverse Repo rates have a significant negative effect on TASI while the cumulative decrease in cases and oil prices have a positive effect on TASI. In the second phase, linear regression, and neural network predictors (with and without validation) are applied to predict the future TASI values. The neural network model indicates that the neural networks can achieve the best results if all independent variables are used together. By combining the collected results, the study finds that oil price has the most substantial effect on the changes in TASI as compared to the COVID-19 indicators. The results indicate that TASI rapidly follows the changes in oil prices.", "venue": "PLoS ONE", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-05-20", "journal": {"name": "PLoS ONE", "volume": "17"}, "authors": [{"authorId": "1729366241", "name": "Dania Al-Najjar"}], "citations": [{"paperId": "99731e8a0fa3eb91117a0c61e2fec593b685a0b0", "title": "The impact of Russo-Ukrainian war, COVID-19, and oil prices on global food security"}, {"paperId": "00dce551404fa56e88e1391ba72c503cad92bcb6", "title": "Knowledge, attitude, and adherence to coronavirus preventive measures among residents of the Kingdom of Saudi Arabia"}, {"paperId": "80431535fd110acc26a0faae5dbd07ae4eaaef9c", "title": "Developing Machine Learning Techniques to Investigate the Impact of Air Quality Indices on Tadawul Exchange Index"}]}
