{"paperId": "bdb826b267841b8948497064efd01b781ac10341", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Playground v2.5: Three Insights towards Enhancing Aesthetic Quality in Text-to-Image Generation", "abstract": "In this work, we share three insights for achieving state-of-the-art aesthetic quality in text-to-image generative models. We focus on three critical aspects for model improvement: enhancing color and contrast, improving generation across multiple aspect ratios, and improving human-centric fine details. First, we delve into the significance of the noise schedule in training a diffusion model, demonstrating its profound impact on realism and visual fidelity. Second, we address the challenge of accommodating various aspect ratios in image generation, emphasizing the importance of preparing a balanced bucketed dataset. Lastly, we investigate the crucial role of aligning model outputs with human preferences, ensuring that generated images resonate with human perceptual expectations. Through extensive analysis and experiments, Playground v2.5 demonstrates state-of-the-art performance in terms of aesthetic quality under various conditions and aspect ratios, outperforming both widely-used open-source models like SDXL and Playground v2, and closed-source commercial systems such as DALLE 3 and Midjourney v5.2. Our model is open-source, and we hope the development of Playground v2.5 provides valuable guidelines for researchers aiming to elevate the aesthetic quality of diffusion-based image generation models.", "venue": "arXiv.org", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-02-27", "journal": {"name": "ArXiv", "volume": "abs/2402.17245"}, "authors": [{"authorId": "2287851898", "name": "Daiqing Li"}, {"authorId": "2287844026", "name": "Aleks Kamko"}, {"authorId": "2287835852", "name": "Ehsan Akhgari"}, {"authorId": "2287831139", "name": "Ali Sabet"}, {"authorId": "2287878382", "name": "Linmiao Xu"}, {"authorId": "2287835841", "name": "Suhail Doshi"}], "citations": [{"paperId": "6b5fc164c4f21e4a4f151df60bfd5e32b061a903", "title": "InstantStyle: Free Lunch towards Style-Preserving in Text-to-Image Generation"}, {"paperId": "f6632f0c4633ea981684a16a05f5d7d46d1d586c", "title": "PixArt-Σ: Weak-to-Strong Training of Diffusion Transformer for 4K Text-to-Image Generation"}]}
