{"paperId": "bdba72a6344bcb312fa8f8b9dee0e7d70066d796", "publicationVenue": {"id": "027ffd21-ebb0-4af8-baf5-911124292fd0", "name": "bioRxiv", "type": "journal", "url": "http://biorxiv.org/"}, "title": "Using big data to estimate whale watching effort", "abstract": "The growing concerns about the negative effects caused by whale watching on wild The growing concerns about the negative effects caused by whale watching on wild cetacean populations are evincing the need to measure whale watching effort more precisely. The current alternatives do not provide sufficient information or imply time-consuming and staff intensive tasks that limit their effectiveness to establish the maximum carrying capacity for this touristic activity. A methodology based on big data analysis, using Automatic Information System (AIS) messages, can provide valuable vessel activity information, which is necessary to estimate whale watching effort on cetacean populations. We used AIS data to automatically detect whale watching operations and quantify whale watching effort with high spatial and temporal resolution in the Canary Islands. The results obtained in this study are very encouraging, proving that the methodology is able to estimate seasonal and annual trends in the whale watching effort. The methodology has also proved to be effective in providing detailed spatial information about the whale watching effort, which makes an interesting tool to manage spatial regulations and enforce exclusion zones. The widespread use of AIS devices in maritime navigation provides an enormous potential to easily extend this methodology to other regions worldwide. Any public strategy aimed at the sustainable use of the marine resources should enhance the use of this kind of information technologies, collecting and archiving detailed information on the activity of all the vessels, especially in marine protected areas.", "venue": "bioRxiv", "year": 2020, "fieldsOfStudy": ["Biology", "Computer Science"], "publicationTypes": null, "publicationDate": "2020-12-01", "journal": {"name": "bioRxiv"}, "authors": [{"authorId": "5526514", "name": "J. Almunia"}, {"authorId": "1454615471", "name": "Patricia Delponti"}, {"authorId": "145784363", "name": "F. Rosa"}], "citations": []}
