{"paperId": "bdd3f218edb9195a389fb7a4c7e73690ad7553ad", "publicationVenue": {"id": "bb40a041-3875-45d5-afd4-e1c75f896fa6", "name": "IEEE Transactions on Wireless Communications", "type": "journal", "alternate_names": ["IEEE Trans Wirel Commun"], "issn": "1536-1276", "url": "http://www.comsoc.org/twc/", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=7693", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=7693&year=2005"]}, "title": "New Game-Theoretic Approach to Decentralized Path Selection and Sleep Scheduling for Mobile Edge Computing", "abstract": "Network function virtualization (NFV) implements mobile edge computing (MEC) services as software appliances, and allows resources to be adaptively allocated to accommodate demand variations. Scalability and network cost (including operational cost and response latency) are key challenges. This paper presents a new game-theoretic approach to minimizing the network cost, where access points (APs) select MEC servers and routes in a decentralized manner, and unloaded routers and links are deactivated for cost saving. The key idea is that we interpret the minimization of network cost as a mixed game with a non-monotonic cost function capturing both the operational cost and response latency. We prove that the game is conditionally an ordinary potential game and converges to $\\alpha $ -approximate equilibriums. A closed-form expression is derived for the convergence delay. Another important aspect is that we integrate Stackelberg routing into the proposed mixed game to avoid inefficient equilibriums (with high cost or latency). We prove that the mixed game can converge faster to better equilibriums under linear response latency models. Extensive simulations corroborate the new game-theoretic approach can significantly outperform existing techniques in terms of efficiency, convergence, and scalability.", "venue": "IEEE Transactions on Wireless Communications", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-08-01", "journal": {"name": "IEEE Transactions on Wireless Communications", "pages": "6125-6140", "volume": "21"}, "authors": [{"authorId": "2759314", "name": "Binwei Wu"}, {"authorId": "1735856", "name": "Jie Zeng"}, {"authorId": "34037829", "name": "S. Shao"}, {"authorId": "144820734", "name": "Wei Ni"}, {"authorId": "1728926", "name": "Youxi Tang"}], "citations": [{"paperId": "c215e7a3ef9c9d3bd1f52a564dec079a6f6c36fe", "title": "Optimal coordination in logistics warehousing with sensing and communication limits: A distributed differential game approach"}, {"paperId": "af5646b28729830e158f066ecbd02e3aef5ee418", "title": "Game Theoretic Resource Planning and Request Scheduling in Mobile Edge Computing Networks"}, {"paperId": "db122e4b28f687298f3cc7f997dd54ffe6e716fd", "title": "Multi-source DNN task offloading strategy based on in-network computing"}]}
