{"paperId": "bde6a203624a8b8ef731df19f69850d6798ce5a7", "publicationVenue": {"id": "e7c556b0-162f-4c48-9d25-fe3c141f984e", "name": "Big Data and Cognitive Computing", "alternate_names": ["Big Data Cogn Comput"], "issn": "2504-2289", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-1077183", "alternate_urls": ["https://www.mdpi.com/journal/BDCC", "https://www.mdpi.com/journal/BDCC/about", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-1077183"]}, "title": "A New Big Data Processing Framework for the Online Roadshow", "abstract": "The Online Roadshow, a new type of web application, is a digital marketing approach that aims to maximize contactless business engagement. It leverages web computing to conduct interactive game sessions via the internet. As a result, massive amounts of personal data are generated during the engagement process between the audience and the Online Roadshow (e.g., gameplay data and clickstream information). The high volume of data collected is valuable for more effective market segmentation in strategic business planning through data-driven processes such as web personalization and trend evaluation. However, the data storage and processing techniques used in conventional data analytic approaches are typically overloaded in such a computing environment. Hence, this paper proposed a new big data processing framework to improve the processing, handling, and storing of these large amounts of data. The proposed framework aims to provide a better dual-mode solution for processing the generated data for the Online Roadshow engagement process in both historical and real-time scenarios. Multiple functional modules, such as the Application Controller, the Message Broker, the Data Processing Module, and the Data Storage Module, were reformulated to provide a more efficient solution that matches the new needs of the Online Roadshow data analytics procedures. Some tests were conducted to compare the performance of the proposed frameworks against existing similar frameworks and verify the performance of the proposed framework in fulfilling the data processing requirements of the Online Roadshow. The experimental results evidenced multiple advantages of the proposed framework for Online Roadshow compared to similar existing big data processing frameworks.", "venue": "Big Data and Cognitive Computing", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-27", "journal": {"name": "Big Data Cogn. Comput.", "pages": "123", "volume": "7"}, "authors": [{"authorId": "2134879073", "name": "Kang-Ren Leow"}, {"authorId": "3433690", "name": "M. Leow"}, {"authorId": "2459162", "name": "Lee-Yeng Ong"}], "citations": [{"paperId": "84afcdcc0d42ff7b6cbf5e53a320cf0fce5f6612", "title": "A Model for Enhancing Unstructured Big Data Warehouse Execution Time"}, {"paperId": "dacba3106e3219bc548ec04ab9d357a28c4f419d", "title": "Role of IoT technologies in big data management systems: A review and Smart Grid case study"}]}
