{"paperId": "bded3fc627c4a8963c410c7c260b2dee2684fd4f", "publicationVenue": {"id": "4b287a90-4cd2-44ad-8edb-c670c48a64b3", "name": "Geological Journal", "type": "journal", "alternate_names": ["Geol J"], "issn": "0072-1050", "alternate_issns": ["1025-6814"], "url": "http://eu.wiley.com/WileyCDA/WileyTitle/productCd-GJ.html", "alternate_urls": ["http://geojournal.igs-nas.org.ua/", "https://onlinelibrary.wiley.com/journal/10991034", "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1099-1034", "http://www3.interscience.wiley.com/cgi-bin/jhome/1903"]}, "title": "Landslide risk assessment and management using hybrid machine learning‐based empirical models", "abstract": "Landslides are a prevalent geologic phenomenon that substantially threatens human life and infrastructure, resulting in considerable loss and destruction. The practice of landslide susceptibility mapping is crucial for the mitigation of risks connected with this natural disaster. This work aims at investigating the influence of varying sample sizes on the precision of landslide susceptibility modelling using a case study conducted in the Alamout basin, Iran. The researchers used a machine learning methodology based on tree algorithms to construct a model for predicting the likelihood of landslides. Additionally, they adopted a multi‐scenario strategy to address the inherent uncertainty associated with the input data. The integration of the naive Bayes tree (NBTree), random forest (RF), logistic model tree (LMT) and J48 algorithms was performed. The modelling process included using 20 predictive parameters across four distinct scenarios. Four models, labelled S1, S2, S3 and S4, were used in this study. These models utilized 25%, 50%, 75% and 100% of the available inventory data. The research presented in this study is distinguished by using a tree‐based methodology for landslide susceptibility modelling and incorporating a multi‐scenario strategy to address the inherent uncertainty associated with the input data. The findings indicated that the augmentation of the sample size improved the precision of the models. The efficacy of using a multi‐scenario strategy in enhancing the dependability of the model is also underscored. Among the 20 input elements used in the modelling process, it was seen that slope angle accounted for the highest relative significance, constituting 25.60% of the overall influence. Following more closely, distance to fault contributed significantly, with a relative importance of 23.40%. Additionally, rainfall and elevation exhibited notable contributions, with relative volumes of 7.91% and 5.50%, respectively. All four landslide models showed adequate learning and forecasting ability throughout the training and testing phases. During the testing phase, the true skill score (TSS) values exhibited a range of 0.631–0.804, while the area under the receiver operating characteristic curve values showed a range of 0.745–0.921. The susceptibility maps indicated that a significant portion of the region exhibits moderate to very high susceptibility zones, with the northern and eastern sectors displaying greater landslide values than the western region. The model's performance showed improvement from S1 to S4 in both the training and testing phases. The performance of the models exhibited the following trend: in scenario 1, the RF model outperformed the J48, LMT and NBTree models; in scenario 2, the RF model surpassed the NBTree and LMT models, while being on par with the J48 model; in scenarios 3 and 4, the RF model showed superior performance compared to the NBTree, J48 and LMT models. Therefore, the RF model proved to be the most effective among the models evaluated. The findings derived from this research have the potential to serve as valuable references for the purposes of land‐use planning and catastrophe risk management.", "venue": "Geological Journal", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-10-30", "journal": {"name": "Geological Journal"}, "authors": [{"authorId": "49262929", "name": "Dingying Yang"}, {"authorId": "2264071362", "name": "Xi Jiang"}, {"authorId": "115600072", "name": "A. Arabameri"}, {"authorId": "2238733346", "name": "M. Santosh"}, {"authorId": "2143180397", "name": "J. C. Egbueri"}], "citations": []}
