{"paperId": "bdf1ea9f19653eea4fd89b290a9aea0ccc890e44", "publicationVenue": {"id": "2135230a-3b24-4b71-9583-60624389377a", "name": "IEEE Transactions on Industrial Informatics", "type": "journal", "alternate_names": ["IEEE Trans Ind Informatics"], "issn": "1551-3203", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=9424", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=9424"]}, "title": "Physical Unclonable Function-Based Lightweight and Verifiable Data Stream Transmission for Industrial IoT", "abstract": "The deep integration of informatization and industrialization has resulted in an increasingly close connection between supervisory control and data acquisition (SCADA) systems and the Internet. The boundaries of the SCADA system are monitored by industrial smart sensors, which only have limited security protection and face severe security threats. One major threat is that smart sensors are vulnerable to physical attacks because they are often installed in unsafe areas far from plant protection. Under this attack, the data of sensors can be easily tampered with. Moreover, since sensors are resource-constrained physical devices, complex and expensive encryption algorithms are not applicable. In this paper, we design a lightweight industrial smart sensor data stream integrity verification scheme based on physical unclonable function (PUF) for industrial IoT, which can protect the physical security of sensors and the integrity of data streams to ensure the secure transmission of industrial smart sensor data streams. We utilize PUF, fuzzy extractor and bit selection algorithm to generate stable PUF responses. A malicious attacker cannot extract the key information through physical attack. In addition, we design a lightweight integrity verification algorithm with efficient key updating based on lightweight cryptographic primitives, making it suitable for resource-constrained physical devices. We perform the security analysis to demonstrate the security of the scheme to known security vulnerabilities. We implement the proposed scheme and evaluate the performance of our scheme with extensive experiments. The experimental results show the scheme is efficient and superior to existing schemes in computational and communication efficiency.", "venue": "IEEE Transactions on Industrial Informatics", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-01", "journal": {"name": "IEEE Transactions on Industrial Informatics", "pages": "11573-11583", "volume": "19"}, "authors": [{"authorId": "2209327417", "name": "Xiaohu Shan"}, {"authorId": "143990012", "name": "Haiyang Yu"}, {"authorId": "2109304556", "name": "Yuwen Chen"}, {"authorId": "2149232628", "name": "Zhen Yang"}], "citations": [{"paperId": "b0c5158fa7358d64b7f4d38ebae9d9fab595a05e", "title": "QPUF: Quantum Physical Unclonable Functions for Security-by-Design of Industrial Internet-of-Things"}, {"paperId": "e174271b353369e0811c83f01e0e3201a70c1ed9", "title": "A Novel Integrity Protocol Based on Physical Unclonable Functions"}]}
