{"paperId": "bdf2d7fd01d4c3bc2fdd83d83c30c988bfc7801b", "publicationVenue": null, "title": "A Unified Framework for Robust and Efficient Hotspot Detection in Smart Cities", "abstract": "Given N geo-located point instances (e.g., crime or disease cases) in a spatial domain, we aim to detect sub-regions (i.e., hotspots) that have a higher probability density of generating such instances than the others. Hotspot detection has been widely used in a variety of important urban applications, including public safety, public health, urban planning, and equity, among others. The problem is challenging because its societal applications often have low tolerance for false positives and require significance testing that is computationally intensive. In related work, the spatial scan statistic introduced a likelihood ratio--based framework for hotspot evaluation and significance testing. However, it fails to consider the effect of spatial non-determinism, causing many missing detections. Our previous work introduced a non-deterministic normalization--based scan statistic to mitigate this issue. However, its robustness against false positives is not stably controlled. To address these limitations, we propose a unified framework that can improve the completeness of results without incurring more false positives. We also propose a reduction algorithm to improve the computational efficiency. Experiment results confirm that the unified framework can greatly improve the recall of hotspot detection without increasing the number of false positives, and the reduction algorithm can greatly reduce execution time.", "venue": "Trans. Data Sci.", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-09-14", "journal": {"name": "ACM Transactions on Data Science", "pages": "1 - 29", "volume": "1"}, "authors": [{"authorId": "46269169", "name": "Yiqun Xie"}, {"authorId": "145072875", "name": "S. Shekhar"}], "citations": [{"paperId": "f1bf58afa87450c4af97634183b2de9fddaa5f16", "title": "Significant DBSCAN+: Statistically Robust Density-based Clustering"}, {"paperId": "c9c3f4400d091aba2a29c8b32d66291e3eb16779", "title": "Statistically-Robust Clustering Techniques for Mapping Spatial Hotspots: A Survey"}]}
