{"paperId": "bdf648a3804565c9f5762881024557de34a76624", "publicationVenue": {"id": "ca61b508-d706-40a4-8b54-d657dd6cd9d6", "name": "ACM Transactions on Knowledge Discovery from Data", "type": "journal", "alternate_names": ["ACM Trans Knowl Discov Data", "ACM Transactions on Knowledge Discovery From Data"], "issn": "1556-4681", "url": "http://www.acm.org/pubs/tkdd/", "alternate_urls": ["http://portal.acm.org/tkdd", "http://portal.acm.org/browse_dl.cfm?coll=portal&dl=ACM&idx=J1054&linked=1&part=transaction"]}, "title": "Structure-Driven Representation Learning for Deep Clustering", "abstract": "As an important branch of unsupervised learning methods, clustering makes a wide contribution in the area of data mining. It is well known that capturing the group-discriminative properties of each sample for clustering is crucial. Among them, deep clustering delivers promising results due to the strong representational power of neural networks. However, most of them adopt sample-level learning strategies, and the standalone data point barely captures its holistic cluster’s context and may undergo sub-optimal cluster assignment. To tackle this issue, we propose a Structure-driven Representation Learning (SRL) method by introducing latent structure information into the representation learning process at both the local and global levels. Specifically, a local-structure-driven sample representation strategy is proposed to approximate the estimation of data distribution, which models the neighborhood distribution of samples with potential structure information and exploits statistical dependencies between them to improve cluster consistency. A global-structure-driven cluster representation strategy is designed, where the context of each cluster is sufficiently encoded according to its samples (exemplar-theory) and corresponding prototype (prototype-theory). In this case, each cluster can only be related to its most similar samples, and different clusters are separated as much as possible. These two models are seamlessly combined into a joint optimization problem, which can be efficiently solved. Experiments on six widely-used datasets demonstrate the superiority of SRL over state-of-the-art clustering methods.", "venue": "ACM Transactions on Knowledge Discovery from Data", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-08", "journal": {"name": "ACM Transactions on Knowledge Discovery from Data", "pages": "1 - 25", "volume": "18"}, "authors": [{"authorId": "2238239118", "name": "Xiang Wang"}, {"authorId": "144889532", "name": "L. Jing"}, {"authorId": "2145489099", "name": "Huafeng Liu"}, {"authorId": "2238384042", "name": "Jian Yu"}], "citations": []}
