{"paperId": "bdffac44a6dd36172445b30786c29bbbf3a4038a", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Security and Trust Management in the Internet of Vehicles (IoV): Challenges and Machine Learning Solutions", "abstract": "The Internet of Vehicles (IoV) is a technology that is connected to the public internet and is a subnetwork of the Internet of Things (IoT) in which vehicles with sensors are connected to a mobile and wireless network. Numerous vehicles, users, things, and networks allow nodes to communicate information with their surroundings via various communication channels. IoV aims to enhance the comfort of driving, improve energy management, secure data transmission, and prevent road accidents. Despite IoV’s advantages, it comes with its own set of challenges, particularly in the highly important aspects of security and trust. Trust management is one of the potential security mechanisms aimed at increasing reliability in IoV environments. Protecting IoV environments from diverse attacks poses significant challenges, prompting researchers to explore various technologies for security solutions and trust evaluation methods. Traditional approaches have been employed, but innovative solutions are imperative. Amid these challenges, machine learning (ML) has emerged as a potent solution, leveraging its remarkable advancements to effectively address IoV’s security and trust concerns. ML can potentially be utilized as a powerful technology to address security and trust issues in IoV environments. In this survey, we delve into an overview of IoV and trust management, discussing security requirements, challenges, and attacks. Additionally, we introduce a classification scheme for ML techniques and survey ML-based security and trust management schemes. This research provides an overview for understanding IoV and the potential of ML in improving its security framework. Additionally, it provides insights into the future of trust and security enhancement.", "venue": "Italian National Conference on Sensors", "year": 2024, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2024-01-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "24"}, "authors": [{"authorId": "2195770050", "name": "Easa Alalwany"}, {"authorId": "2278685150", "name": "Imad Mahgoub"}], "citations": [{"paperId": "591d836b04361bd55bf8fe6f8bd98553cd83c4c6", "title": "Secure and lightweight message dissemination framework for internet of vehicles"}, {"paperId": "351377daa011d59b7c4f132d308a08da1eb895c1", "title": "An Effective Ensemble Learning-Based Real-Time Intrusion Detection Scheme for an In-Vehicle Network"}]}
