{"paperId": "be01061b0b2746dbcdd20d53e76b4261f62599d3", "publicationVenue": {"id": "6175efe8-6f8e-4cbe-8cee-d154f4e78627", "name": "Mathematics", "issn": "2227-7390", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-283014", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-283014", "https://www.mdpi.com/journal/mathematics"]}, "title": "A Goal Programming-Based Methodology for Machine Learning Model Selection Decisions: A Predictive Maintenance Application", "abstract": "The paper develops a goal programming-based multi-criteria methodology, for assessing different machine learning (ML) regression models under accuracy and time efficiency criteria. The developed methodology provides users with high flexibility in assessing the models as it allows for a fast and computationally efficient sensitivity analysis of accuracy and time significance weights as well as accuracy and time significance threshold values. Four regression models were assessed, namely the decision tree, random forest, support vector and the neural network. The developed methodology was employed to forecast the time to failures of NASA Turbofans. The results reveal that decision tree regression (DTR) seems to be preferred for low values of accuracy weights (up to 30%) and low accuracy and time efficiency threshold values. As the accuracy weights tend to increase and for higher accuracy and time efficiency threshold values, random forest regression (RFR) seems to be the best choice. The preference for the RFR model however, seems to change towards the adoption of the neural network for accuracy weights equal to and higher than 90%.", "venue": "Mathematics", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-09-27", "journal": {"name": "Mathematics"}, "authors": [{"authorId": "3273242", "name": "I. Mallidis"}, {"authorId": "103538775", "name": "Volha Yakavenka"}, {"authorId": "2044612914", "name": "Anastasios D. Konstantinidis"}, {"authorId": "3221123", "name": "N. Sariannidis"}], "citations": [{"paperId": "08c2437aeebf83061bf221d594d39ef8a46d8d47", "title": "Selection of Potential Regions for the Creation of Intelligent Transportation Systems Based on the Machine Learning Algorithm Random Forest"}]}
