{"paperId": "be04f80198a801044a423af8d92d6d53e8451f08", "publicationVenue": null, "title": "Space-time landslide susceptibility modelling in Taiwan", "abstract": "10 Portraying spatiotemporal variations in landslide susceptibility patterns is crucial for 11 landslide prevention and management. In this study, we implement a space-time 12 modeling approach to predict the landslide susceptibility on a yearly basis across the 13 main island of Taiwan, from 2004 to 2018. We use a Bayesian version of a binomial 14 generalized additive model, which assumes that landslide occurrences follow a 15 Bernoulli distribution. We generate 46,074 slope units to partition the island of Taiwan 16 and divided the time domain into 14 annual units. The binary landslide label assigned 17 to each slope unit and their temporal replicates come from an available landslide 18 database, that contains an inventory for every year. We only consider new landslides or 19 reactivations of previous mass movements in the yearly inventories. This information 20 and its absence counterpart are regressed against a set of static and dynamic covariates. 21 Our modeling strategy features an initial explanatory model to test the goodness-of- 22 fit and interpret the effect of covariates. Then, five cross-validation (CV) schemes are 23 tested to provide a full spectrum of the predictive capacity of our model. Specifically, we implement a fully randomized 10-fold CV, a spatially constrained CV, two temporal 25 CV (a leave one year out and a sequential temporal aggregation), together with a spatio- 26 temporal CV. We summarize the performance in each of these tests, through their pure 27 numerical expression as well as their residual representation in space and time. 28 Overall, our space-time model produces excellent and interpretable results. We 29 consider this type of dynamic prediction the new direction to take to finally move away 30 from the static view provided by traditional susceptibility models. And, we consider 31 such analyses just a stepping stone for further improvements, the most natural of which 32 would lead to statistical simulations for future scenarios. 33", "venue": "", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "95100116", "name": "Zhice Fang"}, {"authorId": "2154458426", "name": "Yi Wang"}, {"authorId": "2140688276", "name": "C. V. Westen"}, {"authorId": "50026822", "name": "L. Lombardo"}], "citations": [{"paperId": "f6fc1b888b26eb0e8f13886bd8e9af8df3ffc25c", "title": "Space-time landslide size modelling in Taiwan 1"}]}
