{"paperId": "be0675c2d63559d4a4babfcf64b7dbdab1c798be", "publicationVenue": {"id": "11e94c04-6b12-41c9-963d-1a08cdbc306d", "name": "ACM SIGPLAN Symposium on Principles & Practice of Parallel Programming", "type": "conference", "alternate_names": ["PPoPP", "ACM SIGPLAN Symp Princ Pract Parallel Program", "ACM SIGPLAN Symposium on Principles and Practice of Parallel Programming", "ACM SIGPLAN Symp Princ  Pract Parallel Program"], "url": "http://www.acm.org/sigplan/ppopp.htm"}, "title": "Stream processing with dependency-guided synchronization", "abstract": "Real-time data processing applications with low latency requirements have led to the increasing popularity of stream processing systems. While such systems offer convenient APIs that can be used to achieve data parallelism automatically, they offer limited support for computations that require synchronization between parallel nodes. In this paper, we propose dependency-guided synchronization (DGS), an alternative programming model for stateful streaming computations with complex synchronization requirements. In the proposed model, the input is viewed as partially ordered, and the program consists of a set of parallelization constructs which are applied to decompose the partial order and process events independently. Our programming model maps to an execution model called synchronization plans which supports synchronization between parallel nodes. Our evaluation shows that APIs offered by two widely used systems---Flink and Timely Dataflow---cannot suitably expose parallelism in some representative applications. In contrast, DGS enables implementations with scalable performance, the resulting synchronization plans offer throughput improvements when implemented manually in existing systems, and the programming overhead is small compared to writing sequential code.", "venue": "ACM SIGPLAN Symposium on Principles & Practice of Parallel Programming", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2021-04-09", "journal": {"name": "Proceedings of the 27th ACM SIGPLAN Symposium on Principles and Practice of Parallel Programming"}, "authors": [{"authorId": "91973722", "name": "Konstantinos Kallas"}, {"authorId": "2643050", "name": "Filip Niksic"}, {"authorId": "20860470", "name": "C. Stanford"}, {"authorId": "1710176", "name": "R. Alur"}], "citations": [{"paperId": "ca4dac5abfe80563b1e1ae17b5c8c3eb157d1b69", "title": "Stream Types"}, {"paperId": "c9355c18f39b42c6aa786244dd84e9cd92c5d1b2", "title": "A Robust Theory of Series Parallel Graphs"}, {"paperId": "b889a47b024ba9d4215f676308f1dc484dbfe4d5", "title": "Synchronization Techniques for Multi-threaded Web Server: A Comparative Study"}, {"paperId": "e53df886cdafebf17c5e31792e7c51c54636543d", "title": "Synchronization Schemas"}, {"paperId": "5a35594dd9e5a820da6aab58f48f1b13c7e2601b", "title": "DiffStream: differential output testing for stream processing programs"}, {"paperId": "29fa0ae44dab32221e7a81a56c49c98c10bbc803", "title": "A NOVEL TRUE REAL-TIME SPATIOTEMPORAL DATA STREAM PROCESSING FRAMEWORK"}]}
