{"paperId": "be1ba596e6676946e976edda7bd6c0d5560e493e", "publicationVenue": {"id": "7f03ba38-4bb4-41a3-a6d7-914c28f84272", "name": "Dependable Systems and Networks", "type": "conference", "alternate_names": ["DSN", "Dependable Syst Netw"], "url": "http://www.dsn.org/"}, "title": "Compiler-Implemented Differential Checksums: Effective Detection and Correction of Transient and Permanent Memory Errors", "abstract": "The detection of memory errors is common practice in safety-critical software, for example in the automotive and avionics industry. International safety standards recommend using checksums for protecting critical data in computer memories. Typical implementations verify the checksum before data access and recompute it after modification using the same algorithm. However, we show that this approach can sometimes dramatically worsen the reliability of computer systems with regard to transient memory faults, and also permanent faults remain undetected. A solution with significant conceptual advantages is constituted by differential checksum algorithms, which update the respective checksum without full recomputation on data modification. We present a compiler-based solution that inserts differential checksums into C/C++ data structures automatically to cope with their increased complexity. An extensive fault-injection campaign with the TACLeBench benchmark collection shows that differential checksums reduce silent data corruptions by 95% on average whereas non-differential checksums turn out to be mostly ineffective because they introduce a window of vulnerability.", "venue": "Dependable Systems and Networks", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-06-01", "journal": {"name": "2023 53rd Annual IEEE/IFIP International Conference on Dependable Systems and Networks (DSN)", "pages": "81-94"}, "authors": [{"authorId": "1973782", "name": "C. Borchert"}, {"authorId": "1734455", "name": "Horst Schirmeier"}, {"authorId": "1721730", "name": "O. Spinczyk"}], "citations": [{"paperId": "ad4cea2703c7d0167aa7f0cc6bb8b94a1b50aebb", "title": "Towards a Fault-Injection Benchmarking Suite"}]}
