{"paperId": "be2d84f0575258e4b49afe805f7a1cac77041afa", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "MuChin: A Chinese Colloquial Description Benchmark for Evaluating Language Models in the Field of Music", "abstract": "The rapidly evolving multimodal Large Language Models (LLMs) urgently require new benchmarks to uniformly evaluate their performance on understanding and textually describing music. However, due to semantic gaps between Music Information Retrieval (MIR) algorithms and human understanding, discrepancies between professionals and the public, and low precision of annotations, existing music description datasets cannot serve as benchmarks. To this end, we present MuChin, the first open-source music description benchmark in Chinese colloquial language, designed to evaluate the performance of multimodal LLMs in understanding and describing music. We established the Caichong Music Annotation Platform (CaiMAP) that employs an innovative multi-person, multi-stage assurance method, and recruited both amateurs and professionals to ensure the precision of annotations and alignment with popular semantics. Utilizing this method, we built a dataset with multi-dimensional, high-precision music annotations, the Caichong Music Dataset (CaiMD), and carefully selected 1,000 high-quality entries to serve as the test set for MuChin. Based on MuChin, we analyzed the discrepancies between professionals and amateurs in terms of music description, and empirically demonstrated the effectiveness of annotated data for fine-tuning LLMs. Ultimately, we employed MuChin to evaluate existing music understanding models on their ability to provide colloquial descriptions of music. All data related to the benchmark and the code for scoring have been open-sourced.", "venue": "arXiv.org", "year": 2024, "fieldsOfStudy": ["Computer Science", "Engineering"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-02-15", "journal": {"name": "ArXiv", "volume": "abs/2402.09871"}, "authors": [{"authorId": "2284261738", "name": "Zihao Wang"}, {"authorId": "2284231493", "name": "Shuyu Li"}, {"authorId": "2284487308", "name": "Tao Zhang"}, {"authorId": "2284512587", "name": "Qi Wang"}, {"authorId": "2284568881", "name": "Pengfei Yu"}, {"authorId": "2284308592", "name": "Jinyang Luo"}, {"authorId": "2284222776", "name": "Yan Liu"}, {"authorId": "2284220475", "name": "Ming Xi"}, {"authorId": "2284853862", "name": "Kejun Zhang"}], "citations": []}
