{"paperId": "be2f8368f414c4806b37bcf2d2283391d3680ca3", "publicationVenue": {"id": "7c9d091e-015e-4e5d-a11f-9bc369fcf414", "name": "IEEE Transactions on Parallel and Distributed Systems", "type": "journal", "alternate_names": ["IEEE Trans Parallel Distrib Syst"], "issn": "1045-9219", "url": "http://www.computer.org/tpds", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=71"]}, "title": "Liberator: A Data Reuse Framework for Out-of-Memory Graph Computing on GPUs", "abstract": "Graph analytics are widely used including recommender systems, scientific computing, and data mining. Meanwhile, GPU has become the major accelerator for such applications. However, the graph size increases rapidly and often exceeds the GPU memory, incurring severe performance degradation due to frequent data transfers between the main memory and GPUs. To relieve this problem, we focus on the utilization of data in GPUs by taking advantage of the data reuse across iterations. In our studies, we deeply analyze the memory access patterns of graph applications at different granularities. We have found that the memory footprint is accessed with a roughly sequential scan without a hotspot, which infers an extremely long reuse distance. Based on our observation, we propose a novel framework, called Liberator, to exploit the data reuse within GPU memory. In Liberator, GPU memory is reserved for the data potentially accessed across iterations to avoid excessive data transfer between the main memory and GPUs. For the data not existing in GPU memory, a Merged and Aligned memory access manner is employed to improve the transmission efficiency. We also further optimize the framework by parallel processing of data in GPU memory and data in the main memory. We have implemented a prototype of the Liberator framework and conducted a series of experiments on performance evaluation. The experimental results show that Liberator can significantly reduce the data transfer overhead, which achieves an average of 2.7x speedup over a state-of-the-art approach.", "venue": "IEEE Transactions on Parallel and Distributed Systems", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-01", "journal": {"name": "IEEE Transactions on Parallel and Distributed Systems", "pages": "1954-1967", "volume": "34"}, "authors": [{"authorId": "50341591", "name": "SHIYANG LI"}, {"authorId": "47043873", "name": "Ruiqi Tang"}, {"authorId": "2215369534", "name": "Jingyu Zhu"}, {"authorId": "1596793975", "name": "Ziyi Zhao"}, {"authorId": "39827582", "name": "Xiaoli Gong"}, {"authorId": "1597346687", "name": "Wenwen Wang"}, {"authorId": "2117169560", "name": "Jin Zhang"}, {"authorId": "1699961", "name": "P. Yew"}], "citations": []}
