{"paperId": "be38ff804c7d550b0cc098a1b3bd70c008eafc49", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Federated Learning for Big Data: A Survey on Opportunities, Applications, and Future Directions", "abstract": "Big data has remarkably evolved over the last few years to realize an enormous volume of data generated from newly emerging services and applications and a massive number of Internet-of-Things (IoT) devices. The potential of big data can be realized via analytic and learning techniques, in which the data from various sources is transferred to a central cloud for central storage, processing, and training. However, this conventional approach faces critical issues in terms of data privacy as the data may include sensitive data such as personal information, governments, banking accounts. To overcome this challenge, federated learning (FL) appeared to be a promising learning technique. However, a gap exists in the literature that a comprehensive survey on FL for big data services and applications is yet to be conducted. In this article, we present a survey on the use of FL for big data services and applications, aiming to provide general readers with an overview of FL, big data, and the motivations behind the use of FL for big data. In particular, we extensively review the use of FL for key big data services, including big data acquisition, big data storage, big data analytics, and big data privacy preservation. Subsequently, we review the potential of FL for big data applications, such as smart city, smart healthcare, smart transportation, smart grid, and social media. Further, we summarize a number of important projects on FL-big data and discuss key challenges of this interesting topic along with several promising solutions and directions.", "venue": "arXiv.org", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-10-08", "journal": {"name": "ArXiv", "volume": "abs/2110.04160"}, "authors": [{"authorId": "11041265", "name": "T. Gadekallu"}, {"authorId": "145436642", "name": "Viet Quoc Pham"}, {"authorId": "1402997421", "name": "Thien Huynh-The"}, {"authorId": "2286538930", "name": "S. Bhattacharya"}, {"authorId": "29919430", "name": "Praveen Kumar Reddy Maddikunta"}, {"authorId": "145332300", "name": "Madhusanka Liyanage"}], "citations": [{"paperId": "a31f2b289310f6b03f9019eecde865f15faf63bd", "title": "Towards a Holistic Approach to Chronic Disease Management: Integrating Federated Learning and IoT for Personalized health Care"}, {"paperId": "e10620bd320c2bfbb7341bf3ae13dd407c86ec22", "title": "Federated Learning for 6G: Paradigms, Taxonomy, Recent Advances and Insights"}, {"paperId": "d4ed7b2048778de8d6784eedd939f516c36b30a9", "title": "APCAS: Autonomous Privacy Control and Authentication Sharing in Social Networks"}, {"paperId": "8ddf27c5b64da2a43593d08703607f3d262e9023", "title": "A Privacy-Preserving Approach for Big Data Mining Using RainForest with Federated Learning"}, {"paperId": "5ba279f6746db234cbc16d6b86dfba26fae6b9ef", "title": "Heart Stroke Prediction Using Federated Learning"}, {"paperId": "f08c60aa410fd3ef5fd21c09332a428626859844", "title": "Towards Efficient Resource Allocation for Federated Learning in Virtualized Managed Environments"}, {"paperId": "b9e4b4ea648064ad382d1a4e73c604c9fbdbb10a", "title": "Artificial Intelligence for Cognitive Health Assessment: State-of-the-Art, Open Challenges and Future Directions"}, {"paperId": "3d6b6fc6987e3b8c32abfd51f0680b8025527d5b", "title": "Fostering Trustworthiness of Federated Learning Ecosystem through Realistic Scenarios"}, {"paperId": "13ac69d52faf08dbde6287d4b55be6d9f577ca83", "title": "Accuracy Degrading: Toward Participation-Fair Federated Learning"}, {"paperId": "f48d40617405e6fdd9b720d91a0bc557f9c51900", "title": "Decentralized Federated Learning: A Survey and Perspective"}, {"paperId": "ce7b5cafe754dd6f6a93dbc602b43eb048d0f49a", "title": "A Comprehensive Survey on Federated Learning Techniques for Healthcare Informatics"}, {"paperId": "6b09064b2a739a3872e153c114b762d01cc71e8b", "title": "Genetic Clustered Federated Learning for COVID-19 Detection"}, {"paperId": "a452e2058530b9450bdb1fb18bc9af344acf57b2", "title": "Autonomous Vehicles in 5G and Beyond: A Survey"}, {"paperId": "1101c709219792eb053ef5f6d2342de808588f37", "title": "PCA-Based Incremental Extreme Learning Machine (PCA-IELM) for COVID-19 Patient Diagnosis Using Chest X-Ray Images"}, {"paperId": "c1fa2708bc5fe04825485d5f93c4bf7e45d1d1fd", "title": "Handling Privacy-Sensitive Medical Data With Federated Learning: Challenges and Future Directions"}, {"paperId": "3f318d659d9f9fbc2d9c3f1a5aa9ea164fcf4485", "title": "Incentive Mechanisms for Smart Grid: State of the Art, Challenges, Open Issues, Future Directions"}, {"paperId": "5bdbadc741ce13762b7c914c1514124404c46211", "title": "An Augmented Artificial Intelligence Approach for Chronic Diseases Prediction"}, {"paperId": "a172591d42f536ecdeaae05ffd5c2f128970da5c", "title": "Federated Learning Approach to Protect Healthcare Data over Big Data Scenario"}, {"paperId": "95eb866b9bdf186cd4e1a4dc2b56d92693accc8b", "title": "FL-PMI: Federated Learning-Based Person Movement Identification through Wearable Devices in Smart Healthcare Systems"}, {"paperId": "c2da2a71a34576832f9b1c02c0405db4474dc63d", "title": "Applying Federated Learning in Software-Defined Networks: A Survey"}, {"paperId": "d51066026accde34060d106b2e93eed0e7f3e7b4", "title": "Applications of Explainable AI for 6G: Technical Aspects, Use Cases, and Research Challenges"}, {"paperId": "7f1443b1fece310c5f2af53ce8305c376d7b205c", "title": "ARFED: Attack-Resistant Federated averaging based on outlier elimination"}, {"paperId": "11b3d996bea22d0f27b9489fa58bae6ca7bcbd2b", "title": "Secure Sum Outperforms Homomorphic Encryption in (Current) Collaborative Deep Learning"}, {"paperId": "143709f68498d1751d56d86f113f4b9e77c549f9", "title": "An intelligent data capturing framework to improve condition monitoring and anomaly detection for industrial machines"}, {"paperId": "deaffe6e9f664bf74885ce873b19b0c84dc132f9", "title": "A Systematic Review on Federated Learning in Medical Image Analysis"}, {"paperId": "a59bff592a8854074a552ef6962d5bc58c21951a", "title": "Decentralized Machine Learning Training: A Survey on Synchronization, Consolidation, and Topologies"}, {"paperId": "8b785819345bb80b87c9013fccffa6f4e5c1dce4", "title": "Explainable AI for B5G/6G: Technical Aspects, Use Cases, and Research Challenges"}]}
