{"paperId": "be4f2e6f5fd32fd14068c174bc88988bdb0ba80f", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Secure Decentralized IoT Service Platform Using Consortium Blockchain", "abstract": "Although many studies have been devoted to integrating blockchain into IoT device management, access control, data integrity, security, and privacy, blockchain-facilitated IoT communication is still much less studied. Blockchain has great potential in decentralizing and securing IoT communications. In this paper, we propose an innovative IoT service platform powered by the consortium blockchain technology. The proposed platform abstracts machine-to-machine (M2M) and human-to-machine (H2M) communications into services provided by IoT devices. Then, it materializes the data exchange of the IoT network through smart contracts and blockchain transactions. Additionally, we introduce the auxiliary storage layer to the proposed platform to address various off-chain data storage needs. Our proof-of-concept implementation was tested against various workloads and connection sizes under different block configurations to evaluate the platform’s transaction throughput, latency, and hardware utilization. The experimental results demonstrate that our solution can maintain high performance with a throughput of approximately 800 reads per second (RPS), 50–80 transactions per second (TPS), and a latency of 50 ms–2 s under light to moderate workloads. Our extensive evaluation of the performance impact of batch size, batch timeout, and connection size also provides valuable insights into the optimization of blockchain configuration for achieving high performance.", "venue": "Italian National Conference on Sensors", "year": 2022, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-09-25", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "22"}, "authors": [{"authorId": "2109970280", "name": "Ruipeng Zhang"}, {"authorId": "48258982", "name": "Chenfu Xu"}, {"authorId": "2087679456", "name": "Mengjun Xie"}], "citations": [{"paperId": "ec6366969fefaafc090f30cca3fc44763acce428", "title": "Towards Deep Learning Based Access Control using Hyperledger-Fabric Blockchain for the Internet of Things"}, {"paperId": "8607a9284934de75016c2b89118650bd425727b1", "title": "Toward Designing a Secure Authentication Protocol for IoT Environments"}]}
