{"paperId": "be5f045f819cd4f6cdd59f8a1a088a9bd6d4e15e", "publicationVenue": {"id": "12db5cb6-3a5a-45ec-be9f-49e77bfe4401", "name": "Journal of the Operational Research Society", "type": "journal", "alternate_names": ["J Oper Res Soc"], "issn": "0160-5682", "url": "http://www.palgrave-journals.com/jors/index.html", "alternate_urls": ["https://www.jstor.org/journal/joperresesoci", "http://www.jstor.org/journals/01605682.html"]}, "title": "Type α and type γ consensus for multi-stage emergency group decision making based on mining consensus sequences", "abstract": "Abstract Large-scale unconventional emergencies, such as earthquake, hurricane and tsunami, usually require crucial decisions. These emergency problems often involve many experts from various fields such as geology, seismology, and meteorology, and government department officers due to the nature of complexity and widely affected scope. In this regard, group decision making can be used to solve these problems. Additionally, an important characteristic of unconventional emergencies is that they vary rapidly. A single decision is often unable to adapt to the rapidly changing situation. Considering these factors, this study aims to develop a multi-stage group decision-making model to solve emergency problems. Firstly, we develop a method to determine the weights of stages and use the Partitioning Around Medoids clustering algorithm to classify experts. Then, we introduce two consensus measures, namely type α consensus and type γ consensus, to select the best alternative and find the total ranking list based on mining consensus sequences. Finally, an illustrative example concerning the typhoon “Lekima” is provided to illustrate the applicability of our proposed model.", "venue": "Journal of the Operational Research Society", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-11-03", "journal": {"name": "Journal of the Operational Research Society", "pages": "365 - 381", "volume": "73"}, "authors": [{"authorId": "2087083011", "name": "Ming Tang"}, {"authorId": "2314246", "name": "Huchang Liao"}, {"authorId": "46860084", "name": "Gang Kou"}], "citations": [{"paperId": "ba5f7f08d96f97b400fb9f99b7d41275593a92fe", "title": "A multi-stage multi-criterion group decision-making method for emergency management based on alternative chain and trust radius of experts"}, {"paperId": "5343e151fcb826e9c829718d9c8351f13c8d31d5", "title": "An integrated model for occupational health and safety risk assessment based on probabilistic linguistic information and social network consensus analysis"}, {"paperId": "bca1b7025aaad34b6fabecae3fe18c68cc5155e1", "title": "Optimization consensus analysis for group decision making in view of non-transferable and transferable allocation schemes"}, {"paperId": "a1890ab169ff794306d113cd5cf304165d58e04a", "title": "A large-group dynamic decision-making method for assessing storm surge emergency plans under hybrid information"}, {"paperId": "2d5971992af305b4b4e2ef41d30a1538c3f6cfa7", "title": "Selfish-dilemma consensus analysis for group decision making in the perspective of cooperative game theory"}, {"paperId": "57c436b70c99bb27da064e1b19048bf5a8da65a0", "title": "Cooperative game theory based consistency and consensus reaching process for group decision making with fuzzy preference relations"}, {"paperId": "f1126159b85bd1b826b8fee93ed1f43a9006f01b", "title": "A multistage decision-making method with quantum-guided expert state transition based on normal cloud models"}, {"paperId": "76e647e5d30e5356ebedd91e46ea641f89ae5e0d", "title": "A survey of group decision making methods in Healthcare Industry 4.0: bibliometrics, applications, and directions"}, {"paperId": "5a24cd8a761fc2f9ad9b9db8ab677a4a5a31a8ec", "title": "Large-scale peer-to-peer loan consensus based on minimum cost consensus"}, {"paperId": "cadf288b90b50832c7c66e49f0132bb0963513f0", "title": "Minimum adjustment cost-based multi-stage goal programming models for consistency improving and consensus building with multiplicative reciprocal paired comparison matrices"}, {"paperId": "ecd9524a6cf8e99bc7b3654de5f954b90f452a0e", "title": "An ExpTODIM-MACONT Based Multiple-Attribute Group Decision-Making Technique for Smart Classroom Teaching Evaluation of Basic English Under Interval-Valued Pythagorean Fuzzy Circumstances"}]}
