{"paperId": "be5f510ac62453c22dadcd8db0fb6ff56e6b65bf", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Ontology-based Graph Visualization for Summarized View", "abstract": "Data summarization that presents a small subset of a dataset to users has been widely applied in numerous applications and systems. Many datasets are coded with hierarchical terminologies, e.g., the international classification of Diseases-9, Medical Subject Heading, and Gene Ontology, to name a few. In this paper, we study the problem of selecting a diverse set of k elements to summarize an input dataset with hierarchical terminologies, and visualize the summary in an ontology structure. We propose an efficient greedy algorithm to solve the problem with (1-1/e) = 62% -approximation guarantee. Although this greedy solution achieves quality-guaranteed answers approximately but it is still not optimal. To tackle the problem optimally, we further develop a dynamic programming algorithm to obtain optimal answers for graph visualization of log-data using ontology terminologies called OVDO . The complexity and correctness of OVDO are theoretically analyzed. In addition, we propose a useful optimization technique of tree reduction to remove useless nodes with zero weights and shrink the tree into a smaller one, which ensures the efficiency acceleration of OVDO in many real-world applications. Extensive experimental results on real-world datasets show the effectiveness and efficiency of our proposed approximate and exact algorithms for tree data summarization.", "venue": "arXiv.org", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-08-07", "journal": {"name": "ArXiv", "volume": "abs/2008.03053"}, "authors": [{"authorId": "1943233691", "name": "Xuliang Zhu"}, {"authorId": "2152664330", "name": "Xin Huang"}, {"authorId": "2110585930", "name": "Byron Choi"}, {"authorId": "2110535754", "name": "Jianliang Xu"}, {"authorId": "2059932199", "name": "W. Cheung"}, {"authorId": "2229226291", "name": "Yanchun Zhang"}, {"authorId": "2155139078", "name": "Jiming Liu"}], "citations": []}
