{"paperId": "be9136e825bc7cc8c79fffc87c3ac1636143a779", "publicationVenue": {"id": "8bae9e1d-2df9-4ece-99bc-4e68368d40f2", "name": "International Conference on Advanced Computing", "type": "conference", "alternate_names": ["ICoAC", "Int Conf Adv Comput"]}, "title": "Crime Detection Using Multi-Layer Perceptron in Social Media Platforms", "abstract": "Criminals have been increasingly utilizing Social Media Platforms (SMPs) to achieve a number of criminal goals. These goals can range from the establishment of criminal virtual groups to the sharing of user information and data breaches. Such criminal groups often use SMPs to share confidential information and coordinate criminal activities. The ease of access and the ability to remain anonymous makes SMPs a powerful tool for criminals. Data breaches are a major concern when it comes to SMPs. Criminals can use SMPs to gain access to personal and financial information, including credit card numbers and passwords. They can also use SMPs to spread malicious software and malware, which can be used to infect computers and mobile devices. The sharing of user information is also a concern for SMPs. Criminals can use SMPs to obtain personal information about individuals, which can be used for identity theft and other malicious activities. Furthermore, criminals can use SMPs to spread false information about individuals or organizations, which can lead to reputational damage. SMPs can be a powerful tool for criminals. Additionally, users should be careful when sharing personal information and be aware of any suspicious activity on SMPs. Hence, we suggested an ontology-based multilayer perceptron (MLP) classifier a feed forward artificial neural network algorithm MLP-NN) for criminal intention detection in SMPs, which creates program concepts for the choice of social network postings containing criminal slang terms and automatically categorizing these posts in line with illocutionary categories. The system uses trained models from previously published articles to accurately classify published posts with criminal purpose. The suggested method is examined and contrasted with different existing technologies. The results show that the suggested framework is effective in identifying crimes on social media.", "venue": "International Conference on Advanced Computing", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-08-17", "journal": {"name": "2023 12th International Conference on Advanced Computing (ICoAC)", "pages": "1-8"}, "authors": [{"authorId": "2242940119", "name": "J. Sathya"}, {"authorId": "2242944753", "name": "F. Mary"}, {"authorId": "2242944763", "name": "Harin Fernandez2"}], "citations": []}
