{"paperId": "bea690cab47b0745d8a020f85395adfd7ece19d7", "publicationVenue": null, "title": "Development of a methodology for creating an on-line layout assistant for electronic publications for mobile devices", "abstract": "The purpose of this study is to develop a methodology for creating an on-line assistant for electronic publications for mobile devices. The survey of experts is determined the basic requirements for an on-line assistant. Based on the results of the survey, the optimal functions and sub-functions of an on-line assistant for the layout of electronic publications for mobile devices are formed. The consistency of experts' opinions was checked. As a result, partial coherence of expert opinions was obtained, the corresponding indicator is 0.68. The main types of internal structure of the online assistant are reviewed and its hybrid structure is developed. QuarkXPress, Adobe InDesign, and Scribus were used as software tools for developing training videos in the structure of the online assistant. The structure of the online assistant for layout of electronic publications for mobile devices was designed. Training videos were created as components of the online assistant. The stages of creating a training video were: script development, development of text material, rehearsal, video recording, video processing, and uploading to a website. The design scheme of the online assistant was chosen in the form of \"material design\" style. A prototype of the on-line assistant was developed based on the use of a technical website script and text markup in HTML 5, CSS 3 and JavaScript. The practical result of the research is an online assistant with information on how to design electronic publications for mobile devices. The developed online assistant provides an opportunity to remotely contact a qualified specialist in the layout of electronic publications for mobile devices", "venue": "EUREKA: Physics and Engineering", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-09-29", "journal": {"name": "EUREKA: Physics and Engineering"}, "authors": [{"authorId": "66254113", "name": "Y. Hrabovskyi"}, {"authorId": "81352900", "name": "Hryhorii Kots"}, {"authorId": "2253990580", "name": "Kostiantyn Veretelnyk"}], "citations": [{"paperId": "e4f125e0083e119621995775f8476fd3c40c692d", "title": "Developing a method for the detection and identification of rootstock blockchain network nodes"}, {"paperId": "ec2873df155daf9a619a54891b16b80cdee108d0", "title": "IMPROVING THE TECHNOLOGY FOR CONSTRUCTING A SOFTWARE TOOL TO DETERMINE THE SIMILARITY OF RASTER GRAPHIC IMAGES"}]}
