{"paperId": "bebd8499434a2b7674264fcb45f4966aae1408da", "publicationVenue": {"id": "ccd8e532-73c6-414f-bc91-271bbb2933e2", "name": "Electronics", "type": "journal", "issn": "1450-5843", "alternate_issns": ["2079-9292", "0883-4989"], "url": "http://www.electronics.etfbl.net/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-247562", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-247562", "https://www.mdpi.com/journal/electronics"]}, "title": "Neural Network for Low-Memory IoT Devices and MNIST Image Recognition Using Kernels Based on Logistic Map", "abstract": "This study presents a neural network which uses filters based on logistic mapping (LogNNet). LogNNet has a feedforward network structure, but possesses the properties of reservoir neural networks. The input weight matrix, set by a recurrent logistic mapping, forms the kernels that transform the input space to the higher-dimensional feature space. The most effective recognition of a handwritten digit from MNIST-10 occurs under chaotic behavior of the logistic map. The correlation of classification accuracy with the value of the Lyapunov exponent was obtained. An advantage of LogNNet implementation on IoT devices is the significant savings in memory used. At the same time, LogNNet has a simple algorithm and performance indicators comparable to those of the best resource-efficient algorithms available at the moment. The presented network architecture uses an array of weights with a total memory size from 1 to 29 kB and achieves a classification accuracy of 80.3–96.3%. Memory is saved due to the processor, which sequentially calculates the required weight coefficients during the network operation using the analytical equation of the logistic mapping. The proposed neural network can be used in implementations of artificial intelligence based on constrained devices with limited memory, which are integral blocks for creating ambient intelligence in modern IoT environments. From a research perspective, LogNNet can contribute to the understanding of the fundamental issues of the influence of chaos on the behavior of reservoir-type neural networks.", "venue": "Electronics", "year": 2020, "fieldsOfStudy": ["Computer Science", "Physics"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-06-04", "journal": {"name": "ArXiv", "volume": "abs/2006.02824"}, "authors": [{"authorId": "49236496", "name": "A. Velichko"}], "citations": [{"paperId": "4caddffa02797d32ef94609f4f5ab9217637869d", "title": "Extraction of Significant Features by Fixed-Weight Layer of Processing Elements for the Development of an Efficient Spiking Neural Network Classifier"}, {"paperId": "3936b226a544ee64cb3201316551dc6b3e8766bd", "title": "Preliminary investigation on the implementation of an artificial synapse using TaOx-based memristor with thermally oxidized active layer."}, {"paperId": "bfe2ff6318d71113227a9f253dc52c7608ecf33c", "title": "A hybrid forecasting model of carbon emissions with optimized VMD and error correction"}, {"paperId": "d7c4e6c820faf6f48d73aac095e163b887766685", "title": "Dynamical Complexity Transitions During High‐Intensity Long Duration Continuous Auroral Activities (HILDCAA) Events: Feature Analysis Based on Neural Network Entropy"}, {"paperId": "5023dfbc4f3589b0c03b2b00a0e97c641680277c", "title": "A Bio-Inspired Chaos Sensor Model Based on the Perceptron Neural Network: Machine Learning Concept and Application for Computational Neuro-Science"}, {"paperId": "8ad4b944213ccc219af69b092f5b5c50cb16cd81", "title": "LogNNet model as a fast, simple and economical AI instrument in the diagnosis and prognosis of COVID-19"}, {"paperId": "fbfc747a2ead5d5fd4e6eabbddf3f8839ea73572", "title": "Neural Network Entropy (NNetEn): Entropy-Based EEG Signal and Chaotic Time Series Classification, Python Package for NNetEn Calculation"}, {"paperId": "b237b19538081816c8aef6bdc9b3b09a86051066", "title": "A discrete memristive neural network and its application for character recognition"}, {"paperId": "7de5b188465d9257e5786d68c61a45a994ae18da", "title": "A spiking neural network with fixed synaptic weights based on logistic maps for a classification task"}, {"paperId": "b30deb20d5780556a2d412509522523fb77515ad", "title": "Bifurcation and Entropy Analysis of a Chaotic Spike Oscillator Circuit Based on the S-Switch"}, {"paperId": "e91d283aea3febb2e87d3e0de307d26434793836", "title": "Entropy Approximation by Machine Learning Regression: Application for Irregularity Evaluation of Images in Remote Sensing"}, {"paperId": "1561cdfb77003522b639a56470985c0f3efe2ec4", "title": "Two Novel Non-Uniform Quantizers with Application in Post-Training Quantization"}, {"paperId": "0832910fc389d510cd93739753782f92087df329", "title": "Machine Learning Sensors for Diagnosis of COVID-19 Disease Using Routine Blood Values for Internet of Things Application"}, {"paperId": "192be89b7aef8b2f1b070c52301361d058fd47f4", "title": "Research on Feature Extraction Method of Ship Radiated Noise with K-nearest Neighbor Mutual Information Variational Mode Decomposition, Neural Network Estimation Time Entropy and Self-organizing Map Neural Network"}, {"paperId": "8f959c0fa8cafb3da7f3a49e7ebfd2916a663545", "title": "Diagnosis and Prognosis of COVID-19 Disease Using Routine Blood Values and LogNNet Neural Network"}, {"paperId": "977c27a5666ef761e282d319d283df9a50e4730f", "title": "NNetEn2D: Two-Dimensional Neural Network Entropy in Remote Sensing Imagery and Geophysical Mapping"}, {"paperId": "68d578e6772fa7cb2587ab31a6441e54f7ffc9a3", "title": "Design of a Low-area Digit Recognition Accelerator Using MNIST Database"}, {"paperId": "54f7f97f4d9c34238cad6589426a09b04361de67", "title": "Novel techniques for improving NNetEn entropy calculation for short and noisy time series"}, {"paperId": "2cc803bc1d696810a32a7f5cdcaf9d8c8fdc3d59", "title": "Dynamical Complexity Response in Traveling Ionospheric Disturbances Across Eastern Africa Sector During Geomagnetic Storms Using Neural Network Entropy"}, {"paperId": "defc7eccfea0df8d6b4dfabc9eb8f8ac5868b508", "title": "Enhancing the Recognition Task Performance of MEMS Resonator-Based Reservoir Computing System via Nonlinearity Tuning"}, {"paperId": "d01c3216a85f2bd1f729bd08730ae55d1c367aa8", "title": "Method for fast classification of MNIST digits on Arduino UNO board using LogNNet and linear congruential generator"}, {"paperId": "d372caa0880f80738aa98a8753706f3e250090b8", "title": "A Method for Medical Data Analysis Using the LogNNet for Clinical Decision Support Systems and Edge Computing in Healthcare"}, {"paperId": "bbf0163a0a9d04aa773b2b1849dc9c1201a699cc", "title": "A Method for Estimating the Entropy of Time Series Using Artificial Neural Networks"}, {"paperId": "5a1023fc67ce724c1d69d0eb48a2154e709a60a8", "title": "Feature alignment as a generative process"}, {"paperId": "1b06f6d3b6d12212ffb6472e217bf0eaf9a582a9", "title": "Car Tourist Trajectory Prediction Based on Bidirectional LSTM Neural Network"}, {"paperId": "02de983b8d6e283a82b9a53f905371bcc4e7d4fe", "title": "An improved LogNNet classifier for IoT applications"}, {"paperId": "8d74f8e298d7ca770657db12bd25b83f58af6301", "title": "Evaluation of deep learning algorithms for semantic segmentation of car parts"}, {"paperId": "dd29d449f83e614a1a39117a01a9c849f37428d5", "title": "Application of binary dynamical systems in the problem of classification of Boolean vectors"}, {"paperId": "4c7c451e355a7d529c2fd0ff796b7666f0ef1cff", "title": "Recognition of handwritten MNIST digits on low-memory 2 Kb RAM Arduino board using LogNNet reservoir neural network"}, {"paperId": "fe4cfb77b493f15d2cd67f06096e588ad531bf52", "title": "Designing and Manufacturing of Automatic Robotic Lawn Mower"}, {"paperId": "906816565e9d3626535c8ee7b88e146ad31297e9", "title": "Neural Network Entropy (NNetEn): EEG Signals and Chaotic Time Series Separation by Entropy Features, Python Package for NNetEn Calculation"}, {"paperId": "bf5571fe216077a71959906f66ea4575dfc51ca5", "title": "ODTC: An online darknet traffic classification model based on multimodal self-attention chaotic mapping features"}, {"paperId": "b366fc877912077628986b2bec0ba01bfc65cabb", "title": "Emotions recognizing using lognnet neural network and Keystroke dynamics dataset"}, {"paperId": "b3f687c1c820f60737bb001d3ebe8c47977e2aee", "title": "An 8-bit Single Perceptron Processing Unit for Tiny Machine Learning Applications"}, {"paperId": "c0503119d6f8ac8b7bccb1736a454182de536c65", "title": "A New Feature Selection Method for LogNNet and its Application for Diagnosis and Prognosis of COVID-19 Disease Using Routine Blood Values"}, {"paperId": "4a15ca94cfdb1198b72505e075feb74e5f67f354", "title": "Novel techniques for improvement the NNetEn entropy calculation for short and noisy time series"}, {"paperId": "4343ecac78089c0e65c0a94e154df0767c84ad8d", "title": "Reservoir-based convolution"}, {"paperId": "a4f6b941c49ba8b6a9caefa84623571102078d06", "title": "Intelligent Recognition Method of Multitype Human Posture Based on Deep Learning"}, {"paperId": "9f684e695f3401ad062d1f6aa6d7ebf4742740f2", "title": "Feature Alignment for Approximated Reversibility in Neural Networks"}]}
