{"paperId": "bec1884bd3082d0ada112c5aa9b37b1a7c52f2a3", "publicationVenue": {"id": "fff3549c-df24-4aef-accb-a33ae442a828", "name": "Journal of Marine Science and Engineering", "type": "journal", "alternate_names": ["J Mar Sci Eng"], "issn": "2077-1312", "url": "https://www.mdpi.com/journal/jmse"}, "title": "An Anomaly Detection Method for AIS Trajectory Based on Kinematic Interpolation", "abstract": "With the enormous amount of information provided by the ship Automatic Identification System (AIS), AIS is now playing a significant role in maritime transport system-related research and development. Many kinds of research and industrial applications are based on the ship trajectory extracted from raw AIS data. However, due to the issues of equipment, the transmission environment, and human factors, the raw AIS data inevitably contain abnormal messages, which have hindered the utilization of such information in practice. Thus, in this paper, an anomaly detection method that focuses on AIS trajectory is proposed, making comprehensive use of the kinematic information of the ship in the AIS data. The method employs three steps to obtain non-error AIS trajectories: (1) data preprocessing, (2) kinematic estimation, and (3) error clustering. It should be noted that steps (2) and (3) are involved in an iterative process to determine all of the abnormal data. A case study is then conducted to test the proposed method on real-world AIS data, followed by a comparison between the proposed method and the rule-based anomaly detection method. As the processed trajectories show fewer abnormal features, the results indicate that the method improves performance and can accurately detect as much abnormal data as possible.", "venue": "Journal of Marine Science and Engineering", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-06-01", "journal": {"name": "Journal of Marine Science and Engineering"}, "authors": [{"authorId": "2148932296", "name": "S. Guo"}, {"authorId": "9257358", "name": "J. Mou"}, {"authorId": "2108482870", "name": "Linying Chen"}, {"authorId": "2158171270", "name": "Pengfei Chen"}], "citations": [{"paperId": "24a70007b9011dca4c0ee6369bc53ab44125c052", "title": "Regional ship behavior and trajectory prediction for maritime traffic management: A social generative adversarial network approach"}, {"paperId": "4ff256f54f3fd036033a7e54706c15128a992f9e", "title": "Harnessing the power of Machine learning for AIS Data-Driven maritime Research: A comprehensive review"}, {"paperId": "4c8cdad32c71848c60e069a3b73332f1df0d042b", "title": "Navigational Anomaly Detection using a Traffic Network Model"}, {"paperId": "85deaeeacf6d342c5abd13f87b9833ab55903dd4", "title": "Graph-Based Anomaly Detection of Ship Movements Using CCTV Videos"}, {"paperId": "9fe30d0d49ad5ec27dc058cff10346c4fe86a7f4", "title": "Graph Signal Variation Detection: A novel approach for identifying and reconstructing ship AIS tangled trajectories"}, {"paperId": "66690479b0115b5939c8e04cf36955641fba265a", "title": "Comparison of Simulated and Measured Power of the Earth-Space Link for Satellite-Based AIS Signals"}, {"paperId": "6e486e76956b9a7f624293da28d18e95abfe0624", "title": "Ship Trajectory Prediction: An Integrated Approach Using ConvLSTM-Based Sequence-to-Sequence Model"}, {"paperId": "52d1827271187f0a6d72bfc675540075c51c6e82", "title": "Maritime Anomaly Detection for Vessel Traffic Services: A Survey"}, {"paperId": "6d08438723b6ff246796c3849e93d4c2da5bb958", "title": "A Deep Learning Model for Ship Trajectory Prediction Using Automatic Identification System (AIS) Data"}, {"paperId": "344e3098807e0697ac9ed8f31d593a2d1e4cf244", "title": "Interpolation-Based Inference of Vessel Trajectory Waypoints from Sparse AIS Data in Maritime"}, {"paperId": "2decc22be81e8c02a5ebf44c56a7ed77e78b89cf", "title": "Some methods for addressing errors in static AIS data records"}, {"paperId": "c9dd429b26c6f49c5a0693489e2f3cde70f12f11", "title": "Collision Risk Situation Clustering to Design Collision Avoidance Algorithms for Maritime Autonomous Surface Ships"}, {"paperId": "e20196774c96863cb4f77b46ab92521860e1fa9b", "title": "A novel machine learning approach to analyzing geospatial vessel patterns using AIS data"}, {"paperId": "0f47a5797fc4c5e11b672053b226b0699b19096a", "title": "A Semi-Supervised Methodology for Fishing Activity Detection Using the Geometry behind the Trajectory of Multiple Vessels"}, {"paperId": "fc8073e7ed83b9e75f2e49eb67f98f9c820e0468", "title": "Research on Ship Trajectory Classification Based on a Deep Convolutional Neural Network"}, {"paperId": "fa94c17eff199331d201301658ef49a8e3f571a8", "title": "Anomaly Detection in Maritime AIS Tracks: A Review of Recent Approaches"}, {"paperId": "53498822e657b2c134a3d0f3fb6b8deb0452f31f", "title": "Navigation Situation Clustering Model of Human-Operated Ships for Maritime Autonomous Surface Ship Collision Avoidance Tests"}]}
