{"paperId": "bece7ca4c22d7bfbcfc6cc3811f05c056bb06f4f", "publicationVenue": {"id": "c5bf303c-755d-459f-9ef2-21d06779f974", "name": "Open Research Europe", "type": "journal", "alternate_names": ["Open Res Eur"], "issn": "2732-5121", "url": "https://open-research-europe.ec.europa.eu/"}, "title": "A survey of security, privacy and trust issues in vehicular computation offloading and their solutions using blockchain.", "abstract": "Continuous improvement in transportation systems and smart vehicles' appearance make new highly intensive applications. Complex applications need high-performance capabilities, real-time responses, and generate massive amounts of data to process and exchange. This presents the idea of vehicular edge computing (VEC), which is proposed to handle complex applications and satisfy smart vehicle processing requirements. VEC enables computation offloading to an edge server to reduce communication latency, execution cost and energy consumption greatly. However, offloading to another node opens up new vulnerabilities regarding security and privacy. Moreover, trust issues in such an untrustworthy environment need an effective trust management solution and incentive mechanisms to improve overall security. This will increase the computation offloading success rate and the vehicles' willingness to share their resources. Particularly given the high transportability and heterogeneity of vehicular networks, the conventional security and trust management methods are inadequate. Blockchain, the rapidly emerging trend technology, is a unique solution that can help overcome security and privacy issues and meet trust management and incentive mechanism goals. Blockchain’s immutable distributed ledger, traceability, consensus validation system and smart contract features can improve vehicular network security. Although most research is focused on enhancing the performance of computation offloading algorithms, blockchain security solutions in computation offloading scenarios are not fully discussed. Thus, security and trust issues related to computation offloading in VEC environments need more consideration since supporting the new complex vehicular applications is essential. Therefore, this paper provides a review of recent surveys and studies, an overview of VEC, computation offloading and blockchain, in addition to discussing security, privacy and trust in vehicular networks and computation offloading while considering blockchain as a distributed security solution. We propose a new paradigm called blockchain edge of vehicle (BEoV) at the end, which enables several blockchain-based security services for vehicular computation offloading in particular.", "venue": "Open Research Europe", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2023-07-07", "journal": {"name": "Open Research Europe", "volume": "3"}, "authors": [{"authorId": "150295563", "name": "S. Y. Fayi"}, {"authorId": "143876012", "name": "Zhengguo Sheng"}], "citations": []}
