{"paperId": "bece4dfcd4a9d20655ea6a8cdcfd0d416c201292", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Applying Real-Time Travel Times to Estimate Fire Service Coverage Rate for High-Rise Buildings", "abstract": "Frequent high-rise building fires have posed serious threats to urban public safety. In this study, real-time travel times extracted from online maps were applied to estimate fire service coverage rates for high-rise buildings. Firstly, the minimum fire apparatus requirement for high-rise building “at least 1 water fire truck and 1 aerial fire truck should arrive at the fire scene of high-rise building within 240 s” was proposed. Then, a dynamic estimation model of fire service coverage rate for high-rise buildings was established. To validate the model, 5146 high-rise buildings, 61 water fire trucks, and 56 aerial fire trucks in Changsha were selected as case studies. The results show that the total effective coverage rate and total average travel time in Changsha are 20.43% and 421.95 s, respectively. There are 10,840 water fire trucks and 6192 aerial fire trucks in China. Based on the average number of water fire trucks and aerial fire trucks per high-rise building, it can be estimated that the total effective coverage rate in China may not exceed 60.00%. Due to limited fire resources and frequent traffic congestion, only partial high-rise buildings can be effectively covered by fire services, whether in Changsha or China.", "venue": "Applied Sciences", "year": 2020, "fieldsOfStudy": ["Environmental Science"], "publicationTypes": null, "publicationDate": "2020-09-23", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "48928851", "name": "Dingli Liu"}, {"authorId": "48559964", "name": "Zhisheng Xu"}, {"authorId": "2110307909", "name": "Long Yan"}, {"authorId": "2148954262", "name": "Feiyue Wang"}], "citations": [{"paperId": "c9655d5b57786b5e4b2cb86619138e1957a4c172", "title": "Optimization of new fire department location using an improved GIS algorithm for firefighters travel time estimation"}, {"paperId": "cd7179bba99b8e46f12aac7f7251af381a9caf74", "title": "STUDY OF FIRE LOCATION TIME IN HIGH-STORY BUILDINGS IN CITIES OF UKRAINE"}, {"paperId": "6f59b7c81a60718f0654047cc2d1377b015a7b27", "title": "FSLens: A Visual Analytics Approach to Evaluating and Optimizing the Spatial Layout of Fire Stations"}, {"paperId": "b4cf82fce88c19b65e63f854ac6442c1b4d7f537", "title": "Integrating Space Syntax and Location-Allocation Model for Fire Station Location Planning in a China Mega City"}, {"paperId": "ed742735a113f074a8369da4283acd794c03d24f", "title": "Study on Group Movement Characteristics in Stairwell of High-Rise Buildings"}, {"paperId": "0ba3f90e72657160136b3fb973cce70c47bbfabe", "title": "Hydrothermal synthesis of an expanded perlite based lightweight composite for indoor humidity regulating"}, {"paperId": "54588899ae563d53a709af1469ccf4d1d84b8eb0", "title": "Identifying fire safety in hospitals: Evidence from Changsha, China"}, {"paperId": "e1f339f2386d71d794e7608c82cf47f8a2b1c259", "title": "Monitoring and Prediction of Fire Water System Based on Wireless Detection Method"}, {"paperId": "ea04938fb04cef7aa32ce2752a9517f4a364a36b", "title": "Selecting The Best Route for Aerial Ladder Truck to Speed Up Response Time in High-Rise Buildings Located in Unprotected and High Fire Risk Areas"}, {"paperId": "bb3942d4cc4c770f5182965f71cd0378174075cb", "title": "Comprehensive Analysis of Housing Estate Infrastructure in Relation to the Passability of Firefighting Equipment"}, {"paperId": "c99e4a523fdca61927212aaa1b9829208df7fd65", "title": "Analyzing accessibility to fire stations: A floating catchment area model for stochastic transportation networks with travel time correlation"}, {"paperId": "69b521282b96c65cbe1d51458d86000993bf6329", "title": "Evaluating spatial configuration of fire stations based on real-time traffic"}]}
