{"paperId": "bedbece27165836ff224eb4a999259588210e873", "publicationVenue": {"id": "312ca99c-9149-490d-813e-c60d5e949f65", "name": "Concurrency and Computation", "type": "journal", "alternate_names": ["Concurr Comput Pract Exp", "Concurrency and Computation: Practice and Experience", "Concurr Comput"], "issn": "1532-0626", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/77004395?CRETRY=1&SRETRY=0", "alternate_urls": ["http://www3.interscience.wiley.com/cgi-bin/jtoc?ID=77004395", "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1532-0634"]}, "title": "Load balancing techniques for fog computing environment: Comparison, taxonomy, open issues, and challenges", "abstract": "Load balancing (LB) is nothing but the systematic distribution of load over different servers. The fog server is handling the maximum data of the cloud server to enhance the advancement of users' requests. The growth in data requests is escalating, and fog computing has intensified the accessibility of the data. Fog computing achieves many challenges according to the demands of the users, but even so, some challenges require more progress. The problem faced by fog computing is LB due to an increase in traffic on the network layer. Various LB techniques have already been proposed in the cloud layer, but until now they have only been in progress in the fog layer. Inefficient LB may cause a decrease in service quality, like delays in response time, processing time, security, and many more. In this survey, several algorithms have been discussed that are based on LB, which works out the issue of overloaded data on the network. Some parameters that authors have focused in LB are latency, bandwidth, deadlines, cost, security, execution time, and response time. Other parameters based on fault tolerance are also discussed with their quality parameter table and algorithm. In addition to this some of the limitations of the author's work, that is discussed in this article.", "venue": "Concurrency and Computation", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-07-18", "journal": {"name": "Concurrency and Computation: Practice and Experience", "volume": "34"}, "authors": [{"authorId": "1577016380", "name": "Vijaita Kashyap"}, {"authorId": "143843823", "name": "Ashok Kumar V"}], "citations": [{"paperId": "920f0c3037356e061cfae3e62d5847689b5bf5e4", "title": "Adaptive multi-criteria-based load balancing technique for resource allocation in fog-cloud environments"}, {"paperId": "6c0a9395b11977b7b82673e5443f3f15aea85b9d", "title": "Minimal channel cost‐based energy‐efficient resource allocation algorithm for task offloading under FoG computing environment"}, {"paperId": "598ebdac6b3922f0f81529a8f89f341ef8652c43", "title": "Pelican optimization algorithm with blockchain for secure load balancing in fog computing"}, {"paperId": "08392238892c6578a1184564c523e30c0bb6432b", "title": "A reinforcement learning-based load balancing algorithm for fog computing"}, {"paperId": "a0b2cf08280cf5f2daa370d197417716b247e148", "title": "SDAFA: Secure Data Aggregation in Fog-Assisted Smart Grid Environment"}, {"paperId": "3aa52c345e4e282678ffe0f6a62feb93cfb52148", "title": "A taxonomy of load balancing algorithms and approaches in fog computing: a survey"}, {"paperId": "bb13187224bb49ac551e08a042a6be27e9023902", "title": "Nature Inspired Meta-Heuristic Algorithms based Load Balancing in Fog Computing Environment"}]}
