{"paperId": "bee43cc2e7c64fd0083571bf4f0899cc0c61baaf", "publicationVenue": {"id": "a8317433-c810-4baa-953c-54c0b2433acb", "name": "Learning and Nonlinear Models", "type": "journal", "alternate_names": ["Learn Nonlinear Model"], "issn": "1676-2789", "url": "http://www.deti.ufc.br/~lnlm/?x=1&x=1"}, "title": "Detection and Segmentation of Damaged Photovoltaic Panels Using Deep Learning and Fine-tuning in Images Captured by Drone", "abstract": "Energy consumption is a direct impact factor in various sectors of society. Different technologies for energy generation are based on renewable sources and used as alternatives to the consumption of finite resources. Among these technologies, photovoltaic panels represent an efficient solution for energy generation and an option for sustainable consumption. The problem of damaged panels brings numerous problems in energy generation, from the interruption of generation to losses through financial investments. The proposed study presents an efficient model based on deep learning for detection and different models based on fine-tuning for the segmentation of damaged photovoltaic panels. The use of the Detectron2 convolutional network obtained 78% of Accuracy for detection and 95% precision in the detectable panels, also obtaining 99.91% for the segmentation problem of photovoltaic panels in the best-generated model in this study. The proposed model showed great effectiveness for panel detection and segmentation, surpassing works found in the literature.", "venue": "Learning and Nonlinear Models", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-12-31", "journal": {"name": "Learning and Nonlinear Models"}, "authors": [{"authorId": "1557275313", "name": "L. F. D. F. Souza"}, {"authorId": "2146734805", "name": "T. M. Castro"}, {"authorId": "2109442252", "name": "L. D. O. Santos"}, {"authorId": "1660943807", "name": "A. G. Marques"}, {"authorId": "2181527480", "name": "J. C. Nascimento"}, {"authorId": "2184570065", "name": "Matheus Araujo dos Santos"}, {"authorId": "2184351755", "name": "G. F. B. Severiano"}, {"authorId": "121439049", "name": "P. P. Rebouças Filho"}], "citations": []}
