{"paperId": "befa664fb32b772d611ef19af8cc33e257d2bc5a", "publicationVenue": {"id": "d5e0c47e-1f80-41d8-a565-44d86b990db3", "name": "Frontiers in Veterinary Science", "type": "journal", "alternate_names": ["Front Vet Sci"], "issn": "2297-1769", "url": "https://www.frontiersin.org/journals/veterinary-science", "alternate_urls": ["http://journal.frontiersin.org/journal/veterinary-science", "http://www.frontiersin.org/Veterinary_Science"]}, "title": "Viral skin diseases in odontocete cetaceans: gross, histopathological, and molecular characterization of selected pathogens", "abstract": "Fifty-five skin lesions from 31 stranded cetaceans along the Canary coasts (2011–2021) were submitted to macroscopic, histological, and molecular analyses to confirm infection by cetacean poxvirus, herpesvirus and cetacean morbillivirus. They were macroscopically categorized into eight categories with respective subcategories according to their color, shape, size, and consistency. Cetacean poxvirus was detected in 54.54% of the skin lesions through real-time and conventional PCRs based on the DNA polymerase gene. Additionally, herpesvirus and morbillivirus were currently detected from 43.63 and 1.82% of the cutaneous lesions, respectively. Coinfection of poxvirus and herpesvirus was detected in nine of them (16.36%), which makes the present study the first to report coinfection by both pathogens in skin lesions in cetaceans. A plausible approach to histopathological characterization of poxvirus-and herpesvirus-positive skin lesions was established. Hyperkeratosis, acanthosis, ballooning degeneration, and intracytoplasmic inclusion bodies in vacuolized keratinocytes through the stratum spinosum were common findings in poxvirus skin lesions. Alphaherpesvirus was associated with a prominent acanthotic epidermis, moderate necrosis, multifocal dyskeratosis, and irregular keratinocytes with both cellular and nuclei pleomorphism. The common histopathological findings of both pathogens were observed in coinfection lesions. However, those associated with herpesvirus were considerably more remarkable. Relationships between molecular and microscopic findings were observed for the lesions that showed tattoo-like and tortuous patterns. Further multidisciplinary diagnostic studies of infected skin lesions are needed to understand the epidemiology of these emerging infectious diseases.", "venue": "Frontiers in Veterinary Science", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-08", "journal": {"name": "Frontiers in Veterinary Science", "volume": "10"}, "authors": [{"authorId": "1999745295", "name": "Simone Segura-Göthlin"}, {"authorId": "152531633", "name": "Antonio Fernández"}, {"authorId": "2595766", "name": "M. Arbelo"}, {"authorId": "2238744486", "name": "Marisa Ana Andrada Borzollino"}, {"authorId": "1412906445", "name": "Idaira Felipe-Jiménez"}, {"authorId": "2117496480", "name": "Ana Colom-Rivero"}, {"authorId": "2238742954", "name": "Carla Fiorito"}, {"authorId": "2650797", "name": "E. Sierra"}], "citations": []}
