{"paperId": "bf0008d1b521be0c96bb34e8de78dd404ad37099", "publicationVenue": {"id": "dc7bc1cd-de58-4eb5-917f-e5b0560fe0c0", "name": "IEEE/SICE International Symposium on System Integration", "type": "conference", "alternate_names": ["SII", "IEEE/SICE Int Symp Syst Integr"]}, "title": "Interactively Robot Action Planning with Uncertainty Analysis and Active Questioning by Large Language Model", "abstract": "The application of the Large Language Model (LLM) to robot action planning has been actively studied. The instructions given to the LLM by natural language may include ambiguity and lack of information depending on the task context. It is possible to adjust the output of LLM by making the instruction input more detailed however the design cost is high. In this paper we propose the interactive robot action planning method that allows the LLM to analyze and gather missing information by asking questions to humans. The method can minimize the design cost of generating precise robot instructions. We demonstrated the effectiveness of our method through concrete examples in cooking tasks. However our experiments also revealed challenges in robot action planning with LLM such as asking unimportant questions and assuming crucial information without asking. Shedding light on these issues provides valuable insights for future research on utilizing LLM for robotics", "venue": "IEEE/SICE International Symposium on System Integration", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-30", "journal": {"name": "2024 IEEE/SICE International Symposium on System Integration (SII)", "pages": "85-91"}, "authors": [{"authorId": "2035759154", "name": "Kazuki Hori"}, {"authorId": "2118679169", "name": "Kanata Suzuki"}, {"authorId": "2066294907", "name": "T. Ogata"}], "citations": [{"paperId": "a3570e82001666955d319647ba832df4f60a2044", "title": "A Survey on Robotics with Foundation Models: toward Embodied AI"}, {"paperId": "4e0fbb5babf75e5d45efdaac6e9504cf7479ff3f", "title": "Deep Predictive Learning : Motion Learning Concept inspired by Cognitive Robotics"}]}
