{"paperId": "bf00193f41a7d51188fc9341176b6bccff032b07", "publicationVenue": {"id": "027ffd21-ebb0-4af8-baf5-911124292fd0", "name": "bioRxiv", "type": "journal", "url": "http://biorxiv.org/"}, "title": "Adaptive therapy in cancer: the role of restrictions in the accumulation of mutations", "abstract": "BACKGROUND Cancer is currently one of the leading causes of premature death in the world, and is predicted to continue rising even despite the continuous discovery of novel treatments. New approaches, like adaptive therapy, try to minimize the problem of drug resistance, but there are still many open questions and unstudied phenomena that need to be tackled in order to make this approaches viable in real patients; among these, the possible effects that restrictions in the order of accumulation of mutations could have. RESULTS We have developed a spatially explicit agent-based model capable of simulating tumor growth and adaptive therapy in a highly flexible way. We show that when we consider restrictions in the order of accumulation of mutations and their effect in tumor architecture, the predicted genotypes of the cells that are inhibiting the growth of resistant cells can be very different to the ones predicted by perfectly mixed models. CONCLUSION We identify a divergence between the expected and real genotypes of the cells inhibiting the growth of the resistant population that has not been previously documented. This effect, if not taken into account, could negatively affect our predictions of adaptive therapy success and could hinder our advances in the development of new approaches to improve adaptive therapy. This discovery suggests the need for more studies that take into account the spatial component of cancer, specially when dealing with tumors with high heterogeneity. Furthermore, our model is able to simulate scenarios of tumor development and adaptive therapy, making it useful both for research and for education.", "venue": "bioRxiv", "year": 2023, "fieldsOfStudy": ["Biology"], "publicationTypes": null, "publicationDate": "2023-05-24", "journal": {"name": "bioRxiv"}, "authors": [{"authorId": "2218151536", "name": "David Fontaneda"}, {"authorId": "1401336860", "name": "R. Díaz-Uriarte"}], "citations": []}
