{"paperId": "bf028f23afff7dc240bde064a3733c137271d629", "publicationVenue": {"id": "9cb07641-bdf7-4828-bf9d-667b1251e283", "name": "International Symposium on the Physical and Failure Analysis of Integrated Circuits", "type": "conference", "alternate_names": ["IPFA", "Int Symp Phys Fail Anal Integr Circuit"]}, "title": "Hybrid Unsupervised Clustering for Pretext Distribution Learning in IC Image Analysis", "abstract": "Delayered integrated circuit image analysis is an important step in hardware assurance, which is typically performed by automated approaches such as deep learning. The data dependent deep learning techniques require a diverse set of training data containing most of the variations in the delayered circuit images to perform well, which can be highly challenging to curate. In this paper, we present a hybrid unsupervised clustering method that aims to learn the distribution of newly acquired circuit image datasets, to aid the subsequent analysis flow. Our method consists of a deep learning-based feature extractor stage and a feature clustering stage, and we evaluate the performance of several feature extraction networks and clustering algorithms. Experimental results show that our method could obtain a promising normalized mutual information (NMI) score of 0.6095 on a dataset of delayered IC images taken of a manufactured Integrated Circuit (IC), and demonstrates excellent ability to retrieve visually similar images when provided with query images.", "venue": "International Symposium on the Physical and Failure Analysis of Integrated Circuits", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-07-18", "journal": {"name": "2022 IEEE International Symposium on the Physical and Failure Analysis of Integrated Circuits (IPFA)", "pages": "1-6"}, "authors": [{"authorId": "2186181866", "name": "Yee-Yang Tee"}, {"authorId": "1794137", "name": "Xuenong Hong"}, {"authorId": "121864500", "name": "Deruo Cheng"}, {"authorId": "2109626498", "name": "Tong Lin"}, {"authorId": "3274370", "name": "Yiqiong Shi"}, {"authorId": "144725411", "name": "B. Gwee"}], "citations": [{"paperId": "fe1e3bc171fd5e8df03f3e04262293f05e9874cc", "title": "A Strategic Framework for Evaluating Data Augmentation in Microscopic IC Image Analysis"}]}
