{"paperId": "bf0751eb050f32383348ee749e9e155e77b25faf", "publicationVenue": {"id": "1620da87-4387-4b9a-9bf4-22fdf74d4dc3", "name": "Symmetry", "type": "journal", "issn": "2073-8994", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172134", "alternate_urls": ["https://www.mdpi.com/journal/symmetry", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172134"]}, "title": "Automatically Detecting Excavator Anomalies Based on Machine Learning", "abstract": "Excavators are one of the most frequently used pieces of equipment in large-scale construction projects. They are closely related to the construction speed and total cost of the entire project. Therefore, it is very important to effectively monitor their operating status and detect abnormal conditions. Previous research work was mainly based on expert systems and traditional statistical models to detect excavator anomalies. However, these methods are not particularly suitable for modern sophisticated excavators. In this paper, we take the first step and explore the use of machine learning methods to automatically detect excavator anomalies by mining its working condition data collected from multiple sensors. The excavators we studied are from Sany Group, the largest construction machinery manufacturer in China. We have collected 40 days working condition data of 107 excavators from Sany. In addition, we worked with six excavator operators and engineers for more than a month to clean the original data and mark the anomalous samples. Based on the processed data, we have designed three anomaly detection schemes based on machine learning methods, using support vector machine (SVM), back propagation (BP) neural network and decision tree algorithms, respectively. Based on the real excavator data, we have carried out a comprehensive evaluation. The results show that the anomaly detection accuracy is as high as 99.88%, which is obviously superior to the previous methods based on expert systems and traditional statistical models.", "venue": "Symmetry", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-07-30", "journal": {"name": "Symmetry", "pages": "957", "volume": "11"}, "authors": [{"authorId": "1820928370", "name": "Qingqing Zhou"}, {"authorId": "2155230069", "name": "Guo Chen"}, {"authorId": "144662653", "name": "Wenjun Jiang"}, {"authorId": "145730774", "name": "Kenli Li"}, {"authorId": "2181606", "name": "Keqin Li"}], "citations": [{"paperId": "53dc362297274c4b65c27204f7eb7715242bd9cb", "title": "Vision-Based Activity Classification of Excavators by Bidirectional LSTM"}, {"paperId": "c270077fd44fdfeb40a043bbd3dcaa995d0fb0cd", "title": "An IoT System for Real-Time Monitoring of DC Motor Overload"}, {"paperId": "3de2edd1d4d1f779569e5948a96718645ba97c37", "title": "Fault diagnosis of various rotating equipment using machine learning approaches – A review"}, {"paperId": "593b369e65354e008095f29731c0e9e4d8e795f2", "title": "Developing an on-Line Machine-Status Monitoring System using Vibrations Analysis"}]}
