{"paperId": "bf0843e84b142534dd7adf44f2af76d432fdd440", "publicationVenue": {"id": "1cbe6039-ff71-4a80-8c5d-2d5ac4447b53", "name": "Microorganisms", "issn": "2076-2607", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-333845", "alternate_urls": ["http://resolver.sub.uni-goettingen.de/purl?gs-1/14875", "https://www.mdpi.com/journal/microorganisms", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-333845"]}, "title": "Current Scenario and Challenges in the Direct Identification of Microorganisms Using MALDI TOF MS", "abstract": "MALDI TOF MS-based microbial identification significantly lowers the operational costs because of minimal requirements of substrates and reagents for extraction. Therefore, it has been widely used in varied applications such as clinical, food, military, and ecological research. However, the MALDI TOF MS method is laced with many challenges including its limitation of the reference spectrum. This review briefly introduces the background of MALDI TOF MS technology, including sample preparation and workflow. We have primarily discussed the application of MALDI TOF MS in the identification of microorganisms. Furthermore, we have discussed the current trends for bioaerosol detection using MALDI TOF MS and the limitations and challenges involved, and finally the approaches to overcome these challenges.", "venue": "Microorganisms", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2021-09-01", "journal": {"name": "Microorganisms", "volume": "9"}, "authors": [{"authorId": "2152630473", "name": "Sang-Soo Han"}, {"authorId": "1999584624", "name": "Young-Su Jeong"}, {"authorId": "153079363", "name": "Sunkyung Choi"}], "citations": [{"paperId": "d88230b5b45d442be058621ba88dfae5b9ac81b6", "title": "Breaking barriers in Candida spp. detection with Electronic Noses and artificial intelligence"}, {"paperId": "83d769c8046376fbc377018f9c75f7df2d180b23", "title": "Nano-Biotechnology for Bacteria Identification and Potent Anti-bacterial Properties: A Review of Current State of the Art"}, {"paperId": "f639f3f4382ebc549030d50aad5bb2c5b72b7de3", "title": "Comprehensive insights into advances in ambient bioaerosols sampling, analysis and factors influencing bioaerosols composition."}, {"paperId": "07e3716e758576e7628c1457b04ac87974c5ed70", "title": "A systematic assessment of matrix-assisted laser desorption/ionization time of flight mass spectrometry (MALDI-TOF MS) application for rapid identification of pathogenic microbes that affect food crops: delivered and future deliverables"}, {"paperId": "69b4a6fdfeb063289740fa5328acdf4cb130f31d", "title": "Recent progress in online detection methods of bioaerosols"}, {"paperId": "89b933c1ff8a373dd72aeeccac30c5e47f1391e6", "title": "MALDI-TOF MS Indirect Beta-Lactamase Detection in Ampicillin-Resistant Haemophilus influenzae"}, {"paperId": "fae6327266d0f149d537a29fb0234d054693c911", "title": "Isolation and Identification of a Bacillus sp. from Freshwater Sediment Displaying Potent Activity Against Bacteria and Phytopathogen Fungi"}, {"paperId": "e02cf3bc255133ab0883dd6c4d457d6c1d12c399", "title": "RamanNet: a lightweight convolutional neural network for bacterial identification based on Raman spectra"}, {"paperId": "3911879ca896c545fad11fec8dc629a16cf0e672", "title": "Probiotic properties of Bacillus strains isolated from the gastrointestinal tract against pathogenic Vibriosis"}, {"paperId": "0a30ec6989c98c704b34e15388f87170a136c1d8", "title": "MALDI-TOF Mass Spectrometry in Clinical Analysis and Research"}, {"paperId": "076376d9773ce62377ac2c65cc7bd97fcb015287", "title": "Current Scenario of Pathogen Detection Techniques in Agro-Food Sector"}, {"paperId": "e7a95de54e825e4f4cc7640e469e7fda421694c0", "title": "Biosensors for rapid detection of bacterial pathogens in water, food and environment."}, {"paperId": "32102006d9699ace8ab90b724b34194bc36f5a14", "title": "Metabolomics Research in Periodontal Disease by Mass Spectrometry"}, {"paperId": "fc2852b6942ecac75893f51a4298d651fad6db7a", "title": "MALDI-TOF Mass Spectrometry Analysis and Human Post-Mortem Microbial Community: A Pilot Study"}, {"paperId": "29db8493848dfec4a298332cc1f1ff70efe0c3b0", "title": "MALDI-Based Mass Spectrometry in Clinical Testing: Focus on Bacterial Identification"}, {"paperId": "f72f528718e5dd6420d6123dc8fa262e075fb413", "title": "Revealing the Yeast Diversity of the Flor Biofilm Microbiota in Sherry Wines Through Internal Transcribed Spacer-Metabarcoding and Matrix-Assisted Laser Desorption/Ionization Time of Flight Mass Spectrometry"}, {"paperId": "ae1b2dd289dc409b25dedd947c47579d93224f2d", "title": "The Role of a Rapid Prevention of Ralstonia pickettii Growth during Dialysis in a Frail Patient"}, {"paperId": "3e72f8dee9c2f87393071410f760038970688fed", "title": "A Simple Method for Generating Narrowly-dispersed Bioaerosols in Various Sizes"}]}
