{"paperId": "bf0fdbaf181f74e55caf2535c8f3d9299066d156", "publicationVenue": {"id": "011e0c39-7f47-401e-98d2-ee08fdf206a3", "name": "Library hi tech", "type": "journal", "alternate_names": ["Libr Hi Tech", "Library Hi Tech", "Libr hi tech"], "issn": "0737-8831", "url": "https://www.emerald.com/insight/publication/issn/0737-8831"}, "title": "Internet of Things-based intelligent evacuation protocol in libraries", "abstract": "\nPurpose\nThe purpose of this paper is to propose a theoretical framework of applying the Internet of Things (IoT) technologies to the intelligent evacuation protocol in libraries at emergency situations.\n\n\nDesign/methodology/approach\nThe authors conducted field investigations on eight libraries in Wuhan, China, analyzed the characteristics of crowd gathering in libraries and the problems of the libraries’ existing evacuation plans. Therefore, an IoT-based intelligent evacuation protocol in libraries was proposed. Its basic structure consisted of five components: the information base, the protocol base, the IoT sensors, the information fusion system and the intelligent evacuation protocol generation system. In the information fusion system, Dempster–Shafer (D-S) evidence theory was employed as the information fusion algorithm to fuse the multi-sensor information at multiple time points, so as to reduce the uncertainty of disaster prediction. The authors also conducted a case study on the Library L in Wuhan, China. A specific evacuation route was generated for a fire and the crowd evacuation was simulated by the software Patherfind.\n\n\nFindings\nThe proposed IoT-based evacuation protocol has four distinguishing features: scenario corresponding, precise evacuation, dynamic correction and intelligent decision-making. The case study shows that the proposed protocol is feasible in practice, indicating that the IoT technologies have great potential to be successfully applied to the safety management in libraries.\n\n\nResearch limitations/implications\nThe software and hardware requirements as well as the Internet network requirements of IoT technologies need to be further discussed.\n\n\nPractical implications\nThe proposed IoT-based intelligent evacuation protocol can be widely used in libraries, which is one of the inspirations for the use of IoT technologies in modern constructers.\n\n\nOriginality/value\nThe application of IoT technologies in libraries is a brand-new topic that has drawn much attention in academia recently. The crowd safety management in libraries is of great significance, and there is little professional literature on it. This paper proposes an IoT-based intelligent evacuation protocol, aiming at improving the safety management in libraries at emergency situations.\n", "venue": "Library hi tech", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-01-11", "journal": {"name": "Libr. Hi Tech", "pages": "145-163", "volume": "38"}, "authors": [{"authorId": "2953008", "name": "Kefan Xie"}, {"authorId": "49293108", "name": "Zimei Liu"}, {"authorId": "2213909", "name": "Liuliu Fu"}, {"authorId": "51098973", "name": "Benbu Liang"}], "citations": [{"paperId": "16a1cee211d91159a6fb04b039685eb004ec901b", "title": "IoT-Inspired Smart Disaster Evacuation Framework"}, {"paperId": "f632ab15c3017efc1e6f2a37ab93eedf26ca2ba7", "title": "Smart library architecture based on internet of things (IoT) and software defined networking (SDN)"}, {"paperId": "bc2daa7f7beb61bc027ffe28c20e3dd4368351d9", "title": "Factors influencing the adoption of Internet of Things (IoT) in university libraries: a systematic literature review (SLR)"}, {"paperId": "a58d4c60914ad99046e15abdf27227159062260a", "title": "From traditional to emerging technologies in supporting smart libraries. A bibliometric and thematic approach from 2013 to 2022"}, {"paperId": "516474eaee1bf150fae97e50185df479fc9793ba", "title": "ChatGPT and the AI revolution: a comprehensive investigation of its multidimensional impact and potential"}, {"paperId": "36850612ffc9ffc395e89dc8b39760b885bd55cf", "title": "Applications of Internet of Things in university libraries of Pakistan: An empirical investigation"}, {"paperId": "9f1a933095e05318be5e68f48eaf8223bb462e38", "title": "Access, organize and communicate: the strategic use of browser plugins in libraries"}, {"paperId": "7ea7c54d81f7df64744df060b0899a116b2b4fed", "title": "Moving from Industry 4.0 to Industry 5.0: What Are the Implications for Smart Logistics?"}, {"paperId": "1bc4e17fef9860bbc7b4b902208c78a141b67407", "title": "A review of logistics Internet-of-Things: Current trends and scope for future research"}, {"paperId": "7a5860ada4e84c60fe83ba4a8a5afade32365688", "title": "Development in building fire detection and evacuation system-a comprehensive review"}, {"paperId": "5fc5f9c7fc4162470d6c6f532f279a9c055fea92", "title": "Analysis of Walking-Edge Effect in Train Station Evacuation Scenarios: A Sustainable Transportation Perspective"}, {"paperId": "c2a20f614871b4c50024738648693b185694aeb8", "title": "SWOT Analysis of Internet of Things in the Library and Information Science Environment"}, {"paperId": "284f2efdcaebe4203845281ffcefaec96a5ef03b", "title": "Industry Revolutions Development from Industry 1.0 to Industry 5.0 in Manufacturing"}, {"paperId": "1bb2827a570246f1625e1abe4e464eb0a3d234fa", "title": "The role of Industry 4.0 enabling technologies for safety management: A systematic literature review"}, {"paperId": "5e255ece0d4f261f2a577af604357be5efc0522c", "title": "Use and management of information systems in academic libraries in Ghana"}]}
