{"paperId": "bf13466fc1ce548817bd70b15de5ab8d9841e827", "publicationVenue": {"id": "bf423a33-5d7d-45da-9805-bac01a3288aa", "name": "International Conference on Information Systems for Crisis Response and Management", "type": "conference", "alternate_names": ["Int Conf Inf Syst Crisis Response Manag", "ISCRAM"], "url": "https://iscram.org/taxonomy/term/14"}, "title": "Enabling Participatory Flood Monitoring Through Cloud Services", "abstract": "Flooding events are more impactful due to climate change, while traditional top-down approaches to flood management give way to new initiatives that consider citizens and communities as active strategic actors. Researchers and practitioners have started to place communities in the centre of creation processes or invite them to co-design digital platforms. However, many citizen science projects re-use well-known technological components without reflecting about how the technology is able to effectively support citizen participation in data generation, including the provision of flexible data storage and exchange. This paper describes a novel digital platform design which adopts cloud services to integrate official and citizen-generated data about urban flooding. It summarises the results of a participatory design process of a digital platform to collect, store and exchange flood-related data, which includes components such as data lakes, Application Programming Interfaces (APIs), and web and mobile interfaces. This work in progress paper presents insights and lessons learned from using cloud services to enable citizen participation and engage communities with flood monitoring", "venue": "International Conference on Information Systems for Crisis Response and Management", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"pages": "213-223"}, "authors": [{"authorId": "121207531", "name": "D. Grajales"}, {"authorId": "2475306", "name": "L. Degrossi"}, {"authorId": "2064635990", "name": "Daniel Barros"}, {"authorId": "2190473416", "name": "Mohammed Rizwan Khan"}, {"authorId": "1403139177", "name": "Fernanda Lima-Silva"}, {"authorId": "40504769", "name": "M. A. Cunha"}, {"authorId": "83639265", "name": "Rachel Trajber"}, {"authorId": "2908677", "name": "J. Albuquerque"}], "citations": [{"paperId": "646475361aec21acb924eee0830574df79b377b2", "title": "Dialogic data innovations for sustainability transformations and flood resilience: the case for Waterproofing Data"}]}
