{"paperId": "bf151b59fb45af4067162db590a25f1785c493e1", "publicationVenue": {"id": "0bf2c493-a93b-464a-b3d9-e18fbb4a7965", "name": "IEEE Computer Graphics and Applications", "type": "journal", "alternate_names": ["IEEE Comput Graph Appl"], "issn": "0272-1716", "url": "http://www.computer.org/cga/", "alternate_urls": ["https://ieeexplore.ieee.org/servlet/opac?punumber=38"]}, "title": "Capturing and Visualizing Provenance From Data Wrangling", "abstract": "Data quality management and assessment play a vital role for ensuring the trust in the data and its fitness-of-use for subsequent analysis. The transformation history of a data wrangling system is often insufficient for determining the usability of a dataset, lacking information how changes affected the dataset. Capturing workflow provenance along the wrangling process and combining it with descriptive information as data provenance can enable users to comprehend how these changes affected the dataset, and if they benefited data quality. We present DQProv Explorer, a system that captures and visualizes provenance from data wrangling operations. It features three visualization components: allowing the user to explore the provenance graph of operations and the data stream, the development of quality over time for a sequence of wrangling operations applied to the dataset, and the distribution of issues across the entirety of the dataset to determine error patterns.", "venue": "IEEE Computer Graphics and Applications", "year": 2019, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-11-01", "journal": {"name": "IEEE Computer Graphics and Applications", "pages": "61-75", "volume": "39"}, "authors": [{"authorId": "23166104", "name": "C. Bors"}, {"authorId": "2650477", "name": "T. Gschwandtner"}, {"authorId": "1692521", "name": "S. Miksch"}], "citations": [{"paperId": "8c93ba189dcab521acc2235beda592c0a89a6f2e", "title": "Teleoscope: Exploring Themes in Large Document Sets By Example"}, {"paperId": "634cfe1ae70692c470866f89f76006a2b76bf94f", "title": "Visualising category recoding and numeric redistributions"}, {"paperId": "f6cef708dd339776d959cdd15fb2172bf24beb84", "title": "XNLI: Explaining and Diagnosing NLI-based Visual Data Analysis"}, {"paperId": "9d4f80f4022f11f560268dbf8b62dd72cb0413a0", "title": "ShortcutLens: A Visual Analytics Approach for Exploring Shortcuts in Natural Language Understanding Dataset"}, {"paperId": "d95dfb8dfd18fa617547f1f2143256b39d1ad024", "title": "Machine Learning Methods to Estimate Productivity of Harvesters: Mechanized Timber Harvesting in Brazil"}, {"paperId": "4609fdad4efbb6952b197cc962d8b16284f1f225", "title": "DCM explorer: a tool to support transparent data cleaning through provenance exploration"}, {"paperId": "50d03d51e4cd67ca13e68041d05582b076e761f7", "title": "Smallset Timelines: A Visual Representation of Data Preprocessing Decisions"}, {"paperId": "d192dfa381b1c74015cd7801760307bc3f2d6233", "title": "Gravity++: A graph-based framework for constructing interactive visualization narratives"}, {"paperId": "73e50506e1062759c586476fb2748f7c346bec09", "title": "Visualizing the Scripts of Data Wrangling with SOMNUS"}, {"paperId": "1da8477eb2b7748107b5d9d7717bb68012ab5ddb", "title": "VALIDITY CHECKING OF PROVENANCE DATA FROM SOFTWARE DEVELOPMENT PROCESSES"}, {"paperId": "f2e5ed89c77cc54e95035bc32cdb82a295b5929e", "title": "ACMViz: a visual analytics approach to understand DRL-based autonomous control model"}, {"paperId": "b0ad7bfb7b4887a0669d22e64af7d4f10b12afc6", "title": "Software and Data Provenance as a Basis for eScience Workflow"}, {"paperId": "f24ec26a870a4165d86d17bbd0c22ec06343d30e", "title": "Datamations: Animated Explanations of Data Analysis Pipelines"}, {"paperId": "deeb1258396d281bdcdaded26f1f1a19973f2ad2", "title": "A survey of visual analytics techniques for machine learning"}, {"paperId": "e21447d542b08f26aa4c7e0954b9a55b3a54e97a", "title": "Survey on the Analysis of User Interactions and Visualization Provenance"}, {"paperId": "ce24fe7f843a0a5dfa644d977eccc1c356dd4dbf", "title": "Visual Learning Analytics for a Better Impact of Big Data"}, {"paperId": "ec67f218388630b6ed9dd304f542bd27f4b19bdd", "title": "Automated Profiling of Energy Data in Manufacturing"}, {"paperId": "e9a8f8ebaa1d8465027bd1bd6227c68451555e26", "title": "Visual Analytics System for Data Quality Improvement"}]}
