{"paperId": "bf1c9926fbeb4cb897d9ef29a173fb90d5a3c1e2", "publicationVenue": null, "title": "Joint Computation Resource Allocation Using Mobile-Edge-Platooning-Cloud in the Internet of Vehicles", "abstract": "With the rapid development of intelligent transportation, various computation-intensive applications have e-merged to improve the safety, efficiency, and comfort on the road. However, due to the mobility and resource dynamics, it is still a challenge for the resource-constrained vehicles to timely process computation-intensive tasks. Fortunately, the computation offloading in the Internet of Vehicles (IoV) greatly eases the contradiction between resource constraints and computing requirements. In this paper, we first present a collaborative computing architecture based on Edge-Cloud (EC) and Mobile-Edge-Platooning-Cloud (MEPC). Then, considering the priority of the Delay-Sensitive Tasks (DSTs), preemptive scheduling is introduced to deal with the hybrid tasks, comprised of DSTs and Delay-Tolerant Tasks (DTTs). Finally, a computation offloading problem based on the collaborative EC-MEPC architecture is established by jointly optimizing the decision-making and resource allocation issue. To solve the above problem, a distributed computation offloading and resource allocation algorithm is designed to achieve the optimal solution. Simulation results show that the proposed collaborative computing architecture and the distributed algorithm can effectively improve the delay and energy consumption performance of this system.", "venue": "ICC 2021 - IEEE International Conference on Communications", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-06-01", "journal": {"name": "ICC 2021 - IEEE International Conference on Communications", "pages": "1-6"}, "authors": [{"authorId": "2061135203", "name": "Tingting Xiao"}, {"authorId": "4562384", "name": "Chen Chen"}, {"authorId": "1962341", "name": "Tie Qiu"}, {"authorId": "1384350206", "name": "Ci He"}, {"authorId": "39718931", "name": "Qingqi Pei"}, {"authorId": "1866371", "name": "Haotong Cao"}], "citations": [{"paperId": "199ee0fd2fe90b31c81fd104813d342f25f1b640", "title": "Computing Resource Allocation Strategy Based on Mobile Edge Computing in Internet of Vehicles Environment"}, {"paperId": "b3d7bb1706e6a254fad9e79c50277d7d621ebf77", "title": "Aerial Computing Offloading by Distributed Deep Learning in Collaborative Satellite-terrestrial Networks"}, {"paperId": "62e9362ab52edaa1e64fed23e7da72794393b3b8", "title": "Multi-Agent Reinforcement Learning-Based Trading Decision-Making in Platooning-Assisted Vehicular Networks"}]}
