{"paperId": "bf212042064ae86db8e502c0fcf0950c9131b3e0", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "A Novel Technique for Behavioral Analytics Using Ensemble Learning Algorithms in E-Commerce", "abstract": "The era of E-commerce and availability of data in every field of operations in an enormous volume that implies to Big Data is one of the biggest sources of competitive advantage for the organizations in this digital world. It provides useful information to grow businesses by posting the advertisement and help consumers find the relevant product according to their preferences. The focus of this research is on the advertisement strategies analysis under which a Business employs several online advertisement strategies in order to appeal to the consumer. This research work will present a detailed analysis in user behavioral to use for business or Online Behavioral advertising and provide the framework of how Enterprise Resource Planning systems track the targeted audience and show their content. The paper’s prime objective is to classify and effectively run targeted advertising using the data that shows user’s retail behavior. This is where an Enterprise Resource Planning driven data will give rise to behavioral analytics. In addition to this, various data streaming technologies are also emphasized that will help to create a pipeline for the huge amount of data in Enterprise Resource Planning’s database.", "venue": "IEEE Access", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "150072-150080", "volume": "8"}, "authors": [{"authorId": "1904220657", "name": "Mohammad Alojail"}, {"authorId": "3412034", "name": "Surbhi Bhatia"}], "citations": [{"paperId": "efa089a1ed25c058fbb2ae13be9d3503c8a7f651", "title": "Feature-Based Linguistic Text Sentiment Analysis Using Stacked Meta-Ensemble Learning"}, {"paperId": "b23697b872b5d0476fcc1e43a2bda628fdd324d3", "title": "An Extensive Review and Comparison of Different Machine Learning Algorithms for Customer Behaviour Pattern Analysis"}, {"paperId": "b08f4dd62f8e52d04728360bea98ab4bb508d953", "title": "Super Deep Learning Ensemble Model for Sentiment Analysis"}, {"paperId": "abb3c61fbc1ec5e88d71ec785859693b9ea9389b", "title": "Learning Customer Behaviors in the Metaverse"}, {"paperId": "4682ac14a105eec06e3e1c600986b8b929ad02fa", "title": "An enhanced approach for sentiment analysis based on meta-ensemble deep learning"}, {"paperId": "5ff898b81d890854d55465b185b3dfc053771167", "title": "E-Commerce Website Usability Analysis Using the Association Rule Mining and Machine Learning Algorithm"}, {"paperId": "bd9196c68f5f123b38a564382ab0aa07d4be8df8", "title": "Decision-Making Approaches for Complex Applications using Deep Learning Models"}, {"paperId": "0af948a67ba8700c66eafd0f36b9480248fa2a26", "title": "Commodity Information Collection and System Construction of e-Commerce Platform Based on Network Data"}, {"paperId": "2481eb3c51233a22905d8b8c331d57cd6b0255c9", "title": "Prediction of failures in the project management knowledge areas using a machine learning approach for software companies"}, {"paperId": "868df188eb2e9c9caf194617db25b5be33d929c1", "title": "A Novel Framework of an IOT-Blockchain-Based Intelligent System"}, {"paperId": "25cb4da6983390abd59e8981708932538cd1f772", "title": "Spam message detection using Danger theory and Krill herd optimization"}, {"paperId": "86b2d6efe5aeb5ac3d539ced30804e64928a33f9", "title": "Cost-effective ensemble models selection using deep reinforcement learning"}, {"paperId": "95928530a2bd9949e842538d5a709aa899fb5a8e", "title": "Computational Modeling of Dementia Prediction Using Deep Neural Network: Analysis on OASIS Dataset"}, {"paperId": "66d0e7514e7f90a3d6fffbff0692544e021e291c", "title": "A Comparative Study of Opinion Summarization Techniques"}, {"paperId": "493fac691a95a17738f355750238713e7f4b9e4d", "title": "Global <mml:math xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" display=\"inline\" id=\"d1e3057\" altimg=\"si111.svg\"><mml:mi>e</mml:mi></mml:math>-Commerce (G<mml:math xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" display=\"inline\" id=\"d1e3062\" altimg=\"si111.svg\"><mml:mi>e</mml:mi></mml:math>C) theory b"}, {"paperId": "e8695620cabb9b0b44f82f69e0cbb15ebf85769d", "title": "Equilibrium Control Method of Logistics Supply Chain of E-commerce Platform Based on Big Data"}, {"paperId": "a1dafe5f661def685c5be3eacde0f0bb41892df2", "title": "An Improved Method for Extractive Based Opinion Summarization Using Opinion Mining"}, {"paperId": "64c98543163447076d411b72461799e0a9a15e1c", "title": "Software Reliability Assessment Using Hybrid Neuro-Fuzzy Model"}, {"paperId": "671b7e075d72bc38a263e7632ec1d166f804e39f", "title": "Detection and Mathematical Modeling of Anxiety Disorder Based on Socioeconomic Factors Using Machine Learning Techniques"}, {"paperId": "93371423a7f94639d8db5f05d681d430f9e675eb", "title": "FESD: An Approach for Biometric Human Footprint Matching Using Fuzzy Ensemble Learning"}]}
