{"paperId": "bf2594a0781eed5a4b6bd66730d8fbbc98fe6d58", "publicationVenue": {"id": "0f6a3a08-5e16-47c6-a0d5-fa6fdc7c16fc", "name": "ACM Transactions on Asian and Low-Resource Language Information Processing", "type": "conference", "alternate_names": ["ALRLIP", "ACM Trans Asian Low-resource Lang Inf Process"], "issn": "2375-4699", "url": "https://tallip.acm.org/"}, "title": "Research on Strategies of Synchronous Interaction Hybrid Basic Sports and University Education Interaction Model Based on SERVQUAL Model", "abstract": "Promoting the balanced development of regional basic education and finally realizing education equity is an important task for my country's current educational development. To this end, the balanced development of informatization and basic education has carried out experiments and practical explorations of informatization to promote the balanced development of regional basic education. Through synchronized interactive hybrid classrooms, the sharing of high-quality urban teachers to rural teaching sites has helped them to implement national regulations. Course. Using the SERVQUAL model for data analysis, synchronous interactive hybrid classrooms, as a new form of high-quality teacher sharing, are of great significance to promoting the balanced development of basic education in my country. It has attracted great attention from education researchers and is considered to be a solution area. Effective means for the problem of imbalanced sex education resources. Therefore, the VR teaching experience, the use of wearable sports equipment, the construction of a physical education network platform, and the four basic sports professional courses of physical education and university education interactive strategies are proposed, and the effects of the interactive strategies are analyzed. The experimental results show that the students' evaluation of the traditional basic physical education teaching mode is low, and the score is basically below 5 points. After the interaction between basic physical education and university education when applying the SERVQUAL model, the VR teaching experience strategy has a significant impact on basic physical education. VR teaching experience strategy basic physical education students achieve a score of 10, and their interest has increased by 34%. Sports performance under this interactive strategy increased by 51%. The strategy of interaction between basic physical education and university education has increased students' interest in basic physical education courses, improved students' performance in basic physical education courses, and promoted the development of physical education to a certain extent.", "venue": "ACM Transactions on Asian and Low-Resource Language Information Processing", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-12-02", "journal": {"name": "ACM Transactions on Asian and Low-Resource Language Information Processing"}, "authors": [{"authorId": "2193154378", "name": "Zhili Chang"}], "citations": []}
