{"paperId": "bf2526fc177d072687b6aea37ea4ab197b0d40db", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Test Flakiness' Causes, Detection, Impact and Responses: A Multivocal Review", "abstract": "Flaky tests (tests with non-deterministic outcomes) pose a major challenge for software testing. They are known to cause significant issues such as reducing the effectiveness and efficiency of testing and delaying software releases. In recent years, there has been an increased interest in flaky tests, with research focusing on different aspects of flakiness, such as identifying causes, detection methods and mitigation strategies. Test flakiness has also become a key discussion point for practitioners (in blog posts, technical magazines, etc.) as the impact of flaky tests is felt across the industry. This paper presents a multivocal review that investigates how flaky tests, as a topic, have been addressed in both research and practice. We cover a total of 651 articles (560 academic articles and 91 grey literature articles/posts), and structure the body of relevant research and knowledge using four different dimensions: causes, detection, impact and responses. For each of those dimensions we provide a categorisation, and classify existing research, discussions, methods and tools. With this, we provide a comprehensive and current snapshot of existing thinking on test flakiness, covering both academic views and industrial practices, and identify limitations and opportunities for future research.", "venue": "arXiv.org", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-12-01", "journal": {"name": "ArXiv", "volume": "abs/2212.00908"}, "authors": [{"authorId": "17285449", "name": "Shawn Rasheed"}, {"authorId": "2494905", "name": "Amjed Tahir"}, {"authorId": "144212658", "name": "Jens Dietrich"}, {"authorId": "2174736965", "name": "Negar Hashemi"}, {"authorId": "2193484243", "name": "Lu Zhang"}], "citations": [{"paperId": "440b164c056544cdd6d98fcfbc39d5828b3b3f30", "title": "Improved Flaky Test Detection with Black-Box Approach and Test Smells"}, {"paperId": "c9beb9b1469973b8f3a22b280a6559d0b8894a8b", "title": "On the Effect of Instrumentation on Test Flakiness"}]}
