{"paperId": "bf25db09a978179312a42dbb76c910db7128d1a1", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Sensitivity of EPA of Ground Motion to Soil Slope Dynamic Response", "abstract": "To study the influence law of effective peak acceleration (EPA) on the seismic response of soil slope, the finite element method was used to simulate the slope response under earthquake action with 100 actual seismic records were selected, the influence law of the EPA under four different definitions commonly used in domestic and foreign codes on the soil slope seismic response was discussed, and which was compared with the influence law of the peak acceleration (PGA). The results showed that the deformation and the maximum principal stress of soil slope both increased with the EPA and PGA, which had an obvious linear relationship, but the correlation degree were different with the parameters of PGA and EPA by the different definitions. EPA1 by the first definition has the highest correlation with the soil slope seismic response, followed by PGA, which was close to EPA1. Other parameters in order of correlation coefficient were EPA2, EPA3 and EPA4. In this example, EPA1 and PGA could better describe the response degree of soil slope in earthquake. The results are expected to provide a basis for the selection of seismic parameters in soil slope seismic stability evaluation.", "venue": "Sustainability", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-12-18", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "2108312305", "name": "Jiangwei Zhang"}, {"authorId": "2115435905", "name": "Yan Shen"}, {"authorId": "93936972", "name": "Tao Lu"}, {"authorId": "2219672702", "name": "Ying Yuan"}, {"authorId": "2197410611", "name": "Chengda Zhang"}], "citations": []}
