{"paperId": "bf2cb4d4ff212e351997faf8aefb40a1e34462a5", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Efficient NLP Inference at the Edge via Elastic Pipelining", "abstract": "Natural Language Processing (NLP) inference is seeing increasing adoption by mobile applications, where on-device inference is desirable for crucially preserving user data privacy and avoiding network roundtrips. Yet, the unprecedented size of an NLP model stresses both latency and memory, creat-ing a tension between the two key resources of a mobile device. To meet a target latency, holding the whole model in memory launches execution as soon as possible but increases one app’s memory footprints by several times, limiting its beneﬁts to only a few inference before being recycled by mobile memory management. On the other hand, loading the model from storage on demand incurs a few seconds long IO, far exceeding the delay range satisfying to a user; pipelining layerwise model loading and execution does not hide IO either, due to the large skewness between IO and computation delays. To this end, we propose WRX. Built on the key idea of maximizing IO/compute resource utilization on the most important parts of a model, WRX reconciles the latency/memory tension via two novel techniques. First, model sharding. WRX manages model parameters as independently tunable shards, and proﬁles their importance to accuracy. Second, elastic pipeline planning with a preload buffer. WRX instantiates an IO/compute pipeline and uses a small buffer for preload shards to bootstrap execution without stalling in early stages; it judiciously selects, tunes, and assembles shards per their importance for resource-elastic execution, which maximizes inference accuracy. Atop two commodity SoCs, we build WRX and evaluate it against a wide range of NLP tasks, under a practical range of target latencies, and on both CPU and GPU. We demonstrate that, WRX delivers high accuracies with 1–2 orders of magnitude lower memory, outperforming competitive baselines.", "venue": "arXiv.org", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "ArXiv", "volume": "abs/2207.05022"}, "authors": [{"authorId": "2110519994", "name": "Liwei Guo"}, {"authorId": "1931741049", "name": "Wonkyo Choe"}, {"authorId": "1774176", "name": "F. Lin"}], "citations": [{"paperId": "eb3bc393e86f159010da1058310950cbd4a758b5", "title": "SPARTAN: Sparse Hierarchical Memory for Parameter-Efficient Transformers"}]}
