{"paperId": "bf2ece93b44fdb4bcce948bca4257dfa2ecb5089", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Predicting Influential Blogger’s by a Novel, Hybrid and Optimized Case Based Reasoning Approach With Balanced Random Forest Using Imbalanced Data", "abstract": "Bloggers possess the capability of understanding and influencing mass psychology to a wide community of fans and followers by posting their online valuable content. Their dominance over audience can be used as a helping hand in the corporate world which desires to disseminate their product or services among diversified people belonging to varying localities, and is always on the lookout for suitable and quick ways to grasp public access. Due to this reason, influential bloggers are preferred in the online market to initiate marketing campaigns which is a thought-provoking task due to loads of blogger communities. The novelty of this paper lies in the proposed Framework for Influential Blogger Prediction based on Blogger and Blog Features (IBP-BBF) using Case-Based Reasoning (CBR) which is not only capable of handling labeled data but also unstructured data (blogs) and imbalanced data in an optimized way. Detailed labelled and unstructured data are collected by online survey of 129 bloggers and text mining of their 32,200 blogs respectively. The classification results are compared and validated with state-of-the-art machine learning techniques by using standard evaluation measures respectively in the context of imbalanced data. The results show that the proposed IBP-BBF framework through CBR modeling outperforms existing techniques in classifying and adapting the influential blogger prediction. The IBP-BBF framework performed better as compared to baseline imbalanced data classification techniques. It is found that the Balanced Random Forest contributes towards the performance of CBR approach than Balanced Bagging Classifier and RUSBoost classifier. By using the CBR approach, baseline techniques can be optimized for influential blogger identification in a better way.", "venue": "IEEE Access", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "6836-6854", "volume": "9"}, "authors": [{"authorId": "3367964", "name": "Yousra Asim"}, {"authorId": "145010235", "name": "Ahmad Kamran Malik"}, {"authorId": "2846981", "name": "B. Raza"}, {"authorId": "2005415", "name": "A. R. Shahid"}, {"authorId": "3140251", "name": "Nafees Qamar"}], "citations": [{"paperId": "60f3d6963be953e8368721c8f9f03f027d9bd0a5", "title": "Research on imbalance machine learning methods for MR\\documentclass[12pt]{minimal} \\usepackage{amsmath} \\usepackage{wasysym} \\usepackage{amsfonts} \\usepackage{amssymb} \\usepackage{amsbsy} \\usepackage{mathrsfs} \\usepackage{upgreek} \\setlength{\\oddsidemargin}{-69pt} \\begin{document}$$T_1$$\\end{documen"}, {"paperId": "63a9ad0d6a5191798d0fddc321ff708afeeac5c0", "title": "COVID-19 Tweets Classification during Lockdown Period Using Machine Learning Classifiers"}, {"paperId": "088f38ab67cdb80cc262e3379168c19a95574da3", "title": "Sistem Pakar untuk Mendeteksi Gejala Awal Penyakit Apendisitis dengan Metode Case Based Reasoning (CBR) Berbasis Mobile Android"}, {"paperId": "7edf2095bce6a446a6a2c44c8395ba75b3cdd9d5", "title": "Research on the Intelligent Design of Office Chair Patterns"}, {"paperId": "4438916da6e0fb88eb24354c7f247c4d99df8386", "title": "Different hybrid machine intelligence techniques for handling IoT-based imbalanced data"}, {"paperId": "238bc1b88b7fbc8741f824a41ef3a0190eb70e5f", "title": "Selecting Bloggers for Hotels via an Innovative Mixed MCDM Model"}]}
