{"paperId": "bf344ab9331e986cbbe89e896a1b2d4732d7e3f6", "publicationVenue": null, "title": "Cluster-size optimization within a cloud-based ETL framework for Big Data", "abstract": "The ability to analyze the available data is a valuable asset for any successful business, especially when the analysis yields meaningful knowledge. One of the key processes for acquiring such ability is the Extract-Transform-Load (ETL) process. For Big Data, ETL requires a significant effort and it is a very challenging task to be performed in a cost-effective way. There are quite a few examples in the literature that describe an architecture for cost-effective ETL but none of the available examples are complete enough and they are usually evaluated in narrow problem domains. The ones that are more general, require specific implementation details. In this paper we propose a cloud-based ETL framework where we use a general cluster-size optimization algorithm, while providing implementation details, and is able to perform the required job within a predefined, and thus known, time. We evaluated the algorithm by executing three scenarios regarding data aggregation during ETL: (i) ETL with no aggregation; (ii) aggregation based on predefined columns or time intervals; and (iii) aggregation within single user sessions spanning over arbitrary time intervals. The execution of the three ETL scenarios in a production setting showed that the cluster size could be optimized so it can process the required data volume within a predefined and thus, expected, latency. The scalability was evaluated on Amazon AWS Hadoop clusters by processing user logs collected with Kinesis streams with datasets ranging from 30 GB to 2.6 TB.", "venue": "2019 IEEE International Conference on Big Data (Big Data)", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-12-01", "journal": {"name": "2019 IEEE International Conference on Big Data (Big Data)", "pages": "3754-3763"}, "authors": [{"authorId": "2269444", "name": "Eftim Zdravevski"}, {"authorId": "1769456", "name": "Petre Lameski"}, {"authorId": "9425010", "name": "Ace Dimitrievski"}, {"authorId": "1749320", "name": "Marek Grzegorowski"}, {"authorId": "2835032", "name": "Cas Apanowicz"}], "citations": [{"paperId": "c3f0cfcf0bec374faf35fde24e398eafea324b6d", "title": "An efficient hybrid optimization of ETL process in data warehouse of cloud architecture"}, {"paperId": "247ec99d5d53fac41fdbda239572f0a92c6361c2", "title": "Towards a Scalable and Efficient ETL"}, {"paperId": "73a0eadcbac55369327fd8f14eba4736f6b278f4", "title": "A natural language interface for automatic generation of data flow diagram using web extraction techniques"}, {"paperId": "9a12d3e4ff66d59e594241e46abc213dd529088a", "title": "ReAssigner: A Plug-and-Play Virtual Machine Scheduling Intensifier for Heterogeneous Requests"}, {"paperId": "8ce5ea27e169423bfe3187a5ab969a2e0e625385", "title": "Comparison of SQL and NoSQL databases with different workloads: MongoDB vs MySQL evaluation"}, {"paperId": "538497ace61246fa8a376bb9824fbab35601150c", "title": "Detecting the Risk of Customer Churn in Telecom Sector: A Comparative Study"}, {"paperId": "b9abb72b3bfe19c349c81b3733767705f1d44f9b", "title": "Large-Scale Causality Discovery Analytics as a Service"}, {"paperId": "1dccb40540943d69b2572b053d6e000cb2fd78c2", "title": "Are central-zone restaurants better for consumers? -An analytical approach"}, {"paperId": "18afa651c84d09594de0fc603a442f772fb10302", "title": "Cost Optimization for Big Data Workloads Based on Dynamic Scheduling and Cluster-Size Tuning"}, {"paperId": "639c43061f66baa5f7101917e45ec3083fffbd0c", "title": "Towards Detecting Pneumonia Progression in COVID-19 Patients by Monitoring Sleep Disturbance Using Data Streams of Non-Invasive Sensor Networks"}, {"paperId": "3f350e8a11776aa1cfc8cdb294f180c9e194299f", "title": "A Survey on Data-driven Performance Tuning for Big Data Analytics Platforms"}, {"paperId": "036d5a770c8b0751b9a0e3c4163540cf087f905a", "title": "Big-Parallel-ETL: New ETL for Multidimensional NoSQL Graph Oriented Data"}, {"paperId": "43e077a785f15d7bed377e87905f97900e719362", "title": "Diseases identification with big data concept – The older people community"}, {"paperId": "017ed88c7a7f4d72319bcf5821b591b694fd23f7", "title": "The History, Present, and Future of ETL Technology (invited)"}, {"paperId": "f8d3073c957ed449fac22b5a22ca11d94f9605ff", "title": "SMART-ETL-MR: NOVEL ETL FRAMEWORK FOR BUILDING DATA WAREHOUSE FROM BIG DATA SOURCE USING MAPREDUCE"}]}
