{"paperId": "bf4acf4d7628a2905ff464c82af71a8bcbdfa796", "publicationVenue": {"id": "f32b7322-b69c-4e63-801d-8f50784ef778", "name": "Computational Intelligence and Neuroscience", "type": "journal", "alternate_names": ["Comput Intell Neurosci"], "issn": "1687-5265", "url": "https://www.hindawi.com/journals/cin/"}, "title": "The Design of Personalized Education Resource Recommendation System under Big Data", "abstract": "With the advent of the Internet and the era of big data, education is increasingly dependent on data resources to support product and business innovation, and the lack of data resources has severely limited the areas involved. As a general information filtering method, personalized recommendation systems analyze the historical interaction data between users and items to build user interest models in an environment of “information overload”, allowing users to discover and recommend information that interests them. However, the explosive growth of information in the network makes users wander in the sea of information, and it is increasingly difficult to find the information they really need, i.e., information overload. This has given rise to personalized recommendation systems, which currently have more mature applications in industries such as e-commerce, music services, and movie services. To this end, this paper studies and implements a customized educational resource recommendation system that can handle big data. The results show that the values of different similarity calculations all fluctuate with the gradual increase of the number of nearest neighbors, and the algorithm in this paper is maximum at the number of neighbors around 60; then, it is inferred that applying the calculation method to the recommendation algorithm will improve the recommendation accuracy. Therefore, education uses the concept of big data to process the huge amount of education data and find some correlations and laws in education, so as to realize “teaching according to the material, teaching according to the material”.", "venue": "Computational Intelligence and Neuroscience", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-06-28", "journal": {"name": "Computational Intelligence and Neuroscience", "volume": "2022"}, "authors": [{"authorId": "2144161116", "name": "Rong Fu"}, {"authorId": "2170869619", "name": "Mijuan Tian"}, {"authorId": "51284286", "name": "Qianjun Tang"}], "citations": [{"paperId": "8e8e2fbc85ac5fffefabfaa38bc8f82863cfb832", "title": "A Novel Algorithm for Professor Recommendation in Higher Education"}, {"paperId": "f1d79568ef7c192fd6521bb06215a971cfef6c56", "title": "RESEARCH TRENDS AND METHODS FOR RECOMMENDATION SYSTEM IN EDUCATION: A REVIEW"}]}
