{"paperId": "bf4d106f67fd626d4ab47c3aef60709fe06362a7", "publicationVenue": null, "title": "Topology-Aware Differential Privacy for Decentralized Image Classification", "abstract": "Image classification is a fundamental artificial intelligence task that labels images into one of some predefined classes. However, training complex image classification models requires a large amount of computation resources and data in order to reach state-of-the-art performance. This demand drives the growth of distributed deep learning, where multiple agents cooperatively train global models with their individual datasets. Among such learning systems, decentralized learning is particularly attractive, as it can improve the efficiency and fault tolerance by eliminating the centralized parameter server, which could be the single point of failure or performance bottleneck. Although the agents do not need to disclose their training image samples, they exchange parameters with each other at each iteration, which can put them at the risk of data privacy leakage. Past works demonstrated the possibility of recovering training images from the exchanged parameters. One common defense direction is to adopt Differential Privacy (DP) to secure the optimization algorithms such as Stochastic Gradient Descent (SGD). Those DP-based methods mainly focus on standalone systems, or centralized distributed learning. How to enforce and optimize DP protection in decentralized learning systems is unknown and challenging, due to their complex communication topologies and distinct learning characteristics. In this paper, we design TOP- DP, a novel solution to optimize the differential privacy protection of decentralized image classification systems. The key insight of our solution is to leverage the unique features of decentralized communication topologies to reduce the noise scale and improve the model usability. (1) We enhance the DP-SGD algorithm with this topology-aware noise reduction strategy, and integrate the time-aware noise decay technique. (2) We design two novel learning protocols (synchronous and asynchronous) to protect systems with different network connectivities and topologies. We formally analyze and prove the DP requirement of our proposed solutions. Experimental evaluations demonstrate that our solution achieves a better trade-off between usability and privacy than prior works. To the best of our knowledge, this is the first DP optimization work from the perspective of network topologies.", "venue": "IEEE transactions on circuits and systems for video technology (Print)", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-06-14", "journal": {"name": "IEEE Transactions on Circuits and Systems for Video Technology", "pages": "4016-4027", "volume": "32"}, "authors": [{"authorId": "16042895", "name": "Shangwei Guo"}, {"authorId": "2146331573", "name": "Tianwei Zhang"}, {"authorId": "145249315", "name": "Guowen Xu"}, {"authorId": "103555596", "name": "Hanzhou Yu"}, {"authorId": "145406420", "name": "Tao Xiang"}, {"authorId": "2152798056", "name": "Yang Liu"}], "citations": [{"paperId": "8f704a9c1eeca41df0ca7db5e4eaeefd403b8eff", "title": "Sentinel-Guided Zero-Shot Learning: A Collaborative Paradigm without Real Data Exposure"}, {"paperId": "b09d1512df15fa431eb5afea8c83728718231f8b", "title": "Privacy-Preserving Distributed Optimization and Learning"}, {"paperId": "0f7d824c1cbcb4304fb7b5682c48a4c26bd1a316", "title": "Secure and efficient decentralized machine learning through group-based model aggregation"}, {"paperId": "59c338437b5023f010b5a9e2821935c1044c9495", "title": "FedAA: Using Non-sensitive Modalities to Improve Federated Learning while Preserving Image Privacy"}, {"paperId": "c280423fe86ba85ca8dc9b59e4e85799be24f00a", "title": "Privacy-preserving DeepFake face image detection"}, {"paperId": "97a8b8cf631e1bf8740f0c80c17d78cf94a460a7", "title": "A review of Deep Learning Privacy, Security and Defenses"}, {"paperId": "fb4be5c23b8ab715e2a7e2df6f98e55c10202f2b", "title": "Semi-fragile neural network watermarking for content authentication and tampering localization"}, {"paperId": "a2a2da93e83246fde5533b6040a258b148b4f1fd", "title": "Secure Decentralized Image Classification With Multiparty Homomorphic Encryption"}, {"paperId": "48daf5ffaae600dc8fc317c7654cabe4ae2108e5", "title": "Differential Private Discrete Noise-Adding Mechanism: Conditions, Properties, and Optimization"}, {"paperId": "5c5b91bdcb450c9950f5f4a028d34844aeefbaed", "title": "Contextualize differential privacy in image database: a lightweight image differential privacy approach based on principle component analysis inverse"}, {"paperId": "2f0593543cd77bdc37943effab25cb7090bbc407", "title": "Robust and Privacy-Preserving Collaborative Learning: A Comprehensive Survey"}, {"paperId": "0e7081f0f76faabda1f9c6497fc9a83b1c051c71", "title": "Ownership Verification of DNN Architectures via Hardware Cache Side Channels"}, {"paperId": "c17dd6d9878c629947c616c2e2fe0a1d7d29c057", "title": "Research on Local Fingerprint Image Differential Privacy Protection Method Based on Clustering Algorithm and Regression Algorithm Segmentation Image"}]}
