{"paperId": "bf4eb74d139ec514ab387d4ceff8aa69dc697131", "publicationVenue": {"id": "1944b6e1-2c1d-4f42-88e3-9f8a52f57e47", "name": "Diagnostics", "issn": "2075-4418", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217965", "alternate_urls": ["https://www.mdpi.com/journal/diagnostics", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217965"]}, "title": "Classification of Parkinson’s Disease in Patch-Based MRI of Substantia Nigra", "abstract": "Parkinson’s disease (PD) is a chronic and progressive neurological disease that mostly shakes and compromises the motor system of the human brain. Patients with PD can face resting tremors, loss of balance, bradykinesia, and rigidity problems. Complex patterns of PD, i.e., with relevance to other neurological diseases and minor changes in brain structure, make the diagnosis of this disease a challenge and cause inaccuracy of about 25% in the diagnostics. The research community utilizes different machine learning techniques for diagnosis using handcrafted features. This paper proposes a computer-aided diagnostic system using a convolutional neural network (CNN) to diagnose PD. CNN is one of the most suitable models to extract and learn the essential features of a problem. The dataset is obtained from Parkinson’s Progression Markers Initiative (PPMI), which provides different datasets (benchmarks), such as T2-weighted MRI for PD and other healthy controls (HC). The mid slices are collected from each MRI. Further, these slices are registered for alignment. Since the PD can be found in substantia nigra (i.e., the midbrain), the midbrain region of the registered T2-weighted MRI slice is selected using the freehand region of interest technique with a 33 × 33 sized window. Several experiments have been carried out to ensure the validity of the CNN. The standard measures, such as accuracy, sensitivity, specificity, and area under the curve, are used to evaluate the proposed system. The evaluation results show that CNN provides better accuracy than machine learning techniques, such as naive Bayes, decision tree, support vector machine, and artificial neural network.", "venue": "Diagnostics", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-31", "journal": {"name": "Diagnostics", "volume": "13"}, "authors": [{"authorId": "1516151607", "name": "Sayyed Shahid Hussain"}, {"authorId": "2154712590", "name": "Degang Xu"}, {"authorId": "40399671", "name": "Pir Masoom Shah"}, {"authorId": "87359784", "name": "S. M. Fakhrul Islam"}, {"authorId": "2237093706", "name": "Mahmood Alam"}, {"authorId": "2105582462", "name": "I. Khan"}, {"authorId": "2238690322", "name": "Fuad A. Awwad"}, {"authorId": "2209142337", "name": "Emad A. A. Ismail"}], "citations": []}
