{"paperId": "bf555545a1e25eb6b4170708638ee37c82b90c3e", "publicationVenue": {"id": "1ebdbe67-2863-402b-ab61-196457cb7385", "name": "Advances in Educational Technology and Psychology", "alternate_names": ["Adv Educ Technol Psychol"], "issn": "2371-9397", "url": "http://clausiuspress.com/journal/AETP.html"}, "title": "Influence of Metonymic Thinking on the Critical Thinking Ability of English Majors Based on Data Mining", "abstract": ": English majors must enhance their critical thinking skills in order to keep up with the times. It is a constant and solid guarantee of national talent resources, although English majors' critical thinking capacity is still being explored. The purpose of this paper is to investigate the impact of metonymic thinking on English majors' critical thinking abilities. This research presents an improved analytic hierarchy technique based on data mining for evaluating the critical thinking skills of English majors for the purpose to provide students with a more accurate and clear understanding of themselves. It helps kids develop critical thinking abilities. The upgraded analytic hierarchy method has a greater accuracy rate of evaluation than the classic analytic hierarchy process. The experimental results of this paper show that in the test of metonymy ability before the experiment, only 30% of the students answered correctly. It shows that only 30% of the students have good metonymy ability, and the corresponding critical thinking ability is weak. But after the experiment, in the test of metonymy ability, 78% of the students in the experimental group answered the test questions correctly, while the correct rate in the control group was only 40%. It shows that the students' metonymy ability has been improved after the experiment, and their critical thinking ability has also become stronger. This shows that the relationship between the two is positively correlated.", "venue": "Advances in Educational Technology and Psychology", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "Advances in Educational Technology and Psychology"}, "authors": [{"authorId": "2290059577", "name": "Menglin Zhang"}], "citations": []}
