{"paperId": "bf5dd0f1c58d12d3216d6e6a9e5b2e00b2648120", "publicationVenue": {"id": "79af09a2-54e8-4f97-8edf-9fba208ab744", "name": "International Journal of Digital Earth", "type": "journal", "alternate_names": ["Int J Digit Earth"], "issn": "1753-8947", "url": "http://www.informaworld.com/smpp/title~content=1753-8947", "alternate_urls": ["http://www.tandfonline.com/toc/tjde20/current"]}, "title": "Geographic context-aware text mining: enhance social media message classification for situational awareness by integrating spatial and temporal features", "abstract": "ABSTRACT To find disaster relevant social media messages, current approaches utilize natural language processing methods or machine learning algorithms relying on text only, which have not been perfected due to the variability and uncertainty in the language used on social media and ignoring the geographic context of the messages when posted. Meanwhile, a disaster relevant social media message is highly sensitive to its posting location and time. However, limited studies exist to explore what spatial features and the extent of how temporal, and especially spatial features can aid text classification. This paper proposes a geographic context-aware text mining method to incorporate spatial and temporal information derived from social media and authoritative datasets, along with the text information, for classifying disaster relevant social media posts. This work designed and demonstrated how diverse types of spatial and temporal features can be derived from spatial data, and then used to enhance text mining. The deep learning-based method and commonly used machine learning algorithms, assessed the accuracy of the enhanced text-mining method. The performance results of different classification models generated by various combinations of textual, spatial, and temporal features indicate that additional spatial and temporal features help improve the overall accuracy of the classification.", "venue": "International Journal of Digital Earth", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-08-20", "journal": {"name": "International Journal of Digital Earth", "pages": "1721 - 1743", "volume": "14"}, "authors": [{"authorId": "115621244", "name": "C. Scheele"}, {"authorId": "2893304", "name": "Manzhu Yu"}, {"authorId": "32780423", "name": "Qunying Huang"}], "citations": [{"paperId": "e49bbdb728ec2ac5abb0a33085593311ad4f296d", "title": "Information Retrieval and Classification of Real-Time Multi-Source Hurricane Evacuation Notices"}, {"paperId": "d030f2ca7e0b938ba9a1e346dd3276a9d04d1426", "title": "Geo-knowledge-guided GPT models improve the extraction of location descriptions from disaster-related social media messages"}, {"paperId": "a773dc95b2561e17d2482962774299bb2bcf1ae5", "title": "The State of the Art in Deep Learning Applications, Challenges, and Future Prospects: A Comprehensive Review of Flood Forecasting and Management"}, {"paperId": "ee2215985fd7cae5b4ec743ab50ebb74304b263c", "title": "Applicability Analysis and Ensemble Application of BERT with TF-IDF, TextRank, MMR, and LDA for Topic Classification Based on Flood-Related VGI"}, {"paperId": "719bd8978f6af8a20541aac139b52e938c62fdc7", "title": "A Deep Learning Model of Spatial Distance and Named Entity Recognition (SD-NER) for Flood Mark Text Classification"}, {"paperId": "a9ef0f82a4bd72615dc12fc35a21892ad2f22022", "title": "An adaptive LIC based geographic flow field visualization method by means of rotation distance"}, {"paperId": "9f15c2dd87b786e8288439eb628960589ffb20b2", "title": "New Era for Geo-Parsing to Obtain Actual Locations: A Novel Toponym Correction Method Based on Remote Sensing Images"}, {"paperId": "2a9bc2be2429e99ce46ecc8b35c3da4dae646df6", "title": "Adversarial Learning-based Stance Classifier for COVID-19-related Health Policies"}, {"paperId": "44fe17afb0e68b420e9a8bd899db79ad2608ecb2", "title": "Location reference recognition from texts: A survey and comparison"}]}
