{"paperId": "bf6b994a579b1a8b74dfd6d5ba3dc5888fd86188", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Using Adaptive Sensors for Optimised Target Coverage in Wireless Sensor Networks", "abstract": "Innovation in wireless communications and microtechnology has progressed day by day, and this has resulted in the creation of wireless sensor networks. This technology is utilised in a variety of settings, including battlefield surveillance, home security, and healthcare monitoring, among others. However, since tiny batteries with very little power are used, this technology has power and target monitoring issues. With the development of various architectures and algorithms, considerable research has been done to address these problems. The adaptive learning automata algorithm (ALAA) is a scheduling machine learning method that is utilised in this study. It offers a time-saving scheduling method. As a result, each sensor node in the network has been outfitted with learning automata, allowing them to choose their appropriate state at any given moment. The sensor is in one of two states: active or sleep. Several experiments were conducted to get the findings of the suggested method. Different parameters are utilised in this experiment to verify the consistency of the method for scheduling the sensor node so that it can cover all of the targets while using less power. The experimental findings indicate that the proposed method is an effective approach to schedule sensor nodes to monitor all targets while using less electricity. Finally, we have benchmarked our technique against the LADSC scheduling algorithm. All of the experimental data collected thus far demonstrate that the suggested method has justified the problem description and achieved the project’s aim. Thus, while constructing an actual sensor network, our suggested algorithm may be utilised as a useful technique for scheduling sensor nodes.", "venue": "Italian National Conference on Sensors", "year": 2022, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-01-30", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "22"}, "authors": [{"authorId": "2265934988", "name": "Araujo Pinto"}, {"authorId": "1728452", "name": "H. Fouchal"}, {"authorId": "2265953502", "name": "Matteo Anedda"}, {"authorId": "1992906806", "name": "Junaid Akram"}, {"authorId": "71940750", "name": "Hafiz Suliman Munawar"}, {"authorId": "3089801", "name": "A. Kouzani"}, {"authorId": "2152343987", "name": "M. Mahmud"}], "citations": [{"paperId": "cb467b5f6fde68eb722984b74520b2698a744dcb", "title": "A heuristic node placement strategy for extending network lifetime and ensuring target coverage in mobile wireless sensor networks"}, {"paperId": "4f770414e6840998b69e54c6c9cbe498b588c417", "title": "Wireless Sensor Placement Optimization for Bridge Health Monitoring: A Critical Review"}, {"paperId": "44431fb4dd48fcd96c9d6191b3f83465f54e5acf", "title": "Chained-Drones: Blockchain-based privacy-preserving framework for secure and intelligent service provisioning in Internet of Drone Things"}, {"paperId": "27c1cf541f5af2aabbe3b2b579b193a7e93b6929", "title": "Image processing based data reduction technique in WVSN for smart agriculture"}, {"paperId": "34fe267d25c8df63de1851d4a83674b74e341856", "title": "Towards Trajectory Prediction-Based UAV Deployment in Smart Transportation Systems"}, {"paperId": "01e744a0a9a403a445f11b9d766ea0f973852b11", "title": "Efficient evolutionary modeling in solving maximization of lifetime of wireless sensor healthcare networks"}, {"paperId": "07abc1d6b45eaba25eb427c5d6bbc055d1fc1dd7", "title": "Sensing Quality-Aware Task Allocation for Multidimensional Vehicular Urban Sensing"}, {"paperId": "290bbd63cd01b907cd788ffabfcb38a0ad7039b1", "title": "An Energy-Saving and Efficient Deployment Strategy for Heterogeneous Wireless Sensor Networks Based on Improved Seagull Optimization Algorithm"}, {"paperId": "d3484153af3e5c17d7b5215e5a546f7d2f69f6a0", "title": "Ant Colony Optimization Based Routing Strategies for Internet of Things"}, {"paperId": "ab5612ab152085bfcaea63dd4df8b3997f69a67b", "title": "A Dynamic Wireless Sensor Network Deployment Algorithm for Emergency Communications"}, {"paperId": "f6d100bb9c1ee966e6b480b9768c65ed129b5333", "title": "A reinforcement learning-based sleep scheduling algorithm for compressive data gathering in wireless sensor networks"}, {"paperId": "006b13b3f9e968c3fe6258d1ccb6cc4e523ecdfe", "title": "The Effective Coverage of Homogeneous Teams with Radial Attenuation Models"}, {"paperId": "e5060fa17b93d458b162c0f7f4c1f514e7373468", "title": "Distributed Observer-based Fault-tolerant Consensus Tracking of Multi-agent Systems under Random Cyber-attacks"}, {"paperId": "3c4a822ab971f9a37b735cd0bc53d89fa390bd6a", "title": "Wireless Body Area Network (WBAN): A Survey on Architecture, Technologies, Energy Consumption, and Security Challenges"}, {"paperId": "330f0ae4e88f4f1ddd6f1ccab397969a7706e4ec", "title": "A Novel Compact Particle Swarm Optimization for Optimizing Coverage of 3D in Wireless Sensor Network"}, {"paperId": "59a84b898a12414ab2dc342588218dcf0c3caaf7", "title": "BC-IoDT: blockchain-based framework for authentication in internet of drone things"}, {"paperId": "c762a68a5eee112f11888d46ffdb6d1d405c7de8", "title": "Crack Detection in Concrete Structures Using Deep Learning"}, {"paperId": "75db732ad59496074c5e6d762988c91eb8c47bc7", "title": "JSQE: Joint Surveillance Quality and Energy Conservation for Barrier Coverage in WSNs"}, {"paperId": "f72336cc36173cd462022cc12b0cecf565950a03", "title": "Big Data Management in Drug-Drug Interaction: A Modern Deep Learning Approach for Smart Healthcare"}, {"paperId": "0380e0c6557e62f2a05538dcc23e46d928cd17b1", "title": "Conceptual Framework for Future WSN-MAC Protocol to Achieve Energy Consumption Enhancement"}]}
