{"paperId": "bf788843c3c21c663fed1f05f8456e7c500c7cf8", "publicationVenue": {"id": "27235614-bd3e-4d6b-be38-5ede18f4e209", "name": "IEEE Wireless Communications and Networking Conference", "type": "conference", "alternate_names": ["IEEE Wirel Commun Netw Conf", "WCNC", "Wireless Communications and Networking Conference", "Wirel Commun Netw Conf"], "url": "http://www.ieee-wcnc.org/"}, "title": "Collaborative Edge Computing and Caching in Vehicular Networks", "abstract": "Mobile Edge Computing (MEC) can significantly promote the development of Internet of Vehicles (IoV) for providing a low-latency and high-reliability environment. Nevertheless, a huge amount of sensor data or computing requirements generated by massive vehicles in adjacent area may be duplicated. In order to realize the efficient diffusion of information, we propose a hierarchical end-edge framework with the aid of deep collaboration among data communication, computation offloading and content caching to minimize network overheads. Specially, duplicated perceived data and computation results are cached in advance to decrease repeated data uploading and duplicated computation in offloading process. In addition, the problem is formulated as a mixed integer non-linear programming (MINLP) problem, and the deep deterministic policy gradient (DDPG)-based resource allocation scheme is utilized to obtain a sub-optimal solution with low computation complexity. Performance evaluation demonstrates that the proposed scheme can significantly reduce network overheads compared with other benchmark methods.", "venue": "IEEE Wireless Communications and Networking Conference", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-05-01", "journal": {"name": "2020 IEEE Wireless Communications and Networking Conference (WCNC)", "pages": "1-6"}, "authors": [{"authorId": "1753696856", "name": "Zhuoxing Qin"}, {"authorId": "4926792", "name": "S. Leng"}, {"authorId": "1774948", "name": "Jihua Zhou"}, {"authorId": "2056609036", "name": "Sun Mao"}], "citations": [{"paperId": "36f9e2e2987d82f2b02020dd652d21d1523089f1", "title": "A survey on integrated computing, caching, and communication in the cloud-to-edge continuum"}, {"paperId": "846287ee8e30196c369a0c454af6e3e5d772df34", "title": "A Hybrid Deep Reinforcement Learning Approach for Jointly Optimizing Offloading and Resource Management in Vehicular Networks"}, {"paperId": "370cfa642b4fb558133d851bb194face7ae577a3", "title": "Dynamic Edge Computation Offloading for Internet of Vehicles With Deep Reinforcement Learning"}, {"paperId": "fa8c56b0f68d82eea02d044b3ac6937ff9f2ab56", "title": "Multi-Agent Caching Strategy for Spatial-Temporal Popularity in IoV"}, {"paperId": "f5c59581e69e90e1a5a087034a38f2dfc253d67e", "title": "Novel Edge Caching Approach Based on Multi-Agent Deep Reinforcement Learning for Internet of Vehicles"}, {"paperId": "134b878582135ab2a0cd8f9c9060b2bca4c1765f", "title": "Joint Service Caching and Computation Offloading Scheme Based on Deep Reinforcement Learning in Vehicular Edge Computing Systems"}, {"paperId": "fac1a32a719e9f3b83234e6dc6407a552c9e419c", "title": "CacheIn: A Secure Distributed Multi-layer Mobility-Assisted Edge Intelligence based Caching for Internet of Vehicles"}, {"paperId": "3a483256b482d288d9159bb6e2d6b04e5472dcdf", "title": "Quality-Aware Joint Caching, Computing and Communication Optimization for Video Delivery in Vehicular Networks"}, {"paperId": "c8d2f363bc2863b0d066cfe8261bf277150a59ca", "title": "A Review on AI-Enabled Content Caching in Vehicular Edge Caching and Networks"}, {"paperId": "7fd3bb25f61fac11bfc6d9f2c25902744e6abf79", "title": "Research on Cache Algorithm for Internet of Vehicles Based on Edge Computing"}, {"paperId": "2a5399043bea56d64a34deac2a06b92f6fccc729", "title": "Intelligent Transportation Systems in the Context of 5G-Beyond and 6G Networks"}, {"paperId": "c3391729c6c56f83d9ba1c70b6dbc05dc3ea5ba5", "title": "Life cycle management of automotive data functions in MEC infrastructures"}, {"paperId": "0719082b6cad16c8d434d78ddbd3f2e0769ce78c", "title": "Toward Collaborative Intelligence in IoV Systems: Recent Advances and Open Issues"}, {"paperId": "a6885e98ffb0ce38a257c24e5d0bf074bfca83b9", "title": "When Cache Meets Vehicular Edge Computing: Architecture, Key Issues, and Challenges"}, {"paperId": "c4a687af5447ec22c7944a71132a2ac72143c7b8", "title": "A New Heuristic Computation Offloading Method Based on Cache-Assisted Model"}, {"paperId": "86634ec4d812711f7709512fc37e505b44da9863", "title": "Task Offloading and Caching for Mobile Edge Computing"}, {"paperId": "0360d9c60f79d3a0b4a30649bd4bb7efd039cd30", "title": "Two-Layer Distributed Content Caching for Infotainment Applications in VANETs"}, {"paperId": "5ede075832725e2b37b4655a5ce723161782d46c", "title": "User-Centric Cooperative MEC Service Offloading"}]}
