{"paperId": "bf7f7b0db9c836009de2eb04ef05a3f08bdf5b84", "publicationVenue": null, "title": "GPU-Based High-performance Imaging for Mingantu Spectral RadioHeliograph", "abstract": "As a dedicated solar radio interferometer, the MingantU SpEctral RadioHeliograph (MUSER) generates massive observational data in the frequency range of 400 MHz–15 GHz. High-performance imaging forms a significantly important aspect of MUSER’s massive data processing requirements. In this study, we implement a practical high-performance imaging pipeline for MUSER data processing. At first, the specifications of the MUSER are introduced and its imaging requirements are analyzed. Referring to the most commonly used radio astronomy software such as CASA and MIRIAD, we then implement a high-performance imaging pipeline based on the Graphics Processing Unit technology with respect to the current operational status of the MUSER. A series of critical algorithms and their pseudo codes, i.e., detection of the solar disk and sky brightness, automatic centering of the solar disk and estimation of the number of iterations for clean algorithms, are proposed in detail. The preliminary experimental results indicate that the proposed imaging approach significantly increases the processing performance of MUSER and generates images with high-quality, which can meet the requirements of the MUSER data processing.", "venue": "", "year": 2017, "fieldsOfStudy": ["Physics", "Computer Science"], "publicationTypes": null, "publicationDate": "2017-12-19", "journal": {"name": "Publications of the Astronomical Society of the Pacific", "volume": "130"}, "authors": [{"authorId": "2162694", "name": "Y. Mei"}, {"authorId": "2145755489", "name": "Feng Wang"}, {"authorId": "2158627754", "name": "Wei Wang"}, {"authorId": "2109042741", "name": "Linjie Chen"}, {"authorId": "7894759", "name": "Yingbo Liu"}, {"authorId": "145869039", "name": "H. Deng"}, {"authorId": "101698329", "name": "W. Dai"}, {"authorId": "2107996419", "name": "Cuiyin Liu"}, {"authorId": "2115248296", "name": "Yiyun Yan"}], "citations": [{"paperId": "76677dce4baa2f3506e9ff95a75e8ebf42e918ba", "title": "Observational results of MUSER during 2014–2019"}, {"paperId": "4c2ca13adc788fe86bc0bc50473514669189585d", "title": "Mingantu Spectral Radioheliograph for Solar and Space Weather Studies"}, {"paperId": "171f13671ae7137f2303cd66d0bba52f631391fa", "title": "Radio Observations of Coronal Mass Ejections: Space Weather Aspects"}, {"paperId": "ada4352c7d3cab26bcfc2c8e6e96105f790d7d51", "title": "Quasi-periodic Pulsations before and during a Solar Flare in AR 12242"}, {"paperId": "655f211a69e0130ed26f94ba404faddface6c8b5", "title": "Diagnosing coronal magnetic fields with radio imaging-spectroscopy technique"}, {"paperId": "d9fb6622d1b91c65e2ffc1c5a9e957dc0f4f766a", "title": "Adaptive scale model reconstruction for radio synthesis imaging"}, {"paperId": "58d3ad065098eb8aeaa07d25b5eed531ccf302e4", "title": "Radio observatories and instrumentation used in space weather science and operations"}, {"paperId": "e3da860ac5b21cf54c139da9da6a9529db23115b", "title": "Implementation of gridding algorithm for radio interferometric imaging based on OpenCL"}]}
