{"paperId": "bf8f798df238c56a25ced89fcaf70bf7e94f948b", "publicationVenue": {"id": "e9a44b89-3d84-4bff-8c78-c53cd2ad7cf8", "name": "Foods", "type": "journal", "issn": "2304-8158", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-277853", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-277853", "https://www.mdpi.com/journal/foods/about", "https://www.mdpi.com/journal/foods"]}, "title": "Association between Dietary Patterns and Metabolic Syndrome Risk Factors: A Cross-Sectional Study of Christian Orthodox Church Fasters and Non-Fasters in Greece", "abstract": "It is well known that the Mediterranean diet contributes to healthy living, prevention of non-communicable diseases, and longevity. A cross-sectional study was conducted with participants from Greece who follow the Mediterranean diet and were further divided into two categories: (i) Christian Orthodox Church (COC) religious fasters and (ii) non-fasters. Four-hundred individuals underwent anthropometric measurements, whereas information regarding dietary intake was collected via three 24 h diet recalls and a monthly food frequency questionnaire. Principal component analysis was performed to derive dietary patterns, whereas associations between dietary patterns and metabolic syndrome (MetS) risk factors were investigated with the general linear model. Non-fasters (n = 200) were found to consume significantly more beef, chicken, turkey, sausage, broth, fried potatoes, ketchup, and mustard, while consuming less seafood, snails, soya, tarama salads, fresh fruits, margarine, olives, and decaf coffee. Two distinct dietary patterns were identified in fasters: (i) the “Mixed Diet” and (ii) the “Plant-based/Fasting Diet” pattern. Moreover, three patterns were identified in non-fasters, and were identified as follows: (i) the “Western Diet”, (ii) the “Mixed Diet”, and (iii) the “Mediterranean-like Diet” pattern. No significant association was observed between dietary patterns and the prevalence of MetS in our population. Further epidemiological studies should evaluate the links between dietary patterns and MetS prevalence within the adult Greek population.", "venue": "Foods", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-01", "journal": {"name": "Foods", "volume": "12"}, "authors": [{"authorId": "50883424", "name": "A. Kokkinopoulou"}, {"authorId": "2258658968", "name": "Niki Katsiki"}, {"authorId": "2203825", "name": "I. Pagkalos"}, {"authorId": "47967380", "name": "Nikolaos E. Rodopaios"}, {"authorId": "13459635", "name": "Alexandra-Aikaterini Koulouri"}, {"authorId": "10772453", "name": "E. Vasara"}, {"authorId": "33429153", "name": "S. Papadopoulou"}, {"authorId": "5999730", "name": "P. Skepastianos"}, {"authorId": "3648596", "name": "M. Hassapidou"}, {"authorId": "2268279414", "name": "Anthony G Kafatos"}], "citations": [{"paperId": "80509ca88002820c680a70e18660923749e77c60", "title": "Association of Christian Orthodox Fasting with Sociodemographic, Anthropometric and Lifestyle Factors and Serum Biochemical Indices: A Cross-Sectional Study on Patients with Metabolic Diseases"}]}
