{"paperId": "bf91312b6143f6b5b763e5c88e2bb0818e57cafd", "publicationVenue": {"id": "9d97da55-0f9c-455e-8459-48e8e36ba2e5", "name": "Coins", "type": "conference", "alternate_names": ["COINS", "International Conference on Omni-Layer Intelligent Systems", "International Conference Omni-Layer Intelligent Systems", "Int Conf Omni-layer Intell Syst"], "issn": "0010-0471"}, "title": "The 51 V's Of Big Data: Survey, Technologies, Characteristics, Opportunities, Issues and Challenges", "abstract": "Currently Big Data is the biggest buzzword, and definitely, we believe that Big Data is changing the world. Some researchers say Big Data will be even bigger buzzword than the Internet. With fast-growing computing resources, information and knowledge a new digital globe has emerged. Information is being created and stored at a fast rate and is being accessed by a vast range of applications through scientific computing, commercial workloads, and social media. In 2018, over 28 billion devices globally, are connected to the internet. In 2020, more than 50 billion smart appliances will be connected worldwide and internet traffic flow will be 92 times greater than it was in 2005. The usage of such a massive number of connected devices not only increase the data volume but also the velocity of data addition with speed of light on fiber optic and various wireless networks. This fast generation of enormous data creates numerous threats and challenges. There exist various approaches that are addressing issues and challenges of Big Data with the theory of Vs such as 3 V's, 5 V's, 7 V's etc. The objective of this work is to explore and investigate the status of the current Big Data domain. Further, a comprehensive overview of Big Data, its characteristics, opportunities, issues, and challenges have been explored and described with the help of 51 V's. The outcome of this research will help in understanding the Big Data in a systematic way.", "venue": "Coins", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Review"], "publicationDate": "2019-05-05", "journal": {"name": "Proceedings of the International Conference on Omni-Layer Intelligent Systems"}, "authors": [{"authorId": "2006808", "name": "Nawsher Khan"}, {"authorId": "122944710", "name": "Arshi Naim"}, {"authorId": "73516368", "name": "Mohammad Rashid Hussain"}, {"authorId": "35695761", "name": "Q. Naveed"}, {"authorId": "50693085", "name": "Naim Ahmad"}, {"authorId": "121403056", "name": "S. Qamar"}], "citations": [{"paperId": "3d2436c46db125778328200280a75f44861542ea", "title": "A Novel Multidimensional Reference Model For Heterogeneous Textual Datasets Using Context, Semantic And Syntactic Clues"}, {"paperId": "b55e494222e5fd2cb2e8c901c90b07d3848ce463", "title": "A Review of Modern Approaches of Digitalization in Oil and Gas Industry"}, {"paperId": "436e717b3acd1951eccbf984c06f5363c2d7790e", "title": "Formally specifying and coinductive approach to verifying synthesis of stream calculus-based computing big data in livestream"}, {"paperId": "4e7264d4a3c0888e55fe9d562512fb7fc2c64691", "title": "Declarative and Linear Programming Approaches to Service Placement, Reconciled"}, {"paperId": "2f849b9ead5fc104c620198cce6d74fcb82ad090", "title": "Big Data Analytics, Processing Models, Taxonomy of Tools, V’s, and Challenges: State-of-Art Review and Future Implications"}, {"paperId": "13a1a68e17afb55a994745f2951b8ab5008cc6a7", "title": "Big data in contemporary electron microscopy: challenges and opportunities in data transfer, compute and management"}, {"paperId": "adf7153722edf8c009272b763b9b6cdec1c3658c", "title": "Model for Verifying the Reliability of Candidate Data Based on Blockchain Technology"}, {"paperId": "59b77f8a7d0e3afb7fdf37a7d9c4aec05072667b", "title": "State-of-the-Art Load Balancing Algorithms for Mist-Fog-Cloud Assisted Paradigm: A Review and Future Directions"}, {"paperId": "b1ba7b3c810db1445895a8aa92ce74dce98c4c1b", "title": "The benefits and challenges of applying Blockchain technology into Big Data: A literature review"}, {"paperId": "7ce2bd2fd3e71fafcdabe1c2b8cdf577e3a700f8", "title": "Privacy Prevention of Big Data Applications: A Systematic Literature Review"}, {"paperId": "50371393163480ceebe6aeb059e5a535d25a4a03", "title": "Recent Advances in Evolving Computing Paradigms: Cloud, Edge, and Fog Technologies"}, {"paperId": "5704bdb2980ff80145a00317b8229bf0a9874718", "title": "Quality Assurance in Big Data Engineering - A Metareview"}, {"paperId": "96b3fb1c5677d7b2eb71e40d0f516512432ac6dc", "title": "Exploring data mining: facets and emerging trends"}, {"paperId": "460fe82c38c731b89381371ba68d0b3a5e916a6d", "title": "Consumer Behavior for Health Services: A Psychological Approach"}, {"paperId": "31c514d2d23fb72af7527544eb3d1f8285a7838f", "title": "E-Learning Acceptance: The Role of Task–Technology Fit as Sustainability in Higher Education"}, {"paperId": "5de65569fc95ee3413820ec8914b211f7ad75b26", "title": "Big data and predictive analytics in healthcare in Bangladesh: regulatory challenges"}, {"paperId": "8382e51718f16c80472f13ad365a4b2c96acdc6c", "title": "E-Learning Services to Achieve Sustainable Learning and Academic Performance: An Empirical Study"}, {"paperId": "9b6beb0096550b4d5614b1109a8db4bd90d3658c", "title": "Considerations for a More Ethical Approach to Data in AI: On Data Representation and Infrastructure"}, {"paperId": "de58b87a794ded1ac349b9af4eeef2f83db01c38", "title": "A review of drought monitoring with big data: Issues, methods, challenges and research directions"}, {"paperId": "ce13b0a6d585eaa7a61095238b11ba9ac75d364c", "title": "Big Data Analytics: Importance, Challenges, Categories, Techniques, and Tools"}, {"paperId": "394b09194aeb6a2baf62418386e972c4417cf12e", "title": "A Roadmap Towards Big Data Opportunities, Emerging Issues and Hadoop as a Solution"}, {"paperId": "db286829ea23a85d2843171aa81cad3b3480f66f", "title": "Smart Data based Ensemble for Imbalanced Big Data Classification"}, {"paperId": "65bc03d7d80c985e359a342c7dca77d9836b02ea", "title": "Smart Data driven Decision Trees Ensemble Methodology for Imbalanced Big Data"}, {"paperId": "a0453ea5287c1e311b344daaac5257e661d34413", "title": "E-Banking Satisfaction and Post-Adoption Behavior in Saudi Arabia: An Empirical Study"}, {"paperId": "2cb8fc7f00060484d876bc9816873ec9a043e6a8", "title": "A Generic Architectural Framework for Machine Learning on Data Streams"}, {"paperId": "9ac9a77dc24c37c5dc9ba146a7604179adf94a90", "title": "A N EW M ODEL FOR C OLLECTING , S TORING , AND A NALYZING B IG D ATA ON C USTOMER F EEDBACK IN THE T OURISM I NDUSTRY"}, {"paperId": "cf4d05c1ad68e95bcc5095e53bb42decb1a74b0f", "title": "Ethical considerations surrounding health-related big data research."}, {"paperId": "190d67671ef1882086e03ecd881aca3d716f144f", "title": "Harnessing Big Data Analytics for Healthcare: A Comprehensive Review of Frameworks, Implications, Applications, and Impacts"}, {"paperId": "55c1d400109cdf8ee5cc1f4e0f05ba7c5eadb28a", "title": "Big Data, Big Data Analytics application to Smart home technologies and services for geriatric rehabilitation"}, {"paperId": "0709fda3cb00dfc3b03ad042bbda869a5b689022", "title": "Domain and Challenges of Big Data and Archaeological Photogrammetry With Blockchain"}, {"paperId": "577c3b968f4327561c78f383b372f2fd80d24dc1", "title": "Providing Clarity on Big Data: Discussing Its Definition and the Most Relevant Data Characteristics"}, {"paperId": "19b4e672e1193d12bdec6711e4501fb9ff69fbf7", "title": "A Methodology guided by Decision Trees Ensemble and Smart Data for Imbalanced Big Data"}, {"paperId": "8281b3e87965cbf2fa9f8bc066f08fd9108ef850", "title": "Knowledge Graphs and Big Data Processing"}, {"paperId": "9c853e8cdb2324541dc0cfadda8112e958fa9bca", "title": "Data Science for Big Data Applications and Services: Data Lake Management, Data Analytics and Visualization"}, {"paperId": "52ab621efb7d9a666f57f9e60dac672fb008a879", "title": "Interoperability Effect in Big Data"}, {"paperId": "720b66ce809c2508a9fba450a6df8c3cce3c7e73", "title": "Enterprise Information Systems: 21st International Conference, ICEIS 2019, Heraklion, Crete, Greece, May 3–5, 2019, Revised Selected Papers"}, {"paperId": "e94811e8600080eddaafa63af6d892a14575906c", "title": "Efficient Approximate Big Data Clustering: Distributed and Parallel Algorithms in the Spectrum of IoT Architectures"}, {"paperId": "fb4af2c7b25319f894995f5f6f988cbef1a75e0c", "title": "Cloud Based IoT Architecture"}]}
