{"paperId": "bf956338ad31226bfa921d8d7a3f9de1ed584c9f", "publicationVenue": {"id": "06085d8f-fb14-4103-852b-b002794e0a7e", "name": "Mathematical Modelling of Natural Phenomena", "type": "journal", "alternate_names": ["Math Model Nat Phenom"], "issn": "0973-5348", "url": "https://www.mmnp-journal.org/"}, "title": "Exact insurance premiums for cyber risk of small and medium-sized enterprises", "abstract": "As cyber attacks have become more frequent, cyber insurance premiums have increased, resulting in the need for better modeling of cyber risk. Jevtic and Lanchier[20] proposed a dynamic structural model of aggregate loss distribution for cyber risk of small-and-medium-sized enterprises under the assumption of a tree-based local-area-network topology that consists of the combination of a Poisson process, homogeneous random trees, bond percolation processes, and cost topology. Their model assumes that the contagion spreads through the edges of the network with the same fixed probability in both directions, thus overlooking a dynamic cyber security environment implemented in most networks, and their results give an exact expression for the mean of the aggregate loss but only a rough upper bound for the variance. In this paper, we consider a bidirectional version of their percolation model in which the contagion spreads through the edges of the network with a certain probability moving toward the lower level assets of the network but with another probability moving toward the higher level assets of the network. Also, our different mathematical approach leads to exact expressions for both the mean and the variance of the aggregate loss, and therefore an exact expression for the insurance premiums.", "venue": "Mathematical Modelling of Natural Phenomena", "year": 2021, "fieldsOfStudy": ["Mathematics"], "publicationTypes": null, "publicationDate": "2021-10-17", "journal": {"name": "Mathematical Modelling of Natural Phenomena"}, "authors": [{"authorId": "148024570", "name": "Stefano Chiaradonna"}, {"authorId": "3365931", "name": "N. Lanchier"}], "citations": [{"paperId": "8c26b22b206246855db593834ebd5766649cd3f8", "title": "Evaluating cyber loss in star-ring and star-bus hybrid networks based on the bond percolation model"}, {"paperId": "4ab932bc75747c26829f0aa5358b29e777c91303", "title": "Framework for cyber risk loss distribution of hospital infrastructure: Bond percolation on mixed random graphs approach"}, {"paperId": "ae7108dfd48ce065c20f74b6ef8221cb27bd27bb", "title": "An Overview of Security Breach Probability Models"}]}
