{"paperId": "bfac7d29d184406bd282cffeb83b7ccaa09185dc", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Insight into the Impact of COVID-19 on Australian Transportation Sector: An Economic and Community-Based Perspective", "abstract": "The Coronavirus Disease 2019 (COVID-19) is a major virus outbreak of the 21st century. The Australian government and local authorities introduced some drastic strategies and policies to control the outspread of this virus. The policies related to lockdown, quarantine, social distancing, shut down of educational institute, work from home, and international and interstate travel bans significantly affect the lifestyle of citizens and, thus, influence their activity patterns. The transport system is, thus, severely affected due to the COVID-19 related restrictions. This paper analyses how the transport system is impacted because of the policies adopted by the Australian government for the containment of the COVID-19. Three main components of the transport sector are studied. These are air travel, public transport, and freight transport. Various official sources of data such as the official website of the Australian government, Google mobility trends, Apple Mobility trends, and Moovit were consulted along with recently published research articles on COVID-19 and its impacts. The secondary sources of data include databases, web articles, and interviews that were conducted with the stakeholders of transport sectors in Australia to analyse the relationship between COVID-19 prevention measures and the transport system. The results of this study showed reduced demand for transport with the adoption of COVID-19 prevention measures. Declines in revenues in the air, freight, and public transport sectors of the transport industry are also reported. The survey shows that transport sector in Australia is facing a serious financial downfall as the use of public transport has dropped by 80%, a 31.5% drop in revenues earned by International airlines in Australia has been predicted, and a 9.5% reduction in the freight transport by water is expected. The recovery of the transport sector to the pre-pandemic state is only possible with the relaxation of COVID-19 containment policies and financial support by the government.", "venue": "Sustainability", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review"], "publicationDate": "2021-01-26", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "71940750", "name": "Hafiz Suliman Munawar"}, {"authorId": "2111181253", "name": "Sara Imran Khan"}, {"authorId": "65883646", "name": "Zakria Qadir"}, {"authorId": "3089801", "name": "A. Kouzani"}, {"authorId": "2065473783", "name": "M. P. Mahmud"}], "citations": [{"paperId": "b488dd842eb19d79f11e48876a016f00a7047c2b", "title": "Energy‐saving technologies and energy efficiency in the post‐COVID era"}, {"paperId": "0c9f5f03d8de84b20b05f5f5d94f4a3085b09696", "title": "Visual Detection of Road Cracks for Autonomous Vehicles Based on Deep Learning"}, {"paperId": "f2bf1796fe2c8028056d998b22fd6313aa6f915b", "title": "Energy-saving technologies and energy efficiency in the post-pandemic world"}, {"paperId": "8d43689e386adf04f4c2718f5640f581c3d8e205", "title": "The resilience of public transport post-COVID: The case of Great Britain"}, {"paperId": "6c455d4bbaeda14a3b2f7365a41a3031508c773e", "title": "EXPLORING ECONOMIC EFFECTS OF WORK OUT OF COMPANY OFFICE BASED ON BIBLIOMETRIC ANALYSIS"}, {"paperId": "ecea70fd828c07ecd3b9e9065d89b244e13fc2ed", "title": "Change of urban park usage as a response to the COVID-19 global pandemic"}, {"paperId": "a901293c923445333d0192315ee33ec10affc86f", "title": "COVID-19 and Public Transport in Auckland, New Zealand: Investigating Vulnerable Population Groups’ Ridership Behavior"}, {"paperId": "1c9da8932553f248950b6ae8e11175c1013b9783", "title": "ANÁLISE DOS IMPACTOS DA PANDEMIA DO COVID-19 NO TRANSPORTE PÚBLICO POR ÔNIBUS NO BRASIL"}, {"paperId": "7bfd133bf2ee3e40b096d8173e23aa120f61a9b7", "title": "Innovative Data Visualization Tools: Facilitating Logistics Management in Times of Crisis"}, {"paperId": "e7fcd42cfca93eacfc1d595153a07dd6ed65a8f8", "title": "An empirical investigation of COVID-19 impact on the finance and human resources of logistics and supply chain companies in Oman"}, {"paperId": "07aabe36cf93304ebafa055b97f675cbf5190ceb", "title": "Google and Apple mobility data as predictors for European tourism during the COVID-19 pandemic: A neural network approach"}, {"paperId": "57a5cd7798f817feffaa50d1f3585f4cb2a1a0ca", "title": "Reviving a City’s Economic Engine: The COVID-19 Pandemic Impact and the Private Sector’s Engagement in Bandung City"}, {"paperId": "a827236640cf371c54cb9415e9b1eb1b159111c8", "title": "Passenger Perceptions, Information Preferences, and Usability of Crowding Visualizations on Public Displays in Transit Stations and Vehicles"}, {"paperId": "803f6b9f579af12387a273d82337ef0ff83210d6", "title": "India’s public transportation system: the repercussions of COVID-19"}, {"paperId": "4e03262ade6548d0664a0daffb50c0bc7d75d240", "title": "A Demand Systems Approach to Understanding\n Medium‐Term Post‐Pandemic\n Consumption Trends"}, {"paperId": "9c425aa5f5b43bf8debf04edbc5798112b020c64", "title": "Study of COVID-19 impact on users' perception for transport modes choice in India"}, {"paperId": "f1ec4d2fc3191ba5529ae1506380332a9e2a1262", "title": "Factors affecting public transport performance due to the COVID-19 outbreak: A worldwide analysis"}, {"paperId": "fb041f9462c237d114a5e71a6123fe093d82bc65", "title": "Modeling the resilience of urban mobility when exposed to the COVID-19 pandemic: A qualitative system dynamics approach"}, {"paperId": "cdbe0e82bce18b87853e93f1c3f0f43556d0ce83", "title": "Local travel behaviour under continuing COVID-19 waves– A proxy for pandemic fatigue?"}, {"paperId": "af100772d7c80041db8c207a4a8f818a2b73b35c", "title": "Work from home amid black swan event (Covid-19): a bibliometric analysis from a social science perspective"}, {"paperId": "30412c25c070709eeb9266b0ec637acbf32b76f8", "title": "The Apple Mobility Trends Data in Human Mobility Patterns during Restrictions and Prediction of COVID-19: A Systematic Review and Meta-Analysis"}, {"paperId": "a50827302b760c6bcfc8370d58fe17b3c4340208", "title": "Forecasting and Trend Analysis Bus Transportation During COVID-19 in Bali Land Using Time Series Method"}, {"paperId": "f99664879bd6ec1b6101fb8b4f213c0ac3224540", "title": "Working from home in Australian cities as a catalyst for place-making?"}, {"paperId": "f2b90e05a0e9c6719c58c88eaa3079b9111d7ba5", "title": "Exploring the Health and Economic Burden Among Truck Drivers in Australia: A Health Economic Modelling Study"}, {"paperId": "9437eb070e94aac372ee93f81da5b812a1141f52", "title": "Innovative strategies to tackle post-Covid-19 tourism: case of small tourism companies"}, {"paperId": "e1fb6390b2764914ad6e5e80c85cf3ea71ff8eeb", "title": "A Review of COVID-19-Related Literature on Freight Transport: Impacts, Mitigation Strategies, Recovery Measures, and Future Research Directions"}, {"paperId": "69e2bbeb0f0a1793d8c986d9dafc60bfe9abdaf2", "title": "Google Mobility Data as a Predictor for Tourism in Romania during the COVID-19 Pandemic—A Structural Equation Modeling Approach for Big Data"}, {"paperId": "f9c33bdab0ead4883c2d37338bc35c4e82949abe", "title": "Analysis of Bilateral Air Services Agreement Liberalization in Australia"}, {"paperId": "c762a68a5eee112f11888d46ffdb6d1d405c7de8", "title": "Crack Detection in Concrete Structures Using Deep Learning"}, {"paperId": "28e10af9e50da3ea017e19129a793e1542971fa9", "title": "Una mirada al transporte público en tiempos de pandemia: revisión sistemática"}, {"paperId": "b0969e9702a78c1fdec5b8a3c272a8e8e87591f8", "title": "The Impacts of a COVID-19 Related Lockdown (and Reopening Phases) on Time Use and Mobility for Activities in Austria—Results from a Multi-Wave Combined Survey"}, {"paperId": "fe05594a0f7f1ffd6d8e50a53073bbb4eb03c59c", "title": "Associations between COVID-19 Pandemic, Lockdown Measures and Human Mobility: Longitudinal Evidence from 86 Countries"}, {"paperId": "8aa241f8c130affa3397fbd25427c6ca39d509e3", "title": "Factors influencing changes in medication-taking and driving behavior after warnings about prescription medications that prohibit driving: an online survey"}, {"paperId": "5fb20d2c016868d4e1da2ca0bf9b7dcbfbf7c438", "title": "A systematic review of the impacts of the coronavirus crisis on urban transport: Key lessons learned and prospects for future cities"}, {"paperId": "df72ec05e877b2276ca02b5e09656e964f21cd09", "title": "Analysis of the Relationship between the Characteristics of the Areas of Influence of Bus Stops and the Decrease in Ridership during COVID-19 Lockdowns"}, {"paperId": "34b3b341829bf1a1d8f94aeecbdd469e74b69f4b", "title": "COVID-19 effects on urban driving, walking, and transit usage trends: Evidence from Indian metropolitan cities"}, {"paperId": "a52fe25f1381c63122dd7833c73d38b82ada2999", "title": "Determining the Impacts of COVID-19 on Urban Deliveries in the Metropolitan Region of Belo Horizonte Using Spatial Analysis"}, {"paperId": "f72336cc36173cd462022cc12b0cecf565950a03", "title": "Big Data Management in Drug-Drug Interaction: A Modern Deep Learning Approach for Smart Healthcare"}, {"paperId": "a0949af71b268480b4cb6a87f77cb56ac32bdc0b", "title": "Psychological and financial impacts of COVID-19-related travel measures: An international cross-sectional study"}, {"paperId": "66619375a03bb9751dc86e2ec2654de67e2a0b7c", "title": "Automatic Target Detection from Satellite Imagery Using Machine Learning"}, {"paperId": "442bce62f03141bf183b011eda8df276c1c39ee2", "title": "Wishful thinking? Addressing the long-term implications of COVID-19 for transport in Nigeria"}, {"paperId": "bf6b994a579b1a8b74dfd6d5ba3dc5888fd86188", "title": "Using Adaptive Sensors for Optimised Target Coverage in Wireless Sensor Networks"}, {"paperId": "cbabebf0ba41ae2020ea79eef68cf23e08d74f77", "title": "Covid-19 Declines: The Implications for the End of the Pandemic"}, {"paperId": "84c5e10a5ff973bf76a7171f68c22556047e5e14", "title": "Pandemic resilient cities: Possibilities of repairing Polish towns and cities during COVID-19 pandemic"}, {"paperId": "50188173d1b50df800ed7da788b98493753a7864", "title": "Cloud- and Fog-Integrated Smart Grid Model for Efficient Resource Utilisation"}, {"paperId": "00aa9ecab8906642046c37df9f47b096fbfefbb3", "title": "Promoting Customer Loyalty and Satisfaction in Financial Institutions through Technology Integration: The Roles of Service Quality, Awareness, and Perceptions"}, {"paperId": "dd806a3421b1fb7675746657ec002b2cd3526383", "title": "Prediction of the Infectious Outbreak COVID-19 and Prevalence of Anxiety: Global Evidence"}, {"paperId": "6e53924e5a5d84a553fad3b207bd3ec698071cf8", "title": "Effects of COVID-19 on the Australian Economy: Insights into the Mobility and Unemployment Rates in Education and Tourism Sectors"}, {"paperId": "ccb0f39543f7183e88a0a8e99c5caa90bbce032b", "title": "From Urban-Scape to Human-Scape: COVID-19 Trends That will Shape Future City Centres"}, {"paperId": "e870f94a9e177e5a2cfb76c2b721f2a4cc6d2006", "title": "Solar energy sector under the influence of Covid-19 pandemic: A critical review"}, {"paperId": "50654e1ff99b26dcd01877fb0da2a790cb0e238c", "title": "COVID-19 passenger transport measures and their impacts"}, {"paperId": "dd34da7884ead4cda8eb2744992ae026013371f6", "title": "The impacts of the COVID-19 pandemic on transportation employment: A comparative analysis"}, {"paperId": "13670dc3283814b383602abbe7a5a463986d9490", "title": "Insights into the Mobility Pattern of Australians during COVID-19"}, {"paperId": "d72e99afc637b9c1437262962563f440f5608e84", "title": "Spatiotemporal variation of the worldwide air transportation network induced by COVID-19 pandemic in 2020"}, {"paperId": "5a95d24bd2ddad351ca1de7bc4c93af449f191b8", "title": "Liquidity Loans as an Element of Support for the SME Sector during the COVID-19 Pandemic in the Area of Central Pomerania"}, {"paperId": "9ab7f896c027cbbfa67b37a6c13c65755a02c846", "title": "Seaports during the COVID-19 Pandemic: The Terminal Operators’ Tactical Responses to Disruptions in Maritime Supply Chains"}, {"paperId": "d57d21856bf6cb1a056cc01921d7f74e0ac13c87", "title": "A Gabor Filter-Based Protocol for Automated Image-Based Building Detection"}, {"paperId": "b30abe0c589d013ea4556165de9f9a5dfc33871c", "title": "“No Entry into New South Wales”: COVID-19 and the Historic and Contemporary Trajectories of the Effects of Border Closures on an Australian Cross-Border Community"}, {"paperId": "cf77f5250451ecf1bbbf49ff0903b897b9315fa7", "title": "Environmental Footprint Assessment of a Cleanup at Hypothetical Contaminated Site"}, {"paperId": "93ade132a6eb42353b3d65e90a9cbf321d21cddd", "title": "Theory of Reasoned Action dan Literasi Teknologi terhadap Adaptasi Perubahan Teknologi"}, {"paperId": "bff9f6ebed1e5df206fecc93a44caba4dcc4697a", "title": "The Effect of Mobility on the Spread of COVID-19 in Light of Regional Differences in the European Union"}, {"paperId": "c0bd3dc8c0340e0c4015acdbc542767f348908bb", "title": "IoT Technologies during and Beyond COVID-19: A Comprehensive Review"}, {"paperId": "2911c90a6e068824f3bba5a1d7b854ec20e91e3f", "title": "Undergraduate Students Transportation Behavior : A Report on How to Promote Active Transportation in a COVID Society"}, {"paperId": "f51b84e9fef764cd2b0874846afe42b0ad1e9ef3", "title": "What Causes Aviation Sanctions? A Systematic Review"}, {"paperId": "0d1afb1657faf93487b08f46850ee3d4395c8a81", "title": "Impact of COVID-19 on Shaping Comprehensive Services Within Intermodal Terminals"}, {"paperId": "722da068bf39ad03ed82640bb6d8b27d71e34a70", "title": "Using Microsoft Power BI and Data Visualization Tools to Study How Online Shopping was Affected During COVID19 Period: A Comparison in Three Countries Between 2019 and 2020"}]}
