{"paperId": "bfb2b0b0d0621ea4de93fb960d45a4c5bbabcc38", "publicationVenue": null, "title": "ByteCard: Enhancing ByteDance's Data Warehouse with Learned Cardinality Estimation", "abstract": "Cardinality estimation is a critical component and a longstanding challenge in modern data warehouses. ByteHouse, ByteDance's cloud-native engine for big data analysis in exabyte-scale environments, serves numerous internal decision-making business scenarios. With the increasing demand of ByteHouse, cardinality estimation becomes the bottleneck for efficiently processing queries. Specifically, the existing query optimizer of ByteHouse uses the traditional Selinger-like cardinality estimator, which can produce huge estimation errors, resulting in sub-optimal query plans. To improve cardinality estimation accuracy while maintaining a practical inference overhead, we develop ByteCard framework that enables efficient training/updating and integration of cardinality estimators. Furthermore, ByteCard adapts recent advances in cardinality estimation to build models that can balance accuracy and practicality (e.g., inference latency, model size, training/updating overhead). We observe significant query processing speed-up in ByteHouse after replacing the system's existing cardinality estimation with ByteCard's estimations for several optimization strategies. Evaluations on real-world datasets show the integration of ByteCard leads to an improvement of up to 30% in the 99th quantile of latency. At last, we share our valuable experience in engineering advanced cardinality estimators. We believe this experience can help other data warehouses integrate more accurate and sophisticated solutions on the critical path of query execution.", "venue": "", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2024-03-24", "journal": null, "authors": [{"authorId": "2293357630", "name": "Yuxing Han"}, {"authorId": "2293352304", "name": "Haoyu Wang"}, {"authorId": "2224968407", "name": "Lixiang Chen"}, {"authorId": "2293324584", "name": "Yifeng Dong"}, {"authorId": "2293298476", "name": "Xing Chen"}, {"authorId": "2294308376", "name": "Benquan Yu"}, {"authorId": "2293358463", "name": "Chengcheng Yang"}, {"authorId": "2293286826", "name": "Weining Qian"}], "citations": []}
