{"paperId": "bfbe85edac8c230524ea6476ca1a3535b3a15996", "publicationVenue": {"id": "2506fdab-c6b6-4192-b76f-ddf5b3b306e6", "name": "Disaster Advances", "type": "journal", "alternate_names": ["Disaster Adv"], "issn": "0974-262X", "url": "https://www.disasterjournal.net/"}, "title": "A review of the application of support vector machines in landslide susceptibility mapping", "abstract": "Landslide is a part of natural natural disasters that causes fatalities to humans, destroys property and overwhelms the regional economy. Various landslide evaluation attempts have been utilized to determine the landslide susceptibility values. Machine learning (ML) has been used in numerous research areas including geotechnical disciplines to produce an effective model to resolve the geotechnical challenge. The ML model has been adopted to produce a landslide susceptibility map (LSM) in many studies with various types and algorithms. This review paper discusses the ML approach used to develop LSM with specific approaches: Support Vector Machine (SVM). The basic principle of ML in producing the LSM is determined and discussed. The study also provides information on the types of validation and performance of the model in developing LSM. SVM and its hybrid model were found to yield good performance in producing LSM in most of the studies with SVM outperforming most of the other ML approaches. This research contributes to the landslide mapping field by providing a readily available, State-of-the-Art reference for researchers, practitioners and local authorities in producing efficient and reliable LSM based on the SVM principle.", "venue": "Disaster Advances", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-10-15", "journal": {"name": "Disaster Advances"}, "authors": [{"authorId": "2258723395", "name": "Mohamed Khatif"}, {"authorId": "2258723389", "name": "Tawaf Mohamed Yusof"}, {"authorId": "2258723393", "name": "Ahmad Safuan"}, {"authorId": "2258725636", "name": "A. Rashid"}, {"authorId": "101331584", "name": "N. Apandi"}, {"authorId": "108125578", "name": "Mohd Faisal Bin"}, {"authorId": "104400099", "name": "Abdul Khanan"}, {"authorId": "2258723586", "name": "Muhammad Zulkarnain Bin"}, {"authorId": "2258941713", "name": "Abdul Rahman"}], "citations": []}
