{"paperId": "bfc8a29fe76bfe515f391302ff5e6b255b6db61e", "publicationVenue": {"id": "c0ded351-0e49-473e-816e-23b84c9f8dd3", "name": "Frontiers in Environmental Science", "type": "journal", "alternate_names": ["Front Environ Sci"], "issn": "2296-665X", "url": "http://www.frontiersin.org/Environmental_Science", "alternate_urls": ["https://www.frontiersin.org/journals/environmental-science"]}, "title": "SmartAirQ: A Big Data Governance Framework for Urban Air Quality Management in Smart Cities", "abstract": "Rapid urbanization across the world has put an enormous burden on our environment. Cities from developing countries, in particular, are experiencing high air pollution levels. To address this challenge, the new WHO global air quality guidelines and various nations are mandating cities to implement clean air measures. However, these implementations are largely hindered by limited observations, siloed city operations, absence of standard processes, inadequate outreach, and absence of collaborative urban air quality management (UAQM) governance. The world is experiencing transformative changes in the way we live. The 4th industrial revolution technologies of artificial intelligence, Internet of Things, big data, and cloud computing bridge gaps between physical, natural, and personal entities. Globally, smart cities are being promulgated on the premise that technologies and data aid in improving urban services. However, in many instances, the smart city programs and UAQM services may not be aligned, thereby constraining the cumulative advantage in building urban resilience. Considering the potential of these technologies as enablers of environmental sustainability, a conceptual urban computing framework “SmartAirQ” for UAQM is designed. This interdisciplinary study outlines the SmartAirQ components: 1) data acquisition, 2) communication and aggregation, 3) data processing and management, 4) intelligence, 5) application service, 6) high-performance computing- (HPC-) cloud, and 7) security. The framework has integrated science cloud and urban services aiding in translating scientific data into operations. It is a step toward collaborative, data-driven, and sustainable smart cities.", "venue": "Frontiers in Environmental Science", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-04-08", "journal": {"volume": "10"}, "authors": [{"authorId": "2608034", "name": "A. Kaginalkar"}, {"authorId": "2109681400", "name": "Shamita Kumar"}, {"authorId": "2776207", "name": "P. Gargava"}, {"authorId": "2132688373", "name": "Neelesh Kharkar"}, {"authorId": "2077318643", "name": "D. Niyogi"}], "citations": [{"paperId": "1c93c359a4ab7ad0e9224db23e458fb5e81897ea", "title": "The Power of Big Data: The Impact of Urban Digital Transformation on Green Total Factor Productivity"}, {"paperId": "69415cddff11a61c5471e386098c7a69d0f1dac3", "title": "Smart Environment: AI-Driven Predictions and Forecasting of Air Quality"}, {"paperId": "60f9bb94181eba4c0c512b477a6d7e2710c93e84", "title": "Data management of salt cavern gas storage based on data model"}, {"paperId": "8492af741e6a656d96e8909d1db7e4ab1c7b59d8", "title": "Stakeholder analysis for designing an urban air quality data governance ecosystem in smart cities"}, {"paperId": "6e95c536976688bfa2c73488464e4836eeb13247", "title": "Involvement of Local Authorities in the Protection of Residents’ Health in the Light of the Smart City Concept on the Example of Polish Cities"}, {"paperId": "1a50b1619b9475c88d340ad6898e56f33d798da6", "title": "Development of environmental economy and management in the age of AI based on green finance"}, {"paperId": "09d794e28ff70ae6d42b94fc860926abecf1caf3", "title": "Development of current and future high-resolution gridded emission inventory of anthropogenic air pollutants for urban air quality studies in Hanoi, Vietnam"}, {"paperId": "836487dcb0ad34378ae07484185735624825a7ef", "title": "SOFTWARE ANALYSIS OF RADIATION AIR POLLUTION STREAMING DATA"}]}
