{"paperId": "bfcb3a52cac1cd1ff719a7fa8dd4e0b3f3b4a91a", "publicationVenue": {"id": "43893b55-fde6-4e2b-9d2e-c15a669a1f94", "name": "ACM Symposium on Parallelism in Algorithms and Architectures", "type": "conference", "alternate_names": ["SPAA", "ACM Symposium on Parallel Algorithms and Architectures", "ACM Symp Parallelism Algorithm Archit", "ACM Symp Parallel Algorithm Archit"], "url": "http://www.spaa-conference.org/"}, "title": "Deterministic Massively Parallel Symmetry Breaking for Sparse Graphs", "abstract": "We consider the problem of designing deterministic graph algorithms for the model of Massively Parallel Computation (MPC) that improve with the sparsity of the input graph, as measured by the standard notion of arboricity. For the problems of maximal independent set (MIS), maximal matching (MM), and vertex coloring, we improve the state of the art as follows. Let λ denote the arboricity of the n-node input graph with maximum degree Δ. MIS and MM We develop a low-space MPC algorithm that deterministically reduces the maximum degree to poly(λ) in O(log log n) rounds, improving and simplifying the randomized O(log log n)-round poly(max(λ, log n))-degree reduction of Ghaffari, Grunau, Jin [DISC'20]. Our approach when combined with the state-of-the-art O(log Δ + log log n)-round algorithm by Czumaj, Davies, Parter [SPAA'20, TALG'21] leads to an improved deterministic round complexity of O(log λ + log log n). The above MIS and MM algorithm however works in the setting where the global memory allowed, i.e., the number of machines times the local memory per machine, is superlinear in the input size. We extend them to obtain the first low-space MIS and MM algorithms that work with linear global memory. Specifically, we show that both problems can be solved in deterministic time O(log λ · log logλ n), and even in O(log log n) time for graphs with arboricity at most logO(1) log n. In this setting, only a O(log2 log n)-running time bound for trees was known due to Latypov and Uitto [ArXiv'21]. Vertex Coloring We present a O(1)-round deterministic algorithm for the problem of O(&955;)-coloring in the linear-memory regime of MPC, with relaxed global memory of n · poly(&955;). This matches the round complexity of the state-of-the-art randomized algorithm by Ghaffari and Sayyadi [ICALP'19] and significantly improves upon the deterministic O(&955;ε )-round algorithm by Barenboim and Khazanov [CSR'18]. Our algorithm solves the problem after just one single graph partitioning step, in contrast to the involved local coloring simulations of the above state-of-the-art algorithms. Using O(n + m) global memory, we derive a O(log λ)-round algorithm by combining the constant-round (Δ + 1)-list-coloring algorithm by Czumaj, Davies, Parter [PODC'20, SIAM J. Comput.'21] with that of Barenboim and Khazanov.", "venue": "ACM Symposium on Parallelism in Algorithms and Architectures", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2023-01-26", "journal": {"name": "Proceedings of the 35th ACM Symposium on Parallelism in Algorithms and Architectures"}, "authors": [{"authorId": "35266350", "name": "Manuela Fischer"}, {"authorId": "2126049565", "name": "Jeff Giliberti"}, {"authorId": "46358033", "name": "C. Grunau"}], "citations": [{"paperId": "288af42f228748c3609ca8d94a94cc3df250bebd", "title": "Conditionally Optimal Parallel Coloring of Forests"}]}
