{"paperId": "bfcd3d33f668e7a9ad164411ffb1279594ce44fb", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "A Study on Heuristic Task Scheduling Optimizing Task Deadline Violations in Heterogeneous Computational Environments", "abstract": "In this paper, we focus on the problem of optimizing deadline violations for executing tasks in various heterogeneous computational environments. To address the problem, we formulated it as a binary nonlinear programming (BNP) model, which maximize the number of completed tasks and optimize the resource utilization of servers. To solve the BNP model in a polynomial complexity, we propose a heuristic task scheduling method, which iteratively schedules a task to the first core such that the accumulated slack time of all scheduled tasks is minimum, until the core cannot finish any task, and executes tasks with the earliest deadline first in each core to execute as many task as possible in a core. Experiment results based on a real world trace show that our method has upto 100% less task violations, and has the best performance in resource efficiency optimization in overall, compared with eight classical and state-of-the-art heuristic methods.", "venue": "IEEE Access", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-11-16", "journal": {"name": "IEEE Access", "pages": "205635-205645", "volume": "8"}, "authors": [{"authorId": "2153207292", "name": "Bo Wang"}, {"authorId": "1806132", "name": "Ying Song"}, {"authorId": "2146408571", "name": "Changhai Wang"}, {"authorId": "2439315", "name": "Wanwei Huang"}, {"authorId": "1825704746", "name": "Xiaoyun Qin"}], "citations": [{"paperId": "71bf469a4554da2fe2a5b380c4ba6d42620e80b7", "title": "A secure solution based on load-balancing algorithms between regions in the cloud environment"}, {"paperId": "7c1f101476494c7de5b922b8e27641a7929cef8c", "title": "Optimizing deadline violation time and energy consumption of IoT jobs in fog–cloud computing"}, {"paperId": "e3da466f0f0cd07217e63d2c5fb4c63651fa1500", "title": "Efficient Delay-Aware Task Scheduling for IoT Devices in Mobile Cloud Computing"}, {"paperId": "f55bde84b820694edd599824badbda76ea5dffef", "title": "A three-stage heuristic task scheduling for optimizing the service level agreement satisfaction in device-edge-cloud cooperative computing"}]}
