{"paperId": "bfd1d71b8d81aea6bcd2f7c7a854815f68dcfb1e", "publicationVenue": {"id": "312ca99c-9149-490d-813e-c60d5e949f65", "name": "Concurrency and Computation", "type": "journal", "alternate_names": ["Concurr Comput Pract Exp", "Concurrency and Computation: Practice and Experience", "Concurr Comput"], "issn": "1532-0626", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/77004395?CRETRY=1&SRETRY=0", "alternate_urls": ["http://www3.interscience.wiley.com/cgi-bin/jtoc?ID=77004395", "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1532-0634"]}, "title": "Mathematical formulation and hybrid meta‐heuristic algorithms for multiproduct oil pipeline scheduling problem with tardiness penalties", "abstract": "The system under investigation contains a single refinery, a unique distribution center, and a multiproduct pipeline. The basic aim is to plan the optimal sequence for pumping products to achieve financial benefit and satisfy the customers with on‐time delivery. In this study, some restrictions (such as batch sizing, discharging rate, forbidden sequences, and settling periods) are considered and the problem is formulated as a MILP model. Although the multiproduct pipeline scheduling problem has high time complexity, meta‐heuristic algorithms have been used rarely in the literature. Another contribution of this work is to develop several meta‐heuristic algorithms to solve the proposed MILP effectively. Therefore, as a novelty, some classical meta‐heuristics like population‐based simulated annealing and population‐based variable neighborhood search are hybridized by the gravitational search algorithm for obtaining better performance. Parameters of the algorithms are tuned by an optimization problem and then all algorithms are compared by numerical examples. The achieved results demonstrate the validity of the model and the efficient performance of the proposed algorithms against exact methods. These algorithms also lead to better solutions in much lower computational time. Among them, the hybrid algorithm obtained by combining the SA and GSA meta‐heuristics are superior to the other algorithms.", "venue": "Concurrency and Computation", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-04-06", "journal": {"name": "Concurrency and Computation: Practice and Experience", "volume": "33"}, "authors": [{"authorId": "2125482015", "name": "F. K. Goudarzi"}, {"authorId": "143750441", "name": "H. Maleki"}, {"authorId": "2898332", "name": "S. Niroomand"}], "citations": [{"paperId": "2980f7b25da8ce3feeb7af08448f45fc9551f0f6", "title": "An optimization framework for scheduling multi-period multi-product oil pipeline systems under belief degree-based uncertain parameters"}, {"paperId": "19a060afc3563e85cd5c310f372b5144b0373516", "title": "Multi‐objective location‐allocation‐routing problem of perishable multi‐product supply chain with direct shipment and open routing possibilities under sustainability"}]}
