{"paperId": "bff7617fcb58d3314de00ebec0ebb8003eabaa26", "publicationVenue": null, "title": "Video-zilla: An Indexing Layer for Large-Scale Video Analytics", "abstract": "Pervasive deployment of surveillance cameras today poses enormous scalability challenges to video analytics systems operating over many camera feeds. Currently, there are few indexing tools to organize video feeds beyond what is provided by a standard file system. Recent video analytic systems implement application-specific frame profiling and sampling techniques to reduce the number of raw videos processed, leveraging frame-level redundancy or manually labeled spatial-temporal correlation between cameras. This paper presents Video-zilla, a standalone indexing layer between video query systems and a video store to organize video data. We propose a video data unit abstraction, semantic video stream (SVS), based on a notion of distance between objects in the video. SVS implicitly captures scenes, which is missing from current video content characterization and a middle ground between individual frames and an entire camera feed. We then build a hierarchical index that exposes the semantic similarity both within and across camera feeds, such that Video-zilla can quickly cluster video feeds based on their content semantics without manual labeling. We implement and evaluate Video-zilla in three use cases: object identification queries, clustering for training specialized DNNs, and archival services. In all three cases, Video-zilla reduces the time complexity of inter-camera video analytics from linear with the number of cameras to sublinear, and reduces query resource usage by up to 14× compared to using frame-level or spatial-temporal similarity built into existing query systems.", "venue": "SIGMOD Conference", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2022-06-10", "journal": {"name": "Proceedings of the 2022 International Conference on Management of Data"}, "authors": [{"authorId": "2118095167", "name": "Bo Hu"}, {"authorId": "3073889", "name": "Peizhen Guo"}, {"authorId": "7848960", "name": "Wenjun Hu"}], "citations": [{"paperId": "81b2834f3f884785e94a8c4c1b0bf66f858e0d97", "title": "The Image Calculator: 10x Faster Image-AI Inference by Replacing JPEG with Self-designing Storage Format"}, {"paperId": "87ab29cd19e83f6101a2d23b1d66a03f8dcab22d", "title": "Predictive and Near-Optimal Sampling for View Materialization in Video Databases"}, {"paperId": "2da3b8f8049b783911857c53df0f84843059fb53", "title": "Middleware Support for Edge Data Analytics Over Heterogeneous Scenarios"}]}
