{"paperId": "c003ec4e663bd083e3a0611dbd0f95e570da2f68", "publicationVenue": {"id": "5aee8275-5126-4591-8dec-558219db9cce", "name": "International Journal of Social Research Methodology", "type": "journal", "alternate_names": ["Int J Soc Res Methodol"], "issn": "1364-5579", "url": "http://www.tandfonline.com/loi/tsrm20"}, "title": "‘Scraping’ Reddit posts for academic research? Addressing some blurred lines of consent in growing internet-based research trend during the time of Covid-19", "abstract": "ABSTRACT The global scale of Covid-19 has constrained academics from conducting much person-facing research. Reactively, trend is increasing for digital-based methodologies capturing already existing online data. Scholars often ‘scrape’ user-postings from internet forums using coding algorithms and text capture tools, before analysing data, drawing conclusions and publishing findings. The online social news aggregation and discussion website Reddit is a particularly rich source of data for researchers. The public nature of Reddit materials may suggest rationale for user-data to be replicated, analysed and archived; indefinitely and in multiple locations, for scholarly research. However, this position overlooks several key ethical considerations. This paper presents an overview and explanation of Reddit, followed by an exploration of studies that use Reddit-acquired data. Arising ethical issues are discussed, and solutions to salient dilemmas presented. This is to enhance awareness of potential problems and improve protections for those whose data is unknowingly used for research.", "venue": "International Journal of Social Research Methodology", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review"], "publicationDate": "2022-08-18", "journal": {"name": "International Journal of Social Research Methodology", "pages": "47 - 62", "volume": "27"}, "authors": [{"authorId": "2182084803", "name": "Nicholas Norman Adams"}], "citations": [{"paperId": "9c51ca03fe4c74ea93c70156f3a3caa0305d3976", "title": "'There is no justice in nursing school': A qualitative analysis of nursing students' experiences of discrimination shared on Reddit."}, {"paperId": "4479af98eb2df85b97017a746653b9a63b5c7876", "title": "Towards Effective Paraphrasing for Information Disguise"}, {"paperId": "096e8174e19a3f4b5b80d8657c9720c83ad002ca", "title": "Hen Dos and Don’ts: lifting the veil on tensions in consumer rituals"}, {"paperId": "0ba5bb7d2d71dfba05eb8193b32465dd9606061b", "title": "A Triad of Physical Masculinities: Examining Multiple ‘Hegemonic’ Bodybuilding Identities in Anabolic-Androgenic Steroid (AAS) Online Discussion Groups"}, {"paperId": "f14ecd3e57aa820bdf5d83b096571ab53c4beb18", "title": "Toxic Relationships Described by People With Breast Cancer on Reddit: Topic Modeling Study"}, {"paperId": "897c9e24e11c2dd41e42394c457438f0a6a3d545", "title": "On Text-based Personality Computing: Challenges and Future Directions"}]}
