{"paperId": "c0052845823bba22627587796a9442de18e5b739", "publicationVenue": {"id": "472adb76-f5bd-4ad0-a989-08c3a9ccf86e", "name": "Journal of Environmental and Public Health", "type": "journal", "alternate_names": ["J Environ Public Health"], "issn": "1687-9805", "url": "https://www.hindawi.com/journals/jeph/"}, "title": "Integrating Mental Health Education into French Teaching in University Based on Artificial Intelligence Technology", "abstract": "In recent years, there has been a lot of news about college students committing suicide. In the university stage students, self-esteem is stronger and more sensitive, and the ability to withstand pressure is weak. At the same time, college students are in a key stage of mental health development. School education to a certain extent for the cultivation of students' mental health has a crucial impact. In our country, it is undoubtedly the main way to infiltrate mental health education through subject knowledge teaching. French teaching is a good way to infiltrate mental health education. In the learning practice, the improvement of students' mental health levels can strengthen their interest in French learning. Based on this, this paper, from the perspective of French teaching, carries out the infiltration of mental health education in French teaching classes in universities and promotes the cultivation of students' learning abilities and the development of mental health. This paper mainly studies the feature extraction of mental health data, tries to use the optimized BP (backpropagation) neural network to infiltrate the mental health model of college students, and describes the differences in mental health among students. Finally, the results are applied to French teaching in universities, and a good teaching effect is achieved. Finally, the experimental results show that the infiltration strategy proposed in this study is feasible and effective.", "venue": "Journal of Environmental and Public Health", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-09-12", "journal": {"name": "Journal of Environmental and Public Health", "volume": "2022"}, "authors": [{"authorId": "46509200", "name": "Jing Zhao"}], "citations": [{"paperId": "72bcc58f6bf551ff14a562bd95c92e7c566358ae", "title": "The Role of the Data Management Centre for Data Sustainability at Academic University for: Literature Review"}, {"paperId": "e9380b52bdebe42a2cd12639a160dc793bd94142", "title": "Assessing the role of artificial intelligence in the mental healthcare of teachers and students"}]}
