{"paperId": "c00b4d2800e313a9b75fd6aa4ed1c3e6e3e9f909", "publicationVenue": null, "title": "JointConf: Jointly autotuning configuration parameters for modularized graph databases", "abstract": "To support different application scenarios, graph databases (GDBs) usually provide a large number of performance‐related parameters for developers. Since manually configuring is both time‐consuming and cost‐intensive, automatically tuning configurations parameters to achieve a better performance has been an urgent need. Besides, considering various graph management requirements, GDBs begin to utilize the modular architecture to interoperate with a wide range of storage and index backends. Due to the complicated interactions among different modules, sequentially tuning each software with previous solutions may fall into a local optimal and it is necessary to jointly autotune the cross‐module configuration parameters. Toward this challenging target, we propose JointConf—a new black‐box approach of jointly autotuning configuration parameters for modularized GDBs. To address the formulated high‐dimensional black‐box optimization problem, JointConf utilizes the recently proposed BO_dropout algorithm. Inspired by the dropout algorithm in neural networks, BO_dropout explores efficient dimension dropout to achieve a high‐dimensional Bayesian optimization. We evaluate the effectiveness of JointConf on a local distributed JanusGraph cluster with three different graph query benchmark applications and experimental results show its advantages over the four baseline search‐based approaches. The necessity of jointly tuning for modularized GDBs is also verified in our experiments.", "venue": "J. Softw. Evol. Process.", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-07-29", "journal": {"name": "Journal of Software: Evolution and Process", "volume": "34"}, "authors": [{"authorId": "2099113460", "name": "Hui Dou"}, {"authorId": "2179779083", "name": "Jicheng Mei"}, {"authorId": "2171659151", "name": "Yiwen Zhang"}, {"authorId": "2158501975", "name": "Pengfei Chen"}, {"authorId": "144291579", "name": "Zibin Zheng"}], "citations": []}
