{"paperId": "c00dc34045774479e4c358541b6293686d1dd0b5", "publicationVenue": {"id": "12fff95b-d469-49a0-84a5-4fd4696c3f28", "name": "Knowledge-Based Systems", "type": "journal", "alternate_names": ["Knowl Based Syst", "Knowledge Based Systems", "Knowledge-based Syst"], "issn": "0950-7051", "url": "http://www.elsevier.com/wps/find/journaldescription.cws_home/525448/description#description", "alternate_urls": ["https://www.journals.elsevier.com/knowledge-based-systems", "http://www.sciencedirect.com/science/journal/09507051"]}, "title": "Special Relativity Search: A novel metaheuristic method based on special relativity physics", "abstract": null, "venue": "Knowledge-Based Systems", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-07-01", "journal": {"name": "Knowl. Based Syst.", "pages": "109484", "volume": "257"}, "authors": [{"authorId": "148291849", "name": "V. Goodarzimehr"}, {"authorId": "97927181", "name": "S. Shojaee"}, {"authorId": "1410654753", "name": "S. Hamzehei-Javaran"}, {"authorId": "8995202", "name": "S. Talatahari"}], "citations": [{"paperId": "b304478c847f9ac9eadfc183ec2170067c510446", "title": "A local-global optimization approach for maximizing the multiphysics frequency response of laminated functionally graded CNTs reinforced magneto-electro-elastic plates"}, {"paperId": "a58c1c0c6dcebd02002fe39a5883314f1ba37190", "title": "Elite‐guided equilibrium optimiser based on information enhancement: Algorithm and mobile edge computing applications"}, {"paperId": "289be167c1617364dcf1a2dad31a008be9bf1176", "title": "Multi-Strategy Boosted Fick’s Law Algorithm for Engineering Optimization Problems and Parameter Estimation"}, {"paperId": "1bffe5266c41a48fa42cb7de1fb34e094d52f143", "title": "A multi-hybrid algorithm with shrinking population adaptation for constraint engineering design problems"}, {"paperId": "e28cef9a608e98d219d90876683b78e16c4b12f9", "title": "The Differentiated Creative search (DCS): Leveraging Differentiated knowledge-acquisition and Creative realism to address complex optimization problems"}, {"paperId": "32e70b5419a9be598d78cddc74ff24de33fef862", "title": "Hybrid Vibration Control of Tall Tubular Structures via Combining Base Isolation and Mass Damper Systems Optimized by Enhanced Special Relativity Search Algorithm"}, {"paperId": "82a9e9eb970695cba0b717a6f1fcba559729abc8", "title": "Optimization of economic dispatch using updated differential evolution algorithm"}, {"paperId": "5796c645e0460d335c1100b9412c097f5839e9c4", "title": "SABO algorithm for optimum design of truss structures with multiple frequency constraints"}, {"paperId": "050add71658a22df5e3db91f0528641f279558d8", "title": "A new improved Newton metaheuristic algorithm for solving mathematical and structural optimization problems"}, {"paperId": "3e4a1c9819d6e2522ba7336b53644fe32edebdd4", "title": "ASCAEO: accelerated sine cosine algorithm hybridized with equilibrium optimizer with application in image segmentation using multilevel thresholding"}, {"paperId": "87fde08a15858e5858b587794f591771c6211ae4", "title": "Developments and Design of Differential Evolution Algorithm for Non-linear/Non-convex Engineering Optimization"}, {"paperId": "d0b1176100337293e0a040884a80d578a425a627", "title": "A Contemporary Systematic Review on Meta-heuristic Optimization Algorithms with Their MATLAB and Python Code Reference"}, {"paperId": "4526da7af07db358773eb30dbc7da5ee8aebb34a", "title": "An effective metaheuristic technology of people duality psychological tendency and feedback mechanism-based Inherited Optimization Algorithm for solving engineering applications"}, {"paperId": "482f29ffe3ce05fedcf90008c42adf2b63d4db49", "title": "Machine learning modeling and experimental investigation on friction stir processed AA2024/Al2O3 nanocomposites"}, {"paperId": "23c7e6547845d7f2fbbb07f1da91d0040f32e056", "title": "Adaptive Guided Equilibrium Optimizer with Spiral Search Mechanism to Solve Global Optimization Problems"}, {"paperId": "240e274c25e46c2937df0aeefc050c707c0b1b59", "title": "Quadruple parameter adaptation growth optimizer with integrated distribution, confrontation, and balance features for optimization"}, {"paperId": "073c00239e77544671a386d2a6ab85b7eb2e6239", "title": "DETDO: An adaptive hybrid dandelion optimizer for engineering optimization"}, {"paperId": "1f2996b1411c7656a7c105796d9e8317b5213846", "title": "A Literature Review and Critical Analysis of Metaheuristics Recently Developed"}, {"paperId": "4774391dd65b22ac54ea2dd959811dc1f7272502", "title": "A multi-strategy boosted prairie dog optimization algorithm for global optimization of heat exchangers"}, {"paperId": "6c81bf84abac9e375eb8d8e39b7a086b9507df9a", "title": "A hierarchical multi-leadership sine cosine algorithm to dissolving global optimization and data classification: The COVID-19 case study"}, {"paperId": "ee6b7f5b523ad2895d13af94571ab97a69679e98", "title": "Optimal Design of Planar Steel Frames Using the Hybrid Teaching–Learning and Charged System Search Algorithm"}, {"paperId": "b6aedd5c2ec3203479e63137fed8bf76ec465a46", "title": "An exhaustive review of the metaheuristic algorithms for search and optimization: taxonomy, applications, and open challenges"}, {"paperId": "3600a20da1b98e1e0f8308527109d4cb77516ccb", "title": "Bonobo optimizer algorithm for optimum design of truss structures with static constraints"}, {"paperId": "e60f13e7c3ee6b1e40cbd094dc820c0a3444a40d", "title": "Kepler optimization algorithm: A new metaheuristic algorithm inspired by Kepler's laws of planetary motion"}, {"paperId": "277138686f8aa529e5d654ee8588bfbaacfe9bed", "title": "Modified adolescent identity search algorithm for optimization of steel skeletal frame structures"}, {"paperId": "dc99245653980bd761667b7937ea68fdd0c556c4", "title": "Special Relativity Search for applied mechanics and engineering"}, {"paperId": "9558277b0c51a9d5f1325fdca392a24d86200ae8", "title": "Improved chaos game optimization algorithm for optimal frequency prediction of variable stiffness curvilinear composite plate"}, {"paperId": "ab46493101757fbafd5c0b48f8bf956682e362aa", "title": "A swarm optimizer with modified feasible-based mechanism for optimum structure in steel industry"}, {"paperId": "b5b635722d978d48ac3726f8e62a85df1962ff6c", "title": "Optimizing deep neuro-fuzzy classifier with a novel evolutionary arithmetic optimization algorithm"}, {"paperId": "dc3370cbc7bdb69df03ac9795d7857c20936f89b", "title": "Multi-Objective Material Generation Algorithm (MOMGA) for Optimization Purposes"}]}
