{"paperId": "c013020b8dc78b8e296ae97d7e5da3045d9348b9", "publicationVenue": {"id": "6dcf82ac-7373-43d7-9939-cdc8dcc3fd2f", "name": "IAES International Journal of Artificial Intelligence (IJ-AI)", "type": "journal", "alternate_names": ["IAES Int J Artif Intell", "IAES International Journal of Artificial Intelligence", "IAES Int J Artif Intell (IJ-AI"], "issn": "2089-4872", "url": "http://iaesjournal.com/online/index.php/IJAI"}, "title": "Efficient fault tolerant cost optimized approach for scientific workflow via optimal replication technique within cloud computing ecosystem", "abstract": "Cloud computing is one of the dispersed and effective computing models, which offers tremendous opportunity to address scientific issues with big scale characteristics. Despite having such a dynamic computing paradigm, it faces several difficulties and falls short of meeting the necessary quality of services (QoS) standards. For sustainable cloud computing workflow, QoS is very much required and need to be addressed. Recent studies looked on quantitative fault-tolerant programming to reduce the number of copies while still achieving the reliability necessity of a process on the heterogeneous infrastructure as a service (IaaS) cloud. In this study, we create an optimal replication technique (ORT) about fault tolerance as well as cost-driven mechanism and this is known as optimal replication technique with fault tolerance and cost minimization (ORT-FTC). Here ORT-FTC employs an iterative-based method that chooses the virtual machine and its copies that have the shortest makespan in the situation of specific tasks. By creating test cases, ORT-FTC is tested while taking into account scientific workflows like CyberShake, laser interferometer gravitational-wave observatory (LIGO), montage, and sipht. Additionally, ORT-FTC is shown to be only slightly improved over the current model in all cases. ", "venue": "IAES International Journal of Artificial Intelligence (IJ-AI)", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-03-01", "journal": {"name": "IAES International Journal of Artificial Intelligence (IJ-AI)"}, "authors": [{"authorId": "145397255", "name": "Asma Anjum"}, {"authorId": "2269580921", "name": "Asma Parveen"}], "citations": []}
