{"paperId": "c0209a7edb5ad7da4796df8bec41f0efa0ed4f5a", "publicationVenue": {"id": "416b088d-de72-4dbf-959e-8551984d9676", "name": "IEEE transactions on neural systems and rehabilitation engineering", "type": "journal", "alternate_names": ["IEEE Trans Neural Syst Rehabilitation Eng", "IEEE trans neural syst rehabilitation eng", "IEEE Transactions on Neural Systems and Rehabilitation Engineering"], "issn": "1534-4320", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=7333", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=7333"]}, "title": "Dimensionality Reduction and Motion Clustering During Activities of Daily Living: Three-, Four-, and Seven-Degree-of-Freedom Arm Movements", "abstract": "This paper is the first in a two-part series analyzing human arm and hand motion during a wide range of unstructured tasks. The wide variety of motions performed by the human arm during daily tasks makes it desirable to find representative subsets to reduce the dimensionality of these movements for a variety of applications, including the design and control of robotic and prosthetic devices. This paper presents a novel method and the results of an extensive human subjects study to obtain representative arm joint angle trajectories that span naturalistic motions during Activities of Daily Living (ADLs). In particular, we seek to identify sets of useful motion trajectories of the upper limb that are functions of a single variable, allowing, for instance, an entire prosthetic or robotic arm to be controlled with a single input from a user, along with a means to select between motions for different tasks. Data driven approaches are used to discover clusters and representative motion averages for the wrist 3 degree of freedom (DOF), elbow-wrist 4 DOF, and full-arm 7 DOF motions. The proposed method makes use of well-known techniques such as dynamic time warping (DTW) to obtain a divergence measure between motion segments, Ward’s distance criterion to build hierarchical trees, and functional principal component analysis (fPCA) to evaluate cluster variability. The emerging clusters associate various recorded motions into primarily hand start and end location for the full-arm system, motion direction for the wrist-only system, and an intermediate between the two qualities for the elbow-wrist system.", "venue": "IEEE transactions on neural systems and rehabilitation engineering", "year": 2020, "fieldsOfStudy": ["Medicine", "Computer Science", "Mathematics"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-02-17", "journal": {"name": "IEEE Transactions on Neural Systems and Rehabilitation Engineering", "pages": "2826-2836", "volume": "28"}, "authors": [{"authorId": "3246396", "name": "Yuri Gloumakov"}, {"authorId": "39010912", "name": "A. Spiers"}, {"authorId": "1797110", "name": "A. Dollar"}], "citations": [{"paperId": "7eec13d362df43b53c83c9b46e66c238bdd61040", "title": "Comparison of Inter-Joint Coordination Strategies During Activities of Daily Living with Prosthetic and Anatomical Limbs"}, {"paperId": "9f75473238edb05e2f11a9cf33a0bac746a2ace5", "title": "Hand Grasp Pose Prediction Based on Motion Prior Field"}, {"paperId": "54281030aa7ecb4f5a5715c0eaf48fb082829958", "title": "Trajectory Control–An Effective Strategy for Controlling Multi-DOF Upper Limb Prosthetic Devices"}, {"paperId": "f6805b08f256156adc5fbf72e0451ec67888eff4", "title": "Mathematical Model Design for a 7-DOF robot and 6-DOF comparison simulation"}, {"paperId": "d7b1e238bd6d8be7f0138da6a7f00dd735ca5861", "title": "Characterization and Categorization of Various Human Lower Limb Movements Based on Kinematic Synergies"}, {"paperId": "0a155aa612e26d691e218fd37aa191c439453efb", "title": "Anthropomorphic Reaching Movement Generating Method for Human-Like Upper Limb Robot"}, {"paperId": "2661f0f78d2a26b3ed98012d39c8821442245f66", "title": "Trajectory Control for 3 Degree-of-Freedom Wrist Prosthesis in Virtual Reality: A Pilot Study"}, {"paperId": "56de82f5c001e3447e42e1feae3e8c2fdb26e5e9", "title": "Looking for Synergies in Healthy Upper Limb Motion: A Focus on the Wrist"}]}
