{"paperId": "c02b950ae20d5611488b47d7333f91aa50db3cfc", "publicationVenue": {"id": "38acad02-d647-4d48-be25-55a418138f2a", "name": "Transportation Research Record", "type": "journal", "alternate_names": ["Transp Res Rec"], "issn": "0361-1981", "url": "http://trb.org/news/blurb_detail.asp?id=1676"}, "title": "Securely Sharing and Visualizing Connected Vehicle Analytics: THEA CV Pilot Performance Evaluation Dashboard", "abstract": "Dashboards are increasingly being used by organizations to process and visualize complex information and to reduce data complexity for planning and reporting. Their main function is to synthesize information for rapid and smarter decision making. This paper details the development of an innovative interactive dashboard to process connected vehicle (CV) data securely, report CV application evaluation analytics, and monitor CV infrastructure system performance. We detail the methods used to process complex, high-frequency (up to 10 Hz) information generated by more than 1,000 participants’ vehicles in the Tampa Hillsborough Expressway Authority (THEA) CV Pilot deployment over the course of two and half years of operation. The dashboard provides advanced query capabilities and custom visualization via interactive maps, graphics, and dynamic reporting to help inform decision making and securely share information. Further, individual CV application warnings can be analyzed using the warning profile feature that is equipped with visual animation replay. This novel approach not only compensated for the lack of in-vehicle dashboard cameras integrated into the CV Pilot infrastructure to assess behavioral responses to the human–machine interface, but also sped up manual validation time. The dashboard allows different levels of user access with customized views to meet a variety of stakeholder types and needs. This tool has been successfully used by the THEA CV Pilot evaluation team and U.S. Department of Transportation independent evaluators to perform precursory evaluations and to automate and perform false positive assessments of vehicle-to-vehicle and vehicle-to-infrastructure safety and mobility applications.", "venue": "Transportation Research Record", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2022-06-25", "journal": {"name": "Transportation Research Record", "pages": "1276 - 1289", "volume": "2677"}, "authors": [{"authorId": "1395470192", "name": "Omkar Dokur"}, {"authorId": "14158591", "name": "Sisinnio Concas"}, {"authorId": "25711311", "name": "Mohsen Kamrani"}, {"authorId": "2881683", "name": "A. Kourtellis"}, {"authorId": "101254971", "name": "V. Kummetha"}], "citations": []}
