{"paperId": "c02d6bff042b58bf0f36203dfc1e5778c47669fe", "publicationVenue": {"id": "ca7dc837-10c7-4203-b650-33e92048fb21", "name": "Journal of University of Shanghai for Science and Technology", "type": "journal", "alternate_names": ["J Univ Shanghai Sci Technol", "Journal of the University of Shanghai for Science and Technology"], "issn": "1007-6735"}, "title": "Boosted System Performance based on Execution Time Using LiMca Scheduling Algorithm", "abstract": "The scheduling algorithms have been examined by the process of task execution in a system to achieve maximum utilization of multiprocessors. Consequently, the research attempted to propose a new real-time scheduling algorithm to support a multiprocessor platform. The proposed scheduling algorithm, List Mcnaughton’s amalgamation (LiMca) scheduling algorithm has been developed for an optimum solution with the features of List and Mcnaughton’s scheduling algorithms to overcome the individual drawbacks (pre-emption and Precedence constraints). In LiMca, Workload has been distributed to the processors in a system by sorting the tasks in decreasing order with their precedence constraints including due dates, pre-emption, and context switching. In this arena, the LiMca scheduling algorithm has been developed on a traditional avionic mission system and also simulated on a real-time application. The extensive simulations were carried out on the time optimization of resources scheduling (TORSCHE) simulation toolbox. LiMca scheduling algorithm performed superior as compared to recently reported scheduling algorithms like list, hu’s, McNaughton’s, Brucker’s, and Hodgson’s in terms of computational performance.", "venue": "Journal of University of Shanghai for Science and Technology", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-06-22", "journal": {"name": "Journal of University of Shanghai for Science and Technology"}, "authors": [{"authorId": "47207301", "name": "M. Sreenath"}, {"authorId": "1739144", "name": "P. Vijaya"}], "citations": []}
