{"paperId": "c02dcc509f83156dbae0686180d47ad493d7c3f2", "publicationVenue": {"id": "f32b7322-b69c-4e63-801d-8f50784ef778", "name": "Computational Intelligence and Neuroscience", "type": "journal", "alternate_names": ["Comput Intell Neurosci"], "issn": "1687-5265", "url": "https://www.hindawi.com/journals/cin/"}, "title": "An Assessment of Lexical, Network, and Content-Based Features for Detecting Malicious URLs Using Machine Learning and Deep Learning Models", "abstract": "The World Wide Web services are essential in our daily lives and are available to communities through Uniform Resource Locator (URL). Attackers utilize such means of communication and create malicious URLs to conduct fraudulent activities and deceive others by creating deceptive and misleading websites and domains. Such threats open the doors for many critical attacks such as spams, spyware, phishing, and malware. Therefore, detecting malicious URL is crucially important to prevent the occurrence of many cybercriminal activities. In this study, we examined a set of machine learning (ML) and deep learning (DL) models to detect malicious websites using a dataset comprising 66,506 records of URLs. We engineered three different types of features including lexical-based, network-based and content-based features. To extract the most discriminative features in the dataset, we applied several features selection algorithms, namely, correlation analysis, Analysis of Variance (ANOVA), and chi-square. Finally, we conducted a comparative performance evaluation for several ML and DL models considering set of criteria commonly used to evaluate such models. Results depicted that Naïve Bayes (NB) was the best model for detecting malicious URLs using the applied data with an accuracy of 96%. This research has made contribution to the field by conducting significant features engineering and analysis to identify the best features for malicious URLs predictions, compare different models and achieve a high accuracy using a large new URL dataset.", "venue": "Computational Intelligence and Neuroscience", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-08-25", "journal": {"name": "Computational Intelligence and Neuroscience", "volume": "2022"}, "authors": [{"authorId": "1985357", "name": "M. Aljabri"}, {"authorId": "66065703", "name": "F. Alhaidari"}, {"authorId": "145612369", "name": "R. Mohammad"}, {"authorId": "2182922124", "name": "Samiha Mirza"}, {"authorId": "2135793700", "name": "Dina H Alhamed"}, {"authorId": "2135793945", "name": "Hanan S. Altamimi"}, {"authorId": "2117486676", "name": "S. Chrouf"}], "citations": [{"paperId": "2583b60ff5e6e9552b2367d1b8d37cbcc474ba11", "title": "Detection of phishing addresses and pages with a data set balancing approach by generative adversarial network (GAN) and convolutional neural network (CNN) optimized with swarm intelligence"}, {"paperId": "617ec6071b2f71c55e957e77f615aae7ac8a137b", "title": "Phishing Website Detection through Multi-Model Analysis of HTML Content"}, {"paperId": "5fa185e6a3db49efa1bc950fa9ad9bc0e438e1d3", "title": "Enhancing Malicious QR Code Link Detection with Swarm-Intelligent Squirrel-Search Optimized ANN"}, {"paperId": "2a5b49da033c08858852a0ed6d5d3dc52ffc9424", "title": "Accuracy of Machine Learning for Classifying Malicious URL"}, {"paperId": "820e9504a9b403a924679d6c54190f5d8bcdbe5c", "title": "Identification and Classification of Malicious and Benign URL using Machine Learning Classifiers"}, {"paperId": "3523c3608bae89ca41fe89dcfde7b5b74f698be3", "title": "A Decision-Fusion-Based Ensemble Approach for Malicious Websites Detection"}, {"paperId": "759bf07f84ee63144a86bffae1dfe0f33533d219", "title": "Classification of Malicious URLs Using Machine Learning"}, {"paperId": "1f671bfe9597957ebf75f6ce7879a443eb10a40a", "title": "Multi-Modal Deep Learning for Effective Malicious Webpage Detection"}, {"paperId": "de1f5428ad3a09f8fc3fd313260c622cb9e8ebdc", "title": "Click fraud detection for online advertising using machine learning"}, {"paperId": "17a4327e32b608f3f2a53fa3de33ede03a512d7c", "title": "A data mining approach to malicious websites detection"}, {"paperId": "8a4ab9b98c99ee33bd45f26ae6b4a82dd6b1aa2f", "title": "Phishing URLs Detection Using Sequential and Parallel ML Techniques: Comparative Analysis"}, {"paperId": "5df0a406485b92d00fb92dd4adbba3340e191f70", "title": "Machine Learning-Based Detection for Unauthorized Access to IoT Devices"}, {"paperId": "d14ad2de7251d4c4f5da72166fea38544b8ad40a", "title": "Machine learning-based social media bot detection: a comprehensive literature review"}, {"paperId": "2482d5773a252f69a6359ded2513c663cf0c1236", "title": "AI-Based Techniques for Ad Click Fraud Detection and Prevention: Review and Research Directions"}, {"paperId": "674c41288b3fccdcefd34646a1739136fb116fd0", "title": "Fake News Detection Using Machine Learning Models"}, {"paperId": "5f0fc07bbb67839dcfb105a4ddfdf68c4b1e597f", "title": "A Heterogeneous Machine Learning Ensemble Framework for Malicious Webpage Detection"}, {"paperId": "49a793debecb6ac89bf3ca27db27d17128e813ee", "title": "Automatic Classification of Scanned Electronic University Documents using Deep Neural Networks with Conv2D Layers"}, {"paperId": "ccf2ae666cf9084fce307debeba0d37afe42a5e0", "title": "Detecting Malicious URLs Using Machine Learning Techniques: Review and Research Directions"}]}
