{"paperId": "c0327fa5e16e9ce172ae13946dc9c1650e526c2a", "publicationVenue": null, "title": "An Architecture for Situation-Aware Smart Logistics", "abstract": "Disruptions and exceptions are an important source of risks in logistics, as far as the planning of transportation services is concerned. Failing to rapidly react on and handle such events may lead to serious depreciation of the transported cargo and reputation damage. The Internet of Things seems to be the technology capable of providing the tools required to detect exceptions nearly real-time. However, currently, there is little research on how to enhance the detected exceptions with related information from internal or external sources. Furthermore, most exception detection capabilities rely on experience and not much research exist on how to improve the accuracy of using third-party knowledge. In this paper, we propose a reference architecture for situation-aware logistics. The architecture specification follows the key principles derived from an extensive requirements analysis, the state of the art literature, and the ideas promoted by the Industrial Data Space initiative. The proposed architecture has been instantiated and tested by means of a prototype designed for the case of temperature-controlled transportation services.", "venue": "2019 IEEE 23rd International Enterprise Distributed Object Computing Workshop (EDOCW)", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-10-01", "journal": {"name": "2019 IEEE 23rd International Enterprise Distributed Object Computing Workshop (EDOCW)", "pages": "108-117"}, "authors": [{"authorId": "144357127", "name": "M. Iacob"}, {"authorId": "1396798106", "name": "Gilang Charismadiptya"}, {"authorId": "1679024", "name": "M. V. Sinderen"}, {"authorId": "1423706417", "name": "J. Piest"}], "citations": [{"paperId": "18b35bce60c0ad8c48f2bcbbece9040eefe92638", "title": "THE ROLE OF INTERNATIONAL TRANSPORT LOGISTICS IN OPTIMIZING TRANSPORT INFRASTRUCTURE ARCHITECTURES"}, {"paperId": "472589ddcea8829f388c420505dadb5a71f05299", "title": "Empowering freight transportation through Logistics 4.0: a maturity model for value creation"}, {"paperId": "a8d0b28c4534738ec923153abd00d9545da7d483", "title": "An Enterprise Architecture based on Cloud, Fog and Edge Computing for an Airfield Lighting Management System"}, {"paperId": "72193996996ec29d329f511ee3d42a1b1cc93468", "title": "Demonstrating the Architecture for Situation-aware Logistics using Smart Returnable Assets"}, {"paperId": "96747e36cba0d00f9b8b61fb7d49a7fa433b5aa7", "title": "Business rule extraction using decision tree machine learning techniques: A case study into smart returnable transport items"}, {"paperId": "008860e729e48556f148bb39df9e2525d2e788ab", "title": "A Reference Architecture for IoT-Enabled Dynamic Planning in Smart Logistics"}, {"paperId": "e4b352414b825f300979e56a60a86f4dbe4df46e", "title": "Current Trends in Web Engineering: ICWE 2020 International Workshops, KDWEB, Sem4Tra, and WoT4H, Helsinki, Finland, June 9–12, 2020, Revised Selected Papers"}]}
