{"paperId": "c0416d60b0ca06616fc66ed553d697766e086f95", "publicationVenue": {"id": "505bd3de-b1ce-4c78-bbc5-b6f47dc42c4f", "name": "International Conference on Software Quality, Reliability and Security", "type": "conference", "alternate_names": ["QRS", "Int Conf Softw Qual Reliab Secur"]}, "title": "Anomaly Detectors for Self-Aware Edge and IoT Devices", "abstract": "With the growing processing power of computing systems and the increasing availability of massive datasets, machine learning algorithms have led to major breakthroughs in many different areas. This applies also to resource-constrained IoT and edge devices, which will often benefit from relatively small – but smart – local anomaly detection tasks that aim at protecting the device, or the information they convey from sensors towards a central node. This provides the device with fault detection capabilities that are typically required when engineering dependable devices, services or systems. This paper overviews a pitfall-free process to provide small devices with anomaly detection capabilities, to make them self-aware of their health condition, and possibly take appropriate countermeasures. Our methodology applies to a wide range of Linux-based devices: we show an application to a specific ARANCINO device, which has already been successfully used in many smart cities and sensing applications. We craft anomaly detectors that are very effective in detecting most of the anomalies. Additionally, we comment on the beneficial impact of time-series analysis, which could help improve detection performance even further, allowing to equip any small device with responsive and accurate anomaly detection machinery.", "venue": "International Conference on Software Quality, Reliability and Security", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference", "Review"], "publicationDate": "2023-10-22", "journal": {"name": "2023 IEEE 23rd International Conference on Software Quality, Reliability, and Security (QRS)", "pages": "24-35"}, "authors": [{"authorId": "1978195", "name": "T. Zoppi"}, {"authorId": "40056738", "name": "Giovanni Merlino"}, {"authorId": "1810292", "name": "A. Ceccarelli"}, {"authorId": "1721699", "name": "A. Puliafito"}, {"authorId": "1700780", "name": "A. Bondavalli"}], "citations": [{"paperId": "9fd1a0941f0ef80df90455e0dce2a5950a35d584", "title": "Detection Latencies of Anomaly Detectors: An Overlooked Perspective ?"}]}
