{"paperId": "c04f8eb01c3ef78d41b37f7c1964aa28989b5d6d", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "How Do Consumer Innovation Characteristics and Consumption Value Shape Users’ Willingness to Buy Innovative Car Safety Seats?", "abstract": "The intelligent innovation of child safety seats has brought new impacts and challenges to the Chinese market. Researchers in the car seat industry have been focusing on industry regulations and the abuse of car seats, but there is a lack of consumer-centered research. This study is the first to combine two theories of consumer subject-specific innovation (DSI) and the theory of consumption value (TCV). This study explores how consumer innovations influence consumers’ purchase of innovative child safety seats through perceived value. The proposed research model was evaluated using a partial least squares structural equation model, and data analysis revealed that the model had good model fit, reliability, and validity. Consumer product innovation has a significantly better impact on willingness to buy than consumer information innovation. In this study, in the relationship between consumers of information innovation and purchase intention in the automobile seat industry, a new kind of parallel multi-mediating relationship between the social value, hedonic value, and novelty value of perceived products was proposed. The study’s results address the need for more consumer research in the intelligent seating industry, as well as how to give researchers and marketing firms solutions and suggestions based on facts.", "venue": "Sustainability", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-12-22", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "2112640195", "name": "Li Jiang"}, {"authorId": "2194015002", "name": "Mei Zhao"}, {"authorId": "2193279249", "name": "Hao Lin"}, {"authorId": "2111857507", "name": "Lv Yang"}], "citations": []}
