{"paperId": "c05fc620a531c41e0cb3e6e9b49cad689a8e1407", "publicationVenue": {"id": "501d412d-8d7a-4980-ae5b-6639fe31aee2", "name": "First Monday", "type": "journal", "issn": "1396-0458", "url": "http://www.firstmonday.dk/ojs/index.php/fm/about/index", "alternate_urls": ["http://www.firstmonday.org/", "http://www.uic.edu/htbin/cgiwrap/bin/ojs/index.php/fm/"]}, "title": "Even pseudonyms and throwaways delete their Reddit posts", "abstract": "Concerned researchers of user-generated content might want to avoid using, citing, or quoting sensitive content likely to be deleted by their authors, even when pseudonymous or using one-time “throwaway” accounts. At Reddit, how many authors actually delete their submissions, why, and are they concerned if their deletion end up elsewhere? I analyze the three most popular sensitive-topic subreddits (r/Advice, r/AmItheAsshole, and r/relationship_advice) and show that deleting submissions is common. Roughly half of submissions are deleted by their users, most within the first day and week. Interviews with 30 Redditors reveal that their motives for deletion include ensuring the “Internet doesn’t see them,” especially those who might “see it on my Reddit profile,” deciding their issue was resolved, receiving unhelpful or aggressive comments, and concluding their submission was no longer relevant. Most interviewees were not overly concerned about deleted submissions persisting elsewhere (e.g., social media, archives, and datasets) as long as it is not easily connected to their other activity or identity.", "venue": "First Monday", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-15", "journal": {"name": "First Monday"}, "authors": [{"authorId": "2066538", "name": "Joseph M. Reagle"}], "citations": [{"paperId": "3887552e9b48c2d0091d9332a0e6457e2912576c", "title": "Passive data collection on Reddit: a practical approach"}, {"paperId": "e7de0df6ae1f8eb95d34f4bb6e6a39044bdec882", "title": "We have always been social: Comparing social expressiveness between single-player and multiplayer gamers"}]}
