{"paperId": "c0610c75d58f9e7d19355f2b7cbabaf1483c5db9", "publicationVenue": null, "title": "Jespipe: A Plugin-Based, Open MPI Framework for Adversarial Machine Learning Analysis", "abstract": "Research is increasingly showing the tremendous vulnerability in machine learning models to seemingly undetectable adversarial inputs. One of the current limitations in adversarial machine learning research is the incredibly time-consuming testing of novel defenses against various attacks and across multiple datasets, even with high computing power. To address this limitation, we have developed Jespipe as a new plugin-based, parallel-by-design Open MPI framework that aids in evaluating the robustness of machine learning models. The plugin-based nature of this framework enables researchers to specify any pre-training data manipulations, machine learning models, adversarial models, and analysis or visualization metrics with their input Python files. Because this framework is plugin-based, a researcher can easily incorporate model implementations using popular deep learning libraries such as PyTorch, Keras, TensorFlow, Theano, or MXNet, or adversarial robustness tools such as IBM’s Adversarial Robustness Toolbox or Foolbox. The parallelized nature of this framework also enables researchers to evaluate various learning or attack models with multiple datasets simultaneously by specifying all the models and datasets they would like to test with our XML control file template. Overall, Jespipe shows promising results by reducing latency in adversarial machine learning algorithm development and testing compared to traditional Jupyter notebook workflows.", "venue": "2021 IEEE International Conference on Big Data (Big Data)", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-12-15", "journal": {"name": "2021 IEEE International Conference on Big Data (Big Data)", "pages": "3663-3670"}, "authors": [{"authorId": "37358017", "name": "Sheila Alemany"}, {"authorId": "2149932046", "name": "Jason Nucciarone"}, {"authorId": "1709987", "name": "N. Pissinou"}], "citations": [{"paperId": "678c909e0b3b9d6809fe6fe603d00a596befcad9", "title": "ABCD Analysis of Industries Using High-Performance Computing"}, {"paperId": "7721e76a291c770b318650d61702e72ccbbba6be", "title": "PAARes: an efficient process allocation based on the available resources of cluster nodes"}, {"paperId": "26d6356e0865a2296575fdf4e175aadb0a438f26", "title": "Safety Assurance of Artificial Intelligence-Based Systems: A Systematic Literature Review on the State of the Art and Guidelines for Future Work"}]}
