{"paperId": "c07241ef44731308bc5b00c61e85701695ba885d", "publicationVenue": {"id": "cd492924-29c4-496b-9535-082805f228d8", "name": "International Conference on Performance Engineering", "type": "conference", "alternate_names": ["Int Conf Perform Eng", "ICPE"], "url": "http://www.wikicfp.com/cfp/program?id=1445"}, "title": "Graph Neural Networks for Anomaly Anticipation in HPC Systems", "abstract": "In this paper, we explore the use of Graph Neural Networks (GNNs) for anomaly anticipation in high performance computing (HPC) systems. We propose a GNN-based approach that leverages the structure of the HPC system (particularly, the physical proximity of the compute nodes) to facilitate anomaly anticipation. We frame the task of forecasting the availability of the compute nodes as a supervised prediction problem; the GNN predicts the probability that a compute node will fail within a fixed-length future window. We empirically demonstrate the viability of the GNN-based approach by conducting experiments on the production Tier-0 super-computer hosted at CINECA datacenter facilities, the largest Italian provider of HPC. The results are extremely promising, showing both anomaly detection capabilities on par with other techniques from the literature (with a special focus on those tested on real, production data) and, more significantly, strong results in terms of anomaly prediction.", "venue": "International Conference on Performance Engineering", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2023-04-15", "journal": {"name": "Companion of the 2023 ACM/SPEC International Conference on Performance Engineering"}, "authors": [{"authorId": "2122107986", "name": "Martin Molan"}, {"authorId": "2213316337", "name": "Junaid Ahmed Khan"}, {"authorId": "2078352090", "name": "Andrea Borghesi"}, {"authorId": "2241007", "name": "Andrea Bartolini"}], "citations": [{"paperId": "22b6d5a959ef5ca75faa429cc12e8b9e4d5bd123", "title": "Artificial intelligence and internet of things in manufacturing decision processes"}, {"paperId": "d7e395f5fb145062232c8dc80e00d4036f7652c6", "title": "The Graph-Massivizer Approach Toward a European Sustainable Data Center Digital Twin"}]}
