{"paperId": "c07802ed8a25998e9bd44ee1ddbcc63b7eb34060", "publicationVenue": {"id": "c6840156-ee10-4d78-8832-7f8909811576", "name": "IEEE Transactions on Knowledge and Data Engineering", "type": "journal", "alternate_names": ["IEEE Trans Knowl Data Eng"], "issn": "1041-4347", "url": "https://www.computer.org/web/tkde", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=69"]}, "title": "Data Management for Machine Learning: A Survey", "abstract": "Machine learning (ML) has widespread applications and has revolutionized many industries, but suffers from several challenges. First, sufficient high-quality training data is inevitable for producing a well-performed model, but the data is always human expensive to acquire. Second, a large amount of training data and complicated model structures lead to the inefficiency of training and inference. Third, given an ML task, one always needs to train lots of models, which are hard to manage in real applications. Fortunately, database techniques can benefit ML by addressing the above three challenges. In this paper, we review existing studies from the following three aspects along with the pipeline highly related to ML. (1) Data preparation (Pre-ML): it focuses on preparing high-quality training data that can improve the performance of the ML model, where we review data discovery, data cleaning and data labeling. (2) Model training & inference (In-ML): researchers in ML community focus on improving the model performance during training, while in this survey we mainly study how to accelerate the entire training process, also including feature selection and model selection. (3) Model management (Post-ML): in this part, we survey how to store, query, deploy and debug the models after training. Finally, we provide research challenges and future directions.", "venue": "IEEE Transactions on Knowledge and Data Engineering", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-05-01", "journal": {"name": "IEEE Transactions on Knowledge and Data Engineering", "pages": "4646-4667", "volume": "35"}, "authors": [{"authorId": "1720852203", "name": "Chengliang Chai"}, {"authorId": "2155125051", "name": "Jiayi Wang"}, {"authorId": "3462170", "name": "Yuyu Luo"}, {"authorId": "2153120965", "name": "Zeping Niu"}, {"authorId": "2242412700", "name": "Guoliang Li"}], "citations": [{"paperId": "12be685687426658e9021f7068a12859c2751bb7", "title": "Challenges and strategies for wide-scale artificial intelligence (AI) deployment in healthcare practices: A perspective for healthcare organizations."}, {"paperId": "1f5c71bce46a9e02378db1be13da3854b9e37c35", "title": "Data Cleaning and Machine Learning: A Systematic Literature Review"}, {"paperId": "ba01f0878e5dcaa8c43af25e20f88571e1aa22ae", "title": "Predicting user behavior using data profiling and hidden Markov model"}, {"paperId": "3f88b30c63cb50478fa45c25629f60314f69b89c", "title": "Enabling Efficient Random Access to Hierarchically Compressed Text Data on Diverse GPU Platforms"}, {"paperId": "484d1dbf15d231c0fe5bdb1fd70a59138ad931cc", "title": "Split Without a Leak: Reducing Privacy Leakage in Split Learning"}, {"paperId": "86ab1b3c7af0bf58196685a76833c1eb6d9359c8", "title": "GoodCore: Data-effective and Data-efficient Machine Learning through Coreset Selection over Incomplete Data"}, {"paperId": "b2da80ff14600017f597d32c0bf7609568fe30fd", "title": "Demystifying Artificial Intelligence for Data Preparation"}, {"paperId": "f0166047e2c0f718b132dfa4ae4d9073146c0848", "title": "Learned Data-aware Image Representations of Line Charts for Similarity Search"}, {"paperId": "792c6310cb620a4c489bdc37199cc2921344486f", "title": "Database Meets Artificial Intelligence: A Survey (Extended Abstract)"}, {"paperId": "5c03e7f2146a80d9917c9761e8337b810a467e99", "title": "Optimizing Random Access to Hierarchically-Compressed Data on GPU"}, {"paperId": "dc09ce51a7c4a805bf9f7031190648b20261098d", "title": "An Exercise Collection Auto-Assembling Framework with Knowledge Tracing and Reinforcement Learning"}, {"paperId": "597b7a7b27928c940e1895b4b489d0993683a30d", "title": "Coresets over Multiple Tables for Feature-rich and Data-efficient Machine Learning"}, {"paperId": "d5aa0efc065ac3073404aebbcc3a2ca3eb63db4b", "title": "Cost-based or Learning-based? A Hybrid Query Optimizer for Query Plan Selection"}, {"paperId": "d53ef63ada540f20ebbf28aa47072e36c8faf024", "title": "LearnedSQLGen: Constraint-aware SQL Generation using Reinforcement Learning"}, {"paperId": "324617847cc591e3fb11f15cdcdfbc9374021b51", "title": "RW-Tree: A Learned Workload-aware Framework for R-tree Construction"}, {"paperId": "b0d376434a528ee69d98174d75b4a571c53247ae", "title": "Feature Augmentation with Reinforcement Learning"}, {"paperId": "1da2a0e8dac5db009cfadb96aa544ced9b1e4580", "title": "Selective Data Acquisition in the Wild for Model Charging"}, {"paperId": "f20fb78b15ca20934ce5138a1498204c7a6c35d2", "title": "Terrorism Attack Classification Using Machine Learning: The Effectiveness of Using Textual Features Extracted from GTD Dataset"}, {"paperId": "101e858c7e4c242fbeaf0bdd2b423e179f6a3214", "title": "Practices for Managing Machine Learning Products: A Multivocal Literature Review"}]}
