{"paperId": "c0806cc82ecc3bbc0ff6eeb2bbdf9f73594ca67d", "publicationVenue": null, "title": "PGX.D/Async: A Scalable Distributed Graph Pattern Matching Engine", "abstract": "Graph querying and pattern matching is becoming an important feature of graph processing as it allows data analysts to easily collect and understand information about their graphs in a way similar to SQL for databases. One of the key challenges in graph pattern matching is to process increasingly large graphs that often do not fit in the memory of a single machine. In this paper, we present PGX.D/Async, a scalable distributed pattern matching engine for property graphs that is able to handle very large datasets. PGX.D/Async implements pattern matching operations with asynchronous depth-first traversal, allowing for a high degree of parallelism and precise control over memory consumption. In PGX.D/Async, developers can query graphs with PGQL, an SQL-like query language for property graphs. Essentially, PGX.D/Async provides an intuitive, distributed, in-memory pattern matching engine for very large graphs.", "venue": "GRADES@SIGMOD/PODS", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2017-05-19", "journal": {"name": "Proceedings of the Fifth International Workshop on Graph Data-management Experiences & Systems"}, "authors": [{"authorId": "153882027", "name": "Nicholas P. Roth"}, {"authorId": "1989618", "name": "Vasileios Trigonakis"}, {"authorId": "2207212", "name": "Sungpack Hong"}, {"authorId": "1694512", "name": "Hassan Chafi"}, {"authorId": "145116453", "name": "Anthony Potter"}, {"authorId": "1703160", "name": "B. Motik"}, {"authorId": "145655431", "name": "Ian Horrocks"}], "citations": [{"paperId": "043391c40319dcf29e5e16e83365ec976a6b8618", "title": "Attempts in Worst-Case Optimal Joins on Relational Data Systems: A Literature Survey"}, {"paperId": "a5dd6ee3142b526d206da2a6bc677f73c5079ca7", "title": "A Scalable Data Structure for Efficient Graph Analytics and In-Place Mutations"}, {"paperId": "975da4591b428eda807e6dd24350c7f5af16a80c", "title": "Better Distributed Graph Query Planning With Scouting Queries"}, {"paperId": "dc71694f9c25744c856c90fe66b40bab09910cc3", "title": "Anti-vertex for neighborhood constraints in subgraph queries"}, {"paperId": "5ddfc39247c916a1b64132e94b69a37909be4be0", "title": "A Deeper Dive into Pattern-Aware Subgraph Exploration with PEREGRINE"}, {"paperId": "090402652b83d26f16ef38950cf26f5e72e2b9a7", "title": "Labeled Triangle Indexing for Efficiency Gains in Distributed Interactive Subgraph Search††This work was performed under the auspices of the U.S. Department of Energy by Lawrence Livermore National Laboratory under Contract DE-AC52-07NA27344 (LLNL-CONF-814976). Experiments were performed at the Live"}, {"paperId": "feb98da0ffab2bb84ea7a4d5e0309c522532c24d", "title": "Approximate Pattern Matching in Massive Graphs with Precision and Recall Guarantees"}, {"paperId": "82aa5dafab4bfa77548546feff834eeadef0bdeb", "title": "Peregrine: a pattern-aware graph mining system"}, {"paperId": "3c1b1401d0b37dedf447abcbb271f0663276e925", "title": "Scalable Pattern Matching in Metadata Graphs via Constraint Checking"}, {"paperId": "09ffe80ca2cb07b9ed236116a91fa8a9bc8fb330", "title": "A Review of Engines for Graph Storage and Mutations"}, {"paperId": "689c7a86d973895a14feb984b8faa3d5581038ef", "title": "Demystifying Graph Databases: Analysis and Taxonomy of Data Organization, System Designs, and Graph Queries"}, {"paperId": "fa6119eb8eb8f6a4e664eccf409d5c085952f942", "title": "PruneJuice: Pruning Trillion-edge Graphs to a Precise Pattern-Matching Solution"}, {"paperId": "e4a24d6fa86de0b79392e09cf07ce9d7f738d7c2", "title": "There are Trillions of Little Forks in the Road. Choose Wisely! - Estimating the Cost and Likelihood of Success of Constrained Walks to Optimize a Graph Pruning Pipeline"}, {"paperId": "ce2a41d31657c32a4945d79d5902b1576fed3ad8", "title": "G-CORE: A Core for Future Graph Query Languages"}, {"paperId": "64feee191aef7681eff2efadec5fe72bf7351dc9", "title": "aDFS: An Almost Depth-First-Search Distributed Graph-Querying System"}, {"paperId": "59cb7c86cd5291cb7ae1ef58994ff7ea1d0e1988", "title": "CSR++: A Fast, Scalable, Update-Friendly Graph Data Structure"}, {"paperId": "3c9139211ca9b12a8b69fd7a3ff8d233a785c1d8", "title": "Graph Data Management Systems"}]}
