{"paperId": "c0b5e7b0f336bd848719b39ac8f9478ac70a138d", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Users’ Reaction Time for Improvement of Security and Access Control in Web Services", "abstract": "This paper concerns the case of the development of a technology for increasing the efficiency of access control based on the user behavior monitoring built into a software system’s user interface. It is proposed to use the time of user reactions as individual indicators of psychological and psychophysical state. This paper presents the results and interpretation of user reactions collected during a mass web survey of students of the Russian Federation. The total number of users was equal to 22,357. To reveal the patterns in user reactions, both quantitative and qualitative approaches were applied. The analysis of the data demonstrated that the user could be characterized by their psychomotor reactions, collected during the answering of a set of questions. Those reactions reflected the personal skills of the interface interaction, the speed of reading, and the speed of answering. Thus, those observations can be used as a supplement to personal verification in information systems. The collection of the reaction times did not load the data volumes significantly nor transmit confidential information.", "venue": "Applied Sciences", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2021-03-12", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "67038065", "name": "S. Magomedov"}, {"authorId": "2055686895", "name": "Alexander Gusev"}, {"authorId": "11660134", "name": "D. Ilin"}, {"authorId": "2228832", "name": "E. Nikulchev"}], "citations": [{"paperId": "e71131d944e2e62f5bdb41d502721f9a5d8ca390", "title": "Research and implementation of non-linear management and monitoring system for classified information network"}, {"paperId": "aea7ac29e76b410662b4b34dc95775b9a97585c7", "title": "Evaluation of User Reactions and Verification of the Authenticity of the User’s Identity during a Long Web Survey"}, {"paperId": "423995c21dcc733561675035452d4202e6f13e5a", "title": "Isolated Sandbox Environment Architecture for Running Cognitive Psychological Experiments in Web Platforms"}]}
