{"paperId": "c0bc6d0fcbdbe909b6e503cae1e8e6909762ccb4", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Worst-Case Optimal Radix Triejoin", "abstract": "Relatively recently, the field of join processing has been swayed by the discovery of a new class of multi-way join algorithms. The new algorithms join multiple relations simultaneously rather than perform a series of pairwise joins. The new join algorithms satisfy stronger worst-case runtime complexity guarantees than any of the existing approaches based on pairwise joins -- they are worst-case optimal in data complexity. These research efforts have resulted in a flurry of papers documenting theoretical and some practical contributions. However, there is still the quest of making the new worst-case optimal join algorithms truly practical in terms of (1) ease of implementation and (2) secondary index efficiency in terms of number of indexes created to answer a query. \nIn this paper, we present a simple worst-case optimal multi-way join algorithm called the radix triejoin. Radix triejoin uses a binary encoding for reducing the domain of a database. Our main technical contribution is that domain reduction allows a bit-interleaving of attribute values that gives rise to a query-independent relation representation, permitting the computation of multiple queries over the same relations worst-case optimally without having to construct additional secondary indexes. We also generalise the core algorithm to conjunctive queries with inequality constraints and provide a new proof technique for the worst-case optimal join result.", "venue": "arXiv.org", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-12-29", "journal": {"name": "ArXiv", "volume": "abs/1912.12747"}, "authors": [{"authorId": "144406831", "name": "A. Fekete"}, {"authorId": "1471886248", "name": "B. Franks"}, {"authorId": "32809463", "name": "Herbert Jordan"}, {"authorId": "144650318", "name": "Bernhard Scholz"}], "citations": [{"paperId": "043391c40319dcf29e5e16e83365ec976a6b8618", "title": "Attempts in Worst-Case Optimal Joins on Relational Data Systems: A Literature Survey"}, {"paperId": "50bca53ff65a92e0776ed7f04ff692f87afaed85", "title": "Graphical Join: A New Physical Join Algorithm for RDBMSs"}, {"paperId": "cbcf31491afbc03826603dff3827e7ec3de41949", "title": "Adopting worst-case optimal joins in relational database systems"}, {"paperId": "c08caffe9fe53fba3dc8bbc78eaecd381ac775c7", "title": "Combining Worst-Case Optimal and Traditional Binary Join Processing"}]}
