{"paperId": "c0c5cfb2d40a87808157bd3c83853894b500b057", "publicationVenue": {"id": "74f47cf8-2839-4a56-959a-524dd0ed9e3e", "name": "International Conference on Extending Database Technology", "type": "conference", "alternate_names": ["Int Conf Extending Database Technol", "Extending Database Technology", "Extending Database Technol", "EDBT"], "url": "http://www.edbt.org/"}, "title": "Wrapper Methods for Multi-Objective Feature Selection", "abstract": "The ongoing data boom has democratized the use of data for improved decision-making. Beyond gathering voluminous data, preprocessing the data is crucial to ensure that their most relevant aspects are considered during the analysis. Feature Selection (FS) is one integral step in data preprocessing for reducing data dimensionality and preserving the most relevant features of the data. FS can be done by inspecting inherent associations among the features in the data (filter methods) or using the model performance of a concrete learning algorithm (wrapper methods). In this work, we extensively evaluate a set of FS methods on 32 datasets and measure their effect on model performance, stability, scalability and memory usage. The results re-establish the superiority of wrapper methods over filter methods in model performance. We further investigate the unique role of wrapper methods in multi-objective FS with a focus on two traditional metrics - accuracy and Area Under the ROC Curve (AUC). On model performance, our experiments showed that optimizing for both metrics simultaneously, rather than using a single metric, led to improvements in the accuracy and AUC trade-off 1 up to 5% and 10%, respectively.", "venue": "International Conference on Extending Database Technology", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": null, "journal": {"pages": "697-709"}, "authors": [{"authorId": "2163574094", "name": "Uchechukwu F. Njoku"}, {"authorId": "3453814", "name": "Besim Bilalli"}, {"authorId": "1474551319", "name": "Alberto Abelló"}, {"authorId": "72855461", "name": "G. Bontempi"}], "citations": [{"paperId": "059229a5c09cd410c1069747406dee1ee4053293", "title": "Multi-objective Feature Selection in Remote Health Monitoring Applications"}, {"paperId": "0c5819324d1c10c91e95a85a3768f7990991d577", "title": "Enhancing QSAR Modeling: A Fusion of Sequential Feature Selection and Support Vector Machine"}, {"paperId": "191a00fc8a95b41d335158119957e2fa876f3b39", "title": "A data-science pipeline to enable the Interpretability of Many-Objective Feature Selection"}, {"paperId": "5cbbe911564117fc4ac7c53866c189fe60166cad", "title": "SAGA: A Scalable Framework for Optimizing Data Cleaning Pipelines for Machine Learning Applications"}, {"paperId": "a2f0afa2fd08a37d3a9882ca6d80e36d928dfc9a", "title": "Finding Optimal Diverse Feature Sets with Alternative Feature Selection"}, {"paperId": "6de8c76c7ab32b91fc86f7dc5c56e0579e15031d", "title": "Finding Relevant Information in Big Datasets with ML"}]}
