{"paperId": "c0c673a10796c8a30cdbb8158a56fb1902f63ac4", "publicationVenue": {"id": "7c9d091e-015e-4e5d-a11f-9bc369fcf414", "name": "IEEE Transactions on Parallel and Distributed Systems", "type": "journal", "alternate_names": ["IEEE Trans Parallel Distrib Syst"], "issn": "1045-9219", "url": "http://www.computer.org/tpds", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=71"]}, "title": "Large-Scale Analysis of Docker Images and Performance Implications for Container Storage Systems", "abstract": "Docker containers have become a prominent solution for supporting modern enterprise applications due to the highly desirable features of isolation, low overhead, and efficient packaging of the application’s execution environment. Containers are created from images which are shared between users via a registry. The amount of data registries store is massive. For example, Docker Hub, a popular public registry, stores at least half a million public images. In this article, we analyze over 167 TB of uncompressed Docker Hub images, characterize them using multiple metrics and evaluate the potential of file-level deduplication. Our analysis helps to make conscious decisions when designing storage for containers in general and Docker registries in particular. For example, only 3 percent of the files in images are unique while others are redundant file copies, which means file-level deduplication has a great potential to save storage space. Furthermore, we carry out a comprehensive analysis of both small I/O request performance and copy-on-write performance for multiple popular container storage drivers. Our findings can motivate and help improve the design of data reduction and caching methods for images, pulling optimizations for registries, and storage drivers.", "venue": "IEEE Transactions on Parallel and Distributed Systems", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-04-01", "journal": {"name": "IEEE Transactions on Parallel and Distributed Systems", "pages": "918-930", "volume": "32"}, "authors": [{"authorId": "152451752", "name": "Nannan Zhao"}, {"authorId": "145876520", "name": "Vasily Tarasov"}, {"authorId": "30953508", "name": "Hadeel Albahar"}, {"authorId": "144776491", "name": "Ali Anwar"}, {"authorId": "33677967", "name": "Lukas Rupprecht"}, {"authorId": "51387546", "name": "Dimitrios Skourtis"}, {"authorId": "8542739", "name": "A. Paul"}, {"authorId": "2031496626", "name": "Keren Chen"}, {"authorId": "3287952", "name": "A. Butt"}], "citations": [{"paperId": "c346a267f51b18c11530563ed02bfa9620ba7be2", "title": "Empirical Study of the Docker Smells Impact on the Image Size"}, {"paperId": "51219e88f609ee82939e194e9fdd0478526de4b3", "title": "Virtualization Using Docker Container for Reproducible Desktop Environment"}, {"paperId": "498c50f66efadd29b4867b77f4dda5e34ffa2fde", "title": "Flow based containerized honeypot approach for network traffic analysis: An empirical study"}, {"paperId": "00af8aa0754b8dbe81cf7a8ae9530e1cc25ce539", "title": "A Docker Image Content Parsing Method"}, {"paperId": "596dbe2823d64f851a9069342c7738a957f2e919", "title": "Container-based low-delay microservice data offloading and processing for distribution substation area gateway"}, {"paperId": "0343b5206006722e2f3b3e15bafd93d780e9af9a", "title": "Deploying a Build Job Orchestration in Docker"}, {"paperId": "83586ea296cfe1555fb765d98b405df9e1c92778", "title": "Quicklayer: A Layer-Stack-Oriented Accelerating Middleware for Fast Deployment in Edge Clouds"}, {"paperId": "fd56b6b5a9f75ace33a69d37007b3086bb1c4192", "title": "An optimal container update method for edge-cloud collaboration"}, {"paperId": "012fbd3a947ff9786c8fdd3bbd9b156b032c35ea", "title": "Layer-Aware Containerized Service Orchestration in Edge Networks"}, {"paperId": "8e8b0e34f83b999722c3a5d1f7c12578a8db4169", "title": "What Quality Aspects Influence the Adoption of Docker Images?"}, {"paperId": "fe31eeda5943f609deec25cc1d3379f63adb4fb3", "title": "A Dynamic Management and Integration Framework for Models in Landslide Early Warning System"}, {"paperId": "6ba83036b89b099ec6e775940a8da76f7a6225d8", "title": "CFS: Scaling Metadata Service for Distributed File System via Pruned Scope of Critical Sections"}, {"paperId": "8c01f81e7746c64a4f7bcd232a15f9c06f2db131", "title": "Landlord: Coordinating Dynamic Software Environments to Reduce Container Sprawl"}, {"paperId": "6c3476f47a129c1aa39465ae1ab547b3118b1e2c", "title": "An Optimal Image Storage Strategy for Container-Based Edge Computing in Smart Factory"}, {"paperId": "8f7998afc7797b6bb99cc2d65b0522c305e7925b", "title": "Efficient Container Assignment and Layer Sequencing in Edge Computing"}, {"paperId": "c0a4ae9f8e0719c45c8b85172643d71e521a74ee", "title": "Parfum: Detection and Automatic Repair of Dockerfile Smells"}, {"paperId": "225a39c022cdcff52740f3f920f914d9bf8fcd72", "title": "Budget-Constrained Service Allocation Optimization for Mobile Edge Computing"}, {"paperId": "a887f075e067dfb06e5ff7f1a45298892144f62d", "title": "Machine Learning Systems are Bloated and Vulnerable"}, {"paperId": "b3f7a5bcd995c7b58dc25313c7e79bb0d6f209b1", "title": "Creating Microservices and using infrastructure as code within the CI/CD for dynamic container creation"}, {"paperId": "4a5127405d01397c66b647c88a07684a65b825d8", "title": "KFIML: Kubernetes-Based Fog Computing IoT Platform for Online Machine Learning"}, {"paperId": "efa62f1614551c2d0d85f6c46d443a07487251c8", "title": "Quantifying Resource Contention of Co-located Workloads with the System-level Entropy"}, {"paperId": "3c92074bb6f5df89ad06aef7ef2c586171c2ce35", "title": "A secure edge power system based on a Docker container"}, {"paperId": "c4ba0bef8a16e50a549cb36f94e4c1c50bf37a02", "title": "Heuristic approaches for an efficient cloud service management: Study and Analyze"}, {"paperId": "88ad5690748d3fc791e10765c3f804a7ac5fb32b", "title": "An efficient enhanced prefix hash tree model for optimizing the storage and image deduplication in cloud"}, {"paperId": "6c8c4503e3f50848d35deaf080ae4086dd4f60c1", "title": "Containerized Execution of UDFs: An Experimental Evaluation"}, {"paperId": "13dbf1b7105c4b0077d45ec36e1ca818dfb7d50c", "title": "Commutativity-guaranteed Docker Image Reconstruction towards Effective Layer Sharing"}, {"paperId": "f4e20e8fc3bc23ec9f2331c67b38133347d6ae21", "title": "Studying the Performance Risks of Upgrading Docker Hub Images: A Case Study of WordPress"}, {"paperId": "37f7650b80f4ec4c6d12f6dc5e8f46fd1f25cfb9", "title": "Performance and isolation analysis of RunC, gVisor and Kata Containers runtimes"}, {"paperId": "a5d070487ebb77279fe5d55c72469f6ce1bd2aaf", "title": "MINIMIZING IMAGES OF DOCKER CONTAINER ROOT FILE SYSTEMS"}, {"paperId": "7b5a81870394aa45399fe81e327f24e5e50ae5af", "title": "Performance Analysis in HyperFlex and vSAN Hyper Convergence Platforms for Online Course Consideration"}]}
