{"paperId": "c0d0cef340e7af49b5e3ec86e92b8a9f01b1fa2f", "publicationVenue": {"id": "6a1abd85-3eca-4491-ac76-0134749a10fc", "name": "International Workshop on Data Warehousing and OLAP", "type": "conference", "alternate_names": ["Data Warehousing and OLAP", "Int Workshop Data Warehous L", "DOLAP", "Data Warehous L"], "url": "http://www.wikicfp.com/cfp/program?id=748"}, "title": "Adaptive Handling of Out-of-order Streams in Conformance Checking", "abstract": "Organizations function through the execution of various business processes. Non-conformant behavior in these processes impacts organizations negatively through implications such as reduced efficiency, lower quality, and compliance risks. Thus, it is important to identify non-conformant process behavior rapidly. While this is a challenging problem on its own, it is further complicated by the advent of big data, distributed systems, and a fragmented landscape of cloud-and on-premise tools that all provide data for the analysis of a business process and for determining its conformance. In such a landscape, it is common that events may arrive out of order. This complicates the conformance-checking analysis, which commonly expects events within a process to arrive in a specific sequence allowed by the process model. This paper introduces the first streaming conformance-checking method that incorporates event time awareness, thus having the ability to correct imperfections stemming from the out-of-order arrival of events. The method is scalable, utilizing the Beamline framework built on top of Apache Flink. Furthermore, the method includes an adaptive approach for handling various levels of out-of-order events in event streams. Experiments were conducted to demonstrate the applicability of the method for real-world use cases with different levels of out-of-order events. The results indicate that the method is well suited for identifying conformance in business processes that rely on a multitude of underlying systems for aggregating a holistic view of the process.", "venue": "International Workshop on Data Warehousing and OLAP", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"pages": "9-17"}, "authors": [{"authorId": "147246577", "name": "Kristo Raun"}, {"authorId": "2293728669", "name": "Riccardo Tommasini"}, {"authorId": "2293728960", "name": "Ahmed Awad"}], "citations": []}
