{"paperId": "c0d9737c2d3d3e5fc50a885ec2998ca4febbdb77", "publicationVenue": {"id": "38a8edf0-2998-4daf-93f7-16f34689e228", "name": "IEEE Systems Journal", "type": "journal", "alternate_names": ["IEEE Syst J"], "issn": "1932-8184", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=4267003", "alternate_urls": ["http://www.systemsjournal.org/"]}, "title": "A Science Gateway Cloud With Cost-Adaptive VM Management for Computational Science and Applications", "abstract": "For the processing of scientific applications in cloud computing, the important challenge is to find an optimized resource scheduling method that guarantees cloud service users’ service-level agreement while minimizing the resource management cost. To overcome this problem, in contrast to previous solutions that focus on a few specific applications, we design and implement a unified scientific cloud framework called science gateway cloud, which is a broker between users and providers and is able to process various scientific applications efficiently upon heterogeneous cloud resources. In particular, we design a cost-adaptive resource management scheme that reduces the resource management cost significantly without any degradation of performance based on the long-term payment plans of cloud resource providers. Furthermore, this system allows us to parallelize divisible scientific applications to improve the processing performance. Through the division policy for workflow scheduling, we show that both deadline assurance and cost minimization can be satisfied concurrently. Finally, we demonstrate that our proposed system significantly outperforms conventional cloud systems through various experimental and simulation results.", "venue": "IEEE Systems Journal", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2017-03-01", "journal": {"name": "IEEE Systems Journal", "pages": "173-185", "volume": "11"}, "authors": [{"authorId": "2109603706", "name": "Seonghwan Kim"}, {"authorId": "144089240", "name": "Dong-Ki Kang"}, {"authorId": "40756137", "name": "Woojoong Kim"}, {"authorId": "143874539", "name": "Min Chen"}, {"authorId": "1715960", "name": "Chan-Hyun Youn"}], "citations": [{"paperId": "dc858a3a1614285beb0e85db5d8d80e82fab60a2", "title": "Study-based Systematic Mapping Analysis of Cloud Technologies for Leveraging IT Resource and Service Management: The Case Study of the Science Gateway Approach"}, {"paperId": "8a93d4db03f11664a256290d45233ca1da0f9b02", "title": "Three Dynamic Pricing Schemes for Resource Allocation of Edge Computing for IoT Environment"}, {"paperId": "1b6272dfd8578bc601803b6fc46625625a2204e2", "title": "Optimization of Metascheduler for Cloud Machine Learning Services"}, {"paperId": "1b1e2ffaf3991c06f39f7063cd8766c1b2a0dd84", "title": "Adapting Market-Oriented Policies for Scheduling Divisible Loads on Clouds"}, {"paperId": "01b8d700fa19823ae31d8dcb7bcb70e66f12ece0", "title": "Cloud Brokering with Bundles: Multi-objective Optimization of Services Selection"}, {"paperId": "d380089e8b8890cd04bea7fb18dc3c6befb23457", "title": "Adaptive task scheduling method in multi-tenant cloud computing"}, {"paperId": "38228ac933f09ad4ea978aac7f60fabb542bdcbf", "title": "A Review of Cost and Makespan-Aware Workflow Scheduling in Clouds"}, {"paperId": "97643f3149b13625fb425facf8891633e9a8eca8", "title": "Estimation of fog utility pricing: a bio-inspired optimisation techniques' perspective"}, {"paperId": "d95562c13293f88be0f14c6ce8c917b94522d2bb", "title": "An Optimal Pricing Scheme for the Energy-Efficient Mobile Edge Computation Offloading With OFDMA"}, {"paperId": "2148937833a948db9a3639018fdf9e54b6cd9cc7", "title": "COST-AWARE REAL-TIME DIVISIBLE LOADS SCHEDULING IN CLOUD COMPUTING"}, {"paperId": "da3dca45e0a7a861e3782e2c074ba1d8944ceee5", "title": "A resource allocation model based on double-sided combinational auctions for transparent computing"}, {"paperId": "fda46307abcf60ee1f93748737ac81fb590e9dd8", "title": "Optimal workflow scheduling for scientific workflows in cloud computing"}, {"paperId": "058b0550d2de3d2840573a35d37783c13562ce0f", "title": "Adaptive VM Management with Two Phase Power Consumption Cost Models in Cloud Datacenter"}, {"paperId": "f0a98b6e29130844031050ad0774fc715204c20b", "title": "Evaluation and Analysis of Bio-Inspired Optimization Techniques for Bill Estimation in Fog Computing"}, {"paperId": "bb0955b98f8ab3199900036b293616d861935c69", "title": "Integrated Cloud Broker System and Its Experimental Evaluation"}]}
