{"paperId": "c0e36938d261d781d54d9de5a3b8108f617edd5a", "publicationVenue": {"id": "7a4a2cd2-0615-44b1-83c3-d07ad89415b4", "name": "Journal of Crohn's & Colitis", "type": "journal", "alternate_names": ["Journal of Crohn's and Colitis", "J Crohn's  Colitis", "Journal of Crohns & Colitis", "J Crohn's Colitis", "J Crohn  Colitis"], "issn": "1873-9946", "alternate_issns": ["1197-4982"], "url": "http://www.ecco-jccjournal.org/aims", "alternate_urls": ["http://www.ecco-jccjournal.org/"]}, "title": "Ustekinumab in Crohn’s Disease: New Data for Positioning in Treatment Algorithm", "abstract": "Abstract The treatment of patients with moderate to severe Crohn’s disease [CD] is still challenging. Therapeutic options include steroids, immunosuppressants, anti-TNFα agents, vedolizumab, and ustekinumab. Ustekinumab is a monoclonal antibody blocking the p40 subunit of IL-12 and IL-23. It showed to be effective and safe in randomised clinical trials and real-life studies and is currently approved for the management of CD patients who are naive to biologics and those who have already been treated with such medications. However, to date, a detailed and approved therapeutic algorithm is not available. The aim of this review is to report the most recent and updated data on the efficacy and safety of ustekinumab for the treatment of patients with moderate to severe CD and to define the optimal management of these patients.", "venue": "Journal of Crohn's & Colitis", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-04-01", "journal": {"name": "Journal of Crohn's & Colitis", "pages": "ii30 - ii41", "volume": "16"}, "authors": [{"authorId": "1422394286", "name": "F. D’Amico"}, {"authorId": "1387474555", "name": "L. Peyrin-Biroulet"}, {"authorId": "2379943", "name": "S. Danese"}], "citations": [{"paperId": "0f660e8a483324e8975be39edf76325d41b13200", "title": "Comparison of the Persistence of Anti-TNF Agents and Ustekinumab in Patients with Crohn’s Disease: A Study Based on the Korean National Database"}, {"paperId": "91f27358886b297e08b072a8f6e3a9cf1bf19737", "title": "Pharmacological Management of Inflammatory Bowel Disease: a Century of Expert Opinions in Cecil Textbook of Medicine"}, {"paperId": "3515ee75b0b8489dd9ce46a89cd6c42be0f08f28", "title": "Opciones terapéuticas disponibles ante la falla al tratamiento anti-TNF en pacientes con Enfermedad Inflamatoria Intestinal"}]}
