{"paperId": "c0e6a1cfb6a08f2d28d290e705488a33728b4ddc", "publicationVenue": {"id": "0dc0e794-53db-401d-bd8f-8da9165b2865", "name": "International Conferences on Contemporary Computing and Informatics", "type": "conference", "alternate_names": ["IC3I", "Int Conf Contemp Comput Informatics"]}, "title": "Enhancing IoT Security Through AI-Based Anomaly Detection and Intrusion Prevention", "abstract": "Enhancing the Internet of Things (IoT) security is among the most pressing concerns confronting the information technology sector. With significant numbers of loT systems being created and established, it is difficult for these systems to interact securely without affecting performance. The difficulties arise since the majority of loT systems are resource restricted and so possess restricted processing capability. In, this study, we intend to study the enhancement of IoT security of anomaly detection and intrusion prevention. To enhance anomaly detection and intrusion prevention performance, a binary categorization of typical and unusual IoT traffic is created. In this paper, we carefully evaluate the specificity and complication of IoT security protection, and then discover that Artificial Intelligence (AI) approaches like Machine Learning (ML) and ensemble classifiers may offer new strong abilities to satisfy IoT security demands. This enhancement can be associated with ensemble learning methods that make use of a variety of learning processes with variable capacities. We were capable of improving the predictability of our predictions while decreasing the likelihood of classification errors through the combination of these methods. The outcomes of the experiments suggest that the architecture could enhance the effectiveness of the anomaly detection and intrusion prevention System, with an accuracy level of 0.9863.", "venue": "International Conferences on Contemporary Computing and Informatics", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-09-14", "journal": {"name": "2023 6th International Conference on Contemporary Computing and Informatics (IC3I)", "pages": "1786-1790", "volume": "6"}, "authors": [{"authorId": "2134278165", "name": "Dr. Narayana Swamy Ramaiah"}, {"authorId": "2281391582", "name": "Dr. M. S.Gowtham"}, {"authorId": "2281393277", "name": "Dr. S. Kevin Andrews"}, {"authorId": "2281339378", "name": "Bandi Bhaskar"}, {"authorId": "2281389878", "name": "Mr. A. Shenbagharaman"}, {"authorId": "2074227904", "name": "M. Tiwari"}], "citations": []}
