{"paperId": "c0ec3daa6dde2885ffadb2953a98e98facef974e", "publicationVenue": null, "title": "Development of a Visualization for Developers of a Distributed System Including Idle Computers", "abstract": "This paper proposes a visualization function for developers in volunteer computing. In recent years, information systems such as e-Learning systems and groupware have been introduced in companies and educational institutions to promote DX, but the introduction and operation of these systems incur a large cost burden. Therefore, we are developing a distributed information system that can be introduced and operated at low cost by utilizing surplus computers (idle computers) in an organization. Idle computers are unstable depending on the operations of their original users and have different performances. In order to use idle computers efficiently, it is necessary to improve the performance of the system and modify it to add new functions, taking into account the differences in behavior and performance of each machine. In this paper, visualization for developers to easily check the behavior and performance of a computer in an idle state is developed, and its usefulness is evaluated through experiments using a real system.", "venue": "2023 IEEE International Conference on High Performance Computing & Communications, Data Science & Systems, Smart City & Dependability in Sensor, Cloud & Big Data Systems & Application (HPCC/DSS/SmartCity/DependSys)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-12-17", "journal": {"name": "2023 IEEE International Conference on High Performance Computing & Communications, Data Science & Systems, Smart City & Dependability in Sensor, Cloud & Big Data Systems & Application (HPCC/DSS/SmartCity/DependSys)", "pages": "912-919"}, "authors": [{"authorId": "2293464489", "name": "Shosuke Tsutsumi"}, {"authorId": "2293461865", "name": "Masayuki Higashinc"}, {"authorId": "2293569155", "name": "Kenichi Takahashi"}, {"authorId": "2285601598", "name": "Takao Kawamura"}], "citations": []}
