{"paperId": "c0eecf3df36d9b01e69661345b800cf629f2762d", "publicationVenue": {"id": "0aed7a40-85f3-4c66-9e1b-c1556c57001b", "name": "PLoS ONE", "type": "journal", "alternate_names": ["Plo ONE", "PLOS ONE", "PLO ONE"], "issn": "1932-6203", "url": "https://journals.plos.org/plosone/", "alternate_urls": ["http://www.plosone.org/"]}, "title": "Role of convolutional features and machine learning for predicting student academic performance from MOODLE data", "abstract": "Predicting student performance automatically is of utmost importance, due to the substantial volume of data within educational databases. Educational data mining (EDM) devises techniques to uncover insights from data originating in educational settings. Artificial intelligence (AI) can mine educational data to predict student performance and provide measures to help students avoid failing and learn better. Learning platforms complement traditional learning settings by analyzing student performance, which can help reduce the chance of student failure. Existing methods for student performance prediction in educational data mining faced challenges such as limited accuracy, imbalanced data, and difficulties in feature engineering. These issues hindered effective adaptability and generalization across diverse educational contexts. This study proposes a machine learning-based system with deep convoluted features for the prediction of students’ academic performance. The proposed framework is employed to predict student academic performance using balanced as well as, imbalanced datasets using the synthetic minority oversampling technique (SMOTE). In addition, the performance is also evaluated using the original and deep convoluted features. Experimental results indicate that the use of deep convoluted features provides improved prediction accuracy compared to original features. Results obtained using the extra tree classifier with convoluted features show the highest classification accuracy of 99.9%. In comparison with the state-of-the-art approaches, the proposed approach achieved higher performance. This research introduces a powerful AI-driven system for student performance prediction, offering substantial advancements in accuracy compared to existing approaches.", "venue": "PLoS ONE", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-11-08", "journal": {"name": "PLOS ONE", "volume": "18"}, "authors": [{"authorId": "116936708", "name": "Nihal Abuzinadah"}, {"authorId": "2253975837", "name": "Muhammad Umer"}, {"authorId": "2004048636", "name": "Abid Ishaq"}, {"authorId": "2141741142", "name": "Abdullah Al Hejaili"}, {"authorId": "17702586", "name": "Shtwai Alsubai"}, {"authorId": "3279238", "name": "A. Eshmawi"}, {"authorId": "2265992383", "name": "Abdullah Mohamed"}, {"authorId": "2007377902", "name": "I. Ashraf"}], "citations": []}
