{"paperId": "c0f8b0d01ba0f14812f8829077e1ec4a287ef6d9", "publicationVenue": {"id": "228761ec-c40a-479b-8309-9dcbe9851bcd", "name": "IEEE Internet of Things Journal", "type": "journal", "alternate_names": ["IEEE Internet Thing J"], "issn": "2327-4662", "url": "https://www.ieee.org/membership-catalog/productdetail/showProductDetailPage.html?product=PER288-ELE", "alternate_urls": ["https://ieeexplore.ieee.org/servlet/opac?punumber=6488907", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6488907", "http://ieee-iotj.org/#"]}, "title": "Blockchains for Artificial Intelligence of Things: A Comprehensive Survey", "abstract": "With the rapid advances in information and communication technologies, the Internet of Things (IoT) has become large and complex, bearing tremendous amounts of data and running devices in various scenarios. Leveraging artificial intelligence (AI) technologies, IoT can achieve superior information extraction, data analytics, and decision making, which has resulted in the revolutionized AI of Things (AIoT). AIoT can alleviate the pressure of storage, computation, and communication. Despite the promising features brought by combining AI technologies into IoT infrastructure, AIoT systems still face some serious challenges including inadequate efficiency, violation of security and privacy, lack of trust, and insufficient incentive. Blockchain featured by its distributed consensus and incentive mechanisms can be a promising technology for addressing the challenges in AIoT. AIoT employing blockchain is evolving with expectations of achieving efficient, secure, and trusted network activities. In this article, we first introduce the background of AIoT and blockchain. Then, we discuss the motivations for employing blockchain with its characteristics in AIoT. Furthermore, we comprehensively review existing solutions on blockchain for AIoT systems from the aspects of efficiency, security, privacy, trust, and incentive. Finally, we discuss the challenges and future research directions on blockchain for AIoT.", "venue": "IEEE Internet of Things Journal", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-08-15", "journal": {"name": "IEEE Internet of Things Journal", "pages": "14483-14506", "volume": "10"}, "authors": [{"authorId": "152318011", "name": "Meng Shen"}, {"authorId": "2215039767", "name": "Aijing Gu"}, {"authorId": "145993626", "name": "Jiawen Kang"}, {"authorId": "46231077", "name": "Xiangyun Tang"}, {"authorId": "2117689938", "name": "Xiaodong Lin"}, {"authorId": "1692039", "name": "Liehuang Zhu"}, {"authorId": "1713586", "name": "D. Niyato"}], "citations": [{"paperId": "4f7b45474f5adc7bd7d08927205f1eaaae939fc6", "title": "A Literature Review on Data Monetization using Smart Contracts"}, {"paperId": "3c5873281f5d3d869b4b9d7fc15588ce8b7e779d", "title": "Securing the Internet of Things in Artificial Intelligence Era: A Comprehensive Survey"}]}
