{"paperId": "c0ffa02f1ea0df1578a363fcf9893809dde320bc", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Protected Network Architecture for Ensuring Consistency of Medical Data through Validation of User Behavior and DICOM Archive Integrity", "abstract": "The problem of consistency of medical data in Hospital Data Management Systems is considered in the context of correctness of medical images stored in a PACS (Picture Archiving and Communication System) and legality of actions authorized users perform when accessing MIS (Medical Information System) facilities via web interfaces. The purpose of the study is to develop a SIEM-like (Security Information and Event Management) architecture for offline analysis of DICOM (Digital Imaging and Communications in Medicine) archive integrity and users’ activity. To achieve amenable accuracy when validating DICOM archive integrity, two aspects are taken into account: correctness of periodicity of the incoming data stream and correctness of the image data (time series) itself for the considered modality. Validation of users’ activity assumes application of model-driven approaches using state-of-the-art machine learning methods. This paper proposes a network architecture with guard clusters to protect sensitive components like the DICOM archive and application server of the MIS. New server roles were designed to perform traffic interception, data analysis and alert management without reconfiguration of production software components. The cluster architecture allows the analysis of incoming big data streams with high availability, providing horizontal scalability and fault tolerance. To minimize possible harm from spurious DICOM files the approach should be considered as an addition to other securing techniques like watermarking, encrypting and testing data conformance with a standard.", "venue": "Applied Sciences", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-02-26", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "67038065", "name": "S. Magomedov"}, {"authorId": "144173133", "name": "A. Lebedev"}], "citations": [{"paperId": "c22ee6a185ddf7945002893b5fc82aac02e78443", "title": "Analysis of the Path of Utilizing Big Data to Innovate Archive Management Mode to Enhance Service Capability"}, {"paperId": "083aef61b3bb0b654e7602a7d9f6442185e8d9a9", "title": "Resource Analysis of the Log Files Storage Based on Simulation Models in a Virtual Environment"}, {"paperId": "c0b5e7b0f336bd848719b39ac8f9478ac70a138d", "title": "Users’ Reaction Time for Improvement of Security and Access Control in Web Services"}]}
