{"paperId": "c107c470323c016759a6c076f694d75aa82b327f", "publicationVenue": {"id": "ff159887-5591-495e-8a29-710e87e64127", "name": "International Journal of Production Research", "type": "journal", "alternate_names": ["Int J Prod Res"], "issn": "0020-7543", "url": "http://www.tandfonline.com/loi/tprs20"}, "title": "Predictive maintenance for industry 5.0: behavioural inquiries from a work system perspective", "abstract": "ABSTRACT Predictive Maintenance (PdM) solutions assist decision-makers by predicting equipment health and scheduling maintenance actions, but their implementation in industry remains problematic. Specifically, prior research repeatedly indicates that decision-makers often refuse to adopt the data-driven, system-generated advice in their working procedures. In this paper, we address these acceptance issues by studying how PdM implementation changes the nature of decision-makers’ work and how these changes affect their acceptance of PdM systems. We build on the human-centric Smith-Carayon Work System model to synthesise literature from research areas where system acceptance has been explored in more detail. Consequently, we expand the maintenance literature by investigating the human-, task-, and organisational characteristics of PdM implementation. Following the literature review, we distil ten propositions regarding decision-making behaviour in PdM settings. Next, we verify each proposition’s relevance through in-depth interviews with experts from both academia and industry. Based on the propositions and interviews, we identify four factors that facilitate PdM adoption: trust between decision-maker and model (maker), control in the decision-making process, availability of sufficient cognitive resources, and proper organisational allocation of decision-making. Our results contribute to a fundamental understanding of acceptance behaviour in a PdM context and provide recommendations to increase the effectiveness of PdM implementations.", "venue": "International Journal of Production Research", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-12-15", "journal": {"name": "International Journal of Production Research", "pages": "7846 - 7865", "volume": "61"}, "authors": [{"authorId": "2256518165", "name": "Bas van Oudenhoven"}, {"authorId": "2256516752", "name": "P. V. D. Calseyde"}, {"authorId": "27659288", "name": "R. Basten"}, {"authorId": "4847518", "name": "E. Demerouti"}], "citations": [{"paperId": "25f7d749a072312ba005ebf3aac3d2d72fc18cd6", "title": "Predictive maintenance in Industry 4.0: A systematic multi-sector mapping"}, {"paperId": "c63cc3169466f551e25958fdc54db72c36e2dd4d", "title": "Predictive maintenance framework for assessing health state of centrifugal pumps"}, {"paperId": "528b9042d6d4aa8a9218cb855971c2d7593e9ba9", "title": "Real-time decision support for human-machine interaction in digital railway control rooms"}, {"paperId": "0ca8c4eea503f08ef66c6c10da7de15f9d57059b", "title": "Industrial Process Management Model to Improve Productivity and Reduce Waste"}, {"paperId": "2e5e38000d38e53f1024af79a0ad48c013eaba3e", "title": "Industry 5.0 use cases development framework"}, {"paperId": "abb35f7aa9a536d67341e2768e30e3711c8339fe", "title": "Human work in the shift to Industry 4.0: a road map to the management of technological changes in manufacturing"}, {"paperId": "b81a1f2dcb6b9f95345c57d60299b995d72ab0fe", "title": "COVID-19 and Supply Chain Disruption Management: A Behavioural Economics Perspective and Future Research Direction"}, {"paperId": "0f8ef20e3bc5b3afdeb43187a046b1e23427ad5e", "title": "Machine Learning-Based Predictive Maintenance using Data Aggregation via Regularized Clustering"}, {"paperId": "49408127c8777683b45cad9f2b9ad7751f518fb3", "title": "Human-centric production and logistics system design and management: transitioning from Industry 4.0 to Industry 5.0"}, {"paperId": "dcc296f724f6c4dd864be3cde166e7de0bf0a48d", "title": "RUL Prediction with Encoding and Spatial-Temporal Deep Neural Networks"}, {"paperId": "28710606f4208b9b64ebd01bfb7a900419a75dbf", "title": "CeRULEo: Comprehensive utilitiEs for Remaining Useful Life Estimation methOds"}, {"paperId": "6c3f8056baca6612c1c9fdcc3e561ae7f0f871d2", "title": "Taking Algorithmic (Vs. Human) Advice Reveals Different Goals to Others"}, {"paperId": "cf3a49dfbc210d02cfc7e00cc628fbdd6b9a5194", "title": "Changes and improvements in Industry 5.0: A strategic approach to overcome the challenges of Industry 4.0"}, {"paperId": "16017720b4ed999da3bd448e7b0b3da077eb87d5", "title": "Human–Machine Relationship—Perspective and Future Roadmap for Industry 5.0 Solutions"}, {"paperId": "2240187979c3c4dfb7d044f0b555ce525453c7da", "title": "Responsible AI (RAI) in Manufacturing: A Qualitative Framework"}, {"paperId": "47e200764a3ee13f0fd542dbf62ed3e49f589eff", "title": "Toward human-centered intelligent assistance system in manufacturing: challenges and potentials for operator 5.0"}, {"paperId": "0058039dbe72cc021a02fdc1139646a70f1b83a3", "title": "Exploring the synergies between collaborative robotics, digital twins, augmentation, and industry 5.0 for smart manufacturing: A state-of-the-art review"}]}
