{"paperId": "c11f7930a25a6b70c0c48b17f26cacc621921d9f", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Joint Replica Server Placement, Content Caching, and Request Load Assignment in Content Delivery Networks", "abstract": "With the explosive growth of information and communication technology and its services, some popular Websites currently generate an enormous amount of Internet traffic. A content delivery network (CDN) would then become imperative for supporting such services efficiently. In this paper, we propose joint optimizing approaches for replica server placement, content caching in selected servers, and content request load assignment among the servers, aiming to minimize the ratio of unserved content request load when the network resources and server capacity are both limited. For this, we develop a mixed integer linear programming (MILP) optimization model. To mitigate the computational complexity of the MILP model, we further decompose the optimization problem into three sub-problems, including: 1) choosing the replica server nodes optimally; 2) deciding the content items to be cached in the replica servers; and 3) allocating the content request loads from users onto different servers. For these sub-problems, we develop corresponding heuristic algorithms and show that the proposed approach is not only efficient but also performs very close to the MILP model. We also find that a number of system limitations, such as different numbers of replica servers placed, link capacity, server processing capacity, and server storage capacity, jointly affect the performance of the CDN. Saturation trends are observed on the performance, which indicate that as long as sufficient resources have already been provided, augmenting the resources further may only lead to marginal additional performance improvement.", "venue": "IEEE Access", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "17968-17981", "volume": "6"}, "authors": [{"authorId": "2113474309", "name": "Kai Xu"}, {"authorId": "2144442014", "name": "Xiang Li"}, {"authorId": "144334261", "name": "S. Bose"}, {"authorId": "144757016", "name": "G. Shen"}], "citations": [{"paperId": "5d76a776fb2b64b666719a9e679ed41e4fdb1979", "title": "A novel cost-based replica server placement for optimal service quality in cloud-based content delivery network"}, {"paperId": "38c98158d4f0ce0a55a14b1b942990c1a30506c0", "title": "A Cooperative Edge Caching Approach Based on Multi-Agent Deep Reinforcement Learning"}, {"paperId": "deb6f985b52b7bc092f68a8e1f4303bdd96f3bac", "title": "Effective Techniques for Protecting the Privacy of Web Users"}, {"paperId": "f3ac708928def00906995d3d90c3dfe1e6c1c844", "title": "Optimal server and service deployment for multi-tier edge cloud computing"}, {"paperId": "d65da403cd9709ea7f88705f59f65a4ae716ef98", "title": "Game Theory and Reinforcement Learning Based Secure Edge Caching in Mobile Social Networks"}, {"paperId": "b5fc956d7b7d865c8b8858fabc68680f20304cb3", "title": "Blockchain-Based Trustworthy Edge Caching Scheme for Mobile Cyber-Physical System"}, {"paperId": "3091e0d31f767b2caf5786e344e5d2df225def1c", "title": "Deep Multi‐Agent Reinforcement Learning for Cooperative Edge Caching"}, {"paperId": "2aec80d594ef56849cde8013f044bb6406fb5096", "title": "Recent Developments in Content Delivery Network: A Survey"}, {"paperId": "fcbf1b743ed0592d18064d9bf8b376dc01b27e6a", "title": "Game Theoretical Secure Caching Scheme in Multihoming Edge Computing-Enabled Heterogeneous Networks"}, {"paperId": "ad116efcc830b1982d39f89561db4cb6c19fcc33", "title": "Resource Allocation Based on Utility Function in CDN Replica Server"}, {"paperId": "41a042bbe33d272006993faf74c21f458949a8b2", "title": "Deep Multi-Agent Reinforcement Learning Based Cooperative Edge Caching in Wireless Networks"}, {"paperId": "13227a35044c8997d4304a5df12636bd4b746fc9", "title": "Purging-Aware Content Placement in Fog-Based Content Delivery Networks"}, {"paperId": "bdb14be0c7afd373fe35878b452d6fe4b6aea9cc", "title": "Algorithms to Calculate the Most Reliable Maximum Flow in Content Delivery Network"}, {"paperId": "24d98aee15270219ab062dd87794057d18ebafbd", "title": "Q-Learning Based Content Placement Method for Dynamic Cloud Content Delivery Networks"}, {"paperId": "57be12f8886f901f9df395fe2b27fe848421c9b4", "title": "A Dynamic Virtual Datacenter Selection Strategy for Integrated Cloud Service Platform Construction With Multiclouds"}, {"paperId": "13306d70049124a028da64d0cc04f8b5f500b3f2", "title": "LOADING SPEED OPTIMIZATION OF A WEBSITE"}, {"paperId": "cfe70b3a2fedf7de64e2eec3bccdd84bb6613a14", "title": "Edge Caching for Small Cell Networks"}, {"paperId": "7ad26413d5a8ea7164dc5fbc933093a5d517efd4", "title": "Joint Optimization of Cache Placement and Bandwidth Allocation in Heterogeneous Networks"}, {"paperId": "186627b497b1f5a95510a74918715f2d160a9038", "title": "Replica Server Placement QoS Aware Consistency Aware Energy Aware Others Optimized QoS Bounded QoS Periodic Update Aperiodic Update"}]}
