{"paperId": "c133816f3ead6e4b0f17cfb946bddd05a3f389e5", "publicationVenue": {"id": "e07422f9-c065-40c3-a37b-75e98dce79fe", "name": "The Web Conference", "type": "conference", "alternate_names": ["Web Conf", "WWW"], "url": "http://www.iw3c2.org/"}, "title": "Vertical Federated Knowledge Transfer via Representation Distillation for Healthcare Collaboration Networks", "abstract": "Collaboration between healthcare institutions can significantly lessen the imbalance in medical resources across various geographic areas. However, directly sharing diagnostic information between institutions is typically not permitted due to the protection of patients’ highly sensitive privacy. As a novel privacy-preserving machine learning paradigm, federated learning (FL) makes it possible to maximize the data utility among multiple medical institutions. These feature-enrichment FL techniques are referred to as vertical FL (VFL). Traditional VFL can only benefit multi-parties’ shared samples, which strongly restricts its application scope. In order to improve the information-sharing capability and innovation of various healthcare-related institutions, and then to establish a next-generation open medical collaboration network, we propose a unified framework for vertical federated knowledge transfer mechanism (VFedTrans) based on a novel cross-hospital representation distillation component. Specifically, our framework includes three steps. First, shared samples’ federated representations are extracted by collaboratively modeling multi-parties’ joint features with current efficient vertical federated representation learning methods. Second, for each hospital, we learn a local-representation-distilled module, which can transfer the knowledge from shared samples’ federated representations to enrich local samples’ representations. Finally, each hospital can leverage local samples’ representations enriched by the distillation module to boost arbitrary downstream machine learning tasks. The experiments on real-life medical datasets verify the knowledge transfer effectiveness of our framework.", "venue": "The Web Conference", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2023-02-11", "journal": {"name": "Proceedings of the ACM Web Conference 2023"}, "authors": [{"authorId": "2205736430", "name": "Chung-ju Huang"}, {"authorId": "2143500842", "name": "Leye Wang"}, {"authorId": "2118233331", "name": "Xiao Han"}], "citations": [{"paperId": "f13f014f51dd425661e3202067c5ef5052fe4d6a", "title": "Vertical Federated Learning"}, {"paperId": "5b8188d8167fe01408828df4aa969c48454cfe63", "title": "A Hybrid Self-Supervised Learning Framework for Vertical Federated Learning"}, {"paperId": "1664403b172d2d046996eccdb534abe0a545ab62", "title": "VFedMH: Vertical Federated Learning for Training Multi-party Heterogeneous Models"}]}
