{"paperId": "c138082a1bca966a7e4cdc9191c0fb16d6480596", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "A Three-Tier Architecture of Large-Scale Wireless Sensor Networks for Big Data Collection", "abstract": "In recent years, technological advances and the ever-increasing power of embedded systems have seen the emergence of so-called smart cities. In these cities, application needs are increasingly calling for Large-Scale Wireless Sensor Networks (LS-WSN). However, the design and implementation of such networks pose several important and interesting challenges. These low-cost, low-power devices are characterized by limited computing, memory storage, communication, and battery power capabilities. Moreover, sensors are often required to cooperate in order to route the collected data to a single central node (or sink). The many-to-one communication model that governs dense and widely deployed Wireless Sensor Networks (WSNs) most often leads to problems of network overload and congestion. Indeed, it is easy to show that the closer a node is geographical to the sink, the more data sources it has to relay. This leads to several problems including overloading of nodes close to the sink, high loss rate in the area close to the sink, and poor distribution of power consumption that directly affects the lives of these networks. In this context, we propose a contribution to the problem of LS-WSN energy consumption. We designed a hierarchical 3-tier architecture of LS-WSNs coupled with a modeling of the activities of the different sensors in the network. This architecture that is based on clustering also includes a redeployment function to maintain the topology in case of coverage gaps. The results of the performed simulations show that our architecture maximizes the lifetime than compared solutions.", "venue": "Applied Sciences", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2020-08-04", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "1403585035", "name": "A. A. Abba Ari"}, {"authorId": "66897362", "name": "Asside Christian Djedouboum"}, {"authorId": "2010133", "name": "A. Guéroui"}, {"authorId": "2198180", "name": "Ousmane Thiaré"}, {"authorId": "2321157", "name": "A. Mohamadou"}, {"authorId": "1746007", "name": "Z. Aliouat"}], "citations": [{"paperId": "c6d834ea9e64fdf199af333d15282ca3a207ffdf", "title": "End-to-End Service Availability in Heterogeneous Multi-Tier Cloud-Fog-Edge Networks"}, {"paperId": "7fb399e94bbccc9893df06113855cce39d79cde7", "title": "Optimizing Relay Sensors in Large-Scale Wireless Sensor Networks: A Biologically Inspired Approach"}, {"paperId": "7bc11d8d625ac80025b8dae429681006041cfaaf", "title": "Comprehensive Survey on the Reliability of Wireless Sensor Networks"}, {"paperId": "0887e2c043192b350ad60fb0519ba3fc346f7708", "title": "An Interference-Managed Hybrid Clustering Algorithm to Improve System Throughput"}, {"paperId": "9f40eae4d3afad72821e93fb3913daf1fc2be048", "title": "Improving resource-constrained IoT device lifetimes by mitigating redundant transmissions across heterogeneous wireless multimedia of things"}, {"paperId": "71dd4f51031d38e014361254d681bad1639608bc", "title": "Analysis and Adequacy Methodology for Voltage Violations in Distribution Power Grid"}, {"paperId": "5625a3f15ba5a47566bc7ce08cd9213b5ae2f451", "title": "Lifetime optimization of dense wireless sensor networks using continuous ring-sector model"}, {"paperId": "12ecc89771256f00b18f4f6c8d5d44687c74c8c0", "title": "A Case Study of Developing an Intelligent Management System for Energy Internet"}, {"paperId": "6b9a5d3c7ab4ecdba98837b5f197eddf214f66dd", "title": "Data Prediction Based Encoder-Decoder Learning in Wireless Sensor Networks"}, {"paperId": "2334be540a3ed09715cbf38e6f65960e19e84b13", "title": "Effiziente Datenzuordnung und Visualisierung für kabellose Sensor Netzwerke"}]}
