{"paperId": "c13cc5b858b62ebb689a11e4b60cb7e745c465a5", "publicationVenue": {"id": "01c93b25-c79d-47c7-8eb6-79ac1e1d685f", "name": "Intelligent Automation and Soft Computing", "type": "journal", "alternate_names": ["Intell Autom Soft Comput"], "issn": "1079-8587", "url": "http://www.tandfonline.com/loi/tasj20#.UjsltKzqOSo", "alternate_urls": ["http://www.wacong.org/autosoft/auto/index.php", "https://www.tandfonline.com/toc/tasj20/current"]}, "title": "Hybrid Deep Learning Framework for Privacy Preservation in Geo-Distributed Data Centre", "abstract": "In recent times, a huge amount of data is being created from different sources and the size of the data generated on the Internet has already surpassed two Exabytes. Big Data processing and analysis can be employed in many disciplines which can aid the decision-making process with privacy preservation of users’ private data. To store large quantity of data, Geo-Distributed Data Centres (GDDC) are developed. In recent times, several applications comprising data analytics and machine learning have been designed for GDDC. In this view, this paper presents a hybrid deep learning framework for privacy preservation in distributed DCs. The proposed model uses Deep Neural Network (DNN) for the feature extractor and classifier operations. In addition, Siamese training method is applied to fine-tune the prevention of secondary inference on the data. Moreover, gradient descent approach is employed to reduce the loss function of the DNN model. Furthermore, Glow-worm Swarm Optimization (GSO) algorithm is utilized to fine tune the hyperparameters of the DNN model to improve the overall efficiency. The proposed model is executed on a Hadoop based environment, i.e., Hadoop Distributed File System (HDFS), which has two nodes namely master node and slave nodes. The master node is considered as the main user node to get the services from the service provider. Every slave node behaves as per master node’s instruction for data storage. In order to validate the enhanced performance of the proposed model, a series of simulations take place and the experimental results demonstrate the promising performance of the proposed model. The simple technique has reached a maximum gender recognition accuracy of 95, 90 and 79 on the applied data 1, 2 and 3 respectively. Also, the reduced simple approach has attained reduced gender recognition with the accuracy of 91, 84 and 74 on the applied data 1, 2 and 3 respectively.", "venue": "Intelligent Automation and Soft Computing", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": {"name": "Intelligent Automation & Soft Computing"}, "authors": [{"authorId": "52336960", "name": "S. Nithyanantham"}, {"authorId": "145349153", "name": "G. Singaravel"}], "citations": []}
