{"paperId": "c1462eb510849b070bc39335d3ae2911e74fff57", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Monotonic Properties of Completed Aggregates in Recursive Queries", "abstract": "The use of aggregates in recursion enables efficient and scalable support for a wide range of BigData algorithms, including those used in graph applications, KDD applications, and ML applications, which have proven difficult to be expressed and supported efficiently in BigData systems supporting Datalog or SQL. The problem with these languages and systems is that, to avoid the semantic and computational issues created by non-monotonic constructs in recursion, they only allow programs that are stratified with respect to negation and aggregates. Now, while this crippling restriction is well-justified for negation, it is frequently unjustified for aggregates, since (i) aggregates are often monotonic in the standard lattice of set-containment, (ii) the PreM property guarantees that programs with extrema in recursion are equivalent to stratified programs where extrema are used as post-constraints, and (iii) any program computing any aggregates on sets of facts of predictable cardinality tantamounts to stratified programs where the precomputation of the cardinality of the set is followed by a stratum where recursive rules only use monotonic constructs. With (i) and (ii) covered in previous papers, this paper focuses on (iii) using examples of great practical interest. For such examples, we provide a formal semantics that is conducive to efficient and scalable implementations via well-known techniques such as semi-naive fixpoint currently supported by most Datalog and SQL3 systems.", "venue": "arXiv.org", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-10-20", "journal": {"name": "ArXiv", "volume": "abs/1910.08888"}, "authors": [{"authorId": "1712630", "name": "C. Zaniolo"}, {"authorId": "2499545", "name": "Ariyam Das"}, {"authorId": "2150059168", "name": "Jiaqi Gu"}, {"authorId": "2024664573", "name": "Youfu Li"}, {"authorId": "47628976", "name": "Mingda Li"}, {"authorId": "2143717242", "name": "Jin Wang"}], "citations": [{"paperId": "9788e40e3d599926866a1d81c2ceaa455c2d9751", "title": "Datalog in Wonderland"}, {"paperId": "5b01f1caeef7c93cf01f9d4ebc0af5efd8acc96e", "title": "Optimizing Parallel Recursive Datalog Evaluation on Multicore Machines"}, {"paperId": "495fbff8c27e854426264b9f9a1888e3927f22df", "title": "Demonstration of LogicLib: An Expressive Multi-Language Interface over Scalable Datalog System"}, {"paperId": "47410d210b22dfa4d437d24b50dc87ac56b0584f", "title": "Recent Progress in Conversational AI"}, {"paperId": "893ed788c9ca7b160fba2f3001141a0b70a0b479", "title": "Formal semantics and high performance in declarative machine learning using Datalog"}, {"paperId": "59c4149d05557f049c92d1bd774f6724e08dd96f", "title": "Convergence of Datalog over (Pre-) Semirings"}, {"paperId": "d0614367ae0946c8c420e8a8173395ed2d683de8", "title": "KDDLog:Performance and Scalability in Knowledge Discovery by Declarative Queries with Aggregates"}, {"paperId": "c1124e4c7b2d0f287e7a0cdfed0643df711fba16", "title": "Recursive Rules with Aggregation: A Simple Unified Semantics"}, {"paperId": "86e7d81bc9e6eda77e4223d9872c5bd08ec9def2", "title": "RASQL: A Powerful Language and its System for Big Data Applications"}]}
