{"paperId": "c1518856bce286de400b86e9eb8c1598972ff044", "publicationVenue": {"id": "ebca64bd-147a-4846-aeac-cc43bea1dfc7", "name": "American Journal of Audiology", "type": "journal", "alternate_names": ["Am J Audiol"], "issn": "1059-0889", "url": "http://www.asha.org/about/publications/journal-abstracts/aja/", "alternate_urls": ["http://aja.asha.org/"]}, "title": "Big Data for Sound Policies: Toward Evidence-Informed Hearing Health Policies.", "abstract": "Purpose\nThe scarcity of health care resources calls for their rational allocation, including within hearing health care. Policies define the course of action to reach specific goals such as optimal hearing health. The process of policy making can be divided into 4 steps: (a) problem identification and issue recognition, (b) policy formulation, (c) policy implementation, and (d) policy evaluation. Data and evidence, especially Big Data, can inform each of the steps of this process. Big Data can inform the macrolevel (policies that determine the general goals and actions), mesolevel (specific services and guidelines in organizations), and microlevel (clinical care) of hearing health care services. The research project EVOTION applies Big Data collection and analysis to form an evidence base for future hearing health care policies.\n\n\nMethod\nThe EVOTION research project collects heterogeneous data both from retrospective and prospective cohorts (clinical validation) of people with hearing impairment. Retrospective data from clinical repositories in the United Kingdom and Denmark will be combined. As part of a clinical validation, over 1,000 people with hearing impairment will receive smart EVOTION hearing aids and a mobile phone application from clinics located in the United Kingdom and Greece. These clients will also complete a battery of assessments, and a subsample will also receive a smartwatch including biosensors. Big Data analytics will identify associations between client characteristics, context, and hearing aid outcomes.\n\n\nResults\nThe evidence EVOTION will generate is relevant especially for the first 2 steps of the policy-making process, namely, problem identification and issue recognition, as well as policy formulation. EVOTION will inform microlevel, mesolevel, and macrolevel of hearing health care services through evidence-informed policies, clinical guidelines, and clinical care.\n\n\nConclusion\nIn the future, Big Data can inform all steps of the hearing health policy-making process and all levels of hearing health care services.", "venue": "American Journal of Audiology", "year": 2018, "fieldsOfStudy": ["Medicine", "Business"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-11-19", "journal": {"name": "American journal of audiology", "pages": "\n          493-502\n        ", "volume": "27 3S"}, "authors": [{"authorId": "52014081", "name": "Johanna Gutenberg"}, {"authorId": "2099299", "name": "P. Katrakazas"}, {"authorId": "19360095", "name": "Lyubov Trenkova"}, {"authorId": "4855897", "name": "L. Murdin"}, {"authorId": "7520300", "name": "D. Brdaric"}, {"authorId": "19372502", "name": "Nina Koloutsou"}, {"authorId": "13246862", "name": "K. Ploumidou"}, {"authorId": "3180666", "name": "N. H. Pontoppidan"}, {"authorId": "1398058151", "name": "Ariane Laplante-Lévesque"}], "citations": [{"paperId": "65995156e66f7fbfbd5dea0abd7ef7c10ced1302", "title": "Knowledge management tools and mechanisms for evidence-informed decision-making in the WHO European Region: a scoping review"}, {"paperId": "d426256cbbe38154b2d0963a8ad8ffcb96a43630", "title": "Translating health information into policy-making: A pragmatic framework."}, {"paperId": "22479522e8c32d0846285365c33607ca38823378", "title": "Can Haptic Stimulation Enhance Music Perception in Hearing-Impaired Listeners?"}, {"paperId": "faf8f9bf7df921f823af36c5373f50dd89f6198b", "title": "Ecological Momentary Assessment in Hearing Research: Current State, Challenges, and Future Directions."}, {"paperId": "71526c65d5208683c4a45bf144b934e39a4ae1ed", "title": "Public health policy-making for hearing loss: stakeholders’ evaluation of a novel eHealth tool"}, {"paperId": "356e9e34de58428af1e2e5769cf8211fe2579531", "title": "The remote neuro-otology assessment – managing dizziness in the coronavirus disease 2019 era"}, {"paperId": "1d0d288abd76a44b1edaa5f510bdb7b056c35386", "title": "A General Systems Theory Approach in Public Hearing Health: Lessons Learned From a Systematic Review of General Systems Theory in Healthcare"}, {"paperId": "3585fea71431fe2e539d69fd1eb417a5e6801d83", "title": "Application of Big Data to Support Evidence-Based Public Health Policy Decision-Making for Hearing"}, {"paperId": "5d45859ade23624af4d84953f9307441f1c39cb9", "title": "Challenges and Strengths of Multidisciplinary Research in Audiology: The EVOTION Example."}, {"paperId": "380840824bab188933ca108da4ed6de1741cd039", "title": "Fully Synthetic Longitudinal Real-World Data From Hearing Aid Wearers for Public Health Policy Modeling"}, {"paperId": "195cab1caa99d00af2eaea16fb245e407d085dcb", "title": "Power of the Past, Celebrate the Present, Force of the Future—Part 6: NASN—The Next 50 Years"}]}
