{"paperId": "c15a24af47a143874250e02c75d366ff20ca5be2", "publicationVenue": {"id": "a4ebd690-6408-482a-8e37-7be6749c060d", "name": "International Workshop on Quality of Service", "type": "conference", "alternate_names": ["IWQoS", "Int Workshop Qual Serv"], "url": "http://www.wikicfp.com/cfp/program?id=1855"}, "title": "Proactive Auto-scaling For Delay-sensitive Service Providers Over Public Clouds", "abstract": "As a new design mechanism for improving service quality and user experience, a common practice is to deploy the delay-sensitive services in a public cloud. However, this method is also faced with the challenge of serving the fluctuating resource demands through timely acquisition of enough instances. In this paper, we systematically study the problem of proactively purchasing cloud resources for delay-sensitive service providers over the public clouds which are under a flexible pricing model, so that the total cost can be minimized over the long run. We formulate the Proactive Cloud Resource Scaling Cost Minimization (PCRSCM) problem, in which we take the prediction, purchasing and deployment cost into consideration. This problem can be proved to be NP-hard and we propose the Proactive Online Instance Purchase (POIP) algorithm to solve the problem. We also evaluate the performance of POIP through real trace-driven simulations and real testbed. Our evaluation shows that POIP significantly reduces delay by more than 40% when compared to the reactive method and it costs about 20%, 25%, 30% less than state-of-the-art methods, such as POLAR, CMPVS and APOP, respectively.", "venue": "International Workshop on Quality of Service", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-19", "journal": {"name": "2023 IEEE/ACM 31st International Symposium on Quality of Service (IWQoS)", "pages": "01-09"}, "authors": [{"authorId": "2225760488", "name": "Weimeng Wang"}, {"authorId": "2152044506", "name": "Lei Liu"}, {"authorId": "3047447", "name": "Zhongmin Yan"}], "citations": []}
