{"paperId": "c16d07c0a8898c548961c0be1e14029d86df0d8c", "publicationVenue": {"id": "e2742a49-1b55-4a31-b319-7455fa5e12d4", "name": "IEEE Transactions on Services Computing", "type": "journal", "alternate_names": ["IEEE Trans Serv Comput"], "issn": "1939-1374", "url": "http://www.computer.org/tsc", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=4629386"]}, "title": "A Blockchain-Based Cross-Domain and Autonomous Access Control Scheme for Internet of Things", "abstract": "The volume, variety and value of data generated by Internet of Things (IoT) devices are expected to increase significantly in foreseeable future, hence, reinforcing the importance of secure and efficient access control solutions for these devices and their networks. However, existing access control solutions are not generally lightweight or scalable, particularly for geographically disperse, inexpensive resource constrained IoT devices. To tackle above challenges, we propose a lightweight consortium blockchain based architecture to enable intelligent autonomous access control for IoT devices. In our architecture, intelligent blockchain facilitates the storing of access policies, provision of authentication services for data access control, and trust evaluation for access request nodes through token accumulation mechanism. Specifically, the user's access request is approved only after it is confirmed by the blockchain network. To ensure the reliability of authenticity, a compromised resistant consensus algorithm is adapted and implemented to defend against at most <inline-formula><tex-math notation=\"LaTeX\">$1/3$</tex-math><alternatives><mml:math><mml:mrow><mml:mn>1</mml:mn><mml:mo>/</mml:mo><mml:mn>3</mml:mn></mml:mrow></mml:math><inline-graphic xlink:href=\"ren-ieq1-3179727.gif\"/></alternatives></inline-formula> compromised authenticators. In addition, a cross-domain and flexible access control model is not only used to support data sharing among various users but can also be used for access control for exceptional blockchain situations. We explain how our system meets our design goals of reliability, availability, confidentiality, integrity, lightweight, security and scalability. In addition, we also analyze the proposed system's performance from computational, storage and network overheads (e.g., running cryptographic algorithms on a Raspberry Pi 4B), and the findings suggest that the time to run typical cryptographic algorithms is in the microsecond range.", "venue": "IEEE Transactions on Services Computing", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-03-01", "journal": {"name": "IEEE Transactions on Services Computing", "pages": "773-786", "volume": "16"}, "authors": [{"authorId": "2049070804", "name": "Xiaohan Hao"}, {"authorId": "145805554", "name": "Wei Ren"}, {"authorId": "37298184", "name": "Yang-yang Fei"}, {"authorId": "32620196", "name": "Tianqing Zhu"}, {"authorId": "116022805", "name": "K. Choo"}], "citations": [{"paperId": "612ddf5defd9379f537a80b608c33714405b9bc6", "title": "SDACS: Blockchain-Based Secure and Dynamic Access Control Scheme for Internet of Things"}, {"paperId": "d5b0b0e6a1fd2664ece459e06d8b8d49122c1001", "title": "Behavioral Authentication for Security and Safety"}, {"paperId": "ea584d514d93f2b53febfe008644335b00dac316", "title": "Fine-Grained Data Rights Governance in Blockchain-Based Cloud-Edge Communications"}, {"paperId": "43657149d1a5371772d85599b9557fadf1b139ef", "title": "Distributed ledger technologies for authentication and access control in networking applications: A comprehensive survey"}, {"paperId": "6c3edd01a4bed20983258fcc2e9be1d64913558c", "title": "Challenges and Solutions for Vehicular Ad-Hoc Networks Based on Lightweight Blockchains"}, {"paperId": "3821b60af6e94702f9ec5a9269463f982cb64a8e", "title": "IPFS-Blockchain Smart Contracts Based Conceptual Framework to Reduce Certificate Frauds in the Academic Field"}, {"paperId": "a3b74afb884fd9cb94c1b8c248eaecb68c39b7b6", "title": "Decentralized Policy-Hidden Fine-Grained Redaction in Blockchain-Based IoT Systems"}, {"paperId": "c74c8d24adf10a02e906a90f30469c9bf9ffb811", "title": "Trusted edge and cross-domain privacy enhancement model under multi-blockchain"}, {"paperId": "0c9b7128e5024e14f22e80e2529c71bd0db4dcf9", "title": "Lightweight blockchain solutions: Taxonomy, research progress, and comprehensive review"}, {"paperId": "7117582ae8152256c4ff08e749aeeb822e53c236", "title": "A Blockchain-based Authentication and Access Control for Smart Devices in SDN-enabled Networks for Metaverse"}, {"paperId": "0c64a481bb61a2864643421629eb1ddadefd53f2", "title": "A Survey and Comparison of Post-Quantum and Quantum Blockchains"}]}
