{"paperId": "c171a8a93a57e7a499890b1e77233b8d16d4d384", "publicationVenue": null, "title": "Machine learning and blockchain technologies for cybersecurity in connected vehicles", "abstract": "Future connected and autonomous vehicles (CAVs) must be secured against cyberattacks for their everyday functions on the road so that safety of passengers and vehicles can be ensured. This article presents a holistic review of cybersecurity attacks on sensors and threats regarding multi‐modal sensor fusion. A comprehensive review of cyberattacks on intra‐vehicle and inter‐vehicle communications is presented afterward. Besides the analysis of conventional cybersecurity threats and countermeasures for CAV systems, a detailed review of modern machine learning, federated learning, and blockchain approach is also conducted to safeguard CAVs. Machine learning and data mining‐aided intrusion detection systems and other countermeasures dealing with these challenges are elaborated at the end of the related section. In the last section, research challenges and future directions are identified.", "venue": "WIREs Data. Mining. Knowl. Discov.", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-09-19", "journal": {"name": "Wiley Interdisciplinary Reviews: Data Mining and Knowledge Discovery", "volume": "14"}, "authors": [{"authorId": "134125548", "name": "Jameel Ahmad"}, {"authorId": "2153865149", "name": "Muhammad Umer Zia"}, {"authorId": "1982555", "name": "I. Naqvi"}, {"authorId": "3364679", "name": "J. N. Chattha"}, {"authorId": "35854575", "name": "Faran Awais Butt"}, {"authorId": "2216306869", "name": "Tao Huang"}, {"authorId": "2052727274", "name": "Wei Xiang"}], "citations": [{"paperId": "84317e9f3b4345602f2fbbf4bc1872c6df9add09", "title": "Sybil Attacks Detection and Traceability Mechanism Based on Beacon Packets in Connected Automobile Vehicles"}, {"paperId": "78bc2e43caae80c9c6623c8dbacab605131fc5e7", "title": "Quantum communication based cyber security analysis using artificial intelligence with IoMT"}, {"paperId": "84d5e00d5961b24d48051885fb6a40b937ba145c", "title": "V2X Cooperative Perception for Autonomous Driving: Recent Advances and Challenges"}, {"paperId": "b5a5f571a3ffbf8c6a6a9309bafc948b3528a2ff", "title": "Scalability of blockchain: Review of cross-sharding with high communication overhead"}, {"paperId": "f16ea5c35941987b052fddb6d641d398ade56db1", "title": "Decentralized Identity Veriﬁcation System for Data Access to Prevent Data Exﬁltration Ransomware"}]}
