{"paperId": "c17184a3db39dd4e4571dd767a4fae6c7390a80f", "publicationVenue": {"id": "f2c78b1b-6bcc-4700-859b-af9401c02941", "name": "Buildings", "type": "journal", "issn": "0007-3725", "alternate_issns": ["2075-5309"], "url": "https://www.buildings.com/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217973", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217973", "https://www.mdpi.com/journal/buildings"]}, "title": "Scenario-Based Comprehensive Assessment for Community Resilience Adapted to Fire Following an Earthquake, Implementing the Analytic Network Process and Preference Ranking Organization Method for Enriched Evaluation II Techniques", "abstract": "Natural hazards bring significant influences on and socioeconomic loss to cities and communities. Historic events show that fire following earthquake (FFE) is the most influential uncertain disturbance on the urban infrastructure system. Under the FFE scenario, the concept of resilience is widely implemented to make up the shortcomings derived from the traditional disaster management methodology. Resilient cities and communities are required to improve the systemic performance in responding to the FFE. To fulfill these goals, measuring community resilience is an essential work for municipal policy makers. Therefore, this study conducted a comprehensive assessment on community resilience adapted to the FFE scenario. The systematic literature review (SLR) was employed to identify the indicators, and the analytic network process (ANP) technique was implemented to determine their weights. 20 indicators were extracted, and 4 communities that encountered FFE in China were selected for the empirical analysis. Thereafter, the preference ranking organization method for enriched evaluation (PROMETHEE) II technique was selected through using the multicriteria decision analysis (MCDA) methods selection framework to fulfill the comprehensive assessment. The results were discussed and demonstrated with graphical analysis for interactive aid (GAIA) technique. The findings revealed that the G Community won the highest score and had the strongest performance. However, H Community had the lowest score and the weakest performance. The proposed comprehensive methods could benefit the decision-makers and the policy executors achieving the community resilience adapted to the FFE scenario by improving the effective indicators.", "venue": "Buildings", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2021-11-07", "journal": {"name": "Buildings"}, "authors": [{"authorId": "2152990239", "name": "Zheng He"}, {"authorId": "49178111", "name": "Huihua Chen"}, {"authorId": "48506596", "name": "Hongyan Yan"}, {"authorId": "2155262339", "name": "Yang Yin"}, {"authorId": "2139617226", "name": "Qi Qiu"}, {"authorId": "2155393166", "name": "Ting Wang"}], "citations": [{"paperId": "44330cd3cbef40d18e807a1be209fb69312f8c8c", "title": "Enhancing Buildings’ Energy Resilience by Dynamic Seismic Emergency Inspection and Restoration Scheduling in Multiple Systems"}, {"paperId": "c20945cea0bb0210a9e6d64f022990543d0d7b8b", "title": "District-based Baseline Resilience Indicators for Communities (DBRIC) for Assessment of a Global South City"}, {"paperId": "9ea7534fe8c684754f073402c94a06de3971b99a", "title": "Measuring farmers’ sustainable livelihood resilience in the context of poverty alleviation: a case study from Fugong County, China"}, {"paperId": "cebc7afda9eb182013accd47e9a7436ce7a9d6b4", "title": "Research on Safety Resilience Evaluation Model of Data Center Physical Infrastructure: An ANP-Based Approach"}, {"paperId": "0e0c9bbe47638b9f9ed92b7a3cf8bc36074b9ca4", "title": "Fuzzy Comprehensive Evaluation of APTS Dispatcher Working Level Based on Cloud Model"}, {"paperId": "7aa75d8f9993b848fe96f1a4c4349587d4e77227", "title": "Is Resilient Transportation Infrastructure Low-Carbon? Evidence from High-Speed Railway Projects in China"}, {"paperId": "e456294ebba99f927ddfed22cbe5dce9b0777de5", "title": "Key Elements of Attentions for Enhancing Urban Resilience: A Comparison of Singapore, Hong Kong and Hangzhou"}, {"paperId": "27e22bd97929ce436261fdcf6e2f943159f2dcf4", "title": "Identification and hierarchical structure of cause factors for fire following earthquake using data mining and interpretive structural modeling"}, {"paperId": "fef88da4cbf9f36794abefa6edb4f7d8065b9254", "title": "Measuring the Construction Project Resilience from the Perspective of Employee Behaviors"}, {"paperId": "d26bd2ce73258801fcd5764970dc50ccc7679312", "title": "Comprehensive Review of Community Seismic Resilience: Concept, Frameworks, and Case Studies"}]}
