{"paperId": "c17314a48ce3f61cccc18f4f8a3849048a8d9626", "publicationVenue": {"id": "86c43745-31d9-4c1a-b33f-ce3aa0042dbb", "name": "USENIX Symposium on Operating Systems Design and Implementation", "type": "conference", "alternate_names": ["Oper Syst Des Implement", "Operating Systems Design and Implementation", "OSDI", "USENIX Symp Oper Syst Des Implement"]}, "title": "DQBarge: Improving Data-Quality Tradeoffs in Large-Scale Internet Services", "abstract": "Modern Internet services often involve hundreds of distinct software components cooperating to handle a single user request. Each component must balance the competing goals of minimizing service response time and maximizing the quality of the service provided. This leads to low-level components making data-quality tradeoffs, which we define to be explicit decisions to return lower-fidelity data in order to improve response time or minimize resource usage. \n \nWe first perform a comprehensive study of low-level data-quality tradeoffs at Facebook. We find that such tradeoffs are widespread. We also find that existing data-quality tradeoffs are often suboptimal because the low-level components making the tradeoffs lack global knowledge that could enable better decisions. Finally, we find that most tradeoffs are reactive, rather than proactive, and so waste resources and fail to mitigate system overload. \n \nNext, we develop DQBarge, a system that enables better data-quality tradeoffs by propagating critical information along the causal path of request processing. This information includes data provenance, load metrics, and critical path predictions. DQBarge generates performance and quality models that help low-level components make better, more proactive, tradeoffs. Our evaluation shows that DQBarge helps Internet services mitigate load spikes, improve utilization of spare resources, and implement dynamic capacity planning.", "venue": "USENIX Symposium on Operating Systems Design and Implementation", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2016-11-02", "journal": {"pages": "771-786"}, "authors": [{"authorId": "48705774", "name": "Michael Chow"}, {"authorId": "3199448", "name": "K. Veeraraghavan"}, {"authorId": "1725561", "name": "Michael J. Cafarella"}, {"authorId": "1693763", "name": "J. Flinn"}], "citations": [{"paperId": "063676c0d4865ad14000419b02d6e1a72331b2ed", "title": "Hydrus: Improving Personalized Quality of Experience in Short-form Video Services"}, {"paperId": "62dcf97ab9939342e2b31f21bf2125cdb1f5b740", "title": "DCAF: A Dynamic Computation Allocation Framework for Online Serving System"}, {"paperId": "6f2ef13e434f5e0e283753cfa16c650d7729dd2c", "title": "E2E: embracing user heterogeneity to improve quality of experience on the web"}, {"paperId": "9be694ff4a329f4ff7adc7aa4a133b0f24884bc5", "title": "The Case for Unifying Data Loading in Machine Learning Clusters"}, {"paperId": "c2c9b0bd2c49d3ec59e76ae6b054447a72033c5b", "title": "Pivot tracing"}, {"paperId": "a2f0971b7f4d7c7d58e00492284985d2ac6c0d03", "title": "Multi-Query Optimization in Wide-Area Streaming Analytics"}, {"paperId": "7b8b42bbf9fffe96ecbbaf707ace8f1357220e20", "title": "RobinHood: Tail Latency Aware Caching - Dynamic Reallocation from Cache-Rich to Cache-Poor"}, {"paperId": "857e2e6613cbe8f31f706d409825bfbd2ce94ffe", "title": "Design and Analysis of Adaptive Caching Techniques for Internet Content Delivery"}, {"paperId": "c5711106240e93aeed810db7bc789d8d055e9de3", "title": "Universal context propagation for distributed system instrumentation"}, {"paperId": "b97b2517894275f9872743023459e173f3f1ff77", "title": "E 2 E : Embracing User Heterogeneity to ImproveQuality of Experience on the Web"}]}
