{"paperId": "c17975b385596a232c69a745cafd7f8758e5d101", "publicationVenue": {"id": "ccd8e532-73c6-414f-bc91-271bbb2933e2", "name": "Electronics", "type": "journal", "issn": "1450-5843", "alternate_issns": ["2079-9292", "0883-4989"], "url": "http://www.electronics.etfbl.net/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-247562", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-247562", "https://www.mdpi.com/journal/electronics"]}, "title": "Security Information Sharing in Smart Grids: Persisting Security Audits to the Blockchain", "abstract": "With the transformation in smart grids, power grid companies are becoming increasingly dependent on data networks. Data networks are used to transport information and commands for optimizing power grid operations: Planning, generation, transportation, and distribution. Performing periodic security audits is one of the required tasks for securing networks, and we proposed in a previous work autoauditor, a system to achieve automatic auditing. It was designed according to the specific requirements of power grid companies, such as scaling with the huge number of heterogeneous equipment in power grid companies. Though pentesting and security audits are required for continuous monitoring, collaboration is of utmost importance to fight cyber threats. In this paper we work on the accountability of audit results and explore how the list of audit result records can be included in a blockchain, since blockchains are by design resistant to data modification. Moreover, blockchains endowed with smart contracts functionality boost the automation of both digital evidence gathering, audit, and controlled information exchange. To our knowledge, no such system exists. We perform throughput evaluation to assess the feasibility of the system and show that the system is viable for adaptation to the inventory systems of electrical companies.", "venue": "Electronics", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2020-11-06", "journal": {"name": "Electronics"}, "authors": [{"authorId": "1413106627", "name": "A. Marín-Lopez"}, {"authorId": "2036617387", "name": "Sergio Chica-Manjarrez"}, {"authorId": "2064088069", "name": "David Arroyo"}, {"authorId": "2036613897", "name": "Florina Almenares-Mendoza"}, {"authorId": "1404626420", "name": "D. Díaz-Sánchez"}], "citations": [{"paperId": "259d34a3fda4af633c722a7fab9937cc0b2497aa", "title": "Application of Blockchain Based on Fabric Consensus Network Model in Secure Encryption of Educational Information"}, {"paperId": "d20f0e8aaaf7d287b7a45c3aa901f67b3b45cde5", "title": "Utilizing Knowledge Graph to Build a Scientific and Technological Knowledge Management System for Grid Industry"}, {"paperId": "45d44efdd0b7080c4b3e72a025ce6da3f206745b", "title": "A Blockchain-Enabled Framework for Improving the Software Audit Process"}, {"paperId": "8b5f8a2c8d8d5406fa202e8c68af92bfa02df644", "title": "Advanced Cybersecurity Services Design"}, {"paperId": "70895cb710f83bef50eebe4e6dd60171689825bd", "title": "Microgrid Data Security Sharing Method Based on Blockchain under Internet of Things Architecture"}, {"paperId": "5c84d1bc2a78c663759283a560266420e254fdf5", "title": "Applications of Blockchain in Industry 4.0: a Review"}, {"paperId": "20e47f768b554aa1f6f1d8b8110fb05ece7f3acb", "title": "Integration Of Smart Grid And Blockchain"}, {"paperId": "33e5ab51b7395462f8fc612cd3634968c8dd915a", "title": "Cybersecurity in Power Grids: Challenges and Opportunities"}]}
