{"paperId": "c1928f42ad6293562df6078b83adef1e78bd224e", "publicationVenue": {"id": "0c1420a4-aa9b-44f9-b264-ba3ac5c37050", "name": "International Conference for High Performance Computing, Networking, Storage and Analysis", "alternate_names": ["Int Conf High Perform Comput Netw Storage Anal"], "issn": "2167-4337", "alternate_issns": ["2167-4329"], "url": "http://ieeexplore.ieee.org/xpl/conhome.jsp?punumber=1000729"}, "title": "Tango: Rethinking Quantization for Graph Neural Network Training on GPUs", "abstract": "Graph learning is becoming increasingly popular due to its superior performance in tackling many grand challenges. While quantization is widely used to accelerate Graph Neural Network (GNN) computation, quantized training faces remarkable roadblocks. Current quantized GNN training systems often experience longer training time than their full-precision counterparts for two reasons: (i) addressing the quantization accuracy challenge leads to excessive overhead, and (ii) the optimization potential exposed by quanti-zation is not adequately leveraged. This paper introduces Tango which re-thinks quantization challenges and opportunities for graph neural network training on GPUs with three contributions: Firstly, we introduce efficient rules to maintain accuracy during quantized GNN training. Secondly, we design and implement quantization-aware primitives and inter-primitive optimizations to speed up GNN training. Finally, we integrate Tango with the popular Deep Graph Library (DGL) system and demonstrate its superior performance over the state-of-the-art approaches on various GNN models and datasets.", "venue": "International Conference for High Performance Computing, Networking, Storage and Analysis", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2023-08-02", "journal": {"name": "SC23: International Conference for High Performance Computing, Networking, Storage and Analysis", "pages": "1-15"}, "authors": [{"authorId": "2116545137", "name": "Shiyang Chen"}, {"authorId": "122579067", "name": "Da Zheng"}, {"authorId": "2881873", "name": "Caiwen Ding"}, {"authorId": "40879604", "name": "Chengying Huan"}, {"authorId": "3028841", "name": "Yuede Ji"}, {"authorId": "1390915579", "name": "Hang Liu"}], "citations": []}
