{"paperId": "c1a3b756b61c94feb623cdacb9c5c4cb4c306661", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Built Environment Cybersecurity: Development and Validation of a Semantically Defined Access Management Framework on a University Case Study", "abstract": "To achieve the potential of smart cities, there is a strong requirement to use a set of useful, but still accessible services within smart city systems. Interoperability challenges and roadblocks for software developers and integrators are well-known consequences of fragmented semantics across different contexts. Furthermore, in the smart city context, there is a need to ensure the security and identity of real-world services operating on this data through the adoption of access control principles (authorization and authentication). The use of ontologies to unify the diverse semantics of multiple domains is one strategy that has had considerable success in the past. This paper describes an access management ontology in smart cities developed to enable the interoperability of physical built environment assets, sensing and actuation devices and current built environment services with existing security standards, digital twin and Building Information Model (BIM) datasets. It also provides interoperability between user interfaces and the actors who use them in the context of establishing an access management in smart cities framework for the built environment. This has been validated through its implementation in the Cardiff Urban Sustainability Platform (CUSP), deployed to manage a variety of smart services on a university campus. This validation has successfully shown the ability of the ontology to function as intended in the context of a digital twin, thereby offering single sign-on and suitable access control.", "venue": "Applied Sciences", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-26", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "2087965699", "name": "Kaznah Alshammari"}, {"authorId": "6396047", "name": "T. Beach"}, {"authorId": "1757067", "name": "Y. Rezgui"}, {"authorId": "1395030610", "name": "Raed Alelwani"}], "citations": [{"paperId": "b331dfd01bb167c61e6398bd9716cceb8424bd06", "title": "Integrating leading-edge sensors for enhanced monitoring and controlling in architecture, engineering and construction: a review"}]}
