{"paperId": "c1adda9d322a9a148c729569a7ea1c353f374ffc", "publicationVenue": {"id": "c6b969a5-d295-4c65-bbe8-a2dc52990db8", "name": "IEEE transactions on fuzzy systems", "type": "journal", "alternate_names": ["IEEE trans fuzzy syst", "IEEE Trans Fuzzy Syst", "IEEE Transactions on Fuzzy Systems"], "issn": "1063-6706", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=91"}, "title": "Hierarchical Fuzzy Neural Networks With Privacy Preservation for Heterogeneous Big Data", "abstract": "Heterogeneous big data poses many challenges in machine learning. Its enormous scale, high dimensionality, and inherent uncertainty make almost every aspect of machine learning difficult, from providing enough processing power to maintaining model accuracy to protecting privacy. However, perhaps the most imposing problem is that big data is often interspersed with sensitive personal data. Hence, we propose a privacy-preserving hierarchical fuzzy neural network to address these technical challenges while also alleviating privacy concerns. The network is trained with a two-stage optimization algorithm, and the parameters at low levels of the hierarchy are learned with a scheme based on the well-known alternating direction method of multipliers, which does not reveal local data to other agents. Coordination at high levels of the hierarchy is handled by the alternating optimization method, which converges very quickly. The entire training procedure is scalable, fast, and does not suffer from gradient vanishing problems like the methods based on backpropagation. Comprehensive simulations conducted on both regression and classification tasks demonstrate the effectiveness of the proposed model. Our code is available online.1", "venue": "IEEE transactions on fuzzy systems", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-01-01", "journal": {"name": "IEEE Transactions on Fuzzy Systems", "pages": "46-58", "volume": "29"}, "authors": [{"authorId": "2107887542", "name": "Leijie Zhang"}, {"authorId": "2148470645", "name": "Ye Shi"}, {"authorId": "143702693", "name": "Yu-Cheng Chang"}, {"authorId": "2146113291", "name": "Chin-Teng Lin"}], "citations": [{"paperId": "25db1f56278182c63568b740d8803cb112ac2241", "title": "Hierarchical Self-Organizing Fuzzy Control for Uncertain Nonlinear Systems"}, {"paperId": "1ac901a3953ce5061327d2942bb7dd162a3e6f15", "title": "Reinforced Interval Type-2 Fuzzy Clustering-Based Neural Network Realized Through Attention-Based Clustering Mechanism and Successive Learning"}, {"paperId": "10af9538216dffbeb3d99d8bab07fca99ca95c5d", "title": "Construction of Universal Approximators for Multi-Input Single-Output Hierarchical Fuzzy Systems"}, {"paperId": "c51a27acc25c45c234fdf0fc01f9404f277a1961", "title": "A review of secure federated learning: Privacy leakage threats, protection technologies, challenges and future directions"}, {"paperId": "3c9b03a333ff4307029468a50c4407213c9f469a", "title": "Intelligent privacy preserving deep learning model for securing IoT healthcare system in cloud storage"}, {"paperId": "b5bff658641974ea870b469bd87bab7a5a4596e8", "title": "Cross task neural architecture search for EEG signal recognition"}, {"paperId": "e6b8381b881ee789c313acac05c73ba9366edf54", "title": "A self-organizing fuzzy neural network with hybrid learning algorithm for nonlinear system modeling"}, {"paperId": "50d909b5c6704668f648545bd62a86a27f3506a1", "title": "FedTP: Federated Learning by Transformer Personalization"}, {"paperId": "97adc2a6d49418401138f3a9d58c6326fa7676f5", "title": "Quaternion model of Pythagorean fuzzy sets and its distance measure"}, {"paperId": "98d6bc7257f71d595eb2137dcc5bba23b014977e", "title": "Federated Fuzzy Neural Network With Evolutionary Rule Learning"}, {"paperId": "c1a4be4f81de5b1f0f82ddfcf66c926534110200", "title": "Cross Task Neural Architecture Search for EEG Signal Classifications"}, {"paperId": "1a3342e40695c8408d1190d6b947476fba6b7573", "title": "A key review on security and privacy of big data: issues, challenges, and future research directions"}, {"paperId": "2db75787ab4257711bc9366dc7ee2a3c21603ee0", "title": "Literature Review of the Recent Trends and Applications in Various Fuzzy Rule-Based Systems"}, {"paperId": "657ce84a2d326d25e4937e08af1c54b1854ec5e0", "title": "Deep Learning: Differential Privacy Preservation in the Era of Big Data"}, {"paperId": "0bae0651fe084a2387d73fd0f9c6a8140e197151", "title": "A comprehensive survey on nature‐inspired algorithms and their applications in edge computing: Challenges and future directions"}, {"paperId": "3589ba7d7d07f7663e850e99b1411bc69a2a0bbd", "title": "Towards a Federated Fuzzy Learning System"}, {"paperId": "881806ed444618a22f8d5183fb95555e0b91fac6", "title": "A Self-Optimizing Technique Based on Vertical Handover for Load Balancing in Heterogeneous Wireless Networks Using Big Data Analytics"}, {"paperId": "c7f310058a85266896e8ea12488fe2468a0e2006", "title": "Literature Review of various Fuzzy Rule based Systems"}]}
