{"paperId": "c1b17f18a021384f3e9cbbe96af49b41ab5157db", "publicationVenue": {"id": "a389928b-5740-4ffb-937d-3d045fbc82a8", "name": "International Journal of Smart Vehicles and Smart Transportation", "type": "journal", "alternate_names": ["Int J Smart Veh Smart Transp"], "issn": "2642-1631", "url": "https://www.igi-global.com/gateway/login/"}, "title": "Towards an Architecture for Online Scheduling of Autonomous Robots in Agriculture", "abstract": "Nowadays, we observe the development of autonomous robots for agricultural tasks. Farmers are becoming task and data managers with the emergence of advanced farm management information systems (FMISs). However, existing FMISs lack the tools for handling scheduling and monitoring of fleets of robots. The scheduling functionalities are essential for the growth of autonomous robot industry. It allows a better management to share these state of the art and expensive resources between multiple farmers, reducing the overall cost. Scheduling is always coupled with a re-scheduling process that allows to react to unexpected events. The re-scheduling process, called online scheduling, can only be made possible with a monitoring process that collects real-time information about the ongoing tasks and the state of robots. Finally, relatively little is known about the changes in farmers' activities as a result of the introduction of these robots. Acceptance of these new technologies is nevertheless essential to the performance of the systems. Motivated by the lack of a general framework for the online scheduling of autonomous robots for agriculture, the authors propose a conceptual framework for the scheduling and monitoring of such shared resources. All the needed building blocks for the whole conceptual framework to function efficiently are highlighted. Open issues related to each of these building blocks are discussed, from robotics auto-diagnosis to data management, wireless communication, scheduling, monitoring, and controlling these autonomous robots, keeping in the loop the human operator and his essential role in this system.", "venue": "International Journal of Smart Vehicles and Smart Transportation", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2022-01-01", "journal": {"name": "International Journal of Smart Vehicles and Smart Transportation"}, "authors": [{"authorId": "3211738", "name": "Bruno Bachelet"}, {"authorId": "151426175", "name": "Pietro Battistoni"}, {"authorId": "1719976", "name": "S. Bimonte"}, {"authorId": "29916589", "name": "C. Cariou"}, {"authorId": "1938968", "name": "G. Chalhoub"}, {"authorId": "47632793", "name": "Fabien Coutarel"}, {"authorId": "48511964", "name": "N. Tricot"}], "citations": []}
