{"paperId": "c1b36d2469249b269b953486d4da184c3927bebd", "publicationVenue": {"id": "657a4bec-9a11-40fb-acfe-243d7fb993ae", "name": "Frontiers in Earth Science", "type": "journal", "alternate_names": ["Frontiers of Earth Science", "Frontiers in Earth Sciences", "Front Earth Sci"], "issn": "2296-6463", "alternate_issns": ["1863-4621", "2095-0195"], "url": "http://www.frontiersin.org/Earth_Science", "alternate_urls": ["http://journal.hep.com.cn/fesci/EN/2095-0195/current.shtml", "http://www.frontiersin.org/Journal/Archive.aspx?artId=0&f=19&name=Earth_Science", "https://www.frontiersin.org/journals/earth-science", "https://www.springer.com/series/7066"]}, "title": "Strength model of a cemented body based on self-compacting characteristics of tailings", "abstract": "To examine the strength and mechanical characteristics of self-compacting tailings, a direct shear test was conducted under various consolidation states and moisture contents to determine the cohesion and internal friction angle of the tailings. The degree of cohesion and the internal friction angle of unsaturated tailings increased initially before declining as the moisture content rose. The maximum cohesion and internal friction angle were reached when the moisture content was around 14%. When combined with the Coulomb shear strength formula and the tailings self-weight compaction model, the expressions for the active pressure and passive pressure of tailings at any height on the lateral restraint were obtained. An improvement in cohesion and the internal friction angle of unsaturated tailings was seen with increased consolidation stress, which became stable when the consolidation stress was greater than 1 MPa. The limited equilibrium method was used to establish the three-dimensional mechanical equilibrium of the cemented body. A strength model of cementation at the open stoping stage with subsequent filling was developed after the three-dimensional strength analytical model of cementation in step 1 was modified. The difference between the design value and the measured value was 0.2 MPa. The strength of the one-step cemented backfill design, as well as the design and erection of the backfill retaining wall, was supported technically and theoretically by this study.", "venue": "Frontiers in Earth Science", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-01-19", "journal": {"volume": "10"}, "authors": [{"authorId": "2112530003", "name": "Wang Jun"}, {"authorId": "52307155", "name": "Yang Tian-yu"}, {"authorId": "2103095676", "name": "Qiao Deng-pan"}, {"authorId": "2105998742", "name": "Chen Jie"}, {"authorId": "2202051754", "name": "Luo Zheng-Liang"}], "citations": []}
