{"paperId": "c1cb06eca1d193987a455177e27f547af26bd04f", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Graph-based keyword search in heterogeneous data sources", "abstract": "Data journalism is the field of investigative journalism which focuses on digital data by treating them as first-class citizens. Following the trends in human activity, which leaves strong digital traces, data journalism becomes increasingly important. However, as the number and the diversity of data sources increase, heterogeneous data models with different structure, or even no structure at all, need to be considered in query answering. Inspired by our collaboration with Le Monde, a leading French newspaper, we designed a novel query algorithm for exploiting such heterogeneous corpora through keyword search. We model our underlying data as graphs and, given a set of search terms, our algorithm nds links between them within and across the heterogeneous datasets included in the graph. We draw inspiration from prior work on keyword search in structured and unstructured data, which we extend with the data heterogeneity dimension, which makes the keyword search problem computationally harder. We implement our algorithm and we evaluate its performance using synthetic and real-world datasets.", "venue": "arXiv.org", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-09-09", "journal": {"name": "ArXiv", "volume": "abs/2009.04283"}, "authors": [{"authorId": "1932233992", "name": "Mhd Yamen Haddad"}, {"authorId": "2649908", "name": "Angelos-Christos G. Anadiotis"}, {"authorId": "150350469", "name": "Y. Mhd"}, {"authorId": "1739309", "name": "I. Manolescu"}], "citations": [{"paperId": "a7f1e6428166605afd11f1bbceca7352fc7a28a3", "title": "Discovering Conflicts of Interest across Heterogeneous Data Sources with ConnectionLens"}, {"paperId": "4d77adfb39529c317143ac177582a927fdfcf57c", "title": "Empowering Investigative Journalism with Graph-based Heterogeneous Data Management"}, {"paperId": "e289245bb3b75a749c1ee2fd8fee0afafb59e42a", "title": "Graph integration of structured, semistructured and unstructured data for data journalism"}, {"paperId": "a58225123cf1ad9faa6facdb5d3358094d0abd59", "title": "Say the word, and You'll be Free: Methods and Techniques for Natural Language Database Interfaces"}, {"paperId": "6893696271290fa801a3a5cab60bfd4e989eb6e7", "title": "Scalable integration and interpretation of heterogeneous data sources"}]}
