{"paperId": "c1cc7e26eb805ef8f3760028267d7755b964ca98", "publicationVenue": {"id": "d5b215f3-f737-45b2-875b-df309ce14c43", "name": "Scientific Programming", "type": "journal", "alternate_names": ["Sci Program"], "issn": "1058-9244", "url": "https://www.hindawi.com/journals/sp/", "alternate_urls": ["https://www.iospress.nl/html/10589244.php", "https://www.wiley.com/legacy/compbooks/compjournals/sciprog.html", "http://content.iospress.com/journals/scientific-programming"]}, "title": "Towards Energy-Efficient Framework for IoT Big Data Healthcare Solutions", "abstract": "The aim of the Internet of things (IoT) is to bring every object (wearable sensors, healthcare sensors, cameras, home appliances, smart phones, etc.) online. These different objects generate huge data which consequently lead to the need of requirements of efficient storage and processing. Cloud computing is an emerging technology to overcome this problem. However, there are some applications (healthcare) which need to process data in real time to improve its performance and require low latency and delay. Fog computing is one of the promising solutions which facilitate healthcare domain in terms of reducing the delay multihop data communication, distributing resource demands, and promoting service flexibility. In this study, a fog-based IoT healthcare framework is proposed in order to minimize the energy consumption of the fog nodes. Experimental results reveal that the performance of the proposed framework is efficient in terms of network delay and energy usage. Furthermore, the authors discussed and suggested important services of big data infrastructure which need to be present in fog devices for the analytics of healthcare big data.", "venue": "Scientific Programming", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-06-12", "journal": {"name": "Sci. Program.", "pages": "7063681:1-7063681:9", "volume": "2020"}, "authors": [{"authorId": "144579978", "name": "Chong Feng"}, {"authorId": "2118130955", "name": "M. Adnan"}, {"authorId": "2111120623", "name": "Arshad Ahmad"}, {"authorId": "8503981", "name": "A. Ullah"}, {"authorId": "2056138430", "name": "Habib Ullah Khan"}], "citations": [{"paperId": "0a52b63dd3c5ef907b363ae5fd6101b610f92575", "title": "Minimizing the Energy Consumption using Coral Reef Based Energy-Efficient Framework in Internet of Medical Things"}, {"paperId": "759805f94bd163aea619672e9442e559a433c0c1", "title": "Reliable cluster based data collection framework for IoT-big data healthcare applications"}, {"paperId": "5fafed05ddf47de0d8d730fa7ac7b4ebebad1f13", "title": "Role of IOT in Healthcare Inclusion in Developing Countries: A Systematic Literature Review"}, {"paperId": "07766c136916ce3a453229e5713ee7e9f4a53dab", "title": "Cybersecurity for Industrial IoT (IIoT): Threats, countermeasures, challenges and future directions"}, {"paperId": "99c7ef2771f6f352b2d8c24b31860e9e1c01fb24", "title": "Empowering Healthcare with AI: Addressing Challenges and Envisioning the Future"}, {"paperId": "551b302eaf01a370a789252e01a45dbd16d32bc0", "title": "Reform of college students' teaching management informatization under the background of big data and IoT"}, {"paperId": "9f5eebc3db2c0e1a2ef031bc1f5837969ec9dbb9", "title": "Healthcare Internet of Things (H-IoT): Current Trends, Future Prospects, Applications, Challenges, and Security Issues"}, {"paperId": "8227f791cc4e237cdb95d74d7bb28be08030253d", "title": "The Internet of Things (IoT) in healthcare: Taking stock and moving forward"}, {"paperId": "45f5b904e24db6d3a41ce467d586c3c0c0e88e3f", "title": "Cloud-edge load balancing distributed protocol for IoE services using swarm intelligence"}, {"paperId": "38aba34aa40f1583a17443b4fcd1b553a5ddf377", "title": "Internet of Things in the global healthcare sector: Significance, applications, and barriers"}, {"paperId": "6b045e501e9b871de066138729aab3127dd15445", "title": "Energy Efficient Double Critic Deep Deterministic Policy Gradient Framework for Fog Computing"}, {"paperId": "0b2531a60af70fa1cb182800b35e97569df3ef9b", "title": "Particle Swarm Optimization in the Presence of Malicious Users in Cognitive IoT Networks with Data"}, {"paperId": "66c4f02c3a9df5461d5957dd4acf9f5672809ca8", "title": "Security Measurement in Industrial IoT with Cloud Computing Perspective: Taxonomy, Issues, and Future Directions"}, {"paperId": "c207df5a7f45486c32caf3043087afe7b85506ff", "title": "Disease Prediction and Diagnosis Model for IoT–Cloud-Based Critical Healthcare System"}, {"paperId": "2575469e6bea7576a73a256e1cd0beca587c75f0", "title": "The Internet of Things (IoT) in healthcare: Taking stock and The Internet of Things (IoT) in healthcare: Taking stock and moving forward moving forward"}]}
