{"paperId": "c1cd6f7863495f2d923aa3c67c3aaff2aa353148", "publicationVenue": {"id": "bc8ed6df-d796-4db9-8dd4-85b1f0b5471e", "name": "International Journal of Intelligent Computing and Information Sciences", "type": "journal", "alternate_names": ["Int J Intell Comput Inf Sci"], "issn": "1687-109X", "url": "https://ijicis.journals.ekb.eg/?load_cover=cover_en.jpg"}, "title": "ENHANCED REGRESSION TESTING EXECUTION PROCESS USING TEST SUITE REDUCTION TECHNIQUES AND PARALLEL EXECUTION", "abstract": ": Regression testing is a vital category of software testing. Regression testing is done to make sure that the changed code does not have any unexpected negative effects on the software. Regression testing, despite its significance in ensuring software quality, can be a costly phase in the software testing process. Typically, the more tests there are, the longer it takes for them to run. As a result, the price of regression testing rises with the quantity of tests. So, the objective is to reduce the execution time of the regression testing by removing test cases that are redundant or have lower importance in terms of their capacity to uncover faults. The primary aim of test case reduction is to decrease the number of test cases, which, in turn, lowers the time and expenses associated with their execution. This paper presents an approach to minimize the execution time of regression testing while preserving code coverage, achieved through the utilization of test suite reduction techniques and parallel automation execution. The employed test suite reduction approach involves utilizing a clustering technique and a genetic algorithm. The resulting reduced test suite is then executed in parallel to achieve the shortest possible execution time. The results demonstrate that the proposed approach can cut down execution time by 75%.", "venue": "International Journal of Intelligent Computing and Information Sciences", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-01", "journal": {"name": "International Journal of Intelligent Computing and Information Sciences"}, "authors": [{"authorId": "2162890910", "name": "Sarah M. Nagy"}, {"authorId": "2166021176", "name": "Huda Amin"}, {"authorId": "2258448184", "name": "N. Badr"}], "citations": []}
