{"paperId": "c1d50f7e258bdc4e258846b90bb4fbd3c4723940", "publicationVenue": {"id": "e2d4daf5-df00-4097-bf22-91709312868a", "name": "Anais da Academia Brasileira de Ciências", "type": "journal", "alternate_names": ["Anais Da Academia Brasileira De Ciencias", "An Acad Bras Ciências", "An Acad Bras Cienc"], "issn": "0001-3765", "url": "https://www.scielo.br/revistas/aabc/iaboutj.htm", "alternate_urls": ["https://www.scielo.br/scielo.php?pid=0001-3765&script=sci_serial", "https://www.scielo.br/scielo.php/script_sci_serial/pid_0001-3765/lng_en/nrm_iso", "https://www.scielo.br/scielo.php?lng=en&nrm=iso&pid=0001-3765&script=sci_serial", "https://www.scielo.br/scielo.php?lng=en&pid=0001-3765&script=sci_serial"]}, "title": "Spatial and Seasonal Assessment of Water Quality in the Lobo Stream River Basin, Brazil Using Multivariate Statistical Techniques.", "abstract": "In view of the complexity of the processes associated to water quality, this study objective is to identify the main factors related to spatial and seasonal variability in water courses of the Lobo Stream River Basin. To this, multivariate statistical techniques were used. Data collection for water quality and streamflow variables were carried out monthly, from May 2018 to April 2019, at 10 monitoring points along basin's tributaries. The results show that, during the dry season, the main causes for water quality decrease are related to erosion process on the river margins, which is intensified by inadequate handling in livestock activities in some monitoring points. In the rainy season, the main causes are related to soil leaching in agricultural areas that increases the nitrogen compounds concentration and reduces water quality. However, in addition to this, it was noted that regardless the environmental conditions, the most impactful factor is the point pollution from the effluent discharge of Itirapina City sewage treatment plant, responsible for nutrient concentration increase, organic contamination, OD reduction, and, consequently, water quality deterioration. With this, the study shows how multivariate statistical analysis enables more relevant evaluation of water quality data variability and supports further studies in the basin.", "venue": "Anais da Academia Brasileira de Ciências", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "Anais da Academia Brasileira de Ciencias", "pages": "\n          e20210072\n        ", "volume": "93 suppl 4"}, "authors": [{"authorId": "2065863896", "name": "G. L. Neves"}, {"authorId": "35566480", "name": "T. T. Guimarães"}, {"authorId": "118287937", "name": "P. Anjinho"}, {"authorId": "152481184", "name": "M. A. Barbosa"}, {"authorId": "91210870", "name": "A. R. Santos"}, {"authorId": "2125997744", "name": "J. V. Virgens Filho"}, {"authorId": "21586908", "name": "F. F. Mauad"}], "citations": [{"paperId": "0eff527aee44728da3ba49688e8082cf035c6ee6", "title": "Assessment of Water Ecosystem Integrity (WEI) in a Transitional Brazilian Cerrado–Atlantic Forest Interface"}]}
