{"paperId": "c1d89d86e66f5463cda204364fd736358bf4d737", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Optimization of Network-Based Caching and Forwarding Using Mobile Edge Computing", "abstract": "The rapid growth of mobile network traffic has brought great pressure and challenge to the current mobile network, and the backhaul network pressure is huge. The surge in mobile network traffic makes the mobile backhaul link under pressure and the bandwidth resources are very tight. The content is transmitted repeatedly which can increase the load of network resources. The current mobile network also adopts the end-to-end transmission mechanism, which makes a large number of popular content repeated transmission. The network delay is large, and the user experience is not so good. Thus, this study proposes to use mobile edge computing to solve this issue. To this issue, the deployment of computing and caching resources using mobile edge computing has become the focus of academic and industry attention. This technology can provide users the access to the nearest network and business services. In order to avoid network congestion and load balancing, the joint optimization of data caching and request forwarding is considered, and the random optimization model is used to limit network stability to minimize average transmission cost. This study also proposed an optimization technology to largely improve the performance of network. Using Liapunov optimization technology, the joint optimization problem is changed to linear planning problems, and the design of real-time caching and forwarding online algorithms. The results of the simulation experiment show that the algorithm can realize congestion avoidance and load balancing with reducing transmission cost.", "venue": "IEEE Access", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "181855-181866", "volume": "7"}, "authors": [{"authorId": "120809818", "name": "Jianwei Liu"}, {"authorId": "2113917453", "name": "Chuan Shi"}], "citations": [{"paperId": "559f7ceb0a9f3b2dd5c3bede12a4473e1132156d", "title": "Flow control oriented forwarding and caching in cache-enabled networks"}, {"paperId": "96316f7c859301f8bfc242b6a99c6cabb7e6dcf2", "title": "A Computation Offloading Mechanism Based on Sharable Cache in Smart Community"}, {"paperId": "9ebdfda176d9754d2c368b000fa95fbf7c60c3c8", "title": "Resource Allocation Strategy of Edge Systems Based on Task Priority and an Optimal Integer Linear Programming Algorithm"}]}
