{"paperId": "c1e597605dab462ac09320af9038ae94379e85ae", "publicationVenue": {"id": "501c1070-b5d2-4ff0-ad6f-8769a0a1e13f", "name": "Wireless Communications and Mobile Computing", "type": "journal", "alternate_names": ["Wirel Commun Mob Comput"], "issn": "1530-8669", "url": "https://www.hindawi.com/journals/wcmc/", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/15308677", "http://www.interscience.wiley.com/jpages/1530-8669/"]}, "title": "Research on the Method of Predicting Consumer Financial Loan Default Based on the Big Data Model", "abstract": "With the continuous advancement of Internet technology and the continuous development of big data model applications, the data model is a method of data organization and storage, which emphasizes the reasonable storage of data from the perspective of business, data access, and use. The rapid development of information technology on the Internet and the increasing consumption level of people have created conditions for the booming development of consumer finance. Compared with traditional lending methods, more and more consumers are more inclined to choose consumption channels such as the Internet and e-commerce. Consumer finance lending is more convenient and fast. The prediction of consumer financial loan default is very important, because the inaccuracy of the prediction not only leads to the loss of profits but also infringes the rights and interests of consumers. Therefore, it is very important to propose a default prediction method in the consumer finance field with good performance based on the big data model. Simulation experiment conclusions are shown as follows: (1) the pseudo \n \n R\n \n -squared value of the model is 0.3660, indicating that the control variable can better explain the change of \n \n y\n \n . (2) The chi-square test statistic is equal to 51632.31, the degree of freedom is 68, and the corresponding \n \n P\n <\n 0.0001\n \n , which also shows that the entire model can significantly predict the change of \n \n y\n \n . (3) The regression coefficient of the number of loan performances is -0.207553, indicating that the number of consumer loans is negatively correlated with loan defaults. (4) The regression coefficient of the monthly loan frequency is 0.0500152, indicating that the customer applies the frequency of personal credit consumer loans which is positively correlated with loan defaults. (5) The accurate prediction ratio of the model is 86.11%, which further shows that the prediction model has a better effect.", "venue": "Wireless Communications and Mobile Computing", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-03-24", "journal": {"name": "Wireless Communications and Mobile Computing"}, "authors": [{"authorId": "2116274080", "name": "Qiuying Wang"}], "citations": []}
