{"paperId": "c1e87b86aba714b2a9d5e0e9d60a4e18fce73421", "publicationVenue": {"id": "501c1070-b5d2-4ff0-ad6f-8769a0a1e13f", "name": "Wireless Communications and Mobile Computing", "type": "journal", "alternate_names": ["Wirel Commun Mob Comput"], "issn": "1530-8669", "url": "https://www.hindawi.com/journals/wcmc/", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/15308677", "http://www.interscience.wiley.com/jpages/1530-8669/"]}, "title": "Random Forest Bagging and X-Means Clustered Antipattern Detection from SQL Query Log for Accessing Secure Mobile Data", "abstract": "In the current ongoing crisis, people mostly rely on mobile phones for all the activities, but query analysis and mobile data security are major issues. Several research works have been made on efficient detection of antipatterns for minimizing the complexity of query analysis. However, more focus needs to be given to the accuracy aspect. In addition, for grouping similar antipatterns, a clustering process was performed to eradicate the design errors. To address the above-said issues and further enhance the antipattern detection accuracy with minimum time and false positive rate, in this work, Random Forest Bagging X-means SQL Query Clustering (RFBXSQLQC) technique is proposed. Different patterns or queries are initially gathered from the input SQL query log, and bootstrap samples are created. Then, for each pattern, various weak clusters are constructed via X-means clustering and are utilized as the weak learner (clusters). During this process, the input patterns are categorized into different clusters. Using the Bayesian information criterion, the similarity measure is employed to evaluate the similarity between the patterns and cluster weight. Based on the similarity value, patterns are assigned to either relevant or irrelevant groups. The weak learner results are aggregated to form strong clusters, and, with the aid of voting, a majority vote is considered for designing strong clusters with minimum time. Experiments are conducted to evaluate the performance of the RFBXSQLQC technique using the IIT Bombay dataset using the metrics like antipattern detection accuracy, time complexity, false-positive rate, and computational overhead with respect to the differing number of queries. The results revealed that the RFBXSQLQC technique outperforms the existing algorithms by 19% with pattern detection accuracy, 34% minimized time complexity, 64% false-positive rate, and 31% in terms of computational overhead.", "venue": "Wireless Communications and Mobile Computing", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-11-24", "journal": {"name": "Wireless Communications and Mobile Computing"}, "authors": [{"authorId": "103436017", "name": "Rajesh Kumar Dhanaraj"}, {"authorId": "2004355400", "name": "Vinothsaravanan Ramakrishnan"}, {"authorId": "2883936", "name": "M. Poongodi"}, {"authorId": "46341978", "name": "Lalitha Krishnasamy"}, {"authorId": "153521546", "name": "Mounir Hamdi"}, {"authorId": "1794896", "name": "K. Kotecha"}, {"authorId": "2066325976", "name": "V. Vijayakumar"}], "citations": [{"paperId": "3d90a089e73f46e42120334251fffd50525df584", "title": "An optimized MCHVD approach to curtail handover failures in wireless networks"}, {"paperId": "83e427da2b73b36fac3844a3efdf04fbe6383c76", "title": "Digital Twin Based Learning Framework for Adaptive Fault Diagnosis In Microgrids with Autonomous Reconfiguration Capabilities"}, {"paperId": "1a9aa478dfc7aea71295cfaa40af944f78f9e8ae", "title": "Detection of Vulnerability in Websites Predominantly Against CSRF Using Machine Learning"}, {"paperId": "0a70c6309f2c8ef70f4df2646f2438baa779fbcd", "title": "Identification of varieties of sorghum based on a competitive adaptive reweighted sampling-random forest process"}, {"paperId": "e92a58d0f5a8f3d5e7783234992e8a3bc84a8c20", "title": "Improving the Estimation of Coronary Artery Disease by Classification Machine Learning Algorithm"}, {"paperId": "117d79e192988b6e27898fbf6cc0f3a619e26dc7", "title": "Research on the Application of Automation Control Technology in Enterprise Safety Production"}, {"paperId": "6f6409d0070b7efbe74f0f1a9b72c1a0a0456c44", "title": "Investigating the Multifaceted Applications of Nanotechnology in Wireless Sensor Networks for Environmental Monitoring: Advancing Monitoring Capabilities for a Sustainable Future"}, {"paperId": "4ae94044d69fcc775daf031e019af1998d775a46", "title": "Model Testing and Validation of Factors Affecting Wellbeing of Retail Salesforce: Harnessing Machine Learning for Wireless Channel Prediction in Retail Environments"}, {"paperId": "386898478e881c3f56bcab645b4dd9d600609e2e", "title": "Advancements in Human-Machine Interaction: Exploring Natural Language Processing and Gesture Recognition for Intuitive User Interfaces"}, {"paperId": "b1a0d5b4d711f96a9fc2b29ac63b5807b3587cd0", "title": "TSM: A Cloud Computing Task Scheduling Model"}, {"paperId": "d5d66e6f5813e837a797d0f7c6c636d2afddb789", "title": "An Enhanced Data-Driven Weather Forecasting using Deep Learning Model"}, {"paperId": "f0850735d0c070388d6e944dce81738cca51e366", "title": "E Purchasing Application to Improve Company Performance"}, {"paperId": "875c0dcb8b4c43571cb228d9ad447b2862df5329", "title": "Implementation of IOT on English Language Classroom Management"}, {"paperId": "a7b687cb090e8d1d6bf5b0f03ee8238f82f355fc", "title": "Recent Modelling of the Ownership Structures and It’s Role in Corporate Performance of Company"}, {"paperId": "6c2132a6ec692c3d7c89a5d253d03d5ae8c3590f", "title": "Blockchain Applications Beyond Cryptocurrency: a Focus on Decentralized Markets and Contract Management"}, {"paperId": "30a26cbac61bd899207b823bed25c11aae7dedb2", "title": "Exploring The Use of Blockchain Technology in Cybersecurity and Data Science"}, {"paperId": "5d053eb4a2451fb321d6c0694879f4712abad030", "title": "HYBRIDROID: Using Hierarchical Machine Learning Algorithms to Spot Malicious Applications on Linux-Powered Smart phones: Deep Survey"}, {"paperId": "74a538de608d1da25f5af4bf633239b9e2c1e258", "title": "Implementation of Soft Computing Techniques in Fine-Tuning of TRM-Concrete Bond Strength Models"}, {"paperId": "01dbcda10d143d3504b8d0f6d4d10525aa237fd0", "title": "A novel capsule network based on deep routing and residual learning"}, {"paperId": "5c39f9786d5f4f3dd57fffe522e94aae921a1710", "title": "Fuzzy approach and possibility to solve uncertainty weaknesses in conventional quantitative risk assessment"}, {"paperId": "9b7307508f644156fb7f936df96f8cfe2742a7a8", "title": "Determine the Undervalued US Major League Baseball Players with Machine Learning"}, {"paperId": "9da085bc7ebc430bb489425f1b571de6da3ce088", "title": "Secure Credit or Debit Card Transaction Using Alert messages and OTP to prevent phishing attacks"}, {"paperId": "0d4eed4bf6d154b69171ac5d94815ff7f91f21d8", "title": "Hydroponics Soilless Smart Farming in Improving Productivity of Crop Using Intelligent Smart Systems"}, {"paperId": "4d07fb4b6953af4a5c088c28019ac9fb401a6edd", "title": "A Heuristic Machine Learning-Based Optimization Technique to Predict Lung Cancer Patient Survival"}, {"paperId": "d5c80a60a75e2f421ebca20a4ec80bbc437d8dfe", "title": "A Deep Learning Model For Intelligent Energy Management"}, {"paperId": "e68a20a6aa4233e8087d2aee43e62fabce5e28ac", "title": "Detection of diabetic Retinopathy using Retinal Fundus Images"}, {"paperId": "6903fc504df62e5a78385eaa8f7c01e6aa290a4b", "title": "Employing Deep Learning Algorithm to Identify Diabetic Retinopathy"}, {"paperId": "7d16da5c2c379f931a25cf938de268e076dbe275", "title": "INTRUTION DETECTION SYSTEM USING 6G WITH INTERNET OF THING AND AUMANN AGREEMENT THEOREM"}, {"paperId": "305e8f20fd69421ca08e0e136bf67bc14b5f4adc", "title": "Intelligent Trust Based Electrical Vehicles Using 6G"}, {"paperId": "680f4169708e4289b3f4517eadd083fbabdc3fcd", "title": "Intelligent Trust based e-learning based IDS system and VANET in 6G"}, {"paperId": "8cfcdb50c26ea5cc55f57093c08c0261845432d2", "title": "MACHINE LEARNING BASED HEALTHCARE MONITORING USING 6G TECHNOLOGY"}, {"paperId": "6d3bd7c0cf6789cf1086c000b805a9d877385d62", "title": "Blockchain-Based Internet of Things Security and Reliability via SDN-Enabled 5G-VANETs"}, {"paperId": "37abd7ce34bca121b7086a0695f9d44401f6dbc3", "title": "Privacy-Preserving in FinTech using Deep Learning with Federated Learning in Cryptocurrency"}, {"paperId": "ec1c661f141f0e741b9ed08c55806855c46e413d", "title": "IoT BASED SECURED HEALTHCARE USING 6G TECHNOLOGY AND DEEP LEARNING TECHNIQUES"}, {"paperId": "eaf31171a57968aecccd3628d4b0ed5d07dd6119", "title": "OPTIMIZATION OF E-LEARNING AND PERFORMANCE USING IOT AND 6G TECHNOLOGY"}, {"paperId": "8dc071598d87f44d06be920ee97049af2d851ca5", "title": "Students’ intention on post COVID19 continuance of e-learning"}, {"paperId": "9d87e171480ee4d85e3084be73fcbf21b7796c48", "title": "An Efficient Approach for Object Detection using Deep Learning"}, {"paperId": "c7f76accf35e05ece5be47743439795ca930b3a3", "title": "Enhanced Machine learning algorithms Lightweight Ensemble Classification of Normal versus Leukemic Cel"}, {"paperId": "70b512c5659657abc1e59f2b623846fa017dc2d6", "title": "Machine Learning Based Industrial Engineering With 6G Technology"}, {"paperId": "237d0688f380ecea0ba987a435d46246ddbf3704", "title": "An Efficient Multispectral Image Classification and Optimization Using Remote Sensing Data"}, {"paperId": "4e9c57ade240890c23eb94bc6cfdadb1b9015c41", "title": "A novel trust-based security and privacy model for Internet of Vehicles using encryption and steganography"}, {"paperId": "f70bfa7a60e9fcb4e3b59c69c4560b4382bc0145", "title": "Automated False Positive Filtering for esNetwork Alerts"}, {"paperId": "37b60cade8cb2a195237ae350f0c5b2110e3f01c", "title": "Deep Learning Ensemble Model for the Prediction of Traffic Accidents Using Social Media Data"}, {"paperId": "94369c852fdb806f420b03b2607646befceb3c9b", "title": "Back-propagation extreme learning machine"}, {"paperId": "ea820362dd4deba4a2456798b3fa38d819a658b6", "title": "Machine Learning For Detecting Twitter Bot"}, {"paperId": "07ba49f70bec0a91e7f63354f67046f363d12136", "title": "FPGA-Based Deep Learning Models for Analysing Corona Using Chest X-Ray Images"}, {"paperId": "46fce67de93a3ebb2d84a53dafd1b8bb726a7e18", "title": "Psychometric properties of the research attitude index (IAI) in a population of Peruvian university students"}, {"paperId": "3d55203745a9a472f9166af807231873c7f06e08", "title": "Bibliometric analysis of the world scientific production on emotional intelligence (2000-2021)"}, {"paperId": "52bb99db2b5a32474d84293c5842b53e9db76fa3", "title": "Social Network Analysis for Precise Friend Suggestion for Twitter by Associating Multiple Networks Using ML"}, {"paperId": "722ed64bbcd2c66c4a7f2e869b20ad31679634e0", "title": "Autonomous Transaction Model for E-Commerce Management Using Blockchain Technology"}, {"paperId": "f41cba1a4418d64d3271584124fdc3d3531a9a12", "title": "Social Network User Profiling With Multilayer Semantic Modeling Using Ego Network"}, {"paperId": "05a506d86e7a625a839dabcd05cd3434e62e10e6", "title": "Environmental Management In Times Of Pandemic. A Bibliometric Study"}, {"paperId": "7b452d6326b982087f6ea76ae92b06cb84c3a062", "title": "Infographics In The Literacy Of Statistical Skills In University Students"}, {"paperId": "8aa3851a1a18be38105bb6aa3217ea8d36738468", "title": "Formative Evaluation From The Perspective Of The University Student In Times Of Pandemic"}, {"paperId": "8057162daf5f1f520edf58430b0098946ff754cb", "title": "Gamification As A Methodological Strategy In University Students"}, {"paperId": "4e907056e17abd6c3c9c0b54007a552a6657812e", "title": "Socio-Emotional Skills For The Reduction Of Social Anxiety In University Students"}, {"paperId": "bd36eec286d9b078c8aab60ad574d52b4c4dd236", "title": "Scientific Initiation In University Training Research"}, {"paperId": "a3357af2b558971a07861c91df892823b6c22c0b", "title": "The New Normal In Virtual Education: A View From Teaching Practice"}, {"paperId": "4ca9e843bf507c26a9736a06841e87cdcc48ae4f", "title": "Curriculum Alignment To Ensure The Achievement Of The Teacher's Graduation Profile"}, {"paperId": "e52d5be83a05ba150c700750e9c0647761cd0c6d", "title": "Social Networks In The Emotions Of Schoolchildren During The Covid 19 Pandemic"}, {"paperId": "bfee844231a2267bc8500254deef144f96c7a83b", "title": "Competency-Based Curriculum Planning Model To Overcome Inconsistencies In Vocational Training"}, {"paperId": "85b695127a565f72cfc20c5c607d92a65443c086", "title": "Deep Learning Based Face Mask Detection System in OpenCV"}, {"paperId": "387677aeae4839afb2ad50feade8f36bb203feb2", "title": "Wechat Discontinuation Intention Analysis: How Fatigue Acts as a Moderator between Information Irrelevance, Information Overload, and Communication Overload"}]}
