{"paperId": "c1ef86ec7777e99076d66d0351fd3db272715db5", "publicationVenue": {"id": "62205462-9b0c-4d6b-97ad-6352d9d7a2c7", "name": "Journal of Corporate Finance", "type": "journal", "alternate_names": ["J Corp Finance"], "issn": "0929-1199", "url": "http://www.elsevier.com/wps/find/journaldescription.cws_home/524467/description#description", "alternate_urls": ["http://www.sciencedirect.com/science/journal/09291199", "https://www.journals.elsevier.com/journal-of-corporate-finance"]}, "title": "Limitations of Imitation: Lessons from another Bitcoin Copycat", "abstract": "We find strong evidence that imitation to the leader in an uncertain environment provides short-term early success without enhancing long-term survival. Using a unique setting in cryptocurrencies where Bitcoin has been the centre focus, we define copycats as cryptocurrencies that have a name similar to Bitcoin. Our results show copycats earn higher returns in the first four weeks of trading but have a lower survival rate comparing to non-copycats and are robust to an alternative definition of copycat and an instrumental variable. Our results highlight that in an age of information, coupled with an uncertain market created by a novel technology, the name of an organization may be a strong a signal to investors when other signals are unclear.", "venue": "Journal of Corporate Finance", "year": 2020, "fieldsOfStudy": ["Economics"], "publicationTypes": null, "publicationDate": "2020-02-04", "journal": {"name": "ERPN: Imitation & Innovation (Sub-Topic)"}, "authors": [{"authorId": "121907692", "name": "Daniel Cahill"}, {"authorId": "79305860", "name": "Z. Liu"}], "citations": [{"paperId": "715542a364d61f18b0451a9c9d85754ec7b31699", "title": "The power of a name: Exploring the relationship between ICO name fluency and investor decision making"}, {"paperId": "4b554d1dbd4bb788ed1b259adf6d3238ea66958a", "title": "Do crypto investors wait and see during policy uncertainty? An examination of the dynamic relationships between policy uncertainty and exchange inflows of Bitcoin"}, {"paperId": "1bdcdaa8a70469d0577961bbd20902d386e33d10", "title": "Blockchain in Banking and Finance: is the best yet to come? A bibliometric review"}]}
