{"paperId": "c1fa2708bc5fe04825485d5f93c4bf7e45d1d1fd", "publicationVenue": {"id": "eac74c9c-a5c0-417d-8088-8164a6a8bfb3", "name": "IEEE journal of biomedical and health informatics", "type": "journal", "alternate_names": ["IEEE Journal of Biomedical and Health Informatics", "IEEE j biomed health informatics", "IEEE J Biomed Health Informatics"], "issn": "2168-2194", "url": "https://ieeexplore.ieee.org/xpl/aboutJournal.jsp?punumber=6221020", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6221020"]}, "title": "Handling Privacy-Sensitive Medical Data With Federated Learning: Challenges and Future Directions", "abstract": "Recent medical applications are largely dominated by the application of Machine Learning (ML) models to assist expert decisions, leading to disruptive innovations in radiology, pathology, genomics, and hence modern healthcare systems in general. Despite the profitable usage of AI-based algorithms, these data-driven methods are facing issues such as the scarcity and privacy of user data, as well as the difficulty of institutions exchanging medical information. With insufficient data, ML is prevented from reaching its full potential, which is only possible if the database consists of the full spectrum of possible anatomies, pathologies, and input data types. To solve these issues, Federated Learning (FL) appeared as a valuable approach in the medical field, allowing patient data to stay where it is generated. Since an FL setting allows many clients to collaboratively train a model while keeping training data decentralized, it can protect privacy-sensitive medical data. However, FL is still unable to deliver all its promises and meets the more stringent requirements (e.g., latency, security) of a healthcare system based on multiple Internet of Medical Things (IoMT). For example, although no data are shared among the participants by definition in FL systems, some security risks are still present and can be considered as vulnerabilities from multiple aspects. This paper sheds light upon the emerging deployment of FL, provides a broad overview of current approaches and existing challenges, and outlines several directions of future work that are relevant to solving existing problems in federated healthcare, with a particular focus on security and privacy issues.", "venue": "IEEE journal of biomedical and health informatics", "year": 2022, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-06-23", "journal": {"name": "IEEE Journal of Biomedical and Health Informatics", "pages": "790-803", "volume": "27"}, "authors": [{"authorId": "90972540", "name": "Ons Aouedi"}, {"authorId": "152212777", "name": "Alessio Sacco"}, {"authorId": "1709531", "name": "Kandaraj Piamrat"}, {"authorId": "31890678", "name": "G. Marchetto"}], "citations": [{"paperId": "222822fe90449ae572475127bd15ebae16fb4ff1", "title": "FedCSCD-GAN: A secure and collaborative framework for clinical cancer diagnosis via optimized federated learning and GAN"}, {"paperId": "53ca5811b6f943d06565728e6d6918be7a68d321", "title": "Energy-Efficient De-Duplication Mechanism for Healthcare Data Aggregation in IoT"}, {"paperId": "dbe3e447f4b49f58ddc35170aba66d1d15a50601", "title": "Data privacy model using blockchain reinforcement federated learning approach for scalable internet of medical things"}, {"paperId": "92959ad9a653b52fd7aab10fab51d87a074db77a", "title": "Federated Learning in Real-Time Medical IoT: Optimizing Privacy and Accuracy for Chronic Disease Monitoring"}, {"paperId": "b0d3b2135dcb3b87935ae689e024a1893c7daff6", "title": "Federated Distillation and Blockchain Empowered Secure Knowledge Sharing for Internet of Medical Things"}, {"paperId": "4d9f6de723057b8996528e41d241d12bdfce8634", "title": "Federated Learning in Prediction of Dementia Stage: An Experimental Study"}, {"paperId": "a9cfe368b83a64ff31ca00f2624ca25f5f471419", "title": "Medical Imaging Applications of Federated Learning"}, {"paperId": "b545c5922114bbca666e25b8b6b26ba510f7997b", "title": "Federated Learning for Medical Image Analysis: A Survey"}, {"paperId": "86a5f4d0f5eab80f09f3f4578b60a592c434161b", "title": "Perspectives of Patients With Chronic Diseases on Future Acceptance of AI–Based Home Care Systems: Cross-Sectional Web-Based Survey Study"}, {"paperId": "552fbc7c88b5aec9be66ba1fbbd13e6b9308104e", "title": "Cardiovascular Health Management Compliance with Health Insurance Portability and Accountability Act"}, {"paperId": "a0267655c2384f7684f024422d37b17d472bc8db", "title": "Federated Semi-Supervised Learning for Medical Image Segmentation via Pseudo-Label Denoising"}, {"paperId": "0da8306f0584e882c3ae1e9ede9475c03eafb2ff", "title": "Artificial intelligence for clinical decision support for monitoring patients in cardiovascular ICUs: A systematic review"}, {"paperId": "d135ec27b06266dcc013431a7778fc37e5e79f70", "title": "Privacy-Enhancing Technologies in Federated Learning for the Internet of Healthcare Things: A Survey"}, {"paperId": "833600e1f660615be2cce8d567a70ae1bbbe6282", "title": "Federated Learning in Health care Using Structured Medical Data."}, {"paperId": "2aad70522f8a9b96ae79a50ab8f91a19b331506c", "title": "Applications and Challenges of Federated Learning Paradigm in the Big Data Era with Special Emphasis on COVID-19"}, {"paperId": "72a860651eb23aa4f4328d06aa323fe2eb1e3e1a", "title": "P4FL: An Architecture for Federating Learning With In-Network Processing"}, {"paperId": "1cebaaa6bdd68bb65d48f28125f82efb64f46051", "title": "Residential Load Forecasting Using Modified Federated Learning Algorithm"}, {"paperId": "30e9aa8bcaa9ebf9748cd509c5bcb647142ee9f9", "title": "Quantum-Empowered Federated Learning and 6G Wireless Networks for IoT Security: Concept, Challenges and Future Directions"}]}
