{"paperId": "c205df1b475a24456b0928899c88d9b83bc5d4c4", "publicationVenue": {"id": "7a4a2cd2-0615-44b1-83c3-d07ad89415b4", "name": "Journal of Crohn's & Colitis", "type": "journal", "alternate_names": ["Journal of Crohn's and Colitis", "J Crohn's  Colitis", "Journal of Crohns & Colitis", "J Crohn's Colitis", "J Crohn  Colitis"], "issn": "1873-9946", "alternate_issns": ["1197-4982"], "url": "http://www.ecco-jccjournal.org/aims", "alternate_urls": ["http://www.ecco-jccjournal.org/"]}, "title": "Efficacy and Safety of Maintenance Ustekinumab for Ulcerative Colitis Through 3 Years: UNIFI Long-term Extension", "abstract": "Abstract Background and Aims The UNIFI long-term extension [LTE] study reports the efficacy and safety of subcutaneous 90 mg ustekinumab through 3 years of maintenance therapy. Methods Patients randomised to ustekinumab every 12 weeks [q12w] or every 8 weeks [q8w] at maintenance baseline [N = 348] and randomised ustekinumab-treated patients in the LTE [N = 284] were evaluated. Symptomatic remission [Mayo stool frequency = 0/1, rectal bleeding = 0] was assessed. Safety included all LTE patients [N = 188 placebo and N = 457 ustekinumab]. Results Among patients randomised to the ustekinumab q12w and q8w groups at maintenance baseline, 54.1% and 56.3% achieved symptomatic remission at Week 152, respectively. Overall, 20% of patients discontinued ustekinumab, 10% of biologic-naïve and 30% of biologic-exposed patients. Among patients in symptomatic remission at Year 3, 94.6% and 98.0% of patients were also corticosteroid free, respectively. Corticosteroid-free symptomatic remission rates in the ustekinumab q12w and q8w groups were 51.2% and 55.1% at Week 152, respectively. Remission rates were higher for biologic-naïve patients than for those with a history of biologic failure. Biochemical evidence of response was demonstrated by stable, decreased C-reactive protein and faecal calprotectin measurements over 3 years. From Weeks 96 to 156, no deaths, major adverse cardiovascular events, or tuberculosis occurred. Nasopharyngitis, ulcerative colitis, and upper respiratory tract infection were most frequently reported. One ustekinumab-treated patient with a history of basal cell carcinoma [BCC] reported two BCCs. One patient in the q8w ustekinumab group, who was receiving concomitant 6-mercaptopurine, experienced serious adverse events of neutropenic sepsis and oral herpes. Conclusions Efficacy of ustekinumab in patients with ulcerative colitis was confirmed through 3 years. No new safety signals were observed.", "venue": "Journal of Crohn's & Colitis", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-03-03", "journal": {"name": "Journal of Crohn's & Colitis", "pages": "1222 - 1234", "volume": "16"}, "authors": [{"authorId": "40192843", "name": "M. Abreu"}, {"authorId": "153860349", "name": "D. Rowbotham"}, {"authorId": "2379943", "name": "S. Danese"}, {"authorId": "4349130", "name": "W. Sandborn"}, {"authorId": "2565706", "name": "Y. Miao"}, {"authorId": "49724041", "name": "Hongyan Zhang"}, {"authorId": "120910956", "name": "Ilia Tikhonov"}, {"authorId": "6591814", "name": "R. Panaccione"}, {"authorId": "4051791", "name": "T. Hisamatsu"}, {"authorId": "5317126", "name": "E. Scherl"}, {"authorId": "152406781", "name": "R. Leong"}, {"authorId": "5654443", "name": "R. Arasaradnam"}, {"authorId": "152387502", "name": "W. Afif"}, {"authorId": "1387474555", "name": "L. Peyrin-Biroulet"}, {"authorId": "2517321", "name": "B. Sands"}, {"authorId": "144679389", "name": "C. Marano"}], "citations": [{"paperId": "6dba9589fcbe4b39cabe0af4e826a23b87946f56", "title": "Progress in understanding of relationship between use of biological agents and risk of malignant tumors in patients with inflammatory bowel disease"}, {"paperId": "b015b05926acaaed95f430e4099e36f2e98c0229", "title": "Real-World Effectiveness of Ustekinumab in Ulcerative Colitis in a United States Multicenter Cohort Consortium."}, {"paperId": "098d5439981395d32330b04d14ae7149c531e2d6", "title": "Biologics, Small Molecules and More in Inflammatory Bowel Disease: The Present and the Future"}, {"paperId": "564293c68c1c7df305bc9f98a1560a8d47ed5e86", "title": "Risk of Infection in Patients With Inflammatory Bowel Disease Treated With Interleukin-Targeting Agents: A Systematic Review and Meta-Analysis."}, {"paperId": "e594ad6a48286d56f15ff6317ce20828cd3f051e", "title": "Ustekinumab in the Treatment of Inflammatory Bowel Diseases: Evolving Paradigms"}, {"paperId": "2e21ae468a15db835d36bfc94c3a57290374eef9", "title": "Research progress of Ustekinumab in the treatment of inflammatory bowel disease"}, {"paperId": "ef1b03c4775b3701315301217765abff24b3d899", "title": "Comparative effectiveness and safety of ustekinumab at different intervals of maintenance phase in inflammatory bowel disease: a systematic review and meta-analysis."}, {"paperId": "0b13c94666e5716a9446a878ba1179493eeb499d", "title": "Incidence and Course of Joint Inflammation Associated with Inflammatory Bowel Disease in Patients Undergoing Treatment with Vedolizumab/Ustekinumab: The VEDUSTAR Study"}, {"paperId": "8fc2416ab4784c01a7532e132503e638d7c422f9", "title": "Selection Strategy of Second-Line Biologic Therapies in Adult Patients with Ulcerative Colitis Following Prior Biologic Treatment Failure: Systematic Review and Meta-Analysis."}, {"paperId": "8c8044def47858d3bdd83f8d2950f25c499239e6", "title": "Ustekinumab safety and effectiveness in patients with ulcerative colitis: results from a large real-life study."}, {"paperId": "413caa606a699fef9ff0ac8f3e7ebd256af1501e", "title": "Safety and Effectiveness of Vedolizumab and Ustekinumab in Elderly Patients with Inflammatory Bowel Disease: A Real-Life Multicentric Cohort Study"}, {"paperId": "69087c0f0d17a364754f84cb80e8a1f4779253a9", "title": "Role of ustekinumab in treatment of ulcerative colitis: a narrative review."}, {"paperId": "b1f36c4566b796ff425b44472b1fd7a9d3947f7d", "title": "Use of real-world data to assess the effectiveness of ustekinumab in treating IBD patients: a retrospective linked database study in northwest London"}, {"paperId": "d8ba92c4e61f12cc6b5c0ad3e2ebb585470c5911", "title": "Real-world long-term effectiveness of ustekinumab in ulcerative colitis: results from a spanish open-label cohort."}, {"paperId": "fb16549d24bfbdec7a26448c43b959ab92f9d916", "title": "The Genetics of Inflammatory Bowel Disease"}, {"paperId": "d8c5d88a4b25012d74f3baadac7cf39833ba2ab0", "title": "Consenso colombiano de la enfermedad inflamatoria intestinal pediátrica"}, {"paperId": "0eae1c52c99db77092ec5f9b9ec503f22a5b074e", "title": "Lung Involvement in Inflammatory Bowel Diseases: Shared Pathways and Unwanted Connections"}, {"paperId": "16d9bd671577e9167892f0e00c3936ab46f83aaa", "title": "Therapeutic effects of biological treatments on AA amyloidosis associated with inflammatory bowel disease: a case report and literature review."}, {"paperId": "439732b87bb47996a16f9aafb58d3e3d06f186b2", "title": "Terapia Biológica en Pacientes con Enfermedad Inflamatoria Intestinal"}, {"paperId": "c9db4816bdb0eb2490bf3d3e148449eb4dc09501", "title": "Strategies and opportunities of micro/nano delivery systems for targeted therapy of ulcerative colitis: Focus on underlying mechanisms and future perspectives"}, {"paperId": "aad80aae3953718e19360f1b30fc649f853f95ab", "title": "Cytomegalovirus Pneumonia in Inflammatory Bowel Disease: Literature Review and Clinical Recommendations"}, {"paperId": "cb02048631a4370d58e02f985b581e5fedba628e", "title": "Efficacy and Safety of Approximately 3 Years of Continuous Ozanimod in Moderately to Severely Active Ulcerative Colitis: Interim Analysis of the True North Open-label Extension"}, {"paperId": "81dccece58d4d2493506e033197622fce292bb0c", "title": "Extraintestinal Cancers in Inflammatory Bowel Disease: A Literature Review"}, {"paperId": "6c4f6bbdda638ee55025bdb3442d93f83d2d7b4a", "title": "Safety and Monitoring of Inflammatory Bowel Disease Advanced Therapies."}, {"paperId": "0aa3ba6d6b28abbc4623e2044403377b8ce70e09", "title": "Pharmacokinetic Similarity of ABP 654, an Ustekinumab Biosimilar Candidate: Results from a Randomized, Double‐blind Study in Healthy Subjects"}, {"paperId": "998c26d64e96de7dfdf2b610e718d42e4c56a6fb", "title": "Ustekinumab for treatment of refractory ulcerative colitis in an elderly patient: A case report"}, {"paperId": "6ac40eb65e83adf95f52b0aaba4ebe74dae31244", "title": "Real-World Effectiveness and Risk Factors for Discontinuation of Ustekinumab in Ulcerative Colitis"}, {"paperId": "7e431711b10ce99d57743743d4f75719e51b0aa3", "title": "Safety Summary of Pediatric Inflammatory Bowel Disease Therapies."}, {"paperId": "b1ffe759bd785ced9aade258a6e55eb1d94d9bcc", "title": "Atherosclerotic cardiovascular diseases in inflammatory bowel diseases: to the heart of the issue"}, {"paperId": "5e4187cd79aefcfcb11d434452616207f2839563", "title": "Editorial: adjuvanted recombinant zoster vaccine in adults with inflammatory bowel disease—time for universal recommendation? Authors' reply"}, {"paperId": "f56d9321568bd6c0f1b646555c5b7fbb373b1993", "title": "Exit strategies in inflammatory bowel disease: Looking beyond anti-tumor necrosis factors"}, {"paperId": "d95df344c99e31c3637dd9fc0e2caa94bbf16907", "title": "Systematic Review and Meta-analysis: The Association Between Serum Ustekinumab Trough Concentrations and Treatment Response in Inflammatory Bowel Disease."}, {"paperId": "7794868af31b88e7975cdb7e64cf80afc70d35f6", "title": "Inflammation-Driven Colorectal Cancer Associated with Colitis: From Pathogenesis to Changing Therapy"}, {"paperId": "721ea2af8e68119a59eeabde235cc1497d315fb0", "title": "Mise à jour sur le traitement médicamenteux de la colite ulcéreuse"}, {"paperId": "e7df37f9c652cbb7ac76a1acc06b83e1969ecab7", "title": "SECOND BRAZILIAN CONSENSUS ON THE MANAGEMENT OF ULCERATIVE COLITIS IN ADULTS: A CONSENSUS OF THE BRAZILIAN ORGANIZATION FOR CROHN'S DISEASE AND COLITIS (GEDIIB)."}, {"paperId": "cd0fb435e3b48ee7b2ecd89f748b8a37efa16fb7", "title": "A critical review of ustekinumab for the treatment of active ulcerative colitis in adults"}, {"paperId": "d9dc62bff95bb124c4333489a2d8649e2e4e0168", "title": "Efficacy and safety of ustekinumab in Russian bionaive patients with moderately to severely active ulcerative colitis: a subanalys is of global phase 3 induction and maintenance studies (UNIFI) up to 3 years"}, {"paperId": "cd5883fe21c1d77e8704c26fac020f90f797c4dd", "title": "Ustekinumab for steroid-refractory pancolitis in a biologically naive child: A case report and literature review"}, {"paperId": "7bb6002fe2c9dc58d71b42446b98b0d53c215388", "title": "Long-term outcomes of cyclosporin induction and ustekinumab maintenance combination therapy in patients with steroid-refractory acute severe ulcerative colitis"}, {"paperId": "d5671b9e746d349581801e8022d76add9423ab9c", "title": "The Optimal Management of Inflammatory Bowel Disease in Patients with Cancer"}, {"paperId": "e0f1c34821259688ccff43bef3837e43d9c0222d", "title": "Therapieupdate 2022: Colitis ulcerosa"}, {"paperId": "13f3767661b68d00464e4aae5aa0983628bc7f22", "title": "Update zur medikamentösen Therapie der Colitis ulcerosa"}, {"paperId": "f9498d3c4ad363a69983eec7615c1699ff85474c", "title": "Therapeutic targets for inflammatory bowel disease: proteome-wide Mendelian randomization and colocalization analyses"}, {"paperId": "107707802ecd40ac30147135963e2c6d6f79f1ef", "title": "Efficacy, Effectiveness, and Safety of Ustekinumab for the Treatment of Ulcerative Colitis: A Systematic Review"}, {"paperId": "d2a46d822397dd1dbf0adc13cd4bf12042268fd1", "title": "Therapieupdate 2022: Colitis ulcerosa"}, {"paperId": "0acc7df93f5999d40c8edd09984cb2024f7d3729", "title": "Meta‐analysis: Real‐world effectiveness and safety of ustekinumab in patients with ulcerative colitis"}]}
