{"paperId": "c20ee993395605cb644fe3d1847ffb3e19712288", "publicationVenue": null, "title": "Machine Learning techniques applied to Road Health Status Recognition through Tyre Cavity Noise Analysis", "abstract": "This paper proposes a system based on Neural Networks (NN), designed for providing an efficient, non-invasive and automated method for monitoring the health status of road pavements by using features derived from Tyre Cavity Noise (TCN) analysis. Indeed, visual inspection remains to date the most common choice for evaluating the condition of road pavements; however, this method is both labor intensive and time consuming. The system presented in this work uses a microphone placed inside the vehicle tyre that measures TCN while travelling normally, and an embedded data acquisition system based on a Raspberry Pi which feeds the NN tools to recognize and classify road deterioration. We also present a preliminary analysis of features based on temporal and spectral characteristics of TCN signals generated by tyre/road interaction and acquired on three different kind of road distresses. The results show good classification capability and, moreover, the sound pressure measured inside the tyre was correlated accelerometric data measured on-board.", "venue": "Journal of Physics: Conference Series", "year": 2022, "fieldsOfStudy": ["Physics"], "publicationTypes": ["Conference"], "publicationDate": "2022-01-01", "journal": {"name": "Journal of Physics: Conference Series", "volume": "2162"}, "authors": [{"authorId": "2128291173", "name": "Gloria Schiaffino"}, {"authorId": "2134521705", "name": "Lara Ginevra Del Pizzo"}, {"authorId": "48542531", "name": "Stefano Silvestri"}, {"authorId": "49690759", "name": "Francesco Bianco"}, {"authorId": "31529536", "name": "G. Licitra"}, {"authorId": "2359690", "name": "F. Praticò"}], "citations": [{"paperId": "1b77f278bf96e755580d85fa6d6dbf7ad0d9f4af", "title": "TOWARDS A WIRELESS SENSING INFRASTRUCTURE FOR SMART MOBILITY"}, {"paperId": "7e036a162cd947c605dffd7c3a3c10d09608e684", "title": "Flexible and Stone Pavements Distress Detection and Measurement by Deep Learning and Low-Cost Detection Devices"}]}
