{"paperId": "c20f94189075b4121c739e8ad81ce70794e005e9", "publicationVenue": null, "title": "Learning-based framework for sensor fault-tolerant building HVAC control with model-assisted learning", "abstract": "As people spend up to 87% of their time indoors, intelligent Heating, Ventilation, and Air Conditioning (HVAC) systems in buildings are essential for maintaining occupant comfort and reducing energy consumption. These HVAC systems in smart buildings rely 'on real-time sensor readings, which in practice often suffer from various faults and could also be vulnerable to malicious attacks. Such faulty sensor inputs may lead to the violation of indoor environment requirements (e.g., temperature, humidity, etc.) and the increase of energy consumption. While many model-based approaches have been proposed in the literature for building HVAC control, it is costly to develop accurate physical models for ensuring their performance and even more challenging to address the impact of sensor faults. In this work, we present a novel learning-based framework for sensor fault-tolerant HVAC control, which includes three deep learning based components for 1) generating temperature proposals with the consideration of possible sensor faults, 2) selecting one of the proposals based on the assessment of their accuracy, and 3) applying reinforcement learning with the selected temperature proposal. Moreover, to address the challenge of training data insufficiency in building-related tasks, we propose a model-assisted learning method leveraging an abstract model of building physical dynamics. Through extensive experiments, we demonstrate that the proposed fault-tolerant HVAC control framework can significantly reduce building temperature violations under a variety of sensor fault patterns while maintaining energy efficiency.", "venue": "BuildSys@SenSys", "year": 2021, "fieldsOfStudy": ["Computer Science", "Engineering"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2021-06-27", "journal": {"name": "Proceedings of the 8th ACM International Conference on Systems for Energy-Efficient Buildings, Cities, and Transportation"}, "authors": [{"authorId": "3030561", "name": "Shichao Xu"}, {"authorId": "2145104748", "name": "Yangyang Fu"}, {"authorId": "2130356642", "name": "Yixuan Wang"}, {"authorId": "1403084199", "name": "Zheng O’Neill"}, {"authorId": "2152205303", "name": "Qi Zhu"}], "citations": [{"paperId": "c94eef7f55d40c984ebc1e29ac7b3a1836d97a3f", "title": "Boosting Long-Delayed Reinforcement Learning with Auxiliary Short-Delayed Task"}, {"paperId": "b74f3f88035823130d3d2f667e41486d01d4aadf", "title": "Building a Smart Campus Digital Twin: System, Analytics, and Lessons Learned From a Real-World Project"}, {"paperId": "5611fdcbcb5025cb2a66fae76b69dbf3257c7b02", "title": "Cyber resilience of power electronics-enabled power systems: A review"}, {"paperId": "b947c0469b6c40b403771f03ad4ea04c4bf0cbe6", "title": "POLAR-Express: Efficient and Precise Formal Reachability Analysis of Neural-Network Controlled Systems"}, {"paperId": "55ebeeee3885b722fd73f13cf3cb9a51e9f5cc63", "title": "Accelerate online reinforcement learning for building HVAC control with heterogeneous expert guidances"}, {"paperId": "5ef3d83463e5f622d445ad84e6a971f8c0836dd9", "title": "SQEE: A Machine Perception Approach to Sensing Quality Evaluation at the Edge by Uncertainty Quantification"}, {"paperId": "e5af57ce5809ca35863d33e90415eceb00c02070", "title": "A critical review of cyber-physical security for building automation systems"}, {"paperId": "52a220e9273dfa3c174563e6354d2a5284f6e710", "title": "Enforcing Hard Constraints with Soft Barriers: Safe Reinforcement Learning in Unknown Stochastic Environments"}, {"paperId": "aacf8ff906924babf63ed2ad7ea179dc1ac88858", "title": "Efficient Global Robustness Certification of Neural Networks via Interleaving Twin-Network Encoding"}, {"paperId": "3ecc096cb7eafbc8c06d9aecf3a2fb6e565b58fd", "title": "Containerized framework for building control performance comparisons: model predictive control vs deep reinforcement learning control"}, {"paperId": "0249280b7daf7359903ca9494753b61ed0515f1f", "title": "Weak Adaptation Learning: Addressing Cross-domain Data Insufficiency with Weak Annotator"}]}
