{"paperId": "c210d64939768f57010b7922be0eb8a9a2ee2d6d", "publicationVenue": null, "title": "An Overview of Wireless Technologies for IoT Network", "abstract": "The Internet of Things (IoT) is a concept of the modern, interconnected world. Over 50 billion devices, globally-connected, make up the largest network that is stepping towards the fourth industrial revolution, and which will significantly change the system of values and business systems. In the world of heterogeneous communication technologies, choosing the optimal one is a challenge for system architects, which is not an easy task often. The paper presents a comparative analysis of widespread communication technologies in the domain of IoT, and the conclusions presented based on the performed analysis, provide a better insight into the choice of the optimal solution depending on the problem domain and therefore better quality of solutions based on the concept of IoT.", "venue": "2020 19th International Symposium INFOTEH-JAHORINA (INFOTEH)", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2020-03-01", "journal": {"name": "2020 19th International Symposium INFOTEH-JAHORINA (INFOTEH)", "pages": "1-6"}, "authors": [{"authorId": "1641959497", "name": "Miljan Sikimić"}, {"authorId": "1641979053", "name": "Momčilo Amović"}, {"authorId": "2775983", "name": "V. Vujovic"}, {"authorId": "1642151432", "name": "Bojan Suknović"}, {"authorId": "1641959640", "name": "Dragan Manjak"}], "citations": [{"paperId": "237e3119f2fbad3a4d1b1e407e330eea5be03011", "title": "Experimental analysis for comparison of wireless transmission technologies: Wi-Fi, Bluetooth, ZigBee and LoRa for mobile multi-robot in hostile sites"}, {"paperId": "7c236ac30833c4b05f05118b29b88d0104e7333d", "title": "Dynamic autonomous set-up of relays in Bluetooth mesh"}, {"paperId": "c8465d981e0a539857d0927588f14236dc93af9d", "title": "Approach to Acoustic Drone Detection System Development"}, {"paperId": "7e8ee06c9104d10cdaa426e84aba498c150f2b69", "title": "Deep learning-based energy harvesting with intelligent deployment of RIS-assisted UAV-CFmMIMOs"}, {"paperId": "70a696c1984c00267011c2dccba6b1b3fd318581", "title": "Time-Based Performance Analysis of Narrowband Internet of Things (NB-IoT) for Particulate Matter Monitoring System"}, {"paperId": "88f445f40a7cd173990e0ed8d620f2b3d56496af", "title": "Low-Latency Federated Learning With DNN Partition in Distributed Industrial IoT Networks"}, {"paperId": "47bfc9fa7f6f29a1c6b4e080e958bf05d4b10dc5", "title": "Irradiance Acquisition in Real Time With Long Term Data Logger and Postprocessing Using Data Mining Methods"}, {"paperId": "623229c5754f1788214cc1139ee9fea1e9bd442d", "title": "An overview of IoT architectures, technologies, and existing open-source projects"}, {"paperId": "6e19c68cb1d77502c656ada875971a4ddc12ec70", "title": "Indoor Localization for the Blind Based on the Fusion of a Metaheuristic Algorithm with a Neural Network Using Energy-Efficient WSN"}, {"paperId": "1cffbad976488d2080d5fb8f652b60969927fba6", "title": "An intellectual intrusion detection system using Hybrid Hunger Games Search and Remora Optimization Algorithm for IoT wireless networks"}, {"paperId": "d16ec4d49f11ce4154cfddf7a7f0f31021f4957b", "title": "Beyond Pathogen Filtration: Possibility of Smart Masks as Wearable Devices for Personal and Group Health and Safety Management"}, {"paperId": "fff2811d6a1226e7ff3978cddaf44ad4ab2c3914", "title": "Towards a smart water city: A comprehensive review of applications, data requirements, and communication technologies for integrated management"}, {"paperId": "66980551e7e47ece0d48db6c1f5f22f257d8b2b6", "title": "Intrusion detection with deep learning on internet of things heterogeneous network"}, {"paperId": "26bfa9dc18deaa284201cec7da339a65f36a5ba6", "title": "CURE: Enabling RF Energy Harvesting Using Cell-Free Massive MIMO UAVs Assisted by RIS"}, {"paperId": "343189e36150c05641e2ea13bccc7bea99dce29a", "title": "Location-Based Explosion Detection in Wireless Optical Pressure Sensor Networks Using Bat Optimization Algorithm"}, {"paperId": "fad9fc353141c4b9b498fd24a586e708f34a1e23", "title": "Compression scenarios for Federated Learning in Smart Manufacturing"}, {"paperId": "b71095167182536024d4244950c1413e05d886f5", "title": "A Blockchain Application Prototype for the Internet of Things"}, {"paperId": "57e400dc493a1388e7bc3a3684c47de81c1863e1", "title": "Proposing an Architecture for IoT Based on WSN"}]}
