{"paperId": "c21c8aeae6c6d77ab84edf141435c85aed69b8bd", "publicationVenue": null, "title": "Versatile optimization of UDF-heavy data flows with sofa", "abstract": "Currently, we witness an increased interest in large-scale analytical data flows on non-relational data. The predominant building blocks of such data flows are user-defined functions (UDFs), a fact that is not well taken into account for data flow language design and optimization in current systems. In this demonstration, we present Meteor, a declarative data flow language, and Sofa, a logical optimizer for UDF-heavy data flows, which are both part of the Stratosphere system. Meteor queries seamlessly combine self-descriptive, domain-specific operators with standard relational operators. Such queries are optimized by Sofa, building on a concise set of UDF annotations and a small set of rewrite rules to enable semantically equivalent plan rewriting of UDF-heavy data flows. A salient feature of Meteor and Sofa is extensibility: User-defined operators and their properties are arranged into a subsumption hierarchy, which considerably eases integration and optimization of new operators. In this demonstration, we will let users pose arbitrary Meteor queries and graphically showcase versatility and extensibility of Sofa during query optimization.", "venue": "SIGMOD Conference", "year": 2014, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2014-06-18", "journal": {"name": "Proceedings of the 2014 ACM SIGMOD International Conference on Management of Data"}, "authors": [{"authorId": "1924232", "name": "Astrid Rheinländer"}, {"authorId": "40951383", "name": "M. Beckmann"}, {"authorId": "2512896", "name": "Anja Kunkel"}, {"authorId": "34157707", "name": "Arvid Heise"}, {"authorId": "2645045", "name": "T. Stoltmann"}, {"authorId": "1693022", "name": "U. Leser"}], "citations": [{"paperId": "3fb4813a08ecbbf4ceb31f722713f4bc8366e709", "title": "User-Defined Functions in Modern Data Engines"}, {"paperId": "e9dcffb2fc37f783e9cd4ff3b31f1dc635253d4f", "title": "Recursive SQL for Data Mining"}, {"paperId": "5347701b93dfa1342b7b6a4f708e2c504337ed75", "title": "UDF to SQL translation through compositional lazy inductive synthesis"}, {"paperId": "6876a933996b3b91c4033916d37664010c07b4b6", "title": "Niijima: sound and automated computation consolidation for efficient multilingual data-parallel pipelines"}, {"paperId": "4ab38afa44f1da43746cd4a01344c8ec212b9de3", "title": "Data Management in Machine Learning Systems"}, {"paperId": "27b55b340320ad2697bb3038d8ecfc8ec7c8e26c", "title": "Database-inspired optimizations for statistical analysis"}, {"paperId": "9c101403691505e6423122f185d55a26b7d74a81", "title": "Scalable and Declarative Information Extraction in a Parallel Data Analytics System"}]}
