{"paperId": "c226e1007436976abed4cadd4b2e5a4aae6813a7", "publicationVenue": {"id": "75d7a8c1-d871-42db-a8e4-7cf5146fdb62", "name": "Social Science Research Network", "type": "journal", "alternate_names": ["SSRN, Social Science Research Network (SSRN) home page", "SSRN Electronic Journal", "Soc Sci Res Netw", "SSRN", "SSRN Home Page", "SSRN Electron J", "Social Science Electronic Publishing presents Social Science Research Network"], "issn": "1556-5068", "url": "http://www.ssrn.com/", "alternate_urls": ["www.ssrn.com/", "https://fatcat.wiki/container/tol7woxlqjeg5bmzadeg6qrg3e", "https://www.wikidata.org/wiki/Q53949192", "www.ssrn.com/en", "http://www.ssrn.com/en/", "http://umlib.nl/ssrn", "umlib.nl/ssrn"]}, "title": "Utility Fairness in Contextual Dynamic Pricing with Demand Learning", "abstract": "This paper introduces a novel contextual bandit algorithm for personalized pricing under utility fairness constraints in scenarios with uncertain demand, achieving an optimal regret upper bound. Our approach, which incorporates dynamic pricing and demand learning, addresses the critical challenge of fairness in pricing strategies. We first delve into the static full-information setting to formulate an optimal pricing policy as a constrained optimization problem. Here, we propose an approximation algorithm for efficiently and approximately computing the ideal policy. We also use mathematical analysis and computational studies to characterize the structures of optimal contextual pricing policies subject to fairness constraints, deriving simplified policies which lays the foundations of more in-depth research and extensions. Further, we extend our study to dynamic pricing problems with demand learning, establishing a non-standard regret lower bound that highlights the complexity added by fairness constraints. Our research offers a comprehensive analysis of the cost of fairness and its impact on the balance between utility and revenue maximization. This work represents a step towards integrating ethical considerations into algorithmic efficiency in data-driven dynamic pricing.", "venue": "Social Science Research Network", "year": 2023, "fieldsOfStudy": ["Mathematics", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-11-28", "journal": {"name": "ArXiv", "volume": "abs/2311.16528"}, "authors": [{"authorId": "2145306917", "name": "Xi Chen"}, {"authorId": "2266243778", "name": "David Simchi-Levi"}, {"authorId": "2268635259", "name": "Yining Wang"}], "citations": [{"paperId": "4ac31c8490fffd83186365bc830fa6a86d49ee27", "title": "Pricing with Contextual Elasticity and Heteroscedastic Valuation"}]}
