{"paperId": "c2281bd5762743e53304b576e0c175abf9917e1d", "publicationVenue": {"id": "75d7a8c1-d871-42db-a8e4-7cf5146fdb62", "name": "Social Science Research Network", "type": "journal", "alternate_names": ["SSRN, Social Science Research Network (SSRN) home page", "SSRN Electronic Journal", "Soc Sci Res Netw", "SSRN", "SSRN Home Page", "SSRN Electron J", "Social Science Electronic Publishing presents Social Science Research Network"], "issn": "1556-5068", "url": "http://www.ssrn.com/", "alternate_urls": ["www.ssrn.com/", "https://fatcat.wiki/container/tol7woxlqjeg5bmzadeg6qrg3e", "https://www.wikidata.org/wiki/Q53949192", "www.ssrn.com/en", "http://www.ssrn.com/en/", "http://umlib.nl/ssrn", "umlib.nl/ssrn"]}, "title": "Data-driven Clustering and Feature-based Retail Electricity Pricing with Smart Meters", "abstract": "We consider an electric utility company that serves retail electricity customers over a discrete-time horizon. In each period, the company observes the customers' consumption as well as high-dimensional features on customer characteristics and exogenous factors. These features exhibit three types of heterogeneity—over time, customers, or both. Based on the consumption and feature observations, the company can dynamically adjust the retail electricity price at the customer level. The consumption depends on the features: there is an underlying structure of clusters in the feature space, and the relationship between consumption and features is different in each cluster. Initially, the company knows neither the underlying cluster structure nor the corresponding consumption models. We measure the company's performance by its average regret, i.e., the profit loss per period per customer, relative to a clairvoyant who knows the underlying cluster structure and the consumption model in each cluster. We design a data-driven policy of joint spectral clustering and feature-based pricing, and show that its average regret converges to zero at the fastest achievable rate. We conduct case studies based on real-life smart meter data from Texas and simulation experiments. Relative to the company policy, our policy increases company profits by 146% over a three-month period.", "venue": "Social Science Research Network", "year": 2020, "fieldsOfStudy": ["Business"], "publicationTypes": null, "publicationDate": "2020-09-03", "journal": {"name": "SSRN Electronic Journal"}, "authors": [{"authorId": "2246919101", "name": "N. Bora Keskin"}, {"authorId": "1739195391", "name": "Yuexing Li"}, {"authorId": "35301579", "name": "Nur Sunar"}], "citations": [{"paperId": "4799ab92de075a23910bbd5786c74de6659ad243", "title": "Speed Up the Cold-Start Learning in Two-Sided Bandits with Many Arms"}, {"paperId": "dd8642bb06bf03671e3c6c9ec92f55c829bfd28f", "title": "Socially relevant and inclusive operations management"}, {"paperId": "915d79ac5c27e662214116f8e3ed106809c9ba86", "title": "A Scalable Recommendation Engine for New Users and Items"}, {"paperId": "42d20d6326bfbe1da936de2eaf050822a1a794ce", "title": "Differential Privacy in Personalized Pricing with Nonparametric Demand Models"}, {"paperId": "18ed3864084cd1e7597a9c5f4dc1006cb1148d2a", "title": "The Nonstationary Newsvendor: Data-Driven Nonparametric Learning"}, {"paperId": "bfaf88d90727d4832503ed525b1528755b223d48", "title": "Do Noisy Customer Reviews Discourage Platform Sellers? Empirical Analysis of an Online Solar Marketplace"}, {"paperId": "27d501a3e52fe4427f7e66827df35825e8a33780", "title": "Bayesian Meta-Prior Learning Using Empirical Bayes"}, {"paperId": "20d0e6eb8d7c1501aca8c9697eafef7615c848c7", "title": "Context‐based dynamic pricing with online clustering"}, {"paperId": "0cff36a1ff49e48c89c7fe841556b0007aa38f1e", "title": "Pricing Experimental Design: Causal Effect, Expected Revenue and Tail Risk"}]}
