{"paperId": "c23893e334d7237793ba83ee96620e8c9c0e1168", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Adding Chit-Chats to Enhance Task-Oriented Dialogues", "abstract": "The existing dialogue corpora and models are typically designed under two disjoint motives: while task-oriented systems focus on achieving functional goals (e.g., booking hotels), open-domain chatbots aim at making socially engaging conversations. In this work, we propose to integrate both types of systems by Adding Chit-Chats to ENhance Task-ORiented dialogues (ACCENTOR), with the goal of making virtual assistant conversations more engaging and interactive. Specifically, we propose a flexible approach for generating diverse chit-chat responses to augment task-oriented dialogues with minimal annotation effort. We then present our new chit-chat annotations to 23.8K dialogues from the popular task-oriented datasets (Schema-Guided Dialogue and MultiWOZ 2.1) and demonstrate their advantage over the originals via human evaluation. Lastly, we propose three new models for ACCENTOR explicitly trained to predict user goals and to generate contextually relevant chit-chat responses. Automatic and human evaluations show that, compared with the state-of-the-art task-oriented baseline, our models can code-switch between task and chit-chat to be more engaging, interesting, knowledgeable, and humanlike, while maintaining competitive task performance.", "venue": "arXiv.org", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-10-24", "journal": {"name": "ArXiv", "volume": "abs/2010.12757"}, "authors": [{"authorId": "2257202854", "name": "Kai Sun"}, {"authorId": "2256132675", "name": "Seungwhan Moon"}, {"authorId": "34963487", "name": "Paul A. Crook"}, {"authorId": "3849208", "name": "Stephen Roller"}, {"authorId": "2003646964", "name": "Becka Silvert"}, {"authorId": "2257401374", "name": "Bing Liu"}, {"authorId": "2108218300", "name": "Zhiguang Wang"}, {"authorId": "2257374859", "name": "Honglei Liu"}, {"authorId": "34685327", "name": "Eunjoon Cho"}, {"authorId": "2064285348", "name": "Claire Cardie"}], "citations": [{"paperId": "fe020c2718e73438722837a2b840ade6a7603528", "title": "Searching for Snippets of Open-Domain Dialogue in Task-Oriented Dialogue Datasets"}, {"paperId": "8518b47e09ab168599c49e87604c993579549dbc", "title": "A dimensional model of interaction style variation in spoken dialog"}, {"paperId": "dba29a38290ff3dfbb8646ac976e48506a5f5101", "title": "BotsTalk: Machine-sourced Framework for Automatic Curation of Large-scale Multi-skill Dialogue Datasets"}, {"paperId": "ec85ca77d17779d0ee9831678084a9141604e1c1", "title": "Achieving Conversational Goals with Unsupervised Post-hoc Knowledge Injection"}, {"paperId": "5f73750fbbc0bcd8fa7552acafd4aa5c10fdf632", "title": "Integration of Robot-Initiated Dialog into Task-Oriented Dialog by Adding Hidden Tasks - Application to Monitoring for Elderly"}, {"paperId": "7a4dcd6b4519ec4624551778bf13cdc8667cfa17", "title": "Improve Chit-Chat and QA Sentence Classification in User Messages of Dialogue System using Dialogue Act Embedding"}, {"paperId": "20c886aa81c0a3c215a4292f3591582ba5add4fd", "title": "Tell me who you are and i’ll tell you what to do: A Persona Grounded task-oriented Dialogue Generation System"}]}
