{"paperId": "c24b9ba9fb10def76556ab4b2553f14e30184e7a", "publicationVenue": {"id": "d4610af5-85e0-480b-8773-5c71d92a7b99", "name": "International Conference on Architectural Support for Programming Languages and Operating Systems", "type": "conference", "alternate_names": ["ASPLOS", "Int Conf Archit Support Program Lang Oper Syst", "Archit Support Program Lang Oper Syst", "Architectural Support for Programming Languages and Operating Systems"], "url": "http://www.acm.org/sigplan/"}, "title": "AQUATOPE: QoS-and-Uncertainty-Aware Resource Management for Multi-stage Serverless Workflows", "abstract": "Multi-stage serverless applications, i.e., workflows with many computation and I/O stages, are becoming increasingly representative of FaaS platforms. Despite their advantages in terms of fine-grained scalability and modular development, these applications are subject to suboptimal performance, resource inefficiency, and high costs to a larger degree than previous simple serverless functions. We present Aquatope, a QoS-and-uncertainty-aware resource scheduler for end-to-end serverless workflows that takes into account the inherent uncertainty present in FaaS platforms, and improves performance predictability and resource efficiency. Aquatope uses a set of scalable and validated Bayesian models to create pre-warmed containers ahead of function invocations, and to allocate appropriate resources at function granularity to meet a complex workflow's end-to-end QoS, while minimizing resource cost. Across a diverse set of analytics and interactive multi-stage serverless workloads, Aquatope significantly outperforms prior systems, reducing QoS violations by 5X, and cost by 34% on average and up to 52% compared to other QoS-meeting methods.", "venue": "International Conference on Architectural Support for Programming Languages and Operating Systems", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2022-12-19", "journal": {"name": "Proceedings of the 28th ACM International Conference on Architectural Support for Programming Languages and Operating Systems, Volume 1"}, "authors": [{"authorId": "2112218361", "name": "Zhuangzhuang Zhou"}, {"authorId": "49890070", "name": "Yanqi Zhang"}, {"authorId": "3234334", "name": "Christina Delimitrou"}], "citations": [{"paperId": "2a85f343b47f3a54580d9845cc036703bccba67f", "title": "SPES: Towards Optimizing Performance-Resource Trade-Off for Serverless Functions"}, {"paperId": "bd519576e75063a1b249ada944411aba4ade7e32", "title": "PerOS: Personalized Self-Adapting Operating Systems in the Cloud"}, {"paperId": "413021d23a97a603abdca274949c35bf9da15b90", "title": "Jiagu: Optimizing Serverless Computing Resource Utilization with Harmonized Efficiency and Practicability"}, {"paperId": "b582117a278f54acf1e0623ff51bf9a8e21afbc9", "title": "Shabari: Delayed Decision-Making for Faster and Efficient Serverless Functions"}, {"paperId": "df73776bd5a7a84837d7eaad690bf2687de88a80", "title": "Serverless application composition leveraging function fusion: Theory and algorithms"}, {"paperId": "5ef9a5e138ad6496aa95f277a7898b0d2b40a763", "title": "POBO: Safe and optimal resource management for cloud microservices"}, {"paperId": "4aef67cc481b5ab9592b79db393ea019fbdd5ff7", "title": "Parrotfish: Parametric Regression for Optimizing Serverless Functions"}, {"paperId": "7d22dd914224620264b70d8736c28db02cd9357a", "title": "The Gap Between Serverless Research and Real-world Systems"}, {"paperId": "ec25a1a0561d28cf2fa48de85a65b8d267bad6de", "title": "Memento: Architectural Support for Ephemeral Memory Management in Serverless Environments"}, {"paperId": "b61fafdeaee3694693b982fa79e2042cce7f09c5", "title": "IPA: Inference Pipeline Adaptation to Achieve High Accuracy and Cost-Efficiency"}, {"paperId": "eb3fe4ad198641fad73c77c4a8c0ffb7cd0d50d3", "title": "Fine-Grained Management for Microservice Applications with Lazy Configuration Distribution"}, {"paperId": "6602a90aa14e17d8c12c267e5aee04f44b5ab88c", "title": "Ilúvatar: A Fast Control Plane for Serverless Computing"}, {"paperId": "3eb76668eefe2a4d685a967467b3700ba1b6ce75", "title": "DVFaaS: Leveraging DVFS for FaaS Workflows"}, {"paperId": "620cbd7830c457951e674bb035b378a16e0a94c8", "title": "A Case of Multi-Resource Fairness for Serverless Workflows (Work In Progress Paper)"}, {"paperId": "fc05a6f23cd9fa24324a5e22a0a999028cdc7572", "title": "Demeter: Fine-grained Function Orchestration for Geo-distributed Serverless Analytics"}, {"paperId": "72841d86d7ce5c769c22427ed752bcdb83e92c08", "title": "Reinforcement Learning Based Serverless Container Autoscaler"}]}
