{"paperId": "c253517365013f812fa456165ed404675c09156d", "publicationVenue": {"id": "8eda038f-e2d2-44f3-a554-ba3c87033998", "name": "International Workshop on Semantic and Social Media Adaptation and Personalization", "type": "conference", "alternate_names": ["Int Workshop Semantic Soc Media Adapt Pers", "SMAP", "Int Workshop Semantic Media Adapt Pers", "International Workshop on Semantic Media Adaptation and Personalization"]}, "title": "An Apache Spark Implementation for Text Document Clustering", "abstract": "As the volume of data generated and stored on a daily basis is constantly increasing, the need for finding techniques in terms of the automated discovery of information from them has arisen. This purpose can be effectively solved with the use of text mining, which uses methods derived from data mining, information retrieval, machine learning, as well as natural language processing. This paper addresses the problem of extracting textual information from large collections of documents by efficiently exploiting clustering techniques in a cloud computing infrastructure. The clustering was performed using three different algorithms, namely k-Means, Bisecting k-Means, and Gaussian Mixture Model (GMM). To evaluate the quality of these methods, we experimented in the Apache Spark distributed environment, on several well-known datasets, the documents of which have been manually clustered.", "venue": "International Workshop on Semantic and Social Media Adaptation and Personalization", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-11-03", "journal": {"name": "2022 17th International Workshop on Semantic and Social Media Adaptation & Personalization (SMAP)", "pages": "1-6"}, "authors": [{"authorId": "48466459", "name": "Elias Dritsas"}, {"authorId": "4018731", "name": "M. Trigka"}, {"authorId": "68973605", "name": "Gerasimos Vonitsanos"}, {"authorId": "1759254", "name": "Andreas Kanavos"}, {"authorId": "1684455", "name": "Phivos Mylonas"}], "citations": []}
