{"paperId": "c2542973443ce139dfe6e262937ee2578cd9556c", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "A Key Agreement Scheme for IoD Deployment Civilian Drone", "abstract": "Drones are of different shapes, sizes, characteristics, and configurations. It can be classified for the purpose of its deployment, either in the civilian or military domain. The earliest usage of drones was totally for military purposes, but manufacturers promptly tested it for civilian fields like border surveillance, disaster relief, pipeline relief, and security. Drone’s manufacturing, equipment installation, power supply, multi-rotor system, and embedded sensors are not the pressing issues for researchers of drone technologies. What is required is to utilize a drone for a complex operation and ensure secured data broadcasting among drones with the ground control station via a self-organized, resourceless, and infrastructureless network (Flying Ad Hoc Networks (FANET)). These operations are no less important in areas like emergency, search and rescue operations, border surveillance, and physical phenomenon sensing for the end-user. However, it is not without some challenges for the researchers keeping in view the threats these operations are exposed to concerning security issues and challenges. To overcome these challenges, the designers have to strive towards a secured drone operation by developing a robust and lightweight key agreement protocol for IoD deployment civilian drone. Consequently, the researchers in this study have attempted to design a verifiably secure and lightweight authentication scheme for IoD deployment civilian drones. The proposed security protocol has been verified by ProVerif2.02 and Real-Or-Random (ROR) model, while its performance scenario has been tackled by considering storage, computation, and communication overheads analysis. In comparing the proposed framework with prior protocols, it has been demonstrated that the scheme is quite efficient and may be recommended for operations in a given IoD environment.", "venue": "IEEE Access", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "1-1", "volume": "PP"}, "authors": [{"authorId": "49477474", "name": "S. Jan"}, {"authorId": "34744005", "name": "I. A. Abbasi"}, {"authorId": "1859619", "name": "F. Algarni"}], "citations": [{"paperId": "cc131ebf19254a1c53c64b9459e20f8bb3ff10f5", "title": "A Biometric and Physically Unclonable Function - Based Authentication Protocol for Payload Exchanges in Internet of Drones"}, {"paperId": "b739adcdea78b346c523dac24cad5d43f5006082", "title": "Group Secret Key Generation Using Physical Layer Security for UAV Swarm Communications"}, {"paperId": "2b3ee10ab3220541b4635e15e95c361995dca4d1", "title": "A Multichannel MAC Protocol without Coordination or Prior Information for Directional Flying Ad hoc Networks"}, {"paperId": "4bd55d4c28723dfed3ed7888315c65c562cc3f1d", "title": "A Symmetric Key and Elliptic Curve Cryptography-Based Protocol for Message Encryption in Unmanned Aerial Vehicles"}, {"paperId": "6f19b60f823cacd165dbe2f8fdcbcd6fed2f59e1", "title": "Proposing A Novel Key Agreement Protocol For Flying Ad-Hoc Network"}, {"paperId": "853ab0bc3b32087befb485e4d13f4164409e800d", "title": "HOOPOE: High Performance and Efficient Anonymous Handover Authentication Protocol for Flying Out of Zone UAVs"}, {"paperId": "e0c3f4162d9db57de1bc2b4d6540149b47929c32", "title": "A Review of Authentication Methods in Internet of Drones"}, {"paperId": "cf9cae797657f035bdc255eeeb60c0716a74ef5c", "title": "Research on Identity Authentication Scheme for UAV Communication Network"}, {"paperId": "98a3f8e472fcbbb9bdaee0d388a5b617cd3c5643", "title": "Smart Flood Detection with AI and Blockchain Integration in Saudi Arabia Using Drones"}, {"paperId": "abb0a6c573a9169b3679cb25a4f0181810c9fea4", "title": "Internet of drones security: Taxonomies, open issues, and future directions"}, {"paperId": "b11277579f20a06f3cbe840ad60bc4a502194ae5", "title": "Resilient and dependability management in distributed environments: a systematic and comprehensive literature review"}, {"paperId": "b28941df8c7457857fbb76219e4f6e7ba5853acd", "title": "A Robust and Privacy-Preserving Anonymous User Authentication Scheme for Public Cloud Server"}, {"paperId": "8240390a739386bfc49d7d30b35b5b9ad1d23643", "title": "Online Intermediate Admission Management System"}, {"paperId": "67c369cfd2195e96eac13cd9e92ba7ac61178733", "title": "Online Complaint Management System at Government Degree College Wari"}, {"paperId": "14b41477656ad9a16d592b7e351385105ab1a41d", "title": "Authenticated Secure Quantum-Based Communication Scheme in Internet-of-Drones Deployment"}, {"paperId": "84205bd51d0eba7611b1f8f94fc8062fb9bada53", "title": "LMAS-SHS: A Lightweight Mutual Authentication Scheme for Smart Home Surveillance"}, {"paperId": "84c3e85500d1d6d5c605d3560215181870b95999", "title": "A Verifiably Secure ECC Based Authentication Scheme for Securing IoD Using FANET"}]}
