{"paperId": "c2640c8fefb3df1e37c899bffed491ae4776abdf", "publicationVenue": {"id": "4a707e29-5a29-4222-b3da-e51b9a3ac36e", "name": "Computers Materials & Continua", "alternate_names": ["Comput Mater  Contin"], "issn": "1546-2218", "url": "http://www.techscience.com/cmc/"}, "title": "Systematic Analysis of Safety and Security Risks in Smart Homes", "abstract": ": The revolution in Internet of Things (IoT)-based devices and applications has provided smart applications for humans. These applications range from healthcare to traffic-flow management, to communication devices, to smart security devices, and many others. In particular, government and pri-vate organizations are showing significant interest in IoT-enabled applications for smart homes. Despite the perceived benefits and interest, human safety is also a key concern. This research is aimed at systematically analyzing the available literature on smart homes and identifying areas of concern or risk with a view to supporting the design of safe and secure smart homes. For this systematic review process, relevant work in the most highly regarded journals published in the period 2016–2020(a section of 2020 is included) was analyzed. A final set of 99 relevant articles (journal articles, book sections, conference papers, and survey papers) was analyzed in this study. This analysis is focused on three research questions and relevant keywords. The systematic analysis results and key insights will help researchers and practitioners to make more informed decisions when dealing with the safety and security risks of smart homes, especially in emergency situations.", "venue": "Computers Materials & Continua", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": null, "journal": {"name": "Computers, Materials & Continua"}, "authors": [{"authorId": "2056138765", "name": "H. Khan"}, {"authorId": "2391236", "name": "M. Alomari"}, {"authorId": "1738153049", "name": "Sulaiman Khan"}, {"authorId": "3195938", "name": "S. Nazir"}, {"authorId": "143742258", "name": "A. Gill"}, {"authorId": "1403759824", "name": "Alanoud Al-Maadid"}, {"authorId": "2146437065", "name": "Zaki Khalid Abu-Shawish"}, {"authorId": "46714817", "name": "M. Hassan"}], "citations": [{"paperId": "ec9a99f3e7410fd0ea800b2cc79e39254ae35573", "title": "Artificial Intelligence Based System on Enhancing the Capabilities of Transport System: A Systemic Literature Review"}, {"paperId": "f82ec3decc5755d6394d741528493bb82dcf9193", "title": "Privacy Risk Assessment of Smart Home System Based on a STPA–FMEA Method"}, {"paperId": "cdb5e1ddd8e60ae239d98d1c91e7d6f453d54e83", "title": "Systematic analysis of healthcare big data analytics for efficient care and disease diagnosing"}, {"paperId": "c92ac92ac8a318696ab006b9d9631483c56fe8f2", "title": "Utilizing the collective wisdom of fintech in the gcc region: A systematic mapping approach"}, {"paperId": "b69ebc9ad6af85bec4c178e1c9c16d30581a7b97", "title": "Cluster-Based Authentication Process in a Smart City"}, {"paperId": "9f3b7778fcb6fe2460c39a0eae4997f10ff81d16", "title": "Transforming the competencies of Artificial Intelligence to ensure the Cyber Threats: A Systemic Literture Review of Busniess Sectors"}, {"paperId": "4c37a96f29a44601324e389d625e2b6085598fcb", "title": "Transforming the Capabilities of Artificial Intelligence in GCC Financial Sector: A Systematic Literature Review"}, {"paperId": "430d178e01c6b7736f866d6cbd96e13a7dc69364", "title": "Connected Homes: Inclusion of IoT in Indian Households"}, {"paperId": "12d6ac7d217736f86c3470e8c24f4861c8d14d5d", "title": "ROLE OF BIG DATA ANALYTICS AND FIFA WORLD CUP 2022 ON THE QATAR’S TOURISM INDUSTRY: SYSTEMATIC REVIEW"}]}
