{"paperId": "c269db97e30c810590dc221fcf3faa835192bf10", "publicationVenue": {"id": "f2c78b1b-6bcc-4700-859b-af9401c02941", "name": "Buildings", "type": "journal", "issn": "0007-3725", "alternate_issns": ["2075-5309"], "url": "https://www.buildings.com/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217973", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217973", "https://www.mdpi.com/journal/buildings"]}, "title": "Decoding Social Sustainability in Construction Projects: Analysis of Project Dynamics and Impact", "abstract": "Sustainable development (SD) is of prime importance in the present world, where resources are depleting fast and causing conflicts among nations to control essential resources. Since the construction industry (CI) consumes most of these resources, Construction Sustainability (CS) is a key focus of SD. Among the three pillars of sustainability, i.e., economic, environmental, and social, the first two have been amply addressed by researchers. However, the social aspects have been neglected or under-researched so far. The current research humbly attempts to fill this gap. Accordingly, a System Dynamics Model (SDM) has been developed to address this issue. After a comprehensive literature review, questionnaire survey, content analysis, and gathering the opinions of ten experts from CI, 11 key factors of social CS were identified. Using the system thinking approach, a causal loop diagram (CLD) was developed to assess the intensity and polarity of these factors. The CLD encompassed eight reinforcing loops and one balancing loop. Based on the CLD, an SDM was developed and simulated over 3 years. Primarily, the SDM had two stocks: “Government support for sustainable construction” and “Stakeholder awareness and knowledge”. An additional stock named “Construction Sustainability” was added to observe the combined effect of the system. The results showed that CS increased over time. The CLD and resulting SDM help in understanding the complex interaction of the social CS factors and thereby addressing the associated complexity of the effects of these varied factors on a project. Such knowledge can be valuable for anyone dealing with projects where social factors play a significant role. The proposed SDM provides a structured approach to understanding and visualizing the intricate relationships and feedback loops within a social system, aiding in more effective decision making and problem solving.", "venue": "Buildings", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2024-03-04", "journal": {"name": "Buildings"}, "authors": [{"authorId": "2290215392", "name": "Junaid Akhtar"}, {"authorId": "29231933", "name": "Khurram Iqbal Ahmad Khan"}, {"authorId": "2209417769", "name": "Muhammad Bilal Tahir"}, {"authorId": "2112554074", "name": "Fahim Ullah"}, {"authorId": "2290215701", "name": "Abdul Waheed"}], "citations": []}
