{"paperId": "c2859b110dd8b9334e8b2d76a847649c6e4a4e1b", "publicationVenue": {"id": "9181819e-530e-4408-9917-93c5f58d7fce", "name": "International Congress on Information and Communication Technology", "type": "conference", "alternate_names": ["Int Conf Inf Comput Technol", "International Conference on Inventive Computation Technologies", "ICICT", "Int Congr Inf Commun Technol", "Int Conf Inven Comput Technol", "International Conference on Issues and Challenges in Intelligent Computing Techniques", "International Conference on Information and Computer Technologies", "Int Conf Issue Chall Intell Comput Tech"]}, "title": "Performance Analysis of ECG Big Data using Apache Hive and Apache Pig", "abstract": "Big Data has been observed as a revolution due to technological advancement since last few years. The process of examining the massive, gigantic, heterogeneous and multiplex datasets that are changing very often is called Big Data Analytics. Decision making by extracting information from complex and multi-structured data is not possible by using traditional means. Two keys elements of Hadoop, Apache Hive and Apache Pig are the most systematic and cost-effective for implementation of ECG Big Data. Apache Pig and Apache Hive are open source initiatives for examining huge sets of data in a high-level language. In this research, performance analysis of various datasets of ECG Big Data is performed by Apache Hive and Apache Pig. Different parameters of ECG Big Data have been observed and it is showed from results that Apache Pig has been considered more efficient and systematic in providing quick results in less time as compared to Apache Hive.", "venue": "International Congress on Information and Communication Technology", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2019-11-01", "journal": {"name": "2019 8th International Conference on Information and Communication Technologies (ICICT)", "pages": "2-7"}, "authors": [{"authorId": "2110092486", "name": "Mudassar Ahmad"}, {"authorId": "51226549", "name": "Safina Kanwal"}, {"authorId": "1500660386", "name": "Maryam Cheema"}, {"authorId": "7693282", "name": "Muhammad Asif Habib"}], "citations": [{"paperId": "1b26d0ca03b40090126309d59c579cbb8f2da8fd", "title": "Analysis of data processing efficiency with use of Apache Hive and Apache Pig in Hadoop environment"}, {"paperId": "bb81eb58d09f62533f7dbe0d7cdcbcb0636c6a50", "title": "Developing a big data analytics platform using Apache Hadoop Ecosystem for delivering big data services in libraries"}, {"paperId": "d28e85fb87e5a5f47f5395484f06b2def8e5e47c", "title": "A systematic survey of data mining and big data analysis in internet of things"}, {"paperId": "1a8b99dab8b652b7b535a3f93a300c1a10c73df6", "title": "Comparative Study of Apache Pig & Apache Cassandra in Hadoop Distributed Environment"}, {"paperId": "d0a6580508fc31354b8ac49d693430bbe677f099", "title": "Study of Efficient Algorithm for Deduplication of Complex Structure"}, {"paperId": "bfb571b60e6c04f4681a1cc3697f6ef044b4785f", "title": "An Intelligent Approach for Data Analysis and Decision Making in Big Data: A Case Study on E-commerce Industry"}]}
