{"paperId": "c289758f74b2ca3214a8f0508b0265103692bc83", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "An Unsupervised Model for Identifying and Characterizing Dark Web Forums", "abstract": "Dark Web forums are significantly exploited to trade confidential information and illicit products by criminals. This paper addresses the problem of how to identify the cluster of discussion forums and their characteristics on the Dark Web. Exiting methods are mostly dependent on the continuous labeled contents, which are expensive and not feasible due to the nature of Dark Web data. Therefore, an approach that does not need a continuous availability of labeled forum and related knowledge is required. To this end, we propose an unsupervised model to identify and characterize Dark Web forums by combining clustering algorithm and decision tree algorithm. The proposed method presents the characteristics in an explainable form that can be used by the cyber threat intelligence system and law enforcement as scientific evidence to analyze any data breach or illicit activities in the Dark Web forums. To evaluate the performance of our model comprehensive experiments were conducted using real Dark Web forum data. The proposed approach achieves 98% accuracy and F1 score of 98% validating the efficacy of our proposed model to successfully characterize Dark Web forums. The experimental results suggest that the proposed model could be useful to the cyber threat intelligence and law enforcement community for building an intelligent source of knowledge that can be used for detecting data breach and illicit activities happening in the Dark Web forums.", "venue": "IEEE Access", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "112871-112892", "volume": "9"}, "authors": [{"authorId": "1978854301", "name": "Saiba Nazah"}, {"authorId": "38877263", "name": "Shamsul Huda"}, {"authorId": "1703056", "name": "J. Abawajy"}, {"authorId": "2114796567", "name": "M. M. Hassan"}], "citations": [{"paperId": "8fe8dc2a1c6474c51514503a79bedc1fa4468253", "title": "Discovering child sexual abuse material creators' behaviors and preferences on the dark web."}, {"paperId": "2ff97947ae1173bc4749613b84728c690acfadb9", "title": "Summarizing Dark Web Services with TF-IDF and LSA"}, {"paperId": "b4826ac8e0c1d32eaa574109b16707f5f0e7e468", "title": "Towards Safe Cyber Practices: Developing a Proactive Cyber-Threat Intelligence System for Dark Web Forum Content by Identifying Cybercrimes"}, {"paperId": "b223c4e5074cb18cc94223c71b7401da5681d9bc", "title": "Dark Side of the Web: Dark Web Classification Based on TextCNN and Topic Modeling Weight"}, {"paperId": "ec6d60d3263befe459f836813b1594be821669e7", "title": "A Hybrid TF-IDF and RNN Model for Multi-label Classification of the Deep and Dark Web"}, {"paperId": "98f9f2e6be7e49bbf404f9047a02620896831e45", "title": "Identifying Online Child Sexual Texts in Dark Web through Machine Learning and Deep Learning Algorithms"}, {"paperId": "3bf04cb9e85bfdf5f3281c387da43dfe31b8f1f6", "title": "C-OSINT: COVID-19 Open Source Artificial INTelligence Framework"}]}
