{"paperId": "c28cb52a0be1ff70c002c33d6c1a6e95be45ce81", "publicationVenue": {"id": "7b2adce0-d53f-49d6-8784-b0645604fe62", "name": "ACM Computing Surveys", "type": "journal", "alternate_names": ["ACM Comput Surv"], "issn": "0360-0300", "url": "http://www.acm.org/pubs/surveys/", "alternate_urls": ["http://portal.acm.org/csur", "https://csur.acm.org/", "http://csur.acm.org/"]}, "title": "Cost Optimization for Cloud Storage from User Perspectives: Recent Advances, Taxonomy, and Survey", "abstract": "With the development and maturity of cloud storage, it has attracted a large number of users. Although cloud users do not need to concern themselves with the infrastructure used for storage, thus saving on equipment and maintenance costs, the sheer volume of data still generates significant cloud storage usage costs, which motivates cloud storage users to look for ways to further save costs. In this article, we analyze the whole process of using cloud storage to exhaustively explore opportunities, motivations, and challenges of cost optimization from user perspectives. Then we provide a comprehensive taxonomy and summary of recent advances in terms of storage efficiency (i.e., cost optimization by improving storage efficiency), cloud storage services (i.e., cost optimization by leveraging the features of cloud storage services), and emerging storage paradigms (i.e., cost optimization by leveraging emerging storage paradigms like edge storage). Finally, we present future directions for cost optimization from user perspectives and present our conclusion. This article offers a thorough survey of recent advances focusing on how to optimize the cost of using cloud storage for cloud users, and it has an opportunity to attract a broad audience in the cost-effective cloud storage market.", "venue": "ACM Computing Surveys", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-02-03", "journal": {"name": "ACM Computing Surveys", "pages": "1 - 37", "volume": "55"}, "authors": [{"authorId": "2112328528", "name": "Mingyu Liu"}, {"authorId": "145656335", "name": "Li Pan"}, {"authorId": "1700599", "name": "Shijun Liu"}], "citations": [{"paperId": "192e1451b6e10b3ebd42b28521520926694353a1", "title": "Rethinking the Cloudonomics of Efficient I/O for Data-Intensive Analytics Applications"}, {"paperId": "f299d253ccc1c3cdc0324d7d04b4118283e266f5", "title": "Predictive Disk Provisioning for Adjustable Cloud Storage Solutions"}, {"paperId": "d2957b2d29417a79c9ae92a430807bd473b2507a", "title": "Efficient Large-Capacity Caching in Cloud Storage Using Skip-Gram-Based File Correlation Analysis"}]}
