{"paperId": "c2a2b801e9091c33d50efd8758d3bcc2b05368ff", "publicationVenue": {"id": "41bf9ed3-85b3-4c90-b015-150e31690253", "name": "Conference on Empirical Methods in Natural Language Processing", "type": "conference", "alternate_names": ["Empir Method Nat Lang Process", "Empirical Methods in Natural Language Processing", "Conf Empir Method Nat Lang Process", "EMNLP"], "url": "https://www.aclweb.org/portal/emnlp"}, "title": "Z-LaVI: Zero-Shot Language Solver Fueled by Visual Imagination", "abstract": "Large-scale pretrained language models have made significant advances in solving downstream language understanding tasks. However, they generally suffer from reporting bias, the phenomenon describing the lack of explicit commonsense knowledge in written text, e.g., ”an orange is orange”. To overcome this limitation, we develop a novel approach, Z-LaVI, to endow language models with visual imagination capabilities. Specifically, we leverage two complementary types of ”imaginations”: (i) recalling existing images through retrieval and (ii) synthesizing nonexistent images via text-to-image generation. Jointly exploiting the language inputs and the imagination, a pretrained vision-language model (e.g., CLIP) eventually composes a zero-shot solution to the original language tasks. Notably, fueling language models with imagination can effectively leverage visual knowledge to solve plain language tasks. In consequence, Z-LaVI consistently improves the zero-shot performance of existing language models across a diverse set of language tasks.", "venue": "Conference on Empirical Methods in Natural Language Processing", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-10-21", "journal": {"name": "ArXiv", "volume": "abs/2210.12261"}, "authors": [{"authorId": "2109409802", "name": "Yue Yang"}, {"authorId": "2087264100", "name": "Wenlin Yao"}, {"authorId": "48212577", "name": "Hongming Zhang"}, {"authorId": "48631781", "name": "Xiaoyang Wang"}, {"authorId": "144580027", "name": "Dong Yu"}, {"authorId": "2108276402", "name": "Jianshu Chen"}], "citations": [{"paperId": "6a1d85d1a73d2b80f8a61db62e9b64299eb2dd7e", "title": "Will GPT-4 Run DOOM?"}, {"paperId": "56d7c8ed197f14e70e5538981dc19509f326ee3d", "title": "GRAFFORD: A Benchmark Dataset for Testing the Knowledge of Object Affordances of Language and Vision Models"}, {"paperId": "5579a90486bc9d135e5967a6e9ea1ae352216cf0", "title": "Training on Synthetic Data Beats Real Data in Multimodal Relation Extraction"}, {"paperId": "5d8bd9709c0d26db0df03d1c3859adcfd8cf3a3f", "title": "Cross-Lingual Transfer of Large Language Model by Visually-Derived Supervision Toward Low-Resource Languages"}, {"paperId": "2d895c3153a80d281428a14d14ae121536fe790d", "title": "CycleNet: Rethinking Cycle Consistency in Text-Guided Diffusion for Image Manipulation"}, {"paperId": "f30331e65ca2d5245b1a69db6aca4cb3c5e28b9a", "title": "Training Multimedia Event Extraction With Generated Images and Captions"}, {"paperId": "03d8be9227a37ed1309f25ad786a4a6b5e19ac3b", "title": "ImageNetVC: Zero- and Few-Shot Visual Commonsense Evaluation on 1000 ImageNet Categories"}, {"paperId": "b908824639d18f11883abcab21efeb22e315ab9c", "title": "Multimodal Procedural Planning via Dual Text-Image Prompting"}, {"paperId": "bc0ee1c62b7864afd211e085fb3d58263c84ccfe", "title": "Movie Box Office Prediction With Self-Supervised and Visually Grounded Pretraining"}, {"paperId": "00a9a469bb019bf33eeee438c110f704b71cda73", "title": "Retrieving Multimodal Information for Augmented Generation: A Survey"}, {"paperId": "36d71337d5450f53179ebb069347bd8c85034a89", "title": "Localization vs. Semantics: Visual Representations in Unimodal and Multimodal Models"}, {"paperId": "8f2f6d90de822888ec4e283788bc09917018e9d6", "title": "ImageNetVC: Zero-Shot Visual Commonsense Evaluation on 1000 ImageNet Categories"}, {"paperId": "970a8ed9de244b080aa69dbf5996a37057909ca6", "title": "Localization vs. Semantics: How Can Language Benefit Visual Representation Learning?"}]}
