{"paperId": "c2a66aecd6fe33190f77bad8e1bd3a8c841a20a2", "publicationVenue": {"id": "11dac14d-0ccb-4051-ac59-f772ed880bdd", "name": "International Journal of Data Mining Modelling and Management", "type": "journal", "alternate_names": ["International Journal of Data Mining, Modelling and Management", "Int J Data Min Model Manag"], "issn": "1759-1171", "url": "https://www.inderscience.com/jhome.php?jcode=ijdmmm"}, "title": "Chatbots and ChatGPT: A Bibliometric Analysis and Systematic Review of Publications in Web of Science and Scopus Databases", "abstract": "This paper presents a bibliometric analysis of the scientific literature related to chatbots, focusing specifically on ChatGPT. Chatbots have gained increasing attention recently, with an annual growth rate of 19.16% and 27.19% on the Web of Sciences (WoS) and Scopus, respectively. In this study, we have explored the structure, conceptual evolution, and trends in this field by analyzing data from both Scopus and WoS databases. The research consists of two study phases: (i) an analysis of chatbot literature and (ii) a comprehensive review of scientific documents on ChatGPT. In the first phase, a bibliometric analysis is conducted on all published literature, including articles, book chapters, conference papers, and reviews on chatbots from both Scopus (5839) and WoS (2531) databases covering the period from 1998 to 2023. An in-depth analysis focusing on sources, countries, authors' impact, and keywords has revealed that ChatGPT is the latest trend in the chatbot field. Consequently, in the second phase, bibliometric analysis has been carried out on ChatGPT publications, and 45 published studies have been analyzed thoroughly based on their methods, novelty, and conclusions. The key areas of interest identified from the study can be classified into three groups: artificial intelligence and related technologies, design and evaluation of conversational agents, and digital technologies and mental health. Overall, the study aims to provide guidelines for researchers to conduct their research more effectively in the field of chatbots and specifically highlight significant areas for future investigation into ChatGPT.", "venue": "International Journal of Data Mining Modelling and Management", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-04-11", "journal": {"name": "ArXiv", "volume": "abs/2304.05436"}, "authors": [{"authorId": "152706596", "name": "H. Khosravi"}, {"authorId": "113370906", "name": "M. Shafie"}, {"authorId": "1388227262", "name": "M. Hajiabadi"}, {"authorId": "94285938", "name": "Ahmed Shoyeb Raihan"}, {"authorId": "2055104561", "name": "Imtiaz Ahmed"}], "citations": [{"paperId": "1ad53dd8e83bd6db09fae5ace82bf23d9d74e652", "title": "Bibliometric Overview of ChatGPT: New Perspectives in Social Sciences"}, {"paperId": "7bdd2adbde5ed2bdfd12dbcab4a7a354849835d5", "title": "Mapping Literacies in the Tourism Labor Market: A Cross-Database Comparison"}, {"paperId": "7b222a0065c36e45ed9a54dedd4322c638a12793", "title": "Detecting manuscripts written by generative AI and AI-assisted technologies in the field of pharmacy practice"}, {"paperId": "d0455ce1815866bf6657bddfd64c0eba73239785", "title": "The scholarly footprint of ChatGPT: a bibliometric analysis of the early outbreak phase"}, {"paperId": "6e3acc7102d0cf2c6e351c702b97cd9ace6dd264", "title": "The impact and applications of ChatGPT: a systematic review of literature reviews"}, {"paperId": "42b3e5cb89cd5e7502d7166131dfd00360165146", "title": "Writing with ChatGPT in a context of educational inequality and digital divide"}]}
