{"paperId": "c2abf41cd52b86eb43cc0a4a8fa9e1fa36905d07", "publicationVenue": {"id": "905b3424-76e3-40e2-b224-a4fae9d394ad", "name": "International Journal of Organizational and Collective Intelligence", "type": "journal", "alternate_names": ["Int J Organ Collect Intell"], "issn": "1947-9344", "url": "http://www.igi-global.com/Bookstore/TitleDetails.aspx?TitleId=1140", "alternate_urls": ["https://www.igi-global.com/journal/international-journal-organizational-collective-intelligence/1140", "http://www.igi-global.com/IJOCI"]}, "title": "Early Detection of Gastroesophageal Reflux Disease Using Logistic Regression and Support Vector Machine", "abstract": "Gastro disorders occur due to non-systematic lifestyle. With frequent health checks and diagnosis, these disorders can be detected. This paper proposes implementation of the machine learning techniques to predict the gastroesophageal reflux disorder in a patient. The logistic regression and SVM (support vector machine) classifier are the techniques adapted based on the source of symptoms for carrying out prediction. The algorithms work with the assistance of linear representation in the form of a binary tree. Every central node of the tree is represented by an attribute, and every branch node is related to one class label in the algorithm. The support vector machine algorithm assists in the classification of the dataset on the basis of kernel and also grouping of the dataset by means of hyper plane. These artificial neural networks concepts are found to have a greater accuracy. The motive of this paper is to predict the occurrences of the gastroesophageal reflux disorders in individuals. As a value-added feature, the information is encrypted using ECC and authenticated using SHA256.", "venue": "International Journal of Organizational and Collective Intelligence", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-04-01", "journal": {"name": "Int. J. Organ. Collect. Intell.", "pages": "75-90", "volume": "11"}, "authors": [{"authorId": "2105446316", "name": "V. SrividyaB."}, {"authorId": "9109749", "name": "S. Sasi"}], "citations": []}
