{"paperId": "c2acd436d47ea23883cc66ef5c383117a226ce75", "publicationVenue": {"id": "0d993d4a-09ba-4df8-90a4-7dfe25f0cb9e", "name": "ACM Transactions on Intelligent Systems and Technology", "type": "journal", "alternate_names": ["ACM Trans Intell Syst Technol"], "issn": "2157-6904", "url": "http://portal.acm.org/tist", "alternate_urls": ["https://tist.acm.org/"]}, "title": "Explainable finite mixture of mixtures of bounded asymmetric generalized Gaussian and Uniform distributions learning for energy demand management", "abstract": "We introduce a mixture of mixtures of bounded asymmetric generalized Gaussian and uniform distributions. Based on this framework, we propose model-based classification and model-based clustering algorithms. We develop an objective function for the minimum message length (MML) model selection criterion to discover the optimal number of clusters for the unsupervised approach of our proposed model. Given the crucial attention received by Explainable AI (XAI) in recent years, we introduce a method to interpret the predictions obtained from the proposed model in both learning settings by defining their boundaries in terms of the crucial features. Integrating Explainability within our proposed algorithm increases the credibility of the algorithm’s predictions since it would be explainable to the user’s perspective through simple If-Then statements using a small binary decision tree. In this paper, the proposed algorithm proves its reliability and superiority to several state-of-the-art machine learning algorithms within the following real-world applications: fault detection and diagnosis (FDD) in chillers, occupancy estimation and categorization of residential energy consumers.", "venue": "ACM Transactions on Intelligent Systems and Technology", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-03-26", "journal": {"name": "ACM Transactions on Intelligent Systems and Technology"}, "authors": [{"authorId": "1422316892", "name": "H. Al-Bazzaz"}, {"authorId": "144821487", "name": "Muhammad Azam"}, {"authorId": "9728165", "name": "Manar Amayri"}, {"authorId": "2269348048", "name": "Nizar Bouguila"}], "citations": []}
