{"paperId": "c2c373a966ce150c49a00fdbb423ba4d22fad256", "publicationVenue": {"id": "cfb166a7-f896-49c7-a499-fe209a19936e", "name": "River", "type": "journal", "alternate_names": ["River"], "issn": "2750-4867"}, "title": "A coordinated drainage and regulation model of urban water systems in China: A case study in Fuzhou city", "abstract": "Extreme climate and urbanization lead to frequent urban floods, and urban water system dispatching is an important means of urban flood control. A coupled model is proposed to simulate urban floods in real‐time and achieve comprehensive water system control for urban floods. First, the systematical description of coordinated drainage and regulation model of urban water systems in China is introduced, then the practice of Fuzhou city was taken as an example to introduce the prediction and forecast systems, as well as water system regulation for urban flood and waterlogging disaster in detail. Results show that the root‐mean‐square error of river flood prediction is less than 0.3 and that the calculation time of waterlogging simulation is less than 10 min; the optimization regulation reduces the peak river water level by 31 cm. This study will establish a novel urban water system management model to help urban managers better reduce the loss caused by urban floods.", "venue": "River", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-02-01", "journal": {"name": "River", "pages": "20 - 5", "volume": "2"}, "authors": [{"authorId": "2144220951", "name": "Hao Wang"}, {"authorId": "1962208", "name": "X. Lei"}, {"authorId": "2144446861", "name": "Chao Wang"}, {"authorId": "8524689", "name": "Weihong Liao"}, {"authorId": "145818712", "name": "Aiqing Kang"}, {"authorId": "2143569148", "name": "Haocheng Huang"}, {"authorId": "2180863020", "name": "Xingchen Ding"}, {"authorId": "2155646003", "name": "Yang Chen"}, {"authorId": "2211190960", "name": "Xuelian Zhang"}], "citations": [{"paperId": "73485e84a3d50b23f08d9175000ee952858ccd3e", "title": "Improving the Accuracy of Urban Waterlogging Simulation: A Novel Computer Vision-Based Digital Elevation Model Refinement Approach for Roads and Densely Built-Up Areas"}, {"paperId": "83188251d4aa8993d6191bc176c1944f488fb4b9", "title": "Urban waterlogging control: A novel method to urban drainage pipes reconstruction, systematic and automated"}]}
