{"paperId": "c2d7e74af1463ab8879bb7ac2df770a33badaac6", "publicationVenue": {"id": "0d993d4a-09ba-4df8-90a4-7dfe25f0cb9e", "name": "ACM Transactions on Intelligent Systems and Technology", "type": "journal", "alternate_names": ["ACM Trans Intell Syst Technol"], "issn": "2157-6904", "url": "http://portal.acm.org/tist", "alternate_urls": ["https://tist.acm.org/"]}, "title": "FedCVT: Semi-supervised Vertical Federated Learning with Cross-view Training", "abstract": "Federated learning allows multiple parties to build machine learning models collaboratively without exposing data. In particular, vertical federated learning (VFL) enables participating parties to build a joint machine learning model based upon distributed features of aligned samples. However, VFL requires all parties to share a sufficient amount of aligned samples. In reality, the set of aligned samples may be small, leaving the majority of the non-aligned data unused. In this article, we propose Federated Cross-view Training (FedCVT), a semi-supervised learning approach that improves the performance of the VFL model with limited aligned samples. More specifically, FedCVT estimates representations for missing features, predicts pseudo-labels for unlabeled samples to expand the training set, and trains three classifiers jointly based upon different views of the expanded training set to improve the VFL model’s performance. FedCVT does not require parties to share their original data and model parameters, thus preserving data privacy. We conduct experiments on NUS-WIDE, Vehicle, and CIFAR10 datasets. The experimental results demonstrate that FedCVT significantly outperforms vanilla VFL that only utilizes aligned samples. Finally, we perform ablation studies to investigate the contribution of each component of FedCVT to the performance of FedCVT.", "venue": "ACM Transactions on Intelligent Systems and Technology", "year": 2020, "fieldsOfStudy": ["Computer Science", "Mathematics"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-08-25", "journal": {"name": "ACM Transactions on Intelligent Systems and Technology (TIST)", "pages": "1 - 16", "volume": "13"}, "authors": [{"authorId": "1505828520", "name": "Yan Kang"}, {"authorId": "1614034792", "name": "Yang Liu"}, {"authorId": "2143617605", "name": "Xinle Liang"}], "citations": [{"paperId": "b5956c98efcb9537e273e1de79051fc188be2754", "title": "An Efficient Federated Multiview Fuzzy C-Means Clustering Method"}, {"paperId": "2c859754f05887fc03765a893e39f231fa7912b8", "title": "Computation and Communication Efficient Lightweighting Vertical Federated Learning"}, {"paperId": "412866636fca0b5c5f7a411e55252f2b21006ee1", "title": "Research Advanced in Federated Learning"}, {"paperId": "8a34f65df7a75af0aee6ee64395ded2b8eba8e22", "title": "Metadata and Image Features Co-Aware Semi-Supervised Vertical Federated Learning With Attention Mechanism"}, {"paperId": "2ccb6ef1cb2e01efe91005938dcbb8cdd254f87d", "title": "MMVFL: A Simple Vertical Federated Learning Framework for Multi-Class Multi-Participant Scenarios"}, {"paperId": "eea271aba368f87c481fea4b1e9aa67c64233409", "title": "Online Vertical Federated Learning for Cooperative Spectrum Sensing"}, {"paperId": "31bb305eea7a5cb80fe6f3c5c8ef00ae701acb7c", "title": "Responsible and Effective Federated Learning in Financial Services: A Comprehensive Survey"}, {"paperId": "a057747508caf3dbfc8383e32da8ce2285d53224", "title": "FL-AMM: Federated Learning Augmented Map Matching With Heterogeneous Cellular Moving Trajectories"}, {"paperId": "2ea26f40336fd30ddb86e68803dd1143c99ca35c", "title": "MERGE: A model for multi-input biomedical federated learning"}, {"paperId": "70bc6a5837085b39214a8a303c54252e473e624e", "title": "Dual-Objective Personalized Federated Service System With Partially-Labeled Data Over Wireless Networks"}, {"paperId": "eca391e40157576a9699bdba41d9e10d2f2a17b6", "title": "AFEI: adaptive optimized vertical federated learning for heterogeneous multi-omics data integration"}, {"paperId": "e3663ef7b9f865a35a3b54d8e930f6eba7243668", "title": "Enhancing Model Performance via Vertical Federated Learning for Non-Overlapping Data Utilization"}, {"paperId": "378406966c3edb7d31a9637093fdee07d81cddf9", "title": "FedMultimodal: A Benchmark for Multimodal Federated Learning"}, {"paperId": "5d73bd138049d50de55ae53232768b925071f320", "title": "Federated Domain Generalization: A Survey"}, {"paperId": "3009e55d6dec2a3d03f4f634297f5fee52685a3a", "title": "Federated Learning on Multimodal Data: A Comprehensive Survey"}, {"paperId": "81a2185501641ac0e9d1a42623ace287e2e09860", "title": "FedAds: A Benchmark for Privacy-Preserving CVR Estimation with Vertical Federated Learning"}, {"paperId": "a87af8ec4686bd8fb9594271c3348a8a6ba57aa9", "title": "A Survey on Vertical Federated Learning: From a Layered Perspective"}, {"paperId": "3308709248acfc9725da739ebdacf8e4ee10a9f5", "title": "Communication-Efficient Vertical Federated Learning with Limited Overlapping Samples"}, {"paperId": "aafc2c50a03651f6051bfb7cfcc3ce04d2151772", "title": "Robust and IP-Protecting Vertical Federated Learning against Unexpected Quitting of Parties"}, {"paperId": "c133816f3ead6e4b0f17cfb946bddd05a3f389e5", "title": "Vertical Federated Knowledge Transfer via Representation Distillation for Healthcare Collaboration Networks"}, {"paperId": "aaea45f651ee017cefefd58966e5f6350c136bd9", "title": "FedPass: Privacy-Preserving Vertical Federated Deep Learning with Adaptive Obfuscation"}, {"paperId": "59099d7d197eda0c35d0ea4df9bf27ef8eaacfcc", "title": "Vertical Federated Learning: A Structured Literature Review"}, {"paperId": "f13f014f51dd425661e3202067c5ef5052fe4d6a", "title": "Vertical Federated Learning"}, {"paperId": "e467ad57b7872a48b5210af756f5260dad8a5ab4", "title": "A Survey on Heterogeneous Federated Learning"}, {"paperId": "5b8188d8167fe01408828df4aa969c48454cfe63", "title": "A Hybrid Self-Supervised Learning Framework for Vertical Federated Learning"}, {"paperId": "5e46bc1f60f6a06524f7947ab63ef5188d93f893", "title": "Emerging Trends in Federated Learning: From Model Fusion to Federated X Learning"}, {"paperId": "d8f99d69993531b179f713145c335a974d7932b1", "title": "ASCFL: Accurate and Speedy Semi-Supervised Clustering Federated Learning"}]}
