{"paperId": "c2da2a71a34576832f9b1c02c0405db4474dc63d", "publicationVenue": {"id": "1620da87-4387-4b9a-9bf4-22fdf74d4dc3", "name": "Symmetry", "type": "journal", "issn": "2073-8994", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172134", "alternate_urls": ["https://www.mdpi.com/journal/symmetry", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172134"]}, "title": "Applying Federated Learning in Software-Defined Networks: A Survey", "abstract": "Federated learning (FL) is a type of distributed machine learning approacs that trains global models through the collaboration of participants. It protects data privacy as participants only contribute local models instead of sharing private local data. However, the performance of FL highly relies on the number of participants and their contributions. When applying FL over conventional computer networks, attracting more participants, encouraging participants to contribute more local resources, and enabling efficient and effective collaboration among participants become very challenging. As software-defined networks (SDNs) enable open and flexible networking architecture with separate control and data planes, SDNs provide standardized protocols and specifications to enable fine-grained collaborations among devices. Applying FL approaches over SDNs can take use such advantages to address challenges. A SDN control plane can have multiple controllers organized in layers; the controllers in the lower layer can be placed in the network edge to deal with the asymmetries in the attached switches and hosts, and the controller in the upper layer can supervise the whole network centrally and globally. Applying FL in SDNs with a layered-distributed control plane may be able to protect the data privacy of each participant while improving collaboration among participants to produce higher-quality models over asymmetric networks. Accordingly, this paper aims to make a comprehensive survey on the related mechanisms and solutions that enable FL in SDNs. It highlights three major challenges, an incentive mechanism, privacy and security, and model aggregation, which affect the quality and quantity of participants, the security and privacy in model transferring, and the performance of the global model, respectively. The state of the art in mechanisms and solutions that can be applied to address such challenges in the current literature are categorized based on the challenges they face, followed by suggestions of future research directions. To the best of our knowledge, this work is the first effort in surveying the state of the art in combining FL with SDNs.", "venue": "Symmetry", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-01-20", "journal": {"name": "Symmetry", "pages": "195", "volume": "14"}, "authors": [{"authorId": "2109054405", "name": "Xiaohang Ma"}, {"authorId": "144961205", "name": "Lingxia Liao"}, {"authorId": "2145250162", "name": "Zhi Li"}, {"authorId": "2111717942", "name": "Xiaorong Lai"}, {"authorId": "2108160048", "name": "Miao Zhang"}], "citations": [{"paperId": "eb21ff10c6c72c559e36d9ecab5c039d3b234e3a", "title": "A review of SDN‐enabled routing protocols for Named Data Networking"}, {"paperId": "2c403fcfbad04a900910d595843597e0b5457127", "title": "The Performance Evaluation of Federated Identity Management in Securing Wireless Networks"}, {"paperId": "0cfb28b28d60d1b749e3cc7ca94197758dc7d796", "title": "Exploring the Landscape of AI-SDN: A Comprehensive Bibliometric Analysis and Future Perspectives"}, {"paperId": "b2c4cbdc46deae6b4101c3db3a2726c7509e2bb5", "title": "Fast Meta Failure Recovery for Federated Meta-Learning"}, {"paperId": "28513f83a2245de0bc00b2ad0831b40bc8ce6716", "title": "Collaborative Federated Learning-Based Model for Alert Correlation and Attack Scenario Recognition"}, {"paperId": "600618031bc84c6e3767b5258bc7931f47ea9b28", "title": "Federated Learning in Intelligent Transportation Systems: Recent Applications and Open Problems"}, {"paperId": "d4d24dd7611b9d0eb7a1df509d16e61950b01d33", "title": "Methodological Exploration of Social Value Measurement in Mobile Network Services: Application of Social Network Analysis and System Dynamics Methodology"}, {"paperId": "159b3e57cc1b9e914d141f486db6803efdb57d70", "title": "Improving the quality of Federated Learning processes via Software Defined Networking"}, {"paperId": "dfa73365b469067c4ac62ceb6b9d19f1d566c369", "title": "Special Issue Editorial \"Deep Learning Technologies for Mobile Networks: A Themed Issue in Honor of Prof. Han-Chieh Chao\""}, {"paperId": "4df945632602d7b476e53d0c31842d33368ce297", "title": "Leveraging ICN and SDN for Future Internet Architecture: A Survey"}, {"paperId": "d8dcf5eb6dd4b242dfedb4535bc66fcb682bc194", "title": "Tactile internet of federated things: Toward fine-grained design of FL-based architecture to meet TIoT demands"}, {"paperId": "d135ec27b06266dcc013431a7778fc37e5e79f70", "title": "Privacy-Enhancing Technologies in Federated Learning for the Internet of Healthcare Things: A Survey"}, {"paperId": "8d82134327a7bf584ee61dfe8dadf8f981f3d6e5", "title": "A Genetic Algorithm for the Waitable Time-Varying Multi-Depot Green Vehicle Routing Problem"}, {"paperId": "4d8403e50fbe2ae4a01b9c1f84573616a487f3f7", "title": "A Survey on 6G Enabled Light Weight Authentication Protocol for UAVs, Security, Open Research Issues and Future Directions"}, {"paperId": "5f36d62dcdce35d5d8ac89902757063632f64589", "title": "A comprehensive survey on software‐defined networking for smart communities"}, {"paperId": "aadf105aa210cb108a957d2cb3fcafd794e0dd72", "title": "DACFL: Dynamic Average Consensus-Based Federated Learning in Decentralized Sensors Network"}, {"paperId": "d1f88a3664a37f4762e67a6ccc50e6ae1b1def8d", "title": "A Review on Software Defined Content Delivery Network: A Novel Combination of CDN and SDN"}]}
