{"paperId": "c2dd4b8436443c05033317b1a13f82f5e1a18ee5", "publicationVenue": {"id": "7b2adce0-d53f-49d6-8784-b0645604fe62", "name": "ACM Computing Surveys", "type": "journal", "alternate_names": ["ACM Comput Surv"], "issn": "0360-0300", "url": "http://www.acm.org/pubs/surveys/", "alternate_urls": ["http://portal.acm.org/csur", "https://csur.acm.org/", "http://csur.acm.org/"]}, "title": "Machine Learning for Computer Systems and Networking: A Survey", "abstract": "Machine learning (ML) has become the de-facto approach for various scientific domains such as computer vision and natural language processing. Despite recent breakthroughs, machine learning has only made its way into the fundamental challenges in computer systems and networking recently. This article attempts to shed light on recent literature that appeals for machine learning-based solutions to traditional problems in computer systems and networking. To this end, we first introduce a taxonomy based on a set of major research problem domains. Then, we present a comprehensive review per domain, where we compare the traditional approaches against the machine learning-based ones. Finally, we discuss the general limitations of machine learning for computer systems and networking, including lack of training data, training overhead, real-time performance, and explainability, and reveal future research directions targeting these limitations.", "venue": "ACM Computing Surveys", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-03-09", "journal": {"name": "ACM Computing Surveys", "pages": "1 - 36", "volume": "55"}, "authors": [{"authorId": "41160131", "name": "Marios Evangelos Kanakis"}, {"authorId": "145559317", "name": "R. Khalili"}, {"authorId": "2158657094", "name": "Lin Wang"}], "citations": [{"paperId": "455a4007807d8ca4c583bbca29ac410277e90668", "title": "Multi-Agent Deep Reinforcement Learning for Coordinated Multipoint in Mobile Networks"}, {"paperId": "b165b8f2f713735a5d3c5934db2cf19a74288f08", "title": "In-Forest: Distributed In-Network Classification with Ensemble Models"}, {"paperId": "92b6f0115ae513f8049a3752ca46d0f97d153b5c", "title": "OpenData: A Framework to Train and Deploy ML Solutions in Wide-Area Networks"}, {"paperId": "11014da314f00cbe255f80f763868a87aacba597", "title": "Introducing Packet-Level Analysis in Programmable Data Planes to Advance Network Intrusion Detection"}, {"paperId": "60acbfc5468759de85094a344036ba84bdd30a0b", "title": "Henna: hierarchical machine learning inference in programmable switches"}, {"paperId": "bb3b5c25dee691c2f429f8396e1e7e327f43dd8e", "title": "HybridTSS: A Recursive Scheme Combining Coarse- and Fine- Grained Tuples for Packet Classification"}]}
