{"paperId": "c2e14d9aec12151c9d68bd037ac29609eddcc424", "publicationVenue": null, "title": "Designing a Water Temperature control and Monitoring System for Vaname Shrimp cultivation based on the Internet of Things ( IoT )", "abstract": "Vannamei shrimp cultivation (Litopenaeus Vannamei) is one of the rapidly growing industries in fisheries. Optimal water quality, including the appropriate water temperature, is a crucial factor in maintaining the growth and health of vannamei shrimp. Therefore, this research aims to design and implement a monitoring and water temperature control system using a microcontroller in vannamei shrimp cultivation. The research method involves the development of a system prototype consisting of water temperature sensors, microcontrollers, and temperature control modules. The water temperature sensor is used to measure the water temperature in the vannamei shrimp cultivation pond, while the microcontrollers are responsible for acquiring temperature data from the sensor and controlling the temperature control modules based on predetermined parameters. The research results show that the monitoring and water temperature control system using microcontrollers can accurately measure the water temperature with high precision. The obtained temperature data can be displayed in real-time through the microcontroller's screen or accessed via computer-based applications. Moreover, the system is also capable of adjusting the temperature according to the setpoint, utilizing LEDs lights (red, green, yellow) US indicators for activating and deactivating the heating and cooling device. in field trials, this system was implemented in vannamei shrimp cultivation ponds of a specific size.", "venue": "Jurnal Komputer dan Elektro Sains", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-24", "journal": {"name": "Jurnal Komputer dan Elektro Sains"}, "authors": [{"authorId": "2232870605", "name": "Suka Hermawan"}, {"authorId": "2232868032", "name": "Santi Rahmawati"}, {"authorId": "2232869038", "name": "Qhansa Aditia"}, {"authorId": "2217225123", "name": "B. Wibowo"}, {"authorId": "2121101776", "name": "Andrie Yuswanto"}], "citations": [{"paperId": "9598827ae45c396a6c4b725b8226f8da27e6559d", "title": "Design of monitoring system for controlling the Temperature of chicken coops based on Internet of Things by utilizing Thingspeak"}, {"paperId": "f01a7d119b526884d10c098da81f0f64e1de5943", "title": "Sistem Monitoring Pemakaian Energi Listrik Pada Kamar Kost Menggunakan Aplikasi Blynk Berbasis Internet of Things"}, {"paperId": "2d691a250c8c2ec52e311b4b6c17787be1f6cc8f", "title": "Pengumpan ikan otomatis untuk budidaya ikan di akuarium berbasis Internet of Things (IOT)"}]}
