{"paperId": "c302de6b55b4a9c019a1bee27c9955f893e37c18", "publicationVenue": {"id": "7b2adce0-d53f-49d6-8784-b0645604fe62", "name": "ACM Computing Surveys", "type": "journal", "alternate_names": ["ACM Comput Surv"], "issn": "0360-0300", "url": "http://www.acm.org/pubs/surveys/", "alternate_urls": ["http://portal.acm.org/csur", "https://csur.acm.org/", "http://csur.acm.org/"]}, "title": "A Systematic Review of Data Quality in CPS and IoT for Industry 4.0", "abstract": "The Internet of Things (IoT) and Cyber-Physical Systems (CPS) are the backbones of Industry 4.0, where data quality is crucial for decision support. Data quality in these systems can deteriorate due to sensor failures or uncertain operating environments. Our objective is to summarize and assess the research efforts that address data quality in data-centric CPS/IoT industrial applications. We systematically review the state-of-the-art data quality techniques for CPS and IoT in Industry 4.0 through a systematic literature review (SLR) study. We pose three research questions, define selection and exclusion criteria for primary studies, and extract and synthesize data from these studies to answer our research questions. Our most significant results are (i) the list of data quality issues, their sources, and application domains, (ii) the best practices and metrics for managing data quality, (iii) the software engineering solutions employed to manage data quality, and (iv) the state of the data quality techniques (data repair, cleaning, and monitoring) in the application domains. The results of our SLR can help researchers obtain an overview of existing data quality issues, techniques, metrics, and best practices. We suggest research directions that require attention from the research community for follow-up work.", "venue": "ACM Computing Surveys", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-04-19", "journal": {"name": "ACM Computing Surveys", "pages": "1 - 38", "volume": "55"}, "authors": [{"authorId": "1753664", "name": "Arda Goknil"}, {"authorId": "2180877337", "name": "Phu H. Nguyen"}, {"authorId": "2116371412", "name": "Sagar Sen"}, {"authorId": "2274455412", "name": "Dimitra Politaki"}, {"authorId": "1708105", "name": "H. Niavis"}, {"authorId": "2202390751", "name": "Karl John Pedersen"}, {"authorId": "71949343", "name": "Abdillah Suyuthi"}, {"authorId": "2202770403", "name": "Abhilash Anand"}, {"authorId": "2052715393", "name": "Amina Ziegenbein"}], "citations": [{"paperId": "126e54319b87bb5c90fe9cfbceaa291a9754898a", "title": "Deep iterative fuzzy pooling in unmanned robotics and autonomous systems for Cyber-Physical systems"}, {"paperId": "33b1d3e625a26caae3b7c0107674fa43c5a91e8f", "title": "Odor-Based Molecular Communications: State-of-the-Art, Vision, Challenges, and Frontier Directions"}, {"paperId": "1810d755cda46ef219150125e008dfbf805c68c0", "title": "Edge-based Data Profiling and Repair as a Service for IoT"}, {"paperId": "aa5191cf10db7b2cf293c336321cfce2410ae68b", "title": "Enhancing Decision-Making with Data Science in the Internet of Things Environments"}]}
