{"paperId": "c3068c7947ca290496c4d0280904686ba0b2903f", "publicationVenue": {"id": "3779a5a7-9119-4f69-84fe-f7eef193eb49", "name": "Conference on Computational Natural Language Learning", "type": "conference", "alternate_names": ["CoNLL", "Conf Comput Nat Lang Learn"]}, "title": "Mind the instructions: a holistic evaluation of consistency and interactions in prompt-based learning", "abstract": "Finding the best way of adapting pre-trained language models to a task is a big challenge in current NLP. Just like the previous generation of task-tuned models (TT), models that are adapted to tasks via in-context-learning (ICL) or instruction tuning (IT) are robust in some setups, but not in others. Here, we present a detailed analysis of which design choices cause instabilities and inconsistencies in LLM predictions. First, we show how spurious correlations between input distributions and labels – a known issue in TT models – form only a minor problem for prompted models. Then we engage in a systematic, holistic evaluation of different factors that have been found to influence predictions in a prompting setup. We test all possible combinations of a range of factors on both vanilla and instruction-tuned LLMs of different scale, and statistically analyse the results to show which factors are the most influential, the most interactive or the most stable. From our results, we deduce which factors can be used without precautions, should be avoided or handled with care in most settings.", "venue": "Conference on Computational Natural Language Learning", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-10-20", "journal": {"name": "ArXiv", "volume": "abs/2310.13486"}, "authors": [{"authorId": "2261081927", "name": "Lucas Weber"}, {"authorId": "2173646563", "name": "E. Bruni"}, {"authorId": "3449411", "name": "Dieuwke Hupkes"}], "citations": [{"paperId": "4c0f88e80320885e8289a9af781a1101717104f2", "title": "tinyBenchmarks: evaluating LLMs with fewer examples"}, {"paperId": "30bfb0a8801c8e8ba65a6009027839ac34cd374e", "title": "On Sensitivity of Learning with Limited Labelled Data to the Effects of Randomness: Impact of Interactions and Systematic Choices"}, {"paperId": "18b3b96ffb28c785452081aa367cbc02a1cf7567", "title": "MERA: A Comprehensive LLM Evaluation in Russian"}, {"paperId": "117a9f9227ebe4acc67ff8a52eb9db2ab16390c8", "title": "Data Management For Large Language Models: A Survey"}, {"paperId": "44ffd3cd333bb41b900926556edb1c452759c398", "title": "WorldSense: A Synthetic Benchmark for Grounded Reasoning in Large Language Models"}, {"paperId": "9383e05fbeef79240721a51353f011618f80c142", "title": "Measuring the Robustness of NLP Models to Domain Shifts"}]}
