{"paperId": "c3286938627288925384a610059c490452100605", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Study on Abnormal Pattern Detection Method for In-Service Bridge Based on Lasso Regression", "abstract": "The real-time operational safety of in-service bridges has received wide attention in recent years. By fully utilizing the health monitoring data of bridges, a structural abnormal pattern detection method based on data mining can be established to effectively ensure the safety of in-service bridges. This paper takes a large-span arch bridge as the research object, analyzes the time-based variation of the main monitoring data of the structure, establishes Lasso regression models for load characteristic indicators and vertical bending fundamental frequency of the structure under different time scales, and uses the residuals of the Lasso model to indicate the structural state and identify abnormal patterns. Firstly, the monitoring data of bridge structural temperature, girder end displacement, and girder acceleration were analyzed, and the interrelationships were studied to extract characteristic parameters of structural load characteristics and structural frequency. Then, the time-varying patterns of structural response were analyzed, and Lasso regression models and their regression variables were discussed based on monitoring data under two different time scales: daily cycle and annual cycle. The abnormal pattern detection method for bridge structures was developed. Finally, the effectiveness of this method was verified by taking the bridge deck pavement replacement as the abnormal pattern. The research results indicate that the proposed bridge structure abnormal pattern detection method based on Lasso regression can effectively monitor changes in the state of the bridge, and the residual dispersion of the model established on the annual cycle scale is relatively smaller than that on the daily cycle scale, resulting in better abnormal detection performance.", "venue": "Applied Sciences", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-03-27", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "2294155426", "name": "Huaqiang Zhong"}, {"authorId": "2294181080", "name": "Hao Hu"}, {"authorId": "2293988508", "name": "Ning Hou"}, {"authorId": "2294050389", "name": "Ziyuan Fan"}], "citations": []}
