{"paperId": "c32819ed1541a74c442b32b322e83716ca58d009", "publicationVenue": {"id": "8bc59e8b-e251-4201-839a-ec83ae78859d", "name": "Complex", "type": "conference", "alternate_names": ["Int Conf Complex Sci", "International Conference on Complex Sciences"], "issn": "0806-1912", "alternate_issns": ["1538-6848"], "url": "http://wo.uio.no/as/WebObjects/nettlogg.woa/1/wa/logg?logg=5904", "alternate_urls": ["http://www.wikicfp.com/cfp/program?id=545", "https://www.complex.com/"]}, "title": "Analysis and Design of the Battery Initial Energy Level with Task Scheduling for Energy-Harvesting Embedded Systems", "abstract": "When the energy-harvesting embedded system (EHES) is running, its available energy (harvesting energy and battery storage energy) seems to be sufficient overall. However, in the process of EHES task execution, an energy shortage may occur in the busy period such that system tasks cannot be scheduled. We call this issue the energy deception (ED) of the EHES. Aiming to address the ED issue, we design an appropriate initial energy level of the battery. In this paper, we propose three algorithms to judge the feasibility of the task set and calculate the appropriate initial energy level of the battery. The holistic energy evaluation (HEE) algorithm makes a preliminary judgment of the task set feasibility according to available energy and consumption energy. A worst-case response time-based initial energy level of the battery (WCRT-IELB) algorithm and an accurate cycle-initial energy level of the battery (AC-IELB) algorithm can calculate the proper initial battery capacity. We use the YARTISS tool to simulate the above three algorithms. We conducted 250 experiments on As Late As Possible (ALAP) and As Soon As Possible (ASAP) scheduling with the maximum battery capacities of 50, 100, 200, 300, and 400. The experimental results show that setting a reasonable initial energy level of the battery can effectively improve the feasibility of the task set. Among the 250 task sets, the HEE algorithm filtered 2.8% of them as infeasible task sets. When the battery capacity is set to 400, the WCRT-BIEL algorithm increases the success rates of the ALAP and ASAP by 17.2% and 26.8%, respectively. The AC-BIEL algorithm increases the success rates of the ALAP and ASAP by 18% and 26.8%, respectively.", "venue": "Complex", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-04-15", "journal": {"name": "Complex.", "pages": "5580631:1-5580631:16", "volume": "2021"}, "authors": [{"authorId": "40129763", "name": "Xingyu Miao"}, {"authorId": "32573376", "name": "Jiayuan Wei"}, {"authorId": "2289482", "name": "Yongqi Ge"}], "citations": []}
