{"paperId": "c336977958de1772b4f1af9efdee5e9fd23a4577", "publicationVenue": {"id": "da18ef0b-933e-4678-b2fa-4290baf6970a", "name": "International Conference on Communication, Computing & Security", "type": "conference", "alternate_names": ["Int Conf Commun Comput  Secur", "International Conference Communication and Computing Systems", "ICCCS", "International Conference on Computer and Communication Systems", "Int Conf Comput Commun Syst", "Int Conf Commun Comput Syst"]}, "title": "IoT Based Foot Neuropathy Analysis and Remote Monitoring of Foot Pressure and Temperature", "abstract": "Diabetes is one of the major causes of premature illness and death worldwide. It brings with its neurovascular complications, which result in the development of high-pressure areas in the feet and hands. Pedobarography is the study of pressure fields acting between the surface of the foot and a supporting surface. Patients with diabetic neuropathy often lose sensations in their feet while walking or standing, because peripheral neuropathy causes nerve damage in arms and legs. If not treated correctly, it could cause injury in the feet and eventually result in ulceration and even amputation. The main objective behind writing this paper is to design and build a lowcost pressure along with the temperature measurement and analysis system using IoT based open source development boards interfacing with multiple sensors connected to the cloud to provide real-time data which a patient, as well as the nearest health centre, can utilize to measure his or her foot pressure and temperature sensitivity which will be helpful for the diabetic patient who generally has uneven pressure distribution on the feet and usually has pain or numbness in their feet. These cloudbased monitoring systems can be accessed to examine and track the severity of the patient and provide a preventive measure’s list for the same.", "venue": "International Conference on Communication, Computing & Security", "year": 2020, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-10-14", "journal": {"name": "2020 5th International Conference on Computing, Communication and Security (ICCCS)", "pages": "1-6"}, "authors": [{"authorId": "9069170", "name": "G. Kukreja"}, {"authorId": "2005515607", "name": "Atulya Alok"}, {"authorId": "144403979", "name": "A. Reddy"}, {"authorId": "12448092", "name": "Ruban Nersisson"}], "citations": [{"paperId": "4b79190a2dc8d62e7129a2e3c6f9adb4e8570a52", "title": "Smart Gadget for Tracking and Primary Treatment of Diabetic Foot Ulcers"}, {"paperId": "3d98c652f5b6b4a592ae54e253f87438a6fcc3e2", "title": "Responsive Transcutaneous Electrical Stimulation for Management of Diabetic Foot Neuropathy"}, {"paperId": "9c3d3ad85236d003c1ea18d1de049ac98c2217af", "title": "Machine Learning Implementation of a Diabetic Patient Monitoring System Using Interactive E-App"}]}
