{"paperId": "c336aca16dda3f03c16eb270228ad44bd3186b7a", "publicationVenue": {"id": "e1882330-de0e-49a0-be92-edc862edc88d", "name": "Internet Research", "type": "journal", "alternate_names": ["Internet Res"], "issn": "1066-2243", "url": "https://www.emerald.com/insight/publication/issn/1066-2243"}, "title": "A meta-analysis of antecedents and consequences of trust in the sharing economy", "abstract": "PurposeTrust plays a crucial role in overcoming uncertainty and reducing risks. Uncovering the trust mechanism in the sharing economy may enable sharing platforms to design more effective marketing strategies. However, existing studies have inconsistent conclusions on the trust mechanism in the sharing economy. Therefore, this study aims to investigate the antecedents and consequences of different dimensions of trust (trust in platform and trust in peers) in the sharing economy.Design/methodology/approachFirst, we conducted a meta-analysis of 57 related articles. We tested 13 antecedents of trust in platform (e.g. economic benefits, enjoyment, and information quality) and eight antecedents of trust in peers (e.g. offline service quality and providers’ reputation), as well as their consequences. Then, we conducted subgroup analyses to test the moderating effects of economic development level (Developed vs Developing), gender (Female-dominant vs Male-dominant), platform type (Accommodation vs Transportation), role type (Obtainers vs Providers), and uncertainty avoidance (Strong vs Weak).FindingsThe results confirm that all antecedents and consequences significantly affect trust in platform or peers to varying degrees. Moreover, trust in platform greatly enhances trust in peers. Besides, the results of the moderating effect analyses demonstrate the variability of antecedents and consequences of trust under different subgroups.Originality/valueThis paper provides a clear and holistic view of the trust mechanism in the sharing economy from an object-based trust perspective. The findings may offer insights into trust-building in the sharing economy.", "venue": "Internet Research", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-02-21", "journal": {"name": "Internet Research"}, "authors": [{"authorId": "2258450758", "name": "Jiang Jiang"}, {"authorId": "2257892688", "name": "Eldon Y. Li"}, {"authorId": "2283425064", "name": "Li Tang"}], "citations": [{"paperId": "2c363494b56cc64ac5c6ed9478c0227351fea4af", "title": "How the Personalities and Behaviors of Information Systems Professionals Influence the Effectiveness of Information Systems Departments"}]}
