{"paperId": "c36866d28fdc88bd903962f37243af11d8360e4e", "publicationVenue": null, "title": "Prediction Analysis Sales for Corporate Services Telecommunications Company using Gradient Boost Algorithm", "abstract": "Sales prediction analysis requires smart data mining techniques with accurate prediction models and high reliability. Essentially, most market segments rely on the knowhow base and the demand trend forecast for analysis of Business To Business (B2B) sales data. Data are provided by sales on how Telecommunication Company should manage its sales team, its products and also its budgeting flows. Precise estimates make it possible for Telecommunication Company to survive the market war and increase its market growth. In this research, the study and analysis of comprehensible predictive models use machine learning techniques to improve future sales predictions. Traditional forecasting systems are difficult to deal with big data and the accuracy of sales forecasting. In this paper, a brief analysis of the reliability of B2B sales using machine learning techniques. The latter part of this research explains a range of sales prediction strategies and interventions. Based on the performance assessment, a best-adapted predictive model for the B2B sales trend forecast is suggested. Projection, estimation and analysis findings are summarized in terms of reliability and consistency of efficient prediction and forecasting techniques. The results of this analysis are expected to generate reliable, accurate and effective forecasting data, a valuable resource for sales predictions. Research has shown that Gradient Boost Algorithm shows good accuracy in forecasting and future B2B sales prediction with MSE = 24,743,000,000.00, and MAPE: 0.18.", "venue": "2020 2nd International Conference on Broadband Communications, Wireless Sensors and Powering (BCWSP)", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2020-09-28", "journal": {"name": "2020 2nd International Conference on Broadband Communications, Wireless Sensors and Powering (BCWSP)", "pages": "101-106"}, "authors": [{"authorId": "2023753792", "name": "Oryza Wisesa"}, {"authorId": "38984772", "name": "A. Adriansyah"}, {"authorId": "116223561", "name": "O. Khalaf"}], "citations": [{"paperId": "26fc8d0807a630e81e42df0b5c2cf8f8bd5cbcfb", "title": "A Survey for Redefining Success Metrics: B2B Sales in the Machine Learning Era"}, {"paperId": "1bc8f3200b63b254fe1033025444e6dc878d2b37", "title": "Time-aware forecasting of search volume categories and actual purchase"}, {"paperId": "45acc1a5ee56424a0bd85d19d4a553bc189be1c8", "title": "Sales Prediction Based on Data Mining Techniques"}, {"paperId": "ff01d245885ec14d979b8518322bce10529fcea1", "title": "Analysis of demographic groups for different markets using machine learning techniques"}, {"paperId": "e02ac2cad7f9339866f356c6799f0ef787fe1650", "title": "A Novel Dairy Supply Chain Portal for Prediction of Milk Requirement"}, {"paperId": "c55fd011a920577979f1ec2ad4a77e0e3160ef9c", "title": "Computational Intelligence Based Recurrent Neural Network for Identification Deceptive Review in the E-Commerce Domain"}, {"paperId": "7c8d2b17554ba43db3d9c7279cf81c539fb39f28", "title": "Maximum Likelihood Estimates and a survival function for fuzzy data for the Weibull-Pareto parameters"}, {"paperId": "60cc33f5403a275ed32628d813940607a4a68c7d", "title": "Control of Material Procurement Cost of Enterprises under the Background of the Low-Carbon Economy"}, {"paperId": "5450df65e55339ddae00d1adf5360126a981699d", "title": "Secured and Privacy-Based IDS for Healthcare Systems on E-Medical Data Using Machine Learning Approach"}, {"paperId": "c3cf78a5a4d0af58d3566f4225c7055f5e952348", "title": "Financial Big Data Management and Control and Artificial Intelligence Analysis Method Based on Data Mining Technology"}, {"paperId": "dfe81c940de026609298d185a9a89cc5421e6a4e", "title": "Risk prediction in financial management of listed companies based on optimized BP neural network under digital economy"}, {"paperId": "4f3d3cb6d8deb87788fc5f14f3d4f6fe6c67264e", "title": "Risk Identification and Application of Farmland Management Right Mortgage Loan Based on Neural Network"}, {"paperId": "3184c481b62ca2c022a091205a4b0a3fd6874b95", "title": "Design of Embedded Ai Engine Based on the Microkernel Operating System"}, {"paperId": "e0e2cfa14fb953459865db217cf3ddebed1f8678", "title": "Enterprise Collaborative Integrated Management System Based on IoT Cloud Technology"}, {"paperId": "56fba9c3cc55d27b502648bc5a1ce070b56b1957", "title": "Who will Win the Data Science Competition? Insights from KDD Cup 2019 and Beyond"}, {"paperId": "efa1e92a81a3f65989d169bf0133c6cc7b8cc6bc", "title": "Brand Marketing Decision Support System Based on Computer Vision and Parallel Computing"}, {"paperId": "0008f069cf3e6a2a37b572f1a0990b68bc31e119", "title": "Data Mining Techniques with Electronic Customer Relationship Management for Telecommunication Company"}, {"paperId": "d6a90b3d528abe088dad310138a2b78eeda9fde0", "title": "Theme Identification using Machine Learning Techniques"}, {"paperId": "1aab4c7634f84cbcbedde0864fe27c625da374d7", "title": "VLSI Implementation of a High-Performance Nonlinear Image Scaling Algorithm"}, {"paperId": "0759ede1e63120103b12994a0cdc820269134061", "title": "Chest CT Findings and Differential Diagnosis of Mycoplasma pneumoniae Pneumonia and Mycoplasma pneumoniae Combined with Streptococcal Pneumonia in Children"}, {"paperId": "feafe4276bb6cc54b3ccc2dfbb49d4b5aa97c3fe", "title": "Research on the Natural Language Recognition Method Based on Cluster Analysis Using Neural Network"}, {"paperId": "1b3b4d7bf37bc34b98c5c38c7582d20b75a00f3e", "title": "Impact of high-performance work practices in human resource management of health dispensaries in Qassim Region, Kingdom of Saudi Arabia, towards organizational resilience and productivity"}, {"paperId": "e4906fca10794f84aa34e5f2ed59004828c01481", "title": "Wearable Wireless Body Area Networks for Medical Applications"}, {"paperId": "041c444d4c7cd6de127fb517941d903ab275fdd1", "title": "Accurate and Effective Data Collection with Minimum Energy Path Selection in Wireless Sensor Networks using Mobile Sinks"}, {"paperId": "4357fb13d5bd89a4f7e64d61de0d855d778f9aee", "title": "The role of Muslim women in managing the family during crisis: corona pandemic as a model"}, {"paperId": "6437f45e1e79f76871cff670e8131a3a8d0580a8", "title": "Relation between cracks behavior and curvature in cracked concrete arch dam under earthquake"}, {"paperId": "177556644f0489493fa6e47ce93fc165a72f9152", "title": "Minimizing network traffic overload and packet loss in wireless asynchronous traffic mode using switching model with adopted multiple access control approach"}, {"paperId": "505446791f4f65c7f368968a1ebf7f96c689acf8", "title": "RETRACTED ARTICLE: Impact of Covid-19 on Airbnb: evidence from Vietnam"}, {"paperId": "6e481d92a39e00d6f1f81e22363786790839ab95", "title": "The evaluation strategy of buildings based on the objectives of the UK building research"}, {"paperId": "9f64dc3597b7ae2e1410d852e916b03ab547e2b4", "title": "Impacts of monetary instruments on overnight spread under the interest rate corridor framework: evidence from China"}, {"paperId": "12052bceb90ed434554352585653f4a1bc564201", "title": "Smart Healthcare Security Device on Medical IoT Using Raspberry Pi"}, {"paperId": "2cdb0c1d16564c5e8ba7bb71f7ef7385f7d1f044", "title": "Security-Aware Routing on Wireless Communication for E-Health Records Monitoring Using Machine Learning"}, {"paperId": "00e6128e15d3a7017a6a98fbf05905d33a588673", "title": "Review and analysis of artificial intelligence methods for demand forecasting in supply chain management"}]}
