{"paperId": "c368b491939d741268e9b6fbc2dcab7daf181408", "publicationVenue": {"id": "9edb146e-1733-42d6-9ac6-91bced84ca22", "name": "Web Science Conference", "type": "conference", "alternate_names": ["Web Sci", "Web Science", "Web Sci Conf", "WebSci"]}, "title": "Detecting Symptoms of Depression on Reddit", "abstract": "Depression is known to have heterogeneous symptom manifestations. Investigating various symptoms of depression is essential to understanding underlying mechanisms and personalizing treatments. Reddit, an online peer-to-peer social media platform, contains varied communities (subreddits) where individuals discuss their detailed mental health experiences and seek support. The current paper has two aims. The first is to identify psycho-linguistic and open-vocabulary language markers associated with different symptoms using 1,318,749 posts from 43 subreddit communities (e.g., r/bingeeating) clustered into 13 expert-validated depression symptoms (e.g., disordered eating). The second aim is to develop prediction models based on the above linguistic features and RoBERTa embeddings to detect specific symptom discourse in contrast to control subreddit posts contributed by the same Reddit users. These predictive models are then validated on a second sample of individuals (N = 2,986) who shared their Facebook posts and completed self-report depression (PHQ-9), anxiety (GAD-7), and loneliness (UCLA-3) surveys. Based on the differential linguistic patterns that emerged across the various symptoms in our data, we identified three potential clusters, which could also be mapped to the Research Domain Criteria (RDoC) framework. RoBERTa embeddings demonstrated the highest accuracy at predicting most symptoms and were particularly robust at predicting the severity of suicidal thoughts and attempts, self-loathing, loneliness, and disordered eating. Our study demonstrates the potential of using large, pseudonymous online forums to train language-based symptom-estimation machine-learning models that can be applied to other text sources. Such technologies could be helpful in clinical psychology, population health, and other areas where early mental health monitoring could improve diagnosis, risk reduction, and treatment.", "venue": "Web Science Conference", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Review"], "publicationDate": "2023-04-30", "journal": {"name": "Proceedings of the 15th ACM Web Science Conference 2023"}, "authors": [{"authorId": "2115432852", "name": "Tingting Liu"}, {"authorId": "2058986369", "name": "Devansh Jain"}, {"authorId": "2164371482", "name": "Shivani R Rapole"}, {"authorId": "2053093153", "name": "Brenda L. Curtis"}, {"authorId": "2615635", "name": "J. Eichstaedt"}, {"authorId": "143857273", "name": "Pallavi V. Kulkarni"}, {"authorId": "2008166098", "name": "Sharath Chandra Guntuku"}], "citations": [{"paperId": "7798dc4f3fd72807d90219df0b95407a174be29a", "title": "Studying Differential Mental Health Expressions in India"}, {"paperId": "d87f10aeab9fa14344c6393759e44269b80b4c56", "title": "More than Just a Diagnosis: A Multi-Task Approach to Analyzing Bipolar Disorder on Reddit via DeMHeM"}, {"paperId": "5f464e88001b1658550f8d12d131e90aa9d310f9", "title": "Utilizing ChatGPT Generated Data to Retrieve Depression Symptoms from Social Media"}]}
