{"paperId": "c370bc506e8fcd5cb003f254c9b680ec9d8dbe18", "publicationVenue": null, "title": "Machine Learning Using Big Data Link Stability Based Node Observation for IoT Security", "abstract": "IoT systems create a multi-hop organizational structure among mobile devices in required to send on data groups. The remarkable properties of gadgets frameworks cause communications to interconnect among competing handheld devices. Most physiological directing displays don’t believe secure associations all through bundle communication to organize high communicate ability and genetic blocks that also prompts increased delay as well as bundle decreasing in mastermind. Only with continued growth and transformation of IoT networks, attacks on such IoT systems are increasing at an alarming rate. Our purpose will provide researchers with a research resource on latest research patterns in IoT security. As the primary driver of with us research problem concerning IoT security as well as machine learning. This analysis of the literature among the most research literature in IoT security recognized some very key current research which will generate organizational investigations. Only with fast emergence of different IoT threats, it is essential to develop frameworks that could integrate cutting-edge big data analytics and machine learning advanced technologies. Effectiveness are critical quality variables in shaping the best methods and algorithms for detecting IoT threats in real-time or close to real time.", "venue": "Recent Trends in Intensive Computing", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-12-01", "journal": {"name": "Recent Trends in Intensive Computing"}, "authors": [{"authorId": "1381788236", "name": "R. Ganesh Babu"}, {"authorId": "48375371", "name": "S. Yuvaraj"}, {"authorId": "2122522845", "name": "A. Vedanthsrivatson"}, {"authorId": "2143148377", "name": "T. Ramachandran"}, {"authorId": "31931073", "name": "G. Vikram"}, {"authorId": "2143129534", "name": "N. Niffarudeen"}], "citations": []}
