{"paperId": "c3783b0aea345e39fcc53eb3c0d650bf0140eb36", "publicationVenue": {"id": "55983beb-4c10-467e-be85-97609fdad652", "name": "International Conference on Modelling and Simulation", "type": "conference", "alternate_names": ["Modelling and Simulation", "UKSim", "Int Conf Model Simul", "international conference on Modelling and simulation", "int conf Model simul"]}, "title": "Two Class Fisher's Linear Discriminant Analysis Using MapReduce", "abstract": "Information explosion propelled by the exponential growth in digitised data is an unstoppable reality. To be able to extract relevant and useful knowledge from this voluminous data in order to make well-informed decision is a competitive advantage in the information age. However, the attempts to transform raw data into valuable knowledge face both data and computational intensive challenges. As a result, parallel and distributed computing is often strongly sought after to alleviate these challenges. While there are many distributed computing technologies being proposed over the years, MapReduce has gained an immense amount of interest in recent years due to its simplicity and superb scalability at low cost. In this paper we implement the fisher linear discriminant technique to reduce dimensionality and remove the so-called \"noisy\" data values from a given data set and project the data values in the direction of largest variance. Few of Fisher linear discriminant analysis' applications are Life Sciences, Face Recognition, Music and Speech classification. We implement the Fisher Linear Discriminant on a distributed computing environment and we conclude that it outperforms the sequential implementation.", "venue": "International Conference on Modelling and Simulation", "year": 2015, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2015-03-25", "journal": {"name": "2015 17th UKSim-AMSS International Conference on Modelling and Simulation (UKSim)", "pages": "463-469"}, "authors": [{"authorId": "2443228", "name": "P. Anchalia"}, {"authorId": "2061563296", "name": "K. Roy"}, {"authorId": "2206017691", "name": "Kunal Roy"}], "citations": [{"paperId": "9cf6bc89e8c7a7c9e626c06f0ef03f2e85f1795e", "title": "Tutorial - Shodhguru Labs: Knowledge-infused Artificial Tutorial - Shodhguru Labs: Knowledge-infused Artificial Intelligence for Mental Healthcare Intelligence for Mental Healthcare"}, {"paperId": "e9d73bd0ded12a8e0cc4933f9bcb55b9d4ed3383", "title": "Tutorial: Knowledge-infused Artificial Intelligence for Mental Healthcare"}]}
