{"paperId": "c39633990c2dc48814e8316a4b6f0e3780c437b8", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Predicting Student Performance in Online Learning: A Multidimensional Time-Series Data Analysis Approach", "abstract": "As an emerging teaching method, online learning is becoming increasingly popular among learners. However, one of the major drawbacks of this learning style is the lack of effective communication and feedback, which can lead to a higher risk of students failing or dropping out. In response to this challenge, this paper proposes a student performance prediction model based on multidimensional time-series data analysis by considering multidimensional data such as students’ learning behaviors, assessment scores, and demographic information, which is able to extract the characteristics of students’ learning behaviors and capture the connection between multiple characteristics to better explore the impact of multiple factors on students’ performance. The model proposed in this paper helps teachers to individualize education for students at different levels of proficiency and identifies at-risk students as early as possible to help teachers intervene in a timely manner. In experiments on the Open University Learning Analytics Dataset (OULAD), the model achieved 74% accuracy and 73% F1 scores in a four-category prediction task and was able to achieve 99.08% accuracy and 99.08% F1 scores in an early risk prediction task. Compared with the benchmark model, both the multi-classification prediction ability and the early prediction ability, the model in this paper has a better performance.", "venue": "Applied Sciences", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-03-16", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "9415281", "name": "Zhaoyu Shou"}, {"authorId": "2293268395", "name": "Mingquan Xie"}, {"authorId": "2142803475", "name": "Jia-Jie Mo"}, {"authorId": "2244266069", "name": "Huibing Zhang"}], "citations": []}
