{"paperId": "c3ac3ecc7b10b0349cc5424714ebb8cb7c673589", "publicationVenue": {"id": "9cc701cf-1f49-4121-8ea9-11bac24d61ad", "name": "IEEE Transactions on Big Data", "type": "journal", "alternate_names": ["IEEE Trans Big Data"], "issn": "2332-7790", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=6687317", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6687317", "https://ieeexplore.ieee.org/xpl/aboutJournal.jsp?punumber=6687317"]}, "title": "Effective Prediction of Missing Data on Apache Spark over Multivariable Time Series", "abstract": "More massive volume of data are generated in many areas than ever before. However, the missing of some values in collected data always occurs in practice and challenges extracting maximal value from these large scale data sets. Nevertheless, in multivariable time series, most of the existing methods either might be infeasible or could be inefficient to predict the missing data. In this paper, we have taken up the challenge of missing data prediction in multivariable time series by employing improved matrix factorization techniques. Our approaches are optimally designed to largely utilize both the internal patterns of each time series and the information of time series across multiple sources. Based on the idea, we have imposed three different regularization terms to constrain the objective functions of matrix factorization and built five corresponding models. Extensive experiments on real-world data sets and synthetic data set demonstrate that the proposed approaches can effectively improve the performance of missing data prediction in multivariable time series. Furthermore, we have also demonstrated how to take advantage of the high processing power of Apache Spark to perform missing data prediction in large scale multivariable time series.", "venue": "IEEE Transactions on Big Data", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-12-01", "journal": {"name": "IEEE Transactions on Big Data", "pages": "473-486", "volume": "4"}, "authors": [{"authorId": "33816325", "name": "Weiwei Shi"}, {"authorId": "2116511169", "name": "Yongxin Zhu"}, {"authorId": "144019071", "name": "Philip S. Yu"}, {"authorId": "1718428", "name": "Jiawei Zhang"}, {"authorId": "2109026285", "name": "Tian Huang"}, {"authorId": "2146409955", "name": "Chang Wang"}, {"authorId": "2109122440", "name": "Yufeng Chen"}], "citations": [{"paperId": "fcee145b63ec9574f1578ca125b0b659dcd9d514", "title": "Efficacy of statistical algorithms in imputing missing data of streamflow discharge imparted with variegated variances and seasonalities"}, {"paperId": "45fa9d2a57bcc32b09f75a21747378330abc1a78", "title": "Nested Random Forest: A Personalized Imputation Method for Missing Data"}, {"paperId": "a6e22faaacf2e12b987eb49c793748acab3804c0", "title": "A dual-stage attention-based Bi-LSTM network for multivariate time series prediction"}, {"paperId": "0d7f108db4e95d8b935921ed79885f245629d47e", "title": "Multivariate temporal data classification framework for ozone level prediction"}, {"paperId": "5f1b59a15f7a372be5ab7977b624afe14eb43c44", "title": "Establishment of an Internet-Based Epidemiological Survey Data Collection Customized System Model"}, {"paperId": "2866c88b52ce7bc04ddd9137f678e0dc1d1e91fe", "title": "Missing Data Completion Based on Nonlinear Feature Space Mapping for the Power Grid"}, {"paperId": "fcc3e7e2faed5127715d6ad770794c5c81d87fc3", "title": "Online Traffic Flow Prediction for Edge Computing-Enhanced Autonomous and Connected Vehicles"}, {"paperId": "cbc69e301feb647e7a6202afe6cb4f3a21594c73", "title": "A Novel Approach Based on Matrix Factorization for Recovering Missing Time Series Sensor Data"}, {"paperId": "ede5cb30df059f52955d71adf2b24c501847566b", "title": "Missing Data Recovery Based on Probability Matrix Factorization Algorithm with prior information fusion"}, {"paperId": "a29309dbf1b94d8210b85e4ea18ccbab7a7f134b", "title": "An improved parallel matrix factorization method for data imputation of multivariable time series data with high level noises"}, {"paperId": "fa3eb492da6f42fc960f3dd30fb6e473f2532b16", "title": "A Spatiotemporal Causality Based Governance Framework for Noisy Urban Sensory Data"}, {"paperId": "0e71a8089051222316ae92a51b54f10e46e56fa7", "title": "Imputation Using Machine Learning Techniques"}, {"paperId": "de14be16d1f81f06173b56cc333a1b962fe3a1c8", "title": "Atomic Predicates-Based Data Plane Properties Verification in Software Defined Networking Using Spark"}, {"paperId": "82bde72dcb60f31b62c4a84798c278faf1d0500d", "title": "Big data time series forecasting based on pattern sequence similarity and its application to the electricity demand"}, {"paperId": "2216495f206ea2e2fde18a81a0563422bf4a1938", "title": "Cloud-Centric IoT-Based Green Framework for Smart Drought Prediction"}, {"paperId": "fb48a7215abe015ccc52525a91fa0521125f0269", "title": "Weather forecasting using parallel and distributed analytics approaches on big data clouds"}, {"paperId": "3c7db54d325ffe05e12e28f71b2b23880e4d5ac4", "title": "2018 Index IEEE Transactions on Big Data Vol. 4"}, {"paperId": "1e1e7091ad29b5550a2181d659a902f89ae8a031", "title": "A Periodicity-based Parallel Time Series Prediction Algorithm in Cloud Computing Environments"}, {"paperId": "1d0170181430c12bc85ee0844caac4e24f26b78f", "title": "An Efficient Missing Data Prediction Method Based on Kronecker Compressive Sensing in Multivariable Time Series"}, {"paperId": "20f51c433ecf6416301bd0f32f37603b9b69544e", "title": "Missing and Incomplete Data Handling in Cybersecurity Applications"}, {"paperId": "b908d70ab3688364e59b31afbc0988d77903e70f", "title": "Cooperative Design, Visualization, and Engineering: 17th International Conference, CDVE 2020, Bangkok, Thailand, October 25–28, 2020, Proceedings"}, {"paperId": "4b7af0b1ce02b9539ab4a4c5b15b65ce2d2a5300", "title": "Clustering of Time-Series Balance History Data Streams Using Apache Spark"}, {"paperId": "0126bfe893d1c2511f9c0ad1a7018b99fc90bf5f", "title": "Imputation of missing data in time series by different computation methods in various data set applications"}, {"paperId": "a4e568258517c81b299985f30b7944dbe7fc311f", "title": "A REVIEW ON PREDICTION OF MISSING DATA IN MULTIVARIABLE TIME SERIES"}]}
