{"paperId": "c3cd8a7d37a017a5cdc5f1ad3013acaebbced679", "publicationVenue": {"id": "49699a88-4f79-403d-9250-6b3f361e5d7b", "name": "IEEE/ACM International Symposium on Code Generation and Optimization", "type": "conference", "alternate_names": ["CGO", "Symposium on Code Generation and Optimization", "IEEE/ACM Int Symp Code Gener Optim", "Symp Code Gener Optim"], "url": "http://www.cgo.org/"}, "title": "Revamping Sampling-Based PGO with Context-Sensitivity and Pseudo-instrumentation", "abstract": "The ever increasing scale of modern data center demands more effective optimizations, as even a small percentage of performance improvement can result in a significant reduction in data-center cost and its environmental footprint. However, the diverse set of workloads running in data centers also challenges the scalability of optimization solutions. Profile-guided optimization (PGO) is a promising technique to improve application performance. Sampling-based PGO is widely used in data-center applications due to its low operational overhead, but the performance gains are not as substantial as the instrumentation-based counterpart. The high operational overhead of instrumentation-based PGO, on the other hand, hinders its large-scale adoption, despite its superior performance gains. In this paper, we propose CSSPGO, a context-sensitive sampling-based PGO framework with pseudo-instrumentation. CSSPGO offers a more balanced solution to push sampling-based PGO performance closer to instrumentation-based PGO while maintaining minimal operational overhead. It leverages pseudo-instrumentation to improve profile quality without incurring the overhead of traditional instrumentation. It also enriches profile with context-sensitivity to aid more effective optimizations through a novel profiling methodology using synchronized LBR and stack sampling. CSSPGO is now used to optimize over 75% of Meta's data center CPU cycles. Our evaluation with production workloads demonstrates 1%-5% performance improvement on top of state-of-the-art sampling-based PGO.", "venue": "IEEE/ACM International Symposium on Code Generation and Optimization", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-03-02", "journal": {"name": "2024 IEEE/ACM International Symposium on Code Generation and Optimization (CGO)", "pages": "322-333"}, "authors": [{"authorId": "2153475812", "name": "Wenlei He"}, {"authorId": "2287950024", "name": "Hongtao Yu"}, {"authorId": "2287996776", "name": "Lei Wang"}, {"authorId": "2287975307", "name": "Taewook Oh"}], "citations": []}
