{"paperId": "c3d5b07f758a601dfd1c4834be11ebb1354c7c82", "publicationVenue": {"id": "07ba6a02-fa13-4c5f-b428-795730d75e53", "name": "Big Data", "type": "conference", "alternate_names": ["Int Conf Big Data", "International Conference on Big Data"], "issn": "2167-6461", "url": "http://www.liebertonline.com/", "alternate_urls": ["https://home.liebertpub.com/publications/big-data/611/overview"]}, "title": "Vehicle Intelligent Classification Based on Big Multimodal Data Analysis and Sparrow Search Optimization", "abstract": "Vehicle intelligent classification plays a vital role in the Intelligent Transport Systems. However, due to the dynamic traffic environments, it is difficult to ensure the classification accuracy. Therefore, this article uses a new pulse coherent radar (PCR) to collect road vehicle data, and a vehicle classification method of sparrow search algorithm extreme learning machine (SSA-ELM) based on big multimodal data analysis is proposed. First, the road vehicle data are collected by PCR, where the vehicle length, chassis outline, and height features are extracted as the sample data. Then, the ELM is utilized to learn these three modal features. According to the input feature data, the vehicle type is classified, including cars, sport-utility vehicles, and buses. Finally, the SSA is applied to optimize the initial weights and thresholds of ELM. Experimental results show that SSA-ELM has notable advantages in classification accuracy and convergence speed, compared with existing benchmark methods.", "venue": "Big Data", "year": 2022, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-05-04", "journal": {"name": "Big data"}, "authors": [{"authorId": "2143499031", "name": "Caixing Shao"}, {"authorId": "1944868729", "name": "Fengxin Cheng"}, {"authorId": "2056609036", "name": "Sun Mao"}, {"authorId": "98909803", "name": "Jian Hu"}], "citations": [{"paperId": "0a99c712a7b3e203cab030daa15f32d9304f0316", "title": "Non-Destructive Classification of Maize Seeds Based on RGB and Hyperspectral Data with Improved Grey Wolf Optimization Algorithms"}, {"paperId": "2f2edc1e862abc726184a2d82b766831199e1e57", "title": "Big Multimodal Data Analysis: Applications"}, {"paperId": "6304153312bc4710e039ba32603232eff0bc4fe1", "title": "A 60 GHz Pulsed Coherent Radar for Online Monitoring of the Withering Condition of Leaves"}, {"paperId": "9237a63bb5ff85d77018127725899c60c00af38a", "title": "Non-Destructive Classi ﬁ cation of Maize Seeds Based on RGB and Hyperspectral Data with Improved Grey Wolf Optimization Algorithms"}]}
