{"paperId": "c3ddcf9fa447fa78932d60fb3107bf3a822a0e40", "publicationVenue": {"id": "69951de1-74d3-4924-8e43-73f48a3d006a", "name": "IEEE Congress on Evolutionary Computation", "type": "conference", "alternate_names": ["Congress on Evolutionary Computation", "IEEE Congr Evol Comput", "CEC", "Congr Evol Comput"], "url": "https://en.wikipedia.org/wiki/IEEE_Congress_on_Evolutionary_Computation"}, "title": "Automatic Data Clustering based on Hybrid Atom Search Optimization and Sine-Cosine Algorithm", "abstract": "Automatic clustering based hybrid metaheuristic algorithms has attracted the center of interest of scientists and engineers which become a hot topic for different data analysis applications. For example, image clustering, bioinformatics, image segmentation, and natural language processing. Where the process of determining the number and position of centroids is an NP-hard problem. So, this paper presents an alternative automatic clustering algorithm based on the hybrid between the atom search optimization (ASO) and the sine-cosine algorithm (SCA). The main objective of the proposed clustering method, called ASOSCA, is to find automatically the optimal number of centroids and their positions in order to minimize the CS-index (which refers to Compact-separated index). To achieve this goal, the ASOSCA uses SCA as a local search operator to improve the quality of ASO. The performance of the proposed hybrid method is compared with other metaheuristic methods; in which all of them are tested on sixteen clustering datasets and using different cluster validity indexes as Dunn, Silihouette, Davies Bouldin, and Calinski Harabasz. The experimental results show that the ASOSCA depict high superiority in comparison with other types of hybrid metaheuristic in terms of clustering measures.", "venue": "IEEE Congress on Evolutionary Computation", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-06-01", "journal": {"name": "2019 IEEE Congress on Evolutionary Computation (CEC)", "pages": "2315-2322"}, "authors": [{"authorId": "144211237", "name": "M. A. Elaziz"}, {"authorId": "71010326", "name": "Nabil Neggaz"}, {"authorId": "8206869", "name": "A. Ewees"}, {"authorId": "66845023", "name": "Songfeng Lu"}], "citations": [{"paperId": "51631542beb82e857120449367e00636e7c15c87", "title": "Genetic atom search-optimized in vivo bioelectricity harnessing from live dragon fruit plant based on intercellular two-electrode placement"}, {"paperId": "c8425d93b9cdb466c1cf76a1a5de865d4b7c0e59", "title": "Dynamic Kernel Clustering by Spider Monkey Optimization Algorithm"}, {"paperId": "c75acb514181f90115e9c3a5f98a5179c98d63bf", "title": "Effective PID controller design using a novel hybrid algorithm for high order systems"}, {"paperId": "8b1c9667d62db0d851502ca727e311b8a342a2f4", "title": "Introducing improved atom search optimization (IASO) algorithm: Application to optimal operation of multi-reservoir systems"}, {"paperId": "cc2c168e89b1e6f36d7206676bef097e5ccc5f61", "title": "Opposition-based sine cosine optimizer utilizing refraction learning and variable neighborhood search for feature selection"}, {"paperId": "a5b6fe9d064bfb03c41e07f13fbd0365372d063e", "title": "An Improved Fuzzy Clustering Method for Analyzing Clustering Quality in XML Web Data"}, {"paperId": "3b0802d53901d165b2670cac09ee770063a23be1", "title": "Augmented arithmetic optimization algorithm using opposite-based learning and lévy flight distribution for global optimization and data clustering"}, {"paperId": "7f07617e52a36dd7a0e46f604dab92b53ad1219f", "title": "Boosting k-means clustering with symbiotic organisms search for automatic clustering problems"}, {"paperId": "ba70b0c67607408814ff8c76bcf57806d06e7816", "title": "Multi‐objective quantum atom search optimization algorithm for electric vehicle charging station planning"}, {"paperId": "d4c2a9ac71e453fba1bced4ac3bdca379c34d822", "title": "Sine-Cosine-Barnacles Algorithm Optimizer with disruption operator for global optimization and automatic data clustering"}, {"paperId": "d09b41bc38f6b3ff5f4616678b995b6932e3d3dc", "title": "A Performant Clustering Approach Based on An Improved Sine Cosine Algorithm"}, {"paperId": "23996306d079047eb375b9b1332eca3c2e7098e9", "title": "Boosting arithmetic optimization algorithm by sine cosine algorithm and levy flight distribution for solving engineering optimization problems"}, {"paperId": "af9c9edad007da5d6e50e41e5cb51514e490df77", "title": "Uma Abordagem de Agrupamento Automático de Dados Baseada na Otimização por Busca em Grupo Memética"}, {"paperId": "b8784be8be73d2a4652ef8dd1d40a55bc968ddc0", "title": "A learning automata-based hybrid MPA and JS algorithm for numerical optimization problems and its application on data clustering"}, {"paperId": "7f9fb8dec3812840b3c6b2014fd12fdb52d5cd57", "title": "Automatic Superpixel-Based Clustering for Color Image Segmentation Using q-Generalized Pareto Distribution under Linear Normalization and Hunger Games Search"}, {"paperId": "41b7758ffd953b04a8ba3447d9a33c603e7ea87a", "title": "An adaptive hybrid atom search optimization with particle swarm optimization and its application to optimal no-load PID design of hydro-turbine governor"}, {"paperId": "f8825f6668a3cfc45e3be52827ac26671403f8bd", "title": "A novel Chaotic Equilibrium Optimizer Algorithm with S-shaped and V-shaped transfer functions for feature selection"}, {"paperId": "7b82aadbed0f80cbb49b3bd57a572e548e6e48bd", "title": "A Grunwald-Letnikov based Manta ray foraging optimizer for global optimization and image segmentation"}, {"paperId": "e2b195b67ac1fc2f74031f914b927b069c6920ca", "title": "Advances in Sine Cosine Algorithm: A comprehensive survey"}, {"paperId": "90b55157b9c06e0c13d96e33479b83cd6a0d2c4d", "title": "An application of sine cosine algorithm-based fuzzy possibilistic c-ordered means algorithm to cluster analysis"}, {"paperId": "7b648ce0f1af1fc983e15eefef3e3818f61b9979", "title": "Automatic clustering algorithms: a systematic review and bibliometric analysis of relevant literature"}, {"paperId": "af2c8a66ca18bde9a458e0d4881c415f0b731572", "title": "Automatic clustering algorithms: a systematic review and bibliometric analysis of relevant literature"}, {"paperId": "814f4e68d4a013e75bded77f258484a6a812c211", "title": "An evaluation of k-means as a local search operator in hybrid memetic group search optimization for data clustering"}, {"paperId": "dfbbf0e37aa3bdff1d6ea9bf3497c4b0009b377a", "title": "Multi-Level Image Thresholding Based on Modified Spherical Search Optimizer and Fuzzy Entropy"}, {"paperId": "e1c8e74d92ee0c613576c02d276c65c56878eabd", "title": "Improved Artificial Bee Colony Using Sine-Cosine Algorithm for Multi-Level Thresholding Image Segmentation"}, {"paperId": "f39f834f0b71961da00461fc3b1af6d65f015bc2", "title": "Link-based multi-verse optimizer for text documents clustering"}, {"paperId": "efbf22d192b65728e9d708c06713cee05f8aa968", "title": "Green communication in sensor enabled IoT: integrated physics inspired meta-heuristic optimization based approach"}, {"paperId": "707117d96aca6348b1a9f284df5381985a60c846", "title": "Nature-inspired metaheuristic techniques for automatic clustering: a survey and performance study"}, {"paperId": "3f74e755a0214dd8b6a2ca04eb81c6192f131214", "title": "An intensify atom search optimization for engineering design problems"}, {"paperId": "5da83804e3dd27f84a64414b5aad4c4e0df2ec32", "title": "Classification of a COVID-19 dataset by using labels created from clustering algorithms"}, {"paperId": "f52edfca67ca5fe45c9a361fc49817746f1782b1", "title": "An improved atom search optimization with dynamic opposite learning and heterogeneous comprehensive learning"}, {"paperId": "a01f3a2e369ca0ac63794a7fcf109fd28892ac53", "title": "Hybrid Harris Hawks Optimization with Differential Evolution for Data Clustering"}, {"paperId": "09bf8a4a2edd569edc751da7d5e1463aa8ea54ef", "title": "An Optimized Framework for Surgical Team Selection"}, {"paperId": "46a71546a2cf785bde53317a5c90bbd6d2b036d0", "title": "Automatic Clustering of DNA Sequences With Intelligent Techniques"}, {"paperId": "067891c0264b88d0a4461b6163775acd5be479f0", "title": "An Improved Atom Search Optimization With Cellular Automata, a Lévy Flight and an Adaptive Weight Strategy"}, {"paperId": "87a471ac21d86339c841c7bc5e1429341ce80d22", "title": "A Comparative Performance Study of Hybrid Firefly Algorithms for Automatic Data Clustering"}, {"paperId": "6821a5889563fb2055ece96ced61c847e1e54a41", "title": "Backtracking Group Search Optimization: A Hybrid Approach for Automatic Data Clustering"}]}
