{"paperId": "c3e8b889b1e88ee9a21931296a4795516d97bb51", "publicationVenue": {"id": "7bb54772-a70c-44df-9b9d-9f3b5354c0e2", "name": "IEEE International Parallel and Distributed Processing Symposium", "type": "conference", "alternate_names": ["IEEE Int Parallel Distrib Process Symp", "International Parallel and Distributed Processing Symposium", "IPDPS", "Int Parallel Distrib Process Symp"], "url": "http://www.ipdps.org/"}, "title": "Performance Isolation of Data-Intensive Scale-out Applications in a Multi-tenant Cloud", "abstract": "Data-intensive applications often suffer from performance variability and degradation in the cloud due to intrinsically complex problem of performance interference that arises from multi-tenancy. Although application-level approach of straggler mitigation for scale-out data processing frameworks such as MapReduce and Spark, address the issue to some extent, they incur extra resource and often react after tasks have already slowed down. In this paper, we present PerfCloud, a novel system software that utilizes system level performance metrics for early detection of performance interference in a multi-tenant cloud, and provides non-invasive performance isolation through fine-grained resource control. Unlike existing works, PerfCloud does not require time-consuming workload profiling, or intrusive modification of the application framework and the operating system. We implemented PerfCloud on NSF Cloud's Chameleon testbed using KVM for virtualization, and OpenStack for cloud management. Experimental results with Hadoop MapReduce and Spark benchmarks show that PerfCloud effectively reduces their job completion time, decreases performance variability, and improves resource utilization efficiency while minimizing the performance degradation of other colocated VMs.", "venue": "IEEE International Parallel and Distributed Processing Symposium", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-05-21", "journal": {"name": "2018 IEEE International Parallel and Distributed Processing Symposium (IPDPS)", "pages": "85-94"}, "authors": [{"authorId": "34718613", "name": "P. Lama"}, {"authorId": "1891284", "name": "Shaoqi Wang"}, {"authorId": "46224002", "name": "Xiaobo Zhou"}, {"authorId": "1778706", "name": "Dazhao Cheng"}], "citations": [{"paperId": "2ac4bbcc41e4f7e1873d2f1d9eac4809868117d8", "title": "QoS-Aware Co-Scheduling for Distributed Long-Running Applications on Shared Clusters"}, {"paperId": "3604702a4ecc09c6c019aad4ffe7ac065d50656e", "title": "Improving Concurrent GC for Latency Critical Services in Multi-tenant Systems"}, {"paperId": "369ee284f14e92c0fd221328f4f4c42b87ffe828", "title": "Cloud-native alternating directions solver for isogeometric analysis"}, {"paperId": "3e46e3f8ff04807067835d633e8007beee23dabf", "title": "Holmes: SMT Interference Diagnosis and CPU Scheduling for Job Co-location"}, {"paperId": "785702262181b3d9fff14bfa94c138b0d6b6e3be", "title": "Hybrid Resource Modeling and Scheduling Platform Based on Multisource Cooperation for Cyber-Physical-Human System"}, {"paperId": "36af4427f593a719774952a7918f7d50e0699423", "title": "ScaleReactor: A graceful performance isolation agent with interference detection and investigation for container‐based scale‐out workloads"}, {"paperId": "ecde04d84095d4eabf1a355dea59acdcbcd6fbca", "title": "Optimizing resources to mitigate stragglers through virtualization in run time"}, {"paperId": "55f5b490b9e020fd1c9c3b28a365eb5fa1b55f1b", "title": "Thread-level resource consumption control of tenant custom code in a shared JVM for multi-tenant SaaS"}, {"paperId": "86874f5f262e4ef7de1ca91f9c2dcbcca34b29d1", "title": "Hybrid Resource Orchestration and Scheduling for Cyber-Physical-Human Systems"}, {"paperId": "0dabd9986bb1a89a93419c95e42bbdc0d92617d9", "title": "TOPOSCH: Latency-Aware Scheduling Based on Critical Path Analysis on Shared YARN Clusters"}, {"paperId": "cb63e4b11eaa6963e05f548203af5414ee7a9da4", "title": "Data Life Aware Model Updating Strategy for Stream-based Online Deep Learning"}, {"paperId": "d5b324df59991708ce8ade1a5d0dbecd705bb85c", "title": "Tails in the cloud: a survey and taxonomy of straggler management within large-scale cloud data centres"}, {"paperId": "df6b4d36804ebaf26f79df32a7cf72c096b74890", "title": "Thread-Level CPU and Memory Usage Control of Custom Code in Multi-tenant SaaS"}, {"paperId": "e334356d8a36f6884014849449b9abc17046e825", "title": "SDFS: A software‐defined file system for multitenant cloud storage"}, {"paperId": "eb2a3ba45680245cb3b639b9eb97bc169fd4f59e", "title": "Be Good Neighbors: A Novel Application Isolation Metric Used to Optimize the Initial Container Placement in CaaS"}, {"paperId": "312545a80b43015c8a2cf852fd03abe977ec8913", "title": "Service-Oriented Computing: 17th International Conference, ICSOC 2019, Toulouse, France, October 28–31, 2019, Proceedings"}]}
