{"paperId": "c3f2320e3ef118b48b9df5787308b3db2f420293", "publicationVenue": {"id": "88c529ef-41c7-49b5-96c8-ddfbda90d64a", "name": "Frontiers in Chemical Engineering", "alternate_names": ["Front Chem Eng"], "issn": "2673-2718", "url": "https://www.frontiersin.org/journals/chemical-engineering#"}, "title": "NyctiDB: A non-relational bioprocesses modeling database supported by an ontology", "abstract": "Strategies to exploit and enable the digitalization of industrial processes are on course to become game-changers in optimizing (bio)chemical facilities. To achieve this, these industries face an increasing need for process models and, as importantly, an efficient way to store the models and data/information. Therefore, this work proposes developing an online information storage system that can facilitate the reuse and expansion of process models and make them available to the digitalization cycle. This system is named NyctiDB, and it is a novel non-relational database coupled with a bioprocess ontology. The ontology supports the selection and classification of bioprocess models focused information, while the database is in charge of the online storage of said information. Through a series of online collections, NyctiDB contains essential knowledge for the design, monitoring, control, and optimization of a bioprocess based on its mathematical model. Once NyctiDB has been implemented, its applicability and usefulness are demonstrated through two applications. Application A shows how NyctiDB is integrated inside the software architecture of an online educational bioprocess simulator. This implies that NyctiDB provides the information for the visualization of different bioprocess behaviours and the modifications of the models in the software. Moreover, the information related to the parameters and conditions of each model is used to support the users’ understanding of the process. Additionally, application B illustrates that NyctiDB can be used as AI enabler to further the research in this field through open-source and reliable data. This can, in fact, be used as the information source for the AI frameworks when developing, for example, hybrid models or smart expert systems for bioprocesses. Henceforth, this work aims to provide a blueprint on how to collect bioprocess modeling information and connect it to facilitate and empower the Internet-of-Things paradigm and the digitalization of the biomanufacturing industries. Graphical Abstract", "venue": "Frontiers in Chemical Engineering", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-12-14", "journal": {"volume": "4"}, "authors": [{"authorId": "2125053320", "name": "Simoneta Caño de las Heras"}, {"authorId": "2584800", "name": "Carina L. Gargalo"}, {"authorId": "1411460004", "name": "Fiammetta Caccavale"}, {"authorId": "143850142", "name": "K. Gernaey"}, {"authorId": "6203787", "name": "U. Krühne"}], "citations": []}
