{"paperId": "c3f3cbcc59a914953edc689f074d8ca31f916d3d", "publicationVenue": {"id": "27e2a414-d399-477e-a6d3-81b1c4fc5aad", "name": "International Conference on Control, Decision and Information Technologies", "type": "conference", "alternate_names": ["CoDIT", "CDIT", "Int Conf Control Decis Inf Technol"]}, "title": "Industry 4.0: Roadmap for Applying Technologies in Shipbuilding and Manufacturing Sectors", "abstract": "Industry 4.0 revolution is destined to revolutionize the tasks that must be performed within companies and, in this context, new emerging technologies entail the needs for new professional skills. Therefore, it is necessary to think about how the workforce will be affected by the technological changes and how the skills of the workers will change in the future. Nowadays, one of the most critical issues is the misalignment between the needs of the companies and the actual competences of the workers. To face this problem, in this work an innovative approach based on the Analytic Hierarchy Process (AHP) is developed to derive the professional skills needed for Industry 4.0 technologies. In particular, the case of the Adriatic and Ionian area is analyzed in order to show the application of the proposed methodology. The results of the case study allow obtaining Technological Roadmaps to be used by universities and training organizations, companies and authorities in order to provide a more effective and cutting-edge training. Moreover, an overview of the most requested professional profiles in the Adriatic and Ionian area is also provided.", "venue": "International Conference on Control, Decision and Information Technologies", "year": 2020, "fieldsOfStudy": ["Business", "Computer Science"], "publicationTypes": ["JournalArticle", "Conference", "Review"], "publicationDate": "2020-06-29", "journal": {"name": "2020 7th International Conference on Control, Decision and Information Technologies (CoDIT)", "pages": "819-824", "volume": "1"}, "authors": [{"authorId": "30056755", "name": "Beatrice Di Pierro"}, {"authorId": "145223101", "name": "M. P. Fanti"}, {"authorId": "2511144", "name": "M. Roccotelli"}, {"authorId": "35710776", "name": "V. Sangiorgio"}], "citations": [{"paperId": "06e71108f47b390388002fb660726331c38279f2", "title": "The Analysis of Technical Competency towards the Automotive Manufacturing Expertise in the Industrial Context 4.0"}]}
