{"paperId": "c3fea3202c8a1c733bfdfc4e7e96a453cde69937", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "The Algorithm and Structure for Digital Normalized Cross-Correlation by Using First-Order Moment †", "abstract": "Normalized cross-correlation is an important mathematical tool in digital signal processing. This paper presents a new algorithm and its systolic structure for digital normalized cross-correlation, based on the statistical characteristic of inner-product. We first introduce a relationship between the inner-product in cross-correlation and a first-order moment. Then digital normalized cross-correlation is transformed into a new calculation formula that mainly includes a first-order moment. Finally, by using a fast algorithm for first-order moment, we can compute the first-order moment in this new formula rapidly, and thus develop a fast algorithm for normalized cross-correlation, which contributes to that arbitrary-length digital normalized cross-correlation being performed by a simple procedure and less multiplications. Furthermore, as the algorithm for the first-order moment can be implemented by systolic structure, we design a systolic array for normalized cross-correlation with a seldom multiplier, in order for its fast hardware implementation. The proposed algorithm and systolic array are also improved for reducing their addition complexity. The comparisons with some algorithms and structures have shown the performance of the proposed method.", "venue": "Italian National Conference on Sensors", "year": 2020, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-03-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "20"}, "authors": [{"authorId": "2084643301", "name": "Chao Pan"}, {"authorId": "2112383663", "name": "Zhicheng Lv"}, {"authorId": "50177300", "name": "Xia Hua"}, {"authorId": "2115262622", "name": "Hongyan Li"}], "citations": [{"paperId": "6573c0508c3e41c414be148f73064545b066fce6", "title": "Quantifying the Influence of Climate Variables on Vegetation Through Remote Sensing and Multi-dimensional Data Analysis"}, {"paperId": "f0256b1c967018d35ae27ddbd374484a9c36b29b", "title": "New Systolic Array Algorithms and VLSI Architectures for 1-D MDST"}, {"paperId": "95b7d5b00ba796331bf4a40582a31fdcf888d470", "title": "Finite velocity of ECG signal propagation: preliminary theory, results of a pilot experiment and consequences for medical diagnosis"}, {"paperId": "853bc7845ad39e26e4ff13e0ad6363df1b291de3", "title": "A Comprehensive Study of Cyber Attack Mitigation with the Exchange of Frequency Containment Reserves Control in a Multi-Infeed Direct Current Power System"}, {"paperId": "5336eb999f0ee441d1bcaaa0653b2ed538e2253a", "title": "Regenerative Braking Control Strategy Based on Multi-source Information Fusion under Environment Perception"}, {"paperId": "45248962ffdc960cfc1ba63dbe19e810a87fd76b", "title": "Selected Papers from the First International Symposium on Future ICT (Future-ICT 2019) in Conjunction with the 4th International Symposium on Mobile Internet Security (MobiSec 2019)"}]}
