{"paperId": "c414f58dba769b9fc2be6734e72ff1ffb27d4532", "publicationVenue": {"id": "114a6c53-641d-4023-b71b-2391c71a3686", "name": "International Conference on Software Security and Assurance", "type": "conference", "alternate_names": ["ICSSA", "Int Conf Softw Secur Assur"]}, "title": "Security Challenges and Solutions for Internet of Things based Smart Agriculture: A Review", "abstract": "The Internet of Things (IoT) is a massive and evolving technology that has the potential to revolutionize our world. It enables devices to connect to the internet via sensors, drones, satellites, and so on. Agriculture is critical to the economy of any country. With the world’s population growing, traditional agricultural methods are finding it hard to fulfill the world’s food needs. It is the need of the hour to incorporate IoT in agriculture to digitalize the farming methods to increase the production level. IoT-based modernization in agriculture helps the farmers to check soil moisture, humidity, water level, climate conditions, crop production, etc. IoT applications also promise to maximize the comfort level and efficiency and offer automation to the farmers. With rising cyber-attacks on IoT, smart devices need better security, confidentiality, integrity, and recovery from attacks. In this review, our main focus is on the security challenges faced by resource constraints, low storage, and low power devices. The basic security requirements for IoT devices in smart agriculture are briefly reviewed. Some state-of-the-art security technologies are explored, including machine learning, fog computing, edge computing, SDN, and Blockchains. This analysis of security concerns and security measures will give future scholars a research direction.", "venue": "International Conference on Software Security and Assurance", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference", "Review"], "publicationDate": "2022-07-26", "journal": {"name": "2022 4th International Conference on Smart Sensors and Application (ICSSA)", "pages": "102-107"}, "authors": [{"authorId": "2064087617", "name": "A. Basharat"}, {"authorId": "2065561180", "name": "M. B. Mohamad"}], "citations": [{"paperId": "63de04be9c4a35bb7d9b9515151764840e800408", "title": "Application of Machine Vision Techniques in Low-Cost Devices to Improve Efficiency in Precision Farming"}, {"paperId": "82dfcd4a81f6c5d0b0a073a08daf5b4733c69b41", "title": "Agricultural 4.0 Leveraging on Technological Solutions: Study for Smart Farming Sector"}, {"paperId": "d71e3aeb5eadfebecd113c8fa05ad311d2c84baa", "title": "Drone-Based Weed And Disease Detection In Agricultural Fields To Maximize Crop Health Using a Yolov8 Approach"}, {"paperId": "c45413963690b7c931d9fe7451d021d44360c659", "title": "An extensive survey of smart agriculture technologies: Current security posture"}, {"paperId": "a29f61c03fff20afb50865ac0f80eb94264a7e87", "title": "Security Concerns in Smart Agriculture and Blockchain-based Solution"}, {"paperId": "efcd0c23c231ed1cb7023f2d7b001438474d8a1b", "title": "A Secure IoT-Based Irrigation System for Precision Agriculture Using the Expeditious Cipher"}]}
