{"paperId": "c4284b54f6da4d41aacd04e4f0a04907ce5bebe1", "publicationVenue": {"id": "6c6fcaa9-fd25-488b-8050-995227ac671c", "name": "Symposium on Operating Systems Principles", "type": "conference", "alternate_names": ["Symp Oper Syst Princ", "SOSP"], "url": "http://sosp.org/"}, "title": "A Cloud-Scale Characterization of Remote Procedure Calls", "abstract": "The global scale and challenging requirements of modern cloud applications have led to the development of complex, widely distributed, service-oriented applications. One enabler of such applications is the remote procedure call (RPC), which provides location-independent communication and hides the myriad of cloud communication complexities and requirements within the RPC stack. Understanding RPCs is thus one key to understanding the behavior of cloud applications. While there have been numerous studies of RPCs in distributed systems, as well as attempts to optimize RPC overheads with both software and hardware, there is still a lack of knowledge about the characteristics of RPCs \"in the wild\" in the modern cloud environment. To address this gap, we present, to the best of our knowledge, the first large-scale fleet-wide study of RPCs. Our study is conducted at Google, where we measured the infrastructure supporting Google's user-facing, billion-user web services, such as Google Search, Gmail, Maps, and YouTube, and the information and data management systems that support them. To carry out the study, we examined over 10,000 different RPC methods sampled from over one billion traces, along with statistics collected every 30 minutes over a period of nearly two years. Among other things, we consider the volume, throughput and growth rate of RPCs in the datacenter, the latency of RPCs and their components (the \"RPC latency tax\"), and the structure of RPC call chains. Our analysis shows that the characteristics, scope and complexity of RPCs at hyperscale differ significantly from the assumptions made in prior research. Overall, our work provides new insights into RPC usage and characteristics at the largest scale and motivates further research on optimizing the diverse behavior of this crucial communication mechanism.", "venue": "Symposium on Operating Systems Principles", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2023-10-23", "journal": {"name": "Proceedings of the 29th Symposium on Operating Systems Principles"}, "authors": [{"authorId": "2713765", "name": "Korakit Seemakhupt"}, {"authorId": "2253600994", "name": "Brent E. Stephens"}, {"authorId": "2241716327", "name": "Samira Khan"}, {"authorId": "2241883732", "name": "Sihang Liu"}, {"authorId": "2253603140", "name": "Hassan Wassel"}, {"authorId": "1735318", "name": "S. Yeganeh"}, {"authorId": "2199298", "name": "A. Snoeren"}, {"authorId": "2257173537", "name": "Arvind Krishnamurthy"}, {"authorId": "2244620157", "name": "David E. Culler"}, {"authorId": "2248047257", "name": "Henry M. Levy"}], "citations": [{"paperId": "1a54310bd664373ccb21290a13df30956aa18e11", "title": "Motorway: Seamless high speed BFT"}, {"paperId": "52a76392b12e81e99d81f545437caf010fb96c1d", "title": "Application Defined Networks"}]}
