{"paperId": "c42d78d89a7cc8e4543cb986353d48c9bd0c1ff7", "publicationVenue": null, "title": "Multi-Agent Reinforcement Learning Based Coded Computation for Mobile Ad Hoc Computing", "abstract": "Mobile ad hoc computing (MAHC), which allows mobile devices to directly share their computing resources, is a promising solution to address the growing demands for computing resources required by mobile devices. However, offloading a computation task from a mobile device to other mobile devices is a challenging task due to frequent topology changes and link failures because of node mobility, unstable and unknown communication environments, and the heterogeneous nature of these devices. To address these challenges, in this paper, we introduce a novel coded computation scheme based on multi-agent reinforcement learning (MARL), which has many promising features such as adaptability to network changes, high efficiency and robustness to uncertain system disturbances, consideration of node heterogeneity, and decentralized load allocation. Comprehensive simulation studies demonstrate that the proposed approach can outperform state-of-the-art distributed computing schemes.", "venue": "ICC 2021 - IEEE International Conference on Communications", "year": 2021, "fieldsOfStudy": ["Computer Science", "Engineering"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-04-15", "journal": {"name": "ICC 2021 - IEEE International Conference on Communications", "pages": "1-6"}, "authors": [{"authorId": "47074477", "name": "Baoqian Wang"}, {"authorId": "2236670", "name": "Junfei Xie"}, {"authorId": "1791247", "name": "K. Lu"}, {"authorId": "145976888", "name": "Yan Wan"}, {"authorId": "9334515", "name": "Shengli Fu"}], "citations": [{"paperId": "4adfc8c79f8c6c21b46a55151fa39d96a1920bc3", "title": "DRJLRA: A Deep Reinforcement Learning-Based Joint Load and Resource Allocation in Heterogeneous Coded Distributed Computing"}, {"paperId": "63065ce947c7d39e3636fd1db8f43835499e7333", "title": "Dynamic Coded Distributed Convolution for UAV-based Networked Airborne Computing"}, {"paperId": "d7543a5d5b14c27f9a7c1fd5a8a1ea6183c50eeb", "title": "Dynamic Coded Convolution with Privacy Awareness for Mobile Ad Hoc Computing"}]}
