{"paperId": "c432cdafe7c67207256a932c9d65e2c334f4e63a", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Hybrid Probabilistic Inference with Logical Constraints: Tractability and Message Passing", "abstract": "Weighted model integration (WMI) is a very appealing framework for probabilistic inference: it allows to express the complex dependencies of real-world hybrid scenarios where variables are heterogeneous in nature (both continuous and discrete) via the language of Satisfiability Modulo Theories (SMT); as well as computing probabilistic queries with arbitrarily complex logical constraints. Recent work has shown WMI inference to be reducible to a model integration (MI) problem, under some assumptions, thus effectively allowing hybrid probabilistic reasoning by volume computations. In this paper, we introduce a novel formulation of MI via a message passing scheme that allows to efficiently compute the marginal densities and statistical moments of all the variables in linear time. As such, we are able to amortize inference for arbitrarily rich MI queries when they conform to the problem structure, here represented as the primal graph associated to the SMT formula. Furthermore, we theoretically trace the tractability boundaries of exact MI. Indeed, we prove that in terms of the structural requirements on the primal graph that make our MI algorithm tractable - bounding its diameter and treewidth - the bounds are not only sufficient, but necessary for tractable inference via MI.", "venue": "arXiv.org", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-09-20", "journal": {"name": "ArXiv", "volume": "abs/1909.09362"}, "authors": [{"authorId": "2047081394", "name": "Zhe Zeng"}, {"authorId": "1389041714", "name": "Fanqi Yan"}, {"authorId": "2047325", "name": "Paolo Morettin"}, {"authorId": "14341992", "name": "Antonio Vergari"}, {"authorId": "1749506", "name": "Guy Van den Broeck"}], "citations": []}
