{"paperId": "c4330ccc4c8023aa84ca3f5c1655acb2e9b9a740", "publicationVenue": {"id": "bb5f8604-d58a-4746-a6e5-e91498750aed", "name": "Canadian Journal of Forest Research", "type": "journal", "alternate_names": ["Can J For Res"], "issn": "0045-5067", "url": "https://www.nrcresearchpress.com/journal/cjfr", "alternate_urls": ["http://www.nrcresearchpress.com/journal/cjfr"]}, "title": "A new generation of sensors and monitoring tools to support climate-smart forestry practices", "abstract": "Climate-smart forestry (CSF) is an emerging branch of sustainable adaptive forest management aimed at enhancing the potential of forests to adapt to and mitigate climate change. It relies on much higher data requirements than traditional forestry. These data requirements can be met by new devices that support continuous, in-situ monitoring of forest conditions in real time. We propose a comprehensive network of sensors, i.e. a wireless sensor network (WSN), that can be part of a world-wide network of interconnected uniquely addressable objects, an Internet of Things (IoT), which can make data available in near real time to multiple stakeholders, including scientists, foresters, and forest managers, and may partially motivate citizens to participate in big data collection. The use of in-situ sources of monitoring data as ground-truthed training data for remotely sensed data can boost forest monitoring by increasing the spatial and temporal scale of the monitoring, leading to a better understanding of forest processes and potential threats. Here, some of the key developments and applications of these sensors are outlined, together with guidelines for data management. Examples are given of their deployment to detect early warning signals (EWS) of ecosystem regime-shifts in terms of forest productivity, health and biodiversity. Analysis of the strategic use of these tools highlights the opportunities for engaging citizens and forest managers in this new generation of forest monitoring.", "venue": "Canadian Journal of Forest Research", "year": 2021, "fieldsOfStudy": ["Business"], "publicationTypes": null, "publicationDate": "2021-03-16", "journal": {"name": "Canadian Journal of Forest Research"}, "authors": [{"authorId": "51169167", "name": "C. Torresan"}, {"authorId": "20844938", "name": "Marta Benito Garzón"}, {"authorId": "2053547053", "name": "Michael O'Grady"}, {"authorId": "35582948", "name": "T. Robson"}, {"authorId": "33231186", "name": "G. Picchi"}, {"authorId": "5379559", "name": "P. Panzacchi"}, {"authorId": "6728918", "name": "E. Tomelleri"}, {"authorId": "2124849350", "name": "Melanie Smith"}, {"authorId": "35509220", "name": "J. Marshall"}, {"authorId": "5951766", "name": "L. Wingate"}, {"authorId": "4815572", "name": "R. Tognetti"}, {"authorId": "50200477", "name": "L. Rustad"}, {"authorId": "87137799", "name": "D. Kneeshaw"}], "citations": [{"paperId": "4c591f68054153696ebcd9020842bfb98b846274", "title": "Integration of tree-ring data, Landsat time series, and ALS-derived topographic variables to quantify growth declines in black spruce"}, {"paperId": "878287c369407b5a2f775f850643ab524ae811c2", "title": "Forest harvest operations productivity forecasting: a decisions tree approach"}, {"paperId": "0d0937bc4293766ee48e9ffd2aa3c4004fa91a37", "title": "Tools and methods for monitoring the health of the urban greenery"}, {"paperId": "e60c469feded6ae2dac4b14e0c662bf2adfb6613", "title": "A systematic review on the interconnectedness of eco‐innovations and digital transformation"}, {"paperId": "55b995997493ffa388f495dd48c4cfdfae5293fd", "title": "Environmentally Benign Fast-Degrading Conductive Composites."}, {"paperId": "ba3e7b809c094a6baf651cdca1c7a0eb36f6d622", "title": "GreenScan: Towards large-scale terrestrial monitoring the health of urban trees using mobile sensing"}, {"paperId": "6b959df8de61ef1538cff5ecb8f61c15ef77f0ca", "title": "Earth-Observation-Based Monitoring of Forests in Germany - Recent Progress and Research Frontiers: A Review"}, {"paperId": "2c2fdb92c6f128b75e73afc1dd16e20ffb1444bf", "title": "Multi-temporal NDVI analysis using UAV images of tree crowns in a northern Mexican pine-oak forest"}, {"paperId": "87f267934c9112e5121e79b26fe55dea22e53ded", "title": "Recent Progress in Micro- and Nanotechnology-Enabled Sensors for Biomedical and Environmental Challenges"}, {"paperId": "371a39218794c3313b8fd702be127d0f65bb2571", "title": "The Development of a Set of Novel Low Cost and Data Processing-Free Measuring Instruments for Tree Diameter at Breast Height and Tree Position"}, {"paperId": "07f064b34c42af7be6d2fcae9ee624202de92575", "title": "Device for Simultaneous Wind and Raindrop Energy Harvesting Operating on the Surface of Plant Leaves"}, {"paperId": "a7974febdcf3180e7ee3c32a9b6f7d29f08b55ac", "title": "Views on Radiation Shielding Efficiency of Polymeric Composites/Nanocomposites and Multi-Layered Materials: Current State and Advancements"}, {"paperId": "89d8decf25904d32316288e3bae28cc906387882", "title": "Integrating new technologies to broaden the scope of northern spotted owl monitoring and linkage with USDA forest inventory data"}, {"paperId": "261496ea44b5717d6e0aa81577da71db26950f9e", "title": "Discriminant method approach for harvesting forest operations"}, {"paperId": "7d3120b1d51df5d40a22e5e976c2ffe9bd14f89d", "title": "Discriminant method approach for harvesting forest operations"}, {"paperId": "d21d01f9c4058d9b84f37281f1a5778cb18f8ef9", "title": "Forestry Big Data: A Review and Bibliometric Analysis"}, {"paperId": "01b9820f2086fdda2661a63d861a2beeb3ef4aea", "title": "Climate Smart Forestry in the Southern United States"}, {"paperId": "deda3d5d85e1cca55dfbfd2948e5aa0c0329a1fe", "title": "Internet of Things Applications in Natural Resource Management"}, {"paperId": "578d102b65d36d2cb0c710543ed9949837bed75f", "title": "Reworking the political in digital forests: The cosmopolitics of socio-technical worlds"}, {"paperId": "40f11d72a30cf47edfebc2219f2fb8691cbf954b", "title": "Research on Tree Ring Micro-Destructive Detection Technology Based on Digital Micro-Drilling Resistance Method"}, {"paperId": "7db7d85c86a1f149fa2b184bad27cdfa7f17c073", "title": "Practical Activities Promoting Engagement in Forest Ecology Research"}, {"paperId": "8bb50f4b3255e0f4db5c8c6e997b7dda31ec3308", "title": "Distinguishing Abrupt and Gradual Forest Disturbances With MODIS-Based Phenological Anomaly Series"}, {"paperId": "0d8dbaa2de51856df33bc1152463593129ba4961", "title": "Use of Individual Tree and Product Level Data to Improve Operational Forestry"}, {"paperId": "d725e7092ff6dcdf29b8df9a12b12ebb9b76121d", "title": "Some options for Climate-Smart Forestry in Europe’s mountain regions"}, {"paperId": "97f54301bd972812b7a86c93c80e67164041c062", "title": "Continuous Monitoring of Tree Responses to Climate Change for Smart Forestry: A Cybernetic Web of Trees"}, {"paperId": "4e0a65463f773e42ec3121e745219eda8f80f743", "title": "An Introduction to Climate-Smart Forestry in Mountain Regions"}, {"paperId": "20ba4f672c584e71ae6af99710b85d5c45c95975", "title": "GreenScan: Towards large-scale monitoring the health of urban trees using mobile sensing"}, {"paperId": "bd248d015967c11b5709823d4c8fe3213d45d760", "title": "INTRODUCTION Some options for Climate-Smart Forestry in Europe ’ s mountain regions 1"}]}
