{"paperId": "c435bf5339e882ac4a1b578e7c43e6680e2ddcd2", "publicationVenue": {"id": "7a81d01c-ee3f-4f27-b696-01f35da67f22", "name": "Analytica Chimica Acta", "type": "journal", "alternate_names": ["Anal Chim Acta"], "issn": "0003-2670", "url": "http://www.elsevier.com/wps/find/journaldescription.cws_home/502681/description#description", "alternate_urls": ["http://www.elsevier.com/wps/product/cws_home/502681", "http://www.sciencedirect.com/science/journal/00032670"]}, "title": "Taking the leap between analytical chemistry and artificial intelligence: A tutorial review.", "abstract": null, "venue": "Analytica Chimica Acta", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2021-05-29", "journal": {"name": "Analytica chimica acta", "pages": "\n          338403\n        ", "volume": "1161"}, "authors": [{"authorId": "1854804642", "name": "Lucas B. Ayres"}, {"authorId": "14202912", "name": "F. Gomez"}, {"authorId": "153882913", "name": "Jeb Linton"}, {"authorId": "77218025", "name": "M. F. Silva"}, {"authorId": "67013943", "name": "Carlos D. Garcia"}], "citations": [{"paperId": "dc7f92641589a53094e0340e5c29a67e443b72db", "title": "Machine learning insights into catalyst composition and structural effects on CH4 selectivity in iron-based fischer tropsch synthesis"}, {"paperId": "bc4c5580bdac1aca1c56033eefd6d59302750a83", "title": "Fabrication of 1D/2D Au nanofiber/MIL-101(Cr)–NH2 composite for selective electrochemical detection of caffeic acid: Predicting sensor performance by machine learning and investigating the porosity using AI and computer vision-based image analysis"}, {"paperId": "6d223c47bd50e0e9eadd455d0619cc1b2b016c7f", "title": "Ultradense Electrochemical Chips with Arrays of Nanostructured Microelectrodes to Enable Sensitive Diffusion-Limited Bioassays."}, {"paperId": "3cebe531a93904eebbd8781dae131ffd422e15f1", "title": "A Machine Learning-based approach for Simultaneous Electrochemical Detection of Interfering Analytes"}, {"paperId": "ebbe553bb66f5d5f320142413a48467aadbdbe80", "title": "Data Science Guided Multiobjective Optimization of a Stereoconvergent Nickel-Catalyzed Reduction of Enol Tosylates to Access Trisubstituted Alkenes"}, {"paperId": "8dd8787f902a2cdea8494a3dd12c851c2b07c257", "title": "The triumvirate of effective and rapid synthesis, analysis, and artificial intelligence to explore the structure-property relationship of copolymers"}, {"paperId": "5a0d3393d1c4a97f9453520e565e4811050dbac1", "title": "Industrial food quality and consumer choice: Artificial intelligence-based tools in the chemistry of sensory notes in comfort foods (coffee, cocoa and tea)"}, {"paperId": "7222f012638acf806a62d616900ae34e9c59144c", "title": "AI in analytical chemistry: Advancements, challenges, and future directions"}, {"paperId": "1729ca4f70e81c9a8c4ad3d9a017e10d082728c2", "title": "Boosting comprehensive two-dimensional chromatography with artificial intelligence: Application to food-omics"}, {"paperId": "3f4e7736e90d3269142a1948e1a1018e73809c3e", "title": "NIR spectroscopy-CNN-enabled chemometrics for multianalyte monitoring in microbial fermentation."}, {"paperId": "4035decb686e81d5ad1a80c023c779663f199470", "title": "Predicting the formation of NADES using a transformer-based model"}, {"paperId": "5fd084486e440f3a80e4a478d2d9912383665e36", "title": "Trends in sample preparation and analysis of current use pesticides in abiotic environmental matrices"}, {"paperId": "d7b15c2b8c67a1fd3d778175882f8f068e2e49f5", "title": "A general procedure for finding potentially erroneous entries in the database of retention indices."}, {"paperId": "52d0d021c8a2421423941fcea06609966dae4a14", "title": "Analysis of Machine Learning Classifiers for Speaker Identification: A Study on SVM, Random Forest, KNN, and Decision Tree"}, {"paperId": "e627512f72d6c3947f220bb25a3cc76e86fc9374", "title": "Analysis of India’s Regionally Disparate Recovery from the Second Wave of Coronavirus Using Machine Learning"}, {"paperId": "87775220f9ba966c9c021ee6827157e774998390", "title": "Recent progress on noble-free substrates for surface-enhanced Raman spectroscopy analysis"}, {"paperId": "2280fa22f32910a935aba8ecc4abb56047cb5056", "title": "Predicting Antioxidant Synergism via Artificial Intelligence and Benchtop Data."}, {"paperId": "35559a59e097da94449a24f109d69993a3e0e986", "title": "Exploring the Potential of a Multispectral-Sensing System With Automated Machine Learning for Multiplex Detection"}, {"paperId": "fc0fde0e098f0f29891cce83de453207f5589e97", "title": "Transformation products of antibacterial drugs in environmental water: Identification approaches based on liquid chromatography-high resolution mass spectrometry."}, {"paperId": "6eb2d43e400627a7d06be6c8aeef8c735224f0ac", "title": "Recent Advances in Skin-Interfaced Wearable Sweat Sensors: Opportunities for Equitable Personalized Medicine and Global Health Diagnostics."}, {"paperId": "c69843746793e55f25500d099385b571550aaa70", "title": "Prospective on methods of design of experiments for limited data scenarios in materials design and engineering"}, {"paperId": "e751b0196bdba6b72f7f6c6aabc04f389281c7d2", "title": "Assessment of computational prediction of infra-red spectrograms of nucleotide reverse transcriptase inhibitor class antiretroviral drugs in the FT-IR method validation"}, {"paperId": "50b766929e147cb043141a11f92476cc7ba9dc88", "title": "Semi-Selective Array for the Classification of Purines with Surface Plasmon Resonance Imaging and Deep Learning Data Analysis."}, {"paperId": "026b30a69ddb2a2cfa8854b0ba93744a212ee030", "title": "Quantitative image analysis of microplastics in bottled water using artificial intelligence."}, {"paperId": "aa6e4af5f8ec9a401753bceaf2278a48e6fd39dd", "title": "Enhanced Copolymer Characterization for Polyethers Using Gel Permeation Chromatography Combined with Artificial Neural Networks."}, {"paperId": "39fa9ffdaddd0f802477d37c2162a7499ec06382", "title": "Artificial Intelligence in Analytical Spectroscopy, Part II: Examples in Spectroscopy"}, {"paperId": "7f75a7291cdb8290894facc9a6ca9e89ff4221ef", "title": "Toward automated infrared spectral analysis in community drug checking."}, {"paperId": "37621c8090a84c050d6e7963ffdc2413a57c8e76", "title": "Recent Progresses in Machine Learning Assisted Raman Spectroscopy"}, {"paperId": "b9d9dad78719e7d56372bc90c74aede4d4f39b30", "title": "Intelligent framework for cannabis classification using visualization of gas chromatography/mass spectrometry data and transfer learning"}, {"paperId": "7167e0b713def4e76b174234a2f6c6feda5ccd42", "title": "SynBioTools: a one-stop facility for searching and selecting synthetic biology tools"}, {"paperId": "b93644ef18252436d2b1dc633b941261ff0d2ca9", "title": "Comprehensive Two-Dimensional Gas Chromatography as a Bioanalytical Platform for Drug Discovery and Analysis"}, {"paperId": "bb249de2473fa158ed743d189dffeb6f06cd5da1", "title": "Label-free detection of trace level zearalenone in corn oil by surface-enhanced Raman spectroscopy (SERS) coupled with deep learning models."}, {"paperId": "2182017a1d51d1efb88d1155b2cb98a576305c3d", "title": "Explainable Deep Learning-Assisted Photochromic Sensor for β-Lactam Antibiotic Identification."}, {"paperId": "cb59b520051c5d4ccd017795ee527d94db8fdbfd", "title": "Workshop on Computer Vision for Bioanalytical Chemists: Classification and Detection of Amoebae Using Optical Microscopy Image Analysis with Machine Learning"}, {"paperId": "60c4e9e155d6c45d8acbe42d829c8a21a11712d0", "title": "Machine learning toward high-performance electrochemical sensors"}, {"paperId": "91176d7063d248a85d8a54c63df8c7030ef8d2aa", "title": "Machine Learning in Fundamental Electrochemistry: Recent Advances and Future Opportunities"}, {"paperId": "842df76685a07004119d0ee1b28a7d5f1b60ae5b", "title": "Exploratory Analysis of South American Wines Using Artificial Intelligence"}, {"paperId": "62639df1910155314f99f85294173b6f7e11a93f", "title": "Potential Aroma Chemical Fingerprint of Oxidised Coffee Note by HS-SPME-GC-MS and Machine Learning"}, {"paperId": "c14c8a792a558541459cdcbfc3e55afe213821e5", "title": "Implementation of relevant fourth industrial revolution innovations across the supply chain of fruits and vegetables: A short update on Traceability 4.0."}, {"paperId": "c345786ef17f502f7a1013ba69f6cd27bf480d6f", "title": "Deep learning-based method for automatic resolution of gas chromatography-mass spectrometry data from complex samples."}, {"paperId": "4c41b947f85994d4777f8aa721b703729279de1e", "title": "A Comprehensive Mass Spectrometry-Based Workflow for Clinical Metabolomics Cohort Studies"}, {"paperId": "9cc9dc723e3e8e73cbca05b04e3f64eadaebbab0", "title": "Machine learning–based sensor array: full and reduced fluorescence data for versatile analyte detection based on gold nanocluster as a single probe"}, {"paperId": "5512630acbd6d2a43ea77ea0747ac8bf790b77ca", "title": "SERS-CNN approach for non-invasive and non-destructive monitoring of stem cell growth on a universal substrate through an analysis of the cultivation medium"}, {"paperId": "7c88ed5ab545b3703a1e6d1ae46e385da4e52cbd", "title": "Machine learning for yield prediction for chemical reactions using in situ sensors."}, {"paperId": "34ef9ce7a9390477b33bcad7aced3d2060205663", "title": "Highly accurate heart failure classification using carbon nanotube thin film biosensors and machine learning assisted data analysis"}, {"paperId": "5efebf761012704fe8e5a43e2a58748a40f4c612", "title": "A machine learning-based multimodal electrochemical analytical device based on eMoSx-LIG for multiplexed detection of tyrosine and uric acid in sweat and saliva."}, {"paperId": "bc08364d466c72831df275abf4e18bd06507784a", "title": "Modular Label-Free Electrochemical Biosensor Loading Nature-Inspired Peptide toward the Widespread Use of COVID-19 Antibody Tests"}, {"paperId": "0ef1b145f96f027292ed8d2282d694dec25172c8", "title": "Food traceability 4.0 as part of the fourth industrial revolution: key enabling technologies."}, {"paperId": "fb341c824bb44ce7838cc3fbc9332a97e8c0e62b", "title": "Linear or non-linear multivariate calibration models? That is the question."}, {"paperId": "3e60303c3b04e0c6591baa821edccdf14e66c1c8", "title": "Navigating the Future of Separation Science Education: A Perspective"}, {"paperId": "a92e16ea74792c0e3c132c34991dfb3dabb0eeec", "title": "Machine Learning Modeling of Environmentally Relevant Chemical Reactions for Organic Compounds"}, {"paperId": "8337181cda2301fc534473e8f43bea25e20f981b", "title": "Deep Learning-Based Sensor Array: 3D Fluorescence Spectra of Gold Nanoclusters for Qualitative and Quantitative Analysis of Vitamin B6 Derivatives."}, {"paperId": "071f17d4bdbc61d7cd3f5ea2eb030b1a2569b923", "title": "Machine-Learning-Based Olfactometry: An Auxiliary System for Human Assessors in Olfactory Measurement"}, {"paperId": "c880caa2b1e3d526e0258affc8189902717e0b80", "title": "Advances in infrared spectroscopy and hyperspectral imaging combined with artificial intelligence for the detection of cereals quality"}, {"paperId": "285520be725e5f81352b818aa65ffeda9a396ee6", "title": "Comfort evaluation of ZnO coated fabrics by artificial neural network assisted with golden eagle optimizer model"}, {"paperId": "a43a959702a7c7eed9f4fc14abbbccadfbbc752e", "title": "Real-Time and In Situ Monitoring of the Synthesis of Silica Nanoparticles."}, {"paperId": "b2adde91e2fa8c555a71a5621384cf43b2f62c38", "title": "Deep Learning-Based Spectral Extraction for Improving the Performance of Surface-Enhanced Raman Spectroscopy Analysis on Multiplexed Identification and Quantitation."}, {"paperId": "c338f6bebaedbc26afb102bfc422bb489aaeb411", "title": "Multi-layer Perceptron for Detection of different class Antibiotics from Visual Fluorescence Response of a Carbon Nanoparticle-based Multichannel Array Sensor"}, {"paperId": "22fa825c92d942c13802c9481e103c92818b7dd7", "title": "Working at the interfaces of data science and synthetic electrochemistry"}, {"paperId": "85e09263fcd1c07fb77269248f929879469cba78", "title": "Use of an Artificial Neural Network for Tensile Strength Prediction of Nano Titanium Dioxide Coated Cotton"}, {"paperId": "ee5fcbb07ba7879cc905a70ddee9504a0497645a", "title": "Explainable Deep Learning-Assisted Fluorescence Discrimination for Aminoglycoside Antibiotic Identification."}, {"paperId": "3f726740c86d28a2a18a9af26f382801af75671d", "title": "An interpretable deep learning approach for calibration transfer among multiple near-infrared instruments"}, {"paperId": "4c2205415bace7d9abe51edf04846710f8c55896", "title": "Perspective - what constitutes a quality analytical paper: Microfluidics and Flow analysis"}, {"paperId": "ca72a5efddc411cae97471495c5a1899d63b50b0", "title": "Deep learning in analytical chemistry"}, {"paperId": "6e4d9cd2da1e3667da2cc303c5549a7773f07fa7", "title": "Artificial intelligence: A powerful paradigm for scientific research"}, {"paperId": "13b2d6471bc989d2d8f02c30674335c4b29d06c2", "title": "Machine learning and chemometrics for electrochemical sensors: moving forward to the future of analytical chemistry."}, {"paperId": "bf06cee66229d4def15a77b9bda56d8f7ba0eab7", "title": "Revealing Unknown Controlled Substances and New Psychoactive Substances Using High-Resolution LC-MS/MS Machine Learning Models and the Hybrid Similarity Search Algorithm."}, {"paperId": "dbe3962ba9b4d18970620c4e06d52a7965f12c1d", "title": "Open-source all-in-one LabToGo Office Chromatography."}, {"paperId": "6a35f5b6c870cf8c177afacbb5526ae1a2a34879", "title": "Bifunctional Metal Meshes Acting as a Semipermeable Membrane and Electrode for Sensitive Electrochemical Determination of Volatile Compounds."}, {"paperId": "5835b67bb0468a5b1aa8f34a8b27c5a0882f6640", "title": "Low-cost smartphone-based LIBS combined with deep learning image processing for accurate lithology recognition."}, {"paperId": "118bda6f5ddf38bb96e105c33dcff69815969c95", "title": "High-performance thin-layer chromatography combined with effect-directed assays and high-resolution mass spectrometry as an emerging hyphenated technology: A tutorial review."}, {"paperId": "b7e81187c8e6b569b96a3a11c5e7e8066bf61b2b", "title": "Arti ﬁ cial intelligence: A powerful paradigm for scienti ﬁ c research"}]}
