{"paperId": "c4366d1d8f2c170d885ed694407d27d58578bce5", "publicationVenue": {"id": "e07422f9-c065-40c3-a37b-75e98dce79fe", "name": "The Web Conference", "type": "conference", "alternate_names": ["Web Conf", "WWW"], "url": "http://www.iw3c2.org/"}, "title": "Big smog meets web science: smog disaster analysis based on social media and device data on the web", "abstract": "Nowadays, people are increasingly concerned about smog disaster and the caused health hazard. However, the current methods for big smog analysis are usually based on the traditional lagging data sources or merely adopt physical environment observations, which limit the methods' accuracy and usability. The discipline of Web Science, the research fields of which include web of people and web of devices, provides real time web data as well as novel web data analysis approaches. In this paper, both social web data and device web data are proposed for smog disaster analysis. Firstly, we utilize social web data to define and calculate Individual Public Health Indexes (IPHIs) for smog caused health hazard quantification. Secondly, we integrate social web data and device web data to build standard health hazard rating reference and train smog-health models for health hazard prediction. Finally, we apply the rating reference and models to online and location-sensitive smog disaster monitoring, which can better guide people's behaviour and government's strategy design for disaster mitigation.", "venue": "The Web Conference", "year": 2014, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2014-04-07", "journal": {"name": "Proceedings of the 23rd International Conference on World Wide Web"}, "authors": [{"authorId": "1731892", "name": "Jiaoyan Chen"}, {"authorId": "1729778", "name": "Huajun Chen"}, {"authorId": "1706307", "name": "Guozhou Zheng"}, {"authorId": "9416872", "name": "Jeff Z. Pan"}, {"authorId": "1715859", "name": "Honghan Wu"}, {"authorId": "2608639", "name": "Ningyu Zhang"}], "citations": [{"paperId": "aaf036ac5f572ec3dde96abe71d861084ee7b212", "title": "Anatomization of air quality prediction using neural networks, regression and hybrid models"}, {"paperId": "31ece6e6143b21970ee42abb19ffa46b0a5d226f", "title": "Estimation of Ground PM2.5 Concentrations in Pakistan Using Convolutional Neural Network and Multi-Pollutant Satellite Images"}, {"paperId": "cc0f42c5efc69b91636535ec4d67948b0523a34b", "title": "A Spatial-Temporal Approach for Air Quality Forecast in Urban Areas"}, {"paperId": "996d6de1341c75664d25ca5f1875a5a36ff548a4", "title": "A deep learning and image-based model for air quality estimation."}, {"paperId": "1477c3571a39c8898753d727e919c7cbea509864", "title": "Information Dissemination From Social Network for Extreme Weather Scenario"}, {"paperId": "56d8a6642b6e1d7f2a6743ed634959c6f91031b5", "title": "Citizen perception of APEC blue and air pollution management"}, {"paperId": "7e5ca42a8c11e2972748915e7193e48e898e8953", "title": "Big Data in occupational medicine: the convergence of -omics sciences, participatory research and e-health"}, {"paperId": "98acb222d071c69c6478994bb71a93c5cc0dd279", "title": "An integrated web-based air pollution decision support system – a prototype"}, {"paperId": "9725c735eae7e2740fd2818c728464a9102e1ca9", "title": "Third-Eye"}, {"paperId": "185e0c12b02b08cf5fcf8ab7703cc6d98ddc7a2f", "title": "End-to-end learning for image-based air quality level estimation"}, {"paperId": "d46578bf16c14322a5281612cf94597880c45b50", "title": "Risk knowledge, product knowledge, and brand benefits for purchase intentions: Experiences with air purifiers against city smog in China"}, {"paperId": "56358f0fd778070c8654bd8c688b5b7480276ab3", "title": "A Review on Applications of Big Data for Disaster Management"}, {"paperId": "efe12ca67221131404f25b77d81fecc365ef8257", "title": "A systematic review of data mining and machine learning for air pollution epidemiology"}, {"paperId": "ac918b809ee252f3bb9d39d2211a9e76f8f8c2cc", "title": "FCJ-219 The Sensed Smog: Smart Ubiquitous Cities and the Sensorial Body"}, {"paperId": "d6c32b2426773b52932fb26516f006336ab6e722", "title": "Consumers’ purchase intentions toward products against city smog: exploring the influence of risk information processing"}, {"paperId": "66c18b4a37d38adcdd7021e5a17153d02c1cd25e", "title": "Monitoring Environmental Quality by Sniffing Social Media"}, {"paperId": "971d007253f6edcd0fc8764f1b4164dc798e591c", "title": "On Estimating Air Pollution from Photos Using Convolutional Neural Network"}, {"paperId": "bf75d5b1fff2af3c8de68726ce9a40946e7dca68", "title": "Inferring Atmospheric Particulate Matter Concentrations from Chinese Social Media Data"}, {"paperId": "056adbfacc1e81935e48efdfee6ef04f097dfba2", "title": "Visual analytics of smogs in China"}, {"paperId": "cd98f5e9e6c1d5d65e7bac1d2cc810c0068c7348", "title": "Forecasting smog-related health hazard based on social media and physical sensor"}, {"paperId": "396fb780c0a36891ba9006e00f724113001b808d", "title": "Using user generated online photos to estimate and monitor air pollution in major cities"}, {"paperId": "2d3c90dc0892a0b49c5f3bf2dc9d037585da2fb1", "title": "Satellite Data Science: A Case Study for Smog Disaster Prediction from Multiple Satellite Observations"}, {"paperId": "25115f762ca2226f9d82f654a931ad317fcf6afd", "title": "Fast Fine-Grained Air Quality Index Level Prediction Using Random Forest Algorithm on Cluster Computing of Spark"}, {"paperId": "b5b63a211d9fb4bef779995ec60661d7847c1363", "title": "Inferring air pollution by sniffing social media"}, {"paperId": "bf5cd6fc4799b9218b1833f48b3d49dc0ed294bd", "title": "Automated spatiotemporal and semantic information extraction for hazards"}, {"paperId": "97ffcede4e35cb809496f8099c76933b2fa5a3a0", "title": "2015 Ieee International Conference on Big Data (big Data) Smog Disaster Forecasting Using Social Web Data and Physical Sensor Data"}]}
