{"paperId": "c4382cf4d3aab004be4ce09a5da3baf0dd9c65a9", "publicationVenue": null, "title": "Exploring the Potential of Cyber Manufacturing System in the Digital Age", "abstract": "Cyber-manufacturing Systems (CMS) have been growing in popularity, transitioning from conventional manufacturing to an innovative paradigm that emphasizes innovation, automation, better customer service, and intelligent systems. A new manufacturing model can improve efficiency and productivity, and provide better customer service and response times. In addition, it may revolutionize the way products are produced, from design to completion. Therefore, it is likely that this new manufacturing model will become increasingly popular. By building new technologies on top of existing CMS, these systems will ensure that data exchange and integration between decentralized systems are reliable and secure. Recently published case studies from industry and the literature support this claim; some challenges remain to be overcome. In general, the use of CMS can revolutionize the manufacturing industry. This study comprehensively analyzes these systems and their potential applications and implications. An overview of the field is then given and various aspects of CMS are also explored with more details. A taxonomy of the most common and current approaches to CMS is presented, including networked cyber-manufacturing systems, distributed cyber-manufacturing systems, cloud-based cyber-manufacturing systems, and cyber-physical systems (CPS). Furthermore, our survey identifies several popular open-source software and datasets and discusses how these resources can reduce barriers to CMS research. In addition, we identify several important issues and research opportunities associated with CMS, including better integration between hardware and software, improved security and privacy protocols, communication protocols, and improved data management systems. In summary, this paper presents a comprehensive overview of current technology and valuable insights are provided for the potential impact of CMS on society and industry.", "venue": "ACM Trans. Internet Techn.", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-05-08", "journal": {"name": "ACM Transactions on Internet Technology", "pages": "1 - 38", "volume": "23"}, "authors": [{"authorId": "1720768575", "name": "Usman Ahmed"}, {"authorId": "38078886", "name": "Jerry Chun‐wei Lin"}, {"authorId": "2146142408", "name": "Gautam Srivastava"}], "citations": [{"paperId": "5e29399da9448dd38d4b8edca6ab0ba310921920", "title": "Safe Performance of an Industrial Autonomous Ground Vehicle in the Supervisory Control Framework"}, {"paperId": "13d04d8bc5b067807c83551b5ed8f4c7eb528c12", "title": "A Comprehensive Analysis of Trust, Privacy, and Security Measures in the Digital Age"}]}
