{"paperId": "c43ef40f7656bc5bb80cad82c6dc27cbba9d6846", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Multiclass Prediction Model for Student Grade Prediction Using Machine Learning", "abstract": "Today, predictive analytics applications became an urgent desire in higher educational institutions. Predictive analytics used advanced analytics that encompasses machine learning implementation to derive high-quality performance and meaningful information for all education levels. Mostly know that student grade is one of the key performance indicators that can help educators monitor their academic performance. During the past decade, researchers have proposed many variants of machine learning techniques in education domains. However, there are severe challenges in handling imbalanced datasets for enhancing the performance of predicting student grades. Therefore, this paper presents a comprehensive analysis of machine learning techniques to predict the final student grades in the first semester courses by improving the performance of predictive accuracy. Two modules will be highlighted in this paper. First, we compare the accuracy performance of six well-known machine learning techniques namely Decision Tree (J48), Support Vector Machine (SVM), Naïve Bayes (NB), K-Nearest Neighbor (kNN), Logistic Regression (LR) and Random Forest (RF) using 1282 real student’s course grade dataset. Second, we proposed a multiclass prediction model to reduce the overfitting and misclassification results caused by imbalanced multi-classification based on oversampling Synthetic Minority Oversampling Technique (SMOTE) with two features selection methods. The obtained results show that the proposed model integrates with RF give significant improvement with the highest f-measure of 99.5%. This proposed model indicates the comparable and promising results that can enhance the prediction performance model for imbalanced multi-classification for student grade prediction.", "venue": "IEEE Access", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-04-22", "journal": {"name": "IEEE Access", "pages": "95608-95621", "volume": "9"}, "authors": [{"authorId": "3225249", "name": "Siti Dianah Abdul Bujang"}, {"authorId": "1749862", "name": "A. Selamat"}, {"authorId": "1764469", "name": "R. Ibrahim"}, {"authorId": "1755574", "name": "O. Krejcar"}, {"authorId": "1397996912", "name": "E. Herrera-Viedma"}, {"authorId": "1747316", "name": "H. Fujita"}, {"authorId": "8958172", "name": "N. A. M. Ghani"}], "citations": [{"paperId": "a46e02fbcc52f2a6f3381a078fe71b36b92525ca", "title": "Feature selection techniques and classification algorithms for student performance classification: a review"}, {"paperId": "c39633990c2dc48814e8316a4b6f0e3780c437b8", "title": "Predicting Student Performance in Online Learning: A Multidimensional Time-Series Data Analysis Approach"}, {"paperId": "4d44c2c15da8638e43eceef622584eee06cebb6d", "title": "Multi-classification of national fitness test grades based on statistical analysis and machine learning"}, {"paperId": "2ecbc76565181a186441a6c9af631c02083129a5", "title": "Improving Student Grade Prediction with Machine Learning: Addressing Imbalanced Classifications to Gain Accurate Performance Insights"}, {"paperId": "5a10921c14dc74b00a486cdf74ac0857f9aceb26", "title": "Regression-Driven Predictive Model to Estimate Learners' Performance through Multisource Data"}, {"paperId": "b586f6e6ab92a84af430a1c6a4cddf30c2c3505c", "title": "Revolutionizing University Graduate Employability: Leveraging Advanced Machine Learning Models to Optimize Campus Recruitment and Placement Strategies"}, {"paperId": "a88b1d34af2f804fe0245e44eeff2bafa84ca27d", "title": "Mitigating Imbalanced Classification Problems in Academic Performance with Resampling Methods"}, {"paperId": "4c02513298e33d4aab022e7b1704e4f9c1efd980", "title": "A structural model for building a system for the development of methodological competence and methods for evaluating its effectiveness"}, {"paperId": "fcb8ae6e060df8abe42cc01cd1fd19ca4ccd3dda", "title": "Vehicle routing problem optimization with machine learning in imbalanced classification vehicle route data"}, {"paperId": "411eb79a7ce22062ee4ad5e96d7d231327c4f9e0", "title": "A Study on Differential Influence of Students’ Academic Performance on Stress Perception by Machine Learning"}, {"paperId": "7db9f9cc3c13939fa4ffa114930c09f0ed6812cf", "title": "Optimized Feature Selection Approach Based on Entropy for Multi-Class Data Classification"}, {"paperId": "b9a0fe2fb899eb5f3496145394f81d561c2baecb", "title": "Predicting Academic Performance of Learners With the Three Domains of Learning Data Using Neuro-fuzzy Model and Machine Learning Algorithms"}, {"paperId": "10b5efd52221d43cb0be2f8ff709c0392980a2a5", "title": "Predicting Student Performance Using Mental Health and Linguistic Attributes with Deep Learning"}, {"paperId": "f8b6d3f4e48c29e2961d2f7fcfd928f9ef7899b8", "title": "A Comprehensive Survey on Usage of Learning Analytics for Enhancing Learner's Performance in Learning Portals"}, {"paperId": "e58970d1fb41d43a76583f35342a926d92cea09b", "title": "Feature Extraction and Deep Neural Network Method Based Research on Cognitive Law of Students in Reading Comprehension in Chinese"}, {"paperId": "4dd7c66e3d0989d18764cfb3f01af8ae230332d0", "title": "Analysis of Psychological Factors Influencing Mathematical Achievement and Machine Learning Classification"}, {"paperId": "968d08abd364d6e4d11b72855d722ee3a8ce1c4f", "title": "Decoding Contextual Factors Differentiating Adolescents’ High, Average, and Low Digital Reading Performance Through Machine-Learning Methods"}, {"paperId": "484ec8f8de57afd69039bf9f4fc21adc406d4226", "title": "Systematic Review of Recommendation Systems for Course Selection"}, {"paperId": "6e5416b006fbc8d7d9e7e56e59f1d28e72ddc84f", "title": "E-Learning Behavior Categories and Influencing Factors of STEM Courses: A Case Study of the Open University Learning Analysis Dataset (OULAD)"}, {"paperId": "052545cae00036a99354b61bfa309a9447122dfe", "title": "A comparative study on student performance prediction using machine learning"}, {"paperId": "530efa0fef6bb4673cbf45cb349a111d4b7b12d5", "title": "Will the Student Get an A Grade? Machine Learning-based Student Performance Prediction in Smart Campus"}, {"paperId": "2c60716fd8e2fc78f2db202931bedef9161884b5", "title": "Machine Learning for Data Flow Processing in Learning Process"}, {"paperId": "03e01dbbcc0c5d7cd64b7562249d49b62bb79158", "title": "Penentuan Batas Gain Kanal Modulasi Adaptif V2V dengan Doppler Shift yang Bervariasi Menggunakan Machine Learning"}, {"paperId": "c221bf233e5b4c6c22e9f092419d530488c36c51", "title": "A Relative Analysis of Data Mining Approaches for Student’s Academics Performance Prediction"}, {"paperId": "44b25ea7600e92cca22c34c35851f8f5346635ad", "title": "Betterment of Classroom and Examination Performance Using Historical Data - A Survey"}, {"paperId": "9333c15d4aaaecc6793f5992d599d1cbac0a3d76", "title": "Multiclass Intent Classification for Chatbot Based on Machine Learning Algorithm"}, {"paperId": "fba622cb45f8aba2dce2311c62af2739015abe3c", "title": "Analysis of Existing ML Techniques for Students Success Prediction"}, {"paperId": "03cfc9d0923769843e340fbb70a2988791728908", "title": "Predição de Desempenho de Estudantes: Uma Revisão Sistemática de Literatura"}, {"paperId": "f1d6031f8ce0db1a37252ac7944db87536af3878", "title": "Academic performance warning system based on data driven for higher education"}, {"paperId": "1b6561e53a0fc10fd7e68638a3ca65e350e50d98", "title": "SA-FEM: Combined Feature Selection and Feature Fusion for Students’ Performance Prediction"}, {"paperId": "42da38b88419e6021e39ecee34d280f22c882401", "title": "A Grade Prediction Method Based on Long Short-Term Memory Network in Smart Campus"}, {"paperId": "acaf52f2d8a462d35f7b13571bdbe44b8d8a1ae2", "title": "Predictive modelling and analytics of students’ grades using machine learning algorithms"}, {"paperId": "b7a95e0b7b40a4e522a5f3b8993408c4b0977358", "title": "Prediction of College Students' Sports Performance Based on Improved BP Neural Network"}, {"paperId": "d21c15a28720bd920875076bb9c3d8879e98d8e1", "title": "Artificial Intelligence for Assessment and Feedback to Enhance Student Success in Higher Education"}, {"paperId": "22f09cd7f1270e5e92564a0f809850ba08769592", "title": "Predicting the academic progression in student’s standpoint using machine learning"}, {"paperId": "49645ce8eb0fc6871e7b039d1f10a6d750126718", "title": "Machine Learning-based Improvement in Quality of Learning using 4Q & S Approach"}, {"paperId": "39e007fe8274adb38da55c11a492ae1be0121c7f", "title": "A Comprehensive Overview of Machine Learning Algorithms and their Applications"}, {"paperId": "9354b85563ac483458499a7b18c1b988b9755016", "title": "Explainable Machine Learning Prediction for the Academic Performance of Deaf Scholars"}, {"paperId": "ebdf4c0892430d5d205524e4aa74e93b6818ab15", "title": "Explainable Models for Predicting Academic Pathways for High School Students in Saudi Arabia"}, {"paperId": "75bc11818fc79a1b1130c17ea19aa2a997a58061", "title": "Imbalanced Classification Methods for Student Grade Prediction: A Systematic Literature Review"}, {"paperId": "fdde4b4692e0a94057e9dbb9244acbfda128ec0c", "title": "Modeling Learners to Early Predict Their Performance in Educational Computer Games"}, {"paperId": "29081fcab5c7d69b876058098b46a25024ce4d35", "title": "Performance and early drop prediction for higher education students using machine learning"}, {"paperId": "1984fa157904e2eee472fdacc3ba3b17271ffbe7", "title": "Machine Learning in Higher Education: Students’ Performance Assessment Considering Online Activity Logs"}, {"paperId": "cde8d822ebc4582441490ba69a73f1908d794aa8", "title": "Prediction of Student’s Performance With Learning Coefficients Using Regression Based Machine Learning Models"}, {"paperId": "04997d14402876d8f65d37a99a3a393efe438929", "title": "A University Student Performance Prediction Model and Experiment Based on Multi-Feature Fusion and Attention Mechanism"}, {"paperId": "2dbb8ab38752a0aac9867c60bf7bb893dca2123a", "title": "Machine Learning for Exhibition Recommendation in a Museum’s Virtual Tour Application"}, {"paperId": "aac33d0e947cf0d6e312bf6608aa9d2c21884aeb", "title": "STUDENT MARKS PREDICTION USING MACHINE LEARNING TECHNIQUES"}, {"paperId": "9848f7baf643ba4cc1f35942b48623051a288fc3", "title": "Improved Ensemble Feature Selection Based on DT for KPI Prediction"}, {"paperId": "43f13565df9fe8ddc79e24ff3e7440cd06b04e93", "title": "Comparative Evaluation of SVM Kernels for Sentiment Classification in Fuel Price Increase Analysis"}]}
