{"paperId": "c44b7daae56d24698201ec543dbd1895abded214", "publicationVenue": {"id": "764e3630-ddac-4c21-af4b-9d32ffef082e", "name": "IEEE International Conference on Data Engineering", "type": "conference", "alternate_names": ["ICDE", "Int Conf Data Eng", "IEEE Int Conf Data Eng", "International Conference on Data Engineering"], "url": "http://www.wikicfp.com/cfp/program?id=1331"}, "title": "S-QUERY: Opening the Black Box of Internal Stream Processor State", "abstract": "Distributed streaming dataflow systems have evolved into scalable and fault-tolerant production-grade systems. Their applicability has departed from the mere analysis of streaming windows and complex-event processing, and now includes cloud applications and machine learning inference. Although the advancements in the state management of streaming systems have contributed significantly to their maturity, the internal state of streaming operators has been so far hidden from external applications. However, that internal state can be seen as a materialized view that can be used for analytics, monitoring, and debugging. In this paper we argue that exposing the internal state of streaming systems to outside applications by making it queryable, opens the road for novel use cases. To this end, we introduce S-QUERY: an approach and reference architecture where the state of stream processors can be queried - either live or through snapshots, achieving different isolation levels. We show how this new capability can be implemented in an existing open-source stream processor, and how queryable state can affect the performance of such a system. Our experimental evaluation suggests that the snapshot configuration adds only up to 8ms latency in the 99.99thpercentile and negligible increase in 0-90thpercentiles.", "venue": "IEEE International Conference on Data Engineering", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-05-01", "journal": {"name": "2022 IEEE 38th International Conference on Data Engineering (ICDE)", "pages": "1314-1327"}, "authors": [{"authorId": "151468871", "name": "Jim Verheijde"}, {"authorId": "2848117", "name": "Vassilios Karakoidas"}, {"authorId": "1792039", "name": "Marios Fragkoulis"}, {"authorId": "2138521152", "name": "Asterios Katsifodimos"}], "citations": [{"paperId": "341ffc8e6c7fb06ed3b3338504e4c2457d3990f4", "title": "A Survey on Transactional Stream Processing"}, {"paperId": "6e6145e1a4f4f0b8fdd71d5f54e09a90564518fc", "title": "Stateful Entities: Object-oriented Cloud Applications as Distributed Dataflows"}, {"paperId": "21da1ee785c91c832f68a9f18e4d7eda41c1cbd6", "title": "A Survey on the Evolution of Stream Processing Systems"}]}
