{"paperId": "c44bd49c867cc80f1dc73a09c6c3ba2b24ef045d", "publicationVenue": null, "title": "A Big Data Reference Architecture for Emergency Management", "abstract": "Nowadays, we are witnessing a shift in the way emergencies are being managed. On the one hand, the availability of big data and the evolution of geographical information systems make it possible to manage and process large quantities of information that can hugely improve the decision-making process. On the other hand, digital humanitarianism has shown to be very beneficial for providing support during emergencies. Despite this, the full potential of combining automatic big data processing and digital humanitarianism approaches has not been fully realized, though there is an initial body of research. This paper aims to provide a reference architecture for emergency management that instantiates the NIST Big Data Reference Architecture to provide a common language and enable the comparison of solutions for solving similar problems.", "venue": "Inf.", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-12-04", "journal": {"name": "Inf.", "pages": "569", "volume": "11"}, "authors": [{"authorId": "1697135", "name": "C. Iglesias"}, {"authorId": "3058601", "name": "Alfredo Favenza"}, {"authorId": "37309246", "name": "Álvaro Carrera"}], "citations": [{"paperId": "3f33ac47c312b0c51bd236a7e8fa61c21955d684", "title": "EXISTING THREATS IN THE CIVIL SECURITY CONTEXT AND MEASURES TO REDUCE THEIR IMPACTS"}, {"paperId": "5d64c0e3cb923f31acd14ee33ac0992a9fe6a2ec", "title": "Digital Twin Smart Cities for Disaster Risk Management: A Review of Evolving Concepts"}, {"paperId": "9a1069d32f0b42d50898d5b7e0c4cfaf19569335", "title": "Research on Safety and Integrated Disaster Prevention System Based on Big Data Technology"}, {"paperId": "ca80a71cb1a321baf3252fa2ce99e4a2962df883", "title": "A systematic literature review on the use of big data analytics in humanitarian and disaster operations"}, {"paperId": "2b7a93f2989ef3f64e8cef6386e1da60dc19a37f", "title": "Towards a digital twin for supporting multi-agency incident management in a smart city"}, {"paperId": "7de68e910b4ac5a938d9b10a12f1da90dc828bbd", "title": "Emerging Trends and Knowledge Structures of Smart Urban Governance"}, {"paperId": "a3dd93de57b2239601aefed710af9a2eab302a91", "title": "The State of Big Data Reference Architectures: A Systematic Literature Review"}]}
