{"paperId": "c45413963690b7c931d9fe7451d021d44360c659", "publicationVenue": {"id": "fdeb5c51-251b-4f10-aaec-bf0b5adc6beb", "name": "World Journal of Advanced Research and Reviews", "type": "journal", "alternate_names": ["World J Adv Res Rev"], "issn": "2581-9615", "url": "http://wjarr.com/"}, "title": "An extensive survey of smart agriculture technologies: Current security posture", "abstract": "Smart agriculture, enabled by advanced technologies such as internet of things, artificial intelligence and data analytics, offers immense potential for optimizing farming practices and increasing agricultural productivity. However, as the adoption of smart agriculture systems continues to grow, it brings forth various security issues that need to be addressed to protect farming operations, data integrity, and privacy. This paper provides an overview of the security issues in smart agriculture, including vulnerabilities in internet of things devices, lack of standardized security protocols, limited security awareness among farmers, and challenges in securing data and communication networks. In addition, it highlights the need for robust security measures to mitigate risks such as unauthorized access, data breaches, and disruption of operations. Moreover, emphasis should be laid on the importance of collaborative efforts between technology providers, agricultural stakeholders, researchers, and policymakers to develop effective security solutions and standards that ensure the trustworthiness and resilience of smart agriculture systems.", "venue": "World Journal of Advanced Research and Reviews", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-06-30", "journal": {"name": "World Journal of Advanced Research and Reviews"}, "authors": [{"authorId": "122309736", "name": "Martin Otieno"}], "citations": [{"paperId": "6058b194aff7f0a798f65ac6636e5f93bd86b0b4", "title": "AquaBamboo data-driven suggested system for water management and sustainable growth of bamboo: A review"}, {"paperId": "8ec9a9ee4c4bbbbe76b53c174145c2b8a7a29978", "title": "AI-Powered Innovation in Digital Transformation: Key Pillars and Industry Impact"}, {"paperId": "730a7568a7c527968b20f0c9491ab8b4da143211", "title": "New Generation Sustainable Technologies for Soilless Vegetable Production"}]}
