{"paperId": "c461d5e6186c27e505551f3f6715e6f5e02fe9b6", "publicationVenue": {"id": "c83872c8-8037-4ef1-8ced-abb2233a2886", "name": "IEEE Transactions on Green Communications and Networking", "alternate_names": ["IEEE Trans Green Commun Netw"], "issn": "2473-2400", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=7511293", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=7511293"]}, "title": "Fine-Grained Benchmarking and Targeted Optimization: Enabling Green IoT-Oriented Blockchain in the 6G Era", "abstract": "For 6G-empowered IoT, blockchain is widely regarded as a fundamental technique for addressing the security and privacy issues. Nonetheless, the current blockchains suffer from several flaws, especially the low performance and scalability. They seriously hinder the blockchain deployments in 6G-empowered IoT with high concurrency and complexity. To address this problem, we need to better understand blockchains and try to optimize them. However, we still lack a standard tool for comprehensively benchmarking the IoT-oriented blockchains in 6G era. As to blockchain optimization, the current general-purpose strategies can hardly hold efficiency all the time due to the heterogeneity of 6G-empowered IoT. In this paper, we present a novel pipeline for facilitating the green IoT-oriented blockchains in 6G era, called “fine-grained benchmarking + targeted optimization.” Specifically, we first design a benchmarking framework which realizes the whole workflow of data acquisition, log parsing, and metric visualization, offering quantitative blockchain performance reports. Moreover, our framework provides ten metrics divided into four dimensions, leading blockchain benchmarking to the fine-grained level. Based on the acquired insights, we further present the concept of targeted optimization, i.e., directly designing optimization strategies based on the metrics that perform poorly in benchmarking. To better illustrate this pipeline, we take IOTA, the most potential IoT-oriented blockchain in 6G era, as a case study. We observe two defects of IOTA, i.e., low power efficiency and slow ledger synchronization. Following our pipeline, we design two targeted optimization mechanisms, namely Proof-of-Resource Efficiency and Dynamic Local Snapshot Protocol. Extensive experiments demonstrate that our pipeline can maximize the optimization efficiency, successfully addressing the issues hindering IOTA. Last but not least, we emphasize that the proposed pipeline can also be applied by other IoT-oriented blockchains in the 6G era.", "venue": "IEEE Transactions on Green Communications and Networking", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-01", "journal": {"name": "IEEE Transactions on Green Communications and Networking", "pages": "1036-1051", "volume": "7"}, "authors": [{"authorId": "2053225439", "name": "Kai Qian"}, {"authorId": "1604963638", "name": "Yinqiu Liu"}, {"authorId": "98862859", "name": "Chaoran Shu"}, {"authorId": "1759469", "name": "Yanfei Sun"}, {"authorId": "144547968", "name": "Kun Wang"}], "citations": [{"paperId": "121b11ce09c7e2b74970a4ae0960eddbdf944331", "title": "HPCchain: A Consortium Blockchain System Based on CPU-FPGA Hybrid-PUF for Industrial Internet of Things"}, {"paperId": "426130b31702075d9e9fc6813784c9cdef485a7c", "title": "Deploying an energy efficient, secure & high-speed sidechain-based TinyML Model for Soil Quality Monitoring and Management in Agriculture"}, {"paperId": "1e3dce275aadef81621ebf8b7afa2c529e559a0b", "title": "Development and Interaction of the VTF Concept with IoT Platforms on the Example of the 5G Standard"}, {"paperId": "713b5d7190ad00ac4c61fb110e025d7671c09685", "title": "Guest Editorial Special Issue on Collaborative Intelligence for Green Internet of Things in the 6G Era"}]}
