{"paperId": "c47248357f6ef8d3039dff457fe59f859540d217", "publicationVenue": {"id": "b7696878-9521-4592-8205-198d53528bd2", "name": "Euromicro Symposium on Digital Systems Design", "type": "conference", "alternate_names": ["Digit Syst Des", "Euromicro Symp Digit Syst Des", "Digital Systems Design", "DSD"], "url": "http://www.wikicfp.com/cfp/program?id=762"}, "title": "AxBy: Approximate Computation Bypass for Data-Intensive Applications", "abstract": "Recent years have witnessed a rapid growth of data-intensive applications such as machine learning and multimedia applications. However, such applications incur a heavy computation workload that stresses the existing computing systems, especially resource-constrained embedded systems. This paper is inspired by the key observation that many data-intensive applications naturally present a strong existence of trivial computations – a set of computations the results of which can be determined without actual computations. Typical examples include multiplication with 0, +1/-1 and addition with 0. Correspondingly, we develop and implement bypass circuits that are tightly integrated with computation units to detect and bypass the trivial computations. Once detected, the circuit delivers the pre-determined result without an actual computation. We implement bypass circuits in both hardware (Verilog) and software (C). Furthermore, we enhance the opportunities of computation bypass by developing AxBy, an approximate computation bypass method with pattern matching under limited data precision. This reconfigurability is key to achieving a “controllable approximation” and a tunable quality-energy tradeoff. Our experimental results show that for four image processing applications and three neural network applications, the computation bypass can enable 15% – 55% in image processing and 30% – 35% in neural networks of energy saving without any accuracy loss. For neural networks, we can further achieve 36% –44% energy saving with negligible accuracy loss.", "venue": "Euromicro Symposium on Digital Systems Design", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-08-01", "journal": {"name": "2020 23rd Euromicro Conference on Digital System Design (DSD)", "pages": "332-339"}, "authors": [{"authorId": "151487159", "name": "Dongning Ma"}, {"authorId": "2858184", "name": "Xun Jiao"}], "citations": [{"paperId": "3ebc5abf9843e0b4ef86630d142455a91dd856eb", "title": "A High-Resilience Imprecise Computing Architecture for Mixed-Criticality Systems"}, {"paperId": "141d54fdd4ff9f79103bf8870e1771b7a53e5b99", "title": "Line-Circle-Square (LCS): A Multilayered Geometric Filter for Edge-Based Detection"}, {"paperId": "e679ca69505efed54465c8c2432a31a7c0bd4339", "title": "Improved Timing Error Resilience of Microelectronic Computing Systems using Cross-layer Optimizations"}]}
