{"paperId": "c47a9040fdf33ea4da9c7ffb95ab84cf6b9efbfc", "publicationVenue": null, "title": "DiHi: Distributed and Hierarchical Performance Modeling of Multi-VM Cloud Running Applications", "abstract": "Performance fluctuation of cloud running applications, due to collocations of different tenants on the same machine, is one of the cloud users’ concerns. To alleviate users’ concerns with insightful information, performance modeling and prediction of their applications is deemed necessary. In this paper, we propose two hierarchical and a monolithic performance modeling and prediction frameworks for multi-VM applications running on clouds. Hierarchical frameworks have been considered to distribute the required processing power for performance modeling and prediction over a group of collaborating VMs for better scalability, and to reduce the load of transferring unprocessed profiling data. Several unsupervised learning algorithms and existing single-VM models have been incorporated into the hierarchical frameworks to evaluate their effects on models’ accuracy. Then, the results are compared with a baseline approach where the most intuitive monolithic framework requires the accumulation of all profiling data on a central VM. We have considered a comprehensive set of micro-benchmarks to probe the contention in various resources of all collaborating VMs. Then, using the proposed frameworks, the experienced contention levels by each VM and the overall performance of the applications are modeled and predicted. The results of our experiments in a private and two public clouds show that the distributed and hierarchical frameworks can predict the overall applications’ performance effectively with comparable accuracy to the monolithic framework with an average prediction error of 5% for different cluster sizes and clouds.", "venue": "2020 IEEE 22nd International Conference on High Performance Computing and Communications; IEEE 18th International Conference on Smart City; IEEE 6th International Conference on Data Science and Systems (HPCC/SmartCity/DSS)", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-12-01", "journal": {"name": "2020 IEEE 22nd International Conference on High Performance Computing and Communications; IEEE 18th International Conference on Smart City; IEEE 6th International Conference on Data Science and Systems (HPCC/SmartCity/DSS)", "pages": "1-10"}, "authors": [{"authorId": "153889781", "name": "Hamidreza Moradi"}, {"authorId": "47825073", "name": "Wen Wang"}, {"authorId": "1721468", "name": "Dakai Zhu"}], "citations": []}
