{"paperId": "c483d7f3968bf6bc7e621fc2e0e7e89b208f8efe", "publicationVenue": null, "title": "Efficient Smartphone-Based Human Activity Recognition Using Convolutional Neural Network", "abstract": "Human activity recognition primarily targets the identification of individual/group activities from acquired data, which can be captured commonly using smartphone based sensory units. Existing sensor based human activity recognition, including smartphone based activity recognition, has suffered from efficient performances to accurately recognize physical activities. In this paper, an efficient human activity recognition system, based on the new simplified convolutional neural network framework, is proposed. The proposed system also improves the overall recognition accuracy of human activities given as one-dimensional time-series dataset based on accelerometers and gyroscopes of smartphones. In particular, the proposed system accurately recognizes six types of physical activities, viz. walk, walk-upstairs, walk-downstairs, sit, stand and lay. The proposed system has been thoroughly experimented to show that its overall recognition accuracy increases to as high as 93.926%, with significant improvement in training time and testing time performances, which reach to a minimum of 3.4274 seconds and 372.6 milliseconds respectively. Consequently, the proposed system achieves time bound performances of accurate activity recognition, thereby advocating many societal benefits including disaster management.", "venue": "2019 International Conference on Information Technology (ICIT)", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-12-01", "journal": {"name": "2019 International Conference on Information Technology (ICIT)", "pages": "307-312"}, "authors": [{"authorId": "1564617546", "name": "S. Dhanraj"}, {"authorId": "35220632", "name": "Suddhasil De"}, {"authorId": "31625414", "name": "D. Dash"}], "citations": [{"paperId": "ae45f25819c5ca2ac66d5a9751c415cceaa9181d", "title": "Compressed Deep Learning Model For Human Activity Recognition"}, {"paperId": "c32db173551c06e0f60e4d2ebde63e02ca316fb3", "title": "New Foggy Object Detecting Model"}, {"paperId": "d34a5b00ad146b307b085135924083c3b55cd84e", "title": "Robotic Terrain Classification with Loss Regularization"}, {"paperId": "14bf47d74b02f724bf17f87c6dc3c3177542e5f3", "title": "A Novel Smartphone-Based Human Activity Recognition Approach using Convolutional Autoencoder Long Short-Term Memory Network"}, {"paperId": "58098c0ea916c7ab424394c3f3c510d9b3030c3b", "title": "A Study on Gait Pattern Identification and MNA Detection Methodologies used for Human Medical Diagnosis using Wearable Sensors"}, {"paperId": "f3db68cbd5cc87e08c52651e0ec64b91c19a04be", "title": "Human Activity Recognition using Deep Learning"}, {"paperId": "559b2655fbdbf422d5661f6c3e47fd15c11b5aa8", "title": "Deep CNN-LSTM With Self-Attention Model for Human Activity Recognition Using Wearable Sensor"}, {"paperId": "6bba8ba75fcb76e96129edca64f5832b5ffd7157", "title": "Smartphone-Based Activity Recognition Using Multistream Movelets Combining Accelerometer and Gyroscope Data"}, {"paperId": "e684e2544193ba2dfa63a48f851e2e321eadc2d9", "title": "Combining Accelerometer and Gyroscope Data in Smartphone-Based Activity Recognition using Movelets"}, {"paperId": "774a1d8521b2a3b69ad71783543bc3f858dfa76c", "title": "Feature fusion using deep learning for smartphone based human activity recognition"}, {"paperId": "bbd6d2108f2630af74776b230b27dcf57a83016e", "title": "A Nonintrusive Elderly Home Monitoring System"}, {"paperId": "fdcb97456a90d8e2daf5db0d45a0889da0c745d6", "title": "ConvAE-LSTM: Convolutional Autoencoder Long Short-Term Memory Network for Smartphone-Based Human Activity Recognition"}, {"paperId": "c0ee2165b6a078fa72f667dae3a8cdc798869ca4", "title": "Human Daily Activity Recognition Performed Using Wearable Inertial Sensors Combined With Deep Learning Algorithms"}]}
