{"paperId": "c4885564498a31fd2fe57a007a89bbc2807b4f31", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "FUTURE-AI: Guiding Principles and Consensus Recommendations for Trustworthy Artificial Intelligence in Medical Imaging", "abstract": "The recent advancements in artificial intelligence (AI) combined with the extensive amount of data generated by today's clinical systems, has led to the development of imaging AI solutions across the whole value chain of medical imaging, including image reconstruction, medical image segmentation, image-based diagnosis and treatment planning. Notwithstanding the successes and future potential of AI in medical imaging, many stakeholders are concerned of the potential risks and ethical implications of imaging AI solutions, which are perceived as complex, opaque, and difficult to comprehend, utilise, and trust in critical clinical applications. Despite these concerns and risks, there are currently no concrete guidelines and best practices for guiding future AI developments in medical imaging towards increased trust, safety and adoption. To bridge this gap, this paper introduces a careful selection of guiding principles drawn from the accumulated experiences, consensus, and best practices from five large European projects on AI in Health Imaging. These guiding principles are named FUTURE-AI and its building blocks consist of (i) Fairness, (ii) Universality, (iii) Traceability, (iv) Usability, (v) Robustness and (vi) Explainability. In a step-by-step approach, these guidelines are further translated into a framework of concrete recommendations for specifying, developing, evaluating, and deploying technically, clinically and ethically trustworthy AI solutions into clinical practice.", "venue": "arXiv.org", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-09-20", "journal": {"name": "ArXiv", "volume": "abs/2109.09658"}, "authors": [{"authorId": "2127471605", "name": "Karim Lekadira"}, {"authorId": "10417336", "name": "Richard Osuala"}, {"authorId": "108139887", "name": "C. Gallin"}, {"authorId": "98019659", "name": "Noussair Lazrak"}, {"authorId": "26355925", "name": "Kaisar Kushibar"}, {"authorId": "2209674", "name": "G. Tsakou"}, {"authorId": "2127472933", "name": "Susanna Auss'o"}, {"authorId": "2127474682", "name": "Leonor Cerd'a Alberich"}, {"authorId": "32314596", "name": "K. Marias"}, {"authorId": "2127472016", "name": "Manolis Tskinakis"}, {"authorId": "2522681", "name": "S. Colantonio"}, {"authorId": "37830154", "name": "Nickolas Papanikolaou"}, {"authorId": "1983771933", "name": "Zohaib Salahuddin"}, {"authorId": "48000039", "name": "H. Woodruff"}, {"authorId": "1693233", "name": "P. Lambin"}, {"authorId": "2127472303", "name": "L. Mart'i-Bonmat'i"}], "citations": [{"paperId": "28b7c3d2919a717a5ac1fc8e566bb598d8daece5", "title": "Leveraging Computer Vision in the Intensive Care Unit (ICU) for Examining Visitation and Mobility"}, {"paperId": "e851c3e73878f0e544633ead6b10edd55e7b5b3d", "title": "Radiology AI Deployment and Assessment Rubric (RADAR) to bring value-based AI into radiological practice"}, {"paperId": "8799a3d93966833a122588ffbe2bc83ee9a0c26d", "title": "Why do errors arise in artificial intelligence diagnostic tools in histopathology and how can we minimize them?"}, {"paperId": "a57f82609aeea8703ad28dde2a8f18558432e754", "title": "Computer Vision Tasks for Ambient Intelligence in Children's Health"}, {"paperId": "63df30f4943fccf33f7c6fde535b7a74492a0ee3", "title": "Artificial intelligence–based image analysis in clinical testing: lessons from cervical cancer screening"}, {"paperId": "9655178ced0c66510c2846bf9279fdc2af75d997", "title": "Black box no more: a scoping review of AI governance frameworks to guide procurement and adoption of AI in medical imaging and radiotherapy in the UK"}, {"paperId": "3de2027190c4f938fd3ddef51b74fcca7567f94b", "title": "Deep Neural Network Regression to Assist Non-Invasive Diagnosis of Portal Hypertension"}, {"paperId": "539a7a7704c5900394849965255888d76412560b", "title": "Detecting Minor Symptoms of Parkinson’s Disease in the Wild Using Bi-LSTM with Attention Mechanism"}, {"paperId": "e751a9fa6267f58e69e01421630abcf38d1a18f0", "title": "Revisiting Skin Tone Fairness in Dermatological Lesion Classification"}, {"paperId": "3e1f853f0f46e4fb1a4526e7fa4344e08b8982a7", "title": "Current state and prospects of artificial intelligence in allergy"}, {"paperId": "4a2b8ea2e80498dd77766d169aa914e111a8ffa5", "title": "Responsible AI practice and AI education are central to AI implementation: a rapid review for all medical imaging professionals in Europe"}, {"paperId": "133b6ae7cc26f5ca8b9df8aa0fae460b76e1e4a5", "title": "Regulatory considerations for medical imaging AI/ML devices in the United States: concepts and challenges"}, {"paperId": "8419280d7be96541c177a103e6bd5c023809d03f", "title": "Explanations as a New Metric for Feature Selection: A Systematic Approach"}, {"paperId": "f2b0d57d5eec9eaec4ce807597d540e5fc39fbda", "title": "Artificial intelligence in medical device software and high-risk medical devices – a review of definitions, expert recommendations and regulatory initiatives"}, {"paperId": "12f288a74a59e99e48177bb3eedd319e9e92f4d6", "title": "Volume of hyperintense inflammation (VHI): A quantitative imaging biomarker of inflammation load in spondyloarthritis, enabled by human-machine cooperation"}, {"paperId": "c3a6da18fa01e6993bcc064d87108a46ae410d39", "title": "From Head and Neck Tumour and Lymph Node Segmentation to Survival Prediction on PET/CT: An End-to-End Framework Featuring Uncertainty, Fairness, and Multi-Region Multi-Modal Radiomics"}, {"paperId": "72ea3c12cdf367aa8896ace906af48a23016cfc2", "title": "Reproducibility of Machine Learning: Terminology, Recommendations and Open Issues"}, {"paperId": "42e2f578b48ad2d6180436d3e08f1091ce5b653e", "title": "Developing medical imaging AI for emerging infectious diseases"}, {"paperId": "1cf9f7da2786af99cc503833c1e95366344a46f3", "title": "Mapping the Landscape of Care Providers’ Quality Assurance Approaches for AI in Diagnostic Imaging"}, {"paperId": "824c2f52fd24f8af27b0d0967117e33029f37aa1", "title": "Clinician's guide to trustworthy and responsible artificial intelligence in cardiovascular imaging"}, {"paperId": "f49b60f0e6094a4294b8529ad58157ef687e2715", "title": "A Survey on Medical Image Segmentation Based on Deep Learning Techniques"}, {"paperId": "f352315e3d1bac7d4fb470ec8db9d07993bc9272", "title": "medigan: a Python library of pretrained generative models for medical image synthesis"}, {"paperId": "0dcc7009bbc175c76302644133471780a40c4b9b", "title": "Towards Responsible Medical Diagnostics Recommendation Systems"}, {"paperId": "ca6e3ce07524b5bbb96240b20c051e9d3b4dba18", "title": "Addressing fairness in artificial intelligence for medical imaging"}, {"paperId": "d906bee3fe37c4047dd274605010cca1cba11298", "title": "Deep Learning for the Differential Diagnosis between Transient Osteoporosis and Avascular Necrosis of the Hip"}, {"paperId": "fb32f0b303aa139f9d9c53f0d754bc54ff7c6ef5", "title": "COVID-19 Detection From Respiratory Sounds With Hierarchical Spectrogram Transformers"}, {"paperId": "4d6583e74fe33cc447760866f94b15429948a3e9", "title": "Ethics of AI in Radiology: A Review of Ethical and Societal Implications"}, {"paperId": "f37f447ddcf14664b78653c1009d9934614519f7", "title": "Considerations for artificial intelligence clinical impact in oncologic imaging: an AI4HI position paper"}, {"paperId": "c6afa8a06414abd0ccd96083472535f407a22cf9", "title": "Sharing generative models instead of private data: a simulation study on mammography patch classification"}, {"paperId": "ad29519f2a652433b1f6e0f51d58779292796828", "title": "CHAIMELEON Project: Creation of a Pan-European Repository of Health Imaging Data for the Development of AI-Powered Cancer Management Tools"}, {"paperId": "7f6cfc722806371787f18242d7fff25f384df4ae", "title": "Data synthesis and adversarial networks: A review and meta-analysis in cancer imaging"}, {"paperId": "c7f9a3b966562bc929b9e746ee0e6a115ac66868", "title": "Accelerating the Adoption of Artificial Intelligence Technologies in Radiology: A Comprehensive Overview on Current Obstacles"}, {"paperId": "b5d09edeea6ef8b5028ad3bd4ad90341ece45889", "title": "Exploring the potentials and challenges of Artificial Intelligence in supporting clinical diagnostics and remote assistance for the health and well-being of individuals"}, {"paperId": "dbc4545cf45fd2eb57be6350abc1d610ce9a50e7", "title": "SI-Lab Annual Research Report 2021"}, {"paperId": "269310b6fac809819421dab92db88a6db037a936", "title": "A Survey of Fairness in Medical Image Analysis: Concepts, Algorithms, Evaluations, and Challenges"}, {"paperId": "487b2939fecc0374a69b15ee3d7afcea78160dea", "title": "medigan: A Python Library of Pretrained Generative Models for Enriched Data Access in Medical Imaging"}]}
