{"paperId": "c495e807f20f57ad7ac40889e2afe3213115cd00", "publicationVenue": {"id": "764e3630-ddac-4c21-af4b-9d32ffef082e", "name": "IEEE International Conference on Data Engineering", "type": "conference", "alternate_names": ["ICDE", "Int Conf Data Eng", "IEEE Int Conf Data Eng", "International Conference on Data Engineering"], "url": "http://www.wikicfp.com/cfp/program?id=1331"}, "title": "Query-driven Repair of Functional Dependency Violations", "abstract": "Data cleaning is a time-consuming process that depends on the data analysis that users perform. Existing solutions treat data cleaning as a separate offline process that takes place before analysis begins. Applying data cleaning before analysis assumes a priori knowledge of the inconsistencies and the query workload, thereby requiring effort on understanding and cleaning the data that is unnecessary for the analysis.We propose an approach that performs probabilistic repair of functional dependency violations on-demand, driven by the exploratory analysis that users perform. We introduce Daisy, a system that seamlessly integrates data cleaning into the analysis by relaxing query results. Daisy executes analytical query-workloads over dirty data by weaving cleaning operators into the query plan. Our evaluation shows that Daisy adapts to the workload and outperforms traditional offline cleaning on both synthetic and real-world workloads.", "venue": "IEEE International Conference on Data Engineering", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-04-01", "journal": {"name": "2020 IEEE 36th International Conference on Data Engineering (ICDE)", "pages": "1886-1889"}, "authors": [{"authorId": "3182666", "name": "Stella Giannakopoulou"}, {"authorId": "1943226", "name": "M. Karpathiotakis"}, {"authorId": "1728318", "name": "A. Ailamaki"}], "citations": [{"paperId": "dff0e6b1b327ab13be7ef42bbb2567c94d551f95", "title": "Analytical Engines With Context-Rich Processing: Towards Efficient Next-Generation Analytics"}, {"paperId": "0902f923b177962b10a4c7d2eca835bc5e5df019", "title": "Consistent Answers of Aggregation Queries using SAT Solvers"}, {"paperId": "68fa68c9020c9f744f02274813fbe5d5a12c3359", "title": "ICDE 2020 TOC"}]}
