{"paperId": "c4ac9383586630c04f5a68efaae91a858fe81e26", "publicationVenue": {"id": "02a4454a-84c8-471c-9b40-cc045d4f3223", "name": "Security and Communication Networks", "type": "journal", "alternate_names": ["Secur Commun Netw"], "issn": "1939-0122", "url": "https://www.hindawi.com/journals/scn/", "alternate_urls": ["http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1939-0122", "http://www.interscience.wiley.com/journal/security"]}, "title": "Automating Group Management of Large-Scale IoT Botnets for Antitracking", "abstract": "With the popularity of Internet of Things (IoT) devices, IoT botnets like Mirai have been infecting as many devices as possible such as IP cameras and home routers. Because of the sheer volume and continual operation of many vulnerabilities (many users do not pay much attention to IoT update alerts and leave the configurations by default) of IoT devices, the population of an IoT botnet becomes increasingly tremendous. The growing population, though making a botnet powerful, results in an increased risk of exposure. Specifically, once a bot is captured, the command and control (C&C) channel may be cracked and then tracked, potentially rendering more bots being discovered. To solve this problem, this paper proposes an automated approach to group management of large-scale IoT bots. The basic idea of the proposed approach is to establish a reliable and unsuspicious social network-based C&C channel capable of automatically grouping bots, wherein a group of bots have a unique ID that is against cross-group tracking. The Diffie–Hellman key exchange method is leveraged for efficiently generating the unique group ID, thereby scaling up automatic bot grouping. We refer to the botnet proposed in this paper as a multichannel automatic grouping botnet (MCG botnet) and conduct verification experiments using social networks and more than 2,000 docker nodes. The experimental results show that the MCG botnet has the ability of automatic grouping and antitracking.", "venue": "Security and Communication Networks", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-04-14", "journal": {"name": "Security and Communication Networks"}, "authors": [{"authorId": "2142688196", "name": "Pengyu Pan"}, {"authorId": "48577990", "name": "Xiaobo Ma"}, {"authorId": "2162696556", "name": "Yingjie Fu"}, {"authorId": "2157326054", "name": "Feitong Chen"}], "citations": []}
