{"paperId": "c4ae4e4114ee227b19eee33e96feb40066294889", "publicationVenue": {"id": "12606533-41e4-4917-b9d3-50941da6c739", "name": "Digital Library Perspectives", "alternate_names": ["Digit Libr Perspect"], "issn": "2059-5816", "url": "https://www.emerald.com/insight/publication/issn/2059-5816"}, "title": "Exploring electronic lab notebooks (ELNs) at a R1 institution in the Southeast USA", "abstract": "\nPurpose\nThis study aims to build a better understanding of researcher needs regarding support for data that you create, store, and/or manage using an electronic lab notebook (ELN), also referred to as electronic research notebook (ERN). The study also articulates the need for risk assessment for ELN products used by researchers for both open data and sensitive data that require standards.\n\n\nDesign/methodology/approach\nThe author used a participatory action research mixed-methods approach. A working group was formed from an ELN initial meeting. The working group team investigated several institutional ERN solutions by setting up trials, speaking with representatives from other research universities with ERN solutions and conducting internal and external research. This culminated in a broader-scale survey exploration.\n\n\nFindings\nFindings reveal there is no single institutional ELN license solution to satisfy all scientific disciplines. There is a need to develop foundational tools needed by all, provide additional tools and uses cases with best practices that can be tailored to various labs and research processes and develop a how-to guide on how to assemble the parts to create a useful ELN solution.\n\n\nResearch limitations/implications\nThe research implications include providing support for researchers selecting an ERN solution through a combination of online guides, short tutorials and training. There is a need to develop foundational tools, uses cases with best practices that can be tailored to various labs and research processes and how-to guide on how to assemble the parts to create a useful hybrid-ELN solution.\n\n\nPractical implications\nPractical implications include aligning available ERN solutions with other institution provided technologies across the research life cycle to provide researchers a suite of tools to conduct and manage their research. Further investigating educational license discounts for courses using eLabJournal, RSpace, Protocols.io, Open Science Framework, LabArchives or other ERNs currently funded by student course fees via grant funded projects are key implications.\n\n\nSocial implications\nSocial implications include the research computing environments of researchers that use ELN solutions approved through institutional risk assessment for open data are in compliance with university regulatory frameworks for use of the software in research.\n\n\nOriginality/value\nThe originality of this study includes risk assessments of ELNs solutions to better guide researchers in the selection process. To the best of the author’s knowledge, this survey was the first exploration of ELN on campus resulting in a final report to senior stakeholders. This study also highlights a developing grant proposal to further develop support across labs and campus.\n", "venue": "Digital Library Perspectives", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-06-29", "journal": {"name": "Digital Library Perspectives"}, "authors": [{"authorId": "2138555579", "name": "Plato L. Smith II"}], "citations": [{"paperId": "3307272aad3534594948716b69a4f71483b11191", "title": "Leveraging socio-technical processes to support researchers"}]}
