{"paperId": "c4b838130d140e641115fe0c8f5105f08878c384", "publicationVenue": {"id": "ed5af7a7-0708-4dca-8930-368203e65b06", "name": "Medical Teacher", "type": "journal", "alternate_names": ["Med Teach"], "issn": "0142-159X", "url": "http://informahealthcare.com/journal/mte", "alternate_urls": ["http://www.tandfonline.com/openurl?genre=journal&stitle=imte20", "http://medicalteacher.org/"]}, "title": "Data sharing and big data in health professions education: Ottawa consensus statement and recommendations for scholarship.", "abstract": "Changes in digital technology, increasing volume of data collection, and advances in methods have the potential to unleash the value of big data generated through the education of health professionals. Coupled with this potential are legitimate concerns about how data can be used or misused in ways that limit autonomy, equity, or harm stakeholders. This consensus statement is intended to address these issues by foregrounding the ethical imperatives for engaging with big data as well as the potential risks and challenges. Recognizing the wide and ever evolving scope of big data scholarship, we focus on foundational issues for framing and engaging in research. We ground our recommendations in the context of big data created through data sharing across and within the stages of the continuum of the education and training of health professionals. Ultimately, the goal of this statement is to support a culture of trust and quality for big data research to deliver on its promises for health professions education (HPE) and the health of society. Based on expert consensus and review of the literature, we report 19 recommendations in (1) framing scholarship and research through research, (2) considering unique ethical practices, (3) governance of data sharing collaborations that engage stakeholders, (4) data sharing processes best practices, (5) the importance of knowledge translation, and (6) advancing the quality of scholarship through multidisciplinary collaboration. The recommendations were modified and refined based on feedback from the 2022 Ottawa Conference attendees and subsequent public engagement. Adoption of these recommendations can help HPE scholars share data ethically and engage in high impact big data scholarship, which in turn can help the field meet the ultimate goal: high-quality education that leads to high-quality healthcare.", "venue": "Medical Teacher", "year": 2024, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2024-02-02", "journal": {"name": "Medical teacher", "pages": "\n          1-15\n        "}, "authors": [{"authorId": "2182720741", "name": "Kulmakan Kulasegaram"}, {"authorId": "2154588359", "name": "L. Grierson"}, {"authorId": "25929509", "name": "C. Barber"}, {"authorId": "6864534", "name": "Saad Chahine"}, {"authorId": "29812854", "name": "F. C. Chou"}, {"authorId": "2128801821", "name": "J. Cleland"}, {"authorId": "51168025", "name": "R. Ellis"}, {"authorId": "2248962400", "name": "Eric S Holmboe"}, {"authorId": "2150532765", "name": "Martin V Pusic"}, {"authorId": "2282372066", "name": "Daniel Schumacher"}, {"authorId": "143921274", "name": "M. Tolsgaard"}, {"authorId": "2274684585", "name": "Chin-Chung Tsai"}, {"authorId": "2282372600", "name": "Elizabeth Wenghofer"}, {"authorId": "4818243", "name": "C. Touchie"}], "citations": []}
