{"paperId": "c4c10d58a89ea986b51439846e1148c8c01dd195", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Decision Support System Driven by Thermo-Complexity: Scenario Analysis and Data Visualization", "abstract": "The present modelling aims to construct a computational information representation system useful for decision support system (DSS) solutions in the realization of intelligent systems or complex systems analysis solutions. Starting from an n-dimensional space (with n ≥ 7) represented by problem variables (referred to as CSF—Critical Success Factors), a dimensional embedding procedure is used to transition to a two-dimensional space. In the two-dimensional space, thanks to new lattice motion algorithms, the decision support system can determine the optimal solution with a lower computational cost based on the decision-maker’s preferences. Finally, thanks to an algorithm that takes into account the hierarchical order of importance of the seven CSFs as per the expert’s liking or according to his optimization logics, a return is made to the n-dimensional space and the final solution in the original space. As we will see, the starting and ending states in the n-dimensional space (referred to as micro-states) when projected into the two-dimensional space generate states (referred to as macro-states) which are degenerate. In other words, the correspondence between micro-states and macro-states is not one-to-one, as multiple micro-states correspond to one macro-state. Therefore, in relation to the decision-maker’s preferences, it will be the responsibility of the decision support system to provide the decision-maker with the micro-state of interest in the n-dimensional space (dimensional emergence procedure), starting from the obtained optimal macro-state. This result can be achieved starting from a flat chain of sensors capable of measuring/emulating certain specific parameters of interest. As we will see, it emerges that by considering random–exhaustive rolling value paths in order to track and potentially intervene to rebalance a dynamic system representing the state of stress/sensing of a system of interest, we are using the most general and, therefore, complex hypotheses of ergodic theory. In this work, we will focus on the representation of information in n-dimensional and two-dimensional spaces, as well as construct evaluation scenarios. We will also show the results of the decision support system in some cases of specific interest, thanks to a specific lattice motion algorithm of the realized decision-making environment.", "venue": "Applied Sciences", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-03-12", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "2291216388", "name": "Gerardo Iovane"}, {"authorId": "2269274118", "name": "Marta Chinnici"}], "citations": []}
