{"paperId": "c4c9d599724c6605284c8286c3d3abb407fb457d", "publicationVenue": {"id": "ca7dcd95-d974-4c9a-a722-6d7715b2ce9f", "name": "Journal of Internet Services and Information Security", "type": "journal", "alternate_names": ["J Internet Serv Inf Secur"], "issn": "2182-2069", "url": "http://www.jisis.org/"}, "title": "Quantitative Security Risk Assessment for Industrial Control Systems: Research Opportunities and Challenges", "abstract": "Due to the gradual implementation of the Industry 4.0 vision, information technology is becoming increasingly important in industrial control systems (ICSs), such as production systems. Although the digital transformation of ICSs represents the foundation for resource-efficient and flexible industrial plants, this change increases the attack surface, leading to the emergence of new threats. Moreover, ICSs constitute an attractive target for attackers who may disrupt plant operation, causing severe physical/material damages (PD/MD), such as machinery breakdowns. In further consequence, asset owners (i.e., plant operators) may suffer from business interruption (BI) and loss of profit (LOP). Thus, security risks must be managed in all phases of the ICSs’ lifecycle, starting from engineering to decommissioning. Risk assessment is an integral part of the risk management process in which risks are identified, analyzed, and evaluated. In this context, the quantitative assessment is vital, since measuring cyber risks is required to establish an effective decision-making process for security investments. This survey article reviews the state of the art concerning quantitative security risk assessments for ICSs and identifies promising opportunities for future research and associated challenges. We report that the current state of quantitatively assessing cyber risks for ICSs is characterized by the absence of adequate (dynamic) security risk assessment methods tailored to the peculiarities of ICSs. This is aggravated by the fact that the complexity of the threat landscape increases in the light of Industry 4.0, and historical data on security incidents is lacking. As a consequence, asset owners may fail to quantitatively assess their cyber risk exposure, leaving them uncertain about security decisions. Furthermore, if they purchase cyber insurance in order to transfer the risks of non-PD BI, the underlying problem remains unsolved as (re)insurers potentially take on these unassessed risks. As an initial step to guide individuals seeking to improve the quantification of cyber risks pertaining to ICSs, this article concludes by outlining several directions for further research that are worth pursuing.", "venue": "Journal of Internet Services and Information Security", "year": 2019, "fieldsOfStudy": ["Business", "Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "J. Internet Serv. Inf. Secur.", "pages": "52-73", "volume": "9"}, "authors": [{"authorId": "47307908", "name": "Matthias Eckhart"}, {"authorId": "2067722183", "name": "Bernhard Brenner"}, {"authorId": "1745968", "name": "Andreas Ekelhart"}, {"authorId": "1797267", "name": "E. Weippl"}], "citations": [{"paperId": "80e0b66e277c50b046af36693911a704dbc73ca6", "title": "Dynamic Risk Assessment in Cybersecurity: A Systematic Literature Review"}, {"paperId": "11dee2d458c3b850371387e30963e56072f2945a", "title": "A decision support model for evaluating risks in the digital economy transformation of the manufacturing industry"}, {"paperId": "1605bf39cf37c161fe3479b9031c028f84eec1c0", "title": "Consider the Consequences: A Risk Assessment Approach for Industrial Control Systems"}, {"paperId": "983d2af08a6f0341ff9a170cec797812c2667ace", "title": "Automated Security Risk Identification Using AutomationML-Based Engineering Data"}, {"paperId": "534b2305aaa3c76ebe19a73285ad3d2be4bbe38a", "title": "Investigation of Resource Constraints for the Automation of Industrial Security Risk Assessments"}, {"paperId": "d37b62eb68d89e1596a91099e8246c3aed438bb2", "title": "Transformation Management Capabilities for Digital Transformation Initiatives: A Construct Conceptualization in Alignment with the Dynamic Capabilities Framework"}, {"paperId": "e8d3539f3fb427fcd5c496768ee18c37b6962492", "title": "Study Cybersecurity of Cyber Physical System in the Virtual Environment: A Survey and New Direction"}, {"paperId": "f178683eff8417b6947c4fb90bca52d33dea2861", "title": "Project portfolio risk assessment in digital transformation: challenges and opportunities"}, {"paperId": "2a41cbd879284b9392dc48f49f5026ef2f3f1dc7", "title": "Respite for SMEs: A Systematic Review of Socio-Technical Cybersecurity Metrics"}, {"paperId": "a67d0f78031579b17015637b97e1c2e83000b978", "title": "An interval type-2 fuzzy reasoning model for digital transformation project risk assessment"}, {"paperId": "16542ec05fc5171bb06c5454eaa739e6d3b31974", "title": "Investment Priority Analysis of ICS Information Security Resources in Smart Mobile IoT Network Environment Using the Analytic Hierarchy Process"}, {"paperId": "7ce456d122dd5be24cf6c62c4d9b3fe8b2127c76", "title": "An efficient security data-driven approach for implementing risk assessment"}, {"paperId": "aee84f5b952fbf1f0a0a72fc3a60a363889a6423", "title": "Towards Automated Security Evaluation within the Industrial Reference Architecture"}, {"paperId": "01173de78bc7442e7e359dc644bcc4fe4d0c9f79", "title": "Managing Industrial Control Systems Security Risks for Cyber Insurance (Dagstuhl Seminar 21451)"}]}
