{"paperId": "c4ec774e60567107847063eeb8426a33d5902c22", "publicationVenue": {"id": "65f041c6-5349-4d5c-9ce7-d5afd7bd6b6f", "name": "International Symposium on Computational Intelligence and Informatics", "type": "conference", "alternate_names": ["CINTI", "Int Symp Comput Intell Informatics"]}, "title": "Insights from a high-performance Open-Communication Framework for advanced industrial networks", "abstract": "The Industrial Internet of Things (IIoT) is a network of smart industrial equipment that can connect with one another to improve the efficiency of industrial and manufacturing activities. When IIoT is applied to industrial settings and processes, it results in the creation of a smart manufacturing system, which consists of an intelligent network of industrial components that interact with each other to improve manufacturing and industrial process performance. To accelerate platform development, it is critical to select an appropriate industrial communication protocol. Recently, researchers have developed a number of Open-Communication Framework that can be utilized to design new smart manufacturing systems. Furthermore, the cost of utilizing communication platforms must be considered. Even if a company decides to build its own platform, the initial building costs are often substantial, as is the cost of updating and maintaining the platform on a regular basis. In this article, we will discuss the choices for an Open-Communication Framework for advanced manufacturing systems.", "venue": "International Symposium on Computational Intelligence and Informatics", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-11-18", "journal": {"name": "2021 IEEE 21st International Symposium on Computational Intelligence and Informatics (CINTI)", "pages": "000253-000258"}, "authors": [{"authorId": "2134580293", "name": "Ravi Sharma"}, {"authorId": "9348277", "name": "Balázs Villányi"}], "citations": [{"paperId": "0f1d51f4ca165997e9ac31224521a300c71c8c0b", "title": "A Survey on the Network Models applied in the Industrial Network Optimization"}, {"paperId": "2cac179e064682f2c72f5946531add76bb335c21", "title": "Converging Telco-Grade Solutions 5G and beyond to Support Production in Industry 4.0"}, {"paperId": "8919fd5bac445c546c25540a965b25e945a30d5c", "title": "The fundamentals and strategies of maintenance, repair, and overhaul (MRO) in Industry 4.0"}]}
