{"paperId": "c4f32b7976cfeff2ad22ed761e6e01b4d4855f48", "publicationVenue": {"id": "8113a511-e0d9-4231-a1bc-0bf5d0212a4e", "name": "Symposium on the Theory of Computing", "type": "conference", "alternate_names": ["Symp Theory Comput", "STOC"], "url": "http://acm-stoc.org/"}, "title": "Brooks’ theorem in graph streams: a single-pass semi-streaming algorithm for ∆-coloring", "abstract": "Every graph with maximum degree Δ can be colored with (Δ+1) colors using a simple greedy algorithm. Remarkably, recent work has shown that one can find such a coloring even in the semi-streaming model: there exists a randomized algorithm that with high probability finds a (Δ+1)-coloring of the input graph in only O(n·logn) space assuming a single pass over the edges of the graph in any arbitrary order. But, in reality, one almost never needs (Δ+1) colors to properly color a graph. Indeed, the celebrated Brooks’ theorem states that every (connected) graph beside cliques and odd cycles can be colored with Δ colors. Can we find a Δ-coloring in the semi-streaming model as well? We settle this key question in the affirmative by designing a randomized semi-streaming algorithm that given any graph, with high probability, either correctly declares that the graph is not Δ-colorable or outputs a Δ-coloring of the graph. The proof of this result starts with a detour. We first (provably) identify the extent to which the previous approaches for streaming coloring fail for Δ-coloring: for instance, all these approaches can handle streams with repeated edges and they can run in o(n2) time – we prove that neither of these tasks is possible for Δ-coloring. These impossibility results however pinpoint exactly what is missing from prior approaches when it comes to Δ-coloring. We then build on these insights to design a semi-streaming algorithm that uses (i) a novel sparse-recovery approach based on sparse-dense decompositions to (partially) recover the ”problematic” subgraphs of the input—the ones that form the basis of our impossibility results—and (ii) a new coloring approach for these subgraphs that allows for recoloring of other vertices in a controlled way without relying on local explorations or finding ”augmenting paths” that are generally impossible for semi-streaming algorithms. We believe both these techniques can be of independent interest.", "venue": "Symposium on the Theory of Computing", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2022-03-21", "journal": {"name": "Proceedings of the 54th Annual ACM SIGACT Symposium on Theory of Computing"}, "authors": [{"authorId": "35067898", "name": "Sepehr Assadi"}, {"authorId": "2108179629", "name": "Pankaj Kumar"}, {"authorId": "2159548298", "name": "Parth Mittal"}], "citations": [{"paperId": "2cb253429839576df35839fbc381480444a41aed", "title": "Recent Advances in Multi-Pass Graph Streaming Lower Bounds"}, {"paperId": "2fcd2dad5d9af04c31c4f7e77b062392f12ea1ec", "title": "Streaming Edge Coloring with Asymptotically Optimal Colors"}, {"paperId": "9761c58c2484841b05ccee4dab385cb0560f932e", "title": "Coloring Fast with Broadcasts"}, {"paperId": "3a95b745364c582ef14ad4a53e03cc4b04364293", "title": "A Distributed Palette Sparsification Theorem"}, {"paperId": "0792d8ad34761764bbd72edc900fa459a4933dfa", "title": "Coloring in Graph Streams via Deterministic and Adversarially Robust Algorithms"}, {"paperId": "9cbd5f205ab309397f05aaf9fb1dbc7dae8f9aac", "title": "Fast Distributed Brooks' Theorem"}, {"paperId": "3a3c0ec90ea20b1b08351a3928c2ed69f8ab044c", "title": "Rounds vs Communication Tradeoffs for Maximal Independent Sets"}, {"paperId": "866764ad8fce6833ffd17312581e17571d397b60", "title": "Deterministic graph coloring in the streaming model"}]}
