{"paperId": "c4fd3a129b5c969c4beaf8f26e55ebe5fa0279a1", "publicationVenue": {"id": "02a4454a-84c8-471c-9b40-cc045d4f3223", "name": "Security and Communication Networks", "type": "journal", "alternate_names": ["Secur Commun Netw"], "issn": "1939-0122", "url": "https://www.hindawi.com/journals/scn/", "alternate_urls": ["http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1939-0122", "http://www.interscience.wiley.com/journal/security"]}, "title": "Multi-Party Verifiable Privacy-Preserving Federated k-Means Clustering in Outsourced Environment", "abstract": "As a commonly used algorithm in data mining, clustering has been widely applied in many fields, such as machine learning, information retrieval, and pattern recognition. In reality, data to be analyzed are often distributed to multiple parties. Moreover, the rapidly increasing data volume puts heavy computing pressure on data owners. Thus, data owners tend to outsource their own data to cloud servers and obtain data analysis results for the federated data. However, the existing privacy-preserving outsourced \n \n k\n \n -means schemes cannot verify whether participants share consistent data. Considering the scenarios with multiple data owners and sensitive information security in an outsourced environment, we propose a verifiable privacy-preserving federated \n \n k\n \n -means clustering scheme. In this article, cloud servers and participants perform \n \n k\n \n -means clustering algorithm over encrypted data without exposing private data and intermediate results in each iteration. In particular, our scheme can verify the shares from participants when updating the cluster centers based on secret sharing, hash function and blockchain, so that our scheme can resist inconsistent share attacks by malicious participants. Finally, the security and experimental analysis are carried out to show that our scheme can protect private data and get high-accuracy clustering results.", "venue": "Security and Communication Networks", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-12-28", "journal": {"name": "Security and Communication Networks"}, "authors": [{"authorId": "2141659978", "name": "Ruiqi Hou"}, {"authorId": "2053847239", "name": "Fei Tang"}, {"authorId": "2153545547", "name": "Shikai Liang"}, {"authorId": "2148254699", "name": "Guowei Ling"}], "citations": [{"paperId": "5e6cfbfe53bb6440ad3df3b82f435c3d8bad347e", "title": "Federated K-means Clustering"}, {"paperId": "e904e1694d5e65964a9c93a26e266ff230bbce98", "title": "An Overview of Privacy Dimensions on the Industrial Internet of Things (IIoT)"}, {"paperId": "b01ddc70f7c025135072ad011c78c4fc7b2810f9", "title": "Distributed Intelligent Model for Privacy and Secrecy in Preschool Education"}, {"paperId": "fb68ce2242026021732237867a522818e9b63c19", "title": "Federated Auto-Meta-Ensemble Learning Framework for AI-Enabled Military Operations"}, {"paperId": "b68088b4b13d1803b2226e9c93de6c4b7ea49bcf", "title": "Privacy-Preserving Sports Wearable Data Fusion Framework"}, {"paperId": "5e42bb55cb73a72335f57016d96a7b12a1ebeefe", "title": "Recommendation System for Privacy-Preserving Education Technologies"}, {"paperId": "bb92b8c230de8ab421d037c5df90f2ba22acc185", "title": "A Privacy-Preserved Variational-Autoencoder for DGA Identification in the Education Industry and Distance Learning"}, {"paperId": "8e2306a40ee2561985a922dd9d4c8bb05f3c1cc8", "title": "Adaptive Reservoir Neural Gas: An Effective Clustering Algorithm for Addressing Concept Drift in Real-Time Data Streams"}]}
