{"paperId": "c4ffa3b36e0e0e3077037e6504b60a3ad04c49a9", "publicationVenue": {"id": "042bc893-3752-44f7-9e77-c59ce54b1b11", "name": "IEEE/IFIP Network Operations and Management Symposium", "type": "conference", "alternate_names": ["Network Operations and Management Symposium", "NOMS", "IEEE/IFIP Netw Oper Manag Symp", "Netw Oper Manag Symp"], "url": "http://www.comsoc.org/"}, "title": "WRS: Workflow Retrieval System for Cloud Automatic Remediation", "abstract": "Remediation systems in modern information infrastructure gradually take over the increasing workload of unexpected events from operators. The core logic in such systems — remediation rule — still needs operators to fill in manually, which is a tedious and error-prone process. We propose Workflow Retrieval System (a.k.a. WRS), which helps the operator to build remediation rules.WRS is a recommendation system that recommends structures from existing rules to operators when they are creating new ones. WRS formalizes the workflows in remediation rules as trees and extracts representative atomic structures from them. Then WRS organizes atomic structures in two ways to accelerate the later retrieval — a two-level hierarchy which helps searching similar structures, and a keyword indexing structure which helps searching by words. With the two retrieval structures, we build two applications: one is real-time workflow auto completion application which recommends remaining structures based on the existing partial structure, and another is workflow recommendation where WRS recommends atomic structures based on the description of the remediation symptoms.We prototype WRS and evaluate it with legacy device vendors’ operation manual. Our evaluation shows that WRS reasonably extracts and organizes atomic structures in remediation workflows, and the two applications atop it show fast execution time and high accuracy.", "venue": "IEEE/IFIP Network Operations and Management Symposium", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-04-25", "journal": {"name": "NOMS 2022-2022 IEEE/IFIP Network Operations and Management Symposium", "pages": "1-10"}, "authors": [{"authorId": "10024785", "name": "Hongyi Huang"}, {"authorId": "2139653597", "name": "Wenfei Wu"}, {"authorId": "2054575610", "name": "Shimin Tao"}], "citations": []}
