{"paperId": "c50647619cdef658a645bbf1d412c172ce7b40eb", "publicationVenue": null, "title": "A Systematic Review on Osmotic Computing", "abstract": "Osmotic computing in association with related computing paradigms (cloud, fog, and edge) emerges as a promising solution for handling bulk of security-critical as well as latency-sensitive data generated by the digital devices. It is a growing research domain that studies deployment, migration, and optimization of applications in the form of microservices across cloud/edge infrastructure. It presents dynamically tailored microservices in technology-centric environments by exploiting edge and cloud platforms. Osmotic computing promotes digital transformation and furnishes benefits to transportation, smart cities, education, and healthcare. In this article, we present a comprehensive analysis of osmotic computing through a systematic literature review approach. To ensure high-quality review, we conduct an advanced search on numerous digital libraries to extracting related studies. The advanced search strategy identifies 99 studies, from which 29 relevant studies are selected for a thorough review. We present a summary of applications in osmotic computing build on their key features. On the basis of the observations, we outline the research challenges for the applications in this research field. Finally, we discuss the security issues resolved and unresolved in osmotic computing.", "venue": "ACM Trans. Internet Things", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-02-15", "journal": {"name": "ACM Transactions on Internet of Things", "pages": "1 - 30", "volume": "3"}, "authors": [{"authorId": "118156376", "name": "Benazir Neha"}, {"authorId": "2703203", "name": "S. K. Panda"}, {"authorId": "3354441", "name": "P. Sahu"}, {"authorId": "5203143", "name": "Kshira Sagar Sahoo"}, {"authorId": "1764455", "name": "A. Gandomi"}], "citations": [{"paperId": "d3b884792f81a0e65923147ec75a06c9430273f0", "title": "Energy and latency-balanced osmotic-offloading algorithm for healthcare systems"}, {"paperId": "115efb6260148f95ac6b93438bd18cb4adfdc77d", "title": "Modern Computing: Vision and Challenges"}, {"paperId": "033958f1cae4bbaa813ec6765f9e5a8b290dd40b", "title": "An Efficient Physiological Record System Using Osmotic Computing Paradigm"}, {"paperId": "e6dacbcb019c933a6e4b8380168a433ecf916eb0", "title": "Efficient Service Routing and Load Allocation Strategies for CloudSim-Enabled Visual Modeling Environment"}, {"paperId": "490d715ca6f72f776cf514601f98cda57f63d914", "title": "Next Generation Task Offloading Techniques in Evolving Computing Paradigms: Comparative Analysis, Current Challenges, and Future Research Perspectives"}, {"paperId": "26029d76a3b9e1c0e44fa36a61f903a645415c67", "title": "Solar Energy-Based Virtual Machine Placement Algorithm for Geo-Distributed Datacenters"}, {"paperId": "023d7c96aa8a8443805f629b2c9dc0cce06dac0b", "title": "Deep Learning Distribution Model Using Osmotic Computing"}, {"paperId": "9643f54e68f33e774febc741ac367488243121f7", "title": "Stochastic Performance Analysis of Phase Decomposition in Hyperledger Fabric"}, {"paperId": "1111bfb6808b3489c460c9a3931f61ca17831798", "title": "Efficient Real-Time Task-Based Scheduling Algorithms for IoT-Fog-Cloud Architecture"}, {"paperId": "3f6a981773bcc5da3d9645312cc04cc096a2a8cc", "title": "Green Orchestration of Cloud-Edge Applications: State of the Art and Open Challenges"}, {"paperId": "a60a33e984fcd47133ee54a862b20916fd5dcb32", "title": "Assessing and enhancing a Cloud-IoT monitoring service over federated testbeds"}, {"paperId": "58bab021f7fad6c96af100ee8807945907c572bd", "title": "S-Edge: heterogeneity-aware, light-weighted, and edge computing integrated adaptive traffic light control framework"}, {"paperId": "39177fe72677f9bdf8c154b1ba2d896d1e71f1ba", "title": "MicroFog: A Framework for Scalable Placement of Microservices-based IoT Applications in Federated Fog Environments"}, {"paperId": "a6be27e5da88a5055750e6dd350db5b3643bed7d", "title": "Novel Service Broker and Load Balancing Policies for CloudSim-Based Visual Modeller"}, {"paperId": "0dd0c39963652f52d818402fe6b3bca36110b9de", "title": "Extensive performance analysis of OpenDayLight (ODL) and Open Network Operating System (ONOS) SDN controllers"}, {"paperId": "3e5d29625d095e724e8c1676bad3e97f375e9580", "title": "Semantic models for IoT sensing to infer environment-wellness relationships"}, {"paperId": "7058da851f1fc2444dd39456e9a8bf22420ef1c1", "title": "A Cost-Variant Renewable Energy-Based Scheduling Algorithm for Cloud Computing"}, {"paperId": "fd90d6ba7775f0dae0245ee0385de03aab6a0cbf", "title": "Priority-Aware Resource Allocation Algorithm for Cloud Computing"}, {"paperId": "92d096c3d38025afda608168d1feea9c3a3bb54f", "title": "Cloud Task Scheduling Algorithms using Teaching-Learning-Based Optimization and Jaya Algorithm"}, {"paperId": "9998223c0da61c8f28dfec86bf7958fb975d9c59", "title": "Placement of Microservices-based IoT Applications in Fog Computing: A Taxonomy and Future Directions"}, {"paperId": "4db5ae4554c262c03879cd0c35247688d4fb7838", "title": "A Data Aggregation Approach Exploiting Spatial and Temporal Correlation among Sensor Data in Wireless Sensor Networks"}, {"paperId": "d709e0f39a50879fcaa77bdf34c269a5ed1c8fe2", "title": "Edge-Cloud Continuum Solutions for Urban Mobility Prediction and Planning"}, {"paperId": "b02364ab877be7f412027c769eb368a8c4c10d35", "title": "Telematics and Informatics Reports"}, {"paperId": "56cf6180c047db7c9d29e30f6b9e8f174175da6d", "title": "The Journal of Systems & Software"}]}
