{"paperId": "c506fd2ae383b522d5c605aabca8b3c243b81988", "publicationVenue": {"id": "01d70615-73ab-49cb-8043-a41bc433417e", "name": "Industry & higher education", "type": "journal", "alternate_names": ["Ind high educ", "Ind  high educ", "Industry and higher education"], "issn": "0950-4222", "url": "http://ihe.sagepub.com/"}, "title": "Employability traits for engineers: A competencies-based approach", "abstract": "Examination of the transition of successful students from university into the labour market reveals a significant gap between the competencies acquired during higher education and those needed in the workplace. In this article, the authors discuss a research study undertaken to analyse the employability traits of engineers who had recently graduated. In order to do this, an estimation was made of both acquired and applied competencies in each area of engineering examined (computer engineers, naval engineers and industrial engineers). This analysis enabled the calculation of a choice model to clarify which competencies act as a stimulus for employment and which discourage recruitment. The results provide clear policy directions both for management teams in each of the three areas of engineering and for universities.", "venue": "Industry & higher education", "year": 2019, "fieldsOfStudy": ["Psychology"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-06-17", "journal": {"name": "Industry and Higher Education", "pages": "308 - 326", "volume": "33"}, "authors": [{"authorId": "1486253698", "name": "Carlos Pais-Montes"}, {"authorId": "1413766654", "name": "María Jesús Freire-Seoane"}, {"authorId": "1403209900", "name": "Beatriz López-Bermúdez"}], "citations": [{"paperId": "ee5477439ac9b6ed0fb3fc6c40099fa8ff8277f6", "title": "Competencies in Higher Education and the Labor Market: A Sociocognitive Analysis of the Problem of Integration"}, {"paperId": "5c9066b4c49003338422d145124448e2eed4c8eb", "title": "Are Professional Skills Learnable? Beliefs and Expectations Among Computing Graduates"}, {"paperId": "897cca34367aeff02fc7fc1ee4a096c60b480544", "title": "Collaborative governance for aviation approved training organisation: an adapted model for multi-stakeholder collaboration"}, {"paperId": "b175b682a591c74b912cad305de29c840538ef34", "title": "Two Worlds Apart? Engineering Students’ Perceptions of Workplace English"}, {"paperId": "19b2d5725065b1d03bc40473436b2472f5643595", "title": "Engineering Student Profile Related to the Market of Operation: Competence Perspective"}, {"paperId": "af1832d096f4a9f1609736b45aec862ff475b5eb", "title": "Vocational education in tourism at undergraduate level in Himachal Pradesh, India: exploring the gap between industry expectations and academic deliverables"}, {"paperId": "41f73ae2cddcdd28c46769a2be6c77c5b7299434", "title": "Establishing the Delphi Technique for Validity Measure of Employability Skills in Industrial Work Practice Program"}, {"paperId": "f34b746067ef681f3cb2a81d29615cea06c47a11", "title": "Fatores influenciadores da empregabilidade de alunos de instituições de ensino superior"}, {"paperId": "aede5dc97f8fc21c3218f269f633696385e074c0", "title": "The what – how – why of English in the workplace: perspectives from Turkish engineers"}, {"paperId": "2e80e3034bd58c9f1e2950a50a364af7b3117f24", "title": "Human resources development as an element of sustainable HRM – with the focus on production engineers"}, {"paperId": "3deafc5c42d5dea38254225f3cfd6bd99f45d1f7", "title": "Graduate Employability and Competence Development in Higher Education—A Systematic Literature Review Using PRISMA"}, {"paperId": "ccd59e7edf832ee80a932ae74b78f69f01f7710d", "title": "The Challenges of Industrial Engineer Management Skills in Industry 4.0"}, {"paperId": "da5d207b523438d645fe9018de492fe6be50383d", "title": "Competence-based approach in the training of physicists"}]}
