{"paperId": "c5239dd81914705a9cd7eaebbc854b7224cd784d", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "A Novel Approach to the Optimization of a Public Bus Schedule Using K-Means and a Genetic Algorithm", "abstract": "With the continuing economic growth of developing countries, the populations of their urban areas are increasing dramatically. In view of this trend, the optimization of bus service scheduling has become an important task. The efficiency of a transport system depends on several different planning processes, and the balance between these elements is rather complex. In this paper, we consider timetabling and vehicle allocation as the bases for our work. With the aim of providing a reliable service to passengers at a reasonable cost, we focus on the optimization of a bus schedule using a method based on K-means and a genetic algorithm. Our approach starts with parameter setting and data preparation, using a dataset of real bus operating schedules. Three elements are identified from this dataset: the time zones in which the bus service operates, the number of stops made by each bus in each trip, and the dwell time at bus stops. K-means clustering is used to identify moderate operation conditions. The outcome of the K-means algorithm is used as the objective fitness value for optimization of the bus schedule using a genetic algorithm. The results of experiments show that the proposed optimization model can improve the dwell time while maintaining the operating cost at its current level or less, and a remarkable increase in the operation rate is achieved in the case study. The proposed model is able to both effectively optimize the financial outlay and enable bus operators to meet passenger demand in a mutually satisfactory way.", "venue": "IEEE Access", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "73365-73376", "volume": "9"}, "authors": [{"authorId": "9493172", "name": "Yasuki Shima"}, {"authorId": "40252282", "name": "R. A. Kadir"}, {"authorId": "2100820756", "name": "Fathelalem Hija Ali"}], "citations": [{"paperId": "62aed7348e7cc1a34f87c5f2fbd1183ea01a7cc7", "title": "A Dynamic Programming with Cluster First - Route Second Approach for Solving Vehicle with Pickup and Delivery Problem in Retail Industry"}, {"paperId": "7a4327e9c38a5fc84cbcd24f16406fabc54006b4", "title": "A review on sustainability, Industry 4.0 and collaboration implications in vehicle allocation operations"}, {"paperId": "d036ee7c4efae4d294d9e34891d64feecbdd648d", "title": "Optimization of Public Bus Scheduling using Real-Time Online Information"}, {"paperId": "f0a055d301aa3237013719b71a8de1ac1098bf86", "title": "Integrated Travel Route Information System with Ferry Schedule by Using Dijkstra Algorithm"}, {"paperId": "04c0ae3df8aab55ebef51e98a74e14c5e1c3962e", "title": "Dynamic Timetable and Route Optimized Public Transport System"}, {"paperId": "b779cedd492b1cfdafc8921e75fc94cac584b7ce", "title": "Adaptive Grid Partitioning Considering Power Supply and Load Distribution"}]}
