{"paperId": "c52cfe08452f192d1fbf9cd215646466fa041da1", "publicationVenue": {"id": "166fd2b5-a928-4a98-a449-3b90935cc101", "name": "IACR Cryptology ePrint Archive", "type": "journal", "alternate_names": ["IACR Cryptol eprint Arch"], "url": "http://eprint.iacr.org/"}, "title": "Evaluating GPT-4's Proficiency in Addressing Cryptography Examinations", "abstract": ". In the rapidly advancing domain of artificial intelligence, ChatGPT, powered by the GPT-4 model, has emerged as a state-of-the-art interactive agent, exhibiting substantial capabilities across various domains. This paper aims to assess the efficacy of GPT-4 in addressing and solving problems found within cryptographic examinations. We devised a multi-faceted methodology, presenting the model with a series of cryptographic questions of varying complexities derived from real academic examinations. Our evaluation encompasses both classical and modern cryptographic challenges, focusing on the model’s ability to understand, interpret, and generate correct solutions while discerning its limitations. The model was challenged with a spectrum of cryptographic tasks, earning 201 out of 208 points by solving fundamental queries inspired by an oral exam, 80.5 out of 90 points on a written Crypto 1 exam, and 287 out of 385 points on advanced exercises from the Crypto 2 course. The results demonstrate that while GPT-4 shows significant promise in grasping fundamental cryptographic concepts and techniques, certain intricate problems necessitate domain-specific knowledge that may sometimes lie beyond the model’s general training. Insights from this study can provide educators, researchers, and examiners with a deeper understanding of how cutting-edge AI models can be both an asset and a potential concern in academic settings related to cryptology. To enhance the clarity and coherence of our work, we utilized ChatGPT-4 to help us in formulating sentences in this paper.", "venue": "IACR Cryptology ePrint Archive", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-03-23", "journal": {"name": "IACR Cryptol. ePrint Arch.", "pages": "1551", "volume": "2023"}, "authors": [{"authorId": "144705467", "name": "Vasily Mikhalev"}, {"authorId": "1861346", "name": "Nils Kopal"}, {"authorId": "1683752", "name": "B. Esslinger"}], "citations": []}
