{"paperId": "c549ed48694a8f63b9d8ed999cde1ea8d7015ddf", "publicationVenue": {"id": "2dc4386c-f418-4a62-a2c3-6b89b06981be", "name": "Journal of Intelligent & Fuzzy Systems", "type": "journal", "alternate_names": ["Journal of Intelligent and Fuzzy Systems", "J Intell  Fuzzy Syst", "J Intell Fuzzy Syst"], "issn": "1064-1246", "url": "http://content.iospress.com/journals/journal-of-intelligent-and-fuzzy-systems/", "alternate_urls": ["http://www.iospress.nl/journal-of-intelligent-fuzzy-systems/", "https://www.iospress.nl/html/10641246.php"]}, "title": "Case-based reasoning adaptation based on fuzzy gravitational search algorithm for disaster emergency plan", "abstract": "Disasters can result in substantial destructive damages to the world. Emergency plan is vital to deal with these disasters. It is still difficult for the traditional CBR to generate emergency plans to meet requirements of rapid responses. An integrated system including Case-based reasoning (CBR) and gravitational search algorithm (GSA) is proposed to generate the disaster emergency plan. Fuzzy GSA (FGSA) is developed to enhance the convergence ability and accomplish the case adaptation in CBR. The proposed algorithm dynamically updates the main parameters of GSA by introducing a fuzzy system. The FGSA-CBR system is proposed, in which fitness function is defined based on the effectiveness of disaster emergency management. The comparison results have revealed that the proposed algorithm has good performances compared with the original GSA and other algorithms. A gas leakage accident is taken as an empirical study. The results have demonstrated that the FGSA-CBR has good performances when generating the disaster emergency plan. The combination of CBR and FGSA can realize the case adaptation, which provides a useful approach to the real applications.", "venue": "Journal of Intelligent & Fuzzy Systems", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "J. Intell. Fuzzy Syst.", "pages": "11007-11022", "volume": "40"}, "authors": [{"authorId": "47166232", "name": "Xiaobing Yu"}, {"authorId": "50187974", "name": "Xianrui Yu"}, {"authorId": "2108064515", "name": "Xueying Zhang"}], "citations": [{"paperId": "bcc3d46a056791be5797eae757b5fbdc2e0f523f", "title": "A Pre-Generation of Emergency Reference Plan Model of Public Health Emergencies with Case-Based Reasoning"}, {"paperId": "886e9ebe4b10604e0a4c18a331bbdeccd7741929", "title": "Quick prediction of seismic casualties using fuzzy Case-Based Reasoning technology"}]}
