{"paperId": "c556bb448d681514af585c357d6fd98287d3e5f2", "publicationVenue": {"id": "bdc2e585-4e48-4e36-8af1-6d859763d405", "name": "AAAI Conference on Artificial Intelligence", "type": "conference", "alternate_names": ["National Conference on Artificial Intelligence", "National Conf Artif Intell", "AAAI Conf Artif Intell", "AAAI"], "url": "http://www.aaai.org/"}, "title": "Efficient Training of Large-scale Industrial Fault Diagnostic Models through Federated Opportunistic Block Dropout", "abstract": "Artificial intelligence (AI)-empowered industrial fault diagnostics is important in ensuring the safe operation of industrial applications. Since complex industrial systems often involve multiple industrial plants (possibly belonging to different companies or subsidiaries) with sensitive data collected and stored in a distributed manner, collaborative fault diagnostic model training often needs to leverage federated learning (FL). As the scale of the industrial fault diagnostic models are often large and communication channels in such systems are often not exclusively used for FL model training, existing deployed FL model training frameworks cannot train such models efficiently across multiple institutions. In this paper, we report our experience developing and deploying the Federated Opportunistic Block Dropout (FedOBD) approach for industrial fault diagnostic model training. By decomposing large-scale models into semantic blocks and enabling FL participants to opportunistically upload selected important blocks in a quantized manner, it significantly reduces the communication overhead while maintaining model performance. Since its deployment in ENN Group in February 2022, FedOBD has served two coal chemical plants across two cities in China to build industrial fault prediction models. It helped the company reduce the training communication overhead by over 70% compared to its previous AI Engine, while maintaining model performance at over 85% test F1 score. To our knowledge, it is the first successfully deployed dropout-based FL approach.", "venue": "AAAI Conference on Artificial Intelligence", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-02-22", "journal": {"name": "ArXiv", "volume": "abs/2302.11485"}, "authors": [{"authorId": "2144037665", "name": "Yuanyuan Chen"}, {"authorId": "2117099267", "name": "Zichen Chen"}, {"authorId": "2155249906", "name": "Sheng Guo"}, {"authorId": "46317439", "name": "Yansong Zhao"}, {"authorId": "7769339", "name": "Zelei Liu"}, {"authorId": "2153093667", "name": "Pengcheng Wu"}, {"authorId": "2051970229", "name": "Che-Sheng Yang"}, {"authorId": "2155450576", "name": "Zengxiang Li"}, {"authorId": "2110984588", "name": "Han Yu"}], "citations": [{"paperId": "1e5f6cb8bceae3ecf923b921542a52252108783f", "title": "HiFi-Gas: Hierarchical Federated Learning Incentive Mechanism Enhanced Gas Usage Estimation"}, {"paperId": "7d98c3642bcdbb09be037782208b335c72e6f969", "title": "pFedES: Model Heterogeneous Personalized Federated Learning with Feature Extractor Sharing"}, {"paperId": "6b2d2a630cd32e3608922b166478b158fe5d0073", "title": "Hierarchical Federated Learning Incentivization for Gas Usage Estimation"}, {"paperId": "1a9b6101e132b55b7a5fc02ba99f6529f715b59f", "title": "Towards Interpretable Federated Learning"}]}
