{"paperId": "c5598c88d74199707e58ae2303cce92b5c03f70e", "publicationVenue": {"id": "6401bb05-050b-4beb-8824-066cb2938eb4", "name": "Mathematical Problems in Engineering", "type": "journal", "alternate_names": ["Math Probl Eng"], "issn": "1024-123X", "url": "http://www.gbhap-us.com/journals/238/238-top.htm", "alternate_urls": ["https://www.hindawi.com/journals/mpe/"]}, "title": "Application of Cloud Service in Smart Tourism Management Based on Weighted Average Algorithm", "abstract": "Tourism has become the main force driving urban economic development. However, there are problems such as low utilization rate of tourism resources and inconsistency of tourism information. The new smart tourism management model can sense tourism resources, tourist information, tourism development, and other information in a timely manner through terminal devices such as the Internet. The core of smart tourism management is to obtain travel information of travelers through cloud service technology, organize travel information, and recommend personalized travel plans for travelers. Apply cloud services to smart tourism management, and use the weighted average algorithm to make regression predictions on passenger information. This paper compares and analyzes the application of cloud service based on the algorithm for calculating the weighted average and the application of ordinary cloud service in smart tourism management through experiments. The experimental results show that the cloud service by adding weights can improve the forecast of the traveler’s information by 36% and 22%, respectively, compared with the cloud service of the ordinary average algorithm. Also, the effect of tourists’ travel experience is 72.2% and 56.3%, respectively. In the forecast of tourism information in tourism resources, tourism economy, and tourism activities, cloud services by adding weights maintain stable economic growth and improve tourists’ tourism experience. The cloud service in the smart tourism management of the weighted average algorithm can formulate corresponding tourism marketing strategies through the integration and prediction of tourism information, enhance the growth of the tourism economy, and improve the tourism experience of tourists.", "venue": "Mathematical Problems in Engineering", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-09-07", "journal": {"name": "Mathematical Problems in Engineering"}, "authors": [{"authorId": "2115206026", "name": "Ye Feng"}], "citations": [{"paperId": "fd1c9ecb1df528511afabfd50ddb11c60c77b9f8", "title": "Cloud Service Credibility Evaluation Based on Double Sliding Window"}]}
