{"paperId": "c55fa31795969edc2ec4f79d2514e9c1d78d19bd", "publicationVenue": {"id": "657efb9d-473f-4e6b-b416-eaa71d96e4dd", "name": "International Journal of Communication Systems", "type": "journal", "alternate_names": ["Int J Commun Syst"], "issn": "1074-5351", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/5996", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/10991131"]}, "title": "Minimizing data access latency in data grids by neighborhood‐based data replication and job scheduling", "abstract": "In Data Grid systems, quick data access is a challenging issue due to the high latency. The failure of requests is one of the most common matters in these systems that has an impact on performance and access delay. Job scheduling and data replication are two main techniques in reducing access latency. In this paper, we propose two new neighborhood‐based job scheduling strategies and a novel neighborhood‐based dynamic data replication algorithm (NDDR). The proposed algorithms reduce the access latency by considering a variety of practical parameters for decision making and the access delay by considering the failure probability of a node in job scheduling, replica selection, and replica placement. The proposed neighborhood concept in job scheduling includes all the nodes with low data transmission costs. Therefore, we can select the best computational node and reduce the search time by running a hierarchical and parallel search. NDDR reduces the access latency through selecting the best replica by performing a hierarchical search established based on the access time, storage queue workload, storage speed, and failure probability. NDDR improves the load balancing and data locality by selecting the best replication place considering the workload, temporal locality, geographical locality, and spatial locality. We evaluate our proposed algorithms by using Optorsim Simulator in two scenarios. The simulations confirm that the proposed algorithms improve the results compared with similar existing algorithms by 11%, 15%, 12%, and 10% in terms of mean job time, replication frequency, mean data access latency, and effective network usage, respectively.", "venue": "International Journal of Communication Systems", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-08-09", "journal": {"name": "International Journal of Communication Systems", "volume": "33"}, "authors": [{"authorId": "9225788", "name": "Mahsa Beigrezaei"}, {"authorId": "1681854", "name": "A. Haghighat"}, {"authorId": "1808811", "name": "Seyedeh Leili Mirtaheri"}], "citations": [{"paperId": "d16d79297a5faab3d0eb0d3ff08dd91ea101a975", "title": "EA2-IMDG: Efficient Approach of Using an In-Memory Data Grid to Improve the Performance of Replication and Scheduling in Grid Environment Systems"}, {"paperId": "0c65c11f61a7841359bdccc75aa552f8782c40b7", "title": "Analysis of Artistic Modeling of Opera Stage Clothing Based on Big Data Clustering Algorithm"}, {"paperId": "ad3af9d46f59317c43189782c106347c50faafda", "title": "A Network Load Balancing Algorithm Design Based on Big Data"}, {"paperId": "48910eeccc1669866f4bc7b6d2ba610a1d882b41", "title": "Improve Performance by a Fuzzy-Based Dynamic Replication Algorithm in Grid, Cloud, and Fog"}]}
