{"paperId": "c567bb2f16aab93efebce598c91378d330c34d10", "publicationVenue": {"id": "930158a0-ba55-4d05-9c56-427c33c6ebf6", "name": "International Journal of Big Data Intelligence", "type": "journal", "alternate_names": ["Int J Big Data Intell"], "issn": "2053-1389", "url": "http://www.inderscience.com/ijbdi"}, "title": "HCEm model and a comparative workload analysis of Hadoop cluster", "abstract": "This paper describes the HCEm model, designed to estimate the size of a cluster running Hadoop, in a given timeframe on cloud environments. The HCEm consists of a light optimisation layer for MapReduce jobs and a model to estimate the size of a Hadoop cluster. Additionally, this paper presents a comparative study of HCEm using similar applications and workloads in two production Hadoop clusters, the Amazon Elastic MapReduce and a private cloud in a large financial company, in order to evaluate the performance of the model in real and intensive processing environments. The estimates generated by the HCEm model and processing performed are representative and consistent, which can help researchers and engineers understand the workload characteristics of Hadoop clusters in their production environments. The performance differences shown between the real environments, confirmed that the increased sharing of physical computing host resources reduces the accuracy of the model.", "venue": "International Journal of Big Data Intelligence", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "Int. J. Big Data Intell.", "pages": "47-60", "volume": "4"}, "authors": [{"authorId": "10390486", "name": "J. Brito"}, {"authorId": "145267622", "name": "Aleteia P. F. Araujo"}], "citations": [{"paperId": "1290d0992aa9ac41ed06cfa3a312fa0cd7abfa42", "title": "WatCache: a workload-aware temporary cache on the compute side of HPC systems"}, {"paperId": "42a3fee5aaeaffef509457d56fac193aaacbdfac", "title": "Cloud workload prediction based on workflow execution time discrepancies"}]}
