{"paperId": "c56fca4fb8c65d463e6b9cb5339a93c772b45d42", "publicationVenue": null, "title": "Application of Intelligent Transportation System Data using Big Data Technologies", "abstract": "Problems such as the increase in the number of private vehicles with the population, the rise in environmental pollution, the emergence of unmet infrastructure and resource problems, and the decrease in time efficiency in cities have put local governments, cities, and countries in search of solutions. These problems faced by cities and countries are tried to be solved in the concept of smart cities and intelligent transportation by using information and communication technologies in line with the needs. While designing intelligent transportation systems (ITS), beyond traditional methods, big data should be designed in a state-of-the-art and appropriate way with the help of methods such as artificial intelligence, machine learning, and deep learning. In this study, a data-driven decision support system model was established to help the business make strategic decisions with the help of intelligent transportation data and to contribute to the elimination of public transportation problems in the city. Our study model has been established using big data technologies and business intelligence technologies: a decision support system including data sources layer, data ingestion/ collection layer, data storage and processing layer, data analytics layer, application/presentation layer, developer layer, and data management/ data security layer stages. In our study, the decision support system was modeled using ITS data supported by big data technologies, where the traditional structure could not find a solution. This paper aims to create a basis for future studies looking for solutions to the problems of integration, storage, processing, and analysis of big data and to add value to the literature that is missing within the framework of the model. We provide both the lack of literature, eliminate the lack of models before the application process of existing data sets to the business intelligence architecture and a model study before the application to be carried out by the authors.", "venue": "2022 Innovations in Intelligent Systems and Applications Conference (ASYU)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-09-07", "journal": {"name": "2022 Innovations in Intelligent Systems and Applications Conference (ASYU)", "pages": "1-6"}, "authors": [{"authorId": "2189463251", "name": "M. K. Sengul"}, {"authorId": "1712463", "name": "C. Tarhan"}, {"authorId": "2127421", "name": "V. Tecim"}], "citations": [{"paperId": "6f89f404ffd608fb563cd85ebc01cc3f1c976956", "title": "Smart Cities can Benefit from Energy Savings Made Possible by Spending on Intelligent Transportation System for Society 5.0"}, {"paperId": "9a3d85d80b061b7c50707b0295bb19d11b186693", "title": "A Distributed Big Data Analytics Architecture for Vehicle Sensor Data"}]}
