{"paperId": "c582fd994e805acd3a029b59ba54b7dcaf5b3967", "publicationVenue": null, "title": "Real-Time Detection, Recognition, and Surveillance using Drones", "abstract": "Modern Artificial Intelligence (AI) developments urge that the evolved technology will impact our daily lives. Speculation drawn from AI literature proves that AI is growing rapidly. Due to AI, a lot of attention is derived to security surveillance. Implementation of AI in monitoring terms, is costly as it requires many infrastructures and human resources. Also, monitoring of one or multiple cameras feeds for a single source without missing the important points is nearly impossible. There is a need for real security system that is cheaper yet competent. It should manage a fast and easy way to moderate in an emergency cases like fire or weapon detection. Drones are widely used in security surveillance as they cut the cost of human resources. Also it gives fast and efficient responses in critical situations. Proposed methodology is used to avoid cases like fire breakout or intruder in sensitive areas. It contains Unnamed Arial Vehicle (UAV) for real time detection, recognition and monitoring. The video stream obtained by UAV is processed using proposed technique and results are made for three types of detection. These three detection types are Intruder, Object, and Smoke & fire. The results of them are send to control unit so that it can perform some action according to the situation. The accuracy of the suggested technique is measured both in regular and extreme situations, which is 98.93% in regular and extreme cases, 97.82% for smoke and fire & 91.63% for intruder cases.", "venue": "2022 International Conference on Emerging Trends in Electrical, Control, and Telecommunication Engineering (ETECTE)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-12-02", "journal": {"name": "2022 International Conference on Emerging Trends in Electrical, Control, and Telecommunication Engineering (ETECTE)", "pages": "1-5"}, "authors": [{"authorId": "1456303080", "name": "Ayesha Mariam"}, {"authorId": "123140094", "name": "Memoona Mushtaq"}, {"authorId": "143957784", "name": "M. Iqbal"}], "citations": []}
