{"paperId": "c58769d99cd69cc2b5d62e0a02203dbe612bb3b7", "publicationVenue": null, "title": "The Internet of Things (IoT) as an Emerging Technological Solution for the Covid-19 Pandemic Mitigation: An Overview", "abstract": "Currently, the whole world is facing the critical economy crash and enormous casualties as the ongoing coronavirus continues its intensive attack across the planet. Sadly, individuals in billions of numbers continue to face a constant threat from this contagious disease, with the condition unlikely to getting any improvement soon. In this paper, the aim is to provide an overview study of the current situation concerning the COVID-19 outbreak and the potential role of Internet of Things (IoT) as well as the associated technologies acting as technological solution in mitigating the outbreak. Thus, some potential literatures have been briefly reviewed for this paper as a research method. The review results indicate that, several technological solutions are innovated to deal with the COVID-19 pandemic effects. Digital technologies play a major role in the reformation of public health response towards the COVID-19 pandemic. Among digital technologies which have been at the front line include the IoT. Some examples and potential applications of IoT are discussed.", "venue": "Journal of Physics: Conference Series", "year": 2021, "fieldsOfStudy": ["Business", "Physics"], "publicationTypes": ["Conference", "Review"], "publicationDate": "2021-01-01", "journal": {"name": "Journal of Physics: Conference Series", "volume": "1737"}, "authors": [{"authorId": "118726004", "name": "M. Abubakari"}, {"authorId": "1573023119", "name": "Mashoedah"}], "citations": [{"paperId": "f8025fde3986179f5f4e1e456580b706a48aaad6", "title": "5G Technology in the Digital Transformation of Healthcare, a Systematic Review"}, {"paperId": "b296534f62468592a8c63e68abdd8add0b3cd961", "title": "Internet of Medical Things in the COVID-19 Era: A Systematic Literature Review"}, {"paperId": "b62ddfa76a90b48fa2096814f98572ce2f0187eb", "title": "Comprehensive Survey of IoT, Machine Learning, and Blockchain for Health Care Applications: A Topical Assessment for Pandemic Preparedness, Challenges, and Solutions"}]}
