{"paperId": "c5938e24b16bb6ce8b965f51d73cdf96aae46eb0", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Load Balancing Using Artificial Intelligence for Cloud-Enabled Internet of Everything in Healthcare Domain", "abstract": "The emergence of the Internet of Things (IoT) and its subsequent evolution into the Internet of Everything (IoE) is a result of the rapid growth of information and communication technologies (ICT). However, implementing these technologies comes with certain obstacles, such as the limited availability of energy resources and processing power. Consequently, there is a need for energy-efficient and intelligent load-balancing models, particularly in healthcare, where real-time applications generate large volumes of data. This paper proposes a novel, energy-aware artificial intelligence (AI)-based load balancing model that employs the Chaotic Horse Ride Optimization Algorithm (CHROA) and big data analytics (BDA) for cloud-enabled IoT environments. The CHROA technique enhances the optimization capacity of the Horse Ride Optimization Algorithm (HROA) using chaotic principles. The proposed CHROA model balances the load, optimizes available energy resources using AI techniques, and is evaluated using various metrics. Experimental results show that the CHROA model outperforms existing models. For instance, while the Artificial Bee Colony (ABC), Gravitational Search Algorithm (GSA), and Whale Defense Algorithm with Firefly Algorithm (WD-FA) techniques attain average throughputs of 58.247 Kbps, 59.957 Kbps, and 60.819 Kbps, respectively, the CHROA model achieves an average throughput of 70.122 Kbps. The proposed CHROA-based model presents an innovative approach to intelligent load balancing and energy optimization in cloud-enabled IoT environments. The results highlight its potential to address critical challenges and contribute to developing efficient and sustainable IoT/IoE solutions.", "venue": "Italian National Conference on Sensors", "year": 2023, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "23"}, "authors": [{"authorId": "2185229087", "name": "Ibrahim Aqeel"}, {"authorId": "2220138489", "name": "Ibrahim Mohsen Khormi"}, {"authorId": "2218006768", "name": "S. B. Khan"}, {"authorId": "2065563657", "name": "Mohammed Shuaib"}, {"authorId": "3018630", "name": "Ahlam Almusharraf"}, {"authorId": "2068848160", "name": "Shadab Alam"}, {"authorId": "2136494774", "name": "Norah Alkhaldi"}], "citations": [{"paperId": "40fb487478cbcbe428d6e8b738cf478784881910", "title": "Comprehensive review of load balancing in cloud computing system"}, {"paperId": "010ef15bf6ac9ac7c45ad5faf6ea66303346ddd8", "title": "Optimising barrier placement for intrusion detection and prevention in WSNs"}, {"paperId": "64064a221e51da214ea3a096944ef0c248e2501b", "title": "An Intelligent Adaptive Neuro-Fuzzy for Solving the Multipath Congestion in Internet of Things"}]}
