{"paperId": "c594c05b53afb7ad7fd06cb2c7d564216bdd120c", "publicationVenue": null, "title": "Unambiguous, Real-Time and Accurate Map Matching for Multiple Sensing Sources", "abstract": "Smart Cities need real time information to improve the efficiency of their transportation systems. In particular, crowd sensing may help to identify the current speed in each street, the congested areas, etc. In this context, map matching techniques are required to map a sequence of GPS waypoints into a set of streets on a common map. Unfortunately, most map matching approaches are probabilistic. We propose rather an unambiguous algorithm, able to identify all the possible paths that match a given sequence of waypoints. We need an unambiguous identification for each waypoints set. For instance, the actual speed should be assigned to the correct set of streets, without error. To identify all the possible streets, we construct the set of candidates iteratively. We identify all the edge candidates around each waypoint, and reconstruct all the possible sub-routes that connect them. We then verify a set of constraints, to eliminate impossible routes. The road segments common to all computed routes form an unambiguous match. We evaluate the matching ratio of our technique on real city maps (London, Paris and Luxembourg). We also validate our approach with a real GPS trace in Seattle.", "venue": "2018 14th International Conference on Wireless and Mobile Computing, Networking and Communications (WiMob)", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2018-10-01", "journal": {"name": "2018 14th International Conference on Wireless and Mobile Computing, Networking and Communications (WiMob)", "pages": "1-8"}, "authors": [{"authorId": "30631914", "name": "Mohamed Amine Falek"}, {"authorId": "1736430", "name": "C. Pelsser"}, {"authorId": "49958941", "name": "A. Gallais"}, {"authorId": "67311455", "name": "S. Julien"}, {"authorId": "144310496", "name": "Fabrice Théoleyre"}], "citations": [{"paperId": "840fcd8974f6a1ef0fe5c5fd0f9c257001f700e5", "title": "To re-route, or not to re-route: Impact of real-time re-routing in urban road networks"}]}
