{"paperId": "c5ac65ccfaadf291658d80c10c2a8abc2b03abb2", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Data-Driven Decisions in Smart Cities: A Digital Transformation Case Study", "abstract": "The relationship between big data analytics (BDA) and smart cities (SCs) has been addressed in several articles. However, few articles have investigated the influence of exploiting BDA in data-driven decision-making from an empirical perspective in a case study context. Accordingly, we aim to tackle this scarcity of case-study research addressing the interrelationships between SCs, BDA, and decision-making. Filling this gap will shed light on the challenges and design principles that should be considered in designing a BDA artifact in the domain of smart cities. We analyze a case study of a digital transformation project in Egypt. Results show a tangible positive effect of utilizing data analytics in support of the decision-making process.", "venue": "Applied Sciences", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-02-08", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "144180191", "name": "Ahmed M. Shahat Osman"}, {"authorId": "1700038", "name": "Ahmed Elragal"}, {"authorId": "2739367", "name": "Anna Ståhlbröst"}], "citations": [{"paperId": "dea07883bf2f848ba8df3c05d5dc493bb034d029", "title": "Data-Driven Approach in Knowledge-Based Smart City Management"}, {"paperId": "34abdc93d9df50897f0ea50eaa33e24091be5093", "title": "A criminal macrocause classification model: An enhancement for violent crime analysis considering an unbalanced dataset"}, {"paperId": "ac282a415c0bfb622c27b1895494ebfab82a46ef", "title": "Gulf Cooperation Council Countries and Urbanisation: Are Open Government Data Portals Helping?"}, {"paperId": "10f4d3359d54b73f423b780801952c503bb95d09", "title": "The Global Whitewashing of Smart Cities: Citizens’ Perspectives"}, {"paperId": "691bf2ddaaed512ad439ffcc60ec7d7de710bca2", "title": "Data driven approaches for smart city planning and design: a case scenario on urban data management"}, {"paperId": "952184ddac961f1ca64473db3899f5a133e28178", "title": "A novel fraud detection and prevention method for healthcare claim processing using machine learning and blockchain technology"}, {"paperId": "c9953a77042db55a080951a52858e4f150c711dc", "title": "Do Smart Cities Restrict the Carbon Emission Intensity of Enterprises? Evidence from a Quasi-Natural Experiment in China"}, {"paperId": "d0697a43a51886dcab83c700209be995b760f4b1", "title": "Management Science"}]}
