{"paperId": "c5b009ca7d74d2b2fa7fbe3e3c6fa4557bfa56f5", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "A Conceptual and Systematics for Intelligent Power Management System-Based Cloud Computing: Prospects, and Challenges", "abstract": "This review describes a cloud-based intelligent power management system that uses analytics as a control signal and processes balance achievement pointer, and describes operator acknowledgments that must be shared quickly, accurately, and safely. The current study aims to introduce a conceptual and systematic structure with three main components: demand power (direct current (DC)-device), power mix between renewable energy (RE) and other power sources, and a cloud-based power optimization intelligent system. These methods and techniques monitor demand power (DC-device), load, and power mix between RE and other power sources. Cloud-based power optimization intelligent systems lead to an optimal power distribution solution that reduces power consumption or costs. Data has been collected from reliable sources such as Science Direct, IEEE Xplore, Scopus, Web of Science, Google Scholar, and PubMed. The overall findings of these studies are visually explained in the proposed conceptual framework through the literature that are considered to be cloud computing based on storing and running the intelligent systems of power management and mixing.", "venue": "Applied Sciences", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2021-10-20", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "118694689", "name": "Ahmed Al-jumaili"}, {"authorId": "48417320", "name": "Y. A. Mashhadany"}, {"authorId": "2943225", "name": "Rossilawati Sulaiman"}, {"authorId": "2100090411", "name": "Z. Alyasseri"}], "citations": [{"paperId": "540d8ad44f342bfaec44e6707b46ac5cdffffa19", "title": "Smart home energy management systems: Research challenges and survey"}, {"paperId": "4ac826e577c0ae6a67338b6d81af0cd7546fecd3", "title": "Sustainable optimizing WMN performance through meta-heuristic TDMA link scheduling and routing"}, {"paperId": "9282848b35fe578d47833221f297606e23ae99ba", "title": "Grid Integrated Renewable Energy Resources with Battery Storage Support for Optimized EV Charging"}, {"paperId": "33f1045edbd2bd8e09b625598862e57cb2ceeeab", "title": "Parallel power load abnormalities detection using fast density peak clustering with a hybrid canopy-K-means algorithm"}, {"paperId": "ed7d20df5d1bf7feca1302a506ca93c46e3a3dbf", "title": "Sustainable electronic document security: a comprehensive framework integrating encryption, digital signature and watermarking algorithms"}, {"paperId": "37e6d7791f56432e8a5ff286626f3ec716a3d787", "title": "Research trends in industry 5.0 and its application in the construction industry"}, {"paperId": "3306b85c33984b3488be980bfe649e27e354b26a", "title": "Battery health diagnostics: Bridging the gap between academia and industry"}, {"paperId": "f16630fd0b305964b3b865fc6ee9df25c62c37bc", "title": "Advancements in intelligent cloud computing for power optimization and battery management in hybrid renewable energy systems: A comprehensive review"}, {"paperId": "814140fb5226749b7287d842d1aa1589cfe82b6b", "title": "Grid-Connected RES Integration for Power Optimization Using Multi-Level Inverters and AI Techniques"}, {"paperId": "a28d2d867c8e6e39371a1acde9949b16a2917ce9", "title": "Intelligent transmission line fault diagnosis using the Apriori associated rule algorithm under cloud computing environment"}, {"paperId": "323dd4e4e0e3650fbee0460abb63d9dc1d4f617f", "title": "Business Intelligence Adoption for Small and Medium Enterprises: Conceptual Framework"}, {"paperId": "b5ebeccbbb614299736346c920a7032f84f198bb", "title": "Big Data Analytics Using Cloud Computing Based Frameworks for Power Management Systems: Status, Constraints, and Future Recommendations"}, {"paperId": "4fcdf0b983fa914aaf186d5c581aca61e5955259", "title": "Optimal Stability of Brushless DC Motor System Based on Multilevel Inverter"}, {"paperId": "6a842a3096bfe65af69e1d86a78bacca7ffef530", "title": "Applications of Artificial Intelligence Algorithms in the Energy Sector"}, {"paperId": "42ff9337a806c81ba9e013f9716201a14d7f787e", "title": "Short Text Clustering Algorithms, Application and Challenges: A Survey"}, {"paperId": "dd2f5609714bf63abd689c955cbc5ae8e35cbe81", "title": "Analytical Survey on the Security Framework of Cyber-Physical Systems for Smart Power System Networks"}, {"paperId": "d89101697de73c2a99e670b3b6c5f1cb2add35fb", "title": "Emerging Paradigms and Architectures for Industry 4.0 Applications"}, {"paperId": "c11d528ad71c4602b69ff1d164446080d64c165c", "title": "Dynamic Performance Evaluation of Grid-Connected Hybrid Renewable Energy-Based Power Generation for Stability and Power Quality Enhancement in Smart Grid"}, {"paperId": "ff240d59c05a86236948599002e53f3eee355e74", "title": "Global prospects, challenges, progress and environmental impact of solar energy in Iraq"}]}
