{"paperId": "c5be0648665fe6f3b66c5fe9f13fa613cc4610a6", "publicationVenue": {"id": "acd15a6d-3248-41fb-8439-9a40aabe5608", "name": "IEEE Workshop/Winter Conference on Applications of Computer Vision", "type": "conference", "alternate_names": ["Workshop on Applications of Computer Vision", "WACV", "IEEE Work Conf Appl Comput Vis", "Workshop Appl Comput Vis"], "url": "http://www.wikicfp.com/cfp/program?id=2993"}, "title": "Self-Supervised Clustering based on Manifold Learning and Graph Convolutional Networks", "abstract": "In spite of the huge advances in supervised learning, the common requirement for extensive labeled datasets represents a severe bottleneck. In this scenario, other learning paradigms capable of addressing the challenge associated with the scarcity of labeled data represent a relevant alternative solution. This paper presents a novel clustering method called Self-Supervised Graph Convolutional Clustering (SGCC)1, which aims to exploit the strengths of different learning paradigms, combining unsupervised, semi-supervised, and self-supervised perspectives. An unsupervised manifold learning algorithm based on hypergraphs and ranking information is used to provide more effective and global similarity information. The hypergraph structures allow identifying representative items for each cluster, which are used to derive a set of small but high-confident clusters. Such clusters are taken as soft-labels for training a Graph Convolutional Network (GCN) in a semi-supervised classification task. Once trained in a self-supervised setting, the GCN is used to predict the cluster of remaining items. The proposed SGCC method was evaluated both in image and citation networks datasets and compared with classic and recent clustering methods, obtaining high-effective results in all scenarios.", "venue": "IEEE Workshop/Winter Conference on Applications of Computer Vision", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-01-01", "journal": {"name": "2023 IEEE/CVF Winter Conference on Applications of Computer Vision (WACV)", "pages": "5623-5632"}, "authors": [{"authorId": "2075423966", "name": "Leonardo Tadeu Lopes"}, {"authorId": "144869373", "name": "D. Pedronette"}], "citations": [{"paperId": "13707ea1d3ed16900f1f72d22504ae3136d9e760", "title": "Quantum Vision Clustering"}]}
