{"paperId": "c5c5ab4b519441782da687a555eda34d164738df", "publicationVenue": {"id": "af25e31d-b508-40d4-b32d-ea1f6fe5a9c5", "name": "Journal of Global Oncology", "type": "journal", "alternate_names": ["J Glob Oncol"], "issn": "2378-9506", "url": "https://ascopubs.org/journal/go", "alternate_urls": ["http://jgo.ascopubs.org/", "http://ascopubs.org/journal/jgo"]}, "title": "Palpable Breast Lump Triage by Minimally Trained Operators in Mexico Using Computer-Assisted Diagnosis and Low-Cost Ultrasound", "abstract": "Purpose In low- to middle-income countries (LMICs), most breast cancers present as palpable lumps; however, most palpable lumps are benign. We have developed artificial intelligence–based computer-assisted diagnosis (CADx) for an existing low-cost portable ultrasound system to triage which lumps need further evaluation and which are clearly benign. This pilot study was conducted to demonstrate that this approach can be successfully used by minimally trained health care workers in an LMIC country. Patients and Methods We recruited and trained three nonradiologist health care workers to participate in an institutional review board–approved, Health Insurance Portability and Accountability Act–compliant pilot study in Jalisco, Mexico, to determine whether they could use portable ultrasound (GE Vscan Dual Probe) to acquire images of palpable breast lumps of adequate quality for accurate computer analysis. Images from 32 women with 32 breast masses were then analyzed with a triage-CADx system, generating an output of benign or suspicious (biopsy recommended). Triage-CADx outputs were compared with radiologist readings. Results The nonradiologists were able to acquire adequate images. Triage by the CADx software was as accurate as assessment by specialist radiologists, with two (100%) of two cancers considered suspicious and 30 (100%) of 30 benign lesions classified as benign. Conclusion A portable ultrasound system with CADx software can be successfully used by first-level health care workers to triage palpable breast lumps. These results open up the possibility of implementing practical, cost-effective triage of palpable breast lumps, ensuring that scarce resources can be dedicated to suspicious lesions requiring further workup.", "venue": "Journal of Global Oncology", "year": 2018, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2018-08-29", "journal": {"name": "Journal of Global Oncology", "volume": "4"}, "authors": [{"authorId": "1919400", "name": "S. Love"}, {"authorId": "1908050", "name": "W. Berg"}, {"authorId": "1782557", "name": "C. Podilchuk"}, {"authorId": "30754349", "name": "A. L. López Aldrete"}, {"authorId": "51233343", "name": "Aarón Patricio Gaxiola Mascareño"}, {"authorId": "51233750", "name": "Krishnamohan Pathicherikollamparambil"}, {"authorId": "4086154", "name": "A. Sankarasubramanian"}, {"authorId": "41092223", "name": "L. Eshraghi"}, {"authorId": "2076964077", "name": "R. Mammone"}], "citations": [{"paperId": "77e17832bbafda1dba494e03b00e82b22f7de7c0", "title": "From theoretical models to practical deployment: A perspective and case study of opportunities and challenges in AI-driven healthcare research for low-income settings"}, {"paperId": "ee27b74af622c27786a78c9183bc99315712148c", "title": "ChatGPT: promise and challenges for deployment in low- and middle-income countries"}, {"paperId": "345343b134e9cd89b4a82380afff5018a12aef5d", "title": "Artificial intelligence in breast ultrasound: application in clinical practice"}, {"paperId": "a8c7b5b4162f524552281d97571452f9407d6117", "title": "Transformer-based Characterization of Breast Lesions in Handheld Ultrasound Images WITH Classification Inconsistency Measure"}, {"paperId": "83d64d5f70da7a776136fd2d3a16850387870465", "title": "Classification of point-of-care ultrasound in breast imaging using deep learning"}, {"paperId": "3f13e75f97126927bc4f6ac532da803efaae4818", "title": "Ultrasound for Breast Cancer Screening in Resource-Limited Settings: Current Practice and Future Directions"}, {"paperId": "d3f5a22d51ea523e9c43066388926ccd11589934", "title": "AI: Can It Make a Difference to the Predictive Value of Ultrasound Breast Biopsy?"}, {"paperId": "ba9fbfdfdefbf1afabc42a095ef959fa0d410d73", "title": "Artificial intelligence for strengthening healthcare systems in low- and middle-income countries: a systematic scoping review"}, {"paperId": "50f917807754a7c9cb4ae8657438759c9d205379", "title": "Triaging subjects with palpable breast masses for biopsy, follow-up or treatment using AI applied to breast ultrasound in a low-resource setting - A feasibility study"}, {"paperId": "99f74132ae8f2715b4e0d0548f84e4d3a525d750", "title": "Economic Perspective of Cancer Care and Its Consequences for Vulnerable Groups"}, {"paperId": "f4c5f276cac02340bbe99f64bb1a83f77ee61cea", "title": "The Impact of Artificial Intelligence on Health Equity in Oncology: Scoping Review"}, {"paperId": "4eda9423a8d8a90a0bb86c531f1805be70bbce09", "title": "Global challenges and policy solutions in breast cancer control."}, {"paperId": "89bb4c5cb11ed97ed6be83628db0fa3badefeeac", "title": "High-burden Cancers in Middle-income Countries: A Review of Prevention and Early Detection Strategies Targeting At-risk Populations"}, {"paperId": "d548e0eb89268fbfb1ea36557727018ea1b8fc9f", "title": "Impact of Original and Artificially Improved Artificial Intelligence-based Computer-aided Diagnosis on Breast US Interpretation."}, {"paperId": "017189696ee1ac55113b505292e865e2b1a53a64", "title": "Point-of-Care Ultrasound: Applications in Low- and Middle-Income Countries"}, {"paperId": "95b16631858121c7f258a451e541aa1909a5dd0e", "title": "Right population, right resources, right algorithm: Using machine learning efficiently and effectively in surgical systems where data are a limited resource."}, {"paperId": "a88cdba7a928b328ee88510b94a7594b5f8e88fb", "title": "Can an Artificial Intelligence Decision Aid Decrease False-Positive Breast Biopsies?"}, {"paperId": "95100f7b07a62bf3502335a98b769bf24be3a9fa", "title": "Ultrasound Imaging"}, {"paperId": "d4a88acfb19195698555bcb29e87b9405d3faa48", "title": "Should We Ignore, Follow, or Biopsy? Impact of Artificial Intelligence Decision Support on Breast Ultrasound Lesion Assessment."}, {"paperId": "a27109e78f8306cad9f29ddab49b2cbd4d321fb9", "title": "On-Demand Teleradiology Using Smartphone Photographs as Proxies for DICOM Images"}, {"paperId": "641054b7f003a4458891733c62ee104bb0eafffb", "title": "Ultrasound in the Limited-Resource Setting: A Systematic Qualitative Review"}, {"paperId": "ae861af10c38247e01ed439630373288322fd887", "title": "A Review of Healthcare Applications of AI: Transforming Healthcare Delivery"}]}
