{"paperId": "c5ccf457cb17ef142a931de1b4f3cfcb190ee52d", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Heterogeneous federated collaborative filtering using FAIR: Federated Averaging in Random Subspaces", "abstract": "Recommendation systems (RS) for items (e.g., movies, books) and ads are widely used to tailor content to users on various internet platforms. Traditionally, recommendation models are trained on a central server. However, due to rising concerns for data privacy and regulations like the GDPR, federated learning is an increasingly popular paradigm in which data never leaves the client device. Applying federated learning to recommendation models is non-trivial due to large embedding tables, which often exceed the memory constraints of most user devices. To include data from all devices in federated learning, we must enable collective training of embedding tables on devices with heterogeneous memory capacities. Current solutions to heterogeneous federated learning can only accommodate a small range of capacities and thus limit the number of devices that can participate in training. We present Federated Averaging in Random subspaces (FAIR), which allows arbitrary compression of embedding tables based on device capacity and ensures the participation of all devices in training. FAIR uses what we call consistent and collapsible subspaces defined by hashing-based random projections to jointly train large embedding tables while using varying amounts of compression on user devices. We evaluate FAIR on Neural Collaborative Filtering tasks with multiple datasets and verify that FAIR can gather and share information from a wide range of devices with varying capacities, allowing for seamless collaboration. We prove the convergence of FAIR in the homogeneous setting with non-i.i.d data distribution. Our code is open source at {https://github.com/apd10/FLCF}", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-11-03", "journal": {"name": "ArXiv", "volume": "abs/2311.01722"}, "authors": [{"authorId": "37479945", "name": "Aditya Desai"}, {"authorId": "2213260198", "name": "Benjamin Meisburger"}, {"authorId": "2117941145", "name": "Zichang Liu"}, {"authorId": "4260659", "name": "Anshumali Shrivastava"}], "citations": [{"paperId": "0d4eeccd938cedf7852f608e6e8ac430accb2ab3", "title": "On-Device Recommender Systems: A Comprehensive Survey"}]}
