{"paperId": "c5eae4a4c9da6919951b6822f3881dbd4f95974d", "publicationVenue": null, "title": "ReFRS: Resource-efficient Federated Recommender System for Dynamic and Diversified User Preferences", "abstract": "Owing to its nature of scalability and privacy by design, federated learning (FL) has received increasing interest in decentralized deep learning. FL has also facilitated recent research on upscaling and privatizing personalized recommendation services, using on-device data to learn recommender models locally. These models are then aggregated globally to obtain a more performant model while maintaining data privacy. Typically, federated recommender systems (FRSs) do not take into account the lack of resources and data availability at the end-devices. In addition, they assume that the interaction data between users and items is i.i.d. and stationary across end-devices (i.e., users), and that all local recommender models can be directly averaged without considering the user’s behavioral diversity. However, in real scenarios, recommendations have to be made on end-devices with sparse interaction data and limited resources. Furthermore, users’ preferences are heterogeneous and they frequently visit new items. This makes their personal preferences highly skewed, and the straightforwardly aggregated model is thus ill-posed for such non-i.i.d. data. In this article, we propose Resource Efficient Federated Recommender System (ReFRS) to enable decentralized recommendation with dynamic and diversified user preferences. On the device side, ReFRS consists of a lightweight self-supervised local model built upon the variational autoencoder for learning a user’s temporal preference from a sequence of interacted items. On the server side, ReFRS utilizes a scalable semantic sampler to adaptively perform model aggregation within each identified cluster of similar users. The clustering module operates in an asynchronous and dynamic manner to support efficient global model update and cope with shifting user interests. As a result, ReFRS achieves superior performance in terms of both accuracy and scalability, as demonstrated by comparative experiments on real datasets.", "venue": "ACM Trans. Inf. Syst.", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-07-28", "journal": {"name": "ACM Transactions on Information Systems", "pages": "1 - 30", "volume": "41"}, "authors": [{"authorId": "15731486", "name": "Mubashir Imran"}, {"authorId": "2416851", "name": "Hongzhi Yin"}, {"authorId": "1490931831", "name": "Tong Chen"}, {"authorId": "1925773", "name": "Nguyen Quoc Viet Hung"}, {"authorId": "48543245", "name": "Alexander Zhou"}, {"authorId": "2052687617", "name": "Kai Zheng"}], "citations": [{"paperId": "1884e7d15da4230b09971ef177ccae0a12647b3e", "title": "Horizontal Federated Recommender System: A Survey"}, {"paperId": "0c6290aba17c0aebd9cb9784df6453378e0f38d4", "title": "Communication-Efficient Federated Neural Collaborative Filtering with Multi-Armed Bandits"}, {"paperId": "92c361d02caa966769b6888d4eff1080929e9dbb", "title": "LLM-based Federated Recommendation"}, {"paperId": "e57b498c47793962866d2774d769d2075725e705", "title": "TransFR: Transferable Federated Recommendation with Pre-trained Language Models"}, {"paperId": "0beae4adabce1f3af3a5e8b458e36c5d3c4579b8", "title": "Decentralized Federated Recommendation with Privacy-Aware Structured Client-Level Graph"}, {"paperId": "0d4eeccd938cedf7852f608e6e8ac430accb2ab3", "title": "On-Device Recommender Systems: A Comprehensive Survey"}, {"paperId": "4d61e6d951ee1e38d68d26b400abfbe1f1b07a67", "title": "Heterogeneous decentralised machine unlearning with seed model distillation"}, {"paperId": "29e23c92105688c38889772fbc926b7fa2d8212d", "title": "Free Lunch for Federated Remote Sensing Target Fine-Grained Classification: A Parameter-Efficient Framework"}, {"paperId": "117896edca8b76b75a8c2eab40f133ac6904610f", "title": "FDRS: Federated Diversified Recommender System Based on Heterogeneous Graph Convolutional Network"}, {"paperId": "742dd17819c4644ca6c392c4c0c9c4bb8da0029c", "title": "DPR: An Algorithm Mitigate Bias Accumulation in Recommendation feedback loops"}, {"paperId": "e84dc29b2c365bf8c643c3e3f697dd7f93bd6913", "title": "Model aggregation techniques in federated learning: A comprehensive survey"}, {"paperId": "c7f328d9d8ac133c616263dd129e7c236e1af85e", "title": "Heterogeneous Decentralized Machine Unlearning with Seed Model Distillation"}, {"paperId": "c962d5afb4e0ba6b00d28080f6c4a08e7fc74576", "title": "Trustworthy Recommendation and Search: Introduction to the Special Section - Part 2"}, {"paperId": "4b1bc95030c8f35886aec4b27bdfc48ad1bb3b45", "title": "HeteFedRec: Federated Recommender Systems with Model Heterogeneity"}, {"paperId": "ea1fc286c06bf3532ae6d30c27416446e7a3f8c6", "title": "A review of deep learning in dentistry"}, {"paperId": "6f5efc45049e5548c6299c9469d5b4605d62f06e", "title": "When Federated Recommendation Meets Cold-Start Problem: Separating Item Attributes and User Interactions"}, {"paperId": "e377192c8e7bd70e6ce435ababc23642d4d6d83b", "title": "A Comprehensive Survey on Privacy-Preserving Techniques in Federated Recommendation Systems"}, {"paperId": "bc309d6fca1ef63f5ae99e3413adfd743be3577b", "title": "Manipulating Visually-aware Federated Recommender Systems and Its Countermeasures"}, {"paperId": "0e2ceeefed09223da44dde153e23512baba59581", "title": "Model-Agnostic Decentralized Collaborative Learning for On-Device POI Recommendation"}, {"paperId": "8a0e01817bb0ad45064fb3a31d8e0a731a29ba8a", "title": "Manipulating Federated Recommender Systems: Poisoning with Synthetic Users and Its Countermeasures"}, {"paperId": "445310f677da9942676357b117c8f50742e51183", "title": "Query Sub-intent Mining by Incorporating Search Results with Query Logs for Information Retrieval"}, {"paperId": "9e5fe4dce5404bcbd40ae8b271ca5a5dd36c5278", "title": "Semi-decentralized Federated Ego Graph Learning for Recommendation"}, {"paperId": "77f2c139ce2abaeed0bc6feda721fea7eaf62277", "title": "Trustworthy Recommendation and Search: Introduction to the Special Issue - Part 1"}, {"paperId": "b48a8c226efb52844c9b97309a654a383f33b823", "title": "Interaction-level Membership Inference Attack Against Federated Recommender Systems"}, {"paperId": "9911f321e39910431a67e29e5af955b0265dd54c", "title": "A Survey on Federated Recommendation Systems"}, {"paperId": "df49485b692986e67a74da78f62d1f87c8b5824f", "title": "Federated Unlearning for On-Device Recommendation"}, {"paperId": "9c1144b4cde1993bb54ab40a3fd813e1c2bcd39a", "title": "Trustworthy Recommender Systems"}, {"paperId": "c0683cd86fe5946202eb9a9cbdedfa41367f6248", "title": "Heterogeneous Collaborative Learning for Personalized Healthcare Analytics via Messenger Distillation"}, {"paperId": "9ef0888ff856ed7c8dfd007f2eb88be5753ccd03", "title": "Collaborative Semantic Aggregation and Calibration for Federated Domain Generalization"}]}
