{"paperId": "c5f3bbfe8c84c9bb9d18c6525b65af3b55071761", "publicationVenue": {"id": "74ac5df9-f803-4de9-91f3-ec5f69bc0c8c", "name": "Medinfo", "alternate_names": ["Medinfo"], "issn": "1314-0345", "url": "https://www.medinfo.bg/"}, "title": "Provenance Solutions for Medical Research in Heterogeneous IT-Infrastructure: An Implementation Roadmap", "abstract": "Research data generated in large projects raise challenges about not only data analytics but also data quality assessments and data governance. The provenance of a data set - that is the history of data sets - holds information relevant to technicians and non-technicians and is able to answer questions regarding data quality, transparency, and more. We propose an implementation roadmap to extract, store, and utilize provenance records in order to make provenance available to data analysts, research subjects, privacy officers, and machines (machine readability). Each aspect is tackled separately, resulting in the implementation of a provenance toolbox. We aim to do so within the context of HiGHmed, a research consortium established within the medical informatics initiative in Germany. In this testbed of federated IT-infrastructures, the toolbox shall assist each stakeholder in answering domain-specific and domain-agnostic questions regarding the provenance of data sets. This way, we will improve data re-use, transparency, and reproducibility.", "venue": "Medinfo", "year": 2019, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-08-21", "journal": {"name": "Studies in health technology and informatics", "pages": "\n          298-302\n        ", "volume": "264"}, "authors": [{"authorId": "24718487", "name": "Marcel Parciak"}, {"authorId": "32144256", "name": "C. Bauer"}, {"authorId": "51245803", "name": "T. Bender"}, {"authorId": "51237854", "name": "Robert Lodahl"}, {"authorId": "3321393", "name": "Björn Schreiweis"}, {"authorId": "2807786", "name": "E. Tute"}, {"authorId": "1786472", "name": "U. Sax"}], "citations": [{"paperId": "0bfc4c8169ad1f0a449faa19a82df237488e8a09", "title": "FAIRness through automation: development of an automated medical data integration infrastructure for FAIR health data in a maximum care university hospital"}, {"paperId": "106ffdedfc32bfedded90c9620b327623b53e9e2", "title": "The ethical and legal landscape of brain data governance"}, {"paperId": "cb7655a0e1dcf642e930dd54ca10c0d16c8db610", "title": "Polyflow: a Polystore-compliant Mechanism to Provide Interoperability to Heterogeneous Provenance Graphs"}, {"paperId": "f9fc10ab8b470a3dba480d33c92fe88a76bf456f", "title": "Review of Clinical Research Informatics"}, {"paperId": "bfd28ecb91160389907801f210862269acdd972d", "title": "Towards standardization guidelines for in silico approaches in personalized medicine"}, {"paperId": "fc81dfbbf8e71f43cecc575cb680388f9548c764", "title": "Applying FAIRness: Redesigning a Biomedical Informatics Research Data Management Pipeline"}, {"paperId": "0b136463cd1ea48dfb24b1d570362eea7b782f4f", "title": "UNIVERSIDADE FEDERAL DE JUIZ DE FORA INSTITUTO DE CIÊNCIAS EXATAS PROGRAMA DE PÓS-GRADUAÇÃO EM CIÊNCIA DA COMPUTAÇÃO"}]}
