{"paperId": "c6002247dee39ff91db2b646d8f2dd375cbb0a43", "publicationVenue": null, "title": "Towards WAN-aware join sampling over geo-distributed data", "abstract": "Large scale data analytics over geographically distributed data sources is challenging primarily due to the constrained and heterogeneous resource availability such as the wide area network (WAN) bandwidth. In this work, we look at the problem of generating random samples over joins for geo-distributed data sources. Joins are one of the most fundamental yet expensive operations in data analytics. To reduce the cost of computing joins, existing techniques have looked at efficiently generating a random sample over the join result for centralized environments, where all the data is available in one location. These techniques fail to address the unique challenges posed by geo-distributed environments. To address these challenges, we propose a sampling technique which aims to reduce the WAN traffic and latency, thereby reducing the overall latency for generating samples over joins for geo-distributed data sources. We implement our geo-distributed sampling technique on top of Apache Spark and compare it with existing state-of-the-art sampling techniques to identify scenarios where the proposed approach gives significant benefits. Based on this exploration, we provide a detailed outline of additional factors which should be considered when designing a WAN-aware join sampling technique for geo-distributed environments.", "venue": "EdgeSys@EuroSys", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2022-04-05", "journal": {"name": "Proceedings of the 5th International Workshop on Edge Systems, Analytics and Networking"}, "authors": [{"authorId": "2109402853", "name": "Dhruv Kumar"}, {"authorId": "2051656808", "name": "Joel Wolfrath"}, {"authorId": "144114650", "name": "A. Chandra"}, {"authorId": "143987348", "name": "R. Sitaraman"}], "citations": [{"paperId": "b06e2791108cd160b9d0a244e086c9dff1ad97ce", "title": "Plexus: Optimizing Join Approximation for Geo-Distributed Data Analytics"}]}
