{"paperId": "c6139bb41306c457e88e1a5957d71c345555ef40", "publicationVenue": {"id": "b7478691-8468-4053-b828-4b261de2bf96", "name": "IEEE International Symposium on Real-Time Distributed Computing", "type": "conference", "alternate_names": ["Int Symp Object/component/service-oriented Real-time Distrib Comput", "ISORC", "International Symposium on Object/Component/Service-Oriented Real-Time Distributed Computing", "IEEE Int Symp Real-time Distrib Comput"], "url": "https://ieeexplore.ieee.org/xpl/conhome/1000514/all-proceedings"}, "title": "EXPPO: EXecution Performance Profiling and Optimization for CPS Co-simulation-as-a-Service", "abstract": "A co-simulation may comprise several heterogeneous federates with diverse spatial and temporal execution characteristics. In an iterative time-stepped simulation, a federation exhibits the Bulk Synchronous Parallel (BSP) computation paradigm in which all federates perform local operations and synchronize with their peers before proceeding to the next round of computation. In this context, the lowest performing (i.e., slowest) federate dictates the progression of the federation logical time. One challenge in co-simulation is performance profiling for individual federates and entire federations. The computational resource assignment to the federates can have a large impact on federation performance. Furthermore, a federation may comprise federates located on different physical machines as is the case for cloud and edge computing environments. As such, distributed profiling and resource assignment to the federation is a major challenge for operationalizing the co-simulation execution at scale. This paper presents the Execution Performance Profiling and Optimization (EXPPO) methodology, which addresses these challenges by using execution performance profiling at each simulation execution step and for every federate in a federation. EXPPO uses profiling to learn performance models for each federate, and uses these models in its federation resource recommendation tool to solve an optimization problem that improves the execution performance of the co-simulation. Using an experimental testbed, the efficacy of EXPPO is validated to show the benefits of performance profiling and resource assignment in improving the execution runtimes of co-simulations while also minimizing the execution cost.", "venue": "IEEE International Symposium on Real-Time Distributed Computing", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-05-01", "journal": {"name": "2020 IEEE 23rd International Symposium on Real-Time Distributed Computing (ISORC)", "pages": "184-191"}, "authors": [{"authorId": "3179736", "name": "Yogesh D. Barve"}, {"authorId": "1953279", "name": "H. Neema"}, {"authorId": "94578365", "name": "Zhuangwei Kang"}, {"authorId": "151006698", "name": "Hongyang Sun"}, {"authorId": "145201463", "name": "A. Gokhale"}, {"authorId": "49144472", "name": "Thomas P. Roth"}], "citations": [{"paperId": "845e56c05fbbff377479fc36fd1bf95b9ce450dd", "title": "Dynamic Resource Management for Cloud-native Bulk Synchronous Parallel Applications"}, {"paperId": "2f5e29e4f32a4434275227f81d7773044afde90a", "title": "Guest editorial: Special issue on the 2020 IEEE symposium on real-time distributed computing (ISORC)"}]}
