{"paperId": "c616be8e6149eb500a4918d025ea251942f08d00", "publicationVenue": {"id": "6c1daa1a-805a-4bc8-8c66-56a95e181cdd", "name": "Benchmarking : An International Journal", "type": "journal", "alternate_names": ["Benchmarking: An International Journal", "Benchmarking", "Benchmarking Int J", "Benchmarking  Int J"], "issn": "1463-5771", "url": "https://www.emerald.com/insight/publication/issn/1463-5771", "alternate_urls": ["http://www.emeraldinsight.com/1463-5771.htm"]}, "title": "A multi-attribute data mining model for rule extraction and service operations benchmarking", "abstract": "PurposeCustomer differences and similarities play a crucial role in service operations, and service industries need to develop various strategies for different customer types. This study aims to understand the behavioral pattern of customers in the banking industry by proposing a hybrid data mining approach with rule extraction and service operation benchmarking.Design/methodology/approachThe authors analyze customer data to identify the best customers using a modified recency, frequency and monetary (RFM) model and K-means clustering. The number of clusters is determined with a two-step K-means quality analysis based on the Silhouette, Davies–Bouldin and Calinski–Harabasz indices and the evaluation based on distance from average solution (EDAS). The best–worst method (BWM) and the total area based on orthogonal vectors (TAOV) are used next to sort the clusters. Finally, the associative rules and the Apriori algorithm are used to derive the customers' behavior patterns.FindingsAs a result of implementing the proposed approach in the financial service industry, customers were segmented and ranked into six clusters by analyzing 20,000 records. Furthermore, frequent customer financial behavior patterns were recognized based on demographic characteristics and financial transactions of customers. Thus, customer types were classified as highly loyal, loyal, high-interacting, low-interacting and missing customers. Eventually, appropriate strategies for interacting with each customer type were proposed.Originality/valueThe authors propose a novel hybrid multi-attribute data mining approach for rule extraction and the service operations benchmarking approach by combining data mining tools with a multilayer decision-making approach. The proposed hybrid approach has been implemented in a large-scale problem in the financial services industry.", "venue": "Benchmarking : An International Journal", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-06-01", "journal": {"name": "Benchmarking: An International Journal"}, "authors": [{"authorId": "2123858938", "name": "Hannan Amoozad Mahdiraji"}, {"authorId": "1681115", "name": "M. Tavana"}, {"authorId": "2139132893", "name": "Pouya Mahdiani"}, {"authorId": "2126560559", "name": "Aliasghar Abbasi Kamardi"}], "citations": [{"paperId": "572d1a914325590bf18aa12300c252a0a33478df", "title": "Dynamic Rule Extraction Method Based on Computer Fuzzy Chinese Language Recognition System"}, {"paperId": "f8b148dfa6369c6b2c72582d6fa5fb6767d4939c", "title": "Customer Analysis Using the RFM Methodology in A Dental Clinic"}, {"paperId": "b2ddd0724ab55ff58c30f6078fa28162b6c0471f", "title": "Integrated customer lifetime value models to support marketing decisions in the complementary and alternative medicine industry"}, {"paperId": "19d832f4886b1a780d0b356943e029f72d27c540", "title": "Four Challenges for IML Designers: Lessons of an Interactive Customer Segmentation Prototype in a Global Manufacturing Company"}, {"paperId": "307e96e26cfb05b9d7a8f3ae7d5b51195c7d5bb5", "title": "The Applicability of Machine Learning Algorithms in Accounts Receivables Management"}, {"paperId": "6fa467188bbd68080040a4503ec4e5ac08b67402", "title": "Assessing the application of multi-criteria decision making techniques in hospitality and tourism research: a bibliometric study"}, {"paperId": "a8cc155a8852a459642f94f7e3415734f1b46294", "title": "An analytical framework based on the recency, frequency, and monetary model and time series clustering techniques for dynamic segmentation"}]}
