{"paperId": "c61ad406f4812eb8607b5bb188719bdefd651d07", "publicationVenue": {"id": "29b9c461-963e-4d11-b2ab-92c182243942", "name": "IEEE Symposium on Security and Privacy", "type": "conference", "alternate_names": ["S&P", "IEEE Symp Secur Priv"], "url": "http://www.ieee-security.org/"}, "title": "TrollMagnifier: Detecting State-Sponsored Troll Accounts on Reddit", "abstract": "Growing evidence points to recurring influence campaigns on social media, often sponsored by state actors aiming to manipulate public opinion on sensitive political topics. Typically, campaigns are performed through instrumented accounts, known as troll accounts; despite their prominence, however, little work has been done to detect these accounts in the wild. In this paper, we present TROLLMAGNIFIER, a detection system for troll accounts. Our key observation, based on analysis of known Russian-sponsored troll accounts identified by Reddit, is that they show loose coordination, often interacting with each other to further specific narratives. Therefore, troll accounts controlled by the same actor often show similarities that can be leveraged for detection. TROLLMAGNIFIER learns the typical behavior of known troll accounts and identifies more that behave similarly. We train TROLLMAGNIFIER on a set of 335 known troll accounts and run it on a large dataset of Reddit accounts. Our system identifies 1,248 potential troll accounts; we then provide a multi-faceted analysis to corroborate the correctness of our classification. In particular, 66% of the detected accounts show signs of being instrumented by malicious actors (e.g., they were created on the same exact day as a known troll, they have since been suspended by Reddit, etc.). They also discuss similar topics as the known troll accounts and exhibit temporal synchronization in their activity. Overall, we show that using TROLLMAGNIFIER, one can grow the initial knowledge of potential trolls provided by Reddit by over 300%.", "venue": "IEEE Symposium on Security and Privacy", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-12-01", "journal": {"name": "2022 IEEE Symposium on Security and Privacy (SP)", "pages": "2161-2175"}, "authors": [{"authorId": "2113416988", "name": "Mohammad Hammas Saeed"}, {"authorId": "2115268816", "name": "Shiza Ali"}, {"authorId": "144728530", "name": "Jeremy Blackburn"}, {"authorId": "2064581974", "name": "Emiliano De Cristofaro"}, {"authorId": "3447293", "name": "Savvas Zannettou"}, {"authorId": "2350947", "name": "G. Stringhini"}], "citations": [{"paperId": "ef39c22e3c5cb25ab8f3424bf516bca4904f880c", "title": "Assembling a multi-platform ensemble social bot detector with applications to US 2020 elections"}, {"paperId": "ae3c9ec330a407d512798202b68ae55c82590497", "title": "On mission Twitter Profiles: A Study of Selective Toxic Behavior"}, {"paperId": "1a02444d8e93ccafedcbefab129c7ec8e8c7a476", "title": "Early Malware Characterization based on Online Social Networks"}, {"paperId": "0e53c89da6a244fcead452632cab5f5c7965db75", "title": "A Study of Partisan News Sharing in the Russian invasion of Ukraine"}, {"paperId": "a844d51964156116f437a2b698de31288e6e3647", "title": "Unmasking the Web of Deceit: Uncovering Coordinated Activity to Expose Information Operations on Twitter"}, {"paperId": "9ee661b61f5e569d7ac25752b90b7fc66c77c19a", "title": "AI-based MultiModal to Identify State-linked Social Media Accounts in the Middle East: A Study on Twitter"}, {"paperId": "dc8d6bd3df8093a349d9efddc08e6988bc2a3e89", "title": "“I Just Didn’t Notice It:” Experiences with Misinformation Warnings on Social Media amongst Users Who Are Low Vision or Blind"}, {"paperId": "04e9416c7496e8c2d72df7b7a03bf37080adb974", "title": "The Challenges of Machine Learning for Trust and Safety: A Case Study on Misinformation Detection"}, {"paperId": "9a449d25793e97265df2aa63c0f5362556373910", "title": "Behaviour and Bot Analysis on Online Social Networks: Twitter, Parler, and Reddit"}, {"paperId": "41d5385234359b132f2b3ee4e817f07ce60f2768", "title": "Specious Sites: Tracking the Spread and Sway of Spurious News Stories at Scale"}, {"paperId": "6236d5f6be4782c6aff0c1ac5ae2b8084082d501", "title": "“It’s up to the Consumer to be Smart”: Understanding the Security and Privacy Attitudes of Smart Home Users on Reddit"}, {"paperId": "6b23542e240162f2ebe352730a0d04aedd6541bd", "title": "Analyzing Activity and Suspension Patterns of Twitter Bots Attacking Turkish Twitter Trends by a Longitudinal Dataset"}, {"paperId": "3d56ed8cc71be713ec13e6db307464394c74662d", "title": "“There’s so much responsibility on users right now:” Expert Advice for Staying Safer From Hate and Harassment"}, {"paperId": "10d100fa814f2a786fb38a4f2c700f0e8336a947", "title": "Abortion Misinformation on TikTok: Rampant Content, Lax Moderation, and Vivid User Experiences"}, {"paperId": "df8dde1115ea3deee5a1ea26124d140223c38f57", "title": "Lambretta: Learning to Rank for Twitter Soft Moderation"}, {"paperId": "b33250f67f9255b67d9255240607cd8ff8df8e2b", "title": "Strategies and Vulnerabilities of Participants in Venezuelan Influence Operations"}, {"paperId": "4802bfb162be70873689bd1c3a04a542ea01a8f3", "title": "Exposing influence campaigns in the age of LLMs: a behavioral-based AI approach to detecting state-sponsored trolls"}, {"paperId": "fac575ded0daf994751edd34466392782c9f2764", "title": "Fact-Saboteurs: A Taxonomy of Evidence Manipulation Attacks against Fact-Verification Systems"}, {"paperId": "fcd53b009fde0be9e9522f635cadb6d4b4a40ba4", "title": "Folk Models of Misinformation on Social Media"}, {"paperId": "7649bf74ce96faadd5dbaba989c3f83024bdfd04", "title": "Tactics, Threats & Targets: Modeling Disinformation and its Mitigation"}, {"paperId": "2abddb157a006aef54c537c0fb3de5a98b959876", "title": "H OW “T ROLL ” ARE YOU ? M EASURING AND D ETECTING T ROLL B EHAVIOR IN O NLINE S OCIAL N ETWORKS"}, {"paperId": "765b815bfa186bfead378041b736316d6b568618", "title": "H OW “T ROLL ” ARE YOU ? M EASURING AND D ETECTING T ROLL B EHAVIOR IN O NLINE S OCIAL N ETWORKS"}, {"paperId": "a7b120c43c1869552f86b096c890e4646dd1cd59", "title": "C HARACTERIZING AND D ETECTING S TATE -S PONSORED T ROLL A CTIVITY ON S OCIAL M EDIA"}, {"paperId": "5c08be3774cd2bab9d750a4548aae6b81c66842d", "title": "H OW “T ROLL ” ARE YOU ? M EASURING AND D ETECTING T ROLL B EHAVIOR IN O NLINE S OCIAL N ETWORKS"}, {"paperId": "68a57c052bc12cab54bff0eb7e2e78eb700f2250", "title": "H OW “T ROLL ” ARE YOU ? M EASURING AND D ETECTING T ROLL B EHAVIOR IN O NLINE S OCIAL N ETWORKS"}]}
