{"paperId": "c61d54644e9aedcfc756e5d6fe4cc8b78c87755d", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "A Survey of Large Language Models", "abstract": "Language is essentially a complex, intricate system of human expressions governed by grammatical rules. It poses a significant challenge to develop capable AI algorithms for comprehending and grasping a language. As a major approach, language modeling has been widely studied for language understanding and generation in the past two decades, evolving from statistical language models to neural language models. Recently, pre-trained language models (PLMs) have been proposed by pre-training Transformer models over large-scale corpora, showing strong capabilities in solving various NLP tasks. Since researchers have found that model scaling can lead to performance improvement, they further study the scaling effect by increasing the model size to an even larger size. Interestingly, when the parameter scale exceeds a certain level, these enlarged language models not only achieve a significant performance improvement but also show some special abilities that are not present in small-scale language models. To discriminate the difference in parameter scale, the research community has coined the term large language models (LLM) for the PLMs of significant size. Recently, the research on LLMs has been largely advanced by both academia and industry, and a remarkable progress is the launch of ChatGPT, which has attracted widespread attention from society. The technical evolution of LLMs has been making an important impact on the entire AI community, which would revolutionize the way how we develop and use AI algorithms. In this survey, we review the recent advances of LLMs by introducing the background, key findings, and mainstream techniques. In particular, we focus on four major aspects of LLMs, namely pre-training, adaptation tuning, utilization, and capacity evaluation. Besides, we also summarize the available resources for developing LLMs and discuss the remaining issues for future directions.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-03-31", "journal": {"name": "ArXiv", "volume": "abs/2303.18223"}, "authors": [{"authorId": "2542603", "name": "Wayne Xin Zhao"}, {"authorId": "1423651904", "name": "Kun Zhou"}, {"authorId": "2018027", "name": "Junyi Li"}, {"authorId": "1997234792", "name": "Tianyi Tang"}, {"authorId": "72541556", "name": "Xiaolei Wang"}, {"authorId": "151472453", "name": "Yupeng Hou"}, {"authorId": "2007666579", "name": "Yingqian Min"}, {"authorId": "2107926615", "name": "Beichen Zhang"}, {"authorId": "2155570461", "name": "Junjie Zhang"}, {"authorId": "2198280871", "name": "Zican Dong"}, {"authorId": "2111895473", "name": "Yifan Du"}, {"authorId": "2181967397", "name": "Chen Yang"}, {"authorId": "2109315001", "name": "Yushuo Chen"}, {"authorId": "46842323", "name": "Z. Chen"}, {"authorId": "2118240359", "name": "Jinhao Jiang"}, {"authorId": "1708171825", "name": "Ruiyang Ren"}, {"authorId": "2209136299", "name": "Yifan Li"}, {"authorId": "2109887979", "name": "Xinyu Tang"}, {"authorId": "2119618242", "name": "Zikang Liu"}, {"authorId": "2108129670", "name": "Peiyu Liu"}, {"authorId": "50204644", "name": "J. Nie"}, {"authorId": "153693432", "name": "Ji-rong Wen"}], "citations": [{"paperId": "7314d11ad399750f2b6eccc272993dae282e03b4", "title": "Future applications of generative large language models: A data-driven case study on ChatGPT"}, {"paperId": "c3673eee23a806269cf4793bfc85d9e94568883b", "title": "MLaKE: Multilingual Knowledge Editing Benchmark for Large Language Models"}, {"paperId": "735e8726fa7ad62ac15d4ed39540e0cb0feb17a9", "title": "A Map of Exploring Human Interaction patterns with LLM: Insights into Collaboration and Creativity"}, {"paperId": "e61a32cf3b253011cea5d4d88429ece876a1b6ae", "title": "DreamScene: 3D Gaussian-based Text-to-3D Scene Generation via Formation Pattern Sampling"}, {"paperId": "c849ab233a65f328c2f24f4b1361dcd86a062351", "title": "Scalable Model Editing via Customized Expert Networks"}, {"paperId": "c35b8dad08e11a77c249c0aed2b2f7f9ba853acd", "title": "A Survey on Large Language Model-Based Game Agents"}, {"paperId": "0fd55e413b587d3b090093d56665e472da2f63de", "title": "Comparative Study of Domain Driven Terms Extraction Using Large Language Models"}, {"paperId": "0aec4100d6459690d69e5e36780479ff20030559", "title": "Using Large Language Models to Understand Telecom Standards"}, {"paperId": "7e36e6b1a29a7d0865f40f9266d84302929971f4", "title": "Enhancing Reasoning Capacity of SLM using Cognitive Enhancement"}, {"paperId": "37ad92aa95a630371be2631d17a56c1785b5ac1e", "title": "CONSORT-TM: Text classification models for assessing the completeness of randomized controlled trial publications"}, {"paperId": "c7d6597da713c85306040b6037c9e6365a9119de", "title": "Multi-hop Question Answering under Temporal Knowledge Editing"}, {"paperId": "aff7e0c7cd10ffd6dcfc0d1572ec9e92896aae5f", "title": "Augmenting NER Datasets with LLMs: Towards Automated and Refined Annotation"}, {"paperId": "20e7c2874c2ab873491b75a6fba105f73d4270ba", "title": "Unsolvable Problem Detection: Evaluating Trustworthiness of Vision Language Models"}, {"paperId": "a9eb250d575b423dc16dfd6b0ed2208e8feadea7", "title": "An Exploratory Study on Upper-Level Computing Students' Use of Large Language Models as Tools in a Semester-Long Project"}, {"paperId": "ed683ec36467664b58d7fd075453f615a180364b", "title": "ConvoFusion: Multi-Modal Conversational Diffusion for Co-Speech Gesture Synthesis"}, {"paperId": "006c4c7470566327e5b02b94936d0be0033fc9f5", "title": "MAGIS: LLM-Based Multi-Agent Framework for GitHub Issue Resolution"}, {"paperId": "f9d897b334b8c17d579f92310405e21a3e6ad00f", "title": "Provably Secure Disambiguating Neural Linguistic Steganography"}, {"paperId": "7782b0d3381a2c8ce466cf17a8ece8358d767fda", "title": "Concurrent Linguistic Error Detection (CLED) for Large Language Models"}, {"paperId": "80a53a1482f8155f9b28fabd6225bb7505669197", "title": "How Reliable is Your Simulator? Analysis on the Limitations of Current LLM-based User Simulators for Conversational Recommendation"}, {"paperId": "f940b6e29af3cc0f70346f7abe2cba8ba8f77aae", "title": "A Comprehensive Study of the Capabilities of Large Language Models for Vulnerability Detection"}, {"paperId": "8b60f4075495d5563fb0fea22a832b4471d5009f", "title": "Knowledge-guided Machine Learning: Current Trends and Future Prospects"}, {"paperId": "1d4eed259b812acc51627f318cbe327ab4cef33f", "title": "Opportunities and challenges in the application of large artificial intelligence models in radiology"}, {"paperId": "43ad3f33c8b4196ee61ae6cbf596c17df5755501", "title": "Combining Fine-Tuning and LLM-based Agents for Intuitive Smart Contract Auditing with Justifications"}, {"paperId": "4c641b4b177024943c5b3cc527bf58632e9a4f41", "title": "A Little Leak Will Sink a Great Ship: Survey of Transparency for Large Language Models from Start to Finish"}, {"paperId": "7306e97d2fb5977572f47a90866323239ab1ccdc", "title": "Large Language Models in Biomedical and Health Informatics: A Bibliometric Review"}, {"paperId": "c52cfe08452f192d1fbf9cd215646466fa041da1", "title": "Evaluating GPT-4's Proficiency in Addressing Cryptography Examinations"}, {"paperId": "662f0841a2a8435c8b3f196a4016347ad31cd8d5", "title": "Comprehensive Reassessment of Large-Scale Evaluation Outcomes in LLMs: A Multifaceted Statistical Approach"}, {"paperId": "ac388e7ff01af33a81a147432f215239fb81e4ef", "title": "Cartoon Hallucinations Detection: Pose-aware In Context Visual Learning"}, {"paperId": "1bd31777c4c88992da4827d070d81e08e5b3976c", "title": "Less but Better: Enabling Generalized Zero-shot Learning Towards Unseen Domains by Intrinsic Learning from Redundant LLM Semantics"}, {"paperId": "1e80802a2fef00f2e10dfd4ab0ecce18ee2af82b", "title": "Exploring the Potential of Large Language Models in Graph Generation"}, {"paperId": "62690d78c1b9609036f7a456cc36b19c5dba6eb6", "title": "MyVLM: Personalizing VLMs for User-Specific Queries"}, {"paperId": "cb744211cfc25c476167ee545883151266d9c223", "title": "Large Language Models for Blockchain Security: A Systematic Literature Review"}, {"paperId": "b79763963b8ae1437f10875c3de91f72df67550d", "title": "UniBind: LLM-Augmented Unified and Balanced Representation Space to Bind Them All"}, {"paperId": "03ae1a664b52503594e4753f59615443d70695b6", "title": "RankPrompt: Step-by-Step Comparisons Make Language Models Better Reasoners"}, {"paperId": "15ef0417570a190241caac0615eabdff11abb4de", "title": "mPLUG-DocOwl 1.5: Unified Structure Learning for OCR-free Document Understanding"}, {"paperId": "ea9255d308852ed1f2f2ba5469a0b2df294f6aa1", "title": "BTGenBot: Behavior Tree Generation for Robotic Tasks with Lightweight LLMs"}, {"paperId": "ec1cff845691e7e31fc1e9dbea410b145b258f67", "title": "Pragmatic Competence Evaluation of Large Language Models for Korean"}, {"paperId": "f1f47af44677c6e076172b7e43ff295242308f47", "title": "Collage Prompting: Budget-Friendly Visual Recognition with GPT-4V"}, {"paperId": "d7655b20c9f88df1089edd78980dad5a257eac51", "title": "LLM3:Large Language Model-based Task and Motion Planning with Motion Failure Reasoning"}, {"paperId": "c1dc3ab05f0fcd78d400d864a6a5f19597d331a8", "title": "Leveraging Large Language Models to Extract Information on Substance Use Disorder Severity from Clinical Notes: A Zero-shot Learning Approach"}, {"paperId": "1c32d1b40bea554501c0672a763cb2017091abfd", "title": "Interpretable and predictive models to harness the life science data revolution"}, {"paperId": "b2fe395cfa3e7b7ddcb423f71b11df00acb83c2d", "title": "Using protein language models for protein interaction hot spot prediction with limited data"}, {"paperId": "583f02be772b176dd341e1e03e9fe0054c269f7f", "title": "TextBlockV2: Towards Precise-Detection-Free Scene Text Spotting with Pre-trained Language Model"}, {"paperId": "d96933cba676edbaad3a0564352ad29dbfe2c1f4", "title": "A survey of synthetic data augmentation methods in computer vision"}, {"paperId": "4c69d79c0ee7ac964284a75135b317d1ce7fb2d6", "title": "Keyformer: KV Cache Reduction through Key Tokens Selection for Efficient Generative Inference"}, {"paperId": "1819f0afee2b22f60179ea63211ed2f4b740893b", "title": "Enhancing Trust in Autonomous Agents: An Architecture for Accountability and Explainability through Blockchain and Large Language Models"}, {"paperId": "cf93c04b73d50ba097151ee3e2a9f47fda4a8525", "title": "BurstAttention: An Efficient Distributed Attention Framework for Extremely Long Sequences"}, {"paperId": "2c030ad4be327dc3447e23ad68c303714c55cf14", "title": "Images are Achilles' Heel of Alignment: Exploiting Visual Vulnerabilities for Jailbreaking Multimodal Large Language Models"}, {"paperId": "297d91c28bc64ce2b641859be251f2212af940f7", "title": "Reality Bites: Assessing the Realism of Driving Scenarios with Large Language Models"}, {"paperId": "dfbe6b218d752b67ce6dd80b8976ae1fba756ca9", "title": "Achieving Pareto Optimality using Efficient Parameter Reduction for DNNs in Resource-Constrained Edge Environment"}, {"paperId": "d0075dd5603c9d477edf0a41f59ab6dcf0e91976", "title": "Simple and Scalable Strategies to Continually Pre-train Large Language Models"}, {"paperId": "83ea26cc9caf8de601ffefc2e3bb79aae4c33eb1", "title": "AIGCs Confuse AI Too: Investigating and Explaining Synthetic Image-induced Hallucinations in Large Vision-Language Models"}, {"paperId": "987c04f34d399add7cc738e03257753668560407", "title": "Boosting Disfluency Detection with Large Language Model as Disfluency Generator"}, {"paperId": "7f96bb27a8fca35b1f7d02ee319a64be04114809", "title": "LLM-Assisted Light: Leveraging Large Language Model Capabilities for Human-Mimetic Traffic Signal Control in Complex Urban Environments"}, {"paperId": "0ea10f2132233b4f5d7cf701300cd0055e93e2d8", "title": "Ethos: Rectifying Language Models in Orthogonal Parameter Space"}, {"paperId": "fa485388a491948a5a1b561a51607569f14bfddc", "title": "Multi-task Manipulation Policy Modeling with Visuomotor Latent Diffusion"}, {"paperId": "4706711dc4e1e16424db9f454a1f3b092b972785", "title": "SVD-LLM: Truncation-aware Singular Value Decomposition for Large Language Model Compression"}, {"paperId": "1d65f59e1222b3abb395e9c2aa2ec36a9a69cf64", "title": "Academically intelligent LLMs are not necessarily socially intelligent"}, {"paperId": "75a381667ef536d02d99063eb3568e410d7ce909", "title": "Guiding Clinical Reasoning with Large Language Models via Knowledge Seeds"}, {"paperId": "b772b02708a7625f1044e4d5805b6cfd30ffaa80", "title": "Algorithmic progress in language models"}, {"paperId": "1359b818543bfde35f0966b74612d18ae28ca41f", "title": "On Protecting the Data Privacy of Large Language Models (LLMs): A Survey"}, {"paperId": "29712cb8f8e8dc3a574f92b0ad535380b0516b6e", "title": "tsGT: Stochastic Time Series Modeling With Transformer"}, {"paperId": "427b286483e3ae562a39f43c83725b5f4414d43f", "title": "Detection of Suicidality Through Privacy-Preserving Large Language Models"}, {"paperId": "d64e270e92d20cb071c2f188f523cd63b28ecd5a", "title": "Embodied Understanding of Driving Scenarios"}, {"paperId": "8a439444d888202a711b8b8a195934cdb138342e", "title": "Towards Efficient and Effective Unlearning of Large Language Models for Recommendation"}, {"paperId": "a4e996a6a3df1ac76a28b1e0513bbcb5449e4227", "title": "A Comprehensive Survey on Process-Oriented Automatic Text Summarization with Exploration of LLM-Based Methods"}, {"paperId": "2a894353f7327e8a23cc9edd18a43deb2908ee9d", "title": "Systematic Review of Large Language Models for Patient Care: Current Applications and Challenges"}, {"paperId": "c5211f32b79661cbd9ea6a904772d7d1ca5c935b", "title": "A Survey on Evaluation of Out-of-Distribution Generalization"}, {"paperId": "451adf52ee21a07da570f9164481e207398db977", "title": "Model-Based Data-Centric AI: Bridging the Divide Between Academic Ideals and Industrial Pragmatism"}, {"paperId": "d2a6f3fbd6bfab3d535fd0803c5ecf38349a7b67", "title": "Using LLMs for the Extraction and Normalization of Product Attribute Values"}, {"paperId": "0f5d1862d01917152cdefbff8b3f6cc9ea922c0c", "title": "TPLLM: A Traffic Prediction Framework Based on Pretrained Large Language Models"}, {"paperId": "b671934871fb9a2db3ba729647f298d46958804d", "title": "Large Language Model-Based Evolutionary Optimizer: Reasoning with elitism"}, {"paperId": "d563c934e3bd6633d69300ea4725a11064479872", "title": "Online Training of Large Language Models: Learn while chatting"}, {"paperId": "a161f877b87527e7f411e18a7ee4b3a942ac4fac", "title": "LLM vs. Lawyers: Identifying a Subset of Summary Judgments in a Large UK Case Law Dataset"}, {"paperId": "c41ff6575a0eb5942212de2cfdb09396bcb3601e", "title": "NPHardEval4V: A Dynamic Reasoning Benchmark of Multimodal Large Language Models"}, {"paperId": "a9f7761b740c85444b86f581801a471340007a0d", "title": "scELMo: Embeddings from Language Models are Good Learners for Single-cell Data Analysis"}, {"paperId": "e3ebab9f6b1f957de6422a379e5d5bd5e0162a64", "title": "SERVAL: Synergy Learning between Vertical Models and LLMs towards Oracle-Level Zero-shot Medical Prediction"}, {"paperId": "d2503ddd1bcd4b33ac1c703c3475d6aae8abf483", "title": "LLaMoCo: Instruction Tuning of Large Language Models for Optimization Code Generation"}, {"paperId": "0e28f429602e854784d2a47a35f51125a7ab111b", "title": "A Two-Stage Algorithm for Cost-Efficient Multi-instance Counterfactual Explanations"}, {"paperId": "881a1dca5ebd88d1967f6aa88893c00df5444250", "title": "Large Language Multimodal Models for 5-Year Chronic Disease Cohort Prediction Using EHR Data"}, {"paperId": "df788461949434a8fd7bac2952e98454e46c0825", "title": "Multi-modal Attribute Prompting for Vision-Language Models"}, {"paperId": "ab3716938873cbcbe726e9f575ec2ba26bb7f379", "title": "AutoRD: An Automatic and End-to-End System for Rare Disease Knowledge Graph Construction Based on Ontologies-enhanced Large Language Models"}, {"paperId": "218e3fdfe1b5c266d0cb50dd20dd0211e16580d1", "title": "Identify Critical Nodes in Complex Network with Large Language Models"}, {"paperId": "8883e33cb3f0a71cf8b5f6f52c04e80332edd0bc", "title": "Beware of Botshit: How to Manage the Epistemic Risks of Generative Chatbots"}, {"paperId": "30f843a343b0f6d4ebf2df672e852b6c160bd810", "title": "VEnvision3D: A Synthetic Perception Dataset for 3D Multi-Task Model Research"}, {"paperId": "5030906b0281b30ec10a38b563eb5d5b9b233ed7", "title": "A Survey on Recent Advances in LLM-Based Multi-turn Dialogue Systems"}, {"paperId": "4efa6328a0fd405ecc133da93eeed60b82276ae2", "title": "Exploring Advanced Methodologies in Security Evaluation for LLMs"}, {"paperId": "7bc68f9133024a79d2962fada8ba319a67efa715", "title": "Empowering Personalized Pharmacogenomics with Generative AI Solutions"}, {"paperId": "c7d35995a9a4d49011cf47f130535e1391ebeebc", "title": "OmniACT: A Dataset and Benchmark for Enabling Multimodal Generalist Autonomous Agents for Desktop and Web"}, {"paperId": "29800dc2c5f4cd9a2e161233b5ae374b6ba80235", "title": "CARZero: Cross-Attention Alignment for Radiology Zero-Shot Classification"}, {"paperId": "bbbed70ab3e2b3717e3af69007e36be7426935f7", "title": "Why do Learning Rates Transfer? Reconciling Optimization and Scaling Limits for Deep Learning"}, {"paperId": "e1a294a8fcd223ef1ac06fec213d7cfaef88a07f", "title": "A Language Model based Framework for New Concept Placement in Ontologies"}, {"paperId": "f342713d3f5ac5530ff13fe1ff168aa8a6d28c94", "title": "Evaluating the Utilities of Foundation Models in Single-cell Data Analysis"}, {"paperId": "550676250271276becf5a400f072241daf734f4f", "title": "Determinants of LLM-assisted Decision-Making"}, {"paperId": "26a35eefcbf2d0598e5d9b020030d9dd48d572eb", "title": "Enhancing Mental Health Condition Detection on Social Media through Multi-Task Learning"}, {"paperId": "dbf829c977c121c3704d070d7800d29fe5914756", "title": "LLM Inference Unveiled: Survey and Roofline Model Insights"}, {"paperId": "1296d51001f8a73c0a3356f78b136a691928985c", "title": "ProLLaMA: A Protein Large Language Model for Multi-Task Protein Language Processing"}, {"paperId": "77b0e94d7820c5db65814fc65e524ba8f87d543e", "title": "A Comprehensive Evaluation of Quantization Strategies for Large Language Models"}, {"paperId": "eba37254ff8409707fb89fd2683363c587abad1c", "title": "InteraRec: Interactive Recommendations Using Multimodal Large Language Models"}, {"paperId": "bb6fbcc3d89c0b064769278a2cbdd60aa44ac11a", "title": "NeSy is alive and well: A LLM-driven symbolic approach for better code comment data generation and classification"}, {"paperId": "0a88726548d4ab50c3b28f1ce839220997875cf6", "title": "InstructEdit: Instruction-based Knowledge Editing for Large Language Models"}, {"paperId": "97c203e47b8fd987b6a2e7505669e3b9ae9a147d", "title": "LLMs Can Defend Themselves Against Jailbreaking in a Practical Manner: A Vision Paper"}, {"paperId": "21527668351bf8f4d63bc2bde518db62b71a9eb3", "title": "Open Ad Hoc Teamwork with Cooperative Game Theory"}, {"paperId": "82d441075736d467f6ebb17d95126fb2dcd23e85", "title": "Whose LLM is it Anyway? Linguistic Comparison and LLM Attribution for GPT-3.5, GPT-4 and Bard"}, {"paperId": "36d52177a7895eb8ff13e46244a56b8162660522", "title": "IEPile: Unearthing Large-Scale Schema-Based Information Extraction Corpus"}, {"paperId": "d288b03efdea01d96dc1666bef13db71ea2d9deb", "title": "A Study on Performance Improvement of Prompt Engineering for Generative AI with a Large Language Model"}, {"paperId": "a7f307dfb783b9486d09722029939ca2e5eafa77", "title": "An Explainable Transformer-based Model for Phishing Email Detection: A Large Language Model Approach"}, {"paperId": "c8a6aa5d4ba18f3e38f8de27aa17d6fcfb33b89f", "title": "Exploring ChatGPT and its impact on society"}, {"paperId": "48f88aa4a854b0f5d5b227a048233c8f0e3ecfb3", "title": "Incentive Compatibility for AI Alignment in Sociotechnical Systems: Positions and Prospects"}, {"paperId": "1c0b3679919cd0531973fced1a1eb49745d9332d", "title": "Instruction-tuned Language Models are Better Knowledge Learners"}, {"paperId": "99f6acfc14ee633787f987768b31b240a87c2c0f", "title": "Me LLaMA: Foundation Large Language Models for Medical Applications"}, {"paperId": "69b53faee7ce5c007e4d3e3ea532818ed8d0645d", "title": "A Literature Review of Literature Reviews in Pattern Analysis and Machine Intelligence"}, {"paperId": "94db8a625418800c8ae7b48157a9cad1c8129051", "title": "A Survey on Knowledge Distillation of Large Language Models"}, {"paperId": "c261f52acdefa00620fd9b76d4cc214be197beb9", "title": "Formal Software Architecture Rule Learning: A Comparative Investigation between Large Language Models and Inductive Techniques"}, {"paperId": "868325573e68c98fe467894e5d72946c34c8e6e7", "title": "Is Open-Source There Yet? A Comparative Study on Commercial and Open-Source LLMs in Their Ability to Label Chest X-Ray Reports"}, {"paperId": "35535985761a709112dcbf4b1c9f063bae536b98", "title": "Shall We Talk: Exploring Spontaneous Collaborations of Competing LLM Agents"}, {"paperId": "2bd09677fc5d39d8ace60a704b80ecffdb2a0bfe", "title": "Investigating Multi-Hop Factual Shortcuts in Knowledge Editing of Large Language Models"}, {"paperId": "9be1b9b8b6e97e31c3e16c0263c54b337f46baa2", "title": "SInViG: A Self-Evolving Interactive Visual Agent for Human-Robot Interaction"}, {"paperId": "09f78ccd20f865c288b421376baddb0096c651be", "title": "SPML: A DSL for Defending Language Models Against Prompt Attacks"}, {"paperId": "e8396c02d252d3798303baecd3362eabf8e37364", "title": "Leveraging Large Language Models and Prompt Settings for Context-Aware Financial Sentiment Analysis"}, {"paperId": "dd100045733dd65c3415fd87c573630808cff941", "title": "Parameter Efficient Diverse Paraphrase Generation Using Sequence-Level Knowledge Distillation"}, {"paperId": "e785b33b3367015db69657f37f98402f27a198df", "title": "Towards Versatile Graph Learning Approach: from the Perspective of Large Language Models"}, {"paperId": "6a4cc1a573e1db5cbc8b1c3feeee193587f708fc", "title": "ModelGPT: Unleashing LLM's Capabilities for Tailored Model Generation"}, {"paperId": "e53412b4f0f15330f8efa84e3c8f649bbe5e26f7", "title": "An Empirical Categorization of Prompting Techniques for Large Language Models: A Practitioner's Guide"}, {"paperId": "22be54a496344470e9379761aeed66115d218979", "title": "TuneTables: Context Optimization for Scalable Prior-Data Fitted Networks"}, {"paperId": "2ebc79d9a2bd6729f3c66b0ff4930cf109ffddc2", "title": "Physics-Informed Neural Network (PINN) for Solving Frictional Contact Temperature and Inversely Evaluating Relevant Input Parameters"}, {"paperId": "7f35af41dbb2b2918d44ad23de950bf42a8a59a7", "title": "Multi-Generative Agent Collective Decision-Making in Urban Planning: A Case Study for Kendall Square Renovation"}, {"paperId": "0fa49dc5da32d418d1ebcefe5dd7f6da8f5d4dd8", "title": "Bard, ChatGPT and 3DGPT: a scientometric analysis of generative AI tools and assessment of implications for mechanical engineering education"}, {"paperId": "587547493b5cf221af4b929cf390ef81e9768937", "title": "Cell2Sentence: Teaching Large Language Models the Language of Biology"}, {"paperId": "a6b2b636bb0dbe144f3d37f937735f384c50c4d5", "title": "Mixture of Experts for Network Optimization: A Large Language Model-enabled Approach"}, {"paperId": "be2d84f0575258e4b49afe805f7a1cac77041afa", "title": "MuChin: A Chinese Colloquial Description Benchmark for Evaluating Language Models in the Field of Music"}, {"paperId": "068ff3def994d1424832e1f56ed72ef8245a42f0", "title": "Inadequacies of Large Language Model Benchmarks in the Era of Generative Artificial Intelligence"}, {"paperId": "315bffd94456ff2a214a5a972c2f5c7f2ddb2163", "title": "eCeLLM: Generalizing Large Language Models for E-commerce from Large-scale, High-quality Instruction Data"}, {"paperId": "6f826d007e851f0c694fbe0c378d5e0097aa18a2", "title": "A Survey of Table Reasoning with Large Language Models"}, {"paperId": "1be5dcb0306b6039e5859059c2f8cf59b9950d4e", "title": "The Effect of Data Poisoning on Counterfactual Explanations"}, {"paperId": "6a9c796d561995221474615eedb04cee93795446", "title": "Artificial intelligence and the transformation of higher education institutions"}, {"paperId": "e5f7d54842174a23bab117672a75f7535e4aacff", "title": "Utilizing Large LanguageModels to Detect Privacy Leaks in Mini-App Code"}, {"paperId": "64a2001747524a38d624c181b7ebf339745af999", "title": "Large Language Models are Few-shot Generators: Proposing Hybrid Prompt Algorithm To Generate Webshell Escape Samples"}, {"paperId": "f3292f1e57e459477a9bcecdf8c859ea0a765145", "title": "Resilient Watermarking for LLM-Generated Codes"}, {"paperId": "b8dbdb9eb9141562f7d48bc3709fee2d23f5e5bd", "title": "LLaVA-Docent: Instruction Tuning with Multimodal Large Language Model to Support Art Appreciation Education"}, {"paperId": "a1f76db91c0debcf93ae9889736bce8470902113", "title": "Large Language Models: A Survey"}, {"paperId": "f5e7e22036c3fe7d6660eee90642f716c3b303f5", "title": "StruQ: Defending Against Prompt Injection with Structured Queries"}, {"paperId": "00f67ddfa49027517b90f491757220abcabdbaea", "title": "A Unified Causal View of Instruction Tuning"}, {"paperId": "e5481d7b936569040220867f533696af46017b3a", "title": "Comparison of Prompt Engineering and Fine-Tuning Strategies in Large Language Models in the Classification of Clinical Notes"}, {"paperId": "cb169315cb75ce4b1af20083fbbe46c553e7f252", "title": "Accurate LoRA-Finetuning Quantization of LLMs via Information Retention"}, {"paperId": "fa7f14bb16e6448f6650ae1c41f6b437f447d4a6", "title": "Enhancing Zero-shot Counting via Language-guided Exemplar Learning"}, {"paperId": "19c29bd4888a9a376842ce8b5f862a10ade19a25", "title": "Let Your Graph Do the Talking: Encoding Structured Data for LLMs"}, {"paperId": "4819c866fc634a45ad5e8b8847b3497d23ccdf49", "title": "RepQuant: Towards Accurate Post-Training Quantization of Large Transformer Models via Scale Reparameterization"}, {"paperId": "450d97c7f456eafbb69dd70322d341058028b171", "title": "In-Context Principle Learning from Mistakes"}, {"paperId": "f92610c14267dc148ee26f180c866327f1c368a1", "title": "SimilarBERT: A Framework for Similarity-based Topic Modeling"}, {"paperId": "930b5331056d6e543191866df530ce3d5061c2ed", "title": "The Future of Cognitive Strategy-enhanced Persuasive Dialogue Agents: New Perspectives and Trends"}, {"paperId": "d25c6e3fd588edb4eea39b09c90da0401bd16a85", "title": "TinyLLM: Learning a Small Student from Multiple Large Language Models"}, {"paperId": "ed2c3f9fd24a4aa4b05f2c2729c7450da2bfe7e7", "title": "ReLU2 Wins: Discovering Efficient Activation Functions for Sparse LLMs"}, {"paperId": "81c57cc475dbba8123c9ea33e05fb9cdd8b8bc66", "title": "Behind the Screen: Investigating ChatGPT's Dark Personality Traits and Conspiracy Beliefs"}, {"paperId": "525ff089b6c5df9b311124adc3e549060093c982", "title": "Do Large Language Models Show Human-like Biases? Exploring Confidence - Competence Gap in AI"}, {"paperId": "4a5b69b3f79d9fed2eeb82585df35c6bb9a72194", "title": "EasyInstruct: An Easy-to-use Instruction Processing Framework for Large Language Models"}, {"paperId": "7e281e8ab380affd3c5724feae038274df378511", "title": "Understanding the planning of LLM agents: A survey"}, {"paperId": "f64e917b0b88eb8401c526c1e808a50db9cd0e26", "title": "Detecting Scams Using Large Language Models"}, {"paperId": "ce0219aab283c07369187348d72f8c5fe9898e9b", "title": "Large Language Models are Geographically Biased"}, {"paperId": "44f6cea2aa05620fef00d8dc9e566918dc6771c9", "title": "Empowering Time Series Analysis with Large Language Models: A Survey"}, {"paperId": "c1fc2546b1476b77448e01b9d7d0a50d1bf632d3", "title": "Large Language Model Distilling Medication Recommendation Model"}, {"paperId": "4ab94ebbf8f00174b094e93ba9af6c076a9a0ce2", "title": "ISPA: Inter-Species Phonetic Alphabet for Transcribing Animal Sounds"}, {"paperId": "26afd6184e4f504f1f52d26e0f1eeae705defffe", "title": "Analyzing global utilization and missed opportunities in debt-for-nature swaps with generative AI"}, {"paperId": "677bbb40c1b6609b581be5b531bb672ee96d7866", "title": "TexShape: Information Theoretic Sentence Embedding for Language Models"}, {"paperId": "d488445bb2bf6719bc48a4d39bd906116274abda", "title": "AutoTimes: Autoregressive Time Series Forecasters via Large Language Models"}, {"paperId": "6b63b78b8368b5974d69e413291fb86c32d6df96", "title": "Timer: Transformers for Time Series Analysis at Scale"}, {"paperId": "d80a87f3624461b36acdeb809c50979ba89fb1be", "title": "A Survey of Large Language Models in Finance (FinLLMs)"}, {"paperId": "fc0c58b6787f00ec750c6d402deef64c2410860c", "title": "Aligner: Achieving Efficient Alignment through Weak-to-Strong Correction"}, {"paperId": "b4e241e73c614f4278945dd963b3efcf452953cb", "title": "Artificial Intelligence in Image-based Cardiovascular Disease Analysis: A Comprehensive Survey and Future Outlook"}, {"paperId": "281b1099de129d188f99c8665115e911ffec8956", "title": "Large Language Model for Table Processing: A Survey"}, {"paperId": "52f3338b8969517629097e745f66cb9eac5f99c5", "title": "Advancing Graph Representation Learning with Large Language Models: A Comprehensive Survey of Techniques"}, {"paperId": "2e8ca21114ecefac88fd2b3a2daacae352b1907f", "title": "Beyond the Limits: A Survey of Techniques to Extend the Context Length in Large Language Models"}, {"paperId": "0081c0a8228a3a1efad8cfddf657f09f76d1546a", "title": "A Data Generation Perspective to the Mechanism of In-Context Learning"}, {"paperId": "6d8efe141ead5e397ca9a49814d049290292e974", "title": "More Agents Is All You Need"}, {"paperId": "acbce5ebf3f254188d10f6ba7de1ba716db89774", "title": "A Closer Look at the Limitations of Instruction Tuning"}, {"paperId": "89d6b9c49cc14d007e679a1796874d0be981fae4", "title": "SignSGD with Federated Defense: Harnessing Adversarial Attacks through Gradient Sign Decoding"}, {"paperId": "be7a88babf78512b545f585517704cb597388cbc", "title": "ReEvo: Large Language Models as Hyper-Heuristics with Reflective Evolution"}, {"paperId": "9673de92becda50f07d529200aa4cb1fa06b7dc8", "title": "Peer-review-in-LLMs: Automatic Evaluation Method for LLMs in Open-environment"}, {"paperId": "c362015d426c90ec01e1ad02bf3fd66ab8fd0fd9", "title": "The RL/LLM Taxonomy Tree: Reviewing Synergies Between Reinforcement Learning and Large Language Models"}, {"paperId": "3dd86949c4028ac5d29428acd9e9439e7fc29fa0", "title": "PAP-REC: Personalized Automatic Prompt for Recommendation Language Model"}, {"paperId": "71c7f6b006be878fc1862d1d215dad2301bf451e", "title": "From PARIS to LE-PARIS: Toward Patent Response Automation with Recommender Systems and Collaborative Large Language Models"}, {"paperId": "d184e8cd5c8cc75979ca4206218da796ef486b9e", "title": "Integrating LLM with Blockchain and IPFS to Enhance Academic Diploma Integrity"}, {"paperId": "6d892cdc197d7b762bbde4a0a7147cb6549920d2", "title": "A Survey on Data-Centric Recommender Systems"}, {"paperId": "a66b56be4e521c0510befa5a172629c305de4839", "title": "Contextual Feature Extraction Hierarchies Converge in Large Language Models and the Brain"}, {"paperId": "a771d63e16c045ea8a01b2eb8373c115a9a9b9a1", "title": "Multimodal Clinical Pseudo-notes for Emergency Department Prediction Tasks using Multiple Embedding Model for EHR (MEME)"}, {"paperId": "59f4322ff656c81e9767c78e8599dabccebb5b5c", "title": "Are Generative AI systems Capable of Supporting Information Needs of Patients?"}, {"paperId": "2b28e170adf5cc68adcd158f0ba6dc8f810394d4", "title": "ChIRAAG: ChatGPT Informed Rapid and Automated Assertion Generation"}, {"paperId": "f09904d113b33071385d39655e40b465c55e8784", "title": "Conditional and Modal Reasoning in Large Language Models"}, {"paperId": "1d500905ca70d40a85d10f60d44a018ec0d9349d", "title": "Weaver: Foundation Models for Creative Writing"}, {"paperId": "83b95829433b68e1d1cc2afb3b05343ebd0e6ebb", "title": "Recent Advances in Hate Speech Moderation: Multimodality and the Role of Large Models"}, {"paperId": "8e1c0a78a26a59cbe4ac82f13d9d01017a9bcb73", "title": "Towards Urban General Intelligence: A Review and Outlook of Urban Foundation Models"}, {"paperId": "5b6622e03e20ae1acbcd9390f98d7739c7fc6517", "title": "VIALM: A Survey and Benchmark of Visually Impaired Assistance with Large Models"}, {"paperId": "7d7567340337b89c995c3525d89a6c713d1481e6", "title": "L-AutoDA: Leveraging Large Language Models for Automated Decision-based Adversarial Attacks"}, {"paperId": "1932269090210059b236559e4272cf84c6784640", "title": "A Survey on Data Augmentation in Large Model Era"}, {"paperId": "7754ac3e8ff1286f17593159781487543cdddaba", "title": "SliceGPT: Compress Large Language Models by Deleting Rows and Columns"}, {"paperId": "f58a49ea99e9a2754dd050927b9d830e3743f844", "title": "Towards 3D Molecule-Text Interpretation in Language Models"}, {"paperId": "017069c05bf1362c3c593822fe9ee66b4dabb025", "title": "Hierarchical Continual Reinforcement Learning via Large Language Model"}, {"paperId": "3927a679b60dd3d671224fa0bc7297bccbe2d493", "title": "When Geoscience Meets Generative AI and Large Language Models: Foundations, Trends, and Future Challenges"}, {"paperId": "eff9d7ed06f30f121d30ee13802a11f172ef66f4", "title": "Demystifying Chains, Trees, and Graphs of Thoughts"}, {"paperId": "c57ba5e88907623bd4876070a5b764eafce8ae77", "title": "How Good Is ChatGPT at Face Biometrics? A First Look Into Recognition, Soft Biometrics, and Explainability"}, {"paperId": "cba6c2ad1a66d2f550599c0e6a95271bdab03404", "title": "Can GPT-3.5 Generate and Code Discharge Summaries?"}, {"paperId": "30d9233363afd863dfdbd10fd1a1c237ab168637", "title": "Semantic Communication: A Survey of Its Theoretical Development"}, {"paperId": "3d6197e4ab55a3a2785ce5934e48cfbe9fe9bf04", "title": "Revolutionizing Finance with LLMs: An Overview of Applications and Insights"}, {"paperId": "12ed45473dee6d0917f8577157cb86952cb162ce", "title": "Detecting Multimedia Generated by Large AI Models: A Survey"}, {"paperId": "d7c98899eb281d8f67899bf1959f288627780d3e", "title": "A Framework to Implement 1+N Multi-task Fine-tuning Pattern in LLMs Using the CGC-LORA Algorithm"}, {"paperId": "cf8030deece6d896c882e5ead57edc4d3e983ead", "title": "Progress in Privacy Protection: A Review of Privacy Preserving Techniques in Recommender Systems, Edge Computing, and Cloud Computing"}, {"paperId": "37caf0e6aa88936501e01a8558ddb543a4665646", "title": "LLM4Fuzz: Guided Fuzzing of Smart Contracts with Large Language Models"}, {"paperId": "1456486e2ac269fe6c609673a719a83d798c514a", "title": "FAIR Enough: How Can We Develop and Assess a FAIR-Compliant Dataset for Large Language Models' Training?"}, {"paperId": "97b9f33964681f10e306dec685311d75bd5a0c4b", "title": "Comparative Evaluation of Large Language Models for Abstractive Summarization"}, {"paperId": "6514abaf6bdd1c31ac5dc4ad40760ff8422c6a4e", "title": "A Study on Training and Developing Large Language Models for Behavior Tree Generation"}, {"paperId": "38bb1b247ee019fb3d2e0cb53fa4e067970bbf91", "title": "GMLake: Efficient and Transparent GPU Memory Defragmentation for Large-scale DNN Training with Virtual Memory Stitching"}, {"paperId": "be0e00f3ad3083636ec1eb761a4559545ea56c49", "title": "Instilling Multi-round Thinking to Text-guided Image Generation"}, {"paperId": "9c443913ce3696a04cd098e44c97af0f553155bc", "title": "Foundation Models in Augmentative and Alternative Communication: Opportunities and Challenges"}, {"paperId": "2b6fe3e433707b5521ed2a50274c27ea8750b40f", "title": "SpecGen: Automated Generation of Formal Program Specifications via Large Language Models"}, {"paperId": "a239365148592a18539c0cef8461c6d89b7826bb", "title": "Domain Adaptation for Large-Vocabulary Object Detectors"}, {"paperId": "79e729b0a05547486f2e450387022e9c9fe6d729", "title": "PersianMind: A Cross-Lingual Persian-English Large Language Model"}, {"paperId": "2e3617718b7a73e091583b61f6ffdfeb719dcb66", "title": "Automated Test Case Repair Using Language Models"}, {"paperId": "f0578911808d883d96a01e38a9709488ee19aa31", "title": "Between Lines of Code: Unraveling the Distinct Patterns of Machine and Human Programmers"}, {"paperId": "de4dfb773ab455081e5fb1862e08f581c58d43bc", "title": "Risk Taxonomy, Mitigation, and Assessment Benchmarks of Large Language Model Systems"}, {"paperId": "6fe92538b289b160365880e265a99b4e4b319fc5", "title": "Low-resource finetuning of foundation models beats state-of-the-art in histopathology"}, {"paperId": "8296eef3797afd1515021ff568a694412c38101b", "title": "Large Language Models for Robotics: Opportunities, Challenges, and Perspectives"}, {"paperId": "182a8db5b76cf69294ade7b8a3902850135218ba", "title": "Adapting Standard Retrieval Benchmarks to Evaluate Generated Answers"}, {"paperId": "fbb9baa37b1661c052fcbb07c7f52d6b9fee663b", "title": "AI Hallucinations: A Misnomer Worth Clarifying"}, {"paperId": "efc6b5855c6235c8efd979fcf91e7e105b4da24a", "title": "Unveiling Bias in Fairness Evaluations of Large Language Models: A Critical Literature Review of Music and Movie Recommendation Systems"}, {"paperId": "a028770b6bd8167874c54e01ff79649d24b6df87", "title": "T-FREX: A Transformer-based Feature Extraction Method from Mobile App Reviews"}, {"paperId": "8ae7e1a4f7451585093a5203e99f61a79838699a", "title": "On Leveraging Large Language Models for Enhancing Entity Resolution"}, {"paperId": "16490bb36ae852d1bbdbe69f8a45e459c8bf09fb", "title": "Computational Argumentation-based Chatbots: a Survey"}, {"paperId": "0d558136634156da3677d89d7ad9654342334c4d", "title": "Training and Serving System of Foundation Models: A Comprehensive Survey"}, {"paperId": "d18dc681627b2d78ed09e02da99c22e9f27afd2c", "title": "AFSPP: Agent Framework for Shaping Preference and Personality with Large Language Models"}, {"paperId": "420087f314633a381e61e6c5cd73ccc2070a749e", "title": "PeFoMed: Parameter Efficient Fine-tuning on Multimodal Large Language Models for Medical Visual Question Answering"}, {"paperId": "6a284bd92f0b511fa1076c03e71b8b4b64272c72", "title": "Comparative Analysis of LLaMA and ChatGPT Embeddings for Molecule Embedding"}, {"paperId": "6d91f344e9c80df5c69311abfc63b74b42c735c3", "title": "An Example of Evolutionary Computation + Large Language Model Beating Human: Design of Efficient Guided Local Search"}, {"paperId": "efc5e94635a850ede9c1f8dbce65d5dc536f3bfb", "title": "Understanding LLMs: A Comprehensive Overview from Training to Inference"}, {"paperId": "52b7c596185233ca269b4db5fe54ab6e356e64fa", "title": "Can AI Be as Creative as Humans?"}, {"paperId": "0251bb95be75d472c8d5b873751615e7fe2feb1d", "title": "A Comprehensive Study of Knowledge Editing for Large Language Models"}, {"paperId": "a9468d8bfa6bd016dfd3128c4e8408e30eb8549b", "title": "LLM Maybe LongLM: Self-Extend LLM Context Window Without Tuning"}, {"paperId": "b19dc16f5a3218d01f1246aa8068fc245880a10b", "title": "Generative AI design for building structures"}, {"paperId": "1b516059eee07c1f7dae4008d7109e0f6bff64bb", "title": "Large Language Models in Mental Health Care: a Scoping Review"}, {"paperId": "987b4bb80c09b6d239bb29e449dc361b3b5d4a94", "title": "Fine-tuning and Utilization Methods of Domain-specific LLMs"}, {"paperId": "4c4544beb93df95b8ce49d15c8c78e766b1f5bae", "title": "Using Large Language Models to Enhance the Reusability of Sensor Data"}, {"paperId": "4deeb8ea9fd60858bde847775170168e1ede883e", "title": "keqing: knowledge-based question answering is a nature chain-of-thought mentor of LLM"}, {"paperId": "acd7adcdb914fb2e18a19792af47e59e78cab3f0", "title": "Overview of the PromptCBLUE Shared Task in CHIP2023"}, {"paperId": "5f58863dd6474d6f127be995b5871e7c60f2792f", "title": "Video Understanding with Large Language Models: A Survey"}, {"paperId": "c3bacc93d8c0c6ed31763d0c0fc7951f0ab82ed8", "title": "Differentially Private Low-Rank Adaptation of Large Language Model Using Federated Learning"}, {"paperId": "998cdf8e83568280c2fb67c856d9d7644a2e65ca", "title": "Review of Machine Learning Approaches for Diagnostics and Prognostics of Industrial Systems Using Industrial Open Source Data"}, {"paperId": "b9ee59e296dc2d7d4ae3f3346a1f0ba7ea881570", "title": "LLM Factoscope: Uncovering LLMs' Factual Discernment through Inner States Analysis"}, {"paperId": "1a6bd4f70bceb26ddb722ce98c0eae2a64147048", "title": "Knowledge-Based and Generative-AI-Driven Pedagogical Conversational Agents: A Comparative Study of Grice's Cooperative Principles and Trust"}, {"paperId": "3fa9f7aa5e8050b54e1aca41407c12922a6e4867", "title": "Supervised Knowledge Makes Large Language Models Better In-context Learners"}, {"paperId": "2385b5263646954287a2a2baf04bae5b969a45e1", "title": "DEAP: Design Space Exploration for DNN Accelerator Parallelism"}, {"paperId": "d13c23e8f91a6deda6b1303e1c44da644ceea541", "title": "A Unified Industrial Large Knowledge Model Framework in Smart Manufacturing"}, {"paperId": "a2d069eb8c772e51292d52e297a464a5eb51979f", "title": "NPHardEval: Dynamic Benchmark on Reasoning Ability of Large Language Models via Complexity Classes"}, {"paperId": "4e365722c468cbd0a93ec6e26f13a0bef74be71d", "title": "Verbal lie detection using Large Language Models"}, {"paperId": "8596a700705502563f5549fa005014cfff2b675d", "title": "Domain-Specific Code Language Models: Unraveling the Potential for HPC Codes and Tasks"}, {"paperId": "362cae35fb65710af8230a4ee8e1aad1f275a4e7", "title": "WaveCoder: Widespread And Versatile Enhanced Instruction Tuning with Refined Data Generation"}, {"paperId": "592ac35991e583fc37c26ee6659d2deb85142ad9", "title": "Large Language Models Empowered Agent-based Modeling and Simulation: A Survey and Perspectives"}, {"paperId": "34ad751c1e797975452c655e3912313044d1dd17", "title": "Urban Generative Intelligence (UGI): A Foundational Platform for Agents in Embodied City Environment"}, {"paperId": "79329bbc23642adae83ce123ec81005582520961", "title": "External Knowledge Augmented Polyphone Disambiguation Using Large Language Model"}, {"paperId": "d7368735e17951ff16d79fa79fc34857b3002dfd", "title": "Unraveling the landscape of large language models: a systematic review and future perspectives"}, {"paperId": "d8c5db7ba743e4af2410aee5035e038d4d3b1aed", "title": "POND: Multi-Source Time Series Domain Adaptation with Information-Aware Prompt Tuning"}, {"paperId": "7fe9e72f4838398e2e931a616fc4a4fa71aef133", "title": "LARGE LANGUAGE MODELS (LLMS) AND CHATGPT FOR BIOMEDICINE."}, {"paperId": "b6bc1590ae632fd8325fab23edf5c333a9a7723c", "title": "A Unified Framework for Multi-Domain CTR Prediction via Large Language Models"}, {"paperId": "7a31971b0af439dec6fc484cca20df57f440b644", "title": "One Shot Learning as Instruction Data Prospector for Large Language Models"}, {"paperId": "493a931db01812489c04b04fec525e6bb44d83de", "title": "M2ConceptBase: A Fine-grained Aligned Multi-modal Conceptual Knowledge Base"}, {"paperId": "dfc0aafbcdbb9fe991dd27821fe11a4131af315b", "title": "A Survey on Robotic Manipulation of Deformable Objects: Recent Advances, Open Challenges and New Frontiers"}, {"paperId": "cde02d3c0db2847717f90be3fd205ab6cc28a9dd", "title": "Pipeline and Dataset Generation for Automated Fact-checking in Almost Any Language"}, {"paperId": "01d088de0c8e3c96a2924d4db2aac32b3d42a877", "title": "An Investigation of Large Language Models for Real-World Hate Speech Detection"}, {"paperId": "59d02a60eda797b74c6daef193734e0c6cd8ebaa", "title": "Towards Large Language Model Organization: A Case Study on Abstractive Summarization"}, {"paperId": "a9b85026ae5b330de27404909513252f87d8a933", "title": "Constructing Knowledge Graph from Cyber Threat Intelligence Using Large Language Model"}, {"paperId": "63b2376f025dcc3432bfc7f08525f0e55f31a922", "title": "Knowledge Prompt for Whisper: An ASR Entity Correction Approach with Knowledge Base"}, {"paperId": "cc5e01873caf3ee3a4a29a5c036ab5ee49315a44", "title": "GPT-DETOX: An In-Context Learning-Based Paraphraser for Text Detoxification"}, {"paperId": "91902c020625060ece719022de28790cebb38f43", "title": "OpenAI ChatGPT: A Potential Medical Application"}, {"paperId": "d17f666085018f19f6ab8253979d0d727af43f00", "title": "Auto MC-Reward: Automated Dense Reward Design with Large Language Models for Minecraft"}, {"paperId": "b1721374889899950994f67029fe899de257c140", "title": "A Foundational Multimodal Vision Language AI Assistant for Human Pathology"}, {"paperId": "378f828f992458cd0b2eb2fd66adb979297534be", "title": "Can LLM find the green circle? Investigation and Human-guided tool manipulation for compositional generalization"}, {"paperId": "1c99cc6568c2038a539f3672b3f951dc16c47c5b", "title": "AnyHome: Open-Vocabulary Generation of Structured and Textured 3D Homes"}, {"paperId": "cd6402234500f37286e52811dbdbfb87b557a437", "title": "Large Scale Foundation Models for Intelligent Manufacturing Applications: A Survey"}, {"paperId": "74b0976a3a7b7013fd468a043a940dcf401e66f1", "title": "User Modeling in the Era of Large Language Models: Current Research and Future Directions"}, {"paperId": "6e8a92479981afec0610414d0501d8ef56c555dc", "title": "NLLG Quarterly arXiv Report 09/23: What are the most influential current AI Papers?"}, {"paperId": "89d3d19ad717cd534bdd1866d28e2da253147705", "title": "EE-LLM: Large-Scale Training and Inference of Early-Exit Large Language Models with 3D Parallelism"}, {"paperId": "89641466373aa9ce2976e3f384b0791a7bd0931c", "title": "Make Them Spill the Beans! Coercive Knowledge Extraction from (Production) LLMs"}, {"paperId": "1862ee09f789e576d011d26c0466473357a26525", "title": "Disease2Vec: Encoding Alzheimer's Progression via Disease Embedding Tree."}, {"paperId": "21fb4ef724de4c101b2335b80c040362f43ffff7", "title": "A Game Agent Design Method in Simulation Training System"}, {"paperId": "60430ba097f6bd7d8d278810cf04d8731c9643e4", "title": "Resume Screening Using Large Language Models"}, {"paperId": "76a592cd03930fc479b03bb7f83c5521e9933953", "title": "Digital Twin Enabled Fault Detection Method for RRAM-Based Neural Computing Systems"}, {"paperId": "205ada2927972cb3156e94247e29d454bf620399", "title": "Towards Knowledge-driven Autonomous Driving"}, {"paperId": "a987c21afbfb3bd746d114e248202c074b1c40ca", "title": "Large Language Models for Mathematicians"}, {"paperId": "bf990b47daddd83bf015b05a707ad0b9d26e317c", "title": "Comprehensive Examination of Instruction-Based Language Models: A Comparative Analysis of Mistral-7B and Llama-2-7B"}, {"paperId": "6b9e1c220af412701f4b5e10638708b15bc4eaaa", "title": "Molecule Joint Auto-Encoding: Trajectory Pretraining with 2D and 3D Diffusion"}, {"paperId": "2cfbb7c05182dec94b84daba57d033e583295e09", "title": "Speculative Exploration on the Concept of Artificial Agents Conducting Autonomous Research"}, {"paperId": "73fc756ea53f70d899f0154fe00ccb123d3bcd86", "title": "Holmes: Towards Distributed Training Across Clusters with Heterogeneous NIC Environment"}, {"paperId": "79aa70e6d8fe1c510572b4f83920e51b26063e0e", "title": "Empowering ChatGPT-Like Large-Scale Language Models with Local Knowledge Base for Industrial Prognostics and Health Management"}, {"paperId": "d4346af837aa6c2bb4a341cfe9bd91862ea5910a", "title": "Large Knowledge Model: Perspectives and Challenges"}, {"paperId": "5ee09fc30efd4b8076d4372db834aaf49087c11c", "title": "Uncertainty-Aware Shared Autonomy System with Hierarchical Conservative Skill Inference"}, {"paperId": "8f3492053904484a6cc76b35e0c3fc4d441563e4", "title": "Towards Measuring Representational Similarity of Large Language Models"}, {"paperId": "67239d6e9c2c5f8a6d19cb35154e5aa7eaa00f51", "title": "Large Language Models on Graphs: A Comprehensive Survey"}, {"paperId": "768f8a29c0e218ffa74347c329079d858177d796", "title": "Low-Resource Efficient Multi-Stage Tuning Strategy for Biomedical Question Answering Task"}, {"paperId": "b17aee79915d56a8a5c2d112a57df2e45230cb95", "title": "Traditional Chinese Medicine Formula Classification Using Large Language Models"}, {"paperId": "adbc7b3e88ed55f0d6616c539922564f638ac313", "title": "Imitating Teaching: An Automated Approach Using Large Language Model"}, {"paperId": "383c598625110e0a4c60da4db10a838ef822fbcf", "title": "A Survey on Large Language Model (LLM) Security and Privacy: The Good, the Bad, and the Ugly"}, {"paperId": "6b41f0256653bc18d956375fb8baeb85174504c9", "title": "Developing a Resource-Constraint EdgeAI model for Surface Defect Detection"}, {"paperId": "7e17ef56273063dfa838de30b7cc0546b2e5ee10", "title": "Jellyfish: A Large Language Model for Data Preprocessing"}, {"paperId": "fb7b538363240bc0be33633d51559795db656c75", "title": "Exploring Large Language Models for Low-Resource IT Information Extraction"}, {"paperId": "e982044cbdd8b6804433bbdf402ee17c7f7fdb82", "title": "IIITH MM2 Speech-Text: A preliminary data for automatic spoken data validation with matched and mismatched speech-text content"}, {"paperId": "7b94ff0673334471c8bc5f319c063a1c8f2be46e", "title": "Fine Tuning of large language Models for Arabic Language"}, {"paperId": "1d8cb727f1b03b2434cce774e0826c19831add08", "title": "Adopting and expanding ethical principles for generative artificial intelligence from military to healthcare"}, {"paperId": "d5688d5154f934b232ddb7f899b31adf8a08fc2b", "title": "Towards a Psychological Generalist AI: A Survey of Current Applications of Large Language Models and Future Prospects"}, {"paperId": "246017780386eba39d6cda760a1c2c70356baa50", "title": "VIoTGPT: Learning to Schedule Vision Tools towards Intelligent Video Internet of Things"}, {"paperId": "6efadffe968bdc199a3a4e6c06a6ce32e011235b", "title": "ESM-NBR: fast and accurate nucleic acid-binding residue prediction via protein language model feature representation and multi-task learning"}, {"paperId": "aa669ba1a22dd54e91fe390d3515f1325e3835fb", "title": "Jubileo: An Immersive Simulation Framework for Social Robot Design"}, {"paperId": "b5fe2af003b5424ec90d1d6e2b1c003dc62a9d95", "title": "Implementasi Sistem Konfigurasi Router Berbasis Natural Language Processing dengan Pendekatan Low Rank Adaptation Finetuning dan 8-Bit Quantization"}, {"paperId": "71e4d3a1df04635dbdf82451813495891a5de453", "title": "Analyzing the Impact of Fake News on the Anticipated Outcome of the 2024 Election Ahead of Time"}, {"paperId": "113e82ab340af5b9721b8ed50b022e3bb769170e", "title": "Large Language Models for Travel Behavior Prediction"}, {"paperId": "80d9aa1cf1caa0f2115cca527a27f197c884b430", "title": "Assisting Static Analysis with Large Language Models: A ChatGPT Experiment"}, {"paperId": "78582ad19779a69d97b797a3c6eb2397f99398b6", "title": "CoDi-2: In-Context, Interleaved, and Interactive Any-to-Any Generation"}, {"paperId": "2afef2f26057a9ebe1c49dfe386cc636f11882d5", "title": "Exploring Large Language Models for Human Mobility Prediction under Public Events"}, {"paperId": "833f5f0d9d271b9b04e742c11a1f3e33bbada3b9", "title": "TaskWeaver: A Code-First Agent Framework"}, {"paperId": "5faa163cbd1651e5325cacba93f6b4d5fbcda6f0", "title": "Biomedical knowledge graph-enhanced prompt generation for large language models"}, {"paperId": "7e9b5dcba69b4f2b00941596e2fb9c2d9ea8daa9", "title": "Large Language Models Meet Computer Vision: A Brief Survey"}, {"paperId": "0a95f7d0165671c922446663d3d4de45ea87ef2e", "title": "LLaFS: When Large-Language Models Meet Few-Shot Segmentation"}, {"paperId": "820d9cbbe5ea492641846d8619bbff993cfeb33e", "title": "CDEval: A Benchmark for Measuring the Cultural Dimensions of Large Language Models"}, {"paperId": "b87e2944fc6e3b1fbc21bdcb923dd0c29d4afa04", "title": "Vulnerability Analysis of Transformer-based Optical Character Recognition to Adversarial Attacks"}, {"paperId": "936f7f0fa77efcd322805b93a8d74c48a4108290", "title": "ChatGPT's One-year Anniversary: Are Open-Source Large Language Models Catching up?"}, {"paperId": "ef7097244ee0cc2d54649e7bec121abf7c628947", "title": "A Survey of the Evolution of Language Model-Based Dialogue Systems"}, {"paperId": "05170ace0befc35e7e84dd8dd21cb3beee99349a", "title": "Comparison of Transformer-based Architectures for Product Categorization"}, {"paperId": "5a1b80a91df91a14d01772aa40e0193ac481533e", "title": "UFIN: Universal Feature Interaction Network for Multi-Domain Click-Through Rate Prediction"}, {"paperId": "b28db25f64a0b7010856334c96881d39b82eea39", "title": "Thai Knowledge-Augmented Language Model Adaptation (ThaiKALA)"}, {"paperId": "4eff164ceb0b80f57c2d0cbd10241799972fa9d0", "title": "Novel Preprocessing Technique for Data Embedding in Engineering Code Generation Using Large Language Model"}, {"paperId": "1146d40d3d01427a008a20530269667b8989750c", "title": "UHGEval: Benchmarking the Hallucination of Chinese Large Language Models via Unconstrained Generation"}, {"paperId": "6a4719871c5d51ad2cd140561652500df06409bd", "title": "Algorithm Evolution Using Large Language Model"}, {"paperId": "d9db1c3cb0364a792530e568cc1e4b06ebb87a0f", "title": "Do You Speak Basquenglish? Assessing Low-Resource Multilingual Proficiency of Pretrained Language Models"}, {"paperId": "337f421a364a6fa8ca423afd627bee2426f69395", "title": "Robot Learning in the Era of Foundation Models: A Survey"}, {"paperId": "eb34bd715e3a7c68477ec0824ebb171b948b80c2", "title": "FinMem: A Performance-Enhanced LLM Trading Agent with Layered Memory and Character Design"}, {"paperId": "7757b3346e6578fabcfbc74754df1354e1d197d8", "title": "Large Language Models in Education: Vision and Opportunities"}, {"paperId": "cf193b5b34178a444cb9bd9f51beb4124b753935", "title": "HalluciDoctor: Mitigating Hallucinatory Toxicity in Visual Instruction Data"}, {"paperId": "31991bcb777d4ee91d38731b83a1d07292c3d09a", "title": "Enhancing Large Language Models’ Utility for Medical Question-Answering: A Patient Health Question Summarization Approach"}, {"paperId": "54630cd92c0c6696a422c3b2aa986c1f75df70b3", "title": "A Survey of Graph Meets Large Language Model: Progress and Future Directions"}, {"paperId": "65b63322cac4f4fd1b2dbc7155be69aed5f95b68", "title": "Towards Natural Language-Guided Drones: GeoText-1652 Benchmark with Spatial Relation Matching"}, {"paperId": "6fa0677731184444df0e1fc8070938419cd6da47", "title": "Igniting Language Intelligence: The Hitchhiker's Guide From Chain-of-Thought Reasoning to Language Agents"}, {"paperId": "91e3906550821c4624146e6e87db36c3296e773a", "title": "Applications of Large Scale Foundation Models for Autonomous Driving"}, {"paperId": "9e5b3d3988da7a294f816c93a09be8f3a84c4ac7", "title": "Which AI Technique Is Better to Classify Requirements? An Experiment with SVM, LSTM, and ChatGPT"}, {"paperId": "b59881bde28d7b759f28f7c492cd5f4a7057dad9", "title": "Boosting the automated Information Processing for Reconnaissance"}, {"paperId": "32f65dd751e5c491d83c2f46e41f50afa1c6d2bb", "title": "Scaling Law of Large Sequential Recommendation Models"}, {"paperId": "67a9dceda7d455393ac162545eac96f56e2e77e6", "title": "Exploring Bias Evaluation Techniques for Quantifying Large Language Model Biases"}, {"paperId": "52e7a50c49daf6d7c6fa147746cec02859ff7827", "title": "Best uses of ChatGPT and Generative AI for computer science research"}, {"paperId": "162ccce80034e470066785d7045d1d585f5d8654", "title": "La inteligencia artificial generativa y la educación universitaria"}, {"paperId": "c1b296b55efe380c8d47a5ad66e1fb04c34e693b", "title": "Long-Term Memory for Large Language Models Through Topic-Based Vector Database"}, {"paperId": "d80fa93d1d72c578ebf73444c3d249ed283d5aba", "title": "Automatic Smart Contract Comment Generation via Large Language Models and In-Context Learning"}, {"paperId": "3793e9bb830cb6961668e4c2fd33cd8d524c6308", "title": "A Survey of Large Language Models for Code: Evolution, Benchmarking, and Future Trends"}, {"paperId": "2ccb4354f456e258e63bc81763537a094018f5ce", "title": "Performance analysis of large language models in the domain of legal argument mining"}, {"paperId": "9d4808cc045c86813be56e29c1b85a484cfd597d", "title": "ML-Bench: Large Language Models Leverage Open-source Libraries for Machine Learning Tasks"}, {"paperId": "a817263affeed3fc11937b8e3e3f3ef7f04680c8", "title": "GO2Sum: Generating Human Readable Functional Summary of Proteins from GO Terms"}, {"paperId": "9d2c9a7c3ff8f760b43fdd6a7082069a467c8956", "title": "Adapting Large Language Models by Integrating Collaborative Semantics for Recommendation"}, {"paperId": "b3b314c2c60049a6006ae2e987e9cc3fafb2114c", "title": "Evaluating LLMs on Document-Based QA: Exact Answer Selection and Numerical Extraction using Cogtale dataset"}, {"paperId": "09425faac0bc2f45207657f28d7cbbbd6347e2bc", "title": "COMET: A Cross-Layer Optimized Optical Phase Change Main Memory Architecture"}, {"paperId": "4ae95f6dcdf5d4e2269869f23b205b358f2b7b17", "title": "AI-native Interconnect Framework for Integration of Large Language Model Technologies in 6G Systems"}, {"paperId": "c48e33add72c9c7d2cf06f151e893460d96f8f05", "title": "Is it indeed bigger better? The comprehensive study of claim detection LMs applied for disinformation tackling"}, {"paperId": "8ec7d50250203543a0098d99f04957b22bbe2c77", "title": "How to Bridge the Gap between Modalities: A Comprehensive Survey on Multimodal Large Language Model"}, {"paperId": "bca0bbd01ea917b7a9fe369288ea3ba03d3b1ff3", "title": "A Survey of Large Language Models in Medicine: Progress, Application, and Challenge"}, {"paperId": "93dacc486b009253566faa16f4ed3fad5f385434", "title": "Leveraging Artificial Intelligence Technology for Mapping Research to Sustainable Development Goals: A Case Study"}, {"paperId": "e51f20efb872d0ba99a8b501259948bbb2f6963f", "title": "Beyond Imitation: Leveraging Fine-grained Quality Signals for Alignment"}, {"paperId": "85e3ef4c2b89b6d40a110683d54bb4eceee2b2b2", "title": "DeepPatent2: A Large-Scale Benchmarking Corpus for Technical Drawing Understanding"}, {"paperId": "bf5b14ee755f2926122cf394b7bf95519a29b56b", "title": "Bridging the Information Gap Between Domain-Specific Model and General LLM for Personalized Recommendation"}, {"paperId": "34cd58ce4da403f75a2b9107d649cf117c9a64ee", "title": "Dissecting the Runtime Performance of the Training, Fine-tuning, and Inference of Large Language Models"}, {"paperId": "99eee47dad469790042b973bc7cb40cb63a660b1", "title": "DeepInception: Hypnotize Large Language Model to Be Jailbreaker"}, {"paperId": "6ae717148e6d7e9024dd440a585e57875f6f26a3", "title": "Zero-shot Bilingual App Reviews Mining with Large Language Models"}, {"paperId": "c0230760f644f6b7538d93e4296a5e9aa7028e45", "title": "Language Models are Super Mario: Absorbing Abilities from Homologous Models as a Free Lunch"}, {"paperId": "a7373e74e384b4bd07a05e2563b4b03ee6af71d5", "title": "Algorithm Skeleton Mining Based on Optimized Pre-training Mechanisms in Survey Paper"}, {"paperId": "f57f0bc066c3083f7058cb94212939fee8195fdf", "title": "Evaluation of Large Scale Language Models on Solving Math Word Problems with Difficulty Grading"}, {"paperId": "6d3dcfa49e02751d8e31eea9d601803da2f854e8", "title": "A Generative AI-based Teaching Material System Using a Human-In-The-Loop Model"}, {"paperId": "45a119463a79e1f18d1234a96174b617a086388b", "title": "Accelerating Reinforcement Learning of Robotic Manipulations via Feedback from Large Language Models"}, {"paperId": "b80a7663585123abc53c10f8aac9bd234eedf063", "title": "DialogBench: Evaluating LLMs as Human-like Dialogue Systems"}, {"paperId": "b74be6891cd7f6d81e346852494c08528dbffdc4", "title": "TCM-GPT: Efficient Pre-training of Large Language Models for Domain Adaptation in Traditional Chinese Medicine"}, {"paperId": "8d2709ed1788a67e64425fb410bb49f3ee49e088", "title": "Large Language Models Illuminate a Progressive Pathway to Artificial Healthcare Assistant: A Review"}, {"paperId": "db34ad9d32fcab6774b8fa2812ef609bb2be0440", "title": "The Potential of Wearable Sensors for Assessing Patient Acuity in Intensive Care Unit (ICU)"}, {"paperId": "3d3f897aef060e726de8eaeab4d205e8908fea66", "title": "An Introduction to Natural Language Processing Techniques and Framework for Clinical Implementation in Radiation Oncology"}, {"paperId": "26a85fdcc1466b13bad874af94d2330b93114ea0", "title": "Comparison of Large Language And Vision Models on Representative Downstream Tasks"}, {"paperId": "6531e6b6b8e43901a804fe3f03dd941c4e781718", "title": "Collaborative Large Language Model for Recommender Systems"}, {"paperId": "5c525592670cf7d62275d7871ae1b2aafca544b2", "title": "Ultra-Efficient On-Device Object Detection on AI-Integrated Smart Glasses with TinyissimoYOLO"}, {"paperId": "990501f48725bf6f8e0a90f215e7426ced576317", "title": "DECENTRALISED AUTONOMOUS SOCIETY THROUGH LARGE LANGUAGE MODELS’ BASED AGENTS: A PATHWAY TO EMPOWER SMALL COMMUNITIES"}, {"paperId": "0b3e7b5cbef627b1ceedceadc5f58787f432163b", "title": "What Makes for Good Visual Instructions? Synthesizing Complex Visual Reasoning Instructions for Visual Instruction Tuning"}, {"paperId": "779145c2dc92553437e8e24ff4db81a3a1d7ea6f", "title": "Using LLMs in Cyber-Physical Systems for Agriculture - ZEMELA"}, {"paperId": "acbb28ffe548d3f87c701c5f9a965bdca474a9a4", "title": "Emotion Detection for Misinformation: A Review"}, {"paperId": "5cd2bf358a36ed729297da8269af5594eb1bb9dd", "title": "Continuous Training and Fine-tuning for Domain-Specific Language Models in Medical Question Answering"}, {"paperId": "1672b010fe8abc50744b92a08bc9148c36aebe35", "title": "Is GPT Powerful Enough to Analyze the Emotions of Memes?"}, {"paperId": "fd206a301c7cd73cb0c829385c37acff005d9ae8", "title": "Efficient Human-AI Coordination via Preparatory Language-based Convention"}, {"paperId": "ed1eba735e9307492ee24efdabadfd399cdbf864", "title": "Metamorphic Malware Evolution: The Potential and Peril of Large Language Models"}, {"paperId": "c0d698950a4560fc2a63acb30a91aa2deb042ed3", "title": "Instructive Decoding: Instruction-Tuned Large Language Models are Self-Refiner from Noisy Instructions"}, {"paperId": "6384921f1bd1059c6b4c37ac3c4e4f19e45d40c1", "title": "Development of meta-prompts for Large Language Models to screen titles and abstracts for diagnostic test accuracy reviews"}, {"paperId": "72883ceab65262f1e38ab1cd4262a326425488f1", "title": "Vanishing Gradients in Reinforcement Finetuning of Language Models"}, {"paperId": "1145c42897cc70b4401b0b52c490c794a09789d8", "title": "A Survey on Knowledge Editing of Neural Networks"}, {"paperId": "f8f9b9e5a1b9dd67fe61bd358f1d90f6cceeb4a1", "title": "Dynamics of Instruction Tuning: Each Ability of Large Language Models Has Its Own Growth Pace"}, {"paperId": "a8fc3745ff459e938c3204c78ac09674ab743fc8", "title": "Transformation vs Tradition: Artificial General Intelligence (AGI) for Arts and Humanities"}, {"paperId": "062c9d24107bbae96003457e82ba0d483bc2a6fb", "title": "Trust, Accountability, and Autonomy in Knowledge Graph-based AI for Self-determination"}, {"paperId": "9426ed538470ad98b881a20fd9725bf8536a674f", "title": "FLIP: Towards Fine-grained Alignment between ID-based Models and Pretrained Language Models for CTR Prediction"}, {"paperId": "598b99c61635797fcbb2e92e4c8ee40545cdbb9b", "title": "Public Perception Towards Intelligent Medical Technologies During and Post COVID-19 Pandemic: Exploring Health Communication in Social Media using Neural Topic Models"}, {"paperId": "daaa7d4ffb9265226e4baadd2db9a01aa7b2f6fb", "title": "Clinical Text Summarization: Adapting Large Language Models Can Outperform Human Experts"}, {"paperId": "1c259361caa85c2d95a7d04e5e42fa98693da85b", "title": "Large Language Models as Evolutionary Optimizers"}, {"paperId": "598a58e655077c48690ba8926ce575fa08411495", "title": "Differentiable Learning of Generalized Structured Matrices for Efficient Deep Neural Networks"}, {"paperId": "20eba77b3ecbb040b8cff2b87c0506f52916c310", "title": "From Indeterminacy to Determinacy: Augmenting Logical Reasoning Capabilities with Large Language Models"}, {"paperId": "8e5d42f5b98146d0784fe85e29c768a4989e1478", "title": "Foundational Models in Medical Imaging: A Comprehensive Survey and Future Vision"}, {"paperId": "7a922abcda328f9333c5a3819ade8917b98f08c9", "title": "Disentangled Representation Learning with Large Language Models for Text-Attributed Graphs"}, {"paperId": "97c4b190949e3cf0273a6f2433e5e4f130507b77", "title": "Edge AI Inference in Heterogeneous Constrained Computing: Feasibility and Opportunities"}, {"paperId": "e28b41dbe2d97c1c6b657665fb998f4c77905311", "title": "Leveraging LLMs for Video Querying"}, {"paperId": "4e0df52a528a28caefe695036b30da27a60b3251", "title": "Overview of an AI-Based Methodology for Design: Case Study of a High Efficiency Electric Vehicle Chassis for the Shell Eco-Marathon"}, {"paperId": "218724f99e35ce70dbfb89f3d262683ee934df40", "title": "Data Optimization in Deep Learning: A Survey"}, {"paperId": "3d297441afbc2124bc805f2a9a4d3db3e21ae217", "title": "Clinfo.ai: An Open-Source Retrieval-Augmented Large Language Model System for Answering Medical Questions using Scientific Literature"}, {"paperId": "ca53c1d1ba1a1386f860fa13d7729160571e1643", "title": "LoRAShear: Efficient Large Language Model Structured Pruning and Knowledge Recovery"}, {"paperId": "31b092d23154d3467d4a92065d77e8b441dfa440", "title": "A Communication Theory Perspective on Prompting Engineering Methods for Large Language Models"}, {"paperId": "980646c7dbd3689177a2fe5c27ffa116f042f4ee", "title": "$Λ$-Split: A Privacy-Preserving Split Computing Framework for Cloud-Powered Generative AI"}, {"paperId": "0b395ed1c8b284e551172b728e83cf257e33729a", "title": "HallusionBench: An Advanced Diagnostic Suite for Entangled Language Hallucination and Visual Illusion in Large Vision-Language Models"}, {"paperId": "ab7bfef234d5a253f83b23722b4d78a9122962d8", "title": "Establishing Vocabulary Tests as a Benchmark for Evaluating Large Language Models"}, {"paperId": "013719cdcc1cbf9861a661210d981a4f8bf24268", "title": "Vision Language Models in Autonomous Driving and Intelligent Transportation Systems"}, {"paperId": "bcdc44ef48ffadbdaa3bd5cacfe9ddb9b9f48750", "title": "Enhancing Zero-Shot Crypto Sentiment With Fine-Tuned Language Model and Prompt Engineering"}, {"paperId": "266a77cd2bb9d4f0cc5fd5b48f64dd38503eb901", "title": "She had Cobalt Blue Eyes: Prompt Testing to Create Aligned and Sustainable Language Models"}, {"paperId": "cb9cf36043c849b890daf7d461746f8c88e7f217", "title": "Exploring the potential of using ChatGPT in physics education"}, {"paperId": "f0b050bc2ba58d154418aaa2644ad29dc0f1f108", "title": "GenDistiller: Distilling Pre-trained Language Models based on Generative Models"}, {"paperId": "49f302e9a76eb39c88fcd861bdd0d954bd3d76b0", "title": "Large Language Model for Multi-objective Evolutionary Optimization"}, {"paperId": "d628f3c65e0c8c3024d9ff0678d44383fc9fe27c", "title": "An Exploration of In-Context Learning for Speech Language Model"}, {"paperId": "bae91df48c9107147042e55573c055360923e1df", "title": "A Comprehensive Survey on Vector Database: Storage and Retrieval Technique, Challenge"}, {"paperId": "7c93bc4173c9b4d2a71866e8189c8e35cdb00b34", "title": "Large Language Models for Code Analysis: Do LLMs Really Do Their Job?"}, {"paperId": "b03d107ef4570589d84e3d3baeee56462989e06d", "title": "InferDPT: Privacy-Preserving Inference for Black-box Large Language Model"}, {"paperId": "b3474a0bfddd48d46abe2214f42e660b569cc4aa", "title": "FactCHD: Benchmarking Fact-Conflicting Hallucination Detection"}, {"paperId": "66d927fdb6c2774131960c75275546fd5ee3dd72", "title": "EvalCrafter: Benchmarking and Evaluating Large Video Generation Models"}, {"paperId": "f496b16deb9e6d233166c7ab7b1e95b9342eb579", "title": "Leveraging Large Language Model for Automatic Evolving of Industrial Data-Centric R&D Cycle"}, {"paperId": "4c50763846e82da2729e96d6b4a7ec3538d8641d", "title": "Enhanced Transformer Architecture for Natural Language Processing"}, {"paperId": "4c86f91116483d946bde77684aa10844f932d5f5", "title": "DialogueLLM: Context and Emotion Knowledge-Tuned LLaMA Models for Emotion Recognition in Conversations"}, {"paperId": "5b038c1a93967072cc76689fd805e756f804cc42", "title": "Large Models for Time Series and Spatio-Temporal Data: A Survey and Outlook"}, {"paperId": "777d4ec0148c34b0bfab91e9ac3a902e420b891e", "title": "Verbosity Bias in Preference Labeling by Large Language Models"}, {"paperId": "a1cdae1444507912841305bc2fea2faa3b518f63", "title": "Prompt Packer: Deceiving LLMs through Compositional Instruction with Hidden Attacks"}, {"paperId": "208b93a39802466785169494caa7f2a8995ea39f", "title": "Large Language Model-Empowered Agents for Simulating Macroeconomic Activities"}, {"paperId": "d3f8d5a9c48ee9f338f25f1be5f3adc7fd5dd855", "title": "ReMax: A Simple, Effective, and Efficient Reinforcement Learning Method for Aligning Large Language Models"}, {"paperId": "6e9a5af235cfd2167f02be825138ef73af0f400d", "title": "Neural Rankers for Code Generation via Inter-Cluster Modeling"}, {"paperId": "6f02818376fd1dccd5ffa34e489e5cd2edd436a1", "title": "How Good is ChatGPT in Giving Advice on Your Visualization Design?"}, {"paperId": "9a73effed8775962c86587feb0f9ef841fa2ff4c", "title": "LgTS: Dynamic Task Sampling using LLM-generated sub-goals for Reinforcement Learning Agents"}, {"paperId": "a80546c9847710af1ba8d5f8dca9386e7a520d0a", "title": "Precedent-Enhanced Legal Judgment Prediction with LLM and Domain-Model Collaboration"}, {"paperId": "4941b37136cdf1836b78ddb6cee65a28c3ce45f0", "title": "ChatKBQA: A Generate-then-Retrieve Framework for Knowledge Base Question Answering with Fine-tuned Large Language Models"}, {"paperId": "44576a2c6337f41019f29b055d8c7f7f5891be92", "title": "AgentCF: Collaborative Learning with Autonomous Language Agents for Recommender Systems"}, {"paperId": "13f62693ab4483566dca1d818d0122a7b08eef98", "title": "A ML-LLM pairing for better code comment classification"}, {"paperId": "c3af18fbc0ed47f07f1bbae075aa97bbc08b89e8", "title": "Found in the Middle: Permutation Self-Consistency Improves Listwise Ranking in Large Language Models"}, {"paperId": "a531e9a328ad1488567fa68c15d5bf30bfb90c78", "title": "Fine-Tuning LLaMA for Multi-Stage Text Retrieval"}, {"paperId": "203a297db586ffb4cd858fe5f219a9a1571c87b2", "title": "A Confederacy of Models: a Comprehensive Evaluation of LLMs on Creative Writing"}, {"paperId": "e8d513bc7554a83161f2fb26c8299b471581cdb6", "title": "Can We Edit Multimodal Large Language Models?"}, {"paperId": "59426669b28c27b092cb5b89560c81d267c45a91", "title": "How to Detect AI-Generated Texts?"}, {"paperId": "f7d3172010a9cb198e335c5d38da5b5acf82e0d3", "title": "QFT: Quantized Full-parameter Tuning of LLMs with Affordable Resources"}, {"paperId": "34ca51ce10e8d1d6c950ba519329714a0184d004", "title": "KwaiYiiMath: Technical Report"}, {"paperId": "6487ec82f6d8082a5b402a5416ea03009acb1679", "title": "State of the Art on Diffusion Models for Visual Computing"}, {"paperId": "d8d6f39e7d4a59ceee31d9c98a152b26a8d5c137", "title": "An HCI-Centric Survey and Taxonomy of Human-Generative-AI Interactions"}, {"paperId": "ae8aabebad0c3ecae165ec05c18a2072ed360d1e", "title": "NEWTON: Are Large Language Models Capable of Physical Reasoning?"}, {"paperId": "03fab98a9be74a253688840dba9144737a8ca92d", "title": "Survey on Factuality in Large Language Models: Knowledge, Retrieval and Domain-Specificity"}, {"paperId": "1f0679187ca2822e231af66b8b8e82ecb892e24f", "title": "Uncertainty-based Active Learning with Ensemble Technique for Enhancing the Performance of Natural Language Classification with Limited Data"}, {"paperId": "19264b64d1cf572c33309236d3e24d8861ef25b9", "title": "Language-Model-based methods for Vietnamese Single-Document Extractive Summarization"}, {"paperId": "d35e2ea704c7a1ba690cb1806891fcd6b84065ee", "title": "GeoLLM: Extracting Geospatial Knowledge from Large Language Models"}, {"paperId": "582c2f270a6c0ce89679eebaa78797711fa20293", "title": "Making Large Language Models Perform Better in Knowledge Graph Completion"}, {"paperId": "92b48adfddd6177618c4f7451c8ea593a794a1a1", "title": "CoT3DRef: Chain-of-Thoughts Data-Efficient 3D Visual Grounding"}, {"paperId": "ec052c39f5c82760a7a099e0d95ecf69fb0ea974", "title": "BC4LLM: Trusted Artificial Intelligence When Blockchain Meets Large Language Models"}, {"paperId": "57eddf6eff27193984314141d04c333c11532fc6", "title": "CodeFuse-13B: A Pretrained Multi-lingual Code Large Language Model"}, {"paperId": "c59b23ee87ba01942a7bab79728f85e66ba34ec7", "title": "Glitter or Gold? Deriving Structured Insights from Sustainability Reports via Large Language Models"}, {"paperId": "c7492913370b5726eaa6ced163a60de6c9d4bb7f", "title": "A Survey of Large Language Models for Healthcare: from Data, Technology, and Applications to Accountability and Ethics"}, {"paperId": "a00dc9750bca4ddaed171866ce696b5da1fe4cbd", "title": "GPT-who: An Information Density-based Machine-Generated Text Detector"}, {"paperId": "833677f4b048e116920ad041248b9df5223951f9", "title": "ChatRadio-Valuer: A Chat Large Language Model for Generalizable Radiology Report Generation Based on Multi-institution and Multi-system Data"}, {"paperId": "cef2e06efd484520808dfbeeee2029c4d06bd799", "title": "Compresso: Structured Pruning with Collaborative Prompting Learns Compact Large Language Models"}, {"paperId": "12a4c41b087629548b07d0dadb9da05147fa4f81", "title": "Towards Better Chain-of-Thought Prompting Strategies: A Survey"}, {"paperId": "b91bcadc6227f7d61e406bb6957850231733442e", "title": "Factuality Challenges in the Era of Large Language Models"}, {"paperId": "be9447ccc05a0e8a07321272778c7574173cf00e", "title": "Resprompt: Residual Connection Prompting Advances Multi-Step Reasoning in Large Language Models"}, {"paperId": "10145a22ebfee898be909ad44f83bd3c490adb53", "title": "Balancing Specialized and General Skills in LLMs: The Impact of Modern Tuning and Data Strategy"}, {"paperId": "9c7af6cef69c3417c4f57627332b1256f53c231a", "title": "Tree-GPT: Modular Large Language Model Expert System for Forest Remote Sensing Image Understanding and Interactive Analysis"}, {"paperId": "4ae7c4decd1df71c466f19d66d69b555945098c4", "title": "Beyond Text: A Deep Dive into Large Language Models' Ability on Understanding Graph Data"}, {"paperId": "0efc09978d45bfd35cb6ef60ac88d11a443ba2e1", "title": "Large Language Models for Spatial Trajectory Patterns Mining"}, {"paperId": "603079ee89aafb0b0466c4089ef1edf678e47871", "title": "Language Model-Based Player Goal Recognition in Open World Digital Games"}, {"paperId": "1b860394dfec26d9c350889006e37fe56731f77e", "title": "Enhancing Financial Sentiment Analysis via Retrieval Augmented Large Language Models"}, {"paperId": "9283b8c7e6ad6ae86be059a26595de0d7a427a10", "title": "Talk like a Graph: Encoding Graphs for Large Language Models"}, {"paperId": "a08c4914a86b097eeec6322d097ef5b03ba4d891", "title": "Model Compression in Practice: Lessons Learned from Practitioners Creating On-device Machine Learning Experiences"}, {"paperId": "390342245563699a88bd5b8f4093e2c0e199b0c2", "title": "Keyword Augmented Retrieval: Novel framework for Information Retrieval integrated with speech interface"}, {"paperId": "3784fd84b61d482b52f7ef72aac66bcb886b892b", "title": "Thought Propagation: An Analogical Approach to Complex Reasoning with Large Language Models"}, {"paperId": "6d828a7aace632477c5d89c1d4e2182645030b85", "title": "Balancing Autonomy and Alignment: A Multi-Dimensional Taxonomy for Autonomous LLM-powered Multi-Agent Architectures"}, {"paperId": "f8fa697302ef9d759b72404f5a8aa918865abdf4", "title": "A New Dialogue Response Generation Agent for Large Language Models by Asking Questions to Detect User's Intentions"}, {"paperId": "30669080bc6652f0466fba618b7c59317a346fb2", "title": "A Formalism and Approach for Improving Robustness of Large Language Models Using Risk-Adjusted Confidence Scores"}, {"paperId": "a05e9daa01ffb66083c476eab0dc8036b7dabea3", "title": "UniPredict: Large Language Models are Universal Tabular Classifiers"}, {"paperId": "635cfc277ef634c37db5c6b15793c5b303b5a9ff", "title": "Talking Models: Distill Pre-trained Knowledge to Downstream Models via Interactive Communication"}, {"paperId": "68d0efd292d56289136a8717ca92e4db0fed978a", "title": "Stochastic Thermodynamics of Learning Generative Parametric Probabilistic Models"}, {"paperId": "9fcdbfdf28245010c875ce85502351fe05c04b49", "title": "Exploring Collaboration Mechanisms for LLM Agents: A Social Psychology View"}, {"paperId": "d6354e91d8dcf73bff50097b76a81de874f7bd7a", "title": "OceanGPT: A Large Language Model for Ocean Science Tasks"}, {"paperId": "a8aef5a15dc2b486b3bf01205d2687a1140a41bb", "title": "Conversational Health Agents: A Personalized LLM-Powered Agent Framework"}, {"paperId": "2dceb28ed6eda0fe1fc24e00502ab004920a8628", "title": "Large language models in radiology: fundamentals, applications, ethical considerations, risks, and future directions"}, {"paperId": "1eb71a48256b3c5f5d8f7f39efbaa1b692b49860", "title": "Use Your INSTINCT: INSTruction optimization usIng Neural bandits Coupled with Transformers"}, {"paperId": "4e97b8bf4ecaacb6b8524b21b0b215c8ded1d6fe", "title": "Towards human-like spoken dialogue generation between AI agents from written dialogue"}, {"paperId": "208a08e7df7ed5f951d1ffddf0e038bb1429aa9f", "title": "Large Language Model-Powered Smart Contract Vulnerability Detection: New Perspectives"}, {"paperId": "811f451f1991ec5508e67d00375ca4f5d05e0eeb", "title": "TRAM: Benchmarking Temporal Reasoning for Large Language Models"}, {"paperId": "e1dafedfbb55cd2200411841c2ec40e7ea827773", "title": "SPELL: Semantic Prompt Evolution based on a LLM"}, {"paperId": "c4d3b9a87295db0b9f6466b7f3ce2f175c6d3157", "title": "GrowLength: Accelerating LLMs Pretraining by Progressively Growing Training Length"}, {"paperId": "93caac295ecf4f2d4f373903f4af224bbfe8b50a", "title": "Model-Driven Prompt Engineering"}, {"paperId": "b6b49a667dd268782150d2af60c73324a7d78aac", "title": "Automated Domain Modeling with Large Language Models: A Comparative Study"}, {"paperId": "d66a705285fd21fab2197b594e0e2f87db071308", "title": "You Augment Me: Exploring ChatGPT-based Data Augmentation for Semantic Code Search"}, {"paperId": "bfeda6c7aa7899a80adb01894555b09d24756a59", "title": "Corex: Pushing the Boundaries of Complex Reasoning through Multi-Model Collaboration"}, {"paperId": "e61a96cf602ebff6683929aaf916e25614a475bc", "title": "UPAR: A Kantian-Inspired Prompting Framework for Enhancing Large Language Model Capabilities"}, {"paperId": "6d122357d5d94f88a65f6d8bf83a95ec4869a12d", "title": "DEVELOPMENT OF A QUESTION ANSWERING CHATBOT FOR BLOCKCHAIN DOMAIN"}, {"paperId": "000cc7bff1a286193286f095f1668eacedbefc1a", "title": "LatticeGen: A Cooperative Framework which Hides Generated Text in a Lattice for Privacy-Aware Generation on Cloud"}, {"paperId": "7817d4dbe7f85f77b6ce6719ab5f6e2423e5724e", "title": "The Confidence-Competence Gap in Large Language Models: A Cognitive Study"}, {"paperId": "3cbfe152220de84ecf8059fa50c47587a3134c86", "title": "DiLu: A Knowledge-Driven Approach to Autonomous Driving with Large Language Models"}, {"paperId": "9a4e4ab77c3d836bab35e0578de68e8ce79af1e8", "title": "Graph Neural Prompting with Large Language Models"}, {"paperId": "11a4284e335ba39330b59d9f42ca3272a6166991", "title": "A Survey of Chain of Thought Reasoning: Advances, Frontiers and Future"}, {"paperId": "128217c0d1e99912ebc727c84686cc97a913b55f", "title": "Deep Model Fusion: A Survey"}, {"paperId": "662f6eb7579a5e27f385023596becc9c21b0ad96", "title": "When Prolog meets generative models: a new approach for managing knowledge and planning in robotic applications"}, {"paperId": "945db0077b6d19b720f5998b3f61300013c4f885", "title": "QA-LoRA: Quantization-Aware Low-Rank Adaptation of Large Language Models"}, {"paperId": "2299541d6bb3242f5c56c6dea798c5e581a817d1", "title": "PLMM: Personal Large Models on Mobile Devices"}, {"paperId": "fc709c4e746f5fef146c19a8ac7873db26a57d74", "title": "General purpose large language models match human performance on gastroenterology board exam self-assessments."}, {"paperId": "6f75e8b61f13562237851d8119cb2f9d49e073fb", "title": "Can LLM-Generated Misinformation Be Detected?"}, {"paperId": "fa4ea8b773ffd6706ba5cf427f9671f81b04dcdd", "title": "ALLURE: Auditing and Improving LLM-based Evaluation of Text using Iterative In-Context-Learning"}, {"paperId": "42d83576ee920c1b6df318e212047d9ba57fc4fd", "title": "BAMBOO: A Comprehensive Benchmark for Evaluating Long Text Modeling Capacities of Large Language Models"}, {"paperId": "a0012cf12186fde248dde4cccdccb74e83624ac3", "title": "From Text to Source: Results in Detecting Large Language Model-Generated Content"}, {"paperId": "476de9654c840a080276c4b8b5dadfdbe25c663f", "title": "Construction contract risk identification based on knowledge-augmented language model"}, {"paperId": "623a0a4b975452d64d610e28f48822ca500ed93f", "title": "Bad Actor, Good Advisor: Exploring the Role of Large Language Models in Fake News Detection"}, {"paperId": "8d1211cbbdf161feaae2c87832ede063346e76dd", "title": "Foundation metrics for evaluating effectiveness of healthcare conversations powered by generative AI"}, {"paperId": "a3c4d01fb505fe3c5be4f6b3da6a65d94f2bccc0", "title": "LLMR: Real-time Prompting of Interactive Worlds using Large Language Models"}, {"paperId": "d651380f8c99f2522ead2d86d60cb4af4413abfa", "title": "How understanding large language models can inform the use of ChatGPT in physics education"}, {"paperId": "50b09d1ea319bbd66256a0b5ce502da6c8f2e0e0", "title": "ChaCha: Leveraging Large Language Models to Prompt Children to Share Their Emotions about Personal Events"}, {"paperId": "6d3f1d31ff46e8e1bab7821bc98366ce46157c3c", "title": "JobRecoGPT - Explainable job recommendations using LLMs"}, {"paperId": "949876067df8878cfda9005646cddc5d1dc7e95a", "title": "Ensemble Neural Networks for Remaining Useful Life (RUL) Prediction"}, {"paperId": "29f032fc875576b5c3c6b1c2d76af8639bacfb88", "title": "OpenChat: Advancing Open-source Language Models with Mixed-Quality Data"}, {"paperId": "048ed2240412b684ff88ddf6aac7152d04e5d233", "title": "CPLLM: Clinical Prediction with Large Language Models"}, {"paperId": "77b046c5d568b329a927cfc895ea2e6c8f43ff43", "title": "The Languini Kitchen: Enabling Language Modelling Research at Different Scales of Compute"}, {"paperId": "c17c3c31e104e04a2f33f87d1a38909082df81c9", "title": "Prompt engineering of GPT-4 for chemical research: what can/cannot be done?"}, {"paperId": "437a386f3fe4b8c7449a37e2364412a26e0a478c", "title": "PolicyGPT: Automated Analysis of Privacy Policies with Large Language Models"}, {"paperId": "ab2066233ea2da540f44118d989d66db5687752a", "title": "Model Leeching: An Extraction Attack Targeting LLMs"}, {"paperId": "880aa839e9275808573f221988944323bf40ddab", "title": "Bias and Fairness in Chatbots: An Overview"}, {"paperId": "70ae98c70c0235acf3c3af14ea7286c81da1febe", "title": "Cross-Lingual Knowledge Editing in Large Language Models"}, {"paperId": "e54c34d1d4b108a85c11bc68251cf2f215d953e7", "title": "An Unified Search and Recommendation Foundation Model for Cold-Start Scenario"}, {"paperId": "18c9254c33ca17e5e29bd7b5830e6754f5bd1061", "title": "Exploration of TPUs for AI Applications"}, {"paperId": "b0cdedc2d44f3bf44b7dd4dd20deb75f96d5666a", "title": "RADE: Reference-Assisted Dialogue Evaluation for Open-Domain Dialogue"}, {"paperId": "1f8d74abcb89ee21bf01e7133cea503d8c99fef7", "title": "Using Large Language Model to Solve and Explain Physics Word Problems Approaching Human Level"}, {"paperId": "96df3d9c34a2d6c489a0b94c12ae19466bb2ad94", "title": "A LLM-Based Simulation Scenario Aided Generation Method"}, {"paperId": "a517575328ca3b8289fa95bd9f71669e1cf7127a", "title": "SIB-200: A Simple, Inclusive, and Big Evaluation Dataset for Topic Classification in 200+ Languages and Dialects"}, {"paperId": "007c3d9b8dab341d2c77c4ee764fd921f7f14956", "title": "Adapted large language models can outperform medical experts in clinical text summarization."}, {"paperId": "7adc93b4e1423fbe092e5ded2b932d27b376f8c7", "title": "An Interactive Framework for Profiling News Media Sources"}, {"paperId": "9c8f579c61ae6d16dcaa4e9259f69b90872ad665", "title": "Zero-shot Audio Topic Reranking using Large Language Models"}, {"paperId": "eae34c019fd08d5b2df25dd3d21149eaf67c6183", "title": "ChatGPT v Bard v Bing v Claude 2 v Aria v human-expert. How good are AI chatbots at scientific writing? (ver. 23Q3)"}, {"paperId": "9eb0d566bc397f004ac424015ea7f288939e5eaa", "title": "The concept of a set in the theory and practice of designing"}, {"paperId": "9b9a4fa3ed510fc6eb1bf831979235f3d9f8b556", "title": "SafetyBench: Evaluating the Safety of Large Language Models with Multiple Choice Questions"}, {"paperId": "28ab73ed3ce07649ff6836a30fdb0fffe7c4fff2", "title": "Grounded Language Acquisition From Object and Action Imagery"}, {"paperId": "02838f3cd9c7bbb679968ba593699f920ef2f4fc", "title": "Balanced and Explainable Social Media Analysis for Public Health with Large Language Models"}, {"paperId": "5e060f23914aff74d8c7b6973df44e5af8d97db5", "title": "Quantifying and Attributing the Hallucination of Large Language Models via Association Analysis"}, {"paperId": "9eab12f70b9145f4fb3c5acd803ee479529f6d78", "title": "From Capture to Display: A Survey on Volumetric Video"}, {"paperId": "31abed8ed8b4308556d1708163e519f694701495", "title": "ACIGS: An automated large-scale crops image generation system based on large visual language multi-modal models"}, {"paperId": "f1847504a4895a3d31c31e7464e5b34d9eda8ef8", "title": "A Closer Look at Different Difficulty Levels Code Generation Abilities of ChatGPT"}, {"paperId": "36ad72488276cdf4d308cdd433a293445d2b3913", "title": "Code-Style In-Context Learning for Knowledge-Based Question Answering"}, {"paperId": "5a9d4bcffa9989cac4139b2844358884ae023e8d", "title": "SayNav: Grounding Large Language Models for Dynamic Planning to Navigation in New Environments"}, {"paperId": "5373b37890628ae177430eeb05272fee83a5ffaf", "title": "Matching Table Metadata with Business Glossaries Using Large Language Models"}, {"paperId": "f8afa4bd5b05f52ffa304f56aed7a5792a42ef1f", "title": "FLM-101B: An Open LLM and How to Train It with $100K Budget"}, {"paperId": "1608bcaa1cfd6c42286e9b3c0ccf6999accb554b", "title": "Supervised Learning and Large Language Model Benchmarks on Mental Health Datasets: Cognitive Distortions and Suicidal Risks in Chinese Social Media"}, {"paperId": "1c9566ea496c2407877452ef0ea2606da44c8925", "title": "Enhancing Pipeline-Based Conversational Agents with Large Language Models"}, {"paperId": "cf5c3f5264ecf571a2d6a82dc330d46c7ea40386", "title": "Enforcement of Web3 Security by Use Blockchain and LLMs"}, {"paperId": "ca2f5a4599c978a6cb6bc3242faf0037d0d981fc", "title": "Effects of Generative Chatbots in Higher Education"}, {"paperId": "8cabc3453c7bdd406e39bcb7967f919548d62f53", "title": "Innovative approaches to high school physics competitions: Harnessing the power of AI and open science"}, {"paperId": "b118deb1e0715a5aeec11e399321501ba09ce2c4", "title": "HAE-RAE Bench: Evaluation of Korean Knowledge in Language Models"}, {"paperId": "fa8bfc870c8708360110111ce438d2a9ea33a177", "title": "The Smart Applications of ICT and IoT with AI Techniques in IMS Network"}, {"paperId": "bb0213486ad87faad220b7c35caed913bcd73744", "title": "Gradient Domain Diffusion Models for Image Synthesis"}, {"paperId": "788477fadc464576ae1b059785245c9581e4e13f", "title": "Data-Juicer: A One-Stop Data Processing System for Large Language Models"}, {"paperId": "25cb1f71324527c8ceb946235074976374119387", "title": "Information Processing by Neuron Populations in the Central Nervous System: Mathematical Structure of Data and Operations"}, {"paperId": "44d9ae29a5639deb5ac76c294593903b5e0abf1a", "title": "Analyzing the Use of Large Language Models for Content Moderation with ChatGPT Examples"}, {"paperId": "18664b47516ba5424ba5efa79d3f816224245325", "title": "ChatRule: Mining Logical Rules with Large Language Models for Knowledge Graph Reasoning"}, {"paperId": "2bd0865829ed7fa36364331471933735fbcdbecb", "title": "Exploring the effectiveness of ChatGPT-based feedback compared with teacher feedback and self-feedback: Evidence from Chinese to English translation"}, {"paperId": "dcf2e723ee9c3270c98ff768b139cca75d29242e", "title": "A Study on the Implementation of Generative AI Services Using an Enterprise Data-Based LLM Application Architecture"}, {"paperId": "fa8ad38863ae7b96570e91a05d7fdf5e6d768c0c", "title": "RenAIssance: A Survey into AI Text-to-Image Generation in the Era of Large Model"}, {"paperId": "529ff7d6441d244212cf2becafd12a7e67ac56d9", "title": "FederatedScope-LLM: A Comprehensive Package for Fine-tuning Large Language Models in Federated Learning"}, {"paperId": "c12db2e67d1fb289266faa5507ff112c9a062465", "title": "Efficient RLHF: Reducing the Memory Usage of PPO"}, {"paperId": "3cc896b9a9c4951510b6b9f28be930d65b24d29f", "title": "A Comprehensive Survey of ChatGPT: Advancements, Applications, Prospects, and Challenges."}, {"paperId": "2ccdfdbf3bb408a1c74dde2dbb2cf8492b3591db", "title": "Large language models in medicine: the potentials and pitfalls"}, {"paperId": "bf0008d1b521be0c96bb34e8de78dd404ad37099", "title": "Interactively Robot Action Planning with Uncertainty Analysis and Active Questioning by Large Language Model"}, {"paperId": "502a0cc0545afc7b15cbdcc0e2fa07a714979241", "title": "Is the U.S. Legal System Ready for AI's Challenges to Human Values?"}, {"paperId": "b24488203f61e413fe2497957a33780e149b6feb", "title": "WALL-E: Embodied Robotic WAiter Load Lifting with Large Language Model"}, {"paperId": "ca9f41ad1c3f0ed51781eef6cfcd035bf4d01d1a", "title": "A Survey on Multi-Behavior Sequential Recommendation"}, {"paperId": "dac93a9fa08dca3863c8c4e716b84f46f9a019d9", "title": "AI-powered Fraud Detection in Decentralized Finance: A Project Life Cycle Perspective"}, {"paperId": "3e1ca026052d30e3b9677e363616fae23f6616df", "title": "Large Language Models as Data Preprocessors"}, {"paperId": "e034b664362640cc88dfa5e2e11c0524fc7cb323", "title": "Text-to-SQL Empowered by Large Language Models: A Benchmark Evaluation"}, {"paperId": "412fe1f135cb20c952962133ca1e534a71bfd27f", "title": "When Do Program-of-Thoughts Work for Reasoning?"}, {"paperId": "d240186d5d401cef977f21ba1db4617924c4d225", "title": "Enhancing Psychological Counseling with Large Language Model: A Multifaceted Decision-Support System for Non-Professionals"}, {"paperId": "f4eea3bda63af47bd6ddc0b5a34ab04c558f0da2", "title": "Where Would I Go Next? Large Language Models as Human Mobility Predictors"}, {"paperId": "9397d56e35b1597e62af5d4fa773e4dacf3c20f9", "title": "STEAM: Simulating the InTeractive BEhavior of ProgrAMmers for Automatic Bug Fixing"}, {"paperId": "19b43ff57e5d8f8a99da4110fbc30b4ecc39a527", "title": "Spoken Language Intelligence of Large Language Models for Language Learning"}, {"paperId": "4c5b4a8e31d3119c1e3b5753693ff283c9717218", "title": "DISC-MedLLM: Bridging General Large Language Models and Real-World Medical Consultation"}, {"paperId": "a120124389a829cc31126865135a0e4d9e1f188d", "title": "MedAlign: A Clinician-Generated Dataset for Instruction Following with Electronic Medical Records"}, {"paperId": "894ed1aba8e42a4ec27ba53ecde383b14c5128ca", "title": "Examining User-Friendly and Open-Sourced Large GPT Models: A Survey on Language, Multimodal, and Scientific GPT Models"}, {"paperId": "dc688bda050d568a3771d2c2d11d5e1fd8912560", "title": "MM-AU:Towards Multimodal Understanding of Advertisement Videos"}, {"paperId": "450c65dce00b05bdf5d58e48289acd066aca8383", "title": "Exploring Large Language Models for Knowledge Graph Completion"}, {"paperId": "afee8cdc51e95b50d7574ed1700a797874bf792c", "title": "Adversarial Fine-Tuning of Language Models: An Iterative Optimisation Approach for the Generation and Detection of Problematic Content"}, {"paperId": "628b131f8f309d583ccf1da268f520c051169ddd", "title": "Journey to the Center of the Knowledge Neurons: Discoveries of Language-Independent Knowledge Neurons and Degenerate Knowledge Neurons"}, {"paperId": "7ee2841cced52dc38d5f334d1939c205c1cad716", "title": "SoTaNa: The Open-Source Software Development Assistant"}, {"paperId": "374ebdc8240a35820cb7ab8bfca37e180e21b605", "title": "Sparks of Large Audio Models: A Survey and Outlook"}, {"paperId": "c399a78321c2b0900d903eead65c683e0e451ad5", "title": "Can Linguistic Knowledge Improve Multimodal Alignment in Vision-Language Pretraining?"}, {"paperId": "92221598758165d1679c8c9792435bb5a9a547a0", "title": "Improving Translation Faithfulness of Large Language Models via Augmenting Instructions"}, {"paperId": "4b091d92f793161046b483ee93df244bf93bb508", "title": "Large Language Models Vote: Prompting for Rare Disease Identification"}, {"paperId": "f53a4f34757d1f237446b4d887d5323f2a17ed02", "title": "PREFER: Prompt Ensemble Learning via Feedback-Reflect-Refine"}, {"paperId": "fe583403c95c3e9b4148d6276f04bda5ace33660", "title": "Prompt-Based Length Controlled Generation with Reinforcement Learning"}, {"paperId": "04dd492b506e48b7dd91ecb1e1fdb80c1ce30e34", "title": "Towards CausalGPT: A Multi-Agent Approach for Faithful Knowledge Reasoning via Promoting Causal Consistency in LLMs"}, {"paperId": "6634e56c1046f3d16eaadecac45d5576d93eee83", "title": "Benchmarking Causal Study to Interpret Large Language Models for Source Code"}, {"paperId": "28c6ac721f54544162865f41c5692e70d61bccab", "title": "A Survey on Large Language Model based Autonomous Agents"}, {"paperId": "d955956378b40b23fa4b34098662c54a3b1fd64d", "title": "LLaMA-Reviewer: Advancing Code Review Automation with Large Language Models through Parameter-Efficient Fine-Tuning"}, {"paperId": "7f1bfaa0ffd9f552750a86455117757a303648d7", "title": "MISSRec: Pre-training and Transferring Multi-modal Interest-aware Sequence Representation for Recommendation"}, {"paperId": "62f559604c2869bd97d4bdc6c64645e8518c207c", "title": "On the Opportunities and Challenges of Offline Reinforcement Learning for Recommender Systems"}, {"paperId": "53e8d327e7ceda6f4efd321752da57edbaee6257", "title": "ROSGPT_Vision: Commanding Robots Using Only Language Models' Prompts"}, {"paperId": "927fc7652e033c9eb17296df087e3e6491112bb0", "title": "Evaluating Large Language Models on Graphs: Performance Insights and Comparative Analysis"}, {"paperId": "8cf37154fc183d16e4c17c86309855248662b709", "title": "SeqGPT: An Out-of-the-box Large Language Model for Open Domain Sequence Understanding"}, {"paperId": "000f964393dafe113a8e66734d63b2a145844159", "title": "Large Language Models for Software Engineering: A Systematic Literature Review"}, {"paperId": "d6cc1ac6f0dbd1918c40a885de067f397fefbb55", "title": "Incorprating Prompt tuning for Commit classification with prior Knowledge"}, {"paperId": "bc70af9248d210663edf22e5fc84ca9313c697b0", "title": "Zero- and Few-Shot Prompting with LLMs: A Comparative Study with Fine-tuned Models for Bangla Sentiment Analysis"}, {"paperId": "194e8cb8f2b4673d467c01d010afba31551cb0da", "title": "LatEval: An Interactive LLMs Evaluation Benchmark with Incomplete Information from Lateral Thinking Puzzles"}, {"paperId": "3fecb6df989c51592cb1a1a737f259c5e3b0eab1", "title": "Refashioning Emotion Recognition Modelling: The Advent of Generalised Large Models"}, {"paperId": "178ae4de14773efc1fe57e415c22938cb800f0e8", "title": "Hiding Backdoors within Event Sequence Data via Poisoning Attacks"}, {"paperId": "ab3f7615d9ed62483f98048b62ba1e4cbf0fada2", "title": "ControlRetriever: Harnessing the Power of Instructions for Controllable Retrieval"}, {"paperId": "b79f039c5ea5916d8e70b98e722de4ae1bc8fa05", "title": "Eva-KELLM: A New Benchmark for Evaluating Knowledge Editing of LLMs"}, {"paperId": "79395f4ef32b925381f7ec9a824b05bdb982fd33", "title": "Large Language Models as Zero-Shot Conversational Recommenders"}, {"paperId": "3ac3c10e1317fe8419f794cf30ce3227e95e1f54", "title": "Causal Intersectionality and Dual Form of Gradient Descent for Multimodal Analysis: a Case Study on Hateful Memes"}, {"paperId": "9f859726b3d8dffd96a1f55de4122617751cc1b4", "title": "Red-Teaming Large Language Models using Chain of Utterances for Safety-Alignment"}, {"paperId": "697f1f6db1e436a1e635f586131419582463507e", "title": "Document Automation Architectures: Updated Survey in Light of Large Language Models"}, {"paperId": "a0bd270f0fe82eeac7f6efad4b1a52ffa052f63b", "title": "Variational optimization of the amplitude of neural-network quantum many-body ground states"}, {"paperId": "d5bf55f810cf66d3e70155bca12420d38d0601ad", "title": "Scope is all you need: Transforming LLMs for HPC Code"}, {"paperId": "cc01b647e31fbbd308e9e57884d9b07b4f582702", "title": "Enhancing Reasoning Capabilities of Large Language Models: A Graph-Based Verification Approach"}, {"paperId": "f6d62a720a499e5d527357cd39a32e85b0afaa6d", "title": "How susceptible are LLMs to Logical Fallacies?"}, {"paperId": "a95ee02fd85a3734bf19bb4bbc6ef3ea22c96cc9", "title": "PMET: Precise Model Editing in a Transformer"}, {"paperId": "7d8cfda875f855b69ce5a8cf659a4ca105a34605", "title": "Large Language Models at Work in China's Labor Market"}, {"paperId": "cbf28b79c3330fd6583a69dbf286b1f04553f77a", "title": "Education in the age of Generative AI: Context and Recent Developments"}, {"paperId": "aae1d88c70cf18ef6aa23693a4dce8204e22d087", "title": "A Bi-Step Grounding Paradigm for Large Language Models in Recommendation Systems"}, {"paperId": "fd712e06f87124dedc771526f797555c432cec42", "title": "MemoChat: Tuning LLMs to Use Memos for Consistent Long-Range Open-Domain Conversation"}, {"paperId": "d84cf745c534c010b8e55e5a4a04878906848dc3", "title": "TEST: Text Prototype Aligned Embedding to Activate LLM's Ability for Time Series"}, {"paperId": "338d8f3b199abcebc85f34016b0162ab3a9d5310", "title": "A Survey on Model Compression for Large Language Models"}, {"paperId": "d2c67422e8cb9a9ebbc9b5b5a08e6ccf7ee37597", "title": "Data Race Detection Using Large Language Models"}, {"paperId": "34cf946873d6e9e5e6e4dec7ba544501d784a8ad", "title": "Attention Is Not All You Need Anymore"}, {"paperId": "451a657dabf80ebc43f6a3be518250b2cd5dfe1a", "title": "Through the Lens of Core Competency: Survey on Evaluation of Large Language Models"}, {"paperId": "814080c3b779da7ee74a510820233cfac0f91e6a", "title": "Steering Language Generation: Harnessing Contrastive Expert Guidance and Negative Prompting for Coherent and Diverse Synthetic Data Generation"}, {"paperId": "3958152c43888a0a9461de2b952df4a39491442b", "title": "Informed Named Entity Recognition Decoding for Generative Language Models"}, {"paperId": "64e802ea8e9dbe247c31fb06184c04dbf9e55e4e", "title": "EcomGPT: Instruction-tuning Large Language Models with Chain-of-Task Tasks for E-commerce"}, {"paperId": "34f9c825ba24889fa5e164ba9f99bfe4fc2f3e61", "title": "LLM Self Defense: By Self Examination, LLMs Know They Are Being Tricked"}, {"paperId": "36a364316c7bab6ed2a599ad2ce364fb2cd3e9dc", "title": "EasyEdit: An Easy-to-use Knowledge Editing Framework for Large Language Models"}, {"paperId": "0b220041eb83c23b7b10d32a5d08c0309d528071", "title": "Large Language Models for Information Retrieval: A Survey"}, {"paperId": "dd3fb89d1201d46fa80b6a9519114599c01c11ac", "title": "#InsTag: Instruction Tagging for Analyzing Supervised Fine-tuning of Large Language Models"}, {"paperId": "b85f3a66245d483f3eb3447eaf9950bd55f2b21e", "title": "PentestGPT: An LLM-empowered Automatic Penetration Testing Tool"}, {"paperId": "738e8782ae8c61a05488a1c2d033be10d077e650", "title": "Large Language Models in Cryptocurrency Securities Cases: Can ChatGPT Replace Lawyers?"}, {"paperId": "4388f8a34b46bb3e07f75619d4592439d784cad5", "title": "Enhancing Network Management Using Code Generated by Large Language Models"}, {"paperId": "33de773be1733347a01cb07a5bb1b6cdfa956a47", "title": "AudioLDM 2: Learning Holistic Audio Generation with Self-supervised Pretraining"}, {"paperId": "896ca0a68e4d33d76a7366bcab85eb7d2605a8c4", "title": "Metacognitive Prompting Improves Understanding in Large Language Models"}, {"paperId": "c74a13b251b6af6dfce49eeb128b1c0e2ddf955d", "title": "A Preliminary Study of the Intrinsic Relationship between Complexity and Alignment"}, {"paperId": "ac74ba80a7c1933250fdd43b4f88a3f7e4b4272a", "title": "An Evaluation Method for Large Language Models’ Code Generation Capability"}, {"paperId": "cfd166a6f15ae6e76801cf3725452f0ec480e759", "title": "Evaluating the Generation Capabilities of Large Chinese Language Models"}, {"paperId": "c60116a51bf66bc363d11b797d97eba84b13cfd7", "title": "LLMeBench: A Flexible Framework for Accelerating LLMs Benchmarking"}, {"paperId": "9c42226d4cffd8f25507bcc8a605d68760f95ec0", "title": "TSSR: A Truncated and Signed Square Root Activation Function for Neural Networks"}, {"paperId": "ea762e479a0c46ef0bb7d3f78a1da10db234053f", "title": "LLaMA-E: Empowering E-commerce Authoring with Multi-Aspect Instruction Following"}, {"paperId": "08fd20b9d28d530e9f43beb803503314d1af86f5", "title": "A Comparative Study of Open-Source Large Language Models, GPT-4 and Claude 2: Multiple-Choice Test Taking in Nephrology"}, {"paperId": "193955704f66923ac20a664bd184ed4663b2bdf9", "title": "Continual Pre-Training of Large Language Models: How to (re)warm your model?"}, {"paperId": "a50d4fd8f584276c0fd8560255884edd57aa926e", "title": "Zhongjing: Enhancing the Chinese Medical Capabilities of Large Language Model through Expert Feedback and Real-world Multi-turn Dialogue"}, {"paperId": "cd9a1e785f3f2ec85256decec0986a2e24fd4db1", "title": "A framework for multi-faceted content analysis of social media chatter regarding non-medical use of prescription medications"}, {"paperId": "9a89f47a10a284380ffe1068a85201fbe1f9ed9b", "title": "Quantifying the Impact of Large Language Models on Collective Opinion Dynamics"}, {"paperId": "7f7af73e0f55477d244e4dbeb4c5a14309bf824c", "title": "Heterogeneous Knowledge Fusion: A Novel Approach for Personalized Recommendation via LLM"}, {"paperId": "09f79daf280659e1cc254ca9d454ac2bacad7620", "title": "Evaluating and Explaining Large Language Models for Code Using Syntactic Structures"}, {"paperId": "a37d5620210276e47cf0c9dd2898c2a82c9d0422", "title": "Simple synthetic data reduces sycophancy in large language models"}, {"paperId": "dd0612ce863f64b0f69d0d9f708c52e829f6f859", "title": "TPTU: Large Language Model-based AI Agents for Task Planning and Tool Usage"}, {"paperId": "2f959a18f4100cf20cc5460cfedd73bb086843e7", "title": "Towards Multiple References Era - Addressing Data Leakage and Limited Reference Diversity in NLG Evaluation"}, {"paperId": "360a4ffdcf3a79a2cbede43b1313de6e5e0e47e0", "title": "Pre-Trained Large Language Models for Industrial Control"}, {"paperId": "4855a4ef7429824d7cde4842e3e8402ebc818ca5", "title": "A Survey of Object Goal Navigation: Datasets, Metrics and Methods"}, {"paperId": "5a7a79bfb1a8e85d108c1285073295a92841b257", "title": "Resource Management for GPT-based Model Deployed on Clouds: Challenges, Solutions, and Future Directions"}, {"paperId": "26f6a4fd94a6cf4aef6a1acbfcbc336e9ad7097e", "title": "A Causality Inspired Framework for Model Interpretation"}, {"paperId": "091deba3690efffe90300ba70ce3143c7bb6229e", "title": "From Military to Healthcare: Adopting and Expanding Ethical Principles for Generative Artificial Intelligence"}, {"paperId": "f70f511cc7cf873deab9d72bd3b768c841d931c5", "title": "Hybrid API Migration: A Marriage of Small API Mapping Models and Large Language Models"}, {"paperId": "c42687bd42539a68319db3b0c74e4bd026740aba", "title": "Evaluating Large Language Models for the National Premedical Exam in India: Comparative Analysis of GPT-3.5, GPT-4, and Bard"}, {"paperId": "1e26b42669b060a3850e4766dea0db6e3c85cdec", "title": "Towards Understanding the Capability of Large Language Models on Code Clone Detection: A Survey"}, {"paperId": "c65a64ea1be8dd654e2685f9bfea4c5118a98804", "title": "Evaluating Instruction-Tuned Large Language Models on Code Comprehension and Generation"}, {"paperId": "6968552aedfdcdd4cbdc480fd7afd44f4f9b90c4", "title": "The Hitchhiker's Guide to Program Analysis: A Journey with Large Language Models"}, {"paperId": "925ff363f781570afbceb361c9ae1cf503172b26", "title": "Structural Embeddings of Tools for Large Language Models"}, {"paperId": "56541b51693a8d6172d5c2bc9550d9045a919aee", "title": "Towards Effective Ancient Chinese Translation: Dataset, Model, and Evaluation"}, {"paperId": "df1095f8c1034dd357465ea32b7e1d5d26012b64", "title": "Emergence of artificial generative intelligence and its potential impact on urology."}, {"paperId": "9badff0f523a898c9b66cbd526aea13fee1f6d26", "title": "Transformer Based Image-Text Consistency Analysis for Infographic Articles"}, {"paperId": "0a12e21a6efb66a7a24aa7fcc9610c7690c58a44", "title": "Large Language Models for Education: Grading Open-Ended Questions Using ChatGPT"}, {"paperId": "7d46a13a1edd02dd6ae2b9f713e6f91ea001dfb4", "title": "When Large Language Models Meet Personalization: Perspectives of Challenges and Opportunities"}, {"paperId": "34ab581bcf2a0a2d9ea7814c24e836ce7fef18f6", "title": "STL: A Signed and Truncated Logarithm Activation Function for Neural Networks"}, {"paperId": "eb546a0b7883fbc9a41d8c7218888322fb5dc62d", "title": "NLLG Quarterly arXiv Report 06/23: What are the most influential current AI Papers?"}, {"paperId": "97717368b5f7e6a544f0a1c73a441bdcb4b6a046", "title": "Do LLMs Possess a Personality? Making the MBTI Test an Amazing Evaluation for Large Language Models"}, {"paperId": "21737406f448844220dde7c711565bd44b0c27f0", "title": "ChatHome: Development and Evaluation of a Domain-Specific Language Model for Home Renovation"}, {"paperId": "d45b359deb3f20f7cab11d2678cb2e1a85225a13", "title": "ArcGPT: A Large Language Model Tailored for Real-world Archival Applications"}, {"paperId": "d3699bfd41c69456ab5f7febb86beb5971175417", "title": "ChatGPT and Persuasive Technologies for the Management and Delivery of Personalized Recommendations in Hotel Hospitality"}, {"paperId": "459abe7efef562908de01c3d256fa2854d509c2d", "title": "Multilevel Large Language Models for Everyone"}, {"paperId": "2525f8185ff4eee23dea96f2a820714a1619fb89", "title": "Evaluating Large Language Models for Radiology Natural Language Processing"}, {"paperId": "584ca135b61482fd89247113da87d784f738dbfa", "title": "Foundational Models Defining a New Era in Vision: A Survey and Outlook"}, {"paperId": "4dcbc14301d048545cd83ca4fd57f110fc995c48", "title": "Tachikuma: Understading Complex Interactions with Multi-Character and Novel Objects by Large Language Models"}, {"paperId": "534a325195b55075c53ed73f4c50d8a7f56ee9e6", "title": "Freudian robots: Artificial intelligence and psychodynamics"}, {"paperId": "caf9617029993a8e95b4c9f01f06f3893e0fe2ff", "title": "Intermediated Reality with an AI 3D Printed Character"}, {"paperId": "c0aec04ee86c0724d61c976f19590fbe9c615723", "title": "Creating Large Language Model Applications Utilizing LangChain: A Primer on Developing LLM Apps Fast"}, {"paperId": "fe3c2e6a8aed77989f40325b94cd7b7fdfc2bcc4", "title": "Alleviating the Long-Tail Problem in Conversational Recommender Systems"}, {"paperId": "d4922e165ce55c27d33350ff808a1bc90d367078", "title": "Dynamic Large Language Models on Blockchains"}, {"paperId": "84b77180228051040286423cec82b62c323a8fda", "title": "Investigating the Factual Knowledge Boundary of Large Language Models with Retrieval Augmentation"}, {"paperId": "071181dca0f67d557e997fa9eba727ef0d702acf", "title": "Language-based Action Concept Spaces Improve Video Self-Supervised Learning"}, {"paperId": "ab4c08d9ae0f408dc4ad83e24455f091efa7682f", "title": "Code Detection for Hardware Acceleration Using Large Language Models"}, {"paperId": "8439616aada33a889f4f52d6a9a3d7f6c5a30b79", "title": "Assessing How Large Language Models Can Be Integrated with or Used for Blockchain Technology: Overview and Illustrative Case Study"}, {"paperId": "0c7df07086512bb528d698dff950a1090e826ede", "title": "Harnessing Large Language Models for Cognitive Assistants in Factories"}, {"paperId": "45a6f7ca23944aa2050c2bc6d6a580058d032b30", "title": "Amazon-M2: A Multilingual Multi-locale Shopping Session Dataset for Recommendation and Text Generation"}, {"paperId": "1b4012f38daa8f09299e16771973c91ce9464ee2", "title": "DVPT: Dynamic Visual Prompt Tuning of Large Pre-trained Models for Medical Image Analysis"}, {"paperId": "6121fb3e393597e02481a516f0035f06ec9a5836", "title": "FinGPT: Democratizing Internet-scale Data for Financial Large Language Models"}, {"paperId": "a44583682ce7be93e2dd1fbc08a8f137b67e4645", "title": "Are you in a Masquerade? Exploring the Behavior and Impact of Large Language Model Driven Social Bots in Online Social Networks"}, {"paperId": "55f83b1cfba60639ead5273e074933ef69b6007b", "title": "PubMed and beyond: biomedical literature search in the age of artificial intelligence"}, {"paperId": "7aad760762c4a10dfbc2d3391eb8bdb28c80b236", "title": "Federated Large Language Model: A Position Paper"}, {"paperId": "c66271363c88407edc335fc9a314c7a0e0af38c1", "title": "On the (In)Effectiveness of Large Language Models for Chinese Text Correction"}, {"paperId": "ba97db1374aa96eb2a50f5de2f1478cd48a96d35", "title": "LogPrécis: Unleashing Language Models for Automated Malicious Log Analysis Précis: a concise summary of essential points, statements, or facts"}, {"paperId": "15dc648a330304bb090b2bafccd5229f69c05105", "title": "ivrit.ai: A Comprehensive Dataset of Hebrew Speech for AI Research and Development"}, {"paperId": "a42200d76d2dcc136332125efcd28da68bd65d12", "title": "Comparative Performance Evaluation of Large Language Models for Extracting Molecular Interactions and Pathway Knowledge"}, {"paperId": "65d7663b60d95f98e6281ecc4da9c7a975119b91", "title": "GeoGPT: Understanding and Processing Geospatial Tasks through An Autonomous GPT"}, {"paperId": "c48fc69b62c749e78928d6a3bae98ffe278f761a", "title": "Do Emergent Abilities Exist in Quantized Large Language Models: An Empirical Study"}, {"paperId": "b3d6fec3f1a878b0c612f0ffed820b045c2c46d8", "title": "The Potential and Pitfalls of using a Large Language Model such as ChatGPT or GPT-4 as a Clinical Assistant"}, {"paperId": "97f3cf88bc592a323e62dffe20e522de44957076", "title": "CPET: Effective Parameter-Efficient Tuning for Compressed Large Language Models"}, {"paperId": "f43b8a87a96f8abc2467b90538b643a6061416e9", "title": "Software Testing with Large Language Model: Survey, Landscape, and Vision"}, {"paperId": "1212b1e44f7611d2017b246fd3d8e9c973c9d937", "title": "Can Large Language Models Empower Molecular Property Prediction?"}, {"paperId": "fdb5b1ade3dfcdb3f7deb62392416942c0effe65", "title": "The Power of Large Language Models for Wireless Communication System Development: A Case Study on FPGA Platforms"}, {"paperId": "8505818b8ad9088ad88151dc3532d664925eb1d1", "title": "Classical Out-of-Distribution Detection Methods Benchmark in Text Classification Tasks"}, {"paperId": "ca31b8584b6c022ef15ddfe994fe361e002b7729", "title": "A Comprehensive Overview of Large Language Models"}, {"paperId": "1f9822022f586e375461660db792f23e891c7123", "title": "Self-Adaptive Large Language Model (LLM)-Based Multiagent Systems"}, {"paperId": "191e300e381d4128b749d16fe3d83c8643a3bd1f", "title": "Retrieval-augmented GPT-3.5-based Text-to-SQL Framework with Sample-aware Prompting and Dynamic Revision Chain"}, {"paperId": "548278897d46a54958909bb23bcaecf63e24fadf", "title": "Secrets of RLHF in Large Language Models Part I: PPO"}, {"paperId": "9806cac2d36feda043dcdfe0f4de2608127da27c", "title": "Towards Understanding In-Context Learning with Contrastive Demonstrations and Saliency Maps"}, {"paperId": "d62c4d00b277e948956b6610ce2644e88fe1577b", "title": "Large Language Models"}, {"paperId": "8f1b0c247171510fc68da27a16a377456376a5a7", "title": "Assessing GPT-3.5 and GPT-4 in Generating International Classification of Diseases Billing Codes"}, {"paperId": "68fd6cc9b41291d625b41761149016be6485c0b3", "title": "ChatGPT in the Age of Generative AI and Large Language Models: A Concise Survey"}, {"paperId": "da95049d4c22295af81afabee79ab78197a00b1e", "title": "Answering Ambiguous Questions via Iterative Prompting"}, {"paperId": "8f93f95e093aab16e594b4a246a205007e107c7a", "title": "Right to be Forgotten in the Era of Large Language Models: Implications, Challenges, and Solutions"}, {"paperId": "d1bb97ac84e81b10f3a60d7c634c6c0c26437072", "title": "Can LLMs be Good Financial Advisors?: An Initial Study in Personal Decision Making for Optimized Outcomes"}, {"paperId": "105669ec59a58fb2d4dd3021a984af33c227c5ab", "title": "Exploring the Potential of Large Language Models (LLMs) in Learning on Graphs"}, {"paperId": "4173931180ac2ba0f7e541fc08f373b2e15ccd21", "title": "Derivative Free Weight-space Ensembling"}, {"paperId": "d3dbbd0f0de51b421a6220bd6480b8d2e99a88e9", "title": "A Survey on Graph Neural Networks for Time Series: Forecasting, Classification, Imputation, and Anomaly Detection"}, {"paperId": "c4f9f0cc8c138047a61bdb11b1a352e3d1aed035", "title": "Large Language Models as Batteries-Included Zero-Shot ESCO Skills Matchers"}, {"paperId": "2e588fe7e07948cb9112c37d5e9dcc3a13b1bd0f", "title": "Unveiling the Potential of Knowledge-Prompted ChatGPT for Enhancing Drug Trafficking Detection on Social Media"}, {"paperId": "047d7007142ffae7a301311da5ca07b5fe4b7915", "title": "La nueva realidad de la educación ante los avances de la inteligencia artificial generativa"}, {"paperId": "888728745dbb769e29ed475d4f7661eebe1a71cf", "title": "A Survey on Evaluation of Large Language Models"}, {"paperId": "6e3ac4c4e820ca939f8ec235eb256028d0125ab4", "title": "CORE-GPT: Combining Open Access research and large language models for credible, trustworthy question answering"}, {"paperId": "494b043fce4da2ecc7f87bc96f7c29a5278cca61", "title": "Frontier AI Regulation: Managing Emerging Risks to Public Safety"}, {"paperId": "a35f1315e91513ff0bec0c488fe175214fd9636c", "title": "Recommender Systems in the Era of Large Language Models (LLMs)"}, {"paperId": "127aa57ffe685d0ea9859ba5311f8d98dee17309", "title": "Generative Job Recommendations with Large Language Model"}, {"paperId": "1e3ef48abeef882e12f9553a1baf8944f3782c88", "title": "Several categories of Large Language Models (LLMs): A Short Survey"}, {"paperId": "a79330d1069a86b7f8bf6f9fe0ef01d7b1379a91", "title": "Chain of Thought Prompting Elicits Knowledge Augmentation"}, {"paperId": "82a9b8984e26fdf234431459bdb445fbcfc3cb76", "title": "Visual Instruction Tuning with Polite Flamingo"}, {"paperId": "7619a98ef077c8f75e0bfb98953457649209e07e", "title": "Review of Large Vision Models and Visual Prompt Engineering"}, {"paperId": "b4531fbd97743cb099cc3cafd21b6da06fc3af67", "title": "Assessment of Resident and AI Chatbot Performance on the University of Toronto Family Medicine Residency Progress Test: Comparative Study"}, {"paperId": "94e7c98aff1b831201ad42eb54c327817fb42b53", "title": "PatternGPT : A Pattern-Driven Framework for Large Language Model Text Generation"}, {"paperId": "942130a875ccfe55a4c60c27c636f693e25cb13d", "title": "Personality Traits in Large Language Models"}, {"paperId": "44f6f46055347f2c032a64fe32f282266cd89779", "title": "A Survey on Explainable AI for 6G O-RAN: Architecture, Use Cases, Challenges and Research Directions"}, {"paperId": "cf744d77face5f22f6800411cc4060b07c0ef6ff", "title": "Concept-Oriented Deep Learning with Large Language Models"}, {"paperId": "d14aa448b17fdc8d4ea12b43ee1a2b1254c38703", "title": "Taqyim: Evaluating Arabic NLP Tasks Using ChatGPT Models"}, {"paperId": "44acac1f180746d079a48b05514502b9aeb63bfb", "title": "Hacia revisiones de la literatura más eficientes potenciadas por inteligencia artificial"}, {"paperId": "9a61d51212eb4ff677fe777a7ba9ddc4f675b387", "title": "Automatic Calibration and Error Correction for Generative Large Language Models via Pareto Optimal Self-Supervision"}, {"paperId": "c7a7104df3db13737a865ede2be8146990fa4026", "title": "Mitigating Hallucination in Large Multi-Modal Models via Robust Instruction Tuning"}, {"paperId": "4e0fbb5babf75e5d45efdaac6e9504cf7479ff3f", "title": "Deep Predictive Learning : Motion Learning Concept inspired by Cognitive Robotics"}, {"paperId": "8da56a919dcb758fd2a2d6ea96e900ddba24f57f", "title": "On the Uses of Large Language Models to Interpret Ambiguous Cyberattack Descriptions"}, {"paperId": "76a694acec51f6f4db5d72a6c5c66fead6b90f8d", "title": "Potential Benefits of Employing Large Language Models in Research in Moral Education and Development"}, {"paperId": "697e0add95e880bd42e00bef838181e105f91981", "title": "MME: A Comprehensive Evaluation Benchmark for Multimodal Large Language Models"}, {"paperId": "087a2f4cfea227be944f576f1f049e329316acac", "title": "Instruct-FinGPT: Financial Sentiment Analysis by Instruction Tuning of General-Purpose Large Language Models"}, {"paperId": "c520d8a888355f7abb7728b2e2510fe7bc63f814", "title": "Large Scale Foundation Model on Single-cell Transcriptomics"}, {"paperId": "ab83f72cb954f22c490d74f13fbe3cd10fe790e4", "title": "FlakyFix: Using Large Language Models for Predicting Flaky Test Fix Categories and Test Code Repair"}, {"paperId": "02033e83ff310f35e4623bd339982c52d926f2d5", "title": "Give Us the Facts: Enhancing Large Language Models with Knowledge Graphs for Fact-aware Language Modeling"}, {"paperId": "c5481668f78ab0c8ef2de9230f2fc1ce27eea6e4", "title": "Towards Open-World Recommendation with Knowledge Augmentation from Large Language Models"}, {"paperId": "681253389d2cc27103753749f4c7556699d55471", "title": "Temporal Data Meets LLM - Explainable Financial Time Series Forecasting"}, {"paperId": "73c6533c2988eebb71cdaa758f38546cdf01f655", "title": "Large Language Models are Fixated by Red Herrings: Exploring Creative Problem Solving and Einstellung Effect using the Only Connect Wall Dataset"}, {"paperId": "0c5fbcd73343d7527863ddd15c91fbcb774fca49", "title": "Large Generative AI Models for Telecom: The Next Big Thing?"}, {"paperId": "cc1723cf8a6cecb2295360ba01a01da90452403e", "title": "Structured Thoughts Automaton: First Formalized Execution Model for Auto-Regressive Language Models"}, {"paperId": "6fcd575ce912e0f61ec6062c8c35924285f0ec02", "title": "Semi-Offline Reinforcement Learning for Optimized Text Generation"}, {"paperId": "b8dd3a023b6f3e3bb862d172d84c3f29d3f840d1", "title": "Are Large Language Models Really Good Logical Reasoners? A Comprehensive Evaluation and Beyond"}, {"paperId": "227b1158ea302b12f3788ee55482f6240b07463f", "title": "ChatGPT, Bard, and Large Language Models for Biomedical Research: Opportunities and Pitfalls"}, {"paperId": "8c035150f883007b5af9e5bb753b78d9c0b75a55", "title": "Safeguarding Crowdsourcing Surveys from ChatGPT with Prompt Injection"}, {"paperId": "71e996ff55b972946b9fe0f88394c19425f5a3ab", "title": "Interleaving Pre-Trained Language Models and Large Language Models for Zero-Shot NL2SQL Generation"}, {"paperId": "aff0fe00ed7892d1185e8c5b66d318d3892abe6e", "title": "Opportunities and Challenges for ChatGPT and Large Language Models in Biomedicine and Health"}, {"paperId": "b937b5ad3c1ebe6007e744fa7864ec095e0070ab", "title": "Tell Me Where to Go: A Composable Framework for Context-Aware Embodied Robot Navigation"}, {"paperId": "9e8b7b0d4c628c12b6a65ab56ac5f33a35eff2e6", "title": "Unifying Large Language Models and Knowledge Graphs: A Roadmap"}, {"paperId": "00557300321dc60998e0f42853f4bba52d6e53db", "title": "Revealing the structure of language model capabilities"}, {"paperId": "9afa0c3227fd0ec3a76928784e59c4205cbace24", "title": "AutoML in the Age of Large Language Models: Current Challenges, Future Opportunities and Risks"}, {"paperId": "4504a9698205adb6b12dd38839c2bc85c48afdb4", "title": "Performance of ChatGPT and Bard in Self-Assessment Questions for Nephrology Board Renewal"}, {"paperId": "b239648a07d44d71185e48ab79bf5a2bc347e52f", "title": "Medical Data Augmentation via ChatGPT: A Case Study on Medication Identification and Medication Event Classification"}, {"paperId": "eda08c6f5919f39979acf0b3bc52e903063b5ba4", "title": "Xiezhi: An Ever-Updating Benchmark for Holistic Domain Knowledge Evaluation"}, {"paperId": "bac54736112098616f0e1c90435888ef3e119d32", "title": "How Can Recommender Systems Benefit from Large Language Models: A Survey"}, {"paperId": "58f8925a8b87054ad0635a6398a7fe24935b1604", "title": "Mind2Web: Towards a Generalist Agent for the Web"}, {"paperId": "cc78babfacce48e715dac56886d7dd9746cfcab0", "title": "RETA-LLM: A Retrieval-Augmented Large Language Model Toolkit"}, {"paperId": "15c79f96ec7cfb8175a0a270f4194882e9e4efec", "title": "Transition role of entangled data in quantum machine learning"}, {"paperId": "e10d2f218692f6b938f7e7e1ba355db9cdc7816b", "title": "Enabling Intelligent Interactions between an Agent and an LLM: A Reinforcement Learning Approach"}, {"paperId": "1f32e9169f2c7098d5a8639dacbc1e10bd18524c", "title": "Utilizing Large Language Models to Simplify Radiology Reports: a comparative analysis of ChatGPT-3.5, ChatGPT-4.0, Google Bard, and Microsoft Bing"}, {"paperId": "1f70ca7c9cc9257a16b9705c60b20ed1fc4d872c", "title": "Improving Conversational Recommendation Systems via Counterfactual Data Simulation"}, {"paperId": "f2154bedb033b07b838d9ac90a657b4ab4243be4", "title": "A survey of Generative AI Applications"}, {"paperId": "db7fb022d11b4f72d9a2f514db1bba5f9f48eea8", "title": "Evaluation of AI Chatbots for Patient-Specific EHR Questions"}, {"paperId": "729d4e0db88583d1add8681a34b28d1b1e84eb5d", "title": "User Behavior Simulation with Large Language Model based Agents"}, {"paperId": "587f22e4e04d77ba0750deea69192fbfb73d7435", "title": "Evaluating and Improving Tool-Augmented Computation-Intensive Math Reasoning"}, {"paperId": "6f5b3e45fb784966838ed22a51abbecfcabce489", "title": "Evolution of Efficient Symbolic Communication Codes"}, {"paperId": "362d4e00506f9bb39d42185a0b128f8602e139a8", "title": "Utilizing ChatGPT to Enhance Clinical Trial Enrollment"}, {"paperId": "96b25fe7054b2390c3ea96c5f00046dd8e7c2452", "title": "Hybrid Long Document Summarization using C2F-FAR and ChatGPT: A Practical Study"}, {"paperId": "faf3b75d51da34da4d7e0bb5a3c38842a9ebcfa3", "title": "Column Type Annotation using ChatGPT"}, {"paperId": "b486982fa7c68a8a08df1111ba9607119419c488", "title": "A Survey on Large Language Models for Recommendation"}, {"paperId": "6847b9658f287f430098199cd81bf26308da13f9", "title": "Domain Specialization as the Key to Make Large Language Models Disruptive: A Comprehensive Survey"}, {"paperId": "05fab50acb26203a944a955131a2388c9731a8f7", "title": "Transfer Learning for Power Outage Detection Task with Limited Training Data"}, {"paperId": "d3ba770fa1f48458b7ccbc88307b942cfb751a36", "title": "ChatGPT Informed Graph Neural Network for Stock Movement Prediction"}, {"paperId": "db77bf2378a2ac764984f5e5bd81f68e994c3323", "title": "Learning to Imagine: Visually-Augmented Natural Language Generation"}, {"paperId": "df7d7e71eba619363e7dbe8b14f4baeb3100ca73", "title": "Zero is Not Hero Yet: Benchmarking Zero-Shot Performance of LLMs for Financial Tasks"}, {"paperId": "c2c7ad3112c4b575e5d8163a0e574f9eb743cb52", "title": "Zero-shot Visual Question Answering with Language Model Feedback"}, {"paperId": "3a47eceaa4b84fe1d70deb6d5336ba7a8a6d5d8a", "title": "DataChat: Prototyping a Conversational Agent for Dataset Search and Visualization"}, {"paperId": "d30b14372be1fb861f7afc74c4f098543d14b2e0", "title": "Enhancing Human Capabilities through Symbiotic Artificial Intelligence with Shared Sensory Experiences"}, {"paperId": "af067c6f1c12941625e4c3b49b002c7c7c0b2542", "title": "BookGPT: A General Framework for Book Recommendation Empowered by Large Language Model"}, {"paperId": "cec659dc0a6dc7c0dd2da330df01ddb91c9e211c", "title": "Linguistic Properties of Truthful Response"}, {"paperId": "f8d61c049d4ffa1bd7e1b1c42991a9d724277d03", "title": "Towards Higher Pareto Frontier in Multilingual Machine Translation"}, {"paperId": "d61ca71f64133f12d0534f1be5d2b7a0af3d2803", "title": "Understanding the Capabilities of Large Language Models for Automated Planning"}, {"paperId": "9e16d8cc6096ec0d2733a4ecf41ce09d9a4bd19c", "title": "Scaling Data-Constrained Language Models"}, {"paperId": "ddcd2bcc809bd0c2755a4a9487473d61ac327c50", "title": "Clever Hans or Neural Theory of Mind? Stress Testing Social Reasoning in Large Language Models"}, {"paperId": "e4f10c448aaea9cba800e8ed324c46f13725e952", "title": "Pre-RMSNorm and Pre-CRMSNorm Transformers: Equivalent and Efficient Pre-LN Transformers"}, {"paperId": "2b967d82b25088566980aaaf5a7062d90b2fb14f", "title": "GPT4Graph: Can Large Language Models Understand Graph Structured Data ? An Empirical Evaluation and Benchmarking"}, {"paperId": "0042c4f35d4a3ea947de8374e298099d476dad7f", "title": "PIVOINE: Instruction Tuning for Open-world Information Extraction"}, {"paperId": "95ca67ba607d7859ee8eec457f4b59b115d69bf5", "title": "ChatCoT: Tool-Augmented Chain-of-Thought Reasoning on Chat-based Large Language Models"}, {"paperId": "c226a4acb42912054d498bcf771023b0ba2da001", "title": "Language Model Self-improvement by Reinforcement Learning Contemplation"}, {"paperId": "1567bcac0ab09269c9d0ff33c9a406132417fab9", "title": "A Pretrainer's Guide to Training Data: Measuring the Effects of Data Age, Domain Coverage, Quality, & Toxicity"}, {"paperId": "f5c73d9e6641b018b633690102121f5605d34fb0", "title": "Editing Large Language Models: Problems, Methods, and Opportunities"}, {"paperId": "96273b87cd0eb9d1c9a12afae621ce2abdbbab36", "title": "LLM Paternity Test: Generated Text Detection with LLM Genetic Inheritance"}, {"paperId": "bcdaf6c98ddbd6809cf6241aa77200d7394db163", "title": "CRITIC: Large Language Models Can Self-Correct with Tool-Interactive Critiquing"}, {"paperId": "e0384ba36555232c587d4a80d527895a095a9001", "title": "HaluEval: A Large-Scale Hallucination Evaluation Benchmark for Large Language Models"}, {"paperId": "4f0c7f4df04f07609bdb67944af2a529d5a4517b", "title": "A Survey of Safety and Trustworthiness of Large Language Models through the Lens of Verification and Validation"}, {"paperId": "88b4ed17e8881b4e420627f3650ddab181bb632b", "title": "The Web Can Be Your Oyster for Improving Large Language Models"}, {"paperId": "b944a8f2cddbc4cae1224eab84673f034284881c", "title": "TOME: A Two-stage Approach for Model-based Retrieval"}, {"paperId": "a979975d1a0aea0e01423f092249cc3de575b6cd", "title": "X-IQE: eXplainable Image Quality Evaluation for Text-to-Image Generation with Visual Large Language Models"}, {"paperId": "c3a59e1e405e7c28319e5a1c5b5241f9b340cf63", "title": "MemoryBank: Enhancing Large Language Models with Long-Term Memory"}, {"paperId": "206400aba5f12f734cdd2e4ab48ef6014ea60773", "title": "Evaluating Object Hallucination in Large Vision-Language Models"}, {"paperId": "25f729d7773614846b412db3c6c2a3aab41ec409", "title": "M3KE: A Massive Multi-Level Multi-Subject Knowledge Evaluation Benchmark for Chinese Large Language Models"}, {"paperId": "5c7aaee5651221893ea0e67c363cab4c4be53b83", "title": "Maybe Only 0.5% Data is Needed: A Preliminary Exploration of Low Training Data Instruction Tuning"}, {"paperId": "62f4ff467f8df260096300945e4e175da59dfe77", "title": "A Preliminary Analysis on the Code Generation Capabilities of GPT-3.5 and Bard AI Models for Java Functions"}, {"paperId": "e0f27336698c84709bd60b6b7f4ce588cbae66bf", "title": "StructGPT: A General Framework for Large Language Model to Reason over Structured Data"}, {"paperId": "f4e723958a93762befb4d4a039b44a7d752f9917", "title": "Large Language Models are Zero-Shot Rankers for Recommender Systems"}, {"paperId": "c131ac4360aa9d9b7a955bed87e9cd4a1a3e7562", "title": "Knowledge Rumination for Pre-trained Language Models"}, {"paperId": "1856bebc4cb35e68368d9c83bd2ac2d26cd4bcfa", "title": "A Comprehensive Survey on Segment Anything Model for Vision and Beyond"}, {"paperId": "6a6cbcc596758dd214120a1d51528ce55daa333d", "title": "Dr. LLaMA: Improving Small Language Models on PubMedQA via Generative Data Augmentation"}, {"paperId": "2e92b3699668f920a8d692535622ebeaa53315e2", "title": "Is ChatGPT Fair for Recommendation? Evaluating Fairness in Large Language Model Recommendation"}, {"paperId": "0b29ff236bb8f547d017bf747ad74ad2b8303851", "title": "Not All Languages Are Created Equal in LLMs: Improving Multilingual Capability by Cross-Lingual-Thought Prompting"}, {"paperId": "0383e049e98c9eedbc61be728d4ef037300bbedf", "title": "Recommendation as Instruction Following: A Large Language Model Empowered Recommendation Approach"}, {"paperId": "ae1db9bf0930cc8506c2c74d3dfc72385675fa4e", "title": "ChatGPT-Like Large-Scale Foundation Models for Prognostics and Health Management: A Survey and Roadmaps"}, {"paperId": "d0ee000f30420953f10dfcfd608a7f9ad40f1635", "title": "Humans are still better than ChatGPT: Case of the IEEEXtreme competition"}, {"paperId": "7bdfb49883c0a0b8b754e3356887d7b3faff348e", "title": "Exploring the Landscape of Machine Unlearning: A Comprehensive Survey and Taxonomy"}, {"paperId": "fc19a3b7364cc9ee1092df99cb74426843d92af1", "title": "Large language models in biomedical natural language processing: benchmarks, baselines, and recommendations"}, {"paperId": "5c525813c02043ed557105a9d411997a0ca5261b", "title": "GPT-NAS: Evolutionary Neural Architecture Search with the Generative Pre-Trained Model"}, {"paperId": "73207b9fd2dcfeead7fe086cfdb097e4929a7b44", "title": "MoT: Memory-of-Thought Enables ChatGPT to Self-Improve"}, {"paperId": "4c552ad10efda5283f7b681f7dd2e532445259fc", "title": "No More Manual Tests? Evaluating and Improving ChatGPT for Unit Test Generation"}, {"paperId": "a6d201a6e73064c2fb3fd9d7aa43e168b8e0a1b0", "title": "Towards Applying Powerful Large AI Models in Classroom Teaching: Opportunities, Challenges and Prospects"}, {"paperId": "619c3ab944d7786db3ec4078a6b074a0f70a1987", "title": "Using ChatGPT for Entity Matching"}, {"paperId": "24ef856534bbc0931c8bf5d2e754fda1bdedcde2", "title": "\"Oops, Did I Just Say That?\" Testing and Repairing Unethical Suggestions of Large Language Models with Suggest-Critique-Reflect Process"}, {"paperId": "6b7f1c5c1a3b20cecb1213ae1d017e2418b4597c", "title": "Towards Weakly-Supervised Hate Speech Classification Across Datasets"}, {"paperId": "450b5490cc653478c272be50aa986798df828a20", "title": "Uncovering ChatGPT’s Capabilities in Recommender Systems"}, {"paperId": "37ba1833e844f5178f91f50d82bfff616551e6ad", "title": "The Role of Summarization in Generative Agents: A Preliminary Perspective"}, {"paperId": "3487c12512fa41d3a4d64f00cb842525a8590ad3", "title": "TALLRec: An Effective and Efficient Tuning Framework to Align Large Language Model with Recommendation"}, {"paperId": "fce42753155280051ac64817404b4e1d3be6ebaa", "title": "MLCopilot: Unleashing the Power of Large Language Models in Solving Machine Learning Tasks"}, {"paperId": "570079bbdd8758dfe865097e05719313c9c1301a", "title": "LLaMA-Adapter V2: Parameter-Efficient Visual Instruction Model"}, {"paperId": "180f4ada7513ca21da0ac64f2a4efa3996798341", "title": "Toward an Ethics of AI Belief"}, {"paperId": "d47b9407cf0938e9f15ce019031d7cd63b308a01", "title": "Search-in-the-Chain: Interactively Enhancing Large Language Models with Search for Knowledge-intensive Tasks"}, {"paperId": "91125be6b5e2df94c7a48893bab2d1a7a7a19199", "title": "ChatLog: Recording and Analyzing ChatGPT Across Time"}, {"paperId": "a7c0d9bf44045c9d4c41e329e2a87df0ae7e0af6", "title": "Federated Prompting and Chain-of-Thought Reasoning for Improving LLMs Answering"}, {"paperId": "131c6f328c11706de2c43cd16e0b7c5d5e610b6a", "title": "Harnessing the Power of LLMs in Practice: A Survey on ChatGPT and Beyond"}, {"paperId": "cde7fb6bfc258d33a9b0d87ebdc66beaf2865674", "title": "Game-based Platforms for Artificial Intelligence Research"}, {"paperId": "8334cab3749f83b09679e955f4794d132c60b24c", "title": "Prompting GPT-3.5 for Text-to-SQL with De-semanticization and Skeleton Retrieval"}, {"paperId": "f6654702479eddb01d6f1bd72d6d56102ebefbfc", "title": "The Potential of Visual ChatGPT For Remote Sensing"}, {"paperId": "34dd0b6866b99758b3b5d6f9d1d1c9fcf68d4b91", "title": "Empirical Evaluation of ChatGPT on Requirements Information Retrieval Under Zero-Shot Setting"}, {"paperId": "131f499e4d3503da93022d07fcf804a18483bea9", "title": "WizardLM: Empowering Large Language Models to Follow Complex Instructions"}, {"paperId": "78f599fbd62dcc4a8dbab9d2f6056815dfc5b84c", "title": "The MiniPile Challenge for Data-Efficient Language Models"}, {"paperId": "dce4e4cf1cd8c42b8a400280a48283234ad7aafb", "title": "Are Large Language Models All You Need for Task-Oriented Dialogue?"}, {"paperId": "c8427cc0d4cb68a373a43cf227fbc233f3ed3481", "title": "BugNIST - a Large Volumetric Dataset for Object Detection under Domain Shift"}, {"paperId": "5861df95084cf739a6ca3185d6523dd702bd1f10", "title": "Safety Analysis in the Era of Large Language Models: A Case Study of STPA using ChatGPT"}, {"paperId": "07f07d4d59fdbc3596284f51057cb006779d42c1", "title": "A Bibliometric Review of Large Language Models Research from 2017 to 2023"}, {"paperId": "7af71b2cc2421e8a35624a843a9ea0bd5627be11", "title": "Classification of integers based on residue classes via modern deep learning algorithms"}, {"paperId": "f8e77bd3d573d0daee0744443c65c40e3b5dc10f", "title": "Unleashing the Power of Edge-Cloud Generative AI in Mobile Networks: A Survey of AIGC Services"}, {"paperId": "293499319bdd460cb3fca1f0f5eb330e64bf3ff9", "title": "Towards Making the Most of ChatGPT for Machine Translation"}, {"paperId": "ce9e5a0ddb49d529964901df8ffb5bfada7ab5fa", "title": "DeltaScore: Fine-Grained Story Evaluation with Perturbations"}, {"paperId": "d51f1261148bd2f13006be78d21385abbe58a631", "title": "On Model Compression for Neural Networks: Framework, Algorithm, and Convergence Guarantee"}, {"paperId": "5fa10872ef8037853ff7c8baf5f77fb55a918eca", "title": "Diffusion Models for Non-autoregressive Text Generation: A Survey"}, {"paperId": "0a4441d155374e5853c738b346368e5da8193b79", "title": "GLM-Dialog: Noise-tolerant Pre-training for Knowledge-grounded Dialogue Generation"}, {"paperId": "dc385646887a3669ae0ee506a263d592f4f7c7a6", "title": "Finding Support Examples for In-Context Learning"}, {"paperId": "fa8c46a69978adee7dc51c7371cb4c35c6492fa9", "title": "Emerging Synergies in Causality and Deep Generative Models: A Survey"}, {"paperId": "8bbdf825e6ccd197adfff5ebeecc9a5a5210e02f", "title": "Editing Language Model-based Knowledge Graph Embeddings"}, {"paperId": "a43425af7413e62c816a8fc007ab443465761829", "title": "Unifying Structure Reasoning and Language Pre-Training for Complex Reasoning Tasks"}, {"paperId": "bff499d51b002fd0b1aa05ba151a4a515e5bf36f", "title": "Emotional Intelligence of Large Language Models"}, {"paperId": "13be09f2747e3fb7a439a98a11afee5c789f5491", "title": "Does peer-reviewed theory help predict the cross-section of stock returns?"}, {"paperId": "6845bea94b2fb17d4377b3bb2bd10f73a959f9cc", "title": "Reasoning with Language Model Prompting: A Survey"}, {"paperId": "c6a47dec94ded708fe759ca0b71ad57ab72fec07", "title": "KNIFE: Distilling Reasoning Knowledge From Free-Text Rationales"}, {"paperId": "3eb37f8318abcc56912931205a4f4c85920ff87a", "title": "Controllable Text Generation via Probability Density Estimation in the Latent Space"}, {"paperId": "59d440de6378de10bf8da3995e64c70be23aa88e", "title": "Visually-augmented pretrained language models for NLP tasks without images"}, {"paperId": "ab794d6fcc5417b908148933e77ec95426cfba20", "title": "Analyzing Riemann's hypothesis"}, {"paperId": "a26623d52d24e03044a158cddad931ec5ab7304c", "title": "A Survey of Knowledge Enhanced Pre-Trained Language Models"}, {"paperId": "baf63d7cf115d674a8c8da3a3d789aa84521977a", "title": "What Makes Pre-trained Language Models Better Zero-shot Learners?"}, {"paperId": "447c5ed30b16200386fbda7371263ac1cbe74251", "title": "A Survey on Measuring and Mitigating Reasoning Shortcuts in Machine Reading Comprehension"}, {"paperId": "5b0855b9b9361839844ae86277e8189a957d9d23", "title": "MVP: Multi-task Supervised Pre-training for Natural Language Generation"}, {"paperId": "19a2a48c63504b5ccb652b1976ba638a92947660", "title": "Automated scholarly paper review: Concepts, technologies, and challenges"}, {"paperId": "27cb453d6e98b555c84192597f00640342f998c5", "title": "Comfetch: Federated Learning of Large Networks on Constrained Clients via Sketching"}, {"paperId": "5d4a6ce39cfe7bfc6305cba86464efff8bc20c97", "title": "A Review on Large Language Models: Architectures, Applications, Taxonomies, Open Issues and Challenges"}, {"paperId": "25de9e07d1b1d0f09995347bb6dd193e1ef52e91", "title": "Gradient-Leaks: Enabling Black-Box Membership Inference Attacks Against Machine Learning Models"}, {"paperId": "cc074c98f3fa83e5367f3e593fc07bde22d32a7a", "title": "Intelligent Practices of Large Language Models in Digital Government Services"}, {"paperId": "7eff8e646fe0d76f196e637d8e86ee0ea64561af", "title": "Hi-Core: Hierarchical Knowledge Transfer for Continual Reinforcement Learning"}, {"paperId": "3c08dc7debee3caea1f55aa627dc3013f1d635d3", "title": "Backdoor Attacks to Deep Neural Networks: A Survey of the Literature, Challenges, and Future Research Directions"}, {"paperId": "d8de74b04f00e603cdc43ec9c5218e11ba8c5841", "title": "Sequence Labeling as Non-Autoregressive Dual-Query Set Generation"}, {"paperId": "2a2cc6f86d24beaed6a9dd5e848590f432c86143", "title": "Context and WSD: Analysing Google Translate’s Sanskrit to English Output of Bhagavadgītā Verses for Word Meaning"}, {"paperId": "b802df98ab31445df9770f0231b7e459b26f2fdd", "title": "Chain-of-LoRA: Enhancing the Instruction Fine-Tuning Performance of Low-Rank Adaptation on Diverse Instruction Set"}, {"paperId": "ff99e16e34620ed4fbf18a1aa0adc560a59ddd84", "title": "Enhancing Parameter Efficiency in Model Inference Using an Ultralight Inter-Transformer Linear Structure"}, {"paperId": "17b512e7570e591965172fc681655b73b7169f3b", "title": "A ChatGPT-based Model for User Book Rating Prediction"}, {"paperId": "811fb974cc96d7750c781be491d8af63e7392472", "title": "Search-in-the-Chain: Towards Accurate, Credible and Traceable Large Language Models for Knowledge-intensive Tasks"}, {"paperId": "640bc34dc18657b2f9707277f455a573e40f7368", "title": "D ELTA S CORE : Story Evaluation with Perturbations"}, {"paperId": "69fb47e0ea1c30280d4450cbd9a1e992e7c9d503", "title": "Search-in-the-Chain: Towards the Accurate, Credible and Traceable Content Generation for Complex Knowledge-intensive Tasks"}, {"paperId": "cb7fa7ee3df826628c113ba0c6db1205751d89a3", "title": "HELMA: A Large-Scale Hallucination Evaluation Benchmark for Large Language Models"}, {"paperId": "0a0ba2a90a4a5871d58e78b333f805eac896a1b1", "title": "Not All Metrics Are Guilty: Improving NLG Evaluation with LLM Paraphrasing"}, {"paperId": "92746dfa09dcad92ecf1e6272ebb300c1112b7eb", "title": "Automatic Calibration and Error Correction for Large Language Models via Pareto Optimal Self-Supervision"}, {"paperId": "fe0be9af21ec0d3e2c52ec28909712f252e3de5d", "title": "Small Pre-trained Language Models Can be Fine-tuned as Large Models via Over-Parameterization"}, {"paperId": "f0295393100c1b55c75ab3d0719827546fbf41cc", "title": "Respectful or Toxic? Using Zero-Shot Learning with Language Models to Detect Hate Speech"}, {"paperId": "7ae64df494f0f34aff7d2827e3deace4463e0952", "title": "Automated Extraction of Molecular Interactions and Pathway Knowledge using Large Language Model, Galactica: Opportunities and Challenges"}, {"paperId": "0167f681bac9b7f6cf396e8a5fc6e46c62fd1896", "title": "Towards Understanding the Spatial Literacy of ChatGPT ∗ Taking a Geographic Information Systems (GIS) Exam"}, {"paperId": "bf64793549cae29c96858bfbebd2ef7737cfdc42", "title": "Say That Again: The role of multimodal redundancy in communication and context"}, {"paperId": "73025a7866764e009483c07f30dd2954b06ab0d6", "title": "Evaluating Large Language Models for Radiology Natural Language Processing"}, {"paperId": "8e66c03c8c0a31e13944992931558e46d79624ed", "title": "LogPrécis: Unleashing Language Models for Automated Shell Log Analysis"}, {"paperId": "deb6dd39a68ea0d949f580a7944abf595185e150", "title": "Are LLMs All You Need for Task-Oriented Dialogue?"}, {"paperId": "15f50249f554204afbf3c0e70b193e0ea6da1675", "title": "Leveraging Label Variation in Large Language Models for Zero-Shot Text Classification"}, {"paperId": "c13a4cb912ef5202e99feff0f5dd01f183668d59", "title": "Unleashing the Power of Large Models: Exploring Human-Machine Conversations"}, {"paperId": "0a470fbfebb5515e8af8d9a09f603df4dfce40a0", "title": "A Systematic Evaluation of Large Language Models for Natural"}, {"paperId": "c05e852fa8fa8aa2493b9ace04320701102eb6cb", "title": "T RENDS AND CHALLENGES OF A RABIC C HATBOTS : L ITERATURE REVIEW"}, {"paperId": "b0104ce04370abb72c29ca87626f2f5b99dece40", "title": "Large Language Models: Compilers for the 4^{th} Generation of Programming Languages? (Short Paper)"}, {"paperId": "b58a3e10e6e52594591f99d08839868e57072ed5", "title": "ACTI Task Report – Transformer-basedConspiracy Theory Identification"}, {"paperId": "2e0fdafe8da5e2f94a1dff7c98188e0fcead4d9a", "title": "Multi3Generation 2023 Proceedings of the 1st International Workshop on Multilingual, Multimodal and Multitask Language Generation (Multi3Generation)"}, {"paperId": "860bafe8a3aa0e3a981951f0757996272276b54e", "title": "ALLURE: A Systematic Protocol for Auditing and Improving LLM-based Evaluation of Text using Iterative In-Context-Learning"}, {"paperId": "014f9a903edba91a4aca33e424db518cb85e2f9f", "title": "CEAN GPT: A L ARGE"}, {"paperId": "1f3d3aaa4e33aee616ee7fbf1bb7ad40ca7ff5f1", "title": "UniPredict: Large Language Models are Universal Tabular Predictors"}, {"paperId": "3d8c3cd49045e8310174146e571fae7092c7a770", "title": "Darbarer @ AutoMin2023: Transcription simplification for concise minute generation from multi-party conversations"}, {"paperId": "84dc889beff9d51fe429cff8c92735e7410ee3c2", "title": "Aligning Large Multi-Modal Model with Robust Instruction Tuning"}, {"paperId": "b9833a5354be3a0b137ee45a39abfb49b2612129", "title": "A Case-Based Reasoning Framework for Adaptive Prompting in Cross-Domain Text-to-SQL"}, {"paperId": "807825a2687e77bd446e0a9ee4e2ba239774b57f", "title": "Comparing the performance of ChatGPT and state-of-the-art climate NLP models on climate-related text classification tasks"}, {"paperId": "65d5728ea17f016382870aa27aac1e78d590b50c", "title": "HallusionBench: You See What You Think? Or You Think What You See? An Image-Context Reasoning Benchmark Challenging for GPT-4V(ision), LLaVA-1.5, and Other Multi-modality Models"}, {"paperId": "958acf773a4db15618059e7d65446c9e58d91be4", "title": "AUEB NLP Group at ImageCLEFmedical Caption 2023"}, {"paperId": "a128a81ffbd0a152fe3d46efbf4073114d999c86", "title": "Redco: A Lightweight Tool to Automate Distributed Training of LLMs on Any GPU/TPUs"}, {"paperId": "14e9f752dfabb8ce34e310ed26c26a3f72a00e74", "title": "Learning to Perturb for Contrastive Learning of Unsupervised Sentence Representations"}, {"paperId": "5ce94181ea702f69c3651dce721d6bd8026b8106", "title": "TPTU: Task Planning and Tool Usage of Large Language Model-based AI Agents"}, {"paperId": "c991124c08e3fcc926b83c58f8ab971ca500d031", "title": "Evaluating the Efficacy of Supervised Learning vs Large Language Models for Identifying Cognitive Distortions and Suicidal Risks in Chinese Social Media"}, {"paperId": "64a9a9f039a214ab99196745bc999f49a9f384ef", "title": "Team GPLSI at AuTexTification Shared Task: Determining the Authorship of a Text"}, {"paperId": "716350cc62eaf90f19d267e69a3303b5bcddaaed", "title": "Application and technology of an open source AI large language model in the medical field"}, {"paperId": "a74963fef5444af00568cafa8c412f95164359a0", "title": "Do We Need Subject Matter Experts? A Case Study of Measuring Up GPT-4 Against Scholars in Topic Evaluation"}, {"paperId": "2c62cbeafb8b97959987030bad9bc23205c622e2", "title": "Deep Representation Learning: Fundamentals, Technologies, Applications, and Open Challenges"}, {"paperId": "f0e48abb8c9f8791ebf77bda93c00af0ecb5962a", "title": "MediBioDeBERTa: Biomedical Language Model With Continuous Learning and Intermediate Fine-Tuning"}, {"paperId": "51338179edc9f361d709e253b52b0ee84f1dfdd6", "title": "Enhancing Scalability of Pre-trained Language Models via Efficient Parameter Sharing"}, {"paperId": "e7b7ba8689cd200083ac07c66e1898d71aff46b1", "title": "Large Language Model Assisted Software Engineering: Prospects, Challenges, and a Case Study"}, {"paperId": "c96b62643d08afa7cb852b7371c08ddc2a86b080", "title": "LAiW: A Chinese Legal Large Language Models Benchmark A Technical Report"}, {"paperId": "41c9455e4f01adc757269854575070a9c4c93ec7", "title": "Large Language Models for Telecom: The Next Big Thing?"}, {"paperId": "97ad59397f8efec65cd50785242913bf4614d981", "title": "Search-in-the-Chain: Towards Accurate, Credible and Traceable Large Language Models for Knowledge-intensive Tasks"}, {"paperId": "423aa4abe95d3ec5c32cfd5e79d8c56d8c8f685e", "title": "Intelligent Radar for Aragonese Tourism"}, {"paperId": "f141b8af2686afb53097fc8498988a8d9b86a6d4", "title": "On the benefits of optical disaggregated datacentre infrastructures for machine learning applications"}, {"paperId": "a353c64142ac4b9fb8c9a5b9466cf3a7fbb5ef6b", "title": "M-OFDFT: Overcoming the Barrier of Orbital-Free Density Functional Theory for Molecular Systems Using Deep Learning"}, {"paperId": "a700cea9ab4a42c0fe74ccc9a89cdafc23ba621c", "title": "Prompt-based Domain Discrimination for Multi-source Time Series Domain Adaptation"}, {"paperId": "201169e5b48383a0acbc115e81d30b09edac2604", "title": "On Incrementing Interpretability of Machine Learning Models from the Foundations: A Study on Syllabic Speech Units"}, {"paperId": "24de1048791bac4972ecc16d1c3c1de23691407d", "title": "Large Language Models: A Comprehensive Survey of its Applications, Challenges, Limitations, and Future Prospects"}, {"paperId": "6117fdc46b8af7e2165d663f4effd7ccd51f7128", "title": "The Ethical Concerns Surrounding GPT in Education"}, {"paperId": "a9c80674dfd5794393150c4a65dce760c8567e1e", "title": "A UTOMATICALLY E XTRACTING H ARDWARE D ESCRIPTIONS FROM PDF T ECHNICAL D OCUMENTATION"}, {"paperId": "1940b6824311eb32dfc5f8e1c0238c4ea5d37a38", "title": "Application of Large Language Models to DDoS Attack Detection"}, {"paperId": "2a7e434b0f8e92f698954de907ad023d658dcb29", "title": "Hype, Media Frenzy, and Mass Societal Hysteria: Perspectives on Human-imitative Intelligence"}, {"paperId": "b9b997baec9f7a93ba0564930be5e7f9b581f725", "title": "The new reality of education in the face of advances in generative artificial intelligence"}, {"paperId": "22986a1ba2f3c409e860fd835fadb3d2541b4113", "title": "Speculative Behavior: An Approach to Large Language Model Evaluation and Optimization"}, {"paperId": "f0f9696e9c025f1abb179123e40c3643394d1007", "title": "Master Computer Science Resource-constrained Neural Architecture Search on DistilBERT for the task of question-answering"}, {"paperId": "3a72a59baade99d62043996f763a9a2441ee60b6", "title": "Large Language Models in Cryptocurrency Securities Cases: Can a GPT Model Meaningfully Assist Lawyers?"}, {"paperId": "70cb08ee42867aa3a7983d75bbb4105252a9c1cf", "title": "ASMR: Augmenting Life Scenario using Large Generative Models for Robotic Action Reflection"}, {"paperId": "81a88b47207e5a216a031ec59941c647ecd01221", "title": "LLM-R EC : P ERSONALIZED R ECOMMENDATION VIA P"}, {"paperId": "c9374f79c82dc5276df57a70b1b4e0d1bc9cdbae", "title": "Exploring the Complexities of AI-Mediated Communication and Human-Machine Interaction"}, {"paperId": "3339e839fed5be63a5254be0d6d139024e204c30", "title": "How Do Large Language Models (LLMs) Impact Document Image Analysis? An Open Discussion."}, {"paperId": "053529283167c72e61dbc257ee541f9fef27beed", "title": "Experimenting Task-specific LLMs"}, {"paperId": "39973a5af8b509c84f73a4a9e5b540f8886d3a5d", "title": "A framework for an AI pipeline for borehole data"}, {"paperId": "c05c6779e027c6bbfb2e5081deb34dae3c797829", "title": "Yilmaz & Can: Unveiling Shadows: Harnessing Artificial Intelligence for Insider Threat Detection Unveiling Shadows: Harnessing Artificial Intelligence for Insider Threat Detection"}]}
