{"paperId": "c6231bb422f72d414ae00df8917a87fe9ad0a5ae", "publicationVenue": {"id": "42988d8c-8c15-47d4-94a9-363d991a6f04", "name": "Revista de Gestão Social e Ambiental", "alternate_names": ["Rev Gest Soc Ambient"], "issn": "1981-982X", "url": "https://rgsa.emnuvens.com.br/rgsa/index"}, "title": "A Systematic Review of The Literature on Humanitarian Logistics Using Multimethod Analysis", "abstract": "Objective: The main objective of this study was to identify research on Humanitarian Logistics (HL) and demonstrate the development of the research field through multimethod analysis with the purpose of providing a comprehensive understanding of the study area and identifying research trends that have not been previously observed. \n  \nTheoretical Framework: The study was based on the literature addressing Humanitarian Logistics. \n  \nMethod: A bibliometric analysis was conducted through the application of multimethods, encompassing: i) keyword analysis; ii) examination of the productivity of leading authors over time; iii) bibliographic coupling; iv) co-citation analysis; and v) network analysis. \nResults and Conclusion: The results evidenced a growing trend in research on Humanitarian Logistics (HL), and it was possible to identify the emergence of research subfields within HL focusing on innovation, big data, computational simulation, and decision systems in the humanitarian logistics chain. \n  \nImplications of the research: The study contributed to the understanding of the development of research on humanitarian logistics and provides a comprehensive overview of the subject through metrics that allow the identification of the evolution and trends in the research field. \n  \nOriginality/Value: The study extrapolates the application of a single literature review method and employs multimethods to assess and present the development of the field. It contributes to an overarching view of the research domain, serving as a guiding framework for the advancement of future investigations.", "venue": "Revista de Gestão Social e Ambiental", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2024-01-29", "journal": {"name": "Revista de Gestão Social e Ambiental"}, "authors": [{"authorId": "2260651750", "name": "João César de Souza Ferreira"}, {"authorId": "2281997178", "name": "Pedro Henrique Pereira Dos Santos"}], "citations": []}
