{"paperId": "c635a498f3dddb5d040f23772064b6c91af60398", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Neural Network Embeddings for Test Case Prioritization", "abstract": "In modern software engineering, Continuous Integration (CI) has become an indispensable step towards systematically managing the life cycles of software development. Large companies struggle with keeping the pipeline updated and operational, in useful time, due to the large amount of changes and addition of features, that build on top of each other and have several developers, working on different platforms. Associated with such software changes, there is always a strong component of Testing. As teams and projects grow, exhaustive testing quickly becomes inhibitive, becoming adamant to select the most relevant test cases earlier, without compromising software quality. We have developed a new tool called Neural Network Embeeding for Test Case Prioritization (NNE-TCP) is a novel Machine-Learning (ML) framework that analyses which files were modified when there was a test status transition and learns relationships between these files and tests by mapping them into multidimensional vectors and grouping them by similarity. When new changes are made, tests that are more likely to be linked to the files modified are prioritized, reducing the resources needed to find newly introduced faults. Furthermore, NNE-TCP enables entity visualization in low-dimensional space, allowing for other manners of grouping files and tests by similarity and to reduce redundancies. By applying NNE-TCP, we show for the first time that the connection between modified files and tests is relevant and competitive relative to other traditional methods.", "venue": "arXiv.org", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-12-18", "journal": {"name": "ArXiv", "volume": "abs/2012.10154"}, "authors": [{"authorId": "151055227", "name": "J. Lousada"}, {"authorId": "2067586895", "name": "Miguel Ribeiro"}], "citations": [{"paperId": "cf318a978206d01ab0efde0b060c7fd1c18a2fb1", "title": "TCP-Net++: Test Case Prioritization Using End-to-End Deep Neural Networks - Deployment Analysis and Enhancements"}, {"paperId": "a7a9d0ec9a22d7598792485528663a66fe15cb9b", "title": "A review paper: optimal test cases for regression testing using artificial intelligent techniques"}, {"paperId": "795dc16672cfa04729ce9bbc61c893d588e48dc7", "title": "TCP-Net: Test Case Prioritization using End-to-End Deep Neural Networks"}, {"paperId": "0775ba02351c16914cbca7ad3a395a9fca94bb0b", "title": "International Journal of Electrical and Computer Engineering (IJECE)"}, {"paperId": "78192fe077eaad20e6cf856de3e77f63b5766b4c", "title": "Adaptive Reward Computation in Reinforcement Learning-Based Continuous Integration Testing"}, {"paperId": "e1c9ec3ef33448c72f6f3a88e995a310c002481f", "title": "Trend Application of Machine Learning in Test Case Prioritization: A Review on Techniques"}]}
