{"paperId": "c6387a5ab1a80b9a5ea30272969bde9c73110512", "publicationVenue": {"id": "04c27a39-9b93-4b31-961a-c38ec6b40bbc", "name": "IEEE Annual Information Technology, Electronics and Mobile Communication Conference", "type": "conference", "alternate_names": ["IEEE Annu Inf Technol Electron Mob Commun Conf", "Int Conf Workshop Comput Commun", "IEMCON", "International Conference and Workshop on Computing and Communication"]}, "title": "An Adapter for IBM Streams and Apache Spark to Facilitate Multi-level Data Analytics", "abstract": "Data analytics with unsupervised clustering of data streams has provided revolutionary breakthroughs in fields like healthcare, and E-commerce. IBM Streams and Apache Spark are among the most useful and popular data analytics tools that help engineers and researchers extend the abilities to store, analyze, transform, and visualize data for business use. IBM Streams is capable of ingesting, filtering, analyzing, and associating massive volumes of continuous data streams and the Streams Processing Language (SPL) enables coding custom stream graphs to process data and handle real-time events. Apache Spark has unified analytics edge for large scale data processing with high performance for both batch and streaming data. We developed adapters without using third party tools to facilitate data transfer between IBM Streams and Apache Spark to support new and legacy data analytic systems. An example use case would be IBM Streams ingesting and processing realtime data streams, and then passing the data to Spark to train or update machine learning algorithms in real time that can be re-deployed in the IBM Streams data processing pipeline. This paper provides an overview of the structure of the data processing pipeline, describes the implementation details and the principle behind the design.", "venue": "IEEE Annual Information Technology, Electronics and Mobile Communication Conference", "year": 2020, "fieldsOfStudy": null, "publicationTypes": ["Conference", "Review"], "publicationDate": "2020-11-04", "journal": {"name": "2020 11th IEEE Annual Information Technology, Electronics and Mobile Communication Conference (IEMCON)", "pages": "0230-0235"}, "authors": [{"authorId": "2041260348", "name": "Yinchen Shi"}, {"authorId": "36835448", "name": "Sazia Mahfuz"}, {"authorId": "1717045", "name": "F. Zulkernine"}, {"authorId": "2070192309", "name": "Peter Nicholls"}], "citations": []}
