{"paperId": "c63c19105f93b3ef3d02d1fc614023b00fa23e45", "publicationVenue": {"id": "255a371e-2a0c-42d1-b4e7-c3cf3e21c89a", "name": "International Conference on Advances in Social Networks Analysis and Mining", "type": "conference", "alternate_names": ["Advances in Social Networks Analysis and Mining", "Int Conf Adv Soc Netw Anal Min", "ASONAM", "Adv Soc Netw Anal Min"], "url": "http://www.wikicfp.com/cfp/program?id=239"}, "title": "A mathematical model for friend discovery from dynamic social graphs", "abstract": "Nowadays, social networking is popular. As such, numerous social networking sites (e.g., Facebook, YouTube, Instagram) are generating very large volumes of social data rapidly. Valuable knowledge and information is embedded into these big social data, and is awaiting to be analyzed and mined via social network analysis and mining. In general, social networks can be represented as graphs. Because of the dynamic nature of social networking, edges and/or vertices keep adding to (or deleting from) the graphs. We present in this paper a mathematical model for friend discovery from dynamic social graphs. In particular, we focus on both linear algebra and graph theory approaches to discover interesting social entities---such as active followers---from dynamic social networks represented as dynamic directional social graphs.", "venue": "International Conference on Advances in Social Networks Analysis and Mining", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2021-11-08", "journal": {"name": "Proceedings of the 2021 IEEE/ACM International Conference on Advances in Social Networks Analysis and Mining"}, "authors": [{"authorId": "1726081", "name": "C. Leung"}, {"authorId": "113805582", "name": "S. Singh"}], "citations": [{"paperId": "19bd9edb52d7046b57ed58930c3496477e4884a6", "title": "Personalized privacy-preserving semi-centralized recommendation system in a social network"}, {"paperId": "f6e98933b402830441a999ee3e280727ed9179c0", "title": "Social network mining and analytics for quantitative patterns"}, {"paperId": "e8b4a0d4f5212bf51f6bc72b47aa6fb2b5d4b36a", "title": "A Big Data Science Solution for Transportation Analytics with Meteorological Data"}, {"paperId": "2d0a643701b63e060dc181f12b01be2900e7f13e", "title": "Trustworthy Explanations for Knowledge Discovered from E-Health Records"}, {"paperId": "e1abde48eb0d0477e7c367ed101aec5076c2889b", "title": "A Deep Learning Based Predictive Model for Healthcare Analytics"}, {"paperId": "b38235fd1746be6d89d10960549f2c78a9d263fb", "title": "Towards Trustworthy Artificial Intelligence in Healthcare"}]}
