{"paperId": "c64655d0f667e256123b7860cc7a0e2ce2680988", "publicationVenue": null, "title": "Inferring Workflows with Job Dependencies from Distributed Processing Systems Logs", "abstract": "We consider the problem of evaluating new improvements to distributed processing platforms like Spark and Hadoop. One approach commonly used when evaluating these systems is to use workloads published by companies with large data clusters, like Google and Facebook. These evaluations seek to demonstrate the benefits of improvements to critical framework components like the job scheduler, under realistic workloads. However, published workloads typically do not contain information on dependencies between the jobs. This is problematic, as ignoring dependencies could lead to significantly misestimating the speedup obtained from a particular improvement. In this position paper, we discuss why it is important to include job dependency information when evaluating distributed processing frameworks, and show that workflow mining techniques can be used to obtain dependencies from job traces that lack them. As a proof-of-concept, we show that the proposed methodology is able to find workflows in traces published by Google.", "venue": "2017 IEEE 15th Intl Conf on Dependable, Autonomic and Secure Computing, 15th Intl Conf on Pervasive Intelligence and Computing, 3rd Intl Conf on Big Data Intelligence and Computing and Cyber Science and Technology Congress(DASC/PiCom/DataCom/CyberSciTech)", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2017-11-01", "journal": {"name": "2017 IEEE 15th Intl Conf on Dependable, Autonomic and Secure Computing, 15th Intl Conf on Pervasive Intelligence and Computing, 3rd Intl Conf on Big Data Intelligence and Computing and Cyber Science and Technology Congress(DASC/PiCom/DataCom/CyberSciTech)", "pages": "1025-1030"}, "authors": [{"authorId": "2372502", "name": "Gladys Carrillo"}, {"authorId": "2004049", "name": "Cristina L. Abad"}], "citations": [{"paperId": "01f6f821e9e46558952cf947bac760265a1867f4", "title": "Udon: Efficient Debugging of User-Defined Functions in Big Data Systems with Line-by-Line Control"}, {"paperId": "583612da73374017f8572ad02822df75d7a6cb6f", "title": "A survey on event connections and their discovery for cloud service"}, {"paperId": "1cd270bff29951be07635c3f393e3b017f7cfad2", "title": "A Survey of Data Mining Activities in Distributed Systems"}]}
