{"paperId": "c6567ffe7c8a25539a398a65506115b8b02edb82", "publicationVenue": null, "title": "Learning analytics for student academic tracking, a comparison between Analytics Graphs and Edwiser Reports", "abstract": "This work presents a proposal for the progressive use of different methodologies and analytical learning techniques, using two tools available on the Moodle platform. To increase students' retentiveness and to analyze each participant’s progress and performance trends are the challenges that Big Data era allows us thanks to data analysis. By closely monitoring student learning and perseverance, it is possible to identify the factors that make them continue with their studies or drop out and thus be able to build predictive models for decision-making. The objective of this work is to show significant changes in the educational processes of student groups that allow teachers to validate, supervise and redirect detailed and specific information through learning analytics with tools available for virtual learning environments, thereby mitigating the risk of loss or desertion.", "venue": "2021 Second International Conference on Information Systems and Software Technologies (ICI2ST)", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2021-03-01", "journal": {"name": "2021 Second International Conference on Information Systems and Software Technologies (ICI2ST)", "pages": "101-107"}, "authors": [{"authorId": "117377825", "name": "Joe Llerena-Izquierdo"}, {"authorId": "2110292119", "name": "Nohely Álava-Morán"}, {"authorId": "2057558052", "name": "Jonathan Zamora-Galindo"}], "citations": [{"paperId": "aa5e6026ff26ac4ac029436b34644049fe1d8c38", "title": "A Learning Resource Management Model for high-enrollment Programming courses in Engineering"}, {"paperId": "a301fed1c7d5dda63801a54f4c698efe6d292516", "title": "B-LEARNING AND MOODLE AS A STRATEGY INHIGHER EDUCATION: CHALLENGES AND OPPORTUNITIES FOR IMPROVEMENT"}]}
