{"paperId": "c65ffade31e23d2415d749e69e606351f7682b9b", "publicationVenue": {"id": "a5a46cd2-2c5d-49d9-bf75-413ae628ae71", "name": "Journal of Yasar University", "type": "journal", "alternate_names": ["Journal of Yaşar University", "J Yasar Univ", "J Yaşar Univ"], "issn": "1305-970X", "url": "https://journal.yasar.edu.tr/en/"}, "title": "Clustering of Developing Countries in Terms of Logistics Market Development with Fuzzy Clustering and Discriminant Analysis", "abstract": "Logistics performance indicators are important in determining the market development levels of countries. Especially the logistics markets of developing countries play an active role in increasing the country's economy and trade volumes. In this research, it is aimed to cluster the developing countries according to their level of logistics market development in 2022. For this reason, fuzzy clustering and discriminant analyzes have been applied in the research. The sample area of the study consists of 50 developing countries. The data of the research have been taken from The Agility Emerging Markets Logistics Index reports. The research has been carried out in two phases. In the first phase, developing countries are classified by fuzzy cluster analysis. According to the analysis findings, 2 clusters have been obtained as high and low logistics market development cluster. In the second phase, discriminant analysis has been conducted to test the cluster membership of clustered countries. According to the discriminant analysis findings, all cluster memberships have been confirmed. As a result of the research, the cluster membership status of the developing countries and cluster centers according to the variables have been determined and the obtained implications have been presented.", "venue": "Journal of Yasar University", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-02-03", "journal": {"name": "Journal of Yaşar University"}, "authors": [{"authorId": "2064956452", "name": "Karahan Kara"}], "citations": []}
