{"paperId": "c66b4f762f94b8d3532f532a401c67c2d35e2546", "publicationVenue": {"id": "bdc2e585-4e48-4e36-8af1-6d859763d405", "name": "AAAI Conference on Artificial Intelligence", "type": "conference", "alternate_names": ["National Conference on Artificial Intelligence", "National Conf Artif Intell", "AAAI Conf Artif Intell", "AAAI"], "url": "http://www.aaai.org/"}, "title": "Personalized Dialogue Generation with Persona-Adaptive Attention", "abstract": "Persona-based dialogue systems aim to generate consistent responses based on historical context and predefined persona. Unlike conventional dialogue generation, the persona-based dialogue needs to consider both dialogue context and persona, posing a challenge for coherent training. Specifically, this requires a delicate weight balance between context and persona. To achieve that, in this paper, we propose an effective framework with Persona-Adaptive Attention (PAA), which adaptively integrates the weights from the persona and context information via our designed attention. In addition, a dynamic masking mechanism is applied to the PAA to not only drop redundant information in context and persona but also serve as a regularization mechanism to avoid overfitting. Experimental results demonstrate the superiority of the proposed PAA framework compared to the strong baselines in both automatic and human evaluation. Moreover, the proposed PAA approach can perform equivalently well in a low-resource regime compared to models trained in a full-data setting, which achieve a similar result with only 20% to 30% of data compared to the larger models trained in the full-data setting. To fully exploit the effectiveness of our design, we designed several variants for handling the weighted information in different ways, showing the necessity and sufficiency of our weighting and masking designs.", "venue": "AAAI Conference on Artificial Intelligence", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-10-27", "journal": {"name": "ArXiv", "volume": "abs/2210.15088"}, "authors": [{"authorId": "2110992465", "name": "Qiushi Huang"}, {"authorId": null, "name": "Yu Zhang"}, {"authorId": "3023507", "name": "Tom Ko"}, {"authorId": "2110814131", "name": "Xubo Liu"}, {"authorId": "49814531", "name": "Boyong Wu"}, {"authorId": "144144027", "name": "Wenwu Wang"}, {"authorId": "2189113746", "name": "Lilian Tang"}], "citations": [{"paperId": "5678a1ee9d5542785115555b856e51a1dd9eb0e9", "title": "\"In Dialogues We Learn\": Towards Personalized Dialogue Without Pre-defined Profiles through In-Dialogue Learning"}, {"paperId": "86b488a19f12888d707ae8895be0703a69480c2f", "title": "Crafting a Good Prompt or Providing Exemplary Dialogues? A Study of In-Context Learning for Persona-based Dialogue Generation"}, {"paperId": "72ac66485c80cd640c02756b15a5c2ab75716242", "title": "K-PERM: Personalized Response Generation Using Dynamic Knowledge Retrieval and Persona-Adaptive Queries"}, {"paperId": "1ed34439ac8fb124c2a3c37e073519386a6c2ed0", "title": "Based on Text Augmentation Personalized Dialog Generation With Persona-Sparse Data"}, {"paperId": "b3735b8014ed455fb40aa5030ab9bc0da25c4ae1", "title": "Response Generation in Longitudinal Dialogues: Which Knowledge Representation Helps?"}, {"paperId": "2b6e41761ac23c106963677304a899a57c7d75e0", "title": "Visually-Aware Audio Captioning With Adaptive Audio-Visual Attention"}, {"paperId": "a2c4ab0c2ed35f2e94738aa11d16eb8629b9a9e5", "title": "K-PERM: Personalized Response Generation Using Dynamic K-PERM: Personalized Response Generation Using Dynamic Knowledge Retrieval and Persona-Adaptive Queries Knowledge Retrieval and Persona-Adaptive Queries"}]}
