{"paperId": "c67f42bb5e28154a923da4bf1fa037dbdfd34922", "publicationVenue": {"id": "d2e111a6-dd60-474c-ae8a-2b5773cca07d", "name": "International Conference on Parallel and Distributed Systems", "type": "conference", "alternate_names": ["Int Conf Parallel Distrib Syst", "ICPADS"], "url": "http://www.wikicfp.com/cfp/program?id=1443"}, "title": "Efficient Data Blocking and Skipping Framework Applying Heuristic Rules", "abstract": "Data blocking has been an effective technique of data skipping to reduce data access and shorten query response time in query engines. By generating fine-grained, balanced blocks and corresponding metadata, a query may skip a block if the metadata indicates that the block does not contain relevant data. Obviously, the deciding factor of a promising blocking strategy depends on how to produce effective data layout in reasonable time that is expected to skip most data. In this paper, we propose several algorithms that drastically reduce the time complexity of existent blocking strategies based on workload analysis, at the cost of relatively small loss of estimated tuples could be skipped. Via theoretical analysis, we prove that the time complexity of our algorithms is apparently lower than that of ward algorithm. Afterwards, we demonstrate the whole blocking and skipping workflow, install it into Spark SQL and obtain experimental evaluation results. Experimental results show that our technique gains significant improvement in aspect of blocking efficiency compared to ward algorithm, while keeping almost the same level of skipping ability.", "venue": "International Conference on Parallel and Distributed Systems", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2017-12-01", "journal": {"name": "2017 IEEE 23rd International Conference on Parallel and Distributed Systems (ICPADS)", "pages": "206-214"}, "authors": [{"authorId": "2153952548", "name": "Yong Wang"}, {"authorId": "2067242918", "name": "Xiao-chun Yun"}, {"authorId": "2108251407", "name": "Xi Wang"}, {"authorId": "1788327", "name": "Shupeng Wang"}, {"authorId": "46220632", "name": "Yongshang Wu"}], "citations": []}
