{"paperId": "c69538e149f1d981547abf7bff365c0b963130a2", "publicationVenue": {"id": "b4e3823a-0399-4dd3-9c4a-4d71630488df", "name": "Conference on Software Engineering Education and Training", "type": "conference", "alternate_names": ["CSEE&T", "Conf Softw Eng Educ Train"]}, "title": "An Educational Platform for Automotive Software Development and Test", "abstract": "Software development in the automotive domain has been subject to changing and evolving processes for the last 15 years. As a result, the functionality of a vehicle is now developed independently of the target platform and communication technology. The actual mapping constraints to a hardware platform are then represented by a large parameter set stored in a configuration. This paradigm has spawned a heterogeneous tool environment for development of electronic control units (ECUs). On the one hand, this proceeding facilitates the development of reusable vehicle functions but on the other hand increases the difficulty for testing as well as error localization in the actual end system. The architecture of choice for platform independent ECU development in the automotive industry in Europe is AUTOSAR, which is in itself very complex but essential for automotive software developers. This makes it vital that students and junior developers of automotive software engineering can be trained in a fast and concise, industry-oriented way. In this paper, we present an educational concept which focuses on the inter-connections between different development and test phases in the automotive industry. It is mainly realized around two self-developed tools, which support learners and power a learning management system, all backed by an extensive AUTOSAR knowledge base. This system eases the learning and comprehension of automotive software development and test by hands-on-learning for both students and professional developers.", "venue": "Conference on Software Engineering Education and Training", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-11-01", "journal": {"name": "2020 IEEE 32nd Conference on Software Engineering Education and Training (CSEE&T)", "pages": "1-4"}, "authors": [{"authorId": "2072792", "name": "N. Englisch"}, {"authorId": "9300490", "name": "René Bergelt"}, {"authorId": "1762247", "name": "W. Hardt"}], "citations": [{"paperId": "46d38c8245ad0474c0124f2ed29f6c924d614f96", "title": "Poster: Efficient Exploration of Automotive Ranging Sensor Attacks"}, {"paperId": "6a4199fa1b536fd1e70b0375d0319375a6d39385", "title": "Towards Collection of Smart City Data for Cloud Storage Using UAVs"}, {"paperId": "80aaac2822159549d16c8b1211e9ee2d1151f2f8", "title": "Automated Evaluation of Smart City Data from Cloud-System"}]}
