{"paperId": "c69b050b2af3fb033500ea2ee199ff1cdff5cd97", "publicationVenue": {"id": "bb21160f-0f31-4e34-abab-715b95a870a2", "name": "Indonesian Journal of Electrical Engineering and Computer Science", "type": "journal", "alternate_names": ["Indones J Electr Eng Comput Sci"], "issn": "2502-4752", "url": "http://www.iaescore.com/journals/index.php/IJEECS"}, "title": "Business intelligence addressing service quality for big data analytics in public sector", "abstract": "With the inauguration of Big Data Analytics initiative nationally, many nations have participated and paved way for BDA ecosystem. The initiative is a catalyst to further encourage economic growth in Public Sectors. Some of the common key deliverables identified are increasing productivity involving information communications technology, cost savings, shared benefits, and encourage innovation. The objectives can be further elaborated by driving big data analytics demands in various public sectors agency, adopting big data analytics framework supporting the building of big data industry. This has encouraged talents and startup companies inspiring their capabilities by developing various technology platform, collaborate and innovate amongst public and private sectors, and further strengthen data governance by creating policy and procedures. With the establishment of big data analytics framework, performance measurement can be enforced effortlessly using the principles of business intelligence maturity model and the technological stack comes with it. Various data sources can be used to benchmark service quality using advanced analytics and data science techniques.", "venue": "Indonesian Journal of Electrical Engineering and Computer Science", "year": 2019, "fieldsOfStudy": ["Business"], "publicationTypes": null, "publicationDate": "2019-10-01", "journal": {"name": "Indonesian Journal of Electrical Engineering and Computer Science"}, "authors": [{"authorId": "102025325", "name": "Sadesh Manikam"}, {"authorId": "9283641", "name": "S. Sahibudin"}, {"authorId": "26919768", "name": "Vinothini Kasinathan"}], "citations": [{"paperId": "9832efe9962d731660e01f97c869e61c2290f60b", "title": "An effective classification approach for big data with parallel generalized Hebbian algorithm"}, {"paperId": "3cb7ed79a50723133fedcfbfbcb78a88a72972ad", "title": "Development of a model for evaluating the effectiveness of innovative startups based on information cycles and using neural networks"}, {"paperId": "77e9444ea695f7c82b1e33da621a5731fbf90b34", "title": "Listening to the voice of the guest: A framework to improve decision-making processes with text data"}, {"paperId": "9b6cfecb21c54e5f7af8ff551054b958641d15e5", "title": "The effect of a SECoS in crude palm oil forecasting to improve business intelligence"}, {"paperId": "db05b6d4d268b943a38f2dc5ee29323d41b6d3f8", "title": "Systematic mapping study of economic and business models of cloud services"}, {"paperId": "bd24960802aa638eef329b71d61784dbd67defb5", "title": "Big Data Quality Models: A Systematic Mapping Study"}]}
