{"paperId": "c6b8f30299e2ca3216d0df0653cdf93599f10e8a", "publicationVenue": {"id": "8f0f5460-2391-4d75-ae39-d9b233b91e0a", "name": "Annual Haifa Experimental Systems Conference", "type": "conference", "alternate_names": ["Haifa Experimental Systems Conference", "SYSTOR", "ACM Int Conf Syst Storage", "Annu Haifa Exp Syst Conf", "ACM International Conference on Systems and Storage", "Haifa Exp Syst Conf"]}, "title": "Jumpgate: automating integration of network connected accelerators", "abstract": "Network-connected accelerators (NCA), such as programmable switches, ASICs, and FPGAs can speed up operations in data analytics. But so far, integration of NCAs into data analytics systems required manual effort. We present Jumpgate, a system that simplifies integration of existing NCA code into data analytics systems, such as Apache Spark or Presto. Jumpgate places most of the integration code into the analytics system, which needs to be written once, leaving NCA programmers to write only a couple hundred lines of code to integrate new NCAs. Jumpgate relies on dataflow graphs that most analytics systems use internally, and takes care of the invocation of NCAs, the necessary format conversion, and orchestration of their execution via novel staged network pipelines. Our implementation of Jumpgate in Apache Spark made it possible, for the first time, to study the benefits and drawbacks of using NCAs across the entire range of queries in the TPC-DS benchmark. Since we lack hardware that can accelerate all analytics operations, we implemented NCAs in software. We report on how and when analytics workloads will benefit from NCAs to motivate future designs.", "venue": "Annual Haifa Experimental Systems Conference", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2021-06-14", "journal": {"name": "Proceedings of the 14th ACM International Conference on Systems and Storage"}, "authors": [{"authorId": "3100691", "name": "Craig Mustard"}, {"authorId": "2057896934", "name": "Swati Goswami"}, {"authorId": "2100171349", "name": "Niloofar Gharavi"}, {"authorId": "3054968", "name": "J. Nider"}, {"authorId": "2637596", "name": "Ivan Beschastnikh"}, {"authorId": "1679976", "name": "Alexandra Fedorova"}], "citations": [{"paperId": "99fbad8d8c46be75fa2d0c326e8f7ae491dfe582", "title": "Towards Accelerating Data Intensive Application's Shuffle Process Using SmartNICs"}]}
