{"paperId": "c6b97a8e2664b1d9c6fe08e0ba9a3fca28e3078a", "publicationVenue": {"id": "3096eb5c-d18c-4877-94cd-28edd3a9c357", "name": "International Journal of Environmental Research and Public Health", "type": "journal", "alternate_names": ["Int J Environ Res Public Health"], "issn": "1660-4601", "url": "http://www.mdpi.com/journal/ijerph/"}, "title": "A Bibliometric Analysis of the Scientific Research on Artisanal and Small-Scale Mining", "abstract": "Mineral resource exploitation is one of the activities that contribute to economic growth and the development of society. Artisanal and small-scale mining (ASM) is one of these activities. Unfortunately, there is no clear consensus to define ASM. However, its importance is relevant in that it represents, in some cases, the only employment alternative for millions of people, although it also significantly impacts the environment. This work aims to investigate the scientific information related to ASM through a bibliometric analysis and, in addition, to define the new lines that are tending to this field. The study comprises three phases of work: (i) data collection, (ii) data processing and software selection, and (iii) data interpretation. The results reflect that the study on ASM developed intensively from 2010 to the present. In general terms, the research addressed focuses on four interrelated lines: (i) social conditioning factors of ASM, (ii) environmental impacts generated by ASM, (iii) mercury contamination and its implication on health and the environment, and (iv) ASM as a livelihood. The work also defines that geotourism in artisanal mining areas is a significant trend of the last decade, explicitly focusing on the conservation and use of the geological and mining heritage and, in addition, the promotion of sustainable development of ASM.", "venue": "International Journal of Environmental Research and Public Health", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2022-07-01", "journal": {"name": "International Journal of Environmental Research and Public Health", "volume": "19"}, "authors": [{"authorId": "1658919629", "name": "Fernando Morante-Carballo"}, {"authorId": "1416990188", "name": "Nestor Montalvan-Burbano"}, {"authorId": "1659154404", "name": "Maribel Aguilar-Aguilar"}, {"authorId": "1422634359", "name": "P. Carrión-Mero"}], "citations": [{"paperId": "964ba106ea686ab601614b8e58c5cb603fbb3337", "title": "Constructing alternative interpretation: Embeddedness of illegality in small-scale mining"}, {"paperId": "4d85cd122eec8b304d77306e01e43a141debd9f4", "title": "Application of Geomechanical Classification Systems in a Tourist Mine for Establishing Strategies within 3G’s Model"}, {"paperId": "da64661cdb3977329f15314819634b30e2d34a56", "title": "Bibliometic Insights Into Agriculture And Artisanal Mining In Rural Communities"}, {"paperId": "021195d7cb551a29c37bcc71325c9b8022354a00", "title": "Assessing the knowledge and practices of occupational safety and health in the artisanal and small-scale gold mining sector of Ghana: A case of obuasi"}, {"paperId": "632017c3b7a4c82abc1635f9a805e64b8c2200a8", "title": "What Do We Know about Water Scarcity in Semi-Arid Zones? A Global Analysis and Research Trends"}, {"paperId": "740f710f7449bb54b5546b30612cfc5fefaa31ee", "title": "A Bibliometric Analysis of World Issues—Social, Political, Economic, and Environmental Dimensions"}, {"paperId": "9b31a9288bb5d0fd9d50ffc6aefc49a70db9c382", "title": "Exploring Iron Oxide's Role in Hydrogen Production: Bibliographic and Bibliometric Analysis"}]}
