{"paperId": "c6bde4d6eacdd248b23abe41103e8f5497474b43", "publicationVenue": null, "title": "An Adoptive Heart Disease Prediction Model using Machine Learning Approach", "abstract": "Cardiovascular disease also known as heart disease is commonly found among all the ages since many years. Prediction of this disease has become a critical task in the field of medical analysis. As there is a significant improvement in the health industry but early prediction is necessary rather than making it worse and it's important to identify at the earlier stages. Recent studies reflect the use of hybrid approaches subjected to machine learning and deep learning techniques based on sensing technology in numerous applications, mainly involving complex tasks such as the collection of patient data and transforming them into Electronic Health Records (EHR). In this paper, we present a ranking-based intelligent feature selection method for identifying the optimal set of features for developing an adoptive model. The predictive classifier used to construct the model is a clustering-based Support Vector Machine (SVM) for the prediction of heart disease.", "venue": "2022 OITS International Conference on Information Technology (OCIT)", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-12-01", "journal": {"name": "2022 OITS International Conference on Information Technology (OCIT)", "pages": "49-54"}, "authors": [{"authorId": "2285245419", "name": "Chaitanya Datta M"}, {"authorId": "52132601", "name": "Rajiv Senapati"}], "citations": [{"paperId": "529da938193c9ce759e2fe7ac6a2189eaacae613", "title": "An Improved Cardiovascular Disease Prediction Model Using Ensembling of Diverse Machine Learning Classifiers"}, {"paperId": "20ef08a931a2c8ff763e0183abad1ee9d5fb6725", "title": "Image Stitching using RANSAC and Bayesian Refinement"}, {"paperId": "79aa9bfe53c5674cc38b66a35b81b6ab2caa58b1", "title": "Novel Distributed Architecture for Frequent Pattern Mining using Spark Framework"}, {"paperId": "3e711d906fe75a2842e4d715b801ff7980439e3f", "title": "A Generalized Grayscale Image Processing Framework for Retinal Fundus Images"}]}
