{"paperId": "c6c5effbb349da454a1d0ba8e694692a65eb93ce", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Graph Analytics on Manycore Memory Systems", "abstract": "Graphs are ubiquitous, and graph analytics has been widely adopted in many big data applications such as social computation and natural language processing, as well as web-search and recommendation systems. Prior research focuses on processing large-scale graphs on distributed environments or a single multi-core machine with several terabytes of RAM. Increasing complex memory systems and on-chip interconnects are developed to mitigate the data movement bottlenecks in manycore processors such as Xeon Phi KNL CPU with heterogeneous memory, with up to 72 dual-core tiles. This paper presents a detailed study on the characteristics of manycore memory systems and their impact on the efficiency of graph analytics. Based on this paper, we introduce Ants, the first graph analytics platform on manycore memory systems. First, Ants differentially allocates graph data according to their access patterns and the behavior of heterogeneous memory. Second, to reduce excessive memory access and ease congestion on interconnects and memory controllers, Ants develops a fine-grained and effective task partitioning strategy for many cores. A detailed experiment on a 64 dual-core tile machine shows that Ants outperforms the state-of-the-art graph analytics platform-Ligra by up to 8.97X for real-world graphs.", "venue": "IEEE Access", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "51429-51439", "volume": "6"}, "authors": [{"authorId": "2130399", "name": "Yuxuan Xing"}, {"authorId": "7711823", "name": "Zhiguang Chen"}, {"authorId": "1730284", "name": "Nong Xiao"}, {"authorId": "1713096", "name": "Fang Liu"}, {"authorId": "35150586", "name": "Yutong Lu"}], "citations": [{"paperId": "b70ee64f5f4dc6add2179720b6bd17d3155990be", "title": "Transparent many‐core partitioning for high‐performance big data I/O"}, {"paperId": "f4f07ce7de90e1f34f8636764e128c920a30e994", "title": "Graph Computing Systems and Partitioning Techniques: A Survey"}]}
