{"paperId": "c6dd414648a29f368c1e9a35963156e5cffe4dfb", "publicationVenue": {"id": "7c539343-bf1b-42ab-a5ee-acc958da6743", "name": "IEEE Open Journal of Intelligent Transportation Systems", "type": "journal", "alternate_names": ["IEEE Open J Intell Transp Syst"], "issn": "2687-7813", "url": "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=8784355"}, "title": "Improving the Prediction of Passenger Numbers in Public Transit Networks by Combining Short-Term Forecasts With Real-Time Occupancy Data", "abstract": "Passengers of public transportation nowadays expect reliable and accurate travel information. The need for occupancy information is becoming more prevalent in intelligent public transport systems as people started avoiding overcrowded vehicles during the COVID-19 pandemic. Furthermore, public transportation companies require accurate occupancy forecasts to improve service quality. We present a novel approach to improve the prediction of passenger numbers that enhances a day-ahead prediction with real-time data. We first train a baseline predictor on historical automatic passenger counting data. Next, we train a real-time model on the deviations between baseline prediction and observed values, thus capturing events not addressed by the baseline. For the forecast, we attempt to detect emerging patterns in real time and adjust the baseline prediction with deviations from the patterns. Our experiments with data from Germany show that the proposed model improves the forecast of the baseline model and is only outperformed by artificial neural networks in some instances. If the training sets only cover a limited period of up to four months, our approach outperforms competing methods. For larger training sets, there are mixed results in the sense that for some test cases, certain types of neural networks yield slightly better results, but our method still performs well with less training effort, is explainable along the whole prediction process and can be applied to existing prediction methods.", "venue": "IEEE Open Journal of Intelligent Transportation Systems", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": null, "publicationDate": null, "journal": {"name": "IEEE Open Journal of Intelligent Transportation Systems", "pages": "153-174", "volume": "4"}, "authors": [{"authorId": "2210572583", "name": "Josef Hoppe"}, {"authorId": "40987741", "name": "F. Schwinger"}, {"authorId": "2210573908", "name": "Henrik Haeger"}, {"authorId": "2135687872", "name": "Jonas Wernz"}, {"authorId": "1744383", "name": "M. Jarke"}], "citations": [{"paperId": "540a4c3120e4effbd672fdd3d33963fd5a99cd9a", "title": "Predicting Passenger Occupancy of Commercial Buses Using Regression Approach of Machine Learning"}, {"paperId": "fd7d6da3be820064c7a1107edbcdceccebc8b8a4", "title": "Evaluating the Performance of Video-Based Automated Passenger Counting Systems in Real-World Conditions: A Comparative Study"}, {"paperId": "7fe5e539c005896aeb1017b8fce96962aeed2411", "title": "Fairness-Enhancing Deep Learning for Ride-Hailing Demand Prediction"}, {"paperId": "6c7235ff7aca5770b809e73eada25199f22edf50", "title": "Network-Wide Public Transport Occupancy Prediction Framework With Multiple Line Interactions"}, {"paperId": "65908293ff03758e801e4be118193282947078a0", "title": "A Systematic Literature Review on Machine Learning in Shared Mobility"}]}
