{"paperId": "c6dd76bf1bcede1666ac307d60fdc7bf811d7546", "publicationVenue": {"id": "31c6e511-cc0b-42e2-901d-97b4b6f6605e", "name": "International Conference on Field-Programmable Logic and Applications", "type": "conference", "alternate_names": ["Field-programmable Log Appl", "Int Conf Field-programmable Log Appl", "Field-Programmable Logic and Applications", "FPL"], "url": "http://www.fpl.org/h/"}, "title": "A Domain-Specific Architecture for Accelerating Sparse Matrix Vector Multiplication on FPGAs", "abstract": "FPGAs allow custom memory hierarchy and flexible data movement with highly fine-grained control. These capabilities are critical for building high performance and energy efficient domain-specific architectures (DSAs), especially for workloads with irregular memory access and data-dependent communication patterns. Sparse linear algebra operations, especially sparse matrix vector multiplication (SpMV), are examples of such workloads and are becoming important due to their use in numerous areas of science and engineering. Existing FPGA-based DSAs for SpMV do not allow customization through plug and play of the building blocks. For example, most of these DSAs require switching network/crossbar architecture as a building block for routing matrix data to banked vector memory blocks. In this paper, we first present an approach where a custom network is built using simple blocks arranged in a regular fashion to exploit low-level architecture details. Further, we make use of this network to replace expensive crossbars employed in GEMX SpMV engine and develop an end-to-end tool-flow around mixed IP approach (HLS/RTL). Due to the modularity of our design, our tool-flow allows us to insert an additional block in the design to guarantee zero-stall from the accumulation stage. On Alveo U200, we report performance numbers of up to 4.4 GFLOPS (92% peak bandwidth utilization) using our accelerator (attached with one DDR4).", "venue": "International Conference on Field-Programmable Logic and Applications", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-08-01", "journal": {"name": "2020 30th International Conference on Field-Programmable Logic and Applications (FPL)", "pages": "127-132"}, "authors": [{"authorId": "14463929", "name": "A. Jain"}, {"authorId": "144715077", "name": "Hossein Omidian"}, {"authorId": "2076275651", "name": "H. Fraisse"}, {"authorId": "1996207107", "name": "Mansimran Benipal"}, {"authorId": "2129476221", "name": "Lisa Liu"}, {"authorId": "41019150", "name": "D. Gaitonde"}], "citations": [{"paperId": "ad8ee8ea6bd57d98c32c5d41943393c57256545e", "title": "Accelerating SpMV on FPGAs Through Block-Row Compress: A Task-Based Approach"}, {"paperId": "27cd904a301ebc5e83504d9a0477bc480dc6e3d4", "title": "Spica: Exploring FPGA Optimizations to Enable an Efficient SpMV Implementation for Computations at Edge"}, {"paperId": "ecf3f48ca04bfcec3b74f772edab46770732da28", "title": "Modular and Lean Architecture with Elasticity for Sparse Matrix Vector Multiplication on FPGAs"}, {"paperId": "a04b6b6a98e318132b9c289303b290b2a9bd3416", "title": "Performance Enhancement Strategies for Sparse Matrix-Vector Multiplication (SpMV) and Iterative Linear Solvers"}, {"paperId": "cd6e0606586c3d620347b0d4527e885cb0bb6fa9", "title": "Maia: Matrix Inversion Acceleration Near Memory"}, {"paperId": "d27efe00105cc81a655649114d32af7c736c9356", "title": "Two sparsities are better than one: unlocking the performance benefits of sparse–sparse networks"}, {"paperId": "a88bb90f607281a7e0e5145ab9c52aaee4899e0d", "title": "Xar-trek: run-time execution migration among FPGAs and heterogeneous-ISA CPUs"}, {"paperId": "f7d7380b74b0fee80135fa7ccbf2bceb57dc4108", "title": "Bandwidth-Efficient Sparse Matrix Multiplier Architecture for Deep Neural Networks on FPGA"}, {"paperId": "a9a7eee3a6442da7b38c376703c8a8858363e404", "title": "A High-Fidelity Flow Solver for Unstructured Meshes on Field-Programmable Gate Arrays: Design, Evaluation, and Future Challenges"}, {"paperId": "518bbef25bdbc304827a5b842f57ec6c0776508c", "title": "Exploring Domain-Specific Architectures for Energy-Efficient Wearable Computing"}, {"paperId": "637321559d86b36f7564b5ca381460e9c8bb6059", "title": "Algorithm-hardware co-design of a discontinuous Galerkin shallow-water model for a dataflow architecture on FPGA"}, {"paperId": "33001234d9fe7e230e3ce9d8371347e935dc46d7", "title": "Solving Large Top-K Graph Eigenproblems with a Memory and Compute-optimized FPGA Design"}, {"paperId": "e859d64456ef3de6ec5085c052cdb4445b2716d2", "title": "A Novel Reduction Circuit Based on Binary Tree Path Partition on FPGAs"}]}
