{"paperId": "c6f54de6a49c309082a00412da6ded57063b57a5", "publicationVenue": {"id": "e5a2b19d-fb81-4009-8dc2-9aeb2643d906", "name": "Knowledge Engineering and Data Science", "alternate_names": ["Knowl Eng Data Sci"], "issn": "2597-4602", "url": "http://journal2.um.ac.id/index.php/keds/index"}, "title": "Exploring the Impact of Students Demographic Attributes on Performance Prediction through Binary Classification in the KDP Model", "abstract": "During the course of this research, binary classification and the Knowledge Discovery Process (KDP) were used. The experimental and analytical capabilities of Rapid Miner's 9.10.010 instructional environment are supported by five different classifiers. Included in the analysis were 2334 entries, 17 characteristics, and one class variable containing the students' average score for the semester. There were twenty experiments carried out. During the studies, 10-fold cross-validation and ratio split validation, together with bootstrap sampling, were used. It was determined whether or not to use the Random Forest (RF), Rule Induction (RI), Naive Bayes (NB), Logistic Regression (LR), or Deep Learning (DL) methods. RF outperformed the other four methods in all six selection measures, with an accuracy of 93.96%. According to the RF classifier model, the level of education that a child's parents have is a major factor in that child's academic performance before entering higher education.", "venue": "Knowledge Engineering and Data Science", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-25", "journal": {"name": "Knowl. Eng. Data Sci.", "pages": "24", "volume": "6"}, "authors": [{"authorId": "116880216", "name": "Issah Iddrisu"}, {"authorId": "2237021789", "name": "Peter Appiahene"}, {"authorId": "70504158", "name": "Obed Appiah"}, {"authorId": "116456889", "name": "Fuseini Inusah"}], "citations": [{"paperId": "d077fd80a426d51a0dbba6af08012f3174811e97", "title": "Performance Analysis of Random Forest on Quartile Classification Journal"}]}
