{"paperId": "c70ae72cea68ef7d3baab41ba918e487fa1020f2", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Predicting Student Performance and Its Influential Factors Using Hybrid Regression and Multi-Label Classification", "abstract": "Understanding, modeling, and predicting student performance in higher education poses significant challenges concerning the design of accurate and robust diagnostic models. While numerous studies attempted to develop intelligent classifiers for anticipating student achievement, they overlooked the importance of identifying the key factors that lead to the achieved performance. Such identification is essential to empower program leaders to recognize the strengths and weaknesses of their academic programs, and thereby take the necessary corrective interventions to ameliorate student achievements. To this end, our paper contributes, firstly, a hybrid regression model that optimizes the prediction accuracy of student academic performance, measured as future grades in different courses, and, secondly, an optimized multi-label classifier that predicts the qualitative values for the influence of various factors associated with the obtained student performance. The prediction of student performance is produced by combining three dynamically weighted techniques, namely collaborative filtering, fuzzy set rules, and Lasso linear regression. However, the multi-label prediction of the influential factors is generated using an optimized self-organizing map. We empirically investigate and demonstrate the effectiveness of our entire approach on seven publicly available and varying datasets. The experimental results show considerable improvements compared to single baseline models (e.g. linear regression, matrix factorization), demonstrating the practicality of the proposed approach in pinpointing multiple factors impacting student performance. As future works, this research emphasizes the need to predict the student attainment of learning outcomes.", "venue": "IEEE Access", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-11-06", "journal": {"name": "IEEE Access", "pages": "203827-203844", "volume": "8"}, "authors": [{"authorId": "2233219677", "name": "AbdAllah Alshanqiti"}, {"authorId": "3053209", "name": "Abdallah Namoun"}], "citations": [{"paperId": "16a0add82b3af3dd1971257efd24e81b32e2e743", "title": "How do students’ learning goals differ? A text mining approach to reveal the individual differences"}, {"paperId": "a88b1d34af2f804fe0245e44eeff2bafa84ca27d", "title": "Mitigating Imbalanced Classification Problems in Academic Performance with Resampling Methods"}, {"paperId": "7d4b10781ee4562c664a84d88ffb82e8bd77667a", "title": "Predicting Student Exam Scores: Exploring the Most Effective Regression Technique"}, {"paperId": "8b2740a5844095598d28bee17c8bafe85e50f4c8", "title": "Online Prediction to Facilitate a Flipped and Adaptive Classroom"}, {"paperId": "487f1670ebd33346a6a4089e8db0e36d33f509a2", "title": "Increasing Accuracy in Predicting Student Test Scores with Regression Using Domain Reduction Technique of Principal Component Analysis"}, {"paperId": "73ada5ce7d8b8c6f97fff8e47e3a43f794f396dd", "title": "Role of Educational Data Mining and Learning Analytics Techniques Used for Predictive Modeling"}, {"paperId": "f14868424cb2331adc5f6197374e2e521da93beb", "title": "Protecting Image-classifiers from Adversarial Attacks using an Adaptive Clustering Buffer-based Detection"}, {"paperId": "58e0b3748f56bb3e576be6d1f8ba462fce6dfc79", "title": "Performance Analysis of E-Learning System Using Data Mining Techniques"}, {"paperId": "fba622cb45f8aba2dce2311c62af2739015abe3c", "title": "Analysis of Existing ML Techniques for Students Success Prediction"}, {"paperId": "03cfc9d0923769843e340fbb70a2988791728908", "title": "Predição de Desempenho de Estudantes: Uma Revisão Sistemática de Literatura"}, {"paperId": "e4674fc60e1277196f9a5bfedb08988e2e760427", "title": "Predictive Models for Early Detection of Engineering Students at Risk of a Course Failure"}, {"paperId": "401ab056f4141dab6c82d85f35a7dc9d76282b91", "title": "Student Dataset from Tecnologico de Monterrey in Mexico to Predict Dropout in Higher Education"}, {"paperId": "46741e4be1362b50cd0fabfb228dd264d6ceae42", "title": "Finding Features of Multiple Linear Regression On Currency Exchange Pairs"}, {"paperId": "31710399e623bc039a95980e84fe06776fb7eb41", "title": "Student Trend Analysis for Foreign Education Employing Machine Learning: A Case Study from ‘Disha Consultants’, Gujarat, India"}, {"paperId": "558387197a117964c671a92b859532a5bcbdb596", "title": "Performance Comparison of the Optimized Ensemble Model with Existing Classifier Models"}, {"paperId": "5dfec927187a41fcbde1f61d44bcb8a21ed90ff3", "title": "Data mining: will first-year results predict the likelihood of completing subsequent units in accounting programs?"}, {"paperId": "607f75f1d740ace1ea537d699026c63a9e019b93", "title": "Assessment and Evaluation of Different Machine Learning Algorithms for Predicting Student Performance"}, {"paperId": "3355ca33d5550f7ef675528d6653821912faa2cb", "title": "A 2-tier fuzzy control system for grade adjustment based on students' social interactions"}, {"paperId": "0ad4189bdddfa32ecf7b1c9122eba57c8d8bbc7f", "title": "Educational data mining: prediction of students' academic performance using machine learning algorithms"}, {"paperId": "b1666a1378f45550f9a979f7248ef8c236b6fbc2", "title": "Week-Wise Student Performance Early Prediction in Virtual Learning Environment Using a Deep Explainable Artificial Intelligence"}, {"paperId": "b404acb17a981a8942008fda5ce21e86f0b3c760", "title": "Data mining applications in university information management system development"}, {"paperId": "55799c1deea1a8929c76342bfc2b1580e6e1984f", "title": "A survey on educational data mining methods used for predicting students' performance"}, {"paperId": "e7c1f795e9472665b389dd8ebf82b5ab7b19f522", "title": "Application of machine learning in higher education to assess student academic performance, at-risk, and attrition: A meta-analysis of literature"}, {"paperId": "25d16ba3bf9c4eec572e916f54618aedf4f740b8", "title": "Predicting student performance using data mining and learning analysis technique in Libyan Higher Education"}, {"paperId": "fe0a4f2390fbab5d77e1b50a8dc96c161211c6cc", "title": "Predicting University's Students Performance Based on Machine Learning Techniques"}, {"paperId": "7be14c6cdbf40e4a1b2ad8141712b93ad5f8ee0b", "title": "Psychotic Motivation for Improving Student Performance Based On Pattern Learner Features Using Deep Neural Classifier for Bipolar Disorder Students"}, {"paperId": "77b7c334b1307a0c6cbee466fc70b256b4645b1f", "title": "Predicting Student Performance Using Data Mining and Learning Analytics Techniques: A Systematic Literature Review"}, {"paperId": "29aec35a4265075936e66ab84b8769ba8de2ad25", "title": "Predicting University Student Graduation Using Academic Performance and Machine Learning: A Systematic Literature Review"}, {"paperId": "43af7340f53528aea505bb33a04d87804dba47d2", "title": "An intelligent rule-oriented framework for extracting key factors for grants scholarships in higher education"}, {"paperId": "3221a62c238776fc07ba9781cf1c4b7a860ab4d9", "title": "Early Predicting of Students Performance in Higher Education"}, {"paperId": "491a0af360dbf3dd711db4e86b19ebf1112a0913", "title": "Student Performance Prediction Approach Based on Educational Data Mining"}, {"paperId": "8c078812eb140bd92c2fd010f4df2b89892cfdd0", "title": "Predicting Students at Risk of Early Dropping Out from Course Using Ensemble Classification Methods"}, {"paperId": "ade87fd2e7c0a1e42c2aa7fa3e93a5be78610a88", "title": "Predicted Specified STEAM Student Majors Depending On Many Factors Using Generative Adversarial Networks"}, {"paperId": "21b339b8d921e91d71db6abe7d39dad41813f390", "title": "Utilizing Social Clustering-based regression model for Predicting Student’s GPA"}, {"paperId": "c9d740a85e04bd7fd94b1765bea99ccbd1a5cc55", "title": "Feature Aware Predictive Model For Education Data Mining"}, {"paperId": "fafe74207315d2c9705fe006729ab4c454cb4051", "title": "The Impact of Work-Integrated Learning and Learning Strategies on Engineering Students’ Learning Outcomes in Thailand: A Multiple Mediation Model of Learning Experiences and Psychological Factors"}, {"paperId": "6191fae072660cce54cb0dd916e36645b10484e5", "title": "A Rule-based Approach toward Automating the Assessments of Academic Curriculum Mapping"}, {"paperId": "9b420bc15740d67447462d1673a98578d8b0744e", "title": "Time Division Ensemble Learning Classifier For Efficient Student Performance Analysis Using Convolution Neural Network"}, {"paperId": "5c1932747304f82deea0c0339e7011b2bbab0233", "title": "Methods Application Towards a New Dataset based on Online Student Activities"}]}
