{"paperId": "c70e890fafd0e9f7cd42daa823f110a4ea3d9fb3", "publicationVenue": {"id": "4dca6864-9c44-4418-99a0-aae2e1fc64d5", "name": "Administrative Consulting", "alternate_names": ["Adm Consult"], "issn": "1726-1139", "url": "http://acjournal.ru/"}, "title": "Strategy of \"Cold Start\" of New Academic Laboratories", "abstract": "The Ministry of Science and Higher Education of the Russian Federation to attract young promising personnel to research activities at the end of 2018, an additional budget was set up, aimed at creating new research laboratories in academic institutions. Scientific and organizational problems that were identified at the stage of the creation and development of new laboratories are discussed. The disintegration and high specialization of institutes at the initial stage of the creation of laboratories affected the speed and quality of the decisions. The selection of young professionals and their employment in the institutions in the shortest possible time in 2018 was the main requirement О Б Щ Е С Т В О И Р Е Ф О Р М Ы УПРАВЛЕНЧЕСКОЕ КОНСУЛЬТИРОВАНИЕ . No 5 . 2019 69 for obtaining additional funding. At the beginning of 2019, for most organizations, the main problems of a mainly technical nature were the updating of research plans for 2019, taking into account additional budget works opened for new laboratories. Inaccuracies in the coordination of labor costs, financing direct and indirect costs were identified. Taking into account the staff youth, the main risks for new laboratories are the fulfillment of indicators for the state task (articles in journals) and the provision of scientific staff salaries over 200% of the average salary in the region (attraction of additional extrabudgetary funds). Also, taking into account that employees with little experience were taken into new laboratories, it is quite difficult to apply a well-tested Personal Research Activity Rating tool for financial motivation, and other strategies are needed for “the cold start” of new research laboratories in academic institutions. The options of scientific and organizational measures considered in the article are aimed at reducing the risks of the formation of new laboratories and transforming them into points of growth and exchange of best practices among other scientific and educational organizations.", "venue": "Administrative Consulting", "year": 2019, "fieldsOfStudy": ["Engineering"], "publicationTypes": null, "publicationDate": "2019-05-01", "journal": {"name": "Administrative consulting"}, "authors": [{"authorId": "144719761", "name": "A. Ronzhin"}], "citations": []}
