{"paperId": "c70f0f72cac496763c11e18a0364b8fe25bc7a66", "publicationVenue": {"id": "c83872c8-8037-4ef1-8ced-abb2233a2886", "name": "IEEE Transactions on Green Communications and Networking", "alternate_names": ["IEEE Trans Green Commun Netw"], "issn": "2473-2400", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=7511293", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=7511293"]}, "title": "GSS-VF: A Game-Theoretic Approach for Service Discovery in Fog Network of Vehicles", "abstract": "Vehicular Fog Computing exploits the computing, caching and communication resources at vehicles to facilitate different location-based applications in a smart urban environment. Today, consumer vehicles can discover and consume available services from nearby vehicles, acting as provider vehicles in a fog network. However, it is challenging for the consumers to first identify, and then select the most appropriate service provider, given, high mobility, intermittent connectivity, and heterogeneous costs associated with provider vehicles, that dedicate their resources in facilitating the respective service to consumers. In this paper, we deal with the issue of selecting the best provider vehicles in an urban environment, considering both costs and Quality of Service (QoS) requirements for both the provider vehicles in the fog as well as the consumer vehicles. Hence, we design a new game theory-based distributed scheme, namely GSS-VF, to manage the service provisioning in a vehicular fog. It allows the consumers to select the most suitable Fog nodes based on their probability of interactions. GSS-VF addresses two questions: (i) What are the optimal conditions under which the consumers may request the Fog nodes for services? and (ii) How to select the most suitable service with respect to the consumers’ preferences? To evaluate GSS-VF, extensive simulations are performed using urban mobility model on 1,500 vehicles, results show that the designed scheme efficiently identifies and selects the most adequate service providers for consumers in the fog.", "venue": "IEEE Transactions on Green Communications and Networking", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-09-01", "journal": {"name": "IEEE Transactions on Green Communications and Networking", "pages": "1418-1427", "volume": "6"}, "authors": [{"authorId": "3206680", "name": "Bouziane Brik"}, {"authorId": "145016522", "name": "J. Khan"}, {"authorId": "1397038647", "name": "Y. Ghamri-Doudane"}, {"authorId": "3272182", "name": "N. Lagraa"}, {"authorId": "1750344", "name": "Abderrahmane Lakas"}], "citations": [{"paperId": "e4128ed6b4d3d1913f1c372b02490875c8df9915", "title": "On Adjusting Data Throughput in IoT Networks: A Deep-Reinforcement-Learning-Based Game Approach"}, {"paperId": "8d9da3b3ef4f7633f3f0e991e68e448dc9fe6498", "title": "A Power Control-Aided Q-Learning-Based Routing Protocol for Optical-Acoustic Hybrid Underwater Sensor Networks"}]}
