{"paperId": "c710190bbe0bb84e2b2c00718374a678695356f9", "publicationVenue": {"id": "e574da12-4e4c-4b78-a203-ae3719c0c4f7", "name": "Annual International Computer Software and Applications Conference", "type": "conference", "alternate_names": ["Comput Softw Appl Conf", "Annu Int Comput Softw Appl Conf", "COMPSAC Work", "Computer Software and Applications Conference", "COMPSAC Workshops", "COMPSAC"], "url": "http://www.wikicfp.com/cfp/program?id=548"}, "title": "Entity Type Recognition Using an Ensemble of Distributional Semantic Models to Enhance Query Understanding", "abstract": "We present an ensemble approach for categorizing search query entities in the recruitment domain. Understanding the types of entities expressed in a search query (Company, Skill, Job Title, etc.) enables more intelligent information retrieval based upon those entities compared to a traditional keyword-based search. Because search queries are typically very short, leveraging a traditional bag-of-words model to identify entity types would be inappropriate due to the lack of contextual information. Our approach instead combines clues from different sources of varying complexity in order to collect real-world knowledge about query entities. We employ distributional semantic representations of query entities through two models: 1) contextual vectors generated from encyclopedic corpora like Wikipedia, and 2) high dimensional word embedding vectors generated from millions of job postings using word2vec. Additionally, our approach utilizes both entity linguistic properties obtained from WordNet and ontological properties extracted from DBpedia. We evaluate our approach on a data set created at CareerBuilder, the largest job board in the US. The data set contains entities extracted from millions of job seekers/recruiters search queries, job postings, and resume documents. After constructing the distributional vectors of search entities, we use supervised machine learning to infer search entity types. Empirical results show that our approach outperforms the state-of-the-art word2vec distributional semantics model trained on Wikipedia. Moreover, we achieve micro-averaged F1 score of 97% using the proposed distributional representations ensemble.", "venue": "Annual International Computer Software and Applications Conference", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2016-04-04", "journal": {"name": "2016 IEEE 40th Annual Computer Software and Applications Conference (COMPSAC)", "pages": "631-636", "volume": "1"}, "authors": [{"authorId": "2719971", "name": "W. Shalaby"}, {"authorId": "7699509", "name": "Khalifeh AlJadda"}, {"authorId": "34963860", "name": "M. Korayem"}, {"authorId": "2320997", "name": "Trey Grainger"}], "citations": [{"paperId": "b3a21343d72975faec48caecdaa4a0ebf0e1e8f6", "title": "Toward a traceable, explainable, and fairJD/Resume recommendation system"}, {"paperId": "0b9ff7566adb464fe126e53c88c1206e2f4f8c88", "title": "Implementing an Android Application for Automatic Vietnamese Business Card Recognition"}, {"paperId": "1cdc4e2f95b1d0530d08317aa1fde008cd16474f", "title": "Large-Scale Occupational Skills Normalization for Online Recruitment"}, {"paperId": "1b3087722e17c7e1153ac4570034e25cfcfccfb3", "title": "Query Expansion Techniques for Enterprise Search"}]}
