{"paperId": "c71328c91895251a9dc57142dda1e5ec62eee9ad", "publicationVenue": {"id": "d80d58be-58fc-4181-a397-5ac6fd976a47", "name": "ACM Symposium on Applied Computing", "type": "conference", "alternate_names": ["Sel Area Cryptogr", "Int Conf Sel area Cryptogr", "International Conference on Selected areas in Cryptography", "ACM Symp Appl Comput", "Selected Areas in Cryptography", "Symposium on Applied Computing", "SAC", "Symp Appl Comput"], "url": "https://www.acm.org/publications", "alternate_urls": ["http://sacworkshop.org/"]}, "title": "Hadoop energy consumption reduction with hybrid HDFS", "abstract": "Apache Hadoop has evolved significantly over the last years, with more than 60 releases bringing new features. By implementing the MapReduce programming paradigm and leveraging HDFS, its distributed file system, Hadoop has become a reliable and fault tolerant middleware for parallel and distributed computing over large datasets. Nevertheless, Hadoop may struggle under certain workloads, resulting in poor performance and high energy consumption. Users increasingly demand that high performance computing solutions address sustainability and limit energy consumption. In this paper, we introduce HDFSH, a hybrid storage mechanism for HDFS, which uses a combination of Hard Disks and Solid-State Disks to achieve higher performance while saving power in Hadoop computations. HDFSH brings to the middleware the best from HDs (affordable cost per GB and high storage capacity) and SSDs (high throughput and low energy consumption) in a configurable fashion, using dedicated storage zones for each storage device type. We implemented our mechanism as a block placement policy for HDFS, and assessed it over six recent releases of Hadoop with different architectural properties. Results indicate that our approach increases overall job performance while decreasing the energy consumption under most hybrid configurations evaluated. Our results also showed that, in many cases, storing only part of the data in SSDs results in significant energy savings and execution speedups.", "venue": "ACM Symposium on Applied Computing", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2016-04-04", "journal": {"name": "Proceedings of the 31st Annual ACM Symposium on Applied Computing"}, "authors": [{"authorId": "1684392", "name": "Ivanilton Polato"}, {"authorId": "145690522", "name": "Denilson Barbosa"}, {"authorId": "145369636", "name": "Abram Hindle"}, {"authorId": "1720007", "name": "Fabio Kon"}], "citations": [{"paperId": "720735352c31a919f95332c42f29f3245a7b6ff1", "title": "Survey on improving the performance of MapReduce in Hadoop"}, {"paperId": "6f84b0f5878010b9ee67b13a04988c82b7914794", "title": "A Theoretical Framework for Big Data Analytics Based on Computational Intelligent Algorithms with the Potential to Reduce Energy Consumption"}, {"paperId": "d3aa3c07664a7380559e39774f64a7551b361e5f", "title": "A taxonomy of software-based and hardware-based approaches for energy efficiency management in the Hadoop"}, {"paperId": "cd636464fadd7404347207e6abd759b133cbe88e", "title": "AN ENERGY EFFICIENT DATA PLACEMENT USING ANONYMIZATION BASED GREEDY COVER ALGORITHM IN HADOOP"}]}
