{"paperId": "c71febab3333f643655160a3b1d5ae928a4bbc79", "publicationVenue": {"id": "79c5a18d-0295-432c-aaa5-961d73de6d88", "name": "IEEE Transactions on Neural Networks and Learning Systems", "alternate_names": ["IEEE Trans Neural Netw Learn Syst"], "issn": "2162-237X", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=5962385", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=5962385"]}, "title": "How Frequency Injection Locking Can Train Oscillatory Neural Networks to Compute in Phase", "abstract": "Brain-inspired computing employs devices and architectures that emulate biological functions for more adaptive and energy-efficient systems. Oscillatory neural networks (ONNs) are an alternative approach in emulating biological functions of the human brain and are suitable for solving large and complex associative problems. In this work, we investigate the dynamics of coupled oscillators to implement such ONNs. By harnessing the complex dynamics of coupled oscillatory systems, we forge a novel computation model—information is encoded in the phase of oscillations. Coupled interconnected oscillators can exhibit various behaviors due to the strength of the coupling. In this article, we present a novel method based on subharmonic injection locking (SHIL) for controlling the oscillatory states of coupled oscillators that allow them to lock in frequency with distinct phase differences. Circuit-level simulation results indicate SHIL effectiveness and its applicability to large-scale oscillatory networks for pattern recognition.", "venue": "IEEE Transactions on Neural Networks and Learning Systems", "year": 2021, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-09-08", "journal": {"name": "IEEE Transactions on Neural Networks and Learning Systems", "pages": "1996-2009", "volume": "33"}, "authors": [{"authorId": "1404803112", "name": "A. Todri-Sanial"}, {"authorId": "7990765", "name": "S. Carapezzi"}, {"authorId": "2115013041", "name": "Corentin Delacour"}, {"authorId": "2007506752", "name": "Madeleine Abernot"}, {"authorId": "2074764646", "name": "Thierry Gil"}, {"authorId": "72853540", "name": "Elisabetta Corti"}, {"authorId": "2630840", "name": "S. Karg"}, {"authorId": "2164140236", "name": "Juan Nüñez"}, {"authorId": "2067697954", "name": "M. Jiménèz"}, {"authorId": "1710062", "name": "M. Avedillo"}, {"authorId": "1397317879", "name": "B. Linares-Barranco"}], "citations": [{"paperId": "a16368a1c37a0bc9bcea98025a6438fde102fe44", "title": "Demonstration of Threshold Switching in Undoped SiOx Layer for Oscillation Neurons"}, {"paperId": "b02af855070743512771d9d34ad819dc359109df", "title": "Experimental Robust Spontaneous Synchronizations in Coupled NbOx Oscillation Neurons for Unconventional Computing"}, {"paperId": "35cce44d75f0ff8b44677b777c3da4977bb76bc2", "title": "Operating Coupled VO₂-Based Oscillators for Solving Ising Models"}, {"paperId": "39e9d1b3aa6b0b4d8022aba5f38acdc4b2962095", "title": "How fast can vanadium dioxide neuron-mimicking devices oscillate? Physical mechanisms limiting the frequency of vanadium dioxide oscillators"}, {"paperId": "b95a2e6a7090624c8739e0495332a70c2bd0cf29", "title": "Digital Implementation of On-Chip Hebbian Learning for Oscillatory Neural Network"}, {"paperId": "a47e87acfc3c095ae4fa77c13d5a64e7d3885c24", "title": "A mixed-signal oscillatory neural network for scalable analog computations in phase domain"}, {"paperId": "8ad1088a99c40b0ccde29fd53b3a0a5fe34f7221", "title": "Oscillatory neural network learning for pattern recognition: an on-chip learning perspective and implementation"}, {"paperId": "b861ecd59dc18a81ce7f2389c8ca336edc741abf", "title": "Training energy-based single-layer Hopfield and oscillatory networks with unsupervised and supervised algorithms for image classification"}, {"paperId": "ed61f84c7e4f54cdcd652fc3f88fe706d1300baa", "title": "Understanding Rhythmic Synchronization of Oscillatory Neural Networks Based on NbOx Artificial Neurons for Edge Detection"}, {"paperId": "2dedc977fc8a9590a24f3d6fde65bac481cb0dc3", "title": "Two-Layered Oscillatory Neural Networks with Analog Feedforward Majority Gate for Image Edge Detection Application"}, {"paperId": "019574d1e3125180c0b56366f17c57c4f2da84d9", "title": "Building Oscillatory Neural Networks: AI Applications and Physical Design Challenges"}, {"paperId": "856f7599062e584c4acc02772d565dd875d31e1b", "title": "Energy-Performance Assessment of Oscillatory Neural Networks Based on VO 2 Devices for Future Edge AI Computing."}, {"paperId": "1bf47c7377e0bed81df9782f322f37c4a1d8ea9a", "title": "Simulation and implementation of two-layer oscillatory neural networks for image edge detection: bidirectional and feedforward architectures"}, {"paperId": "25b1cf1aca6d758c83980469ff6bc6d031b3c851", "title": "Review of the VO2 smart material applications with emphasis on its use for spacecraft thermal control"}, {"paperId": "955c13cdbaa47f126aaa3dfa5063dd63abe649e5", "title": "Role of ambient temperature in modulation of behavior of vanadium dioxide volatile memristors and oscillators for neuromorphic applications"}, {"paperId": "f4196db2664a06e2f40376c63a9482f259d647d1", "title": "Effect of Device Mismatches in Differential Oscillatory Neural Networks"}, {"paperId": "a4778d82e09cacdbe2fef7b72fecb8a4fea9f353", "title": "Oscillatory Neural Network for Edge Computing: A Mobile Robot Obstacle Avoidance Application"}, {"paperId": "40e85b48f7fc2c67ee1f75a4f096ce601a7fada2", "title": "On-Chip Learning with a 15-neuron Digital Oscillatory Neural Network Implemented on ZYNQ Processor"}, {"paperId": "5767ff5d9e92d5a79f72f04eae8c23ec2e5b148f", "title": "Oscillatory Neural Networks for Obstacle Avoidance on Mobile Surveillance Robot E4"}, {"paperId": "4a0e18dab996e29d2f284ca3de3d0bae09f71b52", "title": "Oscillatory Neural Network as Hetero-Associative Memory for Image Edge Detection"}, {"paperId": "35370009db5cedcd5517bbdb045b22ccbc78c649", "title": "Mapping Hebbian Learning Rules to Coupling Resistances for Oscillatory Neural Networks"}, {"paperId": "7e8b4c04561346f6eed001e1b46bb5f125b6d0b2", "title": "Oscillatory Neural Networks for Edge AI Computing"}, {"paperId": "b3b07568c4f543185284b4da5ca7f4d6530736d6", "title": "Brain-Inspired Mutual Synchronization in Cross-Coupled NbOx Oscillation Neurons for Oscillatory Neural Network Applications"}, {"paperId": "5e920310f620da21e2489bd98a90204461e0521d", "title": "Energy Efficient Neuromorphic Computing with beyond-CMOS Oscillatory Neural Networks"}]}
