{"paperId": "c72579e6e74c032603083cb30432b15677df6e5d", "publicationVenue": {"id": "61a26733-f8ab-4c45-8bd1-5d75465606e3", "name": "International Journal of Scientific Research in Computer Science Engineering and Information Technology", "type": "journal", "alternate_names": ["Int J Sci Res Comput Sci Eng Inf Technol"], "issn": "2456-3307", "url": "http://ijsrcseit.com/"}, "title": "Chronic Diseases Prediction over Bigdata by using Machine Learning", "abstract": "With big data growth in biomedical and healthcare communities, accurate analysis of medical data benefits early disease detection, patient care and community services. However, the analysis accuracy is reduced when the quality of medical data is incomplete. Moreover, different regions exhibit unique characteristics of certain regional diseases, which may weaken the prediction of disease outbreaks. In this paper, we streamline machine-learning algorithms for effective prediction of chronic disease outbreak in disease-frequent communities. We experiment the modified prediction models over real-life hospital data collected from central China in 2013-2015. To overcome the difficulty of incomplete data, we use a latent factor model to reconstruct the missing data. We experiment on a regional chronic disease of cerebral infarction. To the best of our knowledge, none of the existing work focused on both data types in the area of medical big data analytics. Compared to several typical prediction algorithms, the prediction accuracy of our proposed algorithm reaches 94.8% with a convergence speed which is faster than that of the CNN-based unimodal disease risk prediction (CNN-UDRP) algorithm.", "venue": "International Journal of Scientific Research in Computer Science Engineering and Information Technology", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2019-05-22", "journal": {"name": "International Journal of Scientific Research in Computer Science, Engineering and Information Technology"}, "authors": [{"authorId": "150298775", "name": "Shreekanth Jogar"}, {"authorId": "39966126", "name": "Pavankumar Naik"}, {"authorId": "150334873", "name": "Veeramma Vyapari"}, {"authorId": "150236655", "name": "Madevi Vaddar"}, {"authorId": "150171056", "name": "Kavita Dambal"}, {"authorId": "150043003", "name": "Bheemavva Hatti"}], "citations": [{"paperId": "b19560c9116e6e0263fbfdfe985ab55fbe66eeff", "title": "Multi-Disease Prediction and Classification Based on Medical History"}]}
