{"paperId": "c730051454bac5225c7a838aee0cda965eb28ac9", "publicationVenue": {"id": "7b2adce0-d53f-49d6-8784-b0645604fe62", "name": "ACM Computing Surveys", "type": "journal", "alternate_names": ["ACM Comput Surv"], "issn": "0360-0300", "url": "http://www.acm.org/pubs/surveys/", "alternate_urls": ["http://portal.acm.org/csur", "https://csur.acm.org/", "http://csur.acm.org/"]}, "title": "Data Mining on Smartphones: An Introduction and Survey", "abstract": "Data mining is the science of extracting information or “knowledge” from data. It is a task commonly executed on cloud computing resources, personal computers and laptops. However, what about smartphones? Despite the fact that these ubiquitous mobile devices now offer levels of hardware and performance approaching that of laptops, locally executed model-training using data mining methods on smartphones is still notably rare. On-device model-training offers a number of advantages. It largely mitigates issues of data security and privacy, since no data is required to leave the device. It also ensures a self-contained, fully portable data mining solution requiring no cloud computing or network resources and able to operate in any location. In this article, we focus on the intersection of smartphones and data mining. We investigate the growth in smartphone performance, survey smartphone usage models in previous research, and look at recent developments in locally executed data mining on smartphones.", "venue": "ACM Computing Surveys", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-04-22", "journal": {"name": "ACM Computing Surveys", "pages": "1 - 38", "volume": "55"}, "authors": [{"authorId": "152963607", "name": "Darren Yates"}, {"authorId": "145751187", "name": "M. Islam"}], "citations": [{"paperId": "91c68dac18470f8fccb5e55475334eb140789e56", "title": "Automatic Layer Freezing for Communication Efficiency in Cross-Device Federated Learning"}, {"paperId": "06f556f80bedad16e72fa9bc6c795ac7f60130fe", "title": "Smartphones for Computing: Can They Reduce the Carbon Footprint?"}, {"paperId": "b83a6e71292c91912e5cd52cf1d5952fee5af6cf", "title": "Smartphone based on-device computing for societal applications"}, {"paperId": "0037ac78cddaf88eb28ed1da88c9cc4fd9e39a89", "title": "A Comprehensive Survey on Orbital Edge Computing: Systems, Applications, and Algorithms"}, {"paperId": "38ef89e790f05cd24239d1def8727d7c2bd1bb98", "title": "Combined Location Online Weather Data: Easy-to-use Targeted Weather Analysis for Agriculture"}, {"paperId": "b88b4229fc6037237ad56da277f870fd96e2d588", "title": "Blockchain localization cloud computing big data application evaluation method"}, {"paperId": "c8376bb20e8e99f7cbabc2760178bb49b293cfb0", "title": "Secure Food-Allergen Determination by Combining Smartphone-Based Raw Image Analyses and Liquid Chromatography–Mass Spectrometry for the Quantification of Proteins Contained in Lateral Flow Assays"}]}
