{"paperId": "c736be9bdba56002c43e0c784e2336c2a3eea24e", "publicationVenue": null, "title": "An Improved ID3 Classification Algorithm Based On Correlation Function and Weighted Attribute*", "abstract": "ID3 decision tree algorithm is a supervised learning model based on calculating the information gain to select the best splitting attribute, which is the main factor to construct a decision tree. The process of calculating gain takes into consideration only a current condition attribute and decision attribute, and the other condition attributes cannot be used to measure the attribute importance. Because of the above problem, an improved ID3 takes into consideration the connection between the current condition attribute and the other conditions attributes. An experiment is presented to compare our improved algorithm with the traditional ID3 algorithm. Experiment results show that our improved algorithm provides a decision tree with less number of leaves and higher predictive accuracy.", "venue": "2019 International Conference on Intelligent Systems and Advanced Computing Sciences (ISACS)", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2019-12-01", "journal": {"name": "2019 International Conference on Intelligent Systems and Advanced Computing Sciences (ISACS)", "pages": "1-8"}, "authors": [{"authorId": "1414633646", "name": "Fatima Es-Sabery"}, {"authorId": "34576303", "name": "Abdellatif Hair"}], "citations": [{"paperId": "27e30f82010c9d3079dd5ad00c62f3d5feb1a8f1", "title": "Developing scalable management information system with big financial data using data mart and mining architecture"}, {"paperId": "9299c65c51760e94115b3587836f88b8a00ae4df", "title": "Optimization of PBFT Algorithm Based on Improved C4.5"}, {"paperId": "0b5c1cd3652aa9a979da5761d4fdaa51dc55f433", "title": "A MapReduce C4.5 Decision Tree Algorithm Based on Fuzzy Rule-Based System"}, {"paperId": "1fb6b1863223babb571e66618ed8f4fcd93fd4ea", "title": "Evaluation of different extractors of features at the level of sentiment analysis"}, {"paperId": "eb67e45d7634e729e268e4181c7442bd6b6a95e8", "title": "Emotion Processing by Applying a Fuzzy-Based Vader Lexicon and a Parallel Deep Belief Network Over Massive Data"}, {"paperId": "2d8aedff05f2000bd7bfa80f98fddb55a41b9ae2", "title": "A MapReduce Opinion Mining for COVID-19-Related Tweets Classification Using Enhanced ID3 Decision Tree Classifier"}, {"paperId": "ec0f6c51dbbef19f934392eb903b08fdedfbcacb", "title": "Sentence-Level Classification Using Parallel Fuzzy Deep Learning Classifier"}, {"paperId": "6de5bcc78cbe05bc71aced4bbf423203998977ae", "title": "Sentiment Analysis of Covid19 Tweets Using A MapReduce Fuzzified Hybrid Classifier Based On C4.5 Decision Tree and Convolutional Neural Network"}, {"paperId": "20d542aef19a75fde96aaf1f0c9e608c1c1b1610", "title": "Blockchain-Based Decision Tree Classification in Distributed Networks"}]}
