{"paperId": "c73ba1986cdc655fa3dd534e2597525ec82d203d", "publicationVenue": {"id": "8bc59e8b-e251-4201-839a-ec83ae78859d", "name": "Complex", "type": "conference", "alternate_names": ["Int Conf Complex Sci", "International Conference on Complex Sciences"], "issn": "0806-1912", "alternate_issns": ["1538-6848"], "url": "http://wo.uio.no/as/WebObjects/nettlogg.woa/1/wa/logg?logg=5904", "alternate_urls": ["http://www.wikicfp.com/cfp/program?id=545", "https://www.complex.com/"]}, "title": "Simulation Framework for Cyber-Physical Production System: Applying Concept of LVC Interoperation", "abstract": "In Industry 4.0, many manufacturers have built smart factories by ICTs (Information and Communications Technology), and simulation is one of the core technologies for smart manufacturing. Various kinds of simulations, depending on system levels, such as assembly line, logistics, worker, and process, are utilized for smart manufacturing. Manufacturers own heterogeneous simulations; however, they have difficulty integrating and interoperating them. This paper proposes a novel simulation framework for smart manufacturing based on the concept of live, virtual, and constructive (LVC) simulation. The LVC interoperation provides a synthetic simulation environment with the above three types of simulations. With the LVC interoperation, we propose a systematic and efficient architecture for smart manufacturing. To be specific, the interface technologies between the heterogeneous simulations and their interoperable methods are developed. Finally, we provide a practical LVC simulation applied in the manufacturing company and show what synergy can be created using the LVC simulation.", "venue": "Complex", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-10-08", "journal": {"name": "Complex.", "pages": "4321873:1-4321873:11", "volume": "2020"}, "authors": [{"authorId": "2608638", "name": "B. Kim"}, {"authorId": "4589705", "name": "Seung-Yeon Nam"}, {"authorId": "2110558982", "name": "Y. Jin"}, {"authorId": "46199013", "name": "Kyung-Min Seo"}], "citations": [{"paperId": "87733615e1af2904c0ba0332b822cc1c2d5f6aa3", "title": "Intelligent factory layout design framework through collaboration between optimization, simulation, and digital twin"}, {"paperId": "eedf69b50a3450d4b2092915da5b8d93707ef89c", "title": "A Study on Cognitive Error Validation for LED In-Ground Traffic Lights Using a Digital Twin and Virtual Environment"}, {"paperId": "b3af58f1112e92ac3d0bbd2d49f37da3336ef793", "title": "Content Analysis of Articles on Cyber-Physical Manufacturing Systems Published in SCI and SCI Expanded Indexed Journals Between 2015-2021"}, {"paperId": "3e684cb5eec8df8fd55a4833843085c49bc5d4be", "title": "Hybrid Model-Based Simulation Analysis on the Effects of Social Distancing Policy of the COVID-19 Epidemic"}, {"paperId": "3a6e1df171667c9e6b883b959baaef81b3e541e8", "title": "Production logistics digital twins: Research profiling, application, challenges and opportunities"}]}
