{"paperId": "c74a13b251b6af6dfce49eeb128b1c0e2ddf955d", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "A Preliminary Study of the Intrinsic Relationship between Complexity and Alignment", "abstract": "Training large language models (LLMs) with open-domain instruction data has yielded remarkable success in aligning to end tasks and human preferences. Extensive research has highlighted the importance of the quality and diversity of instruction data. However, the impact of data complexity, as a crucial metric, remains relatively unexplored from three aspects: (1)where the sustainability of performance improvements with increasing complexity is uncertain; (2)whether the improvement brought by complexity merely comes from introducing more training tokens; and (3)where the potential benefits of incorporating instructions from easy to difficult are not yet fully understood. In this paper, we propose Tree-Instruct to systematically enhance the instruction complexity in a controllable manner. By adding a specified number of nodes to instructions' semantic trees, this approach not only yields new instruction data from the modified tree but also allows us to control the difficulty level of modified instructions. Our preliminary experiments reveal the following insights: (1)Increasing complexity consistently leads to sustained performance improvements of LLMs. (2)Under the same token budget, a few complex instructions outperform diverse yet simple instructions. (3)Curriculum instruction tuning might not yield the anticipated results; focusing on increasing complexity appears to be the key.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-10", "journal": {"name": "ArXiv", "volume": "abs/2308.05696"}, "authors": [{"authorId": "2118977303", "name": "Ying Zhao"}, {"authorId": "48613402", "name": "Yu Bowen"}, {"authorId": "151471590", "name": "Binyuan Hui"}, {"authorId": "46493167", "name": "Haiyang Yu"}, {"authorId": "143857288", "name": "Fei Huang"}, {"authorId": "1527090216", "name": "Yongbin Li"}, {"authorId": "3587277", "name": "N. Zhang"}], "citations": [{"paperId": "b3cdde45d87a3a90d86ebe20c1ee8c4ef0150d1c", "title": "Scaling Data Diversity for Fine-Tuning Language Models in Human Alignment"}, {"paperId": "5c8d7a0f60cfd667f69fa00f7cc7c69812d83e99", "title": "TeaMs-RL: Teaching LLMs to Teach Themselves Better Instructions via Reinforcement Learning"}, {"paperId": "94db8a625418800c8ae7b48157a9cad1c8129051", "title": "A Survey on Knowledge Distillation of Large Language Models"}, {"paperId": "042ceb6be64a0b9a40bdbf7c96fe4dd7fabd93eb", "title": "Your Vision-Language Model Itself Is a Strong Filter: Towards High-Quality Instruction Tuning with Data Selection"}, {"paperId": "c991dedacba67949a28640cd8755de4c8ae297b0", "title": "A Survey on Data Selection for LLM Instruction Tuning"}, {"paperId": "41113411e1748a34bb80f12c761b7af1ed6dbb90", "title": "What Makes Good Data for Alignment? A Comprehensive Study of Automatic Data Selection in Instruction Tuning"}, {"paperId": "7a31971b0af439dec6fc484cca20df57f440b644", "title": "One Shot Learning as Instruction Data Prospector for Large Language Models"}, {"paperId": "117a9f9227ebe4acc67ff8a52eb9db2ab16390c8", "title": "Data Management For Large Language Models: A Survey"}, {"paperId": "84b7c486c56bd3880cb8eb01de9ae90ba3ebdaed", "title": "Shadow Alignment: The Ease of Subverting Safely-Aligned Language Models"}, {"paperId": "44a5a031c2487bca581a8cfc8013a026200aa6b0", "title": "Causal Document-Grounded Dialogue Pre-training"}, {"paperId": "19c222d1f18317d58cc85491f37479bc0dc49f41", "title": "API-Bank: A Comprehensive Benchmark for Tool-Augmented LLMs"}]}
