{"paperId": "c75340eccb22fe73d7715d5b92e4e24044bf3b44", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Predicting Academic Performance Using an Efficient Model Based on Fusion of Classifiers", "abstract": "In the past few years, educational data mining (EDM) has attracted the attention of researchers to enhance the quality of education. Predicting student academic performance is crucial to improving the value of education. Some research studies have been conducted which mainly focused on prediction of students’ performance at higher education. However, research related to performance prediction at the secondary level is scarce, whereas the secondary level tends to be a benchmark to describe students’ learning progress at further educational levels. Students’ failure or poor grades at lower secondary negatively impact them at the higher secondary level. Therefore, early prediction of performance is vital to keep students on a progressive track. This research intended to determine the critical factors that affect the performance of students at the secondary level and to build an efficient classification model through the fusion of single and ensemble-based classifiers for the prediction of academic performance. Firstly, three single classifiers including a Multilayer Perceptron (MLP), J48, and PART were observed along with three well-established ensemble algorithms encompassing Bagging (BAG), MultiBoost (MB), and Voting (VT) independently. To further enhance the performance of the abovementioned classifiers, nine other models were developed by the fusion of single and ensemble-based classifiers. The evaluation results showed that MultiBoost with MLP outperformed the others by achieving 98.7% accuracy, 98.6% precision, recall, and F-score. The study implies that the proposed model could be useful in identifying the academic performance of secondary level students at an early stage to improve the learning outcomes.", "venue": "Applied Sciences", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": null, "publicationDate": "2021-12-13", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "150032239", "name": "Ansar Siddique"}, {"authorId": "2144817353", "name": "Asiya Jan"}, {"authorId": "34965849", "name": "F. Majeed"}, {"authorId": "67036238", "name": "A. Qahmash"}, {"authorId": "20443622", "name": "Noorulhasan Naveed Quadri"}, {"authorId": "2145660903", "name": "Mohammad Osman Abdul Wahab"}], "citations": [{"paperId": "0666c8fae663661122ee1f5666b00cccee9d3743", "title": "Convolutional Neural Network for Predicting Student\nAcademic Performance in Intelligent Tutoring System"}, {"paperId": "57f840ed8df384a56271ef3061e7a21b30ac8c3d", "title": "Predicting secondary school student performance using a double particle swarm optimization-based categorical boosting model"}, {"paperId": "d5d5f1551c2a2e3ecdc793ac976b1647f0e87109", "title": "Analysis of Machine Learning Classification Approaches for Predicting Students’ Programming Aptitude"}, {"paperId": "52cb2d0d0ef0e568f10eb79eb89c15cb191d0419", "title": "Ensemble models based on CNN and LSTM for dropout prediction in MOOC"}, {"paperId": "a0e645f5bfba36d79b3fc728119350b4fc7bb93d", "title": "Forecasting Students' Employment Rate Under the OBE Model"}, {"paperId": "285b5c345a86fd8a093fdd198ab7c88d8e2a53c6", "title": "Research on the artistic expression form of traditional cultural imagery in sculpture modeling based on DE-GWO model"}, {"paperId": "fb7214d7c282dddf5239e7561f5863fb0ed4a96e", "title": "Karnauph Classifier: A Hybrid Mathematical Model for Data Classification"}, {"paperId": "7cbb4789a8a83eccab5518c27b770a722ec11a10", "title": "Academic Performance Prediction of At-Risk Students using Machine Learning Techniques"}, {"paperId": "47098422ebf53a79fb9ad189fe72d20ed0fdf715", "title": "Enhancement of E-Learning Student’s Performance Based on Ensemble Techniques"}, {"paperId": "d98a623268aa1f59f6c2421f6ab18fdcf944168b", "title": "Descriptive Statistical Analysis and Discretization of Academic Data for Machine Learning Techniques"}, {"paperId": "c0b5d4f3a33e4a33b51eb244d8d90bf8fa714cfd", "title": "A systematic review of the literature on machine learning application of determining the attributes influencing academic performance"}, {"paperId": "e87a0e7d55d1a1252770fab0daf4b3f1743f2aea", "title": "A Comparative Study on Specialization Courses Recommendation Through E-Learning using Classification Algorithms"}, {"paperId": "ad5cfda9bd97a21f33187055adcd4b28d8b34193", "title": "Link Prediction in Educational Graph Data to Predict Elective Course using Graph Convolutional Network Model"}, {"paperId": "ce9d7b79e1ef93a1a67e7db626bbfa96300e134b", "title": "Predicting Academic Performance of Students Using Machine Learning Models"}, {"paperId": "5a1f32dce72f02fbf65de04a8924fd028341ad5e", "title": "Predicting Student’s Academic Performance Using Data Mining Methods: Review Paper"}, {"paperId": "fd968dace0c8d170010252fef1aa74d4c32a3e2d", "title": "Using Data Mining Techniques To Enhance The Student Performance. A semantic review."}, {"paperId": "a979dbd6ce4672ee4503159e1d979cf800957f02", "title": "A Predictive Model using Machine Learning Algorithm in Identifying Students Probability on Passing Semestral Course"}, {"paperId": "5464f9001af9b1e6375503225c306adce5d4afce", "title": "Utilization of extremely precise analytics: A State-of-the-Art Approach and Future Potentials"}, {"paperId": "24e31889bde08aec3d7eccbdbf2e9027464ea577", "title": "Students behaviors and factors affecting online learning during the COVID-19 situation Based on Machine Learning"}, {"paperId": "53fbc5b100cc0ce2680d9ed60bd1d4f09362c0f5", "title": "Design and Application of School Management Evaluation Model for Decision-making"}, {"paperId": "5341c4fe6d932006627b3bcc685ad4ba9800348f", "title": "Systematic Review of Educational Data Mining for Student Performance Prediction using Bibliometric Network Analysis (SeBriNA)"}, {"paperId": "30e60f8ad56ee69704cccdb5e9903fce2dba2486", "title": "One Aggregated Approach in Multidisciplinary Based Modeling to Predict Further Students’ Education"}, {"paperId": "871491384c3b280ba1166ffafa87e8939b6e3e44", "title": "Recommendation of English Reading in Vocational Colleges Using Linear Regression Training Model"}, {"paperId": "cde8d822ebc4582441490ba69a73f1908d794aa8", "title": "Prediction of Student’s Performance With Learning Coefficients Using Regression Based Machine Learning Models"}, {"paperId": "641bd8c4fef0f4ba2bc1735a1547a4ddc7553ee7", "title": "TOWARD IMPROVING STUDENT PERFORMANCE IN AN ONLINE ENVIRONMENT USING EDUCATIONAL DATA MINING APPROACH"}]}
