{"paperId": "c75d592f649f9683f64eeb693556aade0e372e1e", "publicationVenue": {"id": "bc0ec6f4-964e-4140-99f6-98f49ee751a1", "name": "GIScience & Remote Sensing", "type": "journal", "alternate_names": ["Giscience  Remote Sens", "Giscience & Remote Sensing"], "issn": "1548-1603", "url": "http://www.tandfonline.com/loi/tgrs19"}, "title": "Proof of concept of a novel cloud computing approach for object-based remote sensing data analysis and classification", "abstract": "Advances in the development of Earth observation data acquisition systems have led to the continuously growing production of remote sensing datasets, for which timely analysis has become a major challenge. In this context, distributed computing technology can provide support for efficiently handling large amounts of data. Moreover, the use of distributed computing techniques, once restricted by the availability of physical computer clusters, is currently widespread due to the increasing offer of cloud computing infrastructure services. In this work, we introduce a cloud computing approach for object-based image analysis and classification of arbitrarily large remote sensing datasets. The approach is an original combination of different distributed methods which enables exploiting machine learning methods in the creation of classification models, through the use of a web-based notebook system. A prototype of the proposed approach was implemented with the methods available in the InterCloud system integrated with the Apache Zeppelin notebook system, for collaborative data analysis and visualization. In this implementation, the Apache Zeppelin system provided the means for using the scikit-learn Python machine learning library in the design of a classification model. In this work we also evaluated the approach with an object-based image land-cover classification of a GeoEye-1 scene, using resources from a commercial cloud computing infrastructure service provided. The obtained results showed the effectiveness of the approach in efficiently handling a large data volume in a scalable way, in terms of the number of allocated computing resources.", "venue": "GIScience & Remote Sensing", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2018-10-31", "journal": {"name": "GIScience & Remote Sensing", "pages": "536 - 553", "volume": "56"}, "authors": [{"authorId": "8856247", "name": "R. R. Antunes"}, {"authorId": "50594282", "name": "T. Blaschke"}, {"authorId": "2584015", "name": "D. Tiede"}, {"authorId": "2229780025", "name": "Edilson de Souza Bias"}, {"authorId": "144794424", "name": "G. Costa"}, {"authorId": "2222679", "name": "P. Happ"}], "citations": [{"paperId": "ee705fe72c437ac82546f59de251733a91118a77", "title": "Prototyping of Utilization Model for KOMPSAT-3/3A Analysis Ready Data Based on the Open Data Cube Platform in Multi-Cloud Computing Environment: A Case Study"}, {"paperId": "150d3f2478bca397098e11fe3cfffd28de2653f2", "title": "Scalable big earth observation data mining algorithms: a review"}, {"paperId": "9b04690cc9dd724414d23911ca4d36b8f68c8392", "title": "Construction of a Scoring Evaluation Model for Identifying Urban Functional Areas Based on Multisource Data"}, {"paperId": "1651ca2564b57a0f37908903528d103e4aab3f8b", "title": "UrbanWatch: A 1-meter resolution land cover and land use database for 22 major cities in the United States"}, {"paperId": "35493a7ab4ebfba2790d37041ff08b6f6e9ea95a", "title": "An Implementation of Open Source-Based Software as a Service (SaaS) to Produce TOA and TOC Reflectance of High-Resolution KOMPSAT-3/3A Satellite Image"}, {"paperId": "d3cbc32a4f4b288ffe2fb2894b16c40f44b0eb79", "title": "Large-scale urban functional zone mapping by integrating remote sensing images and open social data"}, {"paperId": "effc87e335d1d9d92a168c7260307757dcfe97db", "title": "Object-Based Shadow Index via Illumination Intensity from High Resolution Satellite Images over Urban Areas"}, {"paperId": "c8664c3a130c4c9a9a39530959b7e73c66161cb6", "title": "A Lightweight, Robust Exploitation System for Temporal Stacks of UAS Data: Use Case for Forward-Deployed Military or Emergency Responders"}, {"paperId": "8701fe454704fadf3c80739efe6c9e349880926d", "title": "Utilization of Geospatial Technology to Track Effects of Global Warming on Climate Changes in India"}]}
