{"paperId": "c75daf38ec84d306179277d08904101bc5f68d60", "publicationVenue": {"id": "0942fb86-c16f-4084-9902-10ddcfe18180", "name": "Micro", "type": "conference", "alternate_names": ["Int Symp Microarchitecture", "MICRO", "International Symposium on Microarchitecture", "Annual IEEE/ACM International Symposium on Microarchitecture", "Annu IEEE/ACM Int Symp Microarchitecture"], "issn": "0271-9002", "alternate_issns": ["2151-4143", "2673-8023"], "url": "http://www.microarch.org/"}, "title": "Swordfish: A Framework for Evaluating Deep Neural Network-based Basecalling using Computation-In-Memory with Non-Ideal Memristors", "abstract": "Basecalling, an essential step in many genome analysis studies, relies on large Deep Neural Networks (DNNs) to achieve high accuracy. Unfortunately, these DNNs are computationally slow and inefficient, leading to considerable delays and resource constraints in the sequence analysis process. A Computation-In-Memory (CIM) architecture using memristors can significantly accelerate the performance of DNNs. However, inherent device non-idealities and architectural limitations of such designs can greatly degrade the basecalling accuracy, which is critical for accurate genome analysis. To facilitate the adoption of memristor-based CIM designs for basecalling, it is important to (1) conduct a comprehensive analysis of potential CIM architectures and (2) develop effective strategies for mitigating the possible adverse effects of inherent device non-idealities and architectural limitations.This paper proposes Swordfish, a novel hardware/software co-design framework that can effectively address the two aforementioned issues. Swordfish incorporates seven circuit and device restrictions or non-idealities from characterized real memristor-based chips. Swordfish leverages various hardware/software co-design solutions to mitigate the basecalling accuracy loss due to such non-idealities. To demonstrate the effectiveness of Swordfish, we take Bonito, the state-of-the-art (i.e., accurate and fast), open-source basecaller as a case study. Our experimental results using Swordfish show that a CIM architecture can realistically accelerate Bonito for a wide range of real datasets by an average of 25.7×, with an accuracy loss of 6.01%.CCS CONCEPTS• Hardware → Analysis and design of emerging devices and systems; Memory and dense storage; Biology-related information processing.", "venue": "Micro", "year": 2023, "fieldsOfStudy": ["Computer Science", "Biology"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2023-10-06", "journal": {"name": "2023 56th IEEE/ACM International Symposium on Microarchitecture (MICRO)", "pages": "1437-1452"}, "authors": [{"authorId": "51017214", "name": "Taha Shahroodi"}, {"authorId": "2256934925", "name": "Gagandeep Singh"}, {"authorId": "1864957026", "name": "Mahdi Zahedi"}, {"authorId": "3064097", "name": "Haiyu Mao"}, {"authorId": "2160629076", "name": "Joel Lindegger"}, {"authorId": "3432690", "name": "Can Firtina"}, {"authorId": "2171100110", "name": "Stephan Wong"}, {"authorId": "2065984781", "name": "O. Mutlu"}, {"authorId": "2253779185", "name": "Said Hamdioui"}], "citations": [{"paperId": "c9edf92c1f762c52a90cc0cb45eb06d4eed82110", "title": "MIMDRAM: An End-to-End Processing-Using-DRAM System for High-Throughput, Energy-Efficient and Programmer-Transparent Multiple-Instruction Multiple-Data Computing"}, {"paperId": "d5f2e95be45d3e003655a9a84e0adda9468b0838", "title": "MIMDRAM: An End-to-End Processing-Using-DRAM System for High-Throughput, Energy-Efficient and Programmer-Transparent Multiple-Instruction Multiple-Data Processing"}, {"paperId": "0f2e49efe9885addc341a1cdb9c7910e68faeb26", "title": "High-Performance Data Mapping for BNNs on PCM-based Integrated Photonics"}]}
