{"paperId": "c7622d542fd5a0dc03358b35cdc997b127a4582d", "publicationVenue": {"id": "f6752838-f268-4a1b-87e7-c5f30a36713c", "name": "International Conference on Machine Learning and Applications", "type": "conference", "alternate_names": ["Int Conf Mach Learn Appl", "ICMLA"], "url": "http://www.icmla-conference.org/"}, "title": "A Real Time Stock tendency prognostication using Quantopian", "abstract": "Stock trends prediction project is about designing a strategy that helps in predicting the stock trends in real time. To achieve it, we have considered Quantopian, one of the world’s leading financial marketing strategy analysis as our platform. Quantopian follows the 3-Step approach of Alpha coding, Code Optimization & Portfolio. Alpha Code is the main algorithm that harbours, our strategy in stock trend prediction. We consider a single factor that influences our code and gradually come up with two or more factors combination to advance efficiency of optimization strategy. Sentiment factor is used to give an efficiency of 9.3% at the end of back testing. When the combination of sentiment, operation ratio and revenue growth are passed to alpha lens, it is found that the efficiency is raised to 64%, making it much more reliable and stable. The accuracy of multiple alpha factors model attains more than 60%, contrast with earlier prediction algorithms with a single alpha factor have around 9% accuracy increases with 51%.", "venue": "International Conference on Machine Learning and Applications", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-12-01", "journal": {"name": "2020 19th IEEE International Conference on Machine Learning and Applications (ICMLA)", "pages": "1260-1267"}, "authors": [{"authorId": "145511488", "name": "P. Rajesh"}, {"authorId": "2109936320", "name": "Mansoor Alam"}, {"authorId": "2504452", "name": "M. Tahernezhadi"}, {"authorId": "2051872393", "name": "K. V. Reddy"}, {"authorId": "72043957", "name": "K. Chandrakala"}], "citations": [{"paperId": "da40866c64b7ec3408f87542c8726284fdbd854c", "title": "Analysis Of Cyber Threat Detection And Emulation Using MITRE Attack Framework"}]}
