{"paperId": "c762a68a5eee112f11888d46ffdb6d1d405c7de8", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Crack Detection in Concrete Structures Using Deep Learning", "abstract": "Infrastructure, such as buildings, bridges, pavement, etc., needs to be examined periodically to maintain its reliability and structural health. Visual signs of cracks and depressions indicate stress and wear and tear over time, leading to failure/collapse if these cracks are located at critical locations, such as in load-bearing joints. Manual inspection is carried out by experienced inspectors who require long inspection times and rely on their empirical and subjective knowledge. This lengthy process results in delays that further compromise the infrastructure’s structural integrity. To address this limitation, this study proposes a deep learning (DL)-based autonomous crack detection method using the convolutional neural network (CNN) technique. To improve the CNN classification performance for enhanced pixel segmentation, 40,000 RGB images were processed before training a pretrained VGG16 architecture to create different CNN models. The chosen methods (grayscale, thresholding, and edge detection) have been used in image processing (IP) for crack detection, but not in DL. The study found that the grayscale models (F1 score for 10 epochs: 99.331%, 20 epochs: 99.549%) had a similar performance to the RGB models (F1 score for 10 epochs: 99.432%, 20 epochs: 99.533%), with the performance increasing at a greater rate with more training (grayscale: +2 TP, +11 TN images; RGB: +2 TP, +4 TN images). The thresholding and edge-detection models had reduced performance compared to the RGB models (20-epoch F1 score to RGB: thresholding −0.723%, edge detection −0.402%). This suggests that DL crack detection does not rely on colour. Hence, the model has implications for the automated crack detection of concrete infrastructures and the enhanced reliability of the gathered information.", "venue": "Sustainability", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-07-02", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "2175186250", "name": "Vaughn Peter Golding"}, {"authorId": "103731448", "name": "Zahra Gharineiat"}, {"authorId": "71940750", "name": "Hafiz Suliman Munawar"}, {"authorId": "2112554074", "name": "Fahim Ullah"}], "citations": [{"paperId": "1168fd681c6e3128c4cb2be86b4645d176d1197b", "title": "Crack Detection and Analysis of Concrete Structures Based on Neural Network and Clustering"}, {"paperId": "e4dd1e755291c556ad01ea00316a3a3ef202180c", "title": "Deep Learning for Concrete Crack Detection and Measurement"}, {"paperId": "4bc63d8d074453fd48b7f260b1a2f58fa24656eb", "title": "A comparison study of semantic segmentation networks for crack detection in construction materials"}, {"paperId": "b5ccc9880da538c5d0e2a8b248d26cd4bec51890", "title": "An Integrated Framework for Image Acquisition, Processing, and Analysis Procedures for Automated Damage Evaluation of Concrete Surfaces"}, {"paperId": "7c701f3d27307adeed6f339a12be4f01d7ae8373", "title": "Crack-JPU – A crack segmentation method using atrous convolution"}, {"paperId": "83bbf544cc53a5bedaff2327774521b20335e1ab", "title": "A pre-failure narrow concrete cracks dataset for engineering structures damage classification and segmentation"}, {"paperId": "7397a3bfb1db00870727b22535ec89164a4bb261", "title": "Structural Health Monitoring That Uses Light Stress Wave"}, {"paperId": "ea3225a8656f429786fab9b3bfa556a75b147b51", "title": "A survey on crack detection in concrete surface using image processing and machine learning"}, {"paperId": "b86e699d07e2032e1413c9e79c86acefaf4932eb", "title": "Crack Analysis of Textile Reinforced Concrete Using Automated Crack Evaluation via Digital Image Correlation"}, {"paperId": "9b73fa2281997061fd51596a0f7fe933ac6643aa", "title": "Automatic road crack detection and analysis system based on deep feature fusion and edge structure extraction"}, {"paperId": "ea31fc0648aa4322048ebd3dcef3790e2e64ed5a", "title": "Accurate Crack Identification of Concrete Structures Based on Deep Bi-LSTM Model"}, {"paperId": "4800f46da954a35ffd3753b9a6eaafb36fc26d28", "title": "Automatic Concrete Surface Crack Recognition Using EfficientNetV2 Variants"}, {"paperId": "1ff690baa34308eb186846d05843e3aef1924f75", "title": "Analytical Method for Bridge Damage Using Deep Learning-Based Image Analysis Technology"}, {"paperId": "f45ae398e474852ecd14decc26adc8a53a71d52c", "title": "Data-driven approach for AI-based crack detection: techniques, challenges, and future scope"}, {"paperId": "51e39859de1fb878a0b4fbbaae57322a2203d538", "title": "Threshold-Based BRISQUE-Assisted Deep Learning for Enhancing Crack Detection in Concrete Structures"}, {"paperId": "baffd11e2f8afe9fc62f074b7ca7146c47d8c30e", "title": "Detection of Surface Defects Inside Concrete Pipelines Using Trained Model on JetRacer Kit"}, {"paperId": "8d8169a6c407032fa9de5fbe1a4c576ffca68f5e", "title": "Overcoming Overfitting Challenges with HOG Feature Extraction and XGBoost-Based Classification for Concrete Crack Monitoring"}, {"paperId": "75e2546c1a7724e46b1cdb4a2a8ba6bb47895d5a", "title": "Localization of Cracks in Concrete Structures Lacking Reference Objects and Feature Points Using an Unmanned Aerial Vehicle"}, {"paperId": "a7c148840f8713cb4bdccb7f7c32b26b804b40f4", "title": "Convolutional Neural Network for Predicting Failure Type in Concrete Cylinders During Compression Testing"}, {"paperId": "7e302e446bb988b0e10161d28844de21faca7ca0", "title": "Optimizing Image Processing with CNNs through Transfer Learning: Survey"}, {"paperId": "1cffadbfe9e706a4ff9318d68c6ec9aac6bd6e6f", "title": "Method for Concrete Structure Analysis by Microscopy of Hardened Cement Paste and Crack Segmentation Using a Convolutional Neural Network"}, {"paperId": "8c7a6bcbb945dad657906dfd1a0bafa96d1f3055", "title": "Development of Image Processing Techniques in Crack Detection and Analysis"}, {"paperId": "8877bcda538492599e540fe92e12161b07ed26a4", "title": "Building Surface Crack Detection Using Deep Learning Technology"}, {"paperId": "645897f1090ad39ba241400e42e497ca8077ff46", "title": "Automatic quantification of concrete cracks via multistage image filtration and trajectory-based local binarization"}, {"paperId": "7a8dba1a3db6d518c6594361cf4ad69593fb44f0", "title": "Detection and classification of pavement damages using wavelet scattering transform, fractal dimension by box-counting method and machine learning algorithms"}, {"paperId": "fb6c3b5dd7d4573588b392752298ea7c6ce9a960", "title": "A novel directional lighting algorithm for concrete crack pixel-level segmentation"}, {"paperId": "dce9f8c3c974a6a78865944aa98b13826370c450", "title": "Performance evaluation of an improved deep CNN-based concrete crack detection algorithm"}, {"paperId": "eec8d644c77c566472e67a4ea22ef85efebc9524", "title": "Automatic detection and measurement of ground crack propagation using deep learning networks and an image processing technique"}, {"paperId": "cefe476cfaa57d3a1951fd03129201747a4f0179", "title": "Designing image processing tools for testing concrete bridges by a drone based on deep learning"}, {"paperId": "82c4070a372eb90f9093f8a763faa9cb09575270", "title": "Automated crack detection and crack depth prediction for reinforced concrete structures using deep learning"}, {"paperId": "0836d00ace733a1465437dcb4681e96852102fa6", "title": "Transfer and Unsupervised Learning: An Integrated Approach to Concrete Crack Image Analysis"}, {"paperId": "c40886249808c431b4def504443a061641054b0b", "title": "Climate Change Projection and Its Impacts on Building Façades in Singapore"}, {"paperId": "072d0c0e27387c4177bc5098471fc30d8ddefb62", "title": "Fast Detection of Missing Thin Propagating Cracks during Deep-Learning-Based Concrete Crack/Non-Crack Classification"}, {"paperId": "6c1fe0fdc14a2e5afbbd9f4fe750b8898162a55f", "title": "Empirical Modeling of Transverse Displacements of Single-Sided Transversely Cracked Prismatic Tension Beams"}, {"paperId": "939830496df9572bb6b854d0d0b8d8c6a68ba944", "title": "A Deep Learning- Image Based Approach for Detecting Cracks in Buildings"}, {"paperId": "30abf734ec471e763efbd72249be524e15028736", "title": "ROAD: Robotics-Assisted Onsite Data Collection and Deep Learning Enabled Robotic Vision System for Identiﬁcation of Cracks on Diverse Surfaces"}, {"paperId": "2544ecd3b3b739e11b3b2da5eb9f1b751e26eb39", "title": "Damage Detection and Localisation using UAV/ Drone with Object Detection"}]}
