{"paperId": "c7869599127e6ad9eac3040e9106ba19bfa8641d", "publicationVenue": {"id": "80f1c497-53a8-4575-9bfc-fbd4d6607906", "name": "NJAS - Wageningen Journal of Life Sciences", "type": "journal", "alternate_names": ["Njas-wageningen J Life Sci", "NJAS  Wagening J Life Sci", "Njas-wageningen Journal of Life Sciences"], "issn": "1573-5214", "url": "https://www.journals.elsevier.com/njas-wageningen-journal-of-life-sciences"}, "title": "Key questions on the use of big data in farming: An activity theory approach", "abstract": null, "venue": "NJAS - Wageningen Journal of Life Sciences", "year": 2019, "fieldsOfStudy": ["Business"], "publicationTypes": null, "publicationDate": "2019-12-01", "journal": {"name": "NJAS: Wageningen Journal of Life Sciences", "pages": "1 - 12", "volume": "90-91"}, "authors": [{"authorId": "16090849", "name": "Evagelos D. Lioutas"}, {"authorId": "52584375", "name": "C. Charatsari"}, {"authorId": "2128700785", "name": "Giuseppe La Rocca"}, {"authorId": "114107757", "name": "M. De Rosa"}], "citations": [{"paperId": "598d49c67dfb83236fcf4b36f5a767def8edccad", "title": "How agriculture performs urbanity: connecting urbanization and socio-practical shifts in farming cultures"}, {"paperId": "b156f853d5ed521f411d951904a5c5bdcd03ad4a", "title": "The spatiotemporal characteristics and obstacle factors of the coupled and coordinated development of agricultural and rural digitalization and food system sustainability in China"}, {"paperId": "e256965a0bbf8a5a2c932846b35cc6e55c9d4642", "title": "Investigating the impact of agricultural informatization on the carbon shadow price"}, {"paperId": "6fec4ca8ec85ae97732e93e08899469e1a261b4b", "title": "Agroeconomic Indexes and Big Data: Digital Marketing Analytics Implications for Enhanced Decision Making with Artificial Intelligence-Based Modeling"}, {"paperId": "347b6ebb7b9dbf6fdf59441de19455331ee76d17", "title": "Climate smart agriculture for sustainable productivity and healthy landscapes"}, {"paperId": "d378725763572a1aa53eac89bea4a65813aeba81", "title": "Do Agricultural Knowledge and Innovation Systems Have the Dynamic Capabilities to Guide the Digital Transition of Short Food Supply Chains?"}, {"paperId": "70bfca46002caf0cfdf1889bcfa97e5464b8231c", "title": "Nutrient recovery from anaerobic digestate: Fertilizer informatics for circular economy."}, {"paperId": "2655f82366a194f2003803ff4e338f3e8a0003ea", "title": "Proposal for a framework to manage the barriers that hinder the development of agriculture 4.0 in the agricultural production chain"}, {"paperId": "29cd779763a41178b9ab92515aa2df03b751912b", "title": "Towards socio-digital rural territories to drive digital transformation: General conceptualisation and application to the olive areas of Andalusia, Spain"}, {"paperId": "81eb51d6bb8976e10dcc92bd1b5e18f35c93530b", "title": "Facets of value emerging through the operation of short food supply chains"}, {"paperId": "614425565b9cf586aa8da2f8df09a67a0dbeeda3", "title": "Agricultural Social Networks: An Agricultural Value Chain-Based Digitalization Framework for an Inclusive Digital Economy"}, {"paperId": "b01f8a992d1a68d202259346b0442260884e33d2", "title": "ICTs in Smart Agriculture: Paths to Build SDGs of Bangladesh"}, {"paperId": "36eb5f89fee2f09057dc022d8a83f84793219c7f", "title": "Creating shared value(s) from On-Farm Experimentation: ten key lessons learned from the development of the SoYield® digital solution in Africa"}, {"paperId": "9c2edcd91b541ef258770567c4a17a8d9a38bf83", "title": "Gestión inteligente de los datos en la agroindustria"}, {"paperId": "15f18f6c92454e0c18439761aebfac00881bc299", "title": "Heterogenous Urbanization and Agricultural Green Development Efficiency: Evidence from China"}, {"paperId": "29b06ea71c5cfb99a172a0218c58f2baccebfe77", "title": "Data on data: An analysis of data usage and analytics in the agricultural supply chain"}, {"paperId": "a7899f3b65724d49eaf670e15e47561069b0ae03", "title": "Spatial and temporal effects of China’s digital economy on rural revitalization"}, {"paperId": "d496fda30a9a5721d97b33f857d671479bbfeb85", "title": "Data analytics for crop management: a big data view"}, {"paperId": "8796412ad34fe4e6739690d59b8b34cc52b326f4", "title": "Big Data Technology Architecture Proposal for Smart Agriculture for Moroccan Fish Farming"}, {"paperId": "9780872a73e4a0f6ee97b5550dcd50a65f0e663a", "title": "Digital Technology Adoption for Plant Protection: Assembling the Environmental, Labour, Economic and Social Pieces of the Puzzle"}, {"paperId": "c14c8a792a558541459cdcbfc3e55afe213821e5", "title": "Implementation of relevant fourth industrial revolution innovations across the supply chain of fruits and vegetables: A short update on Traceability 4.0."}, {"paperId": "93a7d6eaa54b85fe0708fa155ab7f73c2b66d6bb", "title": "Can a robot be an expert? The social meaning of skill and its expression through the prospect of autonomous AgTech"}, {"paperId": "df2446ffd1b5c5b1abe53e34d03dbbb77068eb87", "title": "Dimensions of digital transformation in the context of modern agriculture"}, {"paperId": "c0fcc90a027caa416807e19c587feaddac88daee", "title": "Competitiveness of Food Industry in the Era of Digital Transformation towards Agriculture 4.0"}, {"paperId": "43a96851cf5bf8e364fb9e8d90eaf10b51cd47e7", "title": "Predicting climate factors based on big data analytics based agricultural disaster management"}, {"paperId": "63a61b7c6f47f53c5cb21e341408b5e41bf602bd", "title": "Digital transition and green growth in Chinese agriculture"}, {"paperId": "fc5dc9957e94273efddfd493681d68a83ba37a4d", "title": "Restoring sense out of disorder? Farmers’ changing social identities under big data and algorithms"}, {"paperId": "5bdaaf2d6928c4be4250ec9cf3e9f78051152db3", "title": "A survey on smart farming data, applications and techniques"}, {"paperId": "a2183e573c22440e4f09e6ef3bb4618b796c250a", "title": "Linking the diversity of ecologisation models to farmers' digital use profiles"}, {"paperId": "99ec4daa54d76042f8c7df004e2cb31c4dc81458", "title": "The effects of combined digital and human advisory services on reducing nitrogen fertilizer use: lessons from China’s national research programs on low carbon agriculture"}, {"paperId": "48bba5972002e02761f8abf377f5953c9f0f2fe9", "title": "Improve the Design Intelligence through Wireless Networks to Increase Agricultural Production in Provincial Countries"}, {"paperId": "138dc012022d351b6beac2c03cb8aa4b94916dcc", "title": "What are the priority research questions for digital agriculture?"}, {"paperId": "8480a524b80ea1bba9921208fd818137ae9afc57", "title": "Surveillance agriculture and peasant autonomy"}, {"paperId": "6ff50ad6430e25d4d0727ba25230a0b8f403e59a", "title": "Smart farming technologies adoption: Which factors play a role in the digital transition?"}, {"paperId": "2879a7c223904cfc1b6acc60a559a6ffc0f74179", "title": "AGRICULTURE 4.0"}, {"paperId": "cd248208fe8be4b8913405de08786fd0ce2831ee", "title": "Where Is My Crop? Data-Driven Initiatives to Support Integrated Multi-Stakeholder Agricultural Decisions"}, {"paperId": "fb02621457c758daaa600491b12b5949c81ef0d9", "title": "Production Management of Professional Farmers under the New Rural Construction Based on Big Data Technology"}, {"paperId": "2c6eb13853d04cabb70bfcdf28690e8887e76d00", "title": "Digitalization of agriculture: A way to solve the food problem or a trolley dilemma?"}, {"paperId": "491c0bb878913d1305be3bd708f55675ab8552a7", "title": "Evaluating the impact of big data analytics usage on the decision-making quality of organizations"}, {"paperId": "ef0b70c81ba141f373deac2aff13171ebec8bed9", "title": "Care in dairy farming with automatic milking systems, identified using an Activity Theory lens"}, {"paperId": "4fc82fc66bd7fe86cdbf2eb29ff3bc43c3bf4d67", "title": "Earth Observation and the New African Rural Datascapes: Defining an Agenda for Critical Research"}, {"paperId": "6ca294f37ef68858f1279a79836a7d5090e5676d", "title": "Reputational Risk Associated with Big Data Research and Development: An Interdisciplinary Perspective"}, {"paperId": "971c7d048adf6d25e241e8973a002ae917ba8da6", "title": "New but for whom? Discourses of innovation in precision agriculture"}, {"paperId": "2d46e3f814620482907b44d1927eea126576e4f7", "title": "The Role of Education in the Transition towards Sustainable Agriculture: A Family Farm Learning Perspective"}, {"paperId": "432e084efe91bcf20d84292cb70c281e0344cc54", "title": "Digital transformation of agriculture and rural areas: A socio-cyber-physical system framework to support responsibilisation"}, {"paperId": "cb40696ceacfedde9b37c1c92f9aec2b3912f4b3", "title": "Smart agriculture - Urgent need of the day in developing countries"}, {"paperId": "8bd1e635d635be77655c4c38c804d31a6f38bc1f", "title": "I have a garden on the Internet! Searching for the farmer in a remotely controlled farming enterprise"}, {"paperId": "85e942ba74a554bcde6955acccbfed71a94b1e91", "title": "Digital and virtual spaces as sites of extension and advisory services research: social media, gaming, and digitally integrated and augmented advice"}, {"paperId": "294f49c5a024958f75eb3054c2ffa41995909012", "title": "Big data for sustainable agri‐food supply chains: a review and future research perspectives"}, {"paperId": "8438b66a5efff82327dad148abf41928c31993b6", "title": "How Are Smallholder Farmers Involved in Digital Agriculture in Developing Countries: A Case Study from China"}, {"paperId": "87176f5b6a6aa7976c364426ad6ca90bb9259c1a", "title": "Developing industry-wide information management capabilities: A case study from British Columbia's tree fruit industry"}, {"paperId": "d3829b9f3f8bd37d3bd842dcaa2deff14c243d79", "title": "From Smart Farming towards Unmanned Farms: A New Mode of Agricultural Production"}, {"paperId": "d63b5be10e832d566fd0546de78d44fd7cb82030", "title": "A Smart and Sustainable Future for Viticulture Is Rooted in Soil: How to Face Cu Toxicity"}, {"paperId": "6c68d299ecdd0210306e2dfc6d16a87e7a36a666", "title": "Grasping at digitalisation: turning imagination into fact in the sugarcane farming community"}, {"paperId": "1f3004ee034b53420ecde4470577294902742a07", "title": "Agriculture 4.0: Making it work for people, production, and the planet"}, {"paperId": "42c668d8b1dde94a58fc7e0093a350469b0d40c5", "title": "Boosting Sustainable Innovation in Densely Populated Areas: A Milieux Innovateurs Approach"}, {"paperId": "9603c317aa07b1668ec06fa8db3bc019375f6151", "title": "Extension and Advisory Organizations on the Road to the Digitalization of Animal Farming: An Organizational Learning Perspective"}, {"paperId": "1ce5e77b98c400e73296cfd9822601faf735abb3", "title": "Perceptions of the Fourth Agricultural Revolution: What’s In, What’s Out, and What Consequences are Anticipated?"}, {"paperId": "104223779efec99a84ed9e9baf72cbec9c47a34b", "title": "Urban Bites and Agrarian Bytes: Digital Agriculture and Extended Urbanization"}, {"paperId": "07863399138a90525f7665dcb65216945ebc82e2", "title": "What Are the Implications of Digitalisation for Agricultural Knowledge?"}, {"paperId": "46939ebcb1f37a1aa3b74150bbf22f908566b099", "title": "Smart farming and short food supply chains: Are they compatible?"}, {"paperId": "c7323e8f0a041971bb6d2540ed53752b584de518", "title": "Adoption of precision farming tools: A context-related analysis"}, {"paperId": "6febb5969c299764f5a530ba52ce3b7bdb3a498e", "title": "Farming smarter with big data: Insights from the case of Australia's national dairy herd milk recording scheme"}, {"paperId": "86c272a409662c94b4af8b442e8bc6ed5be7ae1b", "title": "Main Motivational Factors of Farmers Adopting Precision Farming in Hungary"}, {"paperId": "51dc2e6fedc7b4ca98e145e91b73728369dee059", "title": "Digitalisation of agricultural knowledge and advice networks: A state-of-the-art review"}, {"paperId": "2c8fed07d6fcba33dcb88964e34f427ba3c82693", "title": "Big data in agriculture: Does the new oil lead to sustainability?"}, {"paperId": "5db1049523a8d7953125eb3ed7c3c1cafb1fc77c", "title": "MASTERING AGTECH AGAIN: EMERGING OF NEW TRAINING OFFERS AND INTERMEDIATE PLAYERS"}, {"paperId": "41b538a19eed589760b6ab636fb2e2265f8f7b61", "title": "A review of social science on digital agriculture, smart farming and agriculture 4.0: New contributions and a future research agenda"}, {"paperId": "8dcb3c8d402cb6e1b1f7af8794bf4ca57647a7b0", "title": "Co-creation of value-in-use through big data technology- a B2B agricultural perspective"}, {"paperId": "3a3b49ca77f870d88aaec39991d7a659483cdb1b", "title": "Awareness of industry 4.0 and its tools across the V4 countries, Serbia and Bulgaria"}]}
