{"paperId": "c787356771a862f6fa68ee654f867850c9d5dce3", "publicationVenue": {"id": "501c1070-b5d2-4ff0-ad6f-8769a0a1e13f", "name": "Wireless Communications and Mobile Computing", "type": "journal", "alternate_names": ["Wirel Commun Mob Comput"], "issn": "1530-8669", "url": "https://www.hindawi.com/journals/wcmc/", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/15308677", "http://www.interscience.wiley.com/jpages/1530-8669/"]}, "title": "Joint Task Offloading and Resource Allocation Strategy for DiffServ in Vehicular Cloud System", "abstract": "A vehicular cloud (VC) can reduce latency and improve resource utilization of the Internet of vehicles by effectively using the underutilized computing resources of nearby vehicles. Although the task offloading of the VC enhances road safety and traffic management on the Internet of vehicles and meets the low-latency requirements for driving safety services on the Internet of vehicles business, there are still some key challenges such as the resource allocation mechanism of differentiated services (DiffServ) and task offloading mechanism of improving user experience. To address these issues, we study the task offloading and resource allocation strategy of the VC system where tasks generated by vehicles can be offloaded and executed cooperatively by vehicles in VC. Specifically, the computing task is further divided into independent subtasks and executed in different vehicles in VC to maximize the offloading utility. Considering the mobility of vehicles, the deadline of tasks, and the limited computing resources, we propose the optimization problem of task offloading in the VC system in the cause of improved user experience. To characterize the difference in service requirements resulting from the diversity of tasks, a DiffServ model focusing on the pricing of a task is utilized. The initial pricing of a task is tailored by the characteristics of the task and the uniqueness of the network status. In this model, tasks are sorted and processed in order according to task pricing, so as to optimize resource allocation. Numerical results show that the proposed scheme can effectively increase the resource utilization and task completion ratio.", "venue": "Wireless Communications and Mobile Computing", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-11-01", "journal": {"name": "Wirel. Commun. Mob. Comput.", "pages": "8823173:1-8823173:15", "volume": "2020"}, "authors": [{"authorId": "2109899018", "name": "Ya Kang"}, {"authorId": "47781143", "name": "Zhanjun Liu"}, {"authorId": "8559810", "name": "Qianbin Chen"}, {"authorId": "2030903685", "name": "Yingdi Dai"}], "citations": [{"paperId": "199ee0fd2fe90b31c81fd104813d342f25f1b640", "title": "Computing Resource Allocation Strategy Based on Mobile Edge Computing in Internet of Vehicles Environment"}, {"paperId": "4ba44ff44cbfcd8311511353d6c76593b6a3833a", "title": "The trade-offs between Fog Processing and Communications in latency-sensitive Vehicular Fog Computing"}]}
