{"paperId": "c791e5c6dca7e0cd274d54f0946a1dca9efed291", "publicationVenue": null, "title": "Analytical system based on Big Data for digital transformation in Higher Education", "abstract": "Currently higher education institutions are generating a lot of data as a result of their internal processes, but the limiting human capacities for the processing and analysis of large volumes of data cause these institutions to make hasty decisions and without real support, so it is necessary to use computational tools such as analytical systems that allow to speed up decision making based on data. The type of study is mixed and applied with a quasi-experimental design. An analytical system based on eight stages was built, which are: user characterization, business requirements, storage, technological infrastructure, feature engineering, computational processing, visualization and decision making. The analytical system was validated with data from the SQL Server management system of the academic services office and fifteen Excel files from the admission office oriented to academic data in a higher educational institution. The use of various algorithms such as support vector machine, random forest, k nearest neighbours, and neural networks, among others, was applied. The evaluation of the results generated by these algorithms allowed us to identify the support vector machine algorithm with 94.21% accuracy.", "venue": "2022 IEEE 2nd International Conference on Advanced Learning Technologies on Education & Research (ICALTER)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-11-16", "journal": {"name": "2022 IEEE 2nd International Conference on Advanced Learning Technologies on Education & Research (ICALTER)", "pages": "1-4"}, "authors": [{"authorId": "2044579589", "name": "R. Alarcón"}, {"authorId": "2044580272", "name": "Jessie Bravo"}, {"authorId": "2193205189", "name": "Carlos Valdivia"}, {"authorId": "77714534", "name": "J. Aquino"}], "citations": []}
