{"paperId": "c795da8782a7251ae8827028fc974d3a0266cbbe", "publicationVenue": {"id": "c3e5f1c8-9ba7-47e5-acde-53063a69d483", "name": "Future Internet", "type": "journal", "issn": "1999-5903", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-156830", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-156830", "https://www.mdpi.com/journal/futureinternet"]}, "title": "CMS: A Continuous Machine-Learning and Serving Platform for Industrial Big Data", "abstract": "The life-long monitoring and analysis for complex industrial equipment demands a continuously evolvable machine-learning platform. The machine-learning model must be quickly regenerated and updated. This demands the careful orchestration of trainers for model generation and modelets for model serving without the interruption of normal operations. This paper proposes a container-based Continuous Machine-Learning and Serving (CMS) platform. By designing out-of-the-box common architecture for trainers and modelets, it simplifies the model training and deployment process with minimal human interference. An orchestrator is proposed to manage the trainer’s execution and enables the model updating without interrupting the online operation of model serving. CMS has been deployed in a 1000 MW thermal power plant for about five months. The system running results show that the accuracy of eight models remains at a good level even when they experience major renovations. Moreover, CMS proved to be a resource-efficient, effective resource isolation and seamless model switching with little overhead.", "venue": "Future Internet", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-06-10", "journal": {"name": "Future Internet", "pages": "102", "volume": "12"}, "authors": [{"authorId": "2149141938", "name": "KeDi Li"}, {"authorId": "1780829", "name": "Ning Gui"}], "citations": [{"paperId": "67e92d4ec3546bd9ebe6a07e91ed3deb6727afd2", "title": "An event-driven fusion framework with auto-scaling of edge intelligence for resilient smart applications in developing countries"}, {"paperId": "120d671f6aabbc4920306c3f22cf828aa433ba8a", "title": "StreamAI: Dealing with Challenges of Continual Learning Systems for Serving AI in Production"}, {"paperId": "981c9e2a244007c974e000ac1ef16170b960eca3", "title": "StreamFlow: A System for Summarizing and Learning Over Industrial Big Data Streams"}, {"paperId": "a12e64c8bd53136147862b570981581758e4937e", "title": "Management of Machine Learning Lifecycle Artifacts"}, {"paperId": "745093391442971373d2af7549b00651a4636808", "title": "Deep Learning Workload Scheduling in GPU Datacenters: Taxonomy, Challenges and Vision"}, {"paperId": "823f0a49af84c59a302ba88e8ef1c516bad5d686", "title": "Architecture for Enabling Edge Inference via Model Transfer from Cloud Domain in a Kubernetes Environment"}, {"paperId": "2d8edb33660c295c2126d7802cb5db01f5ecf3e1", "title": "Economic Granularity Interval in Decision Tree Algorithm Standardization from an Open Innovation Perspective: Towards a Platform for Sustainable Matching"}, {"paperId": "883b5a6cbbf3c499c8402204a657abf1e836d310", "title": "Deep Learning Workload Scheduling in GPU Datacenters: A Survey"}, {"paperId": "ab0944d75ff65544fd83283b9539f49768772853", "title": "Implementing machine learning algorithms on spark"}]}
