{"paperId": "c7a00ddec94eb211aace9462725d880d94d3a8b0", "publicationVenue": {"id": "abc0c598-b988-4841-a8c5-65bfa6f3df77", "name": "Biomedicines", "type": "journal", "issn": "2227-9059", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-327040", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-327040", "https://www.mdpi.com/journal/biomedicines"]}, "title": "Effectiveness and Safety Profiles of Biological Therapies in Inflammatory Bowel Disease: Real Life Data from an Active Pharmacovigilance Project", "abstract": "Post-marketing surveillance is essential to evaluate the risk/benefit profile of drugs; however, pharmacovigilance studies comparing persistence and safety of biologic therapies in patients with inflammatory bowel disease (IBD) are scant. The aim of this study was to prospectively investigate persistence together with safety profiles of biologics in a cohort of patients diagnosed with Crohn’s Disease (CD) or ulcerative colitis (UC) followed by the IBD unit of Messina and treated with infliximab (IFX), adalimumab (ADA), golimumab (GOL), vedolizumab (VED), and ustekinumab (UST) from 2017 through 2021. Descriptive and treatment persistence analyses with predictors for discontinuation and occurrence of adverse drug reactions (ADRs) were performed. A total of 675 IBD patients were enrolled. A higher persistence rate was noted for UST and ADA in the first year (83.8% and 83.1%, respectively) and for IFX in the fifth year of treatment (58.1%). GOL, VED, and UST—all used as second/third-line therapies—seemed to have a higher risk of non-persistence than IFX (in order HR: 2.19; CI 95%: 1.33–3.61, 1.45; 1.04–2.04, 2.25; 1.25–4.07) as well as switchers and those who had at least one ADR (18.1; 13.22–24.68 and 1.55; 1.20–1.99, respectively). The reported ADRs, which were generally mild–moderate, were largely known. However, real-world data should be implemented to further study undetected safety concerns, including risk of malignancy.", "venue": "Biomedicines", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-12-01", "journal": {"name": "Biomedicines", "volume": "10"}, "authors": [{"authorId": "49189814", "name": "M. A. Barbieri"}, {"authorId": "47186680", "name": "A. Viola"}, {"authorId": "49390936", "name": "G. Cicala"}, {"authorId": "3983056", "name": "E. Spina"}, {"authorId": "145750630", "name": "W. Fries"}], "citations": [{"paperId": "0c7b10f6f8f630795c4bad60e38d4e5add335c30", "title": "Ustekinumab as induction and maintenance therapy for ulcerative colitis - national extended follow-up and a review of the literature."}, {"paperId": "8df3b805a700dcfe39aa0b32c01ac726dbe4e2bc", "title": "Effectiveness of vedolizumab and ustekinumab as second biologic agent in achieving target outcomes in tumor necrosis factor antagonists experienced patients with inflammatory bowel disease (enroll-ex study)"}, {"paperId": "2a1997f82f0e117146661ac97e99d9cb524616d9", "title": "Real-World Persistency for Inflammatory Bowel Disease Biologics Using Patient Registry Data"}, {"paperId": "f9c97644c8e45ec4760e7bed67e6e3da889f66a8", "title": "Editorial: Novel Therapeutic Approaches in Inflammatory Bowel Diseases"}, {"paperId": "e99485253a8aae87ee4e233f12bc1a0dc20a1890", "title": "Effectiveness and Safety Profile of Dupilumab in Chronic Rhinosinusitis with Nasal Polyps: Real-Life Data in Tertiary Care"}]}
