{"paperId": "c7ade2578cf289cc7eed554b8c56c9bc17d9a169", "publicationVenue": {"id": "1620da87-4387-4b9a-9bf4-22fdf74d4dc3", "name": "Symmetry", "type": "journal", "issn": "2073-8994", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172134", "alternate_urls": ["https://www.mdpi.com/journal/symmetry", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172134"]}, "title": "Encryption Techniques for Smart Systems Data Security Offloaded to the Cloud", "abstract": "With technological advancement, cloud computing paradigms are gaining massive popularity in the ever-changing technological advancement. The main objective of the cloud computing system is to provide on-demand storage and computing resources to the users on the pay-per-use policy. It allows small businesses to use top-notch infrastructure at low expense. However, due to the cloud resource sharing property, data privacy and security are significant concerns and barriers for smart systems to constantly transfer generated data to the cloud computing resources, which a third-party provider manages. Many encryption techniques have been proposed to cope with data security issues. In this paper, different existing data protection and encryption techniques based on common parameters have been critically analyzed and their workflows are graphically presented. This survey aims to collect existing data encryption techniques widely presented in the literature for smart system data security offloaded to the cloud computing systems under a single umbrella.", "venue": "Symmetry", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-03-28", "journal": {"name": "Symmetry", "pages": "695", "volume": "14"}, "authors": [{"authorId": "2146014119", "name": "M. B. Qureshi"}, {"authorId": "2220613", "name": "M. S. Qureshi"}, {"authorId": "2161169575", "name": "Saqib Tahir"}, {"authorId": "2015840497", "name": "Aamir Anwar"}, {"authorId": "1734991546", "name": "Saddam Hussain"}, {"authorId": "37153708", "name": "Mueen Uddin"}, {"authorId": "2347199", "name": "Chin-Ling Chen"}], "citations": [{"paperId": "bac308e8a3c10f39b47e2f82c2ec0b9673b58c79", "title": "User-Centric Approach to Fortify Cloud Data Security with Hybrid Cryptosystem Methods"}, {"paperId": "2253fb7cff367fe14a019fd8b4a55a0104675728", "title": "Enhancing Trustworthiness and Security in Cloud Environments: A Review of Methodologies and Advancements"}, {"paperId": "c31f97c575a6a007ba275d6acaf9906aa4fb03b6", "title": "Comparative analysis of enhanced hybrid encryption algorithm with single encryption algorithm"}, {"paperId": "c4bf9b3112a00b35f7296d02202692e16f5dc6b4", "title": "A Data Security-based Efficient Compression and Encryption for Cloud Computing"}, {"paperId": "775bf2db8c1324de88834c9763c1baa2c701faa6", "title": "Cryptographic Encryption and Optimization for Internet of Things Based Medical Image Security"}, {"paperId": "8eea18b97deacb7e913900cc51d28e99af1603a0", "title": "The Effect of Virtual Reality and Augmented Reality on Managing Projects"}, {"paperId": "60f197cfeacdb31c7dff016c088842c5b7ea4660", "title": "Special Issue: Symmetric and Asymmetric Encryption in Blockchain"}, {"paperId": "fa5d9b4f8294f3127d984fbd49ffd0a19c28be85", "title": "A Systematic Literature Review on Contemporary and Future trends in Virtual Machine Scheduling Techniques in Cloud and Multi-Access Computing"}, {"paperId": "feb5a888bebcae7ce5c436f0f3b1bd6731126a26", "title": "Implementation of Big Data Cloud Computing Security: Systematic Review from Different Encryption Techniques Perspective"}]}
