{"paperId": "c7b15ef0019af2df5f11bb5d906657f65727a4af", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "ML-AQP: Query-Driven Approximate Query Processing based on Machine Learning", "abstract": "As more and more organizations rely on data-driven decision making, large-scale analytics become increasingly important. However, an analyst is often stuck waiting for an exact result. As such, organizations turn to Cloud providers that have infrastructure for efficiently analyzing large quantities of data. But, with increasing costs, organizations have to optimize their usage. Having a cheap alternative that provides speed and efficiency will go a long way. Concretely, we offer a solution that can provide approximate answers to aggregate queries, relying on Machine Learning (ML), which is able to work alongside Cloud systems. Our developed lightweight ML-led system can be stored on an analyst's local machine or deployed as a service to instantly answer analytic queries, having low response times and monetary/computational costs and energy footprint. To accomplish this we leverage the knowledge obtained by previously answered queries and build ML models that can estimate the result of new queries in an efficient and inexpensive manner. The capabilities of our system are demonstrated using extensive evaluation with both real and synthetic datasets/workloads and well known benchmarks.", "venue": "arXiv.org", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-03-14", "journal": {"name": "ArXiv", "volume": "abs/2003.06613"}, "authors": [{"authorId": "30432506", "name": "Fotis Savva"}, {"authorId": "145078804", "name": "C. Anagnostopoulos"}, {"authorId": "1732298", "name": "P. Triantafillou"}], "citations": [{"paperId": "bc285be8bd6337b397b656598e62a9ab5ea1c8de", "title": "Privacy-preserving Approximate Query Processing with Differentially Private Generative Models"}, {"paperId": "a360759a48ba29827ae1b590defe3676d12fe3c1", "title": "Efficient Strongly Polynomial Algorithms for Quantile Regression"}, {"paperId": "43974d7753da1acf1f70ad2f8f184971d5bdc2be", "title": "SQL Synthesis with Input-Output Example Based on Deep Learning"}, {"paperId": "8dcd6fb14077a738592bb3a19ba54e5b1f04f47c", "title": "Compiling Discrete Probabilistic Programs for Vectorized Exact Inference"}, {"paperId": "0ea66f20ca83d3df96014efbf4b4b0c2de8935fe", "title": "GAN-based Tabular Data Generator for Constructing Synopsis in Approximate Query Processing: Challenges and Solutions"}, {"paperId": "90084257c7d461beba330edc7770b0c44f893e68", "title": "Workload Prediction for Adaptive Approximate Query Processing"}, {"paperId": "f0ba6435039e3ab7700571fab92e1123e129db6e", "title": "Prioritized dynamic cube selection in data warehouse"}, {"paperId": "d53ef63ada540f20ebbf28aa47072e36c8faf024", "title": "LearnedSQLGen: Constraint-aware SQL Generation using Reinforcement Learning"}, {"paperId": "89f84b2158beea25ba3224d51ece2a35e87256fe", "title": "Astrid: Accurate Selectivity Estimation for String Predicates using Deep Learning"}, {"paperId": "87735c7ebbb1c682c3842877abe7148d3f848add", "title": "Approximating Aggregated SQL Queries with LSTM Networks"}, {"paperId": "df9be5632f07a9de378a0e4e08ec823e8d9d13d7", "title": "Large-scale Data Exploration Using Explanatory Regression Functions"}, {"paperId": "f5434f06c7b3f9bebcbd2c9edc3f2efadef0fb66", "title": "Benchmark of Probabilistic Programming Languages"}]}
