{"paperId": "c7bb9a172b477f180ed330619f2fab3d1d54a9ea", "publicationVenue": {"id": "d13e941e-4cac-4f1d-bdca-77d927e31f1b", "name": "ACM Symposium on Cloud Computing", "type": "conference", "alternate_names": ["System-on-Chip Conference", "ACM Symp Cloud Comput", "Syst Conf", "Symp Cloud Comput", "Annual IEEE International System-on-Chip Conference", "Symposium on Cloud Computing", "Annu IEEE Int Syst Conf", "SoCC"], "url": "http://www.ieee-socc.org/"}, "title": "PerfOrator: eloquent performance models for Resource Optimization", "abstract": "Query Optimization focuses on finding the best query execution plan, given fixed hardware resources. In BigData settings, both pay-as-you-go clouds and on-prem shared clusters, a complementary challenge emerges: Resource Optimization: find the best hardware resources, given an execution plan. In this world, provisioning is almost instantaneous and time-varying resources can be acquired on a per-query basis. This allows us to optimize allocations for completion time, resource usage, dollar cost, etc. These optimizations have a huge impact on performance and cost, and pivot around a core challenge: faithful resource-to-performance models for arbitrary BigData queries. This task is challenging for users and tools alike due to lack of good statistics (high-velocity, unstructured data), frequent use of UDFs, impact on performance of different hardware types and a lack of understanding of parallel execution at such a scale. We address this with PerfOrator, a novel approach to resource-to-performance modeling. PerfOrator employs nonlinear regression on profile runs to model arbitrary UDFs, calibration queries to generalize across hardware platforms, and analytical framework models to account for parallelism. The resulting estimates are orders of magnitude more accurate than existing approaches (e.g, Hive's optimizer), and have been successfully employed in two resource optimization scenarios: 1) optimize provisioning of clusters in cloud settings---with decisions within 1% of optimal, 2) reserve skyline of resources for SLA jobs---with accuracies over 10x better than human experts.", "venue": "ACM Symposium on Cloud Computing", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2016-10-05", "journal": {"name": "Proceedings of the Seventh ACM Symposium on Cloud Computing"}, "authors": [{"authorId": "30141706", "name": "K. Rajan"}, {"authorId": "2837227", "name": "Dharmesh Kakadia"}, {"authorId": "1692732", "name": "C. Curino"}, {"authorId": "2494730", "name": "Subru Krishnan"}], "citations": [{"paperId": "7fbb73f3e61ed9ab1f18d0290082729a46ca36cd", "title": "Towards a Peer-to-Peer Data Distribution Layer for Efficient and Collaborative Resource Optimization of Distributed Dataflow Applications"}, {"paperId": "10b591db5c6ccb770da45cc81d5ba6baa81189ce", "title": "Not All Resources are Visible: Exploiting Fragmented Shadow Resources in Shared-State Scheduler Architecture"}, {"paperId": "0f3b97eb980a9d4f07d606d5f483055e1ca178bd", "title": "Karasu: A Collaborative Approach to Efficient Cluster Configuration for Big Data Analytics"}, {"paperId": "2173448e26d8bec6edd4e2456b39944f0109868b", "title": "Cost-Intelligent Data Analytics in the Cloud"}, {"paperId": "e92469612a06a5d9b40e01103d7322fa2c55f64c", "title": "Smartpick: Workload Prediction for Serverless-enabled Scalable Data Analytics Systems"}, {"paperId": "281a3752b999b93e22da59268ca92a7142ac6919", "title": "SLearn: A Case for Task Sampling Based Learning for Cluster Job Scheduling"}, {"paperId": "742b3ede9a93f166e695ebedfc1bb060b60457ff", "title": "Selecting Efficient Cluster Resources for Data Analytics: When and How to Allocate for In-Memory Processing?"}, {"paperId": "03ff19954a57b692fa8f99f463fe9baeacade52f", "title": "Runtime Variation in Big Data Analytics"}, {"paperId": "1e07bd595fb68ae7187668dc1b23b9cc6bebe0b4", "title": "Escope: An Energy Efficiency Simulator for Internet Data Centers"}, {"paperId": "110af663cde4edaaeca56a96e5f379bca05af7de", "title": "Acela: Predictable Datacenter-level Maintenance Job Scheduling"}, {"paperId": "6a9bfc08af212ca74c6546e3fa57efa7a0bd8d43", "title": "Perona: Robust Infrastructure Fingerprinting for Resource-Efficient Big Data Analytics"}, {"paperId": "23a6e0bd5ef9e9deeb0b939b1521b97dc54a0707", "title": "Ruya: Memory-Aware Iterative Optimization of Cluster Configurations for Big Data Processing"}, {"paperId": "96cd0d31b6188cae63cab75cbdc67141f158b11e", "title": "Fine-Grained Modeling and Optimization for Intelligent Resource Management in Big Data Processing"}, {"paperId": "7d434537cce3fd903e1ba09e694895fbe3628cbc", "title": "Get Your Memory Right: The Crispy Resource Allocation Assistant for Large-Scale Data Processing"}, {"paperId": "38511a8a8d6ca24c4676c954fb05d578e444ec46", "title": "Collaborative Cluster Configuration for Distributed Data-Parallel Processing: A Research Overview"}, {"paperId": "ea38182f7626bb75b12a1f35b97664c8a3298209", "title": "A Resource-Aware Deep Cost Model for Big Data Query Processing"}, {"paperId": "2f268203e9ec98efbfe773d41d3f07d28653f6f3", "title": "Kuber: Cost-Efficient Microservice Deployment Planner"}, {"paperId": "9c9a6a89396be6b1faa808df108b10f0bb2b65ec", "title": "Predictive Price-Performance Optimization for Serverless Query Processing"}, {"paperId": "b48a29b46994c409406ad9eb609e5b0f3d4b1edc", "title": "Training Data Reduction for Performance Models of Data Analytics Jobs in the Cloud"}, {"paperId": "291d89ab3cbd3022c7d701f3087b298bd5eebe8a", "title": "Enel: Context-Aware Dynamic Scaling of Distributed Dataflow Jobs using Graph Propagation"}, {"paperId": "ca938ac977be684e1178e6be6665770f7b496ac1", "title": "A Case for Task Sampling based Learning for Cluster Job Scheduling"}, {"paperId": "a30259926120393ee08378ab58ab1bc2f562b6fb", "title": "Silhouette: Efficient Cloud Configuration Exploration for Large-Scale Analytics"}, {"paperId": "3b9b92f142c09976e1f9e682ebe4b8243dc48a35", "title": "Bellamy: Reusing Performance Models for Distributed Dataflow Jobs Across Contexts"}, {"paperId": "c8a02b5663fda6d3267f9f177b855b58473494fd", "title": "C3O: Collaborative Cluster Configuration Optimization for Distributed Data Processing in Public Clouds"}, {"paperId": "f68f33eafa34d1406f464caf573c0d30c3bb76b3", "title": "Optimal Resource Allocation for Serverless Queries"}, {"paperId": "cd2cffd679291c11ae3989fbe2f76a4b686777a9", "title": "AutoExecutor: Predictive Parallelism for Spark SQL Queries"}, {"paperId": "1586c70a2e39d67f2ac5928647c241809881376b", "title": "Spark-based Cloud Data Analytics using Multi-Objective Optimization"}, {"paperId": "3f94a3d1a07f78f9158dafb646ee37ea49499e28", "title": "Efficient Deep Learning Pipelines for Accurate Cost Estimations Over Large Scale Query Workload"}, {"paperId": "839b3bcbce0babd5c53f556f78940fd213f8e2bc", "title": "Neural-based Modeling for Performance Tuning of Spark Data Analytics"}, {"paperId": "b671dab1490a561d8b87b4fc003982d7c76fdb45", "title": "Towards Collaborative Optimization of Cluster Configurations for Distributed Dataflow Jobs"}, {"paperId": "1ca4adaaf91488fec0488827db0929e1c5441204", "title": "Finding the right cloud configuration for analytics clusters"}, {"paperId": "4daecbf5af5dc2511abc31eecbfc2d8adb54db10", "title": "AutoToken"}, {"paperId": "d5a14f3ae52f35072a19d28c5c89d29764a5533a", "title": "Mary, Hugo, and Hugo*: Learning to schedule distributed data‐parallel processing jobs on shared clusters"}, {"paperId": "d90f6573cfeb11685bfbf69b2f04e37f6b033bda", "title": "A Comparative Exploration of ML Techniques for Tuning Query Degree of Parallelism"}, {"paperId": "32830a030c8e5723d776c7ad662b3556643c5240", "title": "Boosting Cloud Data Analytics using Multi-Objective Optimization"}, {"paperId": "03323fe27447fee94c0a91c156e2155b54a5a52e", "title": "Cost Models for Big Data Query Processing: Learning, Retrofitting, and Our Findings"}, {"paperId": "26b4be6fa998e34da4b9569c3b0cf1f437ab67e3", "title": "A novel approach to workload prediction using attention-based LSTM encoder-decoder network in cloud environment"}, {"paperId": "d180c4b7deaf2ac14b1b1a5d1076dc77fa4c88e9", "title": "Peregrine: Workload Optimization for Cloud Query Engines"}, {"paperId": "76a338373d27e359ca9bc830ff3d84a3e6beea81", "title": "UDAO: A Next-Generation Unified Data Analytics Optimizer"}, {"paperId": "3abdcb1b7462f7cca0ab381ea2befe84e41e2e93", "title": "MEER: Online Estimation of Optimal Memory Reservations for Long Lived Containers in In-Memory Cluster Computing"}, {"paperId": "2d16e281626ed91388fad6792975a032c7e59231", "title": "Cloud Pricing: The Spot Market Strikes Back"}, {"paperId": "86062508e77342223f37acd8d34567a7b3f136cd", "title": "TPShare: A Time-Space Sharing Scheduling Abstraction for Shared Cloud via Vertical Labels"}, {"paperId": "0839757baec73787e09f775e89eb22761b349b10", "title": "CoBell: Runtime Prediction for Distributed Dataflow Jobs in Shared Clusters"}, {"paperId": "f4cbb050f4426f15e7ea633c79de387dc96a29e6", "title": "Towards a Learning Optimizer for Shared Clouds"}, {"paperId": "b3ddcd576c959270c7de1bbe28541f568ee000d2", "title": "3Sigma: distribution-based cluster scheduling for runtime uncertainty"}, {"paperId": "93a06eb066fe58ed7d036e46e4cee53483e16bb8", "title": "Optimus: an efficient dynamic resource scheduler for deep learning clusters"}, {"paperId": "ed503975db8db02f00d1a5939c545cb7c598549e", "title": "On the cluster admission problem for cloud computing"}, {"paperId": "802ab2a96b8f152397d859e8c840f808527a72d5", "title": "Bayesian Admission Policies for Cloud Computing Clusters"}, {"paperId": "09fd3b450fd5dd9226cfd0650046487c40fff4de", "title": "The Power of Machine Learning and Market Design for Cloud Computing Admission Control"}, {"paperId": "be71508349311d1e1c9ec27ca838c5d33167ae9a", "title": "Query and Resource Optimization: Bridging the Gap"}, {"paperId": "291c1f391a22c4e98f7ef1e590c4b0bc3baacf9f", "title": "Query and Resource Optimizations: A Case for Breaking the Wall in Big Data Systems"}, {"paperId": "fb3b5250f6120719c98413a9963d2711906eea74", "title": "Ellis: Dynamically Scaling Distributed Dataflows to Meet Runtime Targets"}, {"paperId": "de580138291876803d259d195c4ce571f6572e3a", "title": "Imbalance in the cloud: An analysis on Alibaba cluster trace"}, {"paperId": "e84e857c48f4c0e4438441610b08ff665d912009", "title": "The Effect of Resource Allocation and System Events on VM Consolidation"}, {"paperId": "748f97611f2c0a543d5a0e4de6360906cd0a80ba", "title": "Reproducible Distributed Clusters with Mutable Containers: To Minimize Cost and Provisioning Time"}, {"paperId": "a538810087c7d8b240bf512ae997144fcbea466f", "title": "Towards Optimal Resource Allocation for Big Data Analytics"}, {"paperId": "1a8ad8146253a2f0e476566ebf0c494a337e8dea", "title": "Towards Plan-aware Resource Allocation in Serverless Query Processing"}, {"paperId": "98d390f0a7c397a12b17db464fa0491b1fbd48fc", "title": "Container Cluster Scheduling Strategy Based on Delay Decision Under Multidimensional Constraints"}, {"paperId": "d235f90caf3e0ab390a92b9fd1be3f4dfbee4820", "title": "Data-Driven Intelligent Scheduling For Long Running Workloads In Large-Scale Datacenters"}, {"paperId": "a533976b252e4faa6cdb1466bb3d56660862615c", "title": "ApplicationEllis Resource Manager Cluster Container Container Container Container App Client App Master Core App Worker App WorkerApp Worker Workload History Bell"}, {"paperId": "04230b7040043fc714b926a5108d82d655b37550", "title": "Adaptive Resource Management for Distributed Data Analytics"}, {"paperId": "63f007efb7133dc2371ddcba1a488a02b1c1bc33", "title": "An Automated Lightweight Framework for Scheduling and Proﬁling Parallel Workﬂows Simultaneously on Multiple Hypervisors"}, {"paperId": "13e73861c128a2a493bcd9f3467e90340933017b", "title": "Observation $ Workload encoding > Step 1 : AE Configuration ! Step 2 : NNR User Objective Latency ( Data sets • Machine Learning Workloads"}]}
