{"paperId": "c7c554ee309f242cd9533bf41647119cb30a5b7d", "publicationVenue": {"id": "8e1bd4b5-d5b2-4e22-ba0a-01fe5568d472", "name": "Remote Sensing", "type": "journal", "alternate_names": ["Remote Sens"], "issn": "2315-4675", "alternate_issns": ["2072-4292"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169233", "alternate_urls": ["https://www.mdpi.com/journal/remotesensing", "http://www.mdpi.com/journal/remotesensing", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169233"]}, "title": "A Scalable Computing Resources System for Remote Sensing Big Data Processing Using GeoPySpark Based on Spark on K8s", "abstract": "As a result of Earth observation (EO) entering the era of big data, a significant challenge relating to by the storage, analysis, and visualization of a massive amount of remote sensing (RS) data must be addressed. In this paper, we proposed a novel scalable computing resources system to achieve high-speed processing of RS big data in a parallel distributed architecture. To reduce data movement among computing nodes, the Hadoop Distributed File System (HDFS) is established on nodes of K8s, which are also used for computing. In the process of RS data analysis, we innovatively use the tile-oriented programming model instead of the traditional strip-oriented or pixel-oriented approach to better implement parallel computing in a Spark on Kubernetes (K8s) cluster. A large RS raster layer can be abstracted as a user-defined tile format of any size, so that a whole computing task can be divided into multiple distributed parallel tasks. The computing resources applied by users would be immediately assigned in the Spark on K8s cluster by simply configuring and initializing SparkContext through a web-based Jupyter notebook console. Users can easily query, write, or visualize data in any box size from the catalog module in GeoPySpark. In summary, the system proposed in this study can provide a distributed scalable resources system for assembling big data storage, parallel computing, and real-time visualization.", "venue": "Remote Sensing", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-01-22", "journal": {"name": "Remote. Sens.", "pages": "521", "volume": "14"}, "authors": [{"authorId": "2110006526", "name": "Jifu Guo"}, {"authorId": "1782096", "name": "Chunlin Huang"}, {"authorId": "96499857", "name": "Jinliang Hou"}], "citations": [{"paperId": "735bb67351e258fd18974235309fbcbfd478ddbe", "title": "AI-driven reinforced optimal cloud resource allocation (ROCRA) for high-speed satellite imagery data processing"}, {"paperId": "06371b35d10139adaef4a07d96fc7155c41aeac8", "title": "A Case Study of Big Data Processing in the Cloud Environments with Insights into Advantages, Tools, and Techniques"}, {"paperId": "5193019ad9b394ff3cf409e9c89cfdd55ce0ae0a", "title": "Exploring the Advancements in High-Performance Computing Paradigm for Remote Sensing Big Data Analytics"}, {"paperId": "81dd30876a76548a1e42a8a3332efc0b12fd4468", "title": "Analysis of Optimization Strategies for Big Data Storage Management: A Study"}, {"paperId": "21dd9e04b4592f2ebe87c991ebfd0604d22c930b", "title": "Scalable Data Processing Platform for Earth Observation Data Repositories"}, {"paperId": "7781022647e5398f6ec1f71dd1b407ee08a1cc1b", "title": "Post-Covid Remote Patient Monitoring using Medical Internet of Things and Machine Learning Analytics"}, {"paperId": "6ef116c2cd7a6ebb7e0e9ea91d41363ecc04742e", "title": "Land Use and Land Cover Mapping Using Sentinel-2, Landsat-8 Satellite Images, and Google Earth Engine: A Comparison of Two Composition Methods"}, {"paperId": "d2d39791acd79a6f66e007c7980dfbaebaab5f02", "title": "CUTCI: A GPU-Accelerated Computing Method for the Universal Thermal Climate Index"}]}
