{"paperId": "c7dc71e727b4760eeeb5a972fdbbc42cff2fea43", "publicationVenue": null, "title": "When the Echo Chamber Shatters: Examining the Use of Community-Specific Language Post-Subreddit Ban", "abstract": "Community-level bans are a common tool against groups that enable online harassment and harmful speech. Unfortunately, the efficacy of community bans has only been partially studied and with mixed results. Here, we provide a flexible unsupervised methodology to identify in-group language and track user activity on Reddit both before and after the ban of a community (subreddit). We use a simple word frequency divergence to identify uncommon words overrepresented in a given community, not as a proxy for harmful speech but as a linguistic signature of the community. We apply our method to 15 banned subreddits, and find that community response is heterogeneous between subreddits and between users of a subreddit. Top users were more likely to become less active overall, while random users often reduced use of in-group language without decreasing activity. Finally, we find some evidence that the effectiveness of bans aligns with the content of a community. Users of dark humor communities were largely unaffected by bans while users of communities organized around white supremacy and fascism were the most affected. Altogether, our results show that bans do not affect all groups or users equally, and pave the way to understanding the effect of bans across communities.", "venue": "WOAH", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-06-30", "journal": {"name": "ArXiv", "volume": "abs/2106.16207"}, "authors": [{"authorId": "1612340138", "name": "Milo Z. Trujillo"}, {"authorId": "84101078", "name": "Samuel F. Rosenblatt"}, {"authorId": "1403270439", "name": "G. Anda-Jáuregui"}, {"authorId": "152916042", "name": "E. Moog"}, {"authorId": "18097270", "name": "B. Samson"}, {"authorId": "1387936232", "name": "Laurent Hébert-Dufresne"}, {"authorId": "143750914", "name": "Allison M. Roth"}], "citations": [{"paperId": "6013c83c2a06602ae3fda25009519890a549f712", "title": "The Great Ban: Efficacy and Unintended Consequences of a Massive Deplatforming Operation on Reddit"}, {"paperId": "9a12d0ebd5c68bc00848509ff6a451f3a1da0c4d", "title": "Do users adopt extremist beliefs from exposure to hate subreddits?"}, {"paperId": "4aa51d6f29d741b9a52e66706196dbe0b9acfdf9", "title": "Investigating the emotional experiences in eSports spectatorship: The case of League of Legends"}, {"paperId": "6acca2882b906bcf58d334e331bc93f2da7e8ba7", "title": "Moral consensus and divergence in partisan language use"}, {"paperId": "156af32506e22466edad5da313158642d07b04e7", "title": "How Do Users Experience Moderation?: A Systematic Literature Review"}, {"paperId": "10449fd1d346fa82d5e92f428339332cc4763bab", "title": "Pre-pandemic activity on a myalgic encephalomyelitis/chronic fatigue syndrome support forum is highly associated with later activity on a long COVID support forum for a variety of reasons: A mixed methods study"}, {"paperId": "8d9ca1e2c703e2752a4904c967a65d45d0bef5f6", "title": "Marked Personas: Using Natural Language Prompts to Measure Stereotypes in Language Models"}, {"paperId": "016cb06f7de32e12653f475abae3c44c97923993", "title": "One of Many: Assessing User-level Effects of Moderation Interventions on r/The_Donald"}, {"paperId": "e409f087ca26988d86fec968c6fc62068533a68a", "title": "Quantifying How Hateful Communities Radicalize Online Users"}, {"paperId": "d4bfa40f79c6b0f519c17755431732e0d76f0df6", "title": "BotBuster: Multi-platform Bot Detection Using A Mixture of Experts"}, {"paperId": "4b76d026d2a3311f4b38325a9860aa11431d41ec", "title": "Building socially responsible conversational agents using big data to support online learning: A case with Algebra Nation"}, {"paperId": "3114b445230aa29141bd727387c5107a087d0f14", "title": "Distinguishing In-Groups and Onlookers by Language Use"}]}
