{"paperId": "c7e0ee964008222d94afbdb1ba5ba88022226f6d", "publicationVenue": null, "title": "Current situation and path of foreign minority language protection based on Internet of Things from the perspective of ethnic identity", "abstract": "Ethnic identity is an important reason for national unity. The formation of ethnic groups is mostly due to external and internal reasons, with a complex mechanism structure. When people’s environment is destroyed, this value identity will be stronger, national cohesion and solidarity will grow sharply, an unprecedented high. Minority languages are characterized by a wide variety, cultural generation, and dynamic evolution. The languages are complex and diverse, and are deeply influenced by their cultural heritage. This has led to the fact that for a long time, minority languages have been learned almost exclusively by people of their own ethnic group. This has led to a steady decline in the number of minority language speakers. However, the birth of the Internet of Things (IoT) has created an opportunity for the development of minority languages. Foreign minority languages have the following status (1) rapid decline (2) many endangered languages (3) low willingness to learn. In order to further investigate the current situation of minority language protection, the team conducted a survey in the minority cluster A. The results of the survey are as follows: most of the villagers are in love with the ethnic language and must inherit and promote the ethnic language, which is the wealth of a nation, but there are also a few residents who think that Mandarin should be used to replace the ethnic language. This reflects that most of the residents love the national language, but their young people as the inherited generation lose their love for the national language and are not willing to inherit and promote it. To solve this problem, an Internet of Things (IoT)-based ethnic language data system has been constructed so that the data system for ethnic minority language protection built through IoT technology can become the last line of defense for protecting ethnic languages, while allowing ethnic languages to be known and understood by more people through IoT technology, fostering the love and reverence of ethnic minority people for ethnic languages, and enhancing other ethnic groups’ sense of identity and support for ethnic languages. We propose to protect minority languages. Ultimately, we propose recommendations for the preservation of minority languages. (1) Increase publicity for minority language preservation. (2) Construct laws and regulations related to minority language protection. (3) Conduct in-depth research on minority language work and build an information base. (4) Promote minority language education.", "venue": "J. Comput. Methods Sci. Eng.", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-06-29", "journal": {"name": "J. Comput. Methods Sci. Eng.", "pages": "2677-2686", "volume": "23"}, "authors": [{"authorId": "2111287242", "name": "Qian Huang"}], "citations": []}
