{"paperId": "c7eaf8bd2e246de2cd4287b01b964be966e30b3e", "publicationVenue": {"id": "4e9ea460-80aa-4d97-81c8-b66845b38131", "name": "Transport", "type": "journal", "alternate_names": ["Transp Res J Vilnius Gedim Tech Univ Lith Acad Sci", "Transport: Research Journal of Vilnius Gediminas Technical University and Lithuanian Academy of Sciences"], "issn": "1648-3480", "url": "http://www.tandfonline.com/toc/tran20/current", "alternate_urls": ["http://www.tandfonline.com/tran", "http://transport.vgtu.lt/", "http://eia.libis.lt/isteklius.php?url=http://www.transport.vgtu.lt/?page%3D0"]}, "title": "STRATEGIES AND APPROACH FOR SMART CITY–PORT ECOSYSTEMS DEVELOPMENT SUPPORTED BY THE INTERNET OF THINGS", "abstract": "The article presents a new contribution to understanding and building novel phenomena of Smart City–Port (SCP) ecosystems and new approaches for the use of new technical and technological findings. The main aim is to elaborate specific strategies SCP ecosystem can secure in the future and an approach for synchronised SCP development for adaption to growing urbanization, mobility and business development, where all stakeholders would take an active role. Based on analysed literature 19 strategies for common smart development of cities and ports are highlighted. The relatively new phenomena of the Internet of Things (IoT) or Internet of Everything (IoE) can simplify their achievement in SCP ecosystem. Moreover, the proposed 3 level approach for technological development of sensing, monitoring and managing data for spatial, transport, environmental and social policy is used on 2 Northern Adriatic cities and ports. The research provides actual analyses of SCP development at Koper (Slovenia) and Rijeka (Croatia), where the development of ports was carried in a completely different way. The article thus proposes a 2 phase approach to the development of SCP and can be used more widely in building a symbiosis of cities and their ports. Firstly, the need to fulfil the strategy from the set of 19 SCP development strategies should be identified and secondly by using a 3 level approach, with existing technological support a SCP environment can be set.", "venue": "Transport", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-12-30", "journal": {"name": "Transport"}, "authors": [{"authorId": "94575931", "name": "B. Beškovnik"}, {"authorId": "50853496", "name": "P. Bajec"}], "citations": [{"paperId": "972ac277bd408757eca43a3ffef7b2b6608f9373", "title": "Sustainable Solutions for Small/Medium Ports a Guide to Efficient and Effective Planning"}, {"paperId": "0196c154f6f1593ce4ef2248c6c62fceb5286b29", "title": "Linking Ports’ Digital Twins to Those of Cities"}, {"paperId": "c759f940b6c795d021b1480fde16dfdeeb5cee5a", "title": "Understanding data governance requirements in IoT adoption for smart ports – a gap analysis"}, {"paperId": "eff92a223ea6408fb500c76f4a18717ad4ee82dc", "title": "Innovation in Smart Ports: Future Directions of Digitalization in Container Ports"}, {"paperId": "f6682bbba722a9f3b2555401c3919c03fd23662f", "title": "Creating Urban Transportation Networks Grounded In the Principles of the Smart Port-City Paradigm"}]}
