{"paperId": "c7f08b180ea364b753570e916e21cd395b04ec1d", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Robust CFAR Detector With Ordered Statistic of Sub-Reference Cells in Multiple Target Situations", "abstract": "Herein, a robust constant false alarm rate (CFAR) detector with ordered statistic of sub-reference cells (OSS-CFAR) is proposed in multiple target situations. This detector can improve background level estimation and reduce computational complexity using sub-reference cells. The detection performance of the OSS-CFAR detector and of conventional CFAR detectors in multiple target situations are investigated and compared using computer simulations and experimental data with sea clutter. The simulations and experimental results show that the OSS-CFAR detector achieves robust detection performance with low computational complexity, whereas conventional CFAR detectors suffer performance degradation in multiple target situations. At the clutter edge, the OSS-CFAR detector with appropriate parameters achieves an acceptable false alarm rate compared to conventional CFAR detectors.", "venue": "IEEE Access", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "42750-42761", "volume": "10"}, "authors": [{"authorId": "3353583", "name": "Taehee Jeong"}, {"authorId": "1557292114", "name": "Sungyeong Park"}, {"authorId": "153188146", "name": "Jeong-Wook Kim"}, {"authorId": "2163435", "name": "Jong-Won Yu"}], "citations": [{"paperId": "dd53825d038b8279d1c107a06657efd900e748db", "title": "Partial mean and multi-section rank order filtering for order statistic-constant false alarm rate detection in synthetic aperture radar imagery"}, {"paperId": "7b40dbde5a47d723224157c407193e6f34a1132e", "title": "Modified rank sum nonparametric CFAR to combat clutter edge"}, {"paperId": "a282fe544361c98d80158afdbf413dd9557d8ff6", "title": "Multi-Target Detection Based on Improved CA-CF AR Algorithm"}]}
