{"paperId": "c7f7c0a61219202fb99e30b26be210fe2382c7ed", "publicationVenue": {"id": "8d013fee-d1c0-434d-bab7-899c82c0553e", "name": "International Conference on Modern Management based on Big Data", "type": "conference", "alternate_names": ["MMBD", "Int Conf Mod Manag based Big Data"], "url": "http://www.mmbdconf.org"}, "title": "An Innovative Application of Big Data in Healthcare: Driving Factors, Operation Mechanism and Development Model", "abstract": "This paper aims to build a conceptual framework for the innovative application in big data in healthcare. Method: Diamond Model and PEST Model were used to analyze the key driving factors of big data in healthcare through external and endogenous driving factors. Based on this, the operation mechanism and possible development model of big data in healthcare were analyzed by using the diffusion theory of policy innovation. Results: The key factors of innovation and application of big data in healthcare are divided into external and endogenous driving factors. The driving mechanism is defined as “learning, compulsion, competition, imitation and inducement”. The conceivable development model is based on big data value innovation and the motivation of different stakeholders. Conclusion: Through the logical analysis of value innovation, the internal relationship among the relevant factors, driving forces and interaction of big data in healthcare application is established, and finally a theoretical analysis framework for innovative application of big data in healthcare is presented.", "venue": "International Conference on Modern Management based on Big Data", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-10-12", "journal": {"pages": "104-113"}, "authors": [{"authorId": "1632983076", "name": "T. Dai"}, {"authorId": "153600154", "name": "Qingkun Chen"}, {"authorId": "46330520", "name": "Linfu Xie"}, {"authorId": "2323396", "name": "Hongpu Hu"}], "citations": [{"paperId": "b9bbece35c850d5a2fedf2a1fba7b1100dc8e2bc", "title": "Features of creative marketing in the conditions of the innovative economy development"}, {"paperId": "fe13277ba16fefd1d4674a050387e5f162ed85b5", "title": "THE ORGANIZATIONAL AND ECONOMIC MECHANISM OF THE DEVELOPMENT INTENSIFICATION IN THE CONDITIONS OF DIGITALIZATION"}]}
