{"paperId": "c7fd412661ad440d86bd024cc2cd6c1f64526f76", "publicationVenue": {"id": "6175efe8-6f8e-4cbe-8cee-d154f4e78627", "name": "Mathematics", "issn": "2227-7390", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-283014", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-283014", "https://www.mdpi.com/journal/mathematics"]}, "title": "Forecasting the Efficiency of Innovative Industrial Systems Based on Neural Networks", "abstract": "Approaches presented today in the scientific literature suggest that there are no methodological solutions based on the training of artificial neural networks to predict the direction of industrial development, taking into account a set of factors—innovation, environmental friendliness, modernization and production growth. The aim of the study is to develop a predictive model of performance management of innovative industrial systems by building neural networks. The research methods were correlation analysis, training of neural networks (species—regression), extrapolation, and exponential smoothing. As a result of the research, the estimation efficiency technique of an innovative industrial system in a complex considering the criteria of technical modernization, development, innovative activity, and ecologization is developed; the prognostic neural network models allow to optimize the contribution of signs to the formation of target (set) values of indicators of efficiency for macro and micro-industrial systems that will allow to level a growth trajectory of industrial systems; the priority directions of their development are offered. The following conclusions: the efficiency of industrial systems is determined by the volume of sales of goods, innovative products and waste recycling, which allows to save resources; the results of forecasting depend significantly on the DataSet formulated. Although multilayer neural networks independently select important features, it is advisable to conduct a correlation analysis beforehand, which will provide a higher probability of building a high-quality predictive model. The novelty of the research lies in the development and testing of a unique methodology to assess the effectiveness of industrial systems: it is based on a multidimensional system approach (takes into account factors of innovation, environmental friendliness, modernization and production growth); it combines a number of methodological tools (correlation, ranking and weighting); it expands the method of effectiveness assessment in terms of the composition of variables (previously presented approaches are limited to the aspects considered).", "venue": "Mathematics", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-12-28", "journal": {"name": "Mathematics"}, "authors": [{"authorId": "69848169", "name": "A. Shinkevich"}, {"authorId": "12800872", "name": "I. Ershova"}, {"authorId": "100664267", "name": "F. Galimulina"}], "citations": [{"paperId": "fade5818df3ad517f4ff12d6444ec7369b07bc26", "title": "A Novel Inversion Method for Permeability Coefficients of Concrete Face Rockfill Dam Based on Sobol-IDBO-SVR Fusion Surrogate Model"}]}
