{"paperId": "c8071c6336bc0dbb3fbe9025c9ff2bb6c5d66f13", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Duet: efficient and scalable hybriD neUral rElation undersTanding", "abstract": "Learned cardinality estimation methods have achieved high precision compared to traditional methods. Among learned methods, query-driven approaches have faced the workload drift problem for a long time. Although both data-driven and hybrid methods are proposed to avoid this problem, most of them suffer from high training and estimation costs, limited scalability, instability, and long-tail distribution problems on high-dimensional tables, which seriously affects the practical application of learned cardinality estimators. In this paper, we prove that most of these problems are directly caused by the widely used progressive sampling. We solve this problem by introducing predicate information into the autoregressive model and propose Duet, a stable, efficient, and scalable hybrid method to estimate cardinality directly without sampling or any non-differentiable process, which can not only reduce the inference complexity from $O(n)$ to $O(1)$ compared to Naru and UAE but also achieve higher accuracy on high cardinality and high-dimensional tables. Experimental results show that Duet can achieve all the design goals above and be much more practical. Besides, Duet even has a lower inference cost on CPU than that of most learned methods on GPU.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-07-25", "journal": {"name": "ArXiv", "volume": "abs/2307.13494"}, "authors": [{"authorId": "2153280163", "name": "Kaixin Zhang"}, {"authorId": "2145338419", "name": "Hongzhi Wang"}, {"authorId": "2139535046", "name": "Y. Lu"}, {"authorId": "2145276136", "name": "Ziqi Li"}, {"authorId": "2068917200", "name": "Chang Shu"}, {"authorId": "2109341618", "name": "Yu Yan"}, {"authorId": "2203025649", "name": "Donghua Yang"}], "citations": []}
