{"paperId": "c81575e059a826f39b47367fceaac67a8f55fb07", "publicationVenue": null, "title": "Agriculture Big Data ( AgBD ) Challenges and Opportunities From Farm To Table : A Midwest Big Data Hub Community † Whitepaper", "abstract": "Big data is critical to help agriculture meet the challenges of growing world population, climate change and urbanization. Recent success stories include precision agriculture, phenotyping, and global agricultural monitoring. Many of these initiatives are made possible by novel data sources such as satellite imagery, instrumented tractors and initiatives such as the Global Open Data for Agriculture and Nutrition (GODAN). This whitepaper surveys agricultural big datasets, characterizes their limitations, lists transformative opportunities and suggests a plan to engage and nurture Agriculture Big Data (AgBD) research community. Public big data includes satellite imagery (e.g., Earth on Amazon Web Services, Google Earth Engine), surveys (e.g., National Agricultural Statistics Service), financial statistics (e.g., Economic Research Service), social media (e.g., Twitter), etc. Private datasets describe yield (e.g., precision agriculture, Farm Service Agency), farm loss (e.g., Risk Management Agency) and condemnation (Food Safety and Inspection Service), etc. Limitations include data and metadata gaps, insufficient data storage, preservation, and documentation, lack of scalable spatiotemporal big data analytics methods, and inadequate secure data-sharing mechanisms. Transformative opportunities include workforce development, Cyber-Infrastructure (e.g., long-term, curated data repository services), data norms and sharing models, metadata, big data aided mechanistic models, spatiotemporal big data analytics for data-driven hypothesis generation and testing, etc. These transformative opportunities cannot be realized without federal leadership. To make progress towards the transformative opportunities, the whitepaper also lists resources to engage researchers from agriculture and big data in collaborative efforts with federal support.", "venue": "", "year": 2017, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": null, "journal": null, "authors": [{"authorId": "145072875", "name": "S. Shekhar"}, {"authorId": "1800224", "name": "P. Schnable"}, {"authorId": "2056675", "name": "David LeBauer"}, {"authorId": "144970357", "name": "K. Baylis"}, {"authorId": "3811092", "name": "K. VanderWaal"}], "citations": [{"paperId": "def851511e94f65ee3d2329b3fe11ad372bdbbc2", "title": "An Implementation of IoT and Data Analytics in Smart Agricultural System – A Systematic Literature Review"}, {"paperId": "57f079159b1e383c1247fa83def2a30b375f497f", "title": "Predicting county-scale maize yields with publicly available data"}, {"paperId": "c82982f7c4504910ab40bc9b6ad86d92d11f43e4", "title": "Machine learning in agricultural and applied economics"}, {"paperId": "58b0df021f79fa32d916a1de047db9601eac0dc1", "title": "Data-Driven Decision Making in Precision Agriculture: The Rise of Big Data in Agricultural Systems"}, {"paperId": "ec23ef7d0a2e88b0c2af7cf521343adeddfbd03d", "title": "Ethical Underpinnings in the Design and Management of ICT Projects"}, {"paperId": "84261908cf75d575b7beef6c088893bbcd720eaf", "title": "Assessing recall bias and measurement error in high-frequency social data collection for human-environment research"}, {"paperId": "7fdb3b2d7e31057ffa4230223e8d73bcbc54f84e", "title": "Assessing recall bias and measurement error in high-frequency social data collection for human-environment research"}, {"paperId": "25fdc6760e8cbdd9e0f55954a337a672a52c716c", "title": "Crop Mandi-Demand and Price Forecasting of Agricultural Crops through Mobile Application"}, {"paperId": "34f788797a44540d4d2c46aada607133e49a5569", "title": "Big Data On Midwest Farms: Assessment Of Use, Concerns, And Challenges"}, {"paperId": "343badb38d21ce6a1dffa091a65d5540e5a259ac", "title": "Visualization and Scientometric Mapping of Global Agriculture Big Data Research"}, {"paperId": "aab7aa72b9057871c788ce14ff055a9f3be29eab", "title": "Big data in agriculture and nutrition."}, {"paperId": "d803d7c4a6e96133e6a68818bb1f7455c7364808", "title": "A New Paradigm to Accommodate Ethical Foundations in the Design and Management of Digital Platforms"}]}
