{"paperId": "c82602059db57c0d535b1547bc891fcdd0bec5f8", "publicationVenue": {"id": "159aed30-148b-4b50-99a4-372b0af958d9", "name": "International Symposium on Computers and Communications", "type": "conference", "alternate_names": ["ISCC", "Int Symp Comput Commun"], "url": "https://ieeexplore.ieee.org/xpl/conhome/1000156/all-proceedings"}, "title": "A Reputation-aware Mobile Crowd Sensing Scheme for Emergency Detection", "abstract": "The unforeseen proliferation of smart devices has set in motion research efforts aimed at building Smart Cities (SCs) that improve the well-being of their citizens. One of the key technologies to achieve a SC is Mobile Crowd Sensing (MCS). In MCS, data is collected from the environment surrounding the smart device owners and utilized in the provision of a wide array of SC services. A prevalent class of services which is attracting increasing attention is smart emergency services, where MCS is leveraged to facilitate the detection and mitigation operations of crises. In this paper, we study the problem of an emergency situation detection based on MCS-provided data from heterogeneous participants. Specifically, we formulate our problem based on Detection Theory and underline its computational complexity. We present a greedy algorithm that aims to balance the trade-off between the decision time and the quality of the final decision. We perform extensive simulation experiments that show how our scheme improves the correct detection rate compared to a naive reputation-unaware baseline.", "venue": "International Symposium on Computers and Communications", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-06-01", "journal": {"name": "2019 IEEE Symposium on Computers and Communications (ISCC)", "pages": "1-6"}, "authors": [{"authorId": "17339934", "name": "Rawan F. El Khatib"}, {"authorId": "144533481", "name": "N. Zorba"}, {"authorId": "35725657", "name": "H. Hassanein"}], "citations": [{"paperId": "5399e1534ed87a3674d7107824435d3dc9beb927", "title": "Novel Task Allocation Method for Emergency Events under Delay-Cost Tradeoff"}, {"paperId": "c3be56a2f2adc30f8fb58a52100c3816a495ce86", "title": "Rapid sensing-based emergency detection: A sequential approach"}, {"paperId": "b67152b04c255b563ecb59ef55223405a2821f04", "title": "Edge Technologies for Disaster Management: A Survey of Social Media and Artificial Intelligence Integration"}]}
