{"paperId": "c8277cab60799f99499d9ea3a4a81cd364b7a802", "publicationVenue": {"id": "e84bb5a1-8f79-42cc-8eb1-3a52f7c73d63", "name": "IEEE International Conference on Systems, Man and Cybernetics", "type": "conference", "alternate_names": ["Smoky Mountains Computational Sciences and Engineering Conference", "Smoky Mt Comput Sci Eng Conf", "IEEE Int Conf Syst Man Cybern", "SMC", "Syst Man Cybern", "Systems, Man and Cybernetics"]}, "title": "Enhancing Fresh Produce Yield Forecasting Using Vegetation Indices from Satellite Images", "abstract": "Developing fresh produce yield forecasting service is essential for estimating fair prices to protect against overpriced agricultural commodities and minimize the bid ask spread which not only benefits the retailers and customers but also protects farmers. Forecasting the fresh produce yield is achieved using state of the art deep learning (DL) models. Those models are trained and built using data retrieved from Santa Barbara region in California using an ensemble of Attention Deep Feedforward Neural Network with Gated Recurrent Units (GRU) and Deep Feedforward Neural Network with embedded GRU units. The ensemble takes as input the soil moisture and temperature parameters as well as vegetation indices (VIs) calculated from images retrieved from multiple satellites. The effect of adding the VIs as input parameters on the forecasting performance of the deep learning model is assessed and the most effective VIs are selected. In addition, interpolation techniques are used to estimate the missing VIs due to the low frequency of capturing the images by the satellites. A comparative analysis is conducted to choose the most effective technique, which is found to be Cubic Spline interpolation. One VI, which is the Normalized Difference Vegetation Index (NDVI), proves to be the most effective index in forecasting the yield. Based on the aggregated error measure (AGM) score, the yield forecasting performance of the DL ensemble is enhanced by 12.51% after adding the complete interpolated NDVI to the input parameters used in training the model.", "venue": "IEEE International Conference on Systems, Man and Cybernetics", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-10-09", "journal": {"name": "2022 IEEE International Conference on Systems, Man, and Cybernetics (SMC)", "pages": "2863-2868"}, "authors": [{"authorId": "2186558502", "name": "Islam Nasr"}, {"authorId": "153927170", "name": "L. Nassar"}, {"authorId": "1696863", "name": "F. Karray"}], "citations": [{"paperId": "f21159d6979dae247aa7643994e74074fcad78df", "title": "Enhanced Deep Learning Satellite-based Model for Yield Forecasting and Quality Assurance Using Metamorphic Testing"}]}
