{"paperId": "c83bb50c0a2951edf17b92e89c20557e92dadff3", "publicationVenue": {"id": "20a3a2f3-532a-4f04-9f3d-1e268e100872", "name": "International Journal of Advanced Computer Science and Applications", "type": "journal", "alternate_names": ["Int J Adv Comput Sci Appl"], "issn": "2156-5570", "url": "http://sites.google.com/site/ijacsa2010/", "alternate_urls": ["http://thesai.org/Publication/Default.aspx", "https://thesai.org/Publications/IJACSA"]}, "title": "Apache Spark in Healthcare: Advancing Data-Driven Innovations and Better Patient Care", "abstract": "— The enormous amounts of data produced in the healthcare sector are managed and analyzed with the help of Apache Spark, an open-source distributed computing system. This case study examines how Spark is utilized in the healthcare industry to produce data-driven innovations and enhance patient care. The report gives a general introduction of Spark's architecture, advantages, and healthcare use cases, such as managing electronic health records, predictive analytics for disease outbreaks, individualized medicine, medical image analysis, and remote patient monitoring. Additionally, it contains several case studies that highlight Spark's effects on lowering hospital readmission rates, detecting sepsis earlier, enhancing cancer research and therapy, and speeding up drug discovery. The report also identifies obstacles with data security and privacy, scalability and infrastructure, data integration and quality, labor and skills shortages, and other aspects of employing Spark in healthcare. Spark has overcome these obstacles by enabling efficient data-driven decision-making processes and enhancing patient outcomes, revolutionizing healthcare solutions. Additionally, the study looks at potential future advancements in healthcare, including the use of Spark with AI and ML, real-time analytics, the Internet of Medical Things (IoMT), enhanced interoperability and data sharing, and ethical standards. In conclusion, healthcare businesses can fully utilize Spark to transform their data into actionable insights that will enhance patient care and boost the efficiency of healthcare systems.", "venue": "International Journal of Advanced Computer Science and Applications", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "International Journal of Advanced Computer Science and Applications"}, "authors": [{"authorId": "2220977960", "name": "Lalit Shrotriya"}, {"authorId": "2091491949", "name": "K. Sharma"}, {"authorId": "145545815", "name": "D. Parashar"}, {"authorId": "8498522", "name": "Kushagra Mishra"}, {"authorId": "36183379", "name": "S. Rawat"}, {"authorId": "98829603", "name": "H. Pagare"}], "citations": [{"paperId": "d4e52f63a52f7b3ee61e1fbafa4e40e60490dbb3", "title": "Machine Learning for Healthcare-IoT Security: A Review and Risk Mitigation"}, {"paperId": "d245312f053befcbb482404c2ccc2c19b4c90444", "title": "Apache Spark for Analysis of Electronic Health Records: A Case Study of Diabetes Management"}]}
