{"paperId": "c842cd63dc72c63db13400f50776d3cd1073c2db", "publicationVenue": {"id": "ccd8e532-73c6-414f-bc91-271bbb2933e2", "name": "Electronics", "type": "journal", "issn": "1450-5843", "alternate_issns": ["2079-9292", "0883-4989"], "url": "http://www.electronics.etfbl.net/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-247562", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-247562", "https://www.mdpi.com/journal/electronics"]}, "title": "Applications of Integrated IoT-Fog-Cloud Systems to Smart Cities: A Survey", "abstract": "Several cities have recently moved towards becoming smart cities for better services and quality of life for residents and visitors, with: optimized resource utilization; increased environmental protection; enhanced infrastructure operations and maintenance; and strong safety and security measures. Smart cities depend on deploying current and new technologies and different optimization methods to enhance services and performance in their different sectors. Some of the technologies assisting smart city applications are the Internet of Things (IoT), fog computing, and cloud computing. Integrating these three to serve one system (we will refer to it as integrated IoT-fog-cloud system (iIFC)) creates an advanced platform to develop and operate various types of smart city applications. This platform will allow applications to use the best features from the IoT devices, fog nodes, and cloud services to deliver best capabilities and performance. Utilizing this powerful platform will provide many opportunities for enhancing and optimizing applications in energy, transportation, healthcare, and other areas. In this paper we survey various applications of iIFCs for smart cities. We identify different common issues associated with utilizing iIFCs for smart city applications. These issues arise due to the characteristics of iIFCs on the one side and the requirements of different smart city applications on the other. In addition, we outline the main requirements to effectively utilize iIFCs for smart city applications. These requirements are related to optimization, networking, and security.", "venue": "Electronics", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2021-11-25", "journal": {"name": "Electronics"}, "authors": [{"authorId": "145498019", "name": "N. Mohamed"}, {"authorId": "1400163433", "name": "J. Al-Jaroodi"}, {"authorId": "1398806295", "name": "S. Lazarova-Molnar"}, {"authorId": "1847563", "name": "Imad Jawhar"}], "citations": [{"paperId": "40a72a51f9d70159c164025c59b65f9ecf744ca4", "title": "Smart Parking Systems: Comprehensive Review Based on Technological Perspective"}, {"paperId": "e554a2b4e5eff05da38e351a7e6bdf448259be52", "title": "A novel Edge architecture and solution for detecting concept drift in smart environments"}, {"paperId": "0417d6edaa2edd6a3b31dcbc6e8347016c472d25", "title": "Security Applications of Edge Intelligence"}, {"paperId": "e0ec1e44f5801682ff98726a89b9dc36c444544f", "title": "Fog computing approaches in IoT-enabled smart cities"}, {"paperId": "4f87f76c4091597fa626a87cb7e5ebad7147b663", "title": "Distributed Agent-Based Orchestrator Model for Fog Computing"}, {"paperId": "74f3779b043a55cfd24f04989554972767237589", "title": "T3OMVP: A Transformer-based Time and Team Reinforcement Learning Scheme for Observation-constrained Multi-Vehicle Pursuit in Urban Area"}, {"paperId": "aa442a0df0434b4324f33e3d0930a87512313b5d", "title": "A Review Load balancing algorithms in Fog Computing"}, {"paperId": "2cfdc11bf55877abf1612dd86459512a2c8b3896", "title": "Information technology sets formation and \"TNTU Smart Campus\" services network support"}, {"paperId": "13e81cfddbdfcdea3ffc1102e9d3e0ad23fce811", "title": "REINFORCEMENT LEARNING BASED LOAD BALANCING FOR FOG-CLOUD COMPUTING SYSTEMS: AN OPTIMIZATION APPROACH"}]}
