{"paperId": "c84ad9768269c0460705bcfaf67c3931423e5110", "publicationVenue": {"id": "646f127e-53b1-40c6-8ed6-7a251df5de0b", "name": "International Conference on Real-time Computing and Robotics", "type": "conference", "alternate_names": ["IEEE Int Conf Real-time Comput Robot", "RCAR", "IEEE International Conference on Real-time Computing and Robotics", "Int Conf Real-time Comput Robot"]}, "title": "Towards Long Duration Self-Sustainable Ocean Sampling System*", "abstract": "Ocean sampling is a crucial part in the construction of Smart Ocean Environment development. Previously, unmanned surface vessels and traditional surface drifting buoys have been designed and utilized for ocean sampling, but their high cost, weak stability and poor endurance limit the long time and large-scale applications. This paper presents a novel design of self-sustainable ocean sampling system in the form of ocean surface drifting buoy, which is equipped with solar self-power module, and various sensors for data acquisition. Several interfaces were reserved for the functions extensions as well. In consideration of the overall stability and practical executability, regular polyhedron shape is used for the system structure design. Theoretical analysis and simulation were performed and optimized in terms of energy collection efficiency, and finally dodecahedron shape was chosen. A prototype was built and tested in an outdoor water surface environment. The result of the test shows that the system is capable of self-sustainability for long duration ocean sampling.", "venue": "International Conference on Real-time Computing and Robotics", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-08-01", "journal": {"name": "2019 IEEE International Conference on Real-time Computing and Robotics (RCAR)", "pages": "697-702"}, "authors": [{"authorId": "2115102916", "name": "J. Hou"}, {"authorId": "2904110", "name": "Yibing Dong"}, {"authorId": "2544692", "name": "Xiaorong Ding"}, {"authorId": "2948228", "name": "Hengli Liu"}, {"authorId": "1766627", "name": "Huihuan Qian"}, {"authorId": "2973352", "name": "Zhenglong Sun"}], "citations": []}
