{"paperId": "c855bc7f50f275d0c548237c9ba5842c03c231f8", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Rapid Method of Wastewater Classification by Electronic Nose for Performance Evaluation of Bioreactors with Activated Sludge", "abstract": "Currently, e-noses are used for measuring odorous compounds at wastewater treatment plants. These devices mimic the mammalian olfactory sense, comprising an array of multiple non-specific gas sensors. An array of sensors creates a unique set of signals called a “gas fingerprint”, which enables it to differentiate between the analyzed samples of gas mixtures. However, appropriate advanced analyses of multidimensional data need to be conducted for this purpose. The failures of the wastewater treatment process are directly connected to the odor nuisance of bioreactors and are reflected in the level of pollution indicators. Thus, it can be assumed that using the appropriately selected methods of data analysis from a gas sensors array, it will be possible to distinguish and classify the operating states of bioreactors (i.e., phases of normal operation), as well as the occurrence of malfunction. This work focuses on developing a complete protocol for analyzing and interpreting multidimensional data from a gas sensor array measuring the properties of the air headspace in a bioreactor. These methods include dimensionality reduction and visualization in two-dimensional space using the principal component analysis (PCA) method, application of data clustering using an unsupervised method by Density-Based Spatial Clustering of Applications with Noise (DBSCAN) algorithm, and at the last stage, application of extra trees as a supervised machine learning method to achieve the best possible accuracy and precision in data classification.", "venue": "Italian National Conference on Sensors", "year": 2023, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-10-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "23"}, "authors": [{"authorId": "2199658801", "name": "Magdalena Piłat-Rożek"}, {"authorId": "2260737703", "name": "Marcin Dziadosz"}, {"authorId": "39140981", "name": "D. Majerek"}, {"authorId": "1401134268", "name": "K. Jaromin-Gleń"}, {"authorId": "25644114", "name": "B. Szeląg"}, {"authorId": "13562578", "name": "L. Guz"}, {"authorId": "39746075", "name": "A. Piotrowicz"}, {"authorId": "8674283", "name": "G. Lagód"}], "citations": []}
