{"paperId": "c87696b49fa4f15f368baef845672bf8bc6f6dc6", "publicationVenue": {"id": "b1aea3ab-edf0-430b-a9c2-cce5469f6b23", "name": "IEEE/ACM Transactions on Networking", "type": "journal", "alternate_names": ["IEEE ACM Trans Netw", "IEEE ACM Transactions on Networking", "IEEE/ACM Trans Netw"], "issn": "1063-6692", "url": "http://portal.acm.org/ton/", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=90", "https://ieeexplore.ieee.org/servlet/opac?punumber=90"]}, "title": "Joint Request Updating and Elastic Resource Provisioning With QoS Guarantee in Clouds", "abstract": "In a commercial cloud, service providers (e.g., video streaming service provider) rent resources from cloud vendors (e.g., Google Cloud Platform) and provide services to cloud users, making a profit from the price gap. Cloud users acquire services by forwarding their requests to corresponding servers. In practice, as a common scenario, traffic dynamics will cause server overload or load-unbalancing. Existing works mainly deal with the problem by two methods: elastic resource provisioning and request updating. Elastic resource provisioning is a fast and agile solution but may cost too much since service providers need to buy extra resources from cloud vendors. Though request updating is a free solution, it will cause a significant delay, resulting in a bad users’ QoS. In this paper, we present a new scheme, called real-time request updating with elastic resource provisioning (TRUST), to help service providers pay less cost with users’ QoS guarantee in clouds. In addition, we propose an efficient algorithm for TRUST with a bounded approximation factor based on progressive-rounding. Both small-scale experiment results and large-scale simulation results show the superior performance of our proposed algorithm compared with state-of-the-art benchmarks.", "venue": "IEEE/ACM Transactions on Networking", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-02-01", "journal": {"name": "IEEE/ACM Transactions on Networking", "pages": "110-126", "volume": "32"}, "authors": [{"authorId": "16875947", "name": "Gongming Zhao"}, {"authorId": "2121352408", "name": "Jingzhou Wang"}, {"authorId": "1779748", "name": "Hongli Xu"}, {"authorId": "144727800", "name": "Yangming Zhao"}, {"authorId": "46215608", "name": "Xuwei Yang"}, {"authorId": "2115528700", "name": "He Huang"}], "citations": []}
