{"paperId": "c87e914b0681738c55eaa13531af362fbbd8f293", "publicationVenue": null, "title": "An enhanced binary Rat Swarm Optimizer based on local-best concepts of PSO and collaborative crossover operators for feature selection", "abstract": null, "venue": "Comput. Biol. Medicine", "year": 2022, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-06-01", "journal": {"name": "Computers in biology and medicine", "pages": "\n          105675\n        ", "volume": "147"}, "authors": [{"authorId": "2987268", "name": "Mohammed A. Awadallah"}, {"authorId": "1396704271", "name": "M. Al-Betar"}, {"authorId": "2146429410", "name": "Malik Braik"}, {"authorId": "2441039", "name": "Abdelaziz I. Hammouri"}, {"authorId": "3185978", "name": "Iyad Abu Doush"}, {"authorId": "1790928", "name": "R. A. Zitar"}], "citations": [{"paperId": "21090f812b432980ae15ad6144f62bcd7fce8978", "title": "A binary hybrid sine cosine white shark optimizer for feature selection"}, {"paperId": "0ba12f49922c17d09374cb986c46c3286bf56505", "title": "A Binary Chaotic Transient Search Optimization Algorithm for Enhancing Feature Selection"}, {"paperId": "701b1595da69a5d9d96b91e8d0d9242c14dffcf2", "title": "Anticipating interpersonal sensitivity: A predictive model for early intervention in psychological disorders in college students."}, {"paperId": "f6b46bc3c0ab63ae6984d18c9f98b8395c42feae", "title": "Elk herd optimizer: a novel nature-inspired metaheuristic algorithm"}, {"paperId": "2544d8a15a60d4965116486292cb510c6a669fff", "title": "An enhanced particle swarm optimization with position update for optimal feature selection"}, {"paperId": "f32da814ce2d10f50b87382f5f0a7f0709ea433f", "title": "Metabolic syndrome prediction model using Bayesian optimization and XGBoost based on traditional Chinese medicine features"}, {"paperId": "5a09cbc3461bb44580fe627f2fb3b2fbd9f26656", "title": "Feature selection based on self-information combining double-quantitative class weights and three-order approximation accuracies in neighborhood rough sets"}, {"paperId": "1cadeacccab8acdaed395c5290151e1c28c752d0", "title": "Optimal Pid Controller for the Dc-Dc Buck Converter Using the Improved Sine Cosine Algorithm"}, {"paperId": "3e9d97815d3630fca0d5f1dc045a3b9cbb9acbab", "title": "A multistart tabu search-based method for feature selection in medical applications"}, {"paperId": "0c92d5c066a5b8cc9924a97006291baab088f7a2", "title": "An external attention-based feature ranker for large-scale feature selection"}, {"paperId": "5f0e8ff6d80f92691dd7ba1fb7c868a44ae320ca", "title": "An improved binary dandelion algorithm using sine cosine operator and restart strategy for feature selection"}, {"paperId": "8d8525a5cf41b06c41d987e5be4122a4ac28b38c", "title": "Gene selection with Game Shapley Harris hawks optimizer for cancer classification"}, {"paperId": "56b3010a8fc1e8c40da5ef4e7589697d1f22f294", "title": "Improved versions of snake optimizer for feature selection in medical diagnosis: a real case COVID-19"}, {"paperId": "71818975d448cf251e596343e8e368a44d6de9b4", "title": "Feature Selection based nature inspired Capuchin Search Algorithm for solving classification problems"}, {"paperId": "9e3ff3d4289d3be614a935d133d391c5dc1f52a6", "title": "Enhanced opposition-based grey wolf optimizer for global optimization and engineering design problems"}, {"paperId": "7856d27d18779c3cf435ffaf4ad11b227753b8a9", "title": "An improved hybrid chameleon swarm algorithm for feature selection in medical diagnosis"}, {"paperId": "3de1166401a5600f41bbe0c76504c5332c76fc91", "title": "Combination of electromagnetic field and harris hawks optimization algorithms with optimization to optimization structure and its application for optimum power flow"}, {"paperId": "f569f33e51a0f24bffefe8194f76a5f8ccfeed56", "title": "An enhanced binary artificial rabbits optimization for feature selection in medical diagnosis"}, {"paperId": "bf7becb9ab97d4dbc70bd819a678c37dde9df849", "title": "Gravitational search algorithm-extreme learning machine for COVID-19 active cases forecasting"}, {"paperId": "e619b47be68cb7ffd8a3b1aadf4ba2e833362c6a", "title": "High-Dimensional Feature Selection Based on Improved Binary Ant Colony Optimization Combined with Hybrid Rice Optimization Algorithm"}, {"paperId": "0e7162201cb22d623eddd4977fb7c41983661f34", "title": "Feature subset selection in structural health monitoring data using an advanced binary slime mould algorithm"}, {"paperId": "d339305466896674f1038de28d801e70d4507a7f", "title": "Binary improved white shark algorithm for intrusion detection systems"}, {"paperId": "40dd9c81665072082072db722d07d639df593f36", "title": "Cognitively Enhanced Versions of Capuchin Search Algorithm for Feature Selection in Medical Diagnosis: a COVID-19 Case Study"}, {"paperId": "b9b3e528e07fdeacc43db5ab5c6f87db20d03db4", "title": "Feature selection based on a multi-strategy African vulture optimization algorithm and its application in essay scoring"}, {"paperId": "bfbd56ce903ed6b899a99430f17d7f097f9fe78c", "title": "Memory-Based Sand Cat Swarm Optimization for Feature Selection in Medical Diagnosis"}, {"paperId": "6a445536000e5e98e89d0b27ffa06c435e0e7161", "title": "A novel adaptive memetic binary optimization algorithm for feature selection"}, {"paperId": "3caec6079daa694345168784519b1e98fe74481e", "title": "Multi-level thresholding image segmentation for rubber tree secant using improved Otsu's method and snake optimizer."}, {"paperId": "8c72e1dfb85ff410aa560b4c7225b2ea5b33c335", "title": "Dimensional decision covariance colony predation algorithm: global optimization and high−dimensional feature selection"}, {"paperId": "5701c639cf7d81809db18f9eefc455ad87e0d91b", "title": "A model-free feature selection technique of feature screening and random forest based recursive feature elimination"}, {"paperId": "97875c5215d9af4efb80629f912dabb79d58a13b", "title": "Classification framework for faulty-software using enhanced exploratory whale optimizer-based feature selection scheme and random forest ensemble learning"}, {"paperId": "ae164c4ad831c8491c30cdf9d83fd0db7ca92c51", "title": "An augmented Snake Optimizer for diseases and COVID-19 diagnosis"}, {"paperId": "1c13314bd525b94d9fd6d747d0930d6371ca3ea9", "title": "Late acceptance hill climbing aided chaotic harmony search for feature selection: An empirical analysis on medical data"}, {"paperId": "b88cfed20b839cfc6a2a45291b0f89121390c025", "title": "A self-adaptive quantum equilibrium optimizer with artificial bee colony for feature selection"}, {"paperId": "d611347dbc1548966c61bb3a81ead5da233d304d", "title": "A hybrid filter-wrapper feature selection using Fuzzy KNN based on Bonferroni mean for medical datasets classification: A COVID-19 case study"}, {"paperId": "dcabfc74088752e2ee4368463cb781f6a23bd1c2", "title": "Rat swarm optimizer adjusted by fuzzy inference system"}, {"paperId": "f268e58de1c729aad5c732d02f709a69af2205a3", "title": "Enhanced Ali Baba and the forty thieves algorithm for feature selection"}, {"paperId": "7fc0d2c22f5cc08e953b95fc2b212264328e0e3a", "title": "Multi-strategy assisted chaotic coot-inspired optimization algorithm for medical feature selection: A cervical cancer behavior risk study"}, {"paperId": "a11f330e51d0a48a008446bf1f1e75543bff8dbe", "title": "A clinical decision support system for polycystic ovarian syndrome using red deer algorithm and random forest classifier"}, {"paperId": "e155ddf283aacc5c7e2a898cb082faff72e1b4da", "title": "YR2S: Efficient Deep Learning Technique for Detecting and Classifying Plant Leaf Diseases"}]}
