{"paperId": "c87fc6f85ea42921c72ac8eac0adfbc3c1ff6202", "publicationVenue": null, "title": "Integrating Pig with Harp to Support Iterative Applications with Fast Cache and Customized Communication", "abstract": "Use of high-level scripting languages to solve big data problems has become a mainstream approach for sophisticated machine learning data analysis. Often data must be used in several steps of a computation to complete a full task. Composing default data transformation operators with the standard Hadoop MapReduce runtime is very convenient. However, the current strategy of using high-level languages to support iterative applications with Hadoop MapReduce relies on an external wrapper script in other languages such as Python and Groovy, which causes significant performance loss when restarting mappers and reducers between jobs. In this paper, we reduce the extra job startup overheads by integrating Apache Pig with the high-performance Hadoop plug-in Harp developed at Indiana University. This provides fast data caching and customized communication patterns among iterations for data analysis. The results show performance improvements of factors from 2 to 5.", "venue": "2014 5th International Workshop on Data-Intensive Computing in the Clouds", "year": 2014, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2014-11-16", "journal": {"name": "2014 5th International Workshop on Data-Intensive Computing in the Clouds", "pages": "33-39"}, "authors": [{"authorId": "1730088", "name": "T. Wu"}, {"authorId": "50480277", "name": "A. Koppula"}, {"authorId": "36199155", "name": "J. Qiu"}], "citations": [{"paperId": "b54f4e67c2de1cb7a0b2fd6a1ff0ed7819011c35", "title": "Empirical Aspect to Analyze Stock Exchange Banking Data using Apache Pig in HDFS environment"}, {"paperId": "b3a3d7e1404bc429707579af8f696b18ed4c22fb", "title": "Intersection of HPC and Machine Learning"}, {"paperId": "f69e9f2852c881da4df0142360c745441075a28f", "title": "Introduction to Harp: when Big Data Meets HPC"}, {"paperId": "67581e0f5e6ffc4dc3cb6af28801031a236c3e39", "title": "Scalable Query and Analysis for Social Networks: An Integrated High-Level Dataflow System with Pig and Harp"}, {"paperId": "59f1ac57693056f2627ef5db90afa6242ee3aa1c", "title": "Towards an Understanding of Scalable Query and Data Analysis for Social Media Data using High-Level Dataflow Systems"}]}
