{"paperId": "c88eccbf43fc27f24d16678446fa62fffde37660", "publicationVenue": null, "title": "Data Virtual Machines: Simplifying Data Sharing, Exploration & Querying in Big Data Environments", "abstract": "Today’s analytics environments are characterized by a high degree of heterogeneity in terms of data systems, formats and types of analysis. Many occasions call for rapid, ad hoc, on demand construction of a data model that represents (parts of) the data infrastructure of an organization, including ML tasks. This data model is given to data scientists to play with (express reports, build ML models, explore, etc.) We present a novel graph-based conceptual model, the Data Virtual Machine (DVM) representing data (persistent, transient, derived) of an organization. A DVM can be built quickly and agilely, offering schema flexibility. It is amenable to visual interfaces for schema and query management. Dataframing, a frequent querying/preprocessing task in analytics applications, is usually carried out by experienced data engineers employing SQL (in the presence of a relational data warehouse) or Python/R: a procedural approach with all the known drawbacks. Dataframes over DVMs are expressed declaratively - and visually, via a simple and intuitive tool. This way, non-IT experts can be involved in dataframing. In addition, query evaluation takes place within an algebraic framework with all the known benefits. I.e. a DVM enables the delegation of data engineering tasks to simpler users. We have seen analogous cases in the past, e.g. with the introduction of SQL. Finally, a DVM offers a formalism that facilitates data sharing, data portability and a single view of any entity – because a DVM’s node is an attribute and an entity at the same time. In this respect, DVMs can excellently serve as a data virtualization technique, an emerging trend in the industry. We argue that DVMs can have a significant practical impact in today’s big data environments.", "venue": "2022 IEEE International Conference on Big Data (Big Data)", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-12-17", "journal": {"name": "2022 IEEE International Conference on Big Data (Big Data)", "pages": "373-380"}, "authors": [{"authorId": "1730475", "name": "Damianos Chatziantoniou"}, {"authorId": "1713548", "name": "Verena Kantere"}, {"authorId": "2203071474", "name": "Nikos Antoniou"}, {"authorId": "2203080614", "name": "Angeliki Gantzia"}], "citations": []}
