{"paperId": "c890a9d8127383d9dfba00f9210262808608f57f", "publicationVenue": {"id": "da1ee6f4-c965-42d6-8b0b-a4cb9294f05d", "name": "Agronomy", "type": "journal", "issn": "2073-4395", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217994", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217994", "https://www.mdpi.com/journal/agronomy"]}, "title": "A Bibliometric Analysis of Research on Apple Snails (Ampullariidae)", "abstract": "Apple snails (ASs), the freshwater snails of the family Ampullariidae, are widely spread in tropical and subtropical regions. Owing to their strong invasiveness and harmful effects on agricultural production and ecosystems, they have attracted considerable attention. However, less research has been conducted on the whole picture of the current research status and development trends in the ASs field. For this purpose, we conducted a bibliometric analysis based on a total of 1028 publications regarding ASs published between 1900 and 2021 using VOSviewer 1.6.18 and CiteSpace 6.1.R3 software. The results suggest that ASs research has received increasing attention in recent years. The most productive country has been the USA, while the institution with the most publications was Consejo Nacional de Investigaciones Científicas y Técnicas Conicet. “Zoology” was the category of the most popular subject, Journal of Molluscan Studies was the primary journal, and P.R. Martin was the most outstanding author in ASs field. Invasive alien species, alarm response, copper (Cu) exposure, taxonomy and phylogenetic analysis, Angiostrongylus cantonensis (parasite), control (including molluscicidal activity), growth and reproduction, and feeding preferences were the main research hotspots. Further, “Pomacea maculata”, “Evolution”, “Biology”, “Digestive gland”, “Phylogeny”, “Identification”, “Pomacea canaliculata caenogastropoda”, “Diversity”, and “Nonnative apple snail” have been emerging active topics in recent years. These findings can help researchers in this area to better understand the direction and advances of ASs research and are valuable for future research and agricultural practice of apple snail control.", "venue": "Agronomy", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-21", "journal": {"name": "Agronomy"}, "authors": [{"authorId": "2150423246", "name": "Fucheng Yao"}, {"authorId": "2143351578", "name": "Yingtong Chen"}, {"authorId": "2222327300", "name": "Jimin Liu"}, {"authorId": "47124895", "name": "Z. Qin"}, {"authorId": "7947643", "name": "Zhao-peng Shi"}, {"authorId": "2222300166", "name": "Qi Chen"}, {"authorId": "2107973990", "name": "Jiaen Zhang"}], "citations": [{"paperId": "5394e1e5de84dfa0def2470cadf2310dba9e4e8a", "title": "Global distribution of the invasive apple snail Pomacea canaliculata: analyzing possible shifts in climatic niche between native and invaded ranges and future spread"}]}
