{"paperId": "c8af47b634acfa29a2891c8142254da53f2d57af", "publicationVenue": {"id": "5c0e8bbc-e761-498e-b5be-14754b2fc53a", "name": "IEEE Transportation Electrification Conference and Expo", "type": "conference", "alternate_names": ["ITEC", "IEEE Transp Electrification Conf Expo"]}, "title": "Maximizing Harvested Energy through Regenerative Braking Process in Dual-Motor All-Wheel Drive Electric Vehicles", "abstract": "This paper introduces a braking strategy for a dual-motor All-Wheel Drive (AWD) Electric Vehicle (EV) that maximizes energy extraction during braking. The braking strategy is based on real-time sensing of each motor controller’s DC link current to achieve optimum brake allocation between friction and regenerative braking in both axles. The recaptured energy via regenerative braking and the net energy consumption are calculated for a typical dual-motor AWD EV using a test bench simulation setup in MATLAB/SIMULINK. Based on the results, blending of regenerative and friction braking is carried out in each axle independently such that the overall harvested energy during braking is maximized. Furthermore, the results are compared to other configurations of single-motor drive EVs. The comparison shows that the recaptured energy through the regenerative braking process is significantly increased in dualmotor AWD EVs, which delineates their capability in improving energy harvesting during braking.", "venue": "IEEE Transportation Electrification Conference and Expo", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2020-06-01", "journal": {"name": "2020 IEEE Transportation Electrification Conference & Expo (ITEC)", "pages": "1246-1250"}, "authors": [{"authorId": "16171776", "name": "S. Heydari"}, {"authorId": "49202127", "name": "P. Fajri"}, {"authorId": "2655617", "name": "M. Shadmand"}, {"authorId": "3314973", "name": "R. Sabzehgar"}], "citations": [{"paperId": "f5466edafc021d3bbbd8a5546af40f7c6ef9fa0d", "title": "A review of the design process of energy management systems for dual-motor battery electric vehicles"}, {"paperId": "05695c17c91b8dd016360590b0e6ba9d287513c3", "title": "A Bidirectional Control Regenerative Braking Strategy for EV Applications- A Review"}, {"paperId": "e0a6e8feed5563445ba715fa8f3f119f96045c5e", "title": "Nonlinear MPC-Based Acceleration Slip Regulation for Distributed Electric Vehicles"}, {"paperId": "55959c6a164a6c287f9da65e9970309efc7ddb37", "title": "A Dual Control Regenerative Braking Strategy for Two-Wheeler Applications-A Review"}, {"paperId": "08e754c8acdc1eb191e01f127185295b4070cf75", "title": "A Study on Regenerative Braking of the System Battery — Power Converter - Electric Motor of Electric Vehicles"}, {"paperId": "52a9a6ab11ac1596cfd35fcd85d16ed4c19f488e", "title": "Design and analysis of a d33 mode piezoelectric energy generator for vehicle braking system"}, {"paperId": "98d8ebfe438e0bd49c7204881efb41be21151cd8", "title": "A Dual Control Regenerative Braking Strategy for Two-Wheeler Applications with Different Modes of Operation -A Review"}, {"paperId": "0a8e5028b6639bdcb10422e9496626fa4c9c8eeb", "title": "PV Based Electric Vehicles Applications With Regenerative Braking Using Bidirectional DC DC Converter"}, {"paperId": "b87f3eda13a51e418a64570bd13886a32acd031e", "title": "Research on Composite Braking Control Strategy of Four-Wheel-Drive Electric Vehicles With Multiple Motors Based on Braking Energy Recovery Optimization"}]}
