{"paperId": "c8b65afb38721756e07bfe24b3fdc5665d331fef", "publicationVenue": {"id": "6be078fe-e448-4123-8096-25493e7a2502", "name": "ARES", "type": "conference", "alternate_names": ["Availability, Reliability and Security", "Availab Reliab Secur", "International Conference on Availability, Reliability and Security", "Int Conf Availab Reliab Secur"], "issn": "2554-2656", "url": "https://ares.hypotheses.org/", "alternate_urls": ["http://www.ares-conference.eu/"]}, "title": "Digital Twin-Enhanced Incident Response for Cyber-Physical Systems", "abstract": "Cyber-physical systems underpin many of our society’s critical infrastructures. Ensuring their cyber security is important and complex. A major activity in this regard is cyber security incident response, whose primary goal is to detect and mitigate cyber-attacks in order to ensure the continuity and resilience of services. For cyber-physical systems this is particularly challenging because it requires insights both from the cyber and physical (process) domains and the engagement of stakeholders that are not strictly concerned with cyber security. A technology that is receiving a lot of attention are digital twins – virtual representations of real-world (cyber-physical) systems. They can be used to support tasks such as estimating the state of a system and exploring the consequences of interventional activities (e.g., upgrades). In this paper, we examine the use of digital twins to support cyber security. Specifically, our novel contribution is to provide a comprehensive analysis of the types of activities and how different modalities of digital twin use can be applied to the phases of cyber security incident response. Building on this analysis, we propose a structured approach to enhancing cyber security playbooks for cyber-physical systems incident response with digital twins. Playbooks are an essential component of incident response, ensuring that multi-disciplinary teams are effective in responding to cyber security incidents; therefore, improvements in their execution can result in increased resilience. To illustrate our approach, we present its use for a playbook that is concerned with mitigating a cyber-attack to critical industrial equipment.", "venue": "ARES", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2023-08-29", "journal": {"name": "Proceedings of the 18th International Conference on Availability, Reliability and Security"}, "authors": [{"authorId": "2196141122", "name": "David Allison"}, {"authorId": "40042110", "name": "Philip Smith"}, {"authorId": "1695367", "name": "K. Mclaughlin"}], "citations": [{"paperId": "2bcc256bfa157f76158c0e9c02aa77f10b8c6ea8", "title": "Towards Incident Response Orchestration and Automation for the Advanced Metering Infrastructure"}]}
