{"paperId": "c8b7cb88edd20d8512bd95df8397ee5745db1fbf", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "A Framework for Attribute-Based Access Control in Processing Big Data with Multiple Sensitivities", "abstract": "There is an increasing demand for processing large volumes of unstructured data for a wide variety of applications. However, protection measures for these big data sets are still in their infancy, which could lead to significant security and privacy issues. Attribute-based access control (ABAC) provides a dynamic and flexible solution that is effective for mediating access. We analyzed and implemented a prototype application of ABAC to large dataset processing in Amazon Web Services, using open-source versions of Apache Hadoop, Ranger, and Atlas. The Hadoop ecosystem is one of the most popular frameworks for large dataset processing and storage and is adopted by major cloud service providers. We conducted a rigorous analysis of cybersecurity in implementing ABAC policies in Hadoop, including developing a synthetic dataset of information at multiple sensitivity levels that realistically represents healthcare and connected social media data. We then developed Apache Spark programs that extract, connect, and transform data in a manner representative of a realistic use case. Our result is a framework for securing big data. Applying this framework ensures that serious cybersecurity concerns are addressed. We provide details of our analysis and experimentation code in a GitHub repository for further research by the community.", "venue": "Applied Sciences", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-01-16", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "31283503", "name": "Anne M. Tall"}, {"authorId": "1705877", "name": "C. Zou"}], "citations": [{"paperId": "b49426b6b4463cc61fa826804e412dcb640d1427", "title": "GPT, Ontology, and CAABAC: A Tripartite Personalized Access Control Model Anchored by Compliance, Context and Attribute"}, {"paperId": "66abcf4dbfa1c271a9ac48a7edab9a944faae3aa", "title": "Attribute-Based Access Control Mechanisms for Data security in Cloud Environment"}, {"paperId": "f92bc77ab7e66ada8921e6d793dee60fc7edaaf4", "title": "Fortified MapReduce Layer: Elevating Security and Privacy in Big Data"}, {"paperId": "b46c0581462ab83f31a62f345b4eea71215e8655", "title": "Attribute-Centric and Synthetic Data Based Privacy Preserving Methods: A Systematic Review"}]}
