{"paperId": "c8befbd9f5dd19fdd60eb3bc0772adc84bed7d23", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "A MapReduce Approach to NoSQL RDF Databases", "abstract": "In recent years, the increased need to house and process large volumes of data has prompted the need for distributed storage and querying systems. The growth of machine-readable RDF triples has prompted both industry and academia to develop new database systems, called NoSQL, with characteristics that differ from classical databases. Many of these systems compromise ACID properties for increased horizontal scalability and data availability. This thesis concerns the development and evaluation of a NoSQL triplestore. Triplestores are database management systems central to emerging technologies such as the Semantic Web and linked data. The evaluation spans several benchmarks, including the two most commonly used in triplestore evaluation, the Berlin SPARQL Benchmark, and the DBpedia benchmark, a query workload that operates an RDF representation of Wikipedia. Results reveal that the join algorithm used by the system plays a critical role in dictating query runtimes. Distributed graph databases must carefully optimize queries before generating MapReduce query plans as network traffic for large datasets can become prohibitive if the query is executed naively.", "venue": "arXiv.org", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2016-01-08", "journal": {"name": "ArXiv", "volume": "abs/1601.01770"}, "authors": [{"authorId": "2064023351", "name": "A. Haque"}], "citations": [{"paperId": "1c9479dff0b9ad20537c05d6acd182b1f7edb87d", "title": "MapReduce-Based Approach to Find Accompany Vehicle in Traffic Data"}, {"paperId": "2703789238c80cc96e2a9d8dcc695d50316271ad", "title": "Datenbanksysteme für Business, Technologie und Web (BTW 2017), 17. Fachtagung des GI-Fachbereichs „Datenbanken und Informationssysteme\" (DBIS), 6.-10. März 2017, Stuttgart, Germany, Workshopband"}]}
