{"paperId": "c8ccd9a7c026d92d2e8cb00ed5cc283082970500", "publicationVenue": {"id": "22af107a-3e64-455e-92c6-82141a5a7e6a", "name": "IET Networks", "type": "conference", "alternate_names": ["IET Netw", "IET networks", "IET netw", "International Conference on Information and Emerging Technologies", "IET", "Int Conf Inf Emerg Technol"], "issn": "2047-4954", "url": "http://www.ietdl.org/IET-NET", "alternate_urls": ["https://digital-library.theiet.org/content/journals/iet-net"]}, "title": "Deep learning approach to multimedia traffic classification based on QoS characteristics", "abstract": "With the fast increase of multimedia traffic in Internet of Things (IoT) applications, IoT traffic now requires very different Quality of Service (QoS). By extensive statistical analysis of traffic flow data from a real world network, the authors find that there are some latent features hidden in the multimedia data, which can be useful for accurately differentiating multimedia traffic flows from the QoS perspective. Under limited training data conditions, existing shallow classification methods are limited in performance, and are thus not effective in classifying emerging multimedia traffic types, which have truly entered the era of big data and become very completed in QoS features. This situation inspires us to revisit the multimedia traffic classification problem with a deep learning (DL) approach. In this study, an improved DL-based multimedia traffic classification method is proposed, which considers the inherent structure of QoS features in multimedia data. An improved stacked autoencoder model is employed to learn the relevant QoS features of multimedia traffic. Extensive experimental studies with multimedia datasets captured from a campus network demonstrate the effectiveness of the proposed method over six benchmark schemes.", "venue": "IET Networks", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-05-01", "journal": {"name": "IET Networks", "pages": "145-154", "volume": "8"}, "authors": [{"authorId": "2101348", "name": "Zaijian Wang"}, {"authorId": "145536403", "name": "S. Mao"}, {"authorId": "2109430377", "name": "Weidong Yang"}], "citations": [{"paperId": "11baa8f1051df051a12a4f1b07c505667311a497", "title": "Fuzzy retrieval algorithm for film and television animation resource database based on deep neural network"}, {"paperId": "9d901452c920ba75af092e2c07ce68235e925369", "title": "Online Classification of Network Traffic Based on Granular Computing"}, {"paperId": "9c7d6ee9aca228c9dcb154244c5f25e086c06ec1", "title": "CB-GRU-an encrypted net traffic flow classification in SDN using optimizing hyper parameters of neural network"}, {"paperId": "00a1904847b645ac5d3100536513ae4b5c7498f6", "title": "Cyber-Bullying and Cyber-Harassment Detection Using Supervised Machine Learning Techniques in Arabic Social Media Contents"}, {"paperId": "54faf34c290c95366f9de3192b8bda4875a0fc45", "title": "Deep Learning Based Traffic Classification In Software Defined Networking –A Survey"}, {"paperId": "2bab7d3ec78ee0be24ccd345d2c58a6dea5aefac", "title": "RFID-based unsupervised apnea detection in health care system"}]}
