{"paperId": "c8dc089296e858a169584ee24d03158bcd803444", "publicationVenue": {"id": "e1ce0fed-d655-40bd-b678-9adc73f2e582", "name": "International Symposium on High Performance Computing Systems and Applications", "type": "conference", "alternate_names": ["International Conference on High Performance Computing and Simulation", "Int Conf High Perform Comput  Simul", "Int Symp High Perform Comput Syst Appl", "High Performance Computing Systems and Applications", "High Perform Comput Syst Appl", "Int Conf High Perform Comput Simul", "HPCS", "International Conference on High Performance Computing & Simulation"]}, "title": "Feedback-Based Resource Allocation for Batch Scheduling of Scientific Workflows", "abstract": "A scientific workflow is a set of interdependent compute tasks orchestrating large scale data analyses or in-silico experiments. Workflows often comprise thousands of tasks with heterogeneous resource requirements that need to be executed on distributed resources. Many workflow engines solve parallelization by submitting tasks to a batch scheduling system, which requires resource usage estimates that have to be provided by users. We investigate the possibility to improve upon inaccurate user estimates by incorporating an online feedback loop between workflow scheduling, resource usage prediction, and measurement.Our approach can learn resource usage of arbitrary type; in this paper, we demonstrate its effectiveness by predicting peak memory usage of tasks, as it is an especially sensitive resource type that leads to task termination if underestimated and leads to decreased throughput if overestimated.We compare online versions of standard machine learning models for peak memory usage prediction and analyze their interactions with different workflow scheduling strategies. By means of extensive simulation experiments, we found that the proposed feedback mechanism improves resource utilization and execution times compared to typical user estimates.", "venue": "International Symposium on High Performance Computing Systems and Applications", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-07-01", "journal": {"name": "2019 International Conference on High Performance Computing & Simulation (HPCS)", "pages": "761-768"}, "authors": [{"authorId": "40648980", "name": "Carl Witt"}, {"authorId": "2065517024", "name": "Dennis Wagner"}, {"authorId": "1693022", "name": "U. Leser"}], "citations": [{"paperId": "72d6ff7f3c8b7e1c8a1258dfe1d91b4b7d023c5d", "title": "Validity constraints for data analysis workflows"}, {"paperId": "0212b576be29c7f1ce1676d6bf63cf776e9dc00d", "title": "Predicting Dynamic Memory Requirements for Scientific Workflow Tasks"}, {"paperId": "04da6185966f733279010eb09e97f371cc57fdad", "title": "Novel Approaches Toward Scalable Composable Workflows in Hyper-Heterogeneous Computing Environments"}, {"paperId": "b1d99daa058a4d2887052a08c76e0be374eacf9c", "title": "Lotaru: Locally Predicting Workflow Task Runtimes for Resource Management on Heterogeneous Infrastructures"}, {"paperId": "1b090b9ee520aa20f0c9cc1ad95f6d93f9f92d7e", "title": "Validity Constraints for Data Analysis Workflows"}, {"paperId": "81538af0c225aff3e99fe8b0d9b1da27dec94c47", "title": "How Workflow Engines Should Talk to Resource Managers: A Proposal for a Common Workflow Scheduling Interface"}, {"paperId": "87b54cc8e3e7bd7af0e535e696e5927dafe2058f", "title": "Adaptive Resource Allocation for Workflow Containerization on Kubernetes"}, {"paperId": "4c27e561d7c0a78fc4f7593235c021d08ab6e1e0", "title": "Towards Advanced Monitoring for Scientific Workflows"}, {"paperId": "150d620b3207725c4db1ae464e8182bd2c611586", "title": "Leveraging Reinforcement Learning for Task Resource Allocation in Scientific Workflows"}, {"paperId": "f1934721a369b99949d374beebf466814118d462", "title": "Macaw: The Machine Learning Magnetometer Calibration Workflow"}, {"paperId": "fb345bbf62380e6cabbc358d7511d19b62566692", "title": "Lotaru: Locally Estimating Runtimes of Scientific Workflow Tasks in Heterogeneous Clusters"}, {"paperId": "b7215b2fd8a07acf5936379e0067b64502baa3b5", "title": "Tarema: Adaptive Resource Allocation for Scalable Scientific Workflows in Heterogeneous Clusters"}, {"paperId": "59fb7056e1f2307d8f21413329c56b52ba399222", "title": "Memory thrifty workflow resource assignment"}, {"paperId": "8e2ad71aa077f4f8178624cd9d2a9b74d4f918d8", "title": "Online Tarema: Learning Task and Infrastructure Characteristics at Workflow Runtime"}, {"paperId": "33e8b36adfb841ec449dcee53aa396e49428abc9", "title": "Integrating HPC, AI, and Workflows for Scientific Data Analysis"}]}
