{"paperId": "c8dd047217efec5cc9e08cf6cbf84f184c9219c9", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Data Provenance Inference in Machine Learning", "abstract": "Unintended memorization of various information granularity has garnered academic attention in recent years, e.g. membership inference [17] and property inference [18]. How to inversely use this privacy leakage to facilitate real-world applications is a growing direction, the recent efforts include dataset ownership inference [26] and user auditing [16, 28]. Standing on the data lifecycle and ML model production, we propose an inference process named Data Provenance Inference , which is to infer the generation, collection or processing property of the ML training data , to assist ML developers in locating the training data gaps without maintaining strenuous metadata. We formularly deﬁne the data provenance and the data provenance inference task in ML model production. Then we propose a novel inference strategy combining embedded-space multiple instance classiﬁcation and shadow learning. Comprehensive evaluations cover language, visual and structured data in black-box and white-box settings, with diverse kinds of data provenance (i.e. business, county, movie, user). Our best inference accuracy achieves 98.96% in the white-box text model when “author” is the data provenance. The experimental results indicate that in general the inference performance positively correlated with the amount of reference data for inference, the depth and also the amount of the parameter of the accessed layer. Furthermore, we give a post-hoc statistical analysis of data provenance deﬁnition to explain when our proposed method works well.", "venue": "arXiv.org", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "ArXiv", "volume": "abs/2211.13416"}, "authors": [{"authorId": "1785386451", "name": "Mingxue Xu"}, {"authorId": "1737850", "name": "Xiang Lorraine Li"}], "citations": []}
