{"paperId": "c8de50a23a219408bc8f950a81c9bb467f068c58", "publicationVenue": {"id": "20a3a2f3-532a-4f04-9f3d-1e268e100872", "name": "International Journal of Advanced Computer Science and Applications", "type": "journal", "alternate_names": ["Int J Adv Comput Sci Appl"], "issn": "2156-5570", "url": "http://sites.google.com/site/ijacsa2010/", "alternate_urls": ["http://thesai.org/Publication/Default.aspx", "https://thesai.org/Publications/IJACSA"]}, "title": "Decentralized Access Control using Blockchain Technology for Application in Smart Farming", "abstract": "The application of the Internet of Things (IoT) plays a crucial role in the fourth industrial revolution. The sophistication of technology due to the integration of heterogenous smart devices open a new threat from various aspects. Access control is the first line of defence to ensure that IoT resources are secure by preventing illegitimate users from gaining access to these resources. However, access control mechanisms face the limitation of technology in large scale IoT deployments since they are based on a centralized architecture. Significant research concerning decentralized access control solutions for securing IoT resources using combined techniques, such as blockchain, have caught much research attention in recent years. Nevertheless, research for decentralized access control for application in smart farming domain remain as a gap. Thus, this study presented a structured literature review on 81 articles related to the field of access control in IoT and blockchain technology to understand the challenges of centralized access control in securing IoT resources. This study serves as a foundation for decentralized access control using blockchain technology and its application to ensure the IoT actuators and sensors security with the aim to be applied in smart farming. This paper was deliberated based on systematic literature review that was searched from four different database platforms between 2018 and 2021. This study mostly addresses the relevant techniques/approaches including blockchain technology, access control model, key management mechanism and the combination of all three methods. The possible impacts, gap, procedures and evaluation of the decentralized access control are highlighted along with major trends and challenges. Keywords—Blockchain; access control; smart contract; internet of thing", "venue": "International Journal of Advanced Computer Science and Applications", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": null, "journal": {"name": "International Journal of Advanced Computer Science and Applications"}, "authors": [{"authorId": "2117663778", "name": "Normaizeerah Mohd Noor"}, {"authorId": "73380002", "name": "N. Razali"}, {"authorId": "2117625078", "name": "Nur Atiqah Malizan"}, {"authorId": "49522184", "name": "K. K. Ishak"}, {"authorId": "6535761", "name": "Muslihah Wook"}, {"authorId": "32768845", "name": "N. Hasbullah"}], "citations": [{"paperId": "8076b56a986c4f5893f9d0fddeed4f0d84507a16", "title": "Security of digital agriculture networks: A review and bibliometric analysis"}, {"paperId": "83feb30a3466f9ac12a9c367b843159acd4dbbf5", "title": "Decentralised Access Control Framework using Blockchain: Smart Farming Case"}]}
