{"paperId": "c8ee6d952f0b33697fb622f5c44aeb42e53d074b", "publicationVenue": {"id": "c0ec137d-a370-425d-9cf0-766fd7f536dd", "name": "Journal of Applied Security Research", "type": "journal", "alternate_names": ["J Appl Secur Res"], "issn": "1936-1610", "url": "http://www.tandfonline.com/loi/wasr20", "alternate_urls": ["http://www.tandfonline.com/toc/wasr20/current"]}, "title": "Applied Intelligent Data Analysis to Government Data Related to Criminal Incident: A Systematic Review", "abstract": "Abstract Context Crime is a prevalent social problem, then, government and society, in general, have had enormous problems caused by this phenomenon. However, with the increasing ability to collect and store detailed criminal event tracking data, a significant amount of data with spatial and temporal information is obtained daily. Intelligent computer systems have been playing a vital role in improving the results of criminal investigations and detections, facilitating analysis and sharing of information. Objective To identify, characterize and meta-analyze the approaches and intelligent algorithms used to discover patterns on criminal incident data. Method A quantitative systematic review (with meta-analysis) was performed. Results 38.53% of the selected studies used Unsupervised Machine Learning, 30.28% used Supervised Machine Learning and 17.43% used Association rules. Regarding algorithms, K-Means (14.39%), K-Nearest Neighbors (KNN) (11.36%) and Apriori (9.85%) are among the most widely used. Conclusion Only three studies could be selected for meta-analysis, observing the Decision Tree, Logistic Regression, Naive Bayes, Random Forest, and Support Vector Machine algorithms. Being a global problem, the criminal area has attracted the attention of many researchers and scientists around the world. In addition, the Government Open Data phenomenon has facilitated access to data, providing a considerable increase in research in this area.", "venue": "Journal of Applied Security Research", "year": 2020, "fieldsOfStudy": ["Political Science"], "publicationTypes": ["Review"], "publicationDate": "2020-01-25", "journal": {"name": "Journal of Applied Security Research", "pages": "297 - 331", "volume": "15"}, "authors": [{"authorId": "1861909880", "name": "Kleber Henrique de Jesus Prado"}, {"authorId": "2127262529", "name": "Layse Santos Souza"}, {"authorId": "2127249510", "name": "Israel Dias de Jesus Junior"}, {"authorId": "2125663859", "name": "Methanias Colaço Júnior"}], "citations": [{"paperId": "80028fc5c4c750d6c7c841e81d00d9462bc71255", "title": "A graph neural network-enhanced knowledge graph framework for intelligent analysis of policing cases."}, {"paperId": "e4775415e55f729af347a00ebb9b7124b2714a0a", "title": "Survey of Text Mining Techniques Applied to Judicial Decisions Prediction"}, {"paperId": "9c089444e05399d256bb33ac7ac62df55da3696b", "title": "Data Science Applied to Crime Analysis Based on Brazilian Open Government Data"}, {"paperId": "87bf9ec345dd5cee04608aa122b30bf61512601b", "title": "Exquisite Analysis of Popular Machine Learning–Based Phishing Detection Techniques for Cyber Systems"}]}
