{"paperId": "c9079320493129adfcaffb6faf4dcab64bb57a74", "publicationVenue": null, "title": "Research Progress on Privacy-Preserving Techniques in Big Data Computing Environment", "abstract": "The widespread deployment and application of distributed big data computing environments, such as batch processing, streaming computing, and machine learning in cloud, have brought great convenience to users for efficiently processing massive amounts of data, but the accompanying leakage incidents of privacy data have intensified. How to protect data privacy in such a big data computing environment deployed in cloud has become a research hotspot. This paper provides a comprehensive overview of the latest research achievements and progress of big data privacy protection in this field, mainly including domestic and foreign research work in recent years. Firstly, we introduce the participating roles and application scenarios in the above-mentioned big data computing environment. Combining the adversary models of different roles, starting from the three links of data input, computation, and output involved in the distributed computing process, privacy issues are divided into three categories: privacy leakage of native individual data during the data input stage, private data being stolen by attacker during the data computation process, and sensitive information being maliciously inferred by", "venue": "", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": null, "journal": null, "authors": [{"authorId": "48469435", "name": "Wenjun Qian"}, {"authorId": "40238834", "name": "Qingni Shen"}, {"authorId": "2111193284", "name": "Peng Wu"}, {"authorId": "3381464", "name": "Chuntao Dong"}, {"authorId": "2230203004", "name": "Zhong-Hai Wu"}], "citations": [{"paperId": "c329dea5d87401ab9c357e3fe4af1f72e3bd585e", "title": "Survey of the Application of Privacy Computing Technology in the Electric-power Industry"}, {"paperId": "74327d0c5c899941ab5eed84dbd24442a30e3156", "title": "FedACQ: adaptive clustering quantization of model parameters in federated learning"}, {"paperId": "5b273f1523b7c3d96e28fbefe1c3bb06d9cdb869", "title": "Breast Cancer Prediction Based on Differential Privacy and Logistic Regression Optimization Model"}, {"paperId": "6a3ae15df8eb2fb897019fce9df16fca89a59da8", "title": "An Electric Power Data Privacy Protection Algorithm Based on Multiple Composite Functions"}, {"paperId": "8130226c17db07e663b83571ad0a68e065e4c739", "title": "A heterogeneous network structure publishing security framework based on cloud-edge collaboration"}, {"paperId": "4b2aa8e3d1251874324990127f4a69cfd3ef03e7", "title": "Particle Swarm K-Means++ Clustering Method Based on Multiple Differential Privacy Protection Mechanism"}, {"paperId": "f5d6521f5dd67405ca6b6a91fa39c04ffd218274", "title": "A survey on fast and incremental technologies for big data"}]}
