{"paperId": "c9230d092500df7e2e2710e95326022f68bc1c2b", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "A Comprehensive Survey on the Process, Methods, Evaluation, and Challenges of Feature Selection", "abstract": "Feature selection is employed to reduce the feature dimensions and computational complexity by eliminating irrelevant and redundant features. A vast amount of increasing data and its processing generates many feature sets, which are reduced by the feature selection process to improve the performance in all types of classification, regression, clustering models. This study performs a detailed analysis of motivation and concentrates on the fundamental architecture of feature selection. This study aims to establish a structured formation related to popular methods such as filters, wrappers and, embedded into search strategies, evaluation criteria, and learning methods. Different methods organize a comparison of the benefits and drawbacks followed by multiple classification algorithms and standard validation measures. The diversity of applications in multiple domains such as data retrieval, prediction analysis, and medical, intrusion, and industrial applications is efficiently highlighted. This study focuses on some additional feature selection methods for handling big data. Nonetheless, new challenges have surfaced in the analysis of such data, which were also addressed in this study. Reflecting on commonly encountered challenges and clarifying how to obtain the absolute feature selection method are the significant components of this study.", "venue": "IEEE Access", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "99595-99632", "volume": "10"}, "authors": [{"authorId": "2588057", "name": "Md. Rashedul Islam"}, {"authorId": "2149534558", "name": "Aklima Akter Lima"}, {"authorId": "2152905283", "name": "S. Das"}, {"authorId": "145821922", "name": "M. Mridha"}, {"authorId": "2162543470", "name": "Akibur Rahman Prodeep"}, {"authorId": "1684644", "name": "Y. Watanobe"}], "citations": [{"paperId": "c2e036315ff42bd24e308e07d02af73372029153", "title": "Acute exacerbation prediction of COPD based on Auto-metric graph neural network with inspiratory and expiratory chest CT images"}, {"paperId": "ceb0095d8ea88df17ebfce65133238831c6a8ad7", "title": "A characteristic extraction method for VoicePrint slice statistics base on joint time-frequency processing"}, {"paperId": "e6a6f479d74fb48d476cd6ec52a7a086869538e8", "title": "Contextual Feature Selection with Conditional Stochastic Gates"}, {"paperId": "bf942b0a17a57a8d481f9cb493263344d480097f", "title": "A Multivariate Time Series Analysis of Electrical Load Forecasting Based on a Hybrid Feature Selection Approach and Explainable Deep Learning"}, {"paperId": "a1497532259330a3d7faab431c7edaef34aa3647", "title": "A Novel Hybrid Feature Importance and Feature Interaction Detection Framework for Predictive Optimization in Industry 4.0 Applications"}, {"paperId": "7db9f9cc3c13939fa4ffa114930c09f0ed6812cf", "title": "Optimized Feature Selection Approach Based on Entropy for Multi-Class Data Classification"}, {"paperId": "7caa5165437ee9a398a70ac0e3ee630d9bacc102", "title": "Feature selection for binary classification based on class labeling, SOM, and hierarchical clustering"}, {"paperId": "dfedd8dce3d7c27515297d6d37f9ab389c555328", "title": "Efficient Multiclass Classification Using Feature Selection in High-Dimensional Datasets"}, {"paperId": "481ffce0c5b803223c5b25ecfd682dc1e00332da", "title": "Binary Optimization Using Hybrid Owl Optimization For Biomarker Selection From Cancer Datasets"}, {"paperId": "819d69bd2a3b53cd4b03cf9e6d464d2160c9281e", "title": "A Fuzzy Integral Approach for Ensembling Unsupervised Feature Selection Algorithms"}, {"paperId": "64cb4aac903064663c1605ccfe7615034da53f64", "title": "An election strategy for online streaming feature selection"}, {"paperId": "63d839d0dec8728743c9a9bac3149557116a1c67", "title": "A Review on the Evaluation of Feature Selection Using Machine Learning for Cyber-Attack Detection in Smart Grid"}]}
