{"paperId": "c925e57e852e0f69562fc6ed90a9bf262a3d79d8", "publicationVenue": {"id": "74deb45a-ec57-4368-8178-b3f3947e4d89", "name": "International Conference on Circuit, Power and Computing Technologies", "type": "conference", "alternate_names": ["ICCPCT", "Int Conf Circuit Power Comput Technol"]}, "title": "Privacy preserving scheme for MapReduce", "abstract": "In present world, each and every industry/organization is generating a large volume of data. Capturing, processing and analyzing this vast amount of data is very difficult using traditional database and other tools. Meantime, the transformation of cloud services presents great opportunity for organizations to increase productivity at the same time reducing their cost. Cloud computing offers variety of services for processing data on multiple large-scale datasets with the help of distributed computation framework. One of the most common platform-as-a-service in cloud computing is MapReduce, which is introduced by Google in 2004. It is a programming model that provides and efficient parallel and fault tolerant processing on large volume of data without requiring any costly dedicated computing nodes. It allows to process huge amount of data by distributing data as well as computing over a number of nodes. MapReduce is the key approach to answer today's Big Data problems because of its scalability. Today it is used widely around the world as an efficient distributed computation tool to solve large class of problems. However, due to scattered computation and distributed sensitive data among various nodes and the flow of sensitive data between the nodes while computation, the security and privacy concerns in MapReduce are aggravated. In the last decade, the privacy protection and security of data is the one of the most concerned issue in the cloud applications and in big data platform. In this paper, we discussed about MapReduce with its privacy and security aspects. Then we develop a solution which maintains confidentiality intermediate data as well as the data stored in HDFS which can preserve data privacy.", "venue": "International Conference on Circuit, Power and Computing Technologies", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2017-04-01", "journal": {"name": "2017 International Conference on Circuit ,Power and Computing Technologies (ICCPCT)", "pages": "1-6"}, "authors": [{"authorId": "26973623", "name": "Madhvaraj M. Shetty"}, {"authorId": "3179783", "name": "D. Manjaiah"}], "citations": [{"paperId": "289ba046ee3442a3eac14e2d71c6e73451503ca4", "title": "Hybrid Elliptic Curve Cryptographic Approach for Data Privacy and Authentication in Secured Map Reduce Layer (SMR) for Optimized CPU Utilization"}, {"paperId": "c11ee16b53ce6c66f0450c9c0c8eb8361c48487c", "title": "Secure computation in the cloud using MapReduce"}]}
