{"paperId": "c9422b80a5279d9e0bce6694d5b2805ab5eabdae", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Shaping Online Dialogue: Examining How Community Rules Affect Discussion Structures on Reddit", "abstract": "Community rules play a key part in enabling or constraining the behaviors of members in online communities. However, little is unknown regarding whether and to what degree changing rules actually affects community dynamics. In this paper, we seek to understand how these behavior-governing rules shape the interactions between users, as well as the structure of their discussion. Using the top communities on Reddit (i.e. subreddits), we first contribute a taxonomy of behavior-based rule categories across Reddit. Then, we use a network analysis perspective to discover how changing implementation of different rule categories affects subreddits' user interaction and discussion networks over a 1.5 year period. Our study find several significant effects, including greater clustering among users when subreddits increase rules focused on structural regulation and how restricting allowable content surprisingly leads to more interactions between users. Our findings contribute to research in proactive moderation through rule setting, as well as lend valuable insights for online community designers and moderators to achieve desired community dynamics.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-02", "journal": {"name": "ArXiv", "volume": "abs/2308.01257"}, "authors": [{"authorId": "2063949215", "name": "Anna Fang"}, {"authorId": "2120811725", "name": "Wenjie Yang"}, {"authorId": "1742431", "name": "Haiyi Zhu"}], "citations": [{"paperId": "21c93fd80e0b2826e9e7d14578b8087695d6ecee", "title": "Content Moderation and the Formation of Online Communities: A Theoretical Framework"}]}
