{"paperId": "c9586365afd1962683029933152a159291d7e9c9", "publicationVenue": {"id": "61c7e4f7-8d5c-40a4-b171-95f2920ad9d0", "name": "International Journal of Software Innovation", "type": "journal", "alternate_names": ["Int J Softw Innov"], "issn": "2166-7160", "url": "https://www.igi-global.com/journal/international-journal-software-innovation-ijsi/64245"}, "title": "A Systematic Literature Review on Test Case Prioritization Techniques", "abstract": "Regression testing (RT) provides confidence for any software to work properly after incorporating modifications in the software functionalities. The amendments in the software are visible due to the evolution or the adoption of the new functionalities in the software. New test cases might be added or removed from the test suit during the RT. TCP seeks to provide an execution order of test cases when test cases are large in number for the detection of faults at an early stage. This paper provides classification of available TCP techniques that are examined based on the six research questions having higher relevance regarding the TCP. To carry out a systematic literature review (SLR) on TCP techniques, the authors extracted a large number of papers from appropriate repositories of journals, conferences, workshops, and symposiums using various search keywords. Each TCP approach has its own limitations, potential value, and advantages, which are covered in this SLR in considerable detail.", "venue": "International Journal of Software Innovation", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-01-01", "journal": {"name": "Int. J. Softw. Innov.", "pages": "1-36", "volume": "10"}, "authors": [{"authorId": "2142379375", "name": "H. Singh"}, {"authorId": "2146509577", "name": "Laxman Singh"}, {"authorId": "2019213", "name": "S. Tiwari"}], "citations": [{"paperId": "58fdda917ab015b2c82426b668678b77a5648c21", "title": "Static Test Case Prioritization Strategies for Grammar-Based Testing"}, {"paperId": "738d556316e5c5326cc6d015ac633ce8dfcbf27a", "title": "A Decomposition Algorithm for Dynamic Car Sequencing Problems with Buffers"}]}
