{"paperId": "c962087cf2df8bbc535aa646ccbb610ac4ce4252", "publicationVenue": {"id": "ca61b508-d706-40a4-8b54-d657dd6cd9d6", "name": "ACM Transactions on Knowledge Discovery from Data", "type": "journal", "alternate_names": ["ACM Trans Knowl Discov Data", "ACM Transactions on Knowledge Discovery From Data"], "issn": "1556-4681", "url": "http://www.acm.org/pubs/tkdd/", "alternate_urls": ["http://portal.acm.org/tkdd", "http://portal.acm.org/browse_dl.cfm?coll=portal&dl=ACM&idx=J1054&linked=1&part=transaction"]}, "title": "Network Public Opinion Detection During the Coronavirus Pandemic: A Short-Text Relational Topic Model", "abstract": "Online social media provides rich and varied information reflecting the significant concerns of the public during the coronavirus pandemic. Analyzing what the public is concerned with from social media information can support policy-makers to maintain the stability of the social economy and life of the society. In this article, we focus on the detection of the network public opinions during the coronavirus pandemic. We propose a novel Relational Topic Model for Short texts (RTMS) to draw opinion topics from social media data. RTMS exploits the feature of texts in online social media and the opinion propagation patterns among individuals. Moreover, a dynamic version of RTMS (DRTMS) is proposed to capture the evolution of public opinions. Our experiment is conducted on a real-world dataset which includes 67,592 comments from 14,992 users. The results demonstrate that, compared with the benchmark methods, the proposed RTMS and DRTMS models can detect meaningful public opinions by leveraging the feature of social media data. It can also effectively capture the evolution of public concerns during different phases of the coronavirus pandemic.", "venue": "ACM Transactions on Knowledge Discovery from Data", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-10-22", "journal": {"name": "ACM Transactions on Knowledge Discovery from Data (TKDD)", "pages": "1 - 27", "volume": "16"}, "authors": [{"authorId": "3422635", "name": "Yuanchun Jiang"}, {"authorId": "2147287343", "name": "Ruicheng Liang"}, {"authorId": "2116922778", "name": "Ji Zhang"}, {"authorId": "2235114", "name": "Jianshan Sun"}, {"authorId": "2114770", "name": "Yezheng Liu"}, {"authorId": "152739210", "name": "Yang Qian"}], "citations": [{"paperId": "ee9a71981196657e1a6bf6be00ca2a0ba2f91789", "title": "Exploring COVID-19 Vaccine Hesitancy Through Topic Modeling: A Systematic Literature Review"}, {"paperId": "8bb5d60ec26167e481abb0ae4a867e93ea0684ce", "title": "Predicting multi-subsequent events and actors in public health emergencies: An event-based knowledge graph approach"}, {"paperId": "defd7aaaa36e1ea5059baef1655409ef0a074c8d", "title": "Opinion Summarization via Submodular Information Measures"}, {"paperId": "f84294bf08222e5b80661cc0753296a7311a4439", "title": "Deep attention framework for retweet prediction enriched with causal inferences"}, {"paperId": "5043f189af5cfee5bad008da749a8fe800dc54aa", "title": "A Social Media Knowledge Retrieval Method Based on Knowledge Demands and Knowledge Supplies"}, {"paperId": "435cbb60b16e809baf25885ed8ca54491d46643b", "title": "Topic-Clustering Model with Temporal Distribution for Public Opinion Topic Analysis of Geospatial Social Media Data"}, {"paperId": "7976e95118851a9618c8578c0e5f39639de50500", "title": "Applying Blockchain Technology in Network Public Opinion Risk Management System in Big Data Environment"}, {"paperId": "faf41e2d0e40463e1e2110025ada47d20de0da00", "title": "The role of hyper-parameters in relational topic models: Prediction capabilities vs topic quality"}, {"paperId": "b4898da241820cfef589c324b6a6321ca56014b4", "title": "Application of edge computing combined with deep learning model in the dynamic evolution of network public opinion in emergencies"}]}
