{"paperId": "c964a728a5accf123e5b1266cbce7e384c687da7", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Using a Digital Twin as the Objective Function for Evolutionary Algorithm Applications in Large Scale Industrial Processes", "abstract": "In this paper, we describe how the up-to-date state of a digital twin, and its corresponding simulation model, can be used as a fitness function of an evolutionary algorithm for optimizing a large-scale industrial process. An ICT architecture is presented for solving the computational challenges that arise when the fitness function evaluation takes considerable amount of time. Parallel computation of the fitness function in a cloud computing environment is proposed and the evolutionary algorithm is connected to the computational environment using the Function-as-a-Service approach. A case-study was conducted on the district heating network of Espoo, the second largest city in Finland. The study shows that the architecture is suited for optimizing the operating costs of the large district heating network, with over 800 km of water pipes and over 14 heat producers, reaching a cost-saving of an average of 2%, and up-to 4%, over the current industrial state-of-the-art method in use at the city of Espoo.", "venue": "IEEE Access", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "24185-24202", "volume": "11"}, "authors": [{"authorId": "2140782059", "name": "Miro Eklund"}, {"authorId": "1777045", "name": "S. Sierla"}, {"authorId": "1397067191", "name": "H. Niemisto"}, {"authorId": "35533224", "name": "Timo Korvola"}, {"authorId": "34814941", "name": "J. Savolainen"}, {"authorId": "3290808", "name": "Tommi A. Karhela"}], "citations": [{"paperId": "b12b49151b4ea20360fce08c20fb486145aeb32f", "title": "Deep reinforcement learning for fuel cost optimization in district heating"}, {"paperId": "e1c045f0a1319a61e7b69b5afbe986c6cb652141", "title": "Application of reinforcement learning for energy consumption optimization of district heating system"}]}
