{"paperId": "c96ce0f110fbc3503d749f91ddf16dd6c34d493a", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "VNF Chain Placement for Large Scale IoT of Intelligent Transportation", "abstract": "With the advent of the Internet of things (IoT), intelligent transportation has evolved over time to improve traffic safety and efficiency as well as to reduce congestion and environmental pollution. However, there are some challenging issues to be addressed so that it can be implemented to its full potential. The major challenge in intelligent transportation is that vehicles and pedestrians, as the main types of edge nodes in IoT infrastructure, are on the constant move. Hence, the topology of the large scale network is changing rapidly over time and the service chain may need reestablishment frequently. Existing Virtual Network Function (VNF) chain placement methods are mostly good at static network topology and any evolvement of the network requires global computation, which leads to the inefficiency in computing and the waste of resources. Mapping the network topology to a graph, we propose a novel VNF placement method called BVCP (Border VNF Chain Placement) to address this problem by elaborately dividing the graph into multiple subgraphs and fully exploiting border hypervisors. Experimental results show that BVCP outperforms the state-of-the-art method in VNF chain placement, which is highly efficient in large scale IoT of intelligent transportation.", "venue": "Italian National Conference on Sensors", "year": 2020, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-07-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "20"}, "authors": [{"authorId": "48661545", "name": "Xing Wu"}, {"authorId": "2069671489", "name": "Jing Duan"}, {"authorId": "3256944", "name": "M. Zhong"}, {"authorId": "143667002", "name": "Peng Li"}, {"authorId": "1816707534", "name": "Jianjia Wang"}], "citations": [{"paperId": "7e631bbcc70e2af840662dc84fd482892857fb9c", "title": "Dynamic convolution layer based optimization techniques for object classification and semantic segmentation"}, {"paperId": "62d4bf2d3664898fcee87b6f5391b7e371171b1d", "title": "Weather-degraded image semantic segmentation with multi-task knowledge distillation"}, {"paperId": "1d1d77784cbb07a1550cd02d548077dcf967387e", "title": "Convolutional Neural Networks-Based Object Detection Algorithm by Jointing Semantic Segmentation for Images"}]}
