{"paperId": "c973f0225b2d6c08e2415d1b2fbaf666be1b4356", "publicationVenue": {"id": "1fa695f2-33b8-48e5-b650-df9bcc0397f0", "name": "Workshop on Irregular Applications: Architectures and Algorithms", "type": "conference", "alternate_names": ["Irregul Appl Archit Algorithm", "Irregular Applications: Architectures and Algorithms", "IA3", "Workshop Irregul Appl Archit Algorithm"]}, "title": "Compressed In-memory Graphs for Accelerating GPU-based Analytics", "abstract": "Processing large graphs has become an important irregular workload. We present Massively Parallel Log Graphs (MPLG) to accelerate GPU graph codes, including highly optimized codes. MPLG combines a compressed in-memory repre-sentation with low-overhead parallel decompression. This yields a speedup if the boost in memory performance due to the reduced footprint outweighs the overhead of the extra instructions to decompress the graph on the fly. However, achieving a sufficiently low overhead is difficult, especially on GPUs with their high-bandwidth memory. Prior work has only successfully employed similar ideas on CPUs, but those approaches exhibit limited parallelism, making them unsuitable for GPUs. On large real-world inputs, MPLG speeds up graph analytics by up to 67% on a Titan V GPU. Averaged over 15 graphs from several domains, it improves the performance of Rodinia's breadth-first search by 11.9%, Gardenia's connected components by 5.8%, and ECL's graph coloring by 5.0%.", "venue": "Workshop on Irregular Applications: Architectures and Algorithms", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-11-01", "journal": {"name": "2022 IEEE/ACM Workshop on Irregular Applications: Architectures and Algorithms (IA3)", "pages": "32-40"}, "authors": [{"authorId": "2173500321", "name": "Noushin Azami"}, {"authorId": "48489711", "name": "Martin Burtscher"}], "citations": [{"paperId": "f2800f60b2bf7f3654d0bfc651bad470470eb9a1", "title": "Experience Deploying Graph Applications on GPUs with SYCL"}]}
