{"paperId": "c9745c76f755e0f960bcef07ca4771f7c3bce738", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "An Improved LeNet-Deep Neural Network Model for Alzheimer’s Disease Classification Using Brain Magnetic Resonance Images", "abstract": "Alzheimer’s Disease (AD) is a psychological disorder in elderly people which causes severe intellectual disabilities. Proper processing of neuro-images can provide differences in brain tissues which may help in diagnosing the disease more effectively. But, due to the complex structures, this is a challenge in differentiating the brain tissues and classifying AD using traditional classification mechanisms. Deep Neural Network (DNN) is a machine learning technique that has the ability to absorb the most important information for classifying an object accurately. LeNet is a popular DNN based model with a simple and effective architecture that also consumes very less implementation time. As like most of the DNN models, LeNet also uses MaxPooling layer for dimensionality reduction by eliminating the information of minimum valued elements. In brain images low intensity valued pixels also may contain very important features. To keep the minimum valued elements too in the network, we have created a separate layer that performs Min-Pooling operation. MinPooling and MaxPooling layers are then concatenated together. Finally, we have replaced all MaxPooling Layers in LeNet by the concatenated layers. We have analysed and compared the performances of modified LeNet model with 20 other most commonly used DNN models, and some of the related works. It is observed that, the modified LeNet model achieved the highest performances. It is also observed that, original LeNet model can classify AD with a performance rate of 80%, whereas, the proposed modified LeNet model achieved an average performance rate of 96.64%.", "venue": "IEEE Access", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "161194-161207", "volume": "9"}, "authors": [{"authorId": "147913237", "name": "Ruhul Amin Hazarika"}, {"authorId": "104623485", "name": "Ajitha T. Abraham"}, {"authorId": "50845571", "name": "D. Kandar"}, {"authorId": "48996717", "name": "Arnab Kumar Maji"}], "citations": [{"paperId": "293ad7c94d879365f120c66c14e1fd8d341bfcbb", "title": "Effective classification of alzheimer disease based on image tractography framework utilizing GM-ABC-NN"}, {"paperId": "13e5ad5f106480c00c0a9ea41b631bd175bae267", "title": "A novel CNN architecture for accurate early detection and classification of Alzheimer’s disease using MRI data"}, {"paperId": "e500633c48188a38508505cc789eee0641f9ed46", "title": "Attention-based Efficient Classification for 3D MRI Image of Alzheimer's Disease"}, {"paperId": "307fd3fafe4a94f539d6514ff0967d6eec532038", "title": "Structure-focused Neurodegeneration Convolutional Neural Network for Modeling and Classification of Alzheimer's Disease"}, {"paperId": "162ae2518ab277ec85055c63936547ce4c0de29b", "title": "State-of-the-Art techniques in Alzheimer’s Disease prediction and classification: A Comprehensive Review"}, {"paperId": "149b7a26c81399be9ff3a05aea0e084313d0fc11", "title": "A Modified LeNet CNN for Breast Cancer Diagnosis in Ultrasound Images"}, {"paperId": "1d98839c28886823a3693d07332d8cff013d236f", "title": "A Review Paper about Deep Learning for Medical Image Analysis"}, {"paperId": "a347a37cedcfdc1e4b082d9a24c5e910b4f6716a", "title": "Implementasi Metode CNN Computer Vision Dalam Identifikasi Tipe Kerusakan Pohon Berbasis FHM"}, {"paperId": "da4b1bc299775be6786d1591bcdb92d3a21072d3", "title": "A Review of Convolutional Neural Networks, its Variants and Applications"}, {"paperId": "ec3e1b97ada56de6169c8e65a863e3ff1908693a", "title": "CAD-ALZ: A Blockwise Fine-Tuning Strategy on Convolutional Model and Random Forest Classifier for Recognition of Multistage Alzheimer’s Disease"}, {"paperId": "051196af0d045dfbbd24b7f5e75a3c757eb22220", "title": "Radio Frequency Identification for Drones Using Spectrogram and CNN"}, {"paperId": "87d444d905f84c643caff2353561099a19291821", "title": "A new strategy for the early detection of alzheimer disease stages using multifractal geometry analysis based on K-Nearest Neighbor algorithm"}, {"paperId": "e9ac0ac20a9315c6dcf093b7133ae4abbfcbd93d", "title": "Depthwise Separable Convolution ResNet with attention mechanism for Alzheimer's detection*"}, {"paperId": "9a1c7d47d540115c42ce55b5b62b3a31d50a4dc0", "title": "Alzheimers Disease Diagnosis using Machine Learning: A Review"}, {"paperId": "6d20e85b6360c9fd1f2d2cb3f986a78c32f3ee99", "title": "Diagnosis of Alzheimer’s Disease Using Convolutional Neural Network With Select Slices by Landmark on Hippocampus in MRI Images"}, {"paperId": "fb079bc2db8b9582fa0a0762386cc57fde5c940e", "title": "DNN-Based Hospital Service Satisfaction Using GCNNs Learning"}]}
