{"paperId": "c97601a205546a36a9fba60dd4fefd8428fff6c2", "publicationVenue": null, "title": "VIRTUAL TESTBED AS A CASE FOR BIG DATA", "abstract": "Complex modeling of the behavior of marine objects under the influence of real external excitation is the most important problem. At present, the accuracy of direct simulation of phenomena with known physics is comparable to the accuracy of the results obtained during the model experiment in towing tanks. Particularly relevant is the creation of such marine virtual testbed for full-featured simulators and when testing the knowledge base of onboard intelligent systems. Such integrated environment is a complex information object that combines the features of both the enterprise system and the highperformance modeling tool. Integrated environment based on these basic principles is designed to solve in real time the following problems: 1. Collection and analysis of information on the current state of dynamic object (DO) and the environment, remote monitoring of the state of objects. 2. Evaluation and coordination of joint actions of DOs, proceeding from current conditions, with the aim of optimally common problem solving. 3. Centralized support for decision-making by operators of DO control in non-standard situations, organization of information support for the interaction of decisionmakers in the conduct of ongoing operations. 4. Computer modeling of possible scenarios of situation development with the aim of selecting the optimal control strategy. 5. Centralized control of technical means. 6. Cataloging and accumulation of information in dynamic databases. Modern architecture of computer systems (especially GP GPU) allows direct full-featured simulation of a marine object in real time. Efficient mapping to a hybrid architecture allows even the ability to render ahead of time under various scenarios. The report discusses general concept of high-performance virtual testbed development and the experience of creating on their basis full-featured simulators.", "venue": "", "year": 2018, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "31562313", "name": "A. Degtyarev"}, {"authorId": "1737325", "name": "A. Bogdanov"}, {"authorId": "1708117", "name": "V. Korkhov"}, {"authorId": "1770259", "name": "I. Gankevich"}, {"authorId": "2100370252", "name": "Yu. V. Pylnev"}, {"authorId": "2078598592", "name": "A. V. Eibozhenko"}], "citations": [{"paperId": "919b04590e76ec56e50aa3fdfd4a0a69e0c6f698", "title": "Virtual Testbed: Concept and Applications"}]}
