{"paperId": "c98933d0cc2577ec81a19e94a0db38f79fe3c5b1", "publicationVenue": {"id": "bbdd88c4-fb38-40a7-9a05-df99e3d1eee2", "name": "International Conference on Information, Intelligence, Systems and Applications", "type": "conference", "alternate_names": ["Int Conf Inf Intell Syst Appl", "IISA"]}, "title": "Towards hierarchical cooperative analytics architecture in law enforcement agencies", "abstract": "The vast growth in populations and the widespread of metropolitan areas hinder the efforts of crime investigation and inhibit tracking the risk of threats to safety and national security. Information technology has been helping in tracing criminals and terrorists, but with the outspread of social networks and the emergence of the Internet of Things, new challenges have arisen. The Internet is becoming a major part of everyone's daily life. Data representing trustful and suspicious activities is continuously generated and stored everywhere at an unprecedented scale. This extremely large data, which is known as Big Data, may contain critical and helpful information that can be used in detecting, and in many cases, preventing illegal activities, crimes and more importantly terror attacks. Unfortunately, the limitations on the communication between administrative zones, the huge amount of data and the intrinsically unstructured nature of such data makes leveraging its usefulness impractical. In this paper, we propose a hierarchical cooperative analytics architecture that utilizes Big Data Analytics, Ontologies, and Metamodels to facilitate the analysis of data collected from different sources to aid law enforcement agencies' efforts in establishing law and maintaining security.", "venue": "International Conference on Information, Intelligence, Systems and Applications", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2017-08-01", "journal": {"name": "2017 8th International Conference on Information, Intelligence, Systems & Applications (IISA)", "pages": "1-6"}, "authors": [{"authorId": "2463672", "name": "Luay Alawneh"}, {"authorId": "144191457", "name": "Mahmoud H. Said"}, {"authorId": "1390128915", "name": "Ziad Al-Sharif"}], "citations": [{"paperId": "9b3c3de64a54f076dd95f6f83c8848f823858fcf", "title": "Multimedia analysis platform for crime prevention and investigation"}]}
