{"paperId": "c9a081fa3b292ed614fff0f7205a278d5cf742d4", "publicationVenue": {"id": "2dc4386c-f418-4a62-a2c3-6b89b06981be", "name": "Journal of Intelligent & Fuzzy Systems", "type": "journal", "alternate_names": ["Journal of Intelligent and Fuzzy Systems", "J Intell  Fuzzy Syst", "J Intell Fuzzy Syst"], "issn": "1064-1246", "url": "http://content.iospress.com/journals/journal-of-intelligent-and-fuzzy-systems/", "alternate_urls": ["http://www.iospress.nl/journal-of-intelligent-fuzzy-systems/", "https://www.iospress.nl/html/10641246.php"]}, "title": "Importance of clustering Improve of Modified Bee Colony Optimization (MBCO) algorithm by optimizing the clusters initial values", "abstract": "The modified bee colony algorithm is one of the excellent methods that has been proposed in recent years for data clustering. This MBCO algorithm randomly values the primary centers of the cluster by selecting a number of data from the data set, which makes the algorithm sensitive to the presence of noise and outgoing data in the data set and reduces its performance. Therefore, to solve this problem, the proposed method used three approaches to quantify the initial centers of the clusters. In the proposed method, first the initial centers of the clusters are generated by chaos methods, KMeans++algorithm and KHM algorithm to determine the optimal position for the centers. Then the MBCO algorithm starts working with these centers. The performance of the proposed method compared to a number of other clustering methods was evaluated on 7 UCI datasets based on 6 clustering evaluation criteria. For example, in the iris data set, the proposed method with chaos approaches, KHM and KMeans++with accuracy of 0.8725, 0.8737 and 0.8725, respectively, and the MBCO method with accuracy of 0.8678, and in terms of CH criteria, the proposed method with chaotic approaches, KHM and KMeans++reached values of 0.3901, 0.54848, 0.5147 and MBCO method of 0.3620, respectively. Better achieved. In general, the results of the experiments according to the 6 evaluation criteria showed better performance of the proposed method compared to other methods in most data sets according to the 6 evaluation criteria.", "venue": "Journal of Intelligent & Fuzzy Systems", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-07-30", "journal": {"name": "J. Intell. Fuzzy Syst.", "pages": "7559-7575", "volume": "43"}, "authors": [{"authorId": "15996795", "name": "Jinya Cai"}, {"authorId": "2195341360", "name": "Haiping Zhang"}, {"authorId": "2167228286", "name": "Xinping Yu"}], "citations": []}
