{"paperId": "c9a859204835e36fec4b1d4dbed9e81272c08073", "publicationVenue": null, "title": "Eras of Web Mapping Developments: Past, Present and Future", "abstract": "Abstract. Developments in web mapping and web based geographic information systems (GIS) have evolved rapidly over the past two decades. What began as online map images available to a small group of geospatial experts and professionals has developed to a comprehensive and interactive web map based on integrated information from multiple sources and manipulated by masses of users globally. This paper introduces a framework that outlines the eras of web mapping and significant developments among those eras. From this framework, some of the influences and trends can be determined, particularly those in relation to the development of technologies and their relation to the growth in the number and diversity of users and applications that utilise web mapping and geospatial information online.", "venue": "", "year": 2016, "fieldsOfStudy": ["Geography"], "publicationTypes": null, "publicationDate": "2016-06-13", "journal": {"name": "ISPRS - International Archives of the Photogrammetry, Remote Sensing and Spatial Information Sciences", "pages": "247-252", "volume": "41"}, "authors": [{"authorId": "1730248", "name": "B. Veenendaal"}], "citations": [{"paperId": "9c0544a981636367604fdfd2ac2e625b76dae406", "title": "Applying Geographic Information System Methodologies to Estimate the Catchment Area Accessibility of Park-and-Ride Facilities"}, {"paperId": "365aa6dcedacba8aaff448af8fe4fa10736c8fd3", "title": "A route pruning algorithm for an automated geographic location graph construction"}, {"paperId": "693b1906f25e371ac7380412fef23d5ee5a7497c", "title": "An Open Multi-user Platform in Support of Urban Development: the DATA WebGIS"}, {"paperId": "176046038b69ae4fbb10d499a65237e59e53cd60", "title": "Review of Web Mapping: Eras, Trends and Directions"}, {"paperId": "61944a32a7f5c47ffbb5faf3491f8ce57865580a", "title": "Promoting Open Data services to decision-makers: Providing interactive data through Web Maps and Web Applications for Oradea city and Bihor county"}, {"paperId": "2cd6e84230f4f1c7b1bf4880f396b23ad82c0037", "title": "A Back-Engineering Approach to Explore Human Mobility Patterns Across Megacities Using Online Traffic Maps"}]}
