{"paperId": "c9b6448e78cef885db60341922564f5e5063751b", "publicationVenue": {"id": "6be078fe-e448-4123-8096-25493e7a2502", "name": "ARES", "type": "conference", "alternate_names": ["Availability, Reliability and Security", "Availab Reliab Secur", "International Conference on Availability, Reliability and Security", "Int Conf Availab Reliab Secur"], "issn": "2554-2656", "url": "https://ares.hypotheses.org/", "alternate_urls": ["http://www.ares-conference.eu/"]}, "title": "A Machine Learning Driven Threat Intelligence System for Malicious URL Detection", "abstract": "Malicious websites predominantly promote the growth of criminal activities over the Internet restraining the development of web services. Furthermore, we see different types of devices being equipped with WiFi capabilities, that allow web traffic to pass through the device’s data systems with ease. The proposed framework in the present study analyzes the Uniform Resource Locator (URL) through which malicious users can gain access to the content of the websites. It thus eliminates issues of run-time latency and possibilities of users being subjected to browser oriented vulnerabilities. The primary objective of this paper is to detect malicious links on the web using a machine learning classification technique that would help users defend against cyber-crime attacks and related threats of the real world. This may be helpful in the newly expanding Intelligent Infrastructures, where we see more data availability almost daily. The embedding of malicious URLs is a predominant web threat faced by the Internet community in the present day and age. Attackers falsely claim of being a trustworthy entity and lure users to click on compromised links to extract confidential information, victimizing them towards identity theft. The present work explores the various ways of detecting malicious links from the host-based and lexical features of the URL in order to protect users from being subjected to identity theft attacks.", "venue": "ARES", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2021-08-16", "journal": {"name": "Proceedings of the 16th International Conference on Availability, Reliability and Security"}, "authors": [{"authorId": "71874612", "name": "Rupa Chiramdasu"}, {"authorId": "144369609", "name": "Gautam Srivastava"}, {"authorId": "2286538930", "name": "S. Bhattacharya"}, {"authorId": "29919430", "name": "Praveen Kumar Reddy Maddikunta"}, {"authorId": "11041265", "name": "T. Gadekallu"}], "citations": [{"paperId": "0c72f6ab02e93f78417f5adb73ecb21ea93d7361", "title": "Comparative Analysis of Word vs. Character Embedding for Machine Learning Based Detection of Malicious URLs and DGA-Generated Domains"}, {"paperId": "5fa185e6a3db49efa1bc950fa9ad9bc0e438e1d3", "title": "Enhancing Malicious QR Code Link Detection with Swarm-Intelligent Squirrel-Search Optimized ANN"}, {"paperId": "e6f478eb72a1934ac22d8a03935417bada3166a0", "title": "PhiUSIIL: A diverse security profile empowered phishing URL detection framework based on similarity index and incremental learning"}, {"paperId": "3523c3608bae89ca41fe89dcfde7b5b74f698be3", "title": "A Decision-Fusion-Based Ensemble Approach for Malicious Websites Detection"}, {"paperId": "641df64e3c88b19e6439d8688bcce8559115183c", "title": "A Hybrid SVM Based Real-Time Attack Classification Method for Cyber Network"}, {"paperId": "4d78fb4a7d4e984c3ce8a80936a8a50bd621b10a", "title": "Bilgisayarla İşlenen Suçlara Hızlı Müdahale, İnceleme, Analiz ve Raporlama Süreçlerinin Yeni Nesil Adli Bilişim Yöntemleri İle Etkin Yönetimi"}, {"paperId": "fdac750de7dbc53245ccada7fa2b830f99015766", "title": "Threat analysis for space information network based on network security attributes: a review"}, {"paperId": "a0ff9ddcef554cf20bc532fb0b731c52c1a0e80d", "title": "Privacy Preservation of Plant Disease Detection using Hashing based Convolution Neural Network"}, {"paperId": "8b25a7de1c9998e56b8e55e0c5559afc417d6f5f", "title": "Jointly beam stealing attackers detection and localization without training: an image processing viewpoint"}, {"paperId": "6f55fed0dc105649b541194f9634e5f1d1853704", "title": "Significance of Machine Learning for Detection of Malicious Websites on an Unbalanced Dataset"}, {"paperId": "a204b2cfc589ef6876b1b4e1a15a2ed38a5d5447", "title": "Hybrid methodology for analysis of structured and unstructured data to support decision-making in public security"}, {"paperId": "67b63c238be48fb195836804f9dd6d91dd640052", "title": "Improved Detection of Malicious Domain Names Using Gradient Boosted Machines and Feature Engineering"}, {"paperId": "61f870b311e5ae14049fc81bf5e286db879bf80b", "title": "Evading obscure communication from spam emails."}, {"paperId": "1555aa57032467cd4007a1042850cb3fc424ca66", "title": "Integration of IMEI, RSA, and Signature to Secure Communication in Mobile Applications"}, {"paperId": "e147da40a300b3b0810ab17c9ecf6c1f192531c6", "title": "Convolution Neural Networks for Phishing Detection"}, {"paperId": "6588344b522f37354e3ff4649b18cd9ae95be93d", "title": "QsecR: Secure QR Code Scanner According to a Novel Malicious URL Detection Framework"}, {"paperId": "ccf2ae666cf9084fce307debeba0d37afe42a5e0", "title": "Detecting Malicious URLs Using Machine Learning Techniques: Review and Research Directions"}, {"paperId": "46300e8ccdb2e20656d6e236c6261fe3f15c8aaa", "title": "Design and Testing Novel One-Class Classifier Based on Polynomial Interpolation With Application to Networking Security"}, {"paperId": "42ac0d2026b0cd0ca17d306a75ccaa749a287e59", "title": "A Comprehensive Survey on Computer Forensics: State-of-the-art, Tools, Techniques, Challenges, and Future Directions"}, {"paperId": "b04750610708ddb04afc6a9aeb8abd90933da4c2", "title": "Characteristics of Understanding URLs and Domain Names Features: The Detection of Phishing Websites With Machine Learning Methods"}]}
