{"paperId": "c9bb656aeb2adc0df89de74ebbe9427c73bfdbcd", "publicationVenue": null, "title": "Towards Incremental Build of Software Configurations", "abstract": "Building software is a crucial task to compile, test, and deploy software systems while continuously ensuring quality. As software is more and more configurable, building multiple configurations is a pressing need, yet, costly and challenging to instrument. The common practice is to independently build (a.k.a., clean build) a software for a subset of configurations. While incremental build has been considered for software evolution and relatively small modifications of the source code, it has surprisingly not been considered for software configurations. In this vision paper, we formulate the hypothesis that incremental build can reduce the cost of exploring the configuration space of software systems. We detail how we apply incremental build for two real-world application scenarios and conduct a preliminary evaluation on two case studies, namely x264 and Linux Kernel. For x264, we found that one can incrementally build configurations in an order such that overall build time is reduced. Nevertheless, we could not find any optimal order with the Linux Kernel, due to a high distance between random configurations. Therefore, we show it is possible to control the process of generating configurations: we could reuse commonality and gain up to 66% of build time compared to only clean builds.CCS CONCEPTS • Software and its engineering $\\rightarrow$ Software configuration management and version control systems.", "venue": "2022 IEEE/ACM 44th International Conference on Software Engineering: New Ideas and Emerging Results (ICSE-NIER)", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2022-05-01", "journal": {"name": "2022 IEEE/ACM 44th International Conference on Software Engineering: New Ideas and Emerging Results (ICSE-NIER)", "pages": "101-105"}, "authors": [{"authorId": "2154316077", "name": "Georges Aaron Randrianaina"}, {"authorId": "1866611", "name": "D. Khelladi"}, {"authorId": "2624371", "name": "Olivier Zendra"}, {"authorId": "2191325", "name": "M. Acher"}], "citations": [{"paperId": "27011931951b21d1b75d82265f78a97d4da9914f", "title": "Enabling Fine-Grained Incremental Builds by Making Compiler Stateful"}, {"paperId": "20d6ae48cd20fe34b42dd6982e9fa4380e0e1904", "title": "PyroBuildS: Enabling Efficient Exploration of Linux Configuration Space with Incremental Build"}, {"paperId": "01cd8f8e12e811746bf13db001bb891417ed2435", "title": "Options Matter: Documenting and Fixing Non-Reproducible Builds in Highly-Configurable Systems"}]}
