{"paperId": "c9c3f4400d091aba2a29c8b32d66291e3eb16779", "publicationVenue": {"id": "7b2adce0-d53f-49d6-8784-b0645604fe62", "name": "ACM Computing Surveys", "type": "journal", "alternate_names": ["ACM Comput Surv"], "issn": "0360-0300", "url": "http://www.acm.org/pubs/surveys/", "alternate_urls": ["http://portal.acm.org/csur", "https://csur.acm.org/", "http://csur.acm.org/"]}, "title": "Statistically-Robust Clustering Techniques for Mapping Spatial Hotspots: A Survey", "abstract": "Mapping of spatial hotspots, i.e., regions with significantly higher rates of generating cases of certain events (e.g., disease or crime cases), is an important task in diverse societal domains, including public health, public safety, transportation, agriculture, environmental science, and so on. Clustering techniques required by these domains differ from traditional clustering methods due to the high economic and social costs of spurious results (e.g., false alarms of crime clusters). As a result, statistical rigor is needed explicitly to control the rate of spurious detections. To address this challenge, techniques for statistically-robust clustering (e.g., scan statistics) have been extensively studied by the data mining and statistics communities. In this survey, we present an up-to-date and detailed review of the models and algorithms developed by this field. We first present a general taxonomy for statistically-robust clustering, covering key steps of data and statistical modeling, region enumeration and maximization, and significance testing. We further discuss different paradigms and methods within each of the key steps. Finally, we highlight research gaps and potential future directions, which may serve as a stepping stone in generating new ideas and thoughts in this growing field and beyond.", "venue": "ACM Computing Surveys", "year": 2021, "fieldsOfStudy": ["Mathematics", "Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-03-22", "journal": {"name": "ACM Computing Surveys (CSUR)", "pages": "1 - 38", "volume": "55"}, "authors": [{"authorId": "46269169", "name": "Yiqun Xie"}, {"authorId": "145072875", "name": "S. Shekhar"}, {"authorId": "2152884622", "name": "Yan Li"}], "citations": [{"paperId": "8b60f4075495d5563fb0fea22a832b4471d5009f", "title": "Knowledge-guided Machine Learning: Current Trends and Future Prospects"}, {"paperId": "4547142d105455d7301581bc4d6656511b5006f5", "title": "Sparse K-means clustering algorithm with anchor graph regularization"}, {"paperId": "5caab99564af7b41881f170cbd69f445383b519c", "title": "Scalable Evaluation of Local K-Function for Radius-Accurate Hotspot Detection in Spatial Networks"}, {"paperId": "9822a7c5acceb181a36f3ba5df80f13cec84bd4c", "title": "Time-Varying Gaussian Markov Random Fields Learning for Multivariate Time Series Clustering"}, {"paperId": "982cb0f42962e36d46b116e187208d8eff8823bf", "title": "Discovery of multi-domain spatiotemporal associations"}, {"paperId": "3c1c819a7e535ad69f97825de5521232842e0a90", "title": "Identifying geochemical anomalies using a new method of Yang Chizhong-spatial scan statistic"}, {"paperId": "081e298cd2282c3910b9cc57cefcd677396fd5c2", "title": "Spatial hotspot detection in the presence of global spatial autocorrelation"}, {"paperId": "7e7b5b3bcc228333ec51db2a2273bab2a06ce3a9", "title": "Combined Gaussian Mixture Model and Pathfinder Algorithm for Data Clustering"}, {"paperId": "2a2519ecf6f36f62f993783a399b649ba6f95dfd", "title": "Sustainable Road Planning for Trucks in Urbanized Areas of Chinese Cities Using Deep Learning Approaches"}, {"paperId": "41b0a2bbeb9cd65fea915b32054e43a8aced9e18", "title": "Harnessing heterogeneity in space with statistically guided meta-learning"}, {"paperId": "0fcfce06e12bc354007a0bbe9f81c5fa015686b9", "title": "Significance-Based Categorical Data Clustering"}, {"paperId": "c763f585de8d730af0e79d7f6a288f9009f70ac5", "title": "Metricizing the Euclidean Space towards Desired Distance Relations in Point Clouds"}, {"paperId": "2ca9fb72462cb01b95cecdf66b6640b35d7aba85", "title": "Testing for Local Spatial Association Based on Geographically Weighted Interpolation of Geostatistical Data with Application to PM2.5 Concentration Analysis"}, {"paperId": "ed6f5c6257e72967780f207c0f4001702dede275", "title": "Using mobile network data to color epidemic risk maps"}, {"paperId": "34e4c402470f54ec5b59196a92b33c5844264694", "title": "Detecting spatial flow outliers in the presence of spatial autocorrelation"}, {"paperId": "9852d0ef475b448c0a653e24b844371dc2d1ac63", "title": "Towards quantitative super-resolution microscopy: Molecular maps with statistical guarantees"}, {"paperId": "fbb0338f5795622fe4faa5a1d53da2a182f80a07", "title": "Statistically-Guided Deep Network Transformation to Harness Heterogeneity in Space (Extended Abstract)"}, {"paperId": "f80acc7073b859ae2fa869e6734db3d473eade93", "title": "A Statistically-Guided Deep Network Transformation and Moderation Framework for Data with Spatial Heterogeneity"}, {"paperId": "4a338ff98cf007c821bd253febe3d6195a49b0d4", "title": "Discovering Mixture-Based Best Regions of Arbitrary Shapes"}, {"paperId": "f607426ef65efa32aafad6e88265783cb9ca1840", "title": "A clustering environment for real-time tracking and analysis of Covid-19 case clusters"}, {"paperId": "f1bf58afa87450c4af97634183b2de9fddaa5f16", "title": "Significant DBSCAN+: Statistically Robust Density-based Clustering"}, {"paperId": "93980649fa1ab92cd78cd0a37ec58ffc00a64151", "title": "Large-Scale River Mapping Using Contrastive Learning and Multi-Source Satellite Imagery"}, {"paperId": "5e4d4c25379ea5a6b4b389e87273f7235d6870b2", "title": "Mapping Mangrove Opportunities with Open Access Data: A Case Study for Bangladesh"}]}
