{"paperId": "c9c7d1909949e7787b416ec68de3b8e15648097d", "publicationVenue": {"id": "a00fde74-d8df-4613-b825-0fff9f531d3f", "name": "IEEE Transactions on Network and Service Management", "type": "journal", "alternate_names": ["IEEE Trans Netw Serv Manag"], "issn": "1932-4537", "url": "http://ejournals.ebsco.com/direct.asp?JournalID=714200", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4275028", "http://ieeexplore.ieee.org/servlet/opac?punumber=4275028"]}, "title": "Flexible Cyclic Queuing and Forwarding for Time-Sensitive Software-Defined Networks", "abstract": "Time-Sensitive Networking (TSN) is emerging to support critical real-time applications in Industry 4.0. Recent proposals leverage Cyclic Queuing and Forwarding (CQF) to achieve bounded-delay transmission for cyclic flows in TSN. However, the CQF is not flexible enough in two aspects. First, it cannot achieve zero jitter. The Ping-Pong queue-based model in CQF will introduce the jitter of two cycles, which is inapplicable to industrial automation scenarios where isochronous flows require zero jitter. Second, it may require setting the maximum queue length to a fixed value in advance and scheduling the flows offline, which is challenging for dynamic traffic scheduling. In this paper, we firstly present a time-aware cyclic-queuing (TACQ) mechanism to enable zero jitter for CQF. TACQ consists of a novel no-wait shaper (NWS) and a cyclic-queuing shaper (CQS). The NWS handles isochronous flows by strictly limiting the transmission time of flows that do not overlap on each output port and each period. The CQS is extended from CQF to schedule cyclic flows. Then, we propose a variable time slot mechanism and a novel incremental routing and scheduling (IRAS) algorithm based on software-defined networking (SDN) to online schedule dynamic flows. Simulation results show that TACQ significantly reduces the delay of isochronous flows and achieves zero jitter compared with CQF. And the IRAS algorithm approaches 96.1% of the optimal solution in scheduling 2000 flows with a feasible per-flow computational time.", "venue": "IEEE Transactions on Network and Service Management", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-03-01", "journal": {"name": "IEEE Transactions on Network and Service Management", "pages": "533-546", "volume": "20"}, "authors": [{"authorId": "2119108902", "name": "Yudong Huang"}, {"authorId": "2117010876", "name": "Shuo Wang"}, {"authorId": "2181381952", "name": "Xinyuan Zhang"}, {"authorId": "102628601", "name": "Tao Huang"}, {"authorId": "2117417872", "name": "Yun-jie Liu"}], "citations": [{"paperId": "021cd8b867450ab0784d8e8fa594f9c819aebfc2", "title": "P4SQA: A P4 Switch-Based QoS Assurance Mechanism for SDN"}, {"paperId": "16484bc8b598c09b8b30668c5a9b2f7c2d6ebc77", "title": "Qmix-Based Cross-Domain Transmission Routing for Time-Sensitive and Deterministic Networks"}, {"paperId": "368d9ad7a3ce4d1c1b1e3c4929064f8af187b662", "title": "TSN-FlexTest: Flexible TSN Measurement Testbed (Extended Version)"}, {"paperId": "8c528f228eb5f26a13d2d5208243322a0568cd7f", "title": "Queue Management Priority-Based Traffic Engineering Method"}]}
