{"paperId": "c9c7b16dffeee561c20c85e7a0cd8993f35ce344", "publicationVenue": null, "title": "Multi Aspect Sparse Time Integrated Cut-off Authentication (STI-CA) for Cloud Data Storage", "abstract": "Objectives/Background: Cloud infrastructure is a pool of commuting resources such as information storage servers, application progress platforms, load balancers and virtual machines that are shared between the users for transactional processes with on demand process. However, transactional process lacks a secure authentication system, while it does not attest the trustworthiness of dynamic contents threats which outlaw the cloud system. Methods/Statistical Analysis: To establish the authenticity and avoiding improper data modification on cloud based data transactions, a framework called, multi aspect Sparse Time Integrated Cut-off Authentication (STI-CA) for Cloud Data Storage is designed. STI-CA framework commences with the password registry for each cloud user on the basis of two dimensional service matrices reducing the overhead incurred during user authentication by applying Sparse Vector Cloud User Registry. Next, by utilizing Time Integrated One Time Password, which is unique for each cloud user and each login reduces the execution time and space complexity as the cloud server does not maintain the password. Finally, the Cut-off Potential Cryptography prevents the unauthorized user modification on transactional data, therefore improving the security. Here the Amazon Simple Storage Service (Amazon S3) dataset is used for experiment using the JAVA coding with Cloudsim3. A series of simulation results are performed to test the data confidentiality, execution time, communication overhead and space complexity for obtaining transactional data and measure the effectiveness of STI-CA framework. Findings: STI-CA framework offers better performance with an improvement of the data confidentiality by 31%, reduces execution time by 20%, reduce communication overhead by 30% and also minimize space complexity by 22% compared to existing models of DRAFT and iCloud native Mac OS X respectively. Applications/Improvements: It can be further extended with implementation of new model with different parameters which improves more confidentiality and integrity.", "venue": "", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2017-01-24", "journal": {"name": "Indian journal of science and technology", "volume": "10"}, "authors": [{"authorId": "9084540", "name": "R. Pragaladan"}, {"authorId": "40528536", "name": "S. Sathappan"}], "citations": [{"paperId": "4d23a661f2d56f4cbe12b94dc218a62bf100a96e", "title": "A Secure Cloud Data Storage Combining DNA Structure and Multi-aspect Time-Integrated Cut-off Potential"}]}
