{"paperId": "c9d1175e9a7f8c367f773751684c0fe50def77ea", "publicationVenue": {"id": "14523729-b002-4c94-b060-46c3ea0b1423", "name": "International Journal of Healthcare Management", "type": "journal", "alternate_names": ["International journal of healthcare management", "Int J Healthc Manag", "Int j healthc manag"], "issn": "2047-9700", "url": "http://www.tandfonline.com/loi/yjhm20"}, "title": "Factors impacting humanitarian operations in healthcare during life-threatening pandemics", "abstract": "ABSTRACT The aims of this paper are to ‘identify’, analyze’, and categorize’ the factors impacting humanitarian activities in healthcare during life-threatening pandemics like COVID-19 using Total Interpretive Structural Modelling (TISM). Nine humanitarian operation factors have been identified for healthcare during a life-threatening pandemic like COVID-19. The study states that the key factors are resource shortages, external factors, and a shortage of medical and non-medical specialists. The study focused primarily on humanitarian operations characteristics for the healthcare sector. The present study will assist key stakeholders and academics in gaining a better knowledge of the factors that impact humanitarian healthcare operations during life-threatening pandemics like COVID-19. The study analyses the interrelationships among humanitarian operations factors using humanitarian operations during life-threatening pandemics. During life-threatening, which is a novel attempt in the subject of this sector.", "venue": "International Journal of Healthcare Management", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": null, "publicationDate": "2022-09-12", "journal": {"name": "International Journal of Healthcare Management", "pages": "481 - 495", "volume": "16"}, "authors": [{"authorId": "2148260486", "name": "Albi Thomas"}, {"authorId": "145777699", "name": "M. Suresh"}, {"authorId": "2053007168", "name": "Bhavin Shah"}], "citations": [{"paperId": "e5482fcef29112b32593a7b3a9f575a36b7ff2fb", "title": "A Hybrid Approach for Emergency Supplies Site Selection Optimization: A Case Study of Changchun City Using Cellular Automata and WK-Means Clustering"}]}
