{"paperId": "c9db8ab6d7373ac5cd30a8eab63efe3ab4f409de", "publicationVenue": null, "title": "A Data Cube Metamodel for Geographic Analysis Involving Heterogeneous Dimensions", "abstract": "Due to their multiple sources and structures, big spatial data require adapted tools to be efficiently collected, summarized and analyzed. For this purpose, data are archived in data warehouses and explored by spatial online analytical processing (SOLAP) through dynamic maps, charts and tables. Data are thus converted in data cubes characterized by a multidimensional structure on which exploration is based. However, multiple sources often lead to several data cubes defined by heterogeneous dimensions. In particular, dimensions definition can change depending on analyzed scale, territory and time. In order to consider these three issues specific to geographic analysis, this research proposes an original data cube metamodel defined in unified modeling language (UML). Based on concepts like common dimension levels and metadimensions, the metamodel can instantiate constellations of heterogeneous data cubes allowing SOLAP to perform multiscale, multi-territory and time analysis. Afterwards, the metamodel is implemented in a relational data warehouse and validated by an operational tool designed for a social economy case study. This tool, called “Racines”, gathers and compares multidimensional data about social economy business in Belgium and France through interactive cross-border maps, charts and reports. Thanks to the metamodel, users remain independent from IT specialists regarding data exploration and integration.", "venue": "ISPRS Int. J. Geo Inf.", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-02-19", "journal": {"name": "ISPRS Int. J. Geo Inf.", "pages": "87", "volume": "10"}, "authors": [{"authorId": "71418285", "name": "Jean-Paul Kasprzyk"}, {"authorId": "100553714", "name": "G. Devillet"}], "citations": [{"paperId": "95bee744f00ef89574c450fada9d9564348ca694", "title": "Big spatial data modeling using data cube based on discrete global grid system"}, {"paperId": "a68d63daa440e1a046e9502fe83817ffb498f6ab", "title": "A multi-source spatio-temporal data cube for large-scale geospatial analysis"}, {"paperId": "b3355aaa7a0cb0ea26d5f0c6ac864f610ff50f0c", "title": "A Natural Language Interface to Relational Databases Using an Online Analytic Processing Hypercube"}, {"paperId": "3e94d5757e75bfab56f845ea48225e42169d318a", "title": "Faster Access Of Credit Cards Through Data Cube Technology"}]}
