{"paperId": "c9dcbabd81da6965efa4cde7c0a428f9ddc878db", "publicationVenue": {"id": "55cfe77c-5a32-4904-8db5-8025cd9e1bd7", "name": "Applied Mathematics and Nonlinear Sciences", "alternate_names": ["Appl Math Nonlinear Sci"], "issn": "2444-8656", "url": "https://content.sciendo.com/view/journals/amns/amns-overview.xml", "alternate_urls": ["http://journals.up4sciences.org/applied_mathematics_and_nonlinear_sciences.html"]}, "title": "Optimization of product marketing and management path of cross-border e-commerce enterprises relying on big data technology", "abstract": "\n Precision marketing is an intrinsic motivation for enterprises as a strategic consideration and guiding principle. In this paper, we first constructed a cross-border e-commerce precision marketing and management strategy based on big data technology. We mined user data and analyzed user behavior and characteristics. Moreover, the initial group division of users is carried out to realize the construction of user segmentation and user portrait, followed by the prediction of user purchasing behavior based on the Stacking algorithm and the use of a collaborative filtering algorithm to carry out accurate recommendations for different user groups. The effectiveness of the marketing management strategy is evaluated based on the level of customer value perception of Enterprise H. By using regression modeling, the impact of the marketing management method on customer loyalty and user purchase intention is investigated. The results show that the perceived level of each dimension of precision marketing is between (4,5.6), and the perceived risk is 3.657. The degree of explanation of the precision marketing model on the customer’s willingness to buy is 78.8%, and the t-value significance is 0.005, which reaches a significant level, indicating that the marketing management model is effective. The purpose of this study is to provide practical marketing management suggestions for enterprises that can obtain and maintain competitive advantages in fierce market competition, which will promote enterprise performance improvement and stable growth.", "venue": "Applied Mathematics and Nonlinear Sciences", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-01-01", "journal": {"name": "Applied Mathematics and Nonlinear Sciences"}, "authors": [{"authorId": "2284367873", "name": "Yangxue Luo"}], "citations": []}
