{"paperId": "c9de8b052562e03ebe8445a14d9cb3cb08e85fd6", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Enabling All In-Edge Deep Learning: A Literature Review", "abstract": "In recent years, deep learning (DL) models have demonstrated remarkable achievements on non-trivial tasks such as speech recognition, image processing, and natural language understanding. One of the significant contributors to the success of DL is the proliferation of end devices that act as a catalyst to provide data for data-hungry DL models. However, computing DL training and inference still remains the biggest challenge. Moreover, most of the time central cloud servers are used for such computation, thus opening up other significant challenges, such as high latency, increased communication costs, and privacy concerns. To mitigate these drawbacks, considerable efforts have been made to push the processing of DL models to edge servers (a mesh of computing devices near end devices). Recently, the confluence point of DL and edge has given rise to edge intelligence (EI), defined by the International Electrotechnical Commission (IEC) as the concept where the data is acquired, stored, and processed utilizing edge computing with DL and advanced networking capabilities. Broadly, EI has six levels of categories based on the three locations where the training and inference of DL take place, e.g., cloud server, edge server, and end devices. This survey paper focuses primarily on the fifth level of EI, called all in-edge level, where DL training and inference (deployment) are performed solely by edge servers. All in-edge is suitable when the end devices have low computing resources, e.g., Internet-of-Things, and other requirements such as latency and communication cost are important such as in mission-critical applications (e.g., health care). Besides, 5G/6G networks are envisioned to use all in-edge. Firstly, this paper presents all in-edge computing architectures, including centralized, decentralized, and distributed. Secondly, this paper presents enabling technologies, such as model parallelism, data parallelism, and split learning, which facilitates DL training and deployment at edge servers. Thirdly, model adaptation techniques based on model compression and conditional computation are described because the standard cloud-based DL deployment cannot be directly applied to all in-edge due to its limited computational resources. Fourthly, this paper discusses eleven key performance metrics to evaluate the performance of DL at all in-edge efficiently. Finally, several open research challenges in the area of all in-edge are presented.", "venue": "IEEE Access", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-04-07", "journal": {"name": "IEEE Access", "pages": "3431-3460", "volume": "11"}, "authors": [{"authorId": "2196055", "name": "Praveen Joshi"}, {"authorId": "144231505", "name": "Mohammed Hasanuzzaman"}, {"authorId": "145890639", "name": "Chandra Thapa"}, {"authorId": "2052279617", "name": "Haithem Afli"}, {"authorId": "145372809", "name": "T. Scully"}], "citations": [{"paperId": "bc8a557c950e2bbc35d5c58641bc975fbec93021", "title": "Edge AI for Internet of Medical Things: A literature review"}, {"paperId": "1d10aa5e7122d1df6d559999987c76de3a088f62", "title": "Training Machine Learning models at the Edge: A Survey"}, {"paperId": "d5df1f9ce7e89e083fc6a0d71cf778767b538e51", "title": "Enhancing Traffic Management with Embedded Machine Learning for Vehicle Detection"}, {"paperId": "2526f623637b21af951d145473a40e90bb87a275", "title": "Deep Learning in the Ubiquitous Human–Computer Interactive 6G Era: Applications, Principles and Prospects"}, {"paperId": "c167677b38490e58f313c96204b23dee091f4381", "title": "Edge Learning for 6G-Enabled Internet of Things: A Comprehensive Survey of Vulnerabilities, Datasets, and Defenses"}, {"paperId": "ff97adbdf7ba45c08c6abe277aba04b41e85e5b0", "title": "Evaluation of artificial intelligence techniques in disease diagnosis and prediction"}, {"paperId": "95f8814313072adce4cbaa5176195dbeee06d935", "title": "Toward Improving Ensemble-Based Collaborative Inference at the Edge"}]}
