{"paperId": "c9e4af8b55db19f9bc9359806ca9283053366fe5", "publicationVenue": null, "title": "Improving the Robustness of Large Language Models via Consistency Alignment", "abstract": "Large language models (LLMs) have shown tremendous success in following user instructions and generating helpful responses. Nevertheless, their robustness is still far from optimal, as they may generate significantly inconsistent responses due to minor changes in the verbalized instructions. Recent literature has explored this inconsistency issue, highlighting the importance of continued improvement in the robustness of response generation. However, systematic analysis and solutions are still lacking. In this paper, we quantitatively define the inconsistency problem and propose a two-stage training framework consisting of instruction-augmented supervised fine-tuning and consistency alignment training. The first stage helps a model generalize on following instructions via similar instruction augmentations. In the second stage, we improve the diversity and help the model understand which responses are more aligned with human expectations by differentiating subtle differences in similar responses. The training process is accomplished by self-rewards inferred from the trained model at the first stage without referring to external human preference resources. We conduct extensive experiments on recent publicly available LLMs on instruction-following tasks and demonstrate the effectiveness of our training framework.", "venue": "", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2024-03-21", "journal": null, "authors": [{"authorId": "2292397279", "name": "Zhao Yukun"}, {"authorId": "1387839383", "name": "Lingyong Yan"}, {"authorId": "2153198380", "name": "Weiwei Sun"}, {"authorId": "2262217921", "name": "Guoliang Xing"}, {"authorId": "2237948548", "name": "Shuaiqiang Wang"}, {"authorId": "2292406246", "name": "Meng Chong"}, {"authorId": "2788612", "name": "Zhicong Cheng"}, {"authorId": "2261862546", "name": "Zhaochun Ren"}, {"authorId": "2292401543", "name": "Yin Dawei"}], "citations": [{"paperId": "4d4092fe29c8798db2cdc25fa86c192ea3998db3", "title": "Language Models as Critical Thinking Tools: A Case Study of Philosophers"}]}
