{"paperId": "c9f04a197c4b31c1479830a306f3365438d5402d", "publicationVenue": {"id": "20a3a2f3-532a-4f04-9f3d-1e268e100872", "name": "International Journal of Advanced Computer Science and Applications", "type": "journal", "alternate_names": ["Int J Adv Comput Sci Appl"], "issn": "2156-5570", "url": "http://sites.google.com/site/ijacsa2010/", "alternate_urls": ["http://thesai.org/Publication/Default.aspx", "https://thesai.org/Publications/IJACSA"]}, "title": "HEMClust: An Improved Fraud Detection Model for Health Insurance using Heterogeneous Ensemble and K-prototype Clustering", "abstract": "—Health insurance plays an integral part of society's economic well-being; the existence of fraud creates innumerable challenges in providing affordable health care support for the people. In order to reduce the losses incurred due to fraud, there is a need for a powerful model to predict fraud on the data accurately. The purpose of the paper is to implement a more sophisticated technique for fraud detection using machine learning: HEM Clust (Heterogeneous Ensemble Model with Clustering). The first phase of the model aims in improving the quality of claims data by providing effective preprocessing. The second stage addresses the overlapping instances in provider specialties by grouping them using k-prototype clustering. The final stage includes building the model using a heterogeneous stacking ensemble that performs classification on multiple levels, with four base learners in level 0 and a meta learner in level 1. The results were assessed using evaluation metrics and statistical tests such as Friedman and Nememyi to compare the performance of base classifiers against the proposed HEM Clust . The empirical results show that the HEM Clust produced 94% and 96% overall precision-recall rates on the dataset, which was an increase of 45% to 50% in the fraud detection rate for each class in the data.", "venue": "International Journal of Advanced Computer Science and Applications", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": {"name": "International Journal of Advanced Computer Science and Applications"}, "authors": [{"authorId": "2134764632", "name": "Shamitha S Kotekani"}, {"authorId": "2757904", "name": "V. Ilango"}], "citations": [{"paperId": "c1be5677b561fbe62fcef62a42f28ded0a8229bd", "title": "Multi-spatial-scale land/use land cover influences on seasonally dominant water quality along Middle Ganga Basin"}, {"paperId": "8bc9394045bc5acc39814a7b82de55960274e3c8", "title": "A Review of Fraudulent Practices in Healthcare Insurance and Machine Learning-Based Investigation Approaches"}]}
