{"paperId": "c9f749be5327c3515520aa177d6a6599a7ac0879", "publicationVenue": null, "title": "Zenix: Efficient Execution of Bulky Serverless Applications", "abstract": "Serverless computing, commonly offered as Function-as-a-Service, was initially designed for small, lean applications. However, there has been an increasing desire to run larger, more complex applications (what we call bulky applications) in a serverless manner. Existing strategies for enabling such applications are to either increase function sizes or to rewrite applications as DAGs of functions. These approaches cause significant resource wastage, manual efforts, and/or performance overhead. We argue that the root cause of these issues is today's function-centric serverless model, where a function is the resource allocation and scaling unit. We propose a new, resource-centric serverless-computing model for executing bulky applications in a resource- and performance-efficient way, and we build the Zenix serverless platform following this model. Our results show that Zenix reduces resource consumption by up to 90% compared to today's function-centric serverless systems, while improving performance by up to 64%.", "venue": "", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2022-06-27", "journal": null, "authors": [{"authorId": "2116391286", "name": "Zhiyuan Guo"}, {"authorId": "51170039", "name": "Zachary Blanco"}, {"authorId": "2909388", "name": "Mohammad Shahrad"}, {"authorId": "74818938", "name": "Zeru Wei"}, {"authorId": "2057587374", "name": "Bili Dong"}, {"authorId": "2173718976", "name": "Jinmou Li"}, {"authorId": "2173752567", "name": "Ishaan Pota"}, {"authorId": "70180182", "name": "Harry Xu"}, {"authorId": "2108361757", "name": "Yiying Zhang"}], "citations": [{"paperId": "692f333b2239a4321b629f2186e99e57ca241e21", "title": "Reinvent Cloud Software Stacks for Resource Disaggregation"}, {"paperId": "b5c94a853815421d7a2143818b330da3e880170f", "title": "Invited Paper: Disaggregating Applications Using Uniservices"}]}
