{"paperId": "c9fd6ad9bdaa4430df6c7feab34bdbc88715ac30", "publicationVenue": null, "title": "Characterizing and exploiting heterogeneity for enhancing energy-efficiency of cloud datacenters", "abstract": "Cloud Computing environments are composed of large and powerconsuming datacenters designed to support the elasticity required by their customers. The adoption of Cloud Computing is rapidly growing since it promises cost reductions for customers in comparison with permanent \ninvestments in traditional datacenters. However, for Cloud providers, energy consumption represents a serious problem since they have to deal with the increasing demand and diverse Quality of Service requirements. \nContemporary energy-efficient Cloud approaches exploit the advantages of virtualization to maximize the use of physical resources and minimize the number of active servers. \nA major problem not considered by current Cloud resource management schemes is that of the inherent heterogeneity of customer, workload and server types in multi-tenant environments. This is an issue when improving energy-efficiency, as co-location of specific workload types may result in strong contention for the physical resources. This then affects the resource consumption patterns and therefore the energy-efficiency of virtualized servers. In addition, because of the on-demand self-service characteristic of the Cloud model, different types of customers tend to highly overestimate the amount of required resources. This creates a non-negligible amount of \nunderutilized servers that affects the energy-efficiency of the datacenter. \nThis thesis analyzes a production Cloud environment to determine the characteristics of the heterogeneous customer, workload and server types, and proposes a novel way to exploit such heterogeneity in order to improve \nenergy-efficiency through two mechanisms. The first improves energyefficiency by co-locating diverse workload types according to the minimum level of produced interference in a heterogeneous pool of servers. The \nsecond mitigates the waste generated by customer overestimation by dynamically overallocating resources based on heterogeneous customer profiles and the levels of produced interference. The evaluation of the proposed mechanisms demonstrates that considering the heterogeneity of elements in a Cloud environment supports the effective improvement of the datacenter energy-efficiency and the performance of individual workloads.", "venue": "", "year": 2014, "fieldsOfStudy": ["Computer Science", "Engineering"], "publicationTypes": null, "publicationDate": "2014-03-01", "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "3225596", "name": "Ismael Solís Moreno"}], "citations": []}
