{"paperId": "ca213ee7cf5c5a1785b14a60b5615bf46f6ddbfb", "publicationVenue": {"id": "6d8252ed-a63f-4088-8d87-ebdf77ed8f18", "name": "IEEE International Workshop on Factory Communication Systems", "type": "conference", "alternate_names": ["Int Workshop Fact Commun Syst", "IEEE Int Workshop Fact Commun Syst", "WFCS", "International Workshop on Factory Communication Systems"]}, "title": "An enhanced behavioral fingerprinting approach for the Internet of Things", "abstract": "With the growing diffusion of the Internet of Things (IoT) technology across most of the aspects of people daily lives, security concerns have become critical to ensure the exploitation of advantages introduced by this technology. This is even more true in the context of Industry 4.0, for which the IoT is becoming an important driver for automation. The detection of anomalies in IoT systems to ensure the capability of such systems to tolerate attacks to single devices is a crucial aspect. Behavioral fingerprinting is a recent and promising security solution in this context, which still requires research efforts to embrace new challenges in such a complex environment. Existing solutions focus mostly on modeling the behavior of IoT devices by analyzing the information extracted from the header of exchanged networking packets. However, in many application contexts, also attacks on the content of the packets can lead to disruptive results. Our proposal focus on these approaches by addressing a fully distributed scenario in which computation is directly handled by IoT devices, also through delegation, and describes a novel behavioral fingerprinting approach based on features suitably engineered from packet payloads. The effective-ness of our proposed method is assessed by both simulated and experimental results.", "venue": "IEEE International Workshop on Factory Communication Systems", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-04-27", "journal": {"name": "2022 IEEE 18th International Conference on Factory Communication Systems (WFCS)", "pages": "1-8"}, "authors": [{"authorId": "2166500792", "name": "Alberico Aramini"}, {"authorId": "2166504589", "name": "Marco Arazzi"}, {"authorId": "1738648", "name": "T. Facchinetti"}, {"authorId": "2166504927", "name": "L. S. Q. Ngankem"}, {"authorId": "1840213", "name": "Antonino Nocera"}], "citations": [{"paperId": "ce6435499a79768109d6a35168eb2cccd8c91c42", "title": "The SemIoE Ontology: A Semantic Model Solution for an IoE-based Industry"}, {"paperId": "b7f9a382e9bf3d7f83d4fd4b470c3f2ebebaf72a", "title": "A Novel IoT Trust Model Leveraging Fully Distributed Behavioral Fingerprinting and Secure Delegation"}, {"paperId": "d599cc8e7e193a3c389ace143bff404ca7cb642f", "title": "Device Fingerprinting for Cyber-Physical Systems: A Survey"}]}
