{"paperId": "ca2a9387b7cbafa90b30d55d6031847e166c112a", "publicationVenue": {"id": "d2eb82d8-92f8-4d9e-8cda-386484ac5fcd", "name": "Brazilian Symposium on Multimedia and the Web", "type": "conference", "alternate_names": ["Braz Symp Multimedia Web", "WebMedia"]}, "title": "Efficient Map-Matching Parallelization over Bus Trajectories Using Spark", "abstract": "Recently releases of the Global Positioning System (GPS) trajectories of public bus fleets provided by large cities around the world have given researchers and practitioners the opportunity to explore new challenges regarding the existing public transportation analytic problems involving such cities. One of these new challenges is the identification of bus trajectories referenced by multiple predefined bus routes. This challenge becomes even more complicated when it involves a Big Data scenario, in which managing large volumes of data can exceed the capacity of traditional data processing systems, which demands parallel approaches capable of streamlining this data-intensive task. In this paper, we propose S-BULMA, an efficient parallel map-matching approach for solving this data-intensive problem. Our approach considers the context aspects of the trajectories performed by a bus, such as the analysis of trips performed along one day, to improve the classification of the predefined route that the bus is following. The evaluation results based on real-world open data sources show that S-BULMA outperforms an adapted technique (BoR-tech) based on the Bag-of-Roads strategy, in terms of map-matching effectiveness, and presents efficient parallel processing.", "venue": "Brazilian Symposium on Multimedia and the Web", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2023-10-23", "journal": {"name": "Proceedings of the 29th Brazilian Symposium on Multimedia and the Web"}, "authors": [{"authorId": "1726468", "name": "Demetrio Gomes Mestre"}, {"authorId": "3480033", "name": "T. Nóbrega"}, {"authorId": "2248408206", "name": "Tiago Brasileiro AraúJo"}, {"authorId": "40048894", "name": "Andreza Raquel Queiroz"}, {"authorId": "38084285", "name": "Veruska Borges Santos"}, {"authorId": "2170212395", "name": "Carlos Eduardo Santos Pires"}], "citations": []}
