{"paperId": "ca2f5a4599c978a6cb6bc3242faf0037d0d981fc", "publicationVenue": null, "title": "Effects of Generative Chatbots in Higher Education", "abstract": "Learning technologies often do not meet the university requirements for learner engagement via interactivity and real-time feedback. In addition to the challenge of providing personalized learning experiences for students, these technologies can increase the workload of instructors due to the maintenance and updates required to keep the courses up-to-date. Intelligent chatbots based on generative artificial intelligence (AI) technology can help overcome these disadvantages by transforming pedagogical activities and guiding both students and instructors interactively. In this study, we explore and compare the main characteristics of existing educational chatbots. Then, we propose a new theoretical framework for blended learning with intelligent chatbots integration enabling students to interact online and instructors to create and manage their courses using generative AI tools. The advantages of the proposed framework are as follows: (1) it provides a comprehensive understanding of the transformative potential of AI chatbots in education and facilitates their effective implementation; (2) it offers a holistic methodology to enhance the overall educational experience; and (3) it unifies the applications of intelligent chatbots in teaching–learning activities within universities.", "venue": "Inf.", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-07", "journal": {"name": "Inf.", "pages": "492", "volume": "14"}, "authors": [{"authorId": "145533303", "name": "Galina Ilieva"}, {"authorId": "144935864", "name": "Tania Yankova"}, {"authorId": "1414035452", "name": "S. Klisarova-Belcheva"}, {"authorId": "2238662518", "name": "Angel Dimitrov"}, {"authorId": "2238756321", "name": "Marin Bratkov"}, {"authorId": "2213896262", "name": "Delian Angelov"}], "citations": [{"paperId": "a98e5aebc43fb21df130ddca6781660feb1bc42e", "title": "Application of GPT Language Models for Innovation in Activities in University Teaching"}, {"paperId": "6a9c796d561995221474615eedb04cee93795446", "title": "Artificial intelligence and the transformation of higher education institutions"}, {"paperId": "6fa3cbf804525725fdcbab7d7e8e8d7aba7bb5f6", "title": "A multinational study on the factors influencing university students’ attitudes and usage of ChatGPT"}, {"paperId": "7023272a79602bb5c54604fa2b977566776d0523", "title": "WormGPT: A Large Language Model Chatbot for Criminals"}, {"paperId": "5c869eb83c035e038503f78c08f8ecde48f4fd93", "title": "Fine-Tuning the Llama2 Large Language Model Using Books on the Diagnosis and Treatment of Musculoskeletal System in Physical Therapy"}, {"paperId": "ab0a2fd22cdcec1716c5651a65f91f542f19d773", "title": "ChatGPT as an aid for pathological diagnosis of cancer."}, {"paperId": "c623b41134955de343a86a3bd24c9c5167d3d0b1", "title": "Semantic Clustering and Transfer Learning in Social Media Texts Authorship Attribution"}]}
