{"paperId": "ca31b8584b6c022ef15ddfe994fe361e002b7729", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "A Comprehensive Overview of Large Language Models", "abstract": "Large Language Models (LLMs) have recently demonstrated remarkable capabilities in natural language processing tasks and beyond. This success of LLMs has led to a large influx of research contributions in this direction. These works encompass diverse topics such as architectural innovations, better training strategies, context length improvements, fine-tuning, multi-modal LLMs, robotics, datasets, benchmarking, efficiency, and more. With the rapid development of techniques and regular breakthroughs in LLM research, it has become considerably challenging to perceive the bigger picture of the advances in this direction. Considering the rapidly emerging plethora of literature on LLMs, it is imperative that the research community is able to benefit from a concise yet comprehensive overview of the recent developments in this field. This article provides an overview of the existing literature on a broad range of LLM-related concepts. Our self-contained comprehensive overview of LLMs discusses relevant background concepts along with covering the advanced topics at the frontier of research in LLMs. This review article is intended to not only provide a systematic survey but also a quick comprehensive reference for the researchers and practitioners to draw insights from extensive informative summaries of the existing works to advance the LLM research.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-07-12", "journal": {"name": "ArXiv", "volume": "abs/2307.06435"}, "authors": [{"authorId": "32749940", "name": "Humza Naveed"}, {"authorId": "2201619569", "name": "Asad Ullah Khan"}, {"authorId": "2055117257", "name": "Shi Qiu"}, {"authorId": "2153464760", "name": "Muhammad Saqib"}, {"authorId": "49053414", "name": "Saeed Anwar"}, {"authorId": "2223436301", "name": "Muhammad Usman"}, {"authorId": "1712576", "name": "Nick Barnes"}, {"authorId": "1747500", "name": "A. Mian"}], "citations": [{"paperId": "50a4cf31beec6ccfac9479e9a0dcf54df4a3159d", "title": "On Future Power Systems Digital Twins: Towards a Standard Architecture"}, {"paperId": "3675186efe9798ca26d4c3ef898bf9199d5c3700", "title": "CoRAST: Towards Foundation Model-Powered Correlated Data Analysis in Resource-Constrained CPS and IoT"}, {"paperId": "f299be3d307cef6f58ad4f321b70b5026368239a", "title": "AI Study Partner : Development of an LLM and Gen AI-Enhanced Study Assistant Tool"}, {"paperId": "28c1f0b7cb0fd1807b1fce982f9883a31eec4c49", "title": "Evaluating Accuracy and Reproducibility of Large Language Model Performance in Pharmacy Education"}, {"paperId": "b3415135ef87d793d753978fb3eb44271526a195", "title": "Integrating Large Language Models for Severity Classification in Traffic Incident Management: A Machine Learning Approach"}, {"paperId": "9cca0ff4ddd8ea65650da5968c800eafec2da5bb", "title": "Review of Generative AI Methods in Cybersecurity"}, {"paperId": "9e04a47c4e1d209f8680ee3c73e53eb79222d83a", "title": "Comparing the Performance of Popular Large Language Models on the National Board of Medical Examiners Sample Questions"}, {"paperId": "10059feb64f17b0b8e037e8f46dbae85b23d63cd", "title": "Minebot: Chatbot to Respond to Text Queries Pertaining to Various Acts, Rules, And Regulations Applicable to Mining Industries"}, {"paperId": "1359b818543bfde35f0966b74612d18ae28ca41f", "title": "On Protecting the Data Privacy of Large Language Models (LLMs): A Survey"}, {"paperId": "81881d2589a34df12d5e2fd192d5354dda1f81a8", "title": "Playing NetHack with LLMs: Potential & Limitations as Zero-Shot Agents"}, {"paperId": "e78188daf9a18840933f3acfc9b3ccfea3db7856", "title": "Wisdom of the Silicon Crowd: LLM Ensemble Prediction Capabilities Rival Human Crowd Accuracy"}, {"paperId": "7ff441587afcd88860971210450cc1df7c772ff6", "title": "Grounding Language Models for Visual Entity Recognition"}, {"paperId": "6e85a29fa543401bb80bb07b89e2ed7d6a22fb74", "title": "Comparison of the Effects of Interaction with Intentional Agent and Artificial Intelligence using fNIRS"}, {"paperId": "fd21fa3b285b85f2d508baf0d5d77db2cd2c60ca", "title": "Take the Bull by the Horns: Hard Sample-Reweighted Continual Training Improves LLM Generalization"}, {"paperId": "16bf4961ee318e354d3fafde456e9520450b9724", "title": "Hallucinations or Attention Misdirection? The Path to Strategic Value Extraction in Business Using Large Language Models"}, {"paperId": "6a4cc1a573e1db5cbc8b1c3feeee193587f708fc", "title": "ModelGPT: Unleashing LLM's Capabilities for Tailored Model Generation"}, {"paperId": "67fc653f060fa2de78d1801f6fcc539f5bcb3308", "title": "Large Language Models \"Ad Referendum\": How Good Are They at Machine Translation in the Legal Domain?"}, {"paperId": "38472e4242e0aa632ed594c3b0ed9c0bd6429c41", "title": "AI-Augmented Predictions: LLM Assistants Improve Human Forecasting Accuracy"}, {"paperId": "ecb1002427e476ec76463e0a8b5a453471a1931f", "title": "The Sound of Healthcare: Improving Medical Transcription ASR Accuracy with Large Language Models"}, {"paperId": "2e8ca21114ecefac88fd2b3a2daacae352b1907f", "title": "Beyond the Limits: A Survey of Techniques to Extend the Context Length in Large Language Models"}, {"paperId": "afee7ed91b83566029db72f5ffbd9c73cb87a9ea", "title": "Large Language Models Based Fuzzing Techniques: A Survey"}, {"paperId": "a66b56be4e521c0510befa5a172629c305de4839", "title": "Contextual Feature Extraction Hierarchies Converge in Large Language Models and the Brain"}, {"paperId": "b4d1da748ba87f38150ad38e30be68f3584ae462", "title": "RAG-Fusion: a New Take on Retrieval-Augmented Generation"}, {"paperId": "71c2333310c13ef59450b33ac398b778bab83fbf", "title": "Research about the Ability of LLM in the Tamper-Detection Area"}, {"paperId": "d7c98899eb281d8f67899bf1959f288627780d3e", "title": "A Framework to Implement 1+N Multi-task Fine-tuning Pattern in LLMs Using the CGC-LORA Algorithm"}, {"paperId": "3500dbcea3de9880b195c6114c6959fcfa9719f7", "title": "Sowing the Wind, Reaping the Whirlwind: The Impact of Editing Language Models"}, {"paperId": "30c20c59a9af0c97f10f7108641c19f0d76c417b", "title": "LLM4PLC: Harnessing Large Language Models for Verifiable Programming of PLCs in Industrial Control Systems"}, {"paperId": "38b417da54f173cf2852bf75dbf5f507a53b4f91", "title": "LLMs for Robotic Object Disambiguation"}, {"paperId": "2653cf21108048bdc9300e7c8daf27461b91f98c", "title": "VoroNav: Voronoi-based Zero-shot Object Navigation with Large Language Model"}, {"paperId": "b137709522bc70b42b026cae192de2a45000b22e", "title": "MetaAID 2.5: A Secure Framework for Developing Metaverse Applications via Large Language Models"}, {"paperId": "27c7d95f448d6135895b5c9ce3d7a56c1e9f60be", "title": "Future-proofing Education: A Prototype for Simulating Oral Examinations Using Large Language Models"}, {"paperId": "c62b0d677dfa38c6ba9c886a926700d22471769c", "title": "In Generative AI we Trust: Can Chatbots Effectively Verify Political Information?"}, {"paperId": "a1abf4d8bad5694621e4d8cd09e41c80cdbba318", "title": "From Google Gemini to OpenAI Q* (Q-Star): A Survey of Reshaping the Generative Artificial Intelligence (AI) Research Landscape"}, {"paperId": "e1242c45b3d2cb7d244cc54de2c84d9c853bf219", "title": "Generative AI: Impactful Considerations to Responsible Data Practices in Business Execution"}, {"paperId": "5ee871537ae51e7e2e93d2a70fff5d100649a655", "title": "Mathematical Language Models: A Survey"}, {"paperId": "7023272a79602bb5c54604fa2b977566776d0523", "title": "WormGPT: A Large Language Model Chatbot for Criminals"}, {"paperId": "caa098989011d7fdfe21ae7a08796cfb5942e64d", "title": "TPPoet: Transformer-Based Persian Poem Generation using Minimal Data and Advanced Decoding Techniques"}, {"paperId": "434471221fa3701e6a318be097eea496aedc5220", "title": "HybridGCN for protein solubility prediction with adaptive weighting of multiple features"}, {"paperId": "4e65a3615cfcce1ecee0c1b4afd470d8bbf1b259", "title": "ASAGeR: Automated Short Answer Grading Regressor via Sentence Simplification"}, {"paperId": "ae3de9d3289ddd2fddf91e42e70f2bb9af06b7d0", "title": "Clinical Risk Prediction Using Language Models: Benefits And Considerations"}, {"paperId": "fb5a1a764c3fe0c12b82bcb2f9667dc7c7d8c4d8", "title": "LALM: Long-Term Action Anticipation with Language Models"}, {"paperId": "9422cb43cc7b8eff12c73b483f489edb035d7bd4", "title": "Current State of Document Ingestion and Understanding"}, {"paperId": "438330e94a6672453e9d44a94a177d8c06537420", "title": "Phenotype-Driven Molecular Genetic Test Recommendation for Diagnosing Pediatric Rare Disorders"}, {"paperId": "bdb4967747fa34c639ed03535021cca2b2073443", "title": "Language Generation from Brain Recordings"}, {"paperId": "87089dd53f6279b0c348b78d7cc19989349b48e7", "title": "GRASP: A novel benchmark for evaluating language GRounding And Situated Physics understanding in multimodal language models"}, {"paperId": "e33e672fd04c2367a45b3271b36aac829451a468", "title": "Hallucination-minimized Data-to-answer Framework for Financial Decision-makers"}, {"paperId": "f99c1779bc2f85a16e50b336a7200eb19ada24bf", "title": "M3: Towards Efficient Mixed Machine Learning Model Co-Location on Constrained Edge Devices"}, {"paperId": "14e74507886649df8d9454b4d1005b034ae337d4", "title": "Large-scale Foundation Models and Generative AI for BigData Neuroscience"}, {"paperId": "5a23700c5198e44a05336f7a2e7a7d7d183ad625", "title": "Large Language Model Prediction Capabilities: Evidence from a Real-World Forecasting Tournament"}, {"paperId": "3856fce2fca56e2d7be0134889bf6f9d2f01b931", "title": "Advancing Perception in Artificial Intelligence through Principles of Cognitive Science"}, {"paperId": "a2eeafe8fbec66d66c368fc535604e768286cec7", "title": "SCAR: Power Side-Channel Analysis at RTL-Level"}, {"paperId": "6d828a7aace632477c5d89c1d4e2182645030b85", "title": "Balancing Autonomy and Alignment: A Multi-Dimensional Taxonomy for Autonomous LLM-powered Multi-Agent Architectures"}, {"paperId": "a55aba1cb624527fb7d38dc1f1f94865c0aa790c", "title": "Source of data for artificial intelligence applications in vascular surgery - a scoping review."}, {"paperId": "43467273b76e7f9d70b5af7e294d51be1c0aae3f", "title": "Automating Information Retrieval from Faculty Guidelines: Designing a PDF-Driven Chatbot powered by OpenAI ChatGPT"}, {"paperId": "ec0ca7eb1f365a8ee74247b9724e190651483706", "title": "Chatmap : Large Language Model Interaction with Cartographic Data"}, {"paperId": "f69ccfc10945a966aa3d654c7ee31be82719c7a6", "title": "People's Perceptions Toward Bias and Related Concepts in Large Language Models: A Systematic Review"}, {"paperId": "6f75e8b61f13562237851d8119cb2f9d49e073fb", "title": "Can LLM-Generated Misinformation Be Detected?"}, {"paperId": "80dd123ad9210878ea1fdf00a62c1419fb12072e", "title": "The Future of Natural History Transcription: Navigating AI advancements with VoucherVision and the Specimen Label Transcription Project (SLTP)"}, {"paperId": "071181dca0f67d557e997fa9eba727ef0d702acf", "title": "Language-based Action Concept Spaces Improve Video Self-Supervised Learning"}, {"paperId": "c3a93db8a287349c8ea2b4790cf82aca94248b17", "title": "Unleashing the Power of NLP Models for Semantic Consistency Checking of Automation Rules"}, {"paperId": "2ee8a746f56291eb1481dd37c6017656fa8752ba", "title": "ChatGPT in Occupational Medicine: A Comparative Study with Human Experts"}, {"paperId": "5d4a6ce39cfe7bfc6305cba86464efff8bc20c97", "title": "A Review on Large Language Models: Architectures, Applications, Taxonomies, Open Issues and Challenges"}, {"paperId": "f18cf5deb74f92b5a262158466d3d79360ae9374", "title": "Exploring Sentence Parsing: OpenAI API-Based and Hybrid Parser-Based Approaches"}, {"paperId": "1f08ee3cc87623e47898ef3dba6076bf5398ed37", "title": "A Comparative Study of ChatGPT-based and Hybrid Parser-based Sentence Parsing Methods for Semantic Graph-based Induction"}, {"paperId": "2c62cbeafb8b97959987030bad9bc23205c622e2", "title": "Deep Representation Learning: Fundamentals, Technologies, Applications, and Open Challenges"}, {"paperId": "50403803e2c56cb27310a6e294274c9be89ec77c", "title": "Language Generation from Human Brain Activities"}, {"paperId": "e7b7ba8689cd200083ac07c66e1898d71aff46b1", "title": "Large Language Model Assisted Software Engineering: Prospects, Challenges, and a Case Study"}, {"paperId": "13f2a6afb18d26ee7a45257b66fcc154d610d9ea", "title": "An Ensemble Based Approach To Detecting LLM-Generated Texts"}, {"paperId": "24de1048791bac4972ecc16d1c3c1de23691407d", "title": "Large Language Models: A Comprehensive Survey of its Applications, Challenges, Limitations, and Future Prospects"}, {"paperId": "3339e839fed5be63a5254be0d6d139024e204c30", "title": "How Do Large Language Models (LLMs) Impact Document Image Analysis? An Open Discussion."}, {"paperId": "da04d904a9e94fd5ad1d2e737a0ab52a16840771", "title": "U NVEILING Z ERO SHOT PREDICTION FOR GENE AT - TRIBUTES THROUGH INTERPRETABLE AI"}]}
