{"paperId": "ca40146f61c7162c173f77a7ea547099e306619b", "publicationVenue": {"id": "3c811ea1-f097-40ac-93d6-fab0f78702ed", "name": "Interactive Technology and Smart Education", "type": "journal", "alternate_names": ["Interact Technol Smart Educ"], "issn": "1741-5659", "url": "https://www.emerald.com/insight/publication/issn/1741-5659"}, "title": "Adoption of the Internet of Things in higher education: opportunities and challenges", "abstract": "\nPurpose\nThe purpose of this study is to determine the characteristics of the studies in terms of country, participant profile and methodology, as well as to determine what the Internet of Things (IoT) is currently contributing to higher education.\n\n\nDesign/methodology/approach\nThe study was developed following the methodology supported by the Preferred Reporting Items for Systematic Reviews and Meta-Analyses statement and the PICOS strategy, retrieving scientific literature from Web of Science, Scopus, ERIC and Google Scholar. Of the 237 studies that the search yielded, 11 were included.\n\n\nFindings\nThe results showed that among the opportunities offered by IoT is that it not only brings the introduction of information and communication technology into the classroom, but also enhances student interest, thus, improving the quality of teaching in higher education. On the other hand, one of the challenges it faces is the attitude of teachers towards its adoption, as well as the level of digital competence of teachers.\n\n\nOriginality/value\nThis study presents how higher education institutions are including the IoT in their educational activities. The IoT refers to a network of digital interconnectivity between devices, people and the internet itself that enables the exchange of data between them, allowing key information about the use and performance of devices and objects to be captured to detect patterns, make recommendations, improve efficiency and create better user experiences.\n", "venue": "Interactive Technology and Smart Education", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-08-08", "journal": {"name": "Interactive Technology and Smart Education"}, "authors": [{"authorId": "1399682848", "name": "J. Fernández-Batanero"}, {"authorId": "1432762775", "name": "Marta Montenegro-Rueda"}, {"authorId": "1710363302", "name": "José Fernández-Cerero"}, {"authorId": "150987255", "name": "Eloy López Meneses"}], "citations": [{"paperId": "bbe5c16830274dff1b644ef095a450c55c9ea727", "title": "Investigating The Content Validity of An Iot-Acceptance Survey Instrument in Higher Education: A Study in The Context of Sindh, Pakistan"}]}
