{"paperId": "ca5850fc6ef6abba0b3f7d79e309d169a457d2ad", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "\"We won't even challenge their lefty academic definition of racist: \" Understanding the Use of e-Prints on Reddit and 4chan", "abstract": "The dissemination and the reach of scientiﬁc knowledge have increased at a blistering pace. In this context, e-print servers have played a central role by providing scientists with a rapid and open mechanism for disseminating research without having to wait for the (lengthy) peer-review process. While helping the scientiﬁc community in several ways, e-print servers also provide scientiﬁc communicators and the general public with access to a wealth of knowledge without having to pay hefty subscription fees. Arguably, e-print servers’ value has never been so evident, for better or worse, as during the COVID-19 pandemic. This motivates us to study how e-print servers are positioned within the greater Web, and how they are “used” on Web communities. Using data from Reddit (2005–2021) and 4chan’s Politically Incorrect board (2016–2021), we uncover a surprisingly diverse set of communities discussing e-print papers. We ﬁnd that real-world events and distinct factors inﬂuence the e-prints people are talking about. For instance, there was a sudden increase in the discussion of e-prints, corresponding to a surge in COVID-19 related research, in the ﬁrst phase of the pandemic. We ﬁnd a substantial difference in the conversation around e-prints and their actual content; in fact, e-prints are often being exploited to further conspiracy theories and/or ex-tremist ideology. Overall, our work further highlights the need to quickly and effectively validate non peer-reviewed e-prints that get substantial press/social media coverage, as well as mitigate wrongful interpretations of scientiﬁc outputs.", "venue": "arXiv.org", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "ArXiv", "volume": "abs/2111.02455"}, "authors": [{"authorId": "9186315", "name": "S. Yudhoatmojo"}, {"authorId": "2064581974", "name": "Emiliano De Cristofaro"}, {"authorId": "144728530", "name": "Jeremy Blackburn"}], "citations": [{"paperId": "d522066c01abebddf3c09c6afc344f5f54a3b6cb", "title": "Engage Wider Audience or Facilitate Quality Answers? a Mixed-methods Analysis of Questioning Strategies for Research Sensemaking on a Community Q&A Site"}]}
