{"paperId": "ca6428ceff99f7df0bcf67c91f588c2a3ee8f12a", "publicationVenue": {"id": "e07422f9-c065-40c3-a37b-75e98dce79fe", "name": "The Web Conference", "type": "conference", "alternate_names": ["Web Conf", "WWW"], "url": "http://www.iw3c2.org/"}, "title": "LBCF: A Large-Scale Budget-Constrained Causal Forest Algorithm", "abstract": "Offering incentives (e.g., coupons at Amazon, discounts at Uber and video bonuses at Tiktok) to user is a common strategy used by online platforms to increase user engagement and platform revenue. Despite its proven effectiveness, these marketing incentives incur an inevitable cost and might result in a low ROI (Return on Investment) if not used properly. On the other hand, different users respond differently to these incentives, for instance, some users never buy certain products without coupons, while others do anyway. Thus, how to select the right amount of incentives (i.e. treatment) to each user under budget constraints is an important research problem with great practical implications. In this paper, we call such problem as a budget-constrained treatment selection (BTS) problem. The challenge is how to efficiently solve BTS problem on a Large-Scale dataset and achieve improved results over the existing techniques. We propose a novel tree-based treatment selection technique under budget constraints, called Large-Scale Budget-Constrained Causal Forest (LBCF) algorithm, which is also an efficient treatment selection algorithm suitable for modern distributed computing systems. A novel offline evaluation method is also proposed to overcome an intrinsic challenge in assessing solutions’ performance for BTS problem in randomized control trials (RCT) data. We deploy our approach in a real-world scenario on a large-scale video platform, where the platform gives away bonuses in order to increase users’ campaign engagement duration. The simulation analysis, offline and online experiments all show that our method outperforms various tree-based state-of-the-art baselines 1. The proposed approach is currently serving over hundreds of millions of users on the platform and achieves one of the most tremendous improvements over these months.", "venue": "The Web Conference", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2022-01-29", "journal": {"name": "Proceedings of the ACM Web Conference 2022"}, "authors": [{"authorId": "2151908660", "name": "Meng Ai"}, {"authorId": "2156072391", "name": "Biao Li"}, {"authorId": "2107060884", "name": "Heyang Gong"}, {"authorId": "50543777", "name": "Qingwei Yu"}, {"authorId": "1946176", "name": "S. Xue"}, {"authorId": null, "name": "Yuan Zhang"}, {"authorId": "2156014948", "name": "Yunzhou Zhang"}, {"authorId": "2061280682", "name": "Peng Jiang"}], "citations": [{"paperId": "3f2d4b006cab8853c098b21fc8f69ee2c0c9e180", "title": "Answering Causal Queries at Layer 3 with DiscoSCMs-Embracing Heterogeneity"}, {"paperId": "772a2afc683b74b8aafa4dce49d902019c5208fb", "title": "A Multi-stage Framework for Online Bonus Allocation Based on Constrained User Intent Detection"}, {"paperId": "54101015ed95794ee3cb4dc0bd8df71ab4891910", "title": "Incremental Profit per Conversion: a Response Transformation for Uplift Modeling in E-Commerce Promotions"}, {"paperId": "9dfe11fafe81ced965c0c0c3c3f8ade6fd88d1f9", "title": "Explicit Feature Interaction-aware Uplift Network for Online Marketing"}, {"paperId": "9a4cf2645a3f5b853c8be12f9f15b72cde9d4b13", "title": "An End-to-End Framework for Marketing Effectiveness Optimization under Budget Constraint"}, {"paperId": "f1ca2cce6c8e53488983a89bccfe34c976202f7b", "title": "Direct Heterogeneous Causal Learning for Resource Allocation Problems in Marketing"}, {"paperId": "69b2fa0adb990e433d361ca78a112a35a0caffca", "title": "E-Commerce Promotions Personalization via Online Multiple-Choice Knapsack with Uplift Modeling"}]}
