{"paperId": "ca8e1a04d72a1e2b521009700266dcf246d90d43", "publicationVenue": {"id": "ef00f0de-a7e5-443a-9a2d-c78502a4b598", "name": "Conference on Computer Science and Information Systems", "type": "conference", "alternate_names": ["Fed Conf Comput Sci Inf Syst", "Conf Comput Sci Inf Syst", "FedCSIS", "Federated Conference on Computer Science and Information Systems"], "url": "https://fedcsis.org/"}, "title": "Techno-economic framework for cloud infrastructure: A cost study of resource disaggregation", "abstract": "The rapid growth of data and high-dependency of industries on using data put lots of focus on the computing facilities. Increasing the efficiency and re-architecting the underlying infrastructure of datacenters, has become a major priority. The total cost of owning and running a datacenter (DC) is affected by many parameters, which until recently were ignored as their impact on the business economy was negligible. However, that is not the case anymore, as in the new era of digital economy every penny counts. The market is too aggressive to ignore anything. Hence, the economic efficiency becomes vital for cloud infrastructure providers despite their size. This article presents a framework to assess cloud infrastructure economic efficiency, taking into account three main aspects: application profiling, hardware dimensioning and total cost of ownership (TCO). Moreover, it presents a cost study of deploying the emerging concept of disaggregated hardware architecture in DCs based on the proposed framework. The study considers all the major cost categories incurred during the DC lifetime in terms of both capital and operational expenditures. A thorough cost comparison between a DC running on a disaggregated hardware architecture with one running on a traditional server-based hardware architecture is presented. The study demonstrates the evolution of the yearly cost over DC lifetime as well as a sensitivity analysis, allowing to understand how to minimize the cost of running cloud. Results show that, lifecycle management cost is one of the main differentiators between two technologies. Moreover, it is shown that in the presence of heterogeneous workloads, having a DC based on a fully disaggregated hardware brings high savings (more than 40% depending on the applications) compared to the traditional hardware architectures independent of the hardware set-up.", "venue": "Conference on Computer Science and Information Systems", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2017-09-24", "journal": {"name": "2017 Federated Conference on Computer Science and Information Systems (FedCSIS)", "pages": "733-742"}, "authors": [{"authorId": "2903264", "name": "M. Mahloo"}, {"authorId": "145730833", "name": "J. Soares"}, {"authorId": "2589369", "name": "Amir Roozbeh"}], "citations": [{"paperId": "13dde297b453ec0967e2d1664edbc3dfe65a8ff8", "title": "Memory Demands in Disaggregated HPC: How Accurate Do We Need to Be?"}, {"paperId": "f477be9027090b9ce05750300409077bba1b5796", "title": "Adaptive Signaling Control Method for Efficient Resource Utilization of Mobile Core Network Nodes"}, {"paperId": "acaae598c7d8824eb5fd233bae89cad4620337e0", "title": "Estimating the Cost of Implementing Virtual Desktops as a Stage of Project Management in the Field of Cloud Technologies"}, {"paperId": "542cc06e3b522163d1a8aed8d5769e94cb6456ce", "title": "Software-Defined “Hardware” Infrastructures: A Survey on Enabling Technologies and Open Research Directions"}, {"paperId": "a25f9392589635f1f85fc9faf071b20434172220", "title": "Remote Direct Memory Access as Communication Tier for Disaggregated Database Systems"}]}
