{"paperId": "ca91c3ac6805ab7f6a9fc50c3defc34fa40941e5", "publicationVenue": {"id": "6dd05db1-df4c-4237-bcc7-46e0d2cc7266", "name": "International Conference on Parallel and Distributed Computing: Applications and Technologies", "type": "conference", "alternate_names": ["Parallel Distrib Comput Appl Technol", "Int Conf Parallel Distrib Comput Appl Technol", "PDCAT", "Parallel and Distributed Computing: Applications and Technologies"]}, "title": "An Optimization Algorithm for Heterogeneous Hadoop Clusters Based on Dynamic Load Balancing", "abstract": "Hadoop is a popular cloud computing software, and its major component MapReduce can efficiently complete parallel computing in homogeneous environment. But in practical application heterogeneous cluster is a common phenomenon. In this case, it's prone to unbalance load. To solve this problem, a model of heterogeneous Hadoop cluster based on dynamic load balancing is proposed in this paper. This model starts from MapReduce and tracks node information in real time by using its monitoring module. A maximum node hit rate priority algorithm (MNHRPA) is designed and implemented in the paper, and it can achieve load balancing by dynamic adjustment of data allocation based on nodes' computing power and load. The experimental results show that the algorithm can effectively reduce tasks' completion time and achieve load balancing of the cluster compared with Hadoop's default algorithm.", "venue": "International Conference on Parallel and Distributed Computing: Applications and Technologies", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2016-12-01", "journal": {"name": "2016 17th International Conference on Parallel and Distributed Computing, Applications and Technologies (PDCAT)", "pages": "250-255"}, "authors": [{"authorId": "2117115463", "name": "Wei Yan"}, {"authorId": "50599276", "name": "Chunlin Li"}, {"authorId": "17317026", "name": "Shumeng Du"}, {"authorId": "17338872", "name": "XiJun Mao"}], "citations": [{"paperId": "1d722dbefdb1d6063b2cd21bc1400709430f7fac", "title": "A performance modeling-based HADOOP configuration tuning strategy"}, {"paperId": "6972a236d2d37b6981047207cb599302719c92a1", "title": "Load Balancing Approach for a MapReduce Job Running on a Heterogeneous Hadoop Cluster"}, {"paperId": "85e99240d85666939f0f6f8d21036d10bf617616", "title": "Design and Implementation of University SMS Platform Based on .NET"}, {"paperId": "f2f7fa029b3828cd08e680046f75acbc05f49318", "title": "BDWatchdog: Real-time monitoring and profiling of Big Data applications and frameworks"}, {"paperId": "c1472b9910344295084b20cd11fcfaa51da1668d", "title": "On a Dynamic Data Placement Strategy for Heterogeneous Hadoop Clusters"}, {"paperId": "55d970958b4df64b7ecda9dc7ba93eeeed677767", "title": "A Load-Aware Data Migration Scheme for Distributed Surveillance Video Processing with Hybrid Storage Architecture"}, {"paperId": "5a2013a54700491bb229cda3d11baec2b3fe186d", "title": "A service relevance based virtual machine migration strategy in cloud"}, {"paperId": "a890950d267a8bb97ea8262dd30e1842bc3438cd", "title": "Critical literature review on straggler node"}]}
