{"paperId": "ca9a136b9fc0cb63a5a634eca1ff90392ad79987", "publicationVenue": {"id": "3f7605a7-7e53-4ff7-8895-42f09a5f4355", "name": "Frontiers in Immunology", "type": "journal", "alternate_names": ["Front Immunol"], "issn": "1664-3224", "url": "http://www.frontiersin.org/immunology", "alternate_urls": ["https://www.frontiersin.org/journals/immunology", "http://journal.frontiersin.org/journal/immunology"]}, "title": "Multi-omics analysis reveals interferon-stimulated gene OAS1 as a prognostic and immunological biomarker in pan-cancer", "abstract": "Introduction OAS1(2’-5’-oligoadenylate synthetase 1) is a member of the Interferon-Stimulated Genes which plays an important role in the antiviral process. In recent years, the role of OAS1 in tumors has attracted attention, and it was found to be associated with prognosis in several tumors. However, the mechanism by which OAS1 affects tumors is unclear and pan-cancer study of OAS1 is necessary to better understand its implication in cancers. Methods The expression, prognostic value, genetic alteration, alternative splicing events of OAS1 in pan-cancers were analyzed using TCGA, GTEx, HPA, GEPIA and OncoSplicing databases. OAS1 associated immune cell infiltration was evaluated using the ESTIMATE, xCell, CIBERSORT and QUANTISEQ algorithm. Single cell transcriptome data download using TISH database. Finally, the roles of the OAS1 on apoptosis, migration and invasion were investigated in two pancreatic cancer cells. Results Our results revealed significant differences in OAS1 expression among various tumors, which had prognostic implications. In addition, we investigated the impact of OAS1 on genomic stability, methylation status, and other factors across different types of cancer, and the effects of these factors on prognosis. Notably, our study also demonstrated that OAS1 overexpression can contribute to CTL dysfunction and macrophage M2 polarization. In addition, cell experiments showed that the knockdown of OAS1 could reduce the invasive ability and increased the apoptosis rate of PAAD cells. Discussion These results confirmed that OAS1 could be a prognostic biomarker and therapeutic target for its potential role in CTL dysfunction and macrophage M2 polarization.", "venue": "Frontiers in Immunology", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-10-20", "journal": {"name": "Frontiers in Immunology", "volume": "14"}, "authors": [{"authorId": "2261006743", "name": "Runyu Yang"}, {"authorId": "2261075601", "name": "Yue Du"}, {"authorId": "2261254098", "name": "Mengyao Zhang"}, {"authorId": "2261247009", "name": "Yi Liu"}, {"authorId": "2260915219", "name": "Hui Feng"}, {"authorId": "2260930641", "name": "Ruimin Liu"}, {"authorId": "2261685582", "name": "Bingyu Yang"}, {"authorId": "2261121160", "name": "Jiayi Xiao"}, {"authorId": "2260951198", "name": "Pengcheng He"}, {"authorId": "14488135", "name": "Fan Niu"}], "citations": []}
