{"paperId": "ca9a9268288bc200a3a0ff3db5242bf5b53bf357", "publicationVenue": {"id": "7b2adce0-d53f-49d6-8784-b0645604fe62", "name": "ACM Computing Surveys", "type": "journal", "alternate_names": ["ACM Comput Surv"], "issn": "0360-0300", "url": "http://www.acm.org/pubs/surveys/", "alternate_urls": ["http://portal.acm.org/csur", "https://csur.acm.org/", "http://csur.acm.org/"]}, "title": "A comprehensive review and new taxonomy on superpixel segmentation", "abstract": "Superpixel segmentation consists of partitioning images into regions composed of similar and connected pixels. Its methods have been widely used in many computer vision applications since it allows for reducing the workload, removing redundant information, and preserving regions with meaningful features. Due to the rapid progress in this area, the literature fails to catch up on more recent works among the compared ones and to categorize the methods according to all existing strategies. This work fills this gap by presenting a comprehensive review with a new taxonomy for superpixel segmentation, in which methods are classified according to their processing steps and processing levels of image features. We revisit the recent and popular literature according to our taxonomy and evaluate 23 strategies and a grid segmentation baseline based on nine criteria: connectivity, compactness, delineation, control over the number of superpixels, color homogeneity, robustness, running time, stability, and visual quality. Our experiments show the trends of each approach in superpixel segmentation and discuss individual trade-offs. Finally, we provide a new benchmark for superpixel assessment, available at https://github.com/IMScience-PPGINF-PucMinas/superpixel-benchmark.", "venue": "ACM Computing Surveys", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2024-03-12", "journal": {"name": "ACM Computing Surveys"}, "authors": [{"authorId": "1454593569", "name": "Isabela Borlido Barcelos"}, {"authorId": "73770476", "name": "F. Belém"}, {"authorId": "32447135", "name": "L. Joao"}, {"authorId": "2291291301", "name": "Zenilton K. G. do Patrocínio Jr."}, {"authorId": "2272094494", "name": "Alexandre X. Falcão"}, {"authorId": "2291174382", "name": "S. J. F. Guimarães"}], "citations": []}
