{"paperId": "caa0711cebfc608f5c26d376cbcf2884a61d83c1", "publicationVenue": {"id": "c6840156-ee10-4d78-8832-7f8909811576", "name": "IEEE Transactions on Knowledge and Data Engineering", "type": "journal", "alternate_names": ["IEEE Trans Knowl Data Eng"], "issn": "1041-4347", "url": "https://www.computer.org/web/tkde", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=69"]}, "title": "A Distributed Integrated Feature Selection Scheme for Column Subset Selection", "abstract": "The emergence of computer applications often encounter huge volumes of data which need to be stored and processed in a distributed way. Most of the existing distributed feature selection schemes neglect how good the subsets are that are mapped to the computational nodes, which causes a waste of time and hardware resources. In this paper, we propose a distributed integrated feature selection scheme (DIFS) with Subset Quality Evaluation (SQE). SQE studies the relevance between the quality of a subset and the number of selected features from this subset, which helps shorten the feature selection time efficiently. Feature selection algorithms used in our method and the evaluation metric used in SQE are integrable. Then, we have given the implementation of our scheme for the Column Subset Selection (CSS) problem. More specifically, we integrate a CSS algorithm in DIFS and information entropy as the SQE metric. Theoretically, we prove that the speedup of DIFS can reach <inline-formula><tex-math notation=\"LaTeX\">$m^3$</tex-math><alternatives><mml:math><mml:msup><mml:mi>m</mml:mi><mml:mn>3</mml:mn></mml:msup></mml:math><inline-graphic xlink:href=\"xiao-ieq1-3108146.gif\"/></alternatives></inline-formula> compared to the centralized algorithm in ideal situations where <inline-formula><tex-math notation=\"LaTeX\">$m$</tex-math><alternatives><mml:math><mml:mi>m</mml:mi></mml:math><inline-graphic xlink:href=\"xiao-ieq2-3108146.gif\"/></alternatives></inline-formula> is the number of computational nodes, and give a well bounded approximation guarantee of the solution generated by scheme for CSS problem. Extensive experiments on eight data sets are used to verify the performance of scheme. Experiments results demonstrate the effectiveness of SQE and the impressive speedup DIFS can achieve. Although there is a slight increase of the reconstruction error value in some situations. Additional experiments of classification tasks reveal that the performance of DIFS is better than existing state-of-the-art distributed algorithms.", "venue": "IEEE Transactions on Knowledge and Data Engineering", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-03-01", "journal": {"name": "IEEE Transactions on Knowledge and Data Engineering", "pages": "2193-2205", "volume": "35"}, "authors": [{"authorId": "2152134053", "name": "Zheng Xiao"}, {"authorId": "2142381610", "name": "Pengcheng Wei"}, {"authorId": "1755728", "name": "Anthony T. Chronopoulos"}, {"authorId": "2582138", "name": "A. Elster"}], "citations": [{"paperId": "9e117efe085c522b2b95a7e61deef69486dd6860", "title": "Condition Rating Prediction for Highway Bridge Based on Elman Neural Networks and Markov Chains"}, {"paperId": "4f8f0a524e825d299f8153117dd4a517596dd602", "title": "Feature importance feedback with Deep Q process in ensemble-based metaheuristic feature selection algorithms"}]}
