{"paperId": "caad8ee4378ecf23f64f382e3de8c2cb004cc3f7", "publicationVenue": null, "title": "Multi-GPU-Parallel and Tile-Based Kernel Density Estimation for Large-Scale Spatial Point Pattern Analysis", "abstract": "Kernel density estimation (KDE) is a commonly used method for spatial point pattern analysis, but it is computationally demanding when analyzing large datasets. GPU-based parallel computing has been adopted to address such computational challenges. The existing GPU-parallel KDE method, however, utilizes only one GPU for parallel computing. Additionally, it assumes that the input data can be held in GPU memory all at once for computation, which is unrealistic when conducting KDE analysis over large geographic areas at high resolution. This study develops a multi-GPU-parallel and tile-based KDE algorithm to overcome these limitations. It exploits multiple GPUs to speedup complex KDE computation by distributing computation across GPUs, and approaches density estimation with a tile-based strategy to bypass the memory bottleneck. Experiment results show that the parallel KDE algorithm running on multiple GPUs achieves significant speedups over running on a single GPU, and higher speedups are achieved on KDE tasks of a larger problem size. The tile-based strategy renders it feasible to estimate high-resolution density surfaces over large areas even on GPUs with only limited memory. Multi-GPU parallel computing and tile-based density estimation, while incurring very little computational overhead, effectively enable conducting KDE for large-scale spatial point pattern analysis on geospatial big data.", "venue": "ISPRS Int. J. Geo Inf.", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-01-18", "journal": {"name": "ISPRS Int. J. Geo Inf.", "pages": "31", "volume": "12"}, "authors": [{"authorId": "8274439", "name": "Guiming Zhang"}, {"authorId": "2202733346", "name": "Jin Xu"}], "citations": [{"paperId": "cb5dcd07300a346e85082beda24f53c2b2ff2ceb", "title": "Tracking snares to mitigate the threat to wildlife: Quantification of hunting methods along the fringes of Valmiki Tiger Reserve, India"}, {"paperId": "22da2cb18fad7f299dd4f43f58b4153f0a79585b", "title": "Adopting GPU computing to support DL-based Earth science applications"}, {"paperId": "a5d3771ee1d80b1cff9a774750fbd2a701d0e5df", "title": "Large video processing using GPU programming"}, {"paperId": "d2d39791acd79a6f66e007c7980dfbaebaab5f02", "title": "CUTCI: A GPU-Accelerated Computing Method for the Universal Thermal Climate Index"}]}
