{"paperId": "cab1b85379dcbe5d4369f43b18f322b53d2b9629", "publicationVenue": {"id": "85ac2dda-27ce-4f18-826f-69d0d3fff930", "name": "International Joint Conference on Computer Science and Software Engineering", "type": "conference", "alternate_names": ["JCSSE", "Int Jt Conf Comput Sci Softw Eng"]}, "title": "A performance comparison of Apache Tez and MapReduce with data compression on Hadoop cluster", "abstract": "Big data is a popular topic on cloud computing research. The main characteristics of big data are volume, velocity and variety. These characteristics are difficult to handle by using traditional softwares and methods. Hadoop is open-source framework software which was developed to provide solutions for handling several domains of big data problems. For big data analytic, MapReduce framework is a main engine of Hadoop cluster and widely used nowadays. It uses a batch oriented processing. Apache also developed an alternative engine called “Tez”. It supports an interactive query and does not write temporary data into HDFS. In this paper, we focus on the performance comparison between MapReduce and Tez. We also investigate the performance of these two engines with the compression of input files and map output files. Bzip is a compression algorithm used for input files and snappy is used for map output files. Word-count and terasort benchmarks are used in our experiments. For the word-count benchmark, the results show that Tez engine always has better execution-time than MapReduce engine for both of compressed data or non-compressed data. It can reduce an execution-time up to 39% comparing with the execution time of MapReduce engine. In contrast, the results show that Tez engine usually has higher execution-time than MapReduce engine up to 13% for terasort benchmark. The results also show that the performance of compressing map output files with snappy provides better performance on execution time for both benchmarks.", "venue": "International Joint Conference on Computer Science and Software Engineering", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2017-07-01", "journal": {"name": "2017 14th International Joint Conference on Computer Science and Software Engineering (JCSSE)", "pages": "1-5"}, "authors": [{"authorId": "9124362", "name": "Kritwara Rattanaopas"}], "citations": [{"paperId": "eb9d0875bb09ea2889188a5ee2ee81e87b20df55", "title": "Fast DRL-based scheduler configuration tuning for reducing tail latency in edge-cloud jobs"}, {"paperId": "c2859b110dd8b9334e8b2d76a847649c6e4a4e1b", "title": "Performance Analysis of ECG Big Data using Apache Hive and Apache Pig"}, {"paperId": "c9b98c2812a0b95ee031c1487b933ac82c52b266", "title": "Big Data Retrieval using HDFS with LZO Compression"}, {"paperId": "e3dfdf92ad535e351f1dd31dabc6bfa4484805b8", "title": "Towards the Performance Analysis of Apache Tez Applications"}]}
