{"paperId": "cab1fda6d3f485d5e198958f24cf4a828d2f68c8", "publicationVenue": {"id": "c6ced65d-fcf7-4e5f-bedd-01360247ebbe", "name": "IEEE International Symposium on Personal, Indoor and Mobile Radio Communications", "type": "conference", "alternate_names": ["Pers Indoor Mob Radio Commun", "Personal, Indoor and Mobile Radio Communications", "IEEE Int Symp Pers Indoor Mob Radio Commun", "PIMRC"], "url": "http://www.ieee-pimrc.org/"}, "title": "Analysis of communication overheads for DNN inference offloading techniques in homogeneous edge networks", "abstract": "Computational offloading is used to augment the capabilities of edge devices by delegating highly complex tasks (e.g. Deep Neural Network - DNN - inference) to remote devices. This allows devices to complete workloads beyond their limited computational resources. DNN partitioning allows a DNN inference task to be divided so that the partitioned segments can be executed on separate devices. How a DNN is partitioned significantly impacts the communication delay an inference task will incur. An interesting scenario is offloading in homogeneous networks (e.g. IoT networks, smart cameras), where all devices have the same computational resources. Here there is no processing reduction to be obtained by offloading. The most important factor for a partitioning technique in this context is the ability to minimise communication delay. This paper compares six different DNN partitioning techniques (fused tile partitioning, multi-split vertical partitioning, single-split vertical partitioning with/without horizontal partitioning and finally, no vertical partitioning with/without horizontal partitioning) under various levels of network load when offloading VGG16, YoloV2 and MobileNetV2 inference tasks. Based on our findings a single-split approach with horizontal partitioning provides the least communication delay while also providing a small reduction to processing time through parallelising the processing of the DNN task.", "venue": "IEEE International Symposium on Personal, Indoor and Mobile Radio Communications", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-05", "journal": {"name": "2023 IEEE 34th Annual International Symposium on Personal, Indoor and Mobile Radio Communications (PIMRC)", "pages": "1-7"}, "authors": [{"authorId": "2193582603", "name": "Jamie Cotter"}, {"authorId": "2238849644", "name": "Ignacio Castiñeiras"}, {"authorId": "1410628000", "name": "Donna O’Shea"}, {"authorId": "2175561", "name": "V. Cionca"}], "citations": []}
