{"paperId": "cac3257cdbc5039fd18b0ac2fea51b5cbfd56afc", "publicationVenue": null, "title": "Z-Freq Hybrid: Signal Analysis Based Car Air Conditioning Compressor Monitoring Technique Using Accelerometer and Piezo-Film Sensor", "abstract": "\n The efficiency and performance of car air conditioning systems rely heavily on adequately functioning the compressor and its associated components. There are many ways to detect an unfunctioning compressor and one of them is through vibration. Disfunctioning compressors could lead to discomfort, fatigue, stress and fogging windows, especially in long-distance driving. Thus, researchers focus on detecting the nonfunctioning car air conditioning compressor early. This paper introduced a new enhanced statistical method, namely Z-freq Hybrid. Z-freq Hybrid was based on a Z-notch frequency domain filter with a combination input of two different types of sensors introduced to detect functioning compressors. Data were recorded at various compressor speeds using an accelerometer and piezo film sensor with Signal Express 2015 software. The acceleration (m/s2) and voltage (mV) data were analyzed to find the combination degree of scattering data in a Z-freq Hybrid chart. The analyzed data show that the Z-freq Hybrid coefficient increases as the compressor’s speed increases. Then, the value dropped significantly when the compressor was dysfunctional. In conclusion, a Z-freq Hybrid can be employed to detect abnormalities and irregular vibration patterns, which may indicate the impending failure of a compressor.", "venue": "Journal of Physics: Conference Series", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2024-03-01", "journal": {"name": "Journal of Physics: Conference Series"}, "authors": [{"authorId": "2261851861", "name": "MNB. Othman"}, {"authorId": "2292963761", "name": "M. Z. Nuawi"}, {"authorId": "2293025517", "name": "N.A. Ngatiman"}, {"authorId": "2281138068", "name": "M. Y. Yusri"}], "citations": []}
