{"paperId": "cad1057a722868f24cb5e2a39a09d6fd012aed33", "publicationVenue": {"id": "962fb65c-711e-4c56-ba5e-cf273cf1563c", "name": "Journal of Bioinformatics and Systems Biology", "type": "journal", "alternate_names": ["J Bioinform Syst Biology"], "issn": "2688-5107", "url": "http://www.fortunejournals.com/journal-of-bioinformatics-and-systems-biology-archive-fjbsb.php"}, "title": "Criteria for the Evaluation of Workflow Management Systems for Scientific Data Analysis", "abstract": "Many scientific endeavors, such as molecular biology, have become dependent on big data and its analysis. For example, precision medicine depends on molecular measurements and data analysis per patient. Data analyses supporting medical decisions must be standardized and performed consistently across patients. While perhaps not life-threatening, data analyses in basic research have become increasingly complex. RNA-seq data, for example, entails a multi-step analysis ranging from quality assessment of the measurements to statistical analyses. Workflow management systems (WFMS) enable the development of data analysis workflows (WF), their reproduction, and their application to datasets of the same type. However, far more than a hundred WFMS are available, and there is no way to convert data analysis WFs among WFMS. Therefore, the initial choice of a WFMS is important as it entails a lock-in to the system. The reach in their particular field (number of citations) can be used as a proxy for selecting a WFMS, but of the about 25 WFMS we mention in this work, at least 5 have a large reach in scientific data analysis. Hence other criteria are needed to delineate among WFMS. By extracting such criteria from selected studies concerning WFMS and adding additional criteria, we arrived at five critical criteria: reproducibility, reusability, FAIRness, versioning support, and security. Another five criteria (providing a graphical user interface, WF flexibility, WF scalability, WF shareability, and computational transparency) we deemed important but not critical for the assessment of WFMS. We applied the criteria to the most cited WFMS in PubMed and found none that support all criteria. We hope that suggesting these criteria will spark a discussion on what features are important for WFMS in scientific data analysis and may lead to developing WFMS that fulfill such criteria.", "venue": "Journal of Bioinformatics and Systems Biology", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "Journal of Bioinformatics and Systems Biology"}, "authors": [{"authorId": "2219591835", "name": "Aleyna Dilan Kiran"}, {"authorId": "2219591843", "name": "Mehmet Can Ay"}, {"authorId": "2603216", "name": "J. Allmer"}], "citations": [{"paperId": "0f516f3784981781b05d1a06a1e9b5efd0872624", "title": "Drivers and influencers of blockchain and cloud-based business sustainability accounting in China: Enhancing practices and promoting adoption"}]}
