{"paperId": "caee8bf04ff586509c3e51a7f948f6d8a3f6a4dc", "publicationVenue": {"id": "637ee9da-a796-41db-860f-d32678b198d3", "name": "Journal of Communication and Information Systems", "type": "journal", "alternate_names": ["J Commun Inf Syst"], "issn": "1980-6604", "url": "http://jcis.sbrt.org.br/jcis"}, "title": "SDMA Grouping Based on Unsupervised Learning for Multi-User MIMO Systems", "abstract": "—In this study, we investigate a spatial division mul- tiple access (SDMA) grouping scheme to maximize the total data rate of a multi-user multiple input multiple output (MU- MIMO) system. Initially, we partition the set of mobile stations (MSs) into subsets according to their spatial compatibility. We explore diﬀerent clustering algorithms, comparing them in terms of computational complexity and capability to partition MSs properly. In the following, we schedule MSs from the diﬀerent subsets to build the SDMA group. Since we consider a scenario with a massive arrange of antenna elements and that operates on the mmWave scenario, we employ a hybrid beamforming scheme and analyze its behavior in terms of the total data rate. The analog and digital precoders exploit the channel informa- tion obtained from clustering and scheduling, respectively. The simulation results indicate that a proper partition of MSs into clusters can take advantage of the spatial compatibility eﬀectively and reduce the multi-user (MU) interference. The hierarchical clustering (HC) enhances the total data rate 25% compared with the baseline approach, while the density-based spatial clustering of applications with noise (DBSCAN) increases the total data rate 20% .", "venue": "Journal of Communication and Information Systems", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": null, "journal": {"name": "Journal of Communication and Information Systems"}, "authors": [{"authorId": "1752845480", "name": "Francisco Hugo"}, {"authorId": "2568229", "name": "T. Maciel"}], "citations": [{"paperId": "6a7f8ec29e344d1e0ea87cfc84175603ddeaa49c", "title": "Bandit Learning-based Online User Clustering and Selection for Cellular Networks"}, {"paperId": "be587a65d70be196e0752e3b73c4e8ab89db7e8a", "title": "Towards the Optimal Pattern of Joint Beamforming, User Scheduling and Power Allocation in a multi-RAT Network"}]}
