{"paperId": "caefc24ca3b25c625113f6006edf0146f82a0d60", "publicationVenue": {"id": "aa746a02-d187-42c2-bdf9-df6a5d4e648c", "name": "Computer/law journal", "type": "journal", "alternate_names": ["Computer journal", "The Computer Journal", "Comput j", "Comput J"], "issn": "0164-8756", "alternate_issns": ["0010-4620"], "url": "https://repository.jmls.edu/jitpl/all_issues.html", "alternate_urls": ["http://comjnl.oxfordjournals.org/"]}, "title": "Optimization of Data Assignment for Parallel Processing in a Hybrid Heterogeneous Environment Using Integer Linear Programming", "abstract": "\n In the paper we investigate a practical approach to application of integer linear programming for optimization of data assignment to compute units in a multi-level heterogeneous environment with various compute devices, including CPUs, GPUs and Intel Xeon Phis. The model considers an application that processes a large number of data chunks in parallel on various compute units and takes into account computations, communication including bandwidths and latencies, partitioning, merging, initialization, overhead for computational kernel launch and cleanup. We show that theoretical results from our model are close to real results as differences do not exceed 5% for larger data sizes, with up to 16.7% for smaller data sizes. For an exemplary workload based on solving systems of equations of various sizes with various compute-to-communication ratios we demonstrate that using an integer linear programming solver (lp_solve) with timeouts allows to obtain significantly better total (solver+application) run times than runs without timeouts, also significantly better than arbitrary chosen ones. We show that OpenCL 1.2’s device fission allows to obtain better performance in heterogeneous CPU+GPU environments compared to the GPU-only and the default CPU+GPU configuration, where a whole device is assigned for computations leaving no resources for GPU management.", "venue": "Computer/law journal", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-02-10", "journal": {"name": "Comput. J.", "pages": "1412-1433", "volume": "65"}, "authors": [{"authorId": "1915129", "name": "Tomasz Boinski"}, {"authorId": "3318504", "name": "P. Czarnul"}], "citations": [{"paperId": "4aece2218711a5e26908e249fce3c38e7d1c4f72", "title": "A multithreaded CUDA and OpenMP based power‐aware programming framework for multi‐node GPU systems"}, {"paperId": "2d8c2d09680ca181ee505f980edd57fc2cb1a4de", "title": "Parallel Implementation of Key Algorithms for Intelligent Processing of Graphic Signal Data of Consumer Digital Equipment"}, {"paperId": "002423a4ded1758a5a180c6e788d65aca6985767", "title": "Energy-Aware Scheduling for High-Performance Computing Systems: A Survey"}, {"paperId": "6979d4577a76515b6272835197a4eab0e6a978b4", "title": "Improved Genetic Algorithm in the Analysis of Application of ATC Automatic of Data Processing"}, {"paperId": "72ea6707bb4fce59bd3be2f4515bc71fc9e2a796", "title": "Identification of Selected Resource-aware Problems Across Scientific Disciplines and Applications"}, {"paperId": "dbcaaea735bc06765256dac889c2ffe358ca9cd9", "title": "CERCIRAS Workshop-01: Abstracts"}]}
