{"paperId": "cafaa869cc25ba72255459cf7d7b72d661328f2c", "publicationVenue": {"id": "0dc0e794-53db-401d-bd8f-8da9165b2865", "name": "International Conferences on Contemporary Computing and Informatics", "type": "conference", "alternate_names": ["IC3I", "Int Conf Contemp Comput Informatics"]}, "title": "Reduced Energy Consumption in Cloud Data Center Using Machine Learning Algorithm Load Balancing", "abstract": "Cloud computing has made it possible for users to spend only for the volume of a service that they consume rather than purchasing a predetermined amount. Cloud computing and virtualization, when coupled, make it possible to access and share information technology resources whenever and wherever they are needed. When it comes to cloud computing, a dependable data centre infrastructure is unrivalled by anything else. In the context of this discussion, the term “infrastructure” refers to the collection of computers, wiring, and power sources that together serve as a host for an organization’s information and store it. When it comes to cloud computing, great overall performance has always been the most important factor, but this has resulted in an increase in the amount of energy that is required. The major objective is to achieve as low a level of power consumption as possible while maintaining as high a level of performance and quality of service as possible inside the carrier network. Our strategy calls for an in-depth study of the patterns of energy consumption exhibited by cloud-based systems. Authors perform an analysis of energy use and show how suitable optimization methods based on our models of energy consumption can assist cloud data centres in saving even more electricity. These methods are informed by our analysis of energy consumption. Because of capsule optimization, this system is able to generate more accurate projections of the costs that will be incurred in the future. The accuracy rate for the forecasting component is 97%.", "venue": "International Conferences on Contemporary Computing and Informatics", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-12-14", "journal": {"name": "2022 5th International Conference on Contemporary Computing and Informatics (IC3I)", "pages": "1029-1034"}, "authors": [{"authorId": "2090127470", "name": "T. Suneetha"}, {"authorId": "2108409815", "name": "Shalini Singh"}, {"authorId": "1381508445", "name": "B. Neeraja"}, {"authorId": "1484806976", "name": "S. Tufa"}, {"authorId": "31773809", "name": "Nallusamy Thiyagarajan"}, {"authorId": "2198498660", "name": "A. Rao"}], "citations": []}
