{"paperId": "caff213f6b2f22b60812c53d59c0105cc25a5066", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Development and Evaluation of a Big Data Framework for Performance Management in Mobile Networks", "abstract": "In telecommunications, Performance Management (PM) data are collected from network elements to a centralized system, the Network Management System (NMS), which acts as a business intelligence tool specialized in monitoring and reporting network performance. Performance Management files contain the metrics and named counters used to quantify the performance of the network. Current NMS implementations have limitations in scalability and support for volume, variety, and velocity of the collected PM data, especially for 5G and 6G mobile network technologies. To overcome these limitations, we proposed a Big Data framework based on an analysis of the following components: software architecture, ingestion, data lake, processing, reporting, and deployment. Our work analyzed the PM files’ format on a real data set from four different vendors and 2G, 3G, 4G, and 5G technologies. Then, we experimentally assessed our proposed framework’s feasibility through a case study involving 5G PM files. Test results of the ingestion and reporting components are presented, identifying the hardware and software required to support up to one billion counters per hour. This proposal can help telecommunications operators to have a reference Big Data framework to face the current and future challenges in the NMS, for instance, the support of data analytics in addition to the well-known services.", "venue": "IEEE Access", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "226380-226396", "volume": "8"}, "authors": [{"authorId": "1411186760", "name": "Diana Martínez-Mosquera"}, {"authorId": "143807211", "name": "Rosa Navarrete"}, {"authorId": "1405522947", "name": "Sergio Luján-Mora"}], "citations": [{"paperId": "aedd805e7ce7ec115d0adf420af9303c210b39d8", "title": "Big-Data Platform for Performance Monitoring of Telecom-Service-Provider Networks"}, {"paperId": "a32be5909140d20946fdfcc27cf48a04d3639a7c", "title": "Big Data Architecture for Mobile Network Operators"}, {"paperId": "0fcb8c26ff6b4ecbd19964946272e4a42ad60f61", "title": "Efficient processing of complex XSD using Hive and Spark"}, {"paperId": "881806ed444618a22f8d5183fb95555e0b91fac6", "title": "A Self-Optimizing Technique Based on Vertical Handover for Load Balancing in Heterogeneous Wireless Networks Using Big Data Analytics"}]}
