{"paperId": "cb099217d144f4adff74b25807039db4a880eaa0", "publicationVenue": {"id": "bbdd88c4-fb38-40a7-9a05-df99e3d1eee2", "name": "International Conference on Information, Intelligence, Systems and Applications", "type": "conference", "alternate_names": ["Int Conf Inf Intell Syst Appl", "IISA"]}, "title": "A Unified Framework for Querying Dynamic and Semantic Data Sources", "abstract": "Effective storing and querying of building energy consumption data is crucial, since the energy sector accounts for almost 40% of the energy consumed worldwide. However, the rapid growth of networking capabilities has led to the storage needs for energy consumption data in data lakes and warehouses becoming unmanageable, making querying an inefficient task. To effectively store such vast amounts with regard to their dimensions and their semantic interpretation, many semantic ontology models have been developed. Data sharing mechanisms are then applied on top of data warehouses to extract useful knowledge for user related purposes. It is recognized, though, that distributed query engines are capable of querying only dynamic big data, while semantic mechanisms are confined to querying semantic ontologies. In this paper, we propose a framework that facilitates efficient querying of heterogenous data sources of dynamic and semantic data including graph ontologies for metadata representation. The framework also establishes high level visualization services by employing well-known visualization tools. Finally, particular emphasis is placed on securing the framework with proper resource identity management. The framework is developed in the context of DigiBUILD, an Horizon Europe funded project aiming at providing a digital logbook for analytic services on the building sector.", "venue": "International Conference on Information, Intelligence, Systems and Applications", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-07-10", "journal": {"name": "2023 14th International Conference on Information, Intelligence, Systems & Applications (IISA)", "pages": "1-7"}, "authors": [{"authorId": "2274391074", "name": "Konstantinos Touloumis"}, {"authorId": "93020509", "name": "Panagiotis Kapsalis"}, {"authorId": "2034353716", "name": "Elissaios Sarmas"}, {"authorId": "2221123513", "name": "Stathis Stamatopoulos"}, {"authorId": "90991141", "name": "Evangelos Karakolis"}, {"authorId": "2274251311", "name": "Vaggelis Marinakis"}], "citations": []}
