{"paperId": "cb2a60a1367a017043a5e3d55114ba51c35dab7e", "publicationVenue": {"id": "d406a3f4-dc05-43be-b1f6-812f29de9c0e", "name": "IEEE Transactions on Information Forensics and Security", "type": "journal", "alternate_names": ["IEEE Trans Inf Forensics Secur"], "issn": "1556-6013", "url": "http://www.ieee.org/organizations/society/sp/tifs.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=10206", "http://www.signalprocessingsociety.org/publications/periodicals/forensics/"]}, "title": "iPrivJoin: An ID-Private Data Join Framework for Privacy-Preserving Machine Learning", "abstract": "The world has observed an increasing trend in the development of Privacy-Preserving Machine Learning (PPML) for cross-silo collaborative model training over sensitive data. As the first essential step of cross-silo PPML, it is critical that the parties can align their dataset with privacy assurance, i.e., <italic>private data join</italic>. However, the existing private data join methods typically leak the ID information in the dataset intersection, which often raises privacy concerns. In this work, we propose <italic>iPrivJoin</italic>: a novel framework of ID-private data join for PPML. Compared with naively using circuit-based Private Set Intersection (circuit-PSI) for data join, the proposed framework has two advantages: 1) data volume reduction. <italic>iPrivJoin</italic> utilizes oblivious shuffle to securely trim off the redundant data that is outside the intersection, while the entire dataset needs to be carried to further process in the circuit-PSI based approach. 2) efficiency improvement. <italic>iPrivJoin</italic> introduces a new private encoding technique to avoid the expensive circuit evaluation that is needed in circuit-PSI. As a result, compared with directly using circuit-PSI, PPML with <italic>iPrivJoin</italic> enjoys approximately <inline-formula> <tex-math notation=\"LaTeX\">$3\\times $ </tex-math></inline-formula> of speedup. Moreover, we propose a new oblivious shuffle protocol, which may be of independent interest. It achieves <inline-formula> <tex-math notation=\"LaTeX\">$1.44\\times $ </tex-math></inline-formula> of speedup to the state-of-the-art in the real-world WAN network setting.", "venue": "IEEE Transactions on Information Forensics and Security", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Transactions on Information Forensics and Security", "pages": "4300-4312", "volume": "18"}, "authors": [{"authorId": "46399556", "name": "Yang Liu"}, {"authorId": "33331337", "name": "Bingsheng Zhang"}, {"authorId": "2222519096", "name": "Yuxiang Ma"}, {"authorId": "2115919356", "name": "Zhuo Ma"}, {"authorId": "2217820846", "name": "Zecheng Wu"}], "citations": []}
