{"paperId": "cb2c5899ca3bc98a7a6e451fbdb3c4731bf5bd1a", "publicationVenue": null, "title": "Understanding Technological Trends in Education: How Artificial Intelligence Helps Learning in Colleges In Susta", "abstract": "Background. Understanding technological trends is how popular technology is used to assist learning, Artificial Intelligence is created and programmed and designed by humans to assist activities in completing human tasks.\nPurpose to understand technological trends in education how Artificial Intelligence helps learning in higher education in a sustainable manner, where in the last year 2020 there was Covid 19 which had spread throughout the world so there were online classes, but over the years the problem has ended, that's what caused it technology trend of Artificial intelligence in assisting learning.\nMethod. using the method of conducting interviews from sources directly, conducting interviews with this research with the aim of getting the correct data.\nResults. shows that understanding the trend of Artificial Intelligence technology in helping learning in higher education in a sustainable manner is very helpful and its use has increased in recent years due to the impact of covid 19 so that it has greatly affected online learning.\nConclusion it was concluded that the results of the interviews showed the use of Artificial Intelligence in assisting learning through individuals in using technology in completing learning tasks and assisting when the learning process takes place in the classroom is very helpful, technology as a medium used in learning, students still use the same technology cannot be said in sustainable", "venue": "Journal Emerging Technologies in Education", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-07-22", "journal": {"name": "Journal Emerging Technologies in Education"}, "authors": [{"authorId": "2278513729", "name": "Adam Mudinillah"}, {"authorId": "2277952902", "name": "Fetri Yeni J"}, {"authorId": "2278497331", "name": "Ahmad Firdaus bin Mohd Noor"}], "citations": []}
