{"paperId": "cb32abd4215db2ae05518b38d3201bf5f6288481", "publicationVenue": {"id": "1620da87-4387-4b9a-9bf4-22fdf74d4dc3", "name": "Symmetry", "type": "journal", "issn": "2073-8994", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172134", "alternate_urls": ["https://www.mdpi.com/journal/symmetry", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172134"]}, "title": "Design and Optimization of Combined Cooling, Heating, and Power Microgrid with Energy Storage Station Service", "abstract": ": This study aims to symmetrically improve the economy and environmental protection of combined cooling, heating and power microgrid. Hence, the characteristics of conﬁguration ways of energy storage devices in traditional combined cooling, heating and power systems are analyzed, and a scheme for the operator to establish an energy storage station is designed. An improved aquila optimizer for the optimal conﬁguration of the system is proposed to symmetrically enhance the economic and environmental protection performance. The feasibility of the proposed scheme is veriﬁed through experiments in three different places. The results show that the economic cost and exhaust emission of the system with energy storage station are reduced to varying degrees compared with the system with energy storage equipment alone and the system without energy storage equipment based on symmetry concept. Especially in Place 1, the scheme with energy storage station in the system can reduce the electric energy purchased from power grid by 43.29% and 61.09%, respectively, compared with other schemes. This study is conducive to promoting the development of clean energy, alleviating the energy crisis, reducing the power supply pressure of power grid, and improving the proﬁts of operators by symmetrically considering the economic and environmental performance of the system.", "venue": "Symmetry", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "Symmetry", "pages": "791", "volume": "14"}, "authors": [{"authorId": "2059828144", "name": "Nan Ning"}, {"authorId": "2108398659", "name": "Yu-Wei Liu"}, {"authorId": "1491237383", "name": "Haixia Yang"}, {"authorId": "2145714954", "name": "Ling-ling Li"}], "citations": [{"paperId": "21bf89e869fa38741a12acd76717254bfa8c4cbe", "title": "Risk‐based scheduling of CCHP‐based microgrid considering economic and environmental aspects using confidence degree theory and CVaR approach"}, {"paperId": "10dfc358641ca22daf090a760fa901e174bd8486", "title": "Collaborative optimal scheduling of shared energy storage station and building user groups considering demand response and conditional value-at-risk"}, {"paperId": "fc9ed78df6ed795276d92d65800be07284c12810", "title": "Chaotic adaptive particle swarm algorithm based on tent mapping for multi-objective optimization of combined cooling, heating, and power source-store-load systems"}, {"paperId": "803c1fd9f6a2c99704b1452d323ea931ef4babec", "title": "3E (energy, economic, environmental) multi-objective optimization of CCHP industrial plant: Investigation of the optimal technology and the optimal operating strategy"}, {"paperId": "ae13fdcbfb66975396b3e2867ba43568c28cbf8c", "title": "Special Features and Applications on Applied Metaheuristic Computing"}]}
