{"paperId": "cb33114e9ab8d72a9df9ca6cdba46da3cbed14e5", "publicationVenue": null, "title": "Depth insight for data scientist with RapidMiner « an innovative tool for AI and big data towards medical applications»", "abstract": "RapidMiner tool is considered among the advanced analytics and powerful platform services in the field of artificial intelligence besides the Big Data storage. This solution has emerged towards several industries such as Financial Services, Energy, Logistics, Life Science and Healthcare and has shown a crucial impact for predictive decisions in this area. This work seeks to describe the solution strategy of this tool for data scientist by depicting a depth insight of this concept which contains more 1500 native algorithms, data preparation and data science functions. This features allows professionals to support any machine learning libraries and integrate python and R codes. RapidMiner offers three different modalities to access to their products which are the main Platform, the automated data science and the AI cloud.", "venue": "Proceedings of the 2nd International Conference on Digital Tools & Uses Congress", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "Conference"], "publicationDate": "2020-10-15", "journal": {"name": "Proceedings of the 2nd International Conference on Digital Tools & Uses Congress"}, "authors": [{"authorId": "2034204180", "name": "Mohamed Bjaoui"}, {"authorId": "48810077", "name": "Houneida Sakly"}, {"authorId": "49128178", "name": "Mourad Said"}, {"authorId": "9441889", "name": "N. Kraiem"}, {"authorId": "2009368", "name": "M. Bouhlel"}], "citations": [{"paperId": "e59c8d042ecbfcc8c22eef77949155338f339e53", "title": "Assessing the Effectiveness of Textual Recommendations in KoopaML"}, {"paperId": "8867926fc67584f0644a4886630f0c697887c004", "title": "Usability and Adoption of Graphical Data-Driven Development Tools"}, {"paperId": "de2d39a3d1fec04de6129b2d3729934c6c38a797", "title": "Comparisons of automated machine learning (AutoML) in predicting whistleblowing of academic dishonesty with demographic and theory of planned behavior"}, {"paperId": "15109963846f56120cfd0b57ad321d615f9d385d", "title": "Harnessing AI for enhancing scientific writing in nursing research: Prospects, pitfalls, and solutions."}, {"paperId": "f16f3b80f4b72c0fb2eabe09d34528f103b91d1a", "title": "Uncovering negative sentiments: a study of indonesian twitter users' health opinions on coffee consumption"}, {"paperId": "03c57d4c261427f8a2de48e1a06d86c2f35356d3", "title": "An Analytical Study of Iraqi Supermarket Materials using the RapidMiner Tools"}, {"paperId": "57fde85d484f5611cc54ea7cd2186ca81dbe571a", "title": "Tooling for Developing Data-Driven Applications: Overview and Outlook"}, {"paperId": "2a412595214b8eabcd0a7b39bd09fd66f4fa8bd2", "title": "KoopaML, a Machine Learning platform for medical data analysis"}, {"paperId": "ddca5de47e41b79e4c1b956a9bc702aff44a8486", "title": "User-Centered Design Approach for a Machine Learning Platform for Medical Purpose"}]}
