{"paperId": "cb48fb565b29b53f5bee823d059365e1baa5bfd6", "publicationVenue": {"id": "2ef3d692-67d8-4150-8e21-55b389e72376", "name": "Journal of computing and security", "type": "journal", "alternate_names": ["J comput secur", "Journal of Computer Security", "J Comput Secur"], "issn": "2322-4460", "alternate_issns": ["0926-227X"], "url": "http://jcomsec.org/", "alternate_urls": ["http://content.iospress.com/journals/journal-of-computer-security"]}, "title": "AntibIoTic: The Fog-enhanced distributed security system to protect the (legacy) Internet of Things", "abstract": "The Internet of Things (IoT) is evolving our society; however, the growing adoption of IoT devices in many scenarios brings security and privacy implications. Current security solutions are either unsuitable for every IoT scenario or provide only partial security. This paper presents AntibIoTic 2.0, a distributed security system that relies on Fog computing to secure IoT devices, including legacy ones. The system is composed of a backbone, made of core Fog nodes and Cloud server, a Fog node acting at the edge as the gateway of the IoT network, and a lightweight agent running on each IoT device. The proposed system offers fine-grained, host-level security coupled with network-level protection, while its distributed nature makes it scalable, versatile, lightweight, and easy to deploy, also for legacy IoT deployments. AntibIoTic 2.0 can also publish anonymized and aggregated data and statistics on the deployments it secures, to increase awareness and push cooperations in the area of IoT security. This manuscript recaps and largely expands previous works on AntibIoTic, providing an enhanced design of the system, an extended proof-of-concept that proves its feasibility and shows its operation, and an experimental evaluation that reports the low computational overhead it causes.", "venue": "Journal of computing and security", "year": 2021, "fieldsOfStudy": ["Computer Science", "Business"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-08-11", "journal": {"name": "J. Comput. Secur.", "pages": "689-725", "volume": "30"}, "authors": [{"authorId": "143953252", "name": "Michele De Donno"}, {"authorId": "1797842", "name": "Xenofon Fafoutis"}, {"authorId": "3207784", "name": "N. Dragoni"}], "citations": []}
