{"paperId": "cb4b1686b3fcbafe74f6362359d05e946d9701b4", "publicationVenue": {"id": "ae1ea12a-b0c2-4dc7-b5c6-1e42fd4df4b5", "name": "Anais do Congresso Internacional de Conhecimento e Inovação – ciki", "type": "conference", "alternate_names": ["An Congr Int Conhecimento Inov  ciki"], "issn": "2318-5376"}, "title": "A ENGENHARIA DO CONHECIMENTO NAS INSTITUIÇÕES DE ENSINO: UMA REVISÃO INTEGRATIVA", "abstract": "A Engenharia do Conhecimento (EC) oferece várias metodologias e ferramentas que podem ser utilizadas em contextos organizacionais diversos. Na área da educação essas ferramentas têm o poder de aprimorar desde atividades de ensino-aprendizagem até à gestão da instituição. Este artigo tem como objetivo realizar uma revisão integrativa da literatura para analisar como as ferramentas da Engenharia do Conhecimento vêm sendo aplicadas nas instituições de ensino. Foram identificadas 39 publicações cujo objeto de estudo auxilia a compreender o fenômeno em estudo neste artigo. Foi possível classificar estas publicações em sete macro tópicos com base nas semelhanças entre suas abordagens metodológicas. Além disso, foi possível identificar diversas proposições de utilização de ferramentas da EC nas instituições de ensino. Foi observado que trabalhos complementares podem ser realizados afim de aprofundar os benefícios das ferramentas de EC em instituições de ensino.", "venue": "Anais do Congresso Internacional de Conhecimento e Inovação – ciki", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-03-16", "journal": {"name": "Anais do Congresso Internacional de Conhecimento e Inovação – ciki"}, "authors": [{"authorId": "120351042", "name": "Tatiana Tozzi"}, {"authorId": "2161276704", "name": "Pedro Heusi Tagliari"}, {"authorId": "2126288742", "name": "José Leomar Todesco"}], "citations": []}
