{"paperId": "cb520cf83b6b4fbbb896c4baea1831d1ac08222a", "publicationVenue": {"id": "29df4b17-9a16-4a4c-94a6-002f52e628b4", "name": "International Conference on Parallel Processing", "type": "conference", "alternate_names": ["ICPP", "Int Conf Parallel Process", "IEEE Int Conf Pulsed Power", "IEEE International Conference on Pulsed Power"], "url": "http://www.wikicfp.com/cfp/program?id=1447"}, "title": "CERES: Container-Based Elastic Resource Management System for Mixed Workloads", "abstract": "It is common to deploy multiple workloads in one cluster to achieve high resource utilization, which tends to bring more resource contentions and performance interferences. If the allocable resources cannot satisfy the resource requirements of a task, the task should wait for resources, significantly increasing its scheduling latency. The inappropriate resource requirements may make a running task become a swollen task or a straggler task, which makes many allocated resources underutilized or the task be processed slowly. Therefore, how to guarantee the QoS of various services in the mixed workload deployment cluster is a challenge. Existing solutions preempt the resources from batch jobs to guarantee the resource requirements of latency-sensitive tasks without taking into account the underutilized resources in swollen tasks, which inevitably compromises the performance of batch jobs. Thus, we try to meet the resource requirements of newly incoming latency-sensitive tasks and straggler tasks with the underutilized resources instead of directly preempting the resources of batch jobs. This paper presents CERES, which tries to ensure the QoS of latency-sensitive services and reduce the performance impact on batch jobs. Firstly, CERES periodically screens out swollen tasks from batch jobs and straggler tasks from latency-sensitive services. Secondly, CERES reclaims resources from the swollen tasks and even preempts resources from common batch tasks when the idle resources in the cluster cannot meet the resource requirements of newly incoming latency-sensitive tasks and the straggler tasks. If there are sufficient allocable resources in the cluster, CERES expands the resources of the straggler tasks. We have implemented CERES based on Hadoop YARN and conducted comprehensive experiments. The results show that compared with the state-of-the-art approach, CERES can decrease the task completion time of latency-sensitive services by 20.77%, reduce performance losses to batch jobs by 15.46%, and improve the cluster resource utilization by 27.06%.", "venue": "International Conference on Parallel Processing", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2021-08-09", "journal": {"name": "Proceedings of the 50th International Conference on Parallel Processing"}, "authors": [{"authorId": "2151483458", "name": "Jinyu Yu"}, {"authorId": "2064895946", "name": "Dan Feng"}, {"authorId": "145405896", "name": "Wei Tong"}, {"authorId": "73212293", "name": "Pengze Lv"}, {"authorId": "2153657625", "name": "Yufei Xiong"}], "citations": [{"paperId": "09a02e6a83bc43b5fa3a764ddf761972b2ebc529", "title": "A Survey on Spatio-Temporal Big Data Analytics Ecosystem: Resource Management, Processing Platform, and Applications"}, {"paperId": "01408a784380efb3758cd9c496b084926b9f4141", "title": "Tango: Harmonious Management and Scheduling for Mixed Services Co-located among Distributed Edge-Clouds"}, {"paperId": "14fa08865197993eff2e05dcb8695d6bab3c05d5", "title": "Topology-Aware Self-Adaptive Resource Provisioning for Microservices"}, {"paperId": "c25958d133918be75d0b41bcec18f6d8a62d6972", "title": "TERMS: Task management policies to achieve high performance for mixed workloads using surplus resources"}]}
