{"paperId": "cb52c5f6a3fd263bd1d57fcde8a25bf839300d8e", "publicationVenue": {"id": "bb21160f-0f31-4e34-abab-715b95a870a2", "name": "Indonesian Journal of Electrical Engineering and Computer Science", "type": "journal", "alternate_names": ["Indones J Electr Eng Comput Sci"], "issn": "2502-4752", "url": "http://www.iaescore.com/journals/index.php/IJEECS"}, "title": "Throughput maximization with channel access fairness model using game theory approach", "abstract": "The adoption of cognitive radio (CR) technology into wireless sensor networks (WSNs) effectively addresses the spectrum scarcity problem of traditional unlicensed spectrum. Allocating and managing limited network channel to secondary user (SUs) considering dynamic behavior pattern of primary users (PUs) is a critical issue of CR-WSN. Recently, various channel access methodologies using statistical, reinforcement learning (RL), game theory (GT), and deep learning (DL) model have been presented for CR-WSN. However, the existing channel access methodologies has following two limitations: i) fails to assure balance between maximizing throughput of SUs with minimal interference to PUs considering multi-channel CR-WSNs environment; and ii) maximizing throughput with minimal collision assuring access fairness among SUs considering energy constraint CR-WSNs. In addressing the research issues, this paper present throughput maximization channel access fairness using game theory (TMCAF-GT) model. The TMCAF employ both shared and non-shared channel access mechanism employing GT model for assuring throughput maximization with minimal interference and access fairness. Experiment outcome shows the TMCAF-GT provides superior throughput with minimal collision.", "venue": "Indonesian Journal of Electrical Engineering and Computer Science", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-01", "journal": {"name": "Indonesian Journal of Electrical Engineering and Computer Science"}, "authors": [{"authorId": "2285527651", "name": "Humera Tauseef"}, {"authorId": "2226350470", "name": "Rukhsar Fatima"}, {"authorId": "69919546", "name": "Rohina Khanam"}], "citations": []}
