{"paperId": "cb5caedd286eb496f5e949d6fd64fcad7c35c9f1", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Reduced Quotient Cube: Maximize Query Answering Capacity in OLAP", "abstract": "The data cube is a critical tool for accelerating online analysis in big data. Due to its exponential space overhead, the quotient cube, as the main data cube compression approach, was proposed to significantly reduce the number of data cells if they are aggregated over the same base tuple set, i.e. they are cover equivalent to form an equivalence class. Nevertheless, it still poses challenges to efficiently analyze massive data due to high storage space consumption. This paper proposes the reduced quotient cube (RQC) based on the following observation. (i) there are equivalence classes of various sizes in a quotient cube; (ii) the small equivalence classes usually dominate; (iii) the big equivalence classes are more capable of query answering since they can induce more data cells. Unlike the quotient cube, which preserves all the equivalence classes of equal priority, the reduced quotient cube preferentially does those with larger query answering capacity and smaller space occupied capacity. Further, we design its efficient constructing and querying algorithms. The extensive experimental results show that compared with the quotient cube, the reduced quotient cube space is only 11.3%, while the maximum query capacity is 95.9%. The query time of the reduced quotient cube is reduced by 51.24% on average compared to the quotient cube.", "venue": "IEEE Access", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "141524-141535", "volume": "9"}, "authors": [{"authorId": "2140026928", "name": "Quankun Wang"}, {"authorId": "1969022", "name": "Jinguo You"}, {"authorId": "1491636953", "name": "Benyuan Zou"}, {"authorId": "2144841340", "name": "Yu Chen"}, {"authorId": "2152665545", "name": "Xingrui Huang"}, {"authorId": "50493144", "name": "Lianyin Jia"}], "citations": []}
