{"paperId": "cb709ef281cc16cc57baa145db58f0db31c125ac", "publicationVenue": null, "title": "Availability of Services in Wireless Sensor Network with Aerial Base Station Placement", "abstract": "Internet of Things technologies use many sensors combined with wireless networks for cyber-physical systems in various applications. Mobility is an essential characteristic for many objects that use sensors. In mobile sensor networks, the availability of communication channels is crucial, especially for mission-critical applications. This article presents models for analyzing the availability of sensor services in a wireless network with aerial base station placement (ABSP), considering the real conditions for using unmanned aerial vehicles (UAVs). The studied system uses a UAV-assisted mobile edge computing architecture, including ABSP and a ground station for restoring the energy capacity of the UAVs, to maintain the availability of interaction with the sensors. The architecture includes a fleet of additional replacement UAVs to ensure continuous communication coverage for the sensor network during the charging period of the air-based station UAVs. Analytical expressions were obtained to determine the availability of sensor services in the system studied.", "venue": "J. Sens. Actuator Networks", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-08", "journal": {"name": "J. Sens. Actuator Networks", "pages": "39", "volume": "12"}, "authors": [{"authorId": "1950869", "name": "I. Kabashkin"}], "citations": [{"paperId": "6368e79e5460e654ec20a57f5c631be62cacc473", "title": "An improved localization approach based on sybil attack for WSN"}, {"paperId": "cb86b0343f94c751b406028da840c8338ffeee2b", "title": "A Survey on Air-to-Sea Integrated Maritime Internet of Things: Enabling Technologies, Applications, and Future Challenges"}, {"paperId": "67db150964322b54cfdce8f67f8c7b70fbc18a75", "title": "Range-Free Localization Approaches Based on Intelligent Swarm Optimization for Internet of Things"}]}
