{"paperId": "cb7655a0e1dcf642e930dd54ca10c0d16c8db610", "publicationVenue": {"id": "915442b0-ebd3-4d6f-88d4-4939a6d3a7bc", "name": "Journal of Information and Data Management", "type": "journal", "alternate_names": ["J inf data manag", "J Inf Data Manag", "Journal of information and data management", "JIDM"], "issn": "2178-7107", "alternate_issns": ["2166-6261"], "url": "http://seer.lcc.ufmg.br/index.php/jidm", "alternate_urls": ["https://seer.lcc.ufmg.br/index.php/jidm/index"]}, "title": "Polyflow: a Polystore-compliant Mechanism to Provide Interoperability to Heterogeneous Provenance Graphs", "abstract": "Many scientific experiments are modeled as workflows. Workflows usually output massive amounts of data. To guarantee the reproducibility of workflows, they are usually orchestrated by Workflow Management Systems (WfMS), that capture provenance data. Provenance represents the lineage of a data fragment throughout its transformations by activities in a workflow. Provenance traces are usually represented as graphs. These graphs allows scientists to analyze and evaluate results produced by a workflow. However, each WfMS has a proprietary format for provenance and do it in different granularity levels. Therefore, in more complex scenarios in which the scientist needs to interpret provenance graphs generated by multiple WfMSs and workflows, a challenge arises. To first understand the research landscape, we conduct a Systematic Literature Mapping, assessing existing solutions under several different lenses. With a clearer understanding of the state of the art, we propose a tool called Polyflow, which is based on the concept of Polystore systems, integrating several databases of heterogeneous origin by adopting a global ProvONE schema. Polyflow allows scientists to query multiple provenance graphs in an integrated way. Polyflow was evaluated by experts using provenance data collected from real experiments that generate phylogenetic trees through workflows. The experiment results suggest that Polyflow is a viable solution for interoperating heterogeneous provenance data generated by different WfMSs, from both a usability and performance standpoint.", "venue": "Journal of Information and Data Management", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-11-13", "journal": {"name": "J. Inf. Data Manag.", "volume": "11"}, "authors": [{"authorId": "2093823198", "name": "Yan Mendes"}, {"authorId": "33663874", "name": "Daniel de Oliveira"}, {"authorId": "3458069", "name": "Victor Ströele"}], "citations": [{"paperId": "e5e09fe920032275d5f70338a97a08b326b6ce9f", "title": "Privacidade Diferencial em Sistemas Polystore: uma Abordagem Prática"}]}
