{"paperId": "cb79d1797679e139ebfec2e58466be88b9b29b88", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Dual Image-Based CNN Ensemble Model for Waste Classification in Reverse Vending Machine", "abstract": "A reverse vending machine motivates citizens to bring recyclable waste by rewarding them, which is a viable solution to increase the recycling rate. Reverse vending machines generally use near-infrared sensors, barcode sensors, or cameras to classify recycling resources. However, sensor-based reverse vending machines suffer from a high configuration cost and the limited scope of target objects, and conventional single image-based reverse vending machines usually make erroneous predictions about intentional fraud objects. This paper proposes a dual image-based convolutional neural network ensemble model to address these problems. For this purpose, we first created a prototype reverse vending machine and constructed an image dataset containing two cross-sections of objects, top and front view. Then, we chose convolutional neural network models widely used in image classification as the candidates for building an accurate and lightweight ensemble model. Considering the size and classification performance of candidates, we constructed the best-fit ensemble combination and evaluated its classification performance. The final ensemble model showed a classification accuracy higher than 95% for all target classes, including fraud objects. This result proves that our approach achieves better robustness against intentional fraud objects than single image-based models and thus can broaden the scope for target resources. The measurement results on lightweight embedded platforms also demonstrated that our model provides a short inference time that is enough to facilitate the real-time execution of reverse vending machines based on low-cost edge artificial intelligence devices.", "venue": "Applied Sciences", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-11-22", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "2542642", "name": "Taeyoung Yoo"}, {"authorId": "2155886662", "name": "Seongjae Lee"}, {"authorId": "8248809", "name": "Taehyoun Kim"}], "citations": [{"paperId": "0d792da2ea1d68f996b5f5c5df7fc858128643f3", "title": "Connecting the Indispensable Roles of IoT and Artificial Intelligence in Smart Cities: A Survey"}, {"paperId": "c82211fb97b62e79b583ac316c8a842f25b02c89", "title": "Recycling of generic ImageNet-trained models for smart-city applications"}, {"paperId": "854259a6b4b4dd52262fce06f5c31526337898b6", "title": "Comparison of ResNet50 and SqueezeNet1.1 for Plastic Bottles and Cans Classification"}, {"paperId": "6f099422e18ccd679fb20d6c11711f8c2c9bf796", "title": "Plastic Waste Management through the Development of a Low Cost and Light Weight Deep Learning Based Reverse Vending Machine"}, {"paperId": "59cd27f1de997747a5fd95aadbb72fe8370815fb", "title": "Adoption of artificial intelligence in smart cities: A comprehensive review"}]}
