{"paperId": "cb83283aba5e71a3207713fe91c87908141221f6", "publicationVenue": null, "title": "Integrating memory-mapping and N-dimensional hash function for fast and efficient grid-based climate data query", "abstract": "ABSTRACT Database systems are pervasive components in the current big data era. However, efficiently managing and querying grid-based or array-based multidimensional climate data are still beyond the capabilities of most databases. The mismatch between the array data model and relational data model limited the performance to query multidimensional data in a traditional database when data volume hits a cap. Even a trivial data retrieval on large multidimensional datasets in a relational database is time-consuming and requires enormous storage space. Given the scientific interests and application demands on time-sensitive spatiotemporal data query and analysis, there is an urgent need for efficient data storage and fast data retrieval solutions on large multidimensional datasets. In this paper, we introduce a method for multidimensional data storing and accessing, which includes a new hash function algorithm that works on a unified data storage structure and couples with the memory-mapping technology. A prototype database library, LotDB developed as an implementation, is described in this paper, which shows promising results on data query performance compared with SciDB, MongoDB, and PostgreSQL.", "venue": "Ann. GIS", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-04-02", "journal": {"name": "Annals of GIS", "pages": "57 - 69", "volume": "27"}, "authors": [{"authorId": "8685112", "name": "Mengchao Xu"}, {"authorId": "145927745", "name": "Liang Zhao"}, {"authorId": "2637157", "name": "Ruixin Yang"}, {"authorId": "7788948", "name": "Jingchao Yang"}, {"authorId": "97095966", "name": "D. Sha"}, {"authorId": "31823352", "name": "C. Yang"}], "citations": [{"paperId": "2e34b79e9c04455254eade59134c6a5d230e7a3f", "title": "MAPPING RAINFALL [ISOHYET] IN AREAS WITH A SHORTAGE OF RAIN STATIONS USING MANUAL STATION TECHNIQUE AND PRECTOTCORR MERRA-2 DATA ANALYSIS"}, {"paperId": "9f7721136d58fa6367677d7d9c984bf3962ba92b", "title": "SmarT: Machine Learning Approach for Efficient Filtering and Retrieval of Spatial and Temporal Data in Big Data"}]}
