{"paperId": "cb8637c8a2b325504f67dc6b894fad1199853a24", "publicationVenue": {"id": "42d81e27-f4fb-4fed-920c-36d5eb6d4615", "name": "Corporate Communications. An International Journal", "type": "journal", "alternate_names": ["Corp Commun Int J", "Corporate Communications: An International Journal"], "issn": "1356-3289", "url": "https://www.emerald.com/insight/publication/issn/1356-3289", "alternate_urls": ["http://www.emeraldinsight.com/ccij.htm", "http://www.emeraldinsight.com/1356-3289.htm"]}, "title": "A survey of corporate communication professionals' perspective on social listening and analytics", "abstract": "PurposeThe present research aimed to identify the motivations, needs, wants, preferences and limitations of corporate professionals with regard to business social analytics.Design/methodology/approachOnline interviews were conducted with 26 professionals the majority of whom work at the management level at 20 reputable corporations in Turkey. Both qualitative and quantitative data was collected during these interviews, which lasted an average of one hour.FindingsThe findings shed light on the motivations of corporate professionals for monitoring social media and other digital media, their perceived capability and limitations in doing so, the media that they monitor and wanted to monitor if possible, their criteria and processes for working with service providers in the field of business social analytics, their needs which are not fully met by service providers, their suggestions on service improvement and their reflections on how internal and external customer data can be analyzed with an integrated approach.Originality/valueThis research is an attempt to bridge the gap between the priorities of engineers who generate artificial intelligence for the purposes of social listening and analytics and the end users, e.g. corporate communication professionals. Only by doing so, this field, which is getting more and more important as people spend more time online, will reach its full potential and benefit corporations by providing fruitful insight upon which strategic steps can be taken.", "venue": "Corporate Communications. An International Journal", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2023-01-06", "journal": {"name": "Corporate Communications: An International Journal"}, "authors": [{"authorId": "2067233587", "name": "Şenay Yavuz"}, {"authorId": "2200636490", "name": "Engin Tire"}], "citations": [{"paperId": "5a3984f992bdb8cc3899bcc828585ac1cea79833", "title": "Toward better informed business decisions"}]}
