{"paperId": "cb87eca186cd343222fcfe75b373b2cc88f8e777", "publicationVenue": {"id": "ee60367a-ff4b-4ed1-849e-d747fdbfae4b", "name": "Data Technologies and Applications", "alternate_names": ["Data Technol Appl"], "issn": "2514-9288", "url": "https://www.emerald.com/insight/publication/issn/2514-9288", "alternate_urls": ["http://www.emeraldinsight.com/loi/dta"]}, "title": "Dynamic Distributed and Parallel Machine Learning algorithms for big data mining processing", "abstract": "PurposeThis work can be used as a building block in other settings such as GPU, Map-Reduce, Spark or any other. Also, DDPML can be deployed on other distributed systems such as P2P networks, clusters, clouds computing or other technologies.Design/methodology/approachIn the age of Big Data, all companies want to benefit from large amounts of data. These data can help them understand their internal and external environment and anticipate associated phenomena, as the data turn into knowledge that can be used for prediction later. Thus, this knowledge becomes a great asset in companies' hands. This is precisely the objective of data mining. But with the production of a large amount of data and knowledge at a faster pace, the authors are now talking about Big Data mining. For this reason, the authors’ proposed works mainly aim at solving the problem of volume, veracity, validity and velocity when classifying Big Data using distributed and parallel processing techniques. So, the problem that the authors are raising in this work is how the authors can make machine learning algorithms work in a distributed and parallel way at the same time without losing the accuracy of classification results. To solve this problem, the authors propose a system called Dynamic Distributed and Parallel Machine Learning (DDPML) algorithms. To build it, the authors divided their work into two parts. In the first, the authors propose a distributed architecture that is controlled by Map-Reduce algorithm which in turn depends on random sampling technique. So, the distributed architecture that the authors designed is specially directed to handle big data processing that operates in a coherent and efficient manner with the sampling strategy proposed in this work. This architecture also helps the authors to actually verify the classification results obtained using the representative learning base (RLB). In the second part, the authors have extracted the representative learning base by sampling at two levels using the stratified random sampling method. This sampling method is also applied to extract the shared learning base (SLB) and the partial learning base for the first level (PLBL1) and the partial learning base for the second level (PLBL2). The experimental results show the efficiency of our solution that the authors provided without significant loss of the classification results. Thus, in practical terms, the system DDPML is generally dedicated to big data mining processing, and works effectively in distributed systems with a simple structure, such as client-server networks.FindingsThe authors got very satisfactory classification results.Originality/valueDDPML system is specially designed to smoothly handle big data mining classification.", "venue": "Data Technologies and Applications", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-12-21", "journal": {"name": "Data Technol. Appl.", "pages": "558-601", "volume": "56"}, "authors": [{"authorId": "80737636", "name": "Laouni Djafri"}], "citations": [{"paperId": "9984067b0f6a1dd646fbcded76c74adb03ef6062", "title": "Study on Key Technologies of Cancer Surveillance and Early Warning based on Data Mining"}, {"paperId": "57550fa7ad1a59e2f2eee636d049f8a783292b91", "title": "College English Score Analysis Based on Data Mining Algorithm"}]}
