{"paperId": "cb8cb369762fe8365c60713b681e7f0a46e1c30c", "publicationVenue": {"id": "da36c48c-5d3a-40f6-934c-14a6dc0fbebc", "name": "International Conference on Information Communication and Management", "type": "conference", "alternate_names": ["ICICM", "Int Conf Inf Commun Manag"]}, "title": "Mr_Kru: Accelerator of Kruskal’s Algorithm for Finding Root Node in Parallel", "abstract": "Minimum Spanning Tree(MST) is widely used in VLSI design, network routing, human brain network analysis and other fields. Kruskal’s algorithm is one of the classical methods to find the minimum spanning tree. Aiming at the problem that the root node search time accounts for a high proportion of the Kruskal’s algorithm, according to the characteristics of real world graph data, this paper presents a hardware accelerator Mr-Kru for the Kruskal’s algorithm to find the root node in parallel based on the Coordinate(COO) compression format. In this paper, the prototype system is built on the Virtex UltraScale+VCU118 evaluation platform, and complete the hardware testing of Mr_Kru based on four different datasets. The experimental results show that the running time of parallel mode is 34.9%~41.6% lower than that of serial mode. The resource cost is 97.6% and 99.6% lower than that of the comparative literature. Vivado simulation power consumption is 2. 671W.", "venue": "International Conference on Information Communication and Management", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-10-28", "journal": {"name": "2022 7th International Conference on Integrated Circuits and Microsystems (ICICM)", "pages": "230-235"}, "authors": [{"authorId": "3314658", "name": "Junyong Deng"}, {"authorId": "2185510101", "name": "Baoxiang Zhang"}, {"authorId": "2185585770", "name": "Xiaoliang Fu"}, {"authorId": "150345021", "name": "Xiaoyan Xie"}, {"authorId": "2201664103", "name": "Jingwen Deng"}, {"authorId": "46218030", "name": "Zekun Ye"}], "citations": []}
