{"paperId": "cb96c9feca7fec039f02f2830eeb6fc737805694", "publicationVenue": {"id": "d80d58be-58fc-4181-a397-5ac6fd976a47", "name": "ACM Symposium on Applied Computing", "type": "conference", "alternate_names": ["Sel Area Cryptogr", "Int Conf Sel area Cryptogr", "International Conference on Selected areas in Cryptography", "ACM Symp Appl Comput", "Selected Areas in Cryptography", "Symposium on Applied Computing", "SAC", "Symp Appl Comput"], "url": "https://www.acm.org/publications", "alternate_urls": ["http://sacworkshop.org/"]}, "title": "An analysis of mapping strategies for storing RDF data into NoSQL databases", "abstract": "RDF and SPARQL are increasingly considered in a broad range of information management scenarios. Governments, large corporations, startups, open data initiatives and other organizations are using RDF as a data model with the purpose of sharing information and knowledge in several domains. In such scenario, scalability is the main issue for virtually all the recently proposed triplestores. Thus, many triplestores are employing NoSQL databases on their storage layers. In this paper we present a survey about mapping strategies for storing RDF data into NoSQL databases. Most of them considers the query response as the main measure for the quality of the approach. Thus, the impact of the mapping design is hidden behind optimization, partitioning and indexing issues. The main contribution of this survey is to discuss the benefits and disadvantages of each strategy.", "venue": "ACM Symposium on Applied Computing", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Review"], "publicationDate": "2020-03-29", "journal": {"name": "Proceedings of the 35th Annual ACM Symposium on Applied Computing"}, "authors": [{"authorId": "2571332", "name": "L. H. Z. Santana"}, {"authorId": "2245614", "name": "R. Mello"}], "citations": [{"paperId": "104b95d349948e196b49eba101ea8bf14c8a73dc", "title": "Graph-based data management system for efficient information storage, retrieval and processing"}, {"paperId": "e6d63633111bf80478001a765e4bb1dcb56c98b5", "title": "Efficient distributed path computation on RDF knowledge graphs using partial evaluation"}, {"paperId": "738b9bb11968658de7833bdfc5c6dff386646c12", "title": "An adaptive spark-based framework for querying large-scale NoSQL and relational databases"}, {"paperId": "037891f3cec1f81bfb2fec10e9b294bb25845384", "title": "A survey of RDF stores & SPARQL engines for querying knowledge graphs"}, {"paperId": "edb54ffbcfe1c12c7b6d041a22641f62ef7b13bd", "title": "GDBApex: A graph‐based system to enable efficient transformation of enterprise infrastructures"}]}
