{"paperId": "cbacf70da2d2b09263ead72561002e5f8cb4b184", "publicationVenue": {"id": "0686efd1-27c4-44b9-ab7a-f274b68b4613", "name": "Sains Malaysiana", "type": "journal", "alternate_names": ["Sains Malays"], "issn": "0126-6039", "url": "http://ejournal.ukm.my/jsm/index"}, "title": "A New Single Linkage Robust Clustering Outlier Detection Procedures for Multivarite Data", "abstract": "Outliers are abnormal data, and the detection of outliers in multivariate data has always been of interest. Unlike univariate data, outlier detection for multivariate data is insufficient with a visual inspection. In this study, we developed a new single linkage robust clustering outlier detection procedure for multivariate data. A robust estimator, Test on Covariance (TOC) is used to robustified the similarity distance measure, producing robust single linkage clustering. The performance of the new single linkage robust clustering outlier detection procedure is investigated via a simulation study using three outlier scenarios and historical multivariate datasets as illustrative examples. Three performance measures are used, which are pout, pmask, and pswamp. The performance of the new single linkage robust clustering procedure also compared with single linkage clustering using Euclidean and Mahalanobis distances as similarity distance measures as well as TOC. It is found that the new single linkage robust clustering procedure performs well in Outlier Scenario 3 when the mean and covariance matrix are shifted. The new procedure also performs well by successfully detecting all outliers, does not have masking effects in two out of five datasets and does not have swamping effect in all datasets. In conclusion, the new single linkage robust clustering outlier detection procedure is a practical and promising approach and good for simultaneously identifying multiple outliers in multivariate data.", "venue": "Sains Malaysiana", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-31", "journal": {"name": "Sains Malaysiana"}, "authors": [{"authorId": "2130071417", "name": "Sharifah Sakinah Syed Abd Mutalib"}, {"authorId": "33289468", "name": "S. Z. Satari"}, {"authorId": "79709928", "name": "W. N. S. Wan Yusoff"}], "citations": []}
