{"paperId": "cbb0fedc8da15f8028606da720846af7d91b3604", "publicationVenue": {"id": "027ffd21-ebb0-4af8-baf5-911124292fd0", "name": "bioRxiv", "type": "journal", "url": "http://biorxiv.org/"}, "title": "Molecular insights from conformational ensembles using Machine Learning", "abstract": "Biomolecular simulations are intrinsically high dimensional and generate noisy datasets of ever increasing size. Extracting important features in the data is crucial for understanding the biophysical properties of molecular processes, but remains a big challenge. Machine learning (ML) provides powerful dimensionality reduction tools. However, such methods are often criticized to resemble black boxes with limited human-interpretable insight. We use methods from supervised and unsupervised ML to efficiently create interpretable maps of important features from molecular simulations. We benchmark the performance of several methods including neural networks, random forests and principal component analysis, using a toy model with properties reminiscent of macromolecular behavior. We then analyze three diverse biological processes: conformational changes within the soluble protein calmodulin, ligand binding to a G protein-coupled receptor and activation of an ion channel voltage-sensor domain, unravelling features critical for signal transduction, ligand binding and voltage sensing. This work demonstrates the usefulness of ML in understanding biomolecular states and demystifying complex simulations. STATEMENT OF SIGNIFICANCE Understanding how biomolecules function requires resolving the ensemble of structures they visit. Molecular dynamics simulations compute these ensembles and generate large amounts of data that can be noisy and need to be condensed for human interpretation. Machine learning methods are designed to process large amounts of data, but are often criticized for their black-box nature and have historically been modestly used in the analysis of biomolecular systems. We demonstrate how machine learning tools can provide an interpretable overview of important features in a simulation dataset. We develop a protocol to quickly perform data-driven analysis of molecular simulations. This protocol is applied to identify the molecular basis of ligand binding to a receptor and of voltage sensitivity of an ion channel.", "venue": "bioRxiv", "year": 2019, "fieldsOfStudy": ["Computer Science", "Biology"], "publicationTypes": ["Review"], "publicationDate": "2019-07-07", "journal": {"name": "bioRxiv"}, "authors": [{"authorId": "95566541", "name": "Oliver Fleetwood"}, {"authorId": "3249073", "name": "M. Kasimova"}, {"authorId": "30427104", "name": "Annie M. Westerlund"}, {"authorId": "6066455", "name": "L. Delemotte"}], "citations": [{"paperId": "f93af0f35fbeda77cab62f59d371d99aa1353698", "title": "Unexpected Dynamics in the UUCG RNA Tetraloop"}, {"paperId": "d1d7acd707a5a9bb956fcaa71112945a53bbd784", "title": "Energy landscapes reveal agonist control of GPCR activation via microswitches"}]}
