{"paperId": "cbcd6312f4bbaa32635ef92a62b453a005011878", "publicationVenue": null, "title": "Demystifying memory access patterns of FPGA-based graph processing accelerators", "abstract": "Recent advances in reprogrammable hardware (e. g., FPGAs) and memory technology (e. g., DDR4, HBM) promise to solve performance problems inherent to graph processing like irregular memory access patterns on traditional hardware (e. g., CPU). While several of these graph accelerators were proposed in recent years, it remains difficult to assess their performance and compare them on common graph workloads and accelerator platforms, due to few open source implementations and excessive implementation effort. In this work, we build on a simulation environment for graph processing accelerators, to make several existing accelerator approaches comparable. This allows us to study relevant performance dimensions such as partitioning schemes and memory technology, among others. The evaluation yields insights into the strengths and weaknesses of current graph processing accelerators along these dimensions, and features a novel in-depth comparison.", "venue": "GRADES-NDA@SIGMOD", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2021-03-31", "journal": {"name": "Proceedings of the 4th ACM SIGMOD Joint International Workshop on Graph Data Management Experiences & Systems (GRADES) and Network Data Analytics (NDA)"}, "authors": [{"authorId": "1411128014", "name": "Jonas Dann"}, {"authorId": "144405144", "name": "Daniel Ritter"}, {"authorId": "1731123", "name": "H. Fröning"}], "citations": [{"paperId": "fcf19209e7778105a84d306c90aed6dd6a1757d6", "title": "GraphScale: Scalable Processing on FPGAs for HBM and Large Graphs"}, {"paperId": "d5941acfaa0e49260aad12ad81f5aecbec3a7883", "title": "Distributed large-scale graph processing on FPGAs"}, {"paperId": "4c5ade2bc12db4aa6b83f9cbfc134c9772fe9731", "title": "GraphScale: Scalable Bandwidth-Efficient Graph Processing on FPGAs"}, {"paperId": "8f97d21ff6e4c8d72ca93858fe14dd85547de445", "title": "PipeJSON: Parsing JSON at Line Speed on FPGAs"}, {"paperId": "c77fc58ce704281cf9ade444a1f8c6d36ea401e7", "title": "A Breadth-First Search Algorithm Accelerator Based on CSCI Graph Data Format"}, {"paperId": "d0ecffd78981d6bb85dec8b6ed27fc55a01179bf", "title": "Non-relational Databases on FPGAs: Survey, Design Decisions, Challenges"}, {"paperId": "985da4fdfd5076d31e518e4aca5f968909b05c05", "title": "DASH: Asynchronous Hardware Data Processing Services"}]}
