{"paperId": "cbd7a1500ebff4192316112f3c084719c5aa5dd4", "publicationVenue": {"id": "d80d58be-58fc-4181-a397-5ac6fd976a47", "name": "ACM Symposium on Applied Computing", "type": "conference", "alternate_names": ["Sel Area Cryptogr", "Int Conf Sel area Cryptogr", "International Conference on Selected areas in Cryptography", "ACM Symp Appl Comput", "Selected Areas in Cryptography", "Symposium on Applied Computing", "SAC", "Symp Appl Comput"], "url": "https://www.acm.org/publications", "alternate_urls": ["http://sacworkshop.org/"]}, "title": "StorNIR, a multi-objective replica placement strategy for cloud federations", "abstract": "Federation of clouds makes it possible to transparently extend the resources of Cloud Service Providers (CSPs). For storage services several metrics need to be considered to satisfy customers QoS, that is storage performance, network latency and data availability. Data replication is a key strategy to optimize such metrics. For a CSP, member of a Federation, an effective placement of customers data object replicas is crucial to satisfy QoS demands. In this paper, we modeled the replica placement problem as a multi-objective optimization problem (MOOP) taking into account the local storage classes, other federation CSPs (external) storage services, and customers requirements. To solve this problem, we propose StorNIR a cost-efficient data object Storing scheme based on NSGAII upgraded with Injection and Reparation operators. StorNIR is a matheuristic that consists in hybridizing an exact method with NSGAII meta-heuristic. A repair operator was designed to make the solutions feasible with regards to the system constraints (storage volume, IOPs, etc). StorNIR performed better than both NSGAII meta-heuristic and the exact method in terms of quality of solutions and scalability. The repair function improves the NSGAII meta-heuristic up to 7 times with 7.4% more extra time execution. On average, StorNIR enhances by 17 times the quality of the initial solutions calculated by CPLEX in terms of Hypervolume. In addition, the designed matheuristic approach can be generalized to other meta-heuristics than NSGAII such as MOPSO meta-heuristic.", "venue": "ACM Symposium on Applied Computing", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2021-03-22", "journal": {"name": "Proceedings of the 36th Annual ACM Symposium on Applied Computing"}, "authors": [{"authorId": "2078436940", "name": "Amina Chikhaoui"}, {"authorId": "31618580", "name": "L. Lemarchand"}, {"authorId": "3006590", "name": "K. Boukhalfa"}, {"authorId": "2537219", "name": "Jalil Boukhobza"}], "citations": [{"paperId": "c820e65f8175cf4599a890925057c9db901d207c", "title": "SkyPIE: A Fast & Accurate Oracle for Object Placement"}, {"paperId": "bd4d625877a9fd0d1ac1069a3915dc0ec033aede", "title": "Improving big data analytics data processing speed through map reduce scheduling and replica placement with HDFS using genetic optimization techniques"}, {"paperId": "4458dd0448b93ae5dc5a06cf3481a5ec71b25413", "title": "Investigating Multi-Tier and QoS-Aware Caching Based on ARC"}, {"paperId": "c28cb52a0be1ff70c002c33d6c1a6e95be45ce81", "title": "Cost Optimization for Cloud Storage from User Perspectives: Recent Advances, Taxonomy, and Survey"}, {"paperId": "e3912e208cd67bf38214deddd41a221845d8e3b8", "title": "SONG: A Multi-Objective Evolutionary Algorithm for Delay and Energy Aware Facility Location in Vehicular Fog Networks"}, {"paperId": "3ccc45d50f0b397078caae01a045fab763e76220", "title": "Low Latency Deployment of Service-based Data-intensive Applications in Cloud-Edge Environment"}, {"paperId": "99147f83a92e5e3f8d5ee5aabda2e641e7dec4a0", "title": "When IoT Data Meets Streaming in the Fog"}]}
