{"paperId": "cbe87180a7999919d8e1915c1805c72fed1f288a", "publicationVenue": {"id": "1cd505d9-195d-4f99-b91c-169e872644d4", "name": "Energies", "type": "journal", "issn": "1996-1073", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-155563", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-155563", "https://www.mdpi.com/journal/energies", "http://www.mdpi.com/journal/energies"]}, "title": "Fault Detection and Diagnosis Encyclopedia for Building Systems: A Systematic Review", "abstract": "This review aims to provide an up-to-date, comprehensive, and systematic summary of fault detection and diagnosis (FDD) in building systems. The latter was performed through a defined systematic methodology with the final selection of 221 studies. This review provides insights into four topics: (1) glossary framework of the FDD processes; (2) a classification scheme using energy system terminologies as the starting point; (3) the data, code, and performance evaluation metrics used in the reviewed literature; and (4) future research outlooks. FDD is a known and well-developed field in the aerospace, energy, and automotive sector. Nevertheless, this study found that FDD for building systems is still at an early stage worldwide. This was evident through the ongoing development of algorithms for detecting and diagnosing faults in building systems and the inconsistent use of the terminologies and definitions. In addition, there was an apparent lack of data statements in the reviewed articles, which compromised the reproducibility, and thus the practical development in this field. Furthermore, as data drove the research activity, the found dataset repositories and open code are also presented in this review. Finally, all data and documentation presented in this review are open and available in a GitHub repository.", "venue": "Energies", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-06-15", "journal": {"name": "Energies"}, "authors": [{"authorId": "2170939819", "name": "S. P. Melgaard"}, {"authorId": "2016812566", "name": "K. Andersen"}, {"authorId": "1412904365", "name": "A. Marszal-Pomianowska"}, {"authorId": "13585445", "name": "R. L. Jensen"}, {"authorId": "29992909", "name": "P. Heiselberg"}], "citations": [{"paperId": "5afc1c668b801e96349e9152a51a98f28d701b0f", "title": "AI in HVAC fault detection and diagnosis: A systematic review"}, {"paperId": "9be0178ead8070e61954785d12745968b97782c8", "title": "Barriers and drivers for implementation of automatic fault detection and diagnosis in buildings and HVAC systems: An outlook from industry experts"}, {"paperId": "a6111c47df9c69c109d710d0b4ee16eafc153405", "title": "A fault-tolerant control strategy to estimate and compensate the temperature sensor bias in supermarket refrigeration systems."}, {"paperId": "42d08757523a97af1f6383fc5d69adfce0413d95", "title": "Towards automated fault detection and diagnosis in district heating customers: generation and analysis of a labeled dataset with ground truth"}, {"paperId": "a96024694aa3d21159cd0bd0486dd4f31ebebfac", "title": "An easy to set up residual generator based on multilayer perceptron networks and Bayesian optimisation for the application in automated fault detection and diagnosis in building systems"}, {"paperId": "b29f13e34f728f9d1344bed28890a9c93df1ef44", "title": "Generation and evaluation of a synthetic dataset to improve fault detection in district heating and cooling systems"}, {"paperId": "a9171b943fcae895c8124f66f0d21d671e2414f7", "title": "Implementation of the IDAIC Framework on an Air Handling Unit to Transition to Proactive Maintenance"}, {"paperId": "89f1ee0464bc40d09206f3427c1f2e6ad5ffb644", "title": "Data-Driven Fault Detection and Diagnosis: Research and Applications for HVAC Systems in Buildings"}, {"paperId": "35aa144f11fcff61511c5e38f016d68494e2247f", "title": "A Review of Data-Driven Approaches and Techniques for Fault Detection and Diagnosis in HVAC Systems"}, {"paperId": "fb737a640906e8d6765948f2267fe4cce10f9589", "title": "MIoTA: Modeling IoT applications for air conditioning facilities with ADOxx"}]}
