{"paperId": "cbfe63f286935cad30e6b5815ec5bb4fded0a196", "publicationVenue": {"id": "8937aa20-f87c-4e3b-b9b7-4da18531626b", "name": "Applied Geography", "type": "journal", "alternate_names": ["Appl Geogr"], "issn": "0143-6228", "url": "http://www.elsevier.com/wps/find/journaldescription.cws_home/30390/description#description", "alternate_urls": ["https://www.journals.elsevier.com/applied-geography/", "http://www.journals.elsevier.com/applied-geography/", "http://www.sciencedirect.com/science/journal/01436228"]}, "title": "Artificial neural networks applied to landslide susceptibility: The effect of sampling areas on model capacity for generalization and extrapolation", "abstract": null, "venue": "Applied Geography", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-12-01", "journal": {"name": "Applied Geography"}, "authors": [{"authorId": "116984532", "name": "S. Gameiro"}, {"authorId": "2083161220", "name": "Eduardo Samuel Riffel"}, {"authorId": "153707810", "name": "G. G. de Oliveira"}, {"authorId": "2067984420", "name": "L. Guasselli"}], "citations": [{"paperId": "6ac06f21867a68d9c1c0f5c1f3388b1858d40402", "title": "Optimizing landslide susceptibility mapping using machine learning and geospatial techniques"}, {"paperId": "46c84b583576906dffbefd0960efd978901ee264", "title": "How do the landslide and non-landslide sampling strategies impact landslide susceptibility assessment? — A catchment-scale case study from China"}, {"paperId": "0995b40d6fa7c8fdcef660b3446b1ac5741e575a", "title": "Enhancing landslide susceptibility modelling through a novel non-landslide sampling method and ensemble learning technique"}, {"paperId": "fb18f520635d81ecf611652e49bbcd35e003e11a", "title": "Landslide susceptibility mapping using statistical and machine learning models (case study: Austria)"}, {"paperId": "39f180b1066eb01403349531b91650c9fe284dc4", "title": "Modeling and Assessment of Landslide Susceptibility of Dianchi Lake Watershed in Yunnan Plateau"}, {"paperId": "fadb100401ed9d61bba6be10157888c9d0d72bcb", "title": "Analysis of land use/land cover change (LULCC) and debris flow risks in Adama district, Ethiopia, aided by numerical simulation and deep learning-based remote sensing"}, {"paperId": "4be0ee8c33cba8f05803d4bca16ef2845bfa0768", "title": "Spatio-temporal prediction and mapping of landslides using MTInSAR-learning logistic regression and weight of evidence modeling in urban environments: a case study for the Büyükçekmece–Küçükçekmece region, İstanbul, Türkiye"}, {"paperId": "f2021a75fdd401bcab31e9d7519d3fc8a8619ff9", "title": "HR-GLDD: a globally distributed dataset using generalized deep learning (DL) for rapid landslide mapping on high-resolution (HR) satellite imagery"}, {"paperId": "798552f5d6d8466f67541457c5615d77d4355c3a", "title": "Deep Learning to Assess the Effects of Land use/Land Cover and Climate Change on Landslide Susceptibility in the Tra Khuc River Bassin of Vietnam"}, {"paperId": "ded046e2fb340704e65307c9dfd5ec26361a57d2", "title": "The influence of sampling on landslide susceptibility mapping using artificial neural networks"}, {"paperId": "7773488ce9978b23a0c379b2655d4fcb705e49b3", "title": "Landslide susceptibility mapping at sin Ho, Lai Chau province, Vietnam using ensemble models based on fuzzy unordered rules induction algorithm"}, {"paperId": "10d651bde603f3d990ef96c31d941683fdb71470", "title": "Predictive model of regional coseismic landslides’ permanent displacement considering uncertainty"}, {"paperId": "d26d32891aab3ba8cd9781b918389d0468adad96", "title": "Designing gully erosion susceptibility maps (GESM) in the Algerian Eastern Tell: a case study of the K’sob River watershed"}, {"paperId": "0d449a17ae4a9c481443b2806619d54ee751874f", "title": "Effectiveness of Newmark-based sampling strategy for coseismic landslide susceptibility mapping using deep learning, support vector machine, and logistic regression"}, {"paperId": "04fb1f3c16106447b90e85face3bcb390881924b", "title": "Application of machine learning methods for snow avalanche susceptibility mapping in the Parlung Tsangpo catchment, southeast Tibetan Plateau"}, {"paperId": "20d602a798c7c46e4cf47e65f96f599dd8836afb", "title": "Improved tree-based machine learning algorithms combining with bagging strategy for landslide susceptibility modeling"}]}
