{"paperId": "cc14c18f70031065e4d9a950d661644e90480b08", "publicationVenue": {"id": "54cdc508-6fba-4c63-8523-bbcb668fc2ca", "name": "Applied System Innovation", "alternate_names": ["Appl Syst Innov"], "issn": "2571-5577", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-1109441", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-1109441", "https://www.mdpi.com/journal/asi"]}, "title": "The Project-Based Learning Study of Insurance Information Courses to Simulate the Application of Online Analytical Processing", "abstract": "The use of data warehouses combined with online analytical processing (OLAP) platforms has become popular in Taiwan’s insurance market. However, most schools do not have an insurance data warehouse and OLAP platform for student learning in Taiwan. The researched courses are insurance information system courses for two university classes. Based on the teacher’s experience and innovativeness, those courses are integrated using the guided project-based learning approach. Students need to build a customer micro-database, analyze customer figures through pivot analysis charts, and plan marketing campaigns. The study finds a project-based learning approach is helpful to enhance students’ OLAP analysis abilities. Secondly, the research finds that the flexibility for students to choose the topic of their project is one of the key success factors. Thirdly, the evaluation share of the student’s learning scores is important for the completion of the project. Fourthly, the courses are accompanied with satisfaction questionnaires to monitor the learning results and analyze the learning satisfaction for students among course A, course B, and the college average. Those students in the two classes both have higher satisfaction scores than the college average, but there are still differences between the classes after the t-test.", "venue": "Applied System Innovation", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-03-29", "journal": {"name": "Applied System Innovation"}, "authors": [{"authorId": "2213857222", "name": "Yung-Cheng Liao"}, {"authorId": "2213545101", "name": "Mei-Su Chen"}], "citations": [{"paperId": "dd1c1e912ef3467944c330762a20d7b266918391", "title": "Research on Big Data Ad Hoc Query Technology Based on an Accident Insurance Campaign"}, {"paperId": "c796df5294699385f039949fc52ad1f428aa7c90", "title": "Project-Based Learning as a Methodology to Improve Reading and Comprehension Skills in the English Language"}]}
