{"paperId": "cc22289fb1c1a06c0b8225af1a5e3996fbf7253e", "publicationVenue": {"id": "32c90593-78aa-40de-8700-dd31a625b15a", "name": "ACM Symposium on Document Engineering", "type": "conference", "alternate_names": ["Doc Eng", "Document Engineering", "DocEng", "ACM Symp Doc Eng"], "url": "http://www.documentengineering.org/"}, "title": "Trustworthiness of spam email addresses using machine learning", "abstract": "Cybercriminals have increasingly used spam email to send scams, phishing, malware and other frauds to organisations and people. They design sophisticated and contextualised emails to make them look trustworthy for users, being the sender addresses an essential part. Although cybersecurity agencies and companies develop products and organise courses for people to detect emails patterns, spam attacks are not totally avoided yet. This work presents a proof-of-concept methodology to give the user more meaningful information about trustworthiness to detect these harmful emails. For the first time in the literature, we present an email address dataset manually labelled into two classes, low and high quality. Moreover, we extracted 18 handcrafted features based on social engineering techniques and natural language properties. We evaluated four popular machine learning classifiers and obtained the best performance with Naive Bayes, i.e., 88.17% of accuracy and 0.808 of F1-Score. Additionally, we applied the InterpretML framework to find out the most relevant properties to eventually implement an automatic system able to inform about the trustworthiness of email addresses.", "venue": "ACM Symposium on Document Engineering", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2021-08-16", "journal": {"name": "Proceedings of the 21st ACM Symposium on Document Engineering"}, "authors": [{"authorId": "1412485244", "name": "Francisco Jáñez-Martino"}, {"authorId": "1398291662", "name": "R. Alaíz-Rodríguez"}, {"authorId": "1405634022", "name": "V. González-Castro"}, {"authorId": "143836787", "name": "Eduardo FIDALGO"}], "citations": []}
