{"paperId": "cc36e3dee92ad2c59f07e325d99fa9158e2edf3b", "publicationVenue": null, "title": "Hedge Your Bets: Optimizing Long-term Cloud Costs by Mixing VM Purchasing Options", "abstract": "Cloud platforms offer the same VMs under many purchasing options that specify different costs and time commitments, such as on-demand, reserved, sustained-use, scheduled reserve, transient, and spot block. In general, the stronger the commitment, i.e., longer and less flexible, the lower the price. However, longer and less flexible time commitments can increase cloud costs for users if future workloads cannot utilize the VMs they committed to buying. Large cloud customers often find it challenging to choose the right mix of purchasing options to reduce their long-term costs, while retaining the ability to adjust capacity up and down in response to workload variations.To address the problem, we design policies to optimize long-term cloud costs by selecting a mix of VM purchasing options based on short- and long-term expectations of workload utilization. We consider a batch trace spanning 4 years from a large shared cluster for a major state University system that includes 14k cores and 60 million job submissions, and evaluate how these jobs could be judiciously executed using cloud servers using our approach. Our results show that our policies incur a cost within 41% of an optimistic optimal offline approach, and 50% less than solely using on-demand VMs.", "venue": "2020 IEEE International Conference on Cloud Engineering (IC2E)", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-04-01", "journal": {"name": "2020 IEEE International Conference on Cloud Engineering (IC2E)", "pages": "105-115"}, "authors": [{"authorId": "83959199", "name": "Pradeep Ambati"}, {"authorId": "2872746", "name": "Noman Bashir"}, {"authorId": "2064290015", "name": "D. Irwin"}, {"authorId": "2841354", "name": "M. Hajiesmaili"}, {"authorId": "2172702597", "name": "Prashant J. Shenoy"}], "citations": [{"paperId": "15e93fae20ce8364ca3f763bc2d39cdcdd386494", "title": "Cost Minimizing Reservation and Scheduling Algorithms for Public Clouds"}, {"paperId": "e1759e98bf5a26e2cc69d18e161ed671f0b8961c", "title": "The Online Pause and Resume Problem: Optimal Algorithms and An Application to Carbon-Aware Load Shifting"}, {"paperId": "6e7150fe2285343b35d11ffeb4da6bd682d28daa", "title": "CEDULE+: Resource Management for Burstable Cloud Instances Using Predictive Analytics"}]}
