{"paperId": "cc37edc3bd201bea45861f7e0cccc229a56cc4e1", "publicationVenue": {"id": "939ba3df-4270-4ba0-ad98-ffe889f3546e", "name": "Processes", "issn": "2227-9717", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-317995", "alternate_urls": ["https://www.mdpi.com/journal/processes", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-317995"]}, "title": "Digital Twins in Pharmaceutical and Biopharmaceutical Manufacturing: A Literature Review", "abstract": "The development and application of emerging technologies of Industry 4.0 enable the realization of digital twins (DT), which facilitates the transformation of the manufacturing sector to a more agile and intelligent one. DTs are virtual constructs of physical systems that mirror the behavior and dynamics of such physical systems. A fully developed DT consists of physical components, virtual components, and information communications between the two. Integrated DTs are being applied in various processes and product industries. Although the pharmaceutical industry has evolved recently to adopt Quality-by-Design (QbD) initiatives and is undergoing a paradigm shift of digitalization to embrace Industry 4.0, there has not been a full DT application in pharmaceutical manufacturing. Therefore, there is a critical need to examine the progress of the pharmaceutical industry towards implementing DT solutions. The aim of this narrative literature review is to give an overview of the current status of DT development and its application in pharmaceutical and biopharmaceutical manufacturing. State-of-the-art Process Analytical Technology (PAT) developments, process modeling approaches, and data integration studies are reviewed. Challenges and opportunities for future research in this field are also discussed.", "venue": "Processes", "year": 2020, "fieldsOfStudy": ["Engineering"], "publicationTypes": ["Review"], "publicationDate": "2020-09-02", "journal": {"name": "Processes"}, "authors": [{"authorId": "2109307454", "name": "Yingjie Chen"}, {"authorId": "50440918", "name": "O. Yang"}, {"authorId": "51993221", "name": "Chaitanya Sampat"}, {"authorId": "1395610700", "name": "Pooja Bhalode"}, {"authorId": "1958925", "name": "R. Ramachandran"}, {"authorId": "1742309", "name": "M. Ierapetritou"}], "citations": [{"paperId": "991b9bc8e165447f5300822369d040fb6689071a", "title": "The progress and trend of digital twin research over the last 20 years: A bibliometrics-based visualization analysis"}, {"paperId": "ac287bfb711d30251419c048faa61e6849f389b2", "title": "Mathematical Modeling of Extrusion Agglomeration"}, {"paperId": "a42a1980333889eeaa1ca9f6bc9bab010063ca9c", "title": "Computational toolkits for model-based design and optimization"}, {"paperId": "a21e41f485bc29a9c3d64716613f86ad7eb06f58", "title": "Applications of machine learning in antibody discovery, process development, manufacturing and formulation: Current trends, challenges, and opportunities"}, {"paperId": "b0edf638f869acda7daba82ae2c03d99b8dd8259", "title": "Integrated Continuous Process Design for Crystallisation, Spherical Agglomeration, and Filtration of Lovastatin"}, {"paperId": "b5557903e6eed89e3024880a246933cf6f3a4089", "title": "Strengths and weaknesses of current and future prospects of artificial intelligence-mounted technologies applied in the development of pharmaceutical products and services"}, {"paperId": "2fba87886961b502416dace3cdaf44387629c134", "title": "Global Regulatory Frameworks for the Use of Artificial Intelligence (AI) in the Healthcare Services Sector"}, {"paperId": "ffffc765cc47eab157019f354759795cec164c08", "title": "Regression Metamodel-Based Digital Twin for an Industrial Dynamic Crossflow Filtration Process"}, {"paperId": "f201e9069d7373b2927f6211a76c0c4f1794f36c", "title": "Production digital twin: a systematic literature review of challenges"}, {"paperId": "5e7352e3d8b8ec17f25b491576d66944c3e3cb14", "title": "Machine Learning-based Optimization of a Multi-Step Ion Exchange Chromatography for Ternary Protein Separation"}, {"paperId": "d39d4f568ba86ed1dd7c47ae781ee9b4ed557e8d", "title": "Autonomous Hydrodistillation with a Digital Twin for Efficient and Climate Neutral Manufacturing of Phytochemicals"}, {"paperId": "a5da97e38b803675ed86a8cbaf92c720594d874d", "title": "Realization of digital twin for dynamic control toward sample variation of ion exchange chromatography in antibody separation."}, {"paperId": "6b263ed4febc37a8de36215aa32ef114887cb656", "title": "Industrial internet of things: What does it mean for the bioprocess industries?"}, {"paperId": "c7339fb8839d4b869b2e25e24126eef6eb7566c2", "title": "Parameter-by-parameter estimation method for adsorption isotherm in hydrophobic interaction chromatography."}, {"paperId": "cc53d85d71abaf9b9918480a9778321a8f0f3db7", "title": "Developing cyber-physical system and digital twin for smart manufacturing: Methodology and case study of continuous clarification"}, {"paperId": "60f3ac45fd86bd53ae9072f7efc23966f756c3bf", "title": "Digital Twin in High Throughput Chromatographic Process Development for Monoclonal Antibodies"}, {"paperId": "42ebfc95c429984de4bc09160879ab82890209df", "title": "Integration of Cyber-Physical Systems, Digital Twins and 3D Printing in Advanced Manufacturing: A Synergistic Approach"}, {"paperId": "67b439ae3dea586c73d67876caf990cfcbab4013", "title": "STRENGTHENING PHARMACEUTICAL SUPPLY CHAIN SECURITY IN EUROPE: SERIALIZATION AND EMERGING TECHNOLOGIES"}, {"paperId": "67a487accf27723fa4481dde14af34e1d42f069d", "title": "Continuous biomanufacturing in upstream and downstream processing"}, {"paperId": "18794043a04b31709913799459099a5f113c0eb0", "title": "Population balance model enabled digital design and uncertainty analysis framework for continuous crystallization of pharmaceuticals using an automated platform with full recycle and minimal material use"}, {"paperId": "3e45746ec743f088e348226877965acb5067e3be", "title": "Artificial intelligence-driven systems engineering for next-generation plant-derived biopharmaceuticals"}, {"paperId": "98ec4e8517195cf7605c085522a88c028f9efeec", "title": "Digital Twins in Healthcare: Methodological Challenges and Opportunities"}, {"paperId": "363c74f4d99917bef9f446e2508e1ad937561b54", "title": "Analysing Industry 4.0 technology-solution dependencies: a support framework for successful Industry 4.0 adoption in the product generation process"}, {"paperId": "40ad5805958d1b9a9555e7d607f799566ac96713", "title": "ROLE OF PHARMA DIGITALIZATION IN HEALTHCARE DEVELOPMENTS"}, {"paperId": "6979d339d3f3c329f63d422a049230d485cb0889", "title": "Current challenges and recent advances on the path towards continuous biomanufacturing"}, {"paperId": "236cfc48b1315dd0c7f518e2697baaf08d585ec3", "title": "Adaptable control policies for variable liquid chromatography columns using deep reinforcement learning"}, {"paperId": "9d2690f99caebf42c9726d86e86a497822c99781", "title": "CMC Strategies and Advanced Technologies for Vaccine Development to Boost Acceleration and Pandemic Preparedness"}, {"paperId": "ccfd6c2d914515ce1f7f6a63dbabb84a7d1a0391", "title": "Digital Twin Implementation for Manufacturing of Adjuvants"}, {"paperId": "92517585913c757f99392456775804e22d60e765", "title": "Using artificial neural networks to accelerate flowsheet optimization for downstream process development."}, {"paperId": "78a2a6a6ef7d01e877d2d2ea3244507d5544e27d", "title": "Hybrid modeling for biopharmaceutical processes: advantages, opportunities, and implementation"}, {"paperId": "d1d8ca34f0f62e5ae258d9d37f47f62a787294ff", "title": "Automated quality analysis in continuous downstream processes for small-scale applications."}, {"paperId": "5d5269cc420ef4e6e3c0052e1a378e7c4bb4a3f5", "title": "Hybrid model development for parameter estimation and process optimization of hydrophobic interaction chromatography."}, {"paperId": "87fc06860f8a2d1cce6394c3521a3c0023316147", "title": "An integrated data management and informatics framework for continuous drug product manufacturing processes: A case study on two pilot plants."}, {"paperId": "795bba1a2a72a20d98af0b8679dc3c5278259c7d", "title": "Digital Twins in Wind Energy: Emerging Technologies and Industry-Informed Future Directions"}, {"paperId": "96a85d7f537dc7bd83b272955d97d9bfad5e7ed1", "title": "A CFD model with free surface tracking: predicting fill level and residence time in a starve-fed single-screw extruder"}, {"paperId": "f1ec3f59fc3db06716d6b83a70d9f2c64f234063", "title": "A dynamic model of tablet film coating processes for control system design"}, {"paperId": "232647fad818a5eddd099aee7aca464a773c4b45", "title": "Digital twin for smart manufacturing, A review"}, {"paperId": "48da15f692758f0c4dfe725acfaaf13c1d0e75b1", "title": "Methodology for the Development of Virtual Representations within the Process Development Framework of Energy Plants: From Digital Model to Digital Predictive Twin—A Review"}, {"paperId": "392566847536a726210e4fe8096373bbd444f143", "title": "Control of a complex multistep process for the production of mesalazine"}, {"paperId": "8bebd126647c9c9a26e89e8896e5d3589015e5d7", "title": "Extending the capability of component digital threads using material passports"}, {"paperId": "a425fb3e16acb05e8495f957279f011f6fce8c54", "title": "Digital Twins in Industry 5.0"}, {"paperId": "0c1dc8c91c7ddc43d60ae1b3fec252c6e32c781f", "title": "Future directions in regulatory affairs"}, {"paperId": "92169af3a7c89e27bc0f9bd58d05af2b2bf752b7", "title": "Digital twin in healthcare: Recent updates and challenges"}, {"paperId": "215e8afa2b04ddbd6769c0c115d0cbd432376ec5", "title": "Digitale Zwillinge in der Bioprozesstechnik – Chancen und Möglichkeiten"}, {"paperId": "58f8f404bd81a1942bd8ec5964b2b131ec26ea8e", "title": "Prediction of Mefenamic Acid Crystal Shape by Random Forest Classification"}, {"paperId": "c2b58ee98e45d5d4e03e97bb650cd1dd35417cd1", "title": "Automated assembly of hybrid dynamic models for CHO cell culture processes"}, {"paperId": "5a74257b0255b0ca4a271d90c4dbf67d926e8819", "title": "Optimization of key energy and performance metrics for drug product manufacturing."}, {"paperId": "4ac9a6068ab8854b83271098f34dab89c9f00255", "title": "A scoping review of supervised learning modelling and data-driven optimisation in monoclonal antibody process development"}, {"paperId": "63d2f88b6d3d912d5898b18e8c796c19779d4823", "title": "Deep learning in drug discovery: an integrative review and future challenges"}, {"paperId": "13cfe745d2860c88e1ea031ab2d4e240a885176a", "title": "Machine learning in bioprocess development: From promise to practice"}, {"paperId": "908d67ff9cecdc47b8ada58f92b5f5400a08b19b", "title": "Architectural and Technological Improvements to Integrated Bioprocess Models towards Real-Time Applications"}, {"paperId": "b0f2b2824c34a713ba83573eb685ce7e78d5a070", "title": "Digitization in bioprocessing: The role of soft sensors in monitoring and control of downstream processing for production of biotherapeutic products"}, {"paperId": "0c6a02133896ae125ee2e1fe049b58d2be406b3e", "title": "Simulation-based digital twin for predictive maintenace"}, {"paperId": "202ea4d9f5d529d5b1eaab21b6433f17520614e3", "title": "Continuous integrated manufacturing for biopharmaceuticals: A new paradigm or an empty promise?"}, {"paperId": "2226288cc10ab29985c79890a2c7aa76c5932653", "title": "Process design of a fully integrated continuous biopharmaceutical process using economic and ecological impact assessment"}, {"paperId": "7b4a04095474701b05109d11449dc9ed98a0d04a", "title": "Digital Twins in Healthcare: An Architectural Proposal and Its Application in a Social Distancing Case Study"}, {"paperId": "72ea487ccee6c4932413cff41ef07f1ec40499fa", "title": "Process Model Inversion in the Data-Driven Engineering Context for Improved Parameter Sensitivities"}, {"paperId": "885a33c53b136007f928b0abcdd65f218784cc56", "title": "The interplay of emerging technologies in pharmaceutical supply chain performance: An empirical investigation for the rise of Pharma 4.0"}, {"paperId": "25d50e0a4ce39c00fb86b4b2b4c25cce23cde350", "title": "HT-TPP: A Hybrid Twin Architecture for Thermal Power Plant Collaborative Condition Monitoring"}, {"paperId": "8328a14280eaaa07282c57bec16a9f9e3aa7ebc1", "title": "Application of Artificial Neural Networks in the Process Analytical Technology of Pharmaceutical Manufacturing—a Review"}, {"paperId": "0468d47c18d29be64653b4fe2f65ad4f76939c81", "title": "Advanced data modeling for industrial drying machine energy optimization"}, {"paperId": "23985e04a83e398432afd67b1bb2a1609c3cdd1b", "title": "Automation of Modeling and Calibration of Integrated Preparative Protein Chromatography Systems"}, {"paperId": "138f8c4764ee0423174ca61d2c64d1e42be06736", "title": "Digital Twin for HIV-Gag VLP Production in HEK293 Cells"}, {"paperId": "fe77c0c64540df600609ea13b08207033af5c2b6", "title": "Digital Twins for scFv Production in Escherichia coli"}, {"paperId": "11906c671a88a147c866d4fa0e18ad7f2e8488e1", "title": "Expanding the Horizons of Manufacturing, towards Wide Integration, Smart System, and Tools"}, {"paperId": "2546c061fe056de0bb1024ecb80b19f38de8bea8", "title": "Industry 4.0 in Action: Digitalisation of a Continuous Process Manufacturing for Formulated Products"}, {"paperId": "9ff93c700ebe9051b7df1efa5015beae450be3f9", "title": "Holistic Process Models: A Bayesian Predictive Ensemble Method for Single and Coupled Unit Operation Models"}, {"paperId": "9eaab8e9f18975a954b1707a8c04562c00afcd5f", "title": "Investigating the Trade-Off between Design and Operational Flexibility in Continuous Manufacturing of Pharmaceutical Tablets: A Case Study of the Fluid Bed Dryer"}, {"paperId": "6950bc2dae6f0a637e7b5e5a942e63ab6e4f5acc", "title": "Process Design and Optimization towards Digital Twins for HIV-Gag VLP Production in HEK293 Cells, including Purification"}, {"paperId": "a2da7ff180e58236b26a6c1a83881ac17956e27e", "title": "The application of digital twin technology in operations and supply chain management: a bibliometric review"}, {"paperId": "5dd876e815461905fad649cb6321d2f65826ba87", "title": "Implementation of digital twins in the process industry: A systematic literature review of enablers and barriers"}, {"paperId": "9017411c83a7bbe88451aa9e52e148e3e303fef5", "title": "Enablers of continuous processing of biotherapeutic products."}, {"paperId": "b28a959c82e456a49521256e0e1e4d09e1eb434d", "title": "A Scoping Review of Digital Twins in the Context of the Covid-19 Pandemic"}, {"paperId": "e06c2b92e8e5aa81fd1bd937542b045f889eede4", "title": "Can a Byte Improve Our Bite? An Analysis of Digital Twins in the Food Industry"}, {"paperId": "01919b8f5c0123272ea10374349780d07119d184", "title": "Control of Continuous Manufacturing Processes for Production of Monoclonal Antibodies"}, {"paperId": "b2a91d7182ad903119a3b84b866abf715b0f792c", "title": "Automated High-Throughput Partition Coefficient Determination with Image Analysis for Rapid Reaction Workup Process Development and Modeling"}, {"paperId": "8bd3fd135e0b9cc37706ba5563c5d8325259e577", "title": "Hybrid modeling — a key enabler towards realizing digital twins in biopharma?"}, {"paperId": "83c79f81bc80100c6a407297877ba5286ddf5221", "title": "How Technological Innovation Affect China's Pharmaceutical Smart Manufacturing Industrial Upgrading"}, {"paperId": "bac350b982af4d842ecd824f2e6c0077aad5fe9e", "title": "Digital Twins for Continuous mRNA Production"}, {"paperId": "c1f8cf0c4cabe843ae7ddc1414b67fa7c1a0e0cb", "title": "A Novel Framework of Surrogate-based Feasibility Analysis for Establishing Design Space of Twin-column Continuous Chromatography."}, {"paperId": "cac2e02b98bdb0d6d3fb73c8664ce08c0a9226f4", "title": "Digitalization in pharmaceutical industry: What to focus on under the digital implementation process?"}, {"paperId": "2afc793b5107ee3bc35548949fe7e1fa5493a317", "title": "Process Analytical Technologies - Advances in bioprocess integration and future perspectives."}, {"paperId": "b72712ef1af2aac4e4d89d32818b2c1eef1ef746", "title": "Beyond building predictive models: TwinOps in biomanufacturing"}, {"paperId": "2695f7e58a9f65afe8edf25b9eb55564177800d0", "title": "Bioprocess digital twins of mammalian cell culture for advanced biomanufacturing"}, {"paperId": "847d610ed51938a125f90b42627f6d0e57b9b402", "title": "Challenges in the Development of Soft Sensors for Bioprocesses: A Critical Review"}, {"paperId": "5bc88b141da28774cfbef762b31140defc5fcfae", "title": "Digital twins-based smart manufacturing system design in Industry 4.0: A review"}, {"paperId": "057c0de55e8657c6c3cdbfda75ddd9cafcc99582", "title": "The Impact of Industry 4.0 Paradigm on the Pharmaceutical Industry in Portugal"}, {"paperId": "29b5fb9e3e5a6989915395d60160b2426b635934", "title": "Validation Is Not Verification: Precise Terminology and Scientific Methods in Bioprocess Modeling."}, {"paperId": "3fbe04b8a9f5fe9ce1285cb1eba9dfcda41a4e4a", "title": "Hybrid Process Models in Electrochemical Syntheses under Deep Uncertainty"}, {"paperId": "dad03cb42fc7f566b387ca9c896fb403d5b486ab", "title": "A Model Proposal For Digital Twin Development: Essential Oil Extraction Perspective"}, {"paperId": "4ff427db948092da47d792cd01fc8b23a8262cb0", "title": "Towards in silico Process Modeling for Vaccines."}, {"paperId": "b64b60f733cc4f75455c8d8980fe0b035cc6d09c", "title": "Emerging Challenges and Opportunities in Pharmaceutical Manufacturing and Distribution"}, {"paperId": "90c0e43db72ff89d278d8ec810f913bed7bb9bb3", "title": "Applications of process and digital twin models for production simulation and scheduling in the manufacturing of food ingredients and products"}, {"paperId": "32f909506033bf47f0fc40952b40b1e6d730f4ce", "title": "The Digital Twin – Your Ingenious Companion for Process Engineering and Smart Production"}, {"paperId": "d5ac3aa87ebf3032ef8171f1c958629819123ecd", "title": "Industry 4.0-Driven Development of Optimization Algorithms: A Systematic Overview"}, {"paperId": "54c632f6dc07177e50402f7a492fae8236b7d4a1", "title": "Digital Twins in Process Engineering: An Overview on Computational and Numerical Methods"}, {"paperId": "16dbc184cad985e27ea2eb64379b59ed143357e5", "title": "A Network Modeling and Analysis Approach for Pharma Industry Regulatory Assessment"}, {"paperId": "f76b796e395f8db4a0d7d5263cb8a3691b831eaa", "title": "Recherche des meilleures explications d'incidents sur une ligne de production"}, {"paperId": "a63e6e7523a649c577d84aed7176a0134c6bf314", "title": "Model-Based Simulation Framework for Digital Twins in the Process Industry"}, {"paperId": "6c065b0d6b6187db743bdc9d7535ca9596378578", "title": "Modern Sensor Tools and Techniques for Monitoring, Controlling, and Improving Cell Culture Processes"}, {"paperId": "f93dbe70266e63bf2c8d365bc6aa0153b05e15eb", "title": "Human-Computer Interaction in Mobile Learning: A Review"}, {"paperId": "63eefd9f70f668133133c6eae31bc18eb0992015", "title": "Physics-Constrained Autoencoder Neural Network for the Prediction of Key Granule Properties in a Twin-Screw Granulation Process"}, {"paperId": "ae309e057cd742a55ebaf9daf035f855129c48ab", "title": "TOWARDS A DIGITAL TWIN FOR ANALYTICAL HPLC"}, {"paperId": "aac5e94b78d2ee00cdaa5e4099e0694661ec91f2", "title": "A Digital Twin for Process Optimisation in Pharmaceutical Manufacturing"}]}
