{"paperId": "cc3bcbe800cda94c96532346f2643c1519441b6d", "publicationVenue": null, "title": "Improved IoT for Health Behaviour System Based on Machine Learning Model", "abstract": "Machine learning can assist in the difficult work of extracting meaningful information from the seemingly useless data produced by IoT devices (ML). The careful deployment of hybrid technologies has reaped benefits for a wide range of institutions, including businesses, governments, schools, and hospitals. The Internet of Things (IoT) may use machine learning (ML) to identify previously hidden patterns in large volumes of data in order to create accurate forecasts and recommendations. The Internet of Things (IoT) and machine learning (ML) are being applied in the field of medicine in order to automate the process of creating medical records, predicting illness diagnoses, and, most importantly, continuously monitoring patients. On different datasets, different machine learning algorithms achieve differing degrees of success. The numerous predictions may or may not end up having an effect on the eventual result. The degree to which the results differ from one another plays a crucial part in the therapeutic decision-making process. The healthcare industry relies significantly on a variety of ML algorithms in order to successfully manage the data generated by IoT devices. In this post, we are going to talk about how popular machine learning techniques can be used in the field of medicine for categorization and prediction purposes. The objective of this study is to provide evidence that utilizing a more sophisticated ML model for the analysis of IoT health data is beneficial. After a substantial amount of time spent on the matter, we came to the realization that a number of well-known ML prediction algorithms have significant weaknesses. The type of Internet of Things dataset that is being utilized will determine the technique that will be most effective when attempting to anticipate vital health data. The paper demonstrates a number of the ways in which the Internet of Things and machine learning have affected the delivery of healthcare in a variety of settings.", "venue": "2022 2nd International Conference on Technological Advancements in Computational Sciences (ICTACS)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-10-10", "journal": {"name": "2022 2nd International Conference on Technological Advancements in Computational Sciences (ICTACS)", "pages": "755-760"}, "authors": [{"authorId": "2176228464", "name": "Anurag Shrivastava"}, {"authorId": "81356752", "name": "Midhun Chakkaravarthy"}, {"authorId": "2160875170", "name": "M. Shah"}], "citations": []}
