{"paperId": "cc3e32bc3cb6b78302ea3122e58919b31687a9d3", "publicationVenue": {"id": "1f55639d-134e-44ae-b050-ccf2a6676bc5", "name": "Knowledge and Information Systems", "type": "journal", "alternate_names": ["Knowl Inf Syst"], "issn": "0219-3116", "url": "https://link.springer.com/journal/10115"}, "title": "AQUA+: Query Optimization for Hybrid Database-MapReduce System", "abstract": "MapReduce has been widely recognized as an efficient tool for large-scale data analysis. It achieves high performance by exploiting parallelism among processing nodes while providing a simple interface for upper-layer applications. However, there are many existing applications maintaining their data in a distributed database. It is costly to export those data into the storage system of MapReduce (normally a distributed file system). Moreover, compared to MapReduce, database is equipped with many state-of-the-art techniques, such as index and optimizer. Therefore, a hybrid Database-MapReduce system inheriting the advantages of both systems is preferred. In this paper, we propose AQUA+, a query optimizer tailored for the hybrid system. AQUA+ is an extension work of our previous system AQUA. It generates a plan that adaptively assigns the operators to the database engine and MapReduce engine to optimize the performance. The intuition is to exploit the index, co-partition and other features provided by the database as much as possible and reduce the data volume processed by the MapReduce. Due to the complexity of query optimization, in AQUA+, we introduce a novel tuning technique, learning to optimize. In particular, two neural networks are trained to predict cost and refine query plan, respectively. We train them based on our log of real query processing. Experiments carried out on our in-house cluster confirm the effectiveness of our query optimizer.", "venue": "Knowledge and Information Systems", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-11-01", "journal": {"name": "Knowledge and Information Systems", "pages": "905 - 938", "volume": "63"}, "authors": [{"authorId": "9405981", "name": "Zhifei Pang"}, {"authorId": "2108869376", "name": "Sai Wu"}, {"authorId": "1474566666", "name": "Haichao Huang"}, {"authorId": "1474546191", "name": "Zhouzhenyan Hong"}, {"authorId": "2118596622", "name": "Yuqing Xie"}], "citations": [{"paperId": "0476c0e43cfb8f53eef717c1b74b18bdb9fa834b", "title": "Structured query language query join optimization by using rademacher averages and mapreduce algorithms"}, {"paperId": "91c7ebb46a31c6b062533715d7d49614ffcfe6e9", "title": "AutoSteer: Learned Query Optimization for Any SQL Database"}, {"paperId": "8549f6e6ec5ef145cff82c064ef7598e85bb93ac", "title": "A Systematic Literature Review and Future Perspectives for Handling Big Data Analytics in COVID-19 Diagnosis"}, {"paperId": "a7655a9801083b84c2d78a3b952e4acdc9bfa37a", "title": "Hybrid storage engine for geospatial data using NoSQL and SQL paradigms"}]}
