{"paperId": "cc41d37dca69c9222ddbcae7b41c1114ab926a26", "publicationVenue": {"id": "8a9e9f3b-a025-473d-801e-72cdb0653d22", "name": "IEEE Symposium Series on Computational Intelligence", "type": "conference", "alternate_names": ["IEEE Symp Ser Comput Intell", "SSCI"], "url": "http://www.ieee-ssci.org/"}, "title": "Symbolic regression for scientific discovery: an application to wind speed forecasting", "abstract": "Symbolic regression corresponds to an ensemble of techniques that allow to uncover an analytical equation from data. Through a closed form formula, these techniques provide great advantages such as potential scientific discovery of new laws, as well as explainability, feature engineering as well as fast inference. Similarly, deep learning based techniques has shown an extraordinary ability of modeling complex patterns. The present paper aims at applying a recent end-to-end symbolic regression technique, i.e. the equation learner (EQL), to get an analytical equation for wind speed forecasting. We show that it is possible to derive an analytical equation that can achieve reasonable accuracy for short term horizons predictions only using few number of features.", "venue": "IEEE Symposium Series on Computational Intelligence", "year": 2021, "fieldsOfStudy": ["Computer Science", "Physics"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-02-21", "journal": {"name": "2021 IEEE Symposium Series on Computational Intelligence (SSCI)", "pages": "01-08"}, "authors": [{"authorId": "1785349145", "name": "Ismail Alaoui Abdellaoui"}, {"authorId": "2950749", "name": "S. Mehrkanoon"}], "citations": [{"paperId": "96ee7f1559c9506f7585c9c5b6d5f31964dabaff", "title": "SymbolNet: Neural Symbolic Regression with Adaptive Dynamic Pruning"}, {"paperId": "f74cbc6e19f21cf11beae4c3e44227cd1bbdacde", "title": "Bayesian polynomial neural networks and polynomial neural ordinary differential equations"}, {"paperId": "d863fa63ee8b11ee66aa5a2f862c85e9a74a2dbd", "title": "RILS-ROLS: robust symbolic regression via iterated local search and ordinary least squares"}, {"paperId": "203560b8a0a4ab2f86e1c446efe2ca45838fdd8f", "title": "Artificial Intelligence in Physical Sciences: Symbolic Regression Trends and Perspectives"}, {"paperId": "c3faff11762dc702ccd82b145769992e4e005203", "title": "Fast training of a transformer for global multi-horizon time series forecasting on tensor processing units"}, {"paperId": "020f363fb9419903c5a4c9618b6c25718a7c6b97", "title": "Interpretable scientific discovery with symbolic regression: a review"}, {"paperId": "e546709ecf08063167e857a5220be5500874bb1b", "title": "Rethinking Symbolic Regression Datasets and Benchmarks for Scientific Discovery"}, {"paperId": "edd80013e8b9fcba9231cf99884f32e5236ff329", "title": "AA-TransUNet: Attention Augmented TransUNet For Nowcasting Tasks"}, {"paperId": "7782e3e2fbf5a5ede88ec032ad21229febd9cfab", "title": "Multistream Graph Attention Networks for Wind Speed Forecasting"}, {"paperId": "9158bb9c492fd08a243164250560c4c0ca5e93f2", "title": "TENT: Tensorized Encoder Transformer for Temperature Forecasting"}, {"paperId": "dd07ec89ad608657e73abbea40f5bd1acf0a3917", "title": "Deep coastal sea elements forecasting using U-Net based models"}, {"paperId": "33c28a0796c20142f4ddab60fd28237ba727a043", "title": "WSPTGAN for Global Ocean Surface Wind Speed Generation With High Temporal Resolution and Spatial Coverage"}, {"paperId": "e2ce35656bb83d006daa35db17993b03cf39d7b9", "title": "R ETHINKING S YMBOLIC R EGRESSION : M ORPHOLOGY AND A DAPTABILITY FOR E VOLUTIONARY A LGORITHMS"}, {"paperId": "9bdb06583add68a43d89a695ae78c2e53f0ab90b", "title": "Adaptive Case Selection for Symbolic Regression in Grammatical Evolution"}, {"paperId": "d8dcb7d090d4c11758023f19f38f80e8e7f05b2b", "title": "Towards Data-and Knowledge-Driven Artificial Intelligence: A Survey on Neuro-Symbolic Computing"}]}
