{"paperId": "cc508b92968bd285645820ba76e52138df80eac5", "publicationVenue": null, "title": "Trajectory of research on maritime transportation in the era of digitization", "abstract": "PurposeThe literature on Maritime Transportation (MT) is experiencing a transition phase where the focus of the research is repositioning. It registered steep growth in recent years with its beginning articles on the concepts of cost minimization to the current focus on achieving sustainable operational effectiveness using Information and Communication Technologies (ICTs). Thus, this becomes a right time to investigate the trajectory of research on MT.Design/methodology/approachThe proposed study aims to explore the potential of data analytics techniques such as data mining and network analytics to reflect the trajectory of research in the maritime supply chain over time. This study identifies the eight main dimensions of the research published under maritime paradigm through network analytics. The in-depth review of these dimensions rendered us to segregate them further into sub-dimensions for the ease of understanding and interpretability. Further, the text mining is employed to extract thematic evolution of the research.FindingsThe evolved themes are completely exclusive from the conventional MT research with artificial intelligence, digital storage, waste management and biofuels emerging as contemporary themes. It is found that although there are a sufficient amount of literature on sustainable port practices but their policy implications are still underexplored. The inter-dimension research is needed to achieve the motive of economic efficiency and environmental sustainability simultaneously.Originality/valueThe study has contributed on the methodology side of conducting literature reviews. The dimensions, sub-dimensions and themes are obtained using data analytics tools and techniques. This omits the possibility of personal bias and thus making the results verifiable.", "venue": "", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2021-04-29", "journal": {"name": "Benchmarking: An International Journal", "volume": ""}, "authors": [{"authorId": "2069298405", "name": "Sonali Shankar"}, {"authorId": "1518031037", "name": "Sushil Punia"}, {"authorId": "2109037835", "name": "S. P. Singh"}, {"authorId": "2117142938", "name": "Jing Dong"}], "citations": [{"paperId": "2a6df97089e4adae2be19165336cc7596753d8f3", "title": "A systematic literature review of technological developments and challenges for inland waterways freight transport in intermodal supply chain management"}, {"paperId": "eea82e097997844ff855f7fc1b67d7a4cfd7b441", "title": "Business Research and Data Mining: a Bibliometric Analysis"}, {"paperId": "f35de43f3fe1a7141bd8b8ba0d577eb0b34f25e5", "title": "Port logistic issues and challenges in the Industry 4.0 era for emerging economies: an India perspective"}, {"paperId": "36512e7e2b735c829494d58a20607890c19f13ba", "title": "Benchmarking of Singapore maritime cluster: the role of cluster facilitators"}]}
