{"paperId": "cc5e9c7a2d4be95e8daa9a2ef0460f3036a66db5", "publicationVenue": null, "title": "Vector Auto-Regression-Based Predictive model for Smart Meter", "abstract": "The rising cost of electricity is becoming a significant burden for many households. To address this issue, there is now a growing interest in the development of smart meters as monitors and controllers for electricity that can be used both in smart homes as well as further in smart cities. For example, using air conditioning in hot climates and geysers in winter can significantly increase electricity bills. To address this issue, this paper proposes a predictive model, Vector Auto regression (Vector Auto regression) (VAR) approach to anticipate electricity consumption and management using weather data based on hourly four different modules. By analyzing a dataset of various household appliance readings and corresponding weather conditions, the proposed method can predict electricity consumption with a correlation coefficient of 0.95 using the VAR method. This paper discusses the implementation possibility of predicting energy generation and consumption within 21st-century energy meters that are fully automated, manageable, and more efficient including robust capabilities of home Area Networks. After analyzing the results, this study provides a strong foundation for the prediction of accurate smart electricity consumption that can help households to predict and manage their electricity usage by regulating the use of energy-intensive appliances based on various weather conditions. We also calculate the mean absolute error during the period.", "venue": "2023 International Conference on Device Intelligence, Computing and Communication Technologies, (DICCT)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-03-17", "journal": {"name": "2023 International Conference on Device Intelligence, Computing and Communication Technologies, (DICCT)", "pages": "396-400"}, "authors": [{"authorId": "51302415", "name": "Mukta Jukaria"}, {"authorId": "2120545210", "name": "Ashutosh Upadhyay"}, {"authorId": "2153105860", "name": "Anuj Kumar"}], "citations": [{"paperId": "aaff0608ec20d711a3ca4c37c67a64107e1c76cd", "title": "Implementation of Artificial Intelligence In Engineering to Achieve Sustainable Development Goals (SDGs)"}]}
