{"paperId": "cc6869df0f126899966d6848db8c4def74274176", "publicationVenue": {"id": "b1aea3ab-edf0-430b-a9c2-cce5469f6b23", "name": "IEEE/ACM Transactions on Networking", "type": "journal", "alternate_names": ["IEEE ACM Trans Netw", "IEEE ACM Transactions on Networking", "IEEE/ACM Trans Netw"], "issn": "1063-6692", "url": "http://portal.acm.org/ton/", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=90", "https://ieeexplore.ieee.org/servlet/opac?punumber=90"]}, "title": "SFT-Box: An Online Approach for Minimizing the Embedding Cost of Multiple Hybrid SFCs", "abstract": "In Network Function Virtualization (NFV), a series of Virtual Network Functions (VNFs) organized in a specific order (called Service Function Chain, SFC) could offer an end-to-end network service for a network flow. Recently, with the new results of the exploration of VNF parallelism, hybrid SFC (SFC contains parallel VNFs) is proposed to reduce the SFC execution delay. However, it remains challenging and open to optimally embed multiple hybrid SFCs into the network. In this paper, we target at the optimal embedding problem of multiple hybrid SFCs with the purpose of minimizing the cost in an online scenario. Specifically, we propose SFT-Box, an online approach that can respond to hybrid SFC embedding requests in real-time. SFT-Box is designed to i) transform SFCs from the traditional sequential form to a standardized hierarchical Service Function Tree (SFT) form, ii) calculate and store the low-cost sub-solutions of embedding common SFTs, and iii) provide prompt solution response based on stored sub-solutions. To the best of our knowledge, this is the first work to address the online optimal embedding problem of multiple hybrid SFCs. With extensive evaluations, we demonstrate that, compared with the benchmark methods, SFT-Box can achieve up to 30% cost-saving and at least $22\\times $ latency reduction in enabling real-time response.", "venue": "IEEE/ACM Transactions on Networking", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-01", "journal": {"name": "IEEE/ACM Transactions on Networking", "pages": "1463-1477", "volume": "31"}, "authors": [{"authorId": "2120980", "name": "Xu Lin"}, {"authorId": "2068110135", "name": "Deke Guo"}, {"authorId": "2152571532", "name": "Yulong Shen"}, {"authorId": "1968264", "name": "Guoming Tang"}, {"authorId": "39016718", "name": "Bangbang Ren"}, {"authorId": "2153556154", "name": "Ming Xu"}], "citations": [{"paperId": "9fb86d3ab9108cf625d5a9bb5de04d3a8bf0c240", "title": "Energy- and Reliability-Aware Provisioning of Parallelized Service Function Chains With Delay Guarantees"}, {"paperId": "85fdf21e912b3d55cc30dc72b918601a20df6f82", "title": "Energy efficient and delay aware deployment of parallelized service function chains in NFV-based networks"}, {"paperId": "664248da8bb9c4f04294dbbc2963d1c7a55fd9a0", "title": "Delay-Aware Parallelized SFC Deployment in Space-Air-Ground-Integrated Network"}, {"paperId": "d2a490339e115dfc8d32760169bbb730ed5e9b1e", "title": "NUMA-Aware Parallelized Service Function Chain Deployment in Multi-Core Servers"}, {"paperId": "bc7508dea7712179424f36098bc3172dd8a1317f", "title": "NEST: Optimal deploying DAG-SFCs to maximize the flows wholly served in the network edge"}]}
