{"paperId": "cc6f48861c65d450742bdf0512732bc3073a36c1", "publicationVenue": {"id": "138e58fc-8643-41c2-a92c-068ea4f4c607", "name": "PeerJ Computer Science", "alternate_names": ["Peerj Comput Sci"], "issn": "2376-5992", "url": "https://peerj.com/archives/?journal=cs", "alternate_urls": ["https://peerj.com/computer-science/", "http://peerj.com/cs"]}, "title": "LSTMDD: an optimized LSTM-based drift detector for concept drift in dynamic cloud computing", "abstract": "This study aims to investigate the problem of concept drift in cloud computing and emphasizes the importance of early detection for enabling optimum resource utilization and offering an effective solution. The analysis includes synthetic and real-world cloud datasets, stressing the need for appropriate drift detectors tailored to the cloud domain. A modified version of Long Short-Term Memory (LSTM) called the LSTM Drift Detector (LSTMDD) is proposed and compared with other top drift detection techniques using prediction error as the primary evaluation metric. LSTMDD is optimized to improve performance in detecting anomalies in non-Gaussian distributed cloud environments. The experiments show that LSTMDD outperforms other methods for gradual and sudden drift in the cloud domain. The findings suggest that machine learning techniques such as LSTMDD could be a promising approach to addressing the problem of concept drift in cloud computing, leading to more efficient resource allocation and improved performance.", "venue": "PeerJ Computer Science", "year": 2024, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-01-31", "journal": {"name": "PeerJ Computer Science", "volume": "10"}, "authors": [{"authorId": "52144881", "name": "Tajwar Mehmood"}, {"authorId": "38918524", "name": "Seemab Latif"}, {"authorId": "3186993", "name": "Nor Shahida Mohd Jamail"}, {"authorId": "31144325", "name": "A. Malik"}, {"authorId": "2692781", "name": "R. Latif"}], "citations": []}
