{"paperId": "cc716c18d71ff0612888d8ad08e033d9816f834e", "publicationVenue": {"id": "6bf48d72-eba2-4918-b9a0-153280062513", "name": "International Computer Science Conference", "type": "conference", "alternate_names": ["IEEE International Conference on Semantic Computing", "IEEE International conference semantic computing", "International Conference Spatial Cognition", "Resource Track - ICSC", "Int Conf Semantic Comput", "ICSC", "Int Comput Sci Conf", "IEEE Int Conf Semantic Comput", "Int Conf Spat Cogn", "IEEE Int conf semantic comput", "International Conference on Semantic Computing"], "url": "http://icsc.eecs.uci.edu/"}, "title": "Default Prediction on Commercial Credit Big Data Using Graph-based Variable Clustering", "abstract": "Credit-lending organizations have resorted to the use of machine learning (ML) algorithms in the recent past to predict the probability of the default of a business. Explainability of the decisions made by the traditional statistical algorithms like Logit models brings transparency to every stakeholder involved in the process. On the other hand, machine learning models like XGBoost and Neural Nets have achieved better accuracy scores, but their decisions are not easily comprehensible. In this paper, we propose a graph based variable clustering (GVC) method as a filter based approach to select prominent features while retaining as much variance as possible. Our experiments show that our GVC approach is not only almost 40 times faster than the existing variable clustering methods but retains retains 5% more variance than the existing packages.The feature set from GVC approach has performed better with an increase of 6% accuracy on an average. The predictions on the feature set from GVC were 98% accurate using XGBoost algorithm.", "venue": "International Computer Science Conference", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-02-01", "journal": {"name": "2023 IEEE 17th International Conference on Semantic Computing (ICSC)", "pages": "139-142"}, "authors": [{"authorId": "2165360367", "name": "Mallika Boyapati"}, {"authorId": "2067049510", "name": "Ramazan S. Aygun"}], "citations": [{"paperId": "9899b5860a8966aa4f5e6bc56205bf83113b50fe", "title": "Functional Validation of Supervised Learning Tasks for Reproducible Machine Learning"}]}
