{"paperId": "cc73bf395d88ccfe030428df6564a5dedac9f341", "publicationVenue": null, "title": "The Application of Big Data in Cyberspace: A Survey", "abstract": "With the widespread use of network devices, all kinds of isolated sensors can transmit data through the network, and then generate hundreds of billions of data, making big data technology widely applicated in cyberspace. This paper uses a third-party database to search the papers on the topic \"the application of big data in cyberspace\". Then, based on Citespace and other bibliometric tools, these papers searched is analyzed by co-words analysis and articles co-citation analysis. The analysis shows that big data technology is widely used in cyberspace, and the degree and depth of application are deepening year by year. Through the analysis of its time axis of the co-word, we can find that the frontier research areas of \"cyberspace big data applications\" are \"edge computing\", \"energy management\" and \"big data analysis\".", "venue": "2019 International Conference on Communications, Information System and Computer Engineering (CISCE)", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference", "Review"], "publicationDate": "2019-07-01", "journal": {"name": "2019 International Conference on Communications, Information System and Computer Engineering (CISCE)", "pages": "570-574"}, "authors": [{"authorId": "50775044", "name": "Jiawei He"}, {"authorId": "2521268", "name": "Huimei Wang"}, {"authorId": "2062938685", "name": "Ming Xian"}, {"authorId": "2150167889", "name": "Jian Liu"}], "citations": [{"paperId": "6641fd999c1267f26a7bce4cceaf904610629d50", "title": "Research on the application of artificial intelligence in the field of information security"}, {"paperId": "c603890ebd4c3c38dfbf3b0d8f52e86351f2e71b", "title": "Research on the Application of Reinforcement Learning in Network Security"}, {"paperId": "066ae87eaf12e773606114808a722cb6358bfdc8", "title": "Cloud native technology development trend analysis research"}, {"paperId": "839cfa46cd413982f8c02b838bddb54cb1fdc48e", "title": "Research on the Application of Artificial Intelligence in Cyber Range"}, {"paperId": "a0543795a85f2b9684c1ddf2ea1819327c676cc9", "title": "The Development Trend of Artificial Intelligence in Cyberspace Security: A Brief Survey"}]}
