{"paperId": "cc81868488efc1d084f4da443bf8ed49c60b2442", "publicationVenue": null, "title": "A Scalable Distriubuted Ledger for Internet of Things based on Edge Computing", "abstract": "—Internet of Things (IoT) is becoming necessities of people’s daily life and establishing itself as an essential part of future Internet. One of the challenges for using IoT is the security of data collected by trillions of IoT devices and used by millions of services. Distributed ledger technology (DLT) provides a distributed security method which can benefit IoT. Yet challenges are put forward when integrating DLT with IoT, such as scalability and heterogeneous capability of IoT devices. In this paper, we propose a mechanism for integrating DLT in IoT by using edge computing technology, taking the scalability and heterogeneous capability of IoT devices into consideration. IoT devices are clustered dynamically into groups based on various proximity context information. A cluster head is used to bridge the IoT devices with the blockchain network where smart contract is deployed. Through this way, the security of the IoT is improved and the scalability and latency are solved. We elaborate our mechanism and discuss issues that should be considered and implemented when using the proposed mechanism.", "venue": "Seventh International Conference on Advances in Computing, Communication and Information Technology - CCIT 2018", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2018-10-27", "journal": {"name": "Seventh International Conference on Advances in Computing, Communication and Information Technology - CCIT 2018"}, "authors": [{"authorId": "2627161", "name": "R. Rahmani"}, {"authorId": "1833295", "name": "T. Kanter"}, {"authorId": "47001856", "name": "Yuhong Li"}], "citations": [{"paperId": "82a6ae4e3d850c1cdc114eeafa5e74f9c97e4e88", "title": "Verifying Outsourced Computation in an Edge Computing Marketplace"}, {"paperId": "2b29f6fe0c9576a9860a615c2ff0412eef651f12", "title": "A Scalable Digital Infrastructure for Sustainable Energy Grid Enabled by Distributed Ledger Technology"}]}
