{"paperId": "ccc0f455efbe98a127f9084a93a559ac9f0d1d5c", "publicationVenue": {"id": "0473502f-71fa-4945-8e3a-5c0618a4ec32", "name": "PNAS Nexus", "type": "journal", "issn": "2752-6542", "url": "https://academic.oup.com/pnasnexus"}, "title": "Online conspiracy communities are more resilient to deplatforming", "abstract": "Abstract Online social media foster the creation of active communities around shared narratives. Such communities may turn into incubators for conspiracy theories—some spreading violent messages that could sharpen the debate and potentially harm society. To face these phenomena, most social media platforms implemented moderation policies, ranging from posting warning labels up to deplatforming, i.e. permanently banning users. Assessing the effectiveness of content moderation is crucial for balancing societal safety while preserving the right to free speech. In this article, we compare the shift in behavior of users affected by the ban of two large communities on Reddit, GreatAwakening and FatPeopleHate, which were dedicated to spreading the QAnon conspiracy and body-shaming individuals, respectively. Following the ban, both communities partially migrated to Voat, an unmoderated Reddit clone. We estimate how many users migrate, finding that users in the conspiracy community are much more likely to leave Reddit altogether and join Voat. Then, we quantify the behavioral shift within Reddit and across Reddit and Voat by matching common users. While in general the activity of users is lower on the new platform, GreatAwakening users who decided to completely leave Reddit maintain a similar level of activity on Voat. Toxicity strongly increases on Voat in both communities. Finally, conspiracy users migrating from Reddit tend to recreate their previous social network on Voat. Our findings suggest that banning conspiracy communities hosting violent content should be carefully designed, as these communities may be more resilient to deplatforming.", "venue": "PNAS Nexus", "year": 2023, "fieldsOfStudy": ["Medicine", "Physics", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-03-21", "journal": {"name": "PNAS Nexus", "volume": "2"}, "authors": [{"authorId": "47286020", "name": "Corrado Monti"}, {"authorId": "3468616", "name": "Matteo Cinelli"}, {"authorId": "103709888", "name": "C. Valensise"}, {"authorId": "1728390", "name": "Walter Quattrociocchi"}, {"authorId": "2081249", "name": "Michele Starnini"}], "citations": [{"paperId": "43de11ef1ac04b3597a0a70011fd63ca3a05a972", "title": "Deplatforming Norm-Violating Influencers on Social Media Reduces Overall Online Attention Toward Them"}, {"paperId": "d10ebf3e1b52de2274431c4d1885a53cc1794dd5", "title": "User Migration across Multiple Social Media Platforms"}, {"paperId": "baf2806051b2add7bdb2db970d223acc9239baec", "title": "Drivers of social influence in the Twitter migration to Mastodon"}, {"paperId": "2ce3253fa3892b1820b672437359b29ff1ca0bb4", "title": "Users volatility on Reddit and Voat"}, {"paperId": "3dddc0f7d839d4a7dd0aa220a2772896ea2c7414", "title": "No Easy Way Out: The Effectiveness of Deplatforming an Extremist Forum to Suppress Hate and Harassment"}]}
