{"paperId": "ccc9dede1a829d9028dd0e7bec3e71e1fa5d3bf2", "publicationVenue": {"id": "fcbcaf18-8ab1-43e1-a973-604bbc7e344e", "name": "Proceedings of the VLDB Endowment", "type": "journal", "alternate_names": ["Proceedings of The Vldb Endowment", "Proc VLDB Endow", "Proc Vldb Endow"], "issn": "2150-8097", "url": "http://dl.acm.org/toc.cfm?id=J1174", "alternate_urls": ["http://portal.acm.org/toc.cfm?CFID=21632689&CFTOKEN=99329904&WantType=Affiliated%20Organizations&coll=ACM&dl=ACM&id=J1174&idx=J1174&part=affil&title=VLDB%20Endowment&type=periodical"]}, "title": "BSMA: A Benchmark for Analytical Queries over Social Media Data", "abstract": "The demonstration of a benchmark, named as BSMA, for Benchmarking Social Media Analytics, is introduced in this paper. BSMA is designed to benchmark data management systems supporting analytical queries over social media. It is different to existing benchmarks in that: 1) Both real-life data and a synthetic data generator are provided. The real-life dataset contains a social network of 1.6 million users, and all their tweeting and retweeting activities. The data generator can generate both social networks and synthetic timelines that follow data distributions determined by predefined parameters. 2) A set of workloads are provided. The data generator is in responsible for producing updates. A workload generator produces queries based on predefined query templates by generating query arguments online. BSMA workloads cover a large amount of queries with graph operations, temporal queries, hotspot queries, and aggregate queries. Furthermore, the argument generator is capable of sampling data items in the timeline following power-law distribution online. 3) A toolkit is provided to measure and report the performance of systems that implement the benchmark. Furthermore, a prototype system based on dataset and workloads of BSMA is also implemented. The demonstration will include two parts, i.e. the internals of data and workload generator, as well as the performance testing of reference implementations.", "venue": "Proceedings of the VLDB Endowment", "year": 2014, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2014-08-01", "journal": {"name": "Proc. VLDB Endow.", "pages": "1573-1576", "volume": "7"}, "authors": [{"authorId": "144956446", "name": "Fan Xia"}, {"authorId": "2110765899", "name": "Ye Li"}, {"authorId": "7530572", "name": "Chengcheng Yu"}, {"authorId": "2320571", "name": "Haixin Ma"}, {"authorId": "2172016", "name": "Weining Qian"}], "citations": [{"paperId": "40b551e16a75449b8f59c455c9c995ba4da6ab66", "title": "The LDBC Social Network Benchmark: Business Intelligence Workload"}, {"paperId": "d68d5fd09304f89b02ca83f558e53220c9fbac8d", "title": "Benchmarking Graph Data Management and Processing Systems: A Survey"}, {"paperId": "4cc4a785997995cc03afd383407af6bc8ea588de", "title": "Benchmark Researches from the Perspective of Metrology"}, {"paperId": "2a91be5af3f0c95e72a92330530546e9da955c77", "title": "Fast In-Memory SQL Analytics on Typed Graphs"}, {"paperId": "82f21e768e360482a2fa3cf08653643f37ed6c3a", "title": "Utilizing IDs to Accelerate Incremental View Maintenance"}, {"paperId": "2157394639b6e8270c5a8baacbbcb8cb649e6636", "title": "Sampling social streams for hot social events analytics"}, {"paperId": "d9be7401c5b11d07c68848e56d57d2e158722d5e", "title": "Artificial Social Media Campaign Creation for Benchmarking and Challenging Detection Approaches"}, {"paperId": "72190a0d24094b7bdb9945918ca5d4d639047975", "title": "A YCSB Workload for Benchmarking Hotspot Object Behaviour in NoSQL Databases"}, {"paperId": "cd31ee329ddc81aac8e221d7e0d7845931900634", "title": "Benchmarking, Measuring, and Optimizing: Second BenchCouncil International Symposium, Bench 2019, Denver, CO, USA, November 14–16, 2019, Revised Selected Papers"}, {"paperId": "eec48fa4bb01817eee885c231fc5d7bed0f9d846", "title": "Generating Connected Synthetic Electronic Health Records and Social Media Data for Modeling and Simulation"}, {"paperId": "8a9b76a4076274efb7cbf2a8297987cbe449115c", "title": "GraphIVM: Accelerating Incremental View Maintenance through Non-relational Caching"}]}
