{"paperId": "cccbe159de8748ad00aad71ace255e80118d615d", "publicationVenue": {"id": "68571925-b158-4563-8047-3f483854eae6", "name": "European Journal of Science and Technology", "type": "journal", "alternate_names": ["Eur J Sci Technol"], "issn": "2148-2683"}, "title": "Nesnelerin İnternetinde Kullanılan Kablosuz Algılayıcı Cihazlar için Bilgi Merkezli Ağ Mimarisinin Uygulanabilirliği Araştırması", "abstract": "Bilgi merkezli aglar, (ICN – Information Centric Networks), istemci-sunucu arasinda uctan uca iletisimin kurulmadigi, kullanicilarin icerik talebini farkli sunuculardan karsilayabildigi bir ag mimarisidir. Bu mimari, talep edilen verinin kaynak haricinde agdaki ara dugumlerin onbellegine kaydedilmesi ile, veriye hizli ve kolay erisim saglamaktadir. Ayrica bu sekilde agda yayilan veri, icerigini sertifikalandirmasi sayesinde guvenli olarak temin edilebilmektedir. Bu nedenle ICN mimarisi, sadece geleneksel Internet uygulamalari icin degil, bunun otesinde Nesnelerin Internet’i (IoT) uygulamalarinda da cazip hale gelmektedir. Nesnelerin Internet’i kullanici ve cevresinin web uygulamalari ve servisleri ile butunlesmesini amaclamaktadir. Bu amac dogrultusunda kablosuz algilayicilar, internete bagli cihazlara duyusal bir uzanti saglayarak “nesne” olarak tanimlanabilmekte, cok sayida uygulama ve servis bu nesnelerin cevreleri ile ilgili urettigi iceriklerden faydalanabilmektedir. Dolayisiyla IoT uygulamalarinin cogunlugunda icerik, uretildigi konum veya cihaza kiyasla daha on plana cikmaktadir. Bu kapsamda IoT kavraminin en onemli bileseni olan, farkli donanim ve haberlesme teknolojilerine sahip dusuk maliyetli kablosuz algilayici aglarin, mevcut internet altyapisina dahil edilmeleri ve birbirleriyle urettikleri icerikleri paylasmasi gerekmektedir. Ancak kablosuz algilayici cihazlarin islemci gucu, bellek kapasitesi ve enerji kaynaklari sinirlidir. Bu cihazlarin, mevcut haberlesme standartlarini kullanarak internete entegre olmalari maliyetli olabilmektedir. Kaynaklari kisitli olan kablosuz algilayici cihazlarin, kuresel bir iletisim aginin parcasi haline gelmesi uygulama ve ag katmaninda cozulmesi gereken pek cok yeni problemi ortaya cikarmaktadir. Bu dogrultuda kablosuz algilayici cihazlar yer aldiklari uygulamanin gereksinimleri ve kullanim alanlarina bagli olarak, baglanti merkezli (uctan uca) veya bilgi merkezli ag mimarilerinden faydalanabileceklerdir. Bu calismada, bilgi merkezli ag mimarisinin kablosuz algilayici cihazlar icin uygulanabilirligi, sunacagi avantajlar ve mevcut eksikleri literaturde yapilan calismalar goz onune alinarak irdelenmistir.", "venue": "European Journal of Science and Technology", "year": 2020, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2020-12-26", "journal": {"name": "European Journal of Science and Technology"}, "authors": [{"authorId": "2091740710", "name": "Çiğdem Eriş"}, {"authorId": "2091729939", "name": "Pinar Boluk"}], "citations": [{"paperId": "a2ca2d8bd869e47c8452ef746bd4802d5a428fb8", "title": "The Effect of Meteorological Parameters on Wireless Data Transmission"}, {"paperId": "f3df03cd71814eb3ce413a9a7b9921d2de01fcb5", "title": "Akıllı Hava İstasyonu ile IoT Tabanlı Hava Durumu İzleme Sistemi"}]}
