{"paperId": "ccd69678a3bf9f2be952c49a843f939ccc2024b3", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Interoperable Open Specifications Framework for the Implementation of Standardized Urban Platforms †", "abstract": "The current cities’ urban challenges go through digitalization and integration of new technologies under the perspective of actual and future ecological, as well as socio-economic commitments. This process is translated into the Open Standardized Urban Data Platform, which plays a pivotal role. Within its main functionalities, data ingestion, analytics and services as vertical domains become necessary to create more environmentally friendly cities. However, there still exist some deficits. Among them, openness and interoperability are outlined. On the one hand, there is a lack of open data initiatives for increasing the smart services stock. On the other hand, interoperability depends upon vendors and integrators, reducing the possibilities of Smart City growth. In this context, under the mySMARTLife project (GA #731297) umbrella, an Open Specifications Framework has been developed in order to address four main issues: (1) data interoperability; (2) services or verticals interoperability; (3) openness; and (4) replicability. It enlightens the implementation and integration of multiple city domains (like infrastructures, mobility, energy, buildings) for smart management and big-data analytics. Its applicability is demonstrated in the three lighthouse cities of the project, Nantes (France), Hamburg (Germany) and Helsinki (Finland).", "venue": "Italian National Conference on Sensors", "year": 2020, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-04-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "20"}, "authors": [{"authorId": "145152303", "name": "J. Hernández"}, {"authorId": "121577696", "name": "Rubén García"}, {"authorId": "2641510", "name": "Joachim Schonowski"}, {"authorId": "114666272", "name": "D. Atlan"}, {"authorId": "2084094560", "name": "Guillaume Chanson"}, {"authorId": "118667588", "name": "Timo Ruohomäki"}], "citations": [{"paperId": "c3410c51f771301ebb4a922d6dac66461e44a656", "title": "Research on the Analysis of Operation and Governance in Interoperable Smart Cities"}, {"paperId": "3d317c0053314ec132cb8d2d44aca556d22fd9cd", "title": "Data integration in asset management of municipal pipe networks in Sweden: Challenges, gaps, and potential drivers"}, {"paperId": "4ea7c3a7634756c5ec4ce4e596c4270682ba2413", "title": "Building a Data Lake for Smart Building Data: Architecture for Data Quality and Interoperability"}, {"paperId": "4e503a9a8d2c4a63046b2082cdf532512b67cfea", "title": "From silos to open, federated and enriched Data Lakes for smart building data management"}, {"paperId": "8e94078915518454a7ee87d90f1470bd7e65bd50", "title": "The Need for Cybersecurity in Industrial Revolution and Smart Cities"}, {"paperId": "6d8fc867b81c3124d3bdb0f98ec23265e02be9a9", "title": "MaaS platform features: An exploration of their relationship and importance from supply and demand perspective"}, {"paperId": "39f3f734eca66cf2d02ad9075b9d6bd40ecce256", "title": "VIABILITY TESTING OF GAME ENGINE USAGE FOR VISUALIZATION OF 3D GEOSPATIAL DATA WITH OGC STANDARDS"}, {"paperId": "313fa07daa879c5452522aa42de271a7af73f706", "title": "Matching Traffic Lights to Routes for Real-World Deployments of Mobile GLOSA Apps"}, {"paperId": "da0b677c0aa23d366d390535f7bd67804ec993c2", "title": "A Holistic and Interoperable Approach towards the Implementation of Services for the Digital Transformation of Smart Cities: The Case of Vitoria-Gasteiz (Spain)"}, {"paperId": "9219b7706d36082d663f43e9800f21bc17e33e25", "title": "Autonomic interoperability manager: A service-oriented architecture for full-stack interoperability in the Internet-of-Things"}, {"paperId": "1bd95c8a9956c22c856798ba9314991a3bca4558", "title": "The Proposed Framework and Challenges towards Smart City Implementation"}, {"paperId": "c6c5065ddeb79b3f0312d197bb8fb4486668806d", "title": "CONCEPT AND EVALUATION OF AN URBAN PLATFORM FOR INTERACTIVE VISUAL ANALYTICS"}, {"paperId": "49a8dc61687cea1f9ba303f61b6eb755465f5ebb", "title": "Data-driven asset management in urban water pipe networks: a proposed conceptual framework"}, {"paperId": "1b9876dfd70cea6c90989acad1bd55f7808f957e", "title": "3D Perspective towards the Development of a Metadata-Driven Sharing Mechanism for Heterogeneous CCTV Systems"}, {"paperId": "83ea881c84f0543ea13f4c670067a90acef92573", "title": "The privatised city: technology and public-private partnerships in the smart city"}, {"paperId": "dcaca0e5a2279463ab0a57ef3cf099471c315cab", "title": "A knowledge organization framework for influencing tourism-centered place-making"}, {"paperId": "d00ec1e3de4b10b0814addcb14ce1527cc36b973", "title": "Smart Cities and Big Data Analytics: A Data-Driven Decision-Making Use Case"}, {"paperId": "694e609462103e9aec642cc90f8aff5130b37931", "title": "Towards Interoperability of Smart City Data Platforms"}, {"paperId": "68b395ddfc0afdc75c4f3ab4a8e45a2cfbfb2dc5", "title": "Data-driven energy resource planning for Smart Cities"}, {"paperId": "2075e4e75d87e7686b324ee07572991da6dff6f7", "title": "Design Principles for Strategic Alignment in Smart City Enterprise Architectures (SCEA)"}, {"paperId": "30706952b4ef9b1992327ca591d27038a3cfe0f2", "title": "SafeCity: Toward Safe and Secured Data Management Design for IoT-Enabled Smart City Planning"}, {"paperId": "a20c76efefa8a43ec500645e050dacd76ac6f6c2", "title": "MaaS Platform Features: An Exploration of their Relationship and Importance from Supply and Demand Perspective"}, {"paperId": "f726f2d309d960e163947712aca68b3d442af9ea", "title": "MaaS Platform Features: An Exploration of their Relationship and Importance from Supply and Demand Perspective"}]}
