{"paperId": "ccebd0a61e9bcdeb672f8c1b4e933482092b2de3", "publicationVenue": {"id": "74f47cf8-2839-4a56-959a-524dd0ed9e3e", "name": "International Conference on Extending Database Technology", "type": "conference", "alternate_names": ["Int Conf Extending Database Technol", "Extending Database Technology", "Extending Database Technol", "EDBT"], "url": "http://www.edbt.org/"}, "title": "Supporting Complex Query Time Enrichment For Analytics", "abstract": "Several application domains require data to be enriched prior to its use. Data enrichment is often performed using expensive machine learning models to interpret low-level data ( e . g ., models for face detection) into semantically meaningful observation. Col-lecting and enriching data offline before loading it to a database is infeasible if one desires online analysis on data as it arrives. Enriching data on the fly at insertion could result in redundant work (if applications require only a fraction of the data to be enriched) and could result in a bottleneck (if enrichment functions are expensive). Any scalable solution requires enrichment during query processing. This paper explores two different architectures for integrating enrichment into query processing – a loosely coupled approach wherein enrichment is performed outside of the DBMS and a tightly coupled approach wherein it is performed within the DBMS. The paper addresses the challenges of increased query latency due to query time enrichment.", "venue": "International Conference on Extending Database Technology", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": null, "journal": {"pages": "92-104"}, "authors": [{"authorId": "2028613607", "name": "Dhrubajyoti Ghosh"}, {"authorId": "2028613957", "name": "Peeyush Gupta"}, {"authorId": "144156242", "name": "S. Mehrotra"}, {"authorId": "2028614385", "name": "Shantanu Sharma"}], "citations": [{"paperId": "f25e590c2f97b85de6f6f775959945a5ed3dc2df", "title": "JENNER: Just-in-time Enrichment in Query Processing"}]}
