{"paperId": "ccf1068805c3266040a0040802dea540f4b6a4cc", "publicationVenue": {"id": "a223c233-6d5e-4f99-8a42-db902690b251", "name": "International Conference on Electronics, Communications, and Computers", "type": "conference", "alternate_names": ["Int Conf Electron Commun Comput", "CONIELECOMP"], "url": "http://www.wikicfp.com/cfp/program?id=557"}, "title": "Application of data fragmentation and replication methods in the cloud: a review", "abstract": "Data fragmentation and replication are an essential issue in cloud databases, since information demands are huge and improving performance through distributed database design techniques is a necessity. This paper aims to provide a review of the literature about data fragmentation and replication methods applied in a cloud environment in the last eight years, to determine if the methods take into account both techniques (fragmentation and replication) together, consider a cloud database, are easy to implement, are focused on improving the performance of the database, are complete (i.e., the paper includes all the necessary information to implement the method), and if they provide a cost model. To meet this objective we analyzed and classified 83 papers concerning data fragmentation and replication techniques. Finally, we selected the best method of our comparative analysis and presented an architecture of a web application for data fragmentation and replication in the cloud based on such method.", "venue": "International Conference on Electronics, Communications, and Computers", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference", "Review"], "publicationDate": "2019-02-01", "journal": {"name": "2019 International Conference on Electronics, Communications and Computers (CONIELECOMP)", "pages": "47-54"}, "authors": [{"authorId": "1723959965", "name": "F. Castro-Medina"}, {"authorId": "1399067595", "name": "L. Rodríguez-Mazahua"}, {"authorId": "1403037278", "name": "M. Abud-Figueroa"}, {"authorId": "2064535453", "name": "Celia Romero Torres"}, {"authorId": "32594389", "name": "Luis Ángel Reyes Hernández"}, {"authorId": "1397382854", "name": "G. Alor-Hernández"}], "citations": [{"paperId": "cbd96fe0940a0132f091b5e9e03d8ff240afa2db", "title": "On hierarchical clustering-based approach for RDDBS design"}, {"paperId": "66b2f02fea9c8756623b26d0e37c8728850c8dd0", "title": "Inducing Huge Tail Latency on a MongoDB deployment"}, {"paperId": "8aa4cae691d4d195372a3453e1d66035e3b61c00", "title": "Towards Improving Cloud Security and Performance by using Proposed Controlled Replication Model"}, {"paperId": "98eecfd29866369b370fc13c109d249f5d50b86b", "title": "Probability of Data Leakage and Its Impacts on Confidentiality"}, {"paperId": "d1fc5febd54012a0d6acf258ef29ffea5404d521", "title": "Hybrid Data Fragmentation Using Genetic Killer Whale Optimization-Based Clustering Model"}, {"paperId": "5841d3fa36c3867064f4c731463ec11fce10dac9", "title": "Data replication schemes in cloud computing: a survey"}, {"paperId": "c35d5c2a4bdb81725f23dd7ad151bb5bff79c6ad", "title": "Optimization on Replication Performance via Balance Quorum (BQ) and Data Center Selection Method (DCSM) Algorithms in Cloud Environment"}, {"paperId": "85c843af870be9ed219efb69c58e6bf972fbf7ef", "title": "Horizontal Fragmentation of Multimedia Databases to Optimize Content-based Queries: A Review"}, {"paperId": "08fe9bd0bca9cca93541a00da2e3a5133ccbbd38", "title": "FRAGMENT: A Web Application for Database Fragmentation, Allocation and Replication over a Cloud Environment"}, {"paperId": "ac0b53d68a4c4c0e6806bbbc1da7e48c89e4158c", "title": "Approach for Ensuring Fragmentation and Integrity of Data in SEDuLOUS"}, {"paperId": "3698645c3f071582c771aa5383fcdc0e5c842b59", "title": "Vigorous Replication Strategy With Balanced Quorum for Minimizing the Storage Consumption and Response Time in Cloud Environments"}]}
