{"paperId": "ccf9b4288f59ea8539f7b8ad9a0f761f4f957f23", "publicationVenue": null, "title": "An Apriori-based Data Analysis on Suspicious Network Event Recognition", "abstract": "Apriori-based rule generators, which are powered by the DIS-Apriori algorithm and the NIS-Apriori algorithm, are applied to analyze the data sets available in the IEEE BigData 2019 Cup: Suspicious Network Event Recognition. Then, each missing value in the test data set is decided by using the obtained rules. The advantage of our rule-based model is that the obtained rules are very easy to understand in comparison with other ”black-box” machine learning models. Furthermore, two algorithms preserve the logical property ”completeness,” so they generate rules without excess and deficiency. In evaluation, the AUC measure seems unfavorable to our model, so we employed 3-fold cross-validation for the training data set, and we obtained a 94% mean score. This result ensures the validity of our model. We report several meaningful results in this experiment, as well as the estimation of missing values.", "venue": "2019 IEEE International Conference on Big Data (Big Data)", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-12-01", "journal": {"name": "2019 IEEE International Conference on Big Data (Big Data)", "pages": "5888-5896"}, "authors": [{"authorId": "1504656431", "name": "Zhiwen Jian"}, {"authorId": "48723587", "name": "H. Sakai"}, {"authorId": "1702521", "name": "J. Watada"}, {"authorId": "1390519812", "name": "Arunava Roy"}, {"authorId": "2107156611", "name": "M. H. Hassan"}], "citations": [{"paperId": "5ba48f22d4a9d7d51892b5de1b2e357aecc1f49a", "title": "Apriori-based Rule Generation with Three-way Decisions for Heterogeneous and Uncertain Data"}, {"paperId": "46f960dc3c240c019c0154d1789938629f02730e", "title": "Applications of rough sets in big data analysis: An overview"}, {"paperId": "b1bbb508b63dae7dd68faa2398dbc839490f5606", "title": "Granulated Tables with Frequency by Discretization and Their Application"}, {"paperId": "197a6c2ce653d51ce9a6efa42f74dfa675204ec6", "title": "On Apriori-Based Rule Generation and the Explainable Reasoning Functionality for Decision"}, {"paperId": "ae43f6058928091190863a2c1b8aef597436316f", "title": "Rule Generation from Several Types of Table Data Sets and Its Application: Decision-Making with Transparency and an Improved Execution Environment"}]}
