{"paperId": "ccfe7a4a62705941b067f2bc3bdad809e73b444e", "publicationVenue": {"id": "1cd505d9-195d-4f99-b91c-169e872644d4", "name": "Energies", "type": "journal", "issn": "1996-1073", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-155563", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-155563", "https://www.mdpi.com/journal/energies", "http://www.mdpi.com/journal/energies"]}, "title": "MonLink: Piggyback Status Monitoring over LLDP in Software-Defined Energy Internet", "abstract": "While software-defined networking (SDN) has been widely applied in various networking domains including datacenters, WANs (Wide Area Networks), QoS (Quality of Service) provisioning, service function chaining, etc., it also has foreseeable applications in energy internet (EI), which envisions an intelligent energy industry on the basis of (information) internet. Global awareness provided by SDN is especially useful in system monitoring in EI to achieve optimal energy transportation, sharing, etc. Link layer discovery protocol (LLDP) plays a key role in global topology discovery in software-defined energy internet when SDN is applied. Nevertheless, EI-related status information (power loads, etc.) is not collected during the LLDP-based topology discovery process initiated by the SDN controller, which makes the optimal decision making (e.g., efficient energy transportation and sharing) difficult. This paper proposes MonLink, a piggyback status-monitoring scheme over LLDP in software-defined energy internet with SDN-equipped control plane and data plane. MonLink extends the original LLDP by introducing metric type/length/value (TLV) fields so as to collect status information and conduct status monitoring in a piggyback fashion over LLDP during topology discovery simultaneously without the introduction of any newly designed dedicated status monitoring protocol. Several operation modes are derived for MonLink, namely, periodic MonLink, which operates based on periodic timeouts, proactive MonLink, which operates based on explicit API invocations, and adaptive MonLink, which operates sensitively and self-adaptively to status changes. Various northbound APIs are also designed so that upper layer network applications can make full use of the status monitoring facility provided by MonLink. Experiment results indicate that MonLink is a lightweight protocol capable of efficient monitoring of topological and status information with very low traffic overhead, compared with other network monitoring schemes such as sFlow.", "venue": "Energies", "year": 2019, "fieldsOfStudy": ["Engineering"], "publicationTypes": null, "publicationDate": "2019-03-25", "journal": {"name": "Energies"}, "authors": [{"authorId": "2145307270", "name": "Xi Chen"}, {"authorId": "36831267", "name": "Yue Chen"}, {"authorId": "3097765", "name": "A. K. Sangaiah"}, {"authorId": "2962874", "name": "Shouxi Luo"}, {"authorId": "49514984", "name": "Hongfang Yu"}], "citations": [{"paperId": "6d15ad2a122b8d5ea94952b891d798e94737355e", "title": "The SDN-Governed Ad Hoc Swarm for Mobile Surveillance of Meteorological Facilities"}, {"paperId": "31afb0e2d136f17a142c3b90e459927efd3d4ce7", "title": "Research on Random Virtual IP Address Redistribution Technology Based on OpenFlow"}, {"paperId": "b80dd0d96eb0ba7d5223a69da529d7bd8505b187", "title": "Software-Defined MANET Swarm for Mobile Monitoring in Hydropower Plants"}]}
