{"paperId": "cd1e35135c998fdc46a786f2f74fc7d96793073a", "publicationVenue": {"id": "fcd4fe37-31be-4e00-a673-5beca7d02406", "name": "International Conference on Web Information Systems and Technologies", "type": "conference", "alternate_names": ["Int Conf Web Inf Syst Technol", "WEBIST"], "url": "http://www.webist.org/"}, "title": "A Data-Centric Anomaly-Based Detection System for Interactive Machine Learning Setups", "abstract": ": A major concern in the use of Internet of Things (IoT) technologies in general is their reliability in the presence of security threats and cyberattacks. Particularly, there is a growing recognition that IoT environments featuring virtual sensing and interactive machine learning may be subject to additional vulnerabilities when compared to traditional networks and classical batch learning settings. Partly, this is as adversaries could more easily manipulate the user feedback channel with malicious content. To this end, we propose a data-centric anomaly-based detection system, based on machine learning, that facilitates the process of identifying anomalies, particularly those related to poisoning integrity attacks targeting the user feedback channel of interactive machine learning setups. We demonstrate the capabilities of the proposed system in a case study involving a smart campus setup consisting of different smart devices, namely, a smart camera, a climate sensmitter, smart lighting, a smart phone, and a user feedback channel over which users could furnish labels to improve detection of correct system states, namely, activity types happening inside a room. Our results indicate that anomalies targeting the user feedback channel can be accurately detected at 98% using the Random Forest classiﬁer.", "venue": "International Conference on Web Information Systems and Technologies", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"pages": "182-189"}, "authors": [{"authorId": "48328106", "name": "Joseph Bugeja"}, {"authorId": "2064988594", "name": "Jan A. Persson"}], "citations": []}
