{"paperId": "cd28d8c350b8ba05b97cc3f218cd1ccf35065f1d", "publicationVenue": null, "title": "An Overview of Clustering Algorithms for Credit Card Fraud Detection", "abstract": "This paper offers a top-stage view of clustering algorithms that can be used for Clustering algorithms, which are robust and bendy techniques for uncovering patterns and anomalies in large datasets. Those algorithms can be used for grouping transactions with capabilities together with place, hour, gadgets bought, card holder, or each different characteristic related to the marketing. For credit card fraud detection, clustering algorithms are famous answers due to their capability to discover anomalous clusters that could represent fraudulent transactions. High-quality, well-known clustering algorithms and ok-way, hierarchical, and fuzzy clustering are mentioned as their particular packages. The paper also offers a few case studies concerning the usage of clustering algorithms for credit card fraud detection. This case research suggests real-global examples of how clustering algorithms may be implemented for credit rating card information. In the end, the paper outlines the demanding situations and possibilities of clustering algorithms. It is essential for banking structures, as unauthorized use of credit scorecards results in widespread economic losses. Detection of fraud is often predicated on gadgets mastering algorithms in conjunction with clustering algorithms. Clustering algorithms are the unsupervised getting-to-know method used to group patterns of facts based on similarity to find ability fraud. Famous clustering algorithms embody okay-manner, Gaussian aggregate models, and Self-Organizing Maps. Those algorithms are trying to differentiate legitimate clients from those committing fraud by figuring out clusters of ordinary behavior. Ok-manner uses an iterative manner to group data in keeping with Euclidean distance measures. Gaussian aggregate models use a probabilistic method to classify kinds of records and may incorporate preceding information approximately the statistics location if you want to generate extra accurate clusters. Self-organizing maps use a SOM shape to construct hierarchical representations of the facts space and study the community relationships among fraud patterns. The one's algorithms can offer compelling insights into how clients use their credit score playing cards, uncovering legitimate and fraudulent styles. Analyzing the ways in combination with one-of-a-kind varieties of gadgets can offer predictive behavior models and practical strategies for detecting fraud in credit card transactions.", "venue": "2024 International Conference on Optimization Computing and Wireless Communication (ICOCWC)", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["Conference", "Review"], "publicationDate": "2024-01-29", "journal": {"name": "2024 International Conference on Optimization Computing and Wireless Communication (ICOCWC)", "pages": "1-6"}, "authors": [{"authorId": "2291040387", "name": "N.R Solomon Jebaraj"}, {"authorId": "2211938448", "name": "Jyoti Shekhawat"}, {"authorId": "2211727010", "name": "Rupal Gupta"}], "citations": []}
