{"paperId": "cd2c7b6a358bb781746c8c96f927e4bdff3c5f52", "publicationVenue": {"id": "49d98187-3270-4592-9d05-5165e4332913", "name": "VFAST Transactions on Software Engineering", "alternate_names": ["VFAST Trans Softw Eng"], "issn": "2309-3978", "url": "http://www.vfast.org/index.php/VTSE"}, "title": "An Efficient Deep Learning Approach for Prediction of Student Performance Using Neural Network", "abstract": "\n\n\n\nIn recent years, schools have shown interest in utilizing data mining to improve the quality of education. To enhance academic performance, accurately predicting how students will perform in their classes is crucial, which is essential for their progress in further education. Some students encounter challenges upon entering higher education, and predicting their performance early on is vital to keeping them on the right track. Our research aims to assess student performance using various classification strategies to identify the most accurate one. We utilize a Kaggle dataset for this study. Initially, we clean up the dataset by removing duplicate records and filling in any missing information. Subsequently, we apply six different classifiers, including Neural Networks and methods such as Random Forest and Support Vector Machine, utilizing the Weka tool. Additionally, we employ Principal Component Analysis (PCA) to extract optimized features that enhance model accuracy. We evaluate all models on Training and Testing splits, as well as the 10-K Fold options provided by the Weka tool. Finally, we calculate Training Accuracy, Testing Accuracy, Precision, Recall, and F1-Score for each model and compare their results. Notably, Neural Networks and Random Forest demonstrate superior results compared to other models.\n\n\n\n\n ", "venue": "VFAST Transactions on Software Engineering", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-12", "journal": {"name": "VFAST Transactions on Software Engineering"}, "authors": [{"authorId": "2279493873", "name": "Namraiza"}, {"authorId": "34957852", "name": "K. Abid"}, {"authorId": "2279387112", "name": "Naeem Aslam"}, {"authorId": "2279463187", "name": "Muhammad Fuzail"}, {"authorId": "2279462740", "name": "Muhammad Sajid Maqbool"}, {"authorId": "2279492591", "name": "Kainat Sajid"}], "citations": []}
