{"paperId": "cd34d5b61b9ae5e58c1b99da498e794622aac5e4", "publicationVenue": {"id": "e4fc02ca-8072-4c5e-8499-ea07e3e4c6d5", "name": "Head and Neck", "alternate_names": ["Head Neck"], "issn": "1043-3074", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/112714165", "alternate_urls": ["http://www3.interscience.wiley.com/cgi-bin/jhome/38137", "https://onlinelibrary.wiley.com/journal/10970347"]}, "title": "Intraoperative AI-assisted early prediction of parathyroid and ischemia alert in endoscopic thyroid surgery.", "abstract": "BACKGROUND\nThe preservation of parathyroid glands is crucial in endoscopic thyroid surgery to prevent hypocalcemia and related complications. However, current methods for identifying and protecting these glands have limitations. We propose a novel technique that has the potential to improve the safety and efficacy of endoscopic thyroid surgery.\n\n\nPURPOSE\nOur study aims to develop a deep learning model called PTAIR 2.0 (Parathyroid gland Artificial Intelligence Recognition) to enhance parathyroid gland recognition during endoscopic thyroidectomy. We compare its performance against traditional surgeon-based identification methods.\n\n\nMATERIALS AND METHODS\nParathyroid tissues were annotated in 32 428 images extracted from 838 endoscopic thyroidectomy videos, forming the internal training cohort. An external validation cohort comprised 54 full-length videos. Six candidate algorithms were evaluated to select the optimal one. We assessed the model's performance in terms of initial recognition time, identification duration, and recognition rate and compared it with the performance of surgeons.\n\n\nRESULTS\nUtilizing the YOLOX algorithm, we developed PTAIR 2.0, which demonstrated superior performance with an AP50 score of 92.1%. The YOLOX algorithm achieved a frame rate of 25.14 Hz, meeting real-time requirements. In the internal training cohort, PTAIR 2.0 achieved AP50 values of 94.1%, 98.9%, and 92.1% for parathyroid gland early prediction, identification, and ischemia alert, respectively. Additionally, in the external validation cohort, PTAIR outperformed both junior and senior surgeons in identifying and tracking parathyroid glands (p < 0.001).\n\n\nCONCLUSION\nThe AI-driven PTAIR 2.0 model significantly outperforms both senior and junior surgeons in parathyroid gland identification and ischemia alert during endoscopic thyroid surgery, offering potential for enhanced surgical precision and patient outcomes.", "venue": "Head and Neck", "year": 2024, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-02-13", "journal": {"name": "Head & neck"}, "authors": [{"authorId": "2153213857", "name": "Bo Wang"}, {"authorId": "2126487338", "name": "Jia-Fan Yu"}, {"authorId": "2156228393", "name": "Si-Ying Lin"}, {"authorId": "2283967849", "name": "Yi-Jian Li"}, {"authorId": "2282746861", "name": "Wen-Yu Huang"}, {"authorId": "2284017140", "name": "Shou-Yi Yan"}, {"authorId": "49185069", "name": "Si-Si Wang"}, {"authorId": "2282592197", "name": "Li-Yong Zhang"}, {"authorId": "2199455482", "name": "Shao-Jun Cai"}, {"authorId": "2284031538", "name": "Si-Bin Wu"}, {"authorId": "2145711482", "name": "Meng-Yao Li"}, {"authorId": "2284101198", "name": "Ting-Yi Wang"}, {"authorId": "2046979372", "name": "A. H. Abdelhamid Ahmed"}, {"authorId": "2263494794", "name": "Gregory W Randolph"}, {"authorId": "2156362225", "name": "Fei Chen"}, {"authorId": "14594994", "name": "Wenxin Zhao"}], "citations": []}
