{"paperId": "cd4247e6e08f6c33c09005e7ba16b18468ac88c5", "publicationVenue": {"id": "ac6af566-2527-4256-b77b-2ee061a1b68f", "name": "International Journal of Retail & Distribution Management", "type": "journal", "alternate_names": ["Int J Retail  Distrib Manag"], "issn": "0959-0552", "url": "https://www.emerald.com/insight/publication/issn/0959-0552", "alternate_urls": ["http://www.emeraldinsight.com/0959-0552.htm"]}, "title": "Industry 4.0 enablers in retailing: a literature review", "abstract": "PurposeThe aim of this paper is to study and describe the Industry 4.0 (I4.0) concept in the retail industry by identifying the technology enablers, the benefits and the challenges involved in adopting these technologies.Design/methodology/approachThe work is built on a systematic literature review (SLR) about the I4.0 concept within retail studies through the enablers codified by the Industry 4.0 literature.FindingsThe concept of Industry 4.0 within the retail context is presented through three relevant technology enablers I4.0 emerges as a latent concept represented by technologies adopted to study customer behaviour and manage customer relationships and, partially, to optimise retail management. Furthermore, the paper highlights the benefits and challenges stemming from the adoption of I4.0 technology enablers in the retail industry.Originality/valueThe use of a SLR to describe the I4.0 concept in the retail industry identifying the relevant technology enablers and their relations. The article lays the foundations for future studies on the integrated effects of the contemporary actions of multiple technologies on retail management.", "venue": "International Journal of Retail & Distribution Management", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review"], "publicationDate": "2022-01-21", "journal": {"name": "International Journal of Retail & Distribution Management"}, "authors": [{"authorId": "46407584", "name": "R. Bruni"}, {"authorId": "3460905", "name": "Michela Piccarozzi"}], "citations": [{"paperId": "b06ec851093ae0287f13371b26d194dc137e07d4", "title": "Prioritization of critical factors toward Industry 4.0 adoption in service industries: an emerging economy perspective"}, {"paperId": "bbf7e02f1ef232cd5c8d6fff8c2adab999a98c33", "title": "Appetite for distraction? A systematic literature review on customer smartphone distraction"}, {"paperId": "7c27f6274b226e4ec4a80b3379bb63a508871ff5", "title": "Developing capabilities underlying to Industry 4.0 design principles within the manufacturing context"}, {"paperId": "2757f17c3b77e870872f5d7766f0d0e9716af4c2", "title": "Drivers of generative artificial intelligence to fostering exploitative and exploratory innovation: A TOE framework"}, {"paperId": "1f4891c44016654747796d34493df05f4cfcfcbd", "title": "Logistics 4.0 for supply chain performance: perspectives from a retailing case study"}, {"paperId": "f17f684d9a47fb5406f1926d6cccbf597921719c", "title": "The role of artificial intelligence in improving the omnichannel customer experience"}, {"paperId": "bcb8ae5a099fdd24c3bd6cdf2e08a546b70bf3c9", "title": "The decision-making of internet recycler considering Internet-of-Things application"}]}
