{"paperId": "cd486c88c40bb7a0d456914c9eebec978de10b0f", "publicationVenue": {"id": "1db2368e-5986-4b06-9137-e63c1aa4f5e1", "name": "Symposium on Computer Architecture and High Performance Computing", "type": "conference", "alternate_names": ["SBAC-PAD", "Symp Comput Archit High Perform Comput"]}, "title": "Taming the Big Data Monster: Managing Petabytes of Data with Multi-Model Databases", "abstract": "With the development of big data technology, the amount of business data that Internet companies need to handle has reached the petabyte level, which poses great pressure on the system processing capacity. For example, the peak order volume of Alibaba's Global Shopping Festival in 2020 reached 583,000 orders per second. Even worse, multi-model data are involved in real business. The inability to perform high-throughput, lowlatency transaction processing can result in a poor user experience that can lead to serious financial losses due to customer churn. Although numerous optimizations have been proposed, they can fail in the face of petabytes of data, or be significantly less effective. In this paper, we propose a novel and practical multi-model big data system that can manage petabytes of data. Particularly, we show three special designs for processing the petabytes of data. First, we perform partition to reduce the amount of unnecessary data to be scanned. Second, we adaptively adopt row storage mode for big tables that are frequently updated and column storage mode for tables that are frequently queried to improve the system efficiency. Third, we conduct compression to accelerate IO access speed. We analyze Alibaba's two real PB-level business scenarios, Double 11 and Zhixingtong, and generate workloads and benchmark accordingly to verify our system. Experiments show that our system can efficiently manage petabyte-scale data in real scenarios, providing high-performance querying of terabyte-scale datasets, and be suitable for various workloads.", "venue": "Symposium on Computer Architecture and High Performance Computing", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-11-01", "journal": {"name": "2022 IEEE 34th International Symposium on Computer Architecture and High Performance Computing (SBAC-PAD)", "pages": "283-292"}, "authors": [{"authorId": "39988436", "name": "Yang Chen"}, {"authorId": "1884418505", "name": "Feng Zhang"}, {"authorId": "2179562331", "name": "Yinhao Hong"}, {"authorId": "2332105", "name": "Yunpeng Chai"}, {"authorId": "143844110", "name": "Wei Lu"}, {"authorId": "2192027371", "name": "Hong Chen"}, {"authorId": "2152944669", "name": "Xiaoyong Du"}, {"authorId": "2197843439", "name": "Peipei Wang"}, {"authorId": "2197603735", "name": "Le Mi"}, {"authorId": "2187789233", "name": "Jintao Li"}, {"authorId": "32576454", "name": "Xilin Tang"}, {"authorId": "1914615750", "name": "Yanliang Zhou"}, {"authorId": "101829183", "name": "Wei Zhou"}, {"authorId": "144585402", "name": "Peng Zhang"}, {"authorId": "2197784178", "name": "Fengyi Chen"}, {"authorId": "2198022286", "name": "Pengfei Li"}, {"authorId": "2197678946", "name": "Yu Li"}], "citations": []}
