{"paperId": "cd5f08916095ab6e9471fce36960966441803964", "publicationVenue": {"id": "61a67c58-bb56-407f-aa9e-34c54fabb39a", "name": "Expert Review of Precision Medicine and Drug Development", "alternate_names": ["Expert Rev Precis Med Drug Dev"], "issn": "2380-8993", "url": "http://www.tandfonline.com/loi/tepm20?open=1&repitition=0#vol_1", "alternate_urls": ["https://www.tandfonline.com/toc/tepm20/current"]}, "title": "Big data, artificial intelligence, and cardiovascular precision medicine", "abstract": "ABSTRACT Introduction: Cardiovascular diseases (CVDs) are chronic, heterogeneous diseases which are generally classified according to clinical presentation. However, the arrival of big data and analytical methods presents an opportunity to better understand these disease entities. Areas covered: This review article highlights: (1) the potential of a big data approaches with emerging technology to explore the heterogeneity of CVDs; (2) current challenges of a big data approach; and (3) the future of precision cardiovascular medicine. Expert commentary: Overall, most of the current data utilizing big data techniques remain largely descriptive and retrospective. Precision medicine, or N-of-1, approaches have not yet allowed for consistent interpretation since there is no ‘standard’ of how to best apply treatment approaches in a field where evidence-based medicine is based largely on randomized controlled trials. The risk score and biomarker-based approaches have been utilized with some ‘validation’ studies, but more in-depth biomarkers (i.e. pharmacogenomic biomarkers) have failed to demonstrate incremental benefits. Exploring novel CVD phenotypes by integrating existing medical variables, multi-omics, lifestyle, and environmental data using artificial intelligence is vitally important and may allow us to digitize future clinical trials, potentially leading to novel therapies.", "venue": "Expert Review of Precision Medicine and Drug Development", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2018-09-03", "journal": {"name": "Expert Review of Precision Medicine and Drug Development", "pages": "305 - 317", "volume": "3"}, "authors": [{"authorId": "8633608", "name": "C. Krittanawong"}, {"authorId": "2287774816", "name": "Kipp W. Johnson"}, {"authorId": "2287601112", "name": "Steven G. Hershman"}, {"authorId": "2115941071", "name": "W. W. Tang"}], "citations": [{"paperId": "50865ea710df6167ba85499ae1fe64b455134780", "title": "A Pharmaceutical Paradigm for Cardiovascular Composite Risk Assessment Using Novel Radiogenomics Risk Predictors in Precision Explainable Artificial Intelligence Framework: Clinical Trial Tool."}, {"paperId": "62f601acfe3c0206075a3a722c991b7995be8e22", "title": "Analysis of barriers of mHealth adoption in the context of sustainable operational practices in health care supply chains"}, {"paperId": "cdb5e1ddd8e60ae239d98d1c91e7d6f453d54e83", "title": "Systematic analysis of healthcare big data analytics for efficient care and disease diagnosing"}, {"paperId": "8ee8b79dbfc43ecb0c49910919953d0aa6d481fa", "title": "Intelligent Technologies for Excellency in Sustainable Operational Performance in the Healthcare Sector"}, {"paperId": "34259f1a15246747df14eb252f021e9d8230e187", "title": "Artificial Intelligence and Cardiovascular Genetics"}, {"paperId": "5c1ea223c26ce35668b8b1a46a165524de239710", "title": "Artificial Intelligence-Powered Blockchains for Cardiovascular Medicine."}, {"paperId": "6426c36857a1a538c9a0fe0fe5b7d639a0cd8141", "title": "Application of wearable devices in 6G internet of things communication environment using artificial intelligence"}, {"paperId": "8ca77b80c21c909d014c07ef9bfcaf11b1a80832", "title": "A Comprehensive Analysis of Healthcare Big Data Management, Analytics and Scientific Programming"}, {"paperId": "9a8e787e4a277717e22895b981482bb645c8c0bc", "title": "Cardioinformatics: the nexus of bioinformatics and precision cardiology"}, {"paperId": "43cc591ec5e911eab042157709b3d7674c5d5e35", "title": "Hyponatremia in Heart Failure: Pathogenesis and Management"}, {"paperId": "abc7891dc19cd2c25bda27ff9364a2ae6a470f92", "title": "Big Data in Cardiovascular Disease"}, {"paperId": "b490f4a314d484e50c9f7f766b9ee293ab6149c0", "title": "How artificial intelligence could redefine clinical trials in cardiovascular medicine: lessons learned from oncology."}, {"paperId": "6658317c3e543963a05d0d5f696204645bc56a22", "title": "Deep learning for cardiovascular medicine: a practical primer."}, {"paperId": "a79c2c3981d026f7ea2189eafd3ec838613e7773", "title": "Artificial Intelligence in Healthcare: An Overview"}, {"paperId": "2563eb8344d6a7efcd2bd5b72d7522651cde4657", "title": "Cardiovascular Applications of Artificial Intelligence in Research, Diagnosis, and Disease Management"}, {"paperId": "03243d778d7298bdc75f3a304247c51953967b6c", "title": "Artificial Intelligence and Its Application in Cardiovascular Disease Management"}, {"paperId": "3b264642a1f772b5d11f82490aadc697f1ec862f", "title": "Artificial Intelligence and Machine Learning for Digital Pathology: State-of-the-Art and Future Challenges"}, {"paperId": "5910e356315ee8400569ebd6f0cecf6461570534", "title": "Echocardiographic Data in Artificial Intelligence Research: Primer on Concepts of Big Data and Latent States."}]}
