{"paperId": "cd74dc7d34599dd8e04bdd131866ac572bd762ad", "publicationVenue": {"id": "1081c1db-9560-403b-a89f-a2e97dded5ce", "name": "Electronic Commerce Research and Applications", "type": "journal", "alternate_names": ["Electron Commer Res Appl"], "issn": "1567-4223", "url": "http://www.sciencedirect.com/science/journal/15674223"}, "title": "The impact of big data on firm performance in hotel industry", "abstract": null, "venue": "Electronic Commerce Research and Applications", "year": 2020, "fieldsOfStudy": ["Computer Science", "Business"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2020-03-01", "journal": {"name": "Electron. Commer. Res. Appl.", "pages": "100921", "volume": "40"}, "authors": [{"authorId": "46723193", "name": "E. Yadegaridehkordi"}, {"authorId": "3095698", "name": "M. Nilashi"}, {"authorId": "89333756", "name": "Liyana Shuib"}, {"authorId": "47566794", "name": "M. Nasir"}, {"authorId": "49536261", "name": "S. Asadi"}, {"authorId": "9173128", "name": "Sarminah Samad"}, {"authorId": "2499664", "name": "N. Awang"}], "citations": [{"paperId": "ae7ee15bac14ebbe2df5718079d67578dcbda124", "title": "Revolutionizing MSMEs: The Impact of Mobile Payment Readiness through TOE Framework"}, {"paperId": "6cbbf5f0b99fcc65e4e995d8b16f4d346ad01ae8", "title": "Roles of top management support and compatibility in big data predictive analytics for supply chain collaboration and supply chain performance"}, {"paperId": "6da5ddb68924a7dded376af5635072576df7c6ee", "title": "Do digital technologies pay off? A meta-analytic review of the digital technologies/firm performance nexus"}, {"paperId": "8be2a8fd754be78b2ceb510537cdbbb5d5e7ff2b", "title": "Large Scale Data Influences Based on Financial Landscape Using Big Data"}, {"paperId": "73b76ce6e65afa89e44c26c9b2c570c374325861", "title": "Potenciais antecedentes da adoção de Business Analytics na contabilidade"}, {"paperId": "b8a1276f8e355b1ec573dbb35b27d74230e7fb37", "title": "AI-enabled human capital management (HCM) software adoption using full consistency method (FUCOM): evidence from banking industry"}, {"paperId": "7cc8302a9aebc029b314c08430bd9f78dab740b3", "title": "Smart HRM 4.0 practices for organizational performance: the role of dynamic capabilities"}, {"paperId": "149aa24a89c079b47494df28fd3e42b69c87502c", "title": "Factor Influencing the Adoption of Big Data Analytics: A Systematic Literature and Experts Review"}, {"paperId": "e8d482aea21a3dcd4aa671b65eef4d1b313ee33f", "title": "The adoption of metaverse in the retail industry and its impact on sustainable competitive advantage: moderating impact of sustainability commitment"}, {"paperId": "bba2cd4118d2884f1e5ee5217e0cff4856046f19", "title": "How organizational learning dimensions influence firms’ competitive strategy and performance in a lower-middle-income country: A mediation model"}, {"paperId": "c73cdb993fcaaf4e1772c4054d67fde35308ae96", "title": "Factors influencing attitude and intention to use autonomous vehicles in Vietnam: findings from PLS-SEM and ANFIS"}, {"paperId": "ed5826b546b5ed1d5e81c13393e7181e50a80660", "title": "The e-government adoption ecosystem from the perspective of stakeholder theory: A case study on the village information systems in Indonesia"}, {"paperId": "e12f6741b067b5526b584b2b257b1021cf2498c5", "title": "Big Data-Driven Banking Operations: Opportunities, Challenges, and Data Security Perspectives"}, {"paperId": "0c9c3eeaa46d29204d271936e7041648e0697d1e", "title": "Personalized Tourism Recommendations and the E-Tourism User Experience"}, {"paperId": "12055baadcee770252ea76e2237c40c95376a7a2", "title": "Determining the Factors Influencing Business Analytics Adoption at Organizational Level: A Systematic Literature Review"}, {"paperId": "39430cbb0d49b5cd824ae5493c53ce2156cbb6bb", "title": "Rationalising Factors Influencing the Effective Utilisation of Big Data in Malaysian Fintech Companies"}, {"paperId": "0be5788094be19c52bf9095b76e7fe7223089818", "title": "Big Data Anaytics in Small And Medium Enterprises"}, {"paperId": "41923e00f1b123c80bd5870fd2fd3b0234d07bf8", "title": "The assessment of factors influencing Big data adoption and firm performance: Evidences from emerging economy"}, {"paperId": "6aaf086eed0c6b77c51c9b057c7b8d71861cec6d", "title": "What factors affect firm performance in the hotel industry post-Covid-19 pandemic? Examining the impacts of big data analytics capability, organizational agility and innovation"}, {"paperId": "c34ba0d69386dbfc2f4fd6cb9565267ff0587ada", "title": "Identifying determinants of big data adoption in the higher education sector using a multi-analytical SEM-ANN approach"}, {"paperId": "a557eaae5457fb8136cac0cba0a2d877e0eb6107", "title": "Influence of big data adoption on sustainable marketing and operation of SMEs: a hybrid approach of SEM-ANN"}, {"paperId": "0b58d7bd8447729048e22ec09a477a8a3a8597bf", "title": "Customer-centered data power: Sensing and responding capability in big data analytics"}, {"paperId": "489cc2be8f19267d4057f47877934fd4ab3d078d", "title": "Prevalence of Comorbidities and Associated Factors among HIV Patients Attending Antiretroviral Clinics in the Tamale Metropolis, Ghana"}, {"paperId": "5d3f423418d59d23c98dccb03d6b6ce8d1c8d4dc", "title": "Big Data Analytics Capability Ecosystem Model for SMEs"}, {"paperId": "baeabbd0b0cf14de63782b4093dd8f63763f6e8c", "title": "A Survey on Big Data Technologies and Their Applications to the Metaverse: Past, Current and Future"}, {"paperId": "a168669ba75b26d82c2a980ed93f1e3affe99400", "title": "A SEM-STELLA approach for predicting decision-makers’ adoption of cloud computing data center"}, {"paperId": "97bf84ae70066516f0d09475b53df042dc2d7543", "title": "Antecedents of Big Data Analytic Adoption and Impacts on Performance: Contingent Effect"}, {"paperId": "92226b35122d698aaa38c11a673d80190fc8331a", "title": "Board governance and audit report lag in the light of big data adoption: the case of Egypt"}, {"paperId": "dd544aeaef615020b01c26b808da7f279ec74679", "title": "Applications of disruptive digital technologies in hotel industry: A systematic review"}, {"paperId": "61003709f2c26b5b0b5a6f500f3f87b49e7fc7a2", "title": "Factors Influencing the Adoption of Blockchain in the Construction Industry: A Hybrid Approach Using PLS-SEM and fsQCA"}, {"paperId": "1e3db089ec98cd1f78ed14fc6fe67d00b32ba8d8", "title": "Factors impacting customer purchase intention of smart home security systems: Social data analysis using machine learning techniques"}, {"paperId": "7f6445bb9ec8f9b756b60dfaaaff6ce650459ec5", "title": "The role of innovation type and country context in diffusion of innovative technologies in organisations – a meta-analytic review"}, {"paperId": "fbef3eea233fe44b35e566ddf407826a12fd7f9e", "title": "What translates big data into business value? A meta-analysis of the impacts of business analytics on firm performance"}, {"paperId": "9a598a955068d5c6e7ec8ab65bca0747e9b00751", "title": "Can intellectual capital promote the competitive advantage? Service innovation and big data analytics capabilities in a moderated mediation model"}, {"paperId": "bf34de60adf2fd496435c6e4023081e077a58f52", "title": "An application of data mining algorithms for predicting factors affecting Big Data Analysis adoption readiness in SMEs."}, {"paperId": "5f36e2957c8167e8983ca993e2b8d96be3718ad2", "title": "Determinants of intention to adopt big data and outsourcing among SMEs: organisational and technological factors as moderators"}, {"paperId": "0c7bf27cb488452614cb092fe8fad8614c3b41d0", "title": "Bridging the marketing-finance divide: use of customer voice in managerial decision-making"}, {"paperId": "c4a4dca703a8d1c95de65f34dbc7b620db09764f", "title": "Factors affecting hotel managers’ intentions to adopt robotic technologies: A global study"}, {"paperId": "2b6db5dbbd1f3d4b1d54de91f608330f25ba7654", "title": "Big Data in Entrepreneurship"}, {"paperId": "3997b95bccff703813b9b3e705f3ea54b96b31a3", "title": "Supply chain analytics adoption: Determinants and impacts on organisational performance and competitive advantage"}, {"paperId": "7c6ac9afb7b4ff753379c40064385b6fc563c969", "title": "Determinants of big data analytics adoption in small and medium-sized enterprises (SMEs)"}, {"paperId": "9751ae419fb7ecbf235deff39376dc11d4b50b6f", "title": "How Does Awareness Toward the Industry 4.0 Applications Affect Firms' Financial and Innovation Performance?"}, {"paperId": "630e0abbfb642e7531ee3b8702672a90165e9402", "title": "Assessing behavioral intention toward green hotels during COVID-19 pandemic: the moderating role of environmental concern"}, {"paperId": "9e85480b073e96d03cb3cbc4470debbacaa9574a", "title": "Two-tier price membership mechanism design based on user profiles"}, {"paperId": "c78062c8c1d6b3106c4d1e3e8f534746a58a246e", "title": "Adoption of Cloud Computing in E-Government: A Systematic Literature Review"}, {"paperId": "cd44bf8a46ae23fa57590f55a702af605088591d", "title": "Cross-national differences in big data analytics adoption in the retail industry"}, {"paperId": "f83fe1718d958995a1eba6575a1e2714e9547d49", "title": "Regional Tourism Performance Research: Knowledge Foundation, Discipline Structure, and Academic Frontier"}, {"paperId": "3023128d90a9ddbc275b8703d108ca838559f37a", "title": "A Model for Decision-Makers’ Adoption of Big Data in the Education Sector"}, {"paperId": "8ed7c6fd5d50b782a46208aaff92d1df0abebdd9", "title": "THE RELATIONSHIP BETWEEN COMPETITIVE INTELLIGENCE PROCESSES AND HOTELS' INFORMATION QUALITY: EVIDENCE FROM MALAYSIA"}, {"paperId": "0d12c0d9c92c0cf5613149d22c46043720b33fb4", "title": "THE RELATIONSHIP BETWEEN COMPETITIVE INTELLIGENCE PROCESSES AND HOTELS' PERFORMANCE: EVIDENCE FROM MALAYSIA"}, {"paperId": "197bc47a81741c05e51f711caed216cb83103179", "title": "THE IMPACT OF COMPETITIVE INTELLIGENCE ACQUISITION AND UTILIZATION ON HOTELS' PERFORMANCE: EVIDENCE FROM MALAYSIA"}, {"paperId": "4b3b48c19b47504c450e796093c3c81d1f3d4fb6", "title": "Adoption of Big Data Analytics and Its Impact on Organizational Performance in Higher Education Mediated by Knowledge Management"}, {"paperId": "f29e8e6a61b2dfaf8c9fecc24fd513f773e7f125", "title": "Business Intelligence and Business Value in Organisations: A Systematic Literature Review"}, {"paperId": "922f03ea22ad03190837afb50fd26d549fc270ba", "title": "The Current State of Big Data Research in Tourism: Results of a Systematic Literature Analysis"}, {"paperId": "5f386795b8c9b6013c6b658f2123895e8a1e7123", "title": "Green human resource management practices and environmental performance in Malaysian green hotels: The role of green intellectual capital and pro-environmental behavior"}, {"paperId": "54dc49de4b75a734ff40d34b3b19bb70dca45507", "title": "Too few, too many, just right: Creating the necessary number of segments for large online customer populations"}, {"paperId": "c03455c69ce276da582feb3e9802de869eb31638", "title": "The Assessment of Big Data Adoption Readiness with a Technology–Organization–Environment Framework: A Perspective towards Healthcare Employees"}, {"paperId": "4520267684382dcea30604028b2919d5b25d8251", "title": "Regional measurement of the hotel sector development of a tourist destination (on the example of Odessa region, Ukraine)"}, {"paperId": "85751e7b5f6f71afc664346df4b76d45e7903bb4", "title": "The Impact of Big Data on Banking Operations"}, {"paperId": "f4d53112c454620221f777fca85c3a3d4915500a", "title": "Analysis of the Impact of Big Data on E-Commerce in Cloud Computing Environment"}, {"paperId": "78afbb57327c5207f90c3281783e4354bf7f810f", "title": "The Adoption of Big Data Analytics Among Manufacturing Small and Medium Enterprises During Covid-19 Crisis in Malaysia"}, {"paperId": "23832672bbbab85a3f6ce40589ad8cbfe64eff2c", "title": "Not all qualities are equal: Moderating role of online shopper conscientiousness in quality evaluation"}, {"paperId": "10b350b428cc94803e0c3f7778645e5979336745", "title": "Predicting Big Data Adoption in Companies With an Explanatory and Predictive Model"}, {"paperId": "402c4a87f7858c74245772e4c5322570bb57c9f2", "title": "Organizational Learning as A Determining Factor in Firm Performance"}, {"paperId": "7b896c4897a151a1f9f0e528051f9339c9efce9a", "title": "Is a Disruptive Technology Disruptive? The Readiness Perspective Based on TOE"}, {"paperId": "72d0d6f5f4a4b9a1063c982a0ed3654aa5c42415", "title": "Use of Big Data Tools and Industrial Internet of Things: An Overview"}, {"paperId": "9e33fe27a188e3ccaf271e24b9b423a0368da1c4", "title": "Factors impacting consumers’ intention toward adoption of electric vehicles in Malaysia"}, {"paperId": "ad4a99ec00f79d167818783538258bd7969b59b1", "title": "The Impact of Big Data Adoption on SMEs' Performance"}, {"paperId": "b241da5a4dada67bc36b19c24b8cb73d03f97172", "title": "Adoption of artificial intelligence (AI) for talent acquisition in IT/ITeS organizations"}, {"paperId": "60574fd8268fdbc184bec739be8e333879bd2c49", "title": "Investigating influence of green innovation on sustainability performance: A case on Malaysian hotel industry"}, {"paperId": "41e496c61c3f5a91e6e7e60711a37ff66734e9ea", "title": "An Examination on the Effects of Technology Acceptance Model in Electronic Human Resource Management"}, {"paperId": "f55e45b2d2375a555eb895e88b3dbc9a6718b3ce", "title": "Coronary Heart Disease Diagnosis Through Self-Organizing Map and Fuzzy Support Vector Machine with Incremental Updates"}, {"paperId": "a60a4e5f7f872b9825ddff5d379857c2091ca52b", "title": "Current landscape and influence of big data on finance"}, {"paperId": "b3012ec01ca9b875dcc6faef2aaa273c5732f024", "title": "Neuromarketing: A Review of Research and Implications for Marketing"}, {"paperId": "df76be8adeff0a68ac40094f154adfec08ce5aec", "title": "Organizational Performance and Adoption of Green IT from the Lens of Resource Based View"}, {"paperId": "ed76dac2c61b3002273cccc6d43c7a1296ffe16a", "title": "Antecedents of Business Analytics Adoption and Impacts on Banks’ Performance: The Perspective of the TOE Framework and Resource-Based View"}, {"paperId": "8d923b36652517022f13bfcf00ce905dd11ef51b", "title": "Linking big data and total quality management: A proposed theoretical research framework of digital maturity mediation"}, {"paperId": "a1f19a011da8f34dcb1a374dab97f7f70f0e0853", "title": "Factors Affecting the Adoption of Big Data Analytics in Hotels"}, {"paperId": "887298f5471bc7bb07ab7516431883882ff62cab", "title": "How to Improve Organizational Performance Using Big Data in the Hotels"}, {"paperId": "bff283e1af3dc8a7406d66a8e88af8337ac45018", "title": "E-Commerce and SME Performance: The Moderating Inﬂuence of Entrepreneurial Competencies"}, {"paperId": "9a146fc949b22ac3a10147b80a9bdf5217b105d9", "title": "The role of the social and technical factors in creating business value from big data analytics: A meta-analysis"}, {"paperId": "65fa57a72ea90a3f2c7cda45b47394cc54d64d62", "title": "Relationship between social culture, industry 4.0, and organizational performance in the context of emerging economies"}, {"paperId": "40a118f9c9c992424509fca7ab585ef21cf60897", "title": "Potential antecedents to the adoption of Business Analytics in accounting"}]}
