{"paperId": "cd903147b38515d38458232c3547f0e808bc8ed2", "publicationVenue": {"id": "4e2cdc38-ba7c-4b66-a16e-c480064b1bf6", "name": "Education for Information", "type": "journal", "alternate_names": ["Educ Inf"], "issn": "0167-8329", "url": "http://content.iospress.com/journals/education-for-information"}, "title": "A framework for the incorporation of digital scholarship contents in South African Library and Information Science Schools", "abstract": "Education curricula need constant updates in response to job market requirements, which may be influenced by the changing technological environment. In the library and information science (LIS) job market there are dynamics brought about by the Fourth Industrial Revolution (4IR). These dynamics call for LIS schools to reconsider their curricula in line with the job market. The job markets expect the education system to reflect their demands, as they are the primary clients. This study explored the education and training of LIS professionals on digital scholarship in line with the LIS curriculum in higher education institutions of South Africa. This was to enable the development of a framework for incorporating digital scholarship into the LIS curriculum. Wolf’s (2007) curriculum development model and an aspect of the customer satisfaction model (Zeithaml et al., 1993) informed the study. The models assisted in producing a framework that can be used to incorporate digital scholarship content into the LIS curriculum in South Africa. The framework suggests that when developing digital scholarship, consultation with relevant stakeholders both internal and external should be considered. Relevant infrastructure and resources should also be in place when developing a digital scholarship curriculum. The relevant infrastructure should include the 4IR-driven infrastructure such as smart sensors, three-dimension (3D) modeling, and cybersecurity tools, among others. Relevant documentation such as resources in the form of policies, course outlines, and other curriculum-related documents should also be consulted. This model, if adopted, could assist LIS schools in developing a curriculum that is driven by digital scholarship, leading to the production of LIS graduates that meet the requirements of the current LIS job market.", "venue": "Education for Information", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-03", "journal": {"name": "Education for Information"}, "authors": [{"authorId": "102146197", "name": "P. Sibiya"}, {"authorId": "69962762", "name": "P. Ngulube"}], "citations": []}
