{"paperId": "cd9b7432e3299d53e9aedf80f28cd1b5c1142129", "publicationVenue": {"id": "90b142da-9c11-4f10-a910-546c1e0795db", "name": "Science and Technology for the Built Environment", "type": "journal", "alternate_names": ["Sci Technol Built Environ"], "issn": "2374-4731", "url": "http://www.tandfonline.com/loi/uhvc21"}, "title": "A performance assessment method for district cooling substations based on operational data", "abstract": "Many district cooling systems suffer from low delta-Ts due to faults in the substations and buildings. This causes increased pumping costs, congested distribution networks and operation of more chillers. To enable fault detection and further diagnosis of district cooling substations, knowledge about the actual performance is needed. In this paper, a method using performance indicators to assess the performance of individual district cooling substations was developed along with a ranking system for substation comparison purposes. The performance assessment method was tested on 26 substations in a district cooling system by developing an algorithm. The input to the method was historical operational data collected from the substations’ primary and secondary sides from four years. The output summarized the performance of the substation in a few seconds and the ranking indicated which substation is in most need of improvement. The performance assessment can be conducted with only primary data as input but including secondary data from the building system provides additional information about the substation efficiency along with potential improvement measures. The method can be implemented by a utility company to serve as decision support and facilitate continuous follow-up of the substations to subsequently enable fault detection of district cooling substations.", "venue": "Science and Technology for the Built Environment", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-10-06", "journal": {"name": "Science and Technology for the Built Environment", "pages": "1472 - 1488", "volume": "28"}, "authors": [{"authorId": "101657657", "name": "Maria Jangsten"}, {"authorId": "1659126588", "name": "Torbjörn Lindholm"}, {"authorId": "152581820", "name": "J. Dalenbäck"}], "citations": [{"paperId": "7b2f775b2d765a52d42bf87674fba7adfb2e8e17", "title": "Low delta-T syndrome in cooling systems: A systematic review of the signs, symptoms, and causes"}]}
