{"paperId": "cd9bf94513c3906dd6c1d80d6056b425ea1b6217", "publicationVenue": {"id": "6991f0fc-b6fd-4f39-b3ba-68c0ec4139fb", "name": "RADIOELECTRONIC AND COMPUTER SYSTEMS", "alternate_names": ["RADIOELECTRON COMPUT SYST"], "issn": "1814-4225", "url": "http://nti.khai.edu/ojs/index.php/reks/index"}, "title": "Performance evaluation of various deployment scenarios of the 3-replicated Cassandra NoSQL cluster on AWS", "abstract": "A concept of distributed replicated NoSQL data storages Cassandra-like, HBase, MongoDB has been proposed to effectively manage Big Data set whose volume, velocity and variability are difficult to deal with by using the traditional Relational Database Management Systems. Tradeoffs between consistency, availability, partition tolerance and latency is intrinsic to such systems. Although relations between these properties have been previously identified by the well-known CAP and PACELC theorems in qualitative terms, it is still necessary to quantify how different consistency settings, deployment patterns and other properties affect system performance.This experience report analysis performance of the Cassandra NoSQL database cluster and studies the tradeoff between data consistency guaranties and performance in distributed data storages. The primary focus is on investigating the quantitative interplay between Cassandra response time, throughput and its consistency settings considering different single- and multi-region deployment scenarios. The study uses the YCSB benchmarking framework and reports the results of the read and write performance tests of the three-replicated Cassandra cluster deployed in the Amazon AWS. In this paper, we also put forward a notation which can be used to formally describe distributed deployment of Cassandra cluster and its nodes relative to each other and to a client application. We present quantitative results showing how different consistency settings and deployment patterns affect Cassandra performance under different workloads. In particular, our experiments show that strong consistency costs up to 22 % of performance in case of the centralized Cassandra cluster deployment and can cause a 600 % increase in the read/write requests if Cassandra replicas and its clients are globally distributed across different AWS Regions.", "venue": "RADIOELECTRONIC AND COMPUTER SYSTEMS", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-11-29", "journal": {"name": "RADIOELECTRONIC AND COMPUTER SYSTEMS"}, "authors": [{"authorId": "144272633", "name": "A. Gorbenko"}, {"authorId": "2090631172", "name": "A. Karpenko"}, {"authorId": "145826913", "name": "O. Tarasyuk"}], "citations": []}
