{"paperId": "cd9c7f1309e47036bd603d5bd6fbe003d0833faa", "publicationVenue": {"id": "e9a44b89-3d84-4bff-8c78-c53cd2ad7cf8", "name": "Foods", "type": "journal", "issn": "2304-8158", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-277853", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-277853", "https://www.mdpi.com/journal/foods/about", "https://www.mdpi.com/journal/foods"]}, "title": "Bacterial Communities Related to Aroma Formation during Spontaneous Fermentation of ‘Cabernet Sauvignon’ Wine in Ningxia, China", "abstract": "Bacteria are an important part of wine ‘microbial terroir’ and contribute to the formation of wine flavor. Based on high-throughput sequencing and non-targeted metabonomic technology, this study first explored the bacterial composition and its effect on the aroma formation of spontaneously fermented ‘Cabernet Sauvignon’ (CS) wine in the Eastern Foot of Helan Mountain (EFHM), Ningxia. The results showed that there were significant differences in bacterial communities during fermentation of CS grapes harvested from different sub-regions of EFHM, with the earlier-established vineyard obtaining more species. The level of bacterial diversity initially decreased and then increased as the fermentation proceeded. Malolactic fermentation (MLF) was spontaneously initiated during alcohol fermentation (AF). Pantoea, Lactobacillus, Rhodococcus, Fructobacillus, and Komagataeibacter were the core bacterial genera in the fermentation mixture. Lactobacillus contributed to the synthesis of methyl and isobutyl esters and the formation of red and black fruity fragrances of wine. Fructobacillus was closely related to the synthesis of aromatic alcohols and the generation of floral flavors.", "venue": "Foods", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-09-01", "journal": {"name": "Foods", "volume": "11"}, "authors": [{"authorId": "2185023860", "name": "Zhong Zhang"}, {"authorId": "2048181884", "name": "Qingchen Zhang"}, {"authorId": "2155585670", "name": "Hui Yang"}, {"authorId": "46733096", "name": "Lijun Sun"}, {"authorId": "2184361941", "name": "Hongchuan Xia"}, {"authorId": "48423885", "name": "Wen-Yang Sun"}, {"authorId": "2159407335", "name": "Zheng Wang"}, {"authorId": "49050194", "name": "Junxiang Zhang"}], "citations": [{"paperId": "37266d206de0d733a5a0bd3d1f3e05f3d8bab07e", "title": "Volatilome, Microbial, and Sensory Profiles of Coffee Leaf and Coffee Leaf-Toasted Maté Kombuchas"}, {"paperId": "08709b16322d20074acbd5c7faf5ab8a8be44be4", "title": "Microbiota Ecosystem Services in Vineyards and Wine: A Review"}, {"paperId": "aa44a2e3b53c79839c8485435810daa5edf8fa6e", "title": "Diversity of ‘Cabernet Sauvignon’ Grape Epidermis and Environmental Bacteria in Wineries from Different Sub-Regions of the Eastern Foothills of Helan Mountain, Ningxia"}, {"paperId": "1841edac59af9082f4560032f05db840e9ac6de8", "title": "Comparison between vacuum and modified-atmosphere packaging on dynamic analysis of flavor properties and microbial communities in fresh-cut potatoes (Solanum tuberosum L.)"}, {"paperId": "eb7c24ba3c1b8861d7fda108604b27dba8202484", "title": "The bacterial succession and its role in flavor compounds formation during the fermentation of cigar tobacco leaves"}, {"paperId": "adf5290f6e641a0a53f1ed27da7aab9bf6a7002f", "title": "Wine aroma modification by Hanseniaspora uvarum: A multiple-step strategy for screening potential mixed starters"}, {"paperId": "3818a32e67195775de372aa1ef833ab98b6b0b0e", "title": "Volatile fingerprinting, sensory characterization, and consumer acceptance of pure and blended arabica coffee leaf teas."}, {"paperId": "3e35f8587673c6c08c355c87ebfcc8d482b8c876", "title": "Typical Aroma of Merlot Dry Red Wine from Eastern Foothill of Helan Mountain in Ningxia, China"}, {"paperId": "125f907145104046f5d4721a4e33bf76bfdeccce", "title": "Volatile, Microbial, and Sensory Profiles and Consumer Acceptance of Coffee Cascara Kombuchas"}, {"paperId": "7cbc5042f20115aea66805de563a7eaf5869a0c7", "title": "Comparison of microbial communities and volatile profiles of wines made from mulberry and grape"}, {"paperId": "f51eddbdcfbc817c79e010c1e8ca6c588d30c036", "title": "Exploring the ecological characteristics of natural microbial communities along the continuum from grape berries to winemaking."}, {"paperId": "1cbade5b8d6ca3cf003ddc281b3e11ebc2831b71", "title": "Novel insight into flavor and quality formation in naturally fermented low-salt fish sauce based on microbial metabolism."}]}
