{"paperId": "cd9deaf9e847b7b20b2b1f609de24c360aa25210", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Mobile Cloud-Based Big Healthcare Data Processing in Smart Cities", "abstract": "In recent years, the Smart City concept has become popular for its promise to improve the quality of life of urban citizens. The concept involves multiple disciplines, such as Smart health care, Smart transportation, and Smart community. Most services in Smart Cities, especially in the Smart healthcare domain, require the real-time sharing, processing, and analyzing of Big Healthcare Data for intelligent decision making. Therefore, a strong wireless and mobile communication infrastructure is necessary to connect and access Smart healthcare services, people, and sensors seamlessly, anywhere at any time. In this scenario, mobile cloud computing (MCC) can play a vital role by offloading Big Healthcare Data related tasks, such as sharing, processing, and analysis, from mobile applications to cloud resources, ensuring quality of service demands of end users. Such resource migration, which is also termed virtual machine (VM) migration, is effective in the Smart healthcare scenario in Smart Cities. In this paper, we propose an ant colony optimization-based joint VM migration model for a heterogeneous, MCC-based Smart Healthcare system in Smart City environment. In this model, the user’s mobility and provisioned VM resources in the cloud address the VM migration problem. We also present a thorough performance evaluation to investigate the effectiveness of our proposed model compared with the state-of-the-art approaches.", "venue": "IEEE Access", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2017-05-25", "journal": {"name": "IEEE Access", "pages": "11887-11899", "volume": "5"}, "authors": [{"authorId": "2804902", "name": "Md. Mofijul Islam"}, {"authorId": "144945769", "name": "M. Razzaque"}, {"authorId": "1745717", "name": "Mohammad Mehedi Hassan"}, {"authorId": "10714919", "name": "Walaa N. Ismail"}, {"authorId": "1702867", "name": "Biao Song"}], "citations": [{"paperId": "f7dbd43c0e3667f6aef58eac4a062935d309e89e", "title": "A systematic review on big data applications and scope for industrial processing and healthcare sectors"}, {"paperId": "af0c5fef6761c90fff0ba0c779a2c923d800a529", "title": "Resource Provisioning Techniques in Multi-Access Edge Computing Environments: Outlook, Expression, and Beyond"}, {"paperId": "4a52b16302e777c636fa87b24773aeb549b9b120", "title": "A Roadmap for Energy Saving Using Dynamic Load Balancing in Cloud and Fog Architecture"}, {"paperId": "05eff991f5047a7bdea38357589b8b9ce59af9a9", "title": "Using Software-Defined Networking for Data Traffic Control in Smart Cities with WiFi Coverage"}, {"paperId": "aa792837ab7a0f7d67f37a79aec768a750c47b88", "title": "Towards a Model of Big Health Care Data Analytics in Panama: Chronic Kidney Disease"}, {"paperId": "f383508b7b1ae18a230bc0e0e1ccc31035a86591", "title": "An Overview of Cyber Threats, Attacks, and Countermeasures on the Primary Domains of Smart Cities"}, {"paperId": "e85530ffb6dce57f19d742b198ac086a9369d602", "title": "Classification of clustered health care data analysis using generative adversarial networks (GAN)"}, {"paperId": "2f56cf35d8d27047c8a39a1d3b65dc222cf723f7", "title": "An IoT-Based Smart System with an MQTT Broker for Individual Patient Vital Sign Monitoring in Potential Emergency or Prehospital Applications"}, {"paperId": "7733e76922bcbde2a71d0c0cae221815bb0f5ab4", "title": "BOSS: A new QoS aware blockchain assisted framework for secure and smart healthcare as a service"}, {"paperId": "450f7dc427f4a200475ad2378387ce560073bb98", "title": "IoTaaS based Approach to Design of a WSN for Secure Smart City Monitoring"}, {"paperId": "f7d9ab14ed60b28704899f678e68fb81c4b6bc1a", "title": "Energy and cost trade-off for computational tasks offloading in mobile multi-tenant clouds"}, {"paperId": "9a23435e287423af7bc7238ec0d1b99f36fb7670", "title": "A Multifaceted Vigilare System for Intelligent Transportation Services in Smart Cities"}, {"paperId": "247883a2aec277dab1344085b0de04894b58bc51", "title": "Development of Novel Big Data Analytics Framework for Smart Clothing"}, {"paperId": "4bacf9ec8c43e38e94ea0b6f32abba34e80840ac", "title": "Smart solution for reducing the COVID‐19 risk using smart city technology"}, {"paperId": "dce79119613ce73deb97576e188bf80c44a3ff2b", "title": "A fog‐based ubiquitous exercise healthcare monitoring framework for smart cities"}, {"paperId": "b363319aec396a331cf34b695e421f75ba7dd94f", "title": "A Survey on Health Care facilities by Cloud Computing"}, {"paperId": "46cfa44b38a7c3575ac0b871cffe850dadc8c8a6", "title": "Certificateless searchable public key encryption scheme secure against keyword guessing attacks for smart healthcare"}, {"paperId": "93999b728da93b0b2c7a2242dd63c9c7881cff61", "title": "A Knowledge Management System for the Variation in Regional Clinical Pathways of Traditional Chinese Medicine Based on Smart Cloud Services"}, {"paperId": "543012dcecdf8eb34c727a2dc84c8e4a8c0dd7f2", "title": "Big Data Based Diabetes and Heart Disease Prediction System by Employing Supervised Learning Algorithm"}, {"paperId": "e1d8147b457585039eec04f1307f8956b9fab212", "title": "PTZ-Surveillance coverage based on artificial intelligence for smart cities"}, {"paperId": "8ad956e74c32e80b4309d8dc0c428b00104b8726", "title": "Smart Furniture as a Component of a Smart City—Definition Based on Key Technologies Specification"}, {"paperId": "15ef8e979d94279661d3a628d2c366074ca7ca3a", "title": "A Novel on Transmission Line Tower Big Data Analysis Model Using Altered K-means and ADQL"}, {"paperId": "38cb31c311237278c915c53ff68194a66f204d42", "title": "A Survey on Big Multimedia Data Processing and Management in Smart Cities"}, {"paperId": "349940d3ddf4e5ed4c4189b00adceb17a969d078", "title": "Application Components Migration in NFV-based Hybrid Cloud/Fog Systems"}, {"paperId": "f68a6d2f1625e73c85a98f4ed345357414e15b7d", "title": "Lightweight Privacy-Preserving Identity-Based Verifiable IoT-Based Health Storage System"}, {"paperId": "41bc0fe8b71a13c262bea7f979312c4dbde77118", "title": "Classification of Parkinson's Disease Using Various Machine Learning Techniques"}, {"paperId": "3646de5756b18d5ed0c234f95e2262a876f5a9c5", "title": "Virtualization-Based Security Techniques on Mobile Cloud Computing: Research Gaps and Challenges"}, {"paperId": "81da7e7aa47edbcc9637f4cc0a9099d50c005ee8", "title": "Big data analytics in smart grids: state‐of‐the‐art, challenges, opportunities, and future directions"}, {"paperId": "34b2ba236402132e3b3d04d5b9776a5aaeca3c26", "title": "Human Computer Interaction Design for Mobile Devices Based on a Smart Healthcare Architecture"}, {"paperId": "940089fbba824dde2e382c44e8023653a2d33b0b", "title": "Computing-Aware Base Station Sleeping Mechanism in H-CRAN-Cloud-Edge Networks"}, {"paperId": "1828b441d29607cf9c29acbbda8e0aaf7819ca1e", "title": "A cloud-based virtual caregiver for elderly people in a cyber physical IoT system"}, {"paperId": "3f08ec6513c71a7674f292b56b9005ce00745e9a", "title": "Edge-of-things computing framework for cost-effective provisioning of healthcare data"}, {"paperId": "443879e66a27da930f0308c75444a6eea5d3a687", "title": "SDN enabled BDSP in public cloud for resource optimization"}, {"paperId": "582c17f76531da39131fa5ec823e1559fea55d39", "title": "Virtual Machine Selection Strategy Based on Grey Wolf Optimizer in Cloud Environment: A Study"}, {"paperId": "02b173e2f4ff7882f80c52d32ffedb989cf148dc", "title": "Adaptive Neural Network Classifier-Based Analysis of Big Data in Health Care"}, {"paperId": "b4c9b9dd9e74d413bd89bb4eb5bbb88ac6f1441f", "title": "Mobile big data analysis with machine learning"}, {"paperId": "98611aeef0cc5f0d9759e34c91bdd1ccbfc3cdc4", "title": "m-Therapy: A Multisensor Framework for in-Home Therapy Management: A Social Therapy of Things Perspective"}, {"paperId": "01f9d76ee2f4010bf74ea130f42d076f4bba8ca9", "title": "A Survey on Machine Learning-Based Mobile Big Data Analysis: Challenges and Applications"}, {"paperId": "660507d504581e5fdda5de7dbb21b7e563c2b411", "title": "Performance prediction model for cloud service selection from smart data"}, {"paperId": "d91672cb7ad9192b024a047237dd8dc3cbdcd347", "title": "A New Context-Sensitive Decision Making System for Mobile Cloud Offloading"}, {"paperId": "9d5d510fad1a9ab3a1234a1803efc8858e01ae78", "title": "UbeHealth: A Personalized Ubiquitous Cloud and Edge-Enabled Networked Healthcare System for Smart Cities"}, {"paperId": "7c42b34841eae4b63b757858f4281addd24da006", "title": "Super-resolution of retinal images using multi-kernel SVR for IoT healthcare applications"}, {"paperId": "319ce14360e1446f05259750ab0a4a7f8d2b511d", "title": "Smart Traffic Management System for Traffic Control using Automated Mechanical and Electronic Devices"}, {"paperId": "f882449e7cd410352ff8b2c09ef9e2b3b0aa8250", "title": "Designing a course for smart healthcare engineering education"}, {"paperId": "846cd91e82680b62d492700e455573595ae93384", "title": "Развој модела мобилног здравства заснованог на wearable computing-у"}, {"paperId": "82995cee3d94f0c35a37341764dba99de55e37f3", "title": "A brief review of methods and approaches proposed in existing literature to address issues in wireless big data"}, {"paperId": "3572abf9b889850818b2c61c73e919f1cadd9e05", "title": "Exploiting IoT and big data analytics: Defining Smart Digital City using real-time urban data"}, {"paperId": "6e1ce805a8ced4c2234960cda6e938a1d39b9a0d", "title": "VIM: A Big Data Analytics Tool for Data Visualization and Knowledge Mining"}, {"paperId": "5253701adfa00ca3be26a722d4d8bea3ecff945a", "title": "Study and Analysis of Smart Applications in Smart City Context"}, {"paperId": "4a2973d9df5c777bbb3cae4cd3e72b5a5b81d73f", "title": "Multi-Criteria Decision Analysis Methods in the Mobile Cloud Offloading Paradigm"}, {"paperId": "a6c28866d22a19a874bd13ffa2a6f9ba299cce40", "title": "An Architecture Supporting Intelligent Mobile Healthcare Using Human-Computer Interaction HCI Principles"}, {"paperId": "543ac6f38a29670e032dac56632cb3c0e0b99d73", "title": "A Survey on IoT Applications in Smart Cities"}, {"paperId": "fa57c26a0d562db674cc42578b2f67be4a980b3c", "title": "A Review on Scope of Distributed Cloud Environment in Healthcare Automation Security and Its Feasibility"}, {"paperId": "d8882f182c3c39def82026b23e0c0f0c7ea7512c", "title": "An Intelligent Transportation System for Traffic\nManagement Over the Iot"}, {"paperId": "854fcd8e027df5a48be3b66b0d326823ca535999", "title": "Nature Inspired Based Meta-heuristic Techniques for Global Applications"}, {"paperId": "7cdf4e0cda33822f91a5b0ef86a020e3a9c77b75", "title": "Communication Improvement and Traffic Control Based on V2I in Smart City Framework"}, {"paperId": "5498b4167166201a72afeb07cfb6160ee8f3e482", "title": "IoT Sensor Data Analysis and Fusion Applying Machine Learning and Meta-Heuristic Approaches"}, {"paperId": "b23370cb9530e616dafc2efc289e06fce87e8792", "title": "Evaluation of smart health technologies with hesitant fuzzy linguistic MCDM methods"}, {"paperId": "b1a47fa78244d0d1aec570df973dc6902580d94d", "title": "BIG DATA Smart Meters PMUs / μ PMUs / Sample Value GIS Traffic User / Operators Input Weather Network ( Power / Communication ) Simulation Smart Appliances / sensors SCADA Field Measurement Units / RTUs Asset Inventory Social Media"}, {"paperId": "69e5b8c2bcf443e2d78b28213350433a4c2607a0", "title": "Nature Inspired Job Scheduling For E-Health Services In Mobile Cloud Computing"}, {"paperId": "a6a791753d13cbd7e5b40934dcf9d2fd86d22672", "title": "Impact of Smart Cities on Resource Conservation Based on Big Data Analysis"}, {"paperId": "bbaa06630378c34fe7f9ef5d49bda46eebfefb78", "title": "A Swarm Intelligence Model for Enhancing Health Care Services in Smart Cities Applications"}, {"paperId": "e05fb1b3f5507c1d521e3ca32f7f1dff9ee95057", "title": "A Machine Learning Model for Predicting of Chronic Kidney Disease Based Internet of Things and Cloud Computing in Smart Cities"}, {"paperId": "26c19676940eb7925e9d768ca5c83b73c8016e2f", "title": "Smart Traffic Management and Secured Framework for Smart Cities"}, {"paperId": "f7c30971c559317de517dffd1029b9510b814cb9", "title": "BIG DATA IN SMART CITIES: A SYSTEMATIC MAPPING REVIEW"}, {"paperId": "e6523a9e3a3276516b9cf0246271851c43a50daa", "title": "A Centralized Health Monitoring System Using Health Related Sensors Integrated to the Mobile"}, {"paperId": "bb373116f647af3b8a411951e95bf9b10276a8b5", "title": "Implementation of Smart Cities under IoT & Big data Analytics"}, {"paperId": "48441afe2ba265b6b4c1a216b0fb65623024e8d1", "title": "International Journal of Scientific Research in Computer Science, Engineering and Information Technology"}]}
