{"paperId": "cda10bf8e5720af4651908d79f1a7f6f80979b54", "publicationVenue": null, "title": "Data series management: The next challenge", "abstract": "There is an increasingly pressing need, by several applications in diverse domains, for developing techniques able to index and mine very large collections of sequences, or data series. Examples of such applications come from biology, astronomy, entomology, the web, and other domains. It is not unusual for these applications to involve numbers of data series in the order of hundreds of millions to billions, which are often times not analyzed in their full detail due to their sheer size. In this study, we describe recent efforts in designing techniques for indexing and mining truly massive collections of data series that will enable scientists to easily analyze their data. We argue that the main bottleneck in mining such massive datasets is the time taken to build the index. Therefore, we discuss solutions to this problem, including novel techniques that adaptively create data series indexes, allowing users to correctly answer queries before the indexing task is finished. Finally, we present our vision for the future of the very promising data series management research.", "venue": "2016 IEEE 32nd International Conference on Data Engineering Workshops (ICDEW)", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2016-05-16", "journal": {"name": "2016 IEEE 32nd International Conference on Data Engineering Workshops (ICDEW)", "pages": "196-199"}, "authors": [{"authorId": "1725167", "name": "Themis Palpanas"}], "citations": [{"paperId": "bdbaeb03fe4b0860afe29368e976558a354dbe4b", "title": "System Network Analytics: Evolution and Stable Rules of a State Series"}, {"paperId": "5f6c556d70cb217bcbe9ea8a6aeec9be08f8ce65", "title": "System Network Complexity: Network Evolution Subgraphs of System State Series"}, {"paperId": "9b8ea72cb7fb60173af7001b24f27590e0041285", "title": "System Evolution Analytics: Deep Evolution and Change Learning of Inter-Connected Entities"}, {"paperId": "f29c675e6d661d994b4ce075e2b0d1378e30944a", "title": "Done Yet? A Critical Introspective of the Cloud Management Toolbox"}, {"paperId": "e1f2932ac11adb90b3c628e041e28bac215f47bf", "title": "Time Series Management Systems: A Survey"}, {"paperId": "cf662e70ee1405edc0a8e0003f962097e7180840", "title": "The Parallel and Distributed Future of Data Series Mining"}, {"paperId": "68c12226f985570ff50331c43877dc40d18019d9", "title": "EC-CENTRIC: An Energy- and Context-Centric Perspective on IoT Systems and Protocol Design"}, {"paperId": "70302d7a72b2409e2f759d1f6c1ffb362c518f38", "title": "Aalborg Universitet Time Series Management Systems : A Survey"}, {"paperId": "bde7cf1b5973f2e2c9587e49e1887b714d2d2b4c", "title": "The Parallel and Distributed Future of Data Series Mining Themis"}]}
