{"paperId": "cdaf98a99cbd907e065976565438757a031eaf10", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "When Road Information Meets Data Mining: Precision Detection for Heading and Width of Roads", "abstract": "Real-time road information plays a crucial role in enabling intelligent transportation systems (ITS) applications. With sufficient road information, the map of road topography can be built and updated more easily. Furthermore, many appealing ITS applications can be enabled accordingly. Aiming at improving the quality and update rate of road information, a hot topic today is how to mine information from global positioning systems (GPS) trajectories by the clustering-based methods. Such schemes, however, encounter two challenges: 1) GPS noise and 2) low sampling rate of GPS traces data. As a result, it is difficult to infer road information from these irregular clusters. To tackle the above issues, we directly mine useful road information, heading, and width of roads, for ITS applications from GPS point cloud, i.e., a set of GPS points. First, the distribution of GPS points is discussed and the least squares method (LSM) is demonstrated to be outstanding for mining the heading of the road under a huge number of GPS points. Second, the weighted approximation least squares method is proposed to improve the accuracy of the LSM. Furthermore, combining with relevant distribution features in GPS points, the data distribution variance-road width discrete model is proposed to mine road width from GPS point cloud. Finally, using real-world datasets, we demonstrate that these proposed methods can achieve satisfactory performance in practice.", "venue": "IEEE Access", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-03-05", "journal": {"name": "IEEE Access", "pages": "60399-60410", "volume": "7"}, "authors": [{"authorId": "2117916328", "name": "Xun Zhou"}, {"authorId": "40192242", "name": "Xuelian Cai"}, {"authorId": "89734363", "name": "Yuehang Bu"}, {"authorId": "2129080419", "name": "Xi Zheng"}, {"authorId": "38152929", "name": "Jiong Jin"}, {"authorId": "9533837", "name": "T. Luan"}, {"authorId": "7431623", "name": "Changle Li"}], "citations": [{"paperId": "6871c13ee85463a120fa873e9874d76b5c8212e2", "title": "DASUIP: Driver Alerting System for Smart Safetyusing Image Processing"}, {"paperId": "2d5f811562d4eb32bd5cc9fc40d525e39cee80a2", "title": "Wide-Attention and Deep-Composite Model for Traffic Flow Prediction in Transportation Cyber–Physical Systems"}, {"paperId": "992e1403f15e036a3a256b08c1ed6b575d25c66e", "title": "Traffic Data Imputation and Prediction: An Efficient Realization of Deep Learning"}, {"paperId": "60fcd966a95e90ad848128ba79582ac278cbc232", "title": "Real-Time Simulation in Real-Time Systems: Current Status, Research Challenges and A Way Forward"}, {"paperId": "b3785c1e7db7170ccb07ed80b61881692389a100", "title": "Real-Time Simulation Support for Real-Time Systems"}]}
