{"paperId": "cdcab36d609cfd8961483766891d2bb97bc8f8b8", "publicationVenue": {"id": "0dc0e794-53db-401d-bd8f-8da9165b2865", "name": "International Conferences on Contemporary Computing and Informatics", "type": "conference", "alternate_names": ["IC3I", "Int Conf Contemp Comput Informatics"]}, "title": "Classification of Sound using Convolutional Neural Networks", "abstract": "Sound has a significant impact on every aspect of human life. The study of sound classification has gained popularity recently across a wide range of fields. In a variety of industries, from essential surveillance to personal security, sound is frequently used to develop automated systems. Speech recognition is becoming increasingly crucial as technology advances, and artificial intelligence is a key component. The sound classifier systems are developed that address the efficiency issues of conventional systems by utilizing deep learning architectures. In this paper, it offers a deep learning method for classifying environmental noise based on generated spectrograms. The sounds that the people hear most frequently can now be detected by deep learning systems. Convolutional neural networks have recently been used to classify environmental noise. Using CNN spectrogram images, a convolutional neural network is trained to detect environmental noise. The performance recognition has been greatly enhanced by models of sound categorization systems based on convolutional neural networks (CNN). Large datasets with a greater number of labels are often needed for high-performance classification. The audio was processed using Mel spectrogram model 1, Mel spectrogram model 2 and MFCC spectrogram model and then transformed into an image. Based on the results, it is concluded that CNN model achieves 96.7% accuracy by utilizing hybrid spectrogram model to build a noise classification system.", "venue": "International Conferences on Contemporary Computing and Informatics", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-12-14", "journal": {"name": "2022 5th International Conference on Contemporary Computing and Informatics (IC3I)", "pages": "1015-1019"}, "authors": [{"authorId": "2144306154", "name": "A. Chaturvedi"}, {"authorId": "2225156059", "name": "Dr. Himanshu Rai Goyal"}, {"authorId": "2162907346", "name": "Suman Avdhesh Yadav"}, {"authorId": "118415286", "name": "Haftom Gebregziabher"}, {"authorId": "144874133", "name": "H. M. Salman"}, {"authorId": "2288660313", "name": "Dr. A Kakoli Rao"}], "citations": [{"paperId": "9c06f8be95c066f03110981758f57f9da4c0f277", "title": "Convolutional Neural Network Application for Detection & Classification of Brain Tumour"}, {"paperId": "3c639ec81e5d3bd61d2d6fe06acd38f3debecad0", "title": "Prediction of Concrete Strength with Artificial Neural Networks Enhanced by Nano-Silica"}, {"paperId": "e43db3df9472f1a5b890ee9a339d23dd749ccd09", "title": "Leveraging Recurrent Neural Networks for Diabetes Progression Monitoring"}, {"paperId": "f15117124be6a6a7ae31736fbb659f950b4dde4f", "title": "Object Detection in Images and Videos Using OpenCV: A Comparative Study of Deep Learning and Traditional Computer Vision Techniques"}, {"paperId": "0d5657da22d885d061127d826eb10f3281eb84ff", "title": "AI Driven Cognitive Radio Networks for Spectrum Optimization"}, {"paperId": "7c077de4479f08a04dced8a9919436328244faf1", "title": "Deep Learning Based Image Compression for Efficient Wireless Communication in IOT"}, {"paperId": "b1a439683d1adb3ce3222122ecd6daf71c4f350e", "title": "Comparison of Regression Techniques and Integration Models Using Machine Learning"}, {"paperId": "2a6d1fdbeae0144b94891307313627f977539cb5", "title": "Parking Slot Estimation and Occupancy Prediction using LSTM and CNN"}, {"paperId": "6c56ba35c4a94d083c655c7c8f6b2b89a17a9387", "title": "Sports Event Data Acquisition Method Based on Wireless Sensor Technology and BP Neural Networks"}, {"paperId": "69d13b051a7b1898a99886279ae11db1d5c381ed", "title": "Data Sharing Enabled Through Internet of Things (IoT) in Wireless Communication Networks"}, {"paperId": "27593883252b3d04cb42b38d31a842f27de02cdc", "title": "Deep Reinforcement Learning for Resource Allocation in Edge Computing for IoT"}, {"paperId": "336ee8604854daa0b3c3cb25d2de01f858bb008d", "title": "Classification of Ambient Noises in Signals Using 2D Fully Convolutional Neural Network"}, {"paperId": "6c3622030f233b267824762f66e68d8abcb6436b", "title": "An Eﬃcient Approach for Securing Audio Data in AI Training with Fully Homomorphic Encryption"}]}
