{"paperId": "cdd75e327c11cbdc9777fb34d22b2fa20a818d78", "publicationVenue": {"id": "f8912cb6-c5cb-446c-bb21-596484c48df0", "name": "IEEE Wireless Communications Letters", "type": "journal", "alternate_names": ["IEEE Wirel Commun Lett"], "issn": "2162-2337", "url": "http://www.comsoc.org/wcl", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=5962382"]}, "title": "Energy-Efficient Integrated Sensing and Communication: A Multi-Access Edge Computing Design", "abstract": "Integrated sensing and communication (ISAC) is regarded as an important paradigm in future networks. In this letter, we consider that the ISAC device can offload its collected sensing data to multiple edge-servers for remote processing via multi-access mobile edge computing (MEC). To this end, we formulate a joint optimization problem of the beamforming for radar sensing and the beamforming for offloading transmission, with the objective of maximizing the energy efficiency of ISAC device, which is defined as the ratio between the total information collected from the radar echo signal and the energy consumption of the ISAC device. Despite the non-convexity of the formulated joint optimization problem, we propose an efficient algorithm to find the optimal solutions. Numerical results are provided to evaluate the effectiveness of our proposed algorithm and demonstrate the performance advantage of our proposed multi-access MEC empowered ISAC.", "venue": "IEEE Wireless Communications Letters", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-01", "journal": {"name": "IEEE Wireless Communications Letters", "pages": "2053-2057", "volume": "12"}, "authors": [{"authorId": "2163628688", "name": "Ning Huang"}, {"authorId": "2180414176", "name": "Chenglong Dou"}, {"authorId": "2160043582", "name": "Yuan Wu"}, {"authorId": "144331823", "name": "L. Qian"}, {"authorId": "2055871900", "name": "Rongxing Lu"}], "citations": [{"paperId": "a2610d6339933850f13f9c3c8f2361200f9ba4c2", "title": "Reconfigurable Intelligent Surface assisted Integrated Communication, Sensing, and Computation Systems"}]}
