{"paperId": "cdda698ec83e85a9373a089bfe23b7e6c9dce20d", "publicationVenue": null, "title": "Machine Learning Techniques and Computing Technologies for IoT based Smart Healthcare (COVID-19 Case Study)", "abstract": "The exponential growth of smart devices and gadgets connected to the Internet of Things (IoT) produces massive amounts of data. The number of internet-connected devices is predicted to outnumber people by 25 to 50 billion by 2025. The new concept IoT refers to the combination of wired and wireless embedded communication technologies, sensors, actuators (transducers), and internet-connected items. The data generated by these IoT devices is in high velocity, variety, and varsity in accordance with location and time. IoT is generating data so it one of the primary sources of big data. Intelligent analysis and processing need an hour to develop smart IoT applications to tackle this huge volume of data. This article accesses various computing frameworks such as Cloud Computing, Fog Computing and Edge Computing environments for smarter IoT applications. This article also presents how machine learning algorithms can be incorporated in IoT data to get better insights. Various machine learning algorithms are explained and how these algorithms can be applied to data to get a higher level of information. This studies key contribution is how computing frameworks can be integrated with machine learning techniques in the healthcare sector to get better insights from the data. Mostly in this article, IoT and machine learning algorithms are discussed with respect to COVID-19. Moreover, the potential application areas and open issues of IoT data analytics and Machine Learning are discussed.", "venue": "2021 3rd International Conference on Advances in Computing, Communication Control and Networking (ICAC3N)", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Conference"], "publicationDate": "2021-12-17", "journal": {"name": "2021 3rd International Conference on Advances in Computing, Communication Control and Networking (ICAC3N)", "pages": "2089-2095"}, "authors": [{"authorId": "2015401874", "name": "M. Mir"}, {"authorId": "9370800", "name": "S. Jamwal"}, {"authorId": "41049378", "name": "S. Islam"}, {"authorId": "50877714", "name": "Q. Khan"}], "citations": [{"paperId": "7a715c1b6874a740df99c7c4ba80ebcb9a24dfb5", "title": "Review on Various Clustering Algorithm on Healthcare based Cloud Analytics"}, {"paperId": "04181003995f962a196d03ab0e6f582da0411421", "title": "An IoT/FOG based framework for sports talent identification in COVID-19 like situations"}]}
