{"paperId": "ce0174266132e7c6fc548c5e889df204b937eeec", "publicationVenue": {"id": "0aed7a40-85f3-4c66-9e1b-c1556c57001b", "name": "PLoS ONE", "type": "journal", "alternate_names": ["Plo ONE", "PLOS ONE", "PLO ONE"], "issn": "1932-6203", "url": "https://journals.plos.org/plosone/", "alternate_urls": ["http://www.plosone.org/"]}, "title": "Alzheimer’s disease diagnosis from diffusion tensor images using convolutional neural networks", "abstract": "Machine learning algorithms are currently being implemented in an escalating manner to classify and/or predict the onset of some neurodegenerative diseases; including Alzheimer’s Disease (AD); this could be attributed to the fact of the abundance of data and powerful computers. The objective of this work was to deliver a robust classification system for AD and Mild Cognitive Impairment (MCI) against healthy controls (HC) in a low-cost network in terms of shallow architecture and processing. In this study, the dataset included was downloaded from the Alzheimer’s disease neuroimaging initiative (ADNI). The classification methodology implemented was the convolutional neural network (CNN), where the diffusion maps, and gray-matter (GM) volumes were the input images. The number of scans included was 185, 106, and 115 for HC, MCI and AD respectively. Ten-fold cross-validation scheme was adopted and the stacked mean diffusivity (MD) and GM volume produced an AUC of 0.94 and 0.84, an accuracy of 93.5% and 79.6%, a sensitivity of 92.5% and 62.7%, and a specificity of 93.9% and 89% for AD/HC and MCI/HC classification respectively. This work elucidates the impact of incorporating data from different imaging modalities; i.e. structural Magnetic Resonance Imaging (MRI) and Diffusion Tensor Imaging (DTI), where deep learning was employed for the aim of classification. To the best of our knowledge, this is the first study assessing the impact of having more than one scan per subject and propose the proper maneuver to confirm the robustness of the system. The results were competitive among the existing literature, which paves the way for improving medications that could slow down the progress of the AD or prevent it.", "venue": "PLoS ONE", "year": 2020, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-03-24", "journal": {"name": "PLoS ONE", "volume": "15"}, "authors": [{"authorId": "1492038511", "name": "Eman N. Marzban"}, {"authorId": "47625037", "name": "A. Eldeib"}, {"authorId": "2583320", "name": "I. Yassine"}, {"authorId": "9171545", "name": "Y. Kadah"}], "citations": [{"paperId": "6d0628e55e05eb311b59be4dfd3a8b122c860bc2", "title": "Deep learning based computer aided diagnosis of Alzheimer's disease: a snapshot of last 5 years, gaps, and future directions"}, {"paperId": "93b8113c988abf4fd03be8208c2fa2365e0fe7f8", "title": "Brain MRI Image Analysis for Alzheimer’s Disease (AD) Prediction Using Deep Learning Approaches"}, {"paperId": "1b2fc5ff8648359b185a5cbebea7046d76c23746", "title": "Hidden Markov Model based Predicting of Alzheimer's Disease with graph cut segmentation using MR Diffusion Tensor Imaging (DTI)"}, {"paperId": "99c46cac8b4a0b9e91176f7651855ff0a8ff5347", "title": "Classification of Alzheimer’s Disease Based on White Matter Connectivity Network"}, {"paperId": "e56cefd165decb37b54a8f13c44f61b909271668", "title": "Predictive modelling of brain disorders with magnetic resonance imaging: A systematic review of modelling practices, transparency, and interpretability in the use of convolutional neural networks"}, {"paperId": "5138fde70bf4253c26b18c60643a24a2e008c646", "title": "Deep Learning Framework using Sparse Diffusion MRI for Diagnosis of Frontotemporal Dementia"}, {"paperId": "eec6a71cfe5c400ea05f7bf655d0b8297071fe8c", "title": "A systematic literature review and analysis of deep learning algorithms in mental disorders"}, {"paperId": "ddd24a680add9140ff1d146181c9770ecb20d1c8", "title": "Combining Unsupervised and Supervised Deep Learning for Alzheimer's Disease Detection by Fractional Anisotropy Imaging"}, {"paperId": "5b6e8289a04596b8a6af8ca57f4a68902bf35159", "title": "Multi-scale 3D-CNN for Alzheimer's Disease Classification"}, {"paperId": "a0916d400cf6bbeaa0183e4284c254a3b03dfeaf", "title": "Abnormal white matter changes in Alzheimer's disease based on diffusion tensor imaging: A systematic review"}, {"paperId": "0320b00698d5fd0268415b649ad3db9072483736", "title": "Alzheimer's Disease Classification From 2D MRI Brain Scans Using Convolutional Neural Networks"}, {"paperId": "8d82715789f921937fa3b49ca79810a67e3a135b", "title": "Can T1-Weighted Magnetic Resonance Imaging Significantly Improve Mini-Mental State Examination-Based Distinguishing Between Mild Cognitive Impairment and Early-Stage Alzheimer’s Disease?"}, {"paperId": "4845194917aba7287709e89cb1c876c98563f820", "title": "An Approach for Classification of Alzheimer’s Disease Using Deep Neural Network and Brain Magnetic Resonance Imaging (MRI)"}, {"paperId": "7c0f034e9a30970094419b052a85a472eaec8ad5", "title": "Classification of cognitively normal controls, mild cognitive impairment and Alzheimer's disease using transfer learning approach"}, {"paperId": "7fd481e0e4f6c2842a628682b70b5393ea10a1c5", "title": "A connectome-based deep learning approach for Early MCI and MCI detection using structural brain networks"}, {"paperId": "acec2b7f289c9e9b6454d8b48e0c41ad2c9e7061", "title": "MTNeuro: A Benchmark for Evaluating Representations of Brain Structure Across Multiple Levels of Abstraction"}, {"paperId": "603a6389c246bf7a960e738c890b14ea4ede5cdf", "title": "Graph Neural Network based Alzheimer’s Disease Classification using Structural Brain Network"}, {"paperId": "9f93b9402001bb87ca08a1652bd797a1c186d690", "title": "Multimodal magnetic resonance imaging for Alzheimer's disease diagnosis using hybrid features extraction and ensemble support vector machines"}, {"paperId": "da5c482082e9fe8aa87e20ed52a4b4cdba1e2096", "title": "Multi-modality MRI for Alzheimer's disease detection using deep learning."}, {"paperId": "c4c3d1bb87b792946d1d6f3ed541e782d2d51300", "title": "Prediction of Alzheimer’s Disease by a Novel Image-Based Representation of Gene Expression"}, {"paperId": "724270aab3ff7bcf8bf5b5f62ea7fb4c1d472f88", "title": "Alzheimer's disease diagnosis via multimodal feature fusion"}, {"paperId": "573a9d76f0f929613a01942c75278da305ea6715", "title": "Diagnostic Performance of Generative Adversarial Network-Based Deep Learning Methods for Alzheimer’s Disease: A Systematic Review and Meta-Analysis"}, {"paperId": "208e85903fe6662f057cc7bcecaa31e06fb96a1e", "title": "Optimization of VGG16 utilizing the Arithmetic Optimization Algorithm for early detection of Alzheimer's disease"}, {"paperId": "e93797080ce77e2aa739c504dfd0707bf2fb0b76", "title": "Artificial intelligence in brain MRI analysis of Alzheimer’s disease over the past 12 years: A systematic review"}, {"paperId": "afe697eeaa6d9b231187c7d1b8729967c9e288bd", "title": "Machine Learning Framework for the Prediction of Alzheimer's Disease Using Gene Expression Data Based on Efficient Gene Selection"}, {"paperId": "95aec6abaf88552b68bf02f09a50558d4ec86508", "title": "Applications of artificial intelligence to aid early detection of dementia: A scoping review on current capabilities and future directions"}, {"paperId": "9cfd81694d9a980b92a10bb2be03fc05973e9984", "title": "MAGNIMS recommendations for harmonization of MRI data in MS multicenter studies"}, {"paperId": "f2b3bd44dbdafc79324173700e7bba492e634eac", "title": "An Exploration: Alzheimer's Disease Classification Based on Convolutional Neural Network"}, {"paperId": "0e9f596753ea92dbce719a0af2ac57258c399d08", "title": "Magnetic Resonance Imaging-based Deep Learning Predictive Models of Brain Disorders: A Systematic Review of Modelling Practices, Transparency, and Interpretability"}, {"paperId": "1176c27949ab8d7f8cd98fae6eb9899d982db36f", "title": "Classification of Alzheimer's Disease Using Gaussian-Based Bayesian Parameter Optimization for Deep Convolutional LSTM Network"}, {"paperId": "744cf6d68a204686e4aea00f19c5f92d27f250f5", "title": "Images in Space and Time"}, {"paperId": "0bd343e03848372641037b4edb6b4f9479809277", "title": "Mild cognitive impairment classification using combined structural and diffusion imaging biomarkers"}, {"paperId": "d0efd261e12c316a0a4f50c2f673af04a04b6200", "title": "Machine Learning and Deep Learning Approaches for Brain Disease Diagnosis: Principles and Recent Advances"}, {"paperId": "33918f87b9baddd9b56ca20db8fae2946127976f", "title": "Rotation-Equivariant Deep Learning for Diffusion MRI"}, {"paperId": "7c26ec540fb2cc00ce3d1f60d425b221838bf089", "title": "Ensemble of ROI-based convolutional neural network classifiers for staging the Alzheimer disease spectrum from magnetic resonance imaging"}, {"paperId": "982c06261ab475bf4ff586bceb40f47a8ad3a9ce", "title": "Influence of medical domain knowledge on deep learning for Alzheimer's disease prediction"}, {"paperId": "710bf99ed7c5c9813b0ec90a7ee5ae1e1913de39", "title": "Machine Learning for the Classification of Alzheimer’s Disease and Its Prodromal Stage Using Brain Diffusion Tensor Imaging Data: A Systematic Review"}, {"paperId": "2bdbc154beb4da42520757ced57a52f2b0991fd4", "title": "Detection of gray matter microstructural changes in Alzheimer’s disease continuum using fiber orientation"}, {"paperId": "e2334139fdfb2991c6f14183ef55ace777147c07", "title": "Efficient Alzheimer’s disease segmentation on MRI brain image and classification using machine learning"}, {"paperId": "f359e2465e11742454b45c22232d32cb634651d9", "title": "A Novel Predictive Model for Alzheimer’s Disease Using Multi-view Brain Networks"}, {"paperId": "c9745c76f755e0f960bcef07ca4771f7c3bce738", "title": "An Improved LeNet-Deep Neural Network Model for Alzheimer’s Disease Classification Using Brain Magnetic Resonance Images"}]}
