{"paperId": "ce02260b57e29c880cd4b16e9871fe38453e0075", "publicationVenue": {"id": "289bfdda-eab3-4c9a-97be-ef1e0f9ddfc0", "name": "International Symposium on Software Testing and Analysis", "type": "conference", "alternate_names": ["ISSTA", "Int Symp Softw Test Anal"], "url": "https://dl.acm.org/conference/issta"}, "title": "Failure clustering without coverage", "abstract": "Developing and integrating software in the automotive industry is a complex task and requires extensive testing. An important cost factor in testing and debugging is the time required to analyze failing tests. In the context of regression testing, usually, large numbers of tests fail due to a few underlying faults. Clustering failing tests with respect to their underlying faults can, therefore, help in reducing the required analysis time. In this paper, we propose a clustering technique to group failing hardware-in-the-loop tests based on non-code-based features, retrieved from three different sources. To effectively reduce the analysis effort, the clustering tool selects a representative test for each cluster. Instead of analyzing all failing tests, testers only inspect the representative tests to find the underlying faults. We evaluated the effectiveness and efficiency of our solution in a major automotive company using 86 regression test runs, 8743 failing tests, and 1531 faults. The results show that utilizing our clustering tool, testers can reduce the analysis time more than 60% and find more than 80% of the faults only by inspecting the representative tests.", "venue": "International Symposium on Software Testing and Analysis", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2019-07-10", "journal": {"name": "Proceedings of the 28th ACM SIGSOFT International Symposium on Software Testing and Analysis"}, "authors": [{"authorId": "3409929", "name": "Mojdeh Golagha"}, {"authorId": "101010610", "name": "Constantin Lehnhoff"}, {"authorId": "144658639", "name": "A. Pretschner"}, {"authorId": "3344093", "name": "H. Ilmberger"}], "citations": [{"paperId": "8ab7411889b99436dd154959002be9b190deaf77", "title": "SURE: A Visualized Failure Indexing Approach using Program Memory Spectrum"}, {"paperId": "7ff2bb77d44d423eb268c67e14bb1b9a016b83f0", "title": "A Survey on Bug Deduplication and Triage Methods from Multiple Points of View"}, {"paperId": "d3a39944a4100f36c6e143106330c82f92dfe983", "title": "A novel failure indexing approach with run-time values of program variables"}, {"paperId": "57c863f18f869102edd156903e65cba6887a978c", "title": "Making Sense of Failure Logs in an Industrial DevOps Environment"}, {"paperId": "77439ca3f72162778ee146630dc6a2ba0b754961", "title": "Evolving Ranking-Based Failure Proximities for Better Clustering in Fault Isolation"}, {"paperId": "828ed5cbe49579346a91192220b9030ab0e3d125", "title": "Model-based Fault Classification for Automotive Software"}, {"paperId": "f6c5a9d0ff8a0f6e8dadba883388624c9ae79b21", "title": "A Comprehensive Empirical Investigation on Failure Clustering in Parallel Debugging"}, {"paperId": "7b2b68df2ba7c9e4ff9b7042485bc09f0cf12ce6", "title": "Automatically Identifying Shared Root Causes of Test Breakages in SAP HANA"}, {"paperId": "8f77b756736b63b092d33911f6d43bbb2cc96117", "title": "Buildsheriff: Change-Aware Test Failure Triage for Continuous Integration Builds"}, {"paperId": "13697ba6c68a1e9f4a56e82b42363b74a83e0564", "title": "Searching for Multi-Fault Programs in Defects4J"}, {"paperId": "0c31a8c0f5df3ab7f36b8f376567d93e1a22234a", "title": "Improving Test Distance for Failure Clustering with Hypergraph Modelling"}, {"paperId": "42d4081b6f4e369ba2a54579d6ebaae29d12cc68", "title": "Time-Series-Based Clustering for Failure Analysis in Hardware-in-the-Loop Setups: An Automotive Case Study"}]}
