{"paperId": "ce115a9d7d1cc7dcdebf903f4534cc9d7673db96", "publicationVenue": {"id": "79af09a2-54e8-4f97-8edf-9fba208ab744", "name": "International Journal of Digital Earth", "type": "journal", "alternate_names": ["Int J Digit Earth"], "issn": "1753-8947", "url": "http://www.informaworld.com/smpp/title~content=1753-8947", "alternate_urls": ["http://www.tandfonline.com/toc/tjde20/current"]}, "title": "Construction of rhombic triacontahedron discrete global grid systems", "abstract": "ABSTRACT Discrete Global Grid System (DGGS) is a new multi-resolution geospatial data modeling and processing scheme for the digital earth. The icosahedron is commonly regarded as an ideal polyhedron for constructing DGGSs with small distortions; however, the shape of its face is triangular, making it difficult to incorporate the matrix structure used for geospatial data storage and parallel computing. To overcome this limitation, this study utilizes the rhombic triacontahedron (RT) as the basic polyhedron to construct DGGSs. An equal-area projection between the surface of RT and the sphere is developed and used to design a grid-generation algorithm for the aperture 4 hexagonal DGGS based on RT. Compared with the equal-area DGGS based on the icosahedron, the proposed scheme results in smaller angular projection distortions, with the mean and standard deviation decreasing by 41.6% and 30.9%, respectively. The grid cells of the RT DGGS also achieve more optimized geometric characteristics in shape compactness, length deviation, and angle deviation than those in the icosahedron DGGS. Additionally, the cross-surface computation efficiency provides advantages in code conversion to latitude and longitude and proximity queries. Furthermore, the use of RT offers a new and better framework within the context of DGGS research and application.", "venue": "International Journal of Digital Earth", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-10-14", "journal": {"name": "International Journal of Digital Earth", "pages": "1760 - 1783", "volume": "15"}, "authors": [{"authorId": "2188228550", "name": "Xiaoyu Liang"}, {"authorId": "50288910", "name": "J. Ben"}, {"authorId": "2151038236", "name": "Rui Wang"}, {"authorId": "2188001072", "name": "Qishuang Liang"}, {"authorId": "2175749650", "name": "Xinhai Huang"}, {"authorId": "2188203409", "name": "Junjie Ding"}], "citations": [{"paperId": "0ff9dfe1c4c2e4184a95dc4a26d433c9533ff339", "title": "Bidirectional mapping between rhombic triacontahedron and icosahedral hexagonal discrete global grid systems"}, {"paperId": "622185476c195bd8bc0c5a67fd409fcf2905be0f", "title": "Encoding and operation scheme for the rhombic triacontahedron aperture 4 hexagonal discrete global grid system"}, {"paperId": "6418abcee2feac60ccb479adf530035e241b610b", "title": "A multimetric evaluation method for comprehensively assessing the influence of the icosahedral diamond grid quality on SCNN performance"}, {"paperId": "2794284b1cc8556950c0c7b339dbef7fefdeb9f2", "title": "A Front Advancing Adaptive Triangular Mesh Dynamic Generation Algorithm and Its Application in 3D Geological Modeling"}]}
