{"paperId": "ce13ad395fde35ae93e8fa52fdd2a4a0772ea6eb", "publicationVenue": {"id": "5a293750-d4be-46f7-8b59-6c44f361ec57", "name": "Eye Tracking Research & Application", "type": "conference", "alternate_names": ["Eye Track Res  Appl", "ETRA"], "url": "http://etra.cs.uta.fi/"}, "title": "The Benefits and Drawbacks of Eye Tracking for Improving Educational Systems", "abstract": "Educational systems are based on the teaching inputs from teachers and the learning outputs from the pupils/students. Moreover, also the surrounding environment as well as the social activities and networks of the involved people have an impact on the success of such a system. However, in most of them, standard teaching equipment is used while it is difficult to gain some knowledge and insights about the fine-grained spatio-temporal activities in the classroom. On the other hand, understanding why an educational system is not that successful as it was expected, can hardly be explored by just generating statistics about the learning outputs based on several student-related metrics. In this paper we discuss the benefits of using eye tracking as a powerful technology to track people’s visual attention to explore the value of an educational system, however, we also take a look at the drawbacks that come in the form of data recording, storing, processing, and finally, data analysis and visualization to rapidly gain insights in such large datasets apart from many more. We argue that if eye tracking is applied in a clever way, an educational system might draw valuable conclusions to improve it from several perspectives, be it under the light of online/remote or classroom teaching or also from the perspectives of teachers and pupils/students.", "venue": "Eye Tracking Research & Application", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2022-06-08", "journal": {"name": "2022 Symposium on Eye Tracking Research and Applications"}, "authors": [{"authorId": "144484816", "name": "Michael Burch"}, {"authorId": "2142315654", "name": "Rahel Haymoz"}, {"authorId": "2166358874", "name": "Sabrina Lindau"}], "citations": [{"paperId": "cac006e0c0616379f817a2eb07ceec6f17c9f2df", "title": "Eye tracking in a teaching context: comparative study of the professional vision of university supervisor trainers and pre-service teachers in initial training for secondary education in French-speaking Belgium"}, {"paperId": "2d0d3bd5d568655ec2d371bf177935e956576603", "title": "VRMN-bD: A Multi-modal Natural Behavior Dataset of Immersive Human Fear Responses in VR Stand-up Interactive Games"}, {"paperId": "a95521e2773efa0014d33adc186aa3b4973aa0f1", "title": "A Consumer-tier based Visual-Brain Machine Interface for Augmented Reality Glasses Interactions"}]}
