{"paperId": "ce170715bf8e2633981b61b84e6f4468392ca2be", "publicationVenue": {"id": "661ae2a4-ae88-4ce1-a7a3-73bb04510f92", "name": "International Conference on Smart Communications and Networking", "type": "conference", "alternate_names": ["SmartNets", "Int Conf Smart Commun Netw"]}, "title": "Arabic Geo-Social Event Detection using a Hybrid Learning Architecture", "abstract": "Modern smart cities are increasingly driven by citizens’ generated content over social media. More people in the Arab world than ever are using social networks and user generated content to express their thoughts and feedback on trending topics. With this increase in use, the demand has risen to be able to analyze data from social networks using the native Arabic language. Because Arabic is one of the most complex languages, this presents many challenges such as how to differentiate dialects, how to infer the semantics of sentences and even words, and what to do with the numerous diacritics involved in the language. In this paper, we discuss geo-social event detection from Arabic tweets without focusing on any dialect. We propose a hybrid learning architecture by using a deep learning model and a clustering technique to detect social events and map them to their spatial and temporal properties. Our system features a semantic keyword generation tool powered by AraBERT, which is used to prepare datasets for event classification. The classification process involves using both CNN and bidirectional LSTM techniques. To determine the location of events, we utilized a hierarchical density-based spatial clustering method. Experiments were performed on Twitter datasets to assess the system’s effectiveness and efficiency. The findings indicate that this hybrid approach for extracting spatio-temporal events is well-suited for detecting and tracking events in real-time from social media.", "venue": "International Conference on Smart Communications and Networking", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-07-25", "journal": {"name": "2023 International Conference on Smart Applications, Communications and Networking (SmartNets)", "pages": "1-6"}, "authors": [{"authorId": "3166431", "name": "Imad Afyouni"}, {"authorId": "2233329231", "name": "Baraa Kakah"}, {"authorId": "2233328691", "name": "Maissan Bazazeh"}], "citations": []}
