{"paperId": "ce1816b76803652d382e30c291fa2ac9f0c300e1", "publicationVenue": null, "title": "Machine Learning for Predicting Stock Market Movement using News Headlines", "abstract": "There are many factors that affect performance of stock market, such as global and local economy, political events, supply and demand, and out of the ordinary events, as COVID-19 pandemic. The factors may not only influence the stock market movement, but also influence each other. We propose to observe the movement of Dow Jones Industrial Average in relations to daily news. We use top-5 news headlines from Reddit to create 1Day and 5-Day models to predict if Dow Jones Industrial Average movement will be in Down and Up direction from the moment the market opens till it closes. We propose use of shallow (traditional) Machine Learning algorithms and Deep Learning algorithms. Additionally, we explore the effect of word representation, using TF-IDF and GloVE approaches. Moreover, we evaluate our models in terms of accuracy of prediction on data sets containing data before pandemic and during pandemic. Our models show that Deep Learning models uniformly have higher accuracy than Machine Learning ones. Convolution Neural Network with TFIDF and 5 Days prediction performs the best for the dataset before the pandemic with accuracy of 59.6%. Gated Recurrent Unit (GRU), a class of Recurrent Neural Networks, with GloVe and 1 Day prediction outperforms the other models for dataset during the pandemic with the accuracy of 62.9%.", "venue": "2020 IEEE Green Energy and Smart Systems Conference (IGESSC)", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2020-11-02", "journal": {"name": "2020 IEEE Green Energy and Smart Systems Conference (IGESSC)", "pages": "1-6"}, "authors": [{"authorId": "40013516", "name": "Yang Liu"}, {"authorId": "2034351750", "name": "Jelena Trajkovic"}, {"authorId": "34162107", "name": "H. Yeh"}, {"authorId": "2108153586", "name": "Wenlu Zhang"}], "citations": [{"paperId": "eb7f43d696d8f718a9c4f0b2128d1c95bf666a3a", "title": "Value Prediction for Spatiotemporal Gait Data Using Deep Learning"}, {"paperId": "8c7d6bf2d4b9c65a17c98687f76cadf790c7192f", "title": "News-based intelligent prediction of financial markets using text mining and machine learning: A systematic literature review"}, {"paperId": "0682fa92e75f85f05cc6ff43f5df068f068634fb", "title": "Do Deep Learning Models and News Headlines Outperform Conventional Prediction Techniques on Forex Data?"}, {"paperId": "6014c4561c7e1314b1cc6cb2cfda20606ad07967", "title": "A Systematic Study on Sentiment Analysis based on Text Mining and Deep learning for Predictions in Stock Market Trends Through Social and News Media Data"}, {"paperId": "eab85140c62a50def4a3116c017da81b0bb5a8f1", "title": "Analysis of Stock Market Price Prediction of Indian Finance Companies using Artificial Neural Network Approaches"}]}
