{"paperId": "ce2172857452fb7c54dadcf04a3c6ba86d713ce3", "publicationVenue": {"id": "d2c0e84d-737d-4fe1-93b0-6c188f261f3c", "name": "International journal of advanced networking and applications", "type": "journal", "alternate_names": ["Int j adv netw appl", "International Journal of Advanced Networking and Applications", "Int J Adv Netw Appl"], "issn": "0975-0290", "url": "http://www.ijana.in/"}, "title": "Significance Of Big Data Frameworks And Speculative Approaches In Healthcare Systems", "abstract": "---------------------------------------------------------------------- ABSTRACT ----------------------------------------------------------- Due to rapid generation of large numbers of integrated medical data from various communities of the world, health care systems need to be stored and streamed properly. Heterogeneous data has been scattered from different healthcare medical records has various attributes and primarily they are not structured using data frameworks. In this paper we emphasized the various frameworks of big data and its significance in healthcare systems. This paper also focuses on the significance of speculative approaches and the streaming process of data frameworks. This would be helpful for researchers to analyse and evaluate the characteristics of frameworks with respect to network throughput and latency. Selection of nodes for different stages of healthcare is also a challenging issue while selecting data frameworks. State of art approaches show the role of big data frameworks in other sectors of applications.", "venue": "International journal of advanced networking and applications", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": {"name": "International Journal of Advanced Networking and Applications"}, "authors": [{"authorId": "2064358706", "name": "G. Hegde"}, {"authorId": "2412696", "name": "N. Hegde"}], "citations": [{"paperId": "5850c87afaa52db48051032a07b8de7a03d0fc14", "title": "Assessing the Knowledge, Practice, and Attitudes of Healthcare Workers on E-Health Systems in Oshakati District, Namibia"}, {"paperId": "31be917e154c77dfc8870023da8551803391a17e", "title": "Probabilistic data structures in smart city: Survey, applications, challenges, and research directions"}, {"paperId": "6a4929a788a05e489a0c59401a5a5060a5a96867", "title": "SIGNIFICANCE OF ANALYTICS"}]}
