{"paperId": "ce22db6dbdbb5a64e906da4c7bae14594c2c49a7", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Innovation Resistance and Resource Allocation Strategy of Medical Information Digitalization", "abstract": "Healthcare industries are facing an enormous flow of medical records due to the progression of information technology and the trend of digital transformation. Thus, medical information digitalization is a huge digital dataset that can be utilized to benefit healthcare systems and patients. While many studies focus on the application of the digitalized medical information in the healthcare field, only a few mentioned its resistance. The theoretical background depicts a comprehensive overview of medical information digitalization and the barriers in previous literature. This study emphasized the interaction of medical information digitalization barriers and applies the importance-resistance analysis model (IRA) to identify the resistant factors overcoming strategy. It also clarifies the pathway to eliminating the innovation resistance and reveals the interaction of medical information digitalization barriers. The acquisition, management, and application of medical information digitalization are the key foundation of medical technology innovation, digital transformation, and the application of artificial intelligence. This work can reduce the limitation of a narrow healthcare context. This study helps healthcare industries to clarify and solve barriers and realizes the innovation and application of medical information digitalization. In the long term, the results provide a basis for the future development direction of medical information digitalization and affect the medical industry.", "venue": "Sustainability", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2021-07-14", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "2186488307", "name": "Weining Lu"}, {"authorId": "2122867847", "name": "I-Ching Tsai"}, {"authorId": "2152878737", "name": "Kuan-Chung Wang"}, {"authorId": "2153444097", "name": "Terence Tang"}, {"authorId": "2124008936", "name": "Kuan-Chen Li"}, {"authorId": "1742179154", "name": "Yalei Ke"}, {"authorId": "144886793", "name": "Peng-Ting Chen"}], "citations": [{"paperId": "dfc4d480c2536b040fe894ee6282ca884c85f132", "title": "DIGITAL DECISION-MAKING TOOLS IN THE FIELD OF PUBLIC ADMINISTRATION OF HEALTHCARE"}, {"paperId": "54ee4df4a04b72d0a8c8c4e0f3d71000a6200382", "title": "The Impact of Broadband Infrastructure Construction on Medical Resource Mismatch: Quasi-Natural Experiment From the Broadband China Policy"}, {"paperId": "4bf266fe2809db66cfb896bdb060302346d214be", "title": "Digital Transformation in Healthcare: Technology Acceptance and Its Applications"}, {"paperId": "54db901155a8d8f16cf271d08b5bcdd31301203e", "title": "The Application of Artificial Intelligence in Health Care Resource Allocation Before and During the COVID-19 Pandemic: Scoping Review"}, {"paperId": "aaa8199947d5adff7b3c50f093fd790afb3fab9f", "title": "Digital transformation and sustainability in healthcare and clinical laboratories"}, {"paperId": "578fcd735c11b1284507561583f554e5f2a30bd1", "title": "Mobile application to digitize handwritten patient records in peruvian public hospitals"}]}
