{"paperId": "ce29efed938f6397ef643dbace5f7fcdf2fb9a0f", "publicationVenue": {"id": "0942fb86-c16f-4084-9902-10ddcfe18180", "name": "Micro", "type": "conference", "alternate_names": ["Int Symp Microarchitecture", "MICRO", "International Symposium on Microarchitecture", "Annual IEEE/ACM International Symposium on Microarchitecture", "Annu IEEE/ACM Int Symp Microarchitecture"], "issn": "0271-9002", "alternate_issns": ["2151-4143", "2673-8023"], "url": "http://www.microarch.org/"}, "title": "SquiggleFilter: An Accelerator for Portable Virus Detection", "abstract": "The MinION is a recent-to-market handheld nanopore sequencer. It can be used to determine the whole genome of a target virus in a biological sample. Its Read Until feature allows us to skip sequencing a majority of non-target reads (DNA/RNA fragments), which constitutes more than 99% of all reads in a typical sample. However, it does not have any on-board computing, which significantly limits its portability. We analyze the performance of a Read Until metagenomic pipeline for detecting target viruses and identifying strain-specific mutations. We find new sources of performance bottlenecks (basecaller in classification of a read) that are not addressed by past genomics accelerators. We present SquiggleFilter, a novel hardware accelerated dynamic time warping (DTW) based filter that directly analyzes MinION’s raw squiggles and filters everything except target viral reads, thereby avoiding the expensive basecalling step. We show that our 14.3W 13.25mm2 accelerator has 274 × greater throughput and 3481 × lower latency than existing GPU-based solutions while consuming half the power, enabling Read Until for the next generation of nanopore sequencers.", "venue": "Micro", "year": 2021, "fieldsOfStudy": ["Computer Science", "Biology"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2021-08-14", "journal": {"name": "MICRO-54: 54th Annual IEEE/ACM International Symposium on Microarchitecture"}, "authors": [{"authorId": "40040568", "name": "Timothy W. Dunn"}, {"authorId": "1741452493", "name": "Harisankar Sadasivan"}, {"authorId": "3089945", "name": "J. Wadden"}, {"authorId": "1603698316", "name": "Kush Goliya"}, {"authorId": "2110720794", "name": "Kuan-Yu Chen"}, {"authorId": "1687117", "name": "D. Blaauw"}, {"authorId": "40040123", "name": "R. Das"}, {"authorId": "1678884", "name": "S. Narayanasamy"}], "citations": [{"paperId": "c8e6a2ed443ec6c36134787a114a4401b4c11439", "title": "ViTAL: Vision TrAnsformer based Low coverage SARS-CoV-2 lineage assignment"}, {"paperId": "a8c1a0c59767b09a5dbea6e185f56f8119d81d6f", "title": "RawAlign: Accurate, Fast, and Scalable Raw Nanopore Signal Mapping via Combining Seeding and Alignment"}, {"paperId": "c75daf38ec84d306179277d08904101bc5f68d60", "title": "Swordfish: A Framework for Evaluating Deep Neural Network-based Basecalling using Computation-In-Memory with Non-Ideal Memristors"}, {"paperId": "38bfdb4dc6731888098653790cf1592cb75bc402", "title": "DASH-CAM: Dynamic Approximate SearcH Content Addressable Memory for genome classification"}, {"paperId": "e6e13fb476815244f125fe9bac8495293349118b", "title": "RawHash2: Accurate and Fast Mapping of Raw Nanopore Signals using a Hash-based Seeding Mechanism"}, {"paperId": "43a6bd39c6da41bc00d96abf48e22eb5a0ccd1ad", "title": "Sigmoni: classification of nanopore signal with a compressed pangenome index"}, {"paperId": "5be8169dd9b78a9e1d76f76bb11eddc70c02ef37", "title": "Invited: Algorithms and Architectures for Accelerating Long Read Sequence Analysis"}, {"paperId": "7dec8a25543921c1d00cd0a9003ce0d4038bea22", "title": "GenDP: A Framework of Dynamic Programming Acceleration for Genome Sequencing Analysis"}, {"paperId": "03cc4c5afac8a0c311fdfa3ac0926a0d0e028bad", "title": "Invited: Accelerating Genome Analysis via Algorithm-Architecture Co-Design"}, {"paperId": "cb507a89d70a48391bbfd81c05ae881c894fa388", "title": "Accelerated Dynamic Time Warping on GPU for Selective Nanopore Sequencing"}, {"paperId": "f75e5d8cb6d3c10cf15c5011870e436320af59c6", "title": "RawHash: enabling fast and accurate real-time analysis of raw nanopore signals for large genomes"}, {"paperId": "9760e1273242687bfb48edb77f05333360e2dc7f", "title": "Rapid Real-time Squiggle Classification for Read Until Using RawMap"}, {"paperId": "217199ad7af05c9d8e6318fc5d1bdb5d8d2279f6", "title": "TargetCall: Eliminating the Wasted Computation in Basecalling via Pre-Basecalling Filtering"}, {"paperId": "d5342e4314b14ff87a93fdbe16378e24e5708db9", "title": "Crescent: A GPU-based Targeted Nanopore Sequence Selector"}, {"paperId": "18be9a9e31d264724fef5dda69b985c294307302", "title": "Efficient real-time selective genome sequencing on resource-constrained devices"}, {"paperId": "5be7859c83248307d0efaad13874cba9c8880fce", "title": "Accelerating Time Series Analysis via Processing using Non-Volatile Memories"}, {"paperId": "204ec35646fcea9223a1f8f5b93da3586f46690a", "title": "GenPIP: In-Memory Acceleration of Genome Analysis via Tight Integration of Basecalling and Read Mapping"}, {"paperId": "13f55ea705e9af6bcea883694d26fb4d6e3b79cc", "title": "From molecules to genomic variations: Accelerating genome analysis via intelligent algorithms and architectures"}, {"paperId": "dab0918e660d1a89c5073b705b8966bd5709d7dc", "title": "EDAM: edit distance tolerant approximate matching content addressable memory"}, {"paperId": "8f40e2a30ed2954877f879554df058e4f743d0ba", "title": "Going From Molecules to Genomic Variations to Scientific Discovery: Intelligent Algorithms and Architectures for Intelligent Genome Analysis"}, {"paperId": "5695f14582e4cef36d3fc41d4a52da4b2ffbcafa", "title": "SeGraM: a universal hardware accelerator for genomic sequence-to-graph and sequence-to-sequence mapping"}, {"paperId": "729e8ed4e3356cded9b1a465f72a76813bac62a1", "title": "GenStore: a high-performance in-storage processing system for genome sequence analysis"}, {"paperId": "4d3fb0382d679483570650e091c89a086a585c07", "title": "GenStore: A High-Performance and Energy-Efficient In-Storage Computing System for Genome Sequence Analysis"}, {"paperId": "84fb0e666715f0962c69b41a0312749e685fbb26", "title": "ViRAL: Vision Transformer Based Accelerator for ReAL Time Lineage Assignment of Viral Pathogens"}, {"paperId": "db2c084e89d4740d84686d5859c2c9440b83cb1d", "title": "MATSA: An MRAM-Based Energy-Efficient Accelerator for Time Series Analysis"}, {"paperId": "34e579a14cc91876be073eb7b6b68716624e8cd9", "title": "Fast Nanopore Sequencing Signal Classification Using GPU-Enhanced DTW"}]}
