{"paperId": "ce401258c0f460b6b02eff20fa97174d14d5594f", "publicationVenue": {"id": "6779b5f8-34fa-4236-b4de-86143cfa1d78", "name": "Geocarto International", "type": "journal", "alternate_names": ["Geocarto Int"], "issn": "1010-6049", "url": "http://www.tandfonline.com/toc/tgei20/current"}, "title": "An integrated approach based earthquake risk assessment of a seismically active and rapidly urbanizing area in Northern Pakistan", "abstract": "Abstract Earthquake risk in urban areas has recently taken quite a lot of attention. Risk is a cross-cutting combination of vulnerability and hazard. Abbottabad district, a rapidly growing district, is an earthquake-prone area in the north of Pakistan. In 2005, the region suffered enormous casualties due to a significant earthquake (Mw = 7.6). The various regional behaviours, including social, physical, and economic behaviours, are causing a vulnerable situation. At the same time, the high seismicity has the potential to invite earthquake hazard, thus ensuing a possible risk situation in the region. Consequently, this study proposes an integrated approach involving an artificial neural network (ANN), convolutional neural network (CNN), and analytic network process (ANP) to carry out the seismic risk analysis of the Abbottabad district. The proposed two integrated frameworks are ANP-ANN and ANP-CNN. This kind of methodology has not been applied before in this area. The geographic information system is used to formulate a broad range of contributing factors depicting the hazard and vulnerability of the area and potentially contributing to the seismic risk. A total of 16 contributing factors are chosen for this study. The selected factors are weighed using the ANP, and training and testing databases are generated to train and test the models, thus producing the area’s earthquake risk maps (ERMs). As per the ERMs, the northwestern regions and the borderline regions from the southeast, covering an area of 30%, possess a greater earthquake risk. The rest of the 70% of the area has less risk exposure. The AUC values of ANN and CNN are found to be 0.843 and 0.878, respectively, exhibiting a good performance by the models. The study paves the way for the concerned authorities to match and redefine their policies for developing, expanding, and managing the region’s structural, health care, and disaster management facilities.", "venue": "Geocarto International", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-07-23", "journal": {"name": "Geocarto International", "pages": "16043 - 16073", "volume": "37"}, "authors": [{"authorId": "98736135", "name": "A. Maqsoom"}, {"authorId": "2148276940", "name": "Bilal Aslam"}, {"authorId": "1997989277", "name": "Umer Khalil"}, {"authorId": "2210085353", "name": "Muhammad Asad Mehmood"}, {"authorId": "77157421", "name": "H. Ashraf"}, {"authorId": "2132875654", "name": "Ali Siddique"}], "citations": [{"paperId": "ace19b822978c7d90a266a0032aa95a8a0d436a6", "title": "Deep Learning for Earthquake Disaster Assessment: Objects, Data, Models, Stages, Challenges, and Opportunities"}, {"paperId": "75114572ca36a3ea3f9a37c8cdeec92f23bbe0fe", "title": "Middle East and North African Health Informatics Association (MENAHIA): Technological initiatives for ‘One Health’"}]}
