{"paperId": "ce5139768fac6697a19a93b36691b37f39ccd3fb", "publicationVenue": {"id": "c6b969a5-d295-4c65-bbe8-a2dc52990db8", "name": "IEEE transactions on fuzzy systems", "type": "journal", "alternate_names": ["IEEE trans fuzzy syst", "IEEE Trans Fuzzy Syst", "IEEE Transactions on Fuzzy Systems"], "issn": "1063-6706", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=91"}, "title": "Granular Aggregation of Fuzzy Rule-Based Models in Distributed Data Environment", "abstract": "Quite often, complex systems or phenomena are observed from various points of view yielding the particular subsets of data usually being composed of locally available attributes. Such datasets give rise to individual models. As is reflective of the local behavior of the system (global data), each model can produce different, albeit similar results. A critical issue is to aggregate the results coming from the individual models. In virtue of the diversity of the produced results, the aggregation process has to be reflective of this variety. Equally important is a way of quantifying the diversity of the individual results. In this article, we provide an efficient and original way of aggregation of the results by engaging a principle of justifiable granularity and in this manner leading to interval-valued results summarizing the results produced by a collection of models. We develop an overall design process and discuss the associated optimization mechanism leading to a granular fuzzy model of a global nature. The detailed scheme of the principle of justifiable granularity is discussed along with the related performance indexes; in particular, two modes of design of information granules are investigated. The quality of the granular model is quantified with the aid of the criteria of coverage and specificity.", "venue": "IEEE transactions on fuzzy systems", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-05-01", "journal": {"name": "IEEE Transactions on Fuzzy Systems", "pages": "1297-1310", "volume": "29"}, "authors": [{"authorId": "2141912660", "name": "Bowen Zhang"}, {"authorId": "1731634", "name": "W. Pedrycz"}, {"authorId": "2469178", "name": "A. Fayek"}, {"authorId": "1684783", "name": "A. Gacek"}, {"authorId": "1770769", "name": "Yucheng Dong"}], "citations": [{"paperId": "600824796b323b6cd57b951b436069e1f96808aa", "title": "Granular fuzzy rule-based models construction under the collaboration of multiple organizations"}, {"paperId": "3e1fd14aba42c5ab73320f29c0826d2f477de7b2", "title": "A Design and Its Application of Multi-Granular Fuzzy Model with Hierarchical Tree Structures"}, {"paperId": "dcbcd00161bd02f9ef6fe15a92312afa3e4627f5", "title": "Smooth Quadrature-Inspired Generalized Choquet Integral in an Application to Anomaly Detection"}, {"paperId": "75bca3666f74e7a3eea4e75a7d23fe6130d88548", "title": "Rule-based models via the axiomatic fuzzy set clustering and their granular aggregation"}, {"paperId": "f8878fb1e39ce6d62d432db98c8fece9dfbb5b42", "title": "Application of covering rough granular computing model in collaborative filtering recommendation algorithm optimization"}, {"paperId": "0f65929392031bba5962556b385a68b71d16c3f6", "title": "Granular rule-based modeling using the principle of justifiable granularity and boundary erosion clustering"}, {"paperId": "5f9efe33ef5bad6908fd912defa768e55bc8c2e8", "title": "Performance Index of Incremental Granular Model with Information Granule of Linguistic Intervals and Its Application"}, {"paperId": "0b5c1cd3652aa9a979da5761d4fdaa51dc55f433", "title": "A MapReduce C4.5 Decision Tree Algorithm Based on Fuzzy Rule-Based System"}, {"paperId": "9edc01f013daf7e03b6830dff5a2b4646b92041a", "title": "Quadrature-Inspired Generalized Choquet Integral in an Application to Classification Problems"}]}
