{"paperId": "ce603aaddf1cea02016fff4fafbdc29885ea587f", "publicationVenue": {"id": "9ac43e83-e3b6-4ad1-8e77-33821f2ee48c", "name": "Business Strategy and the Environment", "type": "journal", "alternate_names": ["Bus Strategy Environ", "Business Strategy and The Environment"], "issn": "0964-4733", "url": "http://www3.interscience.wiley.com/cgi-bin/jtoc?ID=5329", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/10990836", "http://rave.ohiolink.edu/ejournals/issn/09644733/"]}, "title": "The role of agri‐food 4.0 in climate‐smart farming for controlling climate change‐related risks: A business perspective analysis", "abstract": "The impact of climate change, including fires, droughts and storms, on natural resources and agricultural output is increasing. In addition to these problems, resource depletion and greenhouse gas (GHG) emissions, agriculture also contributes to global warming. To reduce the dangers of climate change, farmers are using sustainable practices. This article aims to link agri‐food 4.0 technology with climate‐smart agriculture (CSA) to lessen the two‐way interaction (both affecting and impacted) between the agricultural sector and global warming, as well as dangers related to the agri‐food business. In light of this information, the research methodology of the paper is twofold. Initially, related risks towards climate change and the CSA and agri‐food 4.0 technologies to overcome these risks were determined through a literature review. Then, risks and technologies are evaluated by adopting the TODIM (an acronym in Portuguese for Interactive and Multicriteria Decision Making), which is used for evaluating the criteria set with the related technologies to overcome climate change‐related risks and provide a guiding map for academics and practitioners to eliminate risks associated with these climate change‐related factors. According to the study's findings, the highest‐priority concerns in the agri‐food industries that are connected to climate change include energy consumption, food safety and GHG emissions. Internet of Things (IoT), bio‐innovation and artificial intelligence are thought to be the most promising technological solutions to address these problems.", "venue": "Business Strategy and the Environment", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-11-27", "journal": {"name": "Business Strategy and the Environment"}, "authors": [{"authorId": "2472142", "name": "Yiğit Kazançoğlu"}, {"authorId": "1500725853", "name": "Çisem Lafçı"}, {"authorId": "2261254527", "name": "Anil Kumar"}, {"authorId": "2238324835", "name": "Sunil Luthra"}, {"authorId": "1401931357", "name": "J. Garza‐Reyes"}, {"authorId": "2243531170", "name": "Yalcin Berberoglu"}], "citations": [{"paperId": "c9945348f55d9273ed8dc71101be992eea846560", "title": "Business strategies towards climate‐smart agriculture in Europe: A literature review"}]}
