{"paperId": "ce76c7876d76aebb89ed54015a9c8fc5347bcbdc", "publicationVenue": null, "title": "Evolutionary Computing Assisted K-Means Clustering based MapReduce Distributed Computing Environment for IoT-Driven Smart City", "abstract": "In the last few years, the exponential rise in urban population and allied demands have alarmed governing agencies as well as industries to achieve more quality-of-service (QoS) oriented solutions to meet up-surging demands, especially towards real-time decision making, information exchange and knowledge-driven decisions. To achieve it, smart city concept which employs Internet- of-Things (IoT), distributed software computing, and BigData analytics has gained widespread attention. Though, inclusion of QoS-sensitive routing has helped enabling better and efficient sensory or node’s data collection and dissemination; however, ensuring optimal query-driven knowledge mining and information exchange has remained a challenge. Considering it as motivation, in this paper an evolutionary computing assisted K-Means clustering algorithm is developed for MapReduce computation in Hadoop distributed framework. The proposed method employs genetic algorithm to enhance centroid estimation as well as clustering, which as a result helped in achieving better clustering to support MapReduce. The proposed GA based K-Means clustering has been applied over Hadoop-MapReduce, where to achieve aforesaid centroid estimation and clustering enhancement Silhouette coefficient was used as the objective function. Here, GA-K Means was applied in such manner that it estimates optimized centroid and clusters simultaneously over Mapper and Reducer, which makes overall computation faster and more accurate.", "venue": "2021 International Conference on Computing, Communication, and Intelligent Systems (ICCCIS)", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2021-02-19", "journal": {"name": "2021 International Conference on Computing, Communication, and Intelligent Systems (ICCCIS)", "pages": "192-200"}, "authors": [{"authorId": "1491355973", "name": "Kunal G. Srinivas"}, {"authorId": "52162095", "name": "Doreswamy Hosahalli"}], "citations": [{"paperId": "2af8158d4cc587778f0f718af484d08875d7588f", "title": "Discovering smart cities’ potential in Kazakhstan: A cluster analysis"}, {"paperId": "4ba520951cd55e3734408d8d80e35231e61d2235", "title": "Evaluating development prospects of smart cities: Cluster analysis of Kazakhstan’s regions"}, {"paperId": "112ff84a4a954fa7f55835c1a677ba633b85f6c2", "title": "Clustering for smart cities in the internet of things: a review"}]}
