{"paperId": "ce81dd435cd9a33a5ec8a4da55afb89847f5a7b9", "publicationVenue": {"id": "e53a7f00-880e-4975-9953-95f2e540dbb7", "name": "Plants", "issn": "2223-7747", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-247598", "alternate_urls": ["https://www.mdpi.com/journal/plants", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-247598"]}, "title": "Spatial Autocorrelation Analysis of Land Use and Ecosystem Service Value in the Huangshui River Basin at the Grid Scale", "abstract": "The Huangshui River Basin is one of the most densely populated areas on the Qinghai–Tibet Plateau and is characterized by a high level of human activity. The contradiction between ecological protection and socioeconomic development has become increasingly prominent; determining how to achieve the balanced and coordinated development of the Huangshui River Basin is an important task. Thus, this study used the Google Earth Engine (GEE) cloud-computing platform and Sentinel-1/2 data, supplemented with an ALOS digital elevation model (ALOS DEM) and field survey data, and combined a remote sensing classification method, grid method, and ecosystem service value (ESV) evaluation method to study the spatial correlation and interaction between land use (LU) and ESV in the Huangshui River Basin. The following results were obtained: (1) on the GEE platform, Sentinel-1/2 active and passive remote sensing data, combined with the gradient tree-boosting algorithm, can efficiently produce highly accurate LU data with a spatial resolution of 10 m in the Huangshui River Basin; the overall accuracy (OA) reached 88%. (2) The total ESV in the Huangshui River Basin in 2020 was CNY 33.18 billion (USD 4867.2 million), of which woodland and grassland were the main contributors to ESV. In the Huangshui River Basin, the LU type, LU degree, and ESV have significant positive spatial correlations, with urban and agricultural areas showing an H-H agglomeration in terms of LU degree, with woodlands, grasslands, reservoirs, and wetlands showing an H-H agglomeration in terms of ESV. (3) There is a significant negative spatial correlation between the LU degree and ESV in the Huangshui River Basin, indicating that the enhancement of the LU degree in the basin could have a negative spatial spillover effect on the ESV of surrounding areas. Thus, green development should be the future direction of progress in the Huangshui River Basin, i.e., while maintaining and expanding the land for ecological protection and restoration, and the LU structure should be actively adjusted to ensure ecological security and coordinated and sustainable socioeconomic development in the Basin.", "venue": "Plants", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-09-01", "journal": {"name": "Plants", "volume": "11"}, "authors": [{"authorId": "2180428483", "name": "Feifei Shi"}, {"authorId": "2047127219", "name": "B. Zhou"}, {"authorId": "2625062", "name": "Hua-kun Zhou"}, {"authorId": "1682058", "name": "H. Zhang"}, {"authorId": "2129475207", "name": "Hongda Li"}, {"authorId": "2216043260", "name": "Runxiang Li"}, {"authorId": "2291847778", "name": "Zhuanzhuan Guo"}, {"authorId": "46757792", "name": "Xiaohong Gao"}], "citations": [{"paperId": "d3d6cb5ffd5911f3d276a87a7ec9d2d316badcf2", "title": "Assessing and predicting changes of ecosystem service values in response to land use/land cover dynamics in Ibb City, Yemen: a three-decade analysis and future outlook"}, {"paperId": "6301887dc19d46625aab1ec0be1fbebced542329", "title": "A neglected phenomenon: The spatiotemporal evolution of rivers in the city of Luohe, China"}, {"paperId": "1e19cd889671c3eef58a950931a0351d8fe207a4", "title": "Analysis and Prediction of Spatial and Temporal Evolution of Ecosystem Service Value on the Northern Slopes of the Kunlun Mountains Based on Land Use"}, {"paperId": "8cce223bd70f769012ca6d06d2f7bee432710be3", "title": "Identifying structure change of vegetation under long-term disturbance in the Shendong mining area"}]}
