{"paperId": "ce881f9ce693917754211d09970fc2c755d908b7", "publicationVenue": {"id": "7dc964d5-49e6-4c37-b1c4-a7f0de1fa425", "name": "International Conference on Web and Social Media", "type": "conference", "alternate_names": ["Int Conf Weblogs Soc Media", "International Conference on Weblogs and Social Media", "Int Conf Web Soc Media", "ICWSM"], "url": "http://www.aaai.org/Library/ICWSM/icwsm-library.php"}, "title": "Imagine All the People: Characterizing Social Music Sharing on Reddit", "abstract": "Music shapes our individual and collective identities, and in turn is shaped by the social and cultural contexts it occurs in. Qualitative approaches to the study of music have uncovered rich connections between music and social context but are limited in scale, while computational approaches process large amounts of musical data but lack information on the social contexts music is embedded in. In this work, we develop a set of neural embedding methods to understand the social contexts of online music sharing, and apply them to a novel dataset containing 1.3M instances of music sharing in Reddit communities. We find that the patterns of how people share music in public are related to, but often differ from, how they listen to music in private. We cluster artists into social genres that are based entirely on aggregate sharing patterns and reflect where artists are invoked. We also characterize the social and cultural contexts music is shared in by measuring associations with social dimensions such as age and political affiliation. Finally, we observe that a significant amount of sharing is attributable to extra-musical factors—additional meanings that people have associated with songs. We develop two methods to quantify the extra-musicality of music sharing. Our methodology is widely applicable to the study of online social contexts, and our results reveal novel cultural associations that contribute to a better understanding of the online music ecosystem.", "venue": "International Conference on Web and Social Media", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-05-22", "journal": {"pages": "739-750"}, "authors": [{"authorId": "93258626", "name": "V. Veselovsky"}, {"authorId": "89922735", "name": "Isaac Waller"}, {"authorId": "32071555", "name": "Ashton Anderson"}], "citations": [{"paperId": "482c4074a0ab09438cb6822c138ae3e89c979e4c", "title": "Text Embeddings and Clustering for Characterizing Online Communities on Reddit"}, {"paperId": "5e1372f209b6d40b9f015de4f98ed8a7bc559f6c", "title": "Music Mobility Patterns: How Songs Propagate Around The World Through Spotify"}, {"paperId": "33407f172df978a2134f68702c88e68763bbe2a6", "title": "Tube2Vec: Social and Semantic Embeddings of YouTube Channels"}, {"paperId": "4f9dda2b7f7526108f5c9695e88a63836a085fa4", "title": "Understanding the Use of e-Prints on Reddit and 4chan’s Politically Incorrect Board"}, {"paperId": "ca5850fc6ef6abba0b3f7d79e309d169a457d2ad", "title": "\"We won't even challenge their lefty academic definition of racist: \" Understanding the Use of e-Prints on Reddit and 4chan"}]}
