{"paperId": "ce89644fc6c5c13fb741c382ce518901251267b7", "publicationVenue": {"id": "977ed0da-0d19-4907-91d5-92b3f0e8dfd3", "name": "Sustainable Production and Consumption", "type": "journal", "alternate_names": ["Sustain Prod Consum"], "issn": "2352-5509", "url": "https://www.journals.elsevier.com/sustainable-production-and-consumption", "alternate_urls": ["http://www.sciencedirect.com/science/journal/23525509"]}, "title": "Exploring public attention about green consumption on Sina Weibo: Using text mining and deep learning", "abstract": null, "venue": "Sustainable Production and Consumption", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-12-01", "journal": {"name": "Sustainable Production and Consumption"}, "authors": [{"authorId": "2143496664", "name": "Han Huang"}, {"authorId": "34726782", "name": "R. Long"}, {"authorId": "101314343", "name": "Hong Chen"}, {"authorId": "153269190", "name": "Kun Sun"}, {"authorId": "1910918225", "name": "Qianwen Li"}], "citations": [{"paperId": "0f69dbfabb3050e91520d242af7abed95f08a170", "title": "Does digitalization help green consumption? Empirical test based on the perspective of supply and demand of green products"}, {"paperId": "ab43c6a9e730c219ef491e288e6c7e0b4906841c", "title": "Unveiling citizen-government interactions in urban renewal in China: Spontaneous online opinions, reginal characteristics, and government responsiveness"}, {"paperId": "5122fe81ede2a5e006f0467d8391763ab7e2ed1b", "title": "Energy-saving targets and carbon neutrality: A perspective on carbon emissions and carbon substitution in 288 Chinese cities"}, {"paperId": "ac94eb7dda76d57dfd758338f097c80036c42d24", "title": "Spatial heterogeneities of residents' sentiments and their associations with urban functional areas during heat waves– a case study in Beijing"}, {"paperId": "4866aa6c6a6d26e5b244a3f96d636abdba374171", "title": "Green transitions for changing behaviour through environmental community engagement at religious schools"}, {"paperId": "4b774dcf12907810ac5f9ef420b328026c4e1ea7", "title": "Research on strategy optimization of sustainable development towards green consumption of eco-friendly materials"}, {"paperId": "ecf6b95523c9b026035d09ac065826b2885b46f5", "title": "Mining the impact of social media information on public green consumption attitudes: a framework based on ELM and text data mining"}, {"paperId": "5193b77f70063664cec9842ae617a4f0bb23947e", "title": "Evaluation of Perceived Environmental Risks of Residents' Life under the Perspective of Environmental Public Opinion"}, {"paperId": "856bdd35e2441cbbf5b67f1f3d3cf70226001ebf", "title": "Sentiment and attention of the Chinese public toward electric vehicles: A big data analytics approach"}, {"paperId": "763c5edaa9c851871d39c95360b41b9e2b832678", "title": "Corporate environmental pictures information disclosure and investor market reaction: A new perspective from large-scale pictures feature mining"}, {"paperId": "315342bea418c850b027184a2529863311afab12", "title": "CnSR: Exploring Consumer Social Responsibility Using Machine Learning-Based Topic Modeling with Natural Language Processing"}, {"paperId": "ac721d35acada5616cdde51a9eecc57743df763b", "title": "Peer effects of firm's sustainable transformation: Evidence from textual information analysis of annual financial reports in China"}, {"paperId": "9fd91171e160e8fc1bf9b4d9d0e69f426f380e7a", "title": "Online versus offline tourism emotion: uncovering the bias pattern in online tourism emotion within theme parks"}, {"paperId": "a04ac755b56ffd51ed4a2621d90fb2cb01fa0e4b", "title": "Roadmap to achieving sustainable development: Does digital economy matter in industrial green transformation?"}, {"paperId": "97d04a8f362004c2ee38f2d4a185dabc075915f9", "title": "Sequential data-driven carbon peaking path simulation research of the Yangtze River Delta urban agglomeration based on semantic mining and heuristic algorithm optimization"}, {"paperId": "778977ff9af085a0ab39be562065e56850c59bb5", "title": "How does public concern about climate change affect carbon emissions? Evidence from large-scale online content and provincial-level data in China"}, {"paperId": "c951f6805a427178f4c27380e4bc34a85fecceb4", "title": "Promoting the production and consumption of green products from the perspective of supply and demand: An evolutionary game-based analysis"}, {"paperId": "27029f44d8a516f4e47b92090b1dd11d98f9e29a", "title": "Why don't more people engage in green practices in China? A policy-oriented approach to promoting green transformation in five consumption areas"}, {"paperId": "fac2422d6363c6feed72a0e15b0b9cb4a64d8058", "title": "How to win the green market? Exploring the satisfaction and sentiment of Chinese consumers based on text mining"}, {"paperId": "9b1709b5831ae3c8024e068b670b4648b04ad2f4", "title": "Exploring public attention and sentiment toward carbon neutrality: evidence from Chinese social media Sina Weibo"}, {"paperId": "3494b62780cd0b76b9b45af17f0c68a02b9598f0", "title": "Do stakeholders have the same concerns about anti-food waste law in China? Using big data from social media"}, {"paperId": "d43024de9465311bf6b03cfc85d11b905148fed7", "title": "Public perception of waste regulations implementation. Natural language processing vs real GHG emission reduction modeling"}, {"paperId": "1dfd99c2d944a73ebbca9fd09cc7419e4ec0154c", "title": "Green housing on social media in China: A text mining analysis"}, {"paperId": "aa3504bb745425b00df1c08f9aa85402636c3811", "title": "Social understanding of green building projects in China (2006–2022): Stakeholders, issue attention and divergences"}, {"paperId": "0bb62651ade60c710542d5b06ba1da5d961d06c2", "title": "Citizen-initiated interactions in urban water governance: How public authorities respond to micro-level opinions related to nature-based solutions"}, {"paperId": "3b35ac420402a69f96e3c0e18542ae72aee68cd2", "title": "Attention and Sentiment of the Chinese Public toward a 3D Greening System Based on Sina Weibo"}, {"paperId": "ad26814a53dde1e6cac50efc1132f8220b549c74", "title": "Analyzing Weibo Data with Word2Vec and BiLSTM to Encourage Personal Income Tax Compliance in China"}, {"paperId": "a04a9e456c50872cdaf50fdccf70facc84e0725b", "title": "Public perceptions of environmental, social, and governance (ESG) based on social media data: Evidence from China"}, {"paperId": "b4307845277ab2be869f70791dceba0890dd0d22", "title": "Predicting Consumption Intention of Consumer Relationship Management Users Using Deep Learning Techniques: A Review"}, {"paperId": "e2e25963d1aeb315b9506ab860c4767e8c9d6613", "title": "Green-Labelled Rice versus Conventional Rice: Perception and Emotion of Chinese Consumers Based on Review Mining"}, {"paperId": "a972071a0f98f2b5b650b95e2d2ca8b75fecf06d", "title": "Internet Development, Consumption Upgrading and Carbon Emissions—An Empirical Study from China"}, {"paperId": "74b48bad8042dc1e8295894a505210e28c519218", "title": "Time Series Analysis of Policy Discourse on Green Consumption in China: Text Mining and Network Analysis"}, {"paperId": "11aeccedc444ca323e80a0c31fb88790b038abbc", "title": "Online public opinion prediction based on rolling fractional grey model with new information priority"}, {"paperId": "42ffdeacd1d859d7c0a688606a36413154374a98", "title": "Overall evaluation and regional differences of green transformation: Analysis based on “government-enterprise-resident” three-dimensional participants perspective"}, {"paperId": "68a5d3b7476504ea7cc17b04369005137b8c8af4", "title": "Quantifying Spatiotemporal Heterogeneities in PM2.5-Related Health and Associated Determinants Using Geospatial Big Data: A Case Study in Beijing"}, {"paperId": "72533ef412b4204a9ddf7a41c7c0eb8252794af1", "title": "The Impact of Social Media Information Sharing on the Green Purchase Intention among Generation Z"}, {"paperId": "77923ae952c7da33a419df12ac149c71e2afa3bb", "title": "Research on strategies for improving green product consumption sentiment from the perspective of big data"}]}
