{"paperId": "ce8c93b95487c4bd6fabfb772601c0be19b369e1", "publicationVenue": {"id": "535d7621-2bae-4443-9c2a-6cb032660a67", "name": "Delta University Scientific Journal", "type": "journal", "alternate_names": ["Delta Univ Sci J"], "issn": "2636-3046"}, "title": "IoT Based Intrusion Detection Systems from The Perspective of Machine and Deep Learning: A Survey and Comparative Study", "abstract": "The term \"Internet of Things\" (IoT) refers to a group of gadgets that are capable of connecting to the Internet in order to gather and share data. The growth of Internet connections and the arrival of new technologies like the Internet of Things (IoT) have increased the privacy and security threats associated with the introduction of various gadgets. In order to increase the detection of cyber-attacks, industries are increasing their research spending. Institutions choose wise testing and verification techniques by comparing the highest rates of accuracy. IoT use has been accelerating recently across a variety of industries, including health care, smart homes, intelligent transportation, smart cities, and smart grids. where technology researchers and developers started to take notice of the IoT possibilities. Unfortunately, the privacy and security concerns imposed on by energy restrictions and the scalability of IoT devices present the most significant challenge to IoT. Therefore, how to address the IoT's security and privacy challenges remains an essential issue in the field of information security. With a decentralized design, edge computing plays a vital role in enabling IoT devices to compute, make decisions, take actions, and push only pertinent information to the cloud. Since sensitive data is more readily available and can be used right away, the IDS performs better when employing machine learning (ML) and deep learning (DL) algorithms to identify and prevent various threats. In terms of technical limitations, this study classifies the current, recent research in IoT intrusion detection systems employing machine learning, deep learning, and edge computing architecture.", "venue": "Delta University Scientific Journal", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-12-01", "journal": {"name": "Delta University Scientific Journal"}, "authors": [{"authorId": "2138132965", "name": "Eman Ashraf"}, {"authorId": "2199089920", "name": "Nihal Areed"}, {"authorId": "144139392", "name": "Hanaa Salem"}, {"authorId": "2199076256", "name": "Ehab Abdelhady"}, {"authorId": "2071968440", "name": "A. Farouk"}], "citations": [{"paperId": "b7b58f8da76fb95471a0dffdc234379ce9d0def7", "title": "Residual based temporal attention convolutional neural network for detection of distributed denial of service attacks in software defined network integrated vehicular adhoc network"}, {"paperId": "bfc67a4fe1aa1a9e4d920bb5575585efbf1c25a9", "title": "An Improved Mutual Information Feature Selection Technique for Intrusion Detection Systems in the Internet of Medical Things"}, {"paperId": "30adfda5421b1c7cae7fbfd24b1b34900641fe37", "title": "Big Data-Based Smart Health Monitoring System: Using Deep Ensemble Learning"}]}
