{"paperId": "ce99356d6bb24b2574d5ae0d63336ebb6111dd60", "publicationVenue": null, "title": "Components and Development in Big Data System: A Survey", "abstract": "With the growth of distributed computing systems, the modern Big Data analysis platform products often have diversified characteristics. It is hard for users to make decisions when they are in early contact with Big Data platforms. In this paper, we discussed the design principles and research directions of modern Big Data platforms by presenting research in modern Big Data products. We provided a detailed review and comparison of several state-of-the-art frameworks and concluded into a typical structure with five horizontal and one vertical. According to this structure, this paper presents the components and modern optimization technologies developed for Big Data, which helps to choose the most suitable components and architecture from various Big Data technologies based on requirements.", "venue": "", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2019-03-01", "journal": {"name": "Journal of Electronic Science and Technology", "pages": "51-72", "volume": "17"}, "authors": [{"authorId": "151068692", "name": "Jing-Huan Yu"}, {"authorId": "2903484", "name": "Zimeng Zhou"}], "citations": [{"paperId": "5ca42c1ec411eecb80765f12d8f8bc59cc63d76c", "title": "Compressed Data Direct Computing for Databases"}, {"paperId": "cde9fd0ff54ad70560bf6f626dd9d3d97c3c9d84", "title": "A Survey of Intelligent End-to-End Networking Solutions: Integrating Graph Neural Networks and Deep Reinforcement Learning Approaches"}, {"paperId": "f7dbd43c0e3667f6aef58eac4a062935d309e89e", "title": "A systematic review on big data applications and scope for industrial processing and healthcare sectors"}, {"paperId": "0a12bd380f0e1ce62d638f0887f6e578d1e929fa", "title": "Big data Analytics for Pre-Teacher Preparation of Higher Education in Thailand"}, {"paperId": "ebe03cc85251be47ab010180640e445e48be2f43", "title": "Harr-NMF Feature Extraction for Multilevel Educational Technology Teaching Big Data System"}, {"paperId": "910583f6dda16febbe94914acb916d61c5c34a51", "title": "Big Data Driven E-Commerce Application Management System"}, {"paperId": "9f0c44abd3c74a5779b2741c2f490f0d7c009ec0", "title": "A Brief Survey on Big Data in Healthcare"}, {"paperId": "b9bc1cf2f0aa855828f0cfad1c27608486ca8547", "title": "A Systematic Literature Review: The Role of Big Data on Project Management and Project Sustainability"}, {"paperId": "2e074a9235c6d534ae95bcad921fb9ed78418694", "title": "Educational big data infrastructure: opportunities, design and challenges"}, {"paperId": "c39b2fb3b9a2500e624f5caea10c11b0b5860d93", "title": "EXPLORING THE RELATIONSHIP BETWEEN BIG DATA AND FIRM PERFORMANCE"}]}
