{"paperId": "ce99bf71ce998916627358f2f7d6a3c0eb73f912", "publicationVenue": {"id": "20a3a2f3-532a-4f04-9f3d-1e268e100872", "name": "International Journal of Advanced Computer Science and Applications", "type": "journal", "alternate_names": ["Int J Adv Comput Sci Appl"], "issn": "2156-5570", "url": "http://sites.google.com/site/ijacsa2010/", "alternate_urls": ["http://thesai.org/Publication/Default.aspx", "https://thesai.org/Publications/IJACSA"]}, "title": "Data Recovery Approach with Optimized Cauchy Coding in Distributed Storage System", "abstract": "—In the professional world, the impact of big data is pulsating to change things. Data is currently generated by a wide range of sensors that are part of smart devices. It necessitates data storage and retrieval that is fault tolerant. Data loss can be caused by natural calamities, human error, or mechanical failure. Several security threats and data degradation attacks attempt to destroy storage disks, causing partial or complete data loss. The data encoding and data recovery mechanisms is proposed in this research. To produce a set of matrices utilizing matrix heuristics, the suggested system proposes an efficient Optimized Cauchy Coding (OCC) approach. In this paper, the Cauchy matrix is used as a generator matrix in Reed Solomon (RS) code to encode data blocks with fewer XOR operations. It reduces the encoding algorithm's time complexity. Furthermore, in the event of a disk failure, missing data from any data block is made available through the Code word. In terms of data recovery, it outperforms the Optimal Weakly Secure Minimum Storage Regenerating (OWSPM-MSR) and Product-Matrix Minimum Storage Regenerating (PM-MSR) methods. For data coding, a 1024KB file with various combinations of data blocks l and parity blocks m is evaluated. In the first scenario, m is 1 and l ranges from 4 to 10. The value of l is 4 in the second scenario, while m ranges from 1 to 10. The existing OWSPM-MSR approach takes an average of 0.125 seconds to encode and 0.22 seconds to decode, whereas the PM-MSR approach takes an average of 0.045 seconds to encode and 0.16 seconds to decode. The proposed OCC approach speeds up data coding by taking an average of 0.035 seconds to encode and 0.116 seconds to decode data.", "venue": "International Journal of Advanced Computer Science and Applications", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": {"name": "International Journal of Advanced Computer Science and Applications"}, "authors": [{"authorId": "73136800", "name": "Snehalata Funde"}, {"authorId": "2017920", "name": "Gandharba Swain"}], "citations": []}
