{"paperId": "ce9fbfd057f2b255d7b9513d8b3c21acf6018d27", "publicationVenue": {"id": "6be078fe-e448-4123-8096-25493e7a2502", "name": "ARES", "type": "conference", "alternate_names": ["Availability, Reliability and Security", "Availab Reliab Secur", "International Conference on Availability, Reliability and Security", "Int Conf Availab Reliab Secur"], "issn": "2554-2656", "url": "https://ares.hypotheses.org/", "alternate_urls": ["http://www.ares-conference.eu/"]}, "title": "Integrating digital twin security simulations in the security operations center", "abstract": "While industrial environments are increasingly equipped with sensors and integrated to enterprise networks, current security strategies are generally not prepared for the growing attack surface that resides from the convergence of their IT infrastructure with the industrial systems. As a result, the organizations responsible for corporate security, the Security Operations Center (SOC), are overwhelmed with the integration of the industrial systems. To facilitate monitoring the industrial assets, digital twins represent a helpful novel concept. They are the virtual counterparts of such assets and provide valuable insights through collecting asset-centric data, analytic capabilities and simulations. Moreover, digital twins can assist enterprise security by simulating attacks and analyzing the effect on the virtual counterpart. However, the integration of digital twin security simulations into enterprise security strategies, that are mainly controlled by the SOC, is currently neglected. To close this research gap, this work develops a process-based security framework to incorporate digital twin security simulations in the SOC. In the course of this work, a use case along with a digital twin-based security simulation provides proof of concept. It is demonstrated how a man-in-the-middle attack can be performed in a simulated industry setting and how it affects the systems. Moreover, we show how the resulting system logs can support the SOC by building technical rules to implement in Security Information and Event Management (SIEM) systems.", "venue": "ARES", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2020-08-25", "journal": {"name": "Proceedings of the 15th International Conference on Availability, Reliability and Security"}, "authors": [{"authorId": "51188191", "name": "Marietheres Dietz"}, {"authorId": "40929870", "name": "Manfred Vielberth"}, {"authorId": "145178500", "name": "G. Pernul"}], "citations": [{"paperId": "a0df0052a82aa66e1bfdb465a3a973b5b9440dd9", "title": "Risk-based safety scoping of adversary-centric security testing on Operational Technology"}, {"paperId": "f82f744acfc9abc373fea38b878f9473906b02ad", "title": "CyberDefender: an integrated intelligent defense framework for digital-twin-based industrial cyber-physical systems"}, {"paperId": "e3932c91ef1599d60c98cbc3ba7d9f3858a9af43", "title": "Integrating FMI and ML/AI models on the open‐source digital twin framework OpenTwins"}, {"paperId": "319055dead36c2a557dba19b414b7bf637f1cfe8", "title": "SoK: Security of Programmable Logic Controllers"}, {"paperId": "d8ee7a79cae542b8474d14f6c37cc3f5d423998d", "title": "A comprehensive survey on digital twin for future networks and emerging Internet of Things industry"}, {"paperId": "4d609c6993b0e082c0ecc30c2be20bae4b0d148b", "title": "A Comprehensive Survey of Digital Twins: Applications, Technologies and Security Challenges"}, {"paperId": "f1db99c89c4ea5468a506ab5a628096d1001b703", "title": "Energy efficiency in 5G systems: A systematic literature review"}, {"paperId": "b3eb43f867bdab9b6d5579d35fd4d7139942c03f", "title": "A Systematic Literature Review of Recent Trends and Challenges in Digital Twin Implementation"}, {"paperId": "c8b65afb38721756e07bfe24b3fdc5665d331fef", "title": "Digital Twin-Enhanced Incident Response for Cyber-Physical Systems"}, {"paperId": "420efd3564011e9c0ca52ba5ccfa7cb900b090f4", "title": "A Cyber Digital Twin Framework to Support Cyber-Physical Systems Security"}, {"paperId": "ff0c8b90f6958b3ae56eb34f3929c7138c57c3c2", "title": "Digital Twins in Industry 4.0 Cyber Security"}, {"paperId": "b953a6b9b973cb42047ad82b1203025b5eb9d827", "title": "Digital-Twin-Based Approaches and Applications for Improving Automotive Cybersecurity in Different Lifecycle Stages"}, {"paperId": "a070be7d588e2160e6b15e51b93c1ca86ea9388b", "title": "Human-Centric Digital Twins in Industry: A Comprehensive Review of Enabling Technologies and Implementation Strategies"}, {"paperId": "9483c1e95217a222b94f6e7345f4175e731f9583", "title": "Securing critical infrastructures with a cybersecurity digital twin"}, {"paperId": "31872d6c79f395dad0a7ca9afeedbb077747cc23", "title": "ICSSIM - A framework for building industrial control systems security testbeds"}, {"paperId": "737153a9cee58e0e783b73a3b68fb751d66297b9", "title": "SOAR4IoT: Securing IoT Assets with Digital Twins"}, {"paperId": "a5ac93ce0e166df4c8ee9af2e3fd552a719e8359", "title": "Introducing the CYSAS-S3 Dataset for Operationalizing a Mission-Oriented Cyber Situational Awareness"}, {"paperId": "07b586fd3fb606c93f7b7014e7b5f2b96ba7d254", "title": "Formalizing and Integrating User Knowledge into Security Analytics"}, {"paperId": "4a4dd76151dc192a5c1aa3b9c2dcc4ea5f45c444", "title": "Employing Digital Twins for Security-by-Design System Testing"}, {"paperId": "27ef778ac39674ea456f23259dedf1955422189a", "title": "Digital Twin-based Intrusion Detection for Industrial Control Systems"}, {"paperId": "e8d3539f3fb427fcd5c496768ee18c37b6962492", "title": "Study Cybersecurity of Cyber Physical System in the Virtual Environment: A Survey and New Direction"}, {"paperId": "2ff1a0a99d902069fd3bb52ea6b5859a1adec309", "title": "Towards Situational Aware Cyber-Physical Systems: A Security-Enhancing Use Case of Blockchain-based Digital Twins"}, {"paperId": "bfe9baad9144f6b7a35a1753c4ae8baa4a7975a1", "title": "CTI-SOC2M2 - The quest for mature, intelligence-driven security operations and incident response capabilities"}, {"paperId": "85976698fc0598517c80dce46aea2bbffab37782", "title": "Augmented Reality and the Digital Twin: State-of-the-Art and Perspectives for Cybersecurity"}, {"paperId": "93290ccaf1e9bcfea720cd4953e7155283c5e4cb", "title": "Digital Twin: Conclusion and Future Perspectives"}, {"paperId": "4a7fee3b6f498e13b09f1c15e86efd222bfb2f48", "title": "Towards Trusted and Intelligent Cyber-Physical Systems: A Security-by-Design Approach"}, {"paperId": "2b1066062aaaf667880fbdaac21f5207d3d4ed98", "title": "Co-Simulating Physical Processes and Network Data for High-Fidelity Cyber-Security Experiments"}, {"paperId": "233109410af675bb419c036217dcb2c229bef7d6", "title": "Digital Twins in Industry 4.0 – Opportunities and challenges related to Cyber Security"}, {"paperId": "d9ba8c1b08f23021ff59f8c1500b942b19fb2cdb", "title": "Digital Twin for Safety and Security: Perspectives on Building Lifecycle"}, {"paperId": "9af55eb18dd4961257a3e8bf8cdb6784f004cfa9", "title": "A Survey on Digital Twin for Industrial Internet of Things: Applications, Technologies and Tools"}, {"paperId": "85f7f9b0deef847108916b30ccebae49c5fb0e62", "title": "Data Collection Method for Security Digital Twin on Cyber Physical Systems"}, {"paperId": "37339e70c0d90b3b1db21aed0d0d147b5a72d648", "title": "Toward IoRT Collaborative Digital Twin Technology Enabled Future Surgical Sector: Technical Innovations, Opportunities and Challenges"}, {"paperId": "aa813f2ea7de0ecb120ea9c520508b33ee7d98a4", "title": "ICSSIM-A Framework for Building Industrial Control Systems Security Simulation Testbeds"}, {"paperId": "8becf496d9e3583d6c3cc2d2515fd1a2317a7dd5", "title": "Bridging Knowledge Gaps in Security Analytics"}, {"paperId": "a9879913c772b52ebd6157944fd0f579ee18e7ab", "title": "A Cyber Security Digital Twin for Critical Infrastructure Protection: The Intelligent Transport System Use Case"}, {"paperId": "82898a361eb9363ccad3aa6843be5274d1e4edfd", "title": "Digital Twin for Cybersecurity: Towards Enhancing Cyber Resilience"}, {"paperId": "75522e04f7e11321e0ceab380c4b8c6162e7fbf3", "title": "Systematic Literature Review: Digital Twins’ Role in Enhancing Security for Industry 4.0 Applications"}]}
