{"paperId": "cebed549504002323db3f305254269d45750c70f", "publicationVenue": {"id": "4293c8e8-8cd7-4be6-b8b2-69f2b4fa3259", "name": "Computer Applications in Engineering Education", "type": "journal", "alternate_names": ["Comput Appl Eng Educ"], "issn": "1061-3773", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/38664", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/10990542", "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1099-0542"]}, "title": "A semantic network model for measuring engagement and performance in online learning platforms", "abstract": "Due to the increasing global availability of the internet, online learning platforms such as Massive Open Online Courses (MOOCs), have become a new paradigm for distance learning in engineering education. While interactions between instructors and students are readily observable in a physical classroom environment, monitoring student engagement is challenging in MOOCs. Monitoring student engagement and measuring its impact on student performance are important for MOOC instructors, who are focused on improving the quality of their courses. The authors of this work present a semantic network model for measuring the different word associations between instructors and students in order to measure student engagement in MOOCs. Correlation analysis is then performed for identifying how student engagement in MOOCs affect student performance. Real‐world MOOC transcripts and MOOC discussion forum data are used to evaluate the effectiveness of this research.", "venue": "Computer Applications in Engineering Education", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-07-17", "journal": {"name": "Computer Applications in Engineering Education", "pages": "1481 - 1492", "volume": "26"}, "authors": [{"authorId": "72553740", "name": "Sunghoon Lim"}, {"authorId": "115814663", "name": "Conrad S. Tucker"}, {"authorId": "144864626", "name": "K. Jablokow"}, {"authorId": "3074430", "name": "B. Pursel"}], "citations": [{"paperId": "5036847ed534cd29a8fd60744be5cb205b7506c1", "title": "Evaluation and improvement of online teaching effectiveness of civil law in the context of data analysis"}, {"paperId": "0a19f535af995b44d28fe2d00a89675e011bd85c", "title": "Analyzing Online Reviews to Uncover Customer Satisfaction Factors in Indian Cultural Tourism Destinations"}, {"paperId": "607426fb3fcaa95c2bf4a1c600868238eed01ff0", "title": "An Investigation of The Key Attributes of Korean Wellness Tourism Customers Based on Online Reviews"}, {"paperId": "1dc38402c0b69c0ea902a100cd29c48f1ccb2424", "title": "When E-learning Meets Web 3.0: Applications and Challenges"}, {"paperId": "695cc803a33115030ab794633c9d95cdf3981696", "title": "Learning engagement in massive open online courses: A systematic review"}, {"paperId": "eb6a21f104e74eadfcebe7b760ebdf541f814177", "title": "Construction of College Physical Education MOOCS Teaching Model Based on Fuzzy Decision Tree Algorithm"}, {"paperId": "44e94540cb7fad46188720ea7f21dee0c8791e99", "title": "An Exploratory Study of Electronic Word-of-Mouth Focused on Casino Hotels in Las Vegas and Macao"}, {"paperId": "96cc77807be543eecf498506e9e8d367a7aed2f1", "title": "Ideological and Political Teaching Reform of Computer Network Course Based on Thinking Innovation"}, {"paperId": "f4835159f0ee92e3eeee0b28a8e53133681fd79c", "title": "A Study on the Effectiveness of an Undergraduate Online Teaching Laboratory With Semantic Mechanism From a Student Perspective"}, {"paperId": "dbcc148b9788d073938e2071258b833e88d0393f", "title": "Investigating Key Attributes in Experience and Satisfaction of Hotel Customer Using Online Review Data"}, {"paperId": "61540d36c3c1587fd55083c16b4f57dce087cbad", "title": "Mining Twitter data for causal links between tweets and real-world outcomes"}, {"paperId": "edd7bf276631e502d9fd9037160084d6ba80c6ee", "title": "Measuring the Performance of a Model Semantic Knowledge-Base for Automation of Commonsense Reasoning"}, {"paperId": "9e6c03671532363ba0263946e08fed8ed4845414", "title": "Evaluating the efficiency of social learning networks: Perspectives for harnessing learning analytics to improve discussions"}, {"paperId": "d3b859b8de5f7e9cdb483cf9a938370a5fb72e08", "title": "A Systematic Review of Educational Data Mining"}, {"paperId": "2657b8848b272acbfe8a2997556a032026a49e65", "title": "Analysis of Student Engagement Data from U.S. News & World Report Regarding Online Graduate Engineering Programs"}]}
