{"paperId": "ced25894de86bdd54b8bd0db56cec85e21335063", "publicationVenue": {"id": "6c1a00cb-4b59-44d6-a887-bfd7c5b3768f", "name": "International Conference on Industrial Technology", "type": "conference", "alternate_names": ["ICIT", "Int Conf Ind Technol", "IEEE Int Conf Integr Technol", "IEEE International Conference on Integration Technology"]}, "title": "Prototyping intrusion detection in an industrial cloud-native digital twin", "abstract": "Digital twins are poised to play a vital role in the industry 4.0 era. A cloud-based digital twin can augment the entity that it represents. To that effect, we envision that digital twins can have embedded control systems when paired with a cyber physical system, yielding significant performance and configurability advantages. However, relegating controllers to a cloud-based digital twin exposes them to a new set of attack surfaces. Given the intricacy of such systems and the plethora of mitigating actions they can take, intrusion detection is integral to maintaining the integrity of such system. In this paper, we propose and prototype a cloud-native digital twin proof of concept for evaluating the viability of the concept. The resulting platform is evaluated for its ability to host a cyber-physical system and its potential to incorporate an intrusion detection system.", "venue": "International Conference on Industrial Technology", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-03-10", "journal": {"name": "2021 22nd IEEE International Conference on Industrial Technology (ICIT)", "pages": "749-755", "volume": "1"}, "authors": [{"authorId": "3430575", "name": "William Tarneberg"}, {"authorId": "36087480", "name": "P. Skarin"}, {"authorId": "2003800", "name": "C. Gehrmann"}, {"authorId": "1683142", "name": "M. Kihl"}], "citations": [{"paperId": "9788fd33f936f5164c4a59585aad43edce33110f", "title": "Digital Twins and the Future of Their Use Enabling Shift Left and Shift Right Cybersecurity Operations"}, {"paperId": "237400f61c37c1fe7b9d2383b9cb162a6aef6c50", "title": "Blockchain and Deep Learning for Secure Communication in Digital Twin Empowered Industrial IoT Network"}]}
