{"paperId": "ced43eb1f67679845a41ee808d46225de7ceb24a", "publicationVenue": {"id": "1cd505d9-195d-4f99-b91c-169e872644d4", "name": "Energies", "type": "journal", "issn": "1996-1073", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-155563", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-155563", "https://www.mdpi.com/journal/energies", "http://www.mdpi.com/journal/energies"]}, "title": "The European Union’s Energy Policy Efforts Regarding Emission Reduction in Cities—A Method Proposal", "abstract": "Decisions regarding waste and emission management systems are subject to many sustainability criteria, including environmental, social, and economic criteria. The problem is the multidimensionality of the energy transformation and its reading from different perspectives. This article aims to assess the effectiveness of the municipal energy policy. The VIKOR multicriteria analysis approach to modeling and Criteria Importance Through Intercriteria Correlation were chosen for the method. The approach made it possible to create a ranking and choose a compromise solution. The analyses were carried out for four areas of intervention (ETS tariffs), in which a set of four general criteria and twelve specific criteria were distinguished, and based on the weights assigned, rankings were created highlighting the activities that have the greatest impact on low emission in urban areas. Based on the analyses, it was found that the most significant impact on reducing emissions in urban areas has led to decisions to increase investments in renewable energy sources and promote the reduction in household energy consumption.", "venue": "Energies", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-22", "journal": {"name": "Energies"}, "authors": [{"authorId": "4181838", "name": "M. Skiba"}, {"authorId": "69489610", "name": "M. Mrówczyńska"}, {"authorId": "101068462", "name": "M. Sztubecka"}, {"authorId": "114461531", "name": "Alicja Maciejko"}, {"authorId": "103055984", "name": "Natalia Rzeszowska"}], "citations": [{"paperId": "feb34e2b131241b464c8d01e7d530c3663219ab1", "title": "BIM Policy in Eastern Europe"}]}
