{"paperId": "cee24bfaed9299885b2c565cf203cf8cf8bdcabe", "publicationVenue": {"id": "187dde4a-2b59-491b-b6cf-1a8618878cdc", "name": "International Conference on Mobile Data Management", "type": "conference", "alternate_names": ["Int Conf Mob Data Manag", "MDM", "Mobile Data Management", "Mob Data Manag"]}, "title": "SS-OCoClus: A contiguous order-aware method for semantic trajectory co-clustering", "abstract": "Co-clustering is a specific type of clustering that addresses the problem of finding groups of objects without necessarily considering all attributes. This technique has shown to have more consistent results in high-dimensional sparse data than traditional clustering. In trajectory co-clustering, the methods found in the literature have two main limitations: first, the space and time dimensions have to be constrained by user-defined thresholds; second, elements (trajectory points) are clustered ignoring the trajectory sequence, assuming that the points are independent among them. To address the limitations above, we propose a new trajectory co-clustering method for mining semantic trajectory co-clusters. It simultaneously clusters the trajectories and their elements taking into account the order in which they appear. This new method uses the element frequency to identify candidate co-clusters. Besides, it uses an objective cost function that automatically drives the co-clustering process, avoiding the need for constraining dimensions. We evaluate the proposed approach using a real-world publicly available dataset. The experimental results show that our proposal finds frequent and meaningful contiguous sequences revealing mobility patterns, thereby the most relevant elements.", "venue": "International Conference on Mobile Data Management", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-06-01", "journal": {"name": "2022 23rd IEEE International Conference on Mobile Data Management (MDM)", "pages": "198-207"}, "authors": [{"authorId": "153331647", "name": "Yuri Santos"}, {"authorId": "32789180", "name": "J. Carvalho"}, {"authorId": "1706154", "name": "V. Bogorny"}], "citations": []}
