{"paperId": "cee83d4aa6f9239ee17633a4a1f8816179336f54", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Research on an Online Monitoring System for Efficient and Accurate Monitoring of Mine Water", "abstract": "Our goal is to solve the complexity of laying down wiring for traditional monitoring systems for mine water, while taking into account the poor timeliness of sampling and continuous monitoring, based on the processing and reuse of mine water. In this article, we focus on the theory of multi-sensor networks to estimate mine water quality, quantity monitoring equipment, and mine water Internet of Things (hereafter denoted “IoT”) communication systems. We designed a mine water IoT monitoring system for the wireless monitoring of water quantity and quality, developed an experimental platform for the wireless monitoring of mine water. This platform has the advantages of simple wiring and strong expandability. Finally, we tested and analyzed the system operation effects. To solve the problem of partial data abnormalities caused by problems of sensing equipment, we propose a data abnormality detection method based on an isolated forest that combines the characteristics of the sufficient timeliness of mine water monitoring data, and we offer experimental verification and analysis. The experimental results show that the system can realize the real-time wireless monitoring of mine water quality and quantity information with stable and fast data transmission capability. Furthermore, the system can quickly discover, analyze, and process abnormal data, has sufficient timeliness while guaranteeing the validity of the data output from the monitoring platform.", "venue": "IEEE Access", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "18743-18756", "volume": "10"}, "authors": [{"authorId": "2052636216", "name": "Lei Bo"}, {"authorId": "2152799830", "name": "Yang Liu"}, {"authorId": "2116461904", "name": "Zihang Zhang"}, {"authorId": "9462251", "name": "Dongxu Zhu"}, {"authorId": "2107945915", "name": "Yiying Wang"}], "citations": [{"paperId": "bdd5a6295a59e10d4069aa15a0cbab96778dad10", "title": "Kajian Awal Pemanfaatan Sistem Cerdas untuk Pemantauan Kualitas Air dalam Konteks Pembangunan Pabrik AMDK"}, {"paperId": "52e8620ae6867f21a2a635d77db0ee9dfb1c13c9", "title": "Efficient Underwater Wireless Data Transmission Technique and Signal Processing"}, {"paperId": "c9e37498f4fa78b692b93b2177b1d22fb3edf061", "title": "Recent Advancements in IoT Implementation for Environmental, Safety, and Production Monitoring in Underground Mines"}, {"paperId": "0c3b5b63d946e82773ee646b4319c2777126b2c4", "title": "Design and Implementation of Remote Real-time Condition Monitoring System for Power Operator"}, {"paperId": "4f3667e4187eb446a6bbafff69510ed78ff38408", "title": "Surface water quality profiling using the water quality index, pollution index and statistical methods: A critical review"}, {"paperId": "6c4ea740b85091e80e6e82303b840f6d69b748d8", "title": "Optimal Reuse Design Scheduling of Mine Water Based on Improved Whale Algorithm"}, {"paperId": "fa6c5e295997a8739f2b098b6703fb973c475c25", "title": "Research on Multi-Level Scheduling of Mine Water Reuse Based on Improved Whale Optimization Algorithm"}]}
