{"paperId": "ceefba3d6f3d53084e5b90c22ba05f7c8e881e26", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Leveraging IoT-Aware Technologies and AI Techniques for Real-Time Critical Healthcare Applications", "abstract": "Personalised healthcare has seen significant improvements due to the introduction of health monitoring technologies that allow wearable devices to unintrusively monitor physiological parameters such as heart health, blood pressure, sleep patterns, and blood glucose levels, among others. Additionally, utilising advanced sensing technologies based on flexible and innovative biocompatible materials in wearable devices allows high accuracy and precision measurement of biological signals. Furthermore, applying real-time Machine Learning algorithms to highly accurate physiological parameters allows precise identification of unusual patterns in the data to provide health event predictions and warnings for timely intervention. However, in the predominantly adopted architectures, health event predictions based on Machine Learning are typically obtained by leveraging Cloud infrastructures characterised by shortcomings such as delayed response times and privacy issues. Fortunately, recent works highlight that a new paradigm based on Edge Computing technologies and on-device Artificial Intelligence significantly improve the latency and privacy issues. Applying this new paradigm to personalised healthcare architectures can significantly improve their efficiency and efficacy. Therefore, this paper reviews existing IoT healthcare architectures that utilise wearable devices and subsequently presents a scalable and modular system architecture to leverage emerging technologies to solve identified shortcomings. The defined architecture includes ultrathin, skin-compatible, flexible, high precision piezoelectric sensors, low-cost communication technologies, on-device intelligence, Edge Intelligence, and Edge Computing technologies. To provide development guidelines and define a consistent reference architecture for improved scalable wearable IoT-based critical healthcare architectures, this manuscript outlines the essential functional and non-functional requirements based on deductions from existing architectures and emerging technology trends. The presented system architecture can be applied to many scenarios, including ambient assisted living, where continuous surveillance and issuance of timely warnings can afford independence to the elderly and chronically ill. We conclude that the distribution and modularity of architecture layers, local AI-based elaboration, and data packaging consistency are the more essential functional requirements for critical healthcare application use cases. We also identify fast response time, utility, comfort, and low cost as the essential non-functional requirements for the defined system architecture.", "venue": "Italian National Conference on Sensors", "year": 2022, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-10-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "22"}, "authors": [{"authorId": "89260460", "name": "A. Shumba"}, {"authorId": "3018189", "name": "Teodoro Montanaro"}, {"authorId": "2384354", "name": "Ilaria Sergi"}, {"authorId": "92258255", "name": "L. Fachechi"}, {"authorId": "145308942", "name": "M. Vittorio"}, {"authorId": "2313037", "name": "L. Patrono"}], "citations": [{"paperId": "cef6713b723224d4f1dadd3e6dc95baa63d24644", "title": "Tiny Machine Learning: Progress and Futures [Feature]"}, {"paperId": "a45ed4b838b638ab8fa5c49212f85712136a9d16", "title": "A Wireless Potentiostat Exploiting PWM-DAC for Interfacing of Wearable Electrochemical Biosensors in Non-Invasive Monitoring of Glucose Level"}, {"paperId": "445c8609fc7a4a35b0c47d9a72fd457355b3c10b", "title": "Age of Information in Internet of Things: A Survey"}, {"paperId": "b6c07f9092250b0cbb0969842f62b039ef6543d2", "title": "Impact of Network Coding on Age of Information"}, {"paperId": "7de0edaaea07289bbed001d9abdfcb8f99aeab57", "title": "Machine learning classifiers for fall detection leveraging LoRa communication network"}, {"paperId": "82447ddb4aa7087e2d4123fbbf4b5f428c6850f0", "title": "Advanced Data Processing of Pancreatic Cancer Data Integrating Ontologies and Machine Learning Techniques to Create Holistic Health Records"}, {"paperId": "db9fd459f5ac0e8217baf1069ea4f289f8775cfe", "title": "End-to-End Solution for Analog Gauge Monitoring Using Computer Vision in an IoT Platform"}, {"paperId": "a95d3717118763bbb6f678ff7a4280bc0c8588a1", "title": "Memory Management Strategies for an Internet of Things System"}, {"paperId": "6ce8b5293cfd5f2f98af5214b04b4e6f663d3c74", "title": "Barriers and Facilitators of Artificial Intelligence in Family Medicine: An Empirical Study With Physicians in Saudi Arabia"}, {"paperId": "1d85407eb8c4ed72dedc69eb9d5dae4b01066703", "title": "Ambient assisted living for frail people through human activity recognition: state-of-the-art, challenges and future directions"}, {"paperId": "2fa7034906676ddb602355854620031a79c94788", "title": "Wearable Technologies and AI at the Far Edge for Chronic Heart Failure Prevention and Management: A Systematic Review and Prospects"}, {"paperId": "8015e4a3b659a208ca8b9756fa0ffe5e59c5524a", "title": "An IoT-based Platform for Remote Monitoring of Patients with Heart Failure: an Overview of Integrable Devices"}, {"paperId": "32d66bbb56d034054cb9d31a1257af294b98da6b", "title": "An IoT-aware system for remote monitoring of patients with chronic heart failure"}, {"paperId": "a4c370414c181d5a69b1d522201f42c43f98cb2c", "title": "ElectroSense: a Low-cost Wearable Potentiostat for Real-time Monitoring of Glucose Level"}, {"paperId": "821e0c4406c4628a8cc3d973163e0601252150db", "title": "SpO2 Estimation Using Deep Neural Networks: A Comparative Study"}, {"paperId": "7ea95a770b59fa68d2e7b9e5ed55d54f335f4b15", "title": "IoT and Hybrid Cloud for Smart Hospital Management"}, {"paperId": "fafcb060edfb5956b3d2c92d8eec0b46a295c571", "title": "Comparison of Cloud Computing and TinyML Methods for Brain-Computer Interface in Motor Imagery Problems"}, {"paperId": "e98e20aa26fa14142c7903d518629b9d386e49a4", "title": "Electromyogram (EMG) Signal Classification Based on Light-Weight Neural Network with FPGAs for Wearable Application"}, {"paperId": "1a38b71b105ce20ef1705de216031a0112db884a", "title": "A 177 ppm RMS Error-Integrated Interface for Time-Based Impedance Spectroscopy of Sensors"}, {"paperId": "070f79133d7fd8e8519fadfc472ed1a9704b32f3", "title": "HADE: Exploiting Human Action Recognition Through Fine-Tuned Deep Learning Methods"}, {"paperId": "eda4ea18576bcf1b69f457dff4a3bd0a3bfb5767", "title": "Enhancing Healthcare Efficacy Through IoT-Edge Fusion: A Novel Approach for Smart Health Monitoring and Diagnosis"}]}
