{"paperId": "cf020b90b5cf026ba0cebc7447fdbeb071c45185", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Role of Apache Software Foundation in Big Data Projects", "abstract": "With the increase in amount of Big Data being generated each year, tools and technologies developed and used for the purpose of storing, processing and analyzing Big Data has also improved. Open-Source software has been an important factor in the success and innovation in the field of Big Data while Apache Software Foundation (ASF) has played a crucial role in this success and innovation by providing a number of state-of-the-art projects, free and open to the public. ASF has classified its project in different categories. In this report, projects listed under Big Data category are deeply analyzed and discussed with reference to one-of-the seven sub-categories defined. Our investigation has shown that many of the Apache Big Data projects are autonomous but some are built based on other Apache projects and some work in conjunction with other projects to improve and ease development in Big Data space.", "venue": "arXiv.org", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-05-05", "journal": {"name": "ArXiv", "volume": "abs/2005.02829"}, "authors": [{"authorId": "1947051", "name": "Aleem Akhtar"}], "citations": [{"paperId": "11c60ac8da62e43015a7e77c47b95ebe97a5d0d6", "title": "Evolution and Impact of High Content Imaging."}, {"paperId": "7a21544c724eb9bf9aeef71ed1b1cebcfe864b41", "title": "Popularity Ranking of Database Management Systems"}, {"paperId": "caf598caf1250054a9ef7f2530b9d749cdff09e1", "title": "A Survey of JSON-compatible Binary Serialization Specifications"}, {"paperId": "7075f331085d1d0232229584e47bf4ece58b5b43", "title": "Studi Literatur: Perbandingan Basis Data NewSQL"}, {"paperId": "d039cdef2e9d8564a12e061a192566bb1afd104b", "title": "Comparative Analysis of Spark and Ignite for Big Spatial Data Processing"}]}
