{"paperId": "cf0b2d419cfec5c2b74812419cd4e90e200a89e5", "publicationVenue": {"id": "e4349801-a949-442f-8fe2-1630d6ee1428", "name": "Symposium on High Performance Computing Systems", "type": "conference", "alternate_names": ["WSCAD", "Symp High Perform Comput Syst"]}, "title": "Design Space Exploration of Heterogeneous Systems Applied to the Cloud Resource Allocation Problem", "abstract": "Cloud computing services providers offer on-demand computing resources to applications. Finding the best cloud resource allocation that fits the users’ budget, meets application performance and constraints are still a research challenge. The cloud resource allocation problem is quite akin to the Design Space Exploration (DSE) problem once they both have to find suitable hardware configurations in an ample design space, having incompatible objectives subject to several constraints. This work presents a solution to the cloud resource allocation problem by applying a design space exploration technique. We have designed and developed a software extension, MultiExplorer-VM, from a DSE tool, MultiExplorer, that has a workflow to provide virtual machine configurations according to the users’ requirements and application constraints. A comprehensive set of experiments has been performed to evaluate and validate the proposed tool. We have also compared solutions from our proposal to other existing research work focused on the cloud resource allocation problem based on the Paramount Interaction (PI) technique. The results show that the MultiExplorer-VM achieves significant (better) results than the PI technique. The cost results brought by the MultiExplorer-VM were up to 8.8 times lower compared to the PI technique. The experiments also reveal that for most of the applications, MultiExplorer-VM achieved the optimal cloud configuration.", "venue": "Symposium on High Performance Computing Systems", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-10-19", "journal": {"name": "Anais do XXIII Simpósio em Sistemas Computacionais de Alto Desempenho (WSCAD 2022)"}, "authors": [{"authorId": "2073742318", "name": "D. C. A. Arigoni"}, {"authorId": "2110893868", "name": "Ricardo Ribeiro dos Santos"}, {"authorId": "2187105896", "name": "Liana D. Duenha Garanhani"}], "citations": [{"paperId": "140a49ee5c8ef92377868343d8f5de0f1eeb3b6f", "title": "A Tool for Teaching and Learning of Design Space Exploration on Processor Architectures"}]}
