{"paperId": "cf11a0ed193df2aa00573737136e6f9c98e2c820", "publicationVenue": {"id": "29e6e722-a307-4196-958e-46e585f2fc47", "name": "IEEE Transactions on Reliability", "type": "journal", "alternate_names": ["IEEE Trans Reliab"], "issn": "0018-9529", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=24", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=24"]}, "title": "A System-Level Framework for Analytical and Empirical Reliability Exploration of STT-MRAM Caches", "abstract": "Spin-transfer torque magnetic RAM (STT-MRAM) is known as the most promising replacement for static random access memory (SRAM) technology in large last-level cache memories (LLC). Despite its high density, nonvolatility, near-zero leakage power, and immunity to radiation as the major advantages, STT-MRAM-based cache memory suffers from high error rates mainly due to retention failure (RF), read disturbance, and write failure. Existing studies are limited to estimate the rate of only one or two of these error types for STT-MRAM cache. However, the overall vulnerability of STT-MRAM caches, whose estimation is a must to design cost-efficient reliable caches, has not been studied previously. In this paper, we propose a system-level framework for reliability exploration and characterization of errors’ behavior in STT-MRAM caches. To this end, we formulate the cache vulnerability considering the intercorrelation of the error types including RF, read disturbance, and write failure as well as the dependency of error rates to workloads’ behavior and process variations (PVs). Our analysis reveals that STT-MRAM cache vulnerability is highly workload-dependent and varies by orders of magnitude in different cache access patterns. Our analytical study also shows that this vulnerability divergence significantly increases by PVs in STT-MRAM cells. To take the effects of system workloads and PVs into account, we implement the error types in gem5 full-system simulator. The experimental results using a comprehensive set of multiprogrammed workloads from SPEC CPU2006 benchmark suite on a quad-core processor show that the total error rate in a shared STT-MRAM LLC varies by 32.0× for different workloads. A further 6.5× vulnerability variation is observed when considering PVs in the STT-MRAM cells. In addition, the contribution of each error type in total LLC vulnerability highly varies in different cache access patterns and moreover, error rates are differently affected by PVs. The proposed analytical and empirical studies can significantly help system architects for efficient utilization of error mitigation techniques and designing highly reliable and low-cost STT-MRAM LLCs.", "venue": "IEEE Transactions on Reliability", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-06-01", "journal": {"name": "IEEE Transactions on Reliability", "pages": "594-610", "volume": "69"}, "authors": [{"authorId": "3113822", "name": "Elham Cheshmikhani"}, {"authorId": "2916786", "name": "Hamed Farbeh"}, {"authorId": "144394335", "name": "H. Asadi"}], "citations": [{"paperId": "a3e93e2dcab1ed3a47fd9762ede9de7ff30cb551", "title": "An Energy Efficient Multi-Retention STT-MRAM Memory Architecture for IoT Applications"}, {"paperId": "75df176821ae4364beb6a86c915039ca59ff4e48", "title": "MRAM-Based Cache System Design and Policy Optimization for RISC-V Multi-Core CPUs"}, {"paperId": "075b66b341fd7361bf7eb840aacd926031f53e16", "title": "Enhancing the lifetime of STT-RAM using compression based wear leveling technique"}, {"paperId": "be294a50b440a9f0d5dd9e7e6df340ee4136c721", "title": "Double-Ended Superposition Anti-Noise Resistance Monitoring Write Termination Scheme for Reliable Write Operation in STT-MRAM"}, {"paperId": "c0b57b9bc49fb23f6b00dcdcdfb12e52c783d1df", "title": "L2C2: Last-level compressed-contents non-volatile cache and a procedure to forecast performance and lifetime"}, {"paperId": "47eb81e79670a76a80e78072e039b7fad2abb5e2", "title": "Novel multi-bit parallel pipeline-circuit design for STT-MRAM"}, {"paperId": "05d0d993f1c0579963368e0548ef88b26d7b3a46", "title": "Modeling and enhancing magnetic immunity of STT-MRAM"}, {"paperId": "5c18fb3361d110019a5c7b62fe7d75bf84b5134c", "title": "EXTENT: Enabling Approximation-Oriented Energy Efficient STT-RAM Write Circuit"}, {"paperId": "963e0c1df8652227ab0ebcf12034856671135769", "title": "3RSeT: Read Disturbance Rate Reduction in STT-MRAM Caches by Selective Tag Comparison"}, {"paperId": "176d8b70378d0e53eeadfaa011ccb1ececa1830a", "title": "Data block manipulation for error rate reduction in STT-MRAM based main memory"}, {"paperId": "e305657709d755127dc95b655bfd59465a65d31f", "title": "CoPA: Cold Page Awakening to Overcome Retention Failures in STT-MRAM Based I/O Buffers"}, {"paperId": "398fa078efe1a720b51b3b559cb6f346e7d3d721", "title": "Novel ESD device design for STT-MRAM memory chip"}, {"paperId": "c8179f773ae3a6c2520be63fd43c6d923010b989", "title": "CORIDOR: Using COherence and TempoRal LocalIty to Mitigate Read Disurbance ErrOR in STT-RAM Caches"}, {"paperId": "4fbe052ca080f8e5be2b9d2796b0e99284efc567", "title": "An Architectural-Level Reliability Improvement Scheme in STT-MRAM Main Memory"}, {"paperId": "c1245f72f38e8059505d0a59e2636a755643e1be", "title": "Cache performance of NV-STT-MRAM with scale effect and comparison with SRAM"}, {"paperId": "ac8514881a9a74e0c8911dbbc4d075d6378105c9", "title": "A Survey of Test and Reliability Solutions for Magnetic Random Access Memories"}, {"paperId": "fc6955ef2530d59f20ce7ea40148beeb6d1766a1", "title": "STAIR: High Reliable STT-MRAM Aware Multi-Level I/O Cache Architecture by Adaptive ECC Allocation"}, {"paperId": "23bd4f8c3cfb94decb205b583c6a108ce2fd5b80", "title": "Improving Bit-Error-Rate Performance Using Modulation Coding Techniques for Spin-Torque Transfer Magnetic Random Access Memory"}]}
