{"paperId": "cf1b5d76df347afc6454a20b785d52ebf2b42010", "publicationVenue": {"id": "ebac41dc-daae-495b-b205-6f48b790974d", "name": "Big Earth Data", "issn": "2574-5417", "url": "https://tandfonline.com/loi/tbed20", "alternate_urls": ["http://www.tandfonline.com/TBED"]}, "title": "Analytics of big geosocial media and crowdsourced data", "abstract": "Numerous crowdsourcing and social media platforms such as CrowdSpring, Idea Bounty, DesignCrowd, Facebook, Twitter, Flickr, Weibo, WeChat, and Instagram are creating and sharing vast amounts of user-generated content that can reveal timely and useful information for detecting traffic patterns, mitigating security risks and other types of timecritical events, discovering social structures characteristics, predicting human movement, etc. Crowdsourcing, also known as volunteered geographic information (VGI), has added a new dimension to traditional geospatial data acquisition by providing fine-grained proxy data for human activity research in urban studies (Chen et al., 2016; Niu & Silva, 2020). However, analyzing big geosocial media and crowdsourced data brings significant methodological and theoretical challenges due to the uncertain user representability when referring to human behavior in general, the inherent noisy data that requires highperformance cost of preprocessing, and the heterogeneity in quality and quantity of sources. In particular, geosocial media data and their derived metrics can provide valuable insights and policy strategies, but they require a deep understanding of what the metrics actually measure (Zook, 2017). All of these underpin complex assessments, not mentioning the ethnic and privacy issues. Therefore, new sets of methods and tools are required to analyze the big data from crowdsourcing and social media platforms. This special issue aims at a collection of the state-of-the-art research efforts that address these challenges, including techniques, practices, and applications in the integration of different types of big geosocial media and crowdsourced data for developing and evaluating methods and techniques for semantic classification of web services, mobility, 3D building modeling, data disaggregation, quality control, and visualization of transportation data. As illustrated in Figure 1, handling big crowdsourced data is an important fundamental part of the research studies reported in the included articles. The special issue starts with a review article titled “A review of the use of geosocial media data in agent-based models for studying urban systems” by Richard Wen and Songnian Li. Through a review of recent agent-based modelling applications that incorporate geosocial media data in the context of urban systems, the authors explore how their integration can help urban studies and what challenges and opportunities remain. It concludes that the complex and dynamic nature of urban systems has made agent-based modelling an appropriate and effective approach for studying the social interactions in urban systems, while the integration of a sheer amount of geosocial media data with agent-based modelling can optimize ABMs, which can be applied to various real-world applications involving social infrastructures in urban systems. With the emergence of the Internet of Moving Things (IoMT) as a new technological infrastructure for sensing and communication, Black and Wachowicz, in their article “Clustering spatio-temporal bi-partite graphs for finding crowdsourcing communities in IoMT networks”, describe a bi-partite graph based on representing the changes of mobility relationships. This graph representation is needed to identify a volunteer BIG EARTH DATA 2021, VOL. 5, NO. 1, 1–4 https://doi.org/10.1080/20964471.2021.1898780", "venue": "Big Earth Data", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2021-01-02", "journal": {"name": "Big Earth Data", "pages": "1 - 4", "volume": "5"}, "authors": [{"authorId": "50341311", "name": "Songnian Li"}, {"authorId": "145349714", "name": "M. Wachowicz"}, {"authorId": "1706428", "name": "H. Fan"}], "citations": [{"paperId": "a1151f0bc2a8d2a5137edfb03c8784d14ff6b7a6", "title": "Variability and trends in land surface longwave radiation fluxes from six satellite and reanalysis products"}, {"paperId": "df6059fa63ce3b8552a3cd2e9294f00c74f37c8c", "title": "Using geospatial social media data for infectious disease studies: a systematic review"}, {"paperId": "71c6d672954f7cc3fe20dc7fc27b664a424b0a32", "title": "Exploring spatiotemporal patterns of geosocial media data for urban functional zone identification"}]}
