{"paperId": "cf5f7a9f85e516daa7997dfcec1f2135b7a9bc5c", "publicationVenue": {"id": "8d051ed1-e691-49d8-8a57-d7b4a76c4352", "name": "IEEE Conference on Network Softwarization", "type": "conference", "alternate_names": ["IEEE Conf Netw Softwarization", "NetSoft"]}, "title": "Adaptive Retraining of AI/ML Model for Beyond 5G Networks: A Predictive Approach", "abstract": "Beyond fifth-generation (B5G) networks (namely 6G) aim to support high data rates, low-latency applications, and massive machine communications. Integrating Artificial Intelligence (AI) and Machine Learning (ML) models are essential for addressing the network’s increasing complexity and dynamic nature. However, dynamic service demands of B5G cause the AI/ML models performance degradation, resulting in violations of Service Level Agreements (SLA), over-or under-provisioning of resources, etc. To address the performance degradation of the AI/ML models, retraining is essential. Existing threshold and periodic retraining approaches have potential disadvantages such as SLA violations and inefficient resource utilization for setting a threshold parameter in a dynamic environment. This paper presents a novel algorithm that predicts when to retrain AI/ML models using an unsupervised classifier. The proposed predictive approach is evaluated for a Quality of Service (QoS) prediction use case on the Open RAN Software Community (OSC) platform and compared to the threshold approach. The results show that the proposed predictive approach outperforms the threshold approach.", "venue": "IEEE Conference on Network Softwarization", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-06-19", "journal": {"name": "2023 IEEE 9th International Conference on Network Softwarization (NetSoft)", "pages": "282-286"}, "authors": [{"authorId": "2090272211", "name": "Venkateswarlu Gudepu"}, {"authorId": "2283541", "name": "Venkatarami Reddy Chintapalli"}, {"authorId": "1681270", "name": "P. Castoldi"}, {"authorId": "1790498", "name": "L. Valcarenghi"}, {"authorId": "11152076", "name": "T. B. Reddy"}, {"authorId": "49677692", "name": "K. Kondepu"}], "citations": [{"paperId": "47792f8d869feb88f60ec86e0b33f71764b265b5", "title": "The Smart Predictive Network Maintenance Model using AI/ML Time Series Analysis in Cloud Networks"}, {"paperId": "f572ceb24a6d49888a0450a36ba40153081fb2c6", "title": "EARNEST: Experimental Analysis of RAN Energy with Open-Source Software Tools"}, {"paperId": "5cffe0c3c3430444d8859a323ba003fc83d91010", "title": "AI/ML Model Training in O-RAN: Assessing Datasets for Hoarding and Choosing Strategies"}, {"paperId": "4b74b05626684670fdb7b318059dc9151ed0080d", "title": "Research on 6G intelligent network architecture and key technologies for intelligent generation and autonomy"}]}
