{"paperId": "cf67a8f6141e479f6ce596eedb507301a37b9433", "publicationVenue": null, "title": "Transfer learning from synthetic to routine clinical data for motion artefact detection in brain T1-weighted MRI", "abstract": "Clinical data warehouses (CDWs) contain the medical data of millions of patients and represent a great opportunity to develop computational tools. MRIs are particularly sensitive to patient movements during image acquisition, which will result in artefacts (blurring, ghosting and ringing) in the reconstructed image. As a result, a significant number of MRIs in CDWs are unusable because corrupted by these artefacts. Since their manual detection is impossible due to the number of scans, it is necessary to develop a tool to automatically exclude images with motion in order to fully exploit CDWs. In this paper, we propose a CNN for the automatic detection of motion in 3D T1-weighted brain MRI. Our transfer learning approach, based on synthetic motion generation, consists of two steps: a pre-training on research data using synthetic motion, followed by a fine-tuning step to generalise our pre-trained model to clinical data, relying on the manual labelling of 5500 images. The objectives were both (1) to be able to exclude images with severe motion, (2) to detect mild motion artefacts. Our approach achieved excellent accuracy for the first objective with a balanced accuracy nearly similar to that of the annotators (balanced accuracy<80%). However, for the second objective, the performance was weaker and substantially lower than that of human raters. Overall, our framework will be useful to take advantage of CDWs in medical imaging and to highlight the importance of a clinical validation of models trained on research data.", "venue": "Medical Imaging", "year": 2023, "fieldsOfStudy": ["Computer Science", "Engineering"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-04-03", "journal": {"pages": "124641H - 124641H-7", "volume": "12464"}, "authors": [{"authorId": "2129489721", "name": "Sophie Loizillon"}, {"authorId": "51225673", "name": "Simona Bottani"}, {"authorId": "1657541144", "name": "Aurélien Maire"}, {"authorId": "4171599", "name": "Sebastian Ströer"}, {"authorId": "46638272", "name": "D. Dormont"}, {"authorId": "2333839", "name": "O. Colliot"}, {"authorId": "144068001", "name": "N. Burgos"}], "citations": [{"paperId": "8f49fae4dbc8c7cc85195327cc18fe0802894783", "title": "Automatic motion artefact detection in brain T1-weighted magnetic resonance images from a clinical data warehouse using synthetic data."}, {"paperId": "f450dfb56cf16bdca52f2efc1a6f48cf010052d2", "title": "Reproducibility in machine learning for medical imaging"}]}
