{"paperId": "cf7538d93dff8941ee8aa80a5c997bccff495ee6", "publicationVenue": {"id": "a234316e-a138-4d28-9486-28de0ad963e5", "name": "Complex Systems Informatics and Modeling Quarterly", "alternate_names": ["Complex Syst Informatics Model Q"], "issn": "2255-9922", "url": "https://csimq-journals.rtu.lv/"}, "title": "Applicability of Blockchain Technology in Securities Settlement", "abstract": "Technological advancements are often adopted to financial markets to improve their operations and safety. Blockchain technology has been recognized as one of the potential technologies to be utilized in capital markets. The goal of this article is to evaluate the applicability of using the blockchain technology in securities settlement process. First, the theoretical background of blockchain technology is reviewed and the current financial market infrastructure is examined. Then Central Securities Depositories Regulation and the current securities settlement processes are examined. Blockchain applicability framework designed by Gourisetti, Mylrea and Patangia is applied to assess the blockchain technology’s applicability to securities settlement. The results suggest that blockchain technology can be applied to securities settlement, and the used blockchain type should be a private blockchain with Proof-of-Authority consensus mechanism. A blockchain architecture model, based on a model provided by Zhuang, Chen, Shae and Shyu, and potential node structure for securities settlement are developed, taking into account the existing literature on blockchain technology, financial markets, and Central Securities Depositories Regulation. The proposed blockchain architecture model and node structure are then evaluated against scholar expected benefits and drawbacks of using blockchain for securities settlement and cross-border settlement efficiency. The evaluation reveals that the proposed blockchain technology model can potentially improve some of the current securities settlement issues, such as costly reconciliation and difficult cross-border securities settlement. At the same time, using blockchain technology in securities settlement would be challenging because the practical implementation time would be long and would require market-wide commitment. The main artefacts of this article are the proposed blockchain architecture model and node structure that would allow securities settlement processes to be executed using blockchain technology.", "venue": "Complex Systems Informatics and Modeling Quarterly", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-10-31", "journal": {"name": "Complex Syst. Informatics Model. Q.", "pages": "34-58", "volume": "28"}, "authors": [{"authorId": "2136614643", "name": "Janis Bauvars"}], "citations": [{"paperId": "aae8f7cd2183562d41fadf27f6949e70b09c398d", "title": "Towards Blockchain-Based Secure Storage and Trusted Data Sharing Scheme for IoT Environment"}, {"paperId": "18501ddff33df60cf8af5f3124a257991a0a47bb", "title": "Blockchain Applicability for Securities Settlement"}]}
