{"paperId": "cf7de87fbfee70c23e0374579b25c4dd4667123b", "publicationVenue": {"id": "8447961d-5f19-4ddf-82f9-bfa384d49ea7", "name": "Molecular Nutrition & Food Research", "type": "journal", "alternate_names": ["Mol Nutr  Food Res"], "issn": "1613-4125", "url": "http://www.wiley-vch.de/publish/en/journals/alphabeticIndex/2216/"}, "title": "Egg Yolk Lipids Alleviated Dextran Sulfate Sodium-Induced Colitis by Inhibiting NLRP3 Inflammasome and Regulating Gut Microbiota.", "abstract": "The increasing incidence of inflammatory bowel disease (IBD) has become a global phenomenon. Egg yolk lipids are one of the essential dietary foods, but its effects on intestinal immunity remain unclear. Here, egg yolk lipids are obtained using ethanol extraction and a total of 601 kinds of lipids are detected via lipidomics, including 251 kinds of triglycerides, 133 kinds of phosphatidylcholines, 44 kinds of phosphatidylethanolamines. Then, the study finds that egg yolk lipids significantly alleviate dextran sulfate sodium-induced colitis and reduce the production of inflammatory factors. Meanwhile, egg yolk lipids also maintain intestinal barrier integrity and decrease lipopolysaccharide translocation by alleviating intestinal structure damage and increasing the numbers of goblet cells and mucin 2. Mechanistically, egg yolk lipids attenuate colitis by inhibiting the assembly and activation of NLRP3 inflammasome. Moreover, the study also finds that egg yolk lipids reverse gut microbiota dysbiosis referring to increased relative abundance of Bacteroides acidifaciens and decrease relative abundance of Akkermansia muciniphila, as well as increased short chain fatty acids concentration in the gut. Together, the study elucidates the anti-colitis effect of egg yolk lipids and provides positive evidences for egg yolk lipids involving in dietary strategy and IBD therapy.", "venue": "Molecular Nutrition & Food Research", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-11-30", "journal": {"name": "Molecular nutrition & food research", "pages": "\n          e2300509\n        "}, "authors": [{"authorId": "1491349288", "name": "Nanhai Xiao"}, {"authorId": "2153233354", "name": "Wen He"}, {"authorId": "2180640013", "name": "Shuping Chen"}, {"authorId": "2110317717", "name": "Yao Yao"}, {"authorId": "49176461", "name": "Na Wu"}, {"authorId": "94442609", "name": "Mingsheng Xu"}, {"authorId": "31760068", "name": "Huaying Du"}, {"authorId": "152621402", "name": "Yan Zhao"}, {"authorId": "10277869", "name": "Yonggang Tu"}], "citations": []}
