{"paperId": "cfa13348af064424e37fbcc2189550883cb49cb4", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Area Constrained Optimal Planning Model of Renewable-Rich Hybrid Microgrid", "abstract": "With the intent of reducing carbon emissions, renewable-rich microgrids, in which most of the load is being served by renewable sources, are expanding rapidly to achieve maximum self-sustainability and minimum dependency on the grid. However, the area required to commission such a renewable-rich microgrid is a major constraint, particularly for the long-term planning of microgrids in urban areas, in addition to the criticality of cost and availability. In this connection, this paper presents a framework for optimally planning a renewable-rich hybrid microgrid with area constraints for energy resources. Considering the criticality, the proposed framework includes the formulation for optimization of twin objectives: the cost of the microgrid and the availability of power in the microgrid. The problem is solved using a Multi-objective approach to minimize the cost, maximize availability, and importantly achieve a feasible generation mix subjected to specified area constraints, a first of its kind. Stochastic algorithms based on genetic and swarm techniques are employed to solve the multi-objective optimization problem of planning a renewable-rich hybrid microgrid. From the performance analysis, a superior method is identified which is further applied for expansion planning of the considered hybrid microgrid to meet future requirements with limitations on area constraints while taking advantage of modularity associated with renewable sources, a first of its kind. To handle the uncertainties associated with such renewable-rich microgrids, uncertainty analyses are carried out by constructing the utility function and validated using Monte Carlo simulations to rationalize decision-making on system design. It is to note that the results from the proposed method of microgrid planning are found to be effective over the known normal distribution of the considered uncertainty as well. The modeling, decision-making, and uncertainty analyses, are carried out with the help of MATLAB environment.", "venue": "IEEE Access", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "70873-70883", "volume": "11"}, "authors": [{"authorId": "2223944240", "name": "Vijay Naga Mohan Krishna P"}, {"authorId": "2076706190", "name": "P. C. Sekhar"}], "citations": []}
