{"paperId": "cfc14fba96834b03bb4d169240039f340b0d8935", "publicationVenue": {"id": "0f1e902e-a969-4a5d-b316-f66ac2bb560c", "name": "International Workshop on Data Management on New Hardware", "type": "conference", "alternate_names": ["Int Workshop Data Manag New Hardw", "Data Manag New Hardw", "DaMoN", "Data Management on New Hardware"], "url": "http://www.wikicfp.com/cfp/program?id=640"}, "title": "An Energy-Efficient Stream Join for the Internet of Things", "abstract": "The Internet of Things (IoT) combines large data centers with (mobile, networked) edge devices that are constrained both in compute power and energy budget. Modern edge devices contribute to query processing by leveraging accelerated processing units with multicore CPUs or GPUs. Therefore, data processing in the IoT presents the challenges of 1) minimizing the energy consumed while sustaining a given query throughput, and 2) processing increasingly complex queries within a given energy budget. In this paper, we investigate how modern edge devices can reduce the energy requirements of stream joins as a common data processing operation. We explore three dimensions to save energy: workload characteristics, computational efficiency, and heterogeneous hardware. Based on our findings, we propose the ecoJoin that 1) reduces energy consumption by 81% at a given join throughput, and 2) enables scaling the throughput by two orders-of-magnitude within a given energy budget.", "venue": "International Workshop on Data Management on New Hardware", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2021-06-20", "journal": {"name": "Proceedings of the 17th International Workshop on Data Management on New Hardware"}, "authors": [{"authorId": "40372237", "name": "Adrian Michalke"}, {"authorId": "144810838", "name": "P. M. Grulich"}, {"authorId": "92744560", "name": "Clemens Lutz"}, {"authorId": "2360768", "name": "Steffen Zeuch"}, {"authorId": "1733290", "name": "V. Markl"}], "citations": [{"paperId": "b6404e9d00f5ffe11fc04b7e0833b3ebb640c68f", "title": "PECJ: Stream Window Join on Disorder Data Streams with Proactive Error Compensation"}, {"paperId": "eaf8c987601fb61332657358ab44b9c7c8ea4f5c", "title": "Quantum-Inspired Digital Annealing for Join Ordering"}, {"paperId": "2aca944f3ae4a6644456819caea4b8fba36edbe2", "title": "Out-of-Order Sliding-Window Aggregation with Efficient Bulk Evictions and Insertions"}, {"paperId": "9aa34bad7d5a7de536aa1b8652112e53b7ddf005", "title": "Exploiting Access Pattern Characteristics for Join Reordering"}, {"paperId": "8f27d56d3d100a8f464ff77e6d9a8da67ce79465", "title": "Energy-Efficient Database Systems: A Systematic Survey"}, {"paperId": "b6faa858b8ec91e52b21ff81c72ef60f1aacab64", "title": "Triton Join: Efficiently Scaling to a Large Join State on GPUs with Fast Interconnects"}, {"paperId": "d67554d357f49a244f5b51b44528b7f2a23884a7", "title": "Algorithms for Windowed Aggregations and Joins on Distributed Stream Processing Systems"}, {"paperId": "d99e8ee4c7936233c2d804c4ed0016d288c10b5a", "title": "NebulaStream: Data Management for the Internet of Things"}, {"paperId": "ed8b176d882b6452c6ebc66b444868b560bd5793", "title": "Benchmarking Stream Join Algorithms on GPUs: A Framework and its Application to the State-of-the-art"}]}
