{"paperId": "cfc973d2ad950c4b2d5fa6a40c3e1a01b222f5a2", "publicationVenue": {"id": "8ce575db-79d9-4601-83df-e1e96f6b4e3b", "name": "The international journal of high performance computing applications", "type": "journal", "alternate_names": ["int j high perform comput appl", "International Journal of High Performance Computing Applications", "Int J High Perform Comput Appl"], "issn": "1094-3420", "url": "http://www.sagepub.com/journals/Journal201339/title", "alternate_urls": ["https://journals.sagepub.com/home/hpc"]}, "title": "Development of NCL equivalent serial and parallel python routines for meteorological data analysis", "abstract": "The NCAR Command Language (NCL) is a popular scripting language used in the geoscience community for weather data analysis and visualization. Hundreds of years of data are analyzed daily using NCL to make accurate weather predictions. However, due to its sequential nature of execution, it cannot properly utilize the parallel processing power provided by High-Performance Computing systems (HPCs). Until now very few techniques have been developed to make use of the multi-core functionality of modern HPC systems on these functions. In the recent trend, open-source languages are becoming highly popular because they support major functionalities required for data analysis and parallel computing. Hence, developers of NCL have decided to adopt Python as the future scripting language for analysis and visualization and to enable the geosciences community to play an active role in its development and support. This study focuses on developing some of the widely used NCL routines in Python. To deal with the analysis of large datasets, parallel versions of these routines are developed to work within a single node and make use of multi-core CPUs to achieve parallelism. Results show high accuracy between NCL and Python outputs and the parallel versions provided good scaling compared to their sequential counterparts.", "venue": "The international journal of high performance computing applications", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-03-22", "journal": {"name": "The International Journal of High Performance Computing Applications", "pages": "337 - 355", "volume": "36"}, "authors": [{"authorId": "1573086719", "name": "Jatin Gharat"}, {"authorId": "2035911018", "name": "B. Kumar"}, {"authorId": "145230907", "name": "L. Ragha"}, {"authorId": "2016748553", "name": "Amit Barve"}, {"authorId": "2159799441", "name": "Shaik Mohammad Jeelani"}, {"authorId": "1773970", "name": "J. Clyne"}], "citations": [{"paperId": "605194de8f63422cd4de6cf3ab392f82fb72a523", "title": "Prototyping a ROOT-based distributed analysis workflow for HL-LHC: the CMS use case"}, {"paperId": "8e8808966fce454d09eb23212624f5991bba674e", "title": "Leveraging State-of-the-Art Engines for Large-Scale Data Analysis in High Energy Physics"}]}
