{"paperId": "cfccc77d0f1e05faf7c7a36546d0747bc5300630", "publicationVenue": {"id": "b1491550-248b-4e8a-a292-a58c9be99cb1", "name": "Conference on Information Technology for Social Good", "type": "conference", "alternate_names": ["GoodIT", "Conf Inf Technol Soc Good"]}, "title": "Web-based human activity recognition using images and descriptive web pages", "abstract": "Loss of autonomy is a problem that researchers have been trying to solve for the last two decades thanks to technologies that facilitate the prolongation of home care. In order to ensure the well being and security of residents in loss of autonomy, it is necessary to know the needs of the latter. The human activity recognition is a way to know these needs by tracking the actions of residents using recognition algorithms and sensors placed in the home or on the individual. The most efficient human activity recognition algorithms are mainly based on supervised learning, which itself relies on the quality of the learning data collected in the residences. However, data collection is a time-consuming, costly and complex process, especially when we want to create a representative dataset that guarantees the performance and generalization capacity of the model that uses it. In order to provide an alternative to this data collection, this work presents an approach to human activity recognition based on data from the web. We show that exploiting images and text retrieved from the web with the right algorithm allows to obtain good recognition performances with an average accuracy of 0.91 for 5 activities of daily living.", "venue": "Conference on Information Technology for Social Good", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2022-09-07", "journal": {"name": "Proceedings of the 2022 ACM Conference on Information Technology for Social Good"}, "authors": [{"authorId": "65930659", "name": "Charles Cousyn"}, {"authorId": "1691371", "name": "K. Bouchard"}, {"authorId": "1695620", "name": "S. Gaboury"}], "citations": []}
