{"paperId": "cfce1a04fd269182b9879e95a31d8b77772ea22f", "publicationVenue": {"id": "83b61ff8-462d-4e1d-b43b-5d96fcc87766", "name": "IEEE Transactions on Network Science and Engineering", "type": "journal", "alternate_names": ["IEEE Trans Netw Sci Eng"], "issn": "2327-4697", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=6488902"}, "title": "Privacy Protection of Medical Data Based on Multi-Scroll Memristive Hopfield Neural Network", "abstract": "Memristive Hopfield neural network (MHNN) has complex dynamic behavior, which is suitable for encryption applications. In order to ensure the information security of the medical data transmitted in Internet of Things (IoT), we propose three new MHNN models by using a non-ideal flux-controlled memristor model with multi-piecewise nonlinearity. In these models, there are complex dynamical behaviors such as coexisting attractors, multi-scroll attractors and grid multi-scroll attractors. In terms of hardware, the proposed model is implemented using field programmable gate array (FPGA). In addition, we provide a complete set of medical data sharing solution, which are helpful for the referral patients to receive timely medical treatment. The whole solution is successfully verified on Raspberry Pi, the encrypted Computed Tomography (CT) image is transmitted safely under Message Queuing Telemetry Transport (MQTT) protocol, and the CT image is subjected to basic security analysis. The results show that the ciphertext histogram is evenly distributed, the correlation between adjacent pixels is almost 0, the information entropy reaches 7.9977, and the values of number of pixels change rate (NPCR) and unified average change intensity (UACI) are 99.6078% and 33.4875%. The solution not only performs the exchange of medical data, but also protects the privacy of patients.", "venue": "IEEE Transactions on Network Science and Engineering", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-03-01", "journal": {"name": "IEEE Transactions on Network Science and Engineering", "pages": "845-858", "volume": "10"}, "authors": [{"authorId": "2155386111", "name": "Fei Yu"}, {"authorId": "2110827972", "name": "Hui Shen"}, {"authorId": "2142555980", "name": "Q. Yu"}, {"authorId": "2152013673", "name": "Xinxin Kong"}, {"authorId": "9198774", "name": "P. Sharma"}, {"authorId": "3286418", "name": "Shuo Cai"}], "citations": [{"paperId": "50e6a77270459903dd9e1698b11abd9fb60cd77b", "title": "Bifurcations to bursting oscillations in memristor-based FitzHugh-Nagumo circuit"}, {"paperId": "d27749a555ee2c8a1e5dbf4b97d19cacb612493b", "title": "Dynamical investigation and encryption application of a new multiscroll memristive chaotic system with rich offset boosting features"}, {"paperId": "891e92bcfbf6c2af0d0aef2c06dafa396165b895", "title": "Memristor-Based Conditioned Inhibition Neural Network Circuit With Blocking Generalization and Differentiation"}, {"paperId": "79a6ffe61977dad07c9cc7c66072c7ee96e5549a", "title": "Scroll-Growth and Scroll-Control Attractors in Memristive Bi-Neuron Hopfield Neural Network"}, {"paperId": "63360e8f80c4732c0b7d203e3bd3ed738bddd48a", "title": "Editorial: Advances in nonlinear systems and networks, volume II"}, {"paperId": "98c5b6fe56fe1cd4ef3187ba0cb5f5c710a6259f", "title": "Exploiting Flexible and Secure Cryptographic Technique for Multidimensional Image Based on Graph Data Structure and Three-Input Majority Gate"}, {"paperId": "82b812c6bd2526d77b5b2e903158075d224ca908", "title": "Assessing sigmoidal function on memristive maps"}, {"paperId": "a7339cd86d06f06d48cfd04838328b984e0d8f6f", "title": "Image Encryption Algorithms: A Survey of Design and Evaluation Metrics"}, {"paperId": "680dbeea3aa6a19e2b3cbeed0ff223963a3cc94a", "title": "Dynamics analysis, synchronization and FPGA implementation of multiscroll Hopfield neural networks with non-polynomial memristor"}, {"paperId": "bfeeb5bbb654de818614fd73e3a11234ef3787b3", "title": "A discrete Chialvo–Rulkov neuron network coupled with a novel memristor model: Design, Dynamical analysis, DSP implementation and its application"}, {"paperId": "0b80a5e2b35e395de7cacff6ec8ab99ae665892c", "title": "Generating multi-scroll chaotic attractor in a three-dimensional memristive neuron model"}, {"paperId": "6cb4cfb868676aecd34f8e4773f569a3951e8ce1", "title": "Memristor-cascaded hopfield neural network with attractor scroll growth and STM32 hardware experiment"}, {"paperId": "be296f37ef5a0ec8f4d98e0c66c0749ee83fbeff", "title": "Adjusting Dynamics of Hopfield Neural Network via Time-variant Stimulus"}, {"paperId": "beece51111fe9d84f848008d8b1f404c0a6a2c60", "title": "Analysis of memristive maps with asymmetry"}, {"paperId": "111aceb2305c2ee25cf7a86ac07d4814d359a6bd", "title": "Memristive Hopfield neural network dynamics with heterogeneous activation functions and its application"}, {"paperId": "f81db4a3a9505f982db1c83df1178264b4412a80", "title": "Dynamic analysis and FPGA implementation of a 5D multi-wing fractional-order memristive chaotic system with hidden attractors"}, {"paperId": "cde24090d87851c1bc5bdab81a336d1a19667cf1", "title": "Hyperchaos of neuron under local active discrete memristor simulating electromagnetic radiation."}, {"paperId": "f41496eb877ae49716e649146d227ffbf949027b", "title": "Dual blockchain-based data sharing mechanism with privacy protection for medical internet of things"}, {"paperId": "45f32e51938cbdd8ef84fd7985ccd2c5c0386c32", "title": "Memristor-induced hyperchaos, multiscroll and extreme multistability in fractional-order HNN: Image encryption and FPGA implementation."}, {"paperId": "b3bd9fefc9fec9ac9e5f5b8faecd84b65869240d", "title": "A Triple-Memristor Hopfield Neural Network With Space Multistructure Attractors and Space Initial-Offset Behaviors"}, {"paperId": "05ec4be7a3ec9dc2714f23f7921b31e3fece6c98", "title": "Dynamic Analysis and FPGA Implementation of a New Fractional-Order Hopfield Neural Network System under Electromagnetic Radiation"}, {"paperId": "c21ff4feacfea1142ef0e6059e4bbc9d19c88baa", "title": "Chaotic color multi-image compression-encryption/ LSB data type steganography scheme for NFT transaction security"}, {"paperId": "972a85d835795e4e2346c25a4835bdf538ec1ed4", "title": "High-dimensional memristive neural network and its application in commercial data encryption communication"}, {"paperId": "16ecd7cdcbbac55191b1528cbe00eacef0838e30", "title": "Multi-scroll and coexisting attractors in a Hopfield neural network under electromagnetic induction and external stimuli"}, {"paperId": "2e273629aed6fed017ae3d0959ece314883e4f10", "title": "New image encryption algorithm based on hyperchaotic 3D-IHAL and a hybrid cryptosystem"}, {"paperId": "0226ed267308d92cec618ec7a96ca03cf6b9d986", "title": "A novel grid multi-structure chaotic attractor and its application in medical image encryption"}, {"paperId": "e52a6626e1c57bea4a3f5c234b27fb86f8f4edb2", "title": "Firing activity in a simplified Hodgkin–Huxley circuit with memristive sodium and potassium ion channels"}, {"paperId": "1fd6a77d9f90c0f4ac52d1e720146fdfa3af6e7b", "title": "Star Memristive Neural Network: Dynamics Analysis, Circuit Implementation, and Application in a Color Cryptosystem"}, {"paperId": "faf8e2bc0cd3d33ca3c6fb80fc44d8832fa2cb1e", "title": "Multi-scroll Hopfield neural network under electromagnetic radiation and its brain-like coupling synchronization"}, {"paperId": "cdd1b1df68fe7aa24b81f8dcc170336981f89025", "title": "Hidden dynamics of memristor-coupled neurons with multi-stability and multi-transient hyperchaotic behavior"}, {"paperId": "5887b9c34484d7af2686efdd5deeb04ec6be53ca", "title": "Memristor based Multi-vortex Neural Network Chaotic System"}, {"paperId": "f390de9bcdf4d9646d0d789086b8fd917e071b1d", "title": "Analog/digital circuit simplification for Hopfield neural network"}, {"paperId": "e025f20564a3dd3fd8eb3c2f869c126d6059b28e", "title": "Multi-scroll attractor and its broken coexisting attractors in cyclic memristive neural network."}, {"paperId": "7af4cde3fcac7ebb37e048dd1b4a1ee14f8b3279", "title": "Optimization of Witness Selection for Ensuring the Integrity of Data in a Blockchain-Assisted Health-IoT System"}, {"paperId": "bd6c031619dfb36839aff9b30ca61efde3a2d811", "title": "Designing a 1D extended logistic map for a secure image encryption"}, {"paperId": "968220e1a86bd604391cc1cde1afc0a48e6c4073", "title": "Firing pattern in a memristive Hodgkin–Huxley circuit: Numerical simulation and analog circuit validation"}, {"paperId": "1973af7514ae31dfdcab22f8581128cfa1803e29", "title": "Analog In-memory Circuit Design of Polynomial Multiplication for Lattice Cipher Acceleration Application"}, {"paperId": "f45c89cf4d0d9e25f1dd28aaa0828ad61b63b21f", "title": "Current mode multi scroll chaotic oscillator based on CDTA"}, {"paperId": "4e003aacd20cc848d81be9277ad5f6b859b6e64a", "title": "Robust and fast representation learning for heterogeneous information networks"}, {"paperId": "e53bd6e5f7bb38c86fad09a707f1f2073679dd1c", "title": "Event-triggered control for robust exponential synchronization of inertial memristive neural networks under parameter disturbance"}, {"paperId": "5702524f339bfc89679357d442f1acb769b87b1a", "title": "A K-SVD Based Compressive Sensing Method for Visual Chaotic Image Encryption"}, {"paperId": "d0b999ce24192c3a78dcf31fab6fc1a6c8adb805", "title": "An image encryption algorithm based on a 3D chaotic Hopfield neural network and random row–column permutation"}, {"paperId": "5bd99c997148f0bb8d93a4f105c0290c3d8ea259", "title": "Editorial: Advances in non-linear systems and networks"}, {"paperId": "e496b52c403116a990767c6760626db7d10229e5", "title": "A Review of Chaotic Systems Based on Memristive Hopfield Neural Networks"}, {"paperId": "cbe9b9d30907fbfec5b29eac88579f8c835bfa32", "title": "Building Fixed Point-Free Maps with Memristor"}, {"paperId": "b7c3536316da5be25495fdec4a78fc6dc8b0141b", "title": "Hidden firing patterns and memristor initial condition-offset boosting behavior in a memristive Hindmarsh-Rose neuron model"}, {"paperId": "99a33afd5015337504a7b46d7f5b9086a3d69043", "title": "A cross-channel color image encryption algorithm using two-dimensional hyperchaotic map"}, {"paperId": "94d8609b107d5ec9c405d1326aef9a4520edca33", "title": "AC power analysis for second-order memory elements"}, {"paperId": "30f03a239fb729c7c148239f0bb76c6647b8b23c", "title": "A novel zeroing neural network for dynamic sylvester equation solving and robot trajectory tracking"}, {"paperId": "fec2b7fa439a6fac85dc6ac8941272bb2b8826c2", "title": "A new adaptive iterative learning control of finite-time hybrid function projective synchronization for unknown time-varying chaotic systems"}, {"paperId": "7181b469849b820ae6af6bf121f3ec66e8f22db1", "title": "A new effective metric for dynamical robustness of directed networks"}, {"paperId": "e3303c9b0153e6e958d961b75bd620b86dd84b53", "title": "Multistability and Phase Synchronization of Rulkov Neurons Coupled with a Locally Active Discrete Memristor"}, {"paperId": "4bda5e4ea05569b1f16dc313dba82acb0353e10e", "title": "Dynamics analysis, FPGA realization and image encryption application of a 5D memristive exponential hyperchaotic system"}, {"paperId": "fcd92bdffeac92b47aa22223ab0359f084139fd9", "title": "Building discrete maps with memristor and multiple nonlinear terms"}, {"paperId": "78a1bbb178f7ea76ff352299ebe0d7635ec87368", "title": "Intrusion detection framework based on homomorphic encryption in AMI network"}, {"paperId": "ca9357ef4272de4f6018457aeb7a329407ca89bc", "title": "Adaptive iterative learning control method for finite-time tracking of an aircraft track angle system based on a neural network"}, {"paperId": "dd344910773123b15f1e5504f8ab8bc55f96de43", "title": "Moment-based analysis of pinning synchronization in complex networks with sign inner-coupling configurations"}]}
