{"paperId": "cfd1b5c47aee34173033d7fcc4dda03ab4889e98", "publicationVenue": null, "title": "Difflog: Learning Datalog Programs by Continuous Optimization", "abstract": "An important problem in automated reasoning involves learning logical patterns from structured data. Existing approaches to this task of inductive logic programming either involve solving computationally difficult combinatorial problems or performing parameter estimation in complex statistical relational models. In this paper, we present DIFFLOG, a simple extension of the popular logic programming language Datalog to the continuous domain. By attaching real-valued weights to individual rules, we naturally extend the traditional Boolean semantics of Datalog to additionally associate numerical values with individual conclusions. Rule learning may then be cast as the problem of determining the values of the weights which cause the best agreement between training labels and induced values of output tuples. We propose a novel algorithmic framework to efficiently evaluate DIFFLOG programs with provenance information, which in turn makes it feasible to employ standard numerical optimization techniques such as gradient descent and Newton’s method to the synthesis of logic programs. On a suite of 10 benchmark problems from different domains, DIFFLOG can learn complex programs with recursive rules and relations of arbitrary arity, even with small amounts of noise in the training data.", "venue": "", "year": 2018, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "2780408", "name": "Mukund Raghothaman"}, {"authorId": "2109976122", "name": "Richard Zhang"}], "citations": [{"paperId": "ffaa6eadb65da0d499cd3455b8d6b6dc76c19257", "title": "Beyond graph neural networks with lifted relational neural networks"}, {"paperId": "5dffd4b337a4211110b630ce62374dd06e468ba1", "title": "RMAS Architecture for Autonomic Computing in Cyber-Physical Systems"}, {"paperId": "85ea9a01196de50b3bd541250620ff377b833888", "title": "Research Statement"}]}
