{"paperId": "cfd37f839611ef1e4110f5754d7e8bb155ad8c16", "publicationVenue": null, "title": "Shared I/O Scheduling in Cloud for Structured Data Processing", "abstract": "Cloud plays an important role in the structure data processing because of its high I/O throughput and excellent capability of computing. At present, since the importance of structure data processing has been greater than before, cloud has confront with a higher pressure of data processing requirement. Massive tasks of data query and analysis, which send innumerable data I/O requests, are running on cloud, bringing unprecedented problems on I/O scheduling. In this paper, a kind of shared I/O scheduling method is proposed. Firstly, during the scheduling, the difference of performance among nodes has been considered. A mathematic model of finish time predication is established to estimate the time cost of each node to finish the tasks. And the requests will be finally assigned to the nodes which have lowest time cost. Meanwhile, to further save the I/O resources, a shared I/O mechanism which merges the requests to same table to a shared request has been raised. By using the shared I/O mechanism, the number of the requests can be prominently decreased and the performance of concurrent data queries can also be improved since repetitive read has been avoided. In the end of the paper, we evaluate the performance of the method by several experiments. The results indicate that the shared I/O scheduling method can effectively save the I/O resources and improve the performance of data processing, having wide range of potential applications.", "venue": "2014 IEEE Fourth International Conference on Big Data and Cloud Computing", "year": 2014, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2014-12-03", "journal": {"name": "2014 IEEE Fourth International Conference on Big Data and Cloud Computing", "pages": "159-166"}, "authors": [{"authorId": "48335247", "name": "Baoquan Zhang"}, {"authorId": "8549117", "name": "Jingmei Li"}, {"authorId": "2107740300", "name": "Tao Xu"}, {"authorId": "49370437", "name": "Dongsheng Wang"}, {"authorId": "2066767697", "name": "Nan Ding"}], "citations": [{"paperId": "7a349d363e3d21a7503d6860b3b5a897356e86db", "title": "Mitigate I/O access pattern divergence with heterogeneous architecture in HDFS"}]}
