{"paperId": "cfd55aeec363d9e0c29b127aa8c0fc8bfbb24085", "publicationVenue": null, "title": "Sibyl: Forecasting Time-Evolving Query Workloads", "abstract": "Database systems often rely on historical query traces to perform workload-based performance tuning. However, real production workloads are time-evolving, making historical queries ineffective for optimizing future workloads. To address this challenge, we propose SIBYL, an end-to-end machine learning-based framework that accurately forecasts a sequence of future queries, with the entire query statements, in various prediction windows. Drawing insights from real-workloads, we propose template-based featurization techniques and develop a stacked-LSTM with an encoder-decoder architecture for accurate forecasting of query workloads. We also develop techniques to improve forecasting accuracy over large prediction windows and achieve high scalability over large workloads with high variability in arrival rates of queries. Finally, we propose techniques to handle workload drifts. Our evaluation on four real workloads demonstrates that SIBYL can forecast workloads with an 87.3% median F1 score, and can result in 1.7× and 1.3× performance improvement when applied to materialized view selection and index selection applications, respectively.", "venue": "Proceedings of the ACM on Management of Data", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-01-08", "journal": {"name": "ArXiv", "volume": "abs/2401.03723"}, "authors": [{"authorId": "51293533", "name": "Hanxian Huang"}, {"authorId": "5295950", "name": "Tarique Siddiqui"}, {"authorId": "2273940323", "name": "Rana Alotaibi"}, {"authorId": "2278429940", "name": "Carlo Curino"}, {"authorId": "50334798", "name": "Jyoti Leeka"}, {"authorId": "2153832", "name": "Alekh Jindal"}, {"authorId": "2278568030", "name": "Jishen Zhao"}, {"authorId": "1401945543", "name": "Jesús Camacho-Rodríguez"}, {"authorId": "2274824557", "name": "Yuanyuan Tian"}], "citations": []}
