{"paperId": "cfddda56175b58e407b3f3635664c2f9b9529c01", "publicationVenue": {"id": "969f39c1-0d68-4ada-a88b-a685d4164873", "name": "International Journal of Geographical Information Science", "type": "journal", "alternate_names": ["Int J Geogr Inf Sci"], "issn": "1365-8816", "alternate_issns": ["1365-8824"], "url": "http://www.tandfonline.com/action/aboutThisJournal?journalCode=tgis20"}, "title": "SPSLiDAR: towards a multi-purpose repository for large scale LiDAR datasets", "abstract": "Abstract The widespread use of LiDAR technology in a multitude of domains has produced a growing availability of massive high-resolution point datasets that demand new approaches for efficient organization and storage, filtering using different spatio-temporal criteria, selective/progressive visualization, processing and analysis, and collaborative editing. Ideally, LiDAR data coming from multiple sources and organized in different datasets should be accessible in a simple, uniform, and ubiquitous way to comply with the FAIR principle proposed by the Open Geospatial Consortium: Findable, Accessible, Interoperable, and Reusable. With this goal in mind, we present SPSLiDAR, a conceptual model with a simple interface for repositories of LiDAR data that can be adapted to the needs of different applications. SPSLiDAR includes aspects, such as the arrangement of related datasets into workspaces on a world scale, support for overlapping datasets with different resolutions or acquired at different times, and hierarchical organization of point data, enabling levels of detail and selective download. We also describe in detail an implementation of this model aimed at visualization and downloading of large datasets using the MongoDB database. Finally, we show some experimental results of this implementation using real data, such as its space requirements, upload latency, access latency, and throughput.", "venue": "International Journal of Geographical Information Science", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-03-03", "journal": {"name": "International Journal of Geographical Information Science", "pages": "992 - 1011", "volume": "36"}, "authors": [{"authorId": "1769981", "name": "Antonio J. Rueda Ruiz"}, {"authorId": "3161046", "name": "C. Ogáyar"}, {"authorId": "2210028", "name": "R. Segura"}, {"authorId": "2157583449", "name": "Juan A. Béjar-Martos"}, {"authorId": "1412655932", "name": "J. Delgado-García"}], "citations": [{"paperId": "c60488b2a8bae23496b3dc85332db07d6351a22c", "title": "Big Data Architectures for FAIR-compliant Repositories: A Systematic Review"}, {"paperId": "b110f320c84053fddb280d67b5664da48c4167e8", "title": "Improving NoSQL Spatial-Query Processing with Server-Side In-Memory R*-Tree Indexes for Spatial Vector Data"}, {"paperId": "693e79ec2098bb55e0cac7db9ae4159d32aded3c", "title": "Strategies for the Storage of Large LiDAR Datasets - A Performance Comparison"}]}
