{"paperId": "cfe67cae58393210279b095ddbedf1b5099e9a56", "publicationVenue": null, "title": "This paper is included in the Proceedings of the 2022 USENIX Annual Technical Conference.", "abstract": "Modern retrospective analytics systems leverage cascade architecture to mitigate bottleneck for computing deep neural networks (DNNs). However, the existing cascades suffer from two limitations: (1) decoding bottleneck is either neglected or circumvented, paying significant compute and storage cost for pre-processing; and (2) the systems are specialized for temporal queries and lack spatial query support. This paper presents CoVA , a novel cascade architecture that splits the cascade computation between compressed domain and pixel domain to address the decoding bottleneck, supporting both temporal and spatial queries. CoVA cascades analysis into three major stages where the first two stages are performed in compressed domain, while the last one in pixel domain. First, CoVA detects occurrences of moving objects (called blobs ) over a set of compressed frames (called tracks ). Then, using the track results, CoVA prudently selects a minimal set of frames to obtain the label information and only decode them to compute the full DNNs, alleviating the decoding bottleneck. Lastly, CoVA associates tracks with labels to produce the final analysis results on which users can process both temporal and spatial queries. Our experiments demonstrate that CoVA offers 4.8 × throughput improvement over modern cascade systems, while imposing modest accuracy loss.", "venue": "", "year": null, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "2286754612", "name": "Jinwoo Hwang"}, {"authorId": "2286618082", "name": "Kaist Minsu Kim"}, {"authorId": "2286679512", "name": "Daeun Kim"}, {"authorId": "2286564388", "name": "Kaist Seungho"}, {"authorId": "2286733947", "name": "Yoonsung Kim"}, {"authorId": "2181096151", "name": "Dohee Kim"}, {"authorId": "2286560619", "name": "Kaist Hardik"}, {"authorId": "2286399413", "name": "Sharma"}, {"authorId": "2286817044", "name": "Jongse Park"}], "citations": [{"paperId": "ff06fdd79e5d930f1164f75e5943d8f46981d076", "title": "Concerto: Client-server Orchestration for Real-Time Video Analytics"}, {"paperId": "47bd2313e8362329e9634ff6cb8f02fa3fe2cd2c", "title": "PacketGame: Multi-Stream Packet Gating for Concurrent Video Inference at Scale"}, {"paperId": "d202d2936b7495b1c493d94a744f3f4653f6f447", "title": "Edge Video Analytics: A Survey on Applications, Systems and Enabling Techniques"}, {"paperId": "85106fc0a68a575166f0f18456fa755b7a2660a3", "title": "Deep Learning-Driven Edge Video Analytics: A Survey"}]}
