{"paperId": "cff0f7e23f4015c404de2f80d85f4776fbf6ac55", "publicationVenue": {"id": "544cddb9-1149-469a-8377-d8c34f08d8b1", "name": "IEEE Transactions on Emerging Topics in Computational Intelligence", "alternate_names": ["IEEE Trans Emerg Top Comput Intell"], "issn": "2471-285X", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=7433297", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=7433297"]}, "title": "Mutually Adaptable Learning", "abstract": "In real-world applications that involve complex data dependencies, it would be essential to proceed with machine learning tasks in an adaptable manner. This article presents a novel Mutually Adaptable Learning (MAL) approach that allows for, on the one hand, extracting the most crucial information from data, and on the other hand, maximally utilizing it through model learning, in a mutually adaptable manner. We elaborate our MAL approach by explaining how it determines the necessity for the adaptation of both features and the learning model, integratively adapts between feature selection and model learning, and optimally achieves the learning objective. To systematically validate the effectiveness of MAL, we conduct comprehensive experiments on challenging learning tasks from two representative domains: spatiotemporal prediction and chaotic behavioral prediction, where the complex data dependencies are general encountered. Results demonstrate that MAL outperforms existing learning methods. Moreover, we show that the formulated objective can be attained under an information-theoretic guarantee. With both empirical and theoretical supports, MAL offers an effective solution to the problem of feature and model adaptation to achieve desired learning objective for given complex tasks.", "venue": "IEEE Transactions on Emerging Topics in Computational Intelligence", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-02-01", "journal": {"name": "IEEE Transactions on Emerging Topics in Computational Intelligence", "pages": "240-254", "volume": "8"}, "authors": [{"authorId": "2057197639", "name": "Qi Tan"}, {"authorId": "46399556", "name": "Yang Liu"}, {"authorId": "35761977", "name": "Jiming Liu"}], "citations": []}
