{"paperId": "d007ace08d15857aacdceaa133b351e37d598e70", "publicationVenue": {"id": "905b3424-76e3-40e2-b224-a4fae9d394ad", "name": "International Journal of Organizational and Collective Intelligence", "type": "journal", "alternate_names": ["Int J Organ Collect Intell"], "issn": "1947-9344", "url": "http://www.igi-global.com/Bookstore/TitleDetails.aspx?TitleId=1140", "alternate_urls": ["https://www.igi-global.com/journal/international-journal-organizational-collective-intelligence/1140", "http://www.igi-global.com/IJOCI"]}, "title": "Data Lake Architecture: A New Repository for Data Engineer", "abstract": "Data is the biggest asset after people for businesses, and it is a new driver of the world economy. The volume of data that enterprises gather every day is growing rapidly. This kind of rapid growth of data in terms of volume, variety, and velocity is known as Big Data. Big Data is a challenge for enterprises, and the biggest challenge is how to store Big Data. In the past and some organizations currently, data warehouses are used to store Big Data. Enterprise data warehouses work on the concept of schema-on-write but Big Data analytics want data storage which works on the schema-on-read concept. To fulfill market demand, researchers are working on a new data repository system for Big Data storage known as a data lake. The data lake is defined as a data landing area for raw data from many sources. There is some confusion and questions which must be answered about data lakes. The objective of this article is to reduce the confusion and address some question about data lakes with the help of architecture.", "venue": "International Journal of Organizational and Collective Intelligence", "year": 2020, "fieldsOfStudy": ["Computer Science", "Engineering"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "Int. J. Organ. Collect. Intell.", "pages": "63-75", "volume": "10"}, "authors": [{"authorId": "46344087", "name": "Arvind Panwar"}, {"authorId": "11818663", "name": "Vishal Bhatnagar"}], "citations": [{"paperId": "a5e2b9023f0920a3afdb238539bb320485c3726f", "title": "Construction and Application of a Big Data System for Regional Lakes in Coalbed Methane Development"}, {"paperId": "8796412ad34fe4e6739690d59b8b34cc52b326f4", "title": "Big Data Technology Architecture Proposal for Smart Agriculture for Moroccan Fish Farming"}, {"paperId": "e273124d29e8f0b1332c90d87999411a8d28c12e", "title": "Data Lake Architecture"}, {"paperId": "bff74f0ecd002bbef6bf50a86de3ffd28f04199a", "title": "Data Lake Versus Data Warehouse Architecture: A Comparative Study"}, {"paperId": "6568bcf5f3c771ef581ee7db32b1210b68e37675", "title": "Moroccan Data Lake Healthcare Analytics for Covid-19"}, {"paperId": "5b1e5d3f70746aebf329b723b22f35d28b297524", "title": "Scrutinize the Idea of Hadoop-Based Data Lake for Big Data Storage"}, {"paperId": "6d3f137fe1f4fa5370ebd6ae321cb537fda6a7dc", "title": "Lake Data Warehouse Architecture for Big Data Solutions"}]}
