{"paperId": "d00da6025eee23217c87250a5d6df6df660294b9", "publicationVenue": {"id": "c48a4ead-5245-4573-85f4-a81b45bb39fd", "name": "IEEE Military Communications Conference", "type": "conference", "alternate_names": ["MILCOM", "Mil Commun Conf", "IEEE Mil Commun Conf", "Military Communications Conference"], "url": "http://www.milcom.org/"}, "title": "TISIN: Traceable Information Sharing in Intermittent Networks", "abstract": "Data traceability, or the recording and tracking of data transferring within distributed networks, is vital for enhancing performance, security, and data quality, and facilitating better-informed decision-making processes. It is especially crucial in unstable networks such as battlefields with ad-hoc networks, underwater-air communications, air-ground communications, and other hostile environments. Achieving traceability in such networks is more challenging compared to conventional networks, which is exacerbated in scenarios involving malicious adversaries (e.g., military). We identify such challenges of achieving traceability in data sharing under the delay tolerant network (DTN) with an uncertain nature, which leads to the infeasibility of existing solutions that are interactive or with reliable network assumptions. In this paper, we propose a novel traceability mechanism, specifically designed to tackle the unique challenges posed by DTNs. We introduce an effective and DTN-compatible logging protocol to enable traceability, avoiding the interactivity inherent in traditional tracing mechanisms. Our protocol employs a Probabilistic Provenance Graph (PPG) to assess uncertainty in data-sharing events, offering a robust solution for traceability in DTNs. Extensive simulations with varying parameters show that our mechanism significantly improves the accuracy with reasonable overhead, quantified by the similarity between the provenance captured by TISIN and the ground truth provenance, under a wide range of network settings.", "venue": "IEEE Military Communications Conference", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-10-30", "journal": {"name": "MILCOM 2023 - 2023 IEEE Military Communications Conference (MILCOM)", "pages": "876-881"}, "authors": [{"authorId": "2116724681", "name": "Wenyi Tang"}, {"authorId": "2276470441", "name": "Taeho Jung"}, {"authorId": "2951100", "name": "E. Ratazzi"}], "citations": []}
