{"paperId": "d00ec1e3de4b10b0814addcb14ce1527cc36b973", "publicationVenue": {"id": "d0bfb97a-a20e-4896-9afe-1e63e459db20", "name": "Smart Cities", "alternate_names": ["Smart City"], "issn": "2624-6511", "alternate_issns": ["2731-3409"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-1343723", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-1343723", "https://www.mdpi.com/journal/smartcities"]}, "title": "Smart Cities and Big Data Analytics: A Data-Driven Decision-Making Use Case", "abstract": "Interest in smart cities (SCs) and big data analytics (BDA) has increased in recent years, revealing the bond between the two fields. An SC is characterized as a complex system of systems involving various stakeholders, from planners to citizens. Within the context of SCs, BDA offers potential as a data-driven decision-making enabler. Although there are abundant articles in the literature addressing BDA as a decision-making enabler in SCs, mainstream research addressing BDA and SCs focuses on either the technical aspects or smartening specific SC domains. A small fraction of these articles addresses the proposition of developing domain-independent BDA frameworks. This paper aims to answer the following research question: how can BDA be used as a data-driven decision-making enabler in SCs? Answering this requires us to also address the traits of domain-independent BDA frameworks in the SC context and the practical considerations in implementing a BDA framework for SCs’ decision-making. This paper’s main contribution is providing influential design considerations for BDA frameworks based on empirical foundations. These foundations are concluded through a use case of applying a BDA framework in an SC’s healthcare setting. The results reveal the ability of the BDA framework to support data-driven decision making in an SC.", "venue": "Smart Cities", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-02-28", "journal": {"name": "Smart Cities"}, "authors": [{"authorId": "2124208557", "name": "Ahmed M. Shahat Osman"}, {"authorId": "1700038", "name": "Ahmed Elragal"}], "citations": [{"paperId": "3f4072e4166045b6600edb2d1fac3e6bb9b43529", "title": "Integrating Multi-Criteria Decision Models in Smart Urban Planning: A Case Study of Architectural and Urban Design Competitions"}, {"paperId": "4db22a6ed0f57bf7752ba8a094b319853f4fee5d", "title": "Understanding City 4.0: A Triple Bottom Line Approach"}, {"paperId": "4edd00e41550d2ee5fd015c85261be4576739c23", "title": "The Role of Digital Platforms and Big Data Analytics as a Base for Digital Service Innovation"}, {"paperId": "149aa24a89c079b47494df28fd3e42b69c87502c", "title": "Factor Influencing the Adoption of Big Data Analytics: A Systematic Literature and Experts Review"}, {"paperId": "f389a7a1a2aa15d1c44b3f6178b4e805d8dfecd3", "title": "Prospects of Cybersecurity in Smart Cities"}, {"paperId": "232cae3b77637c6485e4370a12e3d6cc011b38ad", "title": "Multi-Difference Image Fusion Change Detection Using a Visual Attention Model on VHR Satellite Data"}, {"paperId": "3e2ebf94e27324d05efb31b012f2fe4d1d219020", "title": "A Cloud-Based Data Storage and Visualization Tool for Smart City IoT: Flood Warning as an Example Application"}, {"paperId": "4643b345bf71926413a43a66b0f3611871664d9a", "title": "Visual Aid Systems from Smart City to Improve the Life of People with Low Vision"}, {"paperId": "a53cae4950f60ff9ded611b5559f43987c90098e", "title": "Characterizing stewardship and stakeholder inclusion in data analytics efforts: the collaborative approach of Kansas City, Missouri"}, {"paperId": "48a900f60dcda73c13e9eac61537552aff8bb5c8", "title": "Setting Requirements for a Dashboard to Inform Portuguese Decision-Makers About Environment Health in an Urban Setting"}, {"paperId": "4cfd8b59ffff2fead284100d51f67b8f81cc26f8", "title": "Compilation of Smart Cities Attributes and Quantitative Identification of Mismatch in Rankings"}, {"paperId": "0afc20a27cda18fe48d13884364c41d44adee0c2", "title": "Design and Implementation of IoT Data-Driven Intelligent Law Classroom Teaching System"}, {"paperId": "b360344653b9c010bdedefb139ac9966fab5afa0", "title": "Construction and Application of a Data-Driven Abstract Extraction Model for English Text"}, {"paperId": "29bb90923eb51e47432e58e3c182166d423ee2a7", "title": "An engineering geological database for managing, planning and protecting intelligent cities: The case of Thessaloniki city in Northern Greece"}, {"paperId": "c5ac65ccfaadf291658d80c10c2a8abc2b03abb2", "title": "Data-Driven Decisions in Smart Cities: A Digital Transformation Case Study"}, {"paperId": "a42e8f6274f22fc77122ff7a32615243a52866c3", "title": "A Study of Big-Data-Driven Data Visualization and Visual Communication Design Patterns"}, {"paperId": "ab68c1873343e00089d171f9fbd3bff39558c179", "title": "Smart City Based on Open Data: A Survey"}, {"paperId": "9ca4fb558026d446e4eb5d3c99fc8f22e005629a", "title": "Balancing Technological Advances with User Needs: User-centered Principles for AI-Driven Smart City Healthcare Monitoring"}, {"paperId": "a6f95cc5218917a69ffb74f17d9f876b5ff9f41e", "title": "Cognitive City Platform as Digital Public Infrastructure for Developing a Smart, Sustainable and Resilient City in Indonesia"}, {"paperId": "ce7cf581cb438ff10634be64276274bc616643f0", "title": "Investigation of Big Data Analytics for Sustainable Smart City Development: An Emerging Country"}, {"paperId": "b066e9f9dd8fc4af6ca4cf3f936b825cd5a1e038", "title": "Cryptospatial blockchain sharia hotel based on practical Byzantine fault tolerance"}]}
