{"paperId": "d0137f41e2388ba5b01c61d31ecedbc2e4a73963", "publicationVenue": {"id": "7c9d091e-015e-4e5d-a11f-9bc369fcf414", "name": "IEEE Transactions on Parallel and Distributed Systems", "type": "journal", "alternate_names": ["IEEE Trans Parallel Distrib Syst"], "issn": "1045-9219", "url": "http://www.computer.org/tpds", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=71"]}, "title": "Hone: Mitigating Stragglers in Distributed Stream Processing With Tuple Scheduling", "abstract": "Low latency stream processing on large clusters consisting of hundreds to thousands of servers is an increasingly important challenge. A crucial barrier to tackling this challenge is stragglers, i.e., tasks that are significantly straggling behind others in processing the stream data. However, prior straggler mitigation solutions have significant limitations. They balance streaming workloads among tasks but may incur imbalanced backlogs when the workloads exhibit variance, causing stragglers as well. Fortunately, we observe that carefully scheduling the outgoing tuples of different tasks can yield benefits for balancing backlogs, and thus avoids stragglers. To this end, we present Hone, a tuple scheduler that aims to minimize the maximum queue backlog of all tasks over time. Hone leverages an online Largest-Backlog-First (LBF) algorithm with a provable good competitive ratio to perform efficient tuple scheduling. We have implemented Hone based on Apache Storm and evaluated it extensively via both simulations and testbed experiments. Our results show that under the same workload balancing strategy–shuffle grouping, Hone outperforms the original Storm significantly, with the end-to-end tuple processing latency reduced by 78.7 percent on average.", "venue": "IEEE Transactions on Parallel and Distributed Systems", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-08-01", "journal": {"name": "IEEE Transactions on Parallel and Distributed Systems", "pages": "2021-2034", "volume": "32"}, "authors": [{"authorId": "104026717", "name": "Wenxin Li"}, {"authorId": "1931641", "name": "Duowen Liu"}, {"authorId": "40611817", "name": "Kai Chen"}, {"authorId": "143668329", "name": "Keqiu Li"}, {"authorId": "2002488", "name": "Heng Qi"}], "citations": [{"paperId": "3c56a86720c3a82e3d31b956692626a288114795", "title": "DPro-SM – A distributed framework for proactive straggler mitigation using LSTM"}, {"paperId": "e04e76133b7d8573111f1a217f7d03e51fcf7f8c", "title": "A two-tier coordinated load balancing strategy over skewed data streams"}, {"paperId": "531b64253e65bc49f029ee9bc77dbf498e074e33", "title": "Joint Dynamic Grouping and Gradient Coding for Time-Critical Distributed Machine Learning in Heterogeneous Edge Networks"}, {"paperId": "0d28bb07b3ad8f26eb510cc4935a641545654e65", "title": "Fair and Efficient Distributed Edge Learning With Hybrid Multipath TCP"}]}
