{"paperId": "d014abb2cb3afacbb51e3e220d39ea9c07c1da12", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Empowering 6G Communication Systems With Digital Twin Technology: A Comprehensive Survey", "abstract": "The global roll-out phase of the fifth-generation of mobile communication systems is currently underway. The industry and academia have already begun research on potential sixth-generation (6G) communication systems. The 6G communication system is anticipated to provide network connectivity for an extensive range of use cases in a variety of emerging vertical industries. Consequently, a new set of challenging requirements and more stringent key performance indicators have to be considered, a novel architecture has to be designed, and unique enabling technologies shall be developed in order to fulfill the technical, regulatory, and business demands of the communication service customers. These requirements place enormous pressure on the players in the telecommunications industry, including network operators, service providers, hardware suppliers, standards development organizations (SDOs), and regulatory authorities aimed at developing, standardizing, and regulating an energy-efficient, cost-effective, performing, and sustainable 6G communication ecosystem. One area of focus for 6G communication systems is the digital twin (DT) technology, which is a well-defined set of tools designed to create virtual representations of physical objects that serve as their digital counterparts. This article explores the applicability of the DT technology in the context of 6G communication systems by viewing it as a promising tool to make research, development, operation, and optimization of the next-generation communication systems highly efficient. The major contribution of this article is fivefold. Firstly, we provide critical analysis of the state-of-the-art literature in the field of DT technology in order to capture its essence in several application areas since its inception. Secondly, we conduct a comprehensive survey of the research concerning the deployment of DT technology in 6G communication systems. Thirdly, we discuss potential use cases and key areas of applications (along with detailed examples) of 6G communication systems that can benefit from DT technology. Fourthly, we present an overview of the activities of several SDOs that are active in the field of DT technology. Finally, we identify several open research challenges and future directions that need to be addressed before the end-to-end deployment of DT technology in 6G communication systems.", "venue": "IEEE Access", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "112158-112186", "volume": "10"}, "authors": [{"authorId": "2235255", "name": "Nandish P. Kuruvatti"}, {"authorId": "46707949", "name": "Mohammad Asif Habibi"}, {"authorId": "113621658", "name": "S. Partani"}, {"authorId": "39058625", "name": "B. Han"}, {"authorId": "41021401", "name": "Amina Fellan"}, {"authorId": "1752672", "name": "H. Schotten"}], "citations": [{"paperId": "f98dac665248bc51851d9821b8e1c5d2518914ad", "title": "Key Technologies for Wireless Network Digital Twin Towards Smart Railways"}, {"paperId": "74a406c304318af18a5ce527c7109fb46df972d7", "title": "A Joint Communication and Computation Framework for Digital Twin over Wireless Networks"}, {"paperId": "93226f6284b799ee8d04e0c470f14a32216ce529", "title": "Intelligent wireless resource management in industrial camera systems: Reinforcement Learning-based AI-extension for efficient network utilization"}, {"paperId": "b8ab8aee35528023c07dd178374a73c82e24fc2a", "title": "Multi-Tier Computing-Enabled Digital Twin in 6G Networks"}, {"paperId": "a581a1e76502db1883692b480fc2c8b32d911db1", "title": "A Secure and Efficient Handover Authentication Based on Digital Twin in 5G-V2X"}, {"paperId": "af424194220e49503f42582a8b6ceaf896c21358", "title": "A Digital Twin Framework for Dynamic Monitoring of Hardware Impairment in RIS-Aided Networks"}, {"paperId": "dae7997fbb12ace794d997d328757cfd1379ba45", "title": "Digital Twin Enriched Green Topology Discovery for Next Generation Core Networks"}, {"paperId": "216d6135c438d2461319bc02c3e7259a3a68bb3a", "title": "Empowering Digital Twin for Future Networks with Graph Neural Networks: Overview, Enabling Technologies, Challenges, and Opportunities"}, {"paperId": "0680c76e55e3ed55aff69efea7fff2746474c47c", "title": "Digital Twins for Next-Generation Mobile Networks: Applications and Solutions"}, {"paperId": "46f004e3d2e0127c2ad9f6534580d19b1060e5fe", "title": "On the Physical Layer of Digital Twin: An Integrated Sensing and Communications Perspective"}, {"paperId": "819317db5ae258fe02edda198b73352443584f2d", "title": "Enabling simulation services for digital twins of 5G/B5G mobile networks"}, {"paperId": "ca8bee963b16d0c5274d1378b822807785c606b6", "title": "Digital Twin Enhanced Federated Reinforcement Learning With Lightweight Knowledge Distillation in Mobile Networks"}, {"paperId": "afaf6b4cbcd8a4d1fe0847c15f8cb0dc83237fd7", "title": "Progressive Digital Twinning of 6G and beyond: Vision, Challenges, and Research Directions"}, {"paperId": "58e8a0926f2c72c2e593f266b492e8497d9a7c2a", "title": "Digital Twin of the Radio Environment: A Novel Approach for Anomaly Detection in Wireless Networks"}, {"paperId": "994f6c4b3fa1a4c306d2ea08c2624f54f1722443", "title": "A Data-Driven Digital Twin Network Architecture in the Industrial Internet of Things (IIoT) Applications"}, {"paperId": "0d36a04c360230a88c6cd1fd0366b0335ff3e1d2", "title": "Network Digital Twins: A Threat Analysis"}, {"paperId": "94b267dc2bffee37c7fd4f554195d70a0e648c91", "title": "Digital Twin Enabled Intelligent Network Orchestration for 6G: A Dual-Layered Approach"}, {"paperId": "4c01b0c07a82d6f67126a853490942332bef0df2", "title": "A Reinforcement Learning Handover Parameter Adaptation Method Based on LSTM-Aided Digital Twin for UDN"}, {"paperId": "bc0b2c5033fdf66b5f48adf715dd333f94f9064d", "title": "A Survey on Digital Twins: Architecture, Enabling Technologies, Security and Privacy, and Future Prospects"}, {"paperId": "d360263566b2b814417544ac138d140935561269", "title": "Digital Twin-Enabled Domain Adaptation for Zero-Touch UAV Networks: Survey and Challenges"}, {"paperId": "99b6fbb91d486f4889ade4a568b7732770fe0022", "title": "Digital Twins for Industry 4.0 in the 6G Era"}, {"paperId": "2c978f1b2c4a955a61fdf8bf187f282ae5a08e3e", "title": "cXR+ Voxel-Based Semantic Compression for Networked Immersion"}, {"paperId": "3059da5b5f98e6b4f430dfe9201a09c1f7931c8f", "title": "Radio Propagation Digital Twin Aided Multi-Point Transmission With In-Network Dynamic On-Off Switching"}]}
