{"paperId": "d037f3df7bcad91c18f394855054abf990f7bb40", "publicationVenue": {"id": "d4610af5-85e0-480b-8773-5c71d92a7b99", "name": "International Conference on Architectural Support for Programming Languages and Operating Systems", "type": "conference", "alternate_names": ["ASPLOS", "Int Conf Archit Support Program Lang Oper Syst", "Archit Support Program Lang Oper Syst", "Architectural Support for Programming Languages and Operating Systems"], "url": "http://www.acm.org/sigplan/"}, "title": "Switches for HIRE: resource scheduling for data center in-network computing", "abstract": "The recent trend towards more programmable switching hardware in data centers opens up new possibilities for distributed applications to leverage in-network computing (INC). Literature so far has largely focused on individual application scenarios of INC, leaving aside the problem of coordinating usage of potentially scarce and heterogeneous switch resources among multiple INC scenarios, applications, and users. The traditional model of resource pools of isolated compute containers does not fit an INC-enabled data center. This paper describes HIRE, a Holistic INC-aware Resource managEr which allows for server-local and INC resources to be coordinated in a unified manner. HIRE introduces a novel flexible resource (meta-)model to address heterogeneity, resource interchangeability, and non-linear resource requirements, and integrates dependencies between resources and locations in a unified cost model, cast as a min-cost max-flow problem. In absence of prior work, we compare HIRE against variants of state-of-the-art schedulers retrofitted to handle INC requests. Experiments with a workload trace of a 4000 machine cluster show that HIRE makes better use of INC resources by serving 8-30% more INC requests, while at the same time reducing network detours by 20%, and reducing tail placement latency by 50%.", "venue": "International Conference on Architectural Support for Programming Languages and Operating Systems", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2021-04-19", "journal": {"name": "Proceedings of the 26th ACM International Conference on Architectural Support for Programming Languages and Operating Systems"}, "authors": [{"authorId": "113179522", "name": "Marcel Blöcher"}, {"authorId": "2144735631", "name": "Lin Wang"}, {"authorId": "1697599", "name": "P. Eugster"}, {"authorId": "2115766184", "name": "Max Schmidt"}], "citations": [{"paperId": "2b69d57d04ae5f528c04d737882c41607e1f6b24", "title": "Identifying Performance Bottleneck in Shared In-Network Aggregation during Distributed Training"}, {"paperId": "02c6926a190df8dbd0d8f7403e0ef8b0f7c59a40", "title": "Diktyo: Network-Aware Scheduling in Container-Based Clouds"}, {"paperId": "1bb01e31c0121feda2f4fbdd170aa9be8bf5d76b", "title": "DINC: Toward Distributed In-Network Computing"}, {"paperId": "4e1d3ea4fec2db6da95519644f702f7cabaadb6c", "title": "Performance Impact of Queue Sorting in Container-Based Application Scheduling"}, {"paperId": "1b15307003022f637beb6cc9e004bf8f9e0c92d5", "title": "OSMOSIS: Enabling Multi-Tenancy in Datacenter SmartNICs"}, {"paperId": "eb20d9c17acf1ee528bc540d1dd11aad2a1c7671", "title": "A Review of the In-Network Computing and Its Role in the Edge-Cloud Continuum"}, {"paperId": "4c9f8390d1db1ad97cd92160f9c523c2a0233868", "title": "CAMEO: A Causal Transfer Learning Approach for Performance Optimization of Configurable Computer Systems"}, {"paperId": "0ba37cbf08c0be57f2aacd4b2924f70655fd327a", "title": "Distributed DNN serving in the network data plane"}, {"paperId": "2cf7973d70364263e1414d7fc78fe8178866538e", "title": "Holistic Resource Scheduling for Data Center In-Network Computing"}, {"paperId": "f70719547a33377ac22cfc106768233c45278eba", "title": "In-network aggregation for data center networks: A survey"}, {"paperId": "745093391442971373d2af7549b00651a4636808", "title": "Deep Learning Workload Scheduling in GPU Datacenters: Taxonomy, Challenges and Vision"}, {"paperId": "17cf344c887e650fd8cd478b0d76085c916c37d1", "title": "Cello: Efficient Computer Systems Optimization with Predictive Early Termination and Censored Regression"}, {"paperId": "c2dd4b8436443c05033317b1a13f82f5e1a18ee5", "title": "Machine Learning for Computer Systems and Networking: A Survey"}, {"paperId": "08de6aedc612e9956ad33ee48481d2ffff1e59f1", "title": "Efficient Data-Plane Memory Scheduling for In-Network Aggregation"}, {"paperId": "734ec4a3d454f63dc19df5666034a7b2d349b6d1", "title": "Don't You Worry 'Bout a Packet: Unified Programming for In-Network Computing"}, {"paperId": "374e461dbbf2ed4f8c2dfdfbb505e2a51a264ed2", "title": "SOAR: minimizing network utilization with bounded in-network computing"}, {"paperId": "ac35dffd21c16b02e140a36726b3a21d266cab0f", "title": "Characterization and Prediction of Deep Learning Workloads in Large-Scale GPU Datacenters"}, {"paperId": "244935a45d2a604837ee5bf73b17e1f86ca2fe21", "title": "Isolation Mechanisms for High-Speed Packet-Processing Pipelines"}, {"paperId": "883b5a6cbbf3c499c8402204a657abf1e836d310", "title": "Deep Learning Workload Scheduling in GPU Datacenters: A Survey"}, {"paperId": "31d3c657987119aaa1e0b8306c0abbe84bf35222", "title": "A Survey on Scheduling Techniques in Computing and Network Convergence"}, {"paperId": "996e1746adbd6c67c0581147b6caddc62a2c9761", "title": "A Survey on In-Network Computing: Programmable Data Plane and Technology Specific Applications"}, {"paperId": "c270f8f8cef47c38061d6bf6a13d148e0a8fcfc3", "title": "This paper is included in the Proceedings of the 19th USENIX Symposium on Networked Systems Design and Implementation."}]}
