{"paperId": "d03bf32184a5157a0b2df88f04f9c3f0862f7aaa", "publicationVenue": null, "title": "To Boldly Prototype What Everyone Has Prototyped Before: The Voyages and Perspectives of Prototyping Novices", "abstract": "Microcontroller chips are commonly used in everyday electronics. Household items as well as industrial machinery and even defensive technologies rely on these Very-large-scale integration integrated circuits (VLSI IC) computing units. For a long time, experts in the fields of electrical engineering, computer science, or similar domains were required to program such units and design the components around them. Even though projects like “Basic Stamp” tried to popularize microcontrollers like the PIC16, making them more accessible for novice users in the early 90s, and several educational kits attempted the same later, it is fair to state that the concept used by the Arduino Prototyping platform enabled a broader range of people with a more diverse professional background to use microcontroller technology for themselves. Artists, hobbyists, but also people from the aforementioned technical fields use the platform for their projects, due to its simplified software and hardware environment, as well as their low entry barrier. However, with advances in electronics and the creativity of groups and individuals, projects and extensions have become more complex, and therefore, the requirements towards the capabilities, as well as the usability of such prototyping platforms have increased. With this position paper, we want to give an insight into the challenges and obstacles novice users of the Arduino platform can encounter by analyzing data from a web-forum and interpreting it by comparing it to our own observations we made as instructors in the field of hardware prototyping, followed by suggestions to an initial set of promising directions for easing the entry level for novice users.", "venue": "", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "2063937200", "name": "Ali Askari"}, {"authorId": "10807398", "name": "Evgeny Stemasov"}], "citations": []}
