{"paperId": "d05c1d3d0176407d2c38f7f740a33af9c429c457", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "A Survey on Proactive Customer Care: Enabling Science and Steps to Realize it", "abstract": "In recent times, advances in artificial intelligence (AI) and IoT have enabled seamless and viable maintenance of appliances in home and building environments. Several studies have shown that AI has the potential to provide personalized customer support which could predict and avoid errors more reliably than ever before. In this paper, we have analyzed the various building blocks needed to enable a successful AI-driven predictive maintenance use-case. Unlike, existing surveys which mostly provide a deep dive into the recent AI algorithms for Predictive Maintenance (PdM), our survey provides the complete view; starting from business impact to recent technology advancements in algorithms as well as systems research and model deployment. Furthermore, we provide exemplar use-cases on predictive maintenance of appliances using publicly available data sets. Our survey can serve as a template needed to design a successful predictive maintenance use-case. Finally, we touch upon existing public data sources and provide a step-wise breakdown of an AI-driven proactive customer care (PCC) use-case, starting from generic anomaly detection to fault prediction and finally root-cause analysis. We highlight how such a step-wise approach can be advantageous for accurate model building and helpful for gaining insights into predictive maintenance of electromechanical appliances.", "venue": "arXiv.org", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-10-11", "journal": {"name": "ArXiv", "volume": "abs/2110.05015"}, "authors": [{"authorId": "1516374614", "name": "Viswanath Ganapathy"}, {"authorId": "3314219", "name": "Sauptik Dhar"}, {"authorId": "1945599", "name": "Olimpiya Saha"}, {"authorId": "103965916", "name": "Pelin Kurt Garberson"}, {"authorId": "2590429", "name": "Javad Heydari"}, {"authorId": "40225085", "name": "Mohak Shah"}], "citations": [{"paperId": "321a5b33eb84152316225f79c5bfd3ae07164601", "title": "ADPal: Automatic Detection of Troubled Users in Online Service Systems via Page Access Logs"}]}
