{"paperId": "d0614367ae0946c8c420e8a8173395ed2d683de8", "publicationVenue": {"id": "764e3630-ddac-4c21-af4b-9d32ffef082e", "name": "IEEE International Conference on Data Engineering", "type": "conference", "alternate_names": ["ICDE", "Int Conf Data Eng", "IEEE Int Conf Data Eng", "International Conference on Data Engineering"], "url": "http://www.wikicfp.com/cfp/program?id=1331"}, "title": "KDDLog:Performance and Scalability in Knowledge Discovery by Declarative Queries with Aggregates", "abstract": "Demand for powerful, high-performance analytics on large Data Bases has been ever growing. Database Management Systems have long shown that descriptive analytics can be supported quite effectively by enriching traditional aggregates with constructs such as Data Cubes and other ROLAPs — thus extending the optimizability and parallelizability of RDBMS. In this paper, we show that these benefits can now be extended to predictive analytics, e.g. clustering, classification and association, by using aggregates in declarative recursive queries. Therefore, we introduce KDDLog, a scalable framework which leverages recursive queries with aggregates and our newly-proposed chain aggregates to enable users to build or customize knowledge discovery models with concise and expressive queries. We further propose specialized compilation techniques for semi-naive fix-point computation in the presence of aggregates, and optimizations for complex recursive queries on distributed data platforms. We provide KDDLib to build knowledge discovery tasks and advanced interfaces to ease users of porting new models. Extensive evaluations on large-scale datasets demonstrate that our approach achieves promising performance gain while offering both increased generality and ease of programming knowledge discovery applications.", "venue": "IEEE International Conference on Data Engineering", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-04-01", "journal": {"name": "2021 IEEE 37th International Conference on Data Engineering (ICDE)", "pages": "1260-1271"}, "authors": [{"authorId": "2024664573", "name": "Youfu Li"}, {"authorId": "2143717242", "name": "Jin Wang"}, {"authorId": "47628976", "name": "Mingda Li"}, {"authorId": "2499545", "name": "Ariyam Das"}, {"authorId": "2150059168", "name": "Jiaqi Gu"}, {"authorId": "1712630", "name": "C. Zaniolo"}], "citations": [{"paperId": "5b01f1caeef7c93cf01f9d4ebc0af5efd8acc96e", "title": "Optimizing Parallel Recursive Datalog Evaluation on Multicore Machines"}, {"paperId": "495fbff8c27e854426264b9f9a1888e3927f22df", "title": "Demonstration of LogicLib: An Expressive Multi-Language Interface over Scalable Datalog System"}, {"paperId": "47410d210b22dfa4d437d24b50dc87ac56b0584f", "title": "Recent Progress in Conversational AI"}, {"paperId": "893ed788c9ca7b160fba2f3001141a0b70a0b479", "title": "Formal semantics and high performance in declarative machine learning using Datalog"}, {"paperId": "5ba1e2d13cc12e8ebc27255bcef292347d639e47", "title": "Developing Big-Data Application as Queries: an Aggregate-Based approach"}]}
