{"paperId": "d07b889ee00f0d094b4d1a1cf429d46fbd7a342c", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Towards Zero-Shot Flow-Based Cyber-Security Anomaly Detection Framework", "abstract": "Network flow-based cyber anomaly detection is a difficult and complex task. Although several approaches to tackling this problem have been suggested, many research topics remain open. One of these concerns the problem of model transferability. There is a limited number of papers which tackle transfer learning in the context of flow-based network anomaly detection, and the proposed approaches are mostly evaluated on outdated datasets. The majority of solutions employ various sophisticated approaches, where different architectures of shallow and deep machine learning are leveraged. Analysis and experimentation show that different solutions achieve remarkable performance in a single domain, but transferring the performance to another domain is tedious and results in serious deterioration in prediction quality. In this paper, an innovative approach is proposed which adapts sketchy data structures to extract generic and universal features and leverages the principles of domain adaptation to improve classification quality in zero- and few-shot scenarios. The proposed approach achieves an F1 score of 0.99 compared to an F1 score of 0.97 achieved by the best-performing related methods.", "venue": "Applied Sciences", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-09-26", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "1844288337", "name": "Mikołaj Komisarek"}, {"authorId": "1678485", "name": "R. Kozik"}, {"authorId": "1700893781", "name": "M. Pawlicki"}, {"authorId": "1749015", "name": "M. Choraś"}], "citations": [{"paperId": "35f00635d728e3ffce49d4aa086f1529c619a78c", "title": "Advancing Fault Detection in Building Automation Systems through Deep Learning"}, {"paperId": "e3f6e32a9e60f0c1250e4c42e512f37f4bf86113", "title": "Strengths And Weaknesses of Deep, Convolutional and Recurrent Neural Networks in Network Intrusion Detection Deployments"}, {"paperId": "dd5d249f201246113cdcddc94b114a776ac9e191", "title": "Ensuring network security with a robust intrusion detection system using ensemble-based machine learning"}, {"paperId": "2aa67159e9566e496b9658ebe79a2cf64932d894", "title": "Erroneous High Occupancy Vehicle Lane Data: Detecting Misconfigured Traffic Sensors With Machine Learning"}, {"paperId": "89a51703e3e3112c999f261ebb73d9cb696c5f57", "title": "Web Based Anomaly Detection Using Zero-Shot Learning With CNN"}]}
