{"paperId": "d0854355c6bf58d859a863dadec8be238b1e88c5", "publicationVenue": null, "title": "Mobile phone data statistics as a dynamic proxy indicator in assessing regional economic activity and human commuting patterns", "abstract": "Various studies demonstrate that data on mobile phone use are useful when analysing problems in the fields of human activity or population dynamics, including tourism, transportation planning, public administration, etc. However, one of the biggest challenges is related to the restrictions contained in the General Data Protection Regulation that force the use of statistics about mobile operator client activities instead of allowing the analysis of mobile operator data. Therefore, a data analytics approach that does not involve information on the mobility of particular persons was developed, providing economically relevant data on aggregate mobility while protecting personal data. The activity data aggregation was conducted at 15‐min intervals in the area of each cellular base station; “activity” is defined as the number of outgoing and incoming calls and sent and received text messages (short message service or SMS) and, in some instances, as the count of unique users. The case study examines all of Latvia's municipalities, analysing the economic activity level in each municipality in comparison to the mobile phone activity in three periods: 2015–2016, 2017, and 2018. It was concluded that the economic activity in municipalities can be estimated, and positive dynamics of regional development have been detected. Such data and the data analytics method, which provides an understanding of how economic activities evolve in real time in particular locations and economic activity centres, can improve regional development planning and plan implementation. In order to assess which are the centres of economic activity in each municipality and its sphere of influence, the patterns of human commuting and fluctuations of internal activity on workdays and weekends/holidays in 2017–2018 were determined. In general, there is a shortage of reliable data on human commuting within Latvia and its specific regions; therefore, the method described here provides a practical tool for regional governments to keep track of strategy implementation and for strategic gap analysis.", "venue": "Expert Syst. J. Knowl. Eng.", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-02-03", "journal": {"name": "Expert Systems", "volume": "37"}, "authors": [{"authorId": "1829300", "name": "I. Arhipova"}, {"authorId": "2929458", "name": "G. Berzins"}, {"authorId": "8118660", "name": "Edgars Brekis"}, {"authorId": "69044293", "name": "Juris Binde"}, {"authorId": "2173715", "name": "Mārtiņš Opmanis"}, {"authorId": "152238700", "name": "Aldis Erglis"}, {"authorId": "1581847014", "name": "Evija Ansonska"}], "citations": [{"paperId": "7987cdb8fb8525be5a383c2245d7a13c09703dc3", "title": "Time Series Forecasting for Regional Development Composite Index Using Real-Time Floating Population Data"}, {"paperId": "ac44c7e272a8f43bf6078dea0fd5e425b854e7e1", "title": "Selection and Optimization of Regional Economic Industrial Structure Based on Fuzzy k-Means Clustering Algorithm"}, {"paperId": "c82f1622199fbaf655078d6a0437a38bd231f9b3", "title": "Effects of Urban Vibrancy on an Urban Eco-Environment: Case Study on Wuhan City"}, {"paperId": "fd92789bac6bc7ee6ade2233272a2c74bcfc1ac8", "title": "Detection of SARS-CoV-2 RNA in wastewater and importance of population size assessment in smaller cities: An exploratory case study from two municipalities in Latvia"}, {"paperId": "72e05ef230850110784e82e4fbb7314873e8e892", "title": "Socio-Economic Situation in Latvia's Municipalities in the Context of Administrative-Territorial Division and Unexpected Impact of COVID-19"}, {"paperId": "ccf6d526edc38e38847e31b999ca9dd43af61bab", "title": "Pendler Mobil: Die Verwendung von Mobilfunkdaten zur Unterstützung der amtlichen Pendlerstatistik"}, {"paperId": "5bca289253b735d9cfb9691803867aa153132399", "title": "Research themes in big data analytics for policymaking: Insights from a mixed‐methods systematic literature review"}, {"paperId": "aaf1129261cd743f3042ccd363c94e1ee32af2bd", "title": "Special issue on “advances in visual analytics and mining visual data”"}, {"paperId": "20b062e40d7261adcf46cdf856f67df154076c79", "title": "Mobile phone data and tourism statistics: a broken promise?"}, {"paperId": "99f3432808e2d4e8d7de0ef76a7d9a3a05e84521", "title": "Population Mobility Patterns and Monitoring of COVID-19 Restriction Measures in Latvia"}]}
