{"paperId": "d086abcfa6e12d542063def2a0b143feae28e38a", "publicationVenue": {"id": "b8e3fb18-a48d-49f0-96bd-38cca7124b0d", "name": "International Conference on Cloud Computing and Intelligence Systems", "type": "conference", "alternate_names": ["CCIS", "Int Conf Cloud Comput Intell Syst"]}, "title": "Predicting Student Achievement Based on Fusion Models", "abstract": "This study aims to utilize machine learning techniques to predict student performance and enhance educational outcomes. Various factors influence student achievement, but many current prediction methods are unsatisfactory. Deep learning methods are less effective due to limited data, and a single model fails to capture the complex relationships that influence performance. To address this issue, the study proposes integrating both models by developing two fusion models, namely Multiple Machine Learning (MML), for predicting student performance. The first model utilizes a multilayer perceptron to automatically extract features, followed by a traditional machine learning model to predict student performance. The second model utilizes XGBoost (Extreme Gradient Boosting) and LightGBM (Light Gradient Boosting Machine) models for performance prediction. Finally, the performance of the proposed methods is validated through experimentation on a dataset. The performance prediction results of the fusion models are compared against those of a single model. The two fusion models offer improved accuracy in predicting student performance, as demonstrated through comparative analysis.", "venue": "International Conference on Cloud Computing and Intelligence Systems", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-08-12", "journal": {"name": "2023 IEEE 9th International Conference on Cloud Computing and Intelligent Systems (CCIS)", "pages": "82-92"}, "authors": [{"authorId": "2218892760", "name": "Xuelin Wang"}, {"authorId": "2253821645", "name": "Jingyang Li"}, {"authorId": "2253529335", "name": "Shenwen Pang"}, {"authorId": "34578251", "name": "Benying Tan"}], "citations": []}
