{"paperId": "d0a118e1c9a46a00f004b3883cba0fd772125a6a", "publicationVenue": {"id": "1cd505d9-195d-4f99-b91c-169e872644d4", "name": "Energies", "type": "journal", "issn": "1996-1073", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-155563", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-155563", "https://www.mdpi.com/journal/energies", "http://www.mdpi.com/journal/energies"]}, "title": "Digitalization in Energy Production, Distribution, and Consumption: A Systematic Literature Review", "abstract": "For this study, we conducted a systematic review of the literature on digitalization in energy production, distribution, and consumption over a sufficiently long period in order to reveal the trends and particularities of this phenomenon at the sectoral level. For the systematic review of the literature, representative articles on the subject indexed in the Web of Science and Scopus databases were selected using the PRISMA 2020 flow diagram. As a result of the systematic review of the literature, a significant number of articles on the subject of digitalization in the energy sector were found—both over the entire period considered and especially in the last five years—indicating the magnitude of the digitalization process in this field. The impacts of digitalization in the energy production, distribution, and consumption sectors materialized in the aspects of health, safety, and environmental improvement; process improvements; and cost reductions. The most important technologies used in the digitalization process include data mining and machine learning, smart grid/smart metering/smart home, Internet of Things, cybersecurity, and automation solutions (e.g., robotics, drones, and distribution automation).", "venue": "Energies", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2023-02-16", "journal": {"name": "Energies"}, "authors": [{"authorId": "98559323", "name": "C. Simion"}, {"authorId": "2208011031", "name": "Cătălin-Alexandru Verdeș"}, {"authorId": "98739395", "name": "A. Mironescu"}, {"authorId": "2208020066", "name": "Florin-Gabriel Anghel"}], "citations": [{"paperId": "8ede13f4ef03ca4438a0d4ab06af0707e0cad5d5", "title": "A Flexibility Platform for Managing Outages and Ensuring the Power System’s Resilience during Extreme Weather Conditions"}, {"paperId": "6171bd9ee60ae1adf1ae39e91ba60a52527fdfc8", "title": "A Comprehensive Review of Fault Diagnosis and Prognosis Techniques in High Voltage and Medium Voltage Electrical Power Lines"}, {"paperId": "66fc6467aec08ebb6047a3429a5c9ff6a8cceb90", "title": "Current trends in AI and ML for cybersecurity: A state-of-the-art survey"}, {"paperId": "6cb1e710f1adb6bad81960fb16c04ec0cf110017", "title": "Artificial Neural Network Model for Temperature Prediction and Regulation during Molten Steel Transportation Process"}]}
