{"paperId": "d0bcc06d613abfecce509cbafa3f6562405cf2f0", "publicationVenue": {"id": "404813e7-95da-4137-be14-2ba73d2df4fd", "name": "IEEE Transactions on Cybernetics", "alternate_names": ["IEEE Trans Cybern"], "issn": "2168-2267", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=6221036", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6221036"]}, "title": "Discovering Multiple Co-Clusterings With Matrix Factorization", "abstract": "Clustering is a fundamental data exploration task which aims at discovering the hidden grouping structure in the data. The traditional clustering methods typically compute a single partition. However, there often exist different and equally meaningful clusterings in complex data. To solve this issue, multiple clustering approaches have emerged with the goal of exploring alternative clusterings from different perspectives. Existing solutions to this problem mainly focus on one-way clustering, that is, they cluster either the samples or the features. However, for many practical tasks, it is meaningful and desirable to explore alternative two-way clusterings (or co-clusterings), which capture not only the sample cluster structure but also the feature cluster structure. To tackle this interesting and unresolved task, we introduce an approach, called multiple co-clusterings (MultiCCs), to generate multiple alternative co-clusterings at the same time. MultiCC takes advantage of matrix tri-factorization to seek the co-clustering indicator matrices for samples and features and defines the row and column redundancy quantification terms to enforce diversity among co-clusterings based on these indicator matrices. After that, it integrates matrix tri-factorization and two nonredundancy terms into a unified objective function and gives an alternative optimization procedure to optimize the objective function. Extensive experimental results demonstrate that MultiCC performs significantly better than the existing multiple clustering methods. In addition, MultiCC can find out interesting co-clusters, which cannot be made by those comparing methods.", "venue": "IEEE Transactions on Cybernetics", "year": 2019, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-11-19", "journal": {"name": "IEEE Transactions on Cybernetics", "pages": "3576-3587", "volume": "51"}, "authors": [{"authorId": "2661535", "name": "Jun Wang"}, {"authorId": "2144801522", "name": "Xing Wang"}, {"authorId": "46546894", "name": "Guoxian Yu"}, {"authorId": "1741392", "name": "C. Domeniconi"}, {"authorId": "144861834", "name": "Zhiwen Yu"}, {"authorId": "2144371525", "name": "Zili Zhang"}], "citations": [{"paperId": "8dc7ede987a86d254e8d4f0531eaca52d455f9c6", "title": "Multiple clusterings: Recent advances and perspectives"}, {"paperId": "73a76fbaa2b0adead513951e769a8190553a5ab6", "title": "A Diversified Attention Model for Interpretable Multiple Clusterings"}, {"paperId": "eb5d276542ddb8ade0d0fe7896468873e348876e", "title": "Fast Flexible Bipartite Graph Model for Co-Clustering"}, {"paperId": "9b86d5fd48b0b67214f7a1459855764cba68d2cf", "title": "scMCs: a framework for single-cell multi-omics data integration and multiple clusterings"}, {"paperId": "f23d0872f861de93cc1ed2d3cea6959f13cba0f4", "title": "Multi-objective genetic model for co-clustering ensemble"}, {"paperId": "628b92a0587399fe231c8dc23206f676e8e2c04c", "title": "Robust weighted co-clustering with global and local discrimination"}, {"paperId": "fdc7ea8d3eaf0bcebd21738c2bddf53ad8aa777c", "title": "EpiHNet: Detecting Epistasis by Heterogeneous Molecule Network."}, {"paperId": "b6b08a96ebe3cdf5d87058ba65b2d1949e76058e", "title": "Smoothed Multi-View Subspace Clustering"}, {"paperId": "49e5812d01d81402f3c7b6f7edd3e2225d9e242c", "title": "Multiple clusterings of heterogeneous information networks"}, {"paperId": "1402d9e64c294a97ddc8e812d1e18d2626efeb6f", "title": "EpiMC: Detecting Epistatic Interactions Using Multiple Clusterings"}, {"paperId": "dedd40b1218c3f28343d097bf0594b0f6599e9dd", "title": "Deep multi-view document clustering with enhanced semantic embedding"}, {"paperId": "68b48c4788b5792eebd77d6e6dff34d32d1b0a51", "title": "EpIntMC: Detecting Epistatic Interactions Using Multiple Clusterings"}, {"paperId": "095ceea463e6d2a51e779e004fbdbdd4745d4888", "title": "Method for Cleaning Outliers in Massive Data of Internet of Things Based on Hierarchical Clustering Algorithm"}, {"paperId": "f62972126a79b90b3e773aee85481af95cec97bd", "title": "Learning Behavior Analysis and Learning Effect Evaluation in Open Online Courses"}]}
