{"paperId": "d0d1a0e8c070f9b8a3badc22ec618a09c00804dd", "publicationVenue": {"id": "940c7008-d07d-488d-baa2-1ef7343957dc", "name": "International Journal of Computer Applications", "type": "journal", "alternate_names": ["INTERNATIONAL JOURNAL OF COMPUTER APPLICATION", "International Journal of Computers and Applications", "International journal of mini & microcomputers", "Int J Comput Appl", "INT J COMPUT APPL", "Int j mini  microcomput"], "issn": "0975-8887", "alternate_issns": ["0702-0481", "1206-212X", "2250-1797"], "url": "https://www.ijcaonline.org/", "alternate_urls": ["http://www.tandfonline.com/loi/tjca20#.VbH7kGPLZa4", "http://www.actapress.com/Content_of_Journal.aspx?JournalID=130", "http://epe.lac-bac.gc.ca/101/201/300/intl_j_comp_applications/index.html"]}, "title": "Crime Analysis and Intelligence System Model Design using Big Data", "abstract": "The advent of new trend in information and communication technology specifically data science, machine learning and artificial intelligence unleashed various opportunities and offers solution to distinct level of problems in various domains. Globally, many countries have adopted the use of data driven technologies and crime analysis to predict and handle crime patterns and logics. However, most countries under-use this technology by using conventional or traditional techniques in crime analysis. A large amount of data is rapidly generated by various agencies of the government and independent organizations especially in Nigeria; agencies share common objectives or mandates. Other contributing factor is enforcement personnel ratio to the total population density. Thus, technology is required to complement the lack of adequate personnel. As a result, this research is aimed at designing a crime analysis and intelligence model using big data. Document Analysis, Questionnaire, and Interview is used to collect data from various law enforcement agents. Microsoft excel is used to generate accurate result and visualized the result in form of a pie chart, while UML models are used to depict logical and physical schema of the proposed model. The results analysis supports the hypothesis of the research by revealing the manual and traditional techniques of policing and crime analysis. Most of the agencies operate and keep track of records manually, while technology is applied to track cellphones. Moreover, a high majority of the respondents lack basic computer literacy and modern crime analysis techniques and big data. Hence, most of the respondent wish to adopt the use of big data analytics.", "venue": "International Journal of Computer Applications", "year": 2020, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2020-10-15", "journal": {"name": "International Journal of Computer Applications"}, "authors": [{"authorId": "2006814140", "name": "Abubakar Aliyu Machina"}, {"authorId": "2234551063", "name": "Songjiang Li"}], "citations": [{"paperId": "ccb0def1d3488a48156f4bdbd9ee37ba68fa81f1", "title": "Big Data technologies in criminal investigations: The frames of the members of Judiciary Police in Portugal"}, {"paperId": "261973cdead565690a0d5bd02fb7dcf6830eae61", "title": "CRIME REDUCTION SYSTEM THROUGH BRYNE CRIMINAL JUSTICE INNOVATION"}, {"paperId": "3d974a54d70edc2449fc88ee9f69f0ec8b4ecb99", "title": "International Journal of Science and Business"}]}
