{"paperId": "d0d4f6c60f463afeb2484ddc6cc44a08a40cfddc", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Vamsa: Tracking Provenance in Data Science Scripts", "abstract": "Machine learning (ML) which was initially adopted for search ranking and recommendation systems has firmly moved into the realm of core enterprise operations like sales optimization and preventative healthcare. For such ML applications, often deployed in regulated environments, the standards for user privacy, security, and data governance are substantially higher. This imposes the need for tracking provenance end-to-end, from the data sources used for training ML models to the predictions of the deployed models. \nIn this work, we take a first step towards this direction by introducing the ML provenance tracking problem in the context of data science scripts. The fundamental idea is to automatically identify the relationships between data and ML models and in particular, to track which columns in a dataset have been used to derive the features of a ML model. We discuss the challenges in capturing such provenance information in the context of Python, the most common language used by data scientists. We then, present Vamsa, a modular system that extracts provenance from Python scripts without requiring any changes to the user's code. Using up to 450K real-world data science scripts from Kaggle and publicly available Python notebooks, we verify the effectiveness of Vamsa in terms of coverage, and performance. We also evaluate Vamsa's accuracy on a smaller subset of manually labeled data. Our analysis shows that Vamsa's precision and recall range from 87.5% to 98.3% and its latency is typically in the order of milliseconds for scripts of average size.", "venue": "arXiv.org", "year": 2020, "fieldsOfStudy": ["Computer Science", "Mathematics"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-01-07", "journal": {"name": "ArXiv", "volume": "abs/2001.01861"}, "authors": [{"authorId": "2872113", "name": "M. Namaki"}, {"authorId": "2327080", "name": "Avrilia Floratou"}, {"authorId": "2493657", "name": "Fotis Psallidas"}, {"authorId": "2494730", "name": "Subru Krishnan"}, {"authorId": "9490513", "name": "Ashvin Agrawal"}, {"authorId": "2948541", "name": "Yinghui Wu"}], "citations": [{"paperId": "7467b01a52cd455881f9753f66aa5f3d7f1df778", "title": "Data Leakage in Notebooks: Static Detection and Better Processes"}, {"paperId": "08c1bac1c35cff8d4a0dda3406d53cc675e74f7c", "title": "Asset Management in Machine Learning: State-of-research and State-of-practice"}, {"paperId": "f29ea0937de7ea31c765475c3c8eb23a0cf2340c", "title": "Data distribution debugging in machine learning pipelines"}, {"paperId": "637fe2b74170b8617bd304e84098bf4a4fcfa571", "title": "Subtle Bugs Everywhere: Generating Documentation for Data Wrangling Code"}, {"paperId": "36d56e8d867768951f6c44bb622033d73834b870", "title": "A Static Analysis Framework for Data Science Notebooks"}, {"paperId": "54a63ebccbbdf38a07cb3437fef66d34fabd6208", "title": "Capturing and querying fine-grained provenance of preprocessing pipelines in data science"}, {"paperId": "af83a168b7877f48f13a8ee86d8379eaba60bdfd", "title": "Workflow provenance in the lifecycle of scientific machine learning"}, {"paperId": "5f34f91329e15d855fe9e08069c4c556c3e66f7f", "title": "Technologies for Trustworthy Machine Learning: A Survey in a Socio-Technical Context"}, {"paperId": "68bee44cc58b1853c7ddcb41aa3c6d29f363637a", "title": "Vamsa: Automated Provenance Tracking in Data Science Scripts"}, {"paperId": "5162898334570a9ead2b9da3c5b707054d63e7e8", "title": "Agora: A Unified Asset Ecosystem Going Beyond Marketplaces and Cloud Services."}, {"paperId": "83d258426118ea6e3aa4dc5e658448b1ec3c9e6b", "title": "Lightweight Inspection of Data Preprocessing in Native Machine Learning Pipelines"}, {"paperId": "620348c8988de4ecf6ce5f9282998fbeccd46c85", "title": "Low Overhead Materialization with Flor"}, {"paperId": "4361bec6322ba26b4ea4c3dd7ab0348add7a584e", "title": "Machine Learning Experiment Management Tools: A Mixed-Methods Empirical Study"}]}
