{"paperId": "d0d6133acb3973d26a87735d5063dbbc461548b7", "publicationVenue": {"id": "e3e363b2-60f3-46d7-9067-5deaddc3f3f2", "name": "Allerton Conference on Communication, Control, and Computing", "type": "conference", "alternate_names": ["Allerton", "T Conf Commun Control Comput"]}, "title": "Coflow Deadline Scheduling via Network-Aware Optimization", "abstract": "Several cloud or data-parallel applications involve coflow scheduling, which controls a set of flows under the same semantic meaning with a common goal. Due to such common goal, optimizing each flow using the standard flow scheduling approaches does not necessarily lead to good coflow performance. Therefore, numerous methods and systems are proposed to focus on coflow scheduling problem.However, the current coflow scheduling designs are based on simple heuristics or observations. The absence of the optimum makes it hard to adjudge their absolute effectiveness. In this work, we derive the optimal solution to the coflow deadline satisfaction problem (CDS), which maximizes the number of satisfied coflow deadlines, from a mixed integer linear program formulation.We further show that CDS is not only NP-hard to solve but also intractable to approximate with a fixed approximation ratio (unless P=NP). As such, the use of heuristics is justified. We then develop optimization-based methods to approach the problem offline and online. The proposed methods are simulated and compared against the optimum, along with some state-of-the-art designs, and the results suggest that our methods are much closer to the optimum than the existing ones, especially when we have more room to schedule.", "venue": "Allerton Conference on Communication, Control, and Computing", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2018-10-01", "journal": {"name": "2018 56th Annual Allerton Conference on Communication, Control, and Computing (Allerton)", "pages": "829-833"}, "authors": [{"authorId": "145679038", "name": "Shih-Hao Tseng"}, {"authorId": "143804758", "name": "A. Tang"}], "citations": [{"paperId": "3dbe20a402a257b163a928df534696c6c2163699", "title": "Weighted Scheduling of Time-Sensitive Coflows"}, {"paperId": "dfe207d1941e585575d70e004d44699068ca425b", "title": "Meeting Coflow Deadlines in Data Center Networks With Policy-Based Selective Completion"}, {"paperId": "21d98e15835b0469493a1e3bfe9b3b134a00dd2d", "title": "Fair Coflow Scheduling via Controlled Slowdown"}, {"paperId": "1fa0e6680fe9cc94fbe1904818f9ccc0d3fc2ed2", "title": "DCoflow: Deadline-Aware Scheduling Algorithm for Coflows in Datacenter Networks"}, {"paperId": "407de1405e03b1fdf73ee809e1e8c32574d4abce", "title": "Scheduling Stochastic Real-Time Coflows in Unreliable Computing Machines"}]}
