{"paperId": "d0d954ab7d8d1f7ce3a0d8fbfdb6f928f0fa816b", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "FogROS 2: An Adaptive and Extensible Platform for Cloud and Fog Robotics Using ROS 2", "abstract": "—Mobility, power, and price points often dictate that robots do not have sufﬁcient computing power on board to run modern robot algorithms at desired rates. Cloud computing providers such as AWS, GCP, and Azure offer immense computing power on demand, but tapping into that power from a robot is non-trivial. In this paper, we present FogROS 2, an easy-to-use, open-source platform to facilitate cloud and fog robotics that is compatible with the emerging Robot Operating System 2 (ROS 2) standard. FogROS 2 provisions a cloud computer, deploys and launches ROS 2 nodes to the cloud computer, sets up secure networking between the robot and cloud, and starts the application running. FogROS 2 is completely redesigned and distinct from its predecessor to support ROS 2 applications, transparent video compression and communication, improved performance and security, support for multiple cloud-computing providers, and remote monitoring and visualization. We demonstrate in example applications that the performance gained by using cloud computers can overcome the network latency to signiﬁcantly speed up robot performance. In examples, FogROS 2 reduces SLAM latency by 50%, reduces grasp planning time from 14s to 1.2s, and speeds up motion planning 28x. When compared to alternatives, FogROS 2 reduces network utilization by up to 3.8x. FogROS 2, source, examples, and documentation is available at https: //github.com/BerkeleyAutomation/FogROS2 .", "venue": "arXiv.org", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "ArXiv", "volume": "abs/2205.09778"}, "authors": [{"authorId": "3027097", "name": "Jeffrey Ichnowski"}, {"authorId": "9270658", "name": "Kai-Peng Chen"}, {"authorId": "1436202543", "name": "K. Dharmarajan"}, {"authorId": "1722033888", "name": "S. Adebola"}, {"authorId": "51428078", "name": "Michael Danielczuk"}, {"authorId": "1947239202", "name": "V'ictor Mayoral-Vilches"}, {"authorId": "2165968255", "name": "Hugo Zhan"}, {"authorId": "46697020", "name": "Derek Xu"}, {"authorId": "2165967948", "name": "Ramtin Ghassemi"}, {"authorId": "1717872", "name": "J. Kubiatowicz"}, {"authorId": "144467753", "name": "I. Stoica"}, {"authorId": "2119114305", "name": "Joseph Gonzalez"}, {"authorId": "144344283", "name": "Ken Goldberg"}], "citations": [{"paperId": "420a99ba6fee616abd52b4dc01f10186aa036ff1", "title": "Lifelong LERF: Local 3D Semantic Inventory Monitoring Using FogROS2"}, {"paperId": "0a587063195c6570b20fb8c52d9dc0f136f1e1b9", "title": "FogROS2-Sky: Optimizing Latency and Cost for Multi-Cloud Robot Applications"}, {"paperId": "71979ecb7ef2a3b1e06e7e8ffd83c66bb9ee7edc", "title": "XBot2D: towards a robotics hybrid cloud architecture for field robotics"}, {"paperId": "a5e1aa280151a453fb31faff895cb8b6efe4a7e3", "title": "CloudGripper: An Open Source Cloud Robotics Testbed for Robotic Manipulation Research, Benchmarking and Data Collection at Scale"}, {"paperId": "ec2acd4e1fa565d657bbad1404d7b2d4f69b1d95", "title": "Blockchain and Emerging Distributed Ledger Technologies for Decentralized Multi-robot Systems"}, {"paperId": "4061c1990c1c4168d16aa4c71ea4c81c556381e6", "title": "Leveraging Cloud Computing to Make Autonomous Vehicles Safer"}, {"paperId": "d87a88548010dd157b20a11e388d5b4f19320cff", "title": "FogROS2-SGC: A ROS2 Cloud Robotics Platform for Secure Global Connectivity"}, {"paperId": "6ac418a39ca135343e3c0a77c183a977d48b2ab3", "title": "A Framework for Model-Sharing of Augmented Intelligence in Container-based Modular Robot Using Cloud System"}, {"paperId": "17ae1e64d1046814214a97748559adb9907550ee", "title": "EMS®: A Massive Computational Experiment Management System towards Data-driven Robotics"}, {"paperId": "9b9b4bb9674cc84923f1def99054326db455550e", "title": "KubeROS: A Unified Platform for Automated and Scalable Deployment of ROS2-based Multi-Robot Applications"}, {"paperId": "9710b5af2c1776f8bc443231d09fd68175c85622", "title": "A Benchmark for Multi-Robot Planning in Realistic, Complex and Cluttered Environments"}, {"paperId": "ca7c60d9d57e3ef4758077ec3e1b2c6056be1817", "title": "Distributed Robotic Systems in the Edge-Cloud Continuum with ROS 2: a Review on Novel Architectures and Technology Readiness"}, {"paperId": "015d82334cb0d616974fe314d7088e83653bf268", "title": "FogROS G: Enabling Secure, Connected and Mobile Fog Robotics with Global Addressability"}, {"paperId": "61669c2148f297d6a9a73c1781740353f00e7ffb", "title": "ElasticROS: An Elastically Collaborative Robot Operation System for Fog and Cloud Robotics"}, {"paperId": "4d9c9d5e5afc3313bfbcf5e69e49ec32f4ec49d4", "title": "Sim-to-Lab-to-Real: Safe Reinforcement Learning with Shielding and Generalization Guarantees"}, {"paperId": "a48943cc121c4ecb3129918aa65d26cafec4ba03", "title": "Edge-SLAM: Edge-Assisted Visual Simultaneous Localization and Mapping"}]}
