{"paperId": "d0efd261e12c316a0a4f50c2f673af04a04b6200", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Machine Learning and Deep Learning Approaches for Brain Disease Diagnosis: Principles and Recent Advances", "abstract": "Brain is the controlling center of our body. With the advent of time, newer and newer brain diseases are being discovered. Thus, because of the variability of brain diseases, existing diagnosis or detection systems are becoming challenging and are still an open problem for research. Detection of brain diseases at an early stage can make a huge difference in attempting to cure them. In recent years, the use of artificial intelligence (AI) is surging through all spheres of science, and no doubt, it is revolutionizing the field of neurology. Application of AI in medical science has made brain disease prediction and detection more accurate and precise. In this study, we present a review on recent machine learning and deep learning approaches in detecting four brain diseases such as Alzheimer’s disease (AD), brain tumor, epilepsy, and Parkinson’s disease. 147 recent articles on four brain diseases are reviewed considering diverse machine learning and deep learning approaches, modalities, datasets etc. Twenty-two datasets are discussed which are used most frequently in the reviewed articles as a primary source of brain disease data. Moreover, a brief overview of different feature extraction techniques that are used in diagnosing brain diseases is provided. Finally, key findings from the reviewed articles are summarized and a number of major issues related to machine learning/deep learning-based brain disease diagnostic approaches are discussed. Through this study, we aim at finding the most accurate technique for detecting different brain diseases which can be employed for future betterment.", "venue": "IEEE Access", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-02-26", "journal": {"name": "IEEE Access", "pages": "37622-37655", "volume": "9"}, "authors": [{"authorId": "2053856569", "name": "P. Khan"}, {"authorId": "1827221", "name": "Md. Fazlul Kader"}, {"authorId": "145866971", "name": "S. Islam"}, {"authorId": "1471373865", "name": "Aisha B. Rahman"}, {"authorId": "2061546928", "name": "Md. Shahriar Kamal"}, {"authorId": "2053858245", "name": "Masbah Uddin Toha"}, {"authorId": "2065578072", "name": "K. Kwak"}], "citations": [{"paperId": "a779f5dd28c8aaab0e1bdceeb6700f17d655c0a4", "title": "The Role of AI in Hospitals and Clinics: Transforming Healthcare in the 21st Century"}, {"paperId": "aec6e90b12cb50f29b52705b854aa4096c6633b5", "title": "Evaluation of the Relation between Ictal EEG Features and XAI Explanations"}, {"paperId": "027d46e867d4429ff32c5b4eaa864b9f63443ccc", "title": "Classification of Alzheimer Disease using Machine Learning Algorithm"}, {"paperId": "c9ab9c0546c815974b8b89bebb81bd5aa65332de", "title": "Deep CNN-Based MRI Imaging for Brain Tumor Detection and Classification"}, {"paperId": "85551fbf4fae0cbd2b4a7f9e2ea658d3cae307f7", "title": "A deep learning-based intelligent decision-making model for tumor and cancer cell identification"}, {"paperId": "9fbee3bb534fcd4f81beca9a1187c11de3e36115", "title": "Analysing various algorithms applied to Alzheimer’s disease dataset to help the Future Generation"}, {"paperId": "39f9fc0a54b493297f8a0cd009c24fd4656e0bd4", "title": "Detection of Epileptic Seizures in EEG Signals using Deep Convolutional Neural Networks"}, {"paperId": "bbe16411d820e1f3e5aec5d7f81a9c18ac8ebb0a", "title": "Machine Learning-Based Alzheimer's Disease Prediction using Textual Data"}, {"paperId": "7216c6ed224b0c71f80b66b1447c425587cd75c2", "title": "On Development of Computer Aided System for Detecting Brain Neurological Disorders"}, {"paperId": "9a2ca5d07c596aa0d794af2dbc64db3b74f696d2", "title": "Automatic Epilepsy Detection using Machine Learning"}, {"paperId": "57cb09afec65031ab95a3db17f02c38118a2ac36", "title": "GADY: Unsupervised Anomaly Detection on Dynamic Graphs"}, {"paperId": "06fd367441c0eb11b3705efe05bbeb9d69731edc", "title": "2D brain MRI image synthesis based on lightweight denoising diffusion probabilistic model"}, {"paperId": "30c60932c1a9ef5d3e309bd90b4be4f19d4aa24e", "title": "Empowering Precision Medicine: AI-Driven Schizophrenia Diagnosis via EEG Signals: A Comprehensive Review from 2002-2023"}, {"paperId": "289532e7dbe2b2471f2c97894318febe0e2c86d9", "title": "Prediction of Alzheimer's disease - A Machine Learning Perspective with Ensemble Learning"}, {"paperId": "0076bebb7fd1e037d3fa9687d2af45b1912d22da", "title": "Enhancing Multi-Stage Classification of Alzheimer's Disease with Attention Mechanism"}, {"paperId": "81fa99f4631ac61f3882f343ce57b335877d6d83", "title": "A Heuristic-Concatenated Feature Classification Algorithm (H-CFCA) for autism and epileptic seizure detection"}, {"paperId": "bcb2c653fa2bfcf1fe1446ee703b7f29ddc8f278", "title": "Data Fusion-based graph representation learning for brain disease recognition"}, {"paperId": "4e5b1d987a6517fea41a63dc99a989693e77e88d", "title": "Systematic Report on Exploration of Machine Learning Methods for Brain Tumor Prediction"}, {"paperId": "cc4520eb7aeae96541655bae8b811206cc0d080e", "title": "Machine learning techniques for electroencephalogram based brain-computer interface: A systematic literature review"}, {"paperId": "f7b5fffdb1b58aabb3595904ab890663a276ace7", "title": "An Approach to Binary Classification of Alzheimer’s Disease Using LSTM"}, {"paperId": "10793f23a2c0d6108173eb985cbac8710f8f0d97", "title": "A Review on the Diagnosis of Epilepsy using ML"}, {"paperId": "90931b23884dfc9fa413b33bb88be74192809672", "title": "Implementation of artificial intelligence and machine learning-based methods in brain-computer interaction"}, {"paperId": "9980bc00af463ec4d0b828fe2cc699d85333f4a1", "title": "Alzheimer’s Disease Detection: A Deep Learning-Based Approach"}, {"paperId": "ad9b5e8cd07b1518acfffaf1132dbbdcfc45cdd8", "title": "Brain Tumor Detection Using YOLOv5 and Faster R-CNN"}, {"paperId": "2617bcb9d373962455036f31fa4d7ab69d5315aa", "title": "Deep Learning Enabled Classification of Cognitive Impairment Stages Using MRI Images"}, {"paperId": "933ea875aba64d3aa3d6c32dbd75b29f9061cba9", "title": "Brain tumor detection using histogram equalization and deep learning"}, {"paperId": "d4f75b92064ce3869e1f72217dad2069511e88a8", "title": "A Novel Approach Utilizing Machine Learning for the Early Diagnosis of Alzheimer's Disease"}, {"paperId": "e1311beb50756603d46761c235cf9e8bae8b5aaf", "title": "Alzheimers Disease Detection Using Cnn And Vision Transformation"}, {"paperId": "90f81e901b18612d528aad6c891a435ce098e70c", "title": "Enhancing Digital Health Services with Big Data Analytics"}, {"paperId": "4590d677e3eb56c09008f51b07f7f2e5441e163b", "title": "Performance Investigation for Medical Image Evaluation and Diagnosis Using Machine-Learning and Deep-Learning Techniques"}, {"paperId": "d6fe507959686e451bddac94cb6138532119c4dd", "title": "Predictive Analytics Model for Optimizing Carbon Emission from Student Activity and Behavior with A Design Thinking Approach: Case Study: Bandung Institute of Technology"}, {"paperId": "b8a38ebe459b349f500e48a329f1e7a7529411f5", "title": "A Brief Survey on Feature Extraction Models for Brain Tumor Detection"}, {"paperId": "ff97adbdf7ba45c08c6abe277aba04b41e85e5b0", "title": "Evaluation of artificial intelligence techniques in disease diagnosis and prediction"}, {"paperId": "0a15972784c37d416ee5125ee9800ebfae208f41", "title": "Rice seed classification using machine learning and deep learning"}, {"paperId": "2977a442fc42ae9fc754d81f006dae1c68ffdd65", "title": "Diagnosis of brain diseases in fusion of neuroimaging modalities using deep learning: A review"}, {"paperId": "3fd7d1152d7661683bd1687d17ffa07899f443a3", "title": "Supervised Machine Learning and Deep Learning Techniques for Epileptic Seizure Recognition Using EEG Signals—A Systematic Literature Review"}, {"paperId": "91a4cd56308cfd80055560d520dfea9a3c081a73", "title": "Using CatBoost and Other Supervised Machine Learning Algorithms to Predict Alzheimer's Disease"}, {"paperId": "c72f07a50c6ac7ac5c4cd5265c73557e997a5f4d", "title": "Comparison of Classification Algorithms for Alzheimer’s Disease Prediction"}, {"paperId": "bd212ab4ec0753eaf3f2e700edce950b2950efe8", "title": "The present and future of neural interfaces"}, {"paperId": "e202b74e810241b39c7ec397851b707d8242b05f", "title": "Brain tumor detection using deep ensemble model with wavelet features"}, {"paperId": "a882a848be7a4cb8e5e3fed27439481eda8e9878", "title": "Meta-heuristic-based FCM-UNet segmentation with multi-objective function and deep learning for brain tumour classification"}, {"paperId": "65ede20611cb29fa04ad9a40efe505cd273064ba", "title": "Diagnosis of Brain Tumor Using Light Weight Deep Learning Model with Fine-Tuning Approach"}, {"paperId": "40945a6b8ef107ac3cf0b5b2f511bcb9d94411bf", "title": "Machine Learning for Alzheimer’s Disease Detection Based on Neuroimaging techniques: A Review"}, {"paperId": "a6066418c99adef501608182aae613dcaa6af117", "title": "Supervised Machine Learning Empowered Multifactorial Genetic Inheritance Disorder Prediction"}, {"paperId": "42353fa4f997846bb95dd936c1ab87ed82aaa05c", "title": "An effective convolutional neural network-based stacked long short-term memory approach for automated Alzheimer's disease prediction"}, {"paperId": "3760e27b8c3af205ce0ae3e2b4cb896d32d39ab4", "title": "Early diagnosis of Alzheimer's disease based on deep learning: A systematic review."}, {"paperId": "c17d2315db231055fdceb9c88320727fcfe19a44", "title": "Parkinson's Disease Detection Using Machine Learning"}, {"paperId": "4f28ec72db0792948f85f6cd294ec9594796af37", "title": "Early-Stage Alzheimer's Disease Prediction Using Machine Learning Models"}, {"paperId": "277c038152cf2e7739b7295d43ff6c52e0cf3d5e", "title": "Alzheimer's disease prediction based on continuous feature representation using multi-omics data integration"}, {"paperId": "c97406e4f32183596557ab70d2aa42775cbb5414", "title": "Deep Learning with Neuroimaging and Genomics in Alzheimer’s Disease"}, {"paperId": "a24142d198e7c09fb9e1542a370fce496223427f", "title": "A novel hybrid model in the diagnosis and classification of Alzheimer's disease using EEG signals: Deep ensemble learning (DEL) approach"}, {"paperId": "238621024a9f9d8df80f853bfcb4eb2d921529d8", "title": "Unveiling the Power of EEG Signals: Parkinson's Disease Identification via Yet Another Mobile Network (YAMNet)"}, {"paperId": "e2cd69861f9955e77b799c404eac72441c1dcc1e", "title": "A modified FGL sparse canonical correlation analysis for the identification of Alzheimer's disease biomarkers"}, {"paperId": "32340be81c5cd949105ab9992683379da4a566e7", "title": "Deep Learning Approach For Brain Tumor Segmentation and Anomaly Detection"}, {"paperId": "de81352789c75598a7d1d2ab5545e122e64de2cc", "title": "Predictive Analytics Model for Optimizing Carbon Footprint From Students’ Learning Activities in Computer Science-Related Majors"}, {"paperId": "9cbf4934009e6f2b6e5d998d2eedd9aa1758aa10", "title": "Using Generative Adversarial Networks and Ensemble Learning for Multi-Modal Medical Image Fusion to Improve the Diagnosis of Rare Neurological Disorders"}, {"paperId": "a71767873a2de18d5d710e6689ed828bcc20ca9b", "title": "Automated Decision Making Systems in Smart Homes: A Study on User Engagement and Design"}, {"paperId": "f080b2c3ca07f8c49c4d57372bfa68afdc10c598", "title": "Hepatitis C Virus Detection Model by Using Random Forest, Logistic-Regression and ABC Algorithm"}]}
