{"paperId": "d10285a32f85e2adc0c59fdea03d92632377af78", "publicationVenue": {"id": "bb21160f-0f31-4e34-abab-715b95a870a2", "name": "Indonesian Journal of Electrical Engineering and Computer Science", "type": "journal", "alternate_names": ["Indones J Electr Eng Comput Sci"], "issn": "2502-4752", "url": "http://www.iaescore.com/journals/index.php/IJEECS"}, "title": "A review on data clustering using spiking neural network (SNN) models", "abstract": "The evolution of Artificial Neural Network recently gives researchers an interest to explore deep learning evolved by Spiking Neural Network clustering methods. Spiking Neural Network (SNN) models captured neuronal behaviour more precisely than a traditional neural network as it contains the theory of time into their functioning model [1]. The aim of this paper is to reviewed studies that are related to clustering problems employing Spiking Neural Networks models. Even though there are many algorithms used to solve clustering problems, most of the methods are only suitable for static data and fixed windows of time series. Hence, there is a need to analyse complex data type, the potential for improvement is encouraged. Therefore, this paper summarized the significant result obtains by implying SNN models in different clustering approach. Thus, the findings of this paper could demonstrate the purpose of clustering method using SNN for the fellow researchers from various disciplines to discover and understand complex data.", "venue": "Indonesian Journal of Electrical Engineering and Computer Science", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2019-09-01", "journal": {"name": "Indonesian Journal of Electrical Engineering and Computer Science"}, "authors": [{"authorId": "32460337", "name": "S. A. Mohamed"}, {"authorId": "3150316", "name": "Muhaini Othman"}, {"authorId": "2208468170", "name": "Mohd Hafizul Afifi"}], "citations": [{"paperId": "cf96858e9bf69a121ecf148eb6af753923ff1120", "title": "Improvement of pattern recognition in spiking neural networks by modifying threshold parameter and using image inversion"}, {"paperId": "239fe73f569e37fa176f0b4bc799140f2a0bdf4e", "title": "Robust fuzzy dual-local information clustering with kernel metric and quadratic surface prototype for image segmentation"}, {"paperId": "e0d677afaf7a5669f9cce993b3ca678bd0d67cfc", "title": "A Brief Review on Spiking Neural Network - A Biological Inspiration"}, {"paperId": "8329c232a976e7eb8ba8e9ada755dd84aa11bf19", "title": "Hamming neural network application with FPGA device"}, {"paperId": "3d326de136e93e301a95f002f82e6c30db756ce8", "title": "Design and Implementation of a Spiking Neural Network with Integrate-and-Fire Neuron Model for Pattern Recognition"}, {"paperId": "bba0ceca0aeea09fa3a1ef498849da6942fce112", "title": "A proactive metaheuristic model for optimizing weights of artificial neural network"}, {"paperId": "554cd2e3e741d3ba230ee77bb9e5bac3ae9fd81e", "title": "Towards IR4.0 implementation in e-manufacturing: artificial intelligence application in steel plate fault detection"}, {"paperId": "67449edc796cc97b047e4e5ffffc9eed0309111d", "title": "Design and implementation hamming neural network with VHDL"}, {"paperId": "e73da29c9c652f515d0e7f222389a8bac833739a", "title": "A Spiking Neural Networks Model with Fuzzy-Weighted k-Nearest Neighbour Classifier for Real-World Flood Risk Assessment"}, {"paperId": "389e33b825ec47c0200e9072a1c72d0ffc6ed9f7", "title": "Digit Recognition in Spiking Neural Networks using Wavelet Transform"}, {"paperId": "b74fcd1f780e9c2ad71e471b24a7931cc833fcb0", "title": "The effect of the TF-IDF algorithm in times series in forecasting word on social media"}]}
