{"paperId": "d10dbd6c8f131fb05b0ea4195b2ee6958f771bb7", "publicationVenue": {"id": "2bff3ecd-cb0d-467a-bdff-036c3e4b3e2d", "name": "Water", "type": "journal", "issn": "2073-4441", "alternate_issns": ["1462-897X", "0310-0367"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-160269", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-160269", "http://www.mdpi.com/journal/water/about/", "https://www.mdpi.com/journal/water"]}, "title": "Intelligent Edge-Cloud Framework for Water Quality Monitoring in Water Distribution System", "abstract": "Ensuring consistent high water quality is paramount in water management planning. This paper addresses this objective by proposing an intelligent edge-cloud framework for water quality monitoring within the water distribution system (WDS). Various scenarios—cloud computing, edge computing, and hybrid edge-cloud computing—are applied to identify the most effective platform for the proposed framework. The first scenario brings the analysis closer to the data generation point (at the edge). The second and third scenarios combine both edge and cloud platforms for optimised performance. In the third scenario, sensor data are directly sent to the cloud for analysis. The proposed framework is rigorously tested across these scenarios. The results reveal that edge computing (scenario 1) outperforms cloud computing in terms of latency, throughput, and packet delivery ratio obtaining 20.33 ms, 148 Kb/s, and 97.47%, respectively. Notably, collaboration between the edge and cloud enhances the accuracy of classification models with an accuracy of up to 94.43%, this improvement was achieved while maintaining the energy consumption rate at the lowest value. In conclusion, our study demonstrates the effectiveness of the proposed intelligent edge-cloud framework in optimising water quality monitoring, and the superior performance of edge computing, coupled with collaborative edge-cloud strategies, underscores the practical viability of this approach.", "venue": "Water", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-01-05", "journal": {"name": "Water"}, "authors": [{"authorId": "7275900", "name": "Essa Q. Shahra"}, {"authorId": "2278399928", "name": "Wenyan Wu"}, {"authorId": "2278094210", "name": "Shadi Basurra"}, {"authorId": "2278087609", "name": "Adel Aneiba"}], "citations": []}
