{"paperId": "d14af622ee4d63d166c75ddf375e4e25588afc4c", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "An Internet of Things Embedded Sustainable Supply Chain Management of B2B E-Commerce", "abstract": "Adopting digital technologies in a business can help with sustainable supply chain management. These technologies can make e-commerce development faster and empower the emergence of B2B e-commerce businesses. In this study, our focus was to develop a framework for an Internet of things (IoT) embedded sustainable supply chain to deliver textile items using a B2B e-commerce business model. We formulated a mixed-integer non-linear programming (MINLP) model to minimize the total supply chain cost, including the B2B orders’ packaging, handling, and transportation, with carbon emission taxation. Furthermore, the purchasing cost of the RFID tags and IoT facilities that were provided on the transport vehicles was high. The proposed model was solved by using the global solver in the LINGO software package and finding the optimized value of the total supply chain network cost. We tested the proposed model in different case scenarios, i.e., small- to significant-sized problems. Then, a sensitivity analysis was performed to observe the variations in the overall cost of the supply chain network when there were changes in the main parameters of the proposed model. The results of the models showed that models can be helpful for efficient logistics planning and supply chain design.", "venue": "Sustainability", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-04-22", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "93998489", "name": "Dhirendra Prajapati"}, {"authorId": "145550318", "name": "F. Chan"}, {"authorId": "2705939", "name": "H. Chelladurai"}, {"authorId": "2163465574", "name": "Lakshay Lakshay"}, {"authorId": "2005824078", "name": "S. Pratap"}], "citations": [{"paperId": "a439b897bb766e4df23566d490260fc5ac776ce2", "title": "Impact of inventory management on SME performance: a systematic review"}, {"paperId": "38f795c65c8317af0e34f49ef459f11a04e7d326", "title": "A neutrosophic optimization model for supply chain virtualization in the circular economy using the non-dominated sorting genetic algorithm II"}, {"paperId": "0755c3dfc21a772f26975b1ab4cf457b7cbe9006", "title": "A systematic review of modeling approaches in green supply chain optimization"}, {"paperId": "14c24c8d5239d783ca5a6dbb272f98b4d035fbfa", "title": "Integrating blockchain, RFID and IoT within a cheese supply chain: A cost analysis"}, {"paperId": "6a0ebf05fc6f868d66182290a3d2ea695dc91f4d", "title": "Revealing the hidden potentials of Internet of Things (IoT) - An integrated approach using agent-based modelling and system dynamics to assess sustainable supply chain performance"}, {"paperId": "64db8d039ff718bba77b7e892c5440433617faa7", "title": "Traversing the Macroeconomic Terrain: An Exploration of South Korea’s Economic Responsiveness to Cross-Border E-Commerce Production Technology Alterations in the Global Arena"}, {"paperId": "c360dda5ad0a6e2d135173fdb53d2dacb75f2505", "title": "A sustainable circular supply chain network design model for electric vehicle battery production using internet of things and big data"}, {"paperId": "ef0225e3e6e0e686cd2162ed331ce5a34ed1627d", "title": "The Applications, Opportunities and Challenges of IoT in Supply Chain Management: Insights from Literature Review"}, {"paperId": "46445cf2f7c26363eb5e15f6255cee630a75f3a9", "title": "Sustainable Supply Chain Management, Performance Measurement, and Management: A Review"}, {"paperId": "8489ab6b00e1ce7bca575188b5a1819b7fef83e2", "title": "The design for supply chain management of intelligent logistics system using cloud computing and the internet of things"}, {"paperId": "eda1a94413ec8a5be7d647ed8988f74a21ab7636", "title": "Supply Chain Integration and Its Impact on Operating Performance: Evidence from Chinese Online Companies"}, {"paperId": "12421fdc0eeddcaba24e110d19bdf44ce23588dd", "title": "Sustainable Logistics for E-Commerce: A Literature Review and Bibliometric Analysis"}, {"paperId": "949f823d4dc0679a60cd32128b184987a72e0345", "title": "Blockchain and IoT embedded sustainable virtual closed-loop supply chain in E-commerce towards the circular economy"}, {"paperId": "a4e2f55b0b5524f6274dbae8611142a666d11dcb", "title": "Sustainable Agro-Food Supply Chain in E-Commerce: Towards the Circular Economy"}, {"paperId": "272d3a661a3ace657cf53cb87d9a898d2e44f2db", "title": "Leveraging the Internet of Things in Commerce: A Transformational Frontier"}, {"paperId": "397e9a7f199485c2c65ecb7860e7d7ffdad07a1e", "title": "A Supplier Selection Model Using the Triangular Fuzzy-Grey Numbers"}, {"paperId": "01d628dbd38043c50de717132e982789360d6fd6", "title": "транспортно-логистического рынка: перспективы российско-китайской интеграции в условиях санкционных ограничений"}]}
