{"paperId": "d14c5a3fb6be1f349d3e75a904a0908f466a4ba4", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "A Cyber-Physical System and Graph-Based Approach for Transportation Management in Smart Cities", "abstract": "In the last decade, technological advancements in the cyber-physical system have set the basis for real-time and context-aware services to ease human lives. The citizens, especially travelers, want to experience a safe, healthy, and timely journey to their destination. Smart and on-ground real-time traffic analysis helps authorities further improve decision-making to ensure safe and convenient traveling. In this paper, we proposed a transport-control model that exploits cyber-physical systems (CPS) and sensor-technology to continuously monitor and mine the big city data for smart decision-making. The system makes use of travel-time, traffic intensity, vehicle’s speed, and current road conditions to construct a weighted city graph representing the road network. Traditional graph algorithms with efficient implementation technologies are employed to respond to commuters’ and authorities’ needs in order to achieve a smart and optimum transportation system. To efficiently process the incoming big data streams, the proposed architecture uses the Apache GraphX tool with several parallel processing nodes, along with Spark and Hadoop that ultimately provide better performance against various state-of-the-art solutions. The system is thoroughly evaluated in terms of system throughput and processing time, revealing that the proposed system is efficient, robust, and scalable.", "venue": "Sustainability", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-07-07", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "2102128571", "name": "M. M. Rathore"}, {"authorId": "2129542483", "name": "Syed Attique Shah"}, {"authorId": "144185337", "name": "Ahmed Awad"}, {"authorId": "107879299", "name": "Dhirendra Shukla"}, {"authorId": "151224659", "name": "S. Vimal"}, {"authorId": "1940632", "name": "Anand Paul"}], "citations": [{"paperId": "26084568c5f7b0f2fb36e8c6e78e5d223c03f806", "title": "On the relationship between the activity at point of interests and road traffic"}, {"paperId": "31f4842baee6d15c5fe20d72460a41b83d08c5b7", "title": "Machine learning based data collection protocol for intelligent transport systems: a real-time implementation on Dublin M50, Ireland"}, {"paperId": "30d12d91c7f65af8c04945bac2b3c78c822cf784", "title": "A Novel Data Management Scheme in Cloud for Micromachines"}, {"paperId": "a0e4cba1bdf1e8b8a90a02c73180dc33bba1aa9f", "title": "An overview of Hadoop applications in transportation big data"}, {"paperId": "1772a160346ee008fa1131f73e001e8bd4c4bdae", "title": "Solving Some Graph Problems in Composite 3D Printing Using Spreadsheet Modeling"}, {"paperId": "eb5568ecec04ae411c9421f7459001205b454b1c", "title": "Economic statistical strategies for the transportation industry based on time-varying parametric state space models"}, {"paperId": "edf01449ebcfd01c0aa9e747821b2bb08c738693", "title": "RDF Subgraph Query Based on Common Subgraph in Distributed Environment"}, {"paperId": "7fef2683d3e5c90a7444e81ae2ace02df9322bab", "title": "Cyber-Physical Urban Mobility Systems: Opportunities and Challenges in Developing Countries"}, {"paperId": "bdece721c9d48da65b1c12445d9c9bcc19f9c9a4", "title": "Mixers Detection in bitcoin network: a step towards detecting money laundering in crypto-currencies"}, {"paperId": "42a5c9da84ee2ca7aea600319bda2c2c532bf6a7", "title": "Smart contract-based security architecture for collaborative services in municipal smart cities"}, {"paperId": "b1149d292e0092da7ecb978aa7df18bd4f8349d4", "title": "Big data analysis and cloud computing for smart transportation system integration"}, {"paperId": "10e073750a0dd66cae574c6cda495ff384b99bd7", "title": "Compatibility checking for cyber‐physical systems based on microservices"}, {"paperId": "f49c093067d149245661fc412781842bab1d137e", "title": "Logistics4.0 for urban logistics: a literature review and research framework"}, {"paperId": "eca3f279e259a31c485e5aa5b598b880bc15a1f6", "title": "A comprehensive survey on data dissemination in Vehicular Ad Hoc Networks"}, {"paperId": "c96534b83d223c814f1c11710363a501d788d675", "title": "CNN-CLFFA: Support Mobile Edge Computing in Transportation Cyber Physical System"}, {"paperId": "af2b3e4738cca8739cd915eab74068a4e77e5f7f", "title": "Traffic Prediction in Smart Cities Based on Hybrid Feature Space"}]}
