{"paperId": "d16912549812053a3bbfecf3d84ab4d8832382c0", "publicationVenue": {"id": "e7791e25-168b-40b0-b999-10020aadabf4", "name": "International Conference on Software and Data Technologies", "type": "conference", "alternate_names": ["ICSOFT", "Int Conf Softw Data Technol"], "url": "http://www.icsoft.org/"}, "title": "TASTING: Reuse Test-case Execution by Global AST Hashing", "abstract": ": We describe TASTING, an approach for efﬁciently selecting and reusing regression-test executions across program changes, branches, and variants in continuous integration settings. Instead of detecting changes between two variants of the software-under-test, TASTING recursively composes hashes of the deﬁning elements with all their dependencies on AST-level at compile time into a semantic ﬁngerprint of the test and its execution environment. This ﬁngerprint is easy to store and remains stable across changes if the test’s run-time behavior is not affected. Thereby, we can reuse test results across the history, multiple branches, and static compile-time variants. We applied TASTING to three open-source projects (Zephyr, OpenSSL, FFmpeg). Over their development history, we can omit between 10 percent (FFmpeg) and 95 percent (Zephyr) of all test executions at a moderate increase in build time. Furthermore, TASTING enables even higher savings across multiple checkouts (e.g., forks, branches, clones) and static software variants. Over the ﬁrst changes to 131 OpenSSL forks, TASTING avoids 56 percent redundant test executions; for the Zephyr test matrix (64 variants), we reduce the number of test executions by 94 percent.", "venue": "International Conference on Software and Data Technologies", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"pages": "33-45"}, "authors": [{"authorId": "2176447010", "name": "Tobias Landsberg"}, {"authorId": "144185846", "name": "Christian J. Dietrich"}, {"authorId": "36548921", "name": "Daniel Lohmann"}], "citations": []}
