{"paperId": "d16ab0c58ddc536fe382c7e87fbcae30d9f8368c", "publicationVenue": {"id": "c6ced65d-fcf7-4e5f-bedd-01360247ebbe", "name": "IEEE International Symposium on Personal, Indoor and Mobile Radio Communications", "type": "conference", "alternate_names": ["Pers Indoor Mob Radio Commun", "Personal, Indoor and Mobile Radio Communications", "IEEE Int Symp Pers Indoor Mob Radio Commun", "PIMRC"], "url": "http://www.ieee-pimrc.org/"}, "title": "On the Use of Power Amplifier Nonlinearity Quotient to Improve Radio Frequency Fingerprint Identification in Time-Varying Channels", "abstract": "Radio frequency fingerprint identification (RFFI) is a lightweight device authentication technique particularly desirable for power-constrained devices, e.g., the Internet of things (IoT) devices. Similar to biometric fingerprinting, RFFI exploits the intrinsic and unique hardware impairments resulting from manufacturing, such as power amplifier (PA) nonlinearity, to develop methods for device detection and classification. Due to the nature of wireless transmission, received signals are volatile when communication environments change. The resulting radio frequency fingerprints (RFFs) are distorted, leading to low device detection and classification accuracy. We propose a PA nonlinearity quotient and transfer learning classifier to design the environment-robust RFFI method. Firstly, we formalized and demonstrated that the PA nonlinearity quotient is independent of environmental changes. Secondly, we implemented transfer learning on a base classifier generated by data collected in an anechoic chamber, further improving device authentication and reducing disk and memory storage requirements. Extensive experiments, including indoor and outdoor settings, were carried out using LoRa devices. It is corroborated that the proposed PA nonlinearity quotient and transfer learning classifier significantly improved device detection and device classification accuracy. For example, the classification accuracy was improved by 33.3% and 34.5% under indoor and outdoor settings, respectively, compared to conventional deep learning and spectrogram-based classifiers.", "venue": "IEEE International Symposium on Personal, Indoor and Mobile Radio Communications", "year": 2023, "fieldsOfStudy": ["Engineering", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-02-27", "journal": {"name": "2023 IEEE 34th Annual International Symposium on Personal, Indoor and Mobile Radio Communications (PIMRC)", "pages": "1-7"}, "authors": [{"authorId": "2145444711", "name": "Lu Yang"}, {"authorId": "1811469", "name": "S. Çamtepe"}, {"authorId": "48146603", "name": "Yansong Gao"}, {"authorId": "2059936924", "name": "Vicky Liu"}, {"authorId": "3185727", "name": "D. Jayalath"}], "citations": []}
