{"paperId": "d16ec0a455bea8265a0f0deaa20905c6e1422ae8", "publicationVenue": {"id": "544cddb9-1149-469a-8377-d8c34f08d8b1", "name": "IEEE Transactions on Emerging Topics in Computational Intelligence", "alternate_names": ["IEEE Trans Emerg Top Comput Intell"], "issn": "2471-285X", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=7433297", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=7433297"]}, "title": "JGSED: An End-to-End Spectral Clustering Model for Joint Graph Construction, Spectral Embedding and Discretization", "abstract": "Most of the existing graph-based clustering models performed clustering by adopting a two-stage strategy which first completes the spectral embedding from a given fixed graph and then resorts to other clustering methods such as $k$means to achieve discrete cluster results. On one hand, such a discretization operation easily causes that the obtained results deviate far from the true solution. On the other hand, clustering performance heavily relies on the quality of graph; therefore, the fixed graph is usually not optimal enough. In addition, clustering by separated steps inevitably breaks the underlying connections among the graph construction, spectral embedding and discretization. To address these drawbacks, in this paper, we propose a new spectral clustering model termed JGSED which integrates the graph construction, spectral embedding and spectral rotation together into a unified objective. JGSED is an end-to-end framework to directly take data as input and output the final binary cluster indicator matrix. An efficient algorithm is proposed to optimize the model variables in JGSED, which can be co-evolved towards the optimum. Extensive experiments are conducted on both synthetic and real data sets and the results demonstrate that JGSED outperforms the other state-of-the-art spectral clustering models, indicating the effectiveness of joint optimization.", "venue": "IEEE Transactions on Emerging Topics in Computational Intelligence", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-01", "journal": {"name": "IEEE Transactions on Emerging Topics in Computational Intelligence", "pages": "1687-1701", "volume": "7"}, "authors": [{"authorId": "50095910", "name": "Yong Peng"}, {"authorId": "2158105507", "name": "Wenna Huang"}, {"authorId": "1915470", "name": "Wanzeng Kong"}, {"authorId": "144962210", "name": "F. Nie"}, {"authorId": "1715839", "name": "Bao-Liang Lu"}], "citations": [{"paperId": "60389363ab73833ebe466817d752989c04f17777", "title": "Multi-Kernel Tensor Fusion on Grassmann Manifold for Genomic Data Clustering"}, {"paperId": "8273c3ea41f0b50ca08f08c561230191f2eb11f6", "title": "A Unified Framework for Fair Spectral Clustering With Effective Graph Learning"}]}
