{"paperId": "d1768b2dc55d35b36ac3c8f8c667f6084801a901", "publicationVenue": {"id": "5b12c785-cf12-40ca-b4d1-aefd13b26e39", "name": "Intelligent Data Analysis", "type": "journal", "alternate_names": ["Intell Data Anal"], "issn": "1088-467X", "url": "http://content.iospress.com/journals/intelligent-data-analysis", "alternate_urls": ["http://www.iospress.nl/intelligent-data-analysis/"]}, "title": "Extended clustering algorithm based on cluster shape boundary", "abstract": "Based on the shape characteristics of the sample distribution in the clustering problem, this paper proposes an extended clustering algorithm based on cluster shape boundary (ECBSB). The algorithm automatically determines the number of clusters and classification discrimination boundaries by finding the boundary closures of the clusters from a global perspective of the sample distribution. Since ECBSB is insensitive to local features of the sample distribution, it can accurately identify clusters on complex shape and uneven density distribution. ECBSB first detects the shape boundary points of the cluster in the sample set with edge noise points eliminated, and then generates boundary closures around the cluster based on the boundary points. Finally, the cluster labels of the boundary are propagated to the entire sample set by a nearest neighbor search. The proposed method is evaluated on multiple benchmark datasets. Exhaustive experimental results show that the proposed method achieves highly accurate and robust clustering results, and is superior to the classical clustering baselines on most of the test data.", "venue": "Intelligent Data Analysis", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-04-18", "journal": {"name": "Intell. Data Anal.", "pages": "567-582", "volume": "26"}, "authors": [{"authorId": "50492525", "name": "Peng Li"}, {"authorId": "2117713193", "name": "Haibin Xie"}, {"authorId": "49593503", "name": "Yifei Shi"}, {"authorId": "2152774720", "name": "Xin Xu"}], "citations": []}
