{"paperId": "d17ed6aacf3588d9ebecf980a0e170e6c017df2b", "publicationVenue": {"id": "99e98681-158c-48ca-8f86-386d75770b50", "name": "IEEE/ACM International Symposium on Modeling, Analysis, and Simulation On Computer and Telecommunication Systems", "type": "conference", "alternate_names": ["IEEE/ACM Int Symp Model Anal Simul Comput Telecommun Syst", "Model Anal Simul Comput Telecommun Syst", "Modeling, Analysis, and Simulation On Computer and Telecommunication Systems", "MASCOTS"], "url": "http://www.mascots-conference.org/"}, "title": "Optimal Markovian Dynamic Control of Interference-Prone Server Farms", "abstract": "Interference is a key performance challenge faced by cloud users, and can significantly degrade application performance on virtual machines (VMs). For load-balanced cloud applications, a key question is how to distribute the load among VMs in the presence of interference. Using a Markov decision process (MDP) model, we investigate dynamic control polices to assign jobs among a cluster of VMs that are prone to interference in a system with a central queue and an arbitrary number of VMs. We characterize the structural properties of the MDP optimality equation, and we prove that the optimal control policy is a threshold policy based on the queue length. The optimal policy is characterized by multiple thresholds depending on the current conditions of the VMs, including the number of busy under-interference VMs. We discuss the existence of an ordering among such thresholds, and we prove the ordering for a two-VM system. Our numerical results show that the optimal dynamic policy can significantly improve performance compared to the the commonly employed non-idling policy. For low utilization systems, we observe improvements on the order of around 20%. We further implement the optimal policy in a real-world testbed using the HAProxy load balancer, and show that it can reduce web server response times by as much as 40%–60%, even for time-varying request rates.", "venue": "IEEE/ACM International Symposium on Modeling, Analysis, and Simulation On Computer and Telecommunication Systems", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-10-01", "journal": {"name": "2019 IEEE 27th International Symposium on Modeling, Analysis, and Simulation of Computer and Telecommunication Systems (MASCOTS)", "pages": "295-308"}, "authors": [{"authorId": "29858363", "name": "Scott Votke"}, {"authorId": "1395600976", "name": "J. A. Jaleel"}, {"authorId": "49441940", "name": "Amoghavarsha Suresh"}, {"authorId": "2902132", "name": "Mohammad Delasay"}, {"authorId": "3196075", "name": "Sherwin Doroudi"}, {"authorId": "2044504", "name": "Anshul Gandhi"}], "citations": [{"paperId": "ce512e6102ebab257d537e04784472386a961118", "title": "Ah-Q: Quantifying and Handling the Interference within a Datacenter from a System Perspective"}]}
