{"paperId": "d17eff7cc03a80deb5db1ae90dec7347f7b5c88c", "publicationVenue": null, "title": "Applicability Evaluation of Several Spatial Clustering Methods in Spatiotemporal Data Mining of Floating Car Trajectory", "abstract": "Spatial analysis is an important means of mining floating car trajectory information, and clustering method and density analysis are common methods among them. The choice of the clustering method affects the accuracy and time efficiency of the analysis results. Therefore, clarifying the principles and characteristics of each method is the primary prerequisite for problem solving. Taking four representative spatial analysis methods—KMeans, Density-Based Spatial Clustering of Applications with Noise (DBSCAN), Clustering by Fast Search and Find of Density Peaks (CFSFDP), and Kernel Density Estimation (KDE)—as examples, combined with the hotspot spatiotemporal mining problem of taxi trajectory, through quantitative analysis and experimental verification, it is found that DBSCAN and KDE algorithms have strong hotspot discovery capabilities, but the heat regions’ shape of DBSCAN is found to be relatively more robust. DBSCAN and CFSFDP can achieve high spatial accuracy in calculating the entrance and exit position of a Point of Interest (POI). KDE and DBSCAN are more suitable for the classification of heat index. When the dataset scale is similar, KMeans has the highest operating efficiency, while CFSFDP and KDE are inferior. This paper resolves to a certain extent the lack of scientific basis for selecting spatial analysis methods in current research. The conclusions drawn in this paper can provide technical support and act as a reference for the selection of methods to solve the taxi trajectory mining problem.", "venue": "ISPRS Int. J. Geo Inf.", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "ISPRS Int. J. Geo Inf.", "pages": "161", "volume": "10"}, "authors": [{"authorId": "2149052399", "name": "Haoxuan Chen"}, {"authorId": "2052009807", "name": "F. Tao"}, {"authorId": "2068053757", "name": "Pei-long Ma"}, {"authorId": "2148992098", "name": "Li-Na Gao"}, {"authorId": "2087044920", "name": "Tong Zhou"}], "citations": [{"paperId": "e0302d5c6aaeae373b135ed16026368941608b67", "title": "Tempo-categorization of road accident hotspots to enhance the problem diagnosis process and detect hidden hazardous locations"}, {"paperId": "ec67984f50f304f0310f70469015ce5695168cd2", "title": "Using a Sensitivity Analysis and Spatial Clustering to Determine Vulnerability to Potentially Toxic Elements in a Semiarid City in Northwest Mexico"}, {"paperId": "63b3e8c917f0456402f7e5179c995fbac67d7058", "title": "Analysis of the Operation of Industrial Trucks based on Position Data"}]}
