{"paperId": "d181329d7b329bcb9028eef8a76188f8e99a9d58", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Big Data in Smart City: Management Challenges", "abstract": "Smart cities use digital technologies such as cloud computing, Internet of Things, or open data in order to overcome limitations of traditional representation and exchange of geospatial data. This concept ensures a significant increase in the use of data to establish new services that contribute to better sustainable development and monitoring of all phenomena that occur in urban areas. The use of the modern geoinformation technologies, such as sensors for collecting different geospatial and related data, requires adequate storage options for further data analysis. In this paper, we suggest the biG dAta sMart cIty maNagEment SyStem (GAMINESS) that is based on the Apache Spark big data framework. The model of the GAMINESS management system is based on the principles of the big data modeling, which differs greatly from standard databases. This approach provides the ability to store and manage huge amounts of structured, semi-structured, and unstructured data in real time. System performance is increasing to a higher level by using the process parallelization explained through the five V principles of the big data paradigm. The existing solutions based on the five V principles are focused only on the data visualization, not the data themselves. Such solutions are often limited by different storage mechanisms and by the ability to perform complex analyses on large amounts of data with expected performance. The GAMINESS management system overcomes these disadvantages by conversion of smart city data to a big data structure without limitations related to data formats or use standards. The suggested model contains two components: a geospatial component and a sensor component that are based on the CityGML and the SensorThings standards. The developed model has the ability to exchange data regardless of the used standard or the data format into proposed Apache Spark data framework schema. The verification of the proposed model is done within the case study for the part of the city of Novi Sad.", "venue": "Applied Sciences", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-05-17", "journal": {"name": "Applied Sciences", "pages": "4557", "volume": "11"}, "authors": [{"authorId": "51191101", "name": "Mladen Amovic"}, {"authorId": "2586329", "name": "M. Govedarica"}, {"authorId": "3330337", "name": "A. Radulovic"}, {"authorId": "2121662046", "name": "Ivana Janković"}], "citations": [{"paperId": "4b8f1e9dae7c035631ae7cac11109adb537175ce", "title": "Extending 3D geometric file formats for geospatial applications"}, {"paperId": "69e8c5d46e7447a78728fda863684bc62b06e8cd", "title": "Semantic 3D city interfaces—Intelligent interactions on dynamic geospatial knowledge graphs"}, {"paperId": "e09778a0dc7d59f99c863a26404f3caeea4dae35", "title": "A vehicle license plate data access model based on the jump hash consistency algorithm"}, {"paperId": "31d28a4f2367de8072fdaa910a94e9c3ed16cda2", "title": "Big Data Reference Architecture Standards: Analysis and Presenting a Development Road Map"}, {"paperId": "ab417d6fb92267f45ca14849ae8749e5561e9bd1", "title": "Building resilience into smart mobility for urban cities: an emerging economy perspective"}, {"paperId": "5e16eaaf50b7991dc138272575cb78348e9ceb77", "title": "TOWARD SUSTAINABLE SMART CITIES: CONCEPTS & CHALLENGES"}, {"paperId": "3f4705bb04cdc8eb4d0c7840f951c5b547ae4355", "title": "Analysis of Government Public Management Information Service and Computer Model Construction Based on Smart City Construction"}, {"paperId": "3c0eee84b216453f215819f2fb4006d7abd675e8", "title": "Antecedents and Consequences of Digital Entrepreneurial Ecosystems in the Interaction Process with Smart City Development"}, {"paperId": "e16917c5aba0e003c7bfbe4607c15f8de186d158", "title": "Synthetic Pedestrian Routes Generation: Exploring Mobility Behavior of Citizens through Multi-Agent Reinforcement Learning"}, {"paperId": "d879d112afc00f579a5b3f535e35503f4d98d70a", "title": "Implementation of the internet of things on smart posters using near field communication technology in the tourism sector"}]}
