{"paperId": "d183f7b0244b7d750164580d843f05198aeb1a1d", "publicationVenue": null, "title": "Estimation of Waste Battery Generation and Analysis of the Waste Battery Recycling System in China", "abstract": "China produces and consumes a large amount of batteries annually, which leads to many waste batteries needing to be recycled. The collection and recycling system of primary, alkaline secondary, and lithium‐ion secondary batteries in China is particularly poor, and waste battery recycling enterprises generally sustain economic losses if they solely use waste batteries as raw materials. Increasing the profits of waste battery recycling systems is a key problem that needs to be considered. This article quantitatively analyzes waste battery generation in China by using annual sales data and probable lifetime distribution of various batteries. The results show that the rapid growth of battery usage has led to an increased generation of waste batteries and the percentage of different types of waste batteries is changing over time. In 2013, the total quantity of all waste batteries in the medium lifetime scenario reached 570 kilotons, of which primary, alkaline secondary, and lithium‐ion secondary waste batteries accounted for approximately 36%, 28%, and 35%, respectively. Based on a real‐world case study of a typical domestic waste battery recycling enterprise in China, material flow analysis and cost‐benefit analysis were conducted to study the development of the recycling process of comingled waste batteries. Through scenario analysis, we conclude that increasing the use of waste batteries as raw materials and the recycling of other materials that are less valuable reduces the profits of the waste battery recycling enterprise. Higher profits can be achieved by adding the production of high value‐added downstream products and government support. At the same time, the essential role of the government in developing a waste battery recycling system was identified. Finally, relevant suggestions are made for improvements in both the government and enterprise sectors.", "venue": "", "year": 2017, "fieldsOfStudy": ["Environmental Science"], "publicationTypes": null, "publicationDate": "2017-02-01", "journal": {"name": "Journal of Industrial Ecology", "volume": "21"}, "authors": [{"authorId": "2788719", "name": "Xiaoxu Song"}, {"authorId": "2434982", "name": "Shanying Hu"}, {"authorId": "6568030", "name": "Dingjiang Chen"}, {"authorId": "13173660", "name": "Bing Zhu"}], "citations": [{"paperId": "9f8e4b576f8b4de0aef582f40dc308c2a2c1947d", "title": "Preparation of degradable polycarbonate from low boiling point organic matter of waste electrolyte"}, {"paperId": "bcc868c2262a755acff6dc18adaf3c9ffd8e3e6f", "title": "A battery value chain independent of primary raw materials: Towards circularity in China, Europe and the US"}, {"paperId": "ca327ba62fb0e55482049a0121a5c8ccf41501e6", "title": "The limitations of end-of-life copper recycling and its implications for the circular economy of metals"}, {"paperId": "3f9074767f7c62431fdc4c5e88cc49940c12f9b3", "title": "Impact of cobalt recycling on China's electrification process: Assessing the potential reduction in cobalt demand from battery recycling"}, {"paperId": "f9a4f6e2941d893f9ff2cc3b5ed8c558a967a073", "title": "Recycling valuable materials from the cathodes of spent lithium-ion batteries: A comprehensive review"}, {"paperId": "ded634b0550fcdf9ad7ab8d5cb2ccb2d4dc42e9a", "title": "Bir Kamu Kurumunda Sıfır Atık Yönetim Sistemi Uygulamasının Değerlendirilmesi"}, {"paperId": "41324483038966e2ca35db2503443ac88142b478", "title": "Systematic review of circular economy strategy outcomes in the automobile industry"}, {"paperId": "644350d83e173dd038c5abfbdcb120d04e2c5ac4", "title": "Lithium‐based batteries, history, current status, challenges, and future perspectives"}, {"paperId": "078a80880192b7876309ddb6fecf93fa4792d122", "title": "A review of research in the Li-ion battery production and reverse supply chains"}, {"paperId": "814db629bf1107c0df1a24ca076bad6958e92bdf", "title": "Circular economy conceptualization for lithium-ion batteries- Material procurement and disposal process"}, {"paperId": "02e38fb1854d60a4797f78abaca612db07f4023d", "title": "Uncovering the key features of gold flows and stocks in China"}, {"paperId": "ea822e5b4669aec9d9a9e2759bc9cc6c12cf7c25", "title": "Material Flow Analysis in WEEE Management for Circular Economy: A Content Review on Applications, Limitations, and Future Outlook"}, {"paperId": "fb8b8c9aa7b36ac77149a810db4bc6a54a388888", "title": "Co-products recovery does not necessarily mitigate environmental and economic tradeoffs in lithium-ion battery recycling"}, {"paperId": "44e19735e3c029fd475a71f76206997db79beeef", "title": "Waste Leds in China: Generation Estimation and Potential Recycling Benefits"}, {"paperId": "a8b69483f83c484341b25acddf35c69582d2dec3", "title": "Critical Metal Requirement for Clean Energy Transition: A Quantitative Review on the Case of Transportation Electrification"}, {"paperId": "b0c82cb96828d2ad93d66803e2c4ac9174f56150", "title": "Sustainable Circular Economy for the Integration of Disadvantaged People: A Preliminary Study on the Reuse of Lithium-Ion Batteries"}, {"paperId": "bc0201b2eac21d3ad630a88c63dabad22872558f", "title": "A critical review of the circular economy for lithium-ion batteries and photovoltaic modules – status, challenges, and opportunities"}, {"paperId": "3f3df57b24f078f80477907455d6d1f110485dbe", "title": "Analysis on the Optimal Recycling Path of Chinese Lead-Acid Battery under the Extended Producer Responsibility System"}, {"paperId": "1baff2c5943997a8e596963661dfd9a0de5e90eb", "title": "Multi-data source-based recycling value estimation of wasted domestic electrical storage water heater in China."}, {"paperId": "c4c62139a5dec31db39f574fbbde3221ebf7704c", "title": "Transformation of recovered cobalt from lithium-ion batteries into zeolitic imidazolate framework-67"}, {"paperId": "81df93847ae21af07da12c052b2054d220e6e50b", "title": "Transformation of recovered cobalt from lithium-ion batteries into zeolitic imidazolate framework-67"}, {"paperId": "0911e17974618137c7d51c7bfbd61cebb9360ad3", "title": "Exploring the EPR system for power battery recycling from a supply-side perspective: An evolutionary game analysis."}, {"paperId": "d8f2eb2a3a25c436b80c4d4c4678ca3016a272fa", "title": "Metal Leaching from Lithium-ion and Nickel-metal Hydride Batteries and Photovoltaic Modules in Simulated Landfill Leachates and Municipal Solid Waste Materials"}, {"paperId": "d22285793c168fb0b591fa5b58d39f897fd80765", "title": "Evaluating environmental impacts and economic performance of remanufacturing electric vehicle lithium-ion batteries"}, {"paperId": "011934c373a39d2f8425826c6ddcb79397439aba", "title": "Circular economy of Li Batteries: Technologies and trends"}, {"paperId": "ab2778404da6b71b2ac9f653bf84f630d3d20a1f", "title": "Uncovering the in-use metal stocks and implied recycling potential in electric vehicle batteries considering cascaded use: a case study of China"}, {"paperId": "d65e777206153ad27925f7ef285cf644172a56df", "title": "Used Batteries in the Municipal Solid Waste Stream: Management of the Challenges and Heavy Metal Contents"}, {"paperId": "59d9c341988c760c26bccb9f9bfa2a005ec48503", "title": "Recycling and environmental issues of lithium-ion batteries: Advances, challenges and opportunities"}, {"paperId": "3b61592624b989728d5dd59b54b15e3f934b0a74", "title": "Dynamic material flow analysis of critical metals for lithium-ion battery system in China from 2000–2018"}, {"paperId": "df71a505834b72eb97a17a57ff35c368ee6c0a8b", "title": "Effect of technological developments for smartphone lithium battery on metal-derived resource depletion and toxicity potentials"}, {"paperId": "3a28e50cbcf8af6c279280e4daa633720af1bd5e", "title": "Development of Enhancing Battery Management for Reusing Automotive Lithium-Ion Battery"}, {"paperId": "53c6f75939bdc0f0efd25f3450a8782990411b62", "title": "Progress and Challenges on Battery Waste Management :A Critical Review"}, {"paperId": "2c9bc543fbf1fd748f6e0de8feb3a484847c72b3", "title": "A review of sustainable e-waste generation and management: Present and future perspectives."}, {"paperId": "39fcdb059c711b9d9e788c9fc51a9f07ee630656", "title": "Using yeast to sustainably remediate and extract heavy metals from waste waters"}, {"paperId": "9e349e330762fa5b7481c2ff2bb460743f296ecb", "title": "Environmental and economic evaluation of remanufacturing lithium-ion batteries from electric vehicles."}, {"paperId": "55c4f2e9021e0ba44819f0969371962243763ef4", "title": "E-waste in Australia: Generation estimation and untapped material recovery and revenue potential"}, {"paperId": "da6852da31f4062487a62eacd32361cdb6e680ad", "title": "Battery-Free Smart Objects Based on RFID Backscattering"}, {"paperId": "82a7ac311b74edf55443510384cb8e718f81a062", "title": "Material flow analysis (MFA) as a strategic tool in E-waste management: Applications, trends and future directions."}, {"paperId": "ed1e995fe278ce8b9d3492142b91d0691ec3b9f2", "title": "Adaptive Communication for Battery-Free Devices in Smart Homes"}, {"paperId": "1e1a63baa999d07457003281e72f0f6ad1245b41", "title": "Study of energy storage systems and environmental challenges of batteries"}, {"paperId": "9a79bc8cbc71b58a2db4bcef31184b3589c52573", "title": "Material flow analysis on critical raw materials of lithium-ion batteries in China"}, {"paperId": "201d02b07ef54ad769ceb7b350a12f9f47ef04cd", "title": "Temperature effect and thermal impact in lithium-ion batteries: A review"}, {"paperId": "a78b7ae696c926babb6ca4d9fcb33c31dfd561e4", "title": "Application of Material Flow Analysis (MFA) in Electronic Waste (E-Waste) Management: A Review"}, {"paperId": "521f6e268dc6ca15a5761e65b9a2f02cdde45bfc", "title": "An integrated method of life-cycle assessment and system dynamics for waste mobile phone management and recycling in China"}, {"paperId": "33b3dfca7cbd97a21069f4fc49ef958c7a46ce11", "title": "Modelling the correlations of e-waste quantity with economic increase."}, {"paperId": "5c43d3e1d26a5188ddd772ab819b407e49cb799d", "title": "Portable battery lifespans and new estimation method for battery collection rate based on a lifespan modeling approach"}, {"paperId": "406e71a69c508d5c36e1df27c19152945d60f5fa", "title": "Challenges, Solutions and Future Trends in EV-Technology: A Review"}, {"paperId": "dd89f7ba5e046fdb0baf7a21ea912f6600ce03ed", "title": "Optimising the geospatial configuration of a future lithium ion battery recycling industry in the transition to electric vehicles and a circular economy"}, {"paperId": "fa0aa8fc8876072addea2dae4f58ce11ea3cd7a4", "title": "Electronic waste in the Caribbean: An impending environmental disaster or an opportunity for a circular economy?"}, {"paperId": "1c43f73c603c5643e57ce438564d51c8ef9bd545", "title": "Wastewater Technologies and Environmental Treatment: Proceedings of the ICWTET2020"}, {"paperId": "9cf3e20e40d352167142902b5202d67457b4d2e6", "title": "Development of disaggregated energy use and greenhouse gas emission footprints in Canada’s iron, gold, and potash mining sectors"}, {"paperId": "d1cfcf1b804e2394188d8006344a1994c9091151", "title": "Assessing the recycling potential of “unregulated” e-waste in Australia"}, {"paperId": "6c1ba140f0bbbb0fabe669deb8c5c2ad0f300795", "title": "Exploring EV Battery Secondary Life Business models and Reverse Logistic perspectives"}, {"paperId": "3073657085d6fdb11c7303f66aaaf5c4c7bccd78", "title": "Recycling Zinc from Alkaline batteries - Recovering Zinc from 1,5V AA alkaline batteries through hydrometallurgical techniques"}]}
