{"paperId": "d18e7bc2403cc86bd160618c6686b5a826356fdf", "publicationVenue": {"id": "a25f0f0c-6f67-4e9b-8f42-ffddbf2b3f55", "name": "Journal of Gastroenterology and Hepatology", "type": "journal", "alternate_names": ["J Gastroenterol Hepatol"], "issn": "0815-9319", "url": "http://onlinelibrary.wiley.com/journal/10.1111/(issn)1440-1746", "alternate_urls": ["http://onlinelibrary.wiley.com/journal/10.1111/(ISSN)1440-1746/homepage/Society.html", "https://onlinelibrary.wiley.com/journal/14401746"]}, "title": "Noninvasive early diagnosis of intestinal diseases based on artificial intelligence in genomics and microbiome", "abstract": "The maturing development in artificial intelligence (AI) and genomics has propelled the advances in intestinal diseases including intestinal cancer, inflammatory bowel disease (IBD), and irritable bowel syndrome (IBS). On the other hand, colorectal cancer is the second most deadly and the third most common type of cancer in the world according to GLOBOCAN 2020 data. The mechanisms behind IBD and IBS are still speculative. The conventional methods to identify colorectal cancer, IBD, and IBS are based on endoscopy or colonoscopy to identify lesions. However, it is invasive, demanding, and time‐consuming for early‐stage intestinal diseases. To address those problems, new strategies based on blood and/or human microbiome in gut, colon, or even feces were developed; those methods took advantage of high‐throughput sequencing and machine learning approaches. In this review, we summarize the recent research and methods to diagnose intestinal diseases with machine learning technologies based on cell‐free DNA and microbiome data generated by amplicon sequencing or whole‐genome sequencing. Those methods play an important role in not only intestinal disease diagnosis but also therapy development in the near future.", "venue": "Journal of Gastroenterology and Hepatology", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-04-01", "journal": {"name": "Journal of Gastroenterology and Hepatology", "pages": "823 - 831", "volume": "36"}, "authors": [{"authorId": "2108190244", "name": "Weitong Zhang"}, {"authorId": "6733309", "name": "Xingjian Chen"}, {"authorId": "37063249", "name": "Ka-chun Wong"}], "citations": [{"paperId": "6f56ea38ba2b9a5484f8d1f38285647306ffbfab", "title": "Blood miRNAs miR-549a, miR-552, and miR-592 serve as potential disease-specific panels to diagnose colorectal cancer"}, {"paperId": "30ea00061b202ab35f68714477429ffa41362dd5", "title": "Advances in Machine Learning Processing of Big Data from Disease Diagnosis Sensors."}, {"paperId": "3416a38727ad5ea33328f2b6b8652aeda6b46f51", "title": "Applications of Machine Learning (ML) and Mathematical Modeling (MM) in Healthcare with Special Focus on Cancer Prognosis and Anticancer Therapy: Current Status and Challenges"}, {"paperId": "030785c3b327e91622a631aeefb8e430719ad738", "title": "Cancer Detection in Lungs Using Image Processing and Liquid Biopsy Analysis"}, {"paperId": "4cf6ad4baf905ec509d670edcffc15268fec3530", "title": "Functional profile of host microbiome indicates Clostridioides difficile infection"}, {"paperId": "934a72b81f24a096112a73d71112f8909c0a68b0", "title": "The diagnostic potential and barriers of microbiome based therapeutics"}, {"paperId": "3bf4f0e4e40e2bdaaa74a62f9a7cdcbb05db141e", "title": "Dynamic Network Construction for Identifying Early Warning Signals Based On a Data-Driven Approach: Early Diagnosis Biomarker Discovery for Gastric Cancer"}, {"paperId": "bfaf25937dfe75144153bccfcb78fdd3517c8a01", "title": "Coronary Atherosclerotic Disease and Cancer: Risk Factors and Interrelation"}, {"paperId": "0f9992a5f61610407eafbd7573abc18795060e83", "title": "Development of artificial intelligence technology in diagnosis, treatment, and prognosis of colorectal cancer"}, {"paperId": "4669d57d6e9d8e38f19512332ecd442ec7455134", "title": "Digital Storage Method of Enterprise Financial Files Based on Artificial Intelligence"}, {"paperId": "3e6693abdddc59b8e96c903bc7765672f91550db", "title": "Machine Learning Protocols in Early Cancer Detection Based on Liquid Biopsy: A Survey"}, {"paperId": "68f171a7ec94b9c534c7000647cdb4bb5bc31dcb", "title": "Towards Indonesian genbank: A framework for repository and discovery for nucleotide sequences in Indonesia"}]}
