{"paperId": "d1944ebd913fbf29cc203d7d4f5b463ad7f86437", "publicationVenue": {"id": "5b26ab82-c479-4e8c-bb9f-c59f4941b57f", "name": "International Conference on Control, Mechatronics and Automation", "type": "conference", "alternate_names": ["International Conference Control, Mechatronics and Automation", "Int Conf Control Mechatronics Autom", "ICCMA"]}, "title": "Banking in Terms of Deposit Prediction Based on Machine Learning and Big Data Analytics", "abstract": "The rapid emergence and evolution of the Internet of Things has increased the amount of data that banks collect. Due to the volume of information, analytical tools are being used to improve the customer experience and make informed decisions. Classification and prediction are two of the most critical factors that banks need to consider when it comes to providing effective and efficient services to their customers. In this paper, we present a framework that combines the capabilities of machine learning (ML) and big data analytics on bank marketing data. For ML methods, we used logistic regression, support vector machine, k nearest neighbor, decision tree, and random forest, whereas for big data analysis method, we used PySpark with ML libraries to analyze the data. The results of the study revealed that the PySpark framework provides a faster time-to-value compared to other ML algorithms. It also uses distributed computing power, which is ideal for big data applications.", "venue": "International Conference on Control, Mechatronics and Automation", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-11-01", "journal": {"name": "2023 11th International Conference on Control, Mechatronics and Automation (ICCMA)", "pages": "69-74"}, "authors": [{"authorId": "2217227114", "name": "Nourah Alessa"}, {"authorId": "2217227121", "name": "Amal Majdua"}, {"authorId": "2067184038", "name": "S. Alshehri"}, {"authorId": "2224167185", "name": "Maryam Alhawiti"}, {"authorId": "2257043393", "name": "Resan Aljohani"}, {"authorId": "2277556453", "name": "A'aeshah Alhakamy"}], "citations": []}
