{"paperId": "d1b6ff418b4cfaab542b9c39dae20c44e374eac0", "publicationVenue": {"id": "c0dcc279-b0e8-4b1b-96d2-eff72a19624e", "name": "Semantics and Pragmatics", "type": "journal", "alternate_names": ["Semant Pragmat"], "issn": "1937-8912", "url": "http://semprag.org/"}, "title": "Using the Anna Karenina Principle to explain why cause favors negative-sentiment complements", "abstract": "This paper sets out to explain why the verb cause tends to occur with negative-sentiment complements ( cause damage, cause problems ), as observed by Stubbs (1995). Formalized using causal models (Pearl 2000, Halpern & Pearl 2005, Schulz 2011), the analysis hinges on the asymmetric inference patterns licensed by necessary versus sufﬁcient causes in the common scenario where some variables in a causal model remain uncertain. States of certainty/uncertainty are captured by subdividing the traditional deﬁnitions of necessity and sufﬁciency into a local version (all other variables ﬁxed at particular values) and a global version (all other variables unsettled). C causes E is argued to entail that C is locally sufﬁcient for E , and to implicate that C is at least possibly locally necessary for E . With this deﬁnition, it is shown that C causes E can be truthfully applied to more uncertain contexts when C is a globally sufﬁcient cause of E rather than a globally necessary one. Cause thus tends to occur with outcomes depending on a single globally sufﬁcient cause — outcomes which are moreover shown to be negative in sentiment, reﬂecting the independently motivated “Anna Karenina Principle” that bad outcomes tend to require single sufﬁcient causes, thus indirectly explaining why cause prefers negative-sentiment complements. The meaning and collocational sentiment of cause are used to illuminate one another.", "venue": "Semantics and Pragmatics", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-10-18", "journal": {"name": "Semantics and Pragmatics"}, "authors": [{"authorId": "2260456627", "name": "Lelia Glass"}], "citations": []}
