{"paperId": "d1c452686238e8bccd8261bb3e2f4f3db5d11703", "publicationVenue": {"id": "7fca7065-fa6f-490b-923e-3ffc07857f1c", "name": "IEEE Transactions on Cloud Computing", "type": "journal", "alternate_names": ["IEEE Trans Cloud Comput"], "issn": "2168-7161", "url": "https://www.computer.org/web/tcc", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6245519"]}, "title": "Online Performance Modeling and Prediction for Single-VM Applications in Multi-Tenant Clouds", "abstract": "Clouds have been adopted widely by many organizations for their supports of flexible resource demands and low cost, which is normally achieved through sharing the underlying hardware among multiple cloud tenants. However, such sharing with the changes in resource contentions in virtual machines (VMs) can result in large variations for the performance of cloud applications, which makes it difficult for ordinary cloud users to estimate the run-time performance of their applications. In this article, we propose online learning methodologies for performance modeling and prediction of applications that run repetitively on multi-tenant clouds (such as on-line data analytic tasks). Here, a few micro-benchmarks are utilized to probe the in-situ perceivable performance of CPU, memory and I/O components of the target VM. Then, based on such profiling information and in-place measured application’s performance, the predictive models can be derived with either Regression or Neural-Network techniques. In particular, to address the changes in the intensity of resource contentions of a VM over time and its effects on the target application, we proposed periodic model retraining where the sliding-window technique was exploited to control the frequency and historical data used for model retraining. Moreover, a progressive modeling approach has been devised where the Regression and Neural-Network models are gradually updated for better adaptation to recent changes in resource contention. With 17 representative applications from PARSEC, NAS Parallel and CloudSuite benchmarks being considered, we have extensively evaluated the proposed online schemes for the prediction accuracy of the resulting models and associated overheads on both a private and public clouds. The evaluation results show that, even on the private cloud with high and radically changed resource contention, the average prediction errors of the considered models can be less than 20 percent with periodic retraining. The prediction errors generally decrease with higher retraining frequencies and more historical data points but incurring higher run-time overheads. Furthermore, with the neural-network progressive models, the average prediction errors can be reduced by about 7 percent with much reduced run-time overheads (up to 265X) on the private cloud. For public clouds with less resource contentions, the average prediction errors can be less than 4 percent for the considered models with our proposed online schemes.", "venue": "IEEE Transactions on Cloud Computing", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-01-01", "journal": {"name": "IEEE Transactions on Cloud Computing", "pages": "97-110", "volume": "11"}, "authors": [{"authorId": "153889781", "name": "Hamidreza Moradi"}, {"authorId": "47825073", "name": "Wen Wang"}, {"authorId": "1721468", "name": "Dakai Zhu"}], "citations": [{"paperId": "4b552b5da8fd97c36aef59c0798af5b2803ed98d", "title": "Optimization Strategy Analysis of Intelligent Product Service System Based on Computer Simulation Technology"}, {"paperId": "f390b7e72f5fb6ebb7e6b8eaefc3ba227e2ded2d", "title": "Cloud White: Detecting and Estimating QoS Degradation of Latency-Critical Workloads in the Public Cloud"}, {"paperId": "92f776ef44695f47014918bfd89e0efb7ea50ca4", "title": "Performance Health Index for Complex Cyber Infrastructures"}]}
