{"paperId": "d1c944a71d00dbb984dc086a85b245c3596d65d9", "publicationVenue": {"id": "b4b9c2ab-3b92-4da7-a4ae-26c8247300d0", "name": "International Conference on Wireless Communications and Mobile Computing", "type": "conference", "alternate_names": ["IWCMC", "Int Conf Wirel Commun Mob Comput"], "url": "http://iwcmc.com/"}, "title": "A Survey on Securing 6G Wireless Communications based Optimization Techniques", "abstract": "The increasing number of applications and devices in the Sixth-generation (6G) networks and the diversity of mobile data, architectures, and technologies make security and privacy a critical concern. Advanced metaheuristics algorithms (MHAs) have recently become a viable solution for optimizing security and privacy in wireless networks, combining game theory and convex optimization, and several other advanced models. As a subfield of Artificial Intelligence (AI), MHAs are inspired by concepts from Evolutionary Algorithms (EAs), Trajectory-based Algorithms (TAs), and Swarm Intelligence (SI). Recent implementations of MHAs in the 6G networks have effectively solved complex security and privacy problems. This study examines MHAs’ utilization in addressing security and privacy challenges in 6G networks. The paper provides a comprehensive overview of MHAs and their use in solving security and privacy problems in 6G. The current limitations of the literature are also identified, and avenues for further research are suggested. The reader will have a clear image of the needed technologies and tools for securing 6G networks using MHAs.", "venue": "International Conference on Wireless Communications and Mobile Computing", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-06-19", "journal": {"name": "2023 International Wireless Communications and Mobile Computing (IWCMC)", "pages": "216-223"}, "authors": [{"authorId": "103753050", "name": "A. Abasi"}, {"authorId": "2131706", "name": "Moayad Aloqaily"}, {"authorId": "1413981295", "name": "B. Ouni"}, {"authorId": "2065439840", "name": "M. Guizani"}, {"authorId": "145118318", "name": "M. Debbah"}, {"authorId": "1696863", "name": "F. Karray"}], "citations": [{"paperId": "9da03b3fb1891a6d5175d6efa41fce2425c76e4f", "title": "Metaheuristic algorithms for 6G wireless communications: Recent advances and applications"}]}
