{"paperId": "d1cd1a159f5a2af9d0cf3afe4522095864a9be40", "publicationVenue": {"id": "47ee480e-9ef9-480e-86e1-bd7187dc7ad4", "name": "International Journal of Engineering and Advanced Technology", "type": "journal", "alternate_names": ["Int J Eng Adv Technol"], "issn": "2249-8958", "url": "https://www.ijeat.org/"}, "title": "Indexing and Optimization Techniques in Biomedical Industry", "abstract": "The unpredictable amount of data generated everyday by smart phones, social networks, health care systems etc. is really mind blowing. Smart phones alone generate 335exabytes of data ineveryyear that is really big data.Thus, the storage industry is facing several challenges in providing high magnitude of storage and retrieval devices at lowest costs which help to fulfill the requirements of big data and even technologies like de-duplication on storage devices are also becoming very important. Similarly, in recent days storing and retrieving the health care information in biomedical area is also becoming a great challenge in providing the best optimum data because of its huge amount of biomedical datasets. In order to achieve efficiency in providing highest quality health care information, an optimized index scheme is needed for big data which is based on accuracy and timelines. The existing indexing and optimization solutions are not enough to meet the emerging grow of index size and seek time. The objective of this paper is to identify better indexing solutions by investigating the basic big data requirements on indexing and optimization. This also includes a comparative study of various indexing and optimization techniques along with a taxonomy which contains Artificial Intelligence (AI) and Non Artificial Intelligence (NAI) based indexing techniques, optimization enhancement techniques which improves the performance efficiency of big data health care informatics.", "venue": "International Journal of Engineering and Advanced Technology", "year": 2019, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2019-08-30", "journal": {"name": "International Journal of Engineering and Advanced Technology"}, "authors": [{"authorId": "2285569553", "name": "Gladiss Merlin N.R"}, {"authorId": "2088807004", "name": "V. Prem"}], "citations": []}
