{"paperId": "d1f08990e3776906f1d5169d98e24fef2e0bf2ac", "publicationVenue": {"id": "0dc0e794-53db-401d-bd8f-8da9165b2865", "name": "International Conferences on Contemporary Computing and Informatics", "type": "conference", "alternate_names": ["IC3I", "Int Conf Contemp Comput Informatics"]}, "title": "Automatic Identification of Vehicles in Traffic using Smart Cameras", "abstract": "In this research, a smart camera that can be used for monitoring public transit and for law enforcement purposes is discussed. Since we are conducting an academic review of already published material, we will begin with some background information. What follows is a comprehensive breakdown and analysis of the smart camera, including a discussion of its individual components, how they work together to detect and identify specific automobile attributes automatically, and overall performance. Also included is a discussion of how the smart camera works. The system's most impressive qualities are its intelligent make and model recognition (MMR), licence plate recognition (LPR), and colour recognition (CR) capabilities. Their flowcharts, deployments, and recognition rates are all analyzed and documented for future reference. In addition to this, we take into account MMR's two primary rivals, bag-of-features and scalable vocabulary tree, as well as a third technique known as pyramid match. In the conclusion, we analyze the overall efficacy of the smart camera system and make some suggestions for how it could be improved in the future.", "venue": "International Conferences on Contemporary Computing and Informatics", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference", "Review"], "publicationDate": "2022-12-14", "journal": {"name": "2022 5th International Conference on Contemporary Computing and Informatics (IC3I)", "pages": "1009-1014"}, "authors": [{"authorId": "2288813666", "name": "Venkata Satya"}, {"authorId": "2288645905", "name": "Rahul Kosuru"}, {"authorId": "2056974475", "name": "Neha Garg"}, {"authorId": "2196451042", "name": "Ashwin Kavasseri Venkitaraman"}, {"authorId": "2288660363", "name": "Dr. Aln Rao"}, {"authorId": "145514726", "name": "V. Chaudhari"}, {"authorId": "2062802449", "name": "A. Deepak"}], "citations": []}
