{"paperId": "d1f3a77f52bbef5f5682563b05b8802ca2556474", "publicationVenue": null, "title": "Research on the strategy of locating abnormal data in IOT management platform based on improved modiﬁed particle swarm optimization convolutional neural network algorithm", "abstract": "The IOT management platform is used to handle and transmit data from many types of power system terminal devices. The current IOT management platform has a low data processing eﬃciency and a high mistake rate when it comes to ﬁnding anomalous data. Furthermore, the eﬀective selection and optimum decision of the convolutional neural network’s structural parameters has a signiﬁcant impact on prediction performance. Based on this, the paper proposes a decision algorithm for locating anomalous data in an IOT integrated management platform using a convolutional neural network (CNN) and a global optimization decision of key structural parameters of a convolutional neural network using an improved particle swarm optimization (APSO) algorithm. First, an index model is created to determine if the data retrieved from the IOT management platform is anomalous or not. Second, the structure of the convolutional neural network-based decision method for ﬁnding anomalous data is examined. Following that, an enhanced particle swarm optimization technique is developed to optimize the structural parameters of the convolutional neural network, and an APSO-CNN with improved performance for anomalous data localization is generated. Finally, the established algorithm’s correctness, feasibility, and eﬃcacy were evaluated using the Adam optimizer. The results reveal that the established APSO-CNN-based decision algorithm for anomaly data localization oﬀers considerable beneﬁts in terms of accuracy and running time, with extremely interesting application potential.", "venue": "", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "2143859870", "name": "Yuan-Kai Liu"}, {"authorId": "2146263757", "name": "Qiang Li"}, {"authorId": "2093549046", "name": "Dingwen Cai"}, {"authorId": "151481228", "name": "Weizhi Lu"}, {"authorId": "2286125901", "name": "Liu Yuan"}, {"authorId": "2286153355", "name": "丨. Li"}, {"authorId": "2286153512", "name": "丨. C. Di"}, {"authorId": "2286162737", "name": "丨. L. Weizhi"}], "citations": [{"paperId": "dfcb64b0ce259b1a2ca54c37b19c389b3b1672b4", "title": "Medical Image Classifications Using Convolutional Neural Networks: A Survey of Current Methods and Statistical Modeling of the Literature"}, {"paperId": "d1d8b668a9f0fe20bdc33734ad5255dcc22086c7", "title": "An IoT-based English translation and teaching using particle swarm optimization and neural network algorithm"}, {"paperId": "aae0677e1df71fbdaade8f76934f75c9b7f0919f", "title": "A New Hybrid Model for Classifying Cardiac Arrhythmias Using Convolutional Neural Networks and Particle Swarm Optimization"}, {"paperId": "67c3536bc803dd7b00f0506986f6553ac2668d2a", "title": "A Comparison of Predictive Models for Rice Imports in Iraq: Artificial Neural Networks vs. Traditional Techniques"}]}
