{"paperId": "d1f940502b9104bf576114287f570f43333657e1", "publicationVenue": {"id": "e0174555-0649-4c3e-b2d8-519443892039", "name": "International Conference on Artificial Intelligence and Soft Computing", "type": "conference", "alternate_names": ["Int Conf Artif Intell Soft Comput", "ICAISC"], "url": "http://www.wikicfp.com/cfp/program?id=1277"}, "title": "Smart and Secure IoT based Remote Real-Time Radiation Detection and Measurement System", "abstract": "This paper proposes a secure internet of things (IoT) based smart radiation detection and measurement system. The Waspmote platform is utilized to build an intelligent IoT station that communicates over 3rd Generation (3G) cellular communication for transferring data to the cloud without redundancy. The IoT radiations monitoring station is enabled with an advanced encryption standard (AES) 256-bit algorithm for onboard data encryption and transfer of the message securely. The message is then stored in the same encrypted form over the cloud to ensure security and privacy. Moreover, the website is developed to decrypt and display as per user input, whether real-time or historical. The experimental results clearly demonstrate the efficiency of the radiation monitoring system with end-to-end data security.", "venue": "International Conference on Artificial Intelligence and Soft Computing", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-01-23", "journal": {"name": "2023 1st International Conference on Advanced Innovations in Smart Cities (ICAISC)", "pages": "1-5"}, "authors": [{"authorId": "144256139", "name": "K. Saleem"}, {"authorId": "2213564303", "name": "Azam Adel Alajroosh"}, {"authorId": "2236511", "name": "R. Ouni"}, {"authorId": "1699827", "name": "W. Mansoor"}, {"authorId": "1736349", "name": "Amjad Gawanmeh"}], "citations": [{"paperId": "41fd65b0dd29fad1cd4318523ef5127b02f763eb", "title": "Wireless Channel Estimation for Low-Power IoT Devices Using Real-Time Data"}]}
