{"paperId": "d1fce634259ca1fbf7275ab1363c4a6e03a0de01", "publicationVenue": {"id": "82901c74-dc2e-4d08-b633-637c7e209284", "name": "Conference on Applications, Technologies, Architectures, and Protocols for Computer Communication", "type": "conference", "alternate_names": ["Conf Appl Technol Archit Protoc Comput Commun", "ACM Special Interest Group on Data Communication", "SIGCOMM", "ACM Spéc Interest Group Data Commun"], "url": "https://en.wikipedia.org/wiki/SIGCOMM"}, "title": "Klotski: Efficient and Safe Network Migration of Large Production Datacenters", "abstract": "This paper presents the design, implementation, evaluation, and deployment of Meta's production network migration system. We first introduce the network migration problem for large-scale production datacenter networks (DCNs). A network migration task at Meta touches as many as hundreds of switches and tens of thousands of circuits per datacenter (DC), and involves physical deployment work on site that can last months. We describe real-world migration challenges, covering complex and evolving DCN architectures and operational constraints. We mathematically formalize the problem of generating efficient and safe migration plans, and exploit the inherent symmetry and locality of DCN topologies to prune the search space. We design an ordering-agnostic compact topology representation to eliminate redundant satisfiability checking, and apply the A* algorithm with a domain-specific priority function to find the optimal plan. Evaluation results on a range of production migration cases show that Klotski reduces the time to find optimal migration plans by up to 381× compared to prior solutions. We hope by introducing the problem and sharing our deployment experience, this work can provide a useful context for network migration in the real world and inspire future research.", "venue": "Conference on Applications, Technologies, Architectures, and Protocols for Computer Communication", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2023-09-01", "journal": {"name": "Proceedings of the ACM SIGCOMM 2023 Conference"}, "authors": [{"authorId": "17763235", "name": "Yihao Zhao"}, {"authorId": "2237107636", "name": "Xiaoxiang Zhang"}, {"authorId": "2115314237", "name": "Hang Zhu"}, {"authorId": "40491375", "name": "Ying Zhang"}, {"authorId": "2270909525", "name": "Zhaodong Wang"}, {"authorId": "2237078884", "name": "Yuandong Tian"}, {"authorId": "8041060", "name": "Alex Nikulkov"}, {"authorId": "2237100113", "name": "Joao Ferreira"}, {"authorId": "2237080638", "name": "Xuanzhe Liu"}, {"authorId": "2149170624", "name": "Xin Jin"}], "citations": []}
