{"paperId": "d1fd69c8237784c8cace3ea7782bd44dcb3895c8", "publicationVenue": {"id": "ccd8e532-73c6-414f-bc91-271bbb2933e2", "name": "Electronics", "type": "journal", "issn": "1450-5843", "alternate_issns": ["2079-9292", "0883-4989"], "url": "http://www.electronics.etfbl.net/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-247562", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-247562", "https://www.mdpi.com/journal/electronics"]}, "title": "Securing a Smart Home with a Transformer-Based IoT Intrusion Detection System", "abstract": "Machine learning (ML)-based Network Intrusion Detection Systems (NIDSs) can classify each network’s flow behavior as benign or malicious by detecting heterogeneous features, including both categorical and numerical features. However, the present ML-based NIDSs are deemed insufficient in terms of their ability to generalize, particularly in changing network environments such as the Internet of Things (IoT)-based smart home. Although IoT devices add so much to home comforts, they also introduce potential risks and vulnerabilities. Recently, many NIDS studies on other IoT scenarios, such as the Internet of Vehicles (IoV) and smart cities, focus on utilizing the telemetry data of IoT devices for IoT intrusion detection. Because when IoT devices are under attack, their abnormal telemetry data values can reflect the anomaly state of those devices. Those telemetry data-based IoT NIDS methods detect intrusion events from a different view, focusing on the attack impact, from the traditional network traffic-based NIDS, which focuses on analyzing attack behavior. The telemetry data-based NIDS is more suitable for IoT devices without built-in security mechanisms. Considering the smart home IoT scenario, which has a smaller scope and a limited number of IoT devices compared to other IoT scenarios, both NIDS views can work independently. This motivated us to propose a novel ML-based NIDS to combine the network traffic-based and telemetry data-based NIDS together. In this paper, we propose a Transformer-based IoT NIDS method to learn the behaviors and effects of attacks from different types of data that are generated in the heterogeneous IoT environment. The proposed method utilizes a self-attention mechanism to learn contextual embeddings for input network features. Based on the contextual embeddings, our method can solve the feature set challenge, including both continuous and categorical features. Our method is the first to utilize both network traffic data and IoT sensors’ telemetry data at the same time for intrusion detection. Experiments reveal the effectiveness of our method on a realistic network traffic intrusion detection dataset named ToN_IoT, with an accuracy of 97.95% for binary classification and 95.78% for multiple classifications on pure network data. With the extra IoT information, the performance of our method has been improved to 98.39% and 97.06%, respectively. A comparative study with existing works shows that our method can achieve state-of-the-art performance on the ToN_IoT dataset.", "venue": "Electronics", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-04", "journal": {"name": "Electronics"}, "authors": [{"authorId": "50468682", "name": "Minxiao Wang"}, {"authorId": "1382752740", "name": "Ning Yang"}, {"authorId": "1849432", "name": "N. Weng"}], "citations": [{"paperId": "70bf37bf42687d93666f6f8dd4614347c08fc3c7", "title": "A Novel Data Preprocessing Model for Lightweight Sensory IoT Intrusion Detection"}, {"paperId": "5536149bf300725376d46ab717057ccf9dc3a594", "title": "CTSF: An Intrusion Detection Framework for Industrial Internet Based on Enhanced Feature Extraction and Decision Optimization Approach"}, {"paperId": "2a1c3df6d5f25aa6cb123e4af8f6e734fff9510a", "title": "IoTGeM: Generalizable Models for Behaviour-Based IoT Attack Detection"}, {"paperId": "01675cbc4b22393f4e60bcd7ef30f48cdb2a037f", "title": "Machine Learning-Based Intrusion Detection for Rare-Class Network Attacks"}, {"paperId": "f6647e36e19440effffae6d1db6c110033ab8775", "title": "Developing an Integrated Framework for Securing Internet of Things Traffic in Smart Cities Using Machine Learning Techniques"}, {"paperId": "c45413963690b7c931d9fe7451d021d44360c659", "title": "An extensive survey of smart agriculture technologies: Current security posture"}]}
