{"paperId": "d202d2936b7495b1c493d94a744f3f4653f6f447", "publicationVenue": {"id": "95d0dda7-5d58-4afd-b59f-315447b81992", "name": "IEEE Communications Surveys and Tutorials", "type": "journal", "alternate_names": ["IEEE Commun Surv Tutor"], "issn": "1553-877X", "url": "http://www.comsoc.org/cst", "alternate_urls": ["http://www.comsoc.org/livepubs/surveys/index.html", "https://ieeexplore.ieee.org/servlet/opac?punumber=7041148", "http://ieeexplore.ieee.org/servlet/opac?punumber=9739"]}, "title": "Edge Video Analytics: A Survey on Applications, Systems and Enabling Techniques", "abstract": "Video, as a key driver in the global explosion of digital information, can create tremendous benefits for human society. Governments and enterprises are deploying innumerable cameras for a variety of applications, e.g., law enforcement, emergency management, traffic control, and security surveillance, all facilitated by video analytics (VA). This trend is spurred by the rapid advancement of deep learning (DL), which enables more precise models for object classification, detection, and tracking. Meanwhile, with the proliferation of Internet-connected devices, massive amounts of data are generated daily, overwhelming the cloud. Edge computing, an emerging paradigm that moves workloads and services from the network core to the network edge, has been widely recognized as a promising solution. The resulting new intersection, edge video analytics (EVA), begins to attract widespread attention. Nevertheless, only a few loosely-related surveys exist on this topic. The basic concepts of EVA (e.g., definition, architectures) were not fully elucidated due to the rapid development of this domain. To fill these gaps, we provide a comprehensive survey of the recent efforts on EVA. In this paper, we first review the fundamentals of edge computing, followed by an overview of VA. EVA systems and their enabling techniques are discussed next. In addition, we introduce prevalent frameworks and datasets to aid future researchers in the development of EVA systems. Finally, we discuss existing challenges and foresee future research directions. We believe this survey will help readers comprehend the relationship between VA and edge computing, and spark new ideas on EVA.", "venue": "IEEE Communications Surveys and Tutorials", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-11-29", "journal": {"name": "IEEE Communications Surveys & Tutorials", "pages": "2951-2982", "volume": "25"}, "authors": [{"authorId": "2089147677", "name": "Renjie Xu"}, {"authorId": "145174829", "name": "S. Razavi"}, {"authorId": "2054765981", "name": "Rong Zheng"}], "citations": []}
