{"paperId": "d2177743e33252be186e1fe131389d28fd1dddf9", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Voltron: Understanding and Exploiting the Voltage-Latency-Reliability Trade-Offs in Modern DRAM Chips to Improve Energy Efficiency", "abstract": "This paper summarizes our work on experimental characterization and analysis of reduced-voltage operation in modern DRAM chips, which was published in SIGMETRICS 2017, and examines the work's significance and future potential. \nWe take a comprehensive approach to understanding and exploiting the latency and reliability characteristics of modern DRAM when the DRAM supply voltage is lowered below the nominal voltage level specified by DRAM standards. We perform an experimental study of 124 real DDR3L (low-voltage) DRAM chips manufactured recently by three major DRAM vendors. We find that reducing the supply voltage below a certain point introduces bit errors in the data, and we comprehensively characterize the behavior of these errors. We discover that these errors can be avoided by increasing the latency of three major DRAM operations (activation, restoration, and precharge). We perform detailed DRAM circuit simulations to validate and explain our experimental findings. We also characterize the various relationships between reduced supply voltage and error locations, stored data patterns, DRAM temperature, and data retention. \nBased on our observations, we propose a new DRAM energy reduction mechanism, called Voltron. The key idea of Voltron is to use a performance model to determine by how much we can reduce the supply voltage without introducing errors and without exceeding a user-specified threshold for performance loss. Our evaluations show that Voltron reduces the average DRAM and system energy consumption by 10.5% and 7.3%, respectively, while limiting the average system performance loss to only 1.8%, for a variety of memory-intensive quad-core workloads. We also show that Voltron significantly outperforms prior dynamic voltage and frequency scaling mechanisms for DRAM.", "venue": "arXiv.org", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-05-08", "journal": {"name": "ArXiv", "volume": "abs/1805.03175"}, "authors": [{"authorId": "2289261", "name": "K. Chang"}, {"authorId": "11827442", "name": "A. G. Yağlıkçı"}, {"authorId": "33801185", "name": "Saugata Ghose"}, {"authorId": "152917671", "name": "Aditya Agrawal"}, {"authorId": "48930807", "name": "Niladrish Chatterjee"}, {"authorId": "2080117084", "name": "Abhijith Kashyap"}, {"authorId": "48893570", "name": "Donghyuk Lee"}, {"authorId": "1397041984", "name": "Mike O'Connor"}, {"authorId": "40016363", "name": "Hasan Hassan"}, {"authorId": "145929920", "name": "O. Mutlu"}], "citations": [{"paperId": "daa311cec5f058de4ba32d1669bccf288840a21e", "title": "Understanding Timing Error Characteristics from Overclocked Systolic Multiply–Accumulate Arrays in FPGAs"}, {"paperId": "98820c023ded308084d49d05b4fc6f797014a15e", "title": "On the Impact of Device-Level Techniques on Energy-Efficiency of Neural Network Accelerators"}, {"paperId": "ea8fa7ef7db074bc2b44812b2868c5b0e4ca3cee", "title": "BurstLink: Techniques for Energy-Efficient Video Display for Conventional and Virtual Reality Systems"}, {"paperId": "5f020fcab6635c5290d3609c419fb8b9bb63027e", "title": "An Experimental Study of Reduced-Voltage Operation in Modern FPGAs for Neural Network Acceleration"}, {"paperId": "ba825479d564496e664a9d7ec31145f1670da6d5", "title": "Aggressive undervolting of FPGAs : power & reliability trade-offs"}, {"paperId": "76ed7e41fabd91a86f5e5dc58688a58f329d31db", "title": "Recent Advances in DRAM and Flash Memory Architectures"}, {"paperId": "5219b25edc5eb64b279fd7e69c49556032e80c22", "title": "Guest Editor"}]}
