{"paperId": "d21bd3e8ccf0b7338e12d3d81eb8ee26cdf4ff48", "publicationVenue": null, "title": "Towards a real-time tool state detection in sheet metal forming processes validated by wear classification during blanking", "abstract": "The potential of data for inline detection of changes in the physical state of sheet metal forming processes has been proven over the last decade. However, with production rates exceeding 300 parts per minute the time available for a workpiece-related processing of sensor data is reduced. Therefore, the analysis of large data sets is outsourced to the cloud taking advantage of the high computing power provided there. But within this cloud-based computing paradigm, the speed of data transmission hinders real-time analysis of data and causes latency between fault detection and its occurrence. To overcome this bottleneck, this study aims to evaluate a data-based monitoring (DBM) approach for estimating process states in high speed sheet metal forming in terms of their suitability for a decentralized analysis at the edge. Thereby, the DBM is evaluated according to the model accuracy and the absolute computing time. In order to quantify these key performance parameters and the applicability of the DBM on edge devices, a classification of 16 wear states during blanking is considered. Based on the key performance parameters, an optimal DBM approach for decentralized analysis is proposed and an empirical formulation is provided to estimate the absolute computing time depending on the computational resources used for data processing.", "venue": "IOP Conference Series: Materials Science and Engineering", "year": 2022, "fieldsOfStudy": ["Physics"], "publicationTypes": ["Conference"], "publicationDate": "2022-05-01", "journal": {"name": "IOP Conference Series: Materials Science and Engineering", "volume": "1238"}, "authors": [{"authorId": "116527090", "name": "C. Kubik"}, {"authorId": "2121194344", "name": "D. Molitor"}, {"authorId": "92744307", "name": "M. Rojahn"}, {"authorId": "2090621", "name": "P. Groche"}], "citations": [{"paperId": "4fb627a682f91c33481b911a092f552465c59b7b", "title": "Image-based feature extraction for inline quality assurance and wear classification in high-speed blanking processes"}, {"paperId": "433415b6cde09b9ce99d1dbd3346e80026ae62ed", "title": "Approaches for Preventing Tool Wear in Sheet Metal Forming Processes"}]}
