{"paperId": "d21d01f9c4058d9b84f37281f1a5778cb18f8ef9", "publicationVenue": {"id": "faae4228-a2f7-40bd-818e-ab1f685df91a", "name": "Forests", "type": "journal", "issn": "1999-4907", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-156829", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-156829", "https://www.mdpi.com/journal/forests"]}, "title": "Forestry Big Data: A Review and Bibliometric Analysis", "abstract": "Due to improved data collection and processing techniques, forestry surveys are now more efficient and accurate, generating large amounts of forestry data. Forestry Big Data (FBD) has become a critical component of the forestry inventory investigation system. In this study, publications on FBD were identified via the Web of Science database, and a comprehensive bibliometric analysis, network analysis, and analysis of major research streams were conducted to present an overview of the FBD field. The results show that FBD research only began nearly a decade ago but has undergone an upswing since 2016. The studies were mainly conducted by China and the US, and collaboration among authors is relatively fragmented. FBD research involved interdisciplinary integration. Among all the keywords, data acquisition (data mining and remote sensing) and data processing (machine learning and deep learning) received more attention, while FBD applications (forecasting, biodiversity, and climate change) have only recently received attention. Our research reveals that the FBD research is still in the infancy stage but has grown rapidly in recent years. Data acquisition and data processing are the main research fields, whereas FBD applications have gradually emerged and may become the next focus.", "venue": "Forests", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-09-22", "journal": {"name": "Forests"}, "authors": [{"authorId": "98055361", "name": "Wen Gao"}, {"authorId": "2160989772", "name": "Quan Qiu"}, {"authorId": "2185999688", "name": "Changyan Yuan"}, {"authorId": null, "name": "Xin Shen"}, {"authorId": "11379229", "name": "Fu-Chun Cao"}, {"authorId": "2155124491", "name": "Guibin Wang"}, {"authorId": "2152582215", "name": "Guangyu Wang"}], "citations": [{"paperId": "0a305060bb3db709c19ea4aba60524f1dd8f8e4f", "title": "Bibliometric study of association rule-market basket analysis"}, {"paperId": "878287c369407b5a2f775f850643ab524ae811c2", "title": "Forest harvest operations productivity forecasting: a decisions tree approach"}, {"paperId": "033c154d9278d9287f153027512d57394aba1099", "title": "Global Bibliometric Analysis of Research on the Application of Biochar in Forest Soils"}, {"paperId": "9eba52a649830386a9f6bed5ae2bf22cb41171af", "title": "Research Hotspots and Frontier Prospects in the Field of Agroforestry Picking Robots in China—Cite Space Bibliographic Analysis"}, {"paperId": "c9c1fa1e56fee08268619694659887a0bfc0c50b", "title": "Screening of Ginkgo Individuals with Superior Growth Structural Characteristics in Different Genetic Groups Using Terrestrial Laser Scanning (TLS) Data"}, {"paperId": "a773e1c9faf67275c62fd7bb776e4513a09e321e", "title": "Optimized Extraction Method of Fruit Planting Distribution Based on Spectral and Radar Data Fusion of Key Time Phase"}, {"paperId": "972bd0e7f8bfc2dda6c6eeb445d64cf014e42ea1", "title": "Ormancılıkta makine öğrenmesi kullanımı"}, {"paperId": "a6598f9da085b4b3aca3966c0cfaa41dd122e2f8", "title": "An Insight into the State of Big Data Research: A Bibliometric Study of Scientific Publications"}, {"paperId": "b198cf787e9c7231354c868de109eb0517fad342", "title": "Data Mining in the Analysis of Tree Harvester Performance Based on Automatically Collected Data"}, {"paperId": "935254c183967afb9eeb304ceac7683426d93783", "title": "Montmorillonite and AgNPs modified corn stalk-based filling material with fire retardancy and antibacterial activity"}]}
