{"paperId": "d21e554f0c636156f6e8ea6e770eacd7d30c4639", "publicationVenue": {"id": "e7c556b0-162f-4c48-9d25-fe3c141f984e", "name": "Big Data and Cognitive Computing", "alternate_names": ["Big Data Cogn Comput"], "issn": "2504-2289", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-1077183", "alternate_urls": ["https://www.mdpi.com/journal/BDCC", "https://www.mdpi.com/journal/BDCC/about", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-1077183"]}, "title": "Cumulative and Rolling Horizon Prediction of Overall Equipment Effectiveness (OEE) with Machine Learning", "abstract": "Nowadays, one of the important and indispensable conditions for the effectiveness and competitiveness of industrial companies is the high efficiency of manufacturing and assembly. These enterprises based on different methods and tools systematically monitor their efficiency metrics with Key Performance Indicators (KPIs). One of these most frequently used metrics is Overall Equipment Effectiveness (OEE), the product of availability, performance and quality. In addition to monitoring, it is also necessary to predict efficiency, which can be implemented with the support of machine learning techniques. This paper presents and compares several supervised machine learning techniques amongst other polynomial regression, lasso regression, ridge regression and gradient boost regression. The aim of this article is to determine the best estimation method for semiautomatic assembly line and large batch size. The case study presented with a real industrial example gives the answer as to which of the cumulative or rolling horizon prediction methods is more accurate.", "venue": "Big Data and Cognitive Computing", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-02", "journal": {"name": "Big Data Cogn. Comput.", "pages": "138", "volume": "7"}, "authors": [{"authorId": "1659402748", "name": "Péter Dobra"}, {"authorId": "69400615", "name": "J. Jósvai"}], "citations": []}
