{"paperId": "d22ce322324ec1072451d101d7bb98bf95dc2d39", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Compound Model of Task Arrivals and Load-Aware Offloading for Vehicular Mobile Edge Computing Networks", "abstract": "As autonomous and connected vehicles are becoming a reality, mobile-edge computing (MEC) off-loading provides a promising paradigm to trade off between the long latency of clouding computing and the high cost of upgrading the on-board computers of vehicles. However, due to the randomness of task arrivals, vehicles always have a tendency to choose MEC server for offloading in a selfish way, which is not satisfactory for the social good of the whole system and even results in a failure possibility of some tasks due to the overflow of MEC servers. This paper elaborates the modeling of task arrival process and the influence of various offloading modes on computation cost. Interestingly, by formulating task arrivals as a compound process of vehicle arrivals and task generations, we found that the task arrival model for MEC servers does not belong to the standard Poisson distribution, which contradicts the popular assumption in most existing studies. Considering the load distribution and the prediction of cost, we propose a load-aware MEC offloading method, in which each vehicle makes MEC server selection based on the predicted cost with the updated knowledge on load distribution of MEC servers. Analysis and simulation show that the proposed scheme can achieve up to 65% reduction of total cost with almost 100% task success ratio.", "venue": "IEEE Access", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-02-25", "journal": {"name": "IEEE Access", "pages": "26631-26640", "volume": "7"}, "authors": [{"authorId": "67245205", "name": "Longjiang Li"}, {"authorId": "2157474628", "name": "Hongmei Zhou"}, {"authorId": "2057611521", "name": "Shawn Xiaoli Xiong"}, {"authorId": "2144535338", "name": "Jianjun Yang"}, {"authorId": "1792391", "name": "Y. Mao"}], "citations": [{"paperId": "b7b225d85ec06e617b23aeb59f20c85baabcd967", "title": "Graph-Powered Reinforcement Learning for Intelligent Task Offloading in Vehicular Networks"}, {"paperId": "a4c2131a637b85fbc5286c5ce96c8b7ab05e376a", "title": "VDAG: A vehicle-to-vehicle opportunistic resource sharing framework for dependent tasks"}, {"paperId": "7082ce56bc8a583bb7838f024b6171d8f0015d6b", "title": "Task offloading paradigm in mobile edge computing-current issues, adopted approaches, and future directions"}, {"paperId": "bcf769660b4b5644e317eec62a6e12b106d2312e", "title": "A Novel Cost-Aware Load Balancing Algorithm for Road Side Units in Internet of Vehicles"}, {"paperId": "4f2e118dfa0035ada9675a69de849cc035c56c96", "title": "Adaptive-Learning-Based Vehicle-to-Vehicle Opportunistic Resource-Sharing Framework"}, {"paperId": "8e0409ecfd222523505c125445386159a62847be", "title": "AALB: Application Aware Load Balancing Algorithm for Road Side Units"}, {"paperId": "860ca3087b399ffef29c9453690b98a52d68fa76", "title": "Offloading of Atomic Tasks in Satellite Networks: A Fast Adaptive Resource Collaboration Method"}, {"paperId": "32c375bbc14bd06963b9a35f745e82297dcc90b7", "title": "Computation offloading and content caching and delivery in Vehicular Edge Network: A survey"}, {"paperId": "bf1c9926fbeb4cb897d9ef29a173fb90d5a3c1e2", "title": "Joint Computation Resource Allocation Using Mobile-Edge-Platooning-Cloud in the Internet of Vehicles"}, {"paperId": "1c0f98aff3f4ea171ab8ce509672ba80e67aed9c", "title": "Research on security technology of automobile electronic communication based on genetic assessment"}, {"paperId": "31a427cb9055afa0bddc66d685fce5580e0aefcd", "title": "A Dynamic Task Offloading Method with Centralized Controller to Improve Task Success Rate"}, {"paperId": "30ec607ac91739b00915de05404a40072187f30a", "title": "On-demand resource provisioning for vehicular networks using flying fog"}, {"paperId": "2fca85e178c734ebae62fe44e215dbbf68464d70", "title": "Task Offloading Scheme Based on Improved Contract Net Protocol and Beetle Antennae Search Algorithm in Fog Computing Networks"}, {"paperId": "027a0b333e4ee894044eb73b8c9e9685d0cc9437", "title": "The BRS-inequality and its Applications A Survey"}, {"paperId": "0aba5218a015f0dd9824c806eba8092224085f6f", "title": "An efficient task offloading scheme in vehicular edge computing"}, {"paperId": "174e3525466fe10f8370465d650411c80efa411e", "title": "Vehicular Task Offloading via Heat-Aware MEC Cooperation Using Game-Theoretic Method"}, {"paperId": "566335e2186af11f6d5b08398788e73ec3419c84", "title": "Analytical Review and Study on Load Balancing in Edge Computing Platform"}, {"paperId": "62d86c86114655be8820a26bdfd18f8a57ec071a", "title": "Mobility-Aware Computation Offloading in MEC-Based Vehicular Wireless Networks"}, {"paperId": "f12c406b5f2aa5ad95d0b2d1b0c9695e4d1dee1d", "title": "Joint Optimization of Computation Offloading and Task Scheduling in Vehicular Edge Computing Networks"}, {"paperId": "5d929577dbceb7e1e30ce725e39223bbdd284d4d", "title": "A Survey on Computation Offloading for Vehicular Edge Computing"}, {"paperId": "47bbd78c67e8d51353a4e86009a22a3706ae7d03", "title": "Computation Offloading and Content Caching Delivery in Vehicular Edge Computing: A Survey"}, {"paperId": "f1c4a600e77ba034f3780df1d95bc784a348aea5", "title": "Adaptive Task Offloading Auction for Industrial CPS in Mobile Edge Computing"}, {"paperId": "bc3da3227643a15389715d306487d25cf9f2c1cd", "title": "ESBL: Design and Implement A Cloud Integrated Framework for IoT Load Balancing"}, {"paperId": "8e6c889b136604856813962ad7d1be6b85902c9c", "title": "The BRS-inequality and its applications"}, {"paperId": "268aece62d0208a487defd8ee6f3a663700785d2", "title": "Computation Offloading for Vehicular Environments: A Survey"}, {"paperId": "429eb824082ceaf6f0896019947a535fe7a58cab", "title": "Clustering Algorithm Based on Task Dependence in Vehicle-Mounted Edge Networks"}, {"paperId": "9d4d853857edf905e65258dbae78a2a8659d58a4", "title": "International Journal of Recent Technology and Engineering (IJRTE)"}]}
