{"paperId": "d22c13a574cbdd438db45bdfa245f5e3aa2343db", "publicationVenue": null, "title": "Neural Cognitive Diagnosis Based on the Relationship Between Mining Exercise and Concept", "abstract": "In the education system, cognitive diagnosis aims to assess students' cognitive abilities, providing a basis for personalized learning. In previous cognitive diagnosis models, the quantitative relationship between exercise and knowledge concepts and the interactions between knowledge concepts were often overlooked. In this paper, we propose a neural cognitive diagnosis model based on the quantitative relationship between exercise and knowledge concepts and the interactions between knowledge concepts, called QI-NeuralCDM. This model is trained to obtaining the quantitative relationship between exercise and knowledge concepts and introduces interactions between knowledge concepts to uncover the connections between exercise and knowledge concepts. Then, students are mapped to a knowledge proficiency vector, and a neural network is used to learn their interactions, predicting students' performance on exercises. Finally, we compare QI-NeuralCDM with previous models such as MIRT, DINA, NCDM, and CDGK on the ASSIST0910, ASSIST2017, and JunYi datasets. Experimental results demonstrate that QI-NeuralCDM shows excellent performance in predicting student performance.", "venue": "2023 2nd International Conference on Artificial Intelligence and Computer Information Technology (AICIT)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-09-15", "journal": {"name": "2023 2nd International Conference on Artificial Intelligence and Computer Information Technology (AICIT)", "pages": "1-4"}, "authors": [{"authorId": "2242863079", "name": "Jiuning Jiao"}, {"authorId": "2243365136", "name": "Yi Tian"}, {"authorId": "2243363420", "name": "Likun Huang"}, {"authorId": "2243295560", "name": "Quan Wang"}, {"authorId": "2242982118", "name": "Jiao Chen"}], "citations": []}
