{"paperId": "d22deed58f55242279a42d3d0ed9ab4c91508ea6", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Optimizing the Execution of Product Data Models", "abstract": "The Product Data Model (PDM) is an example of a declarative data-centric approach to modelling information-intensive business processes, which offers flexibility and facilitates process optimization. Declarative approaches are the de facto choice in all modern data-oriented workflows, but they require an optimizer to choose among multiple, alternative execution plans that can produce the desired end product. In PDM business processes, current optimization heuristics suffer from severe limitations regarding both their efficiency and applicability to realistic scenarios, stemming from a lack of consideration for the resource perspective of the processes being modelled and the advances in modern data flow optimizers. This work tackles both of these limitations with the proposal of rank-based operation ordering optimizations tailored to the specificities of PDM, which are also combined with the consideration of the resources available to execute the process operations and parallelism options. Through an extensive evaluation of the proposed solutions, it is showcased that there are significant performance gains from the advanced rank-based operation ordering techniques with the added support of parallel execution. The speedups observed were up to 5.5X compared to the state-of-the-art optimization heuristics.", "venue": "IEEE Access", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "25397-25410", "volume": "12"}, "authors": [{"authorId": "1963965543", "name": "Konstantinos Varvoutas"}, {"authorId": "23616713", "name": "Christos Bellas"}, {"authorId": "2026175", "name": "Georgia Kougka"}, {"authorId": "2261490905", "name": "Anastasios Gounaris"}], "citations": []}
