{"paperId": "d23f289655fa9d1ccfe5193db4135553a6dd7d5a", "publicationVenue": {"id": "87a9041d-3fcb-4c5a-b22c-4a99beca7888", "name": "IEEE Vehicular Networking Conference", "type": "conference", "alternate_names": ["Vehicular Networking Conference", "Veh Netw Conf", "VNC", "IEEE Veh Netw Conf"], "url": "http://www.ieee-vnc.org/"}, "title": "PADSA: Priority-Aware Block Data Storage Architecture for Edge Cloud Serving Autonomous Vehicles", "abstract": "An efficient Input/Output (I/O) caching mechanism for data storage can deliver the desired performance at a reasonable cost to edge nodes serving autonomous vehicles. Current storage caching solutions are proposed to address common applications for autonomous vehicles that are less demanding in terms of the latency (e.g., map or software upgrades). However, a serious revision of these solutions is necessary for autonomous vehicles, which rely on safety- and time-critical communication for services, such as collision avoidance, requiring very low latency. In this paper, we propose a three-level storage caching architecture for virtualized edge cloud platforms serving autonomous vehicles. This architecture prioritizes safety-critical services and allocates the two top-level caches of Dynamic Random Access Memory (DRAM) and Non-Volatile Memory (NVM) to the top priority services. We further evaluate optimum cache space allocated to each service to minimize the average latency. The experimental results show that the proposed architecture reduces the average latency in safety-critical applications by up to 70% compared to the state-of-the-art.", "venue": "IEEE Vehicular Networking Conference", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-11-10", "journal": {"name": "2021 IEEE Vehicular Networking Conference (VNC)", "pages": "170-177"}, "authors": [{"authorId": "2868307", "name": "Mostafa Kishani"}, {"authorId": "3324541", "name": "Zdenek Becvar"}, {"authorId": "144394335", "name": "H. Asadi"}], "citations": []}
