{"paperId": "d23f7bec741a1cda9cc06eea4a69df6f353001a1", "publicationVenue": {"id": "409a4f56-7785-415a-8fa6-32fde080b401", "name": "IET Image Processing", "type": "journal", "alternate_names": ["Iet Image Processing", "IET Image Process", "Iet Image Process"], "issn": "1751-9659", "url": "http://www.iee.org/Publish/Journals/Profjourn/Proc/vis/", "alternate_urls": ["http://www.ietdl.org/IET-IPR"]}, "title": "A fuzzy spectral clustering algorithm for hyperspectral image classification", "abstract": "Spectral clustering is an unsupervised clustering algorithm, and is widely used in the ﬁeld of pattern recognition and computer vision due to its good clustering performance. However, the traditional spectral clustering algorithm is not suitable for large-scale data classiﬁcation, such as hyperspectral remote sensing image, because of its high computational complexity, and it is difﬁcult to characterize the inherent uncertainty of the hyperspectral remote sensing image. This paper uses fuzzy anchors to process hyperspectral image classiﬁcation and proposes a novel spectral clustering algorithm based on fuzzy similarity measure. The proposed algorithm utilizes the fuzzy similarity measure to obtain the similarity between the data points and the anchors, and then gets the similarity matrix. Finally, spectral clustering is performed on the similarity matrix to compute the classiﬁcation results. The experimental results on the hyperspectral remote sensing image data sets have demonstrated the effectiveness of the proposed algorithm, and the introduction of fuzzy similarity measure gives rise to a more robust similarity matrix. Compared with existing methods, the proposed algorithm has a better classiﬁcation result on the hyperspectral remote sensing image, and the kappa coefﬁcient obtained by the proposed algorithm is 2% higher than the traditional algorithms.", "venue": "IET Image Processing", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-05-19", "journal": {"name": "IET Image Process.", "pages": "2810-2817", "volume": "15"}, "authors": [{"authorId": "2107513318", "name": "Kang Li"}, {"authorId": "47883302", "name": "Jindong Xu"}, {"authorId": "2088210998", "name": "Tianyu Zhao"}, {"authorId": "2145281983", "name": "Zhaowei Liu"}], "citations": [{"paperId": "743746a47f98201ef57e4b88a610496cd816155f", "title": "Fuzzy graph convolutional network for hyperspectral image classification"}, {"paperId": "5640dd3f6f99f6b6920a9a2a2cdfa0402a584ef3", "title": "EM-IFCM: Fuzzy c-means clustering algorithm based on edge modification for imbalanced data"}, {"paperId": "99878e7d32ea0e3b0b44c45bc31f7f4eb5e6f272", "title": "Landscape Classification System Based on RKM Clustering for Soil Survey UAV Images–Case Study of the Small Hilly Areas in Jurong City"}, {"paperId": "b339719a436a5accb9a68ca0b57be398fc09f084", "title": "Fast robust fuzzy clustering based on bipartite graph for hyper-spectral image classification"}, {"paperId": "09decc2a7883ba96887e8806ea65b2d5d159ba4a", "title": "Hyperspectral Image Unsupervised Classification Using Improved Connection Center Evolution"}]}
