{"paperId": "d24323f0f3153e18cc72e66c1726fb75c1694cf4", "publicationVenue": null, "title": "Benefits, Challenges and Tools of Big Data Management", "abstract": "Big Data is one of the most predominant field of knowledge and research that has generated high repercussion in the process of digital transformation of organizations in recent years. The Big Data's main goal is to improve work processes through analysis and interpretation of large amounts of data. Knowing how Big Data works, its benefits, challenges and tools, are essential elements for business success. Our study performs a systematic review on Big Data field adopting a mind map approach, which allows us to easily and visually identify its main elements and dependencies. The findings identified and mapped a total of 12 main branches of benefits, challenges and tools, and also a total of 52 sub branches in each of the main areas of the model.", "venue": "", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2017-10-24", "journal": {"name": "Journal of Systems Integration", "pages": "12-20", "volume": "8"}, "authors": [{"authorId": "145438239", "name": "F. Almeida"}], "citations": [{"paperId": "6098c973571538d3a1aba779766e30c0c0633074", "title": "Strategic organizational changes: Adopting data‐driven decisions"}, {"paperId": "c7bbd352b7041241146682988545ed3302c5fe1c", "title": "The Use of Big Data in the Take-out and Delivery Market in China"}, {"paperId": "f839c7f3a09456654da6b2eab2edeaf41c7b18cb", "title": "Semantic Representation of the Intersection of Criminal Law & Civil Tort"}, {"paperId": "86c70a8f335ea57c9776d28b4ac38cf57a2a96b6", "title": "Records Management Practices: A solution in dealing with big data"}, {"paperId": "dbec4a15e3e2910910156b0abe34b2fadc30a18d", "title": "Adoption of a Digital Patient Health Passport as Part of a Primary Healthcare Service Delivery: Systematic Review"}, {"paperId": "7a36cc1a8d2f8609e0a44325e6a8b146848cadb2", "title": "Security Issues and Possible Solutions in Cloud Computing and Big Data: A Review"}, {"paperId": "be7da34a4f5608eb169e49e142724aceff420335", "title": "What Does It Take to Adopt Big Data Management Approach at Malaysian Higher Education Institutions?"}, {"paperId": "6867dedd63637750d61975fe5ebf92240d6c313b", "title": "Strategies to Implement Big Data Analytics in Telecommunication Organizations"}, {"paperId": "40b18d2a2590c797d632e303d65b4eb70f2692f4", "title": "An H2O’s Deep Learning-Inspired Model Based on Big Data Analytics for Coronavirus Disease (COVID-19) Diagnosis"}, {"paperId": "9d3471505e5cc882b8748cf6e9ca43865946b052", "title": "The Use of Internet of Things and Big Data to Improve Customer Data in Insurance Company"}, {"paperId": "e1534461e6125faac7ab3117b4f139255529fa14", "title": "Concept and Dimensions of Web 4.0"}, {"paperId": "252d1c771c9360467be6659e3b8ecd4270da10f4", "title": "Business Intelligence"}, {"paperId": "1f88a3eaf72a0d1b7788f6df7248cdda0f64b6f4", "title": "Big Data Management in the Era of FinTech"}, {"paperId": "4f0552ff3e1bacad0b761a57562c14bc1e09fd3a", "title": "The Influence of Big Data on Retail Activities and Retail Performance"}, {"paperId": "d60e299599d6f4c532886f7bee5364b2439b4e4a", "title": "The Policy Education And The Citizen Activation To Do The Exercise Through Calories Credit Challenge Platform In Bangkok, Thailand"}, {"paperId": "f6b68ead90bf286399c9a635017eb51a93bea45f", "title": "Big Data: Challenges, Popular Tools Of Big Data - Benefits And Applications"}, {"paperId": "4840265fe1f367d560a23ec916976abe4a8b66f8", "title": "ISR Data Processing in Military Operations"}, {"paperId": "31670bdba57060637b36e6016eea56cf172ccf60", "title": "Big Data Analytics and Artificial Intelligence Against COVID-19: Innovation Vision and Approach"}, {"paperId": "bc043210079c65abd56b496e61f2fef5eebf54a6", "title": "Determinants of Big Data Adoption for Higher Education Institutions in Malaysia"}, {"paperId": "e75fbd63b2ad7def5fd04e28a418682cb53d51c1", "title": "The re-skilling requirements of database administrators in a big data environment"}]}
