{"paperId": "d25cc669ba56f9bae2d48c97ab14113a9a49413b", "publicationVenue": null, "title": "Bus Ridership Prediction with Time Section, Weather, and Ridership Trend Aware Multiple LSTM", "abstract": "Public transportation has been essential in people's lives in recent years. Bus ridership is a factor in people's choice to board the bus. Therefore, from the perspective of improving service quality, it is important to inform passengers who have not boarded the bus yet about future bus ridership. However, there is a concern that providing inaccurate information may cause a negative experience. Against this backdrop, there is a need to provide bus passengers who have not boarded yet with highly accurate predictions. Many researchers are working on studies on this. However, two issues summarize related studies. The first is that the correlation of bus ridership between consecutive bus stops should be considered for the prediction. The second is that the prediction has yet to be made using all of the features shown to be useful in each related study. This study proposes a prediction method that addresses both of these issues. We solve the first issue by designing an LSTM-based architecture for each bus stop and a single model for the entire bus stop. We solve the second issue by inputting all useful data, the past bus ridership, day of the week, time section, weather, and precipitation, as features. Bus ridership at each bus stop collected from buses operated by Minato Kanko Bus Inc, in Kobe city, Hyogo, Japan, from October 1, 2021, to September 30, 2022, were used to compare accuracy. The proposed method improved RMSE by 23% on average and up to 27% compared to existing methods.", "venue": "2023 IEEE International Conference on Pervasive Computing and Communications Workshops and other Affiliated Events (PerCom Workshops)", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-03-13", "journal": {"name": "2023 IEEE International Conference on Pervasive Computing and Communications Workshops and other Affiliated Events (PerCom Workshops)", "pages": "509-514"}, "authors": [{"authorId": "2068806761", "name": "Tatsuya Yamamura"}, {"authorId": "37842088", "name": "Ismail Arai"}, {"authorId": "34856346", "name": "Masatoshi Kakiuchi"}, {"authorId": "2202562157", "name": "Arata Endo"}, {"authorId": "1784840", "name": "K. Fujikawa"}], "citations": [{"paperId": "50f38830030ce44864741640c89aa05f5f3d353e", "title": "Forecasting and Mitigating Disruptions in Public Bus Transit Services"}]}
