{"paperId": "d274812705171203f1e8d0a767bec330d212a8f2", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Toward a Standard Approach for Echo Chamber Detection: Reddit Case Study", "abstract": "In a digital environment, the term echo chamber refers to an alarming phenomenon in which beliefs are amplified or reinforced by communication repetition inside a closed system and insulated from rebuttal. Up to date, a formal definition, as well as a platform-independent approach for its detection, is still lacking. This paper proposes a general framework to identify echo chambers on online social networks built on top of features they commonly share. Our approach is based on a four-step pipeline that involves (i) the identification of a controversial issue; (ii) the inference of users’ ideology on the controversy; (iii) the construction of users’ debate network; and (iv) the detection of homogeneous meso-scale communities. We further apply our framework in a detailed case study on Reddit, covering the first two and a half years of Donald Trump’s presidency. Our main purpose is to assess the existence of Pro-Trump and Anti-Trump echo chambers among three sociopolitical issues, as well as to analyze their stability and consistency over time. Even if users appear strongly polarized with respect to their ideology, most tend not to insulate themselves in echo chambers. However, the found polarized communities were proven to be definitely stable over time.", "venue": "Applied Sciences", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-06-10", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "1869835702", "name": "Virginia Morini"}, {"authorId": "28956425", "name": "Laura Pollacci"}, {"authorId": "37340414", "name": "Giulio Rossetti"}], "citations": [{"paperId": "210c2bcc438c38dada64158a78422116d376c757", "title": "From Perils to Possibilities: Understanding how Human (and AI) Biases affect Online Fora"}, {"paperId": "b4f882aa965726d21dfcddb3a7bb5711f5382710", "title": "Predicting Interpersonal Influence from Conversational Features"}, {"paperId": "a41d034640b32685a3011fc1a9023c6754fa4d47", "title": "YouTube’s recommendation algorithm is left-leaning in the United States"}, {"paperId": "c7b8be4ad6639fa5353d829cdfb0b9fe4854c2a9", "title": "Trends and Topics: Characterizing Echo Chambers' Topological Stability and In-group Attitudes"}, {"paperId": "ab8d6f022c9e1c09445da1dd503dbbdd7bbf95ca", "title": "Quantifying the Echo Chamber Effect: An Embedding Distance-based Approach"}, {"paperId": "706917cb695a6cac21f6150cbef29c0beb00d6b7", "title": "Did COVID-19 Blur Partisan Boundaries? A Comparison of Partisan Affinity and Source Heterophily in Online Alternative News-Sharing Networks Before and During the COVID-19 Pandemic"}, {"paperId": "c1b6e86b51df36f400a84c4fe8b1535c3f07f605", "title": "Beyond Active Engagement: The Significance of Lurkers in a Polarized Twitter Debate"}, {"paperId": "8dcedad55fa86dec5000a177c7d79624e9c249c8", "title": "Content-based comparison of communities in social networks: Ex-Yugoslavian reactions to the Russian invasion of Ukraine"}, {"paperId": "0d76dfb69333d4381c0e2dc485aef2ba0a5bf365", "title": "Echo Chambers as Gravity Wells"}, {"paperId": "a0581af343f5dbffe9f26eec2d9c43fdc31d37c4", "title": "Echo chamber effects on short video platforms"}, {"paperId": "f56fae44e1fac61217a5b4125325fbb6830028b6", "title": "Attributed Stream Hypergraphs: temporal modeling of node-attributed high-order interactions"}, {"paperId": "57786492d133c99c1338cb249d56dabf2a84aaf1", "title": "How to Find Orchestrated Trolls? A Case Study on Identifying Polarized Twitter Echo Chambers"}, {"paperId": "48f255728e5ba16b6add5c3641de4c6230da3631", "title": "Δ-Conformity: multi-scale node assortativity in feature-rich stream graphs"}, {"paperId": "f14bd79572850763b33f485d6a09ef84a9638678", "title": "Change my Mind: Data Driven Estimate of Open-Mindedness from Political Discussions"}, {"paperId": "c1189af2293e320cbcee769d2fc2298a175c30c0", "title": "Cascade-based Echo Chamber Detection"}, {"paperId": "6bb9247c2890658e6b81fa27c55641ee861a951c", "title": "Adherence to Misinformation on Social Media Through Socio-Cognitive and Group-Based Processes"}, {"paperId": "12b9a439a47f24bb5a7fdcb81a0850ef2dd4d3f7", "title": "On the Generalizability and Predictability of Recommender Systems"}, {"paperId": "b03be22904e4c5dd4cf4a3f6c73056031690c15c", "title": "Echo Chamber Super-Network in Online social media"}, {"paperId": "363e4919f9a83eaa65f1da00705b23b91de09383", "title": "{\\Delta}-Conformity: Multi-scale Node Assortativity in Feature-rich Stream Graphs"}, {"paperId": "b5bf68553e1eecf03d0a0e6f13c3f65d073417f3", "title": "DASentimental: Detecting depression, anxiety and stress in texts via emotional recall, cognitive networks and machine learning"}]}
