{"paperId": "d28004bff3e3cee53c5b065f48f1f1b3834950e6", "publicationVenue": {"id": "e795213e-9a07-4d48-a477-6c05448b9a72", "name": "IEEE Symposium on Computational Intelligence in Bioinformatics and Computational Biology", "type": "conference", "alternate_names": ["Comput Intell Bioinform Comput Biology", "IEEE Symp Comput Intell Bioinform Comput Biology", "Computational Intelligence in Bioinformatics and Computational Biology", "CIBCB"], "url": "http://www.cibcb.org/"}, "title": "HPC enabled a Novel Deep Fuzzy Scalable Clustering Algorithm and its Application for Protein Data", "abstract": "Fuzzy clustering is a common way to divide data into groups. Even though it has been improved a lot, fuzzy clustering still has problems while clustering real high-dimensional Big Data with complicated latent distributions. To solve this problem, this study comes up with a way to represent the data in a feature space that was built from a scalable deep neural network using Apache Spark on HPC. In this paper, we proposed SDnnRSIO-FCM, a Scalable Deep Neural Network Random Sampling Iterative Optimization-FCM clustering algorithm, and the SDnnLFCM, a scalable version of the Deep Neural Network Literal Fuzzy c-Means algorithm. We focus on the design and implementation of the proposed SDnnRSIO-FCM and SDnnLFCM algorithms using the Apache Spark cluster in a High-Performance Computing (HPC) environment by representing the data in a feature space produced by the neural network to handle Big Data. First, data is mapped into new feature space to aid in the reconstruction of the original data by providing a good representation. Second, scalable fuzzy clustering is embedded with neural networks to propose deep fuzzy clustering methods. The experimental results conducted on two huge benchmark datasets show that the SDnnRSIO-FCM algorithm outperforms the SDnnLFCM algorithm in terms of Normalized Mutual Information (NMI), Adjusted Rand Index (ARI), and F-score. Furthermore, the proposed SDnnRSIO-FCM applied to huge soybean protein sequences in comparison with SDnnLFCM shows a significant improvement in terms of Silhouette index (SI), Davies-Bouldin index (DBI), and Calinski-Harabasz index (CHI).", "venue": "IEEE Symposium on Computational Intelligence in Bioinformatics and Computational Biology", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-08-15", "journal": {"name": "2022 IEEE Conference on Computational Intelligence in Bioinformatics and Computational Biology (CIBCB)", "pages": "1-8"}, "authors": [{"authorId": "40499767", "name": "Preeti Jha"}, {"authorId": "39656615", "name": "Aruna Tiwari"}, {"authorId": "1815524", "name": "Neha Bharill"}, {"authorId": "4474139", "name": "M. Ratnaparkhe"}, {"authorId": "39832205", "name": "O. Patel"}, {"authorId": "2182905550", "name": "Vaibhav Anand"}, {"authorId": "2182905265", "name": "Sudhanshu Arya"}, {"authorId": "2182906576", "name": "Tanmay Singh"}], "citations": [{"paperId": "7576b03835494b047c1c1d56244212858aa4be48", "title": "Scalable Kernelized Deep Fuzzy Clustering Algorithms for Big Data"}]}
