{"paperId": "d28df6acd26036102e74fbc4bc759ccf5c2c3eae", "publicationVenue": {"id": "764e3630-ddac-4c21-af4b-9d32ffef082e", "name": "IEEE International Conference on Data Engineering", "type": "conference", "alternate_names": ["ICDE", "Int Conf Data Eng", "IEEE Int Conf Data Eng", "International Conference on Data Engineering"], "url": "http://www.wikicfp.com/cfp/program?id=1331"}, "title": "In-Situ Cross-Database Query Processing", "abstract": "Today’s organizations utilize a plethora of heterogeneous and autonomous DBMSes, many of those being spread across different geo-locations. It is therefore crucial to have effective and efficient cross-database query processing capabilities. We present XDB, an efficient middleware system that runs cross-database analytics over existing DBMSes. In contrast to traditional query processing systems, XDB does not rely on any mediating execution engine to perform cross-database operations (e.g., joining data from two DBMSes). It delegates an entire query execution including cross-database operations to underlying DBMSes. At its core, it comprises an optimizer and a delegation engine: the optimizer rewrites cross-database queries into a delegation plan, which captures the semantics as well as the mechanics of a fully decentralized query execution; the delegation engine then deploys the plan to the underlying DBMSes via their declarative interfaces. Our experimental study based on the TPC-H benchmark data shows that XDB outperforms state-of-the-art systems (Garlic and Presto) by up to 6× in terms of runtime and up to 3 orders of magnitude in terms of data transfer.", "venue": "IEEE International Conference on Data Engineering", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-04-01", "journal": {"name": "2023 IEEE 39th International Conference on Data Engineering (ICDE)", "pages": "2794-2807"}, "authors": [{"authorId": "92265606", "name": "Haralampos Gavriilidis"}, {"authorId": "3091174", "name": "Kaustubh Beedkar"}, {"authorId": "1399355221", "name": "Jorge-Arnulfo Quiané-Ruiz"}, {"authorId": "1733290", "name": "V. Markl"}], "citations": [{"paperId": "3377ad969797f7ccbb306ecf72e0e8a474c92ae0", "title": "Apache Wayang: A Unified Data Analytics Framework"}, {"paperId": "add3a51a63589d836bd35bba7f1f0510a3c7d690", "title": "XDB in Action: Decentralized Cross-Database Query Processing for Black-Box DBMSes"}, {"paperId": "2926d28109772a00b4b7eba099746e1997c20daf", "title": "P2D: A Transpiler Framework for Optimizing Data Science Pipelines"}, {"paperId": "06ddfa296cf270dac061347fa7da56daf43a05ef", "title": "SheetReader: Efficient Specialized Spreadsheet Parsing"}]}
