{"paperId": "d28d0b2295ea69a1bc4bf2e0b748bdbe73d3711b", "publicationVenue": {"id": "d30776c0-e524-4f14-a524-871d0586862c", "name": "Cancers", "type": "journal", "issn": "2072-6694", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-154879", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-154879", "https://www.mdpi.com/journal/cancers"]}, "title": "Extracellular Vesicles in Colorectal Cancer: From Tumor Growth and Metastasis to Biomarkers and Nanomedications", "abstract": "Simple Summary Almost all cell types produce extracellular vesicles that, according to their size, subcellular origin and release pathways, are mainly categorized as exosomes, ectosomes and apoptotic bodies. These vesicles exert a critical role in intercellular communication during physiological and pathological processes through the delivery of their cargo. Extracellular vesicles display the molecular features of the cells they originate and thus, they might serve as a basis for the noninvasive diagnosis of cancer or for patient follow-up using liquid biopsies. Furthermore, extracellular vesicles can be engineered for the selective and efficient delivery of molecular tracers and therapeutic agents for tumor imaging or treatment. This review provides an overview of the role of extracellular vesicles in the progression of colorectal cancers, in remodeling target tissue to facilitate premetastatic niche formation, their predictive value for the diagnosis and prognosis of colorectal cancer and the ongoing evaluations of their potential use as nanomedications. Abstract Colorectal cancer (CRC) is a leading public health concern due to its incidence and high mortality rates, highlighting the requirement of an early diagnosis. Evaluation of circulating extracellular vesicles (EVs) might constitute a noninvasive and reliable approach for CRC detection and for patient follow-up because EVs display the molecular features of the cells they originate. EVs are released by almost all cell types and are mainly categorized as exosomes originating from exocytosis of intraluminal vesicles from multivesicular bodies, ectosomes resulting from outward budding of the plasma membrane and apoptotic bodies’ ensuing cell shrinkage. These vesicles play a critical role in intercellular communications during physiological and pathological processes. They facilitate CRC progression and premetastatic niche formation, and they enable transfer of chemotherapy resistance to sensitive cells through the local or remote delivery of their lipid, nucleic acid and protein content. On another note, their stability in the bloodstream, their permeation in tissues and their sheltering of packaged material make engineered EVs suitable vectors for efficient delivery of tracers and therapeutic agents for tumor imaging or treatment. Here, we focus on the physiopathological role of EVs in CRCs, their value in the diagnosis and prognosis and ongoing investigations into therapeutic approaches.", "venue": "Cancers", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2023-02-01", "journal": {"name": "Cancers", "volume": "15"}, "authors": [{"authorId": "5091901", "name": "L. Kotelevets"}, {"authorId": "3563647", "name": "E. Chastre"}], "citations": [{"paperId": "3642a345e6363caad862d99f4dfed256ac45e9c9", "title": "The stimulation of exosome generation by visfatin polarizes M2 macrophages and enhances the motility of chondrosarcoma."}, {"paperId": "1a218ed79ad2b1b3ce97adabc6d6706e4c07722c", "title": "Exosomes promote pre-metastatic niche formation in colorectal cancer"}, {"paperId": "b2c5ae859125d2cb2c91564bc56312010b674f19", "title": "Emerging Roles of Small Extracellular Vesicles in Gastrointestinal Cancer Research and Therapy"}, {"paperId": "e625c05b694df52a89836bca616af56b972d54f8", "title": "Comprehensive analysis of the role of ubiquitin-specific peptidases in colorectal cancer: A systematic review"}, {"paperId": "4106d2d0b7a88f5123f9353f2de7cf14852fbf5d", "title": "Imaging of Light-Enhanced Extracellular Vesicle-Mediated Delivery of Oxaliplatin to Colorectal Cancer Cells via Laser Ablation, Inductively Coupled Plasma Mass Spectrometry"}, {"paperId": "1167d738a1fe423ff3daec8bea30e1befa614380", "title": "Cellular Responses to Extracellular Vesicles as Potential Markers of Colorectal Cancer Progression"}, {"paperId": "8038be78210c637a2ac500a3c29c694f5c3c3323", "title": "Hypoxia-regulated exosomes mediate M2 macrophage polarization and promote metastasis in chondrosarcoma"}, {"paperId": "0130c7023d41ad4e9edb84336cec7fea1a53132f", "title": "The exosome isolation and characterization from DLD-1 cell line media"}, {"paperId": "22fb2e5194efce38c58e4b5a36a495d51e5febce", "title": "Progressing nanotechnology to improve targeted cancer treatment: overcoming hurdles in its clinical implementation"}, {"paperId": "26df708fb807b868b1236996c6fbf1885ef5fce4", "title": "Identification of Gut Microbiota Profile Associated with Colorectal Cancer in Saudi Population"}, {"paperId": "a41586cfd066e4fb275db62601345f0b228c3cc6", "title": "Regulatory role of exosomes in colorectal cancer progression and potential as biomarkers"}, {"paperId": "c81717a6ccee867eb28b5b7cba1db2829af63849", "title": "Metachronous colorectal cancer metastasis: Who, what, when and what to do about it"}, {"paperId": "713cd65f9c2fffbff24396ff64741818099b1494", "title": "The Role of Extracellular Vesicles in Colorectal Cancer"}, {"paperId": "f30ac5bde78f9afdcb05a806be3da99bb337b3bd", "title": "World Journal of Gastrointestinal Oncology"}]}
