{"paperId": "d2a1e8c9e748adeda29fe84f031325f1b577d4d4", "publicationVenue": {"id": "6c3e705d-29b5-462c-9a3a-6c7877b74a18", "name": "JMIR Formative Research", "alternate_names": ["JMIR Form Res"], "issn": "2561-326X", "url": "https://formative.jmir.org/"}, "title": "What You Need to Know Before Implementing a Clinical Research Data Warehouse: Comparative Review of Integrated Data Repositories in Health Care Institutions", "abstract": "Background Integrated data repositories (IDRs), also referred to as clinical data warehouses, are platforms used for the integration of several data sources through specialized analytical tools that facilitate data processing and analysis. IDRs offer several opportunities for clinical data reuse, and the number of institutions implementing an IDR has grown steadily in the past decade. Objective The architectural choices of major IDRs are highly diverse and determining their differences can be overwhelming. This review aims to explore the underlying models and common features of IDRs, provide a high-level overview for those entering the field, and propose a set of guiding principles for small- to medium-sized health institutions embarking on IDR implementation. Methods We reviewed manuscripts published in peer-reviewed scientific literature between 2008 and 2020, and selected those that specifically describe IDR architectures. Of 255 shortlisted articles, we found 34 articles describing 29 different architectures. The different IDRs were analyzed for common features and classified according to their data processing and integration solution choices. Results Despite common trends in the selection of standard terminologies and data models, the IDRs examined showed heterogeneity in the underlying architecture design. We identified 4 common architecture models that use different approaches for data processing and integration. These different approaches were driven by a variety of features such as data sources, whether the IDR was for a single institution or a collaborative project, the intended primary data user, and purpose (research-only or including clinical or operational decision making). Conclusions IDR implementations are diverse and complex undertakings, which benefit from being preceded by an evaluation of requirements and definition of scope in the early planning stage. Factors such as data source diversity and intended users of the IDR influence data flow and synchronization, both of which are crucial factors in IDR architecture planning.", "venue": "JMIR Formative Research", "year": 2020, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2020-01-03", "journal": {"name": "JMIR Formative Research", "volume": "4"}, "authors": [{"authorId": "2265914646", "name": "Kristina K Gagalova"}, {"authorId": "2265915280", "name": "MSc Angelica Leon Elizalde"}, {"authorId": "2265915240", "name": "MSc Elodie Portales-Casamar"}, {"authorId": "2265915596", "name": "PhD Matthias Görges"}, {"authorId": "2226452503", "name": "FO XSL•"}, {"authorId": "2231118397", "name": "RenderX Xsl"}, {"authorId": "2231126521", "name": "FO RenderX"}], "citations": [{"paperId": "b81b4cf2afd16037022a2aed2cbe826975e50a4e", "title": "Transfer Learning for Mortality Prediction in Non-Small Cell Lung Cancer with Low-Resolution Histopathology Slide Snapshots"}, {"paperId": "d7b1ea3dc52d4862777bb0ce90481013b95a0b4c", "title": "ARCHITECTURAL HEALTH DATA STANDARDS AND SEMANTIC INTEROPERABILITY: A COMPREHENSIVE REVIEW IN THE CONTEXT OF INTEGRATING MEDICAL DATA INTO BIG DATA ANALYTICS."}, {"paperId": "192ec0d7495a156e5b028d0e4e8394db9e94e50d", "title": "Research data warehouse: using electronic health records to conduct population-based observational studies"}, {"paperId": "f6a984f3b900fe92a2f4a8e5dfe345bffcdd0d7d", "title": "Integrated Real-World Study Databases in 3 Diverse Asian Health Care Systems in Taiwan, India, and Thailand: Scoping Review"}, {"paperId": "299b9ec7c6333eb3283ce136eee6b4a771861c90", "title": "Biomedical heterogeneous data categorization and schema mapping toward data integration"}, {"paperId": "e82e2cf3b3e75a72ebbad94a1a8319e2445923b7", "title": "Cloud based IoT Electronic Healthcare Data Warehouse Integration in emerging 5G Health Grid Ecosystem"}, {"paperId": "8bf5c68b1e805049228965abd235def8ca40d34e", "title": "Contemporary Databases in Real-world Studies Regarding the Diverse Health Care Systems of India, Thailand, and Taiwan: Protocol for a Scoping Review"}, {"paperId": "5830474bec660bbf04ef3c6bc8dc44d32cf0a525", "title": "Applying Natural Language Processing to Textual Data From Clinical Data Warehouses: Systematic Review"}, {"paperId": "a0a8e2fb4c9832c71d0b8656ed21853627153c23", "title": "Trends in Population-Based Studies: Molecular and Digital Epidemiology (Review)"}, {"paperId": "895911050ee0bd7f7cb66882d4842b100a973b47", "title": "Méthode d’opérationnalisation de mesures de la performance sensibles aux soins infirmiers basées sur des données de routine"}, {"paperId": "5b30379dd24f6f98ce2dff0fc73c7f39d7fbac8f", "title": "Semantic interoperability in health records standards: a systematic literature review"}, {"paperId": "26651acb124d78404ac4427acb46b1cfe6f59012", "title": "Artificial Intelligence for Oral and Maxillo-Facial Surgery: A narrative review."}, {"paperId": "64bbcedacd5331955d003779a37f8099140a5a7e", "title": "Real-World Data from a Refractory Triple-Negative Breast Cancer Cohort Selected Using a Clinical Data Warehouse Approach"}, {"paperId": "50356412155a4071d829f8d61e9e467235903f86", "title": "The Role of Electronic Health Records in Advancing Genomic Medicine"}, {"paperId": "7576884eed0bbb25569a4c31e13831147be94408", "title": "Assessment of Inter-Institutional Post-Operative Hypoparathyroidism Status Using a Common Data Model"}, {"paperId": "f61a3490def0d9b2dacf0891af87e7c9772159ad", "title": "SPECIAL SERIES: CHALLENGES AND DOWNSIDES OF IT IN CANCER CARE"}, {"paperId": "281829bb413dc5e3efdcce39a19ef182d383fc59", "title": "Data warehouse for machine learning: application to breast cancer diagnosis"}]}
