{"paperId": "d2aaa72bd98aa1515b35167f45607de48803ac4d", "publicationVenue": {"id": "9704c32e-4051-4155-95f8-dcb3c01abc51", "name": "Interactive Learning Environments", "type": "journal", "alternate_names": ["Interact Learn Environ"], "issn": "1049-4820", "url": "http://www.informaworld.com/1744-5191", "alternate_urls": ["http://www.tandfonline.com/loi/nile20"]}, "title": "Sparse learning strategy and key feature selection in interactive learning environment", "abstract": "ABSTRACT\n Effective analysis and demonstration of these data features is of great significance for the optimization of interactive learning environment and learning behavior. Therefore, we take the big data set of learning behavior generated by an online interactive learning environment as the research object, define the features of learning behavior, and demonstrate their relationships. A key feature selection method for sparse learning based on data set is designed. The models and algorithms are fully trained and tested through a large number of experiments. Several approximate optimal algorithms are selected to compare the performance indicators. On this basis, the rule and relationships are mined and predicted for the key features, and the measures to improve the key features are proposed. The conclusion is that the guidance and construction of learning behavior based on the key features can have a significance on the learning effect, that has also been proved in practice. Driven by the actual data, it is an inevitable trend to design the suitable methods applied to key features of education big data. This research method and practice process can provide technical reference and theoretical basis for the similar topics.", "venue": "Interactive Learning Environments", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-11-16", "journal": {"name": "Interactive Learning Environments", "pages": "5141 - 5158", "volume": "31"}, "authors": [{"authorId": "1807986", "name": "Xiaona Xia"}], "citations": [{"paperId": "0983a36da068244f76db5f8c62b4fe9feee7e0c0", "title": "Driving STEM learning effectiveness: dropout prediction and intervention in MOOCs based on one novel behavioral data analysis approach"}, {"paperId": "04f8284b9c8bb5d811d768bab953cf35121b6d0e", "title": "One improved learning analytics of interest transfer in interactive learning activities"}, {"paperId": "e034f95d618203ded410755293fde3525deedb2e", "title": "Dropout prediction and decision feedback supported by multi temporal sequences of learning behavior in MOOCs"}, {"paperId": "d43000e9421505e6760d63876555524b7bc7e710", "title": "Interpretable early warning recommendations in interactive learning environments: a deep-neural network approach based on learning behavior knowledge graph"}, {"paperId": "3a5353952a33afa1b1ceadcd902cbc203c5c10bf", "title": "Augmented reality learning environment to aid engineering students in performing practical laboratory experiments in electronics engineering"}, {"paperId": "0ecd3ca9381d284bd8cd41a8cb3d0e51bb0bfd9d", "title": "Early warning mechanism of interactive learning process based on temporal memory enhancement model"}, {"paperId": "eb16c7e1f9b38097a215219734cf70a6fc38dc20", "title": "Temporal tracking and early warning of multi semantic features of learning behavior"}, {"paperId": "69f35d0ad11f80341d45919627a43d539f15653d", "title": "Use of a mixed-reality creative environment in design education"}]}
