{"paperId": "d2aeb9f89bdb8000ff27acbf92cd87a417aaebab", "publicationVenue": {"id": "a0edb93b-1e95-4128-a295-6b1659149cef", "name": "Knowledge Discovery and Data Mining", "type": "conference", "alternate_names": ["KDD", "Knowl Discov Data Min"], "url": "http://www.acm.org/sigkdd/"}, "title": "Pricing the Long Tail by Explainable Product Aggregation and Monotonic Bandits", "abstract": "In several e-commerce scenarios, pricing long-tail products effectively is a central task for the companies, and there is broad agreement that Artificial Intelligence (AI) will play a prominent role in doing that in the next future. Nevertheless, dealing with long-tail products raises major open technical issues due to data scarcity which preclude the adoption of the mainstream approaches requiring usually a huge amount of data, such as, e.g., deep learning. In this paper, we provide a novel online learning algorithm for dynamic pricing that deals with non-stationary settings due to, e.g., the seasonality or adaptive competitors, and is very efficient in terms of the need for data thanks to assumptions such as, e.g., the monotonicity of the demand curve in the price that are customarily satisfied in long-tail markets. Furthermore, our dynamic pricing algorithm is paired with a clustering algorithm for the long-tail products which aggregates similar products such that the data of all the products of the same cluster are merged and used to choose their best price. We first evaluate our algorithms in an offline synthetic setting, comparing their performance with the state of the art and showing that our algorithms are more robust and data-efficient in long-tail settings. Subsequently, we evaluate our algorithms in an online setting with more than 8,000 products, including popular and long-tail, in an A/B test with humans for about two months. The increase of revenue thanks to our algorithms is about 18% for the popular products and about 90% for the long-tail products.", "venue": "Knowledge Discovery and Data Mining", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2022-08-14", "journal": {"name": "Proceedings of the 28th ACM SIGKDD Conference on Knowledge Discovery and Data Mining"}, "authors": [{"authorId": "2037986661", "name": "Marco Mussi"}, {"authorId": "2181320451", "name": "Gianmarco Genalti"}, {"authorId": "2403022", "name": "F. Trovò"}, {"authorId": "3428870", "name": "Alessandro Nuara"}, {"authorId": "145407749", "name": "N. Gatti"}, {"authorId": "1792167", "name": "Marcello Restelli"}], "citations": [{"paperId": "70552b088190af064da426b1c9f6eb2068748f0e", "title": "Contextual Bandits for Online Markdown Pricing for E-commerce"}, {"paperId": "fea75aded3382311c50d7aef11a980465f191bab", "title": "ENCODE: Ensemble Contextual Bandits in Big Data Settings - A Case Study in E-Commerce Dynamic Pricing"}, {"paperId": "b11382e3b0294e9b5b771d4e29e37bbf5b1d0273", "title": "E-Commerce Product Demand Modelling Using Machine Learning Algorithm Case Study of Rice Trading Products in PT XYZ"}, {"paperId": "043e4c58f6cbdb881a6b402a28239da2fe45184c", "title": "Autoregressive Bandits"}, {"paperId": "3b70df072e4f23c6aa33092fd379ef44fb4d707a", "title": "Dynamic Pricing with Volume Discounts in Online Settings"}, {"paperId": "5142160ef14bb5476b9fb25a8965f185da123c22", "title": "Dark-Pool Smart Order Routing: a Combinatorial Multi-armed Bandit Approach"}]}
