{"paperId": "d2bfa1701791127d6baaf1e5d67b6046df69e84c", "publicationVenue": {"id": "0942fb86-c16f-4084-9902-10ddcfe18180", "name": "Micro", "type": "conference", "alternate_names": ["Int Symp Microarchitecture", "MICRO", "International Symposium on Microarchitecture", "Annual IEEE/ACM International Symposium on Microarchitecture", "Annu IEEE/ACM Int Symp Microarchitecture"], "issn": "0271-9002", "alternate_issns": ["2151-4143", "2673-8023"], "url": "http://www.microarch.org/"}, "title": "Towards Efficient NVDIMM-based Heterogeneous Storage Hierarchy Management for Big Data Workloads", "abstract": "In this paper, we propose a holistic solution to address several important and challenging issues in storage data management in light of emerging NVDIMM-based architecture: namely, new performance modeling, NVDIMM-based migration, and architectural support for NVDIMMs on migration optimization. In particular, a novel NVDIMM-based heterogeneous storage performance model is proposed to effectively address bus contention issues caused by placing NVDIMMs on the memory bus. We also develop an NVDIMM-based lazy migration scheme to effectively minimize adverse effects caused by memory traffic interferences during storage data management processes. Finally, the NVDIMM-based architectural support for migration optimization is proposed to increase channel parallelism in the destination NVDIMMs and bypass buffer caches in the source NVDIMMs, so that the impact of memory traffic can be alleviated. We present detailed evaluation and analysis to quantify how well our techniques can enhance the I/O performances of big workloads via efficient heterogeneous storage hierarchy management. Our experimental results show that overall the proposed techniques yield up to 98% performance improvement over the state-of-the-art techniques.", "venue": "Micro", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2019-10-12", "journal": {"name": "Proceedings of the 52nd Annual IEEE/ACM International Symposium on Microarchitecture"}, "authors": [{"authorId": "2480735", "name": "Renhai Chen"}, {"authorId": "144668859", "name": "Z. Shao"}, {"authorId": "1684079", "name": "Duo Liu"}, {"authorId": "145774078", "name": "Zhiyong Feng"}, {"authorId": "12313761", "name": "Tao Li"}], "citations": [{"paperId": "5ed9c637bf7607b1f9a547c6c95824b603978ed6", "title": "A Survey of Non-Volatile Main Memory File Systems"}, {"paperId": "15191c6b7ce75af6e6d71d55ccde98ec91d37a28", "title": "Rethinking the Interactivity of OS and Device Layers in Memory Management"}, {"paperId": "a033df26709450f150f95896e89994c614a63137", "title": "Low Power Scheduling Approach for Heterogeneous System Based on Heuristic and Greedy Method"}, {"paperId": "a403828184258027268abc944cfc38f6e27d4dc2", "title": "Preserving Addressability Upon GC-Triggered Data Movements on Non-Volatile Memory"}, {"paperId": "42bff554a6f6c19a45dc92af8c84b380dca876ed", "title": "A Cache Policy Based on Request Association Analysis for Reliable NAND-Based Storage Systems"}, {"paperId": "b453169308814ec75ffb2c34158300a31b5bb16c", "title": "Data Bucket-Based Fragment Management for Solid State Drive Storage System"}, {"paperId": "2a4a100d3e1bd48730dc997718f352ddfe509211", "title": "SSW: A strictly sequential writing method for open-channel SSD"}, {"paperId": "6f42578f61ec10158e99aa2d5c9b3fa58df83825", "title": "GraphPage: RDF Graph in SSD Pages: Work-in-Progress"}, {"paperId": "1f8b26866eeebe6aa90452be54d04eca1ee0226c", "title": "SSW: A strictly sequential writing method for open-channel SSD"}]}
