{"paperId": "d2c11abfcce502362cd95a13f71ef66dfd9600bc", "publicationVenue": {"id": "5857d727-45eb-4f03-9c71-889349e363a7", "name": "Geomatics, Natural Hazards & Risk", "type": "journal", "alternate_names": ["Geomatics, Natural Hazards and Risk", "Geomatics Nat Hazard  Risk", "Geomatics Nat Hazard Risk"], "issn": "1947-5705", "url": "http://www.informaworld.com/smpp/title~content=t913444127~db=all", "alternate_urls": ["https://www.tandfonline.com/toc/tgnh20/current", "http://www.tandfonline.com/TGNH"]}, "title": "Flood susceptibility modeling of the Karnali river basin of Nepal using different machine learning approaches", "abstract": "Abstract The Karnali River Basin (KRB) comprises the longest river in Nepal, located south of the Himalayas. Despite its high susceptibility to floods, the basin lacks detailed studies. Proper floodplain management is essential to reduce the impacts due to rising flood frequency, magnitude, and severity aggravated by climate change. This research applies three machine learning techniques, Support Vector Machine (SVM), Random Forest (RF), and Artificial Neural Networks (ANN), to flood event data from the KRB. Ten flood conditioning factors; Aspect, curvature, distance to a river (DTR), normalized difference vegetation index (NDVI), elevation, slope, rainfall, soil, stream power index (SPI), and topographical wetness index (TWI) were selected based on the multicollinearity test. The parameter performance was evaluated using the Cohen Kappa Score, with NDVI having the greatest influence, followed by elevation, DTR, curvature, and TWI. Based on the Area Under the Curve of Receiver Operating Characteristics (AUROC), SVM outperformed RF, ANN, and ANN for FSM. The area of very high flood susceptible areas ranges from 0.8 to 2.5% of the basin area, most of them located in the south with low slopes and elevations. The results of this study suggest the use of SVM for FSM to help with proper floodplain management. Graphical Abstract", "venue": "Geomatics, Natural Hazards & Risk", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-08", "journal": {"name": "Geomatics, Natural Hazards and Risk", "volume": "14"}, "authors": [{"authorId": "46814005", "name": "Sunil Duwal"}, {"authorId": "145154593", "name": "Dedi Liu"}, {"authorId": "2134562789", "name": "P. M. Pradhan"}], "citations": [{"paperId": "80dfb6776e66326b17de35aeaa6187c52f446318", "title": "A comparative spatial analysis of flood susceptibility mapping using boosting machine learning algorithms in Rathnapura, Sri Lanka"}, {"paperId": "681dff4913f0aff04f7ce6f35f8c1249d5ab2e3d", "title": "Leveraging machine learning and open-source spatial datasets to enhance flood susceptibility mapping in transboundary river basin"}, {"paperId": "83820f8ca5453104333374a9bcf0d53e029d462d", "title": "Flood susceptibility assessment using machine learning approach in the Mohana-Khutiya River of Nepal"}, {"paperId": "4f2967996a7301c8a88a9bd8da5e58122ece588d", "title": "Random forest-based multi-hazard loss estimation using hypothetical data at seismic and tsunami monitoring networks"}, {"paperId": "c26f629fc7ac0a0995c727f4693db8619354c8e4", "title": "Multi-scenario simulation of spatial structure and carbon sequestration evaluation in residential green space"}]}
