{"paperId": "d2c4f593bfdb2fc74ecd8145051b51ef3245036e", "publicationVenue": null, "title": "Application of Principle Component Analysis and logistic regression to support Six Sigma implementation in maintenance", "abstract": "Improving the efficiency of maintenance processes is one of the goals of companies. Improvement activities in this area require not only an appropriate maintenance strategy but also the use of a new approach to increase the efficiency of the process. This article focuses on using Six Sigma (SS) to improve maintenance processes. As an introduction, the generations of SS development are identified, and traditional and advanced analytical tools that can be useful in SS projects are reviewed. As part of the research, an example of the implementation of the SS project in the maintenance process using the DMAIC and selected advanced analytical methods, such as PCA and logistic regression, was presented. The PCA results showed that it was enough to have seven main components to keep about 84% of the information on variability. In developed logistic regression explained the impact of the individual factors affecting the availability of the machines. The identified factors and their interactions made it possible to define maintenance activities requiring improvements.", "venue": "Eksploatacja i Niezawodność – Maintenance and Reliability", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-11-01", "journal": {"name": "Eksploatacja i Niezawodność – Maintenance and Reliability"}, "authors": [{"authorId": "3139239", "name": "K. Antosz"}, {"authorId": "2265164455", "name": "Małgorzata Jasiulewicz - Kaczmarek"}, {"authorId": "2060410383", "name": "José Machado"}, {"authorId": "2267547766", "name": "Marcin Relich"}], "citations": [{"paperId": "d425aa96321c68db9415de33cc5e1f830270623c", "title": "Development of AI-Based Prediction of Heart Attack Risk as an Element of Preventive Medicine"}]}
