{"paperId": "d2d7ccb43f6bf61fa2deaa425a573ccba0799881", "publicationVenue": {"id": "5857d727-45eb-4f03-9c71-889349e363a7", "name": "Geomatics, Natural Hazards & Risk", "type": "journal", "alternate_names": ["Geomatics, Natural Hazards and Risk", "Geomatics Nat Hazard  Risk", "Geomatics Nat Hazard Risk"], "issn": "1947-5705", "url": "http://www.informaworld.com/smpp/title~content=t913444127~db=all", "alternate_urls": ["https://www.tandfonline.com/toc/tgnh20/current", "http://www.tandfonline.com/TGNH"]}, "title": "Advanced data mining techniques for landslide susceptibility mapping", "abstract": "Abstract This paper describes the development and validation of landslides susceptibility models for mountainous regions using advanced data mining techniques. The investigation was carried out to ascertain the effectiveness of Naïve Bayes Multinomial (NBM) and Random Trees (RT) in landslide susceptibility mapping. The NBM is an advancement of the frequently used Naïve Bayes classifiers, while the RT was built to overcome the limitations of the traditional forest classifiers. A geospatial database for this investigation comprises 148 landslide locations influenced by ten (10) landslide conditioning factors. The factors (Slope Angle, Slopes Elevation, Slope Aspect, Plan curvature, Profile Curvature, Lithology, Soil type, Stream power index (SPI), Sediment transport index (STI), and Rainfall precipitation) were drawn using a Multi Collinearity Decision Making (MCDM) technique. A Frequency Ratio (FR) analysis was used to obtain the relative significance of the factors in the slides. Predictive models were also developed by quantifying these models using data mining techniques. A section of the entire geospatial data (70%) was used as training datasets, while the remaining part of the data (30%) was used to validate the trained datasets. SVM, RT, and NBM algorithms were used to produce predicted datasets from the training datasets. These predicted datasets were used to develop the Landslides Susceptibility Models. A comparative assessment between the two classifiers against the famous traditional learning algorithm, the Support vector machines (SVM), was conducted. Model performance evaluators such as the AUROC, RSME, F-measure, MAE, and ACC were employed to check the predictive capabilities and accuracies of the models. The indices indicated that the SVM model performed better than the other two algorithms in both training and validation datasets. Further analysis and comparison of the models reveal that the new data mining techniques are reliable for landslide susceptibility. Simultaneously, the traditional algorithm is also useful and remains relevant, especially with similar site conditions. This study has provided insights on better planning and development and provision of mitigation strategies and further analysis on landslides in the study area, particularly in cases of limited data availability. Graphical Abstract", "venue": "Geomatics, Natural Hazards & Risk", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-01-01", "journal": {"name": "Geomatics, Natural Hazards and Risk", "pages": "2430 - 2461", "volume": "12"}, "authors": [{"authorId": "47836536", "name": "M. Ibrahim"}, {"authorId": "100929538", "name": "Z. Mustaffa"}, {"authorId": "98696015", "name": "A. Balogun"}, {"authorId": "2133776626", "name": "Indra Sati Hamonangan Harahap"}, {"authorId": "2130657771", "name": "Mudassir Ali Khan"}], "citations": [{"paperId": "07eab57fb603d6a83f1927751fa77f72fa512558", "title": "Regional seismic landslide susceptibility assessment considering the rock mass strength heterogeneity"}, {"paperId": "1713cbf1987a0b5d905f8532bf2bb5759bb7f60c", "title": "Assessment of groundwater potential modeling using support vector machine optimization based on Bayesian multi-objective hyperparameter algorithm"}, {"paperId": "66c73a08a99b626fc2e5013bd981a04b3f00af82", "title": "Highway Proneness Appraisal to Landslides along Taiping to Ipoh Segment Malaysia, Using MCDM and GIS Techniques"}, {"paperId": "a47e99d9b980c318dc52b0c80f9c497525d53111", "title": "Landslide’s analysis and Hazard mapping based on ANALYTIC HIERARCHY PROCESS (AHP) using GIS, in Lawas, Sabah-Sarawak"}, {"paperId": "dbd8ec2db1dd2b7c02c693fba100f2a637ac41de", "title": "Framework for the identification of shallow ground movement in modified slopes (an expert opinion)"}, {"paperId": "71cacd0746071cb0ae5eff13b563c206b93fe7b8", "title": "A multi-criteria landslide susceptibility mapping using deep multi-layer perceptron network: A case study of Srinagar-Rudraprayag region (India)"}]}
