{"paperId": "d2db98d5e368d6af4186a4d301e75420ab769e21", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Three Stages Recursive Differential Grouping for Large-Scale Global Optimization", "abstract": "Cooperative co-evolution (CC) is an effective framework for solving large-scale global optimization (LSGO) problems by using the “divide-and-conquer” method. However, the decomposition stage faces the challenges of either insufficient decomposition accuracy or extremely high computational cost to achieve correct decomposition. The significant amount of resources consumed during the decomposition stage greatly affects optimization. A decomposition method called Recursive Differential Grouping (RDG) has shown impressive results in solving large-scale continuous optimization problems. To improve the performance of RDG and reduce the resource consumption during decomposition, this paper proposes the Three Stages Recursive Differential Grouping (TSRDG) method. The first stage is the determination of whether a function is fully separable or not. In the second stage, separable variables are divided into one group and non-separable variables are divided into another group. In the third stage, this study identifies the interacting decision variables that are not in a separable group and reuses the effective information that was gained in the first two stages. Compared with some state-of-the-art methods, TSRDG has an effective strategy for decomposing functions. Moreover, it avoids the resource consumption of identifying the interaction between separable and non-separable variables in recursions. Effective historical information is fully exploited throughout the process of variable decomposition. Simulation experiments on the benchmark functions of CEC’2010 and CEC’2013 demonstrate that TSRDG achieves higher decomposition accuracy and lower computational cost than state-of-the-art decomposition methods. The experiments show that TSRDG is a promising algorithm in LSGO.", "venue": "IEEE Access", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "109734-109746", "volume": "11"}, "authors": [{"authorId": "2256609282", "name": "Li Zheng"}, {"authorId": "2253879831", "name": "Gang Xu"}, {"authorId": "2253866961", "name": "Wenbin Chen"}], "citations": []}
