{"paperId": "d2e7726268fd6d0383535df1b894549917908544", "publicationVenue": {"id": "8e1bd4b5-d5b2-4e22-ba0a-01fe5568d472", "name": "Remote Sensing", "type": "journal", "alternate_names": ["Remote Sens"], "issn": "2315-4675", "alternate_issns": ["2072-4292"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169233", "alternate_urls": ["https://www.mdpi.com/journal/remotesensing", "http://www.mdpi.com/journal/remotesensing", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169233"]}, "title": "Application of Model-Based Time Series Prediction of Infrared Long-Wave Radiation Data for Exploring the Precursory Patterns Associated with the 2021 Madoi Earthquake", "abstract": "Taking the Madoi MS 7.4 earthquake of 21 May 2021 as an example, this paper proposes using time series prediction models to predict the outgoing long-wave radiation (OLR) anomalies and study short-term pre-earthquake signals. Five time series prediction models, including autoregressive integrated moving average (ARIMA) and long short-term memory (LSTM), were trained with the OLR time series data of the aseismic moments in the 5° × 5° spatial range around the epicenter. The model with the highest prediction accuracy was selected to retrospectively predict the OLR values during the aseismic period and before the earthquake in the area. It was found, by comparing the predicted time series values with the actual time series value, that the similarity indexes of the two time series before the earthquake were lower than the index of the aseismic period, indicating that the predicted time series before the earthquake significantly differed from the actual time series. Meanwhile, the temporal and spatial distribution characteristics of the anomalies in the 90 days before the earthquake were analyzed with a 95% confidence interval as the criterion of the anomalies, and the following was found: out of 25 grids, 18 grids showed anomalies—the anomalies of the different grids appeared on similar dates, and the anomalies of high values appeared centrally at the time of the earthquake, which supports the hypothesis that pre-earthquake signals may be associated with the earthquake.", "venue": "Remote Sensing", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-28", "journal": {"name": "Remote. Sens.", "pages": "4748", "volume": "15"}, "authors": [{"authorId": "2248213225", "name": "Jingye Zhang"}, {"authorId": "153269195", "name": "K. Sun"}, {"authorId": "2146279521", "name": "Junqing Zhu"}, {"authorId": "2248879256", "name": "Ning Mao"}, {"authorId": "2256600424", "name": "Dimitar Ouzounov"}], "citations": []}
