{"paperId": "d2e9ab9cea313408a2c941b95f1bf9ef3d5b59f2", "publicationVenue": {"id": "138e58fc-8643-41c2-a92c-068ea4f4c607", "name": "PeerJ Computer Science", "alternate_names": ["Peerj Comput Sci"], "issn": "2376-5992", "url": "https://peerj.com/archives/?journal=cs", "alternate_urls": ["https://peerj.com/computer-science/", "http://peerj.com/cs"]}, "title": "Big data clustering techniques based on Spark: a literature review", "abstract": "A popular unsupervised learning method, known as clustering, is extensively used in data mining, machine learning and pattern recognition. The procedure involves grouping of single and distinct points in a group in such a way that they are either similar to each other or dissimilar to points of other clusters. Traditional clustering methods are greatly challenged by the recent massive growth of data. Therefore, several research works proposed novel designs for clustering methods that leverage the benefits of Big Data platforms, such as Apache Spark, which is designed for fast and distributed massive data processing. However, Spark-based clustering research is still in its early days. In this systematic survey, we investigate the existing Spark-based clustering methods in terms of their support to the characteristics Big Data. Moreover, we propose a new taxonomy for the Spark-based clustering methods. To the best of our knowledge, no survey has been conducted on Spark-based clustering of Big Data. Therefore, this survey aims to present a comprehensive summary of the previous studies in the field of Big Data clustering using Apache Spark during the span of 2010–2020. This survey also highlights the new research directions in the field of clustering massive data.", "venue": "PeerJ Computer Science", "year": 2020, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2020-11-30", "journal": {"name": "PeerJ Computer Science", "volume": "6"}, "authors": [{"authorId": "145804826", "name": "Mozamel M. Saeed"}, {"authorId": "1694612", "name": "Z. Aghbari"}, {"authorId": "2041986763", "name": "Mohammed Alsharidah"}], "citations": [{"paperId": "e9876b1474f0d79529a2fa592bcce39ee789c1ca", "title": "Big data clustering based on spark chaotic improved particle swarm optimization"}, {"paperId": "c1b734c80191ac6b232e8d1832be816f9aa1a530", "title": "Data Nuggets: A Method for Reducing Big Data While Preserving Data Structure"}, {"paperId": "fd58cd4ea90cf2443f7975627c7e9dee6f5f42cc", "title": "A novel clustering based method for characterizing household electricity consumption profiles"}, {"paperId": "33d6f49f2b4a2cea2d91fe6d2c328bdba76746c1", "title": "The effect of big data technologies usage on social competence"}, {"paperId": "d8e2739879e7f6e500caace79a6bfce1cde9e584", "title": "Efficient and secure medical big data management system using optimal map-reduce framework and deep learning"}, {"paperId": "9eb2baad7c7fb5048da3f02a7fea3f19fed896e5", "title": "Apache Spark Big data Analysis, Performance Tuning, and Spark Application Optimization"}, {"paperId": "50be12c8616fdab4a1b4ff95a1b13792ab2a882c", "title": "Deep learning models for cloud, edge, fog, and IoT computing paradigms: Survey, recent advances, and future directions"}, {"paperId": "29327d27b66eb8654ec964af5a55f0c3f2c4ba68", "title": "Design of feature selection algorithm for high-dimensional network data based on supervised discriminant projection"}, {"paperId": "903e37cd24ff2e63f49168c8e3c46d271611ea00", "title": "Comparative Analysis of K-means and Hierarchical Clustering in Bigdata Environment"}, {"paperId": "6564a3744b88a41cf34c5aa47fc691c435b0805a", "title": "Detection of multiple anomalous instances in video surveillance systems"}, {"paperId": "28f809efa0299210dfcdab25dd4e2fdd7569bb46", "title": "Scalable clustering for EO data using efficient raster representation"}, {"paperId": "9f9515cd91ea5882236ab8359bcbb649e443ab4b", "title": "Basketball Big Data and Visual Management System under Metaheuristic Clustering"}, {"paperId": "3c10fc122dc7c9e9e31567d52b037665496e3d76", "title": "Standardized Classification of Cerebral Vasospasm after Subarachnoid Hemorrhage by Digital Subtraction Angiography"}, {"paperId": "dce2a8547fe6b425841e64e503e93c6c191b6203", "title": "Gradient-based elephant herding optimization for cluster analysis"}, {"paperId": "07bfa7ec76bda7b1514cd49e578f3c6d85abb1f6", "title": "K and starting means for k-means algorithm"}, {"paperId": "4750b5e6107e9fcb02200a65089d936b35f9c445", "title": "Deep learning in astronomy: a tutorial perspective"}, {"paperId": "31b1da55a6fcddee64ebfa6640f3551bbc206bb0", "title": "Deep Embedded Clustering with ResNets"}, {"paperId": "0084f3cb0a1754272151c5268a783f24bf5676a0", "title": "Review of deep learning: concepts, CNN architectures, challenges, applications, future directions"}, {"paperId": "e1ee2e33a5fe30b0e789e379e2f5ce25d4c8eac5", "title": "Analysis of Spatio-temporal Behavior of Research Travelers Based on Spark Big Data Computing Model"}, {"paperId": "586f014fc1089aeb56f0b14285adeb7c6f3b87b7", "title": "REAL-TIME BIG DATA CLUSTERING USING SPARK: UBER CASE STUDY"}]}
