{"paperId": "d2f23b320fb703921ffa39a132cae1971691c25e", "publicationVenue": null, "title": "Foreword First and foremost , I would like to express my sincere gratitude to my supervisors Prof", "abstract": "The Internet of Things (IoT) technologies are beneficial for both private and businesses. The growth of the technology and its rapid introduction to target fast-growing markets faces security challenges. Machine learning techniques have been recently used in research studies as a solution in securing IoT devices. These machine learning techniques have been implemented successfully in other fields. The objective of this thesis is to identify and analyze existing scientific literature published recently regarding the use of machine learning techniques in securing IoT devices. In this thesis, a systematic literature review was conducted to explore the previous research on the use of machine learning in IoT security. The review was conducted by following a procedure developed in the review protocol. The data for the study was collected from three databases i.e. IEEE Xplore, Scopus and Web of Science. From a total of 855 identified papers, 20 relevant primary studies were selected to answer the research question. The study identified 7 machine learning techniques used in IoT security, additionally, several attack models were identified and classified into 5 categories. The results show that the use of machine learning techniques in IoT security is a promising solution to the challenges facing security. Supervised machine learning techniques have better performance in comparison to unsupervised and reinforced learning. The findings also identified that data types and the learning method affects the performance of machine learning techniques. Furthermore, the results show that machine learning approach is mostly used in securing the network.", "venue": "", "year": 2019, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": null, "journal": null, "authors": [{"authorId": "47403609", "name": "Xiuyan Shao"}], "citations": []}
