{"paperId": "d2fbdb6efc2f94a2a2332ba061aaac324286d005", "publicationVenue": {"id": "61a26733-f8ab-4c45-8bd1-5d75465606e3", "name": "International Journal of Scientific Research in Computer Science Engineering and Information Technology", "type": "journal", "alternate_names": ["Int J Sci Res Comput Sci Eng Inf Technol"], "issn": "2456-3307", "url": "http://ijsrcseit.com/"}, "title": "An Overview of Apache Pig and Apache Hive", "abstract": "Ever since the enhancement of technology has taken place, the data is growing at an alarming rate. The most prominent factor of data growth is the “Social Media”, leads to the origination of a tremendous amount of data called Big Data. Big Data is a term used for data sets that are extremely large in size as well as complicated to store and process using traditional database processing applications. A saviour to deal with Big Data is “Hadoop” and two major components of Hadoop which are HDFS (Distributed Storage) and Map Reduce(Parallel Processing). Apache Pig and Hive is an essential part of the Hadoop Ecosystem. This paper covers an overview of both Apache Pig and Hive with their architecture. As Hadoop, no doubt is doing tremendously great work by storing and processing the huge volume of data but there are more frameworks now a days to increase the efficiency of Hadoop framework which are basically seen as the layers of Hadoop or a part of Apache Hadoop project. And that is why this paper includes the two most important layers namely Apache Pig and Apache Hive.", "venue": "International Journal of Scientific Research in Computer Science Engineering and Information Technology", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2019-03-15", "journal": {"name": "International Journal of Scientific Research in Computer Science, Engineering and Information Technology"}, "authors": [{"authorId": "2146660213", "name": "Saiyam Arora"}, {"authorId": "2152639043", "name": "Abinesh Verma"}, {"authorId": null, "name": "Richa Vasuja"}], "citations": []}
