{"paperId": "d2fe2cb20f42fd0f6fb55cc4ba04876f631af87f", "publicationVenue": null, "title": "An Examination on Implementation of Deep Fake in Images Through Deep Learning", "abstract": "Deep learning has been successfully used to address a variety of challenging problems, including large-scale information analysis, PC vision, and human-level control. However, deep learning engines have also been used to create software that may create risk protection, a majority rules system, and public safety. Deepfake is one of those recently developed deep learning-controlled apps. Deeply false calculations can produce phoney images and recordings that are difficult for viewers to distinguish from real ones. Deepfake is a tool used in manufactured media to produce phoney visual and auditory content based on a person's current media consumption. To make the deepfake appear plausible, fake media is used in place of a person's voice and face. Deepfakes have been used to spread misinformation as a result of this. Deepfakes are videos or pictures in which the face of one person is replaced with the face of another, usually a more famous person. With the most recent technological developments, even someone with little mechanical experience can create these recordings. This gives them the ability to mimic a prominent public figure, such as a president or VIP, increasing the potential that deepfakes will be used for other despicable ends.", "venue": "2022 Fourth International Conference on Emerging Research in Electronics, Computer Science and Technology (ICERECT)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-12-26", "journal": {"name": "2022 Fourth International Conference on Emerging Research in Electronics, Computer Science and Technology (ICERECT)", "pages": "1-7"}, "authors": [{"authorId": "2211630716", "name": "Abhilash Kumar Saxena"}, {"authorId": "2126681286", "name": "R. K N"}], "citations": [{"paperId": "c6b6987f04a1644fc90b34b0b4e28c1ca6c33bf9", "title": "BIG DATA FATAL ROLE IN BUSINESS PROCESS OPTIMIZATION USING DIFFERENT ML APPROACHES."}, {"paperId": "7fec80012584138382802c9d093440077f274c28", "title": "Advancements and Perspectives in Machine Translation: A Comprehensive Review"}, {"paperId": "846f9eb64e86e95dc8952409cba033f8b4075a8a", "title": "Air Canvas: Hand Tracking Using OpenCV and MediaPipe"}, {"paperId": "e8d0886200ac28935d2f7b794fab835e977a3dd2", "title": "Deep Learning Based Information Concealing in RGB Images"}, {"paperId": "32c2ece18aeb2e17ba639b004af58e5befa9afc2", "title": "Energy Efficient Ad-Hoc On-Demand Routing Procedure for Mobile Ad Hoc Networks"}, {"paperId": "66bbb5c78d0b5305b1289f4999b30e2f4ed19664", "title": "A Framework for IoT-based Greenhouse Monitoring System"}, {"paperId": "642a3e4819e9cb5f7f9fbce496a1ed663a83b5e6", "title": "Deep Image Inpainting using Partial Convolutions"}, {"paperId": "fa1d8731fb9301c62d1c0162c89c8b33cc7cd7fc", "title": "College Bus Navigation System"}, {"paperId": "895bd0769fef118be47cf6f6e67152a5bdc7adc7", "title": "Generating Monet Style Images Using DCGAN Based CycleGAN"}, {"paperId": "c1914cce5c0d1a96df12562a8dd05901091e50e6", "title": "An ML Ensemble Method on Fake News Detection in Social Media"}, {"paperId": "80ad91b27dcfdfc3316ffb19acebfeb73857a077", "title": "Unidirectional RVE analysis and simulation of Natural Fiber Reinforced Composites"}, {"paperId": "9ba44617679006eb737d1848f4227da425df2588", "title": "Real-Time Lane Detection for Autonomous Vehicles"}, {"paperId": "58d8d0990ce9edbe7a281b8e9c54745fc5cfa3ae", "title": "Detecting Phishing Websites using Deep Learning"}, {"paperId": "9c1eff64b947a83314b113c22a29c7a6f7a965d8", "title": "An Autonomous Multi-Modal System Based on Recognized Driving Behaviour for the Neural Internet of Transportation"}]}
