{"paperId": "d3077a722238fe2b7b717d88549ed81252eff456", "publicationVenue": null, "title": "Database Meets AI: A Survey", "abstract": "—Database and Artiﬁcial Intelligence (AI) can beneﬁt from each other. On one hand, AI can make database more intelligent (AI4DB). For example, traditional empirical database optimization techniques (e.g., cost estimation, join order selection, knob tuning, index and view selection) cannot meet the high-performance requirement for large-scale database instances, various applications and diversiﬁed users, especially on the cloud. Fortunately, learning-based techniques can alleviate this problem. On the other hand, database techniques can optimize AI models (DB4AI). For example, AI is hard to deploy in real applications, because it requires developers to write complex codes and train complicated models. Database techniques can be used to reduce the complexity of using AI models, accelerate AI algorithms and provide AI capability inside databases. Thus both DB4AI and AI4DB have been extensively studied recently. In this paper, we review existing studies on AI4DB and DB4AI. For AI4DB, we review the techniques on learning-based conﬁguration tuning, optimizer, index/view advisor, and security. For DB4AI, we review AI-oriented declarative language, AI-oriented data governance, training acceleration, and inference acceleration. Finally, we provide research challenges and future directions.", "venue": "", "year": 2020, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": null, "journal": null, "authors": [{"authorId": "50177381", "name": "Xuanhe Zhou"}, {"authorId": "1720852203", "name": "Chengliang Chai"}, {"authorId": "47949377", "name": "Guoliang Li"}, {"authorId": "46969408", "name": "Ji Sun"}, {"authorId": "2285957348", "name": "Index Advisor"}], "citations": [{"paperId": "ad539d5e6e3ef7e6498b28e1937118e1856093d5", "title": "Batch Query Memory Prediction Using Deep Query Template Representations"}]}
