{"paperId": "d30e6f6a4463daeba86a2a68151af1d4eac2507c", "publicationVenue": {"id": "668a9e68-c911-4515-9d80-90adbea0af49", "name": "Frontiers in Sustainable Food Systems", "alternate_names": ["Front Sustain Food Syst"], "issn": "2571-581X", "url": "https://www.frontiersin.org/journals/sustainable-food-systems#"}, "title": "Effects of dietary intake behavior, food supply, nutrition, and health during the COVID-19 outbreak", "abstract": "The coronavirus disease 2019 (COVID-19) pandemic, which began in 2019, has far-reaching ramifications, including economic losses and health challenges that still affect various parts of the world. During our review, we learned that the entire world is working to stop the spread of the SARS-CoV-2 outbreak. We explore ways that may lower the danger of SARS-CoV-2 contamination and useful strategies to avoid the possibility of SARS-CoV-2 spreading through food. While hygienic protocols are required in the food supply sector, cleaning, disinfection, and the avoidance of cross-contamination across food categories and other related goods at different stages of the manufacturing process remain especially important because the virus can survive for long periods of time on inert materials such as food packaging. Furthermore, personal hygiene (regular washing and disinfection), wearing gloves and using masks, garments, and footwear dedicated to maintaining hygiene provide on-site safety for food sector personnel, supply chain intermediaries, and consumers. Restrictions imposed in response to the pandemic (e.g., closure of physical workplaces, canteens, cafes, restaurants, schools, and childcare institutions), changes in household grocery shopping frequency, individuals' perceived risk of COVID-19, income losses due to the pandemic, and sociodemographic factors are among the factors. The conclusions drawn from this study consider the implications of healthy diets, food system resilience, behavior change, and nutritional imbalance for policymakers and food supply chain participants, as well as the antimicrobial effects of vitamins and nutrients. During a public health crisis, people should eat less, necessitating preventive policies and nutritional advice to deal with this.", "venue": "Frontiers in Sustainable Food Systems", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review"], "publicationDate": "2022-11-24", "journal": {"volume": "6"}, "authors": [{"authorId": "153091037", "name": "P. Roy"}, {"authorId": "2110310525", "name": "M. Song"}, {"authorId": "83732442", "name": "E. Jeon"}, {"authorId": "2110044466", "name": "So Hee Kim"}, {"authorId": "2148571813", "name": "S. Park"}], "citations": []}
