{"paperId": "d3185fb8c99258b1d37d20da5579a74a84eb43a2", "publicationVenue": {"id": "3096eb5c-d18c-4877-94cd-28edd3a9c357", "name": "International Journal of Environmental Research and Public Health", "type": "journal", "alternate_names": ["Int J Environ Res Public Health"], "issn": "1660-4601", "url": "http://www.mdpi.com/journal/ijerph/"}, "title": "Trends in Occupational Infectious Diseases in South Korea and Classification of Industries According to the Risk of Biological Hazards Using K-Means Clustering", "abstract": "Against the backdrop of the COVID-19 pandemic, it is necessary to identify these risks and determine whether the current level of management is appropriate to respond to the risk of biological hazards depending on the occupation. In this study, the incidence and fatality rates of occupational diseases were calculated using industrial accident statistics of South Korea, and trends by year using joinpoint regression and relative risk by industry using k-means clustering were evaluated for infectious diseases. We found that infectious diseases had the third highest incidence and fourth highest fatalities among all occupational diseases. In the incidence rate, joinpoints appeared in 2009 and 2018, and the annual percent change changed to 7.79, −16.63, and 82.11. The fatality rate showed a consistent increase with an annual percent change of 4.37, but it was not significant. Industries were classified into five groups according to risk, and the legal control measures of certain industries were not sufficient. Follow-up studies are needed to rectify the structural limitations of industrial accident statistics.", "venue": "International Journal of Environmental Research and Public Health", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-09-21", "journal": {"name": "International Journal of Environmental Research and Public Health", "volume": "19"}, "authors": [{"authorId": "2753491", "name": "Saemi Shin"}, {"authorId": "2185896615", "name": "W. Yoon"}, {"authorId": "5070069", "name": "S. Byeon"}], "citations": [{"paperId": "09857923884f52431207d21c3147d50334a27642", "title": "Research on the classification and control of human factor characteristics of coal mine accidents based on K-Means clustering analysis"}, {"paperId": "196d34e7a6f8f2cbd8cf72a2da0573c2d214edb2", "title": "Semivariogram Modeling based on Provincial Clusters for Infectious Diseases and Mental Health in Indonesia"}]}
