{"paperId": "d3281d7a3398c76908ba195e8bd210cd82c994a8", "publicationVenue": {"id": "a1e5df48-fbe3-4a59-8c15-5ed0ca3513ee", "name": "International Symposium on Software Engineering for Adaptive and Self-Managing Systems", "type": "conference", "alternate_names": ["Softw Eng Adapt Self-managing Syst", "Software Engineering for Adaptive and Self-Managing Systems", "Int Symp Softw Eng Adapt Self-managing Syst", "SEAMS"]}, "title": "Defining, Enforcing and Checking Privacy Policies In Data-Intensive Applications", "abstract": "The rise of Big Data is leading to an increasing demand for large-scale data-intensive applications (DIAs), which have to analyse massive amounts of personal data (e.g. customers' location, cars' speed, people heartbeat, etc.), some of which can be sensitive, meaning that its confidentiality has to be protected. In this context, DIA providers are responsible for enforcing privacy policies that account for the privacy preferences of data subjects as well as for general privacy regulations. This is the case, for instance, of data brokers, i.e. companies that continuously collect and analyse data in order to provide useful analytics to their clients. Unfortunately, the enforcement of privacy policies in modern DIAs tends to become cumbersome because (i) the number of policies can easily explode, depending on the number of data subjects, (ii) policy enforcement has to autonomously adapt to the application context, thus, requiring some non-trivial runtime reasoning, and (iii) designing and developing modern DIAs is complex per se. For the above reasons, we need specific design and runtime methods enabling so called privacy-by-design in a Big Data context. In this article we propose an approach for specifying, enforcing and checking privacy policies on DIAs designed according to the Google Dataflow model and we show that the enforcement approach behaves correctly in the considered cases and introduces a performance overhead that is acceptable given the requirements of a typical DIA.", "venue": "International Symposium on Software Engineering for Adaptive and Self-Managing Systems", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2018-05-28", "journal": {"name": "2018 IEEE/ACM 13th International Symposium on Software Engineering for Adaptive and Self-Managing Systems (SEAMS)", "pages": "172-182"}, "authors": [{"authorId": "21668539", "name": "M. Guerriero"}, {"authorId": "144273542", "name": "D. Tamburri"}, {"authorId": "1759139", "name": "E. D. Nitto"}], "citations": [{"paperId": "715a2e2e59eaf57c0c70ad1e5449b5b6316d9392", "title": "Model-driven Privacy"}, {"paperId": "02dd8842121c495eec5df98410c62d597830425a", "title": "Real-world K-Anonymity Applications: the \\textsc{KGen} approach and its evaluation in Fraudulent Transactions"}, {"paperId": "cb8af90f923d586f7e50f88d5b3f2db32c018192", "title": "Towards privacy compliance: A design science study in a small organization"}, {"paperId": "a3ccd5c18da226ebc5d670b8a1646c5dc4458d54", "title": "Revealing the Landscape of Privacy-Enhancing Technologies in the Context of Data Markets for the IoT: A Systematic Literature Review"}, {"paperId": "2f52343d55a3cc609fecd49d625036d973396d4a", "title": "AI-Enabled Automation for Completeness Checking of Privacy Policies"}, {"paperId": "4ebe001fbb6ac371ba181da453127f1b16abd304", "title": "A Security and Privacy Validation Methodology for e-Health Systems"}, {"paperId": "ba24a89be0d743d2b8c96f2ae0ba047f738bda85", "title": "DataOps for Cyber-Physical Systems Governance: The Airport Passenger Flow Case"}, {"paperId": "7a3e2a00ee5a36d2e84315c679c76508e7b697aa", "title": "How do we Evaluate Self-adaptive Software Systems?: A Ten-Year Perspective of SEAMS"}, {"paperId": "3d6263023117c39d425ced861f801ea974cbb409", "title": "Modeling Data Flow Constraints for Design-Time Confidentiality Analyses"}, {"paperId": "d7eef8a7ae4217b4c54437e8cc45d809111f8d58", "title": "An AI-assisted Approach for Checking the Completeness of Privacy Policies Against GDPR"}, {"paperId": "ca7f4c651882ca760c8a18e500ea5a3b0c3941eb", "title": "Monitoring the GDPR"}, {"paperId": "4a1d6d339382766dbfb234eb71d1dccf2c24fc66", "title": "Towards Resilient Internet of Things: Vision, Challenges, and Research Roadmap"}, {"paperId": "1246ff362a4c3de61e87a10032d9a030ed9d8077", "title": "Flaws in Flows: Unveiling Design Flaws via Information Flow Analysis"}, {"paperId": "0103b6a84dff7485b175b280443391faeae51fae", "title": "Runtime and Design Time Completeness Checking of Dangerous Android App Permissions Against GDPR"}, {"paperId": "abaf3c3535df65bd1cad2222ef2cf59e7405e749", "title": "The Influence of the Manufacturing Industry Environment, Organizational Structures, and Economic Trends on Employee Responsibilities in the Manufacturing Industry"}]}
