{"paperId": "d32d0350e3fd2f0dfde28720ab07ff3743777fea", "publicationVenue": {"id": "48c6eff8-2d43-4bad-9d9e-964d7095f1f6", "name": "The Liber Quarterly", "type": "journal", "alternate_names": ["Liber Q"], "issn": "1018-0826"}, "title": "Understanding Artificial Intelligence in Research Libraries – Extensive Literature Review", "abstract": "Artificial intelligence (AI) now forms a part of various activities in the academic world. AI will also affect how research libraries perform and carry out their services and how the various kinds of data they hold in their repositories will be used in the future. For the moment, the landscape is complex and unclear, and library personnel and leaders are uncertain about where they should lay the path ahead. This extensive literature review provides an overview of how research libraries understand, react to, and work with AI. This paper examines the roles conceived for libraries and librarians, their users, and AI. Finally, design thinking is presented as an approach to solving emerging issues with AI and opening up opportunities for this technology at a more strategic level.", "venue": "The Liber Quarterly", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-01-31", "journal": {"name": "LIBER Quarterly: The Journal of the Association of European Research Libraries"}, "authors": [{"authorId": "37060492", "name": "A. Gasparini"}, {"authorId": "2745741", "name": "Heli Kautonen"}], "citations": [{"paperId": "1b2a0772e4bb1c6b0eb3ab48fdbbbcb379001fdc", "title": "Developing a foundation for the informational needs of generative AI users through the means of established interdisciplinary relationships"}, {"paperId": "a176ddf1ba51dd9eec754350408a55bf9d6d9efa", "title": "Artificial Intelligence for Digital Heritage Innovation: Setting up a R&D Agenda for Europe"}, {"paperId": "645bf5352032e3d37f085e587df4b53ad6b35418", "title": "Improving OCR Quality in 19th Century Historical Documents Using a Combined Machine Learning Based Approach"}, {"paperId": "ed39af40bcd25d6be452aa79b4bffb74f95654cd", "title": "The timeless relevance of libraries in the age of artificial intelligence: A review"}, {"paperId": "512054306ce047c8af4370c37ca4d2c752d48793", "title": "Reference Chatbots in Canadian Academic Libraries"}, {"paperId": "b21d440148ba56e3e7df1e24f43f66b1b1078160", "title": "Tendências de Serviços para Biblioteca e as competências do profissional Bibliotecário: um olhar para o futuro"}, {"paperId": "cb87dd4fa6ba8f38bb8a2a142c0ed09c77d12367", "title": "Evaluating AI literacy proficiency among LIS researchers in ASEAN"}, {"paperId": "ec43ccee416b56bd215544b537bb87aef41b38c4", "title": "Mapping the Literature on Artificial Intelligence in Academic Libraries: A Bibliometrics Approach"}, {"paperId": "41ecb1e1658104ad2ce288c8a99e24b2e08de329", "title": "Artificial Intelligence in Subject-Specific Library Work"}, {"paperId": "ecf02af03e68e8335e816f218b0b1b837eda52b5", "title": "The position and prospects of academic libraries: weaknesses, threats and proposed strategic directions"}, {"paperId": "f433e5eb76b746ffd3dccd5c19487d19d5b9c850", "title": "Closing the Loop: Bridging Machine Learning (ML) Research and Library Systems"}, {"paperId": "7c7338cec7e17b4964bdd0672c4d75c6b5c0b11c", "title": "The shift in research trends related to artificial intelligence in library repositories during the coronavirus pandemic"}, {"paperId": "6c94a5d19417d8c73aaa203f06ebaeb842ad5b8f", "title": "Time-biased knowledge practices in cultural heritage institutions"}, {"paperId": "73944ebe7832ff71851f4607c498bba28b5800f7", "title": "Teologi Kebenaran Tuhan Perspektif Sifat Salbiyah di Kalangan Ahlussunnah Wal Jam’aah"}, {"paperId": "582704ccf75a0c4b4a58b56b13850f81cb73ed3b", "title": "FAVORITE BOOK PREDICTION SYSTEM USING MACHINE LEARNING ALGORITHMS"}, {"paperId": "7401d780dd0988a504b3c4cb66821b333c0109af", "title": "A Reflection on Tests of AI-Search Tools in the Academic Search Process at the Royal Library, Denmark: A Case Study"}, {"paperId": "7c6154138d08ad81c091b4093e55ed96caaeab6c", "title": "Cultural Heritage as Data: Digital Curation and Artificial Intelligence in Libraries"}]}
