{"paperId": "d339b568e044349370691b28adec823900b4007a", "publicationVenue": null, "title": "Machine Learning for Industrial IoT Systems", "abstract": "The use of AI algorithms in the IoT enhances the ability to analyse big data and various platforms for a number of IoT applications, including industrial applications. AI provides unique solutions in support of managing each of the different types of data for the IoT in terms of identification, classification, and decision making. In industrial IoT (IIoT), sensors, and other intelligence can be added to new or existing plants in order to monitor exterior parameters like energy consumption and other industrial parameters levels. In addition, smart devices designed as factory robots, specialized decision-making systems, and other online auxiliary systems are used in the industries IoT. Industrial IoT systems need smart operations management methods. The use of machine learning achieves methods that analyse big data developed for decision-making purposes. Machine learning drives efficient and effective decision making, particularly in the field of data flow and real-time analytics associated with advanced industrial computing networks.", "venue": "Handbook of Research on Innovations and Applications of AI, IoT, and Cognitive Technologies", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": null, "journal": {"name": "Handbook of Research on Innovations and Applications of AI, IoT, and Cognitive Technologies"}, "authors": [{"authorId": "2133116306", "name": "Mona Bakri Hassan"}, {"authorId": "2133135186", "name": "Elmustafa Sayed Ali Ahmed"}, {"authorId": "1789363", "name": "R. Saeed"}], "citations": [{"paperId": "da326bc7759f1afd985750df4b01317b9b3fe90e", "title": "Machine Learning Techniques for Detecting DDOS Attacks"}, {"paperId": "8a16473a8cc31819cf1121db858b84de22fb169b", "title": "Smart Buildings in the Age of Internet Technology: Civil Engineering's Role in Shaping an Energy-Efficient Future"}, {"paperId": "0a41f0011e47bc4f2260ee0b6670c7b8f5e1680b", "title": "An IoT-Platform-Based Deep Learning System for Human Behavior Recognition in Smart City Monitoring Using the Berkeley MHAD Datasets"}]}
