{"paperId": "d33b4944dcd21f7850100d1ba474137cc5547183", "publicationVenue": {"id": "37275deb-3fcf-4d16-ae77-95db9899b1f3", "name": "IEEE/RJS International Conference on Intelligent RObots and Systems", "type": "conference", "alternate_names": ["IROS", "Intelligent Robots and Systems", "Intell Robot Syst", "IEEE/RJS Int Conf Intell Robot Syst"], "url": "http://www.iros.org/"}, "title": "RoSA:A Mechatronically Synthesized Dataset for Rotodynamic System Anomaly Detection", "abstract": "The time-series datasets commonly applied for anomaly detection research showcase specific suboptimal properties. This work novelly conceptualizes condition state synthesis to improve the data-synthetic pipeline of an anomalous-event dataset. We demonstrate two technical contributions in this study. First, we propose a methodology to formulate, accelerate and enrich the condition state synthetic process. The proposed method includes three critical phases: analysis of a rotodynamic plant, systematic design of its condition state space, and development of a Markovian model for controlled state transitions. Second, a Rotodynamic System with Synthetic Anomaly dataset is constructed. It is a large-scale time-series dataset featuring controlled, abundant and diverse anomalous condition states, and per-time-step condition state labels. A comprehensive learning-based case study is conducted to illustrate that these unique features tangibly benefit anomaly detection research. Potential usages of the proposed dataset as an anomaly detection study benchmark are discussed.", "venue": "IEEE/RJS International Conference on Intelligent RObots and Systems", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-10-23", "journal": {"name": "2022 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS)", "pages": "2642-2649"}, "authors": [{"authorId": "2049052593", "name": "Yip Fun Yeung"}, {"authorId": "2198458141", "name": "Alex Paul-Ajuwape"}, {"authorId": "2198439002", "name": "Farida Tahiry"}, {"authorId": "102307633", "name": "Mikio Furokawa"}, {"authorId": "2113816637", "name": "Takayuki Hirano"}, {"authorId": "1396509677", "name": "K. Youcef-Toumi"}], "citations": [{"paperId": "3a8a0321879729c0c39fc019812e7e03bae1a47a", "title": "A Doppler Radar With a Sweeping Lock-in Demodulator for Machine Vibration Sensing"}, {"paperId": "9435977c21220e655a4241496f71c3e1aaaafad2", "title": "Robotic Method and Instrument to Efficiently Synthesize Faulty Conditions and Mass-Produce Faulty-Conditioned Data for Rotary Machines"}]}
