{"paperId": "d33ef83d63c44462f6eaa8746d924af27f360e09", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "VisionKG: Unleashing the Power of Visual Datasets via Knowledge Graph", "abstract": "The availability of vast amounts of visual data with heterogeneous features is a key factor for developing, testing, and benchmarking of new computer vision (CV) algorithms and architectures. Most visual datasets are created and curated for specific tasks or with limited image data distribution for very specific situations, and there is no unified approach to manage and access them across diverse sources, tasks, and taxonomies. This not only creates unnecessary overheads when building robust visual recognition systems, but also introduces biases into learning systems and limits the capabilities of data-centric AI. To address these problems, we propose the Vision Knowledge Graph (VisionKG), a novel resource that interlinks, organizes and manages visual datasets via knowledge graphs and Semantic Web technologies. It can serve as a unified framework facilitating simple access and querying of state-of-the-art visual datasets, regardless of their heterogeneous formats and taxonomies. One of the key differences between our approach and existing methods is that ours is knowledge-based rather than metadatabased. It enhances the enrichment of the semantics at both image and instance levels and offers various data retrieval and exploratory services via SPARQL. VisionKG currently contains 519 million RDF triples that describe approximately 40 million entities, and are accessible at https://vision.semkg.org and through APIs. With the integration of 30 datasets and four popular CV tasks, we demonstrate its usefulness across various scenarios when working with CV pipelines.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-24", "journal": {"name": "ArXiv", "volume": "abs/2309.13610"}, "authors": [{"authorId": "2148568431", "name": "Jicheng Yuan"}, {"authorId": "1705395670", "name": "Anh Le-Tuan"}, {"authorId": "2149797644", "name": "Manh Nguyen-Duc"}, {"authorId": "2197479", "name": "T. Tran"}, {"authorId": "1733076", "name": "M. Hauswirth"}, {"authorId": "1764470", "name": "Danh Le-Phuoc"}], "citations": []}
