{"paperId": "d33fe1d4770224d97da6e7dd7fffffa284891194", "publicationVenue": {"id": "d5a68c1a-7a3a-441d-a67b-a0fa3d5fad5b", "name": "Technium", "alternate_names": ["Technium"], "issn": "2668-778X", "url": "https://techniumscience.com/index.php/technium/index"}, "title": "Implementation of System Usablity Scale in Islamic Cultural History Interactive Learning Media Application at Madrasah Ibtidaiyah Negeri Kumbe Merauke", "abstract": "The objective of this research is to create an interactive multimedia application for teaching Islamic Cultural History at Madrasah Ibtidaiyah Negeri Kumbe Merauke. This application aims to address the students' needs resulting from a lack of comprehension during the learning process. While traditional methods like printed books have been used, they fail to provide the varied and direct interaction required for effective learning. The development process follows the waterfall method, and data is collected through interviews, questionnaires, and observation. The system design employs flowchart design, use case diagram, sequence diagram, and activity diagram. For testing, both the Blackbox method and Usability scale are used. The results of the Blackbox testing demonstrate that the functionality and appearance of the Islamic Cultural History learning application are good and meet expectations. Additionally, the usability scale assessment yields a final score of 71.81, which falls within the Good category (grade scale C). Conclusively, the data suggests that the Islamic Cultural History learning application is acceptable and beneficial for enhancing the learning process for students.", "venue": "Technium", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-11-01", "journal": {"name": "Technium: Romanian Journal of Applied Sciences and Technology"}, "authors": [{"authorId": "2106557739", "name": "Syaiful Nugraha"}, {"authorId": "69525294", "name": "H. Ismanto"}, {"authorId": "94937886", "name": "L. Sumaryanti"}, {"authorId": "72982081", "name": "Teddy Istanto"}], "citations": []}
