{"paperId": "d34393943460ec2ae2fe04a9c1f670fc6b7c6e57", "publicationVenue": {"id": "fcbcaf18-8ab1-43e1-a973-604bbc7e344e", "name": "Proceedings of the VLDB Endowment", "type": "journal", "alternate_names": ["Proceedings of The Vldb Endowment", "Proc VLDB Endow", "Proc Vldb Endow"], "issn": "2150-8097", "url": "http://dl.acm.org/toc.cfm?id=J1174", "alternate_urls": ["http://portal.acm.org/toc.cfm?CFID=21632689&CFTOKEN=99329904&WantType=Affiliated%20Organizations&coll=ACM&dl=ACM&id=J1174&idx=J1174&part=affil&title=VLDB%20Endowment&type=periodical"]}, "title": "DARLING: Data-Aware Load Shedding in Complex Event Processing Systems", "abstract": "Complex event processing (CEP) is widely employed to detect user-defined combinations, or patterns, of events in massive streams of incoming data. Numerous applications such as healthcare, fraud detection, and more, use CEP technologies to capture critical alerts, threats, or vital notifications. This requires that the technology meet real-time detection constraints. Multiple optimization techniques have been developed to minimize the processing time for CEP, including parallelization techniques, pattern rewriting, and more. However, these techniques may not suffice or may not be applicable when an unpredictable peak in the input event stream exceeds the system capacity. In such cases, one immediate possible solution is to drop some of the load in a technique known as load shedding.\n We present a novel load shedding mechanism for real-time complex event processing. Our approach uses statistics that are gathered to detect overload. The solution makes data-driven load shedding decisions to drop the less important events such that we preserve a given latency bound while minimizing the degradation in the quality of results. An extensive experimental evaluation on a broad set of real-life patterns and datasets demonstrates the superiority of our approach over the state-of-the-art techniques.", "venue": "Proceedings of the VLDB Endowment", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-11-01", "journal": {"name": "Proc. VLDB Endow.", "pages": "541-554", "volume": "15"}, "authors": [{"authorId": "2141634287", "name": "Koral Chapnik"}, {"authorId": "1819420", "name": "I. Kolchinsky"}, {"authorId": "145475383", "name": "A. Schuster"}], "citations": [{"paperId": "d6019b279dc9cac41868c5992c411b19182456f3", "title": "Admission Control with Response Time Objectives for Low-latency Online Data Systems"}, {"paperId": "257c470317c095835fa321bdcaa53f14b8c53180", "title": "Efficient multi-query evaluation for distributed CEP through predicate-based push-pull plans"}, {"paperId": "ccfceec37418e595b704da778c42ea34d562e7ed", "title": "INEv: In-Network Evaluation for Event Stream Processing"}, {"paperId": "03abd35bb56e4f3ad5c7b2236972ec49f5c5c303", "title": "Predicate-based push-pull communication for distributed CEP"}, {"paperId": "093b132eae9a4c331be32c56fe2249cbe8323263", "title": "Travel light: state shedding for efficient operator migration"}, {"paperId": "60331a1766626fa0ba417f1e3b1ec4f20a1bc8f4", "title": "DLACEP: A Deep-Learning Based Framework for Approximate Complex Event Processing"}, {"paperId": "8089d1e234983cf85cedd58992c7a9a484430e7e", "title": "HYPERSONIC: A Hybrid Parallelization Approach for Scalable Complex Event Processing"}, {"paperId": "c7db3af2c5f848536ed19f5c584bdf9e76ae2ab0", "title": "Future Scalable and Sustainable Data-Intensive Systems"}, {"paperId": "0958b2baadcb313cbe26db12b7c4c3e4ca366a26", "title": "Mining Logical Arithmetic Expressions From Proper Representations"}, {"paperId": "0801eb175a88b7faf5d736157a3f8b5e67e08613", "title": "Expert Systems With Applications"}]}
