{"paperId": "d34e1fa8d888bbccc8cce0ed25d96172cb186b0f", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Impact of Digital Twins and Metaverse on Cities: History, Current Situation, and Application Perspectives", "abstract": "To promote the expansion and adoption of Digital Twins (DTs) in Smart Cities (SCs), a detailed review of the impact of DTs and digitalization on cities is made to assess the progression of cities and standardization of their management mode. Combined with the technical elements of DTs, the coupling effect of DTs technology and urban construction and the internal logic of DTs technology embedded in urban construction are discussed. Relevant literature covering the full range of DTs technologies and their applications is collected, evaluated, and collated, relevant studies are concatenated, and relevant accepted conclusions are summarized by modules. First, the historical process and construction content of a Digital City (DC) under modern demand are analyzed, and the main ideas of a DC design and construction are discussed in combination with the key technology of DTs. Then, the metaverse is the product of the combination of various technologies in different scenes. It is a key component to promote the integration of the real world and the digital world and can provide more advanced technical support in the construction of the DC. DTs urban technology architecture is composed of an infrastructure terminal information center terminal and application server end. Urban intelligent management is realized through physical urban data collection, transmission, processing, and digital urban visualization. The construction of DTs urban platform can improve the city’s perception and decision-making ability and bring a broader vision for future planning and progression. The interactive experience of the virtual world covered by the metaverse can effectively support and promote the integration of the virtual and real, and will also greatly promote the construction of SCs. In summary, this work is of important reference value for the overall development and practical adoption of DTs cities, which improves the overall operation efficiency and the governance level of cities.", "venue": "Applied Sciences", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-12-14", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "145772859", "name": "Zhihan Lv"}, {"authorId": "103842613", "name": "Wen-long Shang"}, {"authorId": "145837053", "name": "M. Guizani"}], "citations": [{"paperId": "ba2c6caf117350c82f154b832417ca5fbe469931", "title": "Navigating the metaverse: A technical review of emerging virtual worlds"}, {"paperId": "8a9b9eed93a46c93ad6881575b0d36a24dd9e5d2", "title": "Designing an Educational Metaverse: A Case Study of NTUniverse"}, {"paperId": "8e42d3ed198f50e54f35d412a812921c69fe8c25", "title": "Review of Metaverse Technologies to Broaden Accessibility in Civil and Construction Engineering Education"}, {"paperId": "4d1b3a3ce103c9714241926e9c3cabe8d3bf770d", "title": "Metaverse cannot be an extra marketing immersive tool to increase sales in tourism cities"}, {"paperId": "1a48748e58832493d15e0f4ba902b842bb2acf0d", "title": "Developing an integrative framework for digital twin applications in the building construction industry: A systematic literature review"}, {"paperId": "41a3209cf9cb18341d2e499f667e9254f39b053c", "title": "Spatial Data Intelligence and City Metaverse: a Review"}, {"paperId": "cbd13b6a1684229be74d9e4c62f66a38640fb949", "title": "3D City Modeling on Infrastructure Construction Using Digital Twin"}, {"paperId": "41450d101ddb657292826c9f846afa75846da33d", "title": "Digital Twins for Building Industrial Metaverse."}, {"paperId": "3976f9971062657a66436c1e9acfb57a59a496cd", "title": "Specific Soft Computing Strategies for the Digitalization of Infrastructure and its Sustainability: A Comprehensive Analysis"}, {"paperId": "8ea05bbb6983a722781dc897d186a3f95d9f240d", "title": "Exploring the Confluence of IoT and Metaverse: Future Opportunities and Challenges"}, {"paperId": "3fa8eaf658169a1f8887e95ba83ca031fac15c42", "title": "A perspective from Turkey on construction of the new digital world: analysis of emotions and future expectations regarding Metaverse on Twitter"}, {"paperId": "7e57452ca3c947f1e635c3a7961a09ece1342a68", "title": "Towards Digital Twins of 3D Reconstructed Apparel Models with an End-to-End Mobile Visualization"}, {"paperId": "b8194cd8e60d8fa808ed57304c0cb781c8512871", "title": "Systematic Literature Review of Open Infrastructure BIM"}, {"paperId": "c09518951b3d312590c8712462bf8575e22a6b53", "title": "AI Art Curation: Re-imagining the city of Helsinki in occasion of its Biennial"}, {"paperId": "9e9da44f84a002abf083619bcd1fd8d2db7bebe9", "title": "Smart City Transformation: An Analysis of Dhaka and Its Challenges and Opportunities"}, {"paperId": "f5f738868470b67365982b0aa143bef607cba801", "title": "Newly Formed Cities: an AI Curation"}, {"paperId": "e4f687e9c836b51a8878dd08b6317f9a461aa618", "title": "Toward Trustworthy Metaverse: Advancements and Challenges"}, {"paperId": "c62fe861102bf346019d9ff7360cf7cf11af7024", "title": "THE MAN"}]}
