{"paperId": "d35e6ad6f3778efd965c1282170befc87bab25b0", "publicationVenue": null, "title": "Scaling distributed artificial intelligence/machine learning for decision dominance in all-domain operations", "abstract": "The pace of innovation in Artificial Intelligence (AI) is completely unprecedented, enabling AI to augment humans and increase productivity and efficiency for critical tasks and operations across the Department of Defense. AI is envisioned to support Command and Control in Joint All-Domain Operations by significantly enhancing situational awareness from heterogenous platforms, systems, and sensors deployed across multiple operational domains, and enabling more rapid and improved decision-making. To achieve these benefits, new AI architectures and capabilities are rapidly evolving and being developed that are transforming the AI landscape – with core functions and technology layers of the AI Stack being distributed between the enterprise, the edge, and embedded on-platform. This concept paper will analyze and compare centralized vs. distributed AI architectures in support of all-domain operations and explore key attributes and capabilities to directly impact the resiliency and adaptability of the AI, and its ability to provide insights and decision-support at a speed and scale of relevance to and to converge effects across all warfighting domains to overwhelm the adversary and present them with multiple dilemmas. By overcoming the traditional dependency of Centralized AI architectures on human supervision to aggregated and engineer data for algorithmic processing, Distributed AI can drastically accelerate AI processing and integrate AI capabilities and insights from the enterprise to the edge of the battlefield that will maximize mission effectiveness, reduce risk, and save lives.", "venue": "Defense + Commercial Sensing", "year": 2022, "fieldsOfStudy": ["Engineering"], "publicationTypes": null, "publicationDate": "2022-06-06", "journal": {"pages": "1211306 - 1211306-14", "volume": "12113"}, "authors": [{"authorId": "72087635", "name": "Shane Shaneman"}, {"authorId": "38595308", "name": "Jemin George"}, {"authorId": "2292403570", "name": "Carl E. Busart"}], "citations": []}
