{"paperId": "d365ac589cd2b6bc94338b518058a964e7529291", "publicationVenue": {"id": "1620da87-4387-4b9a-9bf4-22fdf74d4dc3", "name": "Symmetry", "type": "journal", "issn": "2073-8994", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172134", "alternate_urls": ["https://www.mdpi.com/journal/symmetry", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172134"]}, "title": "Blockchain Platforms and Access Control Classification for IoT Systems", "abstract": "The Internet of Things paradigm is growing rapidly. In fact, controlling this massive growth of IoT globally raises new security and privacy issues. The traditional access control mechanisms provide security to IoT systems such as DAC (discretionary access control) and mandatory access control (MAC). However, these mechanisms are based on central authority management, which raises some issues such as absence of scalability, single point of failure, and lack of privacy. Recently, the decentralized and immutable nature of blockchain technology integrated with access control can help to overcome privacy and security issues in the IoT. This paper presents a review of different access control mechanisms in IoT systems. We present a comparison table of reviewed access control mechanisms. The mechanisms’ scalability, distribution, security, user-centric, privacy and policy enforcing are compared. In addition, we provide access control classifications. Finally, we highlight challenges and future research directions in developing decentralized access control mechanisms for IoT systems.", "venue": "Symmetry", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2020-10-01", "journal": {"name": "Symmetry", "pages": "1663", "volume": "12"}, "authors": [{"authorId": "2004214900", "name": "Adam Ibrahim Abdi"}, {"authorId": "2006519", "name": "F. Eassa"}, {"authorId": "20864050", "name": "K. Jambi"}, {"authorId": "2265204297", "name": "Khalid Almarhabi"}, {"authorId": "120014857", "name": "A. Al-Ghamdi"}], "citations": [{"paperId": "0267f94bb8ea41b42676fc6316640c3f18976b3b", "title": "A Survey on Blockchain in E-Government Services: Status and Challenges"}, {"paperId": "db06ed0f603b5d5e3c85f79c03f95b5edb15cf8e", "title": "Combo-Chain: Towards a Hierarchical Attribute-Based Access Control System for IoT with Smart Contract and Sharding Technique"}, {"paperId": "2b18a182ad71abdd16b646c1b65f81f4f24cb67b", "title": "The Blockchain Model for Drug Management to Increase The Transparency of Drug Distribution and Drug Authenticity"}, {"paperId": "c6db291010635307943dc08497d7cb2227085209", "title": "Access control in Internet of Things: A survey"}, {"paperId": "ba4a98188f5787c0ff3d4baffe04e8d84acea2ac", "title": "Self-sovereign Identity-based Access Control Management in Forestry 4.0"}, {"paperId": "f1c3573eab4f205674a291234f48a5f164ba22d8", "title": "A survey on blockchain envisioned attribute based access control for internet of things: Overview, comparative analysis, and open research challenges"}, {"paperId": "9e0bc09d4d6b951b81955ed06151141ff26944c3", "title": "SMART CONTRACT IMPLEMENTATION USING BLOCKCHAIN IOV FOR VEHICLE ACCIDENT INVESTIGATION"}, {"paperId": "0e5c0eb06e7483bd2f75899937f84b3d6d093a25", "title": "Quality Management System Admin Module Development: A Study in the Department of Computer Science"}, {"paperId": "3ee6e3038116b196dfaf880c5997432eac6a3d33", "title": "AI-Enabled Consensus Algorithm in Human-Centric Collaborative Computing for Internet of Vehicle"}, {"paperId": "ba82ff855cd1575762fe0440c686574fbcb6ac15", "title": "Privacy Preservation Techniques for Secure Data Broadcasting using in Distributed Environments"}, {"paperId": "24da09bf8e69bef3ebcccfecd013c5eb04fce528", "title": "Online Processing of Vehicular Data on the Edge Through an Unsupervised TinyML Regression Technique"}, {"paperId": "f7912d7b1e696f9b3d8530993d77908a8b42fce9", "title": "Physical Visitor Access Control and Authentication Using Blockchain, Smart Contracts and Internet of Things"}, {"paperId": "857ec5f733616f0907788247ee2816065892c157", "title": "Distributed Self-Sovereign-Based Access Control System"}, {"paperId": "8eee9a1c7985e96c95193abc3830b03cc2155403", "title": "Design and implementation of a New Blockchain-based digital health passport: A Moroccan case study"}, {"paperId": "2757cfc89b3170b50187f87a0f31228c07c782d6", "title": "Optimization of attribute-based access control policy with priority filtering"}, {"paperId": "034632568db9f4a958d798f860f524a7cf38ee51", "title": "Dijital Para Birimlerinde Veri Güvenliği Ve Siber Saldırı Yöntemlerinin Analizi"}, {"paperId": "9dd76fdb134df9944fe6b949e6a0204df698651c", "title": "Enabling Decentralized and Auditable Access Control for IoT through Blockchain and Smart Contracts"}, {"paperId": "376436c963ad5935bbdc8a360c3df9e22fcb79d0", "title": "Smart contract based digital evidence management framework over blockchain for vehicle accident investigation in IoV era"}, {"paperId": "c97216e0e1a05e166867ce2c6f278a707b342edb", "title": "Hierarchical Blockchain-Based Multi-Chaincode Access Control for Securing IoT Systems"}, {"paperId": "69d615828b0a39a43081cf0dff961a3aada66010", "title": "Blockchain for IoT Applications: Taxonomy, Platforms, Recent Advances, Challenges and Future Research Directions"}, {"paperId": "9c637957b17c76d17768a1b3641d4a3e94e2a588", "title": "Unified Authentication and Access Control for Future Mobile Communication-Based Lightweight IoT Systems Using Blockchain"}, {"paperId": "0c96c2fb8758176d08ef44427bd3e1a8548fd8a3", "title": "Review on Blockchain and Access Control Systems"}, {"paperId": "446a4f5ea1e03e3ab95367ec7ea475b34c47b30d", "title": "Access Control Models"}, {"paperId": "d851308d759c03675fb56f2baaef08f3eb96bc87", "title": "Securing communication between things using blockchain technology based on authentication and SHA-256 to improving scalability in large-scale IoT"}, {"paperId": "bf47e7fd29e2853ec796a22fa1971d89715f30f3", "title": "Dynamic-IoTrust: A Dynamic Access Control for IoT Based on Smart Contracts"}, {"paperId": "ecf5a9155ca20c72b3f80cdab5c8d37f8b794406", "title": "Blockchain for IoT Access Control: Recent Trends and Future Research Directions"}, {"paperId": "3b4bce5923c4860b7a55bf22ba5b2170f1f5641d", "title": "BPDAC: A Blockchain Based and Provenance Enabled Dynamic Access Control Scheme"}, {"paperId": "9d6bd618576962241aed623ba943351ee20b3f1b", "title": "Identity Governance Framework for Privileged Users"}]}
