{"paperId": "d3731d729d7d767dd23721a174a50122f3600fbd", "publicationVenue": null, "title": "Seamless infrastructure programming and control for quality-critical cloud applications", "abstract": "By providing elastic infrastructure capacity and flexible pay-as-you-go business model, Cloud environments can significantly reduce the operational cost for resource-intensive applications like big data, deep learning, and the Internet of Things (IoT). In the application lifecycle, Clouds can not only automate the provisioning of application infrastructure, the deployment of the software components, but also provide advanced features, e.g., dynamic migration, scaling, and programmable virtual networking, for adapting the complex application to be continuously operational. However, these advanced Cloud features are so far only used at runtime phase of the application and have not yet been effectively included in the application programming model, which makes the Cloud application optimisation difficult across the entire software development and operation (DevOps) lifecycle. For applications with high-quality constraints, e.g., when processing IoT data queries within a given time window, or transmitting the data from the source to the computing resource within required latency, only runtime adaption will not be sufficient if infrastructures are not correctly designed. We thus identify our key research question as: how to seamlessly program and control the virtual infrastructure in the Cloud application DevOps lifecycle? To tackle the problem, we leveraged \"Infrastructure as Code\" to represent infrastructure specifications and model infrastructure operations. By decoupling the infrastructure abstraction from the application DevOps, we proposed the Cloud programming model and control mechanism. Overlay network mechanisms were further explored to provision a networked infrastructure. Finally, we investigated blockchain to improve Cloud Service Level Agreement (SLA) for enhancing the infrastructure service quality assurance at runtime.", "venue": "", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": null, "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "2107211027", "name": "H. Zhou"}], "citations": []}
