{"paperId": "d378c1ac188e0f763988bec8083df6405466ea4f", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Enabling Precision Medicine via Contemporary and Future Communication Technologies: A Survey", "abstract": "Precision medicine (PM) is an innovative medical approach that considers differences in the individuals’ omics, medical histories, lifestyles, and environmental information in treating diseases. To fully achieve the envisaged gains of PM, various contemporary and future technologies have to be employed, among which are nanotechnology, sensor network, big data, and artificial intelligence. These technologies and other applications require a communication network that will enable them to work in tandem for the benefit of PM. Hence, communication technology serves as the nervous system of PM, without which the entire system collapses. Therefore, it is essential to explore and determine the candidate communication technology requirements that can guarantee the envisioned gains of PM. To the best of our knowledge, no work exploring how communication technology directly impacts the development and deployment of PM solutions exists. This survey paper is designed to stimulate discussions on PM from the communication engineering perspective. We introduce the fundamentals of PM and the demands in terms of quality of service that each of the enabling technologies of PM places on the communication network. We explore the information in the literature to suggest the ideal metric values of the key performance indicators for the implementation of the different components of PM. The comparative analysis of the suitability of the contemporary and future communication technologies for PM implementation is discussed. Finally, some open research challenges for the candidate communication technologies that will enable the full implementation of PM solutions are highlighted.", "venue": "IEEE Access", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "1-1", "volume": "PP"}, "authors": [{"authorId": "1398976368", "name": "U. Chude-Okonkwo"}, {"authorId": "2054303207", "name": "B. Paul"}, {"authorId": "1747034", "name": "A. Vasilakos"}], "citations": [{"paperId": "7ea1c5b48d1cd786f569d27d2214f01f05bf8979", "title": "Design of Precision Medicine Web-service Platform Towards Health Care Digital Twin"}, {"paperId": "3d7767c1023ca29ca9a67e8d9e81fb92f8452b24", "title": "AI and 6G Into the Metaverse: Fundamentals, Challenges and Future Research Trends"}]}
