{"paperId": "d378725763572a1aa53eac89bea4a65813aeba81", "publicationVenue": null, "title": "Do Agricultural Knowledge and Innovation Systems Have the Dynamic Capabilities to Guide the Digital Transition of Short Food Supply Chains?", "abstract": "The digitalization of agriculture generates a new environment for the actors involved in agrifood production. In such a context, Agricultural Knowledge and Innovation Systems (AKISs) face the challenge of reconsidering their operational paradigms, redefining priorities, and designing strategies to achieve new aims. To do so, the actors participating in AKISs should develop and exploit a set of competencies known as dynamic capabilities, including the aptitude to sense the change in the external environment, the capacity to seize the opportunities that this change creates, and an ability to transform and adapt themselves to the new conditions that digitalization generates. In this study, using as examples the AKISs operating in Greece and Italy, we aimed to uncover if and how actors participating in these systems attempt and manage to deploy such capabilities. Based on a qualitative approach and drawing on data from two workshops, we discovered that seizing the opportunities sensed is a challenging task for AKIS actors. Our results also indicate that knowledge is a pivotal resource for AKISs, allowing actors to enhance their transformative capacity. However, to create a “collective” knowledge base, AKISs should ensure a functional connection between stakeholders and strengthen the roles of actors not actively engaged with the system, like public advisory organizations, universities, and technology providers.", "venue": "Inf.", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-30", "journal": {"name": "Inf.", "pages": "22", "volume": "15"}, "authors": [{"authorId": "52584375", "name": "C. Charatsari"}, {"authorId": "2025627", "name": "A. Michailidis"}, {"authorId": "2149316451", "name": "Martina Francescone"}, {"authorId": "2284774310", "name": "Marcello De Rosa"}, {"authorId": "2398276", "name": "D. Aidonis"}, {"authorId": "145399562", "name": "L. Bartoli"}, {"authorId": "2284774129", "name": "Giuseppe La Rocca"}, {"authorId": "88074233", "name": "L. Camanzi"}, {"authorId": "16090849", "name": "Evagelos D. Lioutas"}], "citations": []}
