{"paperId": "d37fd40588d12fd9170cd3e04d8b509772018686", "publicationVenue": {"id": "528ced1f-e949-4e1a-8fee-2ffbf0be551d", "name": "Conference on Innovative Data Systems Research", "type": "conference", "alternate_names": ["CIDR", "Conf Innov Data Syst Res"], "url": "http://cidrdb.org/"}, "title": "Topology-aware Parallel Data Processing: Models, Algorithms and Systems at Scale", "abstract": "The analysis of massive datasets requires a large number of processors. Prior research has largely assumed that tracking the actual data distribution and the underlying network structure of a cluster, which we collectively refer to as the topology, comes with a high cost and has little practical ben-eﬁt. As a result, theoretical models, algorithms and systems often assume a uniform topology; however this assumption rarely holds in practice. This necessitates an end-to-end investigation of how one can model, design and deploy topology-aware algorithms for fundamental data processing tasks at large scale. To achieve this goal, we ﬁrst develop a theoretical parallel model that can jointly capture the cost of computation and communication. Using this model, we explore algorithms with theoretical guarantees for three basic tasks: aggregation, join, and sorting. Finally, we consider the practical aspects of implementing topology-aware algorithms at scale, and show that they have the potential to be orders of magnitude faster than their topology-oblivious counterparts.", "venue": "Conference on Innovative Data Systems Research", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": null, "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "3264757", "name": "Spyros Blanas"}, {"authorId": "1713920", "name": "Paraschos Koutris"}, {"authorId": "1695128", "name": "Anastasios Sidiropoulos"}], "citations": [{"paperId": "6144efb158eb4f3f76ffead77ce54df67d6d7d63", "title": "The Hardness of Optimization Problems on the Weighted Massively Parallel Computation Model"}, {"paperId": "f44c58d800824229e0b4ebc250980754c756962d", "title": "Templating Shuffles"}, {"paperId": "dc0b96272f062a4a0dea6206c063130c8eaeb549", "title": "A New Model for Massively Parallel Computation Considering both Communication and IO Cost"}, {"paperId": "740c9893c743527db7a25b121e47e4d44157c0a6", "title": "Parallel Logic Programming: A Sequel"}, {"paperId": "9e13059a428115872e5efac3ab8ea615e6a634f0", "title": "Algorithms for a Topology-aware Massively Parallel Computation Model"}, {"paperId": "6c73be8cb4b89699afc94d7f5e79b023ae7b6809", "title": "Modularis: Modular Relational Analytics over Heterogeneous Distributed Platforms"}, {"paperId": "5c573e77829a606008bcb2bd0737b93cef3a5a5b", "title": "Modularis: Modular Data Analytics for Hardware, Software, and Platform Heterogeneity"}, {"paperId": "3b60e042b789b2d661cb3325dcd7d95a6094b154", "title": "Optimization Problems on The Weighted Massively Parallel Computation Model: Hardness and Algorithms"}, {"paperId": "3c3f8344e58ff7a8ea9c924e428bda5b8c775df6", "title": "DAPHNE: An Open and Extensible System Infrastructure for Integrated Data Analysis Pipelines"}]}
