{"paperId": "d382d7440042bf159509101b2b618842ffc29f9b", "publicationVenue": null, "title": "Big Data and its Analyzing Tools : A Perspective", "abstract": "Data are generated and stored in databases at a very high speed and hence it need to be handled and analyzed properly. Nowadays industries are extensively using Hadoop and Spark to analyze the datasets. Both the frameworks are used for increasing processing speeds in computing huge complex datasets. Many researchers are comparing both of them. Now, the big questions arising are, Is Spark a substitute for Hadoop? Is hadoop going to be replaced by spark in mere future?. Spark is “built on top of” Hadoop and it extends the model to deploy more types of computations which incorporates Stream Processing and Interactive Queries. No doubt, Spark's execution speed is much faster than Hadoop, but talking in terms of fault tolerance, hadoop is slightly more fault tolerant than spark. In this article comparison of various bigdata analytics tools are done and Hadoop and Spark are discussed in detail. This article further gives an overview of bigdata, spark and hadoop issues. In this survey paper, the approaches to resolve the issues of spark and hadoop are discussed elaborately.", "venue": "2020 6th International Conference on Advanced Computing and Communication Systems (ICACCS)", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference", "Review"], "publicationDate": "2020-03-01", "journal": {"name": "2020 6th International Conference on Advanced Computing and Communication Systems (ICACCS)", "pages": "560-565"}, "authors": [{"authorId": "1652587435", "name": "Ayshwarya Jaiswal"}, {"authorId": "51183107", "name": "V. Dwivedi"}, {"authorId": "2066685882", "name": "O. Yadav"}], "citations": [{"paperId": "d3351df715fcb26cfdc092cbd403f450ea4cb49a", "title": "A new Apache Spark-based framework for big data streaming forecasting in IoT networks"}, {"paperId": "e98d2d71dec6189eb7f33e915617e5a788a8b073", "title": "A Novel Spark-Based Attribute Reduction and Neighborhood Classification for Rough Evidence"}, {"paperId": "85328b4a8132bf4299f8cd7f8e79e850d561c8fc", "title": "Big Data Analytics: A Survey"}, {"paperId": "5efcaa74404cb32b18c2028bd6648bd37633338e", "title": "Investigating scientific collaboration networks in Iraq using cloud computing and data mining"}, {"paperId": "ef6edd7a1fb6b3154bb29ff9e4bb690dd5d7102b", "title": "Big Data Analytics in Healthcare"}]}
