{"paperId": "d39ccc676962803d89bd4b497eec492b2624622c", "publicationVenue": {"id": "256a5738-77cc-4cee-ad61-ef18264f639c", "name": "Applied Computing and Informatics", "type": "journal", "alternate_names": ["Appl Comput Informatics"], "issn": "2210-8327", "alternate_issns": ["2634-1964"], "url": "http://www.elsevier.com/wps/find/journaldescription.cws_home/724375/description#description", "alternate_urls": ["https://www.journals.elsevier.com/applied-computing-and-informatics/", "https://www.emeraldgrouppublishing.com/journal/ajms"]}, "title": "Design of a small-scale and failure-resistant IaaS cloud using OpenStack", "abstract": "PurposeMajor public cloud providers, such as AWS, Azure or Google, offer seamless experiences for infrastructure as a service (IaaS), platform as a service (PaaS) and software as a service (SaaS). With the emergence of the public cloud's vast usage, administrators must be able to have a reliable method to provide the seamless experience that a public cloud offers on a smaller scale, such as a private cloud. When a smaller deployment or a private cloud is needed, OpenStack can meet the goals without increasing cost or sacrificing data control.Design/methodology/approachTo demonstrate these enablement goals of resiliency and elasticity in IaaS and PaaS, the authors design a private distributed system cloud platform using OpenStack and its core services of Nova, Swift, Cinder, Neutron, Keystone, Horizon and Glance on a five-node deployment.FindingsThrough the demonstration of dynamically adding an IaaS node, pushing the deployment to its physical and logical limits, and eventually crashing the deployment, this paper shows how the PackStack utility facilitates the provisioning of an elastic and resilient OpenStack-based IaaS platform that can be used in production if the deployment is kept within designated boundaries.Originality/valueThe authors adopt the multinode-capable PackStack utility in favor of an all-in-one OpenStack build for a true demonstration of resiliency, elasticity and scalability in a small-scale IaaS. An all-in-one deployment is generally used for proof-of-concept deployments and is not easily scaled in production across multiple nodes. The authors demonstrate that combining PackStack with the multi-node design is suitable for smaller-scale production IaaS and PaaS deployments.", "venue": "Applied Computing and Informatics", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-09-30", "journal": {"name": "Applied Computing and Informatics"}, "authors": [{"authorId": "2140949035", "name": "Samuel Heuchert"}, {"authorId": "3407759", "name": "B. Rimal"}, {"authorId": "1740196", "name": "M. Reisslein"}, {"authorId": "2153954069", "name": "Yong Wang"}], "citations": [{"paperId": "c87696b49fa4f15f368baef845672bf8bc6f6dc6", "title": "Joint Request Updating and Elastic Resource Provisioning With QoS Guarantee in Clouds"}, {"paperId": "4597acdc4e24735c5273fcfbf6bff0c1fc008452", "title": "Experiences with on-premise open source cloud infrastructure with network performance validation"}, {"paperId": "3ed35eae89b2a189b37ea45d6e432cfee870e80f", "title": "Ubi-Flex-Cloud: ubiquitous flexible cloud computing: status quo and research imperatives"}, {"paperId": "15d1d695e32f04820c044c22efddcf22c7f03bee", "title": "Indonesian Journal of Electrical Engineering and Computer Science"}]}
