{"paperId": "d39e5f10c6a5ae8ce65e2e9fdf0c8309cec187c7", "publicationVenue": {"id": "301b79ea-eb48-4eed-9bec-65e675a5cb9c", "name": "EAI Endorsed Transactions on Scalable Information Systems", "alternate_names": ["EAI Endorsed Trans Scalable Inf Syst"], "issn": "2032-9407", "url": "https://eudl.eu/journal/sis"}, "title": "Optimised Transformation Algorithm For Hadoop Data Loading in Web ETL Framework", "abstract": "Web ETL unlike conventional ETL framework requires considerable improvements in all the three layers i.e. Extraction, Transformation and Loading due to the inherent nature of web input data. Websites are huge and are unique source of information, out of such huge information available on the websites, finding and analysing the required and relevant data is critical as the data may be foul consisting of redundant data or misspelled. Determining integrated record that stands for identical real world entities in abundant ways is the major problem to be analysed for any database. Hence, Web ETL transformation layer functionality of data transformation becomes mandatory in determining the pertinent information to be examined. Since the data on the web is “very voluminous” hence loading only clean data in data warehouse is necessary for fast processing to achieve accurate result. The present research focuses on data transformation in web ETL framework and proposes a modified technique to employ token wise sentence sorting to remove redundant records from the patent database along with Levenshtein distance used for string matching. Afterwards the cleaned data is transformed and loaded from this staging area to hadoop environment. The integration of proposed transformation technique with hadoop system delimits the constraint of data processing, storage and retrieval of large data structure from conventional data warehouse system.", "venue": "EAI Endorsed Transactions on Scalable Information Systems", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-07-13", "journal": {"name": "EAI Endorsed Trans. Scalable Inf. Syst.", "pages": "e6", "volume": "7"}, "authors": [{"authorId": "2061294875", "name": "Gaurav Gupta"}, {"authorId": "40413798", "name": "Neelesh Kumar"}, {"authorId": "2241819", "name": "Indu Chhabra"}], "citations": [{"paperId": "c42c465f76bf9f106145aebdabdd11d2a87f4978", "title": "Conceptual modeling of big data SPJ operations with Twitter social medium"}, {"paperId": "fda5da3985f8ba2f10689d80c425dd019cb8ae3e", "title": "Conceptual modeling of Big Data extraction phase"}]}
