{"paperId": "d3adcf0dd48abb48828ea0c00b0f1db71f0898c9", "publicationVenue": null, "title": "Big Data in Health: New Challenges and New Solutions in Data Management (A Lifecycle Review)", "abstract": "Background: Collecting and analyzing large volumes of disparate datasets are of major challenges arisen from the emergence of Big Data in the field of health. But the technology of Big Data is also associated with promising opportunities which can provide improvement of performance and facilitation of innovation in organizations. Objective: Since determining the lifetime is a practical approach regarding recognition of a phenomenon and its management, this paper aimed at identifying the challenges and opportunities of managing Big Data in the area of health at different stages of the lifecycle of Big Data. Methodology: This article is a structured review. After an initial review, 6 phases was detected in the lifecycle of Big Data, then the processes of traditional data were briefly reviewed in each phase, and the challenges associated with the emergence of Big Data and the solutions for their optimal management were discussed. Results: This study offers a broad over view of the advent of Big Data in the health sector, and provides a clear and accurate picture of the processes before and after its emergence through a comparative-based survey in each phase. The article points out innovations and modern methods of collection, pre-processing, and analysis of Big Data as well as the process of data extracting. It also describes cloud computing applications in the storage and release of Big Data. Conclusions: Our findings indicate that management of Big Data in health, based on its lifecycle, is resourceful for managers and policy-makers, in order to benefit from the technological features of Big Data with a managerial approach, to evaluate challenges, to apply innovative solutions at each phase of Big Data maturation, and to advance towards a new level of innovation, competitiveness, and productivity.", "venue": "", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2017-04-07", "journal": {"name": "Indian journal of science and technology", "pages": "1-9", "volume": "10"}, "authors": [{"authorId": "40863248", "name": "H. Ehtesham"}, {"authorId": "3062107", "name": "R. Safdari"}, {"authorId": "6113090", "name": "Shahram Tahmasebian"}], "citations": [{"paperId": "4469f98a70602326fd9708b9488e3ff324ede326", "title": "Nanoparticles impact in biomedical waste management"}, {"paperId": "adc0c5c26ff61532de8adb0c9d1a5bf4e8263823", "title": "Smart healthcare framework for ambient assisted living using IoMT and big data analytics techniques"}, {"paperId": "8c7ab06a633bd93985b129635056470a6216f041", "title": "Big Data Technology-Enabled Analytical Solution for Quality Assessment of Higher Education Systems"}]}
