{"paperId": "d3b322f2cdf3ff0d96d68cce1daff92573e0c6e7", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Exploring Machine Learning-Based Fault Monitoring for Polymer-Based Additive Manufacturing: Challenges and Opportunities", "abstract": "Three-dimensional printing, often known as additive manufacturing (AM), is a groundbreaking technique that enables rapid prototyping. Monitoring AM delivers benefits, as monitoring print quality can prevent waste and excess material costs. Machine learning is often applied to automating fault detection processes, especially in AM. This paper explores recent research on machine learning-based mechanical fault monitoring systems in fused deposition modeling (FDM). Specifically, various machine learning-based algorithms are applied to measurements extracted from different parts of a 3D printer to diagnose and identify faults. The studies often use mechanical-based fault analysis from data gathered from sensors that measure attitude, acoustic emission, acceleration, and vibration signals. This survey examines what has been achieved and opens up new opportunities for further research in underexplored areas such as SLM-based mechanical fault monitoring.", "venue": "Italian National Conference on Sensors", "year": 2022, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2022-12-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "22"}, "authors": [{"authorId": "2041295856", "name": "G. Sampedro"}, {"authorId": "80105852", "name": "S. Rachmawati"}, {"authorId": "2157216557", "name": "Dong‐Seong Kim"}, {"authorId": "120704782", "name": "Jae-Min Lee"}], "citations": [{"paperId": "1ed8bc64931c4a115b0c7e31862269b1764b3928", "title": "Machine Vision-Based Surface Defect Detection Study for Ceramic 3D Printing"}, {"paperId": "83c55f2f8a605eecc904a6cac4b5aa3e818a4638", "title": "Advances in Machine‐Learning Enhanced Nanosensors: From Cloud Artificial Intelligence Toward Future Edge Computing at Chip Level"}, {"paperId": "d9168634ce2b8a5dfda06d0bb71656081f1ab195", "title": "Machine learning and sensor-based approach for defect detection in MEX additive manufacturing process- A Review"}, {"paperId": "c1ac3563bccf85c7caa69a27a7ff9834fb68a124", "title": "Additive Manufacturing of AISI 316L Stainless Steel: A Review"}, {"paperId": "a0c3f43435aa1ec2f93de833b315dad125407daa", "title": "HFTL: Hierarchical Federated Transfer Learning for Secure and Efficient Fault Classification in Additive Manufacturing"}, {"paperId": "2b0f674dbce905ff22f2013eca86d9d5d6c70add", "title": "3D-AmplifAI: An Ensemble Machine Learning Approach to Digital Twin Fault Monitoring for Additive Manufacturing in Smart Factories"}, {"paperId": "e85028b156ddced6f35a8174ac3b14182a1bc9f2", "title": "Toward Accurate Fused Deposition Modeling 3D Printer Fault Detection Using Improved YOLOv8 With Hyperparameter Optimization"}, {"paperId": "e2f0e42ad9bed5ccf53ae370959bba8ed55200d7", "title": "Closed Loop Control of Melt Pool Width in Laser Directed Energy Deposition Process Based on PSO-LQR"}, {"paperId": "83db1862d1c078e254fac8d8477d46e31fa2cd49", "title": "Industrial Internet of Things-Based Fault Mitigation for Smart Additive Manufacturing Using Multi-Flow BiLSTM"}]}
