{"paperId": "d3cdc703636c8713438688a6451fbf3aa9c2bbfd", "publicationVenue": {"id": "e57f7e14-2158-47fb-8409-d4f185d70242", "name": "Health Informatics Journal", "type": "journal", "alternate_names": ["Health Informatics J"], "issn": "0965-8335", "alternate_issns": ["1460-4582"], "url": "http://jhi.sagepub.com/", "alternate_urls": ["https://journals.sagepub.com/doi/full/10.1177/1460458216656471", "https://journals.sagepub.com/loi/jhib"]}, "title": "A priority queue-based telemonitoring system for automatic diagnosis of heart diseases in integrated fog computing environments", "abstract": "Various studies have shown the benefits of using distributed fog computing for healthcare systems. The new pattern of fog and edge computing reduces latency for data processing compared to cloud computing. Nevertheless, the proposed fog models still have many limitations in improving system performance and patients’ response time. This paper, proposes a new performance model by integrating fog computing, priority queues and certainty theory into the Edge computing devices and validating it by analyzing heart disease patients' conditions in clinical decision support systems (CDSS). In this model, a Certainty Factor (CF) value is assigned to each symptom of heart disease. When one or more symptoms show an abnormal value, the patient’s condition will be evaluated using CF values in the fog layer. In the fog layer, requests are categorized in different priority queues before arriving into the system. The results demonstrate that network usage, latency, and response time of patients’ requests are respectively improved by 25.55%, 42.92%, and 34.28% compared to the cloud model. Prioritizing patient requests with respect to CF values in the CDSS provides higher system Quality of Service (QoS) and patients’ response time.", "venue": "Health Informatics Journal", "year": 2022, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-10-01", "journal": {"name": "Health Informatics Journal", "volume": "28"}, "authors": [{"authorId": "49827804", "name": "A. Golkar"}, {"authorId": "2295390376", "name": "Razieh Malekhosseini"}, {"authorId": "2478410", "name": "K. RahimiZadeh"}, {"authorId": "40792925", "name": "A. Yazdani"}, {"authorId": "2140545259", "name": "A. Beheshti"}], "citations": []}
