{"paperId": "d3d04c57b81dff40d7459dc8f4413c4541d7dcbb", "publicationVenue": {"id": "1c1a7c8a-c391-431c-934b-cf74458f9e6c", "name": "International Conference on Natural Computation, Fuzzy Systems and Knowledge Discovery", "type": "conference", "alternate_names": ["ICNC-FSKD", "Int Conf Nat Comput Fuzzy Syst Knowl Discov"], "url": "http://www.wikicfp.com/cfp/program?id=1428"}, "title": "Distributed XPath query processing over large XML data based on MapReduce framework", "abstract": "The volume of XML data is tremendous in many areas, especially in data logging and scientific areas. XPath query is the core operation of XML process. It is a challenge to query massive XML data stored in a distributed manner. In this paper, we present an efficient distributed XPath query processing using MapReduce, which simultaneously processes queries for a massive volume of XML data. We first use virtual nodes to split the large scale XML data file into filesplits to the distributed storage system. Then we present the distributed XPath query algorithm to compute different fragments of the document tree in parallel using the MapReduce framework. Furthermore, in order to handle the large XML data efficiently, we build the partitional index and use random access mechanism to perform the query. The experimentation shows that our approach is efficient and scalable on this issue.", "venue": "International Conference on Natural Computation, Fuzzy Systems and Knowledge Discovery", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2016-08-01", "journal": {"name": "2016 12th International Conference on Natural Computation, Fuzzy Systems and Knowledge Discovery (ICNC-FSKD)", "pages": "1447-1453"}, "authors": [{"authorId": "49950729", "name": "Hongjie Fan"}, {"authorId": null, "name": "Dongsheng Wang"}, {"authorId": "2108414477", "name": "Junfei Liu"}], "citations": [{"paperId": "18575f052c3d7bb1701c611b146cdb0786e63016", "title": "Handling distributed XML queries over large XML data based on MapReduce framework"}, {"paperId": "94dfd69087c5af63b476e84c8b1c6f6127326f63", "title": "Efficient Storage and Parallel Query of Massive XML Data in Hadoop"}]}
