{"paperId": "d3d7a47e6c3913417dba5ac74dbb6905c4023dd9", "publicationVenue": null, "title": "A Distributed Cache Mechanism of HDFS to Improve Learning Performance for Deep Reinforcement Learning", "abstract": "Hadoop distributed file system (HDFS) has been widely used in deep reinforcement learning due to its high reliability and high performance. However, the dataset for training deep reinforcement learning models is usually composed of a large number of small files, which will cause the severe performance degradation of HDFS. Although many methods have been proposed to address small files problem in HDFS, none of them considers correlations between small files for training deep reinforcement learning models. To improve the learning performance for deep reinforcement learning, this paper proposes a new HDFS architecture, which uses a distributed cache mechanism to improve data access efficiency for training deep reinforcement learning models. The experimental results show that the proposed HDFS with distributed cache mechanism can achieve better learning performance compared to the traditional HDFS without cache and with centralized caching mechanism.", "venue": "2022 IEEE Intl Conf on Parallel & Distributed Processing with Applications, Big Data & Cloud Computing, Sustainable Computing & Communications, Social Computing & Networking (ISPA/BDCloud/SocialCom/SustainCom)", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-12-01", "journal": {"name": "2022 IEEE Intl Conf on Parallel & Distributed Processing with Applications, Big Data & Cloud Computing, Sustainable Computing & Communications, Social Computing & Networking (ISPA/BDCloud/SocialCom/SustainCom)", "pages": "280-285"}, "authors": [{"authorId": "3312750", "name": "Yongqiang Gao"}, {"authorId": "2212622437", "name": "Shunyi Feng"}, {"authorId": "2212036545", "name": "Zhenkun Li"}], "citations": [{"paperId": "2884429203cca680bf1e739f37224ffc4e17ae06", "title": "Load Balancing Large Data Sets in a Hadoop Cluster"}]}
