{"paperId": "d3f2094caacaf12c2993440d79d96cd3c035689c", "publicationVenue": {"id": "1c33551e-10c3-4d44-84d5-3be94805ee3e", "name": "Journal of Advanced Transportation", "type": "journal", "alternate_names": ["J Adv Transp"], "issn": "0197-6729", "url": "https://www.hindawi.com/journals/jat/", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/20423195", "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)2042-3195"]}, "title": "A Fatigue Driving Detection Algorithm Based on Facial Motion Information Entropy", "abstract": "Research studies on machine vision-based driver fatigue detection algorithm have improved traffic safety significantly. Generally, many algorithms asses the driving state according to limited video frames, thus resulting in some inaccuracy. We propose a real-time detection algorithm involved in information entropy. Particularly, this algorithm relies on the analysis of sufficient consecutive video frames. First, we introduce an improved YOLOv3-tiny convolutional neural network to capture the facial regions under complex driving conditions, eliminating the inaccuracy and affections caused by artificial feature extraction. Second, we construct a geometric area called Face Feature Triangle (FFT) based on the application of the Dlib toolkit as well as the landmarks and the coordinates of the facial regions; then we create a Face Feature Vector (FFV), which contains all the information of the area and centroid of each FFT. We use FFV as an indicator to determine whether the driver is in fatigue state. Finally, we design a sliding window to get the facial information entropy. Comparative experiments show that our algorithm performs better than the current ones on both accuracy and real-time performance. In simulated driving applications, the proposed algorithm detects the fatigue state at a speed of over 20 fps with an accuracy of 94.32%.", "venue": "Journal of Advanced Transportation", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2020-06-15", "journal": {"name": "Journal of Advanced Transportation"}, "authors": [{"authorId": "47349202", "name": "Feng You"}, {"authorId": "2114981352", "name": "Y. Gong"}, {"authorId": "2064691994", "name": "Hai-qing Tu"}, {"authorId": "2118674086", "name": "Jianzhong Liang"}, {"authorId": "49528991", "name": "Hai-wei Wang"}], "citations": [{"paperId": "39502d1251965f1d95b0db977e10a0d3ed73ea60", "title": "SleepyWheels: An ensemble model for drowsiness detection leading to accident prevention"}, {"paperId": "5355cf77cc96f2a0fd1ff0b07d1bf51c50ab24f3", "title": "A systematic review for the fatigue driving behavior recognition method"}, {"paperId": "9125046de34fa49d3a47f637e840737e53078a92", "title": "Detection of Drowsiness among Drivers Using Novel Deep Convolutional Neural Network Model"}, {"paperId": "a00c5d056271b4766a0079cfa9724cd3f21002c3", "title": "Remote photoplethysmography (rPPG) based learning fatigue detection"}, {"paperId": "1329c0e7c9af6ec87ca777473a3d968299400e36", "title": "Machine learning and deep learning techniques for driver fatigue and drowsiness detection: a review"}, {"paperId": "001e02abeadec4d440675795f5517820a0948723", "title": "Real-time driver fatigue detection system with deep learning on a low-cost embedded system"}, {"paperId": "c0783d5276ba7a994488314b5eb12d837c7dd787", "title": "Pet dog facial expression recognition based on convolutional neural network and improved whale optimization algorithm"}, {"paperId": "7ddc720b0dbd2caaa6c133e2d5eed02dfbb6b4bd", "title": "Real-Time Drowsiness Detection System for Student Tracking using Machine Learning"}, {"paperId": "d1a86058cf8a742c6e6eaeebb82b6c74cea23957", "title": "Study on Drivers’ Visual Load Features in Lighting Environments of Interior Zones of Extra-Long Tunnels over 10 km"}, {"paperId": "8526aa8fbe9864db0deb9e09ecbfdad77a6d684d", "title": "A real-time driver fatigue identification method based on GA-GRNN"}, {"paperId": "a77f1f7c658231ac896169f3b277d1ab42681a8d", "title": "Study on the Effect of Judgment Excitation Mode to Relieve Driving Fatigue Based on MF-DFA"}, {"paperId": "93d69446526a64911643c41325a94a22d45aaeb5", "title": "Data-driven Learning Fatigue Detection System: A Multimodal Fusion Approach of ECG (electrocardiogram) and Video Signals"}, {"paperId": "13cf9352217cdb1522e64c8df711b444b84d4281", "title": "A Review of Recent Developments in Driver Drowsiness Detection Systems"}, {"paperId": "180d6c52a1edab4756d6b42461833c11ed142c68", "title": "Extraction of Optimal Measurements for Drowsy Driving Detection considering Driver Fingerprinting Differences"}, {"paperId": "06927fcaf4d08af2cc113f7c649b51f412d7f427", "title": "Evaluating medical aesthetics treatments through evolved age-estimation models"}, {"paperId": "641eb949c8cbd3a4ea03a26b993a44338601e058", "title": "Community Overlapping Detection Algorithm based on Bias-Subordination"}, {"paperId": "d6f53483141850deaddf02b3e390b9dc026d23a2", "title": "A sophisticated Drowsiness Detection System via Deep Transfer Learning for real time scenarios"}, {"paperId": "d8c9baa3b0cfe1c6f9db4f74eeca895658b60e62", "title": "Spatio-Temporal Features based Human Action Recognition using Convolutional Long Short-Term Deep Neural Network"}, {"paperId": "08a7aa08cbb08dbfab50202127858b8e443fb52a", "title": "Driver Fatigue Tracking and Detection Method Based on OpenMV"}, {"paperId": "e292cb0d8aa33a8bd1d1bcf42570c1c46a0a45fa", "title": "Driver Fatigue Detection using Deep Learning"}]}
