{"paperId": "d3fb70da80288a1a47b3b0b6f131df0f846928fe", "publicationVenue": {"id": "312ca99c-9149-490d-813e-c60d5e949f65", "name": "Concurrency and Computation", "type": "journal", "alternate_names": ["Concurr Comput Pract Exp", "Concurrency and Computation: Practice and Experience", "Concurr Comput"], "issn": "1532-0626", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/77004395?CRETRY=1&SRETRY=0", "alternate_urls": ["http://www3.interscience.wiley.com/cgi-bin/jtoc?ID=77004395", "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1532-0634"]}, "title": "Clustering‐based routing protocol using gray wolf optimization and technique for order of preference by similarity to ideal solution algorithms in the vehicular ad hoc networks", "abstract": "In a vehicular ad‐hoc network (VANET), each vehicle is equipped with an on‐board unit to communicate vehicle to vehicle or vehicle to fixed infrastructure. VANET technology is offered to provide many facilities to passengers and drivers, including safety, entertainment, mobile commerce, driver assistance, and emergency alarms. VANET has unique features such as high‐speed node mobility and network topology dynamics. These special features cause many problems such as increased transmission delays and packet loss. On the other hand, providing a good routing plan for VANET is a critical issue. Therefore, this article proposes a cluster‐based routing using in‐vehicle meta‐heuristic algorithms (CRMHA‐VANET) which has two phases. In the first stage, the vehicles are clustered and the most suitable cluster head (CH) is selected using the gray wolf optimization algorithm (GWO). In the next step, the next suitable CH is selected for data transmission in direct paths using the technique for order of preference by similarity to ideal solution (TOPSIS). The performance of the proposed method is analyzed through several criteria such as package delivery rate, end‐to‐end delay and throughput. CRMHA‐VANET results in a 10% to 25% improvement over all performance metrics, that is, packet delivery rate, latency, and throughput, over CRBP (clustering routing based on PSO [particle swarm optimization]), WCV (weight based clustering for VANET), and AODV‐CD methods.", "venue": "Concurrency and Computation", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-08-15", "journal": {"name": "Concurrency and Computation: Practice and Experience", "volume": "34"}, "authors": [{"authorId": "2176457652", "name": "Behbod Kheradmand"}, {"authorId": "115927966", "name": "A. Ghaffari"}, {"authorId": "2355470", "name": "F. S. Gharehchopogh"}, {"authorId": "2835378", "name": "Mohammad Masdari"}], "citations": [{"paperId": "421e2c9ff1517abe83adda50f33fbd61f54b95db", "title": "An Effective Cluster Based Routing Using Multi-Objective Prairie Dog Optimization in Vehicular Ad-hoc Network"}]}
