{"paperId": "d402e3c6924e86ac3e73ddd5e3c680ced1276b9f", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Sub-Standards and Mal-Practices: Misinformation's Role in Insular, Polarized, and Toxic Interactions", "abstract": "How do users and communities respond to news from unreliable sources? How does news from these sources change online conversations? In this work, we examine the role of misinformation in sparking political incivility and toxicity on the social media platform Reddit. Utilizing the Google Jigsaw Perspective API to identify toxicity, hate speech, and other forms of incivility, we find that Reddit comments posted in response to articles on websites known to spread misinformation are 71.4% more likely to be toxic than comments responding to authentic news articles. Identifying specific instances of incivility and utilizing an exponential random graph model, we then show that when reacting to a misinformation story, Reddit users are more likely to be toxic to users of different political beliefs. Finally, utilizing a zero-inflated negative binomial regression, we identify that as the toxicity of subreddits increases, users are more likely to comment on misinformation-related submissions.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-01-27", "journal": {"name": "ArXiv", "volume": "abs/2301.11486"}, "authors": [{"authorId": "120376563", "name": "Hans W. A. Hanley"}, {"authorId": "3137133", "name": "Z. Durumeric"}], "citations": [{"paperId": "815de24dff4a4069da08027606d52db52b6fc9a0", "title": "HyperGraphDis: Leveraging Hypergraphs for Contextual and Social-Based Disinformation Detection"}, {"paperId": "bbf9d648a2c284cf30651e65cb62b2686ff405a6", "title": "Twits, Toxic Tweets, and Tribal Tendencies: Trends in Politically Polarized Posts on Twitter"}]}
