{"paperId": "d40d66a0b0447ab01c6dba5492084222d882cd82", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Piecemeal Clustering: a Self-Driven Data Clustering Algorithm", "abstract": "Various approaches have been discussed in the literature for the clustering of data, such as partitioning, hierarchical, and machine learning methods. Most of the approaches require some prior knowledge about the clusters, such as their total number. Furthermore, some previous algorithms are not robust enough to process higher-dimensional data or require a large amount of memory for computations. We propose, herein, a data clustering algorithm, Piecemeal Clustering, that successfully clusters data without prior knowledge of the number of clusters. The proposed clustering algorithm uses the similarity and density of the data to identify the number of clusters in the data set and works with both low- and high-dimensional data. We demonstrate the power of the proposed Piecemeal Clustering algorithm with two real-world data sets. It is found that the proposed algorithm outperforms seven other state-of-the-art algorithms on both of these data sets.", "venue": "IEEE Access", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "129985-130000", "volume": "10"}, "authors": [{"authorId": "153766087", "name": "M. Hasan"}, {"authorId": "1728800", "name": "R. Shahidi"}, {"authorId": "2142374017", "name": "D. Peters"}, {"authorId": "2195474976", "name": "Lesley James"}, {"authorId": "2128592533", "name": "Ray Gosine"}], "citations": [{"paperId": "13e0e6d59694efee4b11f6a59fa00ac1ff67cb61", "title": "Lithofacies Identification from Wire-Line Logs Using an Unsupervised Data Clustering Algorithm"}]}
