{"paperId": "d40ebdc8597e7b8bfb150655dde75f48841e6e3a", "publicationVenue": {"id": "a00fde74-d8df-4613-b825-0fff9f531d3f", "name": "IEEE Transactions on Network and Service Management", "type": "journal", "alternate_names": ["IEEE Trans Netw Serv Manag"], "issn": "1932-4537", "url": "http://ejournals.ebsco.com/direct.asp?JournalID=714200", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4275028", "http://ieeexplore.ieee.org/servlet/opac?punumber=4275028"]}, "title": "Toward a Green Blockchain: Engineering Merkle Tree and Proof of Work for Energy Optimization", "abstract": "Blockchain-powered smart systems deployed in different industrial applications promise operational efficiencies and improved yields, while significantly mitigating cybersecurity risks. Tradeoffs between availability and security arise at implementation, however, triggered by the additional resources (e.g., memory and computation) required by blockchain-enabled hosts. This paper applies an energy-reducing algorithmic engineering technique for Merkle Tree (MT) root calculations and the Proof of Work (PoW) algorithm, two principal elements of blockchain computations, as a means to preserve the promised security benefits but with less compromise to system availability. Using pyRAPL, a python library to measure the energy consumption of a computation, we experiment with both the standard and energy-reduced implementations of both algorithms for different input sizes. Our results show that up to 98% reduction in energy consumption is possible within the blockchain’s MT construction module, with the benefits typically increasing with larger input sizes. For the PoW algorithm, our results show up to 20% reduction in energy consumption, with the benefits being lower for higher difficulty levels. The proposed energy-reducing technique is also applicable to other key elements of blockchain computations, potentially affording even “greener” blockchain-powered systems than implied by only the results obtained thus far on the MT and PoW algorithms.", "venue": "IEEE Transactions on Network and Service Management", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-12-01", "journal": {"name": "IEEE Transactions on Network and Service Management", "pages": "3847-3857", "volume": "19"}, "authors": [{"authorId": "2204595875", "name": "Cesar Castellon Escobar"}, {"authorId": "40066494", "name": "Swapnoneel Roy"}, {"authorId": "2590649", "name": "O. P. Kreidl"}, {"authorId": "145905625", "name": "Ayan Dutta"}, {"authorId": "1701593", "name": "Ladislau Bölöni"}], "citations": [{"paperId": "db02b3a0a0a1daba453d77b0527e5d050caa288d", "title": "Critical success factors for implementing blockchain technology in construction"}, {"paperId": "d700a27f98a3d403ab7a4c0c9c6b29070f3a47cb", "title": "A double auction mechanism for virtual power plants based on blockchain sharding consensus and privacy preservation"}, {"paperId": "44fbe3b224403a8b3446684c08f1237675eb45cb", "title": "Green blockchain – A move towards sustainability"}, {"paperId": "7d87ee7c0b8a31f6086c3e5e9b50eea967318b4f", "title": "Research of trusted real‐time electrical data transmission mechanism based on Parallel Proof of Work algorithm"}, {"paperId": "22b37c3eef27ac3822846f552d5bca899a95572b", "title": "Energy-Efficient Blockchain-Enabled Multi-Robot Coordination for Information Gathering: Theory and Experiments"}, {"paperId": "0c33bce1cf2634da43c98efbd424861bdb2cb1a9", "title": "GreenPy: Evaluating Application-Level Energy Efficiency in Python for Green Computing"}, {"paperId": "68fefdda2ecb1cb068cf4933a8c34f61b31f3bc0", "title": "Blockchain Based Security and Privacy Scheme for Smart Meter Communication"}, {"paperId": "f80b86407833dedd752c3a0a3b1f01068a80353e", "title": "Blockchain Voting with Tamper Verification using Telegram Bot"}, {"paperId": "7baf40bfd0b72b2a0a3bd08350ba8ca4ea292c25", "title": "ENHANCING TRANSACTION VERIFICATION THROUGH PRUNED MERKLE TREE IN BLOCKCHAIN"}]}
