{"paperId": "d412a2f88d5a604d7d89f9a93a20afd6b2789629", "publicationVenue": {"id": "d96acb43-4a7d-406f-9c95-eb83696ea202", "name": "International Conference on Biomedical Robotics and Biomechatronics", "type": "conference", "alternate_names": ["Int Conf Biomed Robot Biomechatronics", "BioRob", "IEEE Int Conf Biomed Robot Biomechatronics", "IEEE International Conference on Biomedical Robotics and Biomechatronics"]}, "title": "Human-Robot Interaction: Kinematic and Kinetic Data Analysis Framework", "abstract": "This paper summarizes our efforts on organizing a data structure for the analysis of human generated kinematic and kinetic data. We introduce a framework to perform data analysis in a straightforward manner, from the raw data to the refined results of a particular study. We applied this framework for data collected with the MIT MANUS gym. The proposed data structure carries a summary of the raw data, in terms of mean-aggregated robotic assay, also preserving the metrics of each movement separately for further study of movements at different granularity levels. Our framework allows us to export the structure of preprocessed data in a portable format, so that data can be accessed or edited with other statistical packages. Because the framework structure is modular and scalable, requiring no prior installation or setup, it simplifies the expansion to novel metrics and novel robotic devices. Hence, it is a convenient tool to be used in studies involving the analysis of human kinematic and kinetic data collected by any robotic device.", "venue": "International Conference on Biomedical Robotics and Biomechatronics", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-11-01", "journal": {"name": "2020 8th IEEE RAS/EMBS International Conference for Biomedical Robotics and Biomechatronics (BioRob)", "pages": "235-239"}, "authors": [{"authorId": "9323116", "name": "C. B. Moretti"}, {"authorId": "143760893", "name": "A. Delbem"}, {"authorId": "32156134", "name": "H. Krebs"}], "citations": [{"paperId": "2eeb381f9bdf7464dc3f7ed25bf6e5b93fb923ae", "title": "A Preliminary Study on the Functional Coupling between Nerve and Blood Microcirculation for Applications in Rehabilitation Robots"}, {"paperId": "cc4f823e74f13a3ff725ba24e61f0f25084710a6", "title": "Robotic Kinematic measures of the arm in chronic Stroke: part 1 – Motor Recovery patterns from tDCS preceding intensive training"}]}
