{"paperId": "d4186fea23b2dfa88221a0bcb8befaf042000b19", "publicationVenue": {"id": "1944b6e1-2c1d-4f42-88e3-9f8a52f57e47", "name": "Diagnostics", "issn": "2075-4418", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217965", "alternate_urls": ["https://www.mdpi.com/journal/diagnostics", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217965"]}, "title": "Fog-Based Smart Cardiovascular Disease Prediction System Powered by Modified Gated Recurrent Unit", "abstract": "The ongoing fast-paced technology trend has brought forth ceaseless transformation. In this regard, cloud computing has long proven to be the paramount deliverer of services such as computing power, software, networking, storage, and databases on a pay-per-use basis. The cloud is a big proponent of the internet of things (IoT), furnishing the computation and storage requisite to address internet-of-things applications. With the proliferating IoT devices triggering a continual data upsurge, the cloud–IoT interaction encounters latency, bandwidth, and connectivity restraints. The inclusion of the decentralized and distributed fog computing layer amidst the cloud and IoT layer extends the cloud’s processing, storage, and networking services close to end users. This hierarchical edge–fog–cloud model distributes computation and intelligence, yielding optimal solutions while tackling constraints like massive data volume, latency, delay, and security vulnerability. The healthcare domain, warranting time-critical functionalities, can reap benefits from the cloud–fog–IoT interplay. This research paper propounded a fog-assisted smart healthcare system to diagnose heart or cardiovascular disease. It combined a fuzzy inference system (FIS) with the recurrent neural network model’s variant of the gated recurrent unit (GRU) for pre-processing and predictive analytics tasks. The proposed system showcases substantially improved performance results, with classification accuracy at 99.125%. With major processing of healthcare data analytics happening at the fog layer, it is observed that the proposed work reveals optimized results concerning delays in terms of latency, response time, and jitter, compared to the cloud. Deep learning models are adept at handling sophisticated tasks, particularly predictive analytics. Time-critical healthcare applications reap benefits from deep learning’s exclusive potential to furnish near-perfect results, coupled with the merits of the decentralized fog model, as revealed by the experimental results.", "venue": "Diagnostics", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-01", "journal": {"name": "Diagnostics", "volume": "13"}, "authors": [{"authorId": "2178882650", "name": "A. Nancy"}, {"authorId": "144451863", "name": "D. Ravindran"}, {"authorId": "27506164", "name": "D. Vincent"}, {"authorId": "10854963", "name": "Kathiravan Srinivasan"}, {"authorId": "2116630649", "name": "Chuan-Yu Chang"}], "citations": [{"paperId": "41fed6949f27c4feb650d3932bcc8b9708781a6f", "title": "iCardo 3.0: ECG-Based Prediction of Conduction Disturbances Using Demographic Features"}, {"paperId": "e50a6b89ace96c70f9585adea209fe9bad081aaa", "title": "An optimized deep learning framework to enhance internet of things and fog based health care monitoring paradigm"}, {"paperId": "a97db4a0b35a4cf86ec9b25b919bbb0da8ecbec8", "title": "DengueFog: A Fog Computing-Enabled Weighted Random Forest-Based Smart Health Monitoring System for Automatic Dengue Prediction"}, {"paperId": "8124e8773782d119ad25651d4d58d6e09794aca5", "title": "Navigating Knowledge Dynamics: Algorithmic Music Recombination, Deep Learning, Blockchain, Economic Knowledge, and Copyright Challenges"}]}
