{"paperId": "d41c53a7b2f6c2e15f65d94e2a32cf0a0c64540d", "publicationVenue": null, "title": "Examining analytical practices in Latent Dirichlet Allocation within Psychological Science: A Scoping Review (Preprint)", "abstract": "\n BACKGROUND\n Background: Latent Dirichlet Allocation (LDA) is a tool for rapidly synthesising meaning from ‘big data’, but outputs can be sensitive to decisions made during the analytic pipeline. This review will focus on the complex analytical practices specific to LDA, which existing practical guides for conducting LDA have not addressed.\n \n \n OBJECTIVE\n Objectives: This scoping review will use key analytical steps (data selection, data pre-processing, and data analysis) as a framework to understand the methodological approaches being used in psychology research utilising LDA.\n \n \n METHODS\n Methods: Four psychology and health databases were searched. Studies were included if they used LDA to analyse written words and focussed on a psychological construct/issue. The data charting processes was constructed and employed based on common data selection, pre-processing, and data analysis steps.\n \n \n RESULTS\n Results: Forty-seven studies were included. These explored a range of research areas and most sourced their data from social media platforms. While some studies reported on pre-processing and data analytic steps taken, most studies did not provide sufficient detail for reproducibility. Furthermore, debate surrounding the necessity of certain pre-processing and data analysis steps is revealed.\n \n \n CONCLUSIONS\n Conclusions: Findings highlight the growing use of LDA in psychological science. However, there is a need to improve analytical reporting standards, and identify comprehensive and evidence based best practice recommendations. To work towards this, we have developed an LDA Preferred Reporting Checklist which will allow for consistent documentation of LDA analytic decisions, and reproducible research outcomes.\n", "venue": "", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2021-08-26", "journal": null, "authors": [{"authorId": "2027489709", "name": "L. Hagg"}, {"authorId": "32062602", "name": "S. Merkouris"}, {"authorId": "2084417724", "name": "Gypsy A. O’Dea"}, {"authorId": "89011538", "name": "Lauren M. Francis"}, {"authorId": "107953980", "name": "C. Greenwood"}, {"authorId": "1404972226", "name": "M. Fuller‐Tyszkiewicz"}, {"authorId": "4902297", "name": "E. Westrupp"}, {"authorId": "5116881", "name": "J. Macdonald"}, {"authorId": "34749259", "name": "G. Youssef"}], "citations": []}
