{"paperId": "d4290f8b760838738b4aba86a16df2627627c1f6", "publicationVenue": {"id": "89097a03-8be6-4e2d-ae2c-a6df64c77a06", "name": "Frontiers in Psychology", "type": "journal", "alternate_names": ["Front Psychol"], "issn": "1664-1078", "url": "http://www.frontiersin.org/Cultural_Psychology", "alternate_urls": ["http://frontiersin.org/psychology/", "https://www.frontiersin.org/journals/psychology", "http://journal.frontiersin.org/journal/psychology", "http://www.frontiersin.org/psychology"]}, "title": "Factors affecting short-term rental first price: A revenue management model", "abstract": "The aim of this paper is to conduct a revenue management study, generating a theoretical model that establishes the relationship between the factors of a Short-Term Rental apartment offered on the Airbnb marketplace or similar and its optimal rental price set when the property is first put on the market, considering not only the characteristics defined in the platform listing but also the sociodemographic characteristics of the area in which the apartment is located. The research process was structured in six phases as case study for the technology transfer model. First, research planning was conducted to estimate the time, cost, and suitability of the research topic. Second, the study design was determined to establish a technology transfer model focusing on the theory of mixed revenue management. Third, data collection about the city of Madrid was extracted from two technological databases, namely SeeTransparent based mainly on Airbnb (28 internal characteristics of the apartment) and Deskmind Research (9 sociodemographic variables of the area in which the apartment is located). Fourth, the data were prepared to create a new descriptive variable of the apartments based on geolocation. Fifth, the analysis of this study was applied to explore the correlation between the price charged per night, the 28 internal characteristics of the apartments, and the 9 sociodemographic variables of their surrounding areas. Sixth, with this integrated database, the information was transformed into multivariate inferential statistics through Exploratory Factor Analysis and Multiple Linear Regression, creating a technology transfer model (big data algorithm) that allows revenue managers to set the price of an apartment based on known information, prior to having a history of market reactions. This research process and model consider some of the factors affecting the psychological behavior of tourism consumers. Practical implications of the findings indicate that the size/capacity of the apartments used for Short-Term rentals largely determines the initial rental price set (72%). The equipment offered by the apartments has a moderate impact (18%), and the sociodemographic characteristics of the surrounding area have a minor influence (11%).", "venue": "Frontiers in Psychology", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-11-16", "journal": {"name": "Frontiers in Psychology", "volume": "13"}, "authors": [{"authorId": "2190846090", "name": "Diego de Jaureguizar Cervera"}, {"authorId": "2136652341", "name": "Diana C. Pérez-Bustamante Yábar"}, {"authorId": "151046070", "name": "Javier de Esteban Curiel"}], "citations": []}
