{"paperId": "d43ab6a6945144d896f9ac80b793440d5241b2f8", "publicationVenue": {"id": "939ba3df-4270-4ba0-ad98-ffe889f3546e", "name": "Processes", "issn": "2227-9717", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-317995", "alternate_urls": ["https://www.mdpi.com/journal/processes", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-317995"]}, "title": "AgriSecure: A Fog Computing-Based Security Framework for Agriculture 4.0 via Blockchain", "abstract": "Every aspect of the 21st century has undergone a revolution because of the Internet of Things (IoT) and smart computing technologies. These technologies are applied in many different ways, from monitoring the state of crops and the moisture level of the soil in real-time to using drones to help with chores such as spraying pesticides. The extensive integration of both recent IT and conventional agriculture has brought in the phase of agriculture 4.0, often known as smart agriculture. Agriculture intelligence and automation are addressed by smart agriculture. However, with the advancement of agriculture brought about by recent digital technology, information security challenges cannot be overlooked. The article begins by providing an overview of the development of agriculture 4.0 with pros and cons. This study focused on layered architectural design, identified security issues, and presented security demands and upcoming prospects. In addition to that, we propose a security architectural framework for agriculture 4.0 that combines blockchain technology, fog computing, and software-defined networking. The suggested framework combines Ethereum blockchain and software-defined networking technologies on an open-source IoT platform. It is then tested with three different cases under a DDoS attack. The results of the performance analysis show that overall, the proposed security framework has performed well.", "venue": "Processes", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2023-03-03", "journal": {"name": "Processes"}, "authors": [{"authorId": "2165827401", "name": "Sasmita Padhy"}, {"authorId": "2258227959", "name": "Majed Alowaidi"}, {"authorId": "150294283", "name": "Sachikanta Dash"}, {"authorId": "2210902125", "name": "Mohamed Alshehri"}, {"authorId": "104163865", "name": "Prince Priya Malla"}, {"authorId": "29851654", "name": "Sidheswar Routray"}, {"authorId": "3215305", "name": "Hesham A Alhumyani"}], "citations": [{"paperId": "bb919478099641e686221702ecd4f2bc23d7864d", "title": "Integrated Service Architecture to Promote the Circular Economy in Agriculture 4.0"}, {"paperId": "a3a99c7dd053efd8da48000c1194fec07a70cc0f", "title": "Blockchain in Agriculture to Ensure Trust, Effectiveness, and Traceability from Farm Fields to Groceries"}, {"paperId": "d51d626472837a7355fc8fc1972e6f6a449b2af3", "title": "Computing paradigms for smart farming in the era of drones: a systematic review"}, {"paperId": "9e2b1d443850741a4b80780eec28a7e1375825c7", "title": "Vehicular Safety Revolution: A Cutting-Edge Communication Paradigm for Accident Prevention"}, {"paperId": "94be673fd6487f2c67062488817d17bc2b361d72", "title": "Identification of Polyp from Colonoscopy Images by Deep Belief Network based Polyp Detector Integration Model"}, {"paperId": "379ded16c6a1fc37139d7199c78d7b698e2f4c0e", "title": "A hybrid crypto-compression model for secure brain mri image transmission"}, {"paperId": "9fdc331483a85529b10e52ee652406cd58ac25ae", "title": "PPFchain: A novel framework privacy-preserving blockchain-based federated learning method for sensor networks"}, {"paperId": "d608175365132fa6463efdf88b4da92a5addbcae", "title": "Fog Offloading and Task Management in IoT-Fog-Cloud Environment: Review of Algorithms, Networks, and SDN Application"}]}
