{"paperId": "d474242eee73d1b012f625859b403d5173650b2e", "publicationVenue": null, "title": "Crowd-Sensing Assisted Vehicular Distributed Computing for HD Map Update", "abstract": "High-definition map (HD Map) for autonomous driving brings huge pressure on networks due to its bandwidth-greedy, computing-intensive, and latency-sensitive characteristics. Data collection, transmission, and processing for HD Map update should cooperate to meet these requirements. In this paper, crowd-sensing which exploits the sensing ability of autonomous vehicles is adopted for real-time data collection. Vehicular distributed computing is adopted to improve the computing capability and reduce the transmission of massive raw environmental data. And a crowd-sensing assisted vehicular distributed computing (CS-VDC) mechanism is proposed based on the convergence of sensing, communication, and computation. In addition, considering the differences in sensing range and computing capability of different vehicles, the selection of crowd-sensing nodes and task allocation are jointly optimized to further minimize the communication load. A heuristic algorithm is developed to solve the optimization problem. The performance of the proposed mechanism is evaluated and CS-VDC can always achieve the minimum missing update ratio and amount of equivalent transmission data regardless of the parameter configuration. Especially, the amount of equivalent transmission data under the proposed CS-VDC can be reduced by 37% compared with the nearest node selection mechanism.", "venue": "ICC 2021 - IEEE International Conference on Communications", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-06-01", "journal": {"name": "ICC 2021 - IEEE International Conference on Communications", "pages": "1-6"}, "authors": [{"authorId": "2114756717", "name": "Yanli Qi"}, {"authorId": "5855965", "name": "Yiqing Zhou"}, {"authorId": "2135696", "name": "Z. Pan"}, {"authorId": "152644758", "name": "Ling Liu"}, {"authorId": "8353967", "name": "Jinglin Shi"}], "citations": [{"paperId": "d1c42490e711db3b9bd0d01a52537e717f0d1775", "title": "Data Collection for HD Map Updates through MEC-assisted Vehicle Crowdsourcing: A Trade off between Accuracy and Cost"}, {"paperId": "9e6146969693831aba497815671b7aabd4b0ff84", "title": "A Survey on Approximate Edge AI for Energy Efficient Autonomous Driving Services"}, {"paperId": "cc1dcfe3c06a56e10aad9f73188254bba626a109", "title": "HD Maps for Connected and Automated Vehicles: Enabling Technologies and Future Directions"}, {"paperId": "3c6a4ac2e209fa35bf95a741f11525a7f0e3f7fa", "title": "Perception Task Offloading With Collaborative Computation for Autonomous Driving"}, {"paperId": "f0316f812241bfffeebdc053e25aa6579edb38b5", "title": "Joint perception data caching and computation offloading in MEC-enabled vehicular networks"}, {"paperId": "15beb28fde5668afa750508ecb864f15bbd9a276", "title": "Fuzzy Q-Learning-Based Opportunistic Communication for MEC-Enhanced Vehicular Crowdsensing"}, {"paperId": "24f9dbc9dda902397869dce5ac4efdbbca255da4", "title": "High-Definition Maps: Comprehensive Survey, Challenges, and Future Perspectives"}]}
