{"paperId": "d47b2dab300ac797729c818341b152e29e251311", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Exploiting Big Data for Experiment Reporting: The Hi-Drive Collaborative Research Project Case", "abstract": "As timely information about a project’s state is key for management, we developed a data toolchain to support the monitoring of a project’s progress. By extending the Measurify framework, which is dedicated to efficiently building measurement-rich applications on MongoDB, we were able to make the process of setting up the reporting tool just a matter of editing a couple of .json configuration files that specify the names and data format of the project’s progress/performance indicators. Since the quantity of data to be provided at each reporting period is potentially overwhelming, some level of automation in the extraction of the indicator values is essential. To this end, it is important to make sure that most, if not all, of the quantities to be reported can be automatically extracted from the experiment data files actually used in the project. The originating use case for the toolchain is a collaborative research project on driving automation. As data representing the project’s state, 330+ numerical indicators were identified. According to the project’s pre-test experience, the tool is effective in supporting the preparation of periodic progress reports that extensively exploit the actual project data (i.e., obtained from the sensors—real or virtual—deployed for the project). While the presented use case concerns the automotive industry, we have taken care that the design choices (particularly, the definition of the resources exposed by the Application Programming Interfaces, APIs) abstract the requirements, with an aim to guarantee effectiveness in virtually any application context.", "venue": "Italian National Conference on Sensors", "year": 2023, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "23"}, "authors": [{"authorId": "2142654273", "name": "Alessio Capello"}, {"authorId": "2216572597", "name": "Matteo Fresta"}, {"authorId": "1693322", "name": "F. Bellotti"}, {"authorId": "2241860049", "name": "Hamed Haghighi"}, {"authorId": "46862917", "name": "Johannes Hiller"}, {"authorId": "2241847517", "name": "Sajjad Mozaffari"}, {"authorId": "143892518", "name": "Riccardo Berta"}], "citations": []}
