{"paperId": "d488445bb2bf6719bc48a4d39bd906116274abda", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "AutoTimes: Autoregressive Time Series Forecasters via Large Language Models", "abstract": "Foundation models of time series have not been fully developed due to the limited availability of large-scale time series and the underexploration of scalable pre-training. Based on the similar sequential structure of time series and natural language, increasing research demonstrates the feasibility of leveraging large language models (LLM) for time series. Nevertheless, prior methods may overlook the consistency in aligning time series and natural language, resulting in insufficient utilization of the LLM potentials. To fully exploit the general-purpose token transitions learned from language modeling, we propose AutoTimes to repurpose LLMs as Autoregressive Time series forecasters, which is consistent with the acquisition and utilization of LLMs without updating the parameters. The consequent forecasters can handle flexible series lengths and achieve competitive performance as prevalent models. Further, we present token-wise prompting that utilizes corresponding timestamps to make our method applicable to multimodal scenarios. Analysis demonstrates our forecasters inherit zero-shot and in-context learning capabilities of LLMs. Empirically, AutoTimes exhibits notable method generality and achieves enhanced performance by basing on larger LLMs, additional texts, or time series as instructions.", "venue": "arXiv.org", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-02-04", "journal": {"name": "ArXiv", "volume": "abs/2402.02370"}, "authors": [{"authorId": "2257375992", "name": "Yong Liu"}, {"authorId": "2217957790", "name": "Guo Qin"}, {"authorId": "151257628", "name": "Xiangdong Huang"}, {"authorId": "2144499343", "name": "Jianmin Wang"}, {"authorId": "2054275000", "name": "Mingsheng Long"}], "citations": []}
