{"paperId": "d48ab89a2a5edd83c385e2b60d53d90d84223520", "publicationVenue": {"id": "c4cc0f1a-dbaa-4507-bff9-ded477438657", "name": "Scandinavian Journal of Public Administration", "type": "journal", "alternate_names": ["Scand J Public Adm"], "issn": "2001-7413", "url": "http://ojs.ub.gu.se/ojs/index.php/sjpa/", "alternate_urls": ["http://ojs.ub.gu.se/ojs/index.php/sjpa/index"]}, "title": "Big Data in the Public Sector: A Systematic Literature Review", "abstract": "\n \n \nThis systematic literature review describes how the concept of Big Data in the public sector is understood theoretically and practically in the academic field. The article’s aim is to achieve a comprehensive understanding of Big Data in the public sector, an un- derstanding which does not currently exist. In order to ensure an accurate investigation in accordance with the inclusion criteria, 156 items of literature were selected from 1,643 articles and publications. Five themes were selected in order to obtain more knowledge about the topic; evolution, definition, applications, challenges and the future of Big Data in the public sector. Our findings show that such themes have been emerging more widely since 2012, however, a definition of Big Data has still not been agreed. Big Data is most commonly described with reference to its characteristics. Practical applications related to Big Data in the public sector were consequently studied, as were the challenges and pot- ential challenges that are emerging in the management of Big Data. There is great pot- ential for public administration organisations to benefit from Big Data in the future, both from its practical operations as well as its strategic management in the public sector do- main. \n \n \n", "venue": "Scandinavian Journal of Public Administration", "year": 2017, "fieldsOfStudy": ["Business"], "publicationTypes": ["Review"], "publicationDate": "2017-09-14", "journal": {"name": "Scandinavian Journal of Public Administration"}, "authors": [{"authorId": "2057249471", "name": "C. Fredriksson"}, {"authorId": "2522349", "name": "Farooq Mubarak"}, {"authorId": "119947325", "name": "Marja Tuohimaa"}, {"authorId": "2060755183", "name": "Ming Zhan"}], "citations": [{"paperId": "42f88ca80f22239cab5ed04d1bb2a722d0cad2d9", "title": "Big Data as a reform opportunity for public sector and real economy: The case of Greece"}, {"paperId": "da20d578bd08355e6c1b71d7151db25413704298", "title": "Requirements for Building a Business-Driven Reference Architecture for Implementation of Big Data Analytics by Public Sector Organizations: A Case Study of Uganda"}, {"paperId": "5269ceb4841eca47b7c3eed8574fcc6b8bff9604", "title": "Governance Democratic and Big Data: A Systematic Mapping Review"}, {"paperId": "1f2a6991518d10dbbd5ea6cfbde24bda7251388d", "title": "Padrões profissionais como fator de adaptação dos recursos humanos à indústria 4.0: abordagens para o desenvolvimento e implementação na administração pública"}, {"paperId": "1cfc1e78b19b9fe0c269850ef109229f431b9ba9", "title": "Critical Success Factors for Adopting Electronic Document Management Systems in Government Units"}, {"paperId": "0d01853d5ce89c93dbfd66dcebd0482e7f3a24ad", "title": "Automated impact assessment - How digitizing government enables rapid and tailor-made policy responses."}, {"paperId": "b952c9ffae8f8b4c30f6d1d4eaf1245c81c5ed42", "title": "Agile data management in NAV: A Case Study"}, {"paperId": "f693e7c153ef771a400de6ec43b2131ec4e9c3bd", "title": "Stakeholders’ Perceptions of New Digital Energy Management Platform in Municipality of Loulé, Southern Portugal: A SWOT-AHP Analysis"}, {"paperId": "749b236beef5fb343fe11fd7aa9e5254f7c6f341", "title": "Sustainability, Big Data and Mathematical Techniques: A Bibliometric Review"}, {"paperId": "43ffc62a49b1f61a024f949e073b1e133ed73d9b", "title": "DESIGN AND DEVELOPMENT OF A GIS-BASED PLATFORM USING OPEN SOURCE COMPONENTS FOR MONITORING, MAINTENANCE AND MANAGEMENT OF ROAD NETWORK: THE CASE STUDY OF CYPRUS"}, {"paperId": "962dddd719bf861230f6b769111ffe9666c23e30", "title": "ESTABLISHMENT OF BIG DATA ANALYTICS APPLICATION MODEL FOR MALAYSIAN PUBLIC SECTOR: AN EXPERT VALIDATION"}, {"paperId": "bf523af716697ed4931495ba6ab8cb0aac8c1bcf", "title": "Towards a Data-Driven Public Administration: An Empirical Analysis of Nascent Phase Implementation"}, {"paperId": "c1db34ae4ab55359a0af2b28d46afcfc00004da5", "title": "\"Bio to bits\": the Millennium Ecosystem Assessment (MA) as a metaphor for Big Data ecosystem assessment"}, {"paperId": "3e25bcd157083306c110e5cc8dbe134e5e12aebf", "title": "Defining the big social data paradigm through a systematic literature review approach"}, {"paperId": "8d03df21807637482739cbfe140b260aa8f1907b", "title": "Administration by algorithm: A risk management framework"}, {"paperId": "7776274ee164ae2701e6b753d614b942cf317874", "title": "Análisis de datos como alternativa para la evaluación de impacto de los programas sociales"}, {"paperId": "b424e3cb38873baae0c6764a72491e455a01d751", "title": "Exploring research trends in big data across disciplines: A text mining analysis"}, {"paperId": "bc744f4004f054c039ced816bc6e93f75a696a7a", "title": "Big Data Analytics Application Model Based on Data Quality Dimensions and Big Data Traits in Public Sector"}, {"paperId": "a19b5404f3a821cce30a2829d21f5d9b58863c90", "title": "Framing Policy Visions of Big Data in Emerging States"}, {"paperId": "949e576fe94718b27b7b46acfaaae2b91566dbc2", "title": "Experimental Methods for the Evaluation of Big Data Systems. (Méthodes expérimentales pour l'évaluation des systèmes Big Data)"}, {"paperId": "1b702499555101a4276e88375b9267869c01bb6a", "title": "Belt and Road Initiative (BRI) of China: Connecting the World for Sustainable Economic Development"}, {"paperId": "3c450f9c7e6d14c325fb0ddb7e9e4e2055a03840", "title": "Review of Big Data and Processing Frameworks for Disaster Response Applications"}, {"paperId": "35aeae558c74813006d9f431e87e67e4eda8eddd", "title": "The e-Government Development Discourse: Analysing Contemporary and Future Growth Prospects in Developing and Emerging Economies"}, {"paperId": "f2d1bbdf3a80019f13376bfd8781f75d2d5ce0c1", "title": "Determinants and Pattern of Urbanization and Counter-Urbanization: The Case of South Asia"}, {"paperId": "6a64ea9313b9f7630c292fafb12dabf05c83da27", "title": "The Limits of Policy Analytics: Early Examples and the Emerging Boundary of Possibilities"}, {"paperId": "9333bddbad553dde5e19c83a87cc0a44befe737e", "title": "Big Data Analytics in the Malaysian Public Sector: The Determinants of Value Creation"}, {"paperId": "f9abb2a5719ac1c962a3fe2f444e02727a634652", "title": "Smart governance through bigdata: Digital transformation of public agencies"}, {"paperId": "86fdb7a0b7f71ffe0ab413ac3f4bc68a903d4327", "title": "Big data creating new knowledge as support in decision-making: practical examples of big data use and consequences of using big data as decision support"}, {"paperId": "efe61122b5808fc3a1a4d67a987e3b170ca0ade7", "title": "The Prevention of Bribery in Government Agencies: The Role of Big Data and Whistle-blowing Systems"}, {"paperId": "4ed5d6d11ce468ed155a78bcaadd19f8c28bfb6c", "title": "PROFESSIONAL STANDARDS AS A FACTOR FOR ADAPTING HUMAN RESOURCES TO INDUSTRY 4.0: APPROACHES FOR DEVELOPMENT AND IMPLEMENTATION IN PUBLIC ADMINISTRATION"}, {"paperId": "dd5ca618bc825c35950daf198cc4f611d664cb38", "title": "Exploring Digital Government transformation in the EU"}, {"paperId": "1bf04f2946a59a83d4245c8782237ff6b22b0552", "title": "A Review of Big Data and Its Applications in Healthcare and Public Sector"}]}
