{"paperId": "d4a1dc6746c8ba568bc37824b11095bf841144b1", "publicationVenue": null, "title": "Deep Learning Techniques in Mobile Edge Computing for Internet of Medical Things", "abstract": "The fast expansion of the Internet of Medical Things (IoMT) has resulted in a ubiquitous home health diagnostic network. High patient demand results in high costs, short latency, and communication overload. As a result, 6G is the next generation of IoT, IoMT, and cellular networks, intending to considerably improve the quality of smart healthcare services through high throughput and decreased latency. So far, adopting cloud computing for time-critical applications and decreasing access delays to resources is difficult. Deep learning has been extensively employed to extract characteristics from complicated networks as artificial intelligence technology has advanced. On the other hand, deep learning models are often run in cloud computing data centres with tremendous processing resources. Conventional cloud computing systems primarily rely on the network, which has significant latency and security and privacy issues. One of the successful solutions is the Mobile Edge Computing (MEC) paradigm, which brings cloud computing services closer to the edge network and uses available resources. Mobile edge computing places computer and storage nodes near mobile devices at the Internet's edge, leading to considerable savings in system operating time, memory cost, and power usage. Deep learning is used in mobile edge computing to forecast changes in demand based on daily patient behaviours. It also prepares the network by scaling up network resources as required. This study aims to discuss IoMT and identfy the problems in deep learning for mobile edge computing technology and its applications.", "venue": "2023 3rd International Conference on Emerging Smart Technologies and Applications (eSmarTA)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-10-10", "journal": {"name": "2023 3rd International Conference on Emerging Smart Technologies and Applications (eSmarTA)", "pages": "1-6"}, "authors": [{"authorId": "2156467678", "name": "Abdulwadood Alawadhi"}, {"authorId": "2264404179", "name": "R. B. Ahmad"}, {"authorId": "102330835", "name": "Abdullah Almogahed"}, {"authorId": "2264463582", "name": "Ahmad Abrar"}], "citations": []}
