{"paperId": "d4ae4427f87747e88c06e100e85e8279ab5d9242", "publicationVenue": {"id": "228761ec-c40a-479b-8309-9dcbe9851bcd", "name": "IEEE Internet of Things Journal", "type": "journal", "alternate_names": ["IEEE Internet Thing J"], "issn": "2327-4662", "url": "https://www.ieee.org/membership-catalog/productdetail/showProductDetailPage.html?product=PER288-ELE", "alternate_urls": ["https://ieeexplore.ieee.org/servlet/opac?punumber=6488907", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6488907", "http://ieee-iotj.org/#"]}, "title": "When Mobile-Edge Computing (MEC) Meets Nonorthogonal Multiple Access (NOMA) for the Internet of Things (IoT): System Design and Optimization", "abstract": "Mobile-edge computing (MEC) is considered as a promising technology to enable low latency applications while consuming less energy, and nonorthogonal multiple access (NOMA) is regarded as a hopeful method of increasing spectrum efficiency and the wireless network capacity. In this article, we consider a NOMA-MEC-based Internet-of-Things (IoT) network, and propose a joint optimization framework to maximize the effective system capacity, i.e., the number of IoT devices whose tasks are processed successfully, and meanwhile to maximize the total energy saving. First, we concentrate on improving the effective system capacity from the wireless side by introducing NOMA, and from the IoT device side by task offloading decision optimization, where distributed optimization is conducted and closed-form solution is obtained. Then, we maximize the total energy saving also from two aspects, i.e., the device-side computation resource allocation, and the wireless side joint admission control, user clustering, orthogonal subcarrier assignment, and transmit power control, where we resort to graph theory and propose a low-complexity heuristic algorithm to solve it. Abundant simulation results demonstrate our proposed joint optimization algorithm performs well in both effective system capacity optimization and energy saving maximization.", "venue": "IEEE Internet of Things Journal", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-05-15", "journal": {"name": "IEEE Internet of Things Journal", "pages": "7849-7862", "volume": "8"}, "authors": [{"authorId": "2477880", "name": "Jianbo Du"}, {"authorId": "2135963569", "name": "Wenhuan Liu"}, {"authorId": "144924153", "name": "Jing Jiang"}, {"authorId": "2277855", "name": "Daosen Zhai"}, {"authorId": "144095199", "name": "Z. Ding"}], "citations": [{"paperId": "e32e285c4a124e50bc0854c57249a76533291de7", "title": "Complexity and algorithm of setting optimal location for data sink in real-time NOMA-based IIoTs"}, {"paperId": "a7da887984a1e3d3adad3369bed7cf90eb76690b", "title": "Performance Analysis of Task Offloading in Mobile Edge Computing using Multi-Objective Optimization Algorithm"}, {"paperId": "bcd5b9160507dfe804f8139ae98bfd957ce0b962", "title": "Performance analysis of NOMA enabled multi-user co-operative IoT network with SWIPT protocol"}, {"paperId": "327bb16ae44819391cb3f50c1b24fc4b98bd868f", "title": "SCMA-Enabled Multi-Cell Edge Computing Networks: Design and Optimization"}, {"paperId": "02110c1ff57984046cdfc3c5e277003fb0af2981", "title": "Non-Orthogonal Multiple Access Enabled Mobile Edge Computing in 6G Communications: A Systematic Literature Review"}, {"paperId": "d360263566b2b814417544ac138d140935561269", "title": "Digital Twin-Enabled Domain Adaptation for Zero-Touch UAV Networks: Survey and Challenges"}, {"paperId": "2c95c2c5ce1693509664daf5eab718e4fee08285", "title": "Joint resource and power allocation for 5G enabled D2D networking with NOMA"}, {"paperId": "8f314ea45c384b64f7292c18dba891b4382b836a", "title": "NOMA for 5G and beyond: literature review and novel trends"}, {"paperId": "946613700eb4f985ee27d128bff2cf249ac7349e", "title": "Collaborative Cloud-Edge-End Task Offloading in NOMA-Enabled Mobile Edge Computing Using Deep Learning"}, {"paperId": "289f799719af3d7d1df4b3b4dbf0df4aec75ad8e", "title": "QoS-aware resource allocation in mobile edge computing networks: Using intelligent offloading and caching strategy"}, {"paperId": "a71863b39c721cf055bc93925bd382e8198d10e5", "title": "Optimal Power Allocation in Downlink Multicarrier NOMA Systems: Theory and Fast Algorithms"}, {"paperId": "26d7115f31788c541d178ccd4a0e56714c93a531", "title": "Task Offloading Optimization in NOMA-Enabled Dual-Hop Mobile Edge Computing System Using Conflict Graph"}, {"paperId": "fc7ee07193c73a31a77197b4b7e88540614201f2", "title": "Deep Q-Learning Aided Energy-Efficient Caching and Transmission for Adaptive Bitrate Video Streaming Over Dynamic Cellular Networks"}, {"paperId": "ba21d3f69db195f770a5e970ce601fdc01ab1b43", "title": "Energy Coherent Fog Networks Using Multi-Sink Wireless Sensor Networks"}]}
