{"paperId": "d4b0e06a4336a4adcf06405f5814ed7cd294dff9", "publicationVenue": null, "title": "Detection of Pemphigus using Machine Learning", "abstract": "Pemphigus, a fatal class of blistering autoimmune disorders, leads the body's defense mechanisms to turn on itself. It affects 0.75 to 5 patients, per 100,000 people. Most cases occur in people between the ages of 40 and 60, and women are more likely to experience them than men. Pemphigus comes in a variety of forms, but Pemphigus Vulgaris is by far the most prevalent. The only detection methods presently available for PV are clinical which are exceedingly painful. It necessitates uncomfortable procedures like a skin biopsy, countless blood tests, and an optional endoscopy. Since PV is difficult to identify and only has the Nikolsky's sign as a sole distinctive feature, there is a lack of computer aided diagnostic. Current CAD systems can only diagnose the most common skin lesions because of their similarities. As a result, precise image-based technologies for PV disease detection are required. Our objective is to perform a comparative analysis and propose a method for PV identification in the initial stages of skin degradation. Web crawlers collected over 262 PV photos, as well as photographs from a dataset, images of certain blister diseases, and information from medical experts. Methods like image pre-processing, image enhancement, image thresholding, resizing and normalizing were employed to further improve the dataset. By implementing CNN, SVM, KNN, Gaussian, Random Forest, a comparative study was conducted with 99%,89.8%,69.7%,69.6%,78.7% accuracy.", "venue": "2023 International Conference on Recent Advances in Electrical, Electronics, Ubiquitous Communication, and Computational Intelligence (RAEEUCCI)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-04-19", "journal": {"name": "2023 International Conference on Recent Advances in Electrical, Electronics, Ubiquitous Communication, and Computational Intelligence (RAEEUCCI)", "pages": "1-6"}, "authors": [{"authorId": "2218599298", "name": "Sanjivani Dubey"}, {"authorId": "2285965700", "name": "C. Pretty"}, {"authorId": "2231543045", "name": "Diana Cyril"}], "citations": [{"paperId": "a7722394c6293754aa40afc5ec5732bfac2edaa5", "title": "Artificial Intelligence’s Use in the Diagnosis of Mouth Ulcers: A Systematic Review"}]}
