{"paperId": "d4b6949a37966174f3af85526b6f1d654b2bf940", "publicationVenue": {"id": "e4199919-38ec-4193-9abd-d27b0ec704cb", "name": "Annals of Agricultural and Environmental Medicine", "type": "journal", "alternate_names": ["Ann Agric Environ Med"], "issn": "1232-1966", "url": "http://www.aaem.pl/"}, "title": "Changes in eating behaviours and physical activity among primary schoolchildren aged 7-12 during the pandemic in the light of qualitative and quantitative research - Junior-Edu-Żywienie (JEŻ) Project.", "abstract": "INTRODUCTION AND OBJECTIVE\nThe COVID-19 pandemic had many direct and indirect effects, including lifestyle changes in all subpopulations, including children and adolescents. The aim of the study was to identify: 1) attitudes of students aged 7-12 years and their parents towards food, nutrition, and physical activity; 2) changes in the consumption of basic food products during the COVID-19 pandemic.\n\n\nMATERIAL AND METHODS\nA qualitative survey was conducted among students and their parents using the Focus Group Interview method, as well as quantitative research among parents and schoolchildren aged 10-12 years.\n\n\nRESULTS\nDuring the pandemic, changes were demonstrated in the eating habits of primary schoolchildren which were both positive and negative. Positive changes include a greater number of meals and their regularity, especially in relation to meals prepared at home, and a greater consumption of mainly fruit, and to a lesser extent vegetables and whole grain products. Among the negative changes observed were an increased consumption of salty snacks and sweets, including those prepared at home. Moreover, limiting physical activity during isolation may have resulted, as a long-term effect, in excessive body weight and obesity-related non-communicable diseases in children and adolescence, and later in adulthood.\n\n\nCONCLUSIONS\nThere is a need to develop post-pandemic support strategies addressed to both schoolchildren and their parents regarding adequate eating behaviours and physical activity.", "venue": "Annals of Agricultural and Environmental Medicine", "year": 2024, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2024-01-03", "journal": {"name": "Annals of agricultural and environmental medicine : AAEM", "pages": "\n          78-86\n        ", "volume": "31 1"}, "authors": [{"authorId": "48287145", "name": "K. Gutkowska"}, {"authorId": "2069188022", "name": "E. Czarniecka-Skubina"}, {"authorId": "11263235", "name": "J. Hamułka"}, {"authorId": "1422393812", "name": "Marta Jeruszka-Bielak"}], "citations": []}
