{"paperId": "d4bfa40f79c6b0f519c17755431732e0d76f0df6", "publicationVenue": {"id": "7dc964d5-49e6-4c37-b1c4-a7f0de1fa425", "name": "International Conference on Web and Social Media", "type": "conference", "alternate_names": ["Int Conf Weblogs Soc Media", "International Conference on Weblogs and Social Media", "Int Conf Web Soc Media", "ICWSM"], "url": "http://www.aaai.org/Library/ICWSM/icwsm-library.php"}, "title": "BotBuster: Multi-platform Bot Detection Using A Mixture of Experts", "abstract": "Despite rapid development, current bot detection models still face challenges in dealing with incomplete data and cross-platform applications. \nIn this paper, we propose BotBuster, a social bot detector built with the concept of a mixture of experts approach. Each expert is trained to analyze a portion of account information, e.g. username, and are combined to estimate the probability that the account is a bot. \nExperiments on 10 Twitter datasets show that BotBuster outperforms popular bot-detection baselines (avg F1=73.54 vs avg F1=45.12). \nThis is accompanied with F1=60.04 on a Reddit dataset and F1=60.92 on an external evaluation set.\nFurther analysis shows that only 36 posts is required for a stable bot classification. Investigation shows that bot post features have changed across the years and can be difficult to differentiate from human features, making bot detection a difficult and ongoing problem.", "venue": "International Conference on Web and Social Media", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-07-27", "journal": {"name": "ArXiv", "volume": "abs/2207.13658"}, "authors": [{"authorId": "14532516", "name": "L. Ng"}, {"authorId": "152493572", "name": "K. Carley"}], "citations": [{"paperId": "a275763ae447b0cfa3e9dc522eed5bbadedc1853", "title": "Why do people think liberals drink lattes? How social media afforded self-presentation can shape subjective social sorting"}, {"paperId": "d2fb72d5319eedc955e2ecc7a9debb0bf76686a3", "title": "An Exploratory Analysis of COVID Bot vs Human Disinformation Dissemination stemming from the Disinformation Dozen on Telegram"}, {"paperId": "614639931a1598e8a0eca39b595a792ff42a0059", "title": "What Does the Bot Say? Opportunities and Risks of Large Language Models in Social Media Bot Detection"}, {"paperId": "ef39c22e3c5cb25ab8f3424bf516bca4904f880c", "title": "Assembling a multi-platform ensemble social bot detector with applications to US 2020 elections"}, {"paperId": "18d7695389f6c8e58bfdf3e825a80d454a9e2b0c", "title": "Cyborgs for strategic communication on social media"}, {"paperId": "37e0708436d1b8ffab3037c0970da19a6d55767d", "title": "Deflating the Chinese balloon: types of Twitter bots in US-China balloon incident"}, {"paperId": "2fdbd62ecf3274c6e15479545f388e48be313067", "title": "Digital Ethics for Biometric Applications in a Smart City"}, {"paperId": "57427ef02d111ba8dfe270f0db970f56eeb8f826", "title": "Language-driven All-in-one Adverse Weather Removal"}, {"paperId": "d5f5775678f82df46e2b51e2e4fc153d9a28eaee", "title": "Tracking China's Cross-Strait Bot Networks Against Taiwan"}, {"paperId": "9e45c00b64b24d22017c7c3739bae26b16167c13", "title": "Do you hear the people sing? Comparison of synchronized URL and narrative themes in 2020 and 2023 French protests"}, {"paperId": "08de7a91bcdaf1eb41b69d2caed24fb4610d3c59", "title": "Recruitment Promotion via Twitter: A Network-centric Approach of Analyzing Community Engagement Using Social Identity"}, {"paperId": "bbb4bee99d6481c1c408b04b490e6ffc49b305e3", "title": "LMBot: Distilling Graph Knowledge into Language Model for Graph-less Deployment in Twitter Bot Detection"}, {"paperId": "163a60d12dae7fc4781932d7dd7a3e8e9f0cec8a", "title": "HOFA: Twitter Bot Detection with Homophily-Oriented Augmentation and Frequency Adaptive Attention"}, {"paperId": "c93b7a5de079215bbba15c304b2d2f9541f7f88a", "title": "BotMoE: Twitter Bot Detection with Community-Aware Mixtures of Modal-Specific Experts"}, {"paperId": "5cd7c5f4e21cb541d7c553b04074335e858847c2", "title": "BotPercent: Estimating Bot Populations in Twitter Communities"}, {"paperId": "0b9b4f391b1b69f5c0b0cc4407b14ce59bc0d587", "title": "Should we agree to disagree about Twitter's bot problem?"}, {"paperId": "1bc0dc96d745325d89ec5bee1da1541255e6d1eb", "title": "BotPercent: Estimating Twitter Bot Populations from Groups to Crowds"}, {"paperId": "88247c3eb35a01bb88b78f6dbab2eee706cd6f78", "title": "Deﬂating the Chinese balloon: types of Twitter bots in US-China balloon incident"}]}
