{"paperId": "d4bfec5c9f9af8119ba5011005a335a4b5fc7dc8", "publicationVenue": {"id": "f4784c7b-6592-49eb-a116-7290e0398868", "name": "Journal of Advances in Information Technology", "type": "journal", "alternate_names": ["J Adv Inf Technol"], "issn": "1798-2340", "url": "http://academypublisher.com/jait/index.html", "alternate_urls": ["http://www.jait.us/"]}, "title": "Secure and Smart Teleradiology Framework Integrated with Technology-Based Fault Detection (CVT-FD)", "abstract": "—The healthcare sector has used cyber-physical systems to provide high-quality patient treatment. Many attack surfaces need sophisticated security solutions because of the wide range of medical devices, mobile devices, and body sensor nodes. Cyber-physical systems have various processing technologies, which means these technical methods are as varied. To reduce fraud and medical mistakes, restricted access to these data and fault authentication must be implemented. Because these procedures require information management about problem identification and diagnosis at a complex level distinct from technology, existing technologies must be better suited. This paper suggests a Computer Vision Technology-based Fault Detection (CVT-FD) framework for securely sharing healthcare data. When utilizing a trusted device like a mobile phone, end-users can rest assured that their data is secure. Cyber-attack behaviour can be predicted using an Artificial Neural Network (ANN), and analyzing this data can assist healthcare professionals in making decisions. The experimental findings show that the model outperforms current detection accuracy (98.3%), energy consumption (97.2%), attack prediction (96.6%), efficiency (97.9%), and delay ratios (35.6%) over existing approaches.", "venue": "Journal of Advances in Information Technology", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "Journal of Advances in Information Technology"}, "authors": [{"authorId": "2244409693", "name": "Mustafa sabah Mustafa"}, {"authorId": "2111127809", "name": "M. H. Ali"}, {"authorId": "2214960375", "name": "M. Jaber"}, {"authorId": "2047506049", "name": "Amjad Rehman Khan"}, {"authorId": "2140357626", "name": "Narmine ElHakim"}, {"authorId": "2238135032", "name": "Tanzila Saba"}], "citations": []}
