{"paperId": "d4cb71b4ba2469a8f6e601b7afd2da49083213fc", "publicationVenue": {"id": "fb6f5468-3c6f-4731-942a-f32acc3365f5", "name": "IET Communications", "type": "journal", "alternate_names": ["Iet Communications", "Iet Commun", "IET Commun"], "issn": "1751-8628", "url": "http://www.ietdl.org/IET-COM"}, "title": "Survey on the scheme evaluation, opportunities and challenges of software defined-information centric network", "abstract": "As a promising architecture of next‐generation network, software defined‐information centric network (SD‐ICN) inherits the advantages of software defined network (SDN) and information‐centric network (ICN) to enable flexible and fast content retrieval, especially in the current era of artificial intelligence. However, the existing researches mainly focus on a single respective in this field, which motivates in comprehensively providing a forward‐looking guidance and development direction for scholars and engineers. To this end, the latest developments of SD‐ICN is presented. First, the widely‐accepted concepts and impacts on traditional networks are introduced. Second, the shortcomings of SDN and ICN over conventional networks are respectively analyzed to illustrate the necessity of SD‐ICN. Third, based on extensive analysis and deep deliberation, a methodical taxonomy for existing combination studies is proposed. They are divided into SDN over ICN, ICN over SDN, and mutual immersive pattern. Fourth, the performances of three integration categories are compared and the limitations of related works are highlighted. Fifth, the maturity index from six development indicators are evaluated. Further, the maturity and practicality of these schemes are generalized. Based on the above studies and comparisons, the lessons learned by SDN and ICN developments are concluded. Finally, future research directions and opportunities are discussed for the readers.", "venue": "IET Communications", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-11-11", "journal": {"name": "IET Commun.", "pages": "2237-2274", "volume": "17"}, "authors": [{"authorId": "30142783", "name": "Zhengyang Ai"}, {"authorId": "2266424684", "name": "Ming Zhang"}, {"authorId": "2243245976", "name": "Weiting Zhang"}, {"authorId": "145993626", "name": "Jiawen Kang"}, {"authorId": "2266419179", "name": "Lingling Tong"}, {"authorId": "2266429108", "name": "Yunqiang Duan"}], "citations": []}
