{"paperId": "d4d4b6525e8525d91ffb047f8ba9e80c08297a26", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Spatial Computing: Concept, Applications, Challenges and Future Directions", "abstract": "Spatial computing is a technological advancement that facilitates the seamless integration of devices into the physical environment, resulting in a more natural and intuitive digital world user experience. Spatial computing has the potential to become a significant advancement in the field of computing. From GPS and location-based services to healthcare, spatial computing technologies have influenced and improved our interactions with the digital world. The use of spatial computing in creating interactive digital environments has become increasingly popular and effective. This is explained by its increasing significance among researchers and industrial organisations, which motivated us to conduct this review. This review provides a detailed overview of spatial computing, including its enabling technologies and its impact on various applications. Projects related to spatial computing are also discussed. In this review, we also explored the potential challenges and limitations of spatial computing. Furthermore, we discuss potential solutions and future directions. Overall, this paper aims to provide a comprehensive understanding of spatial computing, its enabling technologies, their impact on various applications, emerging challenges, and potential solutions.", "venue": "arXiv.org", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2024-01-30", "journal": {"name": "ArXiv", "volume": "abs/2402.07912"}, "authors": [{"authorId": "151453737", "name": "Gokul Yenduri"}, {"authorId": "2283935250", "name": "M. Ramalingam"}, {"authorId": "29919430", "name": "Praveen Kumar Reddy Maddikunta"}, {"authorId": "11041265", "name": "T. Gadekallu"}, {"authorId": "3314907", "name": "Rutvij H. Jhaveri"}, {"authorId": "2283932715", "name": "Ajay Bandi"}, {"authorId": "2118057761", "name": "Junxin Chen"}, {"authorId": "2284160323", "name": "Wei Wang"}, {"authorId": "2283933867", "name": "Adarsh Arunkumar Shirawalmath"}, {"authorId": "2283932967", "name": "Raghav Ravishankar"}, {"authorId": "2169301397", "name": "Weizheng Wang"}], "citations": []}
