{"paperId": "d4e05957bfa68762ed730c4a312c325ca0646408", "publicationVenue": null, "title": "A Regression Proof Selection Tool For Coq", "abstract": "Large-scale software verification projects increasingly rely on proof assistants, such as Coq, to construct formal proofs of program correctness. However, such proofs must be checked after every change to a project to ensure expected program behavior. This process of regression proving can require substantial machine time, which is detrimental to productivity and trust in evolving projects. We present iCoq, the first regression proof selection tool. iCoq tracks fine-grained dependencies between Coq definitions, propositions, and proofs, and only checks those proofs affected by changes between two revisions. iCoq is suitable for workflows involving version control and continuous integration services, e.g., Travis CI. We applied iCoq to track dependencies across many revisions in several large Coq projects and measured the time savings compared to proof checking from scratch and when using Coq's timestampbased toolchain for incremental checking. Our results show that proof checking with iCoq is up to 10 times faster than the former and up to 3 times faster than the latter. The demo video for iCoq can be found at: https://www.youtube.com/watch?v=egFnHkH5pXI.", "venue": "2018 IEEE/ACM 40th International Conference on Software Engineering: Companion (ICSE-Companion)", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2018-05-27", "journal": {"name": "2018 IEEE/ACM 40th International Conference on Software Engineering: Companion (ICSE-Companion)", "pages": "117-120"}, "authors": [{"authorId": "145118978", "name": "Ahmet Çelik"}, {"authorId": "2713883", "name": "Karl Palmskog"}, {"authorId": "2020926", "name": "Miloš Gligorić"}], "citations": [{"paperId": "9f8ac6ee3760ab202e492c733362e5bfc6763934", "title": "Baldur: Whole-Proof Generation and Repair with Large Language Models"}, {"paperId": "455dcc6d88fac843c0717f60af2a065feaa7f248", "title": "Passport: Improving Automated Formal Verification Using Identifiers"}, {"paperId": "21945d97b84f7fcb41a95f3f8f8700be113f385b", "title": "Practical Machine-Checked Formalization of Change Impact Analysis"}, {"paperId": "3fba3edd3e70b7013ab6971337c5cc0753dc67a0", "title": "piCoq: parallel regression proving for large-scale verification projects"}, {"paperId": "b402da9973879eec9da379f80345220dd836a435", "title": "Difference Verification with Conditions"}]}
