{"paperId": "d4e3568b5ec91f751863130cba125c5201780594", "publicationVenue": null, "title": "Natural conversations with a virtual being: How user experience with a current conversational AI model compares to expectations", "abstract": "The present work investigates the effect of natural conversations with virtual beings on user perceptions with a current conversational AI model (Meta's BlenderBot). To this aim, we designed a virtual being from a deep learning‐generated face and a conversational AI model acting as a virtual conversation partner in an online conferencing software and evaluated it in 11 perceptions of social attributes. Compared to prior expectations, participants perceived the virtual being as distinctly higher in warmth (engaging, empathic, and approachable) but lower in realism and credibility after 5 days of 10 min daily conversations (Study 1). Further, we explored the idea of simplifying the technical setup to reduce the technical entry barrier for such AI applications (Study 2). To this aim, we conducted several trials of fine‐tuning a small conversational model of 90 million parameters until its performance metrics improved. Testing this fine‐tuned model with users revealed that this model was not perceived differently from a large conversational model (1.4 billion parameters). In summary, our findings show that recent progress in conversational AI has added warmth‐related aspects to the user experience with virtual beings, and that fine‐tuning a conversational AI model can be effective to reduce technical complexity.", "venue": "Comput. Animat. Virtual Worlds", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-03-12", "journal": {"name": "Computer Animation and Virtual Worlds", "volume": "34"}, "authors": [{"authorId": "2648821", "name": "Chaehan So"}, {"authorId": "2211564608", "name": "Anel Khvan"}, {"authorId": "2115122192", "name": "Wonjun Choi"}], "citations": []}
