{"paperId": "d4ea314ae5f3019151faa0f205bc9a497cf01b51", "publicationVenue": null, "title": "TianheQueries: Ultra-Fast and Scalable Graph Queries on Tianhe Supercomputer", "abstract": "As graph-based services have been widespreadly integrated into daily lives, extremely-fast and scalable graph queries are receiving increasing attention. Graph querying al-gorithms including BFS(Breadth First Search) and SSSP(Single Source Shortest Path) are promising engines for graph-based applications. Unfortunately, current graph queries often deliver low efficiency owing to sequential execution and poor scalability. This paper presents TianheQueries: an ultra-fast and scalable graph querying engine on Tianhe supercomputer. TianheQueries proposes an efficient hardware prefetching and caching mechanism that can pipeline vertices gather, traversal and vertices scatter so as to accelerate graph queries with the utilization of pipeline parallelism. and (ii) presents a topology-aware communication aggregation for inter-domain messages more than from the same source node by leveraging the network topology information to perform more aggressively messages aggregation. We use both benchmark and real-world graphs to demonstrate the effectiveness of TianheQueries. Specially, TianheQueries helps Tianhe Exa-node win the top spot of the latest Green-Graph500 lists both big data and small data categories. Further-more, TianheQueries-based SSSP tests on Tianhe supercomputer is superior to the fastest SSSP systems in the latest Graph500 lists.", "venue": "2022 IEEE 24th Int Conf on High Performance Computing & Communications; 8th Int Conf on Data Science & Systems; 20th Int Conf on Smart City; 8th Int Conf on Dependability in Sensor, Cloud & Big Data Systems & Application (HPCC/DSS/SmartCity/DependSys)", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-12-01", "journal": {"name": "2022 IEEE 24th Int Conf on High Performance Computing & Communications; 8th Int Conf on Data Science & Systems; 20th Int Conf on Smart City; 8th Int Conf on Dependability in Sensor, Cloud & Big Data Systems & Application (HPCC/DSS/SmartCity/DependSys)", "pages": "1153-1158"}, "authors": [{"authorId": "2628509", "name": "X. Gan"}, {"authorId": "2212383073", "name": "Guang Wu"}, {"authorId": "2213200395", "name": "Cong Liu"}, {"authorId": "2212762934", "name": "Jiaqi Si"}, {"authorId": "2109527116", "name": "Xuguang Chen"}, {"authorId": "2119658662", "name": "Bo Yang"}, {"authorId": "2109900096", "name": "Tiejun Li"}], "citations": []}
