{"paperId": "d4eaa5293c0f5f519dd5972f1771563cc6c66587", "publicationVenue": null, "title": "A New Approach for Scheduling Tasks and/or Jobs in Big Data Cluster", "abstract": "400 hundred million tweets are sent each day, 4.75 billion multimedia content is shared every day on Facebook, and an estimated of hundreds of hours of video are uploaded to YouTube every minute. Moreover, also IOT devices (RFID and WIFI wearable devices) are generating a huge number of data per seconds. During the last two years, the amount of data that has been created is about 90% of the whole data created so far. All these facts require clusters of computers with high specs in order to treat them. Knowing that the prices of computers are continuously dropping from year to another, almost all companies have started their Big Data projects. The return on investment (ROI) of such a project is beneficial to companies in terms of business. Since the advent of Big Data, a lot improvement is been done in order to optimize the usage of the resources (especially RAM) and to reduce the required amount of time needed for running Big Data projects. Still, effort needs to be done for the scheduler for efficiently scheduling the tasks inside the DataNodes of the Big Data Cluster. In this paper, we propose a new approach for scheduling tasks and/or jobs in Big Data Cluster in which mainly focus on optimizing the assignment of tasks to the data nodes by the NameNode. Prominent obtained results proved that our task scheduler outperforms the traditional task scheduler: FIFO Scheduler and Capacity Scheduler available in Big Data open source distributions such as Cloudera [19] and HortonWorks [20].", "venue": "2019 4th MEC International Conference on Big Data and Smart City (ICBDSC)", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2019-01-01", "journal": {"name": "2019 4th MEC International Conference on Big Data and Smart City (ICBDSC)", "pages": "1-4"}, "authors": [{"authorId": "2152537", "name": "K. Hadjar"}, {"authorId": "40524393", "name": "A. Jedidi"}], "citations": [{"paperId": "1dc9ffa934803e943c60deaff7618db5f4c7bf49", "title": "Map-Reduce Task Scheduling Optimization Techniques: A Comparative Study"}, {"paperId": "2d505b351536a5d5a2afee48f4b0ccc4ed5a48ee", "title": "An Optimized Job Scheduling Mechanism for Mapreduce Framework Using DIW-WOA in Big Data"}, {"paperId": "a95625a8b3b786527aa4cced28a145a967087e79", "title": "Building a Personalized Model for Social Media Textual Content Censorship"}, {"paperId": "e499401ce242298e510c39051c89dc74000f21e1", "title": "Improved Job Scheduling for Achieving Fairness on Apache Hadoop YARN"}, {"paperId": "2083cc7f686e356b6f74701af9ac8f33c6e9af54", "title": "Adaptive and transparent task scheduling of GPU‐powered clusters"}, {"paperId": "c907b19ee11b71429e630338a5e7a863e95333c6", "title": "Multiple Resource Management and Burst Time Prediction using Deep Reinforcement Learning"}]}
