{"paperId": "d4ed7b2048778de8d6784eedd939f516c36b30a9", "publicationVenue": {"id": "28df6cf4-b335-41eb-acc6-50eb3c965e5a", "name": "IEEE Transactions on Computational Social Systems", "type": "journal", "alternate_names": ["IEEE Trans Comput Soc Syst"], "issn": "2329-924X", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=6570650", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/aboutJournal.jsp?punumber=6570650"]}, "title": "APCAS: Autonomous Privacy Control and Authentication Sharing in Social Networks", "abstract": "Recently, the increasing development of social networks has brought about many privacy-related issues. Because users (participants) have different privacy sharing behaviors when multiple parties participate. The way of privacy sharing depends on the wishes of publishers, and users usually cannot control privacy sharing independently. To address this issue, this article proposes an autonomous privacy control and authentication sharing (APCAS) scheme based on quick response (QR) codes in social networks. Using the error correction of QR codes with high-quality images can prevent photographs that are uploaded to the social network from being subjected to lossy operations, which meets the participants’ needs of availability and privacy simultaneously. Combining the superiority of the polynomial-based secret image sharing and the visual secret image sharing can provide single-share certification for both dealer participation and dealer nonparticipation during certification. By comparing advanced image sharing algorithms, the proposed APCAS can restore the secret images one by one according to users’ wishes and can thus effectively mitigate the problem of autonomous privacy control in online sharing. Compared with related methods in recent years in terms of peak signal-to-noise ratio (PSNR), authentication operation, and authentication complexity, the proposed APCAS algorithm provides lossless decryption, lower authentication computation complexity, and no pixel scalability.", "venue": "IEEE Transactions on Computational Social Systems", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-01", "journal": {"name": "IEEE Transactions on Computational Social Systems", "pages": "3169-3180", "volume": "10"}, "authors": [{"authorId": "29451560", "name": "Wenying Wen"}, {"authorId": "2190868152", "name": "Jiacong Fan"}, {"authorId": "46868385", "name": "Yushu Zhang"}, {"authorId": "4639656", "name": "Yuming Fang"}], "citations": [{"paperId": "1c685c93fc8c2eb9828d2cb0f333a2e9b92fc65f", "title": "Optical image encryption and authentication scheme with computational ghost imaging"}, {"paperId": "939ba3632a38134881a99dc35307f872d66c7cb3", "title": "High-capacity medical information hiding scheme with P-tensor product secret image sharing for wireless body area networks"}, {"paperId": "d3f509b298376c46cbd944157ee6d31b5730f449", "title": "Robust secret image sharing scheme with improved anti-noise capability"}, {"paperId": "abff0101e5c4e23ae12d7db92f86958270c567ae", "title": "Exploiting one-dimensional exponential Chebyshev chaotic map and matching embedding for visually meaningful image encryption"}, {"paperId": "298f71b8fa9107b3ba92fe7c460b8fd0def57ee1", "title": "DR-SISM: A Dual Reversible Secret Image Sharing Mechanism"}, {"paperId": "27055d4b201da14fe333fdb8217cae1d692b54c8", "title": "Novel multiple color images encryption and decryption scheme based on a bit-level extension algorithm"}]}
