{"paperId": "d4f493ecc72aab6ba20d243f0f515d1554057dc4", "publicationVenue": null, "title": "Cyber-physical cloud-oriented multi-sensory smart home framework for elderly people: An energy efficiency perspective", "abstract": null, "venue": "J. Parallel Distributed Comput.", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2017-05-01", "journal": {"name": "J. Parallel Distributed Comput.", "pages": "11-21", "volume": "103"}, "authors": [{"authorId": "2192586425", "name": "M. S. Hossain"}, {"authorId": "3476598", "name": "M. A. Rahman"}, {"authorId": "48180294", "name": "Ghulam Muhammad"}], "citations": [{"paperId": "576a3159d6c3f646d6fda6d047dfece4ea941fdd", "title": "Towards Artificial General Intelligence (AGI) in the Internet of Things (IoT): Opportunities and Challenges"}, {"paperId": "444ff65d9cec2c1a55b76f6e9dc8947c5fac1e84", "title": "Review of cross-device interaction for facilitating digital transformation in smart home context: A user-centric perspective"}, {"paperId": "07627387230cd0cdfe8c0abba6621f870fc38227", "title": "Monitoring Root and Shoot Characteristics for the Sustainable Growth of Barley Using an IoT-Enabled Hydroponic System and AquaCrop Simulator"}, {"paperId": "973c87c30c3d501bf96f97709d2e11f347b22db1", "title": "Self-x based closed loop wearable IoT for real-time detection and resolution of sleep apnea"}, {"paperId": "5dd494831955d603755d3362debc9936b4738ac8", "title": "A Comprehensive Survey on Cyber-Physical Systems Towards Healthcare 4.0"}, {"paperId": "4eac481760cec332071383296b88b9e5f35cfcc5", "title": "Affective Recommender System for Pet Social Network"}, {"paperId": "91365705425afe9ba75eed56cdc2cec97a854c77", "title": "Somewhat Homomorphic Encryption: Ring Learning with Error Algorithm for Faster Encryption of IoT Sensor Signal-Based Edge Devices"}, {"paperId": "66beebc83407ebf23709e7199bc7a4f1e52d9d34", "title": "A Novel Elderly Tracking System Using Machine Learning to Classify Signals from Mobile and Wearable Sensors"}, {"paperId": "4204dd7c09feb4baa93e95efd5b9bbbe55b8087b", "title": "Predictive Analytics of Energy Usage by IoT-Based Smart Home Appliances for Green Urban Development"}, {"paperId": "ae8b3a4a1fddfbc81462e64fbecfb54d8d13c16d", "title": "The Role of Big Data in Aging And Older People’s Health Research: A Systematic Review and Ecological Framework"}, {"paperId": "abecd0780dad497e936d4fe7479a47dab4cd8c5f", "title": "Hybrid smart grid with sustainable energy efficient resources for smart cities"}, {"paperId": "90e689cef8ddb107bafb5a864d85744bd2e19339", "title": "Blockchain and homomorphic encryption-based privacy-preserving data aggregation model in smart grid"}, {"paperId": "4d1aef0d37a2fe6be4a5063210e56f36dd1e5629", "title": "Digitalisation for optimising nursing staff demand modelling and scheduling in nursing homes"}, {"paperId": "bc73f33d682c14ad279bc37b4050f97e9196b4ff", "title": "An effective face recognition system based on Cloud based IoT with a deep learning model"}, {"paperId": "11db64e648bb1e446adebe820bcaaacddbee6600", "title": "Secure and Provenance Enhanced Internet of Health Things Framework: A Blockchain Managed Federated Learning Approach"}, {"paperId": "46e55adc2d2cb1af80abceae4d2b4596c7a0f3c7", "title": "A Cross-Domain Comparative Study of Big Data Architectures"}, {"paperId": "f4b5b787eaf29d07a45f8ff2f58d11a065ad0c07", "title": "The shift to 6G communications: vision and requirements"}, {"paperId": "c8f69d9d3e714af18df6442e091888237abc7649", "title": "Architecture of Smart Health Care System Using Artificial Intelligence"}, {"paperId": "8d503422bef62abb0c612486cec98b0a44b89f03", "title": "Multi-CNN Feature Fusion for Efficient EEG Classification"}, {"paperId": "dc92d5ce6b8db68c2a631a817cc88919ac10ef96", "title": "Resource Allocation Management in Patient-to-Physician Communications Based on Deep Reinforcement Learning in Smart Healthcare Services"}, {"paperId": "2bac1fc4142ca1f4c2d9e7fa3b01006ef4500029", "title": "Arabic Sign Language Recognition and Generating Arabic Speech Using Convolutional Neural Network"}, {"paperId": "e9da802c7eaac364644b79e3b6d0705a04bfd625", "title": "HEMS-IoT: A Big Data and Machine Learning-Based Smart Home System for Energy Saving"}, {"paperId": "74a0658c162e7486b16e5a5ab61c6df27d9750a2", "title": "IoT Enabled Gesture-Controlled Home Automation for Disabled and Elderly"}, {"paperId": "4b91e43215977c0206e43a88ac425976ceaebad5", "title": "Cyber Physical Systems and Smart Homes in Healthcare: Current State and Challenges"}, {"paperId": "660f79f26eb9e9bf60343a7df4f8462f9a6c9ada", "title": "A Natural User Interface and Blockchain-Based In-Home Smart Health Monitoring System"}, {"paperId": "356aef2ceada47eb06f03da25f3f5c74ad9ea92a", "title": "Deep learning-based intelligent face recognition in IoT-cloud environment"}, {"paperId": "74bec51a66499fcfbced16ff3fce696acf98c9e1", "title": "Healthcare big data processing mechanisms: The role of cloud computing"}, {"paperId": "25370d00e92a4562bbbca4c5968409ac459cd94d", "title": "Long Link Wireless Sensor Routing Optimization Based on Improved Adaptive Ant Colony Algorithm"}, {"paperId": "51ff3fbf8d6a05ec3fb690fef6b0dfd5039c3ead", "title": "The state of framework development for implementing reasoning mechanisms in smart cyber-physical systems: A literature review"}, {"paperId": "b5830a9b0ff4802beb76ae3e79f1cd391b32e9c4", "title": "Machine Learning, Big Data, And Smart Buildings: A Comprehensive Survey"}, {"paperId": "a7ca971921963c37e70eb39d417962d08937cbcc", "title": "Leveraging Machine Learning and Big Data for Smart Buildings: A Comprehensive Survey"}, {"paperId": "3ea9c813f691fe4b01efedf5c3977ea9ad631975", "title": "Investigation of mammograms in the cloud for smart healthcare"}, {"paperId": "d16a1b7d6a39acba1b3a2b824c25a6eb7ca1d87c", "title": "The Role of Micro-Moments: A Survey of Habitual Behavior Change and Recommender Systems for Energy Saving"}, {"paperId": "a96c3bb9f78a3fe54a77e925be925c9dbfb339cf", "title": "A Pilot Study on a Smart Home for Elders Based on Continuous In-Home Unobtrusive Monitoring Technology"}, {"paperId": "8d7c16bc87557c0585c480741043158a1e288d48", "title": "Social Interaction and Stress-Based Recommendations for Elderly Healthcare Support System—A Survey"}, {"paperId": "b4b9dd0968d8425424f590edef22f45bbf89a727", "title": "Smart Healthcare Analysis and Therapy for Voice Disorder using Cloud and Edge Computing"}, {"paperId": "98611aeef0cc5f0d9759e34c91bdd1ccbfc3cdc4", "title": "m-Therapy: A Multisensor Framework for in-Home Therapy Management: A Social Therapy of Things Perspective"}, {"paperId": "70a4e15299b0ce44ab0a3d9869d28a91fbcbc7e3", "title": "An intelligent healthcare system for detection and classification to discriminate vocal fold disorders"}, {"paperId": "719ac5ad6cb37e74528b49b41b350301a35dacd9", "title": "Virtual home assistant for voice based controlling and scheduling with short speech speaker identification"}, {"paperId": "266766818dbc5a4ca1161ae2bc14c9e269ddc490", "title": "Boosting a Low-Cost Smart Home Environment with Usage and Access Control Rules"}, {"paperId": "946b782ff677ccdd6e1225e9e83da48425fb01a8", "title": "What are real problems of older adults and how to solve it with smart home devices?"}, {"paperId": "28c6637a867056160b6dedb51e10edaf944c564a", "title": "Edge Computing with Cloud for Voice Disorder Assessment and Treatment"}, {"paperId": "2d9d3bbddf32a0ad86d2534560de5decd0d956b1", "title": "Robust Activity Recognition for Aging Society"}, {"paperId": "7c04ed5614abb67821d96e07dcf4beb71dd028b3", "title": "A knowledge-driven approach for activity recognition in smart homes based on activity profiling"}, {"paperId": "9e27b5e066fcd27ce7fd8ef24d47285642a7955a", "title": "Advanced services for efficient management of smart farms"}, {"paperId": "f7130e2d8a8265ac2fcbf03600f97a9ec79a3ad7", "title": "Verifying the Images Authenticity in Cognitive Internet of Things (CIoT)-Oriented Cyber Physical System"}, {"paperId": "e669933ddd94c4b3da831f11aee81ff834214258", "title": "Towards energy-aware cloud-oriented cyber-physical therapy system"}, {"paperId": "fe5d4a10aa75f6c45ef11593f341c57758d70e5f", "title": "A balanced virtual machine scheduling method for energy-performance trade-offs in cyber-physical cloud systems"}, {"paperId": "221839d964aa7244977a9b6eca9156d29d64b2a0", "title": "Smart hardware hybrid secure searchable encryption in cloud with IoT privacy management for smart home system"}, {"paperId": "e9f08561f9457a56074c4996a420903dd61c4bf5", "title": "A multimedia cloud-based framework for constant monitoring on obese patients"}, {"paperId": "c3ae1c6340de5363f23529091676a4b5043166d2", "title": "Towards a Secure Mobile Edge Computing Framework for Hajj"}, {"paperId": "99e0c03686f7bc9d7add6cff39a941a047c3600a", "title": "A Facial-Expression Monitoring System for Improved Healthcare in Smart Cities"}, {"paperId": "0dbb38539a893aee47cf6ca5d2a12c0a01b4e034", "title": "Research Challenges, Trends and Applications for Multi-Sensory Devices in Future Networked Systems"}, {"paperId": "196095d019b57a2a4aed6be3c00c86d423cf05aa", "title": "An Efficient Activity Recognition Framework: Toward Privacy-Sensitive Health Data Sensing"}, {"paperId": "a539f91b66f1c43f4a521a1f7ee5d7ed135e97a5", "title": "An Automatic Health Monitoring System for Patients Suffering From Voice Complications in Smart Cities"}, {"paperId": "8b338775ba5b242eeb1c42a62384dbbdc447179c", "title": "Overview of the Third Shared Task on Speech Recognition for Vulnerable Individuals in Tamil"}, {"paperId": "33d463150ef1aacbdd4c24edda6541a9a31c260d", "title": "Overview of the Second Shared Task on Speech Recognition for Vulnerable Individuals in Tamil"}, {"paperId": "9d59cf2cfccb35566430153c780c79bed6f63cd4", "title": "Findings of the Shared Task on Speech Recognition for Vulnerable Individuals in Tamil"}, {"paperId": "9bd76c8dd231550b839a53b86ce02afc7af732e7", "title": "E NTERPRISE M ULTI -L EVEL E NERGY E FFICIENCY M ANAGEMENT S YSTEM D EVELOPMENT"}, {"paperId": "0caee61694780f17b23883082e2b8038ef55896f", "title": "A Comprehensive Survey of the Internet of Things (IoT) and AI-Based Smart Healthcare"}, {"paperId": "45fd511714dbf382731628c536504cdeda769708", "title": "Edge Intelligence and Internet of Things in Healthcare: A Survey"}, {"paperId": "4348bf48b5fb0f6b1bc370c445e4a6506ae6649b", "title": "Smart Homes: How Much Will They Support Us? A Research on Recent Trends and Advances"}, {"paperId": "adb3bdfc5b527c3c3dbf7810ce6fb98873ae3fc4", "title": "Technique for IoT Cyberattacks Detection Based on the Energy Consumption Analysis"}, {"paperId": "933b889bc8bedd82c902493ededdaa88762e9d9f", "title": "Diagnosing Voice Disorder with Machine Learning"}, {"paperId": "f930547dfa27f94be377845c123fe11de43d8c9c", "title": "AIDE—AI and IoT-Enabled Home Automation for Disabled and Elderly"}, {"paperId": "5d073dcf69436e4b51c4ac4e641b6754e0707ed5", "title": "Advanced Communications in Cyber-Physical Systems"}, {"paperId": "a346f80b5b8966c523cffe8311906c8098c25013", "title": "Mining and monitoring human activity patterns in smart environment-based healthcare systems"}, {"paperId": "413da1999955e6d8fdf011fb13ed167807be3422", "title": "A FACIAL-EXPRESSION MONITORING SYSTEM FOR IMPROVED HEALTHCARE IN SMART CITIES"}, {"paperId": "1c0d13c331fad45a40f8b5b61bd8231a1d4ccd26", "title": "Efficacy of Deep Learning in Support of Smart Services"}]}
