{"paperId": "d4f75d81c73dde35780121de3eb3e293e088f6d8", "publicationVenue": null, "title": "Combined two-level guided wave structural health monitoring strategy using multifeature integration and machine learning: application to early-age grouted sleeves", "abstract": "Structural health monitoring of grouted sleeves is one of the assembly industry’s huge challenges. In this study, a combined two-level damage detection was introduced. It comprises defect classification (healthy, rebar eccentricity, and grout leakage) and severity evaluation for early-age grouted sleeves using guided waves. Multiple features (MF) from time-, frequency-, and time-frequency domains were extracted and defined according to the diverse defects and ages of grouted sleeves to represent complex damage characteristics. Moreover, the egret swarm algorithm optimization–extreme learning machine (ESAO-ELM) models were proposed to avoid the influence of subjective experience and judgment from experts. ESAO optimized the initial random parameters (input weights and hidden layer bias) of ELM. Then, two MF-ESAO-ELM models were trained for two-level damage detection on the experimental dataset. The performance of the proposed models was comprehensively evaluated using accuracy, recall, precision, and confusion matrix. MF-ESAO-ELM performs better than ELM and PSO-ELM in accuracy. In this strategy, the defect classification model works in the outer layer to distinguish the state and types of defects of grouted sleeves (healthy, eccentric, or leakage). In comparison, the inner layer starts predicting the severity only if the defect type is leakage. MF-ESAO-ELM offers advantages in terms of accuracy, strategy, and calculation time.", "venue": "Smart materials and structures (Print)", "year": 2023, "fieldsOfStudy": ["Physics"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-07-31", "journal": {"name": "Smart Materials and Structures", "volume": "32"}, "authors": [{"authorId": "1452341537", "name": "Jiahe Liu"}, {"authorId": "2232197610", "name": "Jun Yi"}, {"authorId": "2151319877", "name": "Dongsheng Li"}, {"authorId": "101514018", "name": "Xiushi Cui"}, {"authorId": "151068882", "name": "Junlong Zhou"}], "citations": []}
