{"paperId": "d513931595f694494e59ed00647b21aea4ced258", "publicationVenue": {"id": "12b499eb-56c9-4d88-b792-6d90ceff3485", "name": "International Conference on Emerging Technologies", "type": "conference", "alternate_names": ["ICET", "Int Conf Emerg Technol"]}, "title": "The Archiving Data Pool Research of Intelligent Manufacturing Oriented to Impeller Design", "abstract": "Based on the analysis and understanding of impeller structure and function, combined with the data information in the process of design and intelligent manufacturing, the content and characteristics of data information are analyzed, and the current research status of impeller design is summarized. The data information of the whole life cycle of impeller is taken as the research object. The characteristics and functions of the data pool are analyzed. The second development is carried out for the design of the impeller by combining with the three-dimensional software UG. The archiving data pool for the intelligent manufacturing of impeller is designed, and the overall framework of the archiving data pool of impeller is constructed. The data fusion of archive data pool is achieved by Java, hive and other components and modules to build Hadoop platform, such as data index search, data filtering, data extraction and other fusion functions. A large number of data generated in the process of impeller design and intelligent manufacturing can be processed, analyzed and extracted more clearly to achieve the purpose of data processing. These researches not only play an important role in data storage and processing, but also have great significance in improving the efficiency and accuracy of impeller design and intelligent manufacturing.", "venue": "International Conference on Emerging Technologies", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2020-05-01", "journal": {"name": "2020 IEEE 3rd International Conference on Electronics Technology (ICET)", "pages": "577-581"}, "authors": [{"authorId": "1712225334", "name": "Guangrong Li"}, {"authorId": "104080254", "name": "Yuanguo Cao"}, {"authorId": "102734566", "name": "Yongqiang Bao"}, {"authorId": "143767129", "name": "Sufang Zhao"}, {"authorId": "1380102745", "name": "Qiyuan Bian"}, {"authorId": "2144802799", "name": "Xingwang Wang"}], "citations": []}
