{"paperId": "d51bfa6a1e067a069604a391fa26df25aa3958d0", "publicationVenue": null, "title": "A survey on big data systems", "abstract": "With the development of the latest technologies, a large amount of data is generated from various domains (such as optical observation and control, healthcare, sensors, user-generated data, Internet and nancial companies, supply chain systems, etc.) during the last two decades. (A more appropriate description could be \"in nite\" data, e.g., in the application of optical observation and control, data are continuously generated, cre-ating a data disaster.) The term of big data is coined to capture the profound meaning of this emerging trend.Compared with traditional data, big data exhibits some unique characteristics besides the sheer volume, such as commonly un-structured data and more real-time analysis requirements. The development of big data calls for new system architectures for data storage and large-scale data processing mechanisms. In this paper, we present a literature survey of big data analytics. Firstly, the de nition of big data and big data challenges are presented. Secondly, a systematic framework to decompose big data system into four sequential modules, namely data generation, data acquisition, data storage, and data analytics, which form the value chain for big data, is proposed. A detailed survey of numerous approaches and mechanisms related to each module, from research and industry communities is discussed. Finally, some evaluation benchmarks and potential scienti c problems in big data systems are outlined.", "venue": "", "year": 2015, "fieldsOfStudy": ["Engineering"], "publicationTypes": ["Review"], "publicationDate": "2015-01-20", "journal": {"name": "", "pages": "1-44", "volume": "45"}, "authors": [{"authorId": "67180560", "name": "Xuelong Li"}, {"authorId": "3146009", "name": "Hai-gang Gong"}], "citations": [{"paperId": "856d40a76afc67ee7f571174c4a6315d919b6695", "title": "Research on the design of scientific research management platform based on big data analysis"}, {"paperId": "77c2c779633692ded8b4e4cc1f780f7f33292893", "title": "Big Data-Driven Business Model Innovation (BMI) From the Perspective of Ambidexterity: Case Study of L. Vending Intelligence"}, {"paperId": "a8153716009f246cc931223288a375250be4ce86", "title": "Current situation and development suggestions of agricultural rural informatization"}, {"paperId": "c270f2028a8dc1826c7604ad602b44b4b7b0152b", "title": "Research on the Overall Architecture and Application of E-Sports Big Data"}, {"paperId": "afb8e515ca9276a68c54fd30ff62f5ee5500c1a9", "title": "Research on Location Privacy Protection Mechanism Based on No-Trusted User Cooperation"}, {"paperId": "d1773557a702d08ee46eabeca541b8076201ab4f", "title": "A novel text mining approach for scholar information extraction from web content in Chinese"}, {"paperId": "c8cb5b1b69f5a4870df2bfa92345e91baec58201", "title": "The Role of Social Media in Corporate Governance"}, {"paperId": "3c0c00a681b72c13cef9a9738169e7b54f0058a4", "title": "Research on Optimizing the Support of Conscription Recruits Cloths Based on Big Data"}, {"paperId": "9e86ae80ff03b6d256c8cabac421049053738945", "title": "Analysis on the Application of Big Data in Military Equipment Expense Management"}, {"paperId": "e811e4aef5c0bb8d3b07c2389fc5dc6e54dea7eb", "title": "Decision-Making and Coordination of a Three-Stage Book Supply Chain considering Big Data Information Cost"}, {"paperId": "9d8cd8113609197107054a40385a9f63a1379823", "title": "Big Data Analysis Service Platform Building for Complex Product Manufacturing"}, {"paperId": "b1aa5e8ac59b55b9674066e9cbe3bc0fcdb7e1aa", "title": "Development and Application of Big Data Platform for Garlic Industry Chain"}, {"paperId": "2d275e9727a5dc29b6172f1af9f0060dea0120ac", "title": "A Cloud Storage Data Access Control Scheme Based on Attribute-Sets Encryption"}, {"paperId": "9cb83eacf72af249a4eabbd125c6c3fdd53d0b86", "title": "Research on a Technical Framework in Smart Construction Based on Big Data"}, {"paperId": "2aa8e2f0e87f9ce2f33ec79eaed6815f297c3fb9", "title": "The Rise of Big Data and Land Engineering Disciplines"}, {"paperId": "aaaad8b71984e13d1e263d49b14911af1f9c864c", "title": "Development and Application of Big Data Platform for “Bohai granary”"}, {"paperId": "7288ab58007192cc02aafb1bda111d76e43a4702", "title": "Investment decision-making and coordination of a three-stage supply chain considering Data Company in the Big Data era"}, {"paperId": "f9d94ceda125523a594ae06614b34b3a2d5e8dd2", "title": "Semantic organization and verification of Web services for processing sensor data"}, {"paperId": "6b3fb813cbea9bb91ac9fe66400fd4ad50925b36", "title": "Online Web news extraction via tag path feature weighted by text block density"}, {"paperId": "e8e6ddaca7b98eebd972cf4d9fc8980f98adaf84", "title": "Research on the Application of Big Data in China’s Commodity Exchange Market"}, {"paperId": "bbea268f603f417870783783d64e48db203dcb82", "title": "Cost-Optimized Microblog Distribution over Geo-Distributed Data Centers"}, {"paperId": "0254b8fa4efdd09938f083caa684c74b5ef5e0ff", "title": "Japanese Teaching Mode Innovation on the Background of Big Data"}, {"paperId": "7b7f82efc273ba6dca6dbc0de770f3888aef9bdf", "title": "Research on Visual Analysis of Agricultural Food Big Data Based on CiteSpace III"}, {"paperId": "4fd6a5231cfe4c6a4bc06ded1a213257c8aa113d", "title": "Big Data Stream Computing: Features and Challenges"}, {"paperId": "bdf99b69feaf936abe736e19aacf20c4790f2d13", "title": "Research on Audit Supervision of Prevention and Control of COVID-19 Under Big Data"}]}
