{"paperId": "d51f1ab0a02278ca770344404bbb0ea051d9b698", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "An Asymptotic Ensemble Learning Framework for Big Data Analysis", "abstract": "In order to enable big data analysis when data volume goes beyond the available computing resources, we propose a new method for big data analysis. This method uses only a few random sample data blocks of a big data set to obtain approximate results for the entire data set. The random sample partition (RSP) distributed data model is used to represent a big data set as a set of non-overlapping random sample data blocks. Each block is saved as an RSP data block file that can be used directly to estimate the statistical properties of the entire data set. A subset of RSP data blocks is randomly selected and analyzed with existing sequential algorithms in parallel. Then, the results from these blocks are combined to obtain ensemble estimates and models which can be improved gradually by appending new results from the newly analyzed RSP data blocks. To this end, we propose a distributed data-parallel framework (Alpha framework) and develop a prototype of this framework using Microsoft R Server packages and Hadoop distributed file system. The experimental results of three real data sets show that a subset of RSP data blocks of a data set is sufficient to obtain estimates and models which are equivalent to those computed from the entire data set.", "venue": "IEEE Access", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "3675-3693", "volume": "7"}, "authors": [{"authorId": "2128523", "name": "Salman Salloum"}, {"authorId": "152292148", "name": "J. Huang"}, {"authorId": "1693657", "name": "Yulin He"}, {"authorId": "1583657241", "name": "Xiaojun Chen"}], "citations": [{"paperId": "f1041eb31ddfbd69916d7c8bad6d88943c8741c1", "title": "Non-MapReduce computing for intelligent big data analysis"}, {"paperId": "8bc178e1b72234b85ac2cde53b0510a5e0583c4c", "title": "RSP-gcForest: A Distributed Deep Forest via Random Sample Partition"}, {"paperId": "e37eff144ad5d006495c643757acb19b7e59ef4a", "title": "A Hybrid Method to Measure Distribution Consistency of Mixed-Attribute Datasets"}, {"paperId": "fe591d6af2a7459050cd6e6aa360c9d996970044", "title": "A New Security Event Correlation Analysis Engine Based on Rule-Tree-Matching"}, {"paperId": "9abf0ee98f1ead46253828489a23daa26593190f", "title": "Data Analytics and Techniques"}, {"paperId": "1cc8363a6ec7f61cafd381865a5a55ac016f5c8c", "title": "Bhattacharyya coefficient target feature matching based weighted emphasis adaptive boosting classification for predictive analytics with big data"}, {"paperId": "963f480283dd042bc0440306bb9024e2016546f9", "title": "Study on Automobile Culture of Developed and Emerging Countries in Asia Using Text Mining Analysis on Social Media"}, {"paperId": "030cd2746d2b211b9040aab5cb9f462ba48ae841", "title": "Distributed and Parallel Ensemble Classification for Big Data Based on Kullback-Leibler Random Sample Partition"}, {"paperId": "6e4a8ce5eb387cffb71ae1cbfaf8f6e102ef069b", "title": "An Incremental Kernel Density Estimator for Data Stream Computation"}, {"paperId": "0a015ee4ee25a4d65244d317bbb23ac64f53bb84", "title": "Boundary Matching and Interior Connectivity-Based Cluster Validity Anlysis"}, {"paperId": "14e9fcd8c0e0d550b175d22c7bc2755e23f30ee5", "title": "Exploring and cleaning big data with random sample data blocks"}, {"paperId": "23e21d605cbe95b120d82e0a9dd1657557403c51", "title": "Handling 3vs of Big Data Through Swarm Intelligence"}, {"paperId": "75ae42b97b54b02accf303c49b3d025b3cfc7b93", "title": "G-CAS: Greedy Algorithm-Based Security Event Correlation System for Critical Infrastructure Network"}, {"paperId": "dc3da1b458c2bd9bdb8b348090f2e173a1135130", "title": "Volume and Surface Area-Based Cluster Validity Index"}, {"paperId": "6a6df903de77067936c19e6329eba3adebf1c8d9", "title": "Big Data Analytics and Visualization for Food Health Status Determination Using Bigmart Data"}, {"paperId": "ab0dbc1f343dbae63c0e8705c35b4b0375888483", "title": "Big Data Mining and Analytics Big Data Mining and Analytics"}]}
