{"paperId": "d52d6f193bc568f96a792d471c8a3ea0fd1e5000", "publicationVenue": {"id": "29df4b17-9a16-4a4c-94a6-002f52e628b4", "name": "International Conference on Parallel Processing", "type": "conference", "alternate_names": ["ICPP", "Int Conf Parallel Process", "IEEE Int Conf Pulsed Power", "IEEE International Conference on Pulsed Power"], "url": "http://www.wikicfp.com/cfp/program?id=1447"}, "title": "OPS: Optimized Shuffle Management System for Apache Spark", "abstract": "In recent years, distributed computing frameworks, such as Hadoop MapReduce and Spark, are widely used for big data processing. With the explosive growth of the amount of data, companies tend to store intermediate data of the shuffle phase on disk instead of memory. Therefore, intensive network and disk I/O are both involved in the shuffle phase. To optimize the overhead of the shuffle phase, we propose OPS, an open-source distributed computing shuffle management system based on Spark, which provides an independent shuffle service for Spark. By using early-merge and early-shuffle strategy, OPS alleviates the I/O overhead in the shuffle phase and efficiently schedules the I/O and computing resources. OPS also proposes a slot-based scheduling algorithm to predict and calculate the optimal scheduling result of the reduce task. Besides, OPS provides a taint-redo strategy to ensure the fault tolerance of computing jobs. We evaluated the performance of OPS on a 100-node Amazon AWS EC2 cluster. Overall, OPS optimizes the overhead of shuffle by nearly 50%. In the test cases of HiBench, OPS improves end-to-end completion time by nearly 30% on average.", "venue": "International Conference on Parallel Processing", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2020-08-08", "journal": {"name": "Proceedings of the 49th International Conference on Parallel Processing"}, "authors": [{"authorId": "2153512662", "name": "Yuchen Cheng"}, {"authorId": "49762474", "name": "Chunghsuan Wu"}, {"authorId": "1862053497", "name": "Yanqiang Liu"}, {"authorId": "144178027", "name": "Rui Ren"}, {"authorId": "38172793", "name": "Hong Xu"}, {"authorId": "2118582700", "name": "Bin Yang"}, {"authorId": "1689026", "name": "Zhengwei Qi"}], "citations": [{"paperId": "7b03b28e7a7ad5328f1147a98a06ebcb7cb4f541", "title": "Cost-Aware Scheduling and Data Skew Alleviation for Big Data Processing in Heterogeneous Cloud Environment"}, {"paperId": "42398f605f3f4d3b6a2014baddf08308e5b5958c", "title": "Efficient. Scalable and Robust Data Shuffle Service for Distributed MapReduce Computing on Cloud"}, {"paperId": "fefdd694006cbb4f8dc82d11008d20caaebd6e97", "title": "PipeDevice: a hardware-software co-design approach to intra-host container communication"}, {"paperId": "a4d4ff654e50547105692b211291ea89b5760d2d", "title": "A Framework for Optimizing Spark Configurations"}]}
