{"paperId": "d53d8e7b0283d2de9483417652c9507f26d80d02", "publicationVenue": {"id": "776d6c56-f19e-409f-9a23-ea13c43f02c4", "name": "Make", "alternate_names": ["Make"], "issn": "1365-8190"}, "title": "SFMGNet: A Physics-Based Neural Network To Predict Pedestrian Trajectories", "abstract": "Autonomous robots and vehicles are expected to soon become an integral part of our environment. Unsatisfactory issues regarding interaction with existing road users, performance in mixed-traffic areas and lack of interpretable behavior remain key obstacles. To address these, we present a physics-based neural network, based on a hybrid approach combining a social force model extended by group force (SFMG) with Multi-Layer Perceptron (MLP) to predict pedestrian trajectories considering its interaction with static obstacles, other pedestrians and pedestrian groups. We quantitatively and qualitatively evaluate the model with respect to realistic prediction, prediction performance and prediction\"interpretability\". Initial results suggest, the model even when solely trained on a synthetic dataset, can predict realistic and interpretable trajectories with better than state-of-the-art accuracy.", "venue": "Make", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-02-06", "journal": {"name": "ArXiv", "volume": "abs/2202.02791"}, "authors": [{"authorId": "1657673487", "name": "Sakif Hossain"}, {"authorId": "9453474", "name": "F. T. Johora"}, {"authorId": "2110626804", "name": "J-P. Müller"}, {"authorId": "2070795886", "name": "Sven Hartmann"}, {"authorId": "145147353", "name": "A. Reinhardt"}], "citations": [{"paperId": "4891844a910c25507f432f3d435930c57fa6c196", "title": "Human Trajectory Forecasting with Explainable Behavioral Uncertainty"}, {"paperId": "a4e3dd8af9fe7982b5599ce32e96371b15a3aa43", "title": "Human Trajectory Prediction via Neural Social Physics"}, {"paperId": "e17024a7715f8ec8132deac7516b6802e0f91541", "title": "Review of Pedestrian Trajectory Prediction Methods: Comparing Deep Learning and Knowledge-Based Approaches"}]}
