{"paperId": "d553753a4db9eeb739549b51ce49cfa854e5abf9", "publicationVenue": {"id": "3da56ce6-4a70-402c-a8b0-7dd39a3273d3", "name": "Software, Practice & Experience", "type": "journal", "alternate_names": ["Softw  Pract Exp", "Softw Pract  Exp", "Software - Practice and Experience"], "issn": "0038-0644", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/1752", "alternate_urls": ["http://www.interscience.wiley.com/jpages/0038-0644/", "https://onlinelibrary.wiley.com/journal/1097024X"]}, "title": "Analyzing spatial analytics systems based on Hadoop and Spark: A user perspective", "abstract": "Spatial analytics systems (SASs) represent a technology capable of managing huge volumes of spatial data using frameworks such as Apache Hadoop and Apache Spark. An increasing number of SASs have been proposed, requiring a comparison among them. However, existing comparisons in the literature provide a system‐centric view based on performance evaluations. Thus, there is a lack of comparisons based on the user‐centric view, that is, comparisons that help users to understand how the characteristics of SASs are useful to meet the specific requirements of their spatial applications. In this article, we provide a user‐centric comparison of the following SASs based on Hadoop and Spark: Hadoop‐GIS, SpatialHadoop, SpatialSpark, GeoSpark, GeoMesa Spark, SIMBA, LocationSpark, STARK, Magellan, SparkGIS, and Elcano. This comparison employs an extensive set of criteria related to the general characteristics of these systems, to the aspects of spatial data handling, and to the aspects inherent to distributed systems. Based on this comparison, we introduce guidelines to help users to choose an appropriate SAS. We also describe two case studies based on real‐world applications to illustrate the use of these guidelines. Finally, we discuss chronological tendencies related to SASs and identify limitations that SASs should address to improve user experience.", "venue": "Software, Practice & Experience", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-08-31", "journal": {"name": "Software: Practice and Experience", "pages": "2121 - 2144", "volume": "50"}, "authors": [{"authorId": "66548827", "name": "J. P. C. Castro"}, {"authorId": "3266298", "name": "A. Carniel"}, {"authorId": "1709113", "name": "C. D. Ciferri"}], "citations": [{"paperId": "1e681e5b499a49d27167adf1c7c9762143fa8603", "title": "Spatial Index Structures for Modern Storage Devices: A Survey"}, {"paperId": "739ae8cfbfce8077fee8d48374375a7f4272f877", "title": "Defining and designing spatial queries: the role of spatial relationships"}, {"paperId": "84294c7bbde52b026fc08dae023998af97b52218", "title": "Efficient distributed algorithms for distance join queries in spark-based spatial analytics systems"}, {"paperId": "ff8cfbe999f134e8fe5f8f0f9b06520d26ceef15", "title": "An Enhanced Partitioning Approach in SpatialHadoop for Handling Big Spatial Data"}, {"paperId": "f464a9c887bf234e9fa16e69a222598d8868d451", "title": "A Systematic Review of Spatial Approximations in Spatial Database Systems"}, {"paperId": "4100e67536b89244b8c85355c32ac65b75760b0f", "title": "Efficient Group K Nearest-Neighbor Spatial Query Processing in Apache Spark"}, {"paperId": "ed4ff050378a818a5c868668ad8d7d0ce41ca9ee", "title": "Combining Fog and Cloud Computing to Support Spatial Analytics in Smart Cities"}, {"paperId": "b9e25fd9dca7e25f2fcd8a85fcaad1fb799f6bf6", "title": "Métodos para auxílio na tomada de decisão em cidades inteligentes"}, {"paperId": "03c5f3a6d1d50da7bfc0f50be0f80e8b582f47e2", "title": "Aadhaar Data Analysis Comparison in MapReduce, Hive and Spark"}]}
