{"paperId": "d56fed75c01c6bfb3f37a59f95f174c2b93c5cda", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Jump off the Bandwagon? Characterizing Bandwagon Fans' Future Loyalty in Online NBA Fan Communities", "abstract": "Online user dynamics has been actively studied in recent years and bandwagon behavior is one of the most representative topics which can provide valuable insights for user identity change. Many previous studies have characterized bandwagon users and leveraged such characteristics to tackle practical problems such as community loyalty prediction. However, very few of them have investigated bandwagon dynamics from a long-term perspective. In this work, we focus on characterizing and predicting long-term bandwagon user behaviors in the context of online fan loyalty. Using a dataset collected from NBA-related discussion forums on Reddit, we trace the long-term loyalty status of bandwagon fans to capture their latent behavioral characteristics and then propose a computational model to predict their next sport season loyalty status with their home teams. Our analyses reveal that bandwagoning for most fans is a temporary switch and most of them will be back in the long term. In addition, online fans with different loyalty levels to their home teams have demonstrated different behaviors in various aspects, such as activity level, language usage and reply network properties. We then propose a model based on such behavioral characteristics to predict their next-season loyalty status. Its promising performance demonstrates the effectiveness of our behavior characterization.", "venue": "arXiv.org", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-01-21", "journal": {"name": "ArXiv", "volume": "abs/2401.11629"}, "authors": [{"authorId": "2280208903", "name": "Yichen Wang"}, {"authorId": "2280136194", "name": "Qin Lv"}], "citations": []}
