{"paperId": "d577f39ca9864c2a02559304bd88cb89b89d7f3c", "publicationVenue": {"id": "b189dec0-41d0-4cea-a906-7c5186895904", "name": "Global Communications Conference", "type": "conference", "alternate_names": ["GLOBECOM", "Glob Commun Conf"], "url": "http://www.ieee-globecom.org/"}, "title": "Distributed Resource Management for Licensed and Unlicensed Integrated Mobile Edge Computing", "abstract": "This paper addresses a joint radio and computational resources allocation problem for mobile edge computing (MEC) networks. To alleviate the shortage of licensed spectrum resources, computing tasks can be offloaded to the MEC server through not only the licensed channels but also the unlicensed channels, where the adaptive duty-cycle-muting (DCM) mechanism is employed at the user terminals (UTs) to guarantee the fair coexistence with the WiFi networks. Moreover, Stackelberg game formulation is used to build up a decentralized radio and computational resources allocation framework, where the MEC server is modeled as a leader to set the price of the licensed spectrum, while UTs as followers compete for the radio and computational resources as a non-cooperative game. The objective of each UT is to minimize the long-term energy consumption with the guarantee of task buffer stability. Accordingly, we develop a distributed algorithm to achieve the equilibrium solution for the formulated Stackelberg game. Numerical results are presented to demonstrate that the proposed scheme is effective with respect to the reduction on energy consumption of UTs with limited signaling overheads.", "venue": "Global Communications Conference", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-12-01", "journal": {"name": "2021 IEEE Global Communications Conference (GLOBECOM)", "pages": "1-6"}, "authors": [{"authorId": "2152840454", "name": "Xiao Lu"}, {"authorId": "145350728", "name": "Rui Yin"}, {"authorId": "2145763579", "name": "Chao Chen"}, {"authorId": "2135089146", "name": "Xianfu Chen"}, {"authorId": "66870093", "name": "Celimuge Wu"}], "citations": [{"paperId": "e4eb292a15ce5e4911002f7c4b022f749b6b2de0", "title": "Distributed Resource Management in Unlicensed Assisted Mobile Edge Computing"}]}
