{"paperId": "d57d21856bf6cb1a056cc01921d7f74e0ac13c87", "publicationVenue": {"id": "f2c78b1b-6bcc-4700-859b-af9401c02941", "name": "Buildings", "type": "journal", "issn": "0007-3725", "alternate_issns": ["2075-5309"], "url": "https://www.buildings.com/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217973", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217973", "https://www.mdpi.com/journal/buildings"]}, "title": "A Gabor Filter-Based Protocol for Automated Image-Based Building Detection", "abstract": "Detecting buildings from high-resolution satellite imagery is beneficial in mapping, environmental preparation, disaster management, military planning, urban planning and research purposes. Differentiating buildings from the images is possible however, it may be a time-consuming or complicated process. Therefore, the high-resolution imagery from satellites needs to be automated to detect the buildings. Additionally, buildings exhibit several different characteristics, and their appearance in these images is unplanned. Moreover, buildings in the metropolitan environment are typically crowded and complicated. Therefore, it is challenging to identify the building and hard to locate them. To resolve this situation, a novel probabilistic method has been suggested using local features and probabilistic approaches. A local feature extraction technique was implemented, which was used to calculate the probability density function. The locations in the image were represented as joint probability distributions and were used to estimate their probability distribution function (pdf). The density of building locations in the image was extracted. Kernel density distribution was also used to find the density flow for different metropolitan cities such as Sydney (Australia), Tokyo (Japan), and Mumbai (India), which is useful for distribution intensity and pattern of facility point f interest (POI). The purpose system can detect buildings/rooftops and to test our system, we choose some crops with panchromatic high-resolution satellite images from Australia and our results looks promising with high efficiency and minimal computational time for feature extraction. We were able to detect buildings with shadows and building without shadows in 0.4468 (seconds) and 0.5126 (seconds) respectively.", "venue": "Buildings", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-07-08", "journal": {"name": "Buildings"}, "authors": [{"authorId": "71940750", "name": "Hafiz Suliman Munawar"}, {"authorId": "1491641381", "name": "Riya Aggarwal"}, {"authorId": "65883646", "name": "Zakria Qadir"}, {"authorId": "2111181253", "name": "Sara Imran Khan"}, {"authorId": "3089801", "name": "A. Kouzani"}, {"authorId": "2065473783", "name": "M. P. Mahmud"}], "citations": [{"paperId": "7397a3bfb1db00870727b22535ec89164a4bb261", "title": "Structural Health Monitoring That Uses Light Stress Wave"}, {"paperId": "a5728b35aca5da6582cbb6d7fd93592605157760", "title": "Enhancing CNNs Performance on Object Recognition Tasks with Gabor Initialization"}, {"paperId": "6f3352523b021a14b3cb32d19a8df3afb5ac5da0", "title": "Analyzing the efficacy of SAF (sulfonated acetone formaldehyde) as mechano-luminous (ML) material for detecting incipient crack"}, {"paperId": "797af6b005bf4828ebcd941562f70bd07f924140", "title": "An Integrated and Optimized Fog Computing enabled Framework to minimize Time Complexity in Smart Grids"}, {"paperId": "398c410b87e7754d889e2580c2ed20c60ba9f2bc", "title": "Classification of Covid-19 X-Ray Images Using Fuzzy Gabor Filter and DCNN"}, {"paperId": "55d407538f51e1c03dfc371ae194be916dda1bb5", "title": "Image Segmentation on Gabor Filtered images using Projective Transformation"}, {"paperId": "edbacb0f61843f31a46b560985ece646d91d124f", "title": "LSS-VGG16"}, {"paperId": "284b7e4f9fa6b96a5161a340db3160b2e0d1a68c", "title": "Research on Image Classification and Retrieval Using Deep Learning with Attention Mechanism on Diaspora Chinese Architectural Heritage in Jiangmen, China"}, {"paperId": "baffa5b093e69b303b57cfa43cf5972f9b42bd1f", "title": "Remote Sensing Image Classification: A Comprehensive Review and Applications"}, {"paperId": "47d7b57ba380c7faed4e994a5511d7745184668f", "title": "Automatic Building Footprint Extraction using Random Forest Algorithm from High Resolution Google Earth Images: A Feature-Based Approach"}, {"paperId": "c762a68a5eee112f11888d46ffdb6d1d405c7de8", "title": "Crack Detection in Concrete Structures Using Deep Learning"}, {"paperId": "f72336cc36173cd462022cc12b0cecf565950a03", "title": "Big Data Management in Drug-Drug Interaction: A Modern Deep Learning Approach for Smart Healthcare"}, {"paperId": "66619375a03bb9751dc86e2ec2654de67e2a0b7c", "title": "Automatic Target Detection from Satellite Imagery Using Machine Learning"}, {"paperId": "bf6b994a579b1a8b74dfd6d5ba3dc5888fd86188", "title": "Using Adaptive Sensors for Optimised Target Coverage in Wireless Sensor Networks"}, {"paperId": "acecc728c5f76669a6b36920059ce15b77dccddf", "title": "Medicinal Plant Identification using Gabor Filters and Deep Learning Techniques: A Paper Review"}, {"paperId": "50188173d1b50df800ed7da788b98493753a7864", "title": "Cloud- and Fog-Integrated Smart Grid Model for Efficient Resource Utilisation"}, {"paperId": "00aa9ecab8906642046c37df9f47b096fbfefbb3", "title": "Promoting Customer Loyalty and Satisfaction in Financial Institutions through Technology Integration: The Roles of Service Quality, Awareness, and Perceptions"}, {"paperId": "6e53924e5a5d84a553fad3b207bd3ec698071cf8", "title": "Effects of COVID-19 on the Australian Economy: Insights into the Mobility and Unemployment Rates in Education and Tourism Sectors"}, {"paperId": "628f95efc980f2985c4b53d1ebd283c436af674d", "title": "Biometric Protection Information System with Extension of Segmentation Methods"}]}
