{"paperId": "d580af544aa9f01903ebebe554c4281e7810a777", "publicationVenue": null, "title": "A Four-Layer Architecture for Online and Historical Big Data Analytics", "abstract": "Big data processing and analytics technologies have drawn much attention in recent years. However, the recent explosive growth of online data streams brings new challenges to the existing technologies. These online data streams tend to be massive, continuously arriving, heterogeneous, time-varying and unbounded. Therefore, it is necessary to have an integrated approach to process both big static data and online big data streams. We call this integrated approach online and historical big data analytics (OHBDA). We propose a four-layer architecture of OHBDA, i.e. including the storage layer, online and historical data processing layer, analytics layer, and decision-making layer. Functionalities and challenges of the four layers are further discussed. We conclude with a discussion of the requirements for the future OHBDA solutions, which may serve as a foundation for future big data analytics research.", "venue": "2016 IEEE 14th Intl Conf on Dependable, Autonomic and Secure Computing, 14th Intl Conf on Pervasive Intelligence and Computing, 2nd Intl Conf on Big Data Intelligence and Computing and Cyber Science and Technology Congress(DASC/PiCom/DataCom/CyberSciTech)", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2016-08-01", "journal": {"name": "2016 IEEE 14th Intl Conf on Dependable, Autonomic and Secure Computing, 14th Intl Conf on Pervasive Intelligence and Computing, 2nd Intl Conf on Big Data Intelligence and Computing and Cyber Science and Technology Congress(DASC/PiCom/DataCom/CyberSciTech)", "pages": "634-639"}, "authors": [{"authorId": "3119734", "name": "J. Zhu"}, {"authorId": "2688554", "name": "Jialing Xu"}, {"authorId": "2052674293", "name": "V. Li"}], "citations": [{"paperId": "83ecdb3ff9e0515fc39a714355647168f612790b", "title": "Task Allocation in Hybrid Big Data Analytics for Urban IoT Applications"}, {"paperId": "9552464657c5ed3d8983f5e7bd40f89b95ebefc8", "title": "SMART: A Service-Oriented Statistical Analysis Framework on Spatio-Temporal Big Data (Short Paper)"}, {"paperId": "b0b8831334b425bdd5d0018f87b8df03eb8e8832", "title": "A five-layer architecture for big data processing and analytics"}, {"paperId": "92bdc6e93ebebf15180db33aabcee8bd956b41dd", "title": "Requirements Engineering for Large-Scale Big Data Applications"}]}
