{"paperId": "d58dcb91c9172b8c4620d34d517e3d00012a576c", "publicationVenue": {"id": "83ff973b-8a0e-4e00-a06a-2cfd9e222de9", "name": "PLoS Biology", "type": "journal", "alternate_names": ["Plo Biology", "PLOS Biology", "PLO Biology"], "issn": "1544-9173", "url": "http://www.pubmedcentral.nih.gov/tocrender.fcgi?journal=212", "alternate_urls": ["http://www.plosbiology.org/", "https://journals.plos.org/plosbiology/"]}, "title": "Pharmacological induction of autophagy reduces inflammation in macrophages by degrading immunoproteasome subunits", "abstract": "Defective autophagy is linked to proinflammatory diseases. However, the mechanisms by which autophagy limits inflammation remain elusive. Here, we found that the pan-FGFR inhibitor LY2874455 efficiently activated autophagy and suppressed expression of proinflammatory factors in macrophages stimulated by lipopolysaccharide (LPS). Multiplex proteomic profiling identified the immunoproteasome, which is a specific isoform of the 20s constitutive proteasome, as a substrate that is degraded by selective autophagy. SQSTM1/p62 was found to be a selective autophagy-related receptor that mediated this degradation. Autophagy deficiency or p62 knockdown blocked the effects of LY2874455, leading to the accumulation of immunoproteasomes and increases in inflammatory reactions. Expression of proinflammatory factors in autophagy-deficient macrophages could be reversed by immunoproteasome inhibitors, confirming the pivotal role of immunoproteasome turnover in the autophagy-mediated suppression on the expression of proinflammatory factors. In mice, LY2874455 protected against LPS-induced acute lung injury and dextran sulfate sodium (DSS)-induced colitis and caused low levels of proinflammatory cytokines and immunoproteasomes. These findings suggested that selective autophagy of the immunoproteasome was a key regulator of signaling via the innate immune system.", "venue": "PLoS Biology", "year": 2024, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-03-01", "journal": {"name": "PLOS Biology", "volume": "22"}, "authors": [{"authorId": "2206367306", "name": "Jiao Zhou"}, {"authorId": "2109399206", "name": "Chunxia Li"}, {"authorId": "2148408214", "name": "Meng Lu"}, {"authorId": "9755847", "name": "Gaoyue Jiang"}, {"authorId": "2265594378", "name": "Shanze Chen"}, {"authorId": "2109149345", "name": "Huihui Li"}, {"authorId": "6425287", "name": "Kefeng Lu"}], "citations": [{"paperId": "34bf134351aa8447d3ca4f1f319758bd57ad44a0", "title": "Degrade to stay healthy—Proteolytic interplay during inflammation"}]}
