{"paperId": "d599fd7e0b1c849dd2f3b11e0375e3eeecffd808", "publicationVenue": {"id": "f8e385ef-b52f-4337-ab3b-e09080aec353", "name": "International Conference on Edge Computing [Services Society]", "type": "conference", "alternate_names": ["Int Conf Edge Comput [services Soc", "EDGE", "At the edge", "edge", "Edge"], "issn": "1923-4996", "alternate_issns": ["0225-7181"], "url": "https://journals.library.mun.ca/ojs/index.php/ate", "alternate_urls": ["https://journals.library.mun.ca/ojs/index.php/ate/index"]}, "title": "Realising the Power of Edge Intelligence: Addressing the Challenges in AI and tinyML Applications for Edge Computing", "abstract": "The edge computing paradigm has become increasingly popular due to its benefits over cloud computing, particularly in the context of AI and IoT applications. Its harmonising with AI to form Edge intelligence (EI) has opened up possible application areas for further development. Tiny machine learning (tinyML) is a specific focus within EI that targets machine learning algorithms deployed to constrained edge devices such as microcontrollers. However, despite the potential advantages of EI and tinyML, there are several challenges that researchers often overlook, especially when deploying on microcontrollers. These challenges include programming language choice, lack of support for development boards, neglect of preprocessing, choice of sensors, and insufficient labelled data. This paper assesses these previously unaddressed challenges, highlights their issues with a particular focus on microcontroller deployment, and offers potential solutions. By addressing these challenges, researchers can design more effective and efficient tinyML systems, pushing the boundaries of edge AI faster than before.", "venue": "International Conference on Edge Computing [Services Society]", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-07-01", "journal": {"name": "2023 IEEE International Conference on Edge Computing and Communications (EDGE)", "pages": "337-343"}, "authors": [{"authorId": "2065723600", "name": "Michael Gibbs"}, {"authorId": "2034060", "name": "E. Kanjo"}], "citations": []}
