{"paperId": "d5a4eabf9f8216bff6e78f11c15bcd0a5d004c49", "publicationVenue": {"id": "1124d164-490d-4da9-b0c2-ce8a8dc98202", "name": "BigData Congress [Services Society]", "type": "conference", "alternate_names": ["BigData", "Bigdata Congr [services Soc", "IEEE Int Conf Big Data", "IEEE International Conference on Big Data", "Int Congr Big Data", "International Congress on Big Data", "Bigdata Congr", "BigData Congress"]}, "title": "A Real-Time Scheduling Strategy Based on Processing Framework of Hadoop", "abstract": "Due to the batch processing capability and distributed storage, MapReduce and HDFS have always been the core parts of Hadoop. Nowadays, many studies still focus on improving and optimizing of the MapReduce task scheduling algorithms. However, in terms of real-time processing, MapReduce task scheduling algorithms cannot perform very well. In this paper, we design a real-time approach based on Hadoop application framework that has practical value in the field of real-time processing. Then, we put forward real-time scheduling algorithms for the file storage layer and computing layer in the framework. The motivation of this paper is to put forward real-time processing algorithms of Hadoop to deal with big data analysis issues. For the file storage layer, we propose a data management algorithm strategy named HDMA. The algorithm considers a variety of factors such as load balancing, data-locality and the heterogeneous properties of each machine within the heterogeneous cluster. HDMA can significantly improve the computing performance of the whole cluster. For the computing layer, we propose a resource dynamic allocation scheduling algorithm based on the length of job named LERDA. LERDA divides various jobs into several levels according to the length of each job and thus avoids short job waiting for a long time. Experiments show that (a) our algorithms increase the data-locality by 15% compared to other algorithms, (b) our algorithms improve the real-time performance of map by approximately 20% in the best case, (c) LERDA can prevent short jobs from suffering starvation effects.", "venue": "BigData Congress [Services Society]", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2017-06-01", "journal": {"name": "2017 IEEE International Congress on Big Data (BigData Congress)", "pages": "321-328"}, "authors": [{"authorId": "25121136", "name": "Fangbing Chen"}, {"authorId": "2108410330", "name": "Ji Liu"}, {"authorId": "2073517", "name": "Yuesheng Zhu"}], "citations": [{"paperId": "e97653fcc2e12b89ca0d4b23ef626c1d64965589", "title": "Towards an Energy Efficient Computing With Coordinated Performance-Aware Scheduling in Large Scale Data Clusters"}, {"paperId": "f94380ad502ae33fa64743e7c52bf9f721dce577", "title": "Construction and Optimization of a File Distribution Model for All-to-All Comparison of Big Dataset"}, {"paperId": "8f01692b3f6bca8e33d59f51e08ed07c7ec70512", "title": "Scheduling in Mapreduce Clusters"}]}
