{"paperId": "d5ac3aa87ebf3032ef8171f1c958629819123ecd", "publicationVenue": {"id": "8bc59e8b-e251-4201-839a-ec83ae78859d", "name": "Complex", "type": "conference", "alternate_names": ["Int Conf Complex Sci", "International Conference on Complex Sciences"], "issn": "0806-1912", "alternate_issns": ["1538-6848"], "url": "http://wo.uio.no/as/WebObjects/nettlogg.woa/1/wa/logg?logg=5904", "alternate_urls": ["http://www.wikicfp.com/cfp/program?id=545", "https://www.complex.com/"]}, "title": "Industry 4.0-Driven Development of Optimization Algorithms: A Systematic Overview", "abstract": "The Fourth Industrial Revolution means the digital transformation of production systems. Cyber-physical systems allow for the horizontal and vertical integration of these production systems as well as the exploitation of the benefits via optimization tools. This article reviews the impact of Industry 4.0 solutions concerning optimization tasks and optimization algorithms, in addition to the identification of the new R&D directions driven by new application options. The basic organizing principle of this overview of the literature is to explore the requirements of optimization tasks, which are needed to perform horizontal and vertical integration. This systematic review presents content from 900 articles on Industry 4.0 and optimization as well as 388 articles on Industry 4.0 and scheduling. It is our hope that this work can serve as a starting point for researchers and developers in the field.", "venue": "Complex", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-02-12", "journal": {"name": "Complex.", "pages": "6621235:1-6621235:22", "volume": "2021"}, "authors": [{"authorId": "2051212609", "name": "Róbert Csalódi"}, {"authorId": "91445090", "name": "Z. Süle"}, {"authorId": "2766642", "name": "S. Jaskó"}, {"authorId": "31152157", "name": "Tibor Holczinger"}, {"authorId": "1976610", "name": "J. Abonyi"}], "citations": [{"paperId": "00b4cdf06e012be779d868d2819f3604298d476f", "title": "Optimal planning and scheduling of information processes during interaction among mobile objects"}, {"paperId": "46efa86740f36fd819a4a6492ec3c61bc48647de", "title": "A smart energy scheduling under uncertainties of an iron ore stockyard-port system using a rolling horizon algorithm"}, {"paperId": "3ae6bcbc24f8ba5ea893e22bccd0a8e63d3e7bc5", "title": "Planning an Integrated Stockyard–Port System for Smart Iron Ore Supply Chains via VND Optimization"}, {"paperId": "cc7142bc7442269925804f11b47dbde3f27466a0", "title": "A Holistic Framework for Production Scheduling in Industry 4.0"}, {"paperId": "9d67a15d91e221b1490edaf81e60660efaf6f42e", "title": "Quantum information processing with superconducting circuits: a perspective"}, {"paperId": "4799338324694f8385f0da48f65ee620dbe8e249", "title": "Data sharing in Industry 4.0 - AutomationML, B2MML and International Data Spaces-based solutions"}, {"paperId": "448e1abd8c730b52b3fcc30cd65cf87c6180629f", "title": "Human Autonomy in Algorithmic Management"}, {"paperId": "237e4c1eb7114546f6aec80b61afef6d3fa91ab6", "title": "Process management of ergonomic workplace based on augmented reality principles"}, {"paperId": "80a58f1479dfbce7695cd53c555e10e26460d7c7", "title": "Making Cities Smarter—Optimization Problems for the IoT Enabled Smart City Development: A Mapping of Applications, Objectives, Constraints"}, {"paperId": "744e66b925a63424b0e2a67aa86bf44496e68cd4", "title": "Bridging the Gap in Technology Transfer for Advanced Process Control with Industrial Applications"}, {"paperId": "5ba02d8802dd6d73e56f81da7fc15daabb18c16b", "title": "Modular-topology optimization of structures and mechanisms with free material design and clustering"}, {"paperId": "02d0fa9818c54dcb9eeb787054854a7385c6a48c", "title": "A New European Bauhaus for a Culture of Transversality and Sustainability"}, {"paperId": "4f26b1852ad2a526d7853d9a5b4b406bb5ba0770", "title": "Development of an Intelligent Quality Management System for Micro Laser Welding: An Innovative Framework and Its Implementation Perspectives"}, {"paperId": "91524d2bab9f6652c47a452f8e328c6d4c854520", "title": "Models and Algorithms for Planning and Scheduling of Complex Objects Functioning and Modernization"}, {"paperId": "d96b75492a701d629d174b97c8b8b55f01759ad9", "title": "The evolution of production scheduling from Industry 3.0 through Industry 4.0"}, {"paperId": "a861643d7ef34ee9d65f1875c736a477b940c558", "title": "Design optimization of needle and spherical roller bearings using traditional and pareto optimal approaches"}, {"paperId": "8ee86afbe6f452a5181148d67a5e07e6bc1ad50c", "title": "Combined Models and Algorithms on Modern Proactive Intellectual Scheduling under Industry 4.0 Environment"}, {"paperId": "8d31becd068f7d7b8330c3fcbff6ddeba4e72785", "title": "Artificial Intelligence from Industry 5.0 perspective: Is the Technology Ready to Meet the Challenge?"}, {"paperId": "007e0eda351944fc62a897c913a0d23d25a10ce3", "title": "Complex Scheduling of Measurement and Calculation Systems Functioning"}, {"paperId": "4ffadc576c31d710afab3590892f570badfae939", "title": "The Applicability of Reinforcement Learning Methods in the Development of Industry 4.0 Applications"}]}
