{"paperId": "d5b5c02013cd243688e0edbaede1faf5b1bc37e7", "publicationVenue": null, "title": "Distributed Spatiotemporal Indexes for Querying and Mining in Key-Value Stores", "abstract": "The recent ubiquity of sensors and GPS-enabled devices has resulted in an explosion of spatiotemporal data generated from probe cars, traffic sensors, and smartphones. To benefit from such data, applications need data storage that can handle the massive volume of data and support high-computational queries. Although key-value store databases (KVSs) efficiently handle large-scale data, they are not equipped with effective functions for supporting geographical data. To solve this problem, we present G+-HBase, a high-performance spatiotemporal database based on HBase, a standard KVS. First, we present G-HBase, a geographical database based on HBase. To index geographic data, we use Geohash as the rowkey in KVSs. Then, we propose a novel partitioning method, namely binary Geohash rectangle partitioning, to support spatial queries. Our extensive experiments on real datasets have demonstrated improved performance with k nearest neighbors and range query in G-HBase when compared with SpatialHadoop, a stateof-the-art framework with native support for spatial data. We also observed that performance of the spatial join query in G-HBase was on par with SpatialHadoop and outperforms SJMR algorithm in HBase. Second, we extend G-HBase to G+-HBase to support spatiotemporal data in an intelligent transportation system. In the spatiotemporal index, we adopted STCode, a longitude, latitude, and time-encoding algorithm, to build an index on top of HBase. Our proposed index structure allows continuous updates of objects and provides an efficient prefix filter for supporting spatiotemporal data retrieval. Experimental results demonstrate the high performance of spatiotemporal queries with response time meeting the requirements of real-time queryprocessing systems. Finally, we further extend G+-HBase to deal with user-generated geo-tagged social data. We study an efficient multidimensional index structure and parallel processing approaches for the top-k frequent spatiotemporal terms query, a basic analytic query on geo-tagged social data. Given a spatiotemporal range, the query aggregates frequencies of terms among the social posts in that range to find the most frequent terms. In order to reduce storage for indexing and to improve the query performance, we propose a distributed index structure", "venue": "", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2019-03-22", "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "2349959", "name": "H. Lê"}], "citations": []}
