{"paperId": "d5c64d3273154c4eb73c8e92f77a43150192bf0c", "publicationVenue": {"id": "142347a8-a3f6-4ce4-bc56-09bc8fc9461d", "name": "Frontiers in Medicine", "type": "journal", "alternate_names": ["Frontiers of Medicine", "Front Med", "Fronteras en Medicina"], "issn": "2296-858X", "alternate_issns": ["2095-0217", "2618-2459"], "url": "https://www.frontiersin.org/journals/medicine", "alternate_urls": ["https://link.springer.com/journal/volumesAndIssues/11684", "http://link.springer.com/journal/11684", "http://www.frontiersin.org/Medicine", "http://journal.frontiersin.org/journal/medicine", "http://www.fronteras.com.ar/"]}, "title": "A risk prediction model for type 2 diabetes mellitus complicated with retinopathy based on machine learning and its application in health management", "abstract": "Objective This study aimed to establish a risk prediction model for diabetic retinopathy (DR) in the Chinese type 2 diabetes mellitus (T2DM) population using few inspection indicators and to propose suggestions for chronic disease management. Methods This multi-centered retrospective cross-sectional study was conducted among 2,385 patients with T2DM. The predictors of the training set were, respectively, screened by extreme gradient boosting (XGBoost), a random forest recursive feature elimination (RF-RFE) algorithm, a backpropagation neural network (BPNN), and a least absolute shrinkage selection operator (LASSO) model. Model I, a prediction model, was established through multivariable logistic regression analysis based on the predictors repeated ≥3 times in the four screening methods. Logistic regression Model II built on the predictive factors in the previously released DR risk study was introduced into our current study to evaluate the model’s effectiveness. Nine evaluation indicators were used to compare the performance of the two prediction models, including the area under the receiver operating characteristic curve (AUROC), accuracy, precision, recall, F1 score, balanced accuracy, calibration curve, Hosmer-Lemeshow test, and Net Reclassification Index (NRI). Results When including predictors, such as glycosylated hemoglobin A1c, disease course, postprandial blood glucose, age, systolic blood pressure, and albumin/urine creatinine ratio, multivariable logistic regression Model I demonstrated a better prediction ability than Model II. Model I revealed the highest AUROC (0.703), accuracy (0.796), precision (0.571), recall (0.035), F1 score (0.066), Hosmer-Lemeshow test (0.887), NRI (0.004), and balanced accuracy (0.514). Conclusion We have built an accurate DR risk prediction model with fewer indicators for patients with T2DM. It can be used to predict the individualized risk of DR in China effectively. In addition, the model can provide powerful auxiliary technical support for the clinical and health management of patients with diabetes comorbidities.", "venue": "Frontiers in Medicine", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-04-27", "journal": {"name": "Frontiers in Medicine", "volume": "10"}, "authors": [{"authorId": "113060241", "name": "H. Pan"}, {"authorId": "2110846828", "name": "Jijia Sun"}, {"authorId": "51292325", "name": "Xinla Luo"}, {"authorId": "2215396868", "name": "Heling Ai"}, {"authorId": "1854307364", "name": "Jing Zeng"}, {"authorId": "2056570597", "name": "Rong Shi"}, {"authorId": "2153659383", "name": "Andy K Zhang"}], "citations": [{"paperId": "118753c83bdaa93824bc9f733176474bab70fdab", "title": "Anti-hepatopathy and anti-nephropathy activities of Taraxacum officinale in a rat model of Streptozotocin diabetes-induced hepatorenal toxicity and dyslipidemia via attenuation of oxidative stress, inflammation, apoptosis, electrolyte imbalances, and mitochondrial dysfunction"}, {"paperId": "a34e91aaf0881feff9146e863bd71ca146117119", "title": "Predicting the risk of diabetic retinopathy using explainable machine learning algorithms."}, {"paperId": "e27f32d5a7a57632caa067329578a509938467e4", "title": "Vitexin isolated from Acanthus ilicifolius L. leaf enhances GLUT-4 translocation in experimental diabetic rats"}]}
