{"paperId": "d5cffbf3a65ca01d1f9bd1edbd0ca6699e103419", "publicationVenue": null, "title": "PHYTO: An IoT Urban Gardening Mobile App", "abstract": "Urban gardening has taken the interest of people in the Philippines. Due to several reasons, such as better quality of produce, less expensive alternative, and with the accessibility of the Internet, it has been made possible for people to gain the information they need for gardening and equipment. The recent advancement and dependence on the Internet today, allowed the development of Internet of things (IoT). With IoT, it is possible to connect anything to the \"cloud\" using hardware such as a microcontroller units. Application of this technology could be seen from agriculture, manufacturing, health and home security. This study focused on the integration of urban agriculture on indoor gardening. The developed system provided plant owners and enthusiasts a possible way of monitoring plants' condition in an indoor setup through a mobile application. The mobile application gives updates and information, such as light and water plant needs, through the use of microcontroller unit sensors and other components. Sensors used and connected to the indoor plants provide information like the indoor temperature and humidity, plant's soil moisture and the water level of the water source. By using a mobile application, analysis of the plant conditions can be determined and known by the plant owners through a connection with the cloud. This study shows that the developed system is highly recommended as a means of alternative urban gardening and has a high commercial viability.", "venue": "Proceedings of the 2019 2nd International Conference on Information Science and Systems", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "Conference"], "publicationDate": "2019-03-16", "journal": {"name": "Proceedings of the 2nd International Conference on Information Science and Systems"}, "authors": [{"authorId": "9307946", "name": "M. Samonte"}, {"authorId": "133925976", "name": "Eugene Paolo E. Signo"}, {"authorId": "134639955", "name": "Raphael Julian M. Gayomali"}, {"authorId": "134871993", "name": "W. Rey"}, {"authorId": "24860897", "name": "Elcid A. Serrano"}], "citations": [{"paperId": "34564d702d2e5d7bbd6b462d41113e7057fc63cb", "title": "Constructed wetlands nature-based solutions to enhance urban resilience in Egyptian cities"}, {"paperId": "040895decd3400be47dea734c89490ecbcaded74", "title": "VLAS: Vacant Land Assessment System for Urban Renewal and Greenspace Planning in Legacy Cities"}, {"paperId": "308a11df07d5ca1140c199e4aad047a51726c1c9", "title": "Drivers to improve metal(loid) phytoextraction with a focus on microbial degradation of dissolved organic matter in soils"}, {"paperId": "5ec9b375f45e97a68230e3bd04e03aacc94f0cd4", "title": "Phytostabilization alternatives for an abandoned mine tailing deposit in northwestern Mexico"}, {"paperId": "34d7c8d560c199be65b69edd73f90ab01fe1ba5c", "title": "Smart Irrigation with Water Level Indicators Using Logistic Regression"}, {"paperId": "12699bb5663fb44e0525c3b489ea717a98cac6af", "title": "An IoT Monitoring System Designed for Hydroponics Plant Cultivation"}, {"paperId": "f58f12affde499f02cb8fd960b4a4d7487b12050", "title": "Mineral Neutralizers as a Tool for Improving the Properties of Soil Contaminated with Copper"}, {"paperId": "d742b59f18cdb8659ae0f9c1fd06060047e9b522", "title": "Urban Agriculture 5.0: An Exploratory Approach to the Food System in a Super Smart Society"}, {"paperId": "84260c29a86198a44dedc0d71cd5aa086849dabd", "title": "A Biocentric Perspective on HCI Design Research Involving Plants"}, {"paperId": "52ff926a05135a2fab4f5fd4c79a513e2ab48193", "title": "The Pharmacological Activities of Crocus sativus L.: A Review Based on the Mechanisms and Therapeutic Opportunities of its Phytoconstituents"}, {"paperId": "aaf3e7135d32ff5e30f4da8d6891c086cc58893d", "title": "Field trial demonstrating phytoremediation of the military explosive RDX by XplA/XplB-expressing switchgrass"}, {"paperId": "f81d368da26e0e0373c8ada6138330553b92c594", "title": "A global horizon scan of the future impacts of robotics and autonomous systems on urban ecosystems"}, {"paperId": "cf7efbe10b14c4ad7270bd5178c7d40ddfc8d685", "title": "Enhancing ecosystem services at urban brownfield sites – what value does contaminated soil have in the built environment?"}, {"paperId": "8ae3a1b896dfb85f490635600c2663112c78744e", "title": "Optimization of microbial assisted phytoremediation of soils contaminated with pesticides"}, {"paperId": "399a30fec34049a0548a4787c968e15b71e0ca22", "title": "The IoT as a Key in the Sensitive Balance between Development Needs and Sustainable Conservation of Cultural Resources in Italian Heritage Cities"}, {"paperId": "fe3a5a389424159e3c3a0177126fe8fce5767cfd", "title": "SHORT SUPPLY CHAIN OF WASTE FLOWS: DESIGNING LOCAL NETWORKS FOR LANDSCAPE REGENERATION"}, {"paperId": "80a256c9a0e1070ea9dd684c42e3058e7c72fe71", "title": "Security Analysis of IoT Devices by Using Mobile Computing: A Systematic Literature Review"}, {"paperId": "ef7a6fdfbb270db564b9e9b97431f4cb8bba39e1", "title": "Mapping Urbanization as an Anthropedogenetic Process: A Section through the Times of Urban Soils"}, {"paperId": "e91930a80e3b0a4559a2294d09e08a90f899ed1a", "title": "ANTITUMOR EFFECTS OF VANILLIN BASED CHALCONE ANALOGUES IN VITRO"}, {"paperId": "3c67cc5178b876b4e14766c0264edb0a3166a935", "title": "Interactive Cultivation System for the Future IoT-Based Agriculture"}, {"paperId": "172efd62dd1f1cc8852321abe4ca52b34a82c2d9", "title": "Right on target: using plants and microbes to remediate explosives"}, {"paperId": "f554420b3103086bf322bee40d656dc72fcce199", "title": "Phytoremediation of heavy metals: mechanisms, methods and enhancements"}, {"paperId": "4ebf9a957bf517a5ad9679ab151fa95ae402c6a8", "title": "IoT-Based Smart Gardening System Using the Cloud"}, {"paperId": "70a29126360a12db07b0634f773bcd570d337f63", "title": "Quality assessment and evaluation of Oroxylum indicum through HPLC fingerprint and QAMS for important flavonoid components"}, {"paperId": "7f1a1edfafefd351acf43c7e1922229df8bd7783", "title": "Agrotechnology: Analysis of the Services Offered by Mobile Applications for the Agronomic Control of Orchards"}, {"paperId": "f12adfc33822af3d58bc10aa4628294938c7572a", "title": "GC-MS analysis, antimicrobial and insecticidal activity of the leaves of Ipomoea eriocarpa"}, {"paperId": "0d35cbeccfec7f1786e9ce1adfefa3849d5bd3f6", "title": "Chiral Analysis Control of Three Nonsteroidal Anti-inflammatory Drugs by HPLC Methods"}, {"paperId": "728fe9ab86389e22d9dab180ca53c769d9d8f81d", "title": "Indoor Living Wall : educational tool for improving eco-health awareness in public school"}]}
