{"paperId": "d5cfce4e43773764b2af8681c14510c44342debc", "publicationVenue": null, "title": "Descriptions of Spatial Operations - Recent Approaches and Community Feedback", "abstract": "Progress in the technical provision of spatial operations as loosely-coupled interoperable web services requires a corresponding development of standardisation in their description. Operation discovery, usage and interpretation of results require more information on what a spatial operation does than just their input and output interface specifications. Geooperators and WPS profiles have been proposed for addressing operation descriptions for different operational perspectives. Geooperators have been developed mostly for supporting operation discovery through defining alternative perspectives such as a geodata, legacy GIS, formal or technical perspective. These act as filters in the discovery process. WPS profiles provide a hierarchical approach to define the concept underlying an operation and, in more specific profiles, the syntactic interface of the operation. Both approaches require community engagement for reaching an agreed set of documented operations. We report on a discussion of these approaches and the larger framework of a geoprocessing community platform from a workshop held at the AGILE International Conference on Geographic Information Science in Lisbon in 2015. At the workshop two presentations provided insights in different contexts of use of online geoprocessing. After detailed introductions to the two operation descriptions approaches, two breakout sessions were held. In the breakout sessions operation descriptions and technical developments in the field were discussed. This article summarizes the discussion that took place at the workshop with the intention to involve the extended community in the discourse on operation descriptions.", "venue": "Int. J. Spatial Data Infrastructures Res.", "year": 2015, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2015-08-18", "journal": {"name": "Int. J. Spatial Data Infrastructures Res.", "volume": "10"}, "authors": [{"authorId": "35053302", "name": "B. Hofer"}, {"authorId": "32945560", "name": "Johannes Brauner"}, {"authorId": "38435176", "name": "M. Jackson"}, {"authorId": "2324790", "name": "C. Granell"}, {"authorId": "4407584", "name": "A. Rodrigues"}, {"authorId": "2587120", "name": "Daniel Nüst"}, {"authorId": "2072130689", "name": "S. Wiemann"}], "citations": [{"paperId": "f368970ce5ecf4b6eec1bdaf8b12268b1212cbaf", "title": "Formalizing Parameter Constraints to Support Intelligent Geoprocessing: A SHACL-Based Method"}, {"paperId": "b227d9a9b9c23133b8209e2337194475e9513485", "title": "A Task-Oriented Knowledge Base for Geospatial Problem-Solving"}, {"paperId": "bf49375c432915225ba2cb22b95215fc1d6abe1c", "title": "Towards a knowledge base to support geoprocessing workflow development"}, {"paperId": "c3aa503a6085668679ca2359962ae39357e8b33f", "title": "Coupling Knowledge with GIS Operations: The Benefits of Extended Operation Descriptions"}]}
