{"paperId": "d5d3b9e88fc156e2ad9f89b33a02768359d36238", "publicationVenue": {"id": "2bff3ecd-cb0d-467a-bdff-036c3e4b3e2d", "name": "Water", "type": "journal", "issn": "2073-4441", "alternate_issns": ["1462-897X", "0310-0367"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-160269", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-160269", "http://www.mdpi.com/journal/water/about/", "https://www.mdpi.com/journal/water"]}, "title": "Riverside Landslide Susceptibility Overview: Leveraging Artificial Neural Networks and Machine Learning in Accordance with the United Nations (UN) Sustainable Development Goals", "abstract": "Riverside landslides present a significant geohazard globally, posing threats to infrastructure and human lives. In line with the United Nations’ Sustainable Development Goals (SDGs), which aim to address global challenges, professionals in the field have developed diverse methodologies to analyze, assess, and predict the occurrence of landslides, including quantitative, qualitative, and semi-quantitative approaches. With the advent of computer programs, quantitative techniques have gained prominence, with computational intelligence and knowledge-based methods like artificial neural networks (ANNs) achieving remarkable success in landslide susceptibility assessments. This article offers a comprehensive review of the literature concerning the utilization of ANNs for landslide susceptibility assessment, focusing specifically on riverside areas, in alignment with the SDGs. Through a systematic search and analysis of various references, it has become evident that ANNs have emerged as the preferred method for these assessments, surpassing traditional approaches. The application of ANNs aligns with the SDGs, particularly Goal 11: Sustainable Cities and Communities, which emphasizes the importance of inclusive, safe, resilient, and sustainable urban environments. By effectively assessing riverside landslide susceptibility using ANNs, communities can better manage risks and enhance the resilience of cities and communities to geohazards. While the number of ANN-based studies in landslide susceptibility modeling has grown in recent years, the overarching objective remains consistent: researchers strive to develop more accurate and detailed procedures. By leveraging the power of ANNs and incorporating relevant SDGs, this survey focuses on the most commonly employed neural network methods for riverside landslide susceptibility mapping, contributing to the overall SDG agenda of promoting sustainable development, resilience, and disaster risk reduction. Through the integration of ANNs in riverside landslide susceptibility assessments, in line with the SDGs, this review aims to advance our knowledge and understanding of this field. By providing insights into the effectiveness of ANNs and their alignment with the SDGs, this research contributes to the development of improved risk management strategies, sustainable urban planning, and resilient communities in the face of riverside landslides.", "venue": "Water", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-07-27", "journal": {"name": "Water"}, "authors": [{"authorId": "71108866", "name": "Y. A. Nanehkaran"}, {"authorId": "2207092646", "name": "Biyun Chen"}, {"authorId": "2191480877", "name": "Ahmed Cemiloglu"}, {"authorId": "152425934", "name": "Junde Chen"}, {"authorId": "32155690", "name": "S. Anwar"}, {"authorId": "30647644", "name": "Mohammad Azarafza"}, {"authorId": "2779558", "name": "Reza Derakhshani"}], "citations": [{"paperId": "35a63d1370f7c1645899c095f03c18076e67e4a4", "title": "The landslide traces inventory in the transition zone between the Qinghai-Tibet Plateau and the Loess Plateau: a case study of Jianzha County, China"}, {"paperId": "641eadadc0ebd842ace1ce7017454da6a5c2aa97", "title": "Comparative analysis of the TabNet algorithm and traditional machine learning algorithms for landslide susceptibility assessment in the Wanzhou Region of China"}, {"paperId": "fb28273c10461cba150e7c13cb9d89ec39f05168", "title": "Comparative Analysis of Slope Stability for Kalimpong Region under Dynamic Loading Using Limit Equilibrium Method and Machine Benchmark Learning Classifiers"}, {"paperId": "bc6195ed3adf659ab29d623c84bcdb05578c0cea", "title": "Integrating response surface methodology and machine learning for analyzing the unconventional machining properties of hybrid fiber‐reinforced composites"}, {"paperId": "d452052713777a49ba91f9863598a7d8e5511491", "title": "Application of the principal component analysis–cloud model in the assessment of the seismic stability of slopes"}, {"paperId": "ac11e4ae57974ac53af326536205dba97fd0b235", "title": "Utilizing Hybrid Machine Learning and Soft Computing Techniques for Landslide Susceptibility Mapping in a Drainage Basin"}, {"paperId": "caf3d5f270b05b49d04ebd6f105f1461c1f262b8", "title": "Landslide susceptibility mapping using the uncertain and parameter free density-based clustering (UPFDBCAN) algorithm"}, {"paperId": "e8b9f94a605b6f250183ca2e322615b2594b9743", "title": "An integrated approach of machine learning and remote sensing for evaluating landslide hazards and risk hotspots, NW Himalaya"}, {"paperId": "e962a0079272e92539ad3f7a5cf6c621b73b9f16", "title": "Groundwater vulnerability assessment in central Iran: Integration of GIS-based DRASTIC model and a machine learning approach"}, {"paperId": "dc9bd6a9713f0b3eaaf42a0a230c6f819daf61a0", "title": "Bank Soundness Level Prediction: ANFIS vs Deep Learning"}]}
