{"paperId": "d5e0f8dca883c9db20da95180e4b094657f441a6", "publicationVenue": {"id": "ae55e588-5956-4964-8449-a3faacf0e1a7", "name": "Aslib Journal of Information Management", "type": "journal", "alternate_names": ["AJIM", "Aslib J Inf Manag"], "issn": "2050-3806", "alternate_issns": ["2050-3814"], "url": "https://www.emerald.com/insight/publication/issn/2050-3806", "alternate_urls": ["http://www.emeraldinsight.com/loi/ajim"]}, "title": "A meta-analysis of online travel booking services adoption: the moderating effects of national or regional economic development level and culture differences", "abstract": "PurposeThis study aims to provide a systematic review and meta-analysis to explore the strength of the path relationship in the proposed model for online travel booking service adoption. It also explores the moderating effect of national or regional economic development levels and cultural differences.Design/methodology/approachA meta-analysis was conducted on the factors correlated with users' intention to adopt online travel booking services (OTBS) and the moderating effects of economic development levels and culture based on 42 empirical studies.FindingsPerceived usefulness, perceived ease of use, attitude and perceived behavioral control have a significant positive impact on adoption intention. By contrast, subjective norms have a significantly negative impact on adoption intention. Furthermore, the economic development level of a country or region significantly moderates the relationships between perceived usefulness and perceived behavior control, attitude and perceived behavior control, and subjective norms and adoption intention. At the same time, national or regional cultural differences significantly moderate the relationships between attitudes and adoption intention, perceived usefulness and perceived behavior control, and subjective norms and adoption intention.Originality/valueThis study was conducted to obtain a unified conclusion regarding the research field of online travel booking service adoption. Its content was original. The conclusion provides theoretical references for follow-up research and the development of targeted marketing programs for online travel-booking service providers.", "venue": "Aslib Journal of Information Management", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-11-24", "journal": {"name": "Aslib J. Inf. Manag.", "pages": "1209-1234", "volume": "75"}, "authors": [{"authorId": "2118910752", "name": "Tiantian Li"}, {"authorId": "15044044", "name": "Zhangxiang Zhu"}], "citations": [{"paperId": "1a66c548d908fb7d4ee64e84d3c126f2721b00b7", "title": "The Influence of Attitude and Perceived Risk to Optimize Intention to Adopt Based on Theory of Planned Behavior in Generation Z"}, {"paperId": "9b1c893743f2fda01d9bd81a0312ba41ba690399", "title": "Estimating travellers’ value when purchasing auxiliary services in the airline industry based on the RFM model"}, {"paperId": "80f60a4362c0515e1ed63537f3a2653418630116", "title": "Redesigning TRA concept to assess millennials’ intention to use public transportation services in Indonesia"}]}
