{"paperId": "d5f4ab23a6f25da2403991afd0bc3ef884eadc88", "publicationVenue": {"id": "7dc964d5-49e6-4c37-b1c4-a7f0de1fa425", "name": "International Conference on Web and Social Media", "type": "conference", "alternate_names": ["Int Conf Weblogs Soc Media", "International Conference on Weblogs and Social Media", "Int Conf Web Soc Media", "ICWSM"], "url": "http://www.aaai.org/Library/ICWSM/icwsm-library.php"}, "title": "Towards Using Word Embedding Vector Space for Better Cohort Analysis", "abstract": "On websites like Reddit, users join communities where they discuss specific topics which cluster them into possible cohorts. The authors within these cohorts have the opportunity to post more openly under the blanket of anonymity, and such openness provides a more accurate signal on the real issues individuals are facing. Some communities contain discussions about mental health struggles such as depression and suicidal ideation. To better understand and analyse these individuals, we propose to exploit properties of word embeddings that group related concepts close to each other in the embeddings space. For the posts from each topically situated sub-community, we build a word embeddings model and use handcrafted lexicons to identify emotions, values and psycholinguistically relevant concepts. We then extract insights into ways users perceive these concepts by measuring distances between them and references made by users either to themselves, others or other things around them. We show how our proposed approach can extract meaningful signals that go beyond the kinds of analyses performed at the individual word level.", "venue": "International Conference on Web and Social Media", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-05-26", "journal": {"pages": "919-923"}, "authors": [{"authorId": "2053668505", "name": "Mohamed Bahgat"}, {"authorId": "48408604", "name": "Steven R. Wilson"}, {"authorId": "1745226", "name": "Walid Magdy"}], "citations": [{"paperId": "8decf68648a753e5ce2e3c94bc1a8c9735bd94e1", "title": "MoralBERT: Detecting Moral Values in Social Discourse"}, {"paperId": "4540853650bdaff605d6e82f23d80d877adeb836", "title": "Value Preferences Estimation and Disambiguation in Hybrid Participatory Systems"}, {"paperId": "b6777dbbb9ac647c26af1bd1bcb26fe119efd1da", "title": "Morality is Non-Binary: Building a Pluralist Moral Sentence Embedding Space using Contrastive Learning"}, {"paperId": "710447c03d8552899d4b979350dbd3c2daf2732c", "title": "Identifying suicidal emotions on social media through transformer-based deep learning"}, {"paperId": "fed88738d21df461a8fd43b0673524ba49880e9f", "title": "Characterizing Social Movement Narratives in Online Communities: The 2021 Cuban Protests on Reddit"}, {"paperId": "7f5f9653f5888838a04446b38614e221d504fb61", "title": "Negative emotions detection on online mental-health related patients texts using the deep learning with MHA-BCNN model"}, {"paperId": "b6c704bd30c3885288ec9ef07726b8a9224494f0", "title": "American Politicians Diverge Systematically, Indian Politicians do so Chaotically: Text Embeddings as a Window into Party Polarization"}, {"paperId": "0a21f45c4e657a46dfc5add4088b5fa561755915", "title": "Depression Detection with Multi-Modalities Using a Hybrid Deep Learning Model on Social Media"}, {"paperId": "3677ea3c467d7954df26a40772f7c9716bb19fe1", "title": "What does a Text Classifier Learn about Morality? An Explainable Method for Cross-Domain Comparison of Moral Rhetoric"}]}
