{"paperId": "d605efc91e961c9cbad524ed9d7b3438e1fdde7c", "publicationVenue": null, "title": "CWLProv: Interoperable Retrospective Provenance Capture and Computational Analysis Sharing", "abstract": "Background : The automation of data analysis in the form of scientific workflows has become a widely adopted practice in many fields of research. Computationally driven data-intensive experiments using workflows enable Automation, Scaling, Adaption and Provenance support (ASAP). However, there are still several challenges associated with the effective sharing, publication, understandability and reproducibility of such workflows due to the incomplete capture of provenance and lack of interoperability between different technical (software) platforms. Results : Based on best practice recommendations identified from literature on workflow sharing and publishing, we define four hierarchical levels of provenance that collectively result in comprehensive and fully re-executable workflows when used with domain-specific information. To realise these levels, we present CWLProv , a standard-based format to represent any workflow-based computational analysis to produce workflow output artefacts that satisfy the various levels of provenance. We utilise open source community-driven standards; interoperable workflow definitions in Common Workflow Language (CWL), structured provenance representation using the W3C PROV model, and resource aggregation and sharing as workflow-centric Research Objects (RO) generated along with the final outputs of a given workflow enactment. We illustrate this approach through a practical demonstration of CWLProv applied to real-life genomic workflows developed by independent groups. Conclusions : Our approach to workflow sharing and publication mitigates workflow decay . The underlying principles of the standards utilised by CWLProv enable semantically-rich and executable Research Objects that capture computational workflows with retrospective provenance such that any platform supporting CWL will be able to understand the analysis, re-use the methods for partial re-runs, or reproduce the analysis to validate the published findings.", "venue": "", "year": 2018, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "21807894", "name": "Farah Zaib Khan"}, {"authorId": "1399487720", "name": "S. Soiland-Reyes"}, {"authorId": "1715097", "name": "R. Sinnott"}, {"authorId": "2407989", "name": "A. Lonie"}, {"authorId": "46555127", "name": "C. Goble"}, {"authorId": "144361904", "name": "M. Crusoe"}], "citations": [{"paperId": "d0ee9b1981ebf6cae14c79549e10980da9a977cf", "title": "Accumulating computational resource usage of genomic data analysis workflow to optimize cloud computing instance selection"}]}
