{"paperId": "d60d075d678f9d03bc54d424a00b1bb422df9a4d", "publicationVenue": {"id": "bb803f8e-3f8e-4fd1-8192-391b7d4de1f1", "name": "IEEE robotics & automation magazine", "type": "journal", "alternate_names": ["IEEE robot  autom mag", "IEEE Robotics & Automation Magazine", "IEEE Robot  Autom Mag"], "issn": "1070-9932", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=100"}, "title": "Development of Fault Detection Systems: The Hadoop Ecosystem Implementation", "abstract": "Semiconductor manufacturing relies on a long and complex production line for wafer fabrication. In a modern semiconductor fabrication plant (fab), a wafer manufacturing line is composed of more than 1,000 manufacturing tools and an overhead hoist system for delivering wafer lots among the tools. Novel technologies, such as Internet of Things (IoT) and software engineering technologies, are adopted in semiconductor manufacturing such that large amounts of data can be collected from manufacturing tools. Also, these tools and the overhead hoist system should cooperate well with each other. Due to the data-processing capacity limitation in a current fault detection and classification (FDC) system, the diagnosis efficiency is limited such that some undesired events cannot be detected in time, leading to significant economic loss. With the booming development of big data technology, this work conducts a study on a new FDC framework based on a Hadoop ecosystem to deal with the data-processing limitation and improve diagnosis efficiency. Also, a migration path is presented such that the current FDC system can be smoothly migrated to a Hadoop ecosystem-based one without shutting down a wafer fabrication line. Experimental results show that the proposed FDC framework can run safely and stably.", "venue": "IEEE robotics & automation magazine", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-01", "journal": {"name": "IEEE Robotics & Automation Magazine", "pages": "22-33", "volume": "30"}, "authors": [{"authorId": "2215775831", "name": "HuiChu Fu"}, {"authorId": "2151691961", "name": "Yan Qiao"}, {"authorId": "46987955", "name": "Liping Bai"}, {"authorId": "145044487", "name": "N. Wu"}, {"authorId": "2156045906", "name": "Bin Liu"}, {"authorId": "2215799863", "name": "Yunfang He"}], "citations": []}
