{"paperId": "d61991e932855f49175ad1735320f10e9b4ca285", "publicationVenue": {"id": "011e0c39-7f47-401e-98d2-ee08fdf206a3", "name": "Library hi tech", "type": "journal", "alternate_names": ["Libr Hi Tech", "Library Hi Tech", "Libr hi tech"], "issn": "0737-8831", "url": "https://www.emerald.com/insight/publication/issn/0737-8831"}, "title": "Information integration in libraries", "abstract": "This paper investigates the latest achievements of studies on industrial information integration engineering (IIIE).,This paper extends the research by Chen (2016) by reviewing studies from 2016 to 2019 in IEEE Xplore and Web of Science. Altogether, 970 papers related to IIIE are grouped into 27 research categories and reviewed.,The results obtained in this study indicate that the number of research studies on IIIE rose drastically in the past three years compared with the findings in Chen (2016). Particularly, energy, engineering, industrial control, information and communications technologies, instrumentation, manufacturing and transportation are the hot topics. This change proves that the Internet of things (IoT) and IIIE have integrated closely by providing more applications, such as industrial Internet of things (IIoT), cyber-physical system (CPS), smart grids and smart manufacturing. This change also proves the research direction of IIIE identified by Chen (2016).,The results present up-to-date development of IIIE and provide directions for future research on IIIE. The review identifies that energy, engineering, industrial control, information and communications technologies, instrumentation, manufacturing and transportation are the main fields that most of the reviewed papers focus on. Applications that integrate IoT and IIIE, including IIoT, CPS, smart grids and smart manufacturing, are attracting scholars' and practitioners' attention. Some new technologies, such as 5G and blockchain, have the potential to be integrated with IoT and IIIE.", "venue": "Library hi tech", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2020-03-19", "journal": {"name": "Libr. Hi Tech", "pages": "210-219", "volume": "38"}, "authors": [{"authorId": "2115840630", "name": "Yong Chen"}], "citations": [{"paperId": "b448195755a50ea652e72ee13d229d3563b627bf", "title": "Effects of blockchain technology (BT) on the university librarians and libraries: a systematic literature review (SLR)"}, {"paperId": "d55220a6443a874672863a9029c6131fec81ed9b", "title": "Hong Kong academic librarians' attitudes toward robotic process automation"}, {"paperId": "0220fc4bef9d61b87e90f2296eed1517e2cbec49", "title": "Financial Innovation, Sustainable Economic Growth, and Credit Risk: A Case of the ASEAN Banking Sector"}, {"paperId": "f395a461910ae05795a7fee96f302696824d6a6c", "title": "Bibliographic and Text Analysis of Research on Implementation of Bibliographic and Text Analysis of Research on Implementation of the Internet of Things to Support Education the Internet of Things to Support Education"}]}
