{"paperId": "d61d22ab5d636054d258b907d1f6df70823af282", "publicationVenue": {"id": "5e8451ba-982f-421b-88c1-877731808b7b", "name": "European Conference on Electrical Engineering and Computer Science", "type": "conference", "alternate_names": ["IEEE Students Conference on Electrical, Electronics and Computer Science", "IEEE Stud Conf Electr Electron Comput Sci", "Eur Conf Electr Eng Comput Sci", "EECS"]}, "title": "Unsupervised Anomaly Isolation for Condition Monitoring Systems", "abstract": "This paper deals with the problem of modelling and monitoring the fault-free states of an industrial process without complete knowledge about the entire machine components. The aim thereby is to automatically detect the deviations in performance as fault symptoms. For that type of data-based modelling, the algorithms of clustering are selected with an emphasis on the computational load and application complexity. Kohonen neural networks (self-organizing maps) are found suitable for the task due to the ability to efficiently operate on high dimensional data and because of their robustness against uncertainties. They reveal drawbacks from the perspective of identifying the deviating variable in the input space. A novel structure is designed to solve this dilemma by combining multi one-dimensional domains and their statistical relationships, where Kohonen and Bayesian algorithms would be directly applicable. The structure is introduced and applied to simulate the human supervisors in the way of learning normal operation and hence, attempts to automatically identify the deviating variable in a high amount of data. An example application is proposed for detecting the wear degradation fault in a real electrohydraulic drive that widely used in many industrial machines. The algorithm can be realized locally or integrated remotely in cloud architectures.", "venue": "European Conference on Electrical Engineering and Computer Science", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2018-12-01", "journal": {"name": "2018 2nd European Conference on Electrical Engineering and Computer Science (EECS)", "pages": "491-496"}, "authors": [{"authorId": "144773965", "name": "E. Ali"}, {"authorId": "145683015", "name": "J. Weber"}], "citations": []}
