{"paperId": "d622d139ab7f28104418b7999dbefcc95b39fb9f", "publicationVenue": {"id": "4b1a00db-a8f5-4580-aabd-4767ceee8041", "name": "International Journal of Qualitative Studies in Education", "type": "journal", "alternate_names": ["Int J Qual Stud Educ"], "issn": "0951-8398", "url": "http://www.tandfonline.com/loi/tqse20", "alternate_urls": ["http://www.tandfonline.com/toc/tqse20/current"]}, "title": "Big data: and the micropolitics of entanglement in the Earth’s becoming", "abstract": "Abstract This paper addresses the entanglements of the earth’s becoming in a multi site cross hemisphere study of the infinite moments of young children’s world making, recorded in multimodal videos, still images, and children’s productions. The postqualitative project was informed by new materialist and posthuman theorising. The researchers conducted their research at seven different early learning centres in NSW, Queensland, Victoria, and Finland. At the end of the project the researchers came together to make sense of the data across all sites and realised that their postqualitative data was BIG and that their ‘little big data’ was generated in the context of the increasing impact of ‘big Big Data 1 .’ We discuss our approaches to posthuman and new materialist big data in order to create a conversation between the two and to highlight the alternative methodological processes we developed to make sense of large bodies of postqualitative data.", "venue": "International Journal of Qualitative Studies in Education", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2020-04-23", "journal": {"name": "International Journal of Qualitative Studies in Education", "pages": "277 - 294", "volume": "34"}, "authors": [{"authorId": "2060913350", "name": "Margaret J. Somerville"}, {"authorId": "46687252", "name": "A. Woods"}, {"authorId": "102017916", "name": "Iris Duhn"}, {"authorId": "84620383", "name": "P. Rautio"}, {"authorId": "48722764", "name": "S. Powell"}, {"authorId": "1413567418", "name": "A. McConnell-Imbriotis"}, {"authorId": "148047081", "name": "S. Gálvez"}], "citations": [{"paperId": "e8e318b71dd1f0a1ddc378ecb36fb5a203d49e8c", "title": "Becoming-with fire and rainforest: Emergent curriculum and pedagogies for planetary wellbeing"}, {"paperId": "25aaa9d0331aaecfc731fd2d633bcff229e05350", "title": "Are we there yet? Research with and for teachers and children and the possibilities of schooling in a complex world"}]}
