{"paperId": "d6299d51516a31165f05fecc1ce2bc44f9630fbe", "publicationVenue": {"id": "8947d4b1-0911-4676-86ad-f72316fcbea0", "name": "International Conference on Security, Pattern Analysis, and Cybernetics", "type": "conference", "alternate_names": ["SPAC", "Int Conf Secur Pattern Anal Cybern"]}, "title": "Research on Modeling Prediction Methods of Process Optimization for Thermoelectric Production", "abstract": "In order to process massive historical data generated by heating steam boiler in thermoelectric production and assist in optimizing production process. To solve this problem, we propose a modeling method for coal boiler production process optimization. This method has designed optimized modeling algorithm flow. The fundamental steps of this method are: data processing, discovery of correlation chain, modeling and prediction by using the flexible neural tree algorithm. Finally, the trend function of data, namely the fitting function, is obtained. Through fitting function to predict and simulate the links in the boiler production process, we can obtain the implicit regularity knowledge in the data. We can be able to adjust the main steam pressure, oxygen content, rotational speed of blower and other production parameters. Through the design algorithm and experimental analysis, the better experimental results are obtained. By applying this method to thermoelectric production, the production efficiency is improved, energy saving and emission reduction are achieved, and the safety of production is guaranteed.", "venue": "International Conference on Security, Pattern Analysis, and Cybernetics", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2018-12-01", "journal": {"name": "2018 International Conference on Security, Pattern Analysis, and Cybernetics (SPAC)", "pages": "26-32"}, "authors": [{"authorId": "30083671", "name": "Guodong Mou"}, {"authorId": "2108249859", "name": "Guochang Li"}, {"authorId": "40073458", "name": "Tao Du"}], "citations": []}
