{"paperId": "d6537b299b7a32f8cca588714025df4feabeb6d4", "publicationVenue": {"id": "764e3630-ddac-4c21-af4b-9d32ffef082e", "name": "IEEE International Conference on Data Engineering", "type": "conference", "alternate_names": ["ICDE", "Int Conf Data Eng", "IEEE Int Conf Data Eng", "International Conference on Data Engineering"], "url": "http://www.wikicfp.com/cfp/program?id=1331"}, "title": "FastSGG: Efficient Social Graph Generation Using a Degree Distribution Generation Model", "abstract": "With the popularity of social networks, large-scale social graphs are necessary to evaluate the algorithms for various social network analysis tasks, especially in the era of big data. An efficient and configurable social graph generator has become more important than ever before because it is difficult to obtain billion-scale real-world social graphs for various scenarios.In this paper, we present an efficient and widely-applicable social graph generator called FastSGG. FastSGG generates social graphs according to a user-defined configuration depicting the features of the target social graph, which is a flexible way to generate graphs in a variety of applications. The generation method consists of two main steps: the determination of out-degree for a source vertex and the determination of a target vertex to construct an edge. In order to accelerate the graph generation process, a degree distribution generation (D2G) model is proposed. The D2G model is a universal model for generating graphs following different degree distributions as long as the probability density functions or probability mass functions are given. The extensive experimental results demonstrate that FastSGG can generate high-quality social graphs with small world properties, power-law degree distributions, and community structures. Moreover, FastSGG generates graphs at least four times faster than the state-of-the-art graph generators. In addition, the peak memory usage of FastSGG is less than one seventh of that of the state-of-the-art method.", "venue": "IEEE International Conference on Data Engineering", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-04-01", "journal": {"name": "2021 IEEE 37th International Conference on Data Engineering (ICDE)", "pages": "564-575"}, "authors": [{"authorId": "121900345", "name": "Chaokun Wang"}, {"authorId": "2112324478", "name": "Binbin Wang"}, {"authorId": "49822577", "name": "Bingyan Huang"}, {"authorId": "2225865", "name": "Shaoxu Song"}, {"authorId": "2116100143", "name": "Zai Li"}], "citations": [{"paperId": "203d0a9ddcddf07a2c94843f2f32e3e7a7a47eec", "title": "CDGraph: Dual Conditional Social Graph Synthesizing via Diffusion Model"}, {"paperId": "610f0a91b476e3edfcf49523b6789633022ac5a5", "title": "On Performance Discrepancies Across Local Homophily Levels in Graph Neural Networks"}, {"paperId": "b3ae9804088c185a1f57044be8b38d6846e21352", "title": "Learning Adaptive Node Embeddings Across Graphs"}, {"paperId": "8fed1e5ab5fc485d2def1ef8e81c33e11ccd78bb", "title": "Deep multi-agent fusion Q-Network for graph generation"}, {"paperId": "32f730bad80d35b0f8e3b72e5840fd8d26609db4", "title": "A Framework for Large Scale Synthetic Graph Dataset Generation"}, {"paperId": "60824f4ba36f3c0dc812b335188aa5c27bf454bd", "title": "Staged query graph generation based on answer type for question answering over knowledge base"}, {"paperId": "1e61d6edf9a0bf58e95dcb5cce69fa5b6281afe2", "title": "A weakly-supervised graph-based joint sentiment topic model for multi-topic sentiment analysis"}, {"paperId": "66bf10f0ebaefcfba47775c3f6e0995625ea110b", "title": "Beyond Real-world Benchmark Datasets: An Empirical Study of Node Classification with GNNs"}, {"paperId": "b10152ac7a4ffa0cc34f3c26d8237d17f913b8b2", "title": "HybridGNN: Learning Hybrid Representation for Recommendation in Multiplex Heterogeneous Networks"}, {"paperId": "c0ad3d147cc61626ce08af519f98c0c527ce394b", "title": "FastSNG: The Fastest Social Network Dataset Generator"}]}
