{"paperId": "d65708c6bd7e9848f22d10551da1928e77a59b6c", "publicationVenue": {"id": "596979b9-69c7-4a3a-ac4d-c70580b8fd80", "name": "International Conference on Artificial Intelligence and Pattern Recognition", "type": "conference", "alternate_names": ["Appl Imag Pattern Recognit Workshop", "Int Conf Artif Intell Pattern Recognit", "AIPR", "Applied Imagery Pattern Recognition Workshop", "Artificial Intelligence and Pattern Recognition", "Artif Intell Pattern Recognit"], "url": "http://www.aipr-workshop.org/"}, "title": "IoT Anomaly Detection Using a Multitude of Machine Learning Algorithms", "abstract": "The security of IoT (Internet of Things) systems is crucial yet challenging. Anomaly detection can help assess and improve the security of these devices and systems. The detection of anomalous traffic can be performed with the use of machine learning algorithms. Gradient Boosting is a Machine Learning (ML) technique that handles both regression and classification problems and uses decision tree algorithms to produce a prediction model. eXtreme Gradient Boosting (XGBoost) is a unique implementation of Gradient Boosting that has shown very good performance and outcomes in various problems. In this paper, XGBoost’s classification abilities are examined when applied to the adopted IoT-23 dataset to see how well anomalies can be identified and what type of anomaly exists in IoT systems. Moreover, the results obtained from XGBoost are compared to other ML methods including Support Vector Machines (SVM) and Deep Convolutional Neural Networks (DCNN). The classification results were assessed based on accuracy, precision, recall, and various other performance metrics. Our experimental results showed that XGBoost outperformed both SVM and DCNN achieving accuracies up to 99.98%. In addition, XGBoost proved to be the most efficient method with respect to execution time.", "venue": "International Conference on Artificial Intelligence and Pattern Recognition", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-10-11", "journal": {"name": "2022 IEEE Applied Imagery Pattern Recognition Workshop (AIPR)", "pages": "1-7"}, "authors": [{"authorId": "2214201502", "name": "Maria Balega"}, {"authorId": "2120999", "name": "Waleed Farag"}, {"authorId": "3352857", "name": "Soundararajan Ezekiel"}, {"authorId": "2155225981", "name": "Xin-Wen Wu"}, {"authorId": "2214201516", "name": "Alicia Deak"}, {"authorId": "2214204881", "name": "Zaryn Good"}], "citations": [{"paperId": "b15615850bd65c9c4c0363ea122232e4a6770c2d", "title": "Machine Learning and Deep Learning Techniques for Internet of Things Network Anomaly Detection—Current Research Trends"}]}
