{"paperId": "d65721db1a856c11031a1b2c6745a8b8a0260295", "publicationVenue": {"id": "5c386c20-aea1-4e24-bdb6-e4f59ac12eb4", "name": "Science in progress", "type": "journal", "alternate_names": ["Science Progress", "Sci Prog", "Sci prog"], "issn": "0097-0611", "alternate_issns": ["0036-8504"], "url": "http://www.jstor.org/journal/scienceprogress", "alternate_urls": ["http://www.scienceprogress.org/about/"]}, "title": "Interconnection between the role of blockchain technologies, supply chain integration, and circular economy: A case of small and medium-sized enterprises in Pakistan", "abstract": "Increased industrialization has led to unprecedented resource depletion on a global scale. The current state of affairs has compelled practitioners and academics to investigate the role of sustainable technologies in greening the operations of businesses. Previous studies have attempted to examine the number of operational aspects for their role in making firms sustainable, yet the utility of blockchain technologies is in its infancy. The role of BT in enhancing integration across supply chains has been in the limelight in the recent past. At the same time, its ability to cause sustainable supply chain performance (SSCP) in sync with the circular economy (CE) and supply chain integration (SCI) has largely remained unexplored. Therefore, this study intends to examine the association between blockchain technologies (BTs) and SSCPs through integration to fill the empirical gaps. The study was pursued to investigate the moderating role of the CE on the relationship between multiple extents of SCI and SSCP. Based on dynamic capability theory (DCT), the study considered BT a dynamic resource. BTs are used to integrate and reenergize the relationships with upstream and downstream channel members in pursuit of sustainable performance outcomes. The study opted for a cross-sectional design, where data was collected through convenience sampling from 475 managers from SMEs operating across Pakistan. PLS-SEM was used to analyze the data and to generate the required empirical outcomes. Study results favored the significant association between BT and SSCP, followed by a significant mediating role of SCI dimensions and moderating role of the CE. The study's findings propagate the utility of BTs adoption for SMEs, which holds the potential for firms to achieve system-wide integration to achieve sustainable outcomes. The given empirical investigation holds valuable insights for practitioners and scholars intending to pursue research on the subject matter.", "venue": "Science in progress", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2023-07-01", "journal": {"name": "Science Progress", "volume": "106"}, "authors": [{"authorId": "145256066", "name": "Nadir Munir Hassan"}, {"authorId": "2166425628", "name": "S. Khan"}, {"authorId": "46872182", "name": "M. Ashraf"}, {"authorId": "46558247", "name": "Adnan Ahmed Sheikh"}], "citations": [{"paperId": "d76deb8b810c1aa70d6b4016b147d9141cc27bb0", "title": "The predictive robustness of organizational and technological enablers towards blockchain technology adoption and financial performance"}, {"paperId": "00b0eacf4af1353ae27c9be8a5267786d5cd123c", "title": "Corporate social responsibility—an antidote for sustainable business performance: interconnecting role of digital technologies, employee eco-behavior, and tax avoidance"}, {"paperId": "21d3683ebca3dba061971351a9ebf9a8aca52ba5", "title": "Unboxing the dilemma associated with online shopping and purchase behavior for remanufactured products: A smart strategy for waste management."}, {"paperId": "9d8e7610996414b7032f3b8dfb8f2d22ec3934c5", "title": "A SEM-ANN analysis to examine Sustainable Performance in SMEs: The Moderating Role of Transformational Leadership"}, {"paperId": "b7789cb7a23674c1e04ff660caaa0bdd3ec3b228", "title": "Implementing Circular Economy Elements in the Textile Industry: A Bibliometric Analysis"}, {"paperId": "201bf34ff5833336946186f03bde92f0df2bef2d", "title": "Collaborative Driving Mode of Sustainable Marketing and Supply Chain Management Supported by Metaverse Technology"}]}
