{"paperId": "d66d014097dfab681b071fd5678ddc8f0152b802", "publicationVenue": {"id": "80f85f47-9f79-4683-b9e0-9df43c2cc065", "name": "Measurement science and technology", "type": "journal", "alternate_names": ["Meas sci technol", "Meas Sci Technol", "Measurement Science and Technology"], "issn": "0957-0233", "url": "http://www.iop.org/EJ/journal/-page=scope/0957-0233/1", "alternate_urls": ["http://iopscience.org/mst", "https://iopscience.iop.org/0957-0233"]}, "title": "Bearing fault diagnosis based on partial domain adaptation adversarial network", "abstract": "The existing fault diagnosis algorithm based on domain adaptation solves the problem of degradation of model diagnosis performance due to different data distributions under variable working conditions and cross-machine conditions, and its excellent fault diagnosis performance relies on the assumption that the fault category space of source and target domains is the same; however, it is difficult to meet the above assumption in practical application scenarios. For this reason, focusing on the matter of imbalance within the fault category, this paper proposes a novel unsupervised partial domain adaptational fault diagnosis method—a partial domain adaptation adversarial network (PDAAN). On the one hand, it uses the source domain fault samples to expand the target domain and promotes the effective alignment of the fault feature area of the source domain and the target domain, in order for the model to effectively extract domain invariant features; on the other hand, class-level weights and weighted entropy weights are introduced into the loss function to suppress the uncertainty within the transfer process and avoid negative transfer of the model. Finally, experiments are conducted in the case of variable working conditions and cross-mechanical devices, and it is confirmed that the PDAAN model has high recognition accuracy in the case of class space asymmetry.", "venue": "Measurement science and technology", "year": 2022, "fieldsOfStudy": ["Physics"], "publicationTypes": null, "publicationDate": "2022-08-01", "journal": {"name": "Measurement Science and Technology", "volume": "33"}, "authors": [{"authorId": "2146383304", "name": "Huafeng Zhou"}, {"authorId": "9118062", "name": "Peiyuan Cheng"}, {"authorId": "9122533", "name": "Siyu Shao"}, {"authorId": "2154704094", "name": "Yuwei Zhao"}, {"authorId": "2150441327", "name": "X. Yang"}], "citations": [{"paperId": "571cb97bfd93799a56b308b97332e911dc213e38", "title": "Intelligent Fault Diagnosis for Variable Working Conditions Based on SAAFN and BICP"}, {"paperId": "975dc220b88983a2567d2a1b21c7060e3d73c671", "title": "Partial transfer learning method based on MDWCAN for rolling bearing fault diagnosis under noisy conditions"}, {"paperId": "06f34be0b06df177692ebfec8a1ffa1441f3ef8a", "title": "Partial Domain Bearing Fault Diagnosis Method Based on Weighted Bi-Classifier"}, {"paperId": "f7ea48f5f4c6a5aa3a2be5a07c26bc7d7b476a16", "title": "A New Bearing Fault Diagnosis Method via Simulation Data Driving Transfer Learning without Target Fault Data"}, {"paperId": "d5a98618072397e278a9c8e218380fda4ce842d5", "title": "Intelligent bearing fault diagnosis method based on a domain aligned clustering network"}, {"paperId": "d1bc57af9847ef9fb61ea2e3796a2e862136fc34", "title": "A Systematic Review on Imbalanced Learning Methods in Intelligent Fault Diagnosis"}]}
