{"paperId": "d678f6e538edbd6870a9eaed224869e5529d9293", "publicationVenue": {"id": "f2c78b1b-6bcc-4700-859b-af9401c02941", "name": "Buildings", "type": "journal", "issn": "0007-3725", "alternate_issns": ["2075-5309"], "url": "https://www.buildings.com/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217973", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217973", "https://www.mdpi.com/journal/buildings"]}, "title": "Key Adoption Factors for Collaborative Technologies and Barriers to Information Management in Construction Supply Chains: A System Dynamics Approach", "abstract": "Construction processes are complex and dynamic. Like its other components, the construction supply chain (CSC) involves multiple stakeholders requiring varying levels of information sharing. In addition, the intensity and diversity of information in CSCs require dexterous management. Studies reveal that information complexity can be reduced using collaborative technologies (CTs). However, the barriers to information management (IM) hinder the CTs’ adoption process and cause complexity in CSCs. This research identifies barriers to IM and factors affecting the adoption of CTs in developing countries. In order to understand and address complexity, the system dynamics (SD) approach is adopted in this study. The aim is to investigate if SD can reduce information complexity using CTs. Causal loop diagrams (CLDs) were developed to understand the relationship between the IM barriers and CT adoption factors. The SD model, when simulated, highlighted three main components, i.e., complexity, top management support, and trust and cooperation, among others, as factors affecting the adoption of CTs. Addressing these factors will reduce information complexity and result in better IM in construction projects.", "venue": "Buildings", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-06-05", "journal": {"name": "Buildings"}, "authors": [{"authorId": "2168377284", "name": "Fawad Amin"}, {"authorId": "29231933", "name": "Khurram Iqbal Ahmad Khan"}, {"authorId": "2064382638", "name": "F. Ullah"}, {"authorId": "69858834", "name": "M. Alqurashi"}, {"authorId": "90969070", "name": "Badr T. Alsulami"}], "citations": [{"paperId": "c269db97e30c810590dc221fcf3faa835192bf10", "title": "Decoding Social Sustainability in Construction Projects: Analysis of Project Dynamics and Impact"}, {"paperId": "833a08714da69c26a3619cbcbfea49b30b59dbc8", "title": "Mathematical modelling and simulation in construction supply chain management"}, {"paperId": "33bcac6d8555d350537437d91f1bf48c77ed1dc5", "title": "Evolution Game Analysis of Supply Chain Synergy Benefits of Prefabricated Building Projects"}, {"paperId": "8c513359ce16dc3310ffebecef9640e404a824f1", "title": "Hierarchic change system dynamics supply chain model: impact of demand information sharing on holding cost and downstream project completion"}, {"paperId": "a5faf278de491dac833ac5c88ca8501f0890b915", "title": "Smart Tech 4.0 in the Built Environment: Applications of Disruptive Digital Technologies in Smart Cities, Construction, and Real Estate"}, {"paperId": "36438ef070a913c9a9d4782bf8a387537e06ccae", "title": "Resilient Capabilities to Tackle Supply Chain Risks: Managing Integration Complexities in Construction Projects"}, {"paperId": "365b45331c09672c6070816b50a21fb901012d28", "title": "Circular Economy in the Construction Industry: A Step towards Sustainable Development"}, {"paperId": "d46283d389b39507c1e50c08bccdf55f99083b28", "title": "Understanding Digital Economy Dilemmas"}]}
