{"paperId": "d6a423c887347532eaa9d93be9d81ea54261408c", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Roof fall hazard detection with convolutional neural networks using transfer learning", "abstract": "Roof falls due to geological conditions are major safety hazards in mining and tunneling industries, causing lost work times, injuries, and fatalities. Several large-opening limestone mines in the Eastern and Midwestern United States have roof fall problems caused by high horizontal stresses. The typical hazard management approach for this type of roof fall hazard relies heavily on visual inspections and expert knowledge. In this study, we propose an artificial intelligence (AI) based system for the detection roof fall hazards caused by high horizontal stresses. We use images depicting hazardous and non-hazardous roof conditions to develop a convolutional neural network for autonomous detection of hazardous roof conditions. To compensate for limited input data, we utilize a transfer learning approach. In transfer learning, an already-trained network is used as a starting point for classification in a similar domain. Results confirm that this approach works well for classifying roof conditions as hazardous or safe, achieving a statistical accuracy of 86%. However, accuracy alone is not enough to ensure a reliable hazard management system. System constraints and reliability are improved when the features being used by the network are understood. Therefore, we used a deep learning interpretation technique called integrated gradients to identify the important geologic features in each image for prediction. The analysis of integrated gradients shows that the system mimics expert judgment on roof fall hazard detection. The system developed in this paper demonstrates the potential of deep learning in geological hazard management to complement human experts, and likely to become an essential part of autonomous tunneling operations in those cases where hazard identification heavily depends on expert knowledge. Also, AI-based systems reduce expert exposure to hazardous conditions. They could also reduce inter-expert variability in hazard assessment and prevent knowledge loss in the case of personnel changes and expert unavailability.", "venue": "arXiv.org", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-11-12", "journal": {"name": "ArXiv", "volume": "abs/2012.03681"}, "authors": [{"authorId": "117211919", "name": "E. Isleyen"}, {"authorId": "7675326", "name": "H. S. Düzgün"}, {"authorId": "2032218135", "name": "McKell R. Carter"}], "citations": [{"paperId": "704710ae77513ef6c0d7443db6796f8f3e69e4eb", "title": "A Monitoring and Warning System for Hazards in Coal Mines using CNN and Sensor Fusion"}, {"paperId": "10edd127a1711780de20d378e43fd51096a1b218", "title": "Surrounding rock quality evaluation and application development for highway tunnel based on engineering applicability"}]}
