{"paperId": "d6abb6f2e7a7266a4526e832e5f66efb41eebfb3", "publicationVenue": null, "title": "Detecting Compromised IoT Devices Through XGBoost", "abstract": "The evolution and rapid adoption of the Internet of Things (IoT) led to a rise in the number of attacks that target IoT environments. IoT environments are vulnerable to several attacks because many devices lack memory, processing power, and battery. Most of these vulnerabilities are relatively easy to mitigate when best practices are followed. However, even when best practices are followed, an attack to obtain a device credential and use it to generate false data is difficult to detect. Such an attack is called a replication attack and its impact can be catastrophic in crucial IoT scenarios such as smart transportation. In this sense, this paper proposes a solution to detect these attacks by analyzing abnormal network traffic through machine learning.", "venue": "IEEE transactions on intelligent transportation systems (Print)", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-01", "journal": {"name": "IEEE Transactions on Intelligent Transportation Systems", "pages": "15392-15399", "volume": "24"}, "authors": [{"authorId": "120618691", "name": "Mauro A. A. da Cruz"}, {"authorId": "1491594481", "name": "Lucas R. Abbade"}, {"authorId": "3141184", "name": "P. Lorenz"}, {"authorId": "2062053770", "name": "S. Mafra"}, {"authorId": "2152638550", "name": "Joel J. P. C. Rodrigues"}], "citations": [{"paperId": "b7e4b384c4472fe8ce11529fa69caa400e538787", "title": "Detect-IoT: A Comparative Analysis of Machine Learning Algorithms for Detecting Compromised IoT Devices"}, {"paperId": "787488a50386d6c12bffb19da07136bba0af5139", "title": "Detection of Cyber-attacks using Deep Convolution in Honeyed Framework"}, {"paperId": "746e63b89d8e8b143daa62452356a6b58fd76595", "title": "Characterization of Tight Sandstone Reservoir Pore Structure and Validity from Geophysical Logging Data by Using Deep Learning Method"}, {"paperId": "e9d778cc58ffeb952cfc115c20a278a5ca56d8f2", "title": "Ensemble learning based approach for traffic incident detection and multi-category classification"}, {"paperId": "38db2f627ec0d5b99d2b7673c66bec7e948843e0", "title": "Simultaneous Botnet Attack Detection Using Long Short Term Memory-Based Autoencoder and XGBoost Classifier"}]}
