{"paperId": "d6bdb3f913ecdc352988aafc4a736dce9b1bd876", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Knowledge Trajectories Detection and Prediction of Modern Emergency Management in China Based on Topic Mining from Massive Literature Text", "abstract": "China has witnessed dramatic advances in emergency management in the past two decades, while the knowledge trajectories and future trends of related research are still unclear. This study takes the published articles in China National Knowledge Infrastructure as a data sample and introduces text mining and machine learning methods, namely Latent Dirichlet Allocation combined with the Hidden Markov Model, to detect and predict the knowledge trajectories of Chinese modern emergency management research. We analyzed 5180 articles, equivalent to approximately 1,110,000 Chinese characters, from 2003 to 2021, and mined 35 latent research topics. By labeling the topics manually and analyzing the evolutionary hotspots, confusion and transition features, and transition direction and network of the topics, we explored the knowledge trajectories of emergency management research in China. By training the HMM model, we predicted the research trends in the next five years. The main conclusions are: a mapping relationship exists between the hotspots of the published articles and the main events of emergency management in China; most emergency management research topics could confuse and transfer with others in the evolution process, and seven significant paths exist in the transition network. The research topics in the following years will be more detailed and concerned with the intellectual needs of modernization.", "venue": "Sustainability", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-12-13", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "2152982732", "name": "Feng Wu"}, {"authorId": "2119310538", "name": "Yue Tang"}, {"authorId": "9400819", "name": "Chaoran Lin"}, {"authorId": "2168804425", "name": "Yanwei Zhang"}, {"authorId": "2168565924", "name": "Wanqiang Xu"}], "citations": []}
