{"paperId": "d6c44eaf69d71a145b8b88dde86759fa2bd2ade2", "publicationVenue": {"id": "e16082f9-390d-423d-a448-883b5a4fa88f", "name": "Journal of Cybersecurity and Privacy", "type": "journal", "alternate_names": ["J Cybersecur Priv"], "issn": "2624-800X", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-1444919", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-1444919"]}, "title": "Cybersecurity in a Large-Scale Research Facility - One Institution's Approach", "abstract": "A cybersecurity approach for a large-scale user facility is presented—utilizing the National High Magnetic Field Laboratory (NHMFL) at Florida State University (FSU) as an example. The NHMFL provides access to the highest magnetic fields for scientific research teams from a range of disciplines. The unique challenges of cybersecurity at a widely accessible user facility are showcased, and relevant cybersecurity frameworks for the complex needs of a user facility with industrial-style equipment and hazards are discussed, along with the approach for risk identification and management, which determine cybersecurity requirements and priorities. Essential differences between information technology and research technology are identified, along with unique requirements and constraints. The need to plan for the introduction of new technology and manage legacy technologies with long usage lifecycles is identified in the context of implementing cybersecurity controls rooted in pragmatic decisions to avoid hindering research activities while enabling secure practices, which includes FAIR (findable, accessible, interoperable, and reusable) and open data management principles. The NHMFL’s approach to FAIR data management is presented. Critical success factors include obtaining resources to implement and maintain necessary security protocols, interdisciplinary and diverse skill sets, phased implementation, and shared allocation of NHMFL and FSU responsibilities.", "venue": "Journal of Cybersecurity and Privacy", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-16", "journal": {"name": "J. Cybersecur. Priv.", "pages": "191-208", "volume": "3"}, "authors": [{"authorId": "2217812272", "name": "David S. Butcher"}, {"authorId": "2217813760", "name": "Christian J. Brigham"}, {"authorId": "2217801195", "name": "James Berhalter"}, {"authorId": "2217801189", "name": "Abigail L. Centers"}, {"authorId": "88762474", "name": "W. Hunkapiller"}, {"authorId": "2061522290", "name": "T. Murphy"}, {"authorId": "37485352", "name": "E. Palm"}, {"authorId": "2217576115", "name": "Julia H. Smith"}], "citations": []}
