{"paperId": "d6c7e6c9cd5612fc3615ff8d9504b7d2ae4b5343", "publicationVenue": {"id": "38acad02-d647-4d48-be25-55a418138f2a", "name": "Transportation Research Record", "type": "journal", "alternate_names": ["Transp Res Rec"], "issn": "0361-1981", "url": "http://trb.org/news/blurb_detail.asp?id=1676"}, "title": "Spatio-Temporal Pattern of China’s Urban Network Under the Substitution Effect of High-Speed Rail on Aviation", "abstract": "High-speed rail (HSR) and aviation have played an important role in shaping urban connections and building urban networks. However, with the continuous expansion of the scale of HSR, the competition between the two has become increasingly fierce, and HSR has gradually been substituted for aviation in some regions. Therefore, based on HSR flow and airline flow data, we depicted the spatio-temporal evolution pattern of China’s urban network from 2017 to 2021 by constructing the HSR–aviation composite network, then identified the spatial scope and network form of the substitution of HSR for aviation through classifying the four types of segments, and analyzed the influencing factors of this substitution effect. The results showed that the spatial form of the HSR–aviation composite network is “spindle-shaped” and has a right-skewness distribution; the spatial scope of HSR completely or partially substituting for aviation is mainly distributed in the “diamond-shaped” space with Beijing–Shanghai–Guangzhou–Chengdu as the apex; and 0–770 km is the absolute advantage distance range of HSR. Moreover, the scale expansion of the composite network, the comparative advantages of HSR in shaping the urban network, the personal travel preference for HSR, and the distance between cities and city attributes are the main factors that make HSR a substitute for aviation.", "venue": "Transportation Research Record", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-26", "journal": {"name": "Transportation Research Record: Journal of the Transportation Research Board"}, "authors": [{"authorId": "2265725488", "name": "Xueguang Ma"}, {"authorId": "2265630453", "name": "Ce Jiang"}, {"authorId": "2276979310", "name": "Zhao Zhang"}], "citations": []}
