{"paperId": "d6d5517f9f75adff4e80b3a3c8efa56792c1c872", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Differentially Private Stream Processing at Scale", "abstract": "We design, to the best of our knowledge, the first differentially private (DP) stream aggregation processing system at scale. Our system -- Differential Privacy SQL Pipelines (DP-SQLP) -- is built using a streaming framework similar to Spark streaming, and is built on top of the Spanner database and the F1 query engine from Google. Towards designing DP-SQLP we make both algorithmic and systemic advances, namely, we (i) design a novel (user-level) DP key selection algorithm that can operate on an unbounded set of possible keys, and can scale to one billion keys that users have contributed, (ii) design a preemptive execution scheme for DP key selection that avoids enumerating all the keys at each triggering time, and (iii) use algorithmic techniques from DP continual observation to release a continual DP histogram of user contributions to different keys over the stream length. We empirically demonstrate the efficacy by obtaining at least $16\\times$ reduction in error over meaningful baselines we consider. We implemented a streaming differentially private user impressions for Google Shopping with DP-SQLP. The streaming DP algorithms are further applied to Google Trends.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-03-31", "journal": {"name": "ArXiv", "volume": "abs/2303.18086"}, "authors": [{"authorId": "2117924866", "name": "Bing Zhang"}, {"authorId": "40323903", "name": "Vadym Doroshenko"}, {"authorId": "3115341", "name": "P. Kairouz"}, {"authorId": "145268083", "name": "T. Steinke"}, {"authorId": "2623159", "name": "Abhradeep Thakurta"}, {"authorId": "2116609725", "name": "Zi-Tang Ma"}, {"authorId": "2709144", "name": "Himani Apte"}, {"authorId": "29849703", "name": "Jodi Spacek"}], "citations": [{"paperId": "a61eead8a19f0ebf6f1aed61ee55a6ec0a621814", "title": "A Unifying Privacy Analysis Framework for Unknown Domain Algorithms in Differential Privacy"}, {"paperId": "c50521a79d9080d4dca9bc62ab44937ce1ec247e", "title": "Counting Distinct Elements Under Person-Level Differential Privacy"}, {"paperId": "5f5c9114cea7e7661ecf4311045b520d34ee33f7", "title": "Differentially-private Continual Releases against Dynamic Databases"}]}
