{"paperId": "d6e4b1b18b392da79f8b90af67cb903fa0fedaec", "publicationVenue": {"id": "0ea0ecf0-d7d5-4d5f-bf9f-eeb19a652bbe", "name": "Cellular and Molecular Biology", "type": "journal", "alternate_names": ["Cell Mol Biology", "Cell mol biology incl cyto-enzymology", "Cellular and molecular biology, including cyto-enzymology"], "issn": "0145-5680", "url": "https://www.cellmolbiol.org/index.php/CMB"}, "title": "Regulatory effect of zinc finger protein A20 on rheumatoid arthritis through NLRP3/Caspase-1 signaling axis mediating pyroptosis of HFLS- RA cells.", "abstract": "As a chronic inflammatory autoimmune disease, rheumatoid arthritis (RA) causes significant destruction to joints and cartilage. So far, from RA patients, the synovial cells and subsynovial tissues reflected the positive expression of IL-18, IL-1β, Caspase-1 and NLRP3, with the synovial tissues of those patients also expressing the zinc finger protein A20 at a significantly lower level compared with osteoarthritis (OA) ones. Thus, the inhibition of the NLRP3/caspase-1 signaling pathway can effectively down-regulate the expression of IL-1β, but when NLRP3 inflammasomes are activated, they can also shear GSDMD and induce pyroptosis. These suggest that the Gasdermin family of proteins, downstream of the NLRP3 inflammasome, could be involved in pyroptosis. Previous studies have shown that A20 contributes largely as an anti-inflammatory factor in many inflammatory diseases, but it remains unclear whether zinc finger protein A20, as an inhibitor of NLRP3 inflammasomes, can play a protective role against RA by inhibiting NLRP3 inflammasome-mediated pyroptosis. Therefore, this study aimed to verify the effects of zinc finger protein A20 on NLRP3/ Caspase-1-mediated pyroptosis in rheumatoid arthritis synovial fibroblasts (HFLS-RA) cells through cell experiments and clinical bidirectional verification, aim to understand the regulatory mechanism of A20 on RA. The results of clinical trials showed that NLRP3, Caspase-1, IL-1β and IL-18 were positively scattered in RA synovial cells and subsynovial tissue. The expression level of the zinc finger protein A20 in RA synovial tissues was significantly lower than that in OA synovial tissue and was negative, while zinc finger protein A20 was strongly positive in OA synovial tissue. In addition, HFLS-RA cells with siRNA-interfering zinc finger protein A20 were constructed at the cellular level, with the results also confirming that zinc finger protein A20 can play a protective role against RA by inhibiting NLRP3 inflammasome-mediated pyroptosis. In conclusion, this study is of great significance for understanding the role of the NLRP3-caspase-1-IL-1β/ pyroptosis signaling pathway in the occurrence and development of RA. It is expected that the results will provide a theoretical basis for the immune regulation of innate immunity in the occurrence and development of RA, while providing a new therapeutic target for the clinical treatment of RA.", "venue": "Cellular and Molecular Biology", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-31", "journal": {"name": "Cellular and molecular biology", "pages": "\n          179-184\n        ", "volume": "69 8"}, "authors": [{"authorId": "2243327278", "name": "Ziqin Zhao"}, {"authorId": "2242414495", "name": "Xinlong Ma"}, {"authorId": "2242317870", "name": "Shuhui Dong"}, {"authorId": "2242402205", "name": "Haibo Yin"}, {"authorId": "2244242125", "name": "Yong Yang"}, {"authorId": "2242343008", "name": "Guangyi Xiong"}], "citations": [{"paperId": "e7ded27a012d63f1fa5a478dc1e2ad879246efa3", "title": "Network-Based In Silico Analysis of New Combinations of Modern Drug Targets with Methotrexate for Response-Based Treatment of Rheumatoid Arthritis"}]}
