{"paperId": "d6e7b64846653fcbfc6419f99418f4263576cd79", "publicationVenue": {"id": "0c1420a4-aa9b-44f9-b264-ba3ac5c37050", "name": "International Conference for High Performance Computing, Networking, Storage and Analysis", "alternate_names": ["Int Conf High Perform Comput Netw Storage Anal"], "issn": "2167-4337", "alternate_issns": ["2167-4329"], "url": "http://ieeexplore.ieee.org/xpl/conhome.jsp?punumber=1000729"}, "title": "From Correctable Memory Errors to Uncorrectable Memory Errors: What Error Bits Tell", "abstract": "Uncorrectable memory errors are one of the major failure causes in datacenters. In this paper, we present an empirical study correlating correctable errors (CEs) and uncorrectable errors (UEs) using the large-scale field data across 3 major dual in-line memory module (DIMM) manufacturers from a contemporary server farm of ByteDance. Different from the previous studies, our study is the first to comprehend the error-bit information of CEs and the DIMM part numbers. Unlike the traditional chipkill error correction code (ECC), in contemporary Intel server platforms the ECC gets weakened, not able to tolerate some error-bit patterns from a single chip. Using obtainable coarse-grained ECC knowledge, we derive a new indicator from the error-bit information: risky CE occurrence in terms of ECC guaranteed coverage. From the data, we show that the new indicator has a consistently high sensitivity and specificity in the test of future UE occurrences across DIMMs from different manufacturers. This leads us to conjecture that the weakened ECC substantially contributes to many UEs today. The new risky CE indicator is then applied in predicting the future UE occurrence based on the CE history. We empirically demonstrate how practically useful predictors are constructed in conjunction with other useful attributes such as certain micro-level fault indicators and DIMM part numbers, achieving the state-of-the-art performance.", "venue": "International Conference for High Performance Computing, Networking, Storage and Analysis", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-11-01", "journal": {"name": "SC22: International Conference for High Performance Computing, Networking, Storage and Analysis", "pages": "01-14"}, "authors": [{"authorId": "153228116", "name": "Cong Li"}, {"authorId": "2153636645", "name": "Yu Zhang"}, {"authorId": "2209760159", "name": "Jialei Wang"}, {"authorId": "2210020045", "name": "Hang Chen"}, {"authorId": "2196617916", "name": "Xian Liu"}, {"authorId": "2209791103", "name": "Tai Huang"}, {"authorId": "2209577114", "name": "Liang Peng"}, {"authorId": "2003803883", "name": "Shen Zhou"}, {"authorId": "2209580106", "name": "Lixin Wang"}, {"authorId": "2053945389", "name": "Shi-Lun Ge"}], "citations": [{"paperId": "31902f25c9759c13b13ff0246de8c51af74f9999", "title": "Unraveling codes: fast, robust, beyond-bound error correction for DRAM"}, {"paperId": "53787a15a18df3784ce3d096584d3d219790e37a", "title": "Exploring Error Bits for Memory Failure Prediction: An In-Depth Correlative Study"}, {"paperId": "544d8ed5a31b817f5beff1f55e4700f67d770c61", "title": "Predicting Future-System Reliability with a Component-Level DRAM Fault Model"}, {"paperId": "0b0893c965adbbefd119b08380a7d4038fd1cbe9", "title": "HiMFP: Hierarchical Intelligent Memory Failure Prediction for Cloud Service Reliability"}, {"paperId": "599a278734e2c3523aced12fecdf34d22d001e3a", "title": "STIM: Predicting Memory Uncorrectable Errors with Spatio-Temporal Transformer"}]}
