{"paperId": "d7138246adb9ce9bdeb9a26ff47b7a3e93e7b02d", "publicationVenue": {"id": "166fd2b5-a928-4a98-a449-3b90935cc101", "name": "IACR Cryptology ePrint Archive", "type": "journal", "alternate_names": ["IACR Cryptol eprint Arch"], "url": "http://eprint.iacr.org/"}, "title": "SoK: Applying Blockchain Technology in Industrial Internet of Things", "abstract": "—The proliferation of the Internet of Things (IoT) technology has made ubiquitous computing a reality by broadening Internet connectivity across diverse application domains, thus bridging billions of devices and human beings as well for information collection, data processing, and decision-making. In recent years, IoT technology and its applications in various industrial sectors have grown exponentially. Most existing industrial IoT (IIoT) implementations, however, are still relying on a centralized architecture, which is vulnerable to the single point of failure attack and requires a massive amount of computation at the central entity. The emerging blockchain technology is currently undergoing rapid development and has the full potential to revolutionize the IIoT platforms and applications. As a distributed and decentralized tamper-resistant ledger, blockchain maintains the consistency of data records at different locations and holds the potential to address the issues in traditional IIoT networks, such as heterogeneity, interoperability, and security. Integrating the blockchain technology into IIoT platforms requires to address several critical challenges that are inherent in IIoT and blockchain themselves, such as standardization, scalability, and interoperability. This paper provides a comprehensive review on the recent advances in architecture design and technology development towards tackling these challenges. We further provide several representative industrial use cases that can beneﬁt from the integration of blockchain technology, and discuss the recent research trends and open issues in blockchain-enabled IIoT platforms.", "venue": "IACR Cryptology ePrint Archive", "year": 2021, "fieldsOfStudy": ["Computer Science", "Engineering"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IACR Cryptol. ePrint Arch.", "pages": "776", "volume": "2021"}, "authors": [{"authorId": "92491792", "name": "Gang Wang"}], "citations": [{"paperId": "0b012131cadf269394a85206b0f56bf279956ea6", "title": "Simulation study on the security of consensus algorithms in DAG-based distributed ledger"}, {"paperId": "1df756785d44a2abf5623f03f93c02f358d8d668", "title": "A Secure and Efficient Cross-Chain Model Based on Credentials"}, {"paperId": "40a7f3d452a2fe02521844e391d437df7ca48626", "title": "Blockchain Technology in IoT and IIoT Environments"}, {"paperId": "6188d76a17acf1a77a2e5878aaca70822d21eef4", "title": "An Adaptive Blockchain-Based Decentralized Network Computing and Performance Analysis"}, {"paperId": "56e77d6357727f1e724cbcc5984a2c90c8d6851d", "title": "SoK: Essentials of BFT Consensus for Blockchains"}, {"paperId": "3f51909ab090c7861d6fa183a89e874023447714", "title": "Towards Run-Time Security Monitoring of Distributed Industrial Control Systems"}, {"paperId": "ce40ac18bacbe27af062937f5a985a5de4c34662", "title": "Blockchain assisted clustering with Intrusion Detection System for Industrial Internet of Things environment"}, {"paperId": "633359f9d516507ad7a680d2a9ccff362ecdd0f8", "title": "A survey of application research based on blockchain smart contract"}, {"paperId": "b9eaa2bfa98cafae332a9c8a8f8d9aba217e724e", "title": "InterTrust: Towards an Efficient Blockchain Interoperability Architecture with Trusted Services"}, {"paperId": "a773927f8baf77aef1e0299a8b7657316a7d96cf", "title": "Adoption of Blockchain With 5G Networks for Industrial IoT: Recent Advances, Challenges, and Potential Solutions"}, {"paperId": "43d35093ed41c17bef34c9ad5367d0e2917355eb", "title": "Internet of Things (IoT) Security With Blockchain Technology: A State-of-the-Art Review"}]}
