{"paperId": "d72d68047a75737c4b2e9099eb5a1a3cea3b42da", "publicationVenue": {"id": "682d4e62-6b9a-4d78-a606-4faee66c1ebd", "name": "International Bhurban Conference on Applied Sciences and Technology", "type": "conference", "alternate_names": ["IBCAST", "Int Bhurban Conf Appl Sci Technol"]}, "title": "A Triaxial Acceleration-based Human Motion Detection for Ambient Smart Home System", "abstract": "Health industry off late has been driven heavily by sensors i.e. accelerometers, magnetometers etc. which has allowed instant medical response to any injurious activity in an indoor/outdoor environment. Among the medical applications of accelerometers, fitness systems have used this component extensively but it still holds prominent room for deployment in an ambient smart home system to monitor daily life. In this paper, a novel accelerometer-based motion recognition system using statistical features have been proposed. Axial components of accelerometer have been processed statistically to produce discriminating features values from each activity. The proposed system was validated against accelerometer dataset and achieved satisfactory accuracy of 79.58% with random forest. The proposed system can be applied to health monitoring systems, interactive games and for examination of behaviors in outdoor and indoor environments.", "venue": "International Bhurban Conference on Applied Sciences and Technology", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2019-01-01", "journal": {"name": "2019 16th International Bhurban Conference on Applied Sciences and Technology (IBCAST)", "pages": "353-358"}, "authors": [{"authorId": "144095614", "name": "A. Jalal"}, {"authorId": "65790584", "name": "M. A. K. Quaid"}, {"authorId": "65733306", "name": "M. A. Sidduqi"}], "citations": [{"paperId": "4777aa14b569a9dc2dd2c5ad54c02e429caa78c6", "title": "TCN-attention-HAR: human activity recognition based on attention mechanism time convolutional network"}, {"paperId": "3194e95ceb1a9cbebb666d416e23f644d2f1a6c6", "title": "Pattern Analytics of Healthy and Diseased Leaves Recognition using Genetic Algorithm"}, {"paperId": "fc81394ada60b3a8bcc458de21a6a4b5a5471011", "title": "Smart Traffic Monitoring through Drone Images via Yolov5 and Kalman Filter"}, {"paperId": "86087b30c81da1bc176cc79af7d29cfb14d761b2", "title": "Dynamic Adoptive Gaussian Mixture Model for Multi-Object Detection Over Natural Scenes"}, {"paperId": "d43ba38cc0c9d1adf1d49ebd312bb5b44dda4ef0", "title": "Data Driven Approach to Leaf Recognition: Logistic Regression for Smart Agriculture"}, {"paperId": "d0c7718e3cf0efd8191e15d1c2b3efe03eec933a", "title": "Efficient Vehicle Detection and Tracking using Blob Detection and Kernelized Filter"}, {"paperId": "86e10b50e8b107560c90f4a31df4462492542518", "title": "Robust Object Recognition with Genetic Algorithm and Composite Saliency Map"}, {"paperId": "e184a5775ac8e5808852145730364884a053e545", "title": "Multimodal Objects Categorization by Fusing GMM and Multi-layer Perceptron"}, {"paperId": "6847ac286d064b44df26c517551243743370297a", "title": "Efficient Aerial Images Algorithms over Multi-objects labeling and Semantic Segmentation"}, {"paperId": "9a34d75abdfc7910bb9560d7244fe0d7bf693b8b", "title": "Intelligent Localization and Deep Human Activity Recognition through IoT Devices"}, {"paperId": "6a61587b539187a73b3ee3623ea0cf416347c0b7", "title": "Deep Skeleton Modeling and Hybrid Hand-crafted Cues over Physical Exercises"}, {"paperId": "bdd7ac9e2be05a436032cc1fac8e101d136a7fcb", "title": "Multi-sensors Fused IoT-based Home Surveillance via Bag of Visual and Motion Features"}, {"paperId": "ba07539269c3fee9fcd7c364e87c2221ae59400e", "title": "Deep Activity Recognition based on Patterns Discovery for Healthcare Monitoring"}, {"paperId": "5a2a49504b6a95751ed71d69daec22a57ba7f150", "title": "3D Shape Estimation from RGB Data Using 2.5D Features and Deep Learning"}, {"paperId": "2786d0fd16d8ec2149e768c3382812d29c4bb0ca", "title": "Highway Traffic Surveillance Over UAV Dataset via Blob Detection and Histogram of Gradient"}, {"paperId": "586390dfb3fcd251bf9cbc806906a56583036a4c", "title": "Vehicle Detection and Tracking Using Kalman Filter Over Aerial Images"}, {"paperId": "6547fadd838b0eeba69d8f4a9f2bc15587bf0c10", "title": "An Optimized System for Human Behaviour Analysis in E-Learning"}, {"paperId": "ab8b8ea20c031abef50206c3149ba291d39e31ac", "title": "Two-Dimensional Projection Based Wireless Intrusion Classification Using Lightweight EfficientNet"}, {"paperId": "eba07fe9761e9d13817e7b51d324e8ee5f4e2eee", "title": "Vehicle Detection and Tracking from UAV Imagery via Cascade Classifier"}, {"paperId": "8abe52b0334e134f1116ac81d02a80a07d2b6fb5", "title": "Toward Evaluating the Reliability of Deep-Neural-Network-Based IoT Devices"}, {"paperId": "73ccb17476a837690c578a9daffcc67e4e516627", "title": "Virtual Reality Game Based Interaction with Exergaming using Wearable Sensors"}, {"paperId": "8526aecd1407305d815883725a864405e31a54c1", "title": "Intelligent Signs Language Understanding with Autonomous Landmarks for E-learning Context"}, {"paperId": "97798f802c2fac684b13942187d3c18ee7c4f32d", "title": "Movement Disorders Detection in Parkinson’s Patients using Hybrid Classifier"}, {"paperId": "05fff3ac366fe2be1679110601e6a3be798f7182", "title": "Fundamental Recognition of ADL Assessments Using Machine Learning Engineering"}, {"paperId": "5ecd5f96c4f7c357e02a206c6b7b89cd3e1775ce", "title": "Dynamic Hand Gesture Recognition for Smart Lifecare Routines via K-Ary Tree Hashing Classifier"}, {"paperId": "e50f67016bbc26e15e3feee2c747dc243db5d313", "title": "Smartphone Sensor-Based Human Locomotion Surveillance System Using Multilayer Perceptron"}, {"paperId": "307264abd7187798fe9d3ea55478834ed15a7dcf", "title": "Privacy-Preserving Human Action Recognition with a Many-Objective Evolutionary Algorithm"}, {"paperId": "ab75450db59663a70b2d828a64efd6af7fa3c712", "title": "Wireless Sensor Network for Various Hardware Parameters for Orientational and Smart Sensing Using IoT"}, {"paperId": "fd9bfd7a6d6ef852d1ff46ffc4a963dbaedc2e62", "title": "A Smart Surveillance System for People Counting and Tracking Using Particle Flow and Modified SOM"}, {"paperId": "1c337cf3dc443b44f5f01126dd0fc01db15954ff", "title": "Dance Movement Recognition Based on Feature Expression and Attribute Mining"}, {"paperId": "d7a096d6d48e35cc3ebb5354f7f1dca4710c22e6", "title": "HF-SPHR: Hybrid Features for Sustainable Physical Healthcare Pattern Recognition Using Deep Belief Networks"}, {"paperId": "350b08f6e8fc69108e5bd6f28242e45ac0628beb", "title": "RGB-D Images for Objects Recognition using 3D Point Clouds and RANSAC Plane Fitting"}, {"paperId": "71af24b53605c0b1a4d2477187df6ac6c4c3397f", "title": "Hybrid Algorithm for Multi People Counting and Tracking for Smart Surveillance"}, {"paperId": "6214ef2335ae9ee6eb1ceecb49044f820cc7774f", "title": "Markerless Sensors for Physical Health Monitoring System Using ECG and GMM Feature Extraction"}, {"paperId": "35915f550d439acc90fe62784fcacdcc437c6928", "title": "A Study of Accelerometer and Gyroscope Measurements in Physical Life-Log Activities Detection Systems"}, {"paperId": "5d849b0f78156ee1fa622bea9f600ed8fe6dd417", "title": "A Quantitative Study of DDoS and E-DDoS Attacks on WiFi Smart Home Devices"}, {"paperId": "dbf698bbc39aed3638fa086a1789de4be57a7418", "title": "Automatic Recognition of Human Interaction via Hybrid Descriptors and Maximum Entropy Markov Model Using Depth Sensors"}, {"paperId": "3b498387ee672e908e6049d40b917421b12fbdea", "title": "A Novel Multichannel Dilated Convolution Neural Network for Human Activity Recognition"}, {"paperId": "def0e53e7a4425f05b720095845e8cfc4294873b", "title": "A Grey Target Group Decision Method with Dual Hesitant Fuzzy Information considering Decision-Maker's Loss Aversion"}, {"paperId": "b266e4384affa73655b90568cd6531c98df09855", "title": "Real-time unusual user event detection algorithm fusing vision, audio, activity, and dust patterns"}, {"paperId": "9a788e5063ceb177c68d3e4ca435feede4a14f92", "title": "A two-fold transformation model for human action recognition using decisive pose"}, {"paperId": "dd81890eaf2635e43e4a43afedc005af68f7e770", "title": "Investigating Best Approaches for Activity Classification in a Fully Instrumented Smarthome Environment"}, {"paperId": "cd29c339c607b3dc372119abb382290ed43055e2", "title": "Wearable Sensors for Activity Analysis using SMO-based Random Forest over Smart home and Sports Datasets"}, {"paperId": "9b3405e2df977adef6d16b2a1389e2eb76cc8398", "title": "Human Actions Tracking and Recognition Based on Body Parts Detection via Artificial Neural Network"}, {"paperId": "eea0b1585c299ce76d685dfbe86ca7926491f3b6", "title": "Statistical Multi-Objects Segmentation for Indoor/Outdoor Scene Detection and Classification via Depth Images"}, {"paperId": "7cbb403854f5d7b18cae8c2140fa0de0856474a5", "title": "RGB-D Images for Object Segmentation, Localization and Recognition in Indoor Scenes using Feature Descriptor and Hough Voting"}, {"paperId": "823723ae377977bb758ae0ed96c644dba975681e", "title": "DeepLocate: Smartphone Based Indoor Localization with a Deep Neural Network Ensemble Classifier"}, {"paperId": "b1cf6f31c6896db5e5b6098ea7a22b52ec4e33b3", "title": "Comparative Analysis between International Research Hotspots and National-Level Policy Keywords on Artificial Intelligence in China from 2009 to 2018"}, {"paperId": "5152638d9857d38d46b04e474dc9534f06a0c9e7", "title": "MU R-CNN: A Two-Dimensional Code Instance Segmentation Network Based on Deep Learning"}, {"paperId": "320aa14e052ca63bd73a72a15961f547b5d00ab0", "title": "Development of Output Correction Methodology for Long Short Term Memory-Based Speech Recognition"}, {"paperId": "05a240b2a533ca46f7b8ec6a955f1030aeb7f875", "title": "Scene Understanding and Recognition: Statistical Segmented Model using Geometrical Features and Gaussian Naïve Bayes"}, {"paperId": "c2ee53b8c7a1847a9012130e194cd3eb844af01f", "title": "Sensors Technologies for Human Activity Analysis Based on SVM Optimized by PSO Algorithm"}, {"paperId": "97f83d352e20f65128f429168594fa54734ef2d5", "title": "Salient Segmentation based Object Detection and Recognition using Hybrid Genetic Transform"}, {"paperId": "8d66175e5fb27ccbb4b12b04d789b4dea5b189af", "title": "Multi-Person Tracking in Smart Surveillance System for Crowd Counting and Normal/Abnormal Events Detection"}, {"paperId": "1f0f523fc56b87b50eb30d8118353142611204e9", "title": "Gradient Boosted Decision Tree based Classification for Recognizing Human Behavior"}, {"paperId": "75f38ce0b80e195e0a4948a8ca21ad8bf4af6aa5", "title": "Human Body Parts Estimation and Detection for Physical Sports Movements"}, {"paperId": "1622f480e1ca2884e41ef7047c1fb26ba604bb24", "title": "Body-Worn Sensors for Recognizing Physical Sports Activities in Exergaming via Deep Learning Model"}, {"paperId": "1619f810746a2e11b1748c52a5d18a4b931c6598", "title": "Multi-Sensor-Based Action Monitoring and Recognition via Hybrid Descriptors and Logistic Regression"}, {"paperId": "7eb9e495b983a5aa8bfcbb2374a2ebb146cfebe7", "title": "Context Aware Crowd Tracking and Anomaly Detection via Deep Learning and Social Force Model"}, {"paperId": "c619b0f504a7673dd09074e6ce0fe11c4de10d78", "title": "Aerial Insights: Deep Learning-Based Human Action Recognition in Drone Imagery"}, {"paperId": "3e9d765ee1814098ada07c7869fbe32bbc50a804", "title": "Real Objects Understanding Using 3D Haptic Virtual Reality for E-Learning Education"}, {"paperId": "00e98d5c7f7deed0b5f61dd0c3fb830b08e51353", "title": "Human-Based Interaction Analysis via Automated Key Point Detection and Neural Network Model"}, {"paperId": "88699ab23a491e480217aa714c9391daf4bd53a9", "title": "Deep Ontology-Based Human Locomotor Activity Recognition System via Multisensory Devices"}, {"paperId": "8f5034fe658e3bf6890a2da42f93a711a32db8c6", "title": "Applications and Challenges in IoT based Smart Homes"}, {"paperId": "cf804f9a44f6fd4526c6a29f18d2d61cf7289b33", "title": "Intelligent Smart Home Energy Efficiency Model Using Artificial Intelligence and Internet of Things"}, {"paperId": "1729f6750d94562ad79bc3e2421004147f106b4f", "title": "Recognition of Hand-Towards-Face Movements Prototype to Fight COVID-19 Using an IMU Sensor and Deep Learning Model Embedded in a Single-Board Computer"}, {"paperId": "4348bf48b5fb0f6b1bc370c445e4a6506ae6649b", "title": "Smart Homes: How Much Will They Support Us? A Research on Recent Trends and Advances"}, {"paperId": "bc83f20c06701c09bf445dc326fd054abc706a83", "title": "An Inexpensive Upgradation of Legacy Cameras Using Software and Hardware Architecture for Monitoring and Tracking of Live Threats"}, {"paperId": "748926784552f6d23b493d3afc90d6e26cb8afec", "title": "Near-Limit Kinetic Energy Harvesting From Arbitrary Acceleration Waveforms: Feasibility Study by the Example of Human Motion"}, {"paperId": "1d10bb31964b764534475fef25e7238031dbe4e4", "title": "Intelligent Pattern Recognition Algorithms based on Dust, Vision and Activity Sensors for User Unusual Event Detection"}]}
