{"paperId": "d73637844379a6c0a2fe3a28a754ab7013be1a89", "publicationVenue": {"id": "182090fa-e886-41f3-8590-443a006fb02f", "name": "Agriculture", "type": "journal", "issn": "0002-1695", "alternate_issns": ["1412-4262", "0551-3677", "2170-1059", "2077-0472"], "url": "http://www.degruyter.com/view/j/agri", "alternate_urls": ["https://www.mdpi.com/journal/agriculture", "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217909", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217909", "https://www.agriculture.sk/", "https://revue-agro.univ-setif.dz/"]}, "title": "Smart Sensing with Edge Computing in Precision Agriculture for Soil Assessment and Heavy Metal Monitoring: A Review", "abstract": "With the implementation of the Internet of Things, the agricultural domain has become data-driven, allowing for well-timed and cost-effective farm management while remaining environmentally sustainable. Thus, the incorporation of Internet of Things in the agricultural domain is the need of the hour for developing countries whose gross domestic product primarily depends on the farming sector. It is worth highlighting that developing nations lack the infrastructure for precision agriculture; therefore, it has become necessary to come up with a methodological paradigm which can accommodate a complete model to connect ground sensors to the compute nodes in a cost-effective way by keeping the data processing limitations and constraints in consideration. In this regard, this review puts forward an overview of the state-of-the-art technologies deployed in precision agriculture for soil assessment and pollutant monitoring with respect to heavy metal in agricultural soil using various sensors. Secondly, this manuscript illustrates the processing of data generated from the sensors. In this regard, an optimized method of data processing derived from cloud computing has been shown, which is called edge computing. In addition to this, a new model of high-performance-based edge computing is also shown for efficient offloading of data with smooth workflow optimization. In a nutshell, this manuscript aims to open a new corridor for the farming sector in developing nations by tackling challenges and providing substantial consideration.", "venue": "Agriculture", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2021-05-21", "journal": {"name": "Agriculture", "pages": "475", "volume": "11"}, "authors": [{"authorId": "145010679", "name": "M. N. Akhtar"}, {"authorId": "2055598586", "name": "Abdurrahman Javid Shaikh"}, {"authorId": "1752784426", "name": "Ambareen Khan"}, {"authorId": "101445507", "name": "Habib Awais"}, {"authorId": "3275020", "name": "E. A. Bakar"}, {"authorId": "48717717", "name": "A. R. Othman"}], "citations": [{"paperId": "331282a6532597070f9fd9bec606901c54ba2331", "title": "Optimization of news dissemination push mode by intelligent edge computing technology for deep learning."}, {"paperId": "efc2d52de892df5fdd72a9377b9e66552290daad", "title": "Harnessing quantum computing for smart agriculture: Empowering sustainable crop management and yield optimization"}, {"paperId": "e43e36004c2b56450c80a3ea5dec14b6dcd54fbd", "title": "Machine-Learning-Based UAV-Assisted Agricultural Information Security Architecture and Intrusion Detection"}, {"paperId": "a0d845572845586d87b997915e6ce9f216d453d1", "title": "Soil Heavy-Metal Pollution Prediction Methods Based on Two Improved Neural Network Models"}, {"paperId": "ed6ac1d6e2dfef683afb773935790c29e0e78320", "title": "BERKEMBANGNYA AGROFISIKA DALAM PENINGKATAN PRODUKTIVITAS PERTANIAN"}, {"paperId": "18be4e4f1d2d4b3f30145e2dbf8b9ba8df035e09", "title": "Analysis of soil compaction induced beneath the working depth due to tilling action of different active tillage machinery"}, {"paperId": "6e7858d58694b47368a484503372f88a62222ba3", "title": "Experimental performance of soil monitoring system using IoT technique for automatic drip irrigation"}, {"paperId": "b6c52becc563cef48177a90302c03800aca0d360", "title": "Monitoring of Soil Nutrient Levels by an EC Sensor during Spring Onion (Allium fistulosum) Cultivation under Different Fertilizer Treatments"}, {"paperId": "038270a1b076c7bf2faa91844a131bc615db0d11", "title": "Research Constituents and Trends in Smart Farming: An Analytical Retrospection from the Lens of Text Mining"}, {"paperId": "c1c057a41859039c555ca6b2ec0b10540804f72a", "title": "Energy Aware Software Defined Network Model for Communication of Sensors Deployed in Precision Agriculture"}, {"paperId": "df0dd5e4a789a6b792c2b1e3aae2154962cc7e81", "title": "A Sustainable Forage-Grass-Power Fuel Cell Solution for Edge-Computing Wireless Sensing Processing in Agriculture 4.0 Applications"}, {"paperId": "055056ed3b8cd0a8eb431dc1b008255b56ac6b12", "title": "Current Status and Prospects of Research on Sensor Fault Diagnosis of Agricultural Internet of Things"}, {"paperId": "6cfcf96c0cdf343a091d10916f00931a1e1c3289", "title": "Aplicación de internet de las cosas (IoT) para entornos de invernadero optimizados"}, {"paperId": "541e2e35a77119d3e0fe586451555753c0ed6efa", "title": "Ant Colony Optimization ACO Based Autonomous Secure Routing Protocol for Mobile Surveillance Systems"}, {"paperId": "9aef9ad2f960cfaf874c5c97b58c500cccf6f0fa", "title": "Smart Farming IoT Based Management during Post Covid-19"}, {"paperId": "81ff4e280ebd36bd92b4602c256acfb3a13f869e", "title": "Convolution Network Enlightened Transformer for Regional Crop Disease Classification"}, {"paperId": "d87b26a2051cbee8c857e0a82e7bc21ebdbd9047", "title": "An effective litchi detection method based on edge devices in a complex scene"}, {"paperId": "febb676178e169c673ace88f5a188ef5ca9c0ce0", "title": "A Critical Review for Real-Time Continuous Soil Monitoring: Advantages, Challenges, and Perspectives."}, {"paperId": "3c078e8d95b932511e8766dcc9678b7bc1c783a6", "title": "The next generation of soil and water bodies heavy metals prediction and detection: New expert system based Edge Cloud Server and Federated Learning technology."}, {"paperId": "c8055b7bf6ae6ba7e1f6e6b0aad8eb27d4baee4e", "title": "Applications of IoT for optimized greenhouse environment and resources management"}, {"paperId": "fc2856a848c7a7bbc78fce011808680ed5d7d263", "title": "Application of Internet of Things (IoT) for Optimized Greenhouse Environments"}, {"paperId": "39e22f4d6edb782cddac65c9241c5be6a7f84762", "title": "Edge Computing Driven Data Sensing Strategy in the Entire Crop Lifecycle for Smart Agriculture"}, {"paperId": "fa6232ca180845464ccf95008c90239cbf87ce20", "title": "A Systematic Survey on the Role of Cloud, Fog, and Edge Computing Combination in Smart Agriculture"}, {"paperId": "4373d78c0da407e4f447464881cf46c7d374aed6", "title": "Analysis of Edge Computing Systems-An AI Based Perspective"}, {"paperId": "be5dd700f73d67d948e8d4250149d419351b8dd5", "title": "Computer vision on the edge: A computing framework for high-throughput phenotyping in livestock operations"}]}
