{"paperId": "d74f2d67ab3b45a12f44e199dfa8ad874d8db6d5", "publicationVenue": {"id": "1257031a-9c82-43ab-b4e5-1c8749f9dd94", "name": "Frontiers in Marine Science", "type": "journal", "alternate_names": ["Front Mar Sci"], "issn": "2296-7745", "url": "https://www.frontiersin.org/journals/marine-science", "alternate_urls": ["http://www.frontiersin.org/Marine_Science/archive", "http://www.frontiersin.org/Marine_Science"]}, "title": "Using Automatic Identification System (AIS) Data to Estimate Whale Watching Effort", "abstract": "The growing concerns about the negative effects caused by whale watching on wild cetacean populations are evincing the need to measure whale watching effort more precisely. The current alternatives do not provide sufficient information or imply time-consuming and staff-intensive tasks that limit their effectiveness to establish the maximum carrying capacity for this tourist activity. A methodology based on big data analysis, using Automatic Identification System (AIS) messages can provide valuable vessel activity information, which is necessary to estimate whale watching effort in areas with cetacean populations. We used AIS data to automatically detect whale watching operations and quantify whale watching effort with high spatial and temporal resolution in the Canary Islands off the west African coast. The results obtained in this study are very encouraging, proving that the methodology can estimate seasonal and annual trends in the whale watching effort. The methodology has also proved to be effective in providing detailed spatial information about the whale watching effort, which makes an interesting tool to manage spatial regulations and enforce exclusion zones. The widespread use of AIS devices in maritime navigation provides an enormous potential to easily extend this methodology to other regions worldwide. Any public strategy aimed at the sustainable use of marine resources should enhance the use of this kind of information technologies, collecting and archiving detailed information on the activity of all the vessels, especially in marine protected areas.", "venue": "Frontiers in Marine Science", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-07-26", "journal": {"volume": "8"}, "authors": [{"authorId": "5526514", "name": "J. Almunia"}, {"authorId": "1454615471", "name": "Patricia Delponti"}, {"authorId": "144660560", "name": "F. Rosa"}], "citations": [{"paperId": "befa664fb32b772d611ef19af8cc33e257d2bc5a", "title": "Viral skin diseases in odontocete cetaceans: gross, histopathological, and molecular characterization of selected pathogens"}, {"paperId": "08e6cc967c5228d7a947a1bc286e488a2ebd2093", "title": "DB-Drift: Concept drift aware density-based anomaly detection for maritime trajectories"}, {"paperId": "975e8a602386e23b269440c49210a49581f5d743", "title": "Sustainability as a common goal: Regulatory compliance, stakeholder perspectives, and management implications of whale and dolphin watching in the Strait of Gibraltar"}, {"paperId": "669601a3737689dbeb3abd7a454421926b44f82d", "title": "Fuzzy Controller Design Approach for a Ship’s Dynamic Path Based on AIS Data with the Takagi–Sugeno Fuzzy Observer Model"}, {"paperId": "5b311646d8ce816748d6f35e9ecd7fa6d19f3eb9", "title": "Mapping of benthic ecosystems: Key to improving the management and sustainability of anchoring practices for ocean-going vessels"}, {"paperId": "da933185268866f79861f0e610b76e6c699f3a38", "title": "Decreased resting and nursing in short-finned pilot whales when exposed to louder petrol engine noise of a hybrid whale-watch vessel"}]}
