{"paperId": "d75d5e20b35b04b671987eef12e5623e4064e40c", "publicationVenue": {"id": "6c1a00cb-4b59-44d6-a887-bfd7c5b3768f", "name": "International Conference on Industrial Technology", "type": "conference", "alternate_names": ["ICIT", "Int Conf Ind Technol", "IEEE Int Conf Integr Technol", "IEEE International Conference on Integration Technology"]}, "title": "PABED – A Tool for Big Education Data Analysis", "abstract": "Cloud computing and big data have risen to become the most popular technologies of the modern world. Apparently, the reason behind their immense popularity is their wide range of applicability as far as the areas of interest are concerned. Education and research remain one of the most obvious and befitting application areas. This research paper introduces a big data analytics tool, PABED (Project - Analyzing Big Education Data), for the education sector that makes use of cloud-based technologies. This tool is implemented using Google BigQuery and R programming language and allows comparison of undergraduate enrollment data for different academic years. Although, there are many proposed applications of big data in education, there is a lack of tools that can actualize the concept into practice. PABED is an effort in this direction. The implementation and testing details of the project have been described in this paper. This tool validates the use of cloud computing and big data technologies in education and shall head start development of more sophisticated educational intelligence tools.", "venue": "International Conference on Industrial Technology", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2018-07-31", "journal": {"name": "2019 IEEE International Conference on Industrial Technology (ICIT)", "pages": "794-799"}, "authors": [{"authorId": "144621123", "name": "Samiya Khan"}, {"authorId": "2182690", "name": "K. A. Shakil"}, {"authorId": "2109936137", "name": "Mansaf Alam"}], "citations": [{"paperId": "9bebf43d6fcc3b88a4bab0ea34493c4be19c34f8", "title": "Recent trends in computational intelligence for educational big data analysis"}, {"paperId": "fba60363899def232a47b130d2480f19071b0172", "title": "A Collaborative Metaverse based A-La-Carte Framework for Tertiary Education (CO-MATE)"}, {"paperId": "6cca52d9e3eb513f335c4e8577d95e156ef54df5", "title": "Big data analytics for data-driven industry: a review of data sources, tools, challenges, solutions, and research directions"}, {"paperId": "9f6e50c6da704de0860ccc64f36aac66af2e625b", "title": "Big Data Application and its Impact on Education"}, {"paperId": "d057b667bec3c48fec86fc889b6179217591493a", "title": "Validity of the “Big Data Tendency in Education” Scale as a Tool Helping to Reach Inclusive Social Development"}, {"paperId": "107b9672bab94b09d296d7e22c34f99b02917708", "title": "A Spark ML driven preprocessing approach for deep learning based scholarly data applications"}, {"paperId": "50a357bb60bb706d6da23a3dac53e88e7ea7df88", "title": "Surveillance of Type –I & II Diabetic Subjects on Physical Characteristics: IoT and Big Data Perspective in Healthcare @NCR, India"}, {"paperId": "46eb28deb314d333ce01f39f6cc1af5141889b68", "title": "Machine Learning for IoT Systems"}]}
