{"paperId": "d768710878f296ee8c3c9812d03dbe407a6f3759", "publicationVenue": {"id": "764e3630-ddac-4c21-af4b-9d32ffef082e", "name": "IEEE International Conference on Data Engineering", "type": "conference", "alternate_names": ["ICDE", "Int Conf Data Eng", "IEEE Int Conf Data Eng", "International Conference on Data Engineering"], "url": "http://www.wikicfp.com/cfp/program?id=1331"}, "title": "Adaptive Code Learning for Spark Configuration Tuning", "abstract": "Configuration tuning is vital to optimize the performance of big data analysis platforms like Spark. Existing methods (e.g. auto-tuning relational databases) are not effective for tuning Spark, because the unique characteristics of Spark pose new challenges to configuration tuning. (C1) The Spark applications own various code structures and semantics, and the code features significantly affect Spark performance and configuration selection; (C2) Spark applications are extremely time-consuming on big data. It is infeasible for approaches such as Bayesian Optimization and Reinforcement Learning to collect sufficient training instances or repeatedly execute the applications; (C3) Spark supports various analytical applications and the tuning system needs to adapt to different applications. To address these challenges, we propose a LIghtweighT knob rEcommender system (LITE) for auto-tuning Spark configurations on various analytical applications and large-scale datasets. We first propose a code learning framework that can utilize code features to learn complex correlations between application performance and knob values (addressing C1). We then propose a lightweight auto-tuning method that migrates the knowledge learned from small-scale datasets to large-scale datasets (addressing C2). Next, to generalize to different Spark applications, we propose an adaptive model update approach to fine-tune the model via adversarial learning with newly collected feedback (addressing C3). Extensive experiments showed that LITE achieves much better performance compared with state-of-the-art auto-tuning methods.", "venue": "IEEE International Conference on Data Engineering", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-05-01", "journal": {"name": "2022 IEEE 38th International Conference on Data Engineering (ICDE)", "pages": "1995-2007"}, "authors": [{"authorId": "2146250575", "name": "Chen Lin"}, {"authorId": "2053816711", "name": "Junqing Zhuang"}, {"authorId": "3093836", "name": "Jia-geng Feng"}, {"authorId": "2155493018", "name": "Hui Li"}, {"authorId": "50177381", "name": "Xuanhe Zhou"}, {"authorId": "2242412700", "name": "Guoliang Li"}], "citations": [{"paperId": "f8b51530c7b02a01a89df3f52f9926493a8660bd", "title": "Accelerating Big Data Application by Eliminating Redundancy on Hadoop Cluster"}, {"paperId": "263b0924f50444bbd7cdf5374638695e3eb56156", "title": "Automatic Database Knob Tuning: A Survey"}, {"paperId": "4a99de8b49190bb89ee63bcd2fe491125ef02d3a", "title": "Towards Verified Scalable Parallel Computing with Coq and Spark"}, {"paperId": "27c5a594fb37d33640fadeaa07d0466211a60578", "title": "Code-Aware Cross-Program Transfer Hyperparameter Optimization"}, {"paperId": "8802e7ed7ff24334d9ef1492f9497b63b27352a5", "title": "LST-Bench: Benchmarking Log-Structured Tables in the Cloud"}, {"paperId": "c7d226c66f1c5b596fa4a360abd1004ed49628df", "title": "On the Implications of Heterogeneous Memory Tiering on Spark In-Memory Analytics"}, {"paperId": "42398f605f3f4d3b6a2014baddf08308e5b5958c", "title": "Efficient. Scalable and Robust Data Shuffle Service for Distributed MapReduce Computing on Cloud"}, {"paperId": "6e02f1dda7075f9a101d6557fd206c5ecf994377", "title": "DeepCAT: A Cost-Efficient Online Configuration Auto-Tuning Approach for Big Data Frameworks"}, {"paperId": "49f04a0fadf6c6cf833555fe15fd3c32d6f46eae", "title": "AutoIndex: An Incremental Index Management System for Dynamic Workloads"}, {"paperId": "4d1c255fc35427b355c5f964bd5f063821749182", "title": "OPPerTune : Post-Deployment Configuration Tuning of Services Made Easy"}]}
