{"paperId": "d7813c7d536ece78d5c8285e2a507410754ed43b", "publicationVenue": {"id": "f80ba4a3-7aed-4021-b4d8-e4f50668847a", "name": "IEEE International Joint Conference on Neural Network", "type": "conference", "alternate_names": ["IJCNN", "IEEE Int Jt Conf Neural Netw", "Int Jt Conf Neural Netw", "International Joint Conference on Neural Network"], "url": "http://www.wikicfp.com/cfp/program?id=1573"}, "title": "Time-Aware Neighbor Sampling on Temporal Graphs", "abstract": "We present a new neighbor sampling method on temporal graphs. In a temporal graph, predicting different nodes' time-varying properties can require the receptive neigh-borhood of various temporal scales. In this work, we propose the TNS (Time-aware Neighbor Sampling) method: TNS learns from temporal information to provide an adaptive receptive neighborhood for every node at any time. Learning how to sample neighbors is non-trivial, since the neighbor indices in time order are discrete and not differentiable. To address this challenge, we transform neighbor indices from discrete values to continuous ones by interpolating the neighbors' messages. TNS can be flexibly incorporated into popular temporal graph networks to improve their effectiveness without increasing their time complexity. TNS can be trained in an end-to-end manner. It requires no extra supervision and is automatically and implicitly guided to sample the neighbors that are most beneficial for prediction. Empirical results on multiple standard datasets show that TNS yields significant gains on edge prediction and node classification.", "venue": "IEEE International Joint Conference on Neural Network", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-07-18", "journal": {"name": "2022 International Joint Conference on Neural Networks (IJCNN)", "pages": "1-8"}, "authors": [{"authorId": "2108841625", "name": "Yiwei Wang"}, {"authorId": "1928716951", "name": "Yujun Cai"}, {"authorId": "3431194", "name": "Yuxuan Liang"}, {"authorId": "49441320", "name": "Henghui Ding"}, {"authorId": "2146410434", "name": "Changhu Wang"}, {"authorId": "2019961", "name": "Bryan Hooi"}], "citations": []}
