{"paperId": "d782a12d9c3e8ae14093ab8698437b2c14e807f0", "publicationVenue": {"id": "2d100ae4-a9ef-4c13-b34e-1829f6aca016", "name": "Biomimetics", "type": "journal", "issn": "1059-0153", "alternate_issns": ["2313-7673"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-981712", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-981712", "https://www.mdpi.com/journal/biomimetics"]}, "title": "Golf Optimization Algorithm: A New Game-Based Metaheuristic Algorithm and Its Application to Energy Commitment Problem Considering Resilience", "abstract": "In this research article, we uphold the principles of the No Free Lunch theorem and employ it as a driving force to introduce an innovative game-based metaheuristic technique named Golf Optimization Algorithm (GOA). The GOA is meticulously structured with two distinctive phases, namely, exploration and exploitation, drawing inspiration from the strategic dynamics and player conduct observed in the sport of golf. Through comprehensive assessments encompassing fifty-two objective functions and four real-world engineering applications, the efficacy of the GOA is rigorously examined. The results of the optimization process reveal GOA’s exceptional proficiency in both exploration and exploitation strategies, effectively striking a harmonious equilibrium between the two. Comparative analyses against ten competing algorithms demonstrate a clear and statistically significant superiority of the GOA across a spectrum of performance metrics. Furthermore, the successful application of the GOA to the intricate energy commitment problem, considering network resilience, underscores its prowess in addressing complex engineering challenges. For the convenience of the research community, we provide the MATLAB implementation codes for the proposed GOA methodology, ensuring accessibility and facilitating further exploration.", "venue": "Biomimetics", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-24", "journal": {"name": "Biomimetics", "volume": "8"}, "authors": [{"authorId": "40799648", "name": "Z. Montazeri"}, {"authorId": "1844137", "name": "T. Niknam"}, {"authorId": "2614836", "name": "J. Aghaei"}, {"authorId": "2128305375", "name": "O. Malik"}, {"authorId": "2132379761", "name": "Mohammad Dehghani"}, {"authorId": "2167566858", "name": "Gaurav Dhiman"}], "citations": [{"paperId": "0a998f2d64f64bba0ced5c76e1c45709302525a3", "title": "A Hybrid Adaptive Simulated Annealing and Tempering Algorithm for Solving the Half-Open Multi-Depot Vehicle Routing Problem"}, {"paperId": "e69bc34873cc589a35aa237d87624dcf7c46c73e", "title": "Application of a novel metaheuristic algorithm inspired by stadium spectators in global optimization problems."}, {"paperId": "3dfdb9ddccb1e550c985892123cb871511eb3ed1", "title": "Pufferfish Optimization Algorithm: A New Bio-Inspired Metaheuristic Algorithm for Solving Optimization Problems"}, {"paperId": "9af115a0bba289ca381080905dae31df22aac136", "title": "A New Hybrid Particle Swarm Optimization–Teaching–Learning-Based Optimization for Solving Optimization Problems"}, {"paperId": "1f30ad69e5c7dedc7286455edb147df011b32ccb", "title": "Giant Armadillo Optimization: A New Bio-Inspired Metaheuristic Algorithm for Solving Optimization Problems"}, {"paperId": "9f3bf8a9858e8818ddb020f745900371f1299d41", "title": "A genetic operators-based Ant Lion Optimiser for training a medical multi-layer perceptron"}, {"paperId": "8df6ce34e2be4f167559834f195468a121e130a9", "title": "Kookaburra Optimization Algorithm: A New Bio-Inspired Metaheuristic Algorithm for Solving Optimization Problems"}, {"paperId": "ef3d1d72076c278b0748dd853ede516e21cd1d31", "title": "OOBO: A New Metaheuristic Algorithm for Solving Optimization Problems"}, {"paperId": "1088f92aec8eb5ffba6bfacbb39382792b6f8ca5", "title": "A New Human-Based Metaheuristic Algorithm for Solving Optimization Problems Based on Technical and Vocational Education and Training"}, {"paperId": "e5f320eab5187c7fefadd2d093526e60a8837cfd", "title": "Lyrebird Optimization Algorithm: A New Bio-Inspired Metaheuristic Algorithm for Solving Optimization Problems"}]}
