{"paperId": "d78996d6f35802b9c2f2544700977b91a3d39cea", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Intelligent and Agile Control of Edge Resources for Latency-Sensitive IoT Services", "abstract": "This paper presents an intelligent and agile resource control scheme for a latency-sensitive virtual network function (VNF) of Internet of things directory service (IoT-DS) deployed in a virtualized edge cloud whose computational and networking resources can be adjusted dynamically. The objective of the proposed scheme is to adjust resources dynamically such that the IoT-DS function can resolve IoT queries and provide IoT records within a bounded delay for latency-sensitive services such as automated driving, despite fluctuations in workloads. The proposed scheme leverages multiple regression models for resource demand prediction and dynamic adjustment. These models are trained offline before their deployment with a large training dataset collected from the system operating with simulated workloads. After the deployment, they are updated regularly by online retraining for more accurate performances. We aim to optimize resource allocation to satisfy both the target performance in terms of service latency and resource utilization. The results obtained from an experimental system implementation of the IoT-DS function in Docker containers show that the dynamic adjustment of CPU resources by the proposed scheme with supervised offline training reduces the CPU resource demand by 21.9% and the number of lookup latency requirement violations by 58.2% in comparison with a threshold rule-based conventional algorithm. Moreover, the proposed scheme can offer an agile control of CPU resources within a 1 s interval, which is five times faster than those reported in previous studies. The addition of unsupervised online retraining further reduces CPU resource requirements by 52% and lookup latency requirement violation cases by 62.5% compared with when no adjustments are performed.", "venue": "IEEE Access", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-11-17", "journal": {"name": "IEEE Access", "pages": "207991-208002", "volume": "8"}, "authors": [{"authorId": "1734625", "name": "Ved P. Kafle"}, {"authorId": "2273269", "name": "A. H. A. Muktadir"}], "citations": [{"paperId": "58f40b58b8cb481c05225ee1827d7d0d2b28b41c", "title": "Interoperable IoMT Approach for Remote Diagnosis with Privacy-Preservation Perspective in Edge Systems"}, {"paperId": "629723b49317a219d98254bdd27fab6d30ee7937", "title": "AVS_FD_MVITS: an agile IT service design workflow for small data centers"}, {"paperId": "d373f567886135eca6a13c9992a833f98a130dc7", "title": "Intelligent Framework for Task Placement and Resource Allocation for IoT in the Fog-Cloud Scenario"}, {"paperId": "84ce1c0d94d9115d4391a1f716cfab6c26ac7bb8", "title": "Learning Based Task Placement Algorithm in the IoT Fog-Cloud Environment"}, {"paperId": "e78a66a3dd7027f2cd54d62fc84db556c615eb9d", "title": "Reliable Internet of Things: Challenges and Future Trends"}, {"paperId": "9d353ef9e607f61fdf26ac51f6b5aae009db58cf", "title": "Edge Computing Technology Enablers: A Systematic Lecture Study"}, {"paperId": "88e2317face746dea4c4e43bca2fb57b2f244f20", "title": "Sample Contribution Pattern Based Big Data Mining Optimization Algorithms"}]}
