{"paperId": "d78c690785993e5aafc21c94124df60d5b4e7b35", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Urban Function as a New Perspective for Adaptive Street Quality Assessment", "abstract": "Street networks are considered to be one significant component of urban structures that serve various urban functions. Assessing the quality of each street is important for managing natural and public resources, organizing urban morphologies and improving city vitality. While current research focuses on particular street assessment indices, such as accessibility and connectivity, they ignore biases in street assessment caused by differences in urban functions. To address this issue, an adaptive approach to assessing street quality from the perspective of the variation in urban functions is proposed. First, an adaptive urban function detection model is established, with street-level element segmenting using PSPNet and semantic urban function extraction using LDA topic modelling. On this basis, an urban function-driven street quality assessment is proposed to adaptively evaluate multilevel urban streets. Taking Tianhe District in Guangzhou, Guangdong Province, as the study area, experiments using street view images and points of interest (POIs) are applied to validate the proposed approach. The experiment results in a model for adaptive urban function detection with an overall accuracy of 64.3%, showing that streets with different urban functions, including traffic, commercial, and residential functions, can be assessed. The experimental results can facilitate urban function organization and urban land-use planning.", "venue": "Sustainability", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2020-02-11", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "2027207126", "name": "Fenglian Hu"}, {"authorId": "2157221973", "name": "Wei Liu"}, {"authorId": "2151165711", "name": "Junyu Lu"}, {"authorId": "2116332565", "name": "Chengpeng Song"}, {"authorId": "2107842496", "name": "Y. Meng"}, {"authorId": "2152810349", "name": "Jun Wang"}, {"authorId": "2728362", "name": "Hanfa Xing"}], "citations": [{"paperId": "8a5f67c2a72ab22c074185d9a3e5bfd80b133361", "title": "Analyzing the Direction of Urban Function Renewal Based on the Complex Network"}, {"paperId": "6217978520370f145f45f47daa37d33ebd6805db", "title": "Revealing spatio-temporal evolution of urban visual environments with street view imagery"}, {"paperId": "ce457270b3678f05354b3093ba357ece6da8fae5", "title": "Evaluating the Spatial Quality of Urban Living Streets: A Case Study of Hengyang City in Central South China"}, {"paperId": "5cdde049463b912600882376e5488b20a998657d", "title": "Computer Vision Technology for Monitoring of Indoor and Outdoor Environments and HVAC Equipment: A Review"}, {"paperId": "4c619576d6cfbba90188b53052258f9cddfc8640", "title": "Do We Live Where It Is Pleasant? Correlates of Perceived Pleasantness with Socioeconomic Variables"}, {"paperId": "ab6b620e51b6c07976e262f4fbcd13810b26ac94", "title": "A review on street view observations in support of the sustainable development goals"}, {"paperId": "e4367b6f3b78f27bf5d1840f2f4607b69449104e", "title": "Research on improved DeepLabv3+ image Semantic Segmentation algorithm"}, {"paperId": "a23c3e3bf86c3fe77bc862f6eaad752e81ae0c6e", "title": "Exploring the Relationship between Urban Street Spatial Patterns and Street Vitality: A Case Study of Guiyang, China"}, {"paperId": "d3b3842a612d83ae515f06d34a26d8777334078e", "title": "A comprehensive framework for evaluating the quality of street view imagery"}, {"paperId": "3758b1ffc1143657ea5932e469e18df10f4359ea", "title": "Comprehensive Evaluation of the Implementation Effect of Commercial Street Quality Improvement Based on AHP-Entropy Weight Method—Taking Hefei Shuanggang Old Street as an Example"}, {"paperId": "30c8ad8131478fcf0295f79bda127aac79e9fd7b", "title": "Unsupervised machine learning in urban studies: A systematic review of applications"}, {"paperId": "f4d4763f30498f3216ae2c17acf32e4b4d54a4b9", "title": "Assessing Street Space Quality Using Street View Imagery and Function-Driven Method: The Case of Xiamen, China"}, {"paperId": "a11cbf0979da52c42bd4ef55675ac5bd5800488c", "title": "Exploring the Effects of Roadside Vegetation on the Urban Thermal Environment Using Street View Images"}, {"paperId": "db3b5a7c190afd33b38ef3d2992b534fc365522b", "title": "Street view imagery in urban analytics and GIS: A review"}, {"paperId": "9e18fc41122dab893971e884efb3d81ada06b9e4", "title": "Exploring the Correlation between Block Vitality and Block Environment Based on Multisource Big Data: Taking Wuhan City as an Example"}, {"paperId": "44a76c70643836508bccd210f2e045a949f05940", "title": "Panoramic Street-Level Imagery in Data-Driven Urban Research: A Comprehensive Global Review of Applications, Techniques, and Practical Considerations"}, {"paperId": "4e50a11a77691830109ba4f6c55ecf35ece3ebce", "title": "Influence of Built Environment on Street Vitality: A Case Study of West Nanjing Road in Shanghai Based on Mobile Location Data"}, {"paperId": "3422963e36d8c27d1e1874ab26584a654d4a51c1", "title": "Santiago de Chile through the Eyes of Jane Jacobs. Analysis of the Conditions for Urban Vitality in a Latin American Metropolis"}, {"paperId": "52e3eefa7a5142748ca16d5b40c7dbf1c0c7681e", "title": "Tourism Driver Mechanisms of Metropolitan Area Development: Evidence from the Guangdong-Hong Kong-Marco Greater Bay Area"}]}
