{"paperId": "d796079c62b15a0f383ea5a0756cedf8ba2f2e85", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Two-Level Genetic Algorithm for Evolving Convolutional Neural Networks for Pattern Recognition", "abstract": "The aim of Neuroevolution is to find neural networks and convolutional neural network (CNN) architectures automatically through evolutionary algorithms. A crucial problem in neuroevolution is search time, since multiple CNNs must be trained during evolution. This problem has led to fitness acceleration approaches, generating a trade-off between time and fitness fidelity. Also, since search spaces for this problem usually include only a few parameters, this increases the human bias in the search. In this work, we propose a novel two-level genetic algorithm (GA) for addressing the fidelity-time trade-off problem for the fitness computation in CNNs. The first level evaluates many individuals quickly, and the second evaluates only those with the best results more finely. We also propose a search space with few restrictions, and an encoding with unexpressed genes to facilitate the crossover operation. This search space allows CNN architectures to have any sizes, shapes, and skip-connections among nodes. The two-level GA was applied to the pattern recognition problem on seven datasets, five MNIST-Variants, Fashion-MNIST, and CIFAR-10, achieving significantly better results than all those previously published. Our results show an improvement of 39.89% (4.2% error reduction) on the most complex dataset of MNIST (MRDBI), and on average 30.52% (1.35% error reduction) on all the five datasets. Furthermore, we show that our algorithm performed as well as precise-training GA, but took only the time of a fast-training GA. These results can be relevant and useful not only for image classification problems but also for GA-related problems.", "venue": "IEEE Access", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "126856-126872", "volume": "9"}, "authors": [{"authorId": "2045765023", "name": "Daniel A. Montecino"}, {"authorId": "2088936679", "name": "Claudio A. Perez"}, {"authorId": "143759604", "name": "K. Bowyer"}], "citations": [{"paperId": "b0e77021ba825342d12f6153252db7ba0ec8d3ba", "title": "Two-Stage Pedestrian Detection Model Using a New Classification Head for Domain Generalization"}, {"paperId": "7544a5721d6eb1f9f837b6c1bee6dddc8c08fba3", "title": "Eight years of AutoML: categorisation, review and trends"}, {"paperId": "269fed3c9a541a4073cde6e205878c2618b2f973", "title": "An Adaptive Hybrid Attention Based Convolutional Neural Net for Intelligent Transportation Object Recognition"}, {"paperId": "2b1808b78991dded0b37f904c3328c4ac8d0f1af", "title": "Development of machine learning models to predict gestational diabetes risk in the first half of pregnancy"}, {"paperId": "fff87b7fc7ee75b21b87111cd5236553e5c58c7e", "title": "Performance Explorations of a PMS Motor Drive Using an ANN-Based MPPT Controller for Solar-Battery Powered Electric Vehicles"}, {"paperId": "70c31a496c366e5676a65a87738982c0483b618b", "title": "Reconfigurable Hybrid Model Convolutional Stage – Infinity Laplacian Applied to Depth Completion"}, {"paperId": "c36c7c904b7e32103066718e56ec9dcdae271e26", "title": "Improved Search in Neuroevolution Using a Neural Architecture Classifier With the CNN Architecture Encoding as Feature Vector"}, {"paperId": "49b6646b7d407f50330e13aaa453661a6cf674b2", "title": "Face Patches Designed Through Neuroevolution for Face Recognition With Large Pose Variation"}, {"paperId": "9953366d8f26d6f9866541febdf166d479ad7be1", "title": "Iris Recognition Using Low-Level CNN Layers Without Training and Single Matching"}]}
