{"paperId": "d7abec252223e58dcf3cf1c5eb1fed158ba341d3", "publicationVenue": {"id": "96710c95-a12e-4ed5-902f-bd4503396533", "name": "International Conferences on Smart Internet of Things", "type": "conference", "alternate_names": ["SmartIoT", "Int Conf Smart Internet Thing"]}, "title": "Research on Artificial Fish Swarm Clustering Algorithm in Urban Internet of Vehicles", "abstract": "Internet of Vehicles(IoV) is a typical application of Mobile Ad Hoc Networks(MANET). Due to the high speed of vehicles and frequent network topology changing in IoV, vehicle communication becomes extremely difficult. Especially in the urban environment, the complex road conditions and large numbers of vehicles put forward higher requirements for the communication performance of IoV in a dense network environment. Vehicle clustering is an effective method to improve communication capability. However, one of the key challenges is to minimize the number of clusters and reduce traffic congestion at the city intersection with the increasing number of vehicle nodes. In this paper, A cluster head capability parameter that considers the characteristics of IoV in an urban intersection scenario is designed, and a novel artificial fish swarm vehicle(AFSA-V) clustering algorithm in IoV is proposed. The simulation results show that the AFSA-V algorithm presented can generate fewer vehicle clusters than the famous CLPSO clustering algorithm, that is expected to reduce communication delay and improve IoV communication performance.", "venue": "International Conferences on Smart Internet of Things", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-08-01", "journal": {"name": "2020 IEEE International Conference on Smart Internet of Things (SmartIoT)", "pages": "328-332"}, "authors": [{"authorId": "1944868729", "name": "Fengxin Cheng"}, {"authorId": "2143499031", "name": "Caixing Shao"}], "citations": [{"paperId": "ad5bf2fc086a4dce244e9d6dff0e97026fd8e0cd", "title": "Delay Minimization using Cooperative Localization to Avoid Multiple Vehicle Collision in Vehicular Adhoc Networks"}, {"paperId": "7043064e4fb560c4fb9e4cdd4f966df1718fd365", "title": "Study on typical process route mining method based on multilevel longest common subsequence information entropy and intelligent clustering model"}, {"paperId": "f1650ac947125338ff57484c1698ef76892f4359", "title": "A novel framework for discovery and reuse of typical process route driven by symbolic entropy and intelligent optimisation algorithm"}, {"paperId": "485bd830cc57f3b9d0325b95d1231a0b591347eb", "title": "Internet of Vehicles: Architectures, Protocols and Communication Technologies"}]}
