{"paperId": "d7b94fc36724b10fd718b11735eb98907b63d01b", "publicationVenue": {"id": "8a9e9f3b-a025-473d-801e-72cdb0653d22", "name": "IEEE Symposium Series on Computational Intelligence", "type": "conference", "alternate_names": ["IEEE Symp Ser Comput Intell", "SSCI"], "url": "http://www.ieee-ssci.org/"}, "title": "Hierarchical Decomposition based Cooperative Coevolution for Large-Scale Black-Box Optimization", "abstract": "Most state-of-the-art decomposition approaches for cooperative coevolution adopt a static graph (variable interaction matrix) viewpoint to recognize the possible separability of real-valued objective functions. Although generally they work well for partially additively separable scenarios, all of them cannot solve non-separable problems and non-additively separable problems effectively. To tackle these issues, based on our recent theoretical advance, this paper proposes a hierarchical-decomposition-based cooperative coevolutionary framework for large-scale black-box optimization (LSBBO). Specifically, the well-known cyclically random decomposition strategy is embedded in a hierarchical fashion, in order to facilitate the continuous evolution of the best-so-far solution. Such a hierarchy provides a flexible way to make a proper trade-off between computational complexity and search performance as well as exploration and exploitation. Numerical experiments on the IEEE CEC’2010 LSBBO test suite showed the complementary performance of the proposed framework (when integrated with the automatic decomposition technique).", "venue": "IEEE Symposium Series on Computational Intelligence", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-12-01", "journal": {"name": "2019 IEEE Symposium Series on Computational Intelligence (SSCI)", "pages": "2690-2697"}, "authors": [{"authorId": "2829886", "name": "Qiqi Duan"}, {"authorId": "2056322340", "name": "Liang Qu"}, {"authorId": "2064322889", "name": "Chang Shao"}, {"authorId": "38069623", "name": "Yuhui Shi"}], "citations": []}
