{"paperId": "d7bea5fc7cb8c766ecc8b20972bceac9cca3a97b", "publicationVenue": {"id": "baa9820d-e273-4dc5-8754-8817abd0e3dd", "name": "Online World Conference on Soft Computing in Industrial Applications", "type": "conference", "alternate_names": ["Winter Simul Conf", "World Conf Soft Comput Ind Appl", "Winter Simulation Conference", "World Conference on Soft Computing in Industrial Applications", "WSC", "Online World Conf Soft Comput Ind Appl"], "url": "http://www.wikicfp.com/cfp/program?id=3156", "alternate_urls": ["http://www.acm.org/sigsim/"]}, "title": "Simulation-Based Evaluation of Imperfect Predictive Maintenance Models in Discrete Manufacturing: A Procedure Model and Case Study", "abstract": "The performance and reliability of production systems is greatly affected by sudden breakdowns. In order to avoid these unforeseen interruptions, predictive maintenance (PdM) systems are being widely used to predict failures and prevent outages by maintenance. The performance of PdM systems however depend heavily on precision and recall of prediction results. In the worst case, missing or false alarms can actually worsen the performance of an production system instead of improving it. We present a new procedural model which specifically focus on the imperfection of such PdM systems and estimate the impact of this unwanted property on the performance and economic aspects of a production system. The model is presented in all steps needed for implementation and evaluation and demonstrated in a realistic use case examining an interlinked production system with a simulation-based approach.", "venue": "Online World Conference on Soft Computing in Industrial Applications", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-12-10", "journal": {"name": "2023 Winter Simulation Conference (WSC)", "pages": "1984-1995"}, "authors": [{"authorId": "66436236", "name": "Clemens Gutschi"}, {"authorId": "2804635", "name": "N. Furian"}, {"authorId": "2185935239", "name": "Siegfried Voessner"}], "citations": []}
