{"paperId": "d7c27681e432c32b960710ce9e24c6dcc3899e96", "publicationVenue": null, "title": "IEEE BigData Cup 2022 Report Privacy-preserving Matching of Encrypted Images", "abstract": "We summarize the results of IEEE BigData 2022 Cup: Privacy-preserving Matching of Encrypted Images - a data mining challenge organized at the KnowledgePit platform in association with the IEEE BigData 2022 conference. We describe the challenge in the hearth of the competition task, as well as the data acquisition and preparation steps. We also provide a brief overview of the top-performing solutions submitted by participants. Finally, we present results of the post-competition data analysis, in which we consider the similarity of solutions submitted by various teams in terms of their errors on the test data. We conclude this analysis by discussion of the significance and impact of the competition results on the underlying problem of constructing effective and efficient anonymization algorithms for monitoring in the DOOH advertising industry.", "venue": "2022 IEEE International Conference on Big Data (Big Data)", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference", "Review"], "publicationDate": "2022-12-17", "journal": {"name": "2022 IEEE International Conference on Big Data (Big Data)", "pages": "6471-6480"}, "authors": [{"authorId": "1678848", "name": "Marcin S. Szczuka"}, {"authorId": "2434014", "name": "Andrzej Janusz"}, {"authorId": "2203094526", "name": "Boguslaw Cyganek"}, {"authorId": "150146883", "name": "Jakub Grabek"}, {"authorId": "2205328543", "name": "Lukasz Przebinda"}, {"authorId": "2203094743", "name": "Andżelika Zalewska"}, {"authorId": "1396364097", "name": "Andrzej Bukala"}, {"authorId": "145514740", "name": "D. Ślęzak"}], "citations": [{"paperId": "1ab60ee99e134c766fbddc51bb60b7e23aabbb4c", "title": "IEEE BigData Cup 2023 Report: Object Recognition with Muon Tomography Using Cosmic Rays"}, {"paperId": "8c317e974ca3a935e3d68e604d5f06355f25e2a8", "title": "Predicting Frags in Tactic Games at KnowledgePit.ai: ICME 2023 Grand Challenge Report"}, {"paperId": "42997396823750c1609c48718586f62f4b0d549a", "title": "Demystify scrambled and encoded images with auto-encoders"}, {"paperId": "bed28225f0f8ac1eb5f85de462dea71c688dff17", "title": "Gradient Boosted Trees for Privacy-Preserving Matching of Encrypted Images"}, {"paperId": "6c6b1434e8ffd755e84d25dd2af55b1df531c274", "title": "Identification of Encrypted Images Based on Image Statistics"}, {"paperId": "f9dcf6fa9956a3430c2688462e75600fed465889", "title": "IEEE Big Data Cup 2022: Privacy Preserving Matching of Encrypted Images with Deep Learning"}]}
