{"paperId": "d7c23b959fa004d62517939997d5fa38b1b286e8", "publicationVenue": {"id": "042bc893-3752-44f7-9e77-c59ce54b1b11", "name": "IEEE/IFIP Network Operations and Management Symposium", "type": "conference", "alternate_names": ["Network Operations and Management Symposium", "NOMS", "IEEE/IFIP Netw Oper Manag Symp", "Netw Oper Manag Symp"], "url": "http://www.comsoc.org/"}, "title": "An Intent-Based Networking mechanism: A study case for efficient path selection using Graph Neural Networks", "abstract": "The recent advancements in network systems, including Software-Defined Networking (SDN), Network Functions Virtualization (NFV), and cloud networking, have revolutionized network management by increasing efficiency and reducing manual effort. This has led to improved agility in deploying new network services, enabling scaling of network resources, making it easier to handle sudden increases in demand, and efficiently accessing new solutions. However, the heterogeneous network infrastructure and the physical links’ capability still impact the performance of interconnected nodes. This work provides a solution to this problem which centers on the use of Intent-Based Networking (IBN) for a high-level definition of service requirements (QoS) tailored to the specifications of each particular node. Additionally, Graph Neural Network (GNN) is integrated into the proposed system to model the overlay topology and understand the behavior of nodes and links. This allows the defined intents to be translated into optimal paths between end-to-end nodes. The network QoS is constantly monitored, and the GNN model regularly updates the path selection to meet the QoS specified by intents. The solution has been implemented as an IBN system design consisting of a manager for intent definition, a GNN model for optimal path selection, an Off-Platform Application (OPA) for policy creation, and a real-time monitoring system for network state assurance.", "venue": "IEEE/IFIP Network Operations and Management Symposium", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-08", "journal": {"name": "NOMS 2023-2023 IEEE/IFIP Network Operations and Management Symposium", "pages": "1-6"}, "authors": [{"authorId": "49656770", "name": "Javier Jose Diaz Rivera"}, {"authorId": "2228195", "name": "Mir Muhammad Suleman Sarwar"}, {"authorId": "2220366350", "name": "Sajid Alam"}, {"authorId": "2533447", "name": "T. Khan"}, {"authorId": "2340570", "name": "Muhammad Afaq"}, {"authorId": "2151893", "name": "Wang-Cheol Song"}], "citations": []}
