{"paperId": "d7c50fb3a5ebd31f146f87ed5f6dd3e9e6221a91", "publicationVenue": {"id": "d5b215f3-f737-45b2-875b-df309ce14c43", "name": "Scientific Programming", "type": "journal", "alternate_names": ["Sci Program"], "issn": "1058-9244", "url": "https://www.hindawi.com/journals/sp/", "alternate_urls": ["https://www.iospress.nl/html/10589244.php", "https://www.wiley.com/legacy/compbooks/compjournals/sciprog.html", "http://content.iospress.com/journals/scientific-programming"]}, "title": "Predicting Learning Behavior Using Log Data in Blended Teaching", "abstract": "Online and offline blended teaching mode, the future trend of higher education, has recently been widely used in colleges around the globe. In the article, we conducted a study on students’ learning behavior analysis and student performance prediction based on the data about students’ behavior logs in three consecutive years of blended teaching in a college’s “Java Language Programming” course. Firstly, the data from diverse platforms such as MOOC, Rain Classroom, PTA, and cnBlog are integrated and preprocessed. Secondly, a novel multiclass classification framework, combining the genetic algorithm (GA) and the error correcting output codes (ECOC) method, is developed to predict the grade levels of students. In the framework, GA is designed to realize both the feature selection and binary classifier selection to fit the ECOC models. Finally, key factors affecting grades are identified in line with the optimal subset of features selected by GA, which can be analyzed for teaching significance. The results show that the multiclass classification algorithm designed in this article can effectively predict grades compared with other algorithms. In addition, the selected subset of features corresponding to learning behaviors is pedagogically instructive.", "venue": "Scientific Programming", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-08-20", "journal": {"name": "Sci. Program.", "pages": "4327896:1-4327896:14", "volume": "2021"}, "authors": [{"authorId": "2150373884", "name": "Shu-Tong Xie"}, {"authorId": "2149073954", "name": "Zong-Bao He"}, {"authorId": "2115931047", "name": "Qiong Chen"}, {"authorId": "2149058403", "name": "Rong-Xin Chen"}, {"authorId": "36359718", "name": "Qingzhao Kong"}, {"authorId": "2148290061", "name": "Cun-Ying Song"}], "citations": [{"paperId": "8a68dd8e6beb74af7c58106b4a54d8cd71987c5b", "title": "Analyzing the efficacy of Higher Vocational Online-Offline Blended Teaching using Koch’s Model"}, {"paperId": "22b51255af790501f997306166884b4b76cdd3a0", "title": "Practical Dilemmas and Coping Strategies of Meta-Cosmos in Helping the High Quality Development of Ideological and Political Education in Colleges and Universities"}, {"paperId": "b9305ad1f1fad5758523bd4157bd3fc0f9a21153", "title": "Resource distribution of online and offline interactive teaching mode based on feature fusion network"}, {"paperId": "5d9247b240af3fbd275e718197dce44b8df5658a", "title": "Application of BOPPPS teaching model in online and offline blended teaching of college Public Basic Mathematics"}, {"paperId": "8828aca35d7838556501f37706d2ce9b0dcda599", "title": "Intelligent Stable Monitoring Algorithm of Students' Online Learning Behavior Based on User Portrait"}, {"paperId": "eeffdcdb4be89bf51df8d2eb5fe92028a4cb4d49", "title": "Optimization of Hybrid Multimedia Art and Design Teaching Mode in the Era of Big Data"}, {"paperId": "c6c7e20893605f13ae439096c1554257b9f716ac", "title": "Exploring the Influence of Students' Modes of Behavioral Engagement in an Online Programming Course Using the Partial Least Squares Structural Equation Modeling Approach"}]}
