{"paperId": "d80a87f3624461b36acdeb809c50979ba89fb1be", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "A Survey of Large Language Models in Finance (FinLLMs)", "abstract": "Large Language Models (LLMs) have shown remarkable capabilities across a wide variety of Natural Language Processing (NLP) tasks and have attracted attention from multiple domains, including financial services. Despite the extensive research into general-domain LLMs, and their immense potential in finance, Financial LLM (FinLLM) research remains limited. This survey provides a comprehensive overview of FinLLMs, including their history, techniques, performance, and opportunities and challenges. Firstly, we present a chronological overview of general-domain Pre-trained Language Models (PLMs) through to current FinLLMs, including the GPT-series, selected open-source LLMs, and financial LMs. Secondly, we compare five techniques used across financial PLMs and FinLLMs, including training methods, training data, and fine-tuning methods. Thirdly, we summarize the performance evaluations of six benchmark tasks and datasets. In addition, we provide eight advanced financial NLP tasks and datasets for developing more sophisticated FinLLMs. Finally, we discuss the opportunities and the challenges facing FinLLMs, such as hallucination, privacy, and efficiency. To support AI research in finance, we compile a collection of accessible datasets and evaluation benchmarks on GitHub.", "venue": "arXiv.org", "year": 2024, "fieldsOfStudy": ["Computer Science", "Economics"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2024-02-04", "journal": {"name": "ArXiv", "volume": "abs/2402.02315"}, "authors": [{"authorId": "2282598754", "name": "Jean Lee"}, {"authorId": "2111682436", "name": "Nicholas Stevens"}, {"authorId": "2046142", "name": "S. Han"}, {"authorId": "2282551469", "name": "Minseok Song"}], "citations": [{"paperId": "401aeac7beabe15fc1410f87d4d4ce466c24e565", "title": "The FinBen: An Holistic Financial Benchmark for Large Language Models"}]}
