{"paperId": "d80e2707925076bbfd06a696b17ae41a314137f4", "publicationVenue": {"id": "0d1ed720-97fb-42b3-bdc6-07caf6d32857", "name": "International Electric Drives Production Conference", "type": "conference", "alternate_names": ["EDPC", "Int Electr Drive Prod Conf"]}, "title": "Exhaustive Data- and Problem-Driven use Case Identification and Implementation for Electric Drive Production", "abstract": "Within the context of Industry 4.0, data is being recorded and collected at an increasing rate in the production environment of electric drives. On the one hand, the data serves the producer as a backup against potential failure induced returns. On the other hand, some of the recorded data is used specifically for data analytics methods with the expectation to generate additional information and thus knowledge through intelligent data aggregation and processing. In the latter case, i.e. the use of data analytics methods, there are several possibilities to identify use cases and to implement them in a later step. Use cases can be discovered and identified on the basis of actual problems, so they can be considered as problem-driven. Problems and challenges in current electric drive production are taken here as a possible starting point for the identification of use cases. It is also conceivable that future problems can be anticipated by, for example, expert knowledge. Therefore, actual problems can be prevented prematurely with data analytics. A completely different approach is to analyze the currently available data bases and develop possible use cases based on the existing data. Currently, there is no systematical approach to cover the use case implementation for electric drives holistically. Therefore, in this paper, the possible fields of tension of the use case identification, evaluation and implementation will be presented. In the second step, based on the findings, a systematical approach to identify, evaluate and eventually implement use cases will be derived. The approach will then be applied to the generic production process chain of electric motors. Within the application of the approach, the whole drive production process chain was systematically analyzed. Out of the variety of process steps, a total of three use cases were selected due to the availability of data or due to identified process instabilities. For each of these three process steps, a use case was identified by conducting interviews with experts and the process-related operators. Out of the three developed use cases, one is being implemented, following the systematic approach presented within this paper", "venue": "International Electric Drives Production Conference", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2018-12-01", "journal": {"name": "2018 8th International Electric Drives Production Conference (EDPC)", "pages": "1-8"}, "authors": [{"authorId": "2448963", "name": "A. Kampker"}, {"authorId": "17723390", "name": "K. Kreisköther"}, {"authorId": "31367684", "name": "M. Büning"}, {"authorId": "2052742346", "name": "Tom Möller"}, {"authorId": "81411030", "name": "Sven Windau"}], "citations": [{"paperId": "754aeebf160db215c02e42665c83a62f6963e971", "title": "Machine Learning in Electric Motor Production - Potentials, Challenges and Exemplary Applications"}]}
