{"paperId": "d80fa32a43eccffbd4c2ffb5434ab5df7429588e", "publicationVenue": {"id": "dc95b805-f39c-43dd-bf0f-500edd72da12", "name": "F1000Research", "type": "journal", "issn": "2046-1402", "url": "https://f1000research.com/"}, "title": "Stacked deep analytic model for human activity recognition on a UCI HAR database", "abstract": "Background Owing to low cost and ubiquity, human activity recognition using smartphones is emerging as a trendy mobile application in diverse appliances such as assisted living, healthcare monitoring, etc. Analysing this one-dimensional time-series signal is rather challenging due to its spatial and temporal variances. Numerous deep neural networks (DNNs) are conducted to unveil deep features of complex real-world data. However, the drawback of DNNs is the un-interpretation of the network's internal logic to achieve the output. Furthermore, a huge training sample size (i.e. millions of samples) is required to ensure great performance. Methods In this work, a simpler yet effective stacked deep network, known as Stacked Discriminant Feature Learning (SDFL), is proposed to analyse inertial motion data for activity recognition. Contrary to DNNs, this deep model extracts rich features without the prerequisite of a gigantic training sample set and tenuous hyper-parameter tuning. SDFL is a stacking deep network with multiple learning modules, appearing in a serialized layout for multi-level feature learning from shallow to deeper features. In each learning module, Rayleigh coefficient optimized learning is accomplished to extort discriminant features. A subject-independent protocol is implemented where the system model (trained by data from a group of users) is used to recognize data from another group of users. Results Empirical results demonstrate that SDFL surpasses state-of-the-art methods, including DNNs like Convolutional Neural Network, Deep Belief Network, etc., with ~97% accuracy from the UCI HAR database with thousands of training samples. Additionally, the model training time of SDFL is merely a few minutes, compared with DNNs, which require hours for model training. Conclusions The supremacy of SDFL is corroborated in analysing motion data for human activity recognition requiring no GPU but only a CPU with a fast- learning rate.", "venue": "F1000Research", "year": 2021, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-10-15", "journal": {"name": "F1000Research", "volume": "10"}, "authors": [{"authorId": "145718367", "name": "Y. Pang"}, {"authorId": "2946027", "name": "L. Ping"}, {"authorId": "1881337", "name": "Goh Fan Ling"}, {"authorId": "1788756", "name": "S. Ooi"}, {"authorId": "122106919", "name": "W. Khoh"}], "citations": [{"paperId": "4f296e64eb23f4e0e37209abb7e866657515ed2d", "title": "Human Activity Recognition (HAR) Using Deep Learning: Review, Methodologies, Progress and Future Research Directions"}]}
