{"paperId": "d81432175109a5849500f130f258409001db3d62", "publicationVenue": {"id": "3096eb5c-d18c-4877-94cd-28edd3a9c357", "name": "International Journal of Environmental Research and Public Health", "type": "journal", "alternate_names": ["Int J Environ Res Public Health"], "issn": "1660-4601", "url": "http://www.mdpi.com/journal/ijerph/"}, "title": "Quantifying the Income-Increasing Effect of Digital Agriculture: Take the New Agricultural Tools of Smartphone as an Example", "abstract": "Smartphones are increasingly used in rural areas and have become indispensable new farming tools in farmers’ production and their lives. Based on data from the 2018 China Household Tracking Survey, this study uses ordinary least squares regression with two-stage least squares as a benchmark regression to investigate the impact of the extent of smartphone use on farm household income. Our findings are as follows. ① The degree of use of new smartphone farming tools has a significant income-increasing effect on farm households. ② There is variability in the impact of the use of new smartphone farming tools on the income of farmers in different regions. The highest income-generating effects on the use of smartphone tools were found in the western region, followed by the eastern region, with the smallest effects found in the central region. ③ Low-income farmers have the highest income effects from using new smartphone farming tools. We therefore recommend further improving the digital infrastructure in rural areas to give full play to the driving force of digital technology.", "venue": "International Journal of Environmental Research and Public Health", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-02-01", "journal": {"name": "International Journal of Environmental Research and Public Health", "volume": "20"}, "authors": [{"authorId": "2115606619", "name": "Xin Luo"}, {"authorId": "123084557", "name": "Shubin Zhu"}, {"authorId": "31403357", "name": "Zhenjiang Song"}], "citations": [{"paperId": "3a371134e586558d2662d936552202924372158f", "title": "Effects of digital agriculture solutions on smallscale wage workers and employment"}, {"paperId": "109cac6bc276415f58895f2a50c40322027b1d85", "title": "Research on Spatial-Temporal Characteristics and Affecting Factors of Agricultural Green Total Factor Productivity in Jiangxi Province"}]}
