{"paperId": "d81941e536b2f2d190534da334c57396129f8b5c", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Adversarial Machine Learning In Network Intrusion Detection Domain: A Systematic Review", "abstract": "Due to their massive success in various domains, deep learning techniques are increasingly used to design network intrusion detection solutions that detect and mitigate unknown and known attacks with high accuracy detection rates and minimal feature engineering. However, it has been found that deep learning models are vulnerable to data instances that can mislead the model to make incorrect classification decisions so-called (adversarial examples). Such vulnerability allows attackers to target NIDSs by adding small crafty perturbations to the malicious traffic to evade detection and disrupt the system's critical functionalities. The problem of deep adversarial learning has been extensively studied in the computer vision domain; however, it is still an area of open research in network security applications. Therefore, this survey explores the researches that employ different aspects of adversarial machine learning in the area of network intrusion detection in order to provide directions for potential solutions. First, the surveyed studies are categorized based on their contribution to generating adversarial examples, evaluating the robustness of ML-based NIDs towards adversarial examples, and defending these models against such attacks. Second, we highlight the characteristics identified in the surveyed research. Furthermore, we discuss the applicability of the existing generic adversarial attacks for the NIDS domain, the feasibility of launching the proposed attacks in real-world scenarios, and the limitations of the existing mitigation solutions.", "venue": "arXiv.org", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-12-06", "journal": {"name": "ArXiv", "volume": "abs/2112.03315"}, "authors": [{"authorId": "3454531", "name": "Huda Ali Alatwi"}, {"authorId": "2809687", "name": "C. Morisset"}], "citations": [{"paperId": "a7a20aa80aa2c80448e9a7083143bbd9b548c303", "title": "Sticky Fingers: Resilience of Satellite Fingerprinting against Jamming Attacks"}, {"paperId": "44188b0c5b03978142d17201defeba153357cc85", "title": "Unknown, Atypical and Polymorphic Network Intrusion Detection: A Systematic Survey"}, {"paperId": "c86ca2999f91ca19bd5f0df44719b08b10756603", "title": "The Impact of Dynamic Learning on Adversarial Attacks in Networks (IEEE CNS 23 Poster)"}, {"paperId": "4f71d51b8e296c7b7350a79d668adf6416144a0c", "title": "Cyberattacks in Smart Grids: Challenges and Solving the Multi-Criteria Decision-Making for Cybersecurity Options, Including Ones That Incorporate Artificial Intelligence, Using an Analytical Hierarchy Process"}, {"paperId": "b14cbfef2fc284e55bef5046411386ccddde286b", "title": "Improving the Robustness of DNNs-based Network Intrusion Detection Systems through Adversarial Training"}, {"paperId": "f9c61b60795b1231290aa2eeeb1e33053ebee661", "title": "Adversarial Evasion Attacks Practicality in Networks: Testing the Impact of Dynamic Learning"}, {"paperId": "758e3a823e255f0f84510d6af1d77553290db3c2", "title": "BHI: Embedded invisible watermark as adversarial example based on Basin-Hopping improvement"}, {"paperId": "0df4c4744f2ad9ba471fa157f277ef87cd88645e", "title": "Realism versus Performance for Adversarial Examples Against DL-based NIDS"}, {"paperId": "79040d4e0323c4b5e577af49e1fe732c363fe3e8", "title": "Effectiveness of Moving Target Defenses for Adversarial Attacks in ML-based Malware Detection"}, {"paperId": "6860a1df0d7e0ebb23315425759de74ab9fb9bec", "title": "Threat Modeling for Machine Learning-Based Network Intrusion Detection Systems"}, {"paperId": "3695ad49471498d472492d534906842973b6f3c4", "title": "A deep and systematic review of the intrusion detection systems in the fog environment"}, {"paperId": "e6e586fbc28dec92c4e858012d2923911811cfe0", "title": "Reflection based Distributed Denial of Service Attack Detection System"}, {"paperId": "915cc8c7d8cbec7cafc1a64375ece7d3e5d4d7a4", "title": "Mitigation of Black-Box Attacks on Intrusion Detection Systems-Based ML"}, {"paperId": "93e64e090c5d51ae70df240b918401c13642aeb0", "title": "Functionality-Preserving Adversarial Machine Learning for Robust Classification in Cybersecurity and Intrusion Detection Domains: A Survey"}, {"paperId": "662b2e2497b55bc6c14ffe96f1fcf2430b1bc7f6", "title": "Adversarial Machine Learning for Network Intrusion Detection Systems: A Comprehensive Survey"}]}
