{"paperId": "d81bec01a27fce9ceb4f7e9ed79bfbccf6b352e4", "publicationVenue": null, "title": "Automatic neural networks construction and causality ranking for faster and more consistent decision making", "abstract": "ABSTRACT The growth of Information Technologies in industrial contexts have resulted in data proliferation. These data often underlines useful information which can be of great benefit when it comes to decision-making. Key Performance Indicators (KPIs) act simultaneously as triggers and drivers for decision-making. When they deviate from their targets, decisions must be rapidly and well made. Therefore, experts need to understand the underlying relationships between KPIs deviations and operating conditions. However, they often interpret deviations empirically, or by following methods that may be time consuming, or not exhaustive. This article proposes a generic neural network-based approach for improving decision-making, by ensuring that decisions are consistent and made as early as possible. On the one hand, the proposal relies on improving KPIs deviations prediction, which is made possible thanks to the automatic construction of neural networks using neuro-evolution. On the other hand, the decision-making consistency is improved by identifying, among the operating conditions, contextual variables that most influence a given KPI of interest. This identification, which guide the decision-making process, is based on the analysis of the final weights of the neural network used for the KPI deviation prediction, given the contextual variables.", "venue": "International journal of computer integrated manufacturing (Print)", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-11-11", "journal": {"name": "International Journal of Computer Integrated Manufacturing", "pages": "735 - 755", "volume": "36"}, "authors": [{"authorId": "2017631876", "name": "Kenza Amzil"}, {"authorId": "1924173", "name": "E. Yahia"}, {"authorId": "2834575", "name": "Nathalie Klement"}, {"authorId": "2949473", "name": "L. Roucoules"}], "citations": [{"paperId": "4674921210ed4ebb2df56e0393a5a8e356f46693", "title": "Intelligent lung cancer MRI prediction analysis based on cluster prominence and posterior probabilities utilizing intelligent Bayesian methods on extracted gray-level co-occurrence (GLCM) features"}]}
