{"paperId": "d83974986a4c6fc986e03dfe3f3cb0a9e710fbd6", "publicationVenue": {"id": "b02cf974-33be-46bd-9cbc-022db6cb7151", "name": "IEEE International Conference on Software Maintenance and Evolution", "type": "conference", "alternate_names": ["Int Conf Sci Manag Eng", "IEEE Int Conf Softw Maint Evol", "ICSME", "International Conference Science, Management, and Engineering"], "url": "http://conferences.computer.org/icsm/"}, "title": "DeepOrder: Deep Learning for Test Case Prioritization in Continuous Integration Testing", "abstract": "Continuous integration testing is an important step in the modern software engineering life cycle. Test prioritization is a method that can improve the efficiency of continuous integration testing by selecting test cases that can detect faults in the early stage of each cycle. As continuous integration testing produces voluminous test execution data, test history is a commonly used artifact in test prioritization. However, existing test prioritization techniques for continuous integration either cannot handle large test history or are optimized for using a limited number of historical test cycles. We show that such a limitation can decrease fault detection effectiveness of prioritized test suites. This work introduces DeepOrder, a deep learning-based model that works on the basis of regression machine learning. DeepOrder ranks test cases based on the historical record of test executions from any number of previous test cycles. DeepOrder learns failed test cases based on multiple factors including the duration and execution status of test cases. We experimentally show that deep neural networks, as a simple regression model, can be efficiently used for test case prioritization in continuous integration testing. DeepOrder is evaluated with respect to time-effectiveness and fault detection effectiveness in comparison with an industry practice and the state of the art approaches. The results show that DeepOrder outperforms the industry practice and state-of-the-art test prioritization approaches in terms of these two metrics.", "venue": "IEEE International Conference on Software Maintenance and Evolution", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-09-01", "journal": {"name": "2021 IEEE International Conference on Software Maintenance and Evolution (ICSME)", "pages": "525-534"}, "authors": [{"authorId": "151459763", "name": "Aizaz Sharif"}, {"authorId": "1686499", "name": "D. Marijan"}, {"authorId": "3291576", "name": "Marius Liaaen"}], "citations": [{"paperId": "8f6fdbf399c18bd91c88436f0b4067a025122f77", "title": "Artificial Intelligence in Software Testing: A Systematic Review"}, {"paperId": "c957a4abba004739116e0ff05a695845f2d789a5", "title": "A Case Study on the “Jungle” Search for Industry-Relevant Regression Testing"}, {"paperId": "39bd108bac25cc26c0b8395ff7922fd917e37bb2", "title": "Revisiting Machine Learning based Test Case Prioritization for Continuous Integration"}, {"paperId": "bbf01ce7fea52987ae096b75328410019e5115a3", "title": "Semantic‐aware two‐phase test case prioritization for continuous integration"}, {"paperId": "b79c577ea0b3f1b3477e3268a19b06a50e9782d1", "title": "Accelerating Continuous Integration with Parallel Batch Testing"}, {"paperId": "ff4666a59b7ff89c08bda51e3173b540db2fe4ce", "title": "Integration test order generation based on reinforcement learning considering class importance"}, {"paperId": "3f06dcb2a0a153658dd894adfa8f1a2c5b598012", "title": "Systematic Literature Review on Application of Machine Learning in Continuous Integration"}, {"paperId": "5084a0d0bdebece0396027d9d886ddc3966ecea3", "title": "SoK: Machine Learning for Continuous Integration"}, {"paperId": "26512881b1ab514b96b6455a8d4261568814cad5", "title": "Semantic-based and Learning-based Regression Test Selection focusing on Test Objectives"}, {"paperId": "547e6fdb9684456f953d1b1bc8921b32086c7804", "title": "Post Prioritization Techniques to Improve Code Coverage for SARSA Generated Test Cases"}, {"paperId": "47789ae4698b57aa0d7c7a9406d56fc198cbcf4b", "title": "State of Practical Applicability of Regression Testing Research: A Live Systematic Literature Review"}, {"paperId": "49bbeb8c5da8761dc69df0f94687890e8faa5f9b", "title": "Focus on New Test Cases in Continuous Integration Testing based on Reinforcement Learning"}, {"paperId": "d66d45796f450ba72d787e3269a50c52fe97b045", "title": "Test Case Prioritization Using Partial Attention"}, {"paperId": "e15b09a8fff64a9e0745e5af1ea9f8b94e1627d2", "title": "Comparative study of machine learning test case prioritization for continuous integration testing"}, {"paperId": "bb98f9a054e66f7c7c49176b9a43b1a2215cc2e5", "title": "Industry–Academia Research Collaboration and Knowledge Co-creation: Patterns and Anti-patterns"}]}
