{"paperId": "d856d9b927297c0af12937bcd59ee779e9fd6612", "publicationVenue": {"id": "0d993d4a-09ba-4df8-90a4-7dfe25f0cb9e", "name": "ACM Transactions on Intelligent Systems and Technology", "type": "journal", "alternate_names": ["ACM Trans Intell Syst Technol"], "issn": "2157-6904", "url": "http://portal.acm.org/tist", "alternate_urls": ["https://tist.acm.org/"]}, "title": "Intelligent System of Game-Theory-Based Decision Making in Smart Sports Industry", "abstract": "Internet of Things (IoT) technology backed by Artificial Intelligence (AI) techniques has been increasingly utilized for the realization of the Industry 4.0 vision. Conspicuously, this work provides a novel notion of the smart sports industry for provisioning efficient services in the sports arena. Specifically, an IoT-inspired framework has been proposed for real-time analysis of athlete performance. IoT data is utilized to quantify athlete performance in the terms of probability parameters of Probabilistic Measure of Performance (PMP) and Level of Performance Measure (LoPM). Moreover, a two-player game-theory-based mathematical framework has been presented for efficient decision modeling by the monitoring officials. The presented model is validated experimentally by deployment in District Sports Academy (DSA) for 60 days over four players. Based on the comparative analysis with state-of-the-art decision-modeling approaches, the proposed model acquired enhanced performance values in terms of Temporal Delay, Classification Efficiency, Statistical Efficacy, Correlation Analysis, and Reliability.", "venue": "ACM Transactions on Intelligent Systems and Technology", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-04-22", "journal": {"name": "ACM Trans. Intell. Syst. Technol.", "pages": "29:1-29:23", "volume": "12"}, "authors": [{"authorId": "35071481", "name": "Munish Bhatia"}], "citations": [{"paperId": "1975b833cf898a2e455bcb13e4c9527da5253544", "title": "From Nash Q-learning to nash-MADDPG: Advancements in multiagent control for multiproduct flexible manufacturing systems"}, {"paperId": "980bc9509a6bc461c27fc106e4caac3b9af13d77", "title": "Real-Time Reliability Monitoring on Edge Computing: a Systematic Mapping"}, {"paperId": "bc985411d5e8520777585b4c20dcaa724d0a0d66", "title": "Investigation of Intelligent Service Mode of Digital Stadiums and Gymnasiums in the Context of Smart Cities"}, {"paperId": "209b42166d7ae999824e6f77d0977078b845e675", "title": "Decision support system for effective action recognition of track and field sports using ant colony optimization"}, {"paperId": "d76304d7be51aa935945f653476a5452a4609fe0", "title": "Application of Intelligent Sensor Network in the Assessment of Table Tennis Teaching and Training Intensity, Training Volume, and Physical Fitness"}, {"paperId": "2724ad6f3d18adc4b63a506d8947d2ffaaf4c77d", "title": "Human Sports Action and Ideological and PoliticalEvaluation by Lightweight Deep Learning Model"}, {"paperId": "0af678864667465212af22d57776b4cbbb1a95df", "title": "Analysis and applications of a bridge game"}, {"paperId": "6bf208031923563fc6413390be2a50522d9697ed", "title": "Intelligent Assistant Decision-Making Method for Power Enterprise Customer Service Based on IoT Data Acquisition"}, {"paperId": "6ae3a5577aa9c6419fc957569a50076f65cec35b", "title": "A Survey of Cyber-Physical Systems From a Game-Theoretic Perspective"}]}
