{"paperId": "d86b71af371f1114700cb9dc0760f006f1ce926a", "publicationVenue": {"id": "1016642f-e519-4a79-948d-0a64f5e5f5d1", "name": "EAI Endorsed Transactions on Smart Cities", "alternate_names": ["EAI Endorsed Trans Smart City"], "issn": "2518-3893", "url": "http://eai.eu/transaction/smart-cities", "alternate_urls": ["https://eudl.eu/issue/sc/1/1"]}, "title": "An Intelligent Machine Learning based Intrusion Detection System (IDS) for Smart cities networks", "abstract": "INTRODUCTION: Internet of Things (IoT) along with Cloud based systems are opening a new domain of development. They have several applications from smart homes, Smart farming, Smart cities, smart grid etc. Due to IoT sensors operating in such close proximity to humans and critical infrastructure, there arises privacy and security issues. Securing an IoT network is very essential and is a hot research topic. Different types of Intrusion Detection Systems (IDS) have been developed to detect and prevent an unauthorized intrusion into the network.OBJECTIVES: The paper presents a Machine Learning based light, fast and reliable Intrusion Detection System (IDS).METHODS: Multiple Supervised machine learning algorithms are applied and their results are compared. Algorithms applied include Linear Discriminant analysis, Quadratic Discriminant Analysis, XG Boost, KNN and Decision Tree.RESULTS: Simulation results showed that KNN Algorithm gives us the highest accuracy, followed by XG Boost and Decision Tree which are not far behind.CONCLUSION: A fast, secure and intelligent IDS is developed using machine learning algorithms. The resulting IDS can be used in various types of networks especially in IoT based networks.", "venue": "EAI Endorsed Transactions on Smart Cities", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-03-23", "journal": {"name": "EAI Endorsed Transactions on Smart Cities"}, "authors": [{"authorId": "2218626151", "name": "Muhammad Yaseen Ayub"}, {"authorId": "2106941540", "name": "Usman Haider"}, {"authorId": "145799864", "name": "Ali Haider"}, {"authorId": "2219120551", "name": "Muhammad Tehmasib Ali Tashfeen"}, {"authorId": "145377837", "name": "Hina Shoukat"}, {"authorId": "2176968297", "name": "Abdul Basit"}], "citations": [{"paperId": "84d411eb8cb116bcf686c3e762303fe2981360cd", "title": "A Survey on Intrusion Detection System in Smart City: Security Concerns"}, {"paperId": "d46c10ef77d0f996b9048e85d40fce53a922e636", "title": "A conjugate self-organizing migration (CSOM) and reconciliate multi-agent Markov learning (RMML) based cyborg intelligence mechanism for smart city security"}, {"paperId": "be8354d48af094e3bb2c89b5d256ec229c60bfe1", "title": "LeNet enabled intrusion detection system for iot- networks"}]}
