{"paperId": "d8768a342b7bee996349839da4350861d386f120", "publicationVenue": {"id": "7431ff67-91dc-41fa-b322-1b1ca657025f", "name": "International Conference on Information and Knowledge Management", "type": "conference", "alternate_names": ["Conference on Information and Knowledge Management", "Conf Inf Knowl Manag", "Int Conf Inf Knowl Manag", "CIKM"], "url": "http://www.cikm.org/"}, "title": "LuPe: A System for Personalized and Transparent Data-driven Decisions", "abstract": "Machine learning models are commonly used for decision support even though they are far from perfect, e.g., due to bias introduced by imperfect training data or wrong feature selection. While efforts are made and should continue to be put into developing better models, we will likely continue to rely on imperfect models in many applications. In these settings, how could we at least use the \"best\" model for an individual or a group of users and transparently communicate the risks and weaknesses that apply? We demonstrate LuPe, a system that addresses these questions. LuPe allows to optimize the choice of the applied model for subgroups of the population or individuals, thereby personalizing the model choice to best fit users' profiles, which improves fairness. LuPe further captures data to explain the choices made and the results of the model. We showcase how such data enable users to understand the system performance they can expect. This transparency helps users in making informed decisions or providing informed consent when such systems are used. Our demonstration will focus on several real-world applications showcasing the behavior of LuPe, including credit scoring and income prediction.", "venue": "International Conference on Information and Knowledge Management", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2019-11-03", "journal": {"name": "Proceedings of the 28th ACM International Conference on Information and Knowledge Management"}, "authors": [{"authorId": "51250765", "name": "Sarah Oppold"}, {"authorId": "143677452", "name": "Melanie Herschel"}], "citations": [{"paperId": "082c40adcd9264b775975fa22447cd1a06bd8ded", "title": "Applications of Explainable Artificial Intelligence in Finance—a systematic review of Finance, Information Systems, and Computer Science literature"}, {"paperId": "5fe95601ec41ee36197a639ff820d45e28bc1d18", "title": "Subgroup Invariant Perturbation for Unbiased Pre-Trained Model Prediction"}, {"paperId": "509038e15dbd12d9109180e5e0ed68182b3de02d", "title": "A System Framework for Personalized and Transparent Data-Driven Decisions"}]}
