{"paperId": "d87cc3c77807e9a3cdb63c008187a04aed387057", "publicationVenue": null, "title": "A conceptual replication of continuous integration pain points in the context of Travis CI", "abstract": "Continuous integration (CI) is an established software quality assurance practice, and the focus of much prior research with a diverse range of methods and populations. In this paper, we first conduct a literature review of 37 papers on CI pain points. We then conduct a conceptual replication study on results from these papers using a triangulation design consisting of a survey with 132 responses, 12 interviews, and two logistic regressions predicting Travis CI abandonment and switching on a dataset of 6,239 GitHub projects. We report and discuss which past results we were able to replicate, those for which we found conflicting evidence, those for which we did not find evidence, and the implications of these findings.", "venue": "ESEC/SIGSOFT FSE", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Review"], "publicationDate": "2019-08-12", "journal": {"name": "Proceedings of the 2019 27th ACM Joint Meeting on European Software Engineering Conference and Symposium on the Foundations of Software Engineering"}, "authors": [{"authorId": "35529938", "name": "D. Widder"}, {"authorId": "145007093", "name": "Michael C Hilton"}, {"authorId": "145832795", "name": "Christian Kästner"}, {"authorId": "2434621", "name": "Bogdan Vasilescu"}], "citations": [{"paperId": "2e3617718b7a73e091583b61f6ffdfeb719dcb66", "title": "Automated Test Case Repair Using Language Models"}, {"paperId": "9d94988ac6b3a02d289f0837cd3b8920a1d04b06", "title": "Uncovering the Causes of Emotions in Software Developer Communication Using Zero-shot LLMs"}, {"paperId": "e293b6588b6f154cf7f766ce7c4ff7ba6e93ad08", "title": "Quality Assurance Awareness in Open Source Software Projects on GitHub"}, {"paperId": "81715d7905d972078620dbfa37155f1012082e43", "title": "Analyzing the Impact of CI Sub-practices on Continuous Code Quality in Open-Source Projects: An Empirical Study"}, {"paperId": "33758a8ebb94bb8819376d2cf604d3072b65fc67", "title": "Test flakiness' causes, detection, impact and responses: A multivocal review"}, {"paperId": "eba513c489a3c90af72a5e7b28c0ea6bcfa0959b", "title": "An Empirical Study on Continuous Integration Trends, Topics and Challenges in Stack Overflow"}, {"paperId": "1a8ef041082ff117a0af3c2000ea402672bab239", "title": "On the usage, co-usage and migration of CI/CD tools: A qualitative analysis"}, {"paperId": "b49a3d0e3e22590887a6fc3c5dab4ee778ac5246", "title": "Optimizing Continuous Integration by Dynamic Test Proportion Selection"}, {"paperId": "9e88a6e3f1068fd4c265966167919d5de70feb55", "title": "HybridCISave: A Combined Build and Test Selection Approach in Continuous Integration"}, {"paperId": "bf2526fc177d072687b6aea37ea4ab197b0d40db", "title": "Test Flakiness' Causes, Detection, Impact and Responses: A Multivocal Review"}, {"paperId": "9b2d0100f60154650ea331002c7c6e09da4587d2", "title": "Who Writes Scholarly Code?"}, {"paperId": "dea3cac9612d5681f0b30579b6df9532ee1548e6", "title": "BuildSonic: Detecting and Repairing Performance-Related Configuration Smells for Continuous Integration Builds"}, {"paperId": "dd13bfd70228921f6d44f7d0dd317c55c125801c", "title": "A First Look at CI/CD Adoptions in Open-Source Android Apps"}, {"paperId": "178cfcb755b9440201dd4b5662ef250356fd1d18", "title": "On the Use of GitHub Actions in Software Development Repositories"}, {"paperId": "05e597d3111b188c9bff94c0b6a315cea3e58001", "title": "Characterizing the Usage of CI Tools in ML Projects"}, {"paperId": "1faf196cd74bed49a244c7036efca8d50f6b64a4", "title": "Investigating the Impact of Continuous Integration Practices on the Productivity and Quality of Open-Source Projects"}, {"paperId": "80b3c885415573cbdb33cd7ebd275db46ec3ea45", "title": "Accelerating Continuous Integration by Caching Environments and Inferring Dependencies"}, {"paperId": "4c6cceda79be8294e770debeaa822843f41ffca4", "title": "Decisions in Continuous Integration and Delivery: An Exploratory Study"}, {"paperId": "7de3bce19f19fcabea628f3e61381324e1279f88", "title": "Fixing Continuous Integration Tests From Within the IDE With Contextual Information"}, {"paperId": "d571264556e6d5b88bf2856ce0bd1756b1bbb545", "title": "Lessons from Eight Years of Operational Data from a Continuous Integration Service: An Exploratory Case Study of CircleCI"}, {"paperId": "8ef6c82648c81a69fe02dbb38869a32e7de761da", "title": "What Do Developer-Repaired Flaky Tests Tell Us About the Effectiveness of Automated Flaky Test Detection?"}, {"paperId": "062e7f87ecd0d145b28059a183fa3d523d82dee5", "title": "Redundancy, Context, and Preference: An Empirical Study of Duplicate Pull Requests in OSS Projects"}, {"paperId": "197d83b1a11088a00d3bace219b80df234bbd749", "title": "Which builds are really safe to skip? Maximizing failure observation for build selection in continuous integration"}, {"paperId": "1628b48ac0451357f373aa52b6cda68046882ef5", "title": "On the rise and fall of CI services in GitHub"}, {"paperId": "1fd17127fa6488ccd2d4e39dca8e566a82dc93c7", "title": "Reducing cost in continuous integration with a collection of build selection approaches"}, {"paperId": "6e76ab15c36ca5b74b2b2b5c9d9de254689f644d", "title": "Trust in Collaborative Automation in High Stakes Software Engineering Work: A Case Study at NASA"}, {"paperId": "e6c8e50fc573b7e2e09da29cc269d97239f1650f", "title": "What Helped, and what did not? An Evaluation of the Strategies to Improve Continuous Integration"}, {"paperId": "b422f47f401630b818b625446e7680a2ac025879", "title": "Heard it through the Gitvine: an empirical study of tool diffusion across the npm ecosystem"}, {"paperId": "82a0ba7a0a891f639a5af2295af5d8afeb4bf7e5", "title": "Questions for data scientists in software engineering: a replication"}, {"paperId": "7485ebfd250c34f30be63c03026fe6186db8f07e", "title": "A Cost-efficient Approach to Building in Continuous Integration"}, {"paperId": "5ff9d61ac42e4dd2b27dac28e16649329ba63847", "title": "Understanding the relationship between continuous integration and its effects on software quality outcomes"}, {"paperId": "b1debd250d9cf2e1cea7edb4a665d56dfab08a67", "title": "Learning from, Understanding, and Supporting DevOps Artifacts for Docker"}, {"paperId": "e4f4afac02dc4b0600d889751b2549642a4637b3", "title": "The Silent Helper: The Impact of Continuous Integration on Code Reviews"}, {"paperId": "eea24a35352d7a80305f189064593dbe76708a40", "title": "Trade-Off Exploration for Acceleration of Continuous Integration"}, {"paperId": "435b85d0a953d8c7e147536e426ac72f9a39b782", "title": "The Classics Never Go Out of Style An Empirical Study of Downgrades from the Bazel Build Technology"}]}
