{"paperId": "d87f10aeab9fa14344c6393759e44269b80b4c56", "publicationVenue": {"id": "1124d164-490d-4da9-b0c2-ce8a8dc98202", "name": "BigData Congress [Services Society]", "type": "conference", "alternate_names": ["BigData", "Bigdata Congr [services Soc", "IEEE Int Conf Big Data", "IEEE International Conference on Big Data", "Int Congr Big Data", "International Congress on Big Data", "Bigdata Congr", "BigData Congress"]}, "title": "More than Just a Diagnosis: A Multi-Task Approach to Analyzing Bipolar Disorder on Reddit via DeMHeM", "abstract": "Mental health conditions affect millions of people today. While existing work on predicting mental health conditions from social media text focuses largely on depression and similar conditions, other less prominent disorders like bipolar tend not to receive in-depth analysis. Furthermore, these works tend not to analyze or model the correlated nature of these different disorders and conditions. To account for the coexistence and correlation of multiple mental health conditions, this paper introduces DeMHeM, a novel multitask framework designed for the descriptive classification of bipolar and related mental health topics on online platforms like Reddit. By treating each mental health category as a separate task, DeMHeM leverages both the shared latent and task-specific semantic feature space by integrating sentence-level and topic-level embeddings. It further incorporates Focal Loss for joint learning, inter-task parameter sharing, and regularization decay to optimize the prediction for the naturally skewed imbalanced dataset. Hence, the model distinguishes between different mental health categories and also models the correlation among them by categorizing each post into potentially multiple mental health categories. Next, we focus on a more insightful analysis by leveraging the predicted outcome of the model to study how the discussions differ based on the type and coexistence of different mental disorders. We analyze the entirety of the “r/bipolar” subreddit by applying our trained model to predict a category and then implementing keyword extraction techniques on each predicted combination of mental health conditions to understand the specific nuances in the discussion of bipolar disorder. Our results show that DeMHeM surpassed the baseline models and can be used to understand the multi-faceted discussion of mental health topics for a given community.", "venue": "BigData Congress [Services Society]", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-12-15", "journal": {"name": "2023 IEEE International Conference on Big Data (BigData)", "pages": "5014-5023"}, "authors": [{"authorId": "2280874404", "name": "Rocco Zhang"}, {"authorId": "2153583242", "name": "Shailik Sarkar"}, {"authorId": "1471374166", "name": "Abdulaziz Alhamadani"}, {"authorId": "2249846867", "name": "Chang-Tien Lu"}], "citations": []}
