{"paperId": "d8933a5f757ee3143495bd778c01a67dca719b23", "publicationVenue": {"id": "f32b7322-b69c-4e63-801d-8f50784ef778", "name": "Computational Intelligence and Neuroscience", "type": "journal", "alternate_names": ["Comput Intell Neurosci"], "issn": "1687-5265", "url": "https://www.hindawi.com/journals/cin/"}, "title": "The Construction and Effect Analysis of Nursing Safety Quality Management Based on Data Mining", "abstract": "Data mining belongs to knowledge discovery, which is the process of revealing hidden, unknown, and valuable information from a large amount of fuzzy application data. The potential information revealed by data mining can help decision-makers adjust market strategies and reduce market risks. The information mined can be the discovery of a particular study and little known, which must be based on the principle of truth. Nursing safety means that during nursing work, the nursing staff must strictly follow the nursing system and operating procedures, accurately execute doctor's orders, implement nursing plans, and ensure that patients get physical and mental safety during treatment and recovery. This paper aims to explore the construction of nursing safety quality management system and its effect analysis based on data mining. It is hoped that improvements in hospital nursing processes will provide better nursing services for patients using data mining techniques. This paper uses the FP algorithm to mine the data set and generates frequent itemsets, proposes and implements the association rule mining algorithm, and obtains the association rules with practical reference value. This article analyzes the current status and existing problems of nursing management, and puts forward some problems existing in the current nursing management staff's own quality, nursing quality system standards, and nursing management system. The experimental results in this article show that there are 42 cases of poor nursing due to lack of basic medical knowledge, accounting for 52%; there are 12 cases of poor nursing due to their own diseases, accounting for 15%; there were 7 cases of poor nursing due to lack of communication, accounting for 9%; there were 15 cases of poor nursing caused by unreasonable use of restraint devices, accounting for 19%. From these data, it can be seen that patients need to have basic medical knowledge and act in strict accordance with doctors' orders. Family members also need to accompany the patients more and cooperate with all parties in order to maximize the effectiveness of care.", "venue": "Computational Intelligence and Neuroscience", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-06-02", "journal": {"name": "Computational Intelligence and Neuroscience", "volume": "2022"}, "authors": [{"authorId": "2120448116", "name": "Yimei Yang"}, {"authorId": "49873224", "name": "Yanhong Deng"}, {"authorId": "2108557243", "name": "Haimei Zhang"}], "citations": []}
