{"paperId": "d8a7b5c50cec40741c6cb441081ed8d2dc985edd", "publicationVenue": {"id": "4b286843-08aa-4a09-8cea-da0454f19cd4", "name": "Physiological Measurement", "type": "journal", "alternate_names": ["Physiol Meas"], "issn": "0967-3334", "url": "http://www.iop.org/EJ/journal/0967-3334", "alternate_urls": ["https://iopscience.iop.org/0967-3334"]}, "title": "A practical approach to storage and retrieval of high-frequency physiological signals", "abstract": "Objective: Storage of physiological waveform data for retrospective analysis presents significant challenges. Resultant data can be very large, and therefore becomes expensive to store and complicated to manage. Traditional database approaches are not appropriate for large scale storage of physiological waveforms. Our goal was to apply modern time series compression and indexing techniques to the problem of physiological waveform storage and retrieval. Approach: We deployed a vendor-agnostic data collection system and developed domain-specific compression approaches that allowed long term storage of physiological waveform data and other associated clinical and medical device data. The database (called AtriumDB) also facilitates rapid retrieval of retrospective data for high-performance computing and machine learning applications. Main results: A prototype system has been recording data in a 42-bed pediatric critical care unit at The Hospital for Sick Children in Toronto, Ontario since February 2016. As of December 2019, the database contains over 720,000 patient-hours of data collected from over 5300 patients, all with complete waveform capture. One year of full resolution physiological waveform storage from this 42-bed unit can be losslessly compressed and stored in less than 300 GB of disk space. Retrospective data can be delivered to analytical applications at a rate of up to 50 million time-value pairs per second. Significance: Stored data are not pre-processed or filtered. Having access to a large retrospective dataset with realistic artefacts lends itself to the process of anomaly discovery and understanding. Retrospective data can be replayed to simulate a realistic streaming data environment where analytical tools can be rapidly tested at scale.", "venue": "Physiological Measurement", "year": 2020, "fieldsOfStudy": ["Physics", "Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-03-04", "journal": {"name": "Physiological Measurement", "volume": "41"}, "authors": [{"authorId": "49829882", "name": "Andrew J. Goodwin"}, {"authorId": "1954568", "name": "D. Eytan"}, {"authorId": "49415411", "name": "R. Greer"}, {"authorId": "13131345", "name": "M. Mazwi"}, {"authorId": "1884814", "name": "Anirudh Thommandram"}, {"authorId": "144890784", "name": "S. Goodfellow"}, {"authorId": "145734694", "name": "A. Assadi"}, {"authorId": "10682219", "name": "A. Jegatheeswaran"}, {"authorId": "144002782", "name": "P. Laussen"}], "citations": [{"paperId": "2d66e1b9d44928a05f84ae2e51e0160146f756c4", "title": "The role of compression in large scale data transfer and storage of typical biomedical signals at hospitals."}, {"paperId": "319c13496356b230d0b102c6633642dafc60ef5c", "title": "Exploring the clinical relevance of vital signs statistical calculations from a new-generation clinical information system"}, {"paperId": "40fa4a9c47e461dc4935cfb6479cc784e7dcd623", "title": "The truth Hertz—synchronization of electroencephalogram signals with physiological waveforms recorded in an intensive care unit"}, {"paperId": "4d05082948fe5eb187753b9629f540aad9d68291", "title": "iCVS—Inferring Cardio-Vascular hidden States from physiological signals available at the bedside"}, {"paperId": "ce3744c2841ca146888635512feece5053a9e2ce", "title": "A Framework for the Design, Development, Testing and Deployment of Reliable Big Data Platforms"}, {"paperId": "09bd08af0f2149b1f91a3afd31db867071e771af", "title": "Optimized Arterial Line Artifact Identification Algorithm Cleans High-Frequency Arterial Line Data With High Accuracy in Critically Ill Patients"}, {"paperId": "65e7593ea14377a246908402ee6b1f8a5d5c04f1", "title": "Timing errors and temporal uncertainty in clinical databases—A narrative review"}, {"paperId": "e42ef7a8f17206c62a24bb0752c70096fff3abb4", "title": "An integration engineering framework for machine learning in healthcare"}, {"paperId": "7fa371b5ca16be72d077353b64ad478d88fe546e", "title": "Variations among Electronic Health Record and Physiologic Streaming Vital Signs for Use in Predictive Algorithms in Pediatric Severe Sepsis"}, {"paperId": "d5a0642d23299159fefd4f47dc597ce26ad70ef1", "title": "System of integrating biosignals during hemodialysis: the CONTINUAL (Continuous mOnitoriNg viTal sIgN dUring hemodiALysis) registry"}, {"paperId": "bf31a92926bdce2aaf17ac2e1a766cefe2c4e456", "title": "A Decoupled Data Pipeline and its Reliability Assessment: Case Study in Extreme Climatic Humans Studies"}, {"paperId": "fd84f846debbba054122a5944439ecc2dd3e0aa6", "title": "Blood Pressure in Critically Ill Children: Exploratory Analyses of Concurrent Invasive and Noninvasive Measurements"}, {"paperId": "bebfccb793143cb0b6745336ae3c61cd74456ee4", "title": "PERSONALITY ANALYSIS PROFILE TRAINER WITH DISC METHOD AS A DETERMINANT OF PSYCHOLOGICAL TEST FOR SELECTION OF CANDIDATES FOR TRAINERS AT AL AZHAR - DEPOK MAS"}, {"paperId": "916f3c756d76aba9b33fb9d86e678de08d95c355", "title": "A highly scalable repository of waveform and vital signs data from bedside monitoring devices"}, {"paperId": "9d863b80cdb1b568971d044d1cb63a5553476d1a", "title": "Graph Representation Integrating Signals for Emotion Recognition and Analysis"}, {"paperId": "6e6a7ec1d0b46d05b93a5d10a61f2438f8342453", "title": "Hemodynamic Patterns Before Inhospital Cardiac Arrest in Critically Ill Children: An Exploratory Study"}, {"paperId": "13ec5bfa2c92499a1ec4ecd249538f62bd433517", "title": "LifeStream: a high-performance stream processing engine for periodic streams"}, {"paperId": "4edb9a91f3bfab48366c55d65099f2da4f5800af", "title": "Robust Machine Learning in Critical Care — Software Engineering and Medical Perspectives"}, {"paperId": "e782479449ba805a85cf3e2073d95b675cd82dec", "title": "Wireless skin sensors for physiological monitoring of infants in low-income and middle-income countries."}, {"paperId": "8a5dfb76be6fff48aca426b486b5578c433bbdb4", "title": "LifeStream: A High-performance Stream Processing Engine for Waveform Data"}, {"paperId": "d1a4f444e6dbe56e80a9599a20abff63401b6561", "title": "Sharing and learning through the Pediatric Cardiac Critical Care Consortium: Moving toward precision care"}, {"paperId": "a1b2383a5d0af2db94bac5cf745a3575710354a4", "title": "How to validate Machine Learning Models Prior to Deployment: Silent trial protocol for evaluation of real-time models at ICU"}, {"paperId": "f7857072da489a4056345a1e09135d144968ea56", "title": "Cloud Computing, Big Data & Emerging Topics: 8th Conference, JCC-BD&ET 2020, La Plata, Argentina, September 8-10, 2020, Proceedings"}, {"paperId": "d3de396b898e5c703f7c4d8e4385cd5e2b48d8c7", "title": "Data Management Optimization in a Real-Time Big Data Analysis System for Intensive Care"}]}
