{"paperId": "d8b0033c5c67d2fd3376394add6e389f6550b56a", "publicationVenue": {"id": "c6b969a5-d295-4c65-bbe8-a2dc52990db8", "name": "IEEE transactions on fuzzy systems", "type": "journal", "alternate_names": ["IEEE trans fuzzy syst", "IEEE Trans Fuzzy Syst", "IEEE Transactions on Fuzzy Systems"], "issn": "1063-6706", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=91"}, "title": "Hyperplane Division in Fuzzy C-Means: Clustering Big Data", "abstract": "Big data with a large number of observations (samples) have posed genuine challenges for fuzzy clustering algorithms and fuzzy C-means (FCM), in particular. In this article, we propose an original algorithm referred to as a hyperplane division method to split the entire data set into disjoint subsets. By disjoint subsets, we mean that the data subspaces (parts of the entire data space), each of which is supported or spanned by the data points in the corresponding subset, do not overlap each other. The disjoint subsets turned out to be beneficial to the improvement of the quality of the clusters formed by the clustering algorithms. Moreover, considering that either a large number (say, thousands) or a small number (say, a few) of clusters may be pursued in the clustering task, we propose corresponding strategies (based on the hyperplane division method) to make clustering processes feasible, efficient, and effective. By validating the proposed strategies on both synthetic and publicly available data, we show their superiority (in terms of both efficiency and effectiveness) manifested in a visible way over the method of clustering the entire data and over some representative big data clustering methods.", "venue": "IEEE transactions on fuzzy systems", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-11-01", "journal": {"name": "IEEE Transactions on Fuzzy Systems", "pages": "3032-3046", "volume": "28"}, "authors": [{"authorId": "144471968", "name": "Yinghua Shen"}, {"authorId": "1731634", "name": "W. Pedrycz"}, {"authorId": "2144033936", "name": "Yuan Chen"}, {"authorId": "8415699", "name": "Xianmin Wang"}, {"authorId": "1684783", "name": "A. Gacek"}], "citations": [{"paperId": "b5956c98efcb9537e273e1de79051fc188be2754", "title": "An Efficient Federated Multiview Fuzzy C-Means Clustering Method"}, {"paperId": "4a290488baa8726008b95658e8339132359b9117", "title": "Deep Fuzzy Envelope Sample Generation Mechanism for Imbalanced Ensemble Classification"}, {"paperId": "600824796b323b6cd57b951b436069e1f96808aa", "title": "Granular fuzzy rule-based models construction under the collaboration of multiple organizations"}, {"paperId": "1e16a9f45b65dfa80323610ebabd7d280df8d58d", "title": "Scalable Fuzzy Clustering With Anchor Graph"}, {"paperId": "9509db5b24e0c7732727ae19a653820d7323de83", "title": "A study of glass classification and identification based on K-means clustering and Euclidean distance"}, {"paperId": "853274922709a272ad9c3ae849a4eb86f389b979", "title": "Collaborative Fuzzy Linguistic Learning to Low-Resource and Robust Decision System Based on Bounded Rationality"}, {"paperId": "0b3ec2d81727b1a2692bd4ae065e97684178fb7e", "title": "A Sparse Framework for Robust Possibilistic K-Subspace Clustering"}, {"paperId": "a41c836f09ea8ce03b33d1d5207f363ab27065bd", "title": "Reliable Detection of Transmit-Antenna Number for MIMO Systems in Cognitive Radio-Enabled Internet of Things"}, {"paperId": "45755b9593f4b05bfd5e0dff8e8bbfb4f3f15b8a", "title": "Envelope imbalanced ensemble model with deep sample learning and local-global structure consistency"}, {"paperId": "2b274069dfd8bd1bcbd1afec1cd9cc231422064b", "title": "Parallel gravitational clustering based on grid partitioning for large-scale data"}, {"paperId": "aaf4a3b461690f81c48da4dd00894bece7517f77", "title": "ISBFK-means: A new clustering algorithm based on influence space"}, {"paperId": "945750d7bac9e6c0e5886659e4677c8b7b179758", "title": "An Online Weighted Bayesian Fuzzy Clustering Method for Large Medical Data Sets"}, {"paperId": "131edb450c975d5acdec2e7cd67f9f714da7c744", "title": "Fast Fuzzy Clustering Based on Anchor Graph"}, {"paperId": "3c425eb039694012f7f15fd201a7ffab8d8ea136", "title": "Identification of Fuzzy Rule-Based Models With Collaborative Fuzzy Clustering"}, {"paperId": "96c25e0c1659f430faac0cbf1c2172f5195490a2", "title": "A hybrid interval type-2 semi-supervised possibilistic fuzzy c-means clustering and particle swarm optimization for satellite image analysis"}, {"paperId": "698208495d9ff5201fcb04f3d686409d53877153", "title": "SFCM: A Fuzzy Clustering Algorithm of Extracting the Shape Information of Data"}, {"paperId": "cd583c10e85cf08b09274efc0ccb3366848c2469", "title": "High-Dimensional Data Clustering with Fuzzy C-Means: Problem, Reason, and Solution"}, {"paperId": "638a0f2a314bbe64eddba49cd2951bf29118da4d", "title": "A Machine Learning-based Framework for Preventive Maintenance of Sewer Pipe Systems"}, {"paperId": "6caee3f40cfe436093272bcccfc700abae72c291", "title": "Privacy-Preserving High-Order Possibilistic C-Means Algorithm For Big Data Clustering Performance"}]}
