{"paperId": "d8bdfdf7e0f196346b622c66baa8426fa14418c7", "publicationVenue": null, "title": "An Optimization Method for Integrating Educational Information Resources Based on Edge Computing", "abstract": "This paper adopts an edge computing approach to conduct in-depth research and analysis on the optimization of educational information resource integration and constructs an integrated teaching resource design model concerning the integrated teaching model, human-centered mobile learning resource design, and the interdisciplinary concept of physics subject teaching method. The learning field constituted by the model is divided into two parts, the explicit field and the potential field and then designs a five-stage teaching resource based on the model. A five-stage teaching resource development path was designed based on the model. Based on the cloud service center model, we propose a hierarchical mechanism for sharing educational information resources and analyze how each hierarchical entity constructs and shares resources and the rights and responsibilities of each hierarchical entity; we explain the meaning and functions of the personalized educational resource integrated development environment provided by the cloud service center for users. The dynamic evaluation model of the value of educational information resources is summarized and proposed for the resource exchange behavior in the sharing of educational information resources, and the significance of the calculation method of resource value, parameter values, and resource value difference for resource sharing is introduced. Firstly, the mechanism for coconstruction of educational information resources at different levels is proposed, and the construction tasks of subjects at different levels in the process of coconstruction and sharing of resources are elaborated. The sharing mechanism of educational information resources covering the regularization system, evaluation mechanism, incentive mechanism, problem handling mechanism, and supporting service mechanism is proposed, and a dynamic evaluation model of the value of educational information resources is designed to improve the enthusiasm of the coconstruction and sharing subjects.", "venue": "J. Sensors", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-07-19", "journal": {"name": "J. Sensors", "pages": "1-12", "volume": "2022"}, "authors": [{"authorId": "1768776895", "name": "Xufen Hua"}], "citations": [{"paperId": "8be2363e3457f2c4213ea85f1fd56379ddf07a4e", "title": "Retracted: An Optimization Method for Integrating Educational Information Resources Based on Edge Computing"}, {"paperId": "ef5ea2f57188eb537b88c7f59aecfc13d4452897", "title": "Optimization Simulation of Balanced Distribution of Multimedia Network Modular Teaching Resources"}]}
