{"paperId": "d8c6b34e34d0017ce76bfc0a21407ba5f268e054", "publicationVenue": null, "title": "Data Management and Analytics System for Online Flight Conformance Monitoring and Anomaly Detection", "abstract": "Air Navigation Service Providers (ANSP) worldwide have been making a considerable effort for the development of a better method to monitor conformance to the planned routes and detect anomalies within a particular airspace. Conformance monitoring and anomaly detection are crucial for a better managed airspace, both strategically and tactically, yielding a higher level of automation and thereby reducing the air traffic controller's workload. Although the prior approaches with limited amount of static air traffic data have been able to address the problem to some extent, data management and query processing of ever-increasing vast volume of streaming air traffic data at high rates for online conformance monitoring and anomaly detection still remain a challenge. In this paper, we present a novel data management and analytics system to continuously conformance monitor flights and accurately detect anomalies within the National Airspace System (NAS). The incoming Traffic Flow Management (TFM) data is streaming, big, uncorrelated and noisy. In the overall data pipeline, the system monitors flights and detects anomalies in 3 steps: In the preprocessing step, the system continuously processes the incoming raw flight data and makes it available for the next step where an interim Key-Value data store is created and maintained for efficient query processing. In the final step, the system learns from historical trajectories and pertinent weather parameters and builds a Long Short-Term Memory (LSTM) model. As the flights progress, the non-conforming trajectory segments as part of the live data stream are raised as anomalies. Evaluations on real air traffic and weather data in the U.S. verify that our system efficiently and accurately detects anomalies.", "venue": "SIGSPATIAL/GIS", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2019-11-05", "journal": {"name": "Proceedings of the 27th ACM SIGSPATIAL International Conference on Advances in Geographic Information Systems"}, "authors": [{"authorId": "1691974", "name": "S. Ayhan"}, {"authorId": "1719385", "name": "H. Samet"}], "citations": [{"paperId": "4f1aa59af01f0a1c61a2938fbdb73b1c21504257", "title": "Evaluation of the Four-Dimensional Trajectory Live Flight Demonstration (4DT LFD) Project"}]}
