{"paperId": "d8cc3da594b0aba53825e30d1ea45d223bbb346c", "publicationVenue": {"id": "ebf782ec-36b7-473b-9a53-b42829baa24a", "name": "Crohn's & Colitis 360", "type": "journal", "alternate_names": ["Crohn's  Colitis 360"], "issn": "2631-827X"}, "title": "Treatment Patterns and Standardized Outcome Assessments Among Patients With Inflammatory Conditions of the Pouch in a Prospective Multicenter Registry", "abstract": "Abstract Background Much of our understanding about the natural history of pouch-related disorders has been generated from selected populations. We designed a geographically diverse, prospective registry to study the disease course among patients with 1 of 4 inflammatory conditions of the pouch. The primary objectives in this study were to demonstrate the feasibility of a prospective pouch registry and to evaluate the predominant treatment patterns for pouch-related disorders. Methods We used standardized diagnostic criteria to prospectively enroll patients with acute pouchitis, chronic antibiotic-dependent pouchitis (CADP), chronic antibiotic refractory pouchitis (CARP), or Crohn’s disease (CD) of the pouch. We obtained detailed clinical and demographic data at the time of enrollment, along with patient-reported outcome (PRO) measures. Results We enrolled 318 patients (10% acute pouchitis, 27% CADP, 12% CARP, and 51% CD of the pouch). Among all patients, 55% were on a biologic or small molecule therapy. Patients with CD of the pouch were more likely to use several classes of therapy (P < .001). Among patients with active disease at the time of enrollment, 23% with CARP and 40% with CD of the pouch were in clinical remission at 6 months after enrollment. Conclusions In a population where most patients had refractory inflammatory conditions of the pouch, we established a framework to evaluate PROs and clinical effectiveness. This infrastructure will be valuable for long-term studies of real-world effectiveness for pouch-related disorders.", "venue": "Crohn's & Colitis 360", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-07-01", "journal": {"name": "Crohn's & Colitis 360", "volume": "4"}, "authors": [{"authorId": "143643521", "name": "E. Barnes"}, {"authorId": "3009349", "name": "P. Deepak"}, {"authorId": "1398642018", "name": "P. Beniwal-Patel"}, {"authorId": "13722682", "name": "L. Raffals"}, {"authorId": "1737286", "name": "M. Kayal"}, {"authorId": "3407152", "name": "M. Dubinsky"}, {"authorId": "49946470", "name": "Shannon Chang"}, {"authorId": "49200163", "name": "P. Higgins"}, {"authorId": "2121808023", "name": "Jennifer I. Barr"}, {"authorId": "3773706", "name": "J. Galanko"}, {"authorId": "50823454", "name": "Yue Jiang"}, {"authorId": "81962307", "name": "R. Cross"}, {"authorId": "1679719", "name": "M. Long"}, {"authorId": "5487355", "name": "H. Herfarth"}], "citations": [{"paperId": "0dd97f6825986a7df57c6d6bd372a2993cd0ea5c", "title": "AGA Clinical Practice Guideline on the Management of Pouchitis and Inflammatory Pouch Disorders."}, {"paperId": "5793db8fa7a9c28fe85216816454fbf8769ff5a8", "title": "Dietary Patterns Are Not Associated With Disease Activity Among Patients With Inflammatory Conditions of the Pouch in a Prospective Cohort"}]}
