{"paperId": "d8d8d92281a9df83066684fa1f4efb00440e3e76", "publicationVenue": {"id": "166fd2b5-a928-4a98-a449-3b90935cc101", "name": "IACR Cryptology ePrint Archive", "type": "journal", "alternate_names": ["IACR Cryptol eprint Arch"], "url": "http://eprint.iacr.org/"}, "title": "Zero-day vulnerability prevention with recursive feature elimination and ensemble learning", "abstract": "This research addresses the challenge of identifying and preventing novel network threats by optimising the UGRansome dataset for real-time anomaly detection. Util-ising a hybridised approach involving naïve tree-based ensemble machine learning and recursive feature elimination (RFE), the study achieves a balanced accuracy of 97%, with naïve Bayes (NB) emerging as the most effective classifier. The proposed framework, combining gradient boosting (GB) and random forest (RF) as base models with NB as a blender, proves successful in detecting and preventing zero-day vulnerabilities. UGRansome makes a substantial impact by successfully preventing more than 100 kbps of malicious traffic using features extracted by the RFE technique. This is achieved through the utilisation of uniform resource locators (URLs) extracted by the RFE model, surpassing the performance of existing Intrusion Detection System (IDS) datasets. Secure shell attacks are notably thwarted, showcasing the dataset’s efficacy in enhancing network security. The study highlights significant advancements in intrusion detection techniques. The NB model exhibits exceptional performance, surpassing other models in accuracy, precision, and recall across all classes, especially in zero-day vulnerability classification. Additionally, the proposed naïve tree-based ensemble model demonstrates remarkable accuracy and stands out as the top-performing technique among all models studied. Implementation of the UGRansome properties-based rule resulted in discernible changes in traffic classification, reducing unknown traffic while increasing unclassified traffic, warranting further investigation.", "venue": "IACR Cryptology ePrint Archive", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IACR Cryptol. ePrint Arch.", "pages": "1843", "volume": "2023"}, "authors": [{"authorId": "2273185429", "name": "Mike Wa Nkongolo"}], "citations": []}
