{"paperId": "d8e15fcdef155b88ad460bab169ec75022d6d613", "publicationVenue": null, "title": "Valorando la simbiosis entre Big Data y las redes 5G, un nuevo concepto llamado Wireless Big Data", "abstract": "La explosión mediática que ha tenido el término Big Data, en la actualidad, nos ha conducido a considerarla como una herramienta tecnológica indispensable para el desarrollo y la sostenibilidad de los múltiples aspectos de la sociedad moderna, tales como: la salud pública, la economía, la política y la gestión de recursos, por citar algunos de ellos. Sin embargo, las capacidades tecnológicas actuales dificultan su plena implementación, debido en esencia a las características que exhibe Big Data, definidas en [1-2], como las 4v (volumen, velocidad, variedad y valor), lo cual crea un nuevo horizonte científico encaminado a resolver este inconveniente. Floreciendo en este nuevo terreno científico, se encuentran nuevos paradigmas tecnológicos, tal como lo expone Zhang et al, en [3], que considera que las características potencializadas de las nuevas redes inalámbricas 5G jugarían un papel predominante en la cadena de procesamiento de Big Data, en especial, se aprovecharía su cobertura ubicua, las posibilidades de almacenamiento al interior de la red, y su inherente capacidad computacional. Por ejemplo, el Internet de las cosas (IoT, por sus siglas en inglés) o los dispositivos móviles pueden ayudar a recolectar datos, mientras el soporte tecnológico enfocado en las características de almacenamiento, del tipo caché, y sus recursos computacionales podrían, de forma local, almacenar y procesar los datos para su compresión y acumulación. De este modo, las redes inalámbricas 5G actuarían como el puente entre las fuentes de datos y los centros de datos, como se muestra en la Figura 1. Con el fin de prestar un mejor apoyo al concepto de Big Data, autores como Wang y Andreev, en [4] y [5], respectivamente, proponen que las redes inalámbricas 5G deberán tener consideraciones de diseño y operación basadas en los requerimientos sustanciales de Big Data. En particular, deben enfocarse en la manipulación de grandes volúmenes de datos, para lo cual la capacidad de la red debe incrementarse de forma significativa. Además, para soportar la velocidad y la variedad de los datos, la red deberá soportar esquemas diferenciables, que se aprovisionen por medio de la integración apropiada de los recursos de red, en términos de latencia, seguridad y confiabilidad. Por su parte, Big Data podría mejorar el desempeño de la red inalámbrica 5G por medio de su componente de analítica de datos; lo cual proporcionaría el conocimiento y la agudeza en los datos para, de forma eficiente, gestionar los recursos de red, maximizando la ganancia del sistema e incrementando la experiencia de los usuarios. Lo anterior, permite ver la simbiosis entre Big Data y 5G desde dos perspectivas diferentes, en primer lugar, desde una perspectiva de red, donde la extracción de las distribuciones espacio-temporales del tráfico permitirían mejorar su balance de forma óptima, y, en segundo lugar, desde la perspectiva de usuario, donde la extracción de los patrones de uso, hábitos, patrones de movilidad y sus preferencias, ayudarían a proporcionar servicios consientes del contexto, mejorando la experiencia del usuario.", "venue": "", "year": 2018, "fieldsOfStudy": ["Sociology"], "publicationTypes": null, "publicationDate": "2018-06-01", "journal": {"name": "", "pages": "7-8", "volume": "12"}, "authors": [{"authorId": "89789739", "name": "Leonardo Fabio Yepes Arbeláez"}], "citations": []}
