{"paperId": "d8e4a8307d3dac7160776cc619767076ad8d4599", "publicationVenue": null, "title": "Cost-efficient Task Scheduling for Parallel Applications on Heterogeneous Cloud Environment", "abstract": "As an efficient way to provide computing resource and services to customers on demand, cloud computing has become more and more popular. From cloud customer perspective, computing cost is a sensitive consideration and it is mainly determined by the scheduling policy of a cloud service platform for parallel applications. In this paper, we present a novel scheduling algorithm for a bounded number of heterogeneous computing nodes with an objective to minimize the computing cost for scheduling DAGs (Directed Acyclic Graph) on the heterogeneous cloud platform, which is called the Search and Earliest Finish Time (SEFT) algorithm. The SEFT algorithm comprises two phases: 1) search and build the set of computing nodes with the cheapest cost; 2) plan task scheduling. Furthermore, the algorithm assigns tasks by their decrease order of the rank values to the computing node that minimizes EFT (Earliest Finish Time) of tasks based on insertion policy. The experimental results show that our proposed approach can not only guarantee the service quality of the application, but also obtain the lower computing cost than the existing approaches.", "venue": "2019 IEEE 21st International Conference on High Performance Computing and Communications; IEEE 17th International Conference on Smart City; IEEE 5th International Conference on Data Science and Systems (HPCC/SmartCity/DSS)", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-08-01", "journal": {"name": "2019 IEEE 21st International Conference on High Performance Computing and Communications; IEEE 17th International Conference on Smart City; IEEE 5th International Conference on Data Science and Systems (HPCC/SmartCity/DSS)", "pages": "1651-1657"}, "authors": [{"authorId": "2157153502", "name": "Weihong Chen"}, {"authorId": "41185076", "name": "Weichu Xiao"}], "citations": [{"paperId": "266330cb360d944a916591e51285315c2493d578", "title": "SCHEDULING OF HETEROGENOUS CLOUD COMPUTING SYSTEMS"}, {"paperId": "0880ff34e70081b88afe34a13832d534f6790275", "title": "Adaptive learning-based resource management strategy in fog-to-cloud"}]}
