{"paperId": "d8f75b66dddb8d9273adff8ca2e13d640808cafe", "publicationVenue": {"id": "2c30e84c-941b-45b8-b015-9284a1afdb14", "name": "Animals", "issn": "2076-2615", "alternate_issns": ["0030-6835"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-195475", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-195475", "https://www.mdpi.com/journal/animals"]}, "title": "Estimation of Dairy Cow Survival in the First Three Lactations for Different Culling Reasons Using the Kaplan–Meier Method", "abstract": "Simple Summary From a breeding and production point of view, the length and quality of life of dairy cows are directly determined (more or less) by voluntary decisions made by the breeders and technical staff in human–animal–environment relationships. In this case, economic conditions are the key roles that greatly complicate the decision processes, especially when it concerns the whole herd (not solely single animals). On the other hand, increasing social pressures on the continuous improvements of animal welfare and pro-environmental agricultural practices, including high-producing dairy cows, can be seen. Therefore, the aim of the present study was to analyze survival curves for cows culled for different reasons over three successive lactations and to determine the effects of various factors on cow survival. The main culling categories were reproductive disorders—40%, udder diseases—13 to 15%, and locomotor system diseases—above 10%. The survival curves for cows from individual culling categories had similar shapes. The greatest influences on the relative culling risks were exerted by: age at first calving, lactation length, calving interval, production subindex, breeding value for longevity, temperament, and average daily milk yield. A more accurate method of determining culling reasons would be required. Abstract The aims of the study were: (i) to compare survival curves for cows culled for different reasons over three successive lactations using the Kaplan–Meier estimator; (ii) to determine the effects of breeding documentation parameters on cow survival; (iii) to investigate the similarity between culling categories. The survival times for a subset of 347,939 Holstein-Friesian cows culled between 2017 and 2018 in Poland were expressed in months from calving to culling or the end of lactation. The survival tables were constructed for each culling category and lactation number. The survival curves were also compared. The main culling categories were reproductive disorders—40%, udder diseases—13 to 15%, and locomotor system diseases—above 10%. The survival curves for cows from individual culling categories had similar shapes. A low probability of survival curves for metabolic and digestive system diseases and respiratory diseases was observed in each of the three lactations. The contagious disease category was almost non-existent in the first lactation. The greatest influence on the relative culling risk was exerted by age at first calving, lactation length, calving interval, production subindex, breeding value for longevity, temperament, and average daily milk yield. A more accurate method of determining culling reasons would be required.", "venue": "Animals", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-07-30", "journal": {"name": "Animals : an Open Access Journal from MDPI", "volume": "12"}, "authors": [{"authorId": "3469441", "name": "W. Grzesiak"}, {"authorId": "3470026", "name": "K. Adamczyk"}, {"authorId": "3470401", "name": "D. Zaborski"}, {"authorId": "72213164", "name": "J. Wójcik"}], "citations": [{"paperId": "105eacb5081467209b4caf6e4bc7acac9352c42a", "title": "The effect of first-lactation calving season, milk production, and morphology on the survival of Simmental cows."}, {"paperId": "cd22e461349f8bea0115a9b33bfc4d151934d583", "title": "Milk recording data indicates the importance of fertility, including age at first calving, on the progression of first lactation cows to second lactation"}, {"paperId": "77d24e1685945bb61f48ca0a3cb50ad0f84c9600", "title": "Dairy Cattle Body Width Principal Component and the Correlation Level to Milk Yields as An Option for Selection Approach"}, {"paperId": "1a497690b1c1562eb72fdcb0eff3905f2d101b6c", "title": "Mortality in Galla Goat Production System in Southern Rangelands of Kenya: Levels and Predictors"}, {"paperId": "7773ecd43d6204ed4f11f5d41c3a4997eae2fa5c", "title": "Maternal, Postnatal, and Management-Related Factors Involved in Daily Weight Gain and Survivability of Suckling Zaraibi Goat Kids in Egypt"}]}
