{"paperId": "d8f957bd82b74e4cf7ac0bfc9422b94f115873d6", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "On Applying Machine Learning and Simulative Approaches to Railway Asset Management: The Earthworks and Track Circuits Case Studies", "abstract": "The objective of this study is to show the applicability of machine learning and simulative approaches to the development of decision support systems for railway asset management. These techniques are applied within the generic framework developed and tested within the In2Smart project. The framework is composed by different building blocks, in order to show the complete process from data collection and knowledge extraction to the real-world decisions. The application of the framework to two different real-world case studies is described: the first case study deals with strategic earthworks asset management, while the second case study considers the tactical and operational planning of track circuits’ maintenance. Although different methodologies are applied and different planning levels are considered, both the case studies follow the same general framework, demonstrating the generality of the approach. The potentiality of combining machine learning techniques with simulative approaches to replicate real processes is shown, evaluating the key performance indicators employed within the considered asset management process. Finally, the results of the validation are reported as well as the developed human–machine interfaces for output visualization.", "venue": "Sustainability", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2020-03-24", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "2508121", "name": "A. Consilvio"}, {"authorId": "1403177589", "name": "J. Solís-Hernández"}, {"authorId": "1411540723", "name": "N. Jiménez-Redondo"}, {"authorId": "26905956", "name": "Paolo Sanetti"}, {"authorId": "2987855", "name": "Federico Papa"}, {"authorId": "1659351206", "name": "Iñigo Mingolarra-Garaizar"}], "citations": [{"paperId": "24abc78525fea15a263c20986a134171c20b4c47", "title": "Exploring the synergy of human-computer interaction in financial decision-making"}, {"paperId": "508eb5a6a9c2af0c8bcf2836d77edc52af7fb75f", "title": "Integrating AI and DTs: challenges and opportunities in railway maintenance application and beyond"}, {"paperId": "790e6cc3e6cfcf49161bda2a4a0a06ce210ca5fa", "title": "A data-driven prioritisation framework to mitigate maintenance impact on passengers during metro line operation"}, {"paperId": "0e26b4df6e0a386565b98de9ed15cfe238bf30e5", "title": "Towards AI-assisted digital twins for smart railways: preliminary guideline and reference architecture"}, {"paperId": "af110f8c41bb013e64c991f773d01fab806663b4", "title": "Railway infrastructure maintenance efficiency improvement using deep reinforcement learning integrated with digital twin based on track geometry and component defects"}, {"paperId": "33d43b32501dbe1911f9d0c42f3a385fe3a6f436", "title": "Condition Modeling of Railway Drainage Pipes"}, {"paperId": "4b2fe3c07d57e0bd71da1f5d7c01723f4c83467b", "title": "Real-Time Maintenance Policy Optimization in Manufacturing Systems: An Energy Efficiency and Emission-Based Approach"}, {"paperId": "7fe6330caea511ed8232fb49e361a50f55272393", "title": "Data mining in predictive maintenance systems: A taxonomy and systematic review"}, {"paperId": "b7ec88e49e85ba83dfb96e3d7e572b97fae15b49", "title": "Optical Fiber Sensors for Monitoring Railway Infrastructures: A Review towards Smart Concept"}, {"paperId": "eda946a3085daaa985dad9ebed60950c08cc9ce9", "title": "Augmented asset management in railways – Issues and challenges in rolling stock"}, {"paperId": "8af48510ab368945ab77877636ddb3f8447eb285", "title": "Analysis of the Exhaust Emissions of Toxic Compounds from a Special Purpose Rail Machine PŁT-500 During Profiling the Ballast Cess"}, {"paperId": "07dac987423a447bc99d33f6c7eb90138189b480", "title": "A taxonomy of railway track maintenance planning and scheduling: A review and research trends"}, {"paperId": "033a9f235e1f6d1580cb379677199719291723c1", "title": "Simulation, Optimization, and Machine Learning in Sustainable Transportation Systems: Models and Applications"}, {"paperId": "3eb07633c8ac3c2b63fd9b2e5cbabddf96f64b4f", "title": "Revamping structural health monitoring of advanced rail transit systems: A paradigmatic shift from digital shadows to digital twins"}, {"paperId": "316c888669897dae231e3e5568d00f10b2b73faa", "title": "Business Intelligence and Machine Learning Methods for Predictive Maintenance in Greek railways"}]}
