{"paperId": "d8f9d8e9f621ca124c5102d31240e31041c2c98a", "publicationVenue": {"id": "8bc59e8b-e251-4201-839a-ec83ae78859d", "name": "Complex", "type": "conference", "alternate_names": ["Int Conf Complex Sci", "International Conference on Complex Sciences"], "issn": "0806-1912", "alternate_issns": ["1538-6848"], "url": "http://wo.uio.no/as/WebObjects/nettlogg.woa/1/wa/logg?logg=5904", "alternate_urls": ["http://www.wikicfp.com/cfp/program?id=545", "https://www.complex.com/"]}, "title": "Intelligent Environmental Art Design Combining Big Data and Artificial Intelligence", "abstract": "The widespread use of artificial intelligence in the field of design teaching has become a development trend, and for the art design profession, we should conform to and actively adapt to this development trend, change the original teaching mode, innovate their own teaching methods, constantly enrich the teaching methods, so as to improve the quality of teaching, and constantly cultivate high-quality art design talents in the new era. For the subject students, they grow up under the Internet. They are more affectionate to many new technologies, and the traditional teaching methods have some problems to meet their learning needs, so it is very necessary to introduce artificial intelligence in teaching. In this paper, we will discuss the optimization of the curriculum system of art design in higher education institutions in the context of artificial intelligence. The purpose of guiding the innovation of environmental art design thinking is to stimulate students’ learning ability and innovation ability and learn to use design ideas in practice. Integrating design thinking with artificial intelligence gets four innovative ways of culture, form, function, and emotion in terms of innovation at the design thinking level; in terms of thinking innovation guidance, it gets the guidance of role transformation and model practice, integrating artificial intelligence with environmental art design thinking, designing interactive spaces more in line with the times, and promoting the harmonious development of human and nature.", "venue": "Complex", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-06-10", "journal": {"name": "Complex.", "pages": "1606262:1-1606262:11", "volume": "2021"}, "authors": [{"authorId": "2116852963", "name": "Yanxia Li"}], "citations": [{"paperId": "f35e773d7666bd20403be59c53fdf6ae8645ab41", "title": "Visualization for a new era: Impact and application of large language models and AIGC to traditional business models"}, {"paperId": "d4d986c535e514e4a57031ccd0e9e16a2cb3f32b", "title": "Retracted: Intelligent Environmental Art Design Combining Big Data and Artificial Intelligence"}, {"paperId": "64b18166635a6fe1a6c4e1c7ce6d42b1a2935c5e", "title": "Environmental Art Design of Tourist Attractions with Regional Culture Fusion and Digital Innovation"}, {"paperId": "58163f7e99fe2cb5db9c1f624fc52c1d0be6ebc7", "title": "Classroom Design and Application of Art Design Education Based on Artificial Intelligence"}, {"paperId": "29875cf0fe057ae17c1b2f54e6927ef3b39a0989", "title": "Analysis of the influence of environmental design teaching on students’ aesthetic level based on principal component analysis model"}, {"paperId": "028fa725e5dcd46d0c7a3e270329254067c27bae", "title": "Research on teaching reform of environmental design majors in colleges and universities based on the integration of rural revitalization into big data"}, {"paperId": "d2a403c90f84547560ee94414462fcf7d6f5e22a", "title": "The Analysis of the Expression Form of Ideological and Political Elements in Philosophy Courses Based on Multimedia Information Fusion Strategy"}, {"paperId": "c6e49ba305ca991f66c19179360f761570f6ccbb", "title": "The Innovative Application of Visual Communication Design in Modern Art Design"}, {"paperId": "bf804ea0b2249d02c10a6641a0d6bbee74911545", "title": "Assessing the best art design based on artificial intelligence and machine learning using GTMA"}, {"paperId": "79e38fad490ce0d12bc510c7a776e659b6117ef2", "title": "The English Teaching Methods in the Field of Public Health in Colleges and Universities Based on Artificial Intelligence Technology"}, {"paperId": "fc4eac6211e00788362af94179b736b468b86847", "title": "Ranking the art design and applications of artificial intelligence and machine learning"}, {"paperId": "a1dfa81e0846ddd91833f7b694b72dac2ea873f9", "title": "Global Artificial Intelligence (AI) in Agriculture"}, {"paperId": "a93a663ab1e3249aa6e37388af4a48430c5075f1", "title": "Management Accounting Innovation System Based on Artificial Intelligence Technology"}]}
