{"paperId": "d8fb0bce261a8eb253b6aa510ab653808ff433e4", "publicationVenue": {"id": "63d338d9-43f7-427b-9481-4a4b41ba9468", "name": "Vehicular Communications", "type": "journal", "alternate_names": ["Veh Commun"], "issn": "2214-2096", "url": "https://www.journals.elsevier.com/vehicular-communications/"}, "title": "A Systematic Survey of Attack Detection and Prevention in Connected and Autonomous Vehicles", "abstract": "The number of Connected and Autonomous Vehicles (CAVs) is increasing rapidly in various smart transportation services and applications, considering many benefits to society, people, and the environment. Several research surveys for CAVs were conducted by primarily focusing on various security threats and vulnerabilities in the domain of CAVs to classify different types of attacks, impacts of attacks, attack features, cyber-risk, defense methodologies against attacks, and safety standards. However, the importance of attack detection and prevention approaches for CAVs has not been discussed extensively in the state-of-the-art surveys, and there is a clear gap in the existing literature on such methodologies to detect new and conventional threats and protect the CAV systems from unexpected hazards on the road. Some surveys have a limited discussion on Attacks Detection and Prevention Systems (ADPS), but such surveys provide only partial coverage of different types of ADPS for CAVs. Furthermore, there is a scope for discussing security, privacy, and efficiency challenges in ADPS that can give an overview of important security and performance attributes. This survey paper, therefore, presents the significance of CAVs in the market, potential challenges in CAVs, key requirements of essential security and privacy properties, various capabilities of adversaries, possible attacks in CAVs, and performance evaluation parameters for ADPS. An extensive analysis is discussed of different ADPS categories for CAVs and state-of-the-art research works based on each ADPS category that gives the latest findings in this research domain. This survey also discusses crucial and open security research problems that are required to be focused on the secure deployment of CAVs in the market.", "venue": "Vehicular Communications", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-03-27", "journal": {"name": "ArXiv", "volume": "abs/2203.14965"}, "authors": [{"authorId": "3315650", "name": "Trupil Limbasiya"}, {"authorId": "2160627318", "name": "Ko Zheng Teng"}, {"authorId": "145213689", "name": "Sudipta Chattopadhyay"}, {"authorId": "2158135812", "name": "Jianying Zhou"}], "citations": [{"paperId": "7d5d7b8d99daa31f0eda58286527e18319b490c4", "title": "Anomaly diagnosis of connected autonomous vehicles: A survey"}, {"paperId": "6edf880983407801f75f2d5f280fea47b545f3a6", "title": "Ensuring Secure Platooning of Constrained Intelligent and Connected Vehicles Against Byzantine Attacks: A Distributed MPC Framework"}, {"paperId": "f5e9f87eaf6b1b551e633e53e73270e8e8407394", "title": "Modelling of the Electric Vehicle Charging Infrastructure as Cyber Physical Power Systems: A Review on Components, Standards, Vulnerabilities and Attacks"}, {"paperId": "a97cd1a1a15d17c9e6b72801f973941e480f500a", "title": "In-vehicle network intrusion detection systems: a systematic survey of deep learning-based approaches"}, {"paperId": "d3df331581653b94f958d1a61c84d82b10f26140", "title": "A Review on Various Control Strategies and Algorithms in Vehicle Suspension Systems"}, {"paperId": "4ad259fa62468c66a7665b09009e95d4991185f6", "title": "Systematic Assessment of Cyber-Physical Security of Lane Keeping Control System for Autonomous Vehicles"}, {"paperId": "0f9ae0e03616c7d97fddd562fb8192f07cc7aee6", "title": "Potential sources of sensor data anomalies for autonomous vehicles: An overview from road vehicle safety perspective"}, {"paperId": "1c4dc1dac39316344cbb9e07dc4895ca94a9ebc2", "title": "PAID: Perturbed Image Attacks Analysis and Intrusion Detection Mechanism for Autonomous Driving Systems"}, {"paperId": "4a5dcad2fb8bd28d134570568af85d038d9a819c", "title": "VitroBench: Manipulating in-vehicle networks and COTS ECUs on your bench: A comprehensive test platform for automotive cybersecurity research"}, {"paperId": "3df9ba3eacc9387fecab1977a63f785c9c8c958a", "title": "Resilient Predictive Control of Constrained Connected and Automated Vehicles under Malicious Attacks"}, {"paperId": "6e3776d1b4777f9436742b262ea9383bb66156aa", "title": "Anomaly Detection in Connected and Autonomous Vehicles: A Survey, Analysis, and Research Challenges"}, {"paperId": "ce28e47f7a2c3c7d4249c364a71aea3a26167a1b", "title": "An Investigation of Cyber-Attacks and Security Mechanisms for Connected and Autonomous Vehicles"}, {"paperId": "5b6e94b8104439ce646490f4e16bc0a4f3071a76", "title": "Android Head Units vs. In-Vehicle ECUs: Performance Assessment for Deploying In-Vehicle Intrusion Detection Systems for the CAN Bus"}, {"paperId": "c349cbe7ebd6ab440029dcd17794a46b243c6217", "title": "Physical Layer Intrusion Detection and Localization on CAN bus"}]}
