{"paperId": "d8fe22176e7d4fc0b799da9697d1b2c7e7830a5c", "publicationVenue": {"id": "15a985eb-e054-44ba-81fc-af1107de3c80", "name": "Food & Nutrition Research", "type": "journal", "alternate_names": ["Food  Nutr Res"], "issn": "1654-661X", "url": "http://www.tandfonline.com/toc/zfnr20/current", "alternate_urls": ["http://www.co-action.net/news/PressRel_oct07_JFN.pdf", "http://www.co-action.net/", "http://www.foodandnutritionresearch.net/index.php/fnr/issue/view/285", "http://www.foodandnutritionresearch.net/index.php/fnr/index", "https://foodandnutritionresearch.net/index.php/fnr"]}, "title": "Associations of dietary patterns with common infections and antibiotic use among Finnish preschoolers", "abstract": "Background Preschoolers suffer frequently from infections. Although nutrition plays a key role in immune function, very little is known about the impact of overall diet on preschoolers’ infections. Objective To assess the associations between dietary patterns, common infections and antibiotic use among Finnish preschoolers. Design The study included 721 3–6-year-old preschoolers participating in the cross-sectional DAGIS survey. Parents retrospectively reported the number of common colds, gastroenteritis episodes and antibiotic courses their children had acquired during the past year. Food consumption outside preschool hours was recorded using a food frequency questionnaire. Dietary patterns were derived from the consumption frequencies using principal component analysis. Associations between the thirds of the dietary pattern scores and the outcomes were analysed using logistic and negative binomial regression models. Results Prevalence of common colds was lower in moderate and high adherence to the sweets-and-treats pattern than in low adherence (prevalence ratio [PR]: 0.89, 95% confidence interval [CI]: 0.80–1.00, and PR: 0.88, 95% CI: 0.79–0.99, respectively) and higher in high adherence to the health-conscious pattern than in low adherence (PR: 1.13, 95% CI: 1.01–1.27) after adjusting for age, sex, number of children living in the same household, frequency of preschool attendance, family’s highest education and probiotic use. The risk of ≥1 gastroenteritis episode and the prevalence of antibiotic courses were lower in moderate adherence to the sweets-and-treats pattern than in low adherence (odds ratio [OR]: 0.63, 95% CI: 0.44–0.92 and PR: 0.77, 95% CI: 0.59–1.00, respectively). Conclusions The results were unexpected. Parents who were most health-conscious of their children’s diet might also have been more aware of their children’s illness.", "venue": "Food & Nutrition Research", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-06-14", "journal": {"name": "Food & Nutrition Research", "volume": "67"}, "authors": [{"authorId": "2215784275", "name": "Henna Peltonen"}, {"authorId": "4745097", "name": "M. Erkkola"}, {"authorId": "119952402", "name": "A. Abdollahi"}, {"authorId": "32518884", "name": "Marja H. Leppänen"}, {"authorId": "143655948", "name": "E. Roos"}, {"authorId": "4000031", "name": "N. Sajaniemi"}, {"authorId": "4794611", "name": "A. Pajari"}, {"authorId": "5169649", "name": "H. Vepsäläinen"}], "citations": []}
