{"paperId": "d8ffe3042fd0e213bd74ef964269b01cc6807c71", "publicationVenue": null, "title": "Optimal clustering of frequency data with application to disease risk categorization", "abstract": "Abstract We provide a clustering procedure for a special type of dataset, known as frequency data, which counts the frequency of a certain binary outcome. An interpretation of the data as a discrete distribution enables us to extract statistical information, which we embed within an optimization-based framework. Our analysis of the resulting combinatorial optimization problem allows us to reformulate it as a more tractable network flow problem. This, in turn, enables the construction of exact algorithms that converge to the optimal solution in quadratic time. In addition, to be able to handle large-scale datasets, we provide two hierarchical heuristic algorithms that run in linearithmic time. Our moment-based method results in clustering solutions that are shown to perform well for a family of applications. We illustrate the benefits of our findings through a case study on HIV risk categorization within the context of large-scale screening through group testing. Our results on CDC data show that the proposed clustering framework consistently outperforms other popular clustering methods.", "venue": "", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-08-03", "journal": {"name": "IISE Transactions", "pages": "728 - 740", "volume": "54"}, "authors": [{"authorId": "49966869", "name": "Hrayer Aprahamian"}, {"authorId": "102899521", "name": "H. El-Amine"}], "citations": [{"paperId": "a8c24b0382328122aef7ec57bc2fe7ecb8b7653c", "title": "Optimal targeted mass screening in non‐uniform populations with multiple tests and schemes"}, {"paperId": "2badc120904f246e194d9f4f48dfc413d37d4a46", "title": "Optimal unlabeled set partitioning with application to risk-based quarantine policies"}, {"paperId": "926a6d903f4303c9f029c4a16d872eec3968e053", "title": "An optimization-based framework to minimize the spread of diseases in social networks with heterogeneous nodes"}]}
