{"paperId": "d900b40852708bb49310856a60248b399be96a34", "publicationVenue": {"id": "9641a8b5-1baa-4991-8cda-2c1336578145", "name": "International Journal of Education and Management Engineering", "type": "journal", "alternate_names": ["Int J Educ Manag Eng"], "issn": "2305-3623", "url": "https://www.mecs-press.org/ijeme/"}, "title": "Machine Learning and Artificial Intelligence Based Identification of Risk Factors and Incidence of Gastroesophageal Reflux Disease in Pakistan", "abstract": ": The disease burden of Gastroesophageal Reflux Disease (GERD) varies across the globe and have a significant impact on the overall health of the communities. A number of complications and diseases stem from chronic GERD. In order to provide improved healthcare measures and to effectively monitor and control GERD, it is important to identify rate of incidence of the disease and the associated risk factors along with symptoms. Therefore, this study was conducted by retrieving the relevant data through machine learning. Principles of Artificial Neural Networks were applied to sort the data and the results were obtained in the form of a network by using VOSviewer software. These artificial intelligence and machine learning based results reveal that the Asian population is increasingly becoming prone to GERD and sporadic reports from Pakistan have surmounted to disclose that GERD is constantly present across different districts and cities of Pakistan. The major risk factors identified among the Pakistani population in different research articles include consumption of oily foods, the habit of having late dinners, sedentary lifestyles and a lack of understanding about disease diagnosis, and GERD management and treatment. Our results suggest that acid reflux and inflammation of esophageal cavity are some of the main symptoms of the disease. On the basis of the results obtained, it is speculated that this study will provide a ground to improve the symptomatic diagnosis of GERD by closely observing and analyzing the risk factors and the rate of incidence with symptoms. It would enable the healthcare facilities to effectively monitor the GERD cases so that the disease burden due to GERD and related illnesses could be reduced. Moreover, the identification of regional differences and a comparative data would help us in identifying the disease hotspots where more efforts would be needed to manage and control the disease", "venue": "International Journal of Education and Management Engineering", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-10-08", "journal": {"name": "International Journal of Education and Management Engineering"}, "authors": [{"authorId": "2118999105", "name": "Mustafa Kamal Pasha"}], "citations": []}
