{"paperId": "d9161269ed0f6e3339f66979498d48dbb3f2f4a1", "publicationVenue": {"id": "6a1abd85-3eca-4491-ac76-0134749a10fc", "name": "International Workshop on Data Warehousing and OLAP", "type": "conference", "alternate_names": ["Data Warehousing and OLAP", "Int Workshop Data Warehous L", "DOLAP", "Data Warehous L"], "url": "http://www.wikicfp.com/cfp/program?id=748"}, "title": "Hierarchical Property Set Merging for SPARQL Query Optimization", "abstract": "Characteristic sets (CS) organize RDF triples based on the set of properties associated with their subject nodes. This concept was recently used in indexing techniques, as it can capture the implicit schema of RDF data. While most CS-based approaches yield significant improvements in space and query performance, they fail to perform well when answering complex query work-loads in the presence of schema heterogeneity, i.e., when the number of CSs becomes very large, resulting in a highly partitioned data organization. In this paper, we address this problem by introducing a novel technique, for merging CSs based on their hierarchical structure. Our method employs a lattice to capture the hierarchical relationships between CSs, identifies dense CSs and merges dense CSs with their ancestors, thus reducing the size of the CSs as well as the links between them. We implemented our algorithm on top of a relational backbone, where each merged CS is stored in a relational table, and we performed an extensive experimental study to evaluate the performance and impact of merging to the storage and querying of RDF datasets, indicating significant improvements.", "venue": "International Workshop on Data Warehousing and OLAP", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"pages": "36-45"}, "authors": [{"authorId": "1725307", "name": "M. Meimaris"}, {"authorId": "2325154", "name": "George Papastefanatos"}, {"authorId": "144996383", "name": "Panos Vassiliadis"}], "citations": [{"paperId": "dbc2d511fe0108dc2cc72c7695b74b023ec9c95f", "title": "Relational schema optimization for RDF-based knowledge graphs"}, {"paperId": "cc8963ce0e29d5f5ae5908d4f9957c09ccedad5d", "title": "GoFast: Graph-based optimization for efficient and scalable query evaluation"}, {"paperId": "85c6db4e2eb186a8cd251220882342cdafd34ce1", "title": "An In-depth Investigation of Large-scale RDF Relational Schema Optimizations Using Spark-SQL"}]}
