{"paperId": "d91e6dd27dfbde55309fa6dec6e208566bf41225", "publicationVenue": {"id": "8e1bd4b5-d5b2-4e22-ba0a-01fe5568d472", "name": "Remote Sensing", "type": "journal", "alternate_names": ["Remote Sens"], "issn": "2315-4675", "alternate_issns": ["2072-4292"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169233", "alternate_urls": ["https://www.mdpi.com/journal/remotesensing", "http://www.mdpi.com/journal/remotesensing", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169233"]}, "title": "Rapid Landslide Extraction from High-Resolution Remote Sensing Images Using SHAP-OPT-XGBoost", "abstract": "Landslides, the second largest geological hazard after earthquakes, result in significant loss of life and property. Extracting landslide information quickly and accurately is the basis of landslide disaster prevention. Fengjie County, Chongqing, China, is a typical landslide-prone area in the Three Gorges Reservoir Area. In this study, we newly integrate Shapley Additive Explanation (SHAP) and Optuna (OPT) hyperparameter tuning into four basic machine learning algorithms: Gradient Boosting Decision Tree (GBDT), Extreme Gradient Boosting (XGBoost), Light Gradient Boosting Machine (LightGBM), and Additive Boosting (AdaBoost). We construct four new models (SHAP-OPT-GBDT, SHAP-OPT-XGBoost, SHAP-OPT-LightGBM, and SHAP-OPT-AdaBoost) and apply the four new models to landslide extraction for the first time. Firstly, high-resolution remote sensing images were preprocessed, landslide and non-landslide samples were constructed, and an initial feature set with 48 features was built. Secondly, SHAP was used to select features with significant contributions, and the important features were selected. Finally, Optuna, the Bayesian optimization technique, was utilized to automatically select the basic models’ best hyperparameters. The experimental results show that the accuracy (ACC) of these four SHAP-OPT models was above 92% and the training time was less than 1.3 s using mediocre computational hardware. Furthermore, SHAP-OPT-XGBoost achieved the highest accuracy (96.26%). Landslide distribution information in Fengjie County from 2013 to 2020 can be extracted by SHAP-OPT-XGBoost accurately and quickly.", "venue": "Remote Sensing", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-07", "journal": {"name": "Remote. Sens.", "pages": "3901", "volume": "15"}, "authors": [{"authorId": "2228101116", "name": "Na Lin"}, {"authorId": "2228125959", "name": "Di Zhang"}, {"authorId": "14912282", "name": "Shanshan Feng"}, {"authorId": "2228064110", "name": "Kai Ding"}, {"authorId": "2153267341", "name": "Libing Tan"}, {"authorId": "2256857213", "name": "Bin Wang"}, {"authorId": "2118212905", "name": "Tao Chen"}, {"authorId": "2108746718", "name": "Wei-le Li"}, {"authorId": "117651813", "name": "Xiaoai Dai"}, {"authorId": "2152946886", "name": "Jianping Pan"}, {"authorId": "79809593", "name": "Feifei Tang"}], "citations": [{"paperId": "eef2687e4d428f756a1e9c1c1aa5b95f2d62cc46", "title": "LiDAR Dynamic Target Detection Based on Multidimensional Features"}, {"paperId": "8d970ab148b7283a24e72ff13d81286b45750828", "title": "Cloud-Type Classification for Southeast China Based on Geostationary Orbit EO Datasets and the LighGBM Model"}, {"paperId": "44ebfce3b6ca4f7156c9ad7a85af60ac14392acb", "title": "Optimizing Faulting Prediction for Rigid Pavements Using a Hybrid SHAP-TPE-CatBoost Model"}, {"paperId": "a63c85554a9d1a87f0ba8e0ab30cb81753b25ea4", "title": "A Comparison of Machine Learning Models for Predicting Flood Susceptibility Based on the Enhanced NHAND Method"}]}
