{"paperId": "d93f825728cd7fd0d3e4fc61bff6cfd0e68793f4", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "A Systematic Review of Literature on Sustaining Decision-Making in Healthcare Organizations Amid Imperfect Information in the Big Data Era", "abstract": "The significance of big data analytics (BDA) has benefited the health sector by leveraging the potential insights and capabilities of big data in decision making. However, every implementation of BDA within the healthcare field faces difficulties due to incomplete or flawed information that necessitates attention and resolution. The purpose of this systematic literature review is to accomplish two main objectives. Firstly, it aims to synthesize the various elements that contribute to imperfect information in BDA and their impact on decision-making processes within the healthcare sector. This involves identifying and analyzing the factors that can result in imperfect information in BDA applications. Secondly, the review intends to create a taxonomy specifically focused on imperfect information within the context of BDA in the health sector. The study conducted a systematic review of the literature, specifically focusing on studies written in English and published up until February 2023. We also screened and retrieved the titles, abstracts, and potentially relevant studies to determine if they met the criteria for inclusion. As a result, they obtained a total of 58 primary studies. The findings displayed that the presence of uncertainty, imprecision, vagueness, incompleteness, and complexity factors in BDA significantly impacts the ability to sustain effective decision-making in the healthcare sector. Additionally, the study highlighted that the taxonomy for imperfect information in BDA provides healthcare managers with the means to utilize suitable strategies essential for successful implementation when dealing with incomplete information in big data. These findings have practical implications for BDA service providers, as they can leverage the findings to attract and promote the adoption of BDA within the healthcare sector.", "venue": "Sustainability", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-10-31", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "2264844781", "name": "Glory Urekwere Orlu"}, {"authorId": "2274519950", "name": "R. Abdullah"}, {"authorId": "2274573924", "name": "Zeinab Zaremohzzabieh"}, {"authorId": "1845655", "name": "Y. Y. Jusoh"}, {"authorId": "2240038050", "name": "Shahla Asadi"}, {"authorId": "51291508", "name": "Yousef A. M. Qasem"}, {"authorId": "9461930", "name": "R. Nor"}, {"authorId": "2264849675", "name": "Wan Mohd Haffiz bin Mohd Nasir"}], "citations": []}
