{"paperId": "d941ab098a7fd2d2c8bea1b50671660e375a10c5", "publicationVenue": {"id": "a720325d-33fa-4ab3-9435-9bc1e7d7b57b", "name": "International Conference on Adaptive and Intelligent Systems", "type": "conference", "alternate_names": ["International Conference on Artificial Intelligence and Security", "Int Conf Artif Intell Secur", "ICAIS", "Int Conf Adapt Intell Syst"], "url": "http://www.wikicfp.com/cfp/program?id=1276"}, "title": "Hybrid Artificial Ecosystem Optimization Algorithm based on Search Manager Framework for Big Data Environment", "abstract": "Big Data Optimization (Big-Opt) represent optimization problem, which needs to handle the property of big data analytics. In recent years, metaheuristic algorithm has effectively resolved several real-time problems. Based on natural phenomena, the algorithm with distinctive search mechanism could be good at addressing specific challenges. But they might be failed to resolve other challenges. Amongst the different techniques, hybridizing metaheuristic algorithm might assist in enriching the searching behaviour while promoting search flexibility. Therefore, this study develops a Hybrid Artificial Ecosystem Optimization Algorithm based on the Search Manager Framework (HAEOA-S MF) for big data environments. In the presented HAEOA-SMF technique, the population gets produced arbitrarily and the objective function gets determined. For every round, the HAEOA-SMF technique executes the AEO algorithm with Oppositional Based Learning (OBL) concept. In the presented HAEOA-SMF technique, the population is divided into a few groups (or islands) and the vector can be allotted to every group of subpopulations. The HAEOA-SMF technique generated a styled vector with the length of many evolution models elected to hybridize the models. The experimental result of the HAEOA-SMF technique is tested using a series of data and the results can be studied under various aspects. The experimental outcomes highlighted the enhanced performance of the HAEOA-SMF technique.", "venue": "International Conference on Adaptive and Intelligent Systems", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-02-02", "journal": {"name": "2023 Third International Conference on Artificial Intelligence and Smart Energy (ICAIS)", "pages": "892-897"}, "authors": [{"authorId": "41016228", "name": "Dr. Pushpender Sarao"}, {"authorId": "2213124800", "name": "Milind Milind"}, {"authorId": "2054306805", "name": "G. V. Babu"}, {"authorId": "2213141859", "name": "RajeshKumar Rameshbhai Savaliya"}, {"authorId": "2212881011", "name": "Mousmita Devi"}, {"authorId": "2074227904", "name": "M. Tiwari"}], "citations": []}
