{"paperId": "d94c64799479ca49473b75fbe534d938230fdc46", "publicationVenue": {"id": "0a6835b2-217d-4708-8735-f574a583a7d7", "name": "Atmosphere", "type": "journal", "alternate_names": ["ATMOSPHERE"], "issn": "2073-4433", "alternate_issns": ["1598-3560", "2828-3104", "0004-6973"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-187315", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-187315", "https://www.mdpi.com/journal/atmosphere", "http://j-komes.or.kr/", "http://www.tandfonline.com/loi/tato19", "http://www.mdpi.com/journal/atmosphere"]}, "title": "The Carbon Emission Reduction Effect of Technological Innovation on the Transportation Industry and Its Spatial Heterogeneity: Evidence from China", "abstract": "The carbon reduction effect of technological innovation in the transportation industry is conducive to China’s anticipated realization of carbon neutrality. Therefore, we evaluated carbon emission reduction effect of technological innovation in the transportation industry in China. Based on the panel data of 30 sample provinces in China (excluding Hong Kong, Macao, Taiwan and Tibet) from 2012 to 2018, using the Moran’I index and Getis-Ord Gi index, this paper analyzes the evolutionary trend and spatial autocorrelation of carbon emission in the transportation industry, and analyzes the impact of technological innovation on carbon emission levels of the transportation industry and its spatiotemporal differences by using the geographical and temporal weighted regression (GTWR) model by using ArcGIS 10.4 software. The conclusions are as follows: The carbon emission level of China’s transportation industry generally has been rising steadily, showing a spatial distribution pattern of high emissions in the east and low emissions in the west. The cold spots are concentrated in the western region, and the hot spots are situated in the central and eastern regions. Technological innovation has a carbon reduction effect on the transportation industry in the eastern and north-eastern regions, while the effect in other regions is not obvious. However, there is an obvious “inverted U-shaped” relationship between technological innovation and the transportation industry’s carbon emissions. The technological innovation in the transportation industry will have a significant carbon reduction effect after breaking through the technical pain points. This carbon reduction effect has a higher effect on the western region than on the eastern region. In addition, the economic development level, the fiscal expenditure proportion of the transportation industry, the higher education level, and the proportion of fixed asset investment in the transportation industry have played a positive role in reducing carbon in the transportation industry, but the spatial heterogeneity of this carbon reduction effect is relatively strong. Therefore, during the “14th Five-Year Plan” development period in China, it is necessary to continuously promote the low-carbon development of the transportation industry with technological innovation, while highlighting the differentiated carbon reduction governance, and consolidating the role of talents and fiscal support.", "venue": "Atmosphere", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-09-12", "journal": {"name": "Atmosphere"}, "authors": [{"authorId": "47177670", "name": "Tao Shi"}, {"authorId": "2133644085", "name": "Shucun Si"}, {"authorId": "123784491", "name": "J. Chan"}, {"authorId": "13385383", "name": "Lingling Zhou"}], "citations": [{"paperId": "833fb5f446dd8f467c53b9416c50dfe12a7d6def", "title": "Exploring the Influence of the Digital Economy on Energy, Economic, and Environmental Resilience: A Multinational Study across Varied Carbon Emission Groups"}, {"paperId": "b2fa7ccb5d6fb741264d9148618708fa7b03961b", "title": "Artificial intelligence and corporate carbon neutrality: A qualitative exploration"}, {"paperId": "eb6813c05ccf1789da021ec053af91d73c717ab7", "title": "An Inquiry into the Characteristics of Carbon Emissions in Inter-Provincial Transportation in China: Aiming to Typological Strategies for Carbon Reduction in Regional Transportation"}, {"paperId": "aa5500e238475e8eb8cdeed8596484eb024f9e4a", "title": "Does carbon emission trading policy has emission reduction effect?-An empirical study based on quasi-natural experiment method."}, {"paperId": "71f8935209c110c22f183a5f2c2021c49fbf603d", "title": "Testing the impacts of renewable energy, natural resources rent, and technological innovation on the ecological footprint in the USA: Evidence from Bootstrapping ARDL"}, {"paperId": "f3b09af62e1ecc05f982312bea0fe83663df28fa", "title": "Spatial–temporal dynamics of land use carbon emissions and drivers in 20 urban agglomerations in China from 1990 to 2019"}, {"paperId": "e6c920df1903829201ec4cbfa736eef29c4746fd", "title": "Effects of land-use change on carbon emission and its driving factors in Shaanxi Province from 2000 to 2020"}, {"paperId": "6896a3dd47803ddfcd0a0ded106a42bc0718c999", "title": "Do technology and renewable energy contribute to energy efficiency and carbon neutrality? Evidence from top ten manufacturing countries"}, {"paperId": "0d6dafecf4434efaf20a64e32ad630e00726ce72", "title": "Multi-scale analysis of China’s transportation carbon emissions based on nighttime light data"}, {"paperId": "54e3a9ae6c4886b3377e894b9930757599a23ea6", "title": "Does Public Participation Reduce Regional Carbon Emission?"}, {"paperId": "ea14591d95f524eb014717f3c20b8c2e6defaf89", "title": "The Effect of Air Pollution Control Auditing on Reducing Carbon Emissions: Evidence from China"}, {"paperId": "5721a8598b23050b0fd577c1f14579b017234cc6", "title": "A Study on the Non-Linear Impact of Digital Technology Innovation on Carbon Emissions in the Transportation Industry"}, {"paperId": "b6f8f9caf1169d7f0dd136df7fda39fb04394f72", "title": "How does transportation infrastructure affect urban carbon emissions? an empirical study based on 286 cities in China"}, {"paperId": "b14ce543d3e8d93dfca867b94c49a7b4f1e97a81", "title": "Does Human Capital Matter for China’s Green Growth?—Examination Based on Econometric Model and Machine Learning Methods"}, {"paperId": "2d82020757e47036d18672bbd761e338ba796cbd", "title": "Quantifying the energy trilemma in China and assessing its nexus with smart transportation"}, {"paperId": "61e7c2804bc43e9be8e6440acb0f667c187e598c", "title": "The role of technological innovations and renewable energy consumption in reducing environmental degradation: evidence from the belt and road initiative countries"}, {"paperId": "7c1ddba619e739d48c6465c796dfaebff75f0bab", "title": "How do resource dependence and technological progress affect carbon emissions reduction effect of industrial structure transformation? Empirical research based on the rebound effect in China"}, {"paperId": "aca1caaefc5f4cd1fa1e8151491e00d130358693", "title": "COST ESTIMATE FOR FILLING WITH DIFFERENT MOTOR FUELS IN FREIGHTING BY LIGHT-DUTY VEHICLES"}, {"paperId": "063a45d2d00b5795df901fd9bbb8c8879ace21ee", "title": "Identifying the spatial heterogeneity in the effects of the construction land scale on carbon emissions: Case study of the Yangtze River Economic Belt, China."}, {"paperId": "fadbc1e5df87ef77f9cf6ec44a059ccf955b0546", "title": "Industrial coagglomeration, technological innovation, and environmental pollution in China: Life-cycle perspective of coagglomeration"}]}
