{"paperId": "d94c29e4a1af041aa48b1f7587b1c62d674648dd", "publicationVenue": {"id": "146869d7-bc08-4ccf-89c8-2aba81d32bde", "name": "ACM Journal of Data and Information Quality", "type": "journal", "alternate_names": ["Journal of Data and Information Quality", "J Data Inf Qual", "ACM J Data Inf Qual"], "issn": "1936-1963", "url": "https://dl.acm.org/citation.cfm?id=J1191&picked=prox", "alternate_urls": ["https://dl.acm.org/loi/jdiq", "https://jdiq.acm.org/", "http://portal.acm.org/jdiq"]}, "title": "A Survey on Edge Intelligence and Lightweight Machine Learning Support for Future Applications and Services", "abstract": "As the number of devices connected to the Internet has grown larger, so too has the intensity of the tasks that these devices need to perform. Modern networks are more frequently working to perform computationally intensive tasks on low-power devices and low-end hardware. Current architectures and platforms tend towards centralized and resource-rich cloud computing approaches to address these deficits. However, edge computing presents a much more viable and flexible alternative. Edge computing refers to a distributed and decentralized network architecture in which demanding tasks such as image recognition, smart city services, and high-intensity data processing tasks can be distributed over a number of integrated network devices. In this article, we provide a comprehensive survey for emerging edge intelligence applications, lightweight machine learning algorithms, and their support for future applications and services. We start by analyzing the rise of cloud computing, discuss its weak points, and identify situations in which edge computing provides advantages over traditional cloud computing architectures. We then divulge details of the survey: the first section identifies opportunities and domains for edge computing growth, the second identifies algorithms and approaches that can be used to enhance edge intelligence implementations, and the third specifically analyzes situations in which edge intelligence can be enhanced using any of the aforementioned algorithms or approaches. In this third section, lightweight machine learning approaches are detailed. A more in-depth analysis and discussion of future developments follows. The primary discourse of this article is in service of an effort to ensure that appropriate approaches are applied adequately to artificial intelligence implementations in edge systems, mainly, the lightweight machine learning approaches.", "venue": "ACM Journal of Data and Information Quality", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-01-25", "journal": {"name": "ACM Journal of Data and Information Quality", "pages": "1 - 30", "volume": "15"}, "authors": [{"authorId": "147213726", "name": "Kyle Hoffpauir"}, {"authorId": "2202421587", "name": "Jacob Simmons"}, {"authorId": "2000634366", "name": "Nikolas Schmidt"}, {"authorId": "2167016439", "name": "Rachitha Pittala"}, {"authorId": "2188283066", "name": "Isaac Briggs"}, {"authorId": "2167016444", "name": "Shanmukha Makani"}, {"authorId": "1781328", "name": "Y. Jararweh"}], "citations": [{"paperId": "bc8a557c950e2bbc35d5c58641bc975fbec93021", "title": "Edge AI for Internet of Medical Things: A literature review"}, {"paperId": "6da5aafaa7bc41bdb98bec739c96c4d75d7b64f8", "title": "Containerization in Edge Intelligence: A Review"}, {"paperId": "12c8f7a518eb7dc319317305734c9ee32b50eee4", "title": "Fortified Edge 3.0: A Lightweight Machine Learning based Approach for Security in Collaborative Edge Computing"}]}
