{"paperId": "d956bac7965097e9579b83c83941054f72117d56", "publicationVenue": {"id": "8647ec57-7e23-4bf6-8daf-83a8b917e700", "name": "Journal of Information and Communication Technologies", "type": "journal", "alternate_names": ["J Inf Commun Technol", "Journal of Information and Communication Technology", "J inf  commun technol", "Journal of information & communication technology"], "issn": "2047-3168", "alternate_issns": ["2717-0411", "1013-3909", "1675-414X", "1816-613X"], "url": "http://www.jict.co.uk/home", "alternate_urls": ["http://www.jict.uum.edu.my/"]}, "title": "SMART CITY SECURITY: FACE-BASED IMAGE RETRIEVAL MODEL USING GRAY LEVEL CO-OCCURRENCE MATRIX", "abstract": "Nowadays, a lot of images and documents are saved on data sets and cloud servers such as certificates, personal images, and passports. These images and documents are utilized in several applications to serve residents living in smart cities. Image similarity is considered as one of the applications of smart cities. The major challenges faced in the field of image management are searching and retrieving images. This is because searching based on image content requires a long time. In this paper, the researchers present a secure scheme to retrieve images in smart cities to identify wanted criminals by using the Gray Level Co-occurrence Matrix. The proposed scheme extracts only five features of the query image which are contrast, homogeneity, entropy, energy, and dissimilarity. This work consists of six phases which are registration, authentication, face detection, features extraction, image similarity, and image retrieval. The current study runs on a database of 810 images which was borrowed from face94 to measure the performance of image retrieval. The results of the experiment showed that the average", "venue": "Journal of Information and Communication Technologies", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2020-06-11", "journal": {"name": "Journal of Information and Communication Technology"}, "authors": [{"authorId": "98294858", "name": "A. Rashid"}, {"authorId": "3956994", "name": "A. Yassin"}, {"authorId": "2167930763", "name": "A. Wahed"}, {"authorId": "2207574734", "name": "A. J. Yassin"}], "citations": [{"paperId": "c63113ac2564e59e88119f00ee74604941733e26", "title": "Intelligent Vehicle Inspection Tool Design Based on Freeman Chain Code for Automatic Annotation of 3D Models"}, {"paperId": "64216f950215f4574b6cb2aba74347c6ae9095b7", "title": "A Client-based User Authentication Scheme for the Cloud of Things Environment"}, {"paperId": "6704376cd5645f31f36ada5e696482a8a26c25ef", "title": "Smart Sustainable Cities: The Essentials for Managers’ and Leaders’ Initiatives within the Complex Context of Differing Definitions and Assessments"}, {"paperId": "b6d27ecffc2c702adc13f898e5c3ca7a92451576", "title": "Iris Features Extraction and Recognition based on the Scale Invariant Feature Transform (SIFT)"}, {"paperId": "fba23a56701a414179ad9679b4abc0ecb37d4c79", "title": "Analyzing the Adoption Challenges of the Internet of Things (IoT) and Artificial Intelligence (AI) for Smart Cities in China"}, {"paperId": "21f64ae121d0fdcbee00e29639b2ce7eae76e715", "title": "Light Pollution and Smart Outdoor Lighting"}, {"paperId": "c62c1807d8d5b7b54cc8893336b1d5ff163c56f5", "title": "Application of Dynamic Fragmentation Methods in Multimedia Databases: A Review"}]}
