{"paperId": "d9604c579fb432bee1d7654a33a54e3f2e0c315e", "publicationVenue": {"id": "027ffd21-ebb0-4af8-baf5-911124292fd0", "name": "bioRxiv", "type": "journal", "url": "http://biorxiv.org/"}, "title": "Untargeted metabolomics to expand the chemical space of the marine diatom Skeletonema marinoi", "abstract": "Diatoms (Bacillariophyceae) are aquatic photosynthetic microalgae with an ecological role as primary producers in the aquatic food web. They account substantially for global carbon, nitrogen, and silicon cycling. Elucidating the chemical space of diatoms is crucial to understanding their physiology and ecology. To expand the known chemical space of a cosmopolitan marine diatom, Skeletonema marinoi, we performed High-Resolution Liquid Chromatography-Tandem Mass Spectrometry (LC-MS2) for untargeted metabolomics data acquisition. The spectral data from LC-MS2 was used as input for the Metabolome Annotation Workflow (MAW) to obtain putative annotations for all measured features. A suspect list of metabolites previously identified in the Skeletonema spp. was generated to verify the results. These known metabolites were then added to the putative candidate list from LC-MS2 data to represent an expanded catalogue of 1970 metabolites estimated to be produced by S. marinoi. The most prevalent chemical superclasses, based on the ChemONT ontology in this expanded dataset, were “Organic acids and derivatives”, “Organoheterocyclic compounds”, “Lipids and lipid-like molecules”, and “Organic oxygen compounds”. The metabolic profile from this study can aid the bioprospecting of marine microalgae for medicine, biofuel production, agriculture, and environmental conservation. The proposed analysis can be applicable for assessing the chemical space of other microalgae, which can also provide molecular insights into the interaction between marine organisms and their role in the functioning of ecosystems. Importance Diatoms are abundant marine phytoplankton members and have great ecological importance and biochemical potential. The cosmopolitan diatom Skeletonema marinoi has become an ecological and environmental research model organism. In this study, we used untargeted metabolomics to acquire a general metabolic profile of S. marinoi to assess its chemical diversity and expand the known metabolites produced by this diatom. S. marinoi produces a chemically diverse set of secondary metabolites with potential therapeutic properties, such as anti-cancer, antioxidant, and anti-inflammatory. Such metabolites are highly significant due to their potential role in drug discovery and bioeconomy. Lipids from S. marinoi also have potential in the biofuel industry. Furthermore, the environmental fluctuations in the water bodies directly affect the production of different secondary metabolites from diatoms, which can be key indicators of climate change.", "venue": "bioRxiv", "year": 2023, "fieldsOfStudy": ["Medicine", "Biology"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-07", "journal": {"name": "Frontiers in Microbiology", "volume": "14"}, "authors": [{"authorId": "2065914488", "name": "M. Zulfiqar"}, {"authorId": "50781221", "name": "Daniel Stettin"}, {"authorId": "2147161016", "name": "Saskia Schmidt"}, {"authorId": "150333140", "name": "Vera Nikitashina"}, {"authorId": "48970085", "name": "G. Pohnert"}, {"authorId": "2238683959", "name": "Christoph Steinbeck"}, {"authorId": "2239211272", "name": "Kristian Peters"}, {"authorId": "1609321402", "name": "Maria Sorokina"}], "citations": [{"paperId": "786b9624b4a7dc4f87c73dd311cc86332c3ee2ab", "title": "Analysis of Metabolomics and Transcriptomics Data to Assess Interactions in Microalgal Co-culture of Skeletonema marinoi and Prymnesium parvum"}]}
