{"paperId": "d96ece751000d8ff448623830aa6525597526e3b", "publicationVenue": null, "title": "Today in Thailand: multidisciplinary perspectives on the current tsunami disaster risk reduction", "abstract": "Abstract Thailand is one of the many countries in Asia that fell victim to the monstrous 2004 Indian Ocean tsunami. To date, there has been tons of effort to reduce disaster risk in Thailand. Nevertheless, there is still a considerable margin for improvement. This paper aims to review previous efforts and measures that have been taken to reduce Thailand's risk to disasters, and highlight possible areas for improvement. We use the disaster risk management as a thought-framework for our review, where we discuss Thailand's current disaster risk reduction (DRR) measures from a multi-perspective: the tsunami numerical simulation, tsunami warning system, tsunami evacuation sign, manuals and guidelines, evacuation shelters, housing recovery, hotel business and recovery, public awareness and media, and disaster education. In understanding the current state of disaster risk efforts, we will then highlight potential areas for improvement.", "venue": "Special Publications", "year": 2019, "fieldsOfStudy": ["Geology"], "publicationTypes": ["Review"], "publicationDate": "2019-12-19", "journal": {"name": "Special Publications", "pages": "353 - 365", "volume": "501"}, "authors": [{"authorId": "3277516", "name": "N. Leelawat"}, {"authorId": "10718757", "name": "P. Latcharote"}, {"authorId": "2100576", "name": "A. Suppasri"}, {"authorId": "102272579", "name": "Titaya Sararit"}, {"authorId": "100919370", "name": "Mongkonkorn Srivichai"}, {"authorId": "1423730946", "name": "Jing Tang"}, {"authorId": "2069045849", "name": "Terence Chua"}, {"authorId": "1572159201", "name": "Darin Kumnetrut"}, {"authorId": "1572166383", "name": "Kumpol Saengtabtim"}, {"authorId": "31580758", "name": "F. Imamura"}], "citations": [{"paperId": "bc48a8a31d26a76557ac752ec6dc18d405debe5a", "title": "Reconstruction of the Indian Ocean Tsunami in 2004 in Sabang Based on the Current Land Cover for Tsunami Evacuation Sites Recommendations"}, {"paperId": "ab2c7df614d8cdd94cb00773e6592a1ff1075637", "title": "Framework for evaluating the maintenance of a Tsunami Early Warning System (TEWS) – A pilot case study in Patong, Thailand, of social and technical quality indicators"}, {"paperId": "9db55d311aa2e5116bae79c80264a0a54960fc55", "title": "Characterization of modern and historical seismic–tsunamic events and their global–societal impacts"}]}
