{"paperId": "d9726812cb0b795c57d7f4d3d35c28164dba20b1", "publicationVenue": null, "title": "Common Clustering Algorithms", "abstract": null, "venue": "Comprehensive Chemometrics", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": null, "journal": {"name": "Comprehensive Chemometrics"}, "authors": [{"authorId": "1849483", "name": "Ickjai Lee"}, {"authorId": "47988382", "name": "Jianhua Yang"}], "citations": [{"paperId": "f53d9932ba9e1d21ed68ece9ca8d507d133d322a", "title": "Multicomponent system for development of antimicrobial PLA-based films with enhanced physical characteristics."}, {"paperId": "fd79948accf602b3f678668e7407963beabbe06c", "title": "Recommendations for validating hierarchical clustering in consumer sensory projects"}, {"paperId": "999aa1933413aa8f1190c2262ee6670892aa4d81", "title": "Modification of poly(L-lactic acid)-based films and evaluation of physical and antibacterial properties by using multivariate data analysis."}, {"paperId": "d5db1e6b8a2200a20c9cc55777e9d32b359e01f4", "title": "Challenges in predictive maintenance – A review"}, {"paperId": "0570e6e801266ccede6dd2940b46ed2ff06a592e", "title": "One Step before Synthesis: Structure–Property–Condition Relationship Models to Sustainable Design of Efficient TiO2-Based Multicomponent Nanomaterials"}, {"paperId": "89884630ffbfbc72d465136bb4db30b9726ce5e7", "title": "Streaming Hierarchical Clustering Based on Point-Set Kernel"}, {"paperId": "c1cd1355aa64492b0818c30db8d91c63b7ae9533", "title": "Multivariate interrelatedness of geotechnical and petrophysical properties towards developing near-surface lithology clusters in a sedimentary terrain"}, {"paperId": "d99aa4ba47cf42afd01c1edcf7f62cff82475d7c", "title": "What Should Be the Ideal Solvent Percentage and Solvent-Propolis ratio in the Preparation of Ethanolic Propolis Extract?"}, {"paperId": "b4227b737eac87d77557b6ef14088bd6c6708132", "title": "Relationships between landscape characteristics and the restorative quality of soundscapes in urban blue spaces"}, {"paperId": "04ca3f25cf502e3ee7295a22d0493603f2f5b567", "title": "Characteristics, correlations and health risks of PCDD/Fs and heavy metals in surface soil near municipal solid waste incineration plants in Southwest China."}, {"paperId": "224312f7b595c2c71ea0b1e2a35ae83fae09e3fd", "title": "Antioxidant, Antimicrobial Activities and Fatty Acid Compositions of Wild Berberis spp. by Different Techniques Combined with Chemometrics (PCA and HCA)"}, {"paperId": "7684e0c229928390b780cd4d5ad20bd993614fd1", "title": "Rendering Multivariate Statistical Models for Genetic Diversity Assessment in a A-Genome Diploid Wheat Population"}, {"paperId": "b8870883aa571d28418f5f54351289eea49d7a3e", "title": "On the origins of the demographic transition: rethinking the European marriage pattern"}, {"paperId": "b70010cf9aa9720546aa7e6984bced7a280382a2", "title": "Productivity Enhancement of Cucumber (Cucumis sativus L.) through Optimized Use of Poultry Manure and Mineral Fertilizers under Greenhouse Cultivation"}, {"paperId": "fbed418bd021242a29963503b43d3e0e44776fa0", "title": "Characterization of Volatile Organic Compounds in ‘Rossa di Tropea’ Onion by Means of Headspace Solid-Phase Microextraction Gas Chromatography–Mass Spectrometry (HS/SPME GC–MS) and Sensory Analysis"}, {"paperId": "26ca25a2c1c8233a439f92d8730200d50d058438", "title": "Spray drying of pure kiwiberry pulp in dehumidified air"}, {"paperId": "c6391192d1ab43ce2a03428a258d4ae04b85bf53", "title": "Investigating Transfer Learning of Smartphone-Sensed Stress in University Populations"}, {"paperId": "f19cbcc485f741f7c7e4622196f75b53cfac0b11", "title": "Changes in Quality Characteristics of Strawberry Juice After Equivalent High Pressure, Ultrasound, and Pulsed Electric Fields Processes"}, {"paperId": "58d6308a37ba22b572bbba09cd198b60d52aefe4", "title": "DIRECT DIELECTRIC BARRIER DISCHARGE IONIZATION PROMOTES RAPID AND SIMPLE LUBRICANT OIL FINGERPRINTING."}, {"paperId": "a1c34a78b482e9a10fcac51f4ae45f579cd09bb6", "title": "The Influence of Gas-phase Chemistry on Organic Haze Formation"}, {"paperId": "74b849d8f4b3b763abe6f524365062c8a8480a55", "title": "Analysis of free malondialdehyde in edible oils using gas-diffusion microextraction"}, {"paperId": "748e7269ec8b0aaecf9aebf472d6f60d4334adb1", "title": "Industry-scale spray-drying microencapsulation of orange aroma"}, {"paperId": "06d3f3925d3d55ee747ed2358e25eb0d21646441", "title": "Fused adjacency matrices to enhance information extraction: The beer benchmark."}, {"paperId": "1b3f474977fa262b79c74b8662cd3f77bc573b56", "title": "The application of dehumidified air in rapeseed and honeydew honey spray drying - Process performance and powders properties considerations"}, {"paperId": "86bee9af17ea8f75bf07e4fdf3043d7b6bed65d3", "title": "Periodic pattern mining from spatio-temporal trajectory data"}, {"paperId": "85b45ca4e1339472659c1d4067c3b0b025aab2ed", "title": "Optical Flow Based Online Moving Foreground Analysis"}, {"paperId": "f6b01f1d8ba57a7ff6dc1b3b61cd782079b001e7", "title": "Use of principal component analysis (PCA) and hierarchical cluster analysis (HCA) for multivariate association between bioactive compounds and functional properties in foods: A critical perspective"}, {"paperId": "50dd049afb31def6bd2d583b4ed42f23c7e81426", "title": "Hierarchical trajectory clustering for spatio-temporal periodic pattern mining"}, {"paperId": "dc8d35a69b6a576f34e1638a8d36be3f0cc82b11", "title": "Characterization of pharmaceutically relevant materials at the solid state employing chemometrics methods"}, {"paperId": "af4b6a1a43d77818ce195529241e45c881086f96", "title": "Chemometrics for Food Quality Control and Authentication"}, {"paperId": "d76bbab46e37260285a09a7eb8b0ee8bc0192758", "title": "“Populus spp. dormant bud production and chemical characterization of bioactive phenolic compounds from bud extracts and sprout exudates”"}]}
