{"paperId": "d9843797fa08db4a4321ac2bd982d1ef0b231c98", "publicationVenue": {"id": "7dc964d5-49e6-4c37-b1c4-a7f0de1fa425", "name": "International Conference on Web and Social Media", "type": "conference", "alternate_names": ["Int Conf Weblogs Soc Media", "International Conference on Weblogs and Social Media", "Int Conf Web Soc Media", "ICWSM"], "url": "http://www.aaai.org/Library/ICWSM/icwsm-library.php"}, "title": "Identifying Competition and Mutualism Between Online Groups", "abstract": "Platforms often host multiple online groups with overlapping topics and members. How can researchers and designers understand how related groups affect each other? Inspired by population ecology, prior research in social computing and human-computer interaction has studied related groups by correlating group size with degrees of overlap in content and membership, but has produced puzzling results: overlap is associated with competition in some contexts but with mutual-ism in others. We suggest that this inconsistency results from aggregating intergroup relationships into an overall environmental effect that obscures the diversity of competition and mutualism among related groups. Drawing on the framework of community ecology, we introduce a time-series method for inferring competition and mutualism. We then use this frame-work to inform a large-scale analysis of clusters of subreddits that all have high user overlap. We find that mutualism is more common than competition.", "venue": "International Conference on Web and Social Media", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-07-14", "journal": {"name": "ArXiv", "volume": "abs/2107.06970"}, "authors": [{"authorId": "9486542", "name": "Nathan TeBlunthuis"}, {"authorId": "37264444", "name": "Benjamin Mako Hill"}], "citations": [{"paperId": "f55412e83e09fb947ddd7010c8162f5666dde826", "title": "Community Archetypes: An Empirical Framework for Guiding Research Methodologies to Reflect User Experiences of Sense of Virtual Community"}, {"paperId": "00ad0eb1eecc5a04bd28e01fc2629b70e5a0c19d", "title": "Trauma lurking in the shadows: A Reddit case study of mental health issues in online posts about Childhood Sexual Abuse"}, {"paperId": "e56f27741621238f893db751df6eb55bfc1a06f6", "title": "The Impact of Governance Bots on Sense of Virtual Community"}, {"paperId": "01643877ef4bf7c75519469500bc73006bae0896", "title": "Moderation and authority-building process: the dynamics of knowledge creation on history subreddits"}, {"paperId": "cc6515db33b81429bdb3b4af9b5762dadcd9bf35", "title": "Rules and Rule-Making in the Five Largest Wikipedias"}, {"paperId": "dda9d9b371a7961be74fcfd77923d87d008b99dd", "title": "No Community Can Do Everything: Why People Participate in Similar Online Communities"}, {"paperId": "5dd9a3d66848fcf6b8c276fa4aca25f03e9ea3fb", "title": "Why do People Participate in Small Online Communities?"}]}
