{"paperId": "d9a8e6356dd70c1bd2673b82ecf73873e29707b6", "publicationVenue": null, "title": "2016 Ieee International Conference on Big Data (big Data) Deep Learning in the Automotive Industry: Applications and Tools", "abstract": "—Deep Learning refers to a set of machine learning techniques that utilize neural networks with many hidden layers for tasks, such as image classification, speech recognition, language understanding. Deep learning has been proven to be very effective in these domains and is pervasively used by many Internet services. In this paper, we describe different automotive uses cases for deep learning in particular in the domain of computer vision. We surveys the current state-of-the-art in libraries, tools and infrastructures (e. g. GPUs and clouds) for implementing, training and deploying deep neural networks. We particularly focus on convolutional neural networks and computer vision use cases, such as the visual inspection process in manufacturing plants and the analysis of social media data. To train neural networks, curated and labeled datasets are essential. In particular, both the availability and scope of such datasets is typically very limited. A main contribution of this paper is the creation of an automotive dataset, that allows us to learn and automatically recognize different vehicle properties. We describe an end-to-end deep learning application utilizing a mobile app for data collection and process support, and an Amazon-based cloud backend for storage and training. For training we evaluate the use of cloud and on-premises infrastructures (including multiple GPUs) in conjunction with different neural network architectures and frameworks. We assess both the training times as well as the accuracy of the classifier. Finally, we demonstrate the effectiveness of the trained classifier in a real world setting during manufacturing process. I. INTRODUCTION Machine learning and deep learning has many potential applications in the automotive domain both inside the vehicle , e. g. advanced driving assistance systems (ADAS), autonomous driving, and outside the vehicle, e. g. during development , manufacturing and sales & aftersales processes. Machine learning is an essential component for use cases, such as predictive maintenance of vehicles, personalized infotainment and location-based services, business process automation, supply chain and price optimization. A common challenge of these applications is the need for storage and processing of large volumes of data as well as the necessity to deal with unstructured data (videos, images, text), e. g. from camera-based sensors on the vehicle or machines in the manufacturing process. To effectively utilize this kind of data, new methods, such as deep learning, are required. Deep learning [1], [2] refers to a set of machine learning algorithms that utilize large neural networks with many hidden layers …", "venue": "", "year": null, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": null, "journal": null, "authors": [{"authorId": "50631038", "name": "André Luckow"}, {"authorId": "144828539", "name": "M. Cook"}, {"authorId": "8928057", "name": "Nathan Ashcraft"}, {"authorId": "49196954", "name": "Edwin Weill"}, {"authorId": "2320100", "name": "Emil Djerekarov"}, {"authorId": "30237179", "name": "Bennie Vorster"}], "citations": [{"paperId": "5e173f8fd297d7be7994766f4a75a7af7050b7c2", "title": "MLPro-MPPS - A Versatile and Configurable Production Systems Simulator in Python"}, {"paperId": "8c4673209b566be5c8928b498eb651a31c5abe8e", "title": "Do DL models and training environments have an impact on energy consumption?"}, {"paperId": "3bc15afc39dade72c9e2606c1bfa9a871047b3cb", "title": "Towards Continual Knowledge Learning of Vehicle CAN-data"}, {"paperId": "0051dd73b30a23bbde20246e2f795fc44e013d51", "title": "Application of Data Analytics in Automobile Manufacturing-- Evidence from Existing Literature"}, {"paperId": "8f7a20f9d8fd036b67c7f688b31fc18bbb82c5e5", "title": "Semi-Supervised Approach for Early Stuck Sign Detection in Drilling Operations"}, {"paperId": "65506048e727cfe13ca81957970f64c94c5d0fa6", "title": "An application of Generative Adversarial Networks to improve automatic inspection in automotive manufacturing"}, {"paperId": "581139afa149d1c04fc7892dd1158708e274793b", "title": "Lightweight and Energy-Efficient Deep Learning Accelerator for Real-Time Object Detection on Edge Devices"}, {"paperId": "8a4f4ce05c6278e38452d6673144d82dac0e03c6", "title": "Communication Based Sensing Technology Integrated In Levels of Vehicular Autonomy"}, {"paperId": "4bc0e9d4dfaa083579b6e205c4af144b2b3a5244", "title": "Improved Lightweight Mango Sorting Model Based on Visualization"}, {"paperId": "76e5d50c67ba328fc4549f1099b653b916554002", "title": "Machine Learning Applications in Surface Transportation Systems: A Literature Review"}, {"paperId": "82c9da3eef14ec088fea8d22faf70c6a7e42a7d7", "title": "Hybrid Quality Inspection for the Automotive Industry: Replacing the Paper-Based Conformity List through Semi-Supervised Object Detection and Simulated Data"}, {"paperId": "bafbe3e5a9be64d57ddbf0ecd6a503228dac6881", "title": "Redundant dataflow applications on clustered manycore architectures"}, {"paperId": "1f59025e989e7f7fd806b86e7cedce109eb502b1", "title": "Recent Advances in Vision-Based On-Road Behaviors Understanding: A Critical Survey"}, {"paperId": "51d367221c03fed4f7db0f220ea4c6771af9cea8", "title": "Pressure Sensor Data Modeling with Recurrent Conditional Generative Adversarial Networks"}, {"paperId": "1822dd4675de95f3bb33dd3d7d8f34cb625ac2bf", "title": "Spiker: an FPGA-optimized Hardware accelerator for Spiking Neural Networks"}, {"paperId": "4b1d7b40fc9da41120eacae1b4af76cf9bbaddc1", "title": "QUDOS: quorum-based cloud-edge distributed DNNs for security enhanced industry 4.0"}, {"paperId": "4e73781697ac26fa60119fe554bc48f5ef7c0088", "title": "Deep Learning for the Industrial Internet of Things (IIoT): A Comprehensive Survey of Techniques, Implementation Frameworks, Potential Applications, and Future Directions"}, {"paperId": "ddbc8cf0dc042be2210e7763be54f0ca3b267e9f", "title": "Improving deep learning performance by using Explainable Artificial Intelligence (XAI) approaches"}, {"paperId": "7489988219665b95c40121fc23b742f5f5c694e0", "title": "Deep Learning: An Application Perspective"}, {"paperId": "b5b931c6c334464c7a720c3fa35bbb0e9640daea", "title": "A Systematic Approach for Evaluating Artificial Intelligence Models in Industrial Settings"}, {"paperId": "c0ab60b3e30366f5c3b7d7ce4ab7727edad5f009", "title": "A systematic survey of deep learning in breast cancer"}, {"paperId": "d1e52b481fa72a079cf299cf5dbf8252decc50ce", "title": "BCNet: A Deep Convolutional Neural Network for Breast Cancer Grading"}, {"paperId": "53d5b7ecde36fda878381fc990aaf36fd2a9c1af", "title": "Depression Diagnosis by Deep Learning Using EEG Signals: A Systematic Review"}, {"paperId": "30019918d29efeace7675292df8702d012dc9a9d", "title": "Argus CNN Accelerator Based on Kernel Clustering and Resource-Aware Pruning"}, {"paperId": "a41518e124ea193e91e50217a958436629ba9470", "title": "Deep Learning in Manufacturing"}, {"paperId": "c8588ffc7e27c2ecddcdb8c445602004c8e9b0ea", "title": "Automatic quality inspection in the automotive industry: a hierarchical approach using simulated data"}, {"paperId": "0d47458cb474bbefa04fc57a13eb679abb63e4eb", "title": "Application of machine learning to estimate fireball characteristics and their uncertainty from infrared spectral data"}, {"paperId": "94d309fc461306dcdc4197063b00922bbf76f468", "title": "Physical principles of brain–computer interfaces and their applications for rehabilitation, robotics and control of human brain states"}, {"paperId": "bc46f2311fa72a68d63a9df2569e1dc936ecd590", "title": "Impact of Covid-19 Pandemic in the Automobile Industry: A Case Study"}, {"paperId": "8c372ff51fe1444c93b2c783a3a0f5e5cd687878", "title": "A Statistician Teaches Deep Learning"}, {"paperId": "eb511d24381acf682fa3cea814271e567f98f73b", "title": "Turn Signal Prediction: A Federated Learning Case Study"}, {"paperId": "4536ebad8a1bf8e08e41359f587cf030998a0fd9", "title": "Varietal quality control in the nursery plant industry using computer vision and deep learning techniques"}, {"paperId": "d8ece1181a52b171143131c351e77894a689509a", "title": "Securing Deep Spiking Neural Networks against Adversarial Attacks through Inherent Structural Parameters"}, {"paperId": "6091c9776293a61e56480d678c8695ea9115ba14", "title": "Image Recognition Based Autonomous Driving: A Deep Learning Approach"}, {"paperId": "cf2c8b2270afaeda886f34e9ff8b26e7308c682f", "title": "FPGA-Based Reliable Fault Secure Design for Protection against Single and Multiple Soft Errors"}, {"paperId": "085f657d684c50eff68fb3067ad006784e2fad21", "title": "Analyzing the Performance of Smart Industry 4.0 Applications on Cloud Computing Systems"}, {"paperId": "daaa37d40998164d0889d9f00d7e015209746ca5", "title": "Using Convolutional Neural Networks to Automate Aircraft Maintenance Visual Inspection"}, {"paperId": "515515f4210803432ba5e0a5ceedc4c369655671", "title": "A Novel Framework Using Deep Auto-Encoders Based Linear Model for Data Classification"}, {"paperId": "1a53013fdd66e61ed117ef1fc90dcfbed5a473a5", "title": "Use cases and success stories of a data analytics system in an automotive Paint Shop"}, {"paperId": "573063b7ff6ebd0a93a82aa88bc124c6445472c1", "title": "Cloud2Edge Elastic AI Framework for Prototyping and Deployment of AI Inference Engines in Autonomous Vehicles"}, {"paperId": "301863bae4f8a0759e37ef107389372f24e7720d", "title": "Trajectory based lateral control: A Reinforcement Learning case study"}, {"paperId": "96902ba638b954010fd674c11482e4fa037e42a8", "title": "Classification of High - Voltage Ignition Waveforms Using Deep Learning"}, {"paperId": "5714c397ab56ae1d60de09ce074d7001e54a5457", "title": "Vehicle Damage Classification and Fraudulent Image Detection Including Moiré Effect Using Deep Learning"}, {"paperId": "e1108652f4351999e48ebc48a964bb3d1b0daa06", "title": "Deep Learning in Industrial Internet of Things: Potentials, Challenges, and Emerging Applications."}, {"paperId": "58cc0c751067878b43fd972c9b4568da4656ad16", "title": "A machine learning‐based memory forensics methodology for TOR browser artifacts"}, {"paperId": "a6e6af76debf5ea7692da999cd5ddefa59ce76dc", "title": "Large-scale machine learning systems in real-world industrial settings: A review of challenges and solutions"}, {"paperId": "50d46f548819c8ed830d92b694864145f6d0ba27", "title": "Feature Concentration for Supervised and Semisupervised Learning With Unbalanced Datasets in Visual Inspection"}, {"paperId": "98a525fb7080b36d47d5eb53fc163c8667db7c3f", "title": "Go-CaRD - Generic, Optical Car Part Recognition and Detection: Collection, Insights, and Applications"}, {"paperId": "a17d298d8cf8d2b1dc520a91aeec610e3f50b6dd", "title": "Generating Input Data for Microstructure Modelling: A Deep Learning Approach Using Generative Adversarial Networks"}, {"paperId": "d0385178a3d573b36c5a763025cecbdbaa8d896a", "title": "Data Augmentation Method by Applying Color Perturbation of Inverse PSNR and Geometric Transformations for Object Recognition Based on Deep Learning"}, {"paperId": "971c35bcab25fbf4fd4bb6e128cf2586f0ab1d67", "title": "Manufacturing big data ecosystem: A systematic literature review"}, {"paperId": "de509811cf5dda0773be9690dc0ed1be400dc7e6", "title": "Deployment of a cloud pipeline for real‐time visual inspection using fast streaming high‐definition images"}, {"paperId": "e663e20b30a2fdb87af2a31938f99d0cdfb1c417", "title": "Deep Metallic Surface Defect Detection: The New Benchmark and Detection Network"}, {"paperId": "0caa61c0ffa59fd74e11368b77e267bc27bf5564", "title": "Engineering AI Systems: A Research Agenda"}, {"paperId": "56a8d1c2068003acbb23e2c8ed9cf4b0026403c6", "title": "Generating Exploration Mission-3 Trajectories to a 9:2 NRHO using Machine Learning"}, {"paperId": "9f6dedf3cec8edce5f740ab8f7462e3231f418f6", "title": "Vehicle detection in intelligent transport system under a hazy environment: a survey"}, {"paperId": "bf1dd92bf2dcb73258a3b6710cec1852a3c866fe", "title": "EdgeInsight: Characterizing and Modeling the Performance of Machine Learning Inference on the Edge and Cloud"}, {"paperId": "e54decbc93829199be6108ed597e38345e2f74b5", "title": "The application of artificial neural networks in metabolomics: a historical perspective"}, {"paperId": "8b65ee9e5e9e981b75e335e05009a80b80a73f2e", "title": "Edge-cloud orchestration driven industrial smart product-service systems solution design based on CPS and IIoT"}, {"paperId": "85001262a1d6113d20f3ea973a5de6b0ac1ecc80", "title": "Automatic Classification of Multiple Objects in Automotive Assembly Line"}, {"paperId": "bc13b8ca440d2e60864216eca68ec15001ce62a0", "title": "Fast mesh denoising with data driven normal filtering using deep autoencoders"}, {"paperId": "0ee3ea41671578cddf6d76d9297840b5d1565866", "title": "Global Adversarial Attacks for Assessing Deep Learning Robustness"}, {"paperId": "bee004c421d33253a70bfc423132f258fda04c8e", "title": "A Cloud-Based AI Framework for Machine Learning Orchestration: A “Driving or Not-Driving” Case-Study for Self-Driving Cars"}, {"paperId": "e67121cd31e95fba6c892724e619323ad7564b03", "title": "A Survey of Deep Learning and Its Applications: A New Paradigm to Machine Learning"}, {"paperId": "fa13e47cd042d22dfcef4a2883d7c56987ae3483", "title": "A new framework using deep auto-encoder and energy spectral density for medical waveform data classification and processing"}, {"paperId": "4cf19f55dfbd3a032ef3100862108379dd9547c1", "title": "Performance and Memory Trade-offs of Deep Learning Object Detection in Fast Streaming High-Definition Images"}, {"paperId": "44dfee6c1d066c3f03397ccc7cbd5e7a0f8b79a3", "title": "Artificial Intelligence and Deep Learning Applications for Automotive Manufacturing"}, {"paperId": "a8cc6e722ce7fa1a169e3f56dbf52afaadc55682", "title": "An Automatic Object Detection and Location System applying Faster R-CNN"}, {"paperId": "c7648fbeabeac7921fc95b9dbaec0fab9700cf58", "title": "A Multi-Platform Framework for Artificial Intelligence Engines in Automotive Systems"}, {"paperId": "2ba1d8e100fcb5665b5d813ef95051694335d026", "title": "Development of AR Information System Based on Deep Learning and Gamification"}, {"paperId": "454b7a0806de86a95a7b7df8ed3f196aff66532d", "title": "Machine Learning Techniques in ADAS: A Review"}, {"paperId": "6e600238c60c1372af95a315137b98c9c9195ecd", "title": "A Survey on Network Intrusion Detection"}, {"paperId": "e539f230b658b0f493bf1212e6d72d14a2d923b3", "title": "Deep learning beyond cats and dogs: recent advances in diagnosing breast cancer with deep neural networks."}, {"paperId": "c4f603925589eb99ca47e33a8d767d4f85486b97", "title": "Machine learning: Trends and applications"}, {"paperId": "bd187512a3ce46c59ea0b392c6b9197ce00979c2", "title": "Replicating a Trading Strategy by Means of LSTM for Financial Industry Applications"}, {"paperId": "78f7c6818c97383b5ae4b61664ffc6cde7974466", "title": "A Deep Learning Approach to Network Intrusion Detection"}, {"paperId": "d63b884d5ebc739f6e1bdf861fa9276260781404", "title": "Deep Learning for IoT Big Data and Streaming Analytics: A Survey"}, {"paperId": "5b1c6e0796a28f571c8517b76d666767ebdf4c0f", "title": "Deep learning combined with de-noising data for network intrusion detection"}, {"paperId": "874ff0732aa1b35be15ee08cfa15e2620672ed74", "title": "相位恢复波前重构技术的发展与应用（特邀）"}, {"paperId": "3c0267d29c30cfa4815a2e470f929db180311668", "title": "A Real-Time C-V2X Beamforming Selector Based on Effective Sequence to Sequence Prediction Model Using Transitional Matrix Hard Attention"}, {"paperId": "a7fa2c578d2b555b695d45c210ff40b55208e94d", "title": "FPG-AI: A Technology-Independent Framework for the Automation of CNN Deployment on FPGAs"}, {"paperId": "f98702218bf3c9a36632d9157e24e8f40323dd34", "title": "Intrusion Detection Systems in Internet of Things and Mobile Ad-Hoc Networks"}, {"paperId": "c7ede1be4268684b92ced4a3bcf6dc85382a4f6c", "title": "FPGA-optimized Hardware acceleration for Spiking Neural Networks"}, {"paperId": "83615f7bc4b5c306b229d892549c52e732fd0db6", "title": "Toward Performing Image Classification and Object Detection With Convolutional Neural Networks in Autonomous Driving Systems: A Survey"}, {"paperId": "f855fa3160f469e1dbfc0fdc46f8d0a798cf6d28", "title": "KIDE4Assistant: an Ontology-Driven Dialogue System Adaptation for Assistance in Maintenance Procedures"}, {"paperId": "082404e218360af264b80318dfb27afa6421e370", "title": "Application of Machine Learning and Deep Learning"}, {"paperId": "09a7ba6c8016be74be0702d3404acb1a7e1bd761", "title": "Deployment Service for Scalable Distributed Deep Learning Training on Multiple Clouds"}, {"paperId": "5cd4949d06b087e781db28bfa0b50813011089de", "title": "A DEEP LEARNING APPROACH TO AUTONOMOUS DRIVING IN URBAN ENVIRONMENT"}, {"paperId": "0fc6980f8788133227d27e2aeff8cd6d216258d1", "title": "Nightmare Machine: A Large-Scale Study to Induce Fear Using Artificial Intelligence"}, {"paperId": "6ffd60e21be26573faa42b2c6e432af4d92928b5", "title": "Intelligent Mobile Plant Disease Diagnostic System Using NASNet-Mobile Deep Learning"}, {"paperId": "25e4308b47416b8e4afe8c034e887cbfa6ae1146", "title": "Blackthorn: Latency Estimation Framework for CNNs on Embedded Nvidia Platforms"}, {"paperId": "a6fc48f5091a15b0000b5a9a639c260fec7d9b1f", "title": "2nd International Workshop on Autonomous Systems Design, ASD 2020, March 13, 2020, Grenoble, France (Virtual Conference)"}, {"paperId": "46494ae8a08e64158212cc0718275c198db1a966", "title": "Agile Requirement Engineering for a Cloud System for Automated and Networked Vehicles"}, {"paperId": "3b0fc109e3f4ea5ea68a5d71f33e6887a6bbf19a", "title": "Engine Labels Detection for Vehicle Quality Verification in the Assembly Line: A Machine Vision Approach"}, {"paperId": "a5f6a28f77995402f7575b9c4a31e8ab0fb37611", "title": "A HYBRID MODEL FOR CLASSIFYING PLANT STRESSES"}, {"paperId": "af5a0fe9f034831e619f6a9f832141bf4cd10be9", "title": "Exposing Deep Learning Vulnerability via Global Adversarial Attacks"}, {"paperId": "8c8fa6bef085cbe54cd8d87c6c495fcc15176b99", "title": "Global Adversarial Example : Local Adversarial Example Learned Decision Boundary Training Example Training Example Figure 1 :"}, {"paperId": "c9b574060c757800e1704953c894ab007c36006c", "title": "Automated Deployment of an End-to-End Pipeline on Amazon Web Services for Real-Time Visual Inspection using Fast Streaming High-Definition Images"}, {"paperId": "c53dfabd7dd2b76dbfe35a62de812bb4014e763b", "title": "Big Data, Small Data, and Getting Products Right First Time"}, {"paperId": "4c11d0ef43bdffeeab2be7c3319adb4752446559", "title": "Automated quality assurance as an intelligent cloud service using machine learning"}, {"paperId": "0c867c45fc2f7c89b3a3c725599b20eb080e59a6", "title": "Edge-Computing Deep Learning-Based Computer Vision Systems"}, {"paperId": "0239391353e63e5286f6e7f2ce9b9bd6aca922ee", "title": "Sensor Modelling with Recurrent Conditional GANs"}, {"paperId": "d63b10e01e2837240b281fbf8d56210666d641f7", "title": "Probabilistic Modelling of Sensors in Autonomous Vehicles Autoregressive Input/Output Hidden Markov Models for Time Series Analysis"}]}
