{"paperId": "d9b34ea45e4ef3f1e3227bfc7f17889d2cd17608", "publicationVenue": {"id": "501c1070-b5d2-4ff0-ad6f-8769a0a1e13f", "name": "Wireless Communications and Mobile Computing", "type": "journal", "alternate_names": ["Wirel Commun Mob Comput"], "issn": "1530-8669", "url": "https://www.hindawi.com/journals/wcmc/", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/15308677", "http://www.interscience.wiley.com/jpages/1530-8669/"]}, "title": "International Trade Transportation Cost Based on Internet of Things-Assisted Wireless Network Virtualization", "abstract": "With the development of information technology and the advent of the Internet of Everything era, more and more fields have begun to use the convenience of the Internet of Things to solve problems. International trade is a form of trade that develops rapidly under the world trade situation, and the optimization of transportation costs has always been an important issue to be solved in international trade. Wireless network virtualization (WNV for short) is an abstraction of the concept of wireless network connectivity. It allows remote users to access an organization’s internal network as if it was a physical connection. WNV has the characteristics of safety assurance, service quality assurance, scalability, flexibility, and manageability, and it has many advantages in the transportation industry. This paper is aimed at studying an IoT-assisted WNV technology to analyze the cost of international trade transportation. This paper proposes a resource optimization algorithm based on WNV and uses this algorithm to test the designed IoT-assisted WNV model. The test results show that using the WNV model can reduce the cost of transportation price by 3.13 yuan per ton per month on average, and the improved transportation efficiency is an average increase of 0.152 tons per kilometer per hour. The total transportation cost obtained by the WNV algorithm model in this paper is significantly reduced, and the transportation cost calculation effect using this model is better.", "venue": "Wireless Communications and Mobile Computing", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-06-10", "journal": {"name": "Wireless Communications and Mobile Computing"}, "authors": [{"authorId": "2118462342", "name": "Yue Wang"}, {"authorId": "40400230", "name": "Wei Li"}], "citations": []}
