{"paperId": "d9ba8c1b08f23021ff59f8c1500b942b19fb2cdb", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Digital Twin for Safety and Security: Perspectives on Building Lifecycle", "abstract": "As digital twins are gaining importance in various industries, research on their impact, use cases, and implementation in the field of construction is accelerating. In this study, we examine the impact of digital twins on building safety and security throughout their lifecycle, utilizing two state-of-the-art use cases for fire and anomaly detection. The solution employs advanced sensors, 3D visualizations for detecting safety and security threats, and data analysis to predict potential future threats. Using the data that was collected over a seventeen-month period, we present an implementation architecture for safety and security digital twins in buildings, explore the benefits and shortcomings of such a system, and discuss the learnings applicable to different lifecycle stages of a building. This paper contributes to the creation and study of a digital twin for fire safety, analyzing its performance using two real-world use cases and reporting the implementation results. Additionally, we extrapolate the learnings from the use phase of a facility to other lifecycle phases of buildings and facilities.", "venue": "IEEE Access", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "52339-52356", "volume": "11"}, "authors": [{"authorId": "2634806", "name": "Siavash H. Khajavi"}, {"authorId": "87585678", "name": "Müge Tetik"}, {"authorId": "46271003", "name": "Zixuan Liu"}, {"authorId": "120067064", "name": "P. Korhonen"}, {"authorId": "1776734", "name": "J. Holmström"}], "citations": [{"paperId": "1480899df5d17c689073d5932028059a3dbee38f", "title": "Digital Twin Approach in Buildings: Future Challenges via a Critical Literature Review"}, {"paperId": "1a48748e58832493d15e0f4ba902b842bb2acf0d", "title": "Developing an integrative framework for digital twin applications in the building construction industry: A systematic literature review"}, {"paperId": "c682f08d24c40439a7c43aabe3ee73fe0303be58", "title": "Digital-Twin-Based Fire Safety Management Framework for Smart Buildings"}, {"paperId": "4cf2ab4017ac286c863076b82fcd110d248ea4fd", "title": "Residents' satisfaction of property management mobile applications: a study in the context of strata property in Kuala Lumpur, Malaysia"}]}
