{"paperId": "d9bee3ad1d2a33d48a6daf47b20e92541d3bf749", "publicationVenue": {"id": "d9720b90-d60b-48bc-9df8-87a30b9a60dd", "name": "Neural Information Processing Systems", "type": "conference", "alternate_names": ["Neural Inf Process Syst", "NeurIPS", "NIPS"], "url": "http://neurips.cc/"}, "title": "VeriDark: A Large-Scale Benchmark for Authorship Verification on the Dark Web", "abstract": "The DarkWeb represents a hotbed for illicit activity, where users communicate on different market forums in order to exchange goods and services. Law enforcement agencies benefit from forensic tools that perform authorship analysis, in order to identify and profile users based on their textual content. However, authorship analysis has been traditionally studied using corpora featuring literary texts such as fragments from novels or fan fiction, which may not be suitable in a cybercrime context. Moreover, the few works that employ authorship analysis tools for cybercrime prevention usually employ ad-hoc experimental setups and datasets. To address these issues, we release VeriDark: a benchmark comprised of three large scale authorship verification datasets and one authorship identification dataset obtained from user activity from either Dark Web related Reddit communities or popular illicit Dark Web market forums. We evaluate competitive NLP baselines on the three datasets and perform an analysis of the predictions to better understand the limitations of such approaches. We make the datasets and baselines publicly available at https://github.com/bit-ml/VeriDark", "venue": "Neural Information Processing Systems", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-07-07", "journal": {"name": "ArXiv", "volume": "abs/2207.03477"}, "authors": [{"authorId": "2143755178", "name": "Andrei Manolache"}, {"authorId": "22225752", "name": "Florin Brad"}, {"authorId": "1739398670", "name": "Antonio Bărbălău"}, {"authorId": "1817759", "name": "Radu Tudor Ionescu"}, {"authorId": "49006356", "name": "M. Popescu"}], "citations": [{"paperId": "e65a96b55fe8ac5532f8075a81c64bafb16b7866", "title": "Incorporating historical information by disentangling hidden representations for mental health surveillance on social media"}, {"paperId": "1147b74b8038bc3cdde72aea613cd08f7348316c", "title": "Darkweb research: Past, present, and future trends and mapping to sustainable development goals"}, {"paperId": "221244d5c567301ddecd628e5a67e942f23e4ae4", "title": "IDTraffickers: An Authorship Attribution Dataset to link and connect Potential Human-Trafficking Operations on Text Escort Advertisements"}, {"paperId": "b4826ac8e0c1d32eaa574109b16707f5f0e7e468", "title": "Towards Safe Cyber Practices: Developing a Proactive Cyber-Threat Intelligence System for Dark Web Forum Content by Identifying Cybercrimes"}, {"paperId": "a734d357a61a517cfa7e4d8fc7edc28edf372658", "title": "VendorLink: An NLP approach for Identifying & Linking Vendor Migrants & Potential Aliases on Darknet Markets"}, {"paperId": "a32d68d92913650e254c728157693f7a3600d0f4", "title": "NBC-Softmax : Darkweb Author fingerprinting and migration tracking"}, {"paperId": "8297a3b52eea4e8c3ab8e97910839b4a3b917891", "title": "On the State of the Art in Authorship Attribution and Authorship Verification"}, {"paperId": "459a0561c480aa6610ec1e0fd9747862e23ff876", "title": "Active Learning for News Article’s Authorship Identification"}, {"paperId": "32cf75a5b49165726ab21fc742ea04265ffff46f", "title": "Valla: Standardizing and Benchmarking Authorship Attribution and Verification Through Empirical Evaluation and Comparative Analysis"}]}
