{"paperId": "d9c08fbf45d4d164627ab3eb29acb1f8b5fee61d", "publicationVenue": {"id": "d286fdd0-3b6c-433c-afee-87228d8e9f93", "name": "IEEE Transactions on Dependable and Secure Computing", "type": "journal", "alternate_names": ["IEEE Trans Dependable Secur Comput"], "issn": "1545-5971", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=8858"}, "title": "Privacy-Preserving Secret Shared Computations Using MapReduce", "abstract": "Data outsourcing allows data owners to keep their data at untrusted clouds that do not ensure the privacy of data and/or computations. One useful framework for fault-tolerant data processing in a distributed fashion is MapReduce, which was developed for trusted private clouds. This paper presents algorithms for data outsourcing based on Shamir’s secret-sharing scheme and for executing privacy-preserving SQL queries such as count, selection including range selection, projection, and join while using MapReduce as an underlying programming model. Our proposed algorithms prevent an adversary from knowing the database or the query while also preventing output-size and access-pattern attacks. Interestingly, our algorithms do not involve the database owner, which only creates and distributes secret-shares once, in answering any query, and hence, the database owner also cannot learn the query. Logically and experimentally, we evaluate the efficiency of the algorithms on the following parameters: (i) the number of communication rounds (between a user and a server), (ii) the total amount of bit flow (between a user and a server), and (iii) the computational load at the user and the server.", "venue": "IEEE Transactions on Dependable and Secure Computing", "year": 2018, "fieldsOfStudy": ["Computer Science", "Mathematics"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-01-31", "journal": {"name": "IEEE Transactions on Dependable and Secure Computing", "pages": "1645-1666", "volume": "18"}, "authors": [{"authorId": "1724392", "name": "S. Dolev"}, {"authorId": "2028613957", "name": "Peeyush Gupta"}, {"authorId": "2111190002", "name": "Yin Li"}, {"authorId": "144156242", "name": "S. Mehrotra"}, {"authorId": "2028614385", "name": "Shantanu Sharma"}], "citations": [{"paperId": "fdb57b7be799b5d21a5e402431635d7e66a4237e", "title": "Privacy-Preserving Queries Using Multisource Private Data Counting on Real Numbers in IoT"}, {"paperId": "d2178e8d12af451979a068c982f527334fedb893", "title": "Gradient leakage attacks in federated learning"}, {"paperId": "7294694af443bb28ba597d0320fbf134a8651149", "title": "Upgrading script watermarking robustness of unusual-to-tolerate functional confirmation by secret-sharing"}, {"paperId": "038bfb1084c7ea4a8185afc16b9f802cb90e5e75", "title": "Assessment of Waste Management through Mobile Edge Computing and Deep Learning"}, {"paperId": "3e5cab08c7bea1321430ff15855278094c6756e6", "title": "Cryptographic Techniques for Data Processing"}, {"paperId": "e6d88148f251086c9cd233ee1c474e7962ed75ca", "title": "Computing"}, {"paperId": "91531cb745eaa5b60d9abdbe19b8926267e64baf", "title": "TextHide: Tackling Data Privacy for Language Understanding Tasks"}, {"paperId": "d288c1fdfe83b934ec86155c7661950ac98ac1e1", "title": "InstaHide: Instance-hiding Schemes for Private Distributed Learning"}, {"paperId": "8ee270902c5dc3cdf5ca8d6a0658ce4f5d14470b", "title": "Partition Selection for Large-Scale Data Management Using KNN Join Processing"}, {"paperId": "543ce4e5da66adf4106314a7091c07af708660f8", "title": "PANDA"}, {"paperId": "09ac90524664ab1158fbd1d53bb55162518bf145", "title": "Obscure: Information-Theoretically Secure, Oblivious, and Verifiable Aggregation Queries on Secret-Shared Outsourced Data"}, {"paperId": "0b6a33fe2b0fcc7479338428d1d0ae1bc241e8c7", "title": "Advances in Cryptography and Secure Hardware for Data Outsourcing"}, {"paperId": "b3e47482e34fa130320bba427ccd466b9c1d5f1c", "title": "Recent Advances in Information-Theoretically Secure Data Outsourcing"}, {"paperId": "2daa29c3752860a45282003f636a97f9972ff94a", "title": "Attribute based honey encryption algorithm for securing big data: Hadoop distributed file system perspective"}, {"paperId": "733e596bcf1f2dc32aa17c3671c6c295531410f6", "title": "Obscure: Information-Theoretic Oblivious and Verifiable Aggregation Queries"}, {"paperId": "57dfd0ff534c167061030856af58dd2ab702626c", "title": "Partitioned Data Security on Outsourced Sensitive and Non-Sensitive Data"}]}
