{"paperId": "d9f934331cd908eddef11e57a8b99ba10cc950c8", "publicationVenue": {"id": "1c33551e-10c3-4d44-84d5-3be94805ee3e", "name": "Journal of Advanced Transportation", "type": "journal", "alternate_names": ["J Adv Transp"], "issn": "0197-6729", "url": "https://www.hindawi.com/journals/jat/", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/20423195", "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)2042-3195"]}, "title": "Attention Mechanism with Spatial-Temporal Joint Deep Learning Model for the Forecasting of Short-Term Passenger Flow Distribution at the Railway Station", "abstract": "Accurate understanding of passenger flow distribution is crucial for effective station crowd management. However, due to the complexity and randomness of passenger flow and the unclear spatial-temporal correlation between functional areas within the station, predicting the spatiotemporal distribution dynamics of inflow and future short-term distribution trends is challenging. Emerging deep learning models offer valuable insights for accurately predicting passenger flow distribution. Thus, we propose a deep learning architecture, named “ST-Bi-LSTM,” which combines a bidirectional long short-term memory network with a spatial-temporal attention mechanism. Initially, we outline the methodologies of Bi-LSTM, the DeepWalk-based spatial attention mechanism, and the temporal attention mechanism. The spatial attention mechanism is employed to extract station spatial network topology information and enhance the representation of passenger flow characteristics in highly correlated areas during the forecasting process. Simultaneously, the temporal attention Bi-LSTM is utilized for capturing temporal correlations. The architecture comprises four branches dedicated to station real-time video monitoring data, spatial network topology, function area attributes, and train timetables. Subsequently, leveraging in-station CCTV data, passenger travel behavior data, and train timetables, we apply the architecture to the Tianjin West High-Speed Railway Station. We conduct a comparative analysis of the prediction performance and time complexity of the proposed architecture against existing baseline models, demonstrating superior performance and robustness exhibited by the ST-Bi-LSTM model (achieving a reduction in RMSE of over 10%). This study facilitates the transition of station management from passive response to active prediction of station passenger flow dynamics.", "venue": "Journal of Advanced Transportation", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-03-11", "journal": {"name": "Journal of Advanced Transportation"}, "authors": [{"authorId": "2291248817", "name": "Zhicheng Dai"}, {"authorId": "2274923494", "name": "Dewei Li"}, {"authorId": "2292151250", "name": "Shiqing Feng"}], "citations": []}
