{"paperId": "da024846fa95cfbd9b08231e8276c079dae587c6", "publicationVenue": {"id": "0d993d4a-09ba-4df8-90a4-7dfe25f0cb9e", "name": "ACM Transactions on Intelligent Systems and Technology", "type": "journal", "alternate_names": ["ACM Trans Intell Syst Technol"], "issn": "2157-6904", "url": "http://portal.acm.org/tist", "alternate_urls": ["https://tist.acm.org/"]}, "title": "Discovering Interesting Subpaths with Statistical Significance from Spatiotemporal Datasets", "abstract": "Given a path in a spatial or temporal framework, we aim to find all contiguous subpaths that are both interesting (e.g., abrupt changes) and statistically significant (i.e., persistent trends rather than local fluctuations). Discovering interesting subpaths can provide meaningful information for a variety of domains including Earth science, environmental science, urban planning, and the like. Existing methods are limited to detecting individual points of interest along an input path but cannot find interesting subpaths. Our preliminary work provided a Subpath Enumeration and Pruning (SEP) algorithm to detect interesting subpaths of arbitrary length. However, SEP is not effective in avoiding detections that are random variations rather than meaningful trends, which hampers clear and proper interpretations of the results. In this article, we extend our previous work by proposing a significance testing framework to eliminate these random variations. To compute the statistical significance, we first show a baseline Monte-Carlo method based on our previous work and then propose a Dynamic Search-and-Prune (D-SAP) algorithm to improve its computational efficiency. Our experiments show that the significance testing can greatly suppress the noisy detections in the output and D-SAP can greatly reduce the execution time.", "venue": "ACM Transactions on Intelligent Systems and Technology", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-01-09", "journal": {"name": "ACM Transactions on Intelligent Systems and Technology (TIST)", "pages": "1 - 24", "volume": "11"}, "authors": [{"authorId": "46269169", "name": "Yiqun Xie"}, {"authorId": "3209119", "name": "Xun Zhou"}, {"authorId": "145072875", "name": "S. Shekhar"}], "citations": [{"paperId": "5caab99564af7b41881f170cbd69f445383b519c", "title": "Scalable Evaluation of Local K-Function for Radius-Accurate Hotspot Detection in Spatial Networks"}, {"paperId": "2a2519ecf6f36f62f993783a399b649ba6f95dfd", "title": "Sustainable Road Planning for Trucks in Urbanized Areas of Chinese Cities Using Deep Learning Approaches"}]}
