{"paperId": "da02c1777f218dd1bfeda1a5ab8c92c02ea41c17", "publicationVenue": {"id": "4a7d25c5-ef2f-42b8-bc45-57a4f36e3ae9", "name": "Advances in Space Research", "type": "journal", "alternate_names": ["Adv Space Res"], "issn": "0273-1177", "url": "http://www.elsevier.com/wps/find/journaldescription.cws_home/644/description#description", "alternate_urls": ["http://www.sciencedirect.com/science/journal/02731177"]}, "title": "Google dataset search and DOI for data in the ESA space science archives", "abstract": "<p>The ESAC Science Data Centre (ESDC) is in the process of registering Digital Object Identifiers (DOIs) for datasets or group of datasets accessible across the ESA Space Science Archives managed by ESDC. These DOIs are persistent URL that point to DOI landing pages setup and managed by ESDC, actually located at https://www.cosmos.esa.int/web/esdc/doi</p>\n<p>In the heliophysics domain, the first step has been to register DOIs related to the datasets measured by experiments&#160;onboard ESA heliophysics spacecraft. Around 60 experiments are flying or have been flown so far onboard ESA heliophysics missions. At the moment, 47 DOI have been registered with CrossRef pointing to DOI landing pages for each experiment onboard SOHO, Proba-2, Cluster, Double Star, Ulysses and ISS-Solaces and are publicly accessible at&#160;https://www.cosmos.esa.int/web/esdc/doi/heliophysics. Discussions are on-going with editors of major journal to promote and acknowledge the use of data from any of these experiments by citing these DOIs. Eventually, this would improve the traceability of the usage of datasets from these experiments.</p>\n<p>Additionally, a JavaScript Object Notation (JSON) script has been added to these DOI landing pages to make them discoverable through Google Dataset Search (GDS). GDS is a new search engine that helps users to find datasets online. Twenty five millions datasets were already indexed&#160;and&#160;searchable when this service was launched in early 2020, after a beta version released in late 2018. Thanks to a close interaction with the PI teams, DOIs for ESA heliophysics experiments are now easily discoverable through GDS and not only by looking for a particular experiment name. The use of structured metadata, based on schema.org, has enabled the search through physical processes investigated by these experiments, the type of experiments, the time coverage, the PI names or their affiliation&#8230; Various examples will be provided while the next steps of development will be outlined.</p>", "venue": "Advances in Space Research", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2020-10-08", "journal": {"name": "Advances in Space Research", "pages": "2504-2516", "volume": "67"}, "authors": [{"authorId": "38560899", "name": "A. Masson"}, {"authorId": "134000801", "name": "G. de Marchi"}, {"authorId": "71566709", "name": "B. Merín"}, {"authorId": "103295918", "name": "M. Sarmiento"}, {"authorId": "2089817462", "name": "David L. Wenzel"}, {"authorId": "2061292373", "name": "Beatriz Martinez"}], "citations": [{"paperId": "e19de830ef55c85079a214d78760470a235f4746", "title": "SPASE Metadata as a Building Block of a Heliophysics Science-Enabling Framework"}, {"paperId": "82cc605248251f5bdce3d0c1199fffdccdb76578", "title": "Ionosphere Variability I: Advances in observational, monitoring and detection capabilities"}, {"paperId": "ea2a612870c34089b8b0e53106c37356f6e48bbd", "title": "Large Area High-Resolution 3D Mapping of the Von Kármán Crater: Landing Site for the Chang'E-4 Lander and Yutu-2 Rover"}, {"paperId": "a82d8993e5569b342055503e28eaec032f5b979d", "title": "Assessment of the FAIRness of the Virtual Atomic and Molecular Data Centre following the Research Data Alliance evaluation framework"}, {"paperId": "68dba97a2e4176a5600767be84db544885f4291e", "title": "Utilizzo del DOI (Digital Object Identifier) nei progetti di digital humanities"}, {"paperId": "58ee1b2bb059ccdeb8f3e2518c972392a249bf9e", "title": "Python tools for ESA’s Swarm mission: VirES for Swarm and surrounding ecosystem"}, {"paperId": "9c356b25e0488ac39b3dfc81af760bb8b6a5b46f", "title": "The LIKED Resource - A LIbrary KnowledgE and Discovery online resource for discovering and implementing knowledge, data, and infrastructure resources"}, {"paperId": "63f74a711735d51ea228a7a2f2cf4b1dd9d03f6b", "title": "Subpixel-Scale Topography Retrieval of Mars Using Single-Image DTM Estimation and Super-Resolution Restoration"}, {"paperId": "be21446855b1acb5c9bc7dc50a965bb92a220921", "title": "MADNet 2.0: Pixel-Scale Topography Retrieval from Single-View Orbital Imagery of Mars Using Deep Learning"}, {"paperId": "75b8792e1dab9459b68727e99c67695586fd9a87", "title": "Оцінювання результативності науково-педагогічних досліджень: зарубіжний досвід"}, {"paperId": "4d0fa177178bef365a91829aa9e8b803ddfbbaa9", "title": "A MODEL OF USING INFORMATION AND DIGITAL TECHNOLOGIES TO EVALUATE THE EFFECTIVENESS OF PEDAGOGICAL RESEARCH"}]}
