{"paperId": "da0c40ce30a8bdf9875a4ef96629753799278e9a", "publicationVenue": {"id": "228761ec-c40a-479b-8309-9dcbe9851bcd", "name": "IEEE Internet of Things Journal", "type": "journal", "alternate_names": ["IEEE Internet Thing J"], "issn": "2327-4662", "url": "https://www.ieee.org/membership-catalog/productdetail/showProductDetailPage.html?product=PER288-ELE", "alternate_urls": ["https://ieeexplore.ieee.org/servlet/opac?punumber=6488907", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6488907", "http://ieee-iotj.org/#"]}, "title": "Reinforcement-Learning- and Belief-Learning-Based Double Auction Mechanism for Edge Computing Resource Allocation", "abstract": "In recent years, we have witnessed the compelling application of the Internet of Things (IoT) in our daily life, ranging from daily living to industrial production. On account of the computation and power constraints, the IoT devices have to offload their tasks to the remote cloud services. However, the long-distance transmission poses significant challenges for latency-sensitive businesses, such as autonomous driving and industrial control. As a remedy, mobile edge computing (MEC) is deployed at the edge of the network to reduce the transmission delay. With the MEC joining in, how to allocate the limited computing resource of MEC is a critical problem to guarantee efficient working of the whole IoT system. In this article, we formulate the resource management among MEC and IoT devices as a double auction game. Also, for searching the Nash equilibrium, we introduce the experience-weighted attraction (EWA) algorithm performing behind each participant. With this AI method, auction participants acquire and accumulate experience by observing others’ behavior and doing introspection, which accelerates the trading policy’s learning process of each agent in such an opaque environment. Some simulation results are presented to evaluate the convergence and correctness of our architecture and algorithm.", "venue": "IEEE Internet of Things Journal", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-07-01", "journal": {"name": "IEEE Internet of Things Journal", "pages": "5976-5985", "volume": "7"}, "authors": [{"authorId": "2108644837", "name": "Quanyi Li"}, {"authorId": "1885487", "name": "Haipeng Yao"}, {"authorId": "47184132", "name": "Tianle Mai"}, {"authorId": "1750017", "name": "Chunxiao Jiang"}, {"authorId": "2152819646", "name": "Yan Zhang"}], "citations": [{"paperId": "8d87f4b86bd9d1f983bf7b0eeb8cf35d836bc37d", "title": "Resource sharing for collaborative edge learning: A privacy-aware incentive mechanism combined with demand prediction"}, {"paperId": "0f880870e83f4098a2ab51ba54e3fab7cc5bdf7a", "title": "DDPS: Dynamic Differential Pricing-based Edge Offloading System with Energy Harvesting Devices"}, {"paperId": "ab7d485f1b9ff3a88907e403f148f71d3bbc3cb8", "title": "Delay-Optimal Computation Offloading in Large-Scale Multi-Access Edge Computing Using Mean Field Game"}, {"paperId": "9cf86264d31fafe25d46908dd1205d07a14e4697", "title": "A Repeated Auction Model for Load-Aware Dynamic Resource Allocation in Multi-Access Edge Computing"}, {"paperId": "5f9cfdba62fd5f868b049f0622fedff5f8bdb8d4", "title": "An Edge Resource Allocation Method based on Bundled Two-way Auction"}, {"paperId": "14c006e2f7e7649425187c4ca6e42be89b81a85a", "title": "A Double Auction-based MEC-Enabled IoT Task Offloading: A Green Framework"}, {"paperId": "32653659e8322667180c955007a631e379f3b7f1", "title": "A Comprehensive Survey on Collaborative Data-access Enablers in the IIoT"}, {"paperId": "427a37aceca43337f57443ac1a2c0231916bc9df", "title": "The Diffusion of Competitive Platform-Based Products with Network Effects"}, {"paperId": "5ca3ed8d219b5dbfdecbe4aa8588fd282fd9cca4", "title": "Growable Genetic Algorithm with Heuristic-based Local Search for multi-dimensional resources scheduling of cloud computing"}, {"paperId": "1d6d0c808e3a79a7e690923fa36734a7c7f61b15", "title": "Digital-Twin-Assisted Edge-Computing Resource Allocation Based on the Whale Optimization Algorithm"}, {"paperId": "3d410a8ba97bd2b99349a2310769c32538847859", "title": "New Three-Tier Game-Theoretic Approach for Computation Offloading in Multi-Access Edge Computing"}, {"paperId": "2360da1380777460b18bcb3eba4e2e68d27b6321", "title": "Metaheuristic Optimization-Based Resource Allocation Technique for Cybertwin-Driven 6G on IoE Environment"}, {"paperId": "5a11306a27d42768bb4295fa5a098c72be0d4127", "title": "Deep Reinforcement Learning-Based Pricing Strategy in Double-Auction Market for Edge Computing Resource Allocation"}, {"paperId": "57631f3a1756a715e010d2929063c1499f640ac4", "title": "BARA: A blockchain-aided auction-based resource allocation in edge computing enabled industrial internet of things"}, {"paperId": "486f6502f1fc37daae305fdbfb45b74a7cca30f3", "title": "Dynamic Beam Pattern and Bandwidth Allocation Based on Multi-Agent Deep Reinforcement Learning for Beam Hopping Satellite Systems"}, {"paperId": "b56a507ffdc139af018608452fc7856f1784a730", "title": "Possible Applications of Edge Computing in the Manufacturing Industry—Systematic Literature Review"}, {"paperId": "befc9085d392806cb6acc10d31cf910f9242ab22", "title": "Auction method to prevent bid-rigging strategies in mobile blockchain edge computing resource allocation"}, {"paperId": "fce6ed0db35303c7d0b6db7a5208a8e549efde0a", "title": "Hybrid market-based resources allocation in Mobile Edge Computing systems under stochastic information"}, {"paperId": "dc0c803cc91895600f562432ad3941c73eb9efc0", "title": "Reinforcement Learning-Empowered Mobile Edge Computing for 6G Edge Intelligence"}, {"paperId": "bb42140b7856f96cdb7ab8df0522c037252d0db6", "title": "A Survey on Auction based Approaches for Resource Allocation and Pricing in Emerging Edge Technologies"}, {"paperId": "bcd5824b74b500655bec8ae4a4f5ba767c782b05", "title": "AuctionWhisk: Using an auction‐inspired approach for function placement in serverless fog platforms"}, {"paperId": "409f19e6e1b42f991bf5c513ed28cd3208396bc6", "title": "Low load DIDS task scheduling based on Q-learning in edge computing environment"}, {"paperId": "05600a598ceeaa162bb77fda845f84568b5f6de2", "title": "Deep Reinforcement Learning-based Methods for Resource Scheduling in Cloud Computing: A Review and Future Directions"}, {"paperId": "c0393c740c7bb2e18957cf3905e5c10814195eb5", "title": "Applications of Auction and Mechanism Design in Edge Computing: A Survey"}, {"paperId": "983f6f1506e5253f02ad2c65151eb59d8458b57b", "title": "Computational Resource Allocation Strategy in a Public Blockchain Supported by Edge Computing"}, {"paperId": "f31f1ab73ec856fb3d01af7e9c39c947027c6ab6", "title": "Priority-Aware Reinforcement-Learning-Based Integrated Design of Networking and Control for Industrial Internet of Things"}, {"paperId": "5430676d7575231670fe0cca62ff006fa8e5d4f4", "title": "Energy-Aware Service Function Chain Embedding in Edge–Cloud Environments for IoT Applications"}, {"paperId": "40f83ee10dd331f3408d939c98d11cd8a3281051", "title": "A reinforcement learning optimization for future smart cities using software defined networking"}, {"paperId": "8a93d4db03f11664a256290d45233ca1da0f9b02", "title": "Three Dynamic Pricing Schemes for Resource Allocation of Edge Computing for IoT Environment"}, {"paperId": "a9686aa73603ea062d62c16ffa68d30faf8ebe6f", "title": "Intelligent Terminal Computation Offloading Method Based on the Incentive of Reputation Value"}, {"paperId": "f4c6e9c592b7dcc0909349b1be7fa72be97f8805", "title": "Zero Touch Management: A Survey of Network Automation Solutions for 5G and 6G Networks"}, {"paperId": "4ffadc576c31d710afab3590892f570badfae939", "title": "The Applicability of Reinforcement Learning Methods in the Development of Industry 4.0 Applications"}]}
