{"paperId": "da0f515a95d02f51cd7b4b652ca04402bc7f287e", "publicationVenue": null, "title": "Intelligent & Ultra-Reliable Connectivity for Safety Services in Road Tunnels: A System Architecture", "abstract": "Safety within road tunnels is critical for trafﬁc safety. With the rapid growth in sensor and communication technologies, the concept of “smart tunnel” has been envisioned where by leveraging sensory data, smooth and safe ﬂow of trafﬁc is ensured. A prominent signature of such tunnel is coordination among the road elements in the context of C-ITS, facilitated by communication technologies. Road tunnels represent challenging environments for communication due to their unique properties. However, there is a growing demand for ultra-reliable communication within the tunnels, particularly to introduce novel C-ITS safety services. The traditional methods that are aimed at supporting public radio broadcasting and push-to-talk services do not satisfy such demands. In this paper, we study the state-of-the-art of communication technologies for safety services within the road tunnels and identify their challenges, operational requirements and suitability for safety use-cases. Further we focus on disruptive technologies such as 5G cellular networks and the new opportunities that arise from their deployment within the tunnels. Finally we propose a generic 5G-based communication architecture that leverages the use of VEC and URLLC to meet the ever-increasing demands. We highlight that such architecture allows for radically shortening the design and deployment cycle of novel safety services within the tunnels from several years to weeks.", "venue": "Proceedings of the 30th European Safety and Reliability Conference and 15th Probabilistic Safety Assessment and Management Conference", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": null, "journal": {"name": "Proceedings of the 30th European Safety and Reliability Conference and 15th Probabilistic Safety Assessment and Management Conference"}, "authors": [{"authorId": "2359143", "name": "Naeem Khademi"}, {"authorId": "144990053", "name": "Morten Sommer"}], "citations": []}
