{"paperId": "da166978308cda7777872ddf66df47ee9d2aced0", "publicationVenue": {"id": "39058e09-c13a-4545-a8a3-a75581460bc2", "name": "Brain Science", "type": "journal", "alternate_names": ["Brain Sciences", "Brain Sci"], "issn": "2570-0197", "alternate_issns": ["2076-3425"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217894", "alternate_urls": ["https://www.mdpi.com/journal/brainsci", "https://epub.uni-regensburg.de/37319/", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217894"]}, "title": "The Relationship between Trauma and Attachment in Burundi’s School-Aged Children", "abstract": "The exposure of children and adolescents to trauma is one of the most important public health challenges. These childhood experiences play a role in children’s attachment patterns with their parents and peers. The objective of this study was to examine the relationship between exposure to trauma and the degree of attachment representations in school-aged children in Burundi. One hundred thirteen vulnerable children aged 7 to 12 years were recruited and referred by their teachers. We used an event list including the post-traumatic reaction index to measure their exposure to traumatic events and the People in My Life instrument to measure attachment representations. The results revealed that the children had experienced or witnessed at least one traumatic event. The results indicated that secure attachment representations were highest among children with their parents and lowest among children with their peers. The relationship between trauma experiences and children’s attachment representations was significant with their parents and with their peers. Children’s attachment representations with their parents and peers predicted their traumatic experiences. Future research should focus on how attachment relationships can facilitate counselors and clinicians in providing preventive psycho-education to adults and children to develop healthier functioning, through better knowledge of the complex interplay between traumas.", "venue": "Brain Science", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-04-01", "journal": {"name": "Brain Sciences", "volume": "13"}, "authors": [{"authorId": "2214685421", "name": "Jean Bosco Ndayishimiye"}, {"authorId": "34583723", "name": "B. Schneider"}, {"authorId": "2214685417", "name": "Léandre Simbananiye"}, {"authorId": "148181012", "name": "T. Baubet"}], "citations": [{"paperId": "b030d4c02a26d9641253a8c71891abdcab6ccb9f", "title": "Investigating the Role of Second Chance Schools and COVID-19 Pandemic on the Mental Health and Self-Image of Greek Adult Students"}]}
