{"paperId": "da33c296a9198cd62c9f63707e93433f0fb8c8bf", "publicationVenue": null, "title": "How Do Climate Change Skeptics Engage with Opposing Views Online? Evidence from a Major Climate Change Skeptic Forum on Reddit", "abstract": "ABSTRACT Does exposure to opposing views contribute to breaking down science skepticism? In this study, we contribute to the debate by examining reactions to opposing views within a major climate change skeptic online community on “Reddit.” A large sample of posts (N = 3000) was manually coded according to whether they were opposed to climate skepticism or not, which allowed the automated classification of the full dataset of more than 50,000 posts, with codes inferred from linked websites. We find that confrontation with opposing views triggered activity in the forum, particularly among users who are highly engaged with the community. Those engaging with such views were also more likely to comment again. In other words, light engagement with opposition reinforced the community we study, rather than undermining it. Considering our findings, defensive or preventive policies appear more promising than strategies to actively counter systematic and persistent skepticism of scientific issues.", "venue": "Environmental Communication", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-05-26", "journal": {"name": "Environmental Communication", "pages": "805 - 821", "volume": "16"}, "authors": [{"authorId": "1573738676", "name": "Lisa Oswald"}, {"authorId": "144008442", "name": "Jonathan Bright"}], "citations": [{"paperId": "f4434ef82cb509463f4137f12f047148174980ce", "title": "Pro-Environmental Nationalism is Still Nationalism: How Political Identity and Prior Attitudes Affect Nationalist Framing Effects on Support for Climate Action"}, {"paperId": "6f2f0fbb8bab6fe49dad09f57db27955c1175f3b", "title": "Climate Change Denial & Skepticism: A Review of the Literature"}, {"paperId": "3e7e76301fb30616b4a22b120cb460746e6e37bf", "title": "How Do Individuals in a Radical Echo Chamber React to Opposing Views? Evidence from a Content Analysis of Stormfront"}]}
