{"paperId": "da371faa2d7fa7800fb646184d9b6dae5116aca3", "publicationVenue": {"id": "e2acdbdd-8665-4181-be7e-b7d710482fe5", "name": "International Journal of Cloud Applications and Computing", "type": "journal", "alternate_names": ["Int J Cloud Appl Comput"], "issn": "2156-1834", "url": "http://www.igi-global.com/ijcac"}, "title": "A Customer-Oriented Task Scheduling for Heterogeneous Multi-Cloud Environment", "abstract": "Task scheduling is widely studied in various environments such as cluster, grid and cloud computing systems. Moreover, it is NP-Complete as the optimization criteria is to minimize the overall processing time of all the tasks i.e., makespan. However, minimization of makespan does not equate to customer satisfaction. In this paper, the authors propose a customer-oriented task scheduling algorithm for heterogeneous multi-cloud environment. The basic idea of this algorithm is to assign a suitable task for each cloud which takes minimum execution time. Then it balances the makespan by inserting as much as tasks into the idle slots of each cloud. As a result, the customers will get better services in minimum time. They simulate the proposed algorithm in a virtualized environment and compare the simulation results with a well-known algorithm, called cloud min-min scheduling. The results show the superiority of the proposed algorithm in terms of customer satisfaction and surplus customer expectation. The authors validate the results using two statistical techniques, namely T-test and ANOVA.", "venue": "International Journal of Cloud Applications and Computing", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2016-10-01", "journal": {"name": "Int. J. Cloud Appl. Comput.", "pages": "1-17", "volume": "6"}, "authors": [{"authorId": "27004821", "name": "S. K. Pande"}, {"authorId": "2703203", "name": "S. K. Panda"}, {"authorId": "143885243", "name": "Satyabrata Das"}], "citations": [{"paperId": "92d096c3d38025afda608168d1feea9c3a3bb54f", "title": "Cloud Task Scheduling Algorithms using Teaching-Learning-Based Optimization and Jaya Algorithm"}, {"paperId": "31ab5ac134213126d56cb030e284a3c3805bd321", "title": "OPTCLOUD: An Optimal Cloud Service Selection Framework Using QoS Correlation Lens"}, {"paperId": "11e2bf9d82de1789f6681ae430221021708c2379", "title": "Enhancing cloud performance using task scheduling strategy based on resource ranking and resource partitioning"}, {"paperId": "d2c4b3ce7458ea5a59f12e596619202fe33fbc71", "title": "Dynamic service migration and resource management for vehicular clouds"}, {"paperId": "6ac79bb6669109f7b86265378f41e2ee55c5e72c", "title": "An Efficient Grouped Task Scheduling and Resource Allocation in Cloud Computing Environments"}, {"paperId": "6c00919998140beec67b471e8d79ad75f6ab34f8", "title": "A Task-Resource Mapping Algorithm for Large-Scale Batch-Mode Computational Marine Hydrodynamics Codes on Containerized Private Cloud"}, {"paperId": "f9e38b81a48647ac42db5ad52beb9c4ca568ddc3", "title": "Categorization of Intercloud users and auto-scaling of resources"}, {"paperId": "df885943d2ac24d48a47c2803027f9e6b0be6690", "title": "A User-Oriented Collaborative Filtering Algorithm for Recommender Systems"}, {"paperId": "de60988eb35c2fdfc41d3da6d6195204bc2c0621", "title": "A pair-based task scheduling algorithm for cloud computing environment"}, {"paperId": "6608a6ce6c16b3208816e873b0454e708bd8cf29", "title": "A new container scheduling algorithm based on multi-objective optimization"}, {"paperId": "e5a782b28e4018bd0e6658f004c1d2171355dccb", "title": "An Efficient Data Replication Algorithm for Distributed Systems"}, {"paperId": "92ae58acbe88a47c6e0c0d3b407950b41b38f39e", "title": "GA-Based Customer-Conscious Resource Allocation and Task Scheduling in Multi-cloud Computing"}, {"paperId": "686c1ea293c1beac74a1e040a43251bf0634050b", "title": "Multi-Objective Task Scheduling Using Smart MPI-Based Cloud Resources"}, {"paperId": "b6ebb98d324d43558174eaaa96d3a44ecc8014f1", "title": "Client-Awareness Resource Allotment and Job Scheduling in Heterogeneous Cloud by Using Social Group Optimization"}]}
