{"paperId": "da50d70ae70d447b04e6dbc89f6fdc655064f9b7", "publicationVenue": {"id": "f51b8132-f142-4bab-913a-705ac6f05107", "name": "Technologies", "type": "journal", "alternate_names": ["Technol (basel", "Technologies (Basel)"], "issn": "2227-7080", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-318028", "alternate_urls": ["https://www.mdpi.com/journal/technologies", "https://pub.uni-bielefeld.de/publication/2932656", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-318028"]}, "title": "Technical Interoperability for Machine Connectivity on the Shop Floor", "abstract": "This paper presents a generic technical solution that can increase Industry 4.0 maturity by collecting data from sensors and control systems on the shop floor. Within the research project “5G-Enabled Manufacturing”, an LTE (Long-Term Evolution) network with 5G technologies was deployed on the shop floor to enable fast and scalable connectivity. This network was used to connect a grinding machine to a remote private cloud where data was stored and streamed to a data analytics center. This enabled visibility and transparency of the production data, which is the basis for Industry 4.0 and smart manufacturing. The solution is described with a focus on high-level communication technologies above wireless communication standards. These technologies are discussed regarding technical interoperability, focusing on the system layout, communication standards, and open systems. From the discussion, it can be derived that generic solutions such as this are possible, but manufacturing end-users must expand and further internalize knowledge of future information and communication technologies to reduce their dependency on equipment and technology providers.", "venue": "Technologies", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2018-06-22", "journal": {"name": "Technologies"}, "authors": [{"authorId": "35363946", "name": "Magnus Åkerman"}, {"authorId": "2762298", "name": "J. Stahre"}, {"authorId": "34568801", "name": "U. Engström"}, {"authorId": "1732496", "name": "Ola Angelsmark"}, {"authorId": "98516483", "name": "D. McGillivray"}, {"authorId": "34060431", "name": "Torgny Holmberg"}, {"authorId": "71372063", "name": "M. Bärring"}, {"authorId": "8591522", "name": "Camilla Lundgren"}, {"authorId": "2049046400", "name": "M. Friis"}, {"authorId": "1399733841", "name": "Åsa Fast-Berglund"}], "citations": [{"paperId": "3f8f3fa5b43ac84c05ed93c22ceb8fae1469110f", "title": "Determining the impact of 5G-technology on manufacturing performance using a modified TOPSIS method"}, {"paperId": "7ca412f11038a5bfaddf381377f3b03f40299758", "title": "Connectivity as a Design Feature for Industry 4.0 Production Equipment: Application for the Development of an In-Line Metrology System"}, {"paperId": "dbd928687e316e6264bec1796ddf9fbd04d9b185", "title": "Monitoring of Discrete Electrical Signals from Welding Processes using Data Mining and IIoT Approaches"}, {"paperId": "da903cd9082db21e5a93b202364608cebb65695f", "title": "Web of Things Platforms for Distance Learning Scenarios in Computer Science Disciplines: A Practical Approach"}, {"paperId": "bd2d0ecd8315ed7ac028915aab65a80bd7749940", "title": "Running Workshops to Identify Wastes in a Product Development Sample Shop"}]}
