{"paperId": "da672106721a43348266d25c8c39e0df916edec4", "publicationVenue": {"id": "0d993d4a-09ba-4df8-90a4-7dfe25f0cb9e", "name": "ACM Transactions on Intelligent Systems and Technology", "type": "journal", "alternate_names": ["ACM Trans Intell Syst Technol"], "issn": "2157-6904", "url": "http://portal.acm.org/tist", "alternate_urls": ["https://tist.acm.org/"]}, "title": "Trading Off Privacy, Utility, and Efficiency in Federated Learning", "abstract": "Federated learning (FL) enables participating parties to collaboratively build a global model with boosted utility without disclosing private data information. Appropriate protection mechanisms have to be adopted to fulfill the opposing requirements in preserving privacy and maintaining high model utility. In addition, it is a mandate for a federated learning system to achieve high efficiency in order to enable large-scale model training and deployment. We propose a unified federated learning framework that reconciles horizontal and vertical federated learning. Based on this framework, we formulate and quantify the trade-offs between privacy leakage, utility loss, and efficiency reduction, which leads us to the No-Free-Lunch (NFL) theorem for the federated learning system. NFL indicates that it is unrealistic to expect an FL algorithm to simultaneously provide excellent privacy, utility, and efficiency in certain scenarios. We then analyze the lower bounds for the privacy leakage, utility loss, and efficiency reduction for several widely-adopted protection mechanisms, including Randomization, Homomorphic Encryption, Secret Sharing, and Compression. Our analysis could serve as a guide for selecting protection parameters to meet particular requirements.", "venue": "ACM Transactions on Intelligent Systems and Technology", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-09-01", "journal": {"name": "ACM Transactions on Intelligent Systems and Technology", "pages": "1 - 32", "volume": "14"}, "authors": [{"authorId": "50982392", "name": "Xiaojin Zhang"}, {"authorId": "1505828520", "name": "Yan Kang"}, {"authorId": "2157740727", "name": "Kai Chen"}, {"authorId": "2087083369", "name": "Lixin Fan"}, {"authorId": "2166949653", "name": "Qiang Yang"}], "citations": [{"paperId": "d68ff1fdba49d5cd6888794f6216c72f98072c6e", "title": "Hyperparameter Optimization for SecureBoost via Constrained Multi-Objective Federated Learning"}, {"paperId": "0e7d59b02057c2e734ea640f15e17c9e2c93a6c4", "title": "Deciphering the Interplay between Local Differential Privacy, Average Bayesian Privacy, and Maximum Bayesian Privacy"}, {"paperId": "c35d1c96d8a65c4104ba596f4a31b566db2d2cbb", "title": "EPFed: Achieving Optimal Balance between Privacy and Efficiency in Federated Learning"}, {"paperId": "911c120315388b340fd20bd15c174111f5e0ef96", "title": "Federated Continual Learning via Knowledge Fusion: A Survey"}, {"paperId": "0a913eb949d858bf94314f84650da1471dbcc89a", "title": "Federated Learning Empowered by Generative Content"}, {"paperId": "48dbbeb23dc8d216794fbb2e70fb5eac285e39eb", "title": "Fake It Till Make It: Federated Learning with Consensus-Oriented Generation"}, {"paperId": "9bae908bf278c1983ca7d4645f67d308bebb63bd", "title": "Automated discovery of trade-off between utility, privacy and fairness in machine learning models"}, {"paperId": "7e555856fc97b669379b0989a8c50097e4f607ed", "title": "A Survey for Federated Learning Evaluations: Goals and Measures"}, {"paperId": "e3a1e74d77652ad5567db8451fd3575b0db8e06d", "title": "A Survey of What to Share in Federated Learning: Perspectives on Model Utility, Privacy Leakage, and Communication Efficiency"}, {"paperId": "34ccb3300da9fbbf59517a18eb0ccdd2baa1df4f", "title": "A Meta-learning Framework for Tuning Parameters of Protection Mechanisms in Trustworthy Federated Learning"}, {"paperId": "717c3e510694dee47807593cca3bec4d4f7eb107", "title": "Theoretically Principled Federated Learning for Balancing Privacy and Utility"}, {"paperId": "cd9cc818bca41b6dff6aa119d48757fe1d6aa076", "title": "Towards Achieving Near-optimal Utility for Privacy-Preserving Federated Learning via Data Generation and Parameter Distortion"}, {"paperId": "6b86236bdfa491ee2d6067520ef91c7baba55db8", "title": "Optimizing Privacy, Utility and Efficiency in Constrained Multi-Objective Federated Learning"}, {"paperId": "f0d407b790deeb29fa5ebd417185099aaeff6890", "title": "A Game-theoretic Framework for Privacy-preserving Federated Learning"}, {"paperId": "b002c89ee31738da69cb61a63452729c0b1c9238", "title": "Probably Approximately Correct Federated Learning"}, {"paperId": "aaea45f651ee017cefefd58966e5f6350c136bd9", "title": "FedPass: Privacy-Preserving Vertical Federated Deep Learning with Adaptive Obfuscation"}, {"paperId": "f13f014f51dd425661e3202067c5ef5052fe4d6a", "title": "Vertical Federated Learning"}, {"paperId": "767f29b966fb5fafb6cee65eecee9fc03a2eac39", "title": "A Framework for Evaluating Privacy-Utility Trade-off in Vertical Federated Learning"}, {"paperId": "444d967a68b5bfac8c98ca89794805885be663b5", "title": "Federated PAC Learning"}]}
