{"paperId": "da8c4190f6b8d2a3b0beaf406140318076a42aa4", "publicationVenue": {"id": "501c1070-b5d2-4ff0-ad6f-8769a0a1e13f", "name": "Wireless Communications and Mobile Computing", "type": "journal", "alternate_names": ["Wirel Commun Mob Comput"], "issn": "1530-8669", "url": "https://www.hindawi.com/journals/wcmc/", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/15308677", "http://www.interscience.wiley.com/jpages/1530-8669/"]}, "title": "A Privacy-Preserving Reinforcement Learning Approach for Dynamic Treatment Regimes on Health Data", "abstract": "Based on the clinical states of the patient, dynamic treatment regime technology can provide various therapeutic methods, which is helpful for medical treatment policymaking. Reinforcement learning is an important approach for developing this technology. In order to implement the reinforcement learning algorithm efficiently, the computation of health data is usually outsourced to the untrustworthy cloud server. However, it may leak, falsify, or delete private health data. Encryption is a common method for solving this problem. But the cloud server is difficult to calculate encrypted health data. In this paper, based on Cheon et al.’s approximate homomorphic encryption scheme, we first propose secure computation protocols for implementing comparison, maximum, exponentiation, and division. Next, we design a homomorphic reciprocal of square root protocol firstly, which only needs one approximate computation. Based on the proposed secure computation protocols, we design a secure asynchronous advantage actor-critic reinforcement learning algorithm for the first time. Then, it is used to implement a secure treatment decision-making algorithm. Simulation results show that our secure computation protocols and algorithms are feasible.", "venue": "Wireless Communications and Mobile Computing", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-11-23", "journal": {"name": "Wireless Communications and Mobile Computing"}, "authors": [{"authorId": "48304821", "name": "Xiaoqiang Sun"}, {"authorId": "145357132", "name": "Zhiwei Sun"}, {"authorId": "2155392033", "name": "Ting Wang"}, {"authorId": "2144017377", "name": "Jie Feng"}, {"authorId": "2152118333", "name": "Jiakai Wei"}, {"authorId": "70152285", "name": "Guangwu Hu"}], "citations": []}
