{"paperId": "da91e53f50693fa6854b58f8a01b21432d2602ae", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "A Review on Application of Blockchain in 5G and Beyond Networks: Taxonomy, Field-Trials, Challenges and Opportunities", "abstract": "Until now, every evolution of communication standard was driven by the need for providing high-speed connectivity to the end-user. However, 5G marks a radical shift from this focus as 5G and beyond networks are being designed to be future-proof by catering to diverse requirements of several use cases. These requirements include Ultra-Reliable Low Latency Communications, Massive Machine-Type Communications and Enhanced Mobile Broadband. To realize such features in 5G and beyond, there is a need to rethink how current cellular networks are deployed because designing new radio access technologies and utilizing the new spectrum are not enough. Several technologies, such as software-defined networking, network function virtualization, machine learning and cloud computing, are being integrated into the 5G networks to fulfil the need for diverse requirements. These technologies, however, give rise to several challenges associated with decentralization, transparency, interoperability, privacy and security. To address these issues, Blockchain has emerged as a potential solution due to its capabilities such as transparency, data encryption, auditability, immutability and distributed architecture. In this paper, we review the state-of-art application of Blockchain in 5G network and explore how it can facilitate enabling technologies of 5G and beyond to enable various services at the front-haul, edge and the core. Based on the review, we present a taxonomy of Blockchain application in 5G networks and discuss several issues that can be solved using Blockchain integration. We then present various field-trials and Proof of concept that are using Blockchain to address the challenges faced in the current 5G deployment. Finally, we discuss various challenges that need to be addressed to realize the full potential of Blockchain in beyond 5G networks. The survey presents a broad range of ideas related to Blockchain integration in 5G and beyond networks that address issues such as interoperability, security, mobility, resource allocation, resource sharing and management, energy efficiency and other desirable features.", "venue": "IEEE Access", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2020-06-17", "journal": {"name": "IEEE Access", "pages": "115876-115904", "volume": "8"}, "authors": [{"authorId": "72831991", "name": "Mohammad Tahir"}, {"authorId": "144722450", "name": "M. Habaebi"}, {"authorId": "144285656", "name": "M. Dabbagh"}, {"authorId": "1789254149", "name": "Amna Mughees"}, {"authorId": "2063939602", "name": "Abdul Ahad"}, {"authorId": "2068214852", "name": "Kazi Istiaque Ahmed"}], "citations": [{"paperId": "a7f9d63690a8d881a19eb7f963d116a39948408f", "title": "Wideband Wide-Angle Scanning Endfire Phased Array Antenna Based on Heterogeneous Beam Elements for Millimeter-Wave Mobile Terminals"}, {"paperId": "2663c9038cd403070124770e43755276b1803e9a", "title": "Sec-E2E: End-to-End Communication Security in LS-HetNets Based on Blockchain"}, {"paperId": "739c1797f7e24915bb2d8b8b8c0e14b1cd732382", "title": "6G and intelligent healthcare: Taxonomy, technologies, open issues and future research directions"}, {"paperId": "dc855a9f8d94d273c349bb5c31f207aacd59bbac", "title": "Cyber Security in a 5G-Based Smart Healthcare Network: A Base Station Case Study"}, {"paperId": "4bd2728c08b9832ddb70406bc4bea5d5b6956a00", "title": "The Novel Protocol Uses Low Computational Complexity to Authenticate Edge Devices on Smart Grid Systems"}, {"paperId": "49df689d1e8193f419bf97fceba44cc5cdd3909b", "title": "Subscription Management for Beyond 5G and 6G Cellular Networks Using Blockchain Technology"}, {"paperId": "b1cab2f3d36e5e8dddb6b3ef6c0ba4ea061e757e", "title": "5G-Based Smart Healthcare and Mobile Network Security: Combating Fake Base Stations"}, {"paperId": "43059bc9cff7721c90650d78b8ca838613aea6d2", "title": "Blockchain Applications in 5G Networks: Incentives"}, {"paperId": "740708f080148ef8e8a718d9f1f5edff07f167ee", "title": "Blockchain-Based Computing Resource Trading in Autonomous Multi-Access Edge Network Slicing: A Dueling Double Deep Q-Learning Approach"}, {"paperId": "2cc9dd5d7aaf906180d0eb0561811c220d657b78", "title": "Adoption of 5G in developing economies: A supply side perspective from India"}, {"paperId": "63fce9d0bb44ee8ee645b994d86769d85eecc8c4", "title": "A Survey of Blockchain and Artificial Intelligence for 6G Wireless Communications"}, {"paperId": "b24a01b79d3e2416711ee4fb80d5429db36f1e9c", "title": "A Comprehensive review on 5G-based Smart Healthcare Network Security: Taxonomy, Issues, Solutions and Future research directions"}, {"paperId": "490d898433e15ae36564817e71c430bc6612838f", "title": "Open RAN: Evolution of Architecture, Deployment Aspects, and Future Directions"}, {"paperId": "b0bad2de13992ee8583d994178596a9a5e59089a", "title": "A Comparison of Blockchain Recovery Time in Static and Mobile IoT-Blockchain Networks"}, {"paperId": "80609013d7edaf0ace3fbde75cb7c61d63361717", "title": "A Blockchain Sharding Protocol supporting Dynamic Locality in Mobile Edge Computing"}, {"paperId": "fb3440c15d7b501df4a4afe167c5fc15257b7ab5", "title": "A survey on the use of blockchain for future 6G: Technical aspects, use cases, challenges and research directions"}, {"paperId": "4f7785c92e4d1c773a7f37cfc133b9f3b41d5476", "title": "Implementation of Secured Server less Communication Scheme for Virtual Systems in 5G Cloud Networks"}, {"paperId": "25fc1e0968426df06005a94cd5fb0589e15c0ffe", "title": "Reputation Mechanism Designed for Blockchain Empowered Dynamic Spectrum Sharing System"}, {"paperId": "654855a434c5b5cdbd6629f4f0f75f50d6e49df7", "title": "You've got a Friend in ME (Mobile Edge): Blockchain Processing with Cloud Node Backup"}, {"paperId": "8a63af1a9b6cf61b8f75bfee764b6b3ac1bb892a", "title": "A Secure Blockchain-Based Authentication and Key Agreement Scheme for 3GPP 5G Networks"}, {"paperId": "6769491a2ef2ea1470693eb0cbab03fb482a81a0", "title": "Blockchain in fifth-generation network and beyond: a survey"}, {"paperId": "e3a1e1579f31cecb896dcbf0a37640ee951f9e45", "title": "Blockchain for Future Wireless Networks: A Decade Survey"}, {"paperId": "e9a8948efc2c477cf568e0c6b48df97755333d7a", "title": "A survey: Distributed Machine Learning for 5G and beyond"}, {"paperId": "055c196cd6e3988ee66216f67420469bda0baa27", "title": "Empirical Performance Analysis of Hyperledger LTS for Small and Medium Enterprises"}, {"paperId": "78bcd6149ae12fa9d1bc35692fd510014838574a", "title": "Two-layered blockchain-based admission control for secure UAV networks"}, {"paperId": "99592308508de9abd8184fb10d2a69c868fc372c", "title": "Secure Caching Scheme Using Blockchains for Unmanned Aerial Vehicle-Assisted Information-Centric Wireless Sensor Networks"}, {"paperId": "cc5f9f70028e00f0ff0663b7116a22f0c42315ce", "title": "Survey on blockchain for future smart grids: Technical aspects, applications, integration challenges and future research"}, {"paperId": "25e1bb9039d825553c3beeb7a88c6f710932fc66", "title": "Towards a Blockchain-SDN Architecture for Secure and Trustworthy 5G Massive IoT Networks"}, {"paperId": "455517580b0c872ca9d62d5d3882115b44f0ba48", "title": "Resilient Design of Distribution Grid Automation System against cyber-physical attacks using Blockchain and Smart Contract"}, {"paperId": "f1ba0fbb7c94e8dba9bf66b9d0c26fa4972f8583", "title": "From user-generated data to data-driven innovation: A research agenda to understand user privacy in digital markets"}, {"paperId": "1f83c5f5570dd7f0c1129178f76916b476398be8", "title": "Blockchain-Enabled Edge Intelligence for IoT: Background, Emerging Trends and Open Issues"}, {"paperId": "a876b8f62355b0500c3d1720c6bce662a268741a", "title": "Blockchain Assisted Decentralized Federated Learning (BLADE-FL): Performance Analysis and Resource Allocation"}, {"paperId": "49c7954714b7900b915613e14fd205023af9b780", "title": "A survey of empirical performance evaluation of permissioned blockchain platforms: Challenges and opportunities"}, {"paperId": "fd511a5155597392969878aea2363d9ab0a66aca", "title": "Application of Blockchain Technology in Dynamic Resource Management of Next Generation Networks"}, {"paperId": "06744105dd5d3530319fa52d9fae002e2c75b46f", "title": "Towards Energy Efficient 5G Networks Using Machine Learning: Taxonomy, Research Challenges, and Future Research Directions"}, {"paperId": "9ab6dbd7ff0f54850403bbb6d29c5bbce1dfb2b5", "title": "A Survey on Blockchain for Big Data: Approaches, Opportunities, and Future Directions"}, {"paperId": "7bf7ed90b0aea76bed38767e3085d7a16b6d9421", "title": "A Survey on Blockchain for Dynamic Spectrum Sharing"}, {"paperId": "e591f743244c5b3dc8b201e16801d2a7c3630218", "title": "Blockchain for Dynamic Spectrum Access and Network Slicing: A Review"}, {"paperId": "ffb78136b6ff779811b8326fe8e00c9604c12cd7", "title": "A Survey on Blockchain for Healthcare: Challenges, Benefits, and Future Directions"}, {"paperId": "d44864ffad202567a9b0f06c88e3b31ffe8c88b0", "title": "Blockchain and Smart Contracts for Telecommunications: Requirements vs. Cost Analysis"}, {"paperId": "7a6180c0e2ea0c15b7636b0328bef16a741acacd", "title": "Blockchain and Green Networking Analytics in 5G Networks and Beyond"}, {"paperId": "775548da92c40b0a98f8434b298de18e7e62cc37", "title": "Distributed Ledger Technologies For Network Slicing: A Survey"}, {"paperId": "bbd2616be15dd5f75d2c0e480d22de5c4f39f394", "title": "Blockchain Meets Covert Communication: A Survey"}, {"paperId": "416c82b12d6bab93e4080124b4991f91fd3d5bd6", "title": "Bulletin of Electrical Engineering and Informatics"}, {"paperId": "db09e59a9c013b4fa744062a6ea82a51dd66746a", "title": "Decentralized Blockchain-Based Dynamic Spectrum Acquisition for Wireless Downlink Communications"}, {"paperId": "15e412c64f80acb310ce167237846110b8ee74ce", "title": "The Radiation Effect on Low Noise Amplifier Implemented in the Space-Aerial–Terrestrial Integrated 5G Networks"}, {"paperId": "9dd7d69598feb9cd47c5018d324180c58dc8dabf", "title": "Fusion of Blockchain Technology with 5G: A Symmetric Beginning"}, {"paperId": "999d9bc8f4950896f62df56e83afbdea899dded9", "title": "Coalition of 6G and Blockchain in AR/VR Space: Challenges and Future Directions"}, {"paperId": "8cb714862c3cee95542a85a5acd92011e40a4b86", "title": "A Blockchain-Based Authentication and Key Agreement (AKA) Protocol for 5G Networks"}]}
