{"paperId": "da9a6a1c0f8c280a1c27881d910b1c85327098e6", "publicationVenue": {"id": "6e711cd9-3352-43d0-8dd7-635d69959f97", "name": "International Journal of Enterprise Information Systems", "type": "journal", "alternate_names": ["Int J Enterp Inf Syst"], "issn": "1548-1115", "url": "http://www.idea-group.com/journals/details.asp?id=4292", "alternate_urls": ["https://www.igi-global.com/journal/international-journal-enterprise-information-systems/1086"]}, "title": "Designing Software as a Service in Cloud Computing Using Quality Function Deployment", "abstract": "Cloud computing is an approach to access the virtualized resources based on an integrated system. Flexibility, scalability, high accessibility, and cost-effectiveness are some features of this system. These advantages have caused a favorable reception of different cloud computing services, such as software as a service (SAAS), platform as a service (PAAS), and infrastructure as a service (IAAS) on the part of businesses. In this article, a model for SAAS services has been proposed as one of the cloud computing layers with the maximum adjustment between the dimensions and components of QFD-based customer requirements. QFD is a method that seeks to translate the customer's voice into the technical design requirement. For this purpose, the dimensions and components of customer requirements and the dimensions and components of designing were determined through the review of literature and consulting with the experts. Finally, the dimensions and components of final desirable outcome were determined for SAAS by stages to achieve a modified QFD. After the examination of dimensions and components, a comparison was made between the companies and finally the most effective customer needs and the target values were determined. Thus, an SAAS service was designed. The telecommunications and cloud computing service provider companies can satisfy the customers and achieve a competitive advantage in designing SAAS services using the results of this research.", "venue": "International Journal of Enterprise Information Systems", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2018-10-01", "journal": {"name": "Int. J. Enterp. Inf. Syst.", "pages": "16-27", "volume": "14"}, "authors": [{"authorId": "39401447", "name": "A. Abtahi"}, {"authorId": "152863214", "name": "Fahimeh Abdi"}], "citations": [{"paperId": "544bce3fa959bd7a1785e45244bba565c91c0425", "title": "Research and Design of Cloud-Based Smart Legal Service Platform"}, {"paperId": "8aa574e946eab6513515d05e6e0603862632e5b5", "title": "Matching functions of supply chain management with smart and sustainable Tools: A novel hybrid BWM-QFD based method"}, {"paperId": "0a518f937c3988f00de0838406d5a1f08c9364e6", "title": "A S-QFD Approach with Bipolar Fuzzy Hamacher Aggregation Operators and Its Application on E-Commerce"}, {"paperId": "9e96696664536770a3c14c1da1dfda4bff328e92", "title": "analyzed Software tools and especially mobile applications as innovative means to support providing onboarding processes"}]}
