{"paperId": "daab0155897a543eaaf0ba7b8f2d11a615ca30bd", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Deep Auto-Encoder and Deep Forest-Assisted Failure Prognosis for Dynamic Predictive Maintenance Scheduling", "abstract": "Prognostics and health management (PHM) with failure prognosis and maintenance decision-making as the core is an advanced technology to improve the safety, reliability, and operational economy of engineering systems. However, studies of failure prognosis and maintenance decision-making have been conducted separately over the past years. Key challenges remain open when the joint problem is considered. The aim of this paper is to develop an integrated strategy for dynamic predictive maintenance scheduling (DPMS) based on a deep auto-encoder and deep forest-assisted failure prognosis method. The proposed DPMS method involves a complete process from performing failure prognosis to making maintenance decisions. The first step is to extract representative features reflecting system degradation from raw sensor data by using a deep auto-encoder. Then, the features are fed into the deep forest to compute the failure probabilities in moving time horizons. Finally, an optimal maintenance-related decision is made through quickly evaluating the costs of different decisions with the failure probabilities. Verification was accomplished using NASA’s open datasets of aircraft engines, and the experimental results show that the proposed DPMS method outperforms several state-of-the-art methods, which can benefit precise maintenance decisions and reduce maintenance costs.", "venue": "Italian National Conference on Sensors", "year": 2021, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-12-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "21"}, "authors": [{"authorId": "2152696981", "name": "Hui Yu"}, {"authorId": "1596798684", "name": "Chuang Chen"}, {"authorId": "103235257", "name": "N. Lu"}, {"authorId": "9282244", "name": "Cunsong Wang"}], "citations": [{"paperId": "fb134f55eb87370733b141d195b2bae1f3294852", "title": "Enhancing Predictive Maintenance in Water Treatment Plants through Sparse Autoencoder Based Anomaly Detection"}, {"paperId": "1400c56d400e31bddfb37bcb8258714bd6e11863", "title": "A Critical Insight and Evaluation of AI Models for Predictive Maintenance under Industry 4.0"}, {"paperId": "4604e6cb993fc8676f7fa4d40b595e8e227fc397", "title": "Data-driven Industrial Machine Failure Detection in Imbalanced Environments"}, {"paperId": "4dafb1ae15f49cbf44cb1b8306b2518b4390ae86", "title": "Application of improved deep forest algorithm in image recognition"}, {"paperId": "c394ae41cb7f8df34e8f993d92afa0ca9ccf33fc", "title": "An Augmented Reality-Assisted Prognostics and Health Management System Based on Deep Learning for IoT-Enabled Manufacturing"}, {"paperId": "99ae4e176f0856c99e8e39fbb90c610f11a56020", "title": "Machine Learning Techniques for Increasing Efficiency of the Robot’s Sensor and Control Information Processing"}, {"paperId": "f7bf2e581cc92d570acce03cdb45f882b40f8b3d", "title": "A Predictive Maintenance Strategy Using Deep Learning Quantile Regression and Kernel Density Estimation for Failure Prediction"}]}
