{"paperId": "daac6116da574ae21551a9f0037972067257b5b2", "publicationVenue": {"id": "b7aa40ac-729b-49d6-9064-4d1a9480e9a9", "name": "International Symposium on High-Performance Computer Architecture", "type": "conference", "alternate_names": ["HPCA", "High Perform Comput Appl", "Int Symp High-performance Comput Archit", "High Performance Computing and Applications"], "url": "https://web.archive.org/web/*/http://www.hpcaconf.org/"}, "title": "GRIT: Enhancing Multi-GPU Performance with Fine-Grained Dynamic Page Placement", "abstract": "Multi-GPU systems have become popular to cater to the growing demands for high parallelism and large memory capacity. However, the delivered performance is constrained by the non-uniform memory access (NUMA) overhead arising from data sharing and communication across multiple GPUs. Recent multi-GPUs employ unified virtual memory (UVM) to simplify the programming effort. In UVM-enabled multi-GPUs, three popular page placement schemes are adopted to mitigate the NUMA overheads: i) on-touch page migration, ii) access counter-based migration, and iii) page duplication. However, we observe that the preferred page placement scheme varies across i) different applications, ii) different pages of the same application, and iii) even different execution phases of a single page, making it challenging to find a “one-size-fits-all” page placement scheme. To this end, we propose GRIT, which dynamically and automatically determines the appropriate page placement schemes at runtime in a fine-grained manner to enhance multi-GPU performance and scalability. Experimental results indicate that GRIT achieves an average of 60%, 49%, and 29% performance improvements over uniformly adopting on-touch migration, access counter-based migration, and page duplication, respectively.", "venue": "International Symposium on High-Performance Computer Architecture", "year": 2024, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2024-03-02", "journal": {"name": "2024 IEEE International Symposium on High-Performance Computer Architecture (HPCA)", "pages": "1080-1094"}, "authors": [{"authorId": "2242375439", "name": "Yueqi Wang"}, {"authorId": "2241795823", "name": "Bingyao Li"}, {"authorId": "1684691", "name": "A. Jaleel"}, {"authorId": "2241953831", "name": "Jun Yang"}, {"authorId": "2241946519", "name": "Xulong Tang"}], "citations": []}
