{"paperId": "dab1528f827933bc044d0aaf2681cc77a1b38fab", "publicationVenue": {"id": "0aed7a40-85f3-4c66-9e1b-c1556c57001b", "name": "PLoS ONE", "type": "journal", "alternate_names": ["Plo ONE", "PLOS ONE", "PLO ONE"], "issn": "1932-6203", "url": "https://journals.plos.org/plosone/", "alternate_urls": ["http://www.plosone.org/"]}, "title": "“I got a bunch of weed to help me through the withdrawals”: Naturalistic cannabis use reported in online opioid and opioid recovery community discussion forums", "abstract": "A growing body of research has reported on the potential opioid-sparing effects of cannabis and cannabinoids, but less is known about specific mechanisms. The present research examines cannabis-related posts in two large online communities on the Reddit platform (“subreddits”) to compare mentions of naturalistic cannabis use by persons self-identifying as actively using opioids versus persons in recovery. We extracted all posts mentioning cannabis-related keywords (e.g., “weed”, “cannabis”, “marijuana”) from December 2015 through August 2019 from an opioid use subreddit and an opioid recovery subreddit. To investigate how cannabis is discussed at-scale, we identified and compared the most frequent phrases in cannabis-related posts in each subreddit using term-frequency-inverse document frequency (TF-IDF) weighting. To contextualize these findings, we also conducted a qualitative content analysis of 200 random posts (100 from each subreddit). Cannabis-related posts were about twice as prevalent in the recovery subreddit (n = 908; 5.4% of 16,791 posts) than in the active opioid use subreddit (n = 4,224; 2.6% of 159,994 posts, p < .001). The most frequent phrases from the recovery subreddit referred to time without using opioids and the possibility of using cannabis as a “treatment.” The most frequent phrases from the opioid subreddit referred to concurrent use of cannabis and opioids. The most common motivations for using cannabis were to manage opioid withdrawal symptoms in the recovery subreddit, often in conjunction with anti-anxiety and GI-distress “comfort meds,” and to enhance the “high” when used in combination with opioids in the opioid subreddit. Despite limitations in generalizability from pseudonymous online posts, this examination of reports of naturalistic cannabis use in relation to opioid use identified withdrawal symptom management as a common motivation. Future research is warranted with more structured assessments that examines the role of cannabis and cannabinoids in addressing both somatic and affective symptoms of opioid withdrawal.", "venue": "PLoS ONE", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-02-08", "journal": {"name": "PLoS ONE", "volume": "17"}, "authors": [{"authorId": "33186745", "name": "Meredith C Meacham"}, {"authorId": "35076424", "name": "A. Nobles"}, {"authorId": "33041070", "name": "D. Tompkins"}, {"authorId": "6480067", "name": "Johannes Thrul"}], "citations": [{"paperId": "9da23b58420ad47dd64b2bd2744ceab12e12f60d", "title": "The Therapeutic Potential of Cannabidiol in Revolutionising Opioid Use Disorder Management"}, {"paperId": "36ccb3223754ebafc3566fc6c0645c67f5796471", "title": "Trends and Barriers of Medication Treatment for Opioid Use Disorders: A Systematic Review and Meta-Analysis"}, {"paperId": "339ef00d2d819c33142102b5ede5ba4268931f93", "title": "Self-Identified Stage in Recovery and Substance-Use Behaviors among Pregnant and Postpartum Women and People with Opioid Use Disorder"}, {"paperId": "e1359489f3e36cbfc9850266c3602745c8d526b2", "title": "Cannabinoids for Substance Use Disorder Treatment: What Does the Current Evidence Say?"}, {"paperId": "65ad1776ba016f66d2507234c450af79375bf67d", "title": "Investigating Substance Use via Reddit: Systematic Scoping Review"}, {"paperId": "ef2fc7dc547ecde90a78a6158eb234cc060f8265", "title": "Differential effect of cannabis use on opioid agonist treatment outcomes: Exploratory analyses from the OPTIMA study."}, {"paperId": "81b316c2a4f4f5970a3f0d059b39958d6179dc22", "title": "Using Social Media Data to Investigate Public Perceptions of Cannabis as a Medicine: Narrative Review"}, {"paperId": "43ef7d4ffe5091cf540911cf934d25192cf9525b", "title": "Social media discourse and internet search queries on cannabis as a medicine: A systematic scoping review"}, {"paperId": "480eea289182c50d555d0efeec8a9c9511de3452", "title": "Alleviation of opioid withdrawal by cannabis and delta-9-tetrahydrocannabinol: A systematic review of observational and experimental human studies."}, {"paperId": "15ce0db80b8f7b8e09b9f512b8413ff0feec3ddb", "title": "Automedicación con uso recreativo: Análisis de discusiones en foros de una comunidad virtual"}, {"paperId": "3b0dea60ffca3a5e170990fd340f69338e3776fe", "title": "Types and Sources of Stigma on Opioid Use Treatment and Recovery Communities on Reddit"}]}
