{"paperId": "dabfe275b4c5387350e9cb89739301ab3f612904", "publicationVenue": {"id": "15049b43-0af1-46bb-8a0b-83e5510cefa0", "name": "Journal of Agricultural and Food Chemistry", "type": "journal", "alternate_names": ["J Agric Food Chem"], "issn": "0021-8561", "url": "https://pubs.acs.org/journal/jafcau", "alternate_urls": ["http://pubs.acs.org/journals/jafcau/index.html", "http://pubs.acs.org/journal/jafcau", "http://pubs.acs.org/journals/jafcau/"]}, "title": "Identification of OLA1 as a Novel Protein Target of Vitexin to Ameliorate Dextran Sulfate Sodium-Induced Colitis with Tissue Thermal Proteome Profiling.", "abstract": "Vitexin, which exists in various medicinal plants and food sources, has recently received increasing attention because of its anti-inflammatory properties. This study aims to identify the protein target of vitexin that ameliorates dextran sulfate sodium (DSS)-induced colitis. The results showed that vitexin not only alleviated the clinical symptoms and colonic damage in mice with DSS-induced colitis but also suppressed the colonic production of inflammatory cytokines (IL-1β, IL-6, ICAM, and VCAM) and enhanced the expression of barrier-associated proteins (ZO-1, Occludin, and E-cadherin). Based on tissue thermal proteome profiling (Tissue-TPP) and molecular docking, OLA1 was creatively identified as a potential protein target for vitexin. Further siRNA-mediated knockdown of the OLA1 gene in Caco-2 cells demonstrated the ability of OLA1 to increase Nrf2 protein expression and, thus, mediated the anti-inflammatory effects of vitexin. Interaction of the OLA1-vitexin complex with Keap1 protein to disrupt the Keap1-Nrf2 interaction may be required for activating Nrf2. Our findings revealed a novel role for OLA1 as a protein target of vitexin that contributes to its anti-inflammatory action by activating Nrf2, which may provide a promising molecular mechanism for novel therapeutic strategies to treat colitis and the associated systemic inflammation.", "venue": "Journal of Agricultural and Food Chemistry", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-10-19", "journal": {"name": "Journal of agricultural and food chemistry"}, "authors": [{"authorId": "2260837598", "name": "Nan Li"}, {"authorId": "2260853700", "name": "Ruiyan Wang"}, {"authorId": "2224865269", "name": "Wenwen Li"}, {"authorId": "2224881367", "name": "Qian Du"}, {"authorId": "2152158659", "name": "Zeyuan Deng"}, {"authorId": "2261069422", "name": "Yawei Fan"}, {"authorId": "49537711", "name": "Liufeng Zheng"}], "citations": []}
