{"paperId": "dac5b97e0e1921b229ecf9a8cf929617392de45c", "publicationVenue": null, "title": "MIPS: Instance Placement for Stream Processing Systems Based on Monte Carlo Tree Search", "abstract": "For up-to-date data stream processing systems, e.g., Apache Heron, the distribution of processing units, a.k.a. instance placement, is determined in two stages, i.e., first mapping instances to containers and then mapping containers to servers. The placement, if improperly decided, can induce considerable traffic across servers and inefficient resource allocation. However, it is an open problem to decide the placement effectively, due to the complex interaction among instances, dependency between the decision making in two stages, and the trade-off between traffic reduction and resource utilization improvement. In this paper, we formulate such a problem as two sequential decision making problems. By adopting Monte Carlo Tree Search (MCTS) methods, we propose MIPS, i.e., a MCTS-based Instance Placement Scheme that decides the two-stage placement in a unified manner, achieving a well balance between computational efficiency and optimality. Results from simulations show that, with mild-value of samples, MIPS surpasses baseline schemes with significant improvement in both traffic reduction and utilization. To our best knowledge, this paper is the first to study and solve the two-staged mapping problem in such systems based on Heron.", "venue": "ICC 2019 - 2019 IEEE International Conference on Communications (ICC)", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-05-01", "journal": {"name": "ICC 2019 - 2019 IEEE International Conference on Communications (ICC)", "pages": "1-6"}, "authors": [{"authorId": "2107913930", "name": "Xi Huang"}, {"authorId": "144161583", "name": "Ziyu Shao"}, {"authorId": "2152283013", "name": "Yang Yang"}], "citations": [{"paperId": "7a178da1a6f477de3546da8aad7ff0e625d2af58", "title": "Optimal Cislunar Architecture Design Using Monte Carlo Tree Search Methods"}, {"paperId": "aec3c3348d45876ada3125503f61c1c1e524be92", "title": "POTUS: Predictive Online Tuple Scheduling for Data Stream Processing Systems"}, {"paperId": "1eb512e609490ef1c4e7930a5f5124c3bad5291e", "title": "Dynamic Tuple Scheduling with Prediction for Data Stream Processing Systems"}]}
