{"paperId": "dad94c57fe304f8b325af2d620a436fdf1d61460", "publicationVenue": {"id": "32d5bd7b-b2d0-429e-8577-2ab39571602e", "name": "Mindfulness", "type": "journal", "issn": "1868-8527", "url": "http://www.springer.com/psychology/journal/12671", "alternate_urls": ["https://link.springer.com/journal/12671"]}, "title": "The Application of Machine Learning to Online Mindfulness Intervention Data: a Primer and Empirical Example in Compliance Assessment", "abstract": null, "venue": "Mindfulness", "year": 2021, "fieldsOfStudy": ["Psychology"], "publicationTypes": null, "publicationDate": "2021-08-27", "journal": {"name": "Mindfulness", "pages": "2519 - 2534", "volume": "12"}, "authors": [{"authorId": "1720920531", "name": "D. Lekkas"}, {"authorId": "1486136128", "name": "George D. Price"}, {"authorId": "2125791689", "name": "Jason McFadden"}, {"authorId": "39972662", "name": "N. Jacobson"}], "citations": [{"paperId": "b540bd4928d35a2b828f3b2df25ad6b83c107d57", "title": "Which Client with Generalized Anxiety Disorder Benefits from a Mindfulness Ecological Momentary Intervention Versus a Self-Monitoring App? Developing A Multivariable Machine Learning Predictive Model"}, {"paperId": "171f242a815537368f1184a96136c9745945d654", "title": "Detecting major depressive disorder presence using passively-collected wearable movement data in a nationally-representative sample"}, {"paperId": "b0bbba51dda4ac9a7c6eaf85d4557aa886953975", "title": "Predicting individual response to a web-based positive psychology intervention: a machine learning approach"}, {"paperId": "353b4e2f4cdd1d994485cbb682b8b36818550dd0", "title": "Mobile phone–based interventions for mental health show promise of effectiveness, but what does the evidence tell us about what needs to come next?"}, {"paperId": "186a9c061fcad350141a5daac83f904cda8b0ece", "title": "The role of digital readiness innovative teaching methods in music art e-learning students’ satisfaction with entrepreneur psychological capital as a mediator: Evidence from music entrepreneur training institutes"}, {"paperId": "41ea9c47bc60df9e9b1645fe2468a9ab4155c4b6", "title": "Applying ensemble machine learning models to predict individual response to a digitally delivered worry postponement intervention."}, {"paperId": "86dc62c354708b25d5ea83b3a718d483d01900b1", "title": "A machine learning investigation into the temporal dynamics of physical activity-mediated emotional regulation in adolescents with anorexia nervosa and healthy controls."}, {"paperId": "74599b48b80405501308c5c23a78882eaee1135e", "title": "An exploratory application of machine learning methods to optimize prediction of responsiveness to digital interventions for eating disorder symptoms"}, {"paperId": "1599207eed327e3eccd6174f836fd84621e09e87", "title": "The Feasibility and Utility of Harnessing Digital Health to Understand Clinical Trajectories in Medication Treatment for Opioid Use Disorder: D-TECT Study Design and Methodological Considerations"}, {"paperId": "38f3ef85af5f1d4f4c6152ab658e49b61edfcd9c", "title": "Individual Differences in Cognitive Functioning Predict Compliance With Restoration Skills Training but Not With a Brief Conventional Mindfulness Course"}]}
