{"paperId": "dae0097383dd9c068cbaf6469ebf1088b427ee93", "publicationVenue": {"id": "850fc070-bb53-4d7e-87ef-5e94e6f107de", "name": "ACS Applied Materials and Interfaces", "type": "journal", "alternate_names": ["AC Appl Mater Interface", "AC Appl Mater  Interface", "ACS Applied Materials & Interfaces"], "issn": "1944-8244", "url": "https://pubs.acs.org/journal/aamick", "alternate_urls": ["http://pubs.acs.org/journal/aamick", "https://pubs.acs.org/loi/aamick"]}, "title": "Robust 2D MoS2 Artificial Synapse Device Based on a Lithium Silicate Solid Electrolyte for High-Precision Analogue Neuromorphic Computing.", "abstract": "High-precision artificial synaptic devices compatible with existing CMOS technology are essential for realizing robust neuromorphic hardware systems with reliable parallel analogue computation beyond the von Neumann serial digital computing architecture. However, critical issues related to reliability and variability, such as nonlinearity and asymmetric weight updates, have been great challenges in the implementation of artificial synaptic devices in practical neuromorphic hardware systems. Herein, a robust three-terminal two-dimensional (2D) MoS2 artificial synaptic device combined with a lithium silicate (LSO) solid-state electrolyte thin film is proposed. The rationally designed synaptic device exhibits excellent linearity and symmetry upon electrical potentiation and depression, benefiting from the reversible intercalation of Li ions into the MoS2 channel. In particular, extremely low cycle-to-cycle variations (3.01%) during long-term potentiation and depression processes over 500 pulses are achieved, causing statistical analogue discrete states. Thus, a high classification accuracy of 96.77% (close to the software baseline of 98%) is demonstrated in the Modified National Institute of Standards and Technology (MNIST) simulations. These results provide a future perspective for robust synaptic device architecture of lithium solid-state electrolytes stacked with 2D van der Waals layered channels for high-precision analogue neuromorphic computing systems.", "venue": "ACS Applied Materials and Interfaces", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-11-17", "journal": {"name": "ACS applied materials & interfaces"}, "authors": [{"authorId": "2111271128", "name": "Byeongjin Park"}, {"authorId": "144228508", "name": "Y. Hwang"}, {"authorId": "117307922", "name": "O. Kwon"}, {"authorId": "48558148", "name": "S. Hwang"}, {"authorId": "2136181470", "name": "Ju Ah Lee"}, {"authorId": "2167816837", "name": "D. Choi"}, {"authorId": "2191075397", "name": "Seoung-Ki Lee"}, {"authorId": "145343253", "name": "A. Kim"}, {"authorId": "40056971", "name": "B. Cho"}, {"authorId": "52144587", "name": "J. Kwon"}, {"authorId": "2243922413", "name": "Je In Lee"}, {"authorId": "73555166", "name": "Yonghun Kim"}], "citations": [{"paperId": "aac06b1864ef52e2e2cd2c2bdde7141d40d8f1ae", "title": "Electric-double-layer-gated 2D transistors for bioinspired sensors and neuromorphic devices"}, {"paperId": "db4eac243e305937946d1ce922ae9223ed1880b0", "title": "Emerging optoelectronic artificial synapses and memristors based on low-dimensional nanomaterials"}, {"paperId": "7d95df7aebedec9bdab8dd74a822ab2dce6bc5b5", "title": "Effects of Mg Doping to a LiCoO2 Channel on the Synaptic Plasticity of Li Ion-Gated Transistors."}, {"paperId": "7819c9283addd1cd60d859b9ad0a32725932056b", "title": "Ionotronic WS_2 memtransistors for 6-bit storage and neuromorphic adaptation at high temperature"}, {"paperId": "94a9535a5ca51285900116c03f7a16697a768070", "title": "Ultrafast and Low-Power 2D Bi2O2Se Memristors for Neuromorphic Computing Applications."}, {"paperId": "69d47d9b33fb254e95b7caf6333735161883cf66", "title": "Reservoir computing based on electric-double-layer coupled InGaZnO artificial synapse"}]}
