{"paperId": "dae13a1adf5d0f73c46571ff8603efeec0f6e896", "publicationVenue": {"id": "c37b14d1-c0a1-47f2-93d4-8f658efbdb67", "name": "International Journal of Innovation and Technology Management (IJITM)", "type": "journal", "alternate_names": ["International Journal of Innovation and Technology Management", "Int J Innov Technol Manag (IJITM", "Int J Innov Technol Manag"], "issn": "0219-8770", "url": "https://www.worldscientific.com/worldscinet/ijitm", "alternate_urls": ["http://www.worldscinet.com/ijitm/ijitm.shtml"]}, "title": "Disaster Management during Pandemic: A Big Data-Centric Approach", "abstract": "The concept of big data (BD) has been coupled with disaster management to improve the crisis response during pandemic and epidemic. BD has transformed every aspect and approach of handling the unorganized set of data files and converting the same into a piece of more structured information. The constant inflow of unstructured data shows the research lacuna, especially during a pandemic. This study is an effort to develop a pandemic disaster management approach based on BD. BD text analytics potential is immense in effective pandemic disaster management via visualization, explanation, and data analysis. To seize the understanding of using BD toward disaster management, we have taken a comprehensive approach in place of fragmented view by using BD text analytics approach to comprehend the various relationships about disaster management theory. The study’s findings indicate that it is essential to understand all the pandemic disaster management performed in the past and improve the future crisis response using BD. Though worldwide, all the communities face big chaos and have little help reaching a potential solution.", "venue": "International Journal of Innovation and Technology Management (IJITM)", "year": 2021, "fieldsOfStudy": ["Business"], "publicationTypes": null, "publicationDate": "2021-06-22", "journal": {"name": "International Journal of Innovation and Technology Management"}, "authors": [{"authorId": "2097790074", "name": "Mohamed M. Elsotouhy"}, {"authorId": "4360448", "name": "Geetika Jain"}, {"authorId": "13219080", "name": "Archana Shrivastava"}], "citations": [{"paperId": "f2bc0ba388207e7ff9cf52dab45d84532189dcee", "title": "Locating and deploying essential goods and equipment in disasters using AI-enabled approaches: A systematic literature review"}, {"paperId": "961dd57b6cdefa31f46d4d1176d649948edf6f7d", "title": "Innovate emergency governance mechanism of urban communities in response to major public health events: A qualitative study from multiple principals in Guangzhou, China"}, {"paperId": "9a1069d32f0b42d50898d5b7e0c4cfaf19569335", "title": "Research on Safety and Integrated Disaster Prevention System Based on Big Data Technology"}, {"paperId": "74bed3470a13822e68324fc84a5f7a97e431a65f", "title": "Manufacturing strategy 4.0: a framework to usher towards industry 4.0 implementation for digital transformation"}, {"paperId": "1e90943b2a2d2d387aeffc6390f82b263cd35d47", "title": "Efficient Query Model of Blockchain System in The Context of Dig Data"}, {"paperId": "23c90d60a508269d7b4963ea1a99ef94f8770623", "title": "A digital transformation-enabled framework and strategies for public health risk response and governance: China's experience"}]}
