{"paperId": "dae231d3f58c7237f56a4ff5dc889d4c86d81880", "publicationVenue": null, "title": "Real-time Data Infrastructure at Uber", "abstract": "Uber's business is highly real-time in nature. PBs of data is continuously being collected from the end users such as Uber drivers, riders, restaurants, eaters and so on everyday. There is a lot of valuable information to be processed and many decisions must be made in seconds for a variety of use cases such as customer incentives, fraud detection, machine learning model prediction. In addition, there is an increasing need to expose this ability to different user categories, including engineers, data scientists, executives and operations personnel which adds to the complexity. In this paper, we present the overall architecture of the real-time data infrastructure and identify three scaling challenges that we need to continuously address for each component in the architecture. At Uber, we heavily rely on open source technologies for the key areas of the infrastructure. On top of those open-source software, we add significant improvements and customizations to make the open-source solutions fit in Uber's environment and bridge the gaps to meet Uber's unique scale and requirements. We then highlight several important use cases and show their real-time solutions and tradeoffs. Finally, we reflect on the lessons we learned as we built, operated and scaled these systems.", "venue": "SIGMOD Conference", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2021-03-31", "journal": {"name": "Proceedings of the 2021 International Conference on Management of Data"}, "authors": [{"authorId": "1945722", "name": "Yupeng Fu"}, {"authorId": "49188988", "name": "Chinmay Soman"}], "citations": [{"paperId": "b81e4326bafc24727aeb1ad0060106fd8452928a", "title": "Data pipeline for real-time energy consumption data management and prediction"}, {"paperId": "c22d63ac2bf295e7c31f9a5b263b9b0360730327", "title": "Accelerating Time to Science using CRADLE: A Framework for Materials Data Science"}, {"paperId": "77b1ff5d7ad04585ca043cd7ba075f12aa07e366", "title": "Ridesharing in Rail-Freight Transport and Use of Digital Aggregator: Prospects and Difficulties - A Developer's Perspective"}, {"paperId": "9caf5e110d7c2013051f2d9c8547275da5c682e7", "title": "StreamBed: capacity planning for stream processing"}, {"paperId": "bf99b0f1ed2145b09a37be25d5119efe9ac2aa95", "title": "Real-Time Data Visualization and Analysis Using ASP.NET Core's Tag Helpers in Business Intelligence Applications"}, {"paperId": "57a5677c71c6e3734476c8ca1a16fad58ff86d51", "title": "Fast Prototyping of Distributed Stream Processing Applications with stream2gym"}, {"paperId": "7341dbdeee4859fbf53d0cbb5f48540960468238", "title": "Digital Twin of a Digital World: Process, Data, and Experience Perspectives"}, {"paperId": "fc3b81275d1413b65f339ef3780b08ddc2df4f60", "title": "Rotary: A Resource Arbitration Framework for Progressive Iterative Analytics"}, {"paperId": "5e2ee8d2f117d707d79fcc62dd95166be154fe98", "title": "UrbanKG: An Urban Knowledge Graph System"}, {"paperId": "8a82e198a81a60447a5ff53bf284d66b443ea530", "title": "Latency vs Cost : Data Ingestion options at Twitter Scale"}, {"paperId": "b4258742a640151fa863092bed7f35d25dd92ab5", "title": "Shepherd: Seamless Stream Processing on the Edge"}, {"paperId": "4b12ee53cb5bae5c230f06129085ebf9443390e4", "title": "Sparrow Tracer: Scalable Real Time Metrics from Event Log Pipelines at Twitter"}, {"paperId": "2166a14f3d290267b57e13ff4d191fd0cbb14a07", "title": "An Automated Cost Prediction in Uber/Call Taxi Using Machine Learning Algorithm"}, {"paperId": "caa7720e3db63485a8a5e8a96ac8e693dd572314", "title": "Secure and privacy-preserving crowdsensing using smart contracts: Issues and solutions"}, {"paperId": "cfe0102d1cb13a921117e854a9ba880cd6ba0923", "title": "Twitter Sparrow : Reduce Event Pipeline latency from hours to seconds"}, {"paperId": "e41e3b10931053f29f63e7f7038176de11f1d746", "title": "Recent Advances in Wearable Sensing Technologies"}, {"paperId": "cbeaa7fe8e3d86a2b46fc10c0788a26836847f18", "title": "Data Lakes: A Survey of Functions and Systems"}, {"paperId": "eac25febfbd3b0708193714a7aa42ab2e815e3b6", "title": "Green incremental learning - Energy efficient ramp-up for AI-enhanced part recognition in reverse logistics"}, {"paperId": "c5269518351196e2d6a653b60fa7b024d329b95d", "title": "Fast and Efficient Update Handling for Graph H2TAP"}, {"paperId": "f1ddf757d3dd8c5263607d5e6103a2a218bebe86", "title": "Meces: Latency-efficient Rescaling via Prioritized State Migration for Stateful Distributed Stream Processing Systems"}, {"paperId": "6ac1749272c9d2db025a6e26b3166555382db5bc", "title": "Recent Advances in Data Engineering for Networking"}, {"paperId": "cbfca843a2298e5264a30b11204bb69e2d0185d7", "title": "Decentralised Data Flows for the Functional Scalability of Service-Oriented IoT Systems"}, {"paperId": "0853ee101dca558ebcd7f9e0b252a33ce47123b4", "title": "DigitalCommons@UNO DigitalCommons@UNO"}]}
