{"paperId": "daf35ef0b4c89da672fc26b0eb0e66b516abb2eb", "publicationVenue": null, "title": "Differentiating the Level of Territorial Development of the Transport and Logistics Infrastructure in Ukraine by Adapting the Cluster Analysis Methodology", "abstract": "Recently, much attention has been paid to the ideas and theories that highlight the cluster approach to the territorial organization of the economic system. Separation and development of transport and logistics cluster contributes to the development of competitive advantages, provides the leading position of the country in the world market and enhances the investment attractiveness of the region in which it operates. \nThe use of a multidimensional statistical method of cluster analysis to determine the homogeneity between the individual regions of Ukraine contributes to the identification of transport and logistics cluster. For this reason, the article analyzes the role of cluster analysis in the study of the development of transport and logistics services, shows that the transport and logistics cluster is formed on the basis of the real socio-economic situation in the conditions of a particular territory, taking into account its potential development. It is substantiated that the transport and logistics cluster, in addition to meeting the needs of the economy, performs a number of important functions: it creates opportunities for the development of sectors of the national economy; contributes to the development of the region's infrastructure; increases the investment attractiveness of the region. The conducted research of existing methods of cluster analysis of grouping of regions of Ukraine by the level and potential of development of the market of transport and logistic services has allowed to allocate the considered ways of estimation of efficiency of functioning of the cluster which differ in external and internal effects. A cluster analysis of the territorial level and potential of logistics development in the regions of Ukraine is carried out on the basis of three groups of indicators (socio-economic, transport performance indicators of the region and indicators characterizing the composition of the transport system of the region and its potential opportunities). As a result of the cluster analysis, the regions of Ukraine were grouped into three clusters by the level of logistics development, and into two clusters by the logistics development potential. It is determined that the classification of regions into homogeneous groups will allow to build in each cluster typologically regressive equations of interaction of market factors, which will increase the accuracy of the study of the dynamics of the development of the market environment of regions of potential placement of elements of transport and logistics infrastructure.", "venue": "", "year": 2020, "fieldsOfStudy": ["Business"], "publicationTypes": null, "publicationDate": "2020-03-01", "journal": {"name": "", "pages": "6-16", "volume": ""}, "authors": [{"authorId": "147673894", "name": "N. Hrynchak"}], "citations": []}
