{"paperId": "dafe9e82f762bb53fcb0bfbab355ef94de2da863", "publicationVenue": {"id": "61a26733-f8ab-4c45-8bd1-5d75465606e3", "name": "International Journal of Scientific Research in Computer Science Engineering and Information Technology", "type": "journal", "alternate_names": ["Int J Sci Res Comput Sci Eng Inf Technol"], "issn": "2456-3307", "url": "http://ijsrcseit.com/"}, "title": "Using an Adapted Hybrid Intelligent Framework to Make Predictions Regarding Heart Diseases", "abstract": "The effects of heart disease on a person's life can be devastating, making it one of the world's most serious health problems. Patients with heart disease have a compromised ability of the heart to pump blood throughout the entire body. A proper and prompt diagnosis of cardiac disease is the first step in preventing and treating heart failure. Diagnosing heart illness has a long history of being fraught with difficulty. Machine learning-based noninvasive technology can accurately and quickly distinguish between healthy people and those with heart disease. In the proposed research, we used heart illness datasets to develop a machine-learning-based detection system for predicting cardiovascular disease. In order to measure the efficacy of our machine learning algorithms, feature selection algorithms, and classifiers in terms of metrics like accuracy and specificity, we employed cross-validation. Our method allows for quick and easy differentiation between those with heart illness and healthy people. Analysis of the receiver optimistic curves and area under the curves for each classifier was performed. Classifiers, feature selection algorithms, preprocessing techniques, validation strategies, and performance metrics for classifiers have all been discussed in this work. The performance of the suggested system has been evaluated using both the full set of features and a subset. The results include a comparison of recall, F1 score, and false positive rate. Decreases in the number of features used to make a classification have a notable effect on both the classifier's accuracy and the time it takes to run. The anticipated machine-learning-based decision support system would help doctors make more precise diagnoses of cardiac illness.", "venue": "International Journal of Scientific Research in Computer Science Engineering and Information Technology", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-04-01", "journal": {"name": "International Journal of Scientific Research in Computer Science, Engineering and Information Technology"}, "authors": [{"authorId": "2216092890", "name": "Sumit Kumar Soni"}, {"authorId": "2216087426", "name": "Dr. Kalpana Rai"}, {"authorId": "2216093979", "name": "Dr. Harsh Mathur"}], "citations": []}
