{"paperId": "db0175df5df3deb48753545625ca003fe3dd2640", "publicationVenue": {"id": "e97b6537-a7e6-449e-b131-18cdc4def33e", "name": "Economics of Innovation and New Technology", "type": "journal", "alternate_names": ["Econ Innov New Technol"], "issn": "1043-8599", "url": "http://www.tandfonline.com/loi/gein20", "alternate_urls": ["http://www.tandfonline.com/toc/gein20/current"]}, "title": "BIG data – BIG gains? Understanding the link between big data analytics and innovation", "abstract": "ABSTRACT This paper analyzes the relationship between firms' use of big data analytics and their innovative performance in terms of product innovations. Since big data technologies provide new data information practices, they create novel decision-making possibilities, which are widely believed to support firms' innovation process. Applying German firm-level data within a knowledge production function framework we find suggestive evidence that big data analytics is a relevant determinant for the likelihood of a firm becoming a product innovator as well as for the market success of product innovations. These results hold for the manufacturing as well as for the service sector but are contingent on firms' investment in IT-specific skills. Overall, the results support the view that big data analytics have the potential to enable innovation.", "venue": "Economics of Innovation and New Technology", "year": 2018, "fieldsOfStudy": ["Engineering", "Business", "Economics"], "publicationTypes": null, "publicationDate": "2018-07-17", "journal": {"name": "Economics of Innovation and New Technology", "pages": "296 - 316", "volume": "28"}, "authors": [{"authorId": "34883318", "name": "Thomas Niebel"}, {"authorId": "100900529", "name": "Fabienne Rasel"}, {"authorId": "101207432", "name": "Steffen Viete"}], "citations": [{"paperId": "1504d84c7d1c1c645874bf05dfe60e8682d2f389", "title": "Enhancing big data analytics deployment: uncovering stakeholder dynamics and balancing salience in project roles"}, {"paperId": "cb6fa80457c3df571939116bf4491bdce69110c6", "title": "Earth Observation data, innovation and economic performance: a study of the downstream sector in Italy"}, {"paperId": "15b814da56c19056da2157ce324cf025a99bc767", "title": "How big data analytics can create competitive advantage in high-stake decision forecasting? The mediating role of organizational innovation"}, {"paperId": "0bc9944eaa72460cc3608e7275ed65491e95bd1c", "title": "Digitalization strategy adoption: The roles of key stakeholders, big data organizational culture, and leader commitment"}, {"paperId": "697657d349352f7142f557cdac1c11b83d53a749", "title": "Technological, process or managerial innovation? How does digital transformation affect green innovation in industrial enterprises?"}, {"paperId": "786344c1c16f574f9c2c5016b3fd8b778be529fe", "title": "Emerging Technologies Revolutionising Public Procurement: Insights from Comprehensive Bibliometric Analysis"}, {"paperId": "e07729f8961667720e1fab32674705d1bbc6063c", "title": "Artificial Intelligence and Big Data in Sustainable Entrepreneurship"}, {"paperId": "1c93c359a4ab7ad0e9224db23e458fb5e81897ea", "title": "The Power of Big Data: The Impact of Urban Digital Transformation on Green Total Factor Productivity"}, {"paperId": "de1594cad0face20ac41075165e016f51741598f", "title": "Do knowledge sharing and big data analytics capabilities matter for green absorptive capacity and green entrepreneurship orientation? Implications for green innovation"}, {"paperId": "270b2193a61710df534bcc7c534f5f4d479ce9c2", "title": "Unlocking the role of smart cities in technological innovation: evidence from China"}, {"paperId": "6da5ddb68924a7dded376af5635072576df7c6ee", "title": "Do digital technologies pay off? A meta-analytic review of the digital technologies/firm performance nexus"}, {"paperId": "493dafc21a794e50604d1b7197cff641e0f4b27d", "title": "Using big data for generating firm-level innovation indicators - a literature review"}, {"paperId": "c318c5eab96133696d5f0a98e01fb7716d6f79be", "title": "Is digitalization a source of innovation? Exploring the role of digital diffusion in SME innovation performance"}, {"paperId": "72e28dda476fd1a9b6b987bbe35c2deb80330d0a", "title": "Enhancing Business Intelligence and Decision-Making Through Big Data Analytics"}, {"paperId": "948133f78bcd69f9e01050225c0adc08b1de6319", "title": "Data-driven decision making in advanced manufacturing Systems: modeling and analysis of critical success factors"}, {"paperId": "3e74e49f31efe63212b9f45b07367af97f1436ad", "title": "Big data analytics adaptive prospects in sustainable manufacturing supply chain"}, {"paperId": "80f589ca6ac158c7187bbc0249c3fd03f99336b1", "title": "Predicting the impact of big data analytics capability and green absorptive capacity on green entrepreneurship orientation and eco-innovation"}, {"paperId": "40bc8c927b855fa66103e29abe1ba49aa8e979ab", "title": "Regional Big Data Application Capability and Firm Green Technology Innovation"}, {"paperId": "0a565fcd8c45b6bc7ffa909e1d2034f921b73aa1", "title": "Can firm R&D benefit from digital technologies? Evidence from Chinese high-speed rail industry"}, {"paperId": "6da0fad1191d2b403bbcc2866242b32782b57ba1", "title": "Unlocking sustainable supply chain performance through dynamic data analytics: a multiple mediation model of sustainable innovation and supply chain resilience"}, {"paperId": "1a91a09f50db3429fc64120b68864c251e034902", "title": "Do Intelligent Manufacturing Concerns Promote Corporate Sustainability? Based on the Perspective of Green Innovation"}, {"paperId": "da6ef60d7135a75e2fa63c22de14f6f41585dadb", "title": "Artificial Intelligence and Firm-Level Productivity"}, {"paperId": "9f8c89c7de2e16da587e50d277af3a2da196073e", "title": "Impact of digitalization on technological innovations in small and medium-sized enterprises (SMEs)"}, {"paperId": "8c7f5ffad2297cf160dc34dbbbb9c3ca14c9c742", "title": "The Impact of Big Data Analytics on Investment Efficiency and Financial Performance: Evidence from Saudi Stock Market"}, {"paperId": "0fb9f2fbe5b75480fceb0ea924f4e9e13a14b1f9", "title": "Estimating the innovation benefits of first-mover and second-mover strategies when micro-businesses adopt artificial intelligence and machine learning"}, {"paperId": "9fc9f701ddf6ecdd39885ad58df4e3cc0c130371", "title": "Understanding the Impact of Big Data Analytics and Knowledge Management on Green Innovation Practices and Organizational Performance: The Moderating Effect of Government Support"}, {"paperId": "6e711b05f9fa548f78ae91bc97d4190c4bcaf2ee", "title": "The impact of AI on carbon emissions: evidence from 66 countries"}, {"paperId": "ec49723a4c63009cb6f18f6bcfde94e5f47aa9bc", "title": "German financial state aid during Covid-19 pandemic: Higher impact among digitalized self-employed"}, {"paperId": "3cc33e86855d34ad15180e0feec3b828e1e3e0d4", "title": "Sustainability Analysis of Enterprise Performance Management Driven by Big Data and Internet of Things"}, {"paperId": "7141f628575c1278373afdd9b16768d38af14238", "title": "Application of data elements in the coupling of finance and technology on the digital electronic platform"}, {"paperId": "80b68bee0feffc10550ada890fa1c39752b906cc", "title": "How and When Does Big Data Analytics Capability Boost Innovation Performance?"}, {"paperId": "2e2218f5686b829f026505aa4e5e090e47f0f1b5", "title": "APPLICATION OF THE ESSENTIAL FACILITIES DOCTRINE IN THE ANALYSIS OF THE BIG DATA OPERATORS BEHAVIOR"}, {"paperId": "86d1c8803d75b98aa78e77047d4b8f8dc72c09b5", "title": "Internet of things, big data analytics and operational performance: the mediating effect of supply chain visibility"}, {"paperId": "218633e7b4b73cd72fae4cf5b4c59003204a7645", "title": "INNOVATION MANAGEMENT: IS BIG DATA NECESSARILY BETTER DATA?"}, {"paperId": "6711cca2ea2c21f5cf758cb59e67ae779f1d2d73", "title": "Adoption of emerging technologies and growth of manufacturing firms: the importance of technology types and corporate entrepreneurship"}, {"paperId": "50bba0fcc75617b93ec6ee7cdaada077ce0a61bf", "title": "The Data Governance Act: – Promoting or Restricting Data Intermediaries?"}, {"paperId": "98b1827a9b8e1e9ac3df352bfeb418fe8ebeb13a", "title": "How Does Manufacturing Intelligentization Influence Innovation in China from a Nonlinear Perspective and Economic Servitization Background?"}, {"paperId": "1bfbef85be7a2c5eb3d61601637b212b3742c9ac", "title": "Assessing the impact of digital education and the role of the big data analytics course to enhance the skills and employability of engineering students"}, {"paperId": "eac882ee764ad0eb47e6399f9fd7b58ec3c09ffc", "title": "Artificial intelligence and radical innovation: an opportunity for all companies?"}, {"paperId": "d5226eaa943748e074e357a777a36f25a9314055", "title": "Big data and innovative organizational performance: Evidence from a moderated‐mediated model"}, {"paperId": "0cce9ffcc0b5db163ab2aec72490e2b64c52b873", "title": "Artificial intelligence and industrial innovation: Evidence from German firm-level data"}, {"paperId": "b34091dba25ea01eba2342798901ad160082faaa", "title": "Understanding Big Data-Business Alignment from a Dynamic Perspective"}, {"paperId": "786ea673ce9448b382b03ca610369f09e84ccb59", "title": "Organizational Barriers Towards Industry 4.0"}, {"paperId": "807effef9e52e27daaaeb782bcac76bb206160b8", "title": "Coding for intangible competitive advantage - mapping the distribution and characteristics of software-developing firms in the Swedish economy"}, {"paperId": "ab40cd3ede55013d4a43b337b922a31eb835ef95", "title": "Understanding Artificial Intelligence Adoption Predictors: Empirical Insights from A Large-Scale Survey"}, {"paperId": "8191bb4823e04317d70356ef687d1c16daa54e1e", "title": "Can big data analytics capabilities promote a competitive advantage? Green radical innovation, green incremental innovation and data-driven culture in a moderated mediation model"}, {"paperId": "df16be9b4aa251ab6ea6245cdd35c06bb0b15b9b", "title": "HIGH EFFICIENCY PUBLIC TRANSPORTATION SYSTEM: ROLE OF BIG DATA IN MAKING RECOMMENDATIONS"}, {"paperId": "a46b6112792f0c297b7999b5ecaf782e99198534", "title": "Does Big Data Drive Innovation In E-Commerce: A Global Perspective?"}, {"paperId": "9a598a955068d5c6e7ec8ab65bca0747e9b00751", "title": "Can intellectual capital promote the competitive advantage? Service innovation and big data analytics capabilities in a moderated mediation model"}, {"paperId": "a40e32ed6b956627a39f97de8620152721b55866", "title": "Changes in the skills of the workforce for future development of the labor market in the Slovak Republic"}, {"paperId": "5eb2a1404e1550844b4e27e11baadc079bd84691", "title": "Performance measurement based on machines data: Systematic literature review"}, {"paperId": "9f8191832376a8abdfb3ca519ad7da7362c345c9", "title": "Does value chain participation facilitate the adoption of Industry 4.0 technologies in developing countries?"}, {"paperId": "5a22d5498aaf405ba1958e0e16794288ed388f9a", "title": "Industry 4.0 Technologies Applied to the Rail Transportation Industry: A Systematic Review"}, {"paperId": "97252187eca4d9447f318d16739e355ce37a4427", "title": "How digitalisation empowering firm innovation breaks the game? Based on fuzzy set qualitative comparative analysis"}, {"paperId": "e22205825f49e2ac5e302c1e089a25ec39d46c32", "title": "Impact of big data usage on product and process innovation: the role of data diagnosticity"}, {"paperId": "9751ae419fb7ecbf235deff39376dc11d4b50b6f", "title": "How Does Awareness Toward the Industry 4.0 Applications Affect Firms' Financial and Innovation Performance?"}, {"paperId": "cb6096d8074806e29c7915182ffeaf58de5d115c", "title": "Intelligent technologies and productivity spillovers: Evidence from the Fourth Industrial Revolution"}, {"paperId": "ceb9a4c210227124add8115d561c1fbd4adfb97c", "title": "Big data analytics as a roadmap towards green innovation, competitive advantage and environmental performance"}, {"paperId": "06ccc07062f3ac22b85b81923df5dd4d3dc99692", "title": "Consequential factors of Big Data's Analytics Capability: how firms use data in the competitive scenario"}, {"paperId": "2eaeb3109a8ee93b57b4b57ec43ca191a2225d6f", "title": "Software development and innovation: Exploring the software shift in innovation in Swedish firms"}, {"paperId": "243ce74604150c6d84627f1b5d4af173751e4da7", "title": "Swarm intelligence goal-oriented approach to data-driven innovation in customer churn management"}, {"paperId": "c1db34ae4ab55359a0af2b28d46afcfc00004da5", "title": "\"Bio to bits\": the Millennium Ecosystem Assessment (MA) as a metaphor for Big Data ecosystem assessment"}, {"paperId": "cbad0923db89f23febcbd6192ff4149289ff2ad9", "title": "A survey on data‐efficient algorithms in big data era"}, {"paperId": "14f7dde4828503b827e0460f67d7c42c49178a79", "title": "Fostering big data analytics capability through process innovation: Is management innovation the missing link?"}, {"paperId": "07e53eed4ff504053f5fee9030c0310af4a863a9", "title": "Big Data and its potential role in regional growth: evidence from Great Britain"}, {"paperId": "9f608425abddc7b79eb91db2ea80f6b4439338f2", "title": "Sustainable Competitive Advantage Driven by Big Data Analytics and Innovation"}, {"paperId": "1b0ba1137b06a2eae749ccb57d621aa76f66a24a", "title": "Big data supply chain analytics: ethical, privacy and security challenges posed to business, industries and society"}, {"paperId": "2e69f4f841c3d1c0efd9d086cbb641e374b780ed", "title": "Green innovation as a mediator in the impact of business analytics and environmental orientation on green competitive advantage"}, {"paperId": "16003a52617036700863480c3afc42a364499337", "title": "The Impact of Industry 4.0 on Innovation Performance: Insights from German Manufacturing and Service Firms"}, {"paperId": "abecb02eac43ea44e650afee3850272c8bbd1624", "title": "Data: A collaborative ?"}, {"paperId": "0466ae013d55830ea10f03c47c290a10cffdfdc1", "title": "Cooperative Innovation Behavior Based on Big Data"}, {"paperId": "1411bc22b205d5031b2ea9f7c01c24082c9d103d", "title": "The influence of intelligent manufacturing on financial performance and innovation performance: the case of China"}, {"paperId": "91ce17626681300a4bca48e54b5641ae15a8b2ab", "title": "A Product/Service System Design Schema: Application to Big Data Analytics"}, {"paperId": "fcae5999b0e7e8dd7fc86b78ee6a66b7c4707b63", "title": "Reinventing Innovation Management: The Impact of Self-Innovating Artificial Intelligence"}, {"paperId": "5d0ec57252dfe93eeaadae1ef21a59ce46d19821", "title": "Big Data Analytics and Organizational Performance: A Meta-Analysis Study"}, {"paperId": "4047117926f52fdfb6455815e974fd59ca762e8c", "title": "Let the User Speak: Is Feedback on Facebook a Source of Firms' Innovation?"}, {"paperId": "9c29a8ed8a8412a89c2e99096aef1f85535d1884", "title": "Evidence on the Adoption of Artificial Intelligence: The Role of Skills Shortage"}, {"paperId": "144c884623827e0f8b3a00c826ca698429df7e30", "title": "Big data and dynamic capabilities in the digital revolution: The hidden role of source variety"}, {"paperId": "08c75f96c1afd89d4160b670de132c30cffc2412", "title": "Impact of blockchain-enabled analytics as a tool to revolutionize the banking industry"}, {"paperId": "24fe0e62841fcf3a80b120e696d076e4cca6d8c0", "title": "Impact of social media analytics on digital innovation"}, {"paperId": "daf32bd5cc03c0fa61cdba9b574aac056d4bf753", "title": "Impact of analytics on supply chain management"}, {"paperId": "088cb718f254dcbae3184e82fbed7a1d23e016d4", "title": "Using Big Data for Generating Firm-Level Innovation Indicators – A Literature Review"}, {"paperId": "02389959b3ad535a44093e21645841d54cc93e34", "title": "How analytics is driving the supply chain innovation in North America"}, {"paperId": "9ffcd9d0ee1d735756deb67130a6617106a54f92", "title": "Production functions in the sector of knowledge intensive services"}, {"paperId": "dd7f28389ebd558a3b294aa0b922e761cc415308", "title": "Artificial Intelligence and Industrial Innovation: Evidence From Firm-Level Data"}, {"paperId": "8e231b3a68c4fbace5635fc17b7e15f05b36ef20", "title": "Big Data Analysis as a Digital Service: Evidence Form Manufacturing Firms"}, {"paperId": "6bbc90be041cc971982cf2fd0e1ff0b58c03e994", "title": "An overview of big data analytics application in supply chain management published in 2010-2019"}, {"paperId": "1caff53e2a277c2140c7bb01765d08eebf00fcb0", "title": "The Big Potential of Big Data in Manufacturing: Evidence from Emerging Economies"}, {"paperId": "ac3b7ec781668ce7411efa76abe82e6bba84b1d6", "title": "DOES VALUE CHAIN PARTICIPATION FACILITATE THE ADOPTION OF DIGITAL TECHNOLOGIES IN DEVELOPING COUNTRIES?"}, {"paperId": "99d7e09ada28c7dac140dd9dbbd642d4055bdcaa", "title": "Capital Incentive Policies in the Age of Cloud Computing: An Empirical Case Study"}, {"paperId": "d2577f8f1becf1d6f2e38f3e6458ea60f774c9dc", "title": "Big Data Supply Chain Analytics (BDSCA): Ethical, Privacy and Security challenges posed to business, industries and society"}, {"paperId": "5eb807768bd01d4b1b9f7800a8d617b54529f6ab", "title": "DO CAPITAL INCENTIVE POLICIES DISTORT THE ADOPTION OF CLOUD TECHNOLOGIES AND BIG DATA?"}, {"paperId": "fd71e01c3254c1dc1fca09d385e3a34b1fc6cd6e", "title": "Toward a new Framework of Strategic Alignment of Big Data projects: literature review"}, {"paperId": "21bf1777aa83379e76c26ddd40198fb93cac31e5", "title": "THE ASIAN BULLETIN OF GREEN MANAGEMENT AND CIRCULAR ECONOMY"}]}
