{"paperId": "db05b6d4d268b943a38f2dc5ee29323d41b6d3f8", "publicationVenue": null, "title": "Systematic mapping study of economic and business models of cloud services", "abstract": "Cloud computing is a business paradigm wherein computers and computing related services are provided by Cloud Service Providers to consumers either as software, development platform, or infrastructure. From an economic and business perspective, Cloud services involve cost, ownership quality of service and service level agreements. There are studies on economic and business models of cloud services on the cloud landscape especially in the area of pricing. Despite this, there is still a dearth of papers in this area of study. The objective of this study is to conduct a systematic mapping study to collect all relevant research on economic and business models of Cloud services. A systematic map provides a structured overview in a particular research area. The representation of the mapping process offers unique course-grained overview of the results. The results are presented in terms of research such as evaluation and solution, and contribution such as tools and method utilized. The results showed that there are more publications on pricing models in relation to tools with 6.87% and model with 14.5%, more publications on economic and business implications in terms of method with 11.45%, more publications on Cloud market in term of processes with 6.87%, more papers on security in the area of evaluation with 8.55% and validation research with 6.58%, and more papers on Cloud markets with respect to experience with 4.61% and validation with 5.92%. The research gaps identified in this study should motivate researchers to carry out more mapping studies in the field.", "venue": "", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2020-05-01", "journal": {"name": "Indonesian Journal of Electrical Engineering and Computer Science", "pages": "987-994", "volume": "18"}, "authors": [{"authorId": "1403165292", "name": "I. Odun-Ayo"}, {"authorId": "1576794648", "name": "Toro-Abasi Williams"}, {"authorId": "1403735292", "name": "O. Abayomi-Alli"}, {"authorId": "2535760", "name": "J. Yahaya"}], "citations": [{"paperId": "3be10e474dd344ea8373b67b6d21b4b0212d5076", "title": "Digital transformation and business model in management & business research: An overview and future perspectives"}, {"paperId": "27fc9f746ef2cba9d8268c829f32cff8c65a1e3d", "title": "EEG and fMRI Artifact Detection Techniques: A Survey of Recent Developments"}, {"paperId": "8c93b5c969106f87cec6058fc6511d90009be85b", "title": "The influence of Islamic culture on information privacy: case of Malaysia’s computer professionals"}, {"paperId": "1d47e1238817c50d92d850e004fd521e49560df9", "title": "Modeling Decision Making to Control the Allocation of Virtual Machines in a Cloud Computing System with Reserve Machines"}]}
