{"paperId": "db09af9a07629b76e995bfd744c8b4f4c006a4a5", "publicationVenue": {"id": "915442b0-ebd3-4d6f-88d4-4939a6d3a7bc", "name": "Journal of Information and Data Management", "type": "journal", "alternate_names": ["J inf data manag", "J Inf Data Manag", "Journal of information and data management", "JIDM"], "issn": "2178-7107", "alternate_issns": ["2166-6261"], "url": "http://seer.lcc.ufmg.br/index.php/jidm", "alternate_urls": ["https://seer.lcc.ufmg.br/index.php/jidm/index"]}, "title": "Efficient Processing of Analytical Queries Extended with Similarity Search Predicates over Images in Spark", "abstract": "An image data warehousing extends a conventional data warehousing to also manipulate images represented by feature vectors and attributes for similarity search. A challenge that arises is the efficient processing of analytical queries extended with a similarity search predicate. These queries have a high computational cost since they require the processing of costly star join operations and distance calculations in the same setting. We consider applications that manage huge volumes of data, where the use of parallel and distributed data processing frameworks is needed. In this article, we introduce two methods to efficiently solve this challenge in Spark. BrOmnImg is based on the integration of the broadcast join and the Omni techniques for the processing of the star join operation and the distance calculations, respectively. BrOmnImgCF extends BrOmnImg by using the conventional predicate to further reduce the number of distance calculations. Compared with the closest method available in the literature, BrOmnImg reduced the time spent on query processing by up to about 65%. Compared with BrOmnImg, BrOmnImgCF improved the performance by up to about 54%.", "venue": "Journal of Information and Data Management", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-12-30", "journal": {"name": "J. Inf. Data Manag.", "volume": "11"}, "authors": [{"authorId": "1709113", "name": "C. D. Ciferri"}, {"authorId": "51199900", "name": "Guilherme Muzzi da Rocha"}], "citations": [{"paperId": "6c4837b980cee6dbfff7ab0161a6e062e643595f", "title": "Comparing Alternative Storage Models for Words Extracted from Legal Texts"}]}
