{"paperId": "db0b44855b14533a22dbbd09f24f62a08cedef80", "publicationVenue": {"id": "7c9d091e-015e-4e5d-a11f-9bc369fcf414", "name": "IEEE Transactions on Parallel and Distributed Systems", "type": "journal", "alternate_names": ["IEEE Trans Parallel Distrib Syst"], "issn": "1045-9219", "url": "http://www.computer.org/tpds", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=71"]}, "title": "Practice of Streaming Processing of Dynamic Graphs: Concepts, Models, and Systems", "abstract": "Graph processing has become an important part of various areas of computing, including machine learning, medical applications, social network analysis, computational sciences, and others. A growing amount of the associated graph processing workloads are dynamic, with millions of edges added or removed per second. Graph streaming frameworks are specifically crafted to enable the processing of such highly dynamic workloads. Recent years have seen the development of many such frameworks. However, they differ in their general architectures (with key details such as the support for the concurrent execution of graph updates and queries, or the incorporated graph data organization), the types of updates and workloads allowed, and many others. To facilitate the understanding of this growing field, we provide the first analysis and taxonomy of dynamic and streaming graph processing. We focus on identifying the fundamental system designs and on understanding their support for concurrency, and for different graph updates as well as analytics workloads. We also crystallize the meaning of different concepts associated with streaming graph processing, such as dynamic, temporal, online, and time-evolving graphs, edge-centric processing, models for the maintenance of updates, and graph databases. Moreover, we provide a bridge with the very rich landscape of graph streaming theory by giving a broad overview of recent theoretical related advances, and by discussing which graph streaming models and settings could be helpful in developing more powerful streaming frameworks and designs. We also outline graph streaming workloads and research challenges.", "venue": "IEEE Transactions on Parallel and Distributed Systems", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2019-12-29", "journal": {"name": "IEEE Transactions on Parallel and Distributed Systems", "pages": "1-1", "volume": "PP"}, "authors": [{"authorId": "2919642", "name": "Maciej Besta"}, {"authorId": "2125673249", "name": "Marc Fischer"}, {"authorId": "1993949", "name": "Vasiliki Kalavri"}, {"authorId": "143998907", "name": "Michael Kapralov"}, {"authorId": "1713648", "name": "T. Hoefler"}], "citations": [{"paperId": "d178c42b4b4f1aec8a2e3a229ddcc64581fce1ba", "title": "SoK: The Faults in our Graph Benchmarks"}, {"paperId": "eff9d7ed06f30f121d30ee13802a11f172ef66f4", "title": "Demystifying Chains, Trees, and Graphs of Thoughts"}, {"paperId": "dafca525dfffb5e241f70a2ddecbd074dc6e8dad", "title": "Counting Butterflies in Fully Dynamic Bipartite Graph Streams"}, {"paperId": "a41245be49f9be605b20b97a7272c7f986d26b8b", "title": "HOT: Higher-Order Dynamic Graph Representation Learning with Efficient Transformers"}, {"paperId": "f1c110ab7151765d0589f56e1448bfd830852236", "title": "Maximum Flow on Highly Dynamic Graphs"}, {"paperId": "3779b8210af9f77f39a8240e6e5fba3d765c60ac", "title": "DGAP: Efficient Dynamic Graph Analysis on Persistent Memory"}, {"paperId": "57cabc410d3316ef7606dfacecd3472fa6ce994a", "title": "A Distributed Algorithm for Identifying Strongly Connected Components on Incremental Graphs"}, {"paperId": "59ec7486cf1c8d8af7e7d1c15e5c5de2a18ee4cb", "title": "A High-Performance Design, Implementation, Deployment, and Evaluation of The Slim Fly Network"}, {"paperId": "2cb253429839576df35839fbc381480444a41aed", "title": "Recent Advances in Multi-Pass Graph Streaming Lower Bounds"}, {"paperId": "aade40af0d85b0b4fe15c97f6222d5c2e4d6d9b3", "title": "Graph of Thoughts: Solving Elaborate Problems with Large Language Models"}, {"paperId": "eff37cddad8e2eb1bf555af6e520b40f8770450c", "title": "Real-Time Graph Building on FPGAs for Machine Learning Trigger Applications in Particle Physics"}, {"paperId": "246590772c8e2cefa75e428e105e2fa31d28c167", "title": "Going with the Flow: Real-Time Max-Flow on Asynchronous Dynamic Graphs"}, {"paperId": "66e43d602cfa2776041e6aa1621a1506c21877de", "title": "Graph Stream Sketch: Summarizing Graph Streams With High Speed and Accuracy"}, {"paperId": "420f8b01e0ddd3c3f4c5620acbd71e26275786b5", "title": "The Graph Database Interface: Scaling Online Transactional and Analytical Graph Workloads to Hundreds of Thousands of Cores"}, {"paperId": "42982b00dc09dd39532e133fcaa9f718f988444d", "title": "G-Bench: Fair Benchmarking to Support Innovations in Streaming Graph Systems"}, {"paperId": "c9df00592f6483fc96161720335c559b6a52596a", "title": "Accurate and Efficient Distributed COVID-19 Spread Prediction based on a Large-Scale Time-Varying People Mobility Graph"}, {"paperId": "27c36cea72db228d5cbc5e112a6a912d838a9cf4", "title": "CommonGraph: Graph Analytics on Evolving Data"}, {"paperId": "0f9ea7127a6c41d87d6f4728fe41a2047fe310e9", "title": "Achieving Sub-second Pairwise Query over Evolving Graphs"}, {"paperId": "1cbbe1a129c0d1f53d8e16ca74238334372507dc", "title": "Neural Graph Databases"}, {"paperId": "7e3b8a70d72a0ba4c7f189991d912822a1f2959d", "title": "ProbGraph: High-Performance and High-Accuracy Graph Mining with Probabilistic Set Representations"}, {"paperId": "0f686fbac7553e29ed8ffa67280fbd57cbdd46b8", "title": "DyGraph: a dynamic graph generator and benchmark suite"}, {"paperId": "8018a561d2ed821cfb4be7ce04993cabf9932c2f", "title": "Parallel and Distributed Graph Neural Networks: An In-Depth Concurrency Analysis"}, {"paperId": "71b429ab86d05a1a78799b56aea8c348b11b8150", "title": "Incremental Graph Computations: Doable and Undoable"}, {"paperId": "21fec3a9f5035d67e0e6818bf4bc39e5090eed24", "title": "Connected Components for Infinite Graph Streams: Theory and Practice"}, {"paperId": "4b1d79bfccb8cce7eb313e4e4ac0a4f102cdafd9", "title": "Parallel Algorithms for Finding Large Cliques in Sparse Graphs"}, {"paperId": "01a4e72627c2967d353c5ac61bd6b45bcfef93d9", "title": "Position paper: bitemporal dynamic graph analytics"}, {"paperId": "0c2d35908e1af4fd3ec48db93333f82d9a09c4de", "title": "Motif Prediction with Graph Neural Networks"}, {"paperId": "6faa80cae754cc3a57dbde127a83d5987104fb7e", "title": "Towards Million-Server Network Simulations on Just a Laptop"}, {"paperId": "5984a0b6957b0e9ed8b030c3784f3ec367fbfd8c", "title": "SISA: Set-Centric Instruction Set Architecture for Graph Mining on Processing-in-Memory Systems"}, {"paperId": "6957a14503962507e54ba81f6de389c1d4f3efc6", "title": "GraphMineSuite: Enabling High-Performance and Programmable Graph Mining Algorithms with Set Algebra"}, {"paperId": "707bbb88b98d57ee9b0abb37032d7ac52ecae80e", "title": "SeBS: a serverless benchmark suite for function-as-a-service computing"}, {"paperId": "689c7a86d973895a14feb984b8faa3d5581038ef", "title": "Demystifying Graph Databases: Analysis and Taxonomy of Data Organization, System Designs, and Graph Queries"}, {"paperId": "f8f66427dd7ee35eb0c5ab0802aa86457ee97b9e", "title": "Seraph: Continuous Queries on Property Graph Streams"}, {"paperId": "cc9f2390f52965c80fe56f10a1497bc558295bff", "title": "Aion: Efficient Temporal Graph Data Management"}, {"paperId": "d9a69324902294e297c5ba366b0658cf5b17921c", "title": "High-Performance Graph Databases That Are Portable, Programmable, and Scale to Hundreds of Thousands of Cores"}, {"paperId": "c5f907ac79e12939b020a67b55fda56bcbb1f623", "title": "Management and Processing of Temporal Networks"}, {"paperId": "3ad0362edc16b12d1c4a30fec437c673a0eabc81", "title": "A Fast Data Structure for Dynamic Graphs Based on Hash-Indexed Adjacency Blocks"}, {"paperId": "7bd7a3872ff27ee79c03b70fa1005c0eb7941ef9", "title": "MAGMA: Proposing a Massive Historical Graph Management System"}, {"paperId": "6d6b1efed8f80df0727eeafde549308a0921ddb0", "title": "Seraph: Continuous Queries on Property Graph Streams"}]}
