{"paperId": "db23ac2c318b1ae1ec6be149f677441b0b1a9c8c", "publicationVenue": null, "title": "Batch Label Inference and Replacement Attacks in Black-Boxed Vertical Federated Learning", "abstract": "In a vertical federated learning (VFL) scenario where features and model are split into different parties, communications of sample-specific updates are required for correct gradient calculations but can be used to deduce important sample-level label information. An immediate defense strategy is to protect sample-level messages communicated with Homomorphic Encryption (HE), and in this way only the batch-averaged local gradients are exposed to each party (termed black-boxed VFL). In this paper, we first explore the possibility of recovering labels in the vertical federated learning setting with HE-protected communication, and show that private labels can be reconstructed with high accuracy by training a gradient inversion model. Furthermore, we show that label replacement backdoor attacks can be conducted in black-boxed VFL by directly replacing encrypted communicated messages (termed gradient-replacement attack). As it is a common presumption that batch-averaged information is safe to share, batch label inference and replacement attacks are a severe challenge to VFL. To defend against batch label inference attack, we further evaluate several defense strategies, including confusional autoencoder (CoAE), a technique we proposed based on autoencoder and entropy regularization. We demonstrate that label inference and replacement attacks can be successfully blocked by this technique without hurting as much main task accuracy as compared to existing methods.", "venue": "", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-12-10", "journal": null, "authors": [{"authorId": "1614034792", "name": "Yang Liu"}, {"authorId": "2044519039", "name": "Tianyuan Zou"}, {"authorId": "1505828520", "name": "Yan Kang"}, {"authorId": "2109273020", "name": "Wenhan Liu"}, {"authorId": "2145050945", "name": "Yuanqin He"}, {"authorId": "2026585451", "name": "Zhi-qian Yi"}, {"authorId": "2047496843", "name": "Qian Yang"}], "citations": [{"paperId": "a424e91e5127445cc7cd7cc0998395a6528890aa", "title": "A Survey of Privacy Threats and Defense in Vertical Federated Learning: From Model Life Cycle Perspective"}, {"paperId": "48cbee6c86a5362294d05dc0c7691b2088d40513", "title": "A GAN-based data poisoning framework against anomaly detection in vertical federated learning"}, {"paperId": "4bcee00956e03c066291a50415f19194b77b6c01", "title": "Preserving data privacy in machine learning systems"}, {"paperId": "2b1ab5326f39f26a05ab433b30434276bc04f2d0", "title": "SecureBoost Hyperparameter Tuning via Multi-Objective Federated Learning"}, {"paperId": "96e5d8856b8df1d2d18f14da0f99b0f9a6a29d0b", "title": "Coded Parallelism for Distributed Deep Learning"}, {"paperId": "a87af8ec4686bd8fb9594271c3348a8a6ba57aa9", "title": "A Survey on Vertical Federated Learning: From a Layered Perspective"}, {"paperId": "d822aafc2c53eb6c79ebe9a27c21ed0c30cec8c3", "title": "Backdoor Attacks and Defenses in Federated Learning: Survey, Challenges and Future Research Directions"}, {"paperId": "88058305a4a9a9469dc56498482cba1e3208690e", "title": "HashVFL: Defending Against Data Reconstruction Attacks in Vertical Federated Learning"}, {"paperId": "52050fc14b3c3257690b3d1ee1284c91068c6d24", "title": "Hijack Vertical Federated Learning Models As One Party"}, {"paperId": "548fe402a72c7baa815cca28c538b4fdd12fd47e", "title": "Feature Reconstruction Attacks and Countermeasures of DNN training in Vertical Federated Learning"}, {"paperId": "e467ad57b7872a48b5210af756f5260dad8a5ab4", "title": "A Survey on Heterogeneous Federated Learning"}]}
