{"paperId": "db2e80b6f4971a3a6da2cd811a7377ce340f97f4", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "A Real-Time Streaming System for Customized Network Traffic Capture", "abstract": "Logging network traffic offers valuable insights into data flow, enabling the proactive analysis and troubleshooting of issues as they arise. Moreover, it provides a means to access and examine the exchanged information among network users that would otherwise be inaccessible. To enhance network traffic analysis, the integration of innovative technologies that facilitate real-time querying and pattern matching proves indispensable. This research paper presents a system that exemplifies such advancements—an innovative network traffic logging tool. The tool specifically focuses on performing real-time network packet transfer to Apache Kafka and ksqlDB, leveraging their capabilities to ensure swift and dependable storage of network packets in Apache Kafka topics. By showcasing this solution, the paper demonstrates the benefits and effectiveness of employing modern technologies for network traffic analysis and management.", "venue": "Italian National Conference on Sensors", "year": 2023, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-07-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "23"}, "authors": [{"authorId": "2145566282", "name": "Adrian-Tiberiu Costin"}, {"authorId": "30536156", "name": "Daniel Zinca"}, {"authorId": "1680160", "name": "V. Dobrota"}], "citations": [{"paperId": "372467ec595f6f7c08105d98c6163904c2846693", "title": "The intersection of Artificial Intelligence and cybersecurity: Challenges and opportunities"}, {"paperId": "2fee3ecb287939da421fd0ce7182291c40c17aad", "title": "Remote Packet Monitoring: Real-Time Network Analysis from Anywhere"}, {"paperId": "f7e683bffe25056cf86e849d362f07bcf7768eae", "title": "Intelligent Design of Urban Traffic Information Management System"}, {"paperId": "36a384dd27974239e2162bf589ac1b8c167ad2ff", "title": "Research on Automatic Troubleshooting Method of Power Grid Information System Based on Dependency Analysis"}]}
