{"paperId": "db34ad9d32fcab6774b8fa2812ef609bb2be0440", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "The Potential of Wearable Sensors for Assessing Patient Acuity in Intensive Care Unit (ICU)", "abstract": "Acuity assessments are vital in critical care settings to provide timely interventions and fair resource allocation. Traditional acuity scores rely on manual assessments and documentation of physiological states, which can be time-consuming, intermittent, and difficult to use for healthcare providers. Furthermore, such scores do not incorporate granular information such as patients' mobility level, which can indicate recovery or deterioration in the ICU. We hypothesized that existing acuity scores could be potentially improved by employing Artificial Intelligence (AI) techniques in conjunction with Electronic Health Records (EHR) and wearable sensor data. In this study, we evaluated the impact of integrating mobility data collected from wrist-worn accelerometers with clinical data obtained from EHR for developing an AI-driven acuity assessment score. Accelerometry data were collected from 86 patients wearing accelerometers on their wrists in an academic hospital setting. The data was analyzed using five deep neural network models: VGG, ResNet, MobileNet, SqueezeNet, and a custom Transformer network. These models outperformed a rule-based clinical score (SOFA= Sequential Organ Failure Assessment) used as a baseline, particularly regarding the precision, sensitivity, and F1 score. The results showed that while a model relying solely on accelerometer data achieved limited performance (AUC 0.50, Precision 0.61, and F1-score 0.68), including demographic information with the accelerometer data led to a notable enhancement in performance (AUC 0.69, Precision 0.75, and F1-score 0.67). This work shows that the combination of mobility and patient information can successfully differentiate between stable and unstable states in critically ill patients.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science", "Engineering"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-11-03", "journal": {"name": "ArXiv", "volume": "abs/2311.02251"}, "authors": [{"authorId": "90988618", "name": "Jessica Sena"}, {"authorId": "35528303", "name": "MD Tahsin Mostafiz"}, {"authorId": "2262004113", "name": "Jiaqing Zhang"}, {"authorId": "2190753243", "name": "Andrea Davidson"}, {"authorId": "4872398", "name": "S. Bandyopadhyay"}, {"authorId": "1982722", "name": "Yuanfang Ren"}, {"authorId": "1390018896", "name": "T. Ozrazgat-Baslanti"}, {"authorId": "3383528", "name": "B. Shickel"}, {"authorId": "2265490978", "name": "Tyler J. Loftus"}, {"authorId": "2265490760", "name": "William Robson Schwartz"}, {"authorId": "5484714", "name": "A. Bihorac"}, {"authorId": "2067149174", "name": "Parisa Rashidi"}], "citations": []}
