{"paperId": "db3e5a4f84e9cbb4cafc8fb90ce8cb2a03dfb740", "publicationVenue": {"id": "f081cc05-b9f3-4d2d-98b1-8a9b1506a36c", "name": "Connection science", "type": "journal", "alternate_names": ["Connect Sci", "Connection Science", "Connect sci"], "issn": "0954-0091", "url": "http://www.tandfonline.com/loi/ccos20", "alternate_urls": ["http://www.tandfonline.com/toc/ccos20/current"]}, "title": "A real-world service mashup platform based on data integration, information synthesis, and knowledge fusion", "abstract": "ABSTRACT Service-oriented architecture (SOA) provides a flexible IT infrastructure in order to deal with global competition. However, real-world services change their architectures and functions frequently. This work uses data integration, information synthesis, and knowledge fusion to analyze SOA evolution and complexity. A quantificational approach is provided to estimate the change effects on a service-oriented system. We established a cloud service community to provide rich cloud services and a service mashup platform that connects API service providers and service users. The platform user can invoke all API services on the platform without jumping to the third-party website. The platform users can filter and accept the services recommended by the platform, and also freely compose the services which are real-world services. Data integration, information synthesis, and knowledge fusion are applied to mashups that users constructed, helping users avoid complexity and unreliability that is our objective. We also showed that our method achieved significant quantitative results.", "venue": "Connection science", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-11-23", "journal": {"name": "Connection Science", "pages": "463 - 481", "volume": "33"}, "authors": [{"authorId": "2112532371", "name": "Lei Yu"}, {"authorId": "145963973", "name": "Yucong Duan"}, {"authorId": "69486668", "name": "Kuan-Ching Li"}], "citations": [{"paperId": "5f54a2b84b9c875dbd9ef9b7dd3c7b4740fc619a", "title": "On routing algorithms in the internet of vehicles: a survey"}, {"paperId": "c82591db7bed841334e79e355ba4a0433a9f56cc", "title": "Research on the Construction of a Multimodal Cognitive Graph of Textile and Clothing"}, {"paperId": "e0597f7acc26af232f017dcffef57689bdef770c", "title": "Neighbor interaction-based personalised transfer for cross-domain recommendation"}, {"paperId": "bfbcc8f5b37be33cfbbac035b6bf56f307447c60", "title": "Recommending third-party APIs via using lightweight graph convolutional neural networks"}, {"paperId": "c8a7ab81cc253761db01d9e8039310891f1e6970", "title": "A survey on deep learning approaches for data integration in autonomous driving system"}, {"paperId": "797bd7ff02c347b3bc7ec19bee48d2571d5ebe22", "title": "Evaluating performance variations cross cloud data centres using multiview comparative workload traces analysis"}, {"paperId": "2e39603ca5e12a11c5fc530543e2058d61c8bf89", "title": "WTL-CNN: a news text classification method of convolutional neural network based on weighted word embedding"}, {"paperId": "8bbb026e85b90c4c6e92ea5d8aa2ad3964d3326a", "title": "Dependable workflow management system for smart farms"}, {"paperId": "cfa15701c7db29da6db825836a09a09a57a7fb4f", "title": "Collaborative filtering recommendation using fusing criteria against shilling attacks"}, {"paperId": "aa0c6f4bbcf884b6570dbcd4a11423726e6e1a9f", "title": "A Data Mining-Based Evaluation Technique for Music Teaching"}, {"paperId": "43ea5a93c3779b7f66a9c99ad0c44d57d2cc9759", "title": "Platform Firm’s IT Capabilities, External Informal Knowledge Governance, and Green Knowledge Integration in Low-Carbon Economy"}, {"paperId": "1a093d5f061e501c1203987b200a705e14b63d95", "title": "ASM-VoFDehaze: a real-time defogging method of zinc froth image"}, {"paperId": "94075ab67b22889308807733a1dc36a11c361b12", "title": "A pricing model for subscriptions in data transactions"}, {"paperId": "9ca75c9ed64704538b4d989c3007e106e4af150c", "title": "SysML-based compositional verification and safety analysis for safety-critical cyber-physical systems"}, {"paperId": "801b4c4602f4eaf0ba4facd1b52386814cddffad", "title": "Sentiment classification of Chinese Weibo based on extended sentiment dictionary and organisational structure of comments"}, {"paperId": "2becfa0f1f61441e2ba5dd0721cfc44ad5ffdfd0", "title": "Blockchain for federated learning toward secure distributed machine learning systems: a systemic survey"}, {"paperId": "98cdc430f79b2c2039243046f20b0cb42afc5819", "title": "Personalised context-aware re-ranking in recommender system"}, {"paperId": "807053726b73c4e5f9494e3ba6831d92ef39eb45", "title": "Discovery of effective infrequent sequences based on maximum probability path"}, {"paperId": "f8b654084cf8f2e15054e6b2812724122256caef", "title": "Composition pattern-aware web service recommendation based on depth factorisation machine"}, {"paperId": "1304920ecfaf22ba76cba71b600540721a8e13c5", "title": "An efficient and DoS-resilient name lookup for NDN interest forwarding"}]}
