{"paperId": "db44c1ae028d29df6c8cd331b7b804672fe23119", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "LPC-AD: Fast and Accurate Multivariate Time Series Anomaly Detection via Latent Predictive Coding", "abstract": "This paper proposes LPC-AD, a fast and accurate multivariate time series (MTS) anomaly detection method. LPC-AD is motivated by the ever-increasing needs for fast and accurate MTS anomaly detection methods to support fast troubleshooting in cloud computing, micro-service systems, etc. LPC-AD is fast in the sense that its reduces the training time by as high as 38.2% compared to the state-of-the-art (SOTA) deep learning methods that focus on training speed. LPC-AD is accurate in the sense that it improves the detection accuracy by as high as 18.9% compared to SOTA sophisticated deep learning methods that focus on enhancing detection accuracy. Methodologically, LPC-AD contributes a generic architecture LPC-Reconstruct for one to attain different trade-offs between training speed and detection accuracy. More specifically, LPC-Reconstruct is built on ideas from autoencoder for reducing redundancy in time series, latent predictive coding for capturing temporal dependence in MTS, and randomized perturbation for avoiding overfitting of anomalous dependence in the training data. We present simple instantiations of LPC-Reconstruct to attain fast training speed, where we propose a simple randomized perturbation method. The superior performance of LPC-AD over SOTA methods is validated by extensive experiments on four large real-world datasets. Experiment results also show the necessity and benefit of each component of the LPC-Reconstruct architecture and that LPC-AD is robust to hyper parameters.", "venue": "arXiv.org", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-05-05", "journal": {"name": "ArXiv", "volume": "abs/2205.08362"}, "authors": [{"authorId": "2072540228", "name": "Zhi Qi"}, {"authorId": "145497649", "name": "Hong Xie"}, {"authorId": "50025318", "name": "Ye Li"}, {"authorId": "2115409231", "name": "Jian Tan"}, {"authorId": "1442059955", "name": "Feifei Li"}, {"authorId": "145462046", "name": "John C.S. Lui"}], "citations": [{"paperId": "b2fff7be6006284811ba24fab3a2106fa9e1cbbd", "title": "Graph Attention Network and Informer for Multivariate Time Series Anomaly Detection"}]}
