{"paperId": "db4752eb75f948e23a7666bcaee3975c402f5789", "publicationVenue": {"id": "228761ec-c40a-479b-8309-9dcbe9851bcd", "name": "IEEE Internet of Things Journal", "type": "journal", "alternate_names": ["IEEE Internet Thing J"], "issn": "2327-4662", "url": "https://www.ieee.org/membership-catalog/productdetail/showProductDetailPage.html?product=PER288-ELE", "alternate_urls": ["https://ieeexplore.ieee.org/servlet/opac?punumber=6488907", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6488907", "http://ieee-iotj.org/#"]}, "title": "Federated Learning for Healthcare Applications", "abstract": "Due to the fast advancement of artificial intelligence (AI), centralized-based models have become critical for healthcare tasks like in medical image analysis and human behavior recognition. Although these models exhibit suitable performance, they are frequently constrained by privacy concerns. To attenuate this, a centralized learning strategy cannot be used in cases where there is a risk of data privacy breach, particularly in healthcare centers. Federated learning (FL) is a technique that allows for training a global model without sharing data by training distributed local models and aggregating them. By implementing FL throughout the training process, we can obtain a model with comparable generalization abilities to centralized learning while maintaining data privacy. This survey provides an introduction to the fundamental concepts and categories of FL, highlights the limitations of the centralized healthcare model, and discusses how FL can address these constraints. We also provide a detailed overview of the healthcare applications using FL models, along with commonly used evaluation metrics and public data sets. In this context, we have implemented a case study to demonstrate how FL can be applied in the healthcare field. Furthermore, we outline the key challenges and future trends in FL.", "venue": "IEEE Internet of Things Journal", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2024-03-01", "journal": {"name": "IEEE Internet of Things Journal", "pages": "7339-7358", "volume": "11"}, "authors": [{"authorId": "2075078", "name": "A. Chaddad"}, {"authorId": "2260821946", "name": "Yihang Wu"}, {"authorId": "2268844765", "name": "Christian Desrosiers"}], "citations": [{"paperId": "798c7120307f49fe80fea07fdb0332e3344d95bb", "title": "A Practical Simulation for Domain Adaptation Models"}, {"paperId": "2cd8deddf7a1d1fb2aeb7b3e44a2c8022e23d60f", "title": "Potential of Federated Learning in Healthcare"}, {"paperId": "b60f779eef50e6d5152d2c77784659a7fb71a838", "title": "ChatGPT: An Artificial Intelligence-Based Approach to Enhance Medical Applications"}, {"paperId": "60553ad587370d9a374910fda4927a242e814a54", "title": "Medical Metaverse: A New Virtual Health Experience"}]}
