{"paperId": "db556a8711d1cf4cd502b3e3683965a299366962", "publicationVenue": {"id": "4293c8e8-8cd7-4be6-b8b2-69f2b4fa3259", "name": "Computer Applications in Engineering Education", "type": "journal", "alternate_names": ["Comput Appl Eng Educ"], "issn": "1061-3773", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/38664", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/10990542", "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1099-0542"]}, "title": "Online course recommendation algorithm based on multilevel fusion of user features and item features", "abstract": "To meet the demand for accurate recommendation and personalized learning in online education, an online course recommendation algorithm with multilevel fusion of user features and item features is proposed for content‐based recommendation systems applied to online education courses that have weak generalization ability and cannot cope well with data sparsity. The algorithm is improved on the deep learning recommendation algorithm named Wide & Deep Learning (WDL), which is a CTR (Click‐through rate prediction) prediction algorithm. MMF (Multi‐level Fusion Feature) uses collaborative filtering to replace linear methods in the wide part of WDL, introduces feature interactions to model user representations and item representations separately, and uses ResNet (Residual Network) ideas to improve deep neural network (DNN) in the deep part to reduce the performance degradation caused by overfitting. The experimental validation was conducted on the online education data set and the public data set MovieLens‐1M, and the AUC was improved by 1.21% and 1.46%, respectively. Meanwhile, the effect brought by this improved algorithm is interpretable.", "venue": "Computer Applications in Engineering Education", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-12-10", "journal": {"name": "Computer Applications in Engineering Education", "pages": "469 - 479", "volume": "31"}, "authors": [{"authorId": "47196186", "name": "Zhenhai Wang"}, {"authorId": "2205249632", "name": "Zhiru Wang"}, {"authorId": "2195205342", "name": "Yuhao Xu"}, {"authorId": "2189590384", "name": "Xing Wang"}, {"authorId": "1471697285", "name": "Hongyu Tian"}], "citations": [{"paperId": "0a642ac0c17ed8e6880476248967bf344d493afc", "title": "Robust enhanced collaborative filtering without explicit noise filtering"}, {"paperId": "c9ba7139077bb4838f6402bc09dd74a8cb028f38", "title": "A novel cascaded multi-task method for crop prescription recommendation based on electronic medical record"}, {"paperId": "f54faf827b5ccd529bd602659f607db6560dfb85", "title": "Adaptive Learning Using Artificial Intelligence in e-Learning: A Literature Review"}]}
