{"paperId": "db5c97a2096eb7b93617e45228179ea3f4e102f8", "publicationVenue": null, "title": "Fuzzy Rule Based- Model for Proficient Heart Disease Prediction in Data Lake", "abstract": "Cardiovascular diseases remain the leading cause of mortality on a global scale. Currently, healthcare organizations are shifting their operational strategies to enhance efficiency and reduce costs. For this transition, the integration of analytics into IT strategy is imperative. Data lakes, which aggregate data from multiple sources and employ analytical models, provide an innovative approach to information management, reporting, and predictive analytics. These models enable the production of advanced analytical insights, the implementation of evidence-based care plans, and the improvement of patient engagement outcomes, thus setting the stage for IoT-based prognostic systems aimed at reducing mortality rates. The present research proposes a comprehensive data analysis for the prognosis of coronary heart disease, a task that poses considerable challenges due to the volume of data across various disciplines and the complexity involved in analyzing, extracting, managing, and configuring data with massive data technologies and tools. To tackle this challenge, a multi-level fuzzy rule generation is suggested for identifying the features used in heart disease prediction. These features are then trained using an optimized recurrent neural network. The features are classified into labeled classes based on the risk assessment of a medical professional, enabling the prediction of the class based on risk. Early diagnosis and treatment are thus facilitated. When benchmarked against traditional systems, the proposed approach demonstrates superior performance, validating its potential for efficient heart disease prediction.", "venue": "Revue d'Intelligence Artificielle", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-31", "journal": {"name": "Revue d'Intelligence Artificielle"}, "authors": [{"authorId": "2244234133", "name": "Dilli Babu Mani"}, {"authorId": "2244377697", "name": "Sambath Munusamy"}], "citations": []}
