{"paperId": "db633d5a36df1155ed877926a371a925d112bbe4", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "A Distributed Stream Processing Middleware Framework for Real-Time Analysis of Heterogeneous Data on Big Data Platform: Case of Environmental Monitoring", "abstract": "In recent years, the application and wide adoption of Internet of Things (IoT)-based technologies have increased the proliferation of monitoring systems, which has consequently exponentially increased the amounts of heterogeneous data generated. Processing and analysing the massive amount of data produced is cumbersome and gradually moving from classical ‘batch’ processing—extract, transform, load (ETL) technique to real-time processing. For instance, in environmental monitoring and management domain, time-series data and historical dataset are crucial for prediction models. However, the environmental monitoring domain still utilises legacy systems, which complicates the real-time analysis of the essential data, integration with big data platforms and reliance on batch processing. Herein, as a solution, a distributed stream processing middleware framework for real-time analysis of heterogeneous environmental monitoring and management data is presented and tested on a cluster using open source technologies in a big data environment. The system ingests datasets from legacy systems and sensor data from heterogeneous automated weather systems irrespective of the data types to Apache Kafka topics using Kafka Connect APIs for processing by the Kafka streaming processing engine. The stream processing engine executes the predictive numerical models and algorithms represented in event processing (EP) languages for real-time analysis of the data streams. To prove the feasibility of the proposed framework, we implemented the system using a case study scenario of drought prediction and forecasting based on the Effective Drought Index (EDI) model. Firstly, we transform the predictive model into a form that could be executed by the streaming engine for real-time computing. Secondly, the model is applied to the ingested data streams and datasets to predict drought through persistent querying of the infinite streams to detect anomalies. As a conclusion of this study, a performance evaluation of the distributed stream processing middleware infrastructure is calculated to determine the real-time effectiveness of the framework.", "venue": "Italian National Conference on Sensors", "year": 2020, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-06-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "20"}, "authors": [{"authorId": "20525056", "name": "Adeyinka K. Akanbi"}, {"authorId": "2530475", "name": "M. Masinde"}], "citations": [{"paperId": "23860a13040892e549ec08d6d00779b0f3f2da32", "title": "A Blockchain-based Model for Securing Data Pipeline in a Heterogeneous Information System"}, {"paperId": "db3d52dc91a3da6e446c78f218f7f6410ca8567a", "title": "Towards a Microservice-based Middleware for a Multi-hazard Early Warning System"}, {"paperId": "ff7dd74c763fbc28b9becd2d7f0f40c1320c8039", "title": "Real-time data integration in information systems using stream processing for medical data"}, {"paperId": "f1c4d6cc1660c28882b021fa603704c0e1599ea1", "title": "An efficient architecture for processing real-time traffic data streams using apache flink"}, {"paperId": "66b81c8f9e7366fd73692a8b976739967df859d2", "title": "A Scalable Semantic Framework for an Integrated Multi-Hazard Early Warning System"}, {"paperId": "bde6a203624a8b8ef731df19f69850d6798ce5a7", "title": "A New Big Data Processing Framework for the Online Roadshow"}, {"paperId": "ea7ed5c0999d06f3cbd7ee7b094716587f87fc26", "title": "Big Data for Real-Time Processing on Streaming Data: State-of-the-art and Future Challenges"}, {"paperId": "cc16cccbcb837ef8c30ed4189db25690d70e4fef", "title": "A comprehensive and systematic literature review on the big data management techniques in the internet of things"}, {"paperId": "78ee85ac29775aefed350a18500ecfb4c5182dd9", "title": "Distributed real-time ETL architecture for unstructured big data"}, {"paperId": "ba0c5d2ebb1c7daa8e58238bc1582e70d8b2fa1d", "title": "Integrating Heterogeneous Stream and Historical Data Sources using SQL"}, {"paperId": "2e40e729f2c212a581028585d85b9bf2f1b31069", "title": "Designing a Real-Time IoT Data Streaming Testbed for Horizontally Scalable Analytical Platforms: Czech Post Case Study"}, {"paperId": "01d1bfac723237a60e484a02ef86503a6a9216aa", "title": "Design of Power Integrated Energy Data Dynamic Visualization System for Integrated Construction"}, {"paperId": "6764b7a23e7bd4b745ce1c7fa24c195cd2e8408a", "title": "Stream and Historical Data Integration using SQL as Standard Language"}, {"paperId": "f165c1d7027b01f8a6afc1f109bd78f500e2d57f", "title": "Time Series Forecasting of Univariate Agrometeorological Data: A Comparative Performance Evaluation via One-Step and Multi-Step Ahead Forecasting Strategies"}, {"paperId": "b17b13fc404690c28c82df7100148361d1a0460f", "title": "ESTemd: A Distributed Processing Framework for Environmental Monitoring based on Apache Kafka Streaming Engine"}, {"paperId": "3658f70360c60039c232f1ee4146007f9a7c2480", "title": "DDR-coin: An Efficient Probabilistic Distributed Trigger Counting Algorithm"}, {"paperId": "ce9bf628c883fa4014c40a66cf920f6cd3bfc7b9", "title": "ISOBlue HD: An Open-Source Platform for Collecting Context-Rich Agricultural Machinery Datasets"}, {"paperId": "207b016cfc5561e0056d3c3f6545a9b728bb7bd7", "title": "Versatile information provisioning in a configure-to-order production environment; a case study"}, {"paperId": "8a53defb56d4fd9a4d616504aaf62c6679cc6580", "title": "Storage Mechanism for Heterogeneous Streamed Sensor Data"}]}
