{"paperId": "db6e92ded67cfb9d29c5f9bf6525af5a7d026e17", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Iss2Image: A Novel Signal-Encoding Technique for CNN-Based Human Activity Recognition", "abstract": "The most significant barrier to success in human activity recognition is extracting and selecting the right features. In traditional methods, the features are chosen by humans, which requires the user to have expert knowledge or to do a large amount of empirical study. Newly developed deep learning technology can automatically extract and select features. Among the various deep learning methods, convolutional neural networks (CNNs) have the advantages of local dependency and scale invariance and are suitable for temporal data such as accelerometer (ACC) signals. In this paper, we propose an efficient human activity recognition method, namely Iss2Image (Inertial sensor signal to Image), a novel encoding technique for transforming an inertial sensor signal into an image with minimum distortion and a CNN model for image-based activity classification. Iss2Image converts real number values from the X, Y, and Z axes into three color channels to precisely infer correlations among successive sensor signal values in three different dimensions. We experimentally evaluated our method using several well-known datasets and our own dataset collected from a smartphone and smartwatch. The proposed method shows higher accuracy than other state-of-the-art approaches on the tested datasets.", "venue": "Italian National Conference on Sensors", "year": 2018, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-11-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "18"}, "authors": [{"authorId": "81492933", "name": "T. Hur"}, {"authorId": "37390258", "name": "J. Bang"}, {"authorId": "1402997421", "name": "Thien Huynh-The"}, {"authorId": "2157183243", "name": "Jongwon Lee"}, {"authorId": "9119464", "name": "Jee-In Kim"}, {"authorId": "31273100", "name": "Sungyoung Lee"}], "citations": [{"paperId": "c76697eeaa501fc41db2fcfab743b6fff447c61b", "title": "Self-attention deep ConvLSTM with sparse-learned channel dependencies for wearable sensor-based human activity recognition"}, {"paperId": "4c4e7fb4fa36b0dcf4cf2751d41dc87a218b3c79", "title": "Footwear-integrated force sensing resistor sensors: A machine learning approach for categorizing lower limb disorders"}, {"paperId": "d4047eddbe0bdb70e2700d3d56f408904aa65207", "title": "Human Activity Recognition Using Ensemble of CNN-Based Transfer Learning Models"}, {"paperId": "612438e70d11466f16e26dcb32ebc274b38a6a4c", "title": "Extension of physical activity recognition with 3D CNN using encrypted multiple sensory data to federated learning based on multi-key homomorphic encryption"}, {"paperId": "b28296c620089532a9dd506cbd928306afbf0313", "title": "Explainable AI for the Metaverse: A Short Survey"}, {"paperId": "18ec8c4d0127b7de67033a26c3a4e93bbf657cae", "title": "A Comparison of Four Neural Networks Algorithms on Locomotion Intention Recognition of Lower Limb Exoskeleton Based on Multi-source Information"}, {"paperId": "eb9aa148b31bac157b40bfbd052c959dd742a5c6", "title": "State Classification in Injection Molding Cycles using Transformation of Acceleration Data into Images"}, {"paperId": "87e7834eb0b862493b4038e9e0f6303daa0e624b", "title": "GeXSe (Generative Explanatory Sensor System): An Interpretable Deep Generative Model for Human Activity Recognition in Smart Spaces"}, {"paperId": "e978b76bd99b7fb22fcd0029c285305b5ff8b5b8", "title": "Predicting Human Activity – State of the Art"}, {"paperId": "e910c534eac90d99395d01f59efb575bb2745d3d", "title": "Activity recognition of stroke‐affected people using wearable sensor"}, {"paperId": "e47b471a909781f82c09401cf70d81da6f983029", "title": "Merging-Squeeze-Excitation Feature Fusion for Human Activity Recognition Using Wearable Sensors"}, {"paperId": "5dd48452b38a064607cef775fee7dca61065e3af", "title": "An Improved Deep Learning Approach for Heart Attack Detection from Digital Images"}, {"paperId": "9a402d186261c0b3bfadb5e1f0ddd37c6c5210c4", "title": "Human activity recognition from sensor data using spatial attention-aided CNN with genetic algorithm"}, {"paperId": "9585f07f3f29b095b488439b90d78ea8b7f63a14", "title": "Metaverse for Healthcare: A Survey on Potential Applications, Challenges and Future Directions"}, {"paperId": "e8f1f60bb13ab518758477f0f64b9e7d3326b3de", "title": "IMG2IMU: Translating Knowledge from Large-Scale Images to IMU Sensing Applications"}, {"paperId": "6db2011aa9a05d85cdc68dd986081bd288eb298c", "title": "Intelligent Vibration Analysis of Industrial Cooling Fans"}, {"paperId": "4e5f784655f42408faad1213e336cf1ad92c6232", "title": "Machine Vision-Based Human Action Recognition Using Spatio-Temporal Motion Features (STMF) with Difference Intensity Distance Group Pattern (DIDGP)"}, {"paperId": "abffef84ed7fab102c06f4dbec4a3d5f4c3a3d71", "title": "DeXAR"}, {"paperId": "069b9d84c2d963dbfb3f8c80a7d6800b248b9bf0", "title": "Deep Learning-Based Real-Time Activity Recognition with Multiple Inertial Sensors"}, {"paperId": "e50f67016bbc26e15e3feee2c747dc243db5d313", "title": "Smartphone Sensor-Based Human Locomotion Surveillance System Using Multilayer Perceptron"}, {"paperId": "2da8b14cebc1cfb5b9b13a82ca138814ae58db09", "title": "The Deep Learning-based Human Activity Recognition Using Smart Wearable Sensors : A\n Tutorial"}, {"paperId": "96a35bb48ef7c603ffc6c1e8119bca550fa85dfa", "title": "Artificial Intelligence for the Metaverse: A Survey"}, {"paperId": "27a8f38a11c51e9a40f0932a3967a3c3d029539f", "title": "Human Activity Recognition via Hybrid Deep Learning Based Model"}, {"paperId": "7a608dc98098994fa584c36282aa2da74bdbf5be", "title": "Predicting Human Motion Signals Using Modern Deep Learning Techniques and Smartphone Sensors"}, {"paperId": "990be11df3e31eff2875661cee62482921274ded", "title": "Meta-learning meets the Internet of Things: Graph prototypical models for sensor-based human activity recognition"}, {"paperId": "9d8e5311c9f2408136d908d8db6bc233a37545ab", "title": "Diagnosis Cerebellar Ataxia using Deep Learning with Time Series Transformed Image"}, {"paperId": "f0c704027efd7ef4113478b55a29a9749713adad", "title": "A systematic review of smartphone-based human activity recognition methods for health research"}, {"paperId": "98eba9b174b1b760dee342dc5d080b64ce67171c", "title": "Classifying Goliath Grouper (Epinephelus itajara) Behaviors from a Novel, Multi-Sensor Tag"}, {"paperId": "a85bee4e6622d45aefc844e3abb3848361db9033", "title": "Analysis of Body Behavior Characteristics after Sports Training Based on Convolution Neural Network"}, {"paperId": "0cb4f07e953f24c7309a5b79921a8147b9a37ec1", "title": "INIM: Inertial Images Construction with Applications to Activity Recognition"}, {"paperId": "ef5ede4f9ea4be8f756274bfe18865043b231acb", "title": "Heterogeneous Noisy Short Signal Camouflage in Multi-Domain Environment Decision-Making"}, {"paperId": "2c0b5e3b76a61e0f5a4227d12b94dd363c57e1fd", "title": "Is That You Again?: Adaptive Learning Techniques for User Identification in Smart Pill Bottle Systems"}, {"paperId": "a290b68608a269d234cb3f924eea2c3f3dc61cec", "title": "Mutated Specification-Based Test Data Generation with a Genetic Algorithm"}, {"paperId": "320e3a66dbc51a1331f65b5ac42b937a39d5e051", "title": "Physical Activity Recognition With Statistical-Deep Fusion Model Using Multiple Sensory Data for Smart Health"}, {"paperId": "66024c32bf21554ae3e56d0ca5a24c63acab3b34", "title": "Transfer Learning for Human Activity Recognition Using Representational Analysis of Neural Networks"}, {"paperId": "4bea7f2eaf223f999a3fef53f40cb3310507ab25", "title": "Accelerometer-Based Human Activity Recognition for Patient Monitoring Using a Deep Neural Network"}, {"paperId": "b6b0635e3e797aff1b47e8be3a01e8322a49aecd", "title": "Image Transformation and CNNs: A Strategy for Encoding Human Locomotor Intent for Autonomous Wearable Robots"}, {"paperId": "ff6df9d009ecc6bb4c648a258b3437fa9dacc15c", "title": "TSI: Time series to imaging based model for detecting anomalous energy consumption in smart buildings"}, {"paperId": "53f28127c17dd09d71b0e51b1caf8e11fa5bb760", "title": "A Lean and Performant Hierarchical Model for Human Activity Recognition Using Body-Mounted Sensors"}, {"paperId": "23736f80dfae183382b35c75688f690a8d6c41df", "title": "A Smartphone Lightweight Method for Human Activity Recognition Based on Information Theory"}, {"paperId": "4af0ac5c9bbad92f60d2c6f91a1728462c1f4d53", "title": "Monitoring Road Surface Conditions with Cyclist's Smartphone Sensors"}, {"paperId": "1f24638a273cb5f23bd4c45938e056e42202b277", "title": "Adapted Binary Particle Swarm Optimization for Efficient Features Selection in the Case of Imbalanced Sensor Data"}, {"paperId": "495ad23d4a70f5a77bb344d154878f3be2d70b1a", "title": "Heartbeat classification by using a convolutional neural network trained with Walsh functions"}, {"paperId": "08df953cd0a1fc88ac727a6411bb6f0cccda9c14", "title": "Heart Attack Detection in Colour Images Using Convolutional Neural Networks"}, {"paperId": "d259586a295f9deca57019c9ec929d2ed0b11471", "title": "A review of AI Technologies for Wearable Devices"}, {"paperId": "a3afa7a0684d099970413b7757cc4f1501103e40", "title": "A systematic review of human activity recognition using smartphones"}, {"paperId": "32e7b6c91858861ab95c9c082eaa05fec31bdb8a", "title": "An Energy-Efficient Method for Human Activity Recognition with Segment-Level Change Detection and Deep Learning"}, {"paperId": "d56dd3c429253d795528162b160f385492972018", "title": "Visualizing Inertial Data For Wearable Sensor Based Daily Life Activity Recognition Using Convolutional Neural Network*"}, {"paperId": "78973634dc6f8dda15afa1ebee3fc9cccbbbd523", "title": "Technological Evolution in the Instrumentation of Ataxia Severity Measurement"}, {"paperId": "8991e25095228dffca50f285b5dc2c0336ac7f4d", "title": "Industry 4.0-Oriented Deep Learning Models for Human Activity Recognition"}, {"paperId": "ace9ee4cc7de606d67cdd7a7bd643293c4d763b2", "title": "Automatic Modulation Classification: A Deep Architecture Survey"}]}
