{"paperId": "db8cea1af7371a65f6729b2c70e649db40a95d02", "publicationVenue": {"id": "8e1bd4b5-d5b2-4e22-ba0a-01fe5568d472", "name": "Remote Sensing", "type": "journal", "alternate_names": ["Remote Sens"], "issn": "2315-4675", "alternate_issns": ["2072-4292"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169233", "alternate_urls": ["https://www.mdpi.com/journal/remotesensing", "http://www.mdpi.com/journal/remotesensing", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169233"]}, "title": "Robust Antijamming Strategy Design for Frequency-Agile Radar against Main Lobe Jamming", "abstract": "To combat main lobe jamming, preventive measures can be applied to radar in advance based on the concept of active antagonism, and efficient antijamming strategies can be designed through reinforcement learning. However, uncertainties in the radar and the jammer, which will result in a mismatch between the test and training environments, are not considered. Therefore, a robust antijamming strategy design method is proposed in this paper, in which frequency-agile radar and a main lobe jammer are considered. This problem is first formulated under the framework of Wasserstein robust reinforcement learning. Then, the method of imitation learning-based jamming strategy parameterization is presented to express the given jamming strategy mathematically. To reduce the number of parameters that require optimization, a perturbation method inspired by NoisyNet is also proposed. Finally, robust antijamming strategies are designed by incorporating jamming strategy parameterization and jamming strategy perturbation into Wasserstein robust reinforcement learning. The simulation results show that the robust antijamming strategy leads to improved radar performance compared with the nonrobust antijamming strategy when uncertainties exist in the radar and the jammer.", "venue": "Remote Sensing", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-08-03", "journal": {"name": "Remote. Sens.", "pages": "3043", "volume": "13"}, "authors": [{"authorId": "2107514795", "name": "Kang Li"}, {"authorId": "1765653", "name": "B. Jiu"}, {"authorId": "1725627", "name": "Hongwei Liu"}, {"authorId": "3492460", "name": "Wenqiang Pu"}], "citations": [{"paperId": "7c5fa0dd38adf94de97121125580cde079132d40", "title": "Cooperative Waveforms Design for Distributed Sites in Multiple Blanket Jamming"}, {"paperId": "ca7b49dabe8ced3bc169831b1b4bf44ef59c8f22", "title": "A Cognitive Multi-Carrier Radar for Communication Interference Avoidance via Deep Reinforcement Learning"}, {"paperId": "3e0c35a50c6da8bff7648fd2b8733ca96611017e", "title": "Radar Anti-Jamming Decision-Making Method Based on DDPG-MADDPG Algorithm"}, {"paperId": "c41a7d2bea69890642d9a866a55cef0275a5f62f", "title": "A radar anti‐jamming strategy optimisation based on Stackelberg game"}, {"paperId": "8eb79fb78b9b4d01b01f5c6c26aab4e96505da96", "title": "An intermittent sampling and forwarding interference suppression method based on intra-pulse frequency-time-delay agile waveform"}, {"paperId": "7b498bc6450feda7f98723dd7a1701344c0e193e", "title": "Radar and Jammer Intelligent Game under Jamming Power Dynamic Allocation"}, {"paperId": "d7d1c34b1c70c52f942f4681656c3f406e0215ed", "title": "A cognitive frequency allocation strategy for multi-carrier radar against communication interference"}, {"paperId": "cd85d743129d60659126669f7ac542e6ae9704e4", "title": "Online Sequential Extreme Learning Machine-Based Active Interference Activity Prediction for Cognitive Radar"}, {"paperId": "492b7ee5e07ad50a79fb70272e33c2c1e2269713", "title": "Counterfactual Regret Minimization for Anti-Jamming Game of Frequency Agile Radar"}, {"paperId": "7874c06bd79fd60d8171ea0359539998ef3d2c82", "title": "Reinforcement Learning for Compressed-Sensing Based Frequency Agile Radar in the Presence of Active Interference"}, {"paperId": "dab3519742deea5177b947839d534ff6213e9946", "title": "Jamming Strategy Optimization through Dual Q-Learning Model against Adaptive Radar"}, {"paperId": "de7ba78d2157f569d07f3e1cbaa77b1904bb66ac", "title": "Multiagent Reinforcement Learning for Antijamming Game of Frequency-Agile Radar"}]}
