{"paperId": "db8d46db9c9d08a677c2bae5260dade9458bc81c", "publicationVenue": {"id": "2135230a-3b24-4b71-9583-60624389377a", "name": "IEEE Transactions on Industrial Informatics", "type": "journal", "alternate_names": ["IEEE Trans Ind Informatics"], "issn": "1551-3203", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=9424", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=9424"]}, "title": "AttractRank: District Attraction Ranking Analysis Based on Taxi Big Data", "abstract": "The city's district attraction ranking plays an essential role in the city's government because it can be used to reveal the city's district attraction and, thus, help government make decisions for urban planning in terms of the smart city. The traditional methods for urban planning mainly rely on the district's GDP, employment rate, population density, information from questionnaire surveys, and so on. However, as a comparison, such information is becoming relatively less informative as the explosion of an increasing amount of urban data. What is more, there is a serious shortcoming in these methods, i.e., they are independent representations of the attraction of a district and do not take into account the interaction among districts. With the development of urban computing, it is possible to make good use of urban data for urban planning. To this end, based on taxi big data obtained from Guangzhou, China, this article proposes a district attraction ranking approach called AttractRank, which for the first time uses taxi big data for district ranking. An application system is developed for demonstration purposes. First, the entire Guangzhou city is divided into a number of districts by using constrained K-means. Second, the original PageRank algorithm is extended to integrate with the taxi's origin–destination ($OD$) points to establish the $OD$ matrix, whereby the attraction ranking of each district can be calculated. Finally, by visualizing the results and case studies obtained from AttractRank, we can successfully obtain the pattern of how attractions of districts change over time and interesting discoveries on urban lives; therefore, it has wide applications in urban planning and urban data mining.", "venue": "IEEE Transactions on Industrial Informatics", "year": 2021, "fieldsOfStudy": ["Geography", "Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-03-01", "journal": {"name": "IEEE Transactions on Industrial Informatics", "pages": "1679-1688", "volume": "17"}, "authors": [{"authorId": "1955789", "name": "Guangqiang Xie"}, {"authorId": "102593526", "name": "Runpeng Zhang"}, {"authorId": "98177814", "name": "Y. Li"}, {"authorId": "153562925", "name": "Ling Huang"}, {"authorId": "1825101", "name": "Changdong Wang"}, {"authorId": "102320235", "name": "Hao Yang"}, {"authorId": null, "name": "Jiahao Liang"}], "citations": [{"paperId": "7ce4802e223fddb6da94d2caaa2447510cb8ce27", "title": "Analysis of Spatiotemporal Changes in the Gravitational Structure of Urban Agglomerations in Northern and Southern Xinjiang Based on a Gravitational Model"}, {"paperId": "af072fd5f0ac5ead053dca4fbc1a2d76c011cda5", "title": "PageRank centrality with non-local random walk-based teleportation"}, {"paperId": "17775d8a56f5fc5a191a217c2a0c6afeb4508414", "title": "Application of improved Moran’s I in the evaluation of urban spatial development"}, {"paperId": "c8d9863baaf79462861434c678125fbf3f0db0c3", "title": "A big data szerepe a városi mobilitás kutatásában és fejlesztésében"}, {"paperId": "fa12f20d154ecb2a05f32c242fd8a7a4c4fbad25", "title": "Influence ranking of road segments in urban road traffic networks"}]}
