{"paperId": "db8d9c94c50258eaf72e810cbc43fe8a851cb4f0", "publicationVenue": {"id": "acdf09ed-68cc-4c8a-b2ab-3c6c4873cc9e", "name": "Therapeutic Advances in Gastroenterology", "type": "journal", "alternate_names": ["Ther Adv Gastroenterol"], "issn": "1756-283X", "url": "https://journals.sagepub.com/home/tag", "alternate_urls": ["http://tag.sagepub.com/"]}, "title": "Ustekinumab is associated with superior treatment persistence but not with higher remission rates versus vedolizumab in patients with refractory Crohn’s disease: results from a multicentre cohort study", "abstract": "Background: Treatment with antitumor necrosis factor alpha (anti-TNF-α) is safe and effective as first-line therapy; however, its efficacy is limited due to primary nonresponse (PNR) and secondary loss of response (LOR), resulting in treatment discontinuation in approximately 40%–50% of cases. Vedolizumab (VDZ) and ustekinumab (UST) therapies could be good alternatives in patient with anti-TNF failure; however, no head-to-head randomized comparison of these drugs as second- or third-line treatments has been made. Objectives: This study aimed to assess the treatment persistence and comparative effectiveness of UST and VDZ in patients with refractory Crohn’s disease (CD). Design: In this nationwide retrospective study, patients with CD on UST or VDZ maintenance therapy were enrolled. Clinical data at baseline, after induction, and at week 52 were obtained. Methods: Clinical and biochemical activities as well as corticosteroid-free remission (SFR) rates were assessed, while concomitant medications, comorbidities, hospitalizations, and surgeries were recorded during the follow-up to detect any predictors. Results: A total of 161 UST- and 65 VDZ-treated patients completed the follow-up. No significant difference in clinical or biochemical remission rates was observed after induction between the two treatment groups; however, clinical remission rate at week 52 was higher in UST group. UST showed superior drug persistence than VDZ (86.5%, 57.9%, p < 0.0001). The drug type was predictive of clinical SFR at week 52 [p = 0.011, odds ratio (OR) = 2.39 with UST]. Drug failure rates were higher for VDZ than those for UST (PNR rates: 21.54% and 4.97%, respectively, p < 0.001, OR = 8.267, p = 0.001). LOR and escalations were more common during UST treatment (61.5% versus 36.9%, p < 0.001; 64.2% versus 23.1%, p < 0.001). Hospital and surgical admission rates did not differ significantly. Only one adverse event occurred with VDZ at week 20, which led to drug cessation. Conclusions: VDZ and UST were safe and effective for treating patients with CD in whom anti-TNF therapy failed. UST showed superior drug persistence than VDZ, but dose escalation was more frequent. Biologicals used in lower treatment lines resulted in better drug persistence.", "venue": "Therapeutic Advances in Gastroenterology", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-01-01", "journal": {"name": "Therapeutic Advances in Gastroenterology", "volume": "15"}, "authors": [{"authorId": "147769907", "name": "P. Bacsur"}, {"authorId": "5422368", "name": "M. Matuz"}, {"authorId": "1742272385", "name": "T. Resál"}, {"authorId": "5647280", "name": "P. Miheller"}, {"authorId": "6847030", "name": "T. Szamosi"}, {"authorId": "49473998", "name": "E. Schäfer"}, {"authorId": "49806767", "name": "P. Sarlós"}, {"authorId": "32551826", "name": "Á. Iliás"}, {"authorId": "31769468", "name": "K. Szántó"}, {"authorId": "4102664", "name": "M. Rutka"}, {"authorId": "37461822", "name": "A. Bálint"}, {"authorId": "65834127", "name": "Á. Milassin"}, {"authorId": "145146520", "name": "A. Fábián"}, {"authorId": "145353106", "name": "R. Bor"}, {"authorId": "6064752", "name": "Z. Szepes"}, {"authorId": "145468169", "name": "T. Molnár"}, {"authorId": "37949800", "name": "K. Farkas"}], "citations": []}
