{"paperId": "db9116324068cc2218ee28c9e606a63272382ce4", "publicationVenue": {"id": "a00fde74-d8df-4613-b825-0fff9f531d3f", "name": "IEEE Transactions on Network and Service Management", "type": "journal", "alternate_names": ["IEEE Trans Netw Serv Manag"], "issn": "1932-4537", "url": "http://ejournals.ebsco.com/direct.asp?JournalID=714200", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4275028", "http://ieeexplore.ieee.org/servlet/opac?punumber=4275028"]}, "title": "Delay-Sensitive Multi-Source Multicast Resource Optimization in NFV-Enabled Networks: A Column Generation Approach", "abstract": "Telecommunication networks are currently realizing more-huge-than-ever data demands from subscribers all over the world. Due to the ongoing pandemic, nearly all businesses have adapted working models with remote operations. People engaged with major industries, e.g., academia, health and municipalities are utilizing online platforms to carryout their routine tasks. This indeed shifts the attention from one-to-one (unicast) communication to one-to-many (multicast) and many-to-many (multi-source multi-destination) communications. Network operators are facing increased pressure to provide quick responses in order to satisfy the bandwidth hungry and time sensitive user demands. This can only be done by enhancing deployability as well as manageability of the services. Network Function Virtualization (NFV) provides a transformation of traditional proprietary network designs to a more agile and software based environment in order to achieve flexible deployments, reduced setup costs and less-time-to-market for the new services which is very much needed in the current scenarios. Previous studies on NFV-enabled multicast problem either proposed Integer Linear Program (ILP) models, that are pretty unscalable, or heuristic-based techniques that do not guarantee good quality of the solutions obtained. In this article, we propose an NFV multicast resource optimization model exploiting the use of multiple sources and considering the end-to-end delay and bandwidth requirements. Herein, we propose a novel Dantzig-Wolfe (DW) decomposition model that tackles the complexity of the problem by breaking it down into a master problem and several pricing problems. We compare the DW approach with the ILP and heuristic methods and demonstrate that our approach achieves near to optimal solution (in comparison to heuristic based methods) much faster than ILP. We also study the dynamic admission of NFV-enabled multicast requests by solving the problem in an online manner using the batch processing of requests. We then evaluate the performance of the proposed algorithms through extensive simulations and demonstrate that proposed algorithms are promising and outperform existing solutions.", "venue": "IEEE Transactions on Network and Service Management", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-03-01", "journal": {"name": "IEEE Transactions on Network and Service Management", "pages": "286-300", "volume": "18"}, "authors": [{"authorId": "144477344", "name": "Ali Muhammad"}, {"authorId": "2647399", "name": "Ibrahim Sorkhoh"}, {"authorId": "3251076", "name": "Long Qu"}, {"authorId": "1780298", "name": "C. Assi"}], "citations": [{"paperId": "4913e428f8021741c97f03b86dd857e4453bff36", "title": "Multi-source multicast service chaining model guaranteeing reliability of network services"}, {"paperId": "8a2235e01d5ccf3a5bd9d9a30ed2212faa01f826", "title": "Multicast Service Function Chain Orchestration in SDN/NFV-Enabled Networks: Embedding, Readjustment, and Expanding"}, {"paperId": "77c84bf15c01bedc79b867d27b5220cb97e3ad00", "title": "Partial and Adaptive Light-Trail Sharing in Multi-Source Multicast Optical Networks"}, {"paperId": "932afbb34a2659e0bde749ed5250462d7a06b8f9", "title": "Maximize multicast transmission throughput for multi-distributed model training tasks"}, {"paperId": "e31f5e43c3409a95e5390f8324c7af36cf51321e", "title": "Multicast Service Chaining Model Guaranteeing Reliability with Multiple Sources"}, {"paperId": "580b8a419af5efeaf83420fa52ffc727086cb5d2", "title": "Quality of Things' Experience for 6G Artificial Intelligent Internet of Things with IEEE P2668"}, {"paperId": "827f3c2f07265989db437c8130d2511454c0d957", "title": "Edge-cloud online joint placement of Virtual Network Functions and allocation of compute and network resources using meta-heuristics"}, {"paperId": "154d1462a87aec6edfe600d70de2251f23020766", "title": "SAP: Subchain-Aware NFV Service Placement in Mobile Edge Cloud"}, {"paperId": "f8f40b9c14da83bccc1baeb903e6f8b5313391fa", "title": "On Efficient Delay-Aware Multisource Multicasting in NFV-Enabled Softwarized Networks"}, {"paperId": "c7ecdfe9b432ab8e7b17cf050922ae6b51729230", "title": "End-to-end delay guaranteed Service Function Chain deployment: A multi-level mapping approach"}, {"paperId": "108e039b3b483d6a639599a7eb047fc9646f9cc6", "title": "An Efficient Delay Tolerance and Cost-Effective Secure NFV Enabled Multi-casting in Mobile Edge Cloud Networks"}, {"paperId": "9d0086a2a5131781385017a44d58ad8d0720a0d6", "title": "VAPNIC: A VersAtile shortest path-free VNF Placement using a divide-and-coNquer tactIC"}]}
