{"paperId": "db952dfc548bfd232d6334c38af86788b2cb4062", "publicationVenue": {"id": "9ee7345a-5e9f-4002-9880-d6b27d275524", "name": "Transactions on Emerging Telecommunications Technologies", "type": "journal", "alternate_names": ["European Transactions on Telecommunications", "Eur Trans Telecommun", "TETT", "Trans Emerg Telecommun Technol"], "issn": "1120-3862", "alternate_issns": ["2161-3915", "1124-318X"], "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/104087069", "alternate_urls": ["http://eu.wiley.com/WileyCDA/WileyTitle/productCd-ETT.html", "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1541-8251", "https://onlinelibrary.wiley.com/journal/21613915", "https://onlinelibrary.wiley.com/journal/15418251"]}, "title": "Revenue maximization approaches in IaaS clouds: Research challenges and opportunities", "abstract": "This study critically reviews the IaaS clouds development on revenue maximization since 2012 to answer these research queries; (i) What are the main influential factors towards revenue maximization in the cloud market? (ii) What are the main challenges and resistance towards revenue maximization in cloud computing? and (iii) What are the possible solutions and potentials to these hurdles in cloud computing? The data was analyzed and the influencing factors of revenue maximization were classified into seven distinct categories, that is, the performance of the services, service level agreement and penalties management, resources scalability, resources utilization and scheduling, customers' satisfaction, cost, and pricing management, as well as advertisement and auction. These parameters are investigated in detail and new dynamics for researchers in the field of the cloud are discovered. These studies are compared against each other for the seven distinct categories and solutions are proposed for the clouds' obstacles to revenue maximization. Furthermore, in the light of the findings and revenue maximization categories, the main limitations, challenges, true potential, and new directions towards revenue maximization are explored.", "venue": "Transactions on Emerging Telecommunications Technologies", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2020-04-24", "journal": {"name": "Transactions on Emerging Telecommunications Technologies", "volume": "33"}, "authors": [{"authorId": "152234348", "name": "Afzal Badshah"}, {"authorId": "108327393", "name": "Anwar Ghani"}, {"authorId": "113849544", "name": "A. Daud"}, {"authorId": "1755728", "name": "Anthony T. Chronopoulos"}, {"authorId": "145140853", "name": "Ateeqa Jalal"}], "citations": [{"paperId": "2bcc7845ae844bff5833893774be47f8a0069057", "title": "Orchestrating model to improve utilization of IaaS environment for sustainable revenue"}, {"paperId": "c6314c709b3247e0303cd08aa5f45a918e89096f", "title": "Towards Smart Education through Internet of Things: A Survey"}, {"paperId": "fb827eb6768edc4bd6fc526fa05f93f20598898c", "title": "A Structural Framework for Assessing the Digital Resilience of Enterprises in the Context of the Technological Revolution 4.0"}]}
