{"paperId": "db98690cb9a709d68a3683f3ebc6004f891a1c9c", "publicationVenue": {"id": "159aed30-148b-4b50-99a4-372b0af958d9", "name": "International Symposium on Computers and Communications", "type": "conference", "alternate_names": ["ISCC", "Int Symp Comput Commun"], "url": "https://ieeexplore.ieee.org/xpl/conhome/1000156/all-proceedings"}, "title": "Clustering of Spatial Data with DBSCAN: An Assessment of STARK", "abstract": "The ever-increasing diffusion rate of mobile devices, able to continuously gather sensing data, creates favorable conditions for the development of smart city infrastructures. In this field the analysis of spatial data plays a pivotal role, due to the relevance they assume in urban scenarios. To satisfy this need, the usage of large distributed computing infrastructures comes into play, supported by efficient frameworks, such as Apache Spark, one of the most relevant platforms to date. However, in order to better take advantage of data and computing resources, it is also necessary to have at disposal flexible and easy-to-use specialized instruments, granting domain specific capabilities for the analysis of spatial data. This paper focuses on a novel framework for processing of spatial data called STARK, giving an overview of its functionalities and presenting an in-depth assessment study of its performances when implementing spatial data clustering, namely DBSCAN. In particular, we focus on two implementations, called MR-DBSCAN and NG-DBSCAN. Of the latter we introduced an implementation in STARK, in order to enrich the framework and to test its capabilities.", "venue": "International Symposium on Computers and Communications", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2019-06-01", "journal": {"name": "2019 IEEE Symposium on Computers and Communications (ISCC)", "pages": "1-6"}, "authors": [{"authorId": "1740127", "name": "P. Bellavista"}, {"authorId": "1491120815", "name": "Mattia Campestri"}, {"authorId": "1748978", "name": "L. Foschini"}, {"authorId": "1713456", "name": "R. Montanari"}], "citations": []}
