{"paperId": "dba235fb6f66500bec0c2142f112edbba9fbe9f8", "publicationVenue": {"id": "435bb11d-c0fe-4815-b98e-46c313be8ce7", "name": "Journal of Decision Systems", "type": "journal", "alternate_names": ["J Decis Syst"], "issn": "1246-0125", "alternate_issns": ["1166-8636"], "url": "http://ejournals.ebsco.com/direct.asp?JournalID=711728", "alternate_urls": ["http://www.tandfonline.com/loi/tjds20"]}, "title": "Big data platforms: in the lens of selection and evaluation approach", "abstract": "ABSTRACT The manifestation of big data has brought about firms’ intense desires for analytical value creation besides crucial challenges to handle data processing. Unlocking the potentials of big data analytics depends on devising and setting up platforms through the big data value chain. Achieving these appropriate platforms is indispensable and necessitates a selection and evaluation method. To that end, in this research, a new fuzzy superiority and inferiority ranking approach for selecting and evaluating big data platforms has been investigated; and introduced. In the proposed approach, both functional and non-functional criteria for the big data platform were gathered and customized. For demonstrating the applicability of the method, a numerical example provided; and the suggested approach was used in a company case that had been encountered with this platform acquisition problem. Simplifying assessment and selection of the big data platform, and feasible procedure are the main values of the offered approach. The proposed approach is beneficial for buyer firms, vendors and industries of big data, considering more accurate evaluations and making better acquisition decisions.", "venue": "Journal of Decision Systems", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-01-06", "journal": {"name": "Journal of Decision Systems", "pages": "19 - 48", "volume": "32"}, "authors": [{"authorId": "6207485", "name": "Saeed Rouhani"}, {"authorId": "40811542", "name": "Sayna Rotbei"}], "citations": [{"paperId": "1f0f3e0a614c4b7d5b0dbafa1534182ba9d4e838", "title": "Role of Big Data Analytics in the Internet of Things: A Comprehensive Survey"}, {"paperId": "329f334835976ddf2cbe9370c3c3166f6b7ce263", "title": "Analysis and practice of key technologies for e-commerce talent training online platform under the background of big data"}, {"paperId": "4db8a23e2c0cc6a1d3603755801fc70a69bb3cb9", "title": "The mediating role of knowledge management and information systems selection management capability on Big Data Analytics quality and firm performance"}, {"paperId": "733fc094e785724621c46e20db1be69f132ad9df", "title": "Comprehensive Survey of Big Data Mining Approaches in Cloud Systems"}, {"paperId": "6fc16154bbe902316d3380c398187feb168572b2", "title": "Selection of the best Big Data platform using COBRAC-ARTASI methodology with adaptive standardized intervals"}, {"paperId": "ccd8c74bb22410911d8e907e90840e04a1ad171b", "title": "Setting Privacy \"by Default\" in Social IoT: Theorizing the Challenges and Directions in Big Data Research"}, {"paperId": "34813538d043e71f4f9522f79e27b6bca1dd0003", "title": "Big Data Research"}]}
