{"paperId": "dbb53d19f601da0f7e1ff3cf6ae5e4d08521c513", "publicationVenue": null, "title": "Supporting User Steering In Large-Scale Workflows With Provenance Data. (Support des actions de pilotage dans les workflows à grande échelle avec données de provenance)", "abstract": "Computational Science and Engineering (CSE) workflows are large-scale, require \nHigh Performance Computing (HPC) execution, and have the exploratory nature of \nscience. \nDuring the long run, which often lasts for hours or days, users need to steer \nthe workflow by dynamically analyzing it and adapting it to improve the quality \nof results or to reduce the execution time. However, to steer the workflow, users \ntypically perform several interactions (called user steering actions), which need to \nbe tracked. Otherwise, users find it harder to understand how and what needs to be \nsteered, they can steer in a misleading way, it can be difficult to explain the results \nthat were consequences of their actions, and it can be impossible to reproduce the \nresults. This thesis addresses this problem by proposing an approach that defines the \nfundamental concepts for user steering action; introduces the notion of provenance \nof steering actions; and contemplates a W3C PROV-compliant data diagram to \nmodel steering action data with provenance. Also, the approach presents system \ndesign principles to enable the management of steering action data by capturing, \nexplicitly relating the actions to the rest of the workflow data, and storing these \ndata efficiently. Two instances of this approach were designed and built: one is \na lightweight tool to be plugged into parallel scripts and the other is to be used \nwithin a Parallel Workflow Management System, which are the two typical ways to \nconduct CSE experiments in HPC. Using real use cases in the Oil and Gas industry, \nthe experiments show that the proposed approach enables users to understand how \ntheir actions directly affect the workflow results at runtime and that the system \ndesign principles were essential to add negligible overhead to the HPC workflows.", "venue": "", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2019-12-17", "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "144712722", "name": "Renan Souza"}], "citations": []}
