{"paperId": "dbc69345104c012b01327e7607d54c0097976e35", "publicationVenue": {"id": "e80819e6-a672-4aed-a65e-65ca375f204f", "name": "IEEE Embedded Systems Letters", "type": "journal", "alternate_names": ["IEEE Embed Syst Lett"], "issn": "1943-0663", "url": "https://ieeexplore.ieee.org/servlet/opac?punumber=4563995"}, "title": "Swift-CNN: Leveraging PCM Memory’s Fast Write Mode to Accelerate CNNs", "abstract": "Nonvolatile memories [especially phase change memories (PCMs)] offer scalability and higher density. However, reduced write performance has limited their use as main memory. Researchers have explored using the fast write mode available in PCM to alleviate the challenges. The fast write mode offers lower write latency and energy consumption. However, the fast-written data are retained for a limited time and need to be refreshed. Prior works perform fast writes when the memory is busy and use slow writes to refresh the data during memory idle phases. Such policies do not consider the retention time requirement of a variable and repeat all the writes made during the busy phase. In this work, we suggest a retention-time-aware selection of write modes. As a case study, we use convolutional neural networks (CNNs) and present a novel algorithm, Swift-CNN, that assesses each CNN layer’s memory access behavior and retention time requirement and suggests an appropriate PCM write mode. Our results show that Swift-CNN decreases inference and training execution time and memory energy compared to state-of-the-art techniques and achieves execution time close to the ideal (fast write-only) policy.", "venue": "IEEE Embedded Systems Letters", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-01", "journal": {"name": "IEEE Embedded Systems Letters", "pages": "234-237", "volume": "15"}, "authors": [{"authorId": "3021218", "name": "Lokesh Siddhu"}, {"authorId": "66159055", "name": "Hassan Nassar"}, {"authorId": "2247789238", "name": "Lars Bauer"}, {"authorId": "94395720", "name": "Christian Hakert"}, {"authorId": "2176238049", "name": "N. Hölscher"}, {"authorId": "2247542835", "name": "Jian-Jia Chen"}, {"authorId": "2247781719", "name": "Joerg Henkel"}], "citations": []}
