{"paperId": "dbd2dd7eef87c047520cfcf596452ef7efa79d41", "publicationVenue": {"id": "9994819e-70e0-4043-bac7-9193ddc428f7", "name": "Cardiometry", "type": "journal", "issn": "2304-7232", "url": "http://www.cardiometry.net/"}, "title": "Heart Disease Prediction Using Random Forest Algorithm", "abstract": "Heart disease is one of the complex diseases and globally many of us suffer from this disease. On time and efficient identification of cardiovascular disease plays a key role in healthcare, particularly within the field of cardiology. An efficient and accurate system to diagnose cardiovascular disease and the system is predicated on machine learning techniques. The system is developed by classification algorithms using Random Forest, Naïve Bayes and Support Vector Machine while standard features selection techniques are used like univerate, feature importance , and correlation matrix for removing irrelevant and redundant features. The features selection are used for feature to extend the classification accuracy and reduce the execution time of the arrangement. The way that aims at finding significant features by applying machine learning techniques leading to improving the accuracy within the prediction of disorder. The heart disease prediction that Random Forest achieved good accuracy as compared to other algorithms.", "venue": "Cardiometry", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-11-30", "journal": {"name": "CARDIOMETRY"}, "authors": [{"authorId": "2137226715", "name": "V. R"}, {"authorId": "2251521397", "name": "Tamilselvi, J."}], "citations": [{"paperId": "fb9098d7ded26d0242c0691d25a2ed486cabc343", "title": "A highly efficient and scalable prediction approach based on random forest that is capable of handling enormous data sets"}, {"paperId": "3e900efb702f5247b0ff052f7119048f92b5b5f2", "title": "Stacking Model for Heart Stroke Prediction using Machine Learning Techniques"}, {"paperId": "65f5ada702b241fb7b96e1850de2c3c17fdf1b5b", "title": "Enhancing Prediction of Cardiovascular Disease using Bagging Technique"}, {"paperId": "6dcb389f0de797a41d15f4892696548bbe81429f", "title": "Improving Accuracy in Intelligent Coronary Heart Disease Diagnosis Prediction Model using Support Vector Clustering Technique Compared over Random Forest Classifier Algorithm"}, {"paperId": "685852c24515396007bf976a9280ad5a0afe8f5d", "title": "MACHINE LEARNING TECHNIQUES FOR EARLY HEART FAILURE PREDICTION"}, {"paperId": "752fd02e36f7422787f28246978f17f5c6103408", "title": "Advances in Computing and Data Sciences: 4th International Conference, ICACDS 2020, Valletta, Malta, April 24–25, 2020, Revised Selected Papers"}]}
