{"paperId": "dbdbf13a07b55208f678200f59ebdab5fa76d555", "publicationVenue": {"id": "a00fde74-d8df-4613-b825-0fff9f531d3f", "name": "IEEE Transactions on Network and Service Management", "type": "journal", "alternate_names": ["IEEE Trans Netw Serv Manag"], "issn": "1932-4537", "url": "http://ejournals.ebsco.com/direct.asp?JournalID=714200", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4275028", "http://ieeexplore.ieee.org/servlet/opac?punumber=4275028"]}, "title": "Blockchain on Security and Forensics Management in Edge Computing for IoT: A Comprehensive Survey", "abstract": "Security and forensics represent two key components for network management, especially to guarantee the trusted operation of massive access networks such as the Internet of Things (IoT). As a core technology to provide low latency and high communication for IoT, Mobile Edge Computing (MEC) pulls computing resources from remote cloud centers to devices. The process of MEC service involves three types of entities: devices, data generated by devices and digital evidence generated after the data interaction. These entities are fully distributed and difficult to protect through traditional, highly centralized security and authentication mechanisms. As a decentralized shared ledger and database, the emerging blockchain is considered to provide cooperative trust and collaborative action among multiple subjects while ensuring the integrity and confidentiality of data. Because of its anonymity, non-tampering and traceability, the blockchain arouses research on the combination of blockchain and edge computing for device security, data security and forensics in IoT. This survey analyzes the application of blockchain in MEC-IoT systems and mainly focuses on approaches and technologies to manage the security and forensics issues for IoT. Finally, we present open issues and prospects for future work and research directions.", "venue": "IEEE Transactions on Network and Service Management", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-06-01", "journal": {"name": "IEEE Transactions on Network and Service Management", "pages": "1159-1175", "volume": "19"}, "authors": [{"authorId": "2431843", "name": "Zhuofan Liao"}, {"authorId": "2061203676", "name": "Xiang Pang"}, {"authorId": "2108122564", "name": "Jingyu Zhang"}, {"authorId": "40198376", "name": "Bing Xiong"}, {"authorId": "2143716755", "name": "Jin Wang"}], "citations": [{"paperId": "bddfd25adc47024cd0127c44e073c1a4dc76210a", "title": "Blockchain-Enhanced Offloading in Mobile Edge Computing: A Systematic Review and Survey of Current Trends and Future Directions"}, {"paperId": "7d6266db8aab5c3582e3aedd9efe10211ac8013d", "title": "Is exponential stability achievable in singular perturbed delayed systems with time-varying parameters? A comprehensive analysis"}, {"paperId": "05f73df2b8b23afb16b472f8f72c52d80c02d1fe", "title": "Trajectory-Aware Offloading Decision in UAV-Aided Edge Computing: A Comprehensive Survey"}, {"paperId": "6e5b269dff8268a32c404e4e578824efc6177c5f", "title": "Smart home system using blockchain technology in green lighting environment in rural areas"}, {"paperId": "0bbad5bc20493610eebae5d4bf17f5556fdd0035", "title": "Time Estimation for a New Block Generation in Blockchain-Enabled Internet of Things"}, {"paperId": "8f6f549f0b337b93ddae08cffb56a81fccdae2a7", "title": "Confronting Combined Cyber-Attacks on Collaborative DC Microgrids Using a Communication Protocols-based Distributed Unscented Kalman Filter"}, {"paperId": "825854af264e96bdc156350719f030f52e67b382", "title": "Stochastic Economic–Resilience Management of Combined Cooling, Heat, and Power-Based Microgrids in a Multi-Objective Approach"}, {"paperId": "96b500a02f68cd222c86d15ae7258170e4ab8225", "title": "Design of infinite horizon LQR controller for discrete delay systems in satellite orbit control: A predictive controller and reduction method approach"}, {"paperId": "ae129b56b235c9dd5f82a58dad6fb6f6204f6a41", "title": "KFREAIN: Design of A Kernel-Level Forensic Layer for Improving Real-Time Evidence Analysis Performance in IoT Networks"}, {"paperId": "1a641317357b7205c271c3bac39c960e9f38d5aa", "title": "Selection of node with editing rights and privacy protection mechanisms based on dual-blockchain"}, {"paperId": "7a1e65c611405451fb3d780295b729c11b4ce3b2", "title": "A Cooperative PoW and Incentive Mechanism for Blockchain in Edge Computing"}, {"paperId": "57bb2d9dea1faf7763158eaa2e05c93166ce5d49", "title": "FingerChain: Copyrighted Multi-Owner Media Sharing by Introducing Asymmetric Fingerprinting Into Blockchain"}, {"paperId": "abee8ca38e6941a96385e35e07b837acfaf63ad2", "title": "ForensiBlock: A Provenance-Driven Blockchain Framework for Data Forensics and Auditability"}, {"paperId": "9f8fe3bc4c21e560758cf2738fe74bf5df201011", "title": "A blockchain-enabled privacy-preserving authentication management protocol for Internet of Medical Things"}, {"paperId": "3475e1d2727db9d9cd1a084e10be5062b7081075", "title": "Mobile Edge Computing and Machine Learning in the Internet of Unmanned Aerial Vehicles: A Survey"}, {"paperId": "85531daaec75d733cfd1bb570ad451e42959fd8d", "title": "Machine Learning-Based Non-Intrusive Digital Forensic Service for Smart Homes"}, {"paperId": "9fa803bf4211a66c7e588b962be562725a524983", "title": "Securing Wireless Sensor Networks Using Machine Learning and Blockchain: A Review"}, {"paperId": "801bdae8691160a732e959ce9a4276ead4a92ac7", "title": "Blockchain-Based Information Sharing Security for the Internet of Things"}, {"paperId": "7eefc7d30bf99638e6c25141353efc2888e663e9", "title": "Dynamic stochastic game-based security of edge computing based on blockchain"}, {"paperId": "cecba1a7dc72a40e740d2c9d9e17f915c709c6c2", "title": "A comprehensive survey on authentication and secure key management in internet of things: Challenges, countermeasures, and future directions"}, {"paperId": "4ef3ae029dd3dd44f92a7b7851c6e2ad77ac6fff", "title": "Blockchain-Based Offline Auditing for the Cloud in Vehicular Networks"}, {"paperId": "2032921cc7c7bf3644038264db3113f823d24080", "title": "A Blockchain-Based Multi-CA Cross-Domain Authentication Scheme in Decentralized Autonomous Network"}, {"paperId": "b741bb2f2563a2303df684528e041c08e8796a8c", "title": "Recent Advances of Blockchain and its Applications"}, {"paperId": "0f018ba9818b3ff151707854a0e5160a82853763", "title": "Analysis of the Challenges of Artificial Intelligence of Things (AIoT) for the Smart Supply Chain (Case Study: FMCG Industries)"}, {"paperId": "5cb08589010efcbdf0c58b63f3511ddd6369b1ea", "title": "5G Multi-Access Edge Computing: A Survey on Security, Dependability, and Performance"}, {"paperId": "f1a420655839e75d4cafce692da3aff877d483a3", "title": "A New Identity Authentication and Key Agreement Protocol Based on Multi-Layer Blockchain in Edge Computing"}]}
