{"paperId": "dbe58fe877dbe3d95447529cdd1ba77264e49e0f", "publicationVenue": {"id": "c56116d3-225c-47c9-a4d9-f935e32f846c", "name": "IEEE Vehicular Technology Conference", "type": "conference", "alternate_names": ["IEEE Veh Technol Conf", "Veh Technol Conf", "VTC", "Vehicular Technology Conference"], "url": "http://vtsociety.org/"}, "title": "Communications-Caching-Computing Tradeoff Analysis for Bidirectional Data Computation in Mobile Edge Networks", "abstract": "With the advent of the modern mobile traffic, e.g., online gaming, augmented reality delivery and etc., a novel bidirectional computation task model where the input data of each task consists of two parts, one generated at the mobile device in real-time and the other originated from the Internet proactively, is emerging as an important use case of 5G. In this paper, for ease of analytical analysis, we consider the homogeneous bidirectional computation task model in a mobile edge network which consists of one mobile edge computing (MEC) server and one mobile device, both enabled with computing and caching capabilities. Each task can be served via three mechanisms, i.e., local computing with local caching, local computing without local caching and computing at the MEC server. To minimize the average bandwidth, we formulate the joint caching and computing optimization problem under the latency, cache size and average power constraints. We derive the closed-form expressions for the optimal policy and the minimum bandwidth. The tradeoff among communications, computing and caching is illustrated both analytically and numerically, which provides insightful guideline for the network designers.", "venue": "IEEE Vehicular Technology Conference", "year": 2020, "fieldsOfStudy": ["Computer Science", "Mathematics"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-01-12", "journal": {"name": "2020 IEEE 92nd Vehicular Technology Conference (VTC2020-Fall)", "pages": "1-5"}, "authors": [{"authorId": "46675384", "name": "Yaping Sun"}, {"authorId": "1482602244", "name": "Lyutianyang Zhang"}, {"authorId": "145632815", "name": "Zhiyong Chen"}, {"authorId": "145954342", "name": "S. Roy"}], "citations": [{"paperId": "cb1856c90c6d1305fcd726bbeaded179cf708000", "title": "Multi-Agent Federated Reinforcement Learning Strategy for Mobile Virtual Reality Delivery Networks"}, {"paperId": "28a3aba602e5244fd2881f97113a29cea70be6b8", "title": "Augmented Reality with Mobility Awareness in Mobile Edge Computing over 6G Network: A Survey"}, {"paperId": "22622bc06a23d3259723b70e793a7727e9217794", "title": "Communications-Caching-Computing Resource Allocation for Bidirectional Data Computation in Mobile Edge Networks"}]}
