{"paperId": "dbf3a261a1e0c515711bedd9e6ec07867f48c4da", "publicationVenue": {"id": "c6840156-ee10-4d78-8832-7f8909811576", "name": "IEEE Transactions on Knowledge and Data Engineering", "type": "journal", "alternate_names": ["IEEE Trans Knowl Data Eng"], "issn": "1041-4347", "url": "https://www.computer.org/web/tkde", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=69"]}, "title": "LogStore: A Workload-Aware, Adaptable Key-Value Store on Hybrid Storage Systems", "abstract": "Due to recent explosion of data volume and velocity, a new array of lightweight key-value stores have emerged to serve as alternatives to traditional databases. The majority of these storage engines, however, sacrifice their read performance in order to cope with write throughput by avoiding random disk access when writing a record in favor of fast sequential accesses. But, the boundary between sequential versus random access is becoming blurred with the advent of solid-state drives (SSDs). In this work, we propose our new key-value store, LogStore, optimized for hybrid storage architectures. Additionally, introduce a novel cost-based data staging model based on log-structured storage, in which recent changes are first stored on SSDs, and pushed to HDD as it ages, while minimizing the read/write amplification for merging data from SSDs and HDDs. Furthermore, we take a holistic approach in improving both the read and write performance by dynamically optimizing the data layout, such as deferring and reversing the compaction process, and developing an access strategy to leverage the strengths of each available medium in our storage hierarchy. Lastly, in our extensive evaluation, we demonstrate that LogStore achieves up to 6x improvement in throughput/latency over LevelDB, a state-of-the-art key-value store.", "venue": "IEEE Transactions on Knowledge and Data Engineering", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-08-01", "journal": {"name": "IEEE Transactions on Knowledge and Data Engineering", "pages": "3867-3882", "volume": "34"}, "authors": [{"authorId": "39882369", "name": "Prashanth Menon"}, {"authorId": "2562574", "name": "Thamir M. Qadah"}, {"authorId": "1731210", "name": "T. Rabl"}, {"authorId": "1719119", "name": "Mohammad Sadoghi"}, {"authorId": "145641161", "name": "H. Jacobsen"}], "citations": [{"paperId": "9a8e034458d21abab4276134fd02f12439304e49", "title": "HotRAP: Hot Record Retention and Promotion for LSM-trees with tiered storage"}, {"paperId": "e5fa5758cb14de3e1b2f5b2dbcc11d1cce2ea2c8", "title": "LogStore: A Workload-aware, Adaptable Key-Value Store on Hybrid Storage Systems (Extended abstract)"}]}
