{"paperId": "dbfb2613900a6c7490e9a888cb4c56067956b366", "publicationVenue": {"id": "d17369a1-649c-4725-80e2-45942b69f527", "name": "Educación", "type": "journal", "alternate_names": ["Educación"], "issn": "2709-8761", "alternate_issns": ["2710-0243", "1019-9403", "1813-3363"], "url": "https://dialnet.unirioja.es/servlet/revista?codigo=22793", "alternate_urls": ["http://revistas.pucp.edu.pe/index.php/educacion", "http://www.scielo.org.pe/scielo.php?lng=en&pid=1019-9403&script=sci_serial", "https://revistas.unife.edu.pe/index.php/educacion"]}, "title": "A Journey through the Potential of Research to Drive Innovation in University Education", "abstract": "This essay aims to explore effective ways to utilize research in improving the quality of university education and address challenges that impede its potential. The authors conducted a multivocal literature review and approached six subtopics, including the role of interdisciplinary research and collaboration, the impact of research on teaching practices and student outcomes, the potential of emerging technologies, the importance of diversity, equity, and inclusion, fostering a culture of research and innovation, and the role of funding and resources. They recommend investment in research infrastructure, the promotion of collaboration, engagement, and ethical principles, and building a culture of research. Implementing these recommendations will enable universities to utilize research effectively in order to enhance the quality of university education, drive progress, and contribute to more inclusive, equitable, and sustainable societies.", "venue": "Educación", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-09-29", "journal": {"name": "Educación"}, "authors": [{"authorId": "2254068463", "name": "Edgar Romario Aranibar Ramos"}, {"authorId": "2227548902", "name": "Roberto Guillermo Ramos Castillo"}, {"authorId": "2172698843", "name": "Luis Carlo Zanabria Cabrera"}], "citations": []}
