{"paperId": "dc03afc8992f9c53b540381a2688f6354fe5e506", "publicationVenue": {"id": "d5e5b5e7-54b1-4f53-82fc-4853f3e71c58", "name": "medRxiv", "type": "journal", "url": "https://www.medrxiv.org/"}, "title": "Development and validation of the COVID-19 severity index (CSI): a prognostic tool for early respiratory decompensation", "abstract": "Objective: The goal of this study was to create a predictive model of early hospital respiratory decompensation among patients with COVID-19. Design: Observational, retrospective cohort study. Setting: Nine-hospital health system within the Northeastern United States. Populations: Adult patients ([≥] 18 years) admitted from the emergency department who tested positive for SARS-CoV-2 (COVID-19) up to 24 hours after initial presentation. Patients meeting criteria for critical respiratory illness within 4 hours of arrival were excluded. Main outcome and performance measures: We used a composite endpoint of respiratory critical illness as defined by oxygen requirement beyond low-flow nasal cannula (e.g., non-rebreather mask, high-flow nasal cannula, bi-level positive pressure ventilation), intubation, or death within the first 24 hours of hospitalization. We developed predictive models using patient demographic and clinical data collected during those first 4 hours. Eight hospitals were used for development and internal validation (n=932) and 1 hospital for model external validation (n=240). Predictive variables were identified using an ensemble approach that included univariate regression, random forest, logistic regression with LASSO, Chi-square testing, gradient boosting information gain, and gradient boosting Shapley additive explanation (SHAP) values prior to manual curation. We generated two predictive models, a quick COVID-19 severity index (qCSI) that uses only exam and vital sign measurements, and a COVID-19 severity index (CSI) machine learning model. Using area under receiver operating characteristic (AU-ROC), precision-recall curves (AU-PRC) and calibration metrics, we compare the qCSI and CSI to three illness scoring systems: Elixhauser mortality score, qSOFA, and CURB-65. We present performance of qCSI and CSI on an external validation cohort. Results: During the study period from March 1, 2020 to April 27, 2020, 1,792 patients were admitted with COVID-19. Six-hundred and twenty patients were excluded based on age or critical illness within the first 4 hours, yielding 1172 patients in the final cohort. Of these patients, 144 (12.3%) met the composite endpoint within the first 24 hours. The qCSI (AU-ROC: 0.90 [0.85-0.96]) comprised of nasal cannula flow rate, respiratory rate, and minimum documented pulse oximetry outperformed the baseline models (qSOFA: 0.76 [0.69-0.85]; Elixhauser: 0.70 [0.62-0.80]; CURB-65: AU-ROC 0.66 [0.58-0.77]) and was validated on an external cohort (AU-ROC: 0.82). The machine learning-based CSI had superior performance on the training cohort (AU-ROC: 0.91 [0.86-0.97]), but was unlikely to provide practical improvements in clinical settings. Conclusions: A significant proportion of admitted COVID-19 patients decompensate within 24 hours of hospital presentation and these events are accurately predicted using respiratory exam findings within a simple scoring system.", "venue": "medRxiv", "year": 2020, "fieldsOfStudy": ["Medicine"], "publicationTypes": null, "publicationDate": "2020-05-12", "journal": {"name": "medRxiv", "volume": ""}, "authors": [{"authorId": "3013842", "name": "A. Haimovich"}, {"authorId": "2263837851", "name": "Neal G Ravindra"}, {"authorId": "70190915", "name": "Stoytcho Stoytchev"}, {"authorId": "145701467", "name": "H. P. Young"}, {"authorId": "2255071384", "name": "F. P. Wilson"}, {"authorId": "2263837893", "name": "David van Dijk"}, {"authorId": "2250195186", "name": "Wade L. Schulz"}, {"authorId": "2263956111", "name": "Richard Andrew Taylor"}], "citations": [{"paperId": "9cb5d41dc63e00d1d1f1d096e53ecfe7e30b0bed", "title": "Mobile Robotic Platform for Contactless Vital Sign Monitoring"}, {"paperId": "1e9c43a2ec0864bfdb7cde897bf40cf7237b2790", "title": "A machine learning model for predicting deterioration of COVID-19 inpatients"}, {"paperId": "ec2fdb8b3581a52e9f7fc981500b286bf82c6f3b", "title": "Understanding COVID-19 in Brazil: Socioeconomic Impacts, Statistical Analysis and Future Challenges"}, {"paperId": "c841df530aebbf5e5e0d883d8a6a3b903b486a28", "title": "Machine Learning for Real-World Evidence Analysis of COVID-19 Pharmacotherapy"}, {"paperId": "46732a753eaa6d43564630f73ab600e3a866895a", "title": "Developing a pulse oximetry home monitoring protocol for patients suspected with COVID-19 after emergency department discharge"}, {"paperId": "884cb071204671abd29061354bbd64628bfa819e", "title": "Attention-Based LSTM Network for COVID-19 Clinical Trial Parsing"}, {"paperId": "6dbadb6e2f72bd6cf955e3bf1a5d34e4aef0f95c", "title": "Exacerbation of neurological symptoms and COVID-19 severity in patients with preexisting neurological disorders and COVID-19: A systematic review"}, {"paperId": "1b77eb89b727da0bc18d1004faf5333b4b4ae11c", "title": "Generating hard-to-obtain information from easy-to-obtain information: Applications in drug discovery and clinical inference"}, {"paperId": "431bdf5e4a62c5d713b8d291fc1320297fbb8291", "title": "Agile analytics to support rapid knowledge pipelines"}, {"paperId": "6a9562e225ae120556c5b3ace4ec42cdc35eee10", "title": "Agile mobile robotic platform for contactless vital signs monitoring"}, {"paperId": "97477139b85f79218185bd4a1fa206939a5607bb", "title": "Predicting critical state after COVID-19 diagnosis: model development using a large US electronic health record dataset"}, {"paperId": "50743502ca824f9e0df083321b6944aa7bb2cd76", "title": "Predicting Critical State after COVID-19 Diagnosis Using Real-World Data from 20152 Confirmed US Cases"}, {"paperId": "e7537b3b7a898f28b4f4e1729263b7278603335f", "title": "Development and validation of a clinical risk score to predict the risk of SARS-CoV-2 infection from administrative data: A population-based cohort study from Italy"}, {"paperId": "f6629c254a38d68370ff19eb95059000750abb47", "title": "Self-supervised edge features for improved Graph Neural Network training"}, {"paperId": "860f8188e0304e19bf887874e03792b52c71a150", "title": "Disparities in Vulnerability to Severe Complications from COVID-19 in the United States"}, {"paperId": "b46af72bdbaeaaccdc49b9506208e6c103eead86", "title": "Agile Health Care Analytics: Enabling Real-Time Disease Surveillance With a Computational Health Platform"}, {"paperId": "33e14a69497c79eaba8db2195673943e006e3c87", "title": "Predicting Critical State after COVID-19 Diagnosis Using Real-World Data from 20152 US Patients"}]}
