{"paperId": "dc07e2db8e52279f20e838bd453daf2007acfcbf", "publicationVenue": {"id": "ffe5bb5c-04ed-488e-985d-d3a7b39542cf", "name": "IEEE International Conference on Distributed Computing Systems", "type": "conference", "alternate_names": ["International Conference on Distributed Computing Systems", "IEEE Int Conf Distrib Comput Syst", "Int Conf Device Circuit Syst", "ICDCS", "Int Conf Distrib Comput Syst", "International Conference on Devices, Circuits and Systems"], "url": "https://ieeexplore.ieee.org/xpl/conhome/1000213/all-proceedings"}, "title": "SEIZE User Desired Moments: Runtime Inspection for Parallel Dataflow Systems", "abstract": "In Data-Intensive Scalable Computing (DISC) Systems, data transformations are concealed by exposed APIs, and intermediate execution moments are masked under dataflow transitions. Consequently, many crucial features and optimizations (e.g., debugging, data provenance, runtime skew detection) are not well-supported. Inspired by our experience in implementing features and optimizations over DISC systems, we present SEIZE, a unified framework that enables dataflow inspection— wiretapping the data-path with listening logic —in MapReduce-style programming model. We generalize our lessons learned by providing a set of primitives defining dataflow inspection, orchestration options for different inspection granularities, and operator decomposition and dataflow puncutation strategy for dataflow intervention. We demonstrate the generality and flexibility of the approach by deploying SEIZE in both Apache Spark and Apache Flink. Our experiments show that, the overhead introduced by the inspection logic is most of the time negligible (less than 5% in Spark and 10% in Flink).", "venue": "IEEE International Conference on Distributed Computing Systems", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-11-01", "journal": {"name": "2020 IEEE 40th International Conference on Distributed Computing Systems (ICDCS)", "pages": "1199-1200"}, "authors": [{"authorId": "2024664573", "name": "Youfu Li"}, {"authorId": "2192580", "name": "Matteo Interlandi"}, {"authorId": "2493657", "name": "Fotis Psallidas"}, {"authorId": "2158625463", "name": "Wei Wang"}, {"authorId": "1712630", "name": "C. Zaniolo"}], "citations": []}
