{"paperId": "dc0ab800bdcf68fe06e1ad54a5e4875555e3287f", "publicationVenue": null, "title": "Service Function Graph Design And Embedding In Next Generation Internet", "abstract": "Network Function Virtualization (NFV) and Software Defined Networking (SDN) are viewed as the techniques to design, deploy and manage future Internet services. NFV provides an effective way to decouple network functions from the proprietary hardware, allowing the network providers to implement network functions as virtual machines running on standard servers. In the NFV environment, an NFV service request is provisioned in the form of a Service Function Graph (SFG). The SFG defines the exact set of actions or Virtual Network Functions (VNFs) that the data stream from the service request is subjected to. These actions or VNFs need to be embedded onto specific physical (substrate) networks to provide network services for end users. Similarly, SDN decouples the control plane from network devices such as routers and switches. The network control management is performed via an open interface and the underlying infrastructure turned into simple programmable forwarding devices. NFV and SDN are complementary to each other. Specifically, similar to running network functions on general purpose servers, SDN control plane can be implemented as pure software running on industry standard hardware. Moreover, automation and virtualization provide both NFV and SDN the tools to achieve their respective goals. In this dissertation, we motivate the importance of service function graph design, and we focus our attention on the problem of embedding network service requests. Throughout the dissertation, we highlight the unique properties of the service requests and investigate how to efficiently design and embed an SFG for a service request onto substrate network. We address variations of the embedding service requests such as dependence awareness and branch awareness in service function graph design and embedding. We propose novel algorithms to design and embed service requests with dependence and branch awareness. We also provide the intuition behind our proposed schemes and analyze our suggested approaches over multiple metrics against other embedding techniques. INDEX WORDS: Network Function Virtualization, Virtual Network Embedding, Software Defined Networking SERVICE FUNCTION GRAPH DESIGN AND EMBEDDING IN NEXT GENERATION INTERNET", "venue": "", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": null, "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "2749049", "name": "Maryam Jalalitabar"}], "citations": [{"paperId": "a7012e5749c737ae1ec24df9c345d7099403fffc", "title": "Network service topology: Formalization, taxonomy and the CUSTOM specification model"}, {"paperId": "2ff74c0cab30c7615c49e6445a1f4f93aa0e7237", "title": "Robust network function virtualization"}]}
