{"paperId": "dc117ce0415a052323ae4fc99b2cc1f79d690e80", "publicationVenue": {"id": "20f4c07b-44b3-4e7d-8546-e3c11620a21c", "name": "Drones", "issn": "2504-446X", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-1077192", "alternate_urls": ["https://www.mdpi.com/journal/drones", "https://www.mdpi.com/journal/drones/about", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-1077192"]}, "title": "Multiple Unmanned Aerial Vehicle Autonomous Path Planning Algorithm Based on Whale-Inspired Deep Q-Network", "abstract": "In emergency rescue missions, rescue teams can use UAVs and efficient path planning strategies to provide flexible rescue services for trapped people, which can improve rescue efficiency and reduce personnel risks. However, since the task environment of UAVs is usually complex, uncertain, and communication-limited, traditional path planning methods may not be able to meet practical needs. In this paper, we introduce a whale optimization algorithm into a deep Q-network and propose a path planning algorithm based on a whale-inspired deep Q-network, which enables UAVs to search for targets faster and safer in uncertain and complex environments. In particular, we first transform the UAV path planning problem into a Markov decision process. Then, we design a comprehensive reward function considering the three factors of path length, obstacle avoidance, and energy consumption. Next, we use the main framework of the deep Q-network to approximate the Q-value function by training a deep neural network. During the training phase, the whale optimization algorithm is introduced for path exploration to generate a richer action decision experience. Finally, experiments show that the proposed algorithm can enable the UAV to autonomously plan a collision-free feasible path in an uncertain environment. And compared with classic reinforcement learning algorithms, the proposed algorithm has a better performance in learning efficiency, path planning success rate, and path length.", "venue": "Drones", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-08", "journal": {"name": "Drones"}, "authors": [{"authorId": "2108271161", "name": "Wenshan Wang"}, {"authorId": "2238946808", "name": "Guoyin Zhang"}, {"authorId": "34887940", "name": "Qingan Da"}, {"authorId": "2239062573", "name": "Dan Lu"}, {"authorId": "2238691445", "name": "Yingnan Zhao"}, {"authorId": "2238948412", "name": "Sizhao Li"}, {"authorId": "30948054", "name": "Dapeng Lang"}], "citations": [{"paperId": "afd9df0b1f6765ccfc6c1e0efa1d62241f757762", "title": "Event-Triggered Hierarchical Planner for Autonomous Navigation in Unknown Environment"}]}
