{"paperId": "dc148d4c5fea65764df57f6ce32eb1b59f1b47de", "publicationVenue": {"id": "3096eb5c-d18c-4877-94cd-28edd3a9c357", "name": "International Journal of Environmental Research and Public Health", "type": "journal", "alternate_names": ["Int J Environ Res Public Health"], "issn": "1660-4601", "url": "http://www.mdpi.com/journal/ijerph/"}, "title": "Influence of Coal Mining on Historical Buildings: Case Study in Shanxi", "abstract": "Numerous historical buildings exist in Shanxi Province, a major coal producing area in China, so there exist many overlapping areas between ancient wooden buildings and coal mining. Coal mining in overlapping areas will lead to surface subsidence, which will have an impact on historical buildings. Based on the distribution of historical buildings and the distribution and mining of coal resources in Shanxi Province, this paper concludes that the overlapping areas of coal mining and ancient wooden buildings in Shanxi Province are mainly concentrated in Changzhi City, and the Lu’an mining area in Changzhi City is selected as the research object. In addition, using the gray correlation analysis method, the surface subsidence coefficient, which characterizes the intensity of mining subsidence, is used as the reference sequence. Seven factors selected from the geological conditions and mining conditions of the Lu’an mining area are used as the comparison sequence to calculate the gray correlation between each influencing factor and the surface subsidence coefficient, and to obtain that geological factors such as the nature of the overlying rock layer, bedrock thickness and dip angle of the coal seam, and mining factors such as mining height, average mining depth and working face size largely determine the surface subsidence coefficient. The surface subsidence in the overlap area could largely be influenced by geological factors such as the nature of the overlying rock layer, bedrock thickness and coal seam inclination, and mining factors such as mining height, average mining depth and working face size. Finally, we investigate the possible effects of surface subsidence on ancient wooden buildings in the overlapping area with the surface subsidence and formation mechanism and propose technical measures to reduce the effects of surface subsidence due to coal mining on historical buildings in the overlapping area.", "venue": "International Journal of Environmental Research and Public Health", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-01-01", "journal": {"name": "International Journal of Environmental Research and Public Health", "volume": "20"}, "authors": [{"authorId": "1587235201", "name": "Yingfeng Sun"}, {"authorId": "2202063484", "name": "Shuaipeng Zhu"}, {"authorId": "2202516549", "name": "Zhiqian Peng"}, {"authorId": "2176767019", "name": "Chun-Ming Yang"}, {"authorId": "2152593773", "name": "Biao Zhou"}, {"authorId": "2190462021", "name": "Xiaoliang Wang"}, {"authorId": "2202616577", "name": "Yixin Zhao"}], "citations": [{"paperId": "1a8f90ad25d6f92cc262050726bc4b504e180bc8", "title": "Elaboration and application of the nested multi-coupling model test system for an artificial dam seepage simulation under combined action of dynamic and static loads"}, {"paperId": "16bd76c1c19d099b70e8a7e60595d4e6215e6723", "title": "A new indicator for estimating the degree of mining-induced land subsidence: the overburden’s average GSI value"}, {"paperId": "f8683fa8201b27be36b3cb1d4bff191b6cc4dfa0", "title": "An Automatic Spatial-Temporal Evolution Inversion Method of Mining Goaf Based on the Improved Hotspot Analysis and Probability Integral Method"}]}
