{"paperId": "dc265785a8b19b4ac671960a1a015526de00b2d4", "publicationVenue": null, "title": "Why do people relocate to bushfire-prone areas in Australia", "abstract": "Bushfires account for 40% of fatalities associated with declared disasters in Australia. A significant proportion of these fatalities occur closer to forested areas because over 90% of the recorded locations for the deaths were within 100 metres of bushland areas. Despite this, there has been an increase in people relocating to now-considered high-risk bushfire areas. This paper considers why people live in bushfire-prone areas particularly following Australia’s 2019–20 catastrophic summer bushfires. The study used a qualitative approach and conducted 30 semi-structured interviews with people living in the southeast part of New South Wales; a region hardest hit during the 2019–20 summer bushfire season. The interviews identified 7 reasons, as given by the participants, concerning why they thought people continued to move near bushland. The reasons were a quest for a ‘tree change’, proximity to family, location beauty, place attachment, work-related needs, property affordability and partner-related factors. These reasons were categorised into internal and external factors. This study serves as a useful reference when creating ways to encourage early self-evacuation and, ultimately, to reduce injuries and fatalities. These findings are not exhaustive and do not represent the entirety of New South Wales nor Australia or other countries. However, they represent a sample of lived experience by participants. Future studies might cover wider areas and include great numbers of participants and so garner diverse opinions about locations where people live and the hazard experienced.", "venue": "April 2024", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-04-01", "journal": {"name": "April 2024"}, "authors": [{"authorId": "119221676", "name": "O. Adedokun"}, {"authorId": "51071091", "name": "T. Egbelakin"}, {"authorId": "2173365899", "name": "W. Sher"}, {"authorId": "2766783", "name": "T. Gajendran"}], "citations": []}
