{"paperId": "dc2c30eed51a96a0c05568b21b8e796a64431f6e", "publicationVenue": {"id": "42cde00d-437d-4bc3-a179-1353dd07f95f", "name": "International Conference on Information and Communication Technologies for Disaster Management", "type": "conference", "alternate_names": ["ICT-DM", "Int Conf Inf Commun Technol Disaster Manag"]}, "title": "The Role of Artificial Intelligence in Managing Emergencies and Crises within Smart Cities", "abstract": "The rapid growth of urbanization and the consequent rise in the urban population have created unprecedented challenges for cities. Traditional methods have proven insufficient in tackling these challenges, prompting the adoption of modern technology, such as the Internet and sensors, to enhance the delivery of services and amenities to urban residents. This has led to the emergence of smart cities across the globe. Recently, there has been a surge in the use of information technology (IT) and the Internet of Things (IoT) in smart cities, particularly for crisis management. At present, cities are leveraging modern technology, IT, and IoT to improve the quality of life for their residents. It is beyond dispute that modern technologies play a pivotal role in managing emergencies and crises in smart cities. As these technologies experience rapid growth in the coming years, we can anticipate their roles and impact in smart cities to expand even further. The present study aims to investigate the role of artificial intelligence (AI) in emergency and crisis management in smart cities. Additionally, the challenges and opportunities associated with the use of AI in this context are explored, and recommendations are provided to enhance the level of awareness among researchers regarding this topic for future investigations.", "venue": "International Conference on Information and Communication Technologies for Disaster Management", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-09-13", "journal": {"name": "2023 International Conference on Information and Communication Technologies for Disaster Management (ICT-DM)", "pages": "1-5"}, "authors": [{"authorId": "118285410", "name": "S. Haghshenas"}, {"authorId": "3309290", "name": "G. Guido"}, {"authorId": "2598327", "name": "Sina Shaffiee Haghshenas"}, {"authorId": "3249464", "name": "V. Astarita"}], "citations": []}
