{"paperId": "dc30377f8e686f445c6e064e62a83d2ed90b9a30", "publicationVenue": null, "title": "Toto \u0096 Benchmarking the Efficiency of a Cloud Service", "abstract": "Microsoft aims to increase the efficiency of Azure SQL DB by maximizing the number of databases that can be hosted in a cluster. However, resource contention among customers increases when changing the configurations, policies, and features that control database co-location on cluster nodes. Tuning and evaluating the efficiency and customer impact of these variables in a scientific manner in production, with a dynamic system and customer workloads, is difficult or infeasible. Here, we present Toto, a benchmark framework for evaluating the efficiency of any cloud service that leverages orchestrators like Service Fabric or Kubernetes. Toto allows for reliable and repeatable specification of a benchmarking scenario of arbitrary scale, complexity, and time-length. An implementation of Toto is deployed in all SQL DB staging clusters and is used to evaluate system efficiency and behaviors. As an example of Toto's capabilities, we present a study to explore the balance between cluster database density and quality of service.", "venue": "SIGMOD Conference", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2021-06-09", "journal": {"name": "Proceedings of the 2021 International Conference on Management of Data"}, "authors": [{"authorId": "88337878", "name": "Justin Moeller"}, {"authorId": "2114133331", "name": "Zi Ye"}, {"authorId": "2113956516", "name": "K. Lin"}, {"authorId": "40493538", "name": "Willis Lang"}], "citations": [{"paperId": "a3505ee5e1181d1f77277c062bf9350ad4be632f", "title": "Proactive Resource Allocation Policy for Microsoft Azure Cognitive Search"}, {"paperId": "7219d1af1ab61fff9dc4949d99faf59d4d3834e9", "title": "Flexible Resource Allocation for Relational Database-as-a-Service"}, {"paperId": "5a3ab721e11a23ab36cd34b56a7348e62c93c5e3", "title": "Tenant Placement in Over-subscribed Database-as-a-Service Clusters"}, {"paperId": "8089d3b8a15624fc718f45e27e64fa1c2b69fffd", "title": "Are current benchmarks adequate to evaluate distributed transactional databases?"}, {"paperId": "17e44fb34a6fbc0f56bc713a2ac24ff82b019bcf", "title": "Moneyball: Proactive Auto-Scaling in Microsoft Azure SQL Database Serverless"}]}
