{"paperId": "dc4522dccd3dc53ca1b0830352e42bed4e7307c0", "publicationVenue": null, "title": "A Web Intelligence Solution to Support Recommendations from the Web", "abstract": "Big data are everywhere. World Wide Web and social networks are examples of these big data. They have become a vast data production and consumption platform, at which threads of data evolve from multiple devices, by different human interactions, over worldwide locations, under divergent distributed settings. Embedded in these big web data is implicit, previously unknown and potentially useful information and knowledge that awaited to be discovered. This calls for web intelligence solutions, which make good use of data science, data mining (especially, web mining) and social network analysis to discover useful knowledge and important information from the web (e.g., web of people/things). Such a web often consists of vertices (i.e., people/things) and edges (i.e., connections among people/things). When modeling a social network as a web of people, these edges can be undirected (e.g., for mutual friendships) or directed (e.g., for capturing a social entity who is following another social entity). In this paper, we present a web intelligence solution to discover interesting knowledge (e.g., most-followed people or most-referenced web pages) from these social connections. Due to the dynamic nature of the web, vertices and/or edges may be changed (e.g., added or deleted) over time. Hence, our solution is designed in such a way that it discovers knowledge not only from a static web but also from a dynamic web. Evaluation on real-life web data demonstrates the effectiveness and practicality of our solution for discovering knowledge and supporting recommendations from the web.", "venue": "WI/IAT", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2021-12-14", "journal": {"name": "IEEE/WIC/ACM International Conference on Web Intelligence and Intelligent Agent Technology"}, "authors": [{"authorId": "1726081", "name": "C. Leung"}, {"authorId": "2082997921", "name": "Evan W. R. Madill"}, {"authorId": "113805582", "name": "S. Singh"}], "citations": [{"paperId": "e8b4a0d4f5212bf51f6bc72b47aa6fb2b5d4b36a", "title": "A Big Data Science Solution for Transportation Analytics with Meteorological Data"}, {"paperId": "97a433ee35c70caebea9951e0b8bd9bfaf877881", "title": "Web Mining from Interpretable Compressed Representation of Sparse Web"}, {"paperId": "2d0a643701b63e060dc181f12b01be2900e7f13e", "title": "Trustworthy Explanations for Knowledge Discovered from E-Health Records"}, {"paperId": "b38235fd1746be6d89d10960549f2c78a9d263fb", "title": "Towards Trustworthy Artificial Intelligence in Healthcare"}]}
