{"paperId": "dc564b5fd7876d2d03910378edf11c01da3d0aa1", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Proposal for a Framework to Develop Sustainable Tourism on the Santurbán Moor, Colombia, as an Alternative Source of Income between Environmental Sustainability and Mining", "abstract": "The main goal of this paper was to propose a program to develop sustainable tourism at Santurbán moor in Colombia. This would open new paths toward economic growth for the communities inhabiting this sector who are currently facing a serious dilemma. First, the moor is an area of vital importance to the sustainability of more than two million people, who depend on water generated in the area. On the other hand, this land contains great mineral wealth and agricultural resources. This has generated an already long-lasting conflict of interest between environment conservation and the possible economic exploitation of the Santurbán moor through industrial mining. To this end, we conducted bibliographic research on sustainable tourism, specifically with scientific ends, that considered the potential of this area for its implementation. Prospective methodology was applied, beginning with the selection of a panel of experts to identify the most important external and internal variables that could affect the area. Then, Impact Matrix Cross-Reference Multiplication Applied to a Classification (MICMAC) software was used to identify the correlation between the different actors and their possible contributions. As a result of this research, a proposal is presented that is focused on the needs of the community living in the area, as supported by science and the academic community, and by the use of Industry 4.0 and related new technologies. This strategy could be used in other protected areas in Colombia, or throughout the world, that are currently being visited by tourists who, maybe unwillingly, are actually putting the sustainability of these areas at risk. In the future, this strategy will be consolidated and will lead to technological applications. This will allow tourists to enjoy protected places without threatening the conservation of these habitats.", "venue": "Sustainability", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-07-16", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "20517309", "name": "Marco Fidel Flórez"}, {"authorId": "2176941965", "name": "Jhon Fredys Linares"}, {"authorId": "2099545964", "name": "Eduardo Carrillo"}, {"authorId": "2176944824", "name": "Francisco Milton Mendes"}, {"authorId": "2124643117", "name": "Bruno de Sousa"}], "citations": [{"paperId": "a836497413ab31cad6385dd1759754320ab58cbd", "title": "Human health risk assessment due to mercury use in gold mining areas in the Ecuadorian Andean region."}, {"paperId": "fe7625d46fccbe8f419cc02b4d7c44f286257476", "title": "Determinants of Residents’ Support for Sustainable Tourism Development: An Empirical Study in Midyat, Turkey"}, {"paperId": "f9228820f9691f8b9653177c063d55023531dc5d", "title": "Geo-Environmental Assessment of Tourist Development and Its Impact on Sustainability"}]}
