{"paperId": "dc565b573a87d6c7f96366b3e47dbf5f87d3614a", "publicationVenue": {"id": "f1ab8d75-7f15-4bb4-ad88-e834ec6ed604", "name": "International Conference on Blockchain", "type": "conference", "alternate_names": ["ICBC", "IEEE Int Conf Blockchain Cryptocurrency", "IEEE International Conference on Blockchain and Cryptocurrency", "Int Conf Blockchain"]}, "title": "Scalable and Privacy-Focused Company-Centric Supply Chain Management", "abstract": "Blockchain technology promises to overcome trust and privacy concerns inherent to centralized information sharing. However, current decentralized supply chain management systems do either not meet privacy and scalability requirements or require a trustworthy consortium, which is challenging for increasingly dynamic supply chains with constantly changing participants. In this paper, we propose CCChain, a scalable and privacy-aware supply chain management system that stores all information locally to give companies complete sovereignty over who accesses their data. Still, tamper protection of all data through a permissionless blockchain enables on-demand tracking and tracing of products as well as reliable information sharing while affording the detection of data inconsistencies. Our evaluation confirms that CCChain offers superior scalability in comparison to alternatives while also enabling near real-time tracking and tracing for many, less complex products.", "venue": "International Conference on Blockchain", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-05-02", "journal": {"name": "2022 IEEE International Conference on Blockchain and Cryptocurrency (ICBC)", "pages": "1-5"}, "authors": [{"authorId": "144934794", "name": "Eric Wagner"}, {"authorId": "2786588", "name": "Roman Matzutt"}, {"authorId": "3425128", "name": "J. Pennekamp"}, {"authorId": "73767968", "name": "L. Bader"}, {"authorId": "2165869728", "name": "Irakli Bajelidze"}, {"authorId": "1719689", "name": "Klaus Wehrle"}, {"authorId": "2610427", "name": "Martin Henze"}], "citations": [{"paperId": "70651bc7484e36c4eee9200328b9989588c00dbd", "title": "BETA-FL: Blockchain-Event Triggered Asynchronous Federated Learning in Supply Chains"}, {"paperId": "5827e749b4125b3fc944c5fba56c9378fbd7ff28", "title": "An Interdisciplinary Survey on Information Flows in Supply Chains"}, {"paperId": "2fedef0bd648b0ad0a5067a04b5b5f000bf59173", "title": "Evolving the Digital Industrial Infrastructure for Production: Steps Taken and the Road Ahead"}]}
