{"paperId": "dc66136ffd22c9fcc0b436c0acef99265a39223d", "publicationVenue": {"id": "070a8b94-9234-4a39-bff0-23e0c6b74464", "name": "International Conference on Statistical and Scientific Database Management", "type": "conference", "alternate_names": ["Stat Sci Database Manag", "SSDBM", "Statistical and Scientific Database Management", "Int Conf Stat Sci Database Manag"], "url": "http://www.ssdbm.org/"}, "title": "Bi-Level Online Aggregation on Raw Data", "abstract": "In-situ processing has been proposed as a novel data exploration solution in many domains generating massive amounts of raw data, e.g., astronomy, since it provides immediate SQL querying over raw files. The performance of in-situ processing across a query workload is, however, limited by the speed of full scan, tokenizing, and parsing of the entire data. Online aggregation (OLA) has been introduced as an efficient method for data exploration that identifies uninteresting patterns faster by continuously estimating the result of a computation during the actual processing---the computation can be stopped as early as the estimate is accurate enough to be deemed uninteresting. However, existing OLA solutions have a high upfront cost of randomly shuffling and/or sampling the data. In this paper, we present OLA-RAW, a bi-level sampling scheme for parallel online aggregation over raw data. Sampling in OLA-RAW is query-driven and performed exclusively in-situ during the runtime query execution, without data reorganization. This is realized by a novel resource-aware bi-level sampling algorithm that processes data in random chunks concurrently and determines adaptively the number of sampled tuples inside a chunk. In order to avoid the cost of repetitive conversion from raw data, OLA-RAW builds and maintains a memory-resident bi-level sample synopsis incrementally. We implement OLA-RAW inside a modern in-situ data processing system and evaluate its performance across several real and synthetic datasets and file formats. Our results show that OLA-RAW chooses the sampling plan that minimizes the execution time and guarantees the required accuracy for each query in a given workload. The end result is a focused data exploration process that avoids unnecessary work and discards uninteresting data.", "venue": "International Conference on Statistical and Scientific Database Management", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2017-06-27", "journal": {"name": "Proceedings of the 29th International Conference on Scientific and Statistical Database Management"}, "authors": [{"authorId": "145215470", "name": "Yu Cheng"}, {"authorId": "47749019", "name": "Weijie Zhao"}, {"authorId": "2289824", "name": "Florin Rusu"}], "citations": [{"paperId": "0a4ca945b6c41d6568b7b6cf9649a15838613348", "title": "Studying Early Decision Making with Progressive Bar Charts"}, {"paperId": "586e881a0882cf9f585ba73be735d28b85f6423c", "title": "Online Aggregation based Approximate Query Processing: A Literature Survey"}, {"paperId": "76a57bec29a8e7cfa63cbc7e01efd5a97f5a378a", "title": "Array DBMS: Past, Present, and (Near) Future"}, {"paperId": "c0a95fc046be779625156b585cc86d723ca760e0", "title": "Approximate partition selection for big-data workloads using summary statistics"}, {"paperId": "e07f7b953ace121daed07224bcd38f3e9b226c72", "title": "Join on Samples: A Theoretical Guide for Practitioners"}, {"paperId": "843793928e308b5414d2883ac869e813ec16f65d", "title": "Progressive Data Science: Potential and Challenges"}, {"paperId": "56c51fa4a673b78b051a8b190983249f239bcb13", "title": "Online Aggregation: A Review"}, {"paperId": "2369409d61aceec439b3e66cfd28616c2e80ac1b", "title": "Distributed caching for processing raw arrays"}, {"paperId": "ddbc4a2ff4b210826c8a79a41f7c9fcd3e173ef6", "title": "ChronosDB: Distributed, File Based, Geospatial Array DBMS"}, {"paperId": "4c6f4328f5e0b3474dc611f2e55f7d44c7a577dc", "title": "Distributed Caching for Complex Querying of Raw Arrays"}, {"paperId": "e0cef440098e1a0f75870f307134fc1b21c18f5f", "title": "Code Generation Techniques for Raw Data Processing"}, {"paperId": "dda199bcb834114bcf1a7a58be5bb6e46a93888b", "title": "Interactive Data Exploration of Distributed Raw Files: A Systematic Mapping Study"}, {"paperId": "9f291d59b903630ab33c992b43139d6c97d46b04", "title": "Just-in-time Analytics Over Heterogeneous Data and Hardware"}]}
