{"paperId": "dc676d596b08e5005a41ee09624856e7440676fc", "publicationVenue": {"id": "96a67308-608a-4171-8e20-59377cac5d16", "name": "JURNAL SISTEM INFORMASI BISNIS", "type": "journal", "alternate_names": ["J SIST INF BISNIS", "Jurnal Sistem Informasi Bisnis", "J Sist Inf Bisnis"], "issn": "2088-3587", "url": "https://ejournal.undip.ac.id/index.php/jsinbis"}, "title": "Pengukuran Prestasi Belajar Mahasiswa Berdasarkan Prediksi Nilai Menggunakan General Linear Model", "abstract": "The Covid-19 pandemic is an international disaster experienced by almost all countries in the world. Several research results reveal the special impact of the pandemic on the education sector. Not only lecturers and students, but higher education providers also experience the same thing. Various adjustments were made so that all parties involved were able to adapt properly. It's been two years since the pandemic among us and during that time the learning process has continued. Based on this, several institutions began to take steps that raised questions about whether the learning achievement targets in each subject could still be achieved. This study aims to predict student grades using several machine-learning algorithms. The prediction results are a measure to find out whether learning outcomes have been achieved or not, if not achieved then additional steps need to be taken to help students. The results of this research are expected to help UNIS to prepare appropriate learning models for its students and ensure that all learning achievement targets are achieved. The research method used is a technique of machine learning. The results of this study indicate that the General Linear Model is a classification model with the best accuracy, which can be used to predict student achievement in certain classes based on the evaluation scores of the first structured activity (EKT1), midterm exams, grades (UTS), and second structured activity evaluation scores (EKT2). And it turns out that the UTS score has the greatest influence between EKT1 and EKT.", "venue": "JURNAL SISTEM INFORMASI BISNIS", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-21", "journal": {"name": "Jurnal Sistem Informasi Bisnis"}, "authors": [{"authorId": "2142175740", "name": "Dina Fityria Murad"}, {"authorId": "102916093", "name": "B. Wijanarko"}, {"authorId": "2143811269", "name": "Silvia Ayunda Murad"}, {"authorId": "1659537961", "name": "Vina Septiana Windyasari"}], "citations": []}
