{"paperId": "dc6b1649f54d01cb83405bf9d4b95370f546678c", "publicationVenue": {"id": "27c42e7e-162c-49a3-8c30-c36674fc2f61", "name": "Journal of Polytechnic", "type": "journal", "alternate_names": ["J Polytech"], "issn": "1302-0900", "url": "http://www.politeknik.gazi.edu.tr/"}, "title": "AFAD Kentsel Arama Kurtarma Akreditasyonu İçin Personel Seçim Problemi", "abstract": "Kentsel arama kurtarma (KAK) herhangi bir yapıda mahsur kalanların yerlerinin tespit edilmesi ve bulundukları alandan çıkarılmaları için yürütülen çalışmalardan oluşmaktadır. Bir afet ve acil durum gerçekleştiğinde çöken yapılardaki arama kurtarma (AK) faaliyetlerinin yürütülmesinde KAK ekipleri görev almaktadır. Teknik arama ve kurtarma operasyonlarının zorluğu nedeniyle bu operasyonlara özel olarak eğitilmiş personeller katılabilmektedir. Türkiye’de bu alanda eğitim almış ve yetkinlik kazanmış her bir personel AFAD Akreditasyon Sistemi’ne dahil edilmektedir. Sadece bu sisteme kayıtlı personeller AK operasyonlarında görev alabilmektedir. Bu çalışmada 2019 yılında yürürlüğe alınan AFAD Akreditasyon Sistemi’ne dahil edilecek personellerin değerlendirilmesi için bir çalışma yapılmıştır. Çalışmada yedi kriter belirlenmiştir. Bu kriterlerin ağırlıkları Analitik Hiyerarşi Prosesi (AHP) yöntemi ile hesaplanmıştır. Akreditasyon için çeşitli eğitimler almış ve farklı tecrübelere sahip on dört personel Preference Ranking Organization Method for Enrichment Evaluations (PROMETHEE) yöntemi ile değerlendirilmiştir. Bu değerlendirme sonucunda akreditasyon sistemine dahil edilecek en uygun personel seçilmiştir. Bu çalışma bilindiği kadarıyla bu alanda yapılan ilk çalışma olması ve afet yönetiminde AK personellerinin yetkinliklerinin değerlendirilmesi için öneride bulunması yönleriyle öne çıkmaktadır.", "venue": "Journal of Polytechnic", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-10-02", "journal": {"name": "Journal of Polytechnic"}, "authors": [{"authorId": "2100058231", "name": "Tuğba Danişan"}, {"authorId": "1828612", "name": "Tamer Eren"}], "citations": []}
