{"paperId": "dc6bf452277aea8bd0fef150aba7ca222398163d", "publicationVenue": {"id": "e3de7b7c-9551-4f2a-9f84-4939e87ff75d", "name": "International Conference on Model-Driven Engineering and Software Development", "type": "conference", "alternate_names": ["Int Conf Model Eng Softw Dev", "MODELSWARD"]}, "title": "Towards Ontology Driven Provenance in Scientific Workflow Engine", "abstract": ": Most workﬂow engines automatically capture and provide access to their workﬂow provenance, which enables its users to trust and reuse scientiﬁc workﬂows and their data products. However, the deed of instrumenting a workﬂow engine to capture and query provenance data is burdensome. The task may require adding hooks to the workﬂow engine, which can lead to perturbation in execution. An alternative approach is intelligent logging and a careful analysis of logs to extract critical information about workﬂows. However, rapid growth in the size of the log and the cloud-based multi-tenant nature of the engines has made this solution increasingly inefﬁcient. We have proposed ProvAnalyser, an ontology-based approach to capture the provenance of workﬂows from event logs. Our approach reduces provenance use cases to SPARQL queries over captured provenance and is capable of reconstructing complete data and invocation dependency graphs for a workﬂow run. The queries can be performed on nested workﬂow executions and can return information generated from one or various executions.", "venue": "International Conference on Model-Driven Engineering and Software Development", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"pages": "105-115"}, "authors": [{"authorId": "2289976", "name": "Anila Sahar Butt"}, {"authorId": "143785639", "name": "N. Car"}, {"authorId": "97748956", "name": "P. Fitch"}], "citations": [{"paperId": "67cb100c2863803db4b1d89e3c1ab3850954498c", "title": "Challenges of Provenance in Scientific Workflow Management Systems"}]}
