{"paperId": "dc6c200711f7a0667d1dfd67cfa4199b9445ab03", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "UAVs in Disaster Management: Application of Integrated Aerial Imagery and Convolutional Neural Network for Flood Detection", "abstract": "Floods have been a major cause of destruction, instigating fatalities and massive damage to the infrastructure and overall economy of the affected country. Flood-related devastation results in the loss of homes, buildings, and critical infrastructure, leaving no means of communication or travel for the people stuck in such disasters. Thus, it is essential to develop systems that can detect floods in a region to provide timely aid and relief to stranded people, save their livelihoods, homes, and buildings, and protect key city infrastructure. Flood prediction and warning systems have been implemented in developed countries, but the manufacturing cost of such systems is too high for developing countries. Remote sensing, satellite imagery, global positioning system, and geographical information systems are currently used for flood detection to assess the flood-related damages. These techniques use neural networks, machine learning, or deep learning methods. However, unmanned aerial vehicles (UAVs) coupled with convolution neural networks have not been explored in these contexts to instigate a swift disaster management response to minimize damage to infrastructure. Accordingly, this paper uses UAV-based aerial imagery as a flood detection method based on Convolutional Neural Network (CNN) to extract flood-related features from the images of the disaster zone. This method is effective in assessing the damage to local infrastructures in the disaster zones. The study area is based on a flood-prone region of the Indus River in Pakistan, where both pre-and post-disaster images are collected through UAVs. For the training phase, 2150 image patches are created by resizing and cropping the source images. These patches in the training dataset train the CNN model to detect and extract the regions where a flood-related change has occurred. The model is tested against both pre-and post-disaster images to validate it, which has positive flood detection results with an accuracy of 91%. Disaster management organizations can use this model to assess the damages to critical city infrastructure and other assets worldwide to instigate proper disaster responses and minimize the damages. This can help with the smart governance of the cities where all emergent disasters are addressed promptly.", "venue": "Sustainability", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-07-06", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "71940750", "name": "Hafiz Suliman Munawar"}, {"authorId": "48633912", "name": "Fahim Ullah"}, {"authorId": "1657644010", "name": "S. Qayyum"}, {"authorId": "2111181253", "name": "Sara Imran Khan"}, {"authorId": "1580471478", "name": "M. Mojtahedi"}], "citations": [{"paperId": "e46fe375ecb84929bf308e57e7941710f23cd6ab", "title": "Efficient CNN-based disaster events classification using UAV-aided images for emergency response application"}, {"paperId": "7589a3bbc43f82831fa306cb6351234594122ebd", "title": "Collaboration of Thermal Sensors and Drones in Fighting Wildfires; Mathematical Model and Heuristic Approach"}, {"paperId": "78f8ce89012b3283b9bd11278fe7cf2f305ba273", "title": "Multi-Trajectory Drone Surveillance: Amplifying Monitoring Capabilities in Disaster Management"}, {"paperId": "720d2b395b43b5070572333e71ae33ebef2be18e", "title": "Cloud-based disaster management architecture using hybrid machine learning approach in IoT"}, {"paperId": "2f21b4d2efc914f87415717146f8d3e6f5d4e5ff", "title": "Extending scene-to-patch models: Multi-resolution multiple instance learning for Earth observation"}, {"paperId": "e12f8068ea3f261c614661fcb809708121eb21bf", "title": "Performance Improvement of Deep Convolutional Networks for Aerial Imagery Segmentation of Natural Disaster-Affected Areas"}, {"paperId": "1c96b6fdda150ae0a8bd3cd596bc73c623dcea5e", "title": "Aerial Imagery of Natural Disaster-Affected Areas (AINDAA) Dataset for Semantic Segmentation and Natural Disaster Assessment"}, {"paperId": "5db069029b67059851de8b10055c6e2d6767ea2b", "title": "Nonlinear Fault-Tolerant Control of an Aerial Four-Rotor Vehicle"}, {"paperId": "3a002e0a9ece7039b10615e6033613f85406bcd0", "title": "Vehicle Detection and Classification via YOLOv8 and Deep Belief Network over Aerial Image Sequences"}, {"paperId": "eb6d64def899b0952b821bcf65a7e97687cf4057", "title": "A Connectivity Aware Path Planning for a Fleet of UAVs in an Urban Environment"}, {"paperId": "cefa1a4d192fd7a20adafe547a647faba92c8bfb", "title": "UAV Image Clustering Detection of Floating Objects on Floods using Hybrid Firefly Algorithm and Particle Swarm Optimization"}, {"paperId": "db3cbc7a93c9f7547962a57eeb278919ff3ffbac", "title": "Systematic Configuration for Hyperparameters Optimization in Transferring of CNN Model to Disaster Events Classification from UAV Images"}, {"paperId": "9cceb8547bb2ffeb49f1583fb8ce67e3c247a56f", "title": "UCTNet with Dual-Flow Architecture: Snow Coverage Mapping with Sentinel-2 Satellite Imagery"}, {"paperId": "74d971f10b200ad3f2330ccb8f65295910ff790e", "title": "MFEMANet: an effective disaster image classification approach for practical risk assessment"}, {"paperId": "a773dc95b2561e17d2482962774299bb2bcf1ae5", "title": "The State of the Art in Deep Learning Applications, Challenges, and Future Prospects: A Comprehensive Review of Flood Forecasting and Management"}, {"paperId": "6c6f22197cb6328214b55e525095e2273776586c", "title": "Environmentally-Aware and Energy-Efficient Multi-Drone Coordination and Networking for Disaster Response"}, {"paperId": "a18e6530362d1d82a8e9d3607d5d916ed0042ec4", "title": "Unmanned Aircraft Systems (UAS): Applications and Integration into Hazard Mitigation Planning"}, {"paperId": "ee6fdee3219493dc3702f003c6761b3a02a05197", "title": "Enhancing River Monitoring Embedded System using Time Redundancy Fault Tolerance to Resolve Transient Sensor Fault"}, {"paperId": "46dd67fa85d59caf90a0fa1a437d883fec420b74", "title": "Automatic flood detection by leveraging deep convolutional neural networks"}, {"paperId": "fbc6a5ba8b72480960c6923089ed98def347357f", "title": "Internet of Things based Natural Disaster Detection and Personalized Notification System"}, {"paperId": "82e272d705f02e219e908df790e971418977a586", "title": "A smart sustainable system for flood damage management with the application of artificial intelligence and multi-criteria decision-making computations"}, {"paperId": "605b8ced549a2a08691ab2111572a7f58d0e11a0", "title": "Pre-disaster Management based Machine Learning, IoT and Big Data: Survey and future direction"}, {"paperId": "7379ba5d260a28af486a92cf7b2f67945e4a57fa", "title": "Analysis of Aerial Images Using Deep Learning to Identify Critical Areas in Natural Disasters"}, {"paperId": "400285f6e8ff0ab6bdd2ce573b6fe1bc3fe7b36b", "title": "RETRACTED: Application of Convolutional Neural Network in Modern Technology Field and Improvement by Time-space Version"}, {"paperId": "dc3cef0915bfcd60c36e52ed50a7c25241eed3a6", "title": "A Systematic Review of Artificial Intelligence Applied to Facility Management in the Building Information Modeling Context and Future Research Directions"}, {"paperId": "87c2c617fc21e155ce04b8e73e58c04f589652b2", "title": "Machine Learning-Aided Operations and Communications of Unmanned Aerial Vehicles: A Contemporary Survey"}, {"paperId": "203b6285836dd92042064a412021050368e2003e", "title": "Ensuring Earthquake-Proof Development in a Swiftly Developing Region through Neural Network Modeling of Earthquakes Using Nonlinear Spatial Variables"}, {"paperId": "23bd12545ac5b33fb8ab6842a7b700788c0015eb", "title": "Method for the Automated Inspection of the Surfaces of Photovoltaic Modules"}, {"paperId": "94ce1437fbe84aac33b07e8d82308abf98bb83d0", "title": "UAV Image Analysis of Flooded Area Using Convolutional Neural Networks"}, {"paperId": "28a960a69be93b4cbace374917b5250673014248", "title": "Flying through the secure fog: A complete study on UAV‐Fog in heterogeneous networks"}, {"paperId": "dfce7a518aa0a0e75c7240bac377d26d3211cfe2", "title": "Water body classification from high-resolution optical remote sensing imagery: Achievements and perspectives"}, {"paperId": "3fc9b2357b81fe1b78dbe1ee30c74940dbddadfe", "title": "A closed-loop control architecture of UAV and WSN for traffic surveillance on highways"}, {"paperId": "471e888afaf13092b2ce83defcb70cbaf429c458", "title": "A hybrid novel framework for flood disaster risk control in developing countries based on smart prediction systems and prioritized scenarios."}, {"paperId": "39133947fa4aa4248adbd8729852242b61b0b7b0", "title": "Improving Smart Cities Safety using Sanity-Check Deep Neural Network Algorithm"}, {"paperId": "80e178a92869c693d6d574400bc9e9a5c83105ee", "title": "Extracting built-up areas from spectro-textural information using machine learning"}, {"paperId": "66619375a03bb9751dc86e2ec2654de67e2a0b7c", "title": "Automatic Target Detection from Satellite Imagery Using Machine Learning"}, {"paperId": "bf6b994a579b1a8b74dfd6d5ba3dc5888fd86188", "title": "Using Adaptive Sensors for Optimised Target Coverage in Wireless Sensor Networks"}, {"paperId": "a59f49d691c7b86d3d93e0dbe2c8abb4f0fb7e59", "title": "ADAPT: An Open-Source sUAS Payload for Real-Time Disaster Prediction and Response with AI"}, {"paperId": "5098bf49e37932cd4df0ce07018e4151b42c2790", "title": "Inspecting Buildings Using Drones and Computer Vision: A Machine Learning Approach to Detect Cracks and Damages"}, {"paperId": "50188173d1b50df800ed7da788b98493753a7864", "title": "Cloud- and Fog-Integrated Smart Grid Model for Efficient Resource Utilisation"}, {"paperId": "00aa9ecab8906642046c37df9f47b096fbfefbb3", "title": "Promoting Customer Loyalty and Satisfaction in Financial Institutions through Technology Integration: The Roles of Service Quality, Awareness, and Perceptions"}, {"paperId": "98c75c5c3c7290b0a086403bc48e317cd6513cc4", "title": "Toward an Integrated Disaster Management Approach: How Artificial Intelligence Can Boost Disaster Management"}, {"paperId": "6e53924e5a5d84a553fad3b207bd3ec698071cf8", "title": "Effects of COVID-19 on the Australian Economy: Insights into the Mobility and Unemployment Rates in Education and Tourism Sectors"}, {"paperId": "880e91b69114af329c5599a082249ad25f874abe", "title": "Towards Smart Healthcare: UAV-Based Optimized Path Planning for Delivering COVID-19 Self-Testing Kits Using Cutting Edge Technologies"}, {"paperId": "4af239ce746eda0fbe0504ba7992eb87b9170474", "title": "UAV Based Spatiotemporal Analysis of the 2019–2020 New South Wales Bushfires"}, {"paperId": "01367aa4453e3a2826b232f790086fda32c2fd0f", "title": "Urban Overheating Assessment through Prediction of Surface Temperatures: A Case Study of Karachi, Pakistan"}, {"paperId": "5c4cbb815b2de1d4b0d5265539f6c5925b7cf4cf", "title": "Flood detection using deep learning methods from visual images"}, {"paperId": "103183db2c81c5271229fbc456a1393fbe29e495", "title": "Identification of Small Objects in Satellite Image Benchmarks"}, {"paperId": null, "title": "Retraction Retraction: Application of Convolutional Neural Network in Modern Technology Field and Improvement by Time-space"}, {"paperId": "8befceecba35307858dceff210e1325a9f53cb88", "title": "Vehicle Detection and Classiﬁcation via YOLOv8 and Deep Belief Network over Aerial Image Sequences"}]}
