{"paperId": "dc76745e894fd20d6609d3740381d31acf95cdb0", "publicationVenue": {"id": "2c60bff9-794b-484c-83ab-9212eff9fc5a", "name": "Metabolites", "type": "journal", "issn": "2218-1989", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217885", "alternate_urls": ["https://www.mdpi.com/journal/metabolites", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217885"]}, "title": "Medicinal Plants, Phytochemicals and Regulation of the NLRP3 Inflammasome in Inflammatory Bowel Diseases: A Comprehensive Review", "abstract": "Ongoing research explores the underlying causes of ulcerative colitis and Crohn’s disease. Many experts suggest that dysbiosis in the gut microbiota and genetic, immunological, and environmental factors play significant roles. The term “microbiota” pertains to the collective community of microorganisms, including bacteria, viruses, and fungi, that reside within the gastrointestinal tract, with a particular emphasis on the colon. When there is an imbalance or disruption in the composition of the gut microbiota, it is referred to as dysbiosis. Dysbiosis can trigger inflammation in the intestinal cells and disrupt the innate immune system, leading to oxidative stress, redox signaling, electrophilic stress, and inflammation. The Nod-like Receptor (NLR) Family Pyrin Domain Containing 3 (NLRP3) inflammasome, a key regulator found in immunological and epithelial cells, is crucial in inducing inflammatory diseases, promoting immune responses to the gut microbiota, and regulating the integrity of the intestinal epithelium. Its downstream effectors include caspase-1 and interleukin (IL)-1β. The present study investigated the therapeutic potential of 13 medicinal plants, such as Litsea cubeba, Artemisia anomala, Piper nigrum, Morus macroura, and Agrimonia pilosa, and 29 phytocompounds such as artemisitene, morroniside, protopine, ferulic acid, quercetin, picroside II, and hydroxytyrosol on in vitro and in vivo models of inflammatory bowel diseases (IBD), with a focus on their effects on the NLRP3 inflammasome. The observed effects of these treatments included reductions in IL-1β, tumor necrosis factor-alpha, IL-6, interferon-gamma, and caspase levels, and increased expression of antioxidant enzymes, IL-4, and IL-10, as well as regulation of gut microbiota. These effects could potentially provide substantial advantages in treating IBD with few or no adverse effects as caused by synthetic anti-inflammatory and immunomodulated drugs. However, additional research is necessary to validate these findings clinically and to develop effective treatments that can benefit individuals who suffer from these diseases.", "venue": "Metabolites", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2023-06-01", "journal": {"name": "Metabolites", "volume": "13"}, "authors": [{"authorId": "14601952", "name": "R. Direito"}, {"authorId": "6105281", "name": "S. Barbalho"}, {"authorId": "31768841", "name": "M. Figueira"}, {"authorId": "2188932791", "name": "Giulia Minniti"}, {"authorId": "50350439", "name": "G. Carvalho"}, {"authorId": "2220015422", "name": "rbara de Oliveira Zanuso"}, {"authorId": "2155617565", "name": "Ana Rita de Oliveira dos Santos"}, {"authorId": "2169262661", "name": "Vict"}, {"authorId": "2220716894", "name": "ria Dogani Rodrigues"}, {"authorId": "15184856", "name": "R. Goulart"}, {"authorId": "152808961", "name": "É. Guiguer"}, {"authorId": "2220017784", "name": "Adriano Cressoni Ara"}, {"authorId": "2069666590", "name": "Jo"}, {"authorId": "35555024", "name": "Henrique Bosso"}, {"authorId": "2141194889", "name": "LUCAS FORNARI LAURINDO"}], "citations": [{"paperId": "6334699cc7132fc5bf448becbd3cb9a2c4aedecd", "title": "Antioxidant and Anti-Inflammatory Phytochemicals for the Treatment of Inflammatory Bowel Disease: A Systematic Review"}, {"paperId": "a79fe645f56c83476c1465c59ab152057edd87fa", "title": "Antcin-H, a natural triterpene derived from Antrodia cinnamomea, ameliorates dextran sulfate sodium-induced colitis in mice by inhibiting the NLRP3 inflammasome"}, {"paperId": "e815aee8fcc6bf298fd0bcca69c7c2c1055c6e0a", "title": "Immunological dimensions of neuroinflammation and microglial activation: exploring innovative immunomodulatory approaches to mitigate neuroinflammatory progression"}, {"paperId": "3e12afd1581a271f94be24fa2ab50b1e482f7102", "title": "Unveiling the anti-inflammatory potential of Acalypha indica L. and analyzing its research trend: digging deep to learn deep."}, {"paperId": "f4f7725748d14b77c01e460b5fc43db5d247d15e", "title": "Ferulic acid ameliorates ulcerative colitis in a rat model via the inhibition of two LPS-TLR4-NF-κB and NF-κB-INOS-NO signaling pathways and thus alleviating the inflammatory, oxidative and apoptotic conditions in the colon tissue"}]}
