{"paperId": "dc7ad1a0754902e5288e575fe62beb245ec31856", "publicationVenue": {"id": "c56116d3-225c-47c9-a4d9-f935e32f846c", "name": "IEEE Vehicular Technology Conference", "type": "conference", "alternate_names": ["IEEE Veh Technol Conf", "Veh Technol Conf", "VTC", "Vehicular Technology Conference"], "url": "http://vtsociety.org/"}, "title": "Roadside IoT Sensor-Based Crack Detection for Smart Roads", "abstract": "The rapid development of Internet of Things (IoT) technology can significantly promote the development and deployment of smart roads, enabling efficient and reliable road information sensing and analysis. As an important part of smart roads, timely and accurate detection of road cracks can improve service life of roads and reduce road management and operating costs. In this paper, we propose a vibration-sensor-based crack detection scheme for smart roads. In this scheme, by deploying the vibration sensor on the roadside, the changes in the vibration signals caused by the vehicle passing through the range of the sensor can be collected in real time. Then, considering that the seismic waves caused by vehicle driving are mostly distributed in the low-frequency range, we perform low-pass filtering on the collected vibration signals to retain the low-frequency vibration signals. After that, in order to distinguish the crack state of the road, we extract the vibration signal features of the normal road and the cracked road in the time domain, frequency domain and time-frequency domain, respectively. Based on the extracted features, we use logistic regression (LR), support vector machine (SVM) and random forest classification (RFC) machine learning algorithms to realize road crack detection. Finally, we conduct experiments to evaluate the performance of the proposed road crack detection scheme. The experimental results verify the high accuracy of the proposed scheme, and the accuracy of LR, SVM and RFC are 93.3%, 93.3% and 96.7%, respectively.", "venue": "IEEE Vehicular Technology Conference", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-10-10", "journal": {"name": "2023 IEEE 98th Vehicular Technology Conference (VTC2023-Fall)", "pages": "1-6"}, "authors": [{"authorId": "2274127976", "name": "Fendi Ma"}, {"authorId": "2275542886", "name": "Gang Wang"}, {"authorId": "3450079", "name": "Yilong Hui"}, {"authorId": "2068166835", "name": "Ruijin Sun"}, {"authorId": "2257046490", "name": "Changle Li"}, {"authorId": "2265884503", "name": "Guoqiang Mao"}], "citations": []}
