{"paperId": "dc967b697caec331ec7f0e95d23b1e98873b4c1e", "publicationVenue": {"id": "23ca7375-d98e-4508-8d80-c21bf09940c8", "name": "Data and Information Management", "alternate_names": ["Data Inf Manag"], "issn": "2543-9251", "url": "https://content.sciendo.com/view/journals/dim/dim-overview.xml"}, "title": "Big Data in Health Care: Applications and Challenges", "abstract": "Abstract The concept of Big Data is popular in a variety of domains. The purpose of this review was to summarize the features, applications, analysis approaches, and challenges of Big Data in health care. Big Data in health care has its own features, such as heterogeneity, incompleteness, timeliness and longevity, privacy, and ownership. These features bring a series of challenges for data storage, mining, and sharing to promote health-related research. To deal with these challenges, analysis approaches focusing on Big Data in health care need to be developed and laws and regulations for making use of Big Data in health care need to be enacted. From a patient perspective, application of Big Data analysis could bring about improved treatment and lower costs. In addition to patients, government, hospitals, and research institutions could also benefit from the Big Data in health care.", "venue": "Data and Information Management", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2018-12-01", "journal": {"name": "Data and Information Management", "pages": "175 - 197", "volume": "2"}, "authors": [{"authorId": "153158488", "name": "Liang Hong"}, {"authorId": "3443444", "name": "Mengqi Luo"}, {"authorId": "2108666258", "name": "Ruixue Wang"}, {"authorId": "50496081", "name": "Peixin Lu"}, {"authorId": "143844109", "name": "W. Lu"}, {"authorId": "2042804838", "name": "Long Lu"}], "citations": [{"paperId": "6eca900ddfc7d9aed53b61520747a67fe781f8ca", "title": "EHR-BERT: A BERT-based model for effective anomaly detection in electronic health records"}, {"paperId": "2037c33ffbe17c3b015149abff2b0b100d349d6e", "title": "Will it run?—A proof of concept for smoke testing decentralized data analytics experiments"}, {"paperId": "57535c9e0fbd264d29fdfaad8669b6b768896bb2", "title": "Forms of interaction between the National Medical Research Center for Anesthesiology and Critical Care Medicine (for adults) and the regions of the Russian Federation"}, {"paperId": "f195cbdf5916acd772aa2face61a9a994f31d4e9", "title": "A New Time-Aware LSTM based Framework for Multi-label Classification on Healthcare Data"}, {"paperId": "f8144d31ae35e39ad737cf9a3ef88774e3e76e70", "title": "FROOM: A Framework of Operators for OTF2 Modification"}, {"paperId": "9d6fefc2653d3358ba621ecb700ad5a01aa3e063", "title": "Big Data Processing for Bulgarian Healthcare - Smart Cards and Some Simulating Decisions"}, {"paperId": "b686c47376b3c9cd7708c01aac6612dab44f0d69", "title": "The impact of healthcare digitalization on the medical education curricula and programs: Points of convergence and divergence"}, {"paperId": "cff557a68cfdb404a7376bfa037ab9c435d3da23", "title": "Big Data Analytics: Challenges and Applications in Healthcare"}, {"paperId": "6a5d9c4b2a78ca95b9f7f07c694f69a699c81abc", "title": "FRAMH: A Federated Learning Risk-Based Authorization Middleware for Healthcare"}, {"paperId": "ab98f8c0628bc3dbd16883c3f29cde05ef98b42e", "title": "Big Data Intelligent Analysis Technology for the Study of Spatial and Time Trends in the Development of Large Cities"}, {"paperId": "5831029b68e60e27192a3c7a594ff0cb32b72a33", "title": "Evaluation of Open-Source Tools for Big Data Processing"}, {"paperId": "86a7f6d0da51e28ef8cba43d783b592e5b459dc7", "title": "The use of big data technology on the example of the State Budgetary Institution RD \"Republican Diagnostic Center\""}, {"paperId": "863e151bfed1b4cd673da79d01f2374fd48c8270", "title": "A Review of the Role and Challenges of Big Data in Healthcare Informatics and Analytics"}, {"paperId": "cb65a74cfb043c595569fe76c7eb163bdcc99c87", "title": "Automatic Array Transformation to Columnar Storage at Run Time"}, {"paperId": "72f2ca21ff143bad39909cde07aed42969d03934", "title": "A Data-Driven Intelligent System for Assistive Design of Interior Environments"}, {"paperId": "ecccef47a711d74c31026ce93473831e7b948b18", "title": "Thyroid Disease Prediction Using Selective Features and Machine Learning Techniques"}, {"paperId": "b7967741deb2410e58f01cadf924381a6b0d601c", "title": "PhenoBERT: A Combined Deep Learning Method for Automated Recognition of Human Phenotype Ontology"}, {"paperId": "8d96c3a16538fc90bd6f1980c3acfa92421d5dcc", "title": "Forecasting the Survival Rate of Breast Cancer Patients using a Supervised Learning Method"}, {"paperId": "e1a2389911d5fac8d7bb12e26e84bcad8c67d1da", "title": "Learning Methods of Business Intelligence and Group Related Diagnostics on Patient Management by Using Artificial Dynamic System"}, {"paperId": "3f3be96b341af70bc1e3e37a8c1a5e67d4a7f3af", "title": "Lower secondary school experiences as predictors of career aspirations toward engineering, and production and processing occupations"}, {"paperId": "8cad4421c420f72a45835a1d237e35a67a1e0240", "title": "Electronic health record to predict a heart attack used data mining with Naïve Bayes method"}, {"paperId": "d9824fb89ad3b2c915080541e7d3162de92277d9", "title": "Global trends in the digital transformation of the healthcare industry"}, {"paperId": "20a0b81e9fb9892d2785cbbe9843a755eac13efb", "title": "Surveillance in Next-Generation Personalized Healthcare: Science and Ethics of Data Analytics in Healthcare"}, {"paperId": "4e64ba1bf7cb6269f8a9eb9fe50e2068148f8462", "title": "Big data medical behavior analysis based on machine learning and wireless sensors"}, {"paperId": "e23631538f4e7f97dec0b7b244ee329a562ad46f", "title": "The role of the patient: from spectator to active player in the path of personal prevention and healthcare"}, {"paperId": "a13d4d0a05dc1b2e795fdc364543fd295a1a8789", "title": "Privacy of electronic health records: a review of the literature"}, {"paperId": "423cedc1b471c93eceee39fd0d29c9c9e731db03", "title": "Artificial Intelligence Segmented Dynamic Video Images for Continuity Analysis in the Detection of Severe Cardiovascular Disease"}, {"paperId": "aa18e038126c635345cadc2666adb01ff8ec4c2a", "title": "A cross-sectional study of the epidemic situation on COVID-19 in Gansu Province, China – a big data analysis of the national health information platform"}, {"paperId": "d2f67d184faec044524d878077b41fd6325b6d3a", "title": "The application and influence of big data in medicine"}, {"paperId": "0d519610cfeceb456cce775c96190fc7d381aa12", "title": "Big data analytics in healthcare − A systematic literature review and roadmap for practical implementation"}, {"paperId": "e6f3584c3074375d8bae39d909cfa10596b0376c", "title": "A systematic literature review of data science, data analytics and machine learning applied to healthcare engineering systems"}, {"paperId": "4a83a6019221d01adbd96288f86a5d4d700c429a", "title": "IoTPulse: machine learning-based enterprise health information system to predict alcohol addiction in Punjab (India) using IoT and fog computing"}, {"paperId": "247883a2aec277dab1344085b0de04894b58bc51", "title": "Development of Novel Big Data Analytics Framework for Smart Clothing"}, {"paperId": "abf19aaa668fd2c65ff221d152474148a63cb879", "title": "Beyond Information Organization and Evaluation: How Can Information Scientists Contribute to Independent Thinking?"}, {"paperId": "5f50552ccadf33ca927d49dd5eb094926dc1a96b", "title": "Where Is the Health Informatics Market Going?"}, {"paperId": "f2391d818efa5830dac5180a3c77f529888943f6", "title": "Big Data Analytics and Processing Platform in Czech Republic Healthcare"}, {"paperId": "112737f53c1b34f956a990d263f5ed9c5aa7d529", "title": "Big Data Architecture in Czech Republic Healthcare Service: Requirements, TPC-H Benchmarks and Vertica"}, {"paperId": "72c13b4e0c466ca57b447ca8d7e75bd8e695df68", "title": "A Systematic Review of Knowledge Visualization Approaches Using Big Data Methodology for Clinical Decision Support"}, {"paperId": "7412b56b5bb447b60c35777fc7bc770d4c024cbd", "title": "Context-Enriched Regular Human Behavioral Pattern Detection From Body Sensors Data"}, {"paperId": "b28ba66261ddfda6ef10a016d4abb1100af773c3", "title": "Leveraging Big Data Analytics for Enhanced Clinical Decision-Making in Healthcare"}, {"paperId": "103345b2ab7bec82023f614a4822f84cc1cf22e2", "title": "Secure EMR Classification and Deduplication using MapReduce"}, {"paperId": "a9885cd0870802d2d792049264e48cf9052fca24", "title": "Artificial Intelligence in Healthcare Databases"}, {"paperId": "655f5286510bbaaf6c2c18a9b5e8df72e905a360", "title": "Big data analysis for studying spatiotemporal trends in the sustainable development of large cities"}, {"paperId": "102bcd578462c429ffb8a999406e1a80ec61a066", "title": "Healthcare and medical Big Data analytics"}, {"paperId": "cd6b74a4151f6be8d9ec613baa3f2f6b4c081feb", "title": "Challenges and solutions for big data in personalized healthcare"}, {"paperId": "4e411389eaa2a7514838fe8e486037e33b074baf", "title": "Big Data Analytics and Cognitive Computing in Smart Health Systems"}, {"paperId": "8dc0fbe59a5a321e730b1bc5ac37c22dbcc4f06e", "title": "Applications of Character Computing From Psychology to Computer Science"}, {"paperId": "7743c57bbc1252f876e647bc404baedb70f6949c", "title": "QoS Optimization in Internet of Medical Things for Sustainable Management"}, {"paperId": "889d368ee4fb16f17b8aab07fd8bed060f9c55b0", "title": "The influence of Big data concept on future tendencies in payment systems"}, {"paperId": "b5e6d3064e340efc66e394d65b8a5589337446c7", "title": "PREDICTIVE MODELLING OF BRAIN TUMOR DETECTION USING DEEP LEARNING"}, {"paperId": "cfc10b5a97dcec6ee3dbd412cafb0b4486fb8387", "title": "A SWOT Analysis of Big Data in Healthcare"}]}
