{"paperId": "dc9c8f5ef755b3c2bbca8c5e732376f2616de263", "publicationVenue": {"id": "b63861a6-ab0a-47a4-9f6c-accf03b5a180", "name": "Iberian Conference on Information Systems and Technologies", "type": "conference", "alternate_names": ["CISTI", "Iber Conf Inf Syst Technol"]}, "title": "A performance study on different data load methods in relational databases", "abstract": "Alongside with new cloud system emerging, legacy systems inside organizations are being migrated. With them, databases, and all stored data, which might variate from some GB to large amounts of TB. These systems migrations pose considerable problems - data export method, import method, consumed time, consistency, and so on - the so-called legacy system migration opens a new research topic, concerning how to migrate data timely efficient. The same problem, loading data, can be applied to ETL processes, with particular focus to the Load phase, which needs to be performed as fast as possible. This paper provides a brief review of different relational databases load methods and compares their performance. Experimental results show that despite the different available methods to efficiently load data (without losing information), performance is severely affected, presenting variations that can go from seconds to hours/days depending on the used strategy", "venue": "Iberian Conference on Information Systems and Technologies", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference", "Review"], "publicationDate": "2019-06-01", "journal": {"name": "2019 14th Iberian Conference on Information Systems and Technologies (CISTI)", "pages": "1-7"}, "authors": [{"authorId": "152307764", "name": "Pedro Martins"}, {"authorId": "2790411", "name": "Filipe Sá"}, {"authorId": "2425638", "name": "C. Wanzeller"}, {"authorId": "144069696", "name": "Maryam Abbasi"}], "citations": [{"paperId": "cec2bb51e2991f4ec2f3a643c8893e0888647a6b", "title": "Concurrency Performance Analysis on MySQL Relational Database Management System in Virtual Machine Environment"}]}
