{"paperId": "dcabdd8e033a063da069422c053032b651044eb8", "publicationVenue": {"id": "e9a44b89-3d84-4bff-8c78-c53cd2ad7cf8", "name": "Foods", "type": "journal", "issn": "2304-8158", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-277853", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-277853", "https://www.mdpi.com/journal/foods/about", "https://www.mdpi.com/journal/foods"]}, "title": "How Chemometrics Can Fight Milk Adulteration", "abstract": "Adulteration and fraud are amongst the wrong practices followed nowadays due to the attitude of some people to gain more money or their tendency to mislead consumers. Obviously, the industry follows stringent controls and methodologies in order to protect consumers as well as the origin of the food products, and investment in these technologies is highly critical. In this context, chemometric techniques proved to be very efficient in detecting and even quantifying the number of substances used as adulterants. The extraction of relevant information from different kinds of data is a crucial feature to achieve this aim. However, these techniques are not always used properly. In fact, training is important along with investment in these technologies in order to cope effectively and not only reduce fraud but also advertise the geographical origin of the various food and drink products. The aim of this paper is to present an overview of the different chemometric techniques (from clustering to classification and regression applied to several analytical data) along with spectroscopy, chromatography, electrochemical sensors, and other on-site detection devices in the battle against milk adulteration. Moreover, the steps which should be followed to develop a chemometric model to face adulteration issues are carefully presented with the required critical discussion.", "venue": "Foods", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2022-12-27", "journal": {"name": "Foods", "volume": "12"}, "authors": [{"authorId": "8485668", "name": "S. Grassi"}, {"authorId": "12468176", "name": "Maria Tarapoulouzi"}, {"authorId": "1438202895", "name": "A. D’Alessandro"}, {"authorId": "88761150", "name": "S. Agriopoulou"}, {"authorId": "107906319", "name": "L. Strani"}, {"authorId": "47992968", "name": "T. Varzakas"}], "citations": [{"paperId": "51d721a3e207713cf74cf971675009fd7dbf0e77", "title": "Discrimination of Cheese Products Regarding Milk Species’ Origin Using FTIR, 1H-NMR, and Chemometrics"}, {"paperId": "bacce85ad83405427a84454b55ac9fa3a0498da6", "title": "Rapid analysis technologies with chemometrics for food authenticity field: A review"}, {"paperId": "995f4e86cdfc5baeddfd3ba9a864fd2c9089748b", "title": "E-sensing systems for shelf life evaluation: A review on applications to fresh food of animal origin"}, {"paperId": "8011fbecb69ec2981e2b01fc152bb31036113ccf", "title": "Sensing approaches toward detection of urea adulteration in milk"}, {"paperId": "c70354d0db72db3d8e1c3227e5020fb580cec1e8", "title": "Spectral and chromatographic analysis of food-related components produced by bacteria, plants, and fungi. A review"}, {"paperId": "444161cc1ee3a0ae448a53f8ce3ed65c50531a2c", "title": "Cheese and Milk Adulteration: Detection with Spectroscopic Techniques and HPLC: Advantages and Disadvantages"}, {"paperId": "a2a686719baddea8b065879a5d98d9e350679268", "title": "Recent Advances in the Determination of Milk Adulterants and Contaminants by Mid-Infrared Spectroscopy"}, {"paperId": "50bd50dd3d1c6b1c3148c9490e50c619760b20d4", "title": "Application of ATR-FTIR Incorporated with Multivariate Data Analysis for Discrimination and Quantification of Urea as an Adulterant in UHT Milk"}, {"paperId": "455480a27cc8dac7e6feb84cce778fd8bc622b37", "title": "Implementation of Chemometrics and Other Techniques as Means of Authenticity and Traceability to Detect Adulteration in Foods for the Protection of Human Health"}]}
