{"paperId": "dcb5c4a380bdff1e752b4c707f4c2c3c9c279c6c", "publicationVenue": {"id": "6336131c-2f71-4f61-bc3b-1bf31ec9fa3d", "name": "International Conference on Computing for Sustainable Global Development", "type": "conference", "alternate_names": ["INDIACom", "Int Conf Comput Sustain Glob Dev"]}, "title": "Implementation of Internet of Things and Nanobiotechnology in Medical Sector", "abstract": "Nanobiotechnology is broadly used in the realm of medicine as nanomedicine. There may be uses for some nanoparticles in state-of-the-art diagnostic tools, imaging and methodology, pharmaceutical items, biomedical implants, and tissue engineering. Nanobiotechnology now allows for the innovative and safer administration of high-toxicity treatments like chemotherapy for cancer. Furthermore, wearable technology can identify critical alterations in vital signs, cancer cell states and infections that are actually occurring in the body. Likewise, the Internet of Things (IoT) has also been widely used to interconnect available medical resources and offer elderly and patients with chronic illnesses reliable, efficient and smart healthcare services. This study covers nanobiotechnology applications in the medical field. The class, features and resources of nanobiotechnology for medicine are also briefed. This study also identifies the intelligentization trend and future research directions in the healthcare industry while summarizing IoT applications in that sector. The current study includes many potential Internet of Things and nanobiotechnology applications in the medical field. As a result, the study offers a brief and well-organized report on both nanobiotechnology and the Internet of Things which should be helpful to researchers, engineers and scientists for future research initiatives.", "venue": "International Conference on Computing for Sustainable Global Development", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-03-15", "journal": {"name": "2023 10th International Conference on Computing for Sustainable Global Development (INDIACom)", "pages": "1026-1030"}, "authors": [{"authorId": "35159625", "name": "J. Chohan"}, {"authorId": "1988730999", "name": "Raman Kumar"}, {"authorId": "2155583971", "name": "Sandeep Singh"}, {"authorId": "40602626", "name": "Bhawna Goyal"}, {"authorId": "34587136", "name": "Ayush Dogra"}], "citations": []}
