{"paperId": "dcc8de8b9747b2ce6e69488b6df56504600f7012", "publicationVenue": {"id": "58668f21-815a-4b30-af06-ced21bfb2fa6", "name": "Earth and Space Science", "type": "journal", "alternate_names": ["Earth Space Sci"], "issn": "2333-5084", "url": "http://agupubs.onlinelibrary.wiley.com/agu/journal/10.1002/(ISSN)2333-5084/", "alternate_urls": ["https://agupubs.onlinelibrary.wiley.com/journal/23335084"]}, "title": "Detecting and Evaluating Dust‐Events in North China With Ground Air Quality Data", "abstract": "We propose a dust‐event detection and tracking procedure based on air quality data from the ground monitoring network by detecting temporal and spatial change‐points in PM10 concentration. It supplements the existing remote sensing based approach with high temporal resolution and better weather adaptivity. Applications of the procedure on the labeled data showed its having high discriminating power for dust events, pollution events, and clean periods. Our study finds changing correlation patterns between PM10 and other air pollutants at the start of the dust events, which are utilized to enhance the discriminating power of the dust‐event detection procedure. The detection and tracking procedure allows the construction of transport networks of the dust‐events as well as the identification of the source regions and the transportation pattern, and assess the intensity and severity of the dust‐events in North China. Our analysis find the dust‐events contributed to 23.3%–34.6% for PM10 and 18.2–33.2% for PM2.5 in the source regions and 2.0%–7.3% and 0.8%–4.0%, respectively, in the down‐stream provinces in the spring season from 2015 to 2020.", "venue": "Earth and Space Science", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-11-21", "journal": {"name": "Earth and Space Science", "volume": "9"}, "authors": [{"authorId": "1397385951", "name": "Peifeng Tong"}, {"authorId": "2145481122", "name": "S. Chen"}, {"authorId": "2048258732", "name": "Chenguang Tang"}], "citations": [{"paperId": "b3a0bcd4374dd422ae696c7cf433efeaa0367079", "title": "Evaluation and Projection of Gale Events in North China"}, {"paperId": "c623027211e995d9f222b4b7b5ef5edc2bd5efef", "title": "Long-term characteristics of dust aerosols over central China from 2010 to 2020 observed with polarization lidar"}, {"paperId": "047950cca20b958faf78e67ac4b34ef84cb676e3", "title": "Air pollution and its associated health risks before and after COVID-19 in Shaanxi Province, China"}, {"paperId": "153fe14c6c32b3db0845850dfba0b40e1416ebd1", "title": "Impact of Sea Surface Temperature Variability at Different Ocean Basins on Dust Activities in the Gobi Desert and North China"}, {"paperId": "be827f5d7bda8ecf9ecf837804252224fa714a9a", "title": "Mega Asian dust event over China on 27–31 March 2021 observed with space-borne instruments and ground-based polarization lidar"}]}
