{"paperId": "dccead8ec56f1dcb17d2dcecbcfbe396900fdce4", "publicationVenue": {"id": "f32b7322-b69c-4e63-801d-8f50784ef778", "name": "Computational Intelligence and Neuroscience", "type": "journal", "alternate_names": ["Comput Intell Neurosci"], "issn": "1687-5265", "url": "https://www.hindawi.com/journals/cin/"}, "title": "Research on the Construction of College Football Classroom Practice Teaching System Model Based on Big Data Analysis", "abstract": "With the rapid development of information technology, the traditional single classroom teaching and passive learning methods of students can no longer meet the needs of all-round development of college students, and its urgent need to integrate with information technology. This article is aimed at the problem of lagging feedback on training results in the traditional teaching model, teachers' active control, students' passive obedience, ignoring the development of students' personality in college football classrooms, and the inability to carry out personalized tracking and quantitative improvement of the training process of students' related abilities. We constructed a college football classroom practice teaching system model based on big data analysis from the perspectives of establishing big data teaching resources, and implementing personalized resource recommendation, optimizing the traditional teaching process, integrating quantitative training, measurement and recording, implementing quantitative intervention, etc. Colleges and universities have carried out experimental observations. Through continuous observation and comparison, it is found that college football classroom practice teaching under big data is more conducive to improving students' football skills and theoretical level than traditional teaching. This model makes full use of the advantages of big data and the combination of practical teaching methods, which can bring students a different learning experience and obtain good teaching effects. It has guiding and reference significance for college football practical teaching.", "venue": "Computational Intelligence and Neuroscience", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-02-14", "journal": {"name": "Computational Intelligence and Neuroscience", "volume": "2022"}, "authors": [{"authorId": null, "name": "Bo Zhang"}, {"authorId": "2053309113", "name": "Wei Ren"}], "citations": [{"paperId": "9a1a3e85d47904a9cc4a1bcc473b81c02947a181", "title": "Strategy for improving the football teaching quality by AI and metaverse-empowered in mobile internet environment"}]}
