{"paperId": "dccfbe93c99dc014464b070ac009a1b59853a06f", "publicationVenue": null, "title": "User-Centred Design of Multidisciplinary Spatial Data Platforms for Human-History Research", "abstract": "The role of open spatial data is growing in human-history research. Spatiality can be utilized to bring together and seamlessly examine data describing multiple aspects of human beings and their environment. Web-based spatial data platforms can create equal opportunities to view and access these data. In this paper, we aim at advancing the development of user-friendly spatial data platforms for multidisciplinary research. We conceptualize the building process of such a platform by systematically reviewing a diverse sample of historical spatial data platforms and by piloting a user-centered design process of a multidisciplinary spatial data platform. We outline (1) the expertise needed in organizing multidisciplinary spatial data sharing, (2) data types that platforms should be able to handle, (3) the most useful platform functionalities, and (4) the design process itself. We recommend that the initiative and subject expertise should come from the end-users, i.e., scholars of human history, and all key end-user types should be involved in the design process. We also highlight the importance of geographic expertise in the process, an important link between subject, spatial and technical viewpoints, for reaching a common understanding and common terminology. Based on the analyses, we identify key development goals for spatial data platforms, including full layer management functionalities. Moreover, we identify the main roles in the user-centered design process, main user types and suggest good practices including a multimodal design workshop.", "venue": "ISPRS Int. J. Geo Inf.", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-07-08", "journal": {"name": "ISPRS Int. J. Geo Inf.", "pages": "467", "volume": "10"}, "authors": [{"authorId": "50819838", "name": "Meeli Roose"}, {"authorId": "34773885", "name": "Tua Nylén"}, {"authorId": "2266842", "name": "H. Tolvanen"}, {"authorId": "6533093", "name": "O. Vesakoski"}], "citations": [{"paperId": "255df1accd8e5e4d56c33bfa9b93ef5dd1c10e49", "title": "Utilizing data platform management to implement “5W” analysis framework for preventing and controlling corruption in grassroots government"}, {"paperId": "b00540fd06d2992dc7e37d326675e168ac03b813", "title": "Redesigning Graphical User Interface of Open-Source Geospatial Software in a Community-Driven Way: A Case Study of GRASS GIS"}, {"paperId": "a97bb824ca4e405b2bef8df5ecb4d722027e5b8b", "title": "Use of the Karelian language online: websites in Karelian"}, {"paperId": "1cf14826357a7d6cc1d2e572adf8e35c0dad6eaf", "title": "User-Centered Design as a Method for Engaging Users in the Development of Geovisualization: A Use Case of Temperature Visualization"}, {"paperId": "449c9f0bc0f965a66bb91f5d98fe699d856d5afd", "title": "Best practices for spatial language data harmonization, sharing and map creation—A case study of Uralic"}, {"paperId": "0b7f3ed8d9e313c4f9fe7b304926b7fe616a73ee", "title": "THE USE OF THE KARELIAN LANGUAGE ONLINE: CURRENT TRENDS AND CHALLENGES"}]}
