{"paperId": "dcdcc0fe44585d5028ef18542c5971dcb6e94c4a", "publicationVenue": {"id": "b210fd3d-11d7-478e-a0aa-7e3d2a4f482d", "name": "IEEE Sensors Journal", "type": "journal", "alternate_names": ["IEEE Sens J"], "issn": "1530-437X", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=7361", "alternate_urls": ["http://ieee-sensors.org/sensors-journal/", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?puNumber=7361", "http://www.ieee-sensors.org/journals", "https://ieee-sensors.org/sensors-journal/"]}, "title": "Efficient Security and Privacy of Lossless Secure Communication for Sensor-Based Urban Cities", "abstract": "Urban sensing systems enable individuals, smart cities, and communities to bring together and share information with unprecedented speed and accuracy. The rapid development of information technology has enabled contact with digital data through the Internet of Things (IoT), smart cities, and the Internet of Medical Things (IoMT). Sensor-based urban smart cities are a new paradigm. A smart city monitors the physical world in real time and provides smart services to residents in healthcare, transportation, the environment, and energy. Therefore, there is an increasing requirement for a computationally efficient and secure approach for the sensor-based urban city paradigm. We proposed an efficient lossless data-hiding scheme based on histogram transformation using dynamic quadtree ${N}$ -bit localization for urban sensing networks. The proposed scheme is ideally suited for the security, privacy, and exchange of information in urban sensing networks. The system’s valuation and the comparative study with the existing scheme show that the proposed method is secure and more efficient and obtains high visual qualities (52.23 dB), structural similarity index (SSIM), and embedding capacity ratios.", "venue": "IEEE Sensors Journal", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-03-01", "journal": {"name": "IEEE Sensors Journal", "pages": "5549-5560", "volume": "24"}, "authors": [{"authorId": "145642427", "name": "Rashid Abbasi"}, {"authorId": "47311590", "name": "A. Bashir"}, {"authorId": "2151985754", "name": "Abdul Mateen"}, {"authorId": "2113925981", "name": "Farhan Amin"}, {"authorId": "2163097925", "name": "Yuan Ge"}, {"authorId": "9430716", "name": "Marwan Omar"}], "citations": [{"paperId": "cd69e482dda3144c720a15490fd1c2c0ac5a1c64", "title": "Vehicular Edge-Based Approach for Optimizing Urban Data Privacy"}]}
