{"paperId": "dcf322c9c1a0059329fd6ca4118184315b32f646", "publicationVenue": {"id": "c4abe38d-d301-4739-a53e-272924a513f8", "name": "World Journal of Dentistry", "type": "journal", "alternate_names": ["World J Dent"], "issn": "0976-6006", "url": "http://www.wjoud.com/"}, "title": "Usefulness of Artificial Intelligence-based Virtual Assistants in Oral and Maxillofacial Radiology Report Writing", "abstract": "bstrAct Aim and objective: This study aimed to evaluate the usefulness of four voice-based virtual assistants in oral and maxillofacial radiology report writing. Materials and methods: A questionnaire consisting of 100 questions was queried to 4 commercially available voice-based virtual assistants namely Alexa, Siri, Cortana, and Google Assistant. The questions were divided based on five categories. The categorization was based on the frequency and reason for a radiologist to refer to either a textbook or an online resource before diagnosing and finalizing a radiology report. Two evaluators queried the devices and rated them on a 4-point modified Likert scale. Results: In the order of efficiency, Google Assistant was the most efficient followed by Cortana, Siri, and Alexa. A significant difference between the examiners was observed with Cortana in anatomy, dental anatomy, differential diagnosis, and pathology. Conclusion: In this small study that queried only four voice-powered virtual assistants, it showed that they were helpful and convenient in responding to questions regarding oral and maxillofacial radiology. But there is significant scope for expansion in the number of topics and type of information delivered before these can be used specifically in oral and maxillofacial radiology report writing. Clinical significance: Oral radiologists often gather additional and updated information regarding various topics like disease-specific features, genetic mutations, and differential diagnoses which they typically get from a textbook or a website. Artificial intelligence-based virtual assistants offer radiologists a simple voice-activated interface to gather this information and can immensely help when additional information is required.", "venue": "World Journal of Dentistry", "year": 2021, "fieldsOfStudy": ["Psychology"], "publicationTypes": null, "publicationDate": "2021-04-01", "journal": {"name": "World Journal of Dentistry"}, "authors": [{"authorId": "4166515", "name": "J. Mago"}, {"authorId": "2122184018", "name": "K. S. Muttanahally"}, {"authorId": "50989133", "name": "Rutvi Vyas"}, {"authorId": "5029141", "name": "Aditya Tadinada"}], "citations": [{"paperId": "a12ed6641c3bed878d6c1dc4ed42205b3704614f", "title": "The Potential Usefulness of ChatGPT in Oral and Maxillofacial Radiology"}]}
