{"paperId": "dcf5427ce326a86fe8c54f3eea48ac48350ef75c", "publicationVenue": null, "title": "ABNORMAL EVENT DETECTION IN INDOOR ENVIRONMENT BASED ON ACOUSTIC SIGNAL PROCESSING", "abstract": "Alert the public about emergencies is to bring to public alerts and emergency information on dangers arising from the threat or occurrence of emergency situations of natural and technogenic character, as well as the conduct of hostilities or owing to these actions, the rules of behavior of the population and the need for protection activities. The aim of the work is to develop a method for detecting the sounds of critical situations in the sound stream. In this paper, the term \"critical situation\" is understood as an event, the characteristic sound signs of which can speak of acoustic artifacts (a shot, a scream, a glass strike, an explosion, a siren, etc.). The developed method allows you to classify events into two groups: normal (for example, street noise) and critical situations (for example, an explosion, a scream, a shot). To determine events, machine learning is used, namely the Support Vector Machine method, which solves classification and regression problems by constructing a nonlinear plane separating the solutions. SVM has a fairly wide application in data classification and shows good results in event detection problems. As part of the work, the minimum set of features for the machine learning model was determined, small training and test samples were formed, and a method was developed that classifies normal and abnormal events.", "venue": "", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "2131192277", "name": "Rustam Abdrakhmanov"}, {"authorId": "119718295", "name": "Abdimukhan Tolep"}, {"authorId": "2129776386", "name": "Zhazira Kozhamkulova"}, {"authorId": "2147184804", "name": "Nurlan Narbekov"}, {"authorId": "2147184892", "name": "Nurbai Dossanov"}, {"authorId": "104181001", "name": "B. Yeskarayeva"}], "citations": [{"paperId": "2d59a39a7f927612146b240a56cda84dbb445ce9", "title": "IoT Network Intrusion Detection Using Machine Learning Techniques"}, {"paperId": "7362789cd702013ac178a09d3732e1ffdb3b0f1e", "title": "IoT Network Intrusion Detection: A Brief Review"}, {"paperId": "21ebb193576d421f5d1da0336fa1f1791ebd4da1", "title": "APPLYING AUGMENTED AND VIRTUAL REALITY IN ONLINE AND OFFLINE EDUCAION"}]}
