{"paperId": "dcfe69ed267aecfdf3fdace4283488d735e5dcbb", "publicationVenue": null, "title": "Immersive Technologies and Smart Cities in ASEAN", "abstract": "Immersive technologies can have a huge impact on the social structure of a country, opening new opportunities and new scenarios. Through the exploitation and synergy of peculiar disruptive technologies, we are witnessing a capillary development of smart cities and collaborative platforms to facilitate the citizens' lives. The Association of South-East Asian Nations (ASEAN) has the highest growth rate for the intelligent exploitation of technologies. This chapter aims to outline the real impact of technology in the social and business environment by redesigning the continuous disruptive technologies and the different changes of perspective in the relationship between the individual and social sphere. The originality of the chapter lies in analyzing the potential of the smart city to implement a sustainable and collaborative urban development plan capable of spreading technological entrepreneurship and digital innovation.", "venue": "", "year": 2021, "fieldsOfStudy": ["Engineering"], "publicationTypes": null, "publicationDate": null, "journal": {"name": "", "pages": "50-70", "volume": ""}, "authors": [{"authorId": "100850399", "name": "D. Magni"}, {"authorId": "123481499", "name": "Rossana Piccolo"}, {"authorId": "97494986", "name": "V. Scuotto"}, {"authorId": "38346225", "name": "Armando Papa"}, {"authorId": "145036277", "name": "M. Giudice"}], "citations": [{"paperId": "ef7111cfc7d4bb3eba0818b70b89d86e0d88b0b1", "title": "The impact of innovation failure: Entrepreneurship adversity or opportunity?"}, {"paperId": "3728b2b1bb3f1baf20c736b35a3e1c873dcb3ffa", "title": "Knowledge development in non-fungible tokens (NFT): a scoping review"}, {"paperId": "7a159d77a64ba528846738d88219a06369b6558d", "title": "To Align Technological Advancement and Ethical Conduct: An Analysis of the Relationship between Digital Technologies and Sustainable Decision-Making Processes"}, {"paperId": "3330e3eafd8c8412d7c845b397584228b2e0141b", "title": "Adopting new technologies during the crisis: An empirical analysis of agricultural sector"}, {"paperId": "2949e003a800ffcce55254d28b60a3ce2d3e387d", "title": "Exploring the journey of Responsible Business Model Innovation in Asian companies: A review and future research agenda"}, {"paperId": "4f8959a820d154e460028188da29ce4769eda535", "title": "Consumers’ innovativeness and conspicuous consumption orientation as predictors of environmentalism: an investigation in the context of smart mobility"}]}
