{"paperId": "dd093e8f7ee820a56cc8bf5a73b549903121c94d", "publicationVenue": {"id": "ae87fe2c-526b-421a-81ed-dada6c150edd", "name": "International Journal of Intelligent Engineering and Systems", "type": "journal", "alternate_names": ["Int J Intell Eng Syst"], "issn": "1882-708X"}, "title": "A Min-Max Workload Scheduling Technique Using Soft-Computing Approach in Multi-Cloud Platform", "abstract": ": Maximizing resource utilization by minimizing service level agreement (SLA) violation is considered to be extremely difficult process for scheduling of realtime workload on multi-cloud platform. In particular the proposed work considers both energy and performance as SLA minimization constraint for scheduling of workload in multi-cloud platform. The scheduling optimization of SLA minimization is done as single objective function using dragonfly soft computing approach. Further, the scheduling optimization of min-max is done as multi-objective for maximizing resource utilization with minimal SLA violation using dragonfly soft computing approach. The results show that the min-max workload scheduling (MMWS) has improved the resource utilization by 16.02%, 7.92%, and 2.52% respectively for montage workload and 9.92%, 4.07%, and 1.11% for SIPHT workload in comparison to the existing workload-scheduling adaptive-dragonfly algorithm (WS-ADA), reliability multi cloud-scheduler (REL-MC) and service-level agreement-based workload-scheduling (SLA-WS) method respectively. The results show that the MMWS has reduced the SLA violation rate by 81.92%, 69.23%, and 30.11% respectively for montage workload and 84.57%, 61.32%, and 12.62% for SIPHT workload in comparison to the existing WS-ADA, REL-MC and SLA-WS methods respectively. Hence, from the experiment outcomes it is shown that the proposed MMWS technique reduces SLA violation with improved resource efficiency in comparison with WS-ADA, REL-MC and SLA-WS", "venue": "International Journal of Intelligent Engineering and Systems", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-31", "journal": {"name": "International Journal of Intelligent Engineering and Systems"}, "authors": [{"authorId": "73492287", "name": "Arundhati Nelli"}, {"authorId": "2720639", "name": "R. Jogdand"}], "citations": []}
