{"paperId": "dd145818f01350b83bd0defc650bec81cc62a6ee", "publicationVenue": {"id": "d825fcc8-7ce6-4a1e-80b1-85f83f7e4129", "name": "Journal of Sensor and Actuator Networks", "type": "journal", "alternate_names": ["J Sens Actuator Netw"], "issn": "2224-2708", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-236712", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-236712", "https://www.mdpi.com/journal/jsan"]}, "title": "Low-Cost Internet of Things Solution for Building Information Modeling Level 3B—Monitoring, Analysis and Management", "abstract": "The integration of the Internet of Things (IoT) and Building Information Modeling (BIM) is progressing. The use of microcontrollers and sensors in buildings is described as a level 3B maturity in the use of BIM. Design companies, contractors and building operators can use IoT solutions to monitor, analyze or manage processes. As a rule, solutions based on original Arduino boards are quite an expensive investment. The aim of this research was to find a low-cost IoT solution for monitoring, analysis and management, and integrate it with a BIM model. In the present study, an inexpensive NodeMCU microcontroller and a temperature and pressure sensor were used to study the thermal comfort of users in a single-family home. During the summer season, analysis of the monitored temperature can contribute to installation (HVAC) or retrofit work (for energy efficiency). The article presents a low-cost solution for studying the thermal comfort of users using a digital twin built-in BIM. Data obtained from sensors can support both the design and management processes. The main contribution of the article enables the design, construction and use of low-cost circuits (15.57 USD) even in small developments (single-family houses, semi-detached houses, terraced houses, atrium buildings). Combining IoT sensor telemetry with BIM (maturity level 3C) is a challenge that organizations will face in the near future.", "venue": "Journal of Sensor and Actuator Networks", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-02-29", "journal": {"name": "Journal of Sensor and Actuator Networks"}, "authors": [{"authorId": "2219077738", "name": "A. Borkowski"}], "citations": []}
