{"paperId": "dd172d18b0bd092ab5d40a68efb144a849400523", "publicationVenue": {"id": "ca71970e-a556-4907-9d7c-8665f9d4c218", "name": "Arquivos Brasileiros de Cardiologia", "type": "journal", "alternate_names": ["Arquivos Brasileiros De Cardiologia", "Arq Bras Cardiol"], "issn": "0066-782X", "url": "http://www.arquivosonline.com.br/", "alternate_urls": ["https://www.scielo.br/scielo.php?lng=en&pid=0066-782X&script=sci_serial", "http://www.scielo.br/abc", "https://www.scielo.br/scielo.php?lng=en&nrm=iso&pid=0066-782X&script=sci_serial"]}, "title": "Machine Learning na Medicina: Revisão e Aplicabilidade", "abstract": "Introdução O aprendizado de máquina, ou machine learning (ML), é um ramo da inteligência artificial (IA) que explora o estudo e a construção de algoritmos computacionais a partir do aprendizado por dados,1,2 ao invés de instruções pré‐programadas.3 O objetivo principal de um modelo de ML é construir um sistema de computador que aprenda com um banco de dados pré‐definido e gere, ao final, um modelo de predição, classificação ou detecção. A aplicação de ML na prática é voltada principalmente para o manuseio de bases de dados consolidadas com informações heterogêneas, para as quais há uma limitação do uso das técnicas de estatística convencionais.4,5 Os algoritmos de ML já estão difundidos em diversas áreas, como sistemas bancários para detecção de fraudes, mecanismos de busca na internet, sistemas de vigilância em vídeo, segurança de dados, logística de empresas, robótica e, na medicina, para diagnóstico e prognóstico.6 Com a digitalização dos prontuários médicos, exames laboratoriais e de imagem, houve um crescimento dos bancos de dados. Esses são fontes para a aplicação de técnicas de ML, visando a prevenção, diagnóstico precoce e o tratamento das doenças. Este artigo de revisão aborda uma introdução sobre ML dividida em: definição, modelos de aprendizagem e uma revisão sistemática de artigos sobre a sua aplicabilidade na medicina e, principalmente, na cardiologia. O objetivo é apresentar ML para médicos e profissionais de saúde como uma ferramenta de auxílio para a prática clínica. Para a estruturação deste artigo de revisão foram pesquisadas duas bases de dados: PubMed (NCBI) e Medline, os seguintes descritores na língua inglesa: “machine learning”, “artificial intelligence”, “unsupervised learning”, “supervised learning”, “neural networks” e “cardiology”. Foram incluídos: estudos prospectivos e retrospectivos, excluídos: casos clínicos e resumos apresentados em congressos (não publicados sob a forma de artigo). A elegibilidade de cada estudo foi avaliada por dois investigadores. As opiniões divergentes relativamente à relevância dos artigos foram abordadas por consenso entre os autores.", "venue": "Arquivos Brasileiros de Cardiologia", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-01-01", "journal": {"name": "Arquivos Brasileiros de Cardiologia", "pages": "95 - 102", "volume": "118"}, "authors": [{"authorId": "2065765933", "name": "Gabriela Miana de Mattos Paixão"}, {"authorId": "2052633154", "name": "B. Santos"}, {"authorId": "2150658612", "name": "Rodrigo Martins de Araujo"}, {"authorId": "35700028", "name": "Manoel Horta Ribeiro"}, {"authorId": "2066057624", "name": "J. Moraes"}, {"authorId": "121015979", "name": "Antonio L. Ribeiro"}], "citations": [{"paperId": "239e19866050a82a598abaa65a30958d7aa131a0", "title": "Estudo e desenvolvimento de algoritmos de IA para análise de indicadores de desempenhos e classificação"}, {"paperId": "2063593c1da0a1165e91f10c590efa6dd2d7d578", "title": "Unlocking the predictive potential of long non-coding RNAs: a machine learning approach for precise cancer patient prognosis."}, {"paperId": "2f75c4f30e0d1049d859f60ba90ef402cd2c1d46", "title": "A novel text sentiment analysis system using improved depthwise separable convolution neural networks"}, {"paperId": "b0c9b711a59e502c91a16f2bcac47eb3bc4508da", "title": "Artificial Intelligence and Machine Learning in Perioperative Acute Kidney Injury."}, {"paperId": "ecd942c8599fc839405932acec05cf1ebc74cf2a", "title": "A Risk-Factor Model for Antineoplastic Drug-Induced Serious Adverse Events in Cancer Inpatients: A Retrospective Study Based on the Global Trigger Tool and Machine Learning"}]}
