{"paperId": "dd249ccbdab518dc9c02579dd3f5b0a44dd3d558", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "AEDFL: Efficient Asynchronous Decentralized Federated Learning with Heterogeneous Devices", "abstract": "Federated Learning (FL) has achieved significant achievements recently, enabling collaborative model training on distributed data over edge devices. Iterative gradient or model exchanges between devices and the centralized server in the standard FL paradigm suffer from severe efficiency bottlenecks on the server. While enabling collaborative training without a central server, existing decentralized FL approaches either focus on the synchronous mechanism that deteriorates FL convergence or ignore device staleness with an asynchronous mechanism, resulting in inferior FL accuracy. In this paper, we propose an Asynchronous Efficient Decentralized FL framework, i.e., AEDFL, in heterogeneous environments with three unique contributions. First, we propose an asynchronous FL system model with an efficient model aggregation method for improving the FL convergence. Second, we propose a dynamic staleness-aware model update approach to achieve superior accuracy. Third, we propose an adaptive sparse training method to reduce communication and computation costs without significant accuracy degradation. Extensive experimentation on four public datasets and four models demonstrates the strength of AEDFL in terms of accuracy (up to 16.3% higher), efficiency (up to 92.9% faster), and computation costs (up to 42.3% lower).", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-18", "journal": {"name": "ArXiv", "volume": "abs/2312.10935"}, "authors": [{"authorId": "2118971193", "name": "Ji Liu"}, {"authorId": "2119145833", "name": "Tianshi Che"}, {"authorId": "2261386556", "name": "Yang Zhou"}, {"authorId": "2275201759", "name": "Ruoming Jin"}, {"authorId": "2261363858", "name": "Huaiyu Dai"}, {"authorId": "2246391421", "name": "Dejing Dou"}, {"authorId": "144255847", "name": "P. Valduriez"}], "citations": [{"paperId": "c2d23eb8b2dca1ecff61ad3729b4a64c1ee08d94", "title": "Enhancing Trust and Privacy in Distributed Networks: A Comprehensive Survey on Blockchain-based Federated Learning"}, {"paperId": "f9dcc4483be35b0a4d682245660f44f5088e2984", "title": "Efficient Asynchronous Federated Learning with Sparsification and Quantization"}]}
