{"paperId": "dd25b08264a261c9b35cdcec6e91ce84128a95da", "publicationVenue": null, "title": "Critical success factors for geospatial data sharing in disaster management", "abstract": "Globally, the rise of disasters has caused billions of dollars lost each year. These include the loss of properties, life and has created a negative impact on socioeconomic level of a country. Currently, geospatial datasets are becoming crucial for situational awareness and management of disasters. The timely and accurate information on disastrous occurrences must be collected, maintained, and managed for efficient management of emergency. These geospatial datasets are from different data provider agencies. Thus, there is a need to focus on the geospatial data sharing that would benefits the authorities in decision making. This initiative entails high commitment and collaboration from the data provider agencies, which can be achieved through the sharing of geospatial datasets approach. This study aims to identify the critical success factors of geospatial data sharing in the context of natural disaster. A preliminary review, focus group discussion and interviews were conducted to get insights of the subject being studied. The findings revealed that there are thirteen (13) critical success factors for geospatial data sharing in disaster management. Technology, Organisation, Social, Environment, Ecology and Economy are the dimensions identified and mapped accordingly to the thirteen critical success factors.", "venue": "IOP Conference Series: Earth and Environment", "year": 2022, "fieldsOfStudy": ["Physics"], "publicationTypes": ["Conference", "Review"], "publicationDate": "2022-07-01", "journal": {"name": "IOP Conference Series: Earth and Environmental Science", "volume": "1064"}, "authors": [{"authorId": "1729547301", "name": "Mageshwari Valachamy"}, {"authorId": "2055915", "name": "S. Sahibuddin"}, {"authorId": "2179288455", "name": "Nur Azurati Ahmad"}, {"authorId": "2072183966", "name": "Nur Azaliah Abu Bakar"}], "citations": [{"paperId": "2089717968732c20fb704808b7f760abe6fddaaf", "title": "Research Trends in Resilience and Vulnerability Studies"}, {"paperId": "dc8aad62807a64e4d080b6b856765a746d16ef0b", "title": "Interlinkages and gaps: a review of the literature on intergovernmental relations for flood management in the face of climate change"}]}
