{"paperId": "dd47ba24005efaf943f0119c7344ffc2e4f11e4a", "publicationVenue": null, "title": "Constructing Crop Portraits Based on Graph Databases Is Essential to Agricultural Data Mining", "abstract": "Neo4j is a graph database that can use not only data, but also data relationships. Crop portraits, a kind of property graph, model the crop entity in the real world based on data to realize the networked management of crop knowledge. The existing crop knowledge base has shortcomings such as single crop variety, incomplete description, and lack of agricultural knowledge. Constructing crop portraits can provide a comprehensive description of crops and make up for these shortcomings. This research used agricultural question-and-answer data and popular science data obtained by text crawling as the original data, selected labels to establish a crop portrait that including three categories (crops, pesticides, and diseases and pests), and used the graph database (Neo4j) to store and display these portrait data. Information mining found that the crop portrait revealed the occurrence trend of diseases and pests, exhibited a nonintrinsic connection between different diseases and pests, and provided a variety of pesticides to choose from for control of diseases and pests. The results showed that constructing crop portraits is beneficial to agricultural analysis, and has practical application values and theoretical research prospects in the field of big data analytics.", "venue": "Inf.", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-05-27", "journal": {"name": "Inf.", "pages": "227", "volume": "12"}, "authors": [{"authorId": "49593128", "name": "Yuzhi Shi"}, {"authorId": "2141929216", "name": "Bo-Kai Zhang"}, {"authorId": "2119220142", "name": "Yong-Xiang Wang"}, {"authorId": "2152906007", "name": "Han-Qian Luo"}, {"authorId": "2144441679", "name": "Xiang Li"}], "citations": [{"paperId": "4a87b1fc50535d0016522008c5fedb9b6685c00e", "title": "Agriculture Yield Estimation Using Machine Learning Algorithms"}, {"paperId": "fb2a7eefb59d1d9033abe8559d74a6eeb6437d21", "title": "Retrieval of Injection Molding Industrial Knowledge Graph Based on Transformer and BERT"}, {"paperId": "5c06306d0ffd2634a7cf7c0ddd0e0cbfcedec2ee", "title": "Knowledge Management for Injection Molding Defects by a Knowledge Graph"}, {"paperId": "268f89f6dd28a7dba63c705d5d857a32e453e587", "title": "Design of English Teaching Postcompetency Evaluation System Based on Data Mining and IoT"}, {"paperId": "6c868748398c7af64e0f8d2b0009f374797b298c", "title": "Statistics and Analysis of Targeted Poverty Alleviation Information Integrated with Big Data Mining Algorithm"}]}
