{"paperId": "dd4ce371dc7641cd1d1bfa4460baa3005f98f170", "publicationVenue": null, "title": "Blockchain and Deep Reinforcement Learning Empowered Spatial Crowdsourcing in Software-Defined Internet of Vehicles", "abstract": "Owing to its benefits such as flexibility, scalability, and interoperability, Software-Defined Networking (SDN) has been incorporated into Internet of Vehicles (IoV) to cope with the increasing demands of vehicular applications. The integration of SDN and IoV, namely SDN-IoV, can enrich many new applications for intelligent transportation such as traffic monitoring, smart navigation, and self-driving. The spatial crowdsourcing technology has been adopted as an effective data collection and processing method that is the premise of various SDN-IoV applications. However, as huge amounts of data are generated in spatial crowdsourcing services, the data privacy and security has become a key challenge for SDN-IoV. To overcome abovementioned challenge, a Deep Reinforcement Learning (DRL) and Blockchain empowered Spatial Crowdsourcing System (DB-SCS) is proposed. In DB-SCS, we design an improved multi-blockchain structure and a blockchain-based hierarchical task management method, which divide the spatial tasks into different categories according to the privacy requirements and the areas of the task and then decompose different categories of tasks and task receivers into sub-blockchains. While guaranteeing the data privacy, DB-SCS can also enhance the spatial crowdsourcing performance by using the proposed DRL-based management strategy to dynamically select the consensus algorithm, block size, and block generation rule. Extensive simulation experiments demonstrate that the DB-SCS can obtain high throughput, low overhead, and data privacy under various SDN-IoV scenarios.", "venue": "IEEE transactions on intelligent transportation systems (Print)", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-10-15", "journal": {"name": "IEEE Transactions on Intelligent Transportation Systems", "pages": "3755-3764", "volume": "22"}, "authors": [{"authorId": "49955880", "name": "Hui Lin"}, {"authorId": "144529280", "name": "S. Garg"}, {"authorId": "31703425", "name": "Jia Hu"}, {"authorId": "2379122", "name": "Georges Kaddoum"}, {"authorId": "1830448498", "name": "Min Peng"}, {"authorId": "2194855208", "name": "M. Hossain"}], "citations": [{"paperId": "825bf340f7fd23a566c3b3c57d11a7711011838e", "title": "BlockSC: A Blockchain Empowered Spatial Crowdsourcing Service in Metaverse While Preserving User Location Privacy"}, {"paperId": "39e11ad48275c147779a0cd5563f501e005f3a8f", "title": "PDMSC: privacy-preserving decentralized multi-skill spatial crowdsourcing"}, {"paperId": "633b4ac720254a72f46f012c6212772b9dcd246d", "title": "System-of-Systems Approach to Spatio-temporal Crowdsourcing Design using Improved PPO Algorithm Based on An Invalid Action Masking"}, {"paperId": "19448d073d88761925a2e1f5b92d03cc83423788", "title": "Performance Optimization for Information Sharing Process of BlockIoV Based on Multi-Objective Particle Swarm"}, {"paperId": "c4ab894131ccdfb25685554e932f4dfb6651ad62", "title": "Privacy Protection Schemes in Internet of Vehicles (IoV): A Review and Analysis"}, {"paperId": "29d9c9b73a84452bc1b940f81d20bd2b2a320767", "title": "LearnChain: Transparent and cooperative reinforcement learning on Blockchain"}, {"paperId": "ee12489db4d634dbd937ce56e46126c24917f1e1", "title": "A Deep Reinforcement Learning Framework for Training SARSA Agents (DQSARSA Agents) to Improve Consensus in Blockchain Networks"}, {"paperId": "a3c832b467437fad51522bb3b5d6cbefa03949f5", "title": "Building a Decentralized Crowdsourcing System with Blockchain as a Service"}, {"paperId": "63fce9d0bb44ee8ee645b994d86769d85eecc8c4", "title": "A Survey of Blockchain and Artificial Intelligence for 6G Wireless Communications"}, {"paperId": "0825ec3300f8e69ee5dd3267a7d805a67cbb920a", "title": "Formal verification of fraud-resilience in a crowdsourcing consensus protocol"}, {"paperId": "db66a90864d42c369aa51e4f51844a963c99ffef", "title": "SecGreen: Secrecy Ensured Power Optimization Scheme for Software-Defined Connected IoV"}, {"paperId": "03c3bdf9430db2d3c0ddf7abb956222e6c43afbf", "title": "Decentralized Autonomous Operations and Organizations in TransVerse: Federated Intelligence for Smart Mobility"}, {"paperId": "59f75693ff22096d32a6defedba8f18d0047fd9c", "title": "Edge Resource Pricing and Scheduling for Blockchain: A Stackelberg Game Approach"}, {"paperId": "4be35a78ae1cfef9cc6dbdc646ee20f84005b2fa", "title": "Heterogeneous Blockchain and AI-Driven Hierarchical Trust Evaluation for 5G-Enabled Intelligent Transportation Systems"}, {"paperId": "637db6cbc89da897b1436270b9288f3784d20e64", "title": "Blockchain -Assisted Hybrid Deep Learning-Based Secure Mechanism for Software Defined Networks"}, {"paperId": "f5228416f227a89c7da9fe88914ea41a8f01b942", "title": "PPO-TA: Adaptive task allocation via Proximal Policy Optimization for spatio-temporal crowdsourcing"}, {"paperId": "5d77902cc0c02fe7406c2198117902af4a10d960", "title": "A Large Scale Medical Crowdfunding Platform using Smart Contracts in Blockchain"}, {"paperId": "56ff422cc7c5f48ef196b76f1ee3d8a695723793", "title": "Loyalty-based Task Assignment in Spatial Crowdsourcing"}, {"paperId": "3a83f49de14b2ba501fccabfedeff599095042df", "title": "A task allocation algorithm based on reinforcement learning in spatio-temporal crowdsourcing"}, {"paperId": "f5b4b6a2e0d330d74b95182c9ef310d295d7992d", "title": "A Hierarchical and Location-Aware Consensus Protocol for IoT-Blockchain Applications"}, {"paperId": "08634556d067fd29581e4bc286f4c52e700165a8", "title": "Deep Reinforcement Learning for energy-aware task offloading in join SDN-Blockchain 5G massive IoT edge network"}, {"paperId": "a5cf89c27716a0566f881c7c1253759ef3bf21ae", "title": "Deep and Reinforcement Learning Technologies on Internet of Vehicle (IoV) Applications: Current Issues and Future Trends"}, {"paperId": "c03a5f5b53c54a1bc35ce4448fe1833dcc336a8f", "title": "Using Blockchain for Data Collection in the Automotive Industry Sector: A Literature Review"}, {"paperId": "0a086eff82b49544a35179a83dbc610d92f6fdff", "title": "A Summary of Security Techniques-Based Blockchain in IoV"}, {"paperId": "f643e846aed63d084302105695dbee710d4b0b3d", "title": "A security framework for QaaS model in intelligent transportation systems"}, {"paperId": "4b76cc96ebffcccd5ca37505860f185339ed5f9c", "title": "Blockchain for Securing AI Applications and Open Innovations"}, {"paperId": "2190aeb18793d695ef8d8a635e4050955da01bdd", "title": "A Credibility-aware Swarm-Federated Deep Learning Framework in Internet of Vehicles"}, {"paperId": "a5cd30c2257edb9d37576b2678b521c354d86825", "title": "Next generation stock exchange: Recurrent neural learning model for distributed ledger transactions"}, {"paperId": "345c1678ee58bbd005d783e17342d065df514ec3", "title": "Great partners: how deep learning and blockchain help improve business operations together"}, {"paperId": "0c39349e1c495b911077abb3e5aebc29a590f891", "title": "Perception and Navigation in Autonomous Systems in the Era of Learning: A Survey"}, {"paperId": "f26b23a5a1d000b49f55b6c09aece49373d5c876", "title": "Blockchain Intelligence for Internet of Vehicles: Challenges and Solutions"}, {"paperId": "1ea776ef5a5c2e6580a73918eabc5664603ca86b", "title": "A Promising Integration of SDN and Blockchain for IoT Networks: A Survey"}, {"paperId": "af9f4d4629302c6579352b3530d3b2711aaf14b7", "title": "IAES International Journal of Artificial Intelligence (IJ-AI)"}, {"paperId": "4290621933aa1bd730026e308cd967b62dbc9a58", "title": "Multi-Channel Blockchain Scheme for Internet of Vehicles"}]}
