{"paperId": "dd558ef71778066d96dc9efc5d00025dc66cfda9", "publicationVenue": {"id": "027ffd21-ebb0-4af8-baf5-911124292fd0", "name": "bioRxiv", "type": "journal", "url": "http://biorxiv.org/"}, "title": "Exploring Nonlinear Dynamics In Brain Functionality Through Phase Portraits And Fuzzy Recurrence Plots", "abstract": "Much of the complexity and diversity found in nature are driven by nonlinear phenomena, and this holds true for the brain. Nonlinear dynamics theory has been successfully utilized in explaining brain functions from a biophysics standpoint, and the field of statistical physics continues to make substantial progress in understanding brain connectivity and function. This study delves into complex brain functional connectivity using biophysical nonlinear dynamics approaches. We aim to uncover hidden information in high-dimensional and nonlinear neural signals, with the hope of providing a useful tool for analyzing information transitions in functionally complex networks. By utilizing phase portraits and fuzzy recurrence plots, we investigated the latent information in the functional connectivity of complex brain networks. Our numerical experiments, which include synthetic linear dynamics neural time series and a biophysically realistic neural mass model, showed that phase portraits and fuzzy recurrence plots are highly sensitive to changes in neural dynamics, and they can also be used to predict functional connectivity based on structural connectivity. Furthermore, the results showed that phase trajectories of neuronal activity encode low-dimensional dynamics, and the geometric properties of the limit-cycle attractor formed by the phase portraits can be used to explain the neurodynamics. Additionally, our results showed that the phase portrait and fuzzy recurrence plots can be used as functional connectivity descriptors, and both metrics were able to capture and explain nonlinear dynamics behavior during specific cognitive tasks. In conclusion, our findings suggest that phase portraits and fuzzy recurrence plots could be highly effective as functional connectivity descriptors, providing valuable insights into nonlinear dynamics in the brain. Significance Here we report phase trajectories and fuzzy recurrence plots can be nonlinear functional dynamics networks descriptors, and both of metrics are very sensitive to neural signals variations, and can be powerful to capture the distinct patterns from brain signals, and it makes brain fingerprinting possible. It does have a significant meaning for us to understand brain state dynamics via phase trajectories and fuzzy recurrence plots, and both metrics can be powerful descriptors for identifying nonlinear dynamics patterns.", "venue": "bioRxiv", "year": 2024, "fieldsOfStudy": ["Medicine", "Biology"], "publicationTypes": null, "publicationDate": "2024-02-17", "journal": {"name": "bioRxiv"}, "authors": [{"authorId": "2146262430", "name": "Qiang Li"}, {"authorId": "2132419391", "name": "V. Calhoun"}, {"authorId": "2067955767", "name": "T. Pham"}, {"authorId": "2602754", "name": "A. Iraji"}], "citations": [{"paperId": "79bd61d6bc171bd010f7666d375ab8af49a5c98b", "title": "Visual Image Reconstructed Without Semantics from Human Brain Activity Using Linear Image Decoders and Nonlinear Noise Suppression"}, {"paperId": "ca7f1890eb32ee92e986049402a9146870ebbf53", "title": "COMPLEXITY MEASURES OF PSYCHOTIC BRAIN ACTIVITY IN THE FMRI SIGNAL"}, {"paperId": "cacc4b203f76292179385aa9c7320c5798cfa085", "title": "Visual Image Reconstruction from Human Brain Activity using Linear Image Decoders plus Nonlinear Noise Suppression"}]}
