{"paperId": "dd5749a012064659b72b7878077bbb63c2a7d0a8", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Improving the Performance of LOADng Routing Protocol in Mobile IoT Scenarios", "abstract": "Routing protocols represent an important issue on the Internet of Things (IoT) scenarios since they are responsible for creating paths and forwarding data packets among the network nodes. In mobile IoT scenarios, the topology changes caused by the movement of nodes makes the work of routing protocols more difficult. Thus, the current IoT routing solutions tend to present strong limitations and a poor performance in these scenarios, generally requiring complex additional improvement to better support the mobility of the devices. In this context, the Lightweight On-demand Ad hoc Distance-vector Routing Protocol – Next Generation (LOADng), is an emerging solution for IoT networks that despite being adequate for a mobile environment due to its reactive functioning still lacks in performance. Thus, this paper proposes a novel solution to enhance the performance of LOADng in mobile IoT networks. The improved version, LOADng-IoT-Mob, introduces a mechanism that permits nodes to be aware of the availability of their neighbors through the harnessing of control messages. As a result, these nodes can shorten paths and avoid sending data packets through broken routes due to the movement of the nodes. Additionally, a short periodical control message is introduced, allowing the nodes to update their routing table, even with a low control message frequency. Furthermore, a new routing metric is proposed for creating routes based on the reliability of the link and proximity of the neighboring nodes. Finally, through computational simulations, the performance of the LOADng-IoT-Mob is studied under multiple scenarios varying the network size, the number of mobile devices, and maximum nodes’ speed. The results obtained demonstrate the efficiency of the proposed solution in terms of packet delivery ratio, latency, and power and overhead efficiency, with a slight increase in memory consumption.", "venue": "IEEE Access", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-08-02", "journal": {"name": "IEEE Access", "pages": "107032-107046", "volume": "7"}, "authors": [{"authorId": "144878573", "name": "José V. V. Sobral"}, {"authorId": "144091141", "name": "J. Rodrigues"}, {"authorId": "144751709", "name": "R. Rabêlo"}, {"authorId": "144256139", "name": "K. Saleem"}, {"authorId": "1388497426", "name": "Sergei A. Kozlov"}], "citations": [{"paperId": "aace1c041150da673b0d163840d3447d85c4217d", "title": "An efficient Clustered IoT (CIoT) routing protocol and control overhead minimization in IoT network"}, {"paperId": "c285ae6e93c373b31da659b81ad9763cb853e078", "title": "A Multi-Constraints Routing Scheme for MANET-assisted IoT in Smart Cities"}, {"paperId": "6f06dc3e12b54901eb7d46e36c8a654674345190", "title": "Internet of Things routing protocol with mobility awareness and energy efficiency"}, {"paperId": "d1f940502b9104bf576114287f570f43333657e1", "title": "Smart and Secure IoT based Remote Real-Time Radiation Detection and Measurement System"}, {"paperId": "02757d92be87de68abd4e221e1beff5f7dccb364", "title": "Efficient Cryptography Integrated IoT Model for Data Security Management"}, {"paperId": "3a7b266830f5ed618aeeb74fea649a1576d67f88", "title": "LOADng-AT: a novel practical implementation of hybrid AHP-TOPSIS algorithm in reactive routing protocol for intelligent IoT-based networks"}, {"paperId": "0cac21f7d93345dffd9469e0ce09d995e16452e7", "title": "Constrained Cuckoo Search Optimization Based Protocol for Routing in Cloud Network"}, {"paperId": "f97303dd240af192852e52d57f8cf77729c08ca1", "title": "MBMQA: A Multicriteria-Aware Routing Approach for the IoT 5G Network Based on D2D Communication"}, {"paperId": "885bf04df04e6abf045b607e92e3ff78a099a46b", "title": "Evaluation of Linear Component Node Orchestration for IoT Clusters in Smart Grid Communication Networks"}, {"paperId": "968b2bab0d205f14333921488a663b5ae8859870", "title": "Routing constraints in the device-to-device communication for beyond IoT 5G networks: a review"}, {"paperId": "631dfa6291ef5db2d8b94a030a4a3f695659dc1d", "title": "OQR-SC: An Optimal QoS Aware Routing Technique for Smart Cities Using IoT Enabled Wireless Sensor Networks"}, {"paperId": "d88a51524698a869001a03ef963d3458f4821c7d", "title": "Context-Aware Adaptive Route Mutation Scheme: A Reinforcement Learning Approach"}, {"paperId": "96d3e272d04ca1436cebd84e367afdb7d701f8f8", "title": "Cross-Modal Stream Scheduling for eHealth"}, {"paperId": "b26ea35e50c1801b93c3b4f61ab1371127a569a9", "title": "Energy-aware strategy for data forwarding in IoT ecosystem"}, {"paperId": "237f6a1def8655e49ee6a4355b87b2e59baa9118", "title": "Impacts of Mobility Models on RPL-Based Mobile IoT Infrastructures: An Evaluative Comparison and Survey"}, {"paperId": "0f8c19f46051bc294677c8bb3ee5ce227ad872b0", "title": "Secure Routing Protocol using Salp-Particle Swarm Optimization Algorithm"}, {"paperId": "46505e1bf371102cfcd4be6989e310a73e269f3b", "title": "A Study on Internet of Things Performance Evaluation"}, {"paperId": "ba98b158b2818c95f1723aacd2e853db45572948", "title": "EMBLR: A High-Performance Optimal Routing Approach for D2D Communications in Large-scale IoT 5G Network"}, {"paperId": "502db47c3b16541c18ccf770053bbfbd0749b138", "title": "A mobility solution for low power and lossy networks using the LOADng protocol"}, {"paperId": "b143721d2b2a3b60ab7cfbe13bb8b52f27aea6ec", "title": "Control Overhead Minimization In IoT Network and An E ffi cient Clustered IoT (CIoT) Routing Protocol"}, {"paperId": "716725b2a7730ba440a59ffe00cf1afe4175a6ba", "title": "Evolutions of Low Power and Lossy Networks Protocols in the Internet of Things: A Review"}, {"paperId": "ddaa7312429f49733b0b4160f7e7bb3e63b6bc35", "title": "Designing an Energy Efficient Routing for Subsystems Sensors in Internet of Things Eco-System Using Distributed Approach"}]}
