{"paperId": "dd5e727781f89e29f9425f57b5ed60c6dbbdd1bc", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Using a Clustering Method to Detect Spatial Events in a Smartphone-Based Crowd-Sourced Database for Environmental Noise Assessment", "abstract": "Noise has become a very notable source of pollution with major impacts on health, especially in urban areas. To reduce these impacts, proper evaluation of noise is very important, for example by using noise mapping tools. The Noise-Planet project seeks to develop such tools in an open science platform, with a key open-source smartphone tool “NoiseCapture” that allows users to measure and share the noise environment as an alternative to classical methods, such as simulation tools and noise observatories, which have limitations. As an alternative solution, smartphones can be used to create a low-cost network of sensors to collect the necessary data to generate a noise map. Nevertheless, this data may suffer from problems, such as a lack of calibration or a bad location, which lowers its quality. Therefore, quality control is very crucial to enhance the data analysis and the relevance of the noise maps. Most quality control methods require a reference database to train the models. In the context of NC, this reference data can be produced during specifically organized events (NC party), during which contributors are specifically trained to collect measurements. Nevertheless, these data are not sufficient in number to create a big enough reference database, and it is still necessary to complete them. Other communities around the world use NC, and one may want to integrate the data they collected into the learning database. In order to achieve this, one must detect these data within the mass of available data. As these events are generally characterized by a higher density of measurements in space and time, in this paper we propose to apply a classical clustering method, called DBSCAN, to identify them in the NC database. We first tested this method on the existing NC party, then applied it on a global scale. Depending on the DBSCAN parameters, many clusters are thus detected, with different typologies.", "venue": "Italian National Conference on Sensors", "year": 2022, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-11-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "22"}, "authors": [{"authorId": "2122880933", "name": "Ayoub Boumchich"}, {"authorId": "3441493", "name": "J. Picaut"}, {"authorId": "2694930", "name": "E. Bocher"}], "citations": [{"paperId": "ba78a1ad6416d36fdc6b5b1277427bc92eabb730", "title": "Investigating Noise Mapping in Cities to Associate Noise Levels with Sources of Noise Using Crowdsourcing Applications"}, {"paperId": "2605fd8c06e5945578f0bee5b2a08a4918e126f9", "title": "3D Scanner-Based Identification of Welding Defects—Clustering the Results of Point Cloud Alignment"}, {"paperId": "0b7072ba7857c3dbfdf56af73e4d74cb53da8d9f", "title": "Employing Social Participants for Timely Data Collection Using Pub/sub Solutions in Dynamic IoT Systems"}, {"paperId": "ff696099fba7b0d204c19b8ac8962fa2fc74d90d", "title": "Framework for urban sound assessment at the city scale based on citizen action, with the smartphone application NoiseCapture as a lever for participation"}, {"paperId": "9639edacff3fc8ec3616a855d0e30899809f4094", "title": "A reliability and truth-aware based online digital data auction mechanism for cybersecurity in MCS"}, {"paperId": "4ccb47a63848f5ed846d22938d79f753fa4d3fc8", "title": "Data handling and ethics of emerging smartphone-based (bio)sensors – Part 1: Best practices and current implementation"}, {"paperId": "5a17b2f9486aa6abd7640bab61063c8f464d9fc6", "title": "Development of Adjustable Parallel Helmholtz Acoustic Metamaterial for Broad Low-Frequency Sound Absorption Band"}, {"paperId": "00d8263951ee498024b1232cf0c479c53b1bc2cb", "title": "CROWDSOURCED ACOUSTIC OPEN DATA ANALYSIS WITH FOSS4G TOOLS"}, {"paperId": "0a252d850d739fbc30bd5e7032fc2bd153ff7356", "title": "NoiseCapture smartphone application as pedagogical support for education and public awareness."}]}
