{"paperId": "dd83514234023cc566ad17f5a631e854ee8a67e3", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Student-Performulator: Student Academic Performance Using Hybrid Deep Neural Network", "abstract": "Educational data generated through various platforms such as e-learning, e-admission systems, and automated result management systems can be effectively processed through educational data mining techniques in order to gather highly useful insights into students’ performance. The prediction of student performance from historical academic data is a highly desirable application of educational data mining. In this regard, there is an urgent need to develop an automated technique for student performance prediction. Existing studies on student performance prediction primarily focus on utilizing the conventional feature representation schemes, where extracted features are fed to a classifier. In recent years, deep learning has enabled researchers to automatically extract high-level features from raw data. Such advanced feature representation schemes enable superior performance in challenging tasks. In this work, we examine the deep neural network model, namely, the attention-based Bidirectional Long Short-Term Memory (BiLSTM) network to efficiently predict student performance (grades) from historical data. In this article, we have used the most advanced BiLSTM combined with an attention mechanism model by analyzing existing research problems, which are based on advanced feature classification and prediction. This work is really vital for academicians, universities, and government departments to early predict the performance. The superior sequence learning capabilities of BiLSTM combined with attention mechanism yield superior performance compared to the existing state-of-the-art. The proposed method has achieved a prediction accuracy of 90.16%.", "venue": "Sustainability", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-08-31", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "1662776482", "name": "Bashir Khan Yousafzai"}, {"authorId": "2152490078", "name": "Sher Afzal Khan"}, {"authorId": "49172334", "name": "Taj Rahman"}, {"authorId": "2151457788", "name": "Inayat Khan"}, {"authorId": "137787312", "name": "Inam Ullah"}, {"authorId": "2125597423", "name": "Ateeq Ur Rehman"}, {"authorId": "3275747", "name": "M. Baz"}, {"authorId": "2134484178", "name": "Habib Hamam"}, {"authorId": "2146753", "name": "O. Cheikhrouhou"}], "citations": [{"paperId": "f35e9db1bc60b4f504fb0e76087f077c796d9a5d", "title": "Sentiment analysis of student feedback using attention-based RNN and transformer embedding"}, {"paperId": "b039e09e51889ded35e339586188267cd9e6ecec", "title": "Exploring the intricacies of human memory and its analogous representation in ChatGPT"}, {"paperId": "f833d0b418ad5d6f4f765f9251f1975dab9dba84", "title": "Role of activity-based learning and ChatGPT on students' performance in education"}, {"paperId": "4ecd13b8d7d036067bf39fc46d35b258bae49e1b", "title": "An automatic prediction of students’ performance to support the university education system: a deep learning approach"}, {"paperId": "0666c8fae663661122ee1f5666b00cccee9d3743", "title": "Convolutional Neural Network for Predicting Student\nAcademic Performance in Intelligent Tutoring System"}, {"paperId": "8f1aba4bb068d27814f8828b015c7baa79bad6b7", "title": "A novel methodology using RNN + LSTM + ML for predicting student’s academic performance"}, {"paperId": "5d25c0ec79d7662abc16bedc255d63bc3e46935b", "title": "Automatic Scoring of Students' Science Writing Using Hybrid Neural Network"}, {"paperId": "a0bcb6ec8f7399fb902b46eadd813c98a433b8cb", "title": "Personalization-based deep hybrid E-learning model for online course recommendation system"}, {"paperId": "c0eecf3df36d9b01e69661345b800cf629f2762d", "title": "Role of convolutional features and machine learning for predicting student academic performance from MOODLE data"}, {"paperId": "c6d87c55122926c42f163608c6e500ad8f0f593e", "title": "Comparing Different Oversampling Methods in Predicting Multi-Class Educational Datasets Using Machine Learning Techniques"}, {"paperId": "ffb27f85f932f28fc97ec3ecda7b827c616f27ec", "title": "Machine Learning and Deep Learning-Based Students’ Grade Prediction"}, {"paperId": "dbe9751f428fbf5a02d087f99594f3ede820ce4a", "title": "Students learning performance prediction based on feature extraction algorithm and attention-based bidirectional gated recurrent unit network"}, {"paperId": "5e5f530f136548f55f0291acdcc4fd21d0940cd7", "title": "Wheat Diseases Recognition Using Optimal Features Assisted Modified Soft Attention Network"}, {"paperId": "10b5efd52221d43cb0be2f8ff709c0392980a2a5", "title": "Predicting Student Performance Using Mental Health and Linguistic Attributes with Deep Learning"}, {"paperId": "07cea4f9f4831dd677b4835c0bb312c88908831a", "title": "Harnessing the Power of a Bidirectional Long Short-Term Memory-Based Prediction Model: A Case of Student Academic Performance"}, {"paperId": "588ff0e950454f5dd463d0aeefbb27de95a905a2", "title": "Analysis of educational data enabled by deep learning to increase student success"}, {"paperId": "f7bff2d5391819c72e72a84c217e87179525fe11", "title": "Data Mining Model for Forecasting Academic Performance of Undergraduates Based on Behavioral Features and SVM in E-learning"}, {"paperId": "1a20c44bff542b69f0b1a9f6404f5741b39db565", "title": "Automated Classification of Brain Tumors from Magnetic Resonance Imaging Using Deep Learning"}, {"paperId": "2d523593e396410362dd49c77d53693a213bbe7c", "title": "Yoga Meets Intelligent Internet of Things: Recent Challenges and Future Directions"}, {"paperId": "3e9b570bd30fb1e02e3a704a6105b93149ad4be6", "title": "Analysis of IoT Security Challenges and Its Solutions Using Artificial Intelligence"}, {"paperId": "97a10005e3ef47064657f15a42000586cdfe84e8", "title": "Predicting and Comparing Students’ Online and Offline Academic Performance Using Machine Learning Algorithms"}, {"paperId": "6862a1b1547021bea71a56312b77bebadb09ff41", "title": "Enhancing Infants Early Communication through Sign Language Recognition System using Raspberry Pi and Convolutional Neural Network"}, {"paperId": "05771c03cfb2ccfaaaf2ec380ce257598e1532b9", "title": "Artificial neural network model to predict student performance using nonpersonal information"}, {"paperId": "0a51c4b32fdd7dbe07a59a2d7c878b1a2e0ea02e", "title": "Analysis of Enrollment Criteria in Secondary Schools Using Machine Learning and Data Mining Approach"}, {"paperId": "e81daf318e8bb243a5379397398c2eda229ce0fc", "title": "Analysis of Challenges and Solutions of IoT in Smart Grids Using AI and Machine Learning Techniques: A Review"}, {"paperId": "462c218421290decb48e3e4a783e90bc3e6cae19", "title": "Lung Nodules Localization and Report Analysis from Computerized Tomography (CT) Scan Using a Novel Machine Learning Approach"}, {"paperId": "f876d823b1089459668a5b26bc94e49151a47412", "title": "Development and Testing of Performance Scale Application as an Effective Electronic Tool to Enhance Students’ Academic Achievements"}, {"paperId": "94132a536ac86831d972be322b5eea889f58636d", "title": "A Novel Smart Belt for Anxiety Detection, Classification, and Reduction Using IIoMT on Students’ Cardiac Signal and MSY"}, {"paperId": "c9cedfcbf78eff361cdf908dd5ce67514c389e47", "title": "The Role of ML, AI and 5G Technology in Smart Energy and Smart Building Management"}, {"paperId": "a7e9542b327e26bf91f9da2df6e1d7bea3326a54", "title": "On Disharmony in Batch Normalization and Dropout Methods for Early Categorization of Alzheimer’s Disease"}, {"paperId": "25d574c88fb3ea5c78358f0a353d6b868c4bc2d2", "title": "A Multiagent Cooperative Decision-Making Method for Adaptive Intersection Complexity Based on Hierarchical RL"}, {"paperId": "1b895f8d7d6b83998ca6a4bb51521f135fb1889a", "title": "A Natural Language Processing (NLP) Evaluation on COVID-19 Rumour Dataset Using Deep Learning Techniques"}, {"paperId": "f7a7f6524243c1dd46db9c258bb280bb61a15039", "title": "A machine learning prediction of academic performance of secondary school students using radial basis function neural network"}, {"paperId": "086d0431577b66824947603eb8002cdf2bc913a5", "title": "Face Detection & Recognition from Images & Videos Based on CNN & Raspberry Pi"}, {"paperId": "9e9d8a043051e41a83d470bd6bc4f2427e21e735", "title": "Implementation of an Intelligent Exam Supervision System Using Deep Learning Algorithms"}, {"paperId": "56a42afb4df8defc9f25d9ecf51cee31f8ce461b", "title": "An AI-Driven Hybrid Framework for Intrusion Detection in IoT-Enabled E-Health"}, {"paperId": "7b4fee134dc4b1a441aeee8ba969ed35781938ee", "title": "Review on Artificial Intelligence and its Implementations in Digital Era"}, {"paperId": "77b5ef59a5c49bde4553d106404d91e923ebb72e", "title": "Study-GNN: A Novel Pipeline for Student Performance Prediction Based on Multi-Topology Graph Neural Networks"}, {"paperId": "e2b66853066709c53db470df64b0a9a1ff3b169d", "title": "A Predictive Model for Student Achievement Using Spiking Neural Networks Based on Educational Data"}, {"paperId": "dc93e7fb1a521d11dc900f25a485526669417abf", "title": "Prediction of Student Academic Performance Using a Hybrid 2D CNN Model"}, {"paperId": "a0eb022f4ce28eade5cb5da4e310bf5e53ac5dce", "title": "On Improved 3D-CNN-Based Binary and Multiclass Classification of Alzheimer's Disease Using Neuroimaging Modalities and Data Augmentation Methods"}, {"paperId": "990b7fffe79369e376bec5fdf80e2a6d2c10357d", "title": "Automated Detection of Rehabilitation Exercise by Stroke Patients Using 3-Layer CNN-LSTM Model"}, {"paperId": "095c0cfd83ce8506bf1f58ebd9aaf017a0ebcbdb", "title": "Diagnosis of Diabetic Retinopathy through Retinal Fundus Images and 3D Convolutional Neural Networks with Limited Number of Samples"}, {"paperId": "51a4613cd7cd1cec3dccf1662b8a6bbc371fc459", "title": "Early Warning System for Online STEM Learning—A Slimmer Approach Using Recurrent Neural Networks"}, {"paperId": "04997d14402876d8f65d37a99a3a393efe438929", "title": "A University Student Performance Prediction Model and Experiment Based on Multi-Feature Fusion and Attention Mechanism"}, {"paperId": "34dda4effeba4034bf3e160ec599fbe64afcfac8", "title": "Multi-class LDA classifier and CNN feature extraction for student performance analysis during Covid-19 pandemic"}, {"paperId": "d021a3f3bb47880da135baf983dd5c3a7bc544c1", "title": "Learning analytics of MOOCs based on natural language processing"}, {"paperId": "9b420bc15740d67447462d1673a98578d8b0744e", "title": "Time Division Ensemble Learning Classifier For Efficient Student Performance Analysis Using Convolution Neural Network"}, {"paperId": "5c1932747304f82deea0c0339e7011b2bbab0233", "title": "Methods Application Towards a New Dataset based on Online Student Activities"}, {"paperId": "af394a08a8d29fa90a958521cb109d2350b4c381", "title": "Uncovering the Risk of Academic Information System Vulnerability through PTES and OWASP Method"}]}
