{"paperId": "dd90c52137190678201ad2fc5a5e3af0383d21f4", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "An IoT Smart Infrastructure for S. Domenico Church in Matera’s “Sassi’’: A Multiscale Perspective to Built Heritage Conservation", "abstract": "Architectural heritage is perhaps the most important marker of the Italian and European landscapes. Over the last decades, its strategic relevance for local economic development has led to prioritize tourism-oriented promotion objectives. Therefore, new light has been thrown on once unknown resources that have thus received the attention of tourists interested in new visit experiences. To this end, Information and Communication Technologies (ICTs) have delivered a crucial support mainly in terms of public attraction and creation of new cultural offers. However, new urgent challenges now face tangible heritage, whose physical existence is jeopardized through extreme events and poor maintenance. Unexpected intense visit flows represent in themselves a further threat for sensitive heritages. ICTs have then to cope with more complex conservation tasks and the Internet of Things (IoT) can facilitate appropriate solutions. The paper presents a smart sensor-based infrastructure for the structural monitoring of S. Domenico Church in Matera, an emblematic city for the concerns described, which also highlighted the need for a wider conservation concept also embracing context and fruition issues. The article introduces the case study and its delicate environment, and the technological background of heritage monitoring solutions; the proposed IoT infrastructure is then described, discussing its potentialities and IoT contribution to creating more holistic and multiscale perspectives to heritage conservation.", "venue": "Sustainability", "year": 2020, "fieldsOfStudy": ["Business"], "publicationTypes": null, "publicationDate": "2020-08-13", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "40414314", "name": "A. Lerario"}, {"authorId": "7171387", "name": "Antonietta Varasano"}], "citations": [{"paperId": "26b3c6d45a721eb05672112688189122d4dced32", "title": "Smart Heritage Practice and Its Characteristics Based on Architectural Heritage Conservation—A Case Study of the Management Platform of the Shanghai Federation of Literary and Art Circles China"}, {"paperId": "551c87a0c3176684f4d8e841c6f112ff94a9e0b5", "title": "Digital twins for the automation of the heritage construction sector"}, {"paperId": "2ff804ccba3755cc0bf99d34bb1fe42122145b71", "title": "Digital twin applications on cultural world heritage sites in China: A state-of-the-art overview"}, {"paperId": "abeda391c250abcbc4ad622e4964f7a792558a00", "title": "INTEGRATION OF DIFFERENT TYPES OF SURVEY OUTPUT AND THE INFORMATION ASSET IN A 3D MODEL OF THE CASTELLO SFORZESCO IN MILAN"}, {"paperId": "70296a7342d28dff28a7e0566061aa05607a1567", "title": "Technologies for the Preservation of Cultural Heritage—A Systematic Review of the Literature"}, {"paperId": "7f203bef3a56d27ae5fe757d4a6a48de7385b966", "title": "Smart Heritage for Urban Sustainability: A Review of Current Definitions and Future Developments"}, {"paperId": "a4681991cffd69ae7a162ca45807c751859f5a34", "title": "The Application of Advanced Information Technologies in Civil Infrastructure Construction and Maintenance"}, {"paperId": "28ff20951b6cca6e4e6e2598fbd2bc2980d84c63", "title": "BIM AND CASTELLO SFORZESCO IN MILAN. A PARTICULAR APPROACH TO DIGITIZATION OF THE ARCHITECTURAL AND INFORMATION HERITAGE"}, {"paperId": "f5046691112cc2430a704d41c2320e7b355c8642", "title": "Structural health monitoring of civil engineering structures by using the internet of things: A review"}, {"paperId": "1ca4ce635070056fb080c217669523a03e179365", "title": "Bibliometric and visualized review of smart tourism research"}, {"paperId": "c9a16156e1e7fe756b62b96ac13fb831c549d90f", "title": "Projections of IoT Applications in Colombia Using 5G Wireless Networks"}, {"paperId": "ba1380e397cfb3e543da30b10f736035d229a994", "title": "Mobile Communications for Tourism and Hospitality: A Review of Historical Evolution, Present Status, and Future Trends"}, {"paperId": "4ea27f485a2e3414ad71b0a75720a97c84ea6486", "title": "A “Smartly Functional” Urban 3D Model: A New Way to Preserve the State of Health and Quality of a Complex Masonry Structure"}]}
