{"paperId": "dd92164cff546aa7d999974c93915621296384d2", "publicationVenue": null, "title": "Creation of the method of multipath routing using known paths in software-defined networks", "abstract": "The object of the research is the creation of a multipath routing algorithm for software-defined networks (SDN) including known paths, subject of the research is network parameters, designed according to a certain topology and using the developed algorithm. One of the most problematic aspects of contemporary computer networks (including applied SDN networks) is overloading. This results in harder control and limiting traffic and amount of users. Most routing algorithms that are used today have a rather large time complexity.\nIn the course of the study, the following methods were used: study of known routing solutions for SDN networks and results of their application, method of path metric computation on the given topology by the amount of «hops» (transitions between network nodes), optimization of procedure for finding the path using SDN technology capabilities. These methods were united and integrated into the development of the overall routing algorithm, which is proposed in this article.\nThe proposed multipath routing algorithm allows for the improvement of the process of traffic construction in the SDN network. This was achieved by decreasing the time complexity of the routing algorithm through the usage of previously known paths in the topology without the need to construct new ones. Involvement in the modification of the algorithm of forming distance vectors facilitated timely network reconfiguration in case its state changed. Using a centralized SDN controller made it possible to increase the stability of the network and save all configuration data in one place. The above factors make it possible to deploy an SDN network on an Edge architecture.\nObtained results of the application of the multipath routing algorithm allow to consider it effective when compared with previously proposed algorithms, based on obtained results from a practical network model, where the proposed multipath routing algorithm is used. This is because the research task was formed correctly, and the solution for this task gave correct results. Results of using the described algorithm are demonstrated, and an analysis of the obtained results is conducted, which makes it possible to confirm the accuracy of scientific research.", "venue": "Technology audit and production reserves", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-08-15", "journal": {"name": "Technology audit and production reserves"}, "authors": [{"authorId": "2129690020", "name": "D. Korenko"}, {"authorId": "2101240968", "name": "O. Cherevatenko"}, {"authorId": "2184648098", "name": "Volodymyr Rusinov"}, {"authorId": "66011741", "name": "Y. Kulakov"}], "citations": [{"paperId": "b428ec2958138beb05e9f6b4184570626efa9cdc", "title": "Fault Tolerance Exploration and SDN Implementation for de Bruijn Topology based on betweenness Coefficient"}]}
