{"paperId": "dd985a7ad70ac9ae544455c78bac2a2c8fddd709", "publicationVenue": {"id": "8e1bd4b5-d5b2-4e22-ba0a-01fe5568d472", "name": "Remote Sensing", "type": "journal", "alternate_names": ["Remote Sens"], "issn": "2315-4675", "alternate_issns": ["2072-4292"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169233", "alternate_urls": ["https://www.mdpi.com/journal/remotesensing", "http://www.mdpi.com/journal/remotesensing", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169233"]}, "title": "Rangeland Fractional Components Across the Western United States from 1985 to 2018", "abstract": "Monitoring temporal dynamics of rangelands to detect and understand change in vegetation cover and composition provides a wealth of information to improve management and sustainability. Remote sensing allows the evaluation of both abrupt and gradual rangeland change at unprecedented spatial and temporal extents. Here, we describe the production of the National Land Cover Database (NLCD) Back in Time (BIT) dataset which quantified the percent cover of rangeland components (bare ground, herbaceous, annual herbaceous, litter, shrub, and sagebrush (Artemisia spp. Nutt.) across the western United States using Landsat imagery from 1985 to 2018. We evaluate the relationships of component trends with climate drivers at an ecoregion scale, describe the nature of landscape change, and demonstrate several case studies related to changes in grazing management, prescribed burns, and vegetation treatments. Our results showed the net cover of shrub, sagebrush, and litter significantly (p < 0.01) decreased, bare ground and herbaceous cover had no significant change, and annual herbaceous cover significantly (p < 0.05) increased. Change was ubiquitous, with a mean of 92% of pixels with some change and 38% of pixels with significant change (p < 0.10). However, most change was gradual, well over half of pixels have a range of less than 10%, and most change occurred outside of known disturbances. The BIT data facilitate a comprehensive assessment of rangeland condition, evaluation of past management actions, understanding of system variability, and opportunities for future planning.", "venue": "Remote Sensing", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-02-23", "journal": {"name": "Remote. Sens.", "pages": "813", "volume": "13"}, "authors": [{"authorId": "9673377", "name": "M. Rigge"}, {"authorId": "1891772", "name": "C. Homer"}, {"authorId": "144960078", "name": "Hua Shi"}, {"authorId": "2068878564", "name": "Debra K. Meyer"}, {"authorId": "50587086", "name": "Brett Bunde"}, {"authorId": "73541572", "name": "B. Granneman"}, {"authorId": "1665943899", "name": "Kory Postma"}, {"authorId": "39950118", "name": "P. Danielson"}, {"authorId": "2078416326", "name": "Adam Case"}, {"authorId": "2446928", "name": "G. Xian"}], "citations": [{"paperId": "3dbcb10ef8af16d94839abc07606d4c8551d8d3d", "title": "Digital Mapping of Vegetative Great Groups to Inform Management Strategies"}, {"paperId": "b0ea528115b6ca7e65d62c685cc63938321807c2", "title": "Applied soft classes and fuzzy confusion in a patchwork semi-arid ecosystem: Stitching together classification techniques to preserve ecologically-meaningful information"}, {"paperId": "813c45ff1bb6abe653a5cbf09c83f9f611fc661a", "title": "Using state-and-transition simulation models to scope post-fire success in restoring greater sage-grouse habitat"}, {"paperId": "22ee9a8f642abac042b02eb7b72928023ef1f216", "title": "Predicting Exotic Annual Grass Abundance in Rangelands of the Western United States Using Various Precipitation Scenarios"}, {"paperId": "f2bb857a20b9f41cf4b25bb98865aadd4ff1278f", "title": "Connecting dryland fine-fuel assessments to wildfire exposure and natural resource values at risk"}, {"paperId": "615dd1180b4941f4f54a60e3d14c4f487007e4f7", "title": "Linear and landscape disturbances alter Mojave desert tortoise movement behavior"}, {"paperId": "3d8cf831d8e486af63dd4e0d0820d9737d7d2e46", "title": "A retrospective assessment of fuel break effectiveness for containing rangeland wildfires in the sagebrush biome."}, {"paperId": "50deee3eb223e4be2895e22b665d31bc54a91384", "title": "Long-Term Trends in Vegetation on Bureau of Land Management Rangelands in the Western United States"}, {"paperId": "d614b340f4768b2bb5cd2193c15116bf66920494", "title": "Beyond presence mapping: predicting fractional cover of non‐native vegetation in Sentinel‐2 imagery using an ensemble of MaxEnt models"}, {"paperId": "022b423a3a3a6596c34a4ee8637d024fc0de02fd", "title": "Spatial scale selection for informing species conservation in a changing landscape"}, {"paperId": "4fef4b6d64da44a61a2fd07fdce3c999ff3401dd", "title": "Defining biologically relevant and hierarchically nested population units to inform wildlife management"}, {"paperId": "b67293312d97729617bb19ddb321f31b67c3631b", "title": "Quantifying Aspects of Rangeland Health at Watershed Scales in Colorado Using Remotely Sensed Data Products"}, {"paperId": "8e09a2b4a30c08a353b8b6670b8fa698dd2a4126", "title": "Trends analysis of rangeland condition monitoring assessment and projection (RCMAP) fractional component time series (1985–2020)"}, {"paperId": "5f61771b49b9b73bd9e7a66cef877f38a95f7b50", "title": "Statistical considerations of nonrandom treatment applications reveal region-wide benefits of widespread post-fire restoration action"}, {"paperId": "72693e10972e65d311ed3361f4a6aef94b820452", "title": "How do accuracy and model agreement vary with versioning, scale, and landscape heterogeneity for satellite-derived vegetation maps in sagebrush steppe?"}, {"paperId": "efdd20afe28e748253e08940523f8b983ab5a361", "title": "Bridging the Gap between Spatial Modeling and Management of Invasive Annual Grasses in the Imperiled Sagebrush Biome,"}, {"paperId": "1965e1530cd14c334acd473b16d8181e528576c6", "title": "Invasion of annual grasses following wildfire corresponds to maladaptive habitat selection by a sagebrush ecosystem indicator species"}, {"paperId": "fa18a5cf18e560aec6083b7a466c66f56854f5e6", "title": "Multi-Species Inference of Exotic Annual and Native Perennial Grasses in Rangelands of the Western United States Using Harmonized Landsat and Sentinel-2 Data"}, {"paperId": "fe00b044e0c635697c6c75160a0915b60cbcf37a", "title": "Ecological potential fractional component cover based on Long-Term satellite observations across the western United States"}, {"paperId": "d8e82f1b9586749604b726195a0b71a3989e4969", "title": "Projected change in rangeland fractional component cover across the sagebrush biome under climate change through 2085"}, {"paperId": "20fa8cf3b267fca4e6448212b01bc90eb6299fa8", "title": "Human population growth and accessibility from cities shape rangeland condition in the American West"}]}
