{"paperId": "dda199bcb834114bcf1a7a58be5bb6e46a93888b", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Interactive Data Exploration of Distributed Raw Files: A Systematic Mapping Study", "abstract": "When exploring big amounts of data without a clear target, providing an interactive experience becomes really difficult, since this tentative inspection usually defeats any early decision on data structures or indexing strategies. This is also true in the physics domain, specifically in high-energy physics, where the huge volume of data generated by the detectors are normally explored via C++ code using batch processing, which introduces a considerable latency. An interactive tool, when integrated into the existing data management systems, can add a great value to the usability of these platforms. Here, we intend to review the current state-of-the-art of interactive data exploration, aiming at satisfying three requirements: access to raw data files, stored in a distributed environment, and with a reasonably low latency. This paper follows the guidelines for systematic mapping studies, which is well suited for gathering and classifying available studies. We summarize the results after classifying the 242 papers that passed our inclusion criteria. While there are many proposed solutions that tackle the problem in different manners, there is little evidence available about their implementation in practice. Almost all of the solutions found by this paper cover a subset of our requirements, with only one partially satisfying the three. The solutions for data exploration abound. It is an active research area and, considering the continuous growth of data volume and variety, is only to become harder. There is a niche for research on a solution that covers our requirements, and the required building blocks are there.", "venue": "IEEE Access", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "10691-10717", "volume": "7"}, "authors": [{"authorId": "1404618355", "name": "A. Álvarez-Ayllón"}, {"authorId": "1402940931", "name": "M. Palomo-duarte"}, {"authorId": "1779677", "name": "J. Dodero"}], "citations": [{"paperId": "a2b6308434b48b09664d0137d4b4c85fe6839462", "title": "PresQ: Discovery of Multidimensional Equally-Distributed Dependencies via Quasi-Cliques on Hypergraphs"}, {"paperId": "d7fee610bbe3ff3f4d05f3b09cdefe7b5e629113", "title": "A Survey of Bigdata Analysis, Extracting Data and Mapping the Data"}, {"paperId": "145b45b05ef548d195a445ead5b6644f4e29b0ee", "title": "Artificial Intelligence Model for Classification of Sensitivity Data Utilized at Industrial Applications"}, {"paperId": "707f37a1645c30fd367986e2a3b0806e840d55a2", "title": "Noise Resistant Multidimensional Data Fusion via Quasi-Cliques on Hypergraphs"}, {"paperId": "b1154b1113da789a2a8fdbc702611957d31e550a", "title": "Computación creativa y desarrollo centrado en el usuario para el aprendizaje"}]}
