{"paperId": "dda9d9b371a7961be74fcfd77923d87d008b99dd", "publicationVenue": null, "title": "No Community Can Do Everything: Why People Participate in Similar Online Communities", "abstract": "Large-scale quantitative analyses have shown that individuals frequently talk to each other about similar things in different online spaces. Why do these overlapping communities exist? We provide an answer grounded in the analysis of 20 interviews with active participants in clusters of highly related subreddits. Within a broad topical area, there are a diversity of benefits an online community can confer. These include (a) specific information and discussion, (b) socialization with similar others, and (c) attention from the largest possible audience. A single community cannot meet all three needs. Our findings suggest that topical areas within an online community platform tend to become populated by groups of specialized communities with diverse sizes, topical boundaries, and rules. Compared with any single community, such systems of overlapping communities are able to provide a greater range of benefits.", "venue": "Proc. ACM Hum. Comput. Interact.", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-01-12", "journal": {"name": "Proceedings of the ACM on Human-Computer Interaction", "pages": "1 - 25", "volume": "6"}, "authors": [{"authorId": "9486542", "name": "Nathan TeBlunthuis"}, {"authorId": "3396614", "name": "C. Kiene"}, {"authorId": "2106002429", "name": "Isabella Brown"}, {"authorId": "2149675231", "name": "Laura Levi"}, {"authorId": "2149677801", "name": "Nicole McGinnis"}, {"authorId": "37264444", "name": "Benjamin Mako Hill"}], "citations": [{"paperId": "a1693b1cc49494befbb9d67a9d48f7e3efa33106", "title": "Governance Capture in a Self-Governing Community: A Qualitative Comparison of the Serbo-Croatian Wikipedias"}, {"paperId": "6106fed7e17b8f6c4a0706e84fce68b7c51a61da", "title": "\"Digital Sanctums of Empowerment\": Exploring Community and Everyday Resilience-Building Tactics in Online Professional Communities for Women"}, {"paperId": "e56f27741621238f893db751df6eb55bfc1a06f6", "title": "The Impact of Governance Bots on Sense of Virtual Community"}, {"paperId": "523ad7ab3d7e9dbd421b40ff69a07de14193e085", "title": "On the Innovation Mechanism and Communication Path of Philosophical Thinking in Innovative Community Environment"}, {"paperId": "7462ce54241e31ad08a291219a0ac11970d11ab4", "title": "A Systems Approach to Studying Online Communities"}, {"paperId": "d9843797fa08db4a4321ac2bd982d1ef0b231c98", "title": "Identifying Competition and Mutualism Between Online Groups"}, {"paperId": "6612b372d838e74d8365ae96a90d981b541ed081", "title": "The Strange Case of Jekyll and Hyde: Analysis of r/ToastMe and r/RoastMe Users on Reddit"}]}
