{"paperId": "dda986751968714074431c1c5f8abd09da31aad0", "publicationVenue": {"id": "86c43745-31d9-4c1a-b33f-ce3aa0042dbb", "name": "USENIX Symposium on Operating Systems Design and Implementation", "type": "conference", "alternate_names": ["Oper Syst Des Implement", "Operating Systems Design and Implementation", "OSDI", "USENIX Symp Oper Syst Des Implement"]}, "title": "Retrofitting High Availability Mechanism to Tame Hybrid Transaction/Analytical Processing", "abstract": "Many application domains can benefit from hybrid transaction/analytical processing (HTAP) by executing queries on real-time datasets produced by concurrent transactions. However, with the increasingly speedy transactions and queries thanks to large memory and fast interconnect, commodity HTAP systems have to make a tradeoff between data freshness and performance degradation. Fortunately, we observe that the backups for high availability in modern distributed OLTP systems can be retrofitted to bridge the analytical queries and transactions in HTAP workloads. In this paper, we present VEGITO, a distributed in-memory HTAP system that embraces freshness and performance with the following three techniques: (1) a lightweight gossip-style scheme to apply logs on backups consistently; (2) a block-based design for multi-version columnar backups; (3) a two-phase concurrent updating mechanism for the tree-based index of backups. They collectively make the backup fresh, columnar, and fault-tolerant, even facing millions of concurrent transactions per second. Evaluations show that VEGITO can perform 1.9 million TPC-C NEWORDER transactions and 24 TPC-Hequivalent queries per second simultaneously, which retain the excellent performance of specialized OLTP and OLAP counterparts (e.g., DrTM+H and MonetDB). These results outperform state-of-the-art HTAP systems by several orders of magnitude on transactional performance, while just incurring little performance slowdown (5% over pure OLTP workloads) and still enjoying data freshness for analytical queries (less than 20 ms of maximum delay) in the failure-free case. Further, VEGITO can recover from cascading machine failures by using the columnar backup in less than 60 ms.", "venue": "USENIX Symposium on Operating Systems Design and Implementation", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": null, "journal": {"pages": "219-238"}, "authors": [{"authorId": "1883576391", "name": "Sijie Shen"}, {"authorId": "144593763", "name": "Rong Chen"}, {"authorId": "2118438836", "name": "Haibo Chen"}, {"authorId": "7274044", "name": "B. Zang"}], "citations": [{"paperId": "a9ba7e1ce9ae6266fc1befec0b0e4c79ca9323b6", "title": "Rethink Query Optimization in HTAP Databases"}, {"paperId": "1b981ea7ae053079c96667fe995fb8cc9c6e1c5c", "title": "Breathing New Life into an Old Tree: Resolving Logging Dilemma of\n B\n +\n -tree on Modern Computational Storage Drives"}, {"paperId": "c77b4f585fc02c163fd3632dbefd860da7d52431", "title": "PolarDB-IMCI: A Cloud-Native HTAP Database System at Alibaba"}, {"paperId": "cf93aad25b5d81d1dac1e5f457ed70f40a79c317", "title": "FNotify: A Low-Latency and Scalable Publish/Subscribe System using RDMA"}, {"paperId": "1195e75f12802f8824bf00aa83b2d9bf694c8800", "title": "HiStore: Rethinking Hybrid Index in RDMA-based Key-Value Store"}, {"paperId": "2eec1071522945151de2359f5ed5435adc2db8c7", "title": "ByteHTAP: ByteDance's HTAP System with High Data Freshness and Strong Data Consistency"}, {"paperId": "0f513d75f7b4b11442a2db6f57a4661ec7af1a04", "title": "HTAP Databases: What is New and What is Next"}, {"paperId": "18b868db67b84c1029b2596cfb0c2f9d0d8e9801", "title": "OLxPBench: Real-time, Semantically Consistent, and Domain-specific are Essential in Benchmarking, Designing, and Implementing HTAP Systems"}, {"paperId": "5623f02053b6dd38389dc6aa0b7f510ce1e0449b", "title": "DrTM+B: Replication-driven Live Reconfiguration for Fast and General Distributed Transaction Processing"}, {"paperId": "e028a898a971ea9b98f5f10cef8c82bcc81607f4", "title": "Characterizing and Optimizing Remote Persistent Memory with RDMA and NVM"}, {"paperId": "febbe50d95e27e99c46a0d431dffd371203e57a4", "title": "This paper is included in the Proceedings of the 2023 USENIX Annual Technical Conference."}]}
