{"paperId": "ddaaf3a808e696c0439dc7ec4d94bd8751138814", "publicationVenue": null, "title": "Hybrid Adaptive Computational Intelligence-based Multisensor Data Fusion applied to real-time UAV autonomous navigation", "abstract": "Nowadays, there is a remarkable world trend in employing UAVs and drones for diverse applications. The main reasons are that they may cost fractions of manned aircraft and avoid the exposure of human lives to risks. Nevertheless, they depend on positioning systems that may be vulnerable. Therefore, it is necessary to ensure that these systems are as accurate as possible, aiming to improve the navigation. In pursuit of this end, conventional Data Fusion techniques can be employed. However, its computational cost may be prohibitive due to the low payload of some UAVs. This paper proposes a Multisensor Data Fusion application based on Hybrid Adaptive Computational Intelligence - the cascaded use of Fuzzy C-Means Clustering (FCM) and Adaptive-Network-Based Fuzzy Inference System (ANFIS) algorithms - that have been shown able to improve the accuracy of current positioning estimation systems for real-time UAV autonomous navigation. In addition, the proposed methodology outperformed two other Computational Intelligence techniques.", "venue": "Inteligencia Artif.", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-05-09", "journal": {"name": "Inteligencia Artif.", "pages": "162-195", "volume": "22"}, "authors": [{"authorId": "51927760", "name": "Ângelo de Carvalho Paulino"}, {"authorId": "145712401", "name": "L. Guimarães"}, {"authorId": "2786646", "name": "E. H. Shiguemori"}], "citations": [{"paperId": "01ce29e048064fcdd8966067c4e696a5d0e100f8", "title": "The Perception of the Syrian Asylum Seekers in Turkey: Sentiment Analysis with Twitter Data"}, {"paperId": "a2a9de984dab80899af74ae526d63afe6e2bac30", "title": "Data Selection for Training the Neural Fuser Applied to Autonomous UAV Navigation"}, {"paperId": "0a8a08a4dc290ac8c274dae6e95c35435b8e7494", "title": "Application of Virtual Reality Based on Multisensor Data Fusion in Theater Space and Installation Art"}, {"paperId": "47f6417e8542c43bc11181ac5a95b3418c7bef0a", "title": "Design of Intelligent Fire Alarm System Based on Multisensor Data Fusion"}, {"paperId": "976c92bf9ea52a68101e3cc1e3307be56a61c15a", "title": "Filtering based multi-sensor data fusion algorithm for a reliable unmanned surface vehicle navigation"}, {"paperId": "8078db38b1271df2831bc430cbc7ffb993f603e3", "title": "Security analysis and enhancements of UAS architecture"}, {"paperId": "4df978f1566ff2687352a3115a60d7880862a681", "title": "Impact of Artificial Intelligence in South African Construction Project Management Industry"}, {"paperId": "09111e629bc63e5f69799a5398ad56763db01780", "title": "Prediction of the risk of developing hepatocellular carcinoma in health screening examinees: a Korean cohort study"}, {"paperId": "e3bddde9f54a2a5e766e79b8f63290e98a421d15", "title": "DEVELOPMENT OF A DATA-DRIVEN MODEL TO PREDICT LANDSLIDE SENSITIVE AREAS"}, {"paperId": "97f1ecac8bc485ee9b11445a09c5194bc532436a", "title": "Development and validation of a nomogram to predict pulmonary function and the presence of chronic obstructive pulmonary disease in a Korean population"}, {"paperId": "e9b9fcb6d798e345410258585a70ed1a481e737c", "title": "Assessment of Noise Impact on Hybrid Adaptive Computational Intelligence Multisensor Data Fusion Applied to Real-Time UAV Autonomous Navigation"}, {"paperId": "5e10e03df6d96faa00c6693874f3544ef5ea5f77", "title": "Assessment of Noise Impact on Hybrid Adaptive Computational Intelligence Multisensor Data Fusion Applied to Real-Time UAV Autonomous Navigation"}]}
