{"paperId": "ddb9e85a13fd930308559a3090ef4794b216b4bb", "publicationVenue": {"id": "d7089def-9c58-400e-8dca-8cd46e9e75b8", "name": "International Conference on Artificial Intelligence Testing", "type": "conference", "alternate_names": ["AITest", "Int Conf Artif Intell Test"]}, "title": "Neural Network Classification for Improving Continuous Regression Testing", "abstract": "Continuous regression testing is a time constrained process aimed at detecting potential regressions introduced in source code integration. Test prioritization is an approach to increase the efficiency of continuous regression testing, by finding an order of tests that can detect regressions faster. The challenge for test prioritization in continuous integration is the scalability of continuous prioritization as more test execution data becomes available. In this paper we propose an approach that learns to prioritize regression tests by training a prediction model based on the existing fault detection ability of tests. We perform experiments in a case study of regression testing of industrial software developed in continuous integration. The initial results show that a learning-based approach can reduce test prioritization time, compared to a non-learning approach, while achieving a comparable fault detection effectiveness.", "venue": "International Conference on Artificial Intelligence Testing", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-08-01", "journal": {"name": "2020 IEEE International Conference On Artificial Intelligence Testing (AITest)", "pages": "123-124"}, "authors": [{"authorId": "1686499", "name": "D. Marijan"}, {"authorId": "34962645", "name": "A. Gotlieb"}, {"authorId": "1921967346", "name": "Abhijeet Sapkota"}], "citations": [{"paperId": "07a58339b1eddc506b957cf91ea17462043876e5", "title": "AI for Agile development: a Meta-Analysis"}, {"paperId": "bdab29415be76e68d3c98defb72fc882d9daaf42", "title": "Empirically evaluating readily available information for regression test optimization in continuous integration"}]}
