{"paperId": "ddc7dbc8b04debe61cb50c5ca25f6517acdbb0ad", "publicationVenue": {"id": "322ccdfc-7f41-43c3-949f-8222100d750c", "name": "IEEE Power and Energy Magazine", "type": "journal", "alternate_names": ["IEEE Power  Energy Mag", "IEEE Power & Energy Magazine", "IEEE Power Energy Mag"], "issn": "1540-7977", "alternate_issns": ["1558-4216"], "url": "https://ieeexplore.ieee.org/servlet/opac?punumber=8014", "alternate_urls": ["http://magazine.ieee-pes.org/", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=8014", "https://magazine.ieee-pes.org/"]}, "title": "Transmission and Distribution Equipment: Providing Intelligent Maintenance", "abstract": "One of the cornerstones of a reliable transmission and distribution (T&D) grid operation is fully functional components that can operate robustly and with a low outage rate under all specified operating conditions. Dependable maintenance strategies are thus indispensable and are applied by grid operators around the world. One of the present key challenges in many countries with a widely developed T&D grid system is aging components that reach their anticipated end of life. Asset management faces the question of whether the lifetime of components could be prolonged and the replacement could be delayed. For this, the health of the components needs to be assessed and is ideally continuously monitored. In addition to this, the currently ongoing transition of the entire energy system leads to a change and increase of stress on the T&D equipment. The integration of new renewable energy sources on all voltage levels leads to bidirectional power flows and increased variability. The higher demand for electric power not only increases power-flow levels on average, but also in particular, peak flows. The result of this changed and increased stress on the equipment is an accelerated aging component and the need for maintenance strategies to be adopted for this new situation.", "venue": "IEEE Power and Energy Magazine", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-03-01", "journal": {"name": "IEEE Power and Energy Magazine", "pages": "18-29", "volume": "21"}, "authors": [{"authorId": "145280855", "name": "C. Franck"}, {"authorId": "1409939167", "name": "Chi-Ching Hsu"}, {"authorId": "2200097554", "name": "Yungong Xiao"}, {"authorId": "88303104", "name": "P. Bleuler"}, {"authorId": "150110657", "name": "Gaëtan Frusque"}, {"authorId": "30571677", "name": "M. Muratovic"}, {"authorId": "2238207253", "name": "Tommaso Polonelli"}], "citations": [{"paperId": "e9ce679c45921b2a3d288be6005e8a6fa2d5ee32", "title": "Providing Intelligent Maintenance through an Autonomous Robot"}]}
