{"paperId": "ddc8496c9d5ca4ecf220a76d3224e03a43f10a84", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "A Fog Computing-Based Device-Driven Mobility Management Scheme for 5G Networks", "abstract": "The fog computing-based device-driven network is a promising solution for high data rates in modern cellular networks. It is a unique framework to reduce the generated-data, data management overheads, network scalability challenges, and help us to provide a pervasive computation environment for real-time network applications, where the mobile data is easily available and accessible to nearby fog servers. It explores a new dimension of the next generation network called fog networks. Fog networks is a complementary part of the cloud network environment. The proposed network architecture is a part of the newly emerged paradigm that extends the network computing infrastructure within the device-driven 5G communication system. This work explores a new design of the fog computing framework to support device-driven communication to achieve better Quality of Service (QoS) and Quality of Experience (QoE). In particular, we focus on, how potential is the fog computing orchestration framework? How it can be customized to the next generation of cellular communication systems? Next, we propose a mobility management procedure for fog networks, considering the static and dynamic mobile nodes. We compare our results with the legacy of cellular networks and observed that the proposed work has the least energy consumption, delay, latency, signaling cost as compared to LTE/LTE-A networks.", "venue": "Italian National Conference on Sensors", "year": 2020, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-10-23", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "20"}, "authors": [{"authorId": "3175497", "name": "S. K. Biswash"}, {"authorId": "3419444", "name": "D. Jayakody"}], "citations": [{"paperId": "946823f6e0118a646c32d7c2aa3ae58a1f09a276", "title": "Fog Computing Complete Review: Concepts, Trends, Architectures, Technologies, Simulators, Security Issues, Applications, and Open Research Fields"}, {"paperId": "f50955adff84b6feef26391e51499a382e8da559", "title": "Energy-Aware Next-Generation Mobile Routing Chains with Fog Computing for Emerging Applications"}, {"paperId": "f4aa5473d4ef7c6d5e42ae6e338e53d1070ff03f", "title": "Device and network driven cellular networks architecture and mobility management technique for fog computing-based mobile communication system"}, {"paperId": "881806ed444618a22f8d5183fb95555e0b91fac6", "title": "A Self-Optimizing Technique Based on Vertical Handover for Load Balancing in Heterogeneous Wireless Networks Using Big Data Analytics"}, {"paperId": "946f0f21fc154b7f65ffa7d6ed2c5e71e5b1e9eb", "title": "Bee System-Based Self Configurable Optimized Resource Allocation Technique in Device-to-Device (D2D) Communication Networks"}]}
