{"paperId": "ddefd4984640fed157d207e2441824d992cb22f0", "publicationVenue": {"id": "4683b5ad-e083-4ec9-bdbb-918cf13ee178", "name": "International Journal of Advanced Technology and Engineering Exploration", "type": "journal", "alternate_names": ["Int J Adv Technol Eng Explor"], "issn": "2394-7454", "alternate_issns": ["2394-5443"], "url": "http://accentsjournals.org/journals1.php?journalsId=110"}, "title": "Factors affecting cloud data-center efficiency: a scheduling algorithm-based analysis", "abstract": ". Nevertheless, only a few studies have analyzed the proposed techniques and their Abstract Cloud computing encompasses two massively scalable services: computing capability and data storage space, which are provided by a massive number of machines and clusters. The increased use of big data has resulted in adopting a wide range of analytics engines, such as Hadoop. As a result, Hadoop has gained widespread acceptance as a data analytics platform. Over the past decade, Hadoop's ability to schedule tasks has become a critical aspect of system performance. Numerous researchers have presented various scheduling methods in their work to address the complex issue of performance degradation. However, few studies have been conducted to date to evaluate the effectiveness of these methods. By employing the PRISMA approach for searching and selecting papers, we examine the design choices that went into various Hadoop scheduling techniques proposed between 2008 and 2021. We present a taxonomy for succinctly categorising these scheduling techniques. Additionally, we evaluate methodologies based on a variety of performance metrics. Our search identified 82 studies relevant to this domain, all of which came from high-quality conferences, journals, symposiums, and workshops. This systematic study discusses various dynamic, constrained, and adaptive scheduling methods and their primary motivations, including makespan, data control, deadline, resource utilisation, load balancing, fairness, energy efficiency, and failure recovery. There is also a discussion of some unresolved issues and potential future directions for modifying existing studies. This study conducts a systematic review of the literature to identify and discuss the most critical factors affecting Hadoop scheduler performance and provide a roadmap for researchers working in this field. Finally, we intend to expand on the qualitative analysis conducted thus far and give the experts additional recommendations to conduct future cloud scheduling research.", "venue": "International Journal of Advanced Technology and Engineering Exploration", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2021-09-30", "journal": {"name": "International Journal of Advanced Technology and Engineering Exploration"}, "authors": [{"authorId": "2110016748", "name": "S. A. Ahmad"}, {"authorId": "2142041414", "name": "Butt Muheet Ahmed"}, {"authorId": "145810588", "name": "Zamani Majid"}], "citations": [{"paperId": "35b6e4dd7df6b84ae45d6a4dd94fd932f0b92afc", "title": "Hard Voting Meta Classifier for Disease Diagnosis using Mean Decrease in Impurity for Tree Models"}]}
