{"paperId": "ddf5d0dabf9d7463c306d2969307a9541d96ba66", "publicationVenue": null, "title": "Big data framework for students' academic performance prediction: A systematic literature review", "abstract": "Big Data is becoming an integral part of education system worldwide, bringing in so much of prediction potential and therefore opportunities to improve learning and teaching methodologies. In fact, it has become the digital policy instrument for policy makers to make strategic decisions supported by big data analytics. This paper uses Systematic Literature Review (SLR) to establish a general overview and background in establishing gaps that need to be addressed in big data analytics for education landscape. A total of 59 research papers from 473 papers were chosen and analyzed. There is an increased trend in incorporating big data in education however, it is not sufficient and need more research in this area particularly predictive models and frameworks for educational settings.", "venue": "2018 IEEE Symposium on Computer Applications & Industrial Electronics (ISCAIE)", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2018-04-01", "journal": {"name": "2018 IEEE Symposium on Computer Applications & Industrial Electronics (ISCAIE)", "pages": "376-382"}, "authors": [{"authorId": "20962818", "name": "S. Muthukrishnan"}, {"authorId": "1873824", "name": "N. Yasin"}, {"authorId": "51052085", "name": "M. Govindasamy"}], "citations": [{"paperId": "7f089798fc0f627ff34483250fbb7aeeb9118a6c", "title": "Development of a system for adaptive control of the components of an intelligent educational environment"}, {"paperId": "8adb47deeef943c2c1bae41f9498a382fb818a16", "title": "Big data in education: a state of the art, limitations, and future research directions"}, {"paperId": "c692818a9850e62b63086263574272d8618464eb", "title": "The Antecedent of Student Academic Achievement Prediction"}, {"paperId": "3166b71c1f9c8eafe94beea446cd18020c03745d", "title": "Use of Big data to Measure Attentiveness of the Student"}, {"paperId": "6f284a97f5a7e6c4f5eface45a8cb422d22dbf73", "title": "Smart Education: A Review and Future Research Directions"}, {"paperId": "b0a8e93f988d7bfae00e5ac8e0d9481a1b25c501", "title": "A Systematic Review on Big Data Analytics Frameworks for Higher Education - Tools and Algorithms"}, {"paperId": "058b1bd0429a51abef9fd501f398fe0ef364bb78", "title": "Tools for Convergence, Actualization and Personalizing Educational Programs and Content"}]}
