{"paperId": "ddf89551f0c275b3992f5ec294f0ba22ca2ecf9e", "publicationVenue": {"id": "138e58fc-8643-41c2-a92c-068ea4f4c607", "name": "PeerJ Computer Science", "alternate_names": ["Peerj Comput Sci"], "issn": "2376-5992", "url": "https://peerj.com/archives/?journal=cs", "alternate_urls": ["https://peerj.com/computer-science/", "http://peerj.com/cs"]}, "title": "A vehicle to vehicle relay-based task offloading scheme in Vehicular Communication Networks", "abstract": "Vehicular edge computing (VEC) is a potential field that distributes computational tasks between VEC servers and local vehicular terminals, hence improve vehicular services. At present, vehicles’ intelligence and capabilities are rapidly improving, which will likely support many new and exciting applications. The network resources are well-utilized by exploiting neighboring vehicles’ available resources while mitigating the VEC server’s heavy burden. However, due to the vehicles’ mobility, network topology, and the available computing resources change rapidly, which are difficult to predict. To tackle this problem, we investigate the task offloading schemes by utilizing vehicle to vehicle and vehicle to infrastructure communication modes and exploiting the vehicle’s under-utilized computation and communication resources, and taking the cost and time consumption into account. We present a promising relay task-offloading scheme in vehicular edge computing (RVEC). According to this scheme, the tasks are offloaded in a vehicle to vehicle relay for computation while being transmitted to VEC servers. Numerical results illustrate that the RVEC scheme substantially enhances the network’s overall offloading cost.", "venue": "PeerJ Computer Science", "year": 2021, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-04-13", "journal": {"name": "PeerJ Computer Science", "volume": "7"}, "authors": [{"authorId": "41125832", "name": "Salman Raza"}, {"authorId": "40916002", "name": "Muhammad Ayzed Mirza"}, {"authorId": "2109859178", "name": "Shahbaz Ahmad"}, {"authorId": "3072484", "name": "M. Asif"}, {"authorId": "89753628", "name": "M. B. Rasheed"}, {"authorId": "98726479", "name": "Y. Ghadi"}], "citations": [{"paperId": "5594116867bba459f14e735ff6046f8fb34d9e10", "title": "A Deep-Reinforcement-Learning-Based Computation Offloading With Mobile Vehicles in Vehicular Edge Computing"}, {"paperId": "02e8d415d73b2de34f9ab8d6768837c194e3e44e", "title": "Joint Task Offloading and Resource Allocation for Vehicular Edge Computing Based on V2I and V2V Modes"}, {"paperId": "70ddca8f30a47fb8d519356e6c49644aa40c5d92", "title": "A Safety-Aware Location Privacy-Preserving IoV Scheme with Road Congestion-Estimation in Mobile Edge Computing"}, {"paperId": "ab454a9f1d82d996c3389d17dab0bd03f23ba5e4", "title": "OES-Fed: a federated learning framework in vehicular network based on noise data filtering"}, {"paperId": "9f18eb901b78da1d40c1b537e7a1a70e30c95259", "title": "Task offloading in mmWave based 5G vehicular cloud computing"}, {"paperId": "764f166746f89c8a5e9f3c0ceca46547f6c93668", "title": "A comprehensive survey on Green ICT with 5G-NB-IoT: Towards sustainable planet"}, {"paperId": "39bd5c38f7ccecca5f3f1ed95e5b9f98871d438d", "title": "Trust-Based Reliability Enhancements Provisioning With Resilience Under Information Asymmetry in IoV System"}, {"paperId": "a1062e456ee15316fa299707782a96427f260222", "title": "Multi-Hop Assisted Offloading Strategy Based on Mobile Awareness in the Internet of Vehicles"}]}
