{"paperId": "de07c67ac4443ce1542e8c475ad2b94ef6d9af4a", "publicationVenue": null, "title": "Studmap 3.0: An Interoperable Web-Based Platform for Geospatial Data Offers in Academic Life", "abstract": ". Geographic Information Systems has now entered the realm of web and yields for feasible solutions to balance the technology offers with the users’ needs to share, access and explore the massive amounts of geodata available. Challenges occur when moving forward from old 2D platforms towards innovative and integrated webGIS systems that align functionality with the necessity to grant a complete understanding of the surrounding reality. 3D space responds to this necessity but, however, stands only at the beginning of its era and cannot yet reach the development of 2D web integration. Research is now aiming at possible webGIS solutions to adapt to the special structure imposed by 3D data. In this context, this paper focuses on designing an architecture for 2D and 3D geospatial data integration on a student-oriented web platform. This concept was further delivered and validated through a real case scenario – Studmap 3.0, a webGIS platform to serve the students of the University of Muenster in their academical life. The portal currently grants availability of geospatial data and web services of regional interest in a smart GIS environment that allows access and comparison of official services with own data. The implementation of Studmap 3.0 aided in the continuous improvement of the proposed architecture model and hence, developed under a design science research methodology. The cycle reached its end once the final approval of its users was attained via a mixed usability evaluation. Final strengths and drawbacks of the proposed architecture were ultimately identified in terms of data, system functionality, ease of implementation and usability. The usability for academical use was evaluated via a customized expert inspection, followed by a standardized student usability test of the resulting portal interface. The results fall under the acceptable range with an 83.75 score for the System Usability Scale standardized questions when addressed to experts and a score of 83.87 when addressed to students. For the open-ended questions, the interface received an overall positive critique. A summary of future participants’ opinion on the benefits, drawbacks and proposed improvements was also delivered according to the answers to the final open-ended questions. Peers interested in similar concepts can use both this model and its final remarks as a reference for their work.", "venue": "", "year": null, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "1394518901", "name": "S. Cioban"}, {"authorId": "2263387117", "name": "Vitor Santos"}, {"authorId": "2263843451", "name": "Torsten Prinz"}], "citations": []}
