{"paperId": "de08df783380ccf9e56f192e52f8cad21abd7ca3", "publicationVenue": null, "title": "Combining Aggregation and Sampling (Nearly) Optimally for Approximate Query Processing", "abstract": "Sample-based approximate query processing (AQP) suffers from many pitfalls such as the inability to answer very selective queries and unreliable confidence intervals when sample sizes are small. Recent research presented an intriguing solution of combining materialized, pre-computed aggregates with sampling for accurate and more reliable AQP. We explore this solution in detail in this work and propose an AQP physical design called PASS, or Precomputation-Assisted Stratified Sampling. PASS builds a tree of partial aggregates that cover different partitions of the dataset. The leaf nodes of this tree form the strata for stratified samples. Aggregate queries whose predicates align with the partitions (or unions of partitions) are exactly answered with a depth-first search, and any partial overlaps are approximated with the stratified samples. We propose an algorithm for optimally partitioning the data into such a data structure with various practical approximation techniques.", "venue": "SIGMOD Conference", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2021-03-29", "journal": {"name": "Proceedings of the 2021 International Conference on Management of Data"}, "authors": [{"authorId": "2132479347", "name": "Xi Liang"}, {"authorId": "2740393", "name": "Stavros Sintos"}, {"authorId": "2313853", "name": "Zechao Shang"}, {"authorId": "40428703", "name": "S. Krishnan"}], "citations": [{"paperId": "f0c335cc7d8ecc7b6b0ee1a5516e32df658b1f35", "title": "Exploiting Data-pattern-aware Vertical Partitioning to Achieve Fast and Low-cost Cloud Log Storage"}, {"paperId": "402f50dab29c61709eabe99074bb4b8fe82ccad0", "title": "PairwiseHist: Fast, Accurate and Space-Efficient Approximate Query Processing with Data Compression"}, {"paperId": "ef52c20a325806ffa1dda8c691a8ca802660b346", "title": "Range Entropy Queries and Partitioning"}, {"paperId": "b53e3a987571564332cd0a40da2a8eb164cadb7d", "title": "ALECE: An Attention-based Learned Cardinality Estimator for SPJ Queries on Dynamic Workloads (Extended)"}, {"paperId": "5013c78394c0c40625bdcf077835eebf06f07cc3", "title": "Tuple Bubbles: Learned Tuple Representations for Tunable Approximate Query Processing"}, {"paperId": "254e968613015a8a58cef90305699cc358023b14", "title": "Hierarchical Residual Encoding for Multiresolution Time Series Compression"}, {"paperId": "8430997d1f1a3c6f99e517004f88d4d1ac4869c5", "title": "LogGrep: Fast and Cheap Cloud Log Storage by Exploiting both Static and Runtime Patterns"}, {"paperId": "976cbedfaf674ad586d64d6d9646f771d524dfec", "title": "Approximate Query Processing via Tuple Bubbles"}, {"paperId": "30d77df6f07be54eebae41129ea43ef6487898dd", "title": "Exploiting Machine Learning Models for Approximate Query Processing"}, {"paperId": "6167b4dbf677b78c229524431cd5064b45395db0", "title": "JanusAQP: Efficient Partition Tree Maintenance for Dynamic Approximate Query Processing"}, {"paperId": "a171beea0e66977300b4542c987da904bcc6626f", "title": "Towards Observability for Production Machine Learning Pipelines [Vision]"}, {"paperId": "048e64291f75358bc64d241bf380cfe429e2360e", "title": "Towards Observability for Machine Learning Pipelines"}, {"paperId": "3b694dfa9df03823db0d765847a16f7cd21a8795", "title": "Data Errors: Symptoms, Causes and Origins"}, {"paperId": "960c8d6d368b08e3c701d1027dd402e9a7dc797e", "title": "Disposal by Design"}]}
