{"paperId": "de5c2fad91eef81a7d1d19f59f8e1b5ea5defe74", "publicationVenue": {"id": "99db3270-3deb-4e55-91ee-b248735ea59b", "name": "Confluence", "type": "journal", "alternate_names": ["Confluence: The Journal of Graduate Liberal Studies", "International Conference - Cloud System and Big Data Engineering", "Conflu J Grad Lib Stud", "Int Conf  Cloud Syst Big Data Eng"], "issn": "1933-0057", "url": "http://www.confluence.ou.edu/"}, "title": "Customer Segmentation of E-commerce data using K-means Clustering Algorithm", "abstract": "Several data mining techniques, such as classification, clustering, regression, etc., are used to determine the purchasing behaviour of customers to create value for money in businesses. In this paper, clustering is implemented on a real-time data set of an e-commerce firm that aims to decide whether to focus on its website or mobile application. The K-means clustering algorithm is used to segment and cluster the users for the same purpose because of the scattered nature of the data and to find hidden patterns in the data set. To define the number of clusters, the elbow method is used, and customers are grouped with respect to different attributes. Based on the analysis, a decision is made about which set of customers to target.", "venue": "Confluence", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-01-19", "journal": {"name": "2023 13th International Conference on Cloud Computing, Data Science & Engineering (Confluence)", "pages": "658-664"}, "authors": [{"authorId": "40224948", "name": "Lucky Rajput"}, {"authorId": "2108405629", "name": "S. Singh"}], "citations": [{"paperId": "34f5fbaf6ca1c2f4496897c634de5392743ff13e", "title": "Penerapan Metode Clustering Dalam Segmentasi Pelanggan Perusahaan Logistik"}, {"paperId": "277a0b72bf5c3fd8cc8d70e9f381e9b3d1437f31", "title": "Data-Driven Customer Segmentation Using Clustering Methods for Business Success"}, {"paperId": "f0c9d2294794d02f38f042172f3de99ad574c070", "title": "Market segmentation using ML"}, {"paperId": "8165b5ef502f2d342aa9bf9de804dfe553876391", "title": "Customer Segmentation Analysis leveraging Machine Learning Algorithms"}]}
