{"paperId": "de5d1db81bf7908cd1f4260037631a184fdc146c", "publicationVenue": {"id": "46113332-7a20-4c76-887c-091992a498b4", "name": "International Workshop on Metrology for Automotive", "type": "conference", "alternate_names": ["MetroAutomotive", "Int Workshop Metrol Automot"]}, "title": "Roller Bearing Failures Classification with Low Computational Cost Embedded Machine Learning", "abstract": "In this work, the authors present a Machine Learning (ML) algorithm which is able to detect incipient failures of roller bearings starting from data provided by accelerometers. Three typologies of signals coming from typical bearing failures are exploited to test the algorithm. Specifically, faults related to the bearing balls, the inner raceways, and the outer raceways are taken into account. Besides these, also a control set containing data related to bearings having no faults is exploited. Moreover, the ML algorithm is designed to be executed by a microprocessor, which can be used in a distributed sensor network that can be the base for an Internet of Things (IoT) monitoring system. In so doing, a predictive maintenance paradigm, relying on Artificial Intelligence (AI), for bearings is set up, enabling condition monitoring systems to actively predict faults thus timely halting machines.", "venue": "International Workshop on Metrology for Automotive", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-07-04", "journal": {"name": "2022 IEEE International Workshop on Metrology for Automotive (MetroAutomotive)", "pages": "12-17"}, "authors": [{"authorId": "2077107898", "name": "Matteo Bertocco"}, {"authorId": "144960176", "name": "A. Fort"}, {"authorId": "153067851", "name": "Elia Landi"}, {"authorId": "35581648", "name": "M. Mugnaini"}, {"authorId": "27053000", "name": "Lorenzo Parri"}, {"authorId": "40532940", "name": "G. Peruzzi"}, {"authorId": "15147730", "name": "A. Pozzebon"}], "citations": [{"paperId": "e72b1f11bc80887d571e0ea24558839d1e132d6c", "title": "Fault Diagnosis of Rotating Machinery Using an Optimal Blind Deconvolution Method and Hybrid Invertible Neural Network"}, {"paperId": "9d100767db3795fa8fa879b5bbdf2525d4061c14", "title": "Time-Frequency Multi-Domain 1D Convolutional Neural Network with Channel-Spatial Attention for Noise-Robust Bearing Fault Diagnosis"}, {"paperId": "93208aabcf81094821fe7ef9c74d8ef39413f5ec", "title": "A Novel Hybrid Technique Combining Improved Cepstrum Pre-Whitening and High-Pass Filtering for Effective Bearing Fault Diagnosis Using Vibration Data"}, {"paperId": "a3828b85e1ff9747711474330efda0c46810281d", "title": "A Low-Complexity FPGA-Based Neural Network for Hand-Arm Vibrations Classification"}, {"paperId": "b1ca4f0aaaa80713b7fe757b4c6bbf8abf1cff52", "title": "Highly Reliable Multicomponent MEMS Sensor for Predictive Maintenance Management of Rolling Bearings"}, {"paperId": "8422bca48c18b56a6182f126817c1ab57960c367", "title": "Fight Fire with Fire: Detecting Forest Fires with Embedded Machine Learning Models Dealing with Audio and Images on Low Power IoT Devices"}, {"paperId": "37a49fa5d1ffb9d3eb21622f53d05477ce7e362e", "title": "Integrated Gradient-Based Continuous Wavelet Transform for Bearing Fault Diagnosis"}, {"paperId": "b2e4027f7d0949ddf0cfd6b60f4b73615ce6ee59", "title": "Enhanced Visible Light Localization Based on Machine Learning and Optimized Fingerprinting in Wireless Sensor Networks"}]}
