{"paperId": "de628b7089963b2e05a3428cd4405c355b86b064", "publicationVenue": {"id": "18bece41-6c56-4e90-a68d-0a07865a4ae7", "name": "Jurnal Minfo Polgan", "type": "journal", "alternate_names": ["J Minfo Polgan"], "issn": "2089-9424"}, "title": "Digital Entrepreneurship: The Role of Digital Technology in Building New Businesses", "abstract": "The development of digital technology has fundamentally changed the way business is conducted in various sectors. In recent decades, digital technology has become a major force influencing business dynamics and providing new opportunities for entrepreneurs. Digital entrepreneurship, which involves the use of digital technologies to build new businesses, has become an increasingly interesting research subject in the fields of entrepreneurship and management studies. The purpose of this study is to investigate and deeply understand the role of digital technology in shaping new businesses in the context of digital entrepreneurship. The current research type is qualitative. Data collection techniques include listening and recording important information to conduct data analysis through data reduction, data display, and conclusion drawing. The study results arrive at a statement that digital entrepreneurship has a very important role in shaping the business landscape in the current digital era. Through the use of digital technology, entrepreneurs can create new opportunities, expand business reach, collect and analyse data, innovate, and establish effective collaborations. This phenomenon has also had a positive impact on social inclusion, enabling wider participation from previously marginalised individuals and groups. \n ", "venue": "Jurnal Minfo Polgan", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-07-21", "journal": {"name": "Jurnal Minfo Polgan"}, "authors": [{"authorId": "2233635972", "name": "Jaka Sudewa"}, {"authorId": "2233631290", "name": "Krishna Santosa Yusat"}, {"authorId": "2233619463", "name": "Muhammad Fikri Maulana"}, {"authorId": "2105485566", "name": "T. R. Fauzan"}, {"authorId": "2211241584", "name": "Rezzi Nanda Barizki"}], "citations": [{"paperId": "8e2c98d0a26370bea5c37cc2f3cafbf11320b4bc", "title": "The Impact of Digital Transformation on Human Resource Development in the Online Business Paradigm"}, {"paperId": "03478315f786a2f0eb249dec65b4d533d3b33cda", "title": "Use of Digital Technology to Support the Entrepreneurship Education Process"}]}
