{"paperId": "de62c7aee59c96d6601542925475862c4f31bc67", "publicationVenue": null, "title": "Sustainable cities: major challenges and trends", "abstract": "The world community begins realizing that human activity in urban systems has led to a socio-ecological crisis over the course of the development of civilization. The way out of this crisis is possible only through the formation of a new approach to the development of a sustainable habitat for existing population groups, excluding the possibility of large-scale destruction of the natural environment as a result of meeting human needs. In this regard, the term “sustainable city (eco-city)” appears in scientific circulation, which currently does not have a clear agreed definition. Generally, development experts agree that a sustainable city must meet the needs of the population without sacrificing the ability of future generations to meet their own needs. The ambiguity in this idea leads to large variations in how cities perform in their attempts to become sustainable. In these conditions, the task of creating an effective mechanism for managing urban sustainability becomes complex, including work on creating a concept, strategy and program for sustainable development of all subsystems of the city. Thus, the idea of sustainable eco-city development can and should become our national idea and play an important role in determining state priorities and prospects for further economic growth.", "venue": "IOP Conference Series: Materials Science and Engineering", "year": 2020, "fieldsOfStudy": ["Physics", "Business"], "publicationTypes": ["Conference"], "publicationDate": "2020-08-13", "journal": {"name": "IOP Conference Series: Materials Science and Engineering", "volume": "890"}, "authors": [{"authorId": "2078163063", "name": "A. Afanasyeva"}, {"authorId": "2005263235", "name": "Roza Safma"}, {"authorId": "120123434", "name": "I. Kursina"}], "citations": [{"paperId": "f813593b6ffaac4fa40a272f3ee2e660c0e73792", "title": "Novel criteria for sustainable use of urban spaces under bridges in cities by applying DEMATEL technique"}, {"paperId": "2cc1a6a48d71829f8d1775d6387195b43777f7de", "title": "Renewable Energy Sources in the Era of the Fourth Industrial Revolution: a Perspective of Civilization Development"}, {"paperId": "d0f8cc176922fcf1284839ee2ff5673249a61654", "title": "“Smart” transport and logistics complex as a factor of sustainable development of the region (on the example of the Volgograd region)"}, {"paperId": "62edbc3ae0b9836f4cbb7251ed96dc3bf07097c5", "title": "Assessment of innovation risks in the context of sustainable development"}, {"paperId": "e310a6e8d5b08dfabb5a6d9fbe5fd48a6add498d", "title": "An Insight of Navigating Climate Change in Humid Tropical Cities in Brunei Darussalam"}]}
