{"paperId": "de949f8ede5beb2a274f34cb3f27804d18ef0d5c", "publicationVenue": null, "title": "Data-driven Bus Crowding Prediction Models Using Context-specific Features", "abstract": "Public transit is one of the first things that come to mind when someone talks about “smart cities.” As a result, many technologies, applications, and infrastructure have already been deployed to bring the promise of the smart city to public transportation. Most of these have focused on answering the question, “When will my bus arrive?”; little has been done to answer the question, “How full will my next bus be?” which also dramatically affects commuters’ quality of life. In this article, we consider the bus fullness problem. In particular, we propose two different formulations of the problem, develop multiple predictive models, and evaluate their accuracy using data from the Pittsburgh region. Our predictive models consistently outperform the baselines (by up to 8 times).", "venue": "Trans. Data Sci.", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-09-14", "journal": {"name": "ACM Transactions on Data Science", "pages": "1 - 33", "volume": "1"}, "authors": [{"authorId": "23551855", "name": "Tahereh Arabghalizi"}, {"authorId": "1716685", "name": "Alexandros Labrinidis"}], "citations": [{"paperId": "a0fe10f11420e0ce0171fe4aad03ddcb6694260c", "title": "Addressing APC Data Sparsity in Predicting Occupancy and Delay of Transit Buses: A Multitask Learning Approach"}, {"paperId": "d25cc669ba56f9bae2d48c97ab14113a9a49413b", "title": "Bus Ridership Prediction with Time Section, Weather, and Ridership Trend Aware Multiple LSTM"}, {"paperId": "55f154c0192e2e1e7aaa9af0f69ea001e595ab44", "title": "Development of a Passenger Assistance System to Increase the Attractiveness of Local Public Transport"}, {"paperId": "a1393dc40c28f86afe96dcc7531a442507685533", "title": "Enabling and Emerging Sensing Technologies for Crowd Management in Public Transportation Systems: A Review"}, {"paperId": "4b97b99832a325d96aeb169c392237506ad47786", "title": "Enabling and Emerging Sensing Technologies for Crowd Avoidance in Public Transportation: A Review"}, {"paperId": "ffa3235384d90e1343862b1b1b8840c4fa2f8085", "title": "Sensing Technologies for Crowd Management, Adaptation, and Information Dissemination in Public Transportation Systems: A Review"}, {"paperId": "c6dd414648a29f368c1e9a35963156e5cffe4dfb", "title": "Improving the Prediction of Passenger Numbers in Public Transit Networks by Combining Short-Term Forecasts With Real-Time Occupancy Data"}, {"paperId": "cc9ae222059d4adc228729eafc27a88b964a5d5f", "title": "A Ranked Bandit Approach for Multi-stakeholder Recommender Systems"}]}
