{"paperId": "de96b9f434ccb869ededc1599da767335dd70346", "publicationVenue": null, "title": "A Secure Face Recognition for IoT-enabled Healthcare System", "abstract": "In Healthcare, the Internet of Things (IoT)-enabled surveillance cameras capture thousands of images every day, where face recognition provides reliable security as well as smart treatment through patient sentiment analysis, emotion detection, automated nurse calls, and hospital traffic systems. In this article, a secure face recognition system for the IoT-enabled Healthcare system has been proposed. Here each registered person will be identified by his/her face biometric with strong template protection schemes. To protect the biometric information, three-step template protection techniques are proposed: (i) Cancelable biometrics, (ii) BioCrypto-Circuit, and (iii) BioCrypto-Protection. The performance of the proposed system has been tested on four benchmark face databases, CVL, IITK, Casia-Face-v5, and FERET. The results of the proposed system are reported in terms of the correct recognition rate and the equal error rate. These performances have also been compared with some state-of-the-art methods with respect to each employed database, which shows the novelty of the proposed system.", "venue": "ACM Trans. Sens. Networks", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-05-09", "journal": {"name": "ACM Transactions on Sensor Networks", "pages": "1 - 23", "volume": "19"}, "authors": [{"authorId": "1443760157", "name": "Alamgir Sardar"}, {"authorId": "2138686", "name": "Saiyed Umer"}, {"authorId": "2164386743", "name": "R. K. Rout"}, {"authorId": "2121366199", "name": "Shuihua Wang"}, {"authorId": "47829536", "name": "M. Tanveer"}], "citations": [{"paperId": "19e1c080492db9a5ddf07e45106e1633eb79764c", "title": "IoT-Enabled Multimodal Biometric Recognition System in Secure Environment"}, {"paperId": "a5da4fb5baddb1dbc47fb9f998e4ab40ff010a53", "title": "Face recognition for human identification through integration of complex domain unsupervised and supervised frameworks"}, {"paperId": "e3194e071619132efde9efc6b368be80b5bece3b", "title": "Ancient thangka Buddha face recognition based on the Dlib machine learning library and comparison with secular aesthetics"}, {"paperId": "d114a7e100a56262a6bed9cc8defd21bbf2db337", "title": "Haptic Recognition of Texture Surfaces Using Semi-Supervised Feature Learning Based on Sparse Representation"}, {"paperId": "3f080253619833f3e7609ecd945720edae31dc7d", "title": "Deep Recurrent Regression with a Heatmap Coupling Module for Facial Landmarks Detection"}, {"paperId": "1da0804e127680178d25c812e803c570552642d5", "title": "Facial Recognition Technology: A Comprehensive Overview"}, {"paperId": "85747e4e4dd422dc0e1d1a0e4ff93cc1eb7677c5", "title": "A Review on Role of Image Processing Techniques to Enhancing Security of IoT Applications"}, {"paperId": "84c8cd1f0f639a637e70d191f5d6512cc68818e0", "title": "The impact of the weighting techniques on MultiMOORA-based ranking on patients using ambiguous medical data"}]}
