{"paperId": "dea6d3b0668a1eeeec3332b71d74b127e2007978", "publicationVenue": {"id": "2c8bc0de-2560-43f2-b4a9-de67ce6a3100", "name": "Logistics", "issn": "2305-6290", "alternate_issns": ["2768-4458"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-1047852", "alternate_urls": ["https://www.mdpi.com/journal/logistics", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-1047852", "https://www.jstor.org/journal/logistics"]}, "title": "Sustainable Supplier Selection through Multi-Criteria Decision Making (MCDM) Approach: A Bibliometric Analysis", "abstract": "Background: The primary objective of this study was to examine the advancements in sustainable supplier selection through multi-criteria decision making (MCDM) from the years 2013 to 2022. In the recent past, researchers have carried out a significant amount of research in this field over the course of several years; Methods: a total of 121 scientific publications sourced from the Scopus database were chosen for analysis, employing the bibliometric method and graphical visualization of the VOS viewer application to visually analyze and map research networks and collaboration patterns, aiding in the evaluation of scientific impact and knowledge dissemination; Results: the findings of this study indicate that the research trend in sustainable supplier selection through MCDM witnessed its most significant growth in the year 2019. Researchers predominantly disseminated their scientific findings through articles, accounting for 81% of the publications, followed by conference papers at 14%, and book chapters at 2.5%; Conclusions: the primary area of focus in these studies pertains to decision-making processes involved in sustainable supplier selection. The implications and theoretical contributions derived from this research, coupled with the latest advancements, serve as a foundation for further exploration and development of sustainable supplier selection research through MCDM.", "venue": "Logistics", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-08", "journal": {"name": "Logistics"}, "authors": [{"authorId": "2273427180", "name": "Khoiron Khulud"}, {"authorId": "152447020", "name": "I. Masudin"}, {"authorId": "101026186", "name": "Fien Zulfikarijah"}, {"authorId": "2082189006", "name": "D. Restuputri"}, {"authorId": "2271727489", "name": "Abdul Haris"}], "citations": []}
