{"paperId": "debe88eb17215e83e0de34638c1f32ab531f6ae1", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Mining Robust Default Configurations for Resource-constrained AutoML", "abstract": "Automatic machine learning (AutoML) is a key enabler of the mass deployment of the next generation of machine learning systems. A key desideratum for future ML systems is the automatic selection of models and hyperparameters. We present a novel method of selecting performant configurations for a given task by performing offline autoML and mining over a diverse set of tasks. By mining the training tasks, we can select a compact portfolio of configurations that perform well over a wide variety of tasks, as well as learn a strategy to select portfolio configurations for yet-unseen tasks. The algorithm runs in a zero-shot manner, that is without training any models online except the chosen one. In a compute- or time-constrained setting, this virtually instant selection is highly performant. Further, we show that our approach is effective for warm-starting existing autoML platforms. In both settings, we demonstrate an improvement on the state-of-the-art by testing over 62 classification and regression datasets. We also demonstrate the utility of recommending data-dependent default configurations that outperform widely used hand-crafted defaults.", "venue": "arXiv.org", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-02-20", "journal": {"name": "ArXiv", "volume": "abs/2202.09927"}, "authors": [{"authorId": "1619938751", "name": "Moe Kayali"}, {"authorId": "2116627318", "name": "Chi Wang"}], "citations": [{"paperId": "97d4145117462177e1244a99d7a25afed4c234f7", "title": "How Many Validation Labels Do You Need? Exploring the Design Space of Label-Efficient Model Ranking"}, {"paperId": "0b747528807d5b5d8edd24544bef6e61a23b2253", "title": "Automated Machine Learning & Tuning with FLAML"}]}
