{"paperId": "debe7bd55ee8eabd4267a267c711002961aaaa8a", "publicationVenue": {"id": "927f490e-9260-4c36-aefa-8f40657b4e8e", "name": "SLEEP Advances", "type": "journal", "alternate_names": ["SLEEP Adv"], "issn": "2632-5012", "url": "https://academic.oup.com/sleepadvances"}, "title": "Benefits and concerns of seeking and experiencing lucid dreams: benefits are tied to successful induction and dream control", "abstract": "Abstract Therapies focused on lucid dreaming could be useful for treating various sleep disorders and other conditions. Still, one major roadblock is the paucity of systematic information on the consequences of attempting these sorts of dreams. The current study sought to quantify positive and negative aspects of seeking lucid dreams, describe their phenomenology in detail, and identify features associated with positive or negative experiences. Observational data from a massive lucid-dream discussion forum were analyzed to capture lucid-dreaming themes. Forum posts were independently rated on multiple dimensions hypothesized to contribute to the valence of lucidity-related phenomena. Our results revealed that lucid dreams can end nightmares and prevent their recurrence, but they can also induce harrowing dysphoric dreams. The realization of dreaming (lucidity) and dreams with high-control were both associated with positive experiences. We translated our results into a process model that describes the progression from lucid dream induction to waking benefit, identifying potential areas of concern. Our results and model suggest that negative outcomes primarily result from failed induction attempts or lucid dreams with low dream control, and that successfully inducing high-control lucid dreams poses low risk for negative outcomes. Lucid dreaming has valuable therapeutic and recreational potential, but a better understanding of the risks is required. Our findings provide new insights into possible negative repercussions and how to avoid them in future applications.", "venue": "SLEEP Advances", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-09-07", "journal": {"name": "Sleep Advances: A Journal of the Sleep Research Society", "volume": "3"}, "authors": [{"authorId": "40833883", "name": "Remington Mallett"}, {"authorId": "2006377230", "name": "Laura Sowin"}, {"authorId": "2184415744", "name": "Rachel Raider"}, {"authorId": "122170655", "name": "Karen R. Konkoly"}, {"authorId": "2440481", "name": "K. Paller"}], "citations": [{"paperId": "55e3794b3547a1fdf8353815e333dac94ad95b45", "title": "Intentionally awakening from sleep through lucid dreaming"}, {"paperId": "1e750f7b05471c34c1b9466c3e386292c612ae72", "title": "Therapeutic Management of Nightmares: Practice Guide for Imagery Rehearsal Therapy (IRT)"}, {"paperId": "b3ec0eab52ac1c65a623a030a7166be9fe25f3dc", "title": "To be or not to be hallucinating: Implications of hypnagogic/hypnopompic experiences and lucid dreaming for brain disorders"}, {"paperId": "0822f1f831832676967eb61c2fd8f54fddab1e59", "title": "Dream Content Discovery from Reddit with an Unsupervised Mixed-Method Approach"}]}
