{"paperId": "debf0875ba3aef420e3c25e644a5436ebc077453", "publicationVenue": {"id": "e07422f9-c065-40c3-a37b-75e98dce79fe", "name": "The Web Conference", "type": "conference", "alternate_names": ["Web Conf", "WWW"], "url": "http://www.iw3c2.org/"}, "title": "Adaptive Low-level Storage of Very Large Knowledge Graphs", "abstract": "The increasing availability and usage of Knowledge Graphs (KGs) on the Web calls for scalable and general-purpose solutions to store this type of data structures. We propose Trident, a novel storage architecture for very large KGs on centralized systems. Trident uses several interlinked data structures to provide fast access to nodes and edges, with the physical storage changing depending on the topology of the graph to reduce the memory footprint. In contrast to single architectures designed for single tasks, our approach offers an interface with few low-level and general-purpose primitives that can be used to implement tasks like SPARQL query answering, reasoning, or graph analytics. Our experiments show that Trident can handle graphs with 1011 edges using inexpensive hardware, delivering competitive performance on multiple workloads.", "venue": "The Web Conference", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2020-01-24", "journal": {"name": "Proceedings of The Web Conference 2020"}, "authors": [{"authorId": "1915156", "name": "J. Urbani"}, {"authorId": "145219982", "name": "C. Jacobs"}], "citations": [{"paperId": "0ac38e0b61cc0a7f7f4b013391e2aab56954caca", "title": "EASC: An exception-aware semantic compression framework for real-world knowledge graphs"}, {"paperId": "5920390efd960139f547298fe263eaff15adeef5", "title": "Infrastructure tools to support an effective Radiation Oncology Learning Health System"}, {"paperId": "dd191437964b3b9f3bef0b7b8a7138a487efa297", "title": "Horn rule discovery with batched caching and rule identifier for proficient compressor of knowledge data"}, {"paperId": "52281d6445b9a1f119a49e39d68854206796d396", "title": "A design space for RDF data representations"}, {"paperId": "97674c7c4d83b0c7dc994512db11a436a4c91222", "title": "Knowledge graphs as tools for explainable machine learning: A survey"}, {"paperId": "3d11e0c373e9ef1118d3b1e838ea41c01aa3f7b4", "title": "Beyond NED: Fast and Effective Search Space Reduction for Complex Question Answering over Knowledge Bases"}, {"paperId": "7e1ce890f8d85ebea6ed0d8cef627fe376af3c9f", "title": "Materializing Knowledge Bases via Trigger Graphs"}, {"paperId": "f11c49b7e070722e1e465852275e107ef0eb28f1", "title": "Revisiting RDF storage layouts for efficient query answering"}, {"paperId": "58ad1c4940c7b8b5acbd165e2dc789d168ae2b3d", "title": "CLOCQ: A Toolkit for Fast and Easy Access to Knowledge Bases"}, {"paperId": "4d71d204ba026f7b2b5ed1af7e877957bf0824e4", "title": "Trident: An Adaptive Low-Level Database for Very Large Graphs"}]}
