{"paperId": "ded2d99b241bbfd51a40d27040cea29b72cbf235", "publicationVenue": null, "title": "PIR: A Domain Specific Language for Multimedia Information Retrieval", "abstract": "Multimedia Information Retrieval (MIR) is a problem domain that includes programming tasks such as salient feature extraction, machine learning, indexing, and retrieval. There are a variety of implementations and algorithms for these tasks in different languages and frameworks, which are difficult to compose and reuse due to the interface and language incompatibility. Due to this low reusability, researchers often have to implement their experiments from scratch and the resulting programs cannot be easily adapted to parallel and distributed executions, which is important for handling large data sets. In this paper, we present Pipeline Information Retrieval (PIR), a Domain Specific Language (DSL) for multi-modal feature manipulation. The goal of PIR is to unify the MIR programming tasks by hiding the programming details under a flexible layer of domain specific interface. PIR optimizes the MIR tasks by compiling the DSL programs into pipeline graphs, which can be executed using a variety of strategies (e.g. sequential, parallel, or distributed execution). The authors evaluated the performance of PIR applications on single machine with multiple cores, local cluster, and Amazon Elastic Compute Cloud (EC2) platform. The result shows that the PIR programs can greatly help MIR researchers and developers perform fast prototyping on single machine environment and achieve nice scalability on distributed platforms.", "venue": "Int. J. Multim. Data Eng. Manag.", "year": 2014, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2014-07-01", "journal": {"name": "Int. J. Multim. Data Eng. Manag.", "pages": "1-27", "volume": "5"}, "authors": [{"authorId": "2107911166", "name": "Xiaobing Huang"}, {"authorId": "46887776", "name": "Tian Zhao"}, {"authorId": "144149886", "name": "Yu Cao"}], "citations": [{"paperId": "e3f9feac8d20544422d80c06973227763952051f", "title": "Data Reliability-Aware and Cloud-Assisted Software Infrastructure for Body Area Networks"}, {"paperId": "555090e18677c1d3506ab7988ed2249f7f85d60a", "title": "The Role of Electronic Signature in the Third Millennium of the Development of International Trade Transactions"}, {"paperId": "81694afeff40f287c0813fda0b84aaf7c0f4c390", "title": "Virtualization Evolution: From IT Infrastructure Abstraction of Cloud Computing to Virtualization of Network Functions"}]}
