{"paperId": "dee8afd8dfa6c3c161542e337236dd41caa1f256", "publicationVenue": null, "title": "Juggler: Autonomous Cost Optimization and Performance Prediction of Big Data Applications", "abstract": "Distributed in-memory processing frameworks accelerate iterative workloads by caching suitable datasets in memory rather than recomputing them in each iteration. Selecting appropriate datasets to cache as well as allocating a suitable cluster configuration for caching these datasets play a crucial role in achieving optimal performance. In practice, both are tedious, time-consuming tasks and are often neglected by end users, who are typically not aware of workload semantics, sizes of intermediate data, and cluster specification. To address these problems, we present Juggler, an end-to-end framework, which autonomously selects appropriate datasets for caching and recommends a correspondingly suitable cluster configuration to end users, with the aim of achieving optimal execution time and cost. We evaluate Juggler on various iterative, real-world, machine learning applications. Compared with our baseline, Juggler reduces execution time to 25.1% and cost to 58.1%, on average, as a result of selecting suitable datasets for caching. It recommends optimal cluster configuration in 50% of cases and near-to-optimal configuration in the remaining cases. Moreover, Juggler achieves an average performance prediction accuracy of 90%.", "venue": "SIGMOD Conference", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2022-06-10", "journal": {"name": "Proceedings of the 2022 International Conference on Management of Data"}, "authors": [{"authorId": "1410629137", "name": "Hani Al-Sayeh"}, {"authorId": "2059708", "name": "Bunjamin Memishi"}, {"authorId": "1703869388", "name": "M. Jibril"}, {"authorId": "2587068", "name": "M. Paradies"}, {"authorId": "1716839", "name": "K. Sattler"}], "citations": [{"paperId": "15d49018dfc422080aacf2b787f64ae99893ed38", "title": "A Novel Multi-Task Performance Prediction Model for Spark"}, {"paperId": "12aacf568fc103fcbe9d0f3bfc0af4e4be530a26", "title": "Research on cloud native batch scheduler technology"}, {"paperId": "0f3b97eb980a9d4f07d606d5f483055e1ca178bd", "title": "Karasu: A Collaborative Approach to Efficient Cluster Configuration for Big Data Analytics"}, {"paperId": "e92469612a06a5d9b40e01103d7322fa2c55f64c", "title": "Smartpick: Workload Prediction for Serverless-enabled Scalable Data Analytics Systems"}, {"paperId": "742b3ede9a93f166e695ebedfc1bb060b60457ff", "title": "Selecting Efficient Cluster Resources for Data Analytics: When and How to Allocate for In-Memory Processing?"}, {"paperId": "6a9bfc08af212ca74c6546e3fa57efa7a0bd8d43", "title": "Perona: Robust Infrastructure Fingerprinting for Resource-Efficient Big Data Analytics"}, {"paperId": "23a6e0bd5ef9e9deeb0b939b1521b97dc54a0707", "title": "Ruya: Memory-Aware Iterative Optimization of Cluster Configurations for Big Data Processing"}, {"paperId": "a31dffc8d8a3099eb357f429d1bc9cdfbd609377", "title": "SparkCAD: Caching Anomalies Detector for Spark Applications"}, {"paperId": "a630e2526b37242864f8995c77f8af9bc86c9895", "title": "Blink: Lightweight Sample Runs for Cost Optimization of Big Data Applications"}]}
