{"paperId": "def13e123abeea4ecc210eee02cf141ce0646567", "publicationVenue": {"id": "406d9f60-417a-4dc5-a6b7-1fe4689a4ff7", "name": "IEEE International Conference on Cloud Computing", "type": "conference", "alternate_names": ["Int Conf Cloud Comput [services Soc", "CLOUD", "International Conference on Cloud Computing [Services Society]", "IEEE Int Conf Cloud Comput"]}, "title": "SODA: A Semantics-Aware Optimization Framework for Data-Intensive Applications Using Hybrid Program Analysis", "abstract": "In the era of data explosion, a growing number of data-intensive computing frameworks, such as Apache Hadoop and Spark, have been proposed to handle the massive volume of unstructured data in parallel. Since programming models provided by these frameworks allow users to specify complex and diversified user-defined functions (UDFs) with predefined operations, the grand challenge of tuning up entire system performance arises if programmers do not fully understand the semantics of code, data, and runtime systems. In this paper, we design a holistic semantics-aware (optimization for data-intensive applications using hybrid program analysis (SODA) to assist programmers to tune performance issues. SODA is a two-phase framework: the offline phase is a static analysis that analyzes code and performance profiling data from the online phase of prior executions to generate a parameterized and instrumented application; the online phase is a dynamic analysis that keeps track of the application's execution and collects runtime information of data and system. Extensive experimental results on four real-world Spark applications show that SODA can gain up to 60%, 10%, 8%, faster than its original implementation, with the three proposed optimization strategies, i.e., cache management, operation reordering, and element pruning, respectively.", "venue": "IEEE International Conference on Cloud Computing", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-07-24", "journal": {"name": "2021 IEEE 14th International Conference on Cloud Computing (CLOUD)", "pages": "433-444"}, "authors": [{"authorId": "2140497891", "name": "B. Rao"}, {"authorId": "2117941414", "name": "Zixia Liu"}, {"authorId": "2146243031", "name": "Hong Zhang"}, {"authorId": "24931961", "name": "Siyang Lu"}, {"authorId": "2155151623", "name": "Liqiang Wang"}], "citations": [{"paperId": "ba8ddba8dbaddbfbe3b59e2f5460144606d76c18", "title": "PolarisProfiler: A Novel Metadata-Based Profiling Approach for Optimizing Resource Management in the Edge-Cloud Continnum"}, {"paperId": "f903cc0fc8c6556e6db3743a7204417177886117", "title": "A brief survey on big data: technologies, terminologies and data-intensive applications"}]}
