{"paperId": "df06e79befe117b903a21285fdeaf4640003e369", "publicationVenue": null, "title": "International Journal of Innovative Technology and Exploring Engineering (IJITEE)", "abstract": "This document describes the design and development of a low-cost security system to detect unauthorized access of people in an office, using Arduino microcontroller technology. It used a passive infrared sensor (PIR) to detect movements of people, a Wi-Fi interface to send security alerts to the cloud platform and a GSM modem, in the same way, to send the detected security events to the frame of Cloud. The latter will be used if it is not possible to establish a link to the cloud platform, via the Wi-Fi interface. In addition, the security system sends an SMS (Short Message Service) directly to the security agent's mobile every time a security event is detected. A dual communication interface is used to guarantee the sending of alerts to the cloud platform and, on the other hand, to ensure the delivery of notifications of the alerts detected to the security agent, through the channels: Notify my device (NMD), email, Twitter and SMS. As a result, it has been obtained that the fastest interface to send the detected security alerts to the cloud platform is Wi-Fi and the channel with less time to notify the security agent is NMD. Therefore, this proposed security system represents an ideal solution for security problems, both level domestic and commercial, since it has characteristics of being pervasive, that is, it can be used anywhere and agnostic in so far as of the wireless interface Communication.", "venue": "", "year": 2019, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "65999231", "name": "E. Fama"}, {"authorId": "2127229805", "name": "S. A"}, {"authorId": "81003115", "name": "Shapkin"}, {"authorId": "2064113327", "name": "A. Abramov"}, {"authorId": "2054465797", "name": "R. Gibson"}, {"authorId": "2055008572", "name": "W."}, {"authorId": "2075696539", "name": "Sharpe"}, {"authorId": "102399840", "name": "Y. F. Kasimov"}, {"authorId": "2078919351", "name": "A. E. Khalikov"}], "citations": []}
